{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "unique_real_time_system"}, {"score": 0.004671342094877447, "phrase": "electronic_accompaniment"}, {"score": 0.004358903464536199, "phrase": "author's_opera"}, {"score": 0.00403221710768334, "phrase": "system's_functionality"}, {"score": 0.003894963476923956, "phrase": "current_research_perspective"}, {"score": 0.003665874747419775, "phrase": "voice_analysis"}, {"score": 0.003618558599449415, "phrase": "underlying_chord_structure"}, {"score": 0.0035564156572789473, "phrase": "computer_memory"}, {"score": 0.003510507340837656, "phrase": "chord_structure"}, {"score": 0.003465189575252443, "phrase": "primary_supportive_pitches"}, {"score": 0.0033909518548844047, "phrase": "notated_and_electronic_score"}, {"score": 0.0032471982781283374, "phrase": "tonal_'indicators"}, {"score": 0.0031502008922533894, "phrase": "computer-generated_note"}, {"score": 0.0028513785049061767, "phrase": "continuous_spectrum"}, {"score": 0.0027304365438083874, "phrase": "accompaniment_algorithm"}, {"score": 0.0025145641652082164, "phrase": "structural_intentions"}, {"score": 0.0024078737745407614, "phrase": "musical_and_expressive_efforts"}, {"score": 0.0021049977753042253, "phrase": "composer's_combined_computer_programming"}], "paper_keywords": [""], "paper_abstract": "A unique real time system for correlating a vocal, musical performance to an electronic accompaniment is presented. The system has been implemented and tested extensively in performance in the author's opera 'La Quintrala', and experience with its use in practice is presented. Furthermore, the system's functionality is outlined, it is put into current research perspective, and its possibilities for further development and other usages is discussed. The system correlates voice analysis to an underlying chord structure, stored in computer memory. This chord structure defines the primary supportive pitches, and links the notated and electronic score together, addressing the needs of the singer for tonal 'indicators' at any given moment. A computer-generated note is initiated by a combination of the singer - by the onset of a note, or by some element in the continuous spectrum of the singing - and the computer through an accompaniment algorithm. The evolution of this relationship between singer and computer is predefined in the application according to the structural intentions of the score, and is affected by the musical and expressive efforts of the singer. The combination of singer and computer influencing the execution of the accompaniment creates a dynamic, musical interplay between singer and computer, and is a very fertile musical area for a composer's combined computer programming and score writing.", "paper_title": "Unifying performer and accompaniment", "paper_id": "WOS:000237806800016"}