{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intelligent_space"}, {"score": 0.008353396555234118, "phrase": "controlled_agents"}, {"score": 0.004777744121315302, "phrase": "static_cameras"}, {"score": 0.004525190364108967, "phrase": "multiple_robots"}, {"score": 0.004336115760817672, "phrase": "fixed_positions"}, {"score": 0.0034217766191752628, "phrase": "proposed_solution"}, {"score": 0.0033559647822437298, "phrase": "mobile_agents"}, {"score": 0.003069112841132911, "phrase": "prior_knowledge"}, {"score": 0.003045355729156972, "phrase": "invasive_landmarks"}, {"score": 0.0029066143383279217, "phrase": "different_agents"}, {"score": 0.0025172781808293827, "phrase": "linear_velocity"}, {"score": 0.0024784363584530976, "phrase": "motion_segmentation_algorithm"}, {"score": 0.0023380300046435187, "phrase": "extended_particle_filter"}, {"score": 0.002319918823705175, "phrase": "classification_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-camera sensor", " Tracking", " Intelligent space", " 3D positioning", " Particle filter"], "paper_abstract": "This paper tackles the problem of identification and tracking of multiple robots in an intelligent space using an array of cameras placed in fixed positions within the environment. Several types of agent can be found in an intelligent space: controlled agents (mobile robots) and uncontrolled ones (users and obstacles). The information transferred between the controlled agents and the intelligent space is limited to the control commands sent to the robots and the measurements of the odometers received from the robots. The proposed solution allows the localization of mobile agents, even if they are not robots; however, we have focused on the controlled agents. The proposal does not require prior knowledge or invasive landmarks on board the robots. It starts from the segmentation of different agents in motion that allows obtaining the boundaries of all robots and an estimation of all 3D points that define those boundaries. Then, the identification of the robots is obtained by comparing the components of the linear velocity estimated by the motion segmentation algorithm and received from the odometers. In order to track the robots, an eXtended Particle Filter with Classification Process (XPFCP) is employed. Several experimental tests have been carried out, and the results obtained validate the proposal. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Identification and tracking of robots in an intelligent space using static cameras and an XPFCP", "paper_id": "WOS:000315754700001"}