{"auto_keywords": [{"score": 0.03057614792597447, "phrase": "search_costs"}, {"score": 0.00481495049065317, "phrase": "electronic_commerce"}, {"score": 0.004756233569671719, "phrase": "internet_and_related_technologies"}, {"score": 0.0044549056501745074, "phrase": "online_retailers"}, {"score": 0.004346874334971379, "phrase": "recommendation_tools"}, {"score": 0.0043114466990006334, "phrase": "consumers'_search_costs"}, {"score": 0.003908091457759849, "phrase": "large_number"}, {"score": 0.0036903962975894634, "phrase": "long_tail_sales_distribution_patterns"}, {"score": 0.0036156119373414067, "phrase": "increasing_demand"}, {"score": 0.003145609726536791, "phrase": "agent-based_simulation"}, {"score": 0.0030692309090066166, "phrase": "real_purchase_data"}, {"score": 0.0029824560656987855, "phrase": "demand_retailer"}, {"score": 0.0028627183712016894, "phrase": "improved_search_technology"}, {"score": 0.0024700078414481297, "phrase": "additional_consumption"}, {"score": 0.0024298350266697905, "phrase": "search_and_recommendation_technologies"}, {"score": 0.0023903140267755576, "phrase": "substantial_profit_increases"}, {"score": 0.00219311232069446, "phrase": "consumer_surplus"}, {"score": 0.0021049977753042253, "phrase": "competitive_advantage"}], "paper_keywords": ["Long tail phenomenon", " Search costs", " Search and recommendation systems", " Electronic commerce"], "paper_abstract": "The Internet and related technologies have vastly expanded the variety of products that can be profitably promoted and sold by online retailers. Furthermore, search and recommendation tools reduce consumers' search costs in the Internet and enable them to extend their search from a few easily found best-selling products (blockbusters) to a large number of less frequently selling items (niches). As a result, Long Tail sales distribution patterns emerge that illustrate an increasing demand in niches. We show in this article how different classes of search and recommendation tools affect the distribution of sales across products, total sales, and consumer surplus. We hereby use an agent-based simulation which is calibrated based on real purchase data of a video-on-demand retailer. We find that a decrease in search costs through improved search technology can either shift demand from blockbusters to niches (search filters and recommendation systems) or from niches to blockbusters (charts and top lists). We break down demand changes into substitution and additional consumption and show that search and recommendation technologies can lead to substantial profit increases for retailers. We also illustrate that decreasing search costs through search and recommendation technologies always lead to an increase in consumer surplus, suggesting that retailers can use these technologies as competitive advantage.", "paper_title": "The Impact of Search and Recommendation Systems on Sales in Electronic Commerce", "paper_id": "WOS:000277594600002"}