{"auto_keywords": [{"score": 0.035521489474373995, "phrase": "hio"}, {"score": 0.014976733780184727, "phrase": "unplanned_hospital_readmissions"}, {"score": 0.012370892112185113, "phrase": "semi-systematic_review"}, {"score": 0.008381322028635504, "phrase": "rrpm"}, {"score": 0.00481495049065317, "phrase": "health_information_exchange_data"}, {"score": 0.004651458073288542, "phrase": "annual_medicare_spending"}, {"score": 0.00455865160794147, "phrase": "multiple_models"}, {"score": 0.004391159805197013, "phrase": "insurance_claims"}, {"score": 0.0043659413776311485, "phrase": "administrative_data"}, {"score": 0.004205500128968766, "phrase": "rrpm_developers"}, {"score": 0.00415732498274046, "phrase": "electronic_health_records_data"}, {"score": 0.0040978781692373005, "phrase": "health_informatics_exchange_data"}, {"score": 0.003935892934907777, "phrase": "real-time_alerts"}, {"score": 0.0037477480589453295, "phrase": "predictive_factors"}, {"score": 0.0035995531116064395, "phrase": "significant_variables"}, {"score": 0.003388138265382678, "phrase": "health_information_exchange_organizations"}, {"score": 0.0028912667826416494, "phrase": "data_incompleteness"}, {"score": 0.0028090680055739203, "phrase": "unique_rrpms"}, {"score": 0.0027608716347791266, "phrase": "data_completeness"}, {"score": 0.0027449901369969495, "phrase": "exchanged_messages"}, {"score": 0.0026978902029158353, "phrase": "data_quality_standards"}, {"score": 0.0026060946618700416, "phrase": "real-time_rrpms"}, {"score": 0.0024670812720373114, "phrase": "useful_method"}, {"score": 0.002383120224166142, "phrase": "hio_data"}, {"score": 0.00232202561027509, "phrase": "clinical_information"}, {"score": 0.002282166507956957, "phrase": "actionable_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Health information exchange", " Hospital readmissions", " Health information organization", " Risk prediction model", " Health information technology"], "paper_abstract": "Introduction: Unplanned 30-day hospital readmission account for roughly $17 billion in annual Medicare spending. Many factors contribute to unplanned hospital readmissions and multiple models have been developed over the years to predict them. Most researchers have used insurance claims or administrative data to train and operationalize their Readmission Risk Prediction Models (RRPMs). Some RRPM developers have also used electronic health records data; however, using health informatics exchange data has been uncommon among such predictive models and can be beneficial in its ability to provide real-time alerts to providers at the point of care. Methods: We conducted a semi-systematic review of readmission predictive factors published prior to March 2013. Then, we extracted and merged all significant variables listed in those articles for RRPMs. Finally, we matched these variables with common HL7 messages transmitted by a sample of health information exchange organizations (HIO). Results: The semi-systematic review resulted in identification of 32 articles and 297 predictive variables. The mapping of these variables with common HL7 segments resulted in an 89.2% total coverage, with the DG1 (diagnosis) segment having the highest coverage of 39.4%. The PID (patient identification) and OBX (observation results) segments cover 13.9% and 9.1% of the variables. Evaluating the same coverage in three sample HIOs showed data incompleteness. Discussion: HIOs can utilize HL7 messages to develop unique RRPMs for their stakeholders; however, data completeness of exchanged messages should meet certain thresholds. If data quality standards are met by stakeholders, HIOs would be able to provide real-time RRPMs that not only predict intra-hospital readmissions but also inter-hospital cases. Conclusion: A RRPM derived using HIO data exchanged through may prove to be a useful method to prevent unplanned hospital readmissions. In order for the RRPM derived from HIO data to be effective, hospitals must actively exchange clinical information through the HIO and develop actionable methods that integrate into the workflow of providers to ensure that patients at high-risk for readmission receive the care they need. (C) 2015 Published by Elsevier Ireland Ltd.", "paper_title": "Feasibility of 30-day hospital readmission prediction modeling based on health information exchange data", "paper_id": "WOS:000363858100006"}