{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "monte_carlo"}, {"score": 0.044623380435940996, "phrase": "histogram_approximation"}, {"score": 0.004552981066668676, "phrase": "numerical_integration"}, {"score": 0.004398872331144531, "phrase": "compact_domain"}, {"score": 0.004361163586439822, "phrase": "monte_carlo_methods"}, {"score": 0.004106063237069123, "phrase": "integration_domain"}, {"score": 0.0033391018638565715, "phrase": "bin_parameters"}, {"score": 0.003212074324593725, "phrase": "monte_carlo_estimate"}, {"score": 0.0030109772626153797, "phrase": "student's_t-test"}, {"score": 0.002437525632451029, "phrase": "one-dimensional_histograms"}, {"score": 0.0022848092812445533, "phrase": "pedagogical_discussion"}, {"score": 0.002255431275670053, "phrase": "myriad_ways"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Numerical integration", " Monte Carlo", " PANIC"], "paper_abstract": "This paper investigates a class of algorithms for numerical integration of a function in d dimensions over a compact domain by Monte Carlo methods. We construct a histogram approximation to the function using a partition of the integration domain into a set of bins specified by some parameters. We then consider two adaptations: the first is to subtract the histogram approximation, whose integral we may easily evaluate explicitly, from the function and integrate the difference using Monte Carlo; the second is to modify the bin parameters in order to make the variance of the Monte Carlo estimate of the integral the same for all bins. This allows us to use Student's t-test as a trigger for rebinning, which we claim is more stable than the chi(2) test that is commonly used for this purpose. We provide a program that we have used to study the algorithm for the case where the histogram is represented as a product of one-dimensional histograms. We discuss the assumptions and approximations made, as well as giving a pedagogical discussion of the myriad ways in which the results of any such Monte Carlo integration program can be misleading. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Monte Carlo integration with subtraction", "paper_id": "WOS:000328725200019"}