{"auto_keywords": [{"score": 0.023801354442688594, "phrase": "coding_scheme"}, {"score": 0.00481495049065317, "phrase": "last_level_stt-ram_cache"}, {"score": 0.004656082803151484, "phrase": "stt-ram_technology"}, {"score": 0.004317450843594688, "phrase": "high_write"}, {"score": 0.004020185355794902, "phrase": "sram_cache"}, {"score": 0.0038711548651825917, "phrase": "novel_coding_scheme"}, {"score": 0.003838791650587681, "phrase": "stt-ram_last_level_cache"}, {"score": 0.003743310268453678, "phrase": "value_locality"}, {"score": 0.003589404014552974, "phrase": "common_patterns"}, {"score": 0.003559387846675818, "phrase": "limited_weight_codes"}, {"score": 0.0035296249474485552, "phrase": "lwc"}, {"score": 0.0031117775337824853, "phrase": "memory_cells"}, {"score": 0.002897283610433351, "phrase": "cell_reliability"}, {"score": 0.002813307389456184, "phrase": "cache_lines"}, {"score": 0.0025221012517852907, "phrase": "memory_hierarchy"}, {"score": 0.002158780936704905, "phrase": "main_memory"}], "paper_keywords": ["STT-RAM", " cache", " memory endurance", " write energy", " write hotspot", " nonvolatile memory", " limited weight code"], "paper_abstract": "STT-RAM technology has recently emerged as one of the most promising memory technologies. However, its major problems, limited write endurance and high write energy, are still preventing it from being used as a drop-in replacement of SRAM cache. In this paper, we propose a novel coding scheme for STT-RAM last level cache based on the concept of value locality. We reduce switching probability in cache by swapping common patterns with limited weight codes (LWC) to make writes less often as well as more uniform. We also define some policies for swapping these patterns. Our evaluation shows that bit write variance in memory cells can be reduced by about 20% on average resulting in a more uniform wear-out directly enhancing lifetime and improving cell reliability. In addition, writes in cache lines can be reduced by about 12% compared to one of the most effective circuit level techniques known as early write termination (EWT) [12]. Our method increases memory hierarchy access time by about 0.08% on average, which is negligible. We have shown that our method doesn't adversely affect last level cache energy-delay(2). The non-uniformity caused by the coding scheme can be used for another coding scheme at main memory or L1 cache depending on their technologies.", "paper_title": "Coding Last Level STT-RAM Cache For High Endurance And Low Power", "paper_id": "WOS:000346979300005"}