{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "skills-based_courses"}, {"score": 0.004645057834614705, "phrase": "enhanced_flexibility"}, {"score": 0.004553265070135597, "phrase": "blended-learning_approach"}, {"score": 0.004120694410890683, "phrase": "current_research"}, {"score": 0.003927848423072668, "phrase": "weboption_interface"}, {"score": 0.003804305595325308, "phrase": "students'_learning"}, {"score": 0.003729065012001509, "phrase": "calculus_courses"}, {"score": 0.003611751858608048, "phrase": "mathematical_proofs"}, {"score": 0.0031277316566463978, "phrase": "learning_contexts"}, {"score": 0.003005151718290603, "phrase": "prediction_students"}, {"score": 0.0027852927366010406, "phrase": "online_viewing"}, {"score": 0.0024802523752944536, "phrase": "different_learning_strategies"}, {"score": 0.002382987346529592, "phrase": "course_content"}, {"score": 0.0023171750718791713, "phrase": "pause_feature"}, {"score": 0.0022712795176156536, "phrase": "surface_strategy"}, {"score": 0.0021821915946356168, "phrase": "poorer_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distance education and telelearning", " Post-secondary education", " Media in education", " Applications in subject areas"], "paper_abstract": "At the University of Toronto at Scarborough. we provide enhanced flexibility to our students using a blended-learning approach (i e.. the webOption) whereby students can attend lectures live, watch them online at their convenience, or both. The current research examines the use of pause and seeks features afforded by the webOption interface and how these features are related to students' learning approaches and their performance in calculus courses. These courses emphasize the teaching of mathematical proofs; cognitive skills that are enhanced with practice (Schneider & Shiffrin. 1977) Access to online lectures allows students to re-experience the professor as they teach these skills. Given this, it was predicted that use of the webOption might be especially potent in these learning contexts The results we report here do not confirm that prediction Students do use and appreciate the features of the webOption, however. those students who augmented their class attendance with online viewing, and those who used the lecture-control features the most, were actually the students who performed most poorly. We interpreted the results to be due to different learning strategies and the manner in which these strategies interact with course content. Our results suggest that using the pause feature is related to a surface strategy of learning, which is in turn related to poorer performance in the course. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Online lecture accessibility and its influence on performance in skills-based courses", "paper_id": "WOS:000277110400032"}