{"auto_keywords": [{"score": 0.048646471286469505, "phrase": "pressure_cells"}, {"score": 0.04670675420350503, "phrase": "granular_material"}, {"score": 0.046166196857162826, "phrase": "silo_wall"}, {"score": 0.00481495049065317, "phrase": "plate-type_normal_pressure_cells"}, {"score": 0.0045726187330434025, "phrase": "silo_research"}, {"score": 0.004355645393953418, "phrase": "normal_pressure_cells"}, {"score": 0.004289966839994858, "phrase": "experimental_silo_research_project"}, {"score": 0.004212453011596424, "phrase": "measuring_errors"}, {"score": 0.003685067218455088, "phrase": "specific_plate-type_normal_pressure_cell"}, {"score": 0.003394571753283408, "phrase": "silo_research_project"}, {"score": 0.0031269043024513567, "phrase": "solid_basis"}, {"score": 0.003070340620983981, "phrase": "pressure_measurements"}, {"score": 0.0030424424705823455, "phrase": "silo_installation"}, {"score": 0.0029874020705125356, "phrase": "calibration_results"}, {"score": 0.0029066973917258655, "phrase": "finite_element_analysis"}, {"score": 0.0028802818629647614, "phrase": "plate_deflection"}, {"score": 0.0028541057064952876, "phrase": "pressure_cell"}, {"score": 0.0027939468213968683, "phrase": "non-linear_behaviour"}, {"score": 0.0026937446571204653, "phrase": "air-pressure_calibration_method"}, {"score": 0.0026129863248033807, "phrase": "particular_case"}, {"score": 0.0025423706961391034, "phrase": "plate_cell"}, {"score": 0.0023063614119692476, "phrase": "plate-type_cells"}, {"score": 0.002163491500079535, "phrase": "test_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Normal pressure cell", " Plate-type", " Silo", " Calibration methods", " Measuring error", " Stiffness"], "paper_abstract": "Pressure cells are measuring devices commonly used in silo research to study loads exerted by a granular material stored against a silo wall. The design of normal pressure cells for use in an experimental silo research project is critical, mainly because measuring errors complicate the interpretation of results. Once the cells have been delivered from the manufacturer to the researcher, they should be calibrated and validated with reference to the measurement of pressure from a granular material against a silo wall. Two related papers deal with a specific plate-type normal pressure cell for use in an installation of three full-scale steel silos with different hopper eccentricities (concentric, half-eccentric and full-eccentric) as part of a silo research project. It was found to be necessary to validate the performance of the cells when measuring pressures in the silos in order to arrive at a solid basis for the interpretation of the pressure measurements in the silo installation aforementioned. This paper presents calibration results from three investigated methods as well as results from a finite element analysis of the plate deflection of the pressure cell which were performed to evaluate the non-linear behaviour of the signal from the cell. Results suggested that the air-pressure calibration method turned out to be the most suitable in this particular case, that a lack of stiffness of the plate cell was revealed and that its boundary constraint conditions were not stable. Amendments were proposed in order to improve the accuracy of measurements. Furthermore, the knowledge acquired from the study of these plate-type cells constitutes the basis of recommendations for another design of pressure cells for which the calibration as well as the interpretations of test results would become simpler. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "On the use of plate-type normal pressure cells in silos Part 1: Calibration and evaluation", "paper_id": "WOS:000275585100009"}