{"auto_keywords": [{"score": 0.03588852397931544, "phrase": "dpc"}, {"score": 0.015719636841992974, "phrase": "half-duplex_gaussian_parallel_relay_channel"}, {"score": 0.014752153347563345, "phrase": "gaussian"}, {"score": 0.004367973309172735, "phrase": "direct_link"}, {"score": 0.003794297119656863, "phrase": "simultaneous_relaying_protocol"}, {"score": 0.003699579190650754, "phrase": "common_message"}, {"score": 0.003529880686744397, "phrase": "successive_relaying_protocol"}, {"score": 0.0032601856292942106, "phrase": "block_markov_encoding"}, {"score": 0.0031672925196105663, "phrase": "composite_scheme"}, {"score": 0.0028832306043717637, "phrase": "cooperative_and_non-cooperative_schemes"}, {"score": 0.002811191663575046, "phrase": "simultaneous-successive_relaying"}, {"score": 0.0027808699346360656, "phrase": "dirty_paper_coding_scheme"}, {"score": 0.0026918477311176376, "phrase": "optimum_scheduling"}, {"score": 0.002577557228072987, "phrase": "low_and_high_signal-to-noise_ratio"}, {"score": 0.0024770482478966896, "phrase": "low_snr_scenario"}, {"score": 0.002337791830793841, "phrase": "achievable_rate"}, {"score": 0.0023125643872311994, "phrase": "simultaneous_relaying"}, {"score": 0.0022876105961268565, "phrase": "bcm"}, {"score": 0.0021049977753042253, "phrase": "successive_relaying"}], "paper_keywords": ["Block Markov Encoding (BME)", " Dirty Paper Coding (DPC)", " parallel relay channel", " relay scheduling", " simultaneous relaying", " successive relaying"], "paper_abstract": "This study investigates the problem of communication for a network composed of two half-duplex parallel relays with additive white Gaussian noise (AWGN). There is no direct link between the source and the destination. However, the relays can communicate with each other through the channel between them. Two protocols, i.e., simultaneous and successive relaying, associated with two possible relay schedulings are proposed. The simultaneous relaying protocol is based on the Broadcast-Multiaccess with Common Message (BCM) scheme considered in [34]. For the successive relaying protocol: (i) a non-cooperative scheme based on the Dirty Paper Coding (DPC) and (ii) a cooperative scheme based on the Block Markov Encoding (BME) are considered. The composite scheme of employing BME in at most one relay and DPC in at least another one is also proposed. It is proved that this scheme achieves at least the same rate when compared to the cooperative and non-cooperative schemes for the Gaussian case. A Simultaneous-Successive Relaying based on Dirty Paper Coding scheme (SSRD) is also proposed. The optimum scheduling of the relays, and hence the capacity of the half-duplex Gaussian parallel relay channel in the low and high signal-to-noise ratio (SNR) scenarios, is derived. In the low SNR scenario, it is revealed that under certain conditions for the channel coefficients the ratio of the achievable rate of the simultaneous relaying based on BCM to the cut-set bound tends to be 1. On the other hand, as SNR goes to infinity it is proved that successive relaying, based on the DPC, asymptotically achieves the capacity of the network.", "paper_title": "Relay Scheduling in the Half-Duplex Gaussian Parallel Relay Channel", "paper_id": "WOS:000277880200015"}