{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "objective_medication-indication_information"}, {"score": 0.004591202593942391, "phrase": "decision_support"}, {"score": 0.0045124316982387315, "phrase": "appropriate_use"}, {"score": 0.004014800383343256, "phrase": "unstructured_form"}, {"score": 0.0038613835226952117, "phrase": "public_knowledge_bases"}, {"score": 0.0037786899855446, "phrase": "structured_medication-indication_information"}, {"score": 0.003634262647873338, "phrase": "direct_comparison"}, {"score": 0.0033909518548844047, "phrase": "systematic_review"}, {"score": 0.0032896745636186824, "phrase": "medication-indication_kbs"}, {"score": 0.00308269056870936, "phrase": "complex_indication_information"}, {"score": 0.002990592465417758, "phrase": "medication-indication_data"}, {"score": 0.002802373595203129, "phrase": "on-_or_off-label_indications"}, {"score": 0.002266051712795851, "phrase": "first_study"}, {"score": 0.002236762786982225, "phrase": "public_kbs"}, {"score": 0.0022174469839432013, "phrase": "medication_indications"}, {"score": 0.0021511430180912164, "phrase": "existing_resources"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["drug therapy", " off-label use", " indication", " appropriateness", " electronic health records"], "paper_abstract": "Objective Medication-indication information is a key part of the information needed for providing decision support for and promoting appropriate use of medications. However, this information is not readily available to end users, and a lot of the resources only contain this information in unstructured form (free text). A number of public knowledge bases (KBs) containing structured medication-indication information have been developed over the years, but a direct comparison of these resources has not yet been conducted. Material and Methods We conducted a systematic review of the literature to identify all medication-indication KBs and critically appraised these resources in terms of their scope as well as their support for complex indication information. Results We identified 7 KBs containing medication-indication data. They notably differed from each other in terms of their scope, coverage for on- or off-label indications, source of information, and choice of terminologies for representing the knowledge. The majority of KBs had issues with granularity of the indications as well as with representing duration of therapy, primary choice of treatment, and comedications or comorbidities. Discussion and Conclusion This is the first study directly comparing public KBs of medication indications. We identified several gaps in the existing resources, which can motivate future research.", "paper_title": "Medication-indication knowledge bases: a systematic review and critical appraisal", "paper_id": "WOS:000373722400024"}