{"auto_keywords": [{"score": 0.037396631279050345, "phrase": "weno_methods"}, {"score": 0.00481495049065317, "phrase": "adaptive_nonlinear_hybridizations"}, {"score": 0.004638602678192715, "phrase": "wide_variety"}, {"score": 0.00458940888106061, "phrase": "high-resolution_methods"}, {"score": 0.004327981760540394, "phrase": "complementary_set"}, {"score": 0.0038900900632631587, "phrase": "godunov"}, {"score": 0.003314591878914152, "phrase": "relative_efficiency"}, {"score": 0.0031255543155487234, "phrase": "relatively_inexpensive_godunov_methods"}, {"score": 0.0029630461161780203, "phrase": "bounding_principle"}, {"score": 0.002794001681064862, "phrase": "essential_aspect"}, {"score": 0.0026914710445743693, "phrase": "high-order_accurate_approximations"}, {"score": 0.0025243592424524764, "phrase": "end_result"}, {"score": 0.0022324489895237504, "phrase": "quantitative_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "The last 20 years have seen a wide variety of high-resolution methods that can compute sharp, oscillation-free compressible flows. Here, we combine a complementary set of these methods together in a nonlinear (hybridized) fashion. Our base method is built on a monotone high-resolution Godunov method, the piece-wise parabolic method (PPM). PPM is combined with WENO methods, which reduce the damping of extrema. We find that the relative efficiency of the WENO methods is enhanced by coupling them with the relatively inexpensive Godunov methods. We accomplish our hybridizations through the use of a bounding principle: the approximation used is bounded by two nonlinearly stable approximations. The essential aspect of the method is to have high-order accurate approximations bounded by two nonoscillatory (nonlinearly stable) approximations. The end result is an accuracy-, monotonicity- and extrema-preserving method. These methods are demonstrated on a variety of flows, with quantitative analysis of the solutions with shocks. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Accurate monotonicity- and extrema-preserving methods through adaptive nonlinear hybridizations", "paper_id": "WOS:000255304500032"}