{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "complex_networks"}, {"score": 0.04957466661795797, "phrase": "spectral_optimization"}, {"score": 0.043226782433942644, "phrase": "modular_structure"}, {"score": 0.029117950968461447, "phrase": "standard_modularity"}, {"score": 0.004494570360108983, "phrase": "major_importance"}, {"score": 0.004021267064832957, "phrase": "quality_function"}, {"score": 0.003753498345597498, "phrase": "topological_modules"}, {"score": 0.0037139103792217143, "phrase": "functional_groups"}, {"score": 0.0031176485976102688, "phrase": "specific_meaning"}, {"score": 0.002863921785266393, "phrase": "building_blocks"}, {"score": 0.0021731423856364003, "phrase": "classical_modularity_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Complex networks", " Communities", " Triangle modularity", " Spectral optimization"], "paper_abstract": "The study of the sub-structure of complex networks is of major importance to relate topology and functionality. Many efforts have been devoted to the analysis of the modular structure of networks using the quality function known as modularity. However, generally speaking, the relation between topological modules and functional groups is still unknown, and depends on the semantic of the links. Sometimes, we know in advance that many connections are transitive, and as a consequence, triangles have a specific meaning. Here we propose the study of the modular structure of networks considering triangles as the building blocks of modules. The method generalizes the standard modularity and uses spectral optimization to find its maximum. We compare the partitions obtained with those resulting from the optimization of the standard modularity in several real networks. The results show that the information reported by the analysis of modules of triangles complements the information of the classical modularity analysis. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Detecting communities of triangles in complex networks using spectral optimization", "paper_id": "WOS:000288298100004"}