{"auto_keywords": [{"score": 0.04306043741334064, "phrase": "non-convex_constraints"}, {"score": 0.038914316772824434, "phrase": "unknown_nodes"}, {"score": 0.00481495049065317, "phrase": "connectivity-based_sensor_network_localization"}, {"score": 0.004503525064934708, "phrase": "non-convex_optimization_problem"}, {"score": 0.004334657104697421, "phrase": "actual_problem"}, {"score": 0.004212157020917929, "phrase": "optimization_problem"}, {"score": 0.004054169947971483, "phrase": "two-objective_evolutionary_algorithm"}, {"score": 0.0038834787946979863, "phrase": "convex_constraints"}, {"score": 0.003809932244103758, "phrase": "starting_point"}, {"score": 0.003413183361838603, "phrase": "final_solution"}, {"score": 0.0029711052657054463, "phrase": "current_models"}, {"score": 0.0023840346303791032, "phrase": "simulation_results"}, {"score": 0.0023388183537341213, "phrase": "better_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor network", " Localization", " Connectivity", " Evolutionary algorithm", " Genetic algorithm", " Non-convex constraints"], "paper_abstract": "The sensor network localization based on connectivity can be modeled as a non-convex optimization problem. It can be argued that the actual problem should be represented as an optimization problem with both convex and non-convex constraints. A two-objective evolutionary algorithm is proposed which utilizes the result of all convex constraints to provide a starting point on the location of the unknown nodes and then searches for a solution to satisfy all the convex and non-convex constraints of the problem. The final solution can reach the most suitable configuration of the unknown nodes because all the information on the constraints (convex and non-convex) related to connectivity have been used. Compared with current models that only consider the nodes that have connections, this method considers not only the connection constraints, but also the disconnection constraints. As a MOEA (Multi-Objective Evolution Algorithm), PAES (Pareto Archived Evolution Strategy) is used to solve the problem. Simulation results have shown that better solution can be obtained through the use of this method when compared with those produced by other methods. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Evolutionary approach on connectivity-based sensor network localization", "paper_id": "WOS:000338706600004"}