{"auto_keywords": [{"score": 0.04646703257958644, "phrase": "information_technology"}, {"score": 0.00481495049065317, "phrase": "location-based_services"}, {"score": 0.004318881178805575, "phrase": "anxious_sense"}, {"score": 0.004063664475797303, "phrase": "person's_state"}, {"score": 0.003941746077126688, "phrase": "research_studies"}, {"score": 0.0035974243349266894, "phrase": "negative_influence"}, {"score": 0.0030092017034068666, "phrase": "one's_personality"}, {"score": 0.002931569771634119, "phrase": "so-called_'big_five'_personality_traits"}, {"score": 0.002675252546913683, "phrase": "privacy_concerns"}, {"score": 0.002652039172817654, "phrase": "protection_motivation_theory"}, {"score": 0.002516917671182532, "phrase": "emerging_pervasive_technology"}, {"score": 0.0024201029474586007, "phrase": "survey-based_approach"}, {"score": 0.002257070536352418, "phrase": "cfp."}, {"score": 0.0021049977753042253, "phrase": "highly_personalized_new_technologies"}], "paper_keywords": ["privacy", " concern for privacy", " personality traits", " location-based services", " protection motivation theory", " Big Five"], "paper_abstract": "For more than a century, concern for privacy (CFP) has co-evolved with advances in information technology. The CFP refers to the anxious sense of interest that a person has because of various types of threats to the person's state of being free from intrusion. Research studies have validated this concept and identified its consequences. For example, research has shown that the CFP can have a negative influence on the adoption of information technology; but little is known about factors likely to influence such concern. This paper attempts to fill that gap. Because privacy is said to be a part of a more general 'right to one's personality', we consider the so-called 'Big Five' personality traits (agreeableness, extraversion, emotional stability, openness to experience, and conscientiousness) as factors that can influence privacy concerns. Protection motivation theory helps us to explain this influence in the context of an emerging pervasive technology: location-based services. Using a survey-based approach, we find that agreeableness, conscientiousness, and openness to experience each affect the CFP. These results have implications for the adoption, the design, and the marketing of highly personalized new technologies.", "paper_title": "Personality traits and concern for privacy: an empirical study in the context of location-based services", "paper_id": "WOS:000260470100008"}