{"auto_keywords": [{"score": 0.04459389785449592, "phrase": "project_managers"}, {"score": 0.015719716506582538, "phrase": "project_management"}, {"score": 0.015549374165544813, "phrase": "software_development"}, {"score": 0.012364308090665455, "phrase": "empirical_study"}, {"score": 0.004684157900507474, "phrase": "changing_environments"}, {"score": 0.004312622975366672, "phrase": "matching_changes"}, {"score": 0.003440166097491567, "phrase": "software_development_projects"}, {"score": 0.002851790448644913, "phrase": "structured_interview"}, {"score": 0.0024842242921857705, "phrase": "multiple_mechanisms"}, {"score": 0.0024434201175883674, "phrase": "project_management_objectives"}, {"score": 0.0023507916951658455, "phrase": "multiple_objectives"}, {"score": 0.0021049977753042253, "phrase": "specific_project_management_mechanisms"}], "paper_keywords": ["Software development", " Project management", " Project monitoring", " Project control", " Project coordination", " Empirical study"], "paper_abstract": "The changing environments of software development such as component-based, distributed and outsourced software development require matching changes by project managers to monitor, control and coordinate their projects. While the objectives of project management may be well established, the mechanisms with which those objectives are achieved are less well known. An empirical study was undertaken to investigate which mechanisms were used by practising project managers to monitor, control and coordinate software development projects. First, the types of mechanisms are discussed so that the mechanisms can be classified usefully. Then, the design of the empirical study is described. The data were collected through structured interview, which provided both quantitative and qualitative data. The data are analysed for each mechanism separately and the findings presented. The study found that project managers use multiple mechanisms to achieve project management objectives and use the same mechanism to serve multiple objectives. Further research is suggested to investigate project management from the opposite orientation, that is, which objectives are served by specific project management mechanisms. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "The mechanisms of project management of software development", "paper_id": "WOS:000261119800021"}