{"auto_keywords": [{"score": 0.02481281921260711, "phrase": "amino_acid"}, {"score": 0.00481495049065317, "phrase": "ion_peak_intensity"}, {"score": 0.004425616928975799, "phrase": "mass_spectrum"}, {"score": 0.0041136473765874815, "phrase": "database-searching_approach"}, {"score": 0.003888659470009222, "phrase": "corresponding_sequences"}, {"score": 0.0036966717141736355, "phrase": "exact_identification"}, {"score": 0.00345530020388352, "phrase": "de_novo_sequencing"}, {"score": 0.0033974527047473044, "phrase": "preliminary_information"}, {"score": 0.0028695095228791724, "phrase": "amino_acids"}, {"score": 0.002805597755796506, "phrase": "actual_spectrum"}, {"score": 0.002535115422089855, "phrase": "amino_acid_cleavage_intensity_ratio"}, {"score": 0.0023827927890399357, "phrase": "undetectable_amino_acid_peak_intervals"}, {"score": 0.0022522565004588113, "phrase": "peak_expression"}, {"score": 0.0022020629288583998, "phrase": "cir."}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": [""], "paper_abstract": "Motivation: Peptide-sequencing methods by mass spectrum use the following two approaches: database searching and de novo sequencing. The database-searching approach is convenient; however, in cases wherein the corresponding sequences are not included in the databases, the exact identification is difficult. On the other hand, in the case of de novo sequencing, no preliminary information is necessary; however, continuous amino acid sequence peaks and the differentiation of these peaks are required. It is, however, very difficult to obtain and differentiate the peaks of all amino acids by using an actual spectrum. We propose a novel de novo sequencing approach using not only mass-to-charge ratio but also ion peak intensity and amino acid cleavage intensity ratio (CIR). Results: Our method compensates for any undetectable amino acid peak intervals by estimating the amino acid set and the probability of peak expression based on amino acid CIR. It provides more accurate identification of sequences than the existing methods, by which it is usually difficult to sequence.", "paper_title": "De novo peptide sequencing using ion peak intensity and amino acid cleavage intensity ratio", "paper_id": "WOS:000246773300004"}