{"auto_keywords": [{"score": 0.035395086221830914, "phrase": "fuzzy_information_granulations"}, {"score": 0.00481495049065317, "phrase": "fuzzy_information"}, {"score": 0.004421471944783611, "phrase": "crucial_role"}, {"score": 0.003852371777780562, "phrase": "finer_or_coarser_relationships"}, {"score": 0.003607630811220324, "phrase": "crisp_binary_relations"}, {"score": 0.003468287913322255, "phrase": "existing_results"}, {"score": 0.003269266730193333, "phrase": "fuzzy_binary_relations"}, {"score": 0.00270221723573854, "phrase": "global_and_local_knowledge_distances"}, {"score": 0.002480961181275199, "phrase": "knowledge_distance_lattices"}, {"score": 0.0023850311572318496, "phrase": "derived_partial_orderings"}, {"score": 0.0021610874773389096, "phrase": "theoretical_results"}], "paper_keywords": ["Fuzzy information granulation", " granular computing", " hierarchy", " knowledge distance", " ordering"], "paper_abstract": "Hierarchy plays a crucial role in the development of the granular computing(GrC). Presently, a lot of hierarchies have been studied for characterizing the finer or coarser relationships among information granulations, which are derived from the crisp binary relations. To further improve the existing results, not only the fuzzy information granulations derived from the fuzzy binary relations are presented in this paper, but also the three orderings are explored for expressing the hierarchies on fuzzy information granulations. Furthermore, we also introduce the concepts of the global and local knowledge distances into fuzzy information granulations, which can be used to construct the knowledge distance lattices. It shows that the derived partial orderings through those lattices are corresponding to the three different hierarchies on fuzzy information granulations, respectively. The theoretical results provide us a more comprehensible perspective for the study of granular computing(GrC).", "paper_title": "Hierarchies on fuzzy information granulations: A knowledge distance based lattice approach", "paper_id": "WOS:000341926700004"}