{"auto_keywords": [{"score": 0.04261473069169673, "phrase": "solid_model"}, {"score": 0.01060805367826849, "phrase": "geometric_features"}, {"score": 0.007740489563401452, "phrase": "initial_hexahedral_element_mesh"}, {"score": 0.0076188350729344875, "phrase": "finite_element_analysis"}, {"score": 0.005190021742461495, "phrase": "indention_mesh"}, {"score": 0.004649552749844436, "phrase": "complex_geometric_features"}, {"score": 0.0045328270272981825, "phrase": "curved_surfaces"}, {"score": 0.004461359547152617, "phrase": "exact_description"}, {"score": 0.004199866682506738, "phrase": "adaptive_generation"}, {"score": 0.003991539512905838, "phrase": "modified_grid-based_method"}, {"score": 0.003928572641266562, "phrase": "new_geometry-adaptive_hexahedral_mesh_generation_method_and_a_new_mesh_boundary_matching_method"}, {"score": 0.003437248394635138, "phrase": "initial_indention_mesh"}, {"score": 0.003287482882222731, "phrase": "even-odd_rule"}, {"score": 0.0028397103530211415, "phrase": "closest_position"}, {"score": 0.002750721367040336, "phrase": "accurate_match"}, {"score": 0.002724570996888123, "phrase": "threading_method"}, {"score": 0.00247632489362785, "phrase": "geometry-adaptive_mesh"}, {"score": 0.002444977075259825, "phrase": "recurrent_search_process"}, {"score": 0.002429451930463481, "phrase": "characteristic_boundary_nodes"}, {"score": 0.0024063484128685367, "phrase": "closest_position_tracing_method"}, {"score": 0.0023532890136269986, "phrase": "finite_element"}, {"score": 0.0023458049872325214, "phrase": "mesh_generation"}, {"score": 0.0022292394795878643, "phrase": "geometry-adaptive_hexahedral_mesh_generation"}, {"score": 0.002208035721125305, "phrase": "typical_three-dimensional_solid_model"}, {"score": 0.0021049977753042253, "phrase": "complex_solid_models"}], "paper_keywords": ["hexahedral element mesh", " geometry-adaptive", " threading method", " boundary match", " modified grid-based method"], "paper_abstract": "The models for finite element analysis usually have a number of complex geometric features such as holes, slots, and curved surfaces, etc. The exact description of these features is crucial to the accuracy of finite element analysis. This paper presents an algorithm for the adaptive generation of the initial hexahedral element mesh based on the geometric features of the solid model. This algorithm is a modified grid-based method, in which a new geometry-adaptive hexahedral mesh generation method and a new mesh boundary matching method called threading method are established and employed. Firstly, an initial grid structure, which is uniformly sized or locally refined and encompasses the solid model completely, is generated based on the geometric features of the solid model. Then, an initial indention mesh is generated after removing all the elements in the exterior of the solid model using the even-odd rule. The surface of the indention mesh, which is adaptively generated based on the geometric features, is so complicated and different in size that the match of the edges and surface to the surface of the solid model becomes inconvenient. In this case, the closest position tracing approach used widely is difficult to realize an accurate match. The threading method proposed in this paper can accurately match the boundaries of the indention mesh to the boundaries of the solid model. Especially, it is fit for the generation of the geometry-adaptive mesh and avoids the recurrent search process of characteristic boundary nodes in the closest position tracing method. So the efficiency of the finite element mesh generation is enhanced remarkably. The principles and procedures of the algorithm are illustrated through the geometry-adaptive hexahedral mesh generation of a typical three-dimensional solid model. The effectiveness and robustness of the algorithm are tested by several applications in the complex solid models.", "paper_title": "Geometry-adaptive generation algorithm and boundary match method for initial hexahedral element mesh", "paper_id": "WOS:000257487600001"}