{"auto_keywords": [{"score": 0.04180609886778986, "phrase": "hamiltonian"}, {"score": 0.00481495049065317, "phrase": "simplest_quantum_adiabatic_algorithm"}, {"score": 0.004586531354697466, "phrase": "random_clauses"}, {"score": 0.004238134740341528, "phrase": "single_additional_clause"}, {"score": 0.0038453138708790385, "phrase": "substantial_probability"}, {"score": 0.003775803846431323, "phrase": "adiabatic_path"}, {"score": 0.0035530197642369464, "phrase": "quantum_adiabatic_algorithm"}, {"score": 0.0029965060407413898, "phrase": "random_instance"}, {"score": 0.002802462902794585, "phrase": "particular_set"}, {"score": 0.0026209522797963447, "phrase": "exponential_number"}, {"score": 0.0025892330566358503, "phrase": "disparate_assignments"}, {"score": 0.002466139325703204, "phrase": "continuous_imaginary_time_quantum_monte_carlo_algorithm"}, {"score": 0.0023346234464901978, "phrase": "ground_state"}, {"score": 0.002264607102799332, "phrase": "first_excited_state"}, {"score": 0.0021569129153653777, "phrase": "quantum_monte_carlo_data"}], "paper_keywords": [""], "paper_abstract": "We construct a set of instances of 3SAT which are not solved efficiently using the simplest quantum adiabatic algorithm. These instances are obtained by picking random clauses all consistent with two disparate planted solutions and then penalizing one of them with a single additional clause. We argue that by randomly modifying the beginning Hamiltonian, one obtains (with substantial probability) an adiabatic path that removes this difficulty. This suggests that the quantum adiabatic algorithm should in general be run on each instance with many different random paths leading to the problem Hamiltonian. We do not know whether this trick will help for a random instance of 3SAT (as opposed to an instance from the particular set we consider), especially if the instance has an exponential number of disparate assignments that violate few clauses. We use a continuous imaginary time Quantum Monte Carlo algorithm in a novel way to numerically investigate the ground state as well as the first excited state of our system. Our arguments are supplemented by Quantum Monte Carlo data from simulations with up to 150 spins.", "paper_title": "QUANTUM ADIABATIC ALGORITHMS, SMALL GAPS, AND DIFFERENT PATHS", "paper_id": "WOS:000286868100001"}