{"auto_keywords": [{"score": 0.013693890295176826, "phrase": "different_countries"}, {"score": 0.00481495049065317, "phrase": "web_site_visiting"}, {"score": 0.004024863549087511, "phrase": "prior_research"}, {"score": 0.0038102613924627647, "phrase": "systematic_way"}, {"score": 0.003121636289442593, "phrase": "commonality_index"}, {"score": 0.0030296432347510687, "phrase": "web_site"}, {"score": 0.0029403531729828574, "phrase": "cross-country_study"}, {"score": 0.00286795254228461, "phrase": "large-scale_empirical_study"}, {"score": 0.0025827837420330816, "phrase": "internet_users"}, {"score": 0.0025066304722422463, "phrase": "common_language"}, {"score": 0.002444883254621769, "phrase": "social_norms"}, {"score": 0.0023846534541336326, "phrase": "similar_level"}, {"score": 0.0023609780669713288, "phrase": "economic_development"}, {"score": 0.002126111716875144, "phrase": "individual-level_information_behavior"}, {"score": 0.0021049977753042253, "phrase": "macrolevel_internet_traffic_metrics"}], "paper_keywords": [""], "paper_abstract": "Although the role the Internet plays in globalization has been widely discussed, relatively little is known about the extent to which users in different countries visit the same Web sites. Surprisingly, no prior research in the literature has empirically addressed this topic in a systematic way. Based on the theory of life in the round and related concepts of information behavior, this article reports an attempt to fill the gap by looking at how cultural, geodemographical, and economic factors underpin the extent which people from different countries visit the same Web sites. A commonality index to measure the commonality of Web site visiting for the macrolevel, cross-country study is proposed for a large-scale empirical study using online panel data that cover 101 countries. Results from the analyses indicate that as cyberspace is obviously fractured, Internet users in countries that share a common language, religion, and social norms, that have a similar level of economic development, and that are physically nearer to one another are more likely to visit the same Web sites. The relationship between individual-level information behavior and macrolevel Internet traffic metrics is established; the former helps explain the [after whereas the latter enriches the former.", "paper_title": "Commonality of Web Site Visiting Among Countries", "paper_id": "WOS:000266303800008"}