{"auto_keywords": [{"score": 0.004761132425263795, "phrase": "enterprise_information_systems_project_selection"}, {"score": 0.004603244077348199, "phrase": "emerging_computation_technologies"}, {"score": 0.004090577229368418, "phrase": "leading_eis"}, {"score": 0.00345530020388352, "phrase": "desired_outcomes"}, {"score": 0.0034166271604770576, "phrase": "inappropriate_software"}, {"score": 0.003284637361174143, "phrase": "major_sources"}, {"score": 0.003247868216333148, "phrase": "project_failures"}, {"score": 0.003140004304719746, "phrase": "eis_selection_problem"}, {"score": 0.003070086433952691, "phrase": "multicriteria_decision"}, {"score": 0.0028373742057129126, "phrase": "group_decision"}, {"score": 0.0026971491199975083, "phrase": "real_world_erp_selection_problem"}, {"score": 0.0024234059612683032, "phrase": "decision_problem"}, {"score": 0.0023166075278110254, "phrase": "fuzzy_group_decision-making_problems"}, {"score": 0.0021049977753042253, "phrase": "fuzzy_set"}], "paper_keywords": ["Enterprise Information Systems", " Enterprise Resource Planning", " Type-2 Fuzzy Sets", " Fuzzy AHP", " Fuzzy Numbers", " Multicriteria", " Uncertainty"], "paper_abstract": "As a result of emerging computation technologies, information systems are developed to support various processes of enterprises. ERP (Enterprise Resource Planning) has been a leading EIS (Enterprise Information Systems) application and companies are allocating resources to such new projects. However, studies report that most of the projects fail or cannot reach the desired outcomes selecting inappropriate software is represented as one of the major sources for project failures. This paper focuses on EIS selection problem which is a multicriteria decision making (MCDM) problem since it contains various and conflicting criteria. In this study, a group decision making approach using Analytic Hierarchy Process (AHP) and Interval type-2 fuzzy sets is used on a real world ERP selection problem with six criteria and four alternatives. The originality of the study comes from using interval type-2 fuzzy sets in the decision problem. By using interval type-2 fuzzy sets for handling fuzzy group decision-making problems more flexible decisions can be given since interval type-2 fuzzy sets are more suitable to represent uncertainties than type-1 fuzzy set.", "paper_title": "A Group Decision Making Approach Using Interval Type-2 Fuzzy AHP for Enterprise Information Systems Project Selection", "paper_id": "WOS:000348969200005"}