{"auto_keywords": [{"score": 0.04666794416407739, "phrase": "internet_users"}, {"score": 0.008713768692145006, "phrase": "internet_users'_anonymity"}, {"score": 0.007948849577924714, "phrase": "collaborating_eavesdroppers"}, {"score": 0.004779564521350969, "phrase": "purpose_-_the_purpose"}, {"score": 0.004185108816866677, "phrase": "internet_topology"}, {"score": 0.003584025547693836, "phrase": "relatively_small_number"}, {"score": 0.0025045102029373854, "phrase": "eavesdroppers'_deployment_strategy"}, {"score": 0.0024768883044869023, "phrase": "eavesdroppers'_collaboration"}, {"score": 0.0024405312482831646, "phrase": "substantial_resource_saving"}, {"score": 0.0023088708688076666, "phrase": "new_measure"}, {"score": 0.0022918601312169676, "phrase": "anonymity_level"}, {"score": 0.0021049977753042253, "phrase": "non-trivial_group_betweenness_optimization_strategy"}], "paper_keywords": ["Internet", " User studies", " Data security"], "paper_abstract": "Purpose - The purpose of this paper is to model and study the effectiveness of an attack on the anonymity of Internet users by a group of collaborating eavesdroppers. Design/methodology/approach - The paper is based on an analysis of the Internet topology. The study is based on two methods for choosing nodes that contribute the most to the detection of as many communicating Internet users as possible. Findings - The paper illustrates that it is possible to compromise the anonymity of many Internet users when eavesdropping on a relatively small number of nodes, even when the most central ones are protected from eavesdropping. Research limitations/implications - It is assumed that the Internet users under attack are not using any anonymity enhancing technologies, but nodes can be protected from eavesdropping. It proposes a measure of the success of an attack on Internet users' anonymity, for a given deployment of collaborating eavesdroppers in the Internet. Practical implications - The paper shows that several, and not necessarily the most prominent, collaborating nodes can compromise the anonymity of a considerable portion of Internet users. This study also emphasizes that when trying to completely compromise the anonymity of Internet users, an eavesdroppers' deployment strategy that considers eavesdroppers' collaboration can result in substantial resource saving compared to choosing a set of the most prominent nodes. Originality/value - The paper proposes a new measure of anonymity level in the network, based on the link-ability of the Internet users. This paper is the first to present results of a non-trivial Group Betweenness optimization strategy in large complex networks.", "paper_title": "Collaborative attack on Internet users' anonymity", "paper_id": "WOS:000264045400005"}