{"auto_keywords": [{"score": 0.006283888766260271, "phrase": "depth_perception"}, {"score": 0.00509090230088059, "phrase": "viewing_comfort"}, {"score": 0.00481495049065317, "phrase": "perceived_depth"}, {"score": 0.004443482801729777, "phrase": "binocular_disparity"}, {"score": 0.0043697607816770775, "phrase": "eye_movements"}, {"score": 0.004225950334493496, "phrase": "stereo-anomaly_tests"}, {"score": 0.003860774424566198, "phrase": "conflicting_depth_information"}, {"score": 0.0030950988205648605, "phrase": "fixation_square"}, {"score": 0.00287514090358681, "phrase": "visual_periphery"}, {"score": 0.002743355746391485, "phrase": "stereo-anomalous_observers"}, {"score": 0.002600105134993952, "phrase": "perceived_depth_range"}, {"score": 0.0025654738267173274, "phrase": "red-green_display"}, {"score": 0.002548331088496964, "phrase": "practically_all_observers"}, {"score": 0.0024808951705681636, "phrase": "greater_viewing_comfort"}, {"score": 0.0023990982005125763, "phrase": "robust_phenomenon"}, {"score": 0.0023122257999320527, "phrase": "retinal_blur"}, {"score": 0.0022967713922705, "phrase": "depth_information"}, {"score": 0.0021622381640810442, "phrase": "different_depth_planes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Stereo-anomaly", " Depth perception", " Stereopsis", " Accommodation", " 3D display"], "paper_abstract": "Background: About 30% of the population has difficulties detecting the sign and the magnitude of binocular disparity in the absence of eye movements, a phenomenon called stereo-anomaly. The stereo-anomaly tests so far are based on disparity only (e.g. red-green stereograms), which means that other depth cues cannot be used and even provide conflicting depth information. Objective: Here we investigate whether stereo-anomaly also occurs using a \"true-3D\" display which provides other depth cues that are all consistent with one particular distance in depth. Secondly, we examine differences in depth perception between red-green (anaglyphic) and true-3D displays. Finally, we test the displays relative viewing comfort. Method: Sixteen observers (four of which were stereo-anomalous) judged the distance in depth between a fixation square and one or two bars. They were presented on an anaglyphic and a true-3D display, both in the fovea and 5 deg in the visual periphery. Observers were asked about the viewing comfort of both displays. Results: Stereo-anomalous observers also showed difficulties in perceiving depth with the true-3D display. Yet the true-3D display increased the perceived depth range compared to the red-green display for practically all observers at both eccentricities. All observers reported greater viewing comfort for the true-3D display. Conclusion: Stereo-anomaly is a robust phenomenon. True-3D displays improve depth perception and viewing comfort, most likely because retinal blur provides depth information consistent with disparity. Application: The true-3D display shows potential for clearly and comfortably displaying objects at different depth planes. (C) 2010 Published by Elsevier B.V.", "paper_title": "Real 3D increases perceived depth over anaglyphs but does not cancel stereo-anomaly", "paper_id": "WOS:000280657500004"}