{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "partially_embedded_graphs"}, {"score": 0.01373746903656995, "phrase": "partial_solution"}, {"score": 0.004374473000977313, "phrase": "planar_drawing"}, {"score": 0.004334036641115555, "phrase": "entire_graph_g"}, {"score": 0.004124579368997962, "phrase": "complete_one"}, {"score": 0.003817306032290766, "phrase": "otherwise_easy_problem"}, {"score": 0.0037354317390837616, "phrase": "planarity_question"}, {"score": 0.0035110198699787013, "phrase": "'toncas'_behavior"}, {"score": 0.0034785371344994197, "phrase": "obvious_necessary_conditions"}, {"score": 0.003249306413997788, "phrase": "rotation_system_and_containment_relationships"}, {"score": 0.003035135667860725, "phrase": "dynamic_programming"}, {"score": 0.0029884576691560642, "phrase": "decision_algorithm"}, {"score": 0.0027827907725673845, "phrase": "suitable_data_structures"}, {"score": 0.0027146141712666673, "phrase": "simpler_subproblems"}, {"score": 0.002656327554326748, "phrase": "linear_time"}, {"score": 0.0024965820893532286, "phrase": "partial_embedding"}, {"score": 0.002383580563666675, "phrase": "np"}, {"score": 0.0023103100997344072, "phrase": "simultaneous_graph"}, {"score": 0.002198440442866291, "phrase": "linear-time_algorithm"}, {"score": 0.0021445492649196955, "phrase": "input_graphs"}, {"score": 0.0021246816854197732, "phrase": "common_graph"}, {"score": 0.0021049977753042253, "phrase": "fixed_planar_embedding"}], "paper_keywords": ["Algorithms", " Theory", " Planarity", " partial embedding", " simultaneous embedding", " algorithm"], "paper_abstract": "We study the following problem: given a planar graph G and a planar drawing (embedding) of a subgraph of G, can such a drawing be extended to a planar drawing of the entire graph G? This problem fits the paradigm of extending a partial solution for a problem to a complete one, which has been studied before in many different settings. Unlike many cases, in which the presence of a partial solution in the input makes an otherwise easy problem hard, we show that the planarity question remains polynomial-time solvable. Our algorithm is based on several combinatorial lemmas, which show that the planarity of partially embedded graphs exhibits the 'TONCAS' behavior \"the obvious necessary conditions for planarity are also sufficient.\" These conditions are expressed in terms of the interplay between (1) the rotation system and containment relationships between cycles and (2) the decomposition of a graph into its connected, biconnected, and triconnected components. This implies that no dynamic programming is needed for a decision algorithm and that the elements of the decomposition can be processed independently. Further, by equipping the components of the decomposition with suitable data structures and by carefully splitting the problem into simpler subproblems, we make our algorithm run in linear time. Finally, we consider several generalizations of the problem, such as minimizing the number of edges of the partial embedding that need to be rerouted to extend it, and argue that they are NP-hard. We also apply our algorithm to the simultaneous graph drawing problem SIMULTANEOUS EMBEDDING WITH FIXED EDGES (SEFE). There we obtain a linear-time algorithm for the case that one of the input graphs or the common graph has a fixed planar embedding.", "paper_title": "Testing Planarity of Partially Embedded Graphs", "paper_id": "WOS:000357122300008"}