{"auto_keywords": [{"score": 0.034356391305085915, "phrase": "bayesian"}, {"score": 0.00481495049065317, "phrase": "multiple_testing_problems"}, {"score": 0.004543708337879809, "phrase": "new_r_package"}, {"score": 0.004413846562278824, "phrase": "multiple_hypothesis_testing"}, {"score": 0.004318881178805575, "phrase": "principal_aim"}, {"score": 0.0041051328120736575, "phrase": "sgof-type_multiple_testing_methods"}, {"score": 0.004032768508156135, "phrase": "binomial"}, {"score": 0.0038184203504284006, "phrase": "conservative"}, {"score": 0.0031159081999910694, "phrase": "multiple_testing_procedures"}, {"score": 0.002961519813246521, "phrase": "original_sgof_method"}, {"score": 0.002897710777957041, "phrase": "bayesian_setting"}, {"score": 0.00269475174341129, "phrase": "sgof_package"}, {"score": 0.002579847272930948, "phrase": "benjamini-yekutieli_fdr_controlling_procedures"}], "paper_keywords": [""], "paper_abstract": "In this paper we present a new R package called sgof for multiple hypothesis testing. The principal aim of this package is to implement SGoF-type multiple testing methods, known to be more powerful than the classical false discovery rate (FDR) and family-wise error rate (FWER) based methods in certain situations, particularly when the number of tests is large. This package includes Binomial and Conservative SGoF and the Bayesian and Beta-Binomial SGoF multiple testing procedures, which are adaptations of the original SGoF method to the Bayesian setting and to possibly correlated tests, respectively. The sgof package also implements the Benjamini-Hochberg and Benjamini-Yekutieli FDR controlling procedures. For each method the package provides (among other things) the number of rejected null hypotheses, estimation of the corresponding FDR, and the set of adjusted p values. Some automatic plots of interest are implemented too. Two real data examples are used to illustrate how sgof works.", "paper_title": "sgof: An R Package for Multiple Testing Problems", "paper_id": "WOS:000348651700009"}