{"auto_keywords": [{"score": 0.04942444706912143, "phrase": "svdd"}, {"score": 0.03628286365618487, "phrase": "proposed_method"}, {"score": 0.033789171851094216, "phrase": "svdd_problem"}, {"score": 0.00481495049065317, "phrase": "svdd-based_pattern_de-noising"}, {"score": 0.004234129588974058, "phrase": "feature_space"}, {"score": 0.004081385289516914, "phrase": "normal_data"}, {"score": 0.003809628721278519, "phrase": "facial_images"}, {"score": 0.003757480190200645, "phrase": "partially_damaged_ones"}, {"score": 0.003027462227648001, "phrase": "data_region"}, {"score": 0.002985988377995789, "phrase": "normal_faces"}, {"score": 0.0028127163745564777, "phrase": "damaged_input_facial_image"}, {"score": 0.002723607240517261, "phrase": "decision_boundary"}, {"score": 0.002686284749214443, "phrase": "svdd_ball"}, {"score": 0.0025420267431501367, "phrase": "normal_region"}, {"score": 0.002427732996314194, "phrase": "reconstructed_face"}, {"score": 0.0021049977753042253, "phrase": "damaged_facial_images"}], "paper_keywords": [""], "paper_abstract": "The SVDD (support vector data description) is one of the most well-known one-class support vector learning methods, in which one tries the strategy of utilizing balls defined on the feature space in order to distinguish a set of normal data from all other possible abnormal objects. In this paper, we consider the problem of reconstructing facial images from the partially damaged ones, and propose to use the SVDD-based de-noising for the reconstruction. In the proposed method, we deal with the shape and texture information separately. We first solve the SVDD problem for the data belonging to the given prototype facial images, and model the data region for the normal faces as the ball resulting from the SVDD problem. Next, for each damaged input facial image, we project its feature vector onto the decision boundary of the SVDD ball so that it can be tailored enough to belong to the normal region. Finally, we obtain the image of the reconstructed face by obtaining the pre-image of the projection, and then further processing with its shape and texture information. The applicability of the proposed method is illustrated via some experiments dealing with damaged facial images.", "paper_title": "Facial image reconstruction by SVDD-based pattern de-noising", "paper_id": "WOS:000235768300018"}