{"auto_keywords": [{"score": 0.004447766706144458, "phrase": "linguistic_term_sets"}, {"score": 0.004081385289516914, "phrase": "multi-attribute_group_decision_making_methods"}, {"score": 0.0035993041437026225, "phrase": "new_operations"}, {"score": 0.003482160257566501, "phrase": "weighted_average_aggregation_operator"}, {"score": 0.0033465923623290034, "phrase": "weighted_average_operator"}, {"score": 0.0033025823350563087, "phrase": "linguistic_weights"}, {"score": 0.0028173769301594745, "phrase": "order_preference"}, {"score": 0.0027437235598539904, "phrase": "ideal_solution"}, {"score": 0.0024192592458651204, "phrase": "ranking_organization_methods"}, {"score": 0.002387415084371473, "phrase": "enrichment_evaluations"}, {"score": 0.0021049977753042253, "phrase": "proposed_methods"}], "paper_keywords": ["multi-attribute group decision making", " proportional 2-tuple linguistic model", " linguistic weights", " TOPSIS", " ELECTRE", " PROMETHEE"], "paper_abstract": "The proportional 2-tuple linguistic model provides a tool to deal with linguistic term sets that are not uniformly and symmetrically distributed. This study further develops multi-attribute group decision making methods with linguistic assessments and linguistic weights, based on the proportional 2-tuple linguistic model. Firstly, this study defines some new operations in proportional 2-tuple linguistic model, including weighted average aggregation operator with linguistic weights, ordered weighted average operator with linguistic weights and the distance between proportional linguistic 2-tuples. Then, four multi-attribute group decision making methods are presented. They are the method based on the proportional 2-tuple linguistic aggregation operator, technique for order preference by similarity to ideal solution (TOPSIS) with proportional 2-tuple linguistic information, elimination et choice translating reality (ELECTRE) with proportional 2-tuple linguistic information, preference ranking organization methods for enrichment evaluations (PROMETHEE) with proportional 2-tuple linguistic information. Finally, an example is given to illustrate the effectiveness of the proposed methods.", "paper_title": "Multi-attribute group decision making methods with proportional 2-tuple linguistic assessments and weights", "paper_id": "WOS:000342309300014"}