{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "interest_similarity"}, {"score": 0.01560937278433192, "phrase": "online_social_networks"}, {"score": 0.013271891813645804, "phrase": "users'_interest_similarity"}, {"score": 0.004131222603229106, "phrase": "facebook"}, {"score": 0.003958194802333944, "phrase": "practical_problem"}, {"score": 0.003493900927782043, "phrase": "users'_interests"}, {"score": 0.0034077704063304208, "phrase": "large_facebook_dataset"}, {"score": 0.0032883848851259123, "phrase": "comprehensive_empirical_studies"}, {"score": 0.002954669496511141, "phrase": "similar_demographic_information"}, {"score": 0.0027218799769229596, "phrase": "higher_interest_entropy"}, {"score": 0.0025800088089364737, "phrase": "practical_prediction_model"}, {"score": 0.0025525322651112365, "phrase": "real_osn_environment"}, {"score": 0.0024895500851796603, "phrase": "interest_information"}, {"score": 0.002342972434255588, "phrase": "high_interest_similarities"}, {"score": 0.0022608057001451414, "phrase": "use_case"}, {"score": 0.002220806891955454, "phrase": "proposed_prediction_model"}, {"score": 0.0021659920594094407, "phrase": "osn_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Social networks", " Interest similarity", " Homophily", " Prediction model"], "paper_abstract": "Understanding how much two individuals are alike in their interests (i.e., interest similarity) has become virtually essential for many applications and services in Online Social Networks (OSNs). Since users do not always explicitly elaborate their interests in OSNs like Facebook, how to determine users' interest similarity without fully knowing their interests is a practical problem. In this paper, we investigate how users' interest similarity relates to various social features (e.g. geographic distance); and accordingly infer whether the interests of two users are alike or unalike where one of the users' interests are unknown. Relying on a large Facebook dataset, which contains 479,048 users and 5,263,351 user-generated interests, we present comprehensive empirical studies and verify the homophily of interest similarity across three interest domains (movies, music and TV shows). The homophily reveals that people tend to exhibit more similar tastes if they have similar demographic information (e.g., age, location), or if they are friends. It also shows that the individuals with a higher interest entropy usually share more interests with others. Based on these results, we provide a practical prediction model under a real OSN environment. For a given user with no interest information, this model can select some individuals who not only exhibit many interests but also probably achieve high interest similarities with the given user. Eventually, we illustrate a use case to demonstrate that the proposed prediction model could facilitate decision-making for OSN applications and services. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Alike people, alike interests? Inferring interest similarity in online social networks", "paper_id": "WOS:000349579100009"}