{"auto_keywords": [{"score": 0.046795482763257526, "phrase": "consumer_trust"}, {"score": 0.02322730111336099, "phrase": "online_banking"}, {"score": 0.018193656238362357, "phrase": "online_banking_context"}, {"score": 0.006246404964808004, "phrase": "relationship_commitment"}, {"score": 0.004780926543714981, "phrase": "purpose_-_the_purpose"}, {"score": 0.004614362802631256, "phrase": "perceived_web_site_security"}, {"score": 0.004237803085579238, "phrase": "trust-commitment_relationship"}, {"score": 0.004163290958633733, "phrase": "key_variable"}, {"score": 0.004119211418949265, "phrase": "successful_long-term_relationships"}, {"score": 0.003975609222669783, "phrase": "positive_effects"}, {"score": 0.003796355951305572, "phrase": "web_site"}, {"score": 0.0035995085881892464, "phrase": "positive_effect"}, {"score": 0.0035740424892197155, "phrase": "consumer_commitment"}, {"score": 0.0034987163424726546, "phrase": "measurement_scales"}, {"score": 0.003412833120814178, "phrase": "structural_modelling"}, {"score": 0.0033172506969692626, "phrase": "hypothesised_model"}, {"score": 0.003201516237269705, "phrase": "mediating_role"}, {"score": 0.003089807081149139, "phrase": "web_site_security"}, {"score": 0.002992595374066178, "phrase": "direct_and_significant_effect"}, {"score": 0.0029294877178473017, "phrase": "financial_services_web_site"}, {"score": 0.0027188802510720775, "phrase": "key_mediating_factor"}, {"score": 0.0024877583128884457, "phrase": "new_customers"}, {"score": 0.0021275693314553143, "phrase": "web_survey"}, {"score": 0.0021049977753042253, "phrase": "spanish-speaking_subjects"}], "paper_keywords": ["data security", " privacy", " trust", " commitment", " virtual banking"], "paper_abstract": "Purpose - The purpose of this research is to analyse the influence of perceived web site security and privacy, usability and reputation on consumer trust in the context of online banking. Moreover, the paper also aims to analyse the trust-commitment relationship since commitment is a key variable for establishing successful long-term relationships with customers. Design/methodology/approach - The paper describes the positive effects of security and privacy, usability and reputation on consumer trust in a web site in the online banking context. Besides this, it also suggests that trust has a positive effect on consumer commitment. After the validation of measurement scales, the hypotheses are contrasted through structural modelling. Finally, the paper compares the hypothesised model with a rival one in order to test the mediating role of trust. Findings - The data showed that web site security and privacy, usability and reputation have a direct and significant effect on consumer trust in a financial services web site. Besides this, consumer trust is positively related to relationship commitment. Finally, it is observed that trust is a key mediating factor in the development of relationship commitment in the online banking context. Research implications/limitations - The high costs every company has to face in order to attract new customers make it increasingly necessary to reinforce the ties established with customers. In this respect, this research offers several alternatives for improving the levels of consumer trust and commitment in the context of online banking. The limitation is that data were collected to a web survey only of Spanish-speaking subjects. Originality/value - This study proposes a model for analysing empirically the link between security, privacy and trust, amongst others, in the online banking context.", "paper_title": "The role of security, privacy, usability and reputation in the development of online banking", "paper_id": "WOS:000250991700003"}