{"auto_keywords": [{"score": 0.00438955582974973, "phrase": "great_deal"}, {"score": 0.004152502093643003, "phrase": "precision_purposes"}, {"score": 0.003808845109556467, "phrase": "non-trivial_task"}, {"score": 0.003738973626996355, "phrase": "new_surface"}, {"score": 0.0036477941360224435, "phrase": "gene_spots"}, {"score": 0.0033873366086549735, "phrase": "graph-cutting_technique"}, {"score": 0.0027120400060701034, "phrase": "previous_methods"}, {"score": 0.002323826502178581, "phrase": "reconstruction_methods"}, {"score": 0.002295277579105179, "phrase": "final_results"}, {"score": 0.002239225269052105, "phrase": "graph-cutting_inspired_identification_mechanism"}, {"score": 0.002144400314994328, "phrase": "reconstruction_accuracy"}], "paper_keywords": ["cDNA", " Two channel", " Microarrays", " Background reconstruction", " Graph-edge cuts"], "paper_abstract": "Microarrays produce high-resolution image data that are, unfortunately, permeated with a great deal of \"noise\" that must be removed for precision purposes. This paper presents a technique for such a removal process. Oil completion of this non-trivial task. a new surface (devoid of gene spots) is subtracted from the original to render more precise gene expressions. The graph-cutting technique as implemented has the benefits that only the most appropriate pixels are replaced and these replacements are replicates rather than estimates. This means the influence of outliers and other artifacts are handled more appropriately (than in previous methods) as well as the variability of the final gene expressions being considerably reduced. Experiments are carried out to test the technique against commercial and previously researched reconstruction methods. Final results show that the graph-cutting inspired identification mechanism has a positive significant impact on reconstruction accuracy. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Can graph-cutting improve microarray gene expression reconstructions?", "paper_id": "WOS:000261402500010"}