{"auto_keywords": [{"score": 0.049212993617288356, "phrase": "formal_framework"}, {"score": 0.04878556281654673, "phrase": "designer_comprehensibility"}, {"score": 0.039701168335308915, "phrase": "specification_automaton"}, {"score": 0.03253855146857074, "phrase": "transparent_specification_automaton"}, {"score": 0.00481495049065317, "phrase": "specification_transparency"}, {"score": 0.004642292792558686, "phrase": "discrete-event_control_specifications"}, {"score": 0.004475798524102238, "phrase": "discrete-event_systems"}, {"score": 0.004354841111644036, "phrase": "control_requirements"}, {"score": 0.004237138632255772, "phrase": "trivial_task"}, {"score": 0.004029517895918228, "phrase": "long-standing_problem"}, {"score": 0.0036944890904337833, "phrase": "intended_control_requirement"}, {"score": 0.0033410898465226417, "phrase": "new_specification_concept"}, {"score": 0.003310684108128973, "phrase": "automaton_transparency"}, {"score": 0.0031627430133087616, "phrase": "specification_automata"}, {"score": 0.002782647772219627, "phrase": "different_automata"}, {"score": 0.0026461080202599694, "phrase": "different_sets"}, {"score": 0.00243694486220507, "phrase": "irrelevant_event"}, {"score": 0.002403724423251419, "phrase": "maximal_cardinality"}, {"score": 0.002370955769074803, "phrase": "transparency_maximization_problem"}, {"score": 0.0022962183207691188, "phrase": "provably_correct_solution_algorithm"}], "paper_keywords": ["Discrete-event systems (DESs)", " language relevance", " specification automata", " transparency"], "paper_abstract": "In control of discrete-event systems (DESs), specifying control requirements in automata is not a trivial task. For many DES applications, designers are often confronted with the long-standing problem of uncertainty in specification, namely, how do we know that a specification automaton does indeed model the intended control requirement? Toward a formal framework that helps mitigate this uncertainty for designer comprehensibility, in this paper, we introduce and develop a new specification concept of automaton transparency and investigate the problem of maximizing the transparency of specification automata for DESs. In a transparent specification automaton, events that are irrelevant to the specification but can occur in the system are \"hidden\" in self-loops. Different automata of the same specification on a DES can be associated with different sets of such irrelevant events, and any such automaton is said to be the most transparent if it has an irrelevant event set of maximal cardinality. The transparency maximization problem is theoretically formulated, and a provably correct solution algorithm is obtained. Given a specification automaton for a DES, the transparent specification automaton produced by the algorithm is a more comprehensible structure, essentially showing the precedence ordering among events from a minimal cardinality set that is relevant in modeling some requirement for the DES, and should aid designers in clarifying if the requirement prescribed is the one intended.", "paper_title": "On Specification Transparency: Toward A Formal Framework for Designer Comprehensibility of Discrete-Event Control Specifications in Finite Automata", "paper_id": "WOS:000317613400012"}