{"auto_keywords": [{"score": 0.04929460594219637, "phrase": "shape_descriptors"}, {"score": 0.010612387000973441, "phrase": "descriptive_power"}, {"score": 0.008683439869775877, "phrase": "multiple_descriptors"}, {"score": 0.004506968388996092, "phrase": "different_categories"}, {"score": 0.004374852387477995, "phrase": "o.r."}, {"score": 0.003794954883650141, "phrase": "new_descriptor_content"}, {"score": 0.0035285548582081627, "phrase": "specific_applicative_context"}, {"score": 0.0031845067058084583, "phrase": "innovative_protocol"}, {"score": 0.003050376875258722, "phrase": "final_application"}, {"score": 0.0029805015010906013, "phrase": "new_quantitative_and_qualitative_measures"}, {"score": 0.0028549396580672417, "phrase": "first_type"}, {"score": 0.002636828502928141, "phrase": "second_type"}, {"score": 0.0024678216843278806, "phrase": "usual_approach"}, {"score": 0.00234043119560776, "phrase": "performance_characteristics"}, {"score": 0.0023172863267744703, "phrase": "overall_system"}, {"score": 0.002226968099778524, "phrase": "experimental_studies"}, {"score": 0.0021049977753042253, "phrase": "community_namely_art_and_sc_descriptors"}], "paper_keywords": ["Document analysis", " Shape descriptors", " Symbol description", " Performance characterization", " Complementarity analysis"], "paper_abstract": "Most document analysis applications rely on the extraction of shape descriptors, which may be grouped into different categories, each category having its own advantages and drawbacks (O.R. Terrades et al. in Proceedings of ICDAR'07, pp. 227-231, 2007). In order to improve the richness of their description, many authors choose to combine multiple descriptors. Yet, most of the authors who propose a new descriptor content themselves with comparing its performance to the performance of a set of single state-of-the-art descriptors in a specific applicative context (e.g. symbol recognition, symbol spotting...). This results in a proliferation of the shape descriptors proposed in the literature. In this article, we propose an innovative protocol, the originality of which is to be as independent of the final application as possible and which relies on new quantitative and qualitative measures. We introduce two types of measures: while the measures of the first type are intended to characterize the descriptive power (in terms of uniqueness, distinctiveness and robustness towards noise) of a descriptor, the second type of measures characterizes the complementarity between multiple descriptors. Characterizing upstream the complementarity of shape descriptors is an alternative to the usual approach where the descriptors to be combined are selected by trial and error, considering the performance characteristics of the overall system. To illustrate the contribution of this protocol, we performed experimental studies using a set of descriptors and a set of symbols which are widely used by the community namely ART and SC descriptors and the GREC 2003 database.", "paper_title": "A protocol to characterize the descriptive power and the complementarity of shape descriptors", "paper_id": "WOS:000287757000010"}