{"auto_keywords": [{"score": 0.049754507386661914, "phrase": "linear_combinations"}, {"score": 0.00481495049065317, "phrase": "multiple_heterogeneous_domains"}, {"score": 0.004701710196317656, "phrase": "high-order_coclustering_problem"}, {"score": 0.004560002169647084, "phrase": "heterogeneous_types"}, {"score": 0.004452731043379068, "phrase": "active_research_area"}, {"score": 0.004347972379250724, "phrase": "notable_impact"}, {"score": 0.004145760434798249, "phrase": "weighted_combination"}, {"score": 0.0035571129372263532, "phrase": "definite_and_precise_manner"}, {"score": 0.003357091486708983, "phrase": "weighing_scheme"}, {"score": 0.0032447099613882313, "phrase": "contrasting_goals"}, {"score": 0.002831462722290752, "phrase": "pairwise_objective_functions"}, {"score": 0.0024961041872030073, "phrase": "appropriate_weighting_scheme"}, {"score": 0.002428974327006118, "phrase": "star-structured\"_domains"}, {"score": 0.0023079225317714815, "phrase": "information-theoretic_framework"}, {"score": 0.00226892463779702, "phrase": "thorough_experimentation"}], "paper_keywords": ["Data mining", " coclustering", " contingency table analysis"], "paper_abstract": "The high-order coclustering problem, i.e., the problem of simultaneously clustering heterogeneous types of domain, has become an active research area in the last few years, due to the notable impact it has on several application scenarios. This problem is generally faced by optimizing a weighted combination of functions measuring the quality of coclustering over each pair of domains, where weights are chosen based on the supposed reliability/relevance of their correlation. However, little knowledge is likely to be available, in practice, in order to set these weights in a definite and precise manner. And, more importantly, it might even be conceptually unclear whether to prefer a weighing scheme over others, in those cases where functions encode contrasting goals so that improving the quality for a pair of domains leads to a deterioration for other pairs. The aim of this paper is precisely to shed light on the impact of weighting schemes on techniques based on linear combinations of pairwise objective functions, and to define an approach that overcomes the above problems by looking for an agreement-intuitively, a kind of compromise-among the various domains, thereby getting rid of the need to define an appropriate weighting scheme. Two algorithms performing coclustering on \"star-structured\" domains, based on linear combinations and agreements, respectively, have been designed within an information-theoretic framework. Results from a thorough experimentation, on both synthetic and real data, are discussed, in order to assess the effectiveness of the approaches and to get more insight into their actual behavior.", "paper_title": "Coclustering Multiple Heterogeneous Domains: Linear Combinations and Agreements", "paper_id": "WOS:000283133800001"}