{"auto_keywords": [{"score": 0.03993894756383543, "phrase": "eca"}, {"score": 0.014319071747994728, "phrase": "sleep_disorders"}, {"score": 0.00789697947878645, "phrase": "eds"}, {"score": 0.006751273921114657, "phrase": "ess"}, {"score": 0.006412051673249934, "phrase": "sleep_complaints"}, {"score": 0.00481495049065317, "phrase": "virtual_human"}, {"score": 0.004800896275569947, "phrase": "ess_scores"}, {"score": 0.00477190623242136, "phrase": "explore_excessive_daytime_sleepiness"}, {"score": 0.0045932001040047445, "phrase": "daily_life_activities"}, {"score": 0.004511423799053534, "phrase": "excessive_daytime_sleepiness"}, {"score": 0.004478093698333089, "phrase": "virtual_physician"}, {"score": 0.004431096939980346, "phrase": "epworth_sleepiness_scale"}, {"score": 0.004303591748086452, "phrase": "general_population"}, {"score": 0.004114527599108734, "phrase": "accurate_diagnosis"}, {"score": 0.0040777192615062815, "phrase": "embodied_conversational_agents"}, {"score": 0.003978178618126202, "phrase": "affective_computing"}, {"score": 0.003960342092543465, "phrase": "human_interactions"}, {"score": 0.0036443694410100507, "phrase": "sleep_specialist"}, {"score": 0.0034920056544634017, "phrase": "self-administered_questionnaire"}, {"score": 0.00339906379933227, "phrase": "paper_paradigm"}, {"score": 0.003256922225995089, "phrase": "real-doctor_questionnaire"}, {"score": 0.0029901699209266435, "phrase": "affordable_hardware_products"}, {"score": 0.002877996204107078, "phrase": "best_results"}, {"score": 0.00280135064332215, "phrase": "sleepiest_patients"}, {"score": 0.0026841368358805433, "phrase": "alert_subjects"}, {"score": 0.0024864612830452254, "phrase": "positive_perception"}, {"score": 0.002414777422577126, "phrase": "good_experience"}, {"score": 0.0024039336303798694, "phrase": "sixty-five_percent"}, {"score": 0.002366361492754389, "phrase": "virtual_doctor"}, {"score": 0.0023451553255837317, "phrase": "real_physicians"}, {"score": 0.0022168460543913787, "phrase": "real_physician"}, {"score": 0.0022019274077124795, "phrase": "expected_massive_increase"}, {"score": 0.0021336208506092173, "phrase": "computerized_systems"}], "paper_keywords": [""], "paper_abstract": "Excessive daytime somnolence (EDS) is defined as the inability to stay awake in daily life activities. Several scales have been used to diagnose excessive daytime sleepiness, the most widely used being the Epworth Sleepiness Scale (ESS). Sleep disorders and EDS are very common in the general population. It is therefore important to be able to screen patients for this symptom in order to obtain an accurate diagnosis of sleep disorders. Embodied Conversational Agents (ECA) have been used in the field of affective computing and human interactions but up to now no software has been specifically designed to investigate sleep disorders. We created an ECA able to conduct an interview based on the ESS and compared it to an interview conducted by a sleep specialist. We recruited 32 consecutive patients and a group of 30 healthy volunteers free of any sleep complaints. The ESS is a self-administered questionnaire that asks the subject to rate (with a pen and paper paradigm) his or her probability of falling asleep. For the purpose of our study, the ECA or real-doctor questionnaire was modified as follows: Instead of the \"I'' formulate, questions were asked as \"Do you.'' Our software is based on a common 3D game engine and several commercial software libraries. It can run on standard and affordable hardware products. The sensitivity and specificity of the interview conducted by the ECA were measured. The best results (sensibility and specificity >98%) were obtained to discriminate the sleepiest patients (ESS >= 16) but very good scores (sensibility and specificity > 80%) were also obtained for alert subjects (ESS< 8). ESS scores obtained in the interview conducted by the physician were significantly correlated with ESS scores obtained in the interview the ECA conducted. Most of the subjects had a positive perception of the virtual physician and considered the interview with the ECA as a good experience. Sixty-five percent of the participants felt that the virtual doctor could significantly help real physicians. Our results show that a virtual physician can conduct a very simple interview to evaluate EDS with very similar results to those obtained by a questionnaire administered by a real physician. The expected massive increase in sleep complaints in the near future likely means that more and more physicians will be looking for computerized systems to help them to diagnose their patients.", "paper_title": "Could a Virtual Human Be Used to Explore Excessive Daytime Sleepiness in Patients?", "paper_id": "WOS:000351287300004"}