{"auto_keywords": [{"score": 0.04543569910692644, "phrase": "scaffold-focused_virtual_screen"}, {"score": 0.03426730308455407, "phrase": "biochemical_screening"}, {"score": 0.03201731722317735, "phrase": "active_compounds"}, {"score": 0.030660592326805094, "phrase": "query_compound"}, {"score": 0.00481495049065317, "phrase": "scaffold-focused_virtual"}, {"score": 0.00454725669814484, "phrase": "ttk_inhibitors"}, {"score": 0.004159997145421619, "phrase": "mitotic_kinase_ttk"}, {"score": 0.003903663808332582, "phrase": "scaffold_tree"}, {"score": 0.003639835714755229, "phrase": "query_scaffold"}, {"score": 0.0026815368507715, "phrase": "virtual_screen"}, {"score": 0.0026307897899760383, "phrase": "whole_molecule_similarity"}, {"score": 0.002360796860462937, "phrase": "binding_mode"}, {"score": 0.0021049977753042253, "phrase": "ligand-efficient_scaffold"}], "paper_keywords": [""], "paper_abstract": "We describe and apply a scaffold-focused virtual screen based upon scaffold trees to the mitotic kinase TTK (MPS1). Using level 1 of the scaffold tree, we perform both 2D and 3D similarity searches between a query scaffold and a level 1 scaffold library derived from a 2 million compound library; 98 compounds from 27 unique top-ranked level 1 scaffolds are selected for biochemical screening. We show that this scaffold-focused virtual screen prospectively identifies eight confirmed active compounds that are structurally differentiated from the query compound. In comparison, 100 compounds were selected for biochemical screening using a virtual screen based upon whole molecule similarity resulting in 12 confirmed active compounds that are structurally similar to the query compound. We elucidated the binding mode for four of the eight confirmed scaffold hops to TTK by determining their protein-ligand crystal structures; each represents a ligand-efficient scaffold for inhibitor design.", "paper_title": "Scaffold-Focused Virtual Screening: Prospective Application to the Discovery of TTK Inhibitors", "paper_id": "WOS:000319650800009"}