{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "amosa"}, {"score": 0.004653120760786245, "phrase": "clustering_gene_expression"}, {"score": 0.0044967055264893184, "phrase": "new_model"}, {"score": 0.004445739135694758, "phrase": "multiobjective_simulated_annealing"}, {"score": 0.004175533280178052, "phrase": "improved_performance"}, {"score": 0.003459191419478298, "phrase": "conventional_dominance"}, {"score": 0.0030861022250015073, "phrase": "nsga"}, {"score": 0.0024005409468262203, "phrase": "real_life_application"}, {"score": 0.0023064582783867645, "phrase": "gene_expression_data"}, {"score": 0.002105000283232273, "phrase": "elsevier"}], "paper_keywords": ["Additive epsilon-AMOSA", " Multiobjective simulated annealing", " Multiobjective knapsack problem", " Multiplicative epsilon-AMOSA", " MOO strategy", " Multiobjective optimization", " epsilon-Dominance"], "paper_abstract": "Recently, a new model of multiobjective simulated annealing, AMOSA, was developed which was found to provide improved performance for several multi objective optimization problems especially for problems with many objectives. In this article, we aim to further improve the performance of AMOSA by incorporating the concept of epsilon-dominance which is a more generalized form of conventional dominance. This strategy is referred to as epsilon-AMOSA. The result of epsilon-AMOSA is compared with those of AMOSA, NSGA-II and epsilon-MOEA and AMOSA for several test problems with number of objectives varying from two to fifteen and the number of variables varying from one to thirty. The performance of epsilon-AMOSA is also compared with other strategies for multiobjective 0/1 knapsack problem. A real life application of epsilon-AMOSA for clustering genes from gene expression data is also demonstrated. The results demonstrate the effectiveness of epsilon-AMOSA. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "Incorporating epsilon-dominance in AMOSA: Application to multiobjective 0/1 knapsack problem and clustering gene expression data", "paper_id": "WOS:000319205200018"}