{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "security_requirements"}, {"score": 0.043218208636731384, "phrase": "security-relevant_requirements"}, {"score": 0.015553775575606972, "phrase": "organizational_learning"}, {"score": 0.004530894050040479, "phrase": "requirements_engineers"}, {"score": 0.004278807087784626, "phrase": "security_vulnerabilities"}, {"score": 0.003912595576016982, "phrase": "security_requirements_elicitation_process"}, {"score": 0.0037480753312398754, "phrase": "company-wide_experience_resources"}, {"score": 0.003708033700676924, "phrase": "socio-technical_network"}, {"score": 0.0034890505116128606, "phrase": "related_experiences"}, {"score": 0.003247868216333148, "phrase": "project_requirements"}, {"score": 0.0031448288291084, "phrase": "participating_stakeholders"}, {"score": 0.003023307182674672, "phrase": "security_awareness"}, {"score": 0.0029590077170443666, "phrase": "individual_and_organizational_levels"}, {"score": 0.0028548578165712643, "phrase": "heuristic_assistant_tools"}, {"score": 0.0027941308786390033, "phrase": "existing_experiences"}, {"score": 0.002676514445417281, "phrase": "bayesian_classifiers"}, {"score": 0.002610198789888055, "phrase": "new_requirements"}, {"score": 0.0024036292057373803, "phrase": "domain-specific_data"}, {"score": 0.0023694065215394593, "phrase": "previous_projects"}, {"score": 0.002181851408180827, "phrase": "step-by-step_example"}, {"score": 0.0021354096283081317, "phrase": "security_requirements_engineering_process"}, {"score": 0.0021049987157875528, "phrase": "etsi"}], "paper_keywords": ["Secure software engineering", " Requirements analysis", " Organizational learning", " Requirements workflow modeling"], "paper_abstract": "More and more software projects today are security-related in one way or the other. Requirements engineers without expertise in security are at risk of overlooking security requirements, which often leads to security vulnerabilities that can later be exploited in practice. Identifying security-relevant requirements is labor-intensive and error-prone. In order to facilitate the security requirements elicitation process, we present an approach supporting organizational learning on security requirements by establishing company-wide experience resources and a socio-technical network to benefit from them. The approach is based on modeling the flow of requirements and related experiences. Based on those models, we enable people to exchange experiences about security-relevant requirements while they write and discuss project requirements. At the same time, the approach enables participating stakeholders to learn while they write requirements. This can increase security awareness and facilitate learning on both individual and organizational levels. As a basis for our approach, we introduce heuristic assistant tools. They support reuse of existing experiences that are relevant for security. In particular, they include Bayesian classifiers that issue a warning automatically when new requirements seem to be security-relevant. Our results indicate that this is feasible, in particular if the classifier is trained with domain-specific data and documents from previous projects. We show how the ability to identify security-relevant requirements can be improved using this approach. We illustrate our approach by providing a step-by-step example of how we improved the security requirements engineering process at the European Telecommunications Standards Institute (ETSI) and report on experiences made in this application.", "paper_title": "Enhancing security requirements engineering by organizational learning", "paper_id": "WOS:000300455300004"}