{"auto_keywords": [{"score": 0.049798208892916335, "phrase": "drug_targets"}, {"score": 0.022762727822895203, "phrase": "intrinsic_disorder"}, {"score": 0.01774640802491651, "phrase": "go_terms"}, {"score": 0.010612387000973441, "phrase": "hub_proteins"}, {"score": 0.004689210758225518, "phrase": "protein-protein_interactions"}, {"score": 0.004620773128779254, "phrase": "essential_roles"}, {"score": 0.004553329756664763, "phrase": "protein-protein_interaction_networks"}, {"score": 0.004395437013020554, "phrase": "important_source"}, {"score": 0.004331268265601626, "phrase": "intrinsic_disorder_proteins"}, {"score": 0.004268032298330859, "phrase": "unstable_structures"}, {"score": 0.004036007891943648, "phrase": "potential_drug_targets"}, {"score": 0.00396538027397194, "phrase": "similar_functions"}, {"score": 0.003930529468459255, "phrase": "semantic_similarity"}, {"score": 0.00390746526080583, "phrase": "gene_ontology"}, {"score": 0.003453086514392362, "phrase": "intrinsic_disorder_residues"}, {"score": 0.003343047002965523, "phrase": "functional_similarity"}, {"score": 0.0032652199869725087, "phrase": "prediction_models"}, {"score": 0.0032460470691682074, "phrase": "support_vector_machine"}, {"score": 0.0030875427447535765, "phrase": "ppi_data"}, {"score": 0.0030694099102195993, "phrase": "human_hub_proteins"}, {"score": 0.002602618744142145, "phrase": "new_targets"}, {"score": 0.002587326429221013, "phrase": "idp_dataset"}, {"score": 0.0024974364179629507, "phrase": "svm_model"}, {"score": 0.0024536665097561073, "phrase": "prediction_accuracy"}, {"score": 0.0021872315757161644, "phrase": "good_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Protein-protein interactions (PPIs)", " Gene ontology (GO) terms", " Intrinsic disorder", " Drug target"], "paper_abstract": "Protein-protein interactions (PPIs) play essential roles in many biological processes. In protein-protein interaction networks, hubs involve in numbers of PPIs and may constitute an important source of drug targets. The intrinsic disorder proteins (IDPs) with unstable structures can promote the promiscuity of hubs and also involve in many disease pathways, so they also could serve as potential drug targets. Moreover, proteins with similar functions measured by semantic similarity of gene ontology (GO) terms tend to interact with each other. Here, the relationship between hub proteins and drug targets based on GO terms and intrinsic disorder was explored. The semantic similarities of GO terms and genes between two proteins, and the rate of intrinsic disorder residues of each protein were extracted as features to characterize the functional similarity between two interacting proteins. Only using 8 feature variables, prediction models by support vector machine (SVM) were constructed to predict PPIs. The accuracy of the model on the PPI data from human hub proteins is as high as 83.72%, which is very promising compared with other PPI prediction models with hundreds or even thousands of features. Then, 118 of 142 PPIs between hubs are correctly predicted that the two interacting proteins are targets of the same drugs. The results indicate that only 8 functional features are fully efficient for representing PPIs. In order to identify new targets from IDP dataset, the PPIs between hubs and IDPs are predicted by the SVM model and the model yields a prediction accuracy of 75.84%. Further research proves that 3 of 5 PPIs between hubs and IDPs are correctly predicted that the two interacting proteins are targets of the same drugs. All results demonstrate that the model with only 8-dimensional features from GO terms and intrinsic disorder still gives a good performance in predicting PPIs and further identifying drug targets. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Exploring the relationship between hub proteins and drug targets based on GO and intrinsic disorder", "paper_id": "WOS:000356111800008"}