{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "metabolic_reactions"}, {"score": 0.049378038061471535, "phrase": "ec_numbers"}, {"score": 0.004709567162738894, "phrase": "self-organizing_maps"}, {"score": 0.004623503587186056, "phrase": "automatic_perception"}, {"score": 0.0045895181082906715, "phrase": "chemical_similarities"}, {"score": 0.004374593906165761, "phrase": "computer-aided_validation"}, {"score": 0.004278807087784626, "phrase": "genome-scale_reconstruction"}, {"score": 0.004185108816866677, "phrase": "metabolic_pathways"}, {"score": 0.004093453936415085, "phrase": "enzymatic_mechanisms"}, {"score": 0.0035184576341236317, "phrase": "different_enzymes"}, {"score": 0.003479692058963528, "phrase": "official_full_ec_numbers"}, {"score": 0.0033288399506044763, "phrase": "different_methods"}, {"score": 0.0031494088980556934, "phrase": "automatic_assignment"}, {"score": 0.0029686314779877525, "phrase": "molmap_reaction"}, {"score": 0.002903540062437197, "phrase": "structural_transformations"}, {"score": 0.002860938351029155, "phrase": "chemical_reaction"}, {"score": 0.0027368368719283298, "phrase": "genome-scale_database"}, {"score": 0.0026966744704447275, "phrase": "kohonen_self-organizing_maps"}, {"score": 0.0023088708688076666, "phrase": "different_levels"}, {"score": 0.002258212866482022, "phrase": "test_sets"}, {"score": 0.0021363670305843403, "phrase": "similar_reactions"}, {"score": 0.0021284812539167112, "phrase": "bearing_differences"}, {"score": 0.0021049977753042253, "phrase": "ec_class_level"}], "paper_keywords": [""], "paper_abstract": "Motivation: The automatic perception of chemical similarities between metabolic reactions is required for a variety of applications ranging from the computer-aided validation of classification systems, to genome-scale reconstruction (or comparison) of metabolic pathways, to the classification of enzymatic mechanisms. Comparison of metabolic reactions has been mostly based on Enzyme Commission (EC) numbers, which are extremely useful and widespread, but not always straightforward to apply, and often problematic when an enzyme catalyzes several reactions, when the same reaction is catalyzed by different enzymes, when official full EC numbers are unavailable or when reactions are not catalyzed by enzymes. Different methods should be available to compare metabolic reactions. Simultaneously, methods are required for the automatic assignment of EC numbers to reactions still not officially classified. Results: We have proposed the MOLMAP reaction descriptors to numerically encode the structural transformations resulting from a chemical reaction. Here, such descriptors are applied to the mapping of a genome-scale database of almost 4000 metabolic reactions by Kohonen self-organizing maps (SOMs), and its screening for inconsistencies in EC numbers. This approach allowed for the SOMs to assign EC numbers at the class, subclass and sub-subclass levels for reactions of independent test sets with accuracies up to 92, 80 and 70, respectively. Different levels of similarity between training and test sets were explored. The approach also led to the identification of a number of similar reactions bearing differences at the EC class level.", "paper_title": "Genome-scale classification of metabolic reactions and assignment of EC numbers with self-organizing maps", "paper_id": "WOS:000259581900017"}