{"auto_keywords": [{"score": 0.03713040073243937, "phrase": "reactive_jammer"}, {"score": 0.010612387000973441, "phrase": "enterprise_wifi_network"}, {"score": 0.010418726645955065, "phrase": "wireless_networks"}, {"score": 0.007871596980681657, "phrase": "reactive_jamming"}, {"score": 0.004691684576246597, "phrase": "internet_connectivity"}, {"score": 0.004471035765089235, "phrase": "multiple_access_points"}, {"score": 0.0043404186974790706, "phrase": "wireless_connectivity"}, {"score": 0.0043083624695326745, "phrase": "authorized_users"}, {"score": 0.004015345955907906, "phrase": "electromagnetic_energy"}, {"score": 0.0038263829059336564, "phrase": "legitimate_transmitter"}, {"score": 0.0031786037839399055, "phrase": "previous_studies"}, {"score": 0.0027097117582440687, "phrase": "interference_range"}, {"score": 0.002669818610058841, "phrase": "ap"}, {"score": 0.002620666087191234, "phrase": "busy_times"}, {"score": 0.0026012779346272848, "phrase": "nearby_aps"}, {"score": 0.002379484250348599, "phrase": "coarse_grain_localization"}, {"score": 0.002284234786840546, "phrase": "high_true_positives"}, {"score": 0.002267329954548889, "phrase": "low_false_positives"}, {"score": 0.002152440300818582, "phrase": "ap_coverage_area"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Enterprise WLAN", " Reactive jammer", " Jammer detection", " Jammer localization"], "paper_abstract": "The deployment of wireless networks for Internet connectivity has been rapid during the last decade. Following this trend, enterprises utilize multiple access points (APs) in order to provide wireless connectivity to authorized users within its premises. However, wireless networks are extremely vulnerable to PHY/MAC layer attacks such as jamming. A jammer transmits electromagnetic energy on the medium in order to either block the access to any legitimate transmitter or cause collisions at the receiver (or both). One of the most advanced jamming models is that of reactive jamming. A reactive jammer does not constantly transmit energy on the air, but only jams when a legitimate (target) packet is on the medium, aiming at its collision at the receiver. Previous studies have shown that reactive jamming is one of the most difficult attack models to detect. In this work, we propose a scheme that performs both detection and localization of a reactive jammer in an enterprise WiFi network. In brief, a reactive jammer can virtually increase the interference range of the target AP and thus increase the busy times of nearby APs that use the same frequency. By quantifying this effect we are able to accurately detect the presence of a reactive jammer and perform a coarse grain localization of the jammer. Our simulation results show that our scheme can achieve high true positives and low false positives simultaneously. In addition, our coarse grain localization scheme exhibits error on the order of the AP coverage area. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Joint reactive jammer detection and localization in an enterprise WiFi network", "paper_id": "WOS:000328011900004"}