{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "assistive_mobile_manipulator"}, {"score": 0.04865336171413102, "phrase": "manipulator_arm"}, {"score": 0.040879758756038886, "phrase": "manipulability_criterion"}, {"score": 0.004742730438544081, "phrase": "assistive_robotics"}, {"score": 0.0045324756541157574, "phrase": "manipulation_functions"}, {"score": 0.004442032546224076, "phrase": "upper_limb_disabilities"}, {"score": 0.004202472962684885, "phrase": "global_strategy"}, {"score": 0.003975781274672803, "phrase": "mobile_base"}, {"score": 0.003558294449586273, "phrase": "arm_manipulable"}, {"score": 0.0033156708990372047, "phrase": "human-like_behaviour"}, {"score": 0.0032494292163722065, "phrase": "disabled_operator"}, {"score": 0.0024742098091226203, "phrase": "global_mission"}, {"score": 0.0023523750536537102, "phrase": "partial_results"}, {"score": 0.0023053339328456234, "phrase": "real_robot"}, {"score": 0.002158836285985314, "phrase": "autonomous_path_planning"}, {"score": 0.0021049977753042253, "phrase": "mobile_arm"}], "paper_keywords": ["Manipulability", " Disabled people assistance", " Mobile arm"], "paper_abstract": "In assistive robotics, a manipulator arm constitutes one possible solution for restoring some manipulation functions to victims of upper limb disabilities. The aim of this paper is to present a global strategy of approach of an assistive mobile manipulator (manipulator arm mounted on a mobile base). A manipulability criterion is defined to deal with the redundancy of the system. The aim is to keep the arm manipulable, i.e. capable of moving by itself. The strategy is based on human-like behaviour to help the disabled operator to understand the action of the robot. When the robot is far from its objective, only the mobile base moves, thus avoiding obstacles if necessary. When the objective is close to the robot, both mobile base and arm move and redundancy can be used to maximise a manipulability criterion. All the situations are tested separately and a global mission is realised in which all the previous situations are encountered. The partial results obtained with the real robot consolidate the results of simulation. This paper does not propose an autonomous path planning and navigation of the mobile arm but an assistance to the user for remote controlling it. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Strategy of approach for seizure of an assistive mobile manipulator", "paper_id": "WOS:000263691200015"}