{"auto_keywords": [{"score": 0.04842950119492684, "phrase": "neutral_particle_transport_equation"}, {"score": 0.0470571913429052, "phrase": "goal-based_adaptive_methods"}, {"score": 0.00481495049065317, "phrase": "goal-based_angular_adaptivity"}, {"score": 0.004719473826242326, "phrase": "wavelet-based_discretisation"}, {"score": 0.004143196873246147, "phrase": "octahedral_wavelet_discretisation"}, {"score": 0.004081385289516914, "phrase": "spherical_angular_domain"}, {"score": 0.004000396172153709, "phrase": "anisotropic_resolution"}, {"score": 0.003940706575253453, "phrase": "angular_resolution"}, {"score": 0.0036921366375716005, "phrase": "inner-element_sub-grid_scale_finite_element_method"}, {"score": 0.003511613254403125, "phrase": "angular_discretisation"}, {"score": 0.00327356326590461, "phrase": "goal-based_error_estimators"}, {"score": 0.0031765314093444956, "phrase": "adjoint_system"}, {"score": 0.0022133711375320244, "phrase": "angular_domain"}, {"score": 0.0021693692831601745, "phrase": "transport_equation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Radiation transport", " Adaptivity", " Goal-based adaptivity", " A posteriori error analysis", " Wavelets"], "paper_abstract": "A method for applying goal-based adaptive methods to the angular resolution of the neutral particle transport equation is presented. The methods are applied to an octahedral wavelet discretisation of the spherical angular domain which allows for anisotropic resolution. The angular resolution is adapted across both the spatial and energy dimensions. The spatial domain is discretised using an inner-element sub-grid scale finite element method. The goal-based adaptive methods optimise the angular discretisation to minimise the error in a specific functional of the solution. The goal-based error estimators require the solution of an adjoint system to determine the importance to the specified functional. The error estimators and the novel methods to calculate them are described. Several examples are presented to demonstrate the effectiveness of the methods. It is shown that the methods can significantly reduce the number of unknowns and computational time required to obtain a given error. The novelty of the work is the use of goal-based adaptive methods to obtain anisotropic resolution in the angular domain for solving the transport equation. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Goal-based angular adaptivity applied to a wavelet-based discretisation of the neutral particle transport equation", "paper_id": "WOS:000346429300050"}