{"auto_keywords": [{"score": 0.04739412186980774, "phrase": "context"}, {"score": 0.015528560059505895, "phrase": "clinical_reports"}, {"score": 0.014528717842049607, "phrase": "clinical_conditions"}, {"score": 0.00481495049065317, "phrase": "temporal_status"}, {"score": 0.0037864980290391354, "phrase": "simple_lexical_clues"}, {"score": 0.0034558655164987134, "phrase": "paper_address"}, {"score": 0.0033575566897536906, "phrase": "simple_surface-based_approach"}, {"score": 0.002948547333717581, "phrase": "different_clinical_report_types"}, {"score": 0.0027965187255008647, "phrase": "good_performance"}, {"score": 0.00242047093248845, "phrase": "comprehensive_solution"}, {"score": 0.002329009499335603, "phrase": "clinical_condition"}, {"score": 0.002208853811052348, "phrase": "surface_clues"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Natural language processing", " Negation", " Temporality", " Clinical reporting"], "paper_abstract": "In this paper we describe an algorithm called ConText for determining whether clinical conditions mentioned in clinical reports are negated, hypothetical, historical, or experienced by someone other than the patient. The algorithm infers the status of a condition with regard to these properties from simple lexical clues occurring in the context of the condition. The discussion and evaluation of the algorithm presented in this paper address the questions of whether a simple surface-based approach which has been shown to work well for negation can be successfully transferred to other contextual properties of clinical conditions, and to what extent this approach is portable among different clinical report types. In our study we find that ConText obtains reasonable to good performance for negated, historical, and hypothetical conditions across all report types that contain such conditions. Conditions experienced by someone other than the patient are very rarely found in our report set. A comprehensive solution to the problem of determining whether a clinical condition is historical or recent requires knowledge above and beyond the surface clues picked up by ConText. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "ConText: An algorithm for determining negation, experiencer, and temporal status from clinical reports", "paper_id": "WOS:000270870500010"}