{"auto_keywords": [{"score": 0.03693349071862124, "phrase": "english"}, {"score": 0.014701201914752837, "phrase": "medicine"}, {"score": 0.00481495049065317, "phrase": "published_medical_and_non-medical_literature"}, {"score": 0.0047003115977448905, "phrase": "better_understanding"}, {"score": 0.004268293864953256, "phrase": "scholarly_fields"}, {"score": 0.004152288616186981, "phrase": "\"publication_misconduct"}, {"score": 0.0034236045013591437, "phrase": "retraction_rates"}, {"score": 0.0032398798149196432, "phrase": "different_disciplines"}, {"score": 0.0030239842475439814, "phrase": "annual_rate_of_article_retractions"}, {"score": 0.002851790448644913, "phrase": "misconduct_allegations"}, {"score": 0.0026525207297080937, "phrase": "research_integrity"}, {"score": 0.0026252106881752067, "phrase": "news_media"}, {"score": 0.0024756677425317474, "phrase": "major_scholarly_disciplines"}, {"score": 0.0024501740852758505, "phrase": "higher_rate"}, {"score": 0.0023999697562763433, "phrase": "non-english_speaking_countries"}, {"score": 0.002310578855290687, "phrase": "english_manuscripts"}, {"score": 0.002255431275670053, "phrase": "junior_scholars"}, {"score": 0.0022399174232611853, "phrase": "proper_codes"}, {"score": 0.0021049977753042253, "phrase": "biomedical_fields"}], "paper_keywords": ["Research misconduct", " Plagiarism", " PubMed", " Non-PubMed", " Scholarly disciplines"], "paper_abstract": "Better understanding of research and publishing misconduct can improve strategies to mitigate their occurrence. In this study, we examine various trends among 2,375 articles retracted due to misconduct in all scholarly fields. Proportions of articles retracted due to \"publication misconduct\" (primarily plagiarism and duplicate publication) or \"distrust data or interpretations\" (primarily research artifacts and unexplained irreproducibility of data) differ significantly between PubMed (35 and 59 %, respectively) and non-PubMed (56 and 27 %) articles and between English- and non-English-speaking author affiliation countries. Retraction rates due to any form of misconduct, adjusted for the size of the literature in different disciplines, vary from 0.22 per 100,000 articles in the Humanities to 7.58 in Medicine and 7.69 in Chemistry. The annual rate of article retractions due to misconduct has increased exponentially since 2001, and the percentage of all retractions involving misconduct allegations has grown from 18.5-29.2 % for each year from 1990-1993 to 55.8-71.9 % for each year from 2007-2010. Despite these increases, the prominence of research integrity in the news media has not changed appreciably over the past 20 years. Articles retracted due to misconduct are found in all major scholarly disciplines. The higher rate of plagiarism among authors from non-English speaking countries may diminish if institutions improved their support for the writing of English manuscripts by their scholars. The training of junior scholars on proper codes of research (and publishing) conduct should be embraced by all disciplines, not just by biomedical fields where the perception of misconduct is high.", "paper_title": "The impact of misconduct on the published medical and non-medical literature, and the news media", "paper_id": "WOS:000321852600012"}