{"auto_keywords": [{"score": 0.04719839762621183, "phrase": "del_quantifier"}, {"score": 0.0453665111651286, "phrase": "fixed_points"}, {"score": 0.00481495049065317, "phrase": "operational_semantics"}, {"score": 0.004765482708043842, "phrase": "bisimulation_relations"}, {"score": 0.004692227830462433, "phrase": "finite_pi-calculus"}, {"score": 0.004456044928556639, "phrase": "generic_judgments"}, {"score": 0.004188198923320451, "phrase": "finite_case"}, {"score": 0.0037188360359702182, "phrase": "coinductive_nature"}, {"score": 0.0035497797026638033, "phrase": "delicate_issues"}, {"score": 0.0034236045013591437, "phrase": "pi-calculus_expressions"}, {"score": 0.0027126684113045756, "phrase": "early_and_late_bisimulation"}, {"score": 0.0026297428083782875, "phrase": "bound_input"}, {"score": 0.0026026666736474404, "phrase": "output_actions"}, {"score": 0.0025625729433234623, "phrase": "proof_search"}, {"score": 0.0024971144603069006, "phrase": "inference_rules"}, {"score": 0.0023958326775913165, "phrase": "complete_proof_systems"}, {"score": 0.0023711591828229736, "phrase": "one-step_transitions"}, {"score": 0.002286781334850213, "phrase": "modal_logic"}, {"score": 0.0021049977753042253, "phrase": "extended_logic"}], "paper_keywords": ["Theory", " Verification", " Proof search", " lambda-tree syntax", " del quantifier", " generic judgments", " higher-order abstract syntax", " pi-calculus", " bisimulation", " modal logics"], "paper_abstract": "We specify the operational semantics and bisimulation relations for the finite pi-calculus within a logic that contains the del quantifier for encoding generic judgments and definitions for encoding fixed points. Since we restrict to the finite case, the ability of the logic to unfold fixed points allows this logic to be complete for both the inductive nature of operational semantics and the coinductive nature of bisimulation. The del quantifier helps with the delicate issues surrounding the scope of variables within pi-calculus expressions and their executions (proofs). We illustrate several merits of the logical specifications permitted by this logic: they are natural and declarative; they contain no side-conditions concerning names of variables while maintaining a completely formal treatment of such variables; differences between late and open bisimulation relations arise from familar logic distinctions; the interplay between the three quantifiers (for all, there exists, and del) and their scopes can explain the differences between early and late bisimulation and between various modal operators based on bound input and output actions; and proof search involving the application of inference rules, unification, and backtracking can provide complete proof systems for one-step transitions, bisimulation, and satisfaction in modal logic. We also illustrate how one can encode the pi-calculus with replications, in an extended logic with induction and co-induction.", "paper_title": "Proof Search Specifications of Bisimulation and Modal Logics for the pi-calculus", "paper_id": "WOS:000274028600005"}