{"auto_keywords": [{"score": 0.0442478049614069, "phrase": "location-based_services"}, {"score": 0.00481495049065317, "phrase": "location-based_services-multi-graph_representation"}, {"score": 0.0046069985410261746, "phrase": "consumer_electronics"}, {"score": 0.004449899743607532, "phrase": "mobile_user's_geo-spatial_location"}, {"score": 0.0041384457437123635, "phrase": "service_users"}, {"score": 0.004073665268036686, "phrase": "transportation_network"}, {"score": 0.0032046857274089747, "phrase": "latter_type"}, {"score": 0.0031346115554600003, "phrase": "ideal_basis"}, {"score": 0.0030854957471873785, "phrase": "query_processing_tasks"}, {"score": 0.0029707255179288222, "phrase": "central_aspects"}, {"score": 0.0029427043216782604, "phrase": "problem_domain"}, {"score": 0.002878342135479895, "phrase": "different_types"}, {"score": 0.0027106334164712057, "phrase": "lane_shift"}, {"score": 0.0026597250663309385, "phrase": "turn_restrictions"}, {"score": 0.0025365874386986493, "phrase": "possible_map_instances"}, {"score": 0.002512650904797186, "phrase": "semantically_rich_two-dimensional_model"}, {"score": 0.002473256335879102, "phrase": "graph_model"}, {"score": 0.002419136901298873, "phrase": "two-dimensional_model_instances"}, {"score": 0.002321744299010337, "phrase": "previously_proposed_query_processing_techniques"}, {"score": 0.0022423971916457684, "phrase": "complex_transportation_networks"}, {"score": 0.002186395051086251, "phrase": "compacting_graphs"}, {"score": 0.0021049977753042253, "phrase": "intended_applications"}], "paper_keywords": ["location-based services", " multi-graph model", " transportation network model", " spatial network model", " lane-based model"], "paper_abstract": "Advances in wireless communications, positioning technologies, and consumer electronics combine to enable a range of applications that use a mobile user's geo-spatial location to deliver on-line, location-enhanced services, often referred to as location-based services. This paper assumes that the service users are constrained to a transportation network, and it delves into the modeling of such networks, points of interest, and the service users with the objective of supporting location-based services. In particular, the paper presents a framework that encompasses two interrelated models-a two-dimensional, spatial representation and a multi-graph presentation. The former, high-fidelity model may be used for the positioning of content and users in the infrastructure (e.g., using map matching). The latter type of model is recognized as an ideal basis for a variety of query processing tasks, e.g., route and distance computations. Together, the two models capture central aspects of the problem domain needed in order to support the different types of queries that underlie location-based services. Notably, the framework is capable of capturing roads with lanes, lane shift and u-turn regulations, and turn restrictions. As part of the framework, the paper constructively demonstrates how it is possible map instances of the semantically rich two-dimensional model to instances of the graph model that preserve the topology of the two-dimensional model instances. In doing so, the paper demonstrates how a wealth of previously proposed query processing techniques based on graphs are applicable even in the context of complex transportation networks. The paper also presents means of compacting graphs while preserving aspects of the graphs that are important for the intended applications.", "paper_title": "Enabling location-based services-multi-graph representation of transportation networks", "paper_id": "WOS:000254184000005"}