{"auto_keywords": [{"score": 0.04933588390811375, "phrase": "crime_series"}, {"score": 0.006470420496636272, "phrase": "crime_analysts"}, {"score": 0.00481495049065317, "phrase": "rotten_core"}, {"score": 0.004274981117736524, "phrase": "important_step"}, {"score": 0.004248294537944227, "phrase": "predictive_policing"}, {"score": 0.004117329555194574, "phrase": "paramount_importance"}, {"score": 0.003819187440994939, "phrase": "automated_tools"}, {"score": 0.003643873052150612, "phrase": "key_hypothesis"}, {"score": 0.0033905067962602515, "phrase": "modus_operandi"}, {"score": 0.0030097975788892896, "phrase": "subspace_clustering_method"}, {"score": 0.002818013056816282, "phrase": "similarity_graph"}, {"score": 0.002671722386856879, "phrase": "integer_linear_programming_approach"}, {"score": 0.0025330067698575527, "phrase": "full_crime_series"}, {"score": 0.0024014759148123736, "phrase": "pattern-general_similarity"}, {"score": 0.002327310963701377, "phrase": "pattern-specific_similarity"}, {"score": 0.002172093645267283, "phrase": "general_pattern_detection"}, {"score": 0.002158505888557746, "phrase": "crime_series_detection"}], "paper_keywords": ["subspace clustering", " crime series detection", " dense core sets", " pattern mining", " clustering with feature selection", " similarity graph"], "paper_abstract": "One of the most challenging problems facing crime analysts is that of identifying crime series, which are sets of crimes committed by the same individual or group. Detecting crime series can be an important step in predictive policing, as knowledge of a pattern can be of paramount importance toward finding the offenders or stopping the pattern. Currently, crime analysts detect crime series manually; our goal is to assist them by providing automated tools for discovering crime series from within a database of crimes. Our approach relies on a key hypothesis that each crime series possesses at least one core of crimes that are very similar to each other, which can be used to characterize the modus operandi (M.O.) of the criminal. Based on this assumption, as long as we find all of the cores in the database, we have found a piece of each crime series. We propose a subspace clustering method, where the subspace is the M.O. of the series. The method has three steps: We first construct a similarity graph to link crimes that are generally similar, second we find cores of crime using an integer linear programming approach, and third we construct the rest of the crime series by merging cores to form the full crime series. To judge whether a set of crimes is indeed a core, we consider both pattern-general similarity, which can be learned from past crime series, and pattern-specific similarity, which is specific to the M.O. of the series and cannot be learned. Our method can be used for general pattern detection beyond crime series detection, as cores exist for patterns in many domains.", "paper_title": "Finding Patterns with a Rotten Core: Data Mining for Crime Series with Cores", "paper_id": "WOS:000355563100002"}