{"auto_keywords": [{"score": 0.004591345494188032, "phrase": "whole_financial_crisis"}, {"score": 0.004510184935928004, "phrase": "david_leonhardt's_new_york_times_article"}, {"score": 0.004378078970574258, "phrase": "credit_crisis"}, {"score": 0.004028326293950714, "phrase": "major_media_outlet"}, {"score": 0.0035341028694769036, "phrase": "pervasive_media_coverage"}, {"score": 0.0034101316738399203, "phrase": "public's_lack"}, {"score": 0.003251552926963083, "phrase": "information_overload"}, {"score": 0.0030454408569868347, "phrase": "bewildering_rates"}, {"score": 0.002719644855867468, "phrase": "accelerating_data_deluge"}, {"score": 0.0026241684260044414, "phrase": "precious_and_scarce_commodities"}, {"score": 0.002414191082427217, "phrase": "meaningful_narratives"}, {"score": 0.0021946656099592608, "phrase": "evolving_story"}, {"score": 0.0021049977753042253, "phrase": "echo_chamber"}], "paper_keywords": [""], "paper_abstract": "RAISE YOUR HAND if you don't quite understand this whole financial crisis, said David Leonhardt's New York Times article, March 2008. The credit crisis had been going on for seven months and extensively and continuously covered by every major media outlet in the world. Despite that coverage, many readers felt they did not understand what it was about. Paradoxically, pervasive media coverage may have contributed to the public's lack of understanding, a phenomenon known as information overload. Recent technology advances allow us to produce data at bewildering rates, while the surge of the Web has brought down the barriers of distribution. Yet despite this accelerating data deluge, knowledge and attention remain precious and scarce commodities. Writers, researchers, and analysts spend countless hours gathering information and synthesizing meaningful narratives, examining and inferring relationships among pieces of information. Subtleties and relationships in an evolving story are easy to lose in an echo chamber created by the modification and reuse of content, as fueled by incentives to attract indexers, eyeballs, and clicks on advertisements.", "paper_title": "Information Cartography", "paper_id": "WOS:000363563800024"}