{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "systems_with"}, {"score": 0.0045122922461952805, "phrase": "lorenz-like_three-dimensional_quadratic_autonomous_chaotic_systems"}, {"score": 0.003802135020791801, "phrase": "second_type"}, {"score": 0.003735349093835257, "phrase": "introduced_system"}, {"score": 0.0031845067058084583, "phrase": "asymptotical_characterization"}, {"score": 0.0030195184114140063, "phrase": "first_type"}, {"score": 0.002763261749602258, "phrase": "ternary_quadratic"}, {"score": 0.002573965014439041, "phrase": "sufficient_conditions"}, {"score": 0.0025286975935774245, "phrase": "chaotic_appearance"}, {"score": 0.0023694065215394593, "phrase": "numerical_simulations"}, {"score": 0.0023277282036119106, "phrase": "maximum_lyapunov_exponent"}, {"score": 0.002233301265743633, "phrase": "first_step"}, {"score": 0.0021682027434117095, "phrase": "lorenz-like_dynamic_systems"}, {"score": 0.0021049977753042253, "phrase": "general_forms"}], "paper_keywords": ["Chaos", " Lorenz system", " equilibrium", " Lyapunov exponent"], "paper_abstract": "This paper introduces two types of Lorenz-like three-dimensional quadratic autonomous chaotic systems with 7 and 8 new parameters free of choice, respectively. Both systems are investigated at the equilibriums to study their chaotic characteristics. We focus our attention on the second type of the introduced system which consists of three nonlinear quadratic equations. Predictably, coordinates of the equilibriums are prohibitively complex. Therefore, instead of directly analyzing their stability, we prove the asymptotical characterization of equilibriums by utilizing our preliminary results derived for the first type of system. Our result shows that, though the coordinates of equilibriums satisfy a ternary quadratic, the system still contains only three equilibriums in circumstances of chaos. Sufficient conditions for the chaotic appearance of systems are derived. Our results are further verified by numerical simulations and the maximum Lyapunov exponent for several examples. Our research takes a first step in investigating chaos in Lorenz-like dynamic systems with strengthened nonlinearity and general forms of parameters.", "paper_title": "ON LORENZ-LIKE DYNAMIC SYSTEMS WITH STRENGTHENED NONLINEARITY AND NEW PARAMETERS", "paper_id": "WOS:000278193700007"}