{"auto_keywords": [{"score": 0.04330020244608253, "phrase": "virtual_characters"}, {"score": 0.007231004804993438, "phrase": "physiological_arousal"}, {"score": 0.007005371070266078, "phrase": "skin_conductance_responses"}, {"score": 0.006691744262533559, "phrase": "skin_conductance_level"}, {"score": 0.00481495049065317, "phrase": "multiple_dynamic_characters"}, {"score": 0.004764220976404241, "phrase": "immersive_virtual_environment"}, {"score": 0.004566567411073082, "phrase": "electrodermal_activity"}, {"score": 0.004255121395629569, "phrase": "proxemics_theory"}, {"score": 0.0038271712887391015, "phrase": "short_time_period"}, {"score": 0.002998688867384969, "phrase": "response_variables"}, {"score": 0.0028740705307540317, "phrase": "typical_adaptation_effect"}, {"score": 0.0024947959375982614, "phrase": "humanoid_characters"}, {"score": 0.0024251568696803177, "phrase": "physiological_data"}, {"score": 0.0023408288327263294, "phrase": "quantitative_arousal_response"}, {"score": 0.0023079225317714793, "phrase": "virtual_objects"}, {"score": 0.002275477757478827, "phrase": "profound_difference"}, {"score": 0.002259426425685765, "phrase": "qualitative_response"}, {"score": 0.0021049977753042253, "phrase": "heightened_physiological_arousal"}], "paper_keywords": ["Experimentation", " Human Factors", " Human-computer interaction", " proxemics", " virtual characters", " avatars"], "paper_abstract": "An experiment was carried out to examine the impact on electrodermal activity of people when approached by groups of one or four virtual characters at varying distances. It was premised on the basis of proxemics theory that the closer the approach of the virtual characters to the participant, the greater the level of physiological arousal. Physiological arousal was measured by the number of skin conductance responses within a short time period after the approach, and the maximum change in skin conductance level 5 s after the approach. The virtual characters were each either female or a cylinder of human size, and one or four characters approached each subject a total of 12 times. Twelve male subjects were recruited for the experiment. The results suggest that the number of skin conductance responses after the approach and the change in skin conductance level increased the closer the virtual characters approached toward the participants. Moreover, these response variables were inversely correlated with the number of visits, showing a typical adaptation effect. There was some evidence to suggest that the number of characters who simultaneously approached (one or four) was positively associated with the responses. Surprisingly there was no evidence of a difference in response between the humanoid characters and cylinders on the basis of this physiological data. It is suggested that the similarity in this quantitative arousal response to virtual characters and virtual objects might mask a profound difference in qualitative response, an interpretation supported by questionnaire and interview results. Overall the experiment supported the premise that people exhibit heightened physiological arousal the closer they are approached by virtual characters.", "paper_title": "Proxemics with Multiple Dynamic Characters in an Immersive Virtual Environment", "paper_id": "WOS:000289362100003"}