{"auto_keywords": [{"score": 0.04146305422586981, "phrase": "weber"}, {"score": 0.00871102211436605, "phrase": "marx"}, {"score": 0.004764435715755502, "phrase": "social_science"}, {"score": 0.0045355866228818514, "phrase": "early_sociologists"}, {"score": 0.004394281902031765, "phrase": "revolutionary_effects"}, {"score": 0.004239118176902166, "phrase": "durkheim"}, {"score": 0.0038309141193444015, "phrase": "iron_cage"}, {"score": 0.00371148138781691, "phrase": "comprehensive_structural_concept"}, {"score": 0.0035579889785989738, "phrase": "key_concept"}, {"score": 0.0031901183059524804, "phrase": "concrete_paths"}, {"score": 0.0031455000569352454, "phrase": "critical_sociologists"}, {"score": 0.002810240488642749, "phrase": "systems_analysts"}, {"score": 0.002732149335827768, "phrase": "systemic_potential"}, {"score": 0.0026562224049977213, "phrase": "dynamic_interplay"}, {"score": 0.0024236964502593254, "phrase": "social_relations"}, {"score": 0.002242879896352752, "phrase": "felix_geyer"}, {"score": 0.0022192891418394514, "phrase": "systems_approach"}, {"score": 0.0021805201234139475, "phrase": "de-alienating_modes"}], "paper_keywords": ["sociology", " critical thinking", " social structure"], "paper_abstract": "Purpose - To show that, although it is not intuitively evident, it is clear that, for the researchers, studying alienation is one way of doing social science that contributes to making society better. Design/methodology/approach - Reference is made to early sociologists who developed theories that describe and explain the revolutionary effects of modernity, as evidenced in industrialization and in the enlightenment. The references include Durkheim who developed the concept of anomie to suggest disorders of the consciousness; Weber who described the effects of bureaucratization as an iron cage; and Marx who discussed alienation as a comprehensive structural concept. Findings - In light of what they saw as the key concept for the frustrations, each of the fathers of sociology had a view of how the malaise of modernity could be overcome. Today, some sociologists can point to concrete paths to improvement. Critical sociologists show that, although alienation is still prevalent, the very structures that cause its persistence also indicate how it can be undermined so as to lead to a reconstruction of society. Systems analysts are also able to delve into the systemic potential for releasing energies of liberation through the dynamic interplay of macro-arrangements, micro-procedures, and emotions. Originality/value - Given that it is important to researchers who study alienation to find ways for reconstructing social relations, it is gratifying to know that, in his work as the President of the Research Committee for the study of alienation, Felix Geyer applied the systems approach to a construction of de-alienating modes of collaboration, even as he continued to develop his own research productively.", "paper_title": "Studying alienation: toward a better society?", "paper_id": "WOS:000238081100019"}