{"auto_keywords": [{"score": 0.033725015917348174, "phrase": "quorum_q"}, {"score": 0.00481495049065317, "phrase": "string_motif_bases"}, {"score": 0.004133292222875435, "phrase": "useful_conceptual_tool"}, {"score": 0.003819339842998955, "phrase": "discovery_process"}, {"score": 0.0034555479218891638, "phrase": "large_part"}, {"score": 0.0034193226278107346, "phrase": "combinatorial_properties"}, {"score": 0.003226744277130179, "phrase": "binary_alphabets"}, {"score": 0.0030130446986008277, "phrase": "host_string"}, {"score": 0.0029657683623403085, "phrase": "present_paper"}, {"score": 0.0029038817737006405, "phrase": "motif_bases"}, {"score": 0.002769304577201566, "phrase": "binary_and_general_alphabets"}, {"score": 0.0026830601040919166, "phrase": "important_results"}, {"score": 0.0021385822825864425, "phrase": "suitable_algorithms"}], "paper_keywords": [""], "paper_abstract": "Bases of generators of motifs consisting of strings in which some positions can be occupied by a don't care provide a useful conceptual tool for their description and a way to reduce the time and space involved in the discovery process. In the last few years, a few algorithms have been proposed for the extraction of a basis, building in large part on combinatorial properties of strings and their autocorrelations. Currently, the most efficient techniques for binary alphabets and quorum q = 2 require time quadratic in the length of the host string. The present paper explores properties of motif bases for quorum q >= 2, both with binary and general alphabets, by also showing that important results holding for quorum q = 2 cannot be extended to this, more general, case. Furthermore, the extraction of motifs in which a bound is set on the maximum allowed number of don't cares is addressed, and suitable algorithms are proposed whose computational complexity depends on the fixed bound. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Extracting string motif bases for quorum higher than two", "paper_id": "WOS:000310864000011"}