{"auto_keywords": [{"score": 0.049217710328296, "phrase": "spatial_properties"}, {"score": 0.01091708983021968, "phrase": "spacing_calculation"}, {"score": 0.00481495049065317, "phrase": "visual_basic"}, {"score": 0.0046221918332842995, "phrase": "software_tool"}, {"score": 0.0038368442918503072, "phrase": "user-friendly_interactive_environment"}, {"score": 0.0036332251283046997, "phrase": "secondary_sampling_grid"}, {"score": 0.003378385493203297, "phrase": "nearest_lineament"}, {"score": 0.0032725712584012953, "phrase": "default_procedure"}, {"score": 0.0031129269142224194, "phrase": "mode_value"}, {"score": 0.0030707512751243214, "phrase": "length_distribution"}, {"score": 0.002988101395789399, "phrase": "study_area"}, {"score": 0.0028293966058473476, "phrase": "manual_method"}, {"score": 0.00245724480030654, "phrase": "neighbouring_parallel_lineaments"}, {"score": 0.0024129269611844794, "phrase": "direct_information"}, {"score": 0.0023586493263143553, "phrase": "block_sizes"}, {"score": 0.0022231606165229235, "phrase": "actual_area"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["lineaments", " frequency", " spacing", " length", " azimuth"], "paper_abstract": "A software tool is presented which calculates the spatial properties azimuth, length, spacing, and frequency of lineaments that are defined by their starting and ending co-ordinates in a two-dimensional (2-D) planar co-ordinate system. A simple graphical interface with five display windows creates a user-friendly interactive environment. All lineaments are considered in the calculations, and no secondary sampling grid is needed for the elaboration of the spatial properties. Several rule-based decisions are made to determine the nearest lineament in the spacing calculation. As a default procedure, the programme defines a window that depends on the mode value of the length distribution of the lineaments in a study area. This makes the results more consistent, compared to the manual method of spacing calculation. Histograms are provided to illustrate and elaborate the distribution of the azimuth, length and spacing. The core of the tool is the spacing calculation between neighbouring parallel lineaments, which gives direct information about the variation of block sizes in a given category of structures. The 2-D lineament frequency is calculated for the actual area that is occupied by the lineaments. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "The spacing calculator software - A Visual Basic program to calculate spatial properties of lineaments", "paper_id": "WOS:000236782000011"}