{"auto_keywords": [{"score": 0.035310206753120556, "phrase": "manual_extraction"}, {"score": 0.03434565590886126, "phrase": "automatic_extraction"}, {"score": 0.032235483295731476, "phrase": "grey_level"}, {"score": 0.00481495049065317, "phrase": "automated_diagnostic_system"}, {"score": 0.004688938412201479, "phrase": "proposed_automated_diagnostic_system"}, {"score": 0.004538344101960842, "phrase": "automatic_feature_extraction"}, {"score": 0.004312622975366676, "phrase": "new_features_extraction_algorithm"}, {"score": 0.004165552838725006, "phrase": "cervical_cells_features"}, {"score": 0.004140122683058907, "phrase": "extracted_features"}, {"score": 0.004089725258435817, "phrase": "input_data"}, {"score": 0.004064756130719647, "phrase": "intelligent_diagnostic_part"}, {"score": 0.004039938829404262, "phrase": "new_artificial_neural_network"}, {"score": 0.0039021313913903816, "phrase": "cervical_pre-cancerous_stage"}, {"score": 0.0036181717017041387, "phrase": "proposed_diagnostic_system"}, {"score": 0.0035522728221772694, "phrase": "lsil"}, {"score": 0.0035233696341819437, "phrase": "hsil"}, {"score": 0.0034521328091451585, "phrase": "automatic_feature_extraction_performance"}, {"score": 0.003438058620195309, "phrase": "correlation_test_approach"}, {"score": 0.003375429082739004, "phrase": "rgbfe_algorithm"}, {"score": 0.003187761620097287, "phrase": "region_color"}, {"score": 0.003148920562981098, "phrase": "grey_level_value"}, {"score": 0.0030726480920918097, "phrase": "estimated_size"}, {"score": 0.0030352053568852865, "phrase": "strong_linear_relationship"}, {"score": 0.002469032978674379, "phrase": "best_diagnostic_performance"}, {"score": 0.0022751198281648613, "phrase": "automatic_diagnostic_system"}, {"score": 0.0022018784586391575, "phrase": "rgbfe"}, {"score": 0.002188409934078973, "phrase": "automatic_feature_extraction_process"}, {"score": 0.002170839822853567, "phrase": "ann"}, {"score": 0.0021309898622781124, "phrase": "better_diagnostic_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["diagnostic system", " neural network", " pattern analysis", " region growing", " feature extraction", " cervical cancer"], "paper_abstract": "Objective: This paper proposes to develop an automated diagnostic system for cervical pre-cancerous. Methods and data samples: The proposed automated diagnostic system consists of two parts; an automatic feature extraction and an intelligent diagnostic. In the automatic feature extraction, the system automatically extracts four cervical cells features (i.e. nucleus size, nucleus grey level, cytoplasm size and cytoplasm grey level). A new features extraction algorithm called region-growing-based features extraction (RGBFE) is proposed to extract the cervical cells features. The extracted features will then be fed as input data to the intelligent diagnostic part. A new artificial neural network (ANN) architecture called hierarchical hybrid multilayered perceptron ((HMLP)-M-2) network is proposed to predict the cervical pre-cancerous stage into three classes, namely normal, low grade intra-epithelial squamous lesion (LSIL) and high grade intra-epithelial squamous lesion (HSIL). We empirically assess the capability of the proposed diagnostic system using 550 reported cases (211 normal cases, 143 LSIL cases and 196 HSIL cases). Results: For evaluation of the automatic feature extraction performance, correlation test approach was used to determine the capability of the RGBFE algorithm as compared to manual extraction by cytotechnologist. The manual extraction of size was recorded in micrometer while the automatic extraction of size was recorded in number of pixels. Region color was recorded in mean of grey level value for both manual and automatic extraction. The results show that the estimated size and mean of grey level have strong linear relationship (correlation test more than 0.8) with those extracted manually by cytotechnologist. Hence, the size of nucleus, size of cytoplasm and grey level of cytoplasm created very strong linear relationship with correlation test more than 0.95 (approaching one). For the intelligent diagnostic, the performance of the (HMLP)-M-2 network was compared with three standard ANNs (i.e. multilayered perceptron (MLP), radial basis function (RBF) and hybrid multilayered perceptron (HMLP)). The performance was done based on accuracy, sensitivity, specificity, false negative and false positive. The H 2 MLP network performed the best diagnostic performance as compared to other ANNs. It was able to achieve 97.50% accuracy, 100% specificity and 96.67% sensitivity. The false negative and false positive were 1.33% and 3.00%, respectively. Conclusions: This project has successfully developed an automatic diagnostic system for cervical pre-cancerous. This study has also successfully proposed one image processing technique namely the RGBFE algorithm for automatic feature extraction process and a new ANN architecture namely the H 2 MLP network for better diagnostic performance. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "An automated cervical pre-cancerous diagnostic system", "paper_id": "WOS:000253244900001"}