{"auto_keywords": [{"score": 0.047389436084135865, "phrase": "real_interactions"}, {"score": 0.043704949447414876, "phrase": "internal_elements"}, {"score": 0.03180308481916928, "phrase": "system_requirements"}, {"score": 0.03019469700256562, "phrase": "system_knowledge"}, {"score": 0.00481495049065317, "phrase": "human_and_system"}, {"score": 0.004772367030970874, "phrase": "intuitive_graphical_search_interface"}, {"score": 0.004605748839642513, "phrase": "new_model"}, {"score": 0.00450456611645112, "phrase": "human_conversations"}, {"score": 0.004232875294230749, "phrase": "human_and_systems"}, {"score": 0.0040309035566691645, "phrase": "new_interaction_model"}, {"score": 0.0034194194985380268, "phrase": "key_point"}, {"score": 0.002689076130099546, "phrase": "image_retrieval_system"}, {"score": 0.0024930878032164757, "phrase": "usability_test"}, {"score": 0.002405853977978678, "phrase": "proposed_interaction_model"}, {"score": 0.0023845255359681143, "phrase": "intuitive_searches"}, {"score": 0.0021813467128927347, "phrase": "user_knowledge"}, {"score": 0.0021049977753042253, "phrase": "changing_information_needs"}], "paper_keywords": ["Interaction model", " User knowledge", " Graphical search interface", " Dynamical hierarchy"], "paper_abstract": "Our objective was to propose a new model which provides real interactions like human conversations. In this paper, we defined \"interaction\" to mean not only superficial interactions between human and systems but also internal elements inspiring one another. We proposed a new interaction model by defining four user elements namely user knowledge, information needs, thinking, and feelings, and five system elements namely system knowledge, interaction algorithm, knowledge base, retrieval algorithm, and database. The key point is that users can understand inside the systems gradually and operate them flexibly in their own way to provide real interactions where users and systems inspire one another's internal elements. We then defined system requirements to realize this model so that users can change and comprehend system knowledge and that users interact with the system constantly. We constructed an image retrieval system applying our proposed graphical search interface named Concentric Ring View and confirmed that all system requirements were satisfied. In a usability test with 12 university students, we confirmed that the proposed interaction model provided intuitive searches to users by inspiring internal elements between users and systems. Users could continuously change and comprehend system knowledge, synchronize user knowledge, shifting thinking and feeling, and changing information needs.", "paper_title": "An interaction model between human and system for intuitive graphical search interface", "paper_id": "WOS:000333156900002"}