{"auto_keywords": [{"score": 0.04016264284336455, "phrase": "moving_object"}, {"score": 0.02720420464503381, "phrase": "mining_algorithm"}, {"score": 0.00481495049065317, "phrase": "semantic_trajectories"}, {"score": 0.00458869631642791, "phrase": "interesting_trajectory_patterns"}, {"score": 0.004503594685501314, "phrase": "data_mining_techniques"}, {"score": 0.00440825801245188, "phrase": "huge_volume"}, {"score": 0.00437302709192313, "phrase": "trajectory_data"}, {"score": 0.004280442521885289, "phrase": "data_processing"}, {"score": 0.0037948736326503534, "phrase": "pre-defined_amount"}, {"score": 0.003626071825044111, "phrase": "object's_trajectory"}, {"score": 0.003587453609308639, "phrase": "raw_trajectories"}, {"score": 0.003418681280929931, "phrase": "application-relevant_stops"}, {"score": 0.003346233959203152, "phrase": "semantic_trajectory"}, {"score": 0.0032753168662834516, "phrase": "raw_trajectory_data"}, {"score": 0.003071429173571846, "phrase": "regular_expressions"}, {"score": 0.002982258337258428, "phrase": "sequential_patterns"}, {"score": 0.0027965622831515463, "phrase": "data_mining_algorithm"}, {"score": 0.0027667539384678814, "phrase": "sequential_pattern_mining_techniques"}, {"score": 0.0027446057983474994, "phrase": "uninteresting_sequences"}, {"score": 0.002650655766450421, "phrase": "re-spam_expression"}, {"score": 0.002472269923319476, "phrase": "spatial_functions"}, {"score": 0.0024459097079751507, "phrase": "spatial_data"}, {"score": 0.00236849950258728, "phrase": "mo_trajectories"}, {"score": 0.002238866955912704, "phrase": "caching_techniques"}, {"score": 0.0021564027934811037, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "main_variables"}], "paper_keywords": ["Moving object databases", " semantic trajectories", " mobility patterns", " trajectory data mining"], "paper_abstract": "A typical problem in the field of moving object (MO) databases consists in discovering interesting trajectory patterns. To solve this problem, data mining techniques are commonly used. Due to the huge volume of these trajectory data, some form of compression facilitates the data processing. One of such compression techniques is based on the notion of stops and moves. In this approach, a set of places that are relevant to the application, denoted Places of Interest (POIs) is selected. If a moving object spends a pre-defined amount of time in a place of interest, this place is considered a stop for the object's trajectory. Thus, raw trajectories given by (O-id, t, x, y)-tuples can be replaced by a sequence of application-relevant stops. This leads to the concept of semantic trajectory, in short, a trajectory obtained by replacing raw trajectory data with a sequence of stops, and enriched with metadata of the POIs corresponding to such stops. We present a language based on regular expressions over constraints, denoted RE-SPaM, that can intensionally express sequential patterns. The constraints in RE-SPaM are defined as conjunctions of equalities over metadata of the POIs. In addition, we introduce a data mining algorithm, based on sequential pattern mining techniques, where uninteresting sequences are pruned in advance making use of the automaton that accepts a RE-SPaM expression. This makes the task of the analyst easier, and the mining algorithm more efficient. We also show that RE-SPaMcan be extended to support spatial functions, thus integrating spatial data in a moving object setting (proposals so far only account for the MO trajectories themselves). We denote the resulting language RE-SPaM+S. We show that the overhead of this extension is negligible, due to caching techniques that we explain in the paper. We close the paper with a case study over which we perform experiments to study the main variables that impact the performance of the mining algorithm.", "paper_title": "Mining semantic trajectories", "paper_id": "WOS:000324994600008"}