{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "template-free_activation_detection"}, {"score": 0.008660813757471532, "phrase": "event-related_fmri_data"}, {"score": 0.007596410318513114, "phrase": "wavelet_shrinkage"}, {"score": 0.00723440119417773, "phrase": "root-mean-square_error"}, {"score": 0.005841749559399048, "phrase": "wavelet_transform"}, {"score": 0.004542976479682312, "phrase": "event-related_functional_magnetic_resonance_imaging"}, {"score": 0.0038981499110532307, "phrase": "signal-to-noise_ratio"}, {"score": 0.0037921662574137535, "phrase": "fmri_data"}, {"score": 0.0034911335714333507, "phrase": "detection_setting"}, {"score": 0.0033037970113095577, "phrase": "main_ingredients"}, {"score": 0.0031942814007173254, "phrase": "voxel_time_courses"}, {"score": 0.003126481516783286, "phrase": "resulting_wavelet_coefficients"}, {"score": 0.0030789331635764122, "phrase": "appropriate_figure"}, {"score": 0.002976849168883199, "phrase": "shrunk_data"}, {"score": 0.00290473242917264, "phrase": "preprocessed_time_courses"}, {"score": 0.002617172812051206, "phrase": "simulated_fmri_data"}, {"score": 0.0026011706232569316, "phrase": "quantitative_evidence"}, {"score": 0.002469032978674379, "phrase": "improved_detectability"}, {"score": 0.002446419585138653, "phrase": "template-free_measures"}, {"score": 0.0023652572260178637, "phrase": "experimental_fmri_data"}, {"score": 0.0023221248824337576, "phrase": "proposed_method"}, {"score": 0.0022382002476510573, "phrase": "significant_interest"}, {"score": 0.002210903392596343, "phrase": "present_framework"}, {"score": 0.0021441057555396013, "phrase": "subsequent_data_analysis_steps"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Template-free", " Wavelet shrinkage", " Activation detection", " Event-related", " Functional magnetic resonance imaging"], "paper_abstract": "Objective: We propose a method for preprocessing event-related functional magnetic resonance imaging (fMRI) data that can lead to enhancement of template-free activation detection. The method is based on using a figure of merit to guide the wavelet shrinkage of a given fMRI data set. Background: Several previous studies have demonstrated that in the root-mean-square error setting, wavelet shrinkage can improve the signal-to-noise ratio of fMRI time courses. However, preprocessing fMRI data in the root-mean-square error setting does not necessarily lead to enhancement of template-free activation detection. Motivated by this observation, in this paper, we move to the detection setting and investigate the possibility of using wavelet shrinkage to enhance template-free activation detection of fMRI data. Methodology: The main ingredients of our method are (i) forward wavelet transform of the voxel time courses, (ii) shrinking the resulting wavelet coefficients as directed by an appropriate figure of merit, (iii) inverse wavelet transform of the shrunk data, and (iv) submitting these preprocessed time courses to a given activation detection algorithm. Two figures of merit are developed in the paper, and two other figures of merit adapted from the literature are described. Results: Receiver-operating characteristic analyses with simulated fMRI data showed quantitative evidence that data preprocessing as guided by the figures of merit developed in the paper can yield improved detectability of the template-free measures. We also demonstrate the application of our methodology on an experimental fMRI data set. Conclusions: The proposed method is useful for enhancing template-free activation detection in event-related fMRI data. It is of significant interest to extend the present framework to produce comprehensive, adaptive and fully automated preprocessing of fMRI data optimally suited for subsequent data analysis steps. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Investigating the enhancement of template-free activation detection of event-related fMRI data using wavelet shrinkage and figures of merit", "paper_id": "WOS:000290281900004"}