{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nonasymptotic"}, {"score": 0.004333406378146173, "phrase": "blocklength_achievability_bounds"}, {"score": 0.0038998328617557013, "phrase": "rate-limited_side-information"}, {"score": 0.0031933617014256676, "phrase": "channel_simulation"}, {"score": 0.002987463078971627, "phrase": "previous_nonasymptotic_bounds"}, {"score": 0.0029380909574836587, "phrase": "error_probability"}, {"score": 0.0025713100093065645, "phrase": "general_formulas"}, {"score": 0.0025287979714720423, "phrase": "optimal_rates"}, {"score": 0.002486987042061596, "phrase": "side-information_problems"}, {"score": 0.0023920904611571783, "phrase": "achievable_second-order_coding_rates"}, {"score": 0.0023394947463129642, "phrase": "multidimensional_berry-esseen_theorem"}, {"score": 0.0022253345930383257, "phrase": "second-order_coding_rates"}, {"score": 0.0021049977753042253, "phrase": "existing_finite_blocklength_bounds"}], "paper_keywords": ["Source coding", " channel coding", " side-information", " Wyner-Ahlswede-Korner", " Wyner-Ziv", " Gel'fand-Pinsker", " finite blocklength", " non-asymptotic", " second-order coding rates"], "paper_abstract": "We present a novel nonasymptotic or finite blocklength achievability bounds for three side-information problems in network information theory. These include: 1) the Wyner-Ahlswede-Korner (WAK) problem of almost-lossless source coding with rate-limited side-information; 2) the Wyner-Ziv (WZ) problem of lossy source coding with side-information at the decoder; and 3) the Gel'fand-Pinsker (GP) problem of channel coding with noncausal state information available at the encoder. The bounds are proved using ideas from channel simulation and channel resolvability. Our bounds for all three problems improve on all previous nonasymptotic bounds on the error probability of the WAK, WZ, and GP problems-in particular those derived by Verdu. Using our novel nonasymptotic bounds, we recover the general formulas for the optimal rates of these side-information problems. Finally, we also present achievable second-order coding rates by applying the multidimensional Berry-Esseen theorem to our new nonasymptotic bounds. Numerical results show that the second-order coding rates obtained using our nonasymptotic achievability bounds are superior to those obtained using existing finite blocklength bounds.", "paper_title": "Nonasymptotic and Second-Order Achievability Bounds for Coding With Side-Information", "paper_id": "WOS:000351470800005"}