{"auto_keywords": [{"score": 0.04498414907057226, "phrase": "power_consumption"}, {"score": 0.03697555422030672, "phrase": "power_topologies"}, {"score": 0.00481495049065317, "phrase": "molecular-scale_photonic_noc_power_topologies"}, {"score": 0.004449688143230257, "phrase": "optical_signal"}, {"score": 0.0042157995925335544, "phrase": "larger_crossbars"}, {"score": 0.004163587877500036, "phrase": "reduced_energy_budget"}, {"score": 0.004112020122418323, "phrase": "current_nanophotonic_noc_crossbars"}, {"score": 0.004061088450663783, "phrase": "communication_latency"}, {"score": 0.00396110232316167, "phrase": "high-radix_crossbar"}, {"score": 0.003863568356785813, "phrase": "primary_design_target"}, {"score": 0.00345344412693677, "phrase": "unique_capabilities"}, {"score": 0.003424850089214916, "phrase": "mnoc_technology"}, {"score": 0.003368367923339975, "phrase": "overall_interconnect_power_consumption"}, {"score": 0.0033266163944946185, "phrase": "power_topology"}, {"score": 0.0032717489668326275, "phrase": "logical_connectivity"}, {"score": 0.0030995835539697893, "phrase": "maximum_power"}, {"score": 0.0030739103951333696, "phrase": "additional_power_modes"}, {"score": 0.002581165831422692, "phrase": "thread_mapping_techniques"}, {"score": 0.002404885278896803, "phrase": "swmr_mnoc"}, {"score": 0.0022877332844249065, "phrase": "intelligent_thread_mapping"}, {"score": 0.002259346051668556, "phrase": "total_mnoc_power"}, {"score": 0.0021049977753042253, "phrase": "conventional_resonator-based_photonic_nocs"}], "paper_keywords": ["Nanophotonics", " Interconnection Network", " Energy Efficiency"], "paper_abstract": "Molecular-scale Network-on-Chip (mNoC) crossbars use quantum dot LEDs as an on-chip light source, and chromophores to provide optical signal filtering for receivers. An mNoC reduces power consumption or enables scaling to larger crossbars for a reduced energy budget compared to current nanophotonic NoC crossbars. Since communication latency is reduced by using a high-radix crossbar, minimizing power consumption becomes a primary design target. Conventional Single Writer Multiple Reader (SWMR) photonic crossbar designs broadcast all packets, and incur the commensurate required power, even if only two nodes are communicating. This paper introduces power topologies, enabled by unique capabilities of mNoC technology, to reduce overall interconnect power consumption. A power topology corresponds to the logical connectivity provided by a given power mode. Broadcast is one power mode and it consumes the maximum power. Additional power modes consume less power but allow a source to communicate with only a statically defined, potentially non-contiguous, subset of nodes. Overall interconnect power is reduced if the more frequently communicating nodes use modes that consume less power, while less frequently communicating nodes use modes that consume more power. We also investigate thread mapping techniques to fully exploit power topologies. We explore various mNoC power topologies with one, two and four power modes for a radix-256 SWMR mNoC crossbar. Our results show that the combination of power topologies and intelligent thread mapping can reduce total mNoC power by up to 51% on average for a set of 12 SPLASH benchmarks. Furthermore performance is 10% better than conventional resonator-based photonic NoCs and energy is reduced by 72%.", "paper_title": "More is Less, Less is More: Molecular-Scale Photonic NoC Power Topologies", "paper_id": "WOS:000370874900020"}