{"auto_keywords": [{"score": 0.045027842429353294, "phrase": "interaction_corpus"}, {"score": 0.004814975162246912, "phrase": "collaborative"}, {"score": 0.004132743580000062, "phrase": "human_behaviors"}, {"score": 0.003909301559145041, "phrase": "digital_multimedia"}, {"score": 0.003855347387268162, "phrase": "ubiquitous_sensor_technologies"}, {"score": 0.003308649946463136, "phrase": "future_digital_society"}, {"score": 0.0028590732866152118, "phrase": "well-structured_stored_experience"}, {"score": 0.0025578967205807843, "phrase": "wearable_and_ubiquitous_sensors"}, {"score": 0.0024876840172100567, "phrase": "video_cameras"}, {"score": 0.0024026156525362684, "phrase": "tracking_tags"}, {"score": 0.0022567398334877847, "phrase": "multiple_viewpoints"}, {"score": 0.0021049977753042253, "phrase": "video-based_experience_summary"}], "paper_keywords": ["interaction corpus", " experience capturing", " ubiquitous sensors"], "paper_abstract": "This paper proposes a notion of interaction corpus, a captured collection of human behaviors and interactions among humans and artifacts. Digital multimedia and ubiquitous sensor technologies create a venue to capture and store interactions that are automatically annotated. A very large-scale accumulated corpus provides an important infrastructure for a future digital society for both humans and computers to understand verbal/non-verbal mechanisms of human interactions. The interaction corpus can also be used as a well-structured stored experience, which is shared with other people for communication and creation of further experiences. Our approach employs wearable and ubiquitous sensors, such as video cameras, microphones, and tracking tags, to capture all of the events from multiple viewpoints simultaneously. We demonstrate an application of generating a video-based experience summary that is reconfigured automatically from the interaction corpus.", "paper_title": "Collaborative capturing, interpreting, and sharing of experiences", "paper_id": "WOS:000246339700005"}