{"auto_keywords": [{"score": 0.04633740170112977, "phrase": "raw_data"}, {"score": 0.015719716506582538, "phrase": "information_gateways"}, {"score": 0.015571915698046524, "phrase": "derivation-constrained_access_control"}, {"score": 0.012585782927062415, "phrase": "access_rights"}, {"score": 0.0047013405841819025, "phrase": "pervasive_computing_environments"}, {"score": 0.004612376827433774, "phrase": "specific_information"}, {"score": 0.004503525064934708, "phrase": "person's_location"}, {"score": 0.00409310463335204, "phrase": "confidential_raw_data"}, {"score": 0.003580355398511932, "phrase": "person's_location_information"}, {"score": 0.002648768009464535, "phrase": "client's_authorized_request"}, {"score": 0.0023954743066925714, "phrase": "formal_framework"}, {"score": 0.002372649454733251, "phrase": "derivation-con_strained_access_control"}, {"score": 0.0021354538918029286, "phrase": "sample_implementation"}, {"score": 0.0021049977753042253, "phrase": "performance_evaluation"}], "paper_keywords": [""], "paper_abstract": "In pervasive computing environments. information gateways derive specific information, such as a person's location. from raw data provided by a service, such as a videostream offered by a camera. Here, access control to confidential raw data provided by a service becomes difficult when a client does not have access rights to this data. For example. a client might have access to a person's location information. but not to the videostream from which a gateway derives this information. Simply granting access rights to a gateway will allow an intruder into the gateway to access any raw data that the gateway can access. We present the concept of derivation-constrained access control, which requires a gateway to prove to a service that the gateway needs requested raw data to answer a client's authorized request for derived information. Therefore, an intruder into the gateway will be limited in its capabilities. We provide a formal framework for derivation-con strained access control based on Lampson et al.'s \"speaks-for\" relationship. We demonstrate feasibility of our design with a sample implementation and a performance evaluation.", "paper_title": "Securing information gateways with derivation-constrained access control", "paper_id": "WOS:000238185800014"}