{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "secure_information_systems"}, {"score": 0.004736563452994885, "phrase": "increasing_dependency"}, {"score": 0.004685012337701536, "phrase": "information_systems"}, {"score": 0.004558564684763264, "phrase": "sensitive_information"}, {"score": 0.004435514622798228, "phrase": "development_methods"}, {"score": 0.004292212137716459, "phrase": "secure_and_private_information_systems"}, {"score": 0.003826007045267751, "phrase": "information_systems_development_methods"}, {"score": 0.003661987063211563, "phrase": "unified_framework"}, {"score": 0.003299977511820374, "phrase": "privacy_goals"}, {"score": 0.003228434077467506, "phrase": "development_framework"}, {"score": 0.002925149105307855, "phrase": "system_design"}, {"score": 0.0026213749921120623, "phrase": "unified_analysis"}, {"score": 0.002388043660169452, "phrase": "security_and_privacy_requirements_methods"}, {"score": 0.0021399277552314067, "phrase": "social_context"}, {"score": 0.0021049977753042253, "phrase": "real_case_study"}], "paper_keywords": ["Security", " privacy", " constraints", " goal modelling", " meta-model"], "paper_abstract": "The increasing dependency on information systems to process and manage sensitive information requires the usage of development methods that support the development of secure and private information systems. The literature provides examples of methods that focus on security and privacy individually but fail to provide evidence of information systems development methods that consider security and privacy in a unified framework. Security and privacy are very much related, in particular certain security properties and mechanisms support the achievement of privacy goals. Without a development framework to support developers to explicitly model that relationship, conflicts and vulnerabilities can be introduced to a system design that might endanger its security. In this paper, we present our work in developing a framework that supports the unified analysis of privacy and security. In particular, we present a meta-model that combines concepts from security and privacy requirements methods, such as security and privacy goals, properties, constraints, and actor and process patterns within a social context. A real case study is employed to demonstrate the applicability of our work.", "paper_title": "Aligning Security and Privacy to Support the Development of Secure Information Systems", "paper_id": "WOS:000308796100002"}