{"auto_keywords": [{"score": 0.03452455275991597, "phrase": "linguistic_majorities"}, {"score": 0.00481495049065317, "phrase": "social_choice"}, {"score": 0.004443276312972159, "phrase": "crisp_preference_values"}, {"score": 0.0038418515481939463, "phrase": "winner_alternative"}, {"score": 0.0036274201504044685, "phrase": "loser_alternative"}, {"score": 0.003545024951402821, "phrase": "new_aggregation_rule"}, {"score": 0.003372844338742438, "phrase": "crisp_preferences"}, {"score": 0.003308862957060602, "phrase": "linguistic_preferences"}, {"score": 0.00307657476125683, "phrase": "linguistic_labels"}, {"score": 0.0029722900280316216, "phrase": "specific_support"}, {"score": 0.0029158847555394714, "phrase": "election_process"}, {"score": 0.0027007380550259077, "phrase": "fuzzy_sets"}, {"score": 0.002472822097373027, "phrase": "representation_settings"}, {"score": 0.0023889533502525527, "phrase": "fuzzy_linguistic_majorities"}, {"score": 0.0022211005680689666, "phrase": "relevant_normative_properties"}, {"score": 0.0021457914748383303, "phrase": "pareto"}], "paper_keywords": ["Social choice", " Aggregation rule", " Linguistic preferences", " Linguistic majorities", " Fuzzy sets", " 2-Tuples", " Difference in support"], "paper_abstract": "In social choice voting, majorities based on difference of votes and their extension, majorities based on difference in support, implement the crisp preference values (votes) and the intensities of preference provided by voters when comparing pairs of alternatives, respectively. The aim of these rules is declaring which alternative is socially preferred and to that, they require the winner alternative to reach a certain positive difference in its social valuation with respect to the one reached by the loser alternative. This paper introduces a new aggregation rule that extends majorities based on difference of votes from the context of crisp preferences to the framework of linguistic preferences. Under linguistic majorities with difference in support, voters express their intensities of preference between pairs of alternatives using linguistic labels and an alternative defeats another one when a specific support, fixed before the election process, is reached. There exist two main representation methodologies of linguistic preferences: the cardinal one based on the use of fuzzy sets, and the ordinal one based on the use of the 2-tuples. Linguistic majorities with difference in support are formalised in both representation settings, and conditions are given to guarantee that fuzzy linguistic majorities and 2-tuple linguistic majorities are mathematically isomorphic. Finally, linguistic majorities based on difference in support are proved to verify relevant normative properties: anonymity, neutrality, monotonicity, weak Pareto and cancellativeness. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Linguistic majorities with difference in support", "paper_id": "WOS:000333056400018"}