{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_dependency"}, {"score": 0.00664209891041186, "phrase": "spanish_internet_users"}, {"score": 0.006105492378876764, "phrase": "media_dependency_scale"}, {"score": 0.005999243012800343, "phrase": "spanish_market"}, {"score": 0.0057719200134811865, "phrase": "internet_affinity"}, {"score": 0.004798053287579036, "phrase": "-_an_exploratory_study"}, {"score": 0.004764435715755502, "phrase": "future_purchase_intention"}, {"score": 0.004168448339217754, "phrase": "internet_exposure"}, {"score": 0.004139223748460922, "phrase": "online_experience"}, {"score": 0.0040102178375662914, "phrase": "behavioural_changes"}, {"score": 0.0038579703525471985, "phrase": "findings_-_data_analysis"}, {"score": 0.003659597920882104, "phrase": "intermediate_levels"}, {"score": 0.003608437115371213, "phrase": "dependent_users"}, {"score": 0.003447035529485425, "phrase": "high_levels"}, {"score": 0.0033749889869455407, "phrase": "internet_users"}, {"score": 0.0030153435879168634, "phrase": "different_objectives"}, {"score": 0.0028201570908224166, "phrase": "internet_agents"}, {"score": 0.002732149335827768, "phrase": "individual_dependency"}, {"score": 0.0027129670661026964, "phrase": "message_effectiveness"}, {"score": 0.002528379400564723, "phrase": "key_tool"}, {"score": 0.002501793273494325, "phrase": "future_online_purchases"}, {"score": 0.0024581013157048926, "phrase": "dramatic_online_differences"}, {"score": 0.0024236964502593254, "phrase": "internet_dependent_and_non-dependent_users"}, {"score": 0.0022192891418394514, "phrase": "non-purchasing_internet_users"}, {"score": 0.0021198904828154657, "phrase": "future_purchase_intentions"}, {"score": 0.0021049977753042253, "phrase": "non-buyer_internet_users"}], "paper_keywords": ["Internet ANOVA", " Spain", " buying behaviour"], "paper_abstract": "Purpose - To analyse key drivers of Internet dependency and its impact on willingness to purchase online. Design/methodology/approach - The applicability of the media dependency scale is tested in the Spanish market. The impact of demographics, Internet exposure, online experience and Internet affinity on Internet dependency is analysed together with behavioural changes deriving from Internet dependency (willingness to purchase online). Findings - Data analysis shows that the media dependency scale needs to be adapted to the Spanish market and Spanish Internet users show intermediate levels of Internet dependency. Dependent users are mainly young, highly-educated, feel Internet affinity and have high levels of exposure and experience as Internet users. Internet dependency determines willingness to purchase online, with the most relevant factor being that of searching for information to take decisions. Practical implications - This research enables companies to know the different objectives which Internet can help consumers to attain and, therefore, what aspects to highlight in their communication strategies. Internet agents should exploit the dimensions Internet offers to increase individual dependency and message effectiveness. The significant influence that searching for information exerts on willingness to purchase online shows managers that web contents become a key tool to increase future online purchases. Originality/value - Despite dramatic online differences were discovered between Internet dependent and non-dependent users, very limited research has been conducted to examine them. There are still not enough studies that analyse the effects of Internet dependency on the non-purchasing Internet users behaviour. This paper analyses the background of Internet dependency and its influence on future purchase intentions of non-buyer Internet users.", "paper_title": "Explaining Internet dependency - An exploratory study of future purchase intention of Spanish Internet users", "paper_id": "WOS:000240930800002"}