{"auto_keywords": [{"score": 0.009331629120055519, "phrase": "pattern_classification_problem"}, {"score": 0.007655987509680845, "phrase": "posterior_class_probabilities"}, {"score": 0.004665483918844599, "phrase": "pattern_classification_methods"}, {"score": 0.004478061063857035, "phrase": "observed_attributes"}, {"score": 0.0041384457437123635, "phrase": "precise_identification"}, {"score": 0.004099455381916337, "phrase": "relevant_features"}, {"score": 0.00406083086983316, "phrase": "classification_algorithm"}, {"score": 0.003947118540355604, "phrase": "real_world_patterns"}, {"score": 0.0036707250689857348, "phrase": "misclassification_rate"}, {"score": 0.0035120164504478437, "phrase": "random_variables"}, {"score": 0.003307508702661699, "phrase": "posterior_class_probability_value"}, {"score": 0.0031148723927633955, "phrase": "so-called_parzen_window_approach"}, {"score": 0.002905752244360772, "phrase": "appropriate_posterior_class_probabilities"}, {"score": 0.0027451110240633144, "phrase": "training_dataset"}, {"score": 0.0025285834281312705, "phrase": "computational_drawback"}, {"score": 0.002336469133929162, "phrase": "novel_approach"}, {"score": 0.002299830460180699, "phrase": "aforementioned_computational_bottleneck"}, {"score": 0.0022781229833499753, "phrase": "current_paper"}, {"score": 0.002256619934086924, "phrase": "mathematical_aspect"}, {"score": 0.002228263890334039, "phrase": "practical_realizations"}, {"score": 0.0022072304165576405, "phrase": "proposed_scheme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Probability density function", " Kernel functions", " Parzen Window"], "paper_abstract": "Pattern classification methods assign an object to one of several predefined classes/categories based on features extracted from observed attributes of the object (pattern). When L discriminatory features for the pattern can be accurately determined, the pattern classification problem presents no difficulty. However, precise identification of the relevant features for a classification algorithm (classifier) to be able to categorize real world patterns without errors is generally infeasible. In this case, the pattern classification problem is often cast as devising a classifier that minimizes the misclassification rate. One way of doing this is to consider both the pattern attributes and its class label as random variables, estimate the posterior class probabilities for a given pattern and then assign the pattern to the class/category for which the posterior class probability value estimated is maximum. More often than not, the form of the posterior class probabilities is unknown. The so-called Parzen Window approach is widely employed to estimate class-conditional probability (class-specific probability) densities for a given pattern. These probability densities can then be utilized to estimate the appropriate posterior class probabilities for that pattern. However, the Parzen Window scheme can become computationally impractical when the size of the training dataset is in the tens of thousands and L is also large (a few hundred or more). Over the years, various schemes have been suggested to ameliorate the computational drawback of the Parzen Window approach, but the problem still remains outstanding and unresolved. In this paper, we revisit the Parzen Window technique and introduce a novel approach that may circumvent the aforementioned computational bottleneck. The current paper presents the mathematical aspect of our idea. Practical realizations of the proposed scheme will be given elsewhere. (C) 2015 The Authors. Published by Elsevier B.V.", "paper_title": "The Parzen Window method: In terms of two vectors and one matrix", "paper_id": "WOS:000359888900005"}