{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "half-duplex_multiple-relay_channel"}, {"score": 0.03008199583669917, "phrase": "optimal_scheduling_problem"}, {"score": 0.004017989546119125, "phrase": "max-flow_min-cut_argument"}, {"score": 0.0034355662264234864, "phrase": "achievable_rates"}, {"score": 0.0030397596289795143, "phrase": "time_fraction"}, {"score": 0.002995427206425849, "phrase": "different_states"}, {"score": 0.0027832502848247303, "phrase": "optimal_schedule"}, {"score": 0.002729246328390722, "phrase": "df_rate"}, {"score": 0.0026115277372906805, "phrase": "maximin_optimization"}, {"score": 0.002523481637809674, "phrase": "algorithmic_solution"}, {"score": 0.0024383967028975616, "phrase": "four-node_multiple-relay_channel"}, {"score": 0.0022434880661725493, "phrase": "received_signal-to-noise_ratio"}, {"score": 0.0022216045996270974, "phrase": "phase-fading_hd-mrc"}, {"score": 0.0021049977753042253, "phrase": "max_optimization"}], "paper_keywords": ["Decode-forward (DF)", " half duplex", " multiple-relay channel (MRC)", " phase fading", " scheduling"], "paper_abstract": "We study the half-duplex multiple-relay channel (HD-MRC) where every node can either transmit or listen but cannot do both at the same time. We obtain a capacity upper bound based on a max-flow min-cut argument and achievable transmission rates based on the decode-forward (DF) coding strategy, for both the discrete memoryless HD-MRC and the phase-fading HD-MRC. We discover that both the upper bound and the achievable rates are functions of the transmit/listen state (a description of which nodes transmit and which receive). More precisely, they are functions of the time fraction of the different states, which we term a schedule. We formulate the optimal scheduling problem to find an optimal schedule that maximizes the DF rate. The optimal scheduling problem turns out to be a maximin optimization, for which we propose an algorithmic solution. We demonstrate our approach on a four-node multiple-relay channel, obtaining closed-form solutions in certain scenarios. Furthermore, we show that for the received signal-to-noise ratio degraded phase-fading HD-MRC, the optimal scheduling problem can be simplified to a max optimization.", "paper_title": "On Capacity and Optimal Scheduling for the Half-Duplex Multiple-Relay Channel", "paper_id": "WOS:000307892800010"}