{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "radial_distortion"}, {"score": 0.00481495049065317, "phrase": "distortion_estimation"}, {"score": 0.004556901872357751, "phrase": "radial_distortion_function"}, {"score": 0.0035953368057880593, "phrase": "easy_add"}, {"score": 0.0034975571855450343, "phrase": "popular_calibration_method"}, {"score": 0.0030470127429039497, "phrase": "local_minima"}, {"score": 0.002915437843874821, "phrase": "parameter-free_way"}, {"score": 0.00282048824450047, "phrase": "particular_radial_distortion_model"}, {"score": 0.0026986685585382347, "phrase": "large_range"}, {"score": 0.0026107601878587816, "phrase": "fish-eye_lenses"}, {"score": 0.002337848196418384, "phrase": "optimal_results"}, {"score": 0.0021049977753042253, "phrase": "principal_point"}], "paper_keywords": ["radial distortion", " camera calibration", " fundamental matrix"], "paper_abstract": "We propose a method of simultaneously calibrating the radial distortion function of a camera and the other internal calibration parameters. The method relies on the use of a planar ( or, alternatively, nonplanar) calibration grid which is captured in several images. In this way, the determination of the radial distortion is an easy add-on to the popular calibration method proposed by Zhang [24]. The method is entirely noniterative and, hence, is extremely rapid and immune to the problem of local minima. Our method determines the radial distortion in a parameter-free way, not relying on any particular radial distortion model. This makes it applicable to a large range of cameras from narrow-angle to fish-eye lenses. The method also computes the center of radial distortion, which, we argue, is important in obtaining optimal results. Experiments show that this point may be significantly displaced from the center of the image or the principal point of the camera.", "paper_title": "Parameter-free radial distortion correction with center of distortion estimation", "paper_id": "WOS:000247186500002"}