{"auto_keywords": [{"score": 0.029370048019070182, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "robust_control"}, {"score": 0.004402854153653114, "phrase": "high_voltage_direct_current"}, {"score": 0.003819339842998955, "phrase": "new_adaptive_back-stepping_approach"}, {"score": 0.003623352647973122, "phrase": "existing_controller"}, {"score": 0.003312901888725435, "phrase": "classical_certainty-equivalence_principle"}, {"score": 0.0031594291695784286, "phrase": "first_time"}, {"score": 0.0030772505522663612, "phrase": "unknown_parameters"}, {"score": 0.0030130446986008277, "phrase": "novel_parameter_estimator"}, {"score": 0.0029814443878969973, "phrase": "dynamics_feedback_controller"}, {"score": 0.0029038817737006405, "phrase": "useful_nonlinearities"}, {"score": 0.002858313353461727, "phrase": "real-time_estimation"}, {"score": 0.002740253546178098, "phrase": "better_performances"}, {"score": 0.0025318431634446426, "phrase": "simulation_results"}, {"score": 0.002207363758847308, "phrase": "parameter_estimation"}, {"score": 0.0021049977753042253, "phrase": "\"full-information''_controller"}], "paper_keywords": [""], "paper_abstract": "By utilizing the controllability of High Voltage Direct Current (HVDC), which means that the power delivered can be modulated, to improve the stability and operation performances of the parallel AC/DC transmission system, a new adaptive back-stepping approach for this system is developed. Compared with the existing controller based on \"classical'' adaptive back-stepping, the approach does not follow the classical certainty-equivalence principle. We introduce this approach, for the first time, into parallel AC/DC systems containing unknown parameters and present a novel parameter estimator and dynamics feedback controller. Besides the preserving useful nonlinearities and the real-time estimation of uncertainty parameter, the proposed approach possesses better performances with respect to the response of the system and the speed of adaptation. Simulation results demonstrate that the proposed approach is better than the design based on \"classical'' adaptive back-stepping in terms of properties of stability and parameter estimation and that it recovers the performance of the \"full-information'' controller, which is obtained by assuming that the parameters are known and apply standard back-stepping, hence it will be an alternative to practice engineering and applications.", "paper_title": "Nonlinear robust control for parallel AC/DC transmission systems: A new adaptive back-stepping approach", "paper_id": "WOS:000237164000005"}