{"auto_keywords": [{"score": 0.04406602779400211, "phrase": "mlfft"}, {"score": 0.008713768692145013, "phrase": "image_registration"}, {"score": 0.007405224415272805, "phrase": "pseudopolar_fft"}, {"score": 0.004744018246633455, "phrase": "novel_adaptable_accurate_way"}, {"score": 0.004651057147690674, "phrase": "polar_fft"}, {"score": 0.0043183186953102805, "phrase": "multilayer_fractional_fourier_transform"}, {"score": 0.004150661689086371, "phrase": "necessary_addition"}, {"score": 0.00395017798595193, "phrase": "lower_interpolation_errors"}, {"score": 0.0037593414153801394, "phrase": "nearly_same_computing_complexity"}, {"score": 0.003472927015404464, "phrase": "user-defined_computing_level"}, {"score": 0.0024306105794630246, "phrase": "maximum_scaling"}, {"score": 0.0022901862321082407, "phrase": "large_rotation"}, {"score": 0.0021049977753042253, "phrase": "pseudopolar-based_fft_methods"}], "paper_keywords": ["Image processing and computer vision", " signal processing", " computation of transforms", " pattern matching"], "paper_abstract": "A novel adaptable accurate way for calculating the polar FFT and the log-polar FFT is developed in this paper, namely, Multilayer Fractional Fourier Transform ( MLFFT). MLFFT is a necessary addition to the pseudopolar FFT for the following reasons: It has lower interpolation errors in both polar and log-polar Fourier transforms, it reaches better accuracy with the nearly same computing complexity as the pseudopolar FFT, and provides a mechanism to increase the accuracy by increasing the user-defined computing level. This paper demonstrates both MLFFT itself and its advantages theoretically and experimentally. By emphasizing applications of MLFFT in image registration with rotation and scaling, our experiments suggest two major advantages of MLFFT: 1) Scaling up to 5 and arbitrary rotation angles or scaling up to 10 without rotation can be recovered by MLFFT, while, currently, the result recovered by the state-of-the-art algorithms is the maximum scaling of 4. 2) No iteration is needed to recover large rotation and scaling values of images by MLFFT; hence, it is more efficient than the pseudopolar-based FFT methods for image registration.", "paper_title": "An Adaptable-Multilayer Fractional Fourier Transform Approach for Image Registration", "paper_id": "WOS:000262480200002"}