{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "patent_citations"}, {"score": 0.004606148097788071, "phrase": "large_body"}, {"score": 0.004514241562580097, "phrase": "overall_structure"}, {"score": 0.004477992162329249, "phrase": "citation_relations"}, {"score": 0.004064958518350867, "phrase": "citation_network"}, {"score": 0.003308986613384597, "phrase": "observation_period"}, {"score": 0.0032428780373184207, "phrase": "synchronic_state"}, {"score": 0.0027929100418926725, "phrase": "cumulative_number"}, {"score": 0.002607598760956807, "phrase": "potential_connections"}, {"score": 0.002227508035618043, "phrase": "limited_range"}], "paper_keywords": ["Patent citation", " Patent classification", " Time-series variation", " Japan"], "paper_abstract": "While there is a large body of research analyzing the overall structure of citation relations for patents, there has been very little research seeking to clarify the characteristics of fields relating to the diffusion of technology through observing the citation network surrounding each patent individually and tracing its growth. This study focused on the classifications assigned to patents and examined the diversity of the fields of patents citing each patent from the following two perspectives: (1) expected values for growth in the number of citing fields, when regarding the observation period as being in a synchronic state and assuming that the strength of connections between each patent and citing fields is constant; and (2) empirical values for growth in the number of citing fields according to the increase in the cumulative number of citations over time. From the results, it was confirmed that the strength of potential connections between each patent and citing fields changes over time. Especially in the fields of \"chemistry; metallurgy\" and \"physics,\" the following change is considerable: a patent tends to receive citations repeatedly from a limited range of fields for a while, but later comes to be cited by various fields.", "paper_title": "Diversity of fields in patent citations: synchronic and diachronic changes", "paper_id": "WOS:000331559800019"}