{"auto_keywords": [{"score": 0.04974625958231724, "phrase": "online_social_networks"}, {"score": 0.040428231694652414, "phrase": "nnd."}, {"score": 0.03532965543589866, "phrase": "nnd"}, {"score": 0.00481495049065317, "phrase": "cooperative_creation"}, {"score": 0.004682559944734016, "phrase": "osn"}, {"score": 0.004367108655796158, "phrase": "large_osn."}, {"score": 0.004130079333979522, "phrase": "nico_nico_douga"}, {"score": 0.003988487841970088, "phrase": "cooperative_behaviors"}, {"score": 0.003905864553426306, "phrase": "collective_creation"}, {"score": 0.0038787040860731935, "phrase": "music_videos"}, {"score": 0.003554661425339528, "phrase": "social_structure"}, {"score": 0.0031348622158167195, "phrase": "diffusion_process"}, {"score": 0.0030698690271012703, "phrase": "tweeter"}, {"score": 0.003027286031578399, "phrase": "interpersonal_communications"}, {"score": 0.002832928222306059, "phrase": "cooperative_process"}, {"score": 0.0026142283623653405, "phrase": "direct_roles"}, {"score": 0.0025960262223338293, "phrase": "relative_roles"}, {"score": 0.00256895975568914, "phrase": "indirect_roles"}, {"score": 0.0022105600003496225, "phrase": "positive_correlation"}, {"score": 0.0021271863804595108, "phrase": "important_role"}, {"score": 0.0021049977753042253, "phrase": "cooperation_process"}], "paper_keywords": ["Social network analysis", " Mass cooperation", " Nico nico douga", " Artistic cooperation", " Interaction network"], "paper_abstract": "Many aspects of online social networks (OSN) have been studied in recent years. In this article, we focus on the question of interactions in large OSN. We propose methods to study these interactions, and apply them on a platform called Nico Nico Douga (NND), with the aim of understanding cooperative behaviors, taking the form of collective creation of music videos in NND. Our first contribution is a method that, starting from the network of interactions between users, evaluates three aspects: the impact of the social structure on these interactions, their concentration, and their reciprocity. We characterize the nature of interactions in NND, and compare it with four different datasets. We find that interactions in NND are more similar to a diffusion process, such as retweets in Tweeter, than to interpersonal communications, or even to cooperation in science. Our second contribution is a typology of roles for productions in a cooperative process. These roles are attributed based on the neighborhood of the nodes in the network of references between productions. We define direct roles, relative roles, and indirect roles. We subsequently study the frequency of these roles in NND. We show a correlation between the category of the contribution of a video (song, animation, etc.) and its probability of having a certain role. We also find a positive correlation between the most active users and the production of videos playing an important role in the cooperation process.", "paper_title": "Characterizing the nature of interactions for cooperative creation in online social networks", "paper_id": "WOS:000366196300018"}