{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "consistency_management"}, {"score": 0.012693211172304625, "phrase": "process_model_consistency_management"}, {"score": 0.004376378707877484, "phrase": "different_abstraction_levels"}, {"score": 0.0043401761815767, "phrase": "stakeholder_perspectives"}, {"score": 0.004163587877500036, "phrase": "major_challenge"}, {"score": 0.003660374693346876, "phrase": "in-depth_empirical_study"}, {"score": 0.003615016816532732, "phrase": "business-driven_engineering_process"}, {"score": 0.0035554096354423756, "phrase": "large_company"}, {"score": 0.0035113478590679133, "phrase": "banking_sector"}, {"score": 0.00313849462329633, "phrase": "concrete_difficulties"}, {"score": 0.0030357976028714557, "phrase": "specification-to-implementation_refinements"}, {"score": 0.002668524425703961, "phrase": "eight_empirical_findings"}, {"score": 0.002581165831422692, "phrase": "previous_works"}, {"score": 0.0024656866249273125, "phrase": "empirical_evidence"}, {"score": 0.002404885278896803, "phrase": "business_process_models"}, {"score": 0.002306855521822739, "phrase": "recurrent_patterns"}, {"score": 0.002268769196700254, "phrase": "business-level_process_specifications"}, {"score": 0.002249961956629804, "phrase": "it-level_models"}], "paper_keywords": ["Business processes", " Consistency management", " Process refinement patterns", " Empirical study"], "paper_abstract": "Organizations that adopt process modeling often maintain several co-existing models of the same business process. These models target different abstraction levels and stakeholder perspectives. Maintaining consistency among these models has become a major challenge for such organizations. Although several academic works have discussed this challenge, little empirical investigation exists on how people perform process model consistency management in practice. This paper aims to address this lack by presenting an in-depth empirical study of a business-driven engineering process deployed at a large company in the banking sector. We analyzed more than 70 business process models developed by the company, including their change history, with over 1,000 change requests. We also interviewed 9 business and IT practitioners and surveyed 23 such practitioners to understand concrete difficulties in consistency management, the rationales for the specification-to-implementation refinements found in the models, strategies that the practitioners use to detect and fix inconsistencies, and how tools could help with these tasks. Our contribution is a set of eight empirical findings, some of which confirm or contradict previous works on process model consistency management found in the literature. The findings provide empirical evidence of (1) how business process models are created and maintained, including a set of recurrent patterns used to refine business-level process specifications into IT-level models; (2) what types of inconsistencies occur; how they are introduced; and what problems they cause; and (3) what stakeholders expect from tools to support consistency management.", "paper_title": "A case study on consistency management of business and IT process models in banking", "paper_id": "WOS:000338502600002"}