{"auto_keywords": [{"score": 0.04179430726316983, "phrase": "datalog"}, {"score": 0.03125493128347287, "phrase": "conjunctive_queries"}, {"score": 0.007740474157947128, "phrase": "data_exchange"}, {"score": 0.007092452569511457, "phrase": "polynomial_time"}, {"score": 0.006999082575339178, "phrase": "data_complexity"}, {"score": 0.0047762031895556955, "phrase": "syntactic_restriction"}, {"score": 0.00463915969570025, "phrase": "ucq"}, {"score": 0.004237914427896922, "phrase": "combined_complexity"}, {"score": 0.004149208481825042, "phrase": "datalog_program"}, {"score": 0.003944836112147246, "phrase": "negated_atoms"}, {"score": 0.0038927410798100916, "phrase": "unrestricted_form"}, {"score": 0.003841331355067413, "phrase": "languages_yields"}, {"score": 0.0036038253289170288, "phrase": "restricted_form"}, {"score": 0.0032143006733904344, "phrase": "negated_relational_atom"}, {"score": 0.00276189608309668, "phrase": "computing_certain_answers"}, {"score": 0.0026537861998143365, "phrase": "thorough_analysis"}, {"score": 0.002354132757230988, "phrase": "single_inequalities"}, {"score": 0.0021389088390106033, "phrase": "k_inequalities"}, {"score": 0.002116241428289309, "phrase": "ka_parts"}], "paper_keywords": ["Data exchange", " Certain answers", " Query languages", " Datalog", " Combined complexity"], "paper_abstract": "The class of unions of conjunctive queries (UCQ) has been shown to be particularly well-behaved for data exchange; its certain answers can be computed in polynomial time (in terms of data complexity). However, this is not the only class with this property; the certain answers to any Datalog program can also can be computed in polynomial time. The problem is that both UCQ and Datalog do not allow negated atoms, as adding an unrestricted form of negation to these languages yields to intractability. In this paper, we propose a language called Datalog (C(not equal)) that extends Datalog with a restricted form of negation, and study some of its fundamental properties. In particular, we show that the certain answers to a Datalog (C(not equal)) program can be computed in polynomial time (in terms of data complexity), and that every union of conjunctive queries with at most one inequality or negated relational atom per disjunct, can be efficiently rewritten as a Datalog (C(not equal)) program in the context of data exchange. Furthermore, we show that this is also the case for a syntactic restriction of the class of unions of conjunctive queries with at most two inequalities per disjunct. This syntactic restriction is given by two conditions that are optimal, in the sense that computing certain answers becomes intractable if one removes any of them. Finally, we provide a thorough analysis of the combined complexity of computing certain answers to Datalog (C(not equal)) programs and other related query languages. In particular, we show that this problem is Exptime-complete for Datalog (C(not equal)), even if one restricts to conjunctive queries with single inequalities, which is a fragment of Datalog (C(not equal)) by the result mentioned above. Furthermore, we show that the combined complexity is coNexptime-complete for the case of conjunctive queries with k inequalities, for every ka parts per thousand yen2.", "paper_title": "Query Languages for Data Exchange: Beyond Unions of Conjunctive Queries", "paper_id": "WOS:000291159100014"}