{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "custom_product"}, {"score": 0.018736170453245164, "phrase": "inventory_cost"}, {"score": 0.010512667468117895, "phrase": "e-commerce_circumstances"}, {"score": 0.010122976886488956, "phrase": "mass_customization"}, {"score": 0.008784885225015145, "phrase": "inventory_management"}, {"score": 0.008300130140585534, "phrase": "common_product"}, {"score": 0.00370780481244907, "phrase": "custom_product_orders"}, {"score": 0.003436242862104006, "phrase": "discrete_system_simulation_method"}, {"score": 0.0031845067058084583, "phrase": "common_case"}, {"score": 0.0031393948330209224, "phrase": "custom_case"}, {"score": 0.0031096747349602344, "phrase": "design_inventory_cost_simulation_models"}, {"score": 0.002787406053363446, "phrase": "inventory_system"}, {"score": 0.0023936956017015696, "phrase": "product_price"}, {"score": 0.002337403139264533, "phrase": "purchase_volumes"}, {"score": 0.002304263635960015, "phrase": "order_quantity"}, {"score": 0.0021049977753042253, "phrase": "custom_products"}], "paper_keywords": ["e-commerce", " mass customization", " custom product", " inventory strategy", " inventory cost"], "paper_abstract": "E-commerce makes it possible to promote mass customization in practice. Manufacturers provide custom product which enables customers to select each components of the product from several variants according to their own preferences. Providing custom product increases the complexity of the inventory management, and the characteristics of inventory cost are different with those of common product. For custom product orders under e-commerce circumstances are significantly random and fluctuant, we research on this issue in the discrete system simulation method. We consider a same kind of product which is manufactured in either way of the common case and the custom case, design inventory cost simulation models for both situations supposing they adopt (s, S) inventory strategy. The results show that although the mass customization makes the inventory system more complicated, it could bring some benefits to inventory management. Compared with the inventory cost of common product, the inventory cost of custom product could be even lower and less sensitive about the product price, the change of purchase volumes and the order quantity. The conclusions could be suggestive for practice and provide confidence to manufacturers when they hesitate to supply custom products.", "paper_title": "A Simulation Research on Inventory Cost of Custom Product Under E-commerce Circumstances", "paper_id": "WOS:000370189700012"}