{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visually_impaired_users"}, {"score": 0.022967152995647805, "phrase": "multi-session_search_tasks"}, {"score": 0.019721936676013758, "phrase": "multi-session_tasks"}, {"score": 0.005220649897417382, "phrase": "information-seeking_behavior"}, {"score": 0.0037834649508375544, "phrase": "screen_readers"}, {"score": 0.0036763623220059933, "phrase": "working_memory"}, {"score": 0.0034118234596993836, "phrase": "habitual_behavior"}, {"score": 0.003372844338742438, "phrase": "visually_impaired_participants"}, {"score": 0.003277327351139926, "phrase": "popular_search_interfaces"}, {"score": 0.0031121406603482112, "phrase": "search_interface"}, {"score": 0.0030414140732789186, "phrase": "complex_information"}, {"score": 0.002938317647182056, "phrase": "user_evaluation"}, {"score": 0.002806256131739047, "phrase": "multi-session_task"}, {"score": 0.002530359917257626, "phrase": "previously_encountered_information"}, {"score": 0.002255431275670053, "phrase": "proposed_interface"}], "paper_keywords": [""], "paper_abstract": "Multi-session search tasks are complex and span more than one web session. Such tasks are challenging because searchers must keep track of their search progress and the information they encounter across sessions. Multi-session tasks can be cognitively taxing for visually impaired users because the lack of persistence of screen readers causes the load on working memory to be high. In this article, we first discuss the habitual behavior of visually impaired participants for multi-session tasks when using popular search interfaces. We then present the evaluation of a search interface developed to support complex information seeking for visually impaired users. The user evaluation was structured in two sessions to simulate a multi-session task. Thus, we discuss the strategies observed among participants to resume the search, to review previously encountered information, and to satisfy their evolved information need. We also compare the information-seeking behavior across the two sessions and examine how the proposed interface supports participants for multi-session tasks. Findings from this evaluation contribute to our understanding of the information-seeking behavior of visually impaired users and have implications for the design of tools to support searchers to manage and make sense of information during multi-session search tasks.", "paper_title": "Investigating the Behavior of Visually Impaired Users for Multi-session Search Tasks", "paper_id": "WOS:000335580800007"}