{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "unordered_trees"}, {"score": 0.015719716506582538, "phrase": "unordered_xml"}, {"score": 0.007903537737084335, "phrase": "proposed_schema_languages"}, {"score": 0.00470862827326028, "phrase": "schema_languages"}, {"score": 0.004621813738791474, "phrase": "relative_order"}, {"score": 0.004486212539464774, "phrase": "unordered_regular_expressions"}, {"score": 0.004338390136272005, "phrase": "unordered_concatenation"}, {"score": 0.004290201740122912, "phrase": "standard_concatenation"}, {"score": 0.004195418010131832, "phrase": "unordered_words"}, {"score": 0.004133390261297075, "phrase": "allowed_content"}, {"score": 0.0038798015183611275, "phrase": "unrestricted_ures"}, {"score": 0.0036281710561308377, "phrase": "unordered_word"}, {"score": 0.003405472159599445, "phrase": "practical_and_tractable_restriction"}, {"score": 0.0033550841271846065, "phrase": "disjunctive_interval_multiplicity_expressions"}, {"score": 0.0025940660106162404, "phrase": "twig_query_satisfiability"}, {"score": 0.0024346858809238766, "phrase": "expressive_power"}, {"score": 0.002363101338529545, "phrase": "yardstick_languages"}, {"score": 0.0022850777172960437, "phrase": "presburger"}, {"score": 0.002234491924392104, "phrase": "commutative_closure"}, {"score": 0.0021049977753042253, "phrase": "desirable_computational_properties"}], "paper_keywords": ["Schemas for XML", " Unordered XML", " Regular expressions", " Twig queries", " Semi-structured data"], "paper_abstract": "We investigate schema languages for unordered XML having no relative order among siblings. First, we propose unordered regular expressions (UREs), essentially regular expressions with unordered concatenation instead of standard concatenation, that define languages of unordered words to model the allowed content of a node (i.e., collections of the labels of children). However, unrestricted UREs are computationally too expensive as we show the intractability of two fundamental decision problems for UREs: membership of an unordered word to the language of a URE and containment of two UREs. Consequently, we propose a practical and tractable restriction of UREs, disjunctive interval multiplicity expressions (DIMEs). Next, we employ DIMEs to define languages of unordered trees and propose two schema languages: disjunctive interval multiplicity schema (DIMS), and its restriction, disjunction-free interval multiplicity schema (IMS). We study the complexity of the following static analysis problems: schema satisfiability, membership of a tree to the language of a schema, schema containment, as well as twig query satisfiability, implication, and containment in the presence of schema. Finally, we study the expressive power of the proposed schema languages and compare them with yardstick languages of unordered trees (FO, MSO, and Presburger constraints) and DTDs under commutative closure. Our results show that the proposed schema languages are capable of expressing many practical languages of unordered trees and enjoy desirable computational properties.", "paper_title": "Schemas for Unordered XML on a DIME", "paper_id": "WOS:000358740800003"}