{"auto_keywords": [{"score": 0.04503881805285862, "phrase": "internal_structure"}, {"score": 0.026971514155982926, "phrase": "viscous_property"}, {"score": 0.00481495049065317, "phrase": "viscoelastic_properties_of"}, {"score": 0.004578382275810468, "phrase": "viscoelastic_property"}, {"score": 0.003935892934907777, "phrase": "elastic_deformation"}, {"score": 0.0038186039088445524, "phrase": "vertical_direction"}, {"score": 0.003780286517897356, "phrase": "viscous_deformation"}, {"score": 0.002907992115184249, "phrase": "already_existing_framework"}, {"score": 0.0024493494346360415, "phrase": "different_types"}, {"score": 0.002388283252319309, "phrase": "configurational_entropy"}, {"score": 0.0023642842046859274, "phrase": "crossing_entropy"}, {"score": 0.0023287359930308864, "phrase": "topological_entropy"}, {"score": 0.0022937210378944457, "phrase": "last_entropy"}, {"score": 0.0021049977753042253, "phrase": "direct_correspondence"}], "paper_keywords": ["Network", " graph", " viscoelasticity", " entropy", " stock exchange", " music"], "paper_abstract": "A network was characterized by its viscoelastic properties. The viscoelastic property indicates the deformations or changes in the shape and in the internal structure during the evolution of a network. The change in the direction of motion was taken as elastic deformation and the change in the vertical direction as viscous deformation. These deformations were related to the change of geometry of internal structure and of shape. Thus it was possible to characterize a network by its storage and loss moduli. The change of the structure of a network during its evolution changes also its entropy. However entropy depends on the number of microstates of an already existing framework. As examples, two different systems (i) New York Stock Exchange and (ii) a melody were studied for their viscoelastic properties. The change of viscous property was compared with the change of different types of entropies such as configurational entropy, crossing entropy, and topological entropy. This last entropy was introduced and explained in the text. It was found out that there is no direct correspondence between the increase of entropy and the increase of viscous property of a network although they sometimes correlate with each other.", "paper_title": "VISCOELASTIC PROPERTIES OF NETWORKS", "paper_id": "WOS:000271219200008"}