{"auto_keywords": [{"score": 0.034746507981418165, "phrase": "uncertain_objects"}, {"score": 0.004579780586951551, "phrase": "data_randomness"}, {"score": 0.004230595706156783, "phrase": "location-based_services"}, {"score": 0.0041954264274326036, "phrase": "lbs"}, {"score": 0.00389164348807591, "phrase": "considerable_research_efforts"}, {"score": 0.003763763153640936, "phrase": "uncertainty-aware_spatial_query_processing"}, {"score": 0.0032246835734680377, "phrase": "important_and_fundamental_spatial_query"}, {"score": 0.0031056437850836326, "phrase": "maximal_utility_principle"}, {"score": 0.0030414140732789186, "phrase": "new_ranking_model"}, {"score": 0.0029909851863915283, "phrase": "top_k_most_influential_facilities"}, {"score": 0.0027510752634224726, "phrase": "u-quadtree"}, {"score": 0.002728166176898539, "phrase": "effective_and_efficient_algorithms"}, {"score": 0.002671722386856879, "phrase": "filtering_and_verification_paradigm"}, {"score": 0.00241658945942583, "phrase": "large_number"}, {"score": 0.002346861891137455, "phrase": "randomized_algorithms"}, {"score": 0.002327310963701377, "phrase": "accuracy_guarantee"}, {"score": 0.00227914162528171, "phrase": "hybrid_algorithm"}, {"score": 0.0022133711375320244, "phrase": "randomized_and_exact_algorithms"}, {"score": 0.00216755493625594, "phrase": "real_datasets"}], "paper_keywords": ["Spatial influence", " uncertain data"], "paper_abstract": "Due to a variety of reasons including data randomness and incompleteness, noise, privacy, etc., uncertainty is inherent in many important applications, such as location-based services (LBS), sensor network monitoring, and radio-frequency identification (RFID). Recently, considerable research efforts have been devoted into the field of uncertainty-aware spatial query processing such that the uncertainty of the data can be effectively and efficiently tackled. In this paper, we study the problem of finding top k most influential facilities over a set of uncertain objects, which is an important and fundamental spatial query in the above applications. Based on the maximal utility principle, we propose a new ranking model to identify the top k most influential facilities, which carefully captures influence of facilities on the uncertain objects. By utilizing two uncertain object indexing techniques, R-tree and U-Quadtree, effective and efficient algorithms are proposed following the filtering and verification paradigm, which significantly improves the performance of the algorithms in terms of CPU and I/O costs. To effectively support uncertain objects with a large number of instances, we also develop randomized algorithms with accuracy guarantee. Then, a hybrid algorithm is devised which effectively combines the randomized and exact algorithms. Comprehensive experiments on real datasets demonstrate the effectiveness and efficiency of our techniques.", "paper_title": "Finding Top k Most Influential Spatial Facilities over Uncertain Objects", "paper_id": "WOS:000364853800011"}