{"auto_keywords": [{"score": 0.0429935486588942, "phrase": "it-mediated_teams"}, {"score": 0.004860218511356111, "phrase": "time"}, {"score": 0.004612147352416241, "phrase": "empirical_research"}, {"score": 0.0045726187330434025, "phrase": "future_research_directions"}, {"score": 0.004533427352547707, "phrase": "information_technology"}, {"score": 0.004249957578636515, "phrase": "comprehensive_review"}, {"score": 0.003486123304074186, "phrase": "empirical_information_systems"}, {"score": 0.0031845067058084583, "phrase": "clock_view"}, {"score": 0.00306334226516593, "phrase": "single_activity"}, {"score": 0.0028715299874549245, "phrase": "simplified_temporal_context"}, {"score": 0.002416589459425828, "phrase": "face-to-face_and_it-mediated_teams"}, {"score": 0.002236055625099805, "phrase": "fragmented_insights"}, {"score": 0.0022073031056287903, "phrase": "small_cumulative_effects"}, {"score": 0.0021049977753042253, "phrase": "richer_theorizing"}], "paper_keywords": ["time", " temporal analysis", " information technology (IT)", " team", " IT artifact", " IT functions"], "paper_abstract": "Information technology (IT) is intricately bound up with time in teams. Yet a comprehensive review of what is known about time in IT-mediated teams is lacking. This paper addresses this gap. We classify time into three categories: conceptions of time, mapping activities to time, and actors relating to time. Drawing upon this framework, we review empirical information systems (IS) research on IT-mediated teams over the past three decades. Our review reveals that the research has approached time predominantly using the clock view and has examined exclusively how to map a single activity to the continuum of time. As a result, most studies operate within a simplified temporal context by conceiving time as an objective attribute that ticks away. Meanwhile, a void exists in research that recognizes time as interpretive and experienced. Our analyses also indicate that past research has been primarily interested in the differences between face-to-face and IT-mediated teams and the communication function of IT. Overall, IT remains roughly conceptualized, and research has produced fragmented insights that have small cumulative effects. To advance more substantive theory building, we propose several research directions that invite richer theorizing about how IT is related to time in teams.", "paper_title": "Time and information technology in teams: a review of empirical research and future research directions", "paper_id": "WOS:000361345000003"}