{"auto_keywords": [{"score": 0.04968898347890439, "phrase": "search_engine_query_data"}, {"score": 0.0224417294426209, "phrase": "position_data"}, {"score": 0.015719716506582538, "phrase": "business_information"}, {"score": 0.007742360907808974, "phrase": "search_volumes"}, {"score": 0.007679473026869332, "phrase": "company_names"}, {"score": 0.005889855717763755, "phrase": "google_trends"}, {"score": 0.005167823902364236, "phrase": "business_performance"}, {"score": 0.0041555469216463855, "phrase": "companies'_business_performance"}, {"score": 0.0031714880645482496, "phrase": "search_queries"}, {"score": 0.0031199769276286466, "phrase": "google"}, {"score": 0.0030944828434567966, "phrase": "google_trends_data"}, {"score": 0.0030069962181403487, "phrase": "worldwide_searches"}, {"score": 0.002898127432512101, "phrase": "significant_correlations"}, {"score": 0.0028744731986533076, "phrase": "search_volume_data"}, {"score": 0.0026920404458807444, "phrase": "google_trends'_worldwide_search_data"}, {"score": 0.0024001337476063094, "phrase": "publicly_available_search_engine_query_data"}, {"score": 0.0021662983565317283, "phrase": "business_data"}, {"score": 0.0021049977753042253, "phrase": "first_study"}], "paper_keywords": ["Webometrics", " Business information", " Google Trends", " Search engine query data"], "paper_abstract": "Purpose - The purpose of this paper is to examine the feasibility of discovering business information from search engine query data. Specifically the study tried to determine whether search volumes of company names are correlated with the companies' business performance and position data. Design/methodology/approach - The top 50 US companies in the 2012 Fortune 500 list were included in the study. The following business performance and position data were collected: revenues, profits, assets, stockholders' equity, profits as a percentage of revenues, and profits as a percentage of assets. Data on the search volumes of the company names were collected from Google Trends, which is based on search queries users enter into Google. Google Trends data were collected in the two scenarios of worldwide searches and US searches. Findings - The study found significant correlations between search volume data and business performance and position data, suggesting that search engine query data can be used to discover business information. Google Trends' worldwide search data were better than the US domestic search data for this purpose. Research limitations/implications - The study is limited to only one country and to one year of data. Practical implications - Publicly available search engine query data such as those from Google Trends can be used to estimate business performance and position data which are not always publicly available. Search engine query data are timelier than business data. Originality/value - This is the first study to establish a relationship between search engine query data and business performance and position data.", "paper_title": "Discovering business information from search engine query data", "paper_id": "WOS:000342001700007"}