{"auto_keywords": [{"score": 0.05007526432778761, "phrase": "tips_procedure"}, {"score": 0.04879058269269033, "phrase": "tips"}, {"score": 0.004722038375317162, "phrase": "transjugular_intrahepatic_portosystemic_shunt"}, {"score": 0.004523865550323285, "phrase": "moving_target"}, {"score": 0.0043509032299218955, "phrase": "needle_passage"}, {"score": 0.004087756756529841, "phrase": "clinical_assumption"}, {"score": 0.003885668358145471, "phrase": "significant_deformation"}, {"score": 0.003483573659272443, "phrase": "relative_positions"}, {"score": 0.003443031148055198, "phrase": "target_point"}, {"score": 0.0031721009574803127, "phrase": "seven_patients"}, {"score": 0.0030506626796257077, "phrase": "cardiac_and_respiratory_motion"}, {"score": 0.0029568580614857524, "phrase": "needle_pressure"}, {"score": 0.00277778944472107, "phrase": "liver_deformation"}, {"score": 0.0026095369186867707, "phrase": "actual_displacements"}, {"score": 0.0025292620341476283, "phrase": "fixed_reference_point"}, {"score": 0.002422890839801611, "phrase": "rigid_livers"}, {"score": 0.0022672107906933714, "phrase": "healthy_liver_deformation"}, {"score": 0.002197443382039439, "phrase": "unseen_target"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Liver deformation", " 2D/3D point reconstruction", " TIPS", " X-rays", " Vessels", " Tracking"], "paper_abstract": "Creation of a transjugular intrahepatic portosystemic shunt (TIPS) requires passage of a needle toward a moving target that is only seen transiently by X-ray prior to needle passage. Intraoperative, 3D target localization would facilitate target access and improve the safety of the procedure. The clinical assumption is that patients undergoing the TIPS procedure possess rigid, cirrhotic livers that undergo only intraoperative translation without significant deformation or rotation. Based upon this assumption, we hypothesize that the position of any unseen, 3D target point within the liver can be determined intraoperatively by precalculation of the relative positions of the target point to a different 3D point that can be tracked intraoperatively. This paper examines this hypothesis using intraoperatively acquired, biplane, Xray images of seven patients. In six, we tracked the effects of cardiac and respiratory motion, and in three the effects of needle pressure. Methods involved reconstruction of 3D vessel bifurcation and other trackable intrahepatic points from biplane angiograms, measurement of liver deformation by examining changing distances between these 3D points over time, and comparison of expected to actual displacements of these points with respect to a fixed reference point in the liver. We conclude that, for the rigid livers associated with patients undergoing TIPS, that there is less intraoperative deformation than previously reported by other groups addressing healthy liver deformation, and that the location of an unseen target can be predicted within 3 mm accuracy. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Vessel target location estimation during the TIPS procedure", "paper_id": "WOS:000267096400012"}