{"auto_keywords": [{"score": 0.04962913836247387, "phrase": "personalized_search"}, {"score": 0.035620716932052585, "phrase": "bayesian_belief_network"}, {"score": 0.01841314268134317, "phrase": "user-specific_information"}, {"score": 0.00481495049065317, "phrase": "taxonomic_knowledge"}, {"score": 0.0047026237903774895, "phrase": "bayesian_belief_network-based"}, {"score": 0.004689821794425858, "phrase": "approach"}, {"score": 0.0046364836476864325, "phrase": "keyword-based_search"}, {"score": 0.004464602028530629, "phrase": "information_needs"}, {"score": 0.0040049806975968145, "phrase": "users'_intended_semantics"}, {"score": 0.0033466630353482067, "phrase": "bbn"}, {"score": 0.0031619994642255846, "phrase": "clear_formalism"}, {"score": 0.0030017207229983385, "phrase": "concept_layer"}, {"score": 0.002782938683493689, "phrase": "domain_knowledge"}, {"score": 0.002717886783819971, "phrase": "search_systems"}, {"score": 0.00266693888510356, "phrase": "intended_semantics"}, {"score": 0.0023139986108451946, "phrase": "taxonomic_knowledgebase"}, {"score": 0.002175913488493802, "phrase": "extended_bayesian_belief_network"}], "paper_keywords": ["taxonomic knowledge", " Bayesian belief network", " personalized search", " conceptual matching", " probabilistic model"], "paper_abstract": "Keyword-based search returns its results without concern for the information needs of users. In general, search queries are too short to represent what users want, and thus it is necessary to represent users' intended semantics more accurately. Our goal is to enrich the semantics of user-specific information (e.g., users' queries and preferences) and documents with their corresponding concepts for personalized search. To achieve this goal, we adopt a Bayesian belief network (BBN) as a strategy for personalized search since the Bayesian belief network provides a clear formalism for mapping user-specific information to its corresponding concepts. Nevertheless, since the concept layer of the Bayesian belief network consists of only index terms extracted from documents, it does not use the domain knowledge which is required for search systems to understand the intended semantics of queries. Therefore, we extend the Bayesian belief network to represent the semantics of user-specific information as concepts (not index terms). The concepts are extracted from a taxonomic knowledgebase such as the Open Directory Project Web directory. In our experiments, we have shown that an extended Bayesian belief network using taxonomic knowledge significantly outperforms the other Bayesian belief network-based approaches and conventional approaches (i.e., query expansion and result processing) for personalized search.", "paper_title": "Exploiting Taxonomic Knowledge for Personalized Search: A Bayesian Belief Network-based Approach", "paper_id": "WOS:000293311000014"}