{"auto_keywords": [{"score": 0.049596205816074275, "phrase": "wormhole_attack"}, {"score": 0.03388818757149641, "phrase": "mobile_beacon"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.00469445816161498, "phrase": "severe_attack"}, {"score": 0.0044624036486300865, "phrase": "external_attackers"}, {"score": 0.00441738161338662, "phrase": "hostile_wireless_sensor_networks"}, {"score": 0.003971111060168551, "phrase": "wormhole_link"}, {"score": 0.00351582806482809, "phrase": "normal_functionality"}, {"score": 0.003308085469148074, "phrase": "novel_wormhole_attackers_detection"}, {"score": 0.0030500051941781034, "phrase": "wormhole_attacks"}, {"score": 0.0027554538693034163, "phrase": "main_idea"}, {"score": 0.0025663181430010686, "phrase": "static_beacons"}, {"score": 0.0025275050635202878, "phrase": "communication_properties"}, {"score": 0.0023301793939902015, "phrase": "intersection_point"}, {"score": 0.002237357942660354, "phrase": "simulation_results"}, {"score": 0.002159170788765385, "phrase": "high_wormhole_attack_detection_probability"}, {"score": 0.0021049977753042253, "phrase": "high_attackers"}], "paper_keywords": [""], "paper_abstract": "Wormhole attack is a severe attack that can be easily launched by a pair of external attackers in hostile wireless sensor networks. In the wormhole attack, an attacker sniffs packets at one point in the network, and tunnels them through the wormhole link to the other attacker at another point of the network, which broadcasts them to its neighbors. Such kind of procedure can easily deteriorate the normal functionality of the networks. In this paper, we propose a novel wormhole attackers detection and positioning scheme based on mobile beacon, which can not only detect the existence of wormhole attacks, but also accurately localize the attackers for the system to eliminate them out of the network. The main idea is to detect whether the communication between the mobile beacon and each of the static beacons violates the communication properties and then the attacker can be estimated as the center of its communication area by determining the intersection point of the chords perpendicular bisector. The simulation results illustrate that our proposed scheme can obtain a high wormhole attack detection probability as well as a high attackers positioning accuracy.", "paper_title": "Mobile Beacon Based Wormhole Attackers Detection and Positioning in Wireless Sensor Networks", "paper_id": "WOS:000334234300001"}