{"auto_keywords": [{"score": 0.045303258089338494, "phrase": "generic_multi-document_summarization"}, {"score": 0.015450650497851857, "phrase": "generic_and_topic-focused_multi-document_summarizations"}, {"score": 0.00929463229008517, "phrase": "sentence_relationship"}, {"score": 0.006914983752271393, "phrase": "cross-document_relationships"}, {"score": 0.004386887374401584, "phrase": "single_document_summarization"}, {"score": 0.0033559647822437298, "phrase": "graph-ranking_based_algorithm"}, {"score": 0.0033170847930578473, "phrase": "topic-focused_summarization"}, {"score": 0.0029349892964423197, "phrase": "graph-based_ranking_algorithm"}, {"score": 0.002752695791351096, "phrase": "summarization_performance"}, {"score": 0.002658068304632523, "phrase": "topic-focused_multi-document_summarization"}, {"score": 0.0024640253074497114, "phrase": "specified_topic"}, {"score": 0.002421291757425244, "phrase": "graph-ranking_based_method"}, {"score": 0.002205560249972527, "phrase": "experimental_results"}, {"score": 0.002142161017595363, "phrase": "great_importance"}], "paper_keywords": ["multi-document summarization", " topic-focused summarization", " cross-document relationship", " graph-ranking"], "paper_abstract": "In recent years graph-ranking based algorithms have been proposed for single document summarization and generic multi-document summarization. The algorithms make use of the \"votings\" or \"recommendations\" between sentences to evaluate the importance of the sentences in the documents. This study aims to differentiate the cross-document and within-document relationships between sentences for generic multi-document summarization and adapt the graph-ranking based algorithm for topic-focused summarization. The contributions of this study are two-fold: (1) For generic multi-document summarization, we apply the graph-based ranking algorithm based on each kind of sentence relationship and explore their relative importance for summarization performance. (2) For topic-focused multi-document summarization, we propose to integrate the relevance of the sentences to the specified topic into the graph-ranking based method. Each individual kind of sentence relationship is also differentiated and investigated in the algorithm. Experimental results on DUC 2002-DUC 2005 data demonstrate the great importance of the cross-document relationships between sentences for both generic and topic-focused multi-document summarizations. Even the approach based only on the cross-document relationships can perform better than or at least as well as the approaches based on both kinds of relationships between sentences.", "paper_title": "Using only cross-document relationships for both generic and topic-focused multi-document summarizations", "paper_id": "WOS:000252468100002"}