{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automated_clinical_management_system"}, {"score": 0.012848853422000794, "phrase": "automated_system"}, {"score": 0.008207381299295347, "phrase": "outpatient_immunosuppressive_management"}, {"score": 0.008110492183686624, "phrase": "paper_charting_system"}, {"score": 0.004776853267973129, "phrase": "outpatient_immunosuppressive_care"}, {"score": 0.004739056045644449, "phrase": "liver_transplantation"}, {"score": 0.004447201233380302, "phrase": "increased_drug_toxicity"}, {"score": 0.004173244935967375, "phrase": "clinical_outcomes"}, {"score": 0.004123781267600542, "phrase": "transplant_recipients'_immunosuppressive_medications"}, {"score": 0.004026598712747509, "phrase": "retrospective_cohort_study"}, {"score": 0.00396308097989371, "phrase": "liver_transplants"}, {"score": 0.0033269488835014583, "phrase": "tacrolimus_therapy"}, {"score": 0.0032614317990293695, "phrase": "mycophenolate_mofetil"}, {"score": 0.0030602966787192745, "phrase": "tacrolimus_toxicity_episodes"}, {"score": 0.002882980094838904, "phrase": "immunosuppressive_therapy"}, {"score": 0.002814956065949522, "phrase": "automated_management_system"}, {"score": 0.00267301171407926, "phrase": "multivariable_logistic_regression_analysis"}, {"score": 0.002548331088496964, "phrase": "formal_cost-effectiveness_analysis"}, {"score": 0.0025180781216911246, "phrase": "nurses'_salaries"}, {"score": 0.0024006068621542642, "phrase": "paper_system"}, {"score": 0.0022614266476954467, "phrase": "conclusion_use"}, {"score": 0.0021992603252793995, "phrase": "liver_transplant_patients"}, {"score": 0.0021049977753042253, "phrase": "rejection_episodes"}], "paper_keywords": [""], "paper_abstract": "Objective Immunosuppressive therapy following transplantation, if not managed well, can lead to increased drug toxicity or rejection episodes. We investigated whether use of an automated clinical management system in our liver transplant program would improve clinical outcomes in managing transplant recipients' immunosuppressive medications. Design We performed a retrospective cohort study of two patient groups receiving liver transplants at our institution. One group of 301 patients transplanted from January 1, 2004 to November 30, 2006 received outpatient immunosuppressive management using a paper charting system. After instituting an automated clinical management system, the following group of 127 patients transplanted from December 12, 2006 to April 1, 2008 received their outpatient immunosuppressive management with that system. Only patients who received tacrolimus therapy, with or without mycophenolate mofetil or prednisone, were studied. Measurements Our endpoints included percentage of patients having rejection and/or tacrolimus toxicity episodes. Various recipient, intraoperative, donor, and postoperative variables, including managing the immunosuppressive therapy with a paper charting system or an automated management system, were studied to determine which factors were associated with our endpoints. Results Multivariable logistic regression analysis showed the automated system was significantly associated with fewer rejection episodes and fewer tacrolimus toxicity events. Formal cost-effectiveness analysis of the nurses' salaries for 1 year showed the automated system cost US$197 per patient and the paper system cost US$1703 per patient. The automated system improved quality of life years. Conclusion Use of an automated clinical management system for outpatient immunosuppressive management for liver transplant patients has resulted in a decrease in both tacrolimus toxicity and rejection episodes and is cost-effective.", "paper_title": "Use of an automated clinical management system improves outpatient immunosuppressive care following liver transplantation", "paper_id": "WOS:000280005800008"}