{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hough_transform"}, {"score": 0.01950037933912382, "phrase": "hough"}, {"score": 0.007930564327728866, "phrase": "incrementing_property"}, {"score": 0.004598933498016774, "phrase": "straight_lines"}, {"score": 0.004392565073466714, "phrase": "huge_computations"}, {"score": 0.004317576641196539, "phrase": "embedded_application"}, {"score": 0.004268293864953256, "phrase": "field-programmable_gate_arrays"}, {"score": 0.0040767015025213625, "phrase": "real-time_implementation"}, {"score": 0.0038052556098065694, "phrase": "resource-efficient_architecture"}, {"score": 0.0033922781038328844, "phrase": "resource_requirement"}, {"score": 0.002711109302199029, "phrase": "memory_access"}, {"score": 0.002664749302333897, "phrase": "proposed_architecture"}, {"score": 0.0025014259919355453, "phrase": "maximum_frequency"}, {"score": 0.0021049977753042253, "phrase": "low-cost_low-end_fpga"}], "paper_keywords": ["FPGA", " hough transform", " real-time"], "paper_abstract": "Hough transform is widely used for detecting straight lines in an image, but it involves huge computations. For embedded application, field-programmable gate arrays are one of the most used hardware accelerators to achieve real-time implementation of Hough transform. In this paper, we present a resource-efficient architecture and implementation of Hough transform on an FPGA. The incrementing property of Hough transform is described and used to reduce the resource requirement. In order to facilitate parallelism, we divide the image into blocks and apply the incrementing property to pixels within a block and between blocks. Moreover, the locality of Hough transform is analyzed to reduce the memory access. The proposed architecture is implement on an Altera EP2S180F1508C3 device and can operate at a maximum frequency of 200 MHz. It could compute the Hough transform of 512 x 512 test images with 180 orientations in 2.07-3.16 ms without using many FPGA resources (i.e., one could achieve the performance by adopting a low-cost low-end FPGA).", "paper_title": "Resource-Efficient FPGA Architecture and Implementation of Hough Transform", "paper_id": "WOS:000305605800007"}