{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "agile_application_integration"}, {"score": 0.014165934521712848, "phrase": "terminal_devices"}, {"score": 0.0041226160129110775, "phrase": "china"}, {"score": 0.0038819041309353024, "phrase": "local_places"}, {"score": 0.0037480753312398754, "phrase": "enterprise_applications"}, {"score": 0.003459191419478298, "phrase": "heterogeneous_features"}, {"score": 0.003129096013910626, "phrase": "raw_data_transmission"}, {"score": 0.003051601113971322, "phrase": "distinguished_business_vocabularies"}, {"score": 0.0027327327233891865, "phrase": "event_engine"}, {"score": 0.0027054473441439422, "phrase": "xml-based_syntax"}, {"score": 0.0026516890043911836, "phrase": "syntactical_unification"}, {"score": 0.0025859868507329634, "phrase": "ontology-based_semantic_mapping"}, {"score": 0.002534596206835737, "phrase": "semantic_unification"}, {"score": 0.002496722870659199, "phrase": "webservice_and_etl_techniques"}, {"score": 0.002459414063407306, "phrase": "multi-pattern_interactive_approach"}, {"score": 0.0021693692831601745, "phrase": "operation_results"}], "paper_keywords": ["M2M", " M2M middleware", " syntactical and semantic unification", " ontology"], "paper_abstract": "M2M (Machine-to-Machine) Technology makes it possible to network all kinds of terminal devices and their corresponding enterprise applications. Therefore, several M2M platforms were developed in China in order to collect information from terminal devices dispersed all over the local places through 3G wireless network. However, when enterprise applications try to integrate with M2M platforms, they should be maintained and refactored to adapt the heterogeneous features and properties of M2M platforms. Moreover, syntactical and semantic unification for information sharing among applications and devices are still unsolved because of raw data transmission and the usage of distinguished business vocabularies. In this paper, we propose and develop an M2M Middleware to support agile application integration with M2M platform. This middleware imports the event engine and XML-based syntax to handle the syntactical unification, makes use of Ontology-based semantic mapping to solve the semantic unification and adopts WebService and ETL techniques to sustain multi-pattern interactive approach, in order to agilely make applications integrated with the M2M platform. Now, the M2M Middleware has been applied in the China Telecom M2M platform. The operation results show that applications will cost less time and workload when being integrated with M2M platform.", "paper_title": "Towards Agile Application Integration with M2M Platforms", "paper_id": "WOS:000300519400005"}