{"auto_keywords": [{"score": 0.04476307702770175, "phrase": "multimodal_interaction"}, {"score": 0.010495245158238842, "phrase": "multimodal_interfaces"}, {"score": 0.007645263269393194, "phrase": "paladin"}, {"score": 0.00481495049065317, "phrase": "automatic_evaluation"}, {"score": 0.004528156929805637, "phrase": "output_capabilities"}, {"score": 0.004477870190590885, "phrase": "increasingly_sophisticated_applications"}, {"score": 0.004049590638590415, "phrase": "continuous_flow"}, {"score": 0.0036826452656927877, "phrase": "model-based_approach"}, {"score": 0.003367611042980526, "phrase": "sequential_multimodal_interaction"}, {"score": 0.002977835845437357, "phrase": "existing_differences"}, {"score": 0.0027690086059100495, "phrase": "dynamic_nature"}, {"score": 0.002722930209707764, "phrase": "dialogue_process"}, {"score": 0.0026478260192958924, "phrase": "common_notation"}, {"score": 0.002574788013427524, "phrase": "different_multimodal_contexts"}, {"score": 0.0021049977753042253, "phrase": "proposed_model"}], "paper_keywords": ["Human-computer interaction", " Usability evaluation", " Multimodal interfaces", " Modeling", " Run-time models"], "paper_abstract": "Multimodal interfaces are expected to improve input and output capabilities of increasingly sophisticated applications. Several approaches are aimed at formally describing multimodal interaction. However, they rarely treat it as a continuous flow of actions, preserving its dynamic nature and considering modalities at the same level. This work proposes a model-based approach called Practice-oriented Analysis and Description of Multimodal Interaction (PALADIN) aimed at describing sequential multimodal interaction beyond such problems. It arranges a set of parameters to quantify multimodal interaction as a whole, in order to minimise the existing differences between modalities. Furthermore, interaction is described stepwise to preserve the dynamic nature of the dialogue process. PALADIN defines a common notation to describe interaction in different multimodal contexts, providing a framework to assess and compare the usability of systems. Our approach was integrated into four real applications to conduct two experiments with users. The experiments show the validity and prove the effectiveness of the proposed model for analysing and evaluating multimodal interaction.", "paper_title": "Run-time model based framework for automatic evaluation of multimodal interfaces", "paper_id": "WOS:000343714200005"}