{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dematel_method"}, {"score": 0.04926219622874721, "phrase": "uncertain_linguistic_environment"}, {"score": 0.04511750041358268, "phrase": "crisp_values"}, {"score": 0.03517083259120442, "phrase": "correlation_information"}, {"score": 0.03308128556916549, "phrase": "uncertain_linguistic_terms"}, {"score": 0.03076620360242571, "phrase": "trapezoidal_fuzzy_numbers"}, {"score": 0.0040767015025213625, "phrase": "real-life_situations"}, {"score": 0.002790170184447136, "phrase": "transformed_correlation_information"}, {"score": 0.002711109302199029, "phrase": "group_information"}, {"score": 0.002472822097373027, "phrase": "fuzzy_matrix_operations"}, {"score": 0.002402731767209114, "phrase": "causal_diagram"}, {"score": 0.0023079225317714815, "phrase": "different_roles"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Decision making trial and evaluation laboratory (DEMATEL)", " Correlation", " Uncertain linguistic term", " Trapezoidal fuzzy number"], "paper_abstract": "The decision making trial and evaluation laboratory (DEMATEL) method is a useful tool for analyzing correlations among factors using crisp values. However, the crisp values are inadequate to model real-life situations due to the fuzziness and uncertainty that are frequently involved in judgments of experts. The aim of this paper is to extend the DEMATEL method to an uncertain linguistic environment. In this paper, the correlation information among factors provided by experts is in the form of uncertain linguistic terms. A formula is first presented to transform correlation information from uncertain linguistic terms to trapezoidal fuzzy numbers. Then, we aggregate the transformed correlation information of each expert into group information using the operations of trapezoidal fuzzy numbers. The importance and classification of factors are determined via fuzzy matrix operations. Furthermore, a causal diagram is constructed to vividly show the different roles of factors. Finally, an example is used to illustrate the procedure of the proposed method.", "paper_title": "Extension of the DEMATEL method in an uncertain linguistic environment", "paper_id": "WOS:000300245700011"}