{"auto_keywords": [{"score": 0.04705125463422358, "phrase": "temporal_constraints"}, {"score": 0.00481495049065317, "phrase": "fuzzy_conditional_temporal_problems"}, {"score": 0.004762893197005439, "phrase": "conditional_temporal_problems"}, {"score": 0.004342430078306461, "phrase": "temporal_and_conditional_plans"}, {"score": 0.004024072318264299, "phrase": "fuzzy_thresholds"}, {"score": 0.0037697665240643066, "phrase": "dynamic_consistency"}, {"score": 0.003728966994353039, "phrase": "ctpps"}, {"score": 0.003362660648932247, "phrase": "ctpp"}, {"score": 0.003201890266327127, "phrase": "simple_temporal_problems"}, {"score": 0.0022967713922705, "phrase": "former_framework"}, {"score": 0.0021987994275190314, "phrase": "second_one"}, {"score": 0.0021049977753042253, "phrase": "polynomial_mapping"}], "paper_keywords": ["Temporal reasoning", " Constraints", " Uncertainty", " Preferences"], "paper_abstract": "Conditional Temporal Problems (CTPs) can deal simultaneously with uncertainty and temporal constraints, allowing for the representation of temporal and conditional plans. CTPPs generalize CTPs by adding preferences to the temporal constraints and by allowing fuzzy thresholds for the occurrence of some events. Here we focus on dynamic consistency of CTPPs, the most useful notion of consistency in practice. We describe an algorithm which allows for testing if a CTPP is dynamically consistent and we study its complexity. Simple temporal problems with preferences and uncertainty (STPPUs) are another formalism to model temporal constraints where preference and uncertainty coexist. While uncertainty is CTPPs is modeled via conditions on the execution of variables, in STPPUs it is modelled by means of events whose occurrence time is not known. We consider the relation between CTPPs and STPPUs and we show that the former framework is at least as expressive as the second one. Such a result is obtained by providing a polynomial mapping from STPPUs to CTPPs.", "paper_title": "Dynamic consistency of fuzzy conditional temporal problems", "paper_id": "WOS:000273788200007"}