{"auto_keywords": [{"score": 0.02913175552656335, "phrase": "stick_insects"}, {"score": 0.00481495049065317, "phrase": "protraction_movement"}, {"score": 0.004531637625717547, "phrase": "biologically_inspired_three-joint_robot_leg"}, {"score": 0.0038644521996539466, "phrase": "gradient_descent_based_optimal_control_algorithm"}, {"score": 0.003720600007408015, "phrase": "objective_function"}, {"score": 0.003245520963944678, "phrase": "radial_basis_function_neural_network"}, {"score": 0.0030542703032534766, "phrase": "untrained_regions"}, {"score": 0.0026040262154057607, "phrase": "direct_biological_imitation"}, {"score": 0.0024319378563138223, "phrase": "sample_protraction"}, {"score": 0.002203200914130907, "phrase": "optimized_trajectory"}, {"score": 0.002153540857619362, "phrase": "optimal_protraction"}, {"score": 0.0021049977753042253, "phrase": "robot_leg"}], "paper_keywords": ["Robot leg", " Protraction", " Optimal control", " Walking"], "paper_abstract": "In this paper, protraction movement, namely forward stepping, of a biologically inspired three-joint robot leg is optimized for minimum energy consumption. Trajectory optimization is performed for various initial-final tip point positions of protraction. A modified version of gradient descent based optimal control algorithm is used. The objective function is modified in steps to jump over many unfeasible and inefficient local optima. The optimized trajectories are used to construct a radial basis function neural network (RBFNN) to interpolate for the untrained regions. The results of optimization are compared with the observations of protraction of stick insects. It is concluded that a direct biological imitation of protraction is not energy efficient. A sample protraction of a leg of the Robot-EA308 is demonstrated in guidance of the optimized trajectory. Energy optimal protraction of a robot leg necessitates flexion of the leg, rather than extension as observed in the stick insects.", "paper_title": "Optimal Protraction of a Biologically Inspired Robot Leg", "paper_id": "WOS:000297365600002"}