{"auto_keywords": [{"score": 0.03947447987613366, "phrase": "online_community_management"}, {"score": 0.015670889867140485, "phrase": "perceived_benefits"}, {"score": 0.009007220311094138, "phrase": "cp"}, {"score": 0.0072950682450458855, "phrase": "cooperative_norms"}, {"score": 0.00615771405001964, "phrase": "extra-role_participation"}, {"score": 0.00481495049065317, "phrase": "online_communities"}, {"score": 0.004453488286477661, "phrase": "online_community"}, {"score": 0.004372445323111641, "phrase": "occ"}, {"score": 0.004234129588974058, "phrase": "organizational_citizenship_behavior"}, {"score": 0.0039522429946090174, "phrase": "extra-role_types"}, {"score": 0.0038981499110532273, "phrase": "integrated_framework"}, {"score": 0.0037921662574137535, "phrase": "customer_participation"}, {"score": 0.00327356326590461, "phrase": "technology_readiness"}, {"score": 0.002461472107682778, "phrase": "new_light"}, {"score": 0.002329258721870127, "phrase": "occ_users"}, {"score": 0.0021049977753042253, "phrase": "participative_behavior"}], "paper_keywords": ["Consumer participation", " co-production", " customer citizenship behavior", " online communities of consumption"], "paper_abstract": "Effective consumer participation (CP) may greatly determine the success of an online community of consumption (OCC). Drawing on theories of organizational citizenship behavior, this paper offers a conceptualization of CP and classifies participation into in-role and extra-role types. An integrated framework based on the concept of customer participation and online community management is proposed and tested with a survey of 469 respondents to explore the antecedents of CP in OCCs. The results show that the effectiveness of online community management, cooperative norms, technology readiness, and perceived benefits of participation all significantly affect in-role and extra-role CP. The findings also reveal that in-role participation is primarily determined by the effectiveness of online community management, whereas extra-role participation is mainly affected by perceived benefits of participation. In addition, effectiveness of online community management positively influences cooperative norms and perceived benefits of participation. This study sheds some new light on the characteristics of CP in OCCs by demonstrating that the OCC users differentiate their in-role participation from extra-role participation. The findings pertaining to the drivers of CP also offer guidelines for managing the two types of participative behavior, which are both vital for the sustainability and success of OCCs.", "paper_title": "Good Soldiers on the Web: Understanding the Drivers of Participation in Online Communities of Consumption", "paper_id": "WOS:000292942400004"}