{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "based_microarray_analysis"}, {"score": 0.004704571777980556, "phrase": "pathway_data"}, {"score": 0.004663832186991562, "phrase": "holistic_analytical_approach"}, {"score": 0.004610058444728656, "phrase": "coordinated_changes"}, {"score": 0.004250535418141079, "phrase": "closely_related_genes"}, {"score": 0.003884977091580757, "phrase": "gene_members"}, {"score": 0.0038179283509963695, "phrase": "differential_expression"}, {"score": 0.0036553070575015344, "phrase": "observed_expression"}, {"score": 0.0035714167992018666, "phrase": "activation_state"}, {"score": 0.003459191419478298, "phrase": "net_expression"}, {"score": 0.0030799267141887058, "phrase": "differentially_expressed_genes"}, {"score": 0.002948646905471742, "phrase": "cumulative_binomial_probability"}, {"score": 0.0027741761880779535, "phrase": "hill_climbing_methodology"}, {"score": 0.0027104531025934865, "phrase": "gene_expression"}, {"score": 0.0026328482281238927, "phrase": "multi-membership_genes"}, {"score": 0.002535265741041731, "phrase": "differentially_expressed_multi-membership_genes"}, {"score": 0.00237137451107918, "phrase": "kegg_glycolysis"}, {"score": 0.002357632753637638, "phrase": "gluconeogenesis_modules"}, {"score": 0.0023168823213024856, "phrase": "saccharomyces_cerevisiae_datasets"}, {"score": 0.0022439896633013297, "phrase": "best_solution"}, {"score": 0.002224510044064184, "phrase": "exhaustive_search"}, {"score": 0.002192418237185872, "phrase": "proposed_method"}, {"score": 0.0021607883988873492, "phrase": "multi-membership_nature"}], "paper_keywords": ["Microarray analysis", " biochemical pathways", " computational biology", " computing methodologies"], "paper_abstract": "Background: Pathway based microarray analysis is an effort to integrate microarray and pathway data in a holistic analytical approach, looking for coordinated changes in the expression of sets of genes forming pathways. However, it has been observed that the results produced are often cryptic, with cases of closely related genes in a pathway showing quite variable, even opposing expression. Objectives: We propose a methodology to identify the state of activation of individual, pathways, based on our hypothesis that gene members of many pathways or modules exhibit differential expression that results from their contribution to any combination of all their constituent pathways. Therefore, the observed expression of such a gene does not necessarily imply the activation state of a given pathway where its product participates, but reflects the net expression resulting from its participation in all its constituent pathways. Methods: Firstly, in an effort to validate the hypothesis, we split the genes into two groups; single and multi-membership. We then determined and compared the proportion of differentially expressed genes in each group, for each experiment. In addition, we estimated the cumulative binomial probability of observing as many or more expressed genes in each group, in each experiment, simply by chance. Second, we propose a hill climbing methodology, aiming to maximise the agreement of gene expression per module. Results: We detected more frequent expression of multi-membership genes and significantly lower probabilities of observing, such a high proportion of differentially expressed multi-membership genes, as the one present in the dataset. The algorithm was able to correctly identify the state of activation of the KEGG glycolysis and gluconeogenesis modules, using a number of Saccharomyces cerevisiae datasets. We show that the result is equivalent to the best solution found following exhaustive search. Conclusions: The proposed method takes into account the multi-membership nature of genes and our knowledge of the competitive, nature of our exemplar modules, revealing the state of activity of a pathway.", "paper_title": "Pathway Based Microarray Analysis, Utilising Enzyme Compounds and Cascade Events", "paper_id": "WOS:000307487600007"}