{"auto_keywords": [{"score": 0.04620806161387104, "phrase": "digital_tutee"}, {"score": 0.015415012996094952, "phrase": "educational_software"}, {"score": 0.004171259063201874, "phrase": "positive_effects"}, {"score": 0.004130165601475531, "phrase": "school_children's_learning"}, {"score": 0.003455765987713262, "phrase": "age_group"}, {"score": 0.0030988889679192965, "phrase": "educational_game"}, {"score": 0.00263129148531588, "phrase": "standardized_false-belief_test"}, {"score": 0.0025415366388578465, "phrase": "mentalizing_capabilities"}, {"score": 0.002336071138145897, "phrase": "older_children"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive learning environments", " Interdisciplinary projects", " Pedagogical issues", " Teaching/learning strategies", " Media in education"], "paper_abstract": "Educational software in which the student takes the role of teacher and instructs a digital tutee a so-called teachable agent has repeatedly proven to have positive effects for school children's learning. In a study with 39 preschoolers aged 3:9 to 6:3, we explored the conditions under which children this young would benefit as well from this kind of educational software. We specifically investigated to what extent children of this age group would be able to reason about and reflect upon the actions of their digital tutee, and to what extent they would enjoy an educational game centered around instructing and helping a digital tutee. Results revealed that preschoolers were quite capable of reasoning and reflecting upon their digital tutee. This was rather surprising, since the results of a standardized false-belief test did not indicate this level of mentalizing capabilities in the group as a whole. The results also indicated that the preschoolers, like older children, were interested and engaged in this kind of game that involves instructing a digital tutee. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Scaffolding mentalizing via a play-&-learn game for preschoolers", "paper_id": "WOS:000364882400002"}