{"auto_keywords": [{"score": 0.041204638837619996, "phrase": "tmd"}, {"score": 0.00481495049065317, "phrase": "human_single-span_membrane_proteins"}, {"score": 0.004634799977448855, "phrase": "dimeric_or_oligomeric_complexes"}, {"score": 0.004404994123834589, "phrase": "non-covalent_interaction"}, {"score": 0.003144222265269426, "phrase": "meaningful_alignments"}, {"score": 0.0030651710672229926, "phrase": "chance_alignments"}, {"score": 0.002988101395789399, "phrase": "human_single-span_membrane_proteome"}, {"score": 0.002750721367040336, "phrase": "homotypic_interaction"}, {"score": 0.0025646139644088803, "phrase": "standardized_conditions"}, {"score": 0.002468450551616404, "phrase": "broad_distribution"}, {"score": 0.0024372021710656585, "phrase": "relative_affinities"}, {"score": 0.0024063484128685367, "phrase": "high_relative_affinity"}, {"score": 0.0022434880661725493, "phrase": "preferred_helix-helix_interface"}, {"score": 0.0021049977753042253, "phrase": "reduced_affinity"}], "paper_keywords": [""], "paper_abstract": "Motivation: Most integral membrane proteins form dimeric or oligomeric complexes. Oligomerization is frequently supported by the non-covalent interaction of transmembrane helices. It is currently not clear how many high-affinity transmembrane domains (TMD) exist in a proteome and how specific their interactions are with respect to preferred contacting faces and their underlying residue motifs. Results: We first identify a threshold of 55% sequence similarity, which demarcates the border between meaningful alignments of TMDs and chance alignments. Clustering the human single-span membrane proteome using this threshold groups similar to 40% of the TMDs. The homotypic interaction of the TMDs representing the 33 largest clusters was systematically investigated under standardized conditions. The results reveal a broad distribution of relative affinities. High relative affinity frequently coincides with (i) the existence of a preferred helix-helix interface and (ii) sequence specificity as indicated by reduced affinity after mutating conserved residues.", "paper_title": "Self-interaction of transmembrane helices representing pre-clusters from the human single-span membrane proteins", "paper_id": "WOS:000321746100046"}