{"auto_keywords": [{"score": 0.029336392584843777, "phrase": "informal_learning"}, {"score": 0.009273467281979954, "phrase": "technological_framework"}, {"score": 0.004773440764013603, "phrase": "recognition"}, {"score": 0.004689650818647484, "phrase": "informal_learning_experiences"}, {"score": 0.004567596860086148, "phrase": "learners'_informal_learning_activities_visible"}, {"score": 0.00440976345264104, "phrase": "information_technologies"}, {"score": 0.003198554193075258, "phrase": "formal_or_informal_way"}, {"score": 0.00308788133472785, "phrase": "educational_institutions"}, {"score": 0.0030206579994328975, "phrase": "deeper_knowledge"}, {"score": 0.0029161225023394363, "phrase": "trailer_project"}, {"score": 0.002288797099841088, "phrase": "technological_engagement"}, {"score": 0.0022192891418394514, "phrase": "continuing_transformation"}, {"score": 0.0021330078238529443, "phrase": "greater_emphasis"}, {"score": 0.0021049977753042253, "phrase": "effective_exploitation"}], "paper_keywords": ["Informal Learning", " Service-based framework", " Personal Learning Network", " Decision Making"], "paper_abstract": "The application of information technologies (specially the Internet, Web 2.0 and social tools) make informal learning more visible. This kind of learning is not linked to an institution or a period of time, but it is important enough to be taken into account. On the one hand, learners should be able to communicate to the institutions they are related to, what skills they possess, whether they were achieved in a formal or informal way. On the other hand the companies and educational institutions need to have a deeper knowledge about the competencies of their staff. The TRAILER project provides a methodology supported by a technological framework to facilitate communication about informal learning between businesses, employees and learners. The paper presents the project and some of the work carried out, an exploratory analysis about how informal learning is considered and the technological framework proposed. Whilst challenges remain in terms of establishing the meaningfulness of technological engagement for employees and businesses, the continuing transformation of the social, technological and educational environment is likely to lead to greater emphasis for the effective exploitation of informal learning.", "paper_title": "TRAILER Project (Tagging, Recognition, Acknowledgment of Informal Learning Experiences) A Methodology to Make Learners' Informal Learning Activities Visible to the Institutions", "paper_id": "WOS:000327375100009"}