{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "interactive_computer_simulations"}, {"score": 0.04493752827345703, "phrase": "prior_knowledge_levels"}, {"score": 0.04445199574489947, "phrase": "concept_comprehension"}, {"score": 0.04397146767907389, "phrase": "cognitive_load"}, {"score": 0.0282008022882191, "phrase": "significantly_increased_comprehension_scores"}, {"score": 0.0031665087019813244, "phrase": "dependent_variables"}, {"score": 0.002859345731792013, "phrase": "high_prior_knowledge_levels"}, {"score": 0.0027170943110836425, "phrase": "low-interactive_simulations"}, {"score": 0.0026113524778702624, "phrase": "cognitive_load_scores"}, {"score": 0.0024120247307686084, "phrase": "low_prior_knowledge_levels"}, {"score": 0.0023713273141757326, "phrase": "low-interactive_simulation_group"}, {"score": 0.0022405528759521856, "phrase": "lower_cognitive_load_scores"}, {"score": 0.002215274527909304, "phrase": "higher_learning_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive learning environments", " Simulation", " Elementary education"], "paper_abstract": "The purposes of this study were to examine the effects of two types of interactive computer simulations and of prior knowledge levels on concept comprehension, cognitive load, and learning efficiency. Seventy-two 5th grade students were sampled from two elementary schools. They were divided into two groups (high and low) based on prior knowledge levels, and each group was divided into two treatment groups (a low-interactive simulation group and a high-interactive simulation group). The dependent variables were concept comprehension, cognitive load, and learning efficiency. The results showed that, for students with high prior knowledge levels, high-interactive simulations, rather than low-interactive simulations, resulted in significantly increased comprehension scores, decreased cognitive load scores, and higher learning efficiency. On the other hand, among students with low prior knowledge levels, the low-interactive simulation group did not demonstrate significantly increased comprehension scores, but they did show lower cognitive load scores and higher learning efficiency than the high-interactive ;simulation group. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Do students benefit equally from interactive computer simulations regardless of prior knowledge levels?", "paper_id": "WOS:000263921400014"}