{"auto_keywords": [{"score": 0.04141596127396745, "phrase": "labelled_transition_systems"}, {"score": 0.036725075472262815, "phrase": "covariant-contravariant_simulation_preorder"}, {"score": 0.013588812603529912, "phrase": "modal_transition_systems"}, {"score": 0.00481495049065317, "phrase": "modal_systems"}, {"score": 0.004423061344624088, "phrase": "behavioural_preorder"}, {"score": 0.004062937864702115, "phrase": "covariant-contravariant_simulation"}, {"score": 0.00399449659126893, "phrase": "partial_bisimulation_preorders"}, {"score": 0.0037745459666402915, "phrase": "mutual_translations"}, {"score": 0.0032946562900625187, "phrase": "modal_properties"}, {"score": 0.002958281631770322, "phrase": "partial_bisimulation_preorder"}, {"score": 0.0026864540069792275, "phrase": "former_model"}, {"score": 0.0024395426929046415, "phrase": "modal_transition_systems_modulo_refinement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Modal transition systems", " Simulation semantics", " Modal refinement", " Covariant-contravariant simulation", " Partial bisimulation"], "paper_abstract": "This paper studies the relationships between three notions of behavioural preorder that have been proposed in the literature: refinement over modal transition systems, and the covariant-contravariant simulation and the partial bisimulation preorders over labelled transition systems. It is shown that there are mutual translations between modal transition systems and labelled transition systems that preserve, and reflect, refinement and the covariant-contravariant simulation preorder. The translations are also shown to preserve the modal properties that can be expressed in the logics that characterize those preorders. A translation from labelled transition systems modulo the partial bisimulation preorder into the same model modulo the covariant-contravariant simulation preorder is also offered, together with some evidence that the former model is less expressive than the latter. In order to gain more insight into the relationships between modal transition systems modulo refinement and labelled transition systems modulo the covariant-contravariant simulation preorder, their connections are also phrased and studied in the context of institutions. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "On the specification of modal systems: A comparison of three frameworks", "paper_id": "WOS:000325664500013"}