{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "binary_logistic_regression_models"}, {"score": 0.004363277689798392, "phrase": "data_analysis"}, {"score": 0.004292212137716459, "phrase": "broad_classes"}, {"score": 0.0037226570791514184, "phrase": "binary_logistic_regression"}, {"score": 0.003602302241898501, "phrase": "viable_solution"}, {"score": 0.0035435867326548665, "phrase": "simple_graphical_procedure"}, {"score": 0.0032819448594643853, "phrase": "graphical_procedure"}, {"score": 0.0031069334778456633, "phrase": "logistic_analysis"}, {"score": 0.0029091587159002503, "phrase": "informative_way"}, {"score": 0.0026070408483940535, "phrase": "proposed_method"}, {"score": 0.002163535133532765, "phrase": "logistic_regression_analysis"}, {"score": 0.0021049977753042253, "phrase": "faulty_conclusions"}], "paper_keywords": ["Nonlinear models", " residuals"], "paper_abstract": "Objectives: This paper is concerned with checking goodness-of-fit of binary logistic regression models. For the practitioners of data analysis, the broad classes of procedures for checking goodness-of-fit available in the literature are described. The challenges of model checking in the context of binary logistic regression are reviewed. As a viable solution, a simple graphical procedure for checking goodness-of-fit is proposed. Methods: The graphical procedure proposed relies on pieces of information available from any logistic analysis; the focus is on combining and presenting these in an informative way. Results: The information gained using this approach is presented with three examples. In the discussion, the proposed method is put into context and compared with other graphical procedures for checking goodness-of-fit of binary logistic models available in the literature. Conclusion: A simple graphical method can significantly improve the understanding of any logistic regression analysis and help to prevent faulty conclusions.", "paper_title": "On Graphically Checking Goodness-of-fit of Binary Logistic Regression Models", "paper_id": "WOS:000266932600013"}