{"auto_keywords": [{"score": 0.04426252329364738, "phrase": "attended_target_character"}, {"score": 0.004355415885815204, "phrase": "brain's_electrical_response"}, {"score": 0.003632080001489739, "phrase": "illuminated_row"}, {"score": 0.0034625012596827334, "phrase": "longstanding_successful_approach"}, {"score": 0.0029855041123914828, "phrase": "ep"}, {"score": 0.0028187792953857957, "phrase": "outer_boundary"}, {"score": 0.002549269480908849, "phrase": "attenuated_influences"}, {"score": 0.002441783956725101, "phrase": "rcp."}, {"score": 0.002406968743305622, "phrase": "copy-spelling_mode"}, {"score": 0.002350041573006264, "phrase": "improved_accuracy"}, {"score": 0.0022944576894161485, "phrase": "ep_relative"}, {"score": 0.0022402062220305305, "phrase": "rcp"}, {"score": 0.0021976915360493628, "phrase": "faster_communication_rate"}, {"score": 0.002176747110119268, "phrase": "subjective_ratings"}, {"score": 0.0021049977753042253, "phrase": "significantly_less_fatigue"}], "paper_keywords": ["Brain-computer interface", " crowding", " edges paradigm (EP)", " P300-based speller", " visual event-related potentials"], "paper_abstract": "P300-based brain-computer interface spellers employ the P300 component, which is derived from scalp measured electroencephalogram during the brain's electrical response to a flash denoting an attended target character. The most popular P300 speller, the row-column paradigm (RCP), displays characters in a matrix within which rows and columns of characters are flashed eliciting P300 responses when the illuminated row or column contains the attended target character. Despite being a longstanding successful approach, this RCP faces several challenges, including the adjacency and crowding problems. A new P300 speller is introduced-the edges paradigm (EP). Distinct from existing P300 spellers, the EP presents a square adjacent to each column or row in the outer boundary of the matrix. By replacing each flash of a row or column with that square, this EP exhibited attenuated influences of crowding and adjacency-problems known to perturb the RCP. In the copy-spelling mode, 14 neurologically normal participants demonstrated an improved accuracy of 93.3 +/- 2.0% for the EP relative to 81.7 +/- 2.8% for the RCP, alongside a faster communication rate. Subjective ratings also indicated that the EP caused significantly less fatigue, while increasing alertness and comfort.", "paper_title": "Introducing the Edges Paradigm: A P300 Brain-Computer Interface for Spelling Written Words", "paper_id": "WOS:000366893700007"}