{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "source_location_privacy"}, {"score": 0.007693748675226196, "phrase": "wireless_sensor_networks"}, {"score": 0.004743960039962608, "phrase": "survey"}, {"score": 0.004628522534620679, "phrase": "numerous_small_nodes"}, {"score": 0.00425103400920119, "phrase": "monitored_subjects"}, {"score": 0.003976076057473637, "phrase": "national_park"}, {"score": 0.0038923605771735838, "phrase": "different_adversaries"}, {"score": 0.0036627245728600073, "phrase": "source_node"}, {"score": 0.003574695610710444, "phrase": "final_aim"}, {"score": 0.0031555744873774686, "phrase": "patient_monitoring"}, {"score": 0.0031364320619313765, "phrase": "battlefield_surveillance"}, {"score": 0.0027854565462509095, "phrase": "key_concepts"}, {"score": 0.0027019561451518768, "phrase": "safety_period"}, {"score": 0.0024736587129641652, "phrase": "adversary's_capabilities"}, {"score": 0.0023417427763424916, "phrase": "core_techniques"}, {"score": 0.0021049977753042253, "phrase": "adversarial_capabilities"}], "paper_keywords": ["WSN Privacy", " Location privacy", " Source location privacy", " Context privacy"], "paper_abstract": "Wireless sensor networks (WSNs) consist of numerous small nodes that can sense, collect, and disseminate information for many different types of applications. One of these applications is subject tracking and monitoring, in which the monitored subjects often need protection. For instance, a WSN can be deployed to monitor the movement of a panda in a national park. The panda needs protection from different adversaries, such as hunters and poachers. An adversary might trace the messages in the WSN to find the source node that sensed the panda, with the final aim of killing the panda. Hence the question is: how do we hide the location of the source node from the adversary? This question is relevant in several of the scenarios related to this application, such as patient monitoring and battlefield surveillance. In other words, the problem is to provide privacy to the source node: source location privacy. In this paper, we provide a survey of the state of the art in source location privacy. We first discuss the key concepts in source location privacy, such as anonymity, unobservability, safety period, and capture likelihood. Then, we present an overview of the solutions that provide source location privacy within a WSN, in relation to the assumptions about the adversary's capabilities. In particular, we summarize the concepts and solutions, which are categorized based on the core techniques used to provide source location privacy. We mention the limitations of the algorithms as found in the literature, classify the solutions based on their approach, and provide an overview of the assumptions on the adversarial capabilities related to each solution.", "paper_title": "Providing Source Location Privacy in Wireless Sensor Networks: A Survey", "paper_id": "WOS:000322728300015"}