{"auto_keywords": [{"score": 0.03224726441329197, "phrase": "borg"}, {"score": 0.004437910956996051, "phrase": "classic_environmental_economics_lake_problem"}, {"score": 0.004366106816225457, "phrase": "computationally_simple_but_mathematically_challenging_benchmarking_problem"}, {"score": 0.0042324326085196136, "phrase": "moea"}, {"score": 0.004203030435498069, "phrase": "hypothetical_town"}, {"score": 0.00349324530379071, "phrase": "pollution_threshold"}, {"score": 0.003362660648932247, "phrase": "drastic_phosphorus_loading_reductions"}, {"score": 0.003201890266327127, "phrase": "stochastic_natural_phosphorus_inflow"}, {"score": 0.0031329184724341592, "phrase": "comprehensive_diagnostics"}, {"score": 0.0030989899982042236, "phrase": "six_algorithms"}, {"score": 0.0027341763737751467, "phrase": "sorting_genetic_algorithm_ii"}, {"score": 0.00217496508306238, "phrase": "nontrivial_benchmarking_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Risk management", " Environmental thresholds", " Tipping points", " Multi-objective decision making", " Algorithm benchmarking", " Lake problem benchmark"], "paper_abstract": "This study contributes a stochastic, multi-objective adaptation of the classic environmental economics Lake Problem as a computationally simple but mathematically challenging benchmarking problem. The Lake Problem considers a hypothetical town by a lake, which hopes to maximize its economic benefit without crossing a nonlinear, and potentially irreversible, pollution threshold. Optimization objectives are maximize economic benefit, minimize phosphorus in the lake, maximize the probability of avoiding the pollution threshold, and minimize the probability of drastic phosphorus loading reductions in a given year. Uncertainty is introduced through a stochastic natural phosphorus inflow. We performed comprehensive diagnostics using six algorithms: the Borg multi-objective evolutionary algorithm (MOEA), MOEA/D, epsilon-MOEA, the Non-dominated Sorting Genetic Algorithm II (NSGAII), epsilon-NSGAII, and Generalized Differential Evolution 3 (GDE3) to evaluate their controllability, reliability, efficiency, and effectiveness. Our results show only the self-adaptive search of the Borg MOEA was capable of performing well on this nontrivial benchmarking problem. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Confronting tipping points: Can multi-objective evolutionary algorithms discover pollution control tradeoffs given environmental thresholds?", "paper_id": "WOS:000361906900003"}