{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiple-object_scenes"}, {"score": 0.004574085781766281, "phrase": "new_approach"}, {"score": 0.004322967486451877, "phrase": "object_occlusions"}, {"score": 0.004127753467337283, "phrase": "multiple_reflections"}, {"score": 0.003921129887153952, "phrase": "object_shapes"}, {"score": 0.0038810583785936505, "phrase": "surface_properties"}, {"score": 0.003782655283668953, "phrase": "huge_challenges"}, {"score": 0.0035021127041237887, "phrase": "single_object_modeling"}, {"score": 0.0034485432592912917, "phrase": "proposed_method"}, {"score": 0.003160049822855747, "phrase": "multi-view_images"}, {"score": 0.002836679611901583, "phrase": "first_approach"}, {"score": 0.002546315584783112, "phrase": "second_approach"}, {"score": 0.002262209824105154, "phrase": "unsupervised_and_supervised_segmentations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D scene modeling", " Disparity correction", " Shape-from-contours"], "paper_abstract": "This paper proposes a new approach for multi-object 3D scene modeling. Scenes with multiple objects are characterized by object occlusions under several views, complex illumination conditions due to multiple reflections and shadows, as well as a variety of object shapes and surface properties. These factors raise huge challenges when attempting to model real 3D multi-object scene by using existing approaches which are designed mainly for single object modeling. The proposed method relies on the initialization provided by a rough 3D model of the scene estimated from the given set of multi-view images. The contributions described in this paper consists of two new methods for identifying and correcting errors in the reconstructed 3D scene. The first approach corrects the location of 3D patches from the scene after detecting the disparity between pairs of their projections into images. The second approach is called shape-from-contours and identifies discrepancies between projections of 3D objects and their corresponding contours, segmented from images. Both unsupervised and supervised segmentations are used to define the contours of objects. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "3D modeling of multiple-object scenes from sets of images", "paper_id": "WOS:000326903500027"}