{"auto_keywords": [{"score": 0.04799625947680518, "phrase": "pba"}, {"score": 0.023227280045016733, "phrase": "information_systems"}, {"score": 0.019054656609953563, "phrase": "collaborative_technology"}, {"score": 0.010206519040585027, "phrase": "practice-based_approach"}, {"score": 0.009638890843088348, "phrase": "empirical_data"}, {"score": 0.004789839974879249, "phrase": "purpose_-_the_purpose"}, {"score": 0.004314127287770832, "phrase": "collaborative_software"}, {"score": 0.0040942189695983185, "phrase": "relational_thinking"}, {"score": 0.003905864553426306, "phrase": "corporate_setting"}, {"score": 0.0038349690130889767, "phrase": "human_resource"}, {"score": 0.0037261429556468217, "phrase": "large_mexican_university"}, {"score": 0.0034992667091713813, "phrase": "information_system"}, {"score": 0.0033910448175165004, "phrase": "hr_practices"}, {"score": 0.003251920460276645, "phrase": "hr_practitioners'_patterns"}, {"score": 0.0032180376288035296, "phrase": "media_use"}, {"score": 0.0030299300464039615, "phrase": "political_manoeuvring"}, {"score": 0.002974886152979993, "phrase": "potential_users"}, {"score": 0.0028527866590859967, "phrase": "key_tenets"}, {"score": 0.0027572701926732906, "phrase": "collective_and_historical_conditions"}, {"score": 0.002651015392318126, "phrase": "political_process"}, {"score": 0.0025960262223338293, "phrase": "remaining_issues"}, {"score": 0.00256895975568914, "phrase": "major_issue"}, {"score": 0.002548844785958836, "phrase": "theoretical_resources"}, {"score": 0.002450602177683066, "phrase": "structural_power"}, {"score": 0.002337684811187166, "phrase": "alternative_perspective"}, {"score": 0.0022653055209664284, "phrase": "information_technologies"}, {"score": 0.002177967779626705, "phrase": "actor-network_theory"}, {"score": 0.0021049977753042253, "phrase": "praxeological_studies"}], "paper_keywords": ["Information systems", " Mexico", " Actor network theory", " Practice-based approach", " Technology adoption and use"], "paper_abstract": "Purpose - The purpose of this paper is to evaluate the value and limitations of a practice-based approach (PBA) to studying the adoption and use of information systems, through a summary of the theory and exploration of empirical data about the use of collaborative software. Design/methodology/approach - A selection of theoretical resources from the practice-based approach, namely, its view of routine and change, socio-materiality, relational thinking and knowing are introduced. They are employed to analyse the adoption of a collaborative technology in a corporate setting. The empirical data is 30 interviews with human resource (HR) professionals involved in a project in a large Mexican University. Findings - The adoption and use of the collaborative technology is shaped by collective, historical, social and contextual factors that permeate the HR practices being supported by the information system. Among the factors that shaped participation are the interconnection of HR practices to other practices of the University; the existence of habits and the sense of routinisation reflected in HR practitioners' patterns of interaction and media use; the concern of practitioners that participation in the community did not fit the way HR practices are performed; and the political manoeuvring taking place between actors to persuade potential users to participate in the community. Research limitations/implications - The strength of the analysis using key tenets from a PBA is to deepen our understanding of context as shaped by collective and historical conditions. The sociology of translation can be used to further increase understanding of the political process around the adoption of the collaborative technology. Remaining issues point to a major issue with the theoretical resources from the PBA used in this study, namely the adequacy of its treatment of structural power. Originality/value - The paper reports research of significance to those interested in information systems by providing an alternative perspective that sheds light on contextual, social and historical factors affecting the adoption and use of information technologies. The paper is also valuable in suggesting how the PBA can benefit from Actor-Network Theory (ANT). This will be relevant to the field of praxeological studies.", "paper_title": "An evaluation of the practice based approach to understanding the adoption and use of information systems", "paper_id": "WOS:000341925900008"}