{"auto_keywords": [{"score": 0.03859150608353858, "phrase": "reference_alignment"}, {"score": 0.00481495049065317, "phrase": "optimizing_ontology_alignments_through_nsga-ii"}, {"score": 0.004659192888931046, "phrase": "data_heterogeneity_problems"}, {"score": 0.004602085616330634, "phrase": "semantic_web"}, {"score": 0.004527024978801684, "phrase": "available_ontologies"}, {"score": 0.004256243266481051, "phrase": "semantic_interoperability"}, {"score": 0.0031260524791486347, "phrase": "novel_approach"}, {"score": 0.0030247625535682987, "phrase": "ontology_alignments"}, {"score": 0.0029027394930867902, "phrase": "adaptive_aggregation_strategy"}, {"score": 0.0028086649378423357, "phrase": "optimizing_process"}, {"score": 0.002629539710839523, "phrase": "classic_recall"}, {"score": 0.002492425259337031, "phrase": "experimental_results"}, {"score": 0.0021488235554917128, "phrase": "state_of_the_art_ontology_matching_systems"}, {"score": 0.0021231062983187356, "phrase": "goal"}, {"score": 0.0021049977753042253, "phrase": "sambo."}], "paper_keywords": ["Ontology alignment", " NSGA-II", " similarity measures", " adaptive similarity aggregation", " approximate evaluation measure"], "paper_abstract": "Ontology is widely used to solve the data heterogeneity problems on the semantic web, but the available ontologies could themselves introduce heterogeneity. In order to reconcile these ontologies to implement the semantic interoperability, we need to find the relationships among the entities in various ontologies, and the process of identifying them is called ontology alignment. In all the existing matching systems that use evolutionary approaches to optimize their parameters, a reference alignment between two ontologies to be aligned should be given in advance which could be very expensive to obtain especially when the scale of ontologies is considerably large. To address this issue, in this paper we propose a novel approach to utilize the NSGA-II to optimize the ontology alignments without using the reference alignment. In our approach, an adaptive aggregation strategy is presented to improve the efficiency of optimizing process and two approximate evaluation measures, namely match coverage and match ratio, are introduced to replace the classic recall and precision on reference alignment to evaluate the quality of the alignments. Experimental results show that our approach is effective and can find the solutions that are very close to those obtained by the approaches using reference alignment, and the quality of alignments is in general better than that of state of the art ontology matching systems such as GOAL and SAMBO.", "paper_title": "OPTIMIZING ONTOLOGY ALIGNMENTS THROUGH NSGA-II WITHOUT USING REFERENCE ALIGNMENT", "paper_id": "WOS:000346950300007"}