{"auto_keywords": [{"score": 0.04820929802388964, "phrase": "digital_information_environments"}, {"score": 0.004358676214574977, "phrase": "insight_result"}, {"score": 0.004024863549087511, "phrase": "new_knowledge"}, {"score": 0.003553540530701019, "phrase": "unexpected_circumstances"}, {"score": 0.003152915289414825, "phrase": "previous_work"}, {"score": 0.0030600032877646263, "phrase": "rich_empirical_understanding"}, {"score": 0.002634830238219976, "phrase": "existing_digital_environments"}, {"score": 0.002544422946205545, "phrase": "future_environments"}, {"score": 0.002420611343093316, "phrase": "new_way"}, {"score": 0.002126111716875142, "phrase": "discrete_phenomenon"}, {"score": 0.0021049977753042253, "phrase": "digital_environments"}], "paper_keywords": ["serendipity"], "paper_abstract": "Serendipity occurs when unexpected circumstances and an aha moment of insight result in a valuable, unanticipated outcome. Designing digital information environments to support serendipity can not only provide users with new knowledge, but also propel them in directions they might not otherwise have traveled insurprising and delighting them along the way. As serendipity involves unexpected circumstances it cannot be directly controlled, but it can be potentially influenced. However, to the best of our knowledge, no previous work has focused on providing a rich empirical understanding of how it might be influenced. We interviewed 14 creative professionals to identify their self-reported strategies aimed at increasing the likelihood of serendipity. These strategies form a framework for examining ways existing digital environments support serendipity and for considering how future environments can create opportunities for it. This is a new way of thinking about how to design for serendipity; by supporting the strategies found to increase its likelihood rather than attempting to support serendipity as a discrete phenomenon, digital environments not only have the potential to help users experience serendipity but also encourage them to adopt the strategies necessary to experience it more often.", "paper_title": "Making my own luck: Serendipity Strategies and How to Support Them in Digital Information Environments", "paper_id": "WOS:000344225200002"}