{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "adversarial_agents"}, {"score": 0.004575854901681043, "phrase": "content_transformation"}, {"score": 0.004498812433096501, "phrase": "evolving_society"}, {"score": 0.003648411055689428, "phrase": "stochastic_mathematical_models"}, {"score": 0.0035065523764817143, "phrase": "efficient_representation"}, {"score": 0.0030606302942851027, "phrase": "different_abstraction_levels"}, {"score": 0.0028111220617485985, "phrase": "geographical_location"}, {"score": 0.0027017308406240563, "phrase": "urban_military_planning_scenarios"}, {"score": 0.002495521662819317, "phrase": "autonomous_systems"}, {"score": 0.0024673738215365104, "phrase": "low_computational_cost"}, {"score": 0.0023848164282879885, "phrase": "numerical_estimates"}, {"score": 0.0021049977753042253, "phrase": "alternative_strategies"}], "paper_keywords": ["mathematical modelling", " G-networks", " military strategy and planning", " multi-agent systems"], "paper_abstract": "As a result of the structure and content transformation of an evolving society, many large scale autonomous systems emerged in diverse areas such as biology, ecology or finance. Inspired by the desire to better understand and make the best out of these systems, we propose an approach which builds stochastic mathematical models, in particular G-networks models, that allow the efficient representation of systems of agents and offer the possibility to analyze their behavior using mathematics. This approach is capable of modelling the system at different abstraction levels, both in terms of the number of agents and the size of the geographical location. We demonstrate our approach with some urban military planning scenarios and the results suggest that this approach has tackled the problem in modelling autonomous systems at low computational cost. Apart from offering the numerical estimates of the outcome, the approach helps us identify the characteristics that impact the system most and allows us to compare alternative strategies.", "paper_title": "G-networks and the modeling of adversarial agents", "paper_id": "WOS:000241472100035"}