{"auto_keywords": [{"score": 0.04870300013732668, "phrase": "data_population"}, {"score": 0.00481495049065317, "phrase": "outlying_properties"}, {"score": 0.004783852487938866, "phrase": "exceptional_objects"}, {"score": 0.004094639048362357, "phrase": "particular_individual"}, {"score": 0.00342568771304873, "phrase": "attribute_values"}, {"score": 0.0033271045779740683, "phrase": "reference_population"}, {"score": 0.0030778231027679464, "phrase": "global_and_local_properties"}, {"score": 0.002931569771634119, "phrase": "entire_data_population"}, {"score": 0.0029031614127920232, "phrase": "local_ones"}, {"score": 0.0027831968213396056, "phrase": "former_one"}, {"score": 0.0027295084882654917, "phrase": "data_subpopulation"}, {"score": 0.002659527314613792, "phrase": "exceptional_individual"}, {"score": 0.002541338976408689, "phrase": "abnormal_properties"}, {"score": 0.0025248881422983553, "phrase": "associated_explanations"}, {"score": 0.0024048460326284416, "phrase": "efficient_algorithms"}, {"score": 0.002327998222143962, "phrase": "experimental_evidence"}, {"score": 0.0021886732310288128, "phrase": "meaningful_information"}, {"score": 0.0021534125023440895, "phrase": "computational_task"}, {"score": 0.002125612498781805, "phrase": "negligible_fraction"}, {"score": 0.0021049977753042253, "phrase": "search_space"}], "paper_keywords": ["Algorithms", " Management", " Data mining", " knowledge discovery", " outlier characterization"], "paper_abstract": "Assume you are given a data population characterized by a certain number of attributes. Assume, moreover, you are provided with the information that one of the individuals in this data population is abnormal, but no reason whatsoever is given to you as to why this particular individual is to be considered abnormal. In several cases, you will be indeed interested in discovering such reasons. This article is precisely concerned with this problem of discovering sets of attributes that account for the ( a priori stated) abnormality of an individual within a given dataset. A criterion is presented to measure the abnormality of combinations of attribute values featured by the given abnormal individual with respect to the reference population. In this respect, each subset of attributes is intended to somehow represent a \"property\" of individuals. We distinguish between global and local properties. Global properties are subsets of attributes explaining the given abnormality with respect to the entire data population. With local ones, instead, two subsets of attributes are singled out, where the former one justifies the abnormality within the data subpopulation selected using the values taken by the exceptional individual on those attributes included in the latter one. The problem of individuating abnormal properties with associated explanations is formally stated and analyzed. Such a formal characterization is then exploited in order to devise efficient algorithms for detecting both global and local forms of most abnormal properties. The experimental evidence, which is accounted for in the article, shows that the algorithms are both able to mine meaningful information and to accomplish the computational task by examining a negligible fraction of the search space.", "paper_title": "Detecting Outlying Properties of Exceptional Objects", "paper_id": "WOS:000265494300007"}