{"auto_keywords": [{"score": 0.027596260326820794, "phrase": "profile_information"}, {"score": 0.00481495049065317, "phrase": "cultural_activities"}, {"score": 0.004095692768056685, "phrase": "cultural_institutions"}, {"score": 0.004007083686875716, "phrase": "interested_communities"}, {"score": 0.0038862297330905836, "phrase": "cultural_events"}, {"score": 0.0038355531523269217, "phrase": "right_people"}, {"score": 0.003468287913322255, "phrase": "aggregated_events"}, {"score": 0.003408091901859624, "phrase": "linked_open_data"}, {"score": 0.0032764307492734145, "phrase": "event_items"}, {"score": 0.003191485583025302, "phrase": "smart_indexing"}, {"score": 0.0031498398446368025, "phrase": "open_datasets"}, {"score": 0.0029238768315330305, "phrase": "global_profile"}, {"score": 0.0027741761880779535, "phrase": "user_communities"}, {"score": 0.002552628669352939, "phrase": "different_communities"}, {"score": 0.002497319603143104, "phrase": "detrimental_effect"}, {"score": 0.0024007585788965655, "phrase": "ultimate_goal"}, {"score": 0.002228412982799273, "phrase": "useful_event_information"}, {"score": 0.0021896891011033105, "phrase": "basic_information_retrieval"}], "paper_keywords": ["Event modelling", " Profiling", " Recommendation"], "paper_abstract": "Today, people have only limited, valuable spare time at their hands which they want to fill in as good as possible according to their interests. At the same time, cultural institutions are trying to attract interested communities to their carefully planned cultural programs. To distribute these cultural events to the right people, we developed a framework that will aggregate, enrich, recommend and distribute these events as targeted as possible. The aggregated events are published as Linked Open Data using an RDF/OWL representation of the EventsML-G2 standard. These event items are categorised and enriched via smart indexing and linked open datasets available on the Web of data. For recommending the events to the end-user, a global profile of the end-user is automatically constructed by aggregating his profile information from all user communities the user trusts and is registered to. This way, the recommendations take profile information into account from different communities, which has a detrimental effect on the recommendations. As such, the ultimate goal is to provide an open, user-friendly recommendation platform that harnesses the end-user with a tool to access useful event information that goes beyond basic information retrieval. At the same time, we provide the (inter)national cultural community with standardised mechanisms to describe/distribute event and profile information.", "paper_title": "Unifying and targeting cultural activities via events modelling and profiling", "paper_id": "WOS:000300778800012"}