{"auto_keywords": [{"score": 0.00936987331517694, "phrase": "firm_performance"}, {"score": 0.004195418010131832, "phrase": "special_attention"}, {"score": 0.004066076430818046, "phrase": "moderating_effect"}, {"score": 0.003771631577951067, "phrase": "survey_data"}, {"score": 0.0036097844103129043, "phrase": "financial_data"}, {"score": 0.0035648266669315943, "phrase": "publicly_disclosed_financial_reports"}, {"score": 0.003047776993499616, "phrase": "significant_direct_effect"}, {"score": 0.002935248513348432, "phrase": "direct_effect"}, {"score": 0.0026055251533586804, "phrase": "latter_and_firm_performance"}, {"score": 0.0023127544795063263, "phrase": "general_relationships"}, {"score": 0.0022696277881969896, "phrase": "systematic_differences"}, {"score": 0.0022273034991008326, "phrase": "specific_it_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["strategy", " information technology (IT) applications", " performance", " impediments to IT implementation"], "paper_abstract": "Our study examined the association among strategy, the extent of IT applications to 12 planning and control functions, and firm performance. Special attention was paid to the moderating effect on these relationships of 15 technical, human, and organizational impediments to IT implementation. We analyzed survey data obtained from 296 Taiwanese companies, supplemented by financial data from publicly disclosed financial reports. Results indicated that strategy significantly influenced the extent of IT applications for planning and control. In turn, the extent of IT applications had a significant direct effect on firm performance, while the direct effect of strategy was insignificant. The relationship between strategy and the extent of IT applications, and between the latter and firm performance were both stronger when the level of impediments to IT implementation was low. The findings went beyond these general relationships to reveal systematic differences in the specific IT applications and impediments of firms pursuing different strategies.(c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Strategy, IT applications for planning and control, and firm performance: The impact of impediments to IT implementation", "paper_id": "WOS:000243775300003"}