{"auto_keywords": [{"score": 0.041153750933824076, "phrase": "electronic_documentation_system"}, {"score": 0.015543934667232707, "phrase": "residential_aged_care_facility"}, {"score": 0.01425905616824344, "phrase": "electronic_system"}, {"score": 0.01075472841548219, "phrase": "direct_care"}, {"score": 0.00481495049065317, "phrase": "electronic_nursing_documentation_system"}, {"score": 0.004671156704912419, "phrase": "increasing_research"}, {"score": 0.004635881163634672, "phrase": "caregivers'_interaction"}, {"score": 0.004281125387210667, "phrase": "racf"}, {"score": 0.00421668332357505, "phrase": "caregivers'_use"}, {"score": 0.003879138659123195, "phrase": "racf._methods"}, {"score": 0.0038352452380298464, "phrase": "observational_work_sampling_study"}, {"score": 0.0033967510986397946, "phrase": "personal_carers"}, {"score": 0.0030196821790309165, "phrase": "pre-implementation_levels"}, {"score": 0.002896167001212006, "phrase": "recreational_activity_officers"}, {"score": 0.0024319378563138223, "phrase": "newly_introduced_electronic_documentation_system"}, {"score": 0.002279841453843241, "phrase": "caregivers'_integration"}, {"score": 0.002254003531073337, "phrase": "new_documentation_practice"}, {"score": 0.002137236968970666, "phrase": "verbal_communication"}, {"score": 0.0021049977753042253, "phrase": "aged_care_service"}], "paper_keywords": ["Electronic nursing documentation", " electronic health record", " impact", " nurse", " residential aged care", " nursing home"], "paper_abstract": "Background: Despite increasing research on caregivers' interaction with technology, there has been no attempt to investigate how the introduction of an electronic system in a residential aged care facility (RACF) may affect caregivers' use of their time. Objective: To assess how caregivers use their time before and after the introduction of an electronic documentation system in an RACF. Methods: An observational work sampling study was undertaken with caregivers at two months before, and at 3, 6, 12 and 23 months after the implementation of an electronic documentation system. Results: During the first 12 months after implementation, the proportion of time spent by personal carers on documentation in-creased, that on direct care reduced, and the proportion on communication remained unchanged. At 23 months, the proportion on documentation and direct care had returned to pre-implementation levels. The percentage of time spent on these activities by recreational activity officers remained unchanged at most measurement periods after implementation. Changes in proportions of time on other activities were not directly associated with the introduction of the electronic system. Conclusion: It may take over a year for some caregivers in an RACF to integrate the use of a newly introduced electronic documentation system into their daily work. Organisations implementing such systems should develop strategies that support and accelerate the caregivers' integration of the new documentation practice into their routine activities. The electronic documentation system may not however, replace the role of verbal communication between caregivers in aged care service.", "paper_title": "Caregivers' Time Utilization before and after the Introduction of an Electronic Nursing Documentation System in a Residential Aged Care Facility", "paper_id": "WOS:000326480900005"}