{"auto_keywords": [{"score": 0.04670074843427755, "phrase": "social_networks"}, {"score": 0.00481495049065317, "phrase": "social_networks_using_centrality_sensitivity"}, {"score": 0.004579147045265106, "phrase": "centrality_metrics"}, {"score": 0.004516856326107826, "phrase": "key_metric"}, {"score": 0.004414907432703781, "phrase": "visual_reasoning"}, {"score": 0.0037454814403672697, "phrase": "analytical_solution"}, {"score": 0.003418327319110734, "phrase": "random_walks"}, {"score": 0.0032955848190195343, "phrase": "good_indicators"}, {"score": 0.0028340217672278975, "phrase": "complex_network"}, {"score": 0.00274472767672686, "phrase": "main_structural_properties"}, {"score": 0.002610043728801011, "phrase": "key_concept"}, {"score": 0.0025862736445290088, "phrase": "uncertainty_analysis"}, {"score": 0.0023818288346547692, "phrase": "key_network_metrics"}, {"score": 0.002244277924422011, "phrase": "measuring_sensitivity"}, {"score": 0.0021049977753042253, "phrase": "social_and_other_scale-free_networks"}], "paper_keywords": ["Social network visualization", " centrality", " sensitivity analysis", " eigenvector and Markov importance"], "paper_abstract": "In this paper, we study the sensitivity of centrality metrics as a key metric of social networks to support visual reasoning. As centrality represents the prestige or importance of a node in a network, its sensitivity represents the importance of the relationship between this and all other nodes in the network. We have derived an analytical solution that extracts the sensitivity as the derivative of centrality with respect to degree for two centrality metrics based on feedback and random walks. We show that these sensitivities are good indicators of the distribution of centrality in the network, and how changes are expected to be propagated if we introduce changes to the network. These metrics also help us simplify a complex network in a way that retains the main structural properties and that results in trustworthy, readable diagrams. Sensitivity is also a key concept for uncertainty analysis of social networks, and we show how our approach may help analysts gain insight on the robustness of key network metrics. Through a number of examples, we illustrate the need for measuring sensitivity, and the impact it has on the visualization of and interaction with social and other scale-free networks.", "paper_title": "Visual Reasoning about Social Networks Using Centrality Sensitivity", "paper_id": "WOS:000296775400013"}