{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_libraries"}, {"score": 0.004644247838681628, "phrase": "complex_information_systems"}, {"score": 0.00426900754050533, "phrase": "non-trivial_task"}, {"score": 0.0041842092128678105, "phrase": "periodical_evaluation"}, {"score": 0.004134137523409649, "phrase": "different_dl_components"}, {"score": 0.003845994935767022, "phrase": "administrator_intervention"}, {"score": 0.0035067452724203124, "phrase": "automatic_and_configurable_evaluations"}, {"score": 0.003368707839819003, "phrase": "digital_objects"}, {"score": 0.003236086384959101, "phrase": "diverse_numeric_indicators"}, {"score": 0.003171740347925348, "phrase": "eight_quality_dimensions"}, {"score": 0.002915125480162171, "phrase": "main_contributions"}, {"score": 0.0026792166577171476, "phrase": "theoretical_dl_quality_model"}, {"score": 0.002432834929068545, "phrase": "usability_specialists"}, {"score": 0.002209060366991921, "phrase": "real_dls"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Digital libraries", " Quality assessment", " 5S", " 5SQual"], "paper_abstract": "Digital libraries (DLs) are complex information systems which can present changes in their structure, content, and services. These complexities and dynamics make system maintenance a non-trivial task, since it requires periodical evaluation of the different DL components. Generally, these evaluations are customized per system and are performed only when problems occur and administrator intervention is required. This work aims to change the situation. We present 5SQual, a tool which provides ways to perform automatic and configurable evaluations of some of the most important DL components, among them, digital objects, metadata, and services. The tool implements diverse numeric indicators that are associated with eight quality dimensions described in the 5S quality model. Its generic architecture was developed to be applicable to various DLs and scenarios. In sum, the main contributions of this work include: (i) the design and implementation of 5SQual, a tool that validates a theoretical DL quality model; (ii) the demonstration of the applicability of the tool in several usage scenarios; and (iii) the evaluation (with usability specialists) of its graphical interface specially designed to guide the configuration of 5SQual evaluations. We also present the results of interviews conducted with administrators of real DLs regarding their expectations and opinions about 5SQual. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic evaluation of digital libraries with 5SQual", "paper_id": "WOS:000264317300002"}