{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intelligent_adversary"}, {"score": 0.004657542074154025, "phrase": "network_protection_strategies"}, {"score": 0.0032302647179383915, "phrase": "chosen_motivation"}, {"score": 0.0031096747349602344, "phrase": "simple_game-theoretic_network_protection_model"}, {"score": 0.002868116925014397, "phrase": "maximal_damage"}, {"score": 0.0028006988338192375, "phrase": "reconnaissance_mission"}, {"score": 0.002696101728474703, "phrase": "intrusion_strategy"}, {"score": 0.0024630345285372958, "phrase": "protector's_efforts"}, {"score": 0.0022500695985527668, "phrase": "adversary's_behavior"}, {"score": 0.0021659920594094407, "phrase": "protection_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Network protection", " Equilibrium", " Bayesian game"], "paper_abstract": "Traditionally, the design of network protection strategies is based on the answers of a protector and an adversary to the question \"How?\": how should the protector allocate its protection resources, and how should the adversary allocate its attacking resources? This paper considers a more sophisticated adversary, who, planning its malicious activities, considers two questions: \"What for?\" and \"How?\". Namely, what is the motivation for the attack? and how to attack based on the chosen motivation? To study this problem, a simple game-theoretic network protection model is considered, in which the adversary decides whether to intrude on the network to inflict maximal damage or to perform a reconnaissance mission, and based on this decision an intrusion strategy is designed. The solution to this game shows that such an adversary may try a feint to draw the protector's efforts away from the nodes that the adversary intends to attack. Taking into account this feature of the adversary's behavior allows improvements in the reliability of a protection strategy. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "How to deal with an intelligent adversary", "paper_id": "WOS:000366233400029"}