{"auto_keywords": [{"score": 0.049757144405741305, "phrase": "gp"}, {"score": 0.044006163864691875, "phrase": "cdss"}, {"score": 0.00481495049065317, "phrase": "computerized_decision_support_systems"}, {"score": 0.004734448316824488, "phrase": "objective_computerized_decision_support_systems"}, {"score": 0.00430777589162606, "phrase": "general_practitioners"}, {"score": 0.004053932711987671, "phrase": "prescribing_decisions"}, {"score": 0.004026664041845776, "phrase": "primary_care"}, {"score": 0.003959393713361671, "phrase": "quantitative"}, {"score": 0.003763827319426842, "phrase": "multi-channel_video_recordings"}, {"score": 0.0032772504899699416, "phrase": "gp_checking"}, {"score": 0.0031577303835881964, "phrase": "information_and_safety_alerts"}, {"score": 0.00252656192077797, "phrase": "proposed_treatment"}, {"score": 0.002442594378453517, "phrase": "information_leaflet"}, {"score": 0.002426137929553722, "phrase": "discussion_cdss"}, {"score": 0.0023694065215394593, "phrase": "prescribing_workflow"}, {"score": 0.0023455000216532802, "phrase": "whole_gp_consultation"}, {"score": 0.0023296961971785357, "phrase": "current_systems"}, {"score": 0.002199582070223336, "phrase": "management_plan"}, {"score": 0.0021847592782091923, "phrase": "conclusions_cdss"}, {"score": 0.0021049977753042253, "phrase": "prescribing_support"}], "paper_keywords": [""], "paper_abstract": "Objective Computerized decision support systems (CDSS) are commonly deployed to support prescribing, although over-riding of alerts by prescribers remains a concern. We aimed to understand how general practitioners (GPs) interact with prescribing CDSS in order to inform deliberation on how better to support prescribing decisions in primary care. Materials and methods Quantitative and qualitative analysis of interactions between GPs, patients, and computer systems using multi-channel video recordings of 112 primary care consultations with eight GPs in three UK practices. Results 132 prescriptions were issued in the course of 73 of the consultations, of which 81 (61%) attracted at least one alert. Of the total of 117 alerts, only three resulted in the GP checking, but not altering, the prescription. CDSS provided information and safety alerts at the point of generating a prescription. This was 'too much, too late' as the majority of the 'work' of prescribing occurred prior to using the computer. By the time an alert appeared, the GP had formulated the problem(s), potentially spent several minutes considering, explaining, negotiating, and reaching agreement with the patient about the proposed treatment, and had possibly given instructions and printed an information leaflet. Discussion CDSS alerts do not coincide with the prescribing workflow throughout the whole GP consultation. Current systems interrupt to correct decisions that have already been taken, rather than assisting formulation of the management plan. Conclusions CDSS are likely to be more acceptable and effective if the prescribing support is provided much earlier in the process of generating a prescription.", "paper_title": "'Too much, too late': mixed methods multi-channel video recording study of computerized decision support systems and GP prescribing", "paper_id": "WOS:000319192100014"}