{"auto_keywords": [{"score": 0.04848464366549708, "phrase": "video_clips"}, {"score": 0.03139227119354417, "phrase": "video_popularity"}, {"score": 0.027690611352561744, "phrase": "lifetime_popularity_measures"}, {"score": 0.00481495049065317, "phrase": "web-based_video_sharing_workloads"}, {"score": 0.004702168843383725, "phrase": "ordinary_web_users"}, {"score": 0.004349791059765796, "phrase": "video_sharing_workloads"}, {"score": 0.004262273304740847, "phrase": "workload_characteristics"}, {"score": 0.0036968421974412522, "phrase": "uploading_content"}, {"score": 0.0035979378467361762, "phrase": "active_contribution"}, {"score": 0.0035494788628319903, "phrase": "video_uploading"}, {"score": 0.0034195441640721995, "phrase": "passive_use"}, {"score": 0.0031845067058084583, "phrase": "multi-time_uploaders"}, {"score": 0.0029857633082091377, "phrase": "lifetime_measures"}, {"score": 0.002915701586760994, "phrase": "heavy-tailed_forms"}, {"score": 0.0027804579695873827, "phrase": "system_design"}, {"score": 0.0027523011981394835, "phrase": "identified_invariants"}, {"score": 0.002678598911294797, "phrase": "video_sharing_systems"}, {"score": 0.0025630077791393125, "phrase": "additional_dataset_tracking_views"}, {"score": 0.0024440836179156593, "phrase": "twelve-week_period"}, {"score": 0.0023625233416109917, "phrase": "large_cache"}, {"score": 0.0021049977753042253, "phrase": "cache_size"}], "paper_keywords": ["Measurement", " Human Factors", " Video sharing", " user-generated content", " workload characterization", " power law", " social interaction"], "paper_abstract": "Video sharing services that allow ordinary Web users to upload video clips of their choice and watch video clips uploaded by others have recently become very popular. This article identifies invariants in video sharing workloads, through comparison of the workload characteristics of four popular video sharing services. Our traces contain metadata on approximately 1.8 million videos which together have been viewed approximately 6 billion times. Using these traces, we study the similarities and differences in use of several Web 2.0 features such as ratings, comments, favorites, and propensity of uploading content. In general, we find that active contribution, such as video uploading and rating of videos, is much less prevalent than passive use. While uploaders in general are skewed with respect to the number of videos they upload, the fraction of multi-time uploaders is found to differ by a factor of two between two of the sites. The distributions of lifetime measures of video popularity are found to have heavy-tailed forms that are similar across the four sites. Finally, we consider implications for system design of the identified invariants. To gain further insight into caching in video sharing systems, and the relevance to caching of lifetime popularity measures, we gathered an additional dataset tracking views to a set of approximately 1.3 million videos from one of the services, over a twelve-week period. We find that lifetime popularity measures have some relevance for large cache (hot set) sizes (i.e., a hot set defined according to one of these measures is indeed relatively \"hot\"), but that this relevance substantially decreases as cache size decreases, owing to churn in video popularity.", "paper_title": "Characterizing Web-Based Video Sharing Workloads", "paper_id": "WOS:000292627600003"}