{"auto_keywords": [{"score": 0.035540924832287046, "phrase": "mpm"}, {"score": 0.00481495049065317, "phrase": "network_intrusion_detection"}, {"score": 0.0043512358455892, "phrase": "increasing_speed_network"}, {"score": 0.004195418010131832, "phrase": "well_designed_custom_coprocessor"}, {"score": 0.004094639048362357, "phrase": "parameterized_multilevel_pattern"}, {"score": 0.003700037700138249, "phrase": "selected_character_decoding"}, {"score": 0.0036701748206373033, "phrase": "scd"}, {"score": 0.0036257863613963245, "phrase": "multilevel_method"}, {"score": 0.003453584878128719, "phrase": "mpm_generator"}, {"score": 0.003398015125667192, "phrase": "rtl-level_codes"}, {"score": 0.003171615440419782, "phrase": "efficient_mpm_architecture"}, {"score": 0.003070340620983981, "phrase": "total_hardware_solution"}, {"score": 0.00303319936111073, "phrase": "third_contribution"}, {"score": 0.0029965060407413898, "phrase": "mathematical_model"}, {"score": 0.0029244418026475832, "phrase": "chip_area"}, {"score": 0.002751751956416832, "phrase": "proper_type"}, {"score": 0.002685558057339722, "phrase": "mpm_architecture"}, {"score": 0.0022281257694320433, "phrase": "general_random_pattern_sets"}], "paper_keywords": ["network intrusion detection", " network intrusion prevention", " pattern matching", " network security"], "paper_abstract": "Pattern matching is one of the most performance-critical components for the content inspection based applications of network security, such as network intrusion detection and prevention. To keep up with the increasing speed network, this component needs to be accelerated by well designed custom coprocessor. This paper presents a parameterized multilevel pattern matching architecture (MPM) which is used on FPGAs. To achieve less chip area, the architecture is designed based on the idea of selected character decoding (SCD) and multilevel method which are analyzed in detail. This paper also proposes an MPM generator that can generate RTL-level codes of MPM by giving a pattern set and predefined parameters. With the generator, the efficient MPM architecture can be generated and embedded to a total hardware solution. The third contribution is a mathematical model and formula to estimate the chip area for each MPM before it is generated, which is useful for choosing the proper type of FPGAs. One example MPM architecture is implemented by giving 1785 patterns of Snort on Xilinx Virtex 2 Pro FPGA. The results show that this MPM can achieve 4.3 Gbps throughput with 5 stages of pipelines and 0.22 slices per character, about one half chip area of the most area-efficient architecture in literature. Other results are given to show that MPM is also efficient for general random pattern sets. The performance of MPM can be scalable near linearly, potential for more than 100 Gbps throughput.", "paper_title": "A parameterized multilevel pattern matching architecture on FPGAs for network intrusion detection and prevention", "paper_id": "WOS:000266829700005"}