{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "medicine_prescription_behavior"}, {"score": 0.004774937143916685, "phrase": "medicine_prescriptions"}, {"score": 0.0047155367844327, "phrase": "important_role"}, {"score": 0.004676345706416371, "phrase": "medical_treatments"}, {"score": 0.004392565073466714, "phrase": "prescription_behavior"}, {"score": 0.0043560464825349275, "phrase": "specific_physicians"}, {"score": 0.003924284136338428, "phrase": "prescription_behavior_multiple_perspectives"}, {"score": 0.0038112201846057445, "phrase": "new_approach"}, {"score": 0.003763763153640936, "phrase": "prescription_data"}, {"score": 0.0033482708495261864, "phrase": "selected_items"}, {"score": 0.0032517484445814334, "phrase": "custom_glyphs"}, {"score": 0.0028327783069076883, "phrase": "possibly_other_stakeholders"}, {"score": 0.0027857990883821504, "phrase": "wide_variety"}, {"score": 0.002671722386856879, "phrase": "familiar_metaphors"}, {"score": 0.002509284173541882, "phrase": "short_time"}, {"score": 0.002436888552432559, "phrase": "evaluation_session"}, {"score": 0.00241658945942583, "phrase": "six_neurologists"}, {"score": 0.0023079225317714793, "phrase": "medicine_prescription_data"}, {"score": 0.0022413233627905696, "phrase": "underlying_pattern"}], "paper_keywords": [""], "paper_abstract": "Medicine prescriptions play an important role in medical treatments. More insight in medicine prescription behavior can lead to more efficient and effective treatments, as well as reflection on prescription behavior for specific physicians, types of medicines, or classes of patients. Most current medical visualization systems show health data only from the perspective of patients, whereas to understand prescription behavior multiple perspectives are relevant. We present a new approach to visualize prescription data from four different perspectives: physician, patient, medicine, and prescription. Information about physicians, patients, and medicines is shown in three tables; relations between selected items in these tables are shown using custom glyphs and histograms. These tables can also be used to define selections of prescriptions which can be compared to each other by showing a variety of metrics. This enables physicians and possibly other stakeholders to perform a wide variety of queries and inspections, while the use of familiar metaphors, such as tables and histograms, enables them to use the system in short time. This was confirmed by an evaluation session with six neurologists from an institute of epileptology. Our system is tailored to medicine prescription data, but we argue that the underlying pattern in the data is ubiquitous, and that hence our approach can be useful for many other cases where A provides B to C.", "paper_title": "Visualization of Medicine Prescription Behavior", "paper_id": "WOS:000340597400017"}