{"auto_keywords": [{"score": 0.049273293170208544, "phrase": "network_coding"}, {"score": 0.00481495049065317, "phrase": "peer_networks"}, {"score": 0.004324031677173549, "phrase": "random_combination"}, {"score": 0.004275347843870176, "phrase": "encoded_pieces"}, {"score": 0.0031308163228919773, "phrase": "message_overhead"}, {"score": 0.0027325449069867222, "phrase": "network_coding_based_file_sharing_system"}, {"score": 0.0023848164282879885, "phrase": "proposed_network_coding_based_file_sharing_system"}, {"score": 0.002279011030331704, "phrase": "network_coding_scheme"}, {"score": 0.002253299769886694, "phrase": "non-network_coding_scheme"}, {"score": 0.0021049977753042253, "phrase": "limited_computation_resource"}], "paper_keywords": ["Peer-to-peer file sharing system", " Duplicated piece", " Unstructured overlay network", " Random combination"], "paper_abstract": "A network coding based peer-to-peer (P2P) file sharing system has been proposed in recent years. It uses the random combination of encoded pieces to make the file sharing more effective. Most of the conventional P2P file sharing systems adopt a random (or rarest piece first) transmission policy to avoid too many duplicated pieces and rare pieces occurring in the network. Network coding can simply solve this problem. However, some of the studies show that network coding brings the overhead of coding/decoding delay and message overhead; after all, the performance of network coding is not better than other schemes that are without network coding. Therefore, we propose a network coding based file sharing system over unstructured P2P networks considering the overhead from the network coding. We make comparisons with other schemes without network coding. Our simulation results show that the proposed network coding based file sharing system is better than others, when the network coding scheme and non-network coding scheme adopt the same network environment even though the network coding is executed under a limited computation resource.", "paper_title": "Improving Network Coding Based File Sharing for Unstructured Peer-to-Peer Networks", "paper_id": "WOS:000360549300001"}