{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "joint_identification"}, {"score": 0.004571133708117502, "phrase": "marine_structures"}, {"score": 0.004339609346924681, "phrase": "infinite-frequency_added_mass_and_fluid_memory_models"}, {"score": 0.003870541730075597, "phrase": "hydrodynamic_coefficients"}, {"score": 0.0038106195546165574, "phrase": "marine_structure"}, {"score": 0.00331125524068286, "phrase": "infinite_frequency"}, {"score": 0.003143341238802547, "phrase": "simpler_alternative_approach"}, {"score": 0.0029376803941247084, "phrase": "proposed_method"}, {"score": 0.0027741761880779535, "phrase": "fluid-memory_models"}, {"score": 0.0026609940110902666, "phrase": "infinite-frequency_added_mass_coefficient"}, {"score": 0.00234834406550549, "phrase": "relative_degree_and_low-frequency_asymptotic_values"}, {"score": 0.0021493248730171132, "phrase": "prior_information"}, {"score": 0.0021049977753042253, "phrase": "obtained_models"}], "paper_keywords": ["Identification", " Frequency-domain", " Marine Structure Models"], "paper_abstract": "This paper addresses the problem of joint identification of infinite-frequency added mass and fluid memory models of marine structures from finite frequency data. This problem is relevant for cases where the code used to compute the hydrodynamic coefficients of the marine structure does not give the infinite-frequency added mass. This case is typical of codes based on 2D-potential theory since most 3D-potential-theory codes solve the boundary value associated with the infinite frequency. The method proposed in this paper presents a simpler alternative approach to other methods previously presented in the literature. The advantage of the proposed method is that the same identification procedure can be used to identify the fluid-memory models with or without having access to the infinite-frequency added mass coefficient. Therefore, it provides an extension that puts the two identification problems into the same framework. The method also exploits the constraints related to relative degree and low-frequency asymptotic values of the hydrodynamic coefficients derived from the physics of the problem, which are used as prior information to refine the obtained models.", "paper_title": "Joint Identification of Infinite-Frequency Added Mass and Fluid Memory Models of Marine Structures", "paper_id": "WOS:000269784600002"}