{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "essential_proteins"}, {"score": 0.02084976330687177, "phrase": "lac"}, {"score": 0.008619924064770678, "phrase": "network_level"}, {"score": 0.007379947403694762, "phrase": "highly_connected_proteins"}, {"score": 0.0045933810497156705, "phrase": "minimal_requirements"}, {"score": 0.00456020621016909, "phrase": "cellular_survival"}, {"score": 0.004494570360108983, "phrase": "fast_growth"}, {"score": 0.004413846562278824, "phrase": "available_protein-protein_interactions"}, {"score": 0.004303252595782034, "phrase": "protein_essentiality"}, {"score": 0.0035766032751309677, "phrase": "new_local_method"}, {"score": 0.0034742854447532678, "phrase": "protein's_essentiality"}, {"score": 0.0032310733124059567, "phrase": "yeast_protein_interaction_networks"}, {"score": 0.0031272381208680613, "phrase": "experimental_results"}, {"score": 0.0029294420752976947, "phrase": "degree_centrality"}, {"score": 0.0027741761880779535, "phrase": "protein_centrality"}, {"score": 0.002579847272930948, "phrase": "bottle_neck"}, {"score": 0.0025334249463305875, "phrase": "information_centrality"}, {"score": 0.0024608997178502644, "phrase": "ec"}, {"score": 0.0024253827365474734, "phrase": "subgraph_centrality"}, {"score": 0.002230984431056064, "phrase": "positive_predictive_value"}, {"score": 0.002151388538895855, "phrase": "seven_previous_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Essential protein", " Protein-protein interaction network", " Topology", " Centrality measure", " Local average connectivity"], "paper_abstract": "Identifying essential proteins is very important for understanding the minimal requirements of cellular survival and development. Fast growth in the amount of available protein-protein interactions has produced unprecedented opportunities for detecting protein essentiality from the network level. Essential proteins have been found to be more abundant among those highly connected proteins. However, there exist a number of highly connected proteins which are not essential. By analyzing these proteins, we find that few of their neighbors interact with each other. Thus, we propose a new local method, named LAC, to determine a protein's essentiality by evaluating the relationship between a protein and its neighbors. The performance of LAC is validated based on the yeast protein interaction networks obtained from two different databases: DIP and BioGRID. The experimental results of the two networks show that the number of essential proteins predicted by LAC clearly exceeds that explored by Degree Centrality (DC). More over, LAC is also compared with other seven measures of protein centrality (Neighborhood Component (DMNC), Betweenness Centrality (BC), Closeness Centrality (CC), Bottle Neck (BN), Information Centrality (IC), Eigenvector Centrality (EC), and Subgraph Centrality (SC)) in identifying essential proteins. The comparison results based on the validations of sensitivity, specificity, F-measure, positive predictive value, negative predictive value, and accuracy consistently show that LAC outweighs these seven previous methods. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A local average connectivity-based method for identifying essential proteins from the network level", "paper_id": "WOS:000293157900005"}