{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "defensive_weaponry"}, {"score": 0.00466102244911872, "phrase": "wide_range"}, {"score": 0.004617949594931096, "phrase": "behavioral_and_morphological_adaptations"}, {"score": 0.004208427318712072, "phrase": "antipredator_defense"}, {"score": 0.004017437417375057, "phrase": "natural_selection"}, {"score": 0.003610292749660581, "phrase": "defensive_uses"}, {"score": 0.003543804852018315, "phrase": "comprehensive_review"}, {"score": 0.0035110198699787013, "phrase": "extreme_morphological_weaponry"}, {"score": 0.003414467360488913, "phrase": "specific_hypotheses"}, {"score": 0.003244275497488318, "phrase": "different_types"}, {"score": 0.003068242064611088, "phrase": "elaborate_weapons"}, {"score": 0.002607362103727335, "phrase": "potential_predation_risk"}, {"score": 0.002500456462028735, "phrase": "intrasexual_competition"}, {"score": 0.0023537101705489957, "phrase": "additional_defensive_benefits"}, {"score": 0.002267708463966758, "phrase": "larger_species"}, {"score": 0.0021848422732893926, "phrase": "physical_combat"}, {"score": 0.0021049977753042253, "phrase": "proposed_hypotheses"}], "paper_keywords": ["Armor", " spines", " anal glands", " horns", " tusks", " venom"], "paper_abstract": "Mammals possess a wide range of behavioral and morphological adaptations to help detect, assess, deter, and escape from predators, including weaponry that is useful in antipredator defense. While some weapons have evolved in response to natural selection for defense against predators, others may have evolved to serve some other primary function (e.g., intraspecific aggression) but still have defensive uses. In this comprehensive review of extreme morphological weaponry in mammals, I explore specific hypotheses regarding the ecological, morphological, and behavioral correlates of different types of weaponry in order to explain why some taxa have evolved elaborate weapons while others have not. I provide evidence demonstrating that several types of defensive weaponry (e.g., spines, quills, armor, noxious anal secretions) have evolved directly in response to significantly increased potential predation risk. Further, other structures that evolved primarily for intrasexual competition (e.g., cranial weaponry, tusks) or foraging (e.g., enlarged claws) but have additional defensive benefits are more likely to be found in larger species that are able to defend themselves in physical combat. Further comprehensive phylogenetic and comparative studies are needed to confirm the proposed hypotheses regarding selection, ecology, and function.", "paper_title": "Armed and dangerous: predicting the presence and function of defensive weaponry in mammals", "paper_id": "WOS:000299891900004"}