{"auto_keywords": [{"score": 0.04924054324953067, "phrase": "performance_data"}, {"score": 0.007436355927998298, "phrase": "desk_sales_unit"}, {"score": 0.007306431710806546, "phrase": "dramaturgical_model"}, {"score": 0.00481495049065317, "phrase": "performance_data."}, {"score": 0.004566308708871429, "phrase": "functional_process"}, {"score": 0.00436890075128947, "phrase": "accurate_information"}, {"score": 0.004330450801016359, "phrase": "employees'_work"}, {"score": 0.0036932254391253134, "phrase": "management_information_systems"}, {"score": 0.0035965032173588753, "phrase": "protective_specification"}, {"score": 0.0032342101452939977, "phrase": "ethnographic_data"}, {"score": 0.003135564707433078, "phrase": "performance_records"}, {"score": 0.0031079352545607267, "phrase": "performance_reports"}, {"score": 0.002986575805559931, "phrase": "exploitive_specification"}, {"score": 0.0026501241093379786, "phrase": "impression_management"}, {"score": 0.0024579623598183355, "phrase": "idealized_version"}, {"score": 0.0021906130276146325, "phrase": "information_systems"}, {"score": 0.0021712920081029194, "phrase": "store_windows"}, {"score": 0.0021049977753042253, "phrase": "transparent_windows"}], "paper_keywords": ["Management information systems", " production of performance data", " performance monitoring", " implementation of information technology", " ethnography"], "paper_abstract": "The production of performance data in organizations is often described as a functional process that managers enforce on their employees to provide leaders with accurate information about employees' work and their achievements. This study draws on a 15-month ethnography of a desk sales unit to build a dramaturgical model that explains how managers participate in the production of performance data to impress rather than inform leaders. Research on management information systems is reviewed to outline a protective specification of this model where managers participate in the production of performance data to suppress information that threatens the image they present to leaders. Ethnographic data about the production and use of performance records and performance reports in a desk sales unit is examined to induce an exploitive specification of this dramaturgical model. This specification explains how people can take advantage of the opportunities, rather than just avoid the threats that performance data presents for impression management. It also demonstrates how managers can participate in the production of performance data to create an idealized version of their accomplishments and that leaders reify these data by using them in their own attempts at impressing others. By doing so, leaders and managers turn information systems into store windows to show achievement upward instead of transparent windows to monitor compliance downward.", "paper_title": "A DRAMATURGICAL MODEL OF THE PRODUCTION OF PERFORMANCE DATA", "paper_id": "WOS:000329756000004"}