{"auto_keywords": [{"score": 0.047138221913192536, "phrase": "lfc"}, {"score": 0.004782977628406988, "phrase": "big_bang-big_crunch"}, {"score": 0.004672727518631859, "phrase": "optimization_based_design_methodology"}, {"score": 0.00443013401197632, "phrase": "numerous_fuzzy_logic_control_structures"}, {"score": 0.004144452614362445, "phrase": "crisp_grade"}, {"score": 0.004089556946377719, "phrase": "power_systems"}, {"score": 0.00406238127438793, "phrase": "large_scale_complex_systems"}, {"score": 0.003543273649210823, "phrase": "load_frequency_controller"}, {"score": 0.0035146621811052727, "phrase": "bb-bc"}, {"score": 0.003449972561293443, "phrase": "large_power_system"}, {"score": 0.0032925489316383955, "phrase": "scaling_factors"}, {"score": 0.003195149953590668, "phrase": "membership_functions"}, {"score": 0.00306973798582805, "phrase": "frequency_deviations"}, {"score": 0.0030189426536422577, "phrase": "load_disturbances"}, {"score": 0.0029689853349030007, "phrase": "global_optimization_algorithm"}, {"score": 0.0029296136066184857, "phrase": "low_computational_cost"}, {"score": 0.002900426826591769, "phrase": "high_convergence_speed"}, {"score": 0.002795867549039675, "phrase": "optimization_parameters"}, {"score": 0.002537880772794665, "phrase": "conventional_pid_controllers"}, {"score": 0.0024958641143547856, "phrase": "four-area_interconnected_power_system"}, {"score": 0.0024545413637350765, "phrase": "conventional_pid"}, {"score": 0.002381872778203302, "phrase": "bb-bc_algorithm"}, {"score": 0.0021476098263617954, "phrase": "different_load_disturbances"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Interval type-2 fuzzy PID controllers", " Load frequency control", " Big Bang-Big Crunch optimization"], "paper_abstract": "This paper proposes an optimization based design methodology of interval type-2 fuzzy PID (IT2FPID) controllers for the load frequency control (LFC) problem. Hitherto, numerous fuzzy logic control structures are proposed as a solution of LFC. However, almost all of these solutions use type-1 fuzzy sets that have a crisp grade of membership. Power systems are large scale complex systems with many different uncertainties. In order to handle these uncertainties, in this study, type-2 fuzzy sets, which have a grade of membership that is fuzzy, have been used. Interval type-2 fuzzy sets are used in the design of a load frequency controller for a four area interconnected power system, which represents a large power system. The Big Bang-Big Crunch (BB-BC) algorithm is applied to tune the scaling factors and the footprint of uncertainty (FOU) membership functions of interval type-2 fuzzy PID (IT2FPID) controllers to minimize frequency deviations of the system against load disturbances. BB-BC is a global optimization algorithm and has a low computational cost, a high convergence speed, and is therefore very efficient when the number of optimization parameters is high as presented in this study. In order to show the benefits of IT2FPID controllers, a comparison to conventional type-1 fuzzy PID (T1FPID) controllers and conventional PID controllers is given for the four-area interconnected power system. The gains of conventional PID and T1FPID controllers are also optimized using the BB-BC algorithm. Simulation results explicitly show that the performance of the proposed optimum IT2FPID load frequency controller is superior compared to the conventional T1FPID and PID controller in terms of overshoot, settling time and robustness against different load disturbances. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Interval type-2 fuzzy PID load frequency controller using Big Bang-Big Crunch optimization", "paper_id": "WOS:000329457400009"}