{"auto_keywords": [{"score": 0.049378038061471535, "phrase": "cmos"}, {"score": 0.01282851004459659, "phrase": "psnr"}, {"score": 0.00481495049065317, "phrase": "high-density_electrode_arrays_through_automated_electrode_selection."}, {"score": 0.004516733575701128, "phrase": "single_shaft"}, {"score": 0.00447251540886613, "phrase": "inter-electrode_distances"}, {"score": 0.003993958025223994, "phrase": "electronic_depth_control_algorithm"}, {"score": 0.0031845067058084613, "phrase": "previously_selected_electrodes"}, {"score": 0.002986969236641105, "phrase": "smaller_spikes"}, {"score": 0.0027741761880779535, "phrase": "electronic_depth_control"}, {"score": 0.002706659627293686, "phrase": "benchmark_data"}, {"score": 0.0026148807877309417, "phrase": "detection_algorithms"}, {"score": 0.002538687900036229, "phrase": "realistic_tufted_pyramidal_cell"}, {"score": 0.0025137856138000014, "phrase": "non-tufted_pyramidal_cells"}, {"score": 0.0021789194955896124, "phrase": "synaptic_potentials"}, {"score": 0.002157538586313944, "phrase": "varying_spike_rates"}, {"score": 0.0021049977753042253, "phrase": "amplitude_attenuation"}], "paper_keywords": ["Neural network connectivity", " neural network model", " spike detection", " spike sorting", " spike train similarity"], "paper_abstract": "Recently developed CMOS-based microprobes contain hundreds of electrodes on a single shaft with inter-electrode distances as small as 30 mu m. So far, neuroscientists needed to select electrodes manually from hundreds of electrodes. Here we present an electronic depth control algorithm that allows to select electrodes automatically, hereby allowing to reduce the amount of data and locating those electrodes that are close to neurons. The electrodes are selected according to a new penalized signal-to-noise ratio (PSNR) criterion that demotes electrodes from becoming selected if their signals are redundant with previously selected electrodes. It is shown that, using the PSNR, interneurons generating smaller spikes are also selected. We developed a model that aims to evaluate algorithms for electronic depth control, but also generates benchmark data for testing spike sorting and spike detection algorithms. The model comprises a realistic tufted pyramidal cell, non-tufted pyramidal cells and inhibitory interneurons. All neurons are synaptically activated by hundreds of fibers. This arrangement allows the algorithms to be tested in more realistic conditions, including backgrounds of synaptic potentials, varying spike rates with bursting and spike amplitude attenuation.", "paper_title": "ENHANCING THE YIELD OF HIGH-DENSITY ELECTRODE ARRAYS THROUGH AUTOMATED ELECTRODE SELECTION", "paper_id": "WOS:000299289900001"}