{"auto_keywords": [{"score": 0.032365467161540935, "phrase": "interval-valued_intuitionistic_fuzzy_values"}, {"score": 0.0048149948282354355, "phrase": "choquet"}, {"score": 0.004590820632326585, "phrase": "generalized_lambda-shapley_index"}, {"score": 0.004273951631010383, "phrase": "arithmetical_interval-valued_intuitionistic_fuzzy_generalized_lambda-shapley_choquet"}, {"score": 0.003109390330476147, "phrase": "operational_laws"}, {"score": 0.0027159094186967247, "phrase": "desirable_properties"}, {"score": 0.0024488738006005133, "phrase": "interval-valued_intuitionistic_fuzzy_environment"}, {"score": 0.002316105585203396, "phrase": "numerical_example"}, {"score": 0.002208035721125305, "phrase": "developed_procedures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-criteria decision making", " Interval-valued intuitionistic fuzzy set", " Choquet integral", " Generalized Shapley index", " lambda-fuzzy measure"], "paper_abstract": "In this paper, two new aggregation operators called the arithmetical interval-valued intuitionistic fuzzy generalized lambda-Shapley Choquet (AIVIFGSC(g lambda)) operator and the geometric interval-valued intuitionistic fuzzy generalized A-Shapley Choquet (GIVIFGSC(g lambda)) operator are proposed. These operators not only globally consider the importance of combinations or their ordered positions, but also overall reflect the correlations among combinations or their ordered positions. Based on the operational laws on interval-valued intuitionistic fuzzy values, the specific expressions of the AIVIFGSC(g lambda) and GIVIFGSC(g lambda) operators are given, which are also interval-valued intuitionistic fuzzy values. Meantime, some desirable properties are studied. Furthermore, two new approaches to multi-criteria group decision making under interval-valued intuitionistic fuzzy environment are proposed. Finally, a numerical example is provided to illustrate the developed procedures. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Approaches to multiple-criteria group decision making based on interval-valued intuitionistic fuzzy Choquet integral with respect to the generalized lambda-Shapley index", "paper_id": "WOS:000313761800022"}