{"auto_keywords": [{"score": 0.03777992235222839, "phrase": "network_datasets"}, {"score": 0.00481495049065317, "phrase": "spatio-temporal_compressive_sensing"}, {"score": 0.004596192494271827, "phrase": "measurement_technology"}, {"score": 0.004450568197899267, "phrase": "large-scale_network_datasets"}, {"score": 0.004294145092032327, "phrase": "measurement_systems"}, {"score": 0.004202931484732134, "phrase": "measurement_problem"}, {"score": 0.004084307764140389, "phrase": "indirect_data"}, {"score": 0.003940706575253453, "phrase": "spatio-temporal_structure"}, {"score": 0.0036815763368083197, "phrase": "problematic_nature"}, {"score": 0.0034890505116128606, "phrase": "compressive_sensing"}, {"score": 0.003464150192089816, "phrase": "matrix_completion"}, {"score": 0.0032829570709414736, "phrase": "standard_results"}, {"score": 0.002455889980202819, "phrase": "traffic_data"}, {"score": 0.0023950275815082297, "phrase": "simple_interpolation"}, {"score": 0.002377916348320401, "phrase": "missing_values"}, {"score": 0.0023609270767241215, "phrase": "traffic_matrix_inference"}, {"score": 0.0023440589015485077, "phrase": "link_data"}, {"score": 0.0023024126375034066, "phrase": "anomaly_detection"}], "paper_keywords": ["Compressed sensing", " interpolation", " prediction methods", " tomography"], "paper_abstract": "Despite advances in measurement technology, it is still challenging to reliably compile large-scale network datasets. For example, because of flaws in the measurement systems or difficulties posed by the measurement problem itself, missing, ambiguous, or indirect data are common. In the case where such data have spatio-temporal structure, it is natural to try to leverage this structure to deal with the challenges posed by the problematic nature of the data. Our work involving network datasets draws on ideas from the area of compressive sensing and matrix completion, where sparsity is exploited in estimating quantities of interest. However, the standard results on compressive sensing are: 1) reliant on conditions that generally do not hold for network datasets; and 2) do not allow us to exploit all we know about their spatio-temporal structure. In this paper, we overcome these limitations with an algorithm that has at its heart the same ideas espoused in compressive sensing, but adapted to the problem of network datasets. We show how this algorithm can be used in a variety of ways, in particular on traffic data, to solve problems such as simple interpolation of missing values, traffic matrix inference from link data, prediction, and anomaly detection. The elegance of the approach lies in the fact that it unifies all of these tasks and allows themto be performed even when as much as 98% of the data is missing.", "paper_title": "Spatio-Temporal Compressive Sensing and Internet Traffic Matrices (Extended Version)", "paper_id": "WOS:000305583700003"}