{"auto_keywords": [{"score": 0.04796412935568654, "phrase": "quantitative_analysis"}, {"score": 0.00481495049065317, "phrase": "pls_calibration"}, {"score": 0.004771672073078768, "phrase": "different_overtone"}, {"score": 0.004728780808284175, "phrase": "combination_bands"}, {"score": 0.004665162327051461, "phrase": "near-infrared_region"}, {"score": 0.00418595288276353, "phrase": "simple_hydrocarbon_matrix"}, {"score": 0.004110993414942228, "phrase": "nir_region"}, {"score": 0.0038242899532391914, "phrase": "multivariate_analysis"}, {"score": 0.003638823482920949, "phrase": "molar_absorptivity"}, {"score": 0.0030783143919343972, "phrase": "molecular_structure"}, {"score": 0.002955533639862811, "phrase": "partial_least_squares"}, {"score": 0.0025456716198597627, "phrase": "signal-to-noise_ratio"}, {"score": 0.00237861522566195, "phrase": "appropriate_nir_band"}, {"score": 0.002232579371411544, "phrase": "minor_spectral_variation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["PLS", " partial least squares", " overtone band", " combination band", " near-infrared"], "paper_abstract": "In quantitative analysis, the importance of selecting bands out of several overtone and combination bands in a near-infrared (NIR) region has been studied with the aid of a simple hydrocarbon matrix. In an NIR region (10,000 to 4000 cm(-1)), there are four major hydrocarbon absorption bands that can be used for multivariate analysis. The four bands cannot be used simultaneously because the molar absorptivity of each band differs greatly. Two different analytes (n-hexane and toluene) and n-heptane were selected as a solvent to study variations in the performance of calibrations based on the difference in molecular structure. Models of calibration that rely on the partial least squares for both n-hexane and toluene were developed in which the four spectral bands were used separately. In addition, the performance of the calibration varied for both analytes, under degradation of the signal-to-noise ratio that naturally occurs when a spectrometer is used over a period. Selecting the appropriate NIR band for quantitative analysis is important, particularly when there is a need to resolve minor spectral variation such as that of n-hexane in n-heptane. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Varied performance of PLS calibration using different overtone and combination bands in a near-infrared region", "paper_id": "WOS:000237588100016"}