{"auto_keywords": [{"score": 0.049666636555871356, "phrase": "e-learning_games"}, {"score": 0.00481495049065317, "phrase": "learners'_enjoyment"}, {"score": 0.00469159356595623, "phrase": "effective_e-learning_game"}, {"score": 0.004631099806015235, "phrase": "learner's_enjoyment"}, {"score": 0.004138309011478741, "phrase": "game_designer"}, {"score": 0.003911862375084159, "phrase": "learner's_points"}, {"score": 0.003618558599449415, "phrase": "flow_effect"}, {"score": 0.0033762956164519286, "phrase": "user_enjoyment"}, {"score": 0.0032471982781283374, "phrase": "present_study"}, {"score": 0.003205268682789165, "phrase": "eight_dimensions"}, {"score": 0.0028390477456009568, "phrase": "university's_online_learning_course"}, {"score": 0.002790254164160135, "phrase": "software_application"}, {"score": 0.0026951616152303373, "phrase": "scale_verification"}, {"score": 0.0026718978608934077, "phrase": "survey_questionnaires"}, {"score": 0.0022758994740331258, "phrase": "effective_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Media in education", " Interactive learning environments", " Teaching/learning strategy", " Application in applications in subject areas", " Distance education and telelearning"], "paper_abstract": "In an effective e-learning game, the learner's enjoyment acts as a catalyst to encourage his/her learning initiative. Therefore, the availability of a scale that effectively measures the enjoyment offered by e-learning games assist the game designer to understanding the strength and flaw of the game efficiently from the learner's points of view. E-learning games are aimed at the achievement of learning objectives via the creation of a flow effect. Thus, this study is based on Sweetser's & Wyeth's framework to develop a more rigorous scale that assesses user enjoyment of e-learning games. The scale developed in the present study consists of eight dimensions: Immersion, social interaction, challenge, goal clarity, feedback, concentration, control, and knowledge improvement. Four learning games employed in a university's online learning course \"Introduction to Software Application\" were used as the instruments of scale verification. Survey questionnaires were distributed to students taking the course and 166 valid samples were subsequently collected. The results showed that the validity and reliability of the scale, EGameFlow, were satisfactory. Thus, the measurement is an effective tool for evaluating the level of enjoyment provided by e-learning games to their users. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "EGameFlow: A scale to measure learners' enjoyment of e-learning games", "paper_id": "WOS:000263701900011"}