{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "antbot"}, {"score": 0.007440166412648644, "phrase": "individual_bots"}, {"score": 0.006063213203442229, "phrase": "pollution-based_mitigation"}, {"score": 0.0045641317216991205, "phrase": "first_generation"}, {"score": 0.004510184935928004, "phrase": "irc_chat_channels"}, {"score": 0.004430452655732319, "phrase": "current_generation"}, {"score": 0.004249825947483216, "phrase": "encouraging_note"}, {"score": 0.004162281538812753, "phrase": "holz_et_al"}, {"score": 0.004004436217742343, "phrase": "single_point"}, {"score": 0.003957078581524691, "phrase": "irc_botnets"}, {"score": 0.0038640303886081444, "phrase": "pollution-based_mitigation_schemes"}, {"score": 0.0038297020126219082, "phrase": "white-hat_cyber-security_practitioners"}, {"score": 0.0036516837986048795, "phrase": "strategy_space"}, {"score": 0.003619235073669304, "phrase": "attacker's_perspective"}, {"score": 0.0035236026196355783, "phrase": "new_type"}, {"score": 0.0032709661258673232, "phrase": "seized_bots"}, {"score": 0.0032035208958667064, "phrase": "tree-like_structure"}, {"score": 0.002719644855867468, "phrase": "practical_setting"}, {"score": 0.002616364603666959, "phrase": "amule"}, {"score": 0.0025853809955539244, "phrase": "kademlia"}, {"score": 0.002472412920623605, "phrase": "attacker's_strategy"}, {"score": 0.002450417380442116, "phrase": "cyber_space"}, {"score": 0.002428617044669043, "phrase": "ethical_or_legal_issues"}, {"score": 0.002385595105638277, "phrase": "real-world_deployment"}, {"score": 0.00236437009958525, "phrase": "extensive_simulation"}, {"score": 0.002227605160238371, "phrase": "antbot_operations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Botnet", " aMule", " Peer-to-peer", " Pollution attack", " Storm botnet"], "paper_abstract": "Botnets have emerged as one of the most severe cyber-threats in recent years. To evade detection and improve resistance against countermeasures, botnets have evolved from the first generation that relies on IRC chat channels to deliver commands to the current generation that uses highly resilient P2P (peer-to-peer) protocols to spread their C&C (Command and Control) information. On an encouraging note, the seminal work done by Holz et al. [14] showed that P2P botnets, although relieved from the single point of failure that IRC botnets suffer, can be easily disrupted using pollution-based mitigation schemes. For white-hat cyber-security practitioners to be better prepared for potentially destructive P2P botnets, it is necessary for them to understand the strategy space from the attacker's perspective. Against this backdrop, we analyze a new type of P2P botnets, which we call AntBot, that aims to spread their C&C information to individual bots even though an adversary persistently pollutes keys used by seized bots to search the C&C information. The tree-like structure of AntBot, together with the randomness and redundancy in its design, renders it possible that individual bots, when captured, reveal only limited information. We mathematically analyze the performance of AntBot from the perspectives of reachability, resilience to pollution, and scalability. To evaluate the effectiveness of AntBot against pollution-based mitigation in a practical setting, we develop a distributed high-fidelity P2P botnet simulator that uses the actual implementation code of aMule, a popular Kademlia-based P2P client. The simulator offers us a tool to evaluate the attacker's strategy in the cyber space without causing ethical or legal issues, which may result from real-world deployment. Using extensive simulation, we demonstrate that AntBot operates resiliently against pollution-based mitigation. We further suggest a few potential defense schemes that could effectively disrupt AntBot operations and also present challenges that researchers need to address when developing these techniques in practice. Published by Elsevier B.V.", "paper_title": "AntBot: Anti-pollution peer-to-peer botnets", "paper_id": "WOS:000291175500023"}