{"auto_keywords": [{"score": 0.04238272461307023, "phrase": "trafil"}, {"score": 0.007012008540954595, "phrase": "trace_file_recognition"}, {"score": 0.006196136013840064, "phrase": "trace_file"}, {"score": 0.00481495049065317, "phrase": "network_simulation_and_processing_tracing_data_files"}, {"score": 0.004592905436175987, "phrase": "simulation_scenarios"}, {"score": 0.004525629293824217, "phrase": "trace_files"}, {"score": 0.004304144138805271, "phrase": "design_considerations"}, {"score": 0.0042410797042450816, "phrase": "new_tool"}, {"score": 0.004154332348800334, "phrase": "trace_file_analysis"}, {"score": 0.00384731849108269, "phrase": "different_other_simulation_trace_file_formats"}, {"score": 0.003735349093835257, "phrase": "great_number"}, {"score": 0.0037133478610481994, "phrase": "network_simulations"}, {"score": 0.0036052633308076933, "phrase": "large_amount"}, {"score": 0.003428665921276366, "phrase": "novel_way"}, {"score": 0.0032319109979344184, "phrase": "\"sub_metafiles"}, {"score": 0.0031193028729331667, "phrase": "overall_analysis_operation"}, {"score": 0.003064474252419265, "phrase": "alternative_approaches"}, {"score": 0.0030284566685355456, "phrase": "sub_metafiles"}, {"score": 0.002931569771634119, "phrase": "trace_file_processing_operation"}, {"score": 0.0028715299874549245, "phrase": "overall_trace_file_analysis_task"}, {"score": 0.002573965014439041, "phrase": "graphical_user_interface"}, {"score": 0.0024333239726872604, "phrase": "simulation_results"}, {"score": 0.0023554316787703137, "phrase": "custom_structured_query_language"}, {"score": 0.002307164141953476, "phrase": "local_database"}, {"score": 0.0022665781920241245, "phrase": "simulation_procedure"}, {"score": 0.0021617979542196933, "phrase": "video_transmission"}, {"score": 0.002142696637011647, "phrase": "evalvid-ra_framework"}, {"score": 0.0021050011192089513, "phrase": "elsevier"}], "paper_keywords": ["Simulation analysis tool", " Trace file", " NS-2"], "paper_abstract": "One of the most highly regarded discrete event simulators used for network simulation is NS-2 (Network Simulator). NS-2 executes simulation scenarios producing various data of which trace files are considered the most beneficial for evaluating a simulation. In this paper we present the design considerations and implementation of a new tool that can be used both in TRAce FILe analysis and execution of simulations using NS-2. Although TRAFIL is primarily based on NS-2 trace files it can be extended to support a number of different other simulation trace file formats. It aims to make the execution of a great number of network simulations quicker, and the extraction of results from a large amount of data more flexible and productive. In order to accomplish the above tasks TRAFIL presents a novel way of interpreting, parsing, reading and eventually using NS-2 trace files. It introduces the notion of \"metafiles\" and \"sub metafiles\" throughout the procedures of trace file recognition and parsing, making the overall analysis operation substantially efficient and faster than alternative approaches. Metafiles and sub metafiles are used to encode NS-2 trace file structures enabling a more abstract approach to the trace file processing operation. Furthermore, TRAFIL facilitates the overall trace file analysis task by offering the opportunity to store each trace file as well as every Quality of Service (QoS) measurement produced for each trace file. Following the trace file recognition and processing operations, the information contained in a trace file is presented through a Graphical User Interface (GUI) offered by TRAFIL along with a variety of data, metrics and statistics related to simulation results. Finally, the tool offers the opportunity to execute custom Structured Query Language (SQL) queries to the local database and to completely automate the simulation procedure by enabling the user to execute NS-2 scripts as well as perform a simulation of a video transmission using the Evalvid-RA framework. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "A tool for automating network simulation and processing tracing data files", "paper_id": "WOS:000310784700006"}