{"auto_keywords": [{"score": 0.03526300604455723, "phrase": "background_region"}, {"score": 0.03403808030466324, "phrase": "coded_degradation"}, {"score": 0.015223879821119867, "phrase": "video_clips"}, {"score": 0.004737579882204798, "phrase": "image_quality_assessment"}, {"score": 0.0035530197642369464, "phrase": "background_regions"}, {"score": 0.0033163269450817716, "phrase": "colored_or_gray_scale"}, {"score": 0.0032497506915502876, "phrase": "case_studies"}, {"score": 0.003171615440419782, "phrase": "binocular_stereoscopic_videos"}, {"score": 0.002707444334463544, "phrase": "gray_scale"}, {"score": 0.002568299907890696, "phrase": "gaze_point_environment"}, {"score": 0.002526938673434697, "phrase": "subjective_image_quality"}, {"score": 0.00241658945942583, "phrase": "subjective_evaluation"}, {"score": 0.002320449502337321, "phrase": "jpeg_coding"}, {"score": 0.0022101055924375725, "phrase": "eight_viewpoint_parallax_barrier_method"}, {"score": 0.0021049977753042253, "phrase": "evaluation_scores"}], "paper_keywords": ["multi-view 3D", " double stimulus impairment scale (DSIS)", " gray scale", " region of interest (ROI)", " support vector machine (SVM)"], "paper_abstract": "Many previous studies on image quality assessment of 3D still images or video clips have been conducted. In particular, it is important to know the region in which assessors are interested or on which they focus in images or video clips, as represented by the ROI (Region of Interest). For multi-view 3D images, it is obvious that there are a number of viewpoints; however, it is not clear whether assessors focus on objects or background regions. It is also not clear on what assessors focus depending on whether the background region is colored or gray scale. Furthermore, while case studies on coded degradation in 2D or binocular stereoscopic videos have been conducted, no such case studies on multi-view 3D videos exist, and therefore, no results are available for coded degradation according to the object or background region in multi-view 3D images. In addition, in the case where the background region is gray scale or not, it was not revealed that there were affection for gaze point environment of assessors and subjective image quality. In this study, we conducted experiments on the subjective evaluation of the assessor in the case of coded degradation by JPEG coding of the background or object or both in 3D CG images using an eight viewpoint parallax barrier method. Then, we analyzed the results statistically and classified the evaluation scores using an SVM.", "paper_title": "3D CG Image Quality Metrics by Regions with 8 Viewpoints Parallax Barrier Method", "paper_id": "WOS:000359467200017"}