{"auto_keywords": [{"score": 0.030660592326805094, "phrase": "extended_networks"}, {"score": 0.00481495049065317, "phrase": "wireless_networks_with_infrastructure"}, {"score": 0.004664352260912174, "phrase": "infrastructure_support"}, {"score": 0.0045328270272981825, "phrase": "randomly_located_wireless_nodes"}, {"score": 0.004461359547152617, "phrase": "multiantenna_base_stations"}, {"score": 0.004159997145421619, "phrase": "arbitrary_rates"}, {"score": 0.004055511503825102, "phrase": "capacity_scaling_laws"}, {"score": 0.003991539512905838, "phrase": "dense_and_extended_networks"}, {"score": 0.003709974534103202, "phrase": "multiple-access_uplink"}, {"score": 0.003639835714755229, "phrase": "infrastructure-supported_multihop"}, {"score": 0.0031946579471862978, "phrase": "linear_throughput_scaling"}, {"score": 0.0031542454984159634, "phrase": "dense_networks"}, {"score": 0.0030071857666598193, "phrase": "proposed_bs-based_routing_schemes"}, {"score": 0.0029691377785333872, "phrase": "realistic_network_conditions"}, {"score": 0.0028037753646260937, "phrase": "bs-based_protocols"}, {"score": 0.0027159094186967247, "phrase": "proposed_scheme"}, {"score": 0.0026815368507715, "phrase": "mh_scheme"}, {"score": 0.0025160740422447837, "phrase": "long-distance_signal-to-noise_ratio"}, {"score": 0.002360796860462937, "phrase": "better_throughput"}, {"score": 0.002286781334850213, "phrase": "corresponding_information-theoretic_cut-set_upper_bounds"}, {"score": 0.0021049977753042253, "phrase": "operating_regimes"}], "paper_keywords": ["Base station (BS)", " cut-set upper bound", " hierarchical cooperation (HC)", " infrastructure", " multiantenna", " multihop (MH)", " single-hop", " throughput scaling"], "paper_abstract": "This paper analyzes the impact and benefits of infrastructure support in improving the throughput scaling in networks of randomly located wireless nodes. The infrastructure uses multiantenna base stations (BSs), in which the number of BSs and the number of antennas at each BS can scale at arbitrary rates relative to. Under the model, capacity scaling laws are analyzed for both dense and extended networks. Two BS-based routing schemes are first introduced in this study: an infrastructure-supported single-hop (ISH) routing protocol with multiple-access uplink and broadcast downlink and an infrastructure-supported multihop (IMH) routing protocol. Then, their achievable throughput scalings are analyzed. These schemes are compared against two conventional schemes without BSs: the multihop (MH) transmission and hierarchical cooperation (HC) schemes. It is shown that a linear throughput scaling is achieved in dense networks, as in the case without help of BSs. In contrast, the proposed BS-based routing schemes can, under realistic network conditions, improve the throughput scaling significantly in extended networks. The gain comes from the following advantages of these BS-based protocols. First, more nodes can transmit simultaneously in the proposed scheme than in the MH scheme if the number of BSs and the number of antennas are large enough. Second, by improving the long-distance signal-to-noise ratio (SNR), the received signal power can be larger than that of the HC, enabling a better throughput scaling under extended networks. Furthermore, by deriving the corresponding information-theoretic cut-set upper bounds, it is shown under extended networks that a combination of four schemes IMH, ISH, MH, and HC is order-optimal in all operating regimes.", "paper_title": "Improved Capacity Scaling in Wireless Networks With Infrastructure", "paper_id": "WOS:000295738500015"}