{"auto_keywords": [{"score": 0.04338425681647204, "phrase": "digital_objects"}, {"score": 0.006308070270486638, "phrase": "digital_object"}, {"score": 0.00481495049065317, "phrase": "collaborative_virtual_objects"}, {"score": 0.004685575787741084, "phrase": "technological_advances"}, {"score": 0.004518442937844318, "phrase": "digital_format"}, {"score": 0.003907212558276185, "phrase": "object_type"}, {"score": 0.0037848978618663684, "phrase": "particular_application"}, {"score": 0.003424771860049617, "phrase": "physical_objects"}, {"score": 0.0031845067058084583, "phrase": "common_format"}, {"score": 0.002988101395789399, "phrase": "standardized_way"}, {"score": 0.00266693888510356, "phrase": "generic_way"}, {"score": 0.0025951294037626174, "phrase": "embedded_systems"}, {"score": 0.002391067964886602, "phrase": "single_structure"}, {"score": 0.002193013499219711, "phrase": "prototype_system"}, {"score": 0.0021632743048552536, "phrase": "real_appliances"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Virtual object", " Web services", " Mobile services", " Internet of things", " Device Dependent Temporary Services (DDTS)"], "paper_abstract": "With technological advances there are many physical objects that are designed in digital format, some examples are: books, agendas, tickets, etc. One of the characteristics of digital objects is that each type of object has its own format, in most cases each object type can only be interpreted by a particular application, so will have problems to be interpreted. Internet of things (IoT) promotes the integration and communication between physical objects, including digital objects on the IoT can automate and streamline many tasks. The absence of common format for digital objects also causes problems of interaction and communication. There is no standardized way to obtain the actions or services associated with the digital object, which makes it difficult for these digital objects to interact and integrate in a generic way with other applications, devices or embedded systems. Based on the problems identified in this document a proposal is detailed in search for a single structure and for the construction of any digital object. The validity of the approach has been verified through a prototype system working with real appliances. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Modeling architecture for collaborative virtual objects based on services", "paper_id": "WOS:000295353700018"}