{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "semiconductor_roadmap"}, {"score": 0.0047842129415024475, "phrase": "cmos_approaches"}, {"score": 0.004708220751321872, "phrase": "nanoscale_molecular_devices"}, {"score": 0.004589124394375718, "phrase": "silicon_nanowires"}, {"score": 0.0045598218623312675, "phrase": "carbon_nanotubes"}, {"score": 0.004458722048888919, "phrase": "itrs."}, {"score": 0.00433200902751133, "phrase": "nanometer_regime"}, {"score": 0.0041287394089001405, "phrase": "nanoscale_devices"}, {"score": 0.004050116768809519, "phrase": "high_defect_rates"}, {"score": 0.0033845816848753073, "phrase": "shipped_chips"}, {"score": 0.0032672702570491164, "phrase": "nanometer_range"}, {"score": 0.003215295260684715, "phrase": "transient_faults"}, {"score": 0.0031743093007496736, "phrase": "arbitrary_soft_errors"}, {"score": 0.0030642636185693054, "phrase": "nanoscale_architectures"}, {"score": 0.0028738341066290815, "phrase": "hybrid_nanowire-cmos_architecture"}, {"score": 0.0026268961477241026, "phrase": "multiple_levels"}, {"score": 0.0025603123094624265, "phrase": "key_aspect"}, {"score": 0.0024874156497091994, "phrase": "judicious_balance"}, {"score": 0.0024478159375394878, "phrase": "traditional_cmos_components"}, {"score": 0.0022882500116799777, "phrase": "partially_defective_nanoscale_elements"}, {"score": 0.002118558580538763, "phrase": "complete_design_flow"}], "paper_keywords": ["Defect tolerance", " nanotechnology", " nanowires"], "paper_abstract": "As the end of the semiconductor roadmap for CMOS approaches, architectures based on nanoscale molecular devices are attracting attention. Among several alternatives, silicon nanowires and carbon nanotubes are the two most promising nanotechnologies according to the ITRS. These technologies may enable scaling deep into the nanometer regime. However, they suffer from very defect-prone manufacturing processes. Although the reconfigurability property of the nanoscale devices can be used to tolerate high defect rates, it may not be possible to locate all defects. With very high device densities, testing each component may not be possible because of time or technology restrictions. This points to a scenario in which even though the devices are tested, the tests are not very comprehensive at locating defects, and hence the shipped chips are still defective. Moreover, the devices in the nanometer range will be susceptible to transient faults which can produce arbitrary soft errors. Despite these drawbacks, it is possible to make nanoscale architectures practical and realistic by introducing defect and fault tolerance. In this article, we propose and evaluate a hybrid nanowire-CMOS architecture that addresses all three problems-namely high defect rates, unlocated defects, and transient faults-at the same time. This goal is achieved by using multiple levels of redundancy and majority voters. A key aspect of the architecture is that it contains a judicious balance of both nanoscale and traditional CMOS components. A companion to the architecture is a compiler with heuristics to quickly determine if logic can be mapped onto partially defective nanoscale elements. The heuristics make it possible to introduce defect-awareness in placement and routing. The architecture and compiler are evaluated by applying the complete design flow to several benchmarks.", "paper_title": "A Hybrid Nano-CMOS Architecture for Defect and Fault Tolerance", "paper_id": "WOS:000269274900003"}