{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "sn"}, {"score": 0.00481495049065317, "phrase": "recent_world"}, {"score": 0.00398177607914381, "phrase": "author_documents"}, {"score": 0.003906804492585634, "phrase": "diverse_events"}, {"score": 0.003603549914861701, "phrase": "mutual_relationships"}, {"score": 0.0035525230119401153, "phrase": "complex_sn."}, {"score": 0.003485605409687907, "phrase": "finding_systems"}, {"score": 0.0034037221513153566, "phrase": "relevant_expert"}, {"score": 0.002909342017421165, "phrase": "social_paradigm"}, {"score": 0.0024513404432665153, "phrase": "acquaintance_chain"}, {"score": 0.0022287497627555895, "phrase": "general_idea"}, {"score": 0.0021557052355026048, "phrase": "recommender_system"}, {"score": 0.0021352776064254195, "phrase": "query_propagation"}], "paper_keywords": ["social network", " latent knowledge", " knowledge management", " expert finding", " recommender system"], "paper_abstract": "In recent world, we have been surrounded by various social networks (SNs). In every company, every institution and every place worldwide, people call each other, exchange emails, text messages, post in forums, co-author documents, meet at diverse events, etc. In other words, they communicate and collaborate with each other creating and maintaining mutual relationships in a complex SN. The traditional expert finding systems try to locate a relevant expert to whom the query should be sent. However, most of the experts are not willing to solve the problems for people they do not know. In our proposed novel system, a social paradigm is used to encourage experts to send their solutions. By means of recommendations, the system propagates the query not directly to the expert, but to friends and colleagues of the expert through the acquaintance chain existing in the SN. The experts are more likely to answer if the requests come from their acquaintances. The general idea, model and simulations on the recommender system for query propagation in the SN are presented in the paper.", "paper_title": "SocLaKE: Social Latent Knowledge Explorator", "paper_id": "WOS:000301295000002"}