{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "earthing_systems"}, {"score": 0.030227297783670254, "phrase": "lightning_strikes"}, {"score": 0.004769313572444002, "phrase": "moment_methods"}, {"score": 0.004746656803524478, "phrase": "purpose_-_the_purpose"}, {"score": 0.0047429813811963, "phrase": "earthing_structures"}, {"score": 0.004558349012187282, "phrase": "one-dimensional_moment_method"}, {"score": 0.004472325202570124, "phrase": "accurate_method"}, {"score": 0.004294853638699961, "phrase": "relevant_situations"}, {"score": 0.004244003342588079, "phrase": "railway_systems"}, {"score": 0.004203755099553109, "phrase": "also_critical_signalling_infrastructure"}, {"score": 0.00414409430952873, "phrase": "cellular_phone_basestations"}, {"score": 0.00407555499365559, "phrase": "high-antenna_towers"}, {"score": 0.004008144689408573, "phrase": "gas_and_oil_pipelines"}, {"score": 0.003970124306962642, "phrase": "already_methods"}, {"score": 0.0038951578620153283, "phrase": "circuit_theory"}, {"score": 0.0038582050961189756, "phrase": "electromagnetic_method"}, {"score": 0.0037853439502459297, "phrase": "maxwell's_equations"}, {"score": 0.0036786145247574547, "phrase": "wire_scatterers"}, {"score": 0.0035748835833100076, "phrase": "single_medium"}, {"score": 0.0034575424465963945, "phrase": "soil-air_interface_layer"}, {"score": 0.0033841438302493914, "phrase": "modified_image_theory"}, {"score": 0.003257470969784869, "phrase": "second_extension"}, {"score": 0.003203548375322396, "phrase": "metal_sheets"}, {"score": 0.0027963247954697025, "phrase": "simple_situations"}, {"score": 0.002685181176249374, "phrase": "transient_voltage"}, {"score": 0.0026470150945693974, "phrase": "circuit_methods"}, {"score": 0.00262813542985572, "phrase": "good_agreement"}, {"score": 0.0024759385358850373, "phrase": "air-ground_interface"}, {"score": 0.0024582760561790186, "phrase": "approximate_method"}, {"score": 0.0024291174605753987, "phrase": "modified_image_method"}, {"score": 0.0023269743403597663, "phrase": "calculation_process"}, {"score": 0.00223444387403197, "phrase": "simple_structure"}, {"score": 0.002218500301413455, "phrase": "cylindrical_core"}, {"score": 0.0021921795318565764, "phrase": "insulating_cladding"}], "paper_keywords": ["Method of moments", " Electromagnetism", " Lightning", " Electric current", " Image processing"], "paper_abstract": "Purpose - The purpose of this paper is to present a method to model earthing systems subjected to lightning strikes with a one-dimensional moment method. This paper was conducted because an accurate method to model earthing systems subjected to lightning strikes, was deemed necessary. To name a few examples of relevant situations: supply stations of railway systems, from which also critical signalling infrastructure is fed, earthing systems of cellular phone basestations, located in the vicinity of high-antenna towers, prone to lightning strikes, and gas and oil pipelines. There exist already methods to solve this problem, based on circuit theory, but the electromagnetic method of this work is based directly on Maxwell's equations and therefore more accurate. Design/methodology/approach - The earthing electrodes and meshes are represented as wire scatterers. First, the method is outlined for scatterers in a single medium. Next, the method is extended to model to presence of the soil-air interface layer. An approximate technique, known as the modified image theory, is used to account for the vicinity of the soil. Finally, a second extension is given so that cables without metal sheets which are in the vicinity of the earthing systems, can be included in the model. Thereafter, it is described how the method can be used to calculate the effects of lightning strikes on earthing structures, and finally a validation of the method is presented. Findings - The method is validated by applying it to simple situations which can also analytically be calculated, and by applying it to earthing structures for which the transient voltage was measured or calculated with circuit methods. A good agreement is seen. However, the method is computationally very expensive. Research limitations/implications - In order to account for the influence of the air-ground interface, an approximate method was used: the modified image method, and not the exact Sommerfeld theory. This was done because of its simplicity and in order to speed up the calculation process. Furthermore, cables can be included in the model, but they must be of simple structure: a cylindrical core, surrounded by an insulating cladding. Originality/value - A few authors have already described this method to simulate lightning strikes on earthing systems-However, in this paper, a new and easy model for underground cables in the vicinity of earthing systems is presented.", "paper_title": "Modelling earthing systems and cables with moment methods", "paper_id": "WOS:000269323700017"}