{"auto_keywords": [{"score": 0.04251153857508317, "phrase": "aop"}, {"score": 0.03212198267973989, "phrase": "exception_handling_code"}, {"score": 0.00481495049065317, "phrase": "exception_handling"}, {"score": 0.004296264970612285, "phrase": "aspect-oriented_programming"}, {"score": 0.0034690732089830045, "phrase": "well-understood_quality"}, {"score": 0.0032766780632972363, "phrase": "non-trivial_exception"}, {"score": 0.003154360892955196, "phrase": "quantitative_study"}, {"score": 0.002895535087931938, "phrase": "real_object-oriented_system"}, {"score": 0.0026077803487003, "phrase": "quality_attributes"}, {"score": 0.002570817338292482, "phrase": "original_and_refactored_systems"}, {"score": 0.002326304140277375, "phrase": "normal_application_code"}, {"score": 0.0022608057001451414, "phrase": "general_intuition"}, {"score": 0.0022287497627555895, "phrase": "aspect-oriented_version"}, {"score": 0.0021557052355026048, "phrase": "significant_gains"}], "paper_keywords": [""], "paper_abstract": "It is usually assumed that the implementation of exception handling can be better modularized by the use of aspect-oriented programming (AOP). However, the trade-offs involved in using AOP with this goal are not yet well-understood. To the best of our knowledge, no work in the literature has attempted to assess whether AOP really promotes an enhancement in well-understood quality attributes other than separation of concerns, when used for modularizing non-trivial exception handling code. This paper presents a quantitative study of the adequacy of aspects for modularizing exception handling code. The study consisted in refactoring part of a real object-oriented system so that the code responsible for handling exceptions was moved to aspects. We employed a suite of metrics to measure quality attributes of the original and refactored systems, including coupling, cohesion, and conciseness. We found that AOP improved separation of concerns between exception handling code and normal application code. However, contradicting the general intuition, the aspect-oriented version of the system did not present significant gains for any of the four size metrics we employed.", "paper_title": "Aspectizing exception handling: A quantitative study", "paper_id": "WOS:000241860400014"}