{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "burgers'_equation"}, {"score": 0.004747620102130588, "phrase": "hopf-cole_transformation"}, {"score": 0.004362870617347183, "phrase": "hopfcole_transformation"}, {"score": 0.004201991568145053, "phrase": "linear_diffusion_equation"}, {"score": 0.004143196873246147, "phrase": "diffusion_equation"}, {"score": 0.004047020753789236, "phrase": "sv_setting"}, {"score": 0.003990385737207714, "phrase": "local_discontinuous_galerkin"}, {"score": 0.003789395499639015, "phrase": "inverse_transformation"}, {"score": 0.003684048704119722, "phrase": "numerical_solution"}, {"score": 0.0030525578912808647, "phrase": "transformed_equation"}, {"score": 0.0029816229984366374, "phrase": "numerical_studies"}, {"score": 0.0025290375256888883, "phrase": "ldg_scheme"}, {"score": 0.0024586427394152196, "phrase": "numerical_results"}, {"score": 0.002301896758256575, "phrase": "high_order_numerical_solutions"}, {"score": 0.0021755038991725147, "phrase": "discontinuous_solutions"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["Burgers' equation", " spectral volume", " high-order", " LDG2", " LDG", " Hopf-Cole transformation"], "paper_abstract": "A limiter free high order spectral volume (SV) formulation is proposed in this paper to solve the Burgers' equation. This approach uses the HopfCole transformation, which maps the Burgers' equation to a linear diffusion equation. This diffusion equation is solved in an SV setting. The local discontinuous Galerkin (LDG) and the LDG2 viscous flux discretization methods were employed. An inverse transformation was used to obtain the numerical solution to the Burgers' equation. This procedure has two advantages: (i) the shock can be captured, without the use of a limiter; and (ii) the effects of SV partitioning becomes almost redundant as the transformed equation is not hyperbolic. Numerical studies were performed to verify. These studies also demonstrated (i) high order accuracy of the scheme even for very low viscosity; (ii) superiority of the LDG2 scheme, when compared with the LDG scheme. In general, the numerical results are very promising and indicate that this procedure can be applied for obtaining high order numerical solutions to other nonlinear partial differential equations (for instance, the Kortewegde Vries equations) which generate discontinuous solutions. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "A high order spectral volume solution to the Burgers' equation using the Hopf-Cole transformation", "paper_id": "WOS:000302995900002"}