{"auto_keywords": [{"score": 0.045794858725519534, "phrase": "idle_time"}, {"score": 0.007152368807539886, "phrase": "ethernet_passive_optical_networks"}, {"score": 0.0049086144067988545, "phrase": "lower-class_transmission"}, {"score": 0.004728624975677976, "phrase": "upstream_bandwidth"}, {"score": 0.004505881071218599, "phrase": "report_messages"}, {"score": 0.004345706062641742, "phrase": "dba_computation_time"}, {"score": 0.004165987300206134, "phrase": "data_transmissions"}, {"score": 0.00407892357468408, "phrase": "onu"}, {"score": 0.003933865582543784, "phrase": "stringent_quality"}, {"score": 0.0037825134619339537, "phrase": "packet_delay"}, {"score": 0.0037258582339644514, "phrase": "sensitive_applications"}, {"score": 0.003692271726952282, "phrase": "qos_support"}, {"score": 0.0035288105310344463, "phrase": "higher-class_and_lower-class_traffic"}, {"score": 0.003423862933454743, "phrase": "separable_scheduling_scenario"}, {"score": 0.0033929894721242367, "phrase": "class-based_concept"}, {"score": 0.0032465575124333104, "phrase": "proposed_eoca_algorithm"}, {"score": 0.0031653299069848463, "phrase": "elastic_onu-class-based_idle_time_elimination_algorithm"}, {"score": 0.0028650312174624635, "phrase": "insufficient_lower-class_transmissions"}, {"score": 0.002796616969627065, "phrase": "olt_pre"}, {"score": 0.0027630232270330402, "phrase": "higher-class_transmissions"}, {"score": 0.0025235718883452585, "phrase": "uneliminated_idle_time"}, {"score": 0.002318799760022913, "phrase": "lower-class_packets"}, {"score": 0.0022840180582947302, "phrase": "waiting_time"}, {"score": 0.002202651051682622, "phrase": "idle_time_elimination_algorithms"}, {"score": 0.0021049977753042253, "phrase": "detailed_simulation_experiments"}], "paper_keywords": ["Dynamic bandwidth allocation (DBA)", " Idle time", " Delay sensitive", " Quality of service (QoS)"], "paper_abstract": "To fully exploit the upstream bandwidth in Ethernet passive optical networks (EPONs), dynamic bandwidth allocation (DBA) algorithms need to collect the report messages from all the optical network units (ONUs), incurring an idle time comprising the DBA computation time and the round trip time. Some studies have addressed the problem by using the data transmissions of some or all ONUs (ONU-based) to eliminate the idle time. To satisfy the stringent quality of service (QoS) requirements, for example, to improve the packet delay and jitter for delay sensitive applications without degrading QoS support for other types of applications, some studies have proposed to separate the transmission of higher-class and lower-class traffic within one scheduling cycle. Existing studies on the separable scheduling scenario use the class-based concept, that is, use either the higher-class transmission or the lower-class transmission to eliminate the idle time. By contrast, in this paper, an elastic ONU-class-based idle time elimination algorithm (EOCA) is proposed in which the idle time is eliminated using both the higher-class and lower-class transmissions. The proposed mechanism is elastic in the sense that the lower-class transmission is first considered, and then if insufficient lower-class transmissions exist to eliminate the idle time, the OLT pre-allocates the higher-class transmissions in the following cycle to test whether or not the idle time is eliminated. If the idle time is still not eliminated, the OLT reallocates the bandwidth corresponding to the uneliminated idle time to either the last ONU (uneven method) or all of the ONUs (even method) such that the ONU(s) can early transmit any lower-class packets which arrive during the waiting time. Compared to existing class-based or ONU-based idle time elimination algorithms, the proposed EOCA algorithm performs better. The validity of the proposed EOCA algorithm is demonstrated via detailed simulation experiments.", "paper_title": "Elastic ONU-class-based idle time elimination algorithm for Ethernet passive optical networks", "paper_id": "WOS:000316267400005"}