{"auto_keywords": [{"score": 0.04909558158843681, "phrase": "spatial_autocorrelation"}, {"score": 0.01233242627221448, "phrase": "expected_agreement"}, {"score": 0.00481495049065317, "phrase": "fuzzy_kappa"}, {"score": 0.004449688143230257, "phrase": "cell-by-cell_comparison"}, {"score": 0.004061088450663783, "phrase": "shorter_distances"}, {"score": 0.003928321515373316, "phrase": "well-established_kappa_statistic"}, {"score": 0.0038157022294338454, "phrase": "mean_agreement_relative"}, {"score": 0.003570218982072853, "phrase": "compared_maps"}, {"score": 0.0031125001790084936, "phrase": "calculated_expected_agreement"}, {"score": 0.0030357976028714557, "phrase": "true_expected_agreement"}, {"score": 0.0028760125558659907, "phrase": "considerable_agreement"}, {"score": 0.0028521858876446654, "phrase": "negative_fuzzy_kappa_values"}, {"score": 0.0027020387992490367, "phrase": "lower_agreement"}, {"score": 0.002657445352746803, "phrase": "stronger_spatial_autocorrelation"}, {"score": 0.002591927716261631, "phrase": "improved_fuzzy_kappa_statistic"}, {"score": 0.0024554476124885806, "phrase": "original_fuzzy_kappa"}, {"score": 0.0023849523850778807, "phrase": "new_statistic"}, {"score": 0.002306855521822739, "phrase": "expected_fuzzy_kappa"}, {"score": 0.002167235986623239, "phrase": "improved_statistic"}], "paper_keywords": ["Fuzzy Kappa", " Map comparison", " Accuracy", " Validation"], "paper_abstract": "The Fuzzy Kappa statistic expresses the agreement between two categorical raster maps. The statistic goes beyond cell-by-cell comparison and gives partial credit to cells based on the categories found in the neighborhood. When matching categories are found at shorter distances the agreement is higher. Like the well-established Kappa statistic the Fuzzy Kappa statistic expresses the mean agreement relative to the expected agreement. The model underlying the expected agreement assumes absence of spatial autocorrelation in both compared maps. In reality however, spatial autocorrelation does lower the expected agreement as matching categories become less likely to be found close-by. Since most maps have some degree of spatial autocorrelation, the calculated expected agreement is generally higher than the true expected agreement. This leads to counterintuitive results when maps that appear to have considerable agreement obtain negative Fuzzy Kappa values. Furthermore, the Fuzzy Kappa may be biased, as it systematically attributes lower agreement to maps with stronger spatial autocorrelation. This paper proposes an improved Fuzzy Kappa statistic that is based on the same local agreement and has the same attractive properties as the original Fuzzy Kappa. The novelty is that the new statistic accounts for spatial autocorrelation, such that the expected Fuzzy Kappa for maps that are not cross-correlated is equal to zero. The improved statistic is applied on two cases to demonstrate its properties.", "paper_title": "An improved Fuzzy Kappa statistic that accounts for spatial autocorrelation", "paper_id": "WOS:000263874500004"}