{"auto_keywords": [{"score": 0.037589904163665325, "phrase": "ibm"}, {"score": 0.00481495049065317, "phrase": "continuously_available_virtualized_environment"}, {"score": 0.004613940521007727, "phrase": "continuously_available_services"}, {"score": 0.0038900709793274484, "phrase": "simultaneously_active_paths"}, {"score": 0.003727527379253624, "phrase": "automated_rapid_scaling"}, {"score": 0.003687960013746783, "phrase": "continuous_availability"}, {"score": 0.003159106878239524, "phrase": "best_practices"}, {"score": 0.003108911488613549, "phrase": "application_releases"}, {"score": 0.0030270132320276096, "phrase": "fix_packs"}, {"score": 0.002931569771634119, "phrase": "operating_systems"}, {"score": 0.002662871928330334, "phrase": "vast_flows"}, {"score": 0.0026205405415623525, "phrase": "multipath_redundant_solution"}, {"score": 0.0024842242921857705, "phrase": "continuously_available_hosting_solutions"}, {"score": 0.0022324489895237504, "phrase": "continuous_service"}, {"score": 0.002196944917134202, "phrase": "planned_or_unplanned_interruptions"}, {"score": 0.002104998402285382, "phrase": "ei."}], "paper_keywords": [""], "paper_abstract": "In this paper, we describe continuously available services and application hosting on the Events/IBM.com(R) infrastructure (EI)-a continuously available virtualized environment based on three active data centers that has demonstrated 100-percent availability for many premier Web sites, including www.ibm.com. The environment consists of simultaneously active paths spanning three geographically diverse data centers. We describe techniques for automated rapid scaling and continuous availability using IBM WebSphere(R) clustering, IBM DB2(TM) replication, load balancing, virtualized network infrastructure components, and IBM System p(R) virtualization capabilities. We explore best practices for deploying application releases and updates, applying fix packs, and updating hardware and operating systems, all without interrupting service. in addition, we discuss how to troubleshoot and synchronize the vast flows of a multipath redundant solution. Finally, we describe the requirements that dictate continuously available hosting solutions and modifications to our multisite approach for use in fewer data centers. Application of the topics in this paper has resulted in continuous service with no planned or unplanned interruptions over many years of application hosting within the EI.", "paper_title": "Resilient hosting in a continuously available virtualized environment", "paper_id": "WOS:000261358600005"}