{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "minimum_spanning_tree_problem"}, {"score": 0.04290345039043387, "phrase": "edge_weight"}, {"score": 0.007182540059415127, "phrase": "probability_distribution_function"}, {"score": 0.006353042928108026, "phrase": "proposed_algorithm"}, {"score": 0.004615656893404919, "phrase": "efficient_algorithms"}, {"score": 0.004307099985737249, "phrase": "graph_edges"}, {"score": 0.0040190868373730015, "phrase": "realistic_applications"}, {"score": 0.0038230844545071303, "phrase": "stochastic_graph"}, {"score": 0.0033932753847910366, "phrase": "random_variable"}, {"score": 0.0030820072734233693, "phrase": "learning_automata-based_heuristic_algorithm"}, {"score": 0.0026728137770370176, "phrase": "presented_algorithm"}, {"score": 0.002631959004685823, "phrase": "sampling_process"}, {"score": 0.002542298702137655, "phrase": "spanning_tree"}, {"score": 0.0025130941721410558, "phrase": "minimum_expected_weight"}, {"score": 0.002465161736207254, "phrase": "automata-based_sampling_method"}, {"score": 0.0022911901892022847, "phrase": "unnecessary_samples"}, {"score": 0.002273605493468005, "phrase": "experimental_results"}, {"score": 0.0021961259795489833, "phrase": "well-known_existing_methods"}, {"score": 0.0021049977753042253, "phrase": "running_time"}], "paper_keywords": ["Learning automata", " Minimum spanning tree", " Stochastic graph"], "paper_abstract": "During the last decades, a host of efficient algorithms have been developed for solving the minimum spanning tree problem in deterministic graphs, where the weight associated with the graph edges is assumed to be fixed. Though it is clear that the edge weight varies with time in realistic applications and such an assumption is wrong, finding the minimum spanning tree of a stochastic graph has not received the attention it merits. This is due to the fact that the minimum spanning tree problem becomes incredibly hard to solve when the edge weight is assumed to be a random variable. This becomes more difficult if we assume that the probability distribution function of the edge weight is unknown. In this paper, we propose a learning automata-based heuristic algorithm to solve the minimum spanning tree problem in stochastic graphs wherein the probability distribution function of the edge weight is unknown. The proposed algorithm taking advantage of learning automata determines the edges that must be sampled at each stage. As the presented algorithm proceeds, the sampling process is concentrated on the edges that constitute the spanning tree with the minimum expected weight. The proposed learning automata-based sampling method decreases the number of samples that need to be taken from the graph by reducing the rate of unnecessary samples. Experimental results show the superiority of the proposed algorithm over the well-known existing methods both in terms of the number of samples and the running time of algorithm.", "paper_title": "A learning automata-based heuristic algorithm for solving the minimum spanning tree problem in stochastic graphs", "paper_id": "WOS:000298297000022"}