{"auto_keywords": [{"score": 0.050069332685847595, "phrase": "channel_state_information"}, {"score": 0.041973058972454465, "phrase": "csi"}, {"score": 0.004472935829694716, "phrase": "detailed_measurements"}, {"score": 0.004402854153653114, "phrase": "wireless_channel"}, {"score": 0.003330406613112555, "phrase": "individual_data_subcarriers"}, {"score": 0.0029501745152877706, "phrase": "up-to-date_linux_operating_systems"}, {"score": 0.0027547408718334603, "phrase": "measurement_setup"}, {"score": 0.002697245874076643, "phrase": "intel's_close-source_firmware"}, {"score": 0.0026689487424251907, "phrase": "open-source_iwlwifi_wireless_driver"}, {"score": 0.002364176784708526, "phrase": "matlab"}, {"score": 0.0022783523466965187, "phrase": "data_analysis"}, {"score": 0.002172701452347454, "phrase": "modified_firmware"}, {"score": 0.0021273284545701896, "phrase": "source_code"}], "paper_keywords": [""], "paper_abstract": "We are pleased to announce the release of a tool that records detailed measurements of the wireless channel along with received 802.11 packet traces. It runs on a commodity 802.11n NIC, and records Channel State Information (CSI) based on the 802.11 standard. Unlike Receive Signal Strength Indicator (RSSI) values, which merely capture the total power received at the listener, the CSI contains information about the channel between sender and receiver at the level of individual data subcarriers, for each pair of transmit and receive antennas. Our toolkit uses the Intel WiFi Link 5300 wireless NIC with 3 antennas. It works on up-to-date Linux operating systems: in our testbed we use Ubuntu 10.04 LTS with the 2.6.36 kernel. The measurement setup comprises our customized versions of Intel's close-source firmware and open-source iwlwifi wireless driver, user-space tools to enable these measurements, access point functionality for controlling both ends of the link, and Matlab (or Octave) scripts for data analysis. We are releasing the binary of the modified firmware, and the source code to all the other components.", "paper_title": "Tool Release: Gathering 802.11n Traces with Channel State Information", "paper_id": "WOS:000289780800007"}