{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "als-linked_superoxide_dismutase_fibrils"}, {"score": 0.004566567411073082, "phrase": "copper-zinc_superoxide_dismutase"}, {"score": 0.004285289574869884, "phrase": "spinal_cords"}, {"score": 0.0031011538704241908, "phrase": "structural_model"}, {"score": 0.003036040409062437, "phrase": "molecular_dynamics_simulations"}, {"score": 0.0029098743621130004, "phrase": "experimental_findings"}, {"score": 0.0028487656293168795, "phrase": "molecular_explanation"}, {"score": 0.0027015344365793016, "phrase": "physiological_conditions"}, {"score": 0.002575526825728026, "phrase": "new_dimeric_unit"}, {"score": 0.002378408229095287, "phrase": "wide_hydrophobic_surface"}, {"score": 0.0023532890136269986, "phrase": "specific_electrostatic_interactions"}, {"score": 0.002208035721125305, "phrase": "electron_microscopy"}, {"score": 0.0021616339773325704, "phrase": "structural_basis"}], "paper_keywords": ["Amyotrophic lateral sclerosis", " Cu,Zn superoxide dismutase", " Fibrillation", " Molecular dynamics simulation", " Molecular modeling", " Protein aggregation"], "paper_abstract": "Familial amyotrophic lateral sclerosis caused by mutations in copper-zinc superoxide dismutase (SOD1) is characterized by the presence of SOD1-rich inclusions in spinal cords. It has been shown that a reduced intra-subunit disulfide bridge apo-SOD1 can rapidly initiate fibrillation forming an inter-subunits disulfide under mild, physiologically accessible conditions. Once initiated, elongation can proceed via recruitment of either apo or partially metallated disulfide-intact SOD1 and the presence of copper, but not zinc, ions inhibit fibrillation. We propose a structural model, refined through molecular dynamics simulations, that, taking into account these experimental findings, provides a molecular explanation for the initiation and the elongation of SOD1 fibrils in physiological conditions. The model indicates the occurrence of a new dimeric unit, prone to interact one with the other due to the presence of a wide hydrophobic surface and specific electrostatic interactions. The model has dimensions consistent with the SOD1 fibril size observed through electron microscopy and provides a structural basis for the understanding of SOD1 fibrillation.", "paper_title": "A structural modeling approach for the understanding of initiation and elongation of ALS-linked superoxide dismutase fibrils", "paper_id": "WOS:000323283100024"}