{"auto_keywords": [{"score": 0.03358208446007496, "phrase": "egc_constraints"}, {"score": 0.007319629419032328, "phrase": "polynomial_time"}, {"score": 0.007243671795463833, "phrase": "cardinality_sets"}, {"score": 0.00481495049065317, "phrase": "extended_global_cardinality_constraint"}, {"score": 0.004698878021540436, "phrase": "domain_consistency_problem"}, {"score": 0.004666228956744244, "phrase": "extended_global_cardinality"}, {"score": 0.004553725265085244, "phrase": "egc_constraint"}, {"score": 0.0044906540097516545, "phrase": "set_x"}, {"score": 0.004030449969901066, "phrase": "non-negative_integers"}, {"score": 0.0038787040860731935, "phrase": "variable_x"}, {"score": 0.003421232059259766, "phrase": "np"}, {"score": 0.0031568304678554243, "phrase": "general_factors"}, {"score": 0.003048502724695561, "phrase": "known_polynomial-time_case"}, {"score": 0.002872783899731766, "phrase": "value_graph"}, {"score": 0.0028132076314202606, "phrase": "variable-value_pairs"}, {"score": 0.002542174767860791, "phrase": "bounded_treewidth"}, {"score": 0.002378887754874809, "phrase": "complexity_theoretic_assumption"}, {"score": 0.00227323596233465, "phrase": "additional_restrictions"}, {"score": 0.0021049977753042253, "phrase": "linear_time"}], "paper_keywords": ["Global constraints", " General factor problem", " Domain consistency", " Bounded treewidth", " Parameterized complexity"], "paper_abstract": "We study the consistency and domain consistency problem for extended global cardinality (EGC) constraints. An EGC constraint consists of a set X of variables, a set D of values, a domain D(x) subset of D for each variable x, and a \"cardinality set\" K(d) of non-negative integers for each value d. The problem is to instantiate each variable x with a value in D(x) such that for each value d, the number of variables instantiated with d belongs to the cardinality set K(d). It is known that this problem is NP-complete in general, but solvable in polynomial time if all cardinality sets are intervals. First we pinpoint connections between EGC constraints and general factors in graphs. This allows us to extend the known polynomial-time case to certain non-interval cardinality sets. Second we consider EGC constraints under restrictions in terms of the treewidth of the value graph (the bipartite graph representing variable-value pairs) and the cardinality-width (the largest integer occurring in the cardinality sets). We show that EGC constraints can be solved in polynomial time for instances of bounded treewidth, where the order of the polynomial depends on the treewidth. We show that (subject to the complexity theoretic assumption FPT not equal W[1]) this dependency cannot be avoided without imposing additional restrictions. If, however, also the cardinality-width is bounded, this dependency gets removed and EGC constraints can be solved in linear time.", "paper_title": "Tractable cases of the extended global cardinality constraint", "paper_id": "WOS:000286117200001"}