{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "document_collections"}, {"score": 0.040537135041717604, "phrase": "design_process"}, {"score": 0.004529093447865156, "phrase": "design_principle"}, {"score": 0.004234129588974058, "phrase": "conceptual_shift"}, {"score": 0.0041316803676012155, "phrase": "collection_designer's_task"}, {"score": 0.0038154673253945003, "phrase": "author_document_collections"}, {"score": 0.0037459885494311217, "phrase": "acknowledged_rhetorical_purpose"}, {"score": 0.0036329805216306576, "phrase": "design_goal"}, {"score": 0.003417054482155433, "phrase": "identified_audience"}, {"score": 0.0033139366449568565, "phrase": "design_research"}, {"score": 0.00257735013358606, "phrase": "rhetorically_aware_document_collections"}, {"score": 0.002530359917257626, "phrase": "study_participants"}, {"score": 0.002210903392596343, "phrase": "student_designers"}, {"score": 0.0021049977753042253, "phrase": "authorial_power"}], "paper_keywords": [""], "paper_abstract": "Although neutrality has been extensively questioned as a design principle for document collections and their descriptive infrastructures, little research has investigated how this conceptual shift might affect the collection designer's task. This article describes the development and evaluation of a design process to author document collections with an acknowledged rhetorical purpose: collections with a design goal to persuasively communicate a position on their material to an identified audience. Following principles of design research, the process was developed via the creation of two prototype collections. The process was then implemented in a classroom setting. Over the course of a semester, 16 participants used the design process both as individuals and in teams to create rhetorically aware document collections. Although study participants successfully used the process to create collections that persuasively expressed a position on their subject matter, reflections on their design experiences showed that the student designers felt some ambivalence regarding the assumption of authorial power.", "paper_title": "Compiler to Author: A Process for Designing Rhetorically Aware Document Collections", "paper_id": "WOS:000294255200011"}