{"auto_keywords": [{"score": 0.048912784012203225, "phrase": "modern_termination_checker"}, {"score": 0.04805541544871026, "phrase": "knuth-bendix_completion_procedure"}, {"score": 0.04047293105117697, "phrase": "path_orderings"}, {"score": 0.004814955496608903, "phrase": "knuth-bendix"}, {"score": 0.00428257928723, "phrase": "intermediate_and_resulting_rewriting_systems"}, {"score": 0.003976978140059542, "phrase": "modern_completion_tools"}, {"score": 0.003558830226733501, "phrase": "decision_procedure"}, {"score": 0.0033251716926666437, "phrase": "single_path_order"}, {"score": 0.0026953359825383646, "phrase": "new_method"}, {"score": 0.002565345470805401, "phrase": "resulting_rewrite_system"}, {"score": 0.002456744238900652, "phrase": "input_theory"}, {"score": 0.002198084195030656, "phrase": "new_procedure"}, {"score": 0.0021710766932077994, "phrase": "slothrop"}], "paper_keywords": [""], "paper_abstract": "A Knuth-Bendix completion procedure is parametrized by a reduction ordering used to ensure termination of intermediate and resulting rewriting systems. While in principle any reduction ordering can be used, modern completion tools typically implement only Knuth-Bendix and path orderings. Consequently, the theories for which completion can possibly yield a decision procedure are limited to those that can be oriented with a single path order. In this paper, we present a variant on the Knuth-Bendix completion procedure in which no ordering is assumed. Instead we rely on a modern termination checker to verify termination of rewriting systems. The new method is correct if it terminates; the resulting rewrite system is convergent and equivalent to the input theory. Completions are also not just ground-convergent, but fully convergent. We present an implementation of the new procedure, SLOTHROP, which automatically obtains such completions for theories that do not admit path orderings.", "paper_title": "SLOTHROP: Knuth-Bendix completion with a modern termination checker", "paper_id": "WOS:000240072100022"}