{"auto_keywords": [{"score": 0.04259961428420402, "phrase": "mfs"}, {"score": 0.03800439781238907, "phrase": "rt"}, {"score": 0.011447813428420425, "phrase": "significant_difference"}, {"score": 0.00481495049065317, "phrase": "triggered_failures"}, {"score": 0.0044644734709113985, "phrase": "corresponding_selection"}, {"score": 0.004442032546224076, "phrase": "factor_values"}, {"score": 0.0043753813457279404, "phrase": "minimal_failure-causing_schema"}, {"score": 0.004223708778943785, "phrase": "combinatorial_testing"}, {"score": 0.0038379074449947067, "phrase": "random_testing"}, {"score": 0.003686393157786059, "phrase": "cl"}, {"score": 0.003233075944817365, "phrase": "relative_merits"}, {"score": 0.003152531962718477, "phrase": "interaction_triggered_faults"}, {"score": 0.0029898418888138364, "phrase": "first_complete_and_systematic_comparison"}, {"score": 0.0029449158645099447, "phrase": "mfs._method"}, {"score": 0.002922705896608178, "phrase": "systematic_review"}, {"score": 0.002907992115184249, "phrase": "six_aspects"}, {"score": 0.0028934298963202744, "phrase": "ct"}, {"score": 0.00238226080268069, "phrase": "latter_case"}, {"score": 0.0023287359930308864, "phrase": "rt_and_ct._conclusion"}, {"score": 0.0021317474351448544, "phrase": "valuable_improvement"}], "paper_keywords": ["Software testing", " Random Testing (RT)", " Adaptive Random Testing (ART)", " Combinatorial Testing (CT)", " Interaction Triggered Failure (ITF)", " Minimal Failure-causing Schema (MFS)"], "paper_abstract": "Context: Software behavior depends on many factors, and some failures occur only when certain factors interact. This is known as an interaction triggered failure, and the corresponding selection of factor values can be modeled as a Minimal Failure-causing Schema (MFS). (An MFS involving m factors is an m-MFS.) Combinatorial Testing (CT) has been developed to exercise (\"hit\") all MFS with few tests. Adaptive Random Resting (ART) endeavors to make tests as different as possible, ensuring that testing of MFS is not unnecessarily repeated. Random Testing (RT) chooses tests at random without regard to the MFS already treated. Cl' might be expected to improve on RT for finding interaction triggered faults, and yet some studies report no significant difference. CT can also be expected to be better than ART, and yet other studies report that ART can be much better than RT. In light of these, the relative merits of CT, ART, and RT for finding interaction triggered faults are unclear. Objective: To investigate the relationships among CT, ART, and RT, we conduct the first complete and systematic comparison for the purpose of hitting MFS. Method: A systematic review of six aspects of CT, RT and ART is conducted first. Then two kinds of experiments are used to compare them under four metrics. Results: ART improves upon RT, but t-way CT is better than both. In hitting t'-MFS the advantage is typically in the range from 10% to 30% when t = t', but becomes much smaller when t' < t, and there may be no advantage when t' > t. The latter case may explain the studies reporting no significant difference between RT and CT. Conclusion: RT is easily implemented. However, depending on its implementation, ART can improve upon RT. Cl' does as well as ART whether or nott' = t, but provides a valuable improvement in the cases when t' = t. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Combinatorial testing, random testing, and adaptive random testing for detecting interaction triggered failures", "paper_id": "WOS:000353179000011"}