{"auto_keywords": [{"score": 0.04957466661795797, "phrase": "energy_consumption"}, {"score": 0.02345107552414868, "phrase": "virtual_network"}, {"score": 0.006265736012462119, "phrase": "data_center"}, {"score": 0.0054413252316698885, "phrase": "electronic_packet_switches"}, {"score": 0.00481495049065317, "phrase": "virtual_network_reconfiguration"}, {"score": 0.0047306971679760175, "phrase": "optical_data_centers"}, {"score": 0.004664352260912174, "phrase": "data_centers"}, {"score": 0.004642185678592003, "phrase": "data_center_networks"}, {"score": 0.004598933498016774, "phrase": "serious_problem"}, {"score": 0.004116880183338268, "phrase": "vnr-dcn"}, {"score": 0.0041074234667687875, "phrase": "substantial_portion"}, {"score": 0.004064117897000019, "phrase": "total_energy_consumption"}, {"score": 0.0038407203087210775, "phrase": "optical_circuit_switches"}, {"score": 0.003681238363808568, "phrase": "electronic_switches"}, {"score": 0.003417859963947459, "phrase": "different_ports"}, {"score": 0.0030414140732789186, "phrase": "unused_ports"}, {"score": 0.0025846562485378247, "phrase": "optical_communication_paths"}, {"score": 0.00232431758517087, "phrase": "optimization_problem"}, {"score": 0.002196342933346204, "phrase": "small_number"}, {"score": 0.002180848602315088, "phrase": "active_ports"}, {"score": 0.0021049977753042253, "phrase": "virtual_network_configuration"}], "paper_keywords": ["Data center", " Energy consumption", " Optical network", " Virtual network"], "paper_abstract": "Energy consumption by data centers has become a serious problem, and measures for its reduction should be developed. Such measures should address not only the energy consumption of the servers but also that of the network itself, because the latter is responsible for a substantial portion of the total energy consumption. One approach to reducing the energy consumption of the network within a data center is to use optical circuit switches (OCSs) at the core of the data center, where electronic switches are connected to the OCSs. In such a network, a virtual network can be configured by setting the OCSs to connect different ports of the electronic packet switches. Thus, the energy consumption of the network can be reduced by configuring the virtual network to minimize the number of ports required by the electronic packet switches and powering down any unused ports. In this paper, we propose a method called virtual network reconfiguration for data center networks (VNR-DCN) that immediately reconfigures the virtual network so as to reduce the energy consumption under the constraints on the bandwidth and delay between servers in data center networks based on optical communication paths. In VNR-DCN, we configure the virtual network to satisfy the requirements by setting the parameters of the topology, called generalized flattened butterfly, instead of solving an optimization problem. In the evaluation, we show that a virtual network configured by VNR-DCN requires a small number of active ports. In addition, we show the impact of virtual network configuration on energy consumption.", "paper_title": "Virtual Network Reconfiguration for Reducing Energy Consumption in Optical Data Centers", "paper_id": "WOS:000343163300010"}