{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "test_cases"}, {"score": 0.007680851272517146, "phrase": "performance_evaluation"}, {"score": 0.004740823885631586, "phrase": "components._component-based_software_development_techniques"}, {"score": 0.004386887374401584, "phrase": "specified_requirements"}, {"score": 0.004295367728920046, "phrase": "proposed_approach"}, {"score": 0.0042859292226559535, "phrase": "functional_requirements"}, {"score": 0.004106810349956121, "phrase": "non-functional_requirements"}, {"score": 0.003859500298805362, "phrase": "non-functional_behavior"}, {"score": 0.0037414662674652805, "phrase": "test_set"}, {"score": 0.0034217766191752628, "phrase": "considerable_increase"}, {"score": 0.0033429545815200825, "phrase": "development_process"}, {"score": 0.003010063382882408, "phrase": "sequential_curve_fittings"}, {"score": 0.002975178815784779, "phrase": "incremental_number"}, {"score": 0.002917931350071647, "phrase": "minimal_pre-specified_residual_error"}, {"score": 0.002861782260525497, "phrase": "incremental_selection"}, {"score": 0.0025867180355950816, "phrase": "desired_residual_error"}, {"score": 0.00238392747425758, "phrase": "smaller_the_error"}, {"score": 0.002248863090203165, "phrase": "image_compression_components"}, {"score": 0.0022227806435520764, "phrase": "clear_indication"}, {"score": 0.0021049977753042253, "phrase": "reasonable_accuracy"}], "paper_keywords": ["Component testing", " performance testing", " test case reduction"], "paper_abstract": "Component-based software development techniques are being adopted to rapidly deploy complex, high quality systems. One of its aspects is the selection of components that realize the specified requirements. In addition to the functional requirements, the selection must be done taking into account some non-functional requirements such as performance, reliability, and usability. Hence, data that characterize the non-functional behavior of the components is needed; a test set is needed to collect this data for each component under consideration. This set may be large, which results in a considerable increase in the cost of the development process. Here, a process is proposed to considerably reduce the number of test cases used in the performance evaluation of components. The process is based on sequential curve fittings from an incremental number of test cases until a minimal pre-specified residual error is achieved. The incremental selection of test cases is done in two different ways: randomly and adaptively. The accuracy and performance of the proposed approach are dependent on the values of the desired residual error. The smaller the residual error, the higher the accuracy. However, performance has an opposite behavior. The smaller the error, the larger the number of test cases needed. The results from experiments with image compression components are a clear indication that a reduction in the number of test cases can be achieved while maintaining reasonable accuracy when using the proposed approach.", "paper_title": "A SEGMENT BASED APPROACH FOR THE REDUCTION OF THE NUMBER OF TEST CASES FOR PERFORMANCE EVALUATION OF COMPONENTS", "paper_id": "WOS:000269249400002"}