{"auto_keywords": [{"score": 0.04592160859866953, "phrase": "irex_vi"}, {"score": 0.006031297794227449, "phrase": "ops-xing_dataset"}, {"score": 0.00481495049065317, "phrase": "irex_vi_results"}, {"score": 0.004543708337879809, "phrase": "previous_research"}, {"score": 0.0045108906244892165, "phrase": "'iris_template"}, {"score": 0.0042289902014176805, "phrase": "artificially_low_value"}, {"score": 0.004150030918669128, "phrase": "international_organization_for_standardization"}, {"score": 0.0038179283509963695, "phrase": "iris_recognition"}, {"score": 0.003512308265830794, "phrase": "'truncated_regression'_technique"}, {"score": 0.003172969962401266, "phrase": "hamming_distances"}, {"score": 0.002961519813246521, "phrase": "lower-than-correct_value"}, {"score": 0.002897710777957041, "phrase": "match_scores"}, {"score": 0.0027441220799352926, "phrase": "small_but_unknown_number"}, {"score": 0.002407827985570249, "phrase": "independent_variables"}, {"score": 0.002263639474937039, "phrase": "irex_vi_report"}], "paper_keywords": [""], "paper_abstract": "The authors analyse why Iris Exchange Report (IREX) VI conclusions about 'iris ageing' differ significantly from results of previous research on 'iris template ageing'. They observe that IREX VI uses a definition of 'iris ageing' that is restricted to a subset of International Organization for Standardization (ISO)-definition template ageing. They also explain how IREX VI commits various methodological errors in obtaining what it calls its 'best estimate of iris recognition ageing'. The OPS-XING dataset that IREX VI analyses for its 'best estimate of iris recognition ageing' contains no matches with Hamming distance >0.27. A 'truncated regression' technique should be used to analyse such a dataset, which IREX VI fails to do so, biasing its 'best estimate' to be lower-than-correct. IREX VI mixes Hamming distances from first, second and third attempts together in its regression, creating another source of bias towards a lower-than-correct value. In addition, the match scores in the OPS-XING dataset are generated from a '1-to-first' matching strategy, meaning that they contain a small but unknown number of impostor matches, constituting another source of bias towards an artificially low value for ageing. Finally, IREX VI makes its 'best estimate of iris recognition ageing' by interpreting its regression model without taking into account the correlation among independent variables. This is another source of bias towards an artificially low value for ageing. Importantly, the IREX VI report does not acknowledge the existence of any of these sources of bias. They conclude with suggestions for a revised, improved IREX VI.", "paper_title": "Critical examination of the IREX VI results", "paper_id": "WOS:000365645700002"}