{"auto_keywords": [{"score": 0.027873010773457767, "phrase": "fixed_ordering_cost"}, {"score": 0.027202775614365744, "phrase": "optimal_order-up"}, {"score": 0.00481495049065317, "phrase": "non-stationary_supply_disruptions"}, {"score": 0.004449688143230257, "phrase": "non-stationary_and_stochastic_supply_availability"}, {"score": 0.0037527984559873745, "phrase": "contractual_obligations"}, {"score": 0.003706299561774348, "phrase": "non-contractual_preferences"}, {"score": 0.003191134522157061, "phrase": "customer_demand"}, {"score": 0.0030357976028714557, "phrase": "system_costs_consist"}, {"score": 0.003010651173285521, "phrase": "fixed_ordering"}, {"score": 0.00288800021194675, "phrase": "all-or-nothing_type"}, {"score": 0.002486292595645607, "phrase": "simple_characterization"}, {"score": 0.0023261372216194383, "phrase": "heuristic_algorithm"}, {"score": 0.0022877332844249065, "phrase": "good_ordering_strategy"}, {"score": 0.0021853630049264655, "phrase": "asi"}, {"score": 0.002158233639156015, "phrase": "managerial_insights"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Supply uncertainty", " Advance supply information", " Inventory", " Optimal policy"], "paper_abstract": "We consider the production/inventory problem of a manufacturer (or a retailer) under non-stationary and stochastic supply availability. Although supply availability is uncertain, the supplier would be able to predict her near future shortages - and hence supply disruption to (some of) her customers - based on factors such as her pipeline stock information, production schedule, seasonality, contractual obligations, and non-contractual preferences regarding other manufacturers. We consider the case where the information on the availability of supply for the near future, which we refer to as advance supply information (ASI), is provided by the supplier. The customer demand is deterministic but non-stationary over time, and the system costs consist of fixed ordering, holding and backorder costs. We consider an all-or-nothing type of supply availability structure and we show the optimplity of a state-dependent (s,S) policy. For the case with no fixed ordering cost we prove various properties of the optimal order-up-to levels and provide a simple characterization of optimal order-up-to levels. For the model with fixed ordering cost, we propose a heuristic algorithm for finding a good ordering strategy. Finally, we numerically elaborate on the value of ASI and provide managerial insights. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Optimal inventory policies with non-stationary supply disruptions and advance supply information", "paper_id": "WOS:000304686000002"}