{"auto_keywords": [{"score": 0.0401475817258346, "phrase": "human_problem"}, {"score": 0.00481495049065317, "phrase": "hard_problem"}, {"score": 0.0046491050101721545, "phrase": "earnest_attempt"}, {"score": 0.003240895431893266, "phrase": "robot's_own_naturalist_perspective"}, {"score": 0.002976019715894587, "phrase": "exact_same_metaphysical_responses"}, {"score": 0.0026919067120537055, "phrase": "extravagant_metaphysical_solutions"}, {"score": 0.0024348510123716424, "phrase": "algorithmic_fact"}, {"score": 0.002362620540317279, "phrase": "naturalist_physicalist_reduction"}, {"score": 0.0022696277881969896, "phrase": "metaphysical_fact"}, {"score": 0.0021693692831601745, "phrase": "familiar_seeming_problem"}, {"score": 0.0021369416775353107, "phrase": "artificial_context"}, {"score": 0.0021049977753042253, "phrase": "greater_understanding"}], "paper_keywords": ["Hard problem", " Consciousness", " Strong AI", " Artificial consciousness", " Reduction", " Identification regress", " Explanatory gap", " Identity", " Mysterian"], "paper_abstract": "I show how a robot with what looks like a hard problem of consciousness might emerge from the earnest attempt to make a robot that is smart and self-reflective. This problem arises independently of any assumption to the effect that the robot is conscious, but deserves to be thought of as related to the human problem in virtue of the fact that (1) the problem is one the robot encounters when it tries to naturalistically reduce its own subjective states (2) it seems incredibly difficult from the robot's own naturalist perspective and, most importantly, (3) it invites the robot to engage in the exact same metaphysical responses as humans offer to the problem of consciousness. Despite the fact that it invites the robot to consider extravagant metaphysical solutions, the problem I explore is purely algorithmic. The robot cannot complete its naturalist physicalist reduction as a matter of algorithmic fact, whether or not the naturalist physicalist reduction would be correct as a matter of metaphysical fact. It is hoped that by reproducing the familiar seeming problem in an artificial context, a greater understanding of the human problem of consciousness can be achieved.", "paper_title": "How the Problem of Consciousness Could Emerge in Robots", "paper_id": "WOS:000310090200001"}