{"auto_keywords": [{"score": 0.03942024763180968, "phrase": "tunnel_convergence"}, {"score": 0.012366638671851766, "phrase": "handover_delay"}, {"score": 0.00481495049065317, "phrase": "-effective_and_fast_handoff_scheme"}, {"score": 0.004780780407878596, "phrase": "proxy_mobile"}, {"score": 0.004713162564945179, "phrase": "multicasting_support"}, {"score": 0.004663074596384574, "phrase": "recent_advancements"}, {"score": 0.004629977311316031, "phrase": "wireless_communication_technologies"}, {"score": 0.0045971138571344345, "phrase": "mobile_multicasting"}, {"score": 0.004436247158342735, "phrase": "network_resources"}, {"score": 0.004116440453049531, "phrase": "network_delivery"}, {"score": 0.0040726680518382965, "phrase": "multicast_services"}, {"score": 0.003958194802333944, "phrase": "multicast_handover_delay"}, {"score": 0.0034444213065548688, "phrase": "network-based_mobility_management_protocol"}, {"score": 0.0029441544381246278, "phrase": "handoff"}, {"score": 0.0028511121935559072, "phrase": "fast_and_low-cost_mobility_management"}, {"score": 0.0027121844541913367, "phrase": "complex_multicast_routing_protocol"}, {"score": 0.002654730366598922, "phrase": "simplified_proxy_method"}, {"score": 0.002342972434255588, "phrase": "multicast_handover_procedure"}, {"score": 0.0021659920594094407, "phrase": "multicast_techniques"}, {"score": 0.0021505802791817203, "phrase": "lfh"}, {"score": 0.0021352776064254195, "phrase": "multicast_delay"}, {"score": 0.0021049977753042253, "phrase": "lower_cost"}], "paper_keywords": ["PMIPv6", " multicast", " MLD", " low-cost handoff", " fast handoff"], "paper_abstract": "With recent advancements in wireless communication technologies, mobile multicasting is becoming important, in an effort to use network resources more efficiently. In the past, when various mobile IP-based multicast techniques were proposed, the focus was on the costs needed for network delivery to provide multicast services, as well as on minimizing the multicast handover delay. However, it is fundamentally difficult to resolve the problems of handover delay and tunnel convergence for techniques using MIPv6 (Mobile IPv6), a host-based mobility management protocol. To resolve these problems, the network-based mobility management protocol PMIPv6 (Proxy Mobile IPv6) was standardized. Although performance is improved in PMIPv6 over MIPv6, it still suffers from problems of handover delay and tunnel convergence. To overcome these limitations, a technique called LFH (Low-cost and Fast Handoff) is proposed in this paper, for fast and low-cost mobility management with multicasting support in PMIPv6 networks. To reduce the interactions between the complex multicast routing protocol and multicast messages, a simplified proxy method called MLD (Multicast Listener Discovery) is implemented and modified. Furthermore, a TCR (Tunnel Combination and Reconstruction) algorithm was used in the multicast handover procedure within the LMA (Local Mobility Anchor) domain, as well as in the multicast handover procedure between domains, in order to overcome the problem of tunnel convergence. It was found that, compared to other types of multicast techniques, LFH reduces multicast delay, and requires lower cost.", "paper_title": "Cost-effective and fast handoff scheme in Proxy Mobile IPv6 networks with multicasting support", "paper_id": "WOS:000338214000003"}