{"auto_keywords": [{"score": 0.04814050608144561, "phrase": "classroom_climate"}, {"score": 0.00481495049065317, "phrase": "online_peer-assessment_learning_environment"}, {"score": 0.003855849747095327, "phrase": "learning_activity"}, {"score": 0.0036616109902631293, "phrase": "pretest-posttest_quasi-experimental_research_design"}, {"score": 0.0035866734383189366, "phrase": "eight_fifth-grade_classes"}, {"score": 0.003151736708029235, "phrase": "online_learning_system"}, {"score": 0.0028567126120064546, "phrase": "data_analysis"}, {"score": 0.0028127163745564777, "phrase": "different_identity_modes"}, {"score": 0.0025892330566358503, "phrase": "real-name_identity_revelation_modes"}, {"score": 0.002358917661465133, "phrase": "empirical_significance"}, {"score": 0.0022399174232611853, "phrase": "system_development"}, {"score": 0.0022168460543913787, "phrase": "instructional_implementation"}, {"score": 0.002194011800331242, "phrase": "future_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Applications in subject areas", " Computer-mediated communication", " Cooperative/collaborative learning", " Human-computer interface", " Teaching/learning strategies"], "paper_abstract": "The effects of four different identity revelation modes (three fixed modes: real-name, anonymity, nickname and one dynamic user self-choice mode) on participants' perceptions toward their assessors, classroom climate, and past experience with the learning activity in which they were engaged were examined. A pretest-posttest quasi-experimental research design was adopted. Eight fifth-grade classes (age 10-11, N = 243) were randomly assigned to four different identity revelation modes in order for them to participate in the study. An online learning system that allows students to contribute to and benefit from the process of question-generation and peer-assessment was adopted. Data analysis confirmed that different identity modes lead participants to view their assessors differently. Specifically, participants assigned to the self-choice and real-name identity revelation modes tended to view their assessors more favorably than those in the anonymity and nickname groups. The empirical significance of the study as well as suggestions for learning system development, instructional implementation and future study are provided. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Different identity revelation modes in an online peer-assessment learning environment: Effects on perceptions toward assessors, classroom climate and learning activities", "paper_id": "WOS:000294099000029"}