{"auto_keywords": [{"score": 0.04404240354196418, "phrase": "visual-servo_control"}, {"score": 0.04336705121455173, "phrase": "uav"}, {"score": 0.00481495049065317, "phrase": "unmanned_aerial_vehicle"}, {"score": 0.0046875099587735825, "phrase": "unmanned_aerial_vehicles"}, {"score": 0.0040334640350288, "phrase": "quadrotor_helicopter"}, {"score": 0.003926626018798576, "phrase": "visual_information"}, {"score": 0.0038638811223100184, "phrase": "control_loop"}, {"score": 0.003802135020791801, "phrase": "previous_study"}, {"score": 0.0037213333316218522, "phrase": "estimation_approach"}, {"score": 0.002937879003671346, "phrase": "eye-in-hand_visual_servoing_system"}, {"score": 0.0025004330553466693, "phrase": "matlab"}, {"score": 0.0024339783012484032, "phrase": "quadrotor_aerial_vehicle"}, {"score": 0.0021507795710951384, "phrase": "model_quadrotor_uav"}, {"score": 0.0021049977753042253, "phrase": "successful_performance"}], "paper_keywords": ["Image based visual servo control", " Hybrid visual servo control", " UAV", " Flight stability"], "paper_abstract": "The use of unmanned aerial vehicles (UAVs) for military, scientific, and civilian sectors are increasing drastically in recent years. This study presents algorithms for the visual-servo control of an UAV, in which a quadrotor helicopter has been stabilized with visual information through the control loop. Unlike previous study that use pose estimation approach which is time consuming and subject to various errors, the visual-servo control is more reliable and fast. The method requires a camera on-board the vehicle, which is already available on various UAV systems. The UAV with a camera behaves like an eye-in-hand visual servoing system. In this study the controller was designed by using two different approaches; image based visual servo control method and hybrid visual servo control method. Various simulations are developed on Matlab, in which the quadrotor aerial vehicle has been visual-servo controlled. In order to show the effectiveness of the algorithms, experiments were performed on a model quadrotor UAV, which suggest successful performance.", "paper_title": "Image Based and Hybrid Visual Servo Control of an Unmanned Aerial Vehicle", "paper_id": "WOS:000298229100023"}