{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "axiomatic_enrichment"}, {"score": 0.015593877562310393, "phrase": "gene_ontology"}, {"score": 0.014899298413201083, "phrase": "biomedical_ontology_labels"}, {"score": 0.013418949822187928, "phrase": "lexical_analysis"}, {"score": 0.011668698059605477, "phrase": "external_ontologies"}, {"score": 0.011574906833162067, "phrase": "go_consortium"}, {"score": 0.00930611155076099, "phrase": "cpe_metric"}, {"score": 0.007240083786284385, "phrase": "biomedical_ontologies"}, {"score": 0.004737328254103122, "phrase": "lexical_perspective"}, {"score": 0.004673595320100892, "phrase": "main_goal"}, {"score": 0.0044874720717774305, "phrase": "automatic_creation"}, {"score": 0.004463219700514686, "phrase": "formal_relationships"}, {"score": 0.00394005915474284, "phrase": "high_degree"}, {"score": 0.003803608030258807, "phrase": "cross-products_extension"}, {"score": 0.003783041749645542, "phrase": "cpe"}, {"score": 0.0037119096760649065, "phrase": "potential_interest"}, {"score": 0.0036818356550834, "phrase": "specific_regularity"}, {"score": 0.003583331341515525, "phrase": "exact_matches"}, {"score": 0.0034685865622700435, "phrase": "so-called_cross-product_extensions"}, {"score": 0.0034498229193361766, "phrase": "cross-products"}, {"score": 0.0029716179574996626, "phrase": "lexical_terms"}, {"score": 0.0028608343647018595, "phrase": "go_classes"}, {"score": 0.0025595311522722936, "phrase": "smaller_parts"}, {"score": 0.0024842242921857705, "phrase": "go_cross-product_extensions"}, {"score": 0.0024242565729744826, "phrase": "mean_precision"}, {"score": 0.0023465400668244386, "phrase": "false_positives"}, {"score": 0.0023211909152089606, "phrase": "precision_value"}, {"score": 0.0021688337445559, "phrase": "new_insights"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ontology engineering", " Axiomatic enrichment", " Biomedical ontologies", " Gene Ontology"], "paper_abstract": "Objective: The main goal of this work is to measure how lexical regularities in biomedical ontology labels can be used for the automatic creation of formal relationships between classes, and to evaluate the results of applying our approach to the Gene Ontology (GO). Methods: In recent years, we have developed a method for the lexical analysis of regularities in biomedical ontology labels, and we showed that the labels can present a high degree of regularity. In this work, we extend our method with a cross-products extension (CPE) metric, which estimates the potential interest of a specific regularity for axiomatic enrichment in the lexical analysis, using information on exact matches in external ontologies. The GO consortium recently enriched the GO by using so-called cross-product extensions. Cross-products are generated by establishing axioms that relate a given GO class with classes from the GO or other biomedical ontologies. We apply our method to the GO and study how its lexical analysis can identify and reconstruct the cross-products that are defined by the GO consortium. Results: The label of the classes of the GO are highly regular in lexical terms, and the exact matches with labels of external ontologies affect 80% of the GO classes. The CPE metric reveals that 31.48% of the classes that exhibit regularities have fragments that are classes into two external ontologies that are selected for our experiment, namely, the Cell Ontology and the Chemical Entities of Biological Interest ontology, and 18.90% of them are fully decomposable into smaller parts. Our results show that the CPE metric permits our method to detect GO cross-product extensions with a mean recall of 62% and a mean precision of 28%. The study is completed with an analysis of false positives to explain this precision value. Conclusions: We think that our results support the claim that our lexical approach can contribute to the axiomatic enrichment of biomedical ontologies and that it can provide new insights into the engineering of biomedical ontologies. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Approaching the axiomatic enrichment of the Gene Ontology from a lexical perspective", "paper_id": "WOS:000362140700005"}