{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "performance_evaluation_methodology"}, {"score": 0.004481132747216135, "phrase": "empirical_research"}, {"score": 0.0040438338011467845, "phrase": "performance_evaluation_process"}, {"score": 0.003941319912895672, "phrase": "completely_new_and_different_fusion_process"}, {"score": 0.0037632749713937637, "phrase": "quantitative_insights"}, {"score": 0.0036490529923833884, "phrase": "consistency_measures"}, {"score": 0.003611751858608048, "phrase": "distributed_fusion_measures"}, {"score": 0.003209152260950748, "phrase": "multiple_airborne_platforms"}, {"score": 0.0027789349951704177, "phrase": "proposed_approach"}, {"score": 0.0027363971333961967, "phrase": "overarching_performance_evaluation_methodology"}, {"score": 0.002559444836360178, "phrase": "\"track-to-truth\"_association_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Performance evaluation", " Distributed data fusion", " Dual Node Network Architecture"], "paper_abstract": "The emphasis of this paper is to design a performance evaluation methodology for Level 1 distributed data fusion processes. However, there is little empirical research been done so far to define a rigorous, technically fair, yet affordable method for performance evaluation for data fusion processes. Within this methodology Performance Evaluation process is treated as a completely new and different fusion process. Here we address the distributed Level 1 fusion problem and give quantitative insights into the interdependencies and the consistency measures between distributed fusion measures of performance. Based on our prior research, our suggested performance evaluation methodology is based upon the Dual Node Network Data Fusion 82 Resource Management Architecture. Our case study involves track picture consistency across multiple airborne platforms and sensors for what we label as Tier 0, Tier 1 and Tier 2 Level 1 fusion (i.e., entity or object assessment). The highlight of the paper is a proposed approach for an overarching performance evaluation methodology for distributed Level 1 fusion that is meticulous, accounts for the complexities of the \"Track-to-Truth\" association problems, and permits the effects and interactions of various independent variables (factors) to be analyzed. This research also focuses on analyzing the measures of performances by setting up Design of Experiments. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A case study with design of experiments: Performance evaluation methodology for Level 1 distributed data fusion processes", "paper_id": "WOS:000287285600004"}