{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "translation_students'_information_literacy"}, {"score": 0.0047273577269638725, "phrase": "il-humass_survey"}, {"score": 0.004556901872357751, "phrase": "information_literacy_studies"}, {"score": 0.004208282550386197, "phrase": "individual_and_subjective_levels"}, {"score": 0.0037921662574137535, "phrase": "translation_students"}, {"score": 0.0035233696341819437, "phrase": "self-evaluating_and_specific_il-humass_survey"}, {"score": 0.002499508839669243, "phrase": "bibliographic_reference_managers"}, {"score": 0.0023221248824337576, "phrase": "database_managers"}, {"score": 0.002224510044064184, "phrase": "surveyed_population"}, {"score": 0.002197379785587054, "phrase": "autonomous_learning"}], "paper_keywords": ["information literacy", " self-assessment", " Spain", " translation students"], "paper_abstract": "In the context of information literacy studies, the research put forward in this paper is focused on the individual and subjective levels of motivation and self-efficacy, together with the sources of learning used by a population of translation students from three Spanish universities. The data were collected by means of the self-evaluating and specific IL-HUMASS survey, and are analysed using a mixed (quantitative and qualitative) case study methodology. From the 26 variables of the survey, the most and least consistent and important ones with regard to motivation and self-efficacy are detected. In general, central tendency scores regarding motivation and self-efficacy increase as respondents advance academically. The most striking opportunities for improvement emerged in relation to the following issues: using bibliographic reference managers, knowing the laws on the use of information, using database managers and communicating in other languages. The surveyed population prefer autonomous learning, with the library being a much underused source of learning.", "paper_title": "Insights into translation students' information literacy using the IL-HUMASS survey", "paper_id": "WOS:000282373900005"}