{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "brace_treatment"}, {"score": 0.004717125879761534, "phrase": "idiopathic_scoliosis"}, {"score": 0.004574100277991654, "phrase": "ais"}, {"score": 0.004481132747216135, "phrase": "three-dimensional_spinal_deformity"}, {"score": 0.0043452175611323335, "phrase": "common_non-surgical_treatment"}, {"score": 0.003982011128052839, "phrase": "braced_patient's_risk"}, {"score": 0.0038810583785936505, "phrase": "essential_part"}, {"score": 0.0038413947966606118, "phrase": "planning_treatment"}, {"score": 0.0036303546926971966, "phrase": "useful_decision_support_tool"}, {"score": 0.0027223626424366207, "phrase": "wrapper-based_feature_selection"}, {"score": 0.002533253511622532, "phrase": "logistic_regression_model"}, {"score": 0.0022738775158524793, "phrase": "logistic_regression_model's_simplicity"}], "paper_keywords": ["Scoliosis", " Prediction model", " Clinical decision support"], "paper_abstract": "Adolescent idiopathic scoliosis (AIS) is a three-dimensional spinal deformity. Brace treatment is a common non-surgical treatment, intended to prevent progression (worsening) of the condition during adolescence. Estimating a braced patient's risk of progression is an essential part of planning treatment, so method for predicting this risk would be a useful decision support tool for practitioners. This work attempts to discover whether failure of brace treatment (progression) can be predicted at the start of treatment. Records were obtained for 62 AIS patients who had completed brace treatment. Subjects were labeled as \"progressive\" if their condition had progressed despite brace treatment and \"non-progressive\" otherwise. Wrapper-based feature selection selected two useful predictor variables from a list of 14 clinical measurements taken from the records. A logistic regression model was trained to classify patients as \"progressive\" or \"non-progressive\" using these two variables. The logistic regression model's simplicity and interpretability should facilitate its clinical acceptance. The model was tested on data from an additional 28 patients and found to be 75 % accurate. This accuracy is sufficient to make the predictions clinically useful. It can be used online: http://www.ece.ualberta.ca/similar to dchalmer/SimpleBracePredictor.html", "paper_title": "Predicting success or failure of brace treatment for adolescents with idiopathic scoliosis", "paper_id": "WOS:000363252800008"}