{"auto_keywords": [{"score": 0.004709333998298903, "phrase": "large-scale_benchmark_supporting_multimodal_queries"}, {"score": 0.004555217356295278, "phrase": "important_research_direction"}, {"score": 0.004009555045206973, "phrase": "unified_large-scale_benchmark"}, {"score": 0.0033757067564871494, "phrase": "existing_benchmarks"}, {"score": 0.0033015555065209865, "phrase": "new_challenge"}, {"score": 0.003265090934183249, "phrase": "retrieval_methods"}, {"score": 0.0031933617014256676, "phrase": "generic_models"}, {"score": 0.003123203316511694, "phrase": "domain-specific_model_types"}, {"score": 0.0024732038734968567, "phrase": "eight_additional_state-of-the-art"}, {"score": 0.0023265270905455334, "phrase": "common_benchmark"}, {"score": 0.0022253345930383257, "phrase": "evaluation_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["3D shape retrieval", " Large-scale benchmark", " Multimodal queries", " Unified", " Performance evaluation", " Query-by-Model", " Query-by-Sketch", " SHREC"], "paper_abstract": "Large-scale 3D shape retrieval has become an important research direction in content-based 3D shape retrieval. To promote this research area, two Shape Retrieval Contest (SHREC) tracks on large scale comprehensive and sketch-based 3D model retrieval have been organized by us in 2014. Both tracks were based on a unified large-scale benchmark that supports multimodal queries (3D models and sketches). This benchmark contains 13680 sketches and 8987 3D models, divided into 171 distinct classes. It was compiled to be a superset of existing benchmarks and presents a new challenge to retrieval methods as it comprises generic models as well as domain-specific model types. Twelve and six distinct 3D shape retrieval methods have competed with each other in these two contests, respectively. To measure and compare the performance of the participating and other promising Query-by-Model or Query-by-Sketch 3D shape retrieval methods and to solicit state-of-the-art approaches, we perform a more comprehensive comparison of twenty-six (eighteen originally participating algorithms and eight additional state-of-the-art or new) retrieval methods by evaluating them on the common benchmark. The benchmark, results, and evaluation tools are publicly available at our websites (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A comparison of 3D shape retrieval methods based on a large-scale benchmark supporting multimodal queries", "paper_id": "WOS:000349588900002"}