{"auto_keywords": [{"score": 0.046211774964878174, "phrase": "social_tagging"}, {"score": 0.00481495049065317, "phrase": "digital_museum_catalogs"}, {"score": 0.004770211811866158, "phrase": "diverse_user_communities"}, {"score": 0.004638462976078815, "phrase": "exploratory_study"}, {"score": 0.004573953147933065, "phrase": "blobgects"}, {"score": 0.004489327204473076, "phrase": "online_museum_catalog"}, {"score": 0.004385733482617193, "phrase": "blogging_activity"}, {"score": 0.00428451995524549, "phrase": "cultural_heritage_objects"}, {"score": 0.004205226397573506, "phrase": "preeminent_museum"}, {"score": 0.0036553070575015344, "phrase": "different_\"expert\"_perspectives"}, {"score": 0.003504756881063581, "phrase": "empirical_comparison"}, {"score": 0.0034398557899818897, "phrase": "canadian"}, {"score": 0.0030319482153908037, "phrase": "museum's_catalog"}, {"score": 0.0028133741785871867, "phrase": "catalog_entries"}, {"score": 0.0027483472371835865, "phrase": "specialist_language"}, {"score": 0.002300734266971646, "phrase": "contextual_basis"}, {"score": 0.0022475295254231714, "phrase": "starting_point"}], "paper_keywords": [""], "paper_abstract": "This article presents an exploratory study of \"Blobgects,\" an experimental interface for an online museum catalog that enables social tagging and blogging activity around a set of cultural heritage objects held by a preeminent museum of anthropology and archaeology. This study attempts to understand not just whether social tagging and commenting about these objects is useful but rather whose tags and voices matter in presenting different \"expert\" perspectives around digital museum objects. Based on an empirical comparison between two different user groups (Canadian Inuit high-school students and museum studies students in the United States), we found that merely adding the ability to tag and comment to the museum's catalog does not sufficiently allow users to learn about or engage with the objects represented by catalog entries. Rather, the specialist language of the catalog provides too little contextualization for users to enter into the sort of dialog that proponents of Web 2.0 technologies promise. Overall, we propose a more nuanced application of Web 2.0 technologies within museums-one which provides a contextual basis that gives users a starting point for engagement and permits users to make sense of objects in relation to their own needs, uses, and understandings.", "paper_title": "Blobgects: Digital Museum Catalogs and Diverse User Communities", "paper_id": "WOS:000264413100003"}