{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "methane-air_explosion"}, {"score": 0.009318551086485407, "phrase": "high-velocity_wind"}, {"score": 0.006619452342622727, "phrase": "structural_opening"}, {"score": 0.005092310008152375, "phrase": "strong_wind"}, {"score": 0.0049690710001601334, "phrase": "significant_hazard"}, {"score": 0.004781378908035559, "phrase": "underground_coal_mines"}, {"score": 0.0045846424310611745, "phrase": "important_hazardous_effects"}, {"score": 0.004552648949390462, "phrase": "explosion_events"}, {"score": 0.0045208777171271254, "phrase": "coal_mines"}, {"score": 0.004396004488234064, "phrase": "premixed_area"}, {"score": 0.0042895249439546725, "phrase": "scientific_works"}, {"score": 0.0040133278382101885, "phrase": "particle_velocities"}, {"score": 0.003985305257857655, "phrase": "high-velocity_flows"}, {"score": 0.0037286231222250065, "phrase": "coal_mine"}, {"score": 0.003689628075766217, "phrase": "numerical_analysis_approach"}, {"score": 0.003676736674944852, "phrase": "shock_wave"}, {"score": 0.0036255534203424177, "phrase": "temperature_distribution"}, {"score": 0.003275093899046286, "phrase": "obtained_results"}, {"score": 0.003240826566478551, "phrase": "maximum_particle_velocity"}, {"score": 0.0030855783418239366, "phrase": "peak_value"}, {"score": 0.002989714021608139, "phrase": "peak_velocity"}, {"score": 0.0025175684590726796, "phrase": "previous_literatures"}, {"score": 0.0021049977753042253, "phrase": "methane-air_explosion_accidents"}], "paper_keywords": ["Numerical analysis", " Explosion hazard", " High-velocity wind", " Methane-air explosion"], "paper_abstract": "Purpose - The high-velocity wind caused by a methane-air explosion is one of the important hazardous effects in explosion events of coal mines, and, however, until now it has not been received much attention from scientific works. The paper aims to discuss this issue. Design/methodology/approach - In consideration of the difficulties in observing particle velocities of high-velocity flows, this work presented a study to reveal the regularity during a methane-air explosion happening in the tunnel of coal mine through the numerical analysis approach. Findings - The strong wind caused by a methane-air explosion is a significant hazard and can cause damage in the accidents of methane-air explosion in underground coal mines, especially at structural opening, according to this work. Obtained results show that maximum particle velocity of the high-velocity wind occurs in the outside region of the premixed area, with a peak value of 400 similar to 500m/s, and the peak velocity of the high-velocity wind decreases exponentially with distance beyond the premixed area. Originality/value - The objective of this work was to examine the effect of wind caused by a methane-air explosion in a tunnel. Other information, such as shock wave and flame and temperature distribution, has been reported in the previous literatures. However, in the accidents of methane-air explosion in underground coal mines, some phenomena (structural opening is destroyed badly) can not be understood by using shock wave and flame and temperature distribution caused by the explosion. The strong wind caused by a methane-air explosion is another significant hazard and can cause damage in the methane-air explosion accidents in underground coal mines, especially at structural opening, according to this work.", "paper_title": "Numerical analysis of characteristics of the wind caused by methane-air explosion", "paper_id": "WOS:000339628800007"}