{"auto_keywords": [{"score": 0.03182320197985332, "phrase": "patient-oriented_workflow_models"}, {"score": 0.010612387000973441, "phrase": "patient-centered_care"}, {"score": 0.004718897469501381, "phrase": "patient-oriented_workflow_model"}, {"score": 0.004563028873351776, "phrase": "health_information_technology"}, {"score": 0.004502141249471143, "phrase": "hit"}, {"score": 0.004209539728590977, "phrase": "patient's_perspective"}, {"score": 0.0038314621564116192, "phrase": "building_blocks"}, {"score": 0.003558294449586273, "phrase": "care_system"}, {"score": 0.003510754567808717, "phrase": "patient-oriented_workflow"}, {"score": 0.0030482430937467013, "phrase": "care_delivery"}, {"score": 0.002869115451202179, "phrase": "healthcare_work"}, {"score": 0.0025935941070969575, "phrase": "potential_value"}, {"score": 0.0022215160785078797, "phrase": "hit_implementations"}, {"score": 0.0021335427588412056, "phrase": "cooperative_work"}], "paper_keywords": [""], "paper_abstract": "Effective design of health information technology (HIT) for patient-centered care requires consideration of workflow from the patient's perspective, termed 'patient-oriented workflow.' This approach organizes the building blocks of work around the patients who are moving through the care system. Patient-oriented workflow complements the more familiar clinician-oriented workflow approaches, and offers several advantages, including the ability to capture simultaneous, cooperative work, which is essential in care delivery. Patient-oriented workflow models can also provide an understanding of healthcare work taking place in various formal and informal health settings in an integrated manner. We present two cases demonstrating the potential value of patient-oriented workflow models. Significant theoretical, methodological, and practical challenges must be met to ensure adoption of patient-oriented workflow models. Patient-oriented workflow models define meaningful system boundaries and can lead to HIT implementations that are more consistent with cooperative work and its emergent features.", "paper_title": "Patient-centered care requires a patient-oriented workflow model", "paper_id": "WOS:000319192100004"}