{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "product-related_carbon_emission_abatement_target"}, {"score": 0.04008861719846039, "phrase": "pceat"}, {"score": 0.004768012159430855, "phrase": "make-to-order_supply_chain"}, {"score": 0.004554917803750564, "phrase": "decentralized_make-to-order_supply_chain"}, {"score": 0.004365543827399888, "phrase": "product-related_carbon_emissions"}, {"score": 0.004294813202198633, "phrase": "total_emissions"}, {"score": 0.004239051185676412, "phrase": "product_manufacturing"}, {"score": 0.004211441113293312, "phrase": "retailing_processes"}, {"score": 0.004143196873246147, "phrase": "carbon_emissions"}, {"score": 0.004102780105064226, "phrase": "product_level"}, {"score": 0.004062755992847139, "phrase": "whole_supply_chain"}, {"score": 0.004023120753104693, "phrase": "compulsory_pceat"}, {"score": 0.0035999631751991385, "phrase": "stackelberg_game_models"}, {"score": 0.002948883844627217, "phrase": "carbon_emission_abatement_limits"}, {"score": 0.0025202582748972122, "phrase": "abatement_limits"}, {"score": 0.0022845366011378238, "phrase": "remaining_part"}, {"score": 0.002139742163351676, "phrase": "pceat."}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Make-to-order (MTO) supply chain", " Product-related carbon emission abatement target (PCEAT)", " Allocation", " Stackelberg game", " Carbon emission abatement limit"], "paper_abstract": "This paper investigates the product-related carbon emission abatement target (PCEAT) allocation problem in a decentralized make-to-order supply chain, which is composed of a manufacturer and a retailer. The product-related carbon emissions here refer to the total emissions generated from the product manufacturing and retailing processes. To effectively reduce carbon emissions on the product level in the whole supply chain, a compulsory PCEAT is imposed on each unit of product. The problem is how to allocate the PCEAT between the manufacturer and the retailer, where the allocator can be either firm. We use Stackelberg game models to solve this problem by considering the following four scenarios: (1) the manufacturer is the leader and the allocator; (2) the manufacturer is the follower and the allocator; (3) the retailer is the follower and the allocator; and (4) the retailer is the leader and the allocator. Ignoring the carbon emission abatement limits of firms, it is found that if the leader is the allocator, the proportions of the PCEAT allocated to the two participators are determined by their marginal abatement costs. If the follower is the allocator, the PCEAT will be completely allocated to the leader. When the abatement limits of firms are taken into consideration, the firm constrained by the limit will undertake the portion of PCEAT up to its limit; while the other firm should undertake the remaining part. In any case, we find that it is always not bad to let the leader allocate the PCEAT. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Allocation of product-related carbon emission abatement target in a make-to-order supply chain", "paper_id": "WOS:000349591400017"}