{"auto_keywords": [{"score": 0.04367956453554006, "phrase": "perceptual_aliasing_problems"}, {"score": 0.00481495049065317, "phrase": "non-markov_problems"}, {"score": 0.004752873752686246, "phrase": "automated_design"}, {"score": 0.004651177631663439, "phrase": "software_agents"}, {"score": 0.0045124316982387315, "phrase": "important_class"}, {"score": 0.004415857432588371, "phrase": "information_sciences"}, {"score": 0.004049709080817396, "phrase": "evolutionary_and_adaptive_approaches"}, {"score": 0.003510507340837656, "phrase": "learning_classifier_systems"}, {"score": 0.0033039560332995136, "phrase": "indirect_encoding_genetic_algorithm"}, {"score": 0.003261295948815592, "phrase": "augmented_transition_network_controllers"}, {"score": 0.003163878786694538, "phrase": "different_learning_classifier_systems"}, {"score": 0.002913837945508097, "phrase": "anticipatory_learning_classifier_system"}, {"score": 0.0027781870000242004, "phrase": "explicit_internal_state_management_mechanism"}, {"score": 0.0027068691342344545, "phrase": "rule-chaining_mechanism"}, {"score": 0.0024713335323674223, "phrase": "respective_properties"}, {"score": 0.0024078737745407614, "phrase": "xcsm"}, {"score": 0.0023870856365539195, "phrase": "acs."}, {"score": 0.0021325651192326016, "phrase": "atnosferes"}, {"score": 0.0021049977753042253, "phrase": "powerful_framework"}], "paper_keywords": ["Evolutionary algorithms", " Perceptual aliasing", " Augmented transition networks", " Learning Classifier Systems"], "paper_abstract": "The automated design of the controller of software agents embedded in an environment is an important class of problems addressed in information sciences. In that class of problems, the case where agents face perceptual aliasing problems is particularly difficult. Within the evolutionary and adaptive approaches to controller design, there are several families of systems capable of dealing with such problems. This paper is devoted to a comparison of the way perceptual aliasing problems are solved by one family, namely Learning Classifier Systems, compared to our own model, ATNoSFERES. We present this model based on an indirect encoding Genetic Algorithm which builds Augmented Transition Network controllers, and we compare it with different Learning Classifier Systems, namely XCSM (a memory-based extension of the most studied Learning Classifier System, XCS) and ACS (an Anticipatory Learning Classifier System). To solve perceptual aliasing problems, the first uses an explicit internal state management mechanism while the second uses a rule-chaining mechanism. To carry out our comparison, we apply these systems to three different benchmark experiments. Our results raise a discussion of the respective properties of the mechanisms used by XCSM and ACS. Then we show that ATNoSFERES is endowed with enough expressive power to represent the mechanisms used by the other two systems to deal with perceptual aliasing problems. We conclude that ATNoSFERES provides a powerful framework to deal with such problems. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "A comparison between ATNoSFERES and Learning Classifier Systems on non-Markov problems", "paper_id": "WOS:000260712200006"}