{"auto_keywords": [{"score": 0.04953289560992989, "phrase": "protein_classification"}, {"score": 0.00481495049065317, "phrase": "protein_motif_discovery"}, {"score": 0.004171402455813099, "phrase": "common_biological_functions"}, {"score": 0.004053362743156545, "phrase": "mahatma-memetic_algorithm-based_highly_adapted_tool"}, {"score": 0.0036763623220059933, "phrase": "amino_acids"}, {"score": 0.00307657476125683, "phrase": "unknown_proteins"}, {"score": 0.002664749302333897, "phrase": "heuristic_method"}, {"score": 0.0025892330566358503, "phrase": "genetic_programming"}, {"score": 0.002487083025913648, "phrase": "target_problem"}, {"score": 0.002444544487772349, "phrase": "final_performance"}, {"score": 0.0022815262950738814, "phrase": "best_results"}, {"score": 0.002166421738415464, "phrase": "proposed_evolutionary_computation_method"}, {"score": 0.0021049977753042253, "phrase": "predictive_features"}], "paper_keywords": ["Evolutionary algorithms", " Genetic programming", " Data mining", " Proteins patterns discovery"], "paper_abstract": "Proteins can be grouped into families according to some features such as hydrophobicity, composition or structure, aiming to establish common biological functions. This paper presents MAHATMA-memetic algorithm-based highly adapted tool for motif ascertainment-a system that was conceived to discover features (particular sequences of amino acids, or motifs) that occur very often in proteins of a given family but rarely occur in proteins of other families. These features can be used for the classification of unknown proteins, that is, to predict their function by analyzing their primary structure. Experiments were done with a set of enzymes extracted from the Protein Data Bank. The heuristic method used was based on genetic programming using operators specially tailored for the target problem. The final performance was measured using sensitivity, specificity and hit rate. The best results obtained for the enzyme dataset suggest that the proposed evolutionary computation method is effective in finding predictive features (motifs) for protein classification.", "paper_title": "A genetic programming method for protein motif discovery and protein classification", "paper_id": "WOS:000294840100003"}