{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "signature_policies"}, {"score": 0.004192078165260057, "phrase": "purchase_transaction"}, {"score": 0.003996458454723708, "phrase": "sensitive_information"}, {"score": 0.0031466527290980686, "phrase": "new_fair_exchange_protocol"}, {"score": 0.0030285084113651035, "phrase": "signature_policy"}, {"score": 0.002887028262617443, "phrase": "electronic_signatures"}, {"score": 0.0028187792953857957, "phrase": "electronic_signature"}, {"score": 0.002699960312990493, "phrase": "particular_transaction_context"}, {"score": 0.00263612191603326, "phrase": "signature_policy-based_design"}, {"score": 0.0023388183537341213, "phrase": "user's_confidence"}, {"score": 0.002166349705365602, "phrase": "implementation_guidelines"}, {"score": 0.0021049977753042253, "phrase": "consideration_latest_security_standards"}], "paper_keywords": ["Security", " E-commerce", " Non-repudiation", " Fair exchange", " Electronic signature", " Digital signature", " Signature policy", " PKI", " Standards"], "paper_abstract": "The growth of the e-commerce has allowed companies and individuals to sell and purchase almost any kind of product and service through the Internet. However, during the purchase transaction there is a moment during which the seller has sensitive information from the buyer, typically his/her credit card information, while the buyer has nothing from the seller. This situation clearly places the buyer at disadvantage and is, together with fear of fraud, one of the reasons of the lack of confidence in e-commerce. For resolving this situation a new fair exchange protocol based on signature policies is presented. A signature policy is a set of rules to create and validate electronic signatures, under which an electronic signature can be determined to be valid in a particular transaction context. Due to the signature policy-based design, the proposed protocol allows the buyer to decide if trust or not in the rules that will manage the transaction, increasing the user's confidence in e-commerce. Security, fairness and timeliness characteristics of the protocol are evaluated. Implementation guidelines are also provided taking into consideration latest security standards. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "An optimistic fair exchange protocol based on signature policies", "paper_id": "WOS:000261635200008"}