{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "domain_representations"}, {"score": 0.009875168160386619, "phrase": "basic_properties"}, {"score": 0.004774115617883476, "phrase": "cantor-weihrauch_domain_representations"}, {"score": 0.0045556080393342165, "phrase": "topological_spaces"}, {"score": 0.0038090874465452214, "phrase": "equivalence_relation"}, {"score": 0.003512702405367876, "phrase": "equivalent_representations"}, {"score": 0.003394891095032025, "phrase": "represented_space"}, {"score": 0.002924074850256874, "phrase": "weihrauch's_tte"}, {"score": 0.002886885861509621, "phrase": "universality_concepts"}, {"score": 0.002850168497994985, "phrase": "appropriate_spectra"}, {"score": 0.0028139168128067343, "phrase": "tte_representations"}, {"score": 0.002754516260621121, "phrase": "reduction_notion"}, {"score": 0.0027078974645805736, "phrase": "natural_generalisation"}, {"score": 0.0026507289852980512, "phrase": "tte."}, {"score": 0.0025291601927956765, "phrase": "real_numbers"}, {"score": 0.002475755804232436, "phrase": "usual_interval_domain_representation"}, {"score": 0.002413153346716919, "phrase": "dense_representations"}, {"score": 0.0022062235065459274, "phrase": "interval_domain"}, {"score": 0.0021688641066186817, "phrase": "efficient_computation"}, {"score": 0.0021049977753042253, "phrase": "usual_interval_domain"}], "paper_keywords": [""], "paper_abstract": "We introduce a notion of reducibility of representations of topological spaces and study some basic properties of this notion for domain representations. A representation reduces to another if its representing map factors through the other representation. Reductions form a pre-order on representations. A spectrum is a class of representations divided by the equivalence relation induced by reductions. We establish some basic properties of spectra, such as, non-triviality. Equivalent representations represent the same set of functions on the represented space. Within a class of representations, a representation is universal if all representations in the class reduce to it. We show that notions of admissibility, considered both for domains and within Weihrauch's TTE, are universality concepts in the appropriate spectra. Viewing TTE representations as domain representations, the reduction notion here is a natural generalisation of the one from TTE. To illustrate the framework, we consider some domain representations of real numbers and show that the usual interval domain representation, which is universal among dense representations, does not reduce to various Cantor domain representations. On the other hand, however, we show that a substructure of the interval domain more suitable for efficient computation of operations is equivalent to the usual interval domain with respect to reducibility.", "paper_title": "Reducibility of domain representations and Cantor-Weihrauch domain representations", "paper_id": "WOS:000261849500002"}