{"auto_keywords": [{"score": 0.04969089536874817, "phrase": "e-government_systems"}, {"score": 0.019560080242997557, "phrase": "business_value_creation"}, {"score": 0.012421384716028864, "phrase": "organizational_assimilation"}, {"score": 0.004493045859210086, "phrase": "digital_future"}, {"score": 0.0044025116437190785, "phrase": "information_system_applications"}, {"score": 0.004244102948402086, "phrase": "potentially_formidable_challenge"}, {"score": 0.004025258572860201, "phrase": "significant_investments"}, {"score": 0.0036503460615862574, "phrase": "theoretical_model"}, {"score": 0.003605997900398767, "phrase": "structuration_theory"}, {"score": 0.0035332741328861776, "phrase": "organizational_information_systems_assimilation"}, {"score": 0.0031522185379771056, "phrase": "organizational_meta-structures"}, {"score": 0.0030139837612215728, "phrase": "organizational_e-government_systems_assimilation_behavior"}, {"score": 0.002777949746964955, "phrase": "public_organizations"}, {"score": 0.0027330029055210926, "phrase": "e-governmental_system"}, {"score": 0.0026560841114619147, "phrase": "proposed_model"}, {"score": 0.002623783458189614, "phrase": "new_light"}, {"score": 0.002359759876402679, "phrase": "e-government_system"}, {"score": 0.0022561982694417116, "phrase": "substantial_impact"}, {"score": 0.0021748483128942687, "phrase": "theoretical_and_practical_implications"}], "paper_keywords": ["Assimilation", " Domination", " E-government systems", " Empirical research", " IT value", " Legitimization", " Organizational issues", " Signification", " Structuration theory", " Organizational meta-structure"], "paper_abstract": "Governments worldwide are eagerly anticipating a digital future with the proliferation of information system applications, but assimilation of such enterprises could be a potentially formidable challenge. Assimilation of e-government systems by organizations is important for business value creation. Despite significant investments in e-government systems, the extent to which organizations have been able to assimilate and leverage these systems varies widely. We develop a theoretical model grounded upon structuration theory and the literature on organizational information systems assimilation to investigate the impact of organizational assimilation of e-government systems on business value creation by conceptualizing the notions of IS in organizations. Based on our model, we argue that the organizational meta-structures of signification, domination, and legitimization determine aspects of organizational e-government systems assimilation behavior that may affect its value creation potential. We experimentally validate our model using a total of 367 surveys collected from public organizations currently utilizing an e-governmental system. Our results largely support the proposed model and shed new light on the factors associated with organizational assimilation of e-government systems. Finally, we isolate the organizational, technological, and inter-organizational factors that shape the meta-structures for the assimilation of e-government system. Our findings indicate that assimilation of e-government systems has a substantial impact on business value creation. We conclude by discussing the theoretical and practical implications of our findings. (C) 2010 Elsevier B. V. All rights reserved.", "paper_title": "Impacts of organizational assimilation of e-government systems on business value creation: A structuration theory approach", "paper_id": "WOS:000296534700008"}