{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "inverse_function"}, {"score": 0.015597276351907441, "phrase": "block_ciphers"}, {"score": 0.014143764094793723, "phrase": "high_nonlinearity"}, {"score": 0.008555046152787984, "phrase": "quadratic_functions"}, {"score": 0.004739416327250269, "phrase": "substitution_boxes"}, {"score": 0.004361792415184563, "phrase": "low_differential_uniformity"}, {"score": 0.004293336465549723, "phrase": "algebraic_degree"}, {"score": 0.0038584250641318057, "phrase": "even_number"}, {"score": 0.003650488388949457, "phrase": "substitution-permutation_network"}, {"score": 0.0034674164050273568, "phrase": "apn_bijections"}, {"score": 0.0033860360186761533, "phrase": "big_open_problem"}, {"score": 0.0033328427701162368, "phrase": "present_paper"}, {"score": 0.002971309306027602, "phrase": "large_number"}, {"score": 0.0029246121262946384, "phrase": "maximum_algebraic_degree"}, {"score": 0.0027126012542151015, "phrase": "constructed_class"}, {"score": 0.002556109032208553, "phrase": "first_mathematical_proof"}, {"score": 0.0024960634897058394, "phrase": "infinite_class"}, {"score": 0.0021471293746360026, "phrase": "improved_lower_bounds"}], "paper_keywords": ["Block cipher", " Substitution box", " Differentially 4-uniform bijection", " CCZ-equivalence", " Nonlinearity"], "paper_abstract": "Block ciphers use substitution boxes (S-boxes) whose aim is to create confusion into the cryptosystems. Functions used as S-boxes should have low differential uniformity, high nonlinearity and algebraic degree larger than 3 (preferably strictly larger). They should be fastly computable; from this viewpoint, it is better when they are in even number of variables. In addition, the functions should be bijections in a substitution-permutation network. Almost perfect nonlinear (APN) functions have the lowest differential uniformity 2 and the existence of APN bijections over for even is a big open problem. In the present paper, we focus on constructing differentially 4-uniform bijections suitable for designing S-boxes for block ciphers. Based on the idea of permuting the inverse function, we design a construction providing a large number of differentially 4-uniform bijections with maximum algebraic degree and high nonlinearity. For every even , we mathematically prove that the functions in a subclass of the constructed class are CCZ-inequivalent to known differentially 4-uniform power functions and to quadratic functions. This is the first mathematical proof that the functions in an infinite class of differentially 4-uniform bijections are CCZ-inequivalent to known differentially 4-uniform power functions and to quadratic functions. We also get a naive lower bound on the nonlinearity of our functions, which can be very high in some cases, and obtain improved lower bounds on the nonlinearity for three special subcases of functions which are extremely large.", "paper_title": "Differentially 4-uniform bijections by permuting the inverse function", "paper_id": "WOS:000360509600006"}