{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "upper_ontologies"}, {"score": 0.0068286435688040175, "phrase": "sumo-owl"}, {"score": 0.006574925924707417, "phrase": "opencyc"}, {"score": 0.004694700982410345, "phrase": "ontology_matching"}, {"score": 0.004481954307639453, "phrase": "different_ontologies"}, {"score": 0.004242868712089958, "phrase": "semantic_bridges"}, {"score": 0.004189523950071494, "phrase": "ontology_matching_process"}, {"score": 0.0041194351307673556, "phrase": "systematic_analysis"}, {"score": 0.003999578057088828, "phrase": "matched_ontologies"}, {"score": 0.003949280009382125, "phrase": "simple_and_composite_concepts"}, {"score": 0.0038343546245999285, "phrase": "top_level"}, {"score": 0.0037861710566706747, "phrase": "english"}, {"score": 0.0035240305920962796, "phrase": "experiment_results"}, {"score": 0.003378201714843281, "phrase": "structural_alignment"}, {"score": 0.0032938942910948096, "phrase": "significant_advantages"}, {"score": 0.0032387402145603412, "phrase": "traditional_approaches"}, {"score": 0.003014423621229936, "phrase": "sumo"}, {"score": 0.002939007076062123, "phrase": "dolce."}, {"score": 0.0027819985260847577, "phrase": "upper_ontology"}, {"score": 0.0021049977753042253, "phrase": "used_upper_ontology"}], "paper_keywords": ["Ontology matching", " upper ontology"], "paper_abstract": "Ontology matching is the process of finding correspondences between entities belonging to different ontologies. This paper describes a set of algorithms that exploit upper ontologies as semantic bridges in the ontology matching process and presents a systematic analysis of the relationships among features of matched ontologies (number of simple and composite concepts, stems, concepts at the top level, common English suffixes and prefixes, and ontology depth), matching algorithms, used upper ontologies, and experiment results. This analysis allowed us to state under which circumstances the exploitation of upper ontologies gives significant advantages with respect to traditional approaches that do no use them. We run experiments with SUMO-OWL (a restricted version of SUMO), OpenCyc, and DOLCE. The experiments demonstrate that when our \"structural matching method via upper ontology\" uses an upper ontology large enough (OpenCyc, SUMO-OWL), the recall is significantly improved while preserving the precision obtained without upper ontologies. Instead, our \"nonstructural matching method\" via OpenCyc and SUMO-OWL improves the precision and maintains the recall. The \"mixed method\" that combines the results of structural alignment without using upper ontologies and structural alignment via upper ontologies improves the recall and maintains the F-measure independently of the used upper ontology.", "paper_title": "Automatic Ontology Matching via Upper Ontologies: A Systematic Evaluation", "paper_id": "WOS:000275652400001"}