{"auto_keywords": [{"score": 0.029843544522593482, "phrase": "university_centre"}, {"score": 0.00481495049065317, "phrase": "personalized_models"}, {"score": 0.004786821283037044, "phrase": "different_university_degrees"}, {"score": 0.004422720016422297, "phrase": "granada"}, {"score": 0.004396858397567621, "phrase": "south_of_spain"}, {"score": 0.0041586840496756474, "phrase": "economic_sciences"}, {"score": 0.0038647641000798135, "phrase": "logistic_regression"}, {"score": 0.0037201996003549246, "phrase": "framework_data"}, {"score": 0.0030563268358422503, "phrase": "weak_educational_strategies"}, {"score": 0.002967931416941965, "phrase": "low_academic_performance"}, {"score": 0.002950560605386499, "phrase": "low_success_rates"}, {"score": 0.0029075757820516634, "phrase": "high_risk"}, {"score": 0.002790511479398411, "phrase": "similar_models"}, {"score": 0.0027579362569638945, "phrase": "particular_action_plan"}, {"score": 0.0024451427672857458, "phrase": "general_methodology"}, {"score": 0.002416589459425828, "phrase": "data_warehouse_architecture"}, {"score": 0.0022192891418394514, "phrase": "usual_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Drop out", " Data Warehouse", " Evaluation methodologies", " Country-specific developments", " Innovation"], "paper_abstract": "This paper develops personalized models for different university degrees to obtain the risk of each student abandoning his degree and analyzes the profile for undergraduates that abandon the degree. In this study three faculties located in Granada, South of Spain, were involved. In Software Engineering three university degrees with 10,844 students, in humanities nineteen university degrees with 39,241 students and in Economic Sciences five university degrees with 25,745 students were considered. Data, corresponding to the period 1992 onwards, are used to obtain a model of logistic regression for each faculty which represents them satisfactorily. These models and the framework data show that certain variables appear repeatedly in the explanation of the drop out in all of the faculties. These variables are, among others, start age, the father's and mother's studies, academic performance, success, average mark in the degree and the access form and in some cases also, the number of rounds needed to pass. Students with weak educational strategies and without persistence to achieve their aims in life have low academic performance and low success rates and this implies a high risk of abandoning the degree. The results suggest that each university centre could consider similar models to elaborate a particular action plan to help lower the drop out rate reducing costs and efforts. As concluded in this paper, the profile of the students who tend to abandon their studies is dependent on the subject studied. For this reason, a general methodology based on a Data Warehouse architecture is proposed. This architecture does most of the work automatically and is general enough to be used at any university centre because it only takes into account the usual data the students provide when registered in a course and their grades throughout the years. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Factors influencing university drop out rates", "paper_id": "WOS:000269069200003"}