{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evidential_reasoning"}, {"score": 0.04789396098417503, "phrase": "evidence_space"}, {"score": 0.03826559283990352, "phrase": "dichotomous_structure"}, {"score": 0.0047702273993009085, "phrase": "linear-time"}, {"score": 0.004747997855358171, "phrase": "computational_techniques"}, {"score": 0.004468415400599571, "phrase": "multiple_pieces"}, {"score": 0.004385733482617193, "phrase": "dempster's_rule"}, {"score": 0.003939033374807842, "phrase": "computation-intensive_calculations"}, {"score": 0.0037242701420971062, "phrase": "orthogonal_sum"}, {"score": 0.003689628075766217, "phrase": "evidential_functions"}, {"score": 0.0033761303704612734, "phrase": "novel_evidence_structure"}, {"score": 0.0029069972482610403, "phrase": "trivial_evidential_elements"}, {"score": 0.0028664985822266344, "phrase": "important_ones"}, {"score": 0.0025264171945423254, "phrase": "basic_probability_assignment"}, {"score": 0.0023662411481713682, "phrase": "general_formulae"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Linear-time computational techniques based on the structure of an evidence space have been developed for combining multiple pieces of evidence using Dempster's rule (orthogonal sum), which is available on a number of contending hypotheses. They offer a means of making the computation-intensive calculations involved more efficient in certain circumstances. Unfortunately, they restrict the orthogonal sum of evidential functions to the dichotomous structure that applies only to elements and their complements. In this paper, we present a novel evidence structure in terms of a triplet and a set of algorithms for evidential reasoning. The merit of this structure is that it divides a set of evidence into three subsets, distinguishing the trivial evidential elements from the important ones-focusing particularly on some elements of an evidence space. It avoids the deficits of the dichotomous structure in representing the preference of evidence and estimating the basic probability assignment of evidence. We have established a formalism for this structure and the general formulae for combining pieces of evidence in the form of the triplet, which have been theoretically and empirically justified. (C) 2008 Wiley Periodicals, Inc.", "paper_title": "An efficient triplet-based algorithm for evidential reasoning", "paper_id": "WOS:000254221300005"}