{"auto_keywords": [{"score": 0.042309036047671555, "phrase": "high_probability"}, {"score": 0.015719716506582538, "phrase": "radio_networks"}, {"score": 0.015637064710575497, "phrase": "unknown_topology"}, {"score": 0.013849889734738578, "phrase": "n-node_radio_network"}, {"score": 0.012427688485861628, "phrase": "randomized_algorithm"}, {"score": 0.010081982235083085, "phrase": "broadcasting_time"}, {"score": 0.004700833606836244, "phrase": "new_randomized_and_deterministic_algorithms"}, {"score": 0.004528646311967683, "phrase": "directed_n-node_radio_networks"}, {"score": 0.004327981760540394, "phrase": "bar-yehuda_et_al"}, {"score": 0.0038797111674544935, "phrase": "kushilevitz"}, {"score": 0.003859076500390117, "phrase": "mansour"}, {"score": 0.0038385317554884713, "phrase": "alon_et_al"}, {"score": 0.003571751184289622, "phrase": "upper_bound"}, {"score": 0.0035244144308073174, "phrase": "optimal_randomized_broadcasting_algorithm"}, {"score": 0.0032272929113113203, "phrase": "main_source"}, {"score": 0.0031845067058084613, "phrase": "better_\"selecting_sequence"}, {"score": 0.003108911488613549, "phrase": "stronger_property"}, {"score": 0.0029159568444629053, "phrase": "randomized_sequence"}, {"score": 0.0028315560662729353, "phrase": "randomized_and_deterministic_sequences"}, {"score": 0.0027131212233443137, "phrase": "deterministic_broadcasting"}, {"score": 0.0026771333996253783, "phrase": "deterministic_oblivious_algorithm"}, {"score": 0.002572001496778222, "phrase": "best_known_algorithms"}, {"score": 0.002531111001325683, "phrase": "fastest_previously_known_algorithm"}, {"score": 0.0023361832548454207, "phrase": "natural_extension"}, {"score": 0.0022264921356494357, "phrase": "d._finally"}, {"score": 0.002156234973249081, "phrase": "randomized_complexity"}, {"score": 0.0021390191069313945, "phrase": "gossiping_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "In this paper we present new randomized and deterministic algorithms for the classical problem of broadcasting in radio networks with unknown topology. We consider directed n-node radio networks with specified eccentricity D (maximum distance from the source node to any other node). Bar-Yehuda et al. presented an algorithm that for any n-node radio network with eccentricity D completes the broadcasting in O(D log n + log(2) n) time, with high probability. This result is almost optimal, since as it has been shown by Kushilevitz and Mansour and Alon et al., every randomized algorithm requires Omega (D log(n/D) + log(2) n) expected time to complete broadcasting. Our first main result closes the gap between the lower and upper bound: we describe an optimal randomized broadcasting algorithm whose running time complexity is O(D log(n/D) + log2 n), with high probability. In particular, we obtain a randomized algorithm that completes broadcasting in any n-node radio network in time O(n), with high probability. The main source of our improvement is a better \"selecting sequence\" used by the algorithm that brings some stronger property and improves the broadcasting time. Two types of \"selecting sequences\" are considered: randomized and deterministic ones. The algorithm with a randomized sequence is easier (more intuitive) to analyze but both randomized and deterministic sequences give algorithms of the same asymptotic complexity. Next, we demonstrate how to apply our approach to deterministic broadcasting, and describe a deterministic oblivious algorithm that completes broadcasting in time O(n log(2) D), which improves upon best known algorithms in this case. The fastest previously known algorithm had the broadcasting time of 0 (n log n log D), it was non-oblivious and significantly more complicated; our algorithm can be seen as a natural extension of our randomized algorithm. In this part of the paper we assume that each node knows the eccentricity D. Finally, we show how our randomized broadcasting algorithm can be used to improve the randomized complexity of the gossiping problem. (c) 2004 Elsevier Inc. All rights reserved.", "paper_title": "Broadcasting algorithms in radio networks with unknown topology", "paper_id": "WOS:000238961800002"}