{"auto_keywords": [{"score": 0.046577269805750374, "phrase": "original_packets"}, {"score": 0.037694919794756004, "phrase": "coded_packets"}, {"score": 0.012502081636400854, "phrase": "uploading_phase"}, {"score": 0.012408405928538221, "phrase": "downloading_phase"}, {"score": 0.00481495049065317, "phrase": "relay-based_cooperative_data_exchange_with_network_coding"}, {"score": 0.004184825434585617, "phrase": "traditional_cooperative_data_exchange"}, {"score": 0.003923532450854754, "phrase": "data_exchange"}, {"score": 0.0033967510986397946, "phrase": "received_packets"}, {"score": 0.0033455764382772754, "phrase": "reencoded_packets"}, {"score": 0.0030311679447397725, "phrase": "minimum_total_transmission_delay"}, {"score": 0.002735816302446788, "phrase": "different_clients"}, {"score": 0.0025260919226344305, "phrase": "coding_scheme"}, {"score": 0.002488001663771768, "phrase": "minimum_total_delay"}, {"score": 0.0024043803470189455, "phrase": "polynomial_time"}, {"score": 0.0023771343615901185, "phrase": "sufficiently_large_underlying_fields"}, {"score": 0.0023235629819760018, "phrase": "heuristic_algorithm"}, {"score": 0.002288519595829552, "phrase": "low_complexity"}, {"score": 0.0022711961447468114, "phrase": "binary_field_size"}, {"score": 0.0021948455916770233, "phrase": "binary_solution"}, {"score": 0.0021291312714904957, "phrase": "optimal_solution"}, {"score": 0.0021049977753042253, "phrase": "coding_schemes"}], "paper_keywords": ["Cooperative data exchange", " multicast", " network coding", " transmission delay"], "paper_abstract": "We study the Relay-based Cooperative Data Exchange (RCDE) problem, where initially each client has access to a subset of a set of original packets, referred to as their side information, and wants to retrieve all other original packets via cooperation. Unlike traditional Cooperative Data Exchange (CDE), in our proposed relay-based model, clients can only cooperate via a relay. The data exchange is completed over two phases, namely Uploading Phase and Downloading Phase. In the Uploading Phase, the clients will encode the original packets and transmit the coded packets to the relay. In the Downloading Phase, the relay will reencode the received packets and multicast the reencoded packets, each to a subgroup of clients. The coded packets in the two phases are carefully selected so that each client can retrieve all original packets with minimum total transmission delay, based on its initial side information and on the coded packets it receives from the relay. In addition, we assume that the bandwidths between the relay and different clients are different, and that the upload/download bandwidths between the relay and the same client are also different. We establish a coding scheme that has the minimum total delay and show that it can be found in polynomial time, for sufficiently large underlying fields. We also design a heuristic algorithm that has a low complexity with binary field size. Our simulations show that the performance of the binary solution is very close to that of the optimal solution. All coding schemes considered in this work are scalar.", "paper_title": "Delay Minimization for Relay-Based Cooperative Data Exchange With Network Coding", "paper_id": "WOS:000367100900015"}