{"auto_keywords": [{"score": 0.03987218711500845, "phrase": "opinionated_content"}, {"score": 0.0338821974952083, "phrase": "user's_preferences"}, {"score": 0.026240746050673613, "phrase": "standard_text_retrieval_models"}, {"score": 0.004720606036240263, "phrase": "rapid_growth"}, {"score": 0.004109770306454165, "phrase": "interesting_entities"}, {"score": 0.003371220210416809, "phrase": "different_way"}, {"score": 0.0032724821705972357, "phrase": "directly_ranking_entities"}, {"score": 0.0029199689963238726, "phrase": "user's_keyword_query"}, {"score": 0.002862648127577722, "phrase": "desired_features"}, {"score": 0.0023710856920150574, "phrase": "experiment_results"}, {"score": 0.0023476849595393872, "phrase": "ranking_entities"}, {"score": 0.0021902063413831545, "phrase": "proposed_extensions"}, {"score": 0.0021049977753042253, "phrase": "ranking_accuracy"}], "paper_keywords": ["Opinion matching", " Entity oriented search", " Preference based entity search", " Product search", " Vertical search", " Ad-hoc faceted navigation"], "paper_abstract": "The deployment of Web 2.0 technologies has led to rapid growth of various opinions and reviews on the web, such as reviews on products and opinions about people. Such content can be very useful to help people find interesting entities like products, businesses and people based on their individual preferences or tradeoffs. Most existing work on leveraging opinionated content has focused on integrating and summarizing opinions on entities to help users better digest all the opinions. In this paper, we propose a different way of leveraging opinionated content, by directly ranking entities based on a user's preferences. Our idea is to represent each entity with the text of all the reviews of that entity. Given a user's keyword query that expresses the desired features of an entity, we can then rank all the candidate entities based on how well opinions on these entities match the user's preferences. We study several methods for solving this problem, including both standard text retrieval models and some extensions of these models. Experiment results on ranking entities based on opinions in two different domains (hotels and cars) show that the proposed extensions are effective and lead to improvement of ranking accuracy over the standard text retrieval models for this task.", "paper_title": "Opinion-based entity ranking", "paper_id": "WOS:000301979100002"}