{"auto_keywords": [{"score": 0.04895586541793085, "phrase": "transport_vehicles"}, {"score": 0.00481495049065317, "phrase": "dynamic_transport_problem"}, {"score": 0.0047468516620285525, "phrase": "scheduling_problem"}, {"score": 0.00459165923324494, "phrase": "important_issues"}, {"score": 0.004316722156877335, "phrase": "high_profitability"}, {"score": 0.004077508669922702, "phrase": "optimal_solution"}, {"score": 0.0036207206487324506, "phrase": "near-optimal_solution"}, {"score": 0.003569451476205552, "phrase": "practical_way"}, {"score": 0.0034690732089830045, "phrase": "low_calculation_cost"}, {"score": 0.003307988966112615, "phrase": "range_constraints"}, {"score": 0.003261133560558666, "phrase": "optimization_problem"}, {"score": 0.0025954008219792337, "phrase": "indexing_tree"}, {"score": 0.0022608057001451414, "phrase": "group_size"}, {"score": 0.0022287497627555895, "phrase": "update_interval"}], "paper_keywords": [""], "paper_abstract": "The scheduling problem of transport vehicles is one of the important issues in our international society. Such a problem should be solved optimally and instantaneously to keep high profitability and conveniency. However, it is hard to find an optimal solution in such a transport problem because transport requests occur constantly and the optimal solution changes according to the requests. Therefore, the strategy to find a near-optimal solution is a practical way to solve the problem at low calculation cost. In this paper, we focus on the range constraints of the optimization problem. The assignment of requests is optimized by request, exchange between transport vehicles in their belonging group (i.e., range constraint) to keep the calculation cost low. The group of transport vehicles should be dynamically changed on the basis of their positions. Hence, we introduce an indexing tree called R-Tree and reconstruct the tree in certain intervals to index moving transport vehicles dynamically. In the last of this paper, we report the influence of group size and the update interval on the performance of transport vehicles and then show the effectiveness of our optimization algorithm.", "paper_title": "R-Tree based optimization algorithm for dynamic transport problem", "paper_id": "WOS:000242122600139"}