{"auto_keywords": [{"score": 0.042369356770580104, "phrase": "social_media"}, {"score": 0.01479738224260714, "phrase": "twitter"}, {"score": 0.012485029522431388, "phrase": "traditional_print_media_coverage"}, {"score": 0.012111589405122868, "phrase": "election-related_tweets"}, {"score": 0.008934479356259873, "phrase": "print_media"}, {"score": 0.00481495049065317, "phrase": "print_coverage"}, {"score": 0.004556998332078939, "phrase": "facebook"}, {"score": 0.0044876999096555535, "phrase": "tumblr"}, {"score": 0.004339108074589307, "phrase": "increasing_role"}, {"score": 0.004312622975366676, "phrase": "social_movements"}, {"score": 0.004247112325475329, "phrase": "everyday_life"}, {"score": 0.0041825926310470616, "phrase": "social_science"}, {"score": 0.0035777568441311292, "phrase": "political_news"}, {"score": 0.003438058620195309, "phrase": "print_journalism"}, {"score": 0.0031845067058084583, "phrase": "major_events"}, {"score": 0.0030135741897058844, "phrase": "new_york_times"}, {"score": 0.002860546817196148, "phrase": "candidate-related_geolocated_tweets"}, {"score": 0.002834379324454571, "phrase": "american"}, {"score": 0.0026011706232569316, "phrase": "weak_relationship"}, {"score": 0.0025148871904409095, "phrase": "large_presence"}, {"score": 0.0023435920614377306, "phrase": "stronger_influence"}, {"score": 0.002137537770621167, "phrase": "twitter's_role"}, {"score": 0.0021179540310789446, "phrase": "key_space"}, {"score": 0.0021049977753042253, "phrase": "news_production"}], "paper_keywords": ["Twitter", " elections", " print media", " sentiment", " newspapers", " 2012 Republican primary"], "paper_abstract": "Social media platforms, including Facebook, Twitter, and Tumblr, have become more ubiquitous. They have had an increasing role in social movements, elections, and everyday life around the world. Social science is well positioned to explore the power and influence of social media economically, politically, and socially. This article is particularly interested in evaluating whether the sentiment of traditional print media coverage during elections has any relationship to the frequency of election-related tweets. Though television is perhaps more influential in terms of political news, social media is often used to retweet or comment on articles from print journalism. Also, though we increasingly consume news from social media, we often do not think of how opinions are converging or diverging during major events. This article specifically explores the case of the 2011-2012 U.S. Republican primaries. Ninety-nine randomly selected articles from the New York Times, the Wall Street Journal, and the Washington Post covering Republican primary debates were hand coded for sentiment and compared with the frequency and sentiment of candidate-related geolocated tweets from urban American users. We also explored briefly whether there is any relationship between print media and tweet sentiment. Overall, the newspapers sampled as a whole had a weak relationship to tweet frequency and sentiment. Though journalists have a large presence on Twitter, the medium is clearly not a facsimile of print media and other opinions, values, and sentiments may have a stronger influence within the medium. This study is significant both in its mixed methods approach and in its finding that traditional print media coverage is not generally related to the frequency or sentiment of election-related tweets despite Twitter's role as a key space for news production and consumption.", "paper_title": "Comparing Print Coverage and Tweets in Elections: A Case Study of the 2011-2012 US Republican Primaries", "paper_id": "WOS:000354306600003"}