{"auto_keywords": [{"score": 0.046551697985518066, "phrase": "research_interests"}, {"score": 0.007152368807539886, "phrase": "unifying_search"}, {"score": 0.005271930995822716, "phrase": "proposed_i-reasearch_method"}, {"score": 0.005074498899544277, "phrase": "literature_search"}, {"score": 0.00466684417181804, "phrase": "scientists'_research_interests"}, {"score": 0.00443000995237127, "phrase": "previous_publications"}, {"score": 0.00435375504298636, "phrase": "better_services"}, {"score": 0.004278807087784626, "phrase": "web_age"}, {"score": 0.0040899006497687115, "phrase": "evolution_process"}, {"score": 0.003936560022538905, "phrase": "observed_characteristics"}, {"score": 0.0037107679833206773, "phrase": "interests-based_unification"}, {"score": 0.003285725064532174, "phrase": "author's_own_interests"}, {"score": 0.0032067276476968032, "phrase": "social_group_interests"}, {"score": 0.003129623571496151, "phrase": "literature_search_process"}, {"score": 0.003054367741379269, "phrase": "scalability_point"}, {"score": 0.002751751956416832, "phrase": "personalized_search"}, {"score": 0.0026762323224804197, "phrase": "step_forward_user_centric_knowledge_retrieval"}, {"score": 0.0024109902338204873, "phrase": "complex_networks"}, {"score": 0.0023942700905678735, "phrase": "human_dynamics"}, {"score": 0.0023043558058824572, "phrase": "information_physics"}, {"score": 0.002149418970824546, "phrase": "scientific_researchers"}, {"score": 0.0021419510072373756, "phrase": "best_means"}, {"score": 0.002127092664485508, "phrase": "best_ends"}, {"score": 0.0021049977753042253, "phrase": "active_way"}], "paper_keywords": ["Research interest detection", " Retained interest", " Interest duration", " Web search refinement", " Unifying search and reasoning"], "paper_abstract": "Most scientific publication information, which may reflects scientists' research interests, is publicly available on the Web. Understanding the characteristics of research interests from previous publications may help to provide better services for scientists in the Web age. In this paper, we introduce some parameters to track the evolution process of research interests, we analyze their structural and dynamic characteristics. According to the observed characteristics of research interests, under the framework of unifying search and reasoning (ReaSearch), we propose interests-based unification of search and reasoning (I-ReaSearch). Under the proposed I-ReaSearch method, we illustrate how research interests can be used to improve literature search on the Web. According to the relationship between an author's own interests and his/her co-authors interests, social group interests are also used to refine the literature search process. Evaluation from both the user satisfaction and the scalability point of view show that the proposed I-ReaSearch method provides a user centered and practical way to problem solving on the Web. The efforts provide some hints and various methods to support personalized search, and can be considered as a step forward user centric knowledge retrieval on the Web. From the standpoint of the Active Media Technology (AMT) on the Wisdom Web, in this paper, the study on the characteristics of research interests is based on complex networks and human dynamics, which can be considered as an effort towards utilizing information physics to discover and explain the phenomena related to research interests of scientists. The application of research interests aims at providing scientific researchers best means and best ends in an active way for literature search on the Web.", "paper_title": "Research interests: their dynamics, structures and applications in unifying search and reasoning", "paper_id": "WOS:000292000700004"}