{"auto_keywords": [{"score": 0.0495648351427175, "phrase": "fuzzy_co-clustering"}, {"score": 0.00481495049065317, "phrase": "overlapping_clusters"}, {"score": 0.004611369021812453, "phrase": "simultaneous_fuzzy_clustering"}, {"score": 0.004298666679374568, "phrase": "new_fuzzy_co-clustering_algorithm"}, {"score": 0.004139128578531134, "phrase": "cosine-distance-based"}, {"score": 0.0038170563140437633, "phrase": "fcc"}, {"score": 0.0037554497046697432, "phrase": "dual-partitioning_algorithm"}, {"score": 0.003210446135114967, "phrase": "cosine-distance-based_algorithm"}, {"score": 0.003124790943886441, "phrase": "cosine_distance"}, {"score": 0.0028502479839354637, "phrase": "new_algorithm"}, {"score": 0.0027295084882654917, "phrase": "prominent_existing_fuzzy_co-clustering_algorithms"}, {"score": 0.0026423134393535243, "phrase": "high_overlaps"}, {"score": 0.002258485755625332, "phrase": "dual-partitioning_formulation"}, {"score": 0.002222102813520549, "phrase": "experimental_results"}, {"score": 0.0021863046959469863, "phrase": "toy_problem"}, {"score": 0.0021627595586364724, "phrase": "five_large_benchmark_document_datasets"}, {"score": 0.0021049977753042253, "phrase": "codialing_fcc"}], "paper_keywords": [""], "paper_abstract": "Fuzzy co-clustering is a method that performs simultaneous fuzzy clustering of objects and features. In this paper, we introduce a new fuzzy co-clustering algorithm for high-dimensional datasets called Cosine-Distance-based & Dual-partitioning Fuzzy Co-clustering (CODIALING FCC). Unlike many existing fuzzy co-clustering algorithms, CODIALING FCC is a dual-partitioning algorithm. It clusters the features in the same manner as it clusters the objects, that is, by partitioning them according to their natural groupings. It is also a cosine-distance-based algorithm because it utilizes the cosine distance to capture the belongingness of objects and features in the co-clusters. Our main purpose of introducing this new algorithm is to improve the performance of some prominent existing fuzzy co-clustering algorithms in dealing with datasets with high overlaps. In our opinion, this is very crucial since most real-world datasets involve significant amount of overlaps in their inherent clustering structures. We discuss how this improvement can be made through the dual-partitioning formulation adopted. Experimental results on a toy problem and five large benchmark document datasets demonstrate the effectiveness of CODIALING FCC in handling overlaps better.", "paper_title": "A new fuzzy co-clustering algorithm for categorization of datasets with overlapping clusters", "paper_id": "WOS:000240088200036"}