{"auto_keywords": [{"score": 0.044001542978848354, "phrase": "threshold_voltage"}, {"score": 0.00481495049065317, "phrase": "fast_design_convergence"}, {"score": 0.004339609346924681, "phrase": "power_wire_increase"}, {"score": 0.0039519004610213595, "phrase": "supply_voltage"}, {"score": 0.0036174746598098863, "phrase": "serious_problem"}, {"score": 0.003580032420161922, "phrase": "modern_ic_design"}, {"score": 0.00253916011199984, "phrase": "commercial_design_flow"}, {"score": 0.0024868131939261716, "phrase": "effective_power-integrity"}, {"score": 0.0024103044278902916, "phrase": "experimental_results"}, {"score": 0.002360607691114015, "phrase": "real-world_circuit_design"}, {"score": 0.002324007517655199, "phrase": "mcnc"}, {"score": 0.0022291501521610737, "phrase": "ir-drop_errors"}, {"score": 0.0021831803612759855, "phrase": "floorplanning_stage"}, {"score": 0.0021049977753042253, "phrase": "single-pass_design_convergence"}], "paper_keywords": ["electromigration", " floorplanning", " IR drop", " physical design", " power/ground (P/G) analysis", " power integrity", " simulated annealing (SA)"], "paper_abstract": "As technology advances, the metal width decreases while the global wire length increases. This trend makes the resistance of the power wire increase substantially. Furthermore, the threshold voltage scales nonlinearly, raising the ratio of the threshold voltage to the supply voltage and making the voltage (IR) drop in the power/ground (P/G) network a serious problem in modern IC design. Traditional P/G network-analysis methods are often very computationally expensive, and it is, thus, not feasible to cosynthesize P/G network with floorplan. To make the cosynthesis feasible, we need not only an efficient, effective, and flexible floorplanning algorithm but also a very efficient yet sufficiently accurate P/G network-analysis method. In this paper, we present a method for floorplan and P/G network cosynthesis based on an efficient P/G network-analysis scheme and the B* -tree floorplan representation. Weintegrate the cosynthesis into a commercial design flow to develop an effective power-integrity (IR drop)-driven design methodology. Experimental results based on a real-world circuit design and the MCNC benchmarks show that our design methodology successfully fixes the IR-drop errors earlier at the floorplanning stage and, thus, enables the single-pass design convergence.", "paper_title": "Power/ground network and floorplan cosynthesis for fast design convergence", "paper_id": "WOS:000245190500008"}