{"auto_keywords": [{"score": 0.03520037234366165, "phrase": "steric_and_electrostatic_interactions"}, {"score": 0.00481495049065317, "phrase": "inhibitor_activity"}, {"score": 0.004630910803911567, "phrase": "indole_amide_hydroxamic_acids"}, {"score": 0.004523865550323285, "phrase": "well-expressed_inhibitor_activity"}, {"score": 0.004384960761826366, "phrase": "histone_deacetylases"}, {"score": 0.004152018764100109, "phrase": "codessa_pro_software"}, {"score": 0.0032599633778910516, "phrase": "fictitious_probe_atom"}, {"score": 0.0030625949549620475, "phrase": "aligned_molecules"}, {"score": 0.0029453365339797933, "phrase": "comfa_approach"}, {"score": 0.0023300677028248776, "phrase": "enzyme-inhibitor_docking_calculations"}, {"score": 0.0021049977753042253, "phrase": "comfa._new_potentially_active_structures"}], "paper_keywords": ["2D-QSAR", " CoMFA", " indole amide hydroxamic acids"], "paper_abstract": "The well-expressed inhibitor activity of 36 indole amide hydroxamic acids to Histone Deacetylases (HDACs) was analyzed by CODESSA PRO software and the Best Multiple Linear Regression (BLMR) algorithm, to provide a reliable 2D-QSAR model from a set of more than 800 descriptors. Concurrently, Chem-X (version 1994) software was used to develop a corresponding 3D-QSAR model; the steric and electrostatic interactions between a fictitious probe atom \"H+\" and a set of aligned molecules were evaluated using the CoMFA approach as implemented in Chem-X. A Partial Least Squares (PLS) procedure generated the principal components needed to build a 3D-QSAR model. The Weighted Least Squares (WLS) method generated an R-2 map of the regions around the molecules important for steric and electrostatic interactions. Enzyme-inhibitor docking calculations were carried out to combine and compare with the results obtained by CoMFA. New potentially active structures were proposed.", "paper_title": "Comparison between 2D and 3D-QSAR approaches to correlate inhibitor activity for a series of indole amide hydroxamic acids", "paper_id": "WOS:000245374600003"}