{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "protein_kinase_c"}, {"score": 0.007976807449225428, "phrase": "pkc"}, {"score": 0.004017745870068031, "phrase": "key_role"}, {"score": 0.003963211180578005, "phrase": "metabolic_acidosis"}, {"score": 0.0038960785110831162, "phrase": "pkc-mediated_phosphorylation"}, {"score": 0.003778081566896723, "phrase": "charge-charge_interaction"}, {"score": 0.0034686643139273934, "phrase": "giant_patch_clamp"}, {"score": 0.0034450303951025704, "phrase": "xenopus_oocytes"}, {"score": 0.003014948673771347, "phrase": "effective_pk"}, {"score": 0.002923641144479559, "phrase": "ph"}, {"score": 0.002620424858132324, "phrase": "giant_patch"}, {"score": 0.0025848074189353397, "phrase": "site_direct_mutagenesis"}, {"score": 0.002532284627202572, "phrase": "phosphorylation_site"}, {"score": 0.0023973704289918726, "phrase": "pkc-induced_phosphorylation_sites"}, {"score": 0.0022083264126633085, "phrase": "new_insights"}, {"score": 0.0021857667493036786, "phrase": "molecular_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "pkc."}], "paper_keywords": ["PKC", " ROMK1 channel", " PIP2", " Intracellular proton", " Effective pK(a)", " PMA"], "paper_abstract": "The protein kinase C (PKC) pathway is important for the regulation of K+ transport. The renal outer medullar K+ (ROMK1) channels show an exquisite sensitivity to intracellular protons (pH (i) ) (effective pK (a) approximately 6.8) and play a key role in K+ homeostasis during metabolic acidosis. Our molecular dynamic simulation results suggest that PKC-mediated phosphorylation on Thr-193 may disrupt the PIP2-channel interaction via a charge-charge interaction between Thr-193 and Arg-188. Therefore, we investigated the role of PKC and pH (i) in regulation of ROMK1 channel activity using a giant patch clamp with Xenopus oocytes expressing wild-type and mutant ROMK1 channels. ROMK1 channels pre-incubated with the PKC activator phorbol-12-myristate-13-acetate exhibited increased sensitivity to pH (i) (effective pK (a) shifted to pH approximately 7.0). In the presence of GF109203X-a PKC selective inhibitor-the effective pK (a) for inhibition of ROMK1 channels by pH (i) decreased (effective pK (a) shifted to pH approximately 6.5). The pH (i) sensitivity of ROMK1 channels mediated by PKC appeared to be dependent of PIP2 depletion. The giant patch clamp together with site direct mutagenesis revealed that Thr-193 is the phosphorylation site on PKC that regulates the pH (i) sensitivity of ROMK1 channels. Mutation of PKC-induced phosphorylation sites (T193A) decreases the pH (i) sensitivity and increases the interaction of channel-PIP2. Taken together, these results provide new insights into the molecular mechanisms underlying the pH (i) gating of ROMK1 channel regulation by PKC.", "paper_title": "Protein kinase C mediated pH (i) -regulation of ROMK1 channels via a phosphatidylinositol-4,5-bisphosphate-dependent mechanism", "paper_id": "WOS:000305602900005"}