{"auto_keywords": [{"score": 0.04149355457493527, "phrase": "subjective_attributes"}, {"score": 0.00921548384539376, "phrase": "user-subjective_approach"}, {"score": 0.007579774332511679, "phrase": "current_pim_systems"}, {"score": 0.00481495049065317, "phrase": "personal_information_management_systems"}, {"score": 0.004676345706416371, "phrase": "personal_information_management"}, {"score": 0.004637484570663189, "phrase": "pim"}, {"score": 0.004266067096140677, "phrase": "former_article"}, {"score": 0.004074574278425223, "phrase": "design_principles"}, {"score": 0.0040238512275833265, "phrase": "pim_systems"}, {"score": 0.003924284136338428, "phrase": "information_items"}, {"score": 0.003859273279966873, "phrase": "consecutive_article"}, {"score": 0.0033482708495261864, "phrase": "design_characteristics"}, {"score": 0.0022791416252817076, "phrase": "sufficient_use"}, {"score": 0.0022041312401435346, "phrase": "seven_novel_system_design_schemes"}, {"score": 0.0021049977753042253, "phrase": "user-subjective_principles"}], "paper_keywords": [""], "paper_abstract": "Personal Information Management (PIM) is an activity in which an individual stores personal information items to retrieve them later. In a former article, we suggested the user-subjective approach, a theoretical approach proposing design principles with which PIM systems can systematically use subjective attributes of information items. In this consecutive article, we report on a study that tested the approach by exploring the use of subjective attributes (i.e., project, importance, and context) in current PIM systems, and its dependence on design characteristics. Participants were 84 personal computer users. Tools included a questionnaire (N = 84), a semistructured interview that was transcribed and analyzed (n = 20), and screen captures taken from this subsample. Results indicate that participants tended to use subjective attributes when the design encouraged them to; however, when the design discouraged such use, they either found their own alternative ways to use them or refrained from using them altogether. This constitutes evidence in support of the user-subjective approach as it implies that current PIM systems do not allow for sufficient use of subjective attributes. The article also introduces seven novel system design schemes, suggested by the authors, which demonstrate how the user-subjective principles can be implemented.", "paper_title": "The user-subjective approach to personal information management systems design: Evidence and implementations", "paper_id": "WOS:000252161000006"}