{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "anomaly_detection_software"}, {"score": 0.0047006879240764935, "phrase": "data_analysis_tool"}, {"score": 0.0037322713756404295, "phrase": "candidate_anomalies"}, {"score": 0.0034892684482068347, "phrase": "returned_anomalies"}, {"score": 0.0033575566897536906, "phrase": "domain_knowledge"}, {"score": 0.003108814986752103, "phrase": "environmental_attributes"}, {"score": 0.0027431953780099826, "phrase": "direct_effect"}, {"score": 0.002703869368554536, "phrase": "expected_distribution"}, {"score": 0.0025892330566358503, "phrase": "anomalous_observation"}, {"score": 0.0025155150482635688, "phrase": "general_purpose_method"}, {"score": 0.0022409963215568565, "phrase": "conditional_anomaly_detection"}, {"score": 0.0021049977753042253, "phrase": "anomaly_detection"}], "paper_keywords": ["data mining", " mining methods and algorithms"], "paper_abstract": "When anomaly detection software is used as a data analysis tool, finding the hardest-to-detect anomalies is not the most critical task. Rather, it is often more important to make sure that those anomalies that are reported to the user are in fact interesting. If too many unremarkable data points are returned to the user labeled as candidate anomalies, the software will soon fall into disuse. One way to ensure that returned anomalies are useful is to make use of domain knowledge provided by the user. Often, the data in question includes a set of environmental attributes whose values a user would never consider to be directly indicative of an anomaly. However, such attributes cannot be ignored because they have a direct effect on the expected distribution of the result attributes whose values can indicate an anomalous observation. This paper describes a general purpose method called conditional anomaly detection for taking such differences among attributes into account, and proposes three different expectation-maximization algorithms for learning the model that is used in conditional anomaly detection. Experiments with more than 13 different data sets compare our algorithms with several other more standard methods for outlier or anomaly detection.", "paper_title": "Conditional anomaly detection", "paper_id": "WOS:000244895200004"}