{"auto_keywords": [{"score": 0.04851462386946882, "phrase": "fmnwsm"}, {"score": 0.028732126512783385, "phrase": "traditional_fuzzy_min-max_neural_networks"}, {"score": 0.007740489563401459, "phrase": "symmetric_margin"}, {"score": 0.006371168969786495, "phrase": "non-linear_program"}, {"score": 0.0056963809272079355, "phrase": "training_phase"}, {"score": 0.005649320962572919, "phrase": "fmnwsm."}, {"score": 0.005264606952615164, "phrase": "overlapped_region"}, {"score": 0.005050597220620634, "phrase": "especial_node"}, {"score": 0.004755353864362941, "phrase": "fuzzy_min-max_neural_network"}, {"score": 0.004198323646273642, "phrase": "identical_probability_distribution"}, {"score": 0.003721735062704032, "phrase": "numerical_optimization_algorithm"}, {"score": 0.0028760125558659907, "phrase": "special_node"}, {"score": 0.0028521858876446654, "phrase": "overlapped_regions"}, {"score": 0.002816814445002924, "phrase": "space_complexity"}, {"score": 0.002581165831422692, "phrase": "test_time_complexity"}, {"score": 0.0024149139610228887, "phrase": "simpler_activation_function"}, {"score": 0.002345579707333727, "phrase": "proposed_fuzzy_min-max_neural_networks"}, {"score": 0.0022036216160494925, "phrase": "gfmn"}, {"score": 0.0021853532419450887, "phrase": "fmcn"}, {"score": 0.002167235986623239, "phrase": "dcfmn"}, {"score": 0.0021049977753042253, "phrase": "real_datasets"}], "paper_keywords": ["Fuzzy min-max neural network", " Classification", " Overlapped region", " Symmetric margin", " Noise"], "paper_abstract": "A fuzzy min-max neural network with symmetric margin (FMNWSM) is proposed in this paper. Therefore, its probability of misclassification is lower than traditional fuzzy min-max neural networks if both training and test samples are from identical probability distribution. Meanwhile, data is classified with symmetric margin by the use of a non-linear program which is solved analytically. In other words, to decrease learning time, no numerical optimization algorithm is used to solve the non-linear program. Only hyperbox expansion is performed in training phase of FMNWSM. On the contrary, in training phase of traditional fuzzy min-max neural networks, another process also is performed for each overlapped region such as (a) contraction process or (b) creating an especial node. Therefore, learning time of FMNWSM is less than that of traditional fuzzy min-max neural networks and since FMNWSM does not create any special node for overlapped regions, the space complexity of FMNWSM is better than those that create an especial node for an overlapped region. It is shown also that the test time complexity of FMNWSM is much better than that of traditional fuzzy min-max neural networks because of the use of a simpler activation function in its hyperbox node. Finally, the proposed fuzzy min-max neural networks, namely FMNWSM, is compared with some of traditional fuzzy min-max neural networks (i.e. FMNN, GFMN, FMCN and DCFMN) empirically (by using some real datasets) and also analytically to show the superiority of FMNWSM.", "paper_title": "Fuzzy Min-Max Neural Network for Learning a Classifier with Symmetric Margin", "paper_id": "WOS:000360565300005"}