{"auto_keywords": [{"score": 0.049692788583269344, "phrase": "perspective_descriptions"}, {"score": 0.022647915748877433, "phrase": "design_perspectives"}, {"score": 0.00481495049065317, "phrase": "structured_use"}, {"score": 0.0046993598473345395, "phrase": "design_process"}, {"score": 0.004642604455537883, "phrase": "design_perspective"}, {"score": 0.004586531354697466, "phrase": "coherent_set"}, {"score": 0.004298666679374568, "phrase": "generic_framework"}, {"score": 0.004012500850311087, "phrase": "central_relations"}, {"score": 0.003822003373331997, "phrase": "design_situation"}, {"score": 0.003495855671790616, "phrase": "literature_sources"}, {"score": 0.003236596168242036, "phrase": "idea_generation"}, {"score": 0.0031974502006267163, "phrase": "early_phases"}, {"score": 0.0030086877092638945, "phrase": "important_impact"}, {"score": 0.0029722900280316216, "phrase": "resulting_artifact"}, {"score": 0.002877361619893651, "phrase": "design_space"}, {"score": 0.0025892330566358503, "phrase": "goal-oriented_tool"}, {"score": 0.0025578967205807843, "phrase": "media-based_communication_experience"}, {"score": 0.0024862418814045723, "phrase": "task-based_flow"}, {"score": 0.002436289099444074, "phrase": "format-dependent_communication_experience"}, {"score": 0.002348883765159185, "phrase": "basic_assumptions"}, {"score": 0.002264607102799332, "phrase": "conceptually_different_design_ideas"}, {"score": 0.0021049977753042253, "phrase": "design_practice"}], "paper_keywords": [""], "paper_abstract": "In this article we argue that a structured use of perspective descriptions can support a design process. A design perspective is a coherent set of values and aspects emphasized by the designer in a given design situation. We present a generic framework for describing 7 dimensions of perspectives concerning user, artifact; context, activities, communication, central relations, and use qualities that we argue are relevant in a design situation. Subsequently we use this metaperspective to describe four perspectives: tool, architectural, usability, and media perspective distilled from literature sources. By conducting two design workshops, we have evaluated the effects of using perspective descriptions to address the problem of idea generation in the early phases of design. Our analysis shows that the perspectives contain values that can have an important impact on the resulting artifact. By guiding the exploration of the design space, they influence both the artifact's conceptual idea and its use qualities. In our design example, a car game, the conceptual idea of the artifact varied from a goal-oriented tool to a media-based communication experience. Use qualities varied from a task-based flow of action to a format-dependent communication experience. The perspectives served as a synthesis of basic assumptions from the literature and as support to generate conceptually different design ideas. Based on the outcome of our study, we propose an approach for working with design perspectives in design practice, and education. We also present an agenda for research on design perspectives.", "paper_title": "Design perspectives", "paper_id": "WOS:000238040000002"}