{"auto_keywords": [{"score": 0.04570726713392777, "phrase": "unit-selection_algorithm"}, {"score": 0.008158448130894365, "phrase": "unit-cost_function_weights"}, {"score": 0.007150972088221384, "phrase": "unit-cost_functions"}, {"score": 0.00481495049065317, "phrase": "gradient-descent_based"}, {"score": 0.004675565200598801, "phrase": "corpus-based_text-to-speech_synthesis."}, {"score": 0.004590496414177077, "phrase": "gradient-descent_based_unit_selection_optimization_algorithm"}, {"score": 0.0045709825588382625, "phrase": "obtained_results"}, {"score": 0.004424953471635011, "phrase": "overall_performance"}, {"score": 0.004281053243493438, "phrase": "corpus-based_text"}, {"score": 0.004218602458288531, "phrase": "speech_synthesis_system"}, {"score": 0.004187718090913465, "phrase": "complex_multidimensional_and_fuzzy-logic_based_unit-cost_functions"}, {"score": 0.0035755653799043, "phrase": "optimal_performance"}, {"score": 0.0034975571855450373, "phrase": "multidimensional_unit-cost_function_space"}, {"score": 0.0034464962568390265, "phrase": "different_database_candidates'_features"}, {"score": 0.0033589207694997413, "phrase": "listening_tests"}, {"score": 0.002953217535105884, "phrase": "overall_optimal_performance"}, {"score": 0.002888747754856871, "phrase": "proposed_unit-selection_optimization_process"}, {"score": 0.00244792069601419, "phrase": "unit-selection_cost-function_weights"}, {"score": 0.00238565827614317, "phrase": "smoother_transitions"}, {"score": 0.002368160970983679, "phrase": "selected_unit_candidates"}, {"score": 0.0023335495163073544, "phrase": "unit-selection_process"}, {"score": 0.00226583335721762, "phrase": "performance_level"}, {"score": 0.0021049977753042253, "phrase": "additional_or_changed_unit-cost_functions"}], "paper_keywords": [""], "paper_abstract": "This paper proposes a gradient-descent based unit selection optimization algorithm for the optimization of unit-cost function weights and for improving the overall performance of the unit-selection algorithm, as used in a corpus-based text-to-speech synthesis system. Complex multidimensional and fuzzy-logic based unit-cost functions are used in the presented unit-selection algorithm. The weights used by these unit-cost functions are usually defined by heuristics or by listening tests. This can be very laborious and time consuming, and does not necessarily result in an optimal performance of the unit-selection algorithm because of multidimensional unit-cost function space, within which different database candidates' features are evaluated. Using heuristics or listening tests is also rather rigid, especially when working with several different databases or voices. It is especially difficult, within this scope, to set up those weights used in unit-cost functions in order to achieve overall optimal performance of the unit-selection algorithm. The proposed unit-selection optimization process consists of several steps. It is fully automatic, flexible, and fast enough to enable the development of a corpus-based text-to-speech (TTS) system that uses many different voices, without any heuristics or listening tests. This optimization process can also be helpful when evaluating the performances of unit-selection cost functions, and the performance of the unit-selection algorithm itself. The obtained results \"suggest\" those values that the unit-selection cost-function weights should have in order to obtain smoother transitions between selected unit candidates, after the unit-selection process. The obtained results also hint at the performance level that can be achieved with a given set of unit-cost function weights, and suggest what improvements can be gained when using those additional or changed unit-cost functions included within the unit-selection algorithm.", "paper_title": "GRADIENT-DESCENT BASED UNIT-SELECTION OPTIMIZATION ALGORITHM USED FOR CORPUS-BASED TEXT-TO-SPEECH SYNTHESIS", "paper_id": "WOS:000295320100004"}