{"auto_keywords": [{"score": 0.04942444706912143, "phrase": "large-scale_particle_simulation"}, {"score": 0.047302204764271674, "phrase": "simulation-time_random_sampling"}, {"score": 0.03501467026270221, "phrase": "large_population"}, {"score": 0.00481495049065317, "phrase": "-situ_sampling"}, {"score": 0.004677423703960176, "phrase": "analysis"}, {"score": 0.004332471656145115, "phrase": "interactive_post-analysis"}, {"score": 0.004253618550301311, "phrase": "simulation_data_generation_rates"}, {"score": 0.0041001740903338834, "phrase": "storage_bandwidth_rates"}, {"score": 0.0036218682585355895, "phrase": "limiting_factors"}, {"score": 0.0031699005399973496, "phrase": "statistical_sampling_techniques"}, {"score": 0.003083655376444887, "phrase": "representative_data_set"}, {"score": 0.002723607240517261, "phrase": "detail_organization"}, {"score": 0.0025071862539276283, "phrase": "level-of-detail_format"}, {"score": 0.002163930783583212, "phrase": "entire_particle_population"}, {"score": 0.0021342613107011624, "phrase": "full_population_statistics"}, {"score": 0.0021049977753042253, "phrase": "sample_error"}], "paper_keywords": [""], "paper_abstract": "We describe a simulation-time random sampling of a large-scale particle simulation, the RoadRunner Universe MC3 cosmological simulation, for interactive post-analysis and visualization. Simulation data generation rates will continue to be far greater than storage bandwidth rates by many orders of magnitude. This implies that only a very small fraction of data generated by a simulation can ever be stored and subsequently post-analyzed. The limiting factors in this situation are similar to the problem in many population surveys: there aren't enough human resources to query a large population. To cope with the lack of resources, statistical sampling techniques are used to create a representative data set of a large population. Following this analogy, we propose to store a simulation-time random sampling of the particle data for post-analysis, with level-of-detail organization, to cope with the bottlenecks. A sample is stored directly from the simulation in a level-of-detail format for post-visualization and analysis, which amortizes the cost of post-processing and reduces workflow time. Additionally by sampling during the simulation, we are able to analyze the entire particle population to record full population statistics and quantify sample error.", "paper_title": "In-situ Sampling of a Large-Scale Particle Simulation for Interactive Visualization and Analysis", "paper_id": "WOS:000292164300053"}