{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "peering_arrangements"}, {"score": 0.0047709540557306284, "phrase": "autonomous_systems"}, {"score": 0.004536029676655286, "phrase": "undirected_graph"}, {"score": 0.004392565073466714, "phrase": "asymmetric_customer-provider_arrangements"}, {"score": 0.004253618550301311, "phrase": "directed_edges"}, {"score": 0.0037921662574137535, "phrase": "new_model"}, {"score": 0.0036721416244816455, "phrase": "directed_graph"}, {"score": 0.0033961782274326948, "phrase": "peer-to-peer_arrangements"}, {"score": 0.0029586543333524904, "phrase": "synthetic_network_generator"}, {"score": 0.0023507916951658455, "phrase": "realistic_regional_dense_cores"}, {"score": 0.0023079225317714815, "phrase": "clear_geographic_flavor"}, {"score": 0.002255431275670053, "phrase": "path_inflation_effects"}, {"score": 0.002163930783583212, "phrase": "real_as_graph"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["autonomous systems", " AS-graph", " peering arrangements", " synthetic network generator", " power-law exponent", " dense core"], "paper_abstract": "The goal of this work is to model the peering arrangements between Autonomous Systems (ASes). Most existing models of the AS-graph assume an undirected graph. However, peering arrangements are mostly asymmetric customer-provider arrangements, which are better modeled as directed edges. Furthermore, it is well known that the AS-graph, and in particular its clustering structure, is influenced by geography. We introduce a new model that describes the AS-graph as a directed graph, with an edge going from the customer to the provider, but also models symmetric peer-to-peer arrangements, and takes geography into account. We are able to mathematically analyze its power-law exponent and number of leaves. Beyond the analysis, we have implemented our model as a synthetic network generator we call GDTANG. Experimentation with GDTANG shows that the networks it produces are more realistic than those generated by other network generators, in terms of its power-law exponent, fractions of customer-provider and symmetric peering arrangements, and the size of its dense core. We believe that our model is the first to manifest realistic regional dense cores that have a clear geographic flavor. Our synthetic networks also exhibit path inflation effects that are similar to those observed in the real AS graph. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A geographic directed preferential internet topology model", "paper_id": "WOS:000249076900012"}