{"auto_keywords": [{"score": 0.03209246959502603, "phrase": "pam"}, {"score": 0.00481495049065317, "phrase": "monitoring_framework"}, {"score": 0.00447115003744675, "phrase": "object_monitoring"}, {"score": 0.0043208252177835815, "phrase": "privacy-aware_monitoring"}, {"score": 0.003944112858235306, "phrase": "existing_work"}, {"score": 0.0033427754823819157, "phrase": "mobile_clients"}, {"score": 0.0032860401904845522, "phrase": "location_updates"}, {"score": 0.0031037644581516973, "phrase": "safe_region"}, {"score": 0.002849078393246526, "phrase": "query_results"}, {"score": 0.002442025065383455, "phrase": "safe_region_computation_algorithms"}, {"score": 0.002359759876402679, "phrase": "experimental_results"}, {"score": 0.0022802596433757565, "phrase": "traditional_schemes"}, {"score": 0.0021049977753042253, "phrase": "close-to-optimal_communication_cost"}], "paper_keywords": ["Spatial databases", " location-dependent and sensitive", " mobile applications"], "paper_abstract": "Efficiency and privacy are two fundamental issues in moving object monitoring. This paper proposes a privacy-aware monitoring (PAM) framework that addresses both issues. The framework distinguishes itself from the existing work by being the first to holistically address the issues of location updating in terms of monitoring accuracy, efficiency, and privacy, particularly, when and how mobile clients should send location updates to the server. Based on the notions of safe region and most probable result, PAM performs location updates only when they would likely alter the query results. Furthermore, by designing various client update strategies, the framework is flexible and able to optimize accuracy, privacy, or efficiency. We develop efficient query evaluation/reevaluation and safe region computation algorithms in the framework. The experimental results show that PAM substantially outperforms traditional schemes in terms of monitoring accuracy, CPU cost, and scalability while achieving close-to-optimal communication cost.", "paper_title": "PAM: An Efficient and Privacy-Aware Monitoring Framework for Continuously Moving Objects", "paper_id": "WOS:000273707000008"}