{"auto_keywords": [{"score": 0.03508151498494197, "phrase": "traditional_abstraction_mechanisms"}, {"score": 0.015719716506582538, "phrase": "independent_abstraction_mechanism"}, {"score": 0.004777214679969785, "phrase": "conceptual_modeling"}, {"score": 0.00462919213721188, "phrase": "computer_science"}, {"score": 0.004312622975366676, "phrase": "general_framework"}, {"score": 0.004178935413340453, "phrase": "information_modeling"}, {"score": 0.003802135020791801, "phrase": "possibly_a_reference"}, {"score": 0.0035981701736904495, "phrase": "detailed_information"}, {"score": 0.0028857130140890787, "phrase": "complementary_capacity"}, {"score": 0.0025237171554924128, "phrase": "contextualized_information_bases"}, {"score": 0.002445347925313158, "phrase": "validity_constraints"}, {"score": 0.0021724831184390192, "phrase": "particular_information_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["conceptual modeling", " contextualization", " viewpoints", " abstraction mechanisms", " model theory", " inference rules"], "paper_abstract": "The notion of context appears in computer science, as well as in several other disciplines, in various forms. In this paper, we present a general framework for representing the notion of context in information modeling. First, we define a context as a set of objects, within which each object has a set of names and possibly a reference: the reference of the object is another context which \"hides\" detailed information about the object. Then, we introduce the possibility of structuring the contents of a context through the traditional abstraction mechanisms, i.e., classification, generalization, and attribution. We show that, depending on the application, our notion of context can be used as an independent abstraction mechanism, either in an alternative or a complementary capacity with respect to the traditional abstraction mechanisms. We also study the interactions between contextualization and the traditional abstraction mechanisms, as well as the constraints that govern such interactions. Finally, we present a theory for contextualized information bases. The theory includes a set of validity constraints, a model theory, as well as a set of sound and complete inference rules. We show that our core theory can be easily extended to support embedding of particular information models in our contextualization framework. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Contextualization as an independent abstraction mechanism for conceptual modeling", "paper_id": "WOS:000242064900002"}