{"auto_keywords": [{"score": 0.043101810797355644, "phrase": "sparse_multiples"}, {"score": 0.010023459164442661, "phrase": "moderate_degree"}, {"score": 0.00481495049065317, "phrase": "robust_linear_feedback_shift_registers-based_scramblers"}, {"score": 0.004464326432401002, "phrase": "linear_scramblers"}, {"score": 0.00441635700580562, "phrase": "stream_ciphers"}, {"score": 0.004298666679374568, "phrase": "correlation-based_reconstruction"}, {"score": 0.004072573194988867, "phrase": "moderate_degrees"}, {"score": 0.0035386420095120706, "phrase": "primitive_polynomial"}, {"score": 0.003210446135114967, "phrase": "degree_d"}, {"score": 0.002928399649340438, "phrase": "second_lower_bound"}, {"score": 0.0028043588777213533, "phrase": "randomly_chosen_primitive_polynomial"}, {"score": 0.0024761702541879213, "phrase": "minimum_degrees"}, {"score": 0.0024231382864800173, "phrase": "primitive_polynomials"}, {"score": 0.002222102813520549, "phrase": "lower_bounds"}, {"score": 0.0021049977753042253, "phrase": "previous_results"}], "paper_keywords": [""], "paper_abstract": "It is well known that in order to build linear scramblers and stream ciphers that are robust against correlation-based reconstruction, primitive polynomials which do not have sparse multiples of moderate degrees must be used. In this paper, the existence and density of such 'good primitive polynomials' are studied. Two theoretical lower bounds on the degree d of the primitive polynomial are derived. When d is larger than the first lower bound, there exists at least one primitive polynomial of degree d which does not have any sparse multiple of moderate degree and when d is larger than the second lower bound, it is almost guaranteed that a randomly chosen primitive polynomial of degree d does not have any sparse multiples of moderate degree. To make the lower bound tight, the distribution of the minimum degrees of sparse multiples of primitive polynomials is investigated in this paper. From comparison, it can be seen that the lower bounds obtained in this paper are much better than the previous results reported in the literature.", "paper_title": "Primitive polynomials for robust linear feedback shift registers-based scramblers and stream ciphers", "paper_id": "WOS:000312961900007"}