{"auto_keywords": [{"score": 0.04975317258245106, "phrase": "lo"}, {"score": 0.00481495049065317, "phrase": "pll_based_phase"}, {"score": 0.004637478829869904, "phrase": "front-end_architecture"}, {"score": 0.004497129150551236, "phrase": "lo-path_beamforming"}, {"score": 0.0044512920090463105, "phrase": "phase_controlled_phase-locked_loop"}, {"score": 0.004143196873246147, "phrase": "active_mixers"}, {"score": 0.003922794571908569, "phrase": "lo_signals"}, {"score": 0.0038431888954930083, "phrase": "pll."}, {"score": 0.0037140731069193896, "phrase": "current_commutating_pairs"}, {"score": 0.003681317609226614, "phrase": "pll"}, {"score": 0.0036761878173205225, "phrase": "qvco"}, {"score": 0.0035892794633115227, "phrase": "first_mixer"}, {"score": 0.003409880074659807, "phrase": "second_mixer"}, {"score": 0.0032283609741926445, "phrase": "relatively_high_reference_frequency"}, {"score": 0.0031091858573262265, "phrase": "pll_loop_filter"}, {"score": 0.003066945490483524, "phrase": "compact_layout"}, {"score": 0.0028252518377336953, "phrase": "two-tone_measurements"}, {"score": 0.002693134880651768, "phrase": "pc-pll_phase_noise"}, {"score": 0.002397370428991875, "phrase": "phase_error"}], "paper_keywords": ["CMOS integrated circuits", " Phased arrays", " Millimeter wave integrated circuits", " Receivers"], "paper_abstract": "This paper presents a front-end architecture for fully integrated 60 GHz phased array receivers. It employs LO-path beamforming using a phase controlled phase-locked loop (PC-PLL). To demonstrate the architecture a circuit is implemented featuring a two stage low noise amplifier, two cascaded active mixers, and a PC-PLL. The receiver downconverts the 60 GHz signal in two steps, using LO signals from the 20 GHz QVCO of the PLL. A differential 2nd-order harmonic is coupled from the sources of the current commutating pairs of the QVCO, feeding the LO-port of the first mixer and downconverting the 60 GHz RF signal to a 20 GHz intermediate frequency. Quadrature 20 GHz LO signals are then used in the second mixer to down-convert the IF signal to baseband. The PLL is locked to a relatively high reference frequency, 1.25 GHz, which reduces the size of the PLL loop filter and enables a compact layout. The measurements show an input return loss better than -10 dB between 57.5 and 60.8 GHz, a 15 dB voltage gain, and a 9 dB noise figure. Two-tone measurements show -12.5 dBm IIP3, 29 dBm IIP2, and -24 dBm ICP1. The PC-PLL phase noise is -105 dBc/Hz at 1 MHz offset from a 20 GHz carrier, and the phase of the received 60 GHz signal is digitally controllable with a resolution of 3.2A degrees, covering the full 360A degrees range with a phase error smaller than 1A degrees. The chip consumes 80 mA from a 1.2 V supply, and measures 1,400 mu m x 660 mu m (900 mu m x 500 mu m excluding pads) including LNAs, mixers, and PC-PLL in a 90 nm RF CMOS process.", "paper_title": "A 60 GHz receiver front-end with PLL based phase controlled LO generation for phased-arrays", "paper_id": "WOS:000336384500003"}