{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "draw-and-write_technique"}, {"score": 0.004645057834614705, "phrase": "information_science"}, {"score": 0.004023120753104693, "phrase": "graduate_students"}, {"score": 0.003975200317233532, "phrase": "north_american_ischool"}, {"score": 0.003456427643307904, "phrase": "compositional_interpretation"}, {"score": 0.0034016119212097826, "phrase": "theoretical_framework"}, {"score": 0.0033745298175222056, "phrase": "graphic_representations"}, {"score": 0.0031152526492532785, "phrase": "prior_renderings"}, {"score": 0.002623111480310373, "phrase": "distinct_qualities"}, {"score": 0.0026022112631368223, "phrase": "methodological_reflections"}, {"score": 0.00255068452076921, "phrase": "visual_and_textual_data"}, {"score": 0.0024117603727471654, "phrase": "new_directions"}, {"score": 0.0022803854904010347, "phrase": "thinking_tool"}, {"score": 0.002262209824105154, "phrase": "visual_stories"}], "paper_keywords": [""], "paper_abstract": "There are untold conceptions of information in information science, and yet the nature of information remains obscure and contested. This article contributes something new to the conversation as the first arts-informed, visual, empirical study of information utilizing the draw-and-write technique. To approach the concept of information afresh, graduate students at a North American iSchool were asked to respond to the question \"What is information?\" by drawing on a 4- by 4-inch piece of paper, called an iSquare. One hundred thirty-seven iSquares were produced and then analyzed using compositional interpretation combined with a theoretical framework of graphic representations. The findings indicate how students visualize information, what was drawn, and associations between the iSquares and prior renderings of information based on words. In the iSquares, information appears most often as pictures of people, artifacts, landscapes, and patterns. There are also many link diagrams, grouping diagrams, symbols, and written text, each with distinct qualities. Methodological reflections address the relationship between visual and textual data, and the sample for the study is critiqued. A discussion presents new directions for theory and research on information, namely, the iSquares as a thinking tool, visual stories of information, and the contradictions of information. Ideas are also provided on the use of arts-informed, visual methods and the draw-and-write technique in the classroom.", "paper_title": "An Arts-Informed Study of Information Using the Draw-and-Write Technique", "paper_id": "WOS:000337030700004"}