{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiple_sequence_alignments"}, {"score": 0.004657393640152439, "phrase": "rna-rna_interaction_structure_prediction"}, {"score": 0.004238307626560739, "phrase": "rna-rna_interaction_complexes"}, {"score": 0.00396530196547293, "phrase": "related_sequences"}, {"score": 0.0038998328617557013, "phrase": "relevant_evolutionary_information"}, {"score": 0.0037721073763702486, "phrase": "structure_determination"}, {"score": 0.003628352506247126, "phrase": "considerable_practical_interest"}, {"score": 0.0028417741269408194, "phrase": "pairing_probabilities"}, {"score": 0.00262910358108176, "phrase": "boltzmann-sampled_suboptimal_structures"}, {"score": 0.002585638506308606, "phrase": "canonical_joint_structures"}, {"score": 0.0024323098907299027, "phrase": "single_sequence-pair_folding_algorithm"}, {"score": 0.0023656467839555458, "phrase": "negligible_additional_memory_resource"}, {"score": 0.0022377394845878268, "phrase": "suitable_quality"}, {"score": 0.0021285340816566906, "phrase": "structure_constraints"}, {"score": 0.0021049977753042253, "phrase": "input_parameters"}], "paper_keywords": [""], "paper_abstract": "Motivation: Many computerized methods for RNA-RNA interaction structure prediction have been developed. Recently, O(N-6) time and O(N-4) space dynamic programming algorithms have become available that compute the partition function of RNA-RNA interaction complexes. However, few of these methods incorporate the knowledge concerning related sequences, thus relevant evolutionary information is often neglected from the structure determination. Therefore, it is of considerable practical interest to introduce a method taking into consideration both: thermodynamic stability as well as sequence/structure covariation. Results: We present the a priori folding algorithm ripalign, whose input consists of two (given) multiple sequence alignments (MSA). ripalign outputs (i) the partition function, (ii) base pairing probabilities, (iii) hybrid probabilities and (iv) a set of Boltzmann-sampled suboptimal structures consisting of canonical joint structures that are compatible to the alignments. Compared to the single sequence-pair folding algorithm rip, ripalign requires negligible additional memory resource but offers much better sensitivity and specificity, once alignments of suitable quality are given. ripalign additionally allows to incorporate structure constraints as input parameters.", "paper_title": "RNA-RNA interaction prediction based on multiple sequence alignments", "paper_id": "WOS:000287246000003"}