{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "seasonal_long-memory_model"}, {"score": 0.004390192910013225, "phrase": "time-dependent_variance"}, {"score": 0.004101281992566145, "phrase": "sarfima_model"}, {"score": 0.00386876598761639, "phrase": "garch_type_innovations"}, {"score": 0.0035100601949451028, "phrase": "cariacica"}, {"score": 0.003376037544631762, "phrase": "fractional_estimates"}, {"score": 0.00323134923196813, "phrase": "mean_level"}, {"score": 0.0031690434364310435, "phrase": "long-memory_phenomenon"}, {"score": 0.003018468582368033, "phrase": "seasonal_periods"}, {"score": 0.0029747028229638625, "phrase": "non-constant_variance_property"}, {"score": 0.0028471655497661528, "phrase": "interesting_features"}, {"score": 0.0025829353063908256, "phrase": "time_series_properties"}, {"score": 0.0024601402359002056, "phrase": "adjusted_model"}, {"score": 0.0023431692392929353, "phrase": "out-of-sample_forecast_intervals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fractional differencing", " Long-memory", " ARFIMA", " Seasonality", " Heteroscedasticity", " PM10 contaminant"], "paper_abstract": "This paper considers the possibility that the daily average Particulate Matter (PM10) concentration is a seasonal fractionally integrated process with time-dependent variance (volatility). In this context, one convenient extension is to consider the SARFIMA model (Reisen et al., 2006a,b) with GARCH type innovations. The model is theoretically justified and its usefulness is corroborated with the application to PM10 concentration in the city of Cariacica, ES (Brazil). The fractional estimates evidenced that the series is stationary in the mean level and it has long-memory phenomenon in the long-run and, also, in the seasonal periods. A non-constant variance property was also found in the data. These interesting features observed in the PM10 concentration supports the use of a more sophisticated time series model structure, that is, a model that encompasses both time series properties seasonal long-memory and conditional variance. The adjusted model well captured the dynamics in the series. The out-of-sample forecast intervals were improved by considering heteroscedastic errors and they were able to capture the periods of more volatility. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Modeling and forecasting daily average PM10 concentrations by a seasonal long-memory model with volatility", "paper_id": "WOS:000329561100025"}