{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_externalities"}, {"score": 0.009005397189678632, "phrase": "empirical_evidence"}, {"score": 0.007737650203066112, "phrase": "e-business_adoption"}, {"score": 0.00467378923240096, "phrase": "china"}, {"score": 0.004661446705304497, "phrase": "purpose_-_this_paper"}, {"score": 0.004312622975366672, "phrase": "conceptual_model"}, {"score": 0.004039399849079087, "phrase": "self-reporting_bias"}, {"score": 0.003788069044402032, "phrase": "information_sharing"}, {"score": 0.00372713741845688, "phrase": "split_sample_analysis"}, {"score": 0.003691048155818806, "phrase": "cultural_contexts"}, {"score": 0.003370565320453525, "phrase": "mainland_china"}, {"score": 0.0032629585038738856, "phrase": "chinese_cultures"}, {"score": 0.0030878280304339587, "phrase": "business_performance"}, {"score": 0.0029506624896613446, "phrase": "self-reported_questionnaires"}, {"score": 0.0024601402359002056, "phrase": "valuable_insights"}, {"score": 0.0021187186371584674, "phrase": "valuable_insight"}, {"score": 0.0021049977753042253, "phrase": "better_understanding"}], "paper_keywords": ["computer networks", " electronic commerce", " information management", " China"], "paper_abstract": "Purpose - This paper seeks to investigate and provide empirical evidence of the interrelationships among network externalities, e-business adoption and information asymmetry. Design/methodology/approach - A conceptual model was proposed and tested using 307 completed interview cases selected from a database of 2,075 Chinese international trading companies published by the Beijing Municipal Bureau of Commerce for this study. Findings - The results indicated that network externalities significantly influenced e-business adoption and information asymmetry, and e-business adoption influenced information asymmetry through information sharing and collection. A split sample analysis showed that cultural contexts significantly moderated the inter-relationships among network externalities, e-business adoption, and information asymmetry. Research limitations/implications - Data for this study were collected only from mainland China, therefore, non-Chinese companies (foreign-owned) operating in China may have been influenced by Chinese cultures and some of them have been localizing their operations in China. The influences of network externalities on business performance and decision making remain unclear. In addition, data were collected from self-reported questionnaires, and thus may be subject to self-reporting bias. Future studies should use more objective measurements to reduce the potential for self-reporting bias. Practical implications - This study contributes significantly to the literature by providing empirical evidence on interrelationships among network externalities, e-business adoption, and information asymmetry. The findings in this study also provide valuable insights for managers to better understand the influence of network externalities on e-business adoption. Originality/value - This study contributes significantly to the literature by providing empirical evidence of the interrelationships among network externalities, e-business adoption, and information asymmetry. The findings also provide managers with valuable insight into better understanding of the nature of these interrelationships.", "paper_title": "On network externalities, e-business adoption and information asymmetry", "paper_id": "WOS:000248068600008"}