{"auto_keywords": [{"score": 0.04869899604560651, "phrase": "lbd"}, {"score": 0.03855180623129078, "phrase": "ranked_list"}, {"score": 0.03714742878556182, "phrase": "medline_articles"}, {"score": 0.03387854890820615, "phrase": "semantic_predications"}, {"score": 0.024886350790392666, "phrase": "complex_associations"}, {"score": 0.004832762668418559, "phrase": "context"}, {"score": 0.004753738033333822, "phrase": "literature-based_discovery"}, {"score": 0.004625164125506718, "phrase": "hidden_associations"}, {"score": 0.004608284537368354, "phrase": "non-interacting_scientific_literature"}, {"score": 0.004394350285140955, "phrase": "distributional_statistics"}, {"score": 0.004378309349451268, "phrase": "graph-theoretic_measures"}, {"score": 0.004354357190014232, "phrase": "interesting_connections"}, {"score": 0.004275454946792175, "phrase": "spurious_connections"}, {"score": 0.00424429412316124, "phrase": "manual_approaches"}, {"score": 0.004205660924155212, "phrase": "scalable_and_purely_distributional_approaches"}, {"score": 0.00411436400374349, "phrase": "poorly_understood_associations"}, {"score": 0.0039738305179250095, "phrase": "considerable_degree"}, {"score": 0.003952082333580496, "phrase": "priori_knowledge"}, {"score": 0.003916098498242888, "phrase": "manual_filtering"}, {"score": 0.0037616074193211257, "phrase": "biomedical_concepts"}, {"score": 0.003741016338085083, "phrase": "lbd."}, {"score": 0.0036264368974685047, "phrase": "informative_and_potentially_unknown_associations"}, {"score": 0.0034201598355100564, "phrase": "binary_relationships"}, {"score": 0.003291188255149539, "phrase": "labeled_directed_predications_graph"}, {"score": 0.0032671775301001483, "phrase": "predications_graph"}, {"score": 0.0031903419807206685, "phrase": "hierarchical_agglomerative_clustering"}, {"score": 0.003058794851853132, "phrase": "hac"}, {"score": 0.003042032890300965, "phrase": "implicit_semantics"}, {"score": 0.0030253688063143157, "phrase": "medical_subject_heading"}, {"score": 0.002992313172550772, "phrase": "explicit_semantics"}, {"score": 0.0029759206373634285, "phrase": "mesh_hierarchy"}, {"score": 0.00291657701018444, "phrase": "semantic_relatedness"}, {"score": 0.002853183476661506, "phrase": "automatically_generated_clusters"}, {"score": 0.0024642796422450755, "phrase": "medline."}, {"score": 0.0024328782033101594, "phrase": "different_thematic_dimensions"}, {"score": 0.0024151140702162632, "phrase": "cellular_activity"}, {"score": 0.0024062805861554295, "phrase": "pharmaceutical_treatment"}, {"score": 0.0023582694348219233, "phrase": "broader_understanding"}, {"score": 0.0023027596654127554, "phrase": "statistical_evaluation"}, {"score": 0.0022444369781061246, "phrase": "arbitrary_association"}, {"score": 0.002219898560067733, "phrase": "medline"}, {"score": 0.002128272293291141, "phrase": "multiple_thematic_dimensions"}, {"score": 0.002120485727210402, "phrase": "lbd_situations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Literature-based discovery (LBD)", " Graph mining", " Path clustering", " Hierarchical agglomerative clustering", " Semantic relatedness", " Medical Subject Headings (MeSH)"], "paper_abstract": "Background: Literature-based discovery (LBD) is characterized by uncovering hidden associations in non-interacting scientific literature. Prior approaches to LBD include use of: (I) domain expertise and structured background knowledge to manually filter and explore the literature, (2) distributional statistics and graph-theoretic measures to rank interesting connections, and (3) heuristics to help eliminate spurious connections. However, manual approaches to LBD are not scalable and purely distributional approaches may not be sufficient to obtain insights into the meaning of poorly understood associations. While several graph-based approaches have the potential to elucidate associations, their effectiveness has not been fully demonstrated. A considerable degree of a priori knowledge, heuristics, and manual filtering is still required. Objectives: In this paper we implement and evaluate a context-driven, automatic subgraph creation method that captures multifaceted complex associations between biomedical concepts to facilitate LBD. Given a pair of concepts, our method automatically generates a ranked list of subgraphs, which provide informative and potentially unknown associations between such concepts. Methods: To generate subgraphs, the set of all MEDLINE articles that contain either of the two specified concepts (A, C) are first collected. Then binary relationships or assertions, which are automatically extracted from the MEDLINE articles, called semantic predications, are used to create a labeled directed predications graph. In this predications graph, a path is represented as a sequence of semantic predications. The hierarchical agglomerative clustering (HAC) algorithm is then applied to cluster paths that are bounded by the two concepts (A, C). HAC relies on implicit semantics captured through Medical Subject Heading (MeSH) descriptors, and explicit semantics from the MeSH hierarchy, for clustering. Paths that exceed a threshold of semantic relatedness are clustered into subgraphs based on their shared context. Finally, the automatically generated clusters are provided as a ranked list of subgraphs. Results: The subgraphs generated using this approach facilitated the rediscovery of 8 out of 9 existing scientific discoveries. In particular, they directly (or indirectly) led to the recovery of several intermediates (or B-concepts) between A- and C-terms, while also providing insights into the meaning of the associations. Such meaning is derived from predicates between the concepts, as well as the provenance of the semantic predications in MEDLINE. Additionally, by generating subgraphs on different thematic dimensions (such as Cellular Activity, Pharmaceutical Treatment and Tissue Function), the approach may enable a broader understanding of the nature of complex associations between concepts. Finally, in a statistical evaluation to determine the interestingness of the subgraphs, it was observed that an arbitrary association is mentioned in only approximately 4 articles in MEDLINE on average. Conclusion: These results suggest that leveraging the implicit and explicit semantics provided by manually assigned MeSH descriptors is an effective representation for capturing the underlying context of complex associations, along multiple thematic dimensions in LBD situations. Published by Elsevier Inc.", "paper_title": "Context-driven automatic subgraph creation for literature-based discovery", "paper_id": "WOS:000353932500014"}