{"auto_keywords": [{"score": 0.04891621500316524, "phrase": "arena_software"}, {"score": 0.009462741062472853, "phrase": "average_waiting_time"}, {"score": 0.004257806363128601, "phrase": "jalan_universiti"}, {"score": 0.004154332348800334, "phrase": "skudai"}, {"score": 0.0041136473765874815, "phrase": "johor"}, {"score": 0.004073368299719998, "phrase": "malaysia"}, {"score": 0.003496868378204654, "phrase": "simulation_model"}, {"score": 0.0033617891884360606, "phrase": "initial_result"}, {"score": 0.0032639039638211347, "phrase": "substantial_queue"}, {"score": 0.002943147037670826, "phrase": "improved_model"}, {"score": 0.0026538282523433684, "phrase": "entire_system"}, {"score": 0.0023811153883132536, "phrase": "traffic_problems"}], "paper_keywords": ["Traffic simulation", " Arena", " Junction"], "paper_abstract": "In this paper, the focus is on simulating the traffic of two adjacent T-junctions during rush hours located at Jalan Universiti in the city of Skudai, Johor, Malaysia. This study was conducted with the objective of simulating the traffic on the network in order to understand and analyze its bottlenecks and propose solutions to improve it. The simulation model was developed with ARENA software, and the initial result shows that there is a substantial queue in one of the routes, arm C. A model with traffic light was proposed to tackle the problem. Results obtained from the improved model revealed that the average waiting time in arm C declined by 67%. Furthermore, the average waiting time of the queues in the entire system decreased by 53%. In addition, in this paper, it was shown how Arena software can be adopted to simulate traffic problems effectively. The method in this research can be applied to investigate various traffic scenarios and their consequences before implementing them in reality. (C) 2014 Elsevier B. V. All rights reserved.", "paper_title": "Traffic simulation of two adjacent unsignalized T-junctions during rush hours using Arena software", "paper_id": "WOS:000345153100012"}