{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "impact_factor"}, {"score": 0.04874330526858656, "phrase": "digital_age"}, {"score": 0.022846179252944555, "phrase": "highly_cited_papers"}, {"score": 0.02246846748295755, "phrase": "highly_cited_journals"}, {"score": 0.004760765880314089, "phrase": "papers'_citations"}, {"score": 0.004156012879026324, "phrase": "digital_age_papers"}, {"score": 0.0035666632046674153, "phrase": "journal's_physical_availability"}, {"score": 0.0032208091960514128, "phrase": "journals'_ifs"}, {"score": 0.0031665087019813244, "phrase": "actual_citations"}, {"score": 0.0029249294679606656, "phrase": "papers'_citation_rates"}, {"score": 0.002253299769886694, "phrase": "electronic_domain"}, {"score": 0.0021655683497137234, "phrase": "overall_proportion"}], "paper_keywords": ["bibliometrics", " impact factor"], "paper_abstract": "Historically, papers have been physically bound to the journal in which they were published; but in the digital age papers are available individually, no longer tied to their respective journals. Hence, papers now can be read and cited based on their own merits, independently of the journal's physical availability, reputation, or impact factor (IF). We compare the strength of the relationship between journals' IFs and the actual citations received by their respective papers from 1902 to 2009. Throughout most of the 20th century, papers' citation rates were increasingly linked to their respective journals' IFs. However, since 1990, the advent of the digital age, the relation between IFs and paper citations has been weakening. This began first in physics, a field that was quick to make the transition into the electronic domain. Furthermore, since 1990 the overall proportion of highly cited papers coming from highly cited journals has been decreasing and, of these highly cited papers, the proportion not coming from highly cited journals has been increasing. Should this pattern continue, it might bring an end to the use of the IF as a way to evaluate the quality of journals, papers, and researchers.", "paper_title": "The weakening relationship between the impact factor and papers' citations in the digital age", "paper_id": "WOS:000310550000002"}