{"auto_keywords": [{"score": 0.0369398824318344, "phrase": "active_lifestyle_app"}, {"score": 0.01207200017428735, "phrase": "training_plans"}, {"score": 0.01185957474444145, "phrase": "motivation_instruments"}, {"score": 0.00481495049065317, "phrase": "physical_exercise"}, {"score": 0.004780633011300165, "phrase": "older_adults"}, {"score": 0.004704306096024315, "phrase": "age_reaction_time"}, {"score": 0.004596192494271827, "phrase": "gait_impairments"}, {"score": 0.004426748050451499, "phrase": "regular_balance"}, {"score": 0.004340488340181084, "phrase": "strong_barriers"}, {"score": 0.004271161727651639, "phrase": "lifestyle"}, {"score": 0.004210458358142504, "phrase": "active_and_healthy_aging"}, {"score": 0.004180431162806031, "phrase": "elderly's_balance"}, {"score": 0.004150617216058819, "phrase": "active_lifestyle"}, {"score": 0.0041283957965834875, "phrase": "proactive_training_application"}, {"score": 0.004011867299107537, "phrase": "personalized_training_plans"}, {"score": 0.0038986150699604504, "phrase": "pilot_study"}, {"score": 0.0037682573914907054, "phrase": "active_lifestyle_system"}, {"score": 0.0035393874762182486, "phrase": "personalized_two-weeks_strength"}, {"score": 0.003526735797659508, "phrase": "balance_training_plans"}, {"score": 0.0034394269654205094, "phrase": "technological_familiarity"}, {"score": 0.003378385493203297, "phrase": "physical_intervention"}, {"score": 0.003306559295382181, "phrase": "exercise_plan"}, {"score": 0.003277082799108051, "phrase": "performance_data"}, {"score": 0.002985631781749091, "phrase": "moderate_physical_activity"}, {"score": 0.002943147037670826, "phrase": "autonomous_physical_training"}, {"score": 0.002859977408815691, "phrase": "high_intention"}, {"score": 0.0027200305495826797, "phrase": "balance_exercises"}, {"score": 0.002695768552609587, "phrase": "strength_exercises"}, {"score": 0.002477998427152547, "phrase": "virtual_exercise_group"}, {"score": 0.0023736576304221398, "phrase": "active_lifestyle_app_prototype"}, {"score": 0.002348264639638066, "phrase": "physical_exercise_practice"}, {"score": 0.0022574539115388054, "phrase": "knowledge_base"}, {"score": 0.0022493742105312393, "phrase": "mobile-based_applications"}, {"score": 0.0022133711375320244, "phrase": "elderly_users"}, {"score": 0.0021896891011033105, "phrase": "mobile-based_systems"}, {"score": 0.002127765807039172, "phrase": "balance_and_strength_exercises"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Physical exercises", " Motivation", " Elderly", " Tablet", " Mobility", " Healthcare"], "paper_abstract": "Background: With age reaction time, coordination and cognition tend to deteriorate, which may lead to gait impairments, falls and injuries. To reduce this problem in elderly and to improve health, well-being and independence, regular balance and strength exercises are recommended. However, elderly face strong barriers to exercise. Objective: We developed Active Lifestyle, an IT-based system for active and healthy aging aiming at improving elderly's balance and strength. Active Lifestyle is a proactive training application, running on a tablet, which assists, monitors and motivates elderly to follow personalized training plans autonomously at home, while integrating them socially. The objective is to run a pilot study to investigate: (i) the feasibility of assisting the autonomous, physical training of independently living elderly with the Active Lifestyle system, (ii) the adherence of the participants to the training plans, and (iii) the effectiveness of the motivation instruments built into the system. Methods: After three introductory meetings, 13 elderly adults followed personalized two-weeks strength and balance training plans using the Active Lifestyle app autonomously at home. Questionnaires were used to assess the technological familiarity of the participants, the feasibility aspects of the physical intervention, and the effectiveness of the motivation instruments. Adherence to the exercise plan was evaluated using the performance data collected by the app during the study. Results: A total of 13 participants were enrolled, of whom 11 (85%) completed the study (mean age 77 +/- 7 years); predominantly females (55%), vocational educated (64%), and their past profession requiring moderate physical activity (64%). The Active Lifestyle app facilitated autonomous physical training at home (median = 7 on a 7-point Likert scale), and participants expressed a high intention to use the app also after the end of the study (median = 7). Adherence with the training plans was 73% (89% on the balance exercises and 60% on the strength exercises). The outcome from our questionnaires showed that without the app the participants did not feel motivated to perform exercises; with the support of the app they felt more motivated (median = 6). Participants were especially motivated by being part of a virtual exercise group and by the capability to automatically monitor their performance (median = 6 for both). Conclusions: This study shows that the Active Lifestyle app prototype has valuable potential to support physical exercise practice at home and it is worthwhile to further develop it into a more mature system. Furthermore, the results add to the knowledge base into mobile-based applications for elderly, in that it shows that elderly users can learn to work with mobile-based systems. The Active Lifestyle app proved viable to support and motivate independently living elderly to autonomously perform balance and strength exercises. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Motivating and assisting physical exercise in independently living older adults: A pilot study", "paper_id": "WOS:000318998000019"}