{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "categorical_account"}, {"score": 0.049496721057450455, "phrase": "conditional_probability"}, {"score": 0.0407769748728513, "phrase": "kleisli_category"}, {"score": 0.0393580690921062, "phrase": "conditional_probabilities"}, {"score": 0.03475588358113425, "phrase": "effect_modules"}, {"score": 0.004312622975366676, "phrase": "quantum_case"}, {"score": 0.004260134699483774, "phrase": "classical_conditional_probabilities"}, {"score": 0.0038154673253945003, "phrase": "distribution_monad"}, {"score": 0.0029677378488677983, "phrase": "positive_unital_maps"}, {"score": 0.0023221248824337576, "phrase": "extra_difficulties"}, {"score": 0.0022519745140925475, "phrase": "classical_case"}, {"score": 0.0021309898622781124, "phrase": "quantum_systems"}, {"score": 0.0021049977753042253, "phrase": "classical_parametrization"}], "paper_keywords": [""], "paper_abstract": "This paper presents a categorical account of conditional probability, covering both the classical and the quantum case. Classical conditional probabilities are expressed as a certain \"triangle-fill-in\" condition, connecting marginal and joint probabilities, in the Kleisli category of the distribution monad. The conditional probabilities are induced by a map together with a predicate (the condition). The latter is a predicate in the logic of effect modules on this Kleisli category. This same approach can be transferred to the category of C*-algebras (with positive unital maps), whose predicate logic is also expressed in terms of effect modules. Conditional probabilities can again be expressed via a triangle-fill-in property. In the literature, there are several proposals for what quantum conditional probability should be, and also there are extra difficulties not present in the classical case. At this stage, we only describe quantum systems with classical parametrization.", "paper_title": "Towards a Categorical Account of Conditional Probability", "paper_id": "WOS:000367346600015"}