{"auto_keywords": [{"score": 0.036030347311587774, "phrase": "expository_lecture"}, {"score": 0.03572270209581421, "phrase": "game_group"}, {"score": 0.014741759941829186, "phrase": "educational_computer_games"}, {"score": 0.012514848461670402, "phrase": "knowledge_learnt"}, {"score": 0.00481495049065317, "phrase": "educational_computer_micro-games"}, {"score": 0.004744437370338926, "phrase": "knowledge_acquisition"}, {"score": 0.004606479650820579, "phrase": "curricular_schooling"}, {"score": 0.004368142221528535, "phrase": "formal_schooling_system"}, {"score": 0.004081385289516914, "phrase": "teacher's_guidance"}, {"score": 0.0040097139701644165, "phrase": "traditional_expository_lecture"}, {"score": 0.0039276803200112695, "phrase": "game's_purpose"}, {"score": 0.003680587852807675, "phrase": "quasi-experimental_study"}, {"score": 0.0036052633308076933, "phrase": "animal_learning"}, {"score": 0.003338690782620756, "phrase": "orbis_pictus_bestialis"}, {"score": 0.00330922510644499, "phrase": "control_group"}, {"score": 0.0032800186243040663, "phrase": "extra_lecture"}, {"score": 0.0032510690712452147, "phrase": "media-rich_materials"}, {"score": 0.0032223742018434856, "phrase": "time_allotment"}, {"score": 0.0030284566685355456, "phrase": "students'_knowledge"}, {"score": 0.0028127163745564777, "phrase": "students'_overall_appeal"}, {"score": 0.0026123046533154167, "phrase": "traditional_form"}, {"score": 0.002581587777482942, "phrase": "immediate_knowledge_gains"}, {"score": 0.002551231163230566, "phrase": "significant_medium_positive_effect_size"}, {"score": 0.0022935555629405003, "phrase": "perceived_educational_value"}, {"score": 0.0022267046070925446, "phrase": "traditional_group"}, {"score": 0.002187530939295254, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive learning environments", " Multi-media/hypermedia systems", " Simulations", " Secondary education", " Applications in subject areas"], "paper_abstract": "Curricular schooling can benefit from the usage of educational computer games, but it is difficult to integrate them in the formal schooling system. Here, we investigate one possible approach to this integration, which capitalizes on using a micro-game that can be played with a teacher's guidance as a supplement after a traditional expository lecture followed by a debriefing. The game's purpose is to reinforce and integrate part of the knowledge learnt during the lecture. We investigated feasibility of this approach in a quasi-experimental study in 70 min long seminars on the topic of animal learning at 5 classes at 4 different high-schools in the Czech Republic. Each class was divided to two groups randomly. After an expository lecture, the game group played a game called Orbis Pictus Bestialis while the control group received an extra lecture that used media-rich materials. The time allotment was the same in both groups. We investigated the immediate and one month delayed effects of the game on students' knowledge reinforced and integrated by the game as well as on knowledge learnt during the expository lecture but not strengthened by the game. We also investigated students' overall appeal towards the seminar and its perceived educational value. Data from 100 students were analysed. The results showed that a) the game-playing is comparable to the traditional form of teaching concerning immediate knowledge gains and has a significant medium positive effect size regarding retention, b) the game-playing is not detrimental to information transmitted in the expository lecture but not strengthened by the game, c) perceived educational value and the overall appeal were high in the game group, nevertheless the perceived educational value was slightly lower in the game group comparing to the traditional group. Our results suggest that the proposed approach of harnessing educational computer games at high-schools is promising. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Are educational computer micro-games engaging and effective for knowledge acquisition at high-schools? A quasi-experimental study", "paper_id": "WOS:000294099000012"}