{"auto_keywords": [{"score": 0.04930231023249967, "phrase": "small_and_medium_web_companies"}, {"score": 0.03141078574781069, "phrase": "spi_success_factors"}, {"score": 0.012421384716028864, "phrase": "theoretical_framework"}, {"score": 0.005699116091990796, "phrase": "spi"}, {"score": 0.004346874334971379, "phrase": "primary_objective"}, {"score": 0.003813269577615793, "phrase": "theoretical_integration"}, {"score": 0.003782174375003052, "phrase": "comparative_analysis"}, {"score": 0.00357146811369898, "phrase": "systematic_review"}, {"score": 0.003372460634140967, "phrase": "grounded_theory-based_initial_exploratory_framework"}, {"score": 0.0025628355581338563, "phrase": "current_state"}, {"score": 0.0024903420152789135, "phrase": "overall_company_success"}, {"score": 0.0024398167078355224, "phrase": "comprehensive_theoretical_framework"}, {"score": 0.0023610946923597405, "phrase": "key_factors"}, {"score": 0.0023322317017275803, "phrase": "spi_success"}, {"score": 0.002202123699556382, "phrase": "successful_implementation"}, {"score": 0.002184137736856711, "phrase": "spi_initiatives"}, {"score": 0.002157433262687853, "phrase": "mentioned_domain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software process improvement", " Success factors", " Comparative analysis", " Theoretical integration", " Theoretical framework", " Small and medium web companies"], "paper_abstract": "Context: The context of this research is software process improvement (SPI) success factors for small and medium Web companies. Objective: The primary objective of this paper is to propose a theoretical framework of SPI success factors for small and medium Web companies. Method: The theoretical framework presented in this study aggregated the results of three previous research phases by applying principles of theoretical integration and comparative analysis. Those three previous phases were all empirical in nature, and comprise: a systematic review of SPI in small and medium Web companies [1,2]; a replication study [3] and a grounded theory-based initial exploratory framework of factors in small and medium Web companies [4]. Results: The theoretical framework includes 18 categories of SPI success factors, 148 properties of these categories and 25 corresponding relationships, which bind these categories together. With the help of these relationships, the categories and properties of SPI success factors can be directly translated into a set of guidelines, which can then be used by the practitioners of small and medium Web companies to improve the current state of SPI in their companies and achieve overall company success. Conclusion: The comprehensive theoretical framework of SPI success factors presented herein provides evidence regarding key factors for predicting SPI success for small and medium Web companies. The framework can be used as a baseline for a successful implementation of SPI initiatives in the mentioned domain. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Towards a theoretical framework of SPI success factors for small and medium web companies", "paper_id": "WOS:000336010100007"}