{"auto_keywords": [{"score": 0.02800198865330178, "phrase": "government_web_sites"}, {"score": 0.0047636063383530835, "phrase": "prevalence"}, {"score": 0.004662427600500598, "phrase": "perceived_web_site_quality"}, {"score": 0.00462919213721188, "phrase": "purpose_-_the_purpose"}, {"score": 0.0040262522882015175, "phrase": "perceived_quality"}, {"score": 0.0038708031633013086, "phrase": "advanced_economies"}, {"score": 0.0037480753312398754, "phrase": "content_analysis"}, {"score": 0.0037213333316218522, "phrase": "multiple_regression_analysis"}, {"score": 0.003603327452846714, "phrase": "descending_order"}, {"score": 0.0034890505116128606, "phrase": "social_tagging_services"}, {"score": 0.003464150192089816, "phrase": "social_networking_services"}, {"score": 0.0033905067962602515, "phrase": "advanced_countries"}, {"score": 0.003318423751430509, "phrase": "developing_countries"}, {"score": 0.0031561148083611647, "phrase": "overall_web_site_quality"}, {"score": 0.0029590338548504953, "phrase": "english"}, {"score": 0.002937879003671346, "phrase": "emerging_genres"}, {"score": 0.0028651061556017304, "phrase": "virtual_worlds"}, {"score": 0.002724909017963099, "phrase": "public_domain"}, {"score": 0.0027054473441439422, "phrase": "practical_implications"}, {"score": 0.002509284173541882, "phrase": "numerous_exemplars"}, {"score": 0.002327310963701377, "phrase": "overall_quality"}, {"score": 0.002158505888557746, "phrase": "previous_studies"}], "paper_keywords": ["Web 2.0", " Web sites", " E-government", " Web site quality", " Wikis"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the extent to which Web 2.0 applications are prevalent in government web sites, the ways in which Web 2.0 applications have been used in government web sites, as well as whether the presence of Web 2.0 applications correlates with the perceived quality of government web sites. Design/methodology/approach - Divided equally between developing and advanced economies, a total of 200 government web sites were analysed using content analysis and multiple regression analysis. Findings - The prevalence of seven Web 2.0 applications in descending order was: RSS, multimedia sharing services, blogs, forums, social tagging services, social networking services and wikis. More web sites in advanced countries include Web 2.0 applications than those in developing countries. The presence of Web 2.0 applications was found to have a correlation with the overall web site quality, and in particular, service quality. Research limitations/implications - This paper only covers government web sites in English. Emerging genres of Web 2.0 applications such as mashups and virtual worlds have not been included. Moreover the data were drawn solely from the public domain. Practical implications - Decision makers and e-government web developers may benchmark their own efforts in deploying Web 2.0 applications against this study. The numerous exemplars cited here serve as a springboard to generate more ideas on how Web 2.0 applications could be used and harnessed to improve the overall quality of government web sites. Originality/value - This paper unites two research interests: Web 2.0 and web site quality. It also extends previous studies by investigating the suite of Web 2.0 applications found in government web sites around the world.", "paper_title": "Web 2.0 applications in government web sites Prevalence, use and correlations with perceived web site quality", "paper_id": "WOS:000304637600002"}