{"auto_keywords": [{"score": 0.0427849291489154, "phrase": "desired_direction"}, {"score": 0.02052959901485677, "phrase": "informed_robots"}, {"score": 0.007614711702439746, "phrase": "second_desired_direction"}, {"score": 0.006557799134272699, "phrase": "highest_priority"}, {"score": 0.00481495049065317, "phrase": "stationary_and_non-stationary_environments"}, {"score": 0.004700027722284931, "phrase": "self-adaptive_communication_strategy"}, {"score": 0.004610058444728656, "phrase": "heading_direction"}, {"score": 0.00450000390667755, "phrase": "mobile_robots"}, {"score": 0.004287680323820891, "phrase": "small_group"}, {"score": 0.0041450181887917135, "phrase": "large_swarm"}, {"score": 0.0035679633126097115, "phrase": "second_group"}, {"score": 0.00328625950643742, "phrase": "higher_priority"}, {"score": 0.002801166393333128, "phrase": "proposed_strategy"}, {"score": 0.002592369213499121, "phrase": "self-adaptation_mechanism"}, {"score": 0.0021049977753042253, "phrase": "self-adaptive_communication"}], "paper_keywords": ["Flocking", " Communication", " Self-adaptation", " Self-organization", " Swarm intelligence", " Swarm robotics"], "paper_abstract": "We propose a self-adaptive communication strategy for controlling the heading direction of a swarm of mobile robots during flocking. We consider the problem where a small group of informed robots has to guide a large swarm along a desired direction. We consider three versions of this problem: one where the desired direction is fixed; one where the desired direction changes over time; one where a second group of informed robots has information about a second desired direction that conflicts with the first one, but has higher priority. The goal of the swarm is to follow, at all times, the desired direction that has the highest priority and, at the same time, to keep cohesion. The proposed strategy allows the informed robots to guide the swarm when only one desired direction is present. Additionally, a self-adaptation mechanism allows the robots to indirectly sense the second desired direction, and makes the swarm follow it. In experiments with both simulated and real robots, we evaluate how well the swarm tracks the desired direction and how well it maintains cohesion. We show that, using self-adaptive communication, the swarm is able to follow the desired direction with the highest priority at all times without splitting.", "paper_title": "A self-adaptive communication strategy for flocking in stationary and non-stationary environments", "paper_id": "WOS:000335748600009"}