{"auto_keywords": [{"score": 0.049198528177459636, "phrase": "conjunctive_queries"}, {"score": 0.009482323135834896, "phrase": "first-order_reducibility"}, {"score": 0.0065743560193856476, "phrase": "inconsistent_databases"}, {"score": 0.00470803361564591, "phrase": "key_dependencies"}, {"score": 0.0046394362688524475, "phrase": "recent_approaches"}, {"score": 0.004388035083357706, "phrase": "consistent_query_answering"}, {"score": 0.0037123737487801587, "phrase": "sql"}, {"score": 0.003610292749660581, "phrase": "relational_dbms."}, {"score": 0.0028087949095629955, "phrase": "known_fol-rewriting_techniques"}, {"score": 0.0023427844897844093, "phrase": "new_rewriting_method"}, {"score": 0.0021049977753042253, "phrase": "acyclicity_condition"}], "paper_keywords": [""], "paper_abstract": "Recent approaches in the research on inconsistent databases have started analyzing the first-order reducibility of consistent query answering, i.e., the possibility of identifying classes of queries whose consistent answers can be obtained by a first-order (FOL) rewriting of the query, which in turn can be easily formulated in SQL and directly evaluated through any relational DBMS. So far, the investigations in this direction have only concerned subsets of conjunctive queries over databases with key dependencies. In this paper we extend the study of first-order reducibility of consistent query answering under key dependencies to more expressive queries, in particular to unions of conjunctive queries. More specifically: (i) we analyze the applicability of known FOL-rewriting techniques for conjunctive queries in the case of unions of conjunctive queries. It turns out that such techniques are applicable only to a very restricted class of unions of conjunctive queries; (ii) to overcome the above limitations, we define a new rewriting method which is specifically tailored for unions of conjunctive queries. The method can be applied only to unions of conjunctive queries that satisfy an acyclicity condition on unions of conjunctive queries.", "paper_title": "On the first-order reducibility of unions of conjunctive queries over inconsistent databases", "paper_id": "WOS:000241726200028"}