{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer-generated_reminders"}, {"score": 0.04042828959160227, "phrase": "intervention_clinic"}, {"score": 0.022833263072505793, "phrase": "sub-saharan_africa"}, {"score": 0.01032216889174961, "phrase": "prospective_comparative_study"}, {"score": 0.00930213742028407, "phrase": "resource-limited_setting"}, {"score": 0.008352987907323375, "phrase": "control_clinic"}, {"score": 0.008237730527389412, "phrase": "order_rates"}, {"score": 0.00464998919563789, "phrase": "objective_little_evidence"}, {"score": 0.004601606675066839, "phrase": "effective_interventions"}, {"score": 0.004553725265085244, "phrase": "hiv-care_guidelines"}, {"score": 0.0044906540097516545, "phrase": "developing_countries"}, {"score": 0.004367108655796158, "phrase": "clinical_summaries"}, {"score": 0.004291617358806677, "phrase": "clinicians'_compliance"}, {"score": 0.004058670310827299, "phrase": "kenya"}, {"score": 0.0037587915908689497, "phrase": "measurements_changes"}, {"score": 0.0035670895401691536, "phrase": "computerized_reminder_system"}, {"score": 0.0034327289845581693, "phrase": "study_assignment"}, {"score": 0.0024377918036784336, "phrase": "prestudy_baseline"}, {"score": 0.002420868011656513, "phrase": "ci"}, {"score": 0.0023540798554571745, "phrase": "limitations_evaluation"}, {"score": 0.002297193869719679, "phrase": "single_institution"}, {"score": 0.002281194103324554, "phrase": "conclusions_clinical_summaries"}, {"score": 0.002241679436497571, "phrase": "clinician_compliance"}, {"score": 0.0021421082915443887, "phrase": "broad_applicability"}, {"score": 0.0021049977753042253, "phrase": "hiv_care"}], "paper_keywords": [""], "paper_abstract": "Objective Little evidence exists on effective interventions to integrate HIV-care guidelines into practices within developing countries. This study tested the hypothesis that clinical summaries with computer-generated reminders could improve clinicians' compliance with CD4 testing guidelines in the resource-limited setting of sub-Saharan Africa. Design A prospective comparative study of two randomly selected outpatient adult HIV clinics in western Kenya. Printed summaries with reminders for overdue CD4 tests were made available to clinicians in the intervention clinic but not in the control clinic. Measurements Changes in order rates for overdue CD4 tests were compared between and within the two clinics. Results The computerized reminder system identified 717 encounters (21%) with overdue 004 tests. Analysis by study assignment (regardless of summaries being printed or not) revealed that with computer-generated reminders, CD4 order rates were significantly higher in the intervention clinic compared to the control clinic (53% vs 38%, OR=1.80, CI 1.34 to 2.42, p<0.0001). When comparison was restricted to encounters where summaries with reminders were printed, order rates in intervention clinic were even higher (63%). The intervention clinic increased CD4 ordering from 42% before reminders to 63% with reminders (50% increase, OR=2.32, CI 1.67 to 3.22, p<0.0001), compared to control clinic with only 8% increase from prestudy baseline (CI 0.83 to 1.46, p=0.51). Limitations Evaluation was conducted at two clinics in a single institution. Conclusions Clinical summaries with computer-generated reminders significantly improved clinician compliance with CD4 testing guidelines in the resource-limited setting of sub-Saharan Africa. This technology can have broad applicability to improve quality of HIV care in these settings.", "paper_title": "Evaluation of computer-generated reminders to improve CD4 laboratory monitoring in sub-Saharan Africa: a prospective comparative study", "paper_id": "WOS:000288718400009"}