{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "theoretical_framework"}, {"score": 0.004691684576246597, "phrase": "social_influence"}, {"score": 0.004605565335682916, "phrase": "shared_opinion"}, {"score": 0.004438019162720755, "phrase": "membership_turnover"}, {"score": 0.004372712391262538, "phrase": "agent-based_simulations"}, {"score": 0.004276541976450121, "phrase": "advice_network"}, {"score": 0.0041515831652973794, "phrase": "broad_sense"}, {"score": 0.004120915812750583, "phrase": "shared_understandings"}, {"score": 0.003985680946956402, "phrase": "organization's_activities"}, {"score": 0.0037700424606538856, "phrase": "micro-level_model"}, {"score": 0.0036598289615980837, "phrase": "\"relative_agreement\"_approach"}, {"score": 0.003566028957296066, "phrase": "j._artif"}, {"score": 0.0031668306413359794, "phrase": "advice_tie_formation"}, {"score": 0.0030288982511487835, "phrase": "intra-organizational_networks"}, {"score": 0.002984264956378651, "phrase": "computational_evidence"}, {"score": 0.0026996706283276407, "phrase": "network_tie_formation"}, {"score": 0.0024330980793680337, "phrase": "time-related_factors"}, {"score": 0.002242206465278159, "phrase": "endogenous_hierarchy"}, {"score": 0.002152440300818582, "phrase": "combined_effects"}], "paper_keywords": ["Social influence", " Social networks", " Intra-organizational networks", " Agent-based modeling", " Opinion dynamics"], "paper_abstract": "This paper builds a theoretical framework to detect the conditions under which social influence enables persistence of a shared opinion among members of an organization over time, despite membership turnover. It develops agent-based simulations of opinion evolution in an advice network, whereby opinion is defined in the broad sense of shared understandings on a matter that is relevant for an organization's activities, and on which members have some degree of discretion. We combine a micro-level model of social influence that builds on the \"relative agreement\" approach of Deffuant et al. (J. Artif. Soc. Simul. 5:4, 2002), and a macro-level structure of interactions that includes a flow of joiners and leavers and allows for criteria of advice tie formation derived from, and grounded in, the empirical literature on intra-organizational networks. We provide computational evidence that persistence of opinions over time is possible in an organization with joiners and leavers, a result that depends on circumstances defined by mode of network tie formation (in particular, criteria for selection of advisors), individual attributes of agents (openness of newcomers to influence, as part of their socialization process), and time-related factors (turnover rate, which regulates the flow of entry and exit in the organization, and establishes a form of endogenous hierarchy based on length of stay). We explore the combined effects of these factors and discuss their implications.", "paper_title": "Opinion transmission in organizations: an agent-based modeling approach", "paper_id": "WOS:000340098300002"}