{"auto_keywords": [{"score": 0.03370894964701269, "phrase": "malicious_nodes"}, {"score": 0.00481495049065317, "phrase": "mobile_ad-hoc_network."}, {"score": 0.00473320761888448, "phrase": "technology_manet"}, {"score": 0.0026767629720554397, "phrase": "secure_route"}, {"score": 0.00249919111154604, "phrase": "high_packet_delivery_fraction"}, {"score": 0.002467228805628948, "phrase": "low_normalized_routing_load"}, {"score": 0.0023134312557290043, "phrase": "glomosim_platform"}], "paper_keywords": ["Fidelity", " Recommendation", " Blacklist", " Secure Protocol", " Glomosim"], "paper_abstract": "With advent of technology MANET is becoming more and more ubiquitous, and so is the vulnerability of such networks to attacks. In this paper, we propose a secure, lightweight, on-demand routing protocol for MANETs. It uses the concept of fidelity to allocate trust to a neighbor, thereby taking the decision whether to send data via that neighbor or not. To combat attacks efficiently new packets like report and recommendation arc used. After receiving a few of these packets a node can conclude about the behavior of a node, thereby identifying and blacklisting the malicious nodes. We try to impose bounds for the fidelity with reference to the battery of the node, which restricts a node to increase its fidelity to infinity and become dominant in the network. This protocol not only finds a secure route to transmit data. but also identifies the malicious nodes in the network. Our protocol exhibits high packet delivery fraction, with low normalized routing load and low end to end delay: which has been observed while simulating in GloMoSim platform. We have observed that our protocol performs not only better than other existing secure routing protocol in a malicious environment, but also combats, many attacks which have not been dealt with these protocols.", "paper_title": "MODIFIED FIDELITY BASED ON-DEMAND SECURE (MFBOD) ROUTING PROTOCOL IN MOBILE AD-HOC NETWORK", "paper_id": "WOS:000376028300002"}