{"auto_keywords": [{"score": 0.04933866662045337, "phrase": "hilbert_transform"}, {"score": 0.02749166741226568, "phrase": "bounded_bandlimited_signals"}, {"score": 0.023970560152199987, "phrase": "hilbert"}, {"score": 0.008360291712833725, "phrase": "peak_value"}, {"score": 0.00481495049065317, "phrase": "peak_value_behavior"}, {"score": 0.0036174746598098863, "phrase": "common_principal_value"}, {"score": 0.003345895878114341, "phrase": "classical_definition"}, {"score": 0.0030625949549620475, "phrase": "abstract_h"}, {"score": 0.002759769970554556, "phrase": "abstract_definition"}, {"score": 0.0026888503045081505, "phrase": "explicit_formula"}, {"score": 0.0022879728308318205, "phrase": "peak_value_problem"}, {"score": 0.0021049977753042253, "phrase": "growth_behavior"}], "paper_keywords": [""], "paper_abstract": "The peak value of a signal is a characteristic that has to be controlled in many applications. In this paper we analyze the peak value of the Hilbert transform for the space of bounded bandlimited signals. It is known that for this space the Hilbert transform cannot be calculated by the common principal value integral, because there are signals for which it diverges everywhere. Although the classical definition fails for , there is a more general definition of the Hilbert transform, which is based on the abstract H (1)-BMO(a\"e) duality. It was recently shown in [1] that, in addition to this abstract definition, there exists an explicit formula for calculating the Hilbert transform. Based on this formula we study properties of the Hilbert transform for the space of bounded bandlimited signals. We analyze its asymptotic growth behavior, and thereby solve the peak value problem of the Hilbert transform for this space. Further, we obtain results for the growth behavior of the Hilbert transform for the subspace of bounded bandlimited signals that vanish at infinity. By studying the properties of the Hilbert transform, we continue the work [2].", "paper_title": "Characterization of the peak value behavior of the Hilbert transform of bounded bandlimited signals", "paper_id": "WOS:000325562200001"}