{"auto_keywords": [{"score": 0.04705896781933826, "phrase": "data_sets"}, {"score": 0.04490871521163668, "phrase": "geometric-topological_consistency"}, {"score": 0.013338469701864862, "phrase": "city_models"}, {"score": 0.00481495049065317, "phrase": "transaction_rules"}, {"score": 0.004482400730101345, "phrase": "urban_objects"}, {"score": 0.004353040792349733, "phrase": "frequent_updates"}, {"score": 0.004213662826578328, "phrase": "spatial_data_quality_guarantees"}, {"score": 0.0033658327434624457, "phrase": "tremendous_efforts"}, {"score": 0.0033331024978484843, "phrase": "data_acquisition"}, {"score": 0.0031638248208086263, "phrase": "efficient_transaction_rules"}, {"score": 0.002832032388853002, "phrase": "mathematical_rigor"}, {"score": 0.002653313402950335, "phrase": "terrain_surface-complex_spatial_objects"}, {"score": 0.002585016334273749, "phrase": "interior_structures"}, {"score": 0.002390468357001542, "phrase": "topology_point"}, {"score": 0.002344158337493484, "phrase": "citygml"}], "paper_keywords": ["Transaction rules", " Consistency", " Surfaces", " 3D models", " Handles", " 2-manifolds"], "paper_abstract": "The shapes of our cities change very frequently. These changes have to be reflected in data sets representing urban objects. However, it must be assured that frequent updates do not affect geometric-topological consistency. This important aspect of spatial data quality guarantees essential assumptions on which users and applications of 3D city models rely: viz. that objects do not intersect, overlap or penetrate mutually, or completely cover one another. This raises the question how to guarantee that geometric-topological consistency is preserved when data sets are updated. Hence, there is a certain risk that plans and decisions which are based on these data sets are erroneous and that the tremendous efforts spent for data acquisition and updates become vain. In this paper, we solve this problem by presenting efficient transaction rules for updating 3D city models. These rules guarantee that geometric-topological consistency is preserved (Safety) and allow for the generation of arbitrary consistent 3D city models (Completeness). Safety as well as completeness is proven with mathematical rigor, guaranteeing the reliability of our method. Our method is applicable to 3D city models, which define-besides the terrain surface-complex spatial objects like buildings with rooms and storeys as interior structures, as well as bridges and tunnels. Those objects are represented as aggregations of solids, and their surfaces are complex from a topology point of view. 3D GIS models like CityGML, which are widely used to represent cities, provide the means to define semantics, geometry and topology, but do not address the problem of maintaining consistency. Hence, our approach complements CityGML.", "paper_title": "Provably correct and complete transaction rules for updating 3D city models", "paper_id": "WOS:000299124300005"}