{"auto_keywords": [{"score": 0.04421110906060491, "phrase": "mos"}, {"score": 0.004707188147442449, "phrase": "audio-frequency_filter"}, {"score": 0.004550029253278477, "phrase": "ultra_low-voltage"}, {"score": 0.004039995317682942, "phrase": "proposed_circuit"}, {"score": 0.0035666632046674153, "phrase": "total_power_consumption"}, {"score": 0.0032760377953971248, "phrase": "subthreshold_region"}, {"score": 0.0032208091960514128, "phrase": "current_conveyor"}, {"score": 0.0029920129598858545, "phrase": "voltage_gain"}, {"score": 0.0026701429434807496, "phrase": "ccii"}, {"score": 0.0023579143175099324, "phrase": "real_speech_signals"}, {"score": 0.0021778895748464024, "phrase": "close_agreement"}, {"score": 0.002129020447793464, "phrase": "theoretical_study"}, {"score": 0.0021049977753042253, "phrase": "simulated_responses"}], "paper_keywords": [""], "paper_abstract": "This paper presents an ultra low-voltage, ultra low-power, very compact, dynamic threshold voltage MOS transistor (DTMOS)-based CCII circuit. The proposed circuit is capable of operating under +/- A 0.2 V symmetric supply voltages. The circuit topology is very compact and consists of only four DTMOS transistors and four ordinary NMOS transistors. The total power consumption of the circuit is found as only 214 nW while all transistors are working in the subthreshold region. The current conveyor has 570 kHz 3 dB-bandwidth from X to Y terminal for the voltage gain and has low, 0.2 % following error between these terminals for inputs not exceeding +/- A 60 mV. TSMC 0.18 A mu m process technology parameters are used in the design of the proposed CCII block which is then employed in an audio-frequency, second-order, band-pass filter configuration where real speech signals are fed to the input of the filter to further investigate its characteristics. Close agreement is found between theoretical study and simulated responses.", "paper_title": "A very compact, 0.4 V DTMOS CCII employed in an audio-frequency filter", "paper_id": "WOS:000342426000010"}