{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "academic_influence"}, {"score": 0.012322789042379894, "phrase": "citing_paper"}, {"score": 0.007588756123331463, "phrase": "conventional_h-index"}, {"score": 0.004615202066192795, "phrase": "research_article"}, {"score": 0.004240116703465252, "phrase": "equal_weight"}, {"score": 0.004186534737631288, "phrase": "wide_variety"}, {"score": 0.003813669883040509, "phrase": "central_academic_influence"}, {"score": 0.0033295966773779174, "phrase": "key_references"}, {"score": 0.0032321559007422087, "phrase": "data_set"}, {"score": 0.0030847461428168614, "phrase": "automatic_feature_selection"}, {"score": 0.0030586736004285216, "phrase": "supervised_machine_learning"}, {"score": 0.0029191527226078286, "phrase": "good_performance"}, {"score": 0.002809732883291955, "phrase": "best_features"}, {"score": 0.0024114635128122783, "phrase": "influence-primed_h-index"}, {"score": 0.0021229583685841405, "phrase": "better_indicator"}, {"score": 0.0021049977753042253, "phrase": "researcher_performance"}], "paper_keywords": ["natural language processing"], "paper_abstract": "The importance of a research article is routinely measured by counting how many times it has been cited. However, treating all citations with equal weight ignores the wide variety of functions that citations perform. We want to automatically identify the subset of references in a bibliography that have a central academic influence on the citing paper. For this purpose, we examine the effectiveness of a variety of features for determining the academic influence of a citation. By asking authors to identify the key references in their own work, we created a data set in which citations were labeled according to their academic influence. Using automatic feature selection with supervised machine learning, we found a model for predicting academic influence that achieves good performance on this data set using only four features. The best features, among those we evaluated, were those based on the number of times a reference is mentioned in the body of a citing paper. The performance of these features inspired us to design an influence-primed h-index (the hip-index). Unlike the conventional h-index, it weights citations by how many times a reference is mentioned. According to our experiments, the hip-index is a better indicator of researcher performance than the conventional h-index.", "paper_title": "Measuring Academic Influence: Not All Citations Are Equal", "paper_id": "WOS:000348730000013"}