{"auto_keywords": [{"score": 0.029254443666772236, "phrase": "new_argument"}, {"score": 0.00481495049065317, "phrase": "option_status"}, {"score": 0.00457013354092966, "phrase": "comparative_evaluation"}, {"score": 0.004530552828603269, "phrase": "different_options"}, {"score": 0.00443308765153716, "phrase": "decision_criterion"}, {"score": 0.004337710093279712, "phrase": "qualitative_pessimistic_criterion"}, {"score": 0.00420760449108585, "phrase": "four-step_argumentation_process"}, {"score": 0.0033553473725594003, "phrase": "argumentative_counter-part"}, {"score": 0.003311799410921826, "phrase": "pessimistic_criterion"}, {"score": 0.002957222630196853, "phrase": "argumentation_model"}, {"score": 0.002818850283787242, "phrase": "options_changes"}, {"score": 0.0022277448907881306, "phrase": "decision_system"}, {"score": 0.0021892345747666977, "phrase": "new_arguments"}], "paper_keywords": ["Argumentation", " decision making", " revision preferences"], "paper_abstract": "Decision making is usually based on the comparative evaluation of different options by means of a decision criterion. Recently, the qualitative pessimistic criterion was articulated in terms of a four-step argumentation process: (i) to build arguments in favour/against each option, (ii) to compare and evaluate those arguments, (iii) to assign a status for each option, and (iv) to rank order the options on the basis of their status. Thus, the argumentative counter-part of the pessimistic criterion provides not only the 'best' option to the user but also the reasons justifying this recommendation. The aim of this article is to study the dynamics of this argumentation model. The idea is to study how the ordering on options changes in light of a new argument. For this purpose, we study under which conditions an option may change its status, and under which conditions the new argument has no impact on the status of options, and consequently, on the ordering. This amounts to study how the acceptability of arguments evolves when the decision system is extended by new arguments. In the article, we focus on two acceptability semantics the skeptical grounded semantics and the credulous preferred semantics.", "paper_title": "Revising option status in argument-based decision systems(1)", "paper_id": "WOS:000309469900004"}