{"auto_keywords": [{"score": 0.03502079501261028, "phrase": "pdb"}, {"score": 0.02295959876413654, "phrase": "csv"}, {"score": 0.00481495049065317, "phrase": "amino_acids"}, {"score": 0.004780334370089564, "phrase": "important_determinants"}, {"score": 0.004336556638639097, "phrase": "extensive_studies"}, {"score": 0.004274396662662802, "phrase": "high-resolution_structures"}, {"score": 0.0042436501739199495, "phrase": "protein_data_bank"}, {"score": 0.0036333693364337953, "phrase": "large_scale"}, {"score": 0.0035426543993952184, "phrase": "web-based_tool"}, {"score": 0.0034792431564692997, "phrase": "protein_structures"}, {"score": 0.0034417406427881075, "phrase": "structural_properties"}, {"score": 0.003416963042033614, "phrase": "speedb_queries"}, {"score": 0.0032367108248520277, "phrase": "interactive_use"}, {"score": 0.003190265467214105, "phrase": "standard_queries"}, {"score": 0.0031558679589831287, "phrase": "published_criteria"}, {"score": 0.00283158908387463, "phrase": "custom_queries"}, {"score": 0.002801047964786189, "phrase": "user_interface"}, {"score": 0.0026918477311176376, "phrase": "comma_separated_value"}, {"score": 0.0025962638592454974, "phrase": "case_studies"}, {"score": 0.002441477009112022, "phrase": "human_proteases"}, {"score": 0.0024151333926491878, "phrase": "disulphide_bonds"}, {"score": 0.0023890733439136586, "phrase": "predominant_type"}, {"score": 0.0023125643872311994, "phrase": "active_site"}, {"score": 0.0022711207841260767, "phrase": "substrate_specificity"}, {"score": 0.0021049977753042253, "phrase": "stability_accounts"}], "paper_keywords": [""], "paper_abstract": "Motivation: Interactions between amino acids are important determinants of the structure, stability and function of proteins. Several tools have been developed for the identification and analysis of such interactions in proteins based on the extensive studies carried out on high-resolution structures from Protein Data Bank (PDB). Although these tools allow users to identify and analyze interactions, analysis can only be performed on one structure at a time. This makes it difficult and time consuming to study the significance of these interactions on a large scale. Results: SpeeDB is a web-based tool for the identification of protein structures based on structural properties. SpeeDB queries are executed on all structures in the PDB at once, quickly enough for interactive use. SpeeDB includes standard queries based on published criteria for identifying various structures: disulphide bonds, catalytic triads and aromatic-aromatic, sulphur-aromatic, cation-pi and ionic interactions. Users can also construct custom queries in the user interface without any programming. Results can be downloaded in a Comma Separated Value (CSV) format for further analysis with other tools. Case studies presented in this article demonstrate how SpeeDB can be used to answer various biological questions. Analysis of human proteases revealed that disulphide bonds are the predominant type of interaction and are located close to the active site, where they promote substrate specificity. When comparing the two homologous G protein-coupled receptors and the two protein kinase paralogs analyzed, the differences in the types of interactions responsible for stability accounts for the differences in specificity and functionality of the structures.", "paper_title": "SpeeDB: fast structural protein searches", "paper_id": "WOS:000361757500013"}