{"auto_keywords": [{"score": 0.04765077338073387, "phrase": "scour_depth"}, {"score": 0.013986459625309438, "phrase": "regression_trees"}, {"score": 0.009962443710714461, "phrase": "free_overfall_spillways"}, {"score": 0.007175996683080713, "phrase": "empirical_formulas"}, {"score": 0.00586429999151834, "phrase": "model_trees"}, {"score": 0.005046889728693625, "phrase": "present_study"}, {"score": 0.003933118499284644, "phrase": "vital_importance"}, {"score": 0.0038431888954930083, "phrase": "soft_computing_models"}, {"score": 0.0037121208432871118, "phrase": "artificial_neural_networks"}, {"score": 0.003523822585025555, "phrase": "depth_prediction"}, {"score": 0.0027634902834910184, "phrase": "scour_depth_downstream"}, {"score": 0.002418923027024191, "phrase": "practical_prediction_equations"}, {"score": 0.0021543421286324945, "phrase": "statistical_measures"}, {"score": 0.0021049977753042253, "phrase": "proposed_soft_computing_approaches"}], "paper_keywords": ["Scour depth", " Free overfall spillways", " Model trees", " Classification and regression trees"], "paper_abstract": "The scour below spillways can endanger the stability of the dams. Hence, determining the scour depth downstream of spillways is of vital importance. Recently, soft computing models and, in particular, artificial neural networks (ANNs) have been used for scour depth prediction. However, ANNs are not as comprehensible and easy to use as empirical formulas for the estimation of scour depth. Therefore, in this study, two decision-tree methods based on model trees and classification and regression trees were employed for the prediction of scour depth downstream of free overfall spillways. The advantage of model trees and classification and regression trees compared to ANNs is that these models are able to provide practical prediction equations. A comparison between the results obtained in the present study and those obtained using empirical formulas is made. The statistical measures indicate that the proposed soft computing approaches outperform empirical formulas. Results of the present study indicated that model trees were more accurate than classification and regression trees for the estimation of scour depth.", "paper_title": "Assessment of M5 ' model tree and classification and regression trees for prediction of scour depth below free overfall spillways", "paper_id": "WOS:000330318500012"}