{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "sensor_planning"}, {"score": 0.004784565134881178, "phrase": "multi-sensor_systems"}, {"score": 0.004724365740062236, "phrase": "random_occlusion"}, {"score": 0.004664920223650814, "phrase": "multiple_sensors"}, {"score": 0.004420472010542188, "phrase": "dynamic_objects"}, {"score": 0.004269138804116089, "phrase": "user-specified_characteristics"}, {"score": 0.00398177607914381, "phrase": "good_sensor_configurations"}, {"score": 0.003906804492585634, "phrase": "better_system_performance"}, {"score": 0.003666908853711961, "phrase": "random_occluding_objects"}, {"score": 0.0036207206487324506, "phrase": "random_loss"}, {"score": 0.00330274985014172, "phrase": "\"average\"_visibility_rates"}, {"score": 0.0032302647179383915, "phrase": "worst-case_scenarios"}, {"score": 0.0031195501386327047, "phrase": "image_resolution"}, {"score": 0.003060763239325022, "phrase": "capture_orientation"}, {"score": 0.0030317852687729878, "phrase": "algorithmic_constraints"}, {"score": 0.0030030808225723266, "phrase": "stereo_matching"}, {"score": 0.0029840952148215733, "phrase": "background_appearance"}, {"score": 0.0028726685746632654, "phrase": "probabilistic_framework"}, {"score": 0.0028095957871860653, "phrase": "different_occlusion_events"}, {"score": 0.002782989122345306, "phrase": "different_multi-view_capture"}, {"score": 0.0027305272327742642, "phrase": "natural_way"}, {"score": 0.0026452734009203764, "phrase": "interest_yields"}, {"score": 0.002578985917923144, "phrase": "sensor_configuration"}, {"score": 0.0022500695985527668, "phrase": "security_systems"}, {"score": 0.0022216880365475418, "phrase": "public_places"}, {"score": 0.0022076314894741394, "phrase": "industrial_automation"}, {"score": 0.0021936636821827935, "phrase": "traffic_monitoring"}, {"score": 0.00211840221503438, "phrase": "diverse_set"}, {"score": 0.0021049977753042253, "phrase": "different_and_sometimes_multiple_system_objectives"}], "paper_keywords": ["sensor planning", " surveillance", " camera networks", " camera placement", " multi-camera vision"], "paper_abstract": "Systems utilizing multiple sensors are required in many domains. In this paper, we specifically concern ourselves with applications where dynamic objects appear randomly and the system is employed to obtain some user-specified characteristics of such objects. For such systems, we deal with the tasks of determining measures for evaluating their performance and of determining good sensor configurations that would maximize such measures for better system performance. We introduce a constraint in sensor planning that has not been addressed earlier: visibility in the presence of random occluding objects. occlusion causes random loss of object capture from certain necessitates the use of other sensors that have visibility of this object. Two techniques are developed to analyze such visibility constraints: a probabilistic approach to determine \"average\" visibility rates and a deterministic approach to address worst-case scenarios. Apart from this constraint, other important constraints to be considered include image resolution, field of view, capture orientation, and algorithmic constraints such as stereo matching and background appearance. Integration of such constraints is performed via the development of a probabilistic framework that allows one to reason about different occlusion events and integrates different multi-view capture and visibility constraints in a natural way. Integration of the thus obtained capture quality measure across the region of interest yields a measure for the effectiveness of a sensor configuration and maximization of such measure yields sensor configurations that are best suited for a given scenario. The approach can be customized for use in many multi-sensor applications and our contribution is especially significant for those that involve randomly occurring objects capable of occluding each other. These include security systems for surveillance in public places, industrial automation and traffic monitoring. Several examples illustrate such versatility by application of our approach to a diverse set of different and sometimes multiple system objectives.", "paper_title": "A general method for sensor planning in multi-sensor systems: Extension to random occlusion", "paper_id": "WOS:000252185800003"}