{"auto_keywords": [{"score": 0.03108178984361603, "phrase": "optimization_coach"}, {"score": 0.00481495049065317, "phrase": "optimization_coaching_optimizers_learn"}, {"score": 0.004600596158672458, "phrase": "compilers_map_programs"}, {"score": 0.0045411156682300695, "phrase": "high-level_languages"}, {"score": 0.004482400730101345, "phrase": "high-performance_target_language_code"}, {"score": 0.004227398267369744, "phrase": "impenetrable_black_box"}, {"score": 0.0035923719610602245, "phrase": "reverse_engineering"}, {"score": 0.003477264432055326, "phrase": "compiled_code"}, {"score": 0.0034322572683276654, "phrase": "intermediate_forms"}, {"score": 0.0025934566395017424, "phrase": "source_program"}, {"score": 0.0025102759256260703, "phrase": "suitable_synthesis"}, {"score": 0.0023062508214156123, "phrase": "case_studies"}, {"score": 0.0021049977753042253, "phrase": "substantial_performance_improvements"}], "paper_keywords": ["Optimization Coaching", " Visualization"], "paper_abstract": "Optimizing compilers map programs in high-level languages to high-performance target language code. To most programmers, such a compiler constitutes an impenetrable black box whose inner workings are beyond their understanding. Since programmers often must understand the workings of their compilers to achieve their desired performance goals, they typically resort to various forms of reverse engineering, such as examining compiled code or intermediate forms. Instead, optimizing compilers should engage programmers in a dialog. This paper introduces one such possible form of dialog: optimization coaching. An optimization coach watches while a program is compiled, analyzes the results, generates suggestions for enabling further compiler optimization in the source program, and presents a suitable synthesis of its results to the programmer. We present an evaluation based on case studies, which illustrate how an optimization coach can help programmers achieve optimizations resulting in substantial performance improvements.", "paper_title": "Optimization Coaching Optimizers Learn to Communicate with Programmers", "paper_id": "WOS:000311296200010"}