{"auto_keywords": [{"score": 0.033951251111328025, "phrase": "redips"}, {"score": 0.015719716506582538, "phrase": "business_intelligence_analysis"}, {"score": 0.009191755089820767, "phrase": "user_satisfaction"}, {"score": 0.008488238142650383, "phrase": "backlink_search_engines"}, {"score": 0.004742179945772899, "phrase": "significant_opportunities"}, {"score": 0.004565007074039171, "phrase": "company's_external_environment"}, {"score": 0.004478907336898875, "phrase": "traditional_business_intelligence_analysis"}, {"score": 0.004361077072629878, "phrase": "simple_keyword_searching"}, {"score": 0.004198082549566806, "phrase": "incoming_links"}, {"score": 0.004087609837102023, "phrase": "company's_web_site"}, {"score": 0.003934795713147731, "phrase": "hyperlink_pointing"}, {"score": 0.003802135020791801, "phrase": "important_insights"}, {"score": 0.0037589124802364384, "phrase": "company's_\"online_communities"}, {"score": 0.0036183419672924095, "phrase": "useful_signals"}, {"score": 0.00348300993356662, "phrase": "manual_analysis_process"}, {"score": 0.003378385493203297, "phrase": "business_analysts"}, {"score": 0.0031663432942179853, "phrase": "backlink_meta-searching_and_text-mining_techniques"}, {"score": 0.003024705160129876, "phrase": "architectural_design"}, {"score": 0.002567099236341096, "phrase": "manual_browsing"}, {"score": 0.002537880772794665, "phrase": "experiment_results"}, {"score": 0.0024428607154967806, "phrase": "benchmark_methods"}, {"score": 0.002324620886282579, "phrase": "search_tasks"}, {"score": 0.0021952683716334478, "phrase": "five_measures"}], "paper_keywords": [""], "paper_abstract": "The World Wide Web presents significant opportunities for business intelligence analysis as it can provide information about a company's external environment and its stakeholders. Traditional business intelligence analysis on the Web has focused on simple keyword searching. Recently, it has been suggested that the incoming links, or backlinks, of a company's Web site (i.e., other Web pages that have a hyperlink pointing to the company of interest) can provide important insights about the company's \"online communities.\" Although analysis of these communities can provide useful signals for a company and information about its stakeholder groups, the manual analysis process can be very time-consuming for business analysts and consultants. In this article, we present a tool called Redips that automatically integrates backlink meta-searching and text-mining techniques to facilitate users in performing such business intelligence analysis on the Web. The architectural design and implementation of the tool are presented in the article. To evaluate the effectiveness, efficiency, and user satisfaction of Redips, an experiment was conducted to compare the tool with two popular business intelligence analysis methods-using backlink search engines and manual browsing. The experiment results showed that Redips was statistically more effective than both benchmark methods (in terms of Recall and F-measure) but required more time in search tasks. In terms of user satisfaction, Redips scored statistically higher than backlink search engines in all five measures used, and also statistically higher than manual browsing in three measures.", "paper_title": "Redips: Backlink search and analysis on the Web for business intelligence analysis", "paper_id": "WOS:000246379400004"}