{"auto_keywords": [{"score": 0.04213965057573146, "phrase": "generic_pin_control_block"}, {"score": 0.010612387000973441, "phrase": "multimedia_soc_platforms"}, {"score": 0.008067795309504043, "phrase": "human_errors"}, {"score": 0.007816256233857882, "phrase": "generic-pin_control_block"}, {"score": 0.004534428070512318, "phrase": "increasing_design_complexity"}, {"score": 0.004439354841093929, "phrase": "decreasing_time"}, {"score": 0.004180622964109706, "phrase": "complex_multi-million_gate_soc"}, {"score": 0.0034543031591181546, "phrase": "top-level_rtl"}, {"score": 0.003417859963947459, "phrase": "early_stages"}, {"score": 0.003334309053314909, "phrase": "full-chip_interface"}, {"score": 0.003264316172836322, "phrase": "inherent_several_design_issues"}, {"score": 0.0031397776924946526, "phrase": "relatively_late_stages"}, {"score": 0.002998688867384969, "phrase": "limited_pins"}, {"score": 0.0029775511937434797, "phrase": "frequent_changes"}, {"score": 0.0029565620771207003, "phrase": "pin_assignment"}, {"score": 0.0029150253706493852, "phrase": "current_design_approaches"}, {"score": 0.002784007794229784, "phrase": "design_productivity"}, {"score": 0.002764379205581817, "phrase": "design_reusability"}, {"score": 0.002735194789581153, "phrase": "shorter_time"}, {"score": 0.002575526825728026, "phrase": "traditional_rtl_description"}, {"score": 0.0024597305738431226, "phrase": "design_automation_based_approach"}, {"score": 0.0023742031943872464, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "manual_description"}], "paper_keywords": ["Generic pin control block", " Design automation", " Multimedia system-on-a-chip"], "paper_abstract": "Multimedia system-on-a-chip (SoC) platform designs nowadays are facing some conflicting issues regarding product development. One is induced by increasing design complexity and another is induced by decreasing time-to-market. Hence, designers are seeking a more efficient and reliable methodology in order to design complex multi-million gate SoC under such harsh conditions. In particular, the complexity of a generic pin control block in multimedia SoC which implements input/output (I/O) paths for off-chip communication has increased exponentially in recent years. Accordingly, the possibility of introducing human errors in designing such block has grown. Operation of generic-pin control block needs to be validated with a top-level RTL from the early stages of design, which correctly checks full-chip interface. However, generic-pin control block has inherent several design issues since function registers and multi-I/O paths are usually fixed in the relatively late stages of design. Also, the role of a generic pin control block that shares limited pins causes frequent changes in pin assignment. Therefore, current design approaches of a generic pin control block are no longer adequate to meet the challenges of design productivity, design reusability, and shorter time-to-market for design. And, this results in many possible human errors when using a traditional RTL description. As a response to this problem, this paper presents a design automation based approach to reduce the possibility of human errors. In the case study presented, we succeeded in auto-generating a generic pin control block in multimedia SoC platforms which has more than 300 general purpose I/O interfaces including both input and output, as well as 900 PAD pins. Ultimately, we reduced the amount of manual description for generating a generic pin control block by a whopping 97 %.", "paper_title": "Design of configurable I/O pin control block for improving reusability in multimedia SoC platforms", "paper_id": "WOS:000361492600026"}