{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "transitional_probabilities"}, {"score": 0.01197576071136645, "phrase": "tobacco_control"}, {"score": 0.005745835885652704, "phrase": "cross-sectional_survey_data"}, {"score": 0.004775726266706856, "phrase": "discrete_event_systems"}, {"score": 0.004736820055728928, "phrase": "cross-sectional_survey"}, {"score": 0.0045284072672385975, "phrase": "better_strategies"}, {"score": 0.004258843584164121, "phrase": "tobacco_use"}, {"score": 0.0040713749949601915, "phrase": "longitudinal_surveys"}, {"score": 0.0038603905208013482, "phrase": "cross-sectional_surveys"}, {"score": 0.00347054319869429, "phrase": "previous_research"}, {"score": 0.003069230909006614, "phrase": "discrete_event_system_framework"}, {"score": 0.0029824560656987855, "phrase": "state_probabilities"}, {"score": 0.002933973181012572, "phrase": "conventional_discrete_event_system_models"}, {"score": 0.0027141975147496264, "phrase": "cross-sectional_data"}, {"score": 0.002659142621852998, "phrase": "estimated_transitional_probabilities"}, {"score": 0.002583931950389087, "phrase": "future_smoking_behavior"}, {"score": 0.0024298350266697905, "phrase": "sensitivity_analysis"}, {"score": 0.002184137736856711, "phrase": "new_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Discrete event systems", " Tobacco control", " Smoking behavior", " Cross-sectional survey", " Transitional probability"], "paper_abstract": "In order to find better strategies for tobacco control, it is often critical to know the transitional probabilities among various stages of tobacco use. Traditionally, such probabilities are estimated by analyzing data from longitudinal surveys that are often time-consuming and expensive to conduct. Since cross-sectional surveys are much easier to conduct, it will be much more practical and useful to estimate transitional probabilities from cross-sectional survey data if possible. However, no previous research has attempted to do this. In this paper, we propose a method to estimate transitional probabilities from cross-sectional survey data. The method is novel and is based on a discrete event system framework. In particular, we introduce state probabilities and transitional probabilities to conventional discrete event system models. We derive various equations that can be used to estimate the transitional probabilities. We test the method using cross-sectional data of the National Survey on Drug Use and Health. The estimated transitional probabilities can be used in predicting the future smoking behavior for decision-making, planning and evaluation of various tobacco control programs. The method also allows a sensitivity analysis that can be used to find the most effective way of tobacco control. Since there are much more cross-sectional survey data in existence than longitudinal ones, the impact of this new method is expected to be significant. Published by Elsevier Inc.", "paper_title": "Estimation of transitional probabilities of discrete event systems from cross-sectional survey and its application in tobacco control", "paper_id": "WOS:000272779900008"}