{"auto_keywords": [{"score": 0.04961597900198376, "phrase": "francis_turbine_runner"}, {"score": 0.04534889107930672, "phrase": "moderate_flow_heads"}, {"score": 0.020777969892256755, "phrase": "pressure_pulses"}, {"score": 0.012771465420122738, "phrase": "blade_channel_vortex"}, {"score": 0.009389121881850654, "phrase": "runner_blade_passage"}, {"score": 0.008945656634335355, "phrase": "turbine_operating_regions"}, {"score": 0.008717694398582597, "phrase": "unsteady_flow_behavior"}, {"score": 0.008041784861040705, "phrase": "high_heads"}, {"score": 0.007786212346852073, "phrase": "operating_conditions"}, {"score": 0.00481495049065317, "phrase": "blade_channel_vortices"}, {"score": 0.004175066536037121, "phrase": "moderate_and_high_heads"}, {"score": 0.003619910789366738, "phrase": "numerical_modeling"}, {"score": 0.003493021648360933, "phrase": "unsteady_reynolds-averaged_navier-stokes_equations"}, {"score": 0.003459191419478298, "phrase": "k-omega-based_shear_stress_transport_turbulence_model"}, {"score": 0.003348764681887211, "phrase": "entire_flow_passage"}, {"score": 0.0033163269450817716, "phrase": "francis_turbine"}, {"score": 0.0032629585038738856, "phrase": "dominate_frequency"}, {"score": 0.00323134923196813, "phrase": "predicted_pressure_pulses"}, {"score": 0.003210446135114967, "phrase": "runner_inlet"}, {"score": 0.0031690434364310435, "phrase": "experimental_results"}, {"score": 0.003038125530190128, "phrase": "passing_frequency"}, {"score": 0.0030086877092638945, "phrase": "simulated_peak-to-peak_amplitudes"}, {"score": 0.002903161412792026, "phrase": "head_cover"}, {"score": 0.002828740624702789, "phrase": "different_positions"}, {"score": 0.002599763359352916, "phrase": "rotor-stator_interference"}, {"score": 0.002327998222143962, "phrase": "pressure_pulses_characteristics"}, {"score": 0.002268287853885277, "phrase": "pulse_characteristics"}, {"score": 0.0021049977753042253, "phrase": "safe_operating_regions"}], "paper_keywords": ["Turbines", " Vortices", " Flow", " Vibration"], "paper_abstract": "Purpose - The purpose of this paper is to investigate, experimentally and numerically, the pressure pulse characteristics and unsteady flow behavior in a Francis turbine runner for moderate flow heads. The pressure pulses in the runner blade passage were predicted numerically for both moderate and high heads. The calculations were used to partition the turbine operating regions and to clarify the various for the unsteady flow behavior, especially the blade channel vortex in the runner. Design/methodology/approach - Experimental and numerical analyses of pressure pulse characteristics at moderate flow heads in a Francis turbine runner were then extended to high heads through numerical modeling with 3D unsteady numerical simulations performed for a number of operating conditions. The unsteady Reynolds-averaged Navier-Stokes equations with the k-omega-based shear stress transport turbulence model were used to model the unsteady flow within the entire flow passage of a Francis turbine. Findings - The dominate frequency of the predicted pressure pulses at runner inlet agree with the experimental results in the head cover at moderate flow heads. The influence of the blade passing frequency causes the simulated peak-to-peak amplitudes in the runner inlet to be larger than in the head cover. The measured and predicted pressure pulses at different positions along the runner are comparable. At the most unstable operating condition of 0.5a(0) guide vane opening, the pressure pulses in the runner blade passage are due to the blade channel vortex and the rotor-stator interference. The predictions show that the frequency of the blade channel vortex is relatively low and it changes with the operating conditions. Originality/value - The paper describes a study which experimentally and numerically investigated the pressure pulses characteristics in a Francis turbine runner at moderate flow heads. The pulse characteristics and unsteady flow behavior due to the blade channel vortex in the runner at high heads were investigated numerically, with the turbine operating regions then partitioned to identify safe operating regions.", "paper_title": "Experimental and numerical analysis of blade channel vortices in a Francis turbine runner", "paper_id": "WOS:000289390600009"}