{"auto_keywords": [{"score": 0.03899661662596745, "phrase": "epidemiological_models"}, {"score": 0.015719716506582538, "phrase": "infectious_disease"}, {"score": 0.004775918707955445, "phrase": "clinical_reports"}, {"score": 0.00462291551375938, "phrase": "significant_threat"}, {"score": 0.004585433265422727, "phrase": "human_health"}, {"score": 0.00434906528856802, "phrase": "important_problem"}, {"score": 0.004244102948402086, "phrase": "bayesian_framework"}, {"score": 0.004192571571622019, "phrase": "clinical_diagnosis"}, {"score": 0.00407474190126995, "phrase": "epidemiological_modeling"}, {"score": 0.004041686156098498, "phrase": "disease_outbreaks"}, {"score": 0.003680212979775528, "phrase": "population_disease"}, {"score": 0.0034060348526709634, "phrase": "influenza_outbreaks"}, {"score": 0.003378385493203297, "phrase": "emergency_department"}, {"score": 0.0031650944584992726, "phrase": "ed_reports"}, {"score": 0.0031012349116334606, "phrase": "natural_language_processing"}, {"score": 0.0028236336891860592, "phrase": "high_posterior_probability"}, {"score": 0.0027666443986705453, "phrase": "specific_diseases"}, {"score": 0.002438043578514396, "phrase": "real_influenza_outbreak"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Infectious disease", " Outbreak detection", " Outbreak characterization", " Clinical reports", " Bayesian modeling"], "paper_abstract": "Outbreaks of infectious disease can pose a significant threat to human health. Thus, detecting and characterizing outbreaks quickly and accurately remains an important problem. This paper describes a Bayesian framework that links clinical diagnosis of individuals in a population to epidemiological modeling of disease outbreaks in the population. Computer-based diagnosis of individuals who seek healthcare is used to guide the search for epidemiological models of population disease that explain the pattern of diagnoses well. We applied this framework to develop a system that detects influenza outbreaks from emergency department (ED) reports. The system diagnoses influenza in individuals probabilistically from evidence in ED reports that are extracted using natural language processing. These diagnoses guide the search for epidemiological models of influenza that explain the pattern of diagnoses well. Those epidemiological models with a high posterior probability determine the most likely outbreaks of specific diseases; the models are also used to characterize properties of an outbreak, such as its expected peak day and estimated size. We evaluated the method using both simulated data and data from a real influenza outbreak. The results provide support that the approach can detect and characterize outbreaks early and well enough to be valuable. We describe several extensions to the approach that appear promising. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A method for detecting and characterizing outbreaks of infectious disease from clinical reports", "paper_id": "WOS:000351483600003"}