{"auto_keywords": [{"score": 0.03276147191325942, "phrase": "ccm"}, {"score": 0.023002484190972644, "phrase": "landslide_deposits"}, {"score": 0.008758492252376153, "phrase": "landscape_scale"}, {"score": 0.00481495049065317, "phrase": "automated_identification"}, {"score": 0.004708943089688438, "phrase": "common_hazard"}, {"score": 0.0045599093158915326, "phrase": "existing_landslides"}, {"score": 0.004329018365016614, "phrase": "current_landslide_mapping_techniques"}, {"score": 0.00427578268550103, "phrase": "photogrammetric_approaches"}, {"score": 0.004059219816495496, "phrase": "sufficient_resolution"}, {"score": 0.0037873702600771286, "phrase": "landslide_features"}, {"score": 0.003413232230649291, "phrase": "novel_algorithm"}, {"score": 0.0033132678117350984, "phrase": "proposed_method"}, {"score": 0.0032724821705972357, "phrase": "contour_connection_method"}, {"score": 0.0032003250098869397, "phrase": "bare_earth"}, {"score": 0.0031687663385997615, "phrase": "minimal_user_input"}, {"score": 0.003137517890457956, "phrase": "landslide_scarp"}, {"score": 0.0031220090519585592, "phrase": "deposit_gradients"}, {"score": 0.0029344771385297137, "phrase": "associated_landslide_features"}, {"score": 0.0028273937857143765, "phrase": "detection_capabilities"}, {"score": 0.002737745536992088, "phrase": "different_landscape_features"}, {"score": 0.0026906533796551544, "phrase": "landslide_feature"}, {"score": 0.002670719148310961, "phrase": "distinct_set"}, {"score": 0.002618278365749875, "phrase": "connection_vectors"}, {"score": 0.0025668646315794947, "phrase": "unique_signature"}, {"score": 0.002418587525752333, "phrase": "oso_landslide"}, {"score": 0.0024066297724089293, "phrase": "washington"}, {"score": 0.002336072645379359, "phrase": "oregon"}, {"score": 0.0022010965931147735, "phrase": "limited_data_requirements"}, {"score": 0.0021739716876211608, "phrase": "manual_delineation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Landslides", " Lidar", " Detection", " Automation", " Algorithm"], "paper_abstract": "Landslides are a common hazard worldwide that result in major economic, environmental and social impacts. Despite their devastating effects, inventorying existing landslides, often the regions at highest risk of reoccurrence, is challenging, time-consuming, and expensive. Current landslide mapping techniques include field inventorying, photogrammetric approaches, and use of bare-earth (BE) lidar digital terrain models (DTMs) to highlight regions of instability. However, many techniques do not have sufficient resolution, detail, and accuracy for mapping across landscape scale with the exception of using BE DTMs, which can reveal the landscape beneath vegetation and other obstructions, highlighting landslide features, including scarps, deposits, fans and more. Current approaches to landslide inventorying with lidar to create BE DTMs include manual digitizing, statistical or machine learning approaches, and use of alternate sensors (e.g., hyperspectral imaging) with lidar. This paper outlines a novel algorithm to automatically and consistently detect landslide deposits on a landscape scale. The proposed method is named as the Contour Connection Method (CCM) and is primarily based on bare earth lidar data requiring minimal user input such as the landslide scarp and deposit gradients. The CCM algorithm functions by applying contours and nodes to a map, and using vectors connecting the nodes to evaluate gradient and associated landslide features based on the user defined input criteria. Furthermore, in addition to the detection capabilities, CCM also provides an opportunity to be potentially used to classify different landscape features. This is possible because each landslide feature has a distinct set of metadata - specifically, density of connection vectors on each contour - that provides a unique signature for each landslide. In this paper, demonstrations of using CCM are presented by applying the algorithm to the region surrounding the Oso landslide in Washington (March 2014), as well as two 14,000 ha DTMs in Oregon, which were used as a comparison of CCM and manually delineated landslide deposits. The results show the capability of the CCM with limited data requirements and the agreement with manual delineation but achieving the results at a much faster time. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Contour Connection Method for automated identification and classification of landslide deposits", "paper_id": "WOS:000347135300003"}