{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electroporation_pulses"}, {"score": 0.009261628571073918, "phrase": "adverse_effects"}, {"score": 0.00457696724030363, "phrase": "effective_antitumor_treatment"}, {"score": 0.004485085675709643, "phrase": "cutaneous_and_subcutaneous_tumors"}, {"score": 0.004011603024990615, "phrase": "vulnerable_period"}, {"score": 0.00351582806482809, "phrase": "human_patients"}, {"score": 0.0033588449972778004, "phrase": "pathological_morphological_changes"}, {"score": 0.0031926001871260524, "phrase": "transient_rr_interval_decrease"}, {"score": 0.0027835848648596513, "phrase": "internal_tumors"}, {"score": 0.0027414948679658816, "phrase": "tumor_ablation"}, {"score": 0.002713788077665689, "phrase": "irreversible_electroporation"}, {"score": 0.002618995204424126, "phrase": "longer_durations"}, {"score": 0.0024766636161181544, "phrase": "electroporation_pulse_delivery"}, {"score": 0.0023539789234610763, "phrase": "clinical_electroporation"}, {"score": 0.002159170788765385, "phrase": "anatomical_locations"}, {"score": 0.0021049977753042253, "phrase": "existing_electroporation_devices"}], "paper_keywords": ["electrochemotherapy", " electrocardiogram", " QRS detection", " synchronization of electroporation pulse delivery with ECG"], "paper_abstract": "Electrochemotherapy is an effective antitumor treatment currently applied to cutaneous and subcutaneous tumors. Electrochemotherapy of tumors located close to the heart could lead to adverse effects, especially if electroporation pulses were delivered within the vulnerable period of the heart or if they coincided with arrhythmias of some types. We examined the influence of electroporation pulses on functioning of the heart of human patients by analyzing the electrocardiogram. We found no pathological morphological changes in the electrocardiogram; however, we demonstrated a transient RR interval decrease after application of electroporation pulses. Although no adverse effects due to electroporation have been reported so far, the probability for complications could increase in treatment of internal tumors, in tumor ablation by irreversible electroporation, and when using pulses of longer durations. We evaluated the performance of our algorithm for synchronization of electroporation pulse delivery with electrocardiogram. The application of this algorithm in clinical electroporation would increase the level of safety for the patient and suitability of electroporation for use in anatomical locations presently not accessible to existing electroporation devices and electrodes.", "paper_title": "The effect of electroporation pulses on functioning of the heart", "paper_id": "WOS:000258117900002"}