{"auto_keywords": [{"score": 0.024837456166928628, "phrase": "kobayashi"}, {"score": 0.004449949342789427, "phrase": "node's_channel_inputs"}, {"score": 0.004284166465861172, "phrase": "potentially_larger_rates"}, {"score": 0.0042220541146047825, "phrase": "feedback-free_one-way_channels"}, {"score": 0.003959241745942114, "phrase": "capacity_perspective"}, {"score": 0.0039018217318645115, "phrase": "analogous_results"}, {"score": 0.0038116701882911935, "phrase": "deterministic_two-way_channel_models"}, {"score": 0.003584773870468151, "phrase": "gaussian_channels"}, {"score": 0.00356387956365613, "phrase": "high_snr."}, {"score": 0.0035327654197058345, "phrase": "deterministic_models"}, {"score": 0.0034815088791360443, "phrase": "capacity_region"}, {"score": 0.0033911075605164804, "phrase": "two-way_z_channel"}, {"score": 0.003351683787996572, "phrase": "two-way_interference_channel"}, {"score": 0.003124552067168583, "phrase": "linear_high-snr_two-way_interference_channel"}, {"score": 0.0029212989109921594, "phrase": "fully_or_partially_adaptive_capacity_region"}, {"score": 0.0024944216175108126, "phrase": "partial_adaptation"}, {"score": 0.002387303305494832, "phrase": "strong_and_weak_interference_regimes"}, {"score": 0.002345752181173428, "phrase": "nonadaptive_han"}, {"score": 0.002251583976324954, "phrase": "constant_gap"}, {"score": 0.0022319010540230847, "phrase": "symmetric_rate"}], "paper_keywords": ["Two-way channel", " two-way interference channel", " adaptation", " interaction", " two-way MAC/BC"], "paper_abstract": "Most wireless communication networks are two-way, where nodes act as both sources and destinations of messages. This allows for adaptation at or interaction between the nodes-a node's channel inputs may be functions of its message(s) and previously received signals allowing for potentially larger rates than those achievable in feedback-free one-way channels where inputs are functions of messages only. However, examples exist of channels where adaptation is not beneficial from a capacity perspective. We ask whether analogous results hold for several multiuser two-way networks. We first consider deterministic two-way channel models: the binary modulo-2 addition channel and a generalization of this, and the linear deterministic channel, which models Gaussian channels at high SNR. For these deterministic models, we obtain the capacity region for the two-way multiple access/broadcast channel (MAC/BC), the two-way Z channel, and the two-way interference channel (under certain partial adaptation constraints in some regimes). We permit all nodes to adapt their channel inputs to past outputs (except for portions of the linear high-SNR two-way interference channel where we only permit two of the four nodes to fully adapt). However, we show that the two-way fully or partially adaptive capacity region consists of two parallel one-way regions operating simultaneously in opposite directions, i.e., adaptation is useless. We next consider two noisy channel models: 1) the Gaussian two-way MAC/BC, where we show that adaptation can at most increase the sum-rate by (1/2) bit in each direction and 2) the two-way interference channel, where partial adaptation is shown to be useless when the interference is very strong. In the strong and weak interference regimes, we show that the nonadaptive Han and Kobayashi scheme utilized in parallel in both directions achieves to within a constant gap for the symmetric rate of the fully (for some regimes) or partially (for the remaining regimes) adaptive models. The central technical contribution is the derivation of new, computable outer bounds which allow for adaptation.", "paper_title": "Two-Way Networks: When Adaptation is Useless", "paper_id": "WOS:000331902400032"}