{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rapid_growth"}, {"score": 0.0033163269450817716, "phrase": "gossip-style_overlay_construction_issue"}, {"score": 0.0029763124376934787, "phrase": "constructed_overlay"}, {"score": 0.0028195727965553367, "phrase": "scheduling_problem"}, {"score": 0.002789226820897593, "phrase": "data-driven_streaming_system"}, {"score": 0.0027001292153471202, "phrase": "classical_min-cost_network_flow_problem"}, {"score": 0.0025167026017217926, "phrase": "system_throughput"}, {"score": 0.002436289099444074, "phrase": "layered_video_coding"}, {"score": 0.002410058288617039, "phrase": "data-driven_protocol"}, {"score": 0.0023079225317714793, "phrase": "end-host_heterogeneity"}, {"score": 0.0022101055924375725, "phrase": "real-world_traces"}, {"score": 0.0021394674440767124, "phrase": "conventional_ad_hoc_scheduling_strategies"}, {"score": 0.0021049977753042253, "phrase": "stringent_buffer_and_bandwidth_constraints"}], "paper_keywords": ["Peer-to-peer", " data driven", " block scheduling", " min cost flow", " throughput", " delivery ratio"], "paper_abstract": "During recent years, the Internet has witnessed a rapid growth in deployment of data-driven (or swarming based) peer-to-peer (P2P) media streaming. In these applications, each node independently selects some other nodes as its neighbors (i.e., gossip-style overlay construction) and exchanges streaming data with the neighbors (i.e., data scheduling). To improve the performance of such protocol, many existing works focus on the gossip-style overlay construction issue. However, few of them concentrate on optimizing the streaming data scheduling to maximize the throughput of a constructed overlay. In this paper, we analytically study the scheduling problem in data-driven streaming system and model it as a classical min-cost network flow problem. We then propose both the global optimal scheduling scheme and distributed heuristic algorithm to optimize the system throughput. Furthermore, we introduce layered video coding into data-driven protocol and extend our algorithm to deal with the end-host heterogeneity. The results of simulation with the real-world traces indicate that our distributed algorithm significantly outperforms conventional ad hoc scheduling strategies especially in stringent buffer and bandwidth constraints.", "paper_title": "Optimizing the Throughput of Data-Driven Peer-to-Peer Streaming", "paper_id": "WOS:000261175300009"}