{"auto_keywords": [{"score": 0.04876985276069077, "phrase": "qoi"}, {"score": 0.004606023493393774, "phrase": "recently_introduced_composite_metric"}, {"score": 0.004009555045206973, "phrase": "traditional_quality-of-service_metrics"}, {"score": 0.003730465168354817, "phrase": "operational_information_content_sum_capacity"}, {"score": 0.0033384259516301223, "phrase": "sum_quality"}, {"score": 0.0028260302580927856, "phrase": "optimum_rate_allocation"}, {"score": 0.002763919794139171, "phrase": "output_sum_quality"}, {"score": 0.0026881926384093088, "phrase": "oicc-s"}, {"score": 0.0024323098907299027, "phrase": "maximum_throughput"}, {"score": 0.0023525345110929326, "phrase": "resource_allocation"}, {"score": 0.0021763973978248005, "phrase": "practical_scenarios"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Quality of information", " Rate allocation", " Network utility maximization"], "paper_abstract": "This paper considers Quality-of-Information (QoI) aware resource allocation policies for multiuser networks. QoI is a recently introduced composite metric which is impacted by a number of attributes of information communicated from the source(s) to the destination(s), and as such differs from traditional quality-of-service metrics considered to date. The focus of this work is defining the Operational Information Content Sum Capacity (OICC-S) of a network, achieved by the set of information attributes supported that maximize sum quality of the network. This quality is defined as a function of the information attributes provided by the source input, as well as the channel induced attributes that impact the QoI delivered to the destination(s). Optimum rate allocation to maximize the output sum quality of information and achieve OICC-S of the network for various settings is provided, and demonstrated to differ from the solution that provides maximum throughput, making QoI-awareness necessary in resource allocation. Insights arising from the analysis are provided, along with those from practical scenarios. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Operational information content sum capacity: From theory to practice", "paper_id": "WOS:000347602900001"}