{"auto_keywords": [{"score": 0.04827337430415872, "phrase": "bayesian_models"}, {"score": 0.02100250097595899, "phrase": "cognitive_science"}, {"score": 0.0045162169185355, "phrase": "human_learning"}, {"score": 0.003726633715317847, "phrase": "bayesian"}, {"score": 0.0033845816848753073, "phrase": "modeled_inference"}, {"score": 0.0032359856233193504, "phrase": "standard_accounts"}, {"score": 0.003133844153806967, "phrase": "bayesian_inference"}, {"score": 0.002901627749562029, "phrase": "posterior_expected_utility"}, {"score": 0.002864628676257225, "phrase": "experimental_confirmation"}, {"score": 0.0024714996534331668, "phrase": "probability_matching"}, {"score": 0.002378114613631841, "phrase": "bayesian_claim"}, {"score": 0.00220177373403577, "phrase": "underlying_notion"}, {"score": 0.0021049977753042253, "phrase": "bayesian_model"}], "paper_keywords": ["Bayesian modeling", " Rationality", " Levels of explanation", " Methodology in cognitive science"], "paper_abstract": "Bayesian models of human learning are becoming increasingly popular in cognitive science. We argue that their purported confirmation largely relies on a methodology that depends on premises that are inconsistent with the claim that people are Bayesian about learning and inference. Bayesian models in cognitive science derive their appeal from their normative claim that the modeled inference is in some sense rational. Standard accounts of the rationality of Bayesian inference imply predictions that an agent selects the option that maximizes the posterior expected utility. Experimental confirmation of the models, however, has been claimed because of groups of agents that \"probability match\" the posterior. Probability matching only constitutes support for the Bayesian claim if additional unobvious and untested (but testable) assumptions are invoked. The alternative strategy of weakening the underlying notion of rationality no longer distinguishes the Bayesian model uniquely. A new account of rationality-either for inference or for decision-making-is required to successfully confirm Bayesian models in cognitive science.", "paper_title": "Confirmation in the Cognitive Sciences: The Problematic Case of Bayesian Models", "paper_id": "WOS:000292559200002"}