{"auto_keywords": [{"score": 0.0493653882313026, "phrase": "binary_vector"}, {"score": 0.04889532068804289, "phrase": "particle_swarm_optimization"}, {"score": 0.00481495049065317, "phrase": "dna_computation"}, {"score": 0.0046491050101721545, "phrase": "deoxyribonucleic_acid"}, {"score": 0.003673675864705682, "phrase": "dna-based_nanotechnology"}, {"score": 0.0036370297611938796, "phrase": "polymerase_chain_reaction"}, {"score": 0.003441891354624516, "phrase": "dna_templates"}, {"score": 0.0032246835734680377, "phrase": "dna_sequences"}, {"score": 0.00242266141176955, "phrase": "dna_sequence_design_problem"}, {"score": 0.0023745087648471613, "phrase": "objective_functions"}, {"score": 0.002224510044064184, "phrase": "good_sequences"}], "paper_keywords": ["binary particle swarm optimization", " vector evaluated PSO", " DNA sequence design", " multi objective optimization"], "paper_abstract": "Deoxyribonucleic Acid (DNA) has certain unique properties such as self-assembly and self-complementary in hybridization, which are important in many DNA-based technologies. DNA computing, for example, uses these properties to realize a computation, in vitro, which consists of several chemical reactions. Other DNA-based technologies such as DNA-based nanotechnology and polymerase chain reaction also depend on hybridization to assemble nanostructure and to amplify DNA templates, respectively. Hybridization of DNA can be controlled by properly designing DNA sequences. In this study, sequences are designed such that each sequence uniquely hybridizes to its complementary sequence, but not to any other sequences. This objective can be formulated using four objective functions, namely, similarity, H-measure, continuity, and hairpin. Binary vector evaluated particle swarm optimization (Binary VEPSO) is employed to solve the DNA sequence design problem by minimizing the objective functions subjected to two constraints: melting temperature and GC(content). Several set of good sequences are produced, which are better than other research works where only a set of sequences is generated.", "paper_title": "A DNA Sequence Design for DNA Computation Based on Binary Vector Evaluated Particle Swarm Optimization", "paper_id": "WOS:000305599300002"}