{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "complementary_tv_sound_system"}, {"score": 0.0046164478775379105, "phrase": "directional_array_radiator"}, {"score": 0.004199101289890982, "phrase": "particular_direction"}, {"score": 0.004089991141220082, "phrase": "volume_boost"}, {"score": 0.004025885154716127, "phrase": "speech_intelligibility"}, {"score": 0.003529149828147388, "phrase": "reverberant_level"}, {"score": 0.003437387719239532, "phrase": "listening_room"}, {"score": 0.003226744277130179, "phrase": "phase-shift_enclosures"}, {"score": 0.0031761255583359726, "phrase": "hypercardioid_directivity"}, {"score": 0.0022544399432457164, "phrase": "anechoic_and_reverberant_environments"}, {"score": 0.0021385822825864425, "phrase": "high_directivity"}, {"score": 0.0021049977753042253, "phrase": "reverberant_environment"}], "paper_keywords": ["personal audio", " array signal processing", " beamforming", " hearing aid"], "paper_abstract": "A directional array radiator is presented, the aim of which is to enhance the sound of the television in a particular direction and hence provide a volume boost to improve speech intelligibility for the hard of hearing. The sound radiated by the array in other directions is kept low, so as not to increase the reverberant level of sound in the listening room. The array uses 32 loudspeakers, each of which are in phase-shift enclosures to generate hypercardioid directivity, which reduces the radiation from the back of the array. The loudspeakers are arranged in 8 sets of 4 loudspeakers, each set being driven by the same signal and stacked vertically, to improve the directivity in this plane. This creates a 3D beamformer that only needs 8 digital filters to be made superdirective. The performance is assessed by means of simulations and measurements in anechoic and reverberant environments. The results show how the array obtains a high directivity in a reverberant environment.", "paper_title": "Personal Audio Loudspeaker Array as a Complementary TV Sound System for the Hard of Hearing", "paper_id": "WOS:000342783900002"}