{"auto_keywords": [{"score": 0.03695898751500435, "phrase": "nash-reduction"}, {"score": 0.02322730111336099, "phrase": "nash_equilibria"}, {"score": 0.02248866351395557, "phrase": "rational_nash"}, {"score": 0.010137080941678757, "phrase": "irrational_nash"}, {"score": 0.008719175006993034, "phrase": "nash"}, {"score": 0.008085459327505318, "phrase": "irrational_nash."}, {"score": 0.007798847601711471, "phrase": "nash-equivalence"}, {"score": 0.006299760517272428, "phrase": "nash_equilibrium"}, {"score": 0.004276794599014972, "phrase": "strategic_game"}, {"score": 0.004124630249202334, "phrase": "rational_nash_equilibrium"}, {"score": 0.004057258742593542, "phrase": "rational_numbers"}, {"score": 0.003452357563167821, "phrase": "mutual_properties"}, {"score": 0.003076152130543236, "phrase": "rational_nash."}, {"score": 0.002908459938852865, "phrase": "corresponding_strategy_sets"}, {"score": 0.0028234043335210895, "phrase": "former_game"}, {"score": 0.0027680831622262027, "phrase": "latter_game"}, {"score": 0.0023474939616099106, "phrase": "np"}, {"score": 0.002241211637194952, "phrase": "conitzer"}, {"score": 0.0022264688769696945, "phrase": "sandholm"}, {"score": 0.002211961691360326, "phrase": "proceedings"}, {"score": 0.002175626278359828, "phrase": "artificial_intelligence"}, {"score": 0.0021049977753042253, "phrase": "games_econ"}], "paper_keywords": ["Complexity theory", " Decision problems", " Strategic games", " Nash equilibria"], "paper_abstract": "We introduce two new natural decision problems, denoted as there exists RATIONAL NASH and there exists IRRATIONAL NASH, pertinent to the rationality and irrationality, respectively, of Nash equilibria for (finite) strategic games. These problems ask, given a strategic game, whether or not it admits (i) a rational Nash equilibrium where all probabilities are rational numbers, and (ii) an irrational Nash equilibrium where at least one probability is irrational, respectively. We are interested here in the complexities of there exists RATIONAL NASH and there exists IRRATIONAL NASH. Towards this end, we study two other decision problems, denoted as NASH-EQUIVALENCE and NASH-REDUCTION, pertinent to some mutual properties of the sets of Nash equilibria of two given strategic games with the same number of players. The problem NASH-EQUIVALENCE asks whether or not the two sets of Nash equilibria coincide; we identify a restriction of its complementary problem that witnesses there exists RATIONAL NASH. The problem NASH-REDUCTION asks whether or not there is a so called Nash reduction: a suitable map between corresponding strategy sets of players that yields a Nash equilibrium of the former game from a Nash equilibrium of the latter game; we identify a restriction of NASH-REDUCTION that witnesses there exists IRRATIONAL NASH. As our main result, we provide two distinct reductions to simultaneously show that (i) NASH-EQUIVALENCE is co-NP-hard and there exists RATIONAL NASH is NP-hard, and (ii) NASH-REDUCTION and there exists IRRATIONAL NASH are both NP-hard, respectively. The reductions significantly extend techniques previously employed by Conitzer and Sandholm (Proceedings of the 18th Joint Conference on Artificial Intelligence, pp. 765-771, 2003; Games Econ. Behav. 63(2), 621-641, 2008).", "paper_title": "Complexity of Rational and Irrational Nash Equilibria", "paper_id": "WOS:000332831400008"}