{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "load_balancing_strategies"}, {"score": 0.00475924837336259, "phrase": "finite_element_computations"}, {"score": 0.004704187604192605, "phrase": "heterogeneous_clusters"}, {"score": 0.004412494693940597, "phrase": "adaptive_finite_clement_computation"}, {"score": 0.003904713104101532, "phrase": "particular_processor"}, {"score": 0.003726967166630923, "phrase": "processor_hardware"}, {"score": 0.0036838048761094933, "phrase": "dynamic_factors"}, {"score": 0.00357806560856829, "phrase": "system_load"}, {"score": 0.003093054709625219, "phrase": "finite_element"}, {"score": 0.0029694040368299624, "phrase": "processor_topology"}, {"score": 0.0026892447164623247, "phrase": "finite_element_analysis"}, {"score": 0.002142161017595363, "phrase": "adjacent_processors"}, {"score": 0.0021049977753042253, "phrase": "numerical_experiments"}], "paper_keywords": [""], "paper_abstract": "We study strategies for redistributing the load in an adaptive finite clement computation performed oil a cluster of workstations. The cluster is assumed to be a heterogeneous, multi-user computing environment. The performance of a particular processor depends on both static factors, such as the processor hardware and dynamic factors, such as the system load and the work of other users. On a network, it is assumed that all processors are connected, but the topology of the finite element sub-domains can be interpreted as a processor topology and hence for each processor, it is possible to define set of neighbours. In finite element analysis, the quantity of computation on a processor is proportional to the size of the sub-domain plus some contribution from the neighbours. We consider schemes that modify the sub-domains by, in general, moving data to adjacent processors. The numerical experiments show the efficiency of the approach.", "paper_title": "Study of load balancing strategies for finite element computations on heterogeneous clusters", "paper_id": "WOS:000237003200135"}