{"auto_keywords": [{"score": 0.03985183123337808, "phrase": "and-or_graph_models"}, {"score": 0.00481495049065317, "phrase": "sketch_representation"}, {"score": 0.0047823219739028325, "phrase": "generalized_samples"}, {"score": 0.004606759374526927, "phrase": "object_categorization"}, {"score": 0.00457553517865013, "phrase": "sketch_graphs"}, {"score": 0.004117647922204903, "phrase": "stochastic_context"}, {"score": 0.004103662938882996, "phrase": "free_grammar"}, {"score": 0.003979907786856535, "phrase": "markov_random_field"}, {"score": 0.0038862297330905836, "phrase": "computation_efficiency"}, {"score": 0.003718045060236861, "phrase": "sequential_tests"}, {"score": 0.0036928221419965253, "phrase": "cascaded_object_categorization"}, {"score": 0.0034733518170738517, "phrase": "small_data"}, {"score": 0.003357091486708983, "phrase": "varied_appearance"}, {"score": 0.0032892054393958052, "phrase": "and-or_graph_model"}, {"score": 0.0029798924689472014, "phrase": "different_representation_spaces"}, {"score": 0.0029196116767956273, "phrase": "candidate_matches"}, {"score": 0.0026002844796442818, "phrase": "object_instances"}, {"score": 0.0023717148226629105, "phrase": "small_candidate"}, {"score": 0.0023000698178350415, "phrase": "top-down_graph_matching_algorithm"}, {"score": 0.002261204313587616, "phrase": "proposed_approach"}, {"score": 0.0022382002476510573, "phrase": "challenging_public_dataset"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Object categorization", " And-Or graph", " Generalized samples", " Cascaded inference"], "paper_abstract": "In this paper, we present a framework for object categorization via sketch graphs that incorporate shape and structure information. In this framework, we integrate the learnable And-Or graph model, a hierarchical structure that combines the reconfigurability of a stochastic context free grammar (SCFG) with the constraints of a Markov random field (MRF). Considering the computation efficiency, we generalize instances from the And-Or graph models and perform a set of sequential tests for cascaded object categorization, rather than directly inferring with the And-Or graph models. We study 33 categories, each consisting of a small data set of 30 instances, and 30 additional templates with varied appearance are generalized from the learned And-Or graph model. These samples better span the appearance space and form an augmented training set Omega(T) of 1980 (60 x 33) training templates. To perform recognition on a testing image, we use a set of sequential tests to project Omega(T) into different representation spaces to narrow the number of candidate matches in Omega(T). We use \"graphlets\" (structural elements), as our local features and model Omega(T) at each stage using histograms of graphlets over categories, histograms of graphlets over object instances, histograms of pairs of graphlets over objects, and shape context. Each test is increasingly computationally expensive, and by the end of the cascade we have a small candidate set remaining to use with our most powerful test, a top-down graph matching algorithm. We apply the proposed approach on the challenging public dataset including 33 object categories, and achieve state-of-the-art performance. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Object categorization with sketch representation and generalized samples", "paper_id": "WOS:000305845300007"}