{"auto_keywords": [{"score": 0.044165905127240876, "phrase": "policy_problems"}, {"score": 0.015719716506582538, "phrase": "digital_divide"}, {"score": 0.0153463762989802, "phrase": "e-readiness_indicators"}, {"score": 0.014555485442410762, "phrase": "networked_readiness_index"}, {"score": 0.014416079064866274, "phrase": "nri"}, {"score": 0.0037392451233558234, "phrase": "policy_analysis"}, {"score": 0.0035965032173588753, "phrase": "findings_-_e-readiness_assessment_tools"}, {"score": 0.003310951184365485, "phrase": "new_information_and_communication_technologies"}, {"score": 0.0029031614127920232, "phrase": "international_digital_divide"}, {"score": 0.0028333356794133053, "phrase": "particular_way"}, {"score": 0.0026466064623118105, "phrase": "international_organizations"}, {"score": 0.002570385604065795, "phrase": "sustained_attention"}, {"score": 0.002400944221804575, "phrase": "alternative_indicators"}, {"score": 0.002320449502337321, "phrase": "wider_range"}, {"score": 0.0021049977753042253, "phrase": "e-readiness_indicators_exits"}], "paper_keywords": ["economic policy", " social policy", " communication technologies", " electronic commerce", " Internet"], "paper_abstract": "Purpose - To show how e-readiness indicators, specifically the Networked Readiness Index (NRI), participate in the work of defining policy problems. Design/methodology/approach - The article critically examines the Networked Readiness Index in terms of its presentation and its underlying model. It relies on an approach to policy analysis that views policy problems as socially constructed. Findings - E-readiness assessment tools purport to show how ready the nations of the world are to exploit the potential of new information and communication technologies. Yet they do more than that; being actively engaged in constructing policy problems. In the case of the NRI, the problem of the international digital divide is defined in a particular way that privileges certain interests while at the same time legitimatizing its inclusion on the agenda of international organizations as a problem worthy of sustained attention. Practical implications - The findings of the article suggest a need for alternative indicators that register the voices of a wider range of groups and could therefore create a more inclusive digital divide policy problem. Originality/value - Little critical (as opposed to technical) analysis of e-readiness indicators exits in the literature. By focusing on these tools, the article contributes to the debate surrounding the issue of the digital divide.", "paper_title": "Defining the digital divide: the role of e-readiness indicators", "paper_id": "WOS:000239576800001"}