{"auto_keywords": [{"score": 0.04953787572055814, "phrase": "frequent_patterns"}, {"score": 0.012981034629628664, "phrase": "fp-growth_algorithm"}, {"score": 0.00481495049065317, "phrase": "item-transformation_methods"}, {"score": 0.004706699397060569, "phrase": "fundamental_and_crucial_task"}, {"score": 0.004671156704912419, "phrase": "data-mining_problems"}, {"score": 0.004168994230311561, "phrase": "apriori"}, {"score": 0.003748937184382714, "phrase": "large_databases"}, {"score": 0.0036368625017975343, "phrase": "simple_approach"}, {"score": 0.0027671619871474764, "phrase": "logic-circuit_version"}, {"score": 0.002735816302446788, "phrase": "first_one"}, {"score": 0.0026843584448921565, "phrase": "simple_logic_gates"}, {"score": 0.002350196395175188, "phrase": "transformation-function_version"}, {"score": 0.0022972306948217548, "phrase": "apriori_and_fp-growth_ones"}, {"score": 0.002254003531073337, "phrase": "simulation_results"}, {"score": 0.0022200068884960836, "phrase": "mapping-table_version"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["data mining", " frequent pattern", " Apriori", " gray code", " item transformation"], "paper_abstract": "Mining frequent patterns is a fundamental and crucial task in data-mining problems. The algorithms reported in the literature for mining frequent patterns can be classified into two approaches: the candidate generation-and-test approach (for example, the Apriori algorithm) and the pattern-growth approach (such as the FP-growth algorithm). The approaches both suffered from the problems that their speed is slow for large databases. This paper proposes a novel and simple approach, which does not belong to the above two approaches. This approach treats the database as a stream of data and finds frequent patterns by scanning the database only once. In addition, the approach can incrementally mine frequent patterns if the database is updated or inserted subsequently. Three versions of the approach (i.e., mapping-table, transformation-function, and logic-circuit) are provided. The logic-circuit version is the first one that mines frequent patterns by simple logic gates, and the modeling of this version shows its speed is thousands of times faster than that of the FP-growth algorithm. Analyses and simulations of the approach are also performed. Analyses show that the transformation-function version is much better than the Apriori and FP-growth ones in storage complexity. Simulation results show that the mapping-table version is comparable to the FP-growth algorithm in execution time. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A new approach to mine frequent patterns using item-transformation methods", "paper_id": "WOS:000248769100010"}