{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "joint_source-channel_coding_algorithm"}, {"score": 0.004592016716046632, "phrase": "measurable_degradation"}, {"score": 0.004545598514506788, "phrase": "compression_performance"}, {"score": 0.00427673687759065, "phrase": "input_sequence"}, {"score": 0.004106353084467526, "phrase": "multiple_matches"}, {"score": 0.003850299959557491, "phrase": "particular_choice"}, {"score": 0.003811350661783412, "phrase": "additional_bits"}, {"score": 0.0036968421974412522, "phrase": "embedded_redundant_information"}, {"score": 0.003585761649472705, "phrase": "longest_matches"}, {"score": 0.0034780071331554003, "phrase": "logarithmic_series_distribution"}, {"score": 0.0032061793819537633, "phrase": "redundant_bits"}, {"score": 0.0031203609829058587, "phrase": "highly_desirable_property"}, {"score": 0.0030992666061123533, "phrase": "error_correction"}, {"score": 0.0030678912980325337, "phrase": "analytic_results"}, {"score": 0.002955627747525381, "phrase": "mellin"}, {"score": 0.002724428781940696, "phrase": "suffix_tree"}, {"score": 0.002511349409241358, "phrase": "channel_coder"}, {"score": 0.002477510561675515, "phrase": "reed-solomon"}, {"score": 0.0024029583021102255, "phrase": "inherent_additional_redundancy"}, {"score": 0.002322767202375341, "phrase": "limited_number"}], "paper_keywords": ["autocorrelation polynomial", " combinatorics on words", " depoissonization", " joint source-channel coding", " Lempel-Ziv'77 (LZ'77) scheme", " Mellin transform", " multiple matches", " pattern matching", " Reed-Solomon (RS) code", " suffix trees", " tries"], "paper_abstract": "We propose a joint source-channel coding algorithm capable of correcting some errors in the popular Lempel-Ziv'77 (LZ'77)scheme without introducing any measurable degradation in the compression performance. This can be achieved because the LZ'77 encoder does not completely eliminate the redundancy present in the input sequence. One source of redundancy can be observed when an LZ'77 phrase has multiple matches. In this case, LZ'77 can issue a pointer to any of those matches, and a particular choice carries some additional bits of information. We call a scheme with embedded redundant information the LZS'77 algorithm. We analyze the number of longest matches in such a scheme and prove that it follows the logarithmic series distribution with mean 1/h (plus some fluctuations), where h is the source entropy. Thus, the distribution associated with the number of redundant bits is well concentrated around its mean, a highly desirable property for error correction. These analytic results are proved by a combination of combinatorial, probabilistic, and analytic methods (e.g., Mellin transform, depoissonization, combinatorics on words). In fact, we analyze LZRS'77 by studying the multiplicity matching parameter in a suffix tree, which in turn is analyzed via comparison to its independent version, called trie. Finally, we present an algorithm in which a channel coder (e.g., Reed-Solomon (RS) coder) succinctly uses the inherent additional redundancy left by the LZS'77 encoder to detect and correct a limited number of errors. We call such a scheme the LZS'77 algorithm. LZRS'77 is perfectly backward-compatible with LZ'77, that is, a file compressed with our error-resistant LZRS'77 can still be decompressed by a generic LZ'77 decoder.", "paper_title": "Error resilient LZ'77 data compression: Algorithms, analysis, and experiments", "paper_id": "WOS:000246034600014"}