{"auto_keywords": [{"score": 0.04849105041601803, "phrase": "cyfluthrin_molecule"}, {"score": 0.04676225036470504, "phrase": "cyfluthrin"}, {"score": 0.004815380910142558, "phrase": "structural"}, {"score": 0.004734454645951977, "phrase": "qsar"}, {"score": 0.004425616928975799, "phrase": "synthetic_cyano-containing_pyrethroid_insecticide"}, {"score": 0.0043150485532080065, "phrase": "stomach_poison_action"}, {"score": 0.0042250123967577284, "phrase": "nonsysternic_chemical"}, {"score": 0.003982741546775355, "phrase": "tobacco_budworm"}, {"score": 0.0032800186243040663, "phrase": "public_health_situations"}, {"score": 0.0032387402145603412, "phrase": "structural_pest_control"}, {"score": 0.003014422649429416, "phrase": "molecular_mechanics_method"}, {"score": 0.0026011063516171774, "phrase": "molecule"}, {"score": 0.0022713722522505592, "phrase": "homo_energy_level"}, {"score": 0.0021682027434117095, "phrase": "lumo_energy_level"}], "paper_keywords": ["cyfluthrin", " semi-empirical methods", " AM1 and PM3 calculatios", " QSAR"], "paper_abstract": "Cyfluthrin is a synthetic cyano-containing pyrethroid insecticide that has both contact and stomach poison action. It is a nonsysternic chemical used to control cutworms, ants, silverfish, cockroaches, mosquitoes, tobacco budworm and many others. Its primary agricultural uses have been for control of chewing and sucking insects on crops such as cotton, turf, ornamentals, hops, cereal, corn, deciduous fruit, peanuts, potatoes, and other vegetables. Cyfluthrin is also used in public health situations and for structural pest control. The structural, vibrational, electronic and QSAR properties of the cyfluthrin molecule in gas phase have been investigated theoretically by performing molecular mechanics method by using MM+ force field, and semi-empirical molecular orbital AM1 and PM3 calculations. The geometry of the molecule has been optimized, infrared spectrum (vibrational modes and intensities) and the electronic properties of the Molecule have been calculated in its ground state. Acording to PM3 calculation, heat of formation of cyfluthrin molecule is about -48.58 kcal/mol (exothermic), which shows that this molecule thermodynamically be stable. The HOMO energy level for this molecule is found to be -9.701 eV and the LUMO energy level is -0.660 eV giving rise to a gap of 9.041 eV, which also indicates that cyfluthrin is thermodynamically stable.", "paper_title": "Structural, electronic and QSAR properties of the cyfluthrin molecule: A theoretical AM1 and PM3 treatment", "paper_id": "WOS:000242248700002"}