{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "artificial_institutions"}, {"score": 0.004675930527604869, "phrase": "artificial_institution"}, {"score": 0.004487989502479992, "phrase": "open_and_dynamic_interaction_frameworks"}, {"score": 0.0044356867986444426, "phrase": "heterogeneous_and_autonomous_agents"}, {"score": 0.004014923642015515, "phrase": "clear_standard_definition"}, {"score": 0.0039449104968131655, "phrase": "basic_concepts"}, {"score": 0.0034673190692473903, "phrase": "event_driven_approach"}, {"score": 0.0030833537429977797, "phrase": "crucial_differences"}, {"score": 0.0025254115243261875, "phrase": "different_artificial_institutions"}, {"score": 0.002142426911242168, "phrase": "dutch_auction_institution"}], "paper_keywords": [""], "paper_abstract": "The notion of artificial institution is crucial for the specification of open and dynamic interaction frameworks where heterogeneous and autonomous agents can interact to face problems in various fields. In our view the specification of artificial institutions requires a clear standard definition of some basic concepts: the notion of ontology, authorizations, conventions, and the normative component. In this paper we propose an event driven approach to the definition of norms that is mainly based on the manipulation of commitments. We will discuss the crucial differences between the notion of authorization and permission and how the notion of permissions, obligations, and prohibitions can be expressed in our model. We will investigate the connections among the specification of different artificial institutions, in particular how an institution can enrich or further regulate the entities defined in another one. Finally we will briefly present the specification of the Dutch Auction Institution and of the Auction House Institution in order to exemplify the model presented in this paper.", "paper_title": "An event driven approach to norms in artificial institutions", "paper_id": "WOS:000239580700010"}