{"auto_keywords": [{"score": 0.030926517488363503, "phrase": "binding_sites"}, {"score": 0.023851118326826744, "phrase": "viral_mirnas"}, {"score": 0.00481495049065317, "phrase": "mirna_binding_sites"}, {"score": 0.004222388726840072, "phrase": "'seed'_targets"}, {"score": 0.0038476708316022823, "phrase": "target_regulation"}, {"score": 0.0036553070575015344, "phrase": "putative_evolutionarily-conserved_seed-containing_targets"}, {"score": 0.0035173498506324476, "phrase": "mirna_binding_patterns"}, {"score": 0.0034172979799535386, "phrase": "non-conserved_sites"}, {"score": 0.003113804826864362, "phrase": "centered_sites"}, {"score": 0.00299622333197717, "phrase": "target_profile"}, {"score": 0.0028100102841877835, "phrase": "different_mirnas"}, {"score": 0.0027920359090544107, "phrase": "individual_target_profiles"}, {"score": 0.0026268961477241026, "phrase": "compensatory_sites"}, {"score": 0.0025034338848015166, "phrase": "common_seed_sequences"}, {"score": 0.0024399717841513354, "phrase": "target_sets"}, {"score": 0.00236289633510808, "phrase": "non-conventional_mirna_targets"}, {"score": 0.002280916026414715, "phrase": "non-conserved_viral_mirnas"}, {"score": 0.002251813863195168, "phrase": "cellular_targets"}, {"score": 0.002166711569953301, "phrase": "cellular_mirna"}, {"score": 0.0021049977753042253, "phrase": "virus-host_interactions"}], "paper_keywords": [""], "paper_abstract": "Motivation: Over the past decade, deciphering the roles of microRNAs (miRNAs) has relied heavily upon the identification of their targets. Most of the targets that were computationally and experimentally characterized were evolutionarily conserved 'seed' targets, containing a perfect 6-8 nt match between the miRNA 5'-region and the messenger RNA (mRNA). Gradually, it has become evident that other types of miRNA binding can confer target regulation, but their characterization has been lagging behind. Results: Here, we complement the putative evolutionarily-conserved seed-containing targets by a wide repertoire of putative targets exhibiting a variety of miRNA binding patterns, predicted by our algorithm RepTar. These include non-conserved sites, 'seed' binding sites with G:U-wobbles within the seed, '3(') compensatory' sites and 'centered' sites. Apart from the centered sites, we demonstrate the functionality of these sites and characterize the target profile of a miRNA by the types of binding sites predicted in its target 3(') UTRs. We find that different miRNAs have individual target profiles, with some more inclined to seed binding and others more inclined to binding through 3(') compensatory sites. This diversity in targeting patterns is also evident within several miRNA families (defined by common seed sequences), leading to divergence in the target sets of members of the same family. The prediction of non-conventional miRNA targets is also beneficial in the search for targets of the non-conserved viral miRNAs. Analyzing the cellular targets of viral miRNAs, we show that viral miRNAs use various binding patterns to exploit cellular miRNA binding sites and suggest roles for these targets in virus-host interactions.", "paper_title": "A wide repertoire of miRNA binding sites: prediction and functional implications", "paper_id": "WOS:000296637500003"}