{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "contour_parts"}, {"score": 0.04934325842114903, "phrase": "shape_similarity"}, {"score": 0.01411989991490529, "phrase": "digital_images"}, {"score": 0.008452695280585468, "phrase": "known_contour_segments"}, {"score": 0.004145143433523008, "phrase": "complete_object_contours"}, {"score": 0.004039423410198574, "phrase": "whole_objects"}, {"score": 0.0035681790580031998, "phrase": "segmented_regions"}, {"score": 0.0033190180867511605, "phrase": "promising_as_well_as_a_necessary_research_direction"}, {"score": 0.0027982016314450717, "phrase": "contour_part"}, {"score": 0.002755104031926742, "phrase": "contour_grouping"}, {"score": 0.0025361866386341796, "phrase": "shape-based_classification"}, {"score": 0.0024971144603069006, "phrase": "retrieved_contour_parts"}, {"score": 0.002445950676329976, "phrase": "simultaneous_detection"}, {"score": 0.0023834640793589435, "phrase": "important_step"}, {"score": 0.0022399174232611853, "phrase": "first_complete_contours"}, {"score": 0.0022168460543913787, "phrase": "known_objects"}, {"score": 0.0021490449563443025, "phrase": "discrete_curve_evolution"}], "paper_keywords": ["shape similarity", " parts of visual form", " detection of contour parts"], "paper_abstract": "Due to distortion, noise, segmentation errors, overlap, and occlusion of objects in digital images, it is usually impossible to extract complete object contours or to segment the whole objects. However, in many cases pails of contours can be correctly reconstructed either by performing edge grouping or as parts of boundaries of segmented regions. Therefore, recognition of objects based on their contour parts seems to be a promising as well as a necessary research direction. The main contribution of this paper is a system for detection and recognition of contour parts in digital images. Both detection and recognition are based on shape similarity of contour parts. For each contour part produced by contour grouping, we use shape similarity to retrieve the most similar contour parts in a database of known contour segments. A shape-based classification of the retrieved contour parts performs then a simultaneous detection and recognition. An important step in our approach is the construction of the database of known contour segments. First complete contours of known objects are decomposed into parts using discrete curve evolution. Then, their representation is constructed that is invariant to scaling, rotation, and translation. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Detection and recognition of contour parts based on shape similarity", "paper_id": "WOS:000255818900008"}