{"auto_keywords": [{"score": 0.03331457820270331, "phrase": "faulty_nodes"}, {"score": 0.02556638506390357, "phrase": "packet_delivery_ratio"}, {"score": 0.024015607060209648, "phrase": "ftar"}, {"score": 0.00481495049065317, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.004776733095138182, "phrase": "reliable"}, {"score": 0.004663636232080366, "phrase": "mobile_ad_hoc_network"}, {"score": 0.004517055580214742, "phrase": "major_concern"}, {"score": 0.004463278123628969, "phrase": "open_medium"}, {"score": 0.0036993855514735746, "phrase": "packet_loss"}, {"score": 0.003583002730249742, "phrase": "routing_protocols"}, {"score": 0.0034152340901585374, "phrase": "routing_algorithm"}, {"score": 0.003334309053314909, "phrase": "based_fault-tolerant_routing_algorithm"}, {"score": 0.0031028232755683674, "phrase": "multipath_routing"}, {"score": 0.003005151718290603, "phrase": "learning_automata"}, {"score": 0.002981597544032881, "phrase": "la"}, {"score": 0.0026654155072292707, "phrase": "proposed_algorithm"}, {"score": 0.0026022112631368223, "phrase": "existing_routing_protocol"}, {"score": 0.0024901940672239784, "phrase": "network_simulator"}, {"score": 0.002326464619238653, "phrase": "existing_protocols"}, {"score": 0.0022987068521717765, "phrase": "proposed_protocol"}, {"score": 0.00215618069221718, "phrase": "aodv"}], "paper_keywords": ["MANET", " Learning Automata", " Optimization", " Routing", " Fault-tolerance"], "paper_abstract": "Reliable routing of packets in a Mobile Ad Hoc Network (MANET) has always been a major concern. The open medium and the susceptibility of the nodes of being fault-prone make the design of protocols for these networks a challenging task. The faults in these networks, which occur either due to the failure of nodes or due to reorganization, can eventuate to packet loss. Such losses degrade the performance of the routing protocols running on them. In this paper, we propose a routing algorithm, named as learning automata based fault-tolerant routing algorithm (LAFTRA), which is capable of routing in the presence of faulty nodes in MANETs using multipath routing. We have used the theory of Learning Automata (LA) for optimizing the selection of paths, reducing the overhead in the network, and for learning about the faulty nodes present in the network. The proposed algorithm can be juxtaposed to any existing routing protocol in a MANET. The results of simulation of our protocol using network simulator 2 (ns-2) shows the increase in packet delivery ratio and decrease in overhead compared to the existing protocols. The proposed protocol gains an edge over FTAR, E2FT by nearly 2% and by more than 10% when compared with AODV in terms of packet delivery ratio with nearly 30% faulty nodes in the network. The overhead generated by our protocol is lesser by 1% as compared to FTAR and by nearly 17% as compared to E2FT when there are nearly 30% faulty nodes.", "paper_title": "A learning automata-based fault-tolerant routing algorithm for mobile ad hoc networks", "paper_id": "WOS:000308110300002"}