{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "synchronous_distributed_systems"}, {"score": 0.01546614325152956, "phrase": "synchronous_distributed_system"}, {"score": 0.012162206776950915, "phrase": "time_efficiency"}, {"score": 0.012063367515670316, "phrase": "consensus_protocols"}, {"score": 0.011027163208847154, "phrase": "crash_failures"}, {"score": 0.007916677068514615, "phrase": "orderly_crash_failures"}, {"score": 0.004697655699119423, "phrase": "n_processes"}, {"score": 0.003422371752150812, "phrase": "early_stopping_consensus_protocol"}, {"score": 0.0032979090806670493, "phrase": "rotating_coordinator_scheme"}, {"score": 0.003244050414264445, "phrase": "message_complexity"}, {"score": 0.0028670988845838296, "phrase": "message_efficiency"}, {"score": 0.002544296663333569, "phrase": "proposed_consensus_protocol"}, {"score": 0.0022300169122921906, "phrase": "optimal_message"}, {"score": 0.002193559776999383, "phrase": "consensus_protocol"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["consensus", " synchronous distributed systems", " message efficient", " orderly crash failure", " early stopping"], "paper_abstract": "For a synchronous distributed system of n processes with up to t potential and f actual crash failures, where (t < n - 1, f <= t), the time lower bound for a protocol to achieve consensus is min(t + 1, f + 2) rounds. Currently, most researches in this field focus on the time efficiency of consensus protocols. This paper proposes consensus protocols for synchronous distributed systems that achieve both message and time efficiency. Based on an early stopping consensus protocol for synchronous distributed system with crash failures, we propose a rotating coordinator scheme that significantly reduces message complexity. However, this protocol is not time efficient because it requires min(t + 1, f + 3) rounds to reach consensus. Thus, to achieve both time and message efficiency, we propose another protocol in which (t + 1) coordinators are used to send messages in each round. Furthermore, we show that the proposed consensus protocol with crash failures can be revised to be more message-efficient with orderly crash failures. When a process is able to send more than one message to another in a round, we propose an optimal message efficient early stopping consensus protocol for synchronous distributed systems with orderly crash failures. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Message and time efficient consensus protocols for synchronous distributed systems", "paper_id": "WOS:000255765100006"}