{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rectangular_partition"}, {"score": 0.03657526290162966, "phrase": "edge_guards"}, {"score": 0.03313913076064621, "phrase": "vertex_cover"}, {"score": 0.004697655699119423, "phrase": "non-overlapping_rectangles"}, {"score": 0.004569095351567258, "phrase": "common_point"}, {"score": 0.004527024978801684, "phrase": "vertex_guard"}, {"score": 0.004088946559031241, "phrase": "edge_guard"}, {"score": 0.0037621210719690594, "phrase": "minimum-cardinality_guarding_set"}, {"score": 0.0036590692974951718, "phrase": "vertex_guards"}, {"score": 0.003078158564144202, "phrase": "cubic_planar_graphs"}, {"score": 0.0029937855454238507, "phrase": "second_np-hardness_results"}, {"score": 0.0029479120854134996, "phrase": "graph-theoretic_result"}, {"score": 0.00284065508239492, "phrase": "plane_graph"}, {"score": 0.0028231611341151368, "phrase": "vertex_degree"}, {"score": 0.002637675827548546, "phrase": "internal_face"}, {"score": 0.002621428624654101, "phrase": "distinct_vertex"}, {"score": 0.0025495426598675605, "phrase": "face's_boundary"}, {"score": 0.0022117133940361025, "phrase": "worst-case_upper_bound"}, {"score": 0.002137782483718478, "phrase": "rectangular_partitions"}], "paper_keywords": ["Rectangular partitions", " guarding", " matching", " face-respecting coloring", " NP-hardness"], "paper_abstract": "A rectangular partition is a partition of a rectangle into non-overlapping rectangles, such that no four rectangles meet at a common point. A vertex guard is a guard located at a vertex of the partition (i.e., at a corner of a rectangle); it guards the rectangles that meet at this vertex. An edge guard is a guard that patrols along an edge of the partition, and is thus equivalent to two adjacent vertex guards. We consider the problem of finding a minimum-cardinality guarding set for the rectangles of the partition. For vertex guards, we prove that guarding a given subset of the rectangles is NP-hard. For edge guards, we prove that guarding all rectangles, where guards are restricted to a given subset of the edges, is NP-hard. For both results we show a reduction from vertex cover in non-bipartite 3-connected cubic planar graphs of girth greater than three. For the second NP-hardness results, we obtain a graph-theoretic result which establishes a connection between the set of faces of a plane graph of vertex degree at most three and a vertex cover for this graph. More precisely, we prove that one can assign to each internal face a distinct vertex of the cover, which lies on the face's boundary. We show that the vertices of a rectangular partition can be colored red, green, or black, such that each rectangle has all three colors on its boundary. We conjecture that the above is also true for four colors. Finally, we obtain a worst-case upper bound on the number of edge guards that are sufficient for guarding rectangular partitions with some restrictions on their structure.", "paper_title": "GUARDING RECTANGULAR PARTITIONS", "paper_id": "WOS:000273425600006"}