{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "chinese"}, {"score": 0.04601049044404375, "phrase": "e-commerce_web_sites"}, {"score": 0.004539005582217309, "phrase": "underlying_mechanisms"}, {"score": 0.004494570360108983, "phrase": "preference_differences"}, {"score": 0.004299910946753963, "phrase": "different_cultural_backgrounds"}, {"score": 0.004154332348800334, "phrase": "chinese_and_u.s._online_consumers'_information_preferences"}, {"score": 0.003601715012418258, "phrase": "different_ways"}, {"score": 0.0033617891884360606, "phrase": "digital_camera"}, {"score": 0.003296212583539166, "phrase": "laptop_computer"}, {"score": 0.0028857130140890787, "phrase": "product_description"}, {"score": 0.00266693888510356, "phrase": "different_information_item"}, {"score": 0.0024405312482831646, "phrase": "corresponding_product_description"}, {"score": 0.0021682027434117095, "phrase": "content_usability"}, {"score": 0.0021259892201330134, "phrase": "china"}], "paper_keywords": [""], "paper_abstract": "The objective of this study was to examine underlying mechanisms concerning preference differences for content on e-commerce Web sites of online consumers with different cultural backgrounds. Two experiments were conducted to explore Chinese and U.S. online consumers' information preferences with three particular product categories: MP3 players, digital cameras, and laptop computers. For Experiment 1, two prototype e-commerce Web sites were developed that contained the same content but presented in different ways. Twenty-four Chinese and 24 U.S. university students were asked to purchase an MP3 player, a digital camera, and a laptop computer from one of the two sites, and their information preferences were assessed and compared in terms of their performance on the sites. For Experiment 2, two versions of product description were developed for each product used in the experiment with each version focusing on a different information item. The preferences of 24 Chinese and 24 U.S. university students for certain information items were assessed and compared with their preferences for the corresponding product description, indicated on a 7-point Likert scale. The differences between the two cultural groups' information preferences revealed by the experiments are discussed, and their implications for improving the content usability of e-commerce Web sites in China and the United States are offered.", "paper_title": "Content Preparation for E-Commerce Involving Chinese and US Online Consumers", "paper_id": "WOS:000272798500002"}