{"auto_keywords": [{"score": 0.04796554330462277, "phrase": "health_data"}, {"score": 0.045813387822819886, "phrase": "mobile_monitoring_nodes"}, {"score": 0.013748399807000168, "phrase": "body_sensor_nodes"}, {"score": 0.012362463023477498, "phrase": "dynamic_selection"}, {"score": 0.012259114615704938, "phrase": "cloud_gateways"}, {"score": 0.00481495049065317, "phrase": "cloud-assisted_wban_architecture"}, {"score": 0.004787874367741664, "phrase": "post-disaster_healthcare"}, {"score": 0.004667894913438327, "phrase": "cloud-assisted_wireless_body_area_network"}, {"score": 0.0044493728074453, "phrase": "health-cloud_platform"}, {"score": 0.004337838898735768, "phrase": "post-disaster_scenario"}, {"score": 0.004146386253535282, "phrase": "efficient_manner"}, {"score": 0.00407678138571414, "phrase": "cloud_platform"}, {"score": 0.004053839332787437, "phrase": "minimum_delay"}, {"score": 0.003963349828993976, "phrase": "context_-_aggregation"}, {"score": 0.0037990701686283672, "phrase": "aggregated_data"}, {"score": 0.0037037769661437563, "phrase": "existing_literature"}, {"score": 0.0032526761451728537, "phrase": "health_data_prioritization"}, {"score": 0.0032161400520923154, "phrase": "body_area_network_data_aggregation_algorithm"}, {"score": 0.0031531835148998783, "phrase": "preference_order"}, {"score": 0.0029465141526991297, "phrase": "health_criticality"}, {"score": 0.002872544201947737, "phrase": "based_\"fair\"_aggregation_policy"}, {"score": 0.002691814517164577, "phrase": "\"fair\"_manner"}, {"score": 0.0026316476955518175, "phrase": "simulation_results"}, {"score": 0.002602069171788284, "phrase": "proposed_pseudo-cluster"}, {"score": 0.0025655618834535027, "phrase": "improved_performance"}, {"score": 0.002522426900157144, "phrase": "node_selection"}, {"score": 0.00221488852092224, "phrase": "data_criticality"}, {"score": 0.0021531499016013704, "phrase": "gateway_capacity"}, {"score": 0.002141009796880959, "phrase": "reduced_communication_cost"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Wireless Body Area Network (WBAN)", " Cloud computing", " Social choice", " Arrow's impossibility theorem", " Clustering", " Data aggregation"], "paper_abstract": "In a cloud-assisted Wireless Body Area Network (WBAN), health data of patients are transmitted from the Local Data Processing Units (LDPUs) to the health-cloud platform through a set of mobile monitoring nodes. In a post-disaster scenario, it is important that the data acquired by the body sensor nodes are aggregated in an efficient manner, and channelized to the cloud platform with minimum delay. Our work focuses on two fundamental research issues in this context - aggregation of health data transmitted by the LDPUs within the mobile monitoring nodes, and channelization of the aggregated data by dynamic selection of the cloud gateways. While the existing literature mainly center around the aggregation of the data broadcast through the body sensor nodes, our focus is on the aggregation of the data transmitted by the LDPUs. Aggregation takes place at the mobile monitoring nodes, which makes the problem challenging due to reasons attributed to mobility and health data prioritization. Our proposed solution, Body Area Network Data Aggregation Algorithm (Banag), generates a preference order for each patient, based on the severity and acuteness of his/her health. For each patient, an Exigency Factor, which measures health criticality, is associated. Additionally, a pseudo-cluster based \"fair\" aggregation policy is proposed on the basis of the Theory of Social Choice. Cloud gateways are also dynamically allocated to channelize the prioritized and aggregated health data in a \"fair\" manner using The Optimal Channelization Algorithm (OCA). The simulation results illustrate that the proposed pseudo-cluster based aggregation scheme provides improved performance in terms of reliability of node selection, number of packets transmitted, redundancy during transmission, and probability of congestion, when compared with cluster-based, tree-based, and structure-free aggregation methods. The health data channelization algorithm proposed in the paper also demonstrates that the choice of packets to be transmitted to the cloud is biased towards data criticality, and the dynamic selection of gateways is biased towards gateway capacity and reduced communication cost. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Social choice considerations in cloud-assisted WBAN architecture for post-disaster healthcare: Data aggregation and channelization", "paper_id": "WOS:000341677100008"}