{"auto_keywords": [{"score": 0.037064433040664126, "phrase": "k-spanner_problems"}, {"score": 0.0161137729811799, "phrase": "stretch_requirement"}, {"score": 0.009517656187856351, "phrase": "np"}, {"score": 0.005667123275730412, "phrase": "k-spanner_problem"}, {"score": 0.005558535322960818, "phrase": "ratio-degradation_property"}, {"score": 0.00481495049065317, "phrase": "spanner_problems"}, {"score": 0.004647013794908825, "phrase": "sparse_k-spanner_problem"}, {"score": 0.004057728601458481, "phrase": "unit-length_k-spanner_problem"}, {"score": 0.0034636656250083744, "phrase": "strong_hardness"}, {"score": 0.003267925215811654, "phrase": "particular_variant"}, {"score": 0.0031435968684569112, "phrase": "edge_weights"}, {"score": 0.002726740692380339, "phrase": "inapproximability_results"}, {"score": 0.0026657070241024963, "phrase": "constant_approximation_ratio"}, {"score": 0.0026314443645799913, "phrase": "spanner_problem"}, {"score": 0.002372693822379709, "phrase": "hardness_result"}, {"score": 0.0022749744354271816, "phrase": "strong_inapproximability_results"}, {"score": 0.0022384684697329097, "phrase": "relaxed_stretch_requirement"}, {"score": 0.0021049977753042253, "phrase": "large_variety"}], "paper_keywords": [""], "paper_abstract": "This paper examines a number of variants of the sparse k-spanner problem and presents hardness results concerning their approximability. Previously, it was known that most k-spanner problems are weakly inapproximable (namely, they are NP-hard to approximate with ratio O(log n), for every k >= 2) and that the unit-length k-spanner problem for constant stretch requirement k >= 5 is strongly inapproximable (namely, it is NP-hard to approximate with ratio O(2log(1-epsilon n))) [27]. The results of this paper significantly expand the ranges of hardness for k-spanner problems. In general, strong hardness is shown for a number of k-spanner problems, for certain ranges of the stretch requirement k depending on the particular variant at hand. The problems studied differ by the types of edge weights and lengths used, and they include directed, augmentation and client-server variants. The paper also considers k-spanner problems in which the stretch requirement k is relaxed (e.g., k = Omega(log n)). For these cases, no inapproximability results were known (even for a constant approximation ratio) for any spanner problem. Moreover, some versions of the k-spanner problem are known to enjoy the ratio-degradation property; namely, their complexity decreases exponentially with the inverse of the stretch requirement. So far, no hardness result existed precluding any k-spanner problem from enjoying this property. This paper establishes strong inapproximability results for the case of relaxed stretch requirement (up to k = 0(n(1-delta)), for any 0 < delta < 1), for a large variety of k-spanner problems. It is also shown that these problems do not enjoy the ratio-degradation property.", "paper_title": "The hardness of approximating spanner problems", "paper_id": "WOS:000250197300004"}