{"auto_keywords": [{"score": 0.028529310966574208, "phrase": "decodable_frames"}, {"score": 0.014744873135853792, "phrase": "delivery_quality"}, {"score": 0.004767261858417823, "phrase": "mpeg_video_transmission"}, {"score": 0.004604023526673226, "phrase": "complete_tool-set"}, {"score": 0.0044685410845412745, "phrase": "mpeg_video_transmissions"}, {"score": 0.004358676214574977, "phrase": "network_environment"}, {"score": 0.004188459638572375, "phrase": "evalvid_framework"}, {"score": 0.0040854526743211396, "phrase": "connecting_interfaces"}, {"score": 0.0040449601286656756, "phrase": "evalvid"}, {"score": 0.003553540530701019, "phrase": "real_video_streams"}, {"score": 0.0034317185678527672, "phrase": "video_semantics"}, {"score": 0.0033639840192975835, "phrase": "large_range"}, {"score": 0.0033306180744375616, "phrase": "network_scenarios"}, {"score": 0.002769568481822277, "phrase": "noise_ratio"}, {"score": 0.002481747081849503, "phrase": "psnr_metric"}, {"score": 0.0021049977753042253, "phrase": "publicly_available_video_trace_files"}], "paper_keywords": ["network simulation", " MPEG video", " Evalvid", " NS2", " PSNR", " the fraction of decodable frames"], "paper_abstract": "We present a novel and complete tool-set for evaluating the delivery quality of MPEG video transmissions in simulations of a network environment. This tool-set is based on the EvalVid framework. We extend the connecting interfaces of EvalVid to replace its simple error simulation model by a more general network simulator like NS2. With this combination, researchers and practitioners in general can analyze through simulation the performance of real video streams, i.e. taking into account the video semantics, under a large range of network scenarios. To demonstrate the usefulness of our new tool-set, we point out that it enables the investigation of the relationship between two popular objective metrics for Quality of Set-vice (QoS) assessment of video quality delivery: the PSNR (Peak Signal to Noise Ratio) and the fraction of decodable frames. The results show that the fraction of decodable frames reflects well the behavior of the PSNR metric, while being less time-consuming. Therefore, the fraction of decodable frames can be an alternative metric to objectively assess through simulations the delivery quality of transmission in a network of publicly available video trace files.", "paper_title": "An evaluation framework for more realistic simulations of MPEG video transmission", "paper_id": "WOS:000254446100007"}