{"auto_keywords": [{"score": 0.04945540937697203, "phrase": "one's_own_picture"}, {"score": 0.00481495049065317, "phrase": "affective_personality_dispositions"}, {"score": 0.004431149592844886, "phrase": "simulated_oral_examination"}, {"score": 0.004354315061804687, "phrase": "dispositional_test_anxiety"}, {"score": 0.004042295865725559, "phrase": "high-anxious_students"}, {"score": 0.004007083686875716, "phrase": "higher_emotional_arousal"}, {"score": 0.003954837422946628, "phrase": "lower_performance"}, {"score": 0.003920384090110374, "phrase": "low-anxious_students"}, {"score": 0.003852371777780562, "phrase": "performance_differences"}, {"score": 0.003752550907120244, "phrase": "large_picture"}, {"score": 0.003408091901859624, "phrase": "video_information"}, {"score": 0.003334309053314909, "phrase": "disturbing_events"}, {"score": 0.0032054891061528896, "phrase": "positive_and_negative_affectivity"}, {"score": 0.0030547611342112693, "phrase": "significant_impact"}, {"score": 0.002923876831533028, "phrase": "dispositional_effects"}, {"score": 0.0026091594819333654, "phrase": "strong_dislike"}, {"score": 0.002541469965286169, "phrase": "low_counseling_quality"}, {"score": 0.002508284945907166, "phrase": "low_task_performance"}, {"score": 0.002328238264850759, "phrase": "negative_affective_reactions"}], "paper_keywords": [""], "paper_abstract": "Experiment 1 examined the behavior of 88 students participating in a simulated oral examination via videoconference. Dispositional test anxiety was assessed and the size of the picture of candidates was manipulated. As expected, high-anxious students reported higher emotional arousal and achieved lower performance than low-anxious students. However, performance differences were only found when the large picture of candidates was presented. Experiment 2 investigated reactions of 60 students during the simulation of a less threatening consultation episode. The nature of video information and the occurrence of disturbing events were manipulated. In addition, the dispositions positive and negative affectivity were assessed. As expected, these dispositions had a significant impact on the experience of emotions. Controlling for these dispositional effects, results revealed an intensification of expressing anger in conditions in which participants saw their own picture. Moreover, the occurrence of problems during communication yielded strong dislike, longing and shame, low counseling quality, and low task performance in particular if participants could see their own picture simultaneously. Thus, seeing one's own picture can easily arouse negative affective reactions. As both studies reveal that, seeing one's own picture might also hinder performance, the role of one's own picture in a videoconference deserves much more attention in practice and theory.", "paper_title": "Communication via videoconference: Emotional and cognitive consequences of affective personality dispositions, seeing one's own picture, and disturbing events", "paper_id": "WOS:000240800300001"}