{"auto_keywords": [{"score": 0.03275058474954466, "phrase": "proposed_scheme"}, {"score": 0.02453956832641216, "phrase": "leach"}, {"score": 0.02440021588645868, "phrase": "leach-sc"}, {"score": 0.00481495049065317, "phrase": "la-eehsc"}, {"score": 0.0047732596509542135, "phrase": "automata-based_energy_efficient_heterogeneous_selective_clustering"}, {"score": 0.004690952711665194, "phrase": "wireless_sensor_networks"}, {"score": 0.004491313367627919, "phrase": "different_geographical_locations"}, {"score": 0.0044524122425287005, "phrase": "multiple_tasks"}, {"score": 0.004388321050344759, "phrase": "data_aggregation"}, {"score": 0.004350308086118336, "phrase": "data_processing"}, {"score": 0.004141012346542414, "phrase": "energy_holes"}, {"score": 0.0038513073787989054, "phrase": "energy_conservation"}, {"score": 0.0038179283509963695, "phrase": "paramount_concern"}, {"score": 0.0030532127006946907, "phrase": "weighted_election_probability"}, {"score": 0.0027341763737751467, "phrase": "different_sns"}, {"score": 0.00269475174341129, "phrase": "automata-based_energy"}, {"score": 0.0026175952455594277, "phrase": "first_node_die"}, {"score": 0.0026024303981224827, "phrase": "fnd"}, {"score": 0.002579847272930948, "phrase": "last_node"}, {"score": 0.0025132639823395807, "phrase": "key_parameters"}, {"score": 0.002462664392109308, "phrase": "network_field"}, {"score": 0.002357632753637638, "phrase": "different_network_scenarios"}, {"score": 0.002323624929658748, "phrase": "well-known_existing_protocols"}, {"score": 0.002276839377458203, "phrase": "sep."}, {"score": 0.002237477619351199, "phrase": "proposed_scheme_yields"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sensor network", " Clustering", " Network lifetime", " Heterogeneous"], "paper_abstract": "Wireless sensor networks (WSNs) consist of many sensor nodes (SNs) which may be deployed at different geographical locations to perform multiple tasks such as monitoring, data aggregation, and data processing. During all these operations, energy of the SNs continuously depleted which results in the creation of energy holes in some regions. As SNs are battery operated and it is difficult to replace the battery of the SNs each time, so energy conservation is a paramount concern to increase the lifetime of the WSNs. It has been proved in the literature that clustering of SNs can be used for energy saving during various operations in WSNs. Keeping in view of the above issues, in this paper, we propose a new learning automata-based energy efficient heterogeneous selective clustering (LA-EEHSC) scheme for WSNs. Automaton is assumed to be located on each SN with two types of SNs, namely, normal and advanced are considered in the proposed scheme. Based upon the weighted election probability (WEP) of each group of SNs, Cluster Heads (CHs) are selected among the group of SNs by the automaton. Automaton at each SN receives reward or penalty from the environment based upon WEP of different SNs. An efficient learning automata-based energy efficient clustering algorithm is also proposed. Finally, first node die (FND) and last node alive (LNA) are selected as the key parameters for the measurement of lifetime of network field. Using these parameters, we have evaluated the performance of the proposed scheme in different network scenarios in comparison with the well-known existing protocols such as LEACH, LEACH-SC and SEP. The results obtained show that proposed scheme yields 5.89% improvement in lifetime and 21.14% improvement in stability in comparison to LEACH, LEACH-SC, and SEP. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "LA-EEHSC: Learning automata-based energy efficient heterogeneous selective clustering for wireless sensor networks", "paper_id": "WOS:000347769900021"}