{"auto_keywords": [{"score": 0.019154325638957352, "phrase": "tumor_suppressor"}, {"score": 0.007181880923649187, "phrase": "biological_function"}, {"score": 0.00481495049065317, "phrase": "ligand_blockage"}, {"score": 0.004551199992546761, "phrase": "important_role"}, {"score": 0.004517137548648729, "phrase": "cancer_suppression"}, {"score": 0.00396050388346298, "phrase": "anti-cancer_agents"}, {"score": 0.003886770770835211, "phrase": "small_compound_library"}, {"score": 0.0038431888954930083, "phrase": "binding_interface"}, {"score": 0.003743381699791, "phrase": "potential_compounds"}, {"score": 0.0036324746826127997, "phrase": "ligand-binding_effect"}, {"score": 0.0035381202759091784, "phrase": "molecular_dynamics"}, {"score": 0.0034984340449789745, "phrase": "atomic_level"}, {"score": 0.002942619810718864, "phrase": "original_unligated_state"}, {"score": 0.002437907960209364, "phrase": "binding_mode"}, {"score": 0.0024196235355517827, "phrase": "ligand_structural_features"}, {"score": 0.0021369416775353124, "phrase": "promising_approach"}, {"score": 0.0021049977753042253, "phrase": "normal_function"}], "paper_keywords": ["Protein interaction", " EF-hand Ca(2+) binding protein", " Binding affinity calculation", " Tumor suppressor", " Anti-cancer agent", " Drug development"], "paper_abstract": "As a tumor suppressor, p53 plays an important role in cancer suppression. The biological function of p53 as a tumor suppressor is disabled when it binds to S100B. Developing the ligands to block the S100B-p53 interaction has been proposed as one of the most important approaches to the development of anti-cancer agents. We screened a small compound library against the binding interface of S100B and p53 to identify potential compounds to interfere with the interaction. The ligand-binding effect on the S100B-p53 interaction was explored by molecular dynamics at the atomic level. The results show that the ligand bound between S100B and p53 propels the two proteins apart by about 2 compared to the unligated S100B-p53 complex. The binding affinity of S100B and p53 decreases by similar to 8.5-14.6 kcal/mol after a ligand binds to the interface from the original unligated state of the S100B-p53 complex. Ligand-binding interferes with the interaction of S100B and p53. Such interference could impact the association of S100B and p53, which would free more p53 protein from the pairing with S100B and restore the biological function of p53 as a tumor suppressor. The analysis of the binding mode and ligand structural features would facilitate our effort to identify and design ligands to block S100B-p53 interaction effectively. The results from the work suggest that developing ligands targeting the interface of S100B and p53 could be a promising approach to recover the normal function of p53 as a tumor suppressor.", "paper_title": "Molecular dynamics simulation of S100B protein to explore ligand blockage of the interaction with p53 protein", "paper_id": "WOS:000271734500003"}