{"auto_keywords": [{"score": 0.0496213341565463, "phrase": "project_risk_management"}, {"score": 0.04322166454567049, "phrase": "project_managers"}, {"score": 0.00481495049065317, "phrase": "blended_learning_approach"}, {"score": 0.004611224230543916, "phrase": "student_learning_experience"}, {"score": 0.004352876088312741, "phrase": "project_risk_management_lesson"}, {"score": 0.004168618849008299, "phrase": "practical_challenges"}, {"score": 0.003992129945230457, "phrase": "project_risks"}, {"score": 0.0036788184374592706, "phrase": "associated_tactics"}, {"score": 0.0035229930971258316, "phrase": "ten_requirements"}, {"score": 0.0034725269588525534, "phrase": "intended_learning_outcome"}, {"score": 0.002864628676257225, "phrase": "real_life_project_case"}, {"score": 0.0027830917623582903, "phrase": "gaming_context"}, {"score": 0.0024556852466581527, "phrase": "entire_risk_management_process"}, {"score": 0.0021049977753042253, "phrase": "risk_management_process"}], "paper_keywords": ["project risk management", " blended learning"], "paper_abstract": "The aim of this research has been to develop a project risk management lesson that is, capable to take into account practical challenges that project managers have to deal with during managing project risks. Interviews were conducted with the project managers experienced in project risk management. The list of challenges and associated tactics to deal with these challenges were mapped into ten requirements representing the intended learning outcome of the lesson. The requirements were then mapped onto the design using the four instructional methods; a briefing lecture, team-based assignment, a computer simulation, and a debriefing lecture. All these methods are linked by a real life project case, and executed in a gaming context in order to improve motivation and engagement. The uniqueness and strength of the design comes from its ability to engage the students actively in the entire risk management process. The design also provides students with ability to simulate some of the risks they have identified themselves during the team-assignment. This gave the students a feeling of ownership to risk management process during simulation. [DOI: 10.1115/1.3615971]", "paper_title": "A Blended Learning Approach to Project Risk Management: Developing Requirements and Evaluating the Student Learning Experience", "paper_id": "WOS:000294487300004"}