{"auto_keywords": [{"score": 0.04501851799576053, "phrase": "conditional_lower_previsions"}, {"score": 0.03356912892792283, "phrase": "coherence_graph"}, {"score": 0.00481495049065317, "phrase": "probability_distributions"}, {"score": 0.00440093312826378, "phrase": "probabilistic_assessments"}, {"score": 0.00385368199735867, "phrase": "nearly_no_information"}, {"score": 0.0037238193456845124, "phrase": "lower_previsions"}, {"score": 0.0034033029171804106, "phrase": "simpler_and_more_local_ones"}, {"score": 0.003288567185099276, "phrase": "graphical_representation"}, {"score": 0.0028060889647071787, "phrase": "polynomial-time_algorithm"}, {"score": 0.0023434058350520763, "phrase": "optimal_graphical_decomposition"}, {"score": 0.002235356010935877, "phrase": "intractable_instances"}, {"score": 0.0021599099979586946, "phrase": "coherence_graphs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Walley's strong and weak coherence", " Coherent lower previsions", " Graphical models", " Probabilistic logic", " Satisfiability"], "paper_abstract": "We study the consistency of a number of probability distributions, which are allowed to be imprecise. To make the treatment as general as possible, we represent those probabilistic assessments as a collection of conditional lower previsions. The problem then becomes proving Walley's (strong) coherence of the assessments. In order to maintain generality in the analysis, we assume to be given nearly no information about the numbers that make up the lower previsions in the collection. Under this condition, we investigate the extent to which the above global task can be decomposed into simpler and more local ones. This is done by introducing a graphical representation of the conditional lower previsions that we call the coherence graph: we show that the coherence graph allows one to isolate some subsets of the collection whose coherence is sufficient for the coherence of all the assessments; and we provide a polynomial-time algorithm that finds the subsets efficiently. We show some of the implications of our results by focusing on three models and problems: Bayesian and credal networks, of which we prove coherence; the compatibility problem, for which we provide an optimal graphical decomposition; probabilistic satisfiability, of which we show that some intractable instances can instead be solved efficiently by exploiting coherence graphs. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Coherence graphs", "paper_id": "WOS:000261931400004"}