{"auto_keywords": [{"score": 0.036551311068889855, "phrase": "risk_score"}, {"score": 0.015105298965886738, "phrase": "high_risk_hosts"}, {"score": 0.014298927179184759, "phrase": "high_throughput_networks"}, {"score": 0.01380802578889639, "phrase": "risk_propagation"}, {"score": 0.012247823592035391, "phrase": "risk_scores"}, {"score": 0.009068936768326177, "phrase": "network_flows"}, {"score": 0.00481495049065317, "phrase": "interdependent_security_risk_analysis"}, {"score": 0.0044644734709113985, "phrase": "significant_problem"}, {"score": 0.004419703921314433, "phrase": "security_monitoring"}, {"score": 0.004309725894724034, "phrase": "comprehensive_risk_assessment_method"}, {"score": 0.00418134346679498, "phrase": "risky_hosts"}, {"score": 0.0036861605703168397, "phrase": "network_flow"}, {"score": 0.003366233863411861, "phrase": "risky_flows"}, {"score": 0.0026688629249775925, "phrase": "particular_flow"}, {"score": 0.0024742098091226203, "phrase": "iterative_algorithm"}, {"score": 0.0023170054862555896, "phrase": "rigorous_proof"}, {"score": 0.0022365262201954643, "phrase": "risk_estimates"}], "paper_keywords": ["Network risk assessment", " flow provenance", " risk propagation"], "paper_abstract": "Detection of high risk hosts and flows continues to be a significant problem in security monitoring of high throughput networks. A comprehensive risk assessment method should consider the risk propagation among risky hosts and flows. In this paper, this is achieved by introducing two novel concepts. First, an interdependency relationship among the risk scores of a network flow and its source and destination hosts. On the one hand, the risk score of a host depends on risky flows initiated by or terminated at the host. On the other hand, the risk score of a flow depends on the risk scores of its source and destination hosts. Second, which we call flow provenance, represents risk propagation among network flows which considers the likelihood that a particular flow is caused by the other flows. Based on these two concepts, we develop an iterative algorithm for computing the risk score of hosts and network flows. We give a rigorous proof that our algorithm rapidly converges to unique risk estimates, and provide its extensive empirical evaluation using two real-world data sets. Our evaluation shows that our method is effective in detecting high risk hosts and flows and is sufficiently efficient to be deployed in the high throughput networks.", "paper_title": "Interdependent Security Risk Analysis of Hosts and Flows", "paper_id": "WOS:000360893000006"}