{"auto_keywords": [{"score": 0.049636680610423214, "phrase": "substitutions"}, {"score": 0.046488601233009054, "phrase": "insertions"}, {"score": 0.004540009134349177, "phrase": "edited_version"}, {"score": 0.0044289730051264116, "phrase": "random_deletions"}, {"score": 0.004124579368997962, "phrase": "minimal_exchange"}, {"score": 0.004061214835223812, "phrase": "noiseless_link"}, {"score": 0.003852939975815287, "phrase": "interactive_rounds"}, {"score": 0.0035548008271253607, "phrase": "x._we"}, {"score": 0.003320561182494713, "phrase": "interactive_synchronization_algorithm"}, {"score": 0.0033000452351286077, "phrase": "near-optimal_communication_rate"}, {"score": 0.0032192371383026517, "phrase": "arithmetic_operations"}, {"score": 0.003120995227740011, "phrase": "source_sequence"}, {"score": 0.0030825404960282713, "phrase": "exactly_one_deletion"}, {"score": 0.0030763388521560637, "phrase": "varshamov"}, {"score": 0.002960795132939529, "phrase": "optimal_one-way_algorithm"}, {"score": 0.0029025202867182854, "phrase": "tenengolts"}, {"score": 0.0028882701690741467, "phrase": "channel_codes"}, {"score": 0.002791432032844323, "phrase": "synchronization_algorithm"}, {"score": 0.0026811531172346676, "phrase": "single_round"}, {"score": 0.002551372449383365, "phrase": "higher_communication"}, {"score": 0.0024429654627197393, "phrase": "practically_important_case"}, {"score": 0.0022747539135765204, "phrase": "target_hamming_distance"}, {"score": 0.0021512129013162846, "phrase": "theoretical_performance_bounds"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithms"}], "paper_keywords": ["File synchronization", " two-way interaction", " deletion edits", " insertion edits", " edit channels", " Varshamov-Tenengolts codes"], "paper_abstract": "Consider two remote nodes having binary sequences X and Y, respectively. Y is an edited version of X, where the editing involves random deletions, insertions, and substitutions, possibly in bursts. The goal is for the node with Y to reconstruct X with minimal exchange of information over a noiseless link. The communication is measured in terms of both the total number of bits exchanged and the number of interactive rounds of communication. This paper focuses on the setting where the number of edits is o(n/log n), where n is the length of X. We first consider the case where the edits are a mixture of insertions and deletions (indels), and propose an interactive synchronization algorithm with near-optimal communication rate and average computational complexity of O(n) arithmetic operations. The algorithm uses interaction to efficiently split the source sequence into substrings containing exactly one deletion or insertion. Each of these substrings is then synchronized using an optimal one-way algorithm based on the single-deletion correcting channel codes of Varshamov and Tenengolts. We then build on this synchronization algorithm in three different ways. First, it is modified to work with a single round of interaction. The reduction in the number of rounds comes at the expense of higher communication, which is quantified. Next, we present an extension to the practically important case where the insertions and deletions may occur in (potentially large) bursts. Finally, we show how to synchronize the sources to within a target Hamming distance. This feature can be used to differentiate between substitution and indel edits. In addition to theoretical performance bounds, we provide several validating simulation results for the proposed algorithms.", "paper_title": "Low-Complexity Interactive Algorithms for Synchronization From Deletions, Insertions, and Substitutions", "paper_id": "WOS:000361486800030"}