{"auto_keywords": [{"score": 0.0046659637258752535, "phrase": "gregory_bateson's_and_heinz_von_foerster's_peculiar_relation"}, {"score": 0.004133055661437163, "phrase": "whole_paper"}, {"score": 0.004041238873048836, "phrase": "epistemological_experiment"}, {"score": 0.003951453722517865, "phrase": "gregory_bateson's_metalogues"}, {"score": 0.0038810583785936505, "phrase": "methodological_style"}, {"score": 0.0037948184359488284, "phrase": "strong_focus"}, {"score": 0.003677280504320639, "phrase": "loose_and_strict_thinking"}, {"score": 0.0035794251590584563, "phrase": "heinz_von_foerster"}, {"score": 0.0035473867669654174, "phrase": "gregory_bateson"}, {"score": 0.0032569227104851327, "phrase": "bateson"}, {"score": 0.0032132821221190593, "phrase": "foerster"}, {"score": 0.0027950561494657633, "phrase": "personal_as_well_ecological_matter"}, {"score": 0.002708399936381754, "phrase": "single_individual"}, {"score": 0.00249767641333441, "phrase": "predefined_boundaries"}, {"score": 0.0022520496048464406, "phrase": "constant_re-generation"}, {"score": 0.0021049977753042253, "phrase": "bateson's_and_von_foerster's_peculiar_style"}], "paper_keywords": ["cybernetics", " knowledge management heritage", " research"], "paper_abstract": "Purpose - The paper is aimed at understanding and investigating Gregory Bateson's and Heinz von Foerster's peculiar relation to knowledge, the unknowable, and research. From this, the question of how to carry on their heritage is raised. Design/methodology/approach - The whole paper is designed as an epistemological experiment starting from reflections on Gregory Bateson's metalogues and adopting a methodological style of reasoning. A strong focus is laid on the combination of loose and strict thinking which is characteristic of both Heinz von Foerster and Gregory Bateson. Findings - In order to preserve and further develop their heritage, it is necessary to deal with Bateson's and Foerster's view(s) on the relations between the unknowable and the meaning of research. This has to be done in a manner in which epistemology and research become a personal as well ecological matter in which the relationship between the single individual and its greater context becomes explicit. Research limitations/implications - This paper refuses to view science and cybernetics within predefined boundaries. It suggests that the form of science and its relations to the individual and the community should be viewed as processes of constant re-generation. Originality/value - The value of this paper lies in viewing the similarities of Bateson's and von Foerster's peculiar style as general guidelines for future research and an understanding of epistemology.", "paper_title": "How to understand giants?", "paper_id": "WOS:000250571200029"}