{"auto_keywords": [{"score": 0.03068771593436713, "phrase": "ga"}, {"score": 0.00481495049065317, "phrase": "semi-trusted_group_authority"}, {"score": 0.003802135020791801, "phrase": "ah-aagka_protocol"}, {"score": 0.0037133478610481994, "phrase": "common_encryption_key"}, {"score": 0.0036481158025940016, "phrase": "legitimate_participant"}, {"score": 0.003479692058963528, "phrase": "encryption_key"}, {"score": 0.003378385493203297, "phrase": "legitimate_player's_affiliation_information"}, {"score": 0.0031100973266506163, "phrase": "one-round_ah-aagka_protocol"}, {"score": 0.002931569771634119, "phrase": "group_authority"}, {"score": 0.002498961351132696, "phrase": "honest_user"}, {"score": 0.0023415390666563177, "phrase": "group_members"}, {"score": 0.0022070310530794097, "phrase": "affiliation-hiding_property"}, {"score": 0.0021049977753042253, "phrase": "perfect_forward_secrecy"}], "paper_keywords": ["authentication", " key agreement", " affiliation-hiding"], "paper_abstract": "Affiliation-Hiding Authenticated Asymmetric Group Key Agreement (AH-AAGKA) protocol can be utilized by the members of a group to authenticate each other secretly. The participants affiliated to the group can execute the AH-AAGKA protocol to establish a common encryption key. Any legitimate participant can compute its own decryption key corresponding to the encryption key. Particularly, every legitimate player's affiliation information is only revealed to other legitimate players. In this paper, we present a one-round AH-AAGKA protocol. Compared with previous work, in our protocol, Group Authority (GA) does not need to be fully trusted (we call it semi-trusted). Therefore, GA cannot impersonate any honest user to execute the protocol. Meanwhile, GA can trace group members through analyzing the communication flows. Our protocol holds the affiliation-hiding property and detectability. Additionally, our scheme exhibits Perfect Forward Secrecy for both GA and outside attackers.", "paper_title": "One-Round Affiliation-Hiding Authenticated Asymmetric Group Key Agreement with Semi-trusted Group Authority", "paper_id": "WOS:000362959000021"}