{"auto_keywords": [{"score": 0.048609175050806475, "phrase": "texture"}, {"score": 0.017341564095370535, "phrase": "perception"}, {"score": 0.004703671193348433, "phrase": "visual_texture_modelling"}, {"score": 0.004200874581076468, "phrase": "accurate_definition"}, {"score": 0.003977672712305348, "phrase": "visual_textures"}, {"score": 0.003916098498242888, "phrase": "perceptual_properties"}, {"score": 0.0036363418376496484, "phrase": "model_texture"}, {"score": 0.003234615195382533, "phrase": "double_objective"}, {"score": 0.0030506626796257077, "phrase": "texture_properties"}, {"score": 0.002821516317503421, "phrase": "fuzzy_models"}, {"score": 0.0027995677499976406, "phrase": "parametric_membership_functions"}, {"score": 0.0027347383772384102, "phrase": "corresponding_parameters"}, {"score": 0.002671406231520296, "phrase": "functional_relationship"}, {"score": 0.0026402908398883832, "phrase": "computational_values"}, {"score": 0.0025690867646665835, "phrase": "human_perception"}, {"score": 0.00253916011199984, "phrase": "corresponding_property"}, {"score": 0.0024803459795996116, "phrase": "fuzzy_set"}, {"score": 0.0024134449026937586, "phrase": "human_assessments"}, {"score": 0.0021381565332182773, "phrase": "proposed_methodology"}], "paper_keywords": ["Image features", " Texture modelling", " Fuzzy sets", " Human perception"], "paper_abstract": "Texture is one of the most used low-level features for image analysis and, in addition, one of the most difficult to characterize. Although there is not an accurate definition for the concept of texture, it is usual for humans to describe visual textures according to some perceptual properties like coarseness, directionality, contrast, line-likeness or regularity. In this paper, we propose to model texture on the basis of its perceptual properties. To do this, fuzzy sets defined on the domain of some of the most representative measures of each property are employed. This approach achieves a double objective: first, to obtain models that allow to represent the imprecision related to texture properties, and second, to identify the most appropriate measure for each of these properties. In order to define the fuzzy models, parametric membership functions are proposed, where the corresponding parameters are obtained by learning a functional relationship between the computational values given by the measure and the human perception of the corresponding property. The performance of each fuzzy set is analyzed and checked with the human assessments, and a ranking of measures is obtained according to their ability to represent the perception of the property, allowing to identify the most suitable measure. In order to explain the proposed methodology, we focus our study on coarseness, contrast and directionality, that are considered the three most important texture properties.", "paper_title": "Perception-based fuzzy sets for visual texture modelling", "paper_id": "WOS:000345097100013"}