{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "efficiency_appraisal"}, {"score": 0.047474187726966516, "phrase": "tehran_stock_exchange"}, {"score": 0.04622076352597457, "phrase": "stock_exchange"}, {"score": 0.026172722064646062, "phrase": "fdea"}, {"score": 0.0047386923107107645, "phrase": "decision-making_units"}, {"score": 0.004701015188740582, "phrase": "data_envelopment_analysis"}, {"score": 0.004663636232080366, "phrase": "fuzzy_environment"}, {"score": 0.004237512575106522, "phrase": "important_subject"}, {"score": 0.004203803478570494, "phrase": "financial_managers"}, {"score": 0.0038043055953253047, "phrase": "investing_process"}, {"score": 0.0033745298175222056, "phrase": "comprehensive_appraising"}, {"score": 0.0030904433394138963, "phrase": "exchange_companies"}, {"score": 0.0029693204265884327, "phrase": "field_research"}, {"score": 0.002752075650871066, "phrase": "financial_status"}, {"score": 0.0024802523752944536, "phrase": "fuzzy_data_envelopment_analysis"}, {"score": 0.0021821915946356168, "phrase": "suitable_and_efficient_approach"}, {"score": 0.0021049977753042253, "phrase": "financial_data"}], "paper_keywords": ["Efficiency appraisal", " Data envelopment analysis", " Fuzzy logic", " Stock exchange"], "paper_abstract": "Efficiency appraisal of the companies in stock exchange and selecting the type of industries and companies is an important subject for financial managers and also investors because it can reduce the risk of investment, noticeably. In these situations, investors need information to facilitate the investing process. One of the ways that can be used in this regard is evaluation and ranking of the companies. The goal of this study is to do a comprehensive appraising and ranking of the companies in a stock exchange. To this end, the indices needed to appraise the efficiency of exchange companies in the literature are reviewed. Then, using field research, those indices are recognized as mainly affecting the efficiency of companies existing in Tehran stock exchange. Since the financial status of a company is not fixed throughout time, there is a source of uncertainty in data of such problem. To address this uncertainty, fuzzy data envelopment analysis (FDEA) is applied to rank companies. Finally, the results with the ranking given by the organization in charge are compared. Results show that FDEA is a suitable and efficient approach to model the fluctuations and uncertainties existing in financial data and factors affecting the efficiency of a corporation.", "paper_title": "Efficiency appraisal and ranking of decision-making units using data envelopment analysis in fuzzy environment: a case study of Tehran stock exchange", "paper_id": "WOS:000330030100001"}