{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "information_systems_research"}, {"score": 0.004582897918101983, "phrase": "fresh_look"}, {"score": 0.003951453722517865, "phrase": "independent_and_dependent_variables"}, {"score": 0.0038810583785936505, "phrase": "predominant_research_tradition"}, {"score": 0.0036443694410100507, "phrase": "major_platform"}, {"score": 0.003499864176875713, "phrase": "managerial_interest"}, {"score": 0.0032716011062067286, "phrase": "organizational_actors"}, {"score": 0.0030036501770192865, "phrase": "systematic_erasure"}, {"score": 0.0026362590493392785, "phrase": "useful_prescriptions"}, {"score": 0.0021529183360603434, "phrase": "centered_research"}, {"score": 0.0021049977753042253, "phrase": "informative_and_useful_way"}], "paper_keywords": ["management implications", " information systems research", " variables-centered research", " narrative", " process theory", " pragmatic generality"], "paper_abstract": "In this essay, we take a fresh look at the IS academic community's enduring concern with the management implications of its research. We examine in particular what we call the \"variables-centered\" research paradigm, which focuses its attention on co-variance among independent and dependent variables. As the predominant research tradition in the field, the variables-centered paradigm ought to constitute a major platform from which our community can speak to issues of managerial interest. Unfortunately, the variables-centered paradigm appears to distance researchers from the organizational actors, such as managers, to whom they would give advice and counsel. Particularly disturbing is the systematic erasure of those very actors from the domain of inquiry. Erased, too, are their actions and means of acting. Thus, when it comes time to offer useful prescriptions for action, our community attempts to do so on the basis of research in which, ironically, neither actors nor action directly appear. We offer some recommendations that may help to rectify this problem and, thereby, enrich the capacity of variables-centered research to speak in an informative and useful way to issues of practice.", "paper_title": "Management Implications in Information Systems Research: The Untold Story", "paper_id": "WOS:000269971600001"}