{"auto_keywords": [{"score": 0.043069853910456694, "phrase": "r-impact_factor"}, {"score": 0.015719716506582538, "phrase": "impact_factor"}, {"score": 0.00462919213721188, "phrase": "reliability-based_citation_impact_factor"}, {"score": 0.004327196832280818, "phrase": "cumulative_citation_age_distribution_model"}, {"score": 0.003802135020791801, "phrase": "change_processes"}, {"score": 0.0036144035798673967, "phrase": "manipulation_process"}, {"score": 0.003070086433952691, "phrase": "impact_factors"}, {"score": 0.002918394200972564, "phrase": "journals'_r-impact_factors"}, {"score": 0.0022906498741695094, "phrase": "relatively_short_cited_half-lives"}, {"score": 0.0021049977753042253, "phrase": "scientific_journals"}], "paper_keywords": ["Impact factor", " Manipulation", " R-impact factor", " Self-cited rate"], "paper_abstract": "According to the definition of reliability-based citation impact factor (R-impact factor) proposed by KUO & RUPE and the cumulative citation age distribution model, a mathematical expression of the relationship between R-impact factor and impact factor is established in this paper. By simulation of the change processes of the R-impact factor and impact factor in the manipulation process of the impact factor, it is found that the effect of manipulation can be partly corrected by the R-impact factor in some cases. Based on the Journal Citation Report database, impact factors of 4 normal journals and 4 manipulated journals were collected. The journals' R-impact factors and self-cited rates in the previous two years were calculated for each year during the period 2000 to 2007, and various characteristics influenced by the manipulation were analyzed. We find that the R-impact factor has greater fairness than the impact factor for journals with relatively short cited half-lives. Finally, some issues about using the R-impact factor as a measure for evaluating scientific journals are discussed.", "paper_title": "Reliability-based citation impact factor and the manipulation of impact factor", "paper_id": "WOS:000275417400016"}