{"auto_keywords": [{"score": 0.04959324222569227, "phrase": "design_guidelines"}, {"score": 0.007892685751020227, "phrase": "design_recommendations"}, {"score": 0.00481495049065317, "phrase": "liquid_crystal_displays"}, {"score": 0.004717723626157272, "phrase": "bioinformatics_tools"}, {"score": 0.003926105480202798, "phrase": "appropriate_interventions"}, {"score": 0.0038271712887391015, "phrase": "information_visualisation"}, {"score": 0.003711723285313348, "phrase": "size_judgement"}, {"score": 0.0036181717017041387, "phrase": "colour_size_illusion"}, {"score": 0.0035269696779744266, "phrase": "lcd_monitor"}, {"score": 0.0034556603183020407, "phrase": "yellow_images"}, {"score": 0.002860546817196148, "phrase": "colour_illusions"}, {"score": 0.002676692093594358, "phrase": "experimental_results"}, {"score": 0.0026359661683151006, "phrase": "extensive_literature_survey"}, {"score": 0.002466510117718297, "phrase": "lcd_monitors"}, {"score": 0.0021049977753042253, "phrase": "domain_experts"}], "paper_keywords": ["colour", " size", " illusion", " liquid crystal display", " design guidelines", " bioinformatics"], "paper_abstract": "Although the influence of colour on size perception has been known for a century, there is only limited research on interventions that can reduce this effect. This study was therefore undertaken in order to identify appropriate interventions and propose design guidelines for information visualisation, especially in applications where size judgement is critical. The colour size illusion was replicated on an LCD monitor, revealing that yellow images appeared the smallest among a series of red, yellow, green and blue images on a white background. Three types of interventions (background brightness, border colour and background grid brightness) were tested to identify conditions that reduce the colour illusions, but none proved to be statistically significant. Based on these experimental results and an extensive literature survey, a set of design guidelines is proposed to enhance the usability of LCD monitors and a set of design recommendations given to extend these guidelines to applications in the field of bioinformatics. These design recommendations are accompanied by an evaluation of effectiveness obtained by interviewing domain experts.", "paper_title": "Colour size illusion on liquid crystal displays and design guidelines for bioinformatics tools", "paper_id": "WOS:000296581200007"}