{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "geo-semantic_relatedness"}, {"score": 0.004425072111844721, "phrase": "semantic_similarity"}, {"score": 0.004191200981137508, "phrase": "vast_number"}, {"score": 0.004091248980678087, "phrase": "information_integration"}, {"score": 0.003692271726952282, "phrase": "natural_language_processing"}, {"score": 0.0036479584876742085, "phrase": "semantic_relatedness"}, {"score": 0.003232956879952914, "phrase": "lehrer's_semantic_fields"}, {"score": 0.0030991131563500446, "phrase": "geo-semantic_similarity"}, {"score": 0.002952900365829518, "phrase": "geo_relatedness"}, {"score": 0.0026970382454914437, "phrase": "computational_measures"}, {"score": 0.0025235718883452564, "phrase": "existing_datasets"}, {"score": 0.002304824198609057, "phrase": "geresid"}, {"score": 0.002169607777109061, "phrase": "evaluation_baseline"}], "paper_keywords": ["Geo-semantic relatedness", " Geo-semantic similarity", " Gold standards", " Geo-semantics", " Cognitive plausibility", " GeReSiD"], "paper_abstract": "In geographic information science and semantics, the computation of semantic similarity is widely recognised as key to supporting a vast number of tasks in information integration and retrieval. By contrast, the role of geo-semantic relatedness has been largely ignored. In natural language processing, semantic relatedness is often confused with the more specific semantic similarity. In this article, we discuss a notion of geo-semantic relatedness based on Lehrer's semantic fields, and we compare it with geo-semantic similarity. We then describe and validate the Geo Relatedness and Similarity Dataset (GeReSiD), a new open dataset designed to evaluate computational measures of geo-semantic relatedness and similarity. This dataset is larger than existing datasets of this kind, and includes 97 geographic terms combined into 50 term pairs rated by 203 human subjects. GeReSiD is available online and can be used as an evaluation baseline to determine empirically to what degree a given computational model approximates geo-semantic relatedness and similarity.", "paper_title": "An evaluative baseline for geo-semantic relatedness and similarity", "paper_id": "WOS:000342211300003"}