{"auto_keywords": [{"score": 0.037047225153857166, "phrase": "previous_algorithms"}, {"score": 0.036295312030114914, "phrase": "constrained_longest_common_subsequence_problem"}, {"score": 0.035267265817890296, "phrase": "constrained_pairwise_sequence_alignment_problem"}, {"score": 0.00481495049065317, "phrase": "alignment_with_weighted_constraints."}, {"score": 0.004576253356889219, "phrase": "constrained_sequence_c"}, {"score": 0.003928572641266562, "phrase": "optimal_alignment"}, {"score": 0.002750721367040336, "phrase": "constrained_pairwise_sequence_alignment"}, {"score": 0.002658863179011018, "phrase": "pairwise_sequence_alignment"}, {"score": 0.0024632148715152393, "phrase": "weighted_constrained_pairwise_sequence_alignment_problem"}, {"score": 0.0023408288327263316, "phrase": "constraint-related_problems"}, {"score": 0.0021501863832966966, "phrase": "previous_results"}, {"score": 0.0021049977753042253, "phrase": "new_and_suitable_model"}], "paper_keywords": ["Algorithm", " longest common subsequence", " sequence alignment", " weighted constraint"], "paper_abstract": "Given two sequences S(1), S(2), and a constrained sequence C, a longest common subsequence of S(1), S(2) with restriction to C is called a constrained longest common subsequence of S(1) and S(2) with C. At the same time, an optimal alignment of S(1), S(2) with restriction to C is called a constrained pairwise sequence alignment of S(1) and S(2) with C. Previous algorithms have shown that the constrained longest common subsequence problem is a special case of the constrained pairwise sequence alignment problem, and that both of them can be solved in O(rnm) time, where r, n, and m represent the lengths of C, S(1), and S(2), respectively. In this paper, we extend the definition of constrained pairwise sequence alignment to a more flexible version,called weighted constrained pairwise sequence alignment, in which some constraints might be ignored. We first give an O(rnm)-time algorithm for solving the weighted constrained pairwise sequence alignment problem, then show that our extension can be adopted to solve some constraint-related problems that cannot be solved by previous algorithms for the constrained longest common subsequence problem or the constrained pairwise sequence alignment problem. Therefore, in contrast to previous results, our extension is a new and suitable model for sequence analysis.", "paper_title": "AN ALGORITHM AND APPLICATIONS TO SEQUENCE ALIGNMENT WITH WEIGHTED CONSTRAINTS", "paper_id": "WOS:000274425600003"}