{"auto_keywords": [{"score": 0.048929739366992464, "phrase": "rips_filtration"}, {"score": 0.03997118388522652, "phrase": "rips-like_zigzags"}, {"score": 0.03874050686675407, "phrase": "signal-to-noise_ratio"}, {"score": 0.031710251985384436, "phrase": "rips_zigzags"}, {"score": 0.00481495049065317, "phrase": "compact_set"}, {"score": 0.004756805752518494, "phrase": "persistence_barcode"}, {"score": 0.004404445045826858, "phrase": "geometric_assumptions"}, {"score": 0.0041279612688488445, "phrase": "size_linear"}, {"score": 0.004045157344249484, "phrase": "constant_factor"}, {"score": 0.003916098498242888, "phrase": "intrinsic_dimension"}, {"score": 0.003567455727660992, "phrase": "underlying_homology"}, {"score": 0.003495855671790616, "phrase": "persistence_barcode_relative"}, {"score": 0.003370565320453525, "phrase": "relevant_scales"}, {"score": 0.0031974502006267163, "phrase": "dionysus_library"}, {"score": 0.002762941385784905, "phrase": "size_complexity"}, {"score": 0.002599763359352916, "phrase": "new_techniques"}, {"score": 0.002547535564922075, "phrase": "persistence_barcodes"}, {"score": 0.002526938673434697, "phrase": "zigzag_modules"}, {"score": 0.0021049977753042253, "phrase": "independent_interest"}], "paper_keywords": ["Topological inference", " Persistent homology", " Vietoris-Rips complex", " Quiver representations", " Reflections"], "paper_abstract": "For points sampled near a compact set , the persistence barcode of the Rips filtration built from the sample contains information about the homology of as long as satisfies some geometric assumptions. The Rips filtration is prohibitively large; however, zigzag persistence can be used to keep the size linear in , with a constant factor depending only (exponentially) on the intrinsic dimension of . We present several species of Rips-like zigzags and compare them with respect to the signal-to-noise ratio, a measure of how well the underlying homology is represented in the persistence barcode relative to the noise in the barcode at the relevant scales. Some of these Rips-like zigzags have been available as part of the Dionysus library for several years while others are new. Interestingly, we show that some species of Rips zigzags will exhibit less noise than the (nonzigzag) Rips filtration itself. Thus, Rips zigzags can offer improvements in both size complexity and signal-to-noise ratio. Along the way, we develop new techniques for manipulating and comparing persistence barcodes from zigzag modules. In particular, we give methods for reversing arrows and removing spaces from a zigzag while controlling the changes occurring in its barcode. These techniques were developed to provide our theoretical analysis of the signal-to-noise ratio of Rips-like zigzags, but they are of independent interest as they apply to zigzag modules generally.", "paper_title": "Zigzag Zoology: Rips Zigzags for Homology Inference", "paper_id": "WOS:000360862900002"}