{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large-scale_open_systems_using_machine_learning."}, {"score": 0.004053362743156545, "phrase": "potential_risks"}, {"score": 0.003858697684681798, "phrase": "safe_and_reliable_interaction_environment"}, {"score": 0.003531474887552889, "phrase": "involved_agent"}, {"score": 0.0031845067058084583, "phrase": "machine_learning"}, {"score": 0.002986969236641105, "phrase": "personal_knowledge_base"}, {"score": 0.0027469703311742647, "phrase": "associated_features"}, {"score": 0.0026277995163948263, "phrase": "successful_transactions"}, {"score": 0.0026020254041372723, "phrase": "unsuccessful_ones"}, {"score": 0.0025014259919355453, "phrase": "appropriate_machine"}, {"score": 0.0023928819778638055, "phrase": "potential_transaction"}, {"score": 0.002357755095722877, "phrase": "previous_ones"}, {"score": 0.0023003498123420237, "phrase": "real_data_sets"}, {"score": 0.0021049977753042253, "phrase": "specific_agent"}], "paper_keywords": ["trust management", " machine learning", " features", " large-scale systems"], "paper_abstract": "In many large-scale distributed systems and on the Web, agents need to interact with other unknown agents to carry out some tasks or transactions. The ability to reason about and assess the potential risks in carrying out such transactions is essential for providing a safe and reliable interaction environment. A traditional approach to reason about the risk of a transaction is to determine if the involved agent is trustworthy on the basis of its behavior history. As a departure from such traditional trust models, we propose a generic, trust framework based on machine learning where an agent uses its own previous transactions (with other agents) to build a personal knowledge base. This is used to assess the trustworthiness of a transaction on the basis of the associated features, particularly using the features that help discern successful transactions from unsuccessful ones. These features are handled by applying appropriate machine learning algorithms to extract the relationships between the potential transaction and the previous ones. Experiments based on real data sets show that our approach is more accurate than other trust mechanisms, especially when the information about past behavior of the specific agent is rare, incomplete, or inaccurate.", "paper_title": "A GENERIC TRUST FRAMEWORK FOR LARGE-SCALE OPEN SYSTEMS USING MACHINE LEARNING", "paper_id": "WOS:000344852100002"}