{"auto_keywords": [{"score": 0.04263916161140362, "phrase": "training_examples"}, {"score": 0.00481495049065317, "phrase": "promising_approach"}, {"score": 0.004753194996637899, "phrase": "autonomous_agents"}, {"score": 0.004249957578636515, "phrase": "classification_problem"}, {"score": 0.003916098498242888, "phrase": "new_example"}, {"score": 0.0038326698261576023, "phrase": "formal_argumentation-based_model"}, {"score": 0.0037028514035425037, "phrase": "possible_classification"}, {"score": 0.0035162927451540065, "phrase": "conflicting_arguments"}, {"score": 0.0033971539563683174, "phrase": "\"valid\"_classification"}, {"score": 0.0025014259919355453, "phrase": "particular_case"}, {"score": 0.0024799423362011582, "phrase": "concept_learning"}, {"score": 0.002427035025924384, "phrase": "version_space_theory"}, {"score": 0.0023958451621065155, "phrase": "mitchell"}, {"score": 0.0023447155524245655, "phrase": "elegant_way"}, {"score": 0.0021789194955896124, "phrase": "argumentation_literature"}, {"score": 0.0021049977753042253, "phrase": "sound_results"}], "paper_keywords": ["argumentation", " classification"], "paper_abstract": "Argumentation is a promising approach used by autonomous agents for reasoning about inconsistent/incomplete/uncertain knowledge, based on the construction and the comparison of arguments. In this paper, we apply this approach to the classification problem, whose purpose is to construct from a set of training examples a model that assigns a class to any new example. We propose a formal argumentation-based model that constructs arguments in favor of each possible classification of an example, evaluates them, and determines among the conflicting arguments the acceptable ones. Finally, a \"valid\" classification of the example is suggested. Thus, not only the class of the example is given, but also the reasons behind that classification are provided to the user as well in a form that is easy to grasp. We show that such an argumentation-based approach for classification offers other advantages, like for instance classifying examples even when the set of training examples is inconsistent, and considering more general preference relations between hypotheses. In the particular case of concept learning, the results of version space theory developed by Mitchell are retrieved in an elegant way in our argumentation framework. Finally, we show that the model satisfies the rationality postulates identified in argumentation literature. This ensures that the model delivers sound results.", "paper_title": "Agents that argue and explain classifications", "paper_id": "WOS:000252918800003"}