{"auto_keywords": [{"score": 0.04107868567004354, "phrase": "triangular_inequality"}, {"score": 0.00481495049065317, "phrase": "fast_non-metric_similarity_search"}, {"score": 0.004556901872357751, "phrase": "multimedia_database"}, {"score": 0.004412780054037622, "phrase": "similarity_score"}, {"score": 0.0037921662574137535, "phrase": "similarity_modeling"}, {"score": 0.0031991799574455555, "phrase": "metric_access_methods"}, {"score": 0.0030414140732789186, "phrase": "general_method"}, {"score": 0.0030135741897058844, "phrase": "non-metric_search"}, {"score": 0.0026011706232569316, "phrase": "original_similarity"}, {"score": 0.0024842242921857705, "phrase": "trigen_algorithm"}, {"score": 0.0024389277933858054, "phrase": "black-box_semimetric"}, {"score": 0.002318566141177149, "phrase": "distance_distribution"}, {"score": 0.002163930783583212, "phrase": "retrieval_efficiency"}, {"score": 0.0021049977753042253, "phrase": "mam."}], "paper_keywords": [""], "paper_abstract": "The retrieval of objects from a multimedia database employs a measure which defines a similarity score for every pair of objects. The measure should effectively follow the nature of similarity, hence, it should not be limited by the triangular inequality, regarded as a restriction in similarity modeling. On the other hand, the retrieval should be as efficient (or fast) as possible. The measure is thus often restricted to a metric, because then the search can be handled by metric access methods (MAMs). In this paper we propose a general method of non-metric search by MAMs. We show the triangular inequality can be enforced for any semimetric (reflexive, non-negative and symmetric measure), resulting in a metric that preserves the original similarity orderings (retrieval effectiveness). We propose the TriGen algorithm for turning any black-box semimetric into (approximated) metric, just by use of distance distribution in a fraction of the database. The algorithm finds such a metric for which the retrieval efficiency is maximized, considering any MAM.", "paper_title": "On fast non-metric similarity search by metric access methods", "paper_id": "WOS:000237081600043"}