{"auto_keywords": [{"score": 0.031381786268080324, "phrase": "nonlinear_equation_systems"}, {"score": 0.010598800707328602, "phrase": "nonlinear_equation_system"}, {"score": 0.007740489563401459, "phrase": "multiple_optimal_solutions"}, {"score": 0.004884743197848479, "phrase": "transformed_problem"}, {"score": 0.004706305193222972, "phrase": "multiobjective_optimization"}, {"score": 0.004537525607322823, "phrase": "main_task"}, {"score": 0.004354841111644036, "phrase": "optimal_solutions"}, {"score": 0.00429558848734449, "phrase": "single_run"}, {"score": 0.004179480763003705, "phrase": "evolutionary_algorithms"}, {"score": 0.003956558420993431, "phrase": "optimization_problem"}, {"score": 0.003711409222544974, "phrase": "simple_and_generic_transformation_technique"}, {"score": 0.003545625043276134, "phrase": "previous_work"}, {"score": 0.003418327319110734, "phrase": "biobjective_optimization_problem"}, {"score": 0.0030771609361092164, "phrase": "pareto_optimal_solutions"}, {"score": 0.002953097497434808, "phrase": "diverse_points"}, {"score": 0.0029128614098881253, "phrase": "objective_space"}, {"score": 0.0028470123663391126, "phrase": "multiobjective_evolutionary_algorithms"}, {"score": 0.002551022760887132, "phrase": "non-dominated_sorting_genetic_algorithm_ii"}, {"score": 0.0024593458703463474, "phrase": "experimental_results"}, {"score": 0.002349357968054711, "phrase": "state-of-the-art_multiobjective_optimization"}, {"score": 0.0021834945657804193, "phrase": "test_instances"}, {"score": 0.0021049977753042253, "phrase": "pareto_front"}], "paper_keywords": ["Evolutionary algorithms", " multiobjective optimization", " multiple optimal solutions", " nonlinear equation systems", " transformation technique"], "paper_abstract": "Nonlinear equation systems may have multiple optimal solutions. The main task of solving nonlinear equation systems is to simultaneously locate these optimal solutions in a single run. When solving nonlinear equation systems by evolutionary algorithms, usually a nonlinear equation system should be transformed into a kind of optimization problem. At present, various transformation techniques have been proposed. This paper presents a simple and generic transformation technique based on multiobjective optimization for nonlinear equation systems. Unlike the previous work, our transformation technique transforms a nonlinear equation system into a biobjective optimization problem that can be decomposed into two parts. The advantages of our transformation technique are twofold: 1) all the optimal solutions of a nonlinear equation system are the Pareto optimal solutions of the transformed problem, which are mapped into diverse points in the objective space, and 2) multiobjective evolutionary algorithms can be directly applied to handle the transformed problem. In order to verify the effectiveness of our transformation technique, it has been integrated with non-dominated sorting genetic algorithm II to solve nonlinear equation systems. The experimental results have demonstrated that, overall, our transformation technique outperforms another state-of-the-art multiobjective optimization based transformation technique and four single-objective optimization based approaches on a set of test instances. The influence of the types of Pareto front on the performance of our transformation technique has been investigated empirically. Moreover, the limitation of our transformation technique has also been identified and discussed in this paper.", "paper_title": "Locating Multiple Optimal Solutions of Nonlinear Equation Systems Based on Multiobjective Optimization", "paper_id": "WOS:000356517700008"}