{"auto_keywords": [{"score": 0.027118160115319177, "phrase": "sopcast"}, {"score": 0.00481495049065317, "phrase": "network_awareness_of"}, {"score": 0.0040238512275833265, "phrase": "large_scale_experiments"}, {"score": 0.003685972800046028, "phrase": "\"network_awareness"}, {"score": 0.0034911335714333507, "phrase": "general_framework"}, {"score": 0.003292770855568091, "phrase": "peer_selection"}, {"score": 0.003265365666305185, "phrase": "data_exchange"}, {"score": 0.0031448288291084, "phrase": "large_dataset"}, {"score": 0.0027857990883821504, "phrase": "mild_preference"}, {"score": 0.0026055251533586804, "phrase": "clustering_effect"}, {"score": 0.002436888552432559, "phrase": "hop_count"}], "paper_keywords": ["Locality awareness", " multimedia streaming", " neighbor selection", " overlay", " peer-to-peer networks"], "paper_abstract": "Early P2P-TV systems have already attracted millions of users, and many new commercial solutions are entering this market. Little information is however available about how these systems work, due to their closed and proprietary design. In this paper, we present large scale experiments to compare three of the most successful P2P-TV systems, namely PPLive, SopCast and TVAnts. Our goal is to assess what level of \"network awareness\" has been embedded in the applications. We first define a general framework to quantify which network layer parameters leverage application choices, i.e., what parameters mainly drive the peer selection and data exchange. We then apply the methodology to a large dataset, collected during a number of experiments where we deployed about 40 peers in several European countries. From analysis of the dataset, we observe that TVAnts and PPLive exhibit a mild preference to exchange data among peers in the same autonomous system the peer belongs to, while this clustering effect is less intense in SopCast. However, no preference versus country, subnet or hop count is shown. Therefore, we believe that next-generation P2P live streaming applications definitively need to improve the level of network-awareness, so to better localize the traffic in the network and thus increase their network-friendliness as well.", "paper_title": "Network Awareness of P2P Live Streaming Applications: A Measurement Study", "paper_id": "WOS:000272844800005"}