{"auto_keywords": [{"score": 0.04704669903835095, "phrase": "industrial_systems"}, {"score": 0.03940134622178509, "phrase": "new_systems"}, {"score": 0.007698392089992559, "phrase": "living_systems"}, {"score": 0.00481495049065317, "phrase": "explosive_pace"}, {"score": 0.004723322467153553, "phrase": "rapid_development"}, {"score": 0.004241370886886689, "phrase": "far_more_electronic_data"}, {"score": 0.004112894218792621, "phrase": "geographically_dispersed_organizations"}, {"score": 0.0036646935906338414, "phrase": "theoretical_and_practical_importance"}, {"score": 0.003636605792981828, "phrase": "albert_einstein"}, {"score": 0.0035399770257915466, "phrase": "old_approaches"}, {"score": 0.003082007273423372, "phrase": "descartes'_reductionism"}, {"score": 0.002954228277691572, "phrase": "entire_system"}, {"score": 0.002735284807307981, "phrase": "complex_ways"}, {"score": 0.0025619562094446884, "phrase": "different_approach"}, {"score": 0.002522791642460087, "phrase": "new_types"}, {"score": 0.0022648637058989463, "phrase": "major_characteristics"}, {"score": 0.0021049977753042253, "phrase": "new_research_agenda"}], "paper_keywords": [""], "paper_abstract": "The explosive pace of globalization and the rapid development of information and communications technologies continue to impact the evolution of industrial systems. They have become completely dependent on information-generating, exchanging, and processing far more electronic data than ever before. They have become geographically dispersed organizations that comprise numerous, tightly interconnected networks of diverse companies. As a result, current-day industrial systems exhibit highly nonlinear chaotic, and unpredictable behaviors. How best to engineer these new systems is a question of both theoretical and practical importance. Albert Einstein believed that you cannot use old approaches to solve new, and fundamentally different, problems. (\"We cannot solve problems by using the same kind of thinking we used when we created them. \") That old approach, Descartes' reductionism, said that you could infer the behavior of the entire system by knowing only the behavior of its components. This view is not valid for these new systems, because their behavior emerges in complex ways front the interactions of those components. Therefore, in this paper we argue that a different approach to engineering these new types of industrial systems is needed. We base that approach on our view that these systems are remarkably similar to living systems. In this paper, we describe the major characteristics of living systems, summarize their similarities with these new systems, and use these similarities as a basis for a new research agenda.", "paper_title": "Engineering complex, information-based, networked industrial systems: A research roadmap", "paper_id": "WOS:000254243200006"}