{"auto_keywords": [{"score": 0.04871093899700793, "phrase": "algebraic_attacks"}, {"score": 0.04592160859866953, "phrase": "boolean_function"}, {"score": 0.00481495049065317, "phrase": "cryptographically_significant_boolean_functions"}, {"score": 0.004527269879990066, "phrase": "cryptographic_literature"}, {"score": 0.004195418010131832, "phrase": "multivariate_polynomial"}, {"score": 0.004090274535243564, "phrase": "low_degree_multiples"}, {"score": 0.004016782710006123, "phrase": "low_degree_nonzero_functions"}, {"score": 0.0038457240885563146, "phrase": "low_nonlinearity"}, {"score": 0.003642070943285037, "phrase": "higher_order_nonlinearities"}, {"score": 0.003563651133299401, "phrase": "enumeration_results"}, {"score": 0.003537886893587656, "phrase": "linearly_independent_annihilators"}, {"score": 0.0034491650585057754, "phrase": "highly_nonlinear_resilient_boolean_functions"}, {"score": 0.0032783186166708985, "phrase": "low-degree_subfunctions"}, {"score": 0.00320770578058916, "phrase": "algebraic_immunity"}, {"score": 0.0031386091093713706, "phrase": "existing_constructions"}, {"score": 0.0030267296900520217, "phrase": "construction_method"}, {"score": 0.002993947751499058, "phrase": "boolean_functions"}, {"score": 0.0028455850650967477, "phrase": "fast_software_encryption"}, {"score": 0.0026366753045215558, "phrase": "doubly_indexed_recursive_relation"}, {"score": 0.0023730978395564116, "phrase": "simple_symmetric_functions"}], "paper_keywords": ["algebraic attacks", " annihilators", " Boolean functions", " nonlinearity", " stream ciphers", " Walsh spectrum"], "paper_abstract": "Recently, algebraic attacks have received a lot of attention in the cryptographic literature. It has been observed that a Boolean function f used, as a cryptographic primitive, and interpreted as a multivariate polynomial over F-2, should not have low degree multiples obtained by multiplication with low degree nonzero functions. In this paper, we show that a Boolean function having low nonlinearity is (also) weak against algebraic attacks, and we extend this result to higher order nonlinearities. Next, we present enumeration results on linearly independent annihilators. We also study certain classes of highly nonlinear resilient Boolean functions for their algebraic immunity. We identify that f I unctions; having low-degree subfunctions are weak in terms of algebraic immunity, and we analyze some existing constructions from this viewpoint. Further, we present a construction method to generate Boolean functions on n variables with highest possible algebraic immunity - [n/2] (this construction, first presented at the 2005 Workshop on Fast Software Encryption (FSE 2005), has been the first one producing such functions). These functions are obtained through a doubly indexed recursive relation. We calculate their Hamming weights and deduce their nonlinearities; we show that they have very high algebraic degrees, We express them as the sums of two functions which can be obtained from simple symmetric functions by a transformation which can be implemented with an algorithm whose complexity is linear in the number of variables. We deduce a very fast way of computing the output to these functions, given their input.", "paper_title": "Algebraic immunity for cryptographically significant Boolean functions: Analysis and construction", "paper_id": "WOS:000238921200015"}