{"auto_keywords": [{"score": 0.040845749728847636, "phrase": "universally_composable_protocols"}, {"score": 0.03992659287798476, "phrase": "plain_model"}, {"score": 0.02919541736870407, "phrase": "universal_composability"}, {"score": 0.00481495049065317, "phrase": "universally_composable_two-party_computation"}, {"score": 0.004665764181113345, "phrase": "recently_proposed_universally_composable_security_framework"}, {"score": 0.0045748683993128425, "phrase": "cryptographic_protocols"}, {"score": 0.0041625173012740544, "phrase": "arbitrary_other_protocols"}, {"score": 0.00384731849108269, "phrase": "essentially_any_cryptographic_task"}, {"score": 0.0037133478610481994, "phrase": "set-up_assumptions"}, {"score": 0.0036553070575015344, "phrase": "authenticated_communication"}, {"score": 0.0033917213078141373, "phrase": "common_reference_string_model"}, {"score": 0.0031970796597571367, "phrase": "honest_majority"}, {"score": 0.0031100973266506163, "phrase": "important_special_case"}, {"score": 0.003085681391556093, "phrase": "two-party_protocols"}, {"score": 0.0030017207229983385, "phrase": "universally_composable_two-party_function_evaluation"}, {"score": 0.0026774738852854427, "phrase": "broad_impossibility_results"}, {"score": 0.0026355812883224203, "phrase": "large_classes"}, {"score": 0.0026148807877309417, "phrase": "deterministic_and_probabilistic_functions"}, {"score": 0.0025038930574283174, "phrase": "full_characterizations"}, {"score": 0.0022777800735119405, "phrase": "deterministic_functions"}], "paper_keywords": ["secure two-party computation", " universal composability", " impossibility results"], "paper_abstract": "The recently proposed universally composable security framework for analyzing security of cryptographic protocols provides very strong security guarantees. In particular, a protocol proven secure in this framework is guaranteed to maintain its security even when run concurrently with arbitrary other protocols. It has been shown that if a majority of the parties are honest, then universally composable protocols exist for essentially any cryptographic task in the plain model (i.e., with no set-up assumptions beyond that of authenticated communication). When honest majority is not guaranteed, general feasibility results are known only when given a trusted set-up, such as in the common reference string model. Only little was known regarding the existence of universally composable protocols in the plain model without honest majority, and in particular regarding the important special case of two-party protocols. We study the feasibility of universally composable two-party function evaluation in the plain model. Our results show that in this setting, very few functions can be securely computed in the framework of universal composability. We demonstrate this by providing broad impossibility results that apply to large classes of deterministic and probabilistic functions. For some of these classes, we also present full characterizations of what can and cannot be securely realized in the framework of universal composability. Specifically, our characterizations are for the classes of deterministic functions in which (a) both parties receive the same output, (b) only one party receives output, and (c) only one party has input.", "paper_title": "On the limitations of universally composable two-party computation without set-up assumptions", "paper_id": "WOS:000235443100001"}