{"auto_keywords": [{"score": 0.041425500262378456, "phrase": "higher_moments"}, {"score": 0.00481495049065317, "phrase": "finite_probability_space"}, {"score": 0.00464976086880886, "phrase": "memoryless_source"}, {"score": 0.004569293780076254, "phrase": "average_information_content"}, {"score": 0.0029869295106209415, "phrase": "shannon"}, {"score": 0.0026736139757155266, "phrase": "aczel"}, {"score": 0.0026427048205813447, "phrase": "renyi"}, {"score": 0.0025967927629150715, "phrase": "memoryless_sources"}, {"score": 0.0024640253074497114, "phrase": "usual_definitions"}, {"score": 0.0023932142697579506, "phrase": "general_stationary_sources"}, {"score": 0.002154693685426657, "phrase": "special_properties"}, {"score": 0.0021297010898172534, "phrase": "stationary_markov_sources"}], "paper_keywords": ["information", " entropy", " moments of information", " variance of information"], "paper_abstract": "The entropy of a finite probability space or, equivalently, a memoryless source is the average information content of an event. The fact that entropy is an expectation suggests that it could be quite important in certain applications to take into account higher moments of information and parameters derived from these like the variance or skewness. In this paper we initiate a study of the higher moments of information for sources without memory and sources with memory. We derive properties of these moments for information defined in the sense of Shannon and indicate how these considerations can be extended to include the concepts of information in the sense of Aczel or Renyi. For memoryless sources, these concepts are immediately supported by the usual definitions of moments; for general stationary sources, let alone general sources, no such applicable framework seems to exist; on the other hand, the special properties of stationary Markov sources suggest such definitions which are both, well-motivated and mathematically meaningful.", "paper_title": "Entropy and Higher Moments of Information", "paper_id": "WOS:000277568600009"}