{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "constrained_agents"}, {"score": 0.004777214679969785, "phrase": "stochastic_environments"}, {"score": 0.0047026237903774895, "phrase": "agent's_resources"}, {"score": 0.0042452552248398445, "phrase": "payload_restrictions"}, {"score": 0.0036553070575015344, "phrase": "-_opportunities"}, {"score": 0.003500313767208306, "phrase": "resource_constraints"}, {"score": 0.003378385493203297, "phrase": "optimal_series"}, {"score": 0.003085681391556093, "phrase": "stochastic_environment"}, {"score": 0.0028405715222684183, "phrase": "mixed_integer_linear_programming"}, {"score": 0.0025638362414466278, "phrase": "phase_creation"}, {"score": 0.0024842242921857705, "phrase": "optimal_allocations"}, {"score": 0.0023600807990911145, "phrase": "allocated_resources"}, {"score": 0.0022688141624966967, "phrase": "coupled_problems"}, {"score": 0.002130056082139311, "phrase": "larger_problems"}, {"score": 0.0021049977753042253, "phrase": "alternative_solution_techniques"}], "paper_keywords": [""], "paper_abstract": "Because an agent's resources dictate what actions it can possibly take, it should plan which resources it holds over time carefully, considering its inherent limitations (such as power or payload restrictions), the competing needs of other agents for the same resources, and the stochastic nature of the environment. Such agents can, in general, achieve more of their objectives if they can use - and even create - opportunities to change which resources they hold at various times. Driven by resource constraints, the agents could break their overall missions into an optimal series of phases, optimally reconfiguring their resources at each phase, and optimally using their assigned resources in each phase, given their knowledge of the stochastic environment. In this paper, we formally define and analyze this constrained, sequential optimization problem in both the single-agent and multi-agent contexts. We present a family of mixed integer linear programming (MILP) formulations of this problem that can optimally create phases (when phases are not predefined) accounting for costs and limitations in phase creation. Because our formulations simultaneously also find the optimal allocations of resources at each phase and the optimal policies for using the allocated resources at each phase, they exploit structure across these coupled problems. This allows them to find solutions significantly faster (orders of magnitude faster in larger problems) than alternative solution techniques, as we demonstrate empirically.", "paper_title": "Resource-Driven Mission-Phasing Techniques for Constrained Agents in Stochastic Environments", "paper_id": "WOS:000280752800001"}