{"auto_keywords": [{"score": 0.04937303236560827, "phrase": "information_source"}, {"score": 0.02322730111336097, "phrase": "internet_acceptance"}, {"score": 0.009798409414656716, "phrase": "future_use"}, {"score": 0.009512888425471265, "phrase": "tourism_sector"}, {"score": 0.004470141828110505, "phrase": "actual_acceptance"}, {"score": 0.004365082149504191, "phrase": "tourism_information_source"}, {"score": 0.004212084623472799, "phrase": "growing_importance"}, {"score": 0.0038986714523819794, "phrase": "tam"}, {"score": 0.003818326867123525, "phrase": "broad_sample"}, {"score": 0.003795677450778112, "phrase": "international_tourists"}, {"score": 0.0037396377535454887, "phrase": "main_findings"}, {"score": 0.003706410380455668, "phrase": "antecedent_role"}, {"score": 0.00368442237104581, "phrase": "actual_use"}, {"score": 0.0031468151597922214, "phrase": "tourism_products"}, {"score": 0.0027440503994044787, "phrase": "equally_vital_role"}, {"score": 0.0026319954633536764, "phrase": "internet-use_habit"}, {"score": 0.002509510672395393, "phrase": "rather_few_existing_studies"}, {"score": 0.00248718591918233, "phrase": "tourist_internet_use"}, {"score": 0.0024070101893580408, "phrase": "present_work"}, {"score": 0.002378499067102358, "phrase": "significant_differences"}, {"score": 0.0022409186856679887, "phrase": "internet_use"}, {"score": 0.002123899346884527, "phrase": "behavioural_habit"}, {"score": 0.0021049977753042253, "phrase": "technology_use"}], "paper_keywords": ["Internet", " Tourism", " User studies", " Information retrieval"], "paper_abstract": "Purpose - The purpose of this paper is to aim to identify the antecedents of both actual acceptance and future use of the internet as a tourism information source. In the tourism sector, the internet is a medium of growing importance. Nonetheless, very few studies have researched the antecedents of internet acceptance and use by tourists. Design/methodology/approach - This purpose was pursued by extending the Technology Acceptance Model (TAM) and applying it to a broad sample of international tourists. Findings - The main findings concern the antecedent role of actual use with regard to future use, as well as the roles of usefulness and ease of use as drivers of the acceptance of the internet as an information source by the tourist. Research limitations - The study analysed the acceptance of the internet as an information source but not its use as a medium for purchasing tourism products or services. Practical implications - While most research results suggest that businesses and institutions should direct their attention to the usefulness rather than to the ease of use of the internet, the results of this study imply that within the tourism sector ease of use plays an equally vital role in internet acceptance. Furthermore, the results show that the creation of an internet-use habit in the tourist builds a barrier to change of information source. Originality/value - Amidst the rather few existing studies focused on tourist internet use, there is a body of research (including the present work) that identifies significant differences between tourism and other contexts (e.g. work, e-commerce) regarding the importance of the antecedents of internet use. Moreover, there is, to our knowledge, no research to date testing the inclusion of behavioural habit to explain technology use.", "paper_title": "Antecedents of internet acceptance and use as an information source by tourists", "paper_id": "WOS:000268705700010"}