{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intention_recognition"}, {"score": 0.005574969406646921, "phrase": "bayesian_networks"}, {"score": 0.0047145329604366395, "phrase": "decision_making"}, {"score": 0.0043699845927285905, "phrase": "observed_actions"}, {"score": 0.004033464035028803, "phrase": "pre-empting_danger"}, {"score": 0.0033218213825698417, "phrase": "general_statistical_evidence"}, {"score": 0.0032800186243040663, "phrase": "heuristic_information"}, {"score": 0.0032115093493071366, "phrase": "situation_specific_information"}, {"score": 0.0031577303835881964, "phrase": "logical_reasoning"}, {"score": 0.002914288956035066, "phrase": "new_observations"}, {"score": 0.0028775998963807324, "phrase": "situated_reasoning"}, {"score": 0.0027123819773059127, "phrase": "logic_component"}, {"score": 0.002461241017147324, "phrase": "plan_recognition"}, {"score": 0.0023100907305651872, "phrase": "important_issues"}, {"score": 0.0022238834225283594, "phrase": "integrative_approach"}, {"score": 0.0021049977753042253, "phrase": "logic_programming"}], "paper_keywords": ["Intention recognition", " decision making", " Bayesian networks", " logic programming"], "paper_abstract": "Intention recognition is the process of becoming aware of the intentions of other agents, inferring them through observed actions or effects on the environment. Intention recognition enables pro-activeness, in cooperating or promoting cooperation, and in pre-empting danger. Technically, intention recognition can be performed incrementally as you go along, which amounts to learning. Intention recognition can also use past experience from a database of past interactions, not necessarily with the same agent. Bayesian Networks (BN) can be employed to dynamically summarize general statistical evidence, furnishing heuristic information to link with the situation specific information, about which logical reasoning can take place, and decisions made on actions to be performed, possibly involving actions to obtain new observations. This situated reasoning feeds into the BN to tune it, and back again into the logic component. In this article, we provide a review bearing on the state-of-the-art work on intention and plan recognition, which includes a comparison with our recent research, where we address a number of important issues of intention recognition. We also argue for an integrative approach to intention-based decision-making that uses a combination of Logic Programming and Bayesian Networks.", "paper_title": "State-of-the-art of intention recognition and its use in decision making", "paper_id": "WOS:000318470700006"}