{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bipartite_relations"}, {"score": 0.004281125387210667, "phrase": "social_websites"}, {"score": 0.004075198669927074, "phrase": "different_items"}, {"score": 0.0038938807148174975, "phrase": "direct_interactions"}, {"score": 0.0034618177773967015, "phrase": "bipartite_relation"}, {"score": 0.003042697264766327, "phrase": "visualization_framework"}, {"score": 0.002996840657035727, "phrase": "micro-exploration_and_detailed_analysis"}, {"score": 0.0027254466299651936, "phrase": "enhanced_graph_view"}, {"score": 0.0026945722090537397, "phrase": "social_network"}, {"score": 0.00265394824073552, "phrase": "statistical_information"}, {"score": 0.0025357050267224715, "phrase": "radial_view"}, {"score": 0.002488001663771768, "phrase": "people's_interests"}, {"score": 0.002350196395175188, "phrase": "combined_use"}, {"score": 0.0021453734588569823, "phrase": "real_dataset"}], "paper_keywords": ["Bipartite relations", " Graph visualization", " Radial visualization", " Bar charts", " Information visualization"], "paper_abstract": "In many application domains, we encounter data which involves a graph encoding certain relationships and a set of items related to the graph. One example is in social websites where the users interact with each other, and share their interests on different items such as music or books. In this case, the direct interactions among the users can be represented as a graph, and the items like music or books can be represented as a set. People are often interested in the bipartite relation between the graph and the set. They might want to know the similarity or difference of the items liked by themselves and by their friends. In this paper, we propose a visualization framework designed for the micro-exploration and detailed analysis of relations involving a graph and a set. Our system consists of two major components: an enhanced graph view and a radial view. The enhanced graph view shows a social network of people and statistical information about the items which people are interested in, and the radial view is designed to show people's interests, the overlapping of their interests, and recommended items based on their interests. The combined use of the two visualization components can facilitate the discovery of various relational patterns underlying the links connecting the graph and the set. The experiment on the real dataset demonstrates the effectiveness of our technique.", "paper_title": "Visualization of bipartite relations between graphs and sets", "paper_id": "WOS:000353409400004"}