{"auto_keywords": [{"score": 0.0304242490196952, "phrase": "new_mis_journal_rankings"}, {"score": 0.01534198476316378, "phrase": "subjective_and_objective_based_mis_journal_rankings"}, {"score": 0.008454766225754624, "phrase": "borda_count_approach"}, {"score": 0.004814956569287878, "phrase": "borda"}, {"score": 0.004195418010131832, "phrase": "management_information_systems"}, {"score": 0.004154362910374492, "phrase": "mis"}, {"score": 0.003974349782102708, "phrase": "subjective_method"}, {"score": 0.003916098498242888, "phrase": "mis_journal_rankings"}, {"score": 0.003709693561373117, "phrase": "journals'_impact_factors"}, {"score": 0.0033452741392850523, "phrase": "researchers'_perceptions"}, {"score": 0.0030464123943266673, "phrase": "hybrid_method"}, {"score": 0.002986969236641105, "phrase": "different_rankings"}, {"score": 0.002943147037670826, "phrase": "borda_count"}, {"score": 0.0027334673433027086, "phrase": "low_correlations"}, {"score": 0.0025014259919355453, "phrase": "future_researches"}, {"score": 0.0023117182131967523, "phrase": "different_mis_journal_rankings"}, {"score": 0.0022777800735119405, "phrase": "subjective_and_objective_methods"}, {"score": 0.0021049977753042253, "phrase": "top-ranked_journals"}], "paper_keywords": ["h-index", " Borda count", " Journal ranking", " MIS journals"], "paper_abstract": "Purpose - Ranking relevant journals is very critical for researchers to choose their publication outlets, which can affect their research performance. In the management information systems (MIS) subject, many related studies conducted surveys as the subjective method for identifying MIS journal rankings. However, very few consider other objective methods, such as journals' impact factors and h-indexes. The paper aims to discuss these issues. Design/methodology/approach - In this paper, top 50 ranked journals identified by researchers' perceptions are examined in terms of the correlation to the rankings by their impact factors and h-indexes. Moreover, a hybrid method to combine these different rankings based on Borda count is used to produce new MIS journal rankings. Findings - The results show that there are low correlations between the subjective and objective based MIS journal rankings. In addition, the new MIS journal rankings by the Borda count approach can also be considered for future researches. Originality/value - The contribution of this paper is to apply the Borda count approach to combine different MIS journal rankings produced by subjective and objective methods. The new MIS journal rankings and previous studies can be complementary to allow researchers to determine the top-ranked journals for their publication outlets.", "paper_title": "A Borda count approach to combine subjective and objective based MIS journal rankings", "paper_id": "WOS:000342001700002"}