{"auto_keywords": [{"score": 0.048942952634754504, "phrase": "kuwait_university"}, {"score": 0.010612387000973441, "phrase": "information-seeking_behaviour"}, {"score": 0.00594612545734554, "phrase": "graduate_students"}, {"score": 0.004655742198075387, "phrase": "purpose_-_this_paper"}, {"score": 0.0039729853486821995, "phrase": "different_approaches"}, {"score": 0.003608732492631878, "phrase": "semi-structured_interviews"}, {"score": 0.003422781254306241, "phrase": "online_interviews"}, {"score": 0.003262035294895737, "phrase": "ten_faculty_staff"}, {"score": 0.003199864072042816, "phrase": "significant_factors"}, {"score": 0.003169222811082848, "phrase": "students'_information-seeking_behaviour"}, {"score": 0.0030642636185693054, "phrase": "library_awareness"}, {"score": 0.003034916887102753, "phrase": "information_literacy"}, {"score": 0.0029343925814926787, "phrase": "source_characteristics"}, {"score": 0.0025767987652419054, "phrase": "government_sector"}, {"score": 0.002340250894008014, "phrase": "information-seeking_model"}, {"score": 0.002219516542316085, "phrase": "extended_model"}, {"score": 0.0021049977753042253, "phrase": "information_behaviour"}], "paper_keywords": ["Information-seeking behaviour", " Model", " Information literacy", " Graduate students", " Information retrieval", " Graduates", " Universities", " Kuwait"], "paper_abstract": "Purpose - This paper seeks to report the results of research conducted to model the information-seeking behaviour of graduate students at Kuwait University and the factors influencing that behaviour. Design/methodology/approach - The research employed a number of different approaches: a questionnaire survey to 800 graduate students studying at Kuwait University; a questionnaire survey to 180 academics at the university; semi-structured interviews with eight academics; face-to-face and online interviews with 11 university library staff, four focus groups with 24 students and three focus groups with ten faculty staff. Findings - Significant factors influencing students' information-seeking behaviour were found to be related to library awareness, information literacy, organisational and environmental issues, source characteristics, and demographics (specifically gender and nationality). Research limitations/implications - The research focused on graduate students at a Kuwait University which is affiliated to the government sector, however, the information seeking model is more widely applicable, particularly to other developing countries. Originality/value - Proposed is an information-seeking model that extended two other relevant and influential models of information-seeking behaviour. The extended model shows promise for its intended utility in identifying factors that influence the information behaviour of graduate students.", "paper_title": "Modelling information-seeking behaviour of graduate students at Kuwait University", "paper_id": "WOS:000308836300002"}