{"auto_keywords": [{"score": 0.0462368381299012, "phrase": "prior_knowledge"}, {"score": 0.00481495049065317, "phrase": "prior_domain_knowledge"}, {"score": 0.0047155367844327, "phrase": "information_problems"}, {"score": 0.004503959683578956, "phrase": "domain_expertise"}, {"score": 0.0040916230716372265, "phrase": "twenty-four_experts"}, {"score": 0.0038271712887391015, "phrase": "psychology_information"}, {"score": 0.0037795163893761027, "phrase": "universalis_website"}, {"score": 0.003701401653850141, "phrase": "six_information_problems"}, {"score": 0.003670608022642996, "phrase": "varying_complexity"}, {"score": 0.003418958653159371, "phrase": "problem_statement"}, {"score": 0.0027510752634224726, "phrase": "shorter_search_times"}, {"score": 0.00246765655376112, "phrase": "different_query_strategies"}, {"score": 0.00241658945942583, "phrase": "impossible_problems"}, {"score": 0.002327310963701377, "phrase": "new_queries"}, {"score": 0.0023079225317714815, "phrase": "psychology-related_keywords"}, {"score": 0.0022507188208913394, "phrase": "thematic_category_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information searching, Expertise", " Information problem complexity", " Strategies"], "paper_abstract": "This study addresses the impact of domain expertise (i.e. of prior knowledge of the domain) on the performance and query strategies used by users while searching for information. Twenty-four experts (psychology students) and 24 non-experts (students from other disciplines) had to search for psychology information from the Universalis website in order to perform six information problems of varying complexity: two simple problems (the keywords required to complete the task were provided in the problem statement), two more difficult problems (the keywords required had to be inferred) and two impossible problems (no answer was provided by the website). The results showed that participants with prior knowledge in the domain (experts in psychology) performed better (i.e. reached more correct answers after shorter search times) than non-experts. This difference was stronger as the complexity of the problems increased. This study also showed that experts and non-experts displayed different query strategies. Experts reformulated the impossible problems more often than non-experts, because they produced new queries with psychology-related keywords. The participants rarely used thematic category tool and when they did so this did not enhance their performance. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Query strategies during information searching: Effects of prior domain knowledge and complexity of the information problems to be solved", "paper_id": "WOS:000359504900001"}