{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "protein-protein_interactions"}, {"score": 0.008173389070959922, "phrase": "protein-protein_structures"}, {"score": 0.006560978992178461, "phrase": "scoring_function"}, {"score": 0.005958966439233855, "phrase": "binding_affinity"}, {"score": 0.00444270599754277, "phrase": "spa-pp"}, {"score": 0.004273196830970426, "phrase": "protein_functions"}, {"score": 0.004138010495069077, "phrase": "isolated_protein_structures"}, {"score": 0.0038624981944755813, "phrase": "computational_docking_methods"}, {"score": 0.003809628721278519, "phrase": "increasing_role"}, {"score": 0.0036721416244816455, "phrase": "protein-protein_complexes"}, {"score": 0.003427540517249369, "phrase": "computational_docking"}, {"score": 0.0033961782274326948, "phrase": "previous_scoring_functions"}, {"score": 0.0031845067058084583, "phrase": "protein-protein_complex"}, {"score": 0.002945081009084692, "phrase": "native_protein-protein_complex"}, {"score": 0.0025655216052760093, "phrase": "optimization_strategy"}, {"score": 0.002530359917257626, "phrase": "testing_results"}, {"score": 0.0023725232579531273, "phrase": "binding_pose"}, {"score": 0.002276283303864666, "phrase": "promising_quantification"}, {"score": 0.0021739117830106365, "phrase": "protein_docking_tools"}, {"score": 0.0021049977753042253, "phrase": "protein-protein_structure"}], "paper_keywords": [""], "paper_abstract": "Motivation: Most biological processes are mediated by the protein-protein interactions. Determination of the protein-protein structures and insight into their interactions are vital to understand the mechanisms of protein functions. Currently, compared with the isolated protein structures, only a small fraction of protein-protein structures are experimentally solved. Therefore, the computational docking methods play an increasing role in predicting the structures and interactions of protein-protein complexes. The scoring function of protein-protein interactions is the key responsible for the accuracy of the computational docking. Previous scoring functions were mostly developed by optimizing the binding affinity which determines the stability of the protein-protein complex, but they are often lack of the consideration of specificity which determines the discrimination of native protein-protein complex against competitive ones. Results: We developed a scoring function (named as SPA-PP, specificity and affinity of the protein-protein interactions) by incorporating both the specificity and affinity into the optimization strategy. The testing results and comparisons with other scoring functions show that SPA-PP performs remarkably on both predictions of binding pose and binding affinity. Thus, SPA-PP is a promising quantification of protein-protein interactions, which can be implemented into the protein docking tools and applied for the predictions of protein-protein structure and affinity.", "paper_title": "Specificity and affinity quantification of protein-protein interactions", "paper_id": "WOS:000318573900004"}