{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "leanness_criteria"}, {"score": 0.01526751765740687, "phrase": "balanced_scorecard"}, {"score": 0.00969714674565743, "phrase": "company's_lean_strategy_map"}, {"score": 0.004450568197899267, "phrase": "logical_procedures"}, {"score": 0.004406994912939125, "phrase": "auto_part_manufacturing_organizations"}, {"score": 0.004195418010131832, "phrase": "common_methodology"}, {"score": 0.003974349782102708, "phrase": "performance_measurement_systems"}, {"score": 0.0037834649508375544, "phrase": "state-of-the_arts"}, {"score": 0.0031845067058084583, "phrase": "bsc_approach"}, {"score": 0.0030017207229983385, "phrase": "lean_performance_measurement"}, {"score": 0.0027878797103973313, "phrase": "bsc_concept"}, {"score": 0.0026801145128156774, "phrase": "dematel"}, {"score": 0.0023694065215394593, "phrase": "reference_point"}, {"score": 0.002346160830406661, "phrase": "auto_part_manufacturing_companies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Lean production", " Leanness", " Balanced Scorecard", " DEMATEL", " Lean strategy map"], "paper_abstract": "For investigating the leanness criteria, a set of logical procedures for auto part manufacturing organizations have been developed in this paper. Of the common methodology to determine the production/service performance criteria is to consider and develop the performance measurement systems (PMS) to some extent. Reviewing the state-of-the arts, various systems & approaches used for measuring performance has been studied in which the concept of Balanced Scorecard (BSC) approach was selected in this study. In this paper the concept of BSC approach has been developed for selecting the leanness criteria. For determining the lean performance measurement through the company's lean strategy map, a set of objectives should be driven based on the BSC concept. To determine the company's lean strategy map, the DEMATEL approach has been used to identify the cause and effect relationships among objectives as well as their priorities. This study may serve as a reference point for auto part manufacturing companies to identify their production weaknesses, and help them to focus on their improvement based on their most important and suitable selected objectives and criteria. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Extracting leanness criteria by employing the concept of Balanced Scorecard", "paper_id": "WOS:000290237500159"}