{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "delayed_attributes"}, {"score": 0.004304574865291508, "phrase": "batch_process"}, {"score": 0.004041546659145336, "phrase": "new_challenges_to_the_machine_learning_community"}, {"score": 0.003768028741967194, "phrase": "incoming_instances"}, {"score": 0.00347620887265168, "phrase": "incomplete_instance"}, {"score": 0.0032294837250130357, "phrase": "reference_set"}, {"score": 0.003021334228842501, "phrase": "different_characteristics"}, {"score": 0.0028664985822266344, "phrase": "system_design"}, {"score": 0.0028166655005289073, "phrase": "common_alternative"}, {"score": 0.002767696345005216, "phrase": "ad_hoc_classifier"}, {"score": 0.002719576221177709, "phrase": "good_learning"}, {"score": 0.00268168157806506, "phrase": "different_strategies"}, {"score": 0.002607464886544904, "phrase": "learning_curves"}, {"score": 0.0025892330566358503, "phrase": "final_classification_errors"}, {"score": 0.0025711283781017424, "phrase": "fifteen_data_sets"}, {"score": 0.0024999636244840647, "phrase": "stringent_context"}, {"score": 0.0023968838023247533, "phrase": "simple_on-line_strategies"}, {"score": 0.002363474907331799, "phrase": "active_strategies"}, {"score": 0.002242277042923036, "phrase": "simple_instance-based_classifiers"}, {"score": 0.0022110183535859374, "phrase": "well-known_nearest_neighbor"}, {"score": 0.0021573582896732657, "phrase": "support_vector_machines"}, {"score": 0.0021049977753042253, "phrase": "classification_confidence"}], "paper_keywords": ["Streaming data", " On-line classification", " Delayed attributes", " Semi-supervised learning"], "paper_abstract": "In many real applications, data are not all available at the same time, or it is not affordable to process them all in a batch process, but rather, instances arrive sequentially in a stream. The scenario of streaming data introduces new challenges to the machine learning community, since difficult decisions have to be made. The problem addressed in this paper is that of classifying incoming instances for which one attribute arrives only after a given delay. In this formulation, many open issues arise, such as how to classify the incomplete instance, whether to wait for the delayed attribute before performing any classification, or when and how to update a reference set. Three different strategies are proposed which address these issues differently. Orthogonally to these strategies, three classifiers of different characteristics are used. Keeping on-line learning strategies independent of the classifiers facilitates system design and contrasts with the common alternative of carefully crafting an ad hoc classifier. To assess how good learning is under these different strategies and classifiers, they are compared using learning curves and final classification errors for fifteen data sets. Results indicate that learning in this stringent context of streaming data and delayed attributes can successfully take place even with simple on-line strategies. Furthermore, active strategies behave generally better than more conservative passive ones. Regarding the classifiers, it was found that simple instance-based classifiers such as the well-known nearest neighbor may outperform more elaborate classifiers such as the support vector machines, especially if some measure of classification confidence is considered in the process.", "paper_title": "On-line learning from streaming data with delayed attributes: a comparison of classifiers and strategies", "paper_id": "WOS:000294910400003"}