{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "content_multihoming"}, {"score": 0.014290613507625312, "phrase": "content_publishers"}, {"score": 0.004718314112245913, "phrase": "multiple_content_distribution_networks"}, {"score": 0.00441738161338662, "phrase": "broader_set"}, {"score": 0.004263336444795021, "phrase": "multiple_distribution_networks"}, {"score": 0.0039310261964323545, "phrase": "first_systematic_study"}, {"score": 0.003793876828939456, "phrase": "novel_algorithms"}, {"score": 0.003341839487905525, "phrase": "content_objects"}, {"score": 0.003308085469148074, "phrase": "content_distribution_networks"}, {"score": 0.0029584874121320165, "phrase": "individual_content"}, {"score": 0.002632332114727894, "phrase": "individual_viewers"}, {"score": 0.0024641134634779535, "phrase": "real_charging_data"}, {"score": 0.002426842369975213, "phrase": "viewer_demands"}, {"score": 0.0021049977753042253, "phrase": "viewer_qoe_degradation"}], "paper_keywords": ["Content Delivery", " Multiple CDNs", " Optimization"], "paper_abstract": "Many large content publishers use multiple content distribution networks to deliver their content, and many commercial systems have become available to help a broader set of content publishers to benefit from using multiple distribution networks, which we refer to as content multihoming. In this paper, we conduct the first systematic study on optimizing content multihoming, by introducing novel algorithms to optimize both performance and cost for content multihoming. In particular, we design a novel, efficient algorithm to compute assignments of content objects to content distribution networks for content publishers, considering both cost and performance. We also design a novel, lightweight client adaptation algorithm executing at individual content viewers to achieve scalable, fine-grained, fast online adaptation to optimize the quality of experience (QoE) for individual viewers. We prove the optimality of our optimization algorithms and conduct systematic, extensive evaluations, using real charging data, content viewer demands, and performance data, to demonstrate the effectiveness of our algorithms. We show that our content multihoming algorithms reduce publishing cost by up to 40%. Our client algorithm executing in browsers reduces viewer QoE degradation by 51%.", "paper_title": "Optimizing Cost and Performance for Content Multihoming", "paper_id": "WOS:000309217600065"}