{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sibyl"}, {"score": 0.008451100322726368, "phrase": "spoken_documents"}, {"score": 0.006546585639614847, "phrase": "speech_transcripts"}, {"score": 0.0064140779610773, "phrase": "coreference_resolution"}, {"score": 0.005121262097622536, "phrase": "qa"}, {"score": 0.004527947981009528, "phrase": "factoid_question-answering_system"}, {"score": 0.004346139434813299, "phrase": "spoken-word_documents"}, {"score": 0.00422899036681456, "phrase": "first_time"}, {"score": 0.0040869663676860535, "phrase": "usual_qa"}, {"score": 0.0040591367766929344, "phrase": "written_documents"}, {"score": 0.003803991592917943, "phrase": "linguistic_information"}, {"score": 0.0037651925588909783, "phrase": "speech-based_qa_task"}, {"score": 0.0037140731069193896, "phrase": "named-entity_detection"}, {"score": 0.00365114510725007, "phrase": "syntactic_parsing"}, {"score": 0.003456827226847432, "phrase": "supervised_machine-learning_techniques"}, {"score": 0.003375087185182269, "phrase": "answer_extraction_step"}, {"score": 0.003306559295382181, "phrase": "handcrafted_knowledge"}, {"score": 0.003014948673771347, "phrase": "automatic_transcripts"}, {"score": 0.002777341265639153, "phrase": "main_results"}, {"score": 0.002748984715897838, "phrase": "syntactic_information"}, {"score": 0.0026747708876640377, "phrase": "question_candidates"}, {"score": 0.002620424858132324, "phrase": "manual_and_automatic_transcripts"}, {"score": 0.0025848074189353397, "phrase": "asr_quality"}, {"score": 0.0024138345020219333, "phrase": "-art_technology"}], "paper_keywords": ["Algorithms", " Experimentation", " Question answering", " spoken document retrieval"], "paper_abstract": "In this article, we present a factoid question-answering system, Sibyl, specifically tailored for question answering (QA) on spoken-word documents. This work explores, for the first time, which techniques can be robustly adapted from the usual QA on written documents to the more difficult spoken document scenario. More specifically, we study new information retrieval (IR) techniques designed or speech, and utilize several levels of linguistic information for the speech-based QA task. These include named-entity detection with phonetic information, syntactic parsing applied to speech transcripts, and the use of coreference resolution. Sibyl is largely based on supervised machine-learning techniques, with special focus on the answer extraction step, and makes little use of handcrafted knowledge. Consequently, it should be easily adaptable to other domains and languages. Sibyl and all its modules are extensively evaluated on the European Parliament Plenary Sessions English corpus, comparing manual with automatic transcripts obtained by three different automatic speech recognition (ASR) systems that exhibit significantly different word error rates. This data belongs to the CLEF 2009 track for QA on speech transcripts. The main results confirm that syntactic information is very useful for learning to rank question candidates, improving results on both manual and automatic transcripts, unless the ASR quality is very low. At the same time, our experiments on coreference resolution reveal that the state-of-the-art technology is not mature enough to be effectively exploited for QA with spoken documents. Overall, the performance of Sibyl is comparable or better than the state-of-the-art on this corpus, confirming the validity of our approach.", "paper_title": "Sibyl, a Factoid Question-Answering System for Spoken Documents", "paper_id": "WOS:000308657600005"}