{"auto_keywords": [{"score": 0.03434145117173228, "phrase": "channel_representation"}, {"score": 0.00481495049065317, "phrase": "semantic_soft_biometric_descriptions"}, {"score": 0.004273601449537163, "phrase": "semantic_descriptions"}, {"score": 0.0037928847801943404, "phrase": "intelligent_video_surveillance_systems"}, {"score": 0.003542786326740931, "phrase": "computer_vision_algorithms"}, {"score": 0.003423969509052361, "phrase": "novel_approach"}, {"score": 0.00317095235382607, "phrase": "video_stream"}, {"score": 0.0030515222178491923, "phrase": "prior_information"}, {"score": 0.002539978170928796, "phrase": "relative_performance_improvement"}, {"score": 0.0022062235065459274, "phrase": "video_steam"}, {"score": 0.002159623311924437, "phrase": "person_detection"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Semantic search", " Object tracking", " Localisation", " Channel representat kin", " Person re-detection"], "paper_abstract": "It is not uncommon to hear a person of interest described by their height, build, and clothing (i.e. type and colour). These semantic descriptions are commonly used by people to describe others, as they are quick to communicate and easy to understand. However such queues are not easily utilised within intelligent video surveillance systems, as they are difficult to transform into a representation that can be utilised by computer vision algorithms. In this paper we propose a novel approach that transforms such a semantic query into an avatar in the form of a channel representation that is searchable within a video stream. We show how spatial, colour and prior information (person shape) can be incorporated into the channel representation to locate a target using a particle-filter like approach. We demonstrate state-of-the-art performance for locating a subject in video based on a description, achieving a relative performance improvement of 46.7% over the baseline. We also apply this approach to person re-detection, and show that the approach can be used to re-detect a person in a video steam without the use of person detection. (C) 2015 Elsevier EN. All rights reserved.", "paper_title": "Searching for people using semantic soft biometric descriptions", "paper_id": "WOS:000365181900011"}