{"auto_keywords": [{"score": 0.0320779556848081, "phrase": "elicited_preferences"}, {"score": 0.015719716506582538, "phrase": "soft_constraint_problems"}, {"score": 0.009840540580956514, "phrase": "user_effort"}, {"score": 0.004782587436296574, "phrase": "missing_preferences"}, {"score": 0.004264395507931215, "phrase": "privacy_issues"}, {"score": 0.004164858807302222, "phrase": "ongoing_preference_elicitation_process"}, {"score": 0.003999578057088828, "phrase": "optimal_solution"}, {"score": 0.003789322824699646, "phrase": "interleave_search"}, {"score": 0.003518086415996508, "phrase": "missing_data"}, {"score": 0.0032883370175509053, "phrase": "combined_solving"}, {"score": 0.003266201217790818, "phrase": "preference_elicitation_scheme"}, {"score": 0.0032332756920184177, "phrase": "large_number"}, {"score": 0.0032115093493071366, "phrase": "different_instantiations"}, {"score": 0.00314708280192844, "phrase": "concrete_algorithm"}, {"score": 0.0027492917990724467, "phrase": "elicitation_requests"}, {"score": 0.0025696192337207155, "phrase": "user_effort_measures"}, {"score": 0.0022984065518052476, "phrase": "necessarily_optimal_solution"}, {"score": 0.002148136905808445, "phrase": "best_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Preferences", " Soft constraints", " Incompleteness", " Elicitation"], "paper_abstract": "We consider soft constraint problems where some of the preferences may be unspecified. This models, for example, settings where agents are distributed and have privacy issues, or where there is an ongoing preference elicitation process. In this context, we study how to find an optimal solution without having to wait for all the preferences. In particular, we define algorithms, that interleave search and preference elicitation, to find a solution which is necessarily optimal, that is, optimal no matter what the missing data will be, with the aim to ask the user to reveal as few preferences as possible. We define a combined solving and preference elicitation scheme with a large number of different instantiations, each corresponding to a concrete algorithm, which we compare experimentally. We compute both the number of elicited preferences and the user effort, which may be larger, as it contains all the preference values the user has to compute to be able to respond to the elicitation requests. While the number of elicited preferences is important when the concern is to communicate as little information as possible, the user effort measures also the hidden work the user has to do to be able to communicate the elicited preferences. Our experimental results on classical, fuzzy, weighted and temporal incomplete CSPs show that some of our algorithms are very good at finding a necessarily optimal solution while asking the user for only a very small fraction of the missing preferences. The user effort is also very small for the best algorithms. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Elicitation strategies for soft constraint problems with missing preferences: Properties, algorithms and experimental studies", "paper_id": "WOS:000274974100002"}