{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "aggregate_signature"}, {"score": 0.04316243750896746, "phrase": "aggregate_signatures"}, {"score": 0.0047631192993526465, "phrase": "single_short_string"}, {"score": 0.0042898529847155255, "phrase": "n_signers"}, {"score": 0.004258995791471342, "phrase": "n_messages"}, {"score": 0.004152725837204292, "phrase": "main_motivation"}, {"score": 0.0039196351785300045, "phrase": "aggregate_signature_verification"}, {"score": 0.0034046409849387365, "phrase": "additional_information"}, {"score": 0.003367939885018247, "phrase": "primary_benefit"}, {"score": 0.0031444844772458504, "phrase": "signature_scheme"}, {"score": 0.0030993584115563146, "phrase": "total_information"}, {"score": 0.0029785631356166594, "phrase": "verification_information"}, {"score": 0.002872827714395808, "phrase": "theoretical_minimum"}, {"score": 0.002672454243212711, "phrase": "identity-based_aggregate_signature_schemes"}, {"score": 0.0022629214153694504, "phrase": "private_key_generator"}, {"score": 0.0022063469115990715, "phrase": "random_oracle_model"}, {"score": 0.0021825348057711628, "phrase": "computational_diffie-hellman_assumption"}, {"score": 0.00216680270402079, "phrase": "pairing-friendly_groups"}], "paper_keywords": [""], "paper_abstract": "An aggregate signature is a single short string that convinces any verifier that, for all 1 <= i <= n, signer S-i signed message M-i, where the n signers and n messages may all be distinct. The main motivation of aggregate signatures is compactness. However, while the aggregate signature itself may be compact, aggregate signature verification might require potentially lengthy additional information - namely, the (at most) n distinct signer public keys and the (at most) n distinct messages being signed. If the verifier must obtain and/or store this additional information, the primary benefit of aggregate signatures is largely negated. This paper initiates a line of research whose ultimate objective is to find a signature scheme in which the total information needed to verify is minimized. In particular, the verification information should preferably be as close as possible to the theoretical minimum: the complexity of describing which signer(s) signed what message(s). We move toward this objective by developing identity-based aggregate signature schemes. In our schemes, the verifier does not need to obtain and/or store various signer public keys to verify; instead, the verifier only needs a description of who signed what, along with two constant-length \"tags\": the short aggregate signature and the single public key of a Private Key Generator. Our scheme is secure in the random oracle model under the computational Diffie-Hellman assumption over pairing-friendly groups against an adversary that chooses its messages and its target identities adaptively.", "paper_title": "Identity-based aggregate signatures", "paper_id": "WOS:000238186800017"}