{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "phishing_studies"}, {"score": 0.008082584335760978, "phrase": "genuine_emails"}, {"score": 0.006925621987855091, "phrase": "phishing_emails"}, {"score": 0.004609094651134046, "phrase": "role_play_scenario_experiment"}, {"score": 0.0045726187330434025, "phrase": "people's_ability"}, {"score": 0.0037336520904376687, "phrase": "informed_participants"}, {"score": 0.003559675269411366, "phrase": "uninformed_participants"}, {"score": 0.0032099453192629976, "phrase": "real_world_users"}, {"score": 0.003036040409062437, "phrase": "real_life"}, {"score": 0.0029409171055888804, "phrase": "larger_number"}, {"score": 0.002917604283241353, "phrase": "greater_diversity"}, {"score": 0.0028715299874549245, "phrase": "previous_phishing_studies"}, {"score": 0.002814956065949522, "phrase": "participants'_performance"}, {"score": 0.0024101837218440834, "phrase": "limited_diversity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Phishing", " Information security", " Security behaviours", " Email security", " Security training"], "paper_abstract": "In this paper, a role play scenario experiment of people's ability to differentiate between phishing and genuine emails demonstrated limitations in the generalisability of phishing studies. This involves issues around the priming of participants and the diversity of emails used. Only half of our 117 participants were explicitly informed that the study was assessing the ability to identify phishing emails. Results indicate that the informed participants were significantly better at discriminating between phishing and genuine emails than the uninformed participants. This has implications for the interpretation of phishing studies. Specifically, studies where participants are directly asked to identify phishing emails may not represent the performance of real world users, because people are rarely reminded about the risks of phishing emails in real life. Our study also used emails from a larger number and greater diversity of industries than previous phishing studies. Results indicate that participants' performance differs greatly in terms of category (e.g., type of sender) of emails. This demonstrates that caution should be used when interpreting the results of phishing studies that rely on only a small number of emails and/or emails of limited diversity. Hence, when designing and interpreting phishing studies, researchers should carefully consider the instructions provided to participants and the types of emails used. (C) Crown Copyright 2015 Published by Elsevier Ltd. All rights reserved.", "paper_title": "The design of phishing studies: Challenges for researchers", "paper_id": "WOS:000382271400014"}