{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "business_network-based_value_creation"}, {"score": 0.019956324033290212, "phrase": "business_networks"}, {"score": 0.004774937143916685, "phrase": "electronic_commerce"}, {"score": 0.004735254735115024, "phrase": "information_technologies"}, {"score": 0.004618166136069052, "phrase": "economic_activities"}, {"score": 0.004057596233938867, "phrase": "it._business"}, {"score": 0.0039571974661570695, "phrase": "multiple_firms"}, {"score": 0.0031580001960828186, "phrase": "informedness"}, {"score": 0.0030414140732789186, "phrase": "consumer_demand"}, {"score": 0.002966084234963723, "phrase": "flexible_production"}, {"score": 0.0028091907694771613, "phrase": "value-adding_business_networks"}, {"score": 0.0027510752634224726, "phrase": "standardized_technology"}, {"score": 0.0027167830773160203, "phrase": "business_process_solutions"}, {"score": 0.0023864566654035924, "phrase": "multiple_case_examples"}, {"score": 0.0023566987138026285, "phrase": "travel_and_hospitality_industry"}, {"score": 0.002194929830604162, "phrase": "digital_transformation"}, {"score": 0.0021049977753042253, "phrase": "highly_effective_and_innovative_network-based_value_creation"}], "paper_keywords": ["Business networks", " case studies", " e-commerce", " economic theory", " network stability", " network sustainability", " theory development", " travel and hospitality industry", " value creation", " value sharing"], "paper_abstract": "Information technologies (IT) have affected economic activities within and beyond the boundaries of the firm, changing the face of e-commerce. This article explores the circumstances under which value is created in business networks made possible by IT. Business networks combine the capabilities of multiple Firms to produce and deliver products and services that none of them could more economically produce on its own and for which there is demand in the market. We call this business network-based value creation. We apply economic theory to explain the conditions under which business networks will exist and are able to sustain their value-producing activities. Informedness has the potential to increase the complexity of consumer demand. Addressing this demand requires flexible production and delivery of products and services, and can be achieved by value-adding business networks supported by IT, standardized technology, and business process solutions. We also examine the benefits associated with business network-based value creation and fair value-sharing to support the sustainability of business networks. We develop a set of propositions and draw upon multiple case examples from the travel and hospitality industry to validate our theoretical perspectives on business network-based value creation. The results demonstrate that this industry is going through a digital transformation that makes it possible for many firms to engage in highly effective and innovative network-based value creation.", "paper_title": "Business Network-Based Value Creation in Electronic Commerce", "paper_id": "WOS:000283962000006"}