{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "alan_turing"}, {"score": 0.004712463245074863, "phrase": "artificial_intelligence"}, {"score": 0.004159446063902181, "phrase": "turing's_motivations"}, {"score": 0.004035946043145475, "phrase": "machine_intelligence"}, {"score": 0.0037189466173269355, "phrase": "ai"}, {"score": 0.003608370966473902, "phrase": "foundational_paper"}, {"score": 0.003426556090707852, "phrase": "computational_logic"}, {"score": 0.003296212583539166, "phrase": "machine_learning"}, {"score": 0.0032259472087775138, "phrase": "human-level_ai"}, {"score": 0.0029722900280316216, "phrase": "closing_section"}, {"score": 0.0025892330566358503, "phrase": "ab_initio_machine_learning"}, {"score": 0.0023958326775913165, "phrase": "inevitable_limitations"}, {"score": 0.0022457226013538343, "phrase": "turing's_three_alternatives"}, {"score": 0.0021049977753042253, "phrase": "unresolved_challenges"}], "paper_keywords": ["Alan Turing", " Artificial Intelligence", " Machine Intelligence"], "paper_abstract": "During the centennial year of his birth Alan Turing (1912-1954) has been widely celebrated as having laid the foundations for Computer Science, Automated Decryption, Systems Biology and the Turing Test. In this paper we investigate Turing's motivations and expectations for the development of Machine Intelligence, as expressed in his 1950 article in Mind. We show that many of the trends and developments within AI over the last 50 years were foreseen in this foundational paper. In particular, Turing not only describes the use of Computational Logic but also the necessity for the development of Machine Learning in order to achieve human-level AI within a 50 year time-frame. His description of the Child Machine (a machine which learns like an infant) dominates the closing section of the paper, in which he provides suggestions for how AI might be achieved. Turing discusses three alternative suggestions which can be characterised as: (1) AI by programming, (2) AI by ab initio machine learning and (3) AI using logic, probabilities, learning and background knowledge. He argues that there are inevitable limitations in the first two approaches and recommends the third as the most promising. We compare Turing's three alternatives to developments within AI, and conclude with a discussion of some of the unresolved challenges he posed within the paper.", "paper_title": "Alan Turing and the development of Artificial Intelligence", "paper_id": "WOS:000327552100002"}