{"auto_keywords": [{"score": 0.041610275888246714, "phrase": "good_algorithm"}, {"score": 0.02772513079748339, "phrase": "proto"}, {"score": 0.00481495049065317, "phrase": "data_streams"}, {"score": 0.004780633011300165, "phrase": "change_detection"}, {"score": 0.0046457802872573025, "phrase": "series_analysis"}, {"score": 0.004187917910692495, "phrase": "change_detection_algorithm"}, {"score": 0.0036553070575015344, "phrase": "favorable_and_controlled_ratio"}, {"score": 0.003464150192089816, "phrase": "false_positives"}, {"score": 0.0034026714408341868, "phrase": "change-point_detection_algorithm"}, {"score": 0.0032947371184395237, "phrase": "candidate_change-points"}, {"score": 0.0032246835734680377, "phrase": "controllable_constant"}, {"score": 0.003167441161387607, "phrase": "sample_processing"}, {"score": 0.0030889995517870525, "phrase": "fastest_known_algorithm"}, {"score": 0.002744510304340939, "phrase": "false_positive_rate"}, {"score": 0.0024036292057373803, "phrase": "synthetic_data"}, {"score": 0.002377916348320401, "phrase": "real_problems"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["data stream", " change detection", " two-sample test", " big-data"], "paper_abstract": "Change detection is one of the most important tasks in time series analysis. When the series is very long, or when it is rapidly updated, it has to be treated as a stream. This means that the change detection algorithm must process each sample in O (1) time and memory. A good algorithm must be generic in terms of the type of changes it can detect. Beyond all, a good algorithm must present a favorable and controlled ratio of the number of samples needed to detect a change to the rate of false positives. We present a change-point detection algorithm called ProTO which dynamically manages a set of candidate change-points whose expected size is a controllable constant. In terms of sample processing, ProTO is comparable with the fastest known algorithm-the Page-Hinkley Test (PHT). Yet, because PHT is limited to just one candidate, ProTO outperforms it in terms of the ratio of the delay to the false positive rate, as well as in terms of robustness. We provide variants of ProTO for detecting changes in the mean or the variance of the stream, and experiment with two realistic applications, as well as with synthetic data. On real problems, ProTO compares favorably with state-of-the-art algorithms implemented in the R-package, which require more than O (1) time per sample. (C) 2014 Wiley Periodicals, Inc.", "paper_title": "Fast and Accurate Detection of Changes in Data Streams", "paper_id": "WOS:000364190700003"}