{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ecg_signal"}, {"score": 0.023084508285114474, "phrase": "low_frequencies"}, {"score": 0.007088001194622912, "phrase": "multiple_samples"}, {"score": 0.004710227709931926, "phrase": "traditional_strategies"}, {"score": 0.0044512342099350555, "phrase": "new_and_more_fraud_proof_biometrics_modalities"}, {"score": 0.004313526644128428, "phrase": "heartbeat_pattern"}, {"score": 0.004153866009835335, "phrase": "subject_identification"}, {"score": 0.00411487907113509, "phrase": "ecg_signal_work"}, {"score": 0.004050708996795156, "phrase": "high_frequencies"}, {"score": 0.003962541905291554, "phrase": "main_goal"}, {"score": 0.0034073545850838, "phrase": "support_vector_machines"}, {"score": 0.003260543967539824, "phrase": "classification_approach"}, {"score": 0.003229914287184765, "phrase": "majority_voting"}, {"score": 0.0031200390864992407, "phrase": "traditional_classification"}, {"score": 0.0030616859252873235, "phrase": "single_samples"}, {"score": 0.00292051932649827, "phrase": "identification_accuracies"}, {"score": 0.002725277498355028, "phrase": "hz"}, {"score": 0.0021049977753042253, "phrase": "person_identification"}], "paper_keywords": ["Biometrics", " ECG", " Frequency sampling", " Majority voting scheme"], "paper_abstract": "Traditional strategies, such as fingerprinting and face recognition, are becoming more and more fraud susceptible. As a consequence, new and more fraud proof biometrics modalities have been considered, one of them being the heartbeat pattern acquired by an electrocardiogram (ECG). While methods for subject identification based on ECG signal work with signals sampled in high frequencies (>100 Hz), the main goal of this work is to evaluate the use of ECG signal in low frequencies for such aim. In this work, the ECG signal is sampled in low frequencies (30 Hz and 60 Hz) and represented by four feature extraction methods available in the literature, which are then feed to a Support Vector Machines (SVM) classifier to perform the identification. In addition, a classification approach based on majority voting using multiple samples per subject is employed and compared to the traditional classification based on the presentation of single samples per subject each time. Considering a database composed of 193 subjects, results show identification accuracies higher than 95% and near to optimality (i.e., 100%) when the ECG signal is sampled in 30 Hz and 60 Hz, respectively, being the last one very close to the ones obtained when the signal is sampled in 360 Hz (the maximum frequency existing in our database). We also evaluate the impact of: (1) the number of training and testing samples for learning and identification, respectively; (2) the scalability of the biometry (i.e., increment on the number of subjects); and (3) the use of multiple samples for person identification. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating the use of ECG signal in low frequencies as a biometry", "paper_id": "WOS:000330600800019"}