{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "fast_prediction"}, {"score": 0.004772367030970874, "phrase": "chemical_activity"}, {"score": 0.004730158389701481, "phrase": "quantitative_structure-activity_relationships"}, {"score": 0.004327981760540394, "phrase": "growing_importance"}, {"score": 0.004232875294230749, "phrase": "new_drugs"}, {"score": 0.003754140294151593, "phrase": "wider_range"}, {"score": 0.0035118972210075633, "phrase": "model_building"}, {"score": 0.003073154478201771, "phrase": "qsar_model_space"}, {"score": 0.003032405563826263, "phrase": "best_models"}, {"score": 0.0029394074636168435, "phrase": "cloud_computing_paradigm"}, {"score": 0.0028875481626754696, "phrase": "good_fit"}, {"score": 0.0026771333996253783, "phrase": "model_space"}, {"score": 0.00241658945942583, "phrase": "absolute_performance"}, {"score": 0.0023424328921363585, "phrase": "existing_qsar_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Quantitative structure-activity relationships", " Machine learning", " Cloud computing", " Scalability", " Performance evaluation"], "paper_abstract": "Quantitative Structure-Activity Relationships (QSAR) is a method for creating models that can predict certain properties of compounds. It is of growing importance in the design of new drugs. The quantity of data now available for building models is increasing rapidly, which has the advantage that more accurate models can be created, for a wider range of properties. However the disadvantage is that the amount of computation required for model building has also dramatically increased. Therefore, it became vital to find a way to accelerate this process. We have achieved this by exploiting parallelism in searching the QSAR model space for the best models. This paper shows how the cloud computing paradigm can be a good fit to this approach. It describes the design and implementation of a tool for exploring the model space that exploits our e-Science Central cloud platform. We report on the scalability achieved and the experiences gained when designing the solution. The acceleration and absolute performance achieved is much greater than for existing QSAR solutions, creating the potential for new, interesting research, and the exploitation of this approach to accelerate other types of applications. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Cloud computing for fast prediction of chemical activity", "paper_id": "WOS:000320635700023"}