{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "genetic_heterogeneity"}, {"score": 0.004753194996637899, "phrase": "complex_traits"}, {"score": 0.004286708921931472, "phrase": "utmost_interest"}, {"score": 0.004195418010131832, "phrase": "complex_phenotypes"}, {"score": 0.0037188360359702182, "phrase": "exact_interval"}, {"score": 0.003531474887552889, "phrase": "potentially_missing_intervals"}, {"score": 0.003501175642882274, "phrase": "high_relevance"}, {"score": 0.003353521531649663, "phrase": "enormous_multiple_hypothesis_testing_problem"}, {"score": 0.003296212583539166, "phrase": "large_number"}, {"score": 0.003267925215811654, "phrase": "potential_candidate_intervals"}, {"score": 0.00306334226516593, "phrase": "true_intervals"}, {"score": 0.0027861630854233693, "phrase": "contiguous_sequences"}, {"score": 0.002762240719058935, "phrase": "single_nucleotide_polymorphisms"}, {"score": 0.0025122373359090454, "phrase": "multiple_hypothesis_testing"}, {"score": 0.002427035025924384, "phrase": "huge_number"}, {"score": 0.0024061887405214186, "phrase": "candidate_intervals"}, {"score": 0.0023548511815224098, "phrase": "arabidopsis_thaliana_genome-wide_association_study_data"}, {"score": 0.0022073031056287903, "phrase": "single-locus_mapping"}, {"score": 0.0021049977753042253, "phrase": "genome-wide_discovery"}], "paper_keywords": [""], "paper_abstract": "Motivation: Genetic heterogeneity, the fact that several sequence variants give rise to the same phenotype, is a phenomenon that is of the utmost interest in the analysis of complex phenotypes. Current approaches for finding regions in the genome that exhibit genetic heterogeneity suffer from at least one of two shortcomings: (i) they require the definition of an exact interval in the genome that is to be tested for genetic heterogeneity, potentially missing intervals of high relevance, or (ii) they suffer from an enormous multiple hypothesis testing problem due to the large number of potential candidate intervals being tested, which results in either many false positives or a lack of power to detect true intervals. Results: Here, we present an approach that overcomes both problems: it allows one to automatically find all contiguous sequences of single nucleotide polymorphisms in the genome that are jointly associated with the phenotype. It also solves both the inherent computational efficiency problem and the statistical problem of multiple hypothesis testing, which are both caused by the huge number of candidate intervals. We demonstrate on Arabidopsis thaliana genome-wide association study data that our approach can discover regions that exhibit genetic heterogeneity and would be missed by single-locus mapping. Conclusions: Our novel approach can contribute to the genome-wide discovery of intervals that are involved in the genetic heterogeneity underlying complex phenotypes.", "paper_title": "Genome-wide detection of intervals of genetic heterogeneity associated with complex traits", "paper_id": "WOS:000356625700028"}