{"auto_keywords": [{"score": 0.04987325282958323, "phrase": "canada"}, {"score": 0.023226639047539303, "phrase": "software_testing_practices"}, {"score": 0.006551530005485684, "phrase": "canadian_firms"}, {"score": 0.004773692073488661, "phrase": "software_testing"}, {"score": 0.0047429793280258075, "phrase": "important_activity"}, {"score": 0.004712463245074863, "phrase": "software_development_life-cycle"}, {"score": 0.00467207889925365, "phrase": "earlier_study"}, {"score": 0.0045726187330434025, "phrase": "regional_survey"}, {"score": 0.004504253414351609, "phrase": "canadian_province"}, {"score": 0.004484910471497488, "phrase": "alberta"}, {"score": 0.0044369056710423065, "phrase": "larger_nationwide_view"}, {"score": 0.004323776691055635, "phrase": "newer_survey"}, {"score": 0.004295946094190478, "phrase": "revised_list"}, {"score": 0.00415050117148714, "phrase": "nation-wide_survey"}, {"score": 0.003949974260471287, "phrase": "important_and_interesting_findings"}, {"score": 0.003710854639354263, "phrase": "sweden"}, {"score": 0.00369493183448053, "phrase": "australia"}, {"score": 0.003539090435575708, "phrase": "testing_professionals"}, {"score": 0.0034118234596993836, "phrase": "latest_trends"}, {"score": 0.0033971539563683174, "phrase": "software_testing_industry"}, {"score": 0.003170811465728631, "phrase": "testing-related_training"}, {"score": 0.0029980260560551982, "phrase": "mutation_testing_approach"}, {"score": 0.002865346790496714, "phrase": "new_development_approaches"}, {"score": 0.0026916956768363158, "phrase": "web_application_testing_tools"}, {"score": 0.002668582249630492, "phrase": "ibm_rational_tools"}, {"score": 0.0025725382476862305, "phrase": "condition_coverage"}, {"score": 0.002528541806591273, "phrase": "user_acceptance"}, {"score": 0.0021601997088758957, "phrase": "online_discussion_forums"}, {"score": 0.002132420504803564, "phrase": "regular_basis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Survey", " Software testing", " Industry practices", " Canada"], "paper_abstract": "Software testing is an important activity in the software development life-cycle. In an earlier study in 2009, we reported the results of a regional survey of software testing practices among practitioners in the Canadian province of Alberta. To get a larger nationwide view on this topic (across Canada), we conducted a newer survey with a revised list of questions in 2010. Compared to our previous Alberta-wide survey (53 software practitioners), the nation-wide survey had larger number of participants (246 practitioners). We report the survey design, execution and results in this article. The survey results reveal important and interesting findings about software testing practices in Canada. Whenever possible, we also compare the results of this survey to other similar studies, such as the ones conducted in the US, Sweden and Australia, and also two previous Alberta-wide surveys, including our 2009 survey. The results of our survey will be of interest to testing professionals both in Canada and world-wide. It will also benefit researchers in observing the latest trends in software testing industry identifying the areas of strength and weakness, which would then hopefully encourage further industry-academia collaborations in this area. Among the findings are the followings: (1) the importance of testing-related training is increasing, (2) functional and unit testing are two common test types that receive the most attention and efforts spent on them, (3) usage of the mutation testing approach is getting attention among Canadian firms, (4) traditional Test-last Development (TLD) style is still dominating and a few companies are attempting the new development approaches such as Test-Driven Development (TDD), and Behavior-Driven Development (BDD), (5) in terms of the most popular test tools, NUnit and Web application testing tools overtook JUnit and IBM Rational tools, (6) most Canadian companies use a combination of two coverage metrics: decision (branch) and condition coverage, (7) number of passing user acceptance tests and number of defects found per day (week or month) are regarded as the most important quality assurance metrics and decision factors to release, (8) in most Canadian companies, testers are out-numbered by developers, with ratios ranging from 1:2 to 1:5, (9) the majority of Canadian firms spent less than 40% of their efforts (budget and time) on testing during development, and (10) more than 70% of respondents participated in online discussion forums related to testing on a regular basis. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "A survey of software testing practices in Canada", "paper_id": "WOS:000317322400014"}