{"auto_keywords": [{"score": 0.04820486417031532, "phrase": "mobile_web"}, {"score": 0.00481495049065317, "phrase": "mobile_devices"}, {"score": 0.004757643419056999, "phrase": "high_network_latencies"}, {"score": 0.004719816332271661, "phrase": "limited_battery_life"}, {"score": 0.004682288586254123, "phrase": "mobile_phones"}, {"score": 0.004571478018964363, "phrase": "frustrating_experience"}, {"score": 0.004517055580214742, "phrase": "prior_work"}, {"score": 0.0044277810648955624, "phrase": "memory_capacity"}, {"score": 0.004392565073466714, "phrase": "lower_web_access_latency"}, {"score": 0.003684634192576662, "phrase": "periodic_updates"}, {"score": 0.0035544816252832375, "phrase": "dynamic_web_content"}, {"score": 0.003512123587588346, "phrase": "timely_fashion"}, {"score": 0.0034289106230496816, "phrase": "instant_web_browsing_experience"}, {"score": 0.003361069456060196, "phrase": "battery_lifetime_issue"}, {"score": 0.003268333444704392, "phrase": "web_access_traces"}, {"score": 0.0031277316566463978, "phrase": "strong_spatiotemporal_signature"}, {"score": 0.002741091312632307, "phrase": "machine_learning_model"}, {"score": 0.0026760974046034854, "phrase": "future_web_accesses"}, {"score": 0.0026022112631368223, "phrase": "timely_manner"}, {"score": 0.002530359917257626, "phrase": "real_user_datasets"}, {"score": 0.0023357913211723884, "phrase": "system_prototype"}, {"score": 0.0021049977753042253, "phrase": "mobile_users"}], "paper_keywords": ["Algorithms", " Human Factors", " Experimentation"], "paper_abstract": "The high network latencies and limited battery life of mobile phones can make mobile web browsing a frustrating experience. In prior work, we proposed trading memory capacity for lower web access latency and a more convenient data transfer schedule from an energy perspective by prefetching slowly-changing data (search queries and results) nightly, when the phone is charging. However, most web content is intrinsically much more dynamic and may be updated multiple times a day, thus eliminating the effectiveness of periodic updates. This paper addresses the challenge of prefetching dynamic web content in a timely fashion, giving the user an instant web browsing experience but without aggravating the battery lifetime issue. We start by analyzing the web access traces of 8,000 users, and observe that mobile web browsing exhibits a strong spatiotemporal signature, which is different for every user. We propose to use a machine learning approach based on stochastic gradient boosting techniques to efficiently model this signature on a per user basis. The machine learning model is capable of accurately predicting future web accesses and prefetching the content in a timely manner. Our experimental evaluation with 48,000 models trained on real user datasets shows that we can accurately prefetch 60% of the URLs for about 80-90% of the users within 2 minutes before the request. The system prototype we built not only provides more than 80% lower web access time for more than 80% of the users, but it also achieves the same or lower radio energy dissipation by more than 50% for the majority of mobile users.", "paper_title": "PocketWeb: Instant Web Browsing for Mobile Devices", "paper_id": "WOS:000209339300001"}