{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "discharge_simulation"}, {"score": 0.049604883316905664, "phrase": "resin_insulator_surfaces"}, {"score": 0.03686832521693429, "phrase": "execution_time"}, {"score": 0.0329947502002775, "phrase": "distributed-memory_approach"}, {"score": 0.004065156038847781, "phrase": "great_deal"}, {"score": 0.004024863549087511, "phrase": "computational_time"}, {"score": 0.003945467978172845, "phrase": "general_way"}, {"score": 0.0038869467872381957, "phrase": "simulation_program"}, {"score": 0.003753738096719609, "phrase": "satisfactory_research_results"}, {"score": 0.0032164136388931805, "phrase": "different_types"}, {"score": 0.0031686717525002935, "phrase": "charged_particles"}, {"score": 0.003014576010931602, "phrase": "physical_domain"}, {"score": 0.0027148677103585985, "phrase": "memory_approach"}, {"score": 0.00256993314099902, "phrase": "linux_cluster"}, {"score": 0.0025317627242523104, "phrase": "six_dual-core_pcs"}, {"score": 0.002481747081849501, "phrase": "experimental_results"}, {"score": 0.0022016885701010088, "phrase": "multi-level_approach"}], "paper_keywords": [""], "paper_abstract": "In this paper, we will investigate the implementation of the parallelization approaches used in the program of discharge simulation along resin insulator surfaces in SF(6)/N(2) gas mixture which initially consumes a great deal of computational time. In a general way, this simulation program spent 10 days of execution to achieve satisfactory research results. For this reason, the goal of our paper is to reduce the execution time by parallelizing this program. Three parallelization approaches were used in our simulation: (i) splitting by different types of the charged particles using a distributed-memory approach, (ii) splitting by physical domain using a distributed-memory approach, and (iii) splitting by both domain and charged particles using multi-level distributed and shared memory approach. At last, the three approaches are tested on a Linux cluster composed of six dual-core PCs, and the experimental results show that all the parallelization approaches achieve the goal of reducing the execution time to a certain extent. In addition, among these approaches, the multi-level approach offers the most effective parallelization method for implementing this simulation on symmetrical multi-processing (SMP) clusters. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Parallelization methods for implementation of discharge simulation along resin insulator surfaces", "paper_id": "WOS:000287560300003"}