{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "authentication_tokens"}, {"score": 0.00451659023910662, "phrase": "incremental_security_layers"}, {"score": 0.004169394481182493, "phrase": "controlled_experiment"}, {"score": 0.004038076978795421, "phrase": "usability_and_usage_logs"}, {"score": 0.0037474693720823643, "phrase": "overall_quality"}, {"score": 0.003459191419478298, "phrase": "significant_differences"}, {"score": 0.003332332086930163, "phrase": "usability_measures"}, {"score": 0.0031255543155487234, "phrase": "perceived_security_ratings"}, {"score": 0.0030758904011907533, "phrase": "reverse_order"}, {"score": 0.002994859407965545, "phrase": "almost_two_thirds"}, {"score": 0.002947266048104005, "phrase": "participant_sample"}, {"score": 0.0023424328921363585, "phrase": "increasing_layers"}], "paper_keywords": ["Usability engineering", " Internet Banking", " Authentication", " Security", " Empirical study", " Evaluation"], "paper_abstract": "This research compared three different two-factor methods of eBanking authentication. Three devices employing incremental security layers in the generation of one time passcodes (OTPs) were compared in a repeated-measures, controlled experiment with SO eBanking customers. Attitudes towards usability and usage logs were taken for each experience. Comparisons of the devices in terms of overall quality, security and convenience as perceived by participants were also recorded. There were significant differences between all three methods in terms of usability measures, perceived quality, convenience and security ratings - with the perceived security ratings following a reverse order to the other measures. Almost two thirds of the participant sample chose the device they perceived the least secure as their preference. Participants were asked to use their prefer-red method again and tended to find their chosen device more usable. This research illustrates the us ability-security trade off, where convenience, quality and usability are sacrificed when increasing layers of security are required. In their preferences, customers were driven by their attitudes towards usability and convenience rather than their perceptions of security. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "User perceptions of security, convenience and usability for ebanking authentication tokens", "paper_id": "WOS:000262802600006"}