{"auto_keywords": [{"score": 0.04464124224180687, "phrase": "solid_surface_area"}, {"score": 0.04427516800676755, "phrase": "interfacial_area"}, {"score": 0.03434636159678978, "phrase": "laboratory_measurements"}, {"score": 0.014729546822451062, "phrase": "porous_media"}, {"score": 0.014359038710420052, "phrase": "image_analysis_algorithms"}, {"score": 0.012747956741651016, "phrase": "solid_surface_area_estimates"}, {"score": 0.009064845284216846, "phrase": "voxel_counting"}, {"score": 0.00901338645041694, "phrase": "two-point_correlation_functions"}, {"score": 0.00481495049065317, "phrase": "porous_media_multiphase_flow_variables"}, {"score": 0.004679250110504641, "phrase": "image_analysis"}, {"score": 0.004652570301627026, "phrase": "three-dimensional_microtomographic_image_data"}, {"score": 0.0045603777806863775, "phrase": "pore_scale_investigations"}, {"score": 0.004534372661692015, "phrase": "multiphase_flow"}, {"score": 0.004209441837971891, "phrase": "fluid_phases"}, {"score": 0.004185429483528935, "phrase": "gray-scale_x-ray_microtomographic_image_data"}, {"score": 0.003690344014465526, "phrase": "air-water_interface"}, {"score": 0.0035965032173588753, "phrase": "image_analysis_algorithm"}, {"score": 0.003545400775645216, "phrase": "anisotropic_diffusion_filter"}, {"score": 0.0034850320520618872, "phrase": "original_gray-scale_image_data"}, {"score": 0.003455232920215122, "phrase": "k-means_cluster_analysis"}, {"score": 0.003099048380523229, "phrase": "porosity_estimates"}, {"score": 0.0030725394664628475, "phrase": "two-phase_bead_pack"}, {"score": 0.0029349301013192734, "phrase": "kriging_segmentation_algorithm"}, {"score": 0.0028520627346893834, "phrase": "high_precision_beads"}, {"score": 0.002685558057339722, "phrase": "interfacial_area_estimates"}, {"score": 0.0026625766466908825, "phrase": "air-water_menisci"}, {"score": 0.002632239585404421, "phrase": "capillary_tubes"}, {"score": 0.002436289099444074, "phrase": "marching_cubes"}, {"score": 0.002367467366291158, "phrase": "analytical_interfacial_area_estimates"}, {"score": 0.002347201580471729, "phrase": "voxel_counting_and_two-point_correlation_functions"}, {"score": 0.0022037803099076423, "phrase": "microtomographic_image_data"}, {"score": 0.0021049977753042253, "phrase": "laboratory_estimates"}], "paper_keywords": ["Multiphase flow", " Porous media", " Computed microtomography", " Image analysis", " Marching cubes"], "paper_abstract": "Image analysis of three-dimensional microtomographic image data has become an integral component of pore scale investigations of multiphase flow through porous media. This study focuses on the validation of image analysis algorithms for identifying phases and estimating porosity, saturation, solid surface area, and interfacial area between fluid phases from gray-scale X-ray microtomographic image data. The data used in this study consisted of (1) a two-phase high precision bead pack from which porosity and solid surface area estimates were obtained and (2) three-phase cylindrical capillary tubes of three different radii, each containing an air-water interface, from which interfacial area was estimated. The image analysis algorithm employed here combines an anisotropic diffusion filter to remove noise from the original gray-scale image data, a k-means cluster analysis to obtain segmented data, and the construction of isosurfaces to estimate solid surface area and interfacial area. Our method was compared with laboratory measurements, as well as estimates obtained from a number of other image analysis algorithms presented in the literature. Porosity estimates for the two-phase bead pack were within 1.5% error of laboratory measurements and agreed well with estimates obtained using an indicator kriging segmentation algorithm. Additionally, our method estimated the solid surface area of the high precision beads within 10% of the laboratory measurements, whereas solid surface area estimates obtained from voxel counting and two-point correlation functions overestimated the surface area by 20-40%. Interfacial area estimates for the air-water menisci contained within the capillary tubes were obtained using our image analysis algorithm, and using other image analysis algorithms, including voxel counting, two-point correlation functions, and the porous media marching cubes. Our image analysis algorithm, and other algorithms based on marching cubes, resulted in errors ranging from 1% to 20% of the analytical interfacial area estimates, whereas voxel counting and two-point correlation functions overestimated the analytical interfacial area by 20-40%. In addition, the sensitivity of the image analysis algorithms on the resolution of the microtomographic image data was investigated, and the results indicated that there was little or no improvement in the comparison with laboratory estimates for the resolutions and conditions tested.", "paper_title": "Image analysis algorithms for estimating porous media multiphase flow variables from computed microtomography data: a validation study", "paper_id": "WOS:000273352600002"}