{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "coevolutionary_and_complexity_theories"}, {"score": 0.004383406949799696, "phrase": "information_systems"}, {"score": 0.004040688646993605, "phrase": "critical_and_chronic_unsolved_problem"}, {"score": 0.003990385737207714, "phrase": "today's_complex_and_turbulent_world"}, {"score": 0.003819187440994939, "phrase": "coevolutionary_and_emergent_nature"}, {"score": 0.0030097975788892896, "phrase": "complexity_theory"}, {"score": 0.0028986672783671147, "phrase": "coevolution-based_self-organized_emergent_behaviour"}, {"score": 0.002688532127821979, "phrase": "emergent_nature"}, {"score": 0.0021857667493036786, "phrase": "scale-free_dynamics"}, {"score": 0.0021049977753042253, "phrase": "adaptive_coevolutionary_dynamics"}], "paper_keywords": ["information systems alignment", " coevolution", " complexity"], "paper_abstract": "The misalignment of information systems (IS) components with the rest of an organization remains a critical and chronic unsolved problem in today's complex and turbulent world. This paper argues that the coevolutionary and emergent nature of alignment has rarely been taken into consideration in IS research and that this is the reason behind why IS alignment is so difficult. A view of IS alignment is presented about organizations that draws and builds on complexity theory and especially its focus on coevolution-based self-organized emergent behaviour and structure, which provides important insights for dealing with the emergent nature of IS alignment. This view considers Business/IS alignment as a series of adjustments at three levels of analysis: individual, operational, and strategic, and suggests several enabling conditions-principles of adaptation and scale-free dynamics aimed at speeding up the adaptive coevolutionary dynamics among the three levels.", "paper_title": "Using coevolutionary and complexity theories to improve IS alignment: a multi-level approach", "paper_id": "WOS:000243393900008"}