{"auto_keywords": [{"score": 0.028786399297065297, "phrase": "model_integration"}, {"score": 0.00481495049065317, "phrase": "model_simulated_weather_parameters"}, {"score": 0.0046046429665581555, "phrase": "weather_forecasting_model"}, {"score": 0.004536592536813498, "phrase": "ncmrwf"}, {"score": 0.004242546312843817, "phrase": "dec_alpha"}, {"score": 0.004012061349250865, "phrase": "upper_and_lower_level_winds"}, {"score": 0.003865376734263166, "phrase": "floating_point_arithmetic"}, {"score": 0.0037101871762082153, "phrase": "meteorological_parameters"}, {"score": 0.0036689507925299885, "phrase": "numerical_models"}, {"score": 0.00353476609156032, "phrase": "difference_field"}, {"score": 0.003418186564522323, "phrase": "longer_time"}, {"score": 0.003102488033561956, "phrase": "format_representation"}, {"score": 0.0030679850425428053, "phrase": "initial_data"}, {"score": 0.0026826140171754675, "phrase": "modified_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["floating-point arithmetic", " round-off-errors", " model simulation", " iterative process", " General Circulation Model (GCM)", " spectral method"], "paper_abstract": "In this study, the weather forecasting model of the National Centre for Medium Range Weather Forecasting (NCMRWF) is used for examining the characteristics of round-off-errors on three different computer architectures - PARAM 10K, SUNFIRE 6800 and Dec Alpha for several meteorological parameters such as precipitation, temperature at the surface and mid-atmosphere, and upper and lower level winds. It is well known that the implementation of floating point arithmetic varies from one computing system to another. As a result, meteorological parameters simulated by numerical models on two different systems may deviate from each other and the difference field becomes larger as the model is integrated for longer time, for example, in the scale of several months. This paper focuses on the reduction of such round-off-errors by a simple method of modifying the format representation of the initial data supplied to the model. In all the three systems, the model has been integrated C 9 for 4 months starting from 4(th) May, 1996. It is found that after 5 days of model integration with the modified data, the round-off-errors become insignificant. The rate of reduction of round-off-errors is fast up to a month of model integration and thereafter the rate slows down and stabilises. It is further noticed that at the end of four months of integration, the reduction in round-off-errors over the tropical region and oceans is much more than over the rest of the globe. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Response of model simulated weather parameters to round-off-errors on different systems", "paper_id": "WOS:000246308900009"}