{"auto_keywords": [{"score": 0.04971414456915432, "phrase": "web_mining"}, {"score": 0.00481495049065317, "phrase": "web_usage_graphs"}, {"score": 0.004669845451682529, "phrase": "vast_degree"}, {"score": 0.004634254474150777, "phrase": "different_techniques"}, {"score": 0.004443276312972159, "phrase": "web_search"}, {"score": 0.004179392391349015, "phrase": "'data-centric'_point"}, {"score": 0.0037546039916845947, "phrase": "particular_time_instance"}, {"score": 0.003531474887552889, "phrase": "web_data"}, {"score": 0.0034118234596993836, "phrase": "ongoing_trends"}, {"score": 0.003308862957060602, "phrase": "temporal_dimension"}, {"score": 0.0032836104153151973, "phrase": "new_kind"}, {"score": 0.0031240868074933078, "phrase": "web_mining_research_community"}, {"score": 0.003088384809415812, "phrase": "large_extent"}, {"score": 0.002938317647182056, "phrase": "evolving_nature"}, {"score": 0.00290473242917264, "phrase": "web_graphs"}, {"score": 0.0025110337774260773, "phrase": "interesting_problems"}, {"score": 0.002370704665003412, "phrase": "future_directions"}, {"score": 0.0021212055097236527, "phrase": "network_intrusion_detection"}, {"score": 0.0021049977753042253, "phrase": "social_networks"}], "paper_keywords": [""], "paper_abstract": "Web mining has been explored to a vast degree and different techniques have been proposed for a variety of applications that include Web Search, Web Classification, Web Personalization etc. Most research on Web mining has been from a 'data-centric' point of view. The focus has been primarily on developing measures and applications based on data collected from content, structure and usage of Web until a particular time instance. In this project we examine another dimension of Web Mining, namely temporal dimension. Web data has been evolving over time, reflecting the ongoing trends. These changes in data in the temporal dimension reveal new kind of information. This information has not captured the attention of the Web mining research community to a large extent. In this paper, we highlight the significance of studying the evolving nature of the Web graphs. We have classified the approach to such problems at three levels of analysis: single node, sub-graphs and whole graphs. We provide a framework to approach problems in this kind of analysis and identify interesting problems at each level. Our experiments verify the significance of such an analysis and also point to future directions in this area. The approach we take is generic and can be applied to other domains, where data can be modeled as a graph, such as network intrusion detection or social networks.", "paper_title": "Mining temporally changing Web usage graphs", "paper_id": "WOS:000243032800001"}