{"auto_keywords": [{"score": 0.004539005582217309, "phrase": "considerable_evidence"}, {"score": 0.004406994912939125, "phrase": "strategic_goals"}, {"score": 0.004171891198117439, "phrase": "strong_case"}, {"score": 0.004050514095922329, "phrase": "integrated_approach"}, {"score": 0.003949280009382125, "phrase": "organization's_strengths"}, {"score": 0.0038996120252338556, "phrase": "careful_attention"}, {"score": 0.003599182629885611, "phrase": "e-business_strategy"}, {"score": 0.0034944094552943, "phrase": "strategy_content"}, {"score": 0.0033926758710459866, "phrase": "unique_bundles"}, {"score": 0.003266201217790818, "phrase": "strategy_process"}, {"score": 0.0032115093493071366, "phrase": "human_influence"}, {"score": 0.0031845067058084613, "phrase": "e-business_implementation"}, {"score": 0.0029764767329116875, "phrase": "underlying_drivers"}, {"score": 0.002951444412262927, "phrase": "e-_business_performance"}, {"score": 0.0029020077365708966, "phrase": "latent_class_modeling_techniques"}, {"score": 0.002723862897844177, "phrase": "unobservable_heterogeneity"}, {"score": 0.0024302416436559867, "phrase": "single_model"}, {"score": 0.0023003498123420237, "phrase": "managerial_beliefs"}, {"score": 0.002131857309586904, "phrase": "far_less_homogeneity"}, {"score": 0.0021049977753042253, "phrase": "individual_firm_level"}], "paper_keywords": ["e-business strategy", " information technology", " performance", " latent class models"], "paper_abstract": "Among many leading organizations, in all sectors of industry, commerce and government, there is considerable evidence of e-business being deployed to achieve strategic goals. Where this deployment has been most successful, there is a strong case that the organization has taken an integrated approach that both builds on the organization's strengths and pays careful attention to the process of change within the organization. However, in the literature most empirical work has either studied e-business strategy and performance from the perspective of strategy content - which highlights positioning and/ or unique bundles of resources - or from the perspective of strategy process - which captures human influence and e-business implementation. In this study, we integrate these two perspectives to develop a more holistic understanding of the underlying drivers of e- business performance. Further, latent class modeling techniques are used to show that the variables in our study are heavily influenced by the unobservable heterogeneity across firms. Four distinct types of firms populate our data, and the relationship between performance and its underlying determinants varies greatly between them. The implication is that a single model cannot explain the relationship between environment, structure, feasibility, managerial beliefs and performance. This is critical to our understanding of e- business as it implies that there is far less homogeneity at the individual firm level than is normally assumed in the literature.", "paper_title": "e-Business strategy and firm performance: a latent class assessment of the drivers and impediments to success", "paper_id": "WOS:000246727200001"}