{"auto_keywords": [{"score": 0.03291444850131275, "phrase": "infrastructure_capabilities"}, {"score": 0.004458722048888919, "phrase": "research_model"}, {"score": 0.003922378980031565, "phrase": "it-dependent_organizational_agility"}, {"score": 0.003750260412839128, "phrase": "it-dependent_system"}, {"score": 0.003631945391344252, "phrase": "strategic_agility"}, {"score": 0.0035399770257915466, "phrase": "cross-sectional_data"}, {"score": 0.0033845816848753073, "phrase": "hypothesized_relationships"}, {"score": 0.0032777653153451265, "phrase": "technical_and_behavioral_capabilities"}, {"score": 0.0031540120386134058, "phrase": "positive_effect"}, {"score": 0.002864628676257225, "phrase": "it-_dependent_strategic_agility"}, {"score": 0.002703869368554536, "phrase": "it-_dependent_system"}, {"score": 0.0026693851900137953, "phrase": "information_agility"}, {"score": 0.0024556852466581527, "phrase": "hypothesized_research_model"}], "paper_keywords": ["IT personnel capabilities", " IT infrastructure capabilities", " IT-dependent organizational agility", " IT-dependent strategic agility"], "paper_abstract": "This study develops a research model of how the technical, behavioral, and business capabilities of IT personnel are associated with IT infrastructure capabilities, and how the latter are associated with IT-dependent organizational agility, which is conceptualized as comprising IT-dependent system, information, and strategic agility. Analysis of cross-sectional data collected from 293 IT managers generally corroborates the hypothesized relationships, showing that the technical and behavioral capabilities of IT personnel have a positive effect on infrastructure capabilities. The analysis also provides evidence that the effect of infrastructure capabilities on IT- dependent strategic agility is direct, as well as mediated by IT- dependent system and information agility. The validity of the findings is strengthened by demonstrating that the hypothesized research model fits the data better than two alternative theoretically-anchored models describing different relationships between the same constructs. This study advances understanding of the interrelationships between two major subsets of IT capabilities, and their relationships with the agility afforded by IT.", "paper_title": "Gaining agility through IT personnel capabilities: The mediating role of IT infrastructure capabilities", "paper_id": "WOS:000251611100002"}