{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "complex_product_development"}, {"score": 0.00475070135279933, "phrase": "designing_complex_products"}, {"score": 0.004624751696958501, "phrase": "jet_engines"}, {"score": 0.004125513927068713, "phrase": "design_process"}, {"score": 0.003195236629209403, "phrase": "statistical_analyses"}, {"score": 0.003152531962718477, "phrase": "empirical_data"}, {"score": 0.002755567647101251, "phrase": "five_empirical_studies"}, {"score": 0.0023762535034673017, "phrase": "inter-departmental_interfaces"}, {"score": 0.0021049977753042253, "phrase": "product_development_form"}], "paper_keywords": ["communication", " concurrent engineering", " research and development management", " product development organizations", " case studies in industry", " collaboration", " maturity grid"], "paper_abstract": "Designing complex products, such as jet engines, cars or certain types of software, necessitates the coordination of activities of many participants during the design process. Communication is seen as the vehicle by which this coordination could be achieved. Communication itself is influenced by many different factors that are connected. This study presents an exploration of correlations between these factors based on statistical analyses of empirical data. The research uses data collected via the 'Communication Grid Method', ( CGM) a structured maturity grid method to assess the perception of communication within and across team-interfaces. Five empirical studies in the aerospace, automotive, and IT industries where concurrent engineering is practiced are used. The results offer insights for researching and managing communication across inter-departmental interfaces. It has been shown in particular, how directly and indirectly linked factors influencing communication in product development form a network of correlations. Mutual trust and collaboration exhibit thematic centrality.", "paper_title": "Exploration of correlations between factors influencing communication in complex product development", "paper_id": "WOS:000254129400004"}