{"auto_keywords": [{"score": 0.0047310525657970615, "phrase": "semisupervised_learning"}, {"score": 0.004567596860086148, "phrase": "labeled_examples"}, {"score": 0.0045355866228818514, "phrase": "supervised_learning"}, {"score": 0.004487989502479992, "phrase": "two-view_cotraining"}, {"score": 0.004272361887713488, "phrase": "previous_studies"}, {"score": 0.004067051881100314, "phrase": "independence_assumptions"}, {"score": 0.0036931126619856747, "phrase": "small_labeled_training_sets"}, {"score": 0.0033868916699805224, "phrase": "standard_two-view_cotraining"}, {"score": 0.0032697235411641695, "phrase": "novel_approach"}, {"score": 0.0027034263575471352, "phrase": "labeled_training"}, {"score": 0.0025106241866273897, "phrase": "view_splitting"}, {"score": 0.0024581013157048926, "phrase": "cotraining's_effectiveness"}, {"score": 0.0022036996784968793, "phrase": "single_view"}, {"score": 0.0021049977753042253, "phrase": "standard_cotraining"}], "paper_keywords": ["Semisupervised learning", " cotraining", " sufficiency assumption", " independence assumption", " view splitting", " single-view"], "paper_abstract": "Cotraining, a paradigm of semisupervised learning, is promised to alleviate effectively the shortage of labeled examples in supervised learning. The standard two-view cotraining requires the data set to be described by two views of features, and previous studies have shown that cotraining works well if the two views satisfy the sufficiency and independence assumptions. In practice, however, these two assumptions are often not known or ensured (even when the two views are given). More commonly, most supervised data sets are described by one set of attributes (one view). Thus, they need be split into two views in order to apply the standard two-view cotraining. In this paper, we first propose a novel approach to empirically verify the two assumptions of cotraining given two views. Then, we design several methods to split single view data sets into two views, in order to make cotraining work reliably well. Our empirical results show that, given a whole or a large labeled training set, our view verification and splitting methods are quite effective. Unfortunately, cotraining is called for precisely when the labeled training set is small. However, given small labeled training sets, we show that the two cotraining assumptions are difficult to verify, and view splitting is unreliable. Our conclusions for cotraining's effectiveness are mixed. If two views are given, and known to satisfy the two assumptions, cotraining works well. Otherwise, based on small labeled training sets, verifying the assumptions or splitting single view into two views are unreliable; thus, it is uncertain whether the standard cotraining would work or not.", "paper_title": "When Does Cotraining Work in Real Data?", "paper_id": "WOS:000288752400011"}