{"auto_keywords": [{"score": 0.049488021144002546, "phrase": "image_classification"}, {"score": 0.00481495049065317, "phrase": "social_media"}, {"score": 0.004581505405526037, "phrase": "sheer_amount"}, {"score": 0.0045249263666466005, "phrase": "user-contributed_photos"}, {"score": 0.00402094658848301, "phrase": "image_expansion_framework"}, {"score": 0.0038737214010638745, "phrase": "auxiliary_image_collection"}, {"score": 0.003617616153730564, "phrase": "semantic_graph"}, {"score": 0.003336614511719501, "phrase": "scalability_issues"}, {"score": 0.0030582832134483685, "phrase": "expanded_images"}, {"score": 0.002803104254950008, "phrase": "classification_accuracy"}, {"score": 0.0025691622090542304, "phrase": "expanded_training_images"}, {"score": 0.002340081450249521, "phrase": "state-of-the-art_training_image"}, {"score": 0.0021851622264433953, "phrase": "flickr"}, {"score": 0.0021446993452098597, "phrase": "additional_training_images"}], "paper_keywords": ["Object recognition", " Image classification", " Web image search", " Crowdsourcing", " Semantic query expansion"], "paper_abstract": "Witnessing the sheer amount of user-contributed photos and videos, we argue to leverage such freely available image collections as the training images for image classification. We propose an image expansion framework to mine more semantically related training images from the auxiliary image collection provided with very few training examples. The expansion is based on a semantic graph considering both visual and (noisy) textual similarities in the auxiliary image collections, where we also consider scalability issues (e.g., MapReduce) as constructing the graph. We found the expanded images not only reduce the time-consuming (manual) annotation efforts but also further improve the classification accuracy since more visually diverse training images are included. Experimenting in certain benchmarks, we show that the expanded training images improve image classification significantly. Furthermore, we achieve more than 27% relative improvement in accuracy compared to the state-of-the-art training image crowdsourcing approaches by exploiting media sharing services (such as Flickr) for additional training images. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Learning by expansion: Exploiting social media for image classification with few training examples", "paper_id": "WOS:000307152800015"}