{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "heterogeneous_peer-to-peer_networks"}, {"score": 0.004496542293425754, "phrase": "simple_protocol"}, {"score": 0.004025885154716127, "phrase": "basic_idea"}, {"score": 0.003962779958955344, "phrase": "joining_process"}, {"score": 0.0038597866217852353, "phrase": "random_walk"}, {"score": 0.003799275066001196, "phrase": "new_incoming_peers"}, {"score": 0.0035106041824568618, "phrase": "rebuilding_process"}, {"score": 0.0028886123801902517, "phrase": "detailed_analysis"}, {"score": 0.002711506442590442, "phrase": "topology_structure"}, {"score": 0.0025994945418484935, "phrase": "node_heterogeneity"}, {"score": 0.0025586903829811296, "phrase": "analytical_results"}, {"score": 0.002326938965568362, "phrase": "different_respects"}, {"score": 0.0022904032758108775, "phrase": "heterogeneous_environment"}, {"score": 0.0022544399432457164, "phrase": "ultimate_goal"}, {"score": 0.0021273284545701896, "phrase": "fundamental_issues"}], "paper_keywords": ["capacity", " heterogeneity", " random walk", " topology", " unstructured P2P network"], "paper_abstract": "In this paper, we propose a simple protocol for building heterogeneous unstructured peer-to-peer (P2P) networks. The protocol consists of two parts-the joining process and the rebuilding process. The basic idea for the joining process is to use a random walk to assist new incoming peers in selecting their suitable neighbors in terms of capacity and connectivity to achieve load-balancing. The rebuilding process specifies bow the nodes should react when they lose links. In particular, we examine two representative schemes, namely the probabilistic-rebuilding scheme and the adaptive-rebuilding scheme. Furthermore, we provide a detailed analysis to investigate our proposed protocol under any heterogenous P2P environment. We prove that the topology structure of the P2P network depends heavily on the node heterogeneity. The analytical results are validated by the simulations. Our framework provides a guideline to engineer and optimize a P2P network in different respects under a heterogeneous environment. The ultimate goal of this paper is to stimulate further research to explore the fundamental issues in heterogeneous P2P networks.", "paper_title": "Building heterogeneous peer-to-peer networks: Protocol and analysis", "paper_id": "WOS:000254869100003"}