{"auto_keywords": [{"score": 0.04966008989090485, "phrase": "china"}, {"score": 0.00819553607743385, "phrase": "most-frequently_cited_publications"}, {"score": 0.00431388720289049, "phrase": "world_publications"}, {"score": 0.003968112038249246, "phrase": "different_databases"}, {"score": 0.003916098498242888, "phrase": "analytical_variant"}, {"score": 0.003747575730190958, "phrase": "thomson_reuters"}, {"score": 0.003586278948128509, "phrase": "world_publication_system"}, {"score": 0.0032697235411641695, "phrase": "global_level"}, {"score": 0.002753891109273246, "phrase": "elite_status"}, {"score": 0.002646880721119838, "phrase": "top-cited_papers"}, {"score": 0.0024776677004255104, "phrase": "clear_divide"}, {"score": 0.0024236964502593254, "phrase": "western_europe"}, {"score": 0.0023501014144112443, "phrase": "network_analysis"}, {"score": 0.002248816575548875, "phrase": "internationally_co-authored_publications"}, {"score": 0.0021613897794439227, "phrase": "single_european_nation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["World share", " Citation analysis", " Excellence Europe", " USA", " China"], "paper_abstract": "The percentages of shares of world publications of the European Union and its member states, China, and the United States have been represented differently as a result of using different databases. An analytical variant of the Web-of-Science (of Thomson Reuters) enables us to study the dynamics in the world publication system in terms of the field-normalized top-1% and top-10% most-frequently cited publications. Comparing the EU28, USA, and China at the global level shows a top-level dynamic that is different from the analysis in terms of shares of publications: the United States remains far more productive in the top-1% of all papers; China drops out of the competition for elite status; and the EU28 increased its share among the top-cited papers from 2000 to 2010. Some of the EU28 member states overtook the United States during this decade; but a clear divide remains between EU15 (Western Europe) and the Accession Countries. Network analysis shows that China was embedded in this top-layer of internationally co-authored publications. These publications often involve more than a single European nation. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "The European Union, China, and the United States in the top-1% and top-10% layers of most-frequently cited publications: Competition and collaborations", "paper_id": "WOS:000341376700014"}