{"auto_keywords": [{"score": 0.04741138420449486, "phrase": "environmental_sustainability"}, {"score": 0.004104838067758352, "phrase": "balanced_scorecard"}, {"score": 0.003736004578001584, "phrase": "leading_performance_indicators"}, {"score": 0.00357146811369898, "phrase": "customer_value_propositions"}, {"score": 0.0034422330919613294, "phrase": "performance_indicators"}, {"score": 0.003386301445203071, "phrase": "financial_results"}, {"score": 0.003210704011271791, "phrase": "environmentally_sustainable_it_performance"}, {"score": 0.0030944828434567966, "phrase": "nomological_network"}, {"score": 0.0029460197288680864, "phrase": "innovation_antecedents"}, {"score": 0.002459902948098627, "phrase": "seven_step_rigorous_process"}, {"score": 0.0024099937116733227, "phrase": "new_ground"}, {"score": 0.002380534385718454, "phrase": "research_and_practice_perspectives"}], "paper_keywords": ["Green IT", " Green IS", " IT for Green", " Sustainability", " Performance", " Eco-Learning", " Eco-Brand", " Eco-Process", " Eco-Value"], "paper_abstract": "IT firms vary in their performance to improve the environmental sustainability of their own operations and in their ability to provide products and solutions that enable and transform the environmental sustainability of other industries. In the parlance of the balanced scorecard, performance has two dimensions, that is, \"drivers\" and \"outcomes\". The drivers, also known as leading performance indicators, refer to learning and innovation, processes, and customer value propositions. The outcomes, also known as lagging performance indicators, refer to financial results. This study has developed and validated an instrument to measure the environmentally sustainable IT performance (eSITP) drivers. We established the nomological network of the eSITP by drawing from several theoretical domains in the areas of innovation antecedents and values, balanced performance measurement and IT and eco-sustainability. Based on a survey of 133 IT firms, we developed and validated a four-dimension, 17 items eSITP instrument covering eco-learning, eco-process, eco-brand and eco-value governance. The instrument is validated by following a seven step rigorous process. The paper breaks new ground from both research and practice perspectives. The instrument makes it easier for other researchers who wish to explain the leading (drivers) and lagging (outcomes) of IT firms' environmental sustainability and for IT business managers who want to improve their environmental sustainability performance.", "paper_title": "Identifying IT sustainability performance drivers: Instrument development and validation", "paper_id": "WOS:000326620600002"}