{"auto_keywords": [{"score": 0.04226255901245674, "phrase": "lstsvm"}, {"score": 0.008930421185478972, "phrase": "mwsvm"}, {"score": 0.007687646605732089, "phrase": "twsvm"}, {"score": 0.006393607276108116, "phrase": "worse_classification_performance"}, {"score": 0.00481495049065317, "phrase": "twin_support_vector_machine_classification"}, {"score": 0.004790306679000464, "phrase": "maximum_one-class"}, {"score": 0.004717125879761534, "phrase": "twin_support_vector_machine"}, {"score": 0.004633153497593343, "phrase": "effective_classification_tool"}, {"score": 0.004390060342250211, "phrase": "higher_computational_costs"}, {"score": 0.004085579055228594, "phrase": "linear_equations"}, {"score": 0.003696219600832839, "phrase": "geometric_interpretation"}, {"score": 0.0036678472439508484, "phrase": "generalized_proximal_svm"}, {"score": 0.003584025547693836, "phrase": "different_distributions"}, {"score": 0.0034308688638878286, "phrase": "local_geometry"}, {"score": 0.003192700856094016, "phrase": "new_classifier"}, {"score": 0.003119703729649559, "phrase": "class_variance"}, {"score": 0.0030249559524951255, "phrase": "aforementioned_deficiencies"}, {"score": 0.002978663434241994, "phrase": "lstsvm."}, {"score": 0.002963390095037466, "phrase": "new_method"}, {"score": 0.002814886483566627, "phrase": "genuine_geometric_interpretation"}, {"score": 0.0028004506694140944, "phrase": "gepsvm"}, {"score": 0.00259256413077435, "phrase": "localized_version"}, {"score": 0.00247529638625566, "phrase": "lmwsvm"}, {"score": 0.0024373950372964573, "phrase": "nearby_points"}, {"score": 0.0023451553255837317, "phrase": "mwsvm_classifier"}, {"score": 0.0023211517663846346, "phrase": "smaller_size"}, {"score": 0.002309242063033298, "phrase": "training_samples"}, {"score": 0.0022448201926600925, "phrase": "storage_space"}, {"score": 0.0021990971392741613, "phrase": "nonlinear_cases"}, {"score": 0.0021487685525986094, "phrase": "real-world_problems"}, {"score": 0.0021049977753042253, "phrase": "lmwsvm."}], "paper_keywords": ["non-parallel plane classifiers", " within-class variance", " local geometry", " outliers"], "paper_abstract": "A twin support vector machine (TWSVM), as an effective classification tool, tries to find two non-parallel planes that can be produced by solving two quadratic programming problems (QPPs). The QPPs lead to higher computational costs. The least squares twin SVM (LSTSVM), as a variant of TWSVM, attempts to avoid the above deficiency and obtain two non-parallel planes directly by solving two sets of linear equations. Both TWSVM and LSTSVM operate directly on patterns using two optimizations with constraints and, respectively, use such constraints to estimate the distance between each plane for its own class and patterns of other classes. However, such approaches weaken the geometric interpretation of the generalized proximal SVM (GEPSVM) so that in many Exclusive Or examples for different distributions, they may obtain the worse classification performance. Moreover, in addition to failing to discover the local geometry inside the samples, they are sensitive to outliers. In this paper, inspired by several geometrically motivated learning algorithms and the advantages of LSTSVM, we first propose a new classifier, called LSTSVM classification via maximum one-class within-class variance (MWSVM), which is specially designed for avoiding the aforementioned deficiencies and keeping the advantages of LSTSVM. The new method directly incorporates the one-class within-class variance to the classifier, such that it is expected that the genuine geometric interpretation of GEPSVM can be kept in LSTSVM. Undoubtedly, like LSTSVM, MWSVM may lead to a worse classification performance in many cases, especially when the outliers are present. Therefore, a localized version (LMWSVM) of MWSVM is further proposed to remove the outliers effectively. Another advantage of LMWSVM is that it takes the nearby points which are closest to each other as a training set, such that the MWSVM classifier is determined by smaller size of training samples than that of LSTSVM. Naturally, it can reduce the storage space of LSTSVM, especially when extended to nonlinear cases. Experiments carried out on both toy and real-world problems disclose the effectiveness of both MWSVM and LMWSVM.", "paper_title": "Least squares twin support vector machine classification via maximum one-class within class variance", "paper_id": "WOS:000302315500004"}