{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dynamic_refraction_stereo"}, {"score": 0.003997891221012094, "phrase": "general_case"}, {"score": 0.0038959121068990517, "phrase": "refractive_index"}, {"score": 0.0037965243835456214, "phrase": "key_requirements"}, {"score": 0.0030554300179552415, "phrase": "time-varying_surface"}, {"score": 0.0026297428083782875, "phrase": "refractive_scenes"}, {"score": 0.0025625729433234623, "phrase": "optimization-based_algorithm"}, {"score": 0.0023467391904246834, "phrase": "input_views"}, {"score": 0.0021714122348552747, "phrase": "detailed_reconstructions"}, {"score": 0.002126907587540404, "phrase": "dynamic_behavior"}, {"score": 0.0021049977753042253, "phrase": "free-flowing_liquids"}], "paper_keywords": ["Stereo", " time-varying imagery", " shape-from-X", " transparency", " refractive index estimation"], "paper_abstract": "In this paper we consider the problem of reconstructing the 3D position and surface normal of points on an unknown, arbitrarily-shaped refractive surface. We show that two viewpoints are sufficient to solve this problem in the general case, even if the refractive index is unknown. The key requirements are 1) knowledge of a function that maps each point on the two image planes to a known 3D point that refracts to it, and 2) light is refracted only once. We apply this result to the problem of reconstructing the time-varying surface of a liquid from patterns placed below it. To do this, we introduce a novel \"stereo matching\" criterion called refractive disparity, appropriate for refractive scenes, and develop an optimization-based algorithm for individually reconstructing the position and normal of each point projecting to a pixel in the input views. Results on reconstructing a variety of complex, deforming liquid surfaces suggest that our technique can yield detailed reconstructions that capture the dynamic behavior of free-flowing liquids.", "paper_title": "Dynamic Refraction Stereo", "paper_id": "WOS:000291807200003"}