{"auto_keywords": [{"score": 0.044510087499644524, "phrase": "nursing_education"}, {"score": 0.010855697491074847, "phrase": "instructional_technologists"}, {"score": 0.00481495049065317, "phrase": "anatomy_and_vital_signs"}, {"score": 0.00450052670755585, "phrase": "new_technology"}, {"score": 0.004377077848734575, "phrase": "increasing_number"}, {"score": 0.004342430078306461, "phrase": "college_students"}, {"score": 0.003947358102140903, "phrase": "educational_technology"}, {"score": 0.0036311617742547167, "phrase": "first_stage_evaluation"}, {"score": 0.0034619440946558186, "phrase": "second_validation"}, {"score": 0.003353521531649663, "phrase": "methodological_study"}, {"score": 0.0032355864829403413, "phrase": "nursing_specialists"}, {"score": 0.003109390330476147, "phrase": "unguided_manner"}, {"score": 0.002419798694301991, "phrase": "agreement_level"}, {"score": 0.002270449532546444, "phrase": "suitable_product"}, {"score": 0.0021992603252793995, "phrase": "reliable_educational_tool"}, {"score": 0.0021559025985688255, "phrase": "technological_resources"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Nursing", " Nursing education", " Nursing students", " Educational technology", " Vital signs"], "paper_abstract": "Background: The use of new technology has recently grown considerably as an increasing number of college students using Internet. In nursing education, the personal computer and the Internet facilitate teaching theoretical and practical knowledge. Objectives: Evaluate an educational technology known as Anatomy and Vital Signs with respect to content, appearance and usability. Method: This was a first stage evaluation by specialists to verify content and functioning, prior to a second validation as to learning by students. A methodological study in which instructional technologists (11 participants) and nursing specialists (17 participants) used the technology in an unguided manner and completed three questionnaires. The evaluation was measured by the difference between disagreement and agreement for each statement in the questionnaires. Results: Most of the items were positively evaluated at a level higher than 70% by most of the evaluators except for the following usability criteria: grouping by shape, minimum actions and user control, which did not attain the 70% agreement level among instructional technologists. Conclusion: The evaluation was useful to improve the technology and guarantee suitable product for nursing education. It may be a reliable educational tool for nursing education that applies technological resources. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Educational technology \"Anatomy and Vital Signs\": Evaluation study of content, appearance and usability", "paper_id": "WOS:000362411900012"}