{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "unstructured_grids"}, {"score": 0.0047370749839861165, "phrase": "efficient_and_robust_particle-localization_algorithm"}, {"score": 0.0045108906244892165, "phrase": "particle_position"}, {"score": 0.004135010810625326, "phrase": "nearby_position"}, {"score": 0.003589602322126282, "phrase": "previously_published_particle-localization_algorithms"}, {"score": 0.003254610516477302, "phrase": "arbitrary_polyhedral_cells"}, {"score": 0.0030821633718368206, "phrase": "small_particle_displacements"}, {"score": 0.002646267286675984, "phrase": "modified_version"}, {"score": 0.0026033756286033285, "phrase": "present_algorithm"}, {"score": 0.0024653491388223546, "phrase": "appropriate_corrective_action"}, {"score": 0.0023730978395564116, "phrase": "computational_cost"}, {"score": 0.002210814150677161, "phrase": "fall-back_algorithms"}, {"score": 0.00217496508306238, "phrase": "exhaustive_or_octree_search"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["particle-localization", " particle tracking", " Eulerian-Lagrangian simulations", " unstructured grids"], "paper_abstract": "An efficient and robust particle-localization algorithm for unstructured grids is presented. Given a particle position and the cell containing that position, the algorithm determines the cell which contains a nearby position. The algorithm is based on tracking a particle along its trajectory by computing the intersections of the trajectory and the cell faces. Compared to previously published particle-localization algorithms, the new algorithm has several advantages. First, it can be applied to grids consisting of arbitrary polyhedral cells. Second, the algorithm is not limited to small particle displacements. Third, the interaction of particles with boundaries is dealt with correctly and naturally. Fourth, the algorithm is more efficient than other published algorithms. A modified version of the present algorithm is also presented which can detect inconsistencies and take appropriate corrective action. With these modifications, the computational cost becomes comparable to other published algorithms which cannot detect inconsistencies without resorting to fall-back algorithms such as exhaustive or Octree search. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "An efficient and robust particle-localization algorithm for unstructured grids", "paper_id": "WOS:000255304500049"}