{"auto_keywords": [{"score": 0.0045709675813472884, "phrase": "simulation_systems"}, {"score": 0.004215677131963292, "phrase": "acoustic_or_radio-wave_propagation_simulations"}, {"score": 0.004001938457469328, "phrase": "volumetric_representation"}, {"score": 0.0038210283935447473, "phrase": "incidence_relationships"}, {"score": 0.0032309093154028663, "phrase": "formal_representation"}, {"score": 0.0031937337757356526, "phrase": "consistency_constraints"}, {"score": 0.003031650815900696, "phrase": "topological_model"}, {"score": 0.0025929837295811673, "phrase": "automatic_and_semi-automatic_operations"}, {"score": 0.0023228223366301226, "phrase": "generalized_maps"}, {"score": 0.0021049977753042253, "phrase": "lighting_and_radio-wave_propagation_simulations"}], "paper_keywords": ["3D modeling", " Architecture", " Indoor building", " Reconstruction", " Topological model", " G-maps"], "paper_abstract": "Virtual architectural (indoor) scenes are often modeled in 3D for various types of simulation systems. For instance, some authors propose methods dedicated to lighting, heat transfer, acoustic or radio-wave propagation simulations. These methods rely in most cases on a volumetric representation of the environment, with adjacency and incidence relationships. Unfortunately, many buildings data are only given by 2D plans and the 3D needs varies from one application to another. To face these problems, we propose a formal representation of consistency constraints dedicated to building interiors and associated with a topological model. We show that such a representation can be used for: (i) reconstructing 3D models from 2D architectural plans (ii) detecting automatically geometrical, topological and semantical inconsistencies (iii) designing automatic and semi-automatic operations to correct and enrich a 2D plan. All our constraints are homogeneously defined in 2D and 3D, implemented with generalized maps and used in modeling operations. We explain how this model can be successfully used for lighting and radio-wave propagation Simulations. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Consistency constraints and 3D building reconstruction", "paper_id": "WOS:000264204200002"}