{"auto_keywords": [{"score": 0.04867447329166622, "phrase": "authorial_voice"}, {"score": 0.025952515341326154, "phrase": "information_systems"}, {"score": 0.0046390482426405324, "phrase": "purpose_-_this_study"}, {"score": 0.004027031316965272, "phrase": "information_system"}, {"score": 0.0039088121438737924, "phrase": "conceptual_framework"}, {"score": 0.003696390664266446, "phrase": "existing_organizational_schemes"}, {"score": 0.003601235776892337, "phrase": "textual_analysis"}, {"score": 0.003293142761521425, "phrase": "persuasive_element"}, {"score": 0.003160854709666311, "phrase": "literary_critic"}, {"score": 0.003149094460617212, "phrase": "kenneth_burke"}, {"score": 0.0027026971435126553, "phrase": "potential_manifestations"}, {"score": 0.002276566401216226, "phrase": "enhanced_conceptual_grasp"}], "paper_keywords": ["Knowledge organization", " Classification", " Rhetoric", " Authorial voice", " Humanities", " Information systems", " Knowledge management"], "paper_abstract": "Purpose - This study aims to examine how systems for organizing information may present an authorial voice and shows how the mechanism of voice may work to persuasively communicate a point of view on the materials being collected and described by the information system. Design/methodology/approach - The paper synthesizes a conceptual framework from the field of rhetoric and composition and uses that framework to analyze how existing organizational schemes reveal authorial voice. Findings - Through textual analysis, the mechanism of authorial voice is described in three example information systems. In two of the examples, authorial voice is shown to function as a persuasive element by enabling identification, the rhetorical construct defined by the literary critic Kenneth Burke. In one example, voice appears inconsistently and does not work to facilitate persuasion. Research limitations/implications - This study illustrates the concept of authorial voice in the context of information systems, but it does not claim to comprehensively catalog all potential manifestations of authorial voice. Practical implications - By analyzing how information systems work as a form of document, we can better understand how information systems communicate to their users, and we can use this understanding to facilitate design. Originality/value - By creating designs that incorporate an enhanced conceptual grasp of authorial voice and other rhetorical properties of information systems, the construction of information systems that systematically and purposefully communicate original, creative points of view regarding their assembled collections can be facilitated, and so enable learning, discovery, and critical engagement for users.", "paper_title": "How information systems communicate as documents: the concept of authorial voice", "paper_id": "WOS:000297966800007"}