{"auto_keywords": [{"score": 0.047138221913192536, "phrase": "c-h_center_dot_center_dot_center_dot_pi_interactions"}, {"score": 0.00481495049065317, "phrase": "dot_pi_interactions"}, {"score": 0.004657185361669812, "phrase": "residue_propensities"}, {"score": 0.004549821572786755, "phrase": "protein_stability"}, {"score": 0.004356926418550194, "phrase": "different_molecular_systems"}, {"score": 0.004327981760540394, "phrase": "organic_crystals"}, {"score": 0.004270665568018583, "phrase": "nucleic_acids"}, {"score": 0.004242291530697285, "phrase": "high-resolution_protein_structures"}, {"score": 0.004158290806404304, "phrase": "present_study"}, {"score": 0.0033035520810722886, "phrase": "c-h_groups"}, {"score": 0.0031845067058084583, "phrase": "amino_acid"}, {"score": 0.0031422859551159506, "phrase": "c-h_center_dot_center_dot_center"}, {"score": 0.0028907624732186373, "phrase": "c-h_center"}, {"score": 0.002881130228859848, "phrase": "dot_center_dot_center_dot_pi_interactions"}, {"score": 0.0028052155436760528, "phrase": "inter-secondary_structural_element_c-h_center_dot_center_dot_center_dot_pi_interactions"}, {"score": 0.00260657976055413, "phrase": "primary_structure"}, {"score": 0.0025892330566358503, "phrase": "donor_and_acceptor_residues"}, {"score": 0.002529421374791293, "phrase": "secondary_structure_type"}, {"score": 0.0022730758011263318, "phrase": "substantial_number"}, {"score": 0.0021404485085209143, "phrase": "active_site_geometry"}, {"score": 0.0021191072118924067, "phrase": "significant_differences"}, {"score": 0.0021049977753042253, "phrase": "ch_center_dot_center_dot_center_dot_pi_interactions"}], "paper_keywords": ["C-H center dot center dot center dot pi interaction", " Secondary structure elements", " Stability", " PDB data mining", " Solvent accessible surface area (SASA)", " Adjacency"], "paper_abstract": "C-H center dot center dot center dot pi interactions are a class of non-covalent interactions found in different molecular systems including organic crystals, proteins and nucleic acids. High-resolution protein structures have been analyzed in the present study to delineate various aspects of C-H center dot center dot center dot pi interactions. Additionally, to determine the extent to which redundancy of a database biases the outcome, two datasets differing from each other in the level of redundancy have been analyzed. On average, only one out of six {with C-H(Aro) group} or eight {with C-H(Ali) group} residues in a protein participate as C-H group donors. Neither the frequency of occurrence in proteins nor the number of C-H groups present in it is correlated to the propensity of an amino acid to participate in C-H center dot center dot center dot pi interactions. Most of the residues that participate in C-H center dot center dot center dot pi interactions are solvent-shielded. Solvent shielded nature of most of the C-H center dot center dot center dot pi interactions and prevalence of intra- as well as inter-secondary structural element C-H center dot center dot center dot pi interactions suggest that the contribution of these interactions to the enthalpy of folded form will be significant. The separation in the primary structure between donor and acceptor residues is found to be correlated to secondary structure type. Other insights obtained from this study include the presence of networks of C-H center dot center dot center dot pi interactions spanning multiple secondary structural elements. To our knowledge this has not been reported so far. A substantial number of residues involved in C-H center dot center dot center dot pi interactions are found in catalytic and ligand binding sites suggesting their possible role in maintaining active site geometry. No significant differences of CH center dot center dot center dot pi interactions in the two datasets are found for any of the parameters/features analyzed.", "paper_title": "C-H center dot center dot center dot pi interactions in proteins: prevalence, pattern of occurrence, residue propensities, location, and contribution to protein stability", "paper_id": "WOS:000332179000026"}