{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "textual_features"}, {"score": 0.023038767375115343, "phrase": "social_media"}, {"score": 0.004638354165775803, "phrase": "significant_fraction"}, {"score": 0.004505471345843642, "phrase": "web_users"}, {"score": 0.004412881870378388, "phrase": "potential_lack"}, {"score": 0.0042157995925335544, "phrase": "information_retrieval_services"}, {"score": 0.0039120325834029355, "phrase": "multimedia_objects"}, {"score": 0.003615016816532732, "phrase": "relative_quality"}, {"score": 0.0034392078383711296, "phrase": "title"}, {"score": 0.0034106792071835037, "phrase": "tags"}, {"score": 0.0032178009629568, "phrase": "youtube"}, {"score": 0.003191144966047207, "phrase": "yahoo"}, {"score": 0.0030231983220281836, "phrase": "extensive_characterization"}, {"score": 0.002581165831422692, "phrase": "object_classification"}, {"score": 0.002559775585192185, "phrase": "tag_recommendation_experiments"}, {"score": 0.0025385621498128243, "phrase": "case_studies"}, {"score": 0.0023261372216194383, "phrase": "recommendation_effectiveness"}, {"score": 0.002231310272815607, "phrase": "valuable_insights"}, {"score": 0.002212812864395738, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Web 2.0", " Textual features", " Information quality", " Social media"], "paper_abstract": "Social media is increasingly becoming a significant fraction of the content retrieved daily by Web users. However, the potential lack of quality of user generated content poses a challenge to information retrieval services, which rely mostly on textual features generated by users (particularly tags) commonly associated with the multimedia objects. This paper presents what, to the best of our knowledge, is currently the most comprehensive study of the relative quality of textual features in social media. We analyze four different features, namely, TITLE, TAGS, DESCRIPTION and COMMENTS posted by users, in four popular applications, namely, YouTube, Yahoo! Video, LastFM and CiteULike. Our study is based on an extensive characterization of data crawled from the four applications with respect to usage, amount and semantics of content, descriptive and discriminative power as well as content and information diversity across features. It also includes a series of object classification and tag recommendation experiments as case studies of two important information retrieval tasks, aiming at analyzing how these tasks are affected by the quality of the textual features. Classification and recommendation effectiveness is analyzed in light of our characterization results. Our findings provide valuable insights for future research and design of Web 2.0 applications and services. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Assessing the quality of textual features in social media", "paper_id": "WOS:000313466600016"}