{"auto_keywords": [{"score": 0.03363896917055259, "phrase": "conceptgen"}, {"score": 0.00481495049065317, "phrase": "biological_concepts"}, {"score": 0.004722613498487908, "phrase": "differentially_expressed_genes"}, {"score": 0.004602233424629559, "phrase": "integral_part"}, {"score": 0.004398872331144531, "phrase": "genomic_data"}, {"score": 0.0043144799365586375, "phrase": "additional_importance"}, {"score": 0.004044645056447888, "phrase": "previously_defined_biological_concepts"}, {"score": 0.003992729692096799, "phrase": "diverse_information_sources"}, {"score": 0.003791621842185417, "phrase": "multiple_perspectives"}, {"score": 0.003623949225126944, "phrase": "unified_framework"}, {"score": 0.002639968630788011, "phrase": "biological_knowledge"}, {"score": 0.0022312377180023282, "phrase": "gene_expression_data"}, {"score": 0.002202547013259953, "phrase": "tgf-beta-induced_epithelial-mesenchymal_transition"}, {"score": 0.0021049977753042253, "phrase": "localized_prostate_cancers"}], "paper_keywords": [""], "paper_abstract": "Motivation: The elucidation of biological concepts enriched with differentially expressed genes has become an integral part of the analysis and interpretation of genomic data. Of additional importance is the ability to explore networks of relationships among previously defined biological concepts from diverse information sources, and to explore results visually from multiple perspectives. Accomplishing these tasks requires a unified framework for agglomeration of data from various genomic resources, novel visualizations, and user functionality. Results: We have developed ConceptGen, a web-based gene set enrichment and gene set relation mapping tool that is streamlined and simple to use. ConceptGen offers over 20 000 concepts comprising 14 different types of biological knowledge, including data not currently available in any other gene set enrichment or gene set relation mapping tool. We demonstrate the functionalities of ConceptGen using gene expression data modeling TGF-beta-induced epithelial-mesenchymal transition and metabolomics data comparing metastatic versus localized prostate cancers.", "paper_title": "ConceptGen: a gene set enrichment and gene set relation mapping tool", "paper_id": "WOS:000274484300002"}