{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "identity_delegation_problem"}, {"score": 0.0047472380621488616, "phrase": "e-government_environment"}, {"score": 0.00438105507792004, "phrase": "telematic_environment"}, {"score": 0.0043194180167921165, "phrase": "legal_representative"}, {"score": 0.0037486121194392564, "phrase": "non-dynamic_offline_processes"}, {"score": 0.0036610702290043387, "phrase": "quick_and_easy_identity_delegation"}, {"score": 0.003525220627709056, "phrase": "dynamic_delegation"}, {"score": 0.0033465923623290034, "phrase": "delegated_access"}, {"score": 0.003299460925313939, "phrase": "telematic_services"}, {"score": 0.0032529910932231924, "phrase": "public_authorities"}, {"score": 0.0030017207229983385, "phrase": "proxy_certificate"}, {"score": 0.0029454679553901613, "phrase": "delegating_entity"}, {"score": 0.0025316905609748135, "phrase": "delegated_entity"}, {"score": 0.0024960069794216977, "phrase": "validity_period"}, {"score": 0.0022385926290967263, "phrase": "delegation_token"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Digital identity", " Identity delegation", " Proxy certificate", " X.509", " SAML"], "paper_abstract": "At present, many countries allow citizens or entities to interact with the government outside the telematic environment through a legal representative who is granted powers of representation. However, if the interaction takes place through the Internet, only primitive mechanisms of representation are available, and these are mainly based on non-dynamic offline processes that do not enable quick and easy identity delegation. This paper proposes a system of dynamic delegation of identity between two generic entities that can solve the problem of delegated access to the telematic services provided by public authorities. The solution herein is based on the generation of a delegation token created from a proxy certificate that allows the delegating entity to delegate identity to another on the basis of a subset of its attributes as delegator, while also establishing in the delegation token itself restrictions on the services accessible to the delegated entity and the validity period of delegation. Further, the paper presents the mechanisms needed to either revoke a delegation token or to check whether a delegation token has been revoked. Implications for theory and practice and suggestions for future research are discussed.", "paper_title": "Solving identity delegation problem in the e-government environment", "paper_id": "WOS:000300107300003"}