{"auto_keywords": [{"score": 0.04952525101149599, "phrase": "island_model"}, {"score": 0.00481495049065317, "phrase": "migrant_choice_policies"}, {"score": 0.004704187604192605, "phrase": "natural_mate-selection_behavior"}, {"score": 0.004269329235934791, "phrase": "resulting_offspring"}, {"score": 0.0037125240439927114, "phrase": "different_migration_policies"}, {"score": 0.00326594229173048, "phrase": "target_population"}, {"score": 0.0031660031870090434, "phrase": "proxy_string"}, {"score": 0.003069112841132911, "phrase": "emitting_population"}, {"score": 0.002861782260525497, "phrase": "different_sizes"}, {"score": 0.0026892447164623247, "phrase": "multikulti_policies"}, {"score": 0.002658068304632523, "phrase": "usual_policy"}, {"score": 0.0025867180355950816, "phrase": "random_individual"}, {"score": 0.0021049977753042253, "phrase": "population_diversity"}], "paper_keywords": ["Distributed memory systems", " diversity", " genetic algorithms", " island model", " parallel algorithms"], "paper_abstract": "The natural mate-selection behavior of preferring individuals which are somewhat (but not too much) different has been proved to increase the resistance to infection of the resulting offspring, and thus fitness. Inspired by these results we have investigated the improvement obtained from diversity induced by differences between individuals sent and received and the resident population in an island model, by comparing different migration policies, including our proposed multikulti methods, which choose the individuals that are going to be sent to other nodes based on the principle of multiculturality; the individual sent should be different enough to the target population, which will be represented through a proxy string (computed in several possible ways) in the emitting population. We have checked a set of policies following these principles on two discrete optimization problems of diverse difficulty for different sizes and number of nodes, and found that, in average or in median, multikulti policies outperform the usual policy of sending the best or a random individual; however, the size of this advantage changes with the number of nodes involved and the difficulty of the problem, tending to be greater as the number of nodes increases. The success of this kind of policies will be explained via the measurement of entropy as a representation of population diversity for the policies tested.", "paper_title": "Diversity Through Multiculturality: Assessing Migrant Choice Policies in an Island Model", "paper_id": "WOS:000293740700003"}