{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "harmful_information"}, {"score": 0.004651057147690674, "phrase": "physiological_and_mental_health"}, {"score": 0.004150661689086371, "phrase": "specific_categories"}, {"score": 0.0038727120021750973, "phrase": "information_content_security"}, {"score": 0.0037222908218253054, "phrase": "reasonable_yet_challenging_alternative"}, {"score": 0.003577691211998842, "phrase": "urgent_need"}, {"score": 0.003507504253087326, "phrase": "systematic_model"}, {"score": 0.0030988889679192965, "phrase": "access_control"}, {"score": 0.0025289662786567896, "phrase": "control_model"}, {"score": 0.002454835845644037, "phrase": "existing_access_control"}, {"score": 0.002418587525752333, "phrase": "reference_monitor"}, {"score": 0.002301572462091142, "phrase": "transmission_channel"}, {"score": 0.002234092591045251, "phrase": "evaluation_frame"}, {"score": 0.0021049977753042253, "phrase": "controlling_information_transmission"}], "paper_keywords": ["content security", " access control", " quantitative evaluation"], "paper_abstract": "Flooding of harmful information on the Internet seriously endangers the physiological and mental health of teenagers. Due to the user-friendliness of the Internet as well as the difficulty in the authentication for the access of specific categories of information, curbing the transmission of harmful information, i.e., assuring the information content security (ICS), has become a reasonable yet challenging alternative. At present, there is an urgent need to develop a systematic model that can effectively carry out the curbing. In fact, curbing the transmission of harmful information by way of filtering can be modeled by access control. In the paper, based on the three core-elements of communication, namely, \"Who communicates with whom\", \"How do they communicate\" and \"What is the content of communication\", we propose a control model, called ICCON. Unlike the existing access control, the reference monitor (RM) of our model is placed in the transmission channel, and moreover, an evaluation frame is proposed, through which the effectiveness of the RM in controlling information transmission on the Internet can be quantitatively evaluated.", "paper_title": "Information content security on the Internet: the control model and its evaluation", "paper_id": "WOS:000276490700003"}