{"auto_keywords": [{"score": 0.04235931111254082, "phrase": "generalized_test"}, {"score": 0.011780133877391132, "phrase": "clear_decision"}, {"score": 0.011555278414338075, "phrase": "quantized_data"}, {"score": 0.01078631445555156, "phrase": "clear_conclusion"}, {"score": 0.00481495049065317, "phrase": "wilcoxon_rank-sum_test"}, {"score": 0.004670325028652672, "phrase": "wilcoxon's_two-sample_rank-sum_test"}, {"score": 0.0044800522651664695, "phrase": "minimum_and_maximum_values"}, {"score": 0.00434544213389516, "phrase": "feasible_samples"}, {"score": 0.004250080379144324, "phrase": "initial_set-valued_information"}, {"score": 0.003976319418067584, "phrase": "obtained_interval-valued_p-value"}, {"score": 0.0038998328617557013, "phrase": "significance_level"}, {"score": 0.0034707339811048403, "phrase": "quantized_information"}, {"score": 0.003441949264109265, "phrase": "joint_sample"}, {"score": 0.0034039393854836965, "phrase": "high_proportion"}, {"score": 0.0032470094613727433, "phrase": "usual_convention"}, {"score": 0.002962674479070391, "phrase": "wrong_conclusions"}, {"score": 0.002881517485354484, "phrase": "possible_rank_permutations"}, {"score": 0.002763919794139171, "phrase": "single_value"}, {"score": 0.0026807346783271095, "phrase": "wilcoxon's_rank-sum_statistic"}, {"score": 0.0026000466400112974, "phrase": "different_p-value"}, {"score": 0.0024663408903032695, "phrase": "interval-valued_p-value"}, {"score": 0.0024390784088340715, "phrase": "chosen_significance_level"}, {"score": 0.0022502133699402018, "phrase": "wrong_decisions"}, {"score": 0.0022007302738063566, "phrase": "second_one"}, {"score": 0.002140400526572388, "phrase": "interval_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Statistical hypothesis test", " Interval-valued imprecise data", " Bipolar decision"], "paper_abstract": "Here we propose an adaption of Wilcoxon's two-sample rank-sum test to interval data. This adaption is interval-valued: it computes the minimum and maximum values of the statistic when we rank the set of all feasible samples (all joint samples compatible with the initial set-valued information). We prove that these bounds can be explicitly computed using a very low computational cost algorithm. Interpreting this generalized test is straightforward: if the obtained interval-valued p-value is on one side of the significance level, we will be able to make a decision (reject/no reject). Otherwise, we will conclude that our information is too vague to lead to a clear decision. Our method is also applicable to quantized data: in the presence of quantized information, the joint sample may contain a high proportion of draws, which can prevent the test from drawing a clear conclusion. According to the usual convention, when there are ties, the ranks for the observations in a tie are taken to be the average of the ranks for those observations. This convention can lead to wrong conclusions. Here, we consider the family of all possible rank permutations, such that a sample containing ties will not just be associated with a single value, but rather with a collection of values for the Wilcoxon's rank-sum statistic, with each one of them being associated with a different p-value. When the impact of quantization is too high to lead to a clear decision, our test provides an interval-valued p-value that includes the chosen significance level. It indicates that there is no clear conclusion according to this test. Two different experiments exemplify the properties of the generalized test: the first one illustrates its ability to avoid wrong decisions in the presence of quantized data. The second one shows the performance of the generalized test when used with interval data. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Generalizing the Wilcoxon rank-sum test for interval data", "paper_id": "WOS:000347593900007"}