{"auto_keywords": [{"score": 0.048609175050806475, "phrase": "strong_product"}, {"score": 0.02322730111336098, "phrase": "cartesian_skeleton"}, {"score": 0.016484236206557857, "phrase": "directed_graphs"}, {"score": 0.009374279909410794, "phrase": "undirected_graphs"}, {"score": 0.008409010276321184, "phrase": "prime_factors"}, {"score": 0.004477179965105461, "phrase": "cartesian"}, {"score": 0.004119762981892093, "phrase": "unique_prime_factor_decomposition"}, {"score": 0.0039519004610213595, "phrase": "time_algorithms"}, {"score": 0.0036743708250589484, "phrase": "standard_products"}, {"score": 0.0030625949549620475, "phrase": "algorithmic_aspects"}, {"score": 0.0027169974137406148, "phrase": "so-called_cartesian_skeleton"}, {"score": 0.002299921909935613, "phrase": "first_polynomial-time_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Directed graph", " Strong product", " Prime factor decomposition algorithms", " Dispensable", " Cartesian skeleton"], "paper_abstract": "The three standard products (the Cartesian, the direct and the strong product) of undirected graphs have been repeatedly studied, unique prime factor decomposition (PFD) is known and polynomial time algorithms have been established for determining the prime factors. For directed graphs, unique PFD results with respect to the standard products are known. However, there is, until now, no known algorithm to compute the PFD of directed graphs with respect to the direct and the strong product in general. In this contribution, we focus on the algorithmic aspects for determining the PFD of directed graphs with respect to the strong product. Essential for computing the prime factors is the construction of a so-called Cartesian skeleton. This article introduces the notion of the Cartesian skeleton of directed graphs as a generalization of the Cartesian skeleton of undirected graphs. We provide new, fast and transparent algorithms for its construction. It leads to the first polynomial-time algorithm for determining the PFD of arbitrary, finite connected digraphs with respect to the strong product. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On the Cartesian skeleton and the factorization of the strong product of digraphs", "paper_id": "WOS:000348951600002"}