{"auto_keywords": [{"score": 0.034610758922047784, "phrase": "k-max-dense_ass"}, {"score": 0.03184366154103541, "phrase": "internet_connections"}, {"score": 0.00481495049065317, "phrase": "as-level_topology_graph"}, {"score": 0.004499647408293102, "phrase": "efficient_algorithm"}, {"score": 0.004439097815805505, "phrase": "k-dense_communities"}, {"score": 0.004074016501033133, "phrase": "small_number"}, {"score": 0.003965061486705487, "phrase": "high_level"}, {"score": 0.0034311578789991363, "phrase": "internet_exchange_points"}, {"score": 0.0033242742850902295, "phrase": "worldwide_geographical_scope"}, {"score": 0.0031773149810690494, "phrase": "primary_role"}, {"score": 0.003134503353065008, "phrase": "internet_connectivity"}, {"score": 0.003036832649117453, "phrase": "huge_number"}, {"score": 0.0027867539356701302, "phrase": "content_delivery_networks"}, {"score": 0.0023253967212081626, "phrase": "high_percentage"}, {"score": 0.0022224972632835416, "phrase": "national_ass"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Internet AS-level topology", " Community detection", " k-Dense", " IXP"], "paper_abstract": "In this paper we investigate the structure of the Internet by exploiting an efficient algorithm for extracting k-dense communities from the Internet AS-level topology graph. The analyses showed that the most well-connected communities consist of a small number of ASs characterized by a high level of clusterization, although they tend to direct a lot of their connections to ASs outside the community. In addition these communities are mainly composed of ASs that participate at the Internet Exchange Points (IXPs) and have a worldwide geographical scope. Regarding k-max-dense ASs we found that they play a primary role in the Internet connectivity since they are involved in a huge number of Internet connections (42% of Internet connections). We also investigated the properties of three classes of k-max-dense ASs: Content Delivery Networks, Internet Backbone Providers and Tier-Is. Specifically, we showed that CDNs and IBPs heavily exploit IXPs by participating in many of them and connecting to many IXP participant ASs. On the other hand, we found that a high percentage of connections originated by Tier-1 ASs are likely to involve national ASs which do not participate at IXPs. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "k-Dense communities in the Internet AS-level topology graph", "paper_id": "WOS:000315371600016"}