{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "google"}, {"score": 0.0411915152339329, "phrase": "common_space"}, {"score": 0.004575977644865379, "phrase": "nowadays_digital_libraries"}, {"score": 0.004383016741930174, "phrase": "collaborative_applications"}, {"score": 0.004036852178449883, "phrase": "new_concept"}, {"score": 0.003424107910734022, "phrase": "fuzzy_linguistic_recommender_system"}, {"score": 0.0033708244679086265, "phrase": "google_wave_capabilities"}, {"score": 0.003241203549050267, "phrase": "common_research_lines"}, {"score": 0.002792375587031108, "phrase": "automatic_way"}, {"score": 0.0025614418906438744, "phrase": "fuzzy_linguistic_labels"}, {"score": 0.0024920359789965783, "phrase": "possible_collaborations"}, {"score": 0.002472552537325606, "phrase": "multi-disciplinar_researchers"}, {"score": 0.0024436119167523156, "phrase": "complementary_resources"}, {"score": 0.002312960805824996, "phrase": "proposed_system"}, {"score": 0.0021551702945512494, "phrase": "successful_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Recommender system", " University Digital Library", " Google wave", " 2-Tuple fuzzy linguistic modeling"], "paper_abstract": "Nowadays Digital Libraries 2.0 are mainly based on the interaction between users through collaborative applications such as wikis, blogs, etc. or new possible paradigms like the waves proposed by Google. This new concept, the wave, represents a common space where resources and users can work together. The problem arises when the number of resources and users is high, then tools for assisting the users in their information needs are necessary. In this case a fuzzy linguistic recommender system based on the Google Wave capabilities is proposed as tool for communicating researchers interested in common research lines. The system allows the creation of a common space by means a wave as a way of collaborating and exchanging ideas between several researchers interested in the same topic. In addition, the system suggests, in an automatic way, several researchers and useful resources for each wave. These recommendations are computed following several previously defined preferences and characteristics by means of fuzzy linguistic labels. Thus the system facilitates the possible collaborations between multi-disciplinar researchers and recommends complementary resources useful for the interaction. In order to test the effectiveness of the proposed system, a prototype of the system has been developed and tested with several research groups from the same university achieving successful results. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A google wave-based fuzzy recommender system to disseminate information in University Digital Libraries 2.0", "paper_id": "WOS:000288774700001"}