{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_variations."}, {"score": 0.004285289574869884, "phrase": "learning_algorithms"}, {"score": 0.004151188559520802, "phrase": "highly_varying_functions"}, {"score": 0.003978866233891427, "phrase": "artificial_intelligence"}, {"score": 0.0038748022659578865, "phrase": "theoretical_limitations"}, {"score": 0.0038339398365449507, "phrase": "decision_trees"}, {"score": 0.0029565620771207003, "phrase": "decision_tree"}, {"score": 0.002863921785266393, "phrase": "input_space"}, {"score": 0.0026307897899760383, "phrase": "sensible_prediction"}, {"score": 0.002548331088496964, "phrase": "better_understanding"}, {"score": 0.002508073621696602, "phrase": "fundamental_reasons"}, {"score": 0.002219790619936024, "phrase": "distributed_representation"}, {"score": 0.0021049977753042253, "phrase": "training_data"}], "paper_keywords": ["decision trees", " curse of dimensionality", " parity function"], "paper_abstract": "The family of decision tree learning algorithms is among the most widespread and studied. Motivated by the desire to develop learning algorithms that can generalize when learning highly varying functions such as those presumably needed to achieve artificial intelligence, we study some theoretical limitations of decision trees. We demonstrate formally that they can be seriously hurt by the curse of dimensionality in a sense that is a bit different from other nonparametric statistical methods, but most importantly, that they cannot generalize to variations not seen in the training set. This is because a decision tree creates a partition of the input space and needs at least one example in each of the regions associated with a leaf to make a sensible prediction in that region. A better understanding of the fundamental reasons for this limitation suggests that one should use forests or even deeper architectures instead of trees, which provide a form of distributed representation and can generalize to variations not encountered in the training data.", "paper_title": "DECISION TREES DO NOT GENERALIZE TO NEW VARIATIONS", "paper_id": "WOS:000283948100004"}