{"auto_keywords": [{"score": 0.04312119725754665, "phrase": "zero_solution"}, {"score": 0.00481495049065317, "phrase": "discrete-time_single-directional_network"}, {"score": 0.004482400730101345, "phrase": "simple_discrete-time_single-directional_network"}, {"score": 0.00419997182602686, "phrase": "linearized_system"}, {"score": 0.004039094712469991, "phrase": "polynomial_equation"}, {"score": 0.003834099867584972, "phrase": "sufficient_and_necessary_conditions"}, {"score": 0.0028412769256691, "phrase": "normal_form_theory"}, {"score": 0.0027862576750944277, "phrase": "center_manifold_theorem"}, {"score": 0.0026274936167233515, "phrase": "bifurcated_solutions"}, {"score": 0.0022177498761722773, "phrase": "smooth_normal_forms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["delay", " bifurcation", " neural network", " stability"], "paper_abstract": "In this paper, we consider a simple discrete-time single-directional network of four neurons. The characteristics equation of the linearized system at the zero solution is a polynomial equation involving very high-order terms. We first derive some sufficient and necessary conditions ensuring that all the characteristic roots have modulus less than 1. Hence, the zero solution of the model is asymptotically stable. Then, we study the existence of three types of bifurcations, such as fold bifurcations, flip bifurcations, and Neimark-Sacker (NS) bifurcations. Based on the normal form theory and the center manifold theorem, we discuss their bifurcation directions and the stability of bifurcated solutions. In addition, several codimension two bifurcations can be met in the system when curves of codimension one bifurcations intersect or meet tangentially. We proceed through listing smooth normal forms for all the possible codimension 2 bifurcations. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Bifurcation analysis in a discrete-time single-directional network with delays", "paper_id": "WOS:000255239200028"}