{"auto_keywords": [{"score": 0.04969278858326932, "phrase": "cnc_technology"}, {"score": 0.040284659829607126, "phrase": "cax_chain"}, {"score": 0.00481495049065317, "phrase": "global_manufacturing"}, {"score": 0.004494570360108983, "phrase": "production_capacity"}, {"score": 0.004281284532043714, "phrase": "ill_computing_systems"}, {"score": 0.0034676182423067307, "phrase": "plug-and-produce_manner"}, {"score": 0.003356923403930231, "phrase": "step_standard"}, {"score": 0.003171615440419782, "phrase": "well-known_vehicle"}, {"score": 0.003070340620983981, "phrase": "information_availability"}, {"score": 0.00303319936111073, "phrase": "cnc_machine"}, {"score": 0.002831037222426215, "phrase": "cnc_manufacturing"}, {"score": 0.0027741761880779535, "phrase": "current_standards"}, {"score": 0.0026530590435527527, "phrase": "interoperable_cnc_manufacturing"}, {"score": 0.002516905625121064, "phrase": "nc"}, {"score": 0.0024761702541879213, "phrase": "major_part"}, {"score": 0.002165688807780663, "phrase": "major_issues"}, {"score": 0.002148172508419683, "phrase": "future_developments"}, {"score": 0.0021049977753042253, "phrase": "future_key_requirements"}], "paper_keywords": ["CNC", " Interoperability", " Global manufacturing", " STEP-NC"], "paper_abstract": "In the domain of manufacturing, computer numerically controllers (CNC) technology is a major contributor to the production capacity of the enterprises. The advances in CNC technology coupled with enhancements ill computing systems have provided the basis to re-examine the way in which computer-aided systems (CAx) call be used to enable global manufacturing. Interoperability of the various components of the CAx chain is therefore a major prerequisite for manufacturing enterprises for becoming strategically agile and consequently globally competitive. Being interoperable, resources call be utilized interchangeably in a plug-and-produce manner. Over the last 8 years the eminence of a STEP standard for machining entitled STEP-NC (numerical control) has become a well-known vehicle for research to improve the level of information availability at the CNC machine too]. Ill this paper, the authors introduce the background to the evolution of CNC manufacturing over the last 50 years and the Current standards available for programming. A review of the literature in interoperable CNC Manufacturing is then provided relating to Milling, turn-mill and other NC processes. The major part of the paper provides a strategic view of]low interoperability call be implemented across the CAx chain with a range of standards used to regulate the flow of information. Finally, the paper Outlines the advantages and major issues for future developments in interoperability, identifying future key requirements and limiting factors. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Strategic advantages of interoperability for global manufacturing using CNC technology", "paper_id": "WOS:000260203300002"}