{"auto_keywords": [{"score": 0.048399372488115065, "phrase": "scientific_applications"}, {"score": 0.04746411390795377, "phrase": "aneka"}, {"score": 0.015021841673126379, "phrase": "hybrid_clouds"}, {"score": 0.004814988748892749, "phrase": "deadline"}, {"score": 0.004460309246062286, "phrase": "large_computing_power"}, {"score": 0.004152818376630929, "phrase": "single_institution"}, {"score": 0.003946195919158241, "phrase": "extra_resources"}, {"score": 0.003088384809415812, "phrase": "cloud_application_platform"}, {"score": 0.002889928791032578, "phrase": "private_and_public_clouds"}, {"score": 0.0026630475331025955, "phrase": "aneka's_deadline-driven_provisioning_mechanism"}, {"score": 0.0021928902836049384, "phrase": "different_sources"}, {"score": 0.0021375377706211686, "phrase": "application_execution_times"}], "paper_keywords": ["Resource provisioning", " Hybrid cloud", " QoS", " E-Science", " Aneka"], "paper_abstract": "Scientific applications require large computing power, traditionally exceeding the amount that is available within the premises of a single institution. Therefore, clouds can be used to provide extra resources whenever required. For this vision to be achieved, however, requires both policies defining when and how cloud resources are allocated to applications and a platform implementing not only these policies but also the whole software stack supporting management of applications and resources. Aneka is a cloud application platform capable of provisioning resources obtained from a variety of sources, including private and public clouds, clusters, grids, and desktops grids. In this paper, we present Aneka's deadline-driven provisioning mechanism, which is responsible for supporting quality of service (QoS)-aware execution of scientific applications in hybrid clouds composed of resources obtained from a variety of sources. Experimental results evaluating such a mechanism show that Aneka is able to efficiently allocate resources from different sources in order to reduce application execution times. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Deadline-driven provisioning of resources for scientific applications in hybrid clouds with Aneka", "paper_id": "WOS:000295947900007"}