{"auto_keywords": [{"score": 0.04519616011604948, "phrase": "grid"}, {"score": 0.022983826999469607, "phrase": "opportunistic_grids"}, {"score": 0.009317004034865997, "phrase": "opportunistic_grid"}, {"score": 0.00481495049065317, "phrase": "simple_prioritisation_mechanism"}, {"score": 0.004789839974879249, "phrase": "effectively_interoperate_service"}, {"score": 0.004581595485016029, "phrase": "service_grids"}, {"score": 0.004533921350392657, "phrase": "dedicated_resources"}, {"score": 0.004451676867747938, "phrase": "computing_power"}, {"score": 0.004428452434981208, "phrase": "non-dedicated_resources"}, {"score": 0.0043028576671457035, "phrase": "high_and_well_defined_levels"}, {"score": 0.0037752226222318407, "phrase": "so-called_embarrassingly_parallel_applications"}, {"score": 0.003610929883213109, "phrase": "largest_portion"}, {"score": 0.00358268558646118, "phrase": "typical_workload"}, {"score": 0.003554661425339528, "phrase": "production_grid_systems"}, {"score": 0.003382178337090809, "phrase": "scientific_institutions"}, {"score": 0.0033469428631415807, "phrase": "latin_america"}, {"score": 0.003303412571939192, "phrase": "complementary_characteristics"}, {"score": 0.0029905104479072482, "phrase": "different_prioritisation_policies"}, {"score": 0.002786315148863582, "phrase": "suitable_prioritisation_policy"}, {"score": 0.0026719345119849388, "phrase": "important_negative_impact"}, {"score": 0.0025824576209656676, "phrase": "simple_reciprocation_mechanism"}, {"score": 0.002412371116984224, "phrase": "noticeable_reduction"}, {"score": 0.002206700502606511, "phrase": "prioritisation_mechanism"}, {"score": 0.002183684303511462, "phrase": "effective_interoperation"}, {"score": 0.0021665794900241056, "phrase": "service_grid"}, {"score": 0.0021439808596071474, "phrase": "glite_middleware"}, {"score": 0.0021049977753042253, "phrase": "ourgrid_middleware"}], "paper_keywords": ["Grid computing", " Service Grids", " Opportunistic Grids", " Prioritisation", " EELA-2"], "paper_abstract": "Grids currently in production can be broadly classified as either service Grids, composed of dedicated resources, or opportunistic Grids that harvest the computing power of non-dedicated resources when they are idle. While a service Grid provides high and well defined levels of quality of service, an opportunistic Grid provides only a best-effort service. Nevertheless, since opportunistic Grids do not require resources to be fully dedicated to the Grid, they have the potential to assemble a much larger number of resources. Moreover, these Grids cater very well to the execution of the so-called embarrassingly parallel applications, a type of application that is frequently found in practice, and that comprises the largest portion of the typical workload processed in production Grid systems. The EELA-2 e-infrastructure is comprised of a service Grid and an opportunistic Grid that federates computing resources from scientific institutions in both Europe and Latin America. Due to the complementary characteristics of these two types of Grids, a lot of attention has recently been placed in how to interoperate them. In this paper we focus on the less studied problem of assessing the feasibility of such interoperation. We analyse different prioritisation policies that define when the resources of one Grid can be used to run jobs originating from the other. Our results show that in the absence of a suitable prioritisation policy, the benefits that the users of one Grid may have, frequently come with an important negative impact on the users of the other Grid. We also show that a simple reciprocation mechanism is capable of arbitrating the interoperation in such a way that, whenever possible, users profit from the interoperation and, in no case, this benefit leads to a noticeable reduction on the quality of service that the users would experience were the Grids not to interoperate. We conclude discussing how we have implemented, in the context of the EELA-2 project, this prioritisation mechanism, allowing the effective interoperation of a service Grid based on the gLite middleware with an opportunistic Grid that uses the OurGrid middleware.", "paper_title": "Using a Simple Prioritisation Mechanism to Effectively Interoperate Service and Opportunistic Grids in the EELA-2 e-Infrastructure", "paper_id": "WOS:000290177900008"}