{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "social_media_to"}, {"score": 0.004353831792593701, "phrase": "enterprise_social_networking_technologies"}, {"score": 0.0042455945330942746, "phrase": "people's_metaknowledge"}, {"score": 0.0038549394272661356, "phrase": "quasi-natural_field_experiment"}, {"score": 0.003727628340195049, "phrase": "large_financial_services"}, {"score": 0.003619672388007568, "phrase": "enterprise_social_networking_technology"}, {"score": 0.0035148319209810128, "phrase": "people's_communications"}, {"score": 0.003485437176235259, "phrase": "specific_partners"}, {"score": 0.0027548146060608902, "phrase": "social_networking_technology"}, {"score": 0.0022420373745572837, "phrase": "\"ambient_awareness\"-awareness"}, {"score": 0.0022232633360792222, "phrase": "ambient_communications"}, {"score": 0.002122775261369663, "phrase": "important_antecedent"}, {"score": 0.0021049977753042253, "phrase": "knowledge_acquisition"}], "paper_keywords": ["Social networking sites", " knowledge sharing", " organizational learning", " accuracy", " technology use", " communication", " collaboration", " transparency"], "paper_abstract": "The argument proffered in this paper is that use of enterprise social networking technologies can increase the accuracy of people's metaknowledge (knowledge of \"who knows what\" and \"who knows whom\") at work. The results of a quasi-natural field experiment in which only one of two matched-sample groups within a large financial services firm was given access to the enterprise social networking technology for six months revealed that by making people's communications with specific partners visible to others in the organization, the technology enabled observers to become aware of the communications occurring amongst their coworkers and to make inferences about what and whom those coworkers knew based on the contents of the messages they sent and to whom they were sent. Consequently only individuals in the group that used the social networking technology for six months improved the accuracy of their metaknowledge (a 31% improvement in knowledge of who knows what and an 88% improvement in knowledge of who knows whom). There were no improvements in the other group over the same time period. Based on these findings, how technologically enabled \"ambient awareness\"-awareness of ambient communications occurring amongst others in the organization-can be an important antecedent for knowledge acquisition is discussed.", "paper_title": "AMBIENT AWARENESS AND KNOWLEDGE ACQUISITION: USING SOCIAL MEDIA TO LEARN \"WHO KNOWS WHAT\" AND \"WHO KNOWS WHOM\"", "paper_id": "WOS:000368424000002"}