{"auto_keywords": [{"score": 0.0430924877003789, "phrase": "computer-based_workarounds"}, {"score": 0.013206104138018766, "phrase": "ehr_systems"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record_use"}, {"score": 0.004741845603430361, "phrase": "background_healthcare_professionals"}, {"score": 0.004634254474150777, "phrase": "electronic_health_record"}, {"score": 0.004375789703278455, "phrase": "user-centered_design"}, {"score": 0.004309323675697185, "phrase": "work_context"}, {"score": 0.004276468590041119, "phrase": "available_health_information_technology"}, {"score": 0.003961330917648707, "phrase": "qualitative_data"}, {"score": 0.0038125469099459905, "phrase": "data_collection_methods"}, {"score": 0.0037834649508375544, "phrase": "direct_observation"}, {"score": 0.0037546039916845947, "phrase": "opportunistic_questions"}, {"score": 0.0035045293923775256, "phrase": "previously_developed_workaround_categories"}, {"score": 0.0034512514926836667, "phrase": "potential_new_categories"}, {"score": 0.003246091321090681, "phrase": "results_findings"}, {"score": 0.0031481164109237636, "phrase": "previous_research"}, {"score": 0.0030414140732789186, "phrase": "paper-based_workarounds"}, {"score": 0.00283870598459543, "phrase": "desired_option"}, {"score": 0.0027741761880779535, "phrase": "computer_interface"}, {"score": 0.002444544487772349, "phrase": "common_challenges"}, {"score": 0.0024258721867522707, "phrase": "outpatient_clinical_settings"}, {"score": 0.0023525950486853937, "phrase": "ehr_design"}, {"score": 0.0021872912745910127, "phrase": "design_process"}, {"score": 0.0021705796895687864, "phrase": "computer_interfaces"}, {"score": 0.002145750895912557, "phrase": "user-centered_methods"}, {"score": 0.0021049977753042253, "phrase": "healthcare_settings"}], "paper_keywords": [""], "paper_abstract": "Background Healthcare professionals develop workarounds rather than using electronic health record (EHR) systems. Understanding the reasons for workarounds is important to facilitate user-centered design and alignment between work context and available health information technology tools. Objective To examine both paper-and computer-based workarounds to the use of EHR systems in three benchmark institutions. Methods Qualitative data were collected in 11 primary care outpatient clinics across three healthcare institutions. Data collection methods included direct observation and opportunistic questions. In total, 120 clinic staff and providers and 118 patients were observed. All data were analyzed using previously developed workaround categories and examined for potential new categories. Additionally, workarounds were coded as either paper-or computer-based. Results Findings corresponded to 10 of 11 workaround categories identified in previous research. All 10 of these categories applied to paper-based workarounds; five categories also applied to computer-based workarounds. One new category, no correct path (eg, a desired option did not exist in the computer interface, precipitating a workaround), was identified for computer-based workarounds. The most consistent reasons for workarounds across the three institutions were efficiency, memory, and awareness. Conclusions Consistent workarounds across institutions suggest common challenges in outpatient clinical settings and failures to accommodate these challenges in EHR design. An examination of workarounds provides insight into how providers adapt to limiting EHR systems. Part of the design process for computer interfaces should include user-centered methods particular to providers and healthcare settings to ensure uptake and usability.", "paper_title": "Paper- and computer-based workarounds to electronic health record use at three benchmark institutions", "paper_id": "WOS:000319192100012"}