{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "arity-monotonic_setting"}, {"score": 0.004180234323211199, "phrase": "e.g._owmax"}, {"score": 0.004046020290832207, "phrase": "famous_hirsch_h-index"}, {"score": 0.0038737214010638745, "phrase": "basic_axiomatic_and_probabilistic_properties"}, {"score": 0.003728966994353039, "phrase": "arity-dependent_setting"}, {"score": 0.003272375502853897, "phrase": "numeric_items"}, {"score": 0.003219368413618912, "phrase": "single_number"}, {"score": 0.003032228032253871, "phrase": "information_resources_producers_assessment_problem"}, {"score": 0.002918826667294298, "phrase": "negative_effects"}, {"score": 0.002887210021573995, "phrase": "information_overload"}, {"score": 0.002779217021776702, "phrase": "hirsch-like_indices"}, {"score": 0.0024253827365474734, "phrase": "probabilistic_analysis"}, {"score": 0.0021987994275190314, "phrase": "aggregated_items'_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Aggregation", " Ordered modularity, maxitivity and minitivity", " Arity-monotonicity", " Impact assessment", " Hirsch's h-index", " Informetrics"], "paper_abstract": "The recently-introduced OM3 aggregation operators fulfill three appealing properties: they are simultaneously minitive, maxitive, and modular. Among the instances of OM3 operators we find e.g. OWMax and OWMin operators, the famous Hirsch h-index and all its natural generalizations. In this paper the basic axiomatic and probabilistic properties of extended, i.e. in an arity-dependent setting, OM3 aggregation operators are studied. We illustrate the difficulties one is inevitably faced with when trying to combine the quality and quantity of numeric items into a single number. The discussion on such aggregation methods is particularly important in the information resources producers assessment problem, which aims to reduce the negative effects of information overload. It turns out that the Hirsch-like indices of impact do not fulfill a set of very important properties, which puts the sensibility of their practical usage into question. Moreover, thanks to the probabilistic analysis of the operators in an i.i.d. model, we may better understand the relationship between the aggregated items' quality and their producers' productivity. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "OM3: Ordered maxitive, minitive, and modular aggregation operators - Axiomatic and probabilistic properties in an arity-monotonic setting", "paper_id": "WOS:000348842500011"}