{"auto_keywords": [{"score": 0.048171695241769216, "phrase": "pareto_front_approximation"}, {"score": 0.030879127828332697, "phrase": "roc_convex_hull"}, {"score": 0.00481495049065317, "phrase": "imbalanced_and_cost-sensitive_datasets"}, {"score": 0.004707479285061122, "phrase": "evolutionary_three-objective_optimization_algorithm"}, {"score": 0.004561019117546361, "phrase": "fuzzy_rule-based_classifiers"}, {"score": 0.004459190343665408, "phrase": "different_trade-offs"}, {"score": 0.003965061486705487, "phrase": "classifier_rules"}, {"score": 0.0038242899532391914, "phrase": "roc_convex_hull_method"}, {"score": 0.003755782496223915, "phrase": "potentially_optimal_classifiers"}, {"score": 0.0036060781902674207, "phrase": "roc_plane"}, {"score": 0.0033544692489307676, "phrase": "frbc_generation"}, {"score": 0.0032061793819537633, "phrase": "wilcoxon_signed-rank_test"}, {"score": 0.0027993885490232677, "phrase": "different_classification_approaches"}, {"score": 0.0026514708899935333, "phrase": "low_value"}, {"score": 0.002522738549524317, "phrase": "misclassification_costs"}, {"score": 0.002488724764295623, "phrase": "class_distributions"}, {"score": 0.002367875199095903, "phrase": "specific_application"}, {"score": 0.0022631003204259224, "phrase": "convex_hull"}], "paper_keywords": ["Genetic fuzzy rule-based classifiers", " Multi-objective evolutionary algorithms", " Imbalanced datasets", " ROC curves", " Convex hull method"], "paper_abstract": "We exploit an evolutionary three-objective optimization algorithm to produce a Pareto front approximation composed of fuzzy rule-based classifiers (FRBCs) with different trade-offs between accuracy (expressed in terms of sensitivity and specificity) and complexity (computed as sum of the conditions in the antecedents of the classifier rules). Then, we use the ROC convex hull method to select the potentially optimal classifiers in the projection of the Pareto front approximation onto the ROC plane. Our method was tested on 13 highly imbalanced datasets and compared with 2 two-objective evolutionary approaches and one heuristic approach to FRBC generation, and with three well-known classifiers. We show by the Wilcoxon signed-rank test that our three-objective optimization approach outperforms all the other techniques, except for one classifier, in terms of the area under the ROC convex hull, an accuracy measure used to globally compare different classification approaches. Further, all the FRBCs in the ROC convex hull are characterized by a low value of complexity. Finally, we discuss how, the misclassification costs and the class distributions are fixed, we can select the most suitable classifier for the specific application. We show that the FRBC selected from the convex hull produced by our three-objective optimization approach achieves the lowest classification cost among the techniques used as comparison in two specific medical applications.", "paper_title": "Multi-objective genetic fuzzy classifiers for imbalanced and cost-sensitive datasets", "paper_id": "WOS:000274404400004"}