{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_stories"}, {"score": 0.04260087512471619, "phrase": "planning_poker"}, {"score": 0.009511743776646056, "phrase": "statistical_combination"}, {"score": 0.004648609688625397, "phrase": "possible_hazards"}, {"score": 0.004616034337089482, "phrase": "group_processes"}, {"score": 0.0045037997020733415, "phrase": "agile_software_development_methods"}, {"score": 0.00440976345264104, "phrase": "group_estimation_technique"}, {"score": 0.004197878397604354, "phrase": "iteration_plans"}, {"score": 0.0040957690050613185, "phrase": "group_discussion"}, {"score": 0.003982098149664708, "phrase": "individual_estimators"}, {"score": 0.0037773674108196376, "phrase": "expert_judgment-based_methods"}, {"score": 0.003698442219929622, "phrase": "widespread_use"}, {"score": 0.003672500644750565, "phrase": "agile_methods"}, {"score": 0.003545487140867762, "phrase": "poker_estimates"}, {"score": 0.0033395304916220086, "phrase": "web-based_student_records_information_system"}, {"score": 0.002994178996584381, "phrase": "team_member"}, {"score": 0.0029627094945653427, "phrase": "first_round"}, {"score": 0.002693919110230191, "phrase": "students'_estimates"}, {"score": 0.0025194861926779223, "phrase": "experts'_estimates"}, {"score": 0.002449454693767392, "phrase": "actual_effort"}, {"score": 0.002290814637620121, "phrase": "optimism_bias"}, {"score": 0.0021499920551456956, "phrase": "group_estimation_process_increases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Agile software development", " Effort estimation", " User story", " Planning poker", " Expert judgment", " Scrum"], "paper_abstract": "While most studies in psychology and forecasting stress the possible hazards of group processes when predicting effort and schedule, agile software development methods recommend the use of a group estimation technique called planning poker for estimating the size of user stories and developing release and iteration plans. It is assumed that the group discussion through planning poker helps in identifying activities that individual estimators could overlook, thus providing more accurate estimates and reducing the over-optimism that is typical for expert judgment-based methods. In spite of the widespread use of agile methods, there is little empirical evidence regarding the accuracy of planning poker estimates. In order to fill this gap a study was conducted requiring 13 student teams to develop a Web-based student records information system. All teams were given the same set of user stories which had to be implemented in three Sprints. Each team estimated the stories using planning poker and the estimates provided by each team member during the first round were averaged to obtain the statistical combination for further comparison. In the same way the stories were estimated by a group of experts. The study revealed that students' estimates were over-optimistic and that planning poker additionally increased the over-optimism. On the other hand, the experts' estimates obtained through planning poker were much closer to actual effort spent and tended to be more accurate than the statistical combination of their individual estimates. The results indicate that the optimism bias caused by group discussion diminishes or even disappears as the expertise of the people involved in the group estimation process increases. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "On using planning poker for estimating user stories", "paper_id": "WOS:000306728500009"}