{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "eccentricity_transform"}, {"score": 0.013629638440756637, "phrase": "geodesic_distances"}, {"score": 0.0046781613377273774, "phrase": "novel_method"}, {"score": 0.0037864980290391354, "phrase": "longest_geodesics"}, {"score": 0.003154012038613403, "phrase": "connected_components"}, {"score": 0.0029343925814926787, "phrase": "highly_compact_descriptor"}, {"score": 0.0028923335491735564, "phrase": "resulting_method"}, {"score": 0.0027965187255008647, "phrase": "experimental_results"}, {"score": 0.0026523079380037706, "phrase": "art_methods"}, {"score": 0.0025155150482635688, "phrase": "geometrical_modification"}, {"score": 0.002443890721386284, "phrase": "corresponding_impact"}, {"score": 0.0022409963215568565, "phrase": "respective_importance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Eccentricity transform", " Shape matching", " Articulation", " Geodesic distance"], "paper_abstract": "This paper presents a novel method for 2D and 3D shape matching that is insensitive to articulation. It uses the eccentricity transform, which is based on the computation of geodesic distances. Geodesic distances computed over a 2D or 3D shape are articulation insensitive. The eccentricity transform considers the length of the longest geodesics. Histograms of the eccentricity transform characterize the compactness of a shape, in a way insensitive to rotation, scaling, and articulation. To characterize the structure of a shape, a histogram of the connected components of the level-sets of the transform is used. These two histograms make up a highly compact descriptor and the resulting method for shape matching is straightforward. Experimental results on established 2D and 3D benchmarks show results similar to more complex state of the art methods, especially when considering articulation. The connection between the geometrical modification of a shape and the corresponding impact on its histogram representation is explained. The influence of the number of bins in the two histograms and the respective importance of each histogram is studied in detail. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Matching 2D and 3D articulated shapes using the eccentricity transform", "paper_id": "WOS:000290831100008"}