{"auto_keywords": [{"score": 0.049509300669177574, "phrase": "opportunistic_mobile_networks"}, {"score": 0.00481495049065317, "phrase": "distributed_information-based_cooperative_strategy"}, {"score": 0.004626553103375699, "phrase": "fundamental_necessity"}, {"score": 0.004375061788023814, "phrase": "store-carry-and-forward_mechanism"}, {"score": 0.004305740330804528, "phrase": "sporadic_inter-node_wireless_connectivity"}, {"score": 0.003927848423072668, "phrase": "central_authority"}, {"score": 0.003850173884725567, "phrase": "recipient_nodes"}, {"score": 0.0036262124965265015, "phrase": "research_lacuna"}, {"score": 0.0035687137873965684, "phrase": "evolutionary_theory-based_approach"}, {"score": 0.0034426417353349567, "phrase": "alternative_strategies"}, {"score": 0.0031402604946939743, "phrase": "distributed_information-based_cooperation_ushering_scheme"}, {"score": 0.0030414140732789186, "phrase": "message_forwarding"}, {"score": 0.002571171956724731, "phrase": "approximated_network_performance"}, {"score": 0.0024604876113911173, "phrase": "message_delivery_ratio"}, {"score": 0.0022085455097790537, "phrase": "discuss_scheme"}, {"score": 0.0021304214257321, "phrase": "complete_knowledge"}, {"score": 0.0021049977753042253, "phrase": "network-wide_performance"}], "paper_keywords": ["Cooperation", " opportunistic mobile networks", " strategy adaptation"], "paper_abstract": "Cooperation among nodes is a fundamental necessity in opportunistic mobile networks (OMNs), where the messages are transferred using the store-carry-and-forward mechanism, due to sporadic inter-node wireless connectivity. While multiple works have addressed this issue, they are often constrained in their assumptions on solutions (e.g., requirement of central authority, and tracing the recipient nodes for providing reward or punishment). In this work, we address this research lacuna by taking an evolutionary theory-based approach. In evolutionary theory, the players analyze alternative strategies and select the best one to survive in a population. Inspired by this, in this work, we propose a Distributed Information-Based Cooperation Ushering Scheme (DISCUSS) to promote cooperation in message forwarding between nodes. In this scheme, the nodes maintain and exchange information with one another during contacts about the messages created and delivered in the network. Based on this, the nodes evaluate their own performance and compare that with the approximated network performance to adapt the most successful forwarding strategy. Simulation results show that the message delivery ratio in the network improves upto 31 percent, when the nodes dynamically switch their strategies, as compared to the case when they do not. Furthermore, the DISCUSS scheme fared closely to its variant with the nodes having complete knowledge about the network-wide performance.", "paper_title": "Distributed Information-Based Cooperative Strategy Adaptation in Opportunistic Mobile Networks", "paper_id": "WOS:000349769500010"}