{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "general_algorithms"}, {"score": 0.00470325458481566, "phrase": "molecular_dynamics_trajectories"}, {"score": 0.004637478829869904, "phrase": "standard_ways"}, {"score": 0.0045726187330434025, "phrase": "md_trajectories"}, {"score": 0.004424768776701965, "phrase": "floating_point_numbers"}, {"score": 0.00432208488976429, "phrase": "efficient_simulation_programs"}, {"score": 0.003789395499639015, "phrase": "absolute_values"}, {"score": 0.00351491577968631, "phrase": "lower_precision"}, {"score": 0.0033851984021896287, "phrase": "resulting_differences"}, {"score": 0.0032449610741097992, "phrase": "block_sorting_algorithm"}, {"score": 0.0031845275505784434, "phrase": "huffman"}, {"score": 0.002564985233317994, "phrase": "liquid_argon"}, {"score": 0.0024241817763927163, "phrase": "solid_magnesium_oxide"}, {"score": 0.002291089893848235, "phrase": "accurate_structural_and_dynamic_properties"}, {"score": 0.0022168460543913787, "phrase": "parallelized_implementation"}, {"score": 0.0021450029487459403, "phrase": "compression_ratios"}, {"score": 0.0021049977753042253, "phrase": "single_precision_floating_point"}], "paper_keywords": ["Molecular dynamics", " Trajectory", " Compression"], "paper_abstract": "We present general algorithms for the compression of molecular dynamics trajectories. The standard ways to store MD trajectories as text or as raw binary floating point numbers result in very large files when efficient simulation programs are used on supercomputers. Our algorithms are based on the observation that differences in atomic coordinates/velocities, in either time or space, are generally smaller than the absolute values of the coordinates/velocities. Also, it is often possible to store values at a lower precision. We apply several compression schemes to compress the resulting differences further. The most efficient algorithms developed here use a block sorting algorithm in combination with Huffman coding. Depending on the frequency of storage of frames in the trajectory, either space, time, or combinations of space and time differences are usually the most efficient. We compare the efficiency of our algorithms with each other and with other algorithms present in the literature for various systems: liquid argon, water, a virus capsid solvated in 15 mM aqueous NaCl, and solid magnesium oxide. We perform tests to determine how much precision is necessary to obtain accurate structural and dynamic properties, as well as benchmark a parallelized implementation of the algorithms. We obtain compression ratios (compared to single precision floating point) of 1:3.3-1:35 depending on the frequency of storage of frames and the system studied.", "paper_title": "Trajectory NG: portable, compressed, general molecular dynamics trajectories", "paper_id": "WOS:000295940700024"}