{"auto_keywords": [{"score": 0.042530037163362074, "phrase": "multi-task_learning"}, {"score": 0.035395086221830914, "phrase": "classification_performance"}, {"score": 0.00481495049065317, "phrase": "classifying_protein_sequences"}, {"score": 0.004752221133109136, "phrase": "regularized_multi-task_learning"}, {"score": 0.004392565073466714, "phrase": "special_challenge"}, {"score": 0.004306968571854912, "phrase": "hierarchical_structure"}, {"score": 0.004007117637280438, "phrase": "mtl"}, {"score": 0.0035141291835319682, "phrase": "combined_knowledge"}, {"score": 0.0031223774204093713, "phrase": "protein_structure_classification"}, {"score": 0.0030414140732789186, "phrase": "learning_process"}, {"score": 0.002962543869356265, "phrase": "scop_and_cath._our_goal"}, {"score": 0.0027560092576928595, "phrase": "particular_class"}, {"score": 0.0025638362414466278, "phrase": "recent_developments"}, {"score": 0.002464709648714996, "phrase": "interrelated_classification_problems"}, {"score": 0.0021049977753042253, "phrase": "classification_databases"}], "paper_keywords": ["Multi-task learning", " protein structure classification"], "paper_abstract": "Classification problems in which several learning tasks are organized hierarchically pose a special challenge because the hierarchical structure of the problems needs to be considered. Multi-task learning (MTL) provides a framework for dealing with such interrelated learning tasks. When two different hierarchical sources organize similar information, in principle, this combined knowledge can be exploited to further improve classification performance. We have studied this problem in the context of protein structure classification by integrating the learning process for two hierarchical protein structure classification database, SCOP and CATH. Our goal is to accurately predict whether a given protein belongs to a particular class in these hierarchies using only the amino acid sequences. We have utilized the recent developments in multi-task learning to solve the interrelated classification problems. We have also evaluated how the various relationships between tasks affect the classification performance. Our evaluations show that learning schemes in which both the classification databases are used outperform the schemes which utilize only one of them.", "paper_title": "Classifying Protein Sequences Using Regularized Multi-Task Learning", "paper_id": "WOS:000346630600012"}