{"auto_keywords": [{"score": 0.04917331388552706, "phrase": "traffic_identification"}, {"score": 0.00481495049065317, "phrase": "independent_combination"}, {"score": 0.004634459424542272, "phrase": "important_challenge"}, {"score": 0.00459039896577789, "phrase": "network_management"}, {"score": 0.004418287966422041, "phrase": "new_algorithms"}, {"score": 0.004355415885815204, "phrase": "different_uses"}, {"score": 0.004313996835376177, "phrase": "known_techniques"}, {"score": 0.003920780681351006, "phrase": "existing_results"}, {"score": 0.0037377733149169573, "phrase": "traffic_profiles"}, {"score": 0.0036669760226536977, "phrase": "collected_traces"}, {"score": 0.0035125292519354724, "phrase": "different_networks"}, {"score": 0.0034790978593553794, "phrase": "data_granularities"}, {"score": 0.002887028262617443, "phrase": "identification_abilities"}, {"score": 0.0028187792953857957, "phrase": "different_situations"}, {"score": 0.00276534038425712, "phrase": "new_methodology"}, {"score": 0.0023613185213421173, "phrase": "promising_results"}, {"score": 0.002166349705365602, "phrase": "previous_identification_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Traffic identification", " Machine learning"], "paper_abstract": "Traffic identification is currently an important challenge for network management and dimensioning. In recent years, some new algorithms and the different uses of known techniques have been proposed, yet the results are so far limited in scope and frequently disappointing. Furthermore, existing results cannot be directly compared, since networks and traffic profiles differ significantly among collected traces. When submitted to an analysis, considering different networks, data granularities and baselines, most algorithms perform well in one or two scenarios. However, no algorithm has proven better than the others in the majority of the scenarios. Summarizing four years of research in traffic identification, this work shows that the identification abilities of algorithms vary for different situations and proposes a new methodology for traffic identification through the combination of any set of algorithms for traffic identification. Four different combination mechanisms (and many variations) are validated against four different network scenarios that are commonly used in the literature. Combination shows promising results, mainly because it revealed to be robust against bias towards any scenario, which happens in previous identification algorithms. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Better network traffic identification through the independent combination of techniques", "paper_id": "WOS:000278578500008"}