{"auto_keywords": [{"score": 0.04455074562181148, "phrase": "generic_models"}, {"score": 0.014926047688398536, "phrase": "ceramic_vessels"}, {"score": 0.013533107023419155, "phrase": "original_vessel"}, {"score": 0.00481495049065317, "phrase": "archeological_vessels"}, {"score": 0.00478701880312723, "phrase": "expert_priors"}, {"score": 0.00475924837336259, "phrase": "intrinsic_differential_geometry_information"}, {"score": 0.004609352548073816, "phrase": "tedious_task"}, {"score": 0.004542780650208743, "phrase": "unearthed_archeological_shards"}, {"score": 0.004399672486322409, "phrase": "shards_surface_intrinsic_differential_geometry_information"}, {"score": 0.004211731831120046, "phrase": "virtual_reconstruction"}, {"score": 0.003950453462399077, "phrase": "expert_historical_knowledge"}, {"score": 0.0038259332670788748, "phrase": "site_location"}, {"score": 0.003619993477999133, "phrase": "geometric_transformation"}, {"score": 0.0032786537599187125, "phrase": "surface_intrinsic_features"}, {"score": 0.003175241510860455, "phrase": "generic_model"}, {"score": 0.0031476068430779367, "phrase": "novel_set"}, {"score": 0.0030572112793962004, "phrase": "parabolic_contours"}, {"score": 0.0029694040368299624, "phrase": "distance_error"}, {"score": 0.0026892447164623247, "phrase": "color_information"}, {"score": 0.002421291757425244, "phrase": "ongoing_research_activity"}, {"score": 0.0024072121760839427, "phrase": "computational_archeology"}, {"score": 0.0023380300046435187, "phrase": "mending_process"}, {"score": 0.002310915790114425, "phrase": "surface_differential_geometry_information"}, {"score": 0.0021799789348982516, "phrase": "surface_breaks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Intrinsic geometric features", " Gaussian curvature", " Parabolic contours", " Surface alignment", " Mending", " Archeological shards"], "paper_abstract": "This paper presents a method to assist in the tedious task of reconstructing ceramic vessels from unearthed archeological shards (fragments) using 3D computer vision-enabling technologies. The method exploits the shards surface intrinsic differential geometry information (one of many possible tools) coupled with a series of generic models to produce a virtual reconstruction and rendition of what the original vessel may have looked like. Generic models are constructed based on a host of factors including expert historical knowledge of the period, provenance of the artifact, and site location. The generic models need not to be identical to the original vessel, but they must be within a geometric transformation of it in most of its parts. The method is suited for ceramic vessels with some relief (i.e., surface with molding, carving, or stamping), as this method exploits surface intrinsic features for alignment. The alignment of the shards against the generic model uses a novel set of 3D weighted curve moments. The transformation is computed from corresponding parabolic contours on the shard and the generic model. A distance error metric is used to access the accuracy of alignment of a fragment to a given generic vessel model. The method is also extendable to surface markings. For a vessel that has no relief, color information or surface breaks can be used for the alignment. The method is tested on a subset of 3D scanned Independence National Historical Park (INDE) ceramic artifacts and the generic models created by experts. This work is part of an ongoing research activity in computational archeology that exploits many different tools and features to help in the mending process. Only the use of surface differential geometry information is reported here. This aspect is complementary to various other tools reported elsewhere by us and others, such as surface breaks, texture, color, etc. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Virtual reconstruction of archeological vessels using expert priors and intrinsic differential geometry information", "paper_id": "WOS:000317370300005"}