{"auto_keywords": [{"score": 0.03725945632746808, "phrase": "learnt_shape"}, {"score": 0.00481495049065317, "phrase": "magnetic_resonance_prostate_imagery"}, {"score": 0.004567596860086148, "phrase": "medical_image_analysis"}, {"score": 0.004527619017250708, "phrase": "surgical_planning"}, {"score": 0.004371160978838441, "phrase": "unified_shape-based_framework"}, {"score": 0.004257360656055417, "phrase": "mr_prostate_imagery"}, {"score": 0.00416478405812793, "phrase": "shape-based_segmentation"}, {"score": 0.0041102032028337366, "phrase": "two-part_problem"}, {"score": 0.003916098498242888, "phrase": "training_shapes"}, {"score": 0.00346223706087128, "phrase": "general_registration_task"}, {"score": 0.0034319005131102495, "phrase": "prostate_shapes"}, {"score": 0.0033277936960179892, "phrase": "large_variations"}, {"score": 0.003226834737003501, "phrase": "training_sets"}, {"score": 0.0031151864044353245, "phrase": "existing_techniques"}, {"score": 0.002890557197908352, "phrase": "registration_problem"}, {"score": 0.0027660443371695024, "phrase": "point_clouds"}, {"score": 0.002258745901862197, "phrase": "experimental_results"}, {"score": 0.0021709339252206825, "phrase": "algorithm's_capability"}, {"score": 0.0021049977753042253, "phrase": "overall_segmentation_task"}], "paper_keywords": ["Image registration", " particle filtering", " prostate segmentation", " shape-based segmentation"], "paper_abstract": "Extracting the prostate from magnetic resonance (MR) imagery is a challenging and important task for medical image analysis and surgical planning. We present in this work a unified shape-based framework to extract the prostate from MR prostate imagery. In many cases, shape-based segmentation is a two-part problem. First, one must properly align a set of training shapes such that any variation in shape is not due to pose. Then segmentation can be performed under the constraint of the learnt shape. However, the general registration task of prostate shapes becomes increasingly difficult due to the large variations in pose and shape in the training sets, and is not readily handled through existing techniques. Thus, the contributions of this paper are twofold. We first explicitly address the registration problem by representing the shapes of a training set as point clouds. In doing so, we are able to exploit the more global aspects of registration via a certain particle filtering based scheme. In addition, once the shapes have been registered, a cost functional is designed to incorporate both the local image statistics as well as the learnt shape prior. We provide experimental results, which include several challenging clinical data sets, to highlight the algorithm's capability of robustly handling supine/prone prostate registration and the overall segmentation task.", "paper_title": "A Coupled Global Registration and Segmentation Framework With Application to Magnetic Resonance Prostate Imagery", "paper_id": "WOS:000283352700007"}