{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "belief_functions"}, {"score": 0.0490076197066283, "phrase": "possibility_theory"}, {"score": 0.012145904465567313, "phrase": "idempotent_merging"}, {"score": 0.007712276683322326, "phrase": "expected_cardinality"}, {"score": 0.00474283953918251, "phrase": "minimum_rule"}, {"score": 0.004567230180529598, "phrase": "single_variable"}, {"score": 0.004498812433096501, "phrase": "different_sources"}, {"score": 0.004464987136420614, "phrase": "dempster_rule"}, {"score": 0.004348580182733617, "phrase": "information_sources"}, {"score": 0.0037959868107895053, "phrase": "possible_redundancy"}, {"score": 0.0037674258625824113, "phrase": "dependent_sources"}, {"score": 0.0036830211726031946, "phrase": "different_strategies"}, {"score": 0.003546513036085932, "phrase": "idempotent_rules"}, {"score": 0.0031905286720361145, "phrase": "idempotent_fusion_rule"}, {"score": 0.0030606302942851027, "phrase": "information_content"}, {"score": 0.0028485585670146025, "phrase": "evidence_theory"}, {"score": 0.002671263324230699, "phrase": "fusion_process"}, {"score": 0.0023225152126545067, "phrase": "joint_belief_functions"}, {"score": 0.002287646331988365, "phrase": "least_committed_ones"}, {"score": 0.0021861425611350857, "phrase": "belief_function"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Belief functions", " Least commitment", " Idempotence", " Ill-known dependencies", " Contour function"], "paper_abstract": "When conjunctively merging two belief functions concerning a single variable but coming from different sources. Dempster rule of combination is justified only when information sources can be considered as independent. When dependencies between sources are ill-known, it is usual to require the property of idempotence for the merging of belief functions, as this property captures the possible redundancy of dependent sources. To study idempotent merging, different strategies can be followed. One strategy is to rely on idempotent rules used in either more general or more specific frameworks and to study, respectively, their particularization or extension to belief functions. In this paper, we study the feasibility of extending the idempotent fusion rule of possibility theory (the minimum) to belief functions. We first investigate how comparisons of information content, in the form of inclusion and least-commitment, can be exploited to relate idempotent merging in possibility theory to evidence theory. We reach the conclusion that unless we accept the idea that the result of the fusion process can be a family of belief functions, such an extension is not always possible. As handling such families seems impractical, we then turn our attention to a more quantitative criterion and consider those combinations that maximize the expected cardinality of the joint belief functions, among the least committed ones, taking advantage of the fact that the expected cardinality of a belief function only depends on its contour function. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Idempotent conjunctive combination of belief functions: Extending the minimum rule of possibility theory", "paper_id": "WOS:000292785200012"}