{"auto_keywords": [{"score": 0.04387541794991407, "phrase": "security_knowledge_sharing"}, {"score": 0.015288998433371401, "phrase": "behavioral_information_security_governance_factors"}, {"score": 0.01358449522261831, "phrase": "national_culture"}, {"score": 0.007845684187674626, "phrase": "sweden"}, {"score": 0.006358581818574848, "phrase": "business-based_information_security_management"}, {"score": 0.0054113289918803105, "phrase": "information_security_management"}, {"score": 0.00481495049065317, "phrase": "behavioral_information_security_governance"}, {"score": 0.0047145892599481515, "phrase": "empirical_investigation"}, {"score": 0.004627128628921934, "phrase": "information_security_knowledge_sharing"}, {"score": 0.0045095013424771065, "phrase": "different_geographic_regions"}, {"score": 0.0043539381998026925, "phrase": "usa"}, {"score": 0.0040967079375245335, "phrase": "mixed_methods_research_design"}, {"score": 0.004068024800132232, "phrase": "qualitative_data"}, {"score": 0.0040018729092199615, "phrase": "study's_research_model"}, {"score": 0.003964554008372494, "phrase": "survey_instrument"}, {"score": 0.0038366467523757433, "phrase": "implemented_security_knowledge_sharing_mechanisms"}, {"score": 0.003809777470248088, "phrase": "major_direct_influence"}, {"score": 0.0037041620038929185, "phrase": "organizational_structure"}, {"score": 0.0036439053927158154, "phrase": "uniform_firm-wide_policies"}, {"score": 0.0035678655286103377, "phrase": "information_security_planning"}, {"score": 0.003428522435696699, "phrase": "mediation_analysis"}, {"score": 0.003372734549129974, "phrase": "nonsignificant_direct_relation"}, {"score": 0.003302334637050387, "phrase": "fully_mediating_effect"}, {"score": 0.0032791949981612004, "phrase": "information_security_processes"}, {"score": 0.003218276350581352, "phrase": "interrelated_influences"}, {"score": 0.0031437120171951224, "phrase": "information_security_governance"}, {"score": 0.003078077783993954, "phrase": "coordinating_processes"}, {"score": 0.003020884030999451, "phrase": "information_security_function"}, {"score": 0.0029717093349599017, "phrase": "business_needs"}, {"score": 0.002950879546611178, "phrase": "multigroup_analysis"}, {"score": 0.002909655681860852, "phrase": "significant_moderating_effect"}, {"score": 0.0028555824153862234, "phrase": "six_proposed_relations"}, {"score": 0.0027828640985339726, "phrase": "feminine_country_managers"}, {"score": 0.0027056396248736673, "phrase": "business_activities"}, {"score": 0.0026367295522338953, "phrase": "implemented_controls"}, {"score": 0.002486556383806721, "phrase": "formal_arrangements"}, {"score": 0.00244032678338226, "phrase": "swedish_managers"}, {"score": 0.002295920688567822, "phrase": "local_participation"}, {"score": 0.0021499276499654563, "phrase": "future_studies"}, {"score": 0.0021049977753042253, "phrase": "global_environment"}], "paper_keywords": ["Information security", " Knowledge sharing", " Cultural differences", " Mixed methods research", " Partial least squares structural", " equation modeling", " Multigroup analysis"], "paper_abstract": "This paper presents an empirical investigation on what behavioral information security governance factors drives the establishment of information security knowledge sharing in organizations. Data was collected from organizations located in different geographic regions of the world, and the amount of data collected from two countries namely, USA and Sweden allowed us to investigate if the effect of behavioral information security governance factors on the establishment of security knowledge sharing differs based on national culture. The study followed a mixed methods research design, wherein qualitative data was collected to both establish the study's research model and develop a survey instrument that was distributed to 578 information security executives. The results suggest that processes to coordinate implemented security knowledge sharing mechanisms have a major direct influence on the establishment of security knowledge sharing in organizations; the effect of organizational structure (e.g., centralized security function to develop and deploy uniform firm-wide policies, and use of steering committees to facilitate information security planning) is slightly weaker, while business-based information security management has no significant direct effect on security knowledge sharing. A mediation analysis revealed that the reason for the nonsignificant direct relation between business-based information security management and security knowledge sharing is the fully mediating effect of coordinating information security processes. Thus, the results disentangles the interrelated influences of behavioral information security governance factors on security knowledge sharing by showing that information security governance sets the platform to establish security knowledge sharing, and coordinating processes realize the effect of both the structure of the information security function and the alignment of information security management with business needs. A multigroup analysis identified that national culture had a significant moderating effect on the association between four of the six proposed relations. In Sweden which is seen as a less individualist, feminine country managers tend to focus their efforts on implementing controls that are aligned with business activities and employees' need; monitoring the effectiveness of the implemented controls, and assuring that the controls are not too obtrusive to the end-user. On the contrary, US organizations establish security knowledge sharing in their organization through formal arrangements and structures. These results imply that Swedish managers perceive it to be important to involve, or at least know how their employees cope with the decisions that have been made, thus favoring local participation in information security management, while US managers may feel the need to have more central control when running their information security function. The findings suggest that national culture should be taken into consideration in future studies in particular when investigating organizations operating in a global environment and understand how it affects behaviors and decision-making. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Information security knowledge sharing in organizations: Investigating the effect of behavioral information security governance and national culture", "paper_id": "WOS:000337014000008"}