{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "sparse_network_structures"}, {"score": 0.00447937340641839, "phrase": "social_science"}, {"score": 0.00391167729353583, "phrase": "relatively_limited_data"}, {"score": 0.003841610436545169, "phrase": "underlying_network"}, {"score": 0.0036224139706218916, "phrase": "covariance_modeling"}, {"score": 0.003557509959237602, "phrase": "penalty_constraint"}, {"score": 0.0033544692489307676, "phrase": "sparse_regression_methods"}, {"score": 0.0031203609829058587, "phrase": "robust_approaches"}, {"score": 0.0029689311901364797, "phrase": "robust_covariance_modeling_approaches"}, {"score": 0.0028376361457661415, "phrase": "robust_methods"}, {"score": 0.0027367816003722252, "phrase": "low-dimensional_problems"}, {"score": 0.002712131567923321, "phrase": "classical_deviance_tests"}, {"score": 0.0025572160146590623, "phrase": "copula_approaches"}, {"score": 0.0023465400668244386, "phrase": "mild_departures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Penalized inference", " Covariance graphical models", " Robust regression", " Regularized regression", " Copula"], "paper_abstract": "Networks appear in many fields, from finance to medicine, engineering, biology and social science. They often comprise of a very large number of entities, the nodes, and the interest lies in inferring the interactions between these entities, the edges, from relatively limited data. If the underlying network of interactions is sparse, two main statistical approaches are used to retrieve such a structure: covariance modeling approaches with a penalty constraint that encourages sparsity of the network, and nodewise regression approaches with sparse regression methods applied at each node. In the presence of outliers or departures from normality, robust approaches have been developed which relax the assumption of normality. Robust covariance modeling approaches are reviewed and compared with novel nodewise approaches where robust methods are used at each node. For low-dimensional problems, classical deviance tests are also included and compared with penalized likelihood approaches. Overall, copula approaches are found to perform best: they are comparable to the other methods under an assumption of normality or mild departures from this, but they are superior to the other methods when the assumption of normality is strongly violated. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Robust methods for inferring sparse network structures", "paper_id": "WOS:000323297000006"}