{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "divergence_times"}, {"score": 0.004582528208024817, "phrase": "general_public"}, {"score": 0.004069280130346136, "phrase": "scientific_literature"}, {"score": 0.003778004256546193, "phrase": "public_knowledgebase"}, {"score": 0.0037222908218253054, "phrase": "data-driven_access"}, {"score": 0.0036312482387007815, "phrase": "peer-reviewed_publications"}, {"score": 0.0032724821705972357, "phrase": "timetree_resource"}, {"score": 0.0029344771385297137, "phrase": "current_timetree_web_resource"}, {"score": 0.0028203950416405563, "phrase": "molecular_clock_analyses"}, {"score": 0.00263129148531588, "phrase": "complex_and_hierarchical_data"}, {"score": 0.0025541693207036167, "phrase": "user_query"}, {"score": 0.002454835845644037, "phrase": "iphone_application"}, {"score": 0.0023593563827190626, "phrase": "published_time_estimates"}, {"score": 0.002278856202878812, "phrase": "scientific_community"}, {"score": 0.0021049977753042253, "phrase": "evolutionary_nomenclature"}], "paper_keywords": [""], "paper_abstract": "Scientists, educators and the general public often need to know times of divergence between species. But they rarely can locate that information because it is buried in the scientific literature, usually in a format that is inaccessible to text search engines. We have developed a public knowledgebase that enables data-driven access to the collection of peer-reviewed publications in molecular evolution and phylogenetics that have reported estimates of time of divergence between species. Users can query the TimeTree resource by providing two names of organisms (common or scientific) that can correspond to species or groups of species. The current TimeTree web resource (TimeTree2) contains timetrees reported from molecular clock analyses in 910 published studies and 17 341 species that span the diversity of life. TimeTree2 interprets complex and hierarchical data from these studies for each user query, which can be launched using an iPhone application, in addition to the website. Published time estimates are now readily accessible to the scientific community, K-12 and college educators, and the general public, without requiring knowledge of evolutionary nomenclature.", "paper_title": "TimeTree2: species divergence times on the iPhone", "paper_id": "WOS:000292554900027"}