{"auto_keywords": [{"score": 0.03733965987162997, "phrase": "test_taker"}, {"score": 0.029729343805636504, "phrase": "computer-based_concept_map_assessments"}, {"score": 0.00481495049065317, "phrase": "computer-based_knowledge_assessment"}, {"score": 0.004632737164977336, "phrase": "concept_map"}, {"score": 0.004457388497044933, "phrase": "conceptual_knowledge"}, {"score": 0.004358169586895055, "phrase": "technology-based_environments"}, {"score": 0.004330412673510164, "phrase": "usability"}, {"score": 0.004233826962599848, "phrase": "particular_use"}, {"score": 0.004099807729119934, "phrase": "human-computer_interaction_research"}, {"score": 0.003944550453282929, "phrase": "computer-based_assessment"}, {"score": 0.0038941106036522216, "phrase": "decreased_test_performance"}, {"score": 0.003869132124880576, "phrase": "reduced_validity"}, {"score": 0.0032414013828487727, "phrase": "usability_testing"}, {"score": 0.0031793840887737687, "phrase": "design_standards"}, {"score": 0.003068741668908204, "phrase": "computer-conducted_concept_map_assessments"}, {"score": 0.003010017873923648, "phrase": "present_paper"}, {"score": 0.002933458667525067, "phrase": "systematic_research_review"}, {"score": 0.0027593227272966186, "phrase": "computer-based_concept_maps"}, {"score": 0.0025051226957195634, "phrase": "insufficient_attention"}, {"score": 0.0024413739512778136, "phrase": "suitable_interaction"}, {"score": 0.002410109046803846, "phrase": "test_device"}, {"score": 0.002371589020876307, "phrase": "training_effort"}, {"score": 0.0023487724551034227, "phrase": "test_use"}, {"score": 0.0023037942361136205, "phrase": "test's_usability"}, {"score": 0.0021880094145128935, "phrase": "test_use_training"}, {"score": 0.00214610313234565, "phrase": "current_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human-computer interface", " Media in education", " Pedagogical issues"], "paper_abstract": "The concept map is now widely accepted as an instrument for the assessment of conceptual knowledge and is increasingly being embedded into technology-based environments. Usability addresses how appropriate (for a particular use) or how user-friendly a computer-based assessment instrument is. As we know from human-computer interaction research, if the interface is not user-friendly, a computer-based assessment can result in decreased test performance and reduced validity. This means that the usability of the interface affects the assessment in such a way that if the test is not user-friendly, then the test taker will not be able to fully demonstrate his/her level of proficiency and will instead be scored according to his/her information and communication technology (ICT) literacy skills. The guidelines of the International Test Commission (2006) require usability testing for such instruments and suggest that design standards be implemented. However, we do not know whether computer-conducted concept map assessments fulfill these standards. The present paper addresses this aspect. We conducted a systematic research review to examine whether and how researchers have studied and considered usability when conducting computer-based concept map assessments. Only 24 out of 119 journal articles that assessed computer-based concept maps discussed the usability issue in some way. Nevertheless, our review brings to light the idea that the impact of usability on computer-based concept map assessments is an issue that has received insufficient attention. In addition, usability ensures a suitable interaction between test taker and test device; thus, the training effort required for test use can be reduced if a test's usability is straight forward. Our literature review, however, illustrates that the interplay between usability and test use training has mostly been neglected in current studies. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Concept maps: A useful and usable tool for computer-based knowledge assessment? A literature review with a focus on usability", "paper_id": "WOS:000341675100019"}