{"auto_keywords": [{"score": 0.0422542551131455, "phrase": "information-seeking_activities"}, {"score": 0.016593875162702318, "phrase": "information-seeking_problems"}, {"score": 0.00481495049065317, "phrase": "different_types"}, {"score": 0.004534372661692015, "phrase": "new_and_different_search_tools"}, {"score": 0.0043192062457764226, "phrase": "significant_factor"}, {"score": 0.00428230507124341, "phrase": "search_process"}, {"score": 0.004261557212724958, "phrase": "ict"}, {"score": 0.004149666468555799, "phrase": "ongoing_research"}, {"score": 0.003930129283294965, "phrase": "academic_environment"}, {"score": 0.0038965391824276594, "phrase": "-_an_online_questionnaire"}, {"score": 0.003786624022366719, "phrase": "higher_education_sector"}, {"score": 0.0037650144720060533, "phrase": "quantitative_analysis"}, {"score": 0.0036587957867952456, "phrase": "online_questionnaire"}, {"score": 0.00362751627847987, "phrase": "eight_online_mailing_lists"}, {"score": 0.0033577243441658302, "phrase": "pearson's_correlation_coefficient"}, {"score": 0.002860243381361729, "phrase": "significant_correlations"}, {"score": 0.0026625766466908825, "phrase": "communication_technology"}, {"score": 0.0026097132486330075, "phrase": "user_categories"}, {"score": 0.002514300131208454, "phrase": "gender_and_user_categories"}, {"score": 0.00238107477384539, "phrase": "significant_correlation"}, {"score": 0.0022355883844920976, "phrase": "computer_and_information_sciences"}, {"score": 0.0021292712473618383, "phrase": "first_time"}], "paper_keywords": ["Uncertainty management", " Information retrieval"], "paper_abstract": "Purpose - This paper aims to argue that different types Of uncertainty are associated with information seeking and retrieval (IS&R), and that, with the proliferation of new and different search tools, channels and sources, uncertainty, whether positive or negative, continues to be a significant factor in the search process. The paper aims to report on one part of an ongoing research that aims to study correlations among a series of information-seeking activities and information-seeking problems that cause uncertainty amongst users in academic environment. Design/methodology/approach - An online questionnaire is used to collect data from users in the higher education sector. Quantitative analysis is carried out on the data collected through an online questionnaire distributed through eight online mailing lists comprising a total of 3,607 registered users. A total of 668 responses are returned from three categories of respondents: academic staff, research staff and research students. Pearson's correlation coefficient is used to study correlation among the activities and problems that cause uncertainty in IS&R. Findings - This research shows that uncertainty may occur in course of a number of information-seeking activities, and may also be created because of some problems associated with information seeking. Some of the activities and problems that caused uncertainty have significant Correlations. There is also a correlation between information-seeking activities and gender and disciplines, though there is little correlation between information-seeking activities and age, information and communication technology (ICT) skills, and user categories. There is also a Correlation between information-seeking problems and ICT skills, gender and user categories, but there is less correlation between information-seeking problems and age. Information-seeking activities and information-seeking problems that cause uncertainty have a significant correlation with disciplines and gender. Furthermore, it is noted that information-seeking activities caused less uncertainty for users in the discipline of computer and information sciences compared to the other chosen disciplines such as business and management, and arts and humanities. Originality/value - This research for the first time aimed to study which information-seeking activities and problems cause uncertainty and how they are correlated.", "paper_title": "Relationship among activities and problems causing uncertainty in information seeking and retrieval", "paper_id": "WOS:000266464900007"}