{"auto_keywords": [{"score": 0.034466371082712124, "phrase": "trust_management_system"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_streaming_networks"}, {"score": 0.00422177384286051, "phrase": "high_video_streaming_quality"}, {"score": 0.004015458740397976, "phrase": "streaming_systems"}, {"score": 0.0031056437850836326, "phrase": "direct_trust"}, {"score": 0.003066945490483524, "phrase": "indirect_trust"}, {"score": 0.0028625406368744995, "phrase": "new_direct_trust_model"}, {"score": 0.0027741761880779535, "phrase": "dynamic_confidence_factor"}, {"score": 0.0026384167183586015, "phrase": "direct_and_indirect_trust"}, {"score": 0.002447101794397243, "phrase": "novel_double-threshold_trust_utilization_scheme"}, {"score": 0.0023127544795063263, "phrase": "proposed_trust_management_system"}, {"score": 0.0021450029487459403, "phrase": "polluted_data_chunks"}], "paper_keywords": ["Peer-to-peer networks", " Pollution attack", " Trust management", " Multimedia streaming"], "paper_abstract": "Nowadays, peer-to-peer (P2P) streaming systems have become a popular way to deliver multimedia content over the internet due to their low bandwidth requirement, high video streaming quality, and flexibility. However, P2P streaming systems are vulnerable to various attacks, especially pollution attacks, due to their distributed and dynamically changing infrastructure. In this paper, by exploring the features of various pollution attacks, we propose a trust management system tailored for P2P streaming systems. Both direct trust and indirect trust are taken into consideration when designing the trust management system. A new direct trust model is proposed. A dynamic confidence factor that can dynamically adjust the weight of direct and indirect trust in computing the trust is also proposed and studied. A novel double-threshold trust utilization scheme is given. It is shown that the proposed trust management system is effective in identifying polluters and preventing them from further sharing of polluted data chunks. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A trust-based pollution attack prevention scheme in peer-to-peer streaming networks", "paper_id": "WOS:000342540900005"}