{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "string-rewriting_systems"}, {"score": 0.0046741260449047976, "phrase": "theoretical_computer_science"}, {"score": 0.004339744430169516, "phrase": "turing_machine"}, {"score": 0.004109770306454165, "phrase": "process_halts"}, {"score": 0.004029187256595917, "phrase": "final_output"}, {"score": 0.0036312482387007815, "phrase": "entire_process"}, {"score": 0.003192406091820197, "phrase": "observed_system"}, {"score": 0.00263129148531588, "phrase": "rewriting_process"}, {"score": 0.002418587525752333, "phrase": "context-free_rewriting_systems"}, {"score": 0.0023710856920150574, "phrase": "mcnaughton_languages"}, {"score": 0.0021049977753042253, "phrase": "enumerable_languages"}], "paper_keywords": ["string-rewriting", " McNaughton languages", " observation"], "paper_abstract": "Models of computation in theoretical computer science very frequently consist of a device performing some type of process, like a Turing machine and its computation or a grammar and its derivation. After the process halts, only some final output is regarded as the result. In adding an observer to such a device, one can obtain a protocol of the entire process and then use this as the result of the computation. In several recent articles this approach has proved to often exceed greatly the power of the observed system. Here we apply this architecture to string-rewriting systems. They receive a string as input, and a combination of observer and decider then determines whether this string is accepted. This decision is based only on the rewriting process performed. First we determine the power of painter, context-free, and inverse context-free rewriting systems in terms of McNaughton languages. Then these are investigated as components of rewriting/observer systems, and we obtain characterizations of the classes of context-sensitive and recursively enumerable languages. Finally we investigate some limitations, i.e. characterize some systems, where observation does not increase power.", "paper_title": "Observation of string-rewriting systems", "paper_id": "WOS:000243831500005"}