{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "background_information"}, {"score": 0.045685327460864004, "phrase": "social_interaction"}, {"score": 0.02918183980722893, "phrase": "social_interaction_phase"}, {"score": 0.004774937143916685, "phrase": "social_interaction_on_image_tagging"}, {"score": 0.0040916236797851726, "phrase": "jewish"}, {"score": 0.00389164348807591, "phrase": "first_group"}, {"score": 0.0038112201846057445, "phrase": "additional_information"}, {"score": 0.0037480753312398754, "phrase": "second_group"}, {"score": 0.0035947360742084253, "phrase": "third_group"}, {"score": 0.003279039724748895, "phrase": "first_stage"}, {"score": 0.00300351371036355, "phrase": "second_stage"}, {"score": 0.0027167830773160203, "phrase": "tag_sets"}, {"score": 0.002671722386856879, "phrase": "popular_tags"}, {"score": 0.002551612225562499, "phrase": "total_number"}, {"score": 0.002530359917257626, "phrase": "assigned_tags"}, {"score": 0.002436888552432559, "phrase": "distinct_tags"}, {"score": 0.0021049977753042253, "phrase": "initial_difficulties"}], "paper_keywords": [""], "paper_abstract": "In this article, we describe the results of an experiment designed to understand the effects of background information and social interaction on image tagging. The participants in the experiment were asked to tag 12 pre-selected images of Jewish cultural heritage. The users were partitioned into three groups: the first group saw only the images with no additional information whatsoever, the second group saw the images plus a short, descriptive title, and the third group saw the images, the titles, and the URL of the page in which the image appeared. In the first stage of the experiment, each user tagged the images without seeing the tags provided by the other users. In the second stage, the users saw the tags assigned by others and were encouraged to interact. Results show that after the social interaction phase, the tag sets converged and the popular tags became even more popular. Although in all cases the total number of assigned tags increased after the social interaction phase, the number of distinct tags decreased in most cases. When viewing the image only, in some cases the users were not able to correctly identify what they saw in some of the pictures, but they overcame the initial difficulties after interaction. We conclude from this experiment that social interaction may lead to convergence in tagging and that the \"wisdom of the crowds\" helps overcome the difficulties due to the lack of information.", "paper_title": "The Effects of Background Information and Social Interaction on Image Tagging", "paper_id": "WOS:000276991500006"}