{"auto_keywords": [{"score": 0.049519375496783466, "phrase": "design_talk"}, {"score": 0.012349115273449946, "phrase": "tpack"}, {"score": 0.007516858279880919, "phrase": "technology-rich_early_literacy_activities"}, {"score": 0.006903950436245045, "phrase": "collaborative_design"}, {"score": 0.00481495049065317, "phrase": "teachers'_use"}, {"score": 0.004580188715162227, "phrase": "collaborative_design_activity"}, {"score": 0.00440838389264585, "phrase": "technological_pedagogical_content_knowledge"}, {"score": 0.00417730831828928, "phrase": "practical_concerns"}, {"score": 0.004119991676351513, "phrase": "main_question"}, {"score": 0.0038053333794618002, "phrase": "holistic_case_study"}, {"score": 0.0034227226677308337, "phrase": "seven_domains"}, {"score": 0.0034026280732569773, "phrase": "'pack_knowledge"}, {"score": 0.0027042399137782954, "phrase": "deeper_levels"}, {"score": 0.0025494865958495807, "phrase": "deeper_inquiry"}, {"score": 0.0025270481790815214, "phrase": "existing_orientations"}, {"score": 0.0024681707866449376, "phrase": "external_priorities"}, {"score": 0.002354489874233155, "phrase": "pck"}, {"score": 0.0022593125871715894, "phrase": "single_knowledge_domain"}, {"score": 0.002200164358389725, "phrase": "practical_implications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["TPACK", " Design talk", " Collaborative design", " ICT learning activities"], "paper_abstract": "Research shows the benefits of collaborative design activity by teachers are that in their conversations (design talk) they develop technological pedagogical content knowledge (TPACK). While more and more teachers engage in collaborative design, little is known about how they use TPACK during design. The main question of this study was: \"What is the nature of design talk of a group of teachers during the design of technology-rich early literacy activities?\" Using a holistic case study on design talk, the analysis focused on the topics that were under discussion and how these topics were discussed. Three phases of coding were applied: (a) how design represents any of the seven domains of 'PACK knowledge (Pedagogical, Content, Technological, Technological Pedagogical, Technological Content, Pedagogical Content or Technological Pedagogical Content Knowledge); (b), how design talk represented three aspects of reasoning (external priorities, practical concerns and existing orientations); and (c), and what levels of inquiry are reached (no-depth; sharing ideas; analyze; and plan). Findings indicate that design talk reflects moments in which teachers reach deeper levels of inquiry. Findings also indicate that TPACK was mostly linked to expressing practical concerns. However when engaging in deeper inquiry, teachers existing orientations featured more prominently in the conversations. External priorities hardly seemed to play any role in design talk. Also, when addressing TPACK or PCK, design talk mostly reflects practical concerns. Pedagogy was addressed not as a single knowledge domain, rather in conjunction with the other two domains. Practical implications are discussed regarding how to support teachers during collaborative design. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Exploring teachers' use of TPACK in design talk: The collaborative design of technology-rich early literacy activities", "paper_id": "WOS:000349723200021"}