{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "online_batch-based_digital_signature_schemes"}, {"score": 0.00467207889925365, "phrase": "important_type"}, {"score": 0.004195418010131832, "phrase": "internet_server"}, {"score": 0.004159446063902181, "phrase": "digital_signatures"}, {"score": 0.004053362743156545, "phrase": "high_cost"}, {"score": 0.0040186038781533946, "phrase": "modular_arithmetic"}, {"score": 0.003751011827704279, "phrase": "computed_digital_signatures"}, {"score": 0.0035620354052144656, "phrase": "smart_way"}, {"score": 0.0032398798149196432, "phrase": "extra_information"}, {"score": 0.00307657476125683, "phrase": "different_online_digital_signature_batching_schemes"}, {"score": 0.0027503564589458837, "phrase": "substantial_computational_benefits"}, {"score": 0.002668582249630492, "phrase": "significant_increases"}, {"score": 0.0026116610153271943, "phrase": "additional_information"}, {"score": 0.002448061472257196, "phrase": "potential_benefits"}, {"score": 0.0023855210798264205, "phrase": "proposed_analytical_framework"}, {"score": 0.0023548511815224098, "phrase": "semi-markov_model"}, {"score": 0.0023245746777044766, "phrase": "batch-based_digital_signature_server"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Performance evaluation", " Markov model", " Batch scheme", " Digital signature"], "paper_abstract": "A digital signature is an important type of authentication in a public-key (or asymmetric) cryptographic system, and it is widely used in many digital government applications. We, however, note that the performance of an Internet server computing digital signatures online is limited by the high cost of modular arithmetic. One simple way to improve the performance of the server is to reduce the number of computed digital signatures by combining a set of documents into a batch in a smart way and signing each batch only once. This approach could reduce the demand on the CPU but require more network bandwidth of sending extra information to clients. In this Paper, we investigate performance of different online digital signature batching schemes. That is, we provide a framework for studying as well as analyzing performance of a variety of such schemes. The results show that substantial computational benefits can be obtained from batching without significant increases in the amount of additional information that needs to be sent to the clients. Furthermore, we explore the potential benefits of considering more sophisticated batching schemes. The proposed analytical framework uses a semi-Markov model of a batch-based digital signature server. Through the emulation and the simulation, the results show the accuracy and effectiveness of our proposed analytic framework. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Performance study of online batch-based digital signature schemes", "paper_id": "WOS:000275132700004"}