{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mutual_information_expansion"}, {"score": 0.015187959628094683, "phrase": "population_codes"}, {"score": 0.009406354635737349, "phrase": "informational_contribution"}, {"score": 0.00847790776340893, "phrase": "new_formalism"}, {"score": 0.007841742985928825, "phrase": "count_autocorrelations"}, {"score": 0.004375613460102577, "phrase": "neural_populations"}, {"score": 0.004153041453795458, "phrase": "information_theory_framework"}, {"score": 0.003958937342925219, "phrase": "encoding_or_decoding_perspective"}, {"score": 0.003907586297783078, "phrase": "main_measures"}, {"score": 0.0036926236934657864, "phrase": "common_source"}, {"score": 0.0035974243349266894, "phrase": "mutual_information"}, {"score": 0.0032263862712733934, "phrase": "different_representation"}, {"score": 0.0031023662967184216, "phrase": "total_information"}, {"score": 0.0030223381739019894, "phrase": "individual_terms"}, {"score": 0.002918826667294298, "phrase": "series_expansion"}, {"score": 0.002663620639539737, "phrase": "exact_breakdown"}, {"score": 0.0025279105573394727, "phrase": "poisson_exact_breakdown"}, {"score": 0.0024842242921857705, "phrase": "poisson_equivalents"}, {"score": 0.0021049977753042253, "phrase": "useful_general_framework"}], "paper_keywords": [""], "paper_abstract": "The role of correlations in the activity of neural populations responding to a set of stimuli can be studied within an information theory framework. Regardless of whether one approaches the problem from an encoding or decoding perspective, the main measures used to study the role of correlations can be derived from a common source: the expansion of the mutual information. Two main formalisms of mutual information expansion have been proposed: the series expansion and the exact breakdown. Here we clarify that these two formalisms have a different representation of autocorrelations, so that even when the total information estimated differs by less than 1%, individual terms can diverge. More precisely, the series expansion explicitly evaluates the informational contribution of autocorrelations in the count of spikes, that is, count autocorrelations, whereas the exact breakdown does not. We propose a new formalism of mutual information expansion, the Poisson exact breakdown, which introduces Poisson equivalents in order to explicitly evaluate the informational contribution of count autocorrelations with no approximation involved. Because several widely employed manipulations of spike trains, most notably binning and pooling, alter the structure of count autocorrelations, the new formalism can provide a useful general framework for studying the role of correlations in population codes.", "paper_title": "Mutual Information Expansion for Studying the Role of Correlations in Population Codes: How Important Are Autocorrelations?", "paper_id": "WOS:000260113500004"}