{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "joint_explanations"}, {"score": 0.004760765880314089, "phrase": "logic_programming_formalization"}, {"score": 0.004039995317682942, "phrase": "interacting_agents"}, {"score": 0.0037532257703888315, "phrase": "reasoning_task"}, {"score": 0.002958281631770322, "phrase": "weighting_function"}, {"score": 0.0027480831196871093, "phrase": "different_agents"}, {"score": 0.0027017308406240563, "phrase": "different_and_possibly_contrasting_preferences"}, {"score": 0.0026113524778702624, "phrase": "agents'_agreement"}, {"score": 0.0024395426929046415, "phrase": "example_application"}, {"score": 0.0022405528759521856, "phrase": "data_management_issues"}, {"score": 0.002215274527909304, "phrase": "peer-to-peer_systems"}, {"score": 0.0021049977753042253, "phrase": "repair-based_semantics"}], "paper_keywords": [""], "paper_abstract": "An extension of abduction is investigated where explanations for bunches of observations may be jointly computed by sets of interacting agents. At one hand, agents are allowed to partially contribute to the reasoning task, so that joint explanations can be singled out even if each agent does not have enough knowledge for carrying out abduction on its own. At the other hand, agents maintain their autonomy in choosing explanations, each one being equipped with a weighting function reflecting its perception about the reliability of set of hypotheses. Given that different agents may have different and possibly contrasting preferences, some reasonable notions of agents' agreement are introduced, and their computational properties are thoroughly studied. As an example application of the framework discussed in the paper, it is shown how to handle data management issues in Peer-to-Peer systems and, specifically, how to provide a repair-based semantics to inconsistent ones.", "paper_title": "Solving abduction by computing joint explanations: Logic programming formalization, applications to P2P data integration, and cmplexity results", "paper_id": "WOS:000235837300008"}