{"auto_keywords": [{"score": 0.044589224351948675, "phrase": "angular_information"}, {"score": 0.00481495049065317, "phrase": "diffusive_feedback_influences"}, {"score": 0.00477190623242136, "phrase": "hierarchical_information_processing"}, {"score": 0.004708056866527125, "phrase": "visual_information_processing"}, {"score": 0.004603525341738782, "phrase": "secondary_visual_cortex"}, {"score": 0.0043619799095455415, "phrase": "oriented_bars"}, {"score": 0.003660788124282824, "phrase": "former_innervates"}, {"score": 0.0035794251590584563, "phrase": "preferred_orientation"}, {"score": 0.003113696267229798, "phrase": "clustered_feedback_projection"}, {"score": 0.003044455555031339, "phrase": "contour_integration"}, {"score": 0.002963390095037466, "phrase": "diffused_feedback_projection"}, {"score": 0.0026962411675196213, "phrase": "ongoing-spontaneous_subthreshold_membrane_oscillations"}, {"score": 0.0026009105281485888, "phrase": "reaction_time"}, {"score": 0.0024864612830452254, "phrase": "specific_angular_information"}, {"score": 0.0024311346712789553, "phrase": "feedback_influence"}, {"score": 0.0023033100935570755, "phrase": "ongoing-spontaneous_signaling"}, {"score": 0.0022218413146898887, "phrase": "diffusive_feedback_influence"}, {"score": 0.0021049977753042253, "phrase": "sensory_stimulation"}], "paper_keywords": [""], "paper_abstract": "In visual information processing, feedforward projection from primary to secondary visual cortex (V1-to-V2) is essential for integrating combinations of oriented bars in order to extract angular information embedded within contours that represent the shape of objects. For feedback (V2-to-V1) projection, two distinct types of pathways have been observed: clustered projection and diffused projection. The former innervates V1 domains with a preferred orientation similar to that of V2 cells of origin. In contrast, the latter innervates without such orientation specificity. V2 cells send their axons to V1 domains with both similar and dissimilar orientation preferences. It is speculated that the clustered feedback projection has a role in contour integration. The role of the diffused feedback projection, however, remains to be seen. We simulated a minimal, functional V1-V2 neural network model. The diffused feedback projection contributed to achieving ongoing-spontaneous subthreshold membrane oscillations in V1 cells, thereby reducing the reaction time of V1 cells to a pair of bars that represents specific angular information. Interestingly, the feedback influence took place even before V2 responses, which might stem largely from ongoing-spontaneous signaling from V2. We suggest that the diffusive feedback influence from V2 could act early in V1 responses and accelerate their reaction speed to sensory stimulation in order to rapidly extract angular information.", "paper_title": "Diffusive Feedback Influences on Hierarchical Information Processing", "paper_id": "WOS:000300040100008"}