{"auto_keywords": [{"score": 0.041078685670043524, "phrase": "software_engineers"}, {"score": 0.01386114782549018, "phrase": "social_software"}, {"score": 0.013537610286689736, "phrase": "adoption_process"}, {"score": 0.010685609653147032, "phrase": "new_se_processes"}, {"score": 0.00481495049065317, "phrase": "study_of_factors_influencing"}, {"score": 0.00466436022890899, "phrase": "wikis"}, {"score": 0.0043945048085683005, "phrase": "new_processes"}, {"score": 0.003588100032858716, "phrase": "collaborative_learning"}, {"score": 0.0031342307827666675, "phrase": "proposed_framework"}, {"score": 0.0030847461428168614, "phrase": "similar_ones"}, {"score": 0.0030000149283621255, "phrase": "junior_engineers"}, {"score": 0.002964415652865295, "phrase": "training_course"}, {"score": 0.0029409171055888804, "phrase": "agile_software_development"}, {"score": 0.002917604283241353, "phrase": "anonymous_surveys"}, {"score": 0.0028601252251285025, "phrase": "perceived_quality"}, {"score": 0.002381566880282456, "phrase": "new_process"}, {"score": 0.0023532890136269986, "phrase": "perceived_level"}, {"score": 0.0023069016803337365, "phrase": "tacit_knowledge"}, {"score": 0.002181813794658713, "phrase": "shared_knowledge"}, {"score": 0.0021049977753042253, "phrase": "new_tacit_knowledge"}], "paper_keywords": ["Process adoption", " social software", " tacit knowledge", " collaborative learning", " agile software development"], "paper_abstract": "The adoption of innovative Software Engineering (SE) processes by an organization implies that engineers have to learn new processes which they might not be familiar with. Social software can support and enhance this adoption process, so research needs to focus on how the exchange of knowledge among software engineers using these tools can help to perform training more effectively. We propose a framework based on social software to support the collaborative learning, adoption and improvement of SE processes through the exchange of experiences among individuals. This article examines factors influencing the adoption of new SE processes and the quality of the experiences shared using the proposed framework in comparison with similar ones. Two case studies were carried out involving junior engineers in a training course on agile software development. Anonymous surveys collected data on the perceived quality of the experiences shared during the research, their usefulness, and the simplicity of the mechanisms provided to contribute experiences. Results show that the adoption of new SE processes is influenced by several factors such as the commitment of software engineers to collaborate in the adoption of the new process, the perceived level of usefulness of the tacit knowledge elicited during the adoption process, the diversity of the topics covered by the shared knowledge, the simplicity of the mechanisms to contribute new tacit knowledge, and the amount of learning achieved by software engineers.", "paper_title": "Study of Factors Influencing the Adoption of Agile Processes When Using Wikis", "paper_id": "WOS:000343726500002"}