{"auto_keywords": [{"score": 0.04615579340759349, "phrase": "final_result"}, {"score": 0.029090787893708548, "phrase": "raw_data"}, {"score": 0.00481495049065317, "phrase": "janiform_intra-document"}, {"score": 0.004776608455951671, "phrase": "reproducible_research"}, {"score": 0.004751216062917875, "phrase": "peer-reviewed_publication"}, {"score": 0.004386063799793622, "phrase": "long_project"}, {"score": 0.004304963945457799, "phrase": "well-polished_graphs"}, {"score": 0.004136171721829075, "phrase": "input_datasets"}, {"score": 0.004092284451249823, "phrase": "raw_result_datasets"}, {"score": 0.003931798194574009, "phrase": "first_place"}, {"score": 0.0035527409334589317, "phrase": "long_workflow"}, {"score": 0.0034684348261345295, "phrase": "research_paper"}, {"score": 0.003377097707054532, "phrase": "entire_workflow"}, {"score": 0.0029868743007990333, "phrase": "portable_database_files"}, {"score": 0.0028543298631502107, "phrase": "standard_static_pdf"}, {"score": 0.0026986685585382347, "phrase": "olap-style_analysis"}, {"score": 0.00260657976055413, "phrase": "portable_document"}, {"score": 0.0025109106932691724, "phrase": "latex."}, {"score": 0.0024447258861321685, "phrase": "raw_measurement_data"}, {"score": 0.0024122895441506895, "phrase": "processing_steps"}, {"score": 0.002250415129116109, "phrase": "desktop_versions"}, {"score": 0.002104998402294158, "phrase": "virtualbox"}], "paper_keywords": [""], "paper_abstract": "Peer-reviewed publication of research papers is a cornerstone of science. However, one of the many issues of our publication culture is that our publications only publish a summary of the final result of a long project. This means that we put well-polished graphs describing (some) of our experimental results into our publications. However, the algorithms, input datasets, benchmarks, raw result datasets, as well as scripts that were used to produce the graphs in the first place are rarely published and typically not available to other researchers. Often they are only available when personally asking the authors. In many cases, however, they are not available at all. This means from a long workflow that led to producing a graph for a research paper, we only publish the final result rather than the entire workflow. This is unfortunate and has been criticized in various scientific communities. In this demo we argue that one part of the problem is our dated view on what a \"document\" and hence \"a publication\" is, should, and can be. As a remedy, we introduce portable database files (PDbF). These files are janiform, i.e. they are at the same time a standard static pdf as well as a highly dynamic (offline) HTML-document. PDbFs allow you to access the raw data behind a graph, perform OLAP-style analysis, and reproduce your own graphs from the raw data all of this within a portable document. We demo a tool allowing you to create PDbFs smoothly from within LATEX. This tool allows you to preserve the workflow of raw measurement data to its final graphical output through all processing steps. Notice that this pdf already showcases our technology: rename this file to \".html\" and see what happens (currently we support the desktop versions of Firefox, Chrome, and Safari). But please: do not try to rename this file to \".ova\" and mount it in VirtualBox.", "paper_title": "Janiform Intra-Document Analytics for Reproducible Research", "paper_id": "WOS:000386424800079"}