{"auto_keywords": [{"score": 0.049596205816074254, "phrase": "domain_experts"}, {"score": 0.046793532854124374, "phrase": "active_learning"}, {"score": 0.00481495049065317, "phrase": "generalized_queries"}, {"score": 0.004530794611704416, "phrase": "domain_expert"}, {"score": 0.004198965651975536, "phrase": "accurate_classifier"}, {"score": 0.004114641015648682, "phrase": "previous_works"}, {"score": 0.00395101799538683, "phrase": "specific_queries"}, {"score": 0.0038913443732432468, "phrase": "real-world_applications"}, {"score": 0.0036245239349157236, "phrase": "\"generalized_queries"}, {"score": 0.003569763795153386, "phrase": "don't-care_attributes"}, {"score": 0.003258090521354736, "phrase": "general_queries"}, {"score": 0.0027000395818027366, "phrase": "good_generalized_queries"}, {"score": 0.0024392031587145728, "phrase": "significantly_fewer_queries"}, {"score": 0.0023183698048498797, "phrase": "initial_labeled_data_set"}, {"score": 0.0021923400552366756, "phrase": "class_probability_estimations"}, {"score": 0.0021049977753042253, "phrase": "real-world_data_mining_tasks"}], "paper_keywords": ["Active learning", " domain expert", " generalized query"], "paper_abstract": "With the assistance of a domain expert, active learning can often select or construct fewer examples to request their labels to build an accurate classifier. However, previous works of active learning can only generate and ask specific queries. In real-world applications, the domain experts (or oracles) are often more readily to answer \"generalized queries\" with don't-care attributes. The power of such generalized queries is that one generalized query is often equivalent to many specific ones. However, overly general queries are not good as answers from the domain experts (or oracles) can be highly uncertain, and this makes learning difficult. In this paper, we propose a novel active learning algorithm that asks good generalized queries. We, then, extend our algorithm to construct new, hierarchical features for both nominal and numeric attributes. We demonstrate experimentally that our new method asks significantly fewer queries compared with the previous works of active learning, even when the initial labeled data set is very small, and the oracle is inaccurate in class probability estimations. Our method can be readily deployed in real-world data mining tasks where obtaining labeled examples is costly.", "paper_title": "Asking Generalized Queries to Domain Experts to Improve Learning", "paper_id": "WOS:000276801300006"}