{"auto_keywords": [{"score": 0.04325859731194569, "phrase": "data_stream"}, {"score": 0.03945629000021421, "phrase": "frequent_itemsets"}, {"score": 0.00481495049065317, "phrase": "data_streams"}, {"score": 0.004678940805063634, "phrase": "technical_improvements"}, {"score": 0.004634459424542272, "phrase": "storage_devices"}, {"score": 0.003429544382524185, "phrase": "finite_memory_space"}, {"score": 0.0033166379485150507, "phrase": "appropriate_method"}, {"score": 0.003087017178815267, "phrase": "total_aggregation_values"}, {"score": 0.0029711052657054463, "phrase": "novel_algorithm"}, {"score": 0.0029147869733574844, "phrase": "relative_frequent_itemsets"}, {"score": 0.0026999603129904902, "phrase": "frequent_items"}, {"score": 0.0026742419973883134, "phrase": "sub-frequent_items"}, {"score": 0.002611010097359509, "phrase": "limited_memory"}, {"score": 0.002512926336312949, "phrase": "time_variant_frequent_items"}, {"score": 0.0024534993283766332, "phrase": "proposed_technique"}, {"score": 0.0021049977753042253, "phrase": "limited_memory_space"}], "paper_keywords": ["data stream", " frequent itemsets", " data mining"], "paper_abstract": "Recently, due to technical improvements of storage devices and networks, the amount of data increases rapidly. In addition, it is required to find the knowledge embedded in a data stream as fast as possible. Data stream is influenced by time. Therefore, the itemsets which were not the frequent itemsets can become frequent itemsets. The volume of data stream is so large that it can hardly be stored in finite memory space. Current researches do not offer appropriate method to find frequent itemsets in which flow of time is reflected but provide only frequent items using total aggregation values. In this paper we propose a novel algorithm for finding the relative frequent itemsets according to the time in a data stream. We also propose a method to save frequent items and sub-frequent items in order to take limited memory into account and a method to update time variant frequent items. By applying the proposed technique, we can improve the accuracy of searching for a change in the frequent itemsets according to the time in a data stream. Moreover, it will be able to use the limited memory space efficiently and store all frequent itemsets.", "paper_title": "Search method of time sensitive frequent itemsets in data streams", "paper_id": "WOS:000241598400053"}