{"auto_keywords": [{"score": 0.03916921946728104, "phrase": "equationally-defined_equality"}, {"score": 0.015052078478730834, "phrase": "algebraic_specifications"}, {"score": 0.00481495049065317, "phrase": "modulo_axioms"}, {"score": 0.004779876533667754, "phrase": "built-in_equality"}, {"score": 0.004642105253191792, "phrase": "canonical_forms"}, {"score": 0.0043147264956783565, "phrase": "initial_algebra_semantics"}, {"score": 0.004099340908974491, "phrase": "explicit_or_inductionless_induction_techniques"}, {"score": 0.003995697901740734, "phrase": "key_properties"}, {"score": 0.0038804410204616954, "phrase": "sufficient_completeness"}, {"score": 0.0037684961730030235, "phrase": "formal_analysis"}, {"score": 0.0036731870109004993, "phrase": "algebraic_data_types"}, {"score": 0.0033890026927890058, "phrase": "inductive_theorem"}, {"score": 0.0032671775301001483, "phrase": "theory_transformation"}, {"score": 0.0031382058937207413, "phrase": "algebraic_specification_epsilon"}, {"score": 0.002895291306821514, "phrase": "broad_class"}, {"score": 0.002690771424958613, "phrase": "modulo_axioms_b"}, {"score": 0.0024284249875593253, "phrase": "free_modulo"}, {"score": 0.0023756164484983874, "phrase": "transformation_epsilon_bar"}, {"score": 0.0022321356208648826, "phrase": "maude"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Equality predicate", " Order-sorted equational logic modulo axioms", " Algebraic specifications", " Initial algebra semantics", " Maude"], "paper_abstract": "Built-in equality and inequality predicates based on comparison of canonical forms in algebraic specifications are frequently used because they are handy and efficient. However, their use places algebraic specifications with initial algebra semantics beyond the pale of theorem proving tools based, for example, on explicit or inductionless induction techniques, and of other formal tools for checking key properties such as confluence, termination, and sufficient completeness. Such specifications would instead be amenable to formal analysis if an equationally-defined equality predicate enriching the algebraic data types were to be added to them. Furthermore, having an equationally-defined equality predicate is very useful in its own right, particularly in inductive theorem proving. Is it possible to effectively define a theory transformation epsilon bar right arrow epsilon(similar to) that extends an algebraic specification epsilon to a specification epsilon(similar to) having an equationally-defined equality predicate? This paper answers this question in the affirmative for a broad class of order-sorted conditional specifications epsilon that are sort-decreasing, ground confluent, and operationally terminating modulo axioms B and have a subsignature of constructors. The axioms B can consist of associativity, or commutativity, or associativity-commutativity axioms, so that the constructors are free modulo B. We prove that the transformation epsilon bar right arrow epsilon(similar to) preserves all the just-mentioned properties of epsilon. The transformation has been automated in Maude using reflection and is used as a component in many Maude formal tools. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Order-sorted equality enrichments modulo axioms", "paper_id": "WOS:000348959900008"}