{"auto_keywords": [{"score": 0.013696092941818385, "phrase": "learning_paths"}, {"score": 0.011207791256079241, "phrase": "pragmatic_quality"}, {"score": 0.004645057834614705, "phrase": "suitable_ways"}, {"score": 0.004582897918101983, "phrase": "particular_learning_goals"}, {"score": 0.00450130420152996, "phrase": "easy_task"}, {"score": 0.004421156723819163, "phrase": "initial_education"}, {"score": 0.00438161736774803, "phrase": "lifelong_learning"}, {"score": 0.004041238873048836, "phrase": "formal_and_uniform_way"}, {"score": 0.003951453722517865, "phrase": "learning_path_specification"}, {"score": 0.0030036501770192865, "phrase": "first-order_and_second-order_pragmatic_quality"}, {"score": 0.0028076592725295646, "phrase": "first-order_pragmatic_quality"}, {"score": 0.0025316254589087973, "phrase": "second-order_pragmatic_quality"}, {"score": 0.0024864612830452254, "phrase": "workshop_sessions"}, {"score": 0.0021723899772112423, "phrase": "-user_evaluations"}], "paper_keywords": ["learning path specification", " evaluation", " pragmatic quality", " usability", " desirability"], "paper_abstract": "Finding suitable ways to achieve particular learning goals is not an easy task, both in initial education and lifelong learning. To facilitate selection, personalisation and navigation of learning paths we propose to describe learning paths in a formal and uniform way by means of a learning path specification. This paper explains the rationale behind the Learning Path Specification. Based on a framework developed for the evaluation of the specification the paper describes a study that was carried out to establish pragmatic quality, i.e. whether stakeholders can understand and use the specification. The paper explores the relationship between the concepts pragmatic quality, usability, and desirability, and distinguishes first-order and second-order pragmatic quality, relating it to different stakeholders: software developers and end-users. First-order pragmatic quality of the Learning Path Specification was evaluated during the process of developing a tool that describes learning paths according to the specification: the Learning Path Editor. Second-order pragmatic quality was evaluated through workshop sessions with end-users involving some hands-on experiences with this tool. The paper describes adaptations made to the specification in the process of developing the Editor. End-user evaluations were quite positive, leading to one more adaptation.", "paper_title": "Assessing the Learning Path Specification: a Pragmatic Quality Approach", "paper_id": "WOS:000289720900002"}