{"auto_keywords": [{"score": 0.047757412970608114, "phrase": "term_integration"}, {"score": 0.041034036961577, "phrase": "technical_papers"}, {"score": 0.00439918275666155, "phrase": "academic_and_trade_literature"}, {"score": 0.004223941453664225, "phrase": "findings_-_integration"}, {"score": 0.004037370832877034, "phrase": "enterprise_applications"}, {"score": 0.0038764861784138117, "phrase": "e-mail_messages"}, {"score": 0.003755782496223915, "phrase": "even_causal_conversations"}, {"score": 0.003671865026158296, "phrase": "project_work"}, {"score": 0.002955533639862811, "phrase": "meaningful_conversation"}, {"score": 0.0029025435402480326, "phrase": "multiple_alternative_definitions"}, {"score": 0.0027741761880779535, "phrase": "appropriate_context"}, {"score": 0.0025341792091114184, "phrase": "new_definitions"}, {"score": 0.0023148964315569866, "phrase": "key_term"}, {"score": 0.002252880693912436, "phrase": "information_systems_research"}, {"score": 0.0021049977753042253, "phrase": "enterprise_system_implementation"}], "paper_keywords": ["integration", " interface management", " applications", " information systems", " research"], "paper_abstract": "Purpose - This paper aims to provide a clarification of the meaning of the term integration. Design/methodology/approach - A taxonomy of integration definitions derived from the academic and trade literature is developed, analyzed, and documented. Findings - Integration is a word that is commonly used when discussing enterprise applications. The term integration is inserted in technical papers, e-mail messages, correspondence, proposals, and even causal conversations. After many years of project work, and many misunderstandings and failed meetings and workshops, it can only be stated that the word has multiple and misunderstood meanings. For technical papers (research and trade), the term must be provided with context, or it is impossible to have a meaningful conversation. Next, multiple alternative definitions (that are valid in the literature for the appropriate context) are presented and explained in some detail. Research limitations/implications - The paper is not exhaustive, since new definitions of integration may exist or may emerge. Originality/value - The main contribution of the paper is that it yields clarity on a key term that is frequently used in information systems research. The paper is useful to any researchers or practitioners who are focused on enterprise system implementation.", "paper_title": "What is integration?", "paper_id": "WOS:000237547900001"}