{"auto_keywords": [{"score": 0.044464625495560656, "phrase": "large_organisations"}, {"score": 0.02310452206554186, "phrase": "software_acquisition"}, {"score": 0.00481495049065317, "phrase": "buy'_decision"}, {"score": 0.00476323161560059, "phrase": "small_to_medium_enterprises"}, {"score": 0.004674050471183959, "phrase": "computing_and_communication_technologies"}, {"score": 0.004586531354697466, "phrase": "sophisticated_and_highly_specialised_software_packages"}, {"score": 0.004512814529823301, "phrase": "package_acquisition"}, {"score": 0.00427550604912774, "phrase": "software_acquisition_method"}, {"score": 0.004007083686875716, "phrase": "decision_process"}, {"score": 0.00378602209193448, "phrase": "sme_decision_process"}, {"score": 0.003685067218455088, "phrase": "policy_makers"}, {"score": 0.003635600104609725, "phrase": "appropriate_guidelines"}, {"score": 0.0036159990127332315, "phrase": "sme_software_acquisition"}, {"score": 0.003567455727660992, "phrase": "positivist_research_perspective"}, {"score": 0.0034723086467062774, "phrase": "eight_smes"}, {"score": 0.0034535872751193823, "phrase": "thailand"}, {"score": 0.003370565320453525, "phrase": "potential_factors"}, {"score": 0.0029682730383686524, "phrase": "strategic_role"}, {"score": 0.002928399649340438, "phrase": "intellectual_property_concerns"}, {"score": 0.0028043588777213533, "phrase": "free_download"}, {"score": 0.002578745296475411, "phrase": "long-term_vision"}, {"score": 0.0025578967205807843, "phrase": "larger_organisations"}, {"score": 0.00233936726307301, "phrase": "smes'_core_business_processes"}, {"score": 0.0022402205906737883, "phrase": "technological_intensity"}, {"score": 0.002210119414514745, "phrase": "sme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software acquisition", " SME", " Thailand", " Buy vs. build", " Software package", " In-house development"], "paper_abstract": "Context: The prevalence of computing and communication technologies, combined with the availability of sophisticated and highly specialised software packages from software vendors has made package acquisition a viable option for many organisations. While some research has addressed the factors that influence the selection of the software acquisition method in large organisations, little is known about the factors affecting SMEs. Objective: To provide an understanding of factors that affect the decision process of software acquisition for SMEs. It is expected that results from this study: (i) will assist the SME decision process for software acquisition, and (ii) will assist policy makers in terms of developing appropriate guidelines for SME software acquisition. Method: A positivist research perspective has been adopted involving semi-structured interviews in eight SMEs in Thailand with the interviewees assigning to each of the potential factors. Results: The study found that the following factors affect both SMEs and large organisations: requirements fit, cost, scale and complexity, commoditization/flexibility, time, in-house experts, support structure, and operational factors. Factors mainly applying to large organisations were strategic role of the software, intellectual property concerns, and risk, Factors particularly relevant to SMEs (ubiquitous systems, availability of free download, and customizable to specific government/tax regulations). Conclusion: The results suggest that: (i) when deciding on their software acquisition method, SMEs are generally less likely to pursue a long-term vision compared with larger organisations, possibly because SMEs mainly serve their local markets; and (ii) contrary to the large organisations, the role that the IT plays in SMEs may not be as vital to the SMEs' core business processes, to their supply chains, and/or to the management of their customer relationship. Furthermore, neither the level of technological intensity nor size of the SME appears to affect the ranks given by the interviewees for the various factors. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "An investigation of 'build vs. buy' decision for software acquisition by small to medium enterprises", "paper_id": "WOS:000323298000005"}