{"auto_keywords": [{"score": 0.04274518365190484, "phrase": "erased_symbols"}, {"score": 0.03922006318294902, "phrase": "parity-check_matrices"}, {"score": 0.02665097119789355, "phrase": "separating_redundancies"}, {"score": 0.004772137871562584, "phrase": "linear_codes"}, {"score": 0.004009074013302036, "phrase": "resulting_vector"}, {"score": 0.003920476803132283, "phrase": "punctured_code"}, {"score": 0.0037658881407605445, "phrase": "correctable_erasures"}, {"score": 0.0033525843225012918, "phrase": "punctured_codes"}, {"score": 0.003293142761521425, "phrase": "maximum_number"}, {"score": 0.002931569771634119, "phrase": "decoding_complexity"}, {"score": 0.0027659126653647712, "phrase": "minimum_number"}, {"score": 0.0027047136845332917, "phrase": "parity-check_matrix"}, {"score": 0.002563484440422013, "phrase": "upper"}, {"score": 0.0025404470150468387, "phrase": "lower_bounds"}, {"score": 0.0022613292987262177, "phrase": "full-rank_parity-check_matrices"}, {"score": 0.0021049977753042253, "phrase": "maximum_numbers"}], "paper_keywords": ["Error and erasure decoding", " linear block code", " parity-check matrix", " separating matrix", " separating redundancy"], "paper_abstract": "Most decoding algorithms of linear codes, in general, are designed to correct or detect errors. However, many channels cause erasures in addition to errors. In principle, decoding over such channels can be accomplished by deleting the erased symbols and decoding the resulting vector with respect to a punctured code. For any given linear code and any given maximum number of correctable erasures, parity-check matrices are introduced that yield parity-check equations which do not check any of the erased symbols and which are sufficient to characterize all punctured codes corresponding to this maximum number of erasures. These matrices allow for the separation of erasures from errors to facilitate decoding. Several constructions of such separating parity-check matrices are presented. To reduce decoding complexity, separating parity-check matrices with small number of rows are preferred. The minimum number of rows in a parity-check matrix separating a given maximum number of erasures is called the separating redundancy. Upper and lower bounds on the separating redundancies are derived. In particular, it is shown that the separating redundancies tend to grow linearly with the number of rows in full-rank parity-check matrices of codes. The separating redundancies of some classes of codes are determined for some maximum numbers of erasures.", "paper_title": "Parity-Check Matrices Separating Erasures From Errors", "paper_id": "WOS:000320709800007"}