{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "tiled_display"}, {"score": 0.004718897469501381, "phrase": "visual_interface"}, {"score": 0.004245051445971095, "phrase": "main_point"}, {"score": 0.00418134346679498, "phrase": "optiputer_project"}, {"score": 0.0037423521744765075, "phrase": "collaborative_sharing"}, {"score": 0.0036861605703168397, "phrase": "extremely_high-resolution"}, {"score": 0.003558294449586273, "phrase": "video_streams"}, {"score": 0.0032006150973842846, "phrase": "appropriately_sized_cluster"}, {"score": 0.0031208772639433145, "phrase": "optimized_graphics_processors"}, {"score": 0.0030895394261534776, "phrase": "network_interface_cards"}, {"score": 0.0026023381988430666, "phrase": "graphic_processing"}, {"score": 0.0024617483174454113, "phrase": "user_interfaces"}, {"score": 0.0023287359930308864, "phrase": "office_conference_room"}, {"score": 0.0022478501955483007, "phrase": "design_decisions"}, {"score": 0.0021917966722180132, "phrase": "replicable_tiled_display"}, {"score": 0.0021263705039915198, "phrase": "computational_science_researchers"}], "paper_keywords": [""], "paper_abstract": "The OptIPortal is a tiled display that is the visual interface to the OptIPuter, a global-scale computing system tied together by tens of gigabits of networking. The main point of the OptIPuter project is to examine a \"future\" in which networking is riot a bottleneck to local, regional, national and international computing. OptIPortals are designed to allow collaborative sharing over 1-10 gigabit/second networks of extremely high-resolution graphic output, as well as video streams. OptIPortals typically consist of an array of 4 to 70 LCD display panels (either 2-megapixel or 4-megapixel each), driven by an appropriately sized cluster of PCs, with optimized graphics processors and network interface cards. Rather than exist as one-of-a-kind laboratory prototypes, OptIPortals are designed to be openly and widely replicated, balancing the state of the art of PCs, graphic processing, networks, servers, software, middleware, and user interfaces, and installed in the context of a laboratory or office conference room. Discussed in detail are the design decisions made to achieve a replicable tiled display that can be built by computational science researchers in various disciplines. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "The OptIPortal, a scalable visualization, storage, and computing interface device for the OptiPuter", "paper_id": "WOS:000260316100002"}