{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "k_nearest_references"}, {"score": 0.004534781689048701, "phrase": "exhaustive_searching"}, {"score": 0.004511200093569568, "phrase": "data_structures"}, {"score": 0.004293175778663009, "phrase": "well-known_problem"}, {"score": 0.004215523385221752, "phrase": "sufficiently_concentrated_distance_histograms"}, {"score": 0.004150078386577378, "phrase": "exhaustive_scan"}, {"score": 0.004011731408358129, "phrase": "approximate_proximity"}, {"score": 0.003604793006510814, "phrase": "-recent_indexes"}, {"score": 0.003530323168993377, "phrase": "simple_general_model"}, {"score": 0.0035027939300676875, "phrase": "k-nearest_reference_signatures"}, {"score": 0.0033159875234063715, "phrase": "k_references"}, {"score": 0.0032559521297271165, "phrase": "query_time"}, {"score": 0.003010690672453098, "phrase": "different_ways"}, {"score": 0.002971643395896087, "phrase": "signature_records"}, {"score": 0.002910215315245169, "phrase": "nearest_references"}, {"score": 0.002587542884228226, "phrase": "space-efficient_representation"}, {"score": 0.0024946288445796307, "phrase": "main_memory"}, {"score": 0.002481629924770927, "phrase": "small_indexes"}, {"score": 0.0024430371692379807, "phrase": "faster_queries"}, {"score": 0.002417641863173041, "phrase": "exhaustive_experiments"}, {"score": 0.0023491545128442874, "phrase": "memory_usage"}, {"score": 0.002300564468380128, "phrase": "best_indexes"}, {"score": 0.002241234633963619, "phrase": "attractive_balance"}, {"score": 0.002189144254248724, "phrase": "excellent_choices"}, {"score": 0.0021550902258886512, "phrase": "high_flexibility"}, {"score": 0.002138261955387411, "phrase": "new_indexes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Proximity search", " Searching by content in multimedia databases", " k nearest neighbors", " Indexing metric spaces"], "paper_abstract": "Proximity searching is the problem of retrieving, from a given database, those objects closest to a query. To avoid exhaustive searching, data structures called indexes are built on the database prior to serving queries. The curse of dimensionality is a well-known problem for indexes: in spaces with sufficiently concentrated distance histograms, no index outperforms an exhaustive scan of the database. In recent years, a number of indexes for approximate proximity searching have been proposed. These are able to cope with the curse of dimensionality in exchange for returning an answer that might be slightly different from the correct one. In this paper we show that many of those-recent indexes can be understood as variants of a simple general model based on K-nearest reference signatures. A set of references is chosen from the database, and the signature of each object consists of the K references nearest to the object. At query time, the signature of the query is computed and the search examines only the objects whose signature is close enough to that of the query. Many known and novel indexes are obtained by considering different ways to determine how much detail the signature records (e.g., just the set of nearest references, or also their proximity order to the object, or also their distances to the object, and so on), how the similarity between signatures is defined, and how the parameters are tuned. In addition, we introduce a space-efficient representation for those families of indexes, making it possible to search very large databases in main memory. Small indexes are cache friendly, inducing faster queries. We perform exhaustive experiments comparing several known and new indexes that derive from our framework, evaluating their time performance, memory usage, and quality of approximation. The best indexes outperform the state of the art, offering an attractive balance between all these aspects, and turn out to be excellent choices in many scenarios. Our framework gives high flexibility to design new indexes. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Near neighbor searching with K nearest references", "paper_id": "WOS:000353608600003"}