{"auto_keywords": [{"score": 0.049826799506450456, "phrase": "grid_applications"}, {"score": 0.04561121804351399, "phrase": "resource_availability"}, {"score": 0.015723478478410016, "phrase": "execution_time"}, {"score": 0.007681099881018162, "phrase": "feasible_schedules"}, {"score": 0.00481495049065317, "phrase": "resource_allocation"}, {"score": 0.004739296614044257, "phrase": "coordinated_resource_sharing"}, {"score": 0.004677156273012756, "phrase": "heterogeneous_dynamic_environments"}, {"score": 0.0045432874466228915, "phrase": "large_amounts"}, {"score": 0.004436600597150948, "phrase": "resource_ownership"}, {"score": 0.004413233203505802, "phrase": "grid_schedulers"}, {"score": 0.0041531569169503905, "phrase": "central_controller"}, {"score": 0.0037564875159378217, "phrase": "resource_demands"}, {"score": 0.003451885004220209, "phrase": "reasonable_amount"}, {"score": 0.003265496457422804, "phrase": "network_link_availability"}, {"score": 0.003138536320618019, "phrase": "migrating_codes"}, {"score": 0.00281606583659932, "phrase": "task_scheduling"}, {"score": 0.002801209717483437, "phrase": "resource_monitoring"}, {"score": 0.0025806855118648245, "phrase": "especially_network_bandwidth_availability"}, {"score": 0.002553522044312533, "phrase": "task_migration"}, {"score": 0.002533336762815037, "phrase": "proposed_procedure"}, {"score": 0.002447690434073436, "phrase": "additional_contribution"}, {"score": 0.0023215332766056526, "phrase": "schedule_length"}, {"score": 0.0023092800159571773, "phrase": "computational_complexity"}, {"score": 0.002291021003411208, "phrase": "distinguishing_aspect"}, {"score": 0.00223119159012786, "phrase": "time_requirements"}, {"score": 0.0021500404803297397, "phrase": "task_dependencies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["grid networks", " task scheduling", " reactive scheduling", " task migration"], "paper_abstract": "Grids involve coordinated resource sharing and problem solving in heterogeneous dynamic environments to meet the needs of a generation of researchers requiring large amounts of bandwidth and more powerful computational resources. The lack of resource ownership by grid schedulers and fluctuations in resource availability require mechanisms which will enable grids to adjust themselves to cope with fluctuations. The lack of a central controller implies a need for self-adaptation. Grids must thus be enabled with the ability to discover, monitor and manage the use of resources so they can operate autonomously. Two different approaches have been conceived to match the resource demands of grid applications to resource availability: Dynamic scheduling and adaptive scheduling. However, these two approaches fail to address at least one of three important issues: (i) the production of feasible schedules in a reasonable amount of time in relation to that required for the execution of an application; (ii) the impact of network link availability on the execution time of an application; and (iii) the necessity of migrating codes to decrease the execution time of an application. To overcome these challenges, this paper proposes a procedure for enabling grid applications, composed of various dependent tasks, to deal with the availability of hosts and links bandwidth. This procedure involves task scheduling, resource monitoring and task migration, with the goal of decreasing the execution time of grid applications. The procedure differs from other approaches in the literature because it constantly considers changes in resource availability, especially network bandwidth availability, to trigger task migration. The proposed procedure is illustrated via simulation using various scenarios involving fluctuation of resource availability. An additional contribution of this paper is the introduction of a set of schedulers offering solutions which differ in terms of both schedule length and computational complexity. The distinguishing aspect of this set of schedulers is the consideration of time requirements in the production of feasible schedules. Performance is then evaluated considering various network topologies and task dependencies. (C) 2008 Published by Elsevier B.V.", "paper_title": "Self-adjustment of resource allocation for grid applications", "paper_id": "WOS:000257012600007"}