{"auto_keywords": [{"score": 0.04565922187614431, "phrase": "statistical_topics"}, {"score": 0.039108224572764555, "phrase": "animation_package"}, {"score": 0.03549747445634326, "phrase": "pdf_document"}, {"score": 0.00481495049065317, "phrase": "animated_graphs"}, {"score": 0.004763565662615503, "phrase": "statistical_ideas"}, {"score": 0.004324985524216987, "phrase": "iterative_algorithms"}, {"score": 0.004294145092032327, "phrase": "random_simulations"}, {"score": 0.004233119608341877, "phrase": "dynamic_trends"}, {"score": 0.003926626018798576, "phrase": "r_package_animation"}, {"score": 0.00347657813672945, "phrase": "web_page"}, {"score": 0.0034394269654205094, "phrase": "gif_animation"}, {"score": 0.0034026714408341868, "phrase": "flash_movie"}, {"score": 0.003034158379493625, "phrase": "web_applications"}, {"score": 0.0025822818714499795, "phrase": "statistical_reports"}, {"score": 0.002563836623100464, "phrase": "sweave"}, {"score": 0.0022615046141708987, "phrase": "real_time"}, {"score": 0.0021975548867457623, "phrase": "adobe_reader"}, {"score": 0.0021049977753042253, "phrase": "traditional_static_approaches"}], "paper_keywords": ["animation", " statistical demonstration", " simulation", " web application", " reproducible research", " R"], "paper_abstract": "Animated graphs that demonstrate statistical ideas and methods can both attract interest and assist understanding. In this paper we first discuss how animations can be related to some statistical topics such as iterative algorithms, random simulations, (re)sampling methods and dynamic trends, then we describe the approaches that may be used to create animations, and give an overview to the R package animation, including its design, usage and the statistical topics in the package. With the animation package, we can export the animations produced by R into a variety of formats, such as a web page, a GIF animation, a Flash movie, a PDF document, or an MP4/AVI video, so that users can publish the animations fairly easily. The design of this package is flexible enough to be readily incorporated into web applications, e.g., we can generate animations online with Rweb, which means we do not even need R to be installed locally to create animations. We will show examples of the use of animations in teaching statistics and in the presentation of statistical reports using Sweave or knitr. In fact, this paper itself was written with the knitr and animation package, and the animations are embedded in the PDF document, so that readers can watch the animations in real time when they read the paper (the Adobe Reader is required). Animations can add insight and interest to traditional static approaches to teaching statistics and reporting, making statistics a more interesting and appealing subject.", "paper_title": "animation: An R Package for Creating Animations and Demonstrating Statistical Methods", "paper_id": "WOS:000318236500001"}