{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dynamic_wildfire_risk_assessment"}, {"score": 0.004776292474110873, "phrase": "italy"}, {"score": 0.004366808573435364, "phrase": "dynamic_wildland_fire_risk"}, {"score": 0.004313793774439379, "phrase": "whole_italian_territory"}, {"score": 0.004124831019063503, "phrase": "static_information"}, {"score": 0.00407474190126995, "phrase": "vegetation_cover"}, {"score": 0.0039280803011236395, "phrase": "dynamic_information"}, {"score": 0.0038645966233348933, "phrase": "meteorological_forecast"}, {"score": 0.003725470458263889, "phrase": "limited_area_model"}, {"score": 0.003680212979775528, "phrase": "risk_distribution_assessment"}, {"score": 0.0032967724149749853, "phrase": "time_interval"}, {"score": 0.0027441711627551064, "phrase": "overall_system"}, {"score": 0.0025499307228648883, "phrase": "careful_calibration"}, {"score": 0.002398583143633567, "phrase": "preliminary_calibration"}, {"score": 0.0022287497627555895, "phrase": "presented_risk_assessment_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["wildfires", " risk assessment", " fuel moisture model", " forecasting", " decision support", " civil protection"], "paper_abstract": "In this paper, the architecture and the application of a system designed for the assessment of the distribution of dynamic wildland fire risk over the whole Italian territory are presented. Such an assessment takes place on the basis of static information concerning the vegetation cover and the topography of the territory and of dynamic information consisting of the meteorological forecast, over a certain time horizon, provided by a Limited Area Model. The risk distribution assessment is obtained through the use of two different models, namely the fuel moisture model and the potential fire spread model, which are applied, at each time interval, for each of the cells in which the area of study is discretized. In this paper, the structure of such models is presented in detail, and similarities and differences with respect to other existing models are discussed. As the performance of the overall system is heavily dependent on the choice of the values of the parameters appearing in such models, a careful calibration of such parameters is needed. In this respect, the results provided by a preliminary calibration are presented, carried out with the objective of maximizing the accordance between the outputs of the presented risk assessment system and the information relevant to really occurred fires. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Development and application of a system for dynamic wildfire risk assessment in Italy", "paper_id": "WOS:000254144000002"}