{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "customer_behavior"}, {"score": 0.004785022360244881, "phrase": "purpose_-_the_purpose"}, {"score": 0.004623696669036629, "phrase": "engagement_platforms"}, {"score": 0.004197599791067716, "phrase": "online_cues"}, {"score": 0.004018212085786494, "phrase": "engagement_platform"}, {"score": 0.003993216345115755, "phrase": "customer_co-creation_experiences"}, {"score": 0.0038464610418635892, "phrase": "co-creation_experience"}, {"score": 0.003822529597443667, "phrase": "customer's_purchase_intentions"}, {"score": 0.0037633479183921677, "phrase": "online_platform"}, {"score": 0.0037050791019670325, "phrase": "purchase_situation"}, {"score": 0.0033424156234057494, "phrase": "available_cues"}, {"score": 0.0032906426750021153, "phrase": "direct_experience"}, {"score": 0.0032094634756436595, "phrase": "structural_equation_modeling_analyses"}, {"score": 0.003149891887446744, "phrase": "hypothesized_relationships"}, {"score": 0.00294993976383467, "phrase": "co-creation_experience_possibilities"}, {"score": 0.0028951712636442906, "phrase": "online_purchase"}, {"score": 0.002652693384545025, "phrase": "virtual_engagement_platforms"}, {"score": 0.0026361695237709874, "phrase": "touch_points"}, {"score": 0.0024380811094377006, "phrase": "collaborative_relationships"}, {"score": 0.0023778841785229835, "phrase": "purchase_experience"}, {"score": 0.0023264294945973623, "phrase": "growing_interest"}, {"score": 0.0021991611806433634, "phrase": "it-related_service"}, {"score": 0.0021248309394183945, "phrase": "online_purchase_experience"}, {"score": 0.0021049977753042253, "phrase": "co-creation_context"}], "paper_keywords": ["C2C interactions", " Co-creation experience", " Coproduction", " Engagement platforms", " Online cues", " Online purchase"], "paper_abstract": "Purpose - The purpose of this paper is to elaborate on the concept of engagement platforms and the theories of co-creation of value to analyze the purchase as a context for customers to co-create their own experiences. Specifically, the paper proposes that including online cues related to Customer to customer (C2C) interactions and coproduction in the engagement platform determines customer co-creation experiences. Moreover, the paper tests for the relationship between the co-creation experience and customer's purchase intentions. Design/methodology/approach - An online platform was designed and a purchase situation was simulated, in which the participants were asked to buy a pair of sneakers. To make the experience more realistic, participants could navigate and undertake activities related to the available cues, thus obtaining a direct experience of the possibilities of the platform. Structural equation modeling analyses were used to test the hypothesized relationships. Findings - The results confirm the importance of including cues related to C2C interactions and coproduction in order to increase co-creation experience possibilities for the customer during the online purchase. Moreover, if customers perceive that they are co-creating the experience, their purchase intentions increase. Practical implications - This paper addresses the importance of virtual engagement platforms as touch points for interaction and the importance of their characteristics for facilitating co-creation. These platforms provide customers with cues that promote their participation, the establishment of collaborative relationships and the co-creation of the purchase experience. Originality/value - There is a growing interest in understanding how customers interact with firms to co-create experiences and in the influence of IT-related service in this process. Nevertheless, to date, the online purchase experience as a co-creation context has not been fully investigated.", "paper_title": "The online purchase as a context for co-creating experiences. Drivers of and consequences for customer behavior", "paper_id": "WOS:000341886900007"}