{"auto_keywords": [{"score": 0.04972867160744286, "phrase": "unrelated_alternative_machines"}, {"score": 0.037495295568870386, "phrase": "electronics_manufacturing"}, {"score": 0.03722990101575028, "phrase": "airplane_engine_production"}, {"score": 0.03683519254224082, "phrase": "petrochemical_production"}, {"score": 0.03605781665678908, "phrase": "addressed_problem"}, {"score": 0.00481495049065317, "phrase": "function_constraint"}, {"score": 0.004675565200598801, "phrase": "two-stage_hybrid_flowshop_scheduling_problem"}, {"score": 0.004408729661992651, "phrase": "first_machine_center"}, {"score": 0.004344424495876066, "phrase": "second_machine_center"}, {"score": 0.004296809240805996, "phrase": "common_processing_machine"}, {"score": 0.0037505809981715024, "phrase": "first_center"}, {"score": 0.003309877074892399, "phrase": "heuristic_algorithms"}, {"score": 0.003213920601037463, "phrase": "experimental_results"}, {"score": 0.003132236287543072, "phrase": "modified_johnson's_rule"}, {"score": 0.003097865379563127, "phrase": "first-fit_rule"}, {"score": 0.0030638704739988595, "phrase": "best_solutions"}, {"score": 0.003030247482854539, "phrase": "proposed_heuristics"}, {"score": 0.00300863758173919, "phrase": "scope"}, {"score": 0.002985988377995789, "phrase": "purpose_a_survey"}, {"score": 0.002953217535105884, "phrase": "scheduling_literature"}, {"score": 0.002733646947011804, "phrase": "functional_constraint"}, {"score": 0.002713604305939145, "phrase": "unrelated_alternative_machines_cases"}, {"score": 0.00240328454980006, "phrase": "efficient_heuristics"}, {"score": 0.002216336059488137, "phrase": "np_case"}, {"score": 0.0021049977753042253, "phrase": "computational_results"}], "paper_keywords": ["hybrid flowshop scheduling", " unrelated alternative machines", " heuristic algorithm"], "paper_abstract": "This article addresses a two-stage hybrid flowshop scheduling problem with unrelated alternative machines. The problem to be studied has m unrelated alternative machines at the first machine center followed by a second machine center with a common processing machine in the system. The objective is to minimize the makespan of the system. For the processing of any job, it is assumed that the operation can be partially substituted by other machines in the first center, depending on its machining constraints. Such scheduling problems occur in certain practical applications such as semiconductors, electronics manufacturing, airplane engine production, and petrochemical production. We demonstrate that the addressed problem is NP-hard and then provide some heuristic algorithms to solve the problem efficiently. The experimental results show that the combination of the modified Johnson's rule and the First-Fit rule provides the best solutions within all proposed heuristics. Scope and purpose A survey of the scheduling literature reveals that although a lot of research focusing on FSm1,(m2) has been done, no study has taken the functional constraint and unrelated alternative machines cases into account simultaneously. However, such scheduling problems occur in certain practical manufacturing environments such as semiconductors, electronics manufacturing, airplane engine production, and petrochemical production. Hence, the purpose of this report is to propose some efficient heuristics for solving the FSm1,(m2) problem. For the addressed problem, first, we demonstrate that the problem belongs to an NP case; then, 16 heuristics are provided for dealing with the problem. The computational results demonstrate the effectiveness of the heuristics. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A two-stage hybrid flowshop scheduling problem with a function constraint and unrelated alternative machines", "paper_id": "WOS:000250256100015"}