{"auto_keywords": [{"score": 0.049440303515783074, "phrase": "human_population"}, {"score": 0.041012273963914964, "phrase": "human_lifespan"}, {"score": 0.00481495049065317, "phrase": "data_mining_of_online_genealogy_datasets"}, {"score": 0.004782718554230406, "phrase": "revealing_lifespan_patterns"}, {"score": 0.004655924035639928, "phrase": "extensive_information"}, {"score": 0.0045324756541157574, "phrase": "present_family_connections"}, {"score": 0.0044870272550540415, "phrase": "vast_amount"}, {"score": 0.0040978781692373005, "phrase": "lifespan_distributions"}, {"score": 0.003975781274672803, "phrase": "social_and_genetic_features"}, {"score": 0.0038443635340052523, "phrase": "predictive_models"}, {"score": 0.0036923623384423816, "phrase": "genealogy_datasets"}, {"score": 0.0036186222999811802, "phrase": "presented_methods"}, {"score": 0.003558294449586273, "phrase": "large_online_genealogy_dataset"}, {"score": 0.003406091279580424, "phrase": "wikitree_website"}, {"score": 0.0033492947290751996, "phrase": "significant_but_small_positive_correlations"}, {"score": 0.0033045378860812403, "phrase": "parents'_lifespan"}, {"score": 0.002869115451202179, "phrase": "reproductive_success"}, {"score": 0.002764856305713066, "phrase": "mean_absolute_error"}, {"score": 0.002558909812664716, "phrase": "random_classification_results"}, {"score": 0.0022898630573629144, "phrase": "human_populations"}, {"score": 0.002259231376607264, "phrase": "online_genealogy_datasets"}, {"score": 0.0021049977753042253, "phrase": "successful_aging"}], "paper_keywords": ["Genealogy", " Data Mining", " Aging", " Lifespan Prediction", " Genealogy data mining", " human population lifespan", " lifespan prediction", " data mining", " machine learning", " WikiTree"], "paper_abstract": "Online genealogy datasets contain extensive information about millions of people and their past and present family connections. This vast amount of data can help identify various patterns in the human population. In this study, we present methods and algorithms that can assist in identifying variations in lifespan distributions of the human population in the past centuries, in detecting social and genetic features that correlate with the human lifespan, and in constructing predictive models of human lifespan based on various features that can easily be extracted from genealogy datasets. We have evaluated the presented methods and algorithms on a large online genealogy dataset with over a million profiles and over 9 million connections, all of which were collected from the WikiTree website. Our findings indicate that significant but small positive correlations exist between the parents' lifespan and their children's lifespan. Additionally, we found slightly higher and significant correlations between the lifespans of spouses. We also discovered a very small positive and significant correlation between longevity and reproductive success in males, and a small and significant negative correlation between longevity and reproductive success in females. Moreover, our predictive models presented results with a Mean Absolute Error as low as 13.18 in predicting the lifespans of individuals who outlived the age of 10, and our classification models presented better than random classification results in predicting which people who outlive the age of 50 will also outlive the age of 80. We believe that this study will be the first of many studies to utilize the wealth of data on human populations, existing in online genealogy datasets, to better understand factors that influence the human lifespan. Understanding these factors can assist scientists in providing solutions for successful aging.", "paper_title": "Data Mining of Online Genealogy Datasets for Revealing Lifespan Patterns in Human Population", "paper_id": "WOS:000354049800018"}