{"auto_keywords": [{"score": 0.03291935512824042, "phrase": "co-evolutionary_relations"}, {"score": 0.015719716506582538, "phrase": "co-evolutionary_network"}, {"score": 0.004651057147690674, "phrase": "correlated_events"}, {"score": 0.004470539706227421, "phrase": "co-evolution_relations"}, {"score": 0.004339744430169516, "phrase": "co-evolutionary_interactions_network"}, {"score": 0.004212759658511567, "phrase": "functional_associations"}, {"score": 0.004029187256595917, "phrase": "novel_probabilistic_methodology"}, {"score": 0.003911253966141701, "phrase": "-evolutionary_interactions"}, {"score": 0.0035954555250614197, "phrase": "orthologous_genes"}, {"score": 0.003455765987713262, "phrase": "co-evolutionary_interactions"}, {"score": 0.003038066486989815, "phrase": "multiple_modular_assemblies"}, {"score": 0.0029784342137867776, "phrase": "clearly_defined_functions"}, {"score": 0.0027513507830537165, "phrase": "genomic_proximity"}, {"score": 0.002724207384182295, "phrase": "gene_fusion_propensity"}, {"score": 0.002336071138145897, "phrase": "inferred_co-evolutionary_network"}, {"score": 0.0022452005651385095, "phrase": "functional_relations"}], "paper_keywords": [""], "paper_abstract": "Motivation: Correlated events of gains and losses enable inference of co-evolution relations. The reconstruction of the co-evolutionary interactions network in prokaryotic species may elucidate functional associations among genes. Results: We developed a novel probabilistic methodology for the detection of co-evolutionary interactions between pairs of genes. Using this method we inferred the co-evolutionary network among 4593 Clusters of Orthologous Genes (COGs). The number of co-evolutionary interactions substantially differed among COGs. Over 40% were found to co-evolve with at least one partner. We partitioned the network of co-evolutionary relations into clusters and uncovered multiple modular assemblies of genes with clearly defined functions. Finally, we measured the extent to which co-evolutionary relations coincide with other cellular relations such as genomic proximity, gene fusion propensity, co-expression, protein-protein interactions and metabolic connections. Our results show that co-evolutionary relations only partially overlap with these other types of networks. Our results suggest that the inferred co-evolutionary network in prokaryotes is highly informative towards revealing functional relations among genes, often showing signals that cannot be extracted from other network types.", "paper_title": "Uncovering the co-evolutionary network among prokaryotic genes", "paper_id": "WOS:000308532300013"}