{"auto_keywords": [{"score": 0.04763743657605743, "phrase": "heap_data"}, {"score": 0.00481495049065317, "phrase": "access_graphs"}, {"score": 0.004764859786310636, "phrase": "significant_progress"}, {"score": 0.00464998919563789, "phrase": "program_analysis"}, {"score": 0.004351905364003354, "phrase": "stack_data"}, {"score": 0.004306610946695577, "phrase": "spatial_and_temporal_structure"}, {"score": 0.004246947739596565, "phrase": "static_data"}, {"score": 0.004016413965935386, "phrase": "bounded_representations"}, {"score": 0.0036937768530367647, "phrase": "resulting_summary_representations"}, {"score": 0.0033265580369717996, "phrase": "data_flow_analysis"}, {"score": 0.0032919001003538758, "phrase": "important_application"}, {"score": 0.0032462487283717546, "phrase": "heap_reference_analysis"}, {"score": 0.0032236602306747637, "phrase": "garbage_collection"}, {"score": 0.003102195256794215, "phrase": "program_variables"}, {"score": 0.0030378759123133644, "phrase": "current_garbage_collectors"}, {"score": 0.002832928222306059, "phrase": "first_ever_end-to-end_static_analysis"}, {"score": 0.0026883186885595127, "phrase": "dead_objects"}, {"score": 0.002560000295424659, "phrase": "discovering_data"}, {"score": 0.002524473047010871, "phrase": "complex_semantics"}, {"score": 0.0023540798554571745, "phrase": "solution_methods"}, {"score": 0.002119764367112061, "phrase": "memory_leaks"}], "paper_keywords": ["algorithms", " languages", " theory", " aliasing", " data flow analysis", " heap references", " liveness"], "paper_abstract": "Despite significant progress in the theory and practice of program analysis, analyzing properties of heap data has not reached the same level of maturity as the analysis of static and stack data. The spatial and temporal structure of stack and static data is well understood while that of heap data seems arbitrary and is unbounded. We devise bounded representations that summarize properties of the heap data. This summarization is based on the structure of the program that manipulates the heap. The resulting summary representations are certain kinds of graphs called access graphs. The boundedness of these representations and the monotonicity of the operations to manipulate them make it possible to compute them through data flow analysis. An important application that benefits from heap reference analysis is garbage collection, where currently liveness is conservatively approximated by reachability from program variables. As a consequence, current garbage collectors leave a lot of garbage uncollected, a fact that has been confirmed by several empirical studies. We propose the first ever end-to-end static analysis to distinguish live objects from reachable objects. We use this information to make dead objects unreachable by modifying the program. This application is interesting because it requires discovering data flow information representing complex semantics. In particular, we formulate the following new analyses for heap data: liveness, availability, and anticipability and propose solution methods for them. Together, they cover various combinations of directions of analysis (i.e., forward and backward) and confluence of information (i.e. union and intersection). Our analysis can also be used for plugging memory leaks in C/C++ languages.", "paper_title": "Heap reference analysis using access graphs", "paper_id": "WOS:000252153400001"}