{"auto_keywords": [{"score": 0.049689226691737795, "phrase": "generic_programming"}, {"score": 0.00481495049065317, "phrase": "linguistic_support"}, {"score": 0.004642604455537883, "phrase": "important_technique"}, {"score": 0.004549524321051407, "phrase": "highly_reusable_and_efficient_software_libraries"}, {"score": 0.003806541299696042, "phrase": "non-template_libraries"}, {"score": 0.00374531366198605, "phrase": "notoriously_confusing_error_messages"}, {"score": 0.00342568771304873, "phrase": "compilation_process"}, {"score": 0.003020918749760067, "phrase": "syntactic_and_semantic_behavior"}, {"score": 0.002936331371903168, "phrase": "type_parameters"}, {"score": 0.0028195727965553367, "phrase": "template_definitions"}, {"score": 0.0023776656246300063, "phrase": "language_extensions"}, {"score": 0.0022101055924375725, "phrase": "conceptgcc_compiler"}, {"score": 0.0021307975800397816, "phrase": "upcoming_revision"}], "paper_keywords": ["design", " languages", " generic programming", " constrained generics", " parametric polymorphism", " C plus plus templates", " C++0x", " concepts"], "paper_abstract": "Generic programming has emerged as an important technique for the development of highly reusable and efficient software libraries. In C++, generic programming is enabled by the flexibility of templates, the C++ type parametrization mechanism. However, the power of templates comes with a price: generic (template) libraries can be more difficult to use and develop than non-template libraries and their misuse results in notoriously confusing error messages. As currently defined in C++ 98, templates are unconstrained, and type-checking of templates is performed late in the compilation process, i.e., after the use of a template has been combined with its definition. To improve the support for generic programming in C++, we introduce concepts to express the syntactic and semantic behavior of types and to constrain the type parameters in a C++ template. Using concepts, type-checking of template definitions is separated from their uses, thereby making templates easier to use and easier to compile. These improvements are achieved without limiting the flexibility of templates or decreasing their performance-in fact their expressive power is increased. This paper describes the language extensions supporting concepts, their use in the expression of the C++ Standard Template Library, and their implementation in the ConceptGCC compiler. Concepts are candidates for inclusion in the upcoming revision of the ISO C++ standard, C++0x.", "paper_title": "Concepts: Linguistic support for generic programming in C++", "paper_id": "WOS:000202972500021"}