{"auto_keywords": [{"score": 0.03797636854358293, "phrase": "object_comparison"}, {"score": 0.029781621838727648, "phrase": "average_cost"}, {"score": 0.02734026317158217, "phrase": "optimal_order"}, {"score": 0.00481495049065317, "phrase": "comparing_objects"}, {"score": 0.004695900553353526, "phrase": "hierarchical_process"}, {"score": 0.004656871909510407, "phrase": "separate_aspects"}, {"score": 0.004301834610818624, "phrase": "single_result"}, {"score": 0.0036553070575015344, "phrase": "final_result"}, {"score": 0.0035648266669315943, "phrase": "mathematical_properties"}, {"score": 0.00347657813672945, "phrase": "comparison_scheme"}, {"score": 0.0033482708495261864, "phrase": "intermediate_results"}, {"score": 0.003306559295382181, "phrase": "derived_threshold"}, {"score": 0.0030797912111959137, "phrase": "comparison_cost"}, {"score": 0.0022133711375320244, "phrase": "selection_processes"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Comparing objects can be considered as a hierarchical process. Separate aspects of objects are compared to each other, and the results of these comparisons are combined into a single result in one or more steps by aggregation operators. The set of operators used to compare the objects and the way these operators are related with each other is called the comparison scheme. If a threshold is applied to the final result of the object comparison, the mathematical properties of the operators in the comparison scheme can be used to derive thresholds on the intermediate results. These derived threshold can be used to break of a comparison early, thus offering a reduction of the comparison cost. Using this information, we show that the order in which the operators are evaluated has an influence on the average cost of comparing two objects. Next, we proceed with a Study of the properties that allow us to find an optimal order, such that this average cost is minimized. Finally, we provide an algorithm that calculates an optimal order efficiently. Although specifically developed for object comparison, the algorithm can be applied to all kinds of selection processes that involve the combination of several test results. (C) 2009 Wiley Periodicals, Inc.", "paper_title": "Performance Optimization of Object Comparison", "paper_id": "WOS:000269902900003"}