{"auto_keywords": [{"score": 0.04219097367734989, "phrase": "proposed_similarity_measure"}, {"score": 0.00956172529441938, "phrase": "new_similarity_measure"}, {"score": 0.008561432503866474, "phrase": "pattern_recognition_problems"}, {"score": 0.007152368807539886, "phrase": "atanassov's_intuitionistic_fuzzy_sets"}, {"score": 0.004583205112737672, "phrase": "pattern_recognition"}, {"score": 0.0041269626762569095, "phrase": "transformation_techniques"}, {"score": 0.0038148790255254396, "phrase": "existing_similarity_measures"}, {"score": 0.0036703791815812328, "phrase": "atanassov's_intuitionistic_fuzzy_values"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Fuzzy number", " Atanassov's intuitionistic fuzzy value", " Atanassov's intuitionistic fuzzy set", " Similarity measure"], "paper_abstract": "In this paper, we propose a new similarity measure between Atanassov's intuitionistic fuzzy sets (AIFSs) based on transformation techniques and apply the proposed similarity measure between AIFSs to deal with pattern recognition problems. First, we present a new similarity measure between Atanassov's intuitionistic fuzzy values (AIFVs) and prove some properties of the proposed similarity measure between AIFVs. Then, based on the proposed similarity measure between AIFVs, we propose a new similarity measure between AIFSs and prove some properties of the proposed similarity measure between AIFSs. Then, we use some examples to illustrate that the proposed similarity measure between AIFSs can overcome the drawbacks of the existing similarity measures. Finally, we apply the proposed similarity measure between AIFSs to deal with pattern recognition problems. The proposed similarity measure outperforms the existing similarity measures between AIFSs for dealing with the pattern recognition problems. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A novel similarity measure between Atanassov's intuitionistic fuzzy sets based on transformation techniques with applications to pattern recognition", "paper_id": "WOS:000344206300006"}