{"auto_keywords": [{"score": 0.04974880504003441, "phrase": "organisational_performance"}, {"score": 0.04893420182443134, "phrase": "airline_industry"}, {"score": 0.04672040184035883, "phrase": "km"}, {"score": 0.04201196678009261, "phrase": "pilot_study"}, {"score": 0.029752562574767973, "phrase": "conceptual_model"}, {"score": 0.00481495049065317, "phrase": "knowledge_management_processes"}, {"score": 0.0045088388224419, "phrase": "knowledge_management"}, {"score": 0.003858936100805083, "phrase": "primary_data_collection_method"}, {"score": 0.0035884582625234297, "phrase": "knowledge_usage"}, {"score": 0.003360057874429478, "phrase": "knowledge_transfer"}, {"score": 0.003325343504284345, "phrase": "common_km_process"}, {"score": 0.003092149768415082, "phrase": "proposed_conceptual_model"}, {"score": 0.0030390745780621503, "phrase": "initial_understanding"}, {"score": 0.002986907667028281, "phrase": "km_processes"}, {"score": 0.002720254890261961, "phrase": "preliminary_study"}, {"score": 0.0025914765323897604, "phrase": "later_stages"}, {"score": 0.002564682311144514, "phrase": "research_journey"}, {"score": 0.002451730979693715, "phrase": "extensive_review"}, {"score": 0.002279660253812632, "phrase": "appropriate_km_processes"}, {"score": 0.0022560827223539934, "phrase": "unique_and_yet_untested_context"}, {"score": 0.0021716944668428865, "phrase": "op._determination_of_km"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Knowledge management", " Organizational performance", " Knowledge management processes", " Pilot study"], "paper_abstract": "Purpose - The purpose of this paper is to evaluate knowledge management (KM) processes and to investigate their impact on organisational performance (OP) within the context of the airline industry (AI). Design/methodology/approach - An inductive and deductive qualitative approach was used based on a preliminary study. A pilot study was conducted which involved the use of interviews as a primary data collection method. Content analysis was used to extract and analyse themes from the data. Findings - The study showed that knowledge usage is the most influential aspect of KM in terms of the impact on OP. Moreover, the study revealed that knowledge transfer is a common KM process employed by organisations. Research limitations/implications - This study outlined the findings of a pilot study which aimed to test a proposed conceptual model and to provide an initial understanding of the interrelationships between KM processes and OP. To this end, a number of interviews were conducted in order to consolidate a conceptual model. As such, the nature of this preliminary study imposed some time and context limitations. These limitations will be dealt within later stages of the research journey. Originality/value - The value of the study is generated from the extensive review of the literature it provided which enhanced proposing a conceptual model that was initially tested with the aim of defining an appropriate KM processes within a unique and yet untested context as well as describing the impact of these processes on OP. Determination of KM processes is expected to set a guideline for future research in the AI.", "paper_title": "The impact of knowledge management processes on organisational performance The case of the airline industry", "paper_id": "WOS:000355689400002"}