{"auto_keywords": [{"score": 0.03135283516005389, "phrase": "wifi"}, {"score": 0.013888270520335208, "phrase": "bluetooth"}, {"score": 0.00481495049065317, "phrase": "rapid_wireless_system_composition"}, {"score": 0.004693476992528682, "phrase": "small_mobile_computers"}, {"score": 0.003991932110277654, "phrase": "logical_platform"}, {"score": 0.0038090874465452214, "phrase": "current_standards"}, {"score": 0.003776750773624222, "phrase": "ad_hoc_wireless_networks"}, {"score": 0.0036037265181631324, "phrase": "wireless_computers"}, {"score": 0.0032950412841674026, "phrase": "lengthy_and_repetitive_sequential_connection_process"}, {"score": 0.003117307618682836, "phrase": "effective_use"}, {"score": 0.0027662954811372175, "phrase": "ad_hoc_compositions"}, {"score": 0.0026058621464926826, "phrase": "existing_wireless_standards"}, {"score": 0.002572709810193776, "phrase": "service_information"}, {"score": 0.0024863459251358217, "phrase": "device_discovery"}, {"score": 0.0023926387830753033, "phrase": "legacy_service_information"}, {"score": 0.002342110338541984, "phrase": "additional_service_descriptions"}, {"score": 0.0021504218042734677, "phrase": "nascent_uwb_wireless_standard"}, {"score": 0.0021049977753042253, "phrase": "composable_systems"}], "paper_keywords": [""], "paper_abstract": "Although small mobile computers have processors whose capabilities are increasing, often they still are resource constrained in terms of performing many common computing tasks. Composition is a technique that overcomes this limitation by wirelessly connecting several nearby devices together to share their resources to create a logical platform that is better suited to a given task. However, current standards for ad hoc wireless networks were not designed for this goal, and currently, wireless computers cannot discover services on other devices without first making layer-3 network connections between them. This requires users to engage in a lengthy and repetitive sequential connection process to find these services on the various computers and is a barrier for effective use. In this article, we quantify the layer-3 discovery overhead for both WiFi and Bluetooth and propose a mechanism to address this problem enabling users to rapidly form ad hoc compositions using a layer-2 service discovery mechanism. To achieve this result, we propose extensions to existing wireless standards by adding service information to beacons that typically are used for device discovery. An architecture is described that also enables legacy service information to be aggregated with additional service descriptions specific to composition and further encoded in layer-2 wireless beacons. Finally, we present measurements of layer-2 discovery implemented using the nascent UWB wireless standard, demonstrating its efficacy for composable systems.", "paper_title": "Enabling rapid wireless system composition through layer-2 discovery", "paper_id": "WOS:000258031400004"}