{"auto_keywords": [{"score": 0.043265073684849546, "phrase": "gwap_systems"}, {"score": 0.02223685810380668, "phrase": "esp_game"}, {"score": 0.00477190623242136, "phrase": "esp-like_gwap_systems"}, {"score": 0.004521566043596533, "phrase": "\"human_computation"}, {"score": 0.00438161736774803, "phrase": "computational_process"}, {"score": 0.0040777192615062815, "phrase": "systematic_and_thorough_evaluation"}, {"score": 0.00295008998986066, "phrase": "optimal_puzzle_selection_strategy"}, {"score": 0.002820319063320601, "phrase": "comprehensive_set"}, {"score": 0.0027206133859493725, "phrase": "proposed_opsa_approach"}, {"score": 0.0026720866990543744, "phrase": "system_utility"}, {"score": 0.0025316254589087973, "phrase": "quasi_esp_game"}, {"score": 0.002387758958649797, "phrase": "complete_game_trace"}, {"score": 0.0023033100935570755, "phrase": "one-month_experiment"}, {"score": 0.0022419349154472806, "phrase": "inner_properties"}, {"score": 0.0021920373388760314, "phrase": "real-world_gwap_systems"}, {"score": 0.0021336208506092173, "phrase": "opsa_scheme"}, {"score": 0.0021049977753042253, "phrase": "best_system_utility"}], "paper_keywords": ["Games with a purpose (GWAP)", " human computation", " tagging"], "paper_abstract": "The \"games with a purpose\" (GWAP) genre is a type of \"human computation\" that outsources certain steps of the computational process to humans. Although most GWAP studies focus on the design and analysis of GWAP systems, a systematic and thorough evaluation of existing systems is lacking. We address the issue in this paper. Taking the ESP game as an example, we propose a metric, called system utility, for evaluating the performance of GWAP systems, and use analysis to study the properties of the ESP game. We argue that GWAP systems should be designed and played with strategies. To this end, based on our analysis, we implement an optimal puzzle selection strategy (OPSA) to improve GWAP systems. Using a comprehensive set of simulations, we show that the proposed OPSA approach can improve the system utility of the ESP game significantly. In addition, we implement a quasi ESP game, called ESP Lite, which embeds three puzzle selection algorithms transparently and records the complete game trace for evaluation and further research. During a one-month experiment, we have investigated the inner properties of the three strategies in real-world GWAP systems, and verified that the OPSA scheme achieves the best system utility for the ESP game. The results of this study demonstrate that GWAP systems are more efficient if they are designed and played with strategies.", "paper_title": "The Design of Puzzle Selection Strategies for ESP-Like GWAP Systems", "paper_id": "WOS:000295471500005"}