{"auto_keywords": [{"score": 0.0479736639241839, "phrase": "digital_media"}, {"score": 0.047030767281648664, "phrase": "audio_files"}, {"score": 0.00481495049065317, "phrase": "integrated_practice"}, {"score": 0.004748832495727873, "phrase": "physical_and_digital_components"}, {"score": 0.004699837689671504, "phrase": "current_digital_technologies"}, {"score": 0.0046352930395962685, "phrase": "large_archives"}, {"score": 0.004340553321613485, "phrase": "creative_practices"}, {"score": 0.0036510928952124522, "phrase": "physical_construction"}, {"score": 0.003325343504284345, "phrase": "new_crafting_practices"}, {"score": 0.0031680109156103334, "phrase": "digital_images"}, {"score": 0.003124437382827821, "phrase": "physical_constructions"}, {"score": 0.003092149768415082, "phrase": "tangible_building_blocks"}, {"score": 0.0027486699590262343, "phrase": "hybrid_crafting"}, {"score": 0.002451730979693715, "phrase": "concrete_guidelines"}, {"score": 0.0024096216848276094, "phrase": "novel_hybrid_crafting_products"}, {"score": 0.002368233914089849, "phrase": "craft_context"}, {"score": 0.0022717738872652013, "phrase": "design_space"}, {"score": 0.0022096550791379033, "phrase": "new_practices"}, {"score": 0.0021943920257952174, "phrase": "interesting_new_challenges"}, {"score": 0.002119640369431708, "phrase": "novel_forms"}, {"score": 0.0021049977753042253, "phrase": "creative_expression"}], "paper_keywords": ["Crafting", " Hybrid", " Physical materials", " Digital media", " Design research", " Interaction design"], "paper_abstract": "With current digital technologies, people have large archives of digital media, such as images and audio files, but there are only limited means to include these media in creative practices of crafting and making. Nevertheless, studies have shown that crafting with digital media often makes these media more cherished and that people enjoy being creative with their digital media. This paper aims to open up the way for novel means for crafting, which include digital media in integrations with physical construction, here called 'hybrid crafting'. Notions of hybrid crafting were explored to inform the design of products or systems that may support these new crafting practices. We designed 'Materialise'aEuro\"a building set that allows for the inclusion of digital images and audio files in physical constructions by using tangible building blocks that can display images or play audio files, alongside a variety of other physical components-and used this set in four hands-on creative workshops to gain insight into how people go about doing hybrid crafting; whether hybrid crafting is desirable; what the characteristics of hybrid crafting are; and how we may design to support these practices. By reflecting on the findings from these workshops, we provide concrete guidelines for the design of novel hybrid crafting products or systems that address craft context, process and result. We aim to open up the design space to designing for hybrid crafting because these new practices provide interesting new challenges and opportunities for future crafting that can lead to novel forms of creative expression.", "paper_title": "Hybrid crafting: towards an integrated practice of crafting with physical and digital components", "paper_id": "WOS:000331801500012"}