{"auto_keywords": [{"score": 0.04101817306248832, "phrase": "perona-malik"}, {"score": 0.00481495049065317, "phrase": "noise_reduction"}, {"score": 0.004339108074589307, "phrase": "close_relative"}, {"score": 0.004260134699483774, "phrase": "celebrated_perona-malik_equation"}, {"score": 0.003958299299658418, "phrase": "new_regularization_paradigm"}, {"score": 0.0036107898615445797, "phrase": "well-posed_equations"}, {"score": 0.0035233696341819437, "phrase": "stable_natural_discretization"}, {"score": 0.002791239714439304, "phrase": "nontrivial_equilibria"}, {"score": 0.002424012799998538, "phrase": "numerical_experiments"}, {"score": 0.002336414425972225, "phrase": "main_features"}, {"score": 0.0022938068444116827, "phrase": "new_models"}, {"score": 0.0021049977753042253, "phrase": "denoising_tool"}], "paper_keywords": ["Nonlinear diffusion", " Nonlocal diffusion", " De-noising"], "paper_abstract": "Two new nonlocal nonlinear diffusion models for noise reduction are proposed, analyzed and implemented. They are both a close relative of the celebrated Perona-Malik equation. In a way, they can be viewed as a new regularization paradigm for Perona-Malik. They do preserve and enhance the most cherished features of Perona-Malik while delivering well-posed equations which admit a stable natural discretization. Unlike other regularizations, however, certain piecewise smooth functions are (meta)stable equilibria and, as a consequence, their dynamical behavior and that of their discrete implementations can be fully understood and do not lead to any \"paradox\". The presence of nontrivial equilibria also explains why blurring is kept in check. One of the models has been proved to be well-posed. Numerical experiments are presented that illustrate the main features of the new models and that provide insight into their interesting dynamical behavior as well as demonstrate their effectiveness as a denoising tool.", "paper_title": "Two New Nonlinear Nonlocal Diffusions for Noise Reduction", "paper_id": "WOS:000262315700003"}