{"auto_keywords": [{"score": 0.046481645015043, "phrase": "cooccurrence_data"}, {"score": 0.04444288300280288, "phrase": "similarity_measure"}, {"score": 0.027965575599963963, "phrase": "association_strength"}, {"score": 0.027542938023672046, "phrase": "probabilistic_measure"}, {"score": 0.00481495049065317, "phrase": "normalize_cooccurrence_data"}, {"score": 0.004667149874736771, "phrase": "well-known_similarity_measures"}, {"score": 0.003771185758226876, "phrase": "normalization_purposes"}, {"score": 0.003542976343910816, "phrase": "similarity_measures"}, {"score": 0.00314334591526089, "phrase": "jaccard"}, {"score": 0.002499798127196099, "phrase": "inclusion_index"}, {"score": 0.002448260697722081, "phrase": "jaccard_index"}, {"score": 0.0024103044278902916, "phrase": "-theoretic_measures"}, {"score": 0.0021945833590668973, "phrase": "strong_support"}, {"score": 0.0021049977753042253, "phrase": "scientometric_research"}], "paper_keywords": [""], "paper_abstract": "In scientometric research, the use of cooccurrence data is very common. In many cases, a similarity measure is employed to normalize the data. However, there is no consensus among researchers on which similarity measure is most appropriate for normalization purposes. In this article, we theoretically analyze the properties of similarity measures for cooccurrence data, focusing in particular on four well-known measures: the association strength, the cosine, the inclusion index, and the Jaccard index. We also study the behavior of these measures empirically. Our analysis reveals that there exist two fundamentally different types of similarity measures, namely, set-theoretic measures and probabilistic measures. The association strength is a probabilistic measure, while the cosine, the inclusion index, and the Jaccard index are set-theoretic measures. Both our theoretical and our empirical results indicate that cooccurrence data can best be normalized using a probabilistic measure. This provides strong support for the use of the association strength in scientometric research.", "paper_title": "How to Normalize Cooccurrence Data? An Analysis of Some Well-Known Similarity Measures", "paper_id": "WOS:000268350900009"}