{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_pose_tracking"}, {"score": 0.004769958800452922, "phrase": "stochastic_search_methods"}, {"score": 0.0046593017130868, "phrase": "annealed_particle_filter"}, {"score": 0.004123781267600542, "phrase": "stochastic_search"}, {"score": 0.003916098498242888, "phrase": "annealing_layers"}, {"score": 0.003771631577951067, "phrase": "adaptive_parametric_density"}, {"score": 0.0030961807859418034, "phrase": "pa"}, {"score": 0.002818013056816282, "phrase": "isa_configuration"}, {"score": 0.0026014425686078993, "phrase": "optimum_parameters"}, {"score": 0.002577086838155082, "phrase": "apf"}, {"score": 0.0025529555116644534, "phrase": "isa"}, {"score": 0.0023902026696615473, "phrase": "computational_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human pose tracking", " Stochastic search", " Parameter selection", " Particle filter", " Annealing"], "paper_abstract": "Stochastic search methods, such as the annealed particle filter (APF) and its variants, are used widely in human pose tracking due to their reliability. In this paper, we propose a method that improves stochastic search by using two novel steps: first, by reusing samples across annealing layers, and second, by fitting an adaptive parametric density to the samples for diffusion. We compare our proposed method, called parametric annealing (PA), to APF as well as to the recently published interacting simulating annealing (ISA) on the Human Eva I dataset. The results show that PA tracks more accurately than APF despite using less than 50% of the samples, and also tracks more accurately than an ISA configuration that uses the same number of samples. Furthermore, we describe a framework to select the optimum parameters for APF, ISA, and PA that takes into account their stochastic nature. Using our framework, the computational overhead for tracking may be reduced by up to 40% with no loss of performance. Finally, we compare our method to discriminative methods. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Parametric annealing: A stochastic search method for human pose tracking", "paper_id": "WOS:000315313600022"}