{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "online_knowledge_management_network_moderation"}, {"score": 0.004652963867892925, "phrase": "knowledge_society"}, {"score": 0.004496402246090618, "phrase": "new_networked_working"}, {"score": 0.00428179779071721, "phrase": "accelera_project"}, {"score": 0.003998380230709541, "phrase": "online_community"}, {"score": 0.0034355662264234864, "phrase": "networked_creation"}, {"score": 0.003287482882222731, "phrase": "key_elements"}, {"score": 0.0032237268289353983, "phrase": "knowledge_creation"}, {"score": 0.0029229677574293725, "phrase": "knowledge_networks"}, {"score": 0.002498873893632726, "phrase": "moderator's_inherent_objectives"}], "paper_keywords": ["Community of practice", " Moderator", " Knowledge management", " Computer-mediated communication"], "paper_abstract": "In the knowledge society, the appearance and development of new networked working and learning environments is increasingly common. In the Accelera project, which is the basis for this paper, we have developed an online community of practice which enables experiences and knowledge to be shared between various educational agents, and analysis of the processes generated, in order to produce and validate a model for the networked creation and management of knowledge. One of the key elements in the networked Knowledge Creation and Management model considered in this article is the moderator We discuss their skills, the role they play in knowledge networks, the moderation and participation criteria they should follow, and their professional development and the training required to work well as a moderator Findings indicate that a consideration of the moderator's inherent objectives in online environments and the tasks derived from these objectives leads to the acquisition and development of administrative and technical (organisational) knowledge and competences as well as other more complex knowledge and competences related to pedagogical, intellectual and social factors, without ignoring the need for them to understand and be familiar with the workings of CSCL where they will intervene (C) 2010 Elsevier Ltd. All rights reserved", "paper_title": "Who exactly is the moderator? A consideration of online knowledge management network moderation in educational organisations", "paper_id": "WOS:000277110400031"}