{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "approximation_approach"}, {"score": 0.03220622087721257, "phrase": "main_watermark"}, {"score": 0.004783105609960904, "phrase": "digital_image_owner_identification"}, {"score": 0.004767261858417823, "phrase": "using_histogram_intersection_technique._researchers"}, {"score": 0.004704407458864224, "phrase": "wide_variety"}, {"score": 0.004642377903273107, "phrase": "digital_image_watermarking_techniques"}, {"score": 0.004490842671590769, "phrase": "reasonable_rate"}, {"score": 0.004216362268148017, "phrase": "existing_watermarking_algorithms"}, {"score": 0.004038249989123055, "phrase": "destroyed_watermarks"}, {"score": 0.003893406207928709, "phrase": "ownership_identification"}, {"score": 0.003667468902144262, "phrase": "rightful_owner"}, {"score": 0.003595097948724078, "phrase": "remaining_information"}, {"score": 0.0035594478687904743, "phrase": "attacked_watermarks"}, {"score": 0.0035124618008923504, "phrase": "attack_behaviour"}, {"score": 0.0030855348881460107, "phrase": "biisb_approach"}, {"score": 0.003014576010931602, "phrase": "ownership_identification_information"}, {"score": 0.0029452441730331617, "phrase": "bit-pattern_histogram"}, {"score": 0.00290634217991954, "phrase": "statistical_information"}, {"score": 0.0026745503978347143, "phrase": "approximation_purpose"}, {"score": 0.002595698433525986, "phrase": "standard_lena_gray-scale_host_image"}, {"score": 0.002249811525923913, "phrase": "watermarked_image"}, {"score": 0.0021049977753042253, "phrase": "embedded_waterrnarks"}], "paper_keywords": ["Watermarking", " Ownership identification", " Histogram intersection", " Approximation approach", " LSB", " ISB", " EISB", " BiISB"], "paper_abstract": "Researchers have documented a wide variety of attacks against digital image watermarking techniques. Meanwhile, many strong attacks have been appearing at a reasonable rate. The investigations emphasize that modelling of the behaviours regarding such attacks is difficult. Studies have revealed that existing watermarking algorithms have a tendency to be severely affected by such strong attacks which results in destroyed watermarks. Hence, in the influence of such attacks, the ownership identification of the property cannot be established. This paper proposes an approximation approach for identification of the rightful owner of the property utilizing the remaining information of the attacked watermarks regardless of the attack behaviour. Here, we coupled the BiISB (Duo-ISB-Bit-Plane) watermarking algorithm together with the HI (Histogram Intersection) technique in order to identify the ownership of the property. In BiISB approach, while the main watermark delivers the ownership identification information, the sub-watermark which is a bit-pattern histogram, is the statistical information regarding the main watermark. In addition, three bit-pattern histograms namely, original, extracted and computed sub-watermarks have been used for approximation purpose. An investigation has been achieved using a standard Lena gray-scale host image of 512 x 512 pixels, a trademark image of 38 x 89 pixels as a sub-watermark and JPEG2000 lossy compression, Cropping and Reset Removal watermarking attacks. The results have revealed that the proposed approach highly balanced the trade-off between imperceptibility and robustness. This was successfully achieved by preserving the quality of the watermarked image and, at the same time, identifying the ownership of the property even though the attack totally corrupted the embedded waterrnarks.", "paper_title": "AN APPROXIMATION APPROACH FOR DIGITAL IMAGE OWNER IDENTIFICATION USING HISTOGRAM INTERSECTION TECHNIQUE", "paper_id": "WOS:000306679500013"}