{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "empirical_studies"}, {"score": 0.049734762741514144, "phrase": "software_engineering"}, {"score": 0.04706408815174139, "phrase": "current_state"}, {"score": 0.03998618808716689, "phrase": "replication_work"}, {"score": 0.03970880462070679, "phrase": "empirical_software_engineering_research"}, {"score": 0.003646516176920946, "phrase": "current_article"}, {"score": 0.0034918342672996066, "phrase": "second_set"}, {"score": 0.0032018141503341365, "phrase": "systematic_literature_review_method"}, {"score": 0.0031558679589831287, "phrase": "systematic_mapping_study"}, {"score": 0.0030993584115563146, "phrase": "primary_studies"}, {"score": 0.0029785631356166594, "phrase": "manual_and_automatic_search_procedures"}, {"score": 0.0027310567737368033, "phrase": "different_topics"}, {"score": 0.0026151058979100596, "phrase": "theoretical_issues"}, {"score": 0.0022958971655679832, "phrase": "standardized_concepts"}, {"score": 0.002238500096284007, "phrase": "negative_impact"}, {"score": 0.0021049977753042253, "phrase": "se_research_community"}], "paper_keywords": ["Replications", " Experiments", " Empirical studies", " Mapping study", " Systematic literature review", " Software engineering"], "paper_abstract": "Context: Two recent mapping studies which were intended to verify the current state of replication of empirical studies in Software Engineering (SE) identified two sets of studies: empirical studies actually reporting replications (published between 1994 and 2012) and a second group of studies that are concerned with definitions, classifications, processes, guidelines, and other research topics or themes about replication work in empirical software engineering research (published between 1996 and 2012). Objective: In this current article, our goal is to analyze and discuss the contents of the second set of studies about replications to increase our understanding of the current state of the work on replication in empirical software engineering research. Method: We applied the systematic literature review method to build a systematic mapping study, in which the primary studies were collected by two previous mapping studies covering the period 1996-2012 complemented by manual and automatic search procedures that collected articles published in 2013. Results: We analyzed 37 papers reporting studies about replication published in the last 17 years. These papers explore different topics related to concepts and classifications, presented guidelines, and discuss theoretical issues that are relevant for our understanding of replication in our field. We also investigated how these 37 papers have been cited in the 135 replication papers published between 1994 and 2012. Conclusions: Replication in SE still lacks a set of standardized concepts and terminology, which has a negative impact on the replication work in our field. To improve this situation, it is important that the SE research community engage on an effort to create and evaluate taxonomy, frameworks, guidelines, and methodologies to fully support the development of replications. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Investigations about replication of empirical studies in software engineering: A systematic mapping study", "paper_id": "WOS:000355365100006"}