{"auto_keywords": [{"score": 0.046743247979738646, "phrase": "pulmonary_nodules"}, {"score": 0.039835166167657726, "phrase": "false_positives"}, {"score": 0.014398380543096945, "phrase": "statistical_analysis"}, {"score": 0.011241396756629296, "phrase": "ct_scans"}, {"score": 0.00481495049065317, "phrase": "pulmonary_nodule_detection"}, {"score": 0.004735519962945449, "phrase": "spatial_statistical_analysis"}, {"score": 0.004683292152590589, "phrase": "thoracic_ct_scans"}, {"score": 0.004530023871441992, "phrase": "novel_discrimination_method"}, {"score": 0.0036485497734171294, "phrase": "present_paper"}, {"score": 0.0034707339811048403, "phrase": "image_features"}, {"score": 0.002718231974492536, "phrase": "ct_scan"}, {"score": 0.0026000466400112974, "phrase": "previous_cad_system"}, {"score": 0.002542890176213921, "phrase": "system's_output"}, {"score": 0.0021049977753042253, "phrase": "roc_curve"}], "paper_keywords": ["detection of pulmonary nodules", " thoracic CT scans", " computer-aided diagnosis", " statistical analysis", " spatial relationship"], "paper_abstract": "This paper describes a novel discrimination method of pulmonary nodules based on statistical analysis of thoracic computed tomography (CT) scans. Our previous Computer-Aided Diagnosis (CAD) system can detect pulmonary nodules from CT scans, but, at the same time, yields many false positives. In order to reduce the false positives, the method proposed in the present paper uses a relationship between pulmonary nodules, false positives and image features in CT scans. The trend of variation of the relationships is acquired through statistical analysis of a set of CT scans prepared for training. In testing, by use of the trend, the method predicts the appearances of pulmonary nodules and false positives in a CT scan, and improves the accuracy of the previous CAD system by modifying the system's output based on the prediction. The method is applied to 218 actual thoracic CT scans with 386 actual pulmonary nodules. The receiver operating characteristic (ROC) analysis is used to evaluate the results. The area under the ROC curve (Az) is statistically significantly improved from 0.918 to 0.931.", "paper_title": "Accuracy improvement of pulmonary nodule detection based on spatial statistical analysis of thoracic CT scans", "paper_id": "WOS:000248934000006"}