{"auto_keywords": [{"score": 0.004319677360634253, "phrase": "statistical_approach"}, {"score": 0.004141877689172017, "phrase": "large_enough_number"}, {"score": 0.0037812559272269613, "phrase": "high_degree"}, {"score": 0.0035750641312373202, "phrase": "deterministic_and_non-deterministic_finite_automata"}, {"score": 0.002738723329538677, "phrase": "statistical_analysis"}, {"score": 0.002662932198158107, "phrase": "combinatorial_and_statistical_analysis"}, {"score": 0.00263505298504827, "phrase": "present_analysis"}, {"score": 0.0025892330566358503, "phrase": "practical_purposes"}, {"score": 0.0023387234705715154, "phrase": "theoretical_point"}, {"score": 0.0021347607855562102, "phrase": "probabilistic_terms"}, {"score": 0.0021049977753042253, "phrase": "last_section"}], "paper_keywords": ["finite automata", " emptiness problem", " statistical analysis", " sampling method"], "paper_abstract": "How likely is that a randomly given (non-) deterministic finite automaton recognizes no word? A quick reflection seems to indicate that not too many finite automata accept no word; but, can this intuition be confirmed? In this paper we offer a statistical approach which allows us to conclude that for automata, with a large enough number of states, the probability that a given (non-) deterministic finite automaton recognizes no word is close to zero. More precisely, we will show, with a high degree of accuracy (i.e., with precision higher than 99% and level of confidence 0.9973), that for both deterministic and non-deterministic finite automata: a) the probability that an automaton recognizes no word tends to zero when the number of states and the number of letters in the alphabet tend to infinity, b) if the number of states is fixed and rather small, then even if the number of letters of the alphabet of the automaton tends to infinity, the probability is strictly positive. The result a) is obtained via a statistical analysis; for b) we use a combinatorial and statistical analysis. The present analysis shows that for all practical purposes the fraction of automata recognizing no words tends to zero when the number of states and the number of letters in the alphabet grow indefinitely. From a theoretical point of view, the result can motivate the search for \"certitude\", that is, a proof of the fact established here in probabilistic terms. In the last section we critically discuss the result and the method used in this paper.", "paper_title": "Automata recognizing no words: A statistical approach", "paper_id": "WOS:000240746400002"}