{"auto_keywords": [{"score": 0.03345335916119504, "phrase": "warranty_period"}, {"score": 0.00481495049065317, "phrase": "warranted_products"}, {"score": 0.004787595063253874, "phrase": "markov_deterioration"}, {"score": 0.0047468516620285525, "phrase": "important_problem"}, {"score": 0.004719881293102484, "phrase": "maintenance_planning"}, {"score": 0.004653120760786245, "phrase": "replacement_problem"}, {"score": 0.004561232179195321, "phrase": "decision_points"}, {"score": 0.004247560712327667, "phrase": "prevailing_failure_characteristics"}, {"score": 0.004023619476547389, "phrase": "deterioration_levels"}, {"score": 0.003966667994579941, "phrase": "abrupt_event"}, {"score": 0.00382232393805049, "phrase": "multistage_deterioration"}, {"score": 0.0034297140422566577, "phrase": "production_machine"}, {"score": 0.0033811403330431897, "phrase": "repair_verses"}, {"score": 0.0032766780632972363, "phrase": "free_repair_warranty"}, {"score": 0.0028006988338192375, "phrase": "repair_action"}, {"score": 0.0027374647587075935, "phrase": "warranty_claim"}, {"score": 0.0026377320257839933, "phrase": "continuous_time"}, {"score": 0.0026302120935562568, "phrase": "markov_chain"}, {"score": 0.0026077803487003, "phrase": "state_decision_variables"}, {"score": 0.002570817338292482, "phrase": "expected_costs"}, {"score": 0.0024490082808807396, "phrase": "optimum_policy"}, {"score": 0.002414290278501595, "phrase": "expected_total_cost"}], "paper_keywords": ["Deterioration", " free repair warranty", " minimal repair", " multi-state", " replacement"], "paper_abstract": "An important problem in maintenance planning is the repair versus replacement problem which consists of a sequence of decision points over time, whereby decisions are made to repair or replace a machine based on its condition. This problem can be further complicated by prevailing failure characteristics, and costs. The failure modes for many machines are such that failure emerges through a series of deterioration levels rather than as an abrupt event. Zuo et al. [12] presented a policy for multistage deterioration for machines under warranty. This paper extends that work by treating a larger, more general state space with time parameters at each state. This approach allows for a more cost effective policy. We consider a piece of equipment, such as a production machine that is reviewed for repair verses replacement at various times. The machine is sold with a free repair warranty (FRW) policy. So if it fails during the warranty period, it is maintained at the expense of the manufacturer. Two kinds of repairs are adopted: minimal repair, and replacement. We assume that there is no form of maintenance provided between failures, and the manufacturer decides on the repair action to be taken once a failure and warranty claim is filed. The approach is to model the process as a continuous time Markov Chain. The state decision variables are based on the expected costs to the manufacturer for failures and repairs occurring during the warranty period. The criterion for an optimum policy is to minimize the expected total cost to the manufacturer during the warranty period. A development of the method is provided for the case of three functioning states. Under the policy, if a machine fails early in the warranty period, and it's deterioration before failure is large, it is economic to replace that machine with a new one.", "paper_title": "Repair and Replacement Decisions for Warranted Products Under Markov Deterioration", "paper_id": "WOS:000278535600012"}