{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "snp_genotyping"}, {"score": 0.004209369306023422, "phrase": "user-friendly_web-based_software_package"}, {"score": 0.003906357144047631, "phrase": "drug_information"}, {"score": 0.0037724857647796813, "phrase": "protein-protein_interactions"}, {"score": 0.003397683082821229, "phrase": "drugbank-based_inputs"}, {"score": 0.0032324864013225166, "phrase": "drug_brand_name"}, {"score": 0.0030906666356950887, "phrase": "pharmgkb-based_inputs"}, {"score": 0.0028113140998735366, "phrase": "disease-related_keywords"}, {"score": 0.0027420820738468577, "phrase": "drug-related_information"}, {"score": 0.0026745503978347143, "phrase": "drug_targets"}, {"score": 0.0026086775334428617, "phrase": "protein-protein_interaction_data"}, {"score": 0.0025191653363555214, "phrase": "selected_genes"}, {"score": 0.0024693979425773993, "phrase": "genotyping_analyses"}, {"score": 0.0023846534541336326, "phrase": "protein-protein_interaction-based_snp_genotyping_information"}, {"score": 0.0021907299375981356, "phrase": "immediate_information"}, {"score": 0.0021049977753042253, "phrase": "pharmacogenomics_research"}], "paper_keywords": [""], "paper_abstract": "Many drug or single nucleotide polymorphism (SNP)related resources and tools have been developed, but connecting and integrating them is still a challenge. Here, we describe a user-friendly web-based software package, named Drug-SNPing, which provides a platform for the integration of drug information (DrugBank and PharmGKB), protein-protein interactions (STRING), tagSNP selection (HapMap) and genotyping information (dbSNP, REBASE and SNP500Cancer). DrugBank-based inputs include the following: (i) common name of the drug, (ii) synonym or drug brand name, (iii) gene name (HUGO) and (iv) keywords. PharmGKB-based inputs include the following: (i) gene name (HUGO), (ii) drug name and (iii) disease-related keywords. The output provides drug-related information, metabolizing enzymes and drug targets, as well as protein-protein interaction data. Importantly, tagSNPs of the selected genes are retrieved for genotyping analyses. All drug-based and protein-protein interaction-based SNP genotyping information are provided with PCR-RFLP (PCR-restriction enzyme length polymorphism) and TaqMan probes. Thus, users can enter any drug keywords/brand names to obtain immediate information that is highly relevant to genotyping for pharmacogenomics research. Availability and implementation: Drug-SNPing and its user manual are freely available at http://bio.kuas.edu.tw/drug-snping/. Contact: chuang@isu.edu.tw; yuhuei.cheng@gmail.com; changhw@kmu.edu.tw", "paper_title": "Drug-SNPing: an integrated drug-based, protein interaction-based tagSNP-based pharmacogenomics platform for SNP genotyping", "paper_id": "WOS:000316270400012"}