{"auto_keywords": [{"score": 0.035285873941248234, "phrase": "k-nn"}, {"score": 0.034770887064529674, "phrase": "local_region"}, {"score": 0.00481495049065317, "phrase": "best_base_classifier"}, {"score": 0.004706699397060569, "phrase": "class_binarization_strategies"}, {"score": 0.004653485665080485, "phrase": "original_multi-class_problem"}, {"score": 0.004248782702870078, "phrase": "different_sub-problem"}, {"score": 0.0039684322717435045, "phrase": "voting_scheme"}, {"score": 0.0038498211283780484, "phrase": "novel_idea"}, {"score": 0.0037918465913284478, "phrase": "test_instance"}, {"score": 0.0037065115435101887, "phrase": "best_classifier"}, {"score": 0.0036368625017975343, "phrase": "ovo."}, {"score": 0.0030082398041055003, "phrase": "new_test_instance"}, {"score": 0.0027566738323014, "phrase": "novel_approach"}, {"score": 0.0027254466299651936, "phrase": "dcs_strategies"}, {"score": 0.0025843206540392184, "phrase": "k-nne"}, {"score": 0.002288519595829552, "phrase": "final_decision"}, {"score": 0.0022284577808744316, "phrase": "empirical_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Machine learning", " Supervised classification", " Decomposition strategies", " One against One", " Classifier combination", " Dynamic classifier selection"], "paper_abstract": "Class binarization strategies decompose the original multi-class problem into several binary sub-problems. One versus One (OVO) is one of the most popular class binarization techniques, which considers every pair of classes as a different sub-problem. Usually, the same classifier is applied to every sub-problem and then all the outputs are combined by some voting scheme. In this paper we present a novel idea where for each test instance we try to assign the best classifier in each sub-problem of OVO. To do so, we have used two simple Dynamic Classifier Selection (DCS) strategies that have not been yet used in this context. The two DCS strategies use K-NN to obtain the local region of the test-instance, and the classifier that performs the best for those instances in the local region, is selected to classify the new test instance. The difference between the two DCS strategies remains in the weight of the instance. In this paper we have also proposed a novel approach in those DCS strategies. We propose to use the K-Nearest Neighbor Equality (K-NNE) method to obtain the local accuracy. K-NNE is an extension of K-NN in which all the classes are treated independently: the K nearest neighbors belonging to each class are selected. In this way all the classes take part in the final decision. We have carried out an empirical study over several UCI databases, which shows the robustness of our proposal. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Dynamic selection of the best base classifier in One versus One", "paper_id": "WOS:000359331000023"}