{"auto_keywords": [{"score": 0.048734215142491696, "phrase": "trust_models"}, {"score": 0.00481495049065317, "phrase": "decision_making"}, {"score": 0.0045320819060445045, "phrase": "potential_interaction_partners"}, {"score": 0.004357927940322685, "phrase": "trust_formation"}, {"score": 0.004087207102190335, "phrase": "clear_answer"}, {"score": 0.003986509098918949, "phrase": "ad_hoc_experiments"}, {"score": 0.003958194802333944, "phrase": "present_evaluation_results"}, {"score": 0.003607834976869384, "phrase": "common_evaluation_platforms"}, {"score": 0.0034444213065548688, "phrase": "evaluation_models"}, {"score": 0.0032766780632972363, "phrase": "ad_hoc_decision"}, {"score": 0.0031731685183735508, "phrase": "trust-based_decisions"}, {"score": 0.002881793492919646, "phrase": "decision_making_mechanism"}, {"score": 0.0027318260126167684, "phrase": "alpha"}, {"score": 0.0025525322651112365, "phrase": "five_well-known_trust_models"}, {"score": 0.002445514186654732, "phrase": "decision_making_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Trust", " Reputation", " Testbed", " Evaluation", " Multi-agent system"], "paper_abstract": "Trust models are mechanisms that predict behavior of potential interaction partners. They have been proposed in several domains and many advances in trust formation have been made recently. The question of comparing trust models, however, is still without a clear answer. Traditionally, authors set up ad hoc experiments and present evaluation results that are difficult to compare - sometimes even interpret - in the context of other trust models. As a solution, the community came up with common evaluation platforms, called trust testbeds. In this paper we expose shortcomings of evaluation models that existing testbeds use; they evaluate trust models by combining them with some ad hoc decision making mechanism and then evaluate the quality of trust-based decisions. They assume that if all trust models use the same decision making mechanism, the mechanism itself becomes irrelevant for the evaluation. We hypothesized that the choice of decision making mechanism is in fact relevant. To test our claim we built a testbed, called Alpha testbed, that can evaluate trust models either with or without decision making mechanism. With it we evaluated five well-known trust models using two different decision making mechanisms. The results confirm our hypothesis; the choice of decision making mechanisms influences the performance of trust models. Based on our findings, we recommend to evaluate trust models independently of the decision making mechanism - and we also provide a method (and a tool) to do so. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Decision making matters: A better way to evaluate trust models", "paper_id": "WOS:000325600200012"}