{"auto_keywords": [{"score": 0.034484896568124125, "phrase": "hate_groups"}, {"score": 0.009459462662071542, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "online_hate_groups"}, {"score": 0.004642105253191792, "phrase": "online_personal_diaries"}, {"score": 0.004524801966077539, "phrase": "fastest_growing_types"}, {"score": 0.00449183202322304, "phrase": "web-based_media"}, {"score": 0.003866268750750096, "phrase": "new_group_members"}, {"score": 0.003754731210715724, "phrase": "virtual_communities"}, {"score": 0.003291188255149539, "phrase": "web_sites"}, {"score": 0.002948798472453167, "phrase": "semi-automated_approach"}, {"score": 0.002613056713968863, "phrase": "selected_set"}, {"score": 0.00253758084385033, "phrase": "xanga"}, {"score": 0.002419542935774618, "phrase": "interesting_demographical_and_topological_characteristics"}, {"score": 0.002315452777999619, "phrase": "smaller_ones"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["blogs", " social network analysis", " hate groups", " Web mining"], "paper_abstract": "Blogs, often treated as the equivalence of online personal diaries, have become one of the fastest growing types of Web-based media. Everyone is free to express their opinions and emotions very easily through blogs. In the blogosphere, many communities have emerged, which include hate groups and racists that are trying to share their ideology, express their views, or recruit new group members. It is important to analyze these virtual communities, defined based on membership and subscription linkages, in order to monitor for activities that are potentially harmful to society. While many Web mining and network analysis techniques have been used to analyze the content and structure of the Web sites of hate groups on the Internet, these techniques have not been applied to the study of hate groups in blogs. To address this issue, we have proposed a semi-automated approach in this research. The proposed approach consists of four modules, namely blog spider, information extraction, network analysis, and visualization. We applied this approach to identify and analyze a selected set of 28 anti-Blacks hate groups (820 bloggers) on Xanga, one of the most popular blog hosting sites. Our analysis results revealed some interesting demographical and topological characteristics in these groups, and identified at least two large communities on top of the smaller ones. The study also demonstrated the feasibility in applying the proposed approach in the study of hate groups and other related communities in blogs. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Mining communities and their relationships in blogs: A study of online hate groups", "paper_id": "WOS:000242893400006"}