{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "aggregation_problem"}, {"score": 0.011697062424936292, "phrase": "swm"}, {"score": 0.007420279954660389, "phrase": "web_services"}, {"score": 0.00679822069730222, "phrase": "available_services"}, {"score": 0.004785896736401194, "phrase": "synthesized_web_services"}, {"score": 0.0046432244185370605, "phrase": "synthesized_mediators"}, {"score": 0.004491170257043608, "phrase": "deterministic_finite-state_transducer"}, {"score": 0.004397000006837371, "phrase": "component_services"}, {"score": 0.003930953151925098, "phrase": "numeric_value"}, {"score": 0.00375634209110551, "phrase": "synthesis_rules"}, {"score": 0.0035141291835319682, "phrase": "component_templates"}, {"score": 0.003287482882222731, "phrase": "composition_syntheses"}, {"score": 0.0031035049228517715, "phrase": "users'_need"}, {"score": 0.00297454367746853, "phrase": "underlying_graph"}, {"score": 0.0028682668647074397, "phrase": "even_very_simple_cycles"}, {"score": 0.002816556934231128, "phrase": "single-exponential_time"}, {"score": 0.002517600815544647, "phrase": "lower_bounds"}, {"score": 0.002502578709228851, "phrase": "np"}, {"score": 0.0024872565591309505, "phrase": "pspace"}, {"score": 0.0024202575033591867, "phrase": "polynomial-time_solutions"}, {"score": 0.0023479408542211875, "phrase": "nondeterministic_swms"}, {"score": 0.0021896891011033105, "phrase": "complexity_bounds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Web services", " Artifacts", " Synthesis problem", " Static analysis", " Transducers"], "paper_abstract": "The paper introduces and investigates the aggregation problem for synthesized mediators of Web services (SWMs). An SWM is a deterministic finite-state transducer defined in terms of templates for component services. Upon receiving an artifact, an SWM selects a set of available services from a library to realize its templates, and invokes those services to operate on the artifact, in parallel; it produces a numeric value as output (e.g., the total price of a package) by applying synthesis rules. Given an SWM, a library and an input artifact, the aggregation problem is to find a mapping from the component templates of the SWM to available services in the library that maximizes (or minimizes) the output. As opposed to the composition syntheses of Web services, the aggregation problem aims to optimize the realization of a given mediator, to best serve the users' need. We analyze this problem, and show that its complexity depends on the underlying graph of the mediator: while it is undecidable when such graphs contain even very simple cycles, it is solvable in single-exponential time in the size of the specification (i.e., the total size of the input SWM, library and artifact) for SWMs whose underlying graphs are acyclic. We prove several results of this kind, with matching lower bounds (NP and PSPACE), and analyze restrictions that lead to polynomial-time solutions. In addition, we study the aggregation problem for nondeterministic SWMs (NSWMs). We show that the aggregation problem for NSWMs with various underlying graphs retains the same complexity as its deterministic counterparts. We also provide complexity bounds for determining whether SWMs and NSWMs terminate. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "On the aggregation problem for synthesized Web services", "paper_id": "WOS:000319368900007"}