{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "graphical_models"}, {"score": 0.0324337131484804, "phrase": "greedy_algorithm"}, {"score": 0.004735254735115024, "phrase": "new_greedy_algorithms"}, {"score": 0.004598933498016774, "phrase": "graphical_model"}, {"score": 0.004541712637353326, "phrase": "probability_distribution"}, {"score": 0.004374267836149339, "phrase": "structure_learning"}, {"score": 0.004283913685201902, "phrase": "widely_studied_problem"}, {"score": 0.00421297029755273, "phrase": "greedy_approaches"}, {"score": 0.003505749731180509, "phrase": "naive_greedy_algorithm"}, {"score": 0.0033482708495261864, "phrase": "high_correlations"}, {"score": 0.0031712256091350316, "phrase": "recursive_greedy_algorithm"}, {"score": 0.003028727936200845, "phrase": "inner_loop"}, {"score": 0.0029291198314113608, "phrase": "last_added_node"}, {"score": 0.0028446460307503343, "phrase": "second_forward-backward_greedy_algorithm"}, {"score": 0.002551612225562499, "phrase": "previous_steps"}, {"score": 0.002337066031028783, "phrase": "analytical_guarantees"}, {"score": 0.00231759652007697, "phrase": "empirical_performance"}, {"score": 0.0022226496830385304, "phrase": "strong_non-neighbor_interactions"}, {"score": 0.0021049977753042253, "phrase": "previous_greedy_and_convex_optimization-based_algorithms"}], "paper_keywords": ["Graphical models", " greedy algorithms", " forward-backward algorithms", " conditional entropy"], "paper_abstract": "We propose new greedy algorithms for learning the structure of a graphical model of a probability distribution, given samples drawn from the distribution. While structure learning of graphical models is a widely studied problem with several existing methods, greedy approaches remain attractive due to their low computational cost. The most natural greedy algorithm would be one which, essentially, adds neighbors to a node in sequence until stopping; it would do this for each node. While it is fast, simple and parallel, this naive greedy algorithm has the tendency to add non-neighbors that show high correlations with the given node. Our new algorithms overcome this problem in three different ways. The recursive greedy algorithm iteratively recovers the neighbors by running the greedy algorithm in an inner loop, but each time only adding the last added node to the neighborhood set. The second forward-backward greedy algorithm includes a node deletion step in each iteration that allows non-neighbors to be removed from the neighborhood set which may have been added in the previous steps. Finally, the greedy algorithm with pruning runs the greedy algorithm until completion and then removes all the incorrect neighbors. We provide both analytical guarantees and empirical performance for our algorithms. We show that in graphical models with strong non-neighbor interactions, our greedy algorithms can correctly recover the graph, whereas the previous greedy and convex optimization-based algorithms do not succeed.", "paper_title": "Improved Greedy Algorithms for Learning Graphical Models", "paper_id": "WOS:000354943600032"}