{"auto_keywords": [{"score": 0.034375984487247074, "phrase": "distance_measures"}, {"score": 0.0076310885154507995, "phrase": "original_data"}, {"score": 0.00481495049065317, "phrase": "experiencing_sax"}, {"score": 0.004502943680955863, "phrase": "data_mining"}, {"score": 0.00445293569103488, "phrase": "fourier_transforms"}, {"score": 0.004354572391793908, "phrase": "piecewise_polynomial_models"}, {"score": 0.004226778595997366, "phrase": "symbolic_representations"}, {"score": 0.00395273370234774, "phrase": "data_structures"}, {"score": 0.0038798015183611275, "phrase": "text_processing_and_bioinformatics_communities"}, {"score": 0.00353476609156032, "phrase": "symbolic_representation"}, {"score": 0.0031845067058084583, "phrase": "symbolic_approaches"}, {"score": 0.0030565692640988585, "phrase": "original_time_series"}, {"score": 0.00296675450822924, "phrase": "new_symbolic_representation"}, {"score": 0.002712794864739074, "phrase": "symbolic_approach"}, {"score": 0.002613487968156893, "phrase": "original_series"}, {"score": 0.0025366596616434793, "phrase": "latter_feature"}, {"score": 0.00241658945942583, "phrase": "efficiently_manipulated_symbolic_representation"}, {"score": 0.0023807981747706376, "phrase": "identical_results"}, {"score": 0.0021207658298095845, "phrase": "anomaly_detection"}, {"score": 0.0021049977753042253, "phrase": "motif_discovery"}], "paper_keywords": ["time series", " data mining", " symbolic representation", " discretize"], "paper_abstract": "Many high level representations of time series have been proposed for data mining, including Fourier transforms, wavelets, eigenwaves, piecewise polynomial models, etc. Many researchers have also considered symbolic representations of time series, noting that such representations would potentiality allow researchers to avail of the wealth of data structures and algorithms from the text processing and bioinformatics communities. While many symbolic representations of time series have been introduced over the past decades, they all suffer from two fatal flaws. First, the dimensionality of the symbolic representation is the same as the original data, and virtually all data mining algorithms scale poorly with dimensionality. Second, although distance measures can be defined on the symbolic approaches, these distance measures have little correlation with distance measures defined on the original time series. In this work we formulate a new symbolic representation of time series. Our representation is unique in that it allows dimensionality/numerosity reduction, and it also allows distance measures to be defined on the symbolic approach that lower bound corresponding distance measures defined on the original series. As we shall demonstrate, this latter feature is particularly exciting because it allows one to run certain data mining algorithms on the efficiently manipulated symbolic representation, while producing identical results to the algorithms that operate on the original data. In particular, we will demonstrate the utility of our representation on various data mining tasks of clustering, classification, query by content, anomaly detection, motif discovery, and visualization.", "paper_title": "Experiencing SAX: a novel symbolic representation of time series", "paper_id": "WOS:000248894200001"}