{"auto_keywords": [{"score": 0.04939323296666451, "phrase": "malawi"}, {"score": 0.04838191025574542, "phrase": "financial_effects"}, {"score": 0.04437609856318176, "phrase": "transcription_time"}, {"score": 0.04391719912419564, "phrase": "laboratory_use"}, {"score": 0.04026540488337874, "phrase": "emr_systems"}, {"score": 0.03902337172601959, "phrase": "low-income_settings"}, {"score": 0.032423354223579885, "phrase": "emr_system"}, {"score": 0.00481495049065317, "phrase": "electronic_medical_record_system"}, {"score": 0.004780334370089564, "phrase": "lilongwe"}, {"score": 0.0037944877702825747, "phrase": "usa"}, {"score": 0.0037398806676032068, "phrase": "ambulatory_data"}, {"score": 0.003646516176920946, "phrase": "potential_savings"}, {"score": 0.0034792431564692997, "phrase": "touchscreen_point"}, {"score": 0.0034293295415901807, "phrase": "care_emr_system"}, {"score": 0.0033557940171476683, "phrase": "estimated_cost_savings"}, {"score": 0.003011033940247791, "phrase": "net_financial_gain"}, {"score": 0.0029146651796243704, "phrase": "estimated_net_benefit"}, {"score": 0.002760836859397696, "phrase": "potential_financial_benefits"}, {"score": 0.0026532001044943096, "phrase": "higher_discount_rates"}, {"score": 0.0026151058979100596, "phrase": "net_benefit"}, {"score": 0.0025040655195012465, "phrase": "financial_benefits"}, {"score": 0.002423882939663573, "phrase": "low-income_setting"}, {"score": 0.002337791830793841, "phrase": "greater_detail"}, {"score": 0.0022876085523721324, "phrase": "different_levels"}, {"score": 0.002230418233881411, "phrase": "post-implementation_data"}], "paper_keywords": [""], "paper_abstract": "Objective To model the financial effects of implementing a hospital-wide electronic medical record (EMR) system in a tertiary facility in Malawi. Materials and Methods We evaluated three areas of impact: length of stay, transcription time, and laboratory use. We collected data on expenditures in these categories under the paper-based (pre-EMR) system, and then estimated reductions in each category based on findings from EMR systems in the USA and backed by ambulatory data from low-income settings. We compared these potential savings accrued over a period of 5 years with the costs of implementing the touchscreen point-of-care EMR system at that site. Results Estimated cost savings in length of stay, transcription time, and laboratory use totaled US $284 395 annually. When compared with the costs of installing and sustaining the EMR system, there is a net financial gain by the third year of operation. Over 5 years the estimated net benefit was US$613 681. Discussion Despite considering only three categories of savings, this analysis demonstrates the potential financial benefits of EMR systems in low-income settings. The results are robust to higher discount rates, and a net benefit is realized even under more conservative assumptions. Conclusions This model demonstrates that financial benefits could be realized with an EMR system in a low-income setting. Further studies will examine these and other categories in greater detail, study the financial effects at different levels of organization, and benefit from post-implementation data. This model will be further improved by substituting its assumptions for evidence as we conduct more detailed studies.", "paper_title": "Modeling return on investment for an electronic medical record system in Lilongwe, Malawi", "paper_id": "WOS:000320168600021"}