{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vibrio_fischeri"}, {"score": 0.004775726266706856, "phrase": "p_systems"}, {"score": 0.004659951478263083, "phrase": "cell-density-dependent_gene_regulation_system"}, {"score": 0.0045284072672385975, "phrase": "bacterial_cells"}, {"score": 0.004293840838533456, "phrase": "coordinated_way"}, {"score": 0.003892126266260425, "phrase": "membrane_systems"}, {"score": 0.00347054319869429, "phrase": "gillespie's_algorithm"}, {"score": 0.0034141653138871483, "phrase": "gillespie"}, {"score": 0.0031845067058084583, "phrase": "chemical_substances"}, {"score": 0.0029824560656987855, "phrase": "individual_behavior"}, {"score": 0.0028510114763213596, "phrase": "emergent_behavior"}, {"score": 0.002637433799290365, "phrase": "low_cell_densities"}, {"score": 0.0025628355581338563, "phrase": "high_cell_densities"}, {"score": 0.0024700078414481297, "phrase": "recruitment_process"}, {"score": 0.0024099937116733227, "phrase": "whole_colony"}, {"score": 0.0022477377970612847, "phrase": "new_applications"}, {"score": 0.002229380111189829, "phrase": "multiple_agents"}, {"score": 0.0021049977753042253, "phrase": "local_environment"}], "paper_keywords": ["quorum sensing", " Vibrio fischeri", " membrane computing", " Gillespie's algorithm", " emergent behavior"], "paper_abstract": "Quorum sensing is a cell-density-dependent gene regulation system that allows an entire population of bacterial cells to communicate in order to regulate the expression of certain or specific genes in a coordinated Way depending on the size of the population. We present a model of the quorum sensing system in Vibrio fischeri using a variant of membrane systems called P systems. In this framework each bacterium and the environment are represented by membranes, and the rules are applied according to an extension of Gillespie's algorithm called the muldcompartmental Gillespie's algorithm. This algorithm runs on more than one compartment and takes into account the disturbance produced when chemical substances diffuse from one compartment or region to another one. Our approach allows us to examine the individual behavior of each bacterium as an agent as well as the emergent behavior of the colony as a whole and the processes of swarming and recruitment. Our simulations show that at low cell densities bacteria remain dark, while at high cell densities some bacteria start to produce light and a recruitment process takes place that makes the whole colony of bacteria do so. Our computational modeling of quorum sensing could provide insights leading to new applications where multiple agents need to robustly and efficiently coordinate their collective behavior based only on very limited information about the local environment.", "paper_title": "A model of the quorum sensing system in vibrio fischeri using p systems", "paper_id": "WOS:000252248700007"}