{"auto_keywords": [{"score": 0.04965333175972822, "phrase": "sponsored_search"}, {"score": 0.04481106888920391, "phrase": "search_engines"}, {"score": 0.04386048920398296, "phrase": "ad_clicks"}, {"score": 0.03708007594864935, "phrase": "user_clicks"}, {"score": 0.00481495049065317, "phrase": "user_click_behavior"}, {"score": 0.004666756595735701, "phrase": "major_business_model"}, {"score": 0.004625255533545965, "phrase": "commercial_search_engines"}, {"score": 0.0044231966846655394, "phrase": "key_indicator"}, {"score": 0.003093249591867931, "phrase": "factor_graph_model"}, {"score": 0.002971182100871581, "phrase": "user_click_behaviors"}, {"score": 0.0025632898741546556, "phrase": "newly-proposed_concept"}, {"score": 0.0025291018422967083, "phrase": "proposed_model"}, {"score": 0.0023754752864092437, "phrase": "attractive_words"}, {"score": 0.0021720199689914464, "phrase": "proposed_approach"}, {"score": 0.0021526564019119466, "phrase": "real_world_datasets"}, {"score": 0.0021239335561699106, "phrase": "quantitative_evaluations"}, {"score": 0.0021049977753042253, "phrase": "informative_case_studies"}], "paper_keywords": ["Sponsored search", " User study", " User model"], "paper_abstract": "Sponsored search is the major business model of commercial search engines. The number of clicks on ads is a key indicator of success for both advertisers and search engines, and therefore increasing ad clicks is a goal of both of them. Many existing works stand on the view of search engines concerning how to help search engines to earn more revenue by accurately predicting ad clicks. Unlike these works, this paper aims at understanding user clicks on ads from \"the view of advertisers\", in order to help advertisers to improve their ad quality and therefore advertising effectiveness. To do this, a factor graph model is proposed, which considers two advertiser-controllable factors to understand user click behaviors: (1) the relevance between a query and an ad, which has been well studied in the literature, and (2) the \"attractiveness\" of the ad, which is a newly-proposed concept. The proposed model can be used to predict user clicks and also to mine a set of attractive words that could be leveraged to improve the quality of the ads. We have verified the effectiveness of the proposed approach using real world datasets, through quantitative evaluations and informative case studies. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Advertiser-centric approach to understand user click behavior in sponsored search", "paper_id": "WOS:000337647300016"}