{"auto_keywords": [{"score": 0.03820142189580796, "phrase": "demand_statistics"}, {"score": 0.023009307966263912, "phrase": "high-dimensional_regime"}, {"score": 0.010214550221490495, "phrase": "content_placement"}, {"score": 0.00481495049065317, "phrase": "unknown_demand"}, {"score": 0.004222388726840072, "phrase": "content_types"}, {"score": 0.0041023644174418205, "phrase": "online_fashion"}, {"score": 0.0038848460244394526, "phrase": "algorithmic_task"}, {"score": 0.0035741900278634616, "phrase": "relative_popularity"}, {"score": 0.003154012038613403, "phrase": "consistent_estimation"}, {"score": 0.0030741085942960814, "phrase": "large_numbers"}, {"score": 0.0026184796288543878, "phrase": "remaining_demands"}, {"score": 0.0024874156497091994, "phrase": "simple_adaptive_scheme"}, {"score": 0.0023857603808363527, "phrase": "idle_servers"}, {"score": 0.0021049977753042253, "phrase": "subsequent_use"}], "paper_keywords": ["Content delivery systems", " Large-scale systems", " Content replication strategies", " Matchings"], "paper_abstract": "In this paper, we look at content placement in the high-dimensional regime: there are servers, and distinct types of content. Each server can store and serve types at any given time. Demands for these content types arrive and have to be served in an online fashion; over time, there are a total of of these demands. We consider the algorithmic task of content placement: determining which types of content should be on which server at any given time, in the setting where the demand statistics (i.e., the relative popularity of each type of content) are not known a-priori, but have to be inferred from the very demands we are trying to satisfy. This is the high-dimensional regime because this scaling (everything being ) prevents consistent estimation of demand statistics; it models many modern settings where large numbers of users, servers, and videos/webpages interact in this way. We characterize the performance of any scheme that separates learning and placement (i.e., which uses a portion of the demands to gain some estimate of the demand statistics, and then uses the same for the remaining demands), showing it is order-wise strictly suboptimal. We then study a simple adaptive scheme-which myopically attempts to store the most recently requested content on idle servers-and show it outperforms schemes that separate learning and placement. Our results also generalize to the setting where the demand statistics change with time. Overall, our results demonstrate that separating the estimation of demand, and the subsequent use of the same, is strictly suboptimal.", "paper_title": "Serving content with unknown demand: the high-dimensional regime", "paper_id": "WOS:000361903700005"}