{"auto_keywords": [{"score": 0.04310416641082635, "phrase": "weight_map"}, {"score": 0.013232489800110598, "phrase": "sample_size"}, {"score": 0.00881491984848148, "phrase": "clinical_data"}, {"score": 0.00481495049065317, "phrase": "measurement_weight_maps"}, {"score": 0.004731928080086235, "phrase": "required_sample_size"}, {"score": 0.004630150894006861, "phrase": "fully_automatic_statistical_framework"}, {"score": 0.00428146713705618, "phrase": "spatially_defined_grid"}, {"score": 0.004225950334493496, "phrase": "numerical_optimization_scheme"}, {"score": 0.0037903327482565097, "phrase": "relative_importance"}, {"score": 0.0037411604449359794, "phrase": "different_areas"}, {"score": 0.0036288825833675127, "phrase": "resulting_sample_size_reduction"}, {"score": 0.003581797255879607, "phrase": "important_end_goal"}, {"score": 0.0035199624440843892, "phrase": "data_collection"}, {"score": 0.0033699898113395328, "phrase": "clinical_studies"}, {"score": 0.0032830808525570903, "phrase": "patient_burden"}, {"score": 0.002893505913503472, "phrase": "better_clinical_understanding"}, {"score": 0.002722288966917744, "phrase": "synthetic_data"}, {"score": 0.002663620639539737, "phrase": "knee_cartilage_mri."}, {"score": 0.002462664392109308, "phrase": "kellgren-lawrence_osteoarthritis_severity_scale"}, {"score": 0.0024095777415804346, "phrase": "uniform_weight_map"}, {"score": 0.0023168823213024856, "phrase": "cartilage_thickness_measurements"}, {"score": 0.0022472527731744974, "phrase": "morphometric_and_textural_based_imaging_features"}, {"score": 0.0021607883988873492, "phrase": "articular_cartilage"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cartilage", " Osteoarthritis", " Weight map", " Sample size", " Magnetic resonance imaging"], "paper_abstract": "We propose a fully automatic statistical framework for identifying the non-negative, real-valued weight map that best discriminate between two groups of objects. Given measurements on a spatially defined grid, a numerical optimization scheme is used to find the weight map that minimizes the sample size required to discriminate the two groups. The weight map produced by the method reflects the relative importance of the different areas in the objects, and the resulting sample size reduction is an important end goal in situations where data collection is difficult or expensive. An example is in clinical studies where the cost and the patient burden are directly related to the number of participants needed for the study. In addition, inspection of the weight map might provide clues that can lead to a better clinical understanding of the objects and pathologies being studied. The method is evaluated on synthetic data and on clinical data from knee cartilage MRI. The clinical data contain a total of 159 subjects aged 21-81 years and ranked from zero to four on the Kellgren-Lawrence osteoarthritis severity scale. Compared to a uniform weight map, we achieve sample size reductions up to 58% for cartilage thickness measurements. Based on quantifications from both morphometric and textural based imaging features, we also identify the most pathological areas in the articular cartilage. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A framework for optimizing measurement weight maps to minimize the required sample size", "paper_id": "WOS:000278255900002"}