{"auto_keywords": [{"score": 0.045388018187621997, "phrase": "partial_assimilation"}, {"score": 0.00481495049065317, "phrase": "technology_assimilation_gaps"}, {"score": 0.004448892453489832, "phrase": "initial_usage"}, {"score": 0.004126840854872329, "phrase": "erroneous_understanding"}, {"score": 0.0040943214728975845, "phrase": "technology_adoption"}, {"score": 0.003919973783578995, "phrase": "serious_academic_attention"}, {"score": 0.0035648266669315943, "phrase": "remedial_steps"}, {"score": 0.003306559295382181, "phrase": "third-party_business"}, {"score": 0.003042752533935891, "phrase": "different_perceptions"}, {"score": 0.0027999339042953076, "phrase": "price_negotiation"}, {"score": 0.0027778413437997613, "phrase": "message_archiving"}, {"score": 0.0026911959223982727, "phrase": "different_moderating_impacts"}, {"score": 0.002546002312015341, "phrase": "competitive_pressure"}, {"score": 0.0025259082947443343, "phrase": "institutional_norms"}, {"score": 0.0025059724686541263, "phrase": "technology_usage"}, {"score": 0.002486193594641237, "phrase": "work_practices"}, {"score": 0.0022250978492127163, "phrase": "low_relational_norms"}, {"score": 0.00212175050242788, "phrase": "high_relational_norms"}, {"score": 0.0021049977753042253, "phrase": "theoretical_and_practical_implications"}], "paper_keywords": ["partial assimilation", " technology adoption", " B2B e-markets", " TOE framework", " risk", " small firm", " interpretivist case study"], "paper_abstract": "Prior research mentions that there may be technology assimilation gaps in that a technology may be cumulatively assimilated over a period of time depending on knowledge and experience from initial usage. Thus, stages of partial assimilation are indicated that, if not accounted for, could lead to erroneous understanding of technology adoption and diffusion. However, the phenomenon has not received serious academic attention, and there is still a lack of understanding as to when and why partial assimilation may occur, its consequences to organizations, and remedial steps that could be taken to minimize it. We investigate these issues in the context of assimilation of third-party business-to-business (B2B) e-market by four small firms. Our findings reveal that partial assimilation occurred because of different perceptions of benefit and risk of the two different features of the B2B e-marketthe informational (buyer/supplier and product information) and the transactional (auction, request for quote, price negotiation, message archiving, payment systems), arising from different moderating impacts of the organizational (relational norms and the type of business handled) and environmental (perceptions of competitive pressure and institutional norms of technology usage and work practices) contexts of deployment and usage of the two features. The consequences of partial assimilation were mixed; while it was found to be detrimental to firms with low relational norms with their clients, it proved to be gainful for firms with high relational norms. Theoretical and practical implications of the findings are discussed.", "paper_title": "Partial Assimilation of Technology: Prognosis and Remedial Measures", "paper_id": "WOS:000290402400001"}