{"auto_keywords": [{"score": 0.04830379302606464, "phrase": "nondeterministic_automata"}, {"score": 0.011192014229243256, "phrase": "nondeterministic_automaton"}, {"score": 0.008370663088477257, "phrase": "deterministic_buchi_automata"}, {"score": 0.007166431475380322, "phrase": "l_iff"}, {"score": 0.00481495049065317, "phrase": "nondeterministic_and_deterministic_automata"}, {"score": 0.004691535580316217, "phrase": "relative_succinctness"}, {"score": 0.004658426838467567, "phrase": "different_classes"}, {"score": 0.00456048955007958, "phrase": "best_translation"}, {"score": 0.004528301408585875, "phrase": "nondeterministic_buchi_automaton"}, {"score": 0.004496339426268177, "phrase": "nondeterministic_co-buchi_automaton"}, {"score": 0.004309229446929411, "phrase": "annoying_situation"}, {"score": 0.004043003243656031, "phrase": "direct_applications"}, {"score": 0.004023947242621452, "phrase": "formal_verification"}, {"score": 0.0038111292260056264, "phrase": "expressive_power"}, {"score": 0.0037752839447145014, "phrase": "landweber"}, {"score": 0.003757480190200645, "phrase": "languages_l_subset"}, {"score": 0.0036180661410484777, "phrase": "regular_language_r_subset"}, {"score": 0.0036015455826063575, "phrase": "sigma"}, {"score": 0.0034428776029411974, "phrase": "l_iff_w"}, {"score": 0.003426640459083931, "phrase": "infinitely_many_prefixes"}, {"score": 0.003410653206980441, "phrase": "r."}, {"score": 0.003354512579528854, "phrase": "infinite_words"}, {"score": 0.0033150974333333244, "phrase": "finite_words"}, {"score": 0.002966438503447793, "phrase": "deterministic_co-buchi_automata"}, {"score": 0.0027567336518542858, "phrase": "deterministic_automata"}, {"score": 0.0025316905609748135, "phrase": "different_limit_operators"}, {"score": 0.0023862855595544017, "phrase": "polynomial_translation"}, {"score": 0.0023415390666563177, "phrase": "exponential_lower_bound"}], "paper_keywords": [""], "paper_abstract": "Much is known about the differences in expressiveness and succinctness between nondeterministic and deterministic automata on infinite words. Much less is known about the relative succinctness of the different classes of nondeterministic automata. For example, while the best translation from a nondeterministic Buchi automaton to a nondeterministic co-Buchi automaton is exponential, and involves determinization, no super-linear lower bound is known. This annoying situation, of not being able to use the power of nondeterminism, nor to show that it is powerless, is shared by more problems, with direct applications in formal verification. In this paper we study a family of problems of this class. The problems originate from the study of the expressive power of deterministic Buchi automata: Landweber characterizes languages L subset of Sigma(omega) that are recognizable by deterministic Buchi automata as those for which there is a regular language R subset of Sigma* such that L is the limit of R; that is, w is an element of L iff w has infinitely many prefixes in R. Two other operators that induce a language of infinite words from a language of finite words are co-limit, where w is an element of L iff w has only finitely many prefixes in R, and persistent-limit, where w is an element of L iff almost all the prefixes of w are in R. Both co-limit and persistent-limit define languages that are recognizable by deterministic co-Buchi automata. They define them, however, by means of nondeterministic automata. While co-limit is associated with complementation, persistent-limit is associated with universality. For the three limit operators, the deterministic automata for R and L share the same structure. It is not clear, however, whether and how it is possible to relate nondeterministic automata for R and L, or to relate nondeterministic automata to which different limit operators are applied. In the paper, we show that the situation is involved: in some cases we are able to describe a polynomial translation, whereas in some we present an exponential lower bound. For example, going from a nondeterministic automaton for R to a nondeterministic automaton for its limit is polynomial, whereas going to a nondeterministic automaton for its persistent limit is exponential. Our results show that the contribution of nondeterminism to the succinctness of an automaton does depend upon its semantics.", "paper_title": "On the succinctness of nondeterminism", "paper_id": "WOS:000241648200012"}