{"auto_keywords": [{"score": 0.03297239699254785, "phrase": "time_step"}, {"score": 0.00481495049065317, "phrase": "runge-kutta-legendre"}, {"score": 0.004786688043661919, "phrase": "explicit_super-time-stepping"}, {"score": 0.004721382737981198, "phrase": "parabolic_partial_differential_equations"}, {"score": 0.0046296248058334925, "phrase": "dominant_hyperbolic_part"}, {"score": 0.004593420592240877, "phrase": "sub-dominant_parabolic_component"}, {"score": 0.0042968467346293105, "phrase": "super-time-stepping_methods"}, {"score": 0.004246525553083277, "phrase": "mixed_type"}, {"score": 0.004238195927297947, "phrase": "partial_differential_equations"}, {"score": 0.004213304539691186, "phrase": "intermediate_position"}, {"score": 0.004139500454411233, "phrase": "explicit_runge-kutta-like_time-steps"}, {"score": 0.004003587635779192, "phrase": "single_explicit_time-step"}, {"score": 0.00391802185626525, "phrase": "short_recursion_relation"}, {"score": 0.0038950035305437, "phrase": "explicit_runge-kutta_scheme"}, {"score": 0.00387211991148067, "phrase": "recursion_relation"}, {"score": 0.00378191692542207, "phrase": "second-order_accurate_super-time-stepping_methods"}, {"score": 0.0037304020968453432, "phrase": "chebyshev"}, {"score": 0.003643357869409587, "phrase": "chebyshev_polynomials"}, {"score": 0.0035306076442274503, "phrase": "temporally_first-_and_second-order_accurate_super-time-stepping_methods"}, {"score": 0.0034825309480092156, "phrase": "legendre"}, {"score": 0.0031939093697520857, "phrase": "one-dimensional_problems"}, {"score": 0.002987423662437987, "phrase": "diffusion_coefficient"}, {"score": 0.002964023414385732, "phrase": "maximum_value"}, {"score": 0.002849735234642581, "phrase": "parabolic_problems"}, {"score": 0.002838550947405985, "phrase": "variable_diffusion_coefficients"}, {"score": 0.0028163135133300603, "phrase": "variable_coefficient_parabolic_equations"}, {"score": 0.00277781520922597, "phrase": "symmetric_terms"}, {"score": 0.002734459363496404, "phrase": "convex_monotonicity"}, {"score": 0.0027130351725004713, "phrase": "one-dimensional_and_two-dimensional_von_neumann_stability_analyses"}, {"score": 0.0025525755435258724, "phrase": "detailed_accuracy_analysis"}, {"score": 0.0024930350765462214, "phrase": "stringent_set"}, {"score": 0.0024832472355149886, "phrase": "test_problems"}, {"score": 0.002378078350097966, "phrase": "non-linear_heat_conduction"}, {"score": 0.002354802928082701, "phrase": "ambipolar_diffusion"}, {"score": 0.0022863315010012175, "phrase": "prior_paper"}, {"score": 0.0022684133966310556, "phrase": "balsara"}, {"score": 0.0022595027477998286, "phrase": "aslam"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Numerical methods", " Super-time-stepping", " Parabolic operators", " PDEs"], "paper_abstract": "Parabolic partial differential equations appear in several physical problems, including problems that have a dominant hyperbolic part coupled to a sub-dominant parabolic component. Explicit methods for their solution are easy to implement but have very restrictive time step constraints. Implicit solution methods can be unconditionally stable but have the disadvantage of being computationally costly or difficult to implement. Super-time-stepping methods for treating parabolic terms in mixed type partial differential equations occupy an intermediate position. In such methods each superstep takes \"s\" explicit Runge-Kutta-like time-steps to advance the parabolic terms by a time-step that is s(2) times larger than a single explicit time-step. The expanded stability is usually obtained by mapping the short recursion relation of the explicit Runge-Kutta scheme to the recursion relation of some well-known, stable polynomial. Prior work has built temporally first- and second-order accurate super-time-stepping methods around the recursion relation associated with Chebyshev polynomials. Since their stability is based on the boundedness of the Chebyshev polynomials, these methods have been called RKC1 and RKC2. In this work we build temporally first- and second-order accurate super-time-stepping methods around the recursion relation associated with Legendre polynomials. We call these methods RKL1 and RKL2. The RKL1 method is first-order accurate in time; the RKL2 method is second-order accurate in time. We verify that the newly-designed RKL1 and RKL2 schemes have a very desirable monotonicity preserving property for one-dimensional problems - a solution that is monotone at the beginning of a time step retains that property at the end of that time step. It is shown that RKL1 and RKL2 methods are stable for all values of the diffusion coefficient up to the maximum value. We call this a convex monotonicity preserving property and show by examples that it is very useful in parabolic problems with variable diffusion coefficients. This includes variable coefficient parabolic equations that might give rise to skew symmetric terms. The RKC1 and RKC2 schemes do not share this convex monotonicity preserving property. One-dimensional and two-dimensional von Neumann stability analyses of RKC1, RKC2, RKL1 and RKL2 are also presented, showing that the latter two have some advantages. The paper includes several details to facilitate implementation. A detailed accuracy analysis is presented to show that the methods reach their design accuracies. A stringent set of test problems is also presented. To demonstrate the robustness and versatility of our methods, we show their successful operation on problems involving linear and non-linear heat conduction and viscosity, resistive magnetohydrodynamics, ambipolar diffusion dominated magnetohydrodynamics, level set methods and flux limited radiation diffusion. In a prior paper (Meyer, Balsara and Aslam 2012 [36]) we have also presented an extensive test-suite showing that the RKL2 method works robustly in the presence of shocks in an anisotropically conducting, magnetized plasma. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A stabilized Runge-Kutta-Legendre method for explicit super-time-stepping of parabolic and mixed equations", "paper_id": "WOS:000327483200029"}