{"auto_keywords": [{"score": 0.047541398453861426, "phrase": "grammar_checker"}, {"score": 0.006644847881576064, "phrase": "swedish"}, {"score": 0.00481495049065317, "phrase": "language_environment"}, {"score": 0.0047823219739028325, "phrase": "second_language_writers"}, {"score": 0.0046857508651690916, "phrase": "field_study"}, {"score": 0.004529093447865156, "phrase": "real_writing_tasks"}, {"score": 0.004483120978156604, "phrase": "advanced_course"}, {"score": 0.004437613070853689, "phrase": "swedish_university"}, {"score": 0.004089725258435817, "phrase": "second_language"}, {"score": 0.0040619911719900976, "phrase": "sixteen_students"}, {"score": 0.004034444399739595, "phrase": "different_linguistic_and_cultural_backgrounds"}, {"score": 0.003939487754302632, "phrase": "judgment_procedure"}, {"score": 0.0037562016088622447, "phrase": "students'_texts"}, {"score": 0.002755338691613447, "phrase": "different_aspects"}, {"score": 0.002627000223796678, "phrase": "language_exploration"}, {"score": 0.0025914395870574787, "phrase": "important_processes"}, {"score": 0.002547663224855668, "phrase": "second-language_learning_environments"}, {"score": 0.002487612781045517, "phrase": "design_principles"}, {"score": 0.002222994077182071, "phrase": "grammatical_categories"}, {"score": 0.0021928902836049384, "phrase": "language_use"}, {"score": 0.0021049977753042253, "phrase": "language_comprehension"}], "paper_keywords": ["adult learning", " evaluation of CAL systems", " human-computer interface", " interactive learning environments"], "paper_abstract": "This paper presents a field study carried out with learners who used a grammar checker in real writing tasks in an advanced course at a Swedish university. The objective of the study was to investigate how students made use of the grammar checker in their writing while learning Swedish as a second language. Sixteen students with different linguistic and cultural backgrounds participated in the study. A judgment procedure was conducted by the learners on the alarms from the grammar checker. The students' texts were also collected in two versions; a version written before the session with the grammar checker, and a version after the session. This procedure made it possible to study to what extent the students followed the advice from the grammar checker, and how this was related to their judgments of its behavior. The results obtained demonstrated that although most of the alarms from the grammar checker were accurate, some alarms were very hard for the students to judge correctly. The results also showed that providing the student with feedback on different aspects of their target language use; not only on their errors, and facilitating the processes of language exploration and reflection are important processes to be supported in second-language learning environments. Based on these results, design principles were identified and integrated in the development of Grim, an interactive language-learning program for Swedish. We present the design of Grim, which is grounded in visualization of grammatical categories and examples of language use, providing tools for both focus on linguistic code features and language comprehension. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Designing and developing a language environment for second language writers", "paper_id": "WOS:000250024100011"}