{"auto_keywords": [{"score": 0.04453434144809212, "phrase": "different_users"}, {"score": 0.004518442937844318, "phrase": "content-based_method"}, {"score": 0.004457309741979921, "phrase": "semi-automatic_organization"}, {"score": 0.003907212558276185, "phrase": "similar_semantic_content"}, {"score": 0.003584025547693836, "phrase": "unlabeled_pictures"}, {"score": 0.0035194572615570977, "phrase": "proposed_labels"}, {"score": 0.0029076695661972114, "phrase": "suitable_feature_representation"}, {"score": 0.002816556934231128, "phrase": "different_classes"}, {"score": 0.002423931101340771, "phrase": "multiple_users"}, {"score": 0.002391067964886602, "phrase": "quantitative_evaluation"}, {"score": 0.0023586493263143553, "phrase": "proposed_approach"}, {"score": 0.0022743274702883456, "phrase": "user_interaction"}, {"score": 0.0021049977753042253, "phrase": "photo-sharing_community"}], "paper_keywords": ["Personal photography", " Automatic image annotation", " Content-based image analysis", " Social image retrieval"], "paper_abstract": "In this paper, we propose a content-based method the for semi-automatic organization of photo albums based on the analysis of how different users organize their own pictures. The goal is to help the user in dividing his pictures into groups characterized by a similar semantic content. The method is semi-automatic: the user starts to assign labels to the pictures and unlabeled pictures are tagged with proposed labels. The user can accept the recommendation or made a correction. To formulate the suggestions is exploited the knowledge encoded in how other users have partitioned their images. The method is conceptually articulated in two parts. First, we use a suitable feature representation of the images to model the different classes that the users have collected, second, we look for correspondences between the criteria used by the different users. Boosting is used to integrate the information provided by the analysis of multiple users. A quantitative evaluation of the proposed approach is obtained by simulating the amount of user interaction needed to annotate the albums of a set of members of the flickr (R) photo-sharing community.", "paper_title": "With a little help from my friends Community-based assisted organization of personal photographs", "paper_id": "WOS:000336995900020"}