{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stepping_stones"}, {"score": 0.008642708847914385, "phrase": "abnormal_causality_probability"}, {"score": 0.006381315736937574, "phrase": "evasive_techniques"}, {"score": 0.004697655699119423, "phrase": "real_source"}, {"score": 0.004640079189342692, "phrase": "internet_attacks"}, {"score": 0.004545675105321216, "phrase": "important_but_difficult_problem"}, {"score": 0.004416713079266374, "phrase": "real_world"}, {"score": 0.004409039912606921, "phrase": "previous_works"}, {"score": 0.0041184843463633386, "phrase": "compromised_systems"}, {"score": 0.003920128102807887, "phrase": "similar_features"}, {"score": 0.0038720442355114045, "phrase": "network_traffic"}, {"score": 0.003808845109556467, "phrase": "packet_timestamps"}, {"score": 0.003352658916650986, "phrase": "appropriate_threshold"}, {"score": 0.0030372426452745073, "phrase": "consistent_causality_probability"}, {"score": 0.0029027394930867902, "phrase": "abnormal_causality_probabilities"}, {"score": 0.0028553159147435424, "phrase": "different_network_conditions"}, {"score": 0.0027064605585684696, "phrase": "self-adaptive_methods"}, {"score": 0.0025865679621853667, "phrase": "theoretic_analysis_and_empirical_studies"}], "paper_keywords": ["intrusion detection", " causality probability", " stepping stones"], "paper_abstract": "Locating the real source of the Internet attacks has long been an important but difficult problem to be addressed. In the real world, attackers can easily hide their identities and evade punishment by relaying their attacks through a series of compromised systems or devices called stepping stones. Currently, researchers mainly use similar features from the network traffic, such as packet timestamps and frequencies, to detect stepping stones. However, these features can be easily destroyed by attackers using evasive techniques. In addition, it is also difficult to implement an appropriate threshold of similarity that can help justify the stepping stones. In order to counter these problems, in this paper, we introduce the consistent causality probability to detect the stepping stones. We formulate the ranges of abnormal causality probabilities according to the different network conditions, and on the basis of it, we further implement to self-adaptive methods to capture stepping stones. To evaluate our proposed detection methods, we adopt theoretic analysis and empirical studies, which demonstrate accuracy of the abnormal causality probability. Moreover, we compare our proposed methods with previous works. The result shows that our methods in this paper significantly outperform previous works in the accuracy of detection malicious stepping stones, even when evasive techniques are adopted by attackers. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Detecting stepping stones by abnormal causality probability", "paper_id": "WOS:000354732400002"}