{"auto_keywords": [{"score": 0.039156972299121906, "phrase": "eeg-based_expert_system"}, {"score": 0.009494921204430308, "phrase": "eeg_features"}, {"score": 0.00848985074981733, "phrase": "eeg"}, {"score": 0.006043535834161934, "phrase": "current_situation"}, {"score": 0.005051070449652515, "phrase": "expert_brains"}, {"score": 0.00481495049065317, "phrase": "complexity_measures"}, {"score": 0.00479819563282457, "phrase": "probability_density_function_control"}, {"score": 0.004781498797706604, "phrase": "alpha_sub-band"}, {"score": 0.004731754442072492, "phrase": "novel_expert_system"}, {"score": 0.004633805690244912, "phrase": "knowledge_acquisition"}, {"score": 0.004561670919616129, "phrase": "problem-solving_mode"}, {"score": 0.004405348628112645, "phrase": "operational_decisions"}, {"score": 0.004173524877260367, "phrase": "eeg_signal"}, {"score": 0.004101366149219787, "phrase": "expert_knowledge"}, {"score": 0.004072851768196397, "phrase": "directly_human_brain_activity"}, {"score": 0.003988487841970088, "phrase": "experts'_thinking"}, {"score": 0.003858457271467334, "phrase": "well-defined_problem_domain"}, {"score": 0.0034992667091713813, "phrase": "inference_engine"}, {"score": 0.0032861588691414667, "phrase": "eeg_data_acquisition"}, {"score": 0.003229292624610636, "phrase": "expert_decisions"}, {"score": 0.003203864573599352, "phrase": "feature_vectors"}, {"score": 0.0031678720736808574, "phrase": "actual_operations"}, {"score": 0.0031076160882149225, "phrase": "expert_performance"}, {"score": 0.003048502724695561, "phrase": "game_experiments"}, {"score": 0.0029905104479072482, "phrase": "operation_problem"}, {"score": 0.0028778050108853653, "phrase": "collected_eeg_signals"}, {"score": 0.0027741761880779535, "phrase": "eeg_analysis_show"}, {"score": 0.002740466940289314, "phrase": "corresponding_brain_regions"}, {"score": 0.00272614545678894, "phrase": "probability_density_function"}, {"score": 0.002716695316345895, "phrase": "pdf"}, {"score": 0.002614228362365338, "phrase": "sample_entropy"}, {"score": 0.0025914954729220354, "phrase": "lempel-ziv_complexity"}, {"score": 0.002524473047010871, "phrase": "operating_activities"}, {"score": 0.0024807547991927137, "phrase": "probability_density_functions"}, {"score": 0.0024548872075607687, "phrase": "pdf_control"}, {"score": 0.002442054488658526, "phrase": "mathematical_model"}, {"score": 0.0023052356887304204, "phrase": "operating_information"}, {"score": 0.00227323596233465, "phrase": "expert_system_model"}, {"score": 0.002249527353528286, "phrase": "simulated_example"}, {"score": 0.002241679436497571, "phrase": "encouraging_results"}, {"score": 0.002202847728425357, "phrase": "operating_features"}, {"score": 0.0021458550610936465, "phrase": "expert_mode"}, {"score": 0.0021346343252001488, "phrase": "operating_curve"}, {"score": 0.002119764367112061, "phrase": "physiological_signal_features"}, {"score": 0.0021049977753042253, "phrase": "actual_operating_information"}], "paper_keywords": ["Expert system", " EEG", " sample entropy", " Lempel-Ziv complexity", " PDF control"], "paper_abstract": "This paper presents a novel expert system based on electroencephalogram (EEG) and demonstrates the process of knowledge acquisition and inference. As we known, the problem-solving mode of expert brains is: They judge the current situation (learn about the problem), and then generate operational decisions to solve problems. However, the experts have difficulty in explaining what they know and how they gain the knowledge. Their perfect performance may be difficult to replicate. The EEG signal may be one of the most predictive and reliable measurements to acquire the expert knowledge as it reflects directly human brain activity. It is supposed that EEG is a manifestation of the experts' thinking. By the analysis of EEG, we found the regularity of EEG features of the experts in a well-defined problem domain and used the features to reflect the learning and decision-making information of the expert brains to establish the EEG-based expert system. The knowledge base of the EEG-based expert system stores the features that reflect the learning and decision-making activities of the expert brains respectively. Based on the relationship between the two kinds of the EEG features, inference engine of the EEG-based expert system makes an inference to obtain the features that reflect the decisions of the experts. When we encounter the same problem, the brains make the same judgement (learning). After the EEG data acquisition, through the EEG-based expert system, we can get the expert decisions (operations). If we interpret the decisions into actual operations or control, we can solve the problem with the expert performance or control machines more intelligently. In this paper, game experiments have been designed. We used the solution to the operation problem of a game as the basis to establish the model of the EEG-based expert system. The inputs of the system are the collected EEG signals of the users. The outputs are the operations (decisions) of the experts. The results of the EEG analysis show that the activity appeared in the corresponding brain regions and the probability density function (PDF) of the EEG features is concentrated when the experts performed the task (playing the game). By using the sample entropy (SampEn) and Lempel-Ziv complexity (LZC) algorithm, the EEG features of the experts' learning activities and operating activities were extracted respectively. Then, with applying the probability density functions of the features to output PDF control, the mathematical model of the EEG-based expert system was established. In the EEG-based expert system, inference means controlling the feature vectors which reflect the users' learning information from the current situation to get the feature vectors which reflect the operating information of the experts. Finally, the expert system model has been tested on a simulated example and encouraging results have been obtained. The EEG-based expert system can forecast the operating features of the experts. The output of the EEG-based expert system is in accord with the expert mode and the operating curve represented by the physiological signal features can reflect the actual operating information.", "paper_title": "EEG-based expert system using complexity measures and probability density function control in alpha sub-band", "paper_id": "WOS:000324343100006"}