{"auto_keywords": [{"score": 0.03713212918603796, "phrase": "rasim"}, {"score": 0.023587538431119926, "phrase": "top-k_pruning"}, {"score": 0.013838494626931153, "phrase": "separate_index_approach"}, {"score": 0.00971009659613956, "phrase": "ra_groups"}, {"score": 0.008713768692145013, "phrase": "top-k_spatial_keyword_queries"}, {"score": 0.0046875099587735825, "phrase": "k_objects"}, {"score": 0.004539005582217309, "phrase": "text_relevancy"}, {"score": 0.0044426140044122545, "phrase": "spatial_keyword_queries"}, {"score": 0.004296539489144476, "phrase": "ir-tree_method"}, {"score": 0.004199173074059755, "phrase": "spatial_index"}, {"score": 0.004165497627464024, "phrase": "text_index"}, {"score": 0.004109968477407982, "phrase": "new_data_types"}, {"score": 0.0037213333316218522, "phrase": "object_ids"}, {"score": 0.003701401653850141, "phrase": "efficient_merging"}, {"score": 0.0036130172109597888, "phrase": "new_separate_index_method"}, {"score": 0.0035936635879882813, "phrase": "rank-aware_separate_index_method"}, {"score": 0.0034057193921138078, "phrase": "separate_index"}, {"score": 0.0033602844686125375, "phrase": "partitioning_technique"}, {"score": 0.0031845067058084583, "phrase": "similar_scores"}, {"score": 0.003150466780962537, "phrase": "first_order"}, {"score": 0.0030751973080616153, "phrase": "second_order"}, {"score": 0.002724909017963099, "phrase": "generalized_external_ta"}, {"score": 0.002681315076008658, "phrase": "external_ta"}, {"score": 0.002659779643250416, "phrase": "special_properties"}, {"score": 0.002603191465943781, "phrase": "first_research_work"}, {"score": 0.0024209250169088575, "phrase": "query_processing_time"}, {"score": 0.0023377643804935997, "phrase": "prevailing_method"}, {"score": 0.0022513914267746397, "phrase": "hybrid_index_approach"}, {"score": 0.0022393151471501137, "phrase": "experimental_results"}, {"score": 0.0021798963627236915, "phrase": "index_size"}, {"score": 0.0021049977753042253, "phrase": "query_performance"}], "paper_keywords": ["top-k spatial keyword query", " separate index", " top-k pruning"], "paper_abstract": "A top-k spatial keyword query returns k objects having the highest (or lowest) scores with regard to spatial proximity as well as text relevancy. Approaches for answering top-k spatial keyword queries can be classified into two categories: the separate index approach and the hybrid index approach. The separate index approach maintains the spatial index and the text index independently and can accommodate new data types. However, it is difficult to support top-k pruning and merging efficiently at the same time since it requires two different orders for clustering the objects: the first based on scores for top-k pruning and the second based on object IDs for efficient merging. In this paper, we propose a new separate index method called Rank-Aware Separate Index Method (RASIM) for top-k spatial keyword queries. RASIM supports both top-k pruning and efficient merging at the same time by clustering each separate index in two different orders through the partitioning technique. Specifically, RASIM partitions the set of objects in each index into rank-aware (RA) groups that contain the objects with similar scores and applies the first order to these groups according to their scores and the second order to the objects within each group according to their object IDs. Based on the RA groups, we propose two query processing algorithms: (i) External Threshold Algorithm (External TA) that supports top-k pruning in the unit of RA groups and (ii) Generalized External TA that enhances the performance of External TA by exploiting special properties of the RA groups. RASIM is the first research work that supports top-k pruning based on the separate index approach. Naturally, it keeps the advantages of the separate index approach. In addition, in terms of storage and query processing time, RASIM is more efficient than the IR-tree method, which is the prevailing method to support top-k pruning to date and is based on the hybrid index approach. Experimental results show that, compared with the IR-tree method, the index size of RASIM is reduced by up to 1.85 times, and the query performance is improved by up to 3.22 times.", "paper_title": "RASIM: a rank-aware separate index method for answering top-k spatial keyword queries", "paper_id": "WOS:000313662600001"}