{"auto_keywords": [{"score": 0.048901199639170195, "phrase": "near-duplicate_videos"}, {"score": 0.013613345360714603, "phrase": "video_migration_map"}, {"score": 0.00481495049065317, "phrase": "video_manipulation_history"}, {"score": 0.004735651915966323, "phrase": "explosive_growth"}, {"score": 0.0042864307215634756, "phrase": "derived_videos"}, {"score": 0.004061088450663783, "phrase": "pair-wise_relationships"}, {"score": 0.003831591603702392, "phrase": "improved_video_archaeology"}, {"score": 0.0030231983220281836, "phrase": "improved_detecting_algorithms"}, {"score": 0.0026135859312619875, "phrase": "proposed_i-va_system"}, {"score": 0.0025704485156071463, "phrase": "better_understanding"}, {"score": 0.0024759682272230735, "phrase": "manipulated_videos"}, {"score": 0.0024452510143564057, "phrase": "current_video_search_engines"}, {"score": 0.0023750478314945303, "phrase": "migration_map"}, {"score": 0.002345579707333727, "phrase": "better_indexing_scheme"}, {"score": 0.002306855521822739, "phrase": "annotation_propagation"}, {"score": 0.002167235986623239, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "manipulation_relation"}], "paper_keywords": ["Video archaeology", " Near-duplicate video", " Video migration map"], "paper_abstract": "Facing the explosive growth of near-duplicate videos, video archaeology is quite desired to investigate the history of the manipulations on these videos. With the determination of derived videos according to the manipulations, a video migration map can be constructed with the pair-wise relationships in a set of near-duplicate videos. In this paper, we propose an improved video archaeology (I-VA) system by extending our previous work (Shen et al. 2010). The extensions include more comprehensive video manipulation detectors and improved techniques for these detectors. Specially, the detectors are used for two categories of manipulations, i.e., semantic-based manipulations and non-semantic-based manipulations. Moreover, the improved detecting algorithms are more stable. The key of I-VA is the construction of a video migration map, which represents the history of how near-duplicate videos have been manipulated. There are various applications based on the proposed I-VA system, such as better understanding of the meaning and context conveyed by the manipulated videos, improving current video search engines by better presentation based on the migration map, and better indexing scheme based on the annotation propagation. The system is tested on a collection of 12,790 videos and 3,481 duplicates. The experimental results show that I-VA can discover the manipulation relation among the near-duplicate videos effectively.", "paper_title": "Video archaeology: understanding video manipulation history", "paper_id": "WOS:000316074200008"}