{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "morphology-based_static_features"}, {"score": 0.004485085675709643, "phrase": "fake_fingers"}, {"score": 0.00441738161338662, "phrase": "existing_fingerprint_recognition_systems"}, {"score": 0.004177724522109952, "phrase": "urgent_need"}, {"score": 0.004073113268289532, "phrase": "software-based_liveness_detection_algorithms"}, {"score": 0.003717656912608012, "phrase": "discriminant_information"}, {"score": 0.0035337158050484474, "phrase": "also_their_joint_contribution"}, {"score": 0.003258090521354736, "phrase": "perspiration-based_measures"}, {"score": 0.0031603487697867538, "phrase": "proposed_approach"}, {"score": 0.0028990018343924683, "phrase": "liveness_detection"}, {"score": 0.0027554538693034163, "phrase": "first_time"}, {"score": 0.0027000395818027366, "phrase": "standard_databases"}, {"score": 0.002271725588755076, "phrase": "spoof_attack"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Biometrics", " Spooling", " Liveness detection", " Fingerprint scanners"], "paper_abstract": "It has been showed that, by employing fake fingers, the existing fingerprint recognition systems may be easily deceived. So, there is an urgent need for improving their security. Software-based liveness detection algorithms typically exploit morphological and perspiration-based characteristics separately to measure the vitality. Both such features provide discriminant information about live and fake fingers, then, it is reasonable to investigate also their joint contribution. In this paper, we combine a set of the most robust morphological and perspiration-based measures. The effectiveness of the proposed approach has been assessed through a comparison with several state-of-the-art techniques for liveness detection. Experiments have been carried out, for the first time, by adopting standard databases. They have been taken from the Liveness Detection Competition 2009 whose data have been acquired by using three different optical sensors. Further, we have analyzed how the performance of our algorithm changes when the material employed for the spoof attack is not available during the training of the system. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Combining perspiration- and morphology-based static features for fingerprint liveness detection", "paper_id": "WOS:000304235500015"}