{"auto_keywords": [{"score": 0.004570384351035464, "phrase": "imperfect_routing_tables"}, {"score": 0.004546618461570898, "phrase": "non-homogeneous_network_characteristics"}, {"score": 0.004452778815180206, "phrase": "non-cooperative_routers"}, {"score": 0.004270845182558663, "phrase": "destination_nodes"}, {"score": 0.003980463173701481, "phrase": "service_attack"}, {"score": 0.0038779784043294864, "phrase": "probability_model"}, {"score": 0.003857799055492227, "phrase": "packet_travel"}, {"score": 0.0037682786703039264, "phrase": "large_non-homogeneous_multiple_hop_network"}, {"score": 0.003690443963288746, "phrase": "precise_routing_information"}, {"score": 0.0036426128090286353, "phrase": "network_hops"}, {"score": 0.0035395474074405935, "phrase": "model_networks"}, {"score": 0.0034845600521340057, "phrase": "alternate_paths"}, {"score": 0.0033333422518227796, "phrase": "lower_delay"}, {"score": 0.0033159875234063715, "phrase": "lower_packet_loss"}, {"score": 0.003197000180225272, "phrase": "time-out_elapses"}, {"score": 0.0030028405079410994, "phrase": "duplicate_packet"}, {"score": 0.0029794122471987583, "phrase": "numerical-analytical_solution"}, {"score": 0.0029331010547170187, "phrase": "average_travel_time"}, {"score": 0.002430306426446819, "phrase": "second_example"}, {"score": 0.0024113342918001945, "phrase": "wireless_network"}, {"score": 0.0023308144086659948, "phrase": "poorer_wireless_coverage"}, {"score": 0.002312617155763442, "phrase": "packet_losses"}, {"score": 0.0022353862736347496, "phrase": "poor_routing_tables"}, {"score": 0.0021948718993867154, "phrase": "main_coverage_area"}, {"score": 0.0021720506477686105, "phrase": "wireless_networks"}, {"score": 0.002138261955387411, "phrase": "simulation_study"}, {"score": 0.0021049977753042253, "phrase": "analytical_model"}], "paper_keywords": ["large-scale networks", " analytical models", " packet attack", " deep packet inspection", " Brownian motion", " diffusion process"], "paper_abstract": "This paper studies whether a packet will ultimately succeed in reaching a given destination, how long this will take and how much energy may be expended, in the context of a network with imperfect routing tables and non-homogeneous network characteristics. It also investigates the effect of non-cooperative routers that may actually choose to drop certain packets if they view them to be dangerous for destination nodes, as when packets may be carrying worms, viruses or malware, and when certain packets have been identified as being part of a Denial of Service attack. The approach we take is to construct a probability model for packet travel from a source to destination node in a large non-homogeneous multiple hop network. The randomness models the lack of precise routing information at each of the network hops, and randomness in routing can also be used to model networks where one wishes to explore alternate paths in a network to discover the more reliable paths, or those that may have other desirable characteristics such as lower delay or lower packet loss. We assume that each packet has the same time out: when the time-out elapses, the packet is dropped if it has not yet reached the destination, and some time later the source will retransmit a duplicate packet. A numerical-analytical solution is developed to compute the average travel time of the packet from source to destination and to estimate its total energy consumption. Two applications of these results are then presented. In the first one, the packet is an 'attack' packet (e.g. a Denial of Service packet, or some malware) and as it approaches the destination node it is being frequently inspected by routers that may decide to drop it if they correctly detect that it is a threat. The second example considers a wireless network where areas which are remote from the source and destination nodes have poorer wireless coverage so that packet losses become more frequent as the packet 'unknowingly' (due to poor routing tables errors) meanders away from the main coverage area. Other applications in wireless networks are also provided and a simulation study is performed to validate the analytical model.", "paper_title": "Packet Delay and Energy Consumption in Non-homogeneous Networks", "paper_id": "WOS:000307171400004"}