{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evolutionary_algorithms"}, {"score": 0.003852371777780562, "phrase": "partitional_algorithms"}, {"score": 0.0037855348847339655, "phrase": "hard_clusterings"}, {"score": 0.003393206299636482, "phrase": "up-to-date_overview"}, {"score": 0.0031775430407770026, "phrase": "particular_kind"}, {"score": 0.0031498398446368025, "phrase": "evolutionary_approach"}, {"score": 0.0030951536886513567, "phrase": "advanced_topics"}, {"score": 0.0030414140732789186, "phrase": "ensemble-based_evolutionary_clustering"}, {"score": 0.002835599469639296, "phrase": "evolutionary_data_clustering"}, {"score": 0.0027620516806198354, "phrase": "cluster-oriented_or_nonoriented_operators"}, {"score": 0.002737960968372391, "phrase": "context-sensitive_or_context-insensitive_operators"}, {"score": 0.0025977542995083624, "phrase": "real_encodings"}, {"score": 0.002359046870732839, "phrase": "different_domains"}, {"score": 0.0023180581939456686, "phrase": "image_processing"}, {"score": 0.002297831085501592, "phrase": "computer_security"}, {"score": 0.0021896891011033105, "phrase": "important_issues"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Applications", " clustering", " evolutionary algorithms"], "paper_abstract": "This paper presents a survey of evolutionary algorithms designed for clustering tasks. It tries to reflect the profile of this area by focusing more on those subjects that have been given more importance in the literature. In this context, most of the paper is devoted to partitional algorithms that look for hard clusterings of data, though overlapping (i.e., soft and fuzzy) approaches are also covered in the paper. The paper is original in what concerns two main aspects. Firsts it provides an up-to-date overview that is fully devoted to evolutionary algorithms for clustering, is not limited to any particular kind of evolutionary approach, and comprises advanced topics like multiobjective and ensemble-based evolutionary clustering. Second, it provides a taxonomy that highlights some very important aspects in the context of evolutionary data clustering, namely, fixed or variable number of clusters, cluster-oriented or nonoriented operators, context-sensitive or context-insensitive operators, guided or unguided operators, binary, integer, or real encodings, centroid-based, medoid-based, label-based, tree-based, or graph-based representations, among others. A number of references are provided that describe applications of evolutionary algorithms for clustering in different domains, such as image processing, computer security, and bioinformatics. The paper ends by addressing some important issues and open questions that can be subject of future research.", "paper_title": "A Survey of Evolutionary Algorithms for Clustering", "paper_id": "WOS:000263831900001"}