{"auto_keywords": [{"score": 0.027680225659223377, "phrase": "proposed_inference_engine"}, {"score": 0.0043656173407379895, "phrase": "novel_inference_mechanism"}, {"score": 0.004273601449537163, "phrase": "takagi-sugeno-kang"}, {"score": 0.00397495478332679, "phrase": "crisp_numbers"}, {"score": 0.00387459052649752, "phrase": "proposed_inference_mechanism"}, {"score": 0.0038253590626087237, "phrase": "closed_form"}, {"score": 0.003557924423642353, "phrase": "control_applications"}, {"score": 0.003239411058870774, "phrase": "ts"}, {"score": 0.0030776686414001964, "phrase": "sufficient_stability_conditions"}, {"score": 0.0029998918671747168, "phrase": "closed-loop_system"}, {"score": 0.002924074850256874, "phrase": "novel_linear-matrix-inequality-based_algorithms"}, {"score": 0.0028139168128067343, "phrase": "numerical_analyses"}, {"score": 0.0027078974645805736, "phrase": "new_inference_methods"}, {"score": 0.00268488398249084, "phrase": "case_studies"}, {"score": 0.0024969812322112174, "phrase": "simple_nature"}, {"score": 0.0023824468367751365, "phrase": "real-time_control_systems"}, {"score": 0.0022828795331819025, "phrase": "mathematical_foundations"}, {"score": 0.0021049977753042253, "phrase": "significantly_improved_performance"}], "paper_keywords": ["Adaptive control", " modular and reconfigurable robots", " robot manipulators", " Takagi-Sugeno-Kang (TSK)", " type-2 fuzzy logic control (T2 FLC)"], "paper_abstract": "Type-2 fuzzy logic systems have recently been utilized in many control processes due to their ability to model uncertainties. This paper proposes a novel inference mechanism for an interval type-2 Takagi-Sugeno-Kang fuzzy logic control system (IT2 TSK FLCS) when antecedents are type-2 fuzzy sets and consequents are crisp numbers (A2-C0). The proposed inference mechanism has a closed form which makes it more feasible to analyze the stability of this FLCS. This paper focuses on control applications for the following cases: 1) Both plant and controller use A2-C0 TSK models, and 2) the plant uses type-1 Takagi-Sugeno (TS) and the controller uses IT2 TS models. In both cases, sufficient stability conditions for the stability of the closed-loop system are derived. Furthermore, novel linear-matrix-inequality-based algorithms are developed for satisfying the stability conditions. Numerical analyses are included which validate the effectiveness of the new inference methods. Case studies reveal that an IT2 TS FLCS using the proposed inference engine clearly outperforms its type-1 TSK counterpart. Moreover, due to the simple nature of the proposed inference engine, it is easy to implement in real-time control systems. The methods presented in this paper lay the mathematical foundations for analyzing the stability and facilitating the design of stabilizing controllers of IT2 TSK FLCSs and IT2 TS FLCSs with significantly improved performance over type-1 approaches.", "paper_title": "On the Stability of Interval Type-2 TSK Fuzzy Logic Control Systems", "paper_id": "WOS:000277774700023"}