{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "generative_grammars"}, {"score": 0.041848501542744734, "phrase": "candidate_solutions"}, {"score": 0.038234537231420805, "phrase": "conceptual_design"}, {"score": 0.004658426838467567, "phrase": "new_search_method"}, {"score": 0.004482206282876944, "phrase": "search_trees"}, {"score": 0.004384504920139083, "phrase": "generative_grammar"}, {"score": 0.004081385289516914, "phrase": "design_decisions"}, {"score": 0.003778253716938922, "phrase": "single_configuration"}, {"score": 0.003219835797056762, "phrase": "formal_definition"}, {"score": 0.0031669873302916, "phrase": "rule-based_interactive_tree-search"}, {"score": 0.003030247482854539, "phrase": "user_interaction"}, {"score": 0.0021401625519713577, "phrase": "computational_complexity"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithm"}], "paper_keywords": ["graph grammars", " interactive design evaluation", " stochastic search", " generative methods"], "paper_abstract": "This paper presents a new search method that has been developed specifically for search trees defined by a generative grammar. Generative grammars are useful in design as a way to encapsulate the design decisions that lead to candidate solutions. Since the candidate solutions are not confined to a single configuration or topology and thus useful in conceptual design, they may be difficult to computationally analyze. Analysis is achieved in this method by querying the user. A formal definition of a rule-based interactive tree-search is presented in this paper. The user interaction is kept to 30 pair-wise comparisons of candidates. From the data gathered from the comparisons, a stochastic decision-making process infers what candidate solutions best match the known optimal. The method is implemented and applied to a grammar for tying neckties. It is shown through 21 user experiments and 4000 automated experiments that the method consistently finds solutions within the 99.8 percentile. The computational complexity of the proposed algorithm is also studied. The implications of this method for conceptual design are expounded on in the conclusions. [DOI: 10.1115/1.4007153]", "paper_title": "A Stochastic Tree-Search Algorithm for Generative Grammars", "paper_id": "WOS:000314763500006"}