{"auto_keywords": [{"score": 0.04102976168027823, "phrase": "sensors'_locations"}, {"score": 0.00481495049065317, "phrase": "sensor_allocation_systems"}, {"score": 0.004720606036240263, "phrase": "sensor-to-task_assignments"}, {"score": 0.004605258779434384, "phrase": "account_location_privacy_issues"}, {"score": 0.004382913938427474, "phrase": "\"best\"_assignment"}, {"score": 0.0043183186953102805, "phrase": "available_sensors"}, {"score": 0.0040491842732233154, "phrase": "sensors'_location_privacy"}, {"score": 0.003853583126988071, "phrase": "assignment_process"}, {"score": 0.003778004256546193, "phrase": "previous_works"}, {"score": 0.0034901729647741353, "phrase": "energy-based_algorithm"}, {"score": 0.003421697038352743, "phrase": "remaining_energy"}, {"score": 0.002834409847642238, "phrase": "location_privacy"}, {"score": 0.0022901862321082407, "phrase": "exact_locations"}, {"score": 0.0021793698531006197, "phrase": "exact_location_algorithm"}, {"score": 0.0021049977753042253, "phrase": "network_lifetime"}], "paper_keywords": [""], "paper_abstract": "We propose sensor-to-task assignments algorithms that take into account location privacy issues. Our solutions enable the network to choose the \"best\" assignment of the available sensors to the tasks to maximize the utility of the network while preserving sensors' location privacy. We focus on preserving the sensors' locations during the assignment process in contrast to previous works, which considered location privacy while sensors are in operation. We also propose an energy-based algorithm that uses the remaining energy of a sensor as a factor to scale the distance between a sensor and a task such that sensors that have more energy appear to be closer than ones with less energy left. This does not only provide location privacy but will also consume the sensing resources more evenly, which leads to extending the lifetime of the network. From our simulations, we found that our algorithms can successfully hide sensors' locations while providing performance close to the algorithms, which use the exact locations. In addition, our energy-based algorithm, while achieving results close to the exact location algorithm, was found to increase the network lifetime by as much as 40%.", "paper_title": "Location Privacy and Energy Preservation in Sensor Allocation Systems", "paper_id": "WOS:000308481400001"}