{"auto_keywords": [{"score": 0.03289365921889545, "phrase": "additive_monotones"}, {"score": 0.010524261883207214, "phrase": "parallel-combinable_processes"}, {"score": 0.00481495049065317, "phrase": "resource_theories"}, {"score": 0.004675652357253327, "phrase": "partitioned_process_theory"}, {"score": 0.0045786214691132185, "phrase": "coecke"}, {"score": 0.004540367803276711, "phrase": "fritz"}, {"score": 0.004483590690684194, "phrase": "spekkens"}, {"score": 0.004408976280483648, "phrase": "symmetric_monoidal_category"}, {"score": 0.004281372589330329, "phrase": "symmetric_monoidal_subcategory"}, {"score": 0.003559387846675818, "phrase": "partially_ordered_monoid"}, {"score": 0.0033280910751441522, "phrase": "free_processes"}, {"score": 0.0031912018800904314, "phrase": "partial_order"}, {"score": 0.0030470980812086247, "phrase": "monoid_homomorphisms"}, {"score": 0.0029837589912490026, "phrase": "real_numbers"}, {"score": 0.0028251537271620996, "phrase": "corresponding_partitioned_process_theory"}, {"score": 0.002511522462767081, "phrase": "complete_family"}, {"score": 0.0021953959824690316, "phrase": "complete_families"}, {"score": 0.0021049977753042253, "phrase": "finite_sets"}], "paper_keywords": [""], "paper_abstract": "A partitioned process theory, as defined by Coecke, Fritz, and Spekkens, is a symmetric monoidal category together with an all-object-including symmetric monoidal subcategory. We think of the morphisms of this category as processes, and the morphisms of the subcategory as those processes that are freely executable. Via a construction we refer to as parallel-combinable processes with discarding, we obtain from this data a partially ordered monoid on the set of processes, with f >= g if one can use the free processes to construct g from f. The structure of this partial order can then be probed using additive monotones: order-preserving monoid homomorphisms with values in the real numbers under addition. We first characterise these additive monotones in terms of the corresponding partitioned process theory. Given enough monotones, we might hope to be able to reconstruct the order on the monoid. If so, we say that we have a complete family of monotones. In general, however, when we require our monotones to be additive monotones, such families do not exist or are hard to compute. We show the existence of complete families of additive monotones for various partitioned process theories based on the category of finite sets, in order to shed light on the way such families can be constructed.", "paper_title": "Additive monotones for resource theories of parallel-combinable processes with discarding", "paper_id": "WOS:000367346600014"}