{"auto_keywords": [{"score": 0.029646929800025163, "phrase": "cloud_service"}, {"score": 0.015719716506582538, "phrase": "cloud_services"}, {"score": 0.004769702911065878, "phrase": "cloud_computing"}, {"score": 0.0047026237903774895, "phrase": "new_computing_paradigm"}, {"score": 0.0046364836476864325, "phrase": "virtualized_hardware_and_software_resources"}, {"score": 0.004218602458288531, "phrase": "pricing_mechanisms"}, {"score": 0.004120130206000757, "phrase": "cloud_users"}, {"score": 0.0040049806975968145, "phrase": "virtualized_computing_resources"}, {"score": 0.0039114753002009485, "phrase": "cloud_service_provider"}, {"score": 0.0037133478610481994, "phrase": "in-house_computing_infrastructure"}, {"score": 0.0032223742018434856, "phrase": "entire_cost"}, {"score": 0.002519739850807611, "phrase": "platform_side"}, {"score": 0.002460825108719896, "phrase": "service_providers"}, {"score": 0.0021554882636705946, "phrase": "qos"}], "paper_keywords": ["Pre-interaction time phase", " Post-interaction time phase", " QoS forecasting", " User-side service management", " Early warning system"], "paper_abstract": "Cloud computing is a new computing paradigm in which virtualized hardware and software resources are provided to the users over the Internet as services with pay-as-you-go like pricing mechanisms. This enables the cloud users to fulfil their IT requirements by using virtualized computing resources, located at a cloud service provider, as cloud services over the Internet instead of establishing an in-house computing infrastructure of their own. This is beneficial for the users as they only have to pay for the resources which they are actually using rather than paying for the entire cost of hardware and software, as is the case in other computing paradigms. However, to ensure that users' achieve their required outcomes, monitoring and managing the QoS of the cloud service they are receiving is a very important aspect. This is different from monitoring and managing the QoS of the cloud service at the platform side which is done by service providers. In this paper, we propose and demonstrate the working of an approach that enables users to forecast and appropriately manage the cloud service based on the QoS they are receiving at their end.", "paper_title": "User-side QoS forecasting and management of cloud services", "paper_id": "WOS:000361630900008"}