{"auto_keywords": [{"score": 0.04767362406168756, "phrase": "ashby's_law"}, {"score": 0.010612391179681241, "phrase": "ashby"}, {"score": 0.009794876854932421, "phrase": "unplanned_changes"}, {"score": 0.009100425959758393, "phrase": "complex_socio-technical_systems"}, {"score": 0.007646990295936341, "phrase": "lorv"}, {"score": 0.004552821755371186, "phrase": "requisite_variety"}, {"score": 0.004422179351310403, "phrase": "hegemonic_control"}, {"score": 0.004276069461529461, "phrase": "-_research"}, {"score": 0.004171986569118086, "phrase": "classical_systems_approaches"}, {"score": 0.0037718236953187467, "phrase": "socio-technical_systems_development"}, {"score": 0.0037131100740160476, "phrase": "systems_analysis_theories"}, {"score": 0.003647122998680954, "phrase": "hegemonic_analysis"}, {"score": 0.00363080961099728, "phrase": "design_research"}, {"score": 0.0035984006265736, "phrase": "management_information_systems"}, {"score": 0.003334309053314909, "phrase": "benefit_distribution"}, {"score": 0.003245788045585855, "phrase": "changing_structures"}, {"score": 0.003124378747288385, "phrase": "object-based_e-learning_systems"}, {"score": 0.0030482430937467013, "phrase": "coasian_analysis"}, {"score": 0.0029873281676201565, "phrase": "five_guidelines"}, {"score": 0.0028244138861268442, "phrase": "design_guidelines"}, {"score": 0.0027679594587151305, "phrase": "critical_analysis"}, {"score": 0.0026584043201634496, "phrase": "real-world_complex_systems"}, {"score": 0.002640570294169269, "phrase": "critical_analytical_thinking"}, {"score": 0.002541741549046619, "phrase": "hegemonic_aspects"}, {"score": 0.002530359917257626, "phrase": "emergent_complex_socio-technical_systems"}, {"score": 0.0024797684287585194, "phrase": "system_structures"}, {"score": 0.0024466025982664776, "phrase": "design_method"}, {"score": 0.0024247382451294255, "phrase": "five_design_guidelines"}, {"score": 0.00227704981934539, "phrase": "analytical_role"}, {"score": 0.0022365262201954643, "phrase": "power_relations"}, {"score": 0.0022265082574344894, "phrase": "unintended_design_outcomes"}, {"score": 0.0021049977753042253, "phrase": "five_new_design_guidelines"}], "paper_keywords": ["design", " cybernetics", " social environment control", " man-machine systems"], "paper_abstract": "Purpose - This paper sets out to report on research by the authors into the development and application of four extensions to Ashby's Law of Requisite Variety (LoRV) that increase its utility in the arena of unplanned changes in hegemonic control of designed complex socio-technical systems/digital eco-systems in the built environment that are structurally dynamic or emergent. Design/methodology/approach - Research on which the paper is based focused on exploration of classical systems approaches to the design of complex socio-technical systems in which ownership, power, control and management of structure and benefit generation and distribution are distributed, dynamic and multi-constituent. Support for development of these four extensions to Ashby's Law comes from observation of four decades of socio-technical systems development along with critical thinking that combined systems analysis theories with theories and findings from fields of hegemonic analysis, design research, management, management information systems, behaviour in organisations and sociology. Findings - The paper outlines application of four new extensions to LoRV in relation to unplanned changes in distributions of power, ownership, control, benefit generation and benefit distribution in complex socio-technical systems/digital eco-systems in the built environment that are emergent or have changing structures. Three of these extensions have been outlined earlier in relation to the design of learning object-based e-learning systems. The fourth extension builds on these via application of Coasian analysis. The paper also describes a suite of five guidelines to assist with the design of complex socio-technical systems derived from the four extensions to Ashby. Research limitations/implications - The four extensions of Ashby's Law that underpin the design guidelines in this paper are deduced from observation and critical analysis rather than being \"proven\" empirically. They are derived from observation of the behaviour of real-world complex systems together with critical analytical thinking that integrated theory and research findings from a range of disciplines where each informs understanding of hegemonic aspects of emergent complex socio-technical systems involving multiple, changing constituencies, and evolving system structures. Practical implications - A design method is derived comprising five design guidelines for use in pre-design and design of complex socio-technical systems/digital eco-systems in the built environment. Originality/value - The paper describes the application of four new extensions to LoRV that extend the analytical role of Ashby's Law in diagnosis of changes in power relations and unintended design outcomes from changes in the generation and control of variety in complex, multi-layered and hierarchical socio-technical systems that have multiple stakeholders and constituencies. From these, a suite of five new design guidelines is proposed.", "paper_title": "Complex built-environment design: four extensions to Ashby", "paper_id": "WOS:000251883500019"}