{"auto_keywords": [{"score": 0.024050469653689302, "phrase": "nodal"}, {"score": 0.00481495049065317, "phrase": "better_understanding"}, {"score": 0.004677847043645765, "phrase": "tgf-beta_family_members"}, {"score": 0.004664592624241178, "phrase": "alk"}, {"score": 0.004492406361795448, "phrase": "growth_factor-beta"}, {"score": 0.004215677131963292, "phrase": "structurally_related_extracellular_proteins"}, {"score": 0.00402514392911723, "phrase": "extracellular_domains"}, {"score": 0.0036907133026806327, "phrase": "multiple_functional_roles"}, {"score": 0.003463196032143783, "phrase": "atomic_level"}, {"score": 0.00282822695516646, "phrase": "experimental_structures"}, {"score": 0.0025336179740814905, "phrase": "structural_distinctive_features"}, {"score": 0.0024899850926034567, "phrase": "ligand-receptor_binding_mode"}, {"score": 0.0022960713730673494, "phrase": "growth_factors"}, {"score": 0.0021794454466797382, "phrase": "cripto_co-factor"}], "paper_keywords": ["Comparative modeling", " TGF-beta protein", " ALK receptor", " Protein-protein docking"], "paper_abstract": "Transforming growth factor-beta (TGF-beta) proteins are a family of structurally related extracellular proteins that trigger their signaling functions through interaction with the extracellular domains of their cognate serine/threonine kinase receptors. The specificity of TGF-beta/receptor binding is complex and gives rise to multiple functional roles. Additionally, it is not completely understood at the atomic level. Here, we use the most reliable computational methods currently available to study systems involving activin-like kinase (ALK) receptors ALK4 and ALK7 and their multiple TGF-beta ligands. We built models for all these proteins and their complexes for which experimental structures are not available. By analyzing the surfaces of interaction in six different TGF-beta/ALK complexes we could infer which are the structural distinctive features of the ligand-receptor binding mode. Furthermore, this study allowed us to rationalize why binding of the growth factors GDF3 and Nodal to the ALK4 receptor requires the Cripto co-factor, whilst binding to the ALK7 receptor does not.", "paper_title": "Toward a better understanding of the interaction between TGF-beta family members and their ALK receptors", "paper_id": "WOS:000307276900016"}