{"auto_keywords": [{"score": 0.05007458300714681, "phrase": "online_deliberation"}, {"score": 0.04926219622874721, "phrase": "wikipedia"}, {"score": 0.004030157055463817, "phrase": "deletion_discussions"}, {"score": 0.0038271712887391015, "phrase": "democratic_and_online_deliberation"}, {"score": 0.0037834649508375544, "phrase": "collaborative_information_quality"}, {"score": 0.0031845067058084613, "phrase": "established_site_policies"}, {"score": 0.003058944053868522, "phrase": "article_topic"}, {"score": 0.0025014259919355453, "phrase": "proposed_stop_online_piracy_act"}, {"score": 0.002375253757224999, "phrase": "deletion_debates"}, {"score": 0.0021539955106204354, "phrase": "broader_considerations"}, {"score": 0.002129356014992349, "phrase": "online_information_quality"}, {"score": 0.0021049977753042253, "phrase": "democratic_deliberation"}], "paper_keywords": [""], "paper_abstract": "In this paper we describe a study aimed at evaluating and improving the quality of online deliberation. We consider the rationales used by participants in deletion discussions on Wikipedia in terms of the literature on democratic and online deliberation and collaborative information quality. Our findings suggest that most participants in these discussions were concerned with the notability and credibility of the topics presented for deletion, and that most presented rationales rooted in established site policies. We found that factors like article topic and unanimity (or lack thereof) were among the factors that tended to affect the outcome of the debate. Our results also suggested that the blackout of the site in response to the proposed Stop Online Piracy Act (SOPA) law affected the decisions of deletion debates that occurred close to the event. We conclude by suggesting implications of this study for broader considerations of online information quality and democratic deliberation.", "paper_title": "What Influences Online Deliberation? A Wikipedia Study", "paper_id": "WOS:000335583800003"}