{"auto_keywords": [{"score": 0.02607772622602604, "phrase": "reservoir"}, {"score": 0.00481495049065317, "phrase": "open_federated_cloud_computing"}, {"score": 0.0047468516620285525, "phrase": "emerging_cloud-computing_paradigm"}, {"score": 0.004548253531664032, "phrase": "traditional_it"}, {"score": 0.0043786774510943625, "phrase": "contemporary_cloud-computing_offerings"}, {"score": 0.004038943596016986, "phrase": "enterprise_solutions"}, {"score": 0.003925414526537783, "phrase": "infrastructure_service-level_agreements"}, {"score": 0.0037432199549135826, "phrase": "current_state"}, {"score": 0.0035189057079817285, "phrase": "business_service_management"}, {"score": 0.0030802351224657673, "phrase": "on-demand_basis"}, {"score": 0.003007846011394511, "phrase": "high-quality_service"}, {"score": 0.0029652292779277782, "phrase": "reservoir_project"}, {"score": 0.0027610089418453614, "phrase": "cloud_infrastructure"}, {"score": 0.002632716358833918, "phrase": "seemingly_infinite_pool"}, {"score": 0.002522344964242888, "phrase": "technological_and_business_management_decisions"}, {"score": 0.002326304140277375, "phrase": "autonomous_management"}, {"score": 0.0022181655497912796, "phrase": "reservoir_approach"}, {"score": 0.0021049977753042253, "phrase": "next-generation_enterprise-grade_cloud_computing"}], "paper_keywords": [""], "paper_abstract": "The emerging cloud-computing paradigm is rapidly gaining momentum as an alternative to traditional IT (information technology). However, contemporary cloud-computing offerings are primarily targeted for Web 2.0-style applications. Only recently have they begun to address the requirements of enterprise solutions, such as support for infrastructure service-level agreements. To address the challenges and deficiencies in the current state of the art, we propose a modular, extensible cloud architecture with intrinsic support for business service management and the federation of clouds. The goal is to facilitate an open, service-based online economy in which resources and services are transparently provisioned and managed across clouds on an on-demand basis at competitive costs with high-quality service. The Reservoir project is motivated by the vision of implementing an architecture that would enable providers of cloud infrastructure to dynamically partner with each other to create a seemingly infinite pool of IT resources while fully preserving their individual autonomy in making technological and business management decisions. To this end, Reservoir could leverage and extend the advantages of virtualization and embed autonomous management in the infrastructure. At the same time, the Reservoir approach aims to achieve a very ambitious goal: creating a foundation for next-generation enterprise-grade cloud computing.", "paper_title": "The Reservoir model and architecture for open federated cloud computing", "paper_id": "WOS:000208258700004"}