{"auto_keywords": [{"score": 0.047569781329700335, "phrase": "new_electromagnetic_spherical_actuator"}, {"score": 0.024377541803253168, "phrase": "improved_model"}, {"score": 0.00481495049065317, "phrase": "electromagnetic_spherical_actuator"}, {"score": 0.004260906498835763, "phrase": "freedom_actuators"}, {"score": 0.00413767314434795, "phrase": "arbitrary_axis"}, {"score": 0.003715425273229361, "phrase": "spherical_actuators"}, {"score": 0.0033524956061690868, "phrase": "axis_direction"}, {"score": 0.0030397596289795143, "phrase": "torque_characteristics"}, {"score": 0.002535876002754739, "phrase": "high_torque"}, {"score": 0.002474505516708906, "phrase": "axis_circumference"}, {"score": 0.002391067964886602, "phrase": "three-degree-of-freedom_actuator"}, {"score": 0.0021049977753042253, "phrase": "measured_results"}], "paper_keywords": ["Actuators", " Robotics", " Electromagnetism", " Torque"], "paper_abstract": "Purpose - The purpose of this paper is to propose a new electromagnetic spherical actuator with three-degree-of-freedom. Multi-degree-of-freedom actuators which can be operated in arbitrary axis come to attract attention because of the solution for efficiency, weight, size, and so on. Particularly, spherical actuators are studied as the application to the joints and eyeballs for robots because they can be freely rotated in every axis direction. Design/methodology/approach - The paper proposes a new electromagnetic spherical actuator with three-degree-of-freedom in rotation, and the torque characteristics of the actuator are computed by the 3D finite element method (FEM). The validity of the computation is confirmed through the measurement of a prototype. Findings - It is found that this actuator realized the high torque of more than 1.0 Nm in every axis circumference. Originality/value - A new spherical three-degree-of-freedom actuator is proposed. The torque characteristics of the improved model are calculated employing the 3D FEM. The validity of the analysis is verified through the comparison with the measured results of the prototype. Furthermore, the improved model is proposed to increase the torque, and the effectiveness of the model is confirmed.", "paper_title": "Proposal of electromagnetic spherical actuator with 3-DOF", "paper_id": "WOS:000281975700011"}