{"auto_keywords": [{"score": 0.012480795525205736, "phrase": "success_rate"}, {"score": 0.010524261883207214, "phrase": "detailed_evaluation"}, {"score": 0.00936394889930975, "phrase": "significant_impact"}, {"score": 0.008613639859794414, "phrase": "proposed_ec_effect"}, {"score": 0.007472473770842692, "phrase": "attribute_values"}, {"score": 0.007317820974406616, "phrase": "bayes'_rule"}, {"score": 0.00481495049065317, "phrase": "predict_impact_of_proposed_engineering_change_effect"}, {"score": 0.00471503739362446, "phrase": "proposed_engineering_change"}, {"score": 0.004675711850436395, "phrase": "ec"}, {"score": 0.004559451202070545, "phrase": "time-consuming_process"}, {"score": 0.0045213598841171935, "phrase": "considerable_user_experience"}, {"score": 0.004192484908247302, "phrase": "similar_ecs"}, {"score": 0.004105435059094976, "phrase": "similar_effects"}, {"score": 0.0032181231788427655, "phrase": "impact_value"}, {"score": 0.003098733069760013, "phrase": "probability_values"}, {"score": 0.0029587924529332695, "phrase": "minimum_cross_entropy"}, {"score": 0.002921732652917206, "phrase": "example_ec_knowledge_base"}, {"score": 0.002630364569659531, "phrase": "regularized_local_similarity_discriminant_analysis"}, {"score": 0.0026083511980228217, "phrase": "sda"}, {"score": 0.0023779596230982234, "phrase": "statistically_significant_improvement"}, {"score": 0.0021049977753042253, "phrase": "proposed_ecs"}], "paper_keywords": [""], "paper_abstract": "Detailed evaluation of a proposed engineering change (EC) or its effects is a time-consuming process requiring considerable user experience and expertise. Therefore, enterprises plan detailed evaluation of only those EC effects that might have a significant impact. Since similar ECs are likely to have similar effects and impacts, past EC knowledge can be utilized for determining whether the proposed EC effect has significant impact. This paper presents an approach for predicting the impact of proposed EC effect based on past ECs that are similar to it. Our approach accounts for the differences in context of impact between attribute values in two changes. The Bayes' rule is utilized to determine differences in impact value based on the differences in attribute values. The probability values required in Bayes' rule are determined based on the principle of minimum cross entropy. An example EC knowledge base is created and utilized to evaluate our approach against two state-of-the-art approaches, namely k-nearest neighbor (NN) and regularized local similarity discriminant analysis (SDA). The success rate in predicting impact is used as an evaluation metric. The results show that there is a statistically significant improvement in success rate obtained using our approach as compared to those obtained using the two state-of-the-art approaches. The results also show that for a very large number of proposed ECs, i.e., N > 100, the success rate in predicting impact using our approach shall be greater than that obtained using the two state-of-the-art approaches. [DOI: 10.1115/1.4005593]", "paper_title": "An Approach to Predict Impact of Proposed Engineering Change Effect", "paper_id": "WOS:000304816300009"}