{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "malicious_modifications"}, {"score": 0.049581014501477026, "phrase": "database_relations"}, {"score": 0.004180809918117248, "phrase": "traditional_solution"}, {"score": 0.004072851768196397, "phrase": "digital_signature_scheme"}, {"score": 0.00396767023935381, "phrase": "digital_signature"}, {"score": 0.0038450179181069833, "phrase": "entire_data_set"}, {"score": 0.003480993634130542, "phrase": "novel_fragile_watermarking_scheme"}, {"score": 0.0032861588691414667, "phrase": "proposed_scheme"}, {"score": 0.0031845067058084583, "phrase": "database_relation"}, {"score": 0.0028828348726682965, "phrase": "embedded_watermarks"}, {"score": 0.00256895975568914, "phrase": "worst_case"}, {"score": 0.002387214876538434, "phrase": "rigorous_analysis"}, {"score": 0.002253461585851626, "phrase": "high_probability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["fragile watermarking", " database security", " integrity"], "paper_abstract": "Nowadays, with more and more data publicly available oil the Internet, it is increasingly important to ensure the integrity of these data. The traditional solution is to use a digital signature scheme. However, a digital signature can only detect whether the entire data set has been modified, it cannot localize and characterize the modifications. In this paper, a novel fragile watermarking scheme is proposed to detect malicious modifications of database relations. In the proposed scheme, all tuples in a database relation are first securely divided into groups; watermarks are embedded and verified group by group independently. The embedded watermarks cannot only detect but also localize, and even characterize, the modifications made to the database. In the worst case, the modifications can be narrowed down to tuples in a group. Rigorous analysis shows that the modifications can be detected and localized with high probability, which is also demonstrated by our experimental results. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "A fragile watermarking scheme for detecting malicious modifications of database relations", "paper_id": "WOS:000236435000004"}