{"auto_keywords": [{"score": 0.04279173842399326, "phrase": "tqm"}, {"score": 0.007233795572005319, "phrase": "hotel_industry"}, {"score": 0.005301489889641406, "phrase": "managerial_factors"}, {"score": 0.00481495049065317, "phrase": "spanish_hotel_industry"}, {"score": 0.004423061344624088, "phrase": "information_systems"}, {"score": 0.004275347843870176, "phrase": "environmental_management"}, {"score": 0.004132546937996706, "phrase": "total_quality_management"}, {"score": 0.003467040410632942, "phrase": "empirical_data"}, {"score": 0.0031308163228919773, "phrase": "different_tqm_commitment_levels"}, {"score": 0.0030433302702291116, "phrase": "regression_analysis"}, {"score": 0.0029920129598858545, "phrase": "tqm-performance_link"}, {"score": 0.0027794243746094905, "phrase": "stronger_tqm_commitment"}, {"score": 0.0027017308406240563, "phrase": "higher_performances"}, {"score": 0.0024534188907003726, "phrase": "stronger_commitment"}, {"score": 0.0023579143175099324, "phrase": "higher_performance_levels"}], "paper_keywords": ["total quality management", " managers", " performance measurement (quality)", " hotel and catering industry", " Spain"], "paper_abstract": "Purpose - Several important managerial factors, such as training, information and communication technologies and information systems (ICT/IS), and environmental management, can be related to total quality management (TQM) in the hotel industry. This paper aims to analyse how TQM is associated with these factors and to verify whether more TQM-committed hotels achieve higher performance. Design/methodology/approach - The empirical data were collected from a sample of 301 three-to-five-star Spanish hotels. A cluster analysis was carried out to identify the different TQM commitment levels, after which a regression analysis tested the TQM-performance link. Findings - Managerial factors are significantly further developed in hotels with a stronger TQM commitment, which also have higher performances. TQM does not seem to influence all the performance variables measured. Practical implications - Hotels showing a stronger commitment to TQM develop more advanced management systems and achieve higher performance levels. Therefore, hoteliers should invest in TQM, as this could help them to become more competitive. Originality/value - The link between TQM and managerial factors, along with the relationship between TQM and performance, has been expanded in the literature on TQM in the hotel industry.", "paper_title": "TQM, managerial factors and performance in the Spanish hotel industry", "paper_id": "WOS:000254568700014"}