{"auto_keywords": [{"score": 0.04107868567004356, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "point-set_embeddability_problem"}, {"score": 0.00465634671242413, "phrase": "planar_graph"}, {"score": 0.0041642891310893, "phrase": "resulting_straight-line_drawing"}, {"score": 0.0036214184763804034, "phrase": "triangulated_graphs"}, {"score": 0.003293142761521425, "phrase": "planar_graphs"}, {"score": 0.0032383707002544755, "phrase": "fixed_combinatorial_embedding"}, {"score": 0.0031845067058084583, "phrase": "constant_treewidth"}, {"score": 0.003149094460617212, "phrase": "constant_face-degree"}, {"score": 0.0023807981747706376, "phrase": "faces_must_be_convex"}, {"score": 0.0021049977753042253, "phrase": "maximum_degree"}], "paper_keywords": ["Graph drawing", " point-set embedding", " carving width"], "paper_abstract": "In this paper, we study the point-set embeddability problem, i.e., given a planar graph and a set of points, is there a mapping of the vertices to the points such that the resulting straight-line drawing is planar? It was known that this problem is NP-hard if the embedding can be chosen, but becomes polynomial for triangulated graphs of treewidth 3. We show here that in fact it can be answered for all planar graphs with a fixed combinatorial embedding that have constant treewidth and constant face-degree. We prove that as soon as one of the conditions is dropped (i.e., either the treewidth is unbounded or some faces have large degrees), point-set embeddability with a fixed embedding becomes NP-hard. The NP-hardness holds even for a 3-connected planar graph with constant treewidth, triangulated planar graphs, or 2-connected outer-planar graphs. These results also show that the convex point-set embeddability problem (where faces must be convex) is NP-hard, but we prove that it becomes polynomial if the graph has bounded treewidth and bounded maximum degree.", "paper_title": "THE POINT-SET EMBEDDABILITY PROBLEM FOR PLANE GRAPHS", "paper_id": "WOS:000339653900006"}