{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pharmacy_bar_code_scanning_system"}, {"score": 0.004539005582217305, "phrase": "great_potential"}, {"score": 0.004466519142879166, "phrase": "medication_errors"}, {"score": 0.0043482604833437735, "phrase": "case_report"}, {"score": 0.003990385737207714, "phrase": "medication_dispensing_errors"}, {"score": 0.003926626018798576, "phrase": "large_academic_medical_center"}, {"score": 0.0038846843242954935, "phrase": "ten_pharmacy_staff"}, {"score": 0.003701401653850141, "phrase": "interview_notes"}, {"score": 0.003584025547693836, "phrase": "common_themes"}, {"score": 0.0026384167183586015, "phrase": "adequate_training"}, {"score": 0.002610198789888055, "phrase": "continuous_improvement"}, {"score": 0.0025003054002226965, "phrase": "one's_own_needs"}, {"score": 0.0024339783012484032, "phrase": "ongoing_vendor_involvement"}, {"score": 0.002382182688788248, "phrase": "technology_limitations"}, {"score": 0.0022453451864218477, "phrase": "technology_barriers"}, {"score": 0.0022213218042340735, "phrase": "staff_resistance"}, {"score": 0.002174041708084857, "phrase": "clear_communication"}, {"score": 0.0021049977753042253, "phrase": "new_information"}], "paper_keywords": [""], "paper_abstract": "Technology has great potential to reduce medication errors in hospitals. This case report describes barriers to, and facilitators of, the implementation of a pharmacy bar code scanning system to reduce medication dispensing errors at a large academic medical center. Ten pharmacy staff were interviewed about their experiences during the implementation. Interview notes were iteratively reviewed to identify common themes. The authors identified three main barriers to pharmacy bar code scanning system implementation: process (training requirements and process flow issues), technology (hardware, software, and the role of vendors), and resistance (communication issues, changing roles, and negative perceptions about technology). The authors also identified strategies to overcome these barriers. Adequate training, continuous improvement, and adaptation of workflow to address one's own needs mitigated process barriers. Ongoing vendor involvement, acknowledgment of technology limitations, and attempts to address them were crucial in overcoming technology barriers. Staff resistance was addressed through clear communication, identifying champions, emphasizing new information provided by the system, and facilitating collaboration.", "paper_title": "Overcoming Barriers to the Implementation of a Pharmacy Bar Code Scanning System for Medication Dispensing: A Case Study", "paper_id": "WOS:000269755500006"}