{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "group_recommendation"}, {"score": 0.030195848494582518, "phrase": "disagreement_lists"}, {"score": 0.004380143676997257, "phrase": "colleague's_farewell"}, {"score": 0.0038841330270679097, "phrase": "users'_satisfaction"}, {"score": 0.0038559375376635047, "phrase": "different_aggregation_strategies"}, {"score": 0.0036909954181293405, "phrase": "earlier_conference_paper"}, {"score": 0.003664196785572724, "phrase": "amer-yahia"}, {"score": 0.0035980461114642503, "phrase": "vldb"}, {"score": 0.0032371745435372168, "phrase": "different_group_consensus_semantics"}, {"score": 0.0029768089698126547, "phrase": "efficient_group_recommendation_algorithms"}, {"score": 0.0028807066376546502, "phrase": "rating_lists"}, {"score": 0.002747328139245956, "phrase": "space_constraints"}, {"score": 0.002717433692385074, "phrase": "per-user_and_pairwise_item_lists"}, {"score": 0.0026296828616623994, "phrase": "user_behavior"}, {"score": 0.0025447584328314754, "phrase": "space_budget"}, {"score": 0.0023830293456003765, "phrase": "second_solution"}, {"score": 0.0021437580456873584, "phrase": "extensive_set"}], "paper_keywords": ["Group recommendation", " Top-k algorithm"], "paper_abstract": "Imagine a system that gives you satisfying recommendations when you want to rent a movie with friends or find a restaurant to celebrate a colleague's farewell: at the core of such a system is what we call group recommendation. While computing individual recommendations have received lots of attention (e.g., Netflix prize), group recommendation has been confined to studying users' satisfaction with different aggregation strategies. In this paper (Some results are published in an earlier conference paper (Amer-Yahia et al. in VLDB, 2009). See Sect. \"Paper contributions and outline\" for details.), we describe the challenges and desiderata of group recommendation and formalize different group consensus semantics that account for both an item's predicted ratings to the group members and the disagreements among them. We focus on the design and implementation of efficient group recommendation algorithms that intelligently prune and merge per-user predicted rating lists and pairwise disagreement lists of items. We further explore the impact of space constraints on maintaining per-user and pairwise item lists and develop two complementary solutions that leverage shared user behavior to maintain the efficiency of our recommendation algorithms within a space budget. The first solution, behavior factoring, factors out user agreements from disagreement lists, while the second solution, partial materialization, selectively materializes a subset of disagreement lists. Finally, we demonstrate the usefulness of our group recommendations and the efficiency and scalability of our algorithms using an extensive set of experiments on the 10 M ratings MovieLens data set.", "paper_title": "Space efficiency in group recommendation", "paper_id": "WOS:000286037700007"}