{"auto_keywords": [{"score": 0.049698358871674383, "phrase": "hospital_decision_scenarios"}, {"score": 0.004220624516321415, "phrase": "hospital_emergency_room_scenarios"}, {"score": 0.0039911102918360995, "phrase": "single-agent_single-user_setting"}, {"score": 0.0038655854071187115, "phrase": "multiagent_systems"}, {"score": 0.003640730820018083, "phrase": "decision_making"}, {"score": 0.0034289106230496816, "phrase": "fundamental_research"}, {"score": 0.0032164910932827168, "phrase": "medical_experts"}, {"score": 0.0031277316566463978, "phrase": "possible_bother"}, {"score": 0.003005151718290603, "phrase": "best_care"}, {"score": 0.00288736193515505, "phrase": "real-time_nature"}, {"score": 0.002818909613625567, "phrase": "knowledge-intensive_nature"}, {"score": 0.002741091312632307, "phrase": "new_parameters"}, {"score": 0.0025001755089445092, "phrase": "experimental_results"}, {"score": 0.0023925401023682717, "phrase": "hospital_settings"}, {"score": 0.0023451553255837317, "phrase": "patient_care"}, {"score": 0.0022531762659857507, "phrase": "future_research"}, {"score": 0.002147540520631409, "phrase": "multiagent_environments"}, {"score": 0.0021049977753042253, "phrase": "time-critical_care"}], "paper_keywords": ["Reasoning about interaction", " Modeling bother", " Multiagent systems", " Hospital decision making", " Coordination of teams of health professionals", " Choosing medical experts"], "paper_abstract": "In this paper, we present a framework for interacting with users that is sensitive to the cost of bother and then focus on its application to decision making in hospital emergency room scenarios. We begin with a model designed for reasoning about interaction in a single-agent single-user setting and then expand to the environment of multiagent systems. In this setting, agents consider both whether to ask other agents to perform decision making and at the same time whether to ask questions of these agents. With this fundamental research as a backdrop, we project the framework into the application of reasoning about which medical experts to interact with, sensitive to possible bother, during hospital decision scenarios, in order to deliver the best care for the patients that arrive. Due to the real-time nature of the application and the knowledge-intensive nature of the decisions, we propose new parameters to include in the reasoning about interaction and sketch their usefulness through a series of examples. We then include a set of experimental results confirming the value of our proposed approach for reasoning about interaction in hospital settings, through simulations of patient care in those environments. We conclude by pointing to future research to continue to extend the model for reasoning about interaction in multiagent environments for the setting of time-critical care in hospital settings.", "paper_title": "A user modeling approach for reasoning about interaction sensitive to bother and its application to hospital decision scenarios", "paper_id": "WOS:000300083400005"}