{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "robot_techniques"}, {"score": 0.004195418010131832, "phrase": "domestic-service_robots"}, {"score": 0.0038802832668554457, "phrase": "genetic_algorithms"}, {"score": 0.0036385493850693983, "phrase": "main_restrictions"}, {"score": 0.0035887342563437935, "phrase": "desired_behaviour"}, {"score": 0.0032287289440915187, "phrase": "fast_convergence"}, {"score": 0.0031845067058084583, "phrase": "good_robot-control_policy"}, {"score": 0.0031121406603482112, "phrase": "random_explorations"}, {"score": 0.002723607240517261, "phrase": "domain-dependent_knowledge"}, {"score": 0.00257735013358606, "phrase": "robot_controller"}, {"score": 0.002472822097373027, "phrase": "different_robot-platform"}, {"score": 0.002183938718432764, "phrase": "common_problem"}, {"score": 0.002163930783583212, "phrase": "mobile_robotics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["reinforcement learning", " robot control", " autonomous agents", " genetic algorithms"], "paper_abstract": "Research on robot techniques that are fast, user-friendly, and require little application-specific knowledge by the user, is more and more encouraged in a society where the demand of home-care or domestic-service robots is increasing continuously. In this context we propose a methodology which combines reinforcement learning and genetic algorithms to teach a robot how to perform a task when only the specification of the main restrictions of the desired behaviour is provided. Through this combination, both paradigms must be merged in such a way that they influence each other to achieve a fast convergence towards a good robot-control policy, and reduce the random explorations the robot needs to carry out in order to find a solution. Another advantage of our proposal is that it is able to easily incorporate any kind of domain-dependent knowledge about the task. This is very useful for improving a robot controller, for applying a robot-controller to move a different robot-platform, or when we have certain \"feelings\" about how the task should be solved. The performance of our proposal is shown through its application to solve a common problem in mobile robotics. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Autonomous and fast robot learning through motivation", "paper_id": "WOS:000249771900011"}