{"auto_keywords": [{"score": 0.03101516663123776, "phrase": "orthrus"}, {"score": 0.010505907630347986, "phrase": "multiple_volume_servers"}, {"score": 0.004459190343665408, "phrase": "file_system"}, {"score": 0.00441909542037375, "phrase": "block_level_storage_system"}, {"score": 0.004300951511110487, "phrase": "existing_block_level_storage_system"}, {"score": 0.0037219886365287085, "phrase": "volume_server"}, {"score": 0.003573626511295813, "phrase": "whole_system"}, {"score": 0.0034467039994594065, "phrase": "lightweighted_block-level_storage_system"}, {"score": 0.0033242742850902295, "phrase": "virtualization_technology"}, {"score": 0.0031062822219953524, "phrase": "system_performance"}, {"score": 0.002955533639862811, "phrase": "listen-detect-switch_mechanism"}, {"score": 0.0028764048059439205, "phrase": "contingent_volume_servers'_failure"}, {"score": 0.0026634937939104177, "phrase": "machine_capability"}, {"score": 0.002639502113350897, "phrase": "load_quantity"}, {"score": 0.0026157259734105, "phrase": "black_box_model"}, {"score": 0.0025572160146590623, "phrase": "dynamic_load_balance_strategy"}, {"score": 0.0025000115574335693, "phrase": "genetic_algorithm"}, {"score": 0.0024774888010414206, "phrase": "extensive_experimental_results"}, {"score": 0.002222497594238545, "phrase": "iops"}], "paper_keywords": ["Cloud storage", " Virtual block store", " Logical volume", " Load balance", " Genetic algorithm"], "paper_abstract": "Taking advantage of distributed storage technology and virtualization technology, cloud storage systems provide virtual machine clients customizable storage service. They can be divided into two types: distributed file system and block level storage system. There are two disadvantages in existing block level storage system: Firstly, Some of them are tightly coupled with their cloud computing environments. As a result, it's hard to extend them to support other cloud computing platforms; Secondly, The bottleneck of volume server seriously affects the performance and reliability of the whole system. In this paper we present a lightweighted block-level storage system for clouds-ORTHRUS, based on virtualization technology. We first design the architecture with multiple volume servers and its workflows, which can improve system performance and avoid the problem. Secondly, we propose a Listen-Detect-Switch mechanism for ORTHRUS to deal with contingent volume servers' failure. At last we design a strategy that dynamically balances load between multiple volume servers. We characterize machine capability and load quantity with black box model, and implement the dynamic load balance strategy which is based on genetic algorithm. Extensive experimental results show that the aggregated I/O throughputs of ORTHRUS are significantly improved (approximately two times of that in Orthrus), and both I/O throughputs and IOPS are also remarkably improved (about 1.8 and 1.2 times, respectively) by our dynamic load balance strategy.", "paper_title": "ORTHRUS: a lightweighted block-level cloud storage system", "paper_id": "WOS:000327854400001"}