{"auto_keywords": [{"score": 0.03961328445780148, "phrase": "handheld_devices"}, {"score": 0.02987089440189968, "phrase": "user_cooperation"}, {"score": 0.004765173195920904, "phrase": "challenges_and_opportunities._recent_years"}, {"score": 0.004571133708117502, "phrase": "mobile_applications"}, {"score": 0.004407813106104401, "phrase": "explosive_growth"}, {"score": 0.004294724955301414, "phrase": "mobile_devices"}, {"score": 0.0036743708250589484, "phrase": "online_services"}, {"score": 0.003580032420161922, "phrase": "processing_powers"}, {"score": 0.003380897678672156, "phrase": "battery_lifetime"}, {"score": 0.0033285306462537884, "phrase": "performance_bottleneck"}, {"score": 0.003078577062864183, "phrase": "new_techniques"}, {"score": 0.003015143226706584, "phrase": "efficient_use"}, {"score": 0.002968424524565369, "phrase": "devices'_energy_resources"}, {"score": 0.0025259712348798323, "phrase": "energy_consumption"}, {"score": 0.002435542816459651, "phrase": "key_challenges"}], "paper_keywords": [""], "paper_abstract": "Recent years have witnessed tremendous success and popularity of mobile applications and services, resulting in an explosive growth in the number of mobile devices, as well as in the range and types of things these devices can do. People nowadays become extremely dependent on their smartphones and handheld devices to access and receive online services. While computing and processing powers of these handheld devices are keeping up with this demand, battery lifetime remains the performance bottleneck, and researchers are now more challenged than ever before to come up with new techniques that can make efficient use of the devices' energy resources. In this article, we focus on exploiting user cooperation as a way of conserving energy in 4G mobile networks. We first begin by overviewing user cooperation and illustrating its potential for reducing energy consumption. Then, we describe the key challenges 4G mobile users face vis-a-vis of cooperation. Finally, we discuss some of the techniques proposed in literature to address these challenges by highlighting their methodologies, advantages, and disadvantages.", "paper_title": "EXPLOITING 4G MOBILE USER COOPERATION FOR ENERGY CONSERVATION: CHALLENGES AND OPPORTUNITIES", "paper_id": "WOS:000327502000010"}