{"auto_keywords": [{"score": 0.04845849110410783, "phrase": "social_interaction"}, {"score": 0.004760017604908536, "phrase": "prior_research"}, {"score": 0.004123781267600542, "phrase": "monetary_rewards"}, {"score": 0.004053362743156545, "phrase": "present_research"}, {"score": 0.003431481042678356, "phrase": "answer_feedback"}, {"score": 0.003006654007926993, "phrase": "google_answers"}, {"score": 0.0028715299874549245, "phrase": "content_analysis"}, {"score": 0.0026342827320931937, "phrase": "site's_participants"}, {"score": 0.002444544487772349, "phrase": "social_and_monetary_feedback"}, {"score": 0.002268441347979241, "phrase": "implicit_cues"}, {"score": 0.0022424956516376073, "phrase": "textual_communication"}, {"score": 0.0021416404045850224, "phrase": "social_capital"}, {"score": 0.0021049977753042253, "phrase": "monetary_and_social_forms"}], "paper_keywords": [""], "paper_abstract": "Prior research has shown that social interaction is important for continuation of question-and-answer (Q&A) activity online and that it also leads to monetary rewards. The present research focuses on the link between social interaction and the value of information. Expressions of self-presentation in the interaction between askers and answerers online are studied as antecedents for answer feedback which represents the value of the answer to the asker. This relationship is examined in a Q&A site, specifically, in Google Answers (GA). The results of content analysis performed on sets of questions and answers show that both explicit and implicit social cues are used by the site's participants; however, only implicit expressions of self-presentation are related to the provision of social and monetary feedback, ratings, and tips. This finding highlights the importance of implicit cues in textual communication and lends support to the notion of social capital where both monetary and social forms of feedback are the result of interaction online.", "paper_title": "Self-Presentation and the Value of Information in Q&A Websites", "paper_id": "WOS:000272257800007"}