{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dram_row_activations"}, {"score": 0.004566567411073082, "phrase": "new_approach"}, {"score": 0.004494570360108983, "phrase": "dram_performance"}, {"score": 0.004447201233380302, "phrase": "energy_consumption"}, {"score": 0.004285289574869884, "phrase": "dirty_cache_lines"}, {"score": 0.004240119854085434, "phrase": "dram."}, {"score": 0.003597625122515975, "phrase": "corresponding_row"}, {"score": 0.0030684249587688826, "phrase": "significant_reduction"}, {"score": 0.003036040409062437, "phrase": "row_activations"}, {"score": 0.002548331088496964, "phrase": "full-system_simulator_show_compelling_performance_improvements"}, {"score": 0.002378408229095287, "phrase": "performance_improvements"}, {"score": 0.0021616339773325704, "phrase": "dram_energy"}, {"score": 0.0021049977753042253, "phrase": "energy_consumption_reductions"}], "paper_keywords": ["DRAM", " performance", " energy consumption", " eager writeback"], "paper_abstract": "This article describes and evaluates a new approach to optimizing DRAM performance and energy consumption that is based on eagerly writing dirty cache lines to DRAM. Under this approach, many dirty cache lines are written to DRAM before they are evicted. In particular, dirty cache lines that have not been recently accessed are eagerly written to DRAM when the corresponding row has been activated by an ordinary, noneager access, such as a read. This approach enables clustering of reads and writes that target the same row, resulting in a significant reduction in row activations. Specifically, for a variety of applications, it reduces the number of DRAM row activations by an average of 42% and a maximum of 82%. Moreover, the results from a full-system simulator show compelling performance improvements and energy consumption reductions. Out of 23 applications, 6 have overall performance improvements between 10% and 20%, and 3 have improvements in excess of 20%. Furthermore, 12 consume between 10% and 20% less DRAM energy, and 7 have energy consumption reductions in excess of 20%.", "paper_title": "Reducing DRAM Row Activations with Eager Read/Write Clustering", "paper_id": "WOS:000330509300022"}