{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_roles"}, {"score": 0.049747721549480595, "phrase": "multiple_supersystems"}, {"score": 0.0428308975315894, "phrase": "functioning_system"}, {"score": 0.042121604651343916, "phrase": "functional_role"}, {"score": 0.00435375504298636, "phrase": "general_form"}, {"score": 0.003855347387268162, "phrase": "single_function"}, {"score": 0.0033317342432676385, "phrase": "\"_the_function"}, {"score": 0.002344800544183559, "phrase": "function_assignments"}, {"score": 0.002119702106867801, "phrase": "diagrammatic_representation"}, {"score": 0.0021049977753042253, "phrase": "multiple_systems"}], "paper_keywords": ["Causation", " Function", " Proliferation", " Propagation", " Systems"], "paper_abstract": "When considering a system that performs a role, it is often stated that performing that role is a function of the system. The general form of such statements is that \"the function of S is R,\" where S is the functioning system and R is the functional role it plays. However, such statements do not represent how that single function was selected from many possible alternatives. This article renders those alternatives explicit by revealing the other possible function statements that might be made when either S or R is being considered. In particular, two forms of selection are emphasized. First, when we say \" the function of S is R,\" there are typically many systems other than S that are required to be in operation for that role to be fulfilled. The functioning system, S, does not perform the role, R, all by itself, and those systems that support S in performing that role might also have been considered as functioning. Second, when we say, \" the function of S is R,\" there are typically many other roles that S plays apart from R, and those other roles might also have been considered functional. When we make function assignments, we select both the functioning system, S, and the functional role, R, from a range of alternatives. To emphasize these alternatives, this article develops a diagrammatic representation of multiple systems playing multiple roles in multiple supersystems.", "paper_title": "The proliferation of functions: Multiple systems playing multiple roles in multiple supersystems", "paper_id": "WOS:000348496500007"}