{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "data_processing_for_medial_axis_computation_using_b-spline_smoothing"}, {"score": 0.0047007816199415905, "phrase": "sophisticated_algorithm_design"}, {"score": 0.0046526806928044485, "phrase": "geometric_arrangements"}, {"score": 0.004573598742696912, "phrase": "space_efficiency"}, {"score": 0.0041548413176193235, "phrase": "commercial_grade_implementation"}, {"score": 0.003932929770322298, "phrase": "successful_processing"}, {"score": 0.0036220063770882275, "phrase": "clever_way"}, {"score": 0.0035481809241908044, "phrase": "progressively_smaller_time"}, {"score": 0.0033241495608238884, "phrase": "input_data_anomalies"}, {"score": 0.003114219280081737, "phrase": "dowstream_computing"}, {"score": 0.002465516335722086, "phrase": "geometric_computing"}, {"score": 0.002431861192375809, "phrase": "algorithm_design"}, {"score": 0.002390436017272046, "phrase": "data_processing"}, {"score": 0.002374063735432571, "phrase": "vroni"}, {"score": 0.0021711323811863963, "phrase": "medial_axis"}, {"score": 0.0021049977753042253, "phrase": "applications_engineer"}], "paper_keywords": [""], "paper_abstract": "There has been much attention on sophisticated algorithm design to compute geometric arrangements with both time and space efficiency. The issue of robustness and reliability has also been the subject of some interest, although mostly at the level of theory rather than practice and commercial grade implementation. What seems to have received very little attention is the need to prepare the data for successful processing. It is almost universally assumed that the data are valid and well presented and the only real challenge is to come up with a clever way of computing the results with progressively smaller time and space bounds. The aim of this paper is to narrow this gap by focusing entirely on input data anomalies, how to prepare the data for error free computation and how to post process the results for dowstream computing. The medial axis computation, using VRONI (Held, 2001, \"VRONI: An Engineering Approach to the Reliable and Efficient Computation of Voronoi Diagram of Points and Line Segments,\" Comput. Geom.-Theory Appl., 18, pp. 95-123), is singled out as an example and it is shown that based on how the data are prepared, the results can be vastly different. We argue in this paper that the success of geometric computing depends equally on algorithm design as well as on data processing. VRONI (and most geometric algorithms) does not understand the concept of noise, gaps, or aliasing. It only sees a polygon and generates the medial axis accordingly. It is the job of the applications engineer to prepare the data so that the output is acceptable.", "paper_title": "Data Processing for Medial Axis Computation Using B-Spline Smoothing", "paper_id": "WOS:000344473500002"}