{"auto_keywords": [{"score": 0.038987763109041416, "phrase": "possible_and_necessary_winners"}, {"score": 0.007389180774188184, "phrase": "preference_elicitation"}, {"score": 0.0068671778356593684, "phrase": "cup_rule"}, {"score": 0.006817036005002866, "phrase": "weighted_votes"}, {"score": 0.006405252205218382, "phrase": "preference_aggregation_function"}, {"score": 0.006018191527505356, "phrase": "polynomial_time"}, {"score": 0.00481495049065317, "phrase": "preference_aggregation"}, {"score": 0.004590496414177077, "phrase": "multiple_agents"}, {"score": 0.004408729661992651, "phrase": "possible_candidates"}, {"score": 0.004328494656899359, "phrase": "preference_relations"}, {"score": 0.004096409451697279, "phrase": "ongoing_preference_elicitation_process"}, {"score": 0.0038624981944755813, "phrase": "multi-criteria_scenarios"}, {"score": 0.003190367939051776, "phrase": "computationally_intractable_problem"}, {"score": 0.0031670358530166256, "phrase": "sw"}, {"score": 0.0031437775259091794, "phrase": "unweighted_votes"}, {"score": 0.003019121766552419, "phrase": "good_approximation"}, {"score": 0.002931569771634119, "phrase": "general_properties"}, {"score": 0.0028360962841331634, "phrase": "irrelevant_alternatives"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Preference in multi-agent systems", " Preference aggregation", " Computational complexity", " Uncertainty", " Elicitation"], "paper_abstract": "We consider how to combine the preferences of multiple agents despite the presence of incompleteness and incomparability in their preference relations over possible candidates. The set of preference relations of an agent may be incomplete because, for example, there is an ongoing preference elicitation process. There may also be incomparability as this is useful, for example, in multi-criteria scenarios. We focus here on the problem of computing the possible and necessary winners, that is, those candidates which can be, or always are, the most preferred for the agents. Possible and necessary winners are useful in many scenarios including preference elicitation. First, we show that testing possible and necessary winners is in general a computationally intractable problem for SW with unweighted votes and the cup rule with weighted votes, as is providing a good approximation of such sets. Then, we identify general properties of the preference aggregation function, such as independence to irrelevant alternatives, which are sufficient for such sets to be computed in polynomial time. Finally, we show how possible and necessary winners can be used to focus preference elicitation. We show that it is computationally intractable for the cup rule with weighted votes in the worst-case to decide when to terminate elicitation. However, we identify a property of the preference aggregation function that allows us to decide when to terminate elicitation in polynomial time, by focusing on possible and necessary winners. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Incompleteness and incomparability in preference aggregation: Complexity results", "paper_id": "WOS:000290822300010"}