{"auto_keywords": [{"score": 0.04953100433337602, "phrase": "singleton_interval"}, {"score": 0.010450360188117042, "phrase": "moea"}, {"score": 0.009590163367006748, "phrase": "fls"}, {"score": 0.0047325016751114165, "phrase": "fuzzy_logic_systems"}, {"score": 0.004416523252575371, "phrase": "high_uncertainty_levels"}, {"score": 0.004328383851864678, "phrase": "main_criticisms"}, {"score": 0.004133443893051179, "phrase": "extra_degrees"}, {"score": 0.003992999293962473, "phrase": "sufficiently_large_number"}, {"score": 0.003407728065269377, "phrase": "comparative_study"}, {"score": 0.0032075435331011173, "phrase": "multiobjective_evolutionary_algorithm"}, {"score": 0.0027291997451172486, "phrase": "\"optimal\"_consequents"}, {"score": 0.002598587136329808, "phrase": "common_methodology"}, {"score": 0.0024317447319124066, "phrase": "data_samples"}, {"score": 0.0024107856296917813, "phrase": "second_contribution"}, {"score": 0.0023694065215394593, "phrase": "common_framework"}, {"score": 0.0022755900116918923, "phrase": "aforementioned_criticism"}, {"score": 0.0021981315377404245, "phrase": "statistical_analysis"}, {"score": 0.0021417691855960715, "phrase": "higher_levels"}], "paper_keywords": ["Multiobjective optimization", " nonsingleton fuzzy logic systems (FLSs)", " type-2 fuzzy logic systems"], "paper_abstract": "Singleton interval type-2 fuzzy logic systems (FLSs) have been widely applied in several real-world applications, where it was shown that the singleton interval type-2 FLSs outperform their singleton type-1 counterparts in applications with high uncertainty levels. However, one of the main criticisms of singleton interval type-2 FLSs is the fact that they outperform singleton type-1 FLSs solely based on their use of extra degrees of freedom (extra parameters) and that type-1 FLSs with a sufficiently large number of parameters may provide the same performance as interval type-2 FLSs. In addition, most works on type-2 FLSs only compare their results with singleton type-1 FLSs but fail to consider nonsingleton type-1 systems. In this paper, we aim to directly address and investigate this criticism. In order to do so, we will perform a comparative study between optimized singleton type-1, nonsingleton type-1, and singleton interval type-2 FLSs under the presence of noise. We will also present a multiobjective evolutionary algorithm (MOEA) for the optimization of singleton type-1, nonsingleton type-1, and singleton interval type-2 fuzzy systems for function approximation problems. The MOEA will aim to satisfy two objectives to maximize the accuracy of the FLS and minimize the number of rules in the FLS, thus improving its interpretability. Furthermore, we will present a methodology to obtain \"optimal\" consequents for the FLSs. Hence, this paper has two main contributions: First, it provides a common methodology to learn the three types of FLSs (i.e., singleton type-1, nonsingleton type-1, and singleton interval type-2 FLSs) from data samples. The second contribution is the creation of a common framework for the comparison of type-1 and type-2 FLSs that allows us to address the aforementioned criticism. We provide details of a series of experiments and include statistical analysis showing that the type-2 FLS is able to handle higher levels of noise than its nonsingleton and singleton type-1 counterparts.", "paper_title": "Multiobjective Optimization and Comparison of Nonsingleton Type-1 and Singleton Interval Type-2 Fuzzy Logic Systems", "paper_id": "WOS:000319930000006"}