{"auto_keywords": [{"score": 0.04072472046898861, "phrase": "team_semantics"}, {"score": 0.00481495049065317, "phrase": "imperfect_information"}, {"score": 0.004589763483242731, "phrase": "tarski_semantics"}, {"score": 0.004481132747216135, "phrase": "single_assignments"}, {"score": 0.003943569631183138, "phrase": "model-checking_games"}, {"score": 0.0038348235692738783, "phrase": "general_and_systematic_way"}, {"score": 0.0036993855514735746, "phrase": "first-order_logic"}, {"score": 0.0034426417353349567, "phrase": "team_properties"}, {"score": 0.0031654684543975077, "phrase": "second-order_features"}, {"score": 0.0030292784088033838, "phrase": "consistent_winning_strategy"}, {"score": 0.0029693204265884327, "phrase": "second-order_notion"}, {"score": 0.0028643622911111942, "phrase": "single_plays"}, {"score": 0.0024802523752944536, "phrase": "second-order_reachability_games"}, {"score": 0.0022987068521717765, "phrase": "familiar_combinatorial_problems"}, {"score": 0.0022712795176156536, "phrase": "somewhat_unexpected_way"}, {"score": 0.0021909411820497707, "phrase": "complexity_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Model-checking games", " Dependence logic", " Independence logic", " Team semantics", " Second-order reachability games", " Complexity"], "paper_abstract": "Logics of dependence and independence have semantics that, unlike Tarski semantics, are not based on single assignments (mapping variables to elements of a structure) but on sets of assignments. Sets of assignments are called teams and the semantics is called team semantics. We design model-checking games for logics with team semantics in a general and systematic way. The construction works for any extension of first-order logic by atomic formulae on teams, as long as certain natural conditions are observed which are satisfied by all team properties considered so far in the literature, including dependence, independence, constancy, inclusion, and exclusion. The second-order features of team semantics are reflected by the notion of a consistent winning strategy which is also a second-order notion in the sense that it depends not on single plays but on the space of all plays that are compatible with the strategy. Beyond the application to logics with team semantics, we isolate an abstract, purely combinatorial definition of such games, which may be viewed as second-order reachability games, and study their algorithmic properties. A number of examples are provided that show how logics with team semantics express familiar combinatorial problems in a somewhat unexpected way. Based on our games, we provide a complexity analysis of logics with team semantics. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Model-checking games for logics of imperfect information", "paper_id": "WOS:000321410000002"}