{"auto_keywords": [{"score": 0.04920822493417558, "phrase": "pulmonary_hypertension"}, {"score": 0.00481495049065317, "phrase": "cyber_support_describing_concerns"}, {"score": 0.0047709540557306284, "phrase": "caregivers_of_people"}, {"score": 0.004273196830970426, "phrase": "online_discussion_board"}, {"score": 0.004176194589991187, "phrase": "complex_medical_needs"}, {"score": 0.0041001740903338834, "phrase": "pulmonary_hypertension_warrant"}, {"score": 0.003970439654470374, "phrase": "patient_and_caregiver_concerns"}, {"score": 0.003951952964278128, "phrase": "discussion_board"}, {"score": 0.0038447943243941685, "phrase": "qualitative_descriptive_approach"}, {"score": 0.003757480190200645, "phrase": "convenience_sample"}, {"score": 0.0036052633308076933, "phrase": "internet_messages"}, {"score": 0.0031553611552558986, "phrase": "clinical_variables"}, {"score": 0.003083655376444887, "phrase": "oxygen_use"}, {"score": 0.002999749669403939, "phrase": "thematic_analysis"}], "paper_keywords": ["Caregivers", " Chronic illness", " Online", " Pulmonary hypertension", " Support"], "paper_abstract": "The purpose of this study was to gain an understanding of how caregivers of people with pulmonary hypertension are using an online discussion board. The chronicity and complex medical needs of people with pulmonary hypertension warrant a holistic nursing approach combining the patient and caregiver concerns to adequately address their needs. A qualitative descriptive approach was utilized. A convenience sample over an 18-month period of those caregivers who posted Internet messages to the Pulmonary Hypertension Discussion Board was included. Sociodemographics collected were age and gender of the person with pulmonary hypertension and the relationship of the caregiver to the person with pulmonary hypertension. Clinical variables collected were medications and oxygen use and years since diagnosis. Thematic analysis was used to identify themes. A total of 98 caregivers posted to the discussion board during the 18-month period; 46% of those posting were mothers of children with pulmonary hypertension. Four themes emerged: fear and frustration, questions and concerns, someone to listen to, and moving on with life. These themes characterize how caregivers of people with pulmonary hypertension were using the discussion board. Caregivers of people with pulmonary hypertension may need more information and support from their healthcare providers to adequately care for those with pulmonary hypertension.", "paper_title": "Cyber Support Describing Concerns of Caregivers of People With Pulmonary Hypertension", "paper_id": "WOS:000328929100002"}