{"auto_keywords": [{"score": 0.028784398538570264, "phrase": "acceleration_peaks"}, {"score": 0.00481495049065317, "phrase": "discrete_musical_air_gestures"}, {"score": 0.004683540676363745, "phrase": "musical_interfaces"}, {"score": 0.004396426822203258, "phrase": "physical_object"}, {"score": 0.004225950334493496, "phrase": "resulting_sound"}, {"score": 0.004014135205423942, "phrase": "air_instruments"}, {"score": 0.003966776222128288, "phrase": "discrete_sounds"}, {"score": 0.0037679023889496885, "phrase": "rhythmically_complex_music"}, {"score": 0.003650488388949457, "phrase": "air_drumming_gestures"}, {"score": 0.0034949740315415043, "phrase": "simple_recorded_rhythms"}, {"score": 0.0027778413437997613, "phrase": "hand_changes"}, {"score": 0.0026911959223982727, "phrase": "sharp_peaks"}, {"score": 0.002669959049383929, "phrase": "magnitude_acceleration"}, {"score": 0.0026384167183586015, "phrase": "hand_decelerates"}, {"score": 0.0022428042503686053, "phrase": "note_speed"}, {"score": 0.0021814396743238176, "phrase": "timing_differences"}, {"score": 0.002164216680934624, "phrase": "hand_and_wrist_features"}, {"score": 0.00212175050242788, "phrase": "group_performers"}, {"score": 0.0021049977753042253, "phrase": "different_movement_styles"}], "paper_keywords": [""], "paper_abstract": "Motion-sensing technologies enable musical interfaces where a performer controls sound by moving his or her body in the air, without touching a physical object. These interfaces work well when the movement and resulting sound are smooth and continuous, but it has proven difficult to design air instruments that trigger discrete sounds with precision that feels natural to performers and allows them to play rhythmically complex music. This article presents a study of air drumming gestures. Participants performed drumming-like gestures in time to simple recorded rhythms. These movements were recorded and examined to look for aspects of the movement that correspond to the timing of the sounds. The goal is to understand what we do with our bodies when we gesture in the air to trigger a sound. Two movement features of the hand are studied: Hits are the moment where the hand changes direction at the end of the striking gesture, and acceleration peaks are sharp peaks in magnitude acceleration as the hand decelerates. Hits and acceleration peaks are also detected for the movement of the wrist. It is found that the acceleration peaks are more useful than the hits because they occur earlier and with less variability, and their timing changes less with note speed. It is also shown that timing differences between hand and wrist features can be used to group performers into different movement styles.", "paper_title": "Studying the Timing of Discrete Musical Air Gestures", "paper_id": "WOS:000355321900003"}