{"auto_keywords": [{"score": 0.04005235829421412, "phrase": "realization_patterns"}, {"score": 0.013914294252166937, "phrase": "smart_home_resident"}, {"score": 0.010178114161952682, "phrase": "prediction_patterns"}, {"score": 0.00481495049065317, "phrase": "smart_homes"}, {"score": 0.00474946741204285, "phrase": "typical_resident"}, {"score": 0.0046848707075530256, "phrase": "smart_home"}, {"score": 0.004600100053651545, "phrase": "alzheimer_patient"}, {"score": 0.004335000368745273, "phrase": "key_point"}, {"score": 0.004103817210338686, "phrase": "correct_realization_patterns"}, {"score": 0.003849579089885659, "phrase": "primary_data"}, {"score": 0.003371773890338284, "phrase": "fuzzy_clustering_techniques"}, {"score": 0.003265591844292821, "phrase": "sensor_data"}, {"score": 0.002493333098814506, "phrase": "resident_goals"}, {"score": 0.0024147474002390763, "phrase": "daily_activities"}, {"score": 0.002234031373581961, "phrase": "smart_homes_residents"}, {"score": 0.0021049977753042253, "phrase": "activity_recognition"}], "paper_keywords": ["Ambient environment", " Fuzzy logic", " Fuzzy subtractive clustering", " Activity recognition", " Temporal data mining"], "paper_abstract": "A typical resident of a smart home can be an Alzheimer patient that forgets sometimes to complete the activities that he begins. The key point to assist the smart home resident is to model the activities and discover correct realization patterns of activities. To accomplish this task, we apply sensors to provide primary data about realization patterns of actions, operations, plans, goals and generally any objective that the smart home resident may desire to do. In the consequence, by applying fuzzy clustering techniques, we are able to mine sensor data to retrieve the realization patterns of activities, and so the prediction patterns of intentions are recognizable. Comparing the realization patterns with prediction patterns of activities, we would be able to predict the intention of the resident about the activity that the resident considers to realize. In this way, we would be able to provide hypotheses about the resident goals and his possible goal achievement's defects. Spatiotemporal aspects of daily activities such as movement of objects are surveyed to discover the patterns of activities realized by the smart homes residents. In this research, uncertainty is considered as a property of activity recognition.", "paper_title": "Activity modeling under uncertainty by trace of objects in smart homes", "paper_id": "WOS:000351238800014"}