{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "hfe"}, {"score": 0.018729166551724855, "phrase": "multi-hfe"}, {"score": 0.00987576709828256, "phrase": "multi-hfe."}, {"score": 0.006615909852074451, "phrase": "extension_field"}, {"score": 0.004681219780670747, "phrase": "ks_attack"}, {"score": 0.00433531459712787, "phrase": "well-known_hfe_schemes"}, {"score": 0.0042452552248398445, "phrase": "multivariate_quadratic_system"}, {"score": 0.004081385289516914, "phrase": "private_key"}, {"score": 0.003913529383328025, "phrase": "faugsre"}, {"score": 0.003504912881810048, "phrase": "basic_key_recovery"}, {"score": 0.003477409382150934, "phrase": "kipnis"}, {"score": 0.0034591952265308314, "phrase": "shamir"}, {"score": 0.0032649758151918158, "phrase": "basic_kipnis-shamir"}, {"score": 0.0030414140732789186, "phrase": "multi-hfe_scheme"}, {"score": 0.0030017207229983385, "phrase": "basic_hfe."}, {"score": 0.0029703382422692037, "phrase": "structural_weakness"}, {"score": 0.002893305833687092, "phrase": "classical_modifiers"}, {"score": 0.002878140062594849, "phrase": "multivariate_schemes"}, {"score": 0.0024711979210775285, "phrase": "minrank"}, {"score": 0.002445347925313158, "phrase": "recent_complexity_results"}, {"score": 0.0023261986886876336, "phrase": "possible_practical_settings"}, {"score": 0.0022303670135912714, "phrase": "equally-sized_keys"}], "paper_keywords": ["Hidden field equations", " MinRank", " Grobner bases"], "paper_abstract": "We investigate in this paper the security of HFE and Multi-HFE schemes as well as their minus and embedding variants. Multi-HFE is a generalization of the well-known HFE schemes. The idea is to use a multivariate quadratic system-instead of a univariate polynomial in HFE-over an extension field as a private key. According to the authors, this should make the classical direct algebraic (message-recovery) attack proposed by FaugSre and Joux on HFE no longer efficient against Multi-HFE. We consider here the hardness of the key-recovery in Multi-HFE and its variants, but also in HFE (both for odd and even characteristic). We first improve and generalize the basic key recovery proposed by Kipnis and Shamir on HFE. To do so, we express this attack as matrix/vector operations. In one hand, this permits to improve the basic Kipnis-Shamir (KS) attack on HFE. On the other hand, this allows to generalize the attack on Multi-HFE. Due to its structure, we prove that a Multi-HFE scheme has much more equivalent keys than a basic HFE. This induces a structural weakness which can be exploited to adapt the KS attack against classical modifiers of multivariate schemes such as minus and embedding. Along the way, we discovered that the KS attack as initially described cannot be applied against HFE in characteristic 2. We have then strongly revised KS in characteristic 2 to make it work. In all cases, the cost of our attacks is related to the complexity of solving MinRank. Thanks to recent complexity results on this problem, we prove that our attack is polynomial in the degree of the extension field for all possible practical settings used in HFE and Multi-HFE. This makes then Multi-HFE less secure than basic HFE for equally-sized keys. As a proof of concept, we have been able to practically break the most conservative proposed parameters of multi-HFE in few days (256 bits security broken in 9 days).", "paper_title": "Cryptanalysis of HFE, multi-HFE and variants for odd and even characteristic", "paper_id": "WOS:000321264100001"}