{"auto_keywords": [{"score": 0.032570096974457875, "phrase": "kolmogorov-smirnov"}, {"score": 0.00481495049065317, "phrase": "particle_filtering"}, {"score": 0.004462663711734448, "phrase": "critical_procedure"}, {"score": 0.004255639740735269, "phrase": "particle_filter"}, {"score": 0.0040969285074699, "phrase": "resampling_process"}, {"score": 0.003603549914861701, "phrase": "identical_distribution"}, {"score": 0.0034690732089830045, "phrase": "general_principle"}, {"score": 0.003419943984098415, "phrase": "resampling_design"}, {"score": 0.0030078460113945136, "phrase": "sampling_variance"}, {"score": 0.002909342017421165, "phrase": "id_attribute"}, {"score": 0.002683304054823427, "phrase": "novel_resampling_scheme"}, {"score": 0.002632716358833918, "phrase": "optimal_id_attribute"}, {"score": 0.002570817338292482, "phrase": "minimum_sampling_variance"}, {"score": 0.0024051153560799335, "phrase": "sample_size_variation"}, {"score": 0.0021763278640166707, "phrase": "solid_guidelines"}, {"score": 0.0021251363422701446, "phrase": "existing_resampling_methods"}, {"score": 0.0021049977753042253, "phrase": "new_implementations"}], "paper_keywords": ["Particle filter", " Resampling", " Kullback-Leibler divergence", " Kolmogorov-Smirnov statistic"], "paper_abstract": "Resampling is a critical procedure that is of both theoretical and practical significance for efficient implementation of the particle filter. To gain an insight of the resampling process and the filter, this paper contributes in three further respects as a sequel to the tutorial (Li et al., 2015). First, identical distribution (ID) is established as a general principle for the resampling design, which requires the distribution of particles before and after resampling to be statistically identical. Three consistent metrics including the (symmetrical) Kullback-Leibler divergence, Kolmogorov-Smirnov statistic, and the sampling variance are introduced for assessment of the ID attribute of resampling, and a corresponding, qualitative ID analysis of representative resampling methods is given. Second, a novel resampling scheme that obtains the optimal ID attribute in the sense of minimum sampling variance is proposed. Third, more than a dozen typical resampling methods are compared via simulations in terms of sample size variation, sampling variance, computing speed, and estimation accuracy. These form a more comprehensive understanding of the algorithm, providing solid guidelines for either selection of existing resampling methods or new implementations.", "paper_title": "Resampling methods for particle filtering: identical distribution, a new method, and comparable study", "paper_id": "WOS:000364565200006"}