{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "statistical_significance_tests"}, {"score": 0.00864090363064965, "phrase": "research_assessments"}, {"score": 0.007779496990335158, "phrase": "citation_indicators"}, {"score": 0.004333283735537634, "phrase": "proper_normalization_procedures"}, {"score": 0.004260801279341166, "phrase": "opthof"}, {"score": 0.004225014437389304, "phrase": "leydesdorff"}, {"score": 0.004050514095922329, "phrase": "numerous_criticisms"}, {"score": 0.0037861265016041813, "phrase": "use_statistical_significance_tests"}, {"score": 0.0036296886647898094, "phrase": "numerous_problems"}, {"score": 0.003479692058963528, "phrase": "ritual_practice"}, {"score": 0.0033641551050434663, "phrase": "decision_making"}, {"score": 0.0032938942910948096, "phrase": "statistical_and_substantive_significance"}, {"score": 0.0030399874838260886, "phrase": "standard_errors"}, {"score": 0.003014422649429416, "phrase": "confidence_intervals"}, {"score": 0.0029890721584351684, "phrase": "inferential_purposes"}, {"score": 0.002770273247998903, "phrase": "critical_thinking"}, {"score": 0.0022522565004588113, "phrase": "empirical_sciences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Statistical significance tests", " Problems and misuse", " Research assessment"], "paper_abstract": "This article raises concerns about the advantages of using statistical significance tests in research assessments as has recently been suggested in the debate about proper normalization procedures for citation indicators by Opthof and Leydesdorff (2010). Statistical significance tests are highly controversial and numerous criticisms have been leveled against their use. Based on examples from articles by proponents of the use statistical significance tests in research assessments, we address some of the numerous problems with such tests. The issues specifically discussed are the ritual practice of such tests, their dichotomous application in decision making, the difference between statistical and substantive significance, the implausibility of most null hypotheses, the crucial assumption of randomness, as well as the utility of standard errors and confidence intervals for inferential purposes. We argue that applying statistical significance tests and mechanically adhering to their results are highly problematic and detrimental to critical thinking. We claim that the use of such tests do not provide any advantages in relation to deciding whether differences between citation indicators are important or not. On the contrary their use may be harmful. Like many other critics, we generally believe that statistical significance tests are over- and misused in the empirical sciences including scientometrics and we encourage a reform on these matters. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Caveats for using statistical significance tests in research assessments", "paper_id": "WOS:000313121300005"}