{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linkable_ring_signature"}, {"score": 0.04264184941590391, "phrase": "group_members"}, {"score": 0.03357054561083677, "phrase": "liu_et_al"}, {"score": 0.03262661215568323, "phrase": "signer_anonymity"}, {"score": 0.028395240214777767, "phrase": "enhanced_security_models"}, {"score": 0.02562883796208543, "phrase": "generic_approach"}, {"score": 0.0047547526023100665, "phrase": "ring_signature_scheme"}, {"score": 0.004695303774351139, "phrase": "group_signature_scheme"}, {"score": 0.004617187934074393, "phrase": "group_manager"}, {"score": 0.00446481608187988, "phrase": "signer's_identity"}, {"score": 0.004210114198411514, "phrase": "resulting_signatures"}, {"score": 0.0035148319209810128, "phrase": "diversion_group_members"}, {"score": 0.0026083473154448326, "phrase": "stronger_notions"}, {"score": 0.002532724486603177, "phrase": "original_ones"}, {"score": 0.002367983991444061, "phrase": "linkable_ring_signature_scheme"}, {"score": 0.0021678771715091492, "phrase": "different_sets"}, {"score": 0.0021049977753042253, "phrase": "domain_parameters"}], "paper_keywords": ["ring signature", " linkability", " anonymity"], "paper_abstract": "A ring signature scheme is a group signature scheme but with no group manager to setup a group or revoke a signer's identity. It allows members of a group to sign messages such that the resulting signatures do not reveal the identities of the group members who actually created these signatures (anonymity) and no one can tell if two signatures are created by the same signer (unlinkability). Furthermore, the formation of a group is spontaneous. Diversion group members (non-signers) can be totally unaware of being conscripted to the group. The notion of linkable ring signature, introduced by Liu et al. in 2004, also provides signer anonymity and spontaneity, but at the same time, allows anyone to determine whether two signatures have been issued by the same group member (linkability). In this paper, we propose a suite of enhanced security models and show that they capture stronger notions of signer anonymity and linkability than the original ones proposed by Liu et al. in 2004. We also propose a generic approach for constructing a linkable ring signature scheme. The generic approach leads us to the construction of two efficient polynomial-structured schemes and one type-restricted separable scheme. The separable scheme allows group members to have different sets of DL (discrete logarithm) domain parameters. All schemes are shown secure under the enhanced security models defined in this paper.", "paper_title": "Enhanced security models and a generic construction approach for linkable ring signature", "paper_id": "WOS:000243313900012"}