{"auto_keywords": [{"score": 0.0492166666181479, "phrase": "manet"}, {"score": 0.0479946982724845, "phrase": "high_data_packet_delivery_ratio"}, {"score": 0.03076163109204497, "phrase": "path_reliability"}, {"score": 0.030162210383722597, "phrase": "destination_node"}, {"score": 0.02637638115906272, "phrase": "pheromone_level"}, {"score": 0.00481495049065317, "phrase": "mobile_ad-hoc_network"}, {"score": 0.00476656577956677, "phrase": "dynamic_nature"}, {"score": 0.00436993953775267, "phrase": "routing_protocols"}, {"score": 0.00428251469851653, "phrase": "qos_requirements"}, {"score": 0.0041211772879042605, "phrase": "enhanced_version"}, {"score": 0.004096262249756685, "phrase": "well-known_dynamic_source_routing"}, {"score": 0.004030553103747131, "phrase": "ant_colony_optimization"}, {"score": 0.0038552163831994694, "phrase": "low_energy_consumption"}, {"score": 0.0037175064622262948, "phrase": "dsr"}, {"score": 0.0036577718549927734, "phrase": "existing_routes"}, {"score": 0.0035917999514273654, "phrase": "sender_node"}, {"score": 0.003562860954997457, "phrase": "route_request_control_packets"}, {"score": 0.0035341553431224118, "phrase": "req"}, {"score": 0.0034216141517309276, "phrase": "biological_ants"}, {"score": 0.0032726803888098784, "phrase": "food_source"}, {"score": 0.00308618686364101, "phrase": "ant_packets"}, {"score": 0.0027611172127393144, "phrase": "rep"}, {"score": 0.002738840778067369, "phrase": "route_reply"}, {"score": 0.0027003078338254404, "phrase": "route_information"}, {"score": 0.002683959670163002, "phrase": "corresponding_req"}, {"score": 0.0025879229737578186, "phrase": "different_routes"}, {"score": 0.002572253453952576, "phrase": "source_node"}, {"score": 0.0025207019985719, "phrase": "ant_colony_framework"}, {"score": 0.0025054384701875265, "phrase": "best_route"}, {"score": 0.0022733913568786642, "phrase": "highest_pheromone_count"}, {"score": 0.002250488635110544, "phrase": "data_packet_delivery"}, {"score": 0.0022233090465484935, "phrase": "novel_pheromone_decay_technique"}, {"score": 0.002196456988538831, "phrase": "simulation_results"}, {"score": 0.0021393824830166137, "phrase": "original_dsr_and_other_aco_based_routing_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["ACO routing", " DSR (Dynamic Source Routing)", " Mobile Ad-hoc Networks (MANETs)"], "paper_abstract": "Due to the dynamic nature of the Mobile Ad-hoc Network (MANET), routing in MANET becomes challenging especially when certain QoS requirements (like high data packet delivery ratio, low end to end delay, low routing overhead, and low energy consumption) are to be satisfied. Though a number of routing protocols have been proposed aiming to fulfill some of these QoS requirements but none of them can support all these requirements at the same time. In this paper, we propose an enhanced version of the well-known Dynamic Source Routing (DSR) scheme based on the Ant Colony Optimization (ACO) algorithm, which can produce a high data packet delivery ratio in low end to end delay with low routing overhead and low energy consumption. In our scheme, when a node needs to send a packet to another node, like DSR, it first checks the cache for existing routes. When no routes are known, the sender node locally broadcasts the Route Request control packets (called the Req.Ant packets) to find out the routes. This is similar to the biological ants initially spreading out in all directions from their colony in search of food. Now, the ants, after finding the food source, come back to the colony and deposit pheromone on their way so that other ants get informed about the paths. Similarly, in our routing scheme, the Req.Ant packets propagate through the network according to our novel route discovery scheme and gathers information of the route (i.e. total length of the route, congestion along the route and end to end path reliability of the route), till it reaches the destination node. When the destination node receives a Req.Ant packet, it sends back Rep.Ant (Route Reply control packet) which consists the route information of the corresponding Req.Ant to the source node through the same route. On receiving such Rep.Ant packets from different routes, the source node comes to know about those routes. Under the ant colony framework, the best route is selected by the pheromone level of the route. Similarly, here we calculate the pheromone level of a route based on the number of hops in the route, the congestion along the route and end to end path reliability of the route. The route with the highest pheromone count will be selected for data packet delivery. We also propose a novel pheromone decay technique for route maintenance. The simulation results show that our ACO based Enhanced DSR (E-Ant-DSR) outperforms the original DSR and other ACO based routing algorithms. (C) 2014 Published by Elsevier Inc.", "paper_title": "Ant colony optimization based enhanced dynamic source routing algorithm for mobile Ad-hoc network", "paper_id": "WOS:000346543000005"}