{"auto_keywords": [{"score": 0.04724318814250701, "phrase": "pseudorandom_generator"}, {"score": 0.04642276364616608, "phrase": "one-way_function"}, {"score": 0.038589809821624695, "phrase": "one-way_functions"}, {"score": 0.029742755444105966, "phrase": "exponentially_hard_one-way_function"}, {"score": 0.02802481494759594, "phrase": "resulting_pseudorandom_generator"}, {"score": 0.00481495049065317, "phrase": "exponentially_hard_one-way_functions"}, {"score": 0.0046703776684173665, "phrase": "hastad"}, {"score": 0.00464199172305237, "phrase": "impagliazzo"}, {"score": 0.0046138487809673995, "phrase": "levin"}, {"score": 0.004585719676035133, "phrase": "luby"}, {"score": 0.004407474941517865, "phrase": "plausibility_result"}, {"score": 0.0038774558460352667, "phrase": "main_reason"}, {"score": 0.003842122928042844, "phrase": "security_deterioration"}, {"score": 0.0034952803157219043, "phrase": "alternative_constructions"}, {"score": 0.003278230817258323, "phrase": "regular_function"}, {"score": 0.003169954314343514, "phrase": "different_type"}, {"score": 0.0029459306440711443, "phrase": "exponential_hardness"}, {"score": 0.0028924362743419523, "phrase": "original_construction"}, {"score": 0.0021049977753042253, "phrase": "regular_one-way_functions"}], "paper_keywords": [""], "paper_abstract": "In their seminal paper [HILL99], Hastad, Impagliazzo, Levin and Luby show that a pseudorandom generator can be constructed from any one-way function. This plausibility result is one of the most fundamental theorems in cryptography and helps shape our understanding of hardness and randomness in the field. Unfortunately, the reduction of [HILL99] is not nearly as efficient nor as security preserving as one may desire. The main reason for the security deterioration is the blowup to the size of the input. In particular, given one-way functions on n bits one obtains by [HILL99] pseudorandom generators with seed length O(n(8)). Alternative constructions that are far more efficient exist when assuming the one-way function is of a certain restricted structure (e.g. a permutations or a regular function). Recently, Holenstein [Hol06] addressed a different type of restriction. It is demonstrated in [Hol06] that the blowup in the construction may be reduced when considering one-way functions that have exponential hardness. This result generalizes the original construction of [HILL99] and obtains a generator from any exponentially hard one-way function with a blowup of O(n(5)), and even O(n(4) log(2)n) if the security of the resulting pseudorandom generator is allowed to have weaker (yet super-polynomial) security. In this work we show a construction of a pseudorandom generator from any exponentially hard one-way function with a blowup of only O(n(2)) and respectively, only O(n(4)log(2)n) if the security of the resulting pseudorandom generator is allowed to have only super-polynomial security. Our technique does not take the path of the original [HILL99] methodology, but rather follows by using the tools recently presented in [HHR05] (for the setting of regular one-way functions) and further developing them.", "paper_title": "Efficient pseudorandom generators from exponentially hard one-way functions", "paper_id": "WOS:000239475900020"}