{"auto_keywords": [{"score": 0.03443387576599945, "phrase": "retail_prices"}, {"score": 0.004814969084075142, "phrase": "stackelberg"}, {"score": 0.0047956792983833065, "phrase": "game-theoretic_model"}, {"score": 0.004303404058571052, "phrase": "product_marketing"}, {"score": 0.004117579919425373, "phrase": "information-asymmetric_vmi"}, {"score": 0.003876996400581697, "phrase": "single_product"}, {"score": 0.0037999551521987426, "phrase": "multiple_retailers"}, {"score": 0.003694652993546994, "phrase": "dispersed_and_independent_markets"}, {"score": 0.003606711217432998, "phrase": "demand_rate"}, {"score": 0.0035208552733545463, "phrase": "increasing_and_concave_function"}, {"score": 0.003478694092089197, "phrase": "advertising_investments"}, {"score": 0.003437036036889996, "phrase": "local_retailers"}, {"score": 0.003022465992278672, "phrase": "replenishment_policies"}, {"score": 0.0029862549873935496, "phrase": "manufacturer's_promotion_policies"}, {"score": 0.0029386456078004863, "phrase": "optimal_retail_prices"}, {"score": 0.002915125480162171, "phrase": "advertisement_investments"}, {"score": 0.0027890803075309926, "phrase": "stackelberg_game"}, {"score": 0.0025736694380861604, "phrase": "stackelberg_equilibrium"}, {"score": 0.00254282157860369, "phrase": "numerical_study"}, {"score": 0.002384422461262006, "phrase": "decision_variables"}, {"score": 0.0021049977753042253, "phrase": "raw_materials"}], "paper_keywords": ["Supply chain management", " Vendor managed inventory", " Stackelberg game theory"], "paper_abstract": "This paper discusses how a manufacturer and its retailers interact with each other in order to optimize their individual net profits by adjusting product marketing (advertising and pricing) and inventory policies in an information-asymmetric VMI (vendor managed inventory) supply chain. The manufacturer produces and supplies a single product at the same wholesale price to multiple retailers who then sell the product in dispersed and independent markets at retail prices. The demand rate in each market is an increasing and concave function of the advertising investments of both local retailers and the manufacturer, but a decreasing and convex function of the retail prices. The manufacturer determines its wholesale price, its advertising investment, replenishment cycles for the raw materials and finished product, and backorder quantity to maximize its profit. Retailers in turn consider the replenishment policies and the manufacturer's promotion policies and determine the optimal retail prices and advertisement investments to maximize their profits. This problem is modeled as a Stackelberg game where the manufacturer is the leader and retailers are followers. An algorithm has been proposed to search the Stackelberg equilibrium. A numerical study has been conducted to demonstrate how the algorithm works and to understand the influences of decision variables and/or parameters. Several research questions are examined, including under what circumstances the retailers and manufacturer should increase their advertising expenditures and/or reduce the retail prices and what actions should be taken if the prices of raw materials or their holding costs increase. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Stackelberg game-theoretic model for optimizing advertising, pricing and inventory policies in vendor managed inventory (VMI) production supply chains", "paper_id": "WOS:000267518000040"}