{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "immediate_information_space"}, {"score": 0.004724708238414131, "phrase": "methods-oriented_paper"}, {"score": 0.004578030096508602, "phrase": "specifically_photography"}, {"score": 0.00353426342004404, "phrase": "information_studies"}, {"score": 0.0034028574973016933, "phrase": "visual_and_photographic_techniques"}, {"score": 0.003235193484261443, "phrase": "visual_research"}, {"score": 0.002626317051411829, "phrase": "personal_information_management"}, {"score": 0.0025933275734892508, "phrase": "health_informatics"}, {"score": 0.002560751416355291, "phrase": "information_behavior"}, {"score": 0.002512650904797186, "phrase": "computer-supported_cooperative_work"}, {"score": 0.0023887436047824386, "phrase": "applying_photographic_techniques_..."}, {"score": 0.002256619934086924, "phrase": "research_design"}, {"score": 0.0021726139494880653, "phrase": "question-based_research_framework"}, {"score": 0.0021049977753042253, "phrase": "information_phenomena"}], "paper_keywords": [""], "paper_abstract": "This methods-oriented paper introduces visual methods and specifically photography to study immediate information space (Lee, 2003); that is, information-rich settings such as offices or homes. It draws upon the authors' firsthand ethnographic field experiences, a review of relevant theoretical and methodological literature, and an analysis of cases within information studies that have made use of visual and photographic techniques. To begin, the traditions of visual research within anthropology and sociology are traced and major epistemological, methodological, and disciplinary debates associated with visual scholarship are presented. Then, investigations of immediate information space that utilize photography are analyzed, including examples from the areas of personal information management, health informatics, information behavior, and computer-supported cooperative work. Moreover, a section entitled \"Applying Photographic Techniques ...\" supplies guidelines for employing photography in a research design, as well as a question-based research framework and tips for photographing information phenomena.", "paper_title": "Visual Approaches and Photography for the Study of Immediate Information Space", "paper_id": "WOS:000296453900010"}