{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "congestion_games"}, {"score": 0.027894374943608247, "phrase": "difference_utilities"}, {"score": 0.004706206193274572, "phrase": "bottom-up_utilities"}, {"score": 0.00459990650330792, "phrase": "perfect_environment"}, {"score": 0.004461882369408972, "phrase": "local_decisions"}, {"score": 0.004428025469002531, "phrase": "global_utilities"}, {"score": 0.004394424341776717, "phrase": "multiagent_systems"}, {"score": 0.00421410521089045, "phrase": "individual_action"}, {"score": 0.00394981748347167, "phrase": "desirable_or_undesirable_outcomes"}, {"score": 0.0036183419672924095, "phrase": "particular_set"}, {"score": 0.0035908627899097407, "phrase": "\"good\"_actions"}, {"score": 0.0035500334260484376, "phrase": "congestion_game"}, {"score": 0.0027495914857929584, "phrase": "poor_values"}, {"score": 0.002718301574682098, "phrase": "system_level_utility"}, {"score": 0.0025769130946296927, "phrase": "shaped_utility"}, {"score": 0.002470987929071079, "phrase": "global_behavior"}, {"score": 0.0024242869058849446, "phrase": "agents'_choices"}, {"score": 0.0022894012453842064, "phrase": "modified_version"}, {"score": 0.0021952683716334478, "phrase": "global_utility"}, {"score": 0.0021455612994325424, "phrase": "average_perform"}], "paper_keywords": ["Multiagent", " Reinforcement learning", " Coordination", " Congestion games"], "paper_abstract": "Congestion games offer a perfect environment in which to study the impact of local decisions on global utilities in multiagent systems. What is particularly interesting in such problems is that no individual action is intrinsically \"good\" or \"bad\" but that combinations of actions lead to desirable or undesirable outcomes. As a consequence, agents need to learn how to coordinate their actions with those of other agents, rather than learn a particular set of \"good\" actions. A congestion game can be studied from two different perspectives: (i) from the top down, where a global utility (e.g., a system-centric view of congestion) specifies the task to be achieved; or (ii) from the bottom up, where each agent has its own intrinsic utility it wants to maximize. In many cases, these two approaches are at odds with one another, where agents aiming to maximize their intrinsic utilities lead to poor values of a system level utility. In this paper we extend results on difference utilities, a form of shaped utility that enables multiagent learning in congested, noisy conditions, to study the global behavior that arises from the agents' choices in two types of congestion games. Our key result is that agents that aim to maximize a modified version of their own intrinsic utilities not only perform well in terms of the global utility, but also, on average perform better with respect to their own original utilities. In addition, we show that difference utilities are robust to agents \"defecting\" and using their own intrinsic utilities, and that performance degrades gracefully with the number of defectors.", "paper_title": "Coordinating actions in congestion games: impact of top-down and bottom-up utilities", "paper_id": "WOS:000322521900004"}