{"auto_keywords": [{"score": 0.03918933187652932, "phrase": "different_meanings"}, {"score": 0.034887398305923065, "phrase": "input_keywords"}, {"score": 0.00481495049065317, "phrase": "semantic_techniques"}, {"score": 0.00476697427418509, "phrase": "access_web_data"}, {"score": 0.004602773636967002, "phrase": "different_keyword-based_web_search_engines"}, {"score": 0.004040688646993609, "phrase": "search_engine"}, {"score": 0.003511613254403125, "phrase": "relevant_information"}, {"score": 0.003356675879109443, "phrase": "user-intended_meanings"}, {"score": 0.0029909851863915283, "phrase": "semantics_techniques"}, {"score": 0.002873331232538783, "phrase": "traditional_search_engine"}, {"score": 0.002447101794397243, "phrase": "possible_categories"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Semantic search", " Ontologies", " Categorization", " Disambiguation", " Semantic annotation"], "paper_abstract": "Nowadays, people frequently use different keyword-based web search engines to find the information they need on the web. However, many words are polysemous and, when these words are used to query a search engine, its output usually includes links to web pages referring to their different meanings. Besides, results with different meanings are mixed up, which makes the task of finding the relevant information difficult for the users, especially if the user-intended meanings behind the input keywords are not among the most popular on the web. In this paper, we propose a set of semantics techniques to group the results provided by a traditional search engine into categories defined by the different meanings of the input keywords. Differently from other proposals, our method considers the knowledge provided by ontologies available on the web in order to dynamically define the possible categories. Thus, it is independent of the sources providing the results that must be grouped. Our experimental results show the interest of the proposal. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Using semantic techniques to access web data", "paper_id": "WOS:000285366700002"}