{"auto_keywords": [{"score": 0.032910724397084354, "phrase": "query_complexity"}, {"score": 0.00481495049065317, "phrase": "graph_isomorphism"}, {"score": 0.003820144626025562, "phrase": "adjacency_matrix"}, {"score": 0.003511613254403125, "phrase": "one-sided_and_two-sided_error_testers"}, {"score": 0.003306559295382181, "phrase": "second_setting"}, {"score": 0.003085460307255466, "phrase": "best_one-sided_error_testing_algorithm"}, {"score": 0.002686509402739493, "phrase": "polylogarithmic_factors"}, {"score": 0.0026623547595573953, "phrase": "upper_bounds"}, {"score": 0.0026304851706393413, "phrase": "two-sided_error_testers"}, {"score": 0.002560162916190598, "phrase": "best_tester"}, {"score": 0.002130514432266586, "phrase": "adaptive_testers"}, {"score": 0.0021049977753042253, "phrase": "nonadaptive_ones"}], "paper_keywords": ["property testing", " graph isomorphism", " approximation"], "paper_abstract": "Two graphs G and H on n vertices are epsilon-far from being isomorphic if at least epsilon(n2) edges must be added or removed from E(G) in order to make G and H isomorphic. In this paper we deal with the question of how many queries are required to distinguish between the case that two graphs are isomorphic and the case that they are epsilon-far from being isomorphic. A query is defined as probing the adjacency matrix of any one of the two graphs, i.e., asking if a pair of vertices forms an edge of the graph or not. We investigate both one-sided and two-sided error testers under two possible settings: The first setting is where both graphs need to be queried, and the second setting is where one of the graphs is fully known to the algorithm in advance. We prove that the query complexity of the best one-sided error testing algorithm is (Theta) over tilde (n(3/2)) if both graphs need to be queried, and that it is (Theta) over tilde (n) if one of the graphs is known in advance (where the (Theta) over tilde notation hides polylogarithmic factors in the upper bounds). For two-sided error testers, we prove that the query complexity of the best tester is (Theta) over tilde(root n) when one of the graphs is known in advance, and we show that the query complexity lies between Omega(n) and (O) over tilde (n(5/4)) if both G and H need to be queried. All of our algorithms are additionally nonadaptive, while all of our lower bounds apply for adaptive testers as well as nonadaptive ones.", "paper_title": "Testing graph isomorphism", "paper_id": "WOS:000256452600008"}