{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "musculoskeletal_modelling"}, {"score": 0.004736666296080189, "phrase": "upper_limb"}, {"score": 0.0047057084749407485, "phrase": "musculoskeletal_models"}, {"score": 0.004614038128321949, "phrase": "internal_loading"}, {"score": 0.004568871736067739, "phrase": "human_skeleton"}, {"score": 0.004392565073466714, "phrase": "external_measurements"}, {"score": 0.00433531459712787, "phrase": "external_forces"}, {"score": 0.004236908273106904, "phrase": "upper_extremity"}, {"score": 0.00406001734835979, "phrase": "basic_shoulder_biomechanics"}, {"score": 0.004007083686875716, "phrase": "preoperative_planning"}, {"score": 0.003378385493203297, "phrase": "structural_adaptation"}, {"score": 0.003356275163203055, "phrase": "functional_outcome"}, {"score": 0.003269266730193333, "phrase": "tendon_transfer"}, {"score": 0.0032372213689015844, "phrase": "recent_studies"}, {"score": 0.0030715271045670504, "phrase": "cadaver_studies"}, {"score": 0.0028762499230524812, "phrase": "model's_geometry"}, {"score": 0.0028016507334576216, "phrase": "musculotendon_properties"}, {"score": 0.0025977542995083624, "phrase": "model's_structure"}, {"score": 0.0025055391159787134, "phrase": "considerable_effort"}, {"score": 0.0023003498123420237, "phrase": "current_models"}, {"score": 0.0022777800735119405, "phrase": "current_trend"}, {"score": 0.0021049977753042253, "phrase": "existing_models"}], "paper_keywords": ["Musculoskeletal models", " Clinical applications", " Subject-specific", " Shoulder biomechanics"], "paper_abstract": "Musculoskeletal models have been developed to estimate internal loading on the human skeleton, which cannot directly be measured in vivo, from external measurements like kinematics and external forces. Such models of the shoulder and upper extremity have been used for a variety of purposes, ranging from understanding basic shoulder biomechanics to assisting in preoperative planning. In this review, we provide an overview of the most commonly used large-scale shoulder and upper extremity models and categorise the applications of these models according to the type of questions their users aimed to answer. We found that the most explored feature of a model is the possibility to predict the effect of a structural adaptation on functional outcome, for instance, to simulate a tendon transfer preoperatively. Recent studies have focused on minimising the mismatch in morphology between the model, often derived from cadaver studies, and the subject that is analysed. However, only a subset of the parameters that describe the model's geometry and, perhaps most importantly, the musculotendon properties can be obtained in vivo. Because most parameters are somehow interrelated, the others should be scaled to prevent inconsistencies in the model's structure, but it is not known exactly how. Although considerable effort is put into adding complexity to models, for example, by making them subject-specific, we have found little evidence of their superiority over current models. The current trend in development towards individualised, more complex models needs to be justified by demonstrating their ability to answer questions that cannot already be answered by existing models.", "paper_title": "Clinical applications of musculoskeletal modelling for the shoulder and upper limb", "paper_id": "WOS:000322739200001"}