{"auto_keywords": [{"score": 0.03998275230530839, "phrase": "hmlp_network"}, {"score": 0.024156632186461025, "phrase": "mrls_algorithm"}, {"score": 0.006723258477636886, "phrase": "convergence_rate"}, {"score": 0.004952528416454051, "phrase": "mrpe"}, {"score": 0.004766090327062509, "phrase": "hmlp"}, {"score": 0.004552255360140208, "phrase": "new_learning_algorithm"}, {"score": 0.004437613070853689, "phrase": "mrls"}, {"score": 0.0040482054312565895, "phrase": "rls"}, {"score": 0.003866443402315402, "phrase": "linear_connections"}, {"score": 0.0035269696779744266, "phrase": "forgetting_factor"}, {"score": 0.0033857878144822906, "phrase": "learning_rate"}, {"score": 0.003120099687922751, "phrase": "six_benchmark_data_sets"}, {"score": 0.0030569913145731408, "phrase": "uci_repository"}, {"score": 0.003010496595090984, "phrase": "classification_performance"}, {"score": 0.0026091594819333654, "phrase": "standard_rls_algorithm"}, {"score": 0.00240426758768164, "phrase": "rls_trained_mlp_network"}, {"score": 0.0022041312401435346, "phrase": "mean_square_error"}, {"score": 0.002105000283232273, "phrase": "elsevier"}], "paper_keywords": ["Pattern recognition", " Artificial Neural Network", " Modified Recursive Least Square", " Hybrid Multilayered Perceptron", " Multilayered Perceptron"], "paper_abstract": "In this paper, a new learning algorithm, called the Modified Recursive Least Square (MRLS), is introduced for the Hybrid Multilayered Perceptron (HMLP) network. Adopting the Recursive Least Square (RLS) algorithm as its basis, the MRLS algorithm differs from RLS in the way that the weight of the linear connections for the HMLP network is estimated. The convergence rate of the MRLS algorithm is further improved by varying the forgetting factor, optimizing the way the momentum and learning rate are assigned. To investigate its applicability, the MRLS algorithm is demonstrated on the HMLP network using six benchmark data sets obtained from the UCI repository. The classification performance of the HMLP network trained with the MRLS algorithm is compared with those of the HMLP network trained with the Modified Recursive Prediction Error (MRPE) algorithm and the MLP trained with the standard RLS algorithm as well as with other commonly adopted machine learning classifiers. The comparison results indicated that the proposed MRLS trained HMLP network provides significant improvement over RLS trained MLP network, MRPE trained HMLP network, and other machine learning classifiers in terms of accuracy, convergence rate and mean square error (MSE). (C) 2009 Elsevier B. V. All rights reserved.", "paper_title": "Modified Recursive Least Squares algorithm to train the Hybrid Multilayered Perceptron (HMLP) network", "paper_id": "WOS:000271061900021"}