{"auto_keywords": [{"score": 0.037591611266913565, "phrase": "faq_auto-categorizing_system"}, {"score": 0.006433864630082581, "phrase": "user_satisfaction_surveys"}, {"score": 0.00481495049065317, "phrase": "faq_automatic_classification_system"}, {"score": 0.004728122501822142, "phrase": "frequently_asked_questions"}, {"score": 0.004609175313390942, "phrase": "technical_support_centers"}, {"score": 0.004460609967916904, "phrase": "knowledge_database"}, {"score": 0.004364224683011796, "phrase": "similar_questions"}, {"score": 0.004162445117081609, "phrase": "human_judgment"}, {"score": 0.003969957613513855, "phrase": "auto-categorizing_system"}, {"score": 0.0038279459368975965, "phrase": "software-based_faqs"}, {"score": 0.0036775717816768133, "phrase": "system_development_methodology"}, {"score": 0.003611179715045633, "phrase": "domain_ontology"}, {"score": 0.00315561677959372, "phrase": "real_faqs"}, {"score": 0.0030986183831544487, "phrase": "company_s."}, {"score": 0.0030315744251354923, "phrase": "faq"}, {"score": 0.00293370839211022, "phrase": "customer_service_staff"}, {"score": 0.002757365657304833, "phrase": "original_faq_attributes"}, {"score": 0.002727362288104989, "phrase": "manual_adjustment"}, {"score": 0.002480602069295564, "phrase": "question_attributes"}, {"score": 0.002391739069644444, "phrase": "software_products"}, {"score": 0.0023657047082774286, "phrase": "faq_search_performance"}, {"score": 0.0022397131088479514, "phrase": "subject_company_s."}, {"score": 0.0021752783872387173, "phrase": "significantly_less_search_time"}, {"score": 0.0021515951441422082, "phrase": "original_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ontology", " Knowledge management", " FAQ", " User satisfaction"], "paper_abstract": "Many enterprises collect Frequently Asked Questions (FAQs) from their customer service departments or technical support centers and compile the questions and responses in a knowledge database to reuse the information when similar questions occur. However, the categorization of these FAQs is based on human judgment, which can result in inconsistencies. In this paper, an auto-categorizing system is designed and proposed to facilitate a more precise categorization of software-based FAQs for the case subject, S Company. This study applies the system development methodology. First, the domain ontology of an FAQ auto-categorizing system is devised, and categorizing methods and rules are developed with the intention that the system will generate categories automatically. Next, the FAQ auto-categorizing system is tested using a database based on the real FAQs of the study subject Company S. and the system reliability and FAQ searching performance are verified via interviews with the customer service staff and user satisfaction surveys. This study demonstrates that the FAQ auto-categorizing system can automatically generate categories that match the original FAQ attributes, but manual adjustment is still occasionally necessary to optimize the system and boost the accuracy of the categorization. The interviews and user satisfaction surveys show that categorizing according to question attributes is a more efficient method than the method used by the software products available for FAQ search performance. Although users are satisfied with both the FAQ auto-categorizing system and the original FAQ system used by subject Company S. this study discovers that the FAQ auto-categorizing system requires significantly less search time than the original system. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A study of the application of ontology to an FAQ automatic classification system", "paper_id": "WOS:000305597700010"}