{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "design_rationale"}, {"score": 0.008176536724640216, "phrase": "design_research"}, {"score": 0.0038186039088445524, "phrase": "significant_portion"}, {"score": 0.003540392285585644, "phrase": "empirical_studies"}, {"score": 0.0033832880647968328, "phrase": "simon"}, {"score": 0.002922705896608178, "phrase": "empirical_study"}, {"score": 0.0026420518944303716, "phrase": "interview_study"}, {"score": 0.0024125253170522816, "phrase": "integrated_framework"}, {"score": 0.0023762535034673017, "phrase": "affordances_design_rationale"}, {"score": 0.0022478501955483007, "phrase": "qualitative_data"}, {"score": 0.0021049977753042253, "phrase": "first-class_methodology"}], "paper_keywords": ["affordances", " design rationale", " design research", " design research methodology"], "paper_abstract": "Design rationale should be regarded both as a tool for the practice of design, and as a method to enable the science of design. Design rationale answers questions about why a given design takes the form that it does. Answers to these why questions represent a significant portion of the knowledge generated from design research. This knowledge, along with that from empirical studies of designs in use, contributes to what Simon called the sciences of the artificial. Most research on the nature and use of design rationale has been analytic or theoretical. In this article, we describe an empirical study of the roles that design rationale can play in the conduct of design research. We report results from an interview study with 16 design researchers investigating how they construe and carry out design as research. The results include an integrated framework of the affordances design rationale can contribute to design research. The framework and supporting qualitative data provide insight into how design rationale might be more effectively leveraged as a first-class methodology for research into the creation and use of artifacts.", "paper_title": "Scientific design rationale", "paper_id": "WOS:000259680500005"}