{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electronic_marketplaces"}, {"score": 0.04255511761868809, "phrase": "biased_listing_effects"}, {"score": 0.004704699244406775, "phrase": "on-line_hotel_distribution"}, {"score": 0.004388796812234033, "phrase": "normally_expected_ones"}, {"score": 0.0039694170761766226, "phrase": "on-line_hotel_distribution_platform"}, {"score": 0.0038634933357842302, "phrase": "real-life_booking_data"}, {"score": 0.0038189638340666936, "phrase": "hotel.de"}, {"score": 0.003660238551364534, "phrase": "europe"}, {"score": 0.003051887221639784, "phrase": "biased_listing"}, {"score": 0.002913483929932102, "phrase": "crowding-out_effect"}, {"score": 0.0028138046006772567, "phrase": "higher-value_contracts"}, {"score": 0.002707033618304716, "phrase": "strategic_options"}, {"score": 0.002675797331220082, "phrase": "market_parties"}, {"score": 0.0025842289219860795, "phrase": "biased_listing_practices"}, {"score": 0.002373339527491525, "phrase": "better_understanding"}, {"score": 0.0021796224306652326, "phrase": "wider_context"}, {"score": 0.0021049977753042253, "phrase": "information-rich_decision_situations"}], "paper_keywords": ["Biased listing", " cybermediaries", " e-marketplaces", " on-line hotel distribution", " page rank", " ranking effects", " re-intermediation", " search"], "paper_abstract": "Biased listing is the practice of listing items in electronic marketplaces according to criteria other than the normally expected ones (e.g., relevance or quality). This study investigates the existence, nature, and implications of biased listing effects using the case of an on-line hotel distribution platform. The study is based on real-life booking data provided by Hotel.de, the second-largest hotel-booking platform in Europe, which lists hotels according to the value of their contracts. The contribution of the study is threefold: (1) it reveals the existence of biased listing effects in an e-marketplace for products and services; (2) it explores the nature and functioning of biased listing as a combination of ranking and labeling effects, revealing a crowding-out effect that affects hotels that do not switch to higher-value contracts; (3) it discusses the implications and strategic options for the market parties. The study shows how market providers that engage in biased listing practices are able to exploit their gatekeeper position by making suppliers compete for listing positions on the platform. This research contributes to a better understanding of the role of e-marketplaces as gatekeepers between supply and demand and, at the same time, is part of a wider context of research on consumer decision-making in information-rich decision situations.", "paper_title": "Biased Listing in Electronic Marketplaces: Exploring Its Implications in On-Line Hotel Distribution", "paper_id": "WOS:000271051400003"}