{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "partial_words"}, {"score": 0.04408488692126887, "phrase": "unavoidable_sets"}, {"score": 0.004703149944841539, "phrase": "unavoidable_set"}, {"score": 0.004504850679320975, "phrase": "theoretical_computer_science"}, {"score": 0.0041653916552844535, "phrase": "extensive_study"}, {"score": 0.003806395038279074, "phrase": "finite_sequences"}, {"score": 0.003491894048789576, "phrase": "current_interest"}, {"score": 0.0034510635632071978, "phrase": "molecular_biology"}, {"score": 0.003424107910734022, "phrase": "data_communication"}, {"score": 0.0033840673522948592, "phrase": "dna_computing"}, {"score": 0.003056029284235528, "phrase": "full_words"}, {"score": 0.002881403688962202, "phrase": "small_cardinality"}, {"score": 0.0027705505273051007, "phrase": "affirmative_proof"}, {"score": 0.0027060907634889734, "phrase": "sufficient_condition"}, {"score": 0.002462867872567125, "phrase": "significant_number"}, {"score": 0.002312960805824996, "phrase": "binary_alphabet"}, {"score": 0.0022414566728770767, "phrase": "ternary_alphabet"}, {"score": 0.0021049977753042253, "phrase": "k-letter_alphabet"}], "paper_keywords": ["Combinatorics on words", " Partial words", " Unavoidable sets"], "paper_abstract": "The notion of an unavoidable set of words appears frequently in the fields of mathematics and theoretical computer science, in particular with its connection to the study of combinatorics on words. The theory of unavoidable sets has seen extensive study over the past twenty years. In this paper we extend the definition of unavoidable sets of words to unavoidable sets of partial words. Partial words, or finite sequences that may contain a number of \"do not know\" symbols or \"holes,\" appear naturally in several areas of current interest such as molecular biology, data communication, and DNA computing. We demonstrate the utility of the notion of unavoidability of sets of partial words by making use of it to identify several new classes of unavoidable sets of full words. Along the way we begin work on classifying the unavoidable sets of partial words of small cardinality. We pose a conjecture, and show that affirmative proof of this conjecture gives a sufficient condition for classifying all the unavoidable sets of partial words of size two. We give a result which makes the conjecture easy to verify for a significant number of cases. We characterize many forms of unavoidable sets of partial words of size three over a binary alphabet, and completely characterize such sets over a ternary alphabet. Finally, we extend our results to unavoidable sets of partial words of size k over a k-letter alphabet.", "paper_title": "Unavoidable Sets of Partial Words", "paper_id": "WOS:000266928500011"}