{"auto_keywords": [{"score": 0.03769201191873028, "phrase": "user_interaction"}, {"score": 0.024400507203676605, "phrase": "video_analysis"}, {"score": 0.00481495049065317, "phrase": "-more_approach"}, {"score": 0.004787116526591974, "phrase": "geovisualization_-_enhancing_knowledge_construction"}, {"score": 0.004704571777980556, "phrase": "'less-is-more'_concept"}, {"score": 0.004413846562278824, "phrase": "user-centered_design"}, {"score": 0.004287680323820891, "phrase": "simple_and_clear_design"}, {"score": 0.004238225125594194, "phrase": "successful_applications"}, {"score": 0.00421371094333215, "phrase": "improved_ease"}, {"score": 0.0040226133433241065, "phrase": "marked_increase"}, {"score": 0.003806866174028117, "phrase": "enthusiastic_advances"}, {"score": 0.0037195105792632937, "phrase": "significant_increase"}, {"score": 0.00353019387659895, "phrase": "traditional_gis_functions"}, {"score": 0.0033896121703560463, "phrase": "knowledge_construction_process"}, {"score": 0.0030092017034068666, "phrase": "disciplinary_backgrounds"}, {"score": 0.002831158147480665, "phrase": "geovisualization_application"}, {"score": 0.002806595775343074, "phrase": "specific_uses"}, {"score": 0.0027822459052173113, "phrase": "effective_development"}, {"score": 0.0027661298116867013, "phrase": "geographic_knowledge"}, {"score": 0.0027104531025934865, "phrase": "minimalistic_design_approach"}, {"score": 0.0026481898553135973, "phrase": "geographic_profiling_tool"}, {"score": 0.0026024303981224827, "phrase": "technological_advances"}, {"score": 0.002542642270762272, "phrase": "interaction_elements"}, {"score": 0.0025059724686541263, "phrase": "spatial_knowledge"}, {"score": 0.0024914526842494352, "phrase": "gis_experts"}, {"score": 0.0021049977753042253, "phrase": "-more_geovisualization"}], "paper_keywords": ["HCI", " geovisualization", " video analysis", " suburban geography"], "paper_abstract": "The 'less-is-more' concept in interface design for computer applications has recently gained ground. In this article, the concept is adopted for a user-centered design of geovisualization application. The premise is that using simple and clear design can lead to successful applications with improved ease of use. Over the last three decades, the development of GIS and geovisualization has seen a marked increase in the levels of interaction between the user, the system and the information. However, these enthusiastic advances in technology have not resulted in a significant increase in the number of users. This article suggests that types of user interaction should not simply emphasize traditional GIS functions such as zooming and panning but move towards interaction based on facilitating the knowledge construction process. Considerations are made for the complexity of the system, the task at hand and the skills and limitations of the users. These elements are particularly important when maps act as the mediators in collaboration with users across disciplinary backgrounds. In such cases, the emphasis on simplicity and usability becomes as important as functionality. In these situations a geovisualization application designed for specific uses can maximize effective development of geographic knowledge. In this article, a minimalistic design approach to geovisualization is adopted by creating a geographic profiling tool which shifts the emphasis from technological advances or interaction with the map to the interaction elements key to building the spatial knowledge of GIS experts and non-experts alike. To evaluate this notion of 'less-is-more geovisualization' the profiling tool is evaluated according to usability matrices: efficiency, effectiveness and learnability. How well the Suburban Profiler contributes to these elements is assessed by conducting a video analysis of the types and forms of user interaction available. The video analysis demonstrates the usefulness and usability of the Suburban Profiler, providing proof of concept for 'less-is-more geovisualization'.", "paper_title": "A less-is-more approach to geovisualization - enhancing knowledge construction across multidisciplinary teams", "paper_id": "WOS:000269605500006"}