{"auto_keywords": [{"score": 0.028086694908838937, "phrase": "multimedia_traffic"}, {"score": 0.015562696827785844, "phrase": "based_multi-hop_ad_hoc_wireless_networks"}, {"score": 0.009871816875332295, "phrase": "video_traffic"}, {"score": 0.008317752587816188, "phrase": "real-time_traffic"}, {"score": 0.008180106319636104, "phrase": "voice_traffic"}, {"score": 0.0060523796550605545, "phrase": "reap"}, {"score": 0.005706752133624275, "phrase": "txop"}, {"score": 0.005283397685902117, "phrase": "txop_interval"}, {"score": 0.00481495049065317, "phrase": "mac_qos"}, {"score": 0.004297468608441439, "phrase": "qos_support"}, {"score": 0.0042713650920965344, "phrase": "mac_layer"}, {"score": 0.004211069233133584, "phrase": "wireless_lans"}, {"score": 0.004160062142629554, "phrase": "access_points"}, {"score": 0.004101330997582832, "phrase": "ad_hoc_networks"}, {"score": 0.0038431888954930083, "phrase": "end-to-end_delay"}, {"score": 0.0035144693116921913, "phrase": "mac_queues"}, {"score": 0.0034020127818550484, "phrase": "hop_length_information"}, {"score": 0.0032532178436837367, "phrase": "heavy_loads"}, {"score": 0.003213775400946196, "phrase": "adaptive-txop"}, {"score": 0.0031619259916322797, "phrase": "transmission_opportunity"}, {"score": 0.003123586914786765, "phrase": "time_interval"}, {"score": 0.00297480957641907, "phrase": "channel_accesses"}, {"score": 0.0029507095528694452, "phrase": "large_video_frames"}, {"score": 0.0024421278676542454, "phrase": "multiple_receivers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["multimedia traffic", " QoS", " MAC", " ad hoc wireless networks", " 802.11e", " voice", " video"], "paper_abstract": "Ad hoc wireless networks with their widespread deployment, now need to support applications that generate multimedia and real-time traffic. Video, audio, real-time voice over IP, and other multimedia applications require the network to provide guarantees on the Quality of Service (QoS) of the connection. The 802.11e Medium Access Control (MAC) protocol was proposed with the aim of providing QoS support at the MAC layer. The 802.11e performs well in wireless LANs due to the presence of Access Points (APs), but in ad hoc networks, especially multi-hop ones, it is still incapable of supporting multimedia traffic. One of the most important QoS parameters for multimedia and real-time traffic is delay. Our primary goal is to reduce the end-to-end delay, thereby improving the Packet Delivery Ratio of multimedia traffic, that is, the proportion of packets that reach the destination within the deadline, in 802.11e based multi-hop ad hoc wireless networks. Our contribution is threefold: first we propose dynamic ReAllocative Priority (ReAP) scheme, wherein the priorities of packets in the MAC queues are not fixed, but keep changing dynamically. We use the laxity and the hop length information to decide the priority of the packet. ReAP improves the PDR by over 28% in comparison with 802.11e, especially under heavy loads. Second, we introduce Adaptive-TXOP (A-TXOP), where transmission opportunity (TXOP) is the time interval during which a node has the right to initiate transmissions. This scheme reduces the delay of video traffic by reducing the number of channel accesses required to transmit large video frames. It involves modifying the TXOP interval dynamically based on the packets in the queue, so that fragments of the same packet are sent in the same TXOP interval. A-TXOP is implemented over ReAP to further improve the performance of video traffic. ReAP with A-TXOP helps in reducing the delay of video traffic by over 27% and further improves the quality of video in comparison with ReAP without A-TXOP. Finally, we have TXOP-sharing, which is aimed at reducing the delay of voice traffic. It involves using the TXOP to transmit to multiple receivers, in order to utilize the TXOP interval fully. It reduces the number of contentions to the channel and thereby reduces the delay of voice traffic by over 14%. A-TXOP is implemented over ReAP to further improve the performance of voice traffic. The three schemes (ReAP, A-TXOP, and TXOP-sharing) work together to improve the performance of multimedia traffic in 802.11e based multi-hop ad hoc wireless networks. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Providing MAC QoS for multimedia traffic in 802.11e based multi-hop ad hoc wireless networks", "paper_id": "WOS:000241715500010"}