{"auto_keywords": [{"score": 0.04460179095066608, "phrase": "interaction_semantics"}, {"score": 0.00481495049065317, "phrase": "bip_component_framework"}, {"score": 0.004683618147754759, "phrase": "synchronization_constraints"}, {"score": 0.004603352344461032, "phrase": "component-based_systems"}, {"score": 0.004340553321613485, "phrase": "previous_paper"}, {"score": 0.0037535816047183845, "phrase": "exponentially_complex_models"}, {"score": 0.0036510928952124522, "phrase": "efficient_implementation"}, {"score": 0.0035884582625234297, "phrase": "induced_semantic_equivalence"}, {"score": 0.0033951334049808733, "phrase": "new_causal_semantics"}, {"score": 0.0032569835069392924, "phrase": "explicitly_models"}, {"score": 0.003234509549830177, "phrase": "causal_dependency_relation"}, {"score": 0.0027296938800704484, "phrase": "successor_relation"}, {"score": 0.0027108484507501907, "phrase": "causal_dependency"}, {"score": 0.0026185499482623, "phrase": "global_interaction"}, {"score": 0.0025293860389728516, "phrase": "causal_semantics"}, {"score": 0.00246877952076635, "phrase": "semantic_equivalence"}, {"score": 0.0022020103573658035, "phrase": "causal_interaction_trees"}, {"score": 0.0021867999937268084, "phrase": "boolean_representation"}, {"score": 0.0021566930572796935, "phrase": "causal_rules"}], "paper_keywords": ["BIP", " Component", " Connectors", " Connector synthesis", " Interaction", " Causal semantics", " Causal interaction trees"], "paper_abstract": "The Algebra of Connectors AC(P) is used to model structured interactions in the BIP component framework. Its terms are connectors, relations describing synchronization constraints between the ports of component-based systems. Connectors are structured combinations of two basic synchronization protocols between ports: rendezvous and broadcast. In a previous paper, we have studied interaction semantics for AC(P) which defines the meaning of connectors as sets of interactions. This semantics reduces broadcasts into the set of their possible interactions and thus blurs the distinction between rendezvous and broadcast. It leads to exponentially complex models that cannot be a basis for efficient implementation. Furthermore, the induced semantic equivalence is not a congruence. For a subset of AC(P), we propose a new causal semantics that does not reduce broadcast into a set of rendezvous and explicitly models the causal dependency relation between ports. The Algebra of Causal Interaction Trees T (P) formalizes this subset. It is the set of the terms generated from interactions on the set of ports P, by using two operators: a causality operator and a parallel composition operator. Terms are sets of trees where the successor relation represents causal dependency between interactions: an interaction can participate in a global interaction only if its father participates too. We show that causal semantics is consistent with interaction semantics; the semantic equivalence on T (P) is a congruence. Furthermore, it defines an isomorphism between T (P) and a subset of AC(P). Finally, we define for causal interaction trees a boolean representation in terms of causal rules. This representation is used for their manipulation and simplification as well as for synthesizing connectors.", "paper_title": "Causal semantics for the algebra of connectors", "paper_id": "WOS:000278402900005"}