{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "artistic_contexts"}, {"score": 0.004764220976404241, "phrase": "interesting_challenges"}, {"score": 0.004400329132129292, "phrase": "artistic_intent"}, {"score": 0.004129248271757936, "phrase": "development_practice"}, {"score": 0.0036553070575015344, "phrase": "development_process"}, {"score": 0.0035786000713014625, "phrase": "iterative_design"}, {"score": 0.0035408501923902477, "phrase": "participatory_design"}, {"score": 0.0031342307827666675, "phrase": "heavy_use"}, {"score": 0.003101153870424188, "phrase": "different_types"}, {"score": 0.0029253546782349875, "phrase": "development_cases"}, {"score": 0.0028487656293168795, "phrase": "single_artifact"}, {"score": 0.002328434471939886, "phrase": "artistic_vision"}, {"score": 0.0021049977753042253, "phrase": "new_role"}], "paper_keywords": [""], "paper_abstract": "The use of technology in artistic contexts presents interesting challenges regarding the processes in which engineers, artists and performers work together. The artistic intent and goals of the participants are relevant both when shaping the development practice, and in defining and refining the role of technology in practice. In this paper we present strategies for structuring the development process, based on iterative design and participatory design. The concepts are described in theory and examples are given of how they have been successfully applied. The cases make heavy use of different types of prototyping and this practice is also discussed. The development cases all relate to a single artifact, a gestural voice processing instrument called The Throat. This artifact has been in use since it was developed, and from that experience, three cases are presented. The focus of these cases is on how artistic vision through practice can recontextualize technology, and, without rebuilding it, redefine it and give it a new role to play.", "paper_title": "Artistically Directed Prototyping in Development and in Practice", "paper_id": "WOS:000312443400008"}