{"auto_keywords": [{"score": 0.04151111040011756, "phrase": "high-quality_knowledge_resource"}, {"score": 0.00481495049065317, "phrase": "elitist_jerks"}, {"score": 0.0047370749839861165, "phrase": "high-quality_knowledge_resources"}, {"score": 0.004610058444728656, "phrase": "online-community_management"}, {"score": 0.0038527044625533574, "phrase": "external_task_performance"}, {"score": 0.0036288825833675127, "phrase": "moderation_practices"}, {"score": 0.0033810134162565843, "phrase": "useable_knowledge_resource"}, {"score": 0.003290237137651949, "phrase": "inclusive_conversation"}, {"score": 0.002999386721353559, "phrase": "case_study"}, {"score": 0.002966900048034132, "phrase": "online_gamingelitist_jerksin"}, {"score": 0.002855934865505357, "phrase": "conversational_medium"}, {"score": 0.002719325177422626, "phrase": "open_censorship"}, {"score": 0.002646267286675984, "phrase": "content_analysis"}, {"score": 0.0026175952455594277, "phrase": "moderator_comments"}, {"score": 0.0025892330566358503, "phrase": "censored_messages"}, {"score": 0.0024788167298469455, "phrase": "contributor_mistakes"}, {"score": 0.0024122047542536203, "phrase": "moderator_actions"}, {"score": 0.0021049977753042253, "phrase": "resource_quality"}], "paper_keywords": ["knowledge management", " virtual communities"], "paper_abstract": "Online-community management is commonly presented as the facilitation of conversation and contributions, especially converting readers to contributors. However, the goal of many discussion communities is to produce a high-quality knowledge resource, whether to improve external task performance or to increase reputation and site traffic. What do moderation practices look like when the community is focused on the creation of a useable knowledge resource rather than facilitating an inclusive conversation? Under what conditions is this style of moderation likely to be successful? We present a case study from online gamingElitist Jerksin which aggressive moderation is used to transform a conversational medium into a high-quality knowledge resource, using the strategy of open censorship. We present a content analysis of moderator comments regarding censored messages. Our analysis revealed differences in types of contributor mistakes and the severity of moderator actions: infractions that interfered with both conversation and resource quality were punished harshly, whereas a set of infractions that supported conversation but undermined resource quality were more respectfully removed. We describe a set of conditions under which moderators should intervene in the conversion of conversation to knowledge resource rather than the conversion of lurkers to contributors.", "paper_title": "Learning from Elitist Jerks: Creating high-quality knowledge resources from ongoing conversations", "paper_id": "WOS:000363213000008"}