{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "presentation_mode"}, {"score": 0.04204898741255952, "phrase": "single_action_units"}, {"score": 0.04065857464171615, "phrase": "full-face_expressions"}, {"score": 0.01187352184656422, "phrase": "single_actions"}, {"score": 0.004667833113864304, "phrase": "facial_actions"}, {"score": 0.004352974291381376, "phrase": "facial_action_units"}, {"score": 0.004236321075918639, "phrase": "meaning_decoding"}, {"score": 0.004171065188039856, "phrase": "full-face_synthesized_expressions"}, {"score": 0.004043541331944951, "phrase": "adequate_representation"}, {"score": 0.0032406665327678616, "phrase": "hybrid_approach"}, {"score": 0.0032155857567170696, "phrase": "animation_synthesis"}, {"score": 0.003178326919668771, "phrase": "data-driven_and_procedural_animations"}, {"score": 0.003093054709625219, "phrase": "bump_mapping_method"}, {"score": 0.002963640433319524, "phrase": "full-face_movements"}, {"score": 0.0027102313244646934, "phrase": "full-face_context-free_expressions"}, {"score": 0.0023380300046435187, "phrase": "single_action_unit"}, {"score": 0.00227525089435209, "phrase": "perceived_meaning"}, {"score": 0.0021463304704817873, "phrase": "successful_communication"}, {"score": 0.0021049977753042253, "phrase": "virtual_characters"}], "paper_keywords": ["Human Factors", " Facial expressions", " action units", " wrinkles", " laughter"], "paper_abstract": "This article focuses on the identification and perception of facial action units displayed alone as well as the meaning decoding and perception of full-face synthesized expressions of laughter. We argue that the adequate representation of single action units is important in the decoding and perception of full-face expressions. In particular, we focus on three factors that may influence the identification and perception of single actions and full-face expressions: their presentation mode (static vs. dynamic), their intensity, and the presence of wrinkles. For the purpose of this study, we used a hybrid approach for animation synthesis that combines data-driven and procedural animations with synthesized wrinkles generated using a bump mapping method. Using such animation technique, we created animations of single action units and full-face movements of two virtual characters. Next, we conducted two studies to evaluate the role of presentation mode, intensity, and wrinkles in single actions and full-face context-free expressions. Our evaluation results show that intensity and presentation mode influence (1) the identification of single action units and (2) the perceived quality of the animation. At the same time, wrinkles (3) are useful in the identification of a single action unit and (4) influence the perceived meaning attached to the animation of full-face expressions. Thus, all factors are important for successful communication of expressions displayed by virtual characters.", "paper_title": "The Effect of Wrinkles, Presentation Mode, and Intensity on the Perception of Facial Actions and Full-Face Expressions of Laughter", "paper_id": "WOS:000353528600002"}