{"auto_keywords": [{"score": 0.050077592516358314, "phrase": "social_networks"}, {"score": 0.049560544234556164, "phrase": "user_behaviors"}, {"score": 0.049048558797436546, "phrase": "community-driven_knowledge_services"}, {"score": 0.046081391722127746, "phrase": "yahoo"}, {"score": 0.03435573776432697, "phrase": "answers_ties"}, {"score": 0.030262980064500067, "phrase": "co-answering_ties"}, {"score": 0.02553436413140574, "phrase": "answering_ties"}, {"score": 0.004318881178805575, "phrase": "naver_knowledge"}, {"score": 0.003958937342925219, "phrase": "cks_environments"}, {"score": 0.003589602322126282, "phrase": "social_ties"}, {"score": 0.0030989899982042236, "phrase": "structural_and_relational_attributes"}, {"score": 0.0028096544129939277, "phrase": "getting_answers_ties"}, {"score": 0.0026175952455594277, "phrase": "naver_knowledge_in"}, {"score": 0.0025334249463305875, "phrase": "research_model"}, {"score": 0.0024923577071656014, "phrase": "analysis_results"}, {"score": 0.002284290601837099, "phrase": "average_strength"}, {"score": 0.002210814150677161, "phrase": "insignificant_effect"}], "paper_keywords": [""], "paper_abstract": "Given the prevalence of community-driven knowledge services (CKSs) such as Yahoo! Answers and Naver Knowledge In, it has become important to understand the effect of social networks on user behaviors in CKS environments. CKSs allow various relationships between askers and answerers as well as among answerers. This study classifies social ties in CKSs into three kinds of ties: answering ties, co-answering ties, and getting answers ties. This study examines the influence of the structural and relational attributes of social networks on the quality of answers at CKSs for answering ties, co-answering ties, and getting answers ties. Data collected from the top-100 heavy users of Yahoo! Answers and of Naver Knowledge In are used to test the research model. The analysis results show that the centrality of the answering ties significantly influences the quality of answers while the average strength of the answering ties has an insignificant effect on the quality of answers. Interestingly, both the centrality and average strength of the co-answering ties negatively affect the quality of answers. Moreover, the centrality and average strength of getting answers ties do not significantly influence the quality of answers.", "paper_title": "Understanding the Effect of Social Networks on User Behaviors in Community-Driven Knowledge Services", "paper_id": "WOS:000291122800006"}