{"auto_keywords": [{"score": 0.03373759524182068, "phrase": "logistic_testing-effort_function"}, {"score": 0.02746750479951453, "phrase": "proposed_models"}, {"score": 0.00481495049065317, "phrase": "testing-effort_dependent_software_reliability_growth_models"}, {"score": 0.004643839937761046, "phrase": "software_reliability_growth_models"}, {"score": 0.0038749521906474593, "phrase": "research_work"}, {"score": 0.0037825134619339537, "phrase": "delayed_s-shaped_model"}, {"score": 0.0036700484729006136, "phrase": "software_failure_data"}, {"score": 0.0035181731203867456, "phrase": "fault_detection"}, {"score": 0.002952900365829518, "phrase": "software_testing"}, {"score": 0.0021049977753042253, "phrase": "better_predictions"}], "paper_keywords": ["delayed S-shaped model", " imperfect debugging", " non-homogeneous Poisson process", " software reliability growth models", " testing-effort function"], "paper_abstract": "Over the last several decades, many Software Reliability Growth Models (SRGM) have been developed to greatly facilitate engineers and managers in tracking and measuring the growth of reliability as software is being improved. However, some research work indicates that the delayed S-shaped model may not fit the software failure data well when the testing-effort spent on fault detection is not a constant. Thus, in this paper, we first review the logistic testing-effort function that can be used to describe the amount of testing-effort spent on software testing. We describe how to incorporate the logistic testing-effort function into both exponential-type, and S-shaped software reliability models. The proposed models are also discussed under both ideal, and imperfect debugging conditions. Results from applying the proposed models to two real data sets are discussed, and compared with other traditional SRGM to show that the proposed models can give better predictions, and that the logistic testing-effort function is suitable for incorporating directly into both exponential-type, and S-shaped software reliability models.", "paper_title": "An assessment of testing-effort dependent software reliability growth models", "paper_id": "WOS:000247107100003"}