{"auto_keywords": [{"score": 0.04950097558699653, "phrase": "medial_surfaces"}, {"score": 0.004263972370406983, "phrase": "qualitative_abstraction"}, {"score": 0.004161553532799662, "phrase": "directed_acyclic_graph"}, {"score": 0.003384262486955773, "phrase": "geometric_information"}, {"score": 0.003223494720348768, "phrase": "eigenvalue_labeling"}, {"score": 0.00316518932828897, "phrase": "adjacency_matrix"}, {"score": 0.0029602552900111407, "phrase": "comparative_retrieval_results"}, {"score": 0.0028715299874549245, "phrase": "shape_distributions"}, {"score": 0.0025423706961391034, "phrase": "mcgill_shape_benchmark"}, {"score": 0.0022101055924375725, "phrase": "superior_retrieval_performance"}], "paper_keywords": ["3-D model retrieval", " matching and indexing", " average outward flux-based skeletons", " medial surfaces", " graph spectra"], "paper_abstract": "We consider the use of medial surfaces to represent symmetries of 3-D objects. This allows for a qualitative abstraction based on a directed acyclic graph of components and also a degree of invariance to a variety of transformations including the articulation of parts. We demonstrate the use of this representation for 3-D object model retrieval. Our formulation uses the geometric information associated with each node along with an eigenvalue labeling of the adjacency matrix of the subgraph rooted at that node. We present comparative retrieval results against the techniques of shape distributions (Osada et al.) and harmonic spheres (Kazhdan et al.) on 425 models from the McGill Shape Benchmark, representing 19 object classes. For objects with articulating parts, the precision vs recall curves using our method are consistently above and to the right of those of the other two techniques, demonstrating superior retrieval performance. For objects that are rigid, our method gives results that compare favorably with these methods.", "paper_title": "Retrieving articulated 3-D models using medial surfaces", "paper_id": "WOS:000256261500005"}