{"auto_keywords": [{"score": 0.04865678212430773, "phrase": "effective_binding"}, {"score": 0.013992365524979768, "phrase": "weak_inhibitor"}, {"score": 0.00481495049065317, "phrase": "computational_studies_of_darunavir"}, {"score": 0.004560568143816105, "phrase": "human_immunodeficiency_virus_type"}, {"score": 0.004425072111844721, "phrase": "main_targets"}, {"score": 0.004398457709182882, "phrase": "aids_therapy"}, {"score": 0.004319566932528865, "phrase": "potent_drug_darunavir"}, {"score": 0.004078923069461593, "phrase": "molecular_dynamics"}, {"score": 0.003993689187426141, "phrase": "poisson-boltzmann"}, {"score": 0.0035609154384221567, "phrase": "closed_and_semiopen_states"}, {"score": 0.0035288105310344463, "phrase": "water_molecule"}, {"score": 0.0034135407979996673, "phrase": "hydrogen_bonding"}, {"score": 0.003342149037457679, "phrase": "stable_structure"}, {"score": 0.0031845067058084583, "phrase": "van_der_waals_interactions"}, {"score": 0.0031273209718167072, "phrase": "permanent_fullerene_entrapment"}, {"score": 0.0029978373992477028, "phrase": "enhanced_electrostatic_interactions"}, {"score": 0.0029262611715147454, "phrase": "crucial_component"}, {"score": 0.002899861600151726, "phrase": "binding_energy"}, {"score": 0.0028736995088566083, "phrase": "alternative_pathway"}, {"score": 0.0028477727736832283, "phrase": "usual_way"}, {"score": 0.0026889014020738578, "phrase": "binding_cavity"}, {"score": 0.0025931481164332163, "phrase": "neighboring_loop"}, {"score": 0.0024857262835071337, "phrase": "flap_opening"}, {"score": 0.0024707470443416793, "phrase": "darunavir"}, {"score": 0.0023971907868181016, "phrase": "membrane_barrier"}, {"score": 0.0022840180582947302, "phrase": "dmpc_bilayer"}, {"score": 0.0021049977753042253, "phrase": "water_molecules"}], "paper_keywords": [""], "paper_abstract": "Human immunodeficiency virus type 1 protease (HIV-1 PR) is one of the main targets toward AIDS therapy. We have selected the potent drug darunavir and a weak inhibitor (fullerene analog) as HIV-1 PR substrates to compare protease's conformational features upon binding. Molecular dynamics (MD), molecular mechanics Poisson-Boltzmann surface area (MM-PBSA), and quantum-mechanical (QM) calculations indicated the importance of the stability of HIV-1 PR flaps toward effective binding: a weak inhibitor may induce flexibility to the flaps, which convert between closed and semiopen states. A water molecule in the darunavir-HIV-1 PR complex bridged the two flap tips of the protease through hydrogen bonding (HB) interactions in a stable structure, a feature that was not observed for the fullerene-HIV-1 PR complex. Additionally, despite that van der Waals interactions and nonpolar contribution to solvation favored permanent fullerene entrapment into the cavity, these interactions alone were not sufficient for effective binding; enhanced electrostatic interactions as observed in the darunavir-complex were the crucial component of the binding energy. An alternative pathway to the usual way of a ligand to access the cavity was also observed for both compounds. Each ligand entered the binding cavity through an opening between the one flap of the protease and a neighboring loop. This suggested that access to the cavity is not necessarily regulated by flap opening. Darunavir exerts its biological action inside the cell, after crossing the membrane barrier. Thus, we also initiated a study on the interactions between darunavir and the DMPC bilayer to reveal that the drug was accommodated inside the bilayer in conformations that resembled its structure into HIV-1 PR, being stabilized via HBs with the lipids and water molecules.", "paper_title": "Computational Studies of Darunavir into HIV-1 Protease and DMPC Bilayer: Necessary Conditions for Effective Binding and the Role of the Flaps", "paper_id": "WOS:000305588100010"}