{"auto_keywords": [{"score": 0.034243830874721354, "phrase": "structured_data"}, {"score": 0.014551594751458393, "phrase": "collaborative_data_management"}, {"score": 0.004749106104067268, "phrase": "general-purpose_platform_for_data_curation"}, {"score": 0.004577869668211548, "phrase": "complementary_strengths"}, {"score": 0.004352411290383643, "phrase": "relational_databases"}, {"score": 0.004138010495069077, "phrase": "query_optimization"}, {"score": 0.0041001740903338834, "phrase": "concurrency_control"}, {"score": 0.003459191419478298, "phrase": "built-in_support"}, {"score": 0.002878140062594849, "phrase": "general-purpose_platform"}, {"score": 0.0028127163745564777, "phrase": "dbwiki."}, {"score": 0.0027361626349903744, "phrase": "collaborative_creation"}, {"score": 0.0025892330566358503, "phrase": "database_technology"}, {"score": 0.002472822097373027, "phrase": "provenance_tracking"}, {"score": 0.002405496949144104, "phrase": "technical_details"}, {"score": 0.0023834640793589435, "phrase": "dbwiki"}, {"score": 0.002124461969404541, "phrase": "tedious_details"}, {"score": 0.0021049977753042253, "phrase": "data_curation"}], "paper_keywords": [""], "paper_abstract": "Databases and wikis have complementary strengths and weaknesses for use in collaborative data management and data curation. Relational databases, for example, offer advantages such as scalability, query optimization and concurrency control, but are not easy to use and lack other features needed for collaboration. Wikis have proved enormously successful as a means to collaborate because they are easy to use, encourage sharing, and provide built-in support for archiving, history-tracking and annotation. However, wikis lack support for structured data, efficiently querying data at scale, and localized provenance and annotation. To achieve the best of both worlds, we are developing a general-purpose platform for collaborative data management, called DBWIKI. Our system not only facilitates the collaborative creation of structured data; it also provides features not usually provided by database technology such as annotation, citability, versioning, and provenance tracking. This paper describes the technical details behind DBWIKI that make it easy to create, correct, discuss, and query structured data, placing more power in the hands of users while managing tedious details of data curation automatically.", "paper_title": "The Database Wiki Project: A General-Purpose Platform for Data Curation and Collaboration", "paper_id": "WOS:000297688300002"}