{"auto_keywords": [{"score": 0.02845451132237905, "phrase": "virtual_domains"}, {"score": 0.00481495049065317, "phrase": "trustworthy_future_internet"}, {"score": 0.004668957916795845, "phrase": "fine-grained_flow_control"}, {"score": 0.004621279527317074, "phrase": "fixed_or_dynamic_policies"}, {"score": 0.004481132747216135, "phrase": "built-in_network_level_functionality"}, {"score": 0.004322967486451877, "phrase": "future_internet"}, {"score": 0.0038413947966606118, "phrase": "user-centric_or_service-centric_routing_capabilities"}, {"score": 0.0036303546926971966, "phrase": "trust_and_policy_management"}, {"score": 0.0028807718824400697, "phrase": "trust_management"}, {"score": 0.002851301751761804, "phrase": "servitr"}, {"score": 0.0027505037762786087, "phrase": "functional_implementation"}, {"score": 0.0026532596852754525, "phrase": "trust_level_changes"}, {"score": 0.002559444836360178, "phrase": "servitr_protocols"}, {"score": 0.002393907896783117, "phrase": "virtual_network_provisioning_infrastructure"}, {"score": 0.0021711510806134817, "phrase": "japan"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Future internet", " Internet trustworthiness", " Architecture Prototype", " Geo-distributed networks", " Network virtualization"], "paper_abstract": "A flexible, scalable, and robust framework that enables fine-grained flow control under fixed or dynamic policies while addressing trustworthiness as a built-in network level functionality is a desirable goal of the future Internet. Furthermore, the level of trustworthiness may possibly be different from one network to another. It is also desirable to provide user-centric or service-centric routing capabilities to achieve service-oriented traffic controls as well as trust and policy management for security. Addressing these aspects, we present the SeRViTR (Secure and Resilient Virtual Trust Routing) framework. In particular, we discuss the goal and scope of SeRViTR, its implementation details, and a testbed that enables us to demonstrate SeRViTR. We have designed protocols and mechanisms for policy and trust management for SeRViTR and show a validation on the functional implementation of several SeRViTR components to illustrate virtual domains and trust level changes between virtual domains that are achieved under SeRViTR protocols. Going from implementation to testbed, we demonstrate SeRViTR in a virtual network provisioning infrastructure called the Geo-distributed Programmable Layer-2 Networking Environment (G-PLaNE) that connects three institutions spanning the US and Japan. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "SeRViTR: A framework, implementation, and a testbed for a trustworthy future Internet", "paper_id": "WOS:000335610600009"}