{"auto_keywords": [{"score": 0.04758008554756529, "phrase": "energy_consumption"}, {"score": 0.008713768692145006, "phrase": "preamble-based_random_access_networks"}, {"score": 0.004634254474150777, "phrase": "effective_mechanism"}, {"score": 0.004529093447865156, "phrase": "wireless_sensor_networks"}, {"score": 0.0038125469099459905, "phrase": "complex_control_mechanisms"}, {"score": 0.0037834649508375544, "phrase": "topology_discovery"}, {"score": 0.003683407561208816, "phrase": "intrinsic_simplicity"}, {"score": 0.0036413370053909886, "phrase": "asynchronous_mechanism"}, {"score": 0.0035722806911457545, "phrase": "smaller_energy_saving_potential"}, {"score": 0.0034777887763821425, "phrase": "duty_cycle_parameters"}, {"score": 0.0033599501775954024, "phrase": "novel_method"}, {"score": 0.0032836104153151973, "phrase": "duty-cycle_parameters"}, {"score": 0.0030648097361278856, "phrase": "listen_time"}, {"score": 0.0028936766625486735, "phrase": "mac"}, {"score": 0.0027215202678634517, "phrase": "exact_time"}, {"score": 0.002700738055025905, "phrase": "data_packet_transmissions"}, {"score": 0.0026191799769765085, "phrase": "performance_indicators"}, {"score": 0.002370704665003412, "phrase": "relevant_parameters"}, {"score": 0.0021622717349518744, "phrase": "significant_reduction"}, {"score": 0.0021049977753042253, "phrase": "previously_proposed_protocols"}], "paper_keywords": ["Wireless sensor networks", " MAC", " IEEE 802.15.4", " Duty cycle", " Optimization"], "paper_abstract": "Duty-cycling has been proposed as an effective mechanism for reducing the energy consumption in wireless sensor networks (WSNs). Asynchronous duty-cycle protocols where the receiver wakes up periodically to check whether there is a transmission and the sender transmits preambles to check if the receiver is awake are widely used in WSNs due to the elimination of complex control mechanisms for topology discovery and synchronization. However, the intrinsic simplicity of the asynchronous mechanism has the drawback of smaller energy saving potential that requires the optimization of the duty cycle parameters. In this paper, we propose a novel method for the optimization of the duty-cycle parameters in preamble-based random access networks based on the accurate modeling of delay, reliability and energy consumption as a function of listen time, sleep time, traffic rate and medium access control (MAC) protocol parameters. The challenges for modeling are the random access MAC and the sleep policy of the receivers, which make it impossible to determine the exact time of data packet transmissions, and thus difficult to investigate the performance indicators given by the delay, reliability and energy consumption to successfully receive packets. An analysis of these indicators is developed as a function of the relevant parameters of the network and it is used in the minimization of the energy consumption subject to delay and reliability requirements. The optimization provides significant reduction of the energy consumption compared to the previously proposed protocols in the literature.", "paper_title": "Analysis and optimization of duty-cycle in preamble-based random access networks", "paper_id": "WOS:000323924800014"}