{"auto_keywords": [{"score": 0.04350641237861327, "phrase": "ic"}, {"score": 0.01061151564438046, "phrase": "singular_value_decomposition"}, {"score": 0.009466886679272242, "phrase": "process_variation"}, {"score": 0.004684157900507474, "phrase": "modern_hardware_security"}, {"score": 0.004556901872357751, "phrase": "digital_rights_management"}, {"score": 0.004453488286477661, "phrase": "ghost_circuitry"}, {"score": 0.004195418010131832, "phrase": "integrated_circuit"}, {"score": 0.003757480190200645, "phrase": "gate-level_characterization"}, {"score": 0.0029586543333524904, "phrase": "first_robust_and_low-cost_hardware_metering_scheme"}, {"score": 0.002825681384008326, "phrase": "rapid_and_scalable_treatment"}, {"score": 0.002748775748298028, "phrase": "gc_detection_problem"}, {"score": 0.002711109302199029, "phrase": "equivalent_task"}, {"score": 0.0023725232579531273, "phrase": "hardware_metering"}, {"score": 0.0021441057555396013, "phrase": "zero_false_positives"}, {"score": 0.002124461969404541, "phrase": "zero_false_negatives"}, {"score": 0.0021049977753042253, "phrase": "gc_detection"}], "paper_keywords": ["Gate-level characteristics", " ghost circuitry", " hardware metering", " process variation", " singular value decomposition"], "paper_abstract": "Modern hardware security has a very broad scope ranging from digital rights management to the detection of ghost circuitry. These and many other security tasks are greatly hindered by process variation, which makes each integrated circuit (IC) unique, and device aging, which evolves the IC throughout its lifetime. We have developed a singular value decomposition (SVD)-based procedure for gate-level characterization (GLC) that calculates changes in properties, such as delay and switching power of each gate of an IC, accounting for process variation and device aging. We employ our SVD-based GLC approach for the development of two security applications: hardware metering and ghost circuitry (GC) detection. We present the first robust and low-cost hardware metering scheme, using an overlapping IC partitioning approach that enables rapid and scalable treatment. We also map the GC detection problem into an equivalent task of GLC consistency checking using the same overlapping partitioning. The effectiveness of the approaches is evaluated using the ISCAS85, ISCAS89, and ITC99 benchmarks. In hardware metering, we are able to obtain probabilities of coincidence in the magnitude of 10(-8) or less, and we obtain zero false positives and zero false negatives in GC detection.", "paper_title": "Gate Characterization Using Singular Value Decomposition: Foundations and Applications", "paper_id": "WOS:000301506500035"}