{"auto_keywords": [{"score": 0.046922258444129956, "phrase": "hardware_interface"}, {"score": 0.00481495049065317, "phrase": "preemptible_echronos_embedded_operating_system"}, {"score": 0.004706895428234964, "phrase": "controlled_concurrency_framework"}, {"score": 0.00460125407969429, "phrase": "owicki-gries_method"}, {"score": 0.0035515951985356374, "phrase": "uniprocessor_platforms"}, {"score": 0.00334780964309978, "phrase": "traditional_owicki-gries_method"}, {"score": 0.0032429499567088113, "phrase": "high-performance_system_code"}, {"score": 0.003141364320497748, "phrase": "explicit_concurrency_control"}, {"score": 0.0028813415821988156, "phrase": "user_code"}, {"score": 0.002855251306715901, "phrase": "os_code"}, {"score": 0.0027407299369891502, "phrase": "context_switching"}, {"score": 0.0026188490199688013, "phrase": "interleaving_behavior"}, {"score": 0.0025833500717948343, "phrase": "echronos_os"}, {"score": 0.0024797072773840704, "phrase": "embedded_micro-controllers"}, {"score": 0.002316105585203396, "phrase": "echronos_os."}, {"score": 0.0022640009579466924, "phrase": "echronos_model"}, {"score": 0.0021436720821474973, "phrase": "high_level"}, {"score": 0.0021049977753042253, "phrase": "modern_reasoning_tools"}], "paper_keywords": [""], "paper_abstract": "We introduce a controlled concurrency framework, derived from the Owicki-Gries method, for describing a hardware interface in detail sufficient to support the modelling and verification of small, embedded operating systems (OS's) whose run-time responsiveness is paramount. Such real-time systems run with interrupts mostly enabled, including during scheduling. That differs from many other successfully modelled and verified OS's that typically reduce the complexity of concurrency by running on uniprocessor platforms and by switching interrupts off as much as possible. Our framework builds on the traditional Owicki-Gries method, for its fine-grained concurrency is needed for high-performance system code. We adapt it to support explicit concurrency control, by providing a simple, faithful representation of the hardware interface that allows software to control the degree of interleaving between user code, OS code, interrupt handlers and a scheduler that controls context switching. We then apply this framework to model the interleaving behavior of the eChronos OS, a preemptible real-time OS for embedded micro-controllers. We discuss the accuracy and usability of our approach when instantiated to model the eChronos OS. Both our framework and the eChronos model are formalised in the Isabelle/HOL theorem prover, taking advantage of the high level of automation in modern reasoning tools.", "paper_title": "Controlled Owicki-Gries Concurrency: Reasoning about the Preemptible eChronos Embedded Operating System", "paper_id": "WOS:000367347400003"}