{"auto_keywords": [{"score": 0.04966447721457641, "phrase": "fuzzy_association_rules"}, {"score": 0.01080259605810163, "phrase": "mutual_information"}, {"score": 0.010710091111841838, "phrase": "mi"}, {"score": 0.00481495049065317, "phrase": "efficient_mining"}, {"score": 0.004690952711665194, "phrase": "gene_expression_data_analysis"}, {"score": 0.004590052784169268, "phrase": "useful_dependencies"}, {"score": 0.004491313367627919, "phrase": "large_gene_expression_data_sets"}, {"score": 0.003941746077126688, "phrase": "computationally_manageable_solutions"}, {"score": 0.0034441627435203804, "phrase": "clustering_phase"}, {"score": 0.003129509028432954, "phrase": "similarity_measure"}, {"score": 0.003062091606343783, "phrase": "numerical_evaluation"}, {"score": 0.002918826667294298, "phrase": "main_methods"}, {"score": 0.0027581067089091434, "phrase": "mutual_information_clustering"}, {"score": 0.0025389513338018414, "phrase": "supervised_bias"}, {"score": 0.0024950747439601863, "phrase": "mutual_information_clustering_phase"}, {"score": 0.0022768346311104735, "phrase": "gene_expression_data"}, {"score": 0.0022277448907881306, "phrase": "presented_techniques"}, {"score": 0.002132711053003407, "phrase": "intelligent_exploration"}], "paper_keywords": ["fuzzy association rules", " mutual information", " clustering", " self-organized maps", " entropy", " genome data mining", " gene expression analysis"], "paper_abstract": "Fuzzy association rules can reveal useful dependencies and interactions hidden in large gene expression data sets. However their derivation perplexes very difficult combinatorial problems that depend heavily on the size of these sets. The paper follows a divide and conquer approach to the problem that obtains computationally manageable solutions. Initially we cluster genes that more probably are associated. Thereafter, the fuzzy association rule extraction algorithms confront many but significantly reduced computationally problems that usually can be processed very fast. The clustering phase is accomplished by means of an approach based on mutual information (MI). This approach uses the mutual information as a similarity measure. However, the numerical evaluation of the MI is subtle. We experiment with the main methods and we compare between them. As the device that implements the mutual information clustering we use a SOM (Self-Organized Map) based approach that is capable of effectively incorporating supervised bias. After the mutual information clustering phase the fuzzy association rules are extracted locally on a per cluster basis. The paper presents an application of the techniques for mining the gene expression data. However, the presented techniques can easily be adapted and can be fruitful for intelligent exploration of any other similar data set as well.", "paper_title": "Mutual information clustering for efficient mining of fuzzy association rules with application to gene expression data analysis", "paper_id": "WOS:000236676500006"}