{"auto_keywords": [{"score": 0.035422811455084253, "phrase": "fgfcm"}, {"score": 0.008672772689576528, "phrase": "image_segmentation"}, {"score": 0.00481495049065317, "phrase": "local_information"}, {"score": 0.00476957387174325, "phrase": "fuzzy_c-means"}, {"score": 0.004702305713946529, "phrase": "spatial_constraints"}, {"score": 0.004421555044007889, "phrase": "local_spatial_information"}, {"score": 0.004390254067258742, "phrase": "corresponding_objective_functions"}, {"score": 0.004167356068778172, "phrase": "prior_knowledge"}, {"score": 0.004031416989846117, "phrase": "crucial_parameter_alpha"}, {"score": 0.0037105832468804123, "phrase": "image_size"}, {"score": 0.003505414008379761, "phrase": "local_spatial_and_gray_information"}, {"score": 0.00347233554402564, "phrase": "novel_fast_and_robust_fcm_framework"}, {"score": 0.003249335266861978, "phrase": "fcm_s"}, {"score": 0.0031958526151512332, "phrase": "clustering_performance"}, {"score": 0.0031062017241746294, "phrase": "fast_fcm"}, {"score": 0.0030841893723937397, "phrase": "fcm"}, {"score": 0.0029204666543220337, "phrase": "major_characteristics"}, {"score": 0.0028452594623146945, "phrase": "new_factor"}, {"score": 0.002681438988019335, "phrase": "empirically-adjusted_parameter_alpha"}, {"score": 0.0026310298443229657, "phrase": "segmenting_time"}, {"score": 0.0025754484889033195, "phrase": "gray-levels_q"}, {"score": 0.002249639986821758, "phrase": "standard_fcm"}, {"score": 0.0022073303906817734, "phrase": "synthetic_and_real-world_images"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["fuzzy c-means clustering (FCM)", " enhanced fuzzy c-means clustering", " image segmentation", " robustness", " spatial constraints", " gray constraints", " fast clustering"], "paper_abstract": "Fuzzy c-means (FCM) algorithms with spatial constraints (FCM_S) have been proven effective for image segmentation. However, they still have the following disadvantages: (1) although the introduction of local spatial information to the corresponding objective functions enhances their insensitiveness to noise to some extent, they still lack enough robustness to noise and outliers, especially in absence of prior knowledge of the noise; (2) in their objective functions, there exists a crucial parameter alpha used to balance between robustness to noise and effectiveness of preserving the details of the image, it is selected generally through experience; and (3) the time of segmenting an image is dependent on the image size, and hence the larger the size of the image, the more the segmentation time. In this paper, by incorporating local spatial and gray information together, a novel fast and robust FCM framework for image segmentation, i.e., fast generalized fuzzy c-means (FGFCM) clustering algorithms, is proposed. FGFCM can mitigate the disadvantages of FCM_S and at the same time enhances the clustering performance. Furthermore, FGFCM not only includes many existing algorithms, such as fast FCM and enhanced FCM as its special cases, but also can derive other new algorithms such as FGFCM_S1 and FGFCM_S2 proposed in the rest of this paper. The major characteristics of FGFCM are: (1) to use a new factor S-ij as a local (both spatial and gray) similarity measure aiming to guarantee both noise-immunity and detail-preserving for image, and meanwhile remove the empirically-adjusted parameter alpha; (2) fast clustering or segmenting image, the segmenting time is only dependent on the number of the gray-levels q rather than the size N(>> q) of the image, and consequently its computational complexity is reduced from O(NcI (1)) to O(qcI (2)), where c is the number of the clusters, I-1 and I-2(< I-1, generally) are the numbers of iterations, respectively, in the standard FCM and our proposed fast segmentation method. The experiments on the synthetic and real-world images show that FGFCM algorithm is effective and efficient. (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Fast and robust fuzzy c-means clustering algorithms incorporating local information for image segmentation", "paper_id": "WOS:000242684100005"}