{"auto_keywords": [{"score": 0.03936608684117128, "phrase": "institutional_isomorphism"}, {"score": 0.015719716506582538, "phrase": "information_technology"}, {"score": 0.015543532808173026, "phrase": "supply_chain_management"}, {"score": 0.014608716158982989, "phrase": "supply_chain"}, {"score": 0.013048840883430177, "phrase": "institutional_pressure"}, {"score": 0.012401649489214517, "phrase": "different_types"}, {"score": 0.004271843728776305, "phrase": "supply_chain_performance"}, {"score": 0.0037042817107563785, "phrase": "namely_coercion"}, {"score": 0.00308610073274614, "phrase": "possible_impact"}, {"score": 0.0026003455833291124, "phrase": "possible_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["supply chain management", " information technology adoption", " institutional isomorphism"], "paper_abstract": "The adoption of information technology (IT) along a supply chain has increasingly become a necessity for enhancing supply chain performance. Organizations in a supply chain often adopt IT due to the institutional pressure exerted by their supply chain partners. The implications of the different types of institutional isomorphism, namely coercion, mimesis, and norms, are explored from both the perspectives of firms that have taken the initiatives to adopt IT and those that have followed their supply chain partners to adopt IT. The possible impact of the different types of institutional isomorphism discussed here can help managers to better understand the institutional pressure they are putting on and/or of adapting to their supply chain partners, in particular, the possible problems and the injunctions/compliances they may face in the course of adopting IT for the management of their supply chains. The implications of institutional isomorphism on the adoption of IT for supply chain management are discussed. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Institutional isomorphism and the adoption of information technology for supply chain management", "paper_id": "WOS:000234004200008"}