{"auto_keywords": [{"score": 0.004573953147933065, "phrase": "n_points"}, {"score": 0.004510336430422002, "phrase": "fixed_axis-parallel_rectangle"}, {"score": 0.004406260054779782, "phrase": "two-dimensional_space"}, {"score": 0.003976007772514762, "phrase": "empty_rectangle"}, {"score": 0.003884212965525665, "phrase": "largest_area"}, {"score": 0.0032370412139943808, "phrase": "basic_idea"}, {"score": 0.0029343128039167185, "phrase": "remaining_points"}, {"score": 0.002598333022293788, "phrase": "main_memory_resources"}, {"score": 0.002514625755809045, "phrase": "formal_proofs"}, {"score": 0.0022793032191981404, "phrase": "extensive_set"}, {"score": 0.002237036807966899, "phrase": "synthetic_and_real_data"}, {"score": 0.0021049977753042253, "phrase": "different_dataset_configurations"}], "paper_keywords": ["Spatial databases", " Query", " Indexing methods"], "paper_abstract": "Let S be a set of n points in a fixed axis-parallel rectangle , i.e. in the two-dimensional space (2D). Assuming that those points are stored in an R-tree, this paper presents several algorithms for finding the empty rectangle in R with the largest area, sides parallel to the axes of the space, and containing only a query point q. This point can not be part of S, that is, it is not stored in the R-tree. All algorithms follow the basic idea of discarding part of the points of S, in such a way that the problem can be solved only considering the remaining points. As a consequence, the algorithms only have to access a very small portion of the nodes (disk blocks) of the R-tree, saving main memory resources and computation time. We provide formal proofs of the correctness of our algorithms and, in order to evaluate the performance of the algorithms, we run an extensive set of experiments using synthetic and real data. The results have demonstrated the efficiency and scalability of our algorithms for different dataset configurations.", "paper_title": "The largest empty rectangle containing only a query object in Spatial Databases", "paper_id": "WOS:000334446100001"}