{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "face-to-face_pass"}, {"score": 0.004706305193222972, "phrase": "humanoid_behavior_generation"}, {"score": 0.0037971749182744334, "phrase": "module_primitives"}, {"score": 0.0037454814403672697, "phrase": "control_parameters"}, {"score": 0.0036776458116294986, "phrase": "appropriate_primitive_motions"}, {"score": 0.0035294580355761506, "phrase": "sensorimotor_maps"}, {"score": 0.00349734405943853, "phrase": "visual_information"}, {"score": 0.003148316319108045, "phrase": "selected_module"}, {"score": 0.003021392767766593, "phrase": "face-to-face_ball_pass"}, {"score": 0.0028995712226514746, "phrase": "example_task"}, {"score": 0.00274472767672686, "phrase": "first_trial"}, {"score": 0.0026949679939994226, "phrase": "corresponding_modules"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["humanoid", " optic flow", " face-to-face pass", " sensorimotor map"], "paper_abstract": "Humanoid behavior generation is one of the most formidable issues due to its complicated structure with many degrees of freedom. This paper proposes a controller for a humanoid to cope with this issue. A given task is decomposed into a sequence of modules first, each of which consists of a set of module primitives that have control parameters to realize the appropriate primitive motions. Then, these parameters are learned by sensorimotor maps between visual information (flow) and motor commands. The controller accomplishes a given task by selecting a module, a module primitive in the selected module, and its appropriate control parameters learned in advance. A face-to-face ball pass in a RoboCup context is chosen as an example task. (To the best of our knowledge, this is the first trial.) The corresponding modules are approaching a ball, kicking a ball to the opponent, and trapping a ball coming to the player. In order to show the validity, the method is applied to two different humanoids, independently, and they succeed in realizing the face-to-face pass for more than three rounds. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Visuo-motor learning for face-to-face pass between heterogeneous humanoids", "paper_id": "WOS:000238515700001"}