{"auto_keywords": [{"score": 0.024760361056242585, "phrase": "nature"}, {"score": 0.00481495049065317, "phrase": "fine-grain_dynamically_reconfigurable_architecture"}, {"score": 0.004733458808453602, "phrase": "fpga-asic_gaps"}, {"score": 0.00448179813172021, "phrase": "field-programmable_gate_arrays"}, {"score": 0.004287166497171827, "phrase": "application-specific_integrated_circuits"}, {"score": 0.003803991592917943, "phrase": "area_usage"}, {"score": 0.003626272370749206, "phrase": "full_advantage"}, {"score": 0.003528458369404996, "phrase": "new_architecture"}, {"score": 0.003317883538640966, "phrase": "homogeneous_reconfigurable_logic_elements"}, {"score": 0.003173636240475185, "phrase": "lookup_table"}, {"score": 0.0029739847626249157, "phrase": "hardware_resources"}, {"score": 0.002903628734069691, "phrase": "application_needs"}, {"score": 0.002873986510042009, "phrase": "proposed_fdr_architecture"}, {"score": 0.002825251837733693, "phrase": "long-distance_and_global_wires"}, {"score": 0.0027395968397212053, "phrase": "conventional_fpgas"}, {"score": 0.002720916895509682, "phrase": "fine-grain_dynamic_reconfiguration"}, {"score": 0.0026839372202435065, "phrase": "local_embedded_static_ram_blocks"}, {"score": 0.002422108787774162, "phrase": "conventional_fpga_architecture"}, {"score": 0.0023566987138026285, "phrase": "logic_folding"}, {"score": 0.002308800317961002, "phrase": "deep_logic_folding"}], "paper_keywords": ["Dynamic reconfiguration", " field-programmable gate arrays (FPGAs)", " integrated circuits", " logic folding"], "paper_abstract": "Prior work has shown that due to the overhead incurred in enabling reconfigurability, field-programmable gate arrays (FPGAs) require 21 x more silicon area, 3 x larger delay, and 10 x more dynamic power consumption compared with application-specific integrated circuits (ASICs). We have earlier presented a hybrid CMOS/nanotechnology reconfigurable architecture (NATURE). It uses the concept of temporal logic folding and fine-grain (i.e., cycle-level) dynamic reconfiguration to increase logic density by an order of magnitude. Since logic folding reduces area usage significantly, on-chip communications tend to become localized. To take full advantage of this fact, we propose a new architecture, called fine-grain dynamically reconfigurable (FDR), that consists of an array of homogeneous reconfigurable logic elements (LEs). Each LE can be arbitrarily configured into a lookup table (LUT) or interconnect or a combination of both. This significantly enhances the flexibility of allocating hardware resources between LUTs and interconnects based on application needs. The proposed FDR architecture eliminates most of the long-distance and global wires, which occupy most of the area in conventional FPGAs. Fine-grain dynamic reconfiguration is enabled by local embedded static RAM blocks. The experiments show that, on an average, area, delay, and power are improved by 9.14 x, 1.11x, and 1.45x, compared with a conventional FPGA architecture that does not use the concept of logic folding. Compared with NATURE with deep logic folding, area, delay, and power are improved by 2.12 x, 3.28x, and 1.74 x, respectively. Although this does not eliminate the FPGA ASIC area/delay/power gaps, it makes progress toward bridging these gaps.", "paper_title": "A Fine-Grain Dynamically Reconfigurable Architecture Aimed at Reducing the FPGA-ASIC Gaps", "paper_id": "WOS:000345568900014"}