{"auto_keywords": [{"score": 0.04963419481547922, "phrase": "web_site_navigability"}, {"score": 0.033411028272843174, "phrase": "web_mining-based_method"}, {"score": 0.028110267025340297, "phrase": "analysis_results"}, {"score": 0.00481495049065317, "phrase": "measure_web_site_navigability"}, {"score": 0.004510336430422002, "phrase": "web_site's_hyperlink_structure"}, {"score": 0.004166129325245761, "phrase": "data-driven_approach"}, {"score": 0.004108161406159407, "phrase": "web_site"}, {"score": 0.004050996777117918, "phrase": "web_data"}, {"score": 0.0039024014688338964, "phrase": "information_foraging"}, {"score": 0.0037768417338850274, "phrase": "fundamental_navigability_dimensions"}, {"score": 0.003672427620845944, "phrase": "metric_development"}, {"score": 0.003003726508522467, "phrase": "proposed_metrics"}, {"score": 0.0029206231857112305, "phrase": "prototype_system"}, {"score": 0.002550165781755603, "phrase": "evaluation_study"}, {"score": 0.002445021071485221, "phrase": "evaluation_results"}, {"score": 0.002410942838102255, "phrase": "user_performance"}, {"score": 0.002226592967032469, "phrase": "practical_value"}, {"score": 0.0022058510091498666, "phrase": "data-driven_metrics"}], "paper_keywords": ["data-driven navigability metrics", " Web metrics", " Web mining", " Web site navigability", " Web site navigation"], "paper_abstract": "Web site navigability refers to the degree to which a visitor can follow a Web site's hyperlink structure to successfully find information with efficiency and ease. In this study, we take a data-driven approach to measure Web site navigability using Web data readily available in organizations. Guided by information foraging and information-processing theories, we identify fundamental navigability dimensions that should be emphasized in metric development. Accordingly, we propose three data-driven metrics-namely, power, efficiency, and directness-that consider Web structure, usage, and content data to measure a Web site's navigability. We also develop a Web mining-based method that processes Web data to enable the calculation of the proposed metrics. We further implement a prototype system based on the Web mining-based method and use it to assess the navigability of two sizable, real-world Web sites with the metrics. To examine the analysis results by the metrics, we perform an evaluation study that involves these two sites and 248 voluntary participants. The evaluation results show that user performance and assessments are consistent with the analysis results revealed by our metrics. Our study demonstrates the viability and practical value of data-driven metrics for measuring Web site navigability, which can be used for evaluative, diagnostic, or predictive purposes.", "paper_title": "A Data-Driven Approach to Measure Web Site Navigability", "paper_id": "WOS:000311832400008"}