{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cooperative_work_process"}, {"score": 0.004545240514015278, "phrase": "product_development_process"}, {"score": 0.004430248457624686, "phrase": "new_work_organizations"}, {"score": 0.0036553070575015344, "phrase": "global_and_methodological_approach"}, {"score": 0.0035173498506324476, "phrase": "collaborative_frameworks"}, {"score": 0.0034725269588525534, "phrase": "web_technology_environments"}, {"score": 0.003215295260684715, "phrase": "classical_methods"}, {"score": 0.002977061391551631, "phrase": "first_decomposition_level"}, {"score": 0.0027212777001495154, "phrase": "working_teams"}, {"score": 0.0024556852466581527, "phrase": "working_groups"}, {"score": 0.0021876814398268775, "phrase": "best_interface"}, {"score": 0.0021049977753042253, "phrase": "cooperative_work"}], "paper_keywords": ["concurrent engineering", " project management", " work organization", " decomposition method", " graph theory"], "paper_abstract": "Research for improving the product development process becomes crucial in new work organizations. Today, projects involve more and more activities and work groups which must be efficiently coordinated. In this paper, a method for structuring cooperative activities in order to improve its global performance is proposed. This global and methodological approach can be used to specify collaborative frameworks like Web technology environments. The study is based on the recommendations of ISO 9001 standard. Classical methods decompose a project into several work groups which are then scheduled. This first decomposition level is supplemented with a more detailed structuring level in order to control the size of the working teams. The steps of the process being defined and planned, the responsibilities inside the working groups are specified. Finally, the method proposes to identify the couples of actors who generate the best interface for the effectiveness of the cooperative work.", "paper_title": "Methodological utilities for organizing cooperative work process according to ISO 9001 standard recommendations", "paper_id": "WOS:000242335600007"}