{"auto_keywords": [{"score": 0.027263409056728853, "phrase": "multicent"}, {"score": 0.010535529355896729, "phrase": "dtn_routing"}, {"score": 0.006212150904464266, "phrase": "routing_strategy"}, {"score": 0.00481495049065317, "phrase": "diverse_performance_objectives"}, {"score": 0.0047277417909824745, "phrase": "delay_tolerant_networks"}, {"score": 0.004283280680222718, "phrase": "store-carry-forward_manner"}, {"score": 0.004221072004655573, "phrase": "scarce_communication_opportunities"}, {"score": 0.0041294419262414995, "phrase": "different_packet_routing_strategies"}, {"score": 0.0038946650372062783, "phrase": "different_routing_performance_objectives"}, {"score": 0.0038380787059463075, "phrase": "minimal_average_delay"}, {"score": 0.003810093416457147, "phrase": "maximal_hit_rate"}, {"score": 0.0037273513742154237, "phrase": "incentive_systems"}, {"score": 0.0034642599795044445, "phrase": "current_incentive_systems"}, {"score": 0.003161271802988128, "phrase": "routing_performance_objective"}, {"score": 0.0030700099570048346, "phrase": "first_aspect"}, {"score": 0.0029813748433158032, "phrase": "second_aspect"}, {"score": 0.002770791022032813, "phrase": "different_performance_objectives"}, {"score": 0.0021916007506930352, "phrase": "adjustable_quality_of_service"}, {"score": 0.0021518035978153878, "phrase": "packet_routing"}, {"score": 0.002136087390959268, "phrase": "specific_sources"}, {"score": 0.0021049977753042253, "phrase": "extensive_trace-driven_experimental_results"}], "paper_keywords": ["Incentive system", " performance objectives", " routing", " delay tolerant networks"], "paper_abstract": "In Delay Tolerant Networks (DTNs), nodes meet opportunistically and exchange packets only when they meet with each other. Therefore, routing is usually conducted in a store-carry-forward manner to exploit the scarce communication opportunities. As a result, different packet routing strategies, i.e., which packet to be forwarded or stored with priority, can lead to different routing performance objectives, such as minimal average delay and maximal hit rate. On the other hand, incentive systems are necessary for DTNs since nodes may be selfish and may not be cooperative on packet forwarding/storage. However, current incentive systems for DTNs mainly focus on encouraging nodes to participate in packet forwarding/storage but fail to further encourage nodes to follow a certain packet routing strategy to realize a routing performance objective. We name the former as the first aspect of cooperation and the latter as the second aspect of cooperation in DTN routing. Therefore, in this paper, we first discuss the routing strategy that can realize different performance objectives when nodes are fully cooperative, i.e., are willing to follow both aspects of cooperation. We then propose Multicent, a game theoretical incentive scheme that can encourage nodes to follow the two aspects of cooperation even when they are selfish. Basically, Multicent assigns credits for packet forwarding/storage in proportional to the priorities specified in the routing strategy. Multicent also supports adjustable Quality of Service (QoS) for packet routing between specific sources and destinations. Extensive trace-driven experimental results verify the effectiveness of Multicent.", "paper_title": "Multicent: A Multifunctional Incentive Scheme Adaptive to Diverse Performance Objectives for DTN Routing", "paper_id": "WOS:000354526000013"}