{"auto_keywords": [{"score": 0.04971911912939946, "phrase": "local_search_engines"}, {"score": 0.02473805531775285, "phrase": "yumi"}, {"score": 0.015719716506582538, "phrase": "query_results"}, {"score": 0.015087428827687857, "phrase": "local_services"}, {"score": 0.0074555384545456765, "phrase": "restaurant_domain"}, {"score": 0.00474283953918251, "phrase": "georeferenced_objects"}, {"score": 0.004654210559456924, "phrase": "numerous_online_sources"}, {"score": 0.004171730509424374, "phrase": "typical_local_service_queries"}, {"score": 0.0040783049361415614, "phrase": "french_restaurant_in_the_loop"}, {"score": 0.0039124037252916055, "phrase": "french_restaurant"}, {"score": 0.0030033417337933625, "phrase": "query_translation"}, {"score": 0.0029360049890445944, "phrase": "integrated_access"}, {"score": 0.0027532820796396713, "phrase": "single_list"}, {"score": 0.00243033541656411, "phrase": "user_criteria"}, {"score": 0.0024120247307686084, "phrase": "user_ratings"}, {"score": 0.002340147988348115, "phrase": "prototype_system"}, {"score": 0.0022194677375148063, "phrase": "representative_case_study"}, {"score": 0.002153316680437517, "phrase": "comprehensive_experimental_study"}, {"score": 0.0021049977753042253, "phrase": "prototype_version"}], "paper_keywords": ["Web database integration", " geospatial query processing", " ranking"], "paper_abstract": "The emergence of numerous online sources about local services presents a need for more automatic yet accurate data integration techniques. Local services are georeferenced objects and can be queried by their locations on a map, for instance, neighborhoods. Typical local service queries (e. g., \"French Restaurant in The Loop\") include not only information about \"what\" (\"French Restaurant\") a user is searching for (such as cuisine) but also \"where\" information, such as neighborhood (\"The Loop\"). In this article, we address three key problems: query translation, result merging and ranking. Most local search engines provide a (hierarchical) organization of (large) cities into neighborhoods. A neighborhood in one local search engine may correspond to sets of neighborhoods in other local search engines. These make the query translation challenging. To provide an integrated access to the query results returned by the local search engines, we need to combine the results into a single list of results. Our contributions include: (1) An integration algorithm for neighborhoods. (2) A very effective business listing resolution algorithm. (3) A ranking algorithm that takes into consideration the user criteria, user ratings and rankings. We have created a prototype system, Yumi, over local search engines in the restaurant domain. The restaurant domain is a representative case study for the local services. We conducted a comprehensive experimental study to evaluate Yumi. A prototype version of Yumi is available online.", "paper_title": "Merging Query Results From Local Search Engines for Georeferenced Objects", "paper_id": "WOS:000345067300001"}