{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "petri_net_controlled_grammars"}, {"score": 0.04589468431249302, "phrase": "petri_net"}, {"score": 0.03543600733238519, "phrase": "generative_power"}, {"score": 0.030623642999490407, "phrase": "occurrence_sequences"}, {"score": 0.004563427013973105, "phrase": "petri_net_controlled_grammar"}, {"score": 0.004490552331642995, "phrase": "context-free_grammar"}, {"score": 0.003926626018798576, "phrase": "terminal_words"}, {"score": 0.0035648266669315943, "phrase": "occurrence_sequence"}, {"score": 0.003034158379493625, "phrase": "weak_coding"}, {"score": 0.0029221312451219203, "phrase": "admitted_sets"}, {"score": 0.0025962029048520324, "phrase": "restriction_to_occurrence_sequences"}, {"score": 0.002162379426839795, "phrase": "new_characterizations"}, {"score": 0.0021049977753042253, "phrase": "matrix_languages"}], "paper_keywords": [""], "paper_abstract": "Essentially, a Petri net controlled grammar is a context-free grammar equipped with a Petri net and a function which maps transitions of the net to rules of the grammar. The language consists of all terminal words that can be obtained by applying of a sequence of productions which is the image of an occurrence sequence of the Petri net under the function. We study the generative power of such grammars on the type of the function which can be a bijection or a coding or a weak coding and with respect to three types of admitted sets of occurrence sequences. We show that the generative power does not depend on the type of the function. Moreover, the restriction to occurrence sequences, which transform the initial marking to a marking in a given finite set of markings, leads to a more powerful class of grammars than the allowance of all occurrence sequences. Furthermore, we present some new characterizations of the family of matrix languages in terms of Petri net controlled grammars.", "paper_title": "Petri Net Controlled Grammars: the Power of Labeling and Final Markings", "paper_id": "WOS:000277059200006"}