{"auto_keywords": [{"score": 0.040454428776654, "phrase": "mpi"}, {"score": 0.015173125990826023, "phrase": "autodock"}, {"score": 0.011746825553940101, "phrase": "individual_docking_jobs"}, {"score": 0.010984735941666664, "phrase": "grid_maps"}, {"score": 0.004682917599491709, "phrase": "drug_discovery"}, {"score": 0.004590820632326585, "phrase": "popular_open-source_application"}, {"score": 0.004429566229017728, "phrase": "ligand-receptor_interactions"}, {"score": 0.004342430078306461, "phrase": "serial_application"}, {"score": 0.004026598712747509, "phrase": "multi-level_parallelization"}, {"score": 0.003823815639559103, "phrase": "openmp"}, {"score": 0.0036893794227117194, "phrase": "mpi-enabled_systems"}, {"score": 0.0030724971661718983, "phrase": "openmp_multithreading"}, {"score": 0.0029762350325031207, "phrase": "multiprocessor_systems"}, {"score": 0.002705121052747945, "phrase": "autodock's_lamarkian_genetic_algorithm"}, {"score": 0.002548331088496964, "phrase": "mpi_parallelization"}, {"score": 0.0024981087707313656, "phrase": "execution_time"}, {"score": 0.002478297391121455, "phrase": "virtual_screens"}, {"score": 0.0021049977753042253, "phrase": "computational_resources"}], "paper_keywords": [""], "paper_abstract": "Background: Virtual (computational) screening is an increasingly important tool for drug discovery. AutoDock is a popular open-source application for performing molecular docking, the prediction of ligand-receptor interactions. AutoDock is a serial application, though several previous efforts have parallelized various aspects of the program. In this paper, we report on a multi-level parallelization of AutoDock 4.2 (mpAD4). Results: Using MPI and OpenMP, AutoDock 4.2 was parallelized for use on MPI-enabled systems and to multithread the execution of individual docking jobs. In addition, code was implemented to reduce input/output (I/O) traffic by reusing grid maps at each node from docking to docking. Performance of mpAD4 was examined on two multiprocessor computers. Conclusions: Using MPI with OpenMP multithreading, mpAD4 scales with near linearity on the multiprocessor systems tested. In situations where I/O is limiting, reuse of grid maps reduces both system I/O and overall screening time. Multithreading of AutoDock's Lamarkian Genetic Algorithm with OpenMP increases the speed of execution of individual docking jobs, and when combined with MPI parallelization can significantly reduce the execution time of virtual screens. This work is significant in that mpAD4 speeds the execution of certain molecular docking workloads and allows the user to optimize the degree of system-level (MPI) and node-level (OpenMP) parallelization to best fit both workloads and computational resources.", "paper_title": "Multilevel Parallelization of AutoDock 4.2", "paper_id": "WOS:000300225700001"}