{"auto_keywords": [{"score": 0.047866269234385146, "phrase": "glucose_control"}, {"score": 0.014890902106094239, "phrase": "icu"}, {"score": 0.011867202048515066, "phrase": "cdss"}, {"score": 0.011378943406391027, "phrase": "bgl_measurements"}, {"score": 0.009039389580315478, "phrase": "decision_support"}, {"score": 0.0047910471257663805, "phrase": "computerized_decision_support"}, {"score": 0.004767261858417823, "phrase": "blood_glucose_regulation"}, {"score": 0.004743594110762319, "phrase": "critically_ill_patients"}, {"score": 0.004650086856905758, "phrase": "computerized_decision_support_systems"}, {"score": 0.00441326830307403, "phrase": "systems'_operating_modes"}, {"score": 0.004209369306023422, "phrase": "patient-specific_and_patient_non-specific_computerized_advice"}, {"score": 0.00393565385561, "phrase": "glucose_regulation"}, {"score": 0.0038869467872381957, "phrase": "patient_specific_advice"}, {"score": 0.0037913267098534887, "phrase": "prospective_study"}, {"score": 0.0036070601923916196, "phrase": "non-specific_advice"}, {"score": 0.0035095457780217536, "phrase": "specific_advice"}, {"score": 0.003448863509392547, "phrase": "primary_outcome_measure"}, {"score": 0.0033389285101968653, "phrase": "secondary_endpoints"}, {"score": 0.0032893755794513365, "phrase": "bgl"}, {"score": 0.003256745772827904, "phrase": "pre-defined_targets"}, {"score": 0.0031845067058084583, "phrase": "severe_hypoglycemia"}, {"score": 0.003075296862372287, "phrase": "statistical_control_charts"}, {"score": 0.0028894840672976556, "phrase": "bgl_sampling_interval"}, {"score": 0.0028608109787377255, "phrase": "bg_sampling"}, {"score": 0.0025892330566358503, "phrase": "hyperglycemia_events"}, {"score": 0.002500386390058989, "phrase": "patient_non-specific_and_patient_specific_decision_support"}, {"score": 0.002420611343093316, "phrase": "larger_effect"}, {"score": 0.0024025652912861933, "phrase": "patient_specific_level"}, {"score": 0.002337537183727731, "phrase": "hypoglycemia_events"}, {"score": 0.0023259039577313294, "phrase": "improved_safety"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Computerized decision support system", " Evaluation", " Safety statistical process control", " Glucose regulation"], "paper_abstract": "Introduction: Although the use of computerized decision support systems (CDSS) in glucose control in the ICU has been reported, little is known about the effect of the systems' operating modes on the quality of glucose control. The objective of this study was to evaluate the effect of providing patient-specific and patient non-specific computerized advice on timing of blood glucose level (BGL) measurements. Our hypothesis was that both levels of support would be effective for improving the quality of glucose regulation and safety, with patient specific advice being the most effective strategy. Patients and methods: A prospective study was performed in a 30-bed mixed medical-surgical intensive care unit (ICU) of a university hospital. In phase 1 the CDSS provided non-specific advice and thereafter, in phase 2, the system provided specific advice on timing of BGL measurements. The primary outcome measure was delay in BGL measurements before and after the two levels of support. Secondary endpoints were sampling frequency, mean BGL, BGL within pre-defined targets, time to capture target, incidences of severe hypoglycemia and hyperglycemia. These indicators were analyzed over the course of time using Statistical Control Charts. The analysis was restricted to patients with at least two blood glucose measurements. Results: Data of 3934 patient admissions were evaluated, which corresponded to 119,116 BGL measurements. The BGL sampling interval, delays in BG sampling, and percentage of hypoglycemia all decreased after introducing either of the two levels of decision support. The effect was however larger for the patient specific CDSS. Mean BGL, time to capture target, hyperglycemia index, percentage of hyperglycemia events and \"in range\" measurements remained unchanged and stable after introducing both patient non-specific and patient specific decision support. Adherence to protocol sampling rules increased by using decision support with a larger effect at the patient specific level. This led to a decrease in the percentage of hypoglycemia events and improved safety. The use of the CDSS at both levels, however, did not improve the quality of glucose control as measured by our indicators. More research is needed to investigate whether other socio-technical factors are in play. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Effects of two different levels of computerized decision support on blood glucose regulation in critically ill patients", "paper_id": "WOS:000298152700006"}