{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "volume_rendering"}, {"score": 0.01494466795981282, "phrase": "volume_data"}, {"score": 0.004421770937919324, "phrase": "volume_rendering_algorithm"}, {"score": 0.004219321533320583, "phrase": "rendering_algorithm"}, {"score": 0.0039244530915794025, "phrase": "reliable_computing"}, {"score": 0.0036191240628152205, "phrase": "self-validating_computational_model"}, {"score": 0.003557924423642353, "phrase": "posteriori_uncertainty_bounds"}, {"score": 0.0029998918671747168, "phrase": "fuzzy_transform"}, {"score": 0.0027311076665349657, "phrase": "automated_framework"}, {"score": 0.002433843373780471, "phrase": "uncertainty-aware_rendering_algorithm"}, {"score": 0.0023024551893939403, "phrase": "informed_decisions"}, {"score": 0.0022251433045184454, "phrase": "self-validated_computation"}, {"score": 0.0021049977753042253, "phrase": "complex_uncertainty"}], "paper_keywords": ["Uncertainty visualization", " verifiable visualization", " volume rendering"], "paper_abstract": "In order to assess the reliability of volume rendering, it is necessary to consider the uncertainty associated with the volume data and how it is propagated through the volume rendering algorithm, as well as the contribution to uncertainty from the rendering algorithm itself. In this work, we show how to apply concepts from the field of reliable computing in order to build a framework for management of uncertainty in volume rendering, with the result being a self-validating computational model to compute a posteriori uncertainty bounds. We begin by adopting a coherent, unifying possibility-based representation of uncertainty that is able to capture the various forms of uncertainty that appear in visualization, including variability, imprecision, and fuzziness. Next, we extend the concept of the fuzzy transform in order to derive rules for accumulation and propagation of uncertainty. This representation and propagation of uncertainty together constitute an automated framework for management of uncertainty in visualization, which we then apply to volume rendering. The result, which we call fuzzy volume rendering, is an uncertainty-aware rendering algorithm able to produce more complete depictions of the volume data, thereby allowing more reliable conclusions and informed decisions. Finally, we compare approaches for self-validated computation in volume rendering, demonstrating that our chosen method has the ability to handle complex uncertainty while maintaining efficiency.", "paper_title": "Fuzzy Volume Rendering", "paper_id": "WOS:000310143100037"}