{"auto_keywords": [{"score": 0.042051296116313676, "phrase": "overarching_control"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_collaboration"}, {"score": 0.004161553532799662, "phrase": "required_capabilities"}, {"score": 0.0041112665381266315, "phrase": "decentralised_systems"}, {"score": 0.003980106938194548, "phrase": "individual_components"}, {"score": 0.003760527969356061, "phrase": "candidate_components"}, {"score": 0.003495855671790616, "phrase": "multi-agent_systems"}, {"score": 0.003453584878128719, "phrase": "autonomous_agents"}, {"score": 0.003236596168242036, "phrase": "decentralised_distributed_systems"}, {"score": 0.0029126002350975634, "phrase": "system_components"}, {"score": 0.002877361619893651, "phrase": "appropriate_peers"}, {"score": 0.0028081546657056948, "phrase": "challenging_problem"}, {"score": 0.002762941385784905, "phrase": "candidate_peers"}, {"score": 0.002599763359352916, "phrase": "task_delegation"}, {"score": 0.002406799309495983, "phrase": "mdt-r"}, {"score": 0.0022281257694320433, "phrase": "individual_preferences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["agents", " trust", " reputation", " cooperation", " peer-to-peer"], "paper_abstract": "Distributed systems generally require their component parts to interact cooperatively, in order for the system as a whole to function effectively. For any given activity, there are typically several alternative components that have the required capabilities. In decentralised systems, where there is no overarching control, individual components are responsible for selecting other components with which to cooperate. However, the candidate components may be unreliable or dishonest, and are typically locally controlled. Such decentralised systems can be viewed as multi-agent systems, comprising autonomous agents that must cooperate for the system to be effective. Peer-topeer (P2P) systems are a subclass of decentralised distributed systems, in which not only is there no overarching control, but neither is there any hierarchy of control, power, or responsibly among the system components. Selecting appropriate peers to cooperate with is a challenging problem, since the candidate peers are autonomous and may be unreliable or dishonest. Peers need a mechanism for task delegation that takes the uncertainly of interactions into account. In this paper we present a mechanism, called MDT-R, that enables peers to delegate activities appropriately, using trust and the recommendations of other peers to meet individual preferences, such as minimising risk and maximising quality. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Enhancing peer-to-peer collaboration using trust", "paper_id": "WOS:000240151500019"}