{"auto_keywords": [{"score": 0.04623487127047264, "phrase": "dr_rose"}, {"score": 0.014161450504910623, "phrase": "social_cybernetics"}, {"score": 0.012811375745116071, "phrase": "\"social_systems"}, {"score": 0.008312307975952516, "phrase": "kybernetes"}, {"score": 0.00481495049065317, "phrase": "john_rose"}, {"score": 0.00376409764683147, "phrase": "wosc_conferences"}, {"score": 0.0032697271890542753, "phrase": "cybernetics"}, {"score": 0.003007389443770562, "phrase": "social_scientists"}, {"score": 0.0029161225023394363, "phrase": "cybernetic_approach"}, {"score": 0.002890557197908352, "phrase": "social_systems"}, {"score": 0.0028652153774536967, "phrase": "social_processes"}, {"score": 0.002646880721119838, "phrase": "social_problems"}, {"score": 0.0023604768913655463, "phrase": "oil_social_cybernetics"}, {"score": 0.0021049977753042253, "phrase": "social_science"}], "paper_keywords": ["Cybernetics", " Social processes", " Social problems"], "paper_abstract": "Purpose - The purpose of this paper is to sketch the most valuable contribution of Dr Rose to the development of social cybernetics over the period 1975-1995. Design/methodology/approach The paper is based on an analysis of the proceedings of the sections on \"Social Systems\" or \"Social Cybernetics\" of the WOSC conferences from 1978 through 1991, and on an analysis of the entries of the Bibliography on Social Cybernetics (1998). Findings - The sections on \"Social Systems\" of the International Congresses on Systems and Cybernetics, initiated by Dr Rose, provided in the period 1978-1995 the most important meeting point for social scientists aiming at the application of the cybernetic approach to social systems and social processes, and for cyberneticians wanting to use the principles of cybernetics for the analysis and solution of social problems. Originality/value - The paper shows how the journal Kybernetes, founded by Dr Rose, became the most frequently used publication medium of social cyberneticians: of the 184 papers oil social cybernetics mentioned in this bibliography 76 (41 per cent) were published in Kybernetes, more than in any other journal in the domain of cybernetics or social science.", "paper_title": "John Rose and the early years of sociocybernetics", "paper_id": "WOS:000264459300010"}