{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "discrete_material_manufacturing_system"}, {"score": 0.0043080553835735825, "phrase": "finite_capacity"}, {"score": 0.00347574024760684, "phrase": "new_way"}, {"score": 0.0028487656293168795, "phrase": "recursive_algorithm"}, {"score": 0.0028037753646260937, "phrase": "transition_matrix"}, {"score": 0.002726740692380339, "phrase": "intermediate_buffer_capacity"}, {"score": 0.002548331088496964, "phrase": "numerical_results"}, {"score": 0.0024006068621542642, "phrase": "proposed_model"}, {"score": 0.0023439376937579204, "phrase": "decomposition_block"}, {"score": 0.002316105585203396, "phrase": "large_flow_lines"}, {"score": 0.002225691463551672, "phrase": "quality_inspections"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["flow/production lines", " merge operations", " operation-dependent failures", " idleness failures", " performance evaluation"], "paper_abstract": "This paper examines a discrete material manufacturing system consisting of three machines that are subject to breakdown and one buffer of finite capacity. It is assumed that the buffer has two immediate preceding machines performing the same operations and one immediate succeeding machine receiving material from the buffer. When the buffer reaches its own capacity, one of the two preceding machines has priority over the other to dispose its processed part into the buffer. It is also assumed that there is a new way of the machines reaching failure, by allowing the machines to fail not only when they are operational but also when are either blocked or starved. The latter gives rise to the possibility of modeling the production of more than one part types. The model is solved analytically by developing a recursive algorithm that generates the transition matrix for any value C of the intermediate buffer capacity. Then various performance measures of the system (e.g., throughput) can be easily evaluated. Numerical results for the throughput are also given and these are compared against simulation. The proposed model may be used as a decomposition block to solve large flow lines with merge/split operations (for example, flow lines with quality inspections and rework loops) and multiple part types. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Markovian analysis of a discrete material manufacturing system with merge operations, operation-dependent and idleness failures", "paper_id": "WOS:000241688300010"}