{"auto_keywords": [{"score": 0.05007645674830499, "phrase": "information_services_development"}, {"score": 0.04413298285224641, "phrase": "noaa"}, {"score": 0.03485587413712249, "phrase": "coevolutionary_view"}, {"score": 0.004366387782457736, "phrase": "case_study"}, {"score": 0.004037694641919865, "phrase": "theoretical_constructs"}, {"score": 0.0037888687452790953, "phrase": "critical_domains"}, {"score": 0.0036792371574197826, "phrase": "emerging_process"}, {"score": 0.0036434002236454305, "phrase": "information_service_development"}, {"score": 0.0034524248924699985, "phrase": "information_services"}, {"score": 0.003239549357111286, "phrase": "distinct_yet_interdependent_domains"}, {"score": 0.0029086869572567072, "phrase": "service_interactions"}, {"score": 0.002769650208851401, "phrase": "service_processes"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Information Services", " Development of Information Systems", " Coevolution Theory", " Case Study Research"], "paper_abstract": "This study investigates the process of information services development based on a case study of the experience of the U. S. National Oceanic and Atmospheric Administration (NOAA). In this study, we develop theoretical constructs that can inform researchers and practitioners on (1) what the critical domains and interactions associated with the emerging process of information service development at these organizations were, and (2) how information services at NOAA evolved over time? Adopting a coevolutionary view, we identified distinct yet interdependent domains that affected, and were affected by, the information services development process; these were: (1) services choreography, through which service interactions and collaborations are managed; (2) services orchestration, through which service processes are selected and interact; and (3) services instrumentation, by which services are developed and architected. Using the coevolutionary view, we uncovered three adaptive principles that explain the interplay among domains and interactions over time: adaptive tensions, requisite variety, and modular design. We discuss our findings' implications for research and practice and offer propositions for future research.", "paper_title": "A Coevolutionary View of Information Services Development: Lessons from the US National Oceanic and Atmospheric Administration", "paper_id": "WOS:000345063900002"}