{"auto_keywords": [{"score": 0.04111439906631511, "phrase": "closure_operator"}, {"score": 0.012421384716028864, "phrase": "network_coding"}, {"score": 0.004677965073019951, "phrase": "new_technique"}, {"score": 0.004512175937946914, "phrase": "intermediate_nodes"}, {"score": 0.004320932773749168, "phrase": "network_coding_solvability_problem"}, {"score": 0.004034504342397309, "phrase": "new_approach"}, {"score": 0.003808024029417427, "phrase": "network_coding_instance"}, {"score": 0.0034918342672996066, "phrase": "network_coding_problem"}, {"score": 0.0034293295415901807, "phrase": "so-called_solution"}, {"score": 0.0033076455392068095, "phrase": "closure_solvability_problem"}, {"score": 0.0032018141503341365, "phrase": "secret-sharing_matroids"}, {"score": 0.002852134080296829, "phrase": "linear_functions"}, {"score": 0.002790940765338191, "phrase": "alternative_proof"}, {"score": 0.002634084319025334, "phrase": "sufficiently_large_alphabets"}, {"score": 0.0025962638592454974, "phrase": "singular_properties"}, {"score": 0.0023718560142554634, "phrase": "new_way"}, {"score": 0.00232935232323113, "phrase": "useless_nodes"}, {"score": 0.002238500096284007, "phrase": "network_sharing"}, {"score": 0.002158979137177815, "phrase": "solvable_network_coding_instance"}, {"score": 0.0021202820950055193, "phrase": "guessing_graph_approach"}, {"score": 0.0021049977753042253, "phrase": "network_coding_solvability"}], "paper_keywords": ["Closure operators", " guessing games", " matroids", " network coding", " secret sharing"], "paper_abstract": "Network coding is a new technique to transmit data through a network by letting the intermediate nodes combine the packets they receive. Given a network, the network coding solvability problem decides whether all the packets requested by the destinations can be transmitted. In this paper, we introduce a new approach to this problem. We define a closure operator on a digraph closely related to the network coding instance and we show that the constraints for network coding can all be expressed according to that closure operator. Thus, a solution for the network coding problem is equivalent to a so-called solution of the closure operator. We can then define the closure solvability problem in general, which surprisingly reduces to finding secret-sharing matroids when the closure operator is a matroid. Based on this reformulation, we can easily prove that any multiple unicast where each node receives at least as many arcs as there are sources solvable by linear functions. We also give an alternative proof that any nontrivial multiple unicast with two source-receiver pairs is always solvable over all sufficiently large alphabets. Based on singular properties of the closure operator, we are able to generalize the way in which networks can be split into two distinct parts; we also provide a new way of identifying and removing useless nodes in a network. We also introduce the concept of network sharing, where one solvable network can be used to accommodate another solvable network coding instance. Finally, the guessing graph approach to network coding solvability is generalized to any closure operator, which yields bounds on the amount of information that can be transmitted through a network.", "paper_title": "Closure Solvability for Network Coding and Secret Sharing", "paper_id": "WOS:000327594500005"}