{"auto_keywords": [{"score": 0.04813254873980984, "phrase": "interactive_training"}, {"score": 0.00481495049065317, "phrase": "assisted_annotation"}, {"score": 0.004781777766309739, "phrase": "medical_free_text"}, {"score": 0.004477765573115626, "phrase": "clinical_document_corpus"}, {"score": 0.0043106348117582915, "phrase": "raptat"}, {"score": 0.004193000200816171, "phrase": "iteratively_pre-annotating_probable_phrases"}, {"score": 0.003912712778141845, "phrase": "corrected_annotations"}, {"score": 0.003858936100805083, "phrase": "pre-annotating_subsequent_documents"}, {"score": 0.003740615400423586, "phrase": "raptat_assistance"}, {"score": 0.0036259093827331725, "phrase": "heart_failure_treatment"}, {"score": 0.0033951334049808733, "phrase": "correct_raptat_pre-annotations"}, {"score": 0.0031789986177545586, "phrase": "annotation_rate"}, {"score": 0.003102875178186416, "phrase": "assisted_but_not_manual_reviewers"}, {"score": 0.0030814613175385703, "phrase": "pre-annotation_f-measure"}, {"score": 0.002956037056206635, "phrase": "assisted_reviewer"}, {"score": 0.0028161281608563267, "phrase": "inter-annotator_agreement"}, {"score": 0.0027677775883341556, "phrase": "raptat-assisted_reviewers"}, {"score": 0.0027108484507501907, "phrase": "manual_reviewers"}, {"score": 0.00246877952076635, "phrase": "increased_rate"}, {"score": 0.0023114798074455453, "phrase": "annotation_process"}, {"score": 0.0022250240576349267, "phrase": "conclusions_pre-annotations"}, {"score": 0.0021049977753042253, "phrase": "annotated_document_corpus"}], "paper_keywords": [""], "paper_abstract": "Objective To determine whether assisted annotation using interactive training can reduce the time required to annotate a clinical document corpus without introducing bias. Materials and methods A tool, RapTAT, was designed to assist annotation by iteratively pre-annotating probable phrases of interest within a document, presenting the annotations to a reviewer for correction, and then using the corrected annotations for further machine learning-based training before pre-annotating subsequent documents. Annotators reviewed 404 clinical notes either manually or using RapTAT assistance for concepts related to quality of care during heart failure treatment. Notes were divided into 20 batches of 19-21 documents for iterative annotation and training. Results The number of correct RapTAT pre-annotations increased significantly and annotation time per batch decreased by similar to 50% over the course of annotation. Annotation rate increased from batch to batch for assisted but not manual reviewers. Pre-annotation F-measure increased from 0.5 to 0.6 to >0.80 (relative to both assisted reviewer and reference annotations) over the first three batches and more slowly thereafter. Overall inter-annotator agreement was significantly higher between RapTAT-assisted reviewers (0.89) than between manual reviewers (0.85). Discussion The tool reduced workload by decreasing the number of annotations needing to be added and helping reviewers to annotate at an increased rate. Agreement between the pre-annotations and reference standard, and agreement between the pre-annotations and assisted annotations, were similar throughout the annotation process, which suggests that pre-annotation did not introduce bias. Conclusions Pre-annotations generated by a tool capable of interactive training can reduce the time required to create an annotated document corpus by up to 50%.", "paper_title": "Assisted annotation of medical free text using RapTAT", "paper_id": "WOS:000340581400011"}