{"auto_keywords": [{"score": 0.04815934080538031, "phrase": "china"}, {"score": 0.015529391140812164, "phrase": "mobile_commerce"}, {"score": 0.014974022350341483, "phrase": "malaysia"}, {"score": 0.009049627782993905, "phrase": "social_influence"}, {"score": 0.00481495049065317, "phrase": "consumer_decisions"}, {"score": 0.004509919457793852, "phrase": "wireless_communications"}, {"score": 0.004364696693320128, "phrase": "mobile_devices"}, {"score": 0.003956379470617348, "phrase": "consumer_intention"}, {"score": 0.003751331782523201, "phrase": "traditional_technology_acceptance_model"}, {"score": 0.003145609726536791, "phrase": "prediction_model"}, {"score": 0.002970260970134645, "phrase": "hierarchical_regression_analysis"}, {"score": 0.002898127432512101, "phrase": "research_model"}, {"score": 0.0026482660253173075, "phrase": "malaysian_consumer_decisions"}, {"score": 0.002480154140902474, "phrase": "chinese_consumer_decisions"}, {"score": 0.0023514343164101332, "phrase": "traditional_tam_and_doi_models"}, {"score": 0.00219311232069446, "phrase": "telecommunication_and_m-commerce_companies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["M-commerce", " Technology acceptance model (TAM)", " Consumer behaviour", " Hierarchical regression analysis"], "paper_abstract": "Advancements in wireless communications have increased the number of people using mobile devices, and have accelerated the growth of mobile commerce (m-commerce). This study aims to investigate the factors that predict consumer intention to adopt m-commerce in Malaysia and China. The work extends the traditional technology acceptance model (TAM) and diffusion of innovation (DOI) model, and includes additional variables such as trust, cost, social influence, variety of services, and control variables such as age, educational level, and gender of consumers. By comparing consumers from both Malaysia and China, this research is able to form a prediction model based on two different cultural settings. Data was collected from 172 Malaysian consumers and 222 Chinese consumers, and hierarchical regression analysis was employed to test the research model. The results showed that age, trust, cost, social influence, and variety of services are able to predict Malaysian consumer decisions to adopt m-commerce. Trust, cost, and social influence can be used to predict Chinese consumer decisions to adopt m-commerce. This research confirms the need to extend the traditional TAM and DOI models when studying technology such as m-commerce. The results from this study will be useful for telecommunication and m-commerce companies in formulating marketing strategies. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Predicting consumer decisions to adopt mobile commerce: Cross country empirical examination between China and Malaysia", "paper_id": "WOS:000302982300004"}