{"auto_keywords": [{"score": 0.04944030351578305, "phrase": "metabolism_models"}, {"score": 0.049124089120586543, "phrase": "region-resolution_data"}, {"score": 0.004442032546224076, "phrase": "fda-approved_drugs"}, {"score": 0.0038964032225585117, "phrase": "molecule's_sites"}, {"score": 0.0037297918570822876, "phrase": "lower_resolution"}, {"score": 0.003679969180334367, "phrase": "exact_site"}, {"score": 0.0033156708990372047, "phrase": "region-_resolution_data"}, {"score": 0.003227643104496149, "phrase": "xenosite-region"}, {"score": 0.003152531962718477, "phrase": "training_site"}, {"score": 0.0030278017562213265, "phrase": "expectation_maximization_algorithm"}, {"score": 0.0029473940028924748, "phrase": "metabolism_model"}, {"score": 0.002927626967420519, "phrase": "region-resolution_metabolism_data"}, {"score": 0.002878785759716458, "phrase": "large_site-of-metabolism_dataset"}, {"score": 0.0025332005503938947, "phrase": "atom-resolution_data"}, {"score": 0.0022668507535947976, "phrase": "applicable_domain"}, {"score": 0.002251637552201872, "phrase": "site-of-metabolism_models"}, {"score": 0.002214048743052355, "phrase": "chemical_space"}, {"score": 0.0021770860717929192, "phrase": "critical_need"}, {"score": 0.0021624739899833868, "phrase": "drug_development"}, {"score": 0.0021335427588412056, "phrase": "underutilized_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: Cytochrome P450s are a family of enzymes responsible for the metabolism of approximately 90% of FDA-approved drugs. Medicinal chemists often want to know which atoms of a molecule- its metabolized sites-are oxidized by Cytochrome P450s in order to modify their metabolism. Consequently, there are several methods that use literature-derived, atom-resolution data to train models that can predict a molecule's sites of metabolism. There is, however, much more data available at a lower resolution, where the exact site of metabolism is not known, but the region of the molecule that is oxidized is known. Until now, no site-of-metabolism models made use of region- resolution data. Results: Here, we describe XenoSite-Region, the first reported method for training site-of-metabolism models with region-resolution data. Our approach uses the Expectation Maximization algorithm to train a site-of-metabolism model. Region-resolution metabolism data was simulated from a large site-of-metabolism dataset, containing 2000 molecules with 3400 metabolized and 30 000 un-metabolized sites and covering nine Cytochrome P450 isozymes. When training on the same molecules (but with only region-level information), we find that this approach yields models almost as accurate as models trained with atom-resolution data. Moreover, we find that atom-resolution trained models are more accurate when also trained with region-resolution data from additional molecules. Our approach, therefore, opens up a way to extend the applicable domain of site-of-metabolism models into larger regions of chemical space. This meets a critical need in drug development by tapping into underutilized data commonly available in most large drug companies.", "paper_title": "Extending P450 site-of-metabolism models with region-resolution data", "paper_id": "WOS:000356625700055"}