{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "complex_networks"}, {"score": 0.004712988631183401, "phrase": "graph-theoretic_property"}, {"score": 0.004573842508130535, "phrase": "key_role"}, {"score": 0.0041984140090404985, "phrase": "previous_work"}, {"score": 0.003988055287053139, "phrase": "sufficiently_large_r"}, {"score": 0.0037398106866046972, "phrase": "adversarial_manner"}, {"score": 0.0032050528424273994, "phrase": "stronger_indicator"}, {"score": 0.003177687211289478, "phrase": "structural_robustness"}, {"score": 0.003137074867443131, "phrase": "traditional_metric"}, {"score": 0.0031102878400698143, "phrase": "graph_connectivity"}, {"score": 0.0029416448256236057, "phrase": "common_random_graph_models"}, {"score": 0.0027230880516264685, "phrase": "erdos-renyi_graphs"}, {"score": 0.002575385171755899, "phrase": "new_in-sights"}, {"score": 0.0023233800372985686, "phrase": "aforementioned_random_graphs"}, {"score": 0.0021049977753042253, "phrase": "specified_extent"}], "paper_keywords": ["Complex networks", " dynamics on networks", " matching cut", " random graphs", " resilient consensus", " robustness"], "paper_abstract": "We consider a graph-theoretic property known as r-robustness which plays a key role in a class of consensus (or opinion) dynamics where each node ignores its most extreme neighbors when updating its state. Previous work has shown that if the graph is r-robust for sufficiently large r, then such dynamics will lead to consensus even when some nodes behave in an adversarial manner. The property of r-robustness also guarantees that the network will remain connected even if a certain number of nodes are removed from the neighborhood of every node in the network and thus it is a stronger indicator of structural robustness than the traditional metric of graph connectivity. In this paper, we study this notion of robustness in common random graph models for complex networks; we show that the properties of robustness and connectivity share the same threshold function in Erdos-Renyi graphs, and have the same values in 1-D geometric graphs and certain preferential attachment networks. This provides new in-sights into the structure of such networks, and shows that they will be conducive to the types of dynamics described before. Although the aforementioned random graphs are inherently robust, we also show that it is coNP-complete to determine whether any given graph is robust to a specified extent.", "paper_title": "A Notion of Robustness in Complex Networks", "paper_id": "WOS:000365086400009"}