{"auto_keywords": [{"score": 0.049014830901543946, "phrase": "drought_periods"}, {"score": 0.027890420812896468, "phrase": "water_security"}, {"score": 0.022377422573524566, "phrase": "weight_coefficients"}, {"score": 0.022131669265682184, "phrase": "different_risk_indices"}, {"score": 0.015719716506582538, "phrase": "risk_assessment"}, {"score": 0.008378862304868074, "phrase": "entropy_weight_methods"}, {"score": 0.006438215024076561, "phrase": "entropy_weight_method"}, {"score": 0.004577440795549049, "phrase": "purpose_-_the_purpose"}, {"score": 0.004469009223640383, "phrase": "water_resources_managers"}, {"score": 0.004400804926266097, "phrase": "risk_indicators"}, {"score": 0.0036347979916389467, "phrase": "conventional_procedures"}, {"score": 0.0031223774204093713, "phrase": "case_study"}, {"score": 0.0026971491199975083, "phrase": "main_limitations"}, {"score": 0.0022145052062614514, "phrase": "hazard_entropy"}, {"score": 0.0021049977753042253, "phrase": "relative_researchers"}], "paper_keywords": ["Cybernetics", " Water supply", " Risk assessment", " Systems"], "paper_abstract": "Purpose - The purpose of this paper is to obtain risk indicators of water security of drought periods in which the indices of reliability, resiliency, and vulnerability are integrated. Design/methodology/approach - It is not reasonable that weight coefficients of different risk indices are often determined subjectively in conventional procedures, so the entropy weight method is introduced and chosen to solve the problem. Entropy weight method can get the weight coefficients of different risk indices objectively and is valid from the case study. Findings - The feasibility and validity of entropy weight methods to determine weight coefficients of different risk indices objectively are recognized. Research limitations/implications - Accessibility and availability of data are the main limitations. Practical implications - The paper provides a more objective risk indicator of water security of drought periods for water resources managers. Originality/value - This paper determines the weight coefficients of different risk indices for risk assessment of water security of drought periods based on hazard entropy. The paper is aimed at water resources managers and relative researchers, especially those who deal with risk assessment of water security of drought periods.", "paper_title": "Study on risk assessment of water security of drought periods based on entropy weight methods", "paper_id": "WOS:000280732800003"}