{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "elderly_and_disabled_people"}, {"score": 0.004598933498016774, "phrase": "indoor_location"}, {"score": 0.004303830426772906, "phrase": "location_information"}, {"score": 0.0038271712887391015, "phrase": "innovative_services"}, {"score": 0.0033685408148574876, "phrase": "application_requirements"}, {"score": 0.0030569913145731408, "phrase": "wide_multicell_coverage"}, {"score": 0.003025915966640355, "phrase": "easy_extension"}, {"score": 0.002949598537993663, "phrase": "crowded_scenarios"}, {"score": 0.0029196116767956273, "phrase": "different_levels"}, {"score": 0.002831462722290752, "phrase": "user's_profile_and_service_requirements"}, {"score": 0.0021928922429377087, "phrase": "zaragoza"}, {"score": 0.0021706811757182783, "phrase": "spain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["LBS", " elderly and disabled people", " monitoring", " ZigBee", " ultrasound"], "paper_abstract": "Many techniques have been developed to perform indoor location. Each strategy has its own advantages and drawbacks, with the application demanding location information the main determinant of the system to be used. In this paper, a system is presented that serves location to innovative services for elderly and disabled people, ranging from alarm and monitoring to support for navigation and leisure. The system uses ZigBee and ultrasound to fulfill the application requirements, differing in this respect from all other existing systems. ZUPS (ZigBee and ultrasound positioning system) provides wide multicell coverage, easy extension, robustness even in crowded scenarios, different levels of precision depending on the user's profile and service requirements (from a few centimeters to meters), limited infrastructure requirements, simple calibration, and cost-effectiveness. The system has been evaluated from the technical, functional, and usability standpoints, with satisfactory results, and its suitability has also been demonstrated in a residence for people with disabilities located in Zaragoza, Spain. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Location-based services for elderly and disabled people", "paper_id": "WOS:000255720300002"}