{"auto_keywords": [{"score": 0.047916548037392724, "phrase": "protein_complexes"}, {"score": 0.03509315270003924, "phrase": "pcia"}, {"score": 0.007421015571602738, "phrase": "ppi_network"}, {"score": 0.0062671812167689476, "phrase": "association_measure"}, {"score": 0.00481495049065317, "phrase": "protein_complex"}, {"score": 0.004741395005218184, "phrase": "ppi_networks"}, {"score": 0.004550669123303854, "phrase": "protein-protein_interaction"}, {"score": 0.0043452175611323335, "phrase": "network_topologies"}, {"score": 0.00368673793612343, "phrase": "pcia_algorithm"}, {"score": 0.0034663083890589235, "phrase": "identification_process"}, {"score": 0.0030798711656591948, "phrase": "gene_ontology_databases"}, {"score": 0.0027646829399573434, "phrase": "interacting_proteins"}, {"score": 0.002468938912850425, "phrase": "dense_graph_clusters"}, {"score": 0.002250601866422547, "phrase": "real_data"}, {"score": 0.0022275639370573264, "phrase": "experimental_results"}], "paper_keywords": ["PPI networks", " graph clustering", " protein complex", " gene ontology", " Markov clustering"], "paper_abstract": "Many computational approaches developed to identify protein complexes in protein-protein interaction (PPI) networks perform their tasks based only on network topologies. The attributes of the proteins in the networks are usually ignored. As protein attributes within a complex may also be related to each other, we have developed a PCIA algorithm to take into consideration both such information and network topology in the identification process of protein complexes. Given a PPI network, PCIA first finds information about the attributes of the proteins in a PPI network in the Gene Ontology databases and uses such information for the identification of protein complexes. PCIA then computes a Degree of Association measure for each pair of interacting proteins to quantitatively determine how much their attribute values associate with each other. Based on this association measure, PCIA is able to discover dense graph clusters consisting of proteins whose attribute values are significantly closer associated with each other. PCIA has been tested with real data and experimental results seem to indicate that attributes of the proteins in the same complex do have some association with each other and, therefore, that protein complexes can be more accurately identified when protein attributes are taken into consideration.", "paper_title": "Utilizing Both Topological and Attribute Information for Protein Complex Identification in PPI Networks", "paper_id": "WOS:000326552800021"}