{"auto_keywords": [{"score": 0.04852232688729349, "phrase": "sharp_features"}, {"score": 0.004917175797020876, "phrase": "base_mesh"}, {"score": 0.004201202199968683, "phrase": "traditional_denoising_methods"}, {"score": 0.0041666157975446564, "phrase": "filtering_operators"}, {"score": 0.0036653985479652854, "phrase": "differential_properties"}, {"score": 0.003473529187092258, "phrase": "discrete_surfaces"}, {"score": 0.003093595537995837, "phrase": "first_phase"}, {"score": 0.0029928611380840757, "phrase": "input_noisy_data"}, {"score": 0.0029559346879594254, "phrase": "global_laplacian_regularization_denoising_scheme"}, {"score": 0.0029194625087935345, "phrase": "estimated_base_mesh"}, {"score": 0.0028243822059448266, "phrase": "true_underlying_surface"}, {"score": 0.002755104031926742, "phrase": "sample_size"}, {"score": 0.002676418520290942, "phrase": "second_phase"}, {"score": 0.0024842242921857705, "phrase": "input_mesh"}, {"score": 0.0023346234464901978, "phrase": "coherent_dictionary"}, {"score": 0.0022773309395419427, "phrase": "pseudo-_inverse_matrix"}, {"score": 0.0021401625519713577, "phrase": "progressive_way"}, {"score": 0.002122507495446441, "phrase": "theoretical_analysis"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Denoising", " asymptotic optimality", " sharp feature", " l(1)-analysis compressed sensing", " Algorithms", " Theory"], "paper_abstract": "Many geometry processing applications are sensitive to noise and sharp features. Although there are a number of works on detecting noise and sharp features in the literature, they are heuristic. On one hand, traditional denoising methods use filtering operators to remove noise, however, they may blur sharp features and shrink the object. On the other hand, noise makes detection of features, which relies on computation of differential properties, unreliable and unstable. Therefore, detecting noise and features on discrete surfaces still remains challenging. In this article, we present an approach for decoupling noise and features on 3D shapes. Our approach consists of two phases. In the first phase, a base mesh is estimated from the input noisy data by a global Laplacian regularization denoising scheme. The estimated base mesh is guaranteed to asymptotically converge to the true underlying surface with probability one as the sample size goes to infinity. In the second phase, an l1-analysis compressed sensing optimization is proposed to recover sharp features from the residual between base mesh and input mesh. This is based on our discovery that sharp features can be sparsely represented in some coherent dictionary which is constructed by the pseudo- inverse matrix of the Laplacian of the shape. The features are recovered from the residual in a progressive way. Theoretical analysis and experimental results show that our approach can reliably and robustly remove noise and extract sharp features on 3D shapes.", "paper_title": "Decoupling Noise and Features via Weighted l(1)-Analysis Compressed Sensing", "paper_id": "WOS:000335009900006"}