{"auto_keywords": [{"score": 0.04819193630515393, "phrase": "cirquent_calculus"}, {"score": 0.007740489563401459, "phrase": "computational_complexity"}, {"score": 0.004772137871562584, "phrase": "propositional_cirquent_calculus."}, {"score": 0.004666757288965372, "phrase": "japaridze"}, {"score": 0.004523103062368843, "phrase": "sequent_calculus"}, {"score": 0.004081385289516914, "phrase": "wore_traditional_prool-theoretie_approaches"}, {"score": 0.004027031316965272, "phrase": "tree-like_objects"}, {"score": 0.0037827603118271757, "phrase": "circuit-style_structures"}, {"score": 0.0032059442984238664, "phrase": "abstract_resource_semantics"}, {"score": 0.003177392642813126, "phrase": "tilts_semantics"}, {"score": 0.0030520148188164084, "phrase": "resource_provider"}, {"score": 0.0030113280682863234, "phrase": "resource_user"}, {"score": 0.002716844480081738, "phrase": "computability_logic"}, {"score": 0.0026095920086044145, "phrase": "so-called_\"classical\"_rules"}, {"score": 0.0024953686545818587, "phrase": "particularly_troublesome_contraction_rule"}, {"score": 0.0021526564019119466, "phrase": "duplication_rule"}, {"score": 0.0021334650920198715, "phrase": "polynomial_size_proofs"}, {"score": 0.0021051695604409034, "phrase": "np"}], "paper_keywords": ["cirquent calculus", " computability logic", " resource semantics", " proof theory", " substructural logics"], "paper_abstract": "Introduced in 2006 by Japaridze, cirquent calculus is a refinement of sequent calculus. The advent of cirquent calculus arose from the need for a, deductive system with a, more explicit, ability to reason about resources. Unlike the wore traditional prool-theoretie approaches that manipulate tree-like objects (formulas, sequents, etc.), cirquent calculus is based on circuit-style structures called cirquents, in which different peer (sibling, cousin, etc.) substructures may share components. It is this resource sharing mechanism to which cirquent calculus owes its novelty (and its virtues). From its inception, cirquent calculus has been paired with an abstract resource semantics. Tilts semantics allows for reasoning about the interaction between a resource provider and a resource user, where resources are understood in the their most, general and intuitive sense. Interpreting resources in a more restricted computational sense has made cirquent calculus instrumental in axiomatizing various fundamental fragments of Computability Logic, a formal theory of (interactive) computability. The so-called \"classical\" rules of cirquent calculus, in the absence of the particularly troublesome contraction rule, produce a, sound and complete system CL5 for Computability Logic. In this paper, we investigate the computational complexity of CL5, showing it is Sigma(P)(2)-complete. We also show that CL5 without the duplication rule has polynomial size proofs and is NP-complete.", "paper_title": "THE COMPUTATIONAL COMPLEXITY OF PROPOSITIONAL CIRQUENT CALCULUS", "paper_id": "WOS:000353193000005"}