{"auto_keywords": [{"score": 0.048992899974696226, "phrase": "pca"}, {"score": 0.01571843892559742, "phrase": "partial_supervision"}, {"score": 0.012665341632070342, "phrase": "unlabeled_data"}, {"score": 0.011694803638776747, "phrase": "pairwise_constraints"}, {"score": 0.004760017604908536, "phrase": "principal_component_analysis"}, {"score": 0.004342430078306461, "phrase": "global_covariance_structure"}, {"score": 0.003916098498242888, "phrase": "large_amount"}, {"score": 0.0032398798149196432, "phrase": "useful_discriminant_information"}, {"score": 0.00298942278888105, "phrase": "linear_discriminant_analysis_perform"}, {"score": 0.0025892330566358503, "phrase": "discriminant_power"}, {"score": 0.0023480892503414596, "phrase": "derived_dpca_algorithm"}, {"score": 0.002268441347979241, "phrase": "closed_form_solution"}, {"score": 0.0022424956516376073, "phrase": "experimental_results"}, {"score": 0.002191489192077851, "phrase": "face_data_sets"}, {"score": 0.002153995991751527, "phrase": "dpca"}], "paper_keywords": ["Principal component analysis (PCA)", " Discriminant PCA", " Dimensionality reduction", " Semi-supervised dimensionality reduction", " Partial supervision"], "paper_abstract": "Principal component analysis (PCA) is one of the most widely used unsupervised dimensionality reduction methods in pattern recognition. It preserves the global covariance structure of data when labels of data are not available. However, in many practical applications, besides the large amount of unlabeled data, it is also possible to obtain partial supervision such as a few labeled data and pairwise constraints, which contain much more valuable information for discrimination than unlabeled data. Unfortunately, PCA cannot utilize that useful discriminant information effectively. On the other hand, traditional supervised dimensionality reduction methods such as linear discriminant analysis perform on only labeled data. When labeled data are insufficient, their performances will deteriorate. In this paper, we propose a novel discriminant PCA (DPCA) model to boost the discriminant power of PCA when both unlabeled and labeled data as well as pairwise constraints are available. The derived DPCA algorithm is efficient and has a closed form solution. Experimental results on several UCI and face data sets show that DPCA is superior to several established dimensionality reduction methods.", "paper_title": "A New Discriminant Principal Component Analysis Method with Partial Supervision", "paper_id": "WOS:000269919100003"}