{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "predator-prey_cellular_automaton"}, {"score": 0.0047013405841819025, "phrase": "stochastic_approach"}, {"score": 0.0036494864560524735, "phrase": "probabilistic_cellular_automaton"}, {"score": 0.0035462807506718578, "phrase": "local_rules"}, {"score": 0.003222814590544802, "phrase": "computational_simulations"}, {"score": 0.002845883666777154, "phrase": "state_and_active_states"}, {"score": 0.002661474607275484, "phrase": "stationary_regime"}, {"score": 0.00263612191603326, "phrase": "population_densities"}, {"score": 0.002537097217899195, "phrase": "active_state"}, {"score": 0.002488985155689794, "phrase": "local_coupled_time_oscillations"}, {"score": 0.0023613185213421173, "phrase": "self-organized_structures"}, {"score": 0.002327648608736437, "phrase": "spatio-temporal_dynamics"}, {"score": 0.0022509365210787993, "phrase": "distinct_spatial_patterns"}, {"score": 0.0021049977753042253, "phrase": "time_coexistence_behavior"}], "paper_keywords": ["cellular automata", " Lotka-Volterra", " spatial models", " stochastic models", " predator-prey", " spatio-temporal patterns", " self-organization"], "paper_abstract": "We present a stochastic approach to modeling the dynamics of coexistence of prey and predator populations. It is assumed that the space of coexistence is explicitly subdivided in a grid of cells. Each cell can be occupied by only one individual of each species or can be empty. The system evolves in time according to a probabilistic cellular automaton composed by a set of local rules which describe interactions between species individuals and mimic the process of birth, death and predation. By performing computational simulations, we found that, depending on the values of the parameters of the model, the following states can be reached: a prey absorbing state and active states of two types. In one of them both species coexist in a stationary regime with population densities constant in time. The other kind of active state is characterized by local coupled time oscillations of prey and predator populations. We focus on the self-organized structures arising from spatio-temporal dynamics of the coexistence. We identify distinct spatial patterns of prey and predators and verify that they are intimally connected to the time coexistence behavior of the species.", "paper_title": "Self-organized patterns of coexistence out of a predator-prey cellular automaton", "paper_id": "WOS:000243701900009"}