{"auto_keywords": [{"score": 0.04938419617030255, "phrase": "biomedical_ontologies"}, {"score": 0.02108050923207065, "phrase": "spatial_information"}, {"score": 0.009075953002980716, "phrase": "format_theory"}, {"score": 0.008944762744303511, "phrase": "location_relations"}, {"score": 0.00481495049065317, "phrase": "spatial_representation"}, {"score": 0.004524801966077539, "phrase": "formal_spatial_theory"}, {"score": 0.004426607895888934, "phrase": "important_tool"}, {"score": 0.003981106369547929, "phrase": "basic_inclusion_theory"}, {"score": 0.003541182515693916, "phrase": "extended_theory"}, {"score": 0.003528244907944199, "phrase": "basic_inclusion_theory_for_classes"}, {"score": 0.003303259489028193, "phrase": "logical_structure"}, {"score": 0.0031961879138783012, "phrase": "human_anatomy"}, {"score": 0.002981374991190142, "phrase": "galen"}, {"score": 0.002895291306821514, "phrase": "different_logical_properties"}, {"score": 0.0026419338604879404, "phrase": "consistent_automatic_reasoning"}, {"score": 0.0025562434609873335, "phrase": "precise_format_characterizations"}, {"score": 0.002500662348528587, "phrase": "biomedical_ontology"}, {"score": 0.002323953608863511, "phrase": "computational_environment"}, {"score": 0.002248553559414903, "phrase": "important_beginning_step"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["ontology knowledge", " representation", " anatomy", " mereology", " spatial reasoning"], "paper_abstract": "Objective The objective of this paper is to demonstrate how a formal spatial theory can be used as an important tool for disambiguating the spatial information embodied in biomedical ontologies and for enhancing their automatic reasoning capabilities. Method and materials This paper presents a format theory of parthood and location relations among individuals, called Basic Inclusion Theory (BIT). Since biomedical ontologies are comprised of assertions about classes of individuals (rather than assertions about individuals), we define parthood and location relations among classes in the extended theory Basic Inclusion Theory for Classes (BIT + Cl). We then demonstrate the usefulness of this format theory for making the logical structure of spatial information more precise in two ontologies concerned with human anatomy: the Foundational Model of Anatomy (FMA) and GALEN. Results We find that in both the FMA and GALEN, class-level spatial relations with different logical properties are not always explicitly distinguished. As a result, the spatial information included in these biomedical ontologies is often ambiguous and the possibilities for implementing consistent automatic reasoning within or across ontologies are limited. Conclusion Precise format characterizations of at[ spatial relations assumed by a biomedical ontology are necessary to ensure that the information embodied in the ontology can be fully and coherently utilized in a computational environment. This paper can be seen as an important beginning step toward achieving this goat, but much more work along these tines is required. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "A formal theory for spatial representation and reasoning in biomedical ontologies", "paper_id": "WOS:000235242000001"}