{"auto_keywords": [{"score": 0.049031285206733555, "phrase": "computing_utilities"}, {"score": 0.010985018032136324, "phrase": "computing_utility"}, {"score": 0.008713768692145013, "phrase": "unreliable_public_resources"}, {"score": 0.008372319530848752, "phrase": "public_resources"}, {"score": 0.004779564521350969, "phrase": "higher_profit"}, {"score": 0.004744437370338926, "phrase": "better_sla_compliance"}, {"score": 0.0045895181082906715, "phrase": "important_part"}, {"score": 0.004505638402009237, "phrase": "outsourcing_computer_services"}, {"score": 0.004231699728933577, "phrase": "service_level_agreements"}, {"score": 0.0040334640350288, "phrase": "major_objectives"}, {"score": 0.00388729255686046, "phrase": "customer_loyalty"}, {"score": 0.003390886284555397, "phrase": "sla_parameters"}, {"score": 0.003267925215811654, "phrase": "resultant_loss"}, {"score": 0.0031377955308198634, "phrase": "sla_management"}, {"score": 0.0029467742734417255, "phrase": "operating_conditions"}, {"score": 0.0026867260506696455, "phrase": "higher_levels"}, {"score": 0.00266693888510356, "phrase": "run_time_compliances"}, {"score": 0.002570162055835289, "phrase": "idle_cycles"}, {"score": 0.0024677487011556427, "phrase": "performance_gains"}, {"score": 0.002422552850701705, "phrase": "additional_financial_cost"}, {"score": 0.002317423416027688, "phrase": "wide_area_network"}, {"score": 0.0022005118194652704, "phrase": "scheduler_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["resource management", " scheduling", " service level agreement", " public computing utility"], "paper_abstract": "Computing utilities are emerging as an important part of the infrastructure for outsourcing computer services. Fundamental to outsourcing is the notion of quality of service, which is defined by service level agreements (SLAs) between the computing utilities and clients. One of the major objectives of computing utilities is to maximize their net profit. while maintaining customer loyalty. To achieve this objective, the computing utilities should meet or exceed their SLA constraints most of the time. Defining the SLAs conservatively might be one way of easily achieving these goals. However, by tuning the SLA parameters conservatively the computing utility might under utilize its resources with a resultant loss of revenue. Therefore, we can see two main issues with SLA management: designing SLAs competitively so that expected revenue for the computing utility is maximized and maintaining the operating conditions such that SLAs are satisfied with very high probability. In this paper, we show that inducting unreliable public resources into a computing utility enables more competitive SLAs while maintaining higher levels of run time compliances as well as maximizing profit. Our scheduling algorithms assume that idle cycles from public resources are available in plenty, therefore, the performance gains do not incur any additional financial cost. However, there is communication overhead when public resources from a wide area network is included. This overhead is kept to the minimum by enabling the scheduler work without any monitoring on the public resources. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Utilizing unreliable public resources for higher profit and better SLA compliance in computing utilities", "paper_id": "WOS:000238000800003"}