{"auto_keywords": [{"score": 0.04726196056959377, "phrase": "dssp"}, {"score": 0.006085583782316202, "phrase": "pssc"}, {"score": 0.00481495049065317, "phrase": "first_step"}, {"score": 0.004773476989344654, "phrase": "three-dimensional_protein_structure_description"}, {"score": 0.004671342094877447, "phrase": "secondary_structure"}, {"score": 0.00457138247462329, "phrase": "secondary_structure_assignment"}, {"score": 0.0043213410601860985, "phrase": "dssp_output"}, {"score": 0.004247180402119585, "phrase": "one-letter_representation"}, {"score": 0.004102639724186862, "phrase": "dssp's_internal_description"}, {"score": 0.003665874747419775, "phrase": "alternative_concept"}, {"score": 0.003602922164562919, "phrase": "internal_structure_characterization"}, {"score": 0.003525744120930142, "phrase": "eight-character_string"}, {"score": 0.003163878786694538, "phrase": "complicated_structural_features"}, {"score": 0.003109519872758431, "phrase": "ten_times_more_pi-helical_residues"}, {"score": 0.0030428787018636147, "phrase": "dssp."}, {"score": 0.002990592465417758, "phrase": "introduced_changes"}, {"score": 0.0029519664912853938, "phrase": "dssp_information"}, {"score": 0.0029012378668247397, "phrase": "better_clustering"}, {"score": 0.0028762004595878714, "phrase": "secondary_structures"}, {"score": 0.002637377202509382, "phrase": "complete_structure"}, {"score": 0.002266051712795851, "phrase": "new_secondary_structure_classification_schemes"}, {"score": 0.0021418339161425994, "phrase": "dssp_source_code"}], "paper_keywords": [""], "paper_abstract": "A first step toward three-dimensional protein structure description is the characterization of secondary structure. The most widely used program for secondary structure assignment remains DSSP, introduced in 1983, with currently more than 400 citations per year. DSSP output is in a one-letter representation, where much of the information on DSSP's internal description is lost. Recently it became evident that DSSP overlooks most pi-helical structures, which are more prevalent and important than anticipated before. We introduce an alternative concept, representing the internal structure characterization of DSSP as an eight-character string that is human-interpretable and easy to parse by software. We demonstrate how our protein secondary structure characterization (PSSC) code allows for inspection of complicated structural features. It recognizes ten times more pi-helical residues than does the standard DSSP. The plausibility of introduced changes in interpreting DSSP information is demonstrated by better clustering of secondary structures in (phi, psi) dihedral angle space. With a sliding sequence window (SSW), helical assignments with PSSC remain invariant compared with an assignment based on the complete structure. In contrast, assignment with DSSP can be changed by residues in the neighborhood that are in fact not interacting with the residue under consideration. We demonstrate how one can easily define new secondary structure classification schemes with PSSC and perform the classifications. Our approach works without changing the DSSP source code and allows for more detailed protein characterization.", "paper_title": "Protein Secondary Structure Classification Revisited: Processing DSSP Information with PSSC", "paper_id": "WOS:000339647000031"}