{"auto_keywords": [{"score": 0.03142486153468313, "phrase": "different_inlet_conditions"}, {"score": 0.00481495049065317, "phrase": "asymmetric_system"}, {"score": 0.004760206604601594, "phrase": "pulsating_flow"}, {"score": 0.004692647062494403, "phrase": "general_interest"}, {"score": 0.004639287230742552, "phrase": "human_body"}, {"score": 0.004508515162768118, "phrase": "blood_vessels"}, {"score": 0.004161553532799662, "phrase": "initial_manifestation"}, {"score": 0.0038743048063966242, "phrase": "direct_understanding"}, {"score": 0.003329010133725679, "phrase": "consecutive_symmetric_bifurcations"}, {"score": 0.0031527521377717215, "phrase": "mass_transport"}, {"score": 0.003081350558135612, "phrase": "physiological_situations"}, {"score": 0.003020197906532928, "phrase": "different_inlet_velocity_conditions"}, {"score": 0.002884925971272727, "phrase": "inflow_conditions"}, {"score": 0.002843905418937706, "phrase": "normal_physiological_conditions"}, {"score": 0.0027874519404992673, "phrase": "geometrical_asymmetry"}, {"score": 0.0027636009987260838, "phrase": "velocity_distribution"}, {"score": 0.0027321160319816458, "phrase": "second_bifurcation_downstream"}, {"score": 0.0026473647763997476, "phrase": "significant_effect"}, {"score": 0.0025578967205807843, "phrase": "next_generation"}, {"score": 0.0024856483031965118, "phrase": "peak_flow"}, {"score": 0.002347201580471729, "phrase": "mass_flow_distribution"}, {"score": 0.0022874367871565083, "phrase": "inlet_velocity_conditions"}, {"score": 0.0022484395042896284, "phrase": "passive_scalar"}, {"score": 0.002197473090354134, "phrase": "inlet_conditions"}, {"score": 0.0021786592967334506, "phrase": "schmidt_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Pulsating flow", " Bifurcation", " Mixing", " Secondary flow"], "paper_abstract": "Pulsating flow through bifurcations are of general interest. In the human body such flows are also very common; for example in blood vessels and the respiratory tract. The characteristics of the flow in arteries have been related to the process of atherogenesis, based on the observation that the initial manifestation of the process is observed at certain common locations, i.e., near bifurcations in vessels of certain size. Inspite of these observations there is no direct understanding between the flow itself and the pathological process. In fact, the flow itself is rather complex since it is unsteady and transitional. The paper considers both unsteady- and steady-flow through a three generation system of (non-symmetric) bifurcations. The geometry consists of a 90 degrees. bifurcation followed by two sets of consecutive symmetric bifurcations. The aim of the paper is to investigate the effects of the bifurcations on the flow and mass transport in such a geometrical configuration that is often found in physiological situations. Additionally, the effects of different inlet velocity conditions have been considered. The different inlet conditions are aimed at studying the sensitivity to variations of inflow conditions; variations found under normal physiological conditions. The results show that the geometrical asymmetry affects the velocity distribution even after a second bifurcation downstream. Two generations down this asymmetry does not have a significant effect any-more. The different inlet conditions affect the flow to the next generation of branches during parts of the cycle. At peak flow and further downstream in the system the effects are negligible. It is also found that over a cycle the mass flow distribution through the outlets can be affected by the inlet velocity conditions. The distribution of a passive scalar is not uniform but depends on the inlet conditions and the Schmidt number (i.e., molecular diffusion). (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Pulsating flow and mass transfer in an asymmetric system of bifurcations", "paper_id": "WOS:000293941100005"}