{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visual_attention_model"}, {"score": 0.007641499863938058, "phrase": "gaze_tracking_systems"}, {"score": 0.005805074903917493, "phrase": "uncertainty_window"}, {"score": 0.004621740602897318, "phrase": "gaze_tracker"}, {"score": 0.004379977556546879, "phrase": "visual_attention_models"}, {"score": 0.004323776691055635, "phrase": "selective_attention_part"}, {"score": 0.004268293864953256, "phrase": "human_visual_system"}, {"score": 0.004141575435071002, "phrase": "bottom-up_approach"}, {"score": 0.004088421020408183, "phrase": "saliency_map"}, {"score": 0.003933000051147382, "phrase": "attention_weight"}, {"score": 0.003531474887552889, "phrase": "gaze_tracker_accuracy"}, {"score": 0.003441352119167824, "phrase": "gaze_point"}, {"score": 0.0027622407190589326, "phrase": "main_contribution"}, {"score": 0.002668582249630492, "phrase": "promising_results"}, {"score": 0.0022749744354271816, "phrase": "selection_task"}, {"score": 0.002197801146305747, "phrase": "real-time_gaze_tracking_systems"}, {"score": 0.0021232402128269906, "phrase": "video_games"}, {"score": 0.0021049977753042253, "phrase": "virtual_reality_applications"}], "paper_keywords": ["gaze tracking", " visual attention model", " saliency", " first person navigation", " virtual environment"], "paper_abstract": "This paper introduces the use of a visual attention model to improve the accuracy of gaze tracking systems. Visual attention models simulate the selective attention part of the human visual system. For instance, in a bottom-up approach, a saliency map is defined for the image and gives an attention weight to every pixel of the image as a function of its colour, edge or intensity. Our algorithm uses an uncertainty window, defined by the gaze tracker accuracy, and located around the gaze point given by the tracker. Then, using a visual attention model, it searches for the most salient points, or objects, located inside this uncertainty window, and determines a novel, and hopefully, better gaze point. This combination of a gaze tracker together with a visual attention model is considered as the main contribution of the paper. We demonstrate the promising results of our method by presenting two experiments conducted in two different contexts: (1) a free exploration of a visually rich 3D virtual environment without a specific task, and (2) a video game based on gaze tracking involving a selection task. Our approach can be used to improve real-time gaze tracking systems in many interactive 3D applications such as video games or virtual reality applications. The use of a visual attention model can be adapted to any gaze tracker and the visual attention model can also be adapted to the application in which it is used.", "paper_title": "Using a Visual Attention Model to Improve Gaze Tracking Systems in Interactive 3D Applications", "paper_id": "WOS:000281853800008"}