{"auto_keywords": [{"score": 0.004894900777493661, "phrase": "mrets"}, {"score": 0.00481495049065317, "phrase": "requirements_engineering_techniques"}, {"score": 0.00473509474652851, "phrase": "software_projects"}, {"score": 0.004656557209439822, "phrase": "multidisciplinary_nature"}, {"score": 0.004625506452304716, "phrase": "requirements_engineering"}, {"score": 0.0044286400018187354, "phrase": "software_development"}, {"score": 0.0042543303585113965, "phrase": "personal_preference"}, {"score": 0.004225950334493496, "phrase": "existing_company_practice"}, {"score": 0.003388098723960553, "phrase": "actual_selection_process"}, {"score": 0.0032328778271536454, "phrase": "application_domain"}, {"score": 0.0032005497177523025, "phrase": "specific_project"}, {"score": 0.003168543855125077, "phrase": "great_importance"}, {"score": 0.0030847461428168614, "phrase": "requirements_engineering_techniques_selection"}, {"score": 0.0029631742332058087, "phrase": "suitable_re_techniques"}, {"score": 0.002808477620731167, "phrase": "requirements_engineers"}, {"score": 0.0026088355715432523, "phrase": "evaluation_schema"}, {"score": 0.0024396547357855777, "phrase": "objective_function"}, {"score": 0.002391067964886602, "phrase": "effective_decision_support_mechanism"}, {"score": 0.0022890828779208016, "phrase": "techniques_analysis"}, {"score": 0.0021987994275190314, "phrase": "software_engineering"}, {"score": 0.002140593237903078, "phrase": "proposed_methodology"}, {"score": 0.0021191645265024855, "phrase": "industrial_project"}, {"score": 0.0021049977753042253, "phrase": "preliminary_information"}], "paper_keywords": ["Requirements engineering", " Technique evaluation", " Decision support", " Clustering"], "paper_abstract": "The complexity of software projects as well as the multidisciplinary nature of requirements engineering (RE) requires developers to carefully select RE techniques and practices during software development. Nevertheless, the selection of RE techniques is usually based on personal preference or existing company practice rather than on characteristics of the project at hand. Furthermore, there is a lack of guidance on which techniques are suitable for a certain project context. So far, only a limited amount of research has been done regarding the selection of RE techniques based on the attributes of the project under development. The few approaches that currently exist for the selection of RE techniques provide only little guidance for the actual selection process. We believe that the evaluation of RE techniques in the context of an application domain and a specific project is of great importance. This paper describes a Methodology for Requirements Engineering Techniques Selection (MRETS) as an approach that helps requirements engineers select suitable RE techniques for the project at hand. The MRETS has three aspects: Firstly, it aids requirements engineers in establishing a link between the attributes of the project and the attributes of RE techniques. Secondly, based on the evaluation schema proposed in our research, MRETS provides an opportunity to analyze RE techniques in detail using clustering. Thirdly, the objective function used in our approach provides an effective decision support mechanism for the selection of RE techniques. This paper makes contributions to RE techniques analysis, the application of RE techniques in practice, RE research, and software engineering in general. The application of the proposed methodology to an industrial project provides preliminary information on the effectiveness of MRETS for the selection of RE techniques.", "paper_title": "A methodology for the selection of requirements engineering techniques", "paper_id": "WOS:000257383900006"}