{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "communication_tools"}, {"score": 0.038040599030405554, "phrase": "media_capabilities"}, {"score": 0.015435256974963694, "phrase": "media_synchronicity_theory"}, {"score": 0.0047707093928203, "phrase": "global_software_development_projects"}, {"score": 0.0046834372388970405, "phrase": "global_software_development"}, {"score": 0.004309968592440261, "phrase": "instant_messaging"}, {"score": 0.004077616905584829, "phrase": "different_tools"}, {"score": 0.004040123129261597, "phrase": "different_communication_needs"}, {"score": 0.0034528025626422154, "phrase": "symbol_variety"}, {"score": 0.0033121522432956836, "phrase": "mst"}, {"score": 0.003118942369691329, "phrase": "good_performance"}, {"score": 0.002991823455621222, "phrase": "communication_process"}, {"score": 0.0027784560880013886, "phrase": "gsd._we"}, {"score": 0.0025683581446365165, "phrase": "tool_use"}, {"score": 0.0024409345168575833, "phrase": "distributed_software_development"}, {"score": 0.0023741093119014436, "phrase": "five_media_properties"}, {"score": 0.0023413862220228025, "phrase": "mst."}, {"score": 0.002174303033371867, "phrase": "gsd_projects"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["global software engineering", " communication tools", " media choice"], "paper_abstract": "Global software development (GSD) projects use a variety of communication tools, such as teleconferences, email, and instant messaging to overcome the challenges caused by distribution. The use of different tools implies different communication needs and practices within the project. Media synchronicity theory (MST) breaks communication down into two processes conveyance of information and convergence of understanding and communication media capabilities into five: immediacy of feedback, parallelism, symbol variety, rehearsability, and reprocessability. According to MST, media capabilities differ in support for conveyance and convergence, and for good performance, there should be match between media capabilities and communication process needed in a given task. In this paper, we present our qualitative study on communication in GSD. We interviewed 79 individuals from 12 GSD projects. We discuss which communication tools were used and how. We analyze the tool use and articulated rationale for choosing the tools for various tasks in distributed software development based on the two communicative processes and five media properties suggested by MST. We found evidence supporting the applicability of MST as an aid in selecting communication tools for GSD projects. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Reflecting the choice and usage of communication tools in global software development projects with media synchronicity theory", "paper_id": "WOS:000308719900006"}