{"auto_keywords": [{"score": 0.038754497436400887, "phrase": "defeater_literals"}, {"score": 0.015719716506582538, "phrase": "doubt_index"}, {"score": 0.004576253356889219, "phrase": "defeasible_inheritance_networks"}, {"score": 0.004330941610682453, "phrase": "defeasible_links"}, {"score": 0.004240116703465252, "phrase": "quantitative_indication"}, {"score": 0.003593812067062062, "phrase": "subsumption_links"}, {"score": 0.0034445472801689046, "phrase": "negative_defeasible_inheritance_links"}, {"score": 0.00327356326590461, "phrase": "new_representation"}, {"score": 0.003192011266635838, "phrase": "inference"}, {"score": 0.0031643005824589917, "phrase": "inheritance_networks"}, {"score": 0.002994449398035894, "phrase": "network_extensions"}, {"score": 0.002658863179011018, "phrase": "underlying_semantics"}, {"score": 0.0023111922860677672, "phrase": "traditional_concepts"}, {"score": 0.0022339789476489877, "phrase": "nonmonotonic_or_defeasible_inheritance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Defeasible inheritance", " Multiple inheritance with exceptions", " Nonmonotonic logic", " Underlying semantics"], "paper_abstract": "This article introduces and uses a representation of defeasible inheritance networks where links in the network are viewed as propositions, and where defeasible links are tagged with a quantitative indication of the proportion of exceptions, called the doubt index. This doubt index is used for restricting the length of the chains of inference. The representation also introduces the use of defeater literals that disable the chaining of subsumption links. The use of defeater literals replaces the use of negative defeasible inheritance links, expressing \"most A are not B\". The new representation improves the expressivity significantly. Inference in inheritance networks is defined by a combination of axioms that constrain the contents of network extensions, a heuristic restriction that also has that effect, and a nonmonotonic operation of minimizing the set of defeater literals while retaining consistency. We introduce an underlying semantics that defines the meaning of literals in a network, and prove that the axioms are sound with respect to this semantics. We also discuss the conditions for obtaining completeness. Traditional concepts, assumptions and issues in research on nonmonotonic or defeasible inheritance are reviewed in the perspective of this approach. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Defeasible inheritance with doubt index and its axiomatic characterization", "paper_id": "WOS:000284667900001"}