{"auto_keywords": [{"score": 0.04748233881983628, "phrase": "e-government_literature"}, {"score": 0.01900013075964331, "phrase": "developing_countries"}, {"score": 0.010612387000973441, "phrase": "e-government_issues"}, {"score": 0.0044289730051264116, "phrase": "specific_area"}, {"score": 0.004347473906950474, "phrase": "statistical_methodologies"}, {"score": 0.004017437417375057, "phrase": "socio-technical_perspective"}, {"score": 0.00372965096877929, "phrase": "scientometrics_approach"}, {"score": 0.003367188029221534, "phrase": "socio-technical_theory"}, {"score": 0.0030257422786589723, "phrase": "growth_pattern"}, {"score": 0.002956209594959227, "phrase": "e-government_studies"}, {"score": 0.002744234034162797, "phrase": "socio-technical_aspects"}, {"score": 0.0025832180231667853, "phrase": "balanced_approach"}, {"score": 0.002500456462028735, "phrase": "merely_theoretical_or_conceptual_bases"}, {"score": 0.0021246816854197732, "phrase": "future_directions"}, {"score": 0.0021049977753042253, "phrase": "e-government_research"}], "paper_keywords": ["E-government research", " Developing countries", " Socio-technical theory", " E-government issues/topics", " Shape of e-government literature", " Scientometrics approach", " Core e-government journals"], "paper_abstract": "Many researchers have analyzed e-government literature as a whole or a specific area to focus on statistical methodologies, lessons learnt, or problem related to the area. However, no investigation from socio-technical perspective on e-government issues, in developing countries (DCs), has been carried out. Utilizing scientometrics approach, we analyzed and synthesized e-government (EG) literature that deals with the issues/topics in developing countries from the lens of socio-technical theory (STT). 145 articles from 7 core e-government journals published during the last decade were selected and reviewed for analyzing e-government literature related to developing countries. The growth pattern of e-government literature showed that e-government studies pertaining developing countries issues/topics have rapidly increased during the last decade; covering a range of topics/issues studied from socio-technical aspects. We found that e-government literature in developing countries has somewhat adopted a balanced approach and is moving away from a merely theoretical or conceptual bases toward an empirical foundation; however, the literature lacked depth and balance in terms of issues/topics discussed and methodologies applied. In the light of the findings, strengths, limitations, and future directions for e-government research in developing countries are discussed.", "paper_title": "A socio-technical perspective on e-government issues in developing countries: a scientometrics approach", "paper_id": "WOS:000289106900004"}