{"auto_keywords": [{"score": 0.026435973439935152, "phrase": "applicability_check"}, {"score": 0.015369634007014186, "phrase": "applicability_checks"}, {"score": 0.00481495049065317, "phrase": "information_systems_research"}, {"score": 0.004615587054831451, "phrase": "first_step"}, {"score": 0.004381462398812729, "phrase": "information_systems_researchers"}, {"score": 0.004092026656771699, "phrase": "technical_artifacts"}, {"score": 0.00389702203873437, "phrase": "theory-focused_research"}, {"score": 0.0037112756920669593, "phrase": "research_relevance"}, {"score": 0.0035343512834706417, "phrase": "additional_step"}, {"score": 0.0034210964819485893, "phrase": "traditional_research_life_cycle"}, {"score": 0.0033548872248104814, "phrase": "rigorous_methods"}, {"score": 0.0032053233533168362, "phrase": "traditional_research_models"}, {"score": 0.003012919635505122, "phrase": "practitioners'_attempts"}, {"score": 0.002973904674745238, "phrase": "research_findings"}, {"score": 0.0024616504443079512, "phrase": "research_objects"}, {"score": 0.002398274973378986, "phrase": "integral_part"}, {"score": 0.002374931094109485, "phrase": "research_process"}, {"score": 0.0023062508214156123, "phrase": "atypical_research_process"}, {"score": 0.00214659338413584, "phrase": "focus_group_method"}, {"score": 0.0021049977753042253, "phrase": "modified_nominal_group_technique"}], "paper_keywords": ["relevance", " rigor", " academic research", " research process", " applicability check", " focus group method", " modified nominal group technique"], "paper_abstract": "This paper takes a first step in aiding researchers to improve the relevance of their research to practice. By proposing that Information Systems researchers conduct applicability checks with practitioners on the research objects (for example, theories, models, frameworks, processes, technical artifacts, or other theoretically based IS artifacts) they either produce or use in theory-focused research, our paper presents an actionable, systematic approach to evaluating, establishing, and further improving research relevance. Furthermore, because it is an approach that can be conducted as an additional step either at the beginning or the end of the traditional research life cycle, it leaves untouched the rigorous methods used to conduct the study, that is, it does not compromise traditional research models. The approach we propose is based on the analyses of three dimensions of relevance that are critical to practitioners' attempts to internalize IS research findings (importance, accessibility, and suitability), and a comprehensive set of solutions that can be used to address them. Our analysis reveals that the most critical dimension for practice is the importance of the research to the needs of practice. The solution we propose to address that need is to conduct an applicability check on the research objects of interest. The applicability check forms an integral part of the research process, either prior to or following engagement in atypical research process. We present principles and criteria for the conduct and evaluation of an applicability check, which is primarily based on the focus group method, and secondarily on a modified nominal group technique.", "paper_title": "Toward improving the relevance of information systems research to practice: The role of applicability checks", "paper_id": "WOS:000253702000001"}