{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.049655608595442415, "phrase": "optimal_single-session_flow"}, {"score": 0.03249743674047246, "phrase": "packet-level_power_control"}, {"score": 0.004121490798711703, "phrase": "energy_constraint"}, {"score": 0.0040309035566691645, "phrase": "performance_limit"}, {"score": 0.003977505904363489, "phrase": "achievable_network_lifetime"}, {"score": 0.0038900709793274484, "phrase": "two-tier_wireless_sensor_network"}, {"score": 0.003821503621554738, "phrase": "network_lifetime_problem"}, {"score": 0.00378767277402891, "phrase": "upper-tier_aggregation"}, {"score": 0.003543273649210823, "phrase": "network_lifetime"}, {"score": 0.003434662174045939, "phrase": "different_paths"}, {"score": 0.0032272929113113203, "phrase": "afn"}, {"score": 0.003114449258490062, "phrase": "multisession_flow_routing_solution"}, {"score": 0.002900426826591769, "phrase": "considerable_overhead"}, {"score": 0.0025492038831408715, "phrase": "so-called_single-session_flow"}, {"score": 0.00221068461235127, "phrase": "composite_flows"}, {"score": 0.0021049977753042253, "phrase": "average_bit-rate"}], "paper_keywords": ["sensor networks", " network lifetime", " energy constraint", " power control", " flow routing"], "paper_abstract": "Wireless sensor networks are becoming increasingly important in recent years due to their ability to detect and convey realtime, in-situ information for many civilian and military applications. A fundamental challenge for such networks lies in energy constraint, which poses a performance limit on the achievable network lifetime. We consider a two-tier wireless sensor network and address the network lifetime problem for upper-tier aggregation and forwarding nodes (AFNs). Existing flow routing solutions proposed for maximizing network lifetime require AFNs to split flows to different paths during transmission, which we call multisession flow routing solutions. If an AFN is equipped with a single transmitter/receiver pair, a multisession flow routing solution requires a packet-level power control at the AFN so as to conserve energy, which calls for considerable overhead in synchronization among the AFNs. In this paper, we show that it is possible to achieve the same optimal network lifetime by power control on a much larger timescale with the so-called single-session flow routing solutions, under which the packet-level power control and, thus, strict requirement on synchronization are not necessary. We also show how to perform optimal single-session flow routing when the bit-rate of composite flows generated by AFNs is time-varying, as long as the average bit-rate can be estimated.", "paper_title": "Maximizing the lifetime of wireless sensor networks through optimal single-session flow routing", "paper_id": "WOS:000239058200011"}