{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clock_synchronization_protocols"}, {"score": 0.014161450504910623, "phrase": "clock_value"}, {"score": 0.008627019805923336, "phrase": "clock_synchronization"}, {"score": 0.00845608226207488, "phrase": "sensor_nodes"}, {"score": 0.007517562505131268, "phrase": "crystal_oscillator"}, {"score": 0.005332200011612272, "phrase": "better_understanding"}, {"score": 0.004742948310694449, "phrase": "wireless_sensor_networks"}, {"score": 0.004443121295775668, "phrase": "mac_protocols"}, {"score": 0.004268070459032083, "phrase": "particular_instant"}, {"score": 0.0041102032028337366, "phrase": "sensor_node"}, {"score": 0.0037830687091647123, "phrase": "clock_values"}, {"score": 0.00376409764683147, "phrase": "different_sensor_nodes"}, {"score": 0.003679893968861111, "phrase": "real_time_clock"}, {"score": 0.003464414154918627, "phrase": "recent_past"}, {"score": 0.0032779570262382366, "phrase": "common_platform"}, {"score": 0.0032207537133035822, "phrase": "survey_paper"}, {"score": 0.002994178996584381, "phrase": "different_options"}, {"score": 0.002797541648302302, "phrase": "existing_surveys"}, {"score": 0.002769526501395779, "phrase": "new_features"}, {"score": 0.002646880721119838, "phrase": "physical_clock"}, {"score": 0.0025424177449894928, "phrase": "systematic_way"}, {"score": 0.0024980180877657654, "phrase": "brief_description"}, {"score": 0.0023694065215394593, "phrase": "recent_clock_synchronization_protocols"}, {"score": 0.002275869477027725, "phrase": "corresponding_basic_clock_synchronization_protocols"}, {"score": 0.0022474016599759892, "phrase": "proposed_model"}, {"score": 0.002164112397899117, "phrase": "existing_protocols"}, {"score": 0.00213703950514224, "phrase": "new_clock_synchronization_protocols"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Clock synchronization techniques", " Wireless sensor networks", " Internal clock synchronization", " External clock synchronization"], "paper_abstract": "Clock synchronization in wireless sensor networks (WSNs) assures that sensor nodes have the same reference clock time. This is necessary not only for various WSN applications but also for many system level protocols for WSNs such as MAC protocols, and protocols for sleep scheduling of sensor nodes. Clock value of a node at a particular instant of time depends on its initial value and the frequency of the crystal oscillator used in the sensor node. The frequency of the crystal oscillator varies from node to node, and may also change over time depending upon many factors like temperature, humidity, etc. As a result, clock values of different sensor nodes diverge from each other and also from the real time clock, and hence, there is a requirement for clock synchronization in WSNs. Consequently, many clock synchronization protocols for WSNs have been proposed in the recent past. These protocols differ from each other considerably, and so, there is a need to understand them using a common platform. Towards this goal, this survey paper categorizes the features of clock synchronization protocols for WSNs into three types, viz, structural features, technical features, and global objective features. Each of these categories has different options to further segregate the features for better understanding. The features of clock synchronization protocols that have been used in this survey include all the features which have been used in existing surveys as well as new features such as how the clock value is propagated, when the clock value is propagated, and when the physical clock is updated, which are required for better understanding of the clock synchronization protocols in WSNs in a systematic way. This paper also gives a brief description of a few basic clock synchronization protocols for WSNs, and shows how these protocols fit into the above classification criteria. In addition, the recent clock synchronization protocols for WSNs, which are based on the above basic clock synchronization protocols, are also given alongside the corresponding basic clock synchronization protocols. Indeed, the proposed model for characterizing the clock synchronization protocols in WSNs can be used not only for analyzing the existing protocols but also for designing new clock synchronization protocols. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A model for the classification and survey of clock synchronization protocols in WSNs", "paper_id": "WOS:000349732400013"}