{"auto_keywords": [{"score": 0.00436890075128947, "phrase": "scientific_citations"}, {"score": 0.004061584718427419, "phrase": "empirically_observed_distribution"}, {"score": 0.003900257249255497, "phrase": "power-law_distributions"}, {"score": 0.003700037700138249, "phrase": "average_rate"}, {"score": 0.003384262486955773, "phrase": "modified_model"}, {"score": 0.003020918749760067, "phrase": "original_model"}, {"score": 0.002831037222426215, "phrase": "branching_processes"}, {"score": 0.0027295084882654917, "phrase": "aforementioned_features"}, {"score": 0.002707444334463544, "phrase": "citation_distribution"}, {"score": 0.002547535564922075, "phrase": "sleeping_beauties"}, {"score": 0.0022371907579775796, "phrase": "purely_random_models"}, {"score": 0.002165688807780663, "phrase": "good_quantitative_agreement"}, {"score": 0.002148172508419683, "phrase": "empirical_citation_data"}, {"score": 0.0021049977753042253, "phrase": "darwinian_fitness_parameter"}], "paper_keywords": [""], "paper_abstract": "Recently we proposed a model in which when a scientist writes a manuscript, he picks up several random papers, cites them, and also copies a fraction of their references. The model was stimulated by our finding that a majority of scientific citations are copied from the lists of references used in other papers. It accounted quantitatively for several properties of empirically observed distribution of citations; however, important features such as power-law distributions of citations to papers published during the same year and the fact that the average rate of citing decreases with aging of a paper were not accounted for by that model. Here, we propose a modified model: When a scientist writes a manuscript, he picks up several random recent papers, cites them, and also copies some of their references. The difference with the original model is the word recent. We solve the model using methods of the theory of branching processes, and find that it can explain the aforementioned features of citation distribution, which our original model could not account for. The model also can explain \"sleeping beauties in science;\" that is, papers that are little cited for a decade or so and later \"awaken\" and get many citations. Although much can be understood from purely random models, we find that to obtain a good quantitative agreement with empirical citation data, one must introduce Darwinian fitness parameter for the papers.", "paper_title": "A mathematical theory of citing", "paper_id": "WOS:000249135100012"}