{"auto_keywords": [{"score": 0.004195418010131832, "phrase": "collapse_loads"}, {"score": 0.003970439654470374, "phrase": "material_incompressibility"}, {"score": 0.0037834649508375544, "phrase": "ansys_program"}, {"score": 0.0036052633308076933, "phrase": "small_fluctuations"}, {"score": 0.0035072146967082083, "phrase": "load-deformation_results"}, {"score": 0.003296212583539166, "phrase": "different_increment_sizes"}, {"score": 0.0032510690712452147, "phrase": "remeshing_frequencies"}, {"score": 0.0029928611380840757, "phrase": "unique_element_division_method"}, {"score": 0.0026071599759743833, "phrase": "uniform_clay"}, {"score": 0.0025537472239953807, "phrase": "square_foundation"}, {"score": 0.002518746501941657, "phrase": "normally_consolidated_clay"}, {"score": 0.002467140591777737, "phrase": "computed_bearing_capacity_responses"}, {"score": 0.002286781334850213, "phrase": "present_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["penetration", " large displacement analysis", " interpolation", " foundation", " bearing capacity"], "paper_abstract": "The Remeshing and Interpolation Technique with Small Strain (RITSS) approach has been developed to deal with 3-D geotechnical problems in this paper. Unstructured 20-node hexahedral element is found to work well for predicting collapse loads accurately for 3-D undrained geotechnical problems involving material incompressibility. Remeshing is automatically accomplished by ANSYS program. With remeshing and interpolation, small fluctuations appear in the load-deformation results. In order to minimize these fluctuations, different increment sizes and remeshing frequencies are explored. Meanwhile, various 3-D interpolation methods are compared, and the unique element division method is found to work best. The results of two numerical applications are presented for a 3-D strip footing penetrating deeply into uniform clay and a square foundation into normally consolidated clay. The computed bearing capacity responses are compared with other numerical or conventional results. The results show that the present method is accurate and efficient for 3-D large displacement foundation penetration problems. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Three-dimensional RITSS large displacement finite element method for penetration of foundations into soil", "paper_id": "WOS:000256324500006"}