{"auto_keywords": [{"score": 0.049584128839210984, "phrase": "woss"}, {"score": 0.012151911445020936, "phrase": "desert_underwater"}, {"score": 0.00481495049065317, "phrase": "open_source_suites_for_underwater_networking"}, {"score": 0.004547438494330851, "phrase": "underwater_networks"}, {"score": 0.004250302819248558, "phrase": "accurate_modeling"}, {"score": 0.004184526032558792, "phrase": "channel_behavior"}, {"score": 0.0031762308449055305, "phrase": "network_simulation"}, {"score": 0.0031107911390188055, "phrase": "ns-miracle"}, {"score": 0.003015143226706584, "phrase": "realistic_channel_patterns"}, {"score": 0.0029072537537959374, "phrase": "environmental_boundary_conditions"}, {"score": 0.0027311809666295565, "phrase": "at-sea_experiments"}, {"score": 0.0025259712348798323, "phrase": "network_deployment"}, {"score": 0.0021049977753042253, "phrase": "nato_sto_centre_for_maritime_research_and"}], "paper_keywords": [""], "paper_abstract": "Simulation and experimentation of underwater networks entail many challenges, which for the former are mainly related to the accurate modeling of the channel behavior, while they are typically logistic in nature for the latter. In this article, we present our experience with WOSS and DESERT Underwater, two open source suites address both classes of challenges. The suites build on and extend the capabilities of ns2 and NS-MIRACLE, two widely known software packages for network simulation. WOSS endows NS-MIRACLE with the capability to generate realistic channel patterns by automatically retrieving and processing the environmental boundary conditions that influence such patterns; DESERT Underwater makes it possible to evolve toward at-sea experiments by reusing the same code written for simulations, thereby minimizing the effort required for network deployment and control. Both suites have been widely tested and used in several projects: some examples are provided in this respect, including an account of some experiments carried out in collaboration with the NATO STO Centre for Maritime Research and Experimentation.", "paper_title": "Open Source Suites for Underwater Networking: WOSS and DESERT Underwater", "paper_id": "WOS:000345579700008"}