{"auto_keywords": [{"score": 0.03830596095410128, "phrase": "ab_algorithm"}, {"score": 0.021818321675514552, "phrase": "collision_detection"}, {"score": 0.015719716506582538, "phrase": "ad_hoc_radio_networks"}, {"score": 0.00728071853550145, "phrase": "source_message"}, {"score": 0.00712652000806456, "phrase": "a._gibbons"}, {"score": 0.007096071613037425, "phrase": "a._pelc"}, {"score": 0.007065752384426335, "phrase": "w._rytter"}, {"score": 0.006990515877295671, "phrase": "unknown_radio_networks"}, {"score": 0.0056423055556925495, "phrase": "strongly_connected_networks"}, {"score": 0.004514714250357749, "phrase": "acknowledged_broadcasting"}, {"score": 0.004456941759398859, "phrase": "communication_task"}, {"score": 0.00438105507792004, "phrase": "distinguished_source"}, {"score": 0.00428800333195612, "phrase": "fact_common_knowledge"}, {"score": 0.004196919634282837, "phrase": "underlying_directed_graph"}, {"score": 0.004003260887655198, "phrase": "chlebus_et_al"}, {"score": 0.003952007221565029, "phrase": "l._gasieniec"}, {"score": 0.003451767675614459, "phrase": "uchida"}, {"score": 0.003422225406860504, "phrase": "u._uchida"}, {"score": 0.003407549468745519, "phrase": "w._chen"}, {"score": 0.003392936252936413, "phrase": "k._wada"}, {"score": 0.003378385493203297, "phrase": "acknowledged"}, {"score": 0.0033279483332126145, "phrase": "theoret"}, {"score": 0.00290022600516473, "phrase": "distrib"}, {"score": 0.0028081842633816607, "phrase": "singleton_network"}, {"score": 0.002678433668156676, "phrase": "broadcasting_algorithm"}, {"score": 0.0026214496600537986, "phrase": "large_class"}, {"score": 0.0025934127228147727, "phrase": "resulting_ab_algorithm"}, {"score": 0.0024365973711776736, "phrase": "arbitrary_strongly_connected_networks"}, {"score": 0.0022070310530794097, "phrase": "strong_sense"}, {"score": 0.0021693692831601745, "phrase": "infinite_family"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Distributed computing", " Deterministic broadcasting", " Acknowledged broadcasting", " Radio network"], "paper_abstract": "We consider ad hoc radio networks in which each node knows only its own identity but is unaware of the topology of the network, or of any bound on its size or diameter. Acknowledged broadcasting (AB) is a communication task consisting in transmitting a message from a distinguished source to all other nodes of the network and making this fact common knowledge among all nodes. To do this, the underlying directed graph must be strongly connected. Working in a model allowing all nodes to transmit spontaneously even before getting the Source message, Chlebus et al. [B. Chlebus. L. Gasieniec, A. Gibbons, A. Pelc, W. Rytter, Deterministic broadcasting in unknown radio networks. Distrib. Comput. 15 (2002) 27-38] proved that AB is impossible, if collision detection is not available, and gave an AB algorithm using collision detection that works in time O(nD) where n is the number of nodes and D is the eccentricity of the source. Uchida et al. U. Uchida, W. Chen, K. Wada, Acknowledged broadcasting and gossiping in ad hoc radio networks, Theoret. Comput. Sci. 377 (2007) 43-54] showed an AB algorithm without collision detection working in time O (n(4/3) log(10/3) n) for all strongly connected networks of size at least 2. In particular, it follows that the impossibility result from [B. Chlebus, L. Gasieniec, A. Gibbons, A. Pelc, W. Rytter, Deterministic broadcasting in unknown radio networks, Distrib. Comput. 15 (2002) 27-38] is really caused by the singleton network for which AB amounts to realize that the source is alone. We improve those two results by presenting two generic AB algorithms using a broadcasting algorithm without acknowledgement, as a procedure. For a large class of broadcasting algorithms the resulting AB algorithm has the same time complexity. Using the Currently best known broadcasting algorithms, we obtain an AB algorithm with collision detection working in time O(min{nlog(2)D, nlognloglogn}), for arbitrary strongly connected networks, and an AB algorithm without collision detection working in time O(nlognloglogn) for all strongly connected networks of size n >= 2. Moreover, we show that in the model in which only nodes that already got the source message can transmit, AB is infeasible in a strong sense: for any AB algorithm there exists an infinite family of networks for which this algorithm is incorrect. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Acknowledged broadcasting in ad hoc radio networks", "paper_id": "WOS:000261792700011"}