{"auto_keywords": [{"score": 0.04905613790748982, "phrase": "generalized_eigen-decomposition"}, {"score": 0.004815193214374064, "phrase": "convergent"}, {"score": 0.004661446705304497, "phrase": "minor_component_analysis"}, {"score": 0.0046113840924632745, "phrase": "mca"}, {"score": 0.00427550604912774, "phrase": "blind_signal_separation"}, {"score": 0.004050625770007516, "phrase": "completely_different_approach"}, {"score": 0.003921393143378986, "phrase": "novel_mca_algorithm"}, {"score": 0.003675120438902734, "phrase": "gradient_ascent_approach"}, {"score": 0.0035005841368145525, "phrase": "first_minor_eigenvector"}, {"score": 0.003334309053314909, "phrase": "multiple_minor_eigenvectors"}, {"score": 0.0032278559855285945, "phrase": "orthogonality_property"}, {"score": 0.0027295084882654917, "phrase": "minor_eigenvectors"}, {"score": 0.002656650588033728, "phrase": "generalized_minor_eigenvectors"}, {"score": 0.0025440911575156755, "phrase": "corresponding_eigenvalues"}], "paper_keywords": ["generalized eigen-decomposition", " minor component analysis", " eigenvector", " eigenvalue"], "paper_abstract": "Minor component analysis (MCA) are used in many applications such as curve and surface fitting, robust beamforming, and blind signal separation. Based on the generalized eigen-decomposition, we present a completely different approach that leads to derive a novel MCA algorithm. First, in the sense of generalized eigen-decomposition, by using gradient ascent approach, we derive an algorithm for extracting the first minor eigenvector. Then, the algorithm used to extract multiple minor eigenvectors is proposed by using the orthogonality property. The proofs and rigorous theoretical analysis show that our proposed algorithm is convergent to their corresponding minor eigenvectors. We identify three important characteristics of these algorithms. The first is that the algorithm for extracting minor eigenvectors can be extended to generalized minor eigenvectors easily. The second is that the corresponding eigenvalues can be computed simultaneously as a byproduct of this algorithm. The third is that the algorithm is globally convergent. The simulations have been conducted for illustration of the efficiency and effectiveness of our algorithm.", "paper_title": "A Globally Convergent MCA Algorithm by Generalized Eigen-Decomposition", "paper_id": "WOS:000297797300022"}