{"auto_keywords": [{"score": 0.049014830901543946, "phrase": "metallographic_images"}, {"score": 0.015719716506582538, "phrase": "automatic_characterization"}, {"score": 0.015545916774765613, "phrase": "graphite_particles"}, {"score": 0.011636073471880459, "phrase": "computer_techniques"}, {"score": 0.004655285779819366, "phrase": "industrial_materials"}, {"score": 0.004044822781630218, "phrase": "mechanical_properties"}, {"score": 0.003845154818609644, "phrase": "automated_characterization"}, {"score": 0.0036759314172445934, "phrase": "possible_measurement_errors"}, {"score": 0.0033594249301033604, "phrase": "crucial_industrial_goal"}, {"score": 0.003303177222901723, "phrase": "efficient_and_robust_manner"}, {"score": 0.0025638362414466278, "phrase": "statistical_based_analysis"}, {"score": 0.002464709648714996, "phrase": "efficient_solutions"}, {"score": 0.0024097920845706795, "phrase": "aimed_characterization"}, {"score": 0.0023428586429492713, "phrase": "optimum-path_forest"}, {"score": 0.0022777800735119405, "phrase": "overall_superior_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Material characterization", " Computer methods", " Computer classifiers", " Otsu's method", " Nodular", " Gray and malleable cast irons"], "paper_abstract": "The automatic characterization of particles in metallographic images has been paramount, mainly because of the importance of quantifying such microstructures in order to assess the mechanical properties of materials common used in industry. This automated characterization may avoid problems related with fatigue and possible measurement errors. In this paper, computer techniques are used and assessed towards the accomplishment of this crucial industrial goal in an efficient and robust manner. Hence, the use of the most actively pursued machine learning classification techniques. In particularity, Support Vector Machine, Bayesian and Optimum-Path Forest based classifiers, and also the Otsu's method, which is commonly used in computer imaging to binarize automatically simply images and used here to demonstrated the need for more complex methods, are evaluated in the characterization of graphite particles in metallographic images. The statistical based analysis performed confirmed that these computer techniques are efficient solutions to accomplish the aimed characterization. Additionally, the Optimum-Path Forest based classifier demonstrated an overall superior performance, both in terms of accuracy and speed. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Computer techniques towards the automatic characterization of graphite particles in metallographic images of industrial materials", "paper_id": "WOS:000310945000020"}