{"auto_keywords": [{"score": 0.026440623401424293, "phrase": "relaxed_area_constraint"}, {"score": 0.00481495049065317, "phrase": "yield_optimization"}, {"score": 0.00477513738640734, "phrase": "high_performance_applications"}, {"score": 0.004677032188041644, "phrase": "process_variations"}, {"score": 0.003737234606207431, "phrase": "gate-sizing_algorithm"}, {"score": 0.003540661500026125, "phrase": "binning_yield-loss_function"}, {"score": 0.0032717489668326275, "phrase": "size_variables"}, {"score": 0.0030357976028714557, "phrase": "specific_assumptions"}, {"score": 0.002828556054338357, "phrase": "binning_yield-loss"}, {"score": 0.0027588314610845705, "phrase": "desired_statistical_static_timing_analysis"}, {"score": 0.0026796495639791426, "phrase": "proposed_technique"}, {"score": 0.002624482632439123, "phrase": "recently_proposed_sensitivity-based_statistical_sizer"}, {"score": 0.002559775585192185, "phrase": "worst-case_variability_estimate"}, {"score": 0.0024452510143564057, "phrase": "consistent_improvement"}, {"score": 0.002404885278896803, "phrase": "sensitivity-based_approach"}, {"score": 0.002249961956629804, "phrase": "huge_run-time_gain"}, {"score": 0.002176275802465835, "phrase": "deterministic_sizer"}, {"score": 0.0021049977753042253, "phrase": "reasonably_good_binning_yield-loss_values"}], "paper_keywords": ["circuit optimization", " convexity", " gate sizing", " variability"], "paper_abstract": "High performance applications are highly affected by process variations due to considerable spread in their expected frequencies after fabrication. Typically \"binning\" is applied to those chips that are not meeting their performance requirement after fabrication. Using binning, such failing chips are sold at a loss (e.g., proportional to the degree that they are failing their performance requirement). This paper discusses a gate-sizing algorithm to minimize \"yield-loss\" associated with binning. We propose a binning yield-loss function as a suitable objective to be minimized. We show this objective is convex with respect to the size variables and consequently can be optimally and efficiently solved. These contributions are yet made without making any specific assumptions about the sources of variability or how they are modeled. We show computation of the binning yield-loss can be done via any desired statistical static timing analysis (SSTA) tool. The proposed technique is compared with a recently proposed sensitivity-based statistical sizer, a deterministic sizer with worst-case variability estimate, and a deterministic sizer with relaxed area constraint. We show consistent improvement compared to the sensitivity-based approach in quality of solution (final binning yield-loss value) as well as huge run-time gain. Moreover, we show that a deterministic sizer with a relaxed area constraint will also result in reasonably good binning yield-loss values for the extra area overhead.", "paper_title": "Variability driven gate sizing for binning yield optimization", "paper_id": "WOS:000256768000010"}