{"auto_keywords": [{"score": 0.04192102071091637, "phrase": "full-search_fme_algorithm"}, {"score": 0.004603244077348199, "phrase": "fractional_motion_estimation"}, {"score": 0.004450568197899267, "phrase": "important_part"}, {"score": 0.004183638135671596, "phrase": "compression_ratio"}, {"score": 0.00413684709497912, "phrase": "video_encoders"}, {"score": 0.004067635935640407, "phrase": "high_video_quality"}, {"score": 0.0036966717141736355, "phrase": "total_motion_estimation_process"}, {"score": 0.0035141291835319682, "phrase": "fme_implementations"}, {"score": 0.00345530020388352, "phrase": "-programmable_gate_arrays"}, {"score": 0.003247868216333148, "phrase": "inherent_parallelism"}, {"score": 0.00293487292076612, "phrase": "six_scaled_versions"}, {"score": 0.0023962545023307937, "phrase": "best_vertically_scaled_design"}], "paper_keywords": [""], "paper_abstract": "Fractional motion estimation (FME) is an important part of the H.264/AVC video encoding standard. The algorithm can significantly increase the compression ratio of video encoders while preserving high video quality. The full-search FME algorithm, however, is computationally expensive and can consist of over 45% of the total motion estimation process. To maximise the performance and efficiency of FME implementations on field-programmable gate arrays (FPGAs), one needs to efficiently exploit the inherent parallelism in the algorithm. The authors investigate the scalability of the full-search FME algorithm on FPGAs and also implemented six scaled versions of the algorithm on Xilinx Virtex-5 FPGAs. The authors found that scaling the algorithm vertically within a 4 x 4 sub-block is more efficient than scaling horizontally across several sub-blocks. It is shown that, with four reference frames, the best vertically scaled design can achieve 96 frames-per-second (fps) performance while encoding full 1920 x 1088 progressive HDTV video, and the design only consumes 25.5 K LUTS and 28.7 K registers.", "paper_title": "Effect of scaling on the area and performance of the H.264/AVC full-search fractional motion estimation algorithm on field-programmable gate arrays", "paper_id": "WOS:000301335600004"}