{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "signal_space_alignment"}, {"score": 0.004774324145784758, "phrase": "generalized_mimo_y_channel"}, {"score": 0.004461359547152617, "phrase": "generalized_multiple_input_multiple_output"}, {"score": 0.004424238909687004, "phrase": "mimo"}, {"score": 0.004012751049253625, "phrase": "practical_conditions"}, {"score": 0.0039788756971292985, "phrase": "ssa."}, {"score": 0.0038953958723049287, "phrase": "generalized_mimo_y_channel_model"}, {"score": 0.003548368289666932, "phrase": "ssa._although_ssa"}, {"score": 0.0033579708256295847, "phrase": "new_restrictions"}, {"score": 0.0030586736004285216, "phrase": "ssa_network_coding"}, {"score": 0.0028944757265206332, "phrase": "total_number"}, {"score": 0.00260308177804879, "phrase": "ssa"}, {"score": 0.0021049977753042253, "phrase": "ssa-nc"}], "paper_keywords": ["Signal space alignment", " MIMO Y channel", " degrees of freedom", " number of antennas"], "paper_abstract": "This paper proposes a generalization for applications of signal space alignment (SSA) in a generalized multiple input multiple output (MIMO) Y channel with K(K a (c) 3/4 2) nodes and an intermediate relay. Based on that generalization, a method is introduced to determine the practical conditions for SSA. We first study the generalized MIMO Y channel model with general signal demands; then, the degrees of freedom (DoF) achieved are given and are proved using SSA. Although SSA could decrease the number of antennas at the relay, it places new restrictions on the numbers of antennas at the nodes. We then introduce a method to compare the models with and without SSA network coding (SSA-NC), mainly from the perspective of the total number of antennas used. The results show that if each node must be able to exchange signals with all others, the model with SSA will definitely use more antennas to supply the same DoF, when K > 5. If it is not necessary for every node to exchange signals with all others, the comparison can still be made by using the method introduced here. As a result, the conditions under which SSA-NC is needed are presented.", "paper_title": "Practical conditions of signal space alignment for generalized MIMO Y channel", "paper_id": "WOS:000308814500001"}