{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chaotic_parameter-dependent_movement"}, {"score": 0.0043161190928529755, "phrase": "movements'_dependency"}, {"score": 0.003964007795174772, "phrase": "visual_analytics_approach"}, {"score": 0.0037075456471849892, "phrase": "key_idea"}, {"score": 0.0035965032173588753, "phrase": "analytical_extraction"}, {"score": 0.0034887749053459584, "phrase": "distinct_movement_characteristics"}, {"score": 0.0034465894339710864, "phrase": "different_parameter_configurations"}, {"score": 0.0034049123167891955, "phrase": "extracted_features"}, {"score": 0.0032828706086018133, "phrase": "compact_fashion"}, {"score": 0.002735052488172277, "phrase": "original_movement"}, {"score": 0.002436289099444074, "phrase": "chaotic_behavior"}, {"score": 0.002320449502337321, "phrase": "data_points"}, {"score": 0.0022923586577645143, "phrase": "domain_experts"}, {"score": 0.0022101055924375725, "phrase": "dynamic_groups"}, {"score": 0.0021049977753042253, "phrase": "parameter_configurations"}], "paper_keywords": [""], "paper_abstract": "Analyzing movements in their spatial and temporal context is a complex task. We are additionally interested in understanding the movements' dependency on parameters that govern the processes behind the movement. We propose a visual analytics approach combining analytic, visual, and interactive means to deal with the added complexity. The key idea is to perform an analytical extraction of features that capture distinct movement characteristics. Different parameter configurations and extracted features are then visualized in a compact fashion to facilitate an overview of the data. Interaction enables the user to access details about features, to compare features, and to relate features back to the original movement. We instantiate our approach with a repository of more than twenty accepted and novel features to help analysts in gaining insight into simulations of chaotic behavior of thousands of entities over thousands of data points. Domain experts applied our solution successfully to study dynamic groups in such movements in relation to thousands of parameter configurations.", "paper_title": "Feature-Driven Visual Analytics of Chaotic Parameter-Dependent Movement", "paper_id": "WOS:000358328200045"}