{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rare_objects"}, {"score": 0.0158222040204668, "phrase": "search_efficiency"}, {"score": 0.00492685628380115, "phrase": "rare_object_search_algorithm"}, {"score": 0.004767826806287385, "phrase": "unstructured_peer-to-peer_networks"}, {"score": 0.004576499158494382, "phrase": "search_request"}, {"score": 0.00447251540886613, "phrase": "large-scale_and_dynamic_environments"}, {"score": 0.003877737556673229, "phrase": "proactive_replication_strategy"}, {"score": 0.0036914757355166966, "phrase": "object-probing_technique"}, {"score": 0.002943147037670826, "phrase": "replication_strategy"}, {"score": 0.0028016507334576216, "phrase": "forward_probability"}, {"score": 0.00266693888510356, "phrase": "neighbors'_objects"}, {"score": 0.0024891269874339553, "phrase": "target_objects"}, {"score": 0.002346160830406661, "phrase": "moderate_communication_overhead"}, {"score": 0.0021896891011033105, "phrase": "load_balance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Peer-to-peer network", " Rare object", " Replication", " Search", " Object popularity"], "paper_abstract": "Unstructured peer-to-peer (P2P) networks have become a very popular architecture for content distribution in large-scale and dynamic environments. The search efficiency problem in unstructured P2P networks has not been adequately addressed so far, especially concerning search for rare objects. In this paper, we propose a proactive replication strategy to improve search efficiency for rare objects. It uses an object-probing technique for peers to decide whether or not to establish replications for their objects when they join the network. This strategy can effectively increase the popularity of rare objects in order to enhance search efficiency. We also present a rare object search algorithm to reduce the overhead caused by the replication strategy. When a peer forwards a search request, the forward probability is calculated according to its neighbors' degrees and the number of neighbors' objects. Therefore, the search request is forwarded to the peers more likely containing target objects. Simulations show that our proactive replication strategy greatly improves search efficiency for rare objects with moderate communication overhead. The rare object search algorithm not only improves search efficiency for rare objects, but also achieves load balance in search. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Proactive replication for rare objects in unstructured peer-to-peer networks", "paper_id": "WOS:000298338600008"}