{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "faceted_classification"}, {"score": 0.009705632288944874, "phrase": "resource_discovery"}, {"score": 0.009619289358993867, "phrase": "online_environment"}, {"score": 0.004454377387615279, "phrase": "faceted_classification_scheme"}, {"score": 0.004322967486451877, "phrase": "-_facet_analysis"}, {"score": 0.004284302478991387, "phrase": "established_rigorous_methodology"}, {"score": 0.0042459818200777846, "phrase": "conceptual_organization"}, {"score": 0.004208002469225673, "phrase": "subject_field"}, {"score": 0.004120694410890683, "phrase": "associated_classification"}, {"score": 0.0039043835848369215, "phrase": "fatks_project"}, {"score": 0.0037778009042360758, "phrase": "facet_analytical_theory"}, {"score": 0.003732791585248997, "phrase": "controlled_vocabulary"}, {"score": 0.003526186748088922, "phrase": "detailed_faceted_vocabulary"}, {"score": 0.0034220655476652683, "phrase": "broader_facet_framework"}, {"score": 0.0033510093127915768, "phrase": "research_issues"}, {"score": 0.0032912755695190163, "phrase": "data_model"}, {"score": 0.0032520438684277885, "phrase": "faceted_structure"}, {"score": 0.003071965703296204, "phrase": "easy_facet_combination"}, {"score": 0.0029280552768499056, "phrase": "formalized_data_structure"}, {"score": 0.0029018301277718415, "phrase": "appropriate_tool"}, {"score": 0.0028586409810976367, "phrase": "conceptual_framework"}, {"score": 0.002833035775182696, "phrase": "faceted_system"}, {"score": 0.0027165361453855095, "phrase": "vocabulary_management_system"}, {"score": 0.0022218413146898887, "phrase": "useful_ideas"}, {"score": 0.0021953290937408807, "phrase": "vocabulary_maintenance_tool"}, {"score": 0.0021049977753042253, "phrase": "comparable_research"}], "paper_keywords": ["Classification schemes", " Design"], "paper_abstract": "Purpose - This paper aims to provide an overview of principles and procedures involved in creating a faceted classification scheme for use in resource discovery in an online environment. Design/methodology/approach - Facet analysis provides an established rigorous methodology for the conceptual organization of a subject field, and the structuring of an associated classification or controlled vocabulary. This paper explains how that methodology was applied to the humanities in the FATKS project, where the objective was to explore the potential of facet analytical theory for creating a controlled vocabulary for the humanities, and to establish the requirements of a faceted classification appropriate to an online environment. A detailed faceted vocabulary was developed for two areas of the humanities within a broader facet framework for the whole of knowledge. Research issues included how to create a data model which made the faceted structure explicit and machine-readable and provided to its further development and use. Findings - In order to support easy facet combination in indexing, and facet searching and browsing on the interface, faceted classification requires a formalized data structure and an appropriate tool for its management. The conceptual framework of a faceted system proper can be applied satisfactorily to humanities, and fully integrated within a vocabulary management system. Research limitation/implications - The procedures described in this paper are concerned only with the structuring of the classification, and do not extend to indexing, retrieval and application issues. Practical implications - Many stakeholders in the domian of resource discovery consider developing their own classification system and supporting tools. The methods described in this paper may clarify the process of building a faceted classification and may provide some useful ideas with respect to vocabulary maintenance tool. originality/value - As far as the authors are aware there is no comparable research in this area.", "paper_title": "Building a faceted classification for the humanities: principles and procedures", "paper_id": "WOS:000206467600008"}