{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "eddy_currents"}, {"score": 0.005042971080886976, "phrase": "normal_flux"}, {"score": 0.004776484866276242, "phrase": "laminated_structures"}, {"score": 0.004738325072560588, "phrase": "purpose_-_the_purpose"}, {"score": 0.00458869631642791, "phrase": "comparative_analysis"}, {"score": 0.004390607370861926, "phrase": "magnetic_flux_density"}, {"score": 0.004338076511024884, "phrase": "laminated_an_isotropic_structures"}, {"score": 0.004251912075877877, "phrase": "magnetic_flux"}, {"score": 0.0041842092128678105, "phrase": "lamination_surface"}, {"score": 0.004068302313449334, "phrase": "internal_air_gaps"}, {"score": 0.004044514751598669, "phrase": "field_distribution"}, {"score": 0.003592258384936271, "phrase": "anisotropic_conductivity_permits"}, {"score": 0.0035208552733545463, "phrase": "longitudinal_and_normal_flux"}, {"score": 0.003010347277067459, "phrase": "normal_and_longitudinal_fluxes"}, {"score": 0.0029268619875960715, "phrase": "flux_distribution"}, {"score": 0.002891793055307152, "phrase": "laminated_structure"}, {"score": 0.0027890803075309926, "phrase": "presented_simulations"}, {"score": 0.0023940274498526213, "phrase": "internal_air-gaps"}, {"score": 0.002209060366991921, "phrase": "smaller_but_not_negligible_effect"}], "paper_keywords": ["Eddy currents", " Flux density", " Laminates"], "paper_abstract": "Purpose - The purpose of this paper is to present a comparative analysis concerning the influence of eddy currents on the distribution of the magnetic flux density in the laminated an isotropic structures. Design/methodology/approach - The influence of the magnetic flux normal to the lamination surface is particularly analysed. Several models containing internal air gaps and overlapping are tested. For every structure, the eddy currents are first taken into account and then, they are neglected. At last, the 3D simulation of the anisotropic conductivity permits to analyse separately the longitudinal and normal flux in the structure and the eddy currents induced by those fluxes. Findings - The study leads to a more realistic numerical model with conducting laminations. The results show that the normal flux does not turn at once on lamination. The normal and longitudinal fluxes induce eddy currents which modify the flux distribution in the laminated structure. Practical implications - The results of the presented simulations make it possible to elaborate a more realistic numerical model of homogenized characteristics taking into account eddy currents. Originality/value - The eddy currents induced by the fluxes modifies the field distribution in the structure and should be taken into account. The internal air-gaps higher than 0.1 mm have an influence on the field distribution; the isolation between the laminations of 0.01 mm has a smaller but not negligible effect on the magnetic flux. The direction of the normal flux from one sheet to another one does not change immediately after the entrance of the lamination, the transition is progressive.", "paper_title": "Simplified models including eddy currents for laminated structures", "paper_id": "WOS:000281975700015"}