{"auto_keywords": [{"score": 0.04966447721457641, "phrase": "recommendation_systems"}, {"score": 0.007063258111213251, "phrase": "relevance_degrees"}, {"score": 0.005011877833914112, "phrase": "linear_weighted_sum_type_recommendation_systems"}, {"score": 0.00481495049065317, "phrase": "filtering_systems"}, {"score": 0.004375613460102577, "phrase": "filtering_process"}, {"score": 0.002855934865505357, "phrase": "recommended_candidates"}, {"score": 0.0027943943921568456, "phrase": "foundational_concepts"}, {"score": 0.002770150086489194, "phrase": "recommendation_conditions"}, {"score": 0.002663620639539737, "phrase": "current_systems"}, {"score": 0.002462664392109308, "phrase": "multi-criteria_decision_making"}], "paper_keywords": ["social choice theory", " collaborative filtering", " content-based filtering", " recommendation system"], "paper_abstract": "Recommendation systems have been studied actively since the 1990s. Generally, recommendation systems choose one or more candidates from a set of candidates through a filtering process. Methods of filtering can be divided into two categories: collaborative filtering, in which candidates are chosen based on choices of other persons whose interests or tastes are similar, and content-based filtering, in which items are chosen based on the pro. le or action history of the recommendee. However, these methods share the same structure in the sense that both of them recommend items based on relevance degrees of items and references, as well as relevance degrees between the recommendee and each reference. Most discussions about recommendation systems focus on the methods of choosing recommended candidates; few focus on foundational concepts of recommendation conditions that systems must satisfy, and problems that current systems have compared with these conditions. In this paper, recommendation systems are reconsidered from the viewpoint of multi-criteria decision making. Conventional filtering methods (e.g., collaborative filtering and content-based filtering) are formulated as linear weighted sum type recommendation systems. Several properties of linear weighted sum type recommendation systems are identified and formulated from the viewpoint of voting. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Common structure and properties of filtering systems", "paper_id": "WOS:000250508500004"}