{"auto_keywords": [{"score": 0.05007161695332443, "phrase": "wireless_sensor_networks"}, {"score": 0.048235222774692256, "phrase": "connected_backbone"}, {"score": 0.04613753985793627, "phrase": "network_dynamics"}, {"score": 0.028956380378866334, "phrase": "cc"}, {"score": 0.004733267566274583, "phrase": "performance_evaluation"}, {"score": 0.004355723710136535, "phrase": "backbone_formation"}, {"score": 0.004037694641919865, "phrase": "reorganization_time"}, {"score": 0.003998380230709541, "phrase": "energy_consumption"}, {"score": 0.0037427988766503377, "phrase": "typical_events"}, {"score": 0.0033442994551945503, "phrase": "simple_operations"}, {"score": 0.0031767199435197243, "phrase": "clique_clustering"}, {"score": 0.003024909947609294, "phrase": "first_phase"}, {"score": 0.002790075275497838, "phrase": "node_additions"}, {"score": 0.0027026379076131504, "phrase": "dmac"}, {"score": 0.002523481637809674, "phrase": "wsn_research"}, {"score": 0.002474505516708906, "phrase": "backbone_reorganization"}, {"score": 0.002333193766510394, "phrase": "resulting_backbone"}, {"score": 0.002299142268368128, "phrase": "backbone_route_length"}, {"score": 0.0022216045996270974, "phrase": "design_criteria"}, {"score": 0.0021361800485636823, "phrase": "remarkably_lower_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["wireless sensor networks", " clustering", " backbone formation"], "paper_abstract": "We present the definition and performance evaluation of a protocol for building and maintaining a connected backbone among the nodes of a wireless sensor networks (WSN). Building backbones first, and then coping with network dynamics is typical of protocols for backbone formation. Rules for building the backbone, however, do not take into account the following network dynamics explicitly. This makes maintaining a connected backbone quite costly, especially in terms of reorganization time, overhead and energy consumption. Our protocol includes in the backbone forming operations a fail-safe mechanism for dealing with the addition and the removal of nodes, which are typical events in a WSN. More specifically, the network is kept partitioned into clusters that are cliques, i.e., nodes in each cluster are directly connected to each others. Therefore, removing a node does not disrupt a cluster, and adding one requires simple operations for checking node admission to the cluster. The protocol, termed CC (\"double C\", for clique clustering), comprises three phases, each designed to render the operations of the others swift and efficient. The first phase partitions the network into clusters that are cliques. Clusters are then joined to form a backbone that is provably connected. Finally, the third, more on-line phase, maintains the backbone connected in face of node additions and removals. We compare the performance of CC with that of DMAC, a protocol that has been previously proposed for building and maintaining clusters and backbones in presence of network dynamics. Our comparison concerns metrics that are central to WSN research, such as time for clustering and backbone reorganization, corresponding overhead, extent of the reorganization (i.e., number of nodes involved in it), and properties of the resulting backbone, such as its size, backbone route length, number of gateways and nodes per cluster. Our ns2-based simulation results show that the design criteria chosen for CC are effective in producing backbones that can be reconfigured quickly and with remarkably lower overhead. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Efficiently reconfigurable backbones for wireless sensor networks", "paper_id": "WOS:000254733300003"}