{"auto_keywords": [{"score": 0.0486425660635349, "phrase": "configuration_errors"}, {"score": 0.00481495049065317, "phrase": "tackling_configuration_errors"}, {"score": 0.004478907336898875, "phrase": "dominant_causes"}, {"score": 0.004444921827311577, "phrase": "system_failures"}, {"score": 0.004198082549566806, "phrase": "system_users"}, {"score": 0.0034697573205392887, "phrase": "service_disruptions"}, {"score": 0.003094716540812336, "phrase": "survey_article"}, {"score": 0.0030595112110658675, "phrase": "holistic_and_structured_overview"}, {"score": 0.0025867643733794724, "phrase": "different_types"}, {"score": 0.002547583216040341, "phrase": "different_scenarios"}, {"score": 0.0024522007854499554, "phrase": "better_understanding"}, {"score": 0.002405853977978678, "phrase": "potential_solutions"}, {"score": 0.0023335099338323974, "phrase": "system_development"}, {"score": 0.0022806798371116698, "phrase": "followup_research"}, {"score": 0.002229043128610864, "phrase": "open_problems"}, {"score": 0.0021952683716334478, "phrase": "system_configuration"}, {"score": 0.0021049977753042253, "phrase": "first_survey"}], "paper_keywords": ["Design", " Reliability", " Configuration", " Configuration", " misconfiguration", " configuration error", " failure", " automation", " testing", " vulnerability", " detection", " validation", " deployment", " management", " diagnosis", " troubleshooting"], "paper_abstract": "In recent years, configuration errors (i.e., misconfigurations) have become one of the dominant causes of system failures, resulting in many severe service outages and downtime. Unfortunately, it is notoriously difficult for system users (e.g., administrators and operators) to prevent, detect, and troubleshoot configuration errors due to the complexity of the configurations as well as the systems under configuration. As a result, the cost of resolving configuration errors is often tremendous from the aspects of both compensating the service disruptions and diagnosing, recovering from the failures. The prevalence, severity, and cost have made configuration errors one of the most thorny system problems that desire to be addressed. This survey article provides a holistic and structured overview of the systems approaches that tackle configuration errors. To understand the problem fundamentally, we first discuss the characteristics of configuration errors and the challenges of tackling such errors. Then, we discuss the state-of-the-art systems approaches that address different types of configuration errors in different scenarios. Our primary goal is to equip the stakeholder with a better understanding of configuration errors and the potential solutions for resolving configuration errors in the spectrum of system development and management. To inspire followup research, we further discuss the open problems with regard to system configuration. To the best of our knowledge, this is the first survey on the topic of tackling configuration errors.", "paper_title": "Systems Approaches to Tackling Configuration Errors: A Survey", "paper_id": "WOS:000360005500016"}