{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "concept_location"}, {"score": 0.022723686778778344, "phrase": "identifier_names"}, {"score": 0.01018908502475867, "phrase": "program_understanding"}, {"score": 0.00859275535441649, "phrase": "natural_language_analyzers"}, {"score": 0.0054420462381228035, "phrase": "concept_location_queries"}, {"score": 0.00477924690801092, "phrase": "identifier_parsing"}, {"score": 0.004743806810821005, "phrase": "ontology_extraction"}, {"score": 0.00465634671242413, "phrase": "key_role"}, {"score": 0.00445293569103488, "phrase": "\"parse\"_identifiers"}, {"score": 0.004387117409226736, "phrase": "intended_meaning"}, {"score": 0.0037658881407605445, "phrase": "syntactic_relationships"}, {"score": 0.0035479614996805383, "phrase": "semantic_relationships"}, {"score": 0.002763850622950247, "phrase": "different_natural_language_analyzers"}, {"score": 0.0021526564019119466, "phrase": "different_analyzers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Program understanding", " Concept location", " Natural language parsing"], "paper_abstract": "Identifier names play a key role in program understanding and in particular in concept location. Programmers can easily \"parse\" identifiers and understand the intended meaning. This, however, is not trivial for tools that try to exploit the information in the identifiers to support program understanding. To address this problem, we resort to natural language analyzers, which parse tokenized identifier names and provide the syntactic relationships (dependencies) among the terms composing the identifiers. Such relationships are then mapped to semantic relationships. In this study, we have evaluated the use of off-the-shelf and trained natural language analyzers to parse identifier names, extract an ontology and use it to support concept location. In the evaluation, we assessed whether the concepts taken from the ontology can be used to improve the efficiency of queries used in concept location. We have also investigated if the use of different natural language analyzers has an impact on the ontology extracted and the support it provides to concept location. Results show that using the concepts from the ontology significantly improves the efficiency of concept location queries (e.g., in some cases, an improvement of 127% is observed). The results also indicate that the efficiency of concept location queries is not affected by the differences in the ontologies produced by different analyzers. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Supporting concept location through identifier parsing and ontology extraction", "paper_id": "WOS:000324898300016"}