{"auto_keywords": [{"score": 0.049675053299362525, "phrase": "vector-space_model"}, {"score": 0.04712665802421912, "phrase": "network_actors"}, {"score": 0.01380307798610611, "phrase": "network_tie"}, {"score": 0.00481495049065317, "phrase": "ontology-based_knowledge_network_formation"}, {"score": 0.0046544807197808095, "phrase": "empirical_way"}, {"score": 0.004556901872357751, "phrase": "network_tie_formation"}, {"score": 0.004461359547152617, "phrase": "social_network_analysis"}, {"score": 0.0043678116213858, "phrase": "usual_problem"}, {"score": 0.003670843919846253, "phrase": "network_actors'_similarities_calculations"}, {"score": 0.0034738975998176323, "phrase": "threshold_value"}, {"score": 0.0031242709509664837, "phrase": "research_project"}, {"score": 0.0029565620771207003, "phrase": "empirical_study"}, {"score": 0.0023809456271833315, "phrase": "taiwan"}, {"score": 0.002360796860462937, "phrase": "sci-tech_policy_project_network"}, {"score": 0.0022339789476489877, "phrase": "cut-off_threshold_value"}, {"score": 0.0021229583685841405, "phrase": "network_ties"}, {"score": 0.0021049977753042253, "phrase": "network_linkage_information"}], "paper_keywords": ["Social network", " Knowledge network", " Keyword", " Cut-off value", " Network formation", " Vector-Space Model"], "paper_abstract": "This study proposes an empirical way for determining probability of network tie formation between network actors. In social network analysis, it is a usual problem that information for determining whether or not a network tie should be formed is missing for some network actors, and thus network can only be partially constructed due to unavailability of information. This methodology proposed in this study is based on network actors' similarities calculations by Vector-Space Model to calculate how possible network ties can be formed. Also, a threshold value of similarity for deciding whether or not a network tie should be generated is suggested in this study. Four ontology-based knowledge networks, with journal paper or research project as network actors, constructed previously are selected as the targets of this empirical study: (1) Technology Foresight Paper Network: 181 papers and 547 keywords, (2) Regional Innovation System Paper Network: 431 papers and 1165 keywords, (3) Global Sci-Tech Policy Paper Network: 548 papers and 1705 keywords, (4) Taiwan's Sci-Tech Policy Project Network: 143 research projects and 213 keywords. The four empirical investigations allow a cut-off threshold value calculated by Vector-Space Model to be suggested for deciding the formation of network ties when network linkage information is unavailable.", "paper_title": "Assessment of ontology-based knowledge network formation by Vector-Space Model", "paper_id": "WOS:000283090300005"}