{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "automatic_error_analysis"}, {"score": 0.01562307203986565, "phrase": "machine_translation_output"}, {"score": 0.010322794842699158, "phrase": "human_error_analysis"}, {"score": 0.004755279364266046, "phrase": "evaluation_and_error_analysis"}, {"score": 0.004696344245532423, "phrase": "important_but_difficult_tasks"}, {"score": 0.004426180319550746, "phrase": "actual_erroneous_words"}, {"score": 0.004330595259996694, "phrase": "word_error_rate"}, {"score": 0.004303670776777576, "phrase": "wer"}, {"score": 0.004055998173160551, "phrase": "automatic_evaluation_measures"}, {"score": 0.003956012816350168, "phrase": "proposed_approach"}, {"score": 0.003870541730075597, "phrase": "linguistic_knowledge"}, {"score": 0.0038106195546165574, "phrase": "translation_errors"}, {"score": 0.0036137129449624727, "phrase": "five_error_categories"}, {"score": 0.0035245918797629804, "phrase": "wrong_word_order"}, {"score": 0.0030340353187232947, "phrase": "error_type"}, {"score": 0.00294993976383467, "phrase": "main_sources"}, {"score": 0.002868168412858044, "phrase": "different_translation_outputs"}, {"score": 0.0028414166961286233, "phrase": "introduced_error_categories"}, {"score": 0.002745438358145758, "phrase": "different_systems"}, {"score": 0.0026279461299595756, "phrase": "applied_methods"}, {"score": 0.002579140290642792, "phrase": "arabic-english_newswire_and_broadcast_news_and_chinese-english_newswire_outputs"}, {"score": 0.002523350122481071, "phrase": "gale"}, {"score": 0.002468747242613056, "phrase": "tc-star_project"}, {"score": 0.0024381081498230346, "phrase": "german"}, {"score": 0.0023630680726174627, "phrase": "fourth_machine_translation_workshop"}, {"score": 0.002212951892867028, "phrase": "extra_words"}, {"score": 0.002171836484200008, "phrase": "different_versions"}, {"score": 0.0021049977753042253, "phrase": "different_translation_systems"}], "paper_keywords": [""], "paper_abstract": "Evaluation and error analysis of machine translation output are important but difficult tasks. In this article, we propose a framework for automatic error analysis and classification based on the identification of actual erroneous words using the algorithms for computation of Word Error Rate (WER) and Position-independent word Error Rate (PER), which is just a very first step towards development of automatic evaluation measures that provide more specific information of certain translation problems. The proposed approach enables the use of various types of linguistic knowledge in order to classify translation errors in many different ways. This work focuses on one possible set-up, namely, on five error categories: inflectional errors, errors due to wrong word order, missing words, extra words, and incorrect lexical choices. For each of the categories, we analyze the contribution of various POS classes. We compared the results of automatic error analysis with the results of human error analysis in order to investigate two possible applications: estimating the contribution of each error type in a given translation output in order to identify the main sources of errors for a given translation system, and comparing different translation outputs using the introduced error categories in order to obtain more information about advantages and disadvantages of different systems and possibilites for improvements, as well as about advantages and disadvantages of applied methods for improvements. We used Arabic-English Newswire and Broadcast News and Chinese-English Newswire outputs created in the framework of the GALE project, several Spanish and English European Parliament outputs generated during the TC-Star project, and three German-English outputs generated in the framework of the fourth Machine Translation Workshop. We show that our results correlate very well with the results of a human error analysis, and that all our metrics except the extra words reflect well the differences between different versions of the same translation system as well as the differences between different translation systems.", "paper_title": "Towards Automatic Error Analysis of Machine Translation Output", "paper_id": "WOS:000298118200002"}