{"auto_keywords": [{"score": 0.041361508715379594, "phrase": "hessian"}, {"score": 0.015426478279711199, "phrase": "simulation_optimization"}, {"score": 0.00481495049065317, "phrase": "adaptive_newton-based_multivariate"}, {"score": 0.004769444094319619, "phrase": "functional_algorithms"}, {"score": 0.0042354707960660706, "phrase": "finite_difference_approximation"}, {"score": 0.004077508669922702, "phrase": "adaptive_newton-based_stochastic_approximation_algorithms"}, {"score": 0.0038515000499988673, "phrase": "newton-based_algorithms"}, {"score": 0.003725470458263889, "phrase": "one-sided_estimate"}, {"score": 0.0035525230119401153, "phrase": "two-sided_estimates"}, {"score": 0.0033875770020590796, "phrase": "gradient_and_hessian_estimates"}, {"score": 0.0030656196752517836, "phrase": "earlier_sf_algorithms"}, {"score": 0.002923214590192792, "phrase": "objective_function"}, {"score": 0.002881793492919646, "phrase": "similar_techniques"}, {"score": 0.0027479040199262393, "phrase": "suitable_three-timescale_stochastic_approximation_procedures"}, {"score": 0.0026452734009203764, "phrase": "detailed_convergence_analysis"}, {"score": 0.00258307991054107, "phrase": "numerical_experiments"}, {"score": 0.002304263635960015, "phrase": "related_algorithms"}], "paper_keywords": ["smoothed functional algorithms", " three-timescale stochastic approximation", " simulation optimization", " Gaussian perturbations", " Newton-based algorithms"], "paper_abstract": "In this article, we present three smoothed functional (SF) algorithms for simulation optimization. While one of these estimates only the gradient by using a finite difference approximation with two parallel simulations, the other two are adaptive Newton-based stochastic approximation algorithms that estimate both the gradient and Hessian. One of the Newton-based algorithms uses only one simulation and has a one-sided estimate in both the gradient and Hessian, while the other uses two-sided estimates in both quantities and requires two simulations. For obtaining gradient and Hessian estimates, we perturb each parameter component randomly using independent and identically distributed (i.i.d) Gaussian random variates. The earlier SF algorithms in the literature only estimate the gradient of the objective function. Using similar techniques, we derive two unbiased SF-based estimators for the Hessian and develop suitable three-timescale stochastic approximation procedures for simulation optimization. We present a detailed convergence analysis of our algorithms and show numerical experiments with parameters of dimension 50 on a setting involving a network of M/G/1 queues with feedback. We compare the performance of our algorithms with related algorithms in the literature. While our two-simulation Newton-based algorithm shows the best results overall, our one-simulation algorithm shows better performance compared to other one-simulation algorithms.", "paper_title": "Adaptive Newton-based multivariate smoothed functional algorithms for simulation optimization", "paper_id": "WOS:000253376200002"}