{"auto_keywords": [{"score": 0.04844958183775338, "phrase": "present_conditions"}, {"score": 0.00481495049065317, "phrase": "bridge_-_studies"}, {"score": 0.0047707093928203, "phrase": "high-speed_ferries"}, {"score": 0.004587154130546783, "phrase": "high-speed_bridges"}, {"score": 0.004492841495994535, "phrase": "highly_sophisticated_technical_systems"}, {"score": 0.004360010048390427, "phrase": "information_environment"}, {"score": 0.0039570128312167545, "phrase": "technical_support_systems"}, {"score": 0.0039025542443475378, "phrase": "control_engineering_approach"}, {"score": 0.0038488422503770337, "phrase": "subsequent_interviews"}, {"score": 0.003692084942658862, "phrase": "computer_support_systems"}, {"score": 0.003675064945505722, "phrase": "information_presentation"}, {"score": 0.0034607904735396797, "phrase": "control-engineering_framework"}, {"score": 0.0031918759137610523, "phrase": "control_theory"}, {"score": 0.00309023627455429, "phrase": "correct_representation"}, {"score": 0.0028172726995962147, "phrase": "single_instruments"}, {"score": 0.0027913353347879507, "phrase": "individual_displays"}, {"score": 0.0027784560880013886, "phrase": "control_panels"}, {"score": 0.0027465166414042006, "phrase": "second_thought"}, {"score": 0.002714943351733626, "phrase": "display_hierarchies"}, {"score": 0.0026467504829563297, "phrase": "completely_different_demands"}, {"score": 0.0025212722607043546, "phrase": "approaching_ship"}, {"score": 0.002503837900969975, "phrase": "radar_display"}, {"score": 0.0024636239664210433, "phrase": "interaction_dialogue"}, {"score": 0.002429668083484833, "phrase": "desktop_computer_program"}, {"score": 0.00229844995872581, "phrase": "better_integrated_information_environment"}, {"score": 0.0022303506319305394, "phrase": "key_panels"}, {"score": 0.0022149235007885805, "phrase": "navigational_devices"}, {"score": 0.002164264600379492, "phrase": "officers'_ability"}, {"score": 0.0021147618956483556, "phrase": "significant_attention"}, {"score": 0.0021049977753042253, "phrase": "information_search"}], "paper_keywords": ["human-computer interaction", " human-machine interaction", " interface design", " bridge layout", " high-speed craft"], "paper_abstract": "The purpose of this paper is to describe the present conditions for officers who work on high-speed bridges, where manoeuvring and navigation are supported by highly sophisticated technical systems. Moreover, we wanted to explore the kind of support the information environment and the interfaces on the bridge provide an officer, who wants to drive safely, detect targets early and achieve efficiency. The officers have been studied at work, to investigate and better understand the interaction between humans and technical support systems in this environment. A control engineering approach has also been used in subsequent interviews with officers. The paper describes conditions on the bridge related to manoeuvring, navigation, the computer support systems, information presentation, and the way information is acquired and used by the crew at work. Moreover, the interviews have been analysed according to a control-engineering framework. Finally, the elements of a trip have been explored to identify similarities with other means of transportation studied previously. We conclude that the four general preconditions required for control of any system according to control theory are too broad, and need to be decomposed further to provide a correct representation of all the conditions revealed in the interviews. From our findings, we argue that the way which information is integrated and presented to the officers is inappropriate. The present conditions are related to how computers are introduced in these environments. Single instruments are replaced with individual displays and control panels. Moreover, without second thought, menus, mice, display hierarchies, etc. are transferred to ship bridges that have completely different demands on operations than, for instance, an office environment. The task to increase the range or track an approaching ship on the radar display is at present performed in an interaction dialogue similar to that of a desktop computer program. The information required on the bridge is available, but sometimes the integration and layout of information is inadequate. With a better integrated information environment, it would be possible to reduce the number of displays and key panels related to navigational devices on the bridge. A more appropriate and integrated design would improve the officers' ability to operate safely, since captains otherwise may devote significant attention to information search and manipulation of controls.", "paper_title": "Work on the bridge - studies of officers on high-speed ferries", "paper_id": "WOS:000234238100004"}