{"auto_keywords": [{"score": 0.04652183999672111, "phrase": "rendezvous_problem"}, {"score": 0.009249765524446842, "phrase": "mobile_agents"}, {"score": 0.007504396876618053, "phrase": "minimum_size"}, {"score": 0.005710827005728287, "phrase": "simultaneous_start"}, {"score": 0.004329466192376432, "phrase": "labeled_agents"}, {"score": 0.0042723135679965975, "phrase": "basic_task"}, {"score": 0.004072714718555654, "phrase": "graph_exploration"}, {"score": 0.00404036314645143, "phrase": "well-known_recent_result"}, {"score": 0.003976428405478563, "phrase": "reingold"}, {"score": 0.003934361847786133, "phrase": "deterministic_exploration"}, {"score": 0.003913496350986859, "phrase": "arbitrary_graphs"}, {"score": 0.003354079159339476, "phrase": "anonymous_agents"}, {"score": 0.0033274169900727457, "phrase": "deterministic_rendezvous"}, {"score": 0.0030477155515013657, "phrase": "starting_times"}, {"score": 0.0029676793452389646, "phrase": "identical_agents"}, {"score": 0.0027545540556563604, "phrase": "delay_tau"}, {"score": 0.0026396941105704956, "phrase": "memory_bits"}, {"score": 0.0025431173776207885, "phrase": "lower_bound"}, {"score": 0.0024565977916167665, "phrase": "significant_contrast"}, {"score": 0.0023291898023664517, "phrase": "constant_memory"}, {"score": 0.00227402797304554, "phrase": "logarithmic_memory"}, {"score": 0.0022142644872733008, "phrase": "log-space_rendezvous"}, {"score": 0.002190800236951871, "phrase": "first_algorithm"}, {"score": 0.0021675840938411555, "phrase": "quotient_graph"}, {"score": 0.0021389088390106033, "phrase": "polynomial_time"}, {"score": 0.0021049977753042253, "phrase": "mobile_agent"}], "paper_keywords": ["Rendezvous", " Graph exploration", " Compact data structure"], "paper_abstract": "Two identical (anonymous) mobile agents start from arbitrary nodes in an a priori unknown graph and move synchronously from node to node with the goal of meeting. This rendezvous problem has been thoroughly studied, both for anonymous and for labeled agents, along with another basic task, that of exploring graphs by mobile agents. The rendezvous problem is known to be not easier than graph exploration. A well-known recent result on exploration, due to Reingold, states that deterministic exploration of arbitrary graphs can be performed in log-space, i.e., using an agent equipped with O(log n) bits of memory, where n is the size of the graph. In this paper we study the size of memory of mobile agents that permits us to solve the rendezvous problem deterministically. Our main result establishes the minimum size of the memory of anonymous agents that guarantees deterministic rendezvous when it is feasible. We show that this minimum size is I similar to(log n), where n is the size of the graph, regardless of the delay between the starting times of the agents. More precisely, we construct identical agents equipped with I similar to(log n) memory bits that solve the rendezvous problem in all graphs with at most n nodes, if they start with any delay tau, and we prove a matching lower bound Omega(log n) on the number of memory bits needed to accomplish rendezvous, even for simultaneous start. In fact, this lower bound is achieved already on the class of rings. This shows a significant contrast between rendezvous and exploration: e.g., while exploration of rings (without stopping) can be done using constant memory, rendezvous, even with simultaneous start, requires logarithmic memory. As a by-product of our techniques introduced to obtain log-space rendezvous we get the first algorithm to find a quotient graph of a given unlabeled graph in polynomial time, by means of a mobile agent moving around the graph.", "paper_title": "How to meet when you forget: log-space rendezvous in arbitrary graphs", "paper_id": "WOS:000303536900003"}