{"auto_keywords": [{"score": 0.049959880524500545, "phrase": "windows_operating_system"}, {"score": 0.04962608702726955, "phrase": "pseudorandom_number_generator"}, {"score": 0.046617525984071796, "phrase": "windows"}, {"score": 0.04377175032922897, "phrase": "microsoft"}, {"score": 0.027113699749899803, "phrase": "single_state"}, {"score": 0.02428984854193662, "phrase": "ssl_keys"}, {"score": 0.004498956709570376, "phrase": "almost_any_application"}, {"score": 0.004343701202264061, "phrase": "binary_code"}, {"score": 0.003918392469564327, "phrase": "nontrivial_attack"}, {"score": 0.0038818490196679085, "phrase": "internal_state"}, {"score": 0.0038276694156648386, "phrase": "previous_state"}, {"score": 0.0037215597979390076, "phrase": "forward_security"}, {"score": 0.0034770719446744996, "phrase": "windows_xp"}, {"score": 0.003317851404098585, "phrase": "operating_system"}, {"score": 0.0031882413777113362, "phrase": "user_mode"}, {"score": 0.003158485821842603, "phrase": "kernel_mode"}, {"score": 0.003070869944590677, "phrase": "administrator_privileges"}, {"score": 0.0030493472293449202, "phrase": "initial_values"}, {"score": 0.002795946862730091, "phrase": "different_copy"}, {"score": 0.0027056396248736673, "phrase": "system-generated_entropy"}, {"score": 0.002504116820704503, "phrase": "future_output"}, {"score": 0.0024289039797379636, "phrase": "buffer_overflow_attack"}, {"score": 0.002411869707120479, "phrase": "similar_attack"}, {"score": 0.0023013137927928974, "phrase": "random_values"}, {"score": 0.002232178646760318, "phrase": "future_operations"}, {"score": 0.002175300873500652, "phrase": "known_attacks"}, {"score": 0.0021049977753042253, "phrase": "attacked_machine"}], "paper_keywords": ["Security", " Pseudorandom number generator (PRNG)", " Windows operating system", " cryptanalysis"], "paper_abstract": "The PseudoRandom Number Generator (PRNG) used by the Windows operating system is the most commonly used PRNG. The pseudorandomness of the output of this generator is crucial for the security of almost any application running in Windows. Nevertheless, its exact algorithm was never published. We examined the binary code of a distribution of Windows 2000. This investigation was done without any help from Microsoft. We reconstructed the algorithm used by the pseudorandom number generator (namely, the function CryptGenRandom). We analyzed the security of the algorithm and found a nontrivial attack: Given the internal state of the generator, the previous state can be computed in 2(23) steps. This attack on forward security demonstrates that the design of the generator is flawed, since it is well known how to prevent such attacks. After our analysis was published, Microsoft acknowledged that Windows XP is vulnerable to the same attack. We also analyzed the way in which the generator is used by the operating system and found that it amplifies the effect of the attack: The generator is run in user mode rather than in kernel mode; therefore, it is easy to access its state even without administrator privileges. The initial values of part of the state of the generator are not set explicitly, but rather are defined by whatever values are present on the stack when the generator is called. Furthermore, each process runs a different copy of the generator, and the state of the generator is refreshed with system-generated entropy only after generating 128KB of output for the process running it. The result of combining this observation with our attack is that learning a single state may reveal 128KB of the past and future output of the generator. The implication of these findings is that a buffer overflow attack or a similar attack can be used to learn a single state of the generator, which can then be used to predict all random values, such as SSL keys, used by a process in all its past and future operations. This attack is more severe and more efficient than known attacks in which an attacker can only learn SSL keys if it is controlling the attacked machine at the time the keys are used.", "paper_title": "Cryptanalysis of the Random Number Generator of the Windows Operating System", "paper_id": "WOS:000272040100010"}