{"auto_keywords": [{"score": 0.044884998291174504, "phrase": "action-transferred_design_approach"}, {"score": 0.005514131283606854, "phrase": "navigation_technique"}, {"score": 0.00481495049065317, "phrase": "human_spatial_learning"}, {"score": 0.004714023408114857, "phrase": "new_action-transferred_design_approach"}, {"score": 0.00459568664065473, "phrase": "embodied_cognition"}, {"score": 0.0044424917428102445, "phrase": "spatial_learning"}, {"score": 0.004349337717774093, "phrase": "virtual_spaces"}, {"score": 0.0039620308501590795, "phrase": "human_action"}, {"score": 0.0038789122930433305, "phrase": "different_body_parts"}, {"score": 0.00378145978325955, "phrase": "interaction_techniques"}, {"score": 0.0037178503842258087, "phrase": "acquired_spatial_knowledge"}, {"score": 0.003670843919846253, "phrase": "transferred_action"}, {"score": 0.003548368289666935, "phrase": "used_body_parts"}, {"score": 0.003204841443605308, "phrase": "empirical_study"}, {"score": 0.0031110402375026016, "phrase": "action-transferred_fwip_navigation_technique"}, {"score": 0.0030586736004285216, "phrase": "spatial_knowledge_acquisition"}, {"score": 0.0030199761431186434, "phrase": "fwip_navigation_technique"}, {"score": 0.0028822153400215973, "phrase": "sf-wip"}, {"score": 0.0025919830205975215, "phrase": "full-body-based_navigation_techniques"}, {"score": 0.0024632148715152393, "phrase": "common_input_device"}, {"score": 0.002177762848946681, "phrase": "users'_spatial_learning_performance"}, {"score": 0.0021229583685841405, "phrase": "possible_design_implications"}, {"score": 0.0021049977753042253, "phrase": "broader_applications"}], "paper_keywords": ["Action-transfer", " motor equivalence", " cognitive learning", " spatial learning", " gesture", " interaction technique", " navigation technique", " virtual environment"], "paper_abstract": "We propose a new action-transferred design approach by which the benefits of embodied cognition and activity can be realized to enhance spatial learning and usability for navigating virtual spaces. The action-transferred design approach is supported by theories of learning, action-perception, and neuropsychology. These theories help us understand how human action can be transferred to different body parts for improving the usability of interaction techniques and why the acquired spatial knowledge using the transferred action may remain the same independent of the used body parts. The finger-walking-in-place (FWIP) navigation technique is used as a design example to demonstrate the concept of the action-transferred design approach. Leveraging 3D immersive virtual reality technology, we performed an empirical study to evaluate the performance of the action-transferred FWIP navigation technique in terms of spatial knowledge acquisition. The FWIP navigation technique was compared with a full-body-based walking-like (sensor-fusion walking-in-place; SF-WIP) navigation technique and a well-known, convenient (Joystick) navigation technique using a common input device, that is, a wand with a joystick. Both the action-transferred and the full-body-based navigation techniques were more effective for spatial learning than the navigation technique using the common input device. However, only the action-transferred FWIP navigation technique can provide users with the convenience of navigating with their fingers. These results suggest that the action-transferred design approach is useful in designing a navigation technique supporting users' spatial learning performance more effectively and conveniently. Possible design implications for broader applications are discussed and indicate that the action-transferred design approach is worth further study.", "paper_title": "Action-Transferred Navigation Technique Design Approach Supporting Human Spatial Learning", "paper_id": "WOS:000367406400005"}