{"auto_keywords": [{"score": 0.047719606869824786, "phrase": "evaluation_study"}, {"score": 0.028257993630130533, "phrase": "distance_learning"}, {"score": 0.027755823345396172, "phrase": "proposed_instructional_model"}, {"score": 0.00481495049065317, "phrase": "computer_specialists"}, {"score": 0.004684157900507474, "phrase": "novel_instructional_model"}, {"score": 0.004372442291178139, "phrase": "java_language_programming"}, {"score": 0.004332471656145115, "phrase": "information_technology_specialists"}, {"score": 0.004176194589991187, "phrase": "general-purpose_model"}, {"score": 0.003555902292752528, "phrase": "instructional_model"}, {"score": 0.00338060449446278, "phrase": "traditional_face-to-face_classroom"}, {"score": 0.00327356326590461, "phrase": "travel_and_maintenance_expenses"}, {"score": 0.0032287289440915187, "phrase": "public_servants"}, {"score": 0.002686284749214443, "phrase": "virtualized_course_contents"}, {"score": 0.0025071862539276283, "phrase": "satisfaction_levels"}, {"score": 0.0023507916951658455, "phrase": "traditional_classroom"}, {"score": 0.002224510044064184, "phrase": "virtualized_contents"}, {"score": 0.002183938718432764, "phrase": "mean_course_learning_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Blended learning", " Moderate constructivism", " Instructional model", " Learning objectives"], "paper_abstract": "This paper presents a novel instructional model for e-learning and an evaluation study to determine the effectiveness of this model for teaching Java language programming to information technology specialists working for the Spanish Public Administration. This is a general-purpose model that combines objectivist and constructivist learning theories and is based on the concept of learning objective. The purpose of the evaluation study is to find out whether the results of using this distance learning instructional model to teach this subject are comparable to learning in a traditional face-to-face classroom, with the plus of eliminating travel and maintenance expenses of the public servants attending the course and also saving time. The learners, selected at random to participate in this study, were divided into three groups depending on the type of teaching/learning they received: traditional classroom, distance learning with virtualized course contents and distance learning based on the proposed instructional model. The results indicate that the grades and satisfaction levels were similar for learners taught using the proposed instructional model and learners taught in the traditional classroom. Moreover, they were substantially better than for distance learning with virtualized contents, although the mean course learning time is greater. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A moderate constructivist e-learning instructional model evaluated on computer specialists", "paper_id": "WOS:000266187700006"}