{"auto_keywords": [{"score": 0.04589077221630002, "phrase": "sensitivity_indices"}, {"score": 0.015719716506582538, "phrase": "structural_damage"}, {"score": 0.013060251598009661, "phrase": "hht_method"}, {"score": 0.008486771753196742, "phrase": "sv"}, {"score": 0.007963612144680594, "phrase": "rb"}, {"score": 0.004335000368745273, "phrase": "hilbert-huang_transform"}, {"score": 0.003449718244515019, "phrase": "nonlinear_single_degree"}, {"score": 0.0033872210664940817, "phrase": "multiple_degree"}, {"score": 0.003356396922662246, "phrase": "freedom_models"}, {"score": 0.0028731719610706214, "phrase": "roof_structures"}, {"score": 0.0028210902750714075, "phrase": "findings_-_simulation_results"}, {"score": 0.0026949679939994226, "phrase": "structural_response"}, {"score": 0.0026461080202599694, "phrase": "elastic_region"}, {"score": 0.002551027887476254, "phrase": "hht"}, {"score": 0.002527830969709466, "phrase": "fft"}, {"score": 0.0024038462473178306, "phrase": "rr"}, {"score": 0.002349357968054713, "phrase": "het_spectra"}, {"score": 0.0022857351723674004, "phrase": "increasing_rr."}, {"score": 0.002244277924422011, "phrase": "fft_spectra"}, {"score": 0.0021049977753042253, "phrase": "steady_relationship"}], "paper_keywords": ["Structural engineering", " Sensitivity analysis", " Structural theory"], "paper_abstract": "Purpose - This study aims to investigate the relationship between structural damage and sensitivity indices using the Hilbert-Huang transform (HHT) method. Design/methodology/approach - The relationship between structural damage and the sensitivity indices is obtained by using the HHT method. Three sensitivity indices are proposed: the ratio of rotation (RR), the ratio of shifting value (SV) and the ratio of bandwidth (RB). The nonlinear single degree of freedom and multiple degree of freedom models with various predominant frequencies are constructed using the SAP2000 program. Adjusted PGA El Centro and Chi-Chi (TCU068) earthquake data are used as the excitations. Next, the sensitivity indices obtained using the HHT and the fast Fourier transform (FFT) methods are evaluated separately based on the acceleration responses of the roof structures to earthquakes. Findings - Simulation results indicate that, when RR < 1, the structural response is in the elastic region, and neither the RB nor SV in the HHT and FFT spectra change. When the structural response is nonlinear, i.e. RR1, a positive trend of change occurs in RB and RR, while in the HET spectra, SV increases with an increasing RR. Moreover, the FFT spectra reveal that SV changes only when the RR is sufficiently large. No steady relationship between the RB and the RR can be found. Originality/value - The paper demonstrates the effectiveness of the HHT method.", "paper_title": "Detecting the sensitivity of structural damage based on the Hilbert-Huang transform approach", "paper_id": "WOS:000286569400002"}