{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "task_complexity"}, {"score": 0.021499624891755494, "phrase": "medlineplus"}, {"score": 0.010509123254216334, "phrase": "people's_mental_models"}, {"score": 0.004257806363128601, "phrase": "consumer_health_information"}, {"score": 0.004195418010131832, "phrase": "general_public"}, {"score": 0.004154332348800334, "phrase": "thirty-eight_subjects"}, {"score": 0.003858697684681798, "phrase": "subjects'_perceptions"}, {"score": 0.0032639039638211347, "phrase": "subjects'_mental_models"}, {"score": 0.0026020254041372723, "phrase": "pragmatic_aspect"}, {"score": 0.002576503437739865, "phrase": "mental_models"}, {"score": 0.0025262061502713683, "phrase": "subjects'_descriptions"}, {"score": 0.0023928819778638055, "phrase": "hypothetical_task"}, {"score": 0.0022005118194652704, "phrase": "new_tasks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mental models", " Task complexity", " MedlinePlus", " Task impact", " Information retrieval", " Consumer health information systems"], "paper_abstract": "This study explored the impact of task complexity on people's mental models of MedlinePlus, an information-rich web space providing consumer health information to the general public. Thirty-eight subjects were randomly assigned to two groups, performing either simple or complex search tasks. After the search session, subjects' perceptions of MedlinePlus were elicited using a concept listing protocol where subjects listed concepts concerning MedlinePlus in the order each concept occurred to them. The analysis of the concepts suggested that task complexity impacted subjects' mental models by influencing the objects in the system that they perceived and represented, the specificity of the representations, their evaluations of and emotions about the objects, and the heuristics that they developed for what works and what does not in the system. The pragmatic aspect of mental models was represented by subjects' descriptions of the steps that they would follow to tackle a hypothetical task. The analysis showed that task complexity affected the strategies that subjects perceived themselves using to solve new tasks using the system. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The impact of task complexity on people's mental models of MedlinePlus", "paper_id": "WOS:000297611400009"}