{"auto_keywords": [{"score": 0.04844170546569222, "phrase": "graph_kernels"}, {"score": 0.00481495049065317, "phrase": "kernel_attributes"}, {"score": 0.004610058444728656, "phrase": "graph_matching"}, {"score": 0.0044524122425287005, "phrase": "different_kinds"}, {"score": 0.00417115038996633, "phrase": "similarity_measure"}, {"score": 0.004099183062034004, "phrase": "non-attributed_graphs"}, {"score": 0.003941746077126688, "phrase": "graph-matching_cost_function"}, {"score": 0.0038737214010638745, "phrase": "probabilistic_framework"}, {"score": 0.0037411604449359794, "phrase": "graph-matching_algorithm"}, {"score": 0.0035662378173267647, "phrase": "representative_prototype"}, {"score": 0.0033553473725594003, "phrase": "input_graphs"}, {"score": 0.0027104531025934865, "phrase": "proposed_method"}, {"score": 0.0026062133750675894, "phrase": "central_clustering_algorithm"}, {"score": 0.0023270035715132866, "phrase": "central_graph"}, {"score": 0.0021797112385590913, "phrase": "proposed_methods"}, {"score": 0.0021607883988873492, "phrase": "structural_recognition_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Graph algorithms", " Pattern matching", " Clustering", " Computer vision"], "paper_abstract": "In this paper, we exploit graph kernels for graph matching and clustering. Firstly, we analyze different kinds of graph kernels in order to extract from them attributes to be used as a similarity measure between nodes of non-attributed graphs. Next, such attributes are embedded in a graph-matching cost function, through a probabilistic framework, and we evaluate their performance within a graph-matching algorithm. Secondly, we propose a method for obtaining a representative prototype from a set of graphs, which relies on obtaining all the pairwise matchings between the input graphs, and uses the information provided by graph kernels in order to select the matchings that will be considered for obtaining the prototype. Nodes and edges in such a prototype graph register their frequency of occurrence, so that it can be considered a first-order generative model. The proposed method for building prototypes is efficiently integrated into a central clustering algorithm, which allows us to unsupervisedly learn the class-structure of a given set of graphs, and the prototypes representing each class, thus obtaining a central graph clustering algorithm with the same computational cost than a pairwise one. We successfully apply the proposed methods to structural recognition problems. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Graph matching and clustering using kernel attributes", "paper_id": "WOS:000319952700017"}