{"auto_keywords": [{"score": 0.032854255577662896, "phrase": "initial_positions"}, {"score": 0.015431749428505994, "phrase": "localization_problem"}, {"score": 0.014016027272591583, "phrase": "arbitrary_velocities"}, {"score": 0.012219592826017341, "phrase": "finite_time"}, {"score": 0.00481495049065317, "phrase": "colliding_robots"}, {"score": 0.004586531354697466, "phrase": "anonymous_mobile_robots"}, {"score": 0.004501578643090429, "phrase": "continuous_ring"}, {"score": 0.004224286804379592, "phrase": "clockwise_or_counterclockwise_direction"}, {"score": 0.003691969158027291, "phrase": "initial_position"}, {"score": 0.0036507498735369576, "phrase": "initial_velocity"}, {"score": 0.003609989117581185, "phrase": "deployed_robot"}, {"score": 0.0027261023678401696, "phrase": "czyzowicz_et_al"}], "paper_keywords": ["Mobile robots", " Algorithms", " Synchronous systems", " Elastic collisions"], "paper_abstract": "We study the localization problem in the ring: a collection of anonymous mobile robots are deployed in a continuous ring of perimeter one. All robots start moving at the same time with arbitrary velocities, starting in clockwise or counterclockwise direction around the ring. The robots bounce against each other according to the principles of conservation of energy and momentum. The task of each robot is to find out, in finite time, the initial position and the initial velocity of every deployed robot. The only way that robots perceive the information about the environment is by colliding with their neighbors; robots have no control of their walks or velocities moreover any type of communication among them is not possible. The configuration of initial positions of robots and their speeds is considered feasible, if there is a finite time, after which every robot starting at this configuration knows initial positions and velocities of all other robots. It was conjectured in Czyzowicz et al. (2012) that if the principles of conservation of energy and momentum were assumed and the robots had arbitrary velocities, the localization problem might be solvable. We prove that this conjecture is false. We show that if are the velocities of a given robot configuration , then is feasible if and only if for all , where . To figure out the initial positions of all robots no more than time is required.", "paper_title": "Localization for a system of colliding robots", "paper_id": "WOS:000358780800003"}