{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "typical_problem"}, {"score": 0.004761253507368234, "phrase": "research_area"}, {"score": 0.004725787037228084, "phrase": "service-oriented_architectures"}, {"score": 0.004586531354697466, "phrase": "existing_services"}, {"score": 0.004468037801239238, "phrase": "complex_task"}, {"score": 0.0041151131903594445, "phrase": "abstract_description"}, {"score": 0.004053994613859937, "phrase": "interaction_protocols"}, {"score": 0.003609989117581185, "phrase": "specific_services"}, {"score": 0.0033747739383101095, "phrase": "web_service_terminology"}, {"score": 0.003190474123738408, "phrase": "individual_services"}, {"score": 0.0030963190575539574, "phrase": "preliminary_study"}, {"score": 0.0030162086479223506, "phrase": "public_choreography_specifications"}, {"score": 0.002982511360424684, "phrase": "executable_interaction_policies"}, {"score": 0.0023031224517224757, "phrase": "twofold_aim"}, {"score": 0.0022688546528208133, "phrase": "interactive_behavior"}, {"score": 0.0021609589091422608, "phrase": "policy_executable"}, {"score": 0.0021367960510499575, "phrase": "possible_extension"}, {"score": 0.0021208374456760447, "phrase": "ws-cdl"}, {"score": 0.0021049977753042253, "phrase": "capability_requirements"}], "paper_keywords": [""], "paper_abstract": "A typical problem of the research area on Service-Oriented Architectures is the composition of a set of existing services with the aim of executing a complex task. The selection and composition of the services are based on a description of the services themselves and can exploit an abstract description of their interactions. Interaction protocols (or choreographies) capture the interaction as a whole, defining the rules that entities should respect in order to guarantee the interoperability; they do not refer to specific services but they specify the roles and the communication among the roles. Policies (behavioral interfaces in web service terminology), instead, focus on communication from the point of view of the individual services. In this paper we present a preliminary study aimed to allow the use of public choreography specifications for generating executable interaction policies for peers that would like to take part in an interaction. Usually the specifications capture only the interactive behavior of the system as a whole. We propose to enrich the choreography by a set of requirements of capabilities that the parties should exhibit, where by the term \"capability\" we mean the skill of doing something or of making some condition become true. Such capabilities have the twofold aim of connecting the interactive behavior to be shown by the role-player to its internal state and of making the policy executable. A possible extension of WS-CDL with capability requirements is proposed.", "paper_title": "Interaction protocols and capabilities: A preliminary report", "paper_id": "WOS:000241555100005"}