{"auto_keywords": [{"score": 0.04003829696972764, "phrase": "cross-sectional_properties"}, {"score": 0.004530794611704416, "phrase": "thin_structures"}, {"score": 0.004011603024990615, "phrase": "serious_automation_challenges"}, {"score": 0.0032746712603464235, "phrase": "first_method"}, {"score": 0.0031125795874844438, "phrase": "algebraic_reduction_process"}, {"score": 0.0030500051941781034, "phrase": "reduction_process"}, {"score": 0.0029735479904284706, "phrase": "stiffness_matrix"}, {"score": 0.0028120022457134267, "phrase": "lower-dimensional_space"}, {"score": 0.0027000395818027366, "phrase": "second_method"}, {"score": 0.002214734873559146, "phrase": "thickness_direction"}, {"score": 0.002181227522730908, "phrase": "proposed_methodologies"}, {"score": 0.0021373366163721518, "phrase": "numerical_experiments"}, {"score": 0.0021050313179919802, "phrase": "doi"}], "paper_keywords": ["thin plates", " locking", " Kirchhoff-Love", " algebraic reduction", " surface integration", " dual representation"], "paper_abstract": "It is well recognized that 3D finite element analysis is inappropriate for analyzing thin structures such as plates and shells. Instead, a variety of highly efficient and specialized 2D methods have been developed for analyzing such structures. However, 2D methods pose serious automation challenges in today's 3D design environment. Specifically, analysts must manually extract cross-sectional properties from a 3D computer aided design (CAD) model and import them into a 2D environment for analysis. In this paper, we propose two efficient yet easily automatable dual representation methods for analyzing thin plates. The first method exploits standard off-the-shelf 3D finite element packages and achieves high computational efficiency through an algebraic reduction process. In the reduction process, a 3D plate bending stiffness matrix is constructed from a 3D mesh and then projected onto a lower-dimensional space by appealing to standard 2D plate theories. In the second method, the analysis is carried out by integrating 2D shape functions over the boundary of the 3D plate. Both methods do not entail extraction of the cross-sectional properties of the plate. However, the user must identify the plate or thickness direction. The proposed methodologies are substantiated through numerical experiments. [DOI: 10.1115/1.3510587]", "paper_title": "Dual Representation Methods for Efficient and Automatable Analysis of 3D Plates", "paper_id": "WOS:000285480300002"}