{"auto_keywords": [{"score": 0.04844170546569224, "phrase": "complex_cognitive_activities"}, {"score": 0.010612387000973441, "phrase": "visual_representations"}, {"score": 0.010340641136497054, "phrase": "human-information_interaction"}, {"score": 0.009240500547704303, "phrase": "visual_analytics"}, {"score": 0.00457013354092966, "phrase": "analytical_reasoning"}, {"score": 0.004262881313926916, "phrase": "interactive_computational_tools"}, {"score": 0.004153041453795458, "phrase": "decision_support"}, {"score": 0.004099183062034004, "phrase": "educational_tools"}, {"score": 0.003924629168434799, "phrase": "visual_interface"}, {"score": 0.003644714340300824, "phrase": "relational_properties"}, {"score": 0.0031568884810273226, "phrase": "interactive_visual_representations"}, {"score": 0.002868404184756449, "phrase": "better_coordination"}, {"score": 0.0027341763737751467, "phrase": "higher_quality_performance"}, {"score": 0.0025723630851105304, "phrase": "cognitive_processing"}, {"score": 0.0025500402081330394, "phrase": "visual_reasoning"}, {"score": 0.002367931598717088, "phrase": "broader_theoretical_framework"}, {"score": 0.002257070536352418, "phrase": "systematic_research"}, {"score": 0.0021892345747666977, "phrase": "numerous_fields"}, {"score": 0.0021702292394814144, "phrase": "information_visualization"}, {"score": 0.002151388538895855, "phrase": "health_informatics"}, {"score": 0.0021049977753042253, "phrase": "educational_technology"}], "paper_keywords": [""], "paper_abstract": "Complex cognitive activities, such as analytical reasoning, problem solving, and sense making, are often performed through the mediation of interactive computational tools. Examples include visual analytics, decision support, and educational tools. Through interaction with visual representations of information at the visual interface of these tools, a joint, coordinated cognitive system is formed. This partnership results in a number of relational properties-those depending on both humans and tools-that researchers and designers must be aware of if such tools are to effectively support the performance of complex cognitive activities. This article presents 10 properties of interactive visual representations that are essential and relational and whose values can be adjusted through interaction. By adjusting the values of these properties, better coordination between humans and tools can be effected, leading to higher quality performance of complex cognitive activities. This article examines how the values of these properties affect cognitive processing and visual reasoning and demonstrates the necessity of making their values adjustable-all of which is situated within a broader theoretical framework concerned with human-information interaction in complex cognitive activities. This framework can facilitate systematic research, design, and evaluation in numerous fields including information visualization, health informatics, visual analytics, and educational technology.", "paper_title": "Adjustable Properties of Visual Representations: Improving the Quality of Human-Information Interaction", "paper_id": "WOS:000335582300003"}