{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "seasonal_supply_chain"}, {"score": 0.022432086499255387, "phrase": "bullwhip_effect"}, {"score": 0.007122153057314069, "phrase": "bullwhip_effect_measure"}, {"score": 0.005529907751140459, "phrase": "seasonal_cycle"}, {"score": 0.004241771072194993, "phrase": "external_demand"}, {"score": 0.003736567662016446, "phrase": "base-stock_policy"}, {"score": 0.0036245239349157236, "phrase": "demand_forecast"}, {"score": 0.003341839487905525, "phrase": "minimum_mean-square_error_forecasting_technique"}, {"score": 0.0031284221314354095, "phrase": "lead_time_demand_forecast"}, {"score": 0.003019189898170698, "phrase": "optimal_inventory_policy"}, {"score": 0.002840708910768261, "phrase": "order_quantity"}, {"score": 0.0024641134634779535, "phrase": "important_role"}, {"score": 0.002294929467537814, "phrase": "replenishment_lead_time"}, {"score": 0.0021049977753042253, "phrase": "lead_time"}], "paper_keywords": ["Seasonal supply chain", " Bullwhip effect", " Seasonal autoregressive-moving average processes", " Seasonal cycle"], "paper_abstract": "In this study, the bullwhip effect in a seasonal supply chain was quantified by considering a two echelon supply chain which consists of one supplier and one retailer. The external demand occurring at the customer was assumed to follow a SARMA (1, 0) X (0, 1) (s) scheme, a seasonal autoregressive-moving average process, while the retailer employed an base-stock policy to replenish their inventory. The demand forecast was performed with a SARMA (1, 0) X (0, 1) (s) using the minimum mean-square error forecasting technique. In order to develop the bullwhip effect measure in a seasonal supply chain, the lead time demand forecast, forecast error, and the optimal inventory policy at the retailer were derived in sequence. The variance of order quantity based on these results was obtained. Then, various properties were derived by analyzing the bullwhip effect measure. Specifically, it was determined that the seasonal cycle plays an important role in bullwhip effect under a seasonal supply chain. The findings also point out that the replenishment lead time must be less than the seasonal cycle in order to reduce the bullwhip effect. Therefore, the lead time needs to be reduced through collaboration between the retailer and supplier.", "paper_title": "Bullwhip effect measure in a seasonal supply chain", "paper_id": "WOS:000311507600020"}