{"auto_keywords": [{"score": 0.04852232688729349, "phrase": "recommender_systems"}, {"score": 0.00481523109458132, "phrase": "explicit"}, {"score": 0.004218602458288531, "phrase": "traditional_recommender_systems"}, {"score": 0.0036958398682001015, "phrase": "real-world_observations"}, {"score": 0.00327356326590461, "phrase": "novel_probabilistic_factor_analysis_framework"}, {"score": 0.0031845067058084583, "phrase": "users'_tastes"}, {"score": 0.0030470127429039497, "phrase": "proposed_framework"}, {"score": 0.002851790448644913, "phrase": "pure_user-item_rating_matrix"}, {"score": 0.0027437235598539904, "phrase": "explicit_social_trust_information"}, {"score": 0.0025820967615278073, "phrase": "term_social_trust_ensemble"}, {"score": 0.0024842242921857705, "phrase": "social_trust_restrictions"}, {"score": 0.00240328454980006, "phrase": "complexity_analysis"}, {"score": 0.0021401625519713577, "phrase": "experimental_results"}], "paper_keywords": ["Algorithms", " Experimentation", " Recommender systems", " social network", " social trust ensemble", " matrix factorization"], "paper_abstract": "Recommender systems have been well studied and developed, both in academia and in industry recently. However, traditional recommender systems assume that all the users are independent and identically distributed; this assumption ignores the connections among users, which is not consistent with the real-world observations where we always turn to our trusted friends for recommendations. Aiming at modeling recommender systems more accurately and realistically, we propose a novel probabilistic factor analysis framework which naturally fuses the users' tastes and their trusted friends' favors together. The proposed framework is quite general, and it can also be applied to pure user-item rating matrix even if we do not have explicit social trust information among users. In this framework, we coin the term social trust ensemble to represent the formulation of the social trust restrictions on the recommender systems. The complexity analysis indicates that our approach can be applied to very large datasets since it scales linearly with the number of observations, while the experimental results show that our method outperforms state-of-the-art approaches.", "paper_title": "Learning to Recommend with Explicit and Implicit Social Relations", "paper_id": "WOS:000208617000012"}