{"auto_keywords": [{"score": 0.049465088868450455, "phrase": "arbitrary_unstructured_meshes"}, {"score": 0.010985018032136324, "phrase": "existing_algorithms"}, {"score": 0.009416537794609528, "phrase": "ffisam"}, {"score": 0.00481495049065317, "phrase": "tvd_schemes"}, {"score": 0.004662036750452837, "phrase": "refined_r-factor_algorithm"}, {"score": 0.004231699728933577, "phrase": "face-perpendicular_far-upwind_interpolation_scheme"}, {"score": 0.0038908817250961633, "phrase": "extensive_review"}, {"score": 0.003816197777388722, "phrase": "existing_r-factor_algorithms"}, {"score": 0.003647442345566347, "phrase": "design_principles"}, {"score": 0.002411383506019635, "phrase": "better_overall_performance"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["total variation diminishing (TVD)", " high-resolution scheme (HRS)", " normalized variable diagram (NVD)", " r-factor algorithm", " convection discretization", " unstructured meshes"], "paper_abstract": "A refined r-factor algorithm for implementing total variation diminishing (TVD) schemes on arbitrary unstructured meshes, referred to henceforth as a face-perpendicular far-upwind interpolation scheme for arbitrary meshes (FFISAM), is proposed based on an extensive review of the existing r-factor algorithms available in the literature. The design principles, as well as the respective advantages and disadvantages, of the existing algorithms are first systematically analyzed before presenting the FFISAM. The FFISAM is designed to combine the merits of various existing r-factor algorithms. The performance of the FFISAM, implemented in 10 classical TVD schemes, is evaluated against four two-dimensional pure-advection benchmark test cases where analytical solutions are available. The numerical results clearly show that the FFISAM leads to a better overall performance than the existing algorithms in terms of accuracy and convergence on arbitrary unstructured meshes for the 10 classical TVD schemes. Copyright (C) 2015 John Wiley & Sons, Ltd.", "paper_title": "A refined r-factor algorithm for TVD schemes on arbitrary unstructured meshes", "paper_id": "WOS:000366455200001"}