{"auto_keywords": [{"score": 0.047044208386262, "phrase": "intuitionistic_normal_fuzzy_numbers"}, {"score": 0.027708409639554038, "phrase": "induced_intuitionistic_normal_fuzzy_related_aggregation_operators"}, {"score": 0.00481495049065317, "phrase": "multi-criteria_decision-making_method"}, {"score": 0.004729856080441582, "phrase": "induced_intuitionistic_normal_fuzzy_related_aggregation_operators."}, {"score": 0.004352123742308589, "phrase": "score_function"}, {"score": 0.004174677062711731, "phrase": "aggregation_operators"}, {"score": 0.004028326293950714, "phrase": "fuzzy_weighted_averaging_operator"}, {"score": 0.0038870860864224656, "phrase": "weighted_geometric_averaging_operator"}, {"score": 0.0032130703855586685, "phrase": "intuitionistic_normal_fuzzy_related_ordered_weighted_geometric_averaging_operator"}, {"score": 0.0025169965861573185, "phrase": "comprehensive_evaluation_values"}, {"score": 0.0022745508619577927, "phrase": "whole_alternatives"}, {"score": 0.002168664249034287, "phrase": "relative_closeness"}, {"score": 0.0021049977753042253, "phrase": "ideal_solution"}], "paper_keywords": ["Multi-criteria decision making", " intuitionistic normal fuzzy numbers", " intuitionistic normal fuzzy aggregation operators", " induced intuitionistic normal fuzzy related aggregation operators"], "paper_abstract": "In this paper, we first defined intuitionistic normal fuzzy numbers as well as their operational laws and score function. Next, we proposed some aggregation operators including ordered intuitionistic normal ordered fuzzy weighted averaging operator, intuitionistic normal fuzzy ordered weighted geometric averaging operator, intuitionistic normal fuzzy related ordered weighted averaging operator, intuitionistic normal fuzzy related ordered weighted geometric averaging operator, induced intuitionistic normal fuzzy related ordered weighted averaging operator and induced intuitionistic normal fuzzy related ordered weighted geometric averaging operator. After that, similarity measure between two intuitionistic normal fuzzy numbers is defined. For multi-criteria decision making problems, in which the criteria are interactive and the criteria values are intuitionistic normal fuzzy numbers, an approach based on induced intuitionistic normal fuzzy related aggregation operators is proposed. And the comprehensive evaluation values of all alternatives can be derived by applying induced intuitionistic normal fuzzy related aggregation operators. Finally, the ranking of the whole alternatives set can be obtained by comparing the relative closeness of alternatives to the ideal solution. In the end, an example is given to show the validity and the feasibility of the method.", "paper_title": "MULTI-CRITERIA DECISION-MAKING METHOD BASED ON INDUCED INTUITIONISTIC NORMAL FUZZY RELATED AGGREGATION OPERATORS", "paper_id": "WOS:000307073900003"}