{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "life_sciences"}, {"score": 0.004444921827311577, "phrase": "data_collection"}, {"score": 0.004405596416783185, "phrase": "data_analysis"}, {"score": 0.004195418010131832, "phrase": "biological_effects"}, {"score": 0.0038900709793274484, "phrase": "wide_use"}, {"score": 0.0038556354709511818, "phrase": "information_technology"}, {"score": 0.0035590664550919854, "phrase": "modeling_activities"}, {"score": 0.0035118972210075633, "phrase": "new_targets"}, {"score": 0.0033442114331500407, "phrase": "inductive_activity"}, {"score": 0.0032272929113113203, "phrase": "futures_outcomes"}, {"score": 0.003198705576491802, "phrase": "previous_experience"}, {"score": 0.002572001496778222, "phrase": "particular_field"}, {"score": 0.0025492038831408715, "phrase": "biological_sciences"}, {"score": 0.002515384834484012, "phrase": "computational_toxicity"}, {"score": 0.0022304616068189575, "phrase": "computer_science"}, {"score": 0.002200861826643147, "phrase": "epistemological_problem"}, {"score": 0.0021049977753042253, "phrase": "pragmatic_sense"}], "paper_keywords": ["modeling", " biological data", " prediction"], "paper_abstract": "Life sciences, and biology in particular, are heavily impacted by the development of methods for data collection and data analysis. Taking advantage of the availability of data, modeling biological effects is becoming more and more popular and relevant in life sciences, due to the diffuse and wide use of information technology (IT) tools. IT is increasing the availability of models, the horizon and complexity of modeling activities, reaching new targets, and boosting \"virtuality\". Modeling, as any inductive activity, originates from two needs: to predict futures outcomes using previous experience, and to explain observations, or in other terms to infer knowledge. In this paper we analyze criteria, problems, possibilities and advancements which indicate that the time for e-modeling in biology and other life sciences is ripe. To do this, we take as example a particular field of biological sciences, the computational toxicity (CT) of chemicals, and its usual QSAR (Quantitative Structure Activity Relationships) approach. The open possibilities are evaluated, including a reshaping of the interface between toxicology, chemistry and computer science. The epistemological problem about \"what models are\" is approached in a pragmatic sense.", "paper_title": "E-modelling: Foundations and cases for applying AI to life sciences", "paper_id": "WOS:000250893600005"}