{"auto_keywords": [{"score": 0.04335313856025993, "phrase": "qa_pages"}, {"score": 0.00481495049065317, "phrase": "latent_browsing_graph"}, {"score": 0.004123545502712169, "phrase": "browsing_behavior"}, {"score": 0.004096409451697279, "phrase": "on-line_module"}, {"score": 0.004066416005586085, "phrase": "on-line_qa_page_recommendation"}, {"score": 0.004007083686875716, "phrase": "off-line_module"}, {"score": 0.003820144626025562, "phrase": "user_click_streams"}, {"score": 0.00377261806831085, "phrase": "qa_latent_browsing_graph"}, {"score": 0.0037231102027070724, "phrase": "higher_importance"}, {"score": 0.0035233696341819437, "phrase": "relevant_relationships"}, {"score": 0.003190367939051776, "phrase": "qa_browsing_graph_structures"}, {"score": 0.002996992362027833, "phrase": "qa_browsing_graph"}, {"score": 0.0027741761880779535, "phrase": "sparsity_problem"}, {"score": 0.002673957615079041, "phrase": "latent_browsing_relations"}, {"score": 0.002539689093411356, "phrase": "importance_score"}, {"score": 0.00247509835229599, "phrase": "latent_browsing_rank"}, {"score": 0.0024389277933858054, "phrase": "relevance_score"}, {"score": 0.0023768935613578007, "phrase": "latent_browsing_recommendation_rank"}, {"score": 0.002136226584784576, "phrase": "extensive_empirical_experiments"}, {"score": 0.002120556419037902, "phrase": "yahoo"}, {"score": 0.0021049977753042253, "phrase": "asia_knowledge_plus"}], "paper_keywords": ["browsing graph", " question answering", " recommendation"], "paper_abstract": "In this paper, we develop a framework of Question Answering Pages (referred to as QA pages) recommendation. Our proposed framework consists of the two modules: the off-line module to determine the importance of QA pages and the on-line module for on-line QA page recommendation. In the off-line module, we claim that the importance of QA pages could be discovered from user click streams. If the QA pages are of higher importance, many users will click and spend their time on these QA pages. Moreover, the relevant relationships among QA pages are captured by the browsing behavior on these QA pages. As such, we exploit user click streams to model the browsing behavior among QA pages as QA browsing graph structures. The importance of QA pages is derived from our proposed QA browsing graph structures. However, we observe that the QA browsing graph is sparse and that most of the QA pages do not link to other QA pages. This is referred to as a sparsity problem. To overcome this problem, we utilize the latent browsing relations among QA pages to build a QA Latent Browsing Graph. In light of QA latent browsing graph, the importance score of QA pages (referred to as Latent Browsing Rank) and the relevance score of QA pages (referred to as Latent Browsing Recommendation Rank) are proposed. These scores demonstrate the use of a QA latent browsing graph not only to determine the importance of QA pages but also to recommend QA pages. We conducted extensive empirical experiments on Yahoo! Asia Knowledge Plus to evaluate our proposed framework.", "paper_title": "Exploring latent browsing graph for question answering recommendation", "paper_id": "WOS:000307722700006"}