{"auto_keywords": [{"score": 0.004814961217670101, "phrase": "honesty"}, {"score": 0.004581660953729745, "phrase": "other's_cognitive_models"}, {"score": 0.0045404698551856125, "phrase": "open_distributed_systems"}, {"score": 0.004339979174946844, "phrase": "dynamic_nature"}, {"score": 0.004074016501033133, "phrase": "self-interested_agents"}, {"score": 0.003983016985197904, "phrase": "trust_models"}, {"score": 0.00391167729353583, "phrase": "shared_cognitive_model"}, {"score": 0.003294350220187021, "phrase": "different_quality"}, {"score": 0.002955533639862811, "phrase": "trust_model"}, {"score": 0.0028634235895823594, "phrase": "concrete_cognitive_model"}, {"score": 0.00237861522566195, "phrase": "different_model"}, {"score": 0.0021826210858934933, "phrase": "dynamic_scenarios"}, {"score": 0.0021049977753042253, "phrase": "market-like_evolving_environments"}], "paper_keywords": ["trust", " reputation", " ART-testbed"], "paper_abstract": "Open distributed systems pose a challenge to trust modelling due to the dynamic nature of these systems (e.g., electronic auctions) and the unreliability of self-interested agents. The majority of trust models implicitly assume a shared cognitive model for all the agents participating in a society, and thus they treat the discrepancy between information and experience as a source of distrust: if an agent states a given quality of service, and another agent experiences a different quality for that service, such discrepancy is typically assumed to indicate dishonesty, and thus trust is reduced. Herein, we propose a trust model, which does not assume a concrete cognitive model for other agents, but instead uses the discrepancy between the information about other agents and its own experience to better predict the behavior of the others. This neutrality about other agents' cognitive models allows an agent to obtain utility from lyres or agents having a different model of the world. The experiments performed suggest that this model improves the performance of an agent in dynamic scenarios under certain conditions such as those found in market-like evolving environments.", "paper_title": "Honesty and trust revisited: the advantages of being neutral about other's cognitive models", "paper_id": "WOS:000250115600003"}