{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "depth_judgments"}, {"score": 0.004771672073078768, "phrase": "real_and_augmented_reality_targets"}, {"score": 0.00439918275666155, "phrase": "virtual_objects"}, {"score": 0.004129607015893271, "phrase": "perceived_depth"}, {"score": 0.004092463367307375, "phrase": "ar_objects"}, {"score": 0.003415681637907093, "phrase": "real_and_ar_target_objects"}, {"score": 0.0031629800646754505, "phrase": "real_target"}, {"score": 0.0030783143919343972, "phrase": "ar_target"}, {"score": 0.0030505976034245234, "phrase": "collimating_optics"}, {"score": 0.002699889709390707, "phrase": "eyes'_vergence_angle"}, {"score": 0.002627587221594597, "phrase": "constant_angular_amount"}, {"score": 0.002568812627436125, "phrase": "error_bounds"}, {"score": 0.002488724764295623, "phrase": "reaching_distances"}, {"score": 0.002389403849342894, "phrase": "ar_displays"}, {"score": 0.00233594452829104, "phrase": "adjustable_focus"}, {"score": 0.0021241414408077895, "phrase": "consistent_proprioception"}, {"score": 0.0021049977753042253, "phrase": "corrective_visual_feedback"}], "paper_keywords": ["Depth judgment", " perceptual matching", " blind reaching", " accommodation", " vergence", " augmented reality"], "paper_abstract": "Many compelling augmented reality (AR) applications require users to correctly perceive the location of virtual objects, some with accuracies as tight as 1 mm. However, measuring the perceived depth of AR objects at these accuracies has not yet been demonstrated. In this paper, we address this challenge by employing two different depth judgment methods, perceptual matching and blind reaching, in a series of three experiments, where observers judged the depth of real and AR target objects presented at reaching distances. Our experiments found that observers can accurately match the distance of a real target, but when viewing an AR target through collimating optics, their matches systematically overestimate the distance by 0.5 to 4.0 cm. However, these results can be explained by a model where the collimation causes the eyes' vergence angle to rotate outward by a constant angular amount. These findings give error bounds for using collimating AR displays at reaching distances, and suggest that for these applications, AR displays need to provide an adjustable focus. Our experiments further found that observers initially reach. 4 cm too short, but reaching accuracy improves with both consistent proprioception and corrective visual feedback, and eventually becomes nearly as accurate as matching.", "paper_title": "Matching and Reaching Depth Judgments with Real and Augmented Reality Targets", "paper_id": "WOS:000362355100012"}