{"auto_keywords": [{"score": 0.038971082876598624, "phrase": "secret_image"}, {"score": 0.01557276120808942, "phrase": "color_images"}, {"score": 0.00481495049065317, "phrase": "visual_cryptography_scheme"}, {"score": 0.004569905085027681, "phrase": "pattern_recognition"}, {"score": 0.0043786774510943625, "phrase": "four-share_visual_cryptography_scheme"}, {"score": 0.004195418010131832, "phrase": "dithered_eight-color_secret_image"}, {"score": 0.003815064377019477, "phrase": "black_mask"}, {"score": 0.002965229277927781, "phrase": "randomly_chosen_two-color_secret_image"}, {"score": 0.002186712881521657, "phrase": "secret_images"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Visual cryptography", " Dithering technology", " Color decomposition", " Secret sharing", " Cryptanalysis"], "paper_abstract": "Hou [Visual cryptography for color images, Pattern Recognition 36 (2003) 1619-1629] proposed a four-share visual cryptography scheme for color images. The scheme splits a dithered eight-color secret image into four shares: the black mask and other three shares. It was claimed that without knowing the black mask, no information about the secret image can be obtained even if all the other three shares are known. in this paper, we show that this may be true for a few specific two-color secret images only. In all other cases, however, security cannot be guaranteed. We show that an attacker can compromise a randomly chosen two-color secret image from any two of the other three shares with probability 4/7 by completely recovering the shape and pattern of the secret image. The advantage will increase to 6/7 all the three shares are known. If the secret image has three or four colors, we show that the attacker can compromise it with probability 4/7 and 8/35, respectively. Finally, we show that our technique can be extended to compromising secret images with more than four colors. (C) 2008 Elsevier Ltd. All rights reserved", "paper_title": "On the security of a visual cryptography scheme for color images", "paper_id": "WOS:000263431200031"}