{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "custom_visualization_applications"}, {"score": 0.004633429997452688, "phrase": "increasing_volumes"}, {"score": 0.004589124394375718, "phrase": "digital_data"}, {"score": 0.004394910907549057, "phrase": "insightful_visualizations"}, {"score": 0.004089239912167375, "phrase": "sophisticated_visual_interfaces"}, {"score": 0.003714368305523811, "phrase": "programming_expertise"}, {"score": 0.0035741900278634616, "phrase": "vismashup"}, {"score": 0.0034063576796640603, "phrase": "customized_visualization_applications"}, {"score": 0.003093893243443715, "phrase": "visualization_specification"}, {"score": 0.0029062860108533374, "phrase": "small_set"}, {"score": 0.0024914105981393127, "phrase": "visualization_specifications"}, {"score": 0.0023857603808363527, "phrase": "simplified_views"}, {"score": 0.0023066880707738736, "phrase": "automatic_generation"}], "paper_keywords": ["Scientific Visualization", " Dataflow", " Visualization Systems"], "paper_abstract": "Visualization is essential for understanding the increasing volumes of digital data. However, the process required to create insightful visualizations is involved and time consuming. Although several visualization tools are available, including tools with sophisticated visual interfaces, they are out of reach for users who have little or no knowledge of visualization techniques and/or who do not have programming expertise. In this paper, we propose VISMASHUP, a new framework for streamlining the creation of customized visualization applications. Because these applications can be customized for very specific tasks, they can hide much of the complexity in a visualization specification and make it easier for users to explore visualizations by manipulating a small set of parameters. We describe the framework and how it supports the various tasks a designer needs to carry out to develop an application, from mining and exploring a set of visualization specifications (pipelines), to the creation of simplified views of the pipelines, and the automatic generation of the application and its interface. We also describe the implementation of the system and demonstrate its use in two real application scenarios.", "paper_title": "VisMashup: Streamlining the Creation of Custom Visualization Applications", "paper_id": "WOS:000270778900087"}