{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_services"}, {"score": 0.010512667468117895, "phrase": "autonomous_agents"}, {"score": 0.004739344544832536, "phrase": "agent-centric_contract_net_protocol"}, {"score": 0.004577145044601205, "phrase": "fundamental_technologies"}, {"score": 0.004406496547539966, "phrase": "semantic_web"}, {"score": 0.004271252660879269, "phrase": "manager_agent"}, {"score": 0.0038473083105301127, "phrase": "atomic_services"}, {"score": 0.0035189057079817285, "phrase": "contract_net_protocol"}, {"score": 0.003355515315708125, "phrase": "negotiation_mechanism"}, {"score": 0.0031393948330209255, "phrase": "service_matchmaker"}, {"score": 0.0029840952148215733, "phrase": "agent_roles"}, {"score": 0.002937153116494391, "phrase": "risk-enabled_reputation_model"}, {"score": 0.0028364561005358377, "phrase": "service_composer"}, {"score": 0.0027305272327742642, "phrase": "variant_performance"}, {"score": 0.0022006365282969454, "phrase": "diverse_agent_technologies"}, {"score": 0.0021591287487932667, "phrase": "open_and_dynamic_environments"}, {"score": 0.0021386687477715494, "phrase": "web_service_technologies"}, {"score": 0.0021049977753042253, "phrase": "composite_services"}], "paper_keywords": ["Autonomous agents", " Web service composition", " Agent organization", " Dynamic role binding", " Reputation model"], "paper_abstract": "Context: Agents are considered as one of the fundamental technologies underlying open and dynamic systems that are largely enabled by the semantic web and web services. Recently, there is a trend to introduce the notion of autonomy empowered by agents into web services. However, it has been argued that the characteristics of autonomy will make agents become available intermittently and behave variedly over time, which therefore increase the complexity on devising mechanisms for composing services enacted by autonomous agents. Objective: In this work, we propose an extension to Contract Net protocol, called Agent-centric Contract Net Protocol (ACNP), as a negotiation mechanism with three key features for composing web services enacted by autonomous agents. Method: (1) A matchmaking mechanism embedded in a middle agent (as a service matchmaker) for discovering web services that are available intermittently is presented based on the concept of agent roles; (2) A selection algorithm based on risk-enabled reputation model (REAL) embedded in a manager agent (as a service composer) is introduced to serve a basis for selecting web services with variant performance; and (3) A negotiation mechanism between a manager agent and contractor agents (as atomic services) is devised and enables both a service composer and the atomic services to request, refuse or agree on adapting changes of services. Results: The problem of assembling a computer is discussed in this paper. Conclusion: It is increasingly recognised that web services would become more autonomous by introducing diverse agent technologies to better constitute more complex systems in open and dynamic environments. As web service technologies are best exploited by composite services, it is imperative to devise mechanisms for composing services of autonomy. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Composing web services enacted by autonomous agents through agent-centric contract net protocol", "paper_id": "WOS:000306631700003"}