{"auto_keywords": [{"score": 0.04461939521773307, "phrase": "unknown_tags"}, {"score": 0.015719716506582524, "phrase": "unknown_tag_identification"}, {"score": 0.015581461158943833, "phrase": "large_rfid_systems"}, {"score": 0.010836718771133614, "phrase": "already_identified_tags"}, {"score": 0.0044430006374681285, "phrase": "retail_industry"}, {"score": 0.0038167308978417306, "phrase": "critical_role"}, {"score": 0.0037827603118271757, "phrase": "automatic_inventory_management"}, {"score": 0.0037490909410974166, "phrase": "misplaced_tag_discovery"}, {"score": 0.0035851703423654432, "phrase": "existing_solutions"}, {"score": 0.0032492519841546682, "phrase": "probabilistic_approaches"}, {"score": 0.003177392642813126, "phrase": "complete_identification"}, {"score": 0.0028795712616923462, "phrase": "high_time_efficiency"}, {"score": 0.0025291018422967083, "phrase": "time_efficiency"}, {"score": 0.0024401411219526774, "phrase": "first_non-trivial_solutions"}, {"score": 0.002271476019266231, "phrase": "rigorous_theoretical_analysis"}, {"score": 0.002251227801482381, "phrase": "extensive_simulations"}, {"score": 0.0022311596751824416, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "best_existing_solutions"}], "paper_keywords": ["RFID system", " unknown tag identification", " time efficiency", " slot pairing", " multiple reselections"], "paper_abstract": "Radio-Frequency Identification (RFID) technology brings revolutionary changes to many fields like retail industry. One important research issue in large RFID systems is the identification of unknown tags, i.e., tags that just entered the system but have not been interrogated by reader(s) covering them yet. Unknown tag identification plays a critical role in automatic inventory management and misplaced tag discovery, but it is far from thoroughly investigated. Existing solutions either trivially interrogate all the tags in the system and thus are highly time inefficient due to re-identification of already identified tags, or use probabilistic approaches that cannot guarantee complete identification of all the unknown tags. In this paper, we propose a series of protocols that can identify all of the unknown tags with high time efficiency. We develop several novel techniques to quickly deactivate already identified tags and prevent them from replying during the interrogation of unknown tags, which avoids re-identification of these tags and consequently improves time efficiency. To our knowledge, our protocols are the first non-trivial solutions that guarantee complete identification of all the unknown tags. We illustrate the effectiveness of our protocols through both rigorous theoretical analysis and extensive simulations. Simulation results show that our protocols can save up to 70 percent time when compared with the best existing solutions.", "paper_title": "Unknown Tag Identification in Large RFID Systems: An Efficient and Complete Solution", "paper_id": "WOS:000354526000024"}