{"auto_keywords": [{"score": 0.011754910509163613, "phrase": "molecular_recognition"}, {"score": 0.00481495049065317, "phrase": "key_component"}, {"score": 0.0047846807459660376, "phrase": "cancer_metastasis"}, {"score": 0.0043527164193299574, "phrase": "significant_biological_importance"}, {"score": 0.004298134888203576, "phrase": "potential_therapeutic_axis"}, {"score": 0.0040480367430410545, "phrase": "tumor_metastasis"}, {"score": 0.00389760315371842, "phrase": "pivotal_role"}, {"score": 0.003776504983530801, "phrase": "comprehensive_set"}, {"score": 0.0037527389293924907, "phrase": "computational_tools"}, {"score": 0.003693973656103879, "phrase": "free_energy_calculations"}, {"score": 0.0036707250689857348, "phrase": "molecular_dynamics_simulations"}, {"score": 0.003349552702131293, "phrase": "remarkable_agreement"}, {"score": 0.0033284645391157266, "phrase": "experimental_findings"}, {"score": 0.0032659907152779765, "phrase": "functional_role"}, {"score": 0.0029613556844064713, "phrase": "upper_n-terminal_domain"}, {"score": 0.0028065024340850615, "phrase": "nonpolar_and_polar_intermolecular_interactions"}, {"score": 0.00264296841319955, "phrase": "computational_protocol"}, {"score": 0.002585144987720461, "phrase": "nearly_exhaustive_docking_conformational_search"}, {"score": 0.0025365874386986493, "phrase": "heterogeneous_dielectric_implicit_water-membrane-water_model"}], "paper_keywords": [""], "paper_abstract": "The chemotactic signaling induced by the binding of chemokine CXCL12 (SDF-1 alpha) to chemokine receptor CXCR4 is of significant biological importance and is a potential therapeutic axis against HIV-1. However, as CXCR4 is overexpressed in certain cancer cells, the CXCL12:CXCR4 signaling is involved in tumor metastasis, progression, angiogenesis, and survival. Motivated by the pivotal role of the CXCL12:CXCR4 axis in cancer, we employed a comprehensive set of computational tools, predominantly based on free energy calculations and molecular dynamics simulations, to obtain insights into the molecular recognition of CXCR4 by CXCL12. We report, what is to our knowledge, the first computationally derived CXCL12:CXCR4 complex structure which is in remarkable agreement with experimental findings and sheds light into the functional role of CXCL12 and CXCR4 residues which are associated with binding and signaling. Our results reveal that the CXCL12 N-terminal domain is firmly bound within the CXCR4 transmembrane domain, and the central 24-50 residue domain of CXCL12 interacts with the upper N-terminal domain of CXCR4. The stability of the CXCL12:CXCR4 complex, structure is attributed to an abundance of nonpolar and polar intermolecular interactions, including salt bridges formed between positively charged CXCL12 residues and negatively charged CXCR4 residues. The success of the computational protocol can mainly be attributed to the nearly exhaustive docking conformational search, as well as the heterogeneous dielectric implicit water-membrane-water model used to simulate and select the optimum conformations. We also recently utilized this protocol to elucidate the binding of an HIV-1 gp120 V3 loop in complex with CXCR4, and a comparison between the molecular recognition of CXCR4 by CXCL12 and the HIV-1 gp120 V3 loop shows that both CXCL12 and the HIV-1 gp120 V3 loop share the same CXCR4 binding pocket, as they mostly interact with the same CXCR4 residues.", "paper_title": "Elucidating a Key Component of Cancer Metastasis: CXCL12 (SDF-1 alpha) Binding to CXCR4", "paper_id": "WOS:000335201200015"}