{"auto_keywords": [{"score": 0.04707382886325617, "phrase": "affinity_graphs"}, {"score": 0.007986565655022468, "phrase": "k_objects"}, {"score": 0.0075732370081141595, "phrase": "pairwise_affinities"}, {"score": 0.00481495049065317, "phrase": "affinity_graph"}, {"score": 0.004461882369408972, "phrase": "k-nearest_neighbors"}, {"score": 0.0041662189933067, "phrase": "graph_construction"}, {"score": 0.004134596278123439, "phrase": "previous_research"}, {"score": 0.003995226376780718, "phrase": "vectorial_data"}, {"score": 0.0037446140218109895, "phrase": "unreliable_affinities"}, {"score": 0.003687960013746783, "phrase": "knn_of_an_object_o"}, {"score": 0.0035772012773052065, "phrase": "highest_affinities"}, {"score": 0.0030595112110658675, "phrase": "k-dense_neighborhood"}, {"score": 0.002405853977978678, "phrase": "kdn"}, {"score": 0.002360381056508368, "phrase": "efficient_algorithm"}, {"score": 0.0023069440108381364, "phrase": "theoretic_analysis"}, {"score": 0.002263336340041527, "phrase": "shape_retrieval"}, {"score": 0.0022461244351896703, "phrase": "semi-supervised_learning"}, {"score": 0.002229043128610864, "phrase": "point_set_matching"}], "paper_keywords": ["Nearest neighbor", " Affinity graph", " Semi-supervised learning", " Clustering"], "paper_abstract": "In this paper, we study the problem of how to reliably compute neighborhoods on affinity graphs. The k-nearest neighbors (kNN) is one of the most fundamental and simple methods widely used in many tasks, such as classification and graph construction. Previous research focused on how to efficiently compute kNN on vectorial data. However, most real-world data have no vectorial representations, and only have affinity graphs which may contain unreliable affinities. Since the kNN of an object o is a set of k objects with the highest affinities to o, it is easily disturbed by errors in pairwise affinities between o and other objects, and also it cannot well preserve the structure underlying the data. To reliably analyze the neighborhood on affinity graphs, we define the k-dense neighborhood (kDN), which considers all pairwise affinities within the neighborhood, i.e., not only the affinities between o and its neighbors but also between the neighbors. For an object o, its kDN is a set kDN(o) of k objects which maximizes the sum of all pairwise affinities of objects in the set {o}a(a)kDN(o). We analyze the properties of kDN, and propose an efficient algorithm to compute it. Both theoretic analysis and experimental results on shape retrieval, semi-supervised learning, point set matching and data clustering show that kDN significantly outperforms kNN on affinity graphs, especially when many pairwise affinities are unreliable.", "paper_title": "Dense Neighborhoods on Affinity Graph", "paper_id": "WOS:000302341900004"}