{"auto_keywords": [{"score": 0.04961597900198373, "phrase": "automatic_plagiarism_detection"}, {"score": 0.028369948375820624, "phrase": "paraphrase_mechanisms"}, {"score": 0.009658703016565785, "phrase": "plagiarism_detection"}, {"score": 0.004631335513513859, "phrase": "linguistic_mechanism"}, {"score": 0.004608879242346434, "phrase": "underlying_many_plagiarism_cases"}, {"score": 0.004243289764306128, "phrase": "state-of-the-art_plagiarism_detectors"}, {"score": 0.004081385289516914, "phrase": "paraphrase_plagiarism"}, {"score": 0.003775803846431323, "phrase": "special_attention"}, {"score": 0.003493021648360933, "phrase": "plagiarism_detection_systems"}, {"score": 0.0031845067058084583, "phrase": "paraphrase_typology"}, {"score": 0.0027922467043592597, "phrase": "presented_experiments"}, {"score": 0.0025578967205807843, "phrase": "lexical_substitutions"}, {"score": 0.002320449502337321, "phrase": "plagiarized_text"}, {"score": 0.0022756672722130424, "phrase": "first_time"}, {"score": 0.0021569129153653777, "phrase": "critical_insights"}, {"score": 0.0021049977753042253, "phrase": "automatic_plagiarism_detection_systems"}], "paper_keywords": [""], "paper_abstract": "Although paraphrasing is the linguistic mechanism underlying many plagiarism cases, little attention has been paid to its analysis in the framework of automatic plagiarism detection. Therefore, state-of-the-art plagiarism detectors find it difficult to detect cases of paraphrase plagiarism. In this article, we analyze the relationship between paraphrasing and plagiarism, paying special attention to which paraphrase phenomena underlie acts of plagiarism and which of them are detected by plagiarism detection systems. With this aim in mind, we created the P4P corpus, a new resource that uses a paraphrase typology to annotate a subset of the PAN-PC-10 corpus for automatic plagiarism detection. The results of the Second International Competition on Plagiarism Detection were analyzed in the light of this annotation.The presented experiments show that (i) more complex paraphrase phenomena and a high density of paraphrase mechanisms make plagiarism detection more difficult, (ii) lexical substitutions are the paraphrase mechanisms used the most when plagiarizing, and (iii) paraphrase mechanisms tend to shorten the plagiarized text. For the first time, the paraphrase mechanisms behind plagiarism have been analyzed, providing critical insights for the improvement of automatic plagiarism detection systems.", "paper_title": "Plagiarism Meets Paraphrasing: Insights for the Next Generation in Automatic Plagiarism Detection", "paper_id": "WOS:000327124700004"}