{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_images"}, {"score": 0.049747721549480595, "phrase": "video_sequences"}, {"score": 0.013890518009356747, "phrase": "recognition_results"}, {"score": 0.01008130849889295, "phrase": "video_sequence"}, {"score": 0.00466684417181804, "phrase": "face_recognition"}, {"score": 0.004445419749485783, "phrase": "single_test_image"}, {"score": 0.00436890075128947, "phrase": "obvious_but_important_question"}, {"score": 0.003936560022538905, "phrase": "probabilistic_appearance-based_face_recognition_approach"}, {"score": 0.003449585750738867, "phrase": "feature_extraction_algorithm"}, {"score": 0.0033201720993656734, "phrase": "face_images"}, {"score": 0.0032971676471625646, "phrase": "distinct_people"}, {"score": 0.0029705677977833857, "phrase": "positive_answer"}, {"score": 0.0029092257197427195, "phrase": "general_sense"}, {"score": 0.002849146732780381, "phrase": "probabilistic_algorithm"}, {"score": 0.002761340122199076, "phrase": "partial_occlusions"}, {"score": 0.002639251247218711, "phrase": "precise_localization"}, {"score": 0.0025937408242280757, "phrase": "facial_features"}, {"score": 0.0024109902338204873, "phrase": "single_image"}, {"score": 0.002272501735900584, "phrase": "current_techniques"}, {"score": 0.002171979107594173, "phrase": "weak_points"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "To date, advances in face recognition have been dominated by the design of algorithms that do recognition from a single test image. Recently, an obvious but important question has been put forward. Will the recognition results of such approaches be generally improved when using multiple images or video sequences? To test this, we extend the formulation of a probabilistic appearance-based face recognition approach (which was originally defined to do recognition from a single still) to work with multiple images and video sequences. In our algorithm, as it is the case in most appearance-based approaches, we will need to use a feature extraction algorithm to find those features that best describe and discriminate among face images of distinct people. We will show that regardless of the algorithm used, the recognition results improve considerably when one uses a video sequence rather than a single still. Hence, a positive answer to our question (in the general sense) seems reasonable. The probabilistic algorithm we propose in this paper is robust to partial occlusions, orientation and expression changes, and does not require of a precise localization of the face or facial features. We will also show how these problems are more easily solved when one uses a video sequence rather than a single image for testing. The limitations of our algorithm will also be discussed. Understanding the limitations of current techniques when applied to video is important, because it helps identify those weak points that require further consideration. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "A weighted probabilistic approach to face recognition from multiple images and video sequences", "paper_id": "WOS:000238878200009"}