{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "open_networked_systems"}, {"score": 0.013679038898237714, "phrase": "knowledge_discovery"}, {"score": 0.008708672812170505, "phrase": "h-match"}, {"score": 0.0046392209103157936, "phrase": "varying_number"}, {"score": 0.004378469469879815, "phrase": "knowledge_discovery_requests"}, {"score": 0.004271234971981848, "phrase": "ontology_matching_techniques"}, {"score": 0.004031082737449308, "phrase": "semantically_related_concepts"}, {"score": 0.003997891221012094, "phrase": "different_ontologies"}, {"score": 0.0038518661517315533, "phrase": "h-match_algorithm"}, {"score": 0.003726533059542558, "phrase": "independent_ontologies"}, {"score": 0.0036502716977381004, "phrase": "key_feature"}, {"score": 0.003444912629614206, "phrase": "semantic_complexity"}, {"score": 0.0031452231581533814, "phrase": "matching_process"}, {"score": 0.0029928611380840757, "phrase": "current_knowledge_request"}, {"score": 0.002789528662623221, "phrase": "new_matching_execution"}, {"score": 0.002709862658377861, "phrase": "knowledge_request"}, {"score": 0.0025678829712650437, "phrase": "syntactic_and_semantic_techniques"}, {"score": 0.002203117204010397, "phrase": "helios_peer-based_system"}, {"score": 0.0021490449563443025, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "different_test_cases"}], "paper_keywords": [""], "paper_abstract": "In open networked systems a varying number of nodes interact each other just on the basis of their own independent ontologies and of knowledge discovery requests submitted to the network. Ontology matching techniques are essential to enable knowledge discovery and sharing in order to determine mappings between semantically related concepts of different ontologies. In this paper, we describe the H-MATCH algorithm and related techniques for performing matching of independent ontologies in open networked systems. A key feature of H-MATCH is that it can be dynamically configured for adaptation to the semantic complexity of the ontologies to be compared, where the number and type of ontology features that can be exploited during the matching process is not known in advance as it is embedded in the current knowledge request. Furthermore, this number can vary, also for the same ontologies, each time a new matching execution comes into play triggered by a knowledge request. We describe how H-MATCH enforces this capabilities through a combination of syntactic and semantic techniques as well as through a set of four matching models, namely surface, shallow, deep, and intensive. Then, we describe the application of H-MATCH and its implementation for knowledge discovery in the framework of the HELIOS peer-based system. Finally, we present experimental results of using H-MATCH on different test cases, along with a discussion on precision and recall.", "paper_title": "Matching ontologies in open networked systems: Techniques and applications", "paper_id": "WOS:000235932500002"}