{"auto_keywords": [{"score": 0.04107868567004354, "phrase": "robot_learning"}, {"score": 0.00481495049065317, "phrase": "social_signatures_through_imitation_game"}, {"score": 0.004506968388996092, "phrase": "different_postures"}, {"score": 0.004014452814186653, "phrase": "autism_spectrum_disorder"}, {"score": 0.0038678251731669865, "phrase": "imitation_game"}, {"score": 0.003820144626025562, "phrase": "experimental_protocol"}, {"score": 0.0036052633308076933, "phrase": "random_posture"}, {"score": 0.0032376465741070274, "phrase": "human_partner"}, {"score": 0.0031452231581533814, "phrase": "sensory-motor_architecture"}, {"score": 0.0030808218705744737, "phrase": "n.n."}, {"score": 0.0027211030647461324, "phrase": "normalized_mutual_information"}, {"score": 0.0025785359740308337, "phrase": "first_result"}, {"score": 0.002393353846080347, "phrase": "developmental_effect"}, {"score": 0.0022306602656266545, "phrase": "td_children"}, {"score": 0.002105006239492161, "phrase": "asd"}], "paper_keywords": ["Autism spectrum disorder", " human-robot interaction", " imitation", " sensory-motor architecture"], "paper_abstract": "In this paper, a robot learns different postures by imitating several partners. We assessed the effect of the type of partners, i.e., adults, typically developing (TD) children and children with autism spectrum disorder (ASD), on robot learning during an imitation game. The experimental protocol was divided into two phases: 1) a learning phase, during which the robot produced a random posture and the partner imitated the robot; and 2) a phase in which the roles were reversed and the robot had to imitate the posture of the human partner. Robot learning was based on a sensory-motor architecture whereby neural networks (N.N.) enabled the robot to associate what it did with what it saw. Several metrics (i.e., annotation, the number of neurons needed to learn, and normalized mutual information) were used to show that the partners affected robot learning. The first result obtained was that learning was easier with adults than with both groups of children, indicating a developmental effect. Second, learning was more complex with children with ASD compared to both adults and TD children. Third, learning with the more complex partner first (i.e., children with ASD) enabled learning to be more easily generalized.", "paper_title": "Learning of Social Signatures Through Imitation Game Between a Robot and a Human Partner", "paper_id": "WOS:000342115400004"}