{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "modelnet-te"}, {"score": 0.01019329895743621, "phrase": "user-level_performance"}, {"score": 0.00582936179141003, "phrase": "modelnet-te."}, {"score": 0.004697182175882626, "phrase": "traffic_engineering_interaction"}, {"score": 0.004234977387330766, "phrase": "traffic_engineering"}, {"score": 0.004159348468486568, "phrase": "network_level"}, {"score": 0.0041035107748762685, "phrase": "available_tools"}, {"score": 0.004030220106099605, "phrase": "realistic_settings"}, {"score": 0.003870048118022941, "phrase": "real-time_emulation"}, {"score": 0.003852747563561468, "phrase": "te"}, {"score": 0.003749867361815017, "phrase": "scientific_community"}, {"score": 0.0037330049345970498, "phrase": "open_source_software"}, {"score": 0.003418880805283488, "phrase": "furthermore_controlled_network_environment"}, {"score": 0.0033426715409463586, "phrase": "complementary_tool"}, {"score": 0.0032829250301367376, "phrase": "application_development"}, {"score": 0.0032607955356516592, "phrase": "specific_language"}, {"score": 0.0031880988305995157, "phrase": "existing_or_proprietary_applications"}, {"score": 0.003138177540386185, "phrase": "planetlab"}, {"score": 0.002913115490604908, "phrase": "software_modification"}, {"score": 0.002753395517634568, "phrase": "real_applications"}, {"score": 0.002728663523391936, "phrase": "use_case"}, {"score": 0.002673823570662833, "phrase": "experimental_campaign"}, {"score": 0.0026498044212623344, "phrase": "layers_interaction"}, {"score": 0.0026024097974558795, "phrase": "classic_minimum_congestion_load-balancing"}, {"score": 0.0025674195351333487, "phrase": "standard_ip_routing"}, {"score": 0.0024430893385147786, "phrase": "abilene"}, {"score": 0.0024266072139084113, "phrase": "simplistic_topologies"}, {"score": 0.002335282094353215, "phrase": "network_edge"}, {"score": 0.002187336985182756, "phrase": "tcp_congestion_control"}, {"score": 0.0021049977753042253, "phrase": "wild_internet"}], "paper_keywords": ["P2P", " Emulation", " Modelnet", " BitTorrent", " Streaming", " Traffic engineering", " Interaction L3/L7"], "paper_abstract": "In the Internet, user-level performance of P2P applications may be determined by the interaction of two independent dynamics: on the one hand, by the end-to-end control policies applied at the P2P application layer (L7); on the other hand, by Traffic Engineering (TE) decisions taken at the network level (L3). Currently available tools do not allow to study L7/L3 interactions in realistic settings due to a number of limitations. Building over ModelNet, we develop a framework for the real-time emulation of TE capabilities, named ModelNet-TE, that we make available to the scientific community as open source software. ModelNet-TE allows (i) to deploy real unmodified Internet P2P applications, and to test their interaction with (ii) many TE algorithms, as its design allows to easily integrate other TE algorithms than those we already provide, (iii) in a furthermore controlled network environment. Due to these features, ModelNet-TE is a complementary tool with respect to hybrid simulation/protoyping toolkits (that constrain application development to a specific language and framework, and cannot be used with existing or proprietary applications) and to other open testbeds such as PlanetLab or Grid5000 (lacking of control or TE-capabilities respectively). ModelNet-TE can thus be useful to L7-researchers, as it allows to seamlessly and transparently test any existing P2P application without requiring any software modification. At the same time, ModelNet-TE can be useful to L3-researchers as well, since they can test their TE algorithms on the traffic generated by real applications. As a use case, in this work we carry on an experimental campaign of L7/L3 routing layers interaction through ModelNet-TE. As TE we consider the classic minimum congestion load-balancing, that we compare against standard IP routing. As example P2P applications, we take BitTorrent, one among the most popular file-sharing applications nowadays, and WineStreamer, an open source live-streaming application. We emulate BitTorrent and WineStreamer swarms over both realistic topologies (e.g., Abilene) and simplistic topologies that are commonly in use today (e.g., where the bottleneck is located at the network edge) under a variety of scenarios. Results of our experimental campaign show that user-level performance may be significantly affected by both the TE mechanism in use at L3 (e.g., due to interactions with TCP congestion control or P2P chunk trading logic), as well as scenario parameters that are difficult to control in the wild Internet, which thus testifies the interest for tools such as ModelNet-TE.", "paper_title": "ModelNet-TE: An emulation tool for the study of P2P and traffic engineering interaction dynamics", "paper_id": "WOS:000313868100006"}