{"auto_keywords": [{"score": 0.0045318666714939905, "phrase": "promising_solution"}, {"score": 0.004482206282876944, "phrase": "high_performance_embedded_systems"}, {"score": 0.00428892403807229, "phrase": "risc_core"}, {"score": 0.004241914481080374, "phrase": "configurable_functional_units"}, {"score": 0.003516898780234098, "phrase": "underlying_reason"}, {"score": 0.003440166097491567, "phrase": "custom_function"}, {"score": 0.003328184259386487, "phrase": "single_instruction"}, {"score": 0.0029641011108505785, "phrase": "instruction_length"}, {"score": 0.00282048824450047, "phrase": "simple_extension"}, {"score": 0.0027741761880779535, "phrase": "multiple_inputs"}, {"score": 0.0026986685585382347, "phrase": "custom_functions"}, {"score": 0.002669042572650594, "phrase": "repeated_instructions"}, {"score": 0.0024299678474208023, "phrase": "mimo_extension"}, {"score": 0.002286781334850213, "phrase": "diso_extension"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["configurable processor", " custom functions", " instruction set extension"], "paper_abstract": "Configurable processors have emerged as a promising solution for high performance embedded systems. Many of these processors extend a RISC core with configurable functional units that execute dual-input, single-output (DISO) custom functions. Although studies have shown that supporting multiple-input, multiple-output (MIMO) custom functions can lead to significant speedups, mechanisms to efficiently achieve this have not been adequately addressed. The underlying reason is that a custom function is normally invoked by a single instruction, which usually transfers only two inputs and one output. Attempts to transfer more inputs and outputs in one instruction are impeded by the instruction length and the register file's R/W ports. This paper proposes a simple extension to transfer multiple inputs and outputs of the custom functions using repeated instructions. While transferring the inputs and outputs may take a few extra cycles, our experiments show that the MIMO extension can still achieve an average 51% increase in speedup compared to a DISO extension and an average 27% increase in speedup compared to a multiple-input, single-output (MISO) extension. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Supporting multiple-input, multiple-output custom functions in configurable processors", "paper_id": "WOS:000245793600003"}