{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "non-cooperative_target_assignment"}, {"score": 0.004611108249179507, "phrase": "game-theoretic_approach"}, {"score": 0.004531997388646422, "phrase": "optimal_assignment"}, {"score": 0.004284100953217494, "phrase": "minimum_sum"}, {"score": 0.004138309011478741, "phrase": "euclidean_distance"}, {"score": 0.0035873530542209686, "phrase": "voronoi_region"}, {"score": 0.0034953361767153285, "phrase": "standard_schemes"}, {"score": 0.0032896745636186824, "phrase": "nearest-neighbour_rule"}, {"score": 0.002863762666256937, "phrase": "appropriate_utility_function"}, {"score": 0.0026488343783448273, "phrase": "particular_target"}, {"score": 0.0025364615261136655, "phrase": "matching_we_present_simulations"}, {"score": 0.0022562464662197867, "phrase": "communication_model"}, {"score": 0.0021604924928015283, "phrase": "practical_scenario"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Game theory", " Vehicle-target assignment", " Non-cooperative"], "paper_abstract": "In this paper, we have adopted a game-theoretic approach to consider the optimal assignment of targets to vehicles. We have taken optimality to mean the minimum sum of costs which are proportional to the Euclidean distance between a vehicle and its assigned target; this occurs when the set of targets is assigned to their nearest vehicles. In other words, each vehicle should assign itself to a target located within the Voronoi region associated with the vehicle. Standard schemes require communication between vehicles at least to rank the targets according to the nearest-neighbour rule. In our proposed model, there is no need for communication among the vehicles, and only limited communication between the targets and the vehicles is required. Specifically, we have introduced an appropriate utility function which depends on the distance between the vehicles and targets and the number of vehicles engaging a particular target. The vehicles negotiate their choice of targets via regret matching We present simulations which demonstrate that vehicles select targets that fall within their Voronoi region Vehicles that do not have any targets within their Voronoi region select their nearest unassigned target. We also present a communication model illustrating how the model can be implemented in a practical scenario. (C) 2010 Elsevier B V. All rights reserved", "paper_title": "A game-theoretic approach to non-cooperative target assignment", "paper_id": "WOS:000280511200003"}