{"auto_keywords": [{"score": 0.04911945324917725, "phrase": "dynamic_carpooling"}, {"score": 0.00481495049065317, "phrase": "privacy-driven_design"}, {"score": 0.004756805752518494, "phrase": "dynamic_carpooling_system"}, {"score": 0.004586531354697466, "phrase": "ad-hoc_ridesharing"}, {"score": 0.00445830200258645, "phrase": "one-time_shared_rides"}, {"score": 0.004045157344249484, "phrase": "driver's_route"}, {"score": 0.003980106938194548, "phrase": "shared_ride"}, {"score": 0.003524322230452833, "phrase": "mobiquitous_environment"}, {"score": 0.0031974502006267163, "phrase": "greatest_threats"}, {"score": 0.0030953529970646626, "phrase": "spatio-temporal_data"}, {"score": 0.0026209522797963447, "phrase": "location_privacy"}, {"score": 0.0025892330566358503, "phrase": "major_issue"}, {"score": 0.002311047934798247, "phrase": "privacy_aspect"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Carpooling", " Privacy", " Mobility", " Location-based systems"], "paper_abstract": "Dynamic carpooling (also known as instant or ad-hoc ridesharing) is a service that arranges one-time shared rides on very short notice. This type of carpooling generally makes use of three recent technological advances: (i) navigation devices to determine a driver's route and arrange the shared ride; (ii) smartphones for a traveller to request a ride from wherever she happens to be; and (iii) social networks to establish trust between drivers and passengers. However, the mobiquitous environment in which dynamic carpooling is expected to operate raises several privacy issues. Among all the personal identifiable information, learning the location of an individual is one of the greatest threats against her privacy. For instance, the spatio-temporal data of an individual can be used to infer the location of her home and workplace, to trace her movements and habits, to learn information about her centre of interests or even to detect a change from her usual behaviour. Therefore, preserving location privacy is a major issue to be able to leverage the possibilities offered by dynamic carpooling. In this paper we use the principles of privacy-by-design to integrate the privacy aspect in the design of dynamic carpooling, henceforth increasing its public (and political) acceptability and trust. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Towards privacy-driven design of a dynamic carpooling system", "paper_id": "WOS:000342049700008"}