{"auto_keywords": [{"score": 0.01052054773352599, "phrase": "interconnected_networks"}, {"score": 0.00462919213721188, "phrase": "potential_problem"}, {"score": 0.004548939310612501, "phrase": "interconnected_accredited_system_approach"}, {"score": 0.004095692768056685, "phrase": "secure_systems"}, {"score": 0.004042295865725559, "phrase": "secure_channel_results"}, {"score": 0.00398959232769596, "phrase": "secure_network"}, {"score": 0.003802135020791801, "phrase": "network_connections"}, {"score": 0.003671338229632309, "phrase": "security_levels"}, {"score": 0.0035761913760242697, "phrase": "accreditation_range"}, {"score": 0.003498782065781398, "phrase": "component_systems"}, {"score": 0.0032336801561165113, "phrase": "basic_properties"}, {"score": 0.0031636612155559267, "phrase": "correction_algorithms"}, {"score": 0.0027741761880779535, "phrase": "weighted_vertex_cover"}, {"score": 0.0026321198895843173, "phrase": "genetic_algorithm"}, {"score": 0.0025863988422430797, "phrase": "combinatorial_algorithm"}, {"score": 0.002552628669352939, "phrase": "new_algorithms"}, {"score": 0.002464709648714996, "phrase": "randomly_generated_instances"}, {"score": 0.0022579036318895753, "phrase": "low-cost_solutions"}], "paper_keywords": ["network security", " cascade vulnerability problem", " genetic algorithms"], "paper_abstract": "The Cascade Vulnerability Problem for interconnected networks is a potential problem faced when the interconnected accredited system approach of the Trusted Network Interpretation is used. It belongs to a subset of the problem set that addresses the issue of whether the composition of secure systems via a secure channel results in a secure network. The Cascade Vulnerability Problem appears when an attacker can take advantage of network connections to compromise information across a range of security levels that is greater than the accreditation range of any of the component systems she must defeat to do so. In this paper, the general Cascade Vulnerability Problem is presented, and the basic properties of the most important detection and correction algorithms are briefly described. Two new efficient heuristic algorithms are proposed for correcting the Cascade Vulnerability Problem: (a) a conceptually simple and computationally fast Combinatorial Algorithm based on a reduction of the Cascade Vulnerability Correction Problem to Weighted Vertex Cover, and (b) a simple and easy to implement Genetic Algorithm based on the Combinatorial Algorithm. The new algorithms are experimentally evaluated on a collection of randomly generated instances consisting of networks of various characteristics. The experiments demonstrate that the Combinatorial Algorithm is extremely fast but sometimes fails to produce low-cost solutions. On the other hand, the Genetic Algorithm is significantly slower but consistently computes much better solutions. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Efficient heuristic algorithms for correcting the Cascade Vulnerability Problem for interconnected networks", "paper_id": "WOS:000239298500021"}