{"auto_keywords": [{"score": 0.04670074843427757, "phrase": "organization_level_research"}, {"score": 0.008595719869121375, "phrase": "general_aim"}, {"score": 0.007230864104794213, "phrase": "clear_understanding"}, {"score": 0.005602212966599141, "phrase": "pragmatic_stance"}, {"score": 0.00481495049065317, "phrase": "explicit_pragmatic_approach"}, {"score": 0.003849579089885659, "phrase": "first_place"}, {"score": 0.0035133644847622383, "phrase": "specialist_fields"}, {"score": 0.003325852346387272, "phrase": "main_argument"}, {"score": 0.002682669289913153, "phrase": "\"subjective\"_background_knowledge"}, {"score": 0.002610043728801011, "phrase": "non-logic_practices"}, {"score": 0.002370955769074803, "phrase": "research_endeavor"}, {"score": 0.002275299774554847, "phrase": "basic_unit"}, {"score": 0.0021340985236583017, "phrase": "viable_alternative"}, {"score": 0.0021049977753042253, "phrase": "overly_positivist_and_overly_relativist_approaches"}], "paper_keywords": ["Theory of the firm", " Unit of analysis", " Pragmatism", " Epistemology", " Classification", " Proximity"], "paper_abstract": "The general aim of this paper is to come to terms with the organization and organization level research in scientometrics. Most of the debate on the issues that revolve organization level research in scientometrics is technical. As such, most contributions presume a clear understanding of what constitutes the organization in the first place. To our opinion however, such \"a-priorism\" is at least awkward, given that even in specialist fields there is no clear understanding of what constitutes the organization. The main argument of this paper holds that performing organization level research in scientometrics can only proceed by taking a pragmatic stance on the constitution of the organization. As such, we argue that performing organization level research in scientometrics (i) requires both authoritative \"objective\" and non-authoritative \"subjective\" background knowledge, (ii) involves non-logic practices that can be more or less theoretically informed, and (iii) depends crucially upon the general aim of the research endeavor in which the organization is taken as a basic unit of analysis. To our opinion a pragmatic stance on organization level research in scientometrics is a viable alternative to both overly positivist and overly relativist approaches as well as that it might render the relation between scientometrics and science policy more productive.", "paper_title": "Organization level research in scientometrics: a plea for an explicit pragmatic approach", "paper_id": "WOS:000314753500023"}