{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "marker_genes"}, {"score": 0.049764804068700534, "phrase": "gene_expression_data"}, {"score": 0.0047363569540686936, "phrase": "neural_framework"}, {"score": 0.004705278218845159, "phrase": "online_feature_analysis"}, {"score": 0.004552902997092495, "phrase": "typical_goals"}, {"score": 0.004248718518635191, "phrase": "deeper_understanding"}, {"score": 0.00422082596936636, "phrase": "underlying_biological_process"}, {"score": 0.003951736710391294, "phrase": "high_dimensional_nature"}, {"score": 0.003925786139948254, "phrase": "expression_profiles"}, {"score": 0.0037611961382938964, "phrase": "feature_selection_criteria"}, {"score": 0.0035445922786327575, "phrase": "feature_selection"}, {"score": 0.0034866619130264048, "phrase": "separate_phase"}, {"score": 0.003452357563167821, "phrase": "system_design_phase"}, {"score": 0.003086311260099341, "phrase": "novel_neural_scheme"}, {"score": 0.003035847903759329, "phrase": "necessary_features"}, {"score": 0.00294707794932759, "phrase": "classification_task"}, {"score": 0.0028141081648971754, "phrase": "subtle_combination"}, {"score": 0.002651901053070293, "phrase": "acute_myeloid_leukemia"}, {"score": 0.0026085220231994955, "phrase": "acute_lymphoblastic_leukemia"}, {"score": 0.0023471747824793015, "phrase": "data_set"}, {"score": 0.002308768837799101, "phrase": "important_marker_gene"}, {"score": 0.0022486192232506388, "phrase": "analysis_method"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Many attempts have been made to analyze gene expression data. Typical goals of such analysis include discovery of subclasses, designing predictors/classifiers for diseases, identifying marker genes, and trying to get a deeper understanding of underlying biological process. Success of each of these tasks strongly depends on the features used to solve the problem. The high dimensional nature of expression profiles makes the task very difficult. Consequently, many researchers have used some feature selection criteria to reduce the dimensionality of the problem. These approaches are off-line in nature, as feature selection is done in a separate phase from the system design phase. These approaches ignore the fact that utility of features depends on both the problem that is solved and the tool that is used to solve the problem. We here propose to use a novel neural scheme that picks up the necessary features on-line when the system learns the classification task. Because it considers all the features at one go, it does not miss any subtle combination of these features. We demonstrate the effectiveness of our on-line feature selection (OFS) scheme to distinguish between acute myeloid leukemia (AML) and acute lymphoblastic leukemia (ALL) cancer expression data set. Our scheme could identify only five genes that can produce results as good as or even better than what is reported in the literature on this data set. It identifies an important marker gene that alone has a very good discriminating power. This analysis method is quite general in nature and can be effectively used in other areas of bioinformatics. (c) 2006 Wiley Periodicals, Inc.", "paper_title": "On identifying marker genes from gene expression data in a neural framework through online feature analysis", "paper_id": "WOS:000235895800004"}