{"auto_keywords": [{"score": 0.033495725113678786, "phrase": "point_solution"}, {"score": 0.029843544522593482, "phrase": "true_solution"}, {"score": 0.004448705308279165, "phrase": "geodetic_observations"}, {"score": 0.00439041997682389, "phrase": "redundant_systems"}, {"score": 0.0043519860930099795, "phrase": "highly_non-linear_equations"}, {"score": 0.004128317208406523, "phrase": "traditional_analytical_techniques"}, {"score": 0.0040385352882334235, "phrase": "forward_modeling"}, {"score": 0.004003169429008801, "phrase": "numerical_inversion_techniques"}, {"score": 0.0038647641000798135, "phrase": "serious_limitations"}, {"score": 0.0033277936960179892, "phrase": "conventional_solutions"}, {"score": 0.00303398491761013, "phrase": "different_strategy"}, {"score": 0.0029548937818509656, "phrase": "optimal_r-m_space"}, {"score": 0.002729744174693491, "phrase": "grid_spaces"}, {"score": 0.002499590390751339, "phrase": "r-m_space"}, {"score": 0.0022687189700002254, "phrase": "proposed_algorithm"}, {"score": 0.0022290883852844057, "phrase": "conventional_adjustment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Numerical adjustment", " Grid-search", " Topology", " R-m space", " System of redundant equations", " Inversion"], "paper_abstract": "Geophysical phenomena such as volcanism and earthquake faulting are modeled on the basis of geodetic observations leading to redundant systems of highly non-linear equations. Still, such systems of equations cannot be solved using traditional analytical techniques. For this reason forward modeling or numerical inversion techniques are used, but these techniques have serious limitations. To overcome these problems, we propose a numerical/topological, grid-search based technique in the R-m space, a generalization and refinement of techniques used in some cases of low-accuracy 2-D positioning. In contrast to conventional solutions which tend to minimize a certain function and directly obtain a point solution of a system of equations, our algorithm has a different strategy. At first, an optimal R-m space which is defined by a grid and which contains the true solution is mapped as the intersection of grid spaces defined on the basis of the uncertainties of each observation. Then, the center of weight of this R-m space and its variance covariance matrix are computed, and this point solution approximates the true solution of the system of equations. The efficiency of the proposed algorithm and its compatibility with conventional adjustment is demonstrated on the basis of two characteristic case studies. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Topological inversion in geodesy-based, non-linear problems in geophysics", "paper_id": "WOS:000315558400040"}