{"auto_keywords": [{"score": 0.03466775181930745, "phrase": "farwell-donchin_paradigm"}, {"score": 0.015498529017890115, "phrase": "brain-computer_interface"}, {"score": 0.009467025523672658, "phrase": "target_character"}, {"score": 0.004634483519823431, "phrase": "bci"}, {"score": 0.004355415885815204, "phrase": "human_brain"}, {"score": 0.004232331639807526, "phrase": "bci_system"}, {"score": 0.003939565240409143, "phrase": "positive_peak"}, {"score": 0.0033645655483989746, "phrase": "farwell-donchin"}, {"score": 0.0024417832296664698, "phrase": "human_perceptual_error"}, {"score": 0.002316532084420729, "phrase": "new_region-based_paradigm"}, {"score": 0.0022617389804167943, "phrase": "experimental_results"}, {"score": 0.002187194307878705, "phrase": "new_paradigm"}, {"score": 0.0021049977753042253, "phrase": "better_accuracy"}], "paper_keywords": ["brain-computer interface", " event-related potentials", " P300", " speller"], "paper_abstract": "A brain-computer interface (BCI) is a system that conveys messages and commands directly from the human brain to a computer. The BCI system described in this work is based on the P300 wave. The P300 is a positive peak of fan event-related potential (ERP) that occurs 300ms after a stimulus. One of the best-known and most widely used P300 applications is the P300 speller designed by Farwell-Donchin in 1988. The Farwell-Donchin paradigm has been a benchmark for P300 BCIs. In this paradigm, a 6 X 6 matrix of letters and numbers is displayed. and the subject focuses on a target character while rows and columns of characters flash. Through detection of P300 for one row and one column, the target character can be identified. In this paper, it is shown that there is a human perceptual error in the Farwell-Donchin paradigm. To eliminate this error, a new region-based paradigm is presented. Using experimental results, it is shown that the new paradigm has several advantages over the Farwell-Donchin paradigm and achieves better accuracy.", "paper_title": "A region-based P300 speller for brain-computer interface", "paper_id": "WOS:000275118800001"}