{"auto_keywords": [{"score": 0.03735953345749733, "phrase": "exceptional_properties"}, {"score": 0.00481495049065317, "phrase": "anomalous_subpopulations"}, {"score": 0.004388252997694986, "phrase": "anomalous_individuals"}, {"score": 0.004217110862974562, "phrase": "overall_given_population"}, {"score": 0.003946519058822334, "phrase": "exceptional_property"}, {"score": 0.0038431888954930083, "phrase": "exceptionality_score"}, {"score": 0.00342568771304873, "phrase": "minimum_distance_estimation"}, {"score": 0.0031774686451753477, "phrase": "probability_distribution"}, {"score": 0.0030399188412691914, "phrase": "suitable_exceptionality_scores"}, {"score": 0.00278237555651743, "phrase": "empirical_point"}, {"score": 0.0026736945502820303, "phrase": "small_samples"}, {"score": 0.002490833392316362, "phrase": "exprex"}, {"score": 0.002341094670523097, "phrase": "needed_computational_effort"}, {"score": 0.0022595974985992664, "phrase": "suitable_pruning_rules"}, {"score": 0.0022297712188622293, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "natural_manner"}], "paper_keywords": ["Knowledge discovery", " anomaly characterization", " unbalanced data", " mixed-attribute data"], "paper_abstract": "We consider the problem of discovering attributes, or properties, accounting for the a priori stated abnormality of a group of anomalous individuals (the outliers) with respect to an overall given population (the inliers). To this aim, we introduce the notion of exceptional property and define the concept of exceptionality score, which measures the significance of a property. In particular, in order to single out exceptional properties, we resort to a form of minimum distance estimation for evaluating the badness of fit of the values assumed by the outliers compared to the probability distribution associated with the values assumed by the inliers. Suitable exceptionality scores are introduced for both numeric and categorical attributes. These scores are, both from the analytical and the empirical point of view, designed to be effective for small samples, as it is the case for outliers. We present an algorithm, called EXPREX, for efficiently discovering exceptional properties. The algorithm is able to reduce the needed computational effort by not exploring many irrelevant numerical intervals and by exploiting suitable pruning rules. The experimental results confirm that our technique is able to provide knowledge characterizing outliers in a natural manner.", "paper_title": "Discovering Characterizations of the Behavior of Anomalous Subpopulations", "paper_id": "WOS:000317860300007"}