{"auto_keywords": [{"score": 0.0047314049780079765, "phrase": "agents'_attitudes"}, {"score": 0.004568617813032014, "phrase": "normative_multi-agent_systems"}, {"score": 0.004489327204473076, "phrase": "artificial_institutions"}, {"score": 0.004055730085399621, "phrase": "normative_mas"}, {"score": 0.003651039356522665, "phrase": "external_designer"}, {"score": 0.0034038593017883295, "phrase": "institutional_facts"}, {"score": 0.002767696345005216, "phrase": "attitude-dependent_way"}, {"score": 0.002738723329538679, "phrase": "second_part"}, {"score": 0.002662932198158107, "phrase": "logical_characterization"}, {"score": 0.00263505298504827, "phrase": "important_notions"}, {"score": 0.0024999636244840647, "phrase": "constitutive_ride"}, {"score": 0.0021573582896732657, "phrase": "constitutive_rules"}, {"score": 0.0021422669204408263, "phrase": "regulative_rules"}, {"score": 0.0021049977753042253, "phrase": "attitude-dependent_facts"}], "paper_keywords": ["Modal logic", " institutions", " acceptance", " normative systems", " multi-agent systems"], "paper_abstract": "In the recent years. several formal approaches to the specification of normative multi-agent systems (MASs) and artificial institutions have been proposed. The aim of this article is to advance. the state of the ail in this area by proposing all approach in which a normative MAS is conceived to be autonomous. in the sense that it is able to create, maintain and eventually change its own institutions by itself, without the intervention of an external designer in this process. In our approach the existence and the dynamics of an institution (norms, rules. institutional facts, etc.) are determined by the (individual and collective) acceptances of its members, and its dynamics depends on the dynamics of these acceptances. In order to meet this objective, we propose the logic AL (Acceptance Logic) in which the acceptance of a proposition by the agents qua members of an institution is introduced. Such propositions are true w.r.t. in institutional context and correspond to facts that are instituted in an attitude-dependent way, The second part of the article is devoted to the logical characterization of some important notions in the theory of institutions. We provide a formalization of the concept of constitutive ride. expressed by a statement of the form 'X counts as Y in the context of institution x'. Then, we formalize the concepts of obligation and permission (so called regulative rules). In our approach, constitutive rules and regulative rules of a certain institution are attitude-dependent facts which are grounded on the acceptances of the members of the institution.", "paper_title": "The Logic of Acceptance: Grounding Institutions on Agents' Attitudes", "paper_id": "WOS:000273177000002"}