{"auto_keywords": [{"score": 0.033244376728729756, "phrase": "summarization_optimization"}, {"score": 0.00481495049065317, "phrase": "unified_interactive_video_retargeting_system"}, {"score": 0.004036968488559984, "phrase": "initial_editing_results"}, {"score": 0.0036627245728600073, "phrase": "possible_distortion"}, {"score": 0.003574695610710444, "phrase": "warping_step"}, {"score": 0.0032039415997394817, "phrase": "refining_processing"}, {"score": 0.0029965060407413898, "phrase": "original_and_edited_video"}, {"score": 0.0028195727965553367, "phrase": "final_editing_result"}, {"score": 0.0026209522797963447, "phrase": "color_histogram"}, {"score": 0.002320449502337321, "phrase": "proposed_video_retargeting_system"}, {"score": 0.002278440725193307, "phrase": "video_summarization"}, {"score": 0.0021049977753042253, "phrase": "video_jittering"}], "paper_keywords": ["Video summarization", " Video retargeting", " Video completion", " Bidirectional similarity", " Texture synthesis"], "paper_abstract": "We construct a unified interactive video retargeting system for video summarization, completion, and reshuffling. Our system combines the advantages of both video warping and summarizing processing. We first warp the video to present initial editing results, then refine the results using patch-based summarizing optimization, which mainly eliminates possible distortion produced in the warping step. We develop a Mean Value Coordinate (MVC) warping method due to its simplicity and efficiency used in the initialization. For refining processing, the summarization optimization is built on a 3D bidirectional similarity measure between the original and edited video, to preserve the coherence and completeness of the final editing result. We further improve the quality of summarization by applying a color histogram matching during the optimization, and accelerate the summarization optimization by using a constrained 3D Patch-Match algorithm. Experiment results show that the proposed video retargeting system effectively supports video summarization, completion, and reshuffling while avoiding issues like texture broken, video jittering, and detail losing.", "paper_title": "Video retargeting combining warping and summarizing optimization", "paper_id": "WOS:000319478400031"}