{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "opportunistic_routing"}, {"score": 0.04936106948081192, "phrase": "distance_progress"}, {"score": 0.0459177180449158, "phrase": "next-hop_forwarder"}, {"score": 0.004555371402128666, "phrase": "new_class"}, {"score": 0.004036369952624852, "phrase": "single_node"}, {"score": 0.0038573081851680656, "phrase": "forwarder_candidates"}, {"score": 0.0031366648074858555, "phrase": "candidate_selection_algorithm"}, {"score": 0.0030278017562213265, "phrase": "great_impact"}, {"score": 0.0028070431733705735, "phrase": "geographic_position"}, {"score": 0.0023642842046859274, "phrase": "mathematical_analysis"}, {"score": 0.002282166507956957, "phrase": "candidate_selection_algorithms"}, {"score": 0.0022252591643049744, "phrase": "almost_the_same_performance"}, {"score": 0.0021917966722180132, "phrase": "optimum_algorithms"}, {"score": 0.0021049977753042253, "phrase": "computational_cost"}], "paper_keywords": ["OR", " opportunistic routing", " candidate selection", " maximum progress distances", " wireless network"], "paper_abstract": "Opportunistic routing (OR) is a new class of routing protocols that selects the next-hop forwarder on-the-fly. In contrast to traditionally routing, OR does not select a single node as the next-hop forwarder, but a set of forwarder candidates. When a packet is transmitted, the candidates coordinate such that the best one receiving the packet will forward it, while the others will discard the packet. The selection and prioritisation of candidates, referred to as candidate selection algorithm (CSA), has a great impact on OR performance. In this paper we propose and study two new candidate selection algorithms based on the geographic position of nodes. This information is used by the CSAs in order to maximise the distance progress (DP) towards the destination. We compare our proposals with other well-known CSAs proposed in the literature through mathematical analysis and simulation. We show that candidate selection algorithms based on DP achieve almost the same performance as the optimum algorithms proposed in the literature, while the computational cost is dramatically reduced.", "paper_title": "Candidate selection algorithms in opportunistic routing based on distance progress", "paper_id": "WOS:000366130300002"}