{"auto_keywords": [{"score": 0.03406896969421786, "phrase": "takagi_et_al"}, {"score": 0.00481495049065317, "phrase": "highest_latency_arithmetic_operation"}, {"score": 0.004779085953614184, "phrase": "present_digital_architectures"}, {"score": 0.00474348728309194, "phrase": "high-performance_computing_systems"}, {"score": 0.0046037124365759215, "phrase": "efficient_hardware_division_units"}, {"score": 0.004468037801239238, "phrase": "novel_architecture"}, {"score": 0.004418192459607072, "phrase": "nonrestoring_divisor"}, {"score": 0.004146015717402716, "phrase": "fast_computation"}, {"score": 0.00342568771304873, "phrase": "proposed_divisor_architecture"}, {"score": 0.003073216350080926, "phrase": "computer_sciences"}, {"score": 0.0025198477493173165, "phrase": "basic_cell"}, {"score": 0.002311769781106355, "phrase": "single_circuit"}, {"score": 0.0022688546528208133, "phrase": "overall_structure"}, {"score": 0.0021049977753042253, "phrase": "power_saving"}], "paper_keywords": ["Integer division", " nonrestoring division", " radix-2 signed-digit (SD2)"], "paper_abstract": "Division is the highest latency arithmetic operation in present digital architectures and high-performance computing systems; as such drives the demand for efficient hardware division units. Accordingly, this paper proposes a novel architecture for a nonrestoring divisor based on the radix-2 signed-digit (SD2) representation. This notation has been chosen to achieve fast computation, as proposed by Avizienis (IEEE Transactions on Electronic Computers, vol. EC-10, no. 3, pp. 389-400, Sep. 1961), but the architecture presented in this paper, due to its structure and the definition of the cell implementing its architecture, saves area as well. The proposed divisor architecture is able to achieve a delay of order, similar to the solution presented by Takagi et al. (IEICE Transactions on Fundamentals of Electronics, Communications, and Computer Sciences, E89-A, no. 10, pp. 2874-2881, 2006) being considered as the state of the art, instead of other solutions that give O(n(2)) growth. This is in line with the fact that even if our carry-chains have a less impact on the circuit the basic cell is larger compared to the one proposed by Takagi et al. Our cells are larger that those proposed in literature, considering them as single circuit, but considering the overall structure there is a saving of some 40% in the number of gates and a gain of 55% in terms of power saving when compared with the state of the art.", "paper_title": "A New Compact SD2 Positive Integer Triangular Array Division Circuit", "paper_id": "WOS:000285844200005"}