{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud_computing"}, {"score": 0.04347900416933489, "phrase": "building_data"}, {"score": 0.037357632902107904, "phrase": "governance_model"}, {"score": 0.004767826806287385, "phrase": "building_information_management"}, {"score": 0.004342430078306461, "phrase": "industry's_strong_data_sharing"}, {"score": 0.003974349782102708, "phrase": "data_sharing_capability"}, {"score": 0.0036373553416391823, "phrase": "extensive_research"}, {"score": 0.003601715012418258, "phrase": "industry_consultation"}, {"score": 0.003496868378204654, "phrase": "individual_data"}, {"score": 0.003428665921276366, "phrase": "building_information_model"}, {"score": 0.0030464123943266673, "phrase": "cometcloud_autonomic_cloud_computing_engine"}, {"score": 0.0027334673433027086, "phrase": "defined_policy_language"}, {"score": 0.0026148807877309417, "phrase": "increasing_demand"}, {"score": 0.0025892330566358503, "phrase": "node_failure"}, {"score": 0.0022777800735119405, "phrase": "prototype's_performance"}, {"score": 0.0022223176391038785, "phrase": "additional_nodes"}, {"score": 0.0021049977753042253, "phrase": "node_failures"}], "paper_keywords": ["Cloud computing", " building information modelling", " data management", " distributed tuple space"], "paper_abstract": "The AEC (Architecture Engineering and Construction) sector is a highly fragmented, data intensive, project based industry, involving a number or very different professions and organisations. The industry's strong data sharing and processing requirements means that the management of building data is complex and challenging. We present a data sharing capability utilising Cloud Computing, with two key contributions: 1) a governance model for building data, based on extensive research and industry consultation. This governance model describes how individual data artefacts within a building information model relate to each other and how access to this data is controlled; 2) a prototype implementation of this governance model, utilising the CometCloud autonomic cloud computing engine, using the Master/Work paradigm. This prototype is able to successfully store and manage building data, provide security based on a defined policy language and demonstrate scale-out in case of increasing demand or node failure. Our prototype is evaluated both qualitatively and quantitatively. To enable this evaluation we have integrated our prototype with the 3D modelling software-Google Sketchup. We also evaluate the prototype's performance when scaling to utilise additional nodes in the Cloud and to determine its performance in case of node failures.", "paper_title": "Governance Model for Cloud Computing in Building Information Management", "paper_id": "WOS:000352789300012"}