{"auto_keywords": [{"score": 0.04346060492379688, "phrase": "new_approach"}, {"score": 0.02099657723741498, "phrase": "analog_self-interference_cancellation"}, {"score": 0.010187396560896596, "phrase": "self-interference_cancellation"}, {"score": 0.008001960784948414, "phrase": "different_paths"}, {"score": 0.00481495049065317, "phrase": "balanced_rf-"}, {"score": 0.004659192888931046, "phrase": "full_duplex_communications"}, {"score": 0.004564401713056939, "phrase": "analog_domain"}, {"score": 0.004471530397729526, "phrase": "full_duplex_wireless_communications"}, {"score": 0.0039362878637371574, "phrase": "balanced_rf_frond-end_circuit"}, {"score": 0.0037776319581225046, "phrase": "symmetrical_paths"}, {"score": 0.00313894917464766, "phrase": "normal_operation"}, {"score": 0.0029147175927233546, "phrase": "high_analog_self-interference_cancellation"}, {"score": 0.002762774046280398, "phrase": "experimental_results"}, {"score": 0.002575934917174136, "phrase": "flat_frequency_response"}, {"score": 0.002461810159687652, "phrase": "existing_analog_self-interference_cancellation_schemes"}, {"score": 0.002333421318779658, "phrase": "mimo_communications"}, {"score": 0.002304754792740636, "phrase": "scalable_way"}, {"score": 0.0021666953693574844, "phrase": "mimo"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Full duplex wireless communications", " Self-interference cancellation", " Balanced cancellation"], "paper_abstract": "Self-interference cancellation in the analog domain is critical to achieve full duplex wireless communications. However, the capability of analog self-interference cancellation is not fully explored. To this end, a new approach of analog self-interference cancellation is developed in this paper. More specifically, a balanced RF frond-end circuit is designed to allow a signal to propagate through symmetrical paths such that: (1) transmit signals taking different paths to arrive at the receiver can be cancelled; (2) receive signals from different paths are simply added at the receiver. As a result, self-interference is gracefully cancelled without impacting the normal operation of transmission and reception. Furthermore, this new approach includes several distinct features. First, it can achieve high analog self-interference cancellation. Implementation and experiments are conducted to validate the new approach, and experimental results show that it can achieve more than 65 dB of self-interference cancellation over 5 MHz bandwidth and 52 dB cancellation over 100 MHz bandwidth with a flat frequency response. Second, the new approach can be easily integrated with existing analog self-interference cancellation schemes to deliver much higher self-interference cancellation. Third, it can be easily extended to MIMO communications in a scalable way. Experiments show that our proposed antenna cancellation schemes are sufficient to achieve the goal of analog self-interference cancellation for MIMO communications. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Balanced RF-circuit based self-interference cancellation for full duplex communications", "paper_id": "WOS:000347581200016"}