{"auto_keywords": [{"score": 0.04014449216570938, "phrase": "image_content"}, {"score": 0.023003257197318334, "phrase": "better_image_representations"}, {"score": 0.02270781195269704, "phrase": "social_media"}, {"score": 0.021985322485903073, "phrase": "image_representations"}, {"score": 0.010612387000973441, "phrase": "visual_topic_network"}, {"score": 0.00672765600412164, "phrase": "user_tags"}, {"score": 0.0053977174305692615, "phrase": "proposed_vtn_model"}, {"score": 0.004674402456361649, "phrase": "topic_models"}, {"score": 0.00452302256811929, "phrase": "general_images"}, {"score": 0.004319255461225845, "phrase": "interesting_problem"}, {"score": 0.004206948146882303, "phrase": "images'_social_contextual_cues"}, {"score": 0.00384894851099016, "phrase": "exact_correspondences"}, {"score": 0.0035562929339427803, "phrase": "realistic_scenarios"}, {"score": 0.0032858160838749196, "phrase": "real-world_social_media_data"}, {"score": 0.00291806687851358, "phrase": "image_network"}, {"score": 0.002713842991944533, "phrase": "network_structured_topic_model"}, {"score": 0.002523875743494305, "phrase": "weakly_annotated_tags"}, {"score": 0.002402016201299179, "phrase": "relational_topic_model"}, {"score": 0.002339442939538852, "phrase": "document_analysis_literature"}, {"score": 0.0023011632163055166, "phrase": "binary_article_relations"}, {"score": 0.002286028584763479, "phrase": "rtm"}, {"score": 0.002263508433567761, "phrase": "proposed_vtn"}, {"score": 0.0022338277339064155, "phrase": "multiple-level_image_relations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Image representation", " Topic model", " Visual Topic Network", " Social media"], "paper_abstract": "Topic models have demonstrated to be effective on building image representations for general images. Recently, how to build better image representations for images in social media becomes an interesting problem, where one key issue is how to leverage images' social contextual cues, e.g., user tags associated with images. Nevertheless, most previous methods either just exploited image content and neglect user tags, or assumed there are exact correspondences between image content and tags, i.e.. tags are closely related to image content. Thus, they cannot be applied to the realistic scenarios where the images are only weakly annotated with tags, i.e., tags are only loosely related to image content as already manifested in real-world social media data. In this paper, we address the problem of building better image representations in social media, where the images are weakly annotated with user tags. In particular, we organize a collection of images as an image network where the relations between images are modeled by user tags. To model such image network and build image representations, we further propose a network structured topic model, namely Visual Topic Network (VTN), where the image content and their relations are simultaneously modeled. In this way, the weakly annotated tags can be effectively leveraged as building image representations. The proposed VTN model is inspired by the Relational Topic Model (RTM) recently introduced in the document analysis literature. Different from the binary article relations in RTM, the proposed VTN can model the multiple-level image relations. Our extensive experiments on two social media datasets demonstrated the advantage of the proposed VTN model. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Visual Topic Network: Building better image representations for images in social media", "paper_id": "WOS:000356116800002"}