{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "modal_logic"}, {"score": 0.048890872801774496, "phrase": "syntactic_property"}, {"score": 0.04269355214908113, "phrase": "epistemic_logic"}, {"score": 0.004246271940215511, "phrase": "agent_b"}, {"score": 0.003744505496142733, "phrase": "temporal_setting"}, {"score": 0.003640011825552854, "phrase": "dynamic_setting"}, {"score": 0.003354180941665089, "phrase": "common_knowledge"}, {"score": 0.003100465875551721, "phrase": "actual_state"}, {"score": 0.0029021941361680637, "phrase": "relational_atoms"}, {"score": 0.002640682934273318, "phrase": "rich_class"}, {"score": 0.0026241089938360634, "phrase": "modal_logics"}, {"score": 0.0025831266474492308, "phrase": "syntactic_properties"}, {"score": 0.002380089119791563, "phrase": "enriched_language"}, {"score": 0.002291827910789624, "phrase": "public_announcements"}, {"score": 0.0022702776603245036, "phrase": "enriched_epistemic_logic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge representation", " Modal logic", " Correspondence", " Canonicity", " Local properties", " Epistemic logic"], "paper_abstract": "In modal logic, when adding a syntactic property to an axiomatisation, this property will semantically become true in all models, in all situations, under all circumstances. For instance, adding a property like K(a)p -> K(b)p (agent b knows at least what agent a knows) to an axiomatisation of some epistemic logic has as an effect that such a property becomes globally true, i.e., it will hold in all states, at all time points (in a temporal setting), after every action (in a dynamic setting) and after any communication (in an update setting), and every agent will know that it holds, it will even be common knowledge. We propose a way to express that a property like the above only needs to hold locally: it may hold in the actual state, but not in all states, and not all agents may know that it holds. We achieve this by adding relational atoms to the language that represent (implicitly) quantification over all formulas, as in for all p(K(a)p -> K(b)p). We show how this can be done for a rich class of modal logics and a variety of syntactic properties. We then study the epistemic logic enriched with the syntactic property 'knowing at least as much as' in more detail. We show that the enriched language is not preserved under bisimulations. We also demonstrate that adding public announcements to this enriched epistemic logic makes it more expressive, which is for instance not true for the 'standard' epistemic logic S5. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Local properties in modal logic", "paper_id": "WOS:000305598200006"}