{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "dynamic_networks"}, {"score": 0.0041328796505374155, "phrase": "specific_problem"}, {"score": 0.004068611852912931, "phrase": "specific_context"}, {"score": 0.003491894048789576, "phrase": "general_model"}, {"score": 0.0032158817866929563, "phrase": "dynamic_network"}, {"score": 0.002825435048559866, "phrase": "dynamic_context"}, {"score": 0.002792375587031108, "phrase": "high_level"}, {"score": 0.002738131487658495, "phrase": "proposed_model"}, {"score": 0.002551409948440577, "phrase": "local_computations"}, {"score": 0.002501835053002899, "phrase": "useful_results"}, {"score": 0.002453221048083196, "phrase": "static_networks"}, {"score": 0.0023773911659018803, "phrase": "associated_formalism"}, {"score": 0.002340357706078868, "phrase": "original_synchronization_mode"}, {"score": 0.0022414566728770745, "phrase": "different_mobility_contexts"}, {"score": 0.0021383149182448544, "phrase": "document_propagation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "resume_feature"}], "paper_keywords": [""], "paper_abstract": "Many research projects are being done in the domain of wireless mobile and/or ad-hoc networks to provide tools, algorithms and applications that make it possible to handle or use their dynamic characteristics. The purpose of most of these projects is to solve a specific problem, in a specific context. Most often, the models and formalisms that are used are also specific and the results are therefore difficult both to understand and to use in another context. We believe that what is needed is a general model offering a very high level of abstraction, in order to define and characterize what is feasable or not feasable in a dynamic network, depending upon some of its characteristics. In this paper we define such a model and its associated formalism. They are adapted to the study of dynamic networks and to the modeling of algorithms in a dynamic context at a high level of abstraction. The proposed model (Dynamicity Aware Graph Relabeling Systems) derives from what has been achieved in the area of local computations, and that produced useful results in the context of static networks. Our contribution comprises a model and the associated formalism, plus an original synchronization mode between nodes that allows to seemlessly adapt an algorithm to different mobility contexts. All the concepts are illustrated and discussed through the example of a document propagation algorithm, with a resume feature.", "paper_title": "Dynamicity aware graph relabeling systems and the constraint based synchronization: A unifying approach to deal with dynamic networks", "paper_id": "WOS:000240084000064"}