{"auto_keywords": [{"score": 0.049568154654955725, "phrase": "intention_prediction"}, {"score": 0.02310531728448584, "phrase": "intention_detection"}, {"score": 0.021013673338230107, "phrase": "observed_actions"}, {"score": 0.010612387000973441, "phrase": "computational_models"}, {"score": 0.010443928214977197, "phrase": "intention_recognition"}, {"score": 0.004674952036988355, "phrase": "core_components"}, {"score": 0.004575686732899068, "phrase": "social_cognition"}, {"score": 0.004551199992546761, "phrase": "human_beings"}, {"score": 0.004210458358142504, "phrase": "existing_accounts"}, {"score": 0.0038846843242954935, "phrase": "failed_sequences"}, {"score": 0.0037113541623199097, "phrase": "open_questions"}, {"score": 0.0036422425344358037, "phrase": "human_intention_recognition"}, {"score": 0.0033243718810317254, "phrase": "high-level_overview"}, {"score": 0.0029221312451219203, "phrase": "underlying_intention"}, {"score": 0.002837011101431263, "phrase": "arbitrary_manner"}, {"score": 0.002717594582706144, "phrase": "incomplete_sequence"}, {"score": 0.0025822818714499795, "phrase": "existing_literature"}, {"score": 0.002447101794397243, "phrase": "high_levels"}, {"score": 0.002215356138269358, "phrase": "intimate_relationship"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Intention recognition", " Intention prediction", " Cognitive modeling"], "paper_abstract": "Intention recognition is one of the core components of mindreading, an important process in social cognition. Human beings, from age of 18 months, have been shown to be able to extrapolate intentions from observed actions, even when the performer failed at achieving the goal. Existing accounts of intention recognition emphasize the use of an intent (plan) library, which is matched against observed actions for recognition. These therefore cannot account for recognition of failed sequences of actions, nor novel actions. In this paper, we begin to tackle these open questions by examining computational models for components of human intention recognition, which emphasize the ability of humans to detect and identify intentions in a sequence of observed actions, based solely on the rationality of movement (its efficiency). We provide a high-level overview of intention recognition as a whole, and then elaborate on two components of the model, which we believe to be at its core, namely, those of intention detection and intention prediction. By intention detection we mean the ability to discern whether a sequence of actions has any underlying intention at all, or whether it was performed in an arbitrary manner with no goal in mind. By intention prediction we mean the ability to extend an incomplete sequence of actions to its most likely intended goal. We evaluate the model, and these two components, in context of existing literature, and in a number of experiments with more than 140 human subjects. For intention detection, our model was able to attribute high levels of intention to those traces perceived by humans as intentional, and vice versa. For intention prediction as well, our model performed in a way that closely matched that of humans. The work highlights the intimate relationship between the ability to generate plans, and the ability to recognize intentions. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Towards computational models of intention detection and intention prediction", "paper_id": "WOS:000330578400004"}