{"auto_keywords": [{"score": 0.04439911760143708, "phrase": "ddi_alerts"}, {"score": 0.043923027693532936, "phrase": "dutch_drug_database"}, {"score": 0.03693884023210694, "phrase": "ddi"}, {"score": 0.00481495049065317, "phrase": "frequently_overridden_drug_alerts"}, {"score": 0.0045932001040047445, "phrase": "frequently_overridden_drug-drug_interaction_alerts"}, {"score": 0.004541918674719973, "phrase": "computerized_physician_order_entry"}, {"score": 0.004431096939980346, "phrase": "drug_safety_alerts"}, {"score": 0.004133055661437163, "phrase": "screen_shots"}, {"score": 0.004114527599108734, "phrase": "complete_texts"}, {"score": 0.004096082254543022, "phrase": "frequently_overridden_ddis"}, {"score": 0.004041238873048836, "phrase": "internal_medicine"}, {"score": 0.003969250376327401, "phrase": "hospital_pharmacists"}, {"score": 0.0038376971022865886, "phrase": "patient_safety"}, {"score": 0.003595552309967789, "phrase": "category_ddis"}, {"score": 0.0032937431545705647, "phrase": "medical_specialties"}, {"score": 0.0028266702882401027, "phrase": "highest_agreement"}, {"score": 0.0027762571654110137, "phrase": "positive_correlation"}, {"score": 0.0026067689470824352, "phrase": "selected_reduction"}, {"score": 0.00249767641333441, "phrase": "alert_overload"}, {"score": 0.0023931384164668835, "phrase": "drug-related_knowledge"}, {"score": 0.0023504390264682757, "phrase": "routine_drug_monitoring_practices"}, {"score": 0.0022775359680007033, "phrase": "safety_perspective"}, {"score": 0.0022068891259005787, "phrase": "alert_texts"}, {"score": 0.0021675056544880997, "phrase": "clinician_knowledge"}, {"score": 0.002114495969857587, "phrase": "serum_levels"}, {"score": 0.0021049977753042253, "phrase": "patient_parameters"}], "paper_keywords": [""], "paper_abstract": "Objectives: This study sought to identify opportunities to safely turn off frequently overridden drug-drug interaction alerts (DDIs) in computerized physician order entry (CPOE). Design: Quantitative retrospective analysis of drug safety alerts overridden during 1 month and qualitative interviews with 24 respondents (18 physicians and 6 pharmacists) about turning off frequently overridden DDI alerts, based on the Dutch drug database, in a hospital setting. Screen shots and complete texts of frequently overridden DDIs were presented to physicians of internal medicine, cardiology, and surgery and to hospital pharmacists who were asked whether these could be turned off hospital-wide without impairing patient safety, and the reasons for their recommendations. Results: Data on the frequency of alerts overridden in I month identified 3,089 overrides, of which 1,963 were DDIs. The category DDIs showed 86 different alerts, of which 24 frequently overridden alerts, accounting for 72% of all DDI overrides, were selected for further evaluation. The 24 respondents together made 576 assessments. Upon investigation, differences in the reasons for turning off alerts were found across medical specialties and among respondents within a specialty. Frequently mentioned reasons for turning off were \"alert well known,\" \"alert not serious,\" or \"alert not needing (additional) action,\" or that the effects of the combination were monitored or intended. For none of the alerts did all respondents agree that it could be safely turned off hospital-wide. The highest agreement was 13 of 24 respondents (54%). A positive correlation was found between the number of alerts overridden and the number of clinicians recommending to turn them off. Conclusion: Although the Dutch drug database is already a selected reduction from all DDIs mentioned in literature, the majority of respondents wanted to turn off DDI alerts to reduce alert overload. Turning off DDI alerts hospital-wide appeared to be problematic because of differences among physicians regarding drug-related knowledge and of differences across the hospital in routine drug monitoring practices. Furthermore, several reasons for suppression of alerts could be questioned from a safety perspective. Further research should investigate when each of the following might help: changes in alert texts; new differential alert triggers based on clinician knowledge or specialty; and nonintrusive alert presentation so long as serum levels and patient parameters are measured and stay within limits.", "paper_title": "Turning off frequently overridden drug alerts: Limited opportunities for doing it safely", "paper_id": "WOS:000257794700006"}