{"auto_keywords": [{"score": 0.04959024199151092, "phrase": "random_forests"}, {"score": 0.03129154879931237, "phrase": "higher_space"}, {"score": 0.030215809679591407, "phrase": "best_split"}, {"score": 0.026392644474033274, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "feature_spaces"}, {"score": 0.004527387269412446, "phrase": "breiman"}, {"score": 0.004235095881928715, "phrase": "weak_learners"}, {"score": 0.0034841647157189985, "phrase": "new_method"}, {"score": 0.0032256881625734777, "phrase": "overall_accuracy"}, {"score": 0.003160049822855747, "phrase": "training_process"}, {"score": 0.0031116963435584982, "phrase": "individual_tree"}, {"score": 0.0030327408069772293, "phrase": "different_rotation_spaces"}, {"score": 0.002910545717767559, "phrase": "root_node"}, {"score": 0.002559444836360178, "phrase": "subsequent_nodes"}, {"score": 0.0023331227492950422, "phrase": "standard_random_forests"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ensemble", " Classification", " Diversity", " Transformation", " Rotation"], "paper_abstract": "Random Forests receive much attention from researchers because of their excellent performance. As Breiman suggested, the performance of Random Forests depends on the strength of the weak learners in the forests and the diversity among them. However, in the literature, many researchers only considered pre-processing of the data or post-processing of the Random Forests models. In this paper, we propose a new method to increase the diversity of each tree in the forests and thereby improve the overall accuracy. During the training process of each individual tree in the forest, different rotation spaces are concatenated into a higher space at the root node. Then the best split is exhaustively searched within this higher space. The location where the best split lies decides which rotation method to be used for all subsequent nodes. The performance of the proposed method here is evaluated on 42 benchmark data sets from various research fields and compared with the standard Random Forests. The results show that the proposed method improves the performance of the Random Forests in most cases. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Random Forests with ensemble of feature spaces", "paper_id": "WOS:000338392400018"}