{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "symmetrical_matrix"}, {"score": 0.012972562218625886, "phrase": "post-compression_indices"}, {"score": 0.012823704208987066, "phrase": "original_indices"}, {"score": 0.004667833113864304, "phrase": "symmetrical_or_quasi-symmetrical_information"}, {"score": 0.004507667881645218, "phrase": "network_resources"}, {"score": 0.00440394242852293, "phrase": "real-time_transmission"}, {"score": 0.004075053556360943, "phrase": "index_transform_formulae"}, {"score": 0.003844545552246988, "phrase": "index_inverse"}, {"score": 0.0033559647822437298, "phrase": "bi-layer_loops_algorithm"}, {"score": 0.00326594229173048, "phrase": "time_complexity_factor"}, {"score": 0.003178326919668771, "phrase": "index_inverse_transform_formulae"}, {"score": 0.003093054709625219, "phrase": "corresponding_time_complexity_factor"}, {"score": 0.002963640433319524, "phrase": "significant_improvement"}, {"score": 0.0028506823968539206, "phrase": "index_inverse_transform_formula"}, {"score": 0.002606906626639414, "phrase": "five_theorems"}, {"score": 0.002527083139627522, "phrase": "relative_running_efficiency"}, {"score": 0.0024784363584530976, "phrase": "covariance_matrix"}, {"score": 0.002301948128603966, "phrase": "itrf"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["symmetrical matrix", " column-compression", " index transform", " index inverse transform", " ITRF", " relative running efficiency"], "paper_abstract": "Compressing symmetrical or quasi-symmetrical information can decrease data redundancy, save storage and network resources, and speed up the real-time transmission of symmetrical data over a network. During the past few decades, the compression and decompression of a symmetrical matrix, the index transform formulae have been used to calculate the post-compression indices from the original indices. However, the index inverse transform formulae that are used to calculate the original indices from the post-compression indices have yet to be derived. The algorithms used to decompress these matrices have never been very efficient, such as the bi-layer loops algorithm, which is proportional to the time complexity factor O(n(2)). Using the index inverse transform formulae deduced in this paper, the corresponding time complexity factor can be reduced to O(1), which is a significant improvement. This paper analyses the difficulty in deriving an index inverse transform formula. The formulae for the index transform and its inverse transform of the column-compression of the symmetrical matrix are proposed and can be stated as five theorems. Based on those formulae, the relative running efficiency of two decompressions on the covariance matrix of the positions and velocities of ITRF2000-ALASKA Stations is analyzed. It is concluded that two redundant fields in the International Terrestrial Reference Frame (ITRF) covariance matrix file can be removed. Other related issues for further study in the geosciences are also raised. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Index transforms of a symmetrical matrix: Application to the geosciences", "paper_id": "WOS:000253365200001"}