{"auto_keywords": [{"score": 0.0472123292691801, "phrase": "mechanical_properties"}, {"score": 0.009889853762947818, "phrase": "effector_systems"}, {"score": 0.00481495049065317, "phrase": "interpersonal_coordination"}, {"score": 0.004770627232703404, "phrase": "present_study"}, {"score": 0.00466877910546307, "phrase": "handheld_pendulums"}, {"score": 0.004611554879923759, "phrase": "special_emphasis"}, {"score": 0.004430354365175098, "phrase": "first_part"}, {"score": 0.004038800378904376, "phrase": "antiphase_fashion"}, {"score": 0.0039040344230094164, "phrase": "different_resonance_frequencies"}, {"score": 0.0037621210719690594, "phrase": "different_experimental_combinations"}, {"score": 0.003693103542455806, "phrase": "preferred_frequencies"}, {"score": 0.0035478628449322866, "phrase": "resonance_frequencies"}, {"score": 0.0033768959341690524, "phrase": "common_frequencies"}, {"score": 0.0032240802202623316, "phrase": "previous_studies"}, {"score": 0.0031164146336810717, "phrase": "intended_relative_phase"}, {"score": 0.0030497740719977835, "phrase": "task-effector_asymmetry"}, {"score": 0.0029027394930867902, "phrase": "second_part"}, {"score": 0.002654023460098497, "phrase": "wrist-pendulum_system"}, {"score": 0.0025812459787060097, "phrase": "natural_tendency"}, {"score": 0.00230950802983053, "phrase": "common_frequency"}, {"score": 0.0022117133940361025, "phrase": "proposed_model"}, {"score": 0.002137782483718478, "phrase": "different_conditions"}, {"score": 0.0021049977753042253, "phrase": "intended_mode"}], "paper_keywords": ["rhythmic movements", " coordination dynamics", " coupling", " pendulum", " resonance frequency", " neural oscillator"], "paper_abstract": "The present study investigates the coordination between two people oscillating handheld pendulums, with a special emphasis on the influence of the mechanical properties of the effector systems involved. The first part of the study is an experiment in which eight pairs of participants are asked to coordinate the oscillation of their pendulum with the other participant's in an in-phase or antiphase fashion. Two types of pendulums, A and B, having different resonance frequencies (Freq A=0.98 Hz and Freq B=0.64 Hz), were used in different experimental combinations. Results confirm that the preferred frequencies produced by participants while manipulating each pendulum individually were close to the resonance frequencies of the pendulums. In their attempt to synchronize with one another, participants met at common frequencies that were influenced by the mechanical properties of the two pendulums involved. In agreement with previous studies, both the variability of the behavior and the shift in the intended relative phase were found to depend on the task-effector asymmetry, i.e., the difference between the mechanical properties of the effector systems involved. In the second part of the study, we propose a model to account for these results. The model consists of two cross-coupled neuro-mechanical units, each composed of a neural oscillator driving a wrist-pendulum system. Taken individually, each unit reproduced the natural tendency of the participants to freely oscillate a pendulum close to its resonance frequency. When cross-coupled through the vision of the pendulum of the other unit, the two units entrain each other and meet at a common frequency influenced by the mechanical properties of the two pendulums involved. The ability of the proposed model to address the other effects observed as a function of the different conditions of the pendulum and intended mode of coordination is discussed.", "paper_title": "A neuro-mechanical model for interpersonal coordination", "paper_id": "WOS:000237194000001"}