{"auto_keywords": [{"score": 0.04577187437978843, "phrase": "construction_practitioners"}, {"score": 0.00481495049065317, "phrase": "building_renovation"}, {"score": 0.004767546015485477, "phrase": "building_renovations"}, {"score": 0.00395017798595193, "phrase": "self-organizing_feature_map"}, {"score": 0.0034386894664467003, "phrase": "renovation_data"}, {"score": 0.0033379819706003885, "phrase": "somoc_algorithm"}, {"score": 0.003176626803985225, "phrase": "basic_building_features"}, {"score": 0.003068327486877065, "phrase": "somoc_method"}, {"score": 0.0029055323737809825, "phrase": "cluster_analysis"}, {"score": 0.0028484940955893134, "phrase": "subsequent_discussion"}, {"score": 0.0026839922027139967, "phrase": "similar_distributions"}, {"score": 0.0025668646315794947, "phrase": "building_size"}, {"score": 0.0024306105794630246, "phrase": "renovation_practice"}, {"score": 0.002336071138145897, "phrase": "renovation_frequency"}, {"score": 0.0021049977753042253, "phrase": "somoc"}], "paper_keywords": ["SOM", " clustering", " building renovation", " construction management"], "paper_abstract": "Building renovations are usually performed as required based on inconvenience or damage that has already taken place. Construction practitioners are seldom aware of the relationships between all the related factors and their corresponding costs. The purpose of this study is to apply the self-organizing feature map (SOM) optimization based clustering (SOMOC) algorithm to building renovations so as to evaluate its feasibility and provide solutions. We collected 1056 sets of building renovation data sampled from 102 buildings. The SOMOC algorithm is utilized to expose the tendency in view of basic building features. The results suggest that the SOMOC method is feasible and effectively divides the data into 8 clusters for cluster analysis. In the subsequent discussion, findings imply that: (1) all clusters have similar distributions in terms of proportion of building age and building size, and thus, no rule can be formed for renovation practice; and (2) location, structure type, renovation frequency and cost are all related to each other. The benefits of the study not only prove the practicability of SOMOC but help the construction practitioners to learn from the past.", "paper_title": "Application of SOMO Based Clustering in Building Renovation", "paper_id": "WOS:000260349600008"}