{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "dynamic_textures"}, {"score": 0.01505517792949531, "phrase": "video_sequences"}, {"score": 0.00473477283457869, "phrase": "dynamical_systems"}, {"score": 0.004125513927068713, "phrase": "dynamic_texture"}, {"score": 0.004002596930301241, "phrase": "state-of-the-art_dynamic_texture_categorization_methods"}, {"score": 0.0037930162319613856, "phrase": "linear_dynamical_system"}, {"score": 0.0033492947290751996, "phrase": "different_viewpoint"}, {"score": 0.003227643104496149, "phrase": "novel_dynamic_texture_categorization_framework"}, {"score": 0.003131393466870228, "phrase": "video_sequence"}, {"score": 0.0030176323936876317, "phrase": "small_spatiotemporal_patch"}, {"score": 0.00279291004189267, "phrase": "feature_descriptors"}, {"score": 0.002709589081384597, "phrase": "traditional_bof_approach"}, {"score": 0.002400373755068185, "phrase": "nonlinear_dimensionality_reduction"}, {"score": 0.0023842666006371267, "phrase": "clustering_techniques"}, {"score": 0.0023523750536537102, "phrase": "martin_distance"}, {"score": 0.0022668507535947976, "phrase": "proposed_bos_approach"}, {"score": 0.002251637552201872, "phrase": "existing_dynamic_texture_categorization_methods"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["Dynamic textures", " categorization", " linear dynamical systems"], "paper_abstract": "We consider the problem of categorizing video sequences of dynamic textures, i.e., nonrigid dynamical objects such as fire, water, steam, flags, etc. This problem is extremely challenging because the shape and appearance of a dynamic texture continuously change as a function of time. State-of-the-art dynamic texture categorization methods have been successful at classifying videos taken from the same viewpoint and scale by using a Linear Dynamical System (LDS) to model each video, and using distances or kernels in the space of LDSs to classify the videos. However, these methods perform poorly when the video sequences are taken under a different viewpoint or scale. In this paper, we propose a novel dynamic texture categorization framework that can handle such changes. We model each video sequence with a collection of LDSs, each one describing a small spatiotemporal patch extracted from the video. This Bag-of-Systems (BoS) representation is analogous to the Bag-of-Features (BoF) representation for object recognition, except that we use LDSs as feature descriptors. This choice poses several technical challenges in adopting the traditional BoF approach. Most notably, the space of LDSs is not euclidean; hence, novel methods for clustering LDSs and computing codewords of LDSs need to be developed. We propose a framework that makes use of nonlinear dimensionality reduction and clustering techniques combined with the Martin distance for LDSs to tackle these issues. Our experiments compare the proposed BoS approach to existing dynamic texture categorization methods and show that it can be used for recognizing dynamic textures in challenging scenarios which could not be handled by existing methods.", "paper_title": "Categorizing Dynamic Textures Using a Bag of Dynamical Systems", "paper_id": "WOS:000312560600008"}