{"auto_keywords": [{"score": 0.03635422702036353, "phrase": "web_application"}, {"score": 0.00481495049065317, "phrase": "application_server_logs"}, {"score": 0.004693167092003573, "phrase": "web-based_systems"}, {"score": 0.0046038458731764926, "phrase": "confidential_information"}, {"score": 0.0041023644174418205, "phrase": "secure_web_application"}, {"score": 0.0037743802306714545, "phrase": "access_control"}, {"score": 0.00334144503360907, "phrase": "unauthorised_access"}, {"score": 0.0032359856233193504, "phrase": "intrusion_detection_component"}, {"score": 0.003154012038613403, "phrase": "text_categorisation"}, {"score": 0.002535779689260244, "phrase": "explicit_programming"}, {"score": 0.0024556852466581527, "phrase": "existing_web_application"}, {"score": 0.002347775213789611, "phrase": "real_web-based_telemedicine_system"}, {"score": 0.002259054486157494, "phrase": "evaluation_measurements"}], "paper_keywords": ["web intrusion detection", " web application server", " machine learning", " text mining", " text categorisation", " document classification"], "paper_abstract": "Security in web-based systems that handle confidential information can be considered a particularly sensitive subject that requires assuming some responsibilities about security. Achieving a secure web application involves tackling several issues such encryption of traffic and certain database information, strictly restricted access control, etc. In this work we focus on detecting misuse of the web application in order to gain unauthorised access. We introduce an Intrusion Detection component that by applying Text Categorisation is capable of learning the characteristics of both normal and malicious user behaviour from the regular, high-level log entries generated by web application through its application server. Therefore, the detection of misuse in the web application is achieved without the need of explicit programming or modification of the existing web application. We applied our Intrusion Detection component to a real web-based telemedicine system in order to offer some evaluation measurements. This articles offers an overview of the model, our experiences, and observations.", "paper_title": "Web misuse detection through text categorisation of application server logs", "paper_id": "WOS:000241502500012"}