{"auto_keywords": [{"score": 0.042112809942215015, "phrase": "proposed_methodology"}, {"score": 0.015719716506582538, "phrase": "hybrid_fuzzy_and_neural_approach"}, {"score": 0.014374927450309511, "phrase": "dram_price_forecasting"}, {"score": 0.01289365782708781, "phrase": "virtual_experts"}, {"score": 0.00972387457539737, "phrase": "polygon-shaped_fuzzy_number"}, {"score": 0.0041773934798743405, "phrase": "partial_consensus"}, {"score": 0.003694886972746004, "phrase": "flr"}, {"score": 0.003486123304074186, "phrase": "dram_product"}, {"score": 0.0033752674784204412, "phrase": "flr_equation"}, {"score": 0.0031233388358844188, "phrase": "partial-consensus_fuzzy_intersection"}, {"score": 0.0030239842475439814, "phrase": "fuzzy_price_forecasts"}, {"score": 0.002726740692380339, "phrase": "back_propagation_network"}, {"score": 0.002380381895973937, "phrase": "practical_case"}, {"score": 0.0021742244283295986, "phrase": "experimental_results"}], "paper_keywords": ["DRAM", " Price", " Forecasting", " Fuzzy", " Neural", " Virtual expert", " Partial consensus"], "paper_abstract": "To further enhance the accuracy and precision of DRAM price forecasting, a hybrid fuzzy and neural approach with virtual experts and partial consensus is proposed. In the proposed methodology, some virtual experts form a committee. These virtual experts construct their own fuzzy linear regression (FLR) equations to forecast the price of a DRAM product from various viewpoints. Each FLR equation can be transformed into two equivalent NP problems to be solved. Subsequently, partial-consensus fuzzy intersection is applied to aggregate fuzzy price forecasts into a polygon-shaped fuzzy number, in order to improve the precision. After that, a back propagation network is constructed to defuzzify the polygon-shaped fuzzy number and to generate a representative/crisp value, so as to enhance the accuracy. A practical case is used to evaluate the effectiveness of the proposed methodology. According to the experimental results, the proposed methodology improved both the precision and accuracy of DRAM price forecasting by 75% and 65%, respectively.", "paper_title": "A HYBRID FUZZY AND NEURAL APPROACH WITH VIRTUAL EXPERTS AND PARTIAL CONSENSUS FOR DRAM PRICE FORECASTING", "paper_id": "WOS:000299648400006"}