{"auto_keywords": [{"score": 0.04965333175972822, "phrase": "cobot"}, {"score": 0.010106450467697469, "phrase": "lambdamoo"}, {"score": 0.004344855841195913, "phrase": "cobot's_goal"}, {"score": 0.004248869786808024, "phrase": "actual_part"}, {"score": 0.004063186599879217, "phrase": "detailed_discussion"}, {"score": 0.0036826452656927877, "phrase": "cobot's_fundamental_power"}, {"score": 0.0035374012552316573, "phrase": "social_statistics"}, {"score": 0.0034283921404628975, "phrase": "interpersonal_interactions"}, {"score": 0.0026806139086152365, "phrase": "proper_way"}, {"score": 0.00259793885118959, "phrase": "individual_users"}, {"score": 0.0023437863565921053, "phrase": "complex_social_environment"}, {"score": 0.002271476019266231, "phrase": "multiple_sources"}, {"score": 0.002251227801482381, "phrase": "human_reward"}, {"score": 0.0022013916728990564, "phrase": "unique_experiment"}, {"score": 0.0021720199689914464, "phrase": "adaptive_agents"}, {"score": 0.0021049977753042253, "phrase": "social_spaces"}], "paper_keywords": ["reinforcement learning", " social modeling", " chat agents", " autonomous agents", " game theory", " believable agents"], "paper_abstract": "We describe our development of Cobot, a novel software agent who lives in LambdaMOO, a popular virtual world frequented by hundreds of users. Cobot's goal was to become an actual part of that community. Here, we present a detailed discussion of the functionality that made him one of the objects most frequently interacted with in LambdaMOO, human or artificial. Cobot's fundamental power is that he has the ability to collect social statistics summarizing the quantity and quality of interpersonal interactions. Initially, Cobot acted as little more than a reporter of this information; however, as he collected more and more data, he was able to use these statistics as models that allowed him to modify his own behavior. In particular, cobot is able to use this data to \"self-program,\" learning the proper way to respond to the actions of individual users, by observing how others interact with one another. Further, Cobot uses reinforcement learning to proactively take action in this complex social environment, and adapts his behavior based on multiple sources of human reward. Cobot represents a unique experiment in building adaptive agents who must live in and navigate social spaces.", "paper_title": "Cobot in LambdaMOO: An adaptive social statistics agent", "paper_id": "WOS:000240316500003"}