{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ga"}, {"score": 0.030881030805790216, "phrase": "computed_angle"}, {"score": 0.004574709094672837, "phrase": "biped_robot_dynamics"}, {"score": 0.004378309349451268, "phrase": "practical_cases"}, {"score": 0.0041294419262414995, "phrase": "shock_absorber"}, {"score": 0.003981106369547929, "phrase": "industrial_robots"}, {"score": 0.0038946650372062783, "phrase": "biped_robots"}, {"score": 0.003713736138854327, "phrase": "trajectory_generation_method"}, {"score": 0.0036731870109004993, "phrase": "genetic_algorithm"}, {"score": 0.003528244907944199, "phrase": "flat_terrain"}, {"score": 0.0033890026927890058, "phrase": "proposed_method"}, {"score": 0.003315374849824563, "phrase": "joint_angle"}, {"score": 0.0032671775301001513, "phrase": "single_ga_layer"}, {"score": 0.003161271802988128, "phrase": "earlier_models"}, {"score": 0.0029813748433158032, "phrase": "simple_control_method"}, {"score": 0.002770791022032813, "phrase": "control_method"}, {"score": 0.002565626044684815, "phrase": "flat_ground"}, {"score": 0.00253758084385033, "phrase": "sole_deformation"}, {"score": 0.002323953608863511, "phrase": "least_energy"}, {"score": 0.0021676351850669017, "phrase": "deformation_correction"}], "paper_keywords": ["biped gait", " GA based trajectory generation", " sole deformation"], "paper_abstract": "In biped robot dynamics, the foot is generally considered rigid. However, in practical cases, there will be a layer of rubber on the sole to act as a shock absorber. Such electrodynamic contact has been studied in the case of industrial robots, but the experience with biped robots is rare. The goal of this paper is to device a trajectory generation method using a genetic algorithm (GA) for an 8 DOF robot that can walk on flat terrain and climb stairs with deformation at the sole. The proposed method uses splines to model each joint angle and needs a single GA layer, which makes it faster and simpler than earlier models. The method incorporates the dynamics of an actual 8 DOF robot to find the most energy optimal gait. A simple control method is proposed that corrects the computed angle required to follow ZMP incorporating the deformation of the sole. Using the control method the computed angle is first corrected and then the trajectory optimized. Energy consumed in three cases were compared: walk on flat ground with no sole deformation, walk with uncorrected deformed soft sole and walk with deformed soft sole with correction of deformation. It is found that the least energy was consumed in the case of soft sole with correction for deformation. This proves the need for deformation correction of soft sole and the usefulness of our proposed method.", "paper_title": "Trajectory generation using GA for an 8 DOF biped robot with deformation at the sole of the foot", "paper_id": "WOS:000245269400004"}