{"auto_keywords": [{"score": 0.04911945324917725, "phrase": "global_synchrony"}, {"score": 0.02322730111336097, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.004512814529823301, "phrase": "information_dissemination"}, {"score": 0.004404445045826858, "phrase": "deterministic_protocols"}, {"score": 0.0043161190928529755, "phrase": "weak_set"}, {"score": 0.004078078530972285, "phrase": "disconnection_time"}, {"score": 0.003980106938194548, "phrase": "link_stability_time"}, {"score": 0.0035386420095120706, "phrase": "previous_papers"}, {"score": 0.0031845067058084583, "phrase": "transmission_schedule"}, {"score": 0.003107935254560724, "phrase": "global_time"}, {"score": 0.003020918749760067, "phrase": "main_contribution"}, {"score": 0.0029602552900111433, "phrase": "negative_results"}, {"score": 0.0029126002350975634, "phrase": "lower_and_upper_bounds"}, {"score": 0.0022738201751000865, "phrase": "efficient_quasi-oblivious_protocol"}, {"score": 0.0021394674440767124, "phrase": "source_node"}, {"score": 0.0021049977753042253, "phrase": "global_reference"}], "paper_keywords": ["Mobile ad-hoc networks", " Radio networks", " Geocast", " Broadcast", " Lower bounds"], "paper_abstract": "The topic of this paper is the study of information dissemination in mobile ad-hoc networks by means of deterministic protocols. We assume a weak set of restrictions on the mobility of nodes, parameterized by alpha, the disconnection time, and beta, the link stability time, such that the mobile ad-hoc networks considered are connected enough for dissemination. Such a connectivity model generalizes previous models in that we assume much less connectivity, or make explicit the assumptions in previous papers. The protocols studied are classified into three classes: oblivious (the transmission schedule of a node is only a function of its ID), quasi-oblivious (the transmission schedule may also depend on a global time), and adaptive. The main contribution of this work concerns negative results. Contrasting the lower and upper bounds derived, interesting complexity gaps among protocol-classes are observed. These results show that the gap in time complexity between oblivious and quasi-oblivious (hence, adaptive) protocols is almost linear. This gap is what we call the profit of global synchrony since it represents the gain the network obtains from global synchrony with respect to not having it. We note that the global synchrony required by the efficient quasi-oblivious protocol proposed is simply achieved by piggybacking in the messages sent the time at the source node, as a global reference.", "paper_title": "Opportunistic information dissemination in mobile ad-hoc networks: the profit of global synchrony", "paper_id": "WOS:000306129800002"}