{"auto_keywords": [{"score": 0.027600167692703608, "phrase": "proposed_algorithm"}, {"score": 0.00481495049065317, "phrase": "bi-objective_flow-shop_scheduling_problems"}, {"score": 0.004642292792558686, "phrase": "five_bi-objective_permutation_flow_shop_scheduling_problems"}, {"score": 0.004256533389293113, "phrase": "completion_times"}, {"score": 0.003797318300913992, "phrase": "pareto"}, {"score": 0.0035294580355761506, "phrase": "multi-objective_optimization"}, {"score": 0.003371773890338284, "phrase": "hybrid_algorithm"}, {"score": 0.0032955848190195343, "phrase": "careful_experimental_analysis"}, {"score": 0.003265591844292821, "phrase": "crucial_algorithmic_components"}, {"score": 0.0029666322924554274, "phrase": "recent_review"}, {"score": 0.002926212333939311, "phrase": "bi-objective_permutation_flow-shop_scheduling_problem"}, {"score": 0.002682669289913153, "phrase": "experimental_comparison"}, {"score": 0.002203570941628287, "phrase": "bi-objective_permutation_flow-shop_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Flowshop", " Multi-objective", " Hybrid"], "paper_abstract": "This paper presents a new, carefully designed algorithm for five bi-objective permutation flow shop scheduling problems that arise from the pairwise combinations of the objectives (i) makespan, (ii) the sum of the completion times of the jobs, and (iii) both, the weighted and non-weighted total tardiness of all jobs. The proposed algorithm combines two search methods, two-phase local search and Pareto local search, which are representative of two different, but complementary, paradigms for multi-objective optimization in terms of Pareto-optimality. The design of the hybrid algorithm is based on a careful experimental analysis of crucial algorithmic components of these two search methods. We compared our algorithm to the two best algorithms identified, among a set of 23 candidate algorithms, in a recent review of the bi-objective permutation flow-shop scheduling problem. We have reimplemented carefully these two algorithms in order to assess the quality of our algorithm. The experimental comparison in this paper shows that the proposed algorithm obtains results that often dominate the output of the two best algorithms from the literature. Therefore, our analysis shows without ambiguity that the proposed algorithm is a new state-of-the-art algorithm for the bi-objective permutation flow-shop problems studied in this paper. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A hybrid TP plus PLS algorithm for bi-objective flow-shop scheduling problems", "paper_id": "WOS:000286959500013"}