{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gis"}, {"score": 0.0046797114400479135, "phrase": "landmark-based_pedestrian_navigation"}, {"score": 0.004265760046406154, "phrase": "geographical_information_science_and_transportation_communities"}, {"score": 0.004029359223675788, "phrase": "landmark-based_route_instructions"}, {"score": 0.003752126270661821, "phrase": "landmark-based_pedestrian_navigation_data_model"}, {"score": 0.003569451476205552, "phrase": "data_model"}, {"score": 0.002986461855862617, "phrase": "proposed_model"}, {"score": 0.002923214590192792, "phrase": "arcgis_software_environment"}, {"score": 0.0026452734009203764, "phrase": "bus_lines"}, {"score": 0.0025525322651112365, "phrase": "indoor_spaces"}, {"score": 0.0022933216359142736, "phrase": "proposed_data_model"}, {"score": 0.0022608057001451414, "phrase": "real-world_environments"}], "paper_keywords": ["pedestrian navigation system", " landmark-based data model", " geographical information system for transportation"], "paper_abstract": "Landmarks provide the most predominant navigation cue for pedestrian navigation. Very few navigation data models in the geographical information science and transportation communities support modeling of landmarks and use of landmark-based route instructions for pedestrian navigation services. This article proposes a landmark-based pedestrian navigation data model to fill this gap. This data model can model landmarks in several pedestrian navigation scenarios (buildings, open spaces, multimodal transportation systems, and urban streets). This article implements the proposed model in the ArcGIS software environment and demonstrates two typical pedestrian navigation scenarios: (1) a multimodal pedestrian navigation environment involving bus lines, parks, and indoor spaces and (2) a subway system in a metropolitan environment. These two scenarios illustrate the feasibility of the proposed data model in real-world environments. Further improvements of this model could lead to more intuitive and user-friendly landmark-based pedestrian navigation services than the functions supported by current map-based navigation systems.", "paper_title": "A GIS data model for landmark-based pedestrian navigation", "paper_id": "WOS:000303412500003"}