{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "employee_awareness"}, {"score": 0.004722255585529472, "phrase": "hais"}, {"score": 0.00443308765153716, "phrase": "organisation's_computer_systems"}, {"score": 0.004263972370406983, "phrase": "computer_users"}, {"score": 0.004161553532799662, "phrase": "human-based_information_security_vulnerabilities"}, {"score": 0.003757480190200645, "phrase": "first_aim"}, {"score": 0.0036671822784770463, "phrase": "conceptual_development"}, {"score": 0.0034760655218366, "phrase": "second_aim"}, {"score": 0.003107935254560724, "phrase": "work_computer"}, {"score": 0.0029031614127920232, "phrase": "stronger_influence"}, {"score": 0.0027922467043592597, "phrase": "self-reported_behaviour"}, {"score": 0.002297949552105756, "phrase": "future_research"}, {"score": 0.0021780349459687622, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Information security", " Security behaviours", " Questionnaire design", " Cyber security", " Hybrid research"], "paper_abstract": "It is increasingly acknowledged that many threats to an organisation's computer systems can be attributed to the behaviour of computer users. To quantify these human-based information security vulnerabilities, we are developing the Human Aspects of Information Security Questionnaire (HAIS-Q). The aim of this paper was twofold. The first aim was to outline the conceptual development of the HAIS-Q including validity and reliability testing. The second aim was to examine the relationship between knowledge of policy and procedures, attitude towards policy and procedures and behaviour when using a work computer. Results from 500 Australian employees indicate that knowledge of policy and procedures had a stronger influence on attitude towards policy and procedure than self-reported behaviour. This finding suggests that training and education will be more effective if it outlines not only what is expected (knowledge) but also provides an understanding of why this is important (attitude). Plans for future research to further develop and test the HAIS-Q are outlined. Crown Copyright (C) 2014 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Determining employee awareness using the Human Aspects of Information Security Questionnaire (HAIS-Q)", "paper_id": "WOS:000335201000013"}