{"auto_keywords": [{"score": 0.03913799101431996, "phrase": "coverage_metrics"}, {"score": 0.03878676535760204, "phrase": "model_checking"}, {"score": 0.026979771066199507, "phrase": "non-covered_parts"}, {"score": 0.02519314138380476, "phrase": "naive_algorithm"}, {"score": 0.00481495049065317, "phrase": "temporal_logic_model_checking"}, {"score": 0.004747997855358171, "phrase": "formal_verification"}, {"score": 0.00329813918116714, "phrase": "verification_process"}, {"score": 0.0024336086025284836, "phrase": "first_algorithm"}, {"score": 0.0023996890513009743, "phrase": "symbolic_implementation"}, {"score": 0.002289993730291136, "phrase": "original_system"}, {"score": 0.0022580713471027996, "phrase": "second_algorithm"}], "paper_keywords": ["formal verification", " model checking", " coverage metrics", " algorithms"], "paper_abstract": "In formal verification, we verify that a system is correct with respect to a specification. Even when the system is proved to be correct, there is still a question of how complete the specification is, and whether it really covers all the behaviors of the system. In this paper we study coverage metrics for model checking. Coverage metrics are based on modifications we apply to the system in order to check which parts of it were actually relevant for the verification process to succeed. We introduce two principles that we believe should be part of any coverage metric for model checking: a distinction between state-based and logic-based coverage, and a distinction between the system and its environment. We suggest several coverage metrics that apply these principles, and we describe two algorithms for finding the non-covered parts of the system under these definitions. The first algorithm is a symbolic implementation of a naive algorithm that model checks many variants of the original system. The second algorithm improves the naive algorithm by exploiting overlaps in the variants. We also suggest a few helpful outputs to the user, once the non-covered parts are found.", "paper_title": "Coverage metrics for temporal logic model checking", "paper_id": "WOS:000238518200001"}