{"auto_keywords": [{"score": 0.03493537299198431, "phrase": "design_solution"}, {"score": 0.015719716506582538, "phrase": "product_solution_generation"}, {"score": 0.015242307979733463, "phrase": "similarity_theory"}, {"score": 0.007207796615654778, "phrase": "proposed_approach"}, {"score": 0.004317109072311102, "phrase": "conceptual_design_activities"}, {"score": 0.003993216345115755, "phrase": "functional_basis"}, {"score": 0.003911010373894104, "phrase": "chief_sub-function_chain"}, {"score": 0.0038106195546165574, "phrase": "constructed_functional_model"}, {"score": 0.0037516215763875225, "phrase": "design_repository"}, {"score": 0.0035614563596982306, "phrase": "artificial_components"}, {"score": 0.0031597433845085092, "phrase": "generalised_distance"}, {"score": 0.0030625949549620475, "phrase": "evaluation_criteria"}, {"score": 0.0026471739851621143, "phrase": "evaluation_score"}, {"score": 0.002512864718402267, "phrase": "aco"}, {"score": 0.0024103044278902916, "phrase": "appropriate_design_solutions"}], "paper_keywords": ["conceptual design", " functional basis", " similarity theory", " generalised distance", " Ant Colony Optimisation"], "paper_abstract": "An approach to product solution generation is proposed to analyse the conceptual design activities in this paper. In this approach, the sub-functions are defined with the functional basis, and the chief sub-function chain is generated from the constructed functional model. A design repository is developed to store the relationships of sub-functions and artificial components. The similarity theory is used to analyse the compatibility of two adjacent components in a design solution, and the compatibility is described by the generalised distance (GD). The evaluation criteria and weightings of sub-functions are provided and used to select components for a design solution. Under the premise of regarding GD as the path and taking the evaluation score of a component as the pheromone, the Ant Colony Optimisation (ACO) is used to automatically identify the appropriate design solutions. The requirements of sub-functions and the compatibility of two adjacent components are considered in a design solution by the proposed approach. Finally, a case of the 3-Axis Servo Transfer System is introduced to illustrate the application of the proposed approach.", "paper_title": "An approach to product solution generation and evaluation based on the similarity theory and Ant Colony Optimisation", "paper_id": "WOS:000341925100002"}