{"auto_keywords": [{"score": 0.04930226826100364, "phrase": "gene_repetitions"}, {"score": 0.0283446378522564, "phrase": "ean"}, {"score": 0.00481495049065317, "phrase": "exemplar_adjacency_number_problem"}, {"score": 0.004364696693320128, "phrase": "well-studied_breakpoint_distance"}, {"score": 0.003751331782523201, "phrase": "gene_families"}, {"score": 0.0036304470230058413, "phrase": "corresponding_exemplar_adjacency_number_problem"}, {"score": 0.0034990853199511982, "phrase": "duplicated_genes"}, {"score": 0.003386301445203071, "phrase": "resultant_exemplar"}, {"score": 0.003250403288147613, "phrase": "maximum_adjacency_number"}, {"score": 0.002480154140902474, "phrase": "hardness_result"}, {"score": 0.0023903140267755576, "phrase": "optimal_solution_value"}, {"score": 0.002157433262687853, "phrase": "constant_factor"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Genome comparison", " Adjacency", " Breakpoint", " NP-hard", " Approximation algorithm"], "paper_abstract": "In this paper, we apply a measure, exemplar adjacency number, which complements and extends the well-studied breakpoint distance between two permutations, to measure the similarity between two genomes (or in general, between any two sequences drawn from the same alphabet). For two genomes G and H drawn from the same set of n gene families and containing gene repetitions, we consider the corresponding Exemplar Adjacency Number problem (EAN), in which we delete duplicated genes from G and H such that the resultant exemplar genomes (permutations) G and H have the maximum adjacency number. We obtain the following results. First, we prove that the one-sided 2-repetitive EAN problem, i.e., when one of G and H is given exemplar and each gene occurs in the other genome at most twice, can be linearly reduced from the Maximum Independent Set problem. This implies that EAN does not admit any O (n(0.5-epsilon))-approximation algorithm, for any epsilon > 0, unless P = NP. This hardness result also implies that EAN, parameterized by the optimal solution value, is W[1]-hard. Secondly, we show that the two-sided 2-repetitive EAN problem has an O (n(0.5))-approximation algorithm, which is tight up to a constant factor. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On the approximability of the exemplar adjacency number problem for genomes with gene repetitions", "paper_id": "WOS:000341551600005"}