{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "compilation_server"}, {"score": 0.0072600252695049355, "phrase": "compilation_overhead"}, {"score": 0.0047709540557306284, "phrase": "modern_jvm_implementations"}, {"score": 0.004641351004344458, "phrase": "''_hot_''_methods"}, {"score": 0.004577869668211548, "phrase": "reasonable_performance"}, {"score": 0.004453488286477661, "phrase": "execution_time"}, {"score": 0.004332471656145115, "phrase": "run-time_pauses"}, {"score": 0.004253618550301311, "phrase": "offloading_compilation"}, {"score": 0.0037921662574137535, "phrase": "java_bytecodes"}, {"score": 0.0031121406603482112, "phrase": "optimizing_compilation"}, {"score": 0.003027462227648001, "phrase": "optimizing_compiler"}, {"score": 0.0028914057633212045, "phrase": "profile_information"}, {"score": 0.00286493504971388, "phrase": "different_runs"}, {"score": 0.0027741761880779535, "phrase": "different_applications"}, {"score": 0.002686284749214443, "phrase": "jikes_rvm"}, {"score": 0.002276283303864666, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "best_performing_adaptive_configuration"}], "paper_keywords": ["design", " experimentation", " performance", " measurement", " languages", " compilation server", " Java virtual machine"], "paper_abstract": "Modern JVM implementations interleave execution with compilation of '' hot '' methods to achieve reasonable performance. Since compilation overhead impacts the execution time of the application and induces run-time pauses, we explore offloading compilation onto a compilation server. In this article, we present the design, implementation, and evaluation of a compilation server that compiles and optimizes Java bytecodes on behalf of its clients. We show that the compilation server provides the following-benefits for our benchmark programs: (i) lower execution time by reducing the compilation overhead and by enabling more aggressive optimizations; (ii) lower memory allocation by eliminating allocations due to optimizing compilation and the footprint of the optimizing compiler; (iii) lower execution time of the application due to sharing of profile information across different runs of the same application and runs of different applications. We implemented the compilation server in Jikes RVM, and our results indicate that it can reduce running time by an average of 20.5%, interruptions due to compilation by an average of 81.0%, and dynamic memory allocation by 8.6% for our benchmark programs. Simulation results indicate that our current implementation of the compilation server can handle more than 50 concurrent clients while still allowing them to outperform the best performing adaptive configuration.", "paper_title": "Design, implementation, and evaluation of a compilation server", "paper_id": "WOS:000248913500001"}