{"auto_keywords": [{"score": 0.03865793421435101, "phrase": "academic_self-efficacy"}, {"score": 0.00481495049065317, "phrase": "college_students"}, {"score": 0.0043496334756644535, "phrase": "present_study"}, {"score": 0.004254558771304349, "phrase": "college_students'_help"}, {"score": 0.004161553532799662, "phrase": "different_instructional_learning_environments"}, {"score": 0.0039815737219022675, "phrase": "traditional_classes"}, {"score": 0.003775803846431323, "phrase": "personal_threat"}, {"score": 0.0034868462688262864, "phrase": "online_computer_component"}, {"score": 0.003107935254560724, "phrase": "traditional_learning_environments"}, {"score": 0.003013129637451091, "phrase": "student_achievement"}, {"score": 0.002934166052954463, "phrase": "formal_help"}, {"score": 0.0028572658971252616, "phrase": "perceived_threat"}, {"score": 0.0026267609106294817, "phrase": "electronic_means"}, {"score": 0.0023935128386292966, "phrase": "educational_implications"}, {"score": 0.0022999859758286423, "phrase": "technological_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["help-seeking", " learning environments", " perceived threat", " technology"], "paper_abstract": "The purpose of the present study was to examine how college students' help seeking behavior varied across different instructional learning environments. Four hundred and seventy four (N = 472) students enrolled in distance, distributed, and traditional classes were queried about their help seeking preferences, help seeking tendencies, personal threat in seeking help, and academic self-efficacy. It was hypothesized that students enrolled in courses with an online computer component would report (a) higher instances of help seeking behavior, particularly from instructors; and (b) feel less threatened to seek help than students in traditional learning environments. It was also expected that student achievement would be significantly correlated with formal help seeking, academic self-efficacy, and perceived threat to seek help. Lastly, it was postulated that students would report that they prefer to use electronic means to seek help and that they find it more effective. Overall the hypotheses of this study were supported. Educational implications and recommendations are provided regarding the type of technological tools that college instructors might consider using in their courses to promote help seeking. (C) 2005 Published by Elsevier Ltd.", "paper_title": "College students' perceived threat and preference for seeking help in traditional, distributed, and distance learning environments", "paper_id": "WOS:000243813600003"}