{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "centralized_optical_source"}, {"score": 0.0045959609346817535, "phrase": "frequency_quadrupling"}, {"score": 0.00451642066363115, "phrase": "full-duplex_radio"}, {"score": 0.004464156619275582, "phrase": "fiber_link_scheme"}, {"score": 0.003705323407433896, "phrase": "mach-zehnder_modulator"}, {"score": 0.0031660031870090434, "phrase": "central_station"}, {"score": 0.003093054709625219, "phrase": "remote_base_station"}, {"score": 0.002952146666681891, "phrase": "high-speed_photodiode"}, {"score": 0.0022974765563692776, "phrase": "fiber_dispersion"}, {"score": 0.0022576249214220187, "phrase": "simulation_results"}, {"score": 0.002205560249972527, "phrase": "bidirectional_signals"}, {"score": 0.0021799789348982534, "phrase": "good_performance"}], "paper_keywords": ["Frequency quadrupling", " Full-duplex link", " 16-QAM", " RoF (radio over fiber)"], "paper_abstract": "A full-duplex radio over fiber link scheme with 16 quadrature amplitude modulation (16-QAM) 10 Gb/s downstream and 2.5 Gb/s upstream signals is proposed. In the downlink, the 60 GHz dual-tone optical millimeter-(mm-) wave signal carrier is generated by the 15 GHz local oscillator via a Mach-Zehnder modulator with frequency quadrupling. The 16-QAM 5 GHz IF signal is up-converted to 65 GHz by modulating it on one of the two tones with single-sideband (SSB) modulation at the central station. At the remote base station, the 65 GHz SSB optical mm-wave signal is detected by a high-speed photodiode. After the 60 GHz uplink dual-tone optical mm-wave carrier is abstracted by optimized filtering, the uplink 63 GHz mm-wave signal is modulated onto it to down-convert to the 3 GHz SSB optical IF signal. Since both the down-and uplink optical mm-wave signals have SSB spectra with the signal modulated on one of the two tones, they suffer little from the fiber dispersion. The simulation results show that the bidirectional signals have good performance even after being transmitted over 30 km standard single mode fiber.", "paper_title": "Full-Duplex Radio Over Fiber With a Centralized Optical Source for a 60 GHz Millimeter-Wave System With a 10 Gb/s 16-QAM Downstream Signal Based on Frequency Quadrupling", "paper_id": "WOS:000306276400003"}