{"auto_keywords": [{"score": 0.042853721401814884, "phrase": "silhouette_coherence"}, {"score": 0.008713768692145006, "phrase": "camera_calibration"}, {"score": 0.005645459426407293, "phrase": "epipolar_tangency_points"}, {"score": 0.004772818068176176, "phrase": "circular_motion"}, {"score": 0.004669085371587273, "phrase": "new_approach"}, {"score": 0.004507760907425495, "phrase": "complete_and_practical_system"}, {"score": 0.004448705308279165, "phrase": "digital_copies"}, {"score": 0.004371160978838441, "phrase": "uncalibrated_image_sequences"}, {"score": 0.00431388720289049, "phrase": "turntable_motion"}, {"score": 0.0036179751816682454, "phrase": "focal_length"}, {"score": 0.003447035529485425, "phrase": "well-known_epipolar_tangency_constraint"}, {"score": 0.002994178996584381, "phrase": "point_correspondences"}, {"score": 0.002967931416941965, "phrase": "outer_epipolar_tangents"}, {"score": 0.0027660443371695024, "phrase": "camera_motion"}, {"score": 0.002646880721119838, "phrase": "uncalibrated_circular_motion_sequences"}, {"score": 0.0024130437638400404, "phrase": "practical_system"}, {"score": 0.0023192471808039746, "phrase": "high_quality_photo-realistic_models"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_system"}], "paper_keywords": ["silhouette coherence", " epipolar tangency", " image", " based visual hull", " focal length estimation", " circular motion", " 3D modeling"], "paper_abstract": "We present a new approach to camera calibration as a part of a complete and practical system to recover digital copies of sculpture from uncalibrated image sequences taken under turntable motion. In this paper, we introduce the concept of the silhouette coherence of a set of silhouettes generated by a 3D object. We show how the maximization of the silhouette coherence can be exploited to recover the camera poses and focal length. Silhouette coherence can be considered as a generalization of the well-known epipolar tangency constraint for calculating motion from silhouettes or outlines alone. Further, silhouette coherence exploits all the geometric information encoded in the silhouette ( not just at epipolar tangency points) and can be used in many practical situations where point correspondences or outer epipolar tangents are unavailable. We present an algorithm for exploiting silhouette coherence to efficiently and reliably estimate camera motion. We use this algorithm to reconstruct very high quality 3D models from uncalibrated circular motion sequences, even when epipolar tangency points are not available or the silhouettes are truncated. The algorithm has been integrated into a practical system and has been tested on more than 50 uncalibrated sequences to produce high quality photo-realistic models. Three illustrative examples are included in this paper. The algorithm is also evaluated quantitatively by comparing it to a state-of-the-art system that exploits only epipolar tangents.", "paper_title": "Silhouette coherence for camera calibration under circular motion", "paper_id": "WOS:000242826900013"}