{"auto_keywords": [{"score": 0.03837844894235963, "phrase": "unconditionally_secure_authentication"}, {"score": 0.0376640559961442, "phrase": "key_material"}, {"score": 0.015346376298980214, "phrase": "secure_channels"}, {"score": 0.01095191001219428, "phrase": "special_structure"}, {"score": 0.00481495049065317, "phrase": "almost_free_authentication"}, {"score": 0.004520132822496416, "phrase": "confidential_and_authenticated_manner"}, {"score": 0.004202223763361474, "phrase": "secure_communication"}, {"score": 0.003614044704141927, "phrase": "half_the_amount"}, {"score": 0.003527181559366122, "phrase": "traditional_unconditionally_secure_message_authentication_codes"}, {"score": 0.0034423989472667756, "phrase": "key_reduction"}, {"score": 0.003294875957676514, "phrase": "authenticated_encryption_system"}, {"score": 0.0026986685585382347, "phrase": "perfectly_secret_one-time_pad_cipher"}, {"score": 0.002570385604065795, "phrase": "almost_free_key_material"}, {"score": 0.002424450174817922, "phrase": "arbitrarily_long_messages"}, {"score": 0.002264607102799332, "phrase": "authenticated_encryption_systems"}, {"score": 0.002199363362666037, "phrase": "provably_secure_authentication"}, {"score": 0.0021049977753042253, "phrase": "short_messages"}], "paper_keywords": ["Unconditional security", " authentication", " encryption"], "paper_abstract": "In cryptology, secure channels enable the exchange of messages in a confidential and authenticated manner. The literature of cryptology is rich with proposals and analysis that address the secure communication over public (insecure) channels. In this work, we propose an information theoretically secure direction for the construction of secure channels. First, we propose a method of achieving unconditionally secure authentication with half the amount of key material required by traditional unconditionally secure message authentication codes (MACs). Key reduction is achieved by utilizing the special structure of the authenticated encryption system. That is, authentication exploits the secrecy of the message to reduce the key material required for authentication. After the description of our method, since key material is the most important concern in unconditionally secure authentication, given the message is encrypted with a perfectly secret one-time pad cipher, we extend our method to achieve unconditionally secure authentication with almost free key material. That is, we propose a method for unconditionally authenticating arbitrarily long messages with much shorter keys. Finally, we will show how the special structure of the authenticated encryption systems can be exploited to achieve provably secure authentication that is very efficient for the authentication of short messages.", "paper_title": "Information Theoretically Secure Encryption with Almost Free Authentication", "paper_id": "WOS:000273178100003"}