{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_articles"}, {"score": 0.048000287634733727, "phrase": "citation_locations"}, {"score": 0.027470763986444366, "phrase": "first_section"}, {"score": 0.004309434349688514, "phrase": "citation_instances"}, {"score": 0.004031865694174726, "phrase": "citation_distributions"}, {"score": 0.00396530196547293, "phrase": "full_text"}, {"score": 0.0033945024593626675, "phrase": "commonly_seen_four-section_structure"}, {"score": 0.0029709144755382787, "phrase": "groundbreaking_h-index_paper"}, {"score": 0.002938121560821831, "phrase": "hirsch"}, {"score": 0.0023136311468961125, "phrase": "subsequent_sections"}, {"score": 0.0022253345930383257, "phrase": "highly_cited_papers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distribution of citations", " Citation location", " Structure of scientific articles", " Full text analysis"], "paper_abstract": "We address issues concerning what one may learn from how citation instances are distributed in scientific articles. We visualize and analyze patterns of citation distributions in the full text of 350 articles published in the Journal of Informetrics. In particular, we visualize and analyze the distributions of citations in articles that are organized in a commonly seen four-section structure, namely, introduction, method, results, and conclusions (IMRC). We examine the locations of citations to the groundbreaking h-index paper by Hirsch in 2005 and how patterns associated with citation locations evolve over time. The results show that citations are highly concentrated in the first section of an article. The density of citations in the first section is about three times higher than that in subsequent sections. The distributions of citations to highly cited papers are even more uneven. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Where are citations located in the body of scientific articles? A study of the distributions of citation locations", "paper_id": "WOS:000327920400013"}