{"auto_keywords": [{"score": 0.0459562991378972, "phrase": "poverty_reduction"}, {"score": 0.02775041288173949, "phrase": "ict_intervention"}, {"score": 0.01499221520704078, "phrase": "developing_countries"}, {"score": 0.011207791256079251, "phrase": "social_capital_and_knowledge_management_theories"}, {"score": 0.00481495049065317, "phrase": "communication_technology"}, {"score": 0.004757681930762596, "phrase": "ict"}, {"score": 0.0037664981403399064, "phrase": "information_technology"}, {"score": 0.003677280504320636, "phrase": "purposeful_action"}, {"score": 0.0031845067058084583, "phrase": "information_systems"}, {"score": 0.003053598205821532, "phrase": "sensitising_device"}, {"score": 0.002910545717767559, "phrase": "social_capital_and_knowledge_theories"}, {"score": 0.0026600905156986317, "phrase": "ict_development"}, {"score": 0.0023311233166534214, "phrase": "final_and_most_contested_stage"}], "paper_keywords": ["poverty reduction", " knowledge management", " social capital", " developing countries", " social equity", " growth and development"], "paper_abstract": "The efficacy of information and communication technology (ICT) projects and initiatives in developing countries, and how they may assist poverty reduction or otherwise improve the quality of life for communities in those countries, is still a topic of debate. Knowledge empowers people, while information technology integrates such knowledge for purposeful action and reaction. This paper describes a framework, based on social capital and knowledge management theories, which aims to further that debate in the field of information systems. The framework is primarily a sensitising device, designed to assist thinking about how social capital and knowledge theories facilitate ICT interventions for poverty reduction. The framework has four stages, the process of ICT development, the ICT intervention, the evaluation of the impact of the ICT intervention and the process of poverty reduction, which is the final and most contested stage of an ICT intervention. Each stage of the framework is discussed, using illustrations from various development projects. Finally, the paper draws some conclusions about the contribution of social capital and knowledge management theories to the issue of ICT intervention and evaluation in developing countries.", "paper_title": "ICTs and poverty reduction: a social capital and knowledge perspective", "paper_id": "WOS:000258903100006"}