{"auto_keywords": [{"score": 0.03898048818064748, "phrase": "multi-touch_applications"}, {"score": 0.015719716506582538, "phrase": "real-time_multi-touch_applications"}, {"score": 0.013232489800110598, "phrase": "multi-touch_software_development"}, {"score": 0.012839033765130303, "phrase": "software_developers"}, {"score": 0.0047732596509542135, "phrase": "multi-touch_driven_user_interfaces"}, {"score": 0.0044718206943536514, "phrase": "associated_hardware_costs"}, {"score": 0.004318881178805575, "phrase": "multi-touch_software_frameworks"}, {"score": 0.004081385289516914, "phrase": "low_level_issues"}, {"score": 0.0035662378173267647, "phrase": "real-time_system_requirements"}, {"score": 0.002931569771634119, "phrase": "real-time_systems"}, {"score": 0.002831158147480665, "phrase": "ad_hoc_manner"}, {"score": 0.0027943943921568456, "phrase": "primary_consequence"}, {"score": 0.002516917671182532, "phrase": "real-time_system_concepts"}, {"score": 0.0021987994275190314, "phrase": "development_and_deployment_process"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["real-time systems", " multi-touch", " RTSJ", " MSF", " software development"], "paper_abstract": "Multi-touch driven user interfaces are becoming increasingly prevalent because of their intuitiveness and because of the reduction in the associated hardware costs. In recognition of this trend, multi-touch software frameworks (MSFs) have begun to emerge. These frameworks abstract the low level issues of multi-touch software development and deployment. MSFs therefore enable software developers who are unfamiliar with the complexities of multi-touch software development to implement and deploy multi-touch applications more easily. However, some multi-touch applications have real-time system requirements, and at present, no MSFs provide support for the development and deployment of such real-time multi-touch applications. The implication of this is that software developers are unable to take advantage of MSFs and, therefore, are forced to handle the complexities of multi-touch and real-time systems development and deployment for themselves in an ad hoc manner. The primary consequence of this is that the multi-touch and/or real-time aspects of the application may not function correctly. In this paper, guidelines are presented for applying real-time system concepts to support the development and deployment of real-time multi-touch applications using MSFs. This serves to increase the probability that the application will meet its timing requirements while also reducing the complexity of the development and deployment process associated with multi-touch applications. Copyright (C) 2013 John Wiley & Sons, Ltd.", "paper_title": "Guidelines for supporting real-time multi-touch applications", "paper_id": "WOS:000339479400004"}