{"auto_keywords": [{"score": 0.03679418729719719, "phrase": "registry_interfaces"}, {"score": 0.00466877910546307, "phrase": "distributed_directory"}, {"score": 0.004611554879923759, "phrase": "information_systems"}, {"score": 0.0034083145672246067, "phrase": "brief_outline"}, {"score": 0.003284361433827464, "phrase": "standards_development"}, {"score": 0.0030876784650745973, "phrase": "popular_clients"}, {"score": 0.0030123335878664064, "phrase": "dedicated_ins"}, {"score": 0.002831894638104635, "phrase": "thorough_discussion"}, {"score": 0.0025972447844047515, "phrase": "full-text-based_interface"}, {"score": 0.0022531089868518235, "phrase": "registry_records"}, {"score": 0.002225426912273257, "phrase": "registry_users"}, {"score": 0.0021710766932077972, "phrase": "remaining_challenges"}, {"score": 0.002144400314994328, "phrase": "current_developments"}], "paper_keywords": ["Virtual Observatory", " Registry", " Standards"], "paper_abstract": "The Virtual Observatory Registry is a distributed directory of information systems and other resources relevant to astronomy. To make it useful, facilities to query that directory must be provided to humans and machines alike. This article reviews the development and status of such facilities, also considering the lessons learnt from about a decade of experience with Registry interfaces. After a brief outline of the history of the standards development, it describes the use of Registry interfaces in some popular clients as well as dedicated ins for interrogating the Registry. It continues with a thorough discussion of the design of the two most recent Registry interface standards, RegTAP on the one hand and a full-text-based interface on the other hand. The article finally lays out some of the less obvious conventions that emerged in the interaction between providers of registry records and Registry users as well as remaining challenges and current developments. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Client interfaces to the Virtual Observatory Registry", "paper_id": "WOS:000354902700009"}