{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "informative_graph"}, {"score": 0.04440400068297851, "phrase": "new_method"}, {"score": 0.004722791767189843, "phrase": "contextual_information"}, {"score": 0.004654826737377134, "phrase": "data_manifold"}, {"score": 0.004587835274176236, "phrase": "traditional_graph_construction_methods"}, {"score": 0.004046020290832207, "phrase": "graph_construction"}, {"score": 0.0037811784409635023, "phrase": "strong_sparsity_property"}, {"score": 0.0034491650585057754, "phrase": "auto-grouped_sparse_regularization"}, {"score": 0.00328625950643742, "phrase": "group_sparse_graph"}, {"score": 0.0030121159909273897, "phrase": "kernel_hilbert_space"}, {"score": 0.002968695624366393, "phrase": "kernel_trick"}, {"score": 0.002925899335792914, "phrase": "new_methods"}, {"score": 0.0023990982005125763, "phrase": "proposed_graph"}, {"score": 0.0022202042044679984, "phrase": "empirical_studies"}, {"score": 0.0021566056345478373, "phrase": "proposed_methods"}], "paper_keywords": ["Graph based learning", " sparse representation", " spectral embedding", " subspace learning", " non-negative matrix factorization"], "paper_abstract": "The key task in developing graph-based learning algorithms is constructing an informative graph to express the contextual information of a data manifold. Since traditional graph construction methods are sensitive to noise and less datum-adaptive to changes in density, a new method called '(1)-graph was proposed recently. A graph construction needs to have two important properties: sparsity and locality. The l(1)-graph has a strong sparsity property, but a weak locality property. Thus, we propose a new method of constructing an informative graph using auto-grouped sparse regularization based on the l(1)-graph, which is called as Group Sparse graph (GS-graph). We also show how to efficiently construct a GS-graph in reproducing kernel Hilbert space with the kernel trick. The new methods, the GS-graph and its kernelized version (KGS-graph), have the same noise-insensitive property as that of l(1)-graph and also can successively preserve the properties of sparsity and locality simultaneously. Furthermore, we integrate the proposed graph with several graph-based learning algorithms to demonstrate the effectiveness of our method. The empirical studies on benchmarks show that the proposed methods outperform the l(1)-graph and other traditional graph construction methods in various learning tasks.", "paper_title": "Graph-Based Learning via Auto-Grouped Sparse Regularization and Kernelized Extension", "paper_id": "WOS:000346167800012"}