{"auto_keywords": [{"score": 0.043025239716159284, "phrase": "common_understanding"}, {"score": 0.04056663116006706, "phrase": "knowledge_structure"}, {"score": 0.03891775865105571, "phrase": "concept_similarity_measure"}, {"score": 0.015719716506582538, "phrase": "concept_similarity"}, {"score": 0.011664399037613222, "phrase": "multiple_knowledge_structures"}, {"score": 0.009699096998120837, "phrase": "proposed_measure"}, {"score": 0.007185619096177336, "phrase": "future_research"}, {"score": 0.00477155403544413, "phrase": "multidisciplinary_learning"}, {"score": 0.004550029253278477, "phrase": "aec_education"}, {"score": 0.004519229929149363, "phrase": "multidisciplinary_collaboration_skills"}, {"score": 0.004398094237005956, "phrase": "information_and_communication_technologies"}, {"score": 0.004289895407152864, "phrase": "distance_learning"}, {"score": 0.004212873921676287, "phrase": "computer-mediated_learning_environment"}, {"score": 0.004156012879026324, "phrase": "computer_systems"}, {"score": 0.003954016305256269, "phrase": "ict"}, {"score": 0.0038045970814886304, "phrase": "better_mediation"}, {"score": 0.0036608332080581884, "phrase": "graph-based_similarity_analyses"}, {"score": 0.0034357505335902696, "phrase": "feature-based_method"}, {"score": 0.003137922568959775, "phrase": "key_component"}, {"score": 0.0028854014057868916, "phrase": "dice_coefficient"}, {"score": 0.002795228413298423, "phrase": "generic_case"}, {"score": 0.002707865805087779, "phrase": "\"photovoltaic_system"}, {"score": 0.0026113524778702602, "phrase": "calculation_results"}, {"score": 0.0025819015229390663, "phrase": "human_judgment"}, {"score": 0.002489866586003267, "phrase": "case_study"}, {"score": 0.0024617823728446237, "phrase": "initial_evaluations"}, {"score": 0.0024065584090318315, "phrase": "promising_features"}, {"score": 0.002305014991156598, "phrase": "knowledge_structures"}, {"score": 0.002253299769886694, "phrase": "uncertain_situations"}, {"score": 0.0022329393005738147, "phrase": "ambiguous_human_perception"}, {"score": 0.0021977491933672572, "phrase": "multiple_concepts"}], "paper_keywords": ["Concept similarity", " Concept map", " Multidisciplinary learning", " Knowledge structure", " Common understanding"], "paper_abstract": "The success of an architecture, engineering, and construction (AEC) project largely depends on the effective collaboration of project participants. This characteristic of the industry requires that AEC education shall foster multidisciplinary collaboration skills of students. On the other hand, many AEC education programs have started using information and communication technologies (ICTs) to facilitate teaching and learning such as distance learning. One of the challenges in a computer-mediated learning environment arises from the need for computer systems to determine whether a common understanding regarding a certain subject is established among a group of students. To achieve this goal, ICT needs to be able to detect changes in the knowledge structure of students in order to provide better mediation. This paper presents a study on the development of a concept similarity measure that has less computational complexity than graph-based similarity analyses. The similarity measure is intended to determine the similarity of multiple knowledge structures [e.g., concept maps (CMAPs)] of students. The concept similarity measure is developed based on the feature-based method in which propositions associated with a concept are considered as features of the concept. Therefore, the similarity of concepts can be measured by comparing the propositions of the concepts. In addition, since concepts are the key component of a knowledge structure, the common understanding of students can be determined by measuring the similarity of concepts in the knowledge structure of the students. The proposed measure is evaluated by (1) comparing it with the Dice coefficient for analyzing two sets of concepts; (2) analyzing its performance in a generic case of four CMAPs; and (3) applying it to a case using \"photovoltaic system\" as an example. In this case, results are intuitively obvious so that calculation results can be corroborated by human judgment. Finally, the concept similarity measure is applied to derive the similarity of CMAPs in the case study. Based on the initial evaluations, this study shows that the proposed measure has demonstrated promising features for determining the similarity of multiple knowledge structures or the common understanding of students. However, when the number of knowledge structures increases, concept similarity analyses become more complicated because uncertain situations arise due to ambiguous human perception to propositions that are shared by multiple concepts. Future research is thus needed to understand and clearly define concept similarity in those situations. In addition, other studies are also identified for future research.", "paper_title": "Applying Concept Similarity to the Evaluation of Common Understanding in Multidisciplinary Learning", "paper_id": "WOS:000278909500002"}