{"auto_keywords": [{"score": 0.04355159126538614, "phrase": "software_vulnerabilities"}, {"score": 0.03892276291099736, "phrase": "correlated_failure"}, {"score": 0.026671520237094026, "phrase": "diversification_strategy"}, {"score": 0.015469842941326485, "phrase": "information_networks"}, {"score": 0.01276001261382676, "phrase": "multiple_nodes"}, {"score": 0.00481495049065317, "phrase": "information_security_risk_management."}, {"score": 0.00470697922443172, "phrase": "business_operations"}, {"score": 0.004661446705304497, "phrase": "managerial_attention"}, {"score": 0.004243289764306128, "phrase": "information_network"}, {"score": 0.0037513920123532097, "phrase": "shared_vulnerabilities"}, {"score": 0.003643470150731877, "phrase": "longer_repair_times"}, {"score": 0.003619910789366738, "phrase": "greater_loss"}, {"score": 0.003527181559366122, "phrase": "positive_network_effects"}, {"score": 0.003359647377874098, "phrase": "resulting_downtime"}, {"score": 0.00327356326590461, "phrase": "homogeneous_software_deployment"}, {"score": 0.003158776195052182, "phrase": "queuing_model"}, {"score": 0.003097865379563127, "phrase": "downtime_loss"}, {"score": 0.002969879184298794, "phrase": "security_technologies"}, {"score": 0.0025829353063908256, "phrase": "failure_distribution"}, {"score": 0.0025578967205807843, "phrase": "node_correlation_distribution"}, {"score": 0.0024048460326284416, "phrase": "security_loss"}, {"score": 0.0022904980438110613, "phrase": "different_operating_conditions"}], "paper_keywords": ["Security", " diversification", " downtime loss", " software allocation", " network effects", " risk management", " correlated failures"], "paper_abstract": "The increasing dependence on information networks for business operations has focused managerial attention on managing risks posed by failure of these networks. In this paper, we develop models to assess the risk of failure on the availability of an information network due to attacks that exploit software vulnerabilities. Software vulnerabilities arise from software installed on the nodes of the network. When the same software stack is installed on multiple nodes on the network, software vulnerabilities are shared among them. These shared vulnerabilities can result in correlated failure of multiple nodes resulting in longer repair times and greater loss of availability of the network. Considering positive network effects (e.g., compatibility) alone without taking the risks of correlated failure and the resulting downtime into account would lead to over-investment in homogeneous software deployment. Exploiting characteristics unique to information networks, we present a queuing model that allows us to quantify downtime loss faced by arm as a function of (1) investment in security technologies to avert attacks, (2) software diversification to limit the risk of correlated failure under attacks, and (3) investment in IT resources to repair failures due to attacks. The novelty of this method is that we endogenize the failure distribution and the node correlation distribution, and show how the diversification strategy and other security measures/investments may impact these two distributions, which in turn determine the security loss faced by the firm. We analyze and discuss the effectiveness of diversification strategy under different operating conditions and in the presence of changing vulnerabilities. We also take into account the benefits and costs of a diversification strategy. Our analysis provides conditions under which diversification strategy is advantageous.", "paper_title": "CORRELATED FAILURES, DIVERSIFICATION, AND INFORMATION SECURITY RISK MANAGEMENT", "paper_id": "WOS:000290842900008"}