{"auto_keywords": [{"score": 0.04820728523974444, "phrase": "service_composition"}, {"score": 0.009779910116571148, "phrase": "combinable_strength"}, {"score": 0.007152368807539886, "phrase": "combinable_relationship-based_composition_service_network"}, {"score": 0.0058056645109100255, "phrase": "corcs-net"}, {"score": 0.005016747067496533, "phrase": "scale-free_network"}, {"score": 0.004200470319334481, "phrase": "invoking_times"}, {"score": 0.003987755561492638, "phrase": "combinable_relationship"}, {"score": 0.003958937342925219, "phrase": "composite_services"}, {"score": 0.00393032656248792, "phrase": "composition_service_network"}, {"score": 0.003681923235979914, "phrase": "modelling_corcs-net"}, {"score": 0.0036157418067192136, "phrase": "nine_combinable_relationships"}, {"score": 0.003486913922294352, "phrase": "corcs-net_dynamic_evolution"}, {"score": 0.0033504820756727507, "phrase": "sfn"}, {"score": 0.003037736332283186, "phrase": "theoretical_hypothesis"}, {"score": 0.00269475174341129, "phrase": "real_time_variation"}, {"score": 0.002646267286675984, "phrase": "arbitrary_service"}, {"score": 0.0025704954243348276, "phrase": "corresponding_real_time_combinable_strength"}, {"score": 0.0024342079318127423, "phrase": "'like_many_nature_and_social_phenomenon"}, {"score": 0.0022472527731744974, "phrase": "\"silent_services"}, {"score": 0.002151388538895855, "phrase": "majority_services"}], "paper_keywords": ["service composition", " combinable relationship", " combinable strength", " service composition network", " combinable relationship-based composition service network (CoRCS-Net)", " scale-free network (SFN)"], "paper_abstract": "Existing works on service composition are primarily based on the requirements of service composition, such as describing language supporting service composition, service composition framework, mechanism and method for service composition, and service composition validation. Few works have been carried out from the perspective of combinable relationship among composite services and composition service network. This article emphasises on combinable relationship-based composition service network, i.e. CoRCS-Net. The principles for establishing and modelling CoRCS-Net were studied, and nine combinable relationships among services in CoRCS-Net were investigated and 14 elementary evolving operators for CoRCS-Net dynamic evolution were designed. According to the definition of scale-free network (SFN) and the investigations on its related research achievements, it is supposed that 'CoRCS-Net is a scale-free network' in this study. In order to prove the theoretical hypothesis, the concepts of combinable strength and variation of combinable strength were introduced, and combinable strength is used to describe the invoking times of a service being invoked for service composition. First we calculate the real time variation of combinable strength of an arbitrary service in CoRCS-Net, and then obtain the corresponding real time combinable strength and investigate its distribution for all services in CoRCS-Net. It is discovered that 'like many nature and social phenomenon, CoRCS-Net is \"scale-free'', and it is constructed by few \"active services'' and a great deal of \"silent services''. In the process of service composition, the invoking times for majority services are very small, while only few services are invoked frequently, and the probability (or invoking times) for the services in a CoRCS-Net to be invoked for service composition decays as a power-law'.", "paper_title": "Modelling of combinable relationship-based composition service network and the theoretical proof of its scale-free characteristics", "paper_id": "WOS:000307640700001"}