{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.004296264970612285, "phrase": "information_fusion"}, {"score": 0.0038332390893263844, "phrase": "crisp_numbers"}, {"score": 0.0037789720824759503, "phrase": "linguistic_values"}, {"score": 0.003544088803300751, "phrase": "new_geometric_aggregation_operators"}, {"score": 0.0024630345285372958, "phrase": "membership_function"}, {"score": 0.0024108455980729284, "phrase": "non-membership_function"}, {"score": 0.002359759876402679, "phrase": "numerical_examples"}, {"score": 0.0022608057001451414, "phrase": "developed_operators"}, {"score": 0.0021049977753042253, "phrase": "ifhg_operator"}], "paper_keywords": ["information fusion", " intuitionistic fuzzy set", " intuitionistic fuzzy weighted geometric (IFWG) operator", " intuitionistic fuzzy ordered weighted geometric (IFOWG) operator", " intuitionistic fuzzy hybrid geometric (IFHG) operator"], "paper_abstract": "The weighted geometric (WG) operator and the ordered weighted geometric (OWG) operator are two common aggregation operators in the field of information fusion. But these two aggregation operators are usually used in situations where the given arguments are expressed as crisp numbers or linguistic values. In this paper, we develop some new geometric aggregation operators, such as the intuitionistic fuzzy weighted geometric (IFWG) operator, the intuitionistic fuzzy ordered weighted geometric (IFOWG) operator, and the intuitionistic fuzzy hybrid geometric (IFHG) operator, which extend the WG and OWG operators to accommodate the environment in which the given arguments are intuitionistic fuzzy sets which are characterized by a membership function and a non-membership function. Some numerical examples are given to illustrate the developed operators. Finally, we give an application of the IFHG operator to multiple attribute decision making based on intuitionistic fuzzy sets.", "paper_title": "Some geometric aggregation operators based on intuitionistic fuzzy sets", "paper_id": "WOS:000239153200003"}