{"auto_keywords": [{"score": 0.04403031187889063, "phrase": "partition"}, {"score": 0.00481495049065317, "phrase": "parameterized_algorithmics"}, {"score": 0.004733382430378317, "phrase": "niedermeier"}, {"score": 0.004614038128321949, "phrase": "problem_parameterization"}, {"score": 0.004421471944783611, "phrase": "general_form"}, {"score": 0.004236908273106904, "phrase": "subset_sum"}, {"score": 0.004086744751579196, "phrase": "numerical_matching"}, {"score": 0.00406001734835979, "phrase": "target_sums"}, {"score": 0.003789678137602989, "phrase": "distinct_integers"}, {"score": 0.0036793800647811365, "phrase": "fpt_result"}, {"score": 0.0036553070575015344, "phrase": "integer_linear_programming_feasibility"}, {"score": 0.0034342984674830533, "phrase": "problem_inputs"}, {"score": 0.0033016282588376397, "phrase": "weighted_objects"}, {"score": 0.002962543869356265, "phrase": "system_description"}, {"score": 0.002866817775018445, "phrase": "number-of-numbers_parameterization"}, {"score": 0.0027560092576928595, "phrase": "non-deterministic_mealy_machine_m"}, {"score": 0.0025722741181993278, "phrase": "census_requirement_c"}, {"score": 0.002547043222086858, "phrase": "output_word"}, {"score": 0.0023538840032613535, "phrase": "word_y"}, {"score": 0.0021682027434117095, "phrase": "input_word"}, {"score": 0.0021049977753042253, "phrase": "x_outputs"}], "paper_keywords": ["Parameterized complexity", " Problem parameterization", " Variety of a multiset", " Numerical problems"], "paper_abstract": "The usefulness of parameterized algorithmics has often depended on what Niedermeier has called \"the art of problem parameterization\". In this paper we introduce and explore a novel but general form of parameterization: the number of numbers. Several classic numerical problems, such as Subset Sum, Partition, 3-Partition, Numerical 3-Dimensional Matching, and Numerical Matching with Target Sums, have multisets of integers as input. We initiate the study of parameterizing these problems by the number of distinct integers in the input. We rely on an FPT result for Integer Linear Programming Feasibility to show that all the above-mentioned problems are fixed-parameter tractable when parameterized in this way. In various applied settings, problem inputs often consist in part of multisets of integers or multisets of weighted objects (such as edges in a graph, or jobs to be scheduled). Such number-of-numbers parameterized problems often reduce to subproblems about transition systems of various kinds, parameterized by the size of the system description. We consider several core problems of this kind relevant to number-of-numbers parameterization. Our main hardness result considers the problem: given a non-deterministic Mealy machine M (a finite state automaton outputting a letter on each transition), an input word x, and a census requirement c for the output word specifying how many times each letter of the output alphabet should be written, decide whether there exists a computation of M reading x that outputs a word y that meets the requirement c. We show that this problem is hard for W[1]. If the question is whether there exists an input word x such that a computation of M on x outputs a word that meets c, the problem becomes fixed-parameter tractable.", "paper_title": "Parameterizing by the Number of Numbers", "paper_id": "WOS:000300242400006"}