{"auto_keywords": [{"score": 0.03700795318466833, "phrase": "afek_et_al"}, {"score": 0.013760018961554248, "phrase": "counting_problem"}, {"score": 0.00971371356312061, "phrase": "message_complexity"}, {"score": 0.007082687573913029, "phrase": "initial_faults"}, {"score": 0.00481495049065317, "phrase": "dynamic_networks"}, {"score": 0.0047918800403177865, "phrase": "afek"}, {"score": 0.004768919246324576, "phrase": "awerbuch"}, {"score": 0.004746076758515251, "phrase": "plotkin"}, {"score": 0.004712004617361861, "phrase": "saks"}, {"score": 0.0046781613377273774, "phrase": "important_fundamental_problem"}, {"score": 0.004644572762022603, "phrase": "distributed_networks"}, {"score": 0.004148631410346188, "phrase": "useful_variant"}, {"score": 0.00411882905583272, "phrase": "heavily_studied_and_used_task"}, {"score": 0.00402101925240207, "phrase": "remote_information"}, {"score": 0.0038600230206554792, "phrase": "counting_node"}, {"score": 0.0035741900278634616, "phrase": "efficient_resource_controller"}, {"score": 0.0034392837410790293, "phrase": "dynamic_network"}, {"score": 0.003131332224180461, "phrase": "spanning_tree"}, {"score": 0.0030276240911865744, "phrase": "internal_nodes"}, {"score": 0.0026268961477241026, "phrase": "new_controller"}, {"score": 0.0025892330566358503, "phrase": "efficient_size-estimation_protocol"}, {"score": 0.0025155150482635688, "phrase": "constant_factor_estimation"}, {"score": 0.002467536552997677, "phrase": "dynamically_changing_network"}, {"score": 0.0024380146670042605, "phrase": "resulting_new_size-estimation_protocol"}, {"score": 0.0023515464194592195, "phrase": "network_size"}, {"score": 0.0022790861974433005, "phrase": "current_number"}, {"score": 0.002219516542316085, "phrase": "size_estimation"}, {"score": 0.0021202637462558547, "phrase": "paterson"}, {"score": 0.0021049977753042253, "phrase": "leader_election"}], "paper_keywords": ["Dynamic networks", " Controller", " Size-estimation", " Majority commitment", " Dynamic labeling schemes", " Name-assignment"], "paper_abstract": "Afek, Awerbuch, Plotkin, and Saks identified an important fundamental problem inherent to distributed networks, which they called the Resource Controller problem. Consider, first, the problem in which one node (called the 'root') is required to estimate the number of events that occurred all over the network. This counting problem can be viewed as a useful variant of the heavily studied and used task of topology update (that deals with collecting all remote information). The Resource Controller problem generalizes the counting problem: such remote events are considered as requests, and the counting node, i.e., the 'root', also issues permits for the requests. That way, the number of requests granted can be controlled (bounded). An efficient Resource Controller was constructed in the paper by Afek et al., and it can operate on a dynamic network assuming that the network is spanned by a tree that may only grow, and only by allowing leaves to join the tree. In contrast, the Resource Controller presented here can operate under a more general dynamic model, allowing the spanning tree of the network to undergo both insertions and deletions of both leaves and internal nodes. Despite the more dynamic network model we allow, the message complexity of our controller is never more than the message complexity of the more restricted controller. All the applications for the controller of Afek et al. can be used also with our controller. Moreover, with the same message complexity, our controller can handle these applications under the more general dynamic model mentioned above. In particular, the new controller can be transformed into an efficient size-estimation protocol, i.e.; a protocol allowing all nodes to maintain a constant factor estimation of the number of nodes in the dynamically changing network. Informally, the resulting new size-estimation protocol uses O (log(2) n) amortized message complexity per topological change (assuming that the number of changes in the network size is \"not too small\"), where n is the current number of nodes in the network. An application of the size estimation of Afek et al. was to solve agreement in the case of initial faults (Fischer, Lynch, and Paterson) and leader election under initial faults (Bar-Yehuda and Kutten). Hence, the controllers in this paper can be useful for these applications too. (c) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Controller and estimator for dynamic networks", "paper_id": "WOS:000314073500003"}