{"auto_keywords": [{"score": 0.028818583867887944, "phrase": "prhist"}, {"score": 0.00481495049065317, "phrase": "selectivity_estimation"}, {"score": 0.004554488671294504, "phrase": "limited_memory"}, {"score": 0.0039005612858880115, "phrase": "future_occurrences"}, {"score": 0.0037784540167266497, "phrase": "\"proactive\"_approach"}, {"score": 0.0036311617742547167, "phrase": "reactive_approach"}, {"score": 0.0034482025128821548, "phrase": "customized_proactive_histograms"}, {"score": 0.0034073030552032304, "phrase": "query_prediction"}, {"score": 0.0033402088717816416, "phrase": "reactive_histograms"}, {"score": 0.0033005860945173136, "phrase": "predicted_future"}, {"score": 0.0030000149283621255, "phrase": "proactive_histograms"}, {"score": 0.002917604283241353, "phrase": "merge_process"}, {"score": 0.002737615043512257, "phrase": "data_updates"}, {"score": 0.002548331088496964, "phrase": "extensive_experiments"}, {"score": 0.002190519728921395, "phrase": "significant_portion"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["selectivity estimation", " proactive", " reactive", " histograms", " query optimization"], "paper_abstract": "Many state-of-the-art selectivity estimation methods use query feedback to maintain histogram buckets, thereby using the limited memory efficiently. However, they are \"reactive\" in nature, that is, they update the histogram based on queries that have come to the system in the past for evaluation. In some applications, future occurrences of certain queries may be predicted and a \"proactive\" approach can bring much needed performance gain, especially when combined with the reactive approach. For these applications, this paper provides a method that builds customized proactive histograms based on query prediction and mergers them into reactive histograms when the predicted future arrives. Thus, the method is called the proactive and reactive histogram (PRHist). Two factors affect the usefulness of the proactive histograms and are dealt with during the merge process: the first is the predictability of queries and the second is the extent of data updates. PRHist adjusts itself to be more reactive or more proactive depending on these two factors. Through extensive experiments using both real and synthetic data and query sets, this paper shows that in most cases, PRHist outperforms STHoles, the state-of-the-art reactive method, even when only a small portion of the queries are predictable and a significant portion of data is updated. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Proactive and reactive multi-dimensional histogram maintenance for selectivity estimation", "paper_id": "WOS:000254709200009"}