{"auto_keywords": [{"score": 0.04520628298006752, "phrase": "parameter_beta"}, {"score": 0.010612387000973441, "phrase": "image_segmentation"}, {"score": 0.004761968711051715, "phrase": "gaussian_mixture"}, {"score": 0.004640590144749795, "phrase": "spatial_constraint"}, {"score": 0.004278807087784626, "phrase": "hmrf_model"}, {"score": 0.0036373553416391823, "phrase": "simple_and_effective_algorithm"}, {"score": 0.003584025547693836, "phrase": "traditional_gaussian_mixture_model"}, {"score": 0.0034160263294684785, "phrase": "local_spatial_information"}, {"score": 0.003378385493203297, "phrase": "pixel_intensity_value_information"}, {"score": 0.0033411580268394732, "phrase": "conditional_probability"}, {"score": 0.0031032109441552287, "phrase": "intensity_information"}, {"score": 0.0029576827451501956, "phrase": "small_value"}, {"score": 0.002925077525258983, "phrase": "image_sharpness"}, {"score": 0.002882160722418316, "phrase": "non-noise_images"}, {"score": 0.0028293966058473476, "phrase": "neighborhood_window"}, {"score": 0.0027469703311742647, "phrase": "heavy-noised_images"}, {"score": 0.0026570998719084153, "phrase": "image_noise_degree"}, {"score": 0.0024768883044869023, "phrase": "conditional_probability_computation"}, {"score": 0.0021601997088758957, "phrase": "synthetic_and_real_images"}, {"score": 0.0021363670305843403, "phrase": "improved_robustness"}], "paper_keywords": ["EM algorithm", " Gaussian Mixture Model", " HMRF", " Image segmentation", " Local information", " Spatial constraints"], "paper_abstract": "The Gaussian Mixture Model (GMM) with the spatial constraint, e.g. Hidden Markov Random Field (HMRF), has been proven effective for image segmentation. The parameter beta in the HMRF model is used to balance between robustness to noise and effectiveness of preserving the detail of the image. In other words, the determination of parameter beta is, in fact, noise dependent to some degree. In this paper, we propose a simple and effective algorithm to make the traditional Gaussian Mixture Model more robust to noise, with consideration of the relationship between the local spatial information and the pixel intensity value information. The conditional probability of an image pixel is influenced by the probabilities of pixels in its immediate neighborhood to incorporate the spatial and the intensity information. In this case, the parameter beta can be assigned to a small value to preserve image sharpness and detail in non-noise images. Meanwhile, the neighborhood window is used to tolerate the noise for heavy-noised images. Thus, the parameter beta is independent of image noise degree in our model. Furthermore, we propose another algorithm for our modified GMM (MGMM) with the simplification of conditional probability computation (MGMM_S). Finally, our algorithm is not limited to GMM - it is general enough so that it can be applied to other distributions based on the construction of the Finite Mixture Model (FMM) technique. Experimental results of synthetic and real images demonstrate the improved robustness and effectiveness of our approach.", "paper_title": "Two Fast and Robust Modified Gaussian Mixture Models Incorporating Local Spatial Information for Image Segmentation", "paper_id": "WOS:000357690000004"}