{"auto_keywords": [{"score": 0.03763915814245744, "phrase": "high-fidelity_models"}, {"score": 0.030477996059079054, "phrase": "fase"}, {"score": 0.00481495049065317, "phrase": "scalable_performance_prediction"}, {"score": 0.004780183091824403, "phrase": "hpc_systems"}, {"score": 0.00442987501427177, "phrase": "optimum_configuration"}, {"score": 0.004303252595782034, "phrase": "major_challenge"}, {"score": 0.004180234323211199, "phrase": "poorly_configured_systems"}, {"score": 0.004016782710006123, "phrase": "key_applications"}, {"score": 0.00393032656248792, "phrase": "new_systems"}, {"score": 0.0037903327482565097, "phrase": "system_characteristics"}, {"score": 0.003642070943285037, "phrase": "vital_design_decisions"}, {"score": 0.0034366728236876016, "phrase": "large-scale_systems"}, {"score": 0.002897710777957041, "phrase": "simulation_speed"}, {"score": 0.0028249975318149468, "phrase": "associated_toolset"}, {"score": 0.0027943943921568456, "phrase": "numerous_architectural_options"}, {"score": 0.0027143926774929957, "phrase": "system_design_decisions"}, {"score": 0.002684984491718288, "phrase": "quantifiable_demands"}, {"score": 0.002627117999049202, "phrase": "manual_analysis"}, {"score": 0.002542642270762272, "phrase": "large_systems"}, {"score": 0.002460876181416983, "phrase": "novel_approach"}, {"score": 0.0024342079318127423, "phrase": "discrete-event_simulation"}, {"score": 0.002407827985570249, "phrase": "application_characterization_scheme"}, {"score": 0.0023644936731468252, "phrase": "unnecessary_details"}], "paper_keywords": ["performance prediction", " application characterization", " high-performance computing", " discrete-event simulation"], "paper_abstract": "As systems of computers become more complex in terms of their architecture, interconnect and heterogeneity, the optimum configuration and utilization of these machines becomes a major challenge. To reduce the penalties caused by poorly configured systems, simulation is often used to predict the performance of key applications to be executed on the new systems. Simulation provides the capability to observe component and system characteristics (e.g. performance and power) in order to make vital design decisions. However, simulating high-fidelity models can be very time consuming and even prohibitive when evaluating large-scale systems. The Fast and Accurate Simulation Environment (FASE) framework seeks to support large-scale system simulation by using high-fidelity models to capture the behavior of only the performance-critical components while employing abstraction techniques to capture the effects of those components with little impact on the system. In order to achieve this balance of accuracy and simulation speed, FASE provides a methodology and associated toolset to evaluate numerous architectural options. This approach allows users to make system design decisions based on quantifiable demands of their key applications rather than using manual analysis which can be error prone and impractical for large systems. The framework accomplishes this evaluation through a novel approach of combining discrete-event simulation with an application characterization scheme in order to remove unnecessary details while focusing on components critical to the performance of the application. In this paper, we present the methodology and techniques behind FASE and include several case studies validating systems constructed using various applications and interconnects.", "paper_title": "FASE: A framework for scalable performance prediction of HPC systems and applications", "paper_id": "WOS:000251731300004"}