{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed_adaptive_control"}, {"score": 0.004595135986420401, "phrase": "design_principles"}, {"score": 0.004329761994489363, "phrase": "embodied_agent"}, {"score": 0.0038767563648545457, "phrase": "dac_theory"}, {"score": 0.003835768865313019, "phrase": "robot_based_neural_architecture"}, {"score": 0.0037550844377363204, "phrase": "organizational_layers"}, {"score": 0.003456250098004831, "phrase": "specific_benchmarks"}, {"score": 0.0034051785545019093, "phrase": "key_elements"}, {"score": 0.0033193710712981802, "phrase": "mammalian_brain"}, {"score": 0.0031946840844444277, "phrase": "core_principles"}, {"score": 0.0031743616462319327, "phrase": "reactive_layer"}, {"score": 0.0031341025637806426, "phrase": "fundamental_behavior_systems"}, {"score": 0.0031141643006047386, "phrase": "vertebrate_brain"}, {"score": 0.003061611625758479, "phrase": "neuronal_mass_action"}, {"score": 0.003042133121834245, "phrase": "locust_brain"}, {"score": 0.0030227781677787187, "phrase": "adaptive_layer"}, {"score": 0.00297176307044286, "phrase": "classical_conditioning_paradigm"}, {"score": 0.0029465783448933483, "phrase": "amygdala-cerebellum-neocortex_complex"}, {"score": 0.0028906880658354918, "phrase": "sense-act_couplets"}, {"score": 0.0028479497098264518, "phrase": "contextual_layer"}, {"score": 0.0028058414554116926, "phrase": "prefrontal_cortex"}, {"score": 0.002776144784993684, "phrase": "contextual_plans"}, {"score": 0.0027350952875625787, "phrase": "general_overview"}, {"score": 0.002723478435094998, "phrase": "dac's_explanation"}, {"score": 0.0026775010209620217, "phrase": "application_scenarios"}, {"score": 0.0026322977429166948, "phrase": "mobile_and_humanoid_robots"}, {"score": 0.0025768713646462924, "phrase": "ada"}, {"score": 0.002549583159319056, "phrase": "research_dac"}, {"score": 0.00250653404448878, "phrase": "mbbn."}, {"score": 0.002474723709173135, "phrase": "track_record"}, {"score": 0.002458969878215599, "phrase": "core_aspects"}, {"score": 0.0022970287793288827, "phrase": "complex_real-world_artefacts"}, {"score": 0.0022630476592458318, "phrase": "brain_repair"}, {"score": 0.0022390969535807242, "phrase": "dac"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Architecture", " Body", " Brain", " Distributed Adaptive Control", " Mind", " Robot"], "paper_abstract": "Distributed Adaptive Control (DAC) is a theory of the design principles underlying the Mind, Brain, Body Nexus (MBBN) that has been developed over the last 20 years. DAC assumes that the brain maintains stability between an embodied agent and its environment through action. It postulates that in order to act, or know how, the brain has to answer four fundamental questions: why, what, where, when. Thus the function of the brain is to continuously solve the, so called, H4W problem. The DAC theory is expressed as a robot based neural architecture organized in two complementary structures: layers and columns. The organizational layers are called: reactive, adaptive and contextual and its columnar organization defines the processing of states of the world, the self and the generation of action. Each layer is described with respect to its key hypotheses, implementation and specific benchmarks. After this overview of the key elements of DAC, the mapping of its key assumptions towards the invertebrate and mammalian brain is described. In particular, this review will focus on the systems involved in realizing the core principles underlying the reactive layer: the allostatic control of fundamental behavior systems in the vertebrate brain and the emergent non-linearity through neuronal mass action in the locust brain. The adaptive layer will be analyzed in terms of the classical conditioning paradigm and its neuronal substrate the amygdala-cerebellum-neocortex complex together with episodic memory and the formation of sense-act couplets in the hippocampus. For the contextual layer the ability of circuits in the prefrontal cortex to acquire and express contextual plans for action is described. The general overview of DAC's explanation of MBBN is combined by examples of application scenarios in which DAC has been validated including mobile and humanoid robots, neurorehabilitation and the large-scale interactive space Ada. After 20 years of research DAC can be considered a mature theory of MBBN. It has build up a track record of explaining core aspects of mind, brain and behavior, has made testable and verified predictions at the level of behavior, physiology and anatomy, has been shown to be able to control complex real-world artefacts and has been successfully applied to brain repair and neurorehabilitation. Currently DAC is extended to capture the phenomenon of consciousness, the ultimate challenge in the study of the Mind, Brain, Body Nexus. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Distributed Adaptive Control: A theory of the Mind, Brain, Body Nexus", "paper_id": "WOS:000209359300007"}