{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "deadzone_width"}, {"score": 0.04482575134610921, "phrase": "inserted_redundancy"}, {"score": 0.04092276008358608, "phrase": "mid-tread_quantizers"}, {"score": 0.03372501591734816, "phrase": "proposed_approach"}, {"score": 0.00471465954562773, "phrase": "polyphase-based_multiple_description_coding"}, {"score": 0.004640808212832262, "phrase": "polyphase-based_mechanism"}, {"score": 0.004356741449157895, "phrase": "inefficient_exploitation"}, {"score": 0.003962779958955344, "phrase": "novel_approach"}, {"score": 0.0034555479218891638, "phrase": "statistical_distribution"}, {"score": 0.003330406613112555, "phrase": "approximated_level"}, {"score": 0.003028969851366049, "phrase": "tunable_step-size"}, {"score": 0.0025722202862084186, "phrase": "proposed_scheme"}, {"score": 0.0022544399432457164, "phrase": "state-of-the-art_schemes"}, {"score": 0.0021498955164659145, "phrase": "central_quality"}], "paper_keywords": ["Image coding", " Multiple description coding", " Scalar quantization"], "paper_abstract": "The polyphase-based mechanism is the basis of many multiple descriptions coding schemes. Its main drawback is the inefficient exploitation of the inserted redundancy, especially when the redundancy is large. In this paper we propose a novel approach that uses mid-tread quantizers with tunable deadzone, in order to efficiently exploit the inserted redundancy. In particular, the deadzone width is selected based on the statistical distribution of the data, and the approximated level of redundancy to be inserted. The proposed approach is tailored for those codecs that use mid-tread quantizers with tunable step-size and deadzone width. This is particularly interesting given that the majority of codecs use this topology of quantization, and they rarely allow changing it. Moreover, the proposed scheme can be extended to the case of more than two descriptions. Finally, it is worth reporting that the results of the proposed approach outperform that of state-of-the-art schemes. In fact with the same side performance, the central quality can achieve up to 1 dB gain.", "paper_title": "Optimizing the deadzone width to improve the polyphase-based multiple description coding", "paper_id": "WOS:000331084000017"}