{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "offset_paths"}, {"score": 0.04373758664416466, "phrase": "raw_offset_paths"}, {"score": 0.023084508285114463, "phrase": "mesh_surfaces"}, {"score": 0.010480637378103109, "phrase": "cnc_machining"}, {"score": 0.007382701371089226, "phrase": "mesh_surface"}, {"score": 0.006699145006382677, "phrase": "invalid_self-intersection_loops"}, {"score": 0.004680725471654037, "phrase": "tool_path"}, {"score": 0.004368093195599546, "phrase": "surface_boundaries"}, {"score": 0.004327104321558231, "phrase": "primary_curve"}, {"score": 0.004286498418857255, "phrase": "key_issues"}, {"score": 0.004246271940215511, "phrase": "offset_path_planning"}, {"score": 0.003312238122534935, "phrase": "predefined_plane"}, {"score": 0.0032708180619317423, "phrase": "mesh_mapping_technique"}, {"score": 0.002865886996201355, "phrase": "offset_path"}, {"score": 0.0028211393326371035, "phrase": "local_loop"}, {"score": 0.002708029282786675, "phrase": "planar_paths"}, {"score": 0.0026573612772397832, "phrase": "physical_space"}, {"score": 0.0026323829544632428, "phrase": "final_tool_paths"}, {"score": 0.0024951987856762646, "phrase": "kinematic_and_dynamic_performance"}, {"score": 0.002471740959383183, "phrase": "machine_tool"}, {"score": 0.002433132434417479, "phrase": "generated_offset_paths"}, {"score": 0.002380089119791563, "phrase": "sharp_corners"}, {"score": 0.0023651468875880628, "phrase": "tool_paths"}, {"score": 0.0022068324655021374, "phrase": "proposed_method"}, {"score": 0.0021451564984201364, "phrase": "machining_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["CNC machining", " Mesh surfaces", " Mesh mapping", " Offset path", " Corner rounding"], "paper_abstract": "Geometrically, a tool path can be generated by successively offsetting its adjacent path on the surface with a given path interval, which preferably starts from one of the surface boundaries or a primary curve. The key issues involved in offset path planning are the generation of raw offset paths and the elimination of the self-intersection of raw offset paths. Most researches available in this area are focused on how to generate the raw offset paths, however, the latter, especially how to eliminate the self-intersection of the offset paths on mesh surfaces, has not been sufficiently addressed. In this paper, a mapping-based approach to eliminating the self-intersection of offset paths is proposed for the CNC machining of mesh surfaces. The method first flattens the mesh surface onto a predefined plane by using a mesh mapping technique, and then taking the mapping as a guide, the offset paths are also naturally mapped onto the plane, from which those invalid self-intersection loops can be effectively identified and eliminated. To handle the issue of self-intersection for all types of offset path, a notion of local loop is introduced to detect and eliminate the invalid self-intersection loops. After that the planar paths are inversely mapped into the physical space and the final tool paths used for the machining of mesh surface are obtained. Meanwhile, in order to improve the kinematic and dynamic performance of the machine tool when machining along the generated offset paths, a method for rounding the sharp corners of tool paths, which result from the process of eliminating the self-intersection of raw offset paths, is also preliminarily investigated. Finally, the proposed method is validated by the results of simulations and machining experiments. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A mapping-based approach to eliminating self-intersection of offset paths on mesh surfaces for CNC machining", "paper_id": "WOS:000350942400012"}