{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "adapting_cars"}, {"score": 0.004242411872706126, "phrase": "complex_automated_system"}, {"score": 0.004139223748460922, "phrase": "intelligent_and_advanced_ways"}, {"score": 0.0038579703525471985, "phrase": "adaptive_cruise_control"}, {"score": 0.0038309545561707944, "phrase": "acc"}, {"score": 0.0036467403626789666, "phrase": "preset_distance"}, {"score": 0.0035082436540296406, "phrase": "driver's_preferences"}, {"score": 0.0034713900276078786, "phrase": "individual_drivers"}, {"score": 0.003447035529485425, "phrase": "different_driving_styles"}, {"score": 0.0033988361874354306, "phrase": "current_systems"}, {"score": 0.0032467792804296036, "phrase": "machine-learning_algorithms"}, {"score": 0.0031565959573536194, "phrase": "existing_automated_assistive_systems"}, {"score": 0.0030366573271799406, "phrase": "automated_systems"}, {"score": 0.002732149335827768, "phrase": "automated_system"}, {"score": 0.0024236964502593254, "phrase": "generic_packages"}, {"score": 0.0023982116404137285, "phrase": "weka"}, {"score": 0.0023563212280243682, "phrase": "drivers'_behavior"}, {"score": 0.0023151639346874883, "phrase": "improved_learning_models"}, {"score": 0.0022507989506447413, "phrase": "drivers'_demographics"}, {"score": 0.002227125088932002, "phrase": "previously_developed_model"}, {"score": 0.0022114807037424944, "phrase": "different_driver_types"}, {"score": 0.00217284779477444, "phrase": "general_methodology"}], "paper_keywords": [""], "paper_abstract": "Traditionally, vehicles have been considered as machines that are controlled by humans for the purpose of transportation. A more modem view is to envision drivers and passengers as actively interacting with a complex automated system. Such interactive activity leads us to consider intelligent and advanced ways of interaction leading to cars that can adapt to their drivers. In this article, we focus on the adaptive cruise control (ACC) technology that allows a vehicle to automatically adjust its speed to maintain a preset distance from the vehicle in front of it based on the driver's preferences. Although individual drivers have different driving styles and preferences, current systems do not distinguish among users. We introduce a method to combine machine-learning algorithms with demographic information and expert advice into existing automated assistive systems. This method can reduce the interactions between drivers and automated systems by adjusting parameters relevant to the operation of these systems based on their specific drivers and context of drive. We also learn when users tend to engage and disengage the automated system. This method sheds light on the kinds of dynamics that users develop while interacting with automation and can teach us how to improve these systems for the benefit of their users. While generic packages such as Weka were successful in learning drivers' behavior, we found that improved learning models could be developed by adding information on drivers' demographics and a previously developed model about different driver types. We present the general methodology of our learning procedure and suggest applications of our approach to other domains as well.", "paper_title": "Toward Adapting Cars to Their Drivers", "paper_id": "WOS:000313134000006"}