{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quality_attributes"}, {"score": 0.049596205816074275, "phrase": "software_product_lines"}, {"score": 0.024029162460923868, "phrase": "existing_measures"}, {"score": 0.004682575242681044, "phrase": "software_measures"}, {"score": 0.004647105813224402, "phrase": "appropriate_mechanism"}, {"score": 0.004496469691657829, "phrase": "software_development_projects"}, {"score": 0.004439863523633261, "phrase": "spl"}, {"score": 0.004317728683659697, "phrase": "single_software_product"}, {"score": 0.004263336444795021, "phrase": "systematic_reuse"}, {"score": 0.004198965651975536, "phrase": "inadequate_design_decision"}, {"score": 0.0040525061916685924, "phrase": "great_number"}, {"score": 0.0038228589277720633, "phrase": "current_knowledge"}, {"score": 0.003736567662016446, "phrase": "systematic_literature_review"}, {"score": 0.0036245239349157236, "phrase": "present_quality"}, {"score": 0.0035879276279133553, "phrase": "spl."}, {"score": 0.003445174898115646, "phrase": "life_cycle_phase"}, {"score": 0.003308085469148074, "phrase": "specific_spl_characteristics"}, {"score": 0.0028697077879305064, "phrase": "design_phase"}, {"score": 0.0028551716387011637, "phrase": "domain_engineering"}, {"score": 0.0027906622487060407, "phrase": "product_line_architecture"}, {"score": 0.0026592094867526803, "phrase": "global_vision"}, {"score": 0.0025275050635202878, "phrase": "research_efforts"}, {"score": 0.002501955525421155, "phrase": "new_research_lines"}, {"score": 0.0024392031587145728, "phrase": "new_measures"}, {"score": 0.0023599666007519788, "phrase": "entire_spl_life_cycle"}, {"score": 0.0021923400552366777, "phrase": "reference_guide"}], "paper_keywords": ["Software product lines", " Quality", " Measures", " Quality attributes", " Systematic literature review"], "paper_abstract": "It is widely accepted that software measures provide an appropriate mechanism for understanding, monitoring, controlling, and predicting the quality of software development projects. In software product lines (SPL), quality is even more important than in a single software product since, owing to systematic reuse, a fault or an inadequate design decision could be propagated to several products in the family. Over the last few years, a great number of quality attributes and measures for assessing the quality of SPL have been reported in literature. However, no studies summarizing the current knowledge about them exist. This paper presents a systematic literature review with the objective of identifying and interpreting all the available studies from 1996 to 2010 that present quality attributes and/or measures for SPL. These attributes and measures have been classified using a set of criteria that includes the life cycle phase in which the measures are applied; the corresponding quality characteristics; their support for specific SPL characteristics (e.g., variability, compositionality); the procedure used to validate the measures, etc. We found 165 measures related to 97 different quality attributes. The results of the review indicated that 92% of the measures evaluate attributes that are related to maintainability. In addition, 67% of the measures are used during the design phase of Domain Engineering, and 56% are applied to evaluate the product line architecture. However, only 25% of them have been empirically validated. In conclusion, the results provide a global vision of the state of the research within this area in order to help researchers in detecting weaknesses, directing research efforts, and identifying new research lines. In particular, there is a need for new measures with which to evaluate both the quality of the artifacts produced during the entire SPL life cycle and other quality characteristics. There is also a need for more validation (both theoretical and empirical) of existing measures. In addition, our results may be useful as a reference guide for practitioners to assist them in the selection or the adaptation of existing measures for evaluating their software product lines.", "paper_title": "A systematic review of quality attributes and measures for software product lines", "paper_id": "WOS:000308001900002"}