{"auto_keywords": [{"score": 0.049100450513748305, "phrase": "target_set_selection"}, {"score": 0.00481495049065317, "phrase": "constant_thresholds"}, {"score": 0.004463723624910583, "phrase": "prominent_np-hard_problem"}, {"score": 0.004372442291178139, "phrase": "social_network_analysis"}, {"score": 0.003997891221012094, "phrase": "useful_polynomial-time_approximation"}, {"score": 0.003889206369317587, "phrase": "fixed-parameter_algorithms"}, {"score": 0.0037834649508375544, "phrase": "undirected_graph"}, {"score": 0.0035804980565263024, "phrase": "minimum_number"}, {"score": 0.0031193028729331667, "phrase": "dynamic_process"}, {"score": 0.0028127163745564777, "phrase": "threshold_value_t"}, {"score": 0.0022710523337245337, "phrase": "new_parameterizations"}, {"score": 0.002224510044064184, "phrase": "sparse_graphs"}, {"score": 0.0021490449563443025, "phrase": "\"cliquish\"_graphs"}], "paper_keywords": ["Spread of influence", " Dynamics in social networks", " Parameterized complexity", " Kernelization"], "paper_abstract": "Target Set Selection, which is a prominent NP-hard problem occurring in social network analysis and distributed computing, is notoriously hard both in terms of achieving useful polynomial-time approximation as well as fixed-parameter algorithms. Given an undirected graph, the task is to select a minimum number of vertices into a \"target set\" such that all other vertices will become active in the course of a dynamic process (which may go through several activation rounds). A vertex, equipped with a threshold value t, becomes active once at least t of its neighbors are active; initially, only the target set vertices are active. We contribute further insights into the existence of islands of tractability for Target Set Selection by spotting new parameterizations characterizing some sparse graphs as well as some \"cliquish\" graphs and developing corresponding fixed-parameter tractability and (parameterized) hardness results. In particular, we demonstrate that upper-bounding the thresholds by a constant may significantly alleviate the search for efficiently solvable, but still meaningful special cases of Target Set Selection.", "paper_title": "Constant Thresholds Can Make Target Set Selection Tractable", "paper_id": "WOS:000336928800003"}