{"auto_keywords": [{"score": 0.03768255196284212, "phrase": "demand_point"}, {"score": 0.00481495049065317, "phrase": "location_models"}, {"score": 0.004471530397729526, "phrase": "gradual_cover_models"}, {"score": 0.004326833704481825, "phrase": "\"all_or_nothing\"_assumption"}, {"score": 0.004221379262804442, "phrase": "general_coverage_function"}, {"score": 0.0038720442355114045, "phrase": "recently_developed_generalization"}, {"score": 0.0037776319581225046, "phrase": "\"individual_coverage\"_assumption"}, {"score": 0.002938821840519756, "phrase": "signal_strength"}, {"score": 0.0025972447844047515, "phrase": "\"fixed_coverage_radius\"_assumption"}, {"score": 0.002471973283582411, "phrase": "facility_cost"}, {"score": 0.0022117133940361025, "phrase": "different_types"}, {"score": 0.002157697367447098, "phrase": "larger_coverage_radius"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Location", " Covering models", " Gradual cover", " Cooperative cover", " Variable radius"], "paper_abstract": "The goal of the paper is to provide an overview of the following classes of models: Gradual cover models: These models seek to relax the \"all or nothing\" assumption by replacing it with a general coverage function which represents the proportion of demand covered at a certain distance from the facility. The cooperative cover model: This recently developed generalization is designed to replace the \"individual coverage\" assumption with a mechanism where all facilities contribute to the coverage of each demand point. This is accomplished by viewing coverage as the transmission of a \"signal\" by the facilities. The signal transmitted by each facility dissipates with distance. However, the signal received by each demand point is the aggregation of the transmissions from all the facilities. If the signal strength at the demand point exceeds a certain threshold, the point is covered, otherwise it is not. Variable radius model: This model is primarily designed to relax the \"fixed coverage radius\" assumption, making the coverage radius an endogenously determined function of the facility cost. Thus, instead of having to locate a certain pre-determined number of facilities, the decision-maker has a certain budget that can be used to construct facilities of different types, with the more expensive facilities having larger coverage radius. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Generalized coverage: New developments in covering location models", "paper_id": "WOS:000276185100001"}