{"auto_keywords": [{"score": 0.025655391291155988, "phrase": "proposed_scheduling_algorithm"}, {"score": 0.00481495049065317, "phrase": "virtual_machines"}, {"score": 0.004779876533667754, "phrase": "workload-aware_consolidation_techniques"}, {"score": 0.004710489616113198, "phrase": "growing_demand"}, {"score": 0.004591466267316524, "phrase": "reasonable_response_times"}, {"score": 0.004426607895888934, "phrase": "energy-aware_datacenters"}, {"score": 0.004283280680222718, "phrase": "virtualization_technology"}, {"score": 0.0036065830625093883, "phrase": "blind_consolidation"}, {"score": 0.003489714006817602, "phrase": "power_consumption"}, {"score": 0.0033890026927890058, "phrase": "energy_wastage"}, {"score": 0.0030587884803931964, "phrase": "performance_interferences"}, {"score": 0.0027505663559338825, "phrase": "known_vms"}, {"score": 0.0027206629552771902, "phrase": "pm"}, {"score": 0.002680932410366204, "phrase": "processing_and_storage_workloads"}, {"score": 0.0026035011274172753, "phrase": "energy-aware_scheduling_algorithm"}, {"score": 0.0025562434609873335, "phrase": "objective_functions"}, {"score": 0.002265095354846931, "phrase": "total_power_consumption"}, {"score": 0.0022239665922395104, "phrase": "whole_datacenter"}, {"score": 0.0022077244919858218, "phrase": "empirical_results"}], "paper_keywords": ["Power management", " Virtualization technology", " Workload characterization", " Cloud computing"], "paper_abstract": "There is growing demand on datacenters to serve more clients with reasonable response times, demanding more hardware resources, and higher energy consumption. Energy-aware datacenters have thus been amongst the forerunners to deploy virtualization technology to multiplex their physical machines (PMs) to as many virtual machines (VMs) as possible in order to utilize their hardware resources more effectively and save power. The achievement of this objective strongly depends on how smart VMs are consolidated. In this paper, we show that blind consolidation of VMs not only does not reduce the power consumption of datacenters but it can lead to energy wastage. We present four models, namely the target system model, the application model, the energy model, and the migration model, to identify the performance interferences between processor and disk utilizations and the costs of migrating VMs. We also present a consolidation fitness metric to evaluate the merit of consolidating a number of known VMs on a PM based on the processing and storage workloads of VMs. We then propose an energy-aware scheduling algorithm using a set of objective functions in terms of this consolidation fitness metric and presented power and migration models. The proposed scheduling algorithm assigns a set of VMs to a set of PMs in a way to minimize the total power consumption of PMs in the whole datacenter. Empirical results show nearly 24.9% power savings and nearly 1.2% performance degradation when the proposed scheduling algorithm is used compared to when other scheduling algorithms are used.", "paper_title": "Power-efficient distributed scheduling of virtual machines using workload-aware consolidation techniques", "paper_id": "WOS:000305224000004"}