{"auto_keywords": [{"score": 0.0046069985410261746, "phrase": "mixed_gaussian"}, {"score": 0.00408654006336477, "phrase": "image_restoration"}, {"score": 0.0038124354878360032, "phrase": "pure_gaussian"}, {"score": 0.0036246643358397272, "phrase": "relatively_fewer_works"}, {"score": 0.003360146665246448, "phrase": "new_integrated_approach"}, {"score": 0.003317970131738248, "phrase": "mgin_removal"}, {"score": 0.002449915958738505, "phrase": "overall_performance"}, {"score": 0.002285335999629823, "phrase": "proposed_approach"}, {"score": 0.0022002633747977593, "phrase": "visually_much_better_results"}], "paper_keywords": ["Block-matching 3-dimensional discrete cosine transformation filter", " linear contrast scaling filter", " mixed Gaussian and impulse noise", " non-singleton interval type-2 fuzzy logic system", " quantum-behaved particle swarm optimization"], "paper_abstract": "Removing Mixed Gaussian and Impulse Noise (MGIN) is considered to be one of the most essential topics in the domain of image restoration, and it is much more challenging than to remove pure Gaussian or impulse noise separately. Therefore, relatively fewer works have been published in this area. This paper proposes a new integrated approach for MGIN removal that is based on a Non-Singleton Interval Type-2 (NS-IT2) Fuzzy Logic System (FLS), and explains how to design such a NS-IT2 FLS using a Quantum-behaved Particle Swarm Optimization (QPSO) algorithm. Then the paper goes on to introduce two supplementary components, a Block-Matching 3-Dimensional Discrete Cosine Transformation (BM3D DCT) filter and a contrast scaling filter, which augment the overall performance of the NS-IT2 FLS. Finally, the paper shows that this proposed approach indeed provides both quantitatively and visually much better results compared to other often-used non-fuzzy techniques as well as its Type-1 (T1) and singleton IT2 (S-IT2) counterparts.", "paper_title": "UNIVERSAL IMAGE NOISE REMOVAL FILTER BASED ON TYPE-2 FUZZY LOGIC SYSTEM AND QPSO", "paper_id": "WOS:000308710000010"}