{"auto_keywords": [{"score": 0.004710306419574744, "phrase": "two-hop_benefit"}, {"score": 0.004507760907425495, "phrase": "critical_issue"}, {"score": 0.00439041997682389, "phrase": "social_networks"}, {"score": 0.00376409764683147, "phrase": "entire_network"}, {"score": 0.002941913249957503, "phrase": "two-hop_connection"}, {"score": 0.0026121403051734744, "phrase": "human_agents"}, {"score": 0.002339771435910601, "phrase": "two-hop_games"}, {"score": 0.002288797099841088, "phrase": "well-studied_games"}, {"score": 0.0022290883852844057, "phrase": "two-hop_benefit_changes"}, {"score": 0.0021049977753042253, "phrase": "good_equilibrium_solutions"}], "paper_keywords": ["Network formation", " Two-Hop games", " Price of anarchy"], "paper_abstract": "How and why people form ties is a critical issue for understanding the fabric of social networks. In contrast to most existing work, we are interested in settings where agents are neither so myopic as to consider only the benefit they derive from their immediate neighbors, nor do they consider the effects on the entire network when forming connections. Instead, we consider games on networks where a node tries to maximize its utility taking into account the benefit it gets from the nodes it is directly connected to (called direct benefit), as well as the benefit it gets from the nodes it is acquainted with via a two-hop connection (called two-hop benefit). We call such games Two-Hop Games. The decision to consider only two hops stems from the observation that human agents rarely consider \"contacts of a contact of a contact\" (3-hop contacts) or further while forming their relationships. We consider several versions of Two-Hop games which are extensions of well-studied games. While the addition of two-hop benefit changes the properties of these games significantly, we prove that in many important cases good equilibrium solutions still exist, and bound the change in the price of anarchy due to two-hop benefit both theoretically and in simulation.", "paper_title": "Friend of My Friend: Network Formation with Two-Hop Benefit", "paper_id": "WOS:000363718900010"}