{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "program_self-reference"}, {"score": 0.03005907338620277, "phrase": "denotational_control_structures"}, {"score": 0.004736045157669388, "phrase": "computability_theory"}, {"score": 0.004556901872357751, "phrase": "not-necessarily-constructive_form"}, {"score": 0.004506997851041362, "phrase": "kleene"}, {"score": 0.004457579615095599, "phrase": "recursion_theorem"}, {"score": 0.00428892403807229, "phrase": "programming_system"}, {"score": 0.0033651019362620866, "phrase": "usable_self-knowledge"}, {"score": 0.0031495640320537283, "phrase": "particular_interest"}, {"score": 0.0030135741897058844, "phrase": "control_structures"}, {"score": 0.002625213032767076, "phrase": "royer"}, {"score": 0.0023249757987087055, "phrase": "constructive_form"}, {"score": 0.0022994427535192492, "phrase": "kleene's_recursion_theorem"}, {"score": 0.0022492129111567824, "phrase": "non-denotational_control_structures"}], "paper_keywords": [""], "paper_abstract": "In computability theory, program self-reference is formalized by the not-necessarily-constructive form of Kleene's Recursion Theorem (krt). In a programming system in which krt holds, for any preassigned, algorithmic task, there exists a program that, in a sense, creates a copy of itself, and then performs that task using the self-copy. Interpreted in this way, such self-copying programs have usable self-knowledge. Herein, properties complementary to krt are considered. Of particular interest are those properties involving the implementation of control structures. One main result is that no property involving the implementation of denotational control structures is complementary to krt. This is in contrast to a result of Royer, which showed that implementation of if-then-else - a denotational control structure - is complementary to the constructive form of Kleene's Recursion Theorem. Examples of non-denotational control structures whose implementation is complementary to krt are then given. Some such control structures so nearly resemble denotational control structures that they might be called quasi-denotational.", "paper_title": "Properties Complementary to Program Self-Reference", "paper_id": "WOS:000298376700002"}