{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "graphlet_frequency_distributions"}, {"score": 0.044031982475491595, "phrase": "local_structure"}, {"score": 0.039059442498076156, "phrase": "high-confidence_ppi_networks"}, {"score": 0.0308325490796238, "phrase": "geometric_random_networks"}, {"score": 0.023824958248858455, "phrase": "exhaustive_searches"}, {"score": 0.004767261858417823, "phrase": "protein-protein_interaction_networks"}, {"score": 0.004490842671590769, "phrase": "protein-protein_interaction"}, {"score": 0.004402295697276237, "phrase": "network_analysis"}, {"score": 0.004251500979153001, "phrase": "biological_processes"}, {"score": 0.0040449598280454645, "phrase": "frequency_distribution"}, {"score": 0.0039651694106206245, "phrase": "small_connected_non-isomorphic_induced_subgraphs"}, {"score": 0.0036250779580069455, "phrase": "geometric_random_graphs"}, {"score": 0.003500812175550438, "phrase": "large_network"}, {"score": 0.0033306180744375616, "phrase": "ppi_networks"}, {"score": 0.0032975819773787985, "phrase": "higher_organisms"}, {"score": 0.0032164136388931805, "phrase": "efficient_heuristic_approaches"}, {"score": 0.002769568481822277, "phrase": "'inner_parts"}, {"score": 0.0023846534541336326, "phrase": "good_estimates"}, {"score": 0.0021049977753042253, "phrase": "accurate_approximate_results"}], "paper_keywords": [""], "paper_abstract": "Motivation: Algorithmic and modeling advances in the area of protein-protein interaction (PPI) network analysis could contribute to the understanding of biological processes. Local structure of networks can be measured by the frequency distribution of graphlets, small connected non-isomorphic induced subgraphs. This measure of local structure has been used to show that high-confidence PPI networks have local structure of geometric random graphs. Finding graphlets exhaustively in a large network is computationally intensive. More complete PPI networks, as well as PPI networks of higher organisms, will thus require efficient heuristic approaches. Results: We propose two efficient and scalable heuristics for finding graphlets in high-confidence PPI networks. We show that both PPI and their model geometric random networks, have defined boundaries that are sparser than the 'inner parts' of the networks. In addition, these networks exhibit 'uniformity' of local structure inside the networks. Our first heuristic exploits these two structural properties of PPI and geometric random networks to find good estimates of graphlet frequency distributions in these networks up to 690 times faster than the exhaustive searches. Our second heuristic is a variant of a more standard sampling technique and it produces accurate approximate results up to 377 times faster than the exhaustive searches. We indicate how the combination of these approaches may result in an even better heuristic.", "paper_title": "Efficient estimation of graphlet frequency distributions in protein-protein interaction networks", "paper_id": "WOS:000236612900010"}