{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "hacktivism_among_stem_college_students"}, {"score": 0.004660453113061494, "phrase": "hacktivism_support"}, {"score": 0.004112582094962078, "phrase": "midwestern"}, {"score": 0.003958937342925219, "phrase": "real-world_instances"}, {"score": 0.0038737214010638745, "phrase": "different_preexisting_global_attitudes"}, {"score": 0.003831801113154043, "phrase": "specific_situational_hacktivism_support"}, {"score": 0.0034366728236876016, "phrase": "greater_weight"}, {"score": 0.003201890266327127, "phrase": "different_facets"}, {"score": 0.0030989899982042236, "phrase": "shared_values"}, {"score": 0.0026898636962522505, "phrase": "higher_utilitarian_value"}, {"score": 0.0025334249463305875, "phrase": "mediation_analyses"}, {"score": 0.0024923577071656014, "phrase": "situation_perceptions"}, {"score": 0.002412204754253618, "phrase": "global_attitudes"}, {"score": 0.0022967713922705, "phrase": "specific_mediators"}, {"score": 0.0021049977753042253, "phrase": "specific_context"}], "paper_keywords": ["hacktivism", " motives", " trust", " distrust", " shared values", " attributions", " attitudes"], "paper_abstract": "This study investigated the predictors of support for and resistance to hacktivism in a sample of 78 science, technology, engineering, and mathematics majors at a Midwestern university. Results from surveys about real-world instances of hacktivism indicate different preexisting global attitudes predict specific situational hacktivism support (predicted by admiration) versus resistance (predicted by willingness to report). Also, participants gave greater weight to their perceptions of hacktivist (rather than target) trustworthiness/untrustworthiness. Comparisons among different facets of trustworthiness suggest perceptions of shared values with and integrity of the hacktivists are especially important for predicting support and resistance. Participants also were more supportive of hacktivism rated as having higher utilitarian value but not less supportive of hacktivism initiated for retribution. Mediation analyses indicated that situation perceptions significantly mediated the effects of global attitudes on hacktivism support/resistance, but that the significance of specific mediators was inconsistent across analyses. This suggests that the importance of mediators may depend on specific context.", "paper_title": "Exploring Reactions to Hacktivism Among STEM College Students: A Preliminary Model of Hacktivism Support and Resistance", "paper_id": "WOS:000357749200004"}