{"auto_keywords": [{"score": 0.0449112334954101, "phrase": "internet_backbone"}, {"score": 0.004815315858763141, "phrase": "distributed"}, {"score": 0.004744018246633455, "phrase": "unstructured_peer-to-peer_file_sharing_networks"}, {"score": 0.004009288598277725, "phrase": "great_importance"}, {"score": 0.003685604033479918, "phrase": "replacement_algorithms"}, {"score": 0.0036312482387007815, "phrase": "optimal_performance"}, {"score": 0.003455765987713262, "phrase": "adequate_number"}, {"score": 0.0033214855341753544, "phrase": "topologically_distant_locations"}, {"score": 0.0032724821705972357, "phrase": "general_believes"}, {"score": 0.00308357048262018, "phrase": "underlying_topology-aware_infrastructure"}, {"score": 0.0030081030319492343, "phrase": "excellent_performance"}, {"score": 0.0029784342137867776, "phrase": "popular_objects"}, {"score": 0.0029055323737809825, "phrase": "caching_performance"}, {"score": 0.0026839922027139967, "phrase": "over-caching_problem"}, {"score": 0.002516457934208144, "phrase": "simulation_experiments"}, {"score": 0.0023476849595393872, "phrase": "better_query"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Nowadays, the peer-to-peer (P2P) system is one of the largest Internet bandwidth consumers. To relieve the burden on Internet backbone and improve the query and retrieve performance of P2P file sharing networks, efficient P2P caching algorithms are of great importance. In this paper, we propose a distributed topology-aware unstructured P2P file caching infrastructure and design novel placement and replacement algorithms to achieve optimal performance. In our system, for each file, an adequate number of copies are generated and disseminated at topologically distant locations. Unlike general believes, our caching decisions are in favor of less popular files. Combined with the underlying topology-aware infrastructure, our strategy retains excellent performance for popular objects while greatly improves the caching performance for less popular files. Overall, our solution can reduce P2P traffic on Internet backbone, and relieve the over-caching problem that has not been properly addressed in unstructured P2P networks. We carry out simulation experiments to compare our approaches with several traditional caching strategies. The results show that our algorithms can achieve better query hit rates, smaller query delay, higher cache hit rates, and lower communication overhead. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Distributed caching in unstructured peer-to-peer file sharing networks", "paper_id": "WOS:000334978500035"}