{"auto_keywords": [{"score": 0.049118287236398724, "phrase": "gender_differences"}, {"score": 0.04544929381194944, "phrase": "route_instructions"}, {"score": 0.00481495049065317, "phrase": "user-robot_communication"}, {"score": 0.004658899143105193, "phrase": "spatial_navigation"}, {"score": 0.0046353421974267475, "phrase": "real_and_virtual_worlds"}, {"score": 0.004530794611704416, "phrase": "single-party_communication"}, {"score": 0.004252540146677527, "phrase": "spatial_navigation_dialogs"}, {"score": 0.004032002950217453, "phrase": "research_evidence"}, {"score": 0.003911135156992, "phrase": "different_gender"}, {"score": 0.0038814864204867855, "phrase": "simulated_human-robot_interaction_study"}, {"score": 0.003453928576839383, "phrase": "gendered_communication"}, {"score": 0.0031845067058084583, "phrase": "user's_instructions"}, {"score": 0.00309681702203087, "phrase": "spatial_activities"}, {"score": 0.0029660081705452862, "phrase": "gender_influences"}, {"score": 0.0026457367614424777, "phrase": "fastest_and_most_accurate_completion"}, {"score": 0.002592523232809191, "phrase": "dialoge-based_analysis"}, {"score": 0.002533933007927582, "phrase": "successful_communication"}, {"score": 0.002495608496809594, "phrase": "spatial_descriptions"}, {"score": 0.0023183698048498797, "phrase": "male-male_pairings"}, {"score": 0.0021923400552366777, "phrase": "female_\"disadvantage"}, {"score": 0.002175692350960445, "phrase": "spatial_communication"}, {"score": 0.0021536914682510006, "phrase": "interactive_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "navigation_systems"}], "paper_keywords": [""], "paper_abstract": "Many studies have identified gender differences in communication related to spatial navigation in real and virtual worlds. Most of this research has focused on single-party communication (monologs), such as the way in which individuals either give or follow route instructions. However, very little work has been reported on spatial navigation dialogs and whether there are gender differences in the way that they are conducted. This article will address the lack of research evidence by exploring the dialogs between partners of the same and of different gender in a simulated Human-Robot Interaction study. In the experiments discussed in this article, pairs of participants communicated remotely; in each pair, one participant (the instructor) was under the impression that s/he was giving route instructions to a robot (the follower), avoiding any perception of gendered communication. To ensure the naturalness of the interaction, the followers were given no guidelines on what to say, however, each had to control a robot based on the user's instructions. While many monologe-based studies suggest male superiority in a multitude of spatial activities and domains, this study of dialogs highlights a more complex pattern of results. As anticipated, gender influences task performance and communication. However, the findings suggest that it is the interaction-the combination of gender and role (i.e., instructor or follower)-that has the most significant impact. In particular, pairs of female users/instructors and male \"robots\"/followers are associated with the fastest and most accurate completion of the navigation tasks. Moreover, dialoge-based analysis illustrates how pairs of male users/instructors and female \"robots\"/followers achieved successful communication through \"alignment\" of spatial descriptions. In particular, males seem to adapt the content of their instructions when interacting with female \"robots\"/followers and employ more landmark references compared to female users/instructors or when addressing males (in male-male pairings). This study describes the differences in how males and females interact with the system, and proposes that any female \"disadvantage\" in spatial communication can disappear through interactive mechanisms. Such insights are important for the design of navigation systems that are equally effective for users of either gender.", "paper_title": "Are We There Yet?: The Role of Gender on the Effectiveness and Efficiency of User-Robot Communication in Navigational Tasks", "paper_id": "WOS:000302784500004"}