{"auto_keywords": [{"score": 0.0425458214491714, "phrase": "fam"}, {"score": 0.03383781054834435, "phrase": "fam-hep"}, {"score": 0.009764344977734749, "phrase": "fam-ep"}, {"score": 0.00481495049065317, "phrase": "pattern_classification"}, {"score": 0.004238134740341528, "phrase": "proposed_fam-hep_model"}, {"score": 0.004012815039104406, "phrase": "hep"}, {"score": 0.0036627245728600073, "phrase": "evolutionary_search"}, {"score": 0.0034676182423067307, "phrase": "proposed_fam-hep_network"}, {"score": 0.0033029038236817372, "phrase": "real_medical_diagnosis_problem"}, {"score": 0.002320449502337321, "phrase": "innovative_eann_model"}, {"score": 0.002278440725193307, "phrase": "pattern_classification_problems"}, {"score": 0.0021049977753042253, "phrase": "medical_diagnosis_tasks"}], "paper_keywords": ["Fuzzy ARTMAP", " hybrid evolutionary programming", " pattern classification", " medical diagnosis"], "paper_abstract": "In this paper, an Evolutionary Artificial Neural Network (EANN) that combines the Fuzzy ARTMAP(FAM) network and a Hybrid Evolutionary Programming (HEP) model is introduced. The proposed FAM-HEP model, which combines the strengths of FAM and HEP, is able to construct its network structure autonomously as well as to perform learning and evolutionary search and adaptation concurrently. The effectiveness of the proposed FAM-HEP network is assessed empirically using several benchmark data sets and a real medical diagnosis problem. The performance of FAM-HEP is analyzed, and the results are compared with those of FAM-EP, FAM, and other classification models. In general, the results of FAM-HEP are better than those of FAM-EP and FAM, and are comparable with those from other classification models. The study also reveals the potential of FAM-HEP as an innovative EANN model for undertaking pattern classification problems in general, and a promising computerized decision support tool for tackling medical diagnosis tasks in particular.", "paper_title": "Fuzzy ARTMAP and hybrid evolutionary programming for pattern classification", "paper_id": "WOS:000289195100002"}