{"auto_keywords": [{"score": 0.036269570502132725, "phrase": "rare-pears"}, {"score": 0.0073217346497422885, "phrase": "association_rule_mining"}, {"score": 0.006408165872200876, "phrase": "semi-optimal_intervals"}, {"score": 0.00481495049065317, "phrase": "quantitative_association_rules"}, {"score": 0.004726052718910578, "phrase": "np-hard_problem"}, {"score": 0.004653220443592979, "phrase": "suitable_solutions"}, {"score": 0.004624401316503576, "phrase": "discovery_qars"}, {"score": 0.0045249263666466005, "phrase": "previous_evolutionary_methods"}, {"score": 0.004482949028773004, "phrase": "association_rules"}, {"score": 0.004441359373498799, "phrase": "frequent_dependency"}, {"score": 0.004305481798183612, "phrase": "specific_attention"}, {"score": 0.004109387898181154, "phrase": "proposed_algorithm"}, {"score": 0.003946650265907885, "phrase": "different_length"}, {"score": 0.003561804646511146, "phrase": "frequent_item_sets"}, {"score": 0.003135356056324338, "phrase": "independent_sub-process"}, {"score": 0.0030204580407008188, "phrase": "different_initial_population"}, {"score": 0.0029645930408561086, "phrase": "search_space"}, {"score": 0.0027857115172243226, "phrase": "new_definition"}, {"score": 0.0025137856138000014, "phrase": "ultimate_non-dominated_rules"}, {"score": 0.0024826780747521505, "phrase": "interestingness_and_reliability_measures"}, {"score": 0.0023694065215394593, "phrase": "vast_coverage"}, {"score": 0.002347378595930709, "phrase": "input_dataset"}, {"score": 0.0023039337947957077, "phrase": "ten_algorithms"}, {"score": 0.0021580985506699105, "phrase": "high_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Random permutation", " Multi objective evolutionary algorithms", " Quantitative association rules"], "paper_abstract": "Since finding quantitative association rules (QARs) is an NP-hard problem, evolutionary methods are suitable solutions for discovery QARs. Nevertheless, most of the previous evolutionary methods to discover association rules only consider frequent dependency among items in datasets. They do not pay specific attention to interestingness and non-redundancy as two critical objectives. In this paper, the proposed algorithm (Rare-PEARs) gives a chance to each rule with different length and appearance (antecedent and consequent parts of rules) to be created. Therefore, various interesting, rare or interesting and rare rules can be found. Some of these rules might be uninteresting (those that contain frequent item sets). However, we try to avoid them by Rare-PEARs. To accomplish this goal, our method decomposes the process of association rule mining into N - 1 sub-problems (N is the number of attributes, and each sub-problem is handled by an independent sub-process during Rare-PEARs execution). Each sub-process starts individually with a different initial population. It then explores the search space of its corresponding sub-problem to find rules with semi-optimal intervals for each of the attributes. This process is done by a new definition of Non-Dominated concept. Rare-PEARs uses this definition to find semi-optimal intervals for attributes during the execution of each sub-process. Finally, Rare-PEARs collects QARs from sub-processes and determines the ultimate Non-Dominated rules based on the interestingness and reliability measures. Rare-PEARs tries to maximize three objectives: interestingness, accuracy and reliability while providing vast coverage on the input dataset. We compared Rare-PEARs with ten algorithms (multi-objective, mono-objective and classical algorithms of association rule mining) over several real-world datasets. The results demonstrate high efficiency of Rare-PEARs. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Rare-PEARs: A new multi objective evolutionary algorithm to mine rare and non-redundant quantitative association rules", "paper_id": "WOS:000364249800027"}