{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "one-sided_uncertain_reserve_prices"}, {"score": 0.004660453113061494, "phrase": "agents'_rational_strategies"}, {"score": 0.00456020621016909, "phrase": "incomplete_information"}, {"score": 0.0038527044625533574, "phrase": "heuristic_approaches"}, {"score": 0.0034180189629740426, "phrase": "present_paper"}, {"score": 0.003308195943172624, "phrase": "principal_bargaining_protocol"}, {"score": 0.0028715299874549245, "phrase": "game_theoretic_analysis"}, {"score": 0.002779217021776702, "phrase": "pure_strategy_sequential_equilibria"}, {"score": 0.002347378595930709, "phrase": "negotiation_issues"}, {"score": 0.0023219374444738723, "phrase": "multi-issue_negotiation"}, {"score": 0.0021987994275190314, "phrase": "case_studies"}, {"score": 0.002151388538895855, "phrase": "average_computational_time"}], "paper_keywords": ["Negotiation", " Bargaining", " Autonomous agents", " Equilibrium"], "paper_abstract": "The problem of finding agents' rational strategies in bargaining with incomplete information is well known to be challenging. The literature provides a collection of results for very narrow uncertainty settings, but no generally applicable algorithm. This lack has led researchers to develop heuristic approaches in an attempt to find outcomes that, even if not being of equilibrium, are mutually satisfactory. In the present paper, we focus on the principal bargaining protocol (i.e., the alternating-offers protocol) where there is uncertainty regarding one agent's reserve price. We provide an algorithm based on the combination of game theoretic analysis and search techniques which finds pure strategy sequential equilibria when they exist. Our approach is sound, complete and, in principle, can be applied to other uncertainty settings, e.g., uncertain discount factors, and uncertain weights of negotiation issues in multi-issue negotiation. We experimentally evaluate our algorithm with a number of case studies showing that the average computational time is less than 30 s and at least one pure strategy equilibrium exists in almost all (about 99.7 %) the bilateral bargaining scenarios we have looked at in the paper.", "paper_title": "Bilateral bargaining with one-sided uncertain reserve prices", "paper_id": "WOS:000313866700004"}