{"auto_keywords": [{"score": 0.049442871815077706, "phrase": "english"}, {"score": 0.004814955496311821, "phrase": "solidarity"}, {"score": 0.004311660976562745, "phrase": "medical_research_articles"}, {"score": 0.004240174669610977, "phrase": "spanish"}, {"score": 0.004183751417275573, "phrase": "venezuela"}, {"score": 0.0041560162482534805, "phrase": "spain"}, {"score": 0.00400559360117678, "phrase": "leading_medical_journals"}, {"score": 0.0034338045801881006, "phrase": "ack"}, {"score": 0.003376769321692139, "phrase": "b._cronin's"}, {"score": 0.00318984544993994, "phrase": "chi-square_tests"}, {"score": 0.0030950988205648605, "phrase": "english-language_corpus"}, {"score": 0.002808477620731167, "phrase": "u.s._sample"}, {"score": 0.0026529282690379128, "phrase": "funding_sources"}, {"score": 0.002522830979240594, "phrase": "peers'ideational_input"}, {"score": 0.0024975854002361794, "phrase": "small-scale_ethnographic_research_study"}, {"score": 0.0024643161985886085, "phrase": "spanish_and_venezuelan_researchers"}, {"score": 0.0024396547357855777, "phrase": "firsthand_feedback"}, {"score": 0.0022967713922705, "phrase": "e._goffman"}, {"score": 0.0021049977753042253, "phrase": "communicative_and_sociocultural_conventions"}], "paper_keywords": [""], "paper_abstract": "The purpose of this article is to analyze the acknowledgment (ACK) paratext of medical research articles written in English and Spanish in three geographical contexts: Venezuela, Spain, and the United States of America. We thus randomly selected 150 research articles from leading medical journals in each country. The frequency and length of ACKs, the number of named and unnamed acknowledgees, the reasons why they were acknowledged, the number of grants received, and the sources of funding were recorded. The motivations that underpinned each ACK were classified according to B. Cronin's (1995) and C.L. Giles & I.G. Councill's (2004) typology. Results were analyzed by means of chi-square tests. Our results show that ACKs from the English-language corpus are significantly more frequent and longer than those from both the Spanish and Venezuelan samples. The number of persons acknowledged and the number of grants received also were significantly greater in the U.S. sample than they were in the two Spanish-language corpora. Differences were found in the number and types of funding sources. Moreover, in the three corpora, technical/instrumental assistance was more frequently acknowledged than was peers'ideational input. A small-scale ethnographic research study was conducted with Spanish and Venezuelan researchers to get firsthand feedback on the motivations that could lie behind their ACK behavior. We conclude that \"backstage solidarity\" (E. Goffman, 1959, p. 177; also see B. Cronin & S. Franks, 2006, p. 1915) significantly differs from one context to another, and that the communicative and sociocultural conventions of academic contributorship are not only discipline-dependent but also language- and context-dependent.", "paper_title": "Backstage Solidarity in Spanish- and English-Written Medical Research Papers: Publication Context and the Acknowledgment Paratext", "paper_id": "WOS:000263136200008"}