{"auto_keywords": [{"score": 0.03054070346071615, "phrase": "query_graph"}, {"score": 0.00481495049065317, "phrase": "graph_transformation"}, {"score": 0.004382364826200616, "phrase": "global_transformations"}, {"score": 0.0035361001070845677, "phrase": "induced_subgraph"}, {"score": 0.003251920460276645, "phrase": "graph_isomorphism_problem"}, {"score": 0.0031845067058084583, "phrase": "efficient_solution"}, {"score": 0.0029905104479072482, "phrase": "decision_process"}, {"score": 0.0028378798711397235, "phrase": "\"smaller\"_graph"}, {"score": 0.0027356847952125433, "phrase": "main_lesson"}, {"score": 0.00256895975568914, "phrase": "dominating_factor"}], "paper_keywords": ["seidel switching", " graph algorithms", " complexity", " NP-completeness", " embedding problem", " cyclornatic number"], "paper_abstract": "In the context of graph transformation we look at the operation of switching, which can be viewed as a method for realizing global transformations of (group-labelled) graphs through local transformations of the vertices. In case vertices are given an identity, various relatively efficient algorithms exist for deciding whether a graph can be switched so that it contains some other graph, the query graph, as an induced subgraph. However, when considering graphs up to isomorphism, we immediately run into the graph isomorphism problem for which no efficient solution is known. Surprisingly enough however, in some cases the decision process can be simplified by transforming the query graph into a \"smaller\" graph without changing the answer. The main lesson learned is that the size of the query graph is not the dominating factor, but its cycle rank. Although a number of our results hold specifically for undirected, unlabelled graphs, we propose a more general framework and give many positive and negative results for more general cases, where the graphs are labelled with elements of a (finitely generated abelian) group.", "paper_title": "The embedding problem for switching classes of graphs", "paper_id": "WOS:000243303300006"}