{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "meta-linguistic_axioms"}, {"score": 0.04717487490094824, "phrase": "classical_theory"}, {"score": 0.03758827602955703, "phrase": "meta-linguistic_axiom"}, {"score": 0.03490875733521557, "phrase": "theoretic_axioms"}, {"score": 0.004161553532799662, "phrase": "meta-linguistic_expressions"}, {"score": 0.003775803846431323, "phrase": "fuzzy_disjunctive"}, {"score": 0.003697895355947004, "phrase": "canonical_forms"}, {"score": 0.00266693888510356, "phrase": "basic_equivalences"}, {"score": 0.0025225467103906314, "phrase": "fuzzy_theory"}, {"score": 0.0023043558058824572, "phrase": "new_axioms"}, {"score": 0.0021049977753042253, "phrase": "upper_and_lower_limit"}], "paper_keywords": ["meta-linguistic", ". axioms", " computing", " words", " break-down", " equivalences", " double", " quadruple", " matter of degree"], "paper_abstract": "Meta-linguistic axioms are proposed in analogy to the axioms of classical theory as a foundation for Computing With Words. Consequences of these meta-linguistic expressions are explored in the light of Interval-valued Type-2 Fuzzy Sets. The mapping of meta-linguistic axioms to Fuzzy Disjunctive and Conjunctive Canonical forms generate two set theoretic axioms for each meta-linguistic axiom that is composed of two elements such as commutativity and four set theoretic axioms for each meta-linguistic axiom that is composed of three elements such as associativity as opposed to one axiom that is generated in the classical theory. The set theoretic axioms double or quadruple because the basic equivalences of the classical theory break down in fuzzy theory. In this setting, we become aware that first, these new axioms hold as a matter of degree, and secondly there is an upper and lower limit with which they hold as a matter of degree. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Meta-linguistic axioms as a foundation for computing with words", "paper_id": "WOS:000242509400002"}