{"auto_keywords": [{"score": 0.05007820304388614, "phrase": "china's_leading_e-commerce_company"}, {"score": 0.04957437128338803, "phrase": "alibaba"}, {"score": 0.04665073124497521, "phrase": "user_acceptance"}, {"score": 0.03596176205294269, "phrase": "saas"}, {"score": 0.004425622593245689, "phrase": "software"}, {"score": 0.004129248271757936, "phrase": "empirical_surveys"}, {"score": 0.0034482025128821548, "phrase": "e-service_quality"}, {"score": 0.0029409171055888804, "phrase": "fourth_round"}, {"score": 0.002508073621696602, "phrase": "users'_behavioral_intention"}, {"score": 0.0023408288327263316, "phrase": "engineering_improvements"}, {"score": 0.0022674379203603224, "phrase": "better_understanding"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Software as a Service (SaaS)", " E-service quality", " SaaSQual", " User acceptance"], "paper_abstract": "This paper proposes a model with which to analyze the user acceptance of Software as a Service (SaaS). To develop this model, empirical surveys were conducted through four rounds of questionnaires obtained from customers of China's leading e-commerce company, Alibaba. Firstly, based on the data from the first three rounds (1399 respondents), a SaaSQual of operationalizing perceived e-service quality of SaaS was developed, and its four dimensions (ease of use, security, reliability and responsiveness) were identified. Secondly, based on the data from the fourth round (1532 respondents), it was found that the level of three user perceptions (e-service quality, usefulness, and social influence) were predictive of the users' behavioral intention to use SaaS, and their direct and indirect influences were tested. This study recommends engineering improvements to SaaS based upon a better understanding of the level of user acceptance of this service. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "User acceptance of software as a service: Evidence from customers of China's leading e-commerce company, Alibaba", "paper_id": "WOS:000322351100005"}