{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.004055511503825102, "phrase": "data_aggregation"}, {"score": 0.003953639783762917, "phrase": "considerable_improvements"}, {"score": 0.003829877278269543, "phrase": "energy_performance"}, {"score": 0.00337224813954299, "phrase": "correlation-unaware_data_aggregation_structure"}, {"score": 0.0031242709509664837, "phrase": "shortest-path_tree"}, {"score": 0.0030651710672229926, "phrase": "implicit_benefits"}, {"score": 0.002821685815956478, "phrase": "correlation-aware_structure"}, {"score": 0.002750721367040336, "phrase": "considerable_performance_improvement"}, {"score": 0.002215081186105616, "phrase": "proposed_approach"}, {"score": 0.0021870332034407817, "phrase": "centralized_and_distributed_correlation-aware_and_-unaware_structures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["sensor networks", " data aggregation", " information fusion", " correlation", " data gathering"], "paper_abstract": "Sensors-to-sink data in wireless sensor networks (WSNs) are typically characterized by correlation along the spatial, semantic, and/or temporal dimensions. Exploiting such correlation when performing data aggregation can result in considerable improvements in the bandwidth and energy performance of WSNs. In this paper, we first identify that most of the existing upstream routing approaches in WSNs can be translated to a correlation-unaware data aggregation structure - the shortest-path tree. Although by using a shortest-path tree, some implicit benefits due to correlation are possible, we show that explicitly constructing a correlation-aware structure can result in considerable performance improvement. Toward this end, we present a simple, scalable and distributed correlation-aware aggregation structure that addresses the practical challenges in the context of aggregation in WSNs. Through simulations and analysis, we evaluate the performance of the proposed approach with centralized and distributed correlation-aware and -unaware structures. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "A scalable correlation aware aggregation strategy for wireless sensor networks", "paper_id": "WOS:000257002500005"}