{"auto_keywords": [{"score": 0.048743949861825245, "phrase": "hri"}, {"score": 0.009911694732623029, "phrase": "saudi_arabia"}, {"score": 0.007152347170996232, "phrase": "health-related_information"}, {"score": 0.005719471436697861, "phrase": "ci"}, {"score": 0.0046336476934938356, "phrase": "common_practice"}, {"score": 0.004540971181333244, "phrase": "previous_studies"}, {"score": 0.004432191964546668, "phrase": "public_use"}, {"score": 0.004317273687390536, "phrase": "patients'_perceptions"}, {"score": 0.004137871097440827, "phrase": "self-administered_questionnaire"}, {"score": 0.004038708988720621, "phrase": "male_and_female_outpatients"}, {"score": 0.003998093274031946, "phrase": "public_university_hospital"}, {"score": 0.003981961128716998, "phrase": "riyadh"}, {"score": 0.003958882021920793, "phrase": "health_information"}, {"score": 0.003926007489182479, "phrase": "chi-squared_test"}, {"score": 0.003863018847807536, "phrase": "different_categorical_variables"}, {"score": 0.0038474296170185785, "phrase": "multiple_logistic_regression"}, {"score": 0.0036949431478717158, "phrase": "questionnaire_response"}, {"score": 0.003534154291972591, "phrase": "mean_age"}, {"score": 0.0033059522438528954, "phrase": "hri."}, {"score": 0.003136548717086599, "phrase": "main_reason"}, {"score": 0.0031112662095610405, "phrase": "sheer_curiosity"}, {"score": 0.002910289632356835, "phrase": "forty-four_percent"}, {"score": 0.0024902671358276807, "phrase": "higher_education"}, {"score": 0.002192013212178436, "phrase": "reliable_websites"}, {"score": 0.0021831525536618913, "phrase": "health_authorities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Internet", " Health information", " eHealth", " Information technology"], "paper_abstract": "Background: The use of the Internet to search for health-related information (HRI) has become a common practice worldwide. Our literature review failed to find any evidence of previous studies on this topic from Saudi Arabia. Objective: To determine the public use of the Internet in Saudi Arabia to search for HRI and to evaluate patients' perceptions of the quality of the information available on the Internet compared to that provided by their health care providers. Methods: A self-administered questionnaire about Internet use to search for HRI was distributed randomly to male and female outpatients and visitors attending a public University Hospital in Riyadh, Saudi Arabia from January to May 2010. A Chi-squared test was used to assess the association between different categorical variables. Multiple logistic regression was used to relate the use of the Internet to search for HRI with various socio-demographic variables. Results: The questionnaire response was 80.1%, with completion of 801 of the 1000 distributed questionnaires; 50% (400/801) of respondents were males. The mean age of respondents was 32 +/- 11 years. The majority of respondents used the Internet in general (87.8%), and 58.4% of them (363/622) used the Internet to search for HRI. The majority stated a doctor was their primary source of HRI (89.3%, 654/732). This practice was considered useful by 84.2%, and the main reason behind it was sheer curiosity (92.7%, 418/451). Other reasons included not getting enough information from their doctor (58.5%, 227/413) and not trusting the information given by their doctor (28.2%, 101/443). Forty-four percent (205/466) searched for HRI before coming to the clinic; 72.5% of those discussed the information with their doctors and 71.7% (119/166) of those who did so believed that this positively affected their relationship with their doctor. Searching the Internet for health information was observed more frequently among the 30-39 year age group (OR = 2.0, 95% CI 1.1-3.7), females (OR = 3.8, 95% CI 2.3-6.4), individuals with university or higher education (OR = 1.7, 95% CI 1.1-2.8), employed individuals (OR = 2.7, 95% CI 1.4-4.9) and high income groups (OR = 2.8, 95% CI 1.5-5.1). Conclusions: A proportion of the public searches the Internet to obtain HRI for various reasons, which could have consequences on their health and relationship with their doctors. Therefore, doctors should be aware of the health information available online to help guide patients to reliable websites. Health authorities should also be aware of the issue to offer regulations and solutions. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Internet use by the public to search for health-related information", "paper_id": "WOS:000303607800001"}