{"auto_keywords": [{"score": 0.04745358435978179, "phrase": "database_model"}, {"score": 0.004301834610818624, "phrase": "clinical_evaluations"}, {"score": 0.004261617028111862, "phrase": "patients'_information"}, {"score": 0.00375395061615019, "phrase": "voice_and_speech_disorders"}, {"score": 0.003598493358292752, "phrase": "marseilles"}, {"score": 0.0034984340449789745, "phrase": "aix-en-provence"}, {"score": 0.0030525578912808647, "phrase": "largest_corpora"}, {"score": 0.0030239842475439814, "phrase": "\"pathological\"_speech"}, {"score": 0.0028580564897994175, "phrase": "physiological_data"}, {"score": 0.0028047899594686003, "phrase": "oral_airflow"}, {"score": 0.002778529097886437, "phrase": "estimated_sub-glottal_pressure"}, {"score": 0.002726740692380339, "phrase": "acoustic_recordings"}, {"score": 0.0025053520095236694, "phrase": "physiological_and_clinical_data"}, {"score": 0.002291089893848235, "phrase": "technical_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Voice/speech disorders", " Dysphonia", " Dysarthria", " Database", " Clinical phonetics"], "paper_abstract": "The aim of this contribution is to propose a database model designed for the storage and accessibility of various speech disorder data including signals, clinical evaluations and patients' information. This model is the result of 15 years of experience in the management and the analysis of this type of data. We present two important French corpora of voice and speech disorders that we have been recording in hospitals in Marseilles (MTO corpus) and Aix-en-Provence (AHN corpus). The population consists of 2500 dysphonic, dysarthric and control subjects, a number of speakers which, as far as we know, constitutes currently one of the largest corpora of \"pathological\" speech. The originality of this data lies in the presence of physiological data (such as oral airflow or estimated sub-glottal pressure) associated with acoustic recordings. This activity led us to raise the question of how we can manage the sound, physiological and clinical data of such a large quantity of data. Consequently, we developed a database model that we present here. Recommendations and technical solutions based on MySQL, a relational database management system, are discussed. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "How to manage sound, physiological and clinical data of 2500 dysphonic and dysarthric speakers?", "paper_id": "WOS:000302756600008"}