{"auto_keywords": [{"score": 0.010435419423864629, "phrase": "gnutella"}, {"score": 0.008643059210615863, "phrase": "mobile_ad_hoc_network"}, {"score": 0.0077423844116593, "phrase": "manet."}, {"score": 0.005449873461670833, "phrase": "neighbor_peers"}, {"score": 0.0045284072672385975, "phrase": "robust_and_distributed_architecture"}, {"score": 0.004241451614311598, "phrase": "existing_approaches"}, {"score": 0.003972607172518598, "phrase": "nodes'_limited_radio_range"}, {"score": 0.0037207397635410327, "phrase": "overlay_layer"}, {"score": 0.00357146811369898, "phrase": "implicit_application-layer"}, {"score": 0.003428164968038292, "phrase": "eal"}, {"score": 0.003250403288147613, "phrase": "ial_approach"}, {"score": 0.002970260970134645, "phrase": "peer_p"}, {"score": 0.0029100272315053253, "phrase": "lower_bound_value"}, {"score": 0.002583931950389087, "phrase": "eal_approach"}, {"score": 0.002322689143237591, "phrase": "merging_operation"}, {"score": 0.002294294558114909, "phrase": "exl_approach"}, {"score": 0.002266246304762945, "phrase": "address_auto-configuration_protocol"}, {"score": 0.0021223334214910006, "phrase": "overall_exl_approach"}], "paper_keywords": ["Merging", " P2P", " overlays", " MANET", " cross-layer design", " addrcss autoconfiguration"], "paper_abstract": "Peer-to-peer (P2P) network is a robust and distributed architecture of sharing resources. Recently, several approaches have been proposed for P2P networks over MANET. The existing approaches for P2P networks over MANETs do not consider the merging of P2P networks which occurs due to nodes' limited radio range and nodes' mobility. This paper designs three approaches to detect and merge P2P networks at overlay layer in mobile ad hoc network (MANET). These approaches are implicit application-layer (IAL), explicit application-layer (EAL) and explicit cross-layer (EXL) approaches. In IAL approach, the following property of Gnutella is used to merge P2P networks. In Gnutella, when the number of neighbor peers of a peer P drops lower than the lower bound value, the peer? starts to connect with other peers. So during this phase in Gnutella, a peer may connect with neighbor peers of another P2P network partition. In EAL approach, one peer is used as a root-peer which identifies the P2P network. So when a peer detects more than one root-peer in the network, the peer invokes merging operation. In EXL approach, an address auto-configuration protocol is extended to merge the P2P overlays over MANET. By simulation, we show that overall EXL approach outperforms other two approaches in term of routing overhead and false-negative ratio for both structured and unstructured P2P networks.", "paper_title": "Merging of P2P Overlays Over Mobile Ad Hoc Network: Evaluation of Three Approaches", "paper_id": "WOS:000352333400002"}