{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "novel_automatic_image_annotation_model"}, {"score": 0.0044237033788643715, "phrase": "associated_text"}, {"score": 0.004173244935967375, "phrase": "corresponding_web_images"}, {"score": 0.004000010693331517, "phrase": "selected_labels"}, {"score": 0.003773449694108617, "phrase": "noisy_labels"}, {"score": 0.0036553070575015344, "phrase": "potential_word"}, {"score": 0.003578600071301459, "phrase": "web_image-word_relationships"}, {"score": 0.0035408501923902477, "phrase": "mixture_gaussian_distribution_model"}, {"score": 0.0031845067058084583, "phrase": "sematic_relevance"}, {"score": 0.003101153870424188, "phrase": "visual_feature_similarity"}, {"score": 0.0025892330566358503, "phrase": "word_promotion"}, {"score": 0.0021731423856364003, "phrase": "satisfactory_performance"}, {"score": 0.0021274723597955567, "phrase": "system_scalability"}, {"score": 0.0021049977753042253, "phrase": "sematic_evolution"}], "paper_keywords": ["Image annotation", " web mining", " Gaussian model"], "paper_abstract": "In this paper, we propose a novel automatic image annotation model by mining the web. In our approach, the terms or words appearing in the associated text are extracted and filtered as labels or annotations for the corresponding web images. Sure, much noise exists in those selected labels. In order to reduce the influence caused by the noisy labels, for each label or potential word, we improve web image-word relationships using Mixture Gaussian Distribution Model. By doing so, the relationships between words and images are re-weighted both in terms of sematic relevance and in terms of visual feature similarity. In fact, all the words associated to an image are not semantically independent. We use co-occurrences between two words to describe their semantic relevance. Thus, we further use a method, called Word Promotion, to co-enhance the weights of all the words associated to a given image based on their co-occurrences. Our experiments are conducted in several ways and the results show that our annotation method can achieve a satisfactory performance in respects of system scalability and sematic evolution.", "paper_title": "FILTERING TERMS FROM THE WEB FOR IMAGE ANNOTATIONS", "paper_id": "WOS:000317135900005"}