{"auto_keywords": [{"score": 0.009006845922343394, "phrase": "upstream_permutations"}, {"score": 0.00481495049065317, "phrase": "optimal_mimd_queueless_routing"}, {"score": 0.00465798570297277, "phrase": "offline_routing"}, {"score": 0.004635981859938416, "phrase": "arbitrary_permutations"}, {"score": 0.004581423845101698, "phrase": "mimd_queueless_communication_constraints"}, {"score": 0.004359173705488354, "phrase": "e-cube_routing"}, {"score": 0.004257146120217963, "phrase": "worst_cases"}, {"score": 0.004217004035331687, "phrase": "n-dimensional_hypercube"}, {"score": 0.0041280571349487545, "phrase": "general_case"}, {"score": 0.0039557298818491205, "phrase": "particular_cases"}, {"score": 0.0038357455009733654, "phrase": "k-partitioning_paradigm"}, {"score": 0.0038085757099590323, "phrase": "maximum_matching"}, {"score": 0.0037905691110090875, "phrase": "bipartite_graphs"}, {"score": 0.0037282113054951027, "phrase": "recursive_structure"}, {"score": 0.0037018003824739625, "phrase": "hypercube_topology"}, {"score": 0.003423300183616815, "phrase": "k_hops"}, {"score": 0.0033669638170432843, "phrase": "n_-_k_hops"}, {"score": 0.0032570481253401807, "phrase": "upstream_permutation_routable"}, {"score": 0.0032416406134314663, "phrase": "k_steps"}, {"score": 0.003180733665675691, "phrase": "n_-_k_steps"}, {"score": 0.0028117158265039107, "phrase": "exactly_three_classes"}, {"score": 0.0026185759407265047, "phrase": "formal_proof"}, {"score": 0.002212575360988711, "phrase": "downstream_permutations"}], "paper_keywords": ["Interconnection network", " Hypercube", " Permutation", " Routing", " Maximum matching of bipartite graph", " Graph partitioning"], "paper_abstract": "This paper addresses the problem of the offline routing of arbitrary permutations on hypercubes under the MIMD queueless communication constraints which imposes that only one message can be located in each node of the hypercube right through the routing. According to e-cube routing, this kind of communication may require in the worst cases at least n exchanges steps on an n-dimensional hypercube. It has been conjectured that in the general case n steps suffice. The conjecture has been proved either by enumeration or by program for the particular cases of n <= 3. We revisit the problem through the k-partitioning paradigm based on maximum matching of bipartite graphs concept to take advantage of the recursive structure of the hypercube topology. The paradigm consists in looking for each message a transition node distant of at most say k < n hops from its current node such that all the messages can be routed to their transition nodes in k hops then finally routed to their final destination nodes in n - k hops on two disjoints hypercubes. In others words, the paradigm consists to determine an upstream permutation routable in k steps and which leads to two independent downstream permutations routable in n - k steps on two disjoint hypercubes. With this purpose, we give a characterization of the non-1-partitionable permutations from which the proof of the conjecture comes straightforwardly for n <= 2 and the non-1-partitionable permutations can be built whatever n may be. For n = 3, we thus confirm the existence of exactly three classes of non-1-partitionable permutations and prove that there are two classes of upstream permutations to avoid when 2-partitioning any non-1-partitionable permutation. The process to avoid such upstream permutations is presented, and leads to a formal proof of the conjecture for n = 3. For n > 3, experiences gained in routing permutations on 4D-hypercubes allow conjecturing that in these cases, too, any non-1-partitionable permutation is 2-partitionable. Indeed, the analysis carried out for the 3D-hypercubes is repeatable to identify, certainly more laboriously given their combinatory, the upstream permutations to avoid when 2-partitioning a non-1-partitionable permutation on a 4D-hypercube. The proof that resulting downstream permutations on a 3D-hypercube can be routed in 2 steps is a consequence of the fact that for n = 2 and 3 any permutation on a nD-hypercube can be routed in n steps.", "paper_title": "Towards understanding optimal MIMD queueless routing of arbitrary permutations on hypercubes", "paper_id": "WOS:000308110100001"}