{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "total_chromatic_number"}, {"score": 0.01245474049749898, "phrase": "cubic_graphs"}, {"score": 0.004624337472244542, "phrase": "k_colors"}, {"score": 0.004441236717408874, "phrase": "adjacent_and_incident_elements"}, {"score": 0.004172360444377281, "phrase": "least_k"}, {"score": 0.003992398585366955, "phrase": "rosenfeld"}, {"score": 0.0039053194919285725, "phrase": "cubic_graph"}, {"score": 0.00328562353036406, "phrase": "cavicchioli"}, {"score": 0.0024660058541899647, "phrase": "even_vertex_number"}, {"score": 0.0023507916951658455, "phrase": "computer_search_showing"}, {"score": 0.00224094835951312, "phrase": "induced_chordless_cycle"}], "paper_keywords": ["snark", " total-coloring", " edge-coloring"], "paper_abstract": "A k-total-coloring of G is an assignment of k colors to the edges and vertices of G, so that adjacent and incident elements have different colors. The total chromatic number of G, denoted by chi(T)(G), is the least k for which G has a k-total-coloring. It was proved by Rosenfeld that the total chromatic number of a cubic graph is either 4 or 5. Cubic graphs with chi(T) = 4 are said to be Type 1, and cubic graphs with chi(T) = 5 are said to be Type 2. Snarks are cyclically 4-edge-connected cubic graphs that do not allow a 3-edge-coloring. In 2003, Cavicchioli et al. asked for a Type 2 snark with girth at least 5. As neither Type 2 cubic graphs with girth at least 5 nor Type 2 snarks are known, this is taking two steps at once, and the two requirements of being a snark and having girth at least 5 should better be treated independently. In this paper we will show that the property of being a snark can be combined with being Type 2. We will give a construction that gives Type 2 snarks for each even vertex number n >= 40. We will also give the result of a computer search showing that among all Type 2 cubic graphs on up to 32 vertices, all but three contain an induced chordless cycle of length 4. These three exceptions contain triangles. The question of the existence of a Type 2 cubic graph with girth at least 5 remains open.", "paper_title": "Snarks with total chromatic number 5", "paper_id": "WOS:000365862100008"}