{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "joost"}, {"score": 0.004595356579614969, "phrase": "iptv_applications"}, {"score": 0.004447600571127578, "phrase": "potential_approach"}, {"score": 0.004406260054779782, "phrase": "online_broadcasting"}, {"score": 0.0042645588725322295, "phrase": "pplive"}, {"score": 0.004166129789627063, "phrase": "sopcast"}, {"score": 0.003920674807745575, "phrase": "latest_systems"}, {"score": 0.0037768417338850274, "phrase": "video-on-demand_and_real-time_services"}, {"score": 0.0035542408902458677, "phrase": "traffic_profiles"}, {"score": 0.0034559594248079807, "phrase": "key_limitations"}, {"score": 0.0033447157263095223, "phrase": "main_purpose"}, {"score": 0.003003726508522467, "phrase": "underlying_mechanisms"}, {"score": 0.0028133741785871867, "phrase": "real-time_services"}, {"score": 0.0026974065918918275, "phrase": "close_investigation"}, {"score": 0.0025028892126605124, "phrase": "data_tracing"}], "paper_keywords": ["P2P streaming", " Traffic characterisation", " Joost"], "paper_abstract": "Peer-to-Peer (P2P) IPTV applications have increasingly been considered as a potential approach to online broadcasting. Recently, many applications such as PPlive, PPStream, and Sopcast have been deployed to deliver live streaming via P2P. One of the latest systems is Joost, which can deliver both Video-on-Demand and Real-Time services. Measuring and characterizing this application in terms of signaling overheads and traffic profiles helps to better understand the key limitations of current P2P IPTV systems. Therefore, the main purpose of this paper is firstly to study the impact of Joost on the network. Secondly, we wish to determine the underlying mechanisms of Joost, distinguishing between the Video-on-Demand and the Real-time services. Our study is carried out through a close investigation and analysis on the traffic of Joost in two types of streaming. Based upon the data tracing and collection, many different statistics have been derived. Our study unveils strengths (e.g. good resilience to end-to-end delay and jitter) and shortcomings (e.g. poor locality) and yields recommendations for future P2P IPTV systems.", "paper_title": "Characterization of signaling and traffic in Joost", "paper_id": "WOS:000284090400007"}