{"auto_keywords": [{"score": 0.03393352605218876, "phrase": "conflict_management"}, {"score": 0.010612387000973441, "phrase": "business_simulations"}, {"score": 0.009924861412407207, "phrase": "simulation_experience"}, {"score": 0.009749091094846537, "phrase": "automobile_industry"}, {"score": 0.00957640357839133, "phrase": "entrepreneurial_attitude"}, {"score": 0.00477190623242136, "phrase": "purpose_-_the_purpose"}, {"score": 0.004208002469225673, "phrase": "conflict_management_learning"}, {"score": 0.003987126862293129, "phrase": "business_management_and_administration"}, {"score": 0.003951569411632419, "phrase": "economics"}, {"score": 0.003660788124282824, "phrase": "structured_questionnaire"}, {"score": 0.003628024127607343, "phrase": "findings_-_results"}, {"score": 0.003531474887552889, "phrase": "positive_results"}, {"score": 0.003499864176875713, "phrase": "personal_control"}, {"score": 0.003044455555031339, "phrase": "business_game"}, {"score": 0.0028715299874549245, "phrase": "realistic_business_management_experience"}, {"score": 0.0027328817607818207, "phrase": "simulation_tools"}, {"score": 0.002708399936381754, "phrase": "educational_programs"}, {"score": 0.0025202582748972122, "phrase": "complementary_activities"}, {"score": 0.00247529638625566, "phrase": "real_agents"}, {"score": 0.002398529964696261, "phrase": "cooperative_attitudes"}, {"score": 0.0022419349154472806, "phrase": "intensive_and_relentless_relationships"}, {"score": 0.0022118619998034742, "phrase": "relatively_long_period"}], "paper_keywords": ["Entrepreneurialism", " Simulation", " Conflict management", " Learning", " Automotive industry"], "paper_abstract": "Purpose - The purpose of this paper is to elucidate the influence that participation in a simulation experience based on the automobile industry has on the entrepreneurial attitude (entrepreneurship attitude orientation) through conflict management learning. Design/methodology/approach - The sample used in this paper consists of 427 advanced undergraduate students majoring in Business Management and Administration, Economics, Tourism and Research, and Marketing. The data are collected by means of a structured questionnaire. Findings - Results show that the simulation experience increases positive results for personal control and self-esteem indicating that the participants applied the knowledge learned in the simulation improving their perception of control and conflict management approaches. Research limitations/implications - The paper is focused on a business game based on the automobile industry in order to involve the participants into a realistic business management experience. Practical implications - Results encourage the incorporation of these simulation tools into educational programs related to entrepreneurship. Business simulations improves conflict management within and between groups, especially in the complementary activities and negotiations with real agents, it also fosters motivation and cooperative attitudes. Originality/value - This paper contributes to increase knowledge in conflict management for workgroups maintaining intensive and relentless relationships over a relatively long period of time in which the simulation develops. At a more practical level, experience on conflict management generates acceptance of the conflict as a part of the decisions making process, which improves the entrepreneurial attitude for all participants.", "paper_title": "Entrepreneurial attitude and conflict management through business simulations", "paper_id": "WOS:000272410700006"}