{"auto_keywords": [{"score": 0.047524308711391836, "phrase": "nursing_activities"}, {"score": 0.020950902911328013, "phrase": "rfid"}, {"score": 0.00481495049065317, "phrase": "nursing_activity"}, {"score": 0.004727837281331949, "phrase": "rfid._purpose_-_this"}, {"score": 0.004600100053651545, "phrase": "recognition_system"}, {"score": 0.004374772264092067, "phrase": "radio_frequency_identification"}, {"score": 0.004237138632255772, "phrase": "patient_privacy"}, {"score": 0.00419861271409079, "phrase": "practical_nursing_care_environments"}, {"score": 0.003711409222544974, "phrase": "pattern_classification_algorithm"}, {"score": 0.003660879039645457, "phrase": "support_vector_machine"}, {"score": 0.0036275736378775757, "phrase": "filtering_methodology"}, {"score": 0.003356396922662246, "phrase": "filtering_algorithm"}, {"score": 0.0031339552246625463, "phrase": "short_execution_times"}, {"score": 0.0030076088903023034, "phrase": "low_recognition_accuracy"}, {"score": 0.0027322025124213566, "phrase": "training_system"}, {"score": 0.002527788827701828, "phrase": "individual_activities"}], "paper_keywords": ["Classification", " Behavior", " Measurement", " Signal processing", " Sensors", " Activity", " Filtering"], "paper_abstract": "Purpose - This paper aims to construct a recognition system of nursing activities. Design/methodology/approach - The authors used accelerometers and radio frequency identification (RFID) tags to ensure patient privacy in practical nursing care environments. The accelerometers were attached to the body of the nurse, and the RFID was attached to apparatuses and objects. In addition, a pattern classification algorithm using a support vector machine and filtering methodology were applied. Findings - The accuracy using accelerometers and RFID was 73 percent. When the filtering algorithm was applied, the results were 79 percent. The results showed that activities with short execution times or those that resembled others in posture had low recognition accuracy. Research limitations/implications - Activities requiring only a short period of time tend to be misrecognized. Practical implications - It is possible to construct a training system for nursing activities with the system that recognizes the sequence of nursing activities and how much time is spent for individual activities. Originality/value - The originality of the paper is to construct the system that considers the following characteristics of nursing activities: about 13 activities that are fundamental for nurses can be recognized, privacy of the patient is considered, several activities utilizing only part of the body (not whole body) can be recognized, and activities involving and not involving some types of apparatus can be recognized.", "paper_title": "Recognition of nursing activity with accelerometers and RFID", "paper_id": "WOS:000327368800006"}