{"auto_keywords": [{"score": 0.041346674528199574, "phrase": "per-slot_statistics"}, {"score": 0.004611369021812453, "phrase": "distributed_channel_access"}, {"score": 0.004488505301335364, "phrase": "fairly_mature_research_area"}, {"score": 0.003985487777785535, "phrase": "edca_operation"}, {"score": 0.003158776195052182, "phrase": "different_slots"}, {"score": 0.0027001292153471202, "phrase": "novel_modeling_methodology"}, {"score": 0.0025440911575156755, "phrase": "fixed-point_computation"}, {"score": 0.0023841092222805253, "phrase": "proposed_approach"}, {"score": 0.00235843888868088, "phrase": "high_accuracy"}, {"score": 0.002295463032589125, "phrase": "access_operations"}, {"score": 0.0021863046959469863, "phrase": "delay_performance"}, {"score": 0.0021049977753042253, "phrase": "low-level_performance_metrics"}], "paper_keywords": ["MAC model", " quality of service", " WLAN"], "paper_abstract": "Analytical modeling of the 802.11e enhanced distributed channel access (EDCA) mechanism is today a fairly mature research area, considering the very large number of papers that have appeared in the literature. However, most work in this area models the EDCA operation through per-slot statistics, namely probability of transmission and collisions referred to \"slots.\" In so doing, they still share a methodology originally proposed for the 802.11 Distributed Coordination Function (DCF), although they do extend it by considering differentiated transmission/collision probabilities over different slots. We aim to show that it is possible to devise 802.11e models that do not rely on per-slot statistics. To this purpose, we introduce and describe a novel modeling methodology that does not use per-slot transmission/collision probabilities, but relies on the fixed-point computation of the whole (residual) backoff counter distribution occurring after a generic transmission attempt. The proposed approach achieves high accuracy in describing the channel access operations, not only in terms of throughput and delay performance, but also in terms of low-level performance metrics.", "paper_title": "Rethinking the IEEE 802.11e EDCA Performance Modeling Methodology", "paper_id": "WOS:000276685300016"}