{"auto_keywords": [{"score": 0.04890933270671448, "phrase": "personnel_resources"}, {"score": 0.015490639427762434, "phrase": "technical_resources"}, {"score": 0.012985419068863911, "phrase": "sisp"}, {"score": 0.008713768692145006, "phrase": "strategic_information_systems"}, {"score": 0.008013329998654355, "phrase": "environmental_uncertainty"}, {"score": 0.003911253966141701, "phrase": "greater_planning_success"}, {"score": 0.0037967593942595233, "phrase": "expected_relationships"}, {"score": 0.0036133077234252633, "phrase": "planning_activities"}, {"score": 0.0028484940955893134, "phrase": "postal_survey"}, {"score": 0.002618278365749875, "phrase": "data_security_planning"}, {"score": 0.0023245146355917626, "phrase": "potential_impact"}, {"score": 0.0021049977753042253, "phrase": "sisp_success"}], "paper_keywords": ["strategic IS planning", " strategic IS planning effectiveness", " heterogeneity", " hostility", " data security"], "paper_abstract": "Environmental uncertainty is believed to influence strategic information systems planning (SISP). Research suggests that more such uncertainty would prompt more SISP, and that more SISP would produce greater planning success. This study tested those expected relationships. A questionnaire defined SISP in terms of the planning activities for technical resources, personnel resources, and data security. It measured environmental uncertainty as heterogeneity and hostility where hostility consisted of scarcity and competition. It assessed planning success as a second order construct composed of alignment, analysis, cooperation, and improvement in capabilities. A postal survey collected data from 161 IS executives. Constructs were extensively validated. Heterogeneity predicted personnel resources and data security planning. Scarcity predicted technical and personnel resources planning. Technical and personnel resources planning predicted planning success. The research contributed by highlighting the potential impact of heterogeneity and hostility on SISP, and that of technical resources, personnel resources, and data security planning on SISP success.", "paper_title": "The effectiveness of strategic information systems planning for technical resources, personnel resources, and data security in environments of heterogeneity and hostility", "paper_id": "WOS:000246678000005"}