{"auto_keywords": [{"score": 0.04930986456658361, "phrase": "cellular_machine"}, {"score": 0.03084720274853471, "phrase": "sipina_method"}, {"score": 0.00481495049065317, "phrase": "general_architecture"}, {"score": 0.004464326432401002, "phrase": "induction_graphs"}, {"score": 0.004252469672259375, "phrase": "symbolic_rules"}, {"score": 0.003985487777785535, "phrase": "non_relevant_variables"}, {"score": 0.003370565320453525, "phrase": "computing_time"}, {"score": 0.002714779217561487, "phrase": "machine_learning"}, {"score": 0.002599763359352916, "phrase": "automatic_retrieval"}, {"score": 0.0023970487263732737, "phrase": "knowledge_post-processing"}, {"score": 0.002270745003370529, "phrase": "extracted_knowledge"}, {"score": 0.0021049977753042253, "phrase": "medical_diagnosis"}], "paper_keywords": ["symbolic system", " induction graph", " automatic training", " cellular automaton", " rule extraction", " medical diagnosis"], "paper_abstract": "In this article we present the general architecture of a cellular machine, which makes it possible to reduce the size of induction graphs, and to optimize automatically the generation of symbolic rules. Our objective is to propose a tool for detecting and eliminating non relevant variables from the database. The goal, after acquisition by machine learning from a set of data, is to reduce the complexity of storage, thus to decrease the computing time. The objective of this work is to experiment a cellular machine for systems of inference containing rules. Our system relies upon the graphs generated by the SIPINA method. After an introduction aiming at positioning our contribution within the area of machine learning, we briefly present the SIPINA method for automatic retrieval of knowledge starting from data. We then describe our cellular system and the phase of knowledge post-processing, in particular the validation and the use of extracted knowledge. The presentation of our system is mostly done through an example taken from medical diagnosis.", "paper_title": "Knowledge discovery in database: Induction graph and cellular automaton", "paper_id": "WOS:000246875700004"}