{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "content-based_art_recommender"}, {"score": 0.0336945389005389, "phrase": "cultural_heritage_domain"}, {"score": 0.004638195656547484, "phrase": "increased_access"}, {"score": 0.004362786303912385, "phrase": "user-adaptive_art_recommender_systems"}, {"score": 0.004260134699483774, "phrase": "art_content"}, {"score": 0.0034497831301482144, "phrase": "user_trust"}, {"score": 0.003391556348707911, "phrase": "content-based_recommender_systems"}, {"score": 0.003357091486708983, "phrase": "between-subject_experiment"}, {"score": 0.003157510936118389, "phrase": "recommender_system"}, {"score": 0.002479150189700726, "phrase": "increased_acceptance"}, {"score": 0.0021705796895687864, "phrase": "recommender_systems"}, {"score": 0.0021049977753042253, "phrase": "study's_results"}], "paper_keywords": ["User-adaptivity", " Human-computer interaction", " Recommender systems", " Transparency", " Trust", " Acceptance", " Cultural heritage"], "paper_abstract": "The increasing availability of (digital) cultural heritage artefacts offers great potential for increased access to art content, but also necessitates tools to help users deal with such abundance of information. User-adaptive art recommender systems aim to present their users with art content tailored to their interests. These systems try to adapt to the user based on feedback from the user on which artworks he or she finds interesting. Users need to be able to depend on the system to competently adapt to their feedback and find the artworks that are most interesting to them. This paper investigates the influence of transparency on user trust in and acceptance of content-based recommender systems. A between-subject experiment (N = 60) evaluated interaction with three versions of a content-based art recommender in the cultural heritage domain. This recommender system provides users with artworks that are of interest to them, based on their ratings of other artworks. Version 1 was not transparent, version 2 explained to the user why a recommendation had been made and version 3 showed a rating of how certain the system was that a recommendation would be of interest to the user. Results show that explaining to the user why a recommendation was made increased acceptance of the recommendations. Trust in the system itself was not improved by transparency. Showing how certain the system was of a recommendation did not influence trust and acceptance. A number of guidelines for design of recommender systems in the cultural heritage domain have been derived from the study's results.", "paper_title": "The effects of transparency on trust in and acceptance of a content-based art recommender", "paper_id": "WOS:000260379400004"}