{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "users'_watching_behavior"}, {"score": 0.004546755482549647, "phrase": "higher_quality_video_services"}, {"score": 0.004313996835376177, "phrase": "open_source_codes"}, {"score": 0.003864960628253737, "phrase": "reverse_engineering"}, {"score": 0.0037201746378033988, "phrase": "china"}, {"score": 0.0034790978593553794, "phrase": "measured_buffer_messages"}, {"score": 0.003332537728389913, "phrase": "uploading-only_peers"}, {"score": 0.003253791343615811, "phrase": "smooth-watching_peers"}, {"score": 0.002873247913129334, "phrase": "previous_work"}, {"score": 0.002845883666777154, "phrase": "vod_systems"}, {"score": 0.0026742419973883134, "phrase": "network_sharing"}, {"score": 0.0025861368747446324, "phrase": "randomly-seeking_peers"}, {"score": 0.0024534993283766332, "phrase": "simple_mathematical_model"}, {"score": 0.0023388183537341213, "phrase": "watching_index"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["P2P", " VoD", " File dissemination system", " Peers' watching behavior", " Network sharing"], "paper_abstract": "P2P-based Video on Demand (P2P VoD) systems can provide higher quality video services than P2P live systems. However, owing to the unavailability of open source codes, the characteristics of P2P VoD systems have not been fully explored. For this purpose, in this paper, we first implemented reverse engineering to the protocols of two most popular VoD systems used in China. Peers' watching behavior and network sharing were then studied through the measured buffer messages. Based on our study, we found that uploading-only peers were more than downloading peers, and smooth-watching peers were more than randomly-seeking peers in the current P2P VoD systems. This finding is significantly different from the existing P2P-based file dissemination systems and the results obtained in the previous work on VoD systems. Furthermore, this study revealed the relations between watching behavior and network sharing. It has been observed that randomly-seeking peers will provide more regular as well as rare chunks than smooth-watching peers. A simple mathematical model was established to analytically demonstrate the relation between the watching index (WI) distribution and network-sharing profile, and this relation was also validated by our measured data. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Measurement-based study on the relation between users' watching behavior and network sharing in P2P VoD systems", "paper_id": "WOS:000274825800003"}