{"auto_keywords": [{"score": 0.04427043267830494, "phrase": "client's_control"}, {"score": 0.009479597862022784, "phrase": "vendor's_trust"}, {"score": 0.00481495049065317, "phrase": "offshore_information_systems_outsourcing"}, {"score": 0.004563427013973105, "phrase": "clients'_perspective"}, {"score": 0.0043482604833437735, "phrase": "vendors'_trust"}, {"score": 0.003990385737207714, "phrase": "vendor's_performance"}, {"score": 0.0038846843242954935, "phrase": "japan-china_offshoring_context"}, {"score": 0.0036816256017186753, "phrase": "chinese"}, {"score": 0.0034890505116128606, "phrase": "significant_effect"}, {"score": 0.003451766520526601, "phrase": "project_quality"}, {"score": 0.003378385493203297, "phrase": "cost_adherence"}, {"score": 0.0030834712590249863, "phrase": "information_sharing"}, {"score": 0.002985631781749091, "phrase": "inter-firm_adaptation"}, {"score": 0.0025137856138000014, "phrase": "key_contributions"}, {"score": 0.002382182688788248, "phrase": "vendor_performance"}, {"score": 0.0021975548867457623, "phrase": "formal_contracts"}], "paper_keywords": ["Offshore outsourcing", " Vendors' perspectives", " Trust", " Control", " Partnership relationship"], "paper_abstract": "Whereas most discussion of outsourcing has concentrated on the clients' perspective, we investigated the formation of offshore IS vendors' trust in their client and the client's control over the vendor; these were assumed to affect the vendor's performance. Focusing on the Japan-China offshoring context, we conducted a survey of 110 project managers in nine Chinese IS outsourcers. Our findings indicated that trust had a significant effect on project quality but little on cost adherence; the relationship between control and the two vendor performance measures were the opposite of this. Furthermore, information sharing, communication quality, and inter-firm adaptation emerged as three significant contributors to the vendor's trust in the client: goal setting and Cultural blending turned out to be significant in influencing the client's control over the vendor. One of the key contributions and implications of our research was that certain offshore client behaviors could shape vendor performance by influencing the vendor's trust in the client and client's control over the vendor, beyond formal contracts. These findings may be useful for both offshore vendors and clients in developing successful IS outsourcing. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Vendors' perspectives on trust and control in offshore information systems outsourcing", "paper_id": "WOS:000260289100009"}