{"auto_keywords": [{"score": 0.04050682946398319, "phrase": "multitasking_behaviours"}, {"score": 0.009763546950949935, "phrase": "multitasking"}, {"score": 0.00481495049065317, "phrase": "positive_characteristic"}, {"score": 0.00475924837336259, "phrase": "mounting_evidence"}, {"score": 0.004704187604192605, "phrase": "digital_devices"}, {"score": 0.004622783000449884, "phrase": "negative_impacts"}, {"score": 0.0045959609346817535, "phrase": "task_performance"}, {"score": 0.00451642066363115, "phrase": "cognitive_processes"}, {"score": 0.0042984213731950115, "phrase": "real_learning_contexts"}, {"score": 0.004187284711626886, "phrase": "students'_task"}, {"score": 0.003893360681687065, "phrase": "key_task"}, {"score": 0.0037161295884407626, "phrase": "self-directed_learning"}, {"score": 0.003557283483525861, "phrase": "custom_monitoring_system"}, {"score": 0.0034451133309525528, "phrase": "self-directed_study"}, {"score": 0.003415137969569376, "phrase": "open-access_computer_laboratory"}, {"score": 0.003259604990188875, "phrase": "time_segments"}, {"score": 0.002926447931147561, "phrase": "focused_or_sequential_behaviours"}, {"score": 0.002435453488008121, "phrase": "alternate_behaviour"}, {"score": 0.002421291757425244, "phrase": "sequential_behaviour"}, {"score": 0.002351705899181029, "phrase": "transitional_state"}, {"score": 0.0021927323694667694, "phrase": "potential_effects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Teaching/learning strategies", " Human-computer interface", " Interactive learning environments", " Multimedia/hypermedia systems"], "paper_abstract": "Traditionally viewed as a positive characteristic, there is mounting evidence that multitasking using digital devices can have a range of negative impacts on task performance and learning. While the cognitive processes that cause these impacts are starting to be understood and the evidence that they occur in real learning contexts is mounting, the mechanics and extent of students' task switching and multitasking during learning activities is neither well documented or understood. This study seeks to redress this gap by defining and describing key task switching and multitasking behaviours adopted by students. It employs computer-based task switching and self-directed learning as the technology and learning frameworks within which these behaviours are explored. A custom monitoring system was used to capture and analyse 3372 computer session logs of students undertaking self-directed study within an open-access computer laboratory. Each session was broken down into a sequence of tasks within a series of time segments. Segments and sessions were then analysed and classified as conforming to one of three core behaviours - little or no task switching (focused), task switching without multitasking (sequential) and multitasking. Multitasking was much more common than focused or sequential behaviours. Multitasking was present in more than 70%, was most frequent in over 50% and occurred exclusively in around 35% of all sessions. By comparison, less than 10% of sessions were exclusively focused and only 7% were exclusively sequential. Once initiated, focused and multitasking behaviours appear to be quite stable. Students were much more likely to continue with them than to switch to an alternate behaviour. Sequential behaviour is far less stable and appears to represent a transitional state between multitasking and focused behaviours. The importance of personal, social and learning contexts in setting and influencing multitasking behaviours are discussed, as are some of the potential effects of these behaviours on learning practises and outcomes. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Making sense of multitasking: Key behaviours", "paper_id": "WOS:000317369900031"}