{"auto_keywords": [{"score": 0.04942444706912143, "phrase": "semantic_web"}, {"score": 0.00481495049065317, "phrase": "guesstimation_problems"}, {"score": 0.00443308765153716, "phrase": "semi-automated_guesstimation_application"}, {"score": 0.004312622975366676, "phrase": "gort"}, {"score": 0.0041001740903338834, "phrase": "general_applicability"}, {"score": 0.00397090000703739, "phrase": "inference"}, {"score": 0.0038447943243941685, "phrase": "full_power"}, {"score": 0.0035887342563437935, "phrase": "new_knowledge"}, {"score": 0.0033961782274326948, "phrase": "inference_mechanisms"}, {"score": 0.0030135741897058844, "phrase": "representational_formalism"}, {"score": 0.002686284749214443, "phrase": "static_curation"}, {"score": 0.0025655216052760093, "phrase": "growth_rate"}, {"score": 0.0021049977753042253, "phrase": "resulting_uncertainty"}], "paper_keywords": ["Guesstimation", " Semantic Web", " inference", " dynamic curation", " uncertainty"], "paper_abstract": "We draw on our experience of implementing a semi-automated guesstimation application of the Semantic Web, GORT, to draw four lessons, which we claim are of general applicability. These are: 1. Inference can unleash the Semantic Web: The full power of the web will only be realised when we can use it to infer new knowledge from old. 2. The Semantic Web does not constrain the inference mechanisms: Since we must anyway curate the knowledge we extract from the web, we can take the opportunity to translate it into what ever representational formalism is most appropriate for our application. This also enables the use of whatever inference mechanism is most appropriate. 3. Curation must be dynamic: Static curation is not only infeasible due to the size and growth rate of the Semantic Web, but curation must be application-specific. 4. Own up to uncertainty: Since the Semantic Web is, by design, uncontrolled, the accuracy of knowledge extracted from it cannot be guaranteed. The resulting uncertainty must not be hidden from the user, but must be made manifest.", "paper_title": "Solving guesstimation problems using the Semantic Web: Four lessons from an application", "paper_id": "WOS:000357874100010"}