{"auto_keywords": [{"score": 0.035765976242426646, "phrase": "item_pricing_problem"}, {"score": 0.027966080670758703, "phrase": "single-minded_item_pricing_problems"}, {"score": 0.02528841100516188, "phrase": "valuation_ratio"}, {"score": 0.00481495049065317, "phrase": "item_pricing"}, {"score": 0.00478672147169923, "phrase": "bounded_degree"}, {"score": 0.0038390783879368585, "phrase": "set_v"}, {"score": 0.003749747076821239, "phrase": "set_c"}, {"score": 0.0034227226677308337, "phrase": "maximization_problem"}, {"score": 0.003343047002965523, "phrase": "item_pricing_problems"}, {"score": 0.0030245409514492124, "phrase": "unlimited_supply"}, {"score": 0.002549499499484414, "phrase": "blum"}, {"score": 0.002519612567209806, "phrase": "weighted_k-hypergraphs"}, {"score": 0.0022996234912148463, "phrase": "largest_valuations"}, {"score": 0.002206659334299112, "phrase": "improved_approximation_algorithms"}, {"score": 0.002174374647551399, "phrase": "general_graphs"}, {"score": 0.002161593130928687, "phrase": "bipartite_graphs"}], "paper_keywords": ["item pricing", " approximation algorithm", " pseudodegree", " valuation ratio"], "paper_abstract": "When a store sells items to customers, the store wishes to decide the prices of the items to maximize its profit. If the store sells the items with low (resp. high) prices, the customers buy more (resp. less) items, which provides less profit to the store. It would be hard for the store to decide the prices of items. Assume that a store has a set V of n items and there is a set C of m customers who wish to buy those items. The goal of the store is to decide the price of each item to maximize its profit. We refer to this maximization problem as an item pricing problem. We classify the item pricing problems according to how many items the store can sell or how the customers valuate the items. If the store can sell every item i with unlimited (resp. limited) amount, we refer to this as unlimited supply (resp. limited supply). We say that the item pricing problem is single-minded if each customer j is an element of C wishes to buy a set e(j) subset of V of items and assigns valuation w(e(j)) >= 0. For the single-minded item pricing problems (in unlimited supply), Bal-can and Blum regarded them as weighted k-hypergraphs and gave several approximation algorithms. In this paper, we focus on the (pseudo) degree of k-hypergraphs and the valuation ratio, i.e., the ratio between the smallest and the largest valuations. Then for the single-minded item pricing problems (in unlimited supply), we show improved approximation algorithms (for k-hypergraphs, general graphs, bipartite graphs, etc.) with respect to the maximum (pseudo) degree and the valuation ratio.", "paper_title": "Improved approximation algorithms for item pricing with bounded degree and valuation", "paper_id": "WOS:000253655800005"}