{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "db_domain"}, {"score": 0.00481495049065317, "phrase": "multiple_scientific_research_domains"}, {"score": 0.00469445816161498, "phrase": "network_approach"}, {"score": 0.004647105813224402, "phrase": "interdisciplinary_research"}, {"score": 0.004263336444795021, "phrase": "scientific_research_domains"}, {"score": 0.004177724522109952, "phrase": "temporal_similarities"}, {"score": 0.0036245239349157236, "phrase": "rapid_development"}, {"score": 0.00351582806482809, "phrase": "research_efforts"}, {"score": 0.0033588449972778004, "phrase": "new_research_questions"}, {"score": 0.0032088487124106936, "phrase": "content-based_technique"}, {"score": 0.0031603487697867538, "phrase": "cocitation_or_coauthorship_network-based_technique"}, {"score": 0.003034558550137019, "phrase": "research_area"}, {"score": 0.0028990018343924683, "phrase": "effective_way"}, {"score": 0.0028120022457134267, "phrase": "different_research_domains"}, {"score": 0.002769483748975581, "phrase": "content_similarity_and_coauthorship_network_similarity"}, {"score": 0.0021601022948013115, "phrase": "ir"}], "paper_keywords": ["knowledge discovery", " bibliographic databases"], "paper_abstract": "Interdisciplinary research has been attracting more attention in recent decades. In this article, we compare the similarity between scientific research domains and quantifying the temporal similarities of domains. We narrowed our study to three research domains: information retrieval (IR), database (DB), and World Wide Web (W3), because the rapid development of the W3 domain substantially attracted research efforts from both IR and DB domains and introduced new research questions to these two areas. Most existing approaches either employed a content-based technique or a cocitation or coauthorship network-based technique to study the development trend of a research area. In this work, we proposed an effective way to quantify the similarities among different research domains by incorporating content similarity and coauthorship network similarity. Experimental results on DBLP (DataBase systems and Logic Programming) data related to IR, DB, and W3 domains showed that the W3 domain was getting closer to both IR and DB whereas the distance between IR and DB remained relatively constant. In addition, comparing to IR and W3 with the DB domain, the DB domain was more conservative and evolved relatively slower.", "paper_title": "Understanding the evolution of multiple scientific research domains using a content and network approach", "paper_id": "WOS:000325930600015"}