{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linguistic_fuzzy_rule-based_systems"}, {"score": 0.04915098975480121, "phrase": "interpretability_measures"}, {"score": 0.04878455414226704, "phrase": "linguistic_fuzzy_modelling"}, {"score": 0.004365881789903319, "phrase": "linguistic_model"}, {"score": 0.004264463695140275, "phrase": "human_beings"}, {"score": 0.0033183674218329904, "phrase": "linguistic_terms"}, {"score": 0.003241203549050267, "phrase": "fuzzy_sets"}, {"score": 0.0030440661915657175, "phrase": "appropriate_interpretability_measures"}, {"score": 0.0029966788947444535, "phrase": "open_problem"}, {"score": 0.0028588847851995533, "phrase": "proposed_interpretability_measures"}, {"score": 0.0026535183547537655, "phrase": "double_axis"}, {"score": 0.0026019646284747024, "phrase": "semantic_interpretability"}, {"score": 0.002472552537325604, "phrase": "fuzzy_partitions"}, {"score": 0.0024340403320192807, "phrase": "different_components"}, {"score": 0.002405549400304955, "phrase": "knowledge_base"}, {"score": 0.0022948742034852917, "phrase": "main_aim"}, {"score": 0.002250272652754455, "phrase": "well_established_framework"}, {"score": 0.002197891020396052, "phrase": "better_understanding"}, {"score": 0.0021551702945512494, "phrase": "well_founded_future_works"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Complexity", " Semantic interpretability", " Linguistic fuzzy rule-based systems"], "paper_abstract": "Linguistic fuzzy modelling, developed by linguistic fuzzy rule-based systems, allows us to deal with the modelling of systems by building a linguistic model which could become interpretable by human beings. Linguistic fuzzy modelling comes with two contradictory requirements: interpretability and accuracy. In recent years the interest of researchers in obtaining more interpretable linguistic fuzzy models has grown. Whereas the measures of accuracy are straightforward and well-known, interpretability measures are difficult to define since interpretability depends on several factors; mainly the model structure, the number of rules, the number of features, the number of linguistic terms, the shape of the fuzzy sets, etc. Moreover, due to the subjectivity of the concept the choice of appropriate interpretability measures is still an open problem. In this paper, we present an overview of the proposed interpretability measures and techniques for obtaining more interpretable linguistic fuzzy rule-based systems. To this end, we will propose a taxonomy based on a double axis: \"Complexity versus semantic interpretability\" considering the two main kinds of measures; and \"rule base versus fuzzy partitions\" considering the different components of the knowledge base to which both kinds of measures can be applied. The main aim is to provide a well established framework in order to facilitate a better understanding of the topic and well founded future works. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Interpretability of linguistic fuzzy rule-based systems: An overview of interpretability measures", "paper_id": "WOS:000293548900002"}