{"auto_keywords": [{"score": 0.04165700301537227, "phrase": "surf"}, {"score": 0.00481495049065317, "phrase": "parallel_software_surf_implementations"}, {"score": 0.004563691742821759, "phrase": "recognizing_objects"}, {"score": 0.004306205029641728, "phrase": "complete_real-world_scene"}, {"score": 0.003220315882881027, "phrase": "parallelism-based_technologies"}, {"score": 0.003149094460617212, "phrase": "diverse_parallel_implementations"}, {"score": 0.00303839203670705, "phrase": "parallel_implementations"}, {"score": 0.002957919048133256, "phrase": "compute_unified_device_architecture"}, {"score": 0.0027659126653647712, "phrase": "valuable_a_comparative_study"}, {"score": 0.002621297299343551, "phrase": "parallel_implementation"}, {"score": 0.0025178072071268534, "phrase": "first_attempt"}, {"score": 0.002473129577319634, "phrase": "comparative_study"}, {"score": 0.0023333173799963795, "phrase": "standard_metrics"}, {"score": 0.0023125191783901367, "phrase": "image_collection"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["parallel implementations", " SURF", " comparative study", " CUDA", " OpenCL", " OpenMP", " OpenCV"], "paper_abstract": "Nowadays, it is common to find problems that require recognizing objects in an image, tracking them along time, or recognizing a complete real-world scene. One of the most known and used algorithms to solve these problems is the Speeded Up Robust Features (SURF) algorithm. SURF is a fast and robust local, scale and rotation invariant, features detector. This means that it can be used for detecting and describing a set of points of interest (keypoints) from an image. Because of the importance of this algorithm and the rise of the parallelism-based technologies, in the last years, diverse parallel implementations of SURF have been proposed. These parallel implementations are based on very different techniques: Compute Unified Device Architecture, OpenMp, OpenCL, and so on. In conclusion, we think valuable a comparative study of all of them highlighting the advantages and disadvantages of each parallel implementation. To our best knowledge, this article is the first attempt to do this comparative study. In order to make this study, we have used the standard metrics and image collection in this field, as well as other important metrics in parallelism as speedup and efficiency. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "A comparative study of parallel software SURF implementations", "paper_id": "WOS:000343861500003"}