{"auto_keywords": [{"score": 0.049120782372679736, "phrase": "geometric_disturbances"}, {"score": 0.0076960301579562206, "phrase": "stair-climbing_mobility_systems"}, {"score": 0.005460557384198486, "phrase": "user's_safety"}, {"score": 0.004637478829869904, "phrase": "new_study"}, {"score": 0.004597457370802855, "phrase": "obstacle-climbing_ability"}, {"score": 0.003990385737207714, "phrase": "sliding_supports"}, {"score": 0.003876669922047053, "phrase": "different_sizes"}, {"score": 0.0038431888954930083, "phrase": "even_stairs"}, {"score": 0.003766182463933667, "phrase": "irregular_or_uneven_treads"}, {"score": 0.0036377310474678547, "phrase": "obstacle-climbing_problem"}, {"score": 0.003595891416028495, "phrase": "stair_height"}, {"score": 0.0032779858508704364, "phrase": "large-sized_stairs"}, {"score": 0.003049247243348174, "phrase": "appropriate_drive_systems"}, {"score": 0.0029197159945990015, "phrase": "proposed_scms"}, {"score": 0.0025409639091476363, "phrase": "smooth_and_accurate_reference_trajectory"}, {"score": 0.002447101794397243, "phrase": "laser_distance_sensors"}, {"score": 0.002425937226012825, "phrase": "second_improvement"}, {"score": 0.0024049552650867935, "phrase": "control_problem"}, {"score": 0.0022960713730673494, "phrase": "experimental_results"}, {"score": 0.0022565201625076876, "phrase": "proposed_improvements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Stair-climbing mobility system", " Laser distance sensor", " Architectural barrier", " Geometric disturbance"], "paper_abstract": "This paper presents a new study on the obstacle-climbing ability of Stair-Climbing Mobility Systems (SCMSs), taking into account the effects related to the presence of geometric disturbances on the obstacles. In this research, we use an SCMS that combines two different locomotion mechanisms to climb up and down stairs: one based on wheels and the other based on Sliding Supports. The combination of these mechanisms allows stairs of different sizes, and even stairs with geometric disturbances such as stairs with irregular or uneven treads, to be surpassed. However, the difficulty of the obstacle-climbing problem increases if the stair height is either large or its geometry is altered, in which case the obstacle climbing ability, and consequently the user's safety may be highly compromised. In order to increase its adaptability to large-sized stairs and to reduce the effect of geometric disturbances, two important improvements have been made to the previous SCMS. One of these has been achieved by incorporating appropriate drive systems and redesigning the mechanisms that control the wheels. Thanks to this, the proposed SCMS is more lightweight and easy to control, and is above all more robust to geometric disturbances on the obstacles. The other concerns the trajectory planning, which has been improved by using a strategy that allows the size and shape of the stair to be estimated and accordingly allows a smooth and accurate reference trajectory to be tracked. This strategy is based on information obtained from laser distance sensors. This second improvement simplifies the control problem, reduces the time needed to surpass stairs and improves the user's safety and comfort. Experimental results demonstrate the effectiveness of the proposed improvements when the SCMS climbs/descends staircases when both considering and not considering the effects of geometric disturbances on the steps. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Improving the climbing/descent performance of stair-climbing mobility systems confronting architectural barriers with geometric disturbances", "paper_id": "WOS:000365366700002"}