{"auto_keywords": [{"score": 0.02873292146243341, "phrase": "archetype_element"}, {"score": 0.00481495049065317, "phrase": "snomed_ct_terms"}, {"score": 0.004783232571029632, "phrase": "archetype_elements"}, {"score": 0.004492094831481931, "phrase": "managing_interoperability_and_complexity_in_health_systems"}, {"score": 0.004260656420599919, "phrase": "electronic_health_records"}, {"score": 0.004176961840039024, "phrase": "binding_terminological_codes"}, {"score": 0.004122077038067119, "phrase": "snomed_ct_codes"}, {"score": 0.003922580121023413, "phrase": "large_size"}, {"score": 0.0036352070472201086, "phrase": "aforementioned_problem"}, {"score": 0.0035519826240477444, "phrase": "string_comparison-based_techniques"}, {"score": 0.0033911868693238894, "phrase": "comparison_methods"}, {"score": 0.0032269483581856737, "phrase": "friedman_and_nemenyi_tests"}, {"score": 0.003020232503089429, "phrase": "qgrams_method"}, {"score": 0.0029805015010906013, "phrase": "'text'_information_piece"}, {"score": 0.0025090323307618632, "phrase": "snomed_ct_code"}, {"score": 0.0024112587007106535, "phrase": "above-mentioned_results"}, {"score": 0.0023326907270271153, "phrase": "string_comparison-based_methods"}, {"score": 0.0022196020509093694, "phrase": "reduced_set"}, {"score": 0.0022049428043454966, "phrase": "candidate_terms"}, {"score": 0.002154392046210367, "phrase": "ultimate_term"}, {"score": 0.0021049977753042253, "phrase": "more-than-likely_manual_supervision_task"}], "paper_keywords": ["Archetype", " SNOMED CT"], "paper_abstract": "Introduction: This article is part of the Focus Theme of Methods of Information in Medicine on \"Managing Interoperability and Complexity in Health Systems\". Background: The proliferation of archetypes as a means to represent information of Electronic Health Records has raised the need of binding terminological codes - such as SNOMED CT codes - to their elements, in order to identify them univocally. However, the large size of the terminologies makes it difficult to perform this task manually. Objectives: To establish a baseline of results for the aforementioned problem by using off-the-shelf string comparison-based techniques against which results from more complex techniques could be evaluated. Methods: Nine Typed Comparison Methods were evaluated for binding using a set of 487 archetype elements. Their recall was calculated and Friedman and Nemenyi tests were applied in order to assess whether any of the methods outperformed the others. Results: Using the qGrams method along with the 'Text' information piece of archetype elements outperforms the other methods if a level of confidence of 90% is considered. A recall of 25.26% is obtained if just one SNOMED CT term is retrieved for each archetype element. This recall rises to 50.51% and 75.56% if 10 and 100 elements are retrieved respectively, that being a reduction of more than 99.99% on the SNOMED CT code set. Conclusions: The baseline has been established following the above-mentioned results. Moreover, it has been observed that although string comparison-based methods do not outperform more sophisticated techniques, they still can be an alternative for providing a reduced set of candidate terms for each archetype element from which the ultimate term can be chosen later in the more-than-likely manual supervision task.", "paper_title": "Binding SNOMED CT Terms to Archetype Elements Establishing a Baseline of Results", "paper_id": "WOS:000347868300007"}