{"auto_keywords": [{"score": 0.04633392568746383, "phrase": "finitely_many_variables"}, {"score": 0.04153676618772047, "phrase": "active_variables"}, {"score": 0.034580458016601805, "phrase": "polynomial_tractability"}, {"score": 0.007872451694448565, "phrase": "weak_tractability"}, {"score": 0.00481495049065317, "phrase": "function_approximation"}, {"score": 0.004673595320100892, "phrase": "infinitely_many_variables"}, {"score": 0.004561019117546361, "phrase": "separable_weighted_hilbert_space"}, {"score": 0.004511855629018383, "phrase": "direct_sum"}, {"score": 0.0044874720717774305, "phrase": "tensor_product_hilbert_spaces"}, {"score": 0.004403158130041613, "phrase": "weight_sequence"}, {"score": 0.004114709438935836, "phrase": "finitely_many_arbitrary_linear_functionals"}, {"score": 0.004037370832877034, "phrase": "inner_product"}, {"score": 0.003929391999210588, "phrase": "inner_product_generator"}, {"score": 0.0035930624319243224, "phrase": "worst_case"}, {"score": 0.003403350748507008, "phrase": "minimal_cost"}, {"score": 0.002845347968246455, "phrase": "cost_function"}, {"score": 0.002608634873428449, "phrase": "minimal_number"}, {"score": 0.0023148964315569866, "phrase": "largest_eigenvalue"}, {"score": 0.0022961149746031652, "phrase": "univariate_case"}, {"score": 0.002162951519368368, "phrase": "tractability_conditions"}, {"score": 0.002139581380750111, "phrase": "finite-order_weights"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multivariate function approximation", " Path integration", " Optimal algorithms", " Complexity", " Tractability"], "paper_abstract": "We study approximation of functions that may depend on infinitely many variables. We assume that such functions belong to a separable weighted Hilbert space that is the direct sum of tensor product Hilbert spaces of functions with finitely many variables. The weight sequence gamma = {gamma(u)} is used to moderate the influence of terms depending on finitely many variables from u. We consider algorithms that use finitely many arbitrary linear functionals. Each linear functional is an inner product whose cost depends on the number of active variables of the inner product generator. That is, if the generator has d active variables then the cost is $(d) for a given non-decreasing function $. The error of an algorithm is defined in the worst case setting in a norm given by weighted L-2 norms for terms depending on finitely many variables. The epsilon-complexity is understood as the minimal cost among all algorithms with errors at most epsilon. We are especially interested in polynomial tractability, where the epsilon-complexity is bounded by a polynomial in epsilon(-1), and weak tractability, where the epsilon-complexity is sub-exponential in epsilon(-1). The results are as follows. An algorithm whose cost is equal to the epsilon-complexity. It turns out the algorithm does not depend on the cost function $. Necessary and sufficient conditions on polynomial tractability. It turns out that we may have polynomial tractability even when $(d) is exponential in d. This holds since the minimal number of active variables that must be used to compute an epsilon-approximation may be surprisingly small, e.g., o(In(epsilon(-1))) or even smaller. Necessary and sufficient conditions on weak tractability. It turns out that we have two quite different cases depending on whether the largest eigenvalue for the univariate case is simple or not. We may have weak tractability even when $(d) is doubly exponential in d. Specializing tractability conditions for product and finite-order weights. (c) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Liberating the dimension for function approximation", "paper_id": "WOS:000286082100006"}