{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "attention_behaviors"}, {"score": 0.022897731727177045, "phrase": "attention_behavior"}, {"score": 0.021857869003541038, "phrase": "friendship_network"}, {"score": 0.004780030485538593, "phrase": "online_social_networks."}, {"score": 0.004380143676997257, "phrase": "social_networks"}, {"score": 0.004332559296185432, "phrase": "relatively_little_attention"}, {"score": 0.0038419163428806973, "phrase": "douban_database"}, {"score": 0.0036775717816768133, "phrase": "latent_metric_space"}, {"score": 0.0036375920152538783, "phrase": "revealed_similar_patterns"}, {"score": 0.003296713221268488, "phrase": "pairwise_nodes"}, {"score": 0.003272767888056937, "phrase": "douban_network"}, {"score": 0.0032371745435372168, "phrase": "attention_links"}, {"score": 0.0031099353574309606, "phrase": "friendship_links"}, {"score": 0.0029551803384781604, "phrase": "high_clustering"}, {"score": 0.00250789768689397, "phrase": "forward_attention"}], "paper_keywords": ["Complex networks", " social networks", " attention behaviors", " attention prediction"], "paper_abstract": "Studying attention behavior has its social significance because such behavior is considered to lead the evolution of the friendship network. However, this type of behavior in social networks has attracted relatively little attention before, which is mainly because, in reality, such behaviors are always transitory and rarely recorded. In this paper, we collected the attention behaviors as well as the friendship network from Douban database and then carefully studied the attention behaviors in the friendship network as a latent metric space. The revealed similar patterns of attention behavior and friendship suggest that attention behavior may be the pre-stage of friendship to a certain extent, which can be further validated by the fact that pairwise nodes in Douban network connected by attention links beforehand are indeed far more likely to be connected by friendship links in the near future. This phenomenon can also be used to explain the high clustering of many social networks. More interestingly, it seems that attention behaviors are more likely to take place between individuals who have more mutual friends as well as more different friends, which seems a little different from the principles of many link prediction algorithms. Moreover, it is also found that forward attention is preferred to inverse attention, which is quite natural because, usually, an individual must be more interested in others that he is paying attention to than those paying attention to him. All of these findings can be used to guide the design of more appropriate social network models in the future.", "paper_title": "EMPIRICAL ANALYSIS OF ATTENTION BEHAVIORS IN ONLINE SOCIAL NETWORKS", "paper_id": "WOS:000281399800008"}