{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "particle_size_distribution"}, {"score": 0.04952003448686007, "phrase": "hydration_process"}, {"score": 0.033447657043232625, "phrase": "psd_hydration_model"}, {"score": 0.01753049729478806, "phrase": "isothermal_heat"}, {"score": 0.00773879765515327, "phrase": "different_particle_size_distributions"}, {"score": 0.004558091785667046, "phrase": "performance_characteristics"}, {"score": 0.004298006360831255, "phrase": "utilization_efficiency"}, {"score": 0.003958529104387973, "phrase": "particle_size"}, {"score": 0.0033444934455768623, "phrase": "measurable_hydration_depth"}, {"score": 0.0033183674218329904, "phrase": "cement_hydration"}, {"score": 0.0032158817866929563, "phrase": "experimental_results"}, {"score": 0.002915514089373717, "phrase": "reference_hydration_rate"}, {"score": 0.002792375587031108, "phrase": "ordinary_portland_cement"}, {"score": 0.0026327757304477665, "phrase": "water-to-cement_ratio"}, {"score": 0.002331189621118592, "phrase": "different_water-to-cement_ratios"}, {"score": 0.0021049977753042253, "phrase": "satisfactory_accuracy"}], "paper_keywords": ["PSD hydration model", " particle size distribution", " measurable hydration depth", " reference hydration rate", " isothermal hydration heat generation"], "paper_abstract": "The hydration of cement contributes to the performance characteristics of concrete, such as strength and durability. In order to improve the utilization efficiency of cement and its early properties, the particle size distribution (PSD) of cement varies considerably, and the effects of the particle size distribution of cement on the hydration process should be considered. In order to evaluate effects of PSD separately, experiments testing the isothermal heat generated during the hydration of cements with different particle size distributions but the same chemical composition have been carried out. The measurable hydration depth for cement hydration was proposed and deduced based on the experimental results, and a PSD hydration model was developed in this paper for simulating the effects of particle size distribution on the hydration process of cement. First, a reference hydration rate was derived from the isothermal heat generated by the hydration of ordinary Portland cement. Then, the model was extended to take into account the effect of water-to-cement ratio, hereinafter which was referred to as PSD hydration model. Finally, the PSD hydration model was applied to simulate experiments measuring the isothermal heat generated by the hydration of cement with different particle size distributions at different water-to-cement ratios. This showed that the PSD hydration model had simulated the effects of particle size distribution and water-to-cement ratio on the hydration process of cement with satisfactory accuracy.", "paper_title": "Model for simulating the effects of particle size distribution on the hydration process of cement", "paper_id": "WOS:000300534600002"}