{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_grasping_behavior"}, {"score": 0.03462409942879789, "phrase": "grasp_type"}, {"score": 0.004566954456805558, "phrase": "two-part_series"}, {"score": 0.004492094831481931, "phrase": "wide_range"}, {"score": 0.004462494148878735, "phrase": "unstructured_tasks"}, {"score": 0.004331675965350876, "phrase": "daily_work"}, {"score": 0.0036112323484812675, "phrase": "manipulated_object"}, {"score": 0.0033576858946833587, "phrase": "task_data"}, {"score": 0.003313530464737521, "phrase": "best_predictors"}, {"score": 0.0032591491777773035, "phrase": "object_size"}, {"score": 0.0032376465741070274, "phrase": "task_constraints"}, {"score": 0.003010250522930773, "phrase": "useful_heuristics"}, {"score": 0.0029903851294825023, "phrase": "grasp_planning_systems"}, {"score": 0.002921879966280267, "phrase": "common_sub-categorization"}, {"score": 0.002636828502928141, "phrase": "large_and_heavy_objects"}, {"score": 0.0025935242726503964, "phrase": "power_grasp"}, {"score": 0.0025678829712650437, "phrase": "small_and_lightweight_objects"}, {"score": 0.002476009439388887, "phrase": "grasped_object_size"}, {"score": 0.0023795195973873636, "phrase": "precision_grasps"}, {"score": 0.002286781334850213, "phrase": "important_implications"}, {"score": 0.002271679416337276, "phrase": "robotic_hand_design"}, {"score": 0.0022049428043454966, "phrase": "power_grasps"}, {"score": 0.002168715943767454, "phrase": "heavy_objects"}], "paper_keywords": ["Human grasping", " manipulation", " activities of daily living", " prosthetics", " robotic hands"], "paper_abstract": "This paper is the second in a two-part series analyzing human grasping behavior during a wide range of unstructured tasks. It investigates the tasks performed during the daily work of two housekeepers and two machinists and correlates grasp type and object properties with the attributes of the tasks being performed. The task or activity is classified according to the force required, the degrees of freedom, and the functional task type. We found that 46 percent of tasks are constrained, where the manipulated object is not allowed to move in a full six degrees of freedom. Analyzing the interrelationships between the grasp, object, and task data show that the best predictors of the grasp type are object size, task constraints, and object mass. Using these attributes, the grasp type can be predicted with 47 percent accuracy. Those parameters likely make useful heuristics for grasp planning systems. The results further suggest the common sub-categorization of grasps into power, intermediate, and precision categories may not be appropriate, indicating that grasps are generally more multi-functional than previously thought. We find large and heavy objects are grasped with a power grasp, but small and lightweight objects are not necessarily grasped with precision grasps-even with grasped object size less than 2 cm and mass less than 20 g, precision grasps are only used 61 percent of the time. These results have important implications for robotic hand design and grasp planners, since it appears while power grasps are frequently used for heavy objects, they can still be quite practical for small, lightweight objects.", "paper_title": "Analysis of Human Grasping Behavior: Correlating Tasks, Objects and Grasps", "paper_id": "WOS:000348904800002"}