{"auto_keywords": [{"score": 0.04885877600670671, "phrase": "neighbor_discovery"}, {"score": 0.015719716506582538, "phrase": "opportunistic_networking"}, {"score": 0.004760017604908536, "phrase": "things_scenarios"}, {"score": 0.004559517609828423, "phrase": "energy_issues"}, {"score": 0.004481691848428778, "phrase": "main_objective"}, {"score": 0.004405188605303729, "phrase": "network_topology"}, {"score": 0.004379977556546879, "phrase": "subsequent_communication"}, {"score": 0.004243862930012258, "phrase": "new_challenges"}, {"score": 0.004123781267600542, "phrase": "static_networks"}, {"score": 0.004065015441680357, "phrase": "opportunistic_presence"}, {"score": 0.0038492126993451337, "phrase": "connectivity_opportunities"}, {"score": 0.003531474887552889, "phrase": "communication_times"}, {"score": 0.003511246498068952, "phrase": "neighboring_nodes"}, {"score": 0.0032398798149196432, "phrase": "things_applications"}, {"score": 0.003221316290858497, "phrase": "e._g."}, {"score": 0.0030854280671143556, "phrase": "end-to-end_paths"}, {"score": 0.0029214769181390653, "phrase": "rare_and_short_connectivity_opportunities"}, {"score": 0.0028468767420392945, "phrase": "older_discovery_approaches"}, {"score": 0.0027189137945757866, "phrase": "new_challenging_scenarios"}, {"score": 0.0026955672787561742, "phrase": "recent_direction"}, {"score": 0.0025966876163886882, "phrase": "mobility_patterns"}, {"score": 0.002544951823639408, "phrase": "discovery_process"}, {"score": 0.0024942442249551284, "phrase": "new_classification"}, {"score": 0.0024305268807926056, "phrase": "recent_protocols"}, {"score": 0.0023480892503414596, "phrase": "potential_improvements"}, {"score": 0.0021726616502636305, "phrase": "faster_discovery"}, {"score": 0.002117141938815381, "phrase": "energy_savings"}], "paper_keywords": ["Neighbour discovery", " opportunistic networking", " Internet of Things", " mobility", " knowledge"], "paper_abstract": "Neighbor discovery was initially conceived as a means to deal with energy issues at deployment, where the main objective was to acquire information about network topology for subsequent communication. Nevertheless, over recent years, it has been facing new challenges due to the introduction of mobility of nodes over static networks mainly caused by the opportunistic presence of nodes in such a scenario. The focus of discovery has, therefore, shifted toward more challenging environments, where connectivity opportunities need to be exploited for achieving communication. In fact, discovery has traditionally been focused on tradeoffs between energy and latency in order to reach an overlapping of communication times between neighboring nodes. With the introduction of opportunistic networking, neighbor discovery has instead aimed toward the more challenging problem of acquiring knowledge about the patterns of encounters between nodes. Many Internet of Things applications (e. g., smart cities) can, in fact, benefit from such discovery, since end-to-end paths may not directly exist between sources and sinks of data, thus requiring the discovery and exploitation of rare and short connectivity opportunities to relay data. While many of the older discovery approaches are still valid, they are not entirely designed to exploit the properties of these new challenging scenarios. A recent direction in research is, therefore, to learn and exploit knowledge about mobility patterns to improve the efficiency in the discovery process. In this paper, a new classification and taxonomy is presented with an emphasis on recent protocols and advances in this area, summarizing issues and ways for potential improvements. As we will show, knowledge integration in the process of neighbor discovery leads to a more efficient scheduling of the resources when contacts are expected, thus allowing for faster discovery, while, at the same time allowing for energy savings when such contacts are not expected.", "paper_title": "Neighbor Discovery for Opportunistic Networking in Internet of Things Scenarios: A Survey", "paper_id": "WOS:000371388200085"}