{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "blood_flow_simulations"}, {"score": 0.00465964893087681, "phrase": "temporal_domain"}, {"score": 0.004614038128321949, "phrase": "biomedical_simulations"}, {"score": 0.004406994912939125, "phrase": "blood_flow"}, {"score": 0.004033464035028803, "phrase": "medical_special_knowledge"}, {"score": 0.003993958025223994, "phrase": "key_parameters"}, {"score": 0.003703611021999795, "phrase": "medical_simulations"}, {"score": 0.0029918783504666894, "phrase": "black-box_abstraction"}, {"score": 0.00290473242917264, "phrase": "biomedical_researcher"}, {"score": 0.0028016507334576216, "phrase": "complete_parameter_sets"}, {"score": 0.0027379609683723938, "phrase": "corresponding_results"}, {"score": 0.0025554259726979786, "phrase": "different_simulation_methods"}, {"score": 0.002497319603143104, "phrase": "provided_parameters"}, {"score": 0.0024007585788965655, "phrase": "rule_base"}, {"score": 0.0023850311572318496, "phrase": "unphysical_inputs"}, {"score": 0.0022628564592874147, "phrase": "suitable_and_familiar_way"}, {"score": 0.0021968983291791784, "phrase": "blood_flow_simulation_ontology"}, {"score": 0.0021610874773389096, "phrase": "plausibility_checking"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Blood flow simulations", " Lattice Boltzmann Method", " Temporal ontologies", " Systems biology"], "paper_abstract": "In this paper an approach for developing a temporal domain ontology for biomedical simulations is introduced. The ideas are presented in the context of simulations of blood flow in aneurysms using the Lattice Boltzmann Method. The advantages in using ontologies are manyfold: On the one hand, ontologies having been proven to be able to provide medical special knowledge e.g., key parameters for simulations. On the other hand, based on a set of rules and the usage of a reasoner, a system for checking the plausibility as well as tracking the outcome of medical simulations can be constructed. Likewise, results of simulations including data derived from them can be stored and communicated in a way that can be understood by computers. Later on, this set of results can be analyzed. At the same time, the ontologies provide a way to exchange knowledge between researchers. Lastly, this approach can be seen as a black-box abstraction of the internals of the simulation for the biomedical researcher as well. This approach is able to provide the complete parameter sets for simulations, part of the corresponding results and part of their analysis as well as e.g., geometry and boundary conditions. These inputs can be transferred to different simulation methods for comparison. Variations on the provided parameters can be automatically used to drive these simulations. Using a rule base, unphysical inputs or outputs of the simulation can be detected and communicated to the physician in a suitable and familiar way. An example for an instantiation of the blood flow simulation ontology and exemplary rules for plausibility checking are given. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A novel approach for connecting temporal-ontologies with blood flow simulations", "paper_id": "WOS:000319719500009"}