{"auto_keywords": [{"score": 0.02322730111336098, "phrase": "microscopic_images"}, {"score": 0.004774324145784758, "phrase": "natural_medical_herbal_powders"}, {"score": 0.00467424463996457, "phrase": "natural_medical_herbs"}, {"score": 0.004634799977448855, "phrase": "crucial_impact"}, {"score": 0.004576253356889219, "phrase": "clinical_curative_effect"}, {"score": 0.004064117897000019, "phrase": "important_evidences"}, {"score": 0.003829877278269543, "phrase": "manual_observation"}, {"score": 0.0037495207047193034, "phrase": "computer_vision_technique"}, {"score": 0.0037021153060910164, "phrase": "important_research_subject"}, {"score": 0.003400984514637656, "phrase": "target_segmentation"}, {"score": 0.003301461490509176, "phrase": "effective_automatic_target_segmentation_algorithm"}, {"score": 0.002762423953243486, "phrase": "feature_vector"}, {"score": 0.0024527767211457046, "phrase": "energy_equations"}, {"score": 0.0024012441367538434, "phrase": "maximum_flow-minimum_cut_algorithm"}, {"score": 0.002224510044064184, "phrase": "experimental_results"}, {"score": 0.002168531704054597, "phrase": "better_segmentation"}, {"score": 0.0021049977753042253, "phrase": "user_inter-action"}], "paper_keywords": ["Medical herbal powder", " Microscopic images", " Automatic segmentation", " Texture feature"], "paper_abstract": "The authentication of natural medical herbs has crucial impact on the clinical curative effect. Much of these herbs have been ground into powders in the market, leading to the difficulty of identification. Microscopic images of these powders contain important evidences for identification. Currently identification based on these microscopic images are mostly conducted by manual observation. Identification aided by computer vision technique is an important research subject recently. These microscopic images usually contain variety of substance, and most of them are noises, thus the target segmentation is necessary for identification. An effective automatic target segmentation algorithm based on texture is proposed in this paper. Our method consists of two steps: \"Preliminary Segmentation\" and \"Further Segmentation\". Firstly, gradient transform and image fusion are conducted for image preprocessing, then each pixel is encoded into a feature vector based on texture and clustered into two groups: background and foreground. Secondly, taking the continuity of edge and the locality of target into consideration, energy equations are established, and maximum flow-minimum cut algorithm is applied to solve them. Three groups of images are tested to evaluate our method, and the experimental results show that our method achieves a better segmentation compared with Grab-Cut, and additionally user inter-action is not required in our method.", "paper_title": "Automatic Target Segmentation based on Texture for Microscopic Images of Natural Medical Herbal Powders", "paper_id": "WOS:000348998900004"}