{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "conditional_replenishment"}, {"score": 0.00473320761888448, "phrase": "motion_compensation"}, {"score": 0.004289291421348352, "phrase": "current_predictive_motion-compensated_video_coding_standards"}, {"score": 0.004127094600862448, "phrase": "considerably_more_bandwidth"}, {"score": 0.0038868464660354626, "phrase": "new_patent"}, {"score": 0.0037558704408683905, "phrase": "inter-frame_redundancy"}, {"score": 0.0035523480068927614, "phrase": "real-time_motion_detection_system"}, {"score": 0.003374250301861101, "phrase": "bit_rate"}, {"score": 0.003031287195944274, "phrase": "video_storage"}, {"score": 0.002954287204671032, "phrase": "fast_motion_compensation_technique"}, {"score": 0.0028916124463906983, "phrase": "real-time_video_streaming_purposes"}, {"score": 0.002608744950946475, "phrase": "real-time_tile_change_detection"}, {"score": 0.002283839204519042, "phrase": "compression_ratio"}, {"score": 0.002264321283759897, "phrase": "video_quality"}, {"score": 0.0022257833099336858, "phrase": "standard_peak_signal-to-noise_ratio"}, {"score": 0.0021599099979586946, "phrase": "metric_metrics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["JPEG2000", " Streaming", " rtp", " Real-time", " Motion", " Tile", " Interframe", " Compensation"], "paper_abstract": "A video compressed as a sequence of JPEG2000 images can achieve the scalability, flexibility, and accessibility that is lacking in current predictive motion-compensated video coding standards. However, streaming JPEG2000-based sequences would consume considerably more bandwidth. With the aim of solving this problem, this paper describes a new patent pending method, called MIJ2K. MIJ2K reduces the inter-frame redundancy present in common JPEG2000 sequences (also called MJP2). We apply a real-time motion detection system to perform conditional tile replenishment. This will significantly reduce the bit rate necessary to transmit JPEG2000 video sequences, also improving their quality. The MIJ2K technique can be used both to improve JPEG2000-based real-time video streaming services or as a new codec for video storage. MIJ2K relies on a fast motion compensation technique, especially designed for real-time video streaming purposes. In particular, we propose transmitting only the tiles that change in each JPEG2000 frame. This paper describes and evaluates the method proposed for real-time tile change detection, as well as the overall MIJ2K architecture. We compare MIJ2K against other intra-frame codecs, like standard Motion JPEG2000, Motion JPEG, and the latest H.264-Intra, comparing performance in terms of compression ratio and video quality, measured by standard peak signal-to-noise ratio, structural similarity and visual quality metric metrics. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "MIJ2K: Enhanced video transmission based on conditional replenishment of JPEG2000 tiles with motion compensation", "paper_id": "WOS:000289589100004"}