{"auto_keywords": [{"score": 0.049604883316905636, "phrase": "rough_set_theory"}, {"score": 0.027844426635697354, "phrase": "modified_algorithms"}, {"score": 0.015719716506582538, "phrase": "attribute_reduction"}, {"score": 0.015413195163808452, "phrase": "feature_selection"}, {"score": 0.004650086856905758, "phrase": "challenging_problem"}, {"score": 0.0045357787854931894, "phrase": "pattern_recognition"}, {"score": 0.004358676214574977, "phrase": "consistency_measure"}, {"score": 0.0039651694106206245, "phrase": "discriminatory_power"}, {"score": 0.00392586404888927, "phrase": "original_features"}, {"score": 0.003829290275367182, "phrase": "reduction_algorithms"}, {"score": 0.003380791705551809, "phrase": "theoretic_framework"}, {"score": 0.003121636289442593, "phrase": "heuristic_process"}, {"score": 0.003014576010931602, "phrase": "proposed_accelerator"}, {"score": 0.002969821115740559, "phrase": "general_attribute_reduction_algorithm"}, {"score": 0.002168975681697056, "phrase": "larger_data_sets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Rough set theory", " Attribute reduction", " Decision table", " Positive approximation", " Granular computing"], "paper_abstract": "Feature selection is a challenging problem in areas such as pattern recognition, machine learning and data mining. Considering a consistency measure introduced in rough set theory, the problem of feature selection, also called attribute reduction, aims to retain the discriminatory power of original features. Many heuristic attribute reduction algorithms have been proposed however, quite often, these methods are computationally time-consuming. To overcome this shortcoming, we introduce a theoretic framework based on rough set theory, called positive approximation, which can be used to accelerate a heuristic process of attribute reduction. Based on the proposed accelerator, a general attribute reduction algorithm is designed. Through the use of the accelerator, several representative heuristic attribute reduction algorithms in rough set theory have been enhanced. Note that each of the modified algorithms can choose the same attribute reduct as its original version, and hence possesses the same classification accuracy. Experiments show that these modified algorithms outperform their original counterparts. It is worth noting that the performance of the modified algorithms becomes more visible when dealing with larger data sets. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Positive approximation: An accelerator for attribute reduction in rough set theory", "paper_id": "WOS:000278219200004"}