{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "worksharing_scheduling"}, {"score": 0.004796654329628275, "phrase": "problem._heterogeneity"}, {"score": 0.004706206193274572, "phrase": "multicomputer_platforms"}, {"score": 0.004428025469002531, "phrase": "heterogeneous_assemblage"}, {"score": 0.004262539473250432, "phrase": "absolute_terms"}, {"score": 0.003831224748279043, "phrase": "\"average\"_speed"}, {"score": 0.0032519989404960073, "phrase": "heterogeneous_clusters"}, {"score": 0.003094716540812336, "phrase": "rigorous_analysis"}, {"score": 0.003071201732948199, "phrase": "formal_proof"}, {"score": 0.002956272941199248, "phrase": "preceding_questions"}, {"score": 0.0028893844749296863, "phrase": "idealized_framework"}, {"score": 0.002351389889948836, "phrase": "larger_variance"}, {"score": 0.002229043128610864, "phrase": "small_clusters"}, {"score": 0.0021952683716334478, "phrase": "large_ones"}, {"score": 0.0021049977753042253, "phrase": "cluster's_computing_power"}], "paper_keywords": ["Heterogeneous multicomputer systems", " cluster computing", " divisible load scheduling", " worksharing"], "paper_abstract": "Heterogeneity complicates the use of multicomputer platforms. Can it also enhance their performance? How can one measure the power of a heterogeneous assemblage of computers (\"cluster\"), in absolute terms (how powerful is this cluster) and relative terms (which cluster is more powerful)? Is a cluster that has one super-fast computer and the rest of \"average\" speed more/less powerful than one all of whose computers are \"moderately\" fast? If you can replace just one computer in a cluster with a faster one, should you replace the fastest? the slowest? A result concerning \"worksharing\" in heterogeneous clusters provides a highly idealized, yet algorithmically meaningful, framework for studying such questions in a way that admits rigorous analysis and formal proof. We encounter some surprises as we answer the preceding questions (perforce, within the idealized framework). Highlights: (1) If one can replace only one computer in a cluster by a faster one, it is (almost) always most advantageous to replace the fastest one. (2) If the computers in two clusters have the same mean speed, then the cluster with the larger variance in speed is (almost) always more productive (verified analytically for small clusters and empirically for large ones.) (3) Heterogeneity can actually enhance a cluster's computing power.", "paper_title": "HETEROGENEITY IN COMPUTING: INSIGHTS FROM A WORKSHARING SCHEDULING PROBLEM", "paper_id": "WOS:000294809400016"}