{"auto_keywords": [{"score": 0.04952782290107846, "phrase": "tie_strength"}, {"score": 0.010410659126047512, "phrase": "social_network_sites"}, {"score": 0.00869089968477718, "phrase": "facebook"}, {"score": 0.00481495049065317, "phrase": "key_variables"}, {"score": 0.004474366340935036, "phrase": "profile_similarities"}, {"score": 0.004439941010250576, "phrase": "interaction_data"}, {"score": 0.004304856672196293, "phrase": "strong_and_weak_relationships"}, {"score": 0.004046843083499649, "phrase": "online_questionnaire"}, {"score": 0.003789561910103601, "phrase": "subjective_data"}, {"score": 0.0037314328720368453, "phrase": "participants'_opinions"}, {"score": 0.0034140224493254935, "phrase": "data_set"}, {"score": 0.0033357416981328577, "phrase": "strong_and_weak_ties"}, {"score": 0.002846647336160784, "phrase": "emotional_intensity"}, {"score": 0.00282470997972535, "phrase": "stronger_effects"}, {"score": 0.0027175263159330523, "phrase": "predictive_model"}, {"score": 0.0025842289219860795, "phrase": "efficient_method"}, {"score": 0.0025054621733192283, "phrase": "tie_strength_estimates"}, {"score": 0.002345944657572499, "phrase": "link_predictions"}, {"score": 0.0023278569001363263, "phrase": "product_recommendations"}, {"score": 0.002292097733181405, "phrase": "people_searches"}, {"score": 0.0021049977753042253, "phrase": "trusted_or_influential_users"}], "paper_keywords": ["Facebook", " Social network sites", " Algorithm", " Tie strength"], "paper_abstract": "Purpose - The purpose of this paper is to predict tie strength using profile similarities and interaction data between users, and thus distinguish between strong and weak relationships on social network sites (SNSs). Design/methodology/approach - This study developed a program and an online questionnaire to collect the data set from Facebook, and then integrated that data set with a subjective data set consisting of participants' opinions of the strength of their friendships on Facebook. The model developed here for predicting tie strength performed well when was applied on a data set of 6,477 SNSs' ties, distinguishing between strong and weak ties with over 50 percent accuracy. Findings - The results developed an algorithm (predictive model) that quantifies and measures tie strength continuously to bridge the gap between theory and practice. The results found that the variables in the dimension of emotional intensity had stronger effects than other interaction variables. Originality/value - This study developed a predictive model that helps explain the meaning of interaction on SNSs, providing an efficient method to examine tie strength on SNSs. The tie strength estimates can also be used to improve the range and performance of various aspects of SNSs, including link predictions, product recommendations, newsfeeds, people searches, and visualization. Such understanding of the structure of SNSs might lead ultimately to the design of algorithms that can detect trusted or influential users of SNSs.", "paper_title": "Key variables to predict tie strength on social network sites", "paper_id": "WOS:000352105300004"}