{"auto_keywords": [{"score": 0.04599283119366167, "phrase": "supply_chain_integration"}, {"score": 0.014274435153875097, "phrase": "small_and_medium_size_enterprises"}, {"score": 0.010026034707094907, "phrase": "taiwan"}, {"score": 0.00481495049065317, "phrase": "support_supply_chain_integration"}, {"score": 0.004734038956773703, "phrase": "medium_sized_enterprises"}, {"score": 0.004480307124735185, "phrase": "e-government_initiative"}, {"score": 0.0038789122930433305, "phrase": "current_research"}, {"score": 0.0036553070575015344, "phrase": "financial_resources"}, {"score": 0.003578600071301459, "phrase": "necessary_technologies"}, {"score": 0.0031777570808834213, "phrase": "supply_chain_management_technologies"}, {"score": 0.0031242709509664837, "phrase": "geographical_contexts"}, {"score": 0.0030199761431186434, "phrase": "case_study"}, {"score": 0.0027159094186967247, "phrase": "taiwanese_it_manufacturing_companies"}, {"score": 0.0024842242921857705, "phrase": "external_forces"}, {"score": 0.0022434880661725493, "phrase": "supply_chain_networks"}, {"score": 0.0021501863832966966, "phrase": "broader_understanding"}, {"score": 0.0021049977753042253, "phrase": "e-government_initiatives"}], "paper_keywords": ["E-government Policies", " Integration Technologies", " Supply Chain Management", " Information Technology", " SMEs", " Case Studies"], "paper_abstract": "The paper highlights the importance of the e-government initiative to support the supply chain integration among Small and Medium Size Enterprises (SMEs). It has been reported that organisations need to integrate their Information Technology (IT) infrastructures to support the integration of their supply chains to increase their efficiency. However, the current research suggests that Small and Medium Size Enterprises (SMEs), due to their lack of expertise and financial resources to invest in the necessary technologies, seem to need further support from the government in their efforts to adopt IT. Therefore, the role of the government is fundamental in supporting them to adopt supply chain management technologies, especially in geographical contexts such as this of Taiwan. A case study is therefore carried out in this paper to study an initiative taken in Taiwan by the government in order to help the supply chain integration of Taiwanese IT manufacturing companies. The findings suggest that the adoption of IT by SMEs (i.e. suppliers) is very much dependent on external forces (resource-dependency view), thus the government has a very important role to play when it comes to supporting SMEs to join supply chain networks. In doing so, this research provides a broader understanding of the phenomenon of e-government initiatives to support supply chain integration in practice.", "paper_title": "An E-Government Initiative to Support Supply Chain Integration for Small to Medium Sized Enterprises: Successes and Challenges", "paper_id": "WOS:000299651100005"}