{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mobile_commerce_research"}, {"score": 0.0046928556063004214, "phrase": "large_volume"}, {"score": 0.004573842508130535, "phrase": "mobile_commerce"}, {"score": 0.004289291421348352, "phrase": "potential_opportunities"}, {"score": 0.004252707756312684, "phrase": "farther_research"}, {"score": 0.0036605323485683983, "phrase": "m-commerce_research"}, {"score": 0.00350696416714684, "phrase": "m-commerce_technologies"}, {"score": 0.003316884515934182, "phrase": "suitable_classification_scheme"}, {"score": 0.003177687211289478, "phrase": "future_research_directions"}, {"score": 0.002916521664779295, "phrase": "five_distinct_categories"}, {"score": 0.002575385171755899, "phrase": "comprehensive_list"}, {"score": 0.002404522326122611, "phrase": "useful_insights"}, {"score": 0.002353483216544667, "phrase": "m-commerce_literature"}, {"score": 0.0023134312557290043, "phrase": "good_source"}, {"score": 0.002178529882942255, "phrase": "future_directions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["mobile commerce (m-commerce)", " literature review", " framework", " future research"], "paper_abstract": "Although a large volume of literature is available on mobile commerce (m-commerce), the topic is still under development and offers potential opportunities for farther research and applications. Since the subject is at the stage of development, a review of the literature on m-commerce with the objective of bringing to the fore the state-of-art in m-commerce research and applications will initiate further research on the growth of m-commerce technologies. This paper reviews the literature on incommerce and applications using a suitable classification scheme to identify the gap between theory and practice and future research directions. The 149 m-commerce articles are classified and the results of these are presented based on a scheme that consists of five distinct categories: m-commerce theory and research, wireless network infrastructure, mobile middleware, wireless user infrastructure, and m-commerce applications and cases. A comprehensive list of references is presented. We hope that the findings of this research will provide useful insights into the anatomy of m-commerce literature and be a good source for anyone who is interested in m-commerce. The paper also provides some future directions for research. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "A review for mobile commerce research and applications", "paper_id": "WOS:000244023000002"}