{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "practice-linked_pre-visit_electronic_journals"}, {"score": 0.004487989502479992, "phrase": "electronic_health_records"}, {"score": 0.004358368398332723, "phrase": "ehr-connected_patient_portals"}, {"score": 0.004307569753106432, "phrase": "patient_provider_collaboration_tools"}, {"score": 0.004257360656055417, "phrase": "visit-based_care"}, {"score": 0.0041586840496756474, "phrase": "randomized_controlled_trial"}, {"score": 0.0041102032028337366, "phrase": "primary_care_patients"}, {"score": 0.0040622852274783275, "phrase": "pre-visit_electronic_journals"}, {"score": 0.0039449104968131655, "phrase": "ehr-based_medication"}, {"score": 0.0031938648476635225, "phrase": "usage_data"}, {"score": 0.0027741761880779535, "phrase": "surveyed_patients"}, {"score": 0.0021049977753042253, "phrase": "visit_preparation"}], "paper_keywords": [""], "paper_abstract": "Electronic health records (EHRs) and EHR-connected patient portals offer patient provider collaboration tools for visit-based care. During a randomized controlled trial, primary care patients completed pre-visit electronic journals (eJournals) containing EHR-based medication, allergies, and diabetes (study arm 1) or health maintenance, personal history, and family history (study arm 2) topics to share with their provider. Assessment with surveys and usage data showed that among 2027 patients invited to complete an eJournal, 70.3% submitted one and 71.1% of submitters had one opened by their provider. Surveyed patients reported they felt more prepared for the visit (55.9%) and their provider had more accurate information about them (58.0%). More arm 1 versus arm 2 providers reported that eJournals were visit-time neutral (100% vs 53%; p<0.013), helpful to patients in visit preparation (66% vs 20%; p=0.082), and would recommend them to colleagues (78% vs 22%; p=0.0143). eJournal integration into practice warrants further study.", "paper_title": "Implementing practice-linked pre-visit electronic journals in primary care: patient and physician use and satisfaction", "paper_id": "WOS:000281972200003"}