{"auto_keywords": [{"score": 0.04806279063663184, "phrase": "state-decision-action_diagrams"}, {"score": 0.010612387000973441, "phrase": "clinical_algorithms"}, {"score": 0.008516005635923092, "phrase": "care_database"}, {"score": 0.005057194751554797, "phrase": "health-care_procedures"}, {"score": 0.00477079124890959, "phrase": "state-decision-action_model"}, {"score": 0.004514173914270395, "phrase": "electronic_health_records"}, {"score": 0.004377595128584772, "phrase": "explicit_representation"}, {"score": 0.004271300595883407, "phrase": "health-care_organization"}, {"score": 0.004104026260244116, "phrase": "official_and_predefined_protocols"}, {"score": 0.0039070805769954005, "phrase": "knowledge_structures"}, {"score": 0.0037195507046380036, "phrase": "patient_data"}, {"score": 0.00369674903275185, "phrase": "health-care_centres"}, {"score": 0.0036628073805800377, "phrase": "translation_rules"}, {"score": 0.0034549387883559, "phrase": "resulting_state-decision-action_diagram"}, {"score": 0.003360620035679694, "phrase": "new_terminology"}, {"score": 0.0032991709808491147, "phrase": "final_state-decision-action_diagram"}, {"score": 0.0032488198151299826, "phrase": "machine_learning_method"}, {"score": 0.0030550076124316655, "phrase": "spain"}, {"score": 0.0029171727082441244, "phrase": "correct_treatments"}, {"score": 0.00263546540607024, "phrase": "atypical_cases"}, {"score": 0.0025713631281616784, "phrase": "high_level"}, {"score": 0.002462903804873404, "phrase": "coincident_treatment"}, {"score": 0.0024252844944764695, "phrase": "new_methodology"}, {"score": 0.002308712197991419, "phrase": "graphical_representation"}, {"score": 0.0022594858863670153, "phrase": "health-care_organizations"}, {"score": 0.002144252482711611, "phrase": "official_standards"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Machine learning", " Procedural knowledge induction", " Knowledge representation", " State-decision-actions diagrams", " Clinical algorithms"], "paper_abstract": "Objective: To propose a methodology to automatically induce state-decision-action diagrams from health-care databases and electronic health records in order to show health-care professionals an explicit representation of the past health-care procedures carried out in a health-care organization and to use these representations to study the deviations with respect to official and predefined protocols and clinical algorithms. Materials and methods: The methodology is based on two data and knowledge structures: episode of care database and set of rules. These two structures contain, respectively, patient data from health-care centres and the translation rules which are used to adapt the data of the episode of care database to the terminology we want the resulting state-decision-action diagram to have. The data expressed in the new terminology is used to generate the final state-decision-action diagram by means of a machine learning method. Materials and methods: We have performed several tests on the treatment of hypertension with data from the SAGESSA Health-care Group in Spain. The state-decision-action diagrams obtained have been analyzed at the level of their ability to predict correct treatments and at the level of their adherence to the clinical algorithms published by four official health-care organizations. Results: The state-decision-action diagrams obtained represent an average 94.6% of the treatments in the database, only excluding some atypical cases. Moreover, these diagrams show a high level of adherence to the treatment proposed by the National Heart Foundation of Australia and the Spanish Society for Hypertension with about 90.4% of coincident treatment. Conclusions: A new methodology has been developed and validated which automatically induces state-decision-action diagrams which can be used as a graphical representation of the health-care procedures carried out in health-care organizations. The methodology is also a tool to study the adherence of these health-care procedures to the official standards. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic generation of clinical algorithms within the state-decision-action model", "paper_id": "WOS:000305863300039"}