{"auto_keywords": [{"score": 0.009940435832910478, "phrase": "ocmm"}, {"score": 0.0061952659557921825, "phrase": "application_scopes"}, {"score": 0.004688321299229397, "phrase": "basic_solution"}, {"score": 0.003959863717046575, "phrase": "different_application_scopes"}, {"score": 0.0032852337992126564, "phrase": "optimal_choice"}, {"score": 0.0031562971707460802, "phrase": "existing_work"}, {"score": 0.0031006232333900055, "phrase": "new_mobility_management_schemes"}, {"score": 0.0030595112110658675, "phrase": "existing_mobility_management_schemes"}, {"score": 0.002992195343569767, "phrase": "better_alternative"}, {"score": 0.002861961643289598, "phrase": "service_characteristics"}, {"score": 0.0026534064006291853, "phrase": "best_mobility_anchor_point"}, {"score": 0.002470987929071079, "phrase": "simulation_results"}, {"score": 0.00241658945942583, "phrase": "key_parameters"}, {"score": 0.002290858045013009, "phrase": "optimal_regional_size"}, {"score": 0.002123831297790248, "phrase": "total_cost"}, {"score": 0.0021049977753042253, "phrase": "average_registration_and_packet_delivery_costs"}], "paper_keywords": ["Mobile IPv6", " hierarchical mobile IPv6", " application scope", " regional size"], "paper_abstract": "Mobile IPv6 (MIPv6) offers a basic solution to support mobility in IPv6 networks. Although Hierarchical MIPv6 (HMIPv6) has been designed to enhance the performance of MIPv6 by hierarchizing the network, it does not always outperform MIPv6. In fact, two solutions have different application scopes. Existing work studies the impact of various parameters on the performance of MIPv6 and HMIPv6, but without analyzing their application scopes. In this paper, we propose a model to analyze the application scopes of MIPv6 and HMIPv6, through which an Optimal Choice of Mobility Management (OCMM) scheme is designed. Different from the existing work that either propose new mobility management schemes or enhance existing mobility management schemes, OCMM chooses the better alternative between MIPv6 and HMIPv6 according to the mobility and service characteristics of users, addressing whether to hierarchize the network. Besides that, OCMM chooses the best mobility anchor point and regional size when HMIPv6 is adopted, addressing how to hierarchize the network. Simulation results demonstrate the impact of key parameters on the application scopes of MIPv6 and HMIPv6 as well as the optimal regional size of HMIPv6. Finally, we show that OCMM outperforms MIPv6 and HMIPv6 in terms of total cost including average registration and packet delivery costs.", "paper_title": "Mobility in IPv6: Whether and How to Hierarchize the Network?", "paper_id": "WOS:000294162500012"}