{"auto_keywords": [{"score": 0.04867447329166622, "phrase": "visual_elements"}, {"score": 0.021668842138701645, "phrase": "web_pages"}, {"score": 0.00481495049065317, "phrase": "eyetracking_scanpaths_and_the_affecting_factors._web_pages"}, {"score": 0.004621813738791474, "phrase": "sighted_people"}, {"score": 0.00445293569103488, "phrase": "constrained_environments"}, {"score": 0.004387117409226736, "phrase": "visually_disabled_and_small_screen_device_users"}, {"score": 0.004133390261297075, "phrase": "eye_movements"}, {"score": 0.004102719715406821, "phrase": "sighted_users"}, {"score": 0.004072275820209647, "phrase": "good_understanding"}, {"score": 0.003779943062894615, "phrase": "people's_experience"}, {"score": 0.0037518852820756323, "phrase": "constrainted_environments"}, {"score": 0.003405472159599445, "phrase": "people's_eyetracking_data"}, {"score": 0.0033177813460815346, "phrase": "common_scanpath"}, {"score": 0.0029228387900175554, "phrase": "eyetracking_study"}, {"score": 0.002847540262784593, "phrase": "proposed_algorithm"}, {"score": 0.00269263690712392, "phrase": "different_number"}, {"score": 0.0025366596616434793, "phrase": "gender_and_familiarity_factors"}, {"score": 0.002389696110283506, "phrase": "common_scanpaths"}, {"score": 0.002268088741853586, "phrase": "different_techniques"}, {"score": 0.0021607035327962246, "phrase": "hierarchical_structure"}, {"score": 0.0021049977753042253, "phrase": "underlying_cognitive_processes"}], "paper_keywords": ["eyetracking", " scanpaths", " patterns", " commonality", " reengineering"], "paper_abstract": "Web pages are typically decorated with different kinds of visual elements that help sighted people complete their tasks. Unfortunately, people accessing web pages in constrained environments, such as visually disabled and small screen device users, cannot benefit from them. In our previous work, we show that tracking the eye movements of sighted users provide good understanding of how people use these visual elements. We also show that reengineering web pages by using these visual elements can improve people's experience in constrainted environments. However, in order to reengineering web pages based on eyetracking, we first need to aggregate, analyse and understand how a group of people's eyetracking data can be combined to create a common scanpath (namely, eye movement sequence) in terms of visual elements. This paper presents an algorithm that aims to achieve this. This algorithm was developed iteratively and experimentally evaluated with an eyetracking study. This study shows that the proposed algorithm is able to identify patterns in eyetracking scanpaths and it can work well with different number of participants. We then extended our experiments to investigate the effects of the task, gender and familiarity factors on common scanpaths. The results suggest that these factors can cause some differences in common scanpaths. This study also suggests that this algorithm can be improved by considering different techniques for preprocessing the data, by addressing the drawbacks of using the hierarchical structure and by taking into account the underlying cognitive processes.", "paper_title": "PATTERNS IN EYETRACKING SCANPATHS AND THE AFFECTING FACTORS", "paper_id": "WOS:000359178000002"}