{"auto_keywords": [{"score": 0.02360278270849713, "phrase": "energy_efficiency"}, {"score": 0.00481495049065317, "phrase": "energy-efficient_human_activity_recognition"}, {"score": 0.0047035227618053965, "phrase": "daniel_kahneman"}, {"score": 0.004579316323166273, "phrase": "human_decision-making_process"}, {"score": 0.004458375125223899, "phrase": "fast_thinking"}, {"score": 0.004100555318595827, "phrase": "human_activity_recognition"}, {"score": 0.004073196909500369, "phrase": "mobile_devices"}, {"score": 0.003978866233891427, "phrase": "mobile_app"}, {"score": 0.0038867116254051363, "phrase": "general_challenge"}, {"score": 0.0037966832758423883, "phrase": "energy_consumption"}, {"score": 0.0037336520904376687, "phrase": "existing_approaches"}, {"score": 0.003671663469605366, "phrase": "cellular_ids"}, {"score": 0.003445316481824611, "phrase": "battery_drainage"}, {"score": 0.00318984544993994, "phrase": "deliberation_mode"}, {"score": 0.003136857047565403, "phrase": "cell_id_patterns"}, {"score": 0.003043679504527297, "phrase": "intuition_mode"}, {"score": 0.00287514090358681, "phrase": "system_parameters"}, {"score": 0.0027525658515943985, "phrase": "sufficient_confidence"}, {"score": 0.0024725918236048632, "phrase": "activity_recognition"}, {"score": 0.002431489080631481, "phrase": "significant_places"}, {"score": 0.0023434465472518943, "phrase": "real-life_traces"}, {"score": 0.00227378279992074, "phrase": "consistent_results"}, {"score": 0.0022585847551229252, "phrase": "different_participants"}, {"score": 0.0021049977753042253, "phrase": "human_daily_activities"}], "paper_keywords": [""], "paper_abstract": "According to Daniel Kahneman, there are two systems that drive the human decision-making process: The intuitive system that performs the fast thinking, and the deliberative system that does more logical and slower thinking. Inspired by this model, we propose a framework for implementing human activity recognition on mobile devices. In this area, the mobile app is usually always on and the general challenge is how to balance accuracy and energy consumption. However, among existing approaches, those based on cellular IDs consume little power but are less accurate; those based on GPS/Wi-Fi sampling are accurate often at the costs of battery drainage; moreover, previous methods in general do riot improve overtime. To address these challenges, our framework consists of two modes: In the deliberation mode, the system learns cell ID patterns that are trained by existing GPS-/Wi-Fi-based methods; in the intuition mode, only the learned cell ID patterns are used for activity recognition, which is both accurate and energy efficient; system parameters are learned to control the transition from deliberation to intuition, when sufficient confidence is gained, and the transition from intuition to deliberation, when more training is needed. For the scope of this paper, we first elaborate our framework in a subproblem in activity recognition, trip detection, which recognizes significant places and trips between them. For evaluation, we collected real-life traces of six participants over five months. Our experiments demonstrated consistent results across different participants in terms of accuracy and energy efficiency and, more importantly, its fast improvement on energy efficiency over time due to regularities in human daily activities.", "paper_title": "Thinking Fast and Slow: An Approach to Energy-Efficient Human Activity Recognition on Mobile Devices", "paper_id": "WOS:000336891800005"}