{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "model_agent_decision"}, {"score": 0.004758188582347737, "phrase": "economic_experiments"}, {"score": 0.00459186790405058, "phrase": "qualitative_framework"}, {"score": 0.004448892453489832, "phrase": "model_scenarios"}, {"score": 0.004413846562278824, "phrase": "experimental_economic_studies"}, {"score": 0.0040943214728975845, "phrase": "argumentation-based_one"}, {"score": 0.0040300463421312225, "phrase": "social_values"}, {"score": 0.00395111389294443, "phrase": "alternative_action_options"}, {"score": 0.0037828412206668206, "phrase": "dictator_game"}, {"score": 0.003664963414801933, "phrase": "simple_interactions"}, {"score": 0.003042752533935891, "phrase": "purely_self-interested_utility-maximisers"}, {"score": 0.002901538668877986, "phrase": "different_cultures"}, {"score": 0.002486193594641237, "phrase": "agent_systems"}, {"score": 0.0023801608396295374, "phrase": "agents'_choices"}, {"score": 0.002138636271204459, "phrase": "different_outcome_states"}, {"score": 0.0021049977753042253, "phrase": "different_types"}], "paper_keywords": ["Argumentation", " Decision making", " Empirical studies of behaviour"], "paper_abstract": "In this paper we demonstrate how a qualitative framework for decision making can be used to model scenarios from experimental economic studies and we show how our approach explains the results that have been reported from such studies. Our framework is an argumentation-based one in which the social values promoted or demoted by alternative action options are explicitly represented. Our particular representation is used to model the Dictator Game and the Ultimatum Game, which are simple interactions in which it must be decided how a sum of money will be divided between the players in the games. Studies have been conducted into how humans act in such games and the results are not explained by a decision-model that assumes that the participants are purely self-interested utility-maximisers. Some studies further suggest that differences in choices made in different cultures may reflect their day to day behaviour, which can in turn be related to the values of the subjects, and how they order their values. In this paper we show how these interactions can be modelled in agent systems in a framework that makes explicit the reasons for the agents' choices based upon their social values. Our framework is intended for use in situations where agents are required to be adaptable, for example, where agents may prefer different outcome states in transactions involving different types of counter-parties.", "paper_title": "Using argumentation to model agent decision making in economic experiments", "paper_id": "WOS:000300283100006"}