{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "highly_complex_scenes"}, {"score": 0.0046242451772036145, "phrase": "new_strategy"}, {"score": 0.004582897918101983, "phrase": "automatic_object_extraction"}, {"score": 0.00384633057714983, "phrase": "single_view"}, {"score": 0.00333097896868937, "phrase": "fast_segmentation"}, {"score": 0.0030171910207671205, "phrase": "new_distributed_segmentation_technique"}, {"score": 0.0028844769395018595, "phrase": "suitable_observation_directions"}, {"score": 0.0028330357751826934, "phrase": "exploration_viewpoint"}, {"score": 0.002387758958649797, "phrase": "real_complex_scenes"}, {"score": 0.002282667669149476, "phrase": "future_improvements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D segmentation", " object extraction", " occluded scenes", " scene analysis", " unstructured 3D data"], "paper_abstract": "A new strategy for automatic object extraction in highly complex scenes is presented in this paper. The method proposed gives a solution for 3D segmentation avoiding most restrictions imposed in other techniques. Thus, our technique is applicable on unstructured 3D information (i.e. cloud of points), with a single view of the scene, scenes consisting of several objects where contact, occlusion and shadows are allowed, objects with uniform intensity/texture and without restrictions of shape, pose or location. In order to have a fast segmentation stopping criteria, the number of objects in the scene is taken as input. The method is based on a new distributed segmentation technique that explores the 3D data by establishing a set of suitable observation directions. For each exploration viewpoint, a strategy [3D data]-[2D projected data]-[2D segmentation]-[3D segmented data] is accomplished. It can be said that this strategy is different from current 3D segmentation strategies. This method has been successfully tested in our lab on a set of real complex scenes. The results of these experiments, conclusions and future improvements are also shown in the paper. (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Exploration trees on highly complex scenes: A new approach for 3D segmentation", "paper_id": "WOS:000246332300003"}