{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "component-based_communication_frameworks"}, {"score": 0.029588915133989056, "phrase": "meta-communication_channel"}, {"score": 0.003985602342418578, "phrase": "acceptable_tradeoffs"}, {"score": 0.0036179751816682454, "phrase": "component-based_communication_framework"}, {"score": 0.003477505397536663, "phrase": "building_blocks"}, {"score": 0.0033277936960179892, "phrase": "truly_flexible_and_dynamic_component-based_communication_framework"}, {"score": 0.003101503914610488, "phrase": "consistent_way"}, {"score": 0.00307431840409833, "phrase": "multiple_nodes"}, {"score": 0.00303398491761013, "phrase": "meta-communi_cation_channel"}, {"score": 0.002967931416941965, "phrase": "''_brokered_''_communication_methods"}, {"score": 0.002729744174693491, "phrase": "''_weakest_link"}, {"score": 0.002555247330102505, "phrase": "security_point"}, {"score": 0.002499590390751339, "phrase": "limited_connectivity"}, {"score": 0.002298902547676131, "phrase": "aforementioned_limitations"}, {"score": 0.002258745901862197, "phrase": "good_properties"}, {"score": 0.0021049977753042253, "phrase": "software_components"}], "paper_keywords": ["grid networking", " software components", " control channel", " bootstrap connection"], "paper_abstract": "Applications are faced with several network-related problems on current grids: heterogeneous networks, firewalls, NAT, private IP addresses, non-routed networks, performance problems on WAN. Moreover, the requirements concerning communications are varied and the acceptable tradeoffs highly depends on the applications. A solution to reach the flexibility regarding communication on grids is the use of a component-based communication framework. The users then compose their own protocol stacks by assembling building blocks in the way they want. However, a truly flexible and dynamic component-based communication framework needs a meta-communication channel for its out-of-band communications required by dynamic component assembly in a consistent way on multiple nodes. The meta-communi cation channel is useful for some '' brokered '' communication methods, too, and in particular those designed to cross firewalls. The meta-communication channel has often been the '' weakest link '' of component-based communication frameworks: bottleneck for the performance, back-door from the security point of view, and limited connectivity. In this article, we present an architecture for a meta-communication channel that suffers from none of the aforementioned limitations. It exhibits good properties regarding connectivity, security and performance. Thus, the gain in flexibility brought by software components may be fully exploited without trading anything against flexibility.", "paper_title": "Meta-communications in component-based communication frameworks for grids", "paper_id": "WOS:000249052900001"}