{"auto_keywords": [{"score": 0.038343095430468835, "phrase": "wikipedia"}, {"score": 0.00481495049065317, "phrase": "visual_image_retrieval"}, {"score": 0.004741167616693272, "phrase": "new_applications"}, {"score": 0.004614745158543967, "phrase": "huge_data_volume"}, {"score": 0.004579244735256393, "phrase": "community_photo_collections"}, {"score": 0.004491678520807451, "phrase": "popular_subsets"}, {"score": 0.0043215158337835706, "phrase": "wikipedia_articles"}, {"score": 0.0034806529881619454, "phrase": "geo-tagging_process"}, {"score": 0.0033486631403337555, "phrase": "large_scale"}, {"score": 0.0031845067058084583, "phrase": "popular_locations"}, {"score": 0.0029361086955646625, "phrase": "visual_content"}, {"score": 0.0024957862318504753, "phrase": "different_views"}, {"score": 0.0022308329460335985, "phrase": "scene_maps"}, {"score": 0.002171202123281881, "phrase": "challenging_one_million_urban_image_dataset"}], "paper_keywords": ["Image retrieval", " Image clustering", " Sub-linear indexing", " Geotagging", " Location recognition", " Landmark recognition", " Image localization"], "paper_abstract": "New applications are emerging every day exploiting the huge data volume in community photo collections. Most focus on popular subsets, e.g., images containing landmarks or associated to Wikipedia articles. In this work we are concerned with the problem of accurately finding the location where a photo is taken without needing any metadata, that is, solely by its visual content. We also recognize landmarks where applicable, automatically linking them to Wikipedia. We show that the time is right for automating the geo-tagging process, and we show how this can work at large scale. In doing so, we do exploit redundancy of content in popular locations-but unlike most existing solutions, we do not restrict to landmarks. In other words, we can compactly represent the visual content of all thousands of images depicting e.g., the Parthenon and still retrieve any single, isolated, non-landmark image like a house or a graffiti on a wall. Starting from an existing, geo-tagged dataset, we cluster images into sets of different views of the same scene. This is a very efficient, scalable, and fully automated mining process. We then align all views in a set to one reference image and construct a 2D scene map. Our indexing scheme operates directly on scene maps. We evaluate our solution on a challenging one million urban image dataset and provide public access to our service through our online application, VIRaL.", "paper_title": "VIRaL: Visual Image Retrieval and Localization", "paper_id": "WOS:000286472300007"}