{"auto_keywords": [{"score": 0.035271938397409455, "phrase": "third_parties"}, {"score": 0.015582201258123264, "phrase": "patients'_medical_data"}, {"score": 0.01105188994858906, "phrase": "personal_data"}, {"score": 0.007932912090797705, "phrase": "health_data"}, {"score": 0.00481495049065317, "phrase": "electronic_health_records"}, {"score": 0.004605748839642513, "phrase": "health_professionals"}, {"score": 0.00446471538346719, "phrase": "centralized_electronic_health_records"}, {"score": 0.004121490798711703, "phrase": "single_medical_institution"}, {"score": 0.0037043953071235155, "phrase": "personal_health_data"}, {"score": 0.003449972561293443, "phrase": "main_point"}, {"score": 0.003128336741911927, "phrase": "existing_systems"}, {"score": 0.0031006232333900055, "phrase": "microsoft_healthvault"}, {"score": 0.0030732235127871616, "phrase": "google"}, {"score": 0.0030189426536422577, "phrase": "data_protection_acts"}, {"score": 0.0027741761880779535, "phrase": "essential_requirements"}, {"score": 0.002689076130099546, "phrase": "privacy-protecting_information_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health records", " Disclosure of personal data to third parties", " Usage control"], "paper_abstract": "Patients' medical data have been originally generated and maintained by health professionals in several independent electronic health records (EHRs). Centralized electronic health records accumulate medical data of patients to improve their availability and completeness; EHRs are not tied to a single medical institution anymore. Nowadays enterprises with the capacity and knowledge to maintain this kind of databases offer the services of maintaining EHRs and adding personal health data by the patients. These enterprises get access on the patients' medical data and act as a main point for collecting and disclosing personal data to third parties, e. g. among others doctors, healthcare service providers and drug stores. Existing systems like Microsoft HealthVault and Google Health comply with data protection acts by letting the patients decide on the usage and disclosure of their data. But they fail in satisfying essential requirements to privacy. We propose a privacy-protecting information system for controlled disclosure of personal data to third parties. Firstly, patients should be able to express and enforce obligations regarding a disclosure of health data to third parties. Secondly, an organization providing EHRs should neither be able to gain access to these health data nor establish a profile about patients. (c) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Aspects of privacy for electronic health records", "paper_id": "WOS:000286460900005"}