{"auto_keywords": [{"score": 0.027889070906261065, "phrase": "topic-connected_overlay_network"}, {"score": 0.026884097615268443, "phrase": "average_degree"}, {"score": 0.00481495049065317, "phrase": "overlay_network"}, {"score": 0.004466519142879166, "phrase": "fundamental_importance"}, {"score": 0.003548111729206587, "phrase": "possible_maximum_degree"}, {"score": 0.0031399038722901788, "phrase": "logarithmic_approximation_algorithm"}, {"score": 0.002953711377604328, "phrase": "approximation_ratio"}, {"score": 0.0028312983170567948, "phrase": "maximum_degree"}, {"score": 0.002248366278757655, "phrase": "overall_average_node_degree"}], "paper_keywords": ["Communications technology", " peer-to-peer computing"], "paper_abstract": "Designing an overlay network for publish/subscribe communication in a system where nodes may subscribe to many different topics of interest is of fundamental importance. For scalability and efficiency, it is important to keep the degree of the nodes in the publish/subscribe system low. It is only natural then to formalize the following problem: Given a collection of nodes and their topic subscriptions, connect the nodes into a graph that has least possible maximum degree in such a way that for each topic, the graph induced by the nodes interested in is connected. We present the first polynomial-time logarithmic approximation algorithm for this problem and prove an almost tight lower bound on the approximation ratio. Our experimental results show that our algorithm drastically improves the maximum degree of publish/subscribe overlay systems. We also propose a variation of the problem by enforcing that each topic-connected overlay network be of constant diameter while keeping the average degree low. We present three heuristics for this problem that guarantee that each topic-connected overlay network will be of diameter 2 and that aim at keeping the overall average node degree low. Our experimental results validate our algorithms, showing that our algorithms are able to achieve very low diameter without increasing the average degree by much.", "paper_title": "Minimum Maximum-Degree Publish-Subscribe Overlay Network Design", "paper_id": "WOS:000296014000007"}