{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "distribution-based_word_segregation"}, {"score": 0.004637478829869904, "phrase": "novel_corpus-based_method"}, {"score": 0.004011867299107537, "phrase": "multinomial_distribution"}, {"score": 0.003781772207256374, "phrase": "procedurelike_sequential_hypothesis_testing"}, {"score": 0.0036815763368083197, "phrase": "distributionally_similar_words"}, {"score": 0.0030017207229983385, "phrase": "morphological_roots"}, {"score": 0.002890887778279196, "phrase": "primary_objective"}, {"score": 0.002695768552609587, "phrase": "huge_reduction"}, {"score": 0.00266693888510356, "phrase": "dictionary_size"}, {"score": 0.0026384167183586015, "phrase": "classification_accuracies"}, {"score": 0.0025273383208209922, "phrase": "proposed_system"}, {"score": 0.002460295872115956, "phrase": "existing_stemmers"}, {"score": 0.0023950275815082297, "phrase": "-webkb_data"}], "paper_keywords": ["precision and recall", " prototype selection", " stemming", " text categorization"], "paper_abstract": "A novel corpus-based method for stemmer refinement, which can provide improvement in both classification and retrieval, is described. The method models the given words as generated from a multinomial distribution over the topics available in the corpus and includes a procedurelike sequential hypothesis testing that enables grouping together distributionally similar words. The system can refine any stemmer, and its strength can be controlled with parameters that reflect the amount of tolerance to be allowed in computing the similarity between the distributions of two words. Although obtaining the morphological roots of the given words is not the primary objective, the algorithm automatically does that to some extent. Despite a huge reduction in dictionary size, classification accuracies are seen to improve significantly when the proposed system is applied on some existing stemmers for classifying 20 Newsgroups and -WebKB data. The refinements obtained are also suitable for cross-corpus stemming. Regarding retrieval, its superiority is extensively demonstrated with respect to four existing methods.", "paper_title": "Stemming via distribution-based word segregation for classification and retrieval", "paper_id": "WOS:000245109300010"}