{"auto_keywords": [{"score": 0.049505168345722605, "phrase": "unfair_testimonies"}, {"score": 0.007740489563401459, "phrase": "rating_systems"}, {"score": 0.00612133864300141, "phrase": "existing_methods"}, {"score": 0.004897941883343276, "phrase": "testimony_number"}, {"score": 0.004451846834142146, "phrase": "open_issue"}, {"score": 0.004161818683059588, "phrase": "proposed_method"}, {"score": 0.003626000977962191, "phrase": "particular_distribution"}, {"score": 0.0035181731203867456, "phrase": "testimony_filtering"}, {"score": 0.0033929894721242367, "phrase": "specific_rating_systems"}, {"score": 0.0028650312174624635, "phrase": "novel_entropy-based_method"}, {"score": 0.0027630232270330402, "phrase": "testimony_quality"}, {"score": 0.0024632912250657636, "phrase": "rating_distribution"}, {"score": 0.0022633993976138387, "phrase": "experimental_results"}], "paper_keywords": ["rating systems", " reputation", " entropy", " unfair testimony", " filtering"], "paper_abstract": "How to mitigate the influence of unfair testimonies remains an open issue in the research of rating systems. Methods have been proposed to filter the unfair testimonies in order to mitigate the influence of unfair testimonies. However, existing methods depend on assumptions that ratings follow a particular distribution to carry out the testimony filtering. This constrains them in specific rating systems and hinders their applications in other reputation systems. Moreover, existing methods do not scale well with the increase of testimony number due to their iterative nature. In this paper, a novel entropy-based method is proposed to measure the testimony quality, based on which unfair testimonies are further filtered. The proposed method does not require the assumption regarding the rating distribution. Moreover, it scales linearly with the increase of the testimony number. Experimental results show that the proposed method is effective in mitigating the influence of various types of unfair testimonies.", "paper_title": "An entropy-based approach to protecting rating systems from unfair testimonies", "paper_id": "WOS:000240524000004"}