{"auto_keywords": [{"score": 0.046291195944410904, "phrase": "twitter"}, {"score": 0.010326683349764068, "phrase": "weight_loss_attempt"}, {"score": 0.004298006360831255, "phrase": "positive_and_negative_social_influences"}, {"score": 0.004052701031142039, "phrase": "methods_participants"}, {"score": 0.003703380599999214, "phrase": "brief_survey"}, {"score": 0.0035750047462243836, "phrase": "offline_friends"}, {"score": 0.002926973459215349, "phrase": "facebook_friends"}, {"score": 0.002892729377519916, "phrase": "positive_social_influence"}, {"score": 0.0028477314805751153, "phrase": "facebook"}, {"score": 0.002792375587031108, "phrase": "greater_weight_loss"}, {"score": 0.0027705505273051007, "phrase": "participants'_most_recent_weight_loss_attempt"}, {"score": 0.002612194827110595, "phrase": "weight_loss"}, {"score": 0.0025917743904900576, "phrase": "social_support"}, {"score": 0.0024150092189446424, "phrase": "personal_connection"}, {"score": 0.0023961265476627166, "phrase": "discussion_people"}, {"score": 0.002206536029072657, "phrase": "social_networks"}, {"score": 0.0021049977753042253, "phrase": "weight_loss_social_support"}], "paper_keywords": [""], "paper_abstract": "Objective The purpose of this study was to describe adults who use Twitter during a weight loss attempt and to compare the positive and negative social influences they experience from their offline friends, online friends, and family members. Materials and methods Participants (N= 100, 80% female, mean age= 37.65, SD= 8.42) were recruited from Twitter. They completed a brief survey about their experiences discussing their weight loss attempt with their online and offline friends and provided responses to open-ended questions on the benefits and drawbacks of discussing weight on Twitter, Facebook, and weight-specific social networks. Results Participants rated their connections on Twitter and weight loss-specific social networks to be significantly greater sources of positive social influence for their weight loss (F(3)= 3.47; p< 0.001) and significantly lesser sources of negative social influence (F(3)= 40.39 and F(3)= 33.68 (both p< 0.001)) than their offline friends, family, and Facebook friends. Greater positive social influence from Twitter and Facebook friends was associated with greater weight loss in participants' most recent weight loss attempt (r=0.30, r=0.32; p< 0.01). The most commonly reported benefits of tweeting about weight loss include social support, information, and accountability. The most common drawbacks reported are that interactions were too brief and lacked personal connection. Discussion People who discuss their weight loss on Twitter report more social support and less negativity from their Twitter friends than their Facebook friends and in-person relationships. Conclusions Online social networks should be explored as a tool for connecting patients who lack weight loss social support from their in-person relationships.", "paper_title": "Tweeting it off: characteristics of adults who tweet about a weight loss attempt", "paper_id": "WOS:000343776700014"}