{"auto_keywords": [{"score": 0.004637478829869904, "phrase": "new_trend"}, {"score": 0.0045726187330434025, "phrase": "dual-core_and_quad-core_processors"}, {"score": 0.004342522991435941, "phrase": "multimedia"}, {"score": 0.004104456271230213, "phrase": "urgent_need"}, {"score": 0.004047020753789236, "phrase": "parallel_coding_algorithms"}, {"score": 0.003897742942358768, "phrase": "start_point"}, {"score": 0.003789395499639015, "phrase": "pure_line"}, {"score": 0.0037188360359702182, "phrase": "line_coding_scheme"}, {"score": 0.003548111729206587, "phrase": "lblc"}, {"score": 0.0034984340449789745, "phrase": "input_image"}, {"score": 0.003275615868824503, "phrase": "small_fixed-length_segments"}, {"score": 0.003125175084962886, "phrase": "entropy_coding"}, {"score": 0.002953711377604328, "phrase": "general-purpose_computer_show"}, {"score": 0.002470237978694949, "phrase": "high_parallelism"}, {"score": 0.0024356148906608025, "phrase": "proposed_scheme"}, {"score": 0.0023127544795063263, "phrase": "middle_bit_rates"}, {"score": 0.002280333649167796, "phrase": "near-lossless_coding"}], "paper_keywords": ["Image coding", " lossless coding", " many cores"], "paper_abstract": "Computers are developing along with a new trend from the dual-core and quad-core processors to ones with tens or even hundreds of cores. Multimedia, as one of the most important applications in computers, has an urgent need to design parallel coding algorithms for compression. Taking intraframe/image coding as a start point, this paper proposes a pure line-by-line coding scheme (LBLC) to meet the need. In LBLC, an input image is processed line by line sequentially, and each line is divided into small fixed-length segments. The compression of all segments from prediction to entropy coding is completely independent and concurrent at many cores. Results on a general-purpose computer show that our scheme can get a 13.9 times speedup with 15 cores at the encoder and a 10.3 times speedup at the decoder. Ideally, such near-linear speeding relation with the number of cores can be kept for more than 100 cores. In addition to the high parallelism, the proposed scheme can perform comparatively or even better than the H. 264 high profile above middle bit rates. At near-lossless coding, it outperforms H. 264 more than 10 dB. At lossless coding, up to 14% bit-rate reduction is observed compared with H. 264 lossless coding at the high 4: 4: 4 profile.", "paper_title": "Highly Parallel Line-Based Image Coding for Many Cores", "paper_id": "WOS:000298325500016"}