{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "human_and_mouse"}, {"score": 0.0486868426803837, "phrase": "non-canonical_nucleation_bulges"}, {"score": 0.04078771363058071, "phrase": "mirna_target_sites"}, {"score": 0.004744437370338926, "phrase": "target_sites"}, {"score": 0.004185108816866677, "phrase": "post-transcriptional_repression"}, {"score": 0.003974349782102708, "phrase": "transcriptome-wide_experimental_method"}, {"score": 0.0036373553416391823, "phrase": "novel_non-canonical_target_site"}, {"score": 0.0029576827451501956, "phrase": "'pivot_pairing_rule"}, {"score": 0.0028928306994090453, "phrase": "sequence_conservation"}, {"score": 0.0026277995163948263, "phrase": "functional_studies"}, {"score": 0.0025892330566358503, "phrase": "non-canonical_mirna_targets"}, {"score": 0.0022005118194652704, "phrase": "mirna-bound_regions"}], "paper_keywords": [""], "paper_abstract": "MicroRNAs (miRNAs) regulate various biological functions by binding hundreds of transcripts to impart post-transcriptional repression. Recently, by applying a transcriptome-wide experimental method for identifying miRNA target sites (Ago HITS-CLIP), a novel non-canonical target site, named 'nucleation bulge', was discovered as widespread, functional and evolutionally conserved. Although such non-canonical nucleation bulges have been proven to be predictive by using 'pivot pairing rule' and sequence conservation, this approach has not been applied yet. To facilitate the functional studies of non-canonical miRNA targets, we implement miRTCat: a comprehensive searchable map of miRNA target sites, including non-canonical nucleation bulges, not only mapped in experimentally verified miRNA-bound regions but also predicted in all 30-untranslated regions (30-UTRs) derived from human and mouse (similar to 15.6% as expected false-positive results).", "paper_title": "miRTCat: a comprehensive map of human and mouse microRNA target sites including non-canonical nucleation bulges", "paper_id": "WOS:000322337000011"}