{"auto_keywords": [{"score": 0.004747997855358171, "phrase": "group_support_systems"}, {"score": 0.004681971826924847, "phrase": "group_processes"}, {"score": 0.0045846424310611745, "phrase": "outcomes."}, {"score": 0.004334832612029898, "phrase": "interdisciplinary_research"}, {"score": 0.0040133278382101885, "phrase": "proceedings_publications"}, {"score": 0.003715579364728729, "phrase": "adaptive_structuration_theory"}, {"score": 0.0027100527874262446, "phrase": "complex_tapestry"}, {"score": 0.0026166287606163145, "phrase": "laboratory_experiments"}, {"score": 0.0025264171945423254, "phrase": "basic_theoretical_framework"}, {"score": 0.0024912073108138613, "phrase": "experimental_strategy"}, {"score": 0.002422249273477746, "phrase": "field_study_design"}, {"score": 0.0021049977753042253, "phrase": "contemporary_theory"}], "paper_keywords": ["Group decision support", " Structuration theory", " Collaboration technology", " Decision support", " Group communication"], "paper_abstract": "Journal the Association for Information Systems The Minnesota GDSS Research Project is a 20-year program of interdisciplinary research that has generated more than 80 articles, chapters, dissertations, and proceedings publications and has influenced other researchers who developed their own niches. Grounded in Adaptive Structuration Theory, which emerged and evolved as the research unfolded, the project studied the impact of technology characteristics (level of support, restrictiveness) and other support (training, heuristics, facilitation) on group processes and outcomes for a range of tasks (problem definition, decision making, planning). The project entailed a complex tapestry of a series of laboratory experiments and two major field studies. The basic theoretical framework, experimental strategy and design, field study design, and results are summarized, along with a discussion of the significance and implications of the project for contemporary theory and practice.", "paper_title": "The Minnesota GDSS Research Project: Group Support Systems, Group Processes, and Outcomes", "paper_id": "WOS:000261358100002"}