{"auto_keywords": [{"score": 0.038876151391192805, "phrase": "secure_positioning"}, {"score": 0.00481495049065317, "phrase": "theoretical_study"}, {"score": 0.004772818068176176, "phrase": "cryptographic_protocols"}, {"score": 0.00431388720289049, "phrase": "central_task"}, {"score": 0.0032697235411641695, "phrase": "dziembowski's_bounded_retrieval_model"}, {"score": 0.003198554193075258, "phrase": "maurer's_bounded_storage_model"}, {"score": 0.002623669616798891, "phrase": "secure_multiparty_computation"}, {"score": 0.002434396049547248, "phrase": "sound_theoretical_footing"}, {"score": 0.002381365139274329, "phrase": "strong_impossibility_result"}, {"score": 0.0023090525096074264, "phrase": "previous_attempts"}, {"score": 0.0022290883852844057, "phrase": "positive_results"}, {"score": 0.0021901485584955487, "phrase": "bounded-retrieval_framework"}, {"score": 0.0021613897794439227, "phrase": "fruitful_one"}, {"score": 0.0021049977753042253, "phrase": "position-based_cryptography"}], "paper_keywords": ["cryptographic protocols", " secure positioning", " extractors", " bounded retrieval model"], "paper_abstract": "In this paper, we initiate the theoretical study of cryptographic protocols where the identity, or other credentials and inputs, of a party are derived from its geographic location. We start by considering the central task in this setting, i.e., securely verifying the position of a device. Despite much work in this area, we show that in the vanilla (or standard) model, the above task (i.e., of secure positioning) is impossible to achieve, even if we assume that the adversary is computationally bounded. In light of the above impossibility result, we then turn to Dziembowski's bounded retrieval model (a variant of Maurer's bounded storage model) and formalize and construct information theoretically secure protocols for two fundamental tasks: secure positioning and position-based key exchange. We then show that these tasks are in fact universal in this setting-we show how we can use them to realize secure multiparty computation. Our main contribution in this paper is threefold: to place the problem of secure positioning on a sound theoretical footing; to prove a strong impossibility result that simultaneously shows the insecurity of previous attempts at the problem; and to present positive results showing that the bounded-retrieval framework is a fruitful one to study the foundations of position-based cryptography.", "paper_title": "POSITION-BASED CRYPTOGRAPHY", "paper_id": "WOS:000341576200003"}