{"auto_keywords": [{"score": 0.03669884834098149, "phrase": "diverse_inhibitor_structures"}, {"score": 0.03507569752211344, "phrase": "comfa_and_comsia_models"}, {"score": 0.031151190237917438, "phrase": "training_set_inhibitors"}, {"score": 0.004746263721902197, "phrase": "optimizing_b-raf"}, {"score": 0.004562362497952548, "phrase": "raf_family"}, {"score": 0.0042920078348374375, "phrase": "b-raf"}, {"score": 0.0042459818200777846, "phrase": "keen_interest"}, {"score": 0.004215571179806372, "phrase": "cancer_therapy"}, {"score": 0.004023120753104693, "phrase": "first_combination_approach"}, {"score": 0.003677280504320636, "phrase": "potential_b-raf_inhibitors"}, {"score": 0.0036247638406450735, "phrase": "ten_phmodels"}, {"score": 0.0035473867669654174, "phrase": "hypogen_best_algorithm"}, {"score": 0.003509317669345521, "phrase": "flexible_fit_method"}, {"score": 0.003385336776758738, "phrase": "alignment_rule"}, {"score": 0.0031277316566463978, "phrase": "predication_accuracy"}, {"score": 0.0030941521409613417, "phrase": "combination_models"}, {"score": 0.0030609320300175953, "phrase": "previously_proposed_combination_approaches"}, {"score": 0.003006353490112716, "phrase": "common_factor"}, {"score": 0.0028689475587958917, "phrase": "set_inhibitors"}, {"score": 0.0026315183701883437, "phrase": "partial_least-squares_validation"}, {"score": 0.0026032523182547003, "phrase": "best_validation_results"}, {"score": 0.0023033100935570755, "phrase": "satisfied_predication_accuracy"}, {"score": 0.0022298571016688335, "phrase": "hit_test_score"}, {"score": 0.0021049977753042253, "phrase": "diverse_b-raf_inhibitors"}], "paper_keywords": [""], "paper_abstract": "B-Raf is a member of the RAF family of serine/threonine kinases: it mediates cell, division, differentiation, and apoptosis signals through the RAS-RAF-MAPK pathway. Thus B-Raf is of keen interest in cancer therapy, such as melanoma. In this study, we propose the first Combination approach to integrate the pharmacophore (PhModel), CoMFA, and CoMSIA models for B-Raf, and this approach could be used for screening and optimizing potential B-Raf inhibitors in silico. Ten PhModels were generated based on the HypoGen BEST algorithm with the flexible fit method and diverse inhibitor structures. Each PhModel was designated to the alignment rule and screening interface for CoMFA and CoMSIA models. Therefore, CoMFA and CoMSIA models could align and recognize diverse inhibitor structures. We used two quality validation methods to test the predication accuracy of these combination models In the previously proposed combination approaches, they have a common factor in that the number of training set inhibitors is greater than that of testing set inhibitors. In our study, the 189 known diverse series B-Raf inhibitors, which are 7-fold the number of training set inhibitors, were used as a testing set in the partial least-squares validation. The best validation results were made by the CoMFA09 and CoMSIA09 models based on the Hypo09 alignment model. The predictive r(pred)(2) values of 0.56 and 0.56 were derived from the CoMFA09 and CoMSIA09 models, respectively. The CoMFA09 and CoMSIA09 models also had a satisfied predication accuracy of 77.78% and 80%, and the goodness of hit test score of 0.675 and 0.699, respectively. These results indicate that our combination approach could effectively identify diverse B-Raf inhibitors and predict the activity.", "paper_title": "Development of Novel 3D-QSAR Combination Approach for Screening and Optimizing B-Raf Inhibitors in silico", "paper_id": "WOS:000287685700020"}