{"auto_keywords": [{"score": 0.04925367071541481, "phrase": "sliding_window"}, {"score": 0.021879277590265762, "phrase": "frequent_itemsets"}, {"score": 0.010475642272129285, "phrase": "data_stream"}, {"score": 0.009566049208217195, "phrase": "synopsis_data_structure"}, {"score": 0.006227924888967178, "phrase": "boundary_movements"}, {"score": 0.0061473246362243675, "phrase": "cet."}, {"score": 0.00481495049065317, "phrase": "closed_frequent_itemsets"}, {"score": 0.0044718206943536514, "phrase": "data_stream_sliding_window"}, {"score": 0.00443308765153716, "phrase": "limited_memory_space"}, {"score": 0.004099183062034004, "phrase": "current_closed_frequent_itemsets"}, {"score": 0.0037903327482565097, "phrase": "possible_itemsets"}, {"score": 0.0035974243349266894, "phrase": "new_itemsets"}, {"score": 0.003399466007862412, "phrase": "compact_data_structure"}, {"score": 0.00321236577162671, "phrase": "dynamically_selected_set"}, {"score": 0.0031023662967184216, "phrase": "selected_itemsets"}, {"score": 0.002722288966917744, "phrase": "status_change"}, {"score": 0.002266931093770838, "phrase": "mining_transactions"}, {"score": 0.0021049977753042253, "phrase": "representative_algorithms"}], "paper_keywords": ["data streams", " sliding window", " closed frequent itemset", " incremental learning"], "paper_abstract": "This paper considers the problem of mining closed frequent itemsets over a data stream sliding window using limited memory space. We design a synopsis data structure to monitor transactions in the sliding window so that we can output the current closed frequent itemsets at any time. Due to time and memory constraints, the synopsis data structure cannot monitor all possible itemsets. However, monitoring only frequent itemsets will make it impossible to detect new itemsets when they become frequent. In this paper, we introduce a compact data structure, the closed enumeration tree (CET), to maintain a dynamically selected set of itemsets over a sliding window. The selected itemsets contain a boundary between closed frequent itemsets and the rest of the itemsets. Concept drifts in a data stream are reflected by boundary movements in the CET. In other words, a status change of any itemset (e.g., from non-frequent to frequent) must occur through the boundary. Because the boundary is relatively stable, the cost of mining closed frequent itemsets over a sliding window is dramatically reduced to that of mining transactions that can possibly cause boundary movements in the CET. Our experiments show that our algorithm performs much better than representative algorithms for the sate-of-the-art approaches.", "paper_title": "Catch the moment: maintaining closed frequent itemsets over a data stream sliding window", "paper_id": "WOS:000241961800001"}