{"auto_keywords": [{"score": 0.049568154654955725, "phrase": "clinical_work_processes"}, {"score": 0.043666205706024704, "phrase": "health_informatics"}, {"score": 0.04006457389992901, "phrase": "health_it_implementation"}, {"score": 0.00481495049065317, "phrase": "motion_method"}, {"score": 0.004596192494271827, "phrase": "standardized_research"}, {"score": 0.003997533498401968, "phrase": "empirical_studies"}, {"score": 0.0036292245355184576, "phrase": "suggested_'checklist"}, {"score": 0.0035393874762182486, "phrase": "compatible_and_comparable_results"}, {"score": 0.00347657813672945, "phrase": "checklist_stamp"}, {"score": 0.0033663073782936952, "phrase": "results_stamp"}, {"score": 0.0033303306367699816, "phrase": "minimum_set"}, {"score": 0.0032712190037495975, "phrase": "eight_key_areas"}, {"score": 0.0031902155632863236, "phrase": "'ancillary_data'_area"}, {"score": 0.002896071795090179, "phrase": "clinical_work"}, {"score": 0.002834470668509792, "phrase": "considerable_inconsistencies"}, {"score": 0.002619571161767134, "phrase": "significant_impact"}, {"score": 0.0023694065215394593, "phrase": "ten_research"}, {"score": 0.0023024126375034066, "phrase": "initial_attempt"}, {"score": 0.002253410447951689, "phrase": "suggested_checklist"}, {"score": 0.0021430808503936963, "phrase": "meaningful_insights"}, {"score": 0.0021049977753042253, "phrase": "across-study_synthesis"}], "paper_keywords": [""], "paper_abstract": "Objective To identify ways for improving the consistency of design, conduct, and results reporting of time and motion (TEM) research in health informatics. Materials and methods We analyzed the commonalities and divergences of empirical studies published 1990-2010 that have applied the T&M approach to examine the impact of health IT implementation on clinical work processes and workflow. The analysis led to the development of a suggested 'checklist' intended to help future T&M research produce compatible and comparable results. We call this checklist STAMP (Suggested Time And Motion Procedures). Results STAMP outlines a minimum set of 29 data/information elements organized into eight key areas, plus three supplemental elements contained in an 'Ancillary Data' area, that researchers may consider collecting and reporting in their future T&M endeavors. Discussion TEM is generally regarded as the most reliable approach for assessing the impact of health IT implementation on clinical work. However, there exist considerable inconsistencies in how previous TEN studies were conducted and/or how their results were reported, many of which do not seem necessary yet can have a significant impact on quality of research and generalisability of results. Therefore, we deem it is time to call for standards that can help improve the consistency of TEN research in health informatics. This study represents an initial attempt. Conclusion We developed a suggested checklist to improve the methodological and results reporting consistency of T&M research, so that meaningful insights can be derived from across-study synthesis and health informatics, as a field, will be able to accumulate knowledge from these studies.", "paper_title": "Using the time and motion method to study clinical work processes and workflow: methodological inconsistencies and a call for standardized research", "paper_id": "WOS:000294572000028"}