{"auto_keywords": [{"score": 0.023407103370246443, "phrase": "fpras"}, {"score": 0.00481495049065317, "phrase": "fixation_probabilities"}, {"score": 0.004760518730536645, "phrase": "generalized_moran_process"}, {"score": 0.004671156704912419, "phrase": "moran_process"}, {"score": 0.004583464412234181, "phrase": "lieberman_et_al"}, {"score": 0.004184825434585617, "phrase": "time_step"}, {"score": 0.0038207243221070166, "phrase": "neighbouring_vertex"}, {"score": 0.00362308996613223, "phrase": "initial_population"}, {"score": 0.0035685175471526823, "phrase": "single_mutant"}, {"score": 0.0032702516771609957, "phrase": "main_quantities"}, {"score": 0.0030658872249549893, "phrase": "whole_graph"}, {"score": 0.0027566738323014, "phrase": "standard_markov_chain_techniques"}, {"score": 0.0026945722090537397, "phrase": "linear_equations"}, {"score": 0.002497470177389344, "phrase": "high_probability"}, {"score": 0.0022115879730677, "phrase": "fully_polynomial_randomized_approximation_schemes"}, {"score": 0.002121056250381627, "phrase": "ra_parts"}], "paper_keywords": ["Evolutionary dynamics", " Markov-chain Monte Carlo", " Approximation algorithm"], "paper_abstract": "We consider the Moran process, as generalized by Lieberman et al. (Nature 433:312-316, 2005). A population resides on the vertices of a finite, connected, undirected graph and, at each time step, an individual is chosen at random with probability proportional to its assigned \"fitness\" value. It reproduces, placing a copy of itself on a neighbouring vertex chosen uniformly at random, replacing the individual that was there. The initial population consists of a single mutant of fitness r > 0 placed uniformly at random, with every other vertex occupied by an individual of fitness 1. The main quantities of interest are the probabilities that the descendants of the initial mutant come to occupy the whole graph (fixation) and that they die out (extinction); almost surely, these are the only possibilities. In general, exact computation of these quantities by standard Markov chain techniques requires solving a system of linear equations of size exponential in the order of the graph so is not feasible. We show that, with high probability, the number of steps needed to reach fixation or extinction is bounded by a polynomial in the number of vertices in the graph. This bound allows us to construct fully polynomial randomized approximation schemes (FPRAS) for the probability of fixation (when ra parts per thousand yen1) and of extinction (for all r > 0).", "paper_title": "Approximating Fixation Probabilities in the Generalized Moran Process", "paper_id": "WOS:000332582900004"}