{"auto_keywords": [{"score": 0.038661520814563984, "phrase": "monitoring_sets"}, {"score": 0.004717125879761534, "phrase": "stationary_targets"}, {"score": 0.004401342842183475, "phrase": "target_monitoring_problem"}, {"score": 0.003696219600832839, "phrase": "large_number"}, {"score": 0.003457414453525907, "phrase": "main_issues"}, {"score": 0.0034396947486115812, "phrase": "wireless_sensor_networks"}, {"score": 0.0033524446366638436, "phrase": "direct_impact"}, {"score": 0.0033011569787033297, "phrase": "sensor_networks"}, {"score": 0.0032009160232892046, "phrase": "monitoring_responsibilities"}, {"score": 0.0030640804704319255, "phrase": "individual_nodes"}, {"score": 0.002963390095037466, "phrase": "localized_algorithm"}, {"score": 0.0027575842698911173, "phrase": "main_idea"}, {"score": 0.002632871981677528, "phrase": "previous_monitoring_sets"}, {"score": 0.002456272788591051, "phrase": "lexicographically_smallest_sensor"}, {"score": 0.0024000726315182826, "phrase": "special_instances"}, {"score": 0.0023633203679997135, "phrase": "optimum_result"}, {"score": 0.002262209824105154, "phrase": "monitoring_set"}, {"score": 0.00215430337354492, "phrase": "extensive_simulation_results"}, {"score": 0.0021049977753042253, "phrase": "randomly_generated_graphs"}], "paper_keywords": ["Wireless sensor networks", " target monitoring", " localized algorithm", " monitoring schedule"], "paper_abstract": "We consider the following target monitoring problem: Given a set of stationary targets T = {t(1), ..., t(m)} and a set V = {v(1), ..., v(n)) of sensors, the target monitoring problem asks for generating a family of subsets of sensors V(1), ..., V(s) called moniloring sets, such that each V(i) monitors all targets. In doing so, the objective of this problem is to maximize z = s/k, where k = max(vj is an element of V) vertical bar{i : v(j) is an element of V(i)}vertical bar. Maximizing z means generating a large number of monitoring sets and minimizing the number of frequencies of a sensor (or node) in these sets. As energy is one of the main issues of wireless sensor networks and sensing consumes energy, maximizing z has a direct impact in prolonging the lifetime of sensor networks. This is because by maximizing z, we distribute the monitoring responsibilities to all sensors as equally as possible and at the same time, reduce the participations of individual nodes in these monitoring sets. Towards achieving this goal, we present a localized algorithm. The algorithm is simple and requires each node to know only its 2-hop neighborhood. Furthermore, nodes do not need to know their geographic positions. In short, the main idea is that each node maintains a record (counter, ID), where counter is the number of previous monitoring sets in which the node has been selected to monitor the targets. To select sensors for the next monitoring set, for each target, the lexicographically smallest sensor covering it, is selected. We provide special instances where the algorithm obtains an optimum result. As a by-product of the algorithm, it is shown that the size of a monitoring set is at most a constant times the size of a minimum monitoring set when the number of targets is a constant. We present extensive simulation results to evaluate the performance of the algorithm in randomly generated graphs.", "paper_title": "Target Monitoring in Wireless Sensor Networks: A Localized Approach", "paper_id": "WOS:000274698400005"}