{"auto_keywords": [{"score": 0.047727054184086584, "phrase": "short-term_scheduling_problem"}, {"score": 0.04112020303210455, "phrase": "operation_decision"}, {"score": 0.028511727551629628, "phrase": "refining_schedule"}, {"score": 0.00481495049065317, "phrase": "multiple_distiller_crude_oil_operations"}, {"score": 0.004734853555630616, "phrase": "oil_residency_time_constraint"}, {"score": 0.004281372589330329, "phrase": "existing_approaches"}, {"score": 0.004192484908247302, "phrase": "infeasible_solution"}, {"score": 0.003986581218661184, "phrase": "control_theory_perspective"}, {"score": 0.003665552439863732, "phrase": "schedulability_analysis"}, {"score": 0.0035444736871640147, "phrase": "schedulability_conditions"}, {"score": 0.0034418037573506837, "phrase": "petri_net_theory"}, {"score": 0.0028015105858516702, "phrase": "safeness_conditions"}, {"score": 0.002778064757980489, "phrase": "proved_results"}, {"score": 0.002630364569659529, "phrase": "feasible_detailed_schedule"}, {"score": 0.002511522462767081, "phrase": "operation_decisions"}, {"score": 0.002367983991444061, "phrase": "starting_time"}, {"score": 0.002289667393538803, "phrase": "continuous_time_point"}, {"score": 0.0021049977753042253, "phrase": "mathematical_programming_methods"}], "paper_keywords": ["Hybrid model", " hybrid Petri net", " oil refinery", " optimality", " Petri net (PN)", " scheduling"], "paper_abstract": "Because of the complexity of a short-term scheduling problem for crude oil operations, some constraints are ignored in modeling the system by the existing approaches, leading to an infeasible solution. To avoid this, the short-term scheduling problem can be studied in control theory perspective by viewing an operation decision in the schedule as a control. With this idea, this paper conducts the schedulability analysis for systems with two and more than two distillers, and the schedulability conditions are presented with the help of Petri net theory. It shows that the number of charging tanks and their capacity, the amount of crude oil of different types in the charging tanks, the oil transportation rate of,the pipeline, and the production rate of the system affect the safeness of the system. It also presents the conditions under which the system can reach its maximal production rate. With the safeness conditions and proved results presented in this paper, if a refining schedule is realizable, a feasible detailed schedule for the refining schedule can be easily obtained by creating the operation decisions for the schedule one by one. In the schedule obtained, the starting time of each operation decision can be at any continuous time point, and the schedule is certainly feasible, which overcomes the difficulty faced by techniques that are based on mathematical programming methods.", "paper_title": "Short-Term Schedulability Analysis of Multiple Distiller Crude Oil Operations in Refinery With Oil Residency Time Constraint", "paper_id": "WOS:000262328400001"}