{"auto_keywords": [{"score": 0.04712665802421912, "phrase": "online_behavior"}, {"score": 0.004734038956773703, "phrase": "uk_blogging_strategies"}, {"score": 0.004404994123834589, "phrase": "offline_world"}, {"score": 0.004240116703465252, "phrase": "important_factors"}, {"score": 0.004151188559520802, "phrase": "communication_strategies"}, {"score": 0.004064117897000019, "phrase": "online_space"}, {"score": 0.0037336520904376687, "phrase": "blog_authors"}, {"score": 0.0033865859510157238, "phrase": "blog_author"}, {"score": 0.0033437537557378157, "phrase": "limited_effect"}, {"score": 0.002944039482467119, "phrase": "important_influence"}, {"score": 0.002833689453299307, "phrase": "diary_genre"}, {"score": 0.002505412457777352, "phrase": "language_use"}, {"score": 0.0024527767211457046, "phrase": "younger_bloggers"}, {"score": 0.0021229583685841405, "phrase": "language_style"}, {"score": 0.0021049977753042253, "phrase": "self-disclosure_patterns"}], "paper_keywords": [""], "paper_abstract": "There is an abundance of evidence to suggest that online behavior differs from behaviors in the offline world, and that there are a number of important factors which may affect the communication strategies of people within an online space. This article examines some of these, namely, whether the sex, age, and identifiability of blog authors, as well as the genre of communication, affect communication strategies. Findings suggest that the level of identifiability of the blog author has a limited effect upon their communication strategies. However, sex appeared to influence online behavior in so far as men were more likely to swear and attack others in their blogs. Genre had an important influence on disclosure with more self-disclosure taking place in the diary genre (i.e., blogs in which people talk about their own lives) comparative to the filter genre (i.e., blogs in which people talk about events external to their lives). Age affected both self-disclosure and language use. For example, younger bloggers tended to use more swearing, express more negative emotions and disclose more personal information about others. These findings suggest that age, sex, genre, and identifiability form a cluster of variables that influence the language style and self-disclosure patterns of bloggers; however, the level of identifiability of the blogger may be less important in this respect. Implications of these findings are discussed.", "paper_title": "Sex, blogs, and baring your soul: Factors influencing UK blogging strategies", "paper_id": "WOS:000323388100010"}