{"auto_keywords": [{"score": 0.04117275374122391, "phrase": "sequences'_behaviors"}, {"score": 0.015719716506582538, "phrase": "sequential_pattern_mining"}, {"score": 0.01104348273247463, "phrase": "discovered_patterns"}, {"score": 0.0047468516620285525, "phrase": "important_data-mining_method"}, {"score": 0.0046797114400479135, "phrase": "time-related_behavior"}, {"score": 0.004337276328199398, "phrase": "medical_records"}, {"score": 0.004296264970612285, "phrase": "sales_analysis"}, {"score": 0.004175533280178052, "phrase": "existing_methods"}, {"score": 0.003154360892955196, "phrase": "traditional_sequential_pattern_mining"}, {"score": 0.002965229277927781, "phrase": "latest_behaviors"}, {"score": 0.002937153116494391, "phrase": "sequence_databases"}, {"score": 0.002696101728474703, "phrase": "new_patterns"}, {"score": 0.0024630345285372958, "phrase": "efficient_method"}, {"score": 0.002382329940096419, "phrase": "empirical_evaluation"}, {"score": 0.002337403139264533, "phrase": "proposed_methods"}, {"score": 0.0022181655497912796, "phrase": "traditional_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["sequential pattern", " constraint-based mining", " temporal database"], "paper_abstract": "Sequential pattern mining is an important data-mining method for determining time-related behavior in sequence databases. The information obtained from sequential pattern mining can be used in marketing, medical records, sales analysis, and so on. Existing methods only focus on the concept of frequency because of the assumption that sequences' behaviors do not change over time. The environment from which the data is generated is often dynamic, however, so the sequences' behaviors may change over time. To adapt the discovered patterns to these changes, two new concepts, recency and compactness, are incorporated into traditional sequential pattern mining. The concept of recency causes patterns to quickly adapt to the latest behaviors in sequence databases, while the concept of compactness ensures reasonable time spans for the discovered patterns. We named the new patterns CFR-patterns because three concepts (compactness, frequency, and recency) are simultaneously considered. An efficient method is presented to find CFR-patterns. Empirical evaluation shows that the proposed methods are computationally efficient and that they are more advantageous than traditional methods when sequences' behaviors change over time. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Constraint-based sequential pattern mining: The consideration of recency and compactness", "paper_id": "WOS:000242209700047"}