{"auto_keywords": [{"score": 0.04971075098097412, "phrase": "adaptive_applications"}, {"score": 0.00481495049065317, "phrase": "budget_constraints"}, {"score": 0.004741167616693272, "phrase": "cloud_environments"}, {"score": 0.00468656988857138, "phrase": "recent_emergence"}, {"score": 0.004544016163767266, "phrase": "utility_computing_realizable"}, {"score": 0.004094018760244776, "phrase": "new_resource_provisioning_problems"}, {"score": 0.004015693806064219, "phrase": "pay-as-you-go_model"}, {"score": 0.003833749901796579, "phrase": "resource_costs"}, {"score": 0.0037170399498025215, "phrase": "application's_needs"}, {"score": 0.003548579306515579, "phrase": "cloud_resources"}, {"score": 0.0034008496666026585, "phrase": "application-specific_flexibility"}, {"score": 0.0032092293346843224, "phrase": "fixed_time-limit"}, {"score": 0.003147778277286763, "phrase": "resource_budget"}, {"score": 0.002891032998395276, "phrase": "application-specific_benefit_function"}, {"score": 0.0028356575042385156, "phrase": "adaptive_parameters"}, {"score": 0.0026043035241045394, "phrase": "cloud_computing_environment"}, {"score": 0.00257424957319189, "phrase": "key_component"}, {"score": 0.0025249264547573943, "phrase": "multi-input-multi-output_feedback_control_model-based_dynamic_resource_provisioning_algorithm"}, {"score": 0.002364172626241202, "phrase": "time_constraint"}, {"score": 0.0023278569001363263, "phrase": "trained_resource_model"}, {"score": 0.0023099082804523044, "phrase": "resource_allocation"}], "paper_keywords": ["Cloud computing", " adaptive applications", " control theory"], "paper_abstract": "The recent emergence of clouds is making the vision of utility computing realizable, i.e., computing resources and services can be delivered, utilized, and paid for as utilities such as water or electricity. This, however, creates new resource provisioning problems. Because of the pay-as-you-go model, resource provisioning should be performed in a way to keep resource costs to a minimum, while meeting an application's needs. In this work, we focus on the use of cloud resources for a class of adaptive applications, where there could be application-specific flexibility in the computation that may be desired. Furthermore, there may be a fixed time-limit as well as a resource budget. Within these constraints, such adaptive applications need to maximize their Quality of Service (QoS), more precisely, the value of an application-specific benefit function, by dynamically changing adaptive parameters. We present the design, implementation, and evaluation of a framework that can support such dynamic adaptation for applications in a cloud computing environment. The key component of our framework is a multi-input-multi-output feedback control model-based dynamic resource provisioning algorithm which adopts reinforcement learning to adjust adaptive parameters to guarantee the optimal application benefit within the time constraint. Then a trained resource model changes resource allocation accordingly to satisfy the budget. We have evaluated our framework with two real-world adaptive applications, and have demonstrated that our approach is effective and causes a very low overhead.", "paper_title": "Resource Provisioning with Budget Constraints for Adaptive Applications in Cloud Environments", "paper_id": "WOS:000312102700005"}