{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "triangle_graphs"}, {"score": 0.03148116337411152, "phrase": "trapezoid_graphs"}, {"score": 0.004984196262510778, "phrase": "np"}, {"score": 0.004744686475551315, "phrase": "intersection_graphs"}, {"score": 0.00440838389264585, "phrase": "perfect_graphs"}, {"score": 0.004369656712097927, "phrase": "considerable_attention"}, {"score": 0.004293215616253398, "phrase": "natural_way"}, {"score": 0.004059827743016726, "phrase": "well_known_applications"}, {"score": 0.00400053884985293, "phrase": "channel_routing"}, {"score": 0.003977065469905712, "phrase": "integrated_circuits"}, {"score": 0.0038167312279243485, "phrase": "pi"}, {"score": 0.003760799355189972, "phrase": "point-interval"}, {"score": 0.003705861051897777, "phrase": "intersecting_objects"}, {"score": 0.0031241294019967226, "phrase": "optimization_problems"}, {"score": 0.003060383344045888, "phrase": "general_graphs"}, {"score": 0.0028938199455860836, "phrase": "complexity_status"}, {"score": 0.0028683597138449467, "phrase": "triangle_graph_recognition_problem"}, {"score": 0.002760588246708752, "phrase": "triangle_graph"}, {"score": 0.002180793657565869, "phrase": "input_graph"}, {"score": 0.002142561289952531, "phrase": "trapezoid_graph"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Intersection graphs", " Trapezoid graphs", " PI graphs", " PI* graphs", " Recognition problem", " NP-complete"], "paper_abstract": "Trapezoid graphs are the intersection graphs of trapezoids, where every trapezoid has a pair of opposite sides lying on two parallel lines L-1 and L-2 of the plane. This subclass of perfect graphs has received considerable attention as it generalizes in a natural way both interval and permutation graphs. In particular, trapezoid graphs have been introduced in order to generalize some well known applications of these graphs on channel routing in integrated circuits. Strictly between permutation and trapezoid graphs lie the triangle graphs - also known as PI* graphs (for Point-Interval) - where the intersecting objects are triangles with one point of the triangle on the one line and the other two points (i.e. interval) of the triangle on the other line. Note that there is no restriction on which line between L-1 and L-2 contains one point of the triangle and which line contains the other two. Due to both their interesting structure and their practical applications, several efficient algorithms for optimization problems that are NP-hard in general graphs have been designed for trapezoid graphs - which also apply to triangle graphs. In spite of this, the complexity status of the triangle graph recognition problem (namely, the problem of deciding whether a given graph is a triangle graph) has been the most fundamental open problem on this class of graphs since its introduction two decades ago. Moreover, since triangle graphs lie naturally between permutation and trapezoid graphs, and since they share a very similar structure with them, it was expected that the recognition of triangle graphs is polynomial, as it is also the case for permutation and trapezoid graphs. In this article we surprisingly prove that the recognition of triangle graphs is NP-complete, even in the case where the input graph is known to be a trapezoid graph. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "The recognition of triangle graphs", "paper_id": "WOS:000304891700004"}