{"auto_keywords": [{"score": 0.04637371855567647, "phrase": "workflow_schema"}, {"score": 0.035971095059795136, "phrase": "completion_sets"}, {"score": 0.004799497428244394, "phrase": "workflow_management_systems"}, {"score": 0.004692699265201631, "phrase": "logically_related_multiple_tasks"}, {"score": 0.004008516312861836, "phrase": "important_issue"}, {"score": 0.0035931003474699583, "phrase": "different_tasks"}, {"score": 0.0035471385647914775, "phrase": "different_workflow_instances"}, {"score": 0.003456965170485635, "phrase": "multiple_completion_sets"}, {"score": 0.0034347810592224096, "phrase": "incorrect_specification"}, {"score": 0.0031488204239389305, "phrase": "availability_problems"}, {"score": 0.003078639412163634, "phrase": "large_workflow_schemas"}, {"score": 0.003039238375314774, "phrase": "error-prone_and_tedious_process"}, {"score": 0.0027682252595993403, "phrase": "control-flow_dependencies"}, {"score": 0.0025376170201746213, "phrase": "application_developers"}, {"score": 0.0024413739512778136, "phrase": "possible_completion_sets"}, {"score": 0.002417887626368368, "phrase": "large_workflow"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Workflow"], "paper_abstract": "Workflow Management Systems (WFMS) coordinate execution of logically related multiple tasks in an organization. Each workflow that is executed on such a system is an instance of some workflow schema. A workflow schema is defined using a set of tasks that are coordinated using dependencies. Workflows generated from the same schema may differ with respect to the tasks executed. An important issue that must be addressed while designing a workflow is to decide what tasks are needed for the workflow to complete - we refer to this set of tasks as the completion set. Since different tasks are executed in different workflow instances, a workflow schema may be associated with multiple completion sets. Incorrect specification of completion sets may prohibit some workflow from completing. This, in turn, will cause the workflow to hold on to the resources and raise availability problems. Manually generating these sets for large workflow schemas can be an error-prone and tedious process. Our goal is to automate this process. We investigate the factors that affect the completion of a workflow. Specifically, we study the impact of control-flow dependencies on completion sets and show how this knowledge can be used for automatically generating these sets. We provide an algorithm that can be used by application developers to generate the completion sets associated with a workflow schema. Generating all possible completion sets for a large workflow is computationally intensive. Towards this end, we show how to approximately estimate the number of completion sets. If this number exceeds some threshold specified by the user, then we do not generate all completion sets. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "When does a workflow complete?", "paper_id": "WOS:000286714500009"}