{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "pattern_clustering"}, {"score": 0.00419823857480455, "phrase": "monumental_challenge"}, {"score": 0.004164516065972361, "phrase": "today's_research_community"}, {"score": 0.0039042694651106884, "phrase": "conceptual_interpretation"}, {"score": 0.0036898803847106023, "phrase": "oppressive_volumes"}, {"score": 0.003660226272906374, "phrase": "visual_information"}, {"score": 0.003587125711973247, "phrase": "consumer_and_industrial_sectors"}, {"score": 0.003473178781851477, "phrase": "highly_desired_goal"}, {"score": 0.003390092184270794, "phrase": "computational_systems"}, {"score": 0.0029913511336659327, "phrase": "unsupervised_pattern_classification"}, {"score": 0.002907992115184249, "phrase": "computational_technologies"}, {"score": 0.0028499673072605552, "phrase": "self-organization"}, {"score": 0.002748159131396737, "phrase": "new_family"}, {"score": 0.0027260525536580912, "phrase": "computing_architectures"}, {"score": 0.00266079124891013, "phrase": "self_organization"}, {"score": 0.002395530243993313, "phrase": "self-organizing_tree_map"}, {"score": 0.002182958452794581, "phrase": "new_models"}, {"score": 0.0021049977753042253, "phrase": "complex_pattern_clustering_problems"}], "paper_keywords": [""], "paper_abstract": "As the fruit of the Information Age comes to bare, the question of how such information, especially visual information, might be effectively harvested, archived and analyzed, remains a monumental challenge facing today's research community. The processing of such information, however, is often fraught with the need for conceptual interpretation: a relatively simple task for humans, yet arduous for computers. In attempting to handle oppressive volumes of visual information becoming readily accessible within consumer and industrial sectors, some level of automation remains a highly desired goal. To achieve such a goal requires computational systems that exhibit some degree of intelligence in terms of being able to formulate their own models of the data in question with little or no user intervention - a process popularly referred to as Pattern Clustering or Unsupervised Pattern Classification. One powerful tool in pattern clustering is the computational technologies based on principles of Self-Organization. In this talk, we explore a new family of computing architectures that have a basis in self organization, yet are somewhat free from many of the constraints typical of other well known self-organizing architectures. The basic processing unit in the family is known as the Self-Organizing Tree Map (SOTM). We will look at how this model has evolved since its inception in 1995, how it has inspired new models, and how it is being applied to complex pattern clustering problems in image processing and retrieval, and three dimensional data analysis and visualization.", "paper_title": "Self-organizing trees and forests: A powerful tool in pattern clustering and recognition", "paper_id": "WOS:000241552700001"}