{"auto_keywords": [{"score": 0.04018841783205532, "phrase": "business_strategy"}, {"score": 0.02923189270597773, "phrase": "second-order_construct"}, {"score": 0.02485207763187733, "phrase": "planning_horizons"}, {"score": 0.00481495049065317, "phrase": "strategic_information_systems"}, {"score": 0.004777034835192062, "phrase": "today's_organizations"}, {"score": 0.004720717782144015, "phrase": "new_information_systems"}, {"score": 0.0042426974826585695, "phrase": "information_technology"}, {"score": 0.004192653260742387, "phrase": "strategic_information_systems_planning"}, {"score": 0.0036217089991592275, "phrase": "multi-item_scaled_questions"}, {"score": 0.0033860360186761533, "phrase": "sisp_measure"}, {"score": 0.003241750934419473, "phrase": "postal_survey"}, {"score": 0.003042752533935891, "phrase": "structural_equation_modeling"}, {"score": 0.002971309306027602, "phrase": "business_change"}, {"score": 0.002947868524740683, "phrase": "longer_sisp_horizons"}, {"score": 0.002855934865505357, "phrase": "shorter_ones"}, {"score": 0.0028334016912935165, "phrase": "planning_horizon"}, {"score": 0.0028110462197830726, "phrase": "sisp"}, {"score": 0.002566255769251419, "phrase": "strategic_awareness"}, {"score": 0.002546002312015341, "phrase": "strategy_conception_phases"}, {"score": 0.0021049977753042253, "phrase": "rapidly_changing_environment"}], "paper_keywords": ["strategic information systems planning", " business change", " information technology change", " planning horizon", " alignment of business strategy and information systems strategy"], "paper_abstract": "Today's organizations increasingly plan new information systems ( IS) to better compete. Through such planning, they attempt to align their IS strategy and their business strategy. This study tested the impact of business and information technology ( IT) change on strategic information systems planning (SISP) horizon, of horizon on the planning itself, and of the planning on the alignment of IS strategy and business strategy. A questionnaire defined business change, IT change, and alignment as multi-item scaled questions, and planning horizon as a single, nonscaled one. It defined a multi-item scaled SISP measure as both a second-order construct and as single-order constructs for its individual phases. A postal survey collected data from 161 IS executives. Constructs were extensively validated. The analysis used structural equation modeling, and surprisingly found that business change predicted longer SISP horizons, but IT change predicted neither longer nor shorter ones. Planning horizon predicted SISP itself ( as a second-order construct and as all of its phases), and such planning ( as a second-order construct, and as strategic awareness and strategy conception phases) predicted alignment of IS strategy and business strategy. These findings suggest that practitioners more carefully assess their own degree of caution in setting planning horizons in response to business and IT change. In fact, the findings suggest it may not be necessary for practitioners to shorten planning horizons in a rapidly changing environment.", "paper_title": "Rapid business and IT change: drivers for strategic information systems planning?", "paper_id": "WOS:000258072300003"}