{"auto_keywords": [{"score": 0.014379933824913264, "phrase": "hci_activities"}, {"score": 0.014288659643758484, "phrase": "se_processes"}, {"score": 0.01401824926460884, "phrase": "ugam"}, {"score": 0.00481495049065317, "phrase": "hci_integration"}, {"score": 0.004784093722351956, "phrase": "software_development_processes"}, {"score": 0.004738177185041523, "phrase": "human-computer_interaction"}, {"score": 0.004647655812642494, "phrase": "software_engineering"}, {"score": 0.00454422099327167, "phrase": "often-expressed_desire"}, {"score": 0.004316323233538682, "phrase": "usability_goals_achievement_metric"}, {"score": 0.0037586895199831095, "phrase": "se_process"}, {"score": 0.0036749658368075027, "phrase": "organizational_perspective"}, {"score": 0.0035931003474699583, "phrase": "wide_range"}, {"score": 0.003369076363771074, "phrase": "industrial_context"}, {"score": 0.0024650878485505032, "phrase": "good_predictor"}, {"score": 0.002449253189963288, "phrase": "ugam._regression_analysis"}, {"score": 0.0024023554314227067, "phrase": "somewhat_greater_effect"}, {"score": 0.0023412157039327665, "phrase": "agile_process_model"}, {"score": 0.00231869067437077, "phrase": "waterfall_process"}, {"score": 0.0022451572368358476, "phrase": "contracted_software_development_service"}, {"score": 0.0022021588353472914, "phrase": "product_companies"}, {"score": 0.00214610313234565, "phrase": "traditional_usability_evaluations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["HCI-SE integration", " Usability goals", " Metrics"], "paper_abstract": "Integrating human-computer interaction (HCI) activities in software engineering (SE) processes is an often-expressed desire. Two metrics to demonstrate the impact of integrating HCI activities in SE processes are proposed. Usability Goals Achievement Metric (UGAM) is a product metric that measures the extent to which the design of a product achieves its user-experience goals. Index of Integration (101) is a process metric that measures the extent of integration of the HCI activities in the SE process. Both the metrics have an organizational perspective and can be applied to a wide range of products and projects. An attempt has been made to keep the metrics easy to use in the industrial context. While the two metrics were proposed mainly to establish a correlation between the two and thereby demonstrate the effectiveness of integration of HCI in SE processes, several other applications seem likely. The two metrics were evaluated in three independent studies: a classroom-based evaluation with two groups of students, a qualitative feedback from three industry projects, and a quantitative evaluation using 61 industry projects. The metrics were found to be useful, easy to use, and helpful in making the process more systematic. Our studies showed that the two metrics correlate well with each other and that lol is a good predictor of UGAM. Regression analysis showed that lol has a somewhat greater effect on UGAM in projects that use the agile process model than the waterfall process and in the projects that are executed as a contracted software development service than in the projects in product companies. UGAM also correlated well with the traditional usability evaluations. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Measuring effectiveness of HCI integration in software development processes", "paper_id": "WOS:000283641600004"}