{"auto_keywords": [{"score": 0.04791490314295839, "phrase": "time_pressure"}, {"score": 0.032800046910928804, "phrase": "utilitarian_motivation"}, {"score": 0.03153509862200143, "phrase": "hedonic_motivation"}, {"score": 0.03014720888291599, "phrase": "impulse_bidding"}, {"score": 0.004814953351202414, "phrase": "hedonic"}, {"score": 0.004759635663291431, "phrase": "utilitarian_bidding_motivations"}, {"score": 0.0047049532961375, "phrase": "online_auctions"}, {"score": 0.004492406361795448, "phrase": "hedonic_and_utilitarian_bidding_motivations"}, {"score": 0.0037336520904376687, "phrase": "structural_equation_model"}, {"score": 0.0033450437338616596, "phrase": "bidding_process"}, {"score": 0.003138768436081888, "phrase": "significant_predictor"}, {"score": 0.0022176487309947266, "phrase": "important_implications"}], "paper_keywords": ["Auction satisfaction", " bidding motivations", " hedonic motivations", " impulse bidding", " online auctions", " utilitarian motivations"], "paper_abstract": "Hedonic and utilitarian bidding motivations have seldom been studied in the context of consumer-to-consumer (C2C) online auctions. Drawing on the stimulus-organism-response (S-O-R) framework, this study establishes a structural equation model to examine how competition and time pressure (stimulus) influence bidders' hedonic and utilitarian motivations (organism) and how these motivations further affect impulse bidding and satisfaction with the bidding process (responses). Our results show that time pressure is a significant predictor of utilitarian motivation but is not significantly related to hedonic motivation. Moreover, hedonic motivation tends to increase impulse bidding, whereas utilitarian motivation discourages it. Finally, this study finds the relationship between impulse bidding and satisfaction to be significant. Our findings contribute to theory by describing the roles that bidders' hedonic and utilitarian motivations play in C2C online auctions and elucidating the important implications for practice in attracting individuals to bid in such auctions.", "paper_title": "Examining Hedonic and Utilitarian Bidding Motivations in Online Auctions: Impacts of Time Pressure and Competition", "paper_id": "WOS:000350147800003"}