{"auto_keywords": [{"score": 0.04936215406482975, "phrase": "ideal_solutions"}, {"score": 0.015719716506582538, "phrase": "order_preference"}, {"score": 0.015314400559889823, "phrase": "likelihood-based_comparison_approach"}, {"score": 0.014212207572024039, "phrase": "decision-making_problems"}, {"score": 0.008730952783857425, "phrase": "multiple_criteria"}, {"score": 0.004654210559456924, "phrase": "multiple_criteria_decision_analysis"}, {"score": 0.0044649914484553585, "phrase": "topsis"}, {"score": 0.004398094237005956, "phrase": "well-known_compromising_method"}, {"score": 0.004002044115117644, "phrase": "increasing_attention"}, {"score": 0.003956971099850658, "phrase": "decision-making_field"}, {"score": 0.0038683363637006902, "phrase": "imprecise_and_ambiguous_information"}, {"score": 0.0038247634489737142, "phrase": "convenient_manner"}, {"score": 0.0033765627434550432, "phrase": "approximate_positive-ideal_and_negative-ideal_solutions"}, {"score": 0.003263683763829895, "phrase": "evaluative_ratings"}, {"score": 0.003014713272570927, "phrase": "likelihood-based_closeness_coefficient"}, {"score": 0.0029360049890445944, "phrase": "approximate_ideals"}, {"score": 0.0027428939498108746, "phrase": "priority_ranking_orders"}, {"score": 0.0026113524778702624, "phrase": "landfill_site_selection"}, {"score": 0.002591681512611419, "phrase": "supplier_selection"}, {"score": 0.002562451837774567, "phrase": "car_evaluation"}, {"score": 0.002458061764297103, "phrase": "proposed_method"}, {"score": 0.0023579143175099324, "phrase": "solution_results"}, {"score": 0.002253299769886694, "phrase": "proposed_interval"}, {"score": 0.0021861425611350857, "phrase": "effective_and_valid_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Technique for order preference by similarity to ideal solutions (TOPSIS)", " Interval type-2 fuzzy set", " Multiple criteria decision analysis", " Likelihood-based closeness coefficient", " Approximate ideal"], "paper_abstract": "The technique for order preference by similarity to ideal solutions (TOPSIS) is a well-known compromising method for addressing decision-making problems. In general, incomplete preference information and vague subjective judgments are realistic in practice. Accordingly, the theory of interval type-2 fuzzy sets has received increasing attention in the decision-making field because of its great ability to handle imprecise and ambiguous information in a convenient manner. The purpose of this paper is to develop a novel interval type-2 fuzzy TOPSIS method for multiple criteria decision analysis that is based on interval type-2 trapezoidal fuzzy numbers. This paper introduces the concept of approximate positive-ideal and negative-ideal solutions and presents a simple way to approach the evaluative ratings of ideal solutions using interval type-2 trapezoidal fuzzy numbers. Based on the likelihoods of interval type-2 trapezoidal fuzzy binary relations, this paper proposes certain likelihood-based comparison indices to establish a likelihood-based closeness coefficient of each alternative relative to the approximate ideals. Applying a likelihood-based comparison approach with the approximate ideals, this paper develops the interval type-2 fuzzy TOPSIS procedure to determine the priority ranking orders of the alternatives under consideration of the multiple criteria evaluation/selection. Three practical applications involving landfill site selection, supplier selection, and car evaluation are examined to show the effectiveness and practicability of the proposed method. Furthermore, this paper makes a comparison of the solution results yielded by other interval type-2 fuzzy decision-making methods. The comparative analyses demonstrate that the proposed interval type-2 fuzzy TOPSIS method is easy to implement and produces effective and valid results for solving multiple criteria decision-making problems. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An interval type-2 fuzzy technique for order preference by similarity to ideal solutions using a likelihood-based comparison approach for multiple criteria decision analysis", "paper_id": "WOS:000356111600006"}