{"auto_keywords": [{"score": 0.050072451003512895, "phrase": "achievable_rate_regions"}, {"score": 0.02895414075017553, "phrase": "cf"}, {"score": 0.004687645903373103, "phrase": "duplex_bi-directional"}, {"score": 0.004563691742821759, "phrase": "bi-directional_relay_channel"}, {"score": 0.0044231966846655394, "phrase": "independent_messages"}, {"score": 0.004364310576600359, "phrase": "shared_wireless_half-duplex_channel"}, {"score": 0.003569176320452192, "phrase": "first_phase"}, {"score": 0.0034437574674180365, "phrase": "second_phase"}, {"score": 0.002473187003932473, "phrase": "df"}, {"score": 0.002241171326888997, "phrase": "comprehensive_treatment"}, {"score": 0.002221192647477371, "phrase": "eight_possible_half-duplex_bi-directional_relaying_protocols"}, {"score": 0.0022022115069860173, "phrase": "gaussian"}, {"score": 0.0021239335561699106, "phrase": "different_snr"}, {"score": 0.0021049977753042253, "phrase": "relay_geometries"}], "paper_keywords": ["Achievable rate regions", " bi-directional communication", " compress and forward", " relaying"], "paper_abstract": "In a bi-directional relay channel, two nodes wish to exchange independent messages over a shared wireless half-duplex channel with the help of a relay. In this paper, we derive achievable rate regions for four new half-duplex protocols and compare these to four existing half-duplex protocols and outer bounds. In time, our protocols consist of either two or three phases. In the two phase protocols, both users simultaneously transmit during the first phase and the relay alone transmits during the second phase, while in the three phase protocol the two users sequentially transmit followed by a transmission from the relay. The relay may forward information in one of four manners; we outline existing amplify and forward (AF), decode and forward (DF), lattice based, and compress and forward (CF) relaying schemes and introduce the novel mixed forward scheme. The latter is a combination of CF in one direction and DF in the other. We derive achievable rate regions for the CF and Mixed relaying schemes for the two and three phase protocols. We provide a comprehensive treatment of eight possible half-duplex bi-directional relaying protocols in Gaussian noise, obtaining their relative performance under different SNR and relay geometries.", "paper_title": "Achievable Rate Regions and Performance Comparison of Half Duplex Bi-Directional Relaying Protocols", "paper_id": "WOS:000295739000007"}