{"auto_keywords": [{"score": 0.04112289743676207, "phrase": "visual_representation"}, {"score": 0.00481495049065317, "phrase": "large_multivariate_data_sets"}, {"score": 0.004625255533545965, "phrase": "multivariate_objects"}, {"score": 0.004563691742821759, "phrase": "important_problem"}, {"score": 0.0044231966846655394, "phrase": "college_admissions"}, {"score": 0.004344855841195913, "phrase": "machine_learning"}, {"score": 0.0035216195857272403, "phrase": "direct_and_holistic_way"}, {"score": 0.0030113280682863234, "phrase": "information_visualization_community"}, {"score": 0.002892484028902088, "phrase": "precise_definition"}, {"score": 0.002778317177178732, "phrase": "diversity_visualizations"}, {"score": 0.0025178072071268534, "phrase": "diversity_information"}], "paper_keywords": ["Information visualization", " diversity", " categorical data", " multivariate data", " evaluation"], "paper_abstract": "Understanding the diversity of a set of multivariate objects is an important problem in many domains, including ecology, college admissions, investing, machine learning, and others. However, to date, very little work has been done to help users achieve this kind of understanding. Visual representation is especially appealing for this task because it offers the potential to allow users to efficiently observe the objects of interest in a direct and holistic way. Thus, in this paper, we attempt to formalize the problem of visualizing the diversity of a large (more than 1000 objects), multivariate (more than 5 attributes) data set as one worth deeper investigation by the information visualization community. In doing so, we contribute a precise definition of diversity, a set of requirements for diversity visualizations based on this definition, and a formal user study design intended to evaluate the capacity of a visual representation for communicating diversity information. Our primary contribution, however, is a visual representation, called the Diversity Map, for visualizing diversity. An evaluation of the Diversity Map using our study design shows that users can judge elements of diversity consistently and as or more accurately than when using the only other representation specifically designed to visualize diversity.", "paper_title": "Visualization of Diversity in Large Multivariate Data Sets", "paper_id": "WOS:000283758600023"}