{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "socio-cultural_capital"}, {"score": 0.0047472380621488616, "phrase": "transitional_mmorpg."}, {"score": 0.004485735417293941, "phrase": "dynamic_socio-ludic_worlds"}, {"score": 0.004218602458288531, "phrase": "persistent_nature"}, {"score": 0.00406214911915987, "phrase": "virtual_spaces"}, {"score": 0.003525220627709056, "phrase": "game_developers"}, {"score": 0.0033943947596098583, "phrase": "guild_wars"}, {"score": 0.0030881143614111552, "phrase": "current_game"}, {"score": 0.0030446120560494155, "phrase": "forthcoming_sequel"}, {"score": 0.002679585860537941, "phrase": "existing_motivational_frameworks"}, {"score": 0.002641823250595624, "phrase": "significant_differences"}, {"score": 0.0025922974876210194, "phrase": "different_cultures"}, {"score": 0.002336004938424957, "phrase": "value_perception"}, {"score": 0.0023139986108451967, "phrase": "assumptive_worlds"}, {"score": 0.0021049977753042253, "phrase": "socio-cultural_landscape"}], "paper_keywords": ["Massively multiplayer online role-playing games", " Virtual world", " Socio-ludic world", " Synthetic world", " Migration", " Transition", " Guild Wars (R)"], "paper_abstract": "Massively multiplayer online role-playing games (MMORPGs) produce dynamic socio-ludic worlds that nurture both culture and gameplay to shape experiences. Despite the persistent nature of these games, however, the virtual spaces that anchor these worlds may not always be able to exist in perpetuity. Encouraging a community to migrate from one space to another is a challenge now facing some game developers. This paper examines the case of Guild Wars (R) and its Hall of Monuments, a feature that bridges the accomplishments of players from the current game to the forthcoming sequel. Two factor analyses describe the perspectives of 105 and 187 self-selected participants. The results reveal four factors affecting attitudes towards the feature, but they do not strongly correlate with existing motivational frameworks, and significant differences were found between different cultures within the game. This informs a discussion about the implications and facilitation of such transitions, investigating themes of capital, value perception and assumptive worlds. It is concluded that the way subcultures produce meaning needs to be considered when attempting to preserve the socio-cultural landscape.", "paper_title": "A monument to the player: preserving a landscape of socio-cultural capital in the transitional MMORPG", "paper_id": "WOS:000312342000005"}