{"auto_keywords": [{"score": 0.04925653227018551, "phrase": "systems_theory"}, {"score": 0.00481495049065317, "phrase": "original_aim"}, {"score": 0.004095567486538121, "phrase": "mutually_complementary_systems_theories"}, {"score": 0.003978866233891427, "phrase": "-_mulej's_dialectical_systems_theory"}, {"score": 0.0037336520904376687, "phrase": "requisite_holism"}, {"score": 0.0036907133026806327, "phrase": "mulej's_dialectical_systems_concept"}, {"score": 0.00362722588532864, "phrase": "-_two_methodologies"}, {"score": 0.0035855066449812273, "phrase": "co-operative_systems"}, {"score": 0.003138768436081888, "phrase": "new_systems_theory"}, {"score": 0.00282822695516646, "phrase": "new_synergy"}, {"score": 0.00265373679629359, "phrase": "business_organizations"}, {"score": 0.0025631294247072476, "phrase": "new_concept"}, {"score": 0.0025044454602720597, "phrase": "railway_management"}, {"score": 0.0021794454466797382, "phrase": "new_\"dialectical_network_thinking\"_theory"}], "paper_keywords": ["systems theory", " research"], "paper_abstract": "Purpose - To show that holism, which has been the original aim of the systems theory as a worldview of holism rather than reductionism, is best attained by application of those versions of systems theory that result from synergies of mutually complementary systems theories as methodologies. Design/methodology/approach - Mulej's dialectical systems theory (DST) is applied as worldview and methodology of requisite holism using Mulej's dialectical systems concept. Finding - Two methodologies of co-operative systems thinking - the network thinking and the DST - are compatible and complementary. They can be used for development of a new systems theory. Research limitations/implications - Research is limited to making a methodology helping managers attain more holism in a new synergy of two well established systems theories. Its application is expected with managers of business organizations. Practical implication - The new concept was tried in railway management successfully. But this paper is too short to contain this application. Originality/value - Authors neither know books nor articles presenting the new \"Dialectical Network Thinking\" theory nor its application except for their own unpublished texts.", "paper_title": "The dialectical network thinking - a new systems theory concerned with management", "paper_id": "WOS:000241260500021"}