{"auto_keywords": [{"score": 0.030727488236871013, "phrase": "training_algorithm"}, {"score": 0.02919857359482569, "phrase": "sbllm"}, {"score": 0.00481495049065317, "phrase": "sensitivity-based_learning_algorithm"}, {"score": 0.004138813595009761, "phrase": "unrestrainable_growth"}, {"score": 0.0038148090091532933, "phrase": "intrusion_detection"}, {"score": 0.0036838048761094933, "phrase": "new_challenges"}, {"score": 0.0028341130433482565, "phrase": "linear_learning_method"}, {"score": 0.0027049694095434905, "phrase": "learning_method"}, {"score": 0.0026736111900632934, "phrase": "two-layer_feedforward_anns"}, {"score": 0.0026272523687965615, "phrase": "sensitivity_analysis"}, {"score": 0.002492931483018372, "phrase": "linear_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Machine learning", " Algorithms", " Neural nets", " Classifier design and evaluation"], "paper_abstract": "Until recently, the most common criterion in machine learning for evaluating the performance of algorithms was accuracy. However, the unrestrainable growth of the volume of data in recent years in fields such as bioinformatics, intrusion detection or engineering, has raised new challenges in machine learning not simply regarding accuracy but also scalability. In this research, we are concerned with the scalability of one of the most well-known paradigms in machine learning, artificial neural networks (ANNs), particularly with the training algorithm Sensitivity-Based Linear Learning Method (SBLLM). SBLLM is a learning method for two-layer feedforward ANNs based on sensitivity analysis, that calculates the weights by solving a linear system of equations. The results show that the training algorithm SBLLM performs better in terms of scalability than five of the most popular and efficient training algorithms for ANNs. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A comparative study of the scalability of a sensitivity-based learning algorithm for artificial neural networks", "paper_id": "WOS:000317162900005"}