{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "structural_similarity"}, {"score": 0.04951738916270167, "phrase": "xml_documents"}, {"score": 0.0045122922461952805, "phrase": "xml_document"}, {"score": 0.004278807087784626, "phrase": "document_classification"}, {"score": 0.004228577663320847, "phrase": "approximate_structural_queries"}, {"score": 0.004129873531628877, "phrase": "selective_dissemination"}, {"score": 0.0040334640350288, "phrase": "document_protection"}, {"score": 0.0031285355811105915, "phrase": "effective_structural_similarity_measure"}, {"score": 0.003073545175760353, "phrase": "different_requirements"}, {"score": 0.002897109710213723, "phrase": "required_elements"}, {"score": 0.0027146742941153443, "phrase": "missing_and_extra_elements"}, {"score": 0.002573965014439041, "phrase": "synonymous_or_syntactically_similar_tags"}], "paper_keywords": ["H.3.2 information storage", " H.3.3 information search and retrieval", " H.3.5.f XML/XSL/RDF", " 1.5.3.b similarity measure"], "paper_abstract": "Measuring the structural similarity between an XML document and a DTD has many relevant applications that range from document classification and approximate structural queries on XML documents to selective dissemination of XML documents and document protection. The problem is harder than measuring structural similarity among documents, because a DTD can be considered as a generator of documents. Thus, the problem is to evaluate the similarity between a document and a set of documents. An effective structural similarity measure should face different requirements that range from considering the presence and absence of required elements, as well as the structure and level of the missing and extra elements to vocabulary discrepancies due to the use of synonymous or syntactically similar tags. In the paper, starting from these requirements, we provide a definition of the measure and present an algorithm for matching a document against a DTD to obtain their structural similarity. Finally, experimental results to assess the effectiveness of the approach are presented.", "paper_title": "Measuring the structural similarity among XML documents and DTDs", "paper_id": "WOS:000253721100003"}