{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "accessibility_requirements"}, {"score": 0.015550867017460692, "phrase": "user_interface_development_method"}, {"score": 0.007843848729706247, "phrase": "user_interfaces"}, {"score": 0.00467677555573346, "phrase": "legal_requirement"}, {"score": 0.0045591142048535165, "phrase": "web_applications"}, {"score": 0.004476878957065829, "phrase": "numerous_regulations"}, {"score": 0.0040873354289955605, "phrase": "high_level"}, {"score": 0.0040135756033094225, "phrase": "development_process"}, {"score": 0.003912533878506028, "phrase": "diverse_factors"}, {"score": 0.0037588493723080757, "phrase": "proper_development_methods"}, {"score": 0.0037315599283579593, "phrase": "authoring_tools"}, {"score": 0.003704467870496114, "phrase": "accessibility_training"}, {"score": 0.0036775717816768133, "phrase": "user_interface_development_professionals"}, {"score": 0.0034566710593930306, "phrase": "methodological_approach"}, {"score": 0.003320833167729157, "phrase": "user_interface_description_language"}, {"score": 0.003064913196639932, "phrase": "design_primitives"}, {"score": 0.002901791790730922, "phrase": "task_model"}, {"score": 0.0025170626402362633, "phrase": "design_stage"}, {"score": 0.0024004805502253427, "phrase": "new_transformation_rules"}, {"score": 0.0023570895666021664, "phrase": "support_tools"}, {"score": 0.002167355210897559, "phrase": "user_interface_markup_languages"}, {"score": 0.0021437580456873584, "phrase": "usixml."}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Accessibility", " User interface development method", " Model driven development", " User Interface Description Language"], "paper_abstract": "It is a legal requirement in many countries to ensure accessibility for Web applications. Although there are numerous regulations and standards regarding accessibility in the development of user interfaces, accessibility is nevertheless quite difficult to achieve, let alone to maintain at a high level of quality throughout the development process. This difficulty is due to diverse factors including, but not limited to, the lack of proper development methods, authoring tools and accessibility training for user interface development professionals. In an attempt to offer a solution to these difficulties, this paper proposes a methodological approach for the integration of accessibility requirements into a user interface development method based on User Interface Description Language (UIDL) or, more specifically, on the USer Interface eXtensible Markup Language (UsiXML) framework. The proposed strategy involves the integration of accessibility requirements into design primitives of the user interface development method. This paper focuses on accessibility requirements related to navigation in the Task Model, Abstract User Interface Model and Transformation Model. The application of the approach shown for the SPA4USXML tool also includes a proof of concept and validation of the proposal. The study shows that accessibility requirements included at the design stage in the modelling of user interfaces can be systematized through mechanisms such as new transformation rules and the use of support tools such as SPA4USXML.As a result, the quality of accessibility can be guaranteed by taking advantage of developments in technologies based on User Interface Markup Languages such as UsiXML. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "An approach to the integration of accessibility requirements into a user interface development method", "paper_id": "WOS:000335608500005"}