{"auto_keywords": [{"score": 0.01379934615226307, "phrase": "laplacian"}, {"score": 0.00481495049065317, "phrase": "non-stationary_gaussian_noise"}, {"score": 0.00464976086880886, "phrase": "edge_detection_technique"}, {"score": 0.004578165674080246, "phrase": "local_smoothing"}, {"score": 0.00445550467119693, "phrase": "statistical_hypothesis_testing"}, {"score": 0.004352974291381376, "phrase": "edge_point"}, {"score": 0.004090901264701185, "phrase": "significant_edge_point"}, {"score": 0.003770633265791941, "phrase": "pure_noise"}, {"score": 0.0035167751486442082, "phrase": "delta"}, {"score": 0.0033170847930578473, "phrase": "significant_edge"}, {"score": 0.002940697344380201, "phrase": "stationary_gaussian_noise"}, {"score": 0.00278497898719426, "phrase": "tomographic_reconstruction"}, {"score": 0.0026788122684116224, "phrase": "gaussian_noise"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["edge detection", " significant edges", " inverse problem", " statistical hypothesis testing"], "paper_abstract": "In this paper, we propose an edge detection technique based on some local smoothing of the image followed by a statistical hypothesis testing on the gradient. An edge point being defined as a zero-crossing of the Laplacian, it is said to be a significant edge point if the gradient at this point is larger than a threshold s(epsilon) defined by: if the image I is pure noise, then the probability of parallel to del I (x)parallel to >= s(epsilon) conditionally on Delta I (x) = 0 is less than e. In other words, a significant edge is an edge which has a very low probability to be there because of noise. We will show that the threshold s(epsilon) can be explicitly computed in the case of a stationary Gaussian noise. In the images we are interested in, which are obtained by tomographic reconstruction from a radiograph, this method fails since the Gaussian noise is not stationary anymore. Nevertheless, we are still able to give the law of the gradient conditionally on the zero-crossing of the Laplacian, and thus compute the threshold s(epsilon). We will end this paper with some experiments and compare the results with those obtained with other edge detection methods. (c) 2007 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Significant edges in the case of non-stationary Gaussian noise", "paper_id": "WOS:000248468800033"}