{"auto_keywords": [{"score": 0.04778951318323818, "phrase": "shortest-path_map"}, {"score": 0.00481495049065317, "phrase": "shortest_paths"}, {"score": 0.00478557489890886, "phrase": "realistic_polyhedra"}, {"score": 0.004542976479682312, "phrase": "fixed_source"}, {"score": 0.004446677711302801, "phrase": "convex_polytope_p"}, {"score": 0.004352411290383643, "phrase": "possibly_nonconvex_polyhedron"}, {"score": 0.004299440848047056, "phrase": "first_scenario"}, {"score": 0.004068907083697369, "phrase": "second_scenario"}, {"score": 0.004007083686875716, "phrase": "uncrowded_polyhedron-each_axis-parallel_square_h"}, {"score": 0.0035997452281985465, "phrase": "well-known_low-density_model"}, {"score": 0.003334309053314909, "phrase": "connected_region"}, {"score": 0.0032040860021574193, "phrase": "shortest_path_distance"}, {"score": 0.002469032978674379, "phrase": "implicit_representation"}, {"score": 0.002409188797323273, "phrase": "shortest_path"}, {"score": 0.0023725232579531273, "phrase": "query_point"}, {"score": 0.0021309898622781124, "phrase": "self-conforming_model"}, {"score": 0.0021049977753042253, "phrase": "major_simplification"}], "paper_keywords": ["Conforming subdivision", " Continuous Dijkstra", " Realistic polyhedral surface", " Shortest path map", " Terrain", " Wavefront"], "paper_abstract": "We generalize our optimal-time algorithm for computing (an implicit representation of) the shortest-path map from a fixed source s on the surface of a convex polytope P to three realistic scenarios where P is a possibly nonconvex polyhedron. In the first scenario, a, P is a terrain whose maximum facet slope is bounded by any fixed constant. In the second scenario, P is an uncrowded polyhedron-each axis-parallel square h of side length l(h) whose smallest Euclidean distance to a vertex of P is at least l(h) is intersected by at most O(1) facets of a, P-an input model which, as we show, is a generalization of the well-known low-density model. In the third scenario, P is self-conforming-here, for each edge e of P, there is a connected region R(e) of O(1) facets whose union contains e, so that the shortest path distance from e to any edge e' of a, R(e) is at least ca <...max {|e|,|e'|}, where c is some positive constant. In particular, it includes the case where each facet of a, P is fat and each vertex is incident to at most O(1) facets of a, P. In all the above cases the algorithm runs in O(nlog n) time and space, where n is the number of edges of P, and produces an implicit representation of the shortest-path map, so that the shortest path from s to any query point q can be determined in O(log n) time. The constants of proportionality depend on the various parameters (maximum facet slope, crowdedness, etc.). We also note that the self-conforming model allows for a major simplification of the algorithm.", "paper_title": "An Optimal-Time Algorithm for Shortest Paths on Realistic Polyhedra", "paper_id": "WOS:000272902500002"}