{"auto_keywords": [{"score": 0.04724083798606324, "phrase": "preterm_born_infants"}, {"score": 0.00481495049065317, "phrase": "automatic_neonatal_brain_segmentation_algorithms"}, {"score": 0.0045726187330434025, "phrase": "brain_segmentation"}, {"score": 0.004383406949799696, "phrase": "reliable_comparison"}, {"score": 0.003615443704375908, "phrase": "coronal_scans"}, {"score": 0.0031695693589575916, "phrase": "mr_images"}, {"score": 0.002626034130205569, "phrase": "extracerebral_space"}, {"score": 0.0023456351719724957, "phrase": "eight_participating_teams"}, {"score": 0.0022696277881969896, "phrase": "participating_methods"}, {"score": 0.0022064376000055764, "phrase": "tissue_classes"}, {"score": 0.0021652891317252994, "phrase": "myelinated_white_matter"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Neonatal brain", " MRI", " Brain segmentation", " Segmentation evaluation", " Segmentation comparison"], "paper_abstract": "A number of algorithms for brain segmentation in preterm born infants have been published, but a reliable comparison of their performance is lacking. The NeoBrainS12 study (http://neobrains12.isi.uu.nl), providing three different image sets of preterm born infants, was set up to provide such a comparison. These sets are (i) axial scans acquired at 40 weeks corrected age, (ii) coronal scans acquired at 30 weeks corrected age and (iii) corona] scans acquired at 40 weeks corrected age. Each of these three sets consists of three T1- and T2-weighted MR images of the brain acquired with a 3T MRI scanner. The task was to segment cortical grey matter, non-myelinated and myelinated white matter, brainstem, basal ganglia and thalami, cerebellum, and cerebrospinal fluid in the ventricles and in the extracerebral space separately. Any team could upload the results and all segmentations were evaluated in the same way. This paper presents the results of eight participating teams. The results demonstrate that the participating methods were able to segment all tissue classes well, except myelinated white matter. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Evaluation of automatic neonatal brain segmentation algorithms: The NeoBrainS12 challenge", "paper_id": "WOS:000349592000010"}