{"auto_keywords": [{"score": 0.03518432623754388, "phrase": "wrs"}, {"score": 0.015391394989502476, "phrase": "wikipedia"}, {"score": 0.008621521199088518, "phrase": "wikipedia_recommender_system"}, {"score": 0.00481495049065317, "phrase": "multi-agent_reputation_calculation"}, {"score": 0.004663074596384574, "phrase": "web-based_encyclopedia"}, {"score": 0.004548253531664032, "phrase": "internet_users"}, {"score": 0.004389089062127892, "phrase": "dramatic_growth"}, {"score": 0.0040726680518382965, "phrase": "extremely_open_editorial_policy"}, {"score": 0.003846926701870193, "phrase": "broad_and_detailed_coverage"}, {"score": 0.0035063811070537233, "phrase": "human_users"}, {"score": 0.0033001333942688747, "phrase": "personalised_rating"}, {"score": 0.003265012781840765, "phrase": "wikipedia_article"}, {"score": 0.003072918736387408, "phrase": "wrs_users"}, {"score": 0.0029652292779277782, "phrase": "wikipedia_articles"}, {"score": 0.0027610089418453614, "phrase": "trust_metrics"}, {"score": 0.002683304054823427, "phrase": "different_recommenders"}, {"score": 0.0024108455980729284, "phrase": "brief_overview"}, {"score": 0.002359759876402679, "phrase": "wrs_prototype"}, {"score": 0.002309754152767196, "phrase": "general_problem"}, {"score": 0.0022608057001451414, "phrase": "collaboratively_generated_resource"}, {"score": 0.00223672097810462, "phrase": "distributed_multi-agent_system"}, {"score": 0.002173739308244513, "phrase": "general_architecture"}], "paper_keywords": [""], "paper_abstract": "The Wikipedia is a web-based encyclopedia, written and edited collaboratively by Internet users. Over the past decade, the Wikipedia has experienced a dramatic growth in popularity and is considered by many the primary source of information on the Internet. The Wikipedia has an extremely open editorial policy that allows anybody, to create or modify articles. This has resulted in a broad and detailed coverage of subjects, but it has also caused problems relating to the quality of articles. The Wikipedia Recommender System (WRS) was developed to help human users determine the credibility of an article based on feedback from other Wikipedia users. The WRS calculates a personalised rating for any Wikipedia article based on feedback (recommendations) provided by other Wikipedia users. As part of this process, WRS users are expected to provide their own feedback about the quality of Wikipedia articles that they have read. This makes the WRS a rating-based collaborative filtering system, which implements trust metrics to determine the weight of feedback from different recommenders. In this paper the authors describe the WRS outlining some of the requirements and constraints that shaped the design of the system. The authors also provide a brief overview of the implementation of the WRS prototype. The WRS addresses the general problem of establishing trust in a collaboratively generated resource in a distributed multi-agent system, so the authors believe that the general architecture that underlies the WRS applies to many other applications in such systems.", "paper_title": "Supporting multi-agent reputation calculation in the Wikipedia Recommender System", "paper_id": "WOS:000287341900008"}