{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "latin_america"}, {"score": 0.04847493599744397, "phrase": "digital_preservation"}, {"score": 0.012446789970088787, "phrase": "digital_information"}, {"score": 0.008211247434419089, "phrase": "latin_american_countries"}, {"score": 0.007332257232754278, "phrase": "developing_countries"}, {"score": 0.00478768880281476, "phrase": "purpose_-_the_purpose"}, {"score": 0.004680169643744616, "phrase": "current_situation"}, {"score": 0.004601110504747972, "phrase": "additional_main_challenges"}, {"score": 0.004310173770196077, "phrase": "existing_digital_information_preservation"}, {"score": 0.0039244530915794025, "phrase": "six_preservation_factors"}, {"score": 0.0039022135263746737, "phrase": "seven_principles"}, {"score": 0.003750012556296276, "phrase": "proper_knowledge"}, {"score": 0.0036139842783886205, "phrase": "developed_countries"}, {"score": 0.003135087913368764, "phrase": "limited_research"}, {"score": 0.0030820480406334927, "phrase": "practical_implications"}, {"score": 0.00302990277677769, "phrase": "long-term_authentic_preservation"}, {"score": 0.0029617414861784525, "phrase": "simple_technology_problem"}, {"score": 0.0027662954811372175, "phrase": "practical_strategy"}, {"score": 0.0025763725301629846, "phrase": "social_implications_-_research"}, {"score": 0.0024969812322112174, "phrase": "digital_collections_preservation"}, {"score": 0.002461705602574723, "phrase": "latin_american_developing_countries"}, {"score": 0.002433843373780471, "phrase": "vast_amounts"}, {"score": 0.002385839330752606, "phrase": "serious_risk"}, {"score": 0.002372298201966367, "phrase": "valuable_digital_information"}, {"score": 0.002325505218710381, "phrase": "future_generations"}, {"score": 0.0022731540640627307, "phrase": "main_challenges"}, {"score": 0.0022093656223897322, "phrase": "long_term"}, {"score": 0.002184353189568121, "phrase": "main_issues"}, {"score": 0.0021049977753042253, "phrase": "often_overlooked_problem"}], "paper_keywords": ["Digital archives Long-term preservation", " Digital libraries", " Digital information", " Information preservation"], "paper_abstract": "Purpose - The purpose of this paper is to summarize the current situation of digital preservation and describe the additional main challenges and issues faced in Latin American countries within the framework of the factors of digital preservation. Design/methodology/approach - This paper reviews the literature on existing digital information preservation around the world, and then focuses on Latin American countries. It proposes a framework in which to analyze the situation in developing countries, particularly in Latin America, and summarizes the issues in six preservation factors and seven principles of preservation. Findings - The amount of digital information has increased geometrically without proper knowledge, theories, strategies, policies and proceedings to preserve it. Developed countries and regions have started to create this knowledge and know-how, as well as setting the basis to manage their digital collections within libraries, archives, and other organizations with the aim to preserve them in the long-term. The situation is radically different in Latin America where we found limited research and projects on digital preservation. Practical implications - The problem of the long-term authentic preservation of digital document collections is not a simple technology problem; it is a much more complex one. This paper summarizes the approaches to understand it but further study is required in order to develop a practical strategy and/or plan. It also highlights the importance of raising awareness of digital preservation in Latin America in order to ensure availability in the future. Social implications - Research, planning, initiatives and proper execution in regard to digital collections preservation is extremely limited in Latin American developing countries, thus endangering vast amounts of digital information. There is a serious risk that valuable digital information will not be preserved adequately for future generations. Originality/value - This paper reviews the main challenges for libraries and archives to preserve digital information over the long term and summarizes the main issues to understand and to thwart this problem. It also highlights the often overlooked problem of digital preservation in developing countries, in particular Latin America.", "paper_title": "Long-term digital information preservation: challenges in Latin America", "paper_id": "WOS:000299980600006"}