{"auto_keywords": [{"score": 0.03943138540816243, "phrase": "last_research_mile"}, {"score": 0.004671803485255806, "phrase": "information_systems_research"}, {"score": 0.004381527499253281, "phrase": "quick_prototype"}, {"score": 0.004062937864702115, "phrase": "merely_details"}, {"score": 0.003853757393357659, "phrase": "information_systems"}, {"score": 0.0036691380448651443, "phrase": "successful_transition"}, {"score": 0.0035331426502479687, "phrase": "scientific_knowledge"}, {"score": 0.003467040410632942, "phrase": "important_unsolved_classes"}, {"score": 0.003415047118340286, "phrase": "real_people"}, {"score": 0.0033893426032054366, "phrase": "real_stakes"}, {"score": 0.0031784960695034645, "phrase": "concept_research"}, {"score": 0.0031308163228919773, "phrase": "functional_feasibility"}, {"score": 0.002837811982066224, "phrase": "proof-of-use_research"}, {"score": 0.0027741761880779535, "phrase": "operational_feasibility"}, {"score": 0.0023848164282879885, "phrase": "false_dilemma"}, {"score": 0.002366847878952636, "phrase": "systems_researchers"}, {"score": 0.00227040825063645, "phrase": "greatest_impact"}], "paper_keywords": ["design science", " prototypes", " research methodology", " research rigor", " systems research"], "paper_abstract": "From our desk chairs it may be tempting to work up an idea, build a quick prototype, test it in a lab, and say, \"Our work here is done; the rest is merely details.\" More scholarly knowledge awaits discovery, however, by researchers who shepherd an information systems (IS) solution through the last research mile, that is, through successful transition to the workplace. Going the last research mile means using scientific knowledge and methods to address important unsolved classes of problems for real people with real stakes in the outcomes. The last research mile proceeds in three stages: proof-of-concept research to demonstrate the functional feasibility of a solution; proof-of-value research to investigate whether a solution can create value across a variety of conditions; and proof-of-use research to address complex issues of operational feasibility. The last research mile ends only when practitioners routinely use a solution in the field. We argue that going the last research mile negates the assumption that one must trade off rigor and relevance, showing it to be it a false dilemma. Systems researchers who take their solutions through the last research mile may ultimately have the greatest impact on science and society. We demonstrate the last research mile with cases from our own work and the work of others spanning more than forty years.", "paper_title": "The Last Research Mile: Achieving Both Rigor and Relevance in Information Systems Research", "paper_id": "WOS:000368329400003"}