{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "task_complexity"}, {"score": 0.004734853555630616, "phrase": "great_many_different_crowdsourcing_approaches"}, {"score": 0.004578616481036476, "phrase": "individual_or_organizational_tasks"}, {"score": 0.004281372589330329, "phrase": "task_characteristics"}, {"score": 0.004122699822340296, "phrase": "extensive_review"}, {"score": 0.004071121244999291, "phrase": "crowdsourcing_landscape"}, {"score": 0.003743310268453678, "phrase": "multidimensional_nature"}, {"score": 0.0032726467814278345, "phrase": "task-based_taxonomy"}, {"score": 0.0032046343506232588, "phrase": "iterative_approach"}, {"score": 0.002438699976481979, "phrase": "crowd_members"}, {"score": 0.0023481578019624843, "phrase": "seven_categories"}, {"score": 0.002299313860419974, "phrase": "prototypical_examples"}, {"score": 0.0021049977753042253, "phrase": "particular_task_situation"}], "paper_keywords": ["Crowdsourcing", " crowdsourcing taxonomy", " distributed knowledge gathering", " open innovation", " peer production", " task complexity", " task-fit model", " task types"], "paper_abstract": "Although a great many different crowdsourcing approaches are available to those seeking to accomplish individual or organizational tasks, little research attention has yet been given to characterizing how those approaches might be based on task characteristics. To that end, we conducted an extensive review of the crowdsourcing landscape, including a look at what types of taxonomies are currently available. Our review found that no taxonomy explored the multidimensional nature of task complexity. This paper develops a taxonomy whose specific intent is the classification of approaches in terms of the types of tasks for which they are best suited. To develop this task-based taxonomy, we followed an iterative approach that considered over 100 well-known examples of crowdsourcing. The taxonomy considers three dimensions of task complexity: (a) task structure - is the task well-defined, or does it require a more open-ended solution; (2) task interdependence - can the task be solved by an individual, or does it require a community of problem solvers; and (3) task commitment - what level of commitment is expected from crowd members? Based on this taxonomy, we identify seven categories of crowdsourcing and discuss prototypical examples of each approach. Furnished with such an understanding, one should be able to determine which crowdsourcing approach is most suitable for a particular task situation.", "paper_title": "A taxonomy of crowdsourcing based on task complexity", "paper_id": "WOS:000346182400009"}