{"auto_keywords": [{"score": 0.01464401018340073, "phrase": "stratified_studies"}, {"score": 0.010560017285525664, "phrase": "exact_p-value_approach"}, {"score": 0.00481495049065317, "phrase": "stratified_comparative_clinical_trials"}, {"score": 0.004525088883501587, "phrase": "unity_odds_ratios"}, {"score": 0.004232331639807526, "phrase": "adjusted_nominal_levels"}, {"score": 0.003580355398511932, "phrase": "two-sided_hypothesis_testing_problems"}, {"score": 0.0029711052657054463, "phrase": "pre-assigned_nominal_levels"}, {"score": 0.00276534038425712, "phrase": "asymptotic_p-value_approach"}, {"score": 0.002648768009464535, "phrase": "associated_procedures"}, {"score": 0.0024771000236931836, "phrase": "mid-p_approach"}, {"score": 0.0023613185213421173, "phrase": "pre-assigned_nominal_level"}, {"score": 0.0022834993174767016, "phrase": "general_guidelines"}, {"score": 0.0022294857939412073, "phrase": "numerical_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["asymptotic test", " exact test", " mid-P test", " odds ratio", " single-step test", " stepwise test"], "paper_abstract": "This article investigates various multiple testing procedures for the testing of unity odds ratios from stratified studies. These procedures compare individual ordered p-values to a series of adjusted nominal levels, and are employed to distinguish between significance and insignificance in stratified studies. Three commonly used approaches for determining p-values are considered: the asymptotic, exact, and mid-P approaches. We focus on two-sided hypothesis testing problems. The empirical performance of various multiple testing procedures is evaluated in terms of their empirical sizes and powers. As expected, multiple testing procedures based on the exact p-value approach are always conservative in the sense that their empirical sizes are always less than or equal to the pre-assigned nominal levels. Interestingly, in some cases we observe that some procedures based on the asymptotic p-value approach are more conservative and less powerful than the associated procedures based on the exact p-value approach. In addition, some procedures based on the mid-P approach are recommended because their empirical sizes are generally close to the pre-assigned nominal level but are the most powerful. General guidelines are provided, and numerical examples are presented to illustrate the methodologies. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Multiple testing procedures for analyzing stratified comparative clinical trials using odds ratios", "paper_id": "WOS:000238471600022"}