{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "autonomous_systems"}, {"score": 0.004694353795114243, "phrase": "peer_traffic"}, {"score": 0.004381962669035583, "phrase": "trade_agreements"}, {"score": 0.004180234323211199, "phrase": "physical_links"}, {"score": 0.003987755561492638, "phrase": "directly_connected_ass"}, {"score": 0.003916098498242888, "phrase": "global_impact"}, {"score": 0.0037766095501754952, "phrase": "network_packets"}, {"score": 0.003563651133299401, "phrase": "interconnected_ass"}, {"score": 0.00338715316196893, "phrase": "existing_agreements"}, {"score": 0.0033262524445013303, "phrase": "traffic_pattern"}, {"score": 0.0033021988455635403, "phrase": "as-level_topology"}, {"score": 0.0030821633718368206, "phrase": "transit_agreements"}, {"score": 0.002855934865505357, "phrase": "different_traffic_classes"}, {"score": 0.0027242666160349938, "phrase": "generating_function"}, {"score": 0.002655894070657161, "phrase": "analytical_study"}, {"score": 0.0025059724686541263, "phrase": "large_number"}, {"score": 0.0024342079318127423, "phrase": "different_ass"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-to-peer networks", " Autonomous systems", " Generating function"], "paper_abstract": "The interconnection of thousands of Autonomous Systems (ASs) makes up the Internet. Each AS shares trade agreements with its neighbors that regulate the costs associated with traffic exchanged on the physical links. These agreements are local, i.e., are settled only between directly connected ASs, but have a global impact by influencing the paths allowed for the routing of network packets and the costs associated with these routes. Indeed, the costs and earnings of interconnected ASs is a function of many factors, such as size of the ASs, existing agreements, routing policy, traffic pattern and AS-level topology. In this paper we present an approach that takes these factors into account to assess peering and transit agreements. Here we focus on traffic generated from P2P activities, but the approach is general enough to be applied to different traffic classes. The P2P model we present is based on the use of the generating function, it allows to perform an analytical study of the traffic associated to file-sharing. The proposed P2P model is able to consider a large number of peers sharing several resources, spread along different ASs connected through a series of links. We validate the results of our P2P model against one of the most widely used P2P simulators, i.e. PeerSim. Using both the AS-level and P2P models we evaluate how the inter-AS P2P traffic influences the AS network cost and earning. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Performance evaluation of peering-agreements among autonomous systems subject to peer-to-peer traffic", "paper_id": "WOS:000337779300001"}