{"auto_keywords": [{"score": 0.047524308711391836, "phrase": "electronic_identifiers"}, {"score": 0.03815703258984396, "phrase": "high_accuracy"}, {"score": 0.030849891335552698, "phrase": "visual_signals"}, {"score": 0.00481495049065317, "phrase": "electronic_and_visual_signals"}, {"score": 0.004516856326107826, "phrase": "e._g."}, {"score": 0.0040111533608228195, "phrase": "fully_digitalized_life"}, {"score": 0.00393852508392789, "phrase": "traditional_wireless_localization_techniques"}, {"score": 0.0037798652680135106, "phrase": "electronic_identifiers'_positions"}, {"score": 0.0036776458116294986, "phrase": "costly_hardware"}, {"score": 0.003091262582401731, "phrase": "new_localization_technique"}, {"score": 0.0028210902750714075, "phrase": "wireless_localization"}, {"score": 0.0026461080202599694, "phrase": "electronic_signals"}, {"score": 0.002493333098814506, "phrase": "e-v_match_engine"}, {"score": 0.0024147474002390763, "phrase": "object's_electronic_identifier"}, {"score": 0.0023173287402646577, "phrase": "mobile_devices"}, {"score": 0.002254571365634257, "phrase": "real_world"}, {"score": 0.0022238315004700607, "phrase": "localization_error"}, {"score": 0.0021049977753042253, "phrase": "large-scale_simulations"}], "paper_keywords": ["Electronic", " localization", " matching", " mobile phones", " visual"], "paper_abstract": "Nowadays, more and more objects can be represented with electronic identifiers, e. g., people can be recognized from their laptops' MACs, and products can be identified by their RFID numbers. Localizing electronic identifiers is more and more important for a fully digitalized life. However, traditional wireless localization techniques are not satisfactory in performance to determine these electronic identifiers' positions. Some of them require costly hardware to achieve high accuracy and, hence, are not practical. The others are inaccurate and not robust against environmental noises, e. g., RSSI-based localization. Therefore, an accurate and practical approach for localizing electronic identifiers is needed. In this paper, we propose a new localization technique called EV-Loc. In EV-Loc, we make use of visual signals to help improve the accuracy of wireless localization. Our technique fully takes advantage of the high accuracy of visual signals and pervasiveness of electronic signals. To effectively couple these two signals together, we have designed an E-V match engine to find the correspondence between an object's electronic identifier and its visual appearance. We have implemented our technique on mobile devices and evaluated it in the real world. The localization error is less than 1 m. We have also evaluated our approach using large-scale simulations. The results show that our approach is accurate and robust.", "paper_title": "EV-Loc: Integrating Electronic and Visual Signals for Accurate Localization", "paper_id": "WOS:000340944200020"}