{"auto_keywords": [{"score": 0.049110045082843494, "phrase": "tensile_steel_reinforcements"}, {"score": 0.03166181073351053, "phrase": "rc_beam"}, {"score": 0.019323507877114378, "phrase": "defective_stirrup_anchorages"}, {"score": 0.01916836851347952, "phrase": "shear_strength"}, {"score": 0.004418601451254075, "phrase": "shear_behavior"}, {"score": 0.004386845838798356, "phrase": "end_anchorages"}, {"score": 0.0039402177950179345, "phrase": "theoretical_methods"}, {"score": 0.003876226041373242, "phrase": "remaining_capacity"}, {"score": 0.003797690272118125, "phrase": "rc_beams"}, {"score": 0.0037667216301666196, "phrase": "especially_shear_capacity"}, {"score": 0.0036453427552753533, "phrase": "possible_position"}, {"score": 0.0036008372531664726, "phrase": "critical_inclined_crack"}, {"score": 0.003556873173040169, "phrase": "actual_pattern"}, {"score": 0.0034847851398628546, "phrase": "concrete_body"}, {"score": 0.0034422330919613294, "phrase": "partial_length"}, {"score": 0.003400198866111204, "phrase": "proposed_compatibility_condition"}, {"score": 0.0030818310926031024, "phrase": "model's_predictions"}, {"score": 0.0030441844088874366, "phrase": "experimental_results"}, {"score": 0.002921975748248106, "phrase": "proposed_model"}, {"score": 0.0021049977753042253, "phrase": "corresponding_normal_bonded_rc_beam"}], "paper_keywords": ["shear strength", " unbonded length", " critical inclined crack", " defective stirrup anchorages"], "paper_abstract": "Although the effect of corrosion of reinforcing bar on the shear behavior of the reinforced concrete (RC) beam had been simulated by tests of the beam with unbonded, half-exposed or whole-exposed tensile steel reinforcements as well as defective stirrup anchorages, theoretical methods to accurately predict remaining capacity of this kind of RC beams, especially shear capacity, are still lacking. Considering the possible position of the critical inclined crack, the actual pattern of strains in the concrete body within the partial length and the proposed compatibility condition of deformations of the RC beam, shear strength of the RC beam with unbonded or exposed tensile steel reinforcements and/or defective stirrup anchorages is predicted. Comparison between the model's predictions with the experimental results published in the literature shows the practicability of the proposed model. Influence of the length of unbonded or exposed tensile steel reinforcements and the percentage of stirrups lacked end anchorages on the shear strength of the RC beam is discussed. It is concluded that, the shear strength of the RC beam with unbonded or exposed tensile steel reinforcements and/or defective stirrup anchorages is greatly influenced by the length of unbonded or exposed tensile steel reinforcements and the percentage of stirrups lacked end anchorages, this influence can be adverse, insignificant or even favourable, dependent on the given parameters of the corresponding normal bonded RC beam.", "paper_title": "Analysis of RC beam with unbonded or exposed tensile steel reinforcements and defective stirrup anchorages for shear strength", "paper_id": "WOS:000306395200005"}