{"auto_keywords": [{"score": 0.036851558080655766, "phrase": "financial_gain"}, {"score": 0.00481495049065317, "phrase": "smartphone_ecosystem"}, {"score": 0.004792902033431373, "phrase": "application_developers'_motivations"}, {"score": 0.004684157900507474, "phrase": "current_smartphones"}, {"score": 0.004577869668211548, "phrase": "significant_value"}, {"score": 0.004515252649226697, "phrase": "provider_differentiation"}, {"score": 0.004473982381245469, "phrase": "independent_application_developers"}, {"score": 0.004352411290383643, "phrase": "different_platform_options"}, {"score": 0.004234129588974058, "phrase": "smartphone_operating_systems"}, {"score": 0.004138038784683869, "phrase": "android"}, {"score": 0.004119060966184137, "phrase": "apple"}, {"score": 0.004034787583452251, "phrase": "respective_ecosystem"}, {"score": 0.003916098498242888, "phrase": "motivational_factors"}, {"score": 0.0036553070575015344, "phrase": "main_motivations"}, {"score": 0.003596989333453733, "phrase": "intellectual_stimulation"}, {"score": 0.003531474887552889, "phrase": "new_skills"}, {"score": 0.003372844338742438, "phrase": "significant_differences"}, {"score": 0.0033037970113095577, "phrase": "ios_developers"}, {"score": 0.003140888248194296, "phrase": "major_roles"}, {"score": 0.002999749669403939, "phrase": "toolkit_quality"}, {"score": 0.002851790448644913, "phrase": "prior_research"}, {"score": 0.0025892330566358503, "phrase": "whole_ecosystem"}, {"score": 0.002571429085596686, "phrase": "end_user_device"}, {"score": 0.002472822097373027, "phrase": "major_component"}, {"score": 0.002427732996314194, "phrase": "large_and_diverse_ecosystem"}, {"score": 0.0023889533502525527, "phrase": "significant_group"}, {"score": 0.0023779873914944677, "phrase": "user_innovators"}, {"score": 0.0023079225317714815, "phrase": "network_size"}, {"score": 0.002183938718432764, "phrase": "platform_owner"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Smartphone operating systems", " Application markets", " Open innovation", " User innovation", " Motivation", " Ecosystem management"], "paper_abstract": "Context: The ecosystems surrounding current smartphones operating systems, especially the application markets, provide significant value for customers and therefore possibilities for provider differentiation. Why do independent application developers and innovators join these ecosystems, and which factors influence their choice between different platform options? Objective: This paper evaluates why innovators publish applications for smartphone operating systems, and which factors influence their choice between the two most common platforms, Android and Apple iOS, and leading them to join this respective ecosystem. Method: A quantitative questionnaire containing questions related to demographics, motivational factors, factors impacting choice of platform and application publishing history. 113 Application developers from all over the world responded, relatively evenly split between the two operating systems. Results: The main motivations are the experience of fun and intellectual stimulation during the process itself and learning of new skills or know-how. Financial gain, on the other hand, was found to be of less importance. There are also significant differences between the developers according to their preferred platform, e.g. iOS developers are more often motivated by financial gain. In choosing which ecosystem to join, network size, openness and entry barriers play major roles, and according to these criteria the two ecosystems are perceived to be significantly different. In addition, the toolkit quality is one of the most important factors for developers, but not a point of differentiation between the two ecosystems. Conclusion: This paper complements prior research with the viewpoint of the developers themselves, focusing on how they perceive both technical and economic, as well as governance related aspects. In addition, most research so far has focused on one aspect only, mostly application markets, while this study assess the perception of the whole ecosystem, including end user device, markets and OS. It is concluded that the motivations and perceptions of developers comprise a major component in the creation and management of a large and diverse ecosystem, and that there exists a significant group of user innovators, who are not motivated by financial gain. There are several other aspects besides network size that drive the choice of platform. In addition, developers perceive hardware, software, marketplaces and other aspects as one single construct. Any platform owner therefore has to carefully consider and manage their expectations and perceptions. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Joining a smartphone ecosystem: Application developers' motivations and decision criteria", "paper_id": "WOS:000341349000002"}