{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conditional_preference_bases"}, {"score": 0.015379952493162376, "phrase": "ranking_objects"}, {"score": 0.008049968382556824, "phrase": "conditional_preferences"}, {"score": 0.004546174820239776, "phrase": "description_logic_knowledge_base"}, {"score": 0.0044863018460183784, "phrase": "finite_set"}, {"score": 0.004198510172614725, "phrase": "context_phi"}, {"score": 0.004161553532799662, "phrase": "property_a"}, {"score": 0.0040886093072615, "phrase": "property_-alpha"}, {"score": 0.003911771812701971, "phrase": "variable-strength_defaults"}, {"score": 0.003877329308854808, "phrase": "conditional_knowledge_bases"}, {"score": 0.002908306074124806, "phrase": "lexicographic_way"}, {"score": 0.0027700855441353165, "phrase": "main_computational_tasks"}, {"score": 0.0025578967205807843, "phrase": "tractable_special_case"}, {"score": 0.002219916677664081, "phrase": "flexible_user-defined_ranking"}, {"score": 0.002161695357601592, "phrase": "personal_preferences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["variable-strength conditional preference", " ranking", " ontology", " description logic", " semantic web", " literature search", " algorithms and complexity"], "paper_abstract": "introduce conditional preference bases as a means for ranking objects in ontologies. Conditional preference bases consist of a description logic knowledge base and a finite set of conditional preferences, which are statements of the form \"generally, in the context phi, property a is preferred over property -alpha with strength s\". They are inspired by variable-strength defaults in conditional knowledge bases. We define the notion of consistency for conditional preference bases, and we show how consistent conditional preference bases can be used for ranking objects in ontologies, where every object represents essentially a set of individuals that are sharing the same ranking-relevant properties. More concretely, we define two object rankings, denoted k(sum) and k(lex), which evaluate the strengths of conditional preferences in an additive and a lexicographic way, respectively. Furthermore, we provide algorithms for the main computational tasks for ranking objects under conditional preference bases, we analyze the complexity of these tasks, and we delineate a tractable special case. To give evidence of the usefulness of this approach in practice, we describe two applications in the areas of product and literature search, where it allows especially for a flexible user-defined ranking of the query results reflecting personal preferences. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Variable-strength conditional preferences for ranking objects in ontologies", "paper_id": "WOS:000249583500004"}