{"auto_keywords": [{"score": 0.04902194563396072, "phrase": "forest_fires"}, {"score": 0.012882508221938092, "phrase": "data_model"}, {"score": 0.011480191019888005, "phrase": "road_network"}, {"score": 0.00481495049065317, "phrase": "route_planning"}, {"score": 0.00458412183693466, "phrase": "relief_vehicles"}, {"score": 0.004118026552723285, "phrase": "route_determination"}, {"score": 0.003601235776892337, "phrase": "response_team"}, {"score": 0.003382704886584695, "phrase": "sensor_information"}, {"score": 0.0031071175640144943, "phrase": "fire_simulation_model"}, {"score": 0.0030520148188164084, "phrase": "fire_evolution"}, {"score": 0.0028411768240129585, "phrase": "responders'_path"}, {"score": 0.0027535633837592597, "phrase": "safe_and_optimal_routes"}, {"score": 0.002621297299343551, "phrase": "predicted_availabilities"}, {"score": 0.0024075916292945715, "phrase": "simulated_scenarios"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Route planning", " Fire simulation", " Data model", " Algorithm"], "paper_abstract": "The ability to guide relief vehicles to safety and quickly pass through environments affected by fires is critical in fighting forest fires. In this paper, we focus on route determination in the case of forest fires, and propose a data model that supports finding paths among moving obstacles. This data model captures both static information, such as the type of the response team, the topology of the road network, and dynamic information, such as sensor information, changing availabilities of roads during disasters, and the position of the vehicle. We use a fire simulation model to calculate the fire evolution. The spread of the fire is represented as movements of obstacles that block the responders' path in the road network. To calculate safe and optimal routes avoiding obstacles, the A* algorithm is extended to consider the predicted availabilities of roads. We prove the optimality of the path calculated by our algorithm and then evaluate it in simulated scenarios. The results show that our model and algorithm are effective in planning routes that avoid one or more fire-affected areas and that the outlook for further investigation is promising. (c) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A data model for route planning in the case of forest fires", "paper_id": "WOS:000337648500001"}