{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "managerial_ties"}, {"score": 0.011783090011208917, "phrase": "open_innovation"}, {"score": 0.005966179306072429, "phrase": "malaysia"}, {"score": 0.005549487441199807, "phrase": "government_officials"}, {"score": 0.005087506564056668, "phrase": "high-tech_industry"}, {"score": 0.0038364365168131586, "phrase": "questionnaire_survey_method"}, {"score": 0.0036730297909962142, "phrase": "findings_-_results"}, {"score": 0.0034159525504642656, "phrase": "in-bound_open_innovation"}, {"score": 0.0029830992938695007, "phrase": "out-bound_open_innovation"}, {"score": 0.002883718207958817, "phrase": "aerospace_and_electronics_industries"}, {"score": 0.0027474453262607834, "phrase": "out-bound_innovation"}, {"score": 0.0026175952455594277, "phrase": "empirical_evidence"}, {"score": 0.002446024708601971, "phrase": "open_innovation_paradigm"}, {"score": 0.002135812692862058, "phrase": "major_gap"}, {"score": 0.0021049977753042253, "phrase": "current_open_innovation_theory"}], "paper_keywords": ["Malaysia", " Open innovation", " High-tech industries", " Managerial ties"], "paper_abstract": "Purpose - Research investigating the role of factors affecting open innovation remains scarce. The purpose of this paper is to examine the role of managerial ties in facilitating the two types of open innovation - in-bound and out-bound. Design/methodology/approach - Data are collected using the questionnaire survey method from 339 middle and top managers working in four high-tech industries in Malaysia. Findings - Results show that in most high-tech industries in Malaysia, managerial ties with universities and with government officials facilitate in-bound open innovation, while ties with managers at other firms do not significantly relate to it in any high-tech industry. Further, managerial ties are not found to relate significantly to out-bound open innovation in any high-tech industry except in the aerospace and electronics industries wherein ties with government officials relate negatively and positively to out-bound innovation, respectively. Practical implications - This study provides empirical evidence about the managerial ties practitioners should and should not forge to succeed in the open innovation paradigm. Originality/value - This study is probably the only study so far that gauges the impact of managerial ties on open innovation. The results of this study fill a major gap in the current open innovation theory besides providing insights for practitioners.", "paper_title": "Do managerial ties support or stifle open innovation?", "paper_id": "WOS:000341781200009"}