{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "e-learning_efficacy"}, {"score": 0.0046875099587735825, "phrase": "object_classification"}, {"score": 0.0043482604833437735, "phrase": "in-place_e-learning_facility"}, {"score": 0.004143196873246147, "phrase": "university_module"}, {"score": 0.003990385737207714, "phrase": "information_system"}, {"score": 0.0036422425344358037, "phrase": "final_indifferent_and_good_performance_classifications"}, {"score": 0.003342280102112269, "phrase": "ongoing_assessment"}, {"score": 0.003150466780962537, "phrase": "separate_classification_results"}, {"score": 0.003050508020268648, "phrase": "two-week_periods"}, {"score": 0.0027543636132088332, "phrase": "carbs_system"}, {"score": 0.002681315076008658, "phrase": "visual_representation"}, {"score": 0.002610198789888055, "phrase": "simplex_plots"}, {"score": 0.002407941567598653, "phrase": "dempster-shafer_theory"}, {"score": 0.0021049977753042253, "phrase": "student_performance"}], "paper_keywords": ["CaRBS", " e-learning", " efficacy", " performance", " assessment"], "paper_abstract": "This study investigates the efficacy of an in-place e-learning facility, towards the performance of students on a university module, through the utilization of an information system based on CaRBS (Classification and Ranking Belief Simplex). It attempts to discern the final indifferent and good performance classifications of students based on their activity during the module (online page views). The ongoing assessment of the students every two weeks during the module is modelled with separate classification results reported as the number of two-week periods builds up. Students who completed the course as well as those who withdrew are considered. The CaRBS system has its emphasis on the visual representation of results (using simplex plots), as well as its operations in the presence of ignorance (using the Dempster-Shafer theory of evidence). In the analysis of the module considered, the activity over certain weeks is consistently shown to be important to discern student performance. This study is of interest to practitioners and theorists, with the results shown offering a benchmark to the type of findings pertinent to expositing e-learning efficacy.", "paper_title": "Temporal support in the identification of e-learning efficacy: an example of object classification in the presence of ignorance", "paper_id": "WOS:000243533900001"}