{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "combinatorial_optimization_problem"}, {"score": 0.004709567162738894, "phrase": "dynamic_ride-sharing"}, {"score": 0.00424734451992536, "phrase": "earliest_departure_time"}, {"score": 0.004200582085706493, "phrase": "latest_arrival_time"}, {"score": 0.004154332348800334, "phrase": "maximum_cost"}, {"score": 0.004003798249233137, "phrase": "car_owners"}, {"score": 0.003774164192882704, "phrase": "taxi_drivers"}, {"score": 0.0030464123943266673, "phrase": "maximum_trip_cost"}, {"score": 0.002990650318403461, "phrase": "maximum_delay"}, {"score": 0.002914288956035066, "phrase": "new_requests"}, {"score": 0.002716681656135794, "phrase": "dynamic_problem"}, {"score": 0.0026472970609754095, "phrase": "time_periods"}, {"score": 0.002551231163230566, "phrase": "static_problem"}, {"score": 0.0024860616730750158, "phrase": "greedy_randomized_adaptive_search_procedure"}, {"score": 0.0023958326775913165, "phrase": "real_data"}, {"score": 0.002317423416027688, "phrase": "proposed_method"}, {"score": 0.0021522261505574035, "phrase": "private_rides"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Taxi-sharing", " Ride-sharing", " Dial-a-Ride", " Heuristics", " GRASP"], "paper_abstract": "This paper deals with a combinatorial optimization problem that models situations of both dynamic ride-sharing and taxi-sharing. Passengers who want to share a taxi or a ride, use an app to specify their current location, destination and further information such as the earliest departure time, the latest arrival time and the maximum cost they are willing to pay for the ride. Car owners also specify their origin, destination, the leaving time and the maximum accepted delay. Taxi drivers report their location and the time they will start and end the service. All drivers need to define a price per kilometer. The problem is to compute routes, matching requests to vehicles in such a way that ride-sharing is allowed as long as some restrictions are satisfied, such as: the capacity of the vehicle, maximum trip cost of each passenger and maximum delay. The problem is dynamic since new requests arrive on-line and routes can be modified in order to attend them. To solve this dynamic problem, the day is divided in time periods. For each period, an instance of a static problem is created and solved by a greedy randomized adaptive search procedure (GRASP). Experiments with instances based on real data were made to evaluate the heuristics and the proposed method. In our simulations with taxis, passengers paid, on average, almost 30% less than they would pay on private rides. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Taxi and Ride Sharing: A Dynamic Dial-a-Ride Problem with Money as an Incentive", "paper_id": "WOS:000356735100020"}