{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "oral_document"}, {"score": 0.006852556923643889, "phrase": "oral_data"}, {"score": 0.004662427600500598, "phrase": "continued_analysis"}, {"score": 0.004143196873246147, "phrase": "oral_document_concept"}, {"score": 0.0037182772059089434, "phrase": "new_type"}, {"score": 0.003603327452846714, "phrase": "managerial_decrees"}, {"score": 0.0031448288291084, "phrase": "documentary_practice"}, {"score": 0.003055977395076106, "phrase": "method_utilized_limits"}, {"score": 0.002927371124061966, "phrase": "small_sample"}, {"score": 0.0029064676523923886, "phrase": "face-to-face_oral_data"}, {"score": 0.002734692147497601, "phrase": "documentary_practices"}, {"score": 0.0027151607914592552, "phrase": "additional_ways"}, {"score": 0.002554662768695568, "phrase": "similar_research"}, {"score": 0.002473560912156024, "phrase": "managerial_decree"}, {"score": 0.0024296194239886676, "phrase": "organizational_contexts"}, {"score": 0.0023356699564158426, "phrase": "increased_management"}, {"score": 0.0023189818169615135, "phrase": "staff_understanding"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Oral documents", " Managerial decrees", " Face-to-face communication", " Information behavior", " Properties of documentary practice", " Documents", " Document management"], "paper_abstract": "Purpose - \"Oral documents in concept and in situ, part I\" aims to conceptualize and provide a means to empirically observe an oral document. Part II aims to report the results of continued analysis of the oral data gathered to increase understanding of one type of document, i.e. a managerial decree, which is also conceptualized and empirically observed. Additionally, the results further validate the oral document concept. Design/methodology/approach - This study analyzes oral data by: exploring how they adhere to the articulation of the concept of an oral document; and reporting on an investigation that operationalizes the properties of documents to facilitate empirically observing managerial decrees. Findings - The results reveal one type of oral document, i.e. a managerial decree, being used in practice. This outcome further validates and further clarifies the concept of an oral document. Additionally, three new properties of documentary practice are identified. Research limitations/implications - The method utilized limits the research results to identifying one type of oral document identified within a small sample of face-to-face oral data gathered from a single kind of context. Practical implications - The identification of three additional properties of documentary practices contributes additional ways to identify documents. The method used to identify properties and documents may be repeated in similar research. The reification of the new type of oral document managerial decree allows for orality in organizational contexts to be discussed and trained on, with goals of increased management and staff understanding of and success in their oral communications. Originality/value - This paper conceptualizes a new type of oral document (managerial decree). This paper also incorporates recommendations for future research..", "paper_title": "Oral documents in concept and in situ, part II: managerial decrees", "paper_id": "WOS:000312362600008"}