{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ecg"}, {"score": 0.025475453307981996, "phrase": "precordial_leads"}, {"score": 0.0047689174754929195, "phrase": "maximizing_information_capture"}, {"score": 0.004618614357974438, "phrase": "new_ways"}, {"score": 0.004574449773348889, "phrase": "ecg_acquisition"}, {"score": 0.0045162169185355, "phrase": "current_study"}, {"score": 0.004444462552988661, "phrase": "optimal_configurations"}, {"score": 0.004195418010131832, "phrase": "total_body_surface_potential_distribution"}, {"score": 0.0037743802306714545, "phrase": "resulting_eigenvectors"}, {"score": 0.003750260412839128, "phrase": "recording_sites"}, {"score": 0.003643607569483598, "phrase": "precordial_region"}, {"score": 0.0031641444460976673, "phrase": "existing_limited_lead_systems"}, {"score": 0.0030642636185693054, "phrase": "conventional_leads"}, {"score": 0.0029866270401697906, "phrase": "signal_strength"}, {"score": 0.0028463059289874637, "phrase": "qrs_segments"}, {"score": 0.0028190755157929534, "phrase": "stt"}, {"score": 0.002703869368554536, "phrase": "total_body_surface_information"}, {"score": 0.0023553236684739887, "phrase": "easi_lead_system"}, {"score": 0.0023327506323251074, "phrase": "limited_lead_system"}, {"score": 0.002259054486157494, "phrase": "proposed_leads"}, {"score": 0.0022374020089160084, "phrase": "suitable_alternative"}, {"score": 0.0021597662797996843, "phrase": "snr._more_work"}], "paper_keywords": ["EASI leads", " ECG", " SNR"], "paper_abstract": "There is currently much interest in exploring new ways to optimize ECG acquisition. In the current study, we have investigated optimal configurations of ECG leads with respect to: 1) best signal magnitude (maximal signal variance) and 2) best reconstruction of the total body surface potential distribution and the 12-lead ECG. Principal component analysis was applied to a set of 117-lead body surface potential maps (BSPMs) recorded from 559 subjects. Three bipolar leads, referred to as \"eigenleads,\" were identified from the extrema on the resulting eigenvectors. Recording sites for the three leads were largely located in the precordial region. The magnitude of the signals recorded from the eigenleads was calculated on a set of 185 unseen subjects. The accuracy of the eigenleads in the reconstruction of BSPMs and the 12-lead ECG was also assessed for each subject. These results were compared to existing limited lead systems. It was found that, when compared to conventional leads, eigenleads could be used to increase signal strength (rms voltage) by 27.9%, 39.0%, and 20.3% for P-waves, QRS segments, and STT segments, respectively. Although the eigenleads were not able to reconstruct total body surface information as well as the 12-lead ECG (24.4 mu V versus 20.2 mu V), the eigenleads did perform comparably with other limited lead systems in the estimation of the 12-lead ECG. In particular, the eigenleads performed well in the reconstruction of precordial leads in comparison to the EASI lead system and a limited lead system made up of a subset of precordial leads. The proposed leads are a suitable alternative limited leads system, and can be used to improve SNR. More work is needed to test the practicality of such leads.", "paper_title": "Eigenleads: ECG Leads for Maximizing Information Capture and Improving SNR", "paper_id": "WOS:000273710500011"}