{"auto_keywords": [{"score": 0.049226991195811136, "phrase": "control_strategies"}, {"score": 0.00481495049065317, "phrase": "information_gathering_interaction"}, {"score": 0.004686963264680882, "phrase": "adjustable_autonomy_multiagent_systems"}, {"score": 0.004303591748086452, "phrase": "multiagent_systems"}, {"score": 0.004226949670141375, "phrase": "full_transfers"}, {"score": 0.003628024127607343, "phrase": "optimal_transfer"}, {"score": 0.003595552309967789, "phrase": "control_strategy"}, {"score": 0.0032277611129050234, "phrase": "possible_transfer"}, {"score": 0.0031277316566463978, "phrase": "earlier_efforts"}, {"score": 0.0030171910207671205, "phrase": "information_seeking_interaction"}, {"score": 0.002936849401568391, "phrase": "overall_processing"}, {"score": 0.0021049977753042253, "phrase": "adjustable_autonomy_systems"}], "paper_keywords": [""], "paper_abstract": "In this paper, we present a model that allows agents to reason about adjusting their autonomy in multiagent systems, integrating both full transfers of decision making control to other entities (users or agents) and initiations of interaction to gather more information (referred to as partial transfers of control). We show how agents can determine the optimal transfer of control strategy (which specifies which entities to transfer control to, and how long to wait for a response), by generating and evaluating possible transfer of control strategies. This approach extends earlier efforts in the field by explicitly demonstrating how information seeking interaction can be integrated into the overall processing of the agent. Through examples, we demonstrate the benefits of an agent asking questions, in order to determine the most useful transfers, or to improve its own decision making ability. In particular, we show how the model can be used to effectively determine whether or not it is beneficial to initiate interaction with users. We conclude with discussions on. the value of the model as the basis for designing adjustable autonomy systems.", "paper_title": "Integrating information gathering interaction into transfer of control strategies in adjustable autonomy multiagent systems", "paper_id": "WOS:000239589600001"}