{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "autonomic_resource_management"}, {"score": 0.041752308540329006, "phrase": "isps'_revenue"}, {"score": 0.00478999749469106, "phrase": "virtual_private_networks"}, {"score": 0.004571133708117498, "phrase": "important_problems"}, {"score": 0.004430809690668064, "phrase": "asa"}, {"score": 0.004317109072311102, "phrase": "resources_management"}, {"score": 0.004206338218873218, "phrase": "isps'_performance"}, {"score": 0.004152018764100109, "phrase": "resources_allocation"}, {"score": 0.0039519004610213595, "phrase": "suboptimal_way"}, {"score": 0.003850464100878052, "phrase": "customers'_exaggeration"}, {"score": 0.0037908515763223107, "phrase": "non-efficient_resource_utilization"}, {"score": 0.0035707323534329835, "phrase": "sla_negotiation_session"}, {"score": 0.003434085751246066, "phrase": "available_network_resources"}, {"score": 0.0033546123237802234, "phrase": "autonomic_resources_management_mechanism"}, {"score": 0.003234615195382533, "phrase": "auction_mechanism"}, {"score": 0.0031679764228666144, "phrase": "best_bidders"}, {"score": 0.0031188970263124546, "phrase": "threat_model"}, {"score": 0.00300730617788096, "phrase": "created_inconvenience"}, {"score": 0.0027383004087134107, "phrase": "isp_revenue"}, {"score": 0.002674885993329912, "phrase": "customers'_utility"}, {"score": 0.002612936300948578, "phrase": "collusion_resistant_model"}, {"score": 0.0025858644319102114, "phrase": "markov_decision_process"}, {"score": 0.0025391816569870452, "phrase": "isp"}, {"score": 0.002512850690695835, "phrase": "state-dependent_optimal_cost-unit_threshold"}, {"score": 0.002317962367296038, "phrase": "collusion_behavior"}, {"score": 0.0022999311562151015, "phrase": "vcg"}, {"score": 0.0022407927161620855, "phrase": "simulation_results"}, {"score": 0.0022175679453857473, "phrase": "armm_model"}, {"score": 0.0021831803612759855, "phrase": "network_resources"}, {"score": 0.0021661866204989336, "phrase": "isps'_profit"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Autonomic resource management", " Markov decision theory", " Game theory", " VCG mechanism design"], "paper_abstract": "In this paper, we address the problem of autonomic resource management for Virtual Private Networks (VPNs) Resources management is one of the important problems facing most Internet Service Providers (ISPs) As a solution, the Autonomic Service Architecture (ASA) is proposed in the literature to automate the resources management. Although, this model is able to improve ISPs' performance by automatically adjusting the resources allocation of each customer, it still suffers from two main limitations First, this model increases the ISPs' revenue in a suboptimal way Second. this model has no mechanism to prevent customers' exaggeration that can lead to a non-efficient resource utilization, and violate the contracted Service Level Agreements' (SLAs) terms To guarantee their QoS classes, customers might exaggerate by asking for more resources during and after the SLA negotiation session, especially in the case of multimedia streaming, and this can waste the available network resources To overcome the above limitations, we propose an Autonomic Resources Management Mechanism (ARMM) that increases the ISPs' revenue by allocating resources based on the auction mechanism, where resources are granted to the best bidders Additionally, we propose a threat model based on Vickrey-Clarke-Groves (VCG) mechanism that is able to penalize exaggerating bidders according to the created inconvenience Since in our framework, customers are assumed to be rational, they will avoid asking for more unneeded resources but they can collude with others to have the resources for less. Such a behavior can dramatically minimize the ISP revenue while on the other hand it can maximize the customers' utility. To avoid this, we propose a collusion resistant model based on the Markov Decision Process (MDP) that allows the ISP to calculate the state-dependent optimal cost-unit threshold based on the shadow price concept All bids that are greater than or equal this threshold are considered in the auction. With this threshold, we can reduce the collusion behavior and with VCG we can motivate the customers to not exaggerate. Simulation results show that the ARMM model is able to efficiently utilize network resources, increase ISPs' profit, and customers' satisfaction rates (C) 2010 Elsevier B.V. All rights reserved", "paper_title": "A collusion-resistant mechanism for autonomic resource management in Virtual Private Networks", "paper_id": "WOS:000283643000008"}