{"auto_keywords": [{"score": 0.04891621500316522, "phrase": "personal_energy_consumption"}, {"score": 0.04823115624486472, "phrase": "energy_consumption"}, {"score": 0.00481495049065317, "phrase": "teenage_personal_contexts"}, {"score": 0.004744437370338926, "phrase": "technology_enhanced_enquiry"}, {"score": 0.004539005582217309, "phrase": "increasingly_high_government_priority"}, {"score": 0.004428728205625129, "phrase": "important_category"}, {"score": 0.004385367803204002, "phrase": "future_energy_consumers"}, {"score": 0.003479692058963528, "phrase": "teenagers'_personal_contexts"}, {"score": 0.002986969236641105, "phrase": "participatory_design_methodology"}, {"score": 0.0028574164693918433, "phrase": "support_learning_technologies"}, {"score": 0.0022890371899188466, "phrase": "initial_phases"}, {"score": 0.002255431275670053, "phrase": "learning_technologies"}, {"score": 0.0021682027434117095, "phrase": "learners'_personal_contexts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Secondary education", " Applications in subject areas"], "paper_abstract": "Reducing energy consumption is becoming an increasingly high government priority. Teenagers are an important category of future energy consumers, but little is known of their conceptions about energy and, particularly, how formal learning about energy translates into understanding of personal energy consumption. We have worked with teenagers to investigate the design of learning technologies that support understanding about energy consumption in a way that is relevant to teenagers' personal contexts, including their motivations, concerns and conceptions, their personal energy consumption, and the sources of information about energy already available to them. In this paper we report on our findings and participatory design methodology. The findings contribute to our understanding of the support learning technologies must provide to scaffold teenagers' learning about personal energy consumption, in terms of how teenagers conceptualise energy consumption, what skills they have in searching for information, and what they consider motivating and relevant. Our methodology, more generally, contributes to our understanding of the initial phases of developing learning technologies that are grounded in an understanding of learners' personal contexts. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Modelling teenage personal contexts to support technology enhanced enquiry into personal energy consumption", "paper_id": "WOS:000325600400033"}