{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_and_innovative_intelligent_tutoring_system"}, {"score": 0.004202741104973709, "phrase": "educational_area"}, {"score": 0.004101366149219787, "phrase": "different_tournaments"}, {"score": 0.0037456980766939836, "phrase": "different_questions"}, {"score": 0.003373334961160647, "phrase": "different_disciplines"}, {"score": 0.003212424802083714, "phrase": "different_functionality"}, {"score": 0.0031678720736808574, "phrase": "students'_registration"}, {"score": 0.00292339061443511, "phrase": "tournament_life_cycle"}, {"score": 0.002754863452181364, "phrase": "different_exercises"}, {"score": 0.0026233771102489416, "phrase": "different_algorithms"}, {"score": 0.0024039564563674673, "phrase": "students'_ratings"}, {"score": 0.0023052356887304204, "phrase": "iscare_intelligent_tutoring_system"}, {"score": 0.0021496083700137305, "phrase": "desired_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Competition", " Education", " Intelligent tutoring system", " Software tool"], "paper_abstract": "ISCARE (Information System for Competition based on pRoblem solving in Education) is a new and innovative intelligent tutoring system that we have designed and implemented. This tool allows the competition among students for improving their learning process in a course. The tool takes some ideas from the Swiss-system widely used in chess and adapts them to the educational area. The competition is based on different tournaments and rounds. In each round, students are assigned in pairs of two, which compete one against another, and each pair receives different questions that students have to solve in a limit of time. Students can see their partial ratings after each round and their final rating after a tournament. A lot of knowledge from different disciplines was used to design, and implement this system, as ISCARE includes different functionality such as the students' registration into the system, the creation of tournaments, the registration and assignment of students to tournaments, the management of each tournament life cycle (started, in execution, finished, etc.), the addition of the different exercises to tournaments, the calculation of pairs of students for each round with different algorithms, the assignment of exercises per round and pair, the scorings of the students per round and tournament, the management of the students' ratings, or the visualization of information. This paper presents the ISCARE intelligent tutoring system, describing its different options, menus, or functionality as well as its architecture and the specific modeling to achieve the desired features. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "An adaptive and innovative question-driven competition-based intelligent tutoring system for learning", "paper_id": "WOS:000302032600029"}