{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "blue_button"}, {"score": 0.011949900881654044, "phrase": "blue_button_use"}, {"score": 0.011496295588288142, "phrase": "non-va_providers"}, {"score": 0.00969446118460687, "phrase": "blue_button_users"}, {"score": 0.009582330216163594, "phrase": "non-va_provider"}, {"score": 0.004667149874736771, "phrase": "health_record_information"}, {"score": 0.0045415338200109345, "phrase": "objective_the_blue_button_feature"}, {"score": 0.004436545340717729, "phrase": "patient_engagement"}, {"score": 0.0036221822903900725, "phrase": "perceived_value"}, {"score": 0.003538371552216452, "phrase": "veterans"}, {"score": 0.0033372020049592726, "phrase": "survey_participants"}, {"score": 0.003234615195382533, "phrase": "current_blue_button_users"}, {"score": 0.0029800360974218836, "phrase": "twenty-one_percent"}, {"score": 0.0027240799841720957, "phrase": "veterans'_self-rated_computer_ability"}, {"score": 0.0024610448251906453, "phrase": "low_awareness"}, {"score": 0.0023029188952824685, "phrase": "early_blue_button_adoption"}, {"score": 0.0022407927161620855, "phrase": "patient-initiated_sharing"}, {"score": 0.002197443382039439, "phrase": "educational_efforts"}, {"score": 0.0021049977753042253, "phrase": "usability_issues"}], "paper_keywords": [""], "paper_abstract": "Objective The Blue Button feature of online patient portals promotes patient engagement by allowing patients to easily download their personal health information. This study examines the adoption and use of the Blue Button feature in the Department of Veterans Affairs' (VA) personal health record portal, My HealtheVet. Materials and methods An online survey presented to a 4% random sample of My HealtheVet users between March and May 2012. Questions were designed to determine characteristics associated with Blue Button use, perceived value of use, and how Veterans with non-VA providers use the Blue Button to share information with their non-VA providers. Results Of the survey participants (N=18 398), 33% were current Blue Button users. The most highly endorsed benefit was that it helped patients understand their health history better because all the information was in one place (73%). Twenty-one percent of Blue Button users with a non-VA provider shared their VA health information, and 87% reported that the non-VA provider found the information somewhat or very helpful. Veterans' self-rated computer ability was the strongest factor contributing to both Blue Button use and to sharing information with non-VA providers. When comparing Blue Button users and non-users, barriers to adoption were low awareness of the feature and difficulty using the Blue Button. Conclusions This study contributes to the understanding of early Blue Button adoption and use of this feature for patient-initiated sharing of health information. Educational efforts are needed to raise awareness of the Blue Button and to address usability issues that hinder adoption.", "paper_title": "Blue Button use by patients to access and share health record information using the Department of Veterans Affairs' online patient portal", "paper_id": "WOS:000337660600018"}