{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spoken_dialogue_systems"}, {"score": 0.03227078104988101, "phrase": "first_level"}, {"score": 0.030389085232966018, "phrase": "recognition_result"}, {"score": 0.004548253531664032, "phrase": "speech_recognition_errors"}, {"score": 0.004215397034321004, "phrase": "speech_recognition_result_call"}, {"score": 0.004116440453049531, "phrase": "threshold_learnt"}, {"score": 0.003725470458263889, "phrase": "current_prompt_type"}, {"score": 0.0036727235025069828, "phrase": "dialogue_system"}, {"score": 0.0034037221513153566, "phrase": "confidence_scores"}, {"score": 0.0029935730127943496, "phrase": "syntactic-semantic_and_lexical_models"}, {"score": 0.002657890175649468, "phrase": "second_level"}, {"score": 0.0026077803487003, "phrase": "basic_linguistic_knowledge"}, {"score": 0.002546466113418944, "phrase": "grammatical_correctness"}, {"score": 0.0023152577218214804, "phrase": "experimental_results"}], "paper_keywords": ["spoken dialogue systems", " speech recognition", " speech understanding", " natural language processing", " speech-based human-computer interaction"], "paper_abstract": "This paper proposes a technique to correct speech recognition errors in spoken dialogue systems that presents two main novel contributions. On the one hand, it considers several contexts where a speech recognition result call be corrected. A threshold learnt in the training is used to decide whether the correction must be carried out in the context associated with the current prompt type of a dialogue system, or in another context. On the other hand, the technique deals with the confidence scores of the words employed in the corrections. The correction is carried out at two levels: statistical and linguistic. At the first level the technique employs syntactic-semantic and lexical models, both contextual, to decide whether a recognition result is correct. According to this decision the recognition result may be changed. At the second level the technique employs basic linguistic knowledge to decide about the grammatical correctness of the outcome of the first level. According to this decision the outcome may be changed as well. Experimental results indicate that the technique enhances a dialogue system's word accuracy, speech understanding, implicit recovery and task completion rates by 8.5%, 16.54%, 4% and 44.17%, respectively. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "ASR post-correction for spoken dialogue systems based on semantic, syntactic, lexical and contextual information", "paper_id": "WOS:000258814000009"}