{"auto_keywords": [{"score": 0.048569884370968826, "phrase": "machine_learning_techniques"}, {"score": 0.04295633024454107, "phrase": "knowledge_sharing"}, {"score": 0.00481495049065317, "phrase": "allergens_ontology"}, {"score": 0.004263168852219816, "phrase": "particular_domain"}, {"score": 0.0037024804835018373, "phrase": "biomedical_domain"}, {"score": 0.0034282732966589478, "phrase": "rapidly_growing_field"}, {"score": 0.003215295260684715, "phrase": "ontology_maintenance_process"}, {"score": 0.003113804826864362, "phrase": "ontological_knowledge"}, {"score": 0.0028463059289874637, "phrase": "formally_defined_ontology"}, {"score": 0.0027212777001495176, "phrase": "domain_specific_corpora"}, {"score": 0.002601727192945944, "phrase": "well-defined_experimental_setting"}, {"score": 0.0024556852466581527, "phrase": "allergen_domain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Ontologies are widely used for formalizing and organizing the knowledge of a particular domain of interest. This facilitates knowledge sharing and re-use by both people and systems. Ontologies are becoming increasingly important in the biomedical domain since they enable knowledge sharing in a formal, homogeneous and unambiguous way. Knowledge in a rapidly growing field such as biomedicine is usually evolving and therefore an ontology maintenance process is required to keep ontological knowledge up-to-date. This work presents our methodology for building a formally defined ontology, maintaining it exploiting machine learning techniques and domain specific corpora, and evaluating it using a well-defined experimental setting. The application of this methodology in the allergen domain is then discussed in detail presenting the ontology built, the specific techniques used and the evaluation settings. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Building an allergens ontology and maintaining it using machine learning techniques", "paper_id": "WOS:000240787100008"}