{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "state_or_state_transitions"}, {"score": 0.0045464538515249085, "phrase": "concurrent_systems"}, {"score": 0.004417848254181138, "phrase": "state_and_state_transitions"}, {"score": 0.0037834649508375544, "phrase": "concurrent_software"}, {"score": 0.003166259444961177, "phrase": "concurrent_programs"}, {"score": 0.0030414140732789186, "phrase": "state_transitions"}, {"score": 0.0028880836335117297, "phrase": "broadened_notion"}, {"score": 0.002806256131739047, "phrase": "interacting_components"}, {"score": 0.002711109302199029, "phrase": "concurrent_compositions"}, {"score": 0.0026041635822373265, "phrase": "fixed_point_problem"}, {"score": 0.002544951823639408, "phrase": "fixed_point_problems"}, {"score": 0.002444544487772349, "phrase": "metric_spaces"}, {"score": 0.002321234686549485, "phrase": "domain_theories"}, {"score": 0.0021049977753042253, "phrase": "transition_systems"}], "paper_keywords": [""], "paper_abstract": "This paper argues that basing the semantics of concurrent systems on the notions of state and state transitions is neither advisable nor necessary. The tendency to do this is deeply rooted in our notions of computation, but these roots have proved problematic in concurrent software in general, where they have led to such poor programming practice as threads. I review approaches (some of which have been around for some time) to the semantics of concurrent programs that rely on neither state nor state transitions. Specifically, these approaches rely on a broadened notion of computation consisting of interacting components. The semantics of a concurrent compositions of such components generally reduces to a fixed point problem. Two families of fixed point problems have emerged, one based on metric spaces and their generalizations, and the other based on domain theories. The purpose of this paper is to argue for these approaches over those based on transition systems, which require the notion of state.", "paper_title": "Concurrent semantics without the notions of state or state transitions", "paper_id": "WOS:000241576400002"}