{"auto_keywords": [{"score": 0.04231365345404783, "phrase": "cc_data"}, {"score": 0.035344389882638515, "phrase": "defect_predictors"}, {"score": 0.01045366385247936, "phrase": "wc_data"}, {"score": 0.00988489269608721, "phrase": "nn-filtered_cc_data"}, {"score": 0.009120571073163837, "phrase": "minimum_number"}, {"score": 0.00757512539885171, "phrase": "defect_prediction_process"}, {"score": 0.00481495049065317, "phrase": "relative_value"}, {"score": 0.004681413843223496, "phrase": "defect_prediction"}, {"score": 0.004599831967997116, "phrase": "practical_defect_prediction_approach"}, {"score": 0.004487989502479992, "phrase": "defect_related_data"}, {"score": 0.004242411872706126, "phrase": "localized_defect_predictors"}, {"score": 0.0037508743235608872, "phrase": "analogy-based_learning"}, {"score": 0.003545487140867762, "phrase": "fine_tune"}, {"score": 0.0028201570908224166, "phrase": "final_analysis"}, {"score": 0.002761176640988626, "phrase": "local_defect_reports"}, {"score": 0.0027129670661026964, "phrase": "wc_defect_predictors"}, {"score": 0.002609840513713399, "phrase": "data_samples"}, {"score": 0.0025733173062050018, "phrase": "effective_defect_predictors"}, {"score": 0.0024066745849759706, "phrase": "local_defect_data"}, {"score": 0.0023646398663605493, "phrase": "two-phase_approach"}], "paper_keywords": ["Defect prediction", " Learning", " Metrics (product metrics)", " Cross-company", " Within-company", " Nearest-neighbor filtering"], "paper_abstract": "We propose a practical defect prediction approach for companies that do not track defect related data. Specifically, we investigate the applicability of cross-company (CC) data for building localized defect predictors using static code features. Firstly, we analyze the conditions, where CC data can be used as is. These conditions turn out to be quite few. Then we apply principles of analogy-based learning (i.e. nearest neighbor (NN) filtering) to CC data, in order to fine tune these models for localization. We compare the performance of these models with that of defect predictors learned from within-company (WC) data. As expected, we observe that defect predictors learned from WC data outperform the ones learned from CC data. However, our analyses also yield defect predictors learned from NN-filtered CC data, with performance close to, but still not better than, WC data. Therefore, we perform a final analysis for determining the minimum number of local defect reports in order to learn WC defect predictors. We demonstrate in this paper that the minimum number of data samples required to build effective defect predictors can be quite small and can be collected quickly within a few months. Hence, for companies with no local defect data, we recommend a two-phase approach that allows them to employ the defect prediction process instantaneously. In phase one, companies should use NN-filtered CC data to initiate the defect prediction process and simultaneously start collecting WC (local) data. Once enough WC data is collected (i.e. after a few months), organizations should switch to phase two and use predictors learned from WC data.", "paper_title": "On the relative value of cross-company and within-company data for defect prediction", "paper_id": "WOS:000268543800003"}