{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "prior_knowledge"}, {"score": 0.04386239968305887, "phrase": "introductory_course"}, {"score": 0.03043979074772657, "phrase": "students'_prior_knowledge"}, {"score": 0.0047547526023100665, "phrase": "engineering_graphics_learning"}, {"score": 0.00446481608187988, "phrase": "freshmen_students"}, {"score": 0.004335603324413586, "phrase": "technical_drawing"}, {"score": 0.0038549394272661356, "phrase": "full_advantage"}, {"score": 0.0038066979615349822, "phrase": "cad_software"}, {"score": 0.003696460568091852, "phrase": "engineering_graphics_education"}, {"score": 0.003286420941205958, "phrase": "students'_ability"}, {"score": 0.002532724486603177, "phrase": "useful_tool"}, {"score": 0.0024904974828343033, "phrase": "possible_gap"}, {"score": 0.0024284701569889113, "phrase": "basic_knowledge"}, {"score": 0.002338306897057454, "phrase": "first-year_engineering_student"}, {"score": 0.0021861845339709533, "phrase": "cognitive_abilities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Engineering graphics", " CAD", " Knowledge evaluation", " Skills evaluation", " Cognition"], "paper_abstract": "In this work, we analyze the results obtained by a group of freshmen students in a test of prior knowledge on technical drawing carried out before and after attending an introductory course on this subject. The aim of this course was to help students to gain knowledge necessary to take full advantage of the CAD software that is regularly used to teach engineering graphics education in the classroom. Two aspects of the results will be analyzed. First, if this kind of course is good enough to show an improvement in students' ability. As will be shown, the score obtained by the students improved after attending the course. Second, we have analyzed the results in order to know if the students' prior knowledge is good enough to allow them coping with their first year. Although the answer to this question depends on many factors, it will be shown that an introductory course is a useful tool to reduce the possible gap between the students' prior knowledge and the basic knowledge on geometry that should be requested to a first-year engineering student. The kind of test we propose here could also be implemented to test the cognitive abilities of the students. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating background and prior knowledge: A case study on engineering graphics learning", "paper_id": "WOS:000269069200014"}