{"auto_keywords": [{"score": 0.03684049951840963, "phrase": "reference_signal"}, {"score": 0.008611889461262762, "phrase": "phase_synchrony"}, {"score": 0.007435400004912526, "phrase": "significant_impact"}, {"score": 0.006305134616813651, "phrase": "reference_signal_power"}, {"score": 0.0055277152192681825, "phrase": "msc."}, {"score": 0.004793496614501576, "phrase": "eeg_correlation"}, {"score": 0.004635641907088067, "phrase": "eeg"}, {"score": 0.004563691742821759, "phrase": "time-series_measures"}, {"score": 0.004201671536220666, "phrase": "recording_reference_signal"}, {"score": 0.0040541175838850795, "phrase": "bipolar_and_average_reference"}, {"score": 0.003955679223407243, "phrase": "reference_signal_amplitude"}, {"score": 0.003920476803132283, "phrase": "eeg_signal_correlation"}, {"score": 0.0038769122782680446, "phrase": "msc._we"}, {"score": 0.0037997077863530897, "phrase": "negative_correlation"}, {"score": 0.003740720352169084, "phrase": "absolute_value"}, {"score": 0.0036173729405604674, "phrase": "monotonic_decrease"}, {"score": 0.003420735116653331, "phrase": "even_a_small_change"}, {"score": 0.003293142761521422, "phrase": "positive_correlation"}, {"score": 0.003142059257826739, "phrase": "positive_value"}, {"score": 0.002977835845437357, "phrase": "negative_cross-power"}, {"score": 0.002784540221128404, "phrase": "positive_cross-power"}, {"score": 0.002627169567168764, "phrase": "small_amplitude"}, {"score": 0.002467600768898372, "phrase": "high_relative_amplitude"}, {"score": 0.0023437863565921053, "phrase": "reference_signal_contribution"}, {"score": 0.0023333173799963795, "phrase": "intracranial_eeg"}, {"score": 0.002256272909753353, "phrase": "referential_ieeg"}, {"score": 0.002241171326888997, "phrase": "human_subjects"}, {"score": 0.002157481084671366, "phrase": "experimental_results"}, {"score": 0.002128694000627911, "phrase": "recording_reference"}, {"score": 0.0021049977753042253, "phrase": "bivariate_measures"}], "paper_keywords": ["Bipolar electroencephalography (EEG)", " coherence", " corrected EEG", " correlation", " phase synchrony", " referential EEG", " scalp reference signal", " spectral power"], "paper_abstract": "The degree of synchronization in electroencephalography (EEG) signals is commonly characterized by the time-series measures, namely, correlation, phase synchrony, and magnitude squared coherence (MSC). However, it is now well established that the interpretation of the results from these measures are confounded by the recording reference signal and that this problem is not mitigated by the use of other EEG montages, such as bipolar and average reference. In this paper, we analyze the impact of reference signal amplitude and power on EEG signal correlation, phase synchrony, and MSC. We show that, first, when two nonreferential signals have negative correlation, the phase synchrony and the absolute value of the correlation of the two referential signals may have two regions of behavior characterized by a monotonic decrease to zero and then a monotonic increase to one as the amplitude of the reference signal varies in [0,+infinity). It is notable that even a small change of the amplitude may lead to significant impact on these two measures. Second, when two nonreferential signals have positive correlation, the correlation and phase-synchrony values of the two referential signals can monotonically increase to one (or monotonically decrease to some positive value and then monotonically increase to one) as the amplitude of the reference signal varies in [0,+infinity). Third, when two nonreferential signals have negative cross-power, the MSC of the two referential signals can monotonically decrease to zero and then monotonically increase to one as reference signal power varies in [0,+infinity). Fourth, when two nonreferential signals have positive cross-power, the MSC of the two referential signals can monotonically increase to one as the reference signal power varies in [0,+infinity). In general, the reference signal with small amplitude or power relative to the signals of interest may decrease or increase the values of correlation, phase synchrony, and MSC. However, the reference signal with high relative amplitude or power will always increase each of the three measures. In our previous paper, we developed a method to identify and extract the reference signal contribution to intracranial EEG (iEEG) recordings. In this paper, we apply this approach to referential iEEG recorded from human subjects and directly investigate the contribution of recording reference on correlation, phase synchrony, and MSC. The experimental results demonstrate the significant impact that the recording reference may have on these bivariate measures.", "paper_title": "On the Recording Reference Contribution to EEG Correlation, Phase Synchorony, and Coherence", "paper_id": "WOS:000283292800015"}