{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "small_displacement_method"}, {"score": 0.04015076015860894, "phrase": "dynamical_matrix"}, {"score": 0.030653679275563665, "phrase": "brillouin_zone"}, {"score": 0.02770079090568154, "phrase": "force_constant_matrix"}, {"score": 0.015510536250513648, "phrase": "phonon_frequencies"}, {"score": 0.013685772808415717, "phrase": "density_functional_theory"}, {"score": 0.011578367259039959, "phrase": "distributed_program"}, {"score": 0.011526568058425559, "phrase": "test_data"}, {"score": 0.009292181276031864, "phrase": "primitive_cell"}, {"score": 0.004786055025036706, "phrase": "phon"}, {"score": 0.004764496736345002, "phrase": "constant_matrices"}, {"score": 0.004651140981383042, "phrase": "helmholtz_free_energy"}, {"score": 0.004609328120061174, "phrase": "specific_heat"}, {"score": 0.004588562209109672, "phrase": "internal_energy"}, {"score": 0.004567889423261406, "phrase": "harmonic_crystal"}, {"score": 0.004266451973459988, "phrase": "al"}, {"score": 0.004243075627558497, "phrase": "mgo."}, {"score": 0.004110993414942228, "phrase": "linear_response_method"}, {"score": 0.0040495494327229325, "phrase": "accurate_phonon_frequencies"}, {"score": 0.003965061486705487, "phrase": "longitudinal_branch"}, {"score": 0.003947186611084043, "phrase": "optical_phonons"}, {"score": 0.003841610436545169, "phrase": "non-analytical_part"}, {"score": 0.003784177423731249, "phrase": "thermodynamic_properties"}, {"score": 0.0037671966714416926, "phrase": "helmholtz"}, {"score": 0.0037230324630738447, "phrase": "program"}, {"score": 0.0037052054802048707, "phrase": "phon_catalogue"}, {"score": 0.003638823482920949, "phrase": "cpc_program_library"}, {"score": 0.0036278755993336157, "phrase": "queen's_university"}, {"score": 0.003616960803263458, "phrase": "belfast"}, {"score": 0.0036060781902674207, "phrase": "n._ireland"}, {"score": 0.0035844112756951434, "phrase": "standard_cpc"}, {"score": 0.0033494557005894657, "phrase": "linux"}, {"score": 0.0033042949580762383, "phrase": "super-cell_size"}, {"score": 0.003264715036217617, "phrase": "external"}, {"score": 0.0032207101677425264, "phrase": "blas."}, {"score": 0.003153459288090906, "phrase": "quantum-espresso_package"}, {"score": 0.0030969315794080626, "phrase": "stable_crystals"}, {"score": 0.003087608997282045, "phrase": "low_temperature"}, {"score": 0.0030505976034245234, "phrase": "potential_energy"}, {"score": 0.003036832649117453, "phrase": "atomic_equilibrium_positions"}, {"score": 0.0029734104823669234, "phrase": "harmonic_theory"}, {"score": 0.0029466354447685067, "phrase": "global_vibrations"}, {"score": 0.0027741761880779535, "phrase": "arbitrary_choice"}, {"score": 0.002745047827430125, "phrase": "solution_method"}, {"score": 0.002679608951410419, "phrase": "small_amount"}, {"score": 0.002522738549524317, "phrase": "negligibly_small_values"}, {"score": 0.0024737547360893764, "phrase": "chosen_q-vector"}, {"score": 0.0024038646548022475, "phrase": "phon_code"}, {"score": 0.0023966233715536013, "phrase": "external_programs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Harmonic approximation", " Phonons", " Free energies", " Direct method", " Small displacement"], "paper_abstract": "The program PHON calculates force constant matrices and phonon frequencies in crystals. From the frequencies it also calculates various thermodynamic quantities, like the Helmholtz free energy, the entropy, the specific heat and the internal energy of the harmonic crystal. The procedure is based on the small displacement method, and can be used in combination with any program capable to calculate forces on the atoms of the crystal. In order to examine the usability of the method, I present here two examples: metallic Al and insulating MgO. The phonons of these two materials are calculated using density functional theory. The small displacement method results are compared with those obtained using the linear response method. In the case of Al the method provides accurate phonon frequencies everywhere in the Brillouin Zone (BZ). In the case of MgO the longitudinal branch of the optical phonons near the centre of the BZ is incorrectly described as degenerate with the two transverse branches, because the non-analytical part of the dynamical matrix is ignored here; however. thermodynamic properties like the Helmholtz free are essentially unaffected. Program summary Program title: PHON Catalogue identifier. AEDP_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/sumniaries/AEDP_v1_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.html No. of lines in distributed program, including test data, etc.: 19 580 No. of bytes in distributed program, including test data, etc.: 612 193 Distribution format: tar.gz Programming language: Fortran 90 Computer: Any Unix, Linux Operating system: Unix RAM: Depends on super-cell size, but usually negligible Classification: 7.8 External routines: Subprograms ZHEEV and DSYEV (Lapack); needs BLAS. A tutorial is provided with the distribution which requires the installation of the quantum-espresso package (http://www. quantum-espresso.org) Nature of problem: Stable crystals at low temperature can be well described by expanding the potential energy around the atomic equilibrium positions. The movements of the atoms around their equilibrium positions can then be described using harmonic theory, and is characterised by global vibrations called phonons, which can be identified by vectors in the Brillouin zone of the crystal, and there are 3 phonon branches for each atom in the primitive cell. Tile problem is to calculate the frequencies of these phonons for any arbitrary choice of q-vector in the Brillouin zone. Solution method: The small displacement method: each atom in the primitive cell is displaced by a small amount, and the forces induced on all the other atoms in the crystal are calculated and used to construct the force constant matrix. Supercells of -100 atoms are usually large enough to describe the force constant matrix up to the range where its elements have fallen to negligibly small values. The force constant matrix is then used to compute the dynamical matrix at any chosen q-vector in the Brillouin zone, and the diagonalisation of the dynamical matrix provides the squares of the phonon frequencies. The PHON code needs external programs to calculate these forces, and it can be used with any program capable of calculating forces in crystals. The most useful applications are obtained with codes based on density functional theory, but there is no restriction on what can be used. Running time: Negligible, typically a few seconds (or at most a few minutes) on a PC. It can take longer if very dense meshes of q-points are needed, for example, to compute very accurate phonon density of states. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "PHON: A program to calculate phonons using the small displacement method", "paper_id": "WOS:000273011500019"}