{"auto_keywords": [{"score": 0.03987141669394698, "phrase": "cluster_class"}, {"score": 0.02798396834120986, "phrase": "computation_paths"}, {"score": 0.00481495049065317, "phrase": "edge_recognition"}, {"score": 0.004766877640444116, "phrase": "complexity_theory"}, {"score": 0.0047035227618053965, "phrase": "path-cardinality-based_restrictions"}, {"score": 0.004086853315059217, "phrase": "simple_order"}, {"score": 0.0038478705530517296, "phrase": "definition_changes"}, {"score": 0.003647156095687574, "phrase": "balanced_turing_machine"}, {"score": 0.0035270425911920595, "phrase": "length-respecting_total_order"}, {"score": 0.003343007152920687, "phrase": "paper's_focus"}, {"score": 0.0030744279865523036, "phrase": "cluster_computing"}, {"score": 0.002855934865505357, "phrase": "new_robustness_results"}, {"score": 0.0027525658515943985, "phrase": "closure_properties"}, {"score": 0.00265292826903791, "phrase": "ordered_collection"}, {"score": 0.0024396547357855777, "phrase": "unique_discovery"}, {"score": 0.0023830645437709604, "phrase": "nondeterministic_functions"}, {"score": 0.0022061853706148945, "phrase": "critical_piece"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "Though complexity theory already extensively studies path-cardinality-based restrictions on the power of nondeterminism, this paper is motivated by a more recent goal: To gain insight into how much of a restriction, it is of nondeterminism to limit machines to have just one contiguous (with respect to some simple order) interval of accepting paths. In particular, we study the robustness-the invariance under definition changes-of the cluster class CL#P. This class contains each #P function that is computed by a balanced Turing machine whose accepting paths always form a cluster with respect to some length-respecting total order with efficient adjacency checks. The definition of CL#P is heavily influenced by the defining paper's focus on (global) orders. In contrast, we define a cluster class, CLU#P, to capture what seems to us a more natural model of cluster computing. We prove that the naturalness is costless: CL#P = CLU#P. Then we exploit the more natural, flexible features of CLU#P to prove new robustness results for CL#P and to expand what is known about the closure properties of CL#P. The complexity of recognizing edges-of an ordered collection of computation paths or of a cluster of accepting computation paths-is central to this study. Most particularly, our proofs exploit the power of unique discovery of edges-the ability of nondeterministic functions to, in certain settings, discover on exactly one (in some cases, on at most one) computation path a critical piece of information regarding edges of orderings or clusters. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Cluster computing and the power of edge recognition", "paper_id": "WOS:000248671000008"}