{"auto_keywords": [{"score": 0.047911478814939235, "phrase": "spin_chains"}, {"score": 0.00481495049065317, "phrase": "quantum_state_transfer"}, {"score": 0.004780780407878596, "phrase": "disordered_spin_chains"}, {"score": 0.004629977311316031, "phrase": "quantum_states"}, {"score": 0.004548253531664032, "phrase": "important_element"}, {"score": 0.004467965784278827, "phrase": "quantum_information_technologies"}, {"score": 0.004326987090971404, "phrase": "main_objectives"}, {"score": 0.004029359223675788, "phrase": "manufacturing_process"}, {"score": 0.0036596534390380287, "phrase": "system_parameters"}, {"score": 0.0035567476133074533, "phrase": "systematic_study"}, {"score": 0.0032533888943254144, "phrase": "bulk_coupling"}, {"score": 0.003105979498529766, "phrase": "specific_value"}, {"score": 0.002861302930564756, "phrase": "large_difference"}, {"score": 0.002830839166653185, "phrase": "engineering_effort"}, {"score": 0.002635850034826311, "phrase": "detailed_study"}, {"score": 0.0026077803487003, "phrase": "transfer_fidelity"}, {"score": 0.002561658528837694, "phrase": "chain_length"}, {"score": 0.0025434384320561403, "phrase": "disorder_strength"}, {"score": 0.002516350372379076, "phrase": "empirical_scaling_laws"}, {"score": 0.0023936956017015696, "phrase": "disorder_models"}, {"score": 0.0023180144105895257, "phrase": "optimal_spin_chain"}], "paper_keywords": ["quantum channels", " spin dynamics", " perfect state transfer", " quantum information", " decoherence", " mesocopic echoes"], "paper_abstract": "The transmission of quantum states through spin chains is an important element in the implementation of quantum information technologies. Speed and fidelity of transfer are the main objectives which have to be achieved by the devices even in the presence of imperfections which are unavoidable in any manufacturing process. To reach these goals, several kinds of spin chains have been suggested, which differ in the degree of fine-tuning, or engineering, of the system parameters. In this work we present a systematic study of two important classes of such chains. In one class only the spin couplings at the ends of the chain have to be adjusted to a value different from the bulk coupling constant, while in the other class every coupling has to have a specific value. We demonstrate that configurations from the two different classes may perform similarly when subjected to the same kind of disorder in spite of the large difference in the engineering effort necessary to prepare the system. We identify the system features responsible for these similarities and we perform a detailed study of the transfer fidelity as a function of chain length and disorder strength, yielding empirical scaling laws for the fidelity which are similar for all kinds of chain and all disorder models. These results are helpful in identifying the optimal spin chain for a given quantum information transfer task. In particular, they help in judging whether it is worthwhile to engineer all couplings in the chain as compared to adjusting only the boundary couplings.", "paper_title": "QUANTUM STATE TRANSFER IN DISORDERED SPIN CHAINS: HOW MUCH ENGINEERING IS REASONABLE?", "paper_id": "WOS:000358188700004"}