{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "personalized_exchange"}, {"score": 0.008918628520836965, "phrase": "yang"}, {"score": 0.008841018905668411, "phrase": "wang"}, {"score": 0.007557280427583091, "phrase": "massini"}, {"score": 0.006544258827021576, "phrase": "network_topologies"}, {"score": 0.006237518193103086, "phrase": "latin_square"}, {"score": 0.005330126184216194, "phrase": "massini's_algorithm"}, {"score": 0.004773040022691547, "phrase": "d-nary_banyan_multistage_interconnection_networks"}, {"score": 0.004529093447865156, "phrase": "parallel_processing"}, {"score": 0.003752550907120244, "phrase": "optimal_all-to-all_personalized_exchange_algorithm"}, {"score": 0.0026436755508085223, "phrase": "new_optimal_algorithm"}, {"score": 0.002486402077525374, "phrase": "memory_allocation"}], "paper_keywords": ["multistage interconnection network", " banyan network", " all-to-all communication", " all-to-all personalized exchange", " latin square"], "paper_abstract": "All-to-all personalized exchange occurs in many important applications in parallel processing. In the past two decades, algorithms for all-to-all personalized exchange were mainly proposed for hypercubes, meshes, and tori. Recently, Yang and Wang (IEEE Trans Parallel Distrib Syst 11:261-274, 2000) proposed an optimal all-to-all personalized exchange algorithm for binary (each switch is of size 2x2) banyan multistage interconnection networks. It was pointed out in Massini (Discret Appl Math 128:435-446, 2003) that the algorithm in Yang, Wang (IEEE Trans Parallel Distrib Syst 11:261-274, 2000) depends on the network topologies and requires pre-computation and memory allocation for a Latin square. Thus in (Discret Appl Math 128:435-446, 2003), Massini proposed a new optimal algorithm, which is independent of the network topologies and does not require pre-computation or memory allocation for a Latin square. Unfortunately, Massini's algorithm has a flaw and does not realize all-to-all personalized exchange. In this paper, we will correct the flaw and generalize Massini's algorithm to be applicable to d-nary (each switch is of size dxd) banyan multistage interconnection networks.", "paper_title": "Optimal all-to-all personalized exchange in d-nary banyan multistage interconnection networks", "paper_id": "WOS:000248864800004"}