{"auto_keywords": [{"score": 0.04469971468335376, "phrase": "online_business_transactions"}, {"score": 0.00481495049065317, "phrase": "neighbor_similarity_trust"}, {"score": 0.004420472010542188, "phrase": "attractive_option"}, {"score": 0.0042354707960660706, "phrase": "personal_information_provisioning"}, {"score": 0.0038515000499988673, "phrase": "credit_card_fraud"}, {"score": 0.003815064377019477, "phrase": "identity_theft"}, {"score": 0.0035864603175592854, "phrase": "low_trust"}, {"score": 0.0035189057079817285, "phrase": "online_transactions"}, {"score": 0.00332375606483146, "phrase": "peer_communities"}, {"score": 0.00258307991054107, "phrase": "group_leaders"}, {"score": 0.0024397017438101726, "phrase": "existing_work"}, {"score": 0.0023485549678832628, "phrase": "common_neighbors"}, {"score": 0.0021557052355026048, "phrase": "malicious_attacks"}, {"score": 0.0021049977753042253, "phrase": "existing_models"}], "paper_keywords": ["P2P", " Group", " Similarity", " E-commerce", " Interest", " Neighbor", " Trust value"], "paper_abstract": "The simplicity with which products and prices are compared in e-commerce has introduced an attractive option for many online merchants. The completion of online business transactions with personal information provisioning has always been an act that beckons hesitation. Most online traders are highly conscious of various threats and attacks such as credit card fraud, identity theft, spoofing, hacking, phishing, and other abuses, leading to low trust in online business transactions. Online transactions take place among Peer-to-Peer (P2P) systems at the edge of the Internet. Peer communities are often established dynamically with peers that are unrelated and unknown to each other. In our proposed mechanism, peers form groups in order to ensure trust and security. Each group is established based on interest among peers. In this paper, we show how peers form groups, and select group leaders. A peer can belong to more than one group. Comparing with some existing work, our work reveals that peers can have common neighbors which have a similarity based on their interest. Our simulation results show that the model can deal with the malicious attacks efficiently by comparison with existing models.", "paper_title": "Group formation with neighbor similarity trust in P2P E-commerce", "paper_id": "WOS:000339877700001"}