{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "inclusive_learning"}, {"score": 0.004404994123834589, "phrase": "innovative_challenge"}, {"score": 0.004330941610682453, "phrase": "teaching-learning_process"}, {"score": 0.004276216827737399, "phrase": "information_and_communication_technologies"}, {"score": 0.003995772867224968, "phrase": "users'_needs"}, {"score": 0.00378145978325955, "phrase": "online_teaching-learning_process"}, {"score": 0.003578600071301459, "phrase": "course_management_system_users"}, {"score": 0.0033865859510157238, "phrase": "b-learning_process"}, {"score": 0.003150900886669123, "phrase": "systematic_content_analysis"}, {"score": 0.0030847461428168614, "phrase": "multivariate_analysis"}, {"score": 0.002380934815435267, "phrase": "academic_community"}, {"score": 0.0023708445073819277, "phrase": "specific_needs"}, {"score": 0.0021049977753042253, "phrase": "learning_environment"}], "paper_keywords": ["online teaching-learning process", " Course Management System (CMS)", " users' profiles", " accessibility", " blended/inclusive learning", " holistic Information and Communication Technologies (ICTs) knowledge", " higher education"], "paper_abstract": "The use of technology can be seen as an innovative challenge to restructure the teaching-learning process and integrate Information and Communication Technologies (ICTs) in independent, collaborative and interactive work. The main purposes of this study are to understand users' needs and to identify their profiles, in order to empower the quality of online teaching-learning process. Identifying teachers' and students' profiles and their needs as Course Management System users, in particular, is necessary to guarantee the quality of a b-learning process, with a more comprehensive face, towards inclusive learning. Sixty-eight (68) face-to-face interviews were conducted and validated, and a systematic content analysis was merged with a multivariate analysis. The results reveal four profiles of teachers, i.e., activities-oriented, interaction-oriented, assessment-oriented, and collaboration-oriented, and three profiles of students, i.e., interactive learning environment-oriented, training-oriented, teachers' beliefs-oriented. In terms of recognizing, understanding and responding to the academic community specific needs, this study can support an inclusive, multi-dimensional and holistic ICT knowledge for choosing adjustable teaching-learning strategies that could be applied into the enhancement of accessibility and info-inclusion into the learning environment.", "paper_title": "From Blended to Inclusive Learning: Accessibility, Profiles, Openness, and Higher Education", "paper_id": "WOS:000332694300006"}