{"auto_keywords": [{"score": 0.03030521684841829, "phrase": "user_engagement"}, {"score": 0.00481495049065317, "phrase": "task-related_interface_characters"}, {"score": 0.004763565662615503, "phrase": "human-like_characters"}, {"score": 0.004612662942073808, "phrase": "social_responses"}, {"score": 0.004165497627464024, "phrase": "interface_characters"}, {"score": 0.0039055990919333082, "phrase": "integrative_framework"}, {"score": 0.003470358620464986, "phrase": "important_part"}, {"score": 0.0033602844686125375, "phrase": "experimental_design"}, {"score": 0.0031845067058084583, "phrase": "informative_virtual_reality_demonstration"}, {"score": 0.0027841357057119317, "phrase": "persona_effects"}, {"score": 0.002695768552609587, "phrase": "interface_character"}, {"score": 0.0025409639091476363, "phrase": "perceived_aesthetics"}, {"score": 0.0021049977753042253, "phrase": "user_satisfaction"}], "paper_keywords": ["human-computer interaction", " media entertainment", " empirical study", " interface characters", " I-PEFiC model", " persona effect", " character realism", " engagement"], "paper_abstract": "Human-like characters in the interface may evoke social responses in users, and literature suggests that realism is the most important factor herein. However, the effects of interface characters on the user are not well understood. We developed an integrative framework, called I-PEFiC, to explain 'persona' and realism effects on the user. We tested an important part of the model using an experimental design in which 140 middle school students were class-wise shown an informative virtual reality demonstration that incorporated either a realistic or an unrealistic (fantasy) interface character, or no character. Findings show, first, no persona effect on task performance. We discuss how user engagement might be related to persona effects. Second, designed realism of the interface character contributed to user engagement when controlled for various user perceptions. Moreover, perceived aesthetics and task-relevance further influenced user engagement. Third, user engagement and task performance combined better predicted satisfaction than either one of the factors alone. In sum, several appearance- and task-related factors contributed to user engagement and user satisfaction. Thus, realism is not all. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Realism is not all! User engagement with task-related interface characters", "paper_id": "WOS:000244575900012"}