{"auto_keywords": [{"score": 0.04961416596354645, "phrase": "strategy_parameters"}, {"score": 0.014365338868325167, "phrase": "ep"}, {"score": 0.008713768692145006, "phrase": "classical_evolutionary_programming"}, {"score": 0.00830035163588413, "phrase": "evolutionary_programming"}, {"score": 0.008114138352696483, "phrase": "optimum_point"}, {"score": 0.006832448522466455, "phrase": "heritage_information"}, {"score": 0.0042550030421781605, "phrase": "global_minimum"}, {"score": 0.00419997182602686, "phrase": "multimodal_functions"}, {"score": 0.003960972732123083, "phrase": "new_attributes"}, {"score": 0.0036276389022283427, "phrase": "variable_vectors"}, {"score": 0.003465957803362915, "phrase": "large_value"}, {"score": 0.003398883295962739, "phrase": "related_variable_causes"}, {"score": 0.003257960296952439, "phrase": "large_steps"}, {"score": 0.0030924870122337905, "phrase": "considerable_changes"}, {"score": 0.0027862576750944277, "phrase": "new_method"}, {"score": 0.002585016334273749, "phrase": "rotational_method"}, {"score": 0.002559859451119449, "phrase": "large_and_small_changes"}, {"score": 0.0024696889464469805, "phrase": "mutation_operator"}, {"score": 0.0021676977432828373, "phrase": "fifty_well-known_test_functions"}, {"score": 0.0021049977753042253, "phrase": "nine_well-known_ep_variants"}], "paper_keywords": ["Evolutionary programming", " Shifting operator", " Strategy parameters", " Step size", " Fixed and adaptive lower bound strategy parameter"], "paper_abstract": "Many methods have been recently suggested for promoting the performance of Evolutionary Programming (EP) in finding the optimum point of functions or applications. EP has some shortcomings that slow down its convergence to the global minimum, especially for multimodal functions. As it is known, mutation is one of the most important operators in EP, which produces new attributes in variables. Mutation must be kept under control; otherwise, it destroys heritage information. In EP, mutation is implemented by adding strategy parameters to variable vectors of parents to produce offspring. When one of the strategy parameters is a large value, adding it to the related variable causes abrupt changes in that variable. Thus, the variable grows with large steps and deviates far from the optimum point, whereas some of the other variables do not sense considerable changes. If this event continues for more iterations, the variable will go further. This event slows down EP in some iterations. To avoid such an occurrence, this paper introduces a new method that can overcome these disadvantages and enhance the performance of classical evolutionary programming. This paper describes a modification of evolutionary programming by using a rotational method to prevent large and small changes to the strategy parameters. This method adds one function to the mutation operator. This function operates on strategy parameters and changes the sequence of these parameters. Because this method does not directly operate on variables, it will not destroy the heritage information of the parents. This method was tested on fifty well-known test functions used in the literature and was compared with nine well-known EP variants. The results are robust and demonstrate the efficiency of the technique.", "paper_title": "A modification to classical evolutionary programming by shifting strategy parameters", "paper_id": "WOS:000314286500004"}