{"auto_keywords": [{"score": 0.04574007889452913, "phrase": "time_series"}, {"score": 0.007252285349964636, "phrase": "dynamic_behaviour"}, {"score": 0.00481495049065317, "phrase": "traditional_approaches"}, {"score": 0.004449452743965974, "phrase": "fixed_underlying_structure"}, {"score": 0.0030772505522663612, "phrase": "traditional_clustering_approaches"}, {"score": 0.0029501745152877706, "phrase": "underlying_structure"}, {"score": 0.002613239644974825, "phrase": "fuzzy_approach"}, {"score": 0.0025318431634446426, "phrase": "fuzzy_clustering_approach"}, {"score": 0.0024789887640568093, "phrase": "autocorrelation_functions"}, {"score": 0.0021957487795963666, "phrase": "different_clusters"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Time series", " Switching time series", " Autocorrelation function", " Crisp C-means clustering", " Fuzzy C-means clustering"], "paper_abstract": "The traditional approaches to clustering a set of time series are generally applicable if there is a fixed underlying structure to the time series so that each will belong to one cluster or the other. However, time series often display dynamic behaviour in their evolution over time. This dynamic behaviour should be taken into account when attempting to cluster time series. For instance, during a certain period, a time series might belong to a certain cluster; afterwards its dynamics might be closer to that of another cluster. In this case, the traditional clustering approaches are unlikely to find and represent the underlying structure in the given time series. This switch from one time state to another, which is typically vague, can be naturally treated following a fuzzy approach. This paper proposes a fuzzy clustering approach based on the autocorrelation functions of time series, in which each time series is not assigned exclusively to only one cluster, but it is allowed to belong to different clusters with various membership degrees. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Autocorrelation-based fuzzy clustering of time series", "paper_id": "WOS:000272874100007"}