{"auto_keywords": [{"score": 0.0034244153725855, "phrase": "catalytic_characteristics"}, {"score": 0.0027976491158911514, "phrase": "wild-type_alpha-cgtase"}, {"score": 0.0027278178983579085, "phrase": "alpha-cd-based_k-m_values"}, {"score": 0.0025933275734892508, "phrase": "gamma-cd-based_k-m_values"}, {"score": 0.002449915958738505, "phrase": "dynamic_trajectories"}, {"score": 0.0024038923350585962, "phrase": "substrate_oligosaccharide_chain"}, {"score": 0.0023587312574818208, "phrase": "mutant_cgtase_binding_site"}, {"score": 0.0022423971916457662, "phrase": "wild-type_enzyme"}, {"score": 0.0022002633747977593, "phrase": "reduced_hydrophobic_interaction"}, {"score": 0.0021317885325570604, "phrase": "different_product_specificity"}], "paper_keywords": ["Cyclodextrin glucanotransferases", " Y195I alpha-CGTase", " alpha-CD", " gamma-CD", " Molecular dynamic simulation"], "paper_abstract": "Alpha-cyclodextrin (alpha-CD) glycosyltransferase (alpha-CGTase) can convert starch into alpha-CD blended with various proportions of beta-cyclodextrin (beta-CD) and/or gamma-cyclodextrin (gamma-CD). In this study, we verified the catalytic characteristics of purified Y195I alpha-CGTase and elucidated the mechanism of action with molecular dynamic (MD) simulations. We found that purified Y195I alpha-CGTase produced less alpha-CD, slightly more beta-CD, and significantly more gamma-CD than wild-type alpha-CGTase. Correspondingly, alpha-CD-based K-m values increased, and beta-CD- and gamma-CD-based K-m values decreased. MD simulation studies revealed that the dynamic trajectories of the substrate oligosaccharide chain in the mutant CGTase binding site were significantly different from those in the wild-type enzyme, with reduced hydrophobic interaction, finally resulting in different product specificity and more gamma-CD formation.", "paper_title": "Molecular dynamic analysis of mutant Y195I alpha-cyclodextrin glycosyltransferase with switched product specificity from alpha-cyclodextrin to gamma-cyclodextrin", "paper_id": "WOS:000359539700027"}