{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "epitope_residues"}, {"score": 0.004654826737377134, "phrase": "different_antibody"}, {"score": 0.004587835274176236, "phrase": "coarse_binary_classification"}, {"score": 0.004543708337879809, "phrase": "antigen_regions"}, {"score": 0.004246428036409373, "phrase": "biological_reality"}, {"score": 0.0041051328120736575, "phrase": "antibody-specified_epitope_prediction_problem"}, {"score": 0.0037267132967205136, "phrase": "antigenic_residues"}, {"score": 0.0035679633126097115, "phrase": "specific_antibody"}, {"score": 0.0034159525504642656, "phrase": "contextual_awareness"}, {"score": 0.0031614748814351823, "phrase": "contact_residue_pairs"}, {"score": 0.0030858947334838145, "phrase": "bridging_role"}, {"score": 0.0030267296900520217, "phrase": "paratope_and_epitope_residues"}, {"score": 0.0027341763737751467, "phrase": "markov_properties"}, {"score": 0.0026175952455594277, "phrase": "nonredundant_data"}, {"score": 0.002387507583705495, "phrase": "good_performance"}, {"score": 0.0023644936731468252, "phrase": "antibody-specified_epitope_prediction"}, {"score": 0.002319127685733821, "phrase": "traditional_antibody-ignored_epitope_prediction_problem"}], "paper_keywords": ["Epitope prediction", " context dependence", " antibody", " antigen"], "paper_abstract": "Context-awareness is a characteristic in the recognition between antigens and antibodies, highlighting the reconfiguration of epitope residues when an antigen interacts with a different antibody. A coarse binary classification of antigen regions into epitopes, or nonepitopes without specifying antibodies may not accurately reflect this biological reality. Therefore, we study an antibody-specified epitope prediction problem in line with this principle. This problem is new and challenging as we pinpoint a subset of the antigenic residues from an antigen when it binds to a specific antibody. We introduce two kinds of associations of the contextual awareness: 1) residues-residues pairing preference, and 2) the dependence between sets of contact residue pairs. Preference plays a bridging role to link interacting paratope and epitope residues while dependence is used to extend the association from one-dimension to two-dimension. The paratope/epitope residues' relative composition, cooperativity ratios, and Markov properties are also utilized to enhance our method. A nonredundant data set containing 80 antibody-antigen complexes is compiled and used in the evaluation. The results show that our method yields a good performance on antibody-specified epitope prediction. On the traditional antibody-ignored epitope prediction problem, a simplified version of our method can produce a competitive, sometimes much better, performance in comparison with three structure-based predictors.", "paper_title": "Antibody-Specified B-Cell Epitope Prediction in Line with the Principle of Context-Awareness", "paper_id": "WOS:000294782100004"}