{"auto_keywords": [{"score": 0.03893650791256922, "phrase": "mu_payments"}, {"score": 0.03756886888135808, "phrase": "mu"}, {"score": 0.00481495049065317, "phrase": "meaningful_use"}, {"score": 0.004673079747693193, "phrase": "centers_for_medicare_and_medicaid_services"}, {"score": 0.004451360793577698, "phrase": "federal_electronic_health_record"}, {"score": 0.0040997480534580065, "phrase": "programme's_first_year"}, {"score": 0.003876010646939676, "phrase": "cross-sectional_study"}, {"score": 0.003775803846431323, "phrase": "medicare_and_medicaid_services_data"}, {"score": 0.0036781781340563748, "phrase": "multivariate_regression_analysis"}, {"score": 0.003226513431715486, "phrase": "study_sample"}, {"score": 0.0030502854924662837, "phrase": "standard_hospital_characteristics"}, {"score": 0.002982511360424684, "phrase": "computerized_provider_order_entry"}, {"score": 0.0028944757265206332, "phrase": "primary_challenge"}, {"score": 0.0027261023678401696, "phrase": "primary_challenges"}, {"score": 0.0027057544777834086, "phrase": "discussion_cpoe"}, {"score": 0.002675516297446243, "phrase": "main_challenge"}, {"score": 0.0024916819803100635, "phrase": "incentive_programme's_effectiveness"}, {"score": 0.002454615536099159, "phrase": "healthcare_organizations"}, {"score": 0.002427177130359851, "phrase": "ehr_vendors"}, {"score": 0.002391067964886602, "phrase": "increased_attention"}, {"score": 0.002373214852820709, "phrase": "hospitals'_challenges"}, {"score": 0.0023554947277883535, "phrase": "cpoe._conclusion"}, {"score": 0.0023291617361832157, "phrase": "ehr_incentive_programme_matures"}, {"score": 0.002235095576913577, "phrase": "critical_elements"}], "paper_keywords": [""], "paper_abstract": "Objective In an effort to understand better the federal electronic health record (EHR) incentive programme's challenges, this study compared hospitals that did and did not receive meaningful use (MU) payments in the programme's first year based on the challenges they anticipated a year before. Materials and Methods This cross-sectional study used 2010 American Hospital Association survey data and 2011 Centers for Medicare and Medicaid Services data that identify hospitals receiving MU payments. Multivariate regression analysis assessed differences in 2010 anticipated challenges to MU for hospitals that were successful in earning 2011 MU payment compared to hospitals that intended to participate in the programme but were not yet successful. Results The study sample consisted of 2475 hospitals, 313 of which received MU payments in 2011. Controlling for standard hospital characteristics, hospitals that reported the computerized provider order entry (CPOE) MU criterion as a primary challenge were 18% less likely to receive a 2011 MU payment compared to hospitals that reported other criteria as primary challenges. Discussion CPOE was the main challenge among hospitals that failed to achieve MU in the first year of the programme. In order to maximize the incentive programme's effectiveness, policymakers, healthcare organizations, and EHR vendors may benefit from increased attention to hospitals' challenges with CPOE. Conclusion As the EHR incentive programme matures, policymakers and other stakeholders should consider strategies that maintain the critical elements of MU while adequately supporting hospitals that desire to become MU but are impeded by specific technological, cultural, and organizational adoption and use challenges.", "paper_title": "Overcoming challenges to achieving meaningful use: insights from hospitals that successfully received Centers for Medicare and Medicaid Services payments in 2011", "paper_id": "WOS:000314875100005"}