{"auto_keywords": [{"score": 0.03274021863411846, "phrase": "k-shortest_path_privacy"}, {"score": 0.015719716506582538, "phrase": "shortest_paths"}, {"score": 0.008294908304247362, "phrase": "proposed_algorithms"}, {"score": 0.004766388573192505, "phrase": "information_breaches"}, {"score": 0.004718314112245913, "phrase": "social_networks"}, {"score": 0.004553822674247401, "phrase": "privacy_issues"}, {"score": 0.004073113268289532, "phrase": "sensitive_data"}, {"score": 0.0038131738052230254, "phrase": "anonymized_social_networks"}, {"score": 0.003717656912608012, "phrase": "unique_patterns"}, {"score": 0.0032415934630668484, "phrase": "sensitive_shortest_paths"}, {"score": 0.002928594036918225, "phrase": "destination_vertices"}, {"score": 0.002271725588755076, "phrase": "execution_times"}, {"score": 0.002248755794042486, "phrase": "information_losses"}, {"score": 0.00217017119491777, "phrase": "design_reference"}, {"score": 0.002148226022654619, "phrase": "shortest_path"}], "paper_keywords": ["Social networks", " Privacy preservation", " Shortest path", " Anonymity", " k-Shortest path privacy"], "paper_abstract": "Information breaches in social networks and other published data have caused many concerns of privacy issues in recent years. Since information in networks can be modeled as graphs, various techniques have been proposed to preserve privacy of sensitive data on directed/un-directed, weighted/un-weighted graphs. To preserve privacy on graphs, most works for publishing anonymized social networks have attempted to prevent unique patterns to be re-identified, such as, nodes, links, and sub-graphs. In this work, we study the problem of anonymizing sensitive shortest paths in graphs. We examine the concept of k-shortest path privacy, in which at least k indistinguishable shortest paths exist between specified sensitive source and destination vertices. Due to the overlaps of shortest paths, we propose three algorithms to modify three categories of edges to achieve the k-shortest path privacy. Numerical experiments showing the characteristics of the proposed algorithms are given. The results demonstrate that the proposed algorithms are all feasible to achieve k-shortest path privacy, with different degrees of execution times and information losses, and can be served as design reference for shortest path anonymization. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Edge types vs privacy in K-anonymization of shortest paths", "paper_id": "WOS:000352955600027"}