{"auto_keywords": [{"score": 0.04676138830146543, "phrase": "government_agencies"}, {"score": 0.00481495049065317, "phrase": "scientific_data"}, {"score": 0.0047787596516662, "phrase": "public_assets"}, {"score": 0.00463668357590034, "phrase": "full-time_government_employees"}, {"score": 0.004431501938755216, "phrase": "u.s."}, {"score": 0.004299621153829837, "phrase": "\"_government-generated_data"}, {"score": 0.004156012879026324, "phrase": "existing_government_data_sets"}, {"score": 0.004124754315882517, "phrase": "critical_data_sets"}, {"score": 0.0039124037252916055, "phrase": "government_data_sets"}, {"score": 0.0038247634489737142, "phrase": "policy_makers"}, {"score": 0.003440945901489461, "phrase": "structural_barriers"}, {"score": 0.0033765627434550432, "phrase": "technical_infrastructure"}, {"score": 0.0033385105985286154, "phrase": "issue_clusters"}, {"score": 0.0033008858616145205, "phrase": "administrative_programs"}, {"score": 0.003214730261140886, "phrase": "government_data"}, {"score": 0.0029249294679606656, "phrase": "large_number"}, {"score": 0.0027846824619356583, "phrase": "data_portals"}, {"score": 0.0027017308406240563, "phrase": "nontechnical_constraints"}, {"score": 0.002572158343938064, "phrase": "data_decisions"}, {"score": 0.0025335509856200433, "phrase": "data_documentation"}, {"score": 0.0021614767508781048, "phrase": "normative_decisions"}, {"score": 0.0021049977753042253, "phrase": "particular_data"}], "paper_keywords": [""], "paper_abstract": "This paper examines how scientists working in government agencies in the U.S. are reacting to the \"ethos of sharing\" government-generated data. For scientists to leverage the value of existing government data sets, critical data sets must be identified and made as widely available as possible. However, government data sets can only be leveraged when policy makers first assess the value of data, in much the same way they decide the value of grants for research outside government. We argue that legislators should also remove structural barriers to interoperability by funding technical infrastructure according to issue clusters rather than administrative programs. As developers attempt to make government data more accessible through portals, they should consider a range of other nontechnical constraints attached to the data. We find that agencies react to the large number of constraints by mostly posting their data on their own websites only rather than in data portals that can facilitate sharing. Despite the nontechnical constraints, we find that scientists working in government agencies exercise some autonomy in data decisions, such as data documentation, which determine whether or not the data can be widely shared. Fortunately, scientists indicate a willingness to share the data they collect or maintain. However, we argue further that a complete measure of access should also consider the normative decisions to collect ( or not) particular data.", "paper_title": "Managing Scientific Data as Public Assets: Data Sharing Practices and Policies Among Full-Time Government Employees", "paper_id": "WOS:000335581500003"}