{"auto_keywords": [{"score": 0.04743159713387278, "phrase": "project_participant"}, {"score": 0.041008471250697544, "phrase": "committer_status"}, {"score": 0.00476957387174325, "phrase": "productive_and_collaborative_team"}, {"score": 0.004338575266640439, "phrase": "one's_online_social_footprint"}, {"score": 0.004247075069089933, "phrase": "one's_technical_contributions"}, {"score": 0.004207027546363108, "phrase": "patch_submission_information"}, {"score": 0.004177238875974245, "phrase": "multiple_sources"}, {"score": 0.004157496545410353, "phrase": "different_formats"}, {"score": 0.004021877785031444, "phrase": "prior_work"}, {"score": 0.003993394845843522, "phrase": "patch_submission"}, {"score": 0.003937030300970066, "phrase": "essential_ingredient"}, {"score": 0.0037193868716533145, "phrase": "social_network_phenomenon"}, {"score": 0.0036151029239622485, "phrase": "social_measures"}, {"score": 0.0035894903821255698, "phrase": "communications_network"}, {"score": 0.0035725158840297275, "phrase": "oss_project_participants"}, {"score": 0.003530428755107654, "phrase": "technical_measures"}, {"score": 0.0032647792316543604, "phrase": "social_network_metrics"}, {"score": 0.0032110431978807385, "phrase": "two-way_communication"}, {"score": 0.003143247488707568, "phrase": "one's_likelihood"}, {"score": 0.002858788378807115, "phrase": "future_committers"}, {"score": 0.002818392856847883, "phrase": "great_fidelity"}, {"score": 0.002791779231329709, "phrase": "first_three_months"}, {"score": 0.0026624236602137627, "phrase": "data's_predictions"}, {"score": 0.002551123078520178, "phrase": "socialization_ramps"}, {"score": 0.002392814382568583, "phrase": "significant_number"}, {"score": 0.002331163403082255, "phrase": "notable_social_cooling-off_period"}, {"score": 0.0022389873283722743, "phrase": "projects_life_cycle"}, {"score": 0.002150448113659341, "phrase": "social_nature"}, {"score": 0.0021049977753042253, "phrase": "distributed_projects"}], "paper_keywords": ["Open source software", " Email social networks", " Logistic regression", " Developer initiation"], "paper_abstract": "Maintaining a productive and collaborative team of developers is essential to Open Source Software (OSS) success, and hinges upon the trust inherent among the team. Whether a project participant is initiated as a committer is a function of both his technical contributions and also his social interactions with other project participants. One's online social footprint is arguably easier to ascertain and gather than one's technical contributions e.g., gathering patch submission information requires mining multiple sources with different formats, and then merging the aliases from these sources. In contrast to prior work, where patch submission was found to be an essential ingredient to achieving committer status, here we investigate the extent to which the likelihood of achieving that status can be modeled solely as a social network phenomenon. For 6 different Apache Software Foundation OSS projects we compile and integrate a set of social measures of the communications network among OSS project participants and a set of technical measures, i.e., OSS developers' patch submission activities. We use these sets to predict whether a project participant will become a committer, and to characterize their socialization patterns around the time of becoming committer. We find that the social network metrics, in particular the amount of two-way communication a person participates in, are more significant predictors of one's likelihood to becoming a committer. Further, we find that this is true to the extent that other predictors, e.g., patch submission info, need not be included in the models. In addition, we show that future committers are easy to identify with great fidelity when using the first three months of data of their social activities. Moreover, only the first month of their social links are a very useful predictor, coming within 10 % of the three month data's predictions. Interestingly, we find that on average, for each project, one's level of socialization ramps up before the time of becoming a committer. After obtaining committer status, their social behavior is more individualized, falling into few distinct modes of behavior. In a significant number of projects, immediately after the initiation there is a notable social cooling-off period. Finally, we find that it is easier to become a committer earlier in the projects life cycle than it is later as the project matures. These results should provide insight on the social nature of gaining trust and advancing in status in distributed projects.", "paper_title": "Developer initiation and social interactions in OSS: A case study of the Apache Software Foundation", "paper_id": "WOS:000360671500005"}