{"auto_keywords": [{"score": 0.045216233583385064, "phrase": "closed_form"}, {"score": 0.04111781817374546, "phrase": "euclidean_space"}, {"score": 0.00481495049065317, "phrase": "rolling_to_generate"}, {"score": 0.004573748810476845, "phrase": "smooth_curve"}, {"score": 0.00443133501650381, "phrase": "n-dimensional_ellipsoid"}, {"score": 0.004143196873246147, "phrase": "rolling_and_wrapping_technique"}, {"score": 0.003966776222128288, "phrase": "general_manifold"}, {"score": 0.003522749900725601, "phrase": "basic_steps"}, {"score": 0.0030913302090179967, "phrase": "interpolation_problems"}, {"score": 0.0028446460307503343, "phrase": "explicit_forms"}, {"score": 0.0028222016727557087, "phrase": "euclidean_geodesics"}, {"score": 0.002701877448139625, "phrase": "major_obstacle"}, {"score": 0.0026594033724490172, "phrase": "rolling_part"}, {"score": 0.002418185868191525, "phrase": "appropriate_riemannian_metric"}, {"score": 0.0023427323356117365, "phrase": "explicit_form"}, {"score": 0.0022606512324475584, "phrase": "rolling_motion"}, {"score": 0.0021049977753042253, "phrase": "smooth_interpolating_curve"}], "paper_keywords": ["rolling", " group of isometries", " ellipsoid", " kinematic equations", " interpolation"], "paper_abstract": "We present an algorithm to generate a smooth curve interpolating a set of data on an n-dimensional ellipsoid, which is given in closed form. This is inspired by an algorithm based on a rolling and wrapping technique, described in [11] for data on a general manifold embedded in Euclidean space. Since the ellipsoid can be embedded in an Euclidean space, this algorithm can be implemented, at least theoretically. However, one of the basic steps of that algorithm consists in rolling the ellipsoid, over its affine tangent space at a point, along a curve. This would allow to project data from the ellipsoid to a space where interpolation problems can be easily solved. However, even if one chooses to roll along a geodesic, the fact that explicit forms for Euclidean geodesics on the ellipsoid are not known, would be a major obstacle to implement the rolling part of the algorithm. To overcome this problem and achieve our goal, we embed the ellipsoid and its affine tangent space in Rn+1 equipped with an appropriate Riemannian metric, so that geodesics are given in explicit form and, consequently, the kinematics of the rolling motion are easy to solve. By doing so, we can rewrite the algorithm to generate a smooth interpolating curve on the ellipsoid which is given in closed form.", "paper_title": "AN ALGORITHM BASED ON ROLLING TO GENERATE SMOOTH INTERPOLATING CURVES ON ELLIPSOIDS", "paper_id": "WOS:000345493300005"}