{"auto_keywords": [{"score": 0.043025239716159284, "phrase": "europe"}, {"score": 0.01143354428309065, "phrase": "european"}, {"score": 0.004724980378009193, "phrase": "small-to-medium_software_enterprise"}, {"score": 0.0045158206186680224, "phrase": "innovative_small-to-medium_software_enterprises"}, {"score": 0.004156012879026324, "phrase": "software_enterprises"}, {"score": 0.003971938976270902, "phrase": "dynamic_capability_theory"}, {"score": 0.0036969566358089644, "phrase": "capability_development"}, {"score": 0.0035599338383885447, "phrase": "overarching_theory"}, {"score": 0.0035331426502479687, "phrase": "dynamic_capabilities"}, {"score": 0.0034933321145368336, "phrase": "theoretical_model"}, {"score": 0.0033511469200347907, "phrase": "firm's_past_activities"}, {"score": 0.0029807267909921628, "phrase": "smse's_customers"}, {"score": 0.0028556532119368714, "phrase": "ireland"}, {"score": 0.0027559389391259743, "phrase": "smse"}, {"score": 0.0026014984513015368, "phrase": "firm's_products"}, {"score": 0.002364087101792446, "phrase": "dublin"}, {"score": 0.002340147988348115, "phrase": "primary_research_site"}, {"score": 0.002202742267484358, "phrase": "complex_and_under-researched_phenomenon"}, {"score": 0.0021049977753042253, "phrase": "innovative_software_solutions"}], "paper_keywords": ["dynamic capabilities", " resource-based view", " IS capabilities", " IS assets", " small-to-medium software enterprise"], "paper_abstract": "There is a dearth of research on the capabilities of innovative small-to-medium software enterprises (SMSEs). Understanding how SMSEs build and apply business and information systems (IS) capabilities is important, as such firms account for over 90% of software enterprises operating in Europe and the US. This paper elaborates and applies dynamic capability theory to explore and help understand the web of conditions and factors that shaped and influenced business and IS capability development and application in one European SMSE. Drawing on the overarching theory of dynamic capabilities, a theoretical model is presented that posits relationships among (1) a firm's past activities; (2) its integration, learning and reconfiguration, and transformation capabilities; (3) its financial, complementary, locational, and technological asset positions; and (4) the products and services that result, and which are of value to an SMSE's customers. The paper refines and elaborates the model by describing and enumerating the business and IS capabilities, assets, and products and services of the SMSE under study. To properly assess whether this firm's products and services were of value to its customers, research was also conducted at two customer sites in Ireland and the US, in addition to the investigation at the primary research site in Dublin. The study therefore informs both practitioners' and researchers' understandings of this complex and under-researched phenomenon: for practitioners, it highlights the characteristics required to build innovative software solutions; for researchers, it illustrates the patterns and regularities associated with the development and application of business and IS capabilities.", "paper_title": "An exploratory study on IS capabilities and assets in a small-to-medium software enterprise", "paper_id": "WOS:000262106400009"}