{"auto_keywords": [{"score": 0.04686092282175089, "phrase": "medical_residents"}, {"score": 0.00481495049065317, "phrase": "large_internal_medicine_residency_program"}, {"score": 0.0043147264956783565, "phrase": "useful_tool"}, {"score": 0.003908940988435398, "phrase": "institutional_knowledge"}, {"score": 0.0038804410204616954, "phrase": "reference_information"}, {"score": 0.00385214804128572, "phrase": "microsoft_share_point"}, {"score": 0.0037961770933599135, "phrase": "visit_data"}, {"score": 0.0036731870109004993, "phrase": "page_views"}, {"score": 0.0034264254358037653, "phrase": "results_users"}, {"score": 0.0030253688063143157, "phrase": "new_page_creations"}, {"score": 0.0029813748433158032, "phrase": "forty-eight_percent"}, {"score": 0.0025562434609873335, "phrase": "academic_year"}, {"score": 0.002482404507958289, "phrase": "useful_and_popular_tool"}, {"score": 0.002455266773537278, "phrase": "administrative_and_educational_content"}, {"score": 0.002323953608863511, "phrase": "smaller_educational_impact"}, {"score": 0.0022158306933307685, "phrase": "broad_buy-in"}, {"score": 0.0021439311243100913, "phrase": "feasible_and_useful_tool"}, {"score": 0.002120485727210402, "phrase": "information_retrieval"}, {"score": 0.0021049977753042253, "phrase": "house_officers"}], "paper_keywords": [""], "paper_abstract": "Objective To describe the creation and evaluate the use of a wiki by medical residents, and to determine if a wiki would be a useful tool for improving the experience, efficiency, and education of housestaff. Materials and methods In 2008, a team of medical residents built a wiki containing institutional knowledge and reference information using Microsoft Share Point. We tracked visit data for 3 years, and performed an audit of page views and updates in the second year. We evaluated the attitudes of medical residents toward the wiki using a survey. Results Users accessed the wiki 23218, 35094, and 40 545 times in each of three successive academic years from 2008 to 2011. In the year two audit, 85 users made a total of 1082 updates to 176 pages and of these, 91 were new page creations by 17 users. Forty-eight percent of residents edited a page. All housestaff felt the wiki improved their ability to complete tasks, and 90%, 89%, and 57% reported that the wiki improved their experience, efficiency, and education, respectively, when surveyed in academic year 2009-2010. Discussion A wiki is a useful and popular tool for organizing administrative and educational content for residents. Housestaff felt strongly that the wiki improved their workflow, but a smaller educational impact was observed. Nearly half of the housestaff edited the wiki, suggesting broad buy-in among the residents. Conclusion A wiki is a feasible and useful tool for improving information retrieval for house officers.", "paper_title": "Adoption of a wiki within a large internal medicine residency program: a 3-year experience", "paper_id": "WOS:000306024100023"}