{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "large-scale_time_series"}, {"score": 0.01049831138592189, "phrase": "fuzzy_granular_support_vector_machines"}, {"score": 0.004660453113061494, "phrase": "widespread_application"}, {"score": 0.004610058444728656, "phrase": "computer_and_communication_technologies"}, {"score": 0.004389912080394437, "phrase": "time-stamped_data"}, {"score": 0.003958937342925219, "phrase": "limited_time"}, {"score": 0.003916098498242888, "phrase": "limited_costs"}, {"score": 0.0034366728236876047, "phrase": "decision-making_problems"}, {"score": 0.003308195943172624, "phrase": "fast_interval_predictors"}, {"score": 0.0030989899982042236, "phrase": "six_information_granulation_methods"}, {"score": 0.002934764205541183, "phrase": "fgsvm_predictors"}, {"score": 0.002855934865505357, "phrase": "credible_changing_ranges"}, {"score": 0.0024386325347607674, "phrase": "proposed_granulation_methods"}, {"score": 0.002186849855560281, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Large-scale time series", " Interval prediction", " Fuzzy granular support vector machines", " Performance measure"], "paper_abstract": "With the widespread application of computer and communication technologies, more and more real-time systems are implemented whose large amounts of time-stamped data consequently require more efficient processing approaches. For large-scale time series, precise values are often hard or even impossible to predict in limited time at limited costs. Meanwhile, precision is not absolutely necessary for human to think and reason, so credible changing ranges of time series are satisfactory for some decision-making problems. This study aims to develop fast interval predictors for large-scale, nonlinear time series with noisy data using fuzzy granular support vector machines (FGSVMs). Six information granulation methods are proposed which can granulate large-scale time series into subseries. FGSVM predictors are developed to forecast credible changing ranges of large-scale time series. Five performance indicators are presented to measure the quality and efficiency of FGSVMs. Four time series are used to examine the effectiveness and efficiency of the proposed granulation methods and the developed FGSVMs, whose results show the effectiveness and advantages of FGSVMs for large-scale, nonlinear time series with noisy data. Crown Copyright (C) 2012 Published by Elsevier B. V. All rights reserved.", "paper_title": "Developing fast predictors for large-scale time series using fuzzy granular support vector machines", "paper_id": "WOS:000324030600020"}