{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rf_mems_multiport_switches"}, {"score": 0.0041773934798743405, "phrase": "redundancy-switch_matrix_applications"}, {"score": 0.004044645056447888, "phrase": "polymumps_process"}, {"score": 0.0038908817250961633, "phrase": "electrostatic_switches"}, {"score": 0.003742941972172613, "phrase": "extensive_loss"}, {"score": 0.0036710872046569532, "phrase": "silicon_substrate"}, {"score": 0.003486123304074186, "phrase": "alumina_substrate"}, {"score": 0.003441352119167824, "phrase": "flip_chip_technology"}, {"score": 0.002622947550220266, "phrase": "c-type_switch"}, {"score": 0.0025394700487126414, "phrase": "presented_measurements"}, {"score": 0.00244278788608393, "phrase": "insertion_loss"}, {"score": 0.0023650305205893353, "phrase": "return_loss"}, {"score": 0.0021049977753042253, "phrase": "frequency_band"}], "paper_keywords": [""], "paper_abstract": "In this paper, novel multiport RF microelectromechanical systems (MEMS) switches such as single-pole three-throw (SP3T) and C-type switches are investigated. These switches are good candidates for signal routing and redundancy-switch matrix applications. Initially, the PolyMUMPs process was used to fabricate the electrostatic switches. Then, to avoid extensive loss of the silicon substrate, the switches were assembled on an alumina substrate using flip chip technology. The SP3T switch is a compact (500 x 500 mu m(2)) coplanar series switch that maintains an isolation of 30 dB, a return loss of less than -20 dB, and an insertion loss of less than 0.5 dB up to 20 GHz. The C-type switch contains two different operational states. The presented measurements for each state show an insertion loss of less than 1 dB and a return loss of less than -15 dB for frequencies up to 15 GHz. The switch maintains an isolation greater than 20 dB throughout the frequency band of interest.", "paper_title": "Hybrid integration of RF MEMS multiport switches", "paper_id": "WOS:000237755700004"}