{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quantum_pushdown_automata"}, {"score": 0.04221552420026915, "phrase": "quantum_computation_models"}, {"score": 0.015552696685207148, "phrase": "classical_stack_operations"}, {"score": 0.015305436709209775, "phrase": "perfect-soundness_condition"}, {"score": 0.004586531354697466, "phrase": "quantum_computing"}, {"score": 0.004229556887896042, "phrase": "quantum_effects"}, {"score": 0.003900257249255497, "phrase": "quantum_finite_automata"}, {"score": 0.003775803846431323, "phrase": "quantum_pushdown_stack"}, {"score": 0.0032629585038738856, "phrase": "reversible_state_transitions"}, {"score": 0.002928399649340438, "phrase": "classical_devices"}, {"score": 0.002320449502337321, "phrase": "probabilistic_pushdown_automata"}, {"score": 0.002222102813520549, "phrase": "non-context-free_language"}, {"score": 0.0021049977753042253, "phrase": "perfect_soundness"}], "paper_keywords": ["quantum pushdown automota", " quantum computation model", " context-free-language"], "paper_abstract": "One important question for quantum computing is whether a computational,gap exists between models that are allowed to use quantum effects and models that are not. Several types of quantum computation models have been proposed, including quantum finite automata and quantum pushdown automata (with a quantum pushdown stack). It has been shown that some quantum computation models are more powerful than their classical counterparts and others are not since quantum computation models are required to obey such restrictions as reversible state transitions. In this paper, we investigate the power of quantum pushdown automata whose stacks are assumed to be implemented as classical devices, and show that they are strictly more powerful than their classical counterparts under the perfect-soundness condition, where perfect-soundness means that an automaton never accepts a word that is not in the language. That is, we show that our model can simulate any probabilistic pushdown automata and also show that there is a non-context-free language which quantum pushdown automata with classical stack operations can recognize with perfect soundness.", "paper_title": "Expressive power of quantum pushdown automata with classical stack operations under the perfect-soundness condition", "paper_id": "WOS:000236290400031"}