{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "medical_telecare_services"}, {"score": 0.043832044934933846, "phrase": "telecare_environment"}, {"score": 0.004549144357293899, "phrase": "challenging_issue"}, {"score": 0.004421770937919324, "phrase": "socio-technological_issues"}, {"score": 0.004106974681603632, "phrase": "potential_areas"}, {"score": 0.003718175518916747, "phrase": "leavitts_diamond"}, {"score": 0.0036139842783886205, "phrase": "telecare_environment_building_dimensions"}, {"score": 0.003216358543603351, "phrase": "core_element"}, {"score": 0.0029871209444889716, "phrase": "two-year_period"}, {"score": 0.0029449414017272656, "phrase": "enormous_amount"}, {"score": 0.0027741761880779535, "phrase": "onsite_observations"}, {"score": 0.0026810674110409596, "phrase": "six_guidelines"}, {"score": 0.002561752783323717, "phrase": "future_services'_design"}, {"score": 0.002426927110231489, "phrase": "accurate_telecare_services'_design"}, {"score": 0.002253826965566618, "phrase": "telecare_domains"}, {"score": 0.0022346638243276717, "phrase": "optimal_parameter_combination"}, {"score": 0.0021719531308160354, "phrase": "telecare_procedure"}, {"score": 0.002123051344001408, "phrase": "minimum_parameters"}, {"score": 0.0021049977753042253, "phrase": "telecare_service_design"}], "paper_keywords": ["telecare environment analysis", " Leavitt's diamond", " telemedicine", " guidelines", " telecore service design", " conceptual tool", " feedback tool"], "paper_abstract": "Objectives: Medical telecare services' designing and redesigning still remains a challenging issue since it often depends on how a number of socio-technological issues are framed. This work has two key objectives; the former is to theoretically analyze the nature of a telecare environment by developing a model that reveals potential areas of analysis and the latter is to support designing and redesigning medical telecare services by formulating a strategy as well as a number of \"state of the art\" guidelines. Methods. We have extended Leavitts diamond to develop a model capable of accurately reflecting the telecare environment building dimensions as well as their interactions. This model depends on the i) technology, ii) collaborators, iii) tasks, iv) structure, v) social forces and the vi) procedure dimensions. Taking this model as a core element we have proposed a service designing and redesigning strategy formulating, in parallel, six scalable dimension-oriented guidelines. Result. During the two-year period (2003-2005) an enormous amount of data was collected (by active participating in two EU projects, by conducting semi-structured interviews, by performing onsite observations as well as by reviewing 78 previous projects) and classified, structuring six guidelines. These guidelines can be considered as the \"state of the art\" to support future services' design and redesign. Conclusions: This work considering the telecare environment as a multi-dimensional, operational organization has put the focus on accurate telecare services' design and redesign. The parameters are not limited, by any means, and are drawn from experience of designing services in a variety of telecare domains. The optimal parameter combination must be chosen according to the aim of each telecare procedure. Further research is needed to determine the minimum parameters to support telecare service design.", "paper_title": "Designing and redesigning medical telecare services - A forces-oriented model", "paper_id": "WOS:000243757400010"}