{"auto_keywords": [{"score": 0.050077592516358335, "phrase": "object_shape"}, {"score": 0.027542080125224067, "phrase": "sbm"}, {"score": 0.004742290714667451, "phrase": "good_model"}, {"score": 0.004198965651975536, "phrase": "local_constraints"}, {"score": 0.0040525061916685924, "phrase": "object_boundaries"}, {"score": 0.003911135156992, "phrase": "global_constraints"}, {"score": 0.0038131738052230254, "phrase": "background_clutter"}, {"score": 0.0032251796659158696, "phrase": "deep_boltzmann_machine"}, {"score": 0.0031926011370225485, "phrase": "salakhutdinov"}, {"score": 0.0031284221314354095, "phrase": "artificial_intelligence"}, {"score": 0.0029735479904284706, "phrase": "shape_boltzmann_machine"}, {"score": 0.0025533148412439166, "phrase": "strong_model"}, {"score": 0.002283298119790413, "phrase": "training_examples"}, {"score": 0.0021049977753042253, "phrase": "existing_models"}], "paper_keywords": ["Shape", " Generative", " Deep Boltzmann machine", " Sampling"], "paper_abstract": "A good model of object shape is essential in applications such as segmentation, detection, inpainting and graphics. For example, when performing segmentation, local constraints on the shapes can help where object boundaries are noisy or unclear, and global constraints can resolve ambiguities where background clutter looks similar to parts of the objects. In general, the stronger the model of shape, the more performance is improved. In this paper, we use a type of deep Boltzmann machine (Salakhutdinov and Hinton, International Conference on Artificial Intelligence and Statistics, 2009) that we call a Shape Boltzmann Machine (SBM) for the task of modeling foreground/background (binary) and parts-based (categorical) shape images. We show that the SBM characterizes a strong model of shape, in that samples from the model look realistic and it can generalize to generate samples that differ from training examples. We find that the SBM learns distributions that are qualitatively and quantitatively better than existing models for this task.", "paper_title": "The Shape Boltzmann Machine: A Strong Model of Object Shape", "paper_id": "WOS:000333161200005"}