{"auto_keywords": [{"score": 0.048555664185916905, "phrase": "automated_algorithm"}, {"score": 0.046273829908275756, "phrase": "manual_analysis"}, {"score": 0.01145034018385232, "phrase": "hrmr_scores"}, {"score": 0.00481495049065317, "phrase": "high_risk_medication_regime_algorithm"}, {"score": 0.00476334344613564, "phrase": "home_health_care_population"}, {"score": 0.0046118021635786315, "phrase": "elderly_patients'_medication-related_risks"}, {"score": 0.004023120753104693, "phrase": "standardized_drug_codes"}, {"score": 0.003923151826724606, "phrase": "nlm"}, {"score": 0.0037710151976096985, "phrase": "patients'_high_risk_medication_regime_scores"}, {"score": 0.003598786417573615, "phrase": "manual_process"}, {"score": 0.0030609320300175953, "phrase": "medication_regimen_complexity_index"}, {"score": 0.0028586462987069336, "phrase": "pim"}, {"score": 0.002827944137500593, "phrase": "mrci"}, {"score": 0.0026126405272417783, "phrase": "imperfect_match_rates"}, {"score": 0.002448704249007665, "phrase": "hrmr_rules"}, {"score": 0.002396371892825691, "phrase": "clinical_judgments"}, {"score": 0.0023791769068748194, "phrase": "manual_coding"}, {"score": 0.0023116191163488824, "phrase": "automated_analysis"}, {"score": 0.0022703709180757576, "phrase": "high_comparison_rates"}, {"score": 0.0022138542785562444, "phrase": "automated_clinical_tool"}, {"score": 0.002190064650401852, "phrase": "patients'_medication_records"}, {"score": 0.0021509807762081145, "phrase": "avoidable_readmissions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rehospitalization", " Avoidable readmission", " High Risk Medication Regimen", " Home health care", " Algorithm", " RXNorm"], "paper_abstract": "Objective: Create an automated algorithm for predicting elderly patients' medication-related risks for readmission and validate it by comparing results with a manual analysis of the same patient population. Materials and methods: Outcome and Assessment Information Set (OASIS) and medication data were reused from a previous, manual study of 911 patients from 15 Medicare-certified home health care agencies. The medication data was converted into standardized drug codes using APIs managed by the National Library of Medicine (NLM), and then integrated in an automated algorithm that calculates patients' high risk medication regime scores (HRMRs). A comparison of the results between algorithm and manual process was conducted to determine how frequently the HRMR scores were derived which are predictive of readmission. Results: HRMR scores are composed of polypharmacy (number of drugs), Potentially Inappropriate Medications (PIM) (drugs risky to the elderly), and Medication Regimen Complexity Index (MRCI) (complex dose forms, instructions or administration). The algorithm produced polypharmacy, PIM, and MRCI scores that matched with 99%, 87% and 99% of the scores, respectively, from the manual analysis. Discussion: Imperfect match rates resulted from discrepancies in how drugs were classified and coded by the manual analysis vs. the automated algorithm. HRMR rules lack clarity, resulting in clinical judgments for manual coding that were difficult to replicate in the automated analysis. Conclusion: The high comparison rates for the three measures suggest that an automated clinical tool could use patients' medication records to predict their risks of avoidable readmissions. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Automation of a high risk medication regime algorithm in a home health care population", "paper_id": "WOS:000343362800008"}