{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gosper_curve"}, {"score": 0.004742511243894382, "phrase": "hierarchical_data"}, {"score": 0.004531637625717547, "phrase": "available_data"}, {"score": 0.004379631619412168, "phrase": "data_sets"}, {"score": 0.004313713204732449, "phrase": "classical_graph_drawing_methods"}, {"score": 0.004168986485488861, "phrase": "shape_recognition"}, {"score": 0.004121826934975274, "phrase": "cognitive_skills"}, {"score": 0.0039986494357811715, "phrase": "global_structure"}, {"score": 0.0037065115435101887, "phrase": "nested_irregular_shapes"}, {"score": 0.0034096661914349577, "phrase": "human_perception_mechanisms"}, {"score": 0.0030311679447397725, "phrase": "region_containment"}, {"score": 0.002929344511491418, "phrase": "leaves'_sizes"}, {"score": 0.002798865807872575, "phrase": "nonleaf_regions"}, {"score": 0.0026843584448921543, "phrase": "input_ordering"}, {"score": 0.00265394824073552, "phrase": "hierarchy's_nodes"}, {"score": 0.0022972306948217548, "phrase": "visualization_examples"}, {"score": 0.002254003531073337, "phrase": "tax_money"}, {"score": 0.0021049977753042253, "phrase": "professional_documentation_context"}], "paper_keywords": ["Treemap", " tree layout", " hierarchical data visualization", " Gosper curve", " concave polygon labeling"], "paper_abstract": "The emergence of very large hierarchies that result from the increase in available data raises many problems of visualization and navigation. On data sets of such scale, classical graph drawing methods do not take advantage of certain human cognitive skills such as shape recognition. These cognitive skills could make it easier to remember the global structure of the data. In this paper, we propose a method that is based on the use of nested irregular shapes. We name it GosperMap as we rely on the use of a Gosper Curve to generate these shapes. By employing human perception mechanisms that were developed by handling, for example, cartographic maps, this technique facilitates the visualization and navigation of a hierarchy. An algorithm has been designed to preserve region containment according to the hierarchy and to set the leaves' sizes proportionally to a property, in such a way that the size of nonleaf regions corresponds to the sum of their children's sizes. Moreover, the input ordering of the hierarchy's nodes is preserved, i.e., the areas that represent two consecutive children of a node in the hierarchy are adjacent to one another. This property is especially useful because it guarantees some stability in our algorithm. We illustrate our technique by providing visualization examples of the repartition of tax money in the US over time. Furthermore, we validate the use of the GosperMap in a professional documentation context and show the stability and ease of memorization for this type of map.", "paper_title": "GosperMap: Using a Gosper Curve for Laying Out Hierarchical Data", "paper_id": "WOS:000324558500004"}