{"auto_keywords": [{"score": 0.04216792154193272, "phrase": "html"}, {"score": 0.014268838809025406, "phrase": "web_applications"}, {"score": 0.013889811199541678, "phrase": "desktop_applications"}, {"score": 0.00481495049065317, "phrase": "common_xml-based_web_user_interface_languages."}, {"score": 0.004610058444728656, "phrase": "information_access"}, {"score": 0.004437910956996051, "phrase": "application_platform"}, {"score": 0.003831801113154043, "phrase": "user_interfaces"}, {"score": 0.003512308265830794, "phrase": "static_documents"}, {"score": 0.003399466007862412, "phrase": "complicated_web_applications"}, {"score": 0.0031845067058084613, "phrase": "specific_ui_description_language"}, {"score": 0.0028715299874549245, "phrase": "five_xml-based_ui_description_formats"}, {"score": 0.002646267286675984, "phrase": "modern_web_application_development"}, {"score": 0.002386062690026682, "phrase": "web_ui_description_language"}, {"score": 0.0021049977753042253, "phrase": "model_differences"}], "paper_keywords": ["Web User interface Description Language", " Web Application"], "paper_abstract": "In addition to being a platform for information access, the World Wide Web is increasingly becoming an application platform. While web applications have several benefits compared to desktop applications, there are also some problems. With legacy HTML, for example, one cannot produce user interfaces such as those that users have become accustomed to with desktop applications. What worked for static documents is not sufficient for the complicated web applications of today. Several parties have addressed this problem by defining a specific UI description language. In addition, the renewal of HTML aims to enhance support for web applications. This study evaluated five XML-based UI description formats, including HTML 5, in order to determine which language is best suited for modern web application development. The study also assessed what kind of applications are suited to each format. The requirements for a Web UI description language from the literature were revised and three use cases were defined, through which the languages are evaluated. The paper also presents the model differences of the languages.", "paper_title": "COMPARISON OF COMMON XML-BASED WEB USER INTERFACE LANGUAGES", "paper_id": "WOS:000280504600001"}