{"auto_keywords": [{"score": 0.03857336425646007, "phrase": "hybrid_scheme"}, {"score": 0.010586878480107568, "phrase": "protocol_selection_algorithm"}, {"score": 0.004462105963334103, "phrase": "host-based_protocol"}, {"score": 0.004272164161788242, "phrase": "network-based_protocol"}, {"score": 0.004135010810625326, "phrase": "full_advantage"}, {"score": 0.004046020290832207, "phrase": "mobility_performance"}, {"score": 0.0038596974575361574, "phrase": "optimized_coexistence_architecture"}, {"score": 0.003589602322126282, "phrase": "localized_mobility"}, {"score": 0.003563651133299401, "phrase": "global_mobility"}, {"score": 0.0031500213134140953, "phrase": "mobility_characteristics"}, {"score": 0.0031272381208680613, "phrase": "mobile_nodes"}, {"score": 0.0030709962527878656, "phrase": "network_conditions"}, {"score": 0.002876747208161839, "phrase": "performance_analysis"}, {"score": 0.0028455850650967477, "phrase": "two-layer_hierarchical_network_model"}, {"score": 0.0027641218567092665, "phrase": "signaling_costs"}, {"score": 0.0025518930446603335, "phrase": "proposed_mobility_management_architecture"}, {"score": 0.0024968877430444304, "phrase": "experimental_results"}, {"score": 0.0024342079318127423, "phrase": "handover_performance"}, {"score": 0.0024165966550680233, "phrase": "udp"}, {"score": 0.0023991371308348837, "phrase": "tcp"}, {"score": 0.0021592189144729775, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["MIPv6", " PMIPv6", " Mobility management", " Hybrid scheme", " Protocol selection"], "paper_abstract": "As two of the most promising candidate solutions for realizing the next-generation all-IP mobile Internet, Mobile IPv6 (MIPv6) is a host-based protocol supporting global mobility, while Proxy Mobile IPv6 (PMIPv6) is a network-based protocol supporting localized mobility. In order to take full advantage of both and enhance the mobility performance, a hybrid MIPv6/PMIPv6-based mobility management architecture is proposed in this paper. First, the optimized coexistence architecture of MIPv6 and PMIPv6 is presented. Based on this architecture, the Hybrid scheme is proposed, in which localized mobility and global mobility are handled by PMIPv6 and MIPv6 respectively to improve the efficiency. Then we propose the Hybrid+ scheme based on the Hybrid scheme. The Hybrid+ scheme incorporates a protocol selection algorithm, which takes into account the mobility characteristics of mobile nodes (MN) and network conditions. This allows it to select the most suitable mobility supporting protocol between the basic MIPv6 and the Hybrid scheme. Performance analysis using a two-layer hierarchical network model reveals that the Hybrid scheme reduces the signaling costs by more than 20% compared to the basic MIPv6 and Hierarchical Mobile IPv6 (HMIPv6). In addition, we have implemented the proposed mobility management architecture in a test-bed. The experimental results show that our Hybrid scheme can improve the handover performance of UDP and TCP sessions over the other mobility management protocols. Moreover, when the protocol selection algorithm is adopted as in the Hybrid+ scheme, the performance can be further improved by more than 50% under various scenarios. Crown Copyright (C) 2010 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Design and implementation of a hybrid MIPv6/PMIPv6-based mobility management architecture", "paper_id": "WOS:000285708100003"}