{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_niching_genetic_algorithms"}, {"score": 0.004750178261675602, "phrase": "multiple_solutions"}, {"score": 0.00468627326602559, "phrase": "job_shop_scheduling"}, {"score": 0.004074016501033133, "phrase": "final_set"}, {"score": 0.003947186611084043, "phrase": "genetic_algorithms"}, {"score": 0.0037052054802048707, "phrase": "different_optima"}, {"score": 0.0035095935622207956, "phrase": "different_solutions"}, {"score": 0.0034623203126093833, "phrase": "last_iteration"}, {"score": 0.0030505976034245234, "phrase": "niching_methods"}, {"score": 0.002942196368747418, "phrase": "different_multiple_global_optima"}, {"score": 0.0028634235895823594, "phrase": "useful_diversity"}, {"score": 0.002687702958515561, "phrase": "previous_works"}, {"score": 0.0026514708899935333, "phrase": "significant_difference"}, {"score": 0.002466303439899648, "phrase": "suitable_parametrization"}, {"score": 0.0024111277643627154, "phrase": "classic_methods"}], "paper_keywords": ["Genetic algorithms", " Multimodal problems", " Job shop scheduling problem", " Niching methods"], "paper_abstract": "In this paper the performance of the most recent multi-modal genetic algorithms () on the Job Shop Scheduling Problem () is compared in term of (the algorithm's capability to find multiple optima), and in the final set of solutions. The capability of Genetic Algorithms () to work on a set of solutions allows us to reach different optima in only one run. Nevertheless, simple are not able to maintain different solutions in the last iteration, therefore reaching only one local or global optimum. Research based on the preservation of the diversity through has provided very promising results. These techniques, known as niching methods or , allow not only to obtain different multiple global optima, but also to preserve useful diversity against convergence to only one solution (the usual behaviour of classical ). In previous works, a significant difference in the performance among methods was found, as well as the importance of a suitable parametrization. In this work classic methods are compared to the most recent , grouped in three classes (sharing, clearing and species competition), for . Our experimental study found that those new which have a certain type of perform much better (in terms of highest and ) than classical which do not have this type of process.", "paper_title": "Analysis of new niching genetic algorithms for finding multiple solutions in the job shop scheduling", "paper_id": "WOS:000304160600001"}