{"auto_keywords": [{"score": 0.049474472243262034, "phrase": "discontinuous_rock_masses"}, {"score": 0.004814953589569432, "phrase": "xfem"}, {"score": 0.004518442937844318, "phrase": "numerical_simulation"}, {"score": 0.004151188559520802, "phrase": "material_interfaces"}, {"score": 0.0036553070575015344, "phrase": "displacement_function"}, {"score": 0.003548368289666932, "phrase": "conventional_finite_element"}, {"score": 0.0034154440860550564, "phrase": "standard_displacement-based_approximation"}, {"score": 0.0033437537557378157, "phrase": "level-set-based_enrichment_functions"}, {"score": 0.0032321559007422087, "phrase": "element_subdivision_procedure"}, {"score": 0.0030847461428168614, "phrase": "findings_-_mesh_generation"}, {"score": 0.0030071857666598193, "phrase": "high-quality_meshes"}, {"score": 0.0029067881142952664, "phrase": "good_precision"}, {"score": 0.0027741761880779535, "phrase": "xfem_technique"}, {"score": 0.002704403349815203, "phrase": "discontinuous_rock_masses_problems"}, {"score": 0.0024320326084093465, "phrase": "geotechnical_engineering_problem"}, {"score": 0.0023507916951658455, "phrase": "failure_process"}, {"score": 0.002196342933346204, "phrase": "stability_analysis"}, {"score": 0.002177762848946681, "phrase": "complicated_rock_masses"}, {"score": 0.0021049977753042253, "phrase": "new_numerical_method"}], "paper_keywords": ["Rocks", " Mechanical behaviour of materials", " Numerical analysis", " Simulation"], "paper_abstract": "Purpose - The purpose of this paper is to achieve numerical simulation of discontinuous rock masses. Design/methodology/approach - The extended finite element method (XFEM) was used. Discontinuities (such as joints, faults, and material interfaces) are contained in the elements, thus the mesh can be generated without taking into account the existence of discontinuities. When one element contains no discontinuity, the displacement function is degenerated into that of the conventional finite element. For the element containing discontinuities, the standard displacement-based approximation is enriched by incorporating level-set-based enrichment functions that model the discontinuities, and an element subdivision procedure is used to integrate the domain of the element. Findings - Mesh generation can be simplified considerably and high-quality meshes can be obtained. A solution with good precision can also be achieved. It is concluded that the XFEM technique is especially suitable in simulating discontinuous rock masses problems. Research limitations/implications - Crack initiation and propagation should be considered in further studies. Practical implications - The paper presents a very useful numerical method for a geotechnical engineering problem that has the ability to simulate the failure process of discontinuous rock masses. The method is expected to be used widely in the deformation and stability analysis of complicated rock masses. Originality/value - The paper provides a new numerical method for discontinuous rock masses that is very convenient for pre-processing.", "paper_title": "The extended finite element method (XFEM) for discontinuous rock masses", "paper_id": "WOS:000292713100006"}