{"auto_keywords": [{"score": 0.0089557111056777, "phrase": "hop-based_burst-cluster"}, {"score": 0.006143219349188161, "phrase": "hop-based_burst-cluster_transmission"}, {"score": 0.006041468057027329, "phrase": "overall_burst_loss_probability"}, {"score": 0.005538759142690021, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "burst-cluster_transmission"}, {"score": 0.00473509474652851, "phrase": "high-performance_obs_networks"}, {"score": 0.0044883089984593455, "phrase": "high-performance_optical_burst_switching_networks"}, {"score": 0.0041837333868790134, "phrase": "different_numbers"}, {"score": 0.003809416146761322, "phrase": "largest_number"}, {"score": 0.003671663469605366, "phrase": "multiple_control_packets"}, {"score": 0.003354223660940168, "phrase": "control_packets"}, {"score": 0.003287482882222731, "phrase": "modified_processing_algorithm"}, {"score": 0.003126365132352301, "phrase": "wavelength_reservation"}, {"score": 0.002973120121800634, "phrase": "burst_loss_probability"}, {"score": 0.0025740882809779913, "phrase": "numerical_examples"}, {"score": 0.0024892263318773704, "phrase": "conventional_burst_transmission"}, {"score": 0.0023434465472518943, "phrase": "control_packet"}, {"score": 0.0022890828779208016, "phrase": "optical_switch"}], "paper_keywords": ["Burst-cluster", " Fairness improvement", " Loss probability", " Number of hops", " Optical burst switching"], "paper_abstract": "In order to improve the fairness in terms of the number of hops for high-performance optical burst switching networks, we propose a method called hop-based burst-cluster transmission. In this method, bursts with different numbers of hops are assembled simultaneously, and a hop-based burst-cluster is generated so that the bursts within the cluster are arranged in order from the smallest to the largest number of hops. Then the hop-based burst-cluster is transmitted along with multiple control packets. Here, within the same cluster, a burst whose number of hops is small is transmitted before a burst whose number of hops is large. The control packets are processed according to the modified processing algorithm, and hence a burst whose number of hops is large has more chances in the wavelength reservation than a burst whose number of hops is small. As a result, the burst loss probability of many hops decreases and the burst loss probability of few hops increases, improving the fairness. In addition, hop-based burst-cluster transmission can also decrease the overall burst loss probability. We evaluate the performance of hop-based burst-cluster transmission for the 14-node NSFNET and ARPA2 with simulation. In numerical examples, we compare the performance of the proposed method with conventional burst transmission, and we investigate the impacts of the amount of traffic, the processing time of a control packet, the switching time of an optical switch, and the number of wavelengths. We show that the proposed method can not only improve the fairness but also decrease the overall burst loss probability in both the networks.", "paper_title": "Hop-Based Burst-Cluster Transmission: Fairness Improvement in High-Performance OBS Networks", "paper_id": "WOS:000291439700007"}