{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "probabilistic_timed_automata"}, {"score": 0.04960202571834177, "phrase": "digital_clocks"}, {"score": 0.028851096418336983, "phrase": "performance_analysis"}, {"score": 0.004556901872357751, "phrase": "timed_automata"}, {"score": 0.004488946121663966, "phrase": "discrete_probability_distributions"}, {"score": 0.004399905285945236, "phrase": "modelling_formalism"}, {"score": 0.004312622975366676, "phrase": "formally_both_nondeterministic_and_probabilistic_aspects"}, {"score": 0.004000396172153709, "phrase": "timed_temporal_logic_properties"}, {"score": 0.003901407184706592, "phrase": "previously_developed_verification_algorithms"}, {"score": 0.0038239757564863057, "phrase": "high_complexity"}, {"score": 0.0036370297611938796, "phrase": "limited_class"}, {"score": 0.003306559295382181, "phrase": "large_class"}, {"score": 0.00327356326590461, "phrase": "real-time_verification_problems_correctness"}, {"score": 0.0031765314093444956, "phrase": "integral_model"}, {"score": 0.0030060256866508606, "phrase": "dense_model"}, {"score": 0.002560162916190598, "phrase": "important_class"}, {"score": 0.0024842242921857705, "phrase": "probabilistic_reachability"}], "paper_keywords": ["probabilistic model checking", " timed automata", " digital clocks"], "paper_abstract": "Probabilistic timed automata, a variant of timed automata extended with discrete probability distributions, is a modelling formalism suitable for describing formally both nondeterministic and probabilistic aspects of real-time systems, and is amenable to model checking against probabilistic timed temporal logic properties. However, the previously developed verification algorithms either suffer from high complexity, give only approximate results, or are restricted to a limited class of properties. In the case of classical (non-probabilistic) timed automata it has been shown that for a large class of real-time verification problems correctness can be established using an integral model of time (digital clocks) as opposed to a dense model of time. Based on these results we address the question of under what conditions digital clocks are sufficient for the performance analysis of probabilistic timed automata and show that this reduction is possible for an important class of systems and properties including probabilistic reachability and expected reachability. We demonstrate the utility of this approach by applying the method to the performance analysis of three probabilistic real-time protocols: the dynamic configuration protocol for IPv4 link-local addresses, the IEEE 802.11 wireless local area network protocol and the IEEE 1394 FireWire root contention protocol.", "paper_title": "Performance analysis of probabilistic timed automata using digital clocks", "paper_id": "WOS:000239021600002"}