{"auto_keywords": [{"score": 0.046665137819200175, "phrase": "femtocell_service"}, {"score": 0.006605900751365826, "phrase": "macrocell_service"}, {"score": 0.006479245147455166, "phrase": "femtocell_service_provision"}, {"score": 0.00608251808063423, "phrase": "cellular_operator"}, {"score": 0.004697902218671618, "phrase": "poor_connectivity_issue"}, {"score": 0.004664983066310498, "phrase": "indoor_cellular_users"}, {"score": 0.004567596860086148, "phrase": "economic_incentive"}, {"score": 0.0042126709243529275, "phrase": "stackelberg_game"}, {"score": 0.004124688058533477, "phrase": "spectrum_allocations"}, {"score": 0.003968112038249246, "phrase": "heterogeneous_users"}, {"score": 0.0038244013215017214, "phrase": "spatial_reuse"}, {"score": 0.00376409764683147, "phrase": "ideal_case"}, {"score": 0.003410822685334396, "phrase": "better_user_quality"}, {"score": 0.0033513085425415545, "phrase": "higher_operator_profit"}, {"score": 0.003223995503078124, "phrase": "users'_payoffs"}, {"score": 0.002890557197908352, "phrase": "operational_cost"}, {"score": 0.0028702659563021047, "phrase": "limited_coverage"}, {"score": 0.0027806988302728633, "phrase": "operational_cost_increases"}, {"score": 0.002693919110230191, "phrase": "operator's_profit"}, {"score": 0.0026190518142076608, "phrase": "spatial_coverage"}, {"score": 0.00243225236680506, "phrase": "total_resource"}, {"score": 0.002142426911242168, "phrase": "femtocell_services"}], "paper_keywords": ["Femtocells", " macrocells", " microeconomics", " Stackelberg game", " subgame perfect equilibrium"], "paper_abstract": "Femtocells can effectively resolve the poor connectivity issue of indoor cellular users. This paper investigates the economic incentive for a cellular operator to add femtocell service on top of its existing macrocell service. We model the interactions between a cellular operator and users as a Stackelberg game: The operator first determines spectrum allocations and pricings of femtocell and macrocell services, and then heterogeneous users choose between the two services and the amount of resource to request. In the ideal case where the femtocell service has the same full spatial coverage as the macrocell service, we show that the operator will choose to provide femtocell service only, as this leads to a better user quality of service and a higher operator profit. However, if we impose the constraint that no users' payoffs decrease after introducing the femtocell service, then the operator will always continue providing the macrocell service (with or without the femtocell service). Furthermore, we study the impact of operational cost, limited coverage, and spatial reuse on femtocell service provision. As the operational cost increases, fewer users are served by femtocell service and the operator's profit decreases. When the femtocell service has limited spatial coverage, the operator always provides the macrocell service beside the femtocell service. However, when the coverage is high or the total resource is low, the operator will set the prices such that all users who can access femtocell will choose to use the femtocell service only. Finally, spatial reuse of spectrum will increase the efficiency of femtocell services and gives the operator more incentives to allocate spectrum to femtocells.", "paper_title": "Economics of Femtocell Service Provision", "paper_id": "WOS:000324951200013"}