{"auto_keywords": [{"score": 0.04247694305902978, "phrase": "local_broadcast_algorithms"}, {"score": 0.040515828854516725, "phrase": "optimum_solution"}, {"score": 0.0381862083881337, "phrase": "constant_approximation_factor"}, {"score": 0.03069819562357211, "phrase": "position_information"}, {"score": 0.014853881583832646, "phrase": "static_approach"}, {"score": 0.014734087605252905, "phrase": "local_algorithms"}, {"score": 0.011411573586050137, "phrase": "dynamic_approach"}, {"score": 0.004621984064678252, "phrase": "wireless_ad_hoc_networks"}, {"score": 0.004276306563103443, "phrase": "local_topology_information"}, {"score": 0.004224130367280183, "phrase": "globally_known_priority_function"}, {"score": 0.003908091457759849, "phrase": "good_approximation_factor"}, {"score": 0.003250403288147613, "phrase": "local_topology_information_and_broadcast_state_information"}, {"score": 0.0023514343164101332, "phrase": "local_broadcast_algorithm"}, {"score": 0.002131054594847684, "phrase": "full_delivery"}, {"score": 0.0021049977753042253, "phrase": "constant_approximation"}], "paper_keywords": ["Mobile ad hoc networks", " distributed algorithms", " broadcasting", " connected dominating set", " constant approximation"], "paper_abstract": "There are two main approaches, static and dynamic, to broadcast algorithms in wireless ad hoc networks. In the static approach, local algorithms determine the status (forwarding/nonforwarding) of each node proactively based on local topology information and a globally known priority function. In this paper, we first show that local broadcast algorithms based on the static approach cannot achieve a good approximation factor to the optimum solution (an NP-hard problem). However, we show that a constant approximation factor is achievable if (relative) position information is available. In the dynamic approach, local algorithms determine the status of each node \"on-the-fly\" based on local topology information and broadcast state information. Using the dynamic approach, it was recently shown that local broadcast algorithms can achieve a constant approximation factor to the optimum solution when (approximate) position information is available. However, using position information can simplify the problem. Also, in some applications it may not be practical to have position information. Therefore, we wish to know whether local broadcast algorithms based on the dynamic approach can achieve a constant approximation factor without using position information. We answer this question in the positive-we design a local broadcast algorithm in which the status of each node is decided \"on-the-fly\" and prove that the algorithm can achieve both full delivery and a constant approximation to the optimum solution.", "paper_title": "Local Broadcast Algorithms in Wireless Ad Hoc Networks: Reducing the Number of Transmissions", "paper_id": "WOS:000299294400005"}