{"auto_keywords": [{"score": 0.03898048818064751, "phrase": "encrypted_data"}, {"score": 0.03797032272763088, "phrase": "access_rights"}, {"score": 0.00481495049065317, "phrase": "cloud_servers"}, {"score": 0.0047370749839861165, "phrase": "rapid_development"}, {"score": 0.004685855684376706, "phrase": "cloud_computing"}, {"score": 0.004318881178805575, "phrase": "shared_data"}, {"score": 0.0042489946866108895, "phrase": "untrusted_cloud_service_providers"}, {"score": 0.004112582094962078, "phrase": "natural_way"}, {"score": 0.0038948525410795517, "phrase": "key_problems"}, {"score": 0.0037697665240643066, "phrase": "access_control"}, {"score": 0.003115908199991072, "phrase": "hierarchical_attribute-based_encryption_scheme"}, {"score": 0.0025472634689904772, "phrase": "scalable_revocation_scheme"}, {"score": 0.002284290601837099, "phrase": "habe_scheme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cloud computing", " Hierarchical attribute-based encryption", " Fine-grained access control", " User revocation"], "paper_abstract": "With rapid development of cloud computing, more and more enterprises will outsource their sensitive data for sharing in a cloud. To keep the shared data confidential against untrusted cloud service providers (CSPs), a natural way is to store only the encrypted data in a cloud. The key problems of this approach include establishing access control for the encrypted data, and revoking the access rights from users when they are no longer authorized to access the encrypted data. This paper aims to solve both problems. First, we propose a hierarchical attribute-based encryption scheme (HABE) by combining a hierarchical identity-based encryption (HIBE) system and a ciphertext-policy attribute-based encryption (CP-ABE) system, so as to provide not only fine-grained access control, but also full delegation and high performance. Then, we propose a scalable revocation scheme by applying proxy re-encryption (PRE) and lazy re-encryption (LRE) to the HABE scheme, so as to efficiently revoke access rights from users. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Hierarchical attribute-based encryption and scalable user revocation for sharing data in cloud servers", "paper_id": "WOS:000293724700004"}