{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "video_games"}, {"score": 0.009864182665462682, "phrase": "interactive_entertainment_systems"}, {"score": 0.009559736734789721, "phrase": "interactive_systems"}, {"score": 0.00783660760953596, "phrase": "ux"}, {"score": 0.004426882270402403, "phrase": "high_economic_impact"}, {"score": 0.0038751504050385183, "phrase": "user_experience"}, {"score": 0.0035750641312373202, "phrase": "main_dimensions"}, {"score": 0.0033800778203837726, "phrase": "new_concept"}, {"score": 0.002767696345005216, "phrase": "play_time"}, {"score": 0.002738723329538679, "phrase": "proposed_framework"}, {"score": 0.0025801648787263662, "phrase": "multifaceted_analysis_mechanism"}, {"score": 0.0025175684590726796, "phrase": "gaming_experience"}, {"score": 0.002447882520797866, "phrase": "video_game"}, {"score": 0.0022580713471027996, "phrase": "satisfactory_experience"}, {"score": 0.0022344212744309327, "phrase": "entertainment_system"}, {"score": 0.0021801944769738618, "phrase": "practical_experiment"}, {"score": 0.0021049977753042253, "phrase": "commercial_video_game"}], "paper_keywords": ["playability", " user experience", " usability", " video games", " interactive systems"], "paper_abstract": "Currently, few studies focus on analysing the degree of the Player eXperience (PX) in video games. Video games have now become interactive entertainment systems with a high economic impact on society; these are interactive systems characterised by their subjectivity, which differ from other systems in that their main objective is to entertain and amuse the user (player). This work discusses the analysis and evaluation of the User eXperience (UX) in interactive entertainment systems, exploring how usability, given its definition, objectives and the fact it is one of the main dimensions of UX, is not sufficient to characterise the PX, giving rise to a new concept: Playability. In this paper, we present a framework for the analysis and evaluation of the UX in video games. The results show the need and importance of a framework to help us understand and measure the experience that players feel using these types of interactive systems, in order to improve the experience during play time. The proposed framework characterises the experience using attributes to identify and properties to measure UX. It thus provides a multifaceted analysis mechanism to assess the impact of the gaming experience and its relationship with the elements of a video game. We therefore present a system to represent UX based on this framework, with the aim of ensuring and measuring a satisfactory experience of the entertainment system. Finally, we discuss a practical experiment in which an evaluation of the playability of a commercial video game was carried out using the methods proposed in this work.", "paper_title": "Playability: analysing user experience in video games", "paper_id": "WOS:000308863100009"}