{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "velocity-based_stability_margins"}, {"score": 0.0046253989970108985, "phrase": "sufficient_conditions"}, {"score": 0.004443276312972159, "phrase": "different_walking_algorithms"}, {"score": 0.0039841418890102925, "phrase": "tighter_necessary_conditions"}, {"score": 0.003697538418750941, "phrase": "biped's_center_of_mass"}, {"score": 0.0032585499655442404, "phrase": "internal_angular_momentum"}, {"score": 0.0026955672787561742, "phrase": "stability_margins"}, {"score": 0.002649472341607234, "phrase": "simple_models"}, {"score": 0.0025596276616952516, "phrase": "inverted_pendulum_model"}, {"score": 0.0025158514649823724, "phrase": "linear_inverted_pendulum_model"}, {"score": 0.0021416404045850224, "phrase": "simulation_experiments"}], "paper_keywords": [""], "paper_abstract": "We present velocity-based stability margins for fast bipedal walking that are sufficient conditions for stability, allow comparison between different walking algorithms, are measurable and computable, and are meaningful. While not completely necessary conditions, they axe tighter necessary conditions than several previously proposed stability margins. The stability margins we present take into consideration a biped's Center of Mass position and velocity, the reachable region of its swing leg, the time required to swing its swing leg, and the amount of internal angular momentum available for capturing balance. They predict the opportunity for the biped to place its swing leg in such a way that it can continue walking without falling down. We present methods for estimating these stability margins by using simple models of walking such as an inverted pendulum model and the Linear Inverted Pendulum model. We show that by considering the Center of Mass location with respect to the Center of Pressure on the foot, these estimates are easily computable. Finally, we show through simulation experiments on a 12 degree-of-freedom distributed-mass lower-body biped that these estimates are useful for analyzing and controlling bipedal walking.", "paper_title": "Velocity-based stability margins for fast bipedal walking", "paper_id": "WOS:000241137700014"}