{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "community_structure"}, {"score": 0.004774937143916685, "phrase": "cover_song_networks"}, {"score": 0.004676345706416371, "phrase": "community_detection_algorithms"}, {"score": 0.004541712637353326, "phrase": "cover_song_identification"}, {"score": 0.004410938507689426, "phrase": "different_audio_renditions"}, {"score": 0.004143196873246147, "phrase": "typical_query-by-example_task"}, {"score": 0.004040688646993605, "phrase": "query_song"}, {"score": 0.00390792986752692, "phrase": "possible_matches"}, {"score": 0.003670608022642996, "phrase": "new_approach"}, {"score": 0.0036248955128033084, "phrase": "song_communities"}, {"score": 0.0031712256091350316, "phrase": "complex_weighted_network"}, {"score": 0.002477998427152547, "phrase": "internal_organization"}, {"score": 0.0024573577356299765, "phrase": "individual_cover_song_communities"}, {"score": 0.0023566987138026285, "phrase": "original_song"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Complex networks", " Community detection", " Clustering", " Music retrieval", " Cover songs", " Original song"], "paper_abstract": "The use of community detection algorithms is explored within the framework of cover song identification, i.e. the automatic detection of different audio renditions of the same underlying musical piece. Until now, this task has been posed as a typical query-by-example task, where one submits a query song and the system retrieves a list of possible matches ranked by their similarity to the query. In this work, we propose a new approach which uses song communities (clusters, groups) to provide more relevant answers to a given query. Starting from the output of a state-of-the-art system, songs are embedded in a complex weighted network whose links represent similarity (related musical content). Communities inside the network are then recognized as groups of covers and this information is used to enhance the results of the system. In particular, we show that this approach increases both the coherence and the accuracy of the system. Furthermore, we provide insight into the internal organization of individual cover song communities, showing that there is a tendency for the original song to be central within the community. We postulate that the methods and results presented here could be relevant to other queryby-example tasks. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Characterization and exploitation of community structure in cover song networks", "paper_id": "WOS:000304235500002"}