{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "horizontal_gene_transfer"}, {"score": 0.004367707617503722, "phrase": "ancestor-descendant_relationship"}, {"score": 0.003678023470672862, "phrase": "gene_sharing"}, {"score": 0.0033828748627992193, "phrase": "evolutionary_histories"}, {"score": 0.0033515736929172644, "phrase": "horizontally_transferred_genes"}, {"score": 0.0032898346872897383, "phrase": "corresponding_species_phylogeny"}, {"score": 0.0031697368057340895, "phrase": "gene_trees"}, {"score": 0.003125835572347772, "phrase": "trusted_rooted_species_tree"}, {"score": 0.0030825404960282713, "phrase": "gene_tree"}, {"score": 0.0028882701690741467, "phrase": "species_tree"}, {"score": 0.0022889103976458437, "phrase": "quartets_input_size"}, {"score": 0.0021049977753042253, "phrase": "simulated_datasets"}], "paper_keywords": ["algorithms", " horizontal gene transfer", " microbial evolution", " quartets"], "paper_abstract": "In a horizontal gene transfer (HGT) event, a gene is transferred between two species that do not have an ancestor-descendant relationship. Typically, no more than a few genes are horizontally transferred between any two species. However, several studies identified pairs of species between which many different genes were horizontally transferred. Such a pair is said to be linked by a highway of gene sharing. We present a method for inferring such highways. Our method is based on the fact that the evolutionary histories of horizontally transferred genes disagree with the corresponding species phylogeny. Specifically, given a set of gene trees and a trusted rooted species tree, each gene tree is first decomposed into its constituent quartet trees and the quartets that are inconsistent with the species tree are identified. Our method finds a pair of species such that a highway between them explains the largest (normalized) fraction of inconsistent quartets. For a problem on n species and m input quartet trees, we give an efficient O(m + n(2))-time algorithm for detecting highways, which is optimal with respect to the quartets input size. An application of our method to a dataset of 1128 genes from 11 cyanobacterial species, as well as to simulated datasets, illustrates the efficacy of our method.", "paper_title": "Detecting Highways of Horizontal Gene Transfer", "paper_id": "WOS:000294813000007"}