{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "incomplete_data"}, {"score": 0.004701873396921536, "phrase": "rough"}, {"score": 0.004510184935928004, "phrase": "lower_and_upper_approximations"}, {"score": 0.0035551969986263553, "phrase": "additional_parameter_alpha"}, {"score": 0.0033101397746161843, "phrase": "novel_properties"}, {"score": 0.0028865314258560214, "phrase": "probabilistic_approximations"}, {"score": 0.0027852126030055305, "phrase": "data_mining"}, {"score": 0.002472412920623605, "phrase": "best_approach"}, {"score": 0.002385595105638277, "phrase": "result_often-fold_cross_validation"}, {"score": 0.0022476051902301187, "phrase": "rule_sets"}, {"score": 0.0022077827041801193, "phrase": "total_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Probabilistic approximations", " Extensions of probabilistic approximations", " Singleton, subset and concept probabilistic approximations", " Incomplete data"], "paper_abstract": "Rough set theory provides a very useful idea of lower and upper approximations for inconsistent data. For incomplete data these approximations are not unique. In this paper we investigate properties of three well-known generalizations of approximations: singleton, subset and concept. These approximations were recently further generalized as to include an additional parameter alpha, interpreted as a probability. In this paper we report novel properties of singleton, subset and concept probabilistic approximations. Additionally, we validated such approximations experimentally. Our main objective was to test which of the singleton, subset and concept probabilistic approximations are the most useful for data mining. Our conclusion is that, for a given incomplete data set, all three approaches should be applied and the best approach should be selected as a result often-fold cross validation. Finally, we conducted experiments on complexity of rule sets and the total number of singleton, subset and concept approximations. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Mining incomplete data with singleton, subset and concept probabilistic approximations", "paper_id": "WOS:000339132700023"}