{"auto_keywords": [{"score": 0.0363977101507796, "phrase": "drug-like_molecules"}, {"score": 0.00481495049065317, "phrase": "continuum_solvation_models"}, {"score": 0.004704407458864224, "phrase": "hydration_free_energy"}, {"score": 0.004272890968689369, "phrase": "langevin"}, {"score": 0.0041195049121633956, "phrase": "poisson_equation"}, {"score": 0.003716520760680603, "phrase": "experimentally_known_small_organic_molecules"}, {"score": 0.00367967106192446, "phrase": "mean_absolute_deviation"}, {"score": 0.003655324450191879, "phrase": "mad"}, {"score": 0.0032217623556814543, "phrase": "small_organic_molecules"}, {"score": 0.003065092702656417, "phrase": "solvation_energy"}, {"score": 0.002994602527726632, "phrase": "continuum_solvation_methods"}, {"score": 0.002887083738036996, "phrase": "mean_unsigned_relative_deviations"}, {"score": 0.0028584344002749395, "phrase": "best_solvation_methods"}, {"score": 0.0027834145465170292, "phrase": "ionic_molecules"}, {"score": 0.0026304533650262545, "phrase": "binding_constants"}, {"score": 0.0021474369836979048, "phrase": "generalised_born_methods"}, {"score": 0.002126111716875144, "phrase": "better_results"}, {"score": 0.0021049977753042253, "phrase": "poison-boltzmann_methods"}], "paper_keywords": ["Solvation energy", " Free energy of hydration", " Continuum methods", " PCM", " Langevin dipoles", " FDPB", " Generalised Born"], "paper_abstract": "We have estimated the hydration free energy for 20 neutral drug-like molecules, as well as for three series of 6-11 inhibitors to avidin, factor Xa, and galectin-3 with four different continuum solvent approaches (the polarised continuum method the Langevin dipole method, the finite-difference solution of the Poisson equation, and the generalised Born method), and several variants of each, giving in total 24 different methods. All four types of methods have been thoroughly calibrated for a number of experimentally known small organic molecules with a mean absolute deviation (MAD) of 1-6 kJ/mol for neutral molecules and 4-30 kJ/mol for ions. However, for the drug-like molecules, the accuracy seems to be appreciably worse. The reason for this is that drug-like molecules are more polar than small organic molecules and that the uncertainty of the methods is proportional to the size of the solvation energy. Therefore, the accuracy of continuum solvation methods should be discussed in relative, rather than absolute, terms. In fact, the mean unsigned relative deviations of the best solvation methods, 0.09 for neutral and 0.05 for ionic molecules, correspond to 2-20 kJ/mol absolute error for the drug-like molecules in this investigation, or 2-3,000 in terms of binding constants. Fortunately, the accuracy of all methods can be improved if only relative energies within a series of inhibitors are considered, especially if all of them have the same net charge. Then, all except two methods give MADs of 2-5 kJ/mol (corresponding to an uncertainty of a factor of 2-7 in the binding constant). Interestingly, the generalised Born methods typically give better results than the Poison-Boltzmann methods.", "paper_title": "How accurate are continuum solvation models for drug-like molecules?", "paper_id": "WOS:000267222300002"}