{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "iso-surface_extraction"}, {"score": 0.004583579470330216, "phrase": "volume_rendering"}, {"score": 0.004153520149706423, "phrase": "whole_dataset"}, {"score": 0.003975515793563275, "phrase": "relatively_small_subset"}, {"score": 0.003910740988145338, "phrase": "original_dataset"}, {"score": 0.0033363396054797044, "phrase": "preprocessing_time"}, {"score": 0.0031932442564773468, "phrase": "run_time"}, {"score": 0.0031411751440831165, "phrase": "iso-contouring_algorithm"}, {"score": 0.0030730639262332698, "phrase": "intersected_cells"}, {"score": 0.0028150302583265655, "phrase": "smaller_seed-set"}, {"score": 0.0026070408483940535, "phrase": "minimal_seed-set"}, {"score": 0.0024815011359381692, "phrase": "new_and_efficient_approach"}, {"score": 0.0024011766029754006, "phrase": "relatively_small_seed-set"}], "paper_keywords": ["iso-surface extraction", " iso-contouring", " seed-set", " min-max span space", " volume thinning"], "paper_abstract": "Iso-surface extraction is one of the most important approaches for volume rendering, and iso-contouring is one of the most effective methods for iso-surface extraction. Unlike most other methods having their search domain be the whole dataset, iso-contouring does its search only on a relatively small subset of the original dataset. This subset, called a seed-set, has the property that every iso-surface must intersect with it, and it could be built at the preprocessing time. When an iso-value is given at run time, an iso-contouring algorithm starts from the intersected cells in the seed-set, and gradually propagates to form the desired iso-surface(s). As a smaller seed-set could offer less cell searching time, most existing iso-contouring algorithms concentrate on how to identify a minimal seed-set. In this paper, we propose a new and efficient approach for the construction of a relatively small seed-set. This presented algorithm could reduce the size of a generated seed-set by up to one or two orders of magnitude, compared with other previously proposed linear-time algorithms.", "paper_title": "A New Seed-Set Finding Approach for Iso-Surface Extraction", "paper_id": "WOS:000261206300010"}