{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "surgical_workflow"}, {"score": 0.009951479878303757, "phrase": "temporal_registration"}, {"score": 0.00477513738640734, "phrase": "explicit_models"}, {"score": 0.004735651915966323, "phrase": "workflow_recovery"}, {"score": 0.004638354165775803, "phrase": "context-sensitive_service_systems"}, {"score": 0.00402748353567517, "phrase": "average_workflows"}, {"score": 0.0039446780026489905, "phrase": "training_surgeons"}, {"score": 0.0039120325834029355, "phrase": "automatic_report_generation"}, {"score": 0.003660374693346876, "phrase": "novel_way"}, {"score": 0.003630073540438812, "phrase": "automatic_recovery"}, {"score": 0.0034678302347682694, "phrase": "implicit_or_explicit_model"}, {"score": 0.0032990689963715127, "phrase": "multidimensional_state_vectors"}, {"score": 0.003231191164622055, "phrase": "different_operations"}, {"score": 0.0031254704616199614, "phrase": "enhanced_version"}, {"score": 0.0030867203659106727, "phrase": "dynamic_time_warp_algorithm"}, {"score": 0.0029121251930855664, "phrase": "six_different_surgeries"}, {"score": 0.0024656866249273125, "phrase": "different_surgeries"}, {"score": 0.0024149139610228887, "phrase": "varying_duration"}, {"score": 0.002335838283092986, "phrase": "synchronized_videos"}], "paper_keywords": [""], "paper_abstract": "Workflow recovery is crucial for designing context-sensitive service systems in future operating rooms. Abstract knowledge about actions which are being performed is particularly valuable in the OR. This knowledge can be used for many applications such as optimizing the workflow, recovering average workflows for guiding and evaluating training surgeons, automatic report generation and ultimately for monitoring in a context aware operating room. This paper describes a novel way for automatic recovery of the surgical workflow. Our algorithms perform this task without an implicit or explicit model of the surgery. This is achieved by the synchronization of multidimensional state vectors of signals recorded in different operations of the same type. We use an enhanced version of the dynamic time warp algorithm to calculate the temporal registration. The algorithms have been tested on 17 signals of six different surgeries of the same type. The results on this dataset are very promising because the algorithms register the steps in the surgery correctly up to seconds, which is our sampling rate. Our software visualizes the temporal registration by displaying the videos of different surgeries of the same type with varying duration precisely synchronized to each other. The synchronized videos of one surgery are either slowed down or speeded up in order to show the same steps as the ones presented in the videos of the other surgery.", "paper_title": "Recovery of surgical workflow without explicit models", "paper_id": "WOS:000241556300052"}