{"auto_keywords": [{"score": 0.048512039224227546, "phrase": "etoys"}, {"score": 0.00481495049065317, "phrase": "educational_software"}, {"score": 0.004333406378146173, "phrase": "visual_programming_environment"}, {"score": 0.004145287175409325, "phrase": "software_applications"}, {"score": 0.0037931018103829427, "phrase": "educational_technology_course"}, {"score": 0.003751228706861377, "phrase": "cognitive_apprenticeship_and_pair_programming_approaches"}, {"score": 0.0035290250358997904, "phrase": "participating_teachers"}, {"score": 0.0030715948036518603, "phrase": "anonymous_survey"}, {"score": 0.0022129983153880467, "phrase": "etoys_programming"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive learning environment", " Media in education", " Programming and programming languages", " Teaching/learning strategies"], "paper_abstract": "This study investigates whether a visual programming environment called Etoys could enable teachers to create software applications meeting their own instructional needs. Twenty-four teachers who participated in the study successfully developed their own educational computer programs in the educational technology course employing cognitive apprenticeship and pair programming approaches as the primary instructional strategies. Two educational software programs created by the participating teachers were described in order to explain what they were trying to do using Etoys and how they accomplished their goals. The results of an anonymous survey evaluating the difficulty of and the attitude toward learning Etoys indicate that teachers enjoyed learning Etoys and would like to continue to use it in the future although they found it was slightly more difficult, compared to their self-evaluated computer skill. The strengths and weaknesses of Etoys, the difficult computer programming concepts, and the educational implications of Etoys programming were also discussed. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Empowering teachers to create educational software: A constructivist approach utilizing Etoys, pair programming and cognitive apprenticeship", "paper_id": "WOS:000284819800019"}