{"auto_keywords": [{"score": 0.031637447951930985, "phrase": "scene_appearance_model"}, {"score": 0.00481495049065317, "phrase": "spatial_prediction"}, {"score": 0.004652016085325825, "phrase": "static_scene"}, {"score": 0.004123781267600542, "phrase": "scene_appearance_modeling"}, {"score": 0.0037402558657576124, "phrase": "illumination_changes"}, {"score": 0.0034118234596993836, "phrase": "illumination_sources"}, {"score": 0.003296212583539166, "phrase": "three-dimensional_configuration"}, {"score": 0.003130077012135034, "phrase": "reflectance_properties"}, {"score": 0.002806256131739047, "phrase": "static_illumination_sources"}, {"score": 0.002664749302333897, "phrase": "arbitrary_three-dimensional_configurations"}, {"score": 0.002530359917257626, "phrase": "suggested_model"}, {"score": 0.002487083025913648, "phrase": "spatial_prediction_technique"}, {"score": 0.0022041312401435346, "phrase": "prediction_technique"}], "paper_keywords": ["Scene appearance modeling", " Prediction", " Estimation"], "paper_abstract": "The appearance of a static scene as sensed by a camera changes considerably as a result of changes in the illumination that falls upon it. Scene appearance modeling is thus necessary for understanding which changes in the appearance of a scene are the result of illumination changes. For any camera, the appearance of the scene is a function of the illumination sources in the scene, the three-dimensional configuration of the objects in the scene and the reflectance properties of all the surfaces in the scene. A scene appearance model is described here as a function of the behavior of static illumination sources, within or beyond the scene, and arbitrary three-dimensional configurations of patches and their reflectance distributions. Based on the suggested model, a spatial prediction technique was developed to predict the appearance of the scene, given a few measurements within it. The scene appearance model and the prediction technique were developed analytically and tested empirically. Two potential applications are briefly explored.", "paper_title": "Scene appearance model based on spatial prediction", "paper_id": "WOS:000337091200011"}