{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "inner_stresses"}, {"score": 0.04104505701329051, "phrase": "stress_state"}, {"score": 0.040643563268944034, "phrase": "particular_point"}, {"score": 0.0047823219739028325, "phrase": "rock_masses"}, {"score": 0.004622450915803531, "phrase": "computational_approach"}, {"score": 0.004452731043379068, "phrase": "overdrilling_method_-_determines"}, {"score": 0.004231249907249981, "phrase": "human_activity"}, {"score": 0.004034444399739595, "phrase": "elasticity_theory"}, {"score": 0.003979907786856535, "phrase": "numerical_system"}, {"score": 0.003718045060236861, "phrase": "levenberg-marquardt_minimization_method"}, {"score": 0.0034497831301482144, "phrase": "computational_method"}, {"score": 0.003255777265493076, "phrase": "rock_mass"}, {"score": 0.0032008144731234265, "phrase": "obtained_results"}, {"score": 0.0030831303297783877, "phrase": "developed_methods"}, {"score": 0.0030207674474548403, "phrase": "computer_tool"}, {"score": 0.002949598537993663, "phrase": "graphic_environment"}, {"score": 0.0028218336994432864, "phrase": "overdrilling_method"}, {"score": 0.0027366287564324966, "phrase": "reliable_determination"}, {"score": 0.002718045523483502, "phrase": "global_stress_state"}, {"score": 0.0025217522723800204, "phrase": "great_importance"}, {"score": 0.002479150189700726, "phrase": "reliable_automatic_tool"}, {"score": 0.002245842206945282, "phrase": "general-scope_commercial_tool"}, {"score": 0.0021049977753042253, "phrase": "analysed_working_area"}], "paper_keywords": ["Civil engineering", " Mining", " Numerical analysis"], "paper_abstract": "Purpose - This paper aims to present a computational approach which - setting off from measures obtained by using an overdrilling method - determines, automatically and accurately, stress changes undergone in terrain as a consequence of human activity. Design/methodology/approach - The method presented uses the data from three boreholes and the elasticity theory to represent a numerical system whose resolution allows determining the stress state in a particular point. Since the system obtained is over-dimensioned, the Levenberg-Marquardt minimization method has been used in order to minimize errors. This paper details the analysis carried out in order to develop the computational method. Findings - This paper provides the algorithm for determining inner stresses in a particular point of a rock mass. Besides, a method to verify obtained results is presented, including its computational encoding in C#. Furthermore, the developed methods have been integrated in a computer tool which presents the results in a graphic environment. Research limitations/implications - The algorithms presented are applicable when using an overdrilling method to measure stresses. Practical implications - A reliable determination of global stress state demands the use of any method that is numerically difficult to use. Thus, in practice, it is of great importance to dispose of some reliable automatic tool to calculate stress state. Originality/value - Accuracy in the results obtained with the tool, together with the simplicity of its interface, involves a certain advantage regarding the use of a general-scope commercial tool, since it allows without being necessary to be an expert user - quickly obtaining results within the analysed working area", "paper_title": "Computational determination of inner stresses in rock masses", "paper_id": "WOS:000286569400001"}