{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_defect_repair_times"}, {"score": 0.009916740386593818, "phrase": "ltln_distribution"}, {"score": 0.004091248980678087, "phrase": "multiplicative_interplay"}, {"score": 0.003945754887845885, "phrase": "lognormal_distribution"}, {"score": 0.0038749521906474593, "phrase": "natural_choice"}, {"score": 0.0038284549148537373, "phrase": "model_rates"}, {"score": 0.003626000977962191, "phrase": "lognormal_rate_distribution"}, {"score": 0.0034550163444256386, "phrase": "ltln."}, {"score": 0.003213489259323921, "phrase": "cisco_systems"}, {"score": 0.0029707940194245216, "phrase": "statistically_better_fit"}, {"score": 0.00291743479583421, "phrase": "observed_repair_times"}, {"score": 0.0025697460140513932, "phrase": "repair_times"}, {"score": 0.0021960024679620886, "phrase": "ltln_repair_time_model"}, {"score": 0.0021049977753042253, "phrase": "alternative_process_improvement_strategies"}], "paper_keywords": ["Software defect repair", " Lognormal", " Multiplicative effect"], "paper_abstract": "We hypothesize that software defect repair times can be characterized by the Laplace Transform of the Lognormal (LTLN) distribution. This hypothesis is rooted in the observation that software defect repair times are influenced by the multiplicative interplay of several factors, and the lognormal distribution is a natural choice to model rates of occurrence of such phenomenon. Conversion of the lognormal rate distribution to an occurrence time distribution yields the LTLN. We analyzed a total of more than 10,000 software defect repair times collected over nine products at Cisco Systems to confirm our LTLN hypothesis. Our results also demonstrate that the LTLN distribution provides a statistically better fit to the observed repair times than either of the two most widely used repair time distributions, namely, the lognormal and the exponential. Moreover, we show that the repair times of subsets of defects, partitioned according to the Orthogonal Defect Classification (ODC) scheme also follow the LTLN distribution. Finally, we describe how the insights that lead to the LTLN repair time model allow us to consider and evaluate alternative process improvement strategies.", "paper_title": "A multiplicative model of software defect repair times", "paper_id": "WOS:000276480300004"}