{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "personal_inquiry_learning"}, {"score": 0.048000287634733706, "phrase": "nquire"}, {"score": 0.004530023871441992, "phrase": "software_application"}, {"score": 0.004357511171877593, "phrase": "teacher_support"}, {"score": 0.004076858589744185, "phrase": "student_support"}, {"score": 0.0032290277960438855, "phrase": "learning_flow"}, {"score": 0.003175676186323053, "phrase": "flexible_access"}, {"score": 0.0031405975280029913, "phrase": "current_inquiry_activities"}, {"score": 0.002542890176213921, "phrase": "inquiry_activities"}, {"score": 0.0024323098907299027, "phrase": "different_parts"}, {"score": 0.0021049977753042253, "phrase": "constant_connectivity"}], "paper_keywords": ["Fieldwork learning", " nomadic learning environments", " learning management systems", " instructor interfaces", " collaborative learning tools", " authoring tools", " mobile and personal devices"], "paper_abstract": "This paper describes the development of nQuire, a software application to guide personal inquiry learning. nQuire provides teacher support for authoring, orchestrating, and monitoring inquiries as well as student support for carrying out, configuring, and reviewing inquiries. nQuire allows inquiries to be scripted and configured in various ways, so that personally relevant, rather than off-the- shelf inquiries, can be created and used by teachers and students. nQuire incorporates an approach to specifying learning flow that provides flexible access to current inquiry activities without precluding access to other activities for review and orientation. Dependencies between activities are automatically handled, ensuring decisions made by the student or teacher are propagated through the inquiry. nQuire can be used to support inquiry activities across individual, group, and class levels at different parts of the inquiry and offers a flexible, web-based approach that can incorporate different devices (smart phone, netbook, PC) and does not rely on constant connectivity.", "paper_title": "nQuire: Technological Support for Personal Inquiry Learning", "paper_id": "WOS:000304818500007"}