{"auto_keywords": [{"score": 0.04797130800606528, "phrase": "italic_style_character"}, {"score": 0.046857674197631136, "phrase": "shear_transformation"}, {"score": 0.03714358000531598, "phrase": "italic_style_characters"}, {"score": 0.03297737727610503, "phrase": "considered_character_image"}, {"score": 0.029031686693252064, "phrase": "italic_and_non-italic_style_characters"}, {"score": 0.003988901168289797, "phrase": "proposed_method"}, {"score": 0.003828912548622257, "phrase": "single_character"}, {"score": 0.0033176589215021353, "phrase": "non-italic_style"}, {"score": 0.0031714880645482496, "phrase": "virtual_strokes"}, {"score": 0.0030317376771013703, "phrase": "reverse_transformation"}, {"score": 0.0028046593475268174, "phrase": "structural_information"}, {"score": 0.002770389097966904, "phrase": "extracted_virtual_strokes"}, {"score": 0.0026482660253173075, "phrase": "classification_rule"}, {"score": 0.0025315126622525424, "phrase": "exact_shear_angle"}, {"score": 0.002500571634075998, "phrase": "identified_italic_character"}, {"score": 0.0022385401780982204, "phrase": "mixed_italic_and_normal_style_characters"}, {"score": 0.0021398115287338693, "phrase": "normal_style_characters"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["italic detection", " virtual stroke", " character classification", " italic rectification", " shear transformation"], "paper_abstract": "In this paper, a novel italic detection and rectification method without the prerequisite of character recognition is proposed. An italic style character can be obtained by performing shear transformation on its corresponding non-italic style character. Traditional italic detection methods have to be operated at least on the word, sentence or even the whole paragraph. The merit of the proposed method is that it can be operated directly on a single character so that more accurate statistical information can be obtained. The rationale of our proposed method is that the difference of certain features derived from italic style characters after shear transformation will be canceled, whereas the difference will be more obvious for non-italic style (normal style) characters. In our proposed approach, the virtual strokes embedded in the considered character image are extracted first. Then, reverse transformation is operated on the considered character image. The 26 upper and 26 lower alphabets are classified into three classes based on the structural information of the extracted virtual strokes. The italic and non-italic style characters can then be distinguished based on the classification rule devised for each class of characters. Last, the exact shear angle of the identified italic character is calculated to perform more accurate reverse shear transformation to rectify the italic style character into normal (non-italic) style character to facilitate the later OCR task. Experiments were conducted on 50 document images with mixed italic and normal style characters. Satisfactory accuracy rate 99.59% for italic style characters and 99.85% for normal style characters are achieved. Experimental results verify the validity of our proposed method in distinguishing italic and non-italic style characters.", "paper_title": "Italic detection and rectification", "paper_id": "WOS:000245186700004"}