{"auto_keywords": [{"score": 0.029843544522593482, "phrase": "aiero"}, {"score": 0.016716349673858374, "phrase": "semantic_relationships"}, {"score": 0.01042853041834588, "phrase": "semantic_technologies"}, {"score": 0.009852494196913749, "phrase": "knowledge_management_systems"}, {"score": 0.007778590787479834, "phrase": "concept_pairs"}, {"score": 0.007157102100680998, "phrase": "product_development_processes"}, {"score": 0.00481495049065317, "phrase": "engineering_relationships"}, {"score": 0.004648609688625397, "phrase": "increasingly_popular_role"}, {"score": 0.0038989120088094185, "phrase": "semantic_techniques"}, {"score": 0.0038309141193444015, "phrase": "semantic_relatedness"}, {"score": 0.003477505397536663, "phrase": "novel_approach"}, {"score": 0.0033868916699805224, "phrase": "key_engineering_relationships"}, {"score": 0.003284145698220425, "phrase": "change_management_systems"}, {"score": 0.00304737045343781, "phrase": "meronomic_technique"}, {"score": 0.0029161225023394363, "phrase": "aggregate_measure"}, {"score": 0.002693919110230191, "phrase": "product_development_frameworks"}, {"score": 0.0024451427672857458, "phrase": "consistent_rankings"}, {"score": 0.0024024377855956136, "phrase": "varying_knowledge_frameworks"}, {"score": 0.0022290883852844057, "phrase": "engineering_interdependencies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Semantic relatedness", " Ontology", " Product development", " Change management", " Interdependency", " Consistency checking"], "paper_abstract": "Semantic technologies are playing an increasingly popular role as a means for advancing the capabilities of knowledge management systems. Among these advancements, researchers have successfully leveraged semantic technologies, and their accompanying techniques, to improve the representation and search capabilities of knowledge management systems. This paper introduces a further application of semantic techniques. We explore semantic relatedness as a means of facilitating the development of more \"intelligent\" engineering knowledge management systems. Using semantic relatedness quantifications to analyze and rank concept pairs, this novel approach exploits semantic relationships to help identify key engineering relationships, similar to those leveraged in change management systems, in product development processes. As part of this work, we review several different semantic relatedness techniques, including a meronomic technique recently introduced by the authors. We introduce an aggregate measure, termed \"An Algorithm for Identifying Engineering Relationships in Ontologies,\" or AIERO, as a means to purposely quantify semantic relationships within product development frameworks. To assess its consistency and accuracy, AIERO is tested using three separate, independently developed ontologies. The results indicate AIERO is capable of returning consistent rankings of concept pairs across varying knowledge frameworks. A PCB (printed circuit board) case study then highlights AIERO's unique ability to leverage semantic relationships to systematically narrow where engineering interdependencies are likely to be found between various elements of product development processes. Published by Elsevier Ltd.", "paper_title": "AIERO: An algorithm for identifying engineering relationships in ontologies", "paper_id": "WOS:000328525700013"}