{"auto_keywords": [{"score": 0.048929739366992464, "phrase": "differentiated_knowledge_concept"}, {"score": 0.00436890075128947, "phrase": "single-media_and_multimedia_presentations"}, {"score": 0.004012500850311087, "phrase": "established_multimedia_learning_principles"}, {"score": 0.003939980614608309, "phrase": "acquired_knowledge"}, {"score": 0.0038923605771735838, "phrase": "different_ways"}, {"score": 0.003640516896245813, "phrase": "cognitive_load"}, {"score": 0.0032629585038738856, "phrase": "resulting_kind"}, {"score": 0.003089080923888397, "phrase": "interesting_insight"}, {"score": 0.003051713660488494, "phrase": "multimedia_effects"}, {"score": 0.002751751956416832, "phrase": "learning_goals"}, {"score": 0.002392188222609101, "phrase": "verbal_and_visual_media"}, {"score": 0.0021049977753042253, "phrase": "interesting_differentiated_view"}], "paper_keywords": ["multimedia", " cognitive load", " learning", " testing", " knowledge"], "paper_abstract": "This paper reports on a study investigating the effect of single-media and multimedia presentations on the resulting knowledge. First, this study investigated the stability of established multimedia learning principles by measuring acquired knowledge in different ways. Second, we aimed at testing the effect of cognitive load induced by various media combinations. Third and most important, we investigated the effect of various media combinations on the resulting kind of knowledge using a differentiated knowledge concept. Our study delivered interesting insight about multimedia effects, suggesting that the effect of (multi-) media must be evaluated with regard to the learning goals. Students do not either learn or not learn. Rather various kinds of information can be acquired depending on the representation with verbal and visual media. Experimental research in this domain should apply a more differentiated knowledge concept than often is the case today. Our results offer an interesting differentiated view of the effect of media in this context. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Revising (multi-) media learning principles by applying a differentiated knowledge concept", "paper_id": "WOS:000240364500008"}