{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_wimax_networks"}, {"score": 0.03808744219400253, "phrase": "ranging_requests"}, {"score": 0.004775918707955445, "phrase": "group_mobility"}, {"score": 0.004660702714929615, "phrase": "multiple_mobile_stations"}, {"score": 0.004331393784852601, "phrase": "short_distance"}, {"score": 0.004226856126282259, "phrase": "normal_operation"}, {"score": 0.004124864123845655, "phrase": "mss"}, {"score": 0.00399260264462941, "phrase": "current_serving_bs"}, {"score": 0.003817655499320344, "phrase": "almost_the_same_time"}, {"score": 0.003433909720151841, "phrase": "corresponding_backoff"}, {"score": 0.003217124533918232, "phrase": "handover_latency"}, {"score": 0.0029773436815290215, "phrase": "group_handover_scheme"}, {"score": 0.0029291801502381513, "phrase": "efficient_and_effective_handover_process"}, {"score": 0.0028583875909257766, "phrase": "group_mobility_scenarios"}, {"score": 0.0022933216359142736, "phrase": "proposed_scheme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["WiMAX", " Handover", " Group handover", " Group mobility", " Bridge MS"], "paper_abstract": "Group mobility refers to the scenarios that multiple mobile stations (MSs) move in a group at the same time, generally in the same direction with a short distance of separation. In the normal operation, when the group of MSs moves out of the coverage of the current serving BS and into that of another BS, multiple handovers processes should be performed at almost the same time. Large latency will be incurred due to the collisions of the ranging requests from the MSs in the group and the extra time for the corresponding backoff. Especially, when the number of MSs in the group is larger, the handover latency becomes much more significant and it would affect transmissions seriously. In this paper, we propose a group handover scheme to design an efficient and effective handover process with low latency for the group mobility scenarios in the mobile WiMAX networks. The Bridge MS is introduced to integrate several handover processes for the group of MSs into only one, which could eliminate the collision of the ranging requests and shorten the latency incurred. The results of the evaluation show that much lower handover latency for the group of MSs during the handover could be obtained by the proposed scheme and the improvement becomes significant as the number of MSs is increased in the group. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Group mobility support in mobile WiMAX networks", "paper_id": "WOS:000291846700024"}