{"auto_keywords": [{"score": 0.04706408815174139, "phrase": "implicit_equation"}, {"score": 0.006255973147217109, "phrase": "considered_parameterizations"}, {"score": 0.00481495049065317, "phrase": "implicit_equations"}, {"score": 0.004780334370089564, "phrase": "parametric_curves"}, {"score": 0.0044635893862404385, "phrase": "plane_curve"}, {"score": 0.004213123914295882, "phrase": "considered_curve"}, {"score": 0.004049096735491828, "phrase": "point_position_problem"}, {"score": 0.004005476499933792, "phrase": "intersection_questions"}, {"score": 0.0037806195039533355, "phrase": "moderate_degrees"}, {"score": 0.003529880686744397, "phrase": "extremely_difficult_its_use"}, {"score": 0.002721201438773336, "phrase": "geometric_problem"}, {"score": 0.00251313643823856, "phrase": "so-called_\"polynomial_algebra"}, {"score": 0.0024503217593801587, "phrase": "huge_polynomial_equations"}, {"score": 0.002423882939663573, "phrase": "elimination_theory"}, {"score": 0.002337791830793841, "phrase": "big_structured_and_sparse_numerical_matrices"}, {"score": 0.002279349794239275, "phrase": "well-known_numerical_techniques"}, {"score": 0.0021904435447196884, "phrase": "geometric_questions"}, {"score": 0.00216680270402079, "phrase": "considered_curves"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bezout matrix of two polynomials", " Offsets", " Topology computations", " Computations in the Lagrange basis", " Intersection problems for curves and surfaces"], "paper_abstract": "The availability of the implicit equation of a plane curve or of a 3D surface can be very useful in order to solve many geometric problems involving the considered curve or surface: for example, when dealing with the point position problem or answering intersection questions. On the other hand, it is well known that in most cases, even for moderate degrees, the implicit equation is either difficult to compute or, if computed, the high degree and the big size of the coefficients makes extremely difficult its use in practice. We will show that, for several problems involving plane curves, 3D surfaces and some of their constructions (for example, offsets), it is possible to use the implicit equation (or, more precisely, its properties) without needing to explicitly determine it. We replace the computation of the implicit equation with the evaluation of the considered parameterizations in a set of points. We then translate the geometric problem in hand, into one or several generalized eigenvalue problems on matrix pencils (depending again on several evaluations of the considered parameterizations). This is the so-called \"polynomial algebra by values\" approach where the huge polynomial equations coming from Elimination Theory (e.g., using resultants) are replaced by big structured and sparse numerical matrices. For these matrices there are well-known numerical techniques allowing to provide the results we need to answer the geometric questions on the considered curves and surfaces. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Using implicit equations of parametric curves and surfaces without computing them: Polynomial algebra by values", "paper_id": "WOS:000313026100009"}