{"auto_keywords": [{"score": 0.048670301158495306, "phrase": "research_productivity"}, {"score": 0.010099963552108114, "phrase": "inbred_and_non-inbred_faculty"}, {"score": 0.007317636575329239, "phrase": "top_journals"}, {"score": 0.007102870547025405, "phrase": "academic_seniority"}, {"score": 0.00703268184016045, "phrase": "grant_history"}, {"score": 0.006826221466476516, "phrase": "law_school"}, {"score": 0.00481495049065317, "phrase": "australian_law_schools"}, {"score": 0.004513269137584821, "phrase": "australian"}, {"score": 0.0040048667115255, "phrase": "top_law_journals"}, {"score": 0.0036250779580069455, "phrase": "academic's_home_law_review"}, {"score": 0.0035183010916001664, "phrase": "silver-corded_faculty"}, {"score": 0.0028394925080958205, "phrase": "alternative_measures"}, {"score": 0.0026480044868438875, "phrase": "statistically_significant_difference"}, {"score": 0.0024327171018928458, "phrase": "different_ways"}, {"score": 0.002349228457383314, "phrase": "alternative_econometric_approaches"}, {"score": 0.0023028105026714533, "phrase": "two-stage_least_squares"}, {"score": 0.0021049977753042253, "phrase": "legal_academic"}], "paper_keywords": ["Research productivity", " Law schools", " Australia", " Academic inbreeding"], "paper_abstract": "This study compares the research productivity and impact of inbred and non-inbred faculty employed at Australian law schools. The sample consists of 429 academics, employed at 21 law schools. To measure research productivity and impact we use articles published in top law journals, defined in six different ways, as well as total citations and two different citation indices. We report results including, and excluding, publications in the academic's home law review. We find evidence that silver-corded faculty outperform other faculty on one of the measures of publications in top journals, once the endogeneity of academic seniority, grant history and the status of the law school at which the individual is employed is addressed, but this finding is not robust across alternative measures of articles published in the top journals. We find that there is no statistically significant difference between the research productivity and impact of inbred and non-inbred faculty. This finding is robust to a range of different ways of measuring research productivity and impact and alternative econometric approaches, including using two-stage least squares to address the endogeneity of academic seniority, grant history and the status of the law school at which the legal academic is employed.", "paper_title": "Academic inbreeding and research productivity and impact in Australian law schools", "paper_id": "WOS:000329319200038"}