{"auto_keywords": [{"score": 0.025401215326633537, "phrase": "proposed_method"}, {"score": 0.014628171571980155, "phrase": "self-calibration_method"}, {"score": 0.014336153594212876, "phrase": "uncontrolled_environments"}, {"score": 0.00481495049065317, "phrase": "one-dimensional_information"}, {"score": 0.004731638279336065, "phrase": "controlled_and_uncontrolled_environments"}, {"score": 0.004582608049002167, "phrase": "coordinate_conversions"}, {"score": 0.004542780650208743, "phrase": "two-dimensional_image"}, {"score": 0.004503297824977738, "phrase": "real_three-dimensional_world"}, {"score": 0.004412494693940597, "phrase": "camera_calibration"}, {"score": 0.0043487535506391275, "phrase": "scene_geometry"}, {"score": 0.004248669251109869, "phrase": "reliable_feature_correspondences"}, {"score": 0.003916098498242888, "phrase": "object-based_calibration_methods"}, {"score": 0.003859500298805362, "phrase": "self-calibration_methods"}, {"score": 0.0037596691909408666, "phrase": "known_geometry"}, {"score": 0.0035989687070420977, "phrase": "geometric_knowledge"}, {"score": 0.00357806560856829, "phrase": "calibration_objects"}, {"score": 0.003516079377293321, "phrase": "simplest_geometry"}, {"score": 0.0034753508746887957, "phrase": "calibration_object"}, {"score": 0.0032786537599187125, "phrase": "uncontrolled_environment"}, {"score": 0.003193798849508512, "phrase": "existing_methods"}, {"score": 0.002952146666681891, "phrase": "object-based_method"}, {"score": 0.0027931086065664354, "phrase": "existing_object-based_calibration"}, {"score": 0.0027287285441182133, "phrase": "new_camera_calibration_method"}, {"score": 0.002331221840164716, "phrase": "simulated_data"}, {"score": 0.0023176647900094226, "phrase": "real_data"}, {"score": 0.0021927323694667694, "phrase": "human_walking_sequence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Camera calibration", " Pin-hole camera model", " One-dimensional calibration object"], "paper_abstract": "Camera model and its calibration are required in many applications for coordinate conversions between the two-dimensional image and the real three-dimensional world. Self-calibration method is usually chosen for camera calibration in uncontrolled environments because the scene geometry could be unknown. However when no reliable feature correspondences can be established or when the camera is static in relation to the majority of the scene, self-calibration method fails to work. On the other hand, object-based calibration methods are more reliable than self-calibration methods due to the existence of the object with known geometry. However, most object-based calibration methods are unable to work in uncontrolled environments because they require the geometric knowledge on calibration objects. Though in the past few years the simplest geometry required for a calibration object has been reduced to a 1D object with at least three points, it is still not easy to find such an object in an uncontrolled environment, not to mention the additional metric/motion requirement in the existing methods. Meanwhile, it is very easy to find a 1D object with two end points in most scenes. Thus, it would be very worthwhile to investigate an object-based method based on such a simple object so that it would still be possible to calibrate a camera when both self-calibration and existing object-based calibration fail to work. We propose a new camera calibration method which requires only an object with two end points, the simplest geometry that can be extracted from many real-life objects. Through observations of such a 1D object at different positions/orientations on a plane which is fixed in relation to the camera, both intrinsic (focal length) and extrinsic (rotation angles and translations) camera parameters can be calibrated using the proposed method. The proposed method has been tested on simulated data and real data from both controlled and uncontrolled environments, including situations where no explicit 1D calibration objects are available, e.g. from a human walking sequence. Very accurate camera calibration results have been achieved using the proposed method. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Camera calibration using one-dimensional information and its applications in both controlled and uncontrolled environments", "paper_id": "WOS:000273094100057"}