{"auto_keywords": [{"score": 0.03599653595516879, "phrase": "alignment_methods"}, {"score": 0.03217160122346606, "phrase": "information_dyad"}, {"score": 0.00481495049065317, "phrase": "requirements_engineering"}, {"score": 0.004589763483242731, "phrase": "mature_areas"}, {"score": 0.003789137457228946, "phrase": "respective_areas"}, {"score": 0.0035544816252832375, "phrase": "new_opportunities"}, {"score": 0.003255295296893174, "phrase": "rest_taxonomy"}, {"score": 0.0031152526492532785, "phrase": "emerging_dimensions"}, {"score": 0.0030781126453776697, "phrase": "resulting_concept"}, {"score": 0.002623111480310373, "phrase": "thirteen_alignment_methods"}, {"score": 0.0025405019456703325, "phrase": "assessment_framework"}, {"score": 0.0024311346712789553, "phrase": "industrial_assessment"}, {"score": 0.0023451553255837317, "phrase": "low_effort"}, {"score": 0.0022803854904010347, "phrase": "rest_alignment"}, {"score": 0.0021049977753042253, "phrase": "valid_and_useful_construct"}], "paper_keywords": ["Theory", " Documentation", " Management", " Alignment", " software process assessment", " software testing", " taxonomy"], "paper_abstract": "Requirements Engineering and Software Testing are mature areas and have seen a lot of research. Nevertheless, their interactions have been sparsely explored beyond the concept of traceability. To fill this gap, we propose a definition of requirements engineering and software test (REST) alignment, a taxonomy that characterizes the methods linking the respective areas, and a process to assess alignment. The taxonomy can support researchers to identify new opportunities for investigation, as well as practitioners to compare alignment methods and evaluate alignment, or lack thereof. We constructed the REST taxonomy by analyzing alignment methods published in literature, iteratively validating the emerging dimensions. The resulting concept of an information dyad characterizes the exchange of information required for any alignment to take place. We demonstrate use of the taxonomy by applying it on five in-depth cases and illustrate angles of analysis on a set of thirteen alignment methods. In addition, we developed an assessment framework (REST-bench), applied it in an industrial assessment, and showed that it, with a low effort, can identify opportunities to improve REST alignment. Although we expect that the taxonomy can be further refined, we believe that the information dyad is a valid and useful construct to understand alignment.", "paper_title": "A Taxonomy for Requirements Engineering and Software Test Alignment", "paper_id": "WOS:000334997700006"}