{"auto_keywords": [{"score": 0.023553299383942187, "phrase": "tor"}, {"score": 0.00481495049065317, "phrase": "mobile_cloud_environments"}, {"score": 0.004746065479362881, "phrase": "increasing_spread"}, {"score": 0.0047006879240764935, "phrase": "mobile_cloud_computing_paradigm"}, {"score": 0.004611224230543916, "phrase": "traditional_mobile_communication_infrastructure"}, {"score": 0.004148631410346188, "phrase": "offload_computations"}, {"score": 0.003714368305523811, "phrase": "mobile_cloud"}, {"score": 0.0036788184374592706, "phrase": "new_privacy_risks"}, {"score": 0.0036261282565554507, "phrase": "personal_information"}, {"score": 0.0035741900278634616, "phrase": "communicating_users"}, {"score": 0.003138874040786261, "phrase": "end-to-end_anonymous_communication_protocol"}, {"score": 0.0029627701619228527, "phrase": "social_networks"}, {"score": 0.0028235667474151714, "phrase": "adversary_model"}, {"score": 0.0021771713131746636, "phrase": "real_testbed"}, {"score": 0.0021356322417874106, "phrase": "relative_clones"}], "paper_keywords": ["Anonymity", " mobile cloud computing", " mobile communications", " smartphone clones"], "paper_abstract": "The increasing spread of mobile cloud computing paradigm is changing the traditional mobile communication infrastructure. Today, smartphones can rely on virtual (software) \"clones\" in the cloud, offering backup/recovery solutions as well as the possibility to offload computations. As a result, clones increase the communication and computation capabilities of smartphones, making their limited batteries last longer. Unfortunately, mobile cloud introduces new privacy risks, since personal information of the communicating users is distributed among several parties (e. g., cellular network operator, cloud provider). In this paper, we propose a solution implementing an end-to-end anonymous communication protocol between two users in the network, which leverages properties of social networks and ad hoc wireless networks. We consider an adversary model where each party observing a portion of the communication possibly colludes with others to uncover the identity of communicating users. We then extensively analyze the security of our protocol and the anonymity preserved against the above adversaries. Most importantly, we assess the performance of our solution by comparing it to Tor on a real testbed of 36 smartphones and relative clones running on Amazon EC2 platform.", "paper_title": "An Anonymous End-to-End Communication Protocol for Mobile Cloud Environments", "paper_id": "WOS:000342132300005"}