{"auto_keywords": [{"score": 0.039150156501511525, "phrase": "software_reliability_modeling"}, {"score": 0.0370524624129902, "phrase": "systematic_mapping_study"}, {"score": 0.00481495049065317, "phrase": "systematic_mapping_study_of_software_reliability_modeling"}, {"score": 0.004604136423327813, "phrase": "highly_active_and_dynamic_research_area"}, {"score": 0.004313793774439379, "phrase": "rich_body"}, {"score": 0.004091370602573054, "phrase": "considerable_complexity"}, {"score": 0.0029291801502381513, "phrase": "increasing_diversity"}, {"score": 0.0028006988338192375, "phrase": "software_reliability_growth_models"}, {"score": 0.0025918745925152423, "phrase": "static_and_architectural_characteristics"}, {"score": 0.002529213370528279, "phrase": "artificial_intelligence"}, {"score": 0.002508663916554954, "phrase": "automatic_learning_techniques"}, {"score": 0.0023026973099101876, "phrase": "academic_environments"}, {"score": 0.002283984048569816, "phrase": "industrial_initiatives"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software Reliability", " Modeling", " Systematic Mapping", " Taxonomy"], "paper_abstract": "Context: Software Reliability (SR) is a highly active and dynamic research area. Published papers have approached this topic from various and heterogeneous points of view, resulting in a rich body of literature on this topic. The counterpart to this is the considerable complexity of this body of knowledge. Objective: The objective of this study is to obtain a panorama and a taxonomy of Software Reliability Modeling (SRM). Method: In order to do this, a Systematic Mapping Study (SMS) which analyzes and structures the literature on Software Reliability Modeling has been carried out. Results: A total of 972 works were obtained as a result of the Systematic Mapping Study. On the basis of the more than 500 selected primary studies found, the results obtained show an increasing diversity of work. Conclusion: Although it was discovered that Software Reliability Growth Models (SRGM) are still the most common modeling technique, it was also found that both the modeling based on static and architectural characteristics and the models based on Artificial Intelligence and automatic learning techniques are increasingly more apparent in literature. We have also observed that most Software Reliability Modeling efforts take place in the Pacific Rim area and in academic environments. Industrial initiatives are as yet marginal, and would appear to be primarily located in the USA. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A Systematic Mapping Study of Software Reliability Modeling", "paper_id": "WOS:000337261800002"}