{"auto_keywords": [{"score": 0.03408663291404538, "phrase": "audio_data"}, {"score": 0.00481495049065317, "phrase": "transformation_of_audio_signals_using_dictionary"}, {"score": 0.004539005582217305, "phrase": "dictionary-based_methods"}, {"score": 0.0041827333568982055, "phrase": "specifically_audio_and_music_signals"}, {"score": 0.0038895008852940323, "phrase": "analytical_counterparts"}, {"score": 0.00385431710959668, "phrase": "granular_synthesis"}, {"score": 0.0036497740708342093, "phrase": "linear_combination"}, {"score": 0.0036167509502276294, "phrase": "heterogeneous_atoms"}, {"score": 0.0035515951985356374, "phrase": "user-defined_dictionary"}, {"score": 0.0034560481756572632, "phrase": "parametric_model"}, {"score": 0.00334780964309978, "phrase": "novel_ways"}, {"score": 0.0031271133933467575, "phrase": "higher-level_structured_representations"}, {"score": 0.0027159094186967247, "phrase": "efficient_representation"}, {"score": 0.0026069623057065664, "phrase": "clear_correspondence"}, {"score": 0.0023694065215394593, "phrase": "multiresolution_atomic_models"}, {"score": 0.002133937537670312, "phrase": "sound_transformations"}, {"score": 0.0021049977753042253, "phrase": "atomic_representations"}], "paper_keywords": [""], "paper_abstract": "In this article we provide an overview of dictionary-based methods (DBMs)also called sparse approximation and atomic decompositionand review our recent work on their application to working with data, specifically audio and music signals. As Fourier analysis is to additive synthesis, DBMs can be seen as the analytical counterparts to granular synthesis since they describe how a given signal can be built by a linear combination of heterogeneous atoms selected from a user-defined dictionary. We demonstrate how a parametric model produced by a DBM can provide novel ways for analysing, visualizing, and transforming audio data. We describe methods of building higher-level structured representations by agglomerating atoms into molecules. We discuss our new measures of efficiency and meaningfulness, and show how they can be applied to aid in the analysis and pursuit of an efficient representation of data, and one that manifests a clear correspondence between its elements and the structures in the data. We also present our work on building an interface for working with multiresolution atomic models produced by DBMs, which facilitates the analysis, visualization, and transformation of audio data. Finally, we discuss four classes of sound transformations possible with atomic representations.", "paper_title": "Analysis, Visualization, and Transformation of Audio Signals Using Dictionary-based Methods", "paper_id": "WOS:000274674900001"}