{"auto_keywords": [{"score": 0.04213761469410892, "phrase": "bp"}, {"score": 0.010286685373616789, "phrase": "business_process"}, {"score": 0.007068947196379613, "phrase": "agent-oriented_framework"}, {"score": 0.00481495049065317, "phrase": "business_processes"}, {"score": 0.004434824354230475, "phrase": "business_professionals"}, {"score": 0.0043148760739240575, "phrase": "business_rules"}, {"score": 0.003927625349474979, "phrase": "current_techniques"}, {"score": 0.0036198070096220164, "phrase": "bp."}, {"score": 0.0034782306784111525, "phrase": "data_warehouses"}, {"score": 0.0034510635632071978, "phrase": "raw_data"}, {"score": 0.0031907572162427978, "phrase": "system_integration"}, {"score": 0.002727409429089543, "phrase": "business_structure"}, {"score": 0.002695499916264666, "phrase": "brs"}, {"score": 0.0021049977753042253, "phrase": "case_study"}], "paper_keywords": ["agent", " agent-oriented framework", " business processes (BPs)", " business rules (BRs)", " component-based development", " integration", " process automation"], "paper_abstract": "Every action a business process performs must be explicitly anticipated, designed for, and implemented by business professionals. The business process is dependent upon business rules (BRs) to achieve its objectives, which also involve pre- and post-conditions in the business process (BP). Most of the current techniques implement these rules directly into BPs. This will result in the BP becoming even more complicated and harder to customize. Most BRs (and laws) are buried in data warehouses as raw data. Incorporating the BRs into any BP is very complex, in terms of customization, reuse, and system integration. To overcome this problem, we propose and implement an agent-oriented framework. Using this framework, we can make the process of incorporating BR into BP less complex. The agent creates a bridge between components of the business structure, the BRs, and the BP. The BP consists of activities and sub-activities. The agent is able to communicate with BP and BRs to execute a BP. The agent can also communicate with other agents and have control over their own internal states and behavior. In this paper, we propose and implement a simple case study to execute a BP dependent upon BRs. The case study shows how the agent will synchronize, integrate, and deploy the BP.", "paper_title": "A novel approach toward integration of rules into business processes using an agent-oriented framework", "paper_id": "WOS:000242807800001"}