{"auto_keywords": [{"score": 0.049593242225692294, "phrase": "cloud_computing"}, {"score": 0.00481495049065317, "phrase": "insider_attacks"}, {"score": 0.004598933498016774, "phrase": "significant_cost_reductions"}, {"score": 0.004392565073466714, "phrase": "security_concerns"}, {"score": 0.004238452771031322, "phrase": "potential_barrier"}, {"score": 0.00411064950774695, "phrase": "public_clouds"}, {"score": 0.003946235220504501, "phrase": "priorities"}, {"score": 0.0037498152007206815, "phrase": "trusted_cloud_models"}, {"score": 0.003334309053314909, "phrase": "new_research"}, {"score": 0.0031360786664165093, "phrase": "security_aspects"}, {"score": 0.0029951555610569225, "phrase": "cascade_effects"}, {"score": 0.00290473242917264, "phrase": "detailed_modelling"}, {"score": 0.002831462722290752, "phrase": "vulnerability_landscape"}, {"score": 0.0025826247025542213, "phrase": "insider_threats"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["internal attacks", " insider attacks", " cloud computing", " insider threat", " cloud computing security"], "paper_abstract": "Cloud computing offers the potential for significant cost reductions and increased agility for users. However, security concerns continue to be raised as a potential barrier to uptake for private, community and public clouds. A report from the European Network and Information Security Agency on the Priorities for Research on Current and Emerging Network Technologies highlighted trusted cloud models as one of its top priorities for further research. More recentlySeptember 2012Carnegie Mellon University's computer emergency response team have released a paper describing insider threats to cloud computing as a direction for new research. Further, a project completed at the University of Warwick in 2010 investigated security aspects of cloud computing and in particular the potential for cascade effects. This research involved a detailed modelling of the threat and vulnerability landscape, including the incentives and motivations that might drive attackers. One of the conclusions is that insider threats potentially pose the most significant source of risk. This paper presents the progress made on furthering this research by investigating what attacks are available to insiders together with the damage and implications of such attacks. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "An overview of insider attacks in cloud computing", "paper_id": "WOS:000358507500006"}