{"auto_keywords": [{"score": 0.04346602708671803, "phrase": "quantitative_reasoning"}, {"score": 0.00481495049065317, "phrase": "health_risk_communication"}, {"score": 0.004630150894006861, "phrase": "recent_experimental_and_focus_group_research"}, {"score": 0.0044524122425287005, "phrase": "quantitative_health_risks"}, {"score": 0.004010960493946656, "phrase": "behavioral_intentions"}, {"score": 0.003958937342925219, "phrase": "still_others"}, {"score": 0.003924629168434799, "phrase": "viewers'_likes"}, {"score": 0.003856898743576605, "phrase": "graphical_features"}, {"score": 0.0033699898113395328, "phrase": "whole_relationships"}, {"score": 0.002770150086489194, "phrase": "perceived_risk"}, {"score": 0.002722288966917744, "phrase": "risk-averse_behavior"}, {"score": 0.002663620639539737, "phrase": "design_features"}, {"score": 0.002629026692001082, "phrase": "visual_simplicity"}, {"score": 0.0025389513338018414, "phrase": "accurate_quantitative_judgments"}, {"score": 0.0023168823213024856, "phrase": "patients'_interpretations"}, {"score": 0.0022084059770026416, "phrase": "potentially_useful_directions"}, {"score": 0.0021892345747666977, "phrase": "continuing_research"}, {"score": 0.002151388538895855, "phrase": "educational_level"}, {"score": 0.0021049977753042253, "phrase": "successful_ways"}], "paper_keywords": [""], "paper_abstract": "This review describes recent experimental and focus group research on graphics as a method of communication about quantitative health risks. Some of the studies discussed in this review assessed. effect of graphs on quantitative reasoning, others assessed effects on behavior or behavioral intentions, and still others assessed viewers' likes and dislikes. Graphical features that improve the accuracy of quantitative reasoning appear to differ from the features most likely to alter behavior or intentions. For example, graphs that make part-to-whole relationships available visually may help people attend to the relationship between the numerator (the number of people affected by a hazard) and the denominator (the entire population at risk), whereas graphs that show only the numerator appear to inflate the perceived risk and may induce risk-averse behavior. Viewers often preferred design features such as visual simplicity and familiarity that were not associated with accurate quantitative judgments. Communicators should not assume that all graphics are more intuitive than text; many of the studies found that patients' interpretations of the graphics were dependent upon expertise or instruction. Potentially useful directions for continuing research include interactions with educational level, and numeracy and successful ways to communicate uncertainty about risk.", "paper_title": "Design features of graphs in health risk communication: A systematic review", "paper_id": "WOS:000242430300004"}