{"auto_keywords": [{"score": 0.046176417880494244, "phrase": "rule_configuration"}, {"score": 0.04400237804838215, "phrase": "network_security_policies"}, {"score": 0.0424362872006279, "phrase": "security_consistency"}, {"score": 0.00481495049065317, "phrase": "firewall_rule_validation"}, {"score": 0.004666043394407466, "phrase": "current_internet"}, {"score": 0.0045789085863942825, "phrase": "entire_network"}, {"score": 0.004153866009835335, "phrase": "network_security"}, {"score": 0.0038158228131483854, "phrase": "cooperative_firewalls"}, {"score": 0.003756298824153418, "phrase": "large-scale_and_multifirewall-equipped_network"}, {"score": 0.003418095799317472, "phrase": "acl"}, {"score": 0.0030713353414700295, "phrase": "network_operator"}, {"score": 0.0030044208366869205, "phrase": "network_functions"}, {"score": 0.0028749210987951677, "phrase": "visualized_validation_system"}, {"score": 0.0026741446768534824, "phrase": "developed_validation_system"}, {"score": 0.0026490090146527407, "phrase": "three-tiered_visualization_hierarchy"}, {"score": 0.0026241089938360634, "phrase": "different_compound_viewpoints"}, {"score": 0.0025750071068101356, "phrase": "complete_picture"}, {"score": 0.002510960575700234, "phrase": "error_debugging"}, {"score": 0.0024951987856762646, "phrase": "anomaly_removal"}, {"score": 0.002380089119791563, "phrase": "security_inconsistency"}, {"score": 0.002213793650525558, "phrase": "firewall_configuration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Defense in depth", " Firewall security consistency", " System visualization", " Rule anomalies", " Behavior mismatching"], "paper_abstract": "Firewall is one of the most critical elements of the current Internet, which can protect the entire network against attacks and threats. While configuring the firewalls, rule configuration has to conform to, or say be consistent with, the demands of the network security policies such that the network security would not be flawed. For the security consistency, firewall rule editing, ordering, and distribution must be done very carefully on each of the cooperative firewalls, especially in a large-scale and multifirewall-equipped network. Nevertheless, a network operator is prone to incorrectly configure the firewalls because there are typically thousands or hundreds of filtering/admission rules (i.e., rules in the Access Control List file, or ACL for short), which could be set up in a firewall; not mentioning these rules among firewalls affect mutually and can make the matter worse. Under this situation, the network operator would hardly know his/her misconfiguration until the network functions beyond the expectation. For this reason, our work is to build a visualized validation system for facilitating the check of security consistency between the rule configuration of firewalls and the demands of network security policies. To do so, the developed validation system utilizes a three-tiered visualization hierarchy along with different compound viewpoints to provide users with a complete picture of firewalls and relationships among them for error debugging and anomaly removal. In addition, in this paper, we also enumerate the source of security inconsistency while setting ACLs and make use of it as a basis of the design of our visualization model. Currently, part of the firewall configuration of our campus network has been used as our system's input to demonstrate our system's implementation. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A novel three-tiered visualization approach for firewall rule validation", "paper_id": "WOS:000297388700001"}