{"auto_keywords": [{"score": 0.0369875767325547, "phrase": "universal_semantics"}, {"score": 0.011020916632311783, "phrase": "clock_rates"}, {"score": 0.009377454020752645, "phrase": "existential_semantics"}, {"score": 0.008286678829735149, "phrase": "regular_set"}, {"score": 0.00481495049065317, "phrase": "distributed_timed_automata"}, {"score": 0.004769182299692333, "phrase": "independently_evolving_clocks"}, {"score": 0.004612376827433774, "phrase": "distributed_timed_systems"}, {"score": 0.004482063543727601, "phrase": "timed_automaton"}, {"score": 0.004376273644295806, "phrase": "local_clocks"}, {"score": 0.0033166379485150507, "phrase": "individual_components"}, {"score": 0.0032382660477699695, "phrase": "natural_choice"}, {"score": 0.0031018195951638882, "phrase": "positive_specification"}, {"score": 0.0029711052657054463, "phrase": "negative_specification"}, {"score": 0.002166349705365602, "phrase": "reactive_semantics"}, {"score": 0.0021049977753042253, "phrase": "positive_specifications"}], "paper_keywords": ["timed automata", " distributed systems"], "paper_abstract": "We propose a model of distributed timed systems where each component is a timed automaton with a set of local clocks that evolve at a rate independent of the clocks of the other components. A clock can be read by any component in the system, but it can only be reset by the automaton it belongs to. There are two natural semantics for such systems. The universal semantics captures behaviors that hold under any choice of clock rates for the individual components. This is a natural choice when checking that a system always satisfies a positive specification. To check if a system avoids a negative specification, it is better to use the existential semantics-the set of behaviors that the system can possibly exhibit under some choice of clock rates. We show that the existential semantics always describes a regular set of behaviors. However, in the case of universal semantics, checking emptiness or universality turns out to be undecidable. As an alternative to the universal semantics, we propose a reactive semantics that allows us to check positive specifications and yet describes a regular set of behaviors.", "paper_title": "Distributed Timed Automata with Independently Evolving Clocks", "paper_id": "WOS:000333422700001"}