{"auto_keywords": [{"score": 0.04449434168162259, "phrase": "new_social_norms"}, {"score": 0.03744933760730154, "phrase": "social_goal"}, {"score": 0.03668569649960335, "phrase": "social_norm"}, {"score": 0.03267875483465419, "phrase": "allowed_proposals"}, {"score": 0.03070954352294603, "phrase": "norm_negotiation"}, {"score": 0.00481495049065317, "phrase": "multiagent_systems"}, {"score": 0.004774115617883476, "phrase": "normative_multiagent_systems"}, {"score": 0.004497762477097628, "phrase": "social_norms"}, {"score": 0.0040779081518317415, "phrase": "negotiation_model"}, {"score": 0.003776750773624222, "phrase": "agent_desires"}, {"score": 0.0036813725040313002, "phrase": "individual_agents"}, {"score": 0.0036191240628152205, "phrase": "social_goals"}, {"score": 0.0030645676308053444, "phrase": "social_goal_negotiation"}, {"score": 0.0029998918671747168, "phrase": "individual_agent_desires"}, {"score": 0.0021688641066186817, "phrase": "agents'_desires"}, {"score": 0.0021049977753042253, "phrase": "contract_negotiation"}], "paper_keywords": ["normative multiagent systems", " negotiation", " emergence of norms"], "paper_abstract": "Normative multiagent systems provide agents with abilities to autonomously devise societies and organizations coordinating their behavior via social norms and laws. In this paper, we study how agents negotiate new social norms and when they accept them. We introduce a negotiation model based on what we call the social delegation cycle, which explains the negotiation of new social norms from agent desires in three steps. First, individual agents or their representatives negotiate social goals, then a social goal is negotiated in a social norm, and. finally the social norm is accepted by the agents when it leads to fulfillment of the desires the cycle started with. We characterize the allowed proposals during social goal negotiation as mergers of the individual agent desires, and we characterize the allowed proposals during norm negotiation as both joint plans to achieve the social goal (obligations associated with the norm) and the associated sanctions or rewards (a control system associated with the norm). The norm is accepted when the norm is stable in the sense that agents will act according to the norm, and effective in the sense that fulfillment of the norm leads to achievement of the agents' desires. We also compare norm negotiation with contract negotiation and negotiation of the distribution of obligations.", "paper_title": "Norm negotiation in multiagent systems", "paper_id": "WOS:000250860400006"}