{"auto_keywords": [{"score": 0.04854647457237971, "phrase": "high_launch_power"}, {"score": 0.00481495049065317, "phrase": "optical_amplifier"}, {"score": 0.004570759604335229, "phrase": "corresponding_self-phase_modulation"}, {"score": 0.004511747571832593, "phrase": "spm"}, {"score": 0.004367228576339114, "phrase": "dispersion-induced_power_fading"}, {"score": 0.004282787299993434, "phrase": "insufficient_loss_budget"}, {"score": 0.0037112756920669593, "phrase": "passive_optical_network"}, {"score": 0.0034099718632933027, "phrase": "proposed_comprehensive_transmission_model"}, {"score": 0.0029933487820771217, "phrase": "spm_effect"}, {"score": 0.0026969099161088398, "phrase": "ssii_cancellation"}, {"score": 0.0024616504443079512, "phrase": "inline_amplifier"}, {"score": 0.002232261129770455, "phrase": "proposed_lr-pon"}], "paper_keywords": ["Digital signal processing", " Long-reach PON", " Nonlinear distortion", " OFDM"], "paper_abstract": "This work utilizes high launch power and the corresponding self-phase modulation (SPM) effect to combat dispersion-induced power fading and the insufficient loss budget of an intensity modulation and direct detection (IMDD) orthogonal frequency division multiplexing (OFDM) 60 km long-reach passive optical network (LR-PON). In addition, based on the proposed comprehensive transmission model, the subcarrier-to-subcarrier intermixing interference (SSII) cancellation scheme is applied to simultaneously eliminate the nonlinear distortions caused by the interplay among dispersion, the SPM effect, and the modulator-induced nonlinearity and chirp. Thanks to the high launch power and SSII cancellation, 40 and 50 Gbps 60 km OFDM transmission is successfully demonstrated to show 33 and 28 dB loss budgets, respectively, without an inline amplifier or preamplifier. Hence, by employing a 10 GHz electro-absorption modulator and PIN detector, the proposed LR-PON can economically support 64 or 32 optical network users with a capacity of 50 or 40 Gbps.", "paper_title": "High-Capacity and High-Loss-Budget OFDM Long-Reach PON Without an Optical Amplifier", "paper_id": "WOS:000346864200015"}