{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "antispoofing_schemes"}, {"score": 0.049479057100967845, "phrase": "fingerprint_recognition_systems"}, {"score": 0.043057418799981796, "phrase": "artificial_fingers"}, {"score": 0.004298134888203576, "phrase": "biometrics_literature"}, {"score": 0.003959594975607075, "phrase": "play-doh"}, {"score": 0.0037409118365761894, "phrase": "fingerprint_ridges"}, {"score": 0.003579179502431823, "phrase": "commercial_fingerprint_recognition_systems"}, {"score": 0.0031346115554600003, "phrase": "ensuing_fingerprint_images"}, {"score": 0.0026935568995690947, "phrase": "live_fingerprints"}, {"score": 0.0026597250663309385, "phrase": "spoof_artifacts"}, {"score": 0.0021049977753042253, "phrase": "fingerprint_antispoofing"}], "paper_keywords": ["Design", " Algorithms", " Performance", " Biometrics", " fingerprints", " antispoofing", " person verification", " liveness detection"], "paper_abstract": "Several issues related to the vulnerability of fingerprint recognition systems to attacks have been highlighted in the biometrics literature. One such vulnerability involves the use of artificial fingers, where materials such as Play-Doh, silicone, and gelatin are inscribed with fingerprint ridges. Researchers have demonstrated that some commercial fingerprint recognition systems can be deceived when these artificial fingers are placed on the sensor; that is, the system successfully processes the ensuing fingerprint images, thereby allowing an adversary to spoof the fingerprints of another individual. However, at the same time, several countermeasures that discriminate between live fingerprints and spoof artifacts have been proposed. While some of these antispoofing schemes are hardware based, several software-based approaches have been proposed as well. In this article, we review the literature and present the state of the art in fingerprint antispoofing.", "paper_title": "A Survey on Antispoofing Schemes for Fingerprint Recognition Systems", "paper_id": "WOS:000351437800014"}