{"auto_keywords": [{"score": 0.004764859786310636, "phrase": "minimal_generalized_precedence_relations"}, {"score": 0.004475022550508119, "phrase": "limited_information"}, {"score": 0.004428452434981208, "phrase": "future_events"}, {"score": 0.0035176353680157367, "phrase": "fuzzy_heuristic_model"}, {"score": 0.0034088473318056537, "phrase": "minimal_feeding"}, {"score": 0.003320756562046789, "phrase": "generalized_precedence_relations"}, {"score": 0.0032689949867583633, "phrase": "realistic_approach"}, {"score": 0.0030062165552187086, "phrase": "discretionary_way"}, {"score": 0.0029593432468318745, "phrase": "fuzzy_algorithm"}, {"score": 0.0027936239349923464, "phrase": "optimal_fragmentation"}, {"score": 0.0026649432435828842, "phrase": "critical_path"}, {"score": 0.002301211274459965, "phrase": "better_performance"}, {"score": 0.0022299587520401747, "phrase": "visual_basic_for_applications"}, {"score": 0.0021049977753042253, "phrase": "five_different_scenarios"}], "paper_keywords": [""], "paper_abstract": "In scheduling, estimations are affected by the imprecision of limited information on future events, and the reduction in the number and level of detail of activities. Overlapping of processes and activities requires the study of their continuity, along with analysis of the risks associated with imprecision. In this line, this article proposes a fuzzy heuristic model for the Project Scheduling Problem with flows and minimal feeding, time and work Generalized Precedence Relations with a realistic approach to overlapping, in which the continuity of processes and activities is allowed in a discretionary way. This fuzzy algorithm handles the balance of process flows, and computes the optimal fragmentation of tasks, avoiding the interruption of the critical path and reverse criticality. The goodness of this approach is tested on several problems found in the literature; furthermore, an example of a 15-story building was used to compare the better performance of the algorithm implemented in Visual Basic for Applications (Excel) over that same example input in Primavera (c) P6 Professional V8.2.0, using five different scenarios.", "paper_title": "The Fuzzy Project Scheduling Problem with Minimal Generalized Precedence Relations", "paper_id": "WOS:000362377400003"}