{"auto_keywords": [{"score": 0.03263663864808081, "phrase": "approximated_mean"}, {"score": 0.00481495049065317, "phrase": "new_fast_algorithm"}, {"score": 0.004449688143230257, "phrase": "new_wilson-based_editing_procedure"}, {"score": 0.0040949726088047225, "phrase": "greedy_approach"}, {"score": 0.003799878496075633, "phrase": "approximate_mean"}, {"score": 0.0037527984559873745, "phrase": "new_dataset_editing_scheme"}, {"score": 0.003600022318864217, "phrase": "wilson_editing_procedure"}, {"score": 0.0033824008297657494, "phrase": "artificial_instance"}, {"score": 0.0031254704616199614, "phrase": "new_artificial_instance"}, {"score": 0.003048449231088915, "phrase": "misclassified_sample"}, {"score": 0.0028760125558659907, "phrase": "proposed_algorithm"}, {"score": 0.002624482632439123, "phrase": "low_computational_time"}, {"score": 0.002581165831422692, "phrase": "heuristic_approach"}, {"score": 0.002496659907186784, "phrase": "long_length_strings"}, {"score": 0.002424984362388813, "phrase": "proposed_preprocessing_scheme"}, {"score": 0.0023849523850778807, "phrase": "classification_error"}, {"score": 0.002306855521822739, "phrase": "empirical_evidence"}, {"score": 0.002268769196700254, "phrase": "greedy_approximation"}, {"score": 0.002158233639156017, "phrase": "editing_procedure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Dataset editing", " Shape prototypes", " Edit distance", " Median string"], "paper_abstract": "This paper presents a new fast algorithm for computing an approximation to the mean of two strings of characters representing a 20 shape and its application to a new Wilson-based editing procedure. The approximate mean is built up by including some symbols from the two original strings. In addition, a Greedy approach to this algorithm is studied, which allows us to reduce the time required to compute an approximate mean. The new dataset editing scheme relaxes the criterion for deleting instances proposed by the Wilson editing procedure. In practice, not all instances misclassified by their near neighbors are pruned. Instead, an artificial instance is added to the dataset in the hope of successfully classifying the instance in the future. The new artificial instance is the approximated mean of the misclassified sample and its same-class nearest neighbor. Experiments carried out over three widely known databases of contours show that the proposed algorithm performs very well when computing the mean of two strings, and outperforms methods proposed by other authors. In particular, the low computational time required by the heuristic approach makes it very suitable when dealing with long length strings. Results also show that the proposed preprocessing scheme can reduce the classification error in about 83% of trials. There is empirical evidence that using the Greedy approximation to compute the approximated mean does not affect the performance of the editing procedure. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "An improved fast edit approach for two-string approximated mean computation applied to OCR", "paper_id": "WOS:000316425800008"}