{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gossip_algorithms"}, {"score": 0.004778594263962987, "phrase": "rumor_spreading_problem"}, {"score": 0.004600870784042767, "phrase": "unknown_network"}, {"score": 0.004319168469158858, "phrase": "long_series"}, {"score": 0.004243415959311671, "phrase": "uniform_random_gossip"}, {"score": 0.004075198669927074, "phrase": "main_result"}, {"score": 0.004013843843250455, "phrase": "uniform_gossip"}, {"score": 0.003933825984485761, "phrase": "phi"}, {"score": 0.0038449563772611204, "phrase": "random_gossip_schemes"}, {"score": 0.003320277992107974, "phrase": "global_rumor"}, {"score": 0.00326198730644204, "phrase": "small_diameter"}, {"score": 0.0031246358910995316, "phrase": "parallel_research_direction"}, {"score": 0.0030235059383391092, "phrase": "efficient_rumor"}, {"score": 0.0029629009627331355, "phrase": "lower_bounds"}, {"score": 0.002947939927280631, "phrase": "restricted_models"}, {"score": 0.002896167001212006, "phrase": "reduced_need"}, {"score": 0.0028309318332306703, "phrase": "pseudorandom_generators"}, {"score": 0.002816635287470419, "phrase": "short_random_seeds"}, {"score": 0.002795325349283993, "phrase": "general_intuition"}, {"score": 0.002711681348501699, "phrase": "important_role"}, {"score": 0.0025133309748320326, "phrase": "deterministic_gossip_algorithm"}, {"score": 0.0023892054539802854, "phrase": "first_efficient_deterministic_solution"}, {"score": 0.0021865218861454256, "phrase": "high_probability"}, {"score": 0.0021049977753042253, "phrase": "prior_works"}], "paper_keywords": ["Gossip", " rumor spreading", " information dissemination", " distributed computing", " LOCAL model"], "paper_abstract": "We study gossip algorithms for the rumor spreading problem, which asks each node to deliver a rumor to all nodes in an unknown network. Gossip algorithms allow nodes only to call one neighbor per round and have recently attracted attention as message efficient, simple, and robust solutions to the rumor spreading problem. A long series of papers analyzed the performance of uniform random gossip in which nodes repeatedly call a random neighbor to exchange all rumors with. A main result of this investigation was that uniform gossip completes in O(log n/Phi) rounds where Phi is the conductance of the network. Nonuniform random gossip schemes were devised to allow efficient rumor spreading in networks with bottlenecks. In particular, [Censor-Hillel et al., STOC'12] gave an O(log(3) n) algorithm to solve the 1-local broadcast problem in which each node wants to exchange rumors locally with its 1-neighborhood. By repeatedly applying this protocol, one can solve the global rumor spreading quickly for all networks with small diameter, independently of the conductance. All these algorithms are inherently randomized in their design and analysis. A parallel research direction has been to reduce and determine the amount of randomness needed for efficient rumor spreading. This has been done via lower bounds for restricted models and by designing gossip algorithms with a reduced need for randomness, for instance, by using pseudorandom generators with short random seeds. The general intuition and consensus of these results has been that randomization plays a important role in effectively spreading rumors and that at least a polylogarithmic number of random bit are crucially needed. In this article improves over the state of the art in several ways by presenting a deterministic gossip algorithm that solves the the k-local broadcast problem in 2(k + log(2) n) log(2) n rounds. Besides being the first efficient deterministic solution to the rumor spreading problem this algorithm is interesting in many aspects: It is simpler, more natural, more robust, and faster than its randomized pendant and guarantees success with certainty instead of with high probability. Its analysis is furthermore simple, self-contained, and fundamentally different from prior works.", "paper_title": "Simple, Fast and Deterministic Gossip and Rumor Spreading", "paper_id": "WOS:000366430000004"}