{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "high-quality_answers"}, {"score": 0.0057940655537807575, "phrase": "yahoo"}, {"score": 0.004788416208637939, "phrase": "purpose_-_the_purpose"}, {"score": 0.004619455453039897, "phrase": "community-driven_question"}, {"score": 0.0044687642978081185, "phrase": "identified_predictors"}, {"score": 0.004456762163829543, "phrase": "social_and_textual_content_features"}, {"score": 0.004275428797671738, "phrase": "community_aspects"}, {"score": 0.00418190742471345, "phrase": "explicit_user_interaction"}, {"score": 0.0040791288840175835, "phrase": "intrinsic_and_extrinsic_content_quality"}, {"score": 0.0037751895787179173, "phrase": "randomly_selected_dataset"}, {"score": 0.003692569934990526, "phrase": "high-quality_answer_predictors"}, {"score": 0.003542483210003612, "phrase": "content_appraisal"}, {"score": 0.0034940783943615654, "phrase": "similar_questions"}, {"score": 0.0032512939985881784, "phrase": "high_frequency_words"}, {"score": 0.003197753852980665, "phrase": "best_answers"}, {"score": 0.0031364001483313534, "phrase": "asker's_user_history"}, {"score": 0.0029429530636278837, "phrase": "new_questions"}, {"score": 0.0026785685146367513, "phrase": "new_question"}, {"score": 0.002527247425576091, "phrase": "proposed_quality_framework"}, {"score": 0.0024718711048717676, "phrase": "overall_quality_index"}, {"score": 0.00244463852203525, "phrase": "high-quality_answer"}, {"score": 0.002287414862645386, "phrase": "community-driven_question_answering_services"}, {"score": 0.002262209824105154, "phrase": "content_appraisal_features"}, {"score": 0.0022497114120528885, "phrase": "thorough_assessment"}, {"score": 0.0022372818972458196, "phrase": "answer_quality"}, {"score": 0.0021049977753042253, "phrase": "integrated_generalisable_framework"}], "paper_keywords": ["Community-driven question answering", " Quality", " Yahoo! Answers", " Internet", " Search engines"], "paper_abstract": "Purpose - The purpose of this study is to examine the predictors of high-quality answers in a community-driven question answering service (Yahoo! Answers). Design/methodology/approach - The identified predictors were organised into two categories: social and content features. Social features refer to the community aspects of the users and are extracted from explicit user interaction and feedback. Content features refer to the intrinsic and extrinsic content quality of answers that could be used to select the high-quality answers. In total the framework built in this study comprises 17 features from two categories. Based on a randomly selected dataset of 1,600 question-answer pairs from Yahoo! Answers, high-quality answer predictors were identified. Findings - The results of the analysis showed the importance of content appraisal features over social and textual content features. The features identified as strongly associated with high-quality answers include positive votes, completeness, presentation, reliability and accuracy. Features weakly associated with high-quality answers were high frequency words, answer length, and best answers answered. Features related to the asker's user history were found not to be associated with high-quality answers. Practical implications - This work could help in the reuse of answers for new questions. The study identified features that most influence the selection of high-quality answers. Hence they could be used to select high-quality answers for answering similar questions posed by users in the future. When a new question is posed, similar questions are first identified, and the answers for these questions are extracted and routed to the proposed quality framework for identifying high-quality answers. Based on the overall quality index computed, the high-quality answer could be returned to the asker. Originality/value - Previous studies in identifying high-quality answers were conducted using either of two approaches. First using social and textual content features found in community-driven question answering services and second using content appraisal features by thorough assessment of answer quality provided by experts. However no study had integrated both approaches. Hence this study addresses this gap by developing an integrated generalisable framework to identify features that influence high-quality answers.", "paper_title": "Predictors of high-quality answers", "paper_id": "WOS:000307202100005"}