{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "industrial_setting"}, {"score": 0.03565024895550413, "phrase": "evolutionary_functional_testing"}, {"score": 0.004672953146379813, "phrase": "evolutionary_testing_research"}, {"score": 0.004322967486451877, "phrase": "promising_results"}, {"score": 0.003526186748088922, "phrase": "empirical_setup"}, {"score": 0.0032229262928681304, "phrase": "serial_production_development_environments"}, {"score": 0.0031845076533124034, "phrase": "daimler"}, {"score": 0.0030171910207671205, "phrase": "case_studies"}, {"score": 0.0029280552768499056, "phrase": "research_questions"}, {"score": 0.0024604876113911173, "phrase": "fitness_functions"}, {"score": 0.0021561514733516676, "phrase": "significant_factor"}, {"score": 0.0021304214257321, "phrase": "functional_evolutionary_testing"}], "paper_keywords": ["Evolutionary computation", " Functional testing", " Empirical assessment", " Case study", " Industrial practice", " Test data generation"], "paper_abstract": "During the past years, evolutionary testing research has reported encouraging results for automated functional (i.e. black-box) testing. However, despite promising results, these techniques have hardly been applied to complex, real-world systems and as such, little is known about their scalability, applicability, and acceptability in industry. In this paper, we describe the empirical setup used to study the use of evolutionary functional testing in industry through two case studies, drawn from serial production development environments at Daimler and Berner & Mattner Systemtechnik, respectively. Results of the case studies are presented, and research questions are assessed based on them. In summary, the results indicate that evolutionary functional testing in an industrial setting is both scalable and applicable. However, the creation of fitness functions is time-consuming. Although in some cases, this is compensated by the results, it is still a significant factor preventing functional evolutionary testing from more widespread use in industry.", "paper_title": "Evolutionary functional black-box testing in an industrial setting", "paper_id": "WOS:000316746700003"}