{"auto_keywords": [{"score": 0.04828362906607965, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "main_aim"}, {"score": 0.0034459835582278746, "phrase": "integrated_system"}, {"score": 0.0033645655483989746, "phrase": "work_routines"}, {"score": 0.003300813776412652, "phrase": "cultural_resistance"}, {"score": 0.0030140547908298404, "phrase": "critical_functions"}, {"score": 0.002791932344920906, "phrase": "first_priority"}, {"score": 0.002752139271586703, "phrase": "integration_process"}, {"score": 0.002488985155689794, "phrase": "potential_resistance"}, {"score": 0.0023840346303791032, "phrase": "managerial_implications"}, {"score": 0.0022834993174767016, "phrase": "relevant_fields"}, {"score": 0.0021560018573288666, "phrase": "resource_allocation_decision"}, {"score": 0.0021049977753042253, "phrase": "post-integration_evaluation"}], "paper_keywords": ["Mergers and acquisitions", " Information systems integration", " Post-M&A integration"], "paper_abstract": "Purpose - The main aim of this study is to perform a case study to understand the information systems (IS) integration strategy of two high-tech companies after merger and acquisition. Design/methodology/approach - The authors perform a case study on the mergers and acquisitions (M&A) of two high-tech companies to illustrate the IS integration activities in the M&A processes. Findings - This study summarizes 26 fields from the IS integration process in the post-M&A period. These 26 fields highlight the challenges when standardizing the integrated system and the impacts on work routines as well as cultural resistance. Originality/value - This study shows that the success of IS integration in the M&A context is determined by identifying critical functions and leveraging the pre-M&A know-hows of both companies. Furthermore, standardization may not be the first priority during the integration process. It is also beneficial to keep the uniqueness of the systems of both companies which reduces the concerns of potential resistance of the IT personnel. This study also has managerial implications. The findings suggest that identifying and prioritizing relevant fields in the context of a cross-business IS integration would improve the resource allocation decision and the effectiveness of post-integration evaluation.", "paper_title": "Information systems integration after merger and acquisition", "paper_id": "WOS:000330079500003"}