{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "surgical_care_plans"}, {"score": 0.004594951819987416, "phrase": "surgical_work"}, {"score": 0.004453874101119545, "phrase": "'continuous_planning"}, {"score": 0.004294724955301414, "phrase": "frequently_occurring_variations"}, {"score": 0.00422826362023938, "phrase": "planned_patient_treatment"}, {"score": 0.0037321585095070483, "phrase": "different_information"}, {"score": 0.0035614563596982306, "phrase": "computer_systems"}, {"score": 0.0032940691998512963, "phrase": "peri-operative_work"}, {"score": 0.0027454383581457555, "phrase": "better_support"}, {"score": 0.0026888503045081505, "phrase": "awareness-support_systems"}, {"score": 0.002360607691114015, "phrase": "incidental_time"}, {"score": 0.0023361440016375972, "phrase": "ongoing_relevant_events"}, {"score": 0.0021945833590668973, "phrase": "information-sparse_and_information-rich_computer_support"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd"}], "paper_keywords": ["Patient trajectory", " Coordination", " Hospital information systems", " Awareness supporting systems", " Variations"], "paper_abstract": "Introduction: In surgical work there is a need for 'continuous planning' among staff to handle the frequently occurring variations from the planned patient treatment. In this paper, we present how three hospital information systems have support for three common patient trajectory variations. Purpose: Highlight how deviations from a plan cause different information needs and implications for design of awareness supporting computer systems. Methods: Participant observations and semi-structured interviews with stakeholders involved in peri-operative work. Results: When trajectories progress according to plan, information needs of staff seem to be minimal, as everything is \"running to plan\". However, when variations occur the information need increases. In order to provide better support for variations, awareness-support systems need to inform colleagues and other stakeholders about deviations from the plan. Plans and trajectories also need to be connected by projecting estimations of incidental time of ongoing relevant events. Additionally, end-users should have the option to switch between information-sparse and information-rich computer support. (C) 2012 Published by Elsevier Ireland Ltd", "paper_title": "Managing variations from surgical care plans: Challenges for coordination", "paper_id": "WOS:000311831000005"}