{"auto_keywords": [{"score": 0.049666636555871356, "phrase": "sequential_elections"}, {"score": 0.00481495049065317, "phrase": "online_manipulation"}, {"score": 0.003962998498942108, "phrase": "online_coalitional_manipulation"}, {"score": 0.003697760799674494, "phrase": "election_systems"}, {"score": 0.003665874747419775, "phrase": "simple_winner_problems"}, {"score": 0.0032471982781283374, "phrase": "manipulative_coalition"}, {"score": 0.003205268682789165, "phrase": "online_manipulation_problem"}, {"score": 0.00308269056870936, "phrase": "polynomial_hierarchy"}, {"score": 0.0030297398987547764, "phrase": "pspace."}, {"score": 0.002913837945508097, "phrase": "nonunique-winner_and_unique-winner_models"}, {"score": 0.002766171878646582, "phrase": "nonunique-winner_model"}, {"score": 0.0026270405710340354, "phrase": "np"}, {"score": 0.002525489173110693, "phrase": "unique-winner_model"}, {"score": 0.0023664730217196252, "phrase": "p-np-completeness_results"}, {"score": 0.0021604924928015283, "phrase": "veto_elections"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Computational complexity", " Computational social choice", " Elections", " Manipulation", " Online algorithms", " Preferences", " Sequential voting"], "paper_abstract": "Most work on manipulation assumes that all preferences are known to the manipulators. However, in many settings elections are open and sequential. We introduce a framework, in which manipulators can see the past votes but not the future ones, to model online coalitional manipulation of sequential elections, and we show that here manipulation can be extremely complex even for election systems with simple winner problems. We also show that for some of the most important election systems such manipulation is simple in certain settings. Among our highlights are: Depending on the size of the manipulative coalition, the online manipulation problem can be complete for each level of the polynomial hierarchy or even for PSPACE. We obtain the most dramatic contrast to date between the nonunique-winner and unique-winner models: Online weighted manipulation for plurality is in P in the nonunique-winner model, yet is coNP-hard (constructive case) and NP-hard (destructive case) in the unique-winner model. And we obtain what to the best of our knowledge are the first P-NP[1]]-completeness and P-NP-completeness results in computational social choice, in particular regarding 3-candidate and 4-candidate (and unlimited-candidate) online weighted coalition manipulation of veto elections. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "The complexity of online manipulation of sequential elections", "paper_id": "WOS:000331915400002"}