{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "grey_sets"}, {"score": 0.006207985074430056, "phrase": "grey_numbers"}, {"score": 0.004763895422211728, "phrase": "purpose_-_the_purpose"}, {"score": 0.00458940888106061, "phrase": "new_rules"}, {"score": 0.0041251561573501455, "phrase": "grey_set"}, {"score": 0.0032742937690106748, "phrase": "novel_operation_rules"}, {"score": 0.003244567402785763, "phrase": "proposed_meet_operation"}, {"score": 0.0030758904011907533, "phrase": "novel_rules"}, {"score": 0.002794001681064862, "phrase": "different_operations"}, {"score": 0.0025109095718850376, "phrase": "different_sources"}, {"score": 0.0021276181317652163, "phrase": "new_development"}, {"score": 0.0021049977753042253, "phrase": "grey_systems_theory"}], "paper_keywords": ["Grey systems", " Grey numbers", " Grey sets", " Greyness", " Grey marketing", " Marketing strategy"], "paper_abstract": "Purpose - The purpose of this paper is to advance new rules about operations of grey sets based on grey numbers and greyness and investigate their capability in reducing uncertainty. Design/methodology/approach - A grey set can have its characteristic function values restricted by grey numbers, and such a representation makes the operations of grey sets different from other sets. Based on the concept of whitenisation of grey sets, two extended operations of grey sets are defined and their properties are discussed. Findings - The result demonstrates that the proposed meet operation can significantly reduce uncertainty in grey sets and that the novel rules about operation of grey sets can reduce uncertainty of the set significantly. The propagation of uncertainty under different operations is investigated. Practical implications - The method exposed in the paper can be used to integrate information from different sources to reduce uncertainty in information. Originality/value - The paper succeeds in constructing novel operation rules of grey sets. The capability of novel operation rules to reduce uncertainty is studied and it is a new development of grey systems theory.", "paper_title": "Some extended operations of grey sets", "paper_id": "WOS:000311266900004"}