{"auto_keywords": [{"score": 0.03129154879931237, "phrase": "transport_vehicles"}, {"score": 0.00481495049065317, "phrase": "on-demand_transport_vehicles"}, {"score": 0.004597622380240611, "phrase": "on-demand_transportations"}, {"score": 0.004390060342250211, "phrase": "new_transport_systems"}, {"score": 0.004278807087784626, "phrase": "on-demand_transport_systems"}, {"score": 0.0039010428828989826, "phrase": "convincing_solutions"}, {"score": 0.003160049822855747, "phrase": "transport_vehicle"}, {"score": 0.0028807718824400697, "phrase": "game_theory"}, {"score": 0.00263965046277432, "phrase": "scheduled_customers"}, {"score": 0.002546315584783112, "phrase": "undetermined_customers"}, {"score": 0.0022161333611134806, "phrase": "risk_policies"}, {"score": 0.002193447487477984, "phrase": "transport_strategies"}, {"score": 0.0021049977753042253, "phrase": "simulation_experiments"}], "paper_keywords": [""], "paper_abstract": "In these years, on-demand transportations (such as demand-bus) are focused as new transport systems. Vehicles in the on-demand transport systems must take reasonable actions in various situations to increase their profits. However, it is difficult to find convincing solutions in such situations because there are uncertainties about customers and other transport vehicles. Therefore, in this paper, we focus on two issues: \"how to control risk?\" and \"how to compete (or cooperate) with another transport vehicle?\". Moreover, we show the decision-making processes for the transport vehicles on the basis of game theory. The profits for transport vehicles are classified into assured and expected rewards. The former represents scheduled customers in advance. The latter represents undetermined customers. Transport vehicles set their routes in consideration of the balancing between the rewards (i.e., risk). The transport vehicles are classified into several types based on risk policies and transport strategies. Finally, we report results of simulation experiments.", "paper_title": "Simulation analysis for on-demand transport vehicles based on game theory", "paper_id": "WOS:000239623800015"}