{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "explicit_boundaries"}, {"score": 0.01052557839629748, "phrase": "support_vector_machines"}, {"score": 0.009115348796355697, "phrase": "design_optimization"}, {"score": 0.009040673965879292, "phrase": "reliability_assessment"}, {"score": 0.004378469469879815, "phrase": "explicit_constraints"}, {"score": 0.004342430078306461, "phrase": "limit-state_functions"}, {"score": 0.003997891221012094, "phrase": "large_computational_times"}, {"score": 0.003916098498242888, "phrase": "binary_outputs"}, {"score": 0.003030247482854539, "phrase": "accurate_boundary"}, {"score": 0.0029194625087935345, "phrase": "theoretical_\"linear\"_speedup"}, {"score": 0.0028010985923790036, "phrase": "\"appropriate\"_range"}, {"score": 0.0025678829712650437, "phrase": "markedly_reduced_computational_burden"}, {"score": 0.002413256359147736, "phrase": "optimal_use"}, {"score": 0.002393353846080347, "phrase": "computational_resources"}], "paper_keywords": ["Explicit design space decomposition", " Support vector machines", " Parallel processing", " Optimum design", " Reliability management"], "paper_abstract": "Purpose - The purpose of this paper is to present a study of the parallelization of the construction of explicit constraints or limit-state functions using support vector machines. These explicit boundaries have proven to be beneficial for design optimization and reliability assessment, especially for problems with large computational times, discontinuities, or binary outputs. In addition to the study of the parallelization, the objective of this article is also to provide an approach to select the number of processors. Design/methodology/approach - This article investigates the parallelization in two ways. First, the efficiency of the parallelization is assessed by comparing, over several runs, the number of iterations needed to create an accurate boundary to the number of iterations associated with a theoretical \"linear\" speedup. Second, by studying these differences, an \"appropriate\" range of parallel processors can be inferred. Findings - The parallelization of the construction of explicit boundaries can lead to a markedly reduced computational burden. The study provides an approach to select the number of processors for an optimal use of computational resources. Originality/value - The construction of explicit boundaries for design optimization and reliability assessment is designed to alleviate many hurdles in these areas. The parallelization of the construction of the boundaries is a much needed study to reinforce the efficacy and efficiency of this approach.", "paper_title": "Parallel construction of explicit boundaries using support vector machines", "paper_id": "WOS:000316236900007"}