{"auto_keywords": [{"score": 0.043618802978160134, "phrase": "qos_requirements"}, {"score": 0.00481495049065317, "phrase": "wimax_networks"}, {"score": 0.004758987153057194, "phrase": "wimax_systems"}, {"score": 0.004722038375317162, "phrase": "base_station_scheduler"}, {"score": 0.004667149874736771, "phrase": "key_role"}, {"score": 0.004523865550323285, "phrase": "radio_resources"}, {"score": 0.004283576270012874, "phrase": "fair_usage"}, {"score": 0.004008820473628357, "phrase": "power_consumption"}, {"score": 0.003900853871728297, "phrase": "feasible_algorithm_complexity"}, {"score": 0.0037079710789139305, "phrase": "scheduler_designers"}, {"score": 0.003483573659272443, "phrase": "scheduling_algorithm"}, {"score": 0.0031721009574803127, "phrase": "channel_state"}, {"score": 0.0030745737579268876, "phrase": "time_utility_functions"}, {"score": 0.0027240799841720957, "phrase": "best_compromise"}, {"score": 0.0025292620341476283, "phrase": "exponential_complexity"}, {"score": 0.002490053106007765, "phrase": "game_theory_technique"}, {"score": 0.002385326947545194, "phrase": "large_number"}, {"score": 0.002311933249234786, "phrase": "suboptimal_version"}, {"score": 0.002146527342660575, "phrase": "performance_figures"}], "paper_keywords": ["IEEE 802.16", " Mobile WiMAX", " Radio aware scheduler", " Game Theory", " Time-utility functions"], "paper_abstract": "In WiMAX systems the Base Station scheduler plays a key role as it controls the sharing of the radio resources among the users. The goal of the scheduler is multiple: achieve fair usage of the resources, satisfy the QoS requirements of the users, maximize goodput, and minimize power consumption, and at the same time ensuring feasible algorithm complexity and system scalability. Since most of these goals are contrasting, scheduler designers usually focus their attention on optimizing one aspect only. In this scenario, we propose a scheduling algorithm (called GTS(N)) whose goal is to contemporaneously achieve efficiency and fairness, while also taking into account the QoS requirements and the channel state. GTS(N) exploits the properties of Time Utility Functions (TUFs) and Game Theory. Simulations prove that the performance of GTS(N); when compared to that of several well-known schedulers, is remarkable. GTS(N) provides the best compromise between the two contrasting objectives of fairness and efficiency, while QoS requirements are in most cases guaranteed. However, the exponential complexity introduced by the game theory technique makes it rather impractical and not computationally scalable for a large number of users. Thus we developed a suboptimal version, named sub-GTS(N): We show that this version retains most of the features and performance figures of its brother, but its complexity is linear with the number of users.", "paper_title": "Game theory and time utility functions for a radio aware scheduling algorithm for WiMAX networks", "paper_id": "WOS:000292829700003"}