{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "planar_sections"}, {"score": 0.0047707093928203, "phrase": "minimalist_object_representations"}, {"score": 0.004619027561771169, "phrase": "human_perception"}, {"score": 0.004058826900076531, "phrase": "shape_abstractions"}, {"score": 0.0038046452381676967, "phrase": "user_study"}, {"score": 0.003683565150278339, "phrase": "consistent_and_similar_planar_section_proxies"}, {"score": 0.003517223847512266, "phrase": "strong_correlation"}, {"score": 0.003484864867147635, "phrase": "user-defined_planes"}, {"score": 0.0032364494905485677, "phrase": "minimum_set"}, {"score": 0.0026651772919894534, "phrase": "feature_coverage"}, {"score": 0.0025565050791036973, "phrase": "subsequent_planes"}, {"score": 0.0025212722607043546, "phrase": "algorithmic_framework"}, {"score": 0.0023741093119014436, "phrase": "user_study_data"}, {"score": 0.00229844995872581, "phrase": "planar_slices"}, {"score": 0.002225196379204285, "phrase": "object_abstraction"}, {"score": 0.0021945194903838132, "phrase": "second_user_study"}, {"score": 0.0021344259291927914, "phrase": "potential_applications"}, {"score": 0.0021049977753042253, "phrase": "extracted_planar_slice_shape_proxies"}], "paper_keywords": ["abstraction", " shape proxy", " shape perception"], "paper_abstract": "Minimalist object representations or shape-proxies that spark and inspire human perception of shape remain an incompletely understood, yet powerful aspect of visual communication. We explore the use of planar sections, i.e., the contours of intersection of planes with a 3D object, for creating shape abstractions, motivated by their popularity in art and engineering. We first perform a user study to show that humans do define consistent and similar planar section proxies for common objects. Interestingly, we observe a strong correlation between user-defined planes and geometric features of objects. Further we show that the problem of finding the minimum set of planes that capture a set of 3D geometric shape features is both NP-hard and not always the proxy a user would pick. Guided by the principles inferred from our user study, we present an algorithm that progressively selects planes to maximize feature coverage, which in turn influence the selection of subsequent planes. The algorithmic framework easily incorporates various shape features, while their relative importance values are computed and validated from the user study data. We use our algorithm to compute planar slices for various objects, validate their utility towards object abstraction using a second user study, and conclude showing the potential applications of the extracted planar slice shape proxies.", "paper_title": "Slices: A Shape-proxy Based on Planar Sections", "paper_id": "WOS:000297681100046"}