{"auto_keywords": [{"score": 0.034987181656428126, "phrase": "probability_distribution"}, {"score": 0.00481495049065317, "phrase": "uncertain_logical_arguments"}, {"score": 0.004661446705304497, "phrase": "abstract_level"}, {"score": 0.004605147081797856, "phrase": "directed_graph"}, {"score": 0.0038375280115736958, "phrase": "abstract_argumentation"}, {"score": 0.003775803846431323, "phrase": "'_uncertainty"}, {"score": 0.0036701570847323447, "phrase": "probability_value"}, {"score": 0.0032762198196613084, "phrase": "full_subgraphs"}, {"score": 0.003236596168242036, "phrase": "argument_graph"}, {"score": 0.0027184540871935284, "phrase": "logic-based_argumentation"}, {"score": 0.002387337550919433, "phrase": "classical_logic"}, {"score": 0.0022923586577645143, "phrase": "logical_arguments"}, {"score": 0.002246292543825748, "phrase": "abstract_arguments"}, {"score": 0.0021745003291048356, "phrase": "interesting_classes"}, {"score": 0.0021569129153653777, "phrase": "probability_assignments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Computational models of argument", " Argument systems", " Logic-based argumentation", " Probabilistic argumentation", " Logical arguments", " Uncertain arguments"], "paper_abstract": "Argumentation can be modelled at an abstract level using a directed graph where each node denotes an argument and each arc denotes an attack by one argument on another. Since arguments are often uncertain, it can be useful to quantify the uncertainty associated with each argument. Recently, there have been proposals to extend abstract argumentation to take this' uncertainty into account. This assigns a probability value for each argument that represents the degree to which the argument is believed to hold, and this is then used to generate a probability distribution over the full subgraphs of the argument graph, which in turn can be used to determine the probability that a set of arguments is admissible or an extension. In order to more fully understand uncertainty in argumentation, in this paper, we extend this idea by considering logic-based argumentation with uncertain arguments. This is based on a probability distribution over models of the language, which can then be used to give a probability distribution over arguments that are constructed using classical logic. We show how this formalization of uncertainty of logical arguments relates to uncertainty of abstract arguments, and we consider a number of interesting classes of probability assignments. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "A probabilistic approach to modelling uncertain logical arguments", "paper_id": "WOS:000312520800004"}