{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intrusion_detection_systems"}, {"score": 0.04972711494665694, "phrase": "wireless_sensor_networks"}, {"score": 0.004744437370338926, "phrase": "wireless_sensor_networking"}, {"score": 0.004555781299332848, "phrase": "health_care"}, {"score": 0.004522291357556591, "phrase": "tactical_military"}, {"score": 0.004390764654147291, "phrase": "appealing_features"}, {"score": 0.0040783736687590635, "phrase": "physical_line"}, {"score": 0.003858697684681798, "phrase": "information_flow"}, {"score": 0.0037325918533747953, "phrase": "big_concern"}, {"score": 0.0036105923401756126, "phrase": "prime_importance"}, {"score": 0.003466865016432561, "phrase": "secure_way"}, {"score": 0.003196292402522254, "phrase": "information_destination"}, {"score": 0.0026867260506696455, "phrase": "brief_survey"}, {"score": 0.0026375303198093764, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.0021049977753042253, "phrase": "open_research_issues"}], "paper_keywords": ["intrusion detection", " IDS", " mobile ad hoc network", " MANET", " security", " wireless sensor network", " WSN"], "paper_abstract": "Wireless Sensor Networking is one of the most promising technologies that have applications ranging from health care to tactical military. Although Wireless Sensor Networks (WSNs) have appealing features (e. g., low installation cost, unattended network operation), due to the lack of a physical line of defense (i.e., there are no gateways or switches to monitor the information flow), the security of such networks is a big concern, especially for the applications where confidentiality has prime importance. Therefore, in order to operate WSNs in a secure way, any kind of intrusions should be detected before attackers can harm the network (i.e., sensor nodes) and/or information destination (i.e., data sink or base station). In this article, a survey of the state-of-the-art in Intrusion Detection Systems (IDSs) that are proposed for WSNs is presented. Firstly, detailed information about IDSs is provided. Secondly, a brief survey of IDSs proposed for Mobile Ad-Hoc Networks (MANETs) is presented and applicability of those systems to WSNs are discussed. Thirdly, IDSs proposed for WSNs are presented. This is followed by the analysis and comparison of each scheme along with their advantages and disadvantages. Finally, guidelines on IDSs that are potentially applicable to WSNs are provided. Our survey is concluded by highlighting open research issues in the field.", "paper_title": "A Survey of Intrusion Detection Systems in Wireless Sensor Networks", "paper_id": "WOS:000338700300014"}