{"auto_keywords": [{"score": 0.03308383494589817, "phrase": "unsupervised_learning"}, {"score": 0.010534632676491726, "phrase": "supervised_learning"}, {"score": 0.00481495049065317, "phrase": "web_queries"}, {"score": 0.004706206193274572, "phrase": "user's_intention"}, {"score": 0.004530371221172796, "phrase": "search_engine"}, {"score": 0.0041821205529541045, "phrase": "user's_interest"}, {"score": 0.004134596278123439, "phrase": "automatic_way"}, {"score": 0.004025787455454387, "phrase": "query_logs"}, {"score": 0.0036321600255449613, "phrase": "manual_classification"}, {"score": 0.00348300993356662, "phrase": "reference_point"}, {"score": 0.0032519989404960073, "phrase": "considerable_amount"}, {"score": 0.0031784407245606704, "phrase": "good_option"}, {"score": 0.00293380698353469, "phrase": "query_words"}, {"score": 0.002596653214530156, "phrase": "clustering_process"}, {"score": 0.0024899186481178075, "phrase": "supervised_and_unsupervised_learning"}, {"score": 0.0024615764782448214, "phrase": "good_alternative"}, {"score": 0.0024335561337016174, "phrase": "user's_goals"}, {"score": 0.002360381056508368, "phrase": "user_interest"}, {"score": 0.0021049977753042253, "phrase": "user's_needs"}], "paper_keywords": [""], "paper_abstract": "The identification of the user's intention or interest through queries that they submit to a search engine can be very useful to offer them more adequate results. In this work we present a framework for the identification of user's interest in an automatic way, based on the analysis of query logs. This identification is made from two perspectives, the objectives or goals of a user and the categories in which these aims are situated. A manual classification of the queries was made in order to have a reference point and then we applied supervised and unsupervised learning techniques. The results obtained show that for a considerable amount of cases supervised learning is a good option, however through unsupervised learning we found relationships between users and behaviors that are not easy to detect just taking the query words. Also, through unsupervised learning we established that there are categories that we are not able to determine in contrast with other classes that were not considered but naturally appear after the clustering process. This allowed us to establish that the combination of supervised and unsupervised learning is a good alternative to find user's goals. From supervised learning we can identify the user interest given certain established goals and categories; on the other hand, with unsupervised learning we can validate the goals and categories used, refine them and select the most appropriate to the user's needs.", "paper_title": "The intention behind Web queries", "paper_id": "WOS:000241594700009"}