{"auto_keywords": [{"score": 0.04621807134587008, "phrase": "action_models"}, {"score": 0.014936329832273372, "phrase": "htnlearn"}, {"score": 0.007740489563401459, "phrase": "partially_observed_plan"}, {"score": 0.004695303774351139, "phrase": "effective_yet_knowledge_intensive_problem-solving_technique"}, {"score": 0.0038711548651825917, "phrase": "difficult_and_time-consuming_process"}, {"score": 0.003650195070580192, "phrase": "new_learning_algorithm"}, {"score": 0.0035296217979800463, "phrase": "htn_methods"}, {"score": 0.0033280910751441496, "phrase": "partially_annotated_intermediate_state_information"}, {"score": 0.003245270848972794, "phrase": "annotated_tasks"}, {"score": 0.0031248767378106663, "phrase": "tasks'_completion"}, {"score": 0.003059925849144792, "phrase": "plan_traces"}, {"score": 0.0030089355635315005, "phrase": "potentially_empty_partial_decomposition_trees"}, {"score": 0.002873038567884343, "phrase": "htnlearn_outputs"}, {"score": 0.0026414426081951734, "phrase": "constraint_satisfaction_problem"}, {"score": 0.002543392353000551, "phrase": "weighted_max-sat_solver"}, {"score": 0.002367983991444061, "phrase": "intermediate_states"}, {"score": 0.0022420373745572837, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Action model learning", " HTN planning", " Learning HTNs", " Weighted MAX-SAT"], "paper_abstract": "Hierarchical Task Network (HTN) planning is an effective yet knowledge intensive problem-solving technique. It requires humans to encode knowledge in the form of methods and action models. Methods describe how to decompose tasks into subtasks and the preconditions under which those methods are applicable whereas action models describe how actions change the world. Encoding such knowledge is a difficult and time-consuming process, even for domain experts. In this paper, we propose a new learning algorithm, called HTNLearn, to help acquire HTN methods and action models. HTNLearn receives as input a collection of plan traces with partially annotated intermediate state information, and a set of annotated tasks that specify the conditions before and after the tasks' completion. In addition, plan traces are annotated with potentially empty partial decomposition trees that record the processes of decomposing tasks to subtasks. HTNLearn outputs are a collection of methods and action models. HTNLearn first encodes constraints about the methods and action models as a constraint satisfaction problem, and then solves the problem using a weighted MAX-SAT solver. HTNLearn can learn methods and action models simultaneously from partially observed plan traces (i.e., plan traces where the intermediate states are partially observable). We test HTNLearn in several HTN domains. The experimental results show that our algorithm HTNLearn is both effective and efficient. (c) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Learning hierarchical task network domains from partially observed plan traces", "paper_id": "WOS:000336946300008"}