{"auto_keywords": [{"score": 0.04185068786475145, "phrase": "sut"}, {"score": 0.039614217499688104, "phrase": "asynchronous_channels"}, {"score": 0.030772943263320463, "phrase": "non-fifo_channels"}, {"score": 0.029459247674107878, "phrase": "polynomial_time"}, {"score": 0.00481495049065317, "phrase": "asynchronous_model"}, {"score": 0.004493045859210086, "phrase": "model_m"}, {"score": 0.004366808573435364, "phrase": "state-based_language"}, {"score": 0.004296264970612285, "phrase": "input_output_transition_system"}, {"score": 0.0032967724149749853, "phrase": "test_cases"}, {"score": 0.0030262967460085366, "phrase": "oracle_problem"}, {"score": 0.002755384932325921, "phrase": "fifo_channels"}, {"score": 0.0025499314820425284, "phrase": "iots"}, {"score": 0.0024984517279573906, "phrase": "general_test_generation_problems"}, {"score": 0.002359759876402679, "phrase": "test_case"}, {"score": 0.0021571717917276724, "phrase": "deterministic_iotss"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software testing", " Asynchronous channels", " Model based testing", " Input output transition system"], "paper_abstract": "In model based testing (MBT), testing is based on a model M that typically is expressed using a state-based language such as an input output transition system (IOTS). Most approaches to MBT assume that communications between the system under test (SUT) and its environment are synchronous. However, many systems interact with their environment through asynchronous channels and the presence of such channels changes the nature of testing. In this paper we investigate the situation in which the SUT interacts with its environment through asynchronous channels and the problems of producing test cases to reach a state, execute a transition, or to distinguish two states. In addition, we investigate the Oracle Problem. All four problems are explored for both FIFO and non-FIFO channels. It is known that the Oracle Problem can be solved in polynomial time for FIFO channels but we also show that the three test case generation problems can also be solved in polynomial time in the case where the IOTS is observable but the general test generation problems are EXPTIME-hard. For non-FIFO channels we prove that all of the test case generation problems are EXPTIME-hard and the Oracle Problem in NP-hard, even if we restrict attention to deterministic IOTSs. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "The complexity of asynchronous model based testing", "paper_id": "WOS:000307620200003"}