{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "particle_filter"}, {"score": 0.009006391800930871, "phrase": "global_transition_model"}, {"score": 0.007979381621927361, "phrase": "high_accuracy"}, {"score": 0.00787465110618904, "phrase": "sample_impoverishment"}, {"score": 0.004179991181159956, "phrase": "linear_transformation"}, {"score": 0.003964007795174772, "phrase": "accurate_filtering"}, {"score": 0.0035178323426661626, "phrase": "spline_transformation"}, {"score": 0.003335948601271999, "phrase": "particle_filtering"}, {"score": 0.0032057142600527, "phrase": "point_spread_transformation"}, {"score": 0.0026267609106294817, "phrase": "background_variation"}, {"score": 0.0025806490053534316, "phrase": "camera_motion_model"}, {"score": 0.0024798279465139688, "phrase": "real_object_position"}, {"score": 0.0022595974985992664, "phrase": "experimental_results"}, {"score": 0.002200337772403981, "phrase": "spline_resampling"}, {"score": 0.0021426288417854987, "phrase": "promising_discriminative_capability"}], "paper_keywords": ["Spline resampling", " Point spread function", " Particle filter", " Impoverishment", " Visual tracking"], "paper_abstract": "We introduce the concept of a spline resampling in the particle filter to deal with the high accuracy and the sample impoverishment. The resampling is usually based on a linear transformation on the weights of the particles, so it affects the accurate filtering. The spline resampling consists of two parts: the spline transformation of weights and the spread transformation of states. The former is based on a spline transformation on the weights of the particles to obtain the high accuracy of particle filtering, and the latter is based on a point spread transformation on states of particles to prevent the sample impoverishment due to decline of the diversity of hypothesis after resampling. Two transformations are sequentially implemented to incorporate with each other. Then, we propose a global transition model in the particle filter, which takes account of the background variation caused by the camera motion model of object itself, to decrease error from real object position. We test the performance of our spline resampling and the global transition model in the particle filter in object tracking scenario. Experimental results demonstrate that particle filter with the spline resampling and the global transition model has the promising discriminative capability in comparison with other ones.", "paper_title": "Visual tracking based on particle filter with spline resampling", "paper_id": "WOS:000360071800028"}