{"auto_keywords": [{"score": 0.035594612090225276, "phrase": "proposed_approach"}, {"score": 0.004815315858763145, "phrase": "distributed"}, {"score": 0.004764220976404241, "phrase": "aware_collaborative_filtering_approach"}, {"score": 0.004615202066192795, "phrase": "wireless_mesh_networks"}, {"score": 0.004470823343432748, "phrase": "large_number"}, {"score": 0.0044237033788643715, "phrase": "social_networking_sites"}, {"score": 0.0037935066882208235, "phrase": "high_level"}, {"score": 0.003287482882222731, "phrase": "traditional_centralized_approaches"}, {"score": 0.0032014433546265694, "phrase": "network_views"}, {"score": 0.0030684249587688826, "phrase": "service_recovery_time"}, {"score": 0.0024553821147953463, "phrase": "user_input"}, {"score": 0.002378408229095287, "phrase": "proposed_algorithm"}, {"score": 0.002328434471939886, "phrase": "traditional_centralized_algorithm"}, {"score": 0.0021049977753042253, "phrase": "existing_approaches"}], "paper_keywords": ["Collaborative computing", " Service selection", " Wireless mesh networks", " Collaborative filtering", " Collaborative scheduling"], "paper_abstract": "With the evolution of large number of social networking sites in which various users share the information at various levels in Peer-to-Peer (P2P) manner, there is a need of efficient P2P collaborative mechanisms to achieve efficiency and accuracy at each level. To achieve high level of accuracy and scalability, a distributed collaborative filtering (CF) approach for P2P service selection and recovery is proposed in this paper. The proposed approach is different from the traditional centralized approaches as both user and network views are modelled and an estimation of the service recovery time is included if some of the services are failed during execution. A novel Context Aware P2P Service Selection and Recovery (CAPSSR) algorithm is proposed. To filter the relevant contents for user needs, a new Distributed Filtering Metric (DFM) is included in the algorithm which selects the contents based upon the user input. The performance of the proposed algorithm is evaluated with traditional centralized algorithm with respect to scalability and accuracy. The results obtained show that the proposed approach is better than the existing approaches in terms of accuracy and scalability.", "paper_title": "Distributed context aware collaborative filtering approach for P2P service selection and recovery in wireless mesh networks", "paper_id": "WOS:000309340900005"}