{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "large_scale"}, {"score": 0.04201282685244248, "phrase": "server_bandwidth_costs"}, {"score": 0.00467855218490191, "phrase": "online_file"}, {"score": 0.004481132747216135, "phrase": "valuable_services"}, {"score": 0.0042004472903194616, "phrase": "dedicated_servers"}, {"score": 0.004140490129683107, "phrase": "content_distribution_networks"}, {"score": 0.0038256426589560774, "phrase": "large_volumes"}, {"score": 0.003757480190200645, "phrase": "large_number"}, {"score": 0.003598786417573615, "phrase": "peer_upload_bandwidth"}, {"score": 0.003521961918342562, "phrase": "complementary_fashion"}, {"score": 0.0034097787109430384, "phrase": "fine-tune_important_aspects"}, {"score": 0.0033490008882413103, "phrase": "real-world_large-scale_deployment"}, {"score": 0.0031164983132321417, "phrase": "peer_assistance"}, {"score": 0.0030941521409613417, "phrase": "semipersistent_file_availability"}, {"score": 0.002889672003089062, "phrase": "key_challenges"}, {"score": 0.0024311346712789553, "phrase": "first_attempt"}, {"score": 0.0023536149458842992, "phrase": "new_peer-assisted_semipersistent_online_file"}, {"score": 0.0021509807762081145, "phrase": "mainland_china"}], "paper_keywords": ["Online hosting", " content distribution", " peer-to-peer protocols", " measurement studies"], "paper_abstract": "It has been widely acknowledged that online file hosting systems within the \"cloud\" of the Internet have provided valuable services to end users who wish to share files of any size. Such online hosting services are typically provided by dedicated servers, either in content distribution networks (CDNs) or large data centers. Server bandwidth costs, however, are prohibitive in these cases, especially when serving large volumes of files to a large number of users. Though it seems intuitive to take advantage of peer upload bandwidth to mitigate such server bandwidth costs in a complementary fashion, it is not trivial to design and fine-tune important aspects of such peer-assisted online hosting in a real-world large-scale deployment. This paper presents FS2You, a large-scale and real-world online file hosting system with peer assistance and semipersistent file availability. FS2You is designed to dramatically mitigate server bandwidth costs. In this paper, we show a number of key challenges involved in such a design objective, our architectural and protocol design in response to these challenges, as well as an extensive measurement study at a large scale to demonstrate the effectiveness of our design, using real-world traces that we have collected. To our knowledge, this paper represents the first attempt to design, implement, and evaluate a new peer-assisted semipersistent online file hosting system at a realistic scale. Since the launch of FS2You, it has quickly become one of the most popular online file hosting systems in mainland China, and a favorite in many online forums across the country.", "paper_title": "FS2You: Peer-Assisted Semipersistent Online Hosting at a Large Scale", "paper_id": "WOS:000281030200005"}