{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conceptual_modeling"}, {"score": 0.004332894955218135, "phrase": "software_providers"}, {"score": 0.0037508743235608872, "phrase": "major_purposes"}, {"score": 0.0035330290755534234, "phrase": "modeling_techniques"}, {"score": 0.003327805740599293, "phrase": "uml"}, {"score": 0.0032582312803728724, "phrase": "modeling_technique_use"}, {"score": 0.0031565959573536194, "phrase": "medium-sized_organizations"}, {"score": 0.0030689098754563982, "phrase": "larger_organizations"}, {"score": 0.002994178996584381, "phrase": "technique_use"}, {"score": 0.0029109914689364465, "phrase": "inverted_u-shaped_curve"}, {"score": 0.0028601736602156033, "phrase": "prior_explanations"}, {"score": 0.002810240488642749, "phrase": "important_contribution"}, {"score": 0.002415170557932468, "phrase": "user_expectations_management"}, {"score": 0.0022192891418394514, "phrase": "database_design"}, {"score": 0.002188219483646592, "phrase": "business_process_documentation"}, {"score": 0.00217284779477444, "phrase": "business_process_improvement"}, {"score": 0.0021499920551456956, "phrase": "software_development"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["conceptual modeling", " business systems analysis", " modeling techniques", " modeling tools", " project size", " modeler experience"], "paper_abstract": "Much research has been devoted over the years to investigating and advancing the techniques and tools used by analysts when they model. As opposed to what academics, software providers and their resellers promote as should be happening, the aim of this research was to determine whether practitioners still embraced conceptual modeling seriously. In addition, what are the most popular techniques and tools used for conceptual modeling? What are the major purposes for which conceptual modeling is used? The study found that the top six most frequently used modeling techniques and methods were ER diagramming, data flow diagramming, systems flowcharting, workflow modeling, UML, and structured charts. Modeling technique use was found to decrease significantly from smaller to medium-sized organizations, but then to increase significantly in larger organizations (proxying for large, complex projects). Technique use was also found to significantly follow an inverted U-shaped curve, contrary to some prior explanations. Additionally, an important contribution of this study was the identification of the factors that uniquely influence the decision of analysts to continue to use modeling, viz., communication (using diagrams) to/from stakeholders, internal knowledge (lack of) of techniques, user expectations management, understanding models' integration into the business, and tool/software deficiencies. The highest ranked purposes for which modeling was undertaken were database design and management, business process documentation, business process improvement, and software development. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "How do practitioners use conceptual modeling in practice?", "paper_id": "WOS:000239263100007"}