{"auto_keywords": [{"score": 0.040065510922166446, "phrase": "component_evaluation_functions"}, {"score": 0.0378535027320788, "phrase": "fitness_changes"}, {"score": 0.032249575483827224, "phrase": "evaluation_functions"}, {"score": 0.00481495049065317, "phrase": "fitness_evaluation_functions"}, {"score": 0.004734718930096544, "phrase": "large_multi-component_systems"}, {"score": 0.004616859702338596, "phrase": "distributed_control_policies"}, {"score": 0.004552648949390462, "phrase": "dynamic_and_stochastic_environments"}, {"score": 0.004402147102967893, "phrase": "entire_system"}, {"score": 0.00436530211426514, "phrase": "search_space"}, {"score": 0.004232811526417572, "phrase": "satisfactory_results"}, {"score": 0.00411584380698062, "phrase": "evolving_system_components"}, {"score": 0.003946400753785508, "phrase": "exploding_state_space_concern"}, {"score": 0.003752216951715829, "phrase": "global_evaluation_function"}, {"score": 0.0034014736691766957, "phrase": "first_issue"}, {"score": 0.0033447157263095223, "phrase": "resulting_system"}, {"score": 0.003288901736901966, "phrase": "second_issue"}, {"score": 0.003234016105312037, "phrase": "evolutionary_process"}, {"score": 0.0031182092708983184, "phrase": "good_solutions"}, {"score": 0.0029233560054443483, "phrase": "distributed_control_problem"}, {"score": 0.00289885212998798, "phrase": "multiple_rovers"}, {"score": 0.0028745530564286003, "phrase": "aggregate_information"}, {"score": 0.0025335185138829638, "phrase": "generalized_solutions"}, {"score": 0.002505232141865839, "phrase": "difficult_coordination_problem"}, {"score": 0.0024842242921857705, "phrase": "control_policy"}, {"score": 0.002463392170671618, "phrase": "aligned_and_component-sensitive_evaluation_functions"}, {"score": 0.0021228055195257173, "phrase": "systematic_study"}, {"score": 0.0021049977753042253, "phrase": "presented_fitness_functions"}], "paper_keywords": ["evolution strategies", " distributed control", " fitness evaluation"], "paper_abstract": "This paper presents fitness evaluation functions that efficiently evolve coordination in large multi-component systems. In particular, we focus on evolving distributed control policies that are applicable to dynamic and stochastic environments. While it is appealing to evolve such policies directly for an entire system, the search space is prohibitively large in most cases to allow such an approach to provide satisfactory results. Instead, we present an approach based on evolving system components individually where each component aims to maximize its own fitness function. Though this approach sidesteps the exploding state space concern, it introduces two new issues: (1) how to create component evaluation functions that are aligned with the global evaluation function; and (2) how to create component evaluation functions that are sensitive to the fitness changes of that component, while remaining relatively insensitive to the fitness changes of other components in the system. If the first issue is not addressed, the resulting system becomes uncoordinated; if the second issue is not addressed, the evolutionary process becomes either slow to converge or worse, incapable of converging to good solutions. This paper shows how to construct evaluation functions that promote coordination by satisfying these two properties. We apply these evaluation functions to the distributed control problem of coordinating multiple rovers to maximize aggregate information collected. We focus on environments that are highly dynamic (changing points of interest), noisy (sensor and actuator faults), and communication limited (both for observation of other rovers and points of interest) forcing the rovers to evolve generalized solutions. On this difficult coordination problem, the control policy evolved using aligned and component-sensitive evaluation functions outperforms global evaluation functions by up to 400%. More notably, the performance improvements increase when the problems become more difficult (larger, noisier, less communication). In addition we provide an analysis of the results by quantifying the two characteristics (alignment and sensitivity discussed above) leading to a systematic study of the presented fitness functions.", "paper_title": "Efficient evaluation functions for evolving coordination", "paper_id": "WOS:000256957800004"}