{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "penalty-logic_simple-transition_model"}, {"score": 0.004580933283492972, "phrase": "hidden-state_sequences"}, {"score": 0.004215822147200971, "phrase": "viterbi"}, {"score": 0.004180919839686364, "phrase": "graphical_model_inference_exhibit_exponential_complexity"}, {"score": 0.004077995480957875, "phrase": "main_motivation"}, {"score": 0.00396110232316167, "phrase": "restricted_space"}, {"score": 0.003863568356785813, "phrase": "efficient_inference"}, {"score": 0.003285380677401785, "phrase": "complex_processes"}, {"score": 0.002816814445002924, "phrase": "sequential_inference"}, {"score": 0.0027020387992490367, "phrase": "minimum-cost_state_sequence"}, {"score": 0.0026354246446771324, "phrase": "single-state_minimization"}, {"score": 0.002496659907186784, "phrase": "temporal-cost_models"}, {"score": 0.0024554476124885806, "phrase": "penalty_logic"}, {"score": 0.0024149139610228887, "phrase": "logical_constraints"}, {"score": 0.0023261372216194383, "phrase": "practically_efficient_ssm_computation"}, {"score": 0.0022036216160494925, "phrase": "labeled_training_data"}, {"score": 0.002176275802465835, "phrase": "perceptron_updates"}], "paper_keywords": ["temporal models", " sequential inference", " weighted logic", " relational learning"], "paper_abstract": "We study the problem of learning to infer hidden-state sequences of processes whose states and observations are propositionally or relationally factored. Unfortunately, standard exact inference techniques such as Viterbi and graphical model inference exhibit exponential complexity for these processes. The main motivation behind our work is to identify a restricted space of models, which facilitate efficient inference, yet are expressive enough to remain useful in many applications. In particular, we present the penalty-logic simple-transition model, which utilizes a very simple-transition structure where the transition cost between any two states is constant. While not appropriate for all complex processes, we argue that it is often rich enough in many applications of interest, and when it is applicable there can be inference and learning advantages compared to more general models. In particular, we show that sequential inference for this model, that is, finding a minimum-cost state sequence, efficiently reduces to a single-state minimization (SSM) problem. We then show how to define a temporal-cost models in terms of penalty logic, or weighted logical constraints, and how to use this representation for practically efficient SSM computation. We present a method for learning the weights of our model from labeled training data based on Perceptron updates. Finally, we give experiments in both propositional and relational video-interpretation domains showing advantages compared to more general models.", "paper_title": "A PENALTY-LOGIC SIMPLE-TRANSITION MODEL FOR STRUCTURED SEQUENCES", "paper_id": "WOS:000271494600002"}