{"auto_keywords": [{"score": 0.047626415189153566, "phrase": "pufferfish"}, {"score": 0.04697767870094293, "phrase": "pufferfish_framework"}, {"score": 0.00481495049065317, "phrase": "mathematical_privacy_definitions"}, {"score": 0.004612376827433774, "phrase": "new_and_general_privacy_framework"}, {"score": 0.004376273644295806, "phrase": "new_privacy_definitions"}, {"score": 0.003958439439112026, "phrase": "application_domain"}, {"score": 0.0037199473428123175, "phrase": "rigorous_privacy_definitions"}, {"score": 0.003429544382524185, "phrase": "existing_privacy_definitions"}, {"score": 0.00326939082861424, "phrase": "privacy_framework"}, {"score": 0.0029853535424953595, "phrase": "data_records"}, {"score": 0.002845883666777154, "phrase": "privacy_definition"}, {"score": 0.0024185182010749273, "phrase": "broader_context"}, {"score": 0.0022725931637071852, "phrase": "unbounded_continuous_attributes"}, {"score": 0.0022509365210787993, "phrase": "aggregate_information"}, {"score": 0.0021049977753042253, "phrase": "prior_data_releases"}], "paper_keywords": ["Theory", " Privacy", " differential privacy"], "paper_abstract": "In this article, we introduce a new and general privacy framework called Pufferfish. The Pufferfish framework can be used to create new privacy definitions that are customized to the needs of a given application. The goal of Pufferfish is to allow experts in an application domain, who frequently do not have expertise in privacy, to develop rigorous privacy definitions for their data sharing needs. In addition to this, the Pufferfish framework can also be used to study existing privacy definitions. We illustrate the benefits with several applications of this privacy framework: we use it to analyze differential privacy and formalize a connection to attackers who believe that the data records are independent; we use it to create a privacy definition called hedging privacy, which can be used to rule out attackers whose prior beliefs are inconsistent with the data; we use the framework to define and study the notion of composition in a broader context than before; we show how to apply the framework to protect unbounded continuous attributes and aggregate information; and we show how to use the framework to rigorously account for prior data releases.", "paper_title": "Pufferfish: A Framework for Mathematical Privacy Definitions", "paper_id": "WOS:000331124300003"}