{"auto_keywords": [{"score": 0.049270547314558835, "phrase": "virtual_fence"}, {"score": 0.046035214514751704, "phrase": "virtual_fencing"}, {"score": 0.033407905477225865, "phrase": "defined_area"}, {"score": 0.00481495049065317, "phrase": "virtual_fences"}, {"score": 0.0044722886002206115, "phrase": "physical_barrier"}, {"score": 0.004334728271766392, "phrase": "free-ranging_livestock"}, {"score": 0.0041657281535389615, "phrase": "ecological_management"}, {"score": 0.004095323392273661, "phrase": "manual_labour"}, {"score": 0.004072119477195683, "phrase": "cognitive_labour"}, {"score": 0.003980605886671834, "phrase": "livestock_managers"}, {"score": 0.003760685138103153, "phrase": "managing_areas"}, {"score": 0.003634587156159668, "phrase": "patent_and_literature_search"}, {"score": 0.00284611764456298, "phrase": "moving_fence_line"}, {"score": 0.002790004829699627, "phrase": "remote_gathering_device"}, {"score": 0.0027662954811372154, "phrase": "first_two_categories"}, {"score": 0.002742787059497186, "phrase": "static_control"}, {"score": 0.0026963662375234124, "phrase": "third_category"}, {"score": 0.002482810873598809, "phrase": "energy_use"}, {"score": 0.00235213013487844, "phrase": "welfare_standards"}, {"score": 0.0023057340422299737, "phrase": "wide_range"}, {"score": 0.0022283123058680658, "phrase": "virtual_fencing_offers"}, {"score": 0.0021412594173592513, "phrase": "marketable_product"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Animal welfare", " Fence injury", " Global positioning system", " Learning behaviour", " Nature conservation", " Remote gathering"], "paper_abstract": "A virtual fence can be defined as a structure serving as an enclosure, a barrier, or a boundary without a physical barrier. The concept of virtual fencing occurs increasingly in discussions wherever free-ranging livestock is managed. It is especially interesting because of its potential to initially enhance ecological management, improve management by turning manual labour into cognitive labour as well as improve the life-style of livestock managers. All of these have the potential to reduce costs. Moreover, it opens up the possibility of managing areas that are not manageable at the moment. Therefore, a patent and literature search was conducted to investigate what virtual fencing involves, what opportunities there are for implementing it and what issues still need to be tackled. It was found that there are many different approaches in the development of virtual fencing, which can be split into three categories: first, to contain animals in a defined area or keep them out of a defined area using devices that are animal-borne: second, to contain animals without mounting a device onto the animal; and third, keeping animals apart with a moving fence line or using a virtual fence as a remote gathering device. The first two categories deal with static control of livestock, whereas the third category could be described as a control within moving boundaries. However, despite many patents having been found, only very few products are available on the market. Two important development areas are the energy use of the device and provision of a system that animals can easily understand, in order to assure welfare standards. The paper critically analyses the wide range of developments to date and points out the advantages and challenges virtual fencing offers. It also provides an indication of how far we are from a marketable product. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "The evolution of virtual fences: A review", "paper_id": "WOS:000286713700002"}