{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "unsaturated_soils"}, {"score": 0.009662756243973092, "phrase": "unsaturated_analysis"}, {"score": 0.004584495834677719, "phrase": "slope_failure"}, {"score": 0.004448169552315403, "phrase": "fully_saturated_conditions"}, {"score": 0.0038392331564122387, "phrase": "unsaturated_silty_soil"}, {"score": 0.00378167947598949, "phrase": "finite_element_method"}, {"score": 0.0037390789999636764, "phrase": "hypothetical_boundary_value_problem"}, {"score": 0.003546513036085932, "phrase": "unsaturated_soil_behaviour"}, {"score": 0.0034933321145368336, "phrase": "appropriate_constitutive"}, {"score": 0.003467040410632942, "phrase": "soil-water_retention_curve_models"}, {"score": 0.00340217066797559, "phrase": "second_one"}, {"score": 0.0033893426032054366, "phrase": "full_saturation"}, {"score": 0.0032884384364324395, "phrase": "saturated_soil_permeability"}, {"score": 0.0031784960695034645, "phrase": "apparent_cohesion"}, {"score": 0.00307221807606505, "phrase": "groundwater_table"}, {"score": 0.0028919522313933525, "phrase": "parametric_study"}, {"score": 0.002859345731792013, "phrase": "analyses_results"}, {"score": 0.002591681512611419, "phrase": "fully_saturated_soils"}, {"score": 0.0023137485947956732, "phrase": "conservative_results"}, {"score": 0.0022110892229209407, "phrase": "geotechnical_practice"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Factor of safety", " Unsaturated", " Analysis", " Excavated slopes"], "paper_abstract": "While the evolution with time of the factor of safety against slope failure is well understood for excavations performed under fully saturated conditions, this evolution has not been extensively studied for excavations carried out in unsaturated soils. The objective of this paper is to investigate the relationship between the factor of safety and time for an excavation performed in an unsaturated silty soil, employing the finite element method. A hypothetical boundary value problem is considered and two types of analyses performed; in the first one, unsaturated soil behaviour is modelled through appropriate constitutive and soil-water retention curve models, whereas in the second one full saturation is assumed. The effect that the saturated soil permeability, its variation with suction, the increase of apparent cohesion due to suction, the depth of the groundwater table and the hydraulic hysteresis have on the results of the unsaturated analysis is examined in a parametric study. The analyses results demonstrate that for unsaturated soils the factor of safety may increase with time, in contrast to what is commonly accepted to be the case in fully saturated soils. Furthermore, it is not possible to know in advance which one of the two types of analysis performed (i.e. the saturated or the unsaturated) will produce conservative results. It is, therefore, advisable to perform unsaturated analysis in geotechnical practice, when dealing with excavations in such soils. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Variation with time of the factor of safety of slopes excavated in unsaturated soils", "paper_id": "WOS:000315064700017"}