{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "developmental_learning"}, {"score": 0.04082659506592874, "phrase": "robot_coordination_skills"}, {"score": 0.028537408917334712, "phrase": "learning_errors"}, {"score": 0.004536244367689415, "phrase": "cognitive_developments"}, {"score": 0.004446958354683721, "phrase": "behaviour_changes"}, {"score": 0.004396725551762061, "phrase": "neural_growth"}, {"score": 0.004297948502679085, "phrase": "ultimate_goal"}, {"score": 0.0042614794708537235, "phrase": "intelligent_artificial_system"}, {"score": 0.0041657281535389615, "phrase": "similar_way"}, {"score": 0.004130376386308024, "phrase": "mental_development"}, {"score": 0.00402610372759447, "phrase": "different_environments"}, {"score": 0.0038362452557685134, "phrase": "developmental_psychology"}, {"score": 0.0036037265181631324, "phrase": "sensor-motor_coordination"}, {"score": 0.003542786326740931, "phrase": "inter-modality_mapping"}, {"score": 0.003309124298009635, "phrase": "learning_process"}, {"score": 0.0032810180076973806, "phrase": "rbf_network"}, {"score": 0.0031529693013776852, "phrase": "robot_interaction"}, {"score": 0.0030645676308053444, "phrase": "simplified_extended_kalman_filter_algorithm"}, {"score": 0.003004160926679449, "phrase": "possible_biological_evidence"}, {"score": 0.002953329533402266, "phrase": "learning_algorithm"}, {"score": 0.0028219328009498348, "phrase": "learning_error"}, {"score": 0.002790004829699627, "phrase": "intrinsic_motivation"}, {"score": 0.002635688414237179, "phrase": "laboratory_robot_system"}, {"score": 0.0025763725301629846, "phrase": "colour_ccd_camera"}, {"score": 0.002554473969803701, "phrase": "experimental_results"}, {"score": 0.00235883374582576, "phrase": "different_tool_sizes"}, {"score": 0.002221978799937664, "phrase": "receptive_field"}, {"score": 0.0021291034698159837, "phrase": "active_learning_approach"}, {"score": 0.0021049977753042253, "phrase": "nonuniform_distribution"}], "paper_keywords": ["cognitive robotics", " developmental psychology", " intra-modal and inter-modal coordination development", " neuroscience"], "paper_abstract": "From infants to adults, each individual undergoes changes both physically and mentally through interaction with environments. These cognitive developments are usually staged, exhibited as behaviour changes and supported by neural growth and shrinking in the brain. The ultimate goal for an intelligent artificial system is to automatically build its skills in a similar way as the mental development in humans and animals, and adapt to different environments. In this paper, we present an approach to constructing robot coordination skills by developmental learning inspired by developmental psychology and neuroscience. In particular, we investigated the learning of two types of robot coordination skills: intra-modality mapping such as sensor-motor coordination of the arm; and inter-modality mapping such as eye/hand coordination. A self-organising radial basis function (RBF) network is used as the substrate to support the learning process. The RBF network grows or shrinks according to the novelty of the data obtained during the robot interaction with environment, and its parameters are adjusted by a simplified extended Kalman filter algorithm. The paper further reveals the possible biological evidence to support both the system architecture, the learning algorithm, and the adaptation of the system to its bodily changes such as in tool-use. The learning error was regarded as intrinsic motivation to drive the system to actively explore the workspace and reduce the learning errors. We tested our algorithms on a laboratory robot system with two industrial quality manipulator arms and a motorised pan/tilt head carrying a colour CCD camera. The experimental results demonstrated that the system can develop its intra-modal and inter-modal coordination skills by constructing mapping networks in a similar way as humans and animals during their early cognition development. In order to adapt to different tool sizes, the system can quickly reuse and adjust its learned knowledge in terms of the number of neurons, the size of receptive field of each neuron and the contribution from each neuron in the network. The active learning approach greatly reduces the nonuniform distribution of the learning errors.", "paper_title": "Construction of robot intra-modal and inter-modal coordination skills by developmental learning", "paper_id": "WOS:000243324600009"}