{"auto_keywords": [{"score": 0.04836165556138413, "phrase": "gpu"}, {"score": 0.010612030518045535, "phrase": "low-rank_approximation"}, {"score": 0.010468536782251073, "phrase": "dense_matrix"}, {"score": 0.010373942540025412, "phrase": "multicore_cpus"}, {"score": 0.007862271444356417, "phrase": "gpu."}, {"score": 0.004516856326107826, "phrase": "hierarchically_semiseparable_linear_system"}, {"score": 0.004435112270935294, "phrase": "low-rank_matrices"}, {"score": 0.0037626342268042997, "phrase": "qr_factorization"}, {"score": 0.003433987036569199, "phrase": "postprocessing_time"}, {"score": 0.0033410898465226417, "phrase": "restricted_pivoting"}, {"score": 0.0032805541677236325, "phrase": "modern_cpu."}, {"score": 0.003091262582401731, "phrase": "factorization_process"}, {"score": 0.0029128692116317263, "phrase": "nvidia"}, {"score": 0.002782647772219627, "phrase": "factorization_time"}, {"score": 0.0024593458703463474, "phrase": "recently_developed_software_strumf"}, {"score": 0.002370955769074803, "phrase": "general_sparse_linear_system"}, {"score": 0.0022857351723674004, "phrase": "poisson's_equations"}, {"score": 0.002244277924422011, "phrase": "proposed_techniques"}, {"score": 0.002193509835371438, "phrase": "preconditioner_construction_time"}, {"score": 0.0021049977753042253, "phrase": "construction_time"}], "paper_keywords": [""], "paper_abstract": "Low-rank matrices arise in many scientific and engineering computations. Both computational and storage costs of manipulating such matrices may be reduced by taking advantages of their low-rank properties. To compute a low-rank approximation of a dense matrix, in this paper, we study the performance of QR factorization with column pivoting or with restricted pivoting on multicore CPUs with a GPU. We first propose several techniques to reduce the postprocessing time, which is required for restricted pivoting, on a modern CPU. We then examine the potential of using a GPU to accelerate the factorization process with both column and restricted pivoting. Our performance results on two eight-core Intel Sandy Bridge CPUs with one NVIDIA Kepler GPU demonstrate that using the GPU, the factorization time can be reduced by a factor of more than two. In addition, to study the performance of our implementations in practice, we integrate them into a recently developed software StruMF which algebraically exploits such low-rank structures for solving a general sparse linear system of equations. Our performance results for solving Poisson's equations demonstrate that the proposed techniques can significantly reduce the preconditioner construction time of StruMF on the CPUs, and the construction time can be further reduced by 10%-50% using the GPU.", "paper_title": "Computing Low-Rank Approximation of a Dense Matrix on Multicore CPUs with a GPU and Its Application to Solving a Hierarchically Semiseparable Linear System of Equations", "paper_id": "WOS:000350422400001"}