{"auto_keywords": [{"score": 0.0493610694808119, "phrase": "combinatorial_pyramid"}, {"score": 0.00481495049065317, "phrase": "range_images"}, {"score": 0.004695183699894267, "phrase": "rgb-d_cameras"}, {"score": 0.00418134346679498, "phrase": "relatively_accurate_cloud"}, {"score": 0.003995876175614403, "phrase": "organized_cloud"}, {"score": 0.00376127170364341, "phrase": "small_planar_patch"}, {"score": 0.0033492947290751996, "phrase": "parametric_surface_models"}, {"score": 0.002952356518921907, "phrase": "small_patches"}, {"score": 0.0026688629249775925, "phrase": "simple_geometric_models"}, {"score": 0.0026420518944303716, "phrase": "curvature_information"}, {"score": 0.0026155094974689595, "phrase": "model_information"}, {"score": 0.0023405257495466352, "phrase": "higher_levels"}, {"score": 0.0021917966722180132, "phrase": "geometric_items"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Irregular pyramids", " RGB-D cameras", " Image segmentation"], "paper_abstract": "RGB-D cameras are not only able to provide color (Red-Green-Blue -RGB-) information from the scene but also a relatively accurate cloud of 3D points. Using information coming from this organized cloud, it is possible to define around each image pixel a small planar patch and obtain its normal vector. Within the framework of the combinatorial pyramid, this paper describes a method to abstract from these normals to parametric surface models. The method works at two consecutive stages. Firstly, normals are hierarchically grouped to divide up the image into superpixels. These superpixels capture small patches on the scene that belong to the same surface. Then, they are merged to segment the scene into simple geometric models. Curvature information and model information are used to divide up the image into planes, cylinders and/or spheres. This paper shows how, in the higher levels of abstraction of the combinatorial pyramid, scenes can be described using these geometric items and their topological relationships. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Hierarchical segmentation of range images inside the combinatorial pyramid", "paper_id": "WOS:000357910700009"}