{"auto_keywords": [{"score": 0.04613130232163521, "phrase": "support_vector_machine"}, {"score": 0.02226877610408211, "phrase": "logistic_regression"}, {"score": 0.00481495049065317, "phrase": "credit_scoring"}, {"score": 0.0038846843242954935, "phrase": "new_way"}, {"score": 0.003701401653850141, "phrase": "orthogonal_dimension_reduction"}, {"score": 0.003603327452846714, "phrase": "related_properties"}, {"score": 0.003133606233823455, "phrase": "german"}, {"score": 0.0030017207229983385, "phrase": "interesting_phenomenon"}, {"score": 0.0027991418754844347, "phrase": "'dimensional_interference"}, {"score": 0.0024209250169088575, "phrase": "dummy_variables"}, {"score": 0.0023950275815082297, "phrase": "orthogonal_extracting_feature"}, {"score": 0.002209406458446019, "phrase": "better_performance"}, {"score": 0.0021857667493036786, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Dimension curse", " Orthogonal dimension reduction", " Support vector machine", " Logistic regression", " Principal component analysis", " Credit scoring"], "paper_abstract": "The most commonly used techniques for credit scoring is logistic regression, and more recent research has proposed that the support vector machine is a more effective method. However, both logistic regression and support vector machine suffers from curse of dimension. In this paper, we introduce a new way to address this problem which is defined as orthogonal dimension reduction. We discuss the related properties of this method in detail and test it against other common statistical approaches principal component analysis and hybridizing logistic regression to better solve and evaluate the data. With experiments on German data set, there is also an interesting phenomenon with respect to the use of support vector machine, which we define as 'Dimensional interference', and discuss in general. Based on the results of cross-validation, it can be found that through the use of logistic regression filtering the dummy variables and orthogonal extracting feature, the support vector machine not only reduces complexity and accelerates convergence, but also achieves better performance. Crown Copyright (C) 2012 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Orthogonal support vector machine for credit scoring", "paper_id": "WOS:000314672400016"}