{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-agent_systems"}, {"score": 0.04141596127396747, "phrase": "computer_applications"}, {"score": 0.03836857540761451, "phrase": "autonomous_agents"}, {"score": 0.004498812433096501, "phrase": "explosive_growth"}, {"score": 0.004299621153829837, "phrase": "information_technologies"}, {"score": 0.004039995317682942, "phrase": "increasing_power"}, {"score": 0.003882970272082245, "phrase": "tremendous_opportunities"}, {"score": 0.003689982350051231, "phrase": "personal_privacy"}, {"score": 0.003332210257373994, "phrase": "personal_information"}, {"score": 0.0031665087019813244, "phrase": "crucial_role"}, {"score": 0.0027794243746094905, "phrase": "intrinsic_features"}, {"score": 0.0026864540069792275, "phrase": "artificial_intelligence"}, {"score": 0.0022661190184053628, "phrase": "privacy-related_studies"}, {"score": 0.0021655683497137234, "phrase": "open_challenges"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": [""], "paper_abstract": "Privacy has been a concern for humans long before the explosive growth of the Internet. The advances in information technologies have further increased these concerns. This is because the increasing power and sophistication of computer applications offers both tremendous opportunities for individuals, but also significant threats to personal privacy. Autonomous agents and multi-agent systems are examples of the level of sophistication of computer applications. Autonomous agents usually encapsulate personal information describing their principals, and therefore they play a crucial role in preserving privacy. Moreover, autonomous agents themselves can be used to increase the privacy of computer applications by taking advantage of the intrinsic features they provide, such as artificial intelligence, pro-activeness, autonomy, and the like. This article introduces the problem of preserving privacy in computer applications and its relation to autonomous agents and multi-agent systems. It also surveys privacy-related studies in the field of multi-agent systems and identifies open challenges to be addressed by future research.", "paper_title": "A survey of privacy in multi-agent systems", "paper_id": "WOS:000335848200002"}