{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "smartcard-based_payment_systems"}, {"score": 0.03764746659477248, "phrase": "personal_information"}, {"score": 0.004632039024076267, "phrase": "public_metro_transit_systems"}, {"score": 0.0042591158963728665, "phrase": "process_data_transactions"}, {"score": 0.00409723267214392, "phrase": "relevant_entities"}, {"score": 0.0033971539563683174, "phrase": "great_benefits"}, {"score": 0.003331915219811852, "phrase": "improved_services"}, {"score": 0.0032468685934998335, "phrase": "increased_revenues"}, {"score": 0.0032051601987130207, "phrase": "decreased_costs"}, {"score": 0.003004494701922268, "phrase": "important_issues"}, {"score": 0.0025892330566358503, "phrase": "new_public_metro_transit_systems"}, {"score": 0.002260301305523054, "phrase": "privacy_information"}, {"score": 0.0021049977753042253, "phrase": "proposed_framework"}], "paper_keywords": [""], "paper_abstract": "The advances in technology have enabled us to share information, process data transactions, and enhance collaborations with relevant entities effectively. Its unparalleled adoption in both the public and private sectors is raising heightened concerns, particularly in the areas of the collection and management of personal information. The use of personal information can provide great benefits, including improved services for customers and increased revenues and decreased costs for businesses. However, it has also raised important issues such as the misuse of their personal information and loss of privacy. In this paper, we propose a framework.to preserve privacy in new Public Metro Transit Systems that incorporates smartcard-based payment systems. The proposed framework leverages cryptographic protocols and an innovative privacy model to ensure the protection of privacy information of the cardholders. We also overview our system architecture for the proposed framework including case learned.", "paper_title": "Ensuring privacy in smartcard-based payment systems: A case study of Public Metro Transit Systems", "paper_id": "WOS:000242311100019"}