{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "abortive_paradigm"}, {"score": 0.012296909584276811, "phrase": "model-theoretic_refinement"}, {"score": 0.00471228691115201, "phrase": "new_strand"}, {"score": 0.004481132747216135, "phrase": "partial_relations"}, {"score": 0.004385555408850022, "phrase": "linguistic_vehicle"}, {"score": 0.004037608759610068, "phrase": "lifted-totalisation_semantics"}, {"score": 0.003965684670332574, "phrase": "de_facto_standard_notion"}, {"score": 0.0038119123317396954, "phrase": "semantic_elements"}, {"score": 0.003521961918342562, "phrase": "first_part"}, {"score": 0.003459191419478298, "phrase": "simpler_framework"}, {"score": 0.0031730701021262155, "phrase": "firing-conditions_refinement"}, {"score": 0.0030609320300175953, "phrase": "natural_properties"}, {"score": 0.0029740732099993706, "phrase": "second_part"}, {"score": 0.0028792911886505526, "phrase": "simulation-based_data-refinement"}, {"score": 0.00284837132359445, "phrase": "proof-theoretic_approach"}, {"score": 0.002797572252783356, "phrase": "formal_analysis"}, {"score": 0.002747676657869163, "phrase": "mathematical_apparatus"}, {"score": 0.0026889720516076205, "phrase": "precisely_the_relationships"}, {"score": 0.0025660347613972573, "phrase": "general_mathematical_role"}, {"score": 0.0023877589586497948, "phrase": "unique_interaction"}, {"score": 0.0022950308685133224, "phrase": "data_simulations"}, {"score": 0.0021587414711262904, "phrase": "mathematical_analysis"}, {"score": 0.0021049977753042253, "phrase": "extreme_specifications"}], "paper_keywords": ["data-refinement", " operation-refinement", " specification language", " specification logic"], "paper_abstract": "This paper presents a new strand of investigation which complements our previous investigation of refinement for specifications whose semantics is given by partial relations (using Z as a linguistic vehicle for this semantics). It revolves around extending our mathematical apparatus so as to continue our quest for examining mathematically the essence of the lifted-totalisation semantics (which underlies the de facto standard notion of refinement in Z) and the role of the semantic elements perpendicular to in model-theoretic refinement, but this time in the abortive paradigm. The analysis is given in two salient parts. In the first part, we consider the simpler framework of operation-refinement: we examine the (de facto) standard account of operation-refinement in this regime by introducing a simpler, normative theory which captures the notion of firing-conditions refinement directly in the language and in terms of the natural properties of preconditions and postconditions. In the second part, we generalise our analysis to a more intricate investigation of simulation-based data-refinement. The proof-theoretic approach we undertake in the formal analysis provides us with a mathematical apparatus which enables us to examine precisely the relationships amongst the various theories of refinement. This enables us to examine the general mathematical role that the perpendicular to values play in model-theoretic refinement in the abortive paradigm, as well as the significance of the unique interaction of these values with the notions of lifting (of data simulations) and lifted-totalisation (of operations) in this regime. Furthermore, we generalise this mathematical analysis to a more conceptual one which also involves extreme specifications.", "paper_title": "An analysis of refinement in an abortive paradigm", "paper_id": "WOS:000240071700005"}