{"auto_keywords": [{"score": 0.03762867376091313, "phrase": "building_blocks"}, {"score": 0.03280109928432293, "phrase": "sound_cues"}, {"score": 0.00481495049065317, "phrase": "haptic_collaborative_virtual_environments"}, {"score": 0.004464602028530629, "phrase": "audio_feedback"}, {"score": 0.004401794742140806, "phrase": "haptic_and_visual_interface"}, {"score": 0.0043194180167921165, "phrase": "sighted_and_people"}, {"score": 0.004159241394996858, "phrase": "group_design"}, {"score": 0.003626626504149897, "phrase": "composed_objects"}, {"score": 0.0033308077968426937, "phrase": "touch_feedback_pointing_device"}, {"score": 0.0026543514413663893, "phrase": "haptic_feedback"}, {"score": 0.002449208093757498, "phrase": "work_process"}, {"score": 0.0023694065215394593, "phrase": "important_role"}, {"score": 0.0023139986108451967, "phrase": "ongoing_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Haptic", " Audio", " Multimodal interfaces", " Collaboration", " Problem solving"], "paper_abstract": "In this paper a study is presented which aimed at exploring the effects of audio feedback in a haptic and visual interface supporting collaboration among sighted and people who cannot see. A between group design was used and the participants worked in pairs with one sighted and one blindfolded in each. The application used was a haptic 3D environment in which participants could build composed objects out of building blocks. The building blocks could be picked up and moved around by means of a touch feedback pointing device. In one version of the application, used by half of the groups, sound cues could be used to tell the other person where you were, and to get feedback on your own and the other person's actions. Results showed that sound cues together with haptic feedback made a difference in the interaction between the collaborators regarding their shared understanding of the workspace and the work process. Especially, sound cues played an important role for maintaining awareness of ongoing work you knew what was going on, and you got a response on your own actions. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Audio makes a difference in haptic collaborative virtual environments", "paper_id": "WOS:000285176600010"}