{"auto_keywords": [{"score": 0.04829088285990108, "phrase": "cell_cycle"}, {"score": 0.014977027720431862, "phrase": "vascular_endothelial_cells"}, {"score": 0.009727161965557604, "phrase": "responsive_ppi_networks"}, {"score": 0.00481495049065317, "phrase": "time-course_network_analysis"}, {"score": 0.004762893904448436, "phrase": "tnf-alpha"}, {"score": 0.003531474887552889, "phrase": "molecular_mechanism"}, {"score": 0.003167217223469026, "phrase": "microarray_datasets"}, {"score": 0.0031329184724341592, "phrase": "genome-wide_ppi_datasets"}, {"score": 0.0030157628075954588, "phrase": "topological_properties"}, {"score": 0.0029029754274913803, "phrase": "node_degree"}, {"score": 0.0028715299874549245, "phrase": "node_betweenness_centralization"}, {"score": 0.0024923577071656014, "phrase": "ppi_networks"}, {"score": 0.0021396960731214203, "phrase": "cell_cycle_activation"}, {"score": 0.0021049977753042253, "phrase": "vascular_endothelial_growth_factor"}], "paper_keywords": [""], "paper_abstract": "Motivation: Tumor necrosis factor-alpha (TNF-alpha), a major inflammatory cytokine, is closely related to several cardiovascular pathological processes. However, its effects on the cell cycle of vascular endothelial cells (VECs) have been the subject of some controversy. To investigate the molecular mechanism underlying this process, we constructed time-course protein-protein interaction (PPI) networks of TNF-alpha induced regulation of cell cycle in VECs using microarray datasets and genome-wide PPI datasets. Then, we analyzed the topological properties of the responsive PPI networks and calculated the node degree and node betweenness centralization of each gene in the networks. We found that p21, p27 and cyclinD1, key genes of the G1/S checkpoint, are in the center of responsive PPI networks and their roles in PPI networks are significantly altered with induction of TNF-alpha. According to the following biological experiments, we proved that TNF-alpha can promote G1/S transition of cell cycle in VECs and facilitate the cell cycle activation induced by vascular endothelial growth factor.", "paper_title": "Time-course network analysis reveals TNF-alpha can promote G(1)/S transition of cell cycle in vascular endothelial cells", "paper_id": "WOS:000298383800001"}