{"auto_keywords": [{"score": 0.04957251450614729, "phrase": "automatic_selection"}, {"score": 0.00481495049065317, "phrase": "maximum_visual_information_recovery"}, {"score": 0.004730338746443662, "phrase": "good_viewing_parameters"}, {"score": 0.004469400468609653, "phrase": "concrete_application"}, {"score": 0.004375286710337962, "phrase": "intuitive_definition"}, {"score": 0.0043443560029027195, "phrase": "good_view"}, {"score": 0.004003925104720979, "phrase": "viewing_parameters"}, {"score": 0.0037561467438280175, "phrase": "light_sources"}, {"score": 0.0035740424892197155, "phrase": "first_parameters"}, {"score": 0.0025504217985882725, "phrase": "fixed_camera_position"}, {"score": 0.0024789326485851666, "phrase": "information-based_concept"}, {"score": 0.0024526426124799085, "phrase": "shannon_entropy"}, {"score": 0.0023502347146791285, "phrase": "light_positions"}], "paper_keywords": ["color", " shading", " shadowing", " and texture"], "paper_abstract": "The automatic selection of good viewing parameters is a very complex problem. In most cases, the notion of good strongly depends on the concrete application. Moreover, when an intuitive definition of good view is available, it is often difficult to establish a measure that brings it to the practice. Commonly, two kinds of viewing parameters must be set: camera parameters (position and orientation) and lighting parameters (number of light sources, its position and eventually the orientation of the spot). The first parameters will determine how much of the geometry can be captured and the latter will influence on how much of it is revealed (i.e., illuminated) to the user. Unfortunately, ensuring that certain parts of a scene are lit does not make sure that the details will be communicated to the user, as the amount of illumination might be too small or too high. In this paper we define a metric to calculate the amount of information relative to an object that is effectively communicated to the user given a fixed camera position. This measure is based on an information-based concept, the Shannon entropy, and will be applied to the problem of automatic selection of light positions in order to adequately illuminate an object. In order to validate the results, we have carried out an experiment on users, this experiment helped us to explore other related measures.", "paper_title": "Automatic light source placement for maximum visual information recovery", "paper_id": "WOS:000246680900003"}