{"auto_keywords": [{"score": 0.04803089662471404, "phrase": "identity_management_systems"}, {"score": 0.039383785397268056, "phrase": "reputation_management"}, {"score": 0.00481495049065317, "phrase": "trims"}, {"score": 0.0045726187330434025, "phrase": "electronic_transactions"}, {"score": 0.004342430078306461, "phrase": "hotel_rooms"}, {"score": 0.0036893794227117194, "phrase": "novel_way"}, {"score": 0.003248483521309273, "phrase": "reputation_model"}, {"score": 0.003197200793408836, "phrase": "acceptable_level"}, {"score": 0.003109390330476147, "phrase": "different_domain"}, {"score": 0.0027485326424697095, "phrase": "possibly_unknown_domain"}, {"score": 0.0025180781216911246, "phrase": "targeting_domain"}, {"score": 0.002391067964886602, "phrase": "first_approaches"}, {"score": 0.002316105585203396, "phrase": "multidomain_scenario"}, {"score": 0.002270449532546444, "phrase": "performed_experiments"}, {"score": 0.0021731423856364003, "phrase": "wide_variety"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Identity management systems", " Trust and reputation management", " Dynamic federation", " Privacy homomorphisms", " Web services"], "paper_abstract": "Electronic transactions are becoming more important everyday. Several tasks like buying goods, booking flights or hotel rooms, or paying for streaming a movie, for instance, can be carried out through the Internet. Nevertheless, they are still some drawbacks due to security threats while performing such operations. Trust and reputation management rises as a novel way of solving some of those problems. In this paper we present our work TRIMS (a privacy-aware trust and reputation model for identity management systems), which applies a trust and reputation model to guarantee an acceptable level of security when deciding if a different domain might be considered reliable when receiving certain sensitive user's attributes. Specifically, we will address the problems which surfaces when a domain needs to decide whether to exchange some information with another possibly unknown domain to effectively provide a service to one of its users. This decision will be determined by the trust deposited in the targeting domain. As far as we know, our proposal is one of the first approaches dealing with trust and reputation management in a multidomain scenario. Finally, the performed experiments have demonstrated the robustness and accuracy of our model in a wide variety of scenarios. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "TRIMS, a privacy-aware trust and reputation model for identity management systems", "paper_id": "WOS:000284297900008"}