{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weight_changes"}, {"score": 0.04920822493417558, "phrase": "artificial_neuromolecular_system"}, {"score": 0.0047797212183363835, "phrase": "premature_babies"}, {"score": 0.004506968388996092, "phrase": "nutritional_deficiency_problems"}, {"score": 0.004328494656899359, "phrase": "total_parental_nutrition"}, {"score": 0.0038483286199081, "phrase": "self-organizing_learning_system"}, {"score": 0.00373682045166829, "phrase": "tpn_elements"}, {"score": 0.003562444653947001, "phrase": "intra-_and_inter-neuronal_information_processing"}, {"score": 0.0034212450542713607, "phrase": "biological_systems"}, {"score": 0.0032021226849872054, "phrase": "autonomous_manner"}, {"score": 0.003086492169113408, "phrase": "prematurely_born_babies"}, {"score": 0.002942373803701752, "phrase": "babies'_weights"}, {"score": 0.002920805294420291, "phrase": "experimental_results"}, {"score": 0.002878140062594849, "phrase": "anm_system"}, {"score": 0.0028570410572695106, "phrase": "better_results"}, {"score": 0.0028049825574676763, "phrase": "sas"}, {"score": 0.0026155681847364483, "phrase": "human_judgment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["evolutionary learning", " total parenteral nutrition", " statistical analysis", " artificial neural network"], "paper_abstract": "Prematurely born babies, whose weights are usually less than 2500 g, generally have nutritional deficiency problems, as most of their body functions have not developed completely. Total parental nutrition (TPN) has been one of the treatments commonly used by clinicians for improving their nutritional needs. This paper describes the application of an artificial neuromolecular system (ANM system), a self-organizing learning system, to investigate the factors (including TPN elements) that affect the weight changes of these babies. The system integrates intra- and inter-neuronal information processing that captures the gradual transformability feature of structure/function relationship embedded in biological systems. With this feature, the system is able to learn how to differentiate data in an autonomous manner. The system was applied to a database of prematurely born babies, comprising 274 records. Each record consisted of 30 parameters that might affect babies' weights. Experimental results showed that the ANM system had better results than either the back-propagation neural networks or the SAS (a statistical tool). Contrary to our expectation, the result was even better than that of human judgment, suggesting that it could be used as tool to assist clinicians. Our parameter analysis showed that most of the parameters that the system identified as significant were identical to those employed by clinicians; however, some were not. The finding of the latter might provide another dimension of information to clinicians. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Data differentiation and parameter analysis on the weight changes of premature babies with an artificial neuromolecular system", "paper_id": "WOS:000253521900069"}