{"auto_keywords": [{"score": 0.04173613029238054, "phrase": "frnn"}, {"score": 0.038873053151351256, "phrase": "vqnn"}, {"score": 0.023051113253628765, "phrase": "fuzzy-rough_sets"}, {"score": 0.008257099296100197, "phrase": "experimental_evaluation"}, {"score": 0.004631758267671427, "phrase": "effective_way"}, {"score": 0.004542780650208743, "phrase": "rough_set_theory"}, {"score": 0.004421063493736839, "phrase": "real-valued_data"}, {"score": 0.004012271808564447, "phrase": "fuzzy-rough_nearest-neighbour"}, {"score": 0.003889583851551197, "phrase": "vaguely-quantified_rough_sets"}, {"score": 0.003408512155673968, "phrase": "underlying_mechanisms"}, {"score": 0.00326594229173048, "phrase": "theoretical_proof"}, {"score": 0.0032406665327678616, "phrase": "empirical_evaluation"}, {"score": 0.0031906984691667246, "phrase": "resulting_classification"}, {"score": 0.0030810605918297584, "phrase": "highest_similarity"}, {"score": 0.0030572112793962004, "phrase": "greatest_summation"}, {"score": 0.002839625463110821, "phrase": "novel_methods"}, {"score": 0.0027207878227927516, "phrase": "snn"}, {"score": 0.002293014162421338, "phrase": "new_methods"}, {"score": 0.0022664208122072657, "phrase": "classification_performance"}, {"score": 0.00224013518726087, "phrase": "existing_advanced_fuzzy-rough_nearest-neighbour-based_classifiers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Fuzzy-rough sets", " Similarity function", " Nearest neighbour", " Classification"], "paper_abstract": "Fuzzy-rough sets have enjoyed much attention in recent years as an effective way in which to extend rough set theory such that it can deal with real-valued data. More recently, fuzzy-rough sets have been employed for the task of classification. This has led to the development of approaches such as fuzzy-rough nearest-neighbour (FRNN) and its extension based on vaguely-quantified rough sets (VQNN). These methods perform well and experimental evaluation demonstrates that VQNN in particular is very effective for dealing with data in the presence of noise. In this paper, the underlying mechanisms of FRNN and VQNN are investigated and analysed. The theoretical proof and empirical evaluation show that the resulting classification of FRNN and VQNN depends only upon the highest similarity and greatest summation of the similarities of each class, respectively. This fact is exploited in order to formulate the novel methods proposed in this paper: similarity nearest-neighbour (SNN) and aggregated-similarity nearest-neighbour (ASNN). These two novel approaches are equivalent to FRNN and VQNN, but do not employ the concepts or framework of fuzzy-rough sets. Instead only fuzzy similarity is used. Experimental evaluation confirms the observation that these new methods maintain the classification performance of the existing advanced fuzzy-rough nearest-neighbour-based classifiers. In addition, the underlying mathematical foundation is simplified. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Fuzzy similarity-based nearest-neighbour classification as alternatives to their fuzzy-rough parallels", "paper_id": "WOS:000312520800010"}