{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "difficult_lighting_conditions"}, {"score": 0.0047007816199415905, "phrase": "uncontrolled_lighting_conditions"}, {"score": 0.004589307360976108, "phrase": "practical_face_recognition_systems"}, {"score": 0.004434608130268514, "phrase": "robust_illumination_normalization"}, {"score": 0.004404296965915598, "phrase": "local_texture-based_face_representations"}, {"score": 0.004299823165101385, "phrase": "kernel-based_feature_extraction"}, {"score": 0.0040562607160379936, "phrase": "simple_and_efficient_preprocessing_chain"}, {"score": 0.003866033961859878, "phrase": "essential_appearance_details"}, {"score": 0.0037228262889889402, "phrase": "local_ternary_patterns"}, {"score": 0.0036095967013657906, "phrase": "local_binary_pattern"}, {"score": 0.003404998261799824, "phrase": "uniform_regions"}, {"score": 0.0032900885091898184, "phrase": "local_spatial_histograms"}, {"score": 0.0032563753253986912, "phrase": "distance_transform"}, {"score": 0.003135679861067472, "phrase": "face_recognition"}, {"score": 0.002723815159181826, "phrase": "resulting_method"}, {"score": 0.002551700779294785, "phrase": "difficult_illumination_conditions"}, {"score": 0.002262547875929931, "phrase": "previously_published_methods"}, {"score": 0.002231657123365799, "phrase": "face_verification_rate"}, {"score": 0.0021049977753042253, "phrase": "feature_sets"}], "paper_keywords": ["Face recognition", " illumination invariance", " image preprocessing", " kernel principal components analysis", " local binary patterns", " visual features"], "paper_abstract": "Making recognition more reliable under uncontrolled lighting conditions is one of the most important challenges for practical face recognition systems. We tackle this by combining the strengths of robust illumination normalization, local texture-based face representations, distance transform based matching, kernel-based feature extraction and multiple feature fusion. Specifically, we make three main contributions: 1) we present a simple and efficient preprocessing chain that eliminates most of the effects of changing illumination while still preserving the essential appearance details that are needed for recognition; 2) we introduce local ternary patterns (LTP), a generalization of the local binary pattern (LBP) local texture descriptor that is more discriminant and less sensitive to noise in uniform regions, and we show that replacing comparisons based on local spatial histograms with a distance transform based similarity metric further improves the performance of LBP/LTP based face recognition; and 3) we further improve robustness by adding Kernel principal component analysis (PCA) feature extraction and incorporating rich local appearance cues from two complementary sources-Gabor wavelets and LBP-showing that the combination is considerably more accurate than either feature set alone. The resulting method provides state-of-the-art performance on three data sets that are widely used for testing recognition under difficult illumination conditions: Extended Yale-B, CAS-PEAL-R1, and Face Recognition Grand Challenge version 2 experiment 4 (FRGC-204). For example, on the challenging FRGC-204 data set it halves the error rate relative to previously published methods, achieving a face verification rate of 88.1% at 0.1% false accept rate. Further experiments show that our preprocessing method outperforms several existing preprocessors for a range of feature sets, data sets and lighting conditions.", "paper_title": "Enhanced Local Texture Feature Sets for Face Recognition Under Difficult Lighting Conditions", "paper_id": "WOS:000277773200021"}