{"auto_keywords": [{"score": 0.04034190794741309, "phrase": "gpu"}, {"score": 0.02792190181597184, "phrase": "heterogeneous_computing_systems"}, {"score": 0.00481495049065317, "phrase": "estimated_execution_time"}, {"score": 0.004719473826242326, "phrase": "computing_systems"}, {"score": 0.004143196873246147, "phrase": "central_processing_unit"}, {"score": 0.004020492138367616, "phrase": "wide_usage"}, {"score": 0.0036370297611938796, "phrase": "scheduling_scheme"}, {"score": 0.003113441660343867, "phrase": "dynamic_scheduling_scheme"}, {"score": 0.002816246391862638, "phrase": "estimated-execution-time_information"}, {"score": 0.0025730425700096365, "phrase": "completion_time"}, {"score": 0.002509284173541882, "phrase": "better_system_performance"}, {"score": 0.00242266141176955, "phrase": "training_period"}, {"score": 0.0023745087648471613, "phrase": "execution_history"}, {"score": 0.0022925278792429553, "phrase": "proposed_estimated-execution-time_scheduling"}, {"score": 0.0021476967767071233, "phrase": "existing_scheduling_schemes"}, {"score": 0.0021049977753042253, "phrase": "reduced_execution_time"}], "paper_keywords": ["Computer system", " Scheduling", " CPU", " GPU", " CUDA", " Heterogeneous system"], "paper_abstract": "Computing systems should be designed to exploit parallelism in order to improve performance. In general, a GPU (Graphics Processing Unit) can provide more parallelism than a CPU (Central Processing Unit), resulting in the wide usage of heterogeneous computing systems that utilize both the CPU and the GPU together. In the heterogeneous computing systems, the efficiency of the scheduling scheme, which selects the device to execute the application between the CPU and the GPU, is one of the most critical factors in determining the performance. This paper proposes a dynamic scheduling scheme for the selection of the device between the CPU and the GPU to execute the application based on the estimated-execution-time information. The proposed scheduling scheme enables the selection between the CPU and the GPU to minimize the completion time, resulting in a better system performance, even though it requires the training period to collect the execution history. According to our simulations, the proposed estimated-execution-time scheduling can improve the utilization of the CPU and the GPU compared to existing scheduling schemes, resulting in reduced execution time and enhanced energy efficiency of heterogeneous computing systems.", "paper_title": "An efficient scheduling scheme using estimated execution time for heterogeneous computing systems", "paper_id": "WOS:000321290800025"}