{"auto_keywords": [{"score": 0.036878849518784715, "phrase": "collaboration_engineering"}, {"score": 0.010660013081256659, "phrase": "collaboration_processes"}, {"score": 0.00481495049065317, "phrase": "special_issue"}, {"score": 0.00458488025289647, "phrase": "information_systems"}, {"score": 0.004446677711302801, "phrase": "critical_phenomenon"}, {"score": 0.004392565073466714, "phrase": "organizational_life"}, {"score": 0.0036777702949712457, "phrase": "collaborative_work"}, {"score": 0.0033961782274326948, "phrase": "focal_point"}, {"score": 0.002949598537993663, "phrase": "collaboration_professionals"}, {"score": 0.0027741761880779535, "phrase": "collaboration_technology"}, {"score": 0.002641360377825228, "phrase": "collaborative_work_practices"}, {"score": 0.0025459275963373496, "phrase": "different_technological_platforms"}, {"score": 0.0021049977753042253, "phrase": "collaboration_engineering_research_agenda"}], "paper_keywords": [""], "paper_abstract": "Collaboration is a critical phenomenon in organizational life. Collaboration is necessary yet many organizations struggle to make it work. The field of IS has devoted much effort to understanding how technologies can improve the productivity of collaborative work. Over the past decade, the field of Collaboration Engineering has emerged as a focal point for research on designing and deploying collaboration processes that are recurring in nature and that are executed by practitioners in organizations rather than collaboration professionals. In Collaboration Engineering, researchers do not study a collaboration technology in isolation. Rather, they study collaborative work practices that can be supported on different technological platforms. In this editorial, we discuss the field of Collaboration Engineering in terms of its foundations, its approach to designing and deploying collaboration processes, and its modeling techniques. We conclude with a Collaboration Engineering research agenda for the coming", "paper_title": "Collaboration Engineering: Foundations and Opportunities: Editorial to the Special Issue on the Journal of the Association of Information Systems", "paper_id": "WOS:000267037600002"}