{"auto_keywords": [{"score": 0.035523075015928884, "phrase": "knowledge_diffusion"}, {"score": 0.0047517225918491226, "phrase": "knowledge_diffusion_performance"}, {"score": 0.004566954456805558, "phrase": "knowledge-based_economy"}, {"score": 0.004360412703519539, "phrase": "knowledge_diffusion_mechanism"}, {"score": 0.0037699306119313154, "phrase": "previous_empirical_analyses"}, {"score": 0.0027256122357680393, "phrase": "social_network_analysis"}, {"score": 0.0025849489224175548, "phrase": "network_structure"}, {"score": 0.0024353398669404334, "phrase": "average_knowledge_stock"}, {"score": 0.00240328454980006, "phrase": "knowledge_variance"}, {"score": 0.002294369814584028, "phrase": "small-world_network"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["R&D collaboration network", " Knowledge diffusion", " Small-world", " Scale-free"], "paper_abstract": "With the advent of knowledge-based economy, the process and structure of knowledge diffusion mechanism in R&D collaboration networks have become more complex and dynamic. However, regardless of the complexity and importance of these R&D collaboration networks, previous empirical analyses have focused mainly on stalks, which cannot he a sufficient basis to thoroughly explore knowledge diffusion in the R&D collaboration network. Furthermore, there has been little research done on the relationship between knowledge diffusion and the structure of an R&D collaboration network. Hence, this paper modeled knowledge diffusion based on social network analysis. It also investigated the impact of network structure on the performance of knowledge diffusion, focusing on average knowledge stock and knowledge variance. The results confirm that the small-world network is the most efficient and equitable structure toward effective knowledge diffusion. (C) 2003 Elsevier Ltd. All rights reserved.", "paper_title": "Structural effects of R&D collaboration network on knowledge diffusion performance", "paper_id": "WOS:000264782800030"}