{"auto_keywords": [{"score": 0.04763743657605741, "phrase": "transactive_memory_theory"}, {"score": 0.03279538488952693, "phrase": "information_provision"}, {"score": 0.015397832559667004, "phrase": "digital_knowledge_repositories"}, {"score": 0.00481495049065317, "phrase": "group_members"}, {"score": 0.0042692243768616455, "phrase": "collocated_work"}, {"score": 0.004224786847720058, "phrase": "important_questions"}, {"score": 0.0037066895459425824, "phrase": "knowledge_workers"}, {"score": 0.0035920758080335655, "phrase": "work_groups"}, {"score": 0.0034810979351279116, "phrase": "europe"}, {"score": 0.0032689949867583633, "phrase": "experts'_retrieval"}, {"score": 0.0029905104479072482, "phrase": "experts'_perceptions"}, {"score": 0.002808298910480358, "phrase": "cross-level_interactions"}, {"score": 0.002387214876538434, "phrase": "communication_networks"}, {"score": 0.0022653055209664284, "phrase": "transactive_memory_systems"}, {"score": 0.0021049977753042253, "phrase": "multilevel_approaches"}], "paper_keywords": ["information storage and retrieval systems", " management information systems", " knowledge management"], "paper_abstract": "The proliferation of digital knowledge repositories (DKRs) used for distributed and collocated work raises important questions about how to manage these technologies. This study investigates why individuals contribute information to DKRs by applying and extending transactive memory theory. Data from knowledge workers (N=208) nested in work groups (J=17) located in Europe and the United States revealed, consistent with transactive memory theory, that perceptions of experts' retrieval of information were positively related to the likelihood of information provision to DKRs. The relationship between experts' perceptions of retrieval and information provision varied from group to group, and cross-level interactions indicated that trust in how the information would be used and the interdependence of tasks within groups could explain that variation. Furthermore, information provision to DKRs was related to communication networks in ways consistent with theorizing regarding the formation of transactive memory systems. Implications for theory and practice are discussed, emphasizing the utility of multilevel approaches for conceptualizing and modeling why individuals provide information to DKRs.", "paper_title": "Why do group members provide information to digital knowledge repositories? a multilevel application of transactive memory theory", "paper_id": "WOS:000323388800009"}