{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "false_positive_error"}, {"score": 0.007655939358067588, "phrase": "radiology_trainees"}, {"score": 0.005961851684537006, "phrase": "previous_annotations"}, {"score": 0.005238601791730179, "phrase": "random_forest_classifier"}, {"score": 0.004736045157669388, "phrase": "improved_mammography_education"}, {"score": 0.004620093797504386, "phrase": "earlier_detection"}, {"score": 0.004594713028452399, "phrase": "breast_cancer"}, {"score": 0.004494570360108983, "phrase": "large_number"}, {"score": 0.00446987606516801, "phrase": "false_positive_exams"}, {"score": 0.004445316841017889, "phrase": "improved_radiology_education"}, {"score": 0.004103942174451674, "phrase": "troublesome_locations"}, {"score": 0.003555902292752528, "phrase": "suspicious_false_positive_locations"}, {"score": 0.003478321590910367, "phrase": "gaussian_filter"}, {"score": 0.003459191419478298, "phrase": "suspicious_regions"}, {"score": 0.0034212450542713607, "phrase": "computer_vision-based_segmentation_algorithms"}, {"score": 0.003328184259386487, "phrase": "suspicious_region"}, {"score": 0.0031236080850960096, "phrase": "extracted_features"}, {"score": 0.002947790697936243, "phrase": "reader_study"}, {"score": 0.002639740960006001, "phrase": "false_positive_locations"}, {"score": 0.002470547930651519, "phrase": "randomly_identified_locations"}, {"score": 0.0023900527169254744, "phrase": "first_study"}, {"score": 0.0023249757987087033, "phrase": "computer_models"}, {"score": 0.002122507495446441, "phrase": "randomly_selected_ones"}], "paper_keywords": ["Breast cancer", " Radiology education", " Computer vision", " Machine learning"], "paper_abstract": "Introduction: While mammography notably contributes to earlier detection of breast cancer, it has its limitations, including a large number of false positive exams. Improved radiology education could potentially contribute to alleviating this issue. Toward this goal, in this paper we propose an algorithm for modeling of false positive error making among radiology trainees. Identifying troublesome locations for the trainees could focus their training and in turn improve their performance. Methods: The algorithm proposed in this paper predicts locations that are likely to result in a false positive error for each trainee based on the previous annotations made by the trainee. The algorithm consists of three steps. First, the suspicious false positive locations are identified in mammograms by Difference of Gaussian filter and suspicious regions are segmented by computer vision-based segmentation algorithms. Second, 133 features are extracted for each suspicious region to describe its distinctive characteristics. Third, a random forest classifier is applied to predict the likelihood of the trainee making a false positive error using the extracted features. The random forest classifier is trained using previous annotations made by the trainee. We evaluated the algorithm using data from a reader study in which 3 experts and 10 trainees interpreted 100 mammographic cases. Results: The algorithm was able to identify locations where the trainee will commit a false positive error with accuracy higher than an algorithm that selects such locations randomly. Specifically, our algorithm found false positive locations with 40% accuracy when only 1 location was selected for all cases for each trainee and 12% accuracy when 10 locations were selected. The accuracies for randomly identified locations were both 0% for these two scenarios. Conclusions: In this first study on the topic, we were able to build computer models that were able to find locations for which a trainee will make a false positive error in images that were not previously seen by the trainee. Presenting the trainees with such locations rather than randomly selected ones may improve their educational outcomes. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Modeling false positive error making patterns in radiology trainees for improved mammography education", "paper_id": "WOS:000353932500004"}