{"auto_keywords": [{"score": 0.0308162514646343, "phrase": "monitoring_cost"}, {"score": 0.004205940624913343, "phrase": "workload_models"}, {"score": 0.004143196873246147, "phrase": "capacity_planning"}, {"score": 0.003729335910488339, "phrase": "classification_scheme"}, {"score": 0.0035648266669315943, "phrase": "transport_layer_statistical_features"}, {"score": 0.003485304124598714, "phrase": "proposed_scheme"}, {"score": 0.003356675879109443, "phrase": "virtualized_environment"}, {"score": 0.003136952589428254, "phrase": "high_accuracy"}, {"score": 0.0028661330049356186, "phrase": "system_response_time"}, {"score": 0.0028021527740710508, "phrase": "prediction_accuracy"}, {"score": 0.0025795066118838067, "phrase": "feature_selection"}, {"score": 0.0023214774334744713, "phrase": "experimental_results"}, {"score": 0.002252602622785975, "phrase": "equally_accurate_system"}], "paper_keywords": ["P2P", " network monitoring", " traffic classification", " QoS"], "paper_abstract": "Characterization of peer-to-peer (P2P) traffic is an essential step to develop workload models towards capacity planning and cyber-threat countermeasure over P2P networks. In this paper, we present a classification scheme for characterizing P2P file-sharing hosts based on transport layer statistical features. The proposed scheme is accessed on a virtualized environment that simulates a P2P-friendly cloud system. The system shows high accuracy in differentiating P2P file-sharing hosts from ordinary hosts. Its tunability regarding monitoring cost, system response time, and prediction accuracy is demonstrated by a series of experiments. Further study on feature selection is pursued to identify the most essential discriminators that contribute most to the classification. Experimental results show that an equally accurate system could be obtained using only 3 out of the 18 defined discriminators, which further reduces the monitoring cost and enhances the adaptability of the system.", "paper_title": "Towards Cost-Effective P2P Traffic Classification in Cloud Environment", "paper_id": "WOS:000313146300016"}