{"auto_keywords": [{"score": 0.04193275383545603, "phrase": "protein_protein_interactions"}, {"score": 0.015239876112428535, "phrase": "traditional_drug_targets"}, {"score": 0.014858029475795348, "phrase": "small_molecules"}, {"score": 0.00481495049065317, "phrase": "structural_properties_of_non"}, {"score": 0.004693063440166313, "phrase": "virtual_screening"}, {"score": 0.0043208252177835815, "phrase": "protein_targets"}, {"score": 0.004187452827599427, "phrase": "nucleic_acids"}, {"score": 0.004128192012388041, "phrase": "small-molecule_ligands"}, {"score": 0.004046627438964482, "phrase": "existing_examples"}, {"score": 0.0038551626276406175, "phrase": "similar_potency"}, {"score": 0.003725470458263889, "phrase": "smaller_fraction"}, {"score": 0.0036001255166809793, "phrase": "average_atom"}, {"score": 0.003419943984098415, "phrase": "ligand_efficiency"}, {"score": 0.003267342521938321, "phrase": "docking_experiments"}, {"score": 0.0032027318619522916, "phrase": "relatively_exposed_binding_modes"}, {"score": 0.0031754329320561317, "phrase": "structure-based_virtual_screening"}, {"score": 0.00308610073274614, "phrase": "sufficient_dues"}, {"score": 0.003051073364818384, "phrase": "active_compounds"}, {"score": 0.0030337085953063125, "phrase": "decoy_compounds"}, {"score": 0.0028328599839713866, "phrase": "target_protein_surface"}, {"score": 0.0027452904886195993, "phrase": "sufficiently_buried_manner"}, {"score": 0.0027218799769229596, "phrase": "good_ligand_efficiency"}, {"score": 0.002622713543589907, "phrase": "available_crystal_structures"}, {"score": 0.0026077803487003, "phrase": "distinct_protein_interaction_sites"}, {"score": 0.002585539416877115, "phrase": "small-molecule_inhibitors"}, {"score": 0.002414290278501595, "phrase": "current_state"}, {"score": 0.002373276186210053, "phrase": "additional_data"}, {"score": 0.0022672718785099666, "phrase": "limited_perspective"}, {"score": 0.0021971473452127126, "phrase": "new_methods"}, {"score": 0.0021721876496534837, "phrase": "conformational_fluctuations"}, {"score": 0.002123113864239041, "phrase": "\"low-hanging_fruit"}, {"score": 0.0021049977753042253, "phrase": "non-traditional_targets"}], "paper_keywords": [""], "paper_abstract": "Traditional drug targets have historically included signaling proteins that respond to small molecules and enzymes that use small molecules as substrates. Increasing attention is now being directed toward other types of protein targets, in particular those that exert their function by interacting with nucleic acids or other proteins rather than small-molecule ligands. Here, we systematically compare existing examples of inhibitors of protein protein interactions to inhibitors of traditional drug targets. While both sets of inhibitors bind with similar potency, we find that the inhibitors of protein protein interactions typically bury a smaller fraction of their surface area upon binding to their protein targets. The fact that an average atom is less buried suggests that more atoms are needed to achieve a given potency, explaining the observation that ligand efficiency is typically poor for inhibitors of protein protein interactions. We then carried out a series of docking experiments and found a further consequence of these relatively exposed binding modes is that structure-based virtual screening may be more difficult: such binding modes do not provide sufficient dues to pick out active compounds from decoy compounds. Collectively, these results suggest that the challenges associated with such non-traditional drug targets may not lie with identifying compounds that potently bind to the target protein surface, but rather with identifying compounds that bind in a sufficiently buried manner to achieve good ligand efficiency and, thus, good oral bioavailability. While the number of available crystal structures of distinct protein interaction sites bound to small-molecule inhibitors is relatively small at present (only 21 such complexes were included in this study), these are sufficient to draw conclusions based on the current state of the field; as additional data accumulate it will be exciting to refine the viewpoint presented here. Even with this limited perspective however, we anticipate that these insights, together with new methods for exploring protein conformational fluctuations, may prove useful for identifying the \"low-hanging fruit\" among non-traditional targets for therapeutic intervention.", "paper_title": "Structural Properties of Non-Traditional Drug Targets Present New Challenges for Virtual Screening", "paper_id": "WOS:000323797700022"}