{"auto_keywords": [{"score": 0.0393316580474089, "phrase": "longest_edge"}, {"score": 0.015719716506582538, "phrase": "diamond_hierarchies"}, {"score": 0.004778923541463994, "phrase": "volumetric_datasets"}, {"score": 0.004672444473700524, "phrase": "multiresolution_approach"}, {"score": 0.004602773636967002, "phrase": "nested_decomposition"}, {"score": 0.00450020161335541, "phrase": "polyhedral_mesh"}, {"score": 0.004366970206156021, "phrase": "longest_edge_bisection_rule"}, {"score": 0.004269630481719451, "phrase": "regular_volumetric_datasets"}, {"score": 0.004205940624913343, "phrase": "highly_adaptive_crack-free_representations"}, {"score": 0.0039456466422100045, "phrase": "common_longest_edge"}, {"score": 0.0032571885279065126, "phrase": "unique_types"}, {"score": 0.0031606404966938568, "phrase": "coherent_set"}, {"score": 0.0027499252661633525, "phrase": "unique_edge"}, {"score": 0.0026583500966092044, "phrase": "compact_and_highly_efficient_means"}, {"score": 0.0024748913336907923, "phrase": "longest_edge_bisection"}, {"score": 0.0024014759148123736, "phrase": "supercube_representation"}, {"score": 0.0023745087648471613, "phrase": "multiresolution_diamond_hierarchies"}, {"score": 0.002286781334850213, "phrase": "regular_grid"}, {"score": 0.0021209097150420896, "phrase": "storage_requirements"}], "paper_keywords": ["Longest edge bisection", " diamonds", " hierarchy of diamonds", " multiresolution models", " selective refinement"], "paper_abstract": "Volumetric datasets are often modeled using a multiresolution approach based on a nested decomposition of the domain into a polyhedral mesh. Nested tetrahedral meshes generated through the longest edge bisection rule are commonly used to decompose regular volumetric datasets since they produce highly adaptive crack-free representations. Efficient representations for such models have been achieved by clustering the set of tetrahedra sharing a common longest edge into a structure called a diamond. The alignment and orientation of the longest edge can be used to implicitly determine the geometry of a diamond and its relations to the other diamonds within the hierarchy. We introduce the supercube as a high-level primitive within such meshes that encompasses all unique types of diamonds. A supercube is a coherent set of edges corresponding to three consecutive levels of subdivision. Diamonds are uniquely characterized by the longest edge of the tetrahedra forming them and are clustered in supercubes through the association of the longest edge of a diamond with a unique edge in a supercube. Supercubes are thus a compact and highly efficient means of associating information with a subset of the vertices, edges and tetrahedra of the meshes generated through longest edge bisection. We demonstrate the effectiveness of the supercube representation when encoding multiresolution diamond hierarchies built on a subset of the points of a regular grid. We also show how supercubes can be used to efficiently extract meshes from diamond hierarchies and to reduce the storage requirements of such variable-resolution meshes.", "paper_title": "Supercubes: A High-Level Primitive for Diamond Hierarchies", "paper_id": "WOS:000270778900095"}