{"auto_keywords": [{"score": 0.03644451033122438, "phrase": "\"seed\"_gene"}, {"score": 0.03231550833923174, "phrase": "candidate_genes"}, {"score": 0.00481495049065317, "phrase": "flexible_nonparametric"}, {"score": 0.004406994912939125, "phrase": "biological_function"}, {"score": 0.004329630571352367, "phrase": "particular_gene"}, {"score": 0.0030195184114140063, "phrase": "microarray_experiments"}, {"score": 0.002984027623988469, "phrase": "enriched_pathways"}, {"score": 0.002897109710213723, "phrase": "nonparametric_procedure"}, {"score": 0.0027796495180095657, "phrase": "expression_levels"}, {"score": 0.0025286975935774245, "phrase": "proposed_test_statistic"}, {"score": 0.002469587897077989, "phrase": "auc"}, {"score": 0.002426137929553722, "phrase": "gene_pairs"}, {"score": 0.0023834640793589435, "phrase": "implicit_correlation"}, {"score": 0.0021049977753042253, "phrase": "real_data_analysis"}], "paper_keywords": ["Microarray experiments", " receiver operating characteristic curve", " pathways", " false discovery rate"], "paper_abstract": "Very often biologists are interested to know the biological function of a particular gene. Its true biological function may depend on other genes. Finding other genes in the same biological pathway of that gene may enhance further understanding of its biological function. Therefore, we are interested in finding other candidate genes whose expression values are highly correlated with that of a \"seed\" gene. The \"seed\" gene, which is known and associated with a disease, is used as a reference to extract candidate genes from microarray experiments and enriched pathways. We propose a nonparametric procedure for selecting the candidate genes. The expression levels for these candidate genes are correlated with that of a \"seed\" gene in microarray experiments. The proposed test statistic compares two Area Under Receiver Operating Characteristic Curves (AUC) for gene pairs, taking implicit correlation between two AUCs into account. The performance of our method is compared to the other well-known methods through the use of simulation and real data analysis.", "paper_title": "A FLEXIBLE NONPARAMETRIC APPROACH TO FIND CANDIDATE GENES ASSOCIATED WITH DISEASE IN MICROARRAY EXPERIMENTS", "paper_id": "WOS:000321005100008"}