{"auto_keywords": [{"score": 0.04050834929355119, "phrase": "molecular_interactions"}, {"score": 0.009284735434804313, "phrase": "catalytic_site"}, {"score": 0.0089832317501334, "phrase": "interacting_residues"}, {"score": 0.00481495049065317, "phrase": "inhibitory_mechanism"}, {"score": 0.004722715450671519, "phrase": "computational_approaches"}, {"score": 0.004606706983515934, "phrase": "important_target"}, {"score": 0.004581315009194603, "phrase": "cancer_therapy"}, {"score": 0.004431862492928335, "phrase": "key_proteins"}, {"score": 0.004371032439709459, "phrase": "anticancer_therapy"}, {"score": 0.004034260768222184, "phrase": "anti-cancer_compound"}, {"score": 0.003891806560322573, "phrase": "binding_mechanisms"}, {"score": 0.00372333905856154, "phrase": "current_study"}, {"score": 0.003692569934990526, "phrase": "exact_binding_mode"}, {"score": 0.0035720061878618307, "phrase": "molecular_docking"}, {"score": 0.003361069456060196, "phrase": "accessible_surface_area"}, {"score": 0.003188916332246111, "phrase": "key_residues"}, {"score": 0.0030255540794918863, "phrase": "maximum_accessible_surface_area"}, {"score": 0.0027159094186967247, "phrase": "respective_catalytic_sites"}, {"score": 0.002527247425576091, "phrase": "similar_location"}, {"score": 0.0024924939430158426, "phrase": "docked_drug"}, {"score": 0.0024582171957247385, "phrase": "striking_similarity"}, {"score": 0.0023976997077055193, "phrase": "concomitant_inhibition"}, {"score": 0.002281087456676369, "phrase": "simulation_analyses"}, {"score": 0.0022684849853157802, "phrase": "dual_inhibitor"}, {"score": 0.0022126280490696363, "phrase": "suitable_multi-target_model"}, {"score": 0.0021943157210982957, "phrase": "drug_protein_interactions"}, {"score": 0.002152172914717576, "phrase": "novel_drugs"}, {"score": 0.002140281138020661, "phrase": "higher_potency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["PKI-179", " PI3K", " mTOR", " Molecular docking", " Molecular interactions", " Binding mode"], "paper_abstract": "The PI3K/AKT/mTOR signaling pathway has been identified as an important target for cancer therapy. Attempts are increasingly made to design the inhibitors against the key proteins of this pathway for anticancer therapy. The PI3K/mTOR dual inhibitors have proved more effective than the inhibitors against only single protein targets. Recently discovered PKI-179, an orally effective compound, is one such dual inhibitor targeting both PI3K and mTOR. This anti-cancer compound is efficacious both in vitro and in vivo. However, the binding mechanisms and the molecular interactions of PKI-179 with PI3K and mTOR are not yet available. The current study investigated the exact binding mode and the molecular interactions of PKI-179 with PI3K gamma and mTOR using molecular docking and (un)binding simulation analyses. The study identified PKI-179 interacting residues of both the proteins and their importance in binding was ranked by the loss in accessible surface area, number of molecular interactions of the residue, and consistent appearance of the residue in (un)binding simulation analysis. The key residues involved in binding of PKI-179 were Ala-805 in PI3K gamma and Ile-2163 in mTOR as they have lost maximum accessible surface area due to binding. In addition, the residues which played a role in binding of the drug but were away from the catalytic site were also identified using (un)binding simulation analyses. Finally, comparison of the interacting residues in the respective catalytic sites was done for the difference in the binding of the drug to the two proteins. Thus, the pairs of the residues falling at the similar location with respect to the docked drug were identified. The striking similarity in the interacting residues of the catalytic site explains the concomitant inhibition of both proteins by a number of inhibitors. In conclusion, the docking and (un)binding simulation analyses of dual inhibitor PKI-179 with PI3K and mTOR will provide a suitable multi-target model for studying drug protein interactions and thus help in designing the novel drugs with higher potency. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A structural insight into the inhibitory mechanism of an orally active PI3K/mTOR dual inhibitor, PKI-179 using computational approaches", "paper_id": "WOS:000367112000025"}