{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dataflow-based_rules"}, {"score": 0.004718509350356246, "phrase": "user_comprehension"}, {"score": 0.004639612079116459, "phrase": "considerable_part"}, {"score": 0.004562027986828209, "phrase": "smart_environments"}, {"score": 0.004278807087784626, "phrase": "user_customization"}, {"score": 0.003932654396285872, "phrase": "available_rule"}, {"score": 0.003919404114585274, "phrase": "editing_interfaces"}, {"score": 0.0038278890186559276, "phrase": "low_skills"}, {"score": 0.0036883616416213206, "phrase": "interaction_techniques"}, {"score": 0.0036635429301869527, "phrase": "new_ways"}, {"score": 0.003626626504149897, "phrase": "user_customization_rules"}, {"score": 0.0035539019235553897, "phrase": "generic_and_flexible_meta-model"}, {"score": 0.0032883370175509053, "phrase": "empirical_study"}, {"score": 0.0031791333962016507, "phrase": "visual_data_flow_expressions"}, {"score": 0.0031258948882273057, "phrase": "key_elements"}, {"score": 0.003073545175760353, "phrase": "visual_dataflow_language"}, {"score": 0.0027123819773059127, "phrase": "previous_experience"}, {"score": 0.002685024286204448, "phrase": "mathematical_expressions"}, {"score": 0.0026045914281028473, "phrase": "visual_dataflows"}, {"score": 0.002442594378453517, "phrase": "user-customized_reactive_behavior"}, {"score": 0.002275214783528274, "phrase": "meta-model_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ambient intelligence", " Customization", " Dataflow", " Visual language", " Rule", " Event based", " Non-expert programmer", " Smart home"], "paper_abstract": "A considerable part of the behavior in smart environments relies on event-driven and rule specification. Rules are the mechanism most often used to enable user customization of the environment. However, the expressiveness of the rules available to users in editing and other tools is usually either limited or the available rule editing interfaces are not designed for end-users with low skills in programming. This means we have to look for interaction techniques and new ways to define user customization rules. This paper describes a generic and flexible meta-model to support expressive rules enhanced with data flow expressions that will graphically support the definition of rules without writing code. An empirical study was conducted on the ease of understanding of the visual data flow expressions, which are the key elements in our rule proposal. The visual dataflow language was compared to its corresponding textual version in terms of comprehension and ease of learning by teenagers in exercises involving calculations, modifications, writing and detecting equivalences in expressions in both languages. Although the subjects had some previous experience in editing mathematical expressions on spreadsheets, the study found their performance with visual dataflows to be significantly better in calculation and modification exercises. This makes our dataflow approach a promising mechanism for expressing user-customized reactive behavior in Ambient Intelligence (AmI) environments. The performance of the rule matching processor was validated by means of two stress tests to ensure that the meta-model approach adopted would be able to scale up with the number of types and instances in the space. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A meta-model for dataflow-based rules in smart environments: Evaluating user comprehension and performance", "paper_id": "WOS:000323086300011"}