{"auto_keywords": [{"score": 0.048112949023426686, "phrase": "secrecy_capacity"}, {"score": 0.00481495049065317, "phrase": "correlated_ergodic_fading_channels"}, {"score": 0.004535124351828787, "phrase": "ergodic_fading_wiretap_channel"}, {"score": 0.004454377387615279, "phrase": "main_and_eavesdropper_channels"}, {"score": 0.004195418010131832, "phrase": "full_channel_state_information"}, {"score": 0.004145533665716827, "phrase": "csi"}, {"score": 0.0038348235692738783, "phrase": "legitimate_receiver"}, {"score": 0.003821278393771947, "phrase": "eavesdropper_channel_gains"}, {"score": 0.0034220655476652683, "phrase": "asymptotic_behavior"}, {"score": 0.0030721384264289536, "phrase": "snr"}, {"score": 0.0027575842698911173, "phrase": "closed-form_expression"}, {"score": 0.0021049977753042253, "phrase": "excessively_large_signal_power"}], "paper_keywords": ["Channel gain ratio", " ergodic fading wiretap channel", " power correlation coefficient", " secrecy capacity", " upper bound"], "paper_abstract": "We investigate the secrecy capacity of an ergodic fading wiretap channel when the main and eavesdropper channels are correlated. Assuming that the transmitter knows the full channel state information (CSI) (i.e., the channel gains from the transmitter to the legitimate receiver and eavesdropper), we quantify the loss of the secrecy capacity due to the correlation and investigate the asymptotic behavior of the secrecy capacity in the high signal-to-noise ratio (SNR) regime. While the ergodic capacity of fading channels grows logarithmically with SNR in general, we have found that the secrecy capacity converges to an upper-bound (a closed-form expression is derived) that will be shown to be a function of two channel parameters; the correlation coefficient and the ratio of the main to eavesdropper channel gains. From this, we are able to see how the two channel parameters affect the secrecy capacity and conclude that the excessively large signal power does not help to improve the secrecy capacity and the loss due to the correlation could be significant especially when the ratio of the main to eavesdropper channel gains is low.", "paper_title": "Bounds on Secrecy Capacity Over Correlated Ergodic Fading Channels at High SNR", "paper_id": "WOS:000288459100010"}