{"auto_keywords": [{"score": 0.013966281137347391, "phrase": "homography_coefficients"}, {"score": 0.00481495227849547, "phrase": "homographies"}, {"score": 0.0047420688386378435, "phrase": "rank_four_constraint"}, {"score": 0.004229345958909993, "phrase": "rank_constraint"}, {"score": 0.004175899531189585, "phrase": "standard_rank-projection_approach"}, {"score": 0.00404006571186961, "phrase": "modest_gain"}, {"score": 0.0038789122930433305, "phrase": "poor_estimates"}, {"score": 0.003279124049246641, "phrase": "remaining_issue"}, {"score": 0.0031966920628129854, "phrase": "\"gold_standard"}, {"score": 0.003076901201823596, "phrase": "ground_truth_estimate"}, {"score": 0.0029540533167966335, "phrase": "rank-constrained_projection"}, {"score": 0.0029092568512822966, "phrase": "gold_standard"}, {"score": 0.0027788910305171443, "phrase": "bundle_adjustment_stage"}, {"score": 0.0027437235598539904, "phrase": "practical_algorithm"}, {"score": 0.0027228364802094965, "phrase": "generally_better_results"}, {"score": 0.002620755904283437, "phrase": "dlt_result"}, {"score": 0.002600802496267485, "phrase": "starting_point"}, {"score": 0.0025744334586119367, "phrase": "roughly_the_same_cost"}, {"score": 0.0024969156455994382, "phrase": "\"gold_standard\"_estimate"}, {"score": 0.0024527767211457046, "phrase": "bundle_adjustment"}, {"score": 0.002427904835118503, "phrase": "ground_truth"}, {"score": 0.0023249757987087055, "phrase": "naive_approach"}, {"score": 0.0023131563566384738, "phrase": "direct_rank-projection"}], "paper_keywords": ["Homography", " Rank constraint", " First order perturbation"], "paper_abstract": "It is well known that one can collect the coefficients of five (or more) homographies between two views into a large, rank deficient matrix. In principle, this implies that one can refine the accuracy of the estimates of the homography coefficients by exploiting the rank constraint. However, the standard rank-projection approach is impractical for two different reasons: it requires many homographies to even score a modest gain; and, secondly, correlations between the errors in the coefficients will lead to poor estimates. In this paper we study these problems and provide solutions to each. Firstly, we show that the matrices of the homography coefficients can be recast into two parts, each consistent with ranks of only one. This immediately establishes the prospect of realistically (that is, with as few as only three or four homographies) exploiting the redundancies of the homographies over two views. We also tackle the remaining issue: correlated coefficients. We compare our approach with the \"gold standard\"; that is, non-linear bundle adjustment (initialized from the ground truth estimate-the ideal initialization). The results confirm our theory and show one can implement rank-constrained projection and come close to the gold standard in effectiveness. Indeed, our algorithm (by itself), or our algorithm further refined by a bundle adjustment stage; may be a practical algorithm: providing generally better results than the \"standard\" DLT (direct linear transformation) algorithm, and even better than the bundle adjustment result with the DLT result as the starting point. Our unoptimized version has roughly the same cost as bundle adjustment and yet can generally produce close to the \"gold standard\" estimate (as illustrated by comparison with bundle adjustment initialized from the ground truth). Independent of the merits or otherwise of our algorithm, we have illuminated why the naive approach of direct rank-projection is relatively doomed to failure. Moreover, in revealing that there are further rank constraints, not previously known; we have added to the understanding of these issues, and this may pave the way for further improvements.", "paper_title": "Rank Constraints for Homographies over Two Views: Revisiting the Rank Four Constraint", "paper_id": "WOS:000262401600008"}