{"auto_keywords": [{"score": 0.03773458804053226, "phrase": "citation_distributions"}, {"score": 0.004598933498016774, "phrase": "thomson_scientific"}, {"score": 0.004564031002210574, "phrase": "ts"}, {"score": 0.004494570360108983, "phrase": "citation_process"}, {"score": 0.004163427731140163, "phrase": "reference_and_citation_distributions"}, {"score": 0.003669330508576073, "phrase": "reference_distributions"}, {"score": 0.0032585499655442404, "phrase": "upper_tail_account"}, {"score": 0.0028170314398963704, "phrase": "lower_and_upper_tails"}, {"score": 0.002579326836642461, "phrase": "power_law"}, {"score": 0.002416589459425828, "phrase": "sub-field_level"}, {"score": 0.002129356014992349, "phrase": "power_law_algebra"}, {"score": 0.0021049977753042253, "phrase": "subtle_phenomenon"}], "paper_keywords": ["Research performance", " Citation analysis", " Power laws", " Characteristic Scores"], "paper_abstract": "This paper studies evidence from Thomson Scientific (TS) about the citation process of 3.7 million articles published in the period 1998-2002 in 219 Web of Science (WoS) categories, or sub-fields. Reference and citation distributions have very different characteristics across sub-fields. However, when analyzed with the Characteristic Scores and Scales (CSS) technique, which is replication and scale invariant, the shape of these distributions over three broad categories of articles appears strikingly similar. Reference distributions are mildly skewed, but citation distributions with a 5-year citation window are highly skewed: the mean is 20 points above the median, while 9-10% of all articles in the upper tail account for about 44% of all citations. The aggregation of sub-fields into disciplines and fields according to several aggregation schemes preserve this feature of citation distributions. It should be noted that when we look into subsets of articles within the lower and upper tails of citation distributions the universality partially breaks down. On the other hand, for 140 of the 219 sub-fields the existence of a power law cannot be rejected. However, contrary to what is generally believed, at the sub-field level the scaling parameter is above 3.5 most of the time, and power laws are relatively small: on average, they represent 2% of all articles and account for 13.5% of all citations. The results of the aggregation into disciplines and fields reveal that power law algebra is a subtle phenomenon.", "paper_title": "The skewness of science in 219 sub-fields and a number of aggregates", "paper_id": "WOS:000292210400004"}