{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "argumentation_semantics"}, {"score": 0.004644146045859622, "phrase": "labeling_arguments"}, {"score": 0.004581660953729745, "phrase": "dung_argumentation_framework"}, {"score": 0.004223941453664225, "phrase": "abstract_arguments"}, {"score": 0.00418595288276353, "phrase": "r_subset"}, {"score": 0.004129607015893271, "phrase": "x_a"}, {"score": 0.004074016501033133, "phrase": "binary_relation"}, {"score": 0.003965061486705487, "phrase": "attack_relation"}, {"score": 0.0038764861784138117, "phrase": "conflicting_arguments"}, {"score": 0.003824461073074135, "phrase": "labeling"}, {"score": 0.0037898820206470085, "phrase": "based_algorithms"}, {"score": 0.0036553070575015344, "phrase": "acceptable_arguments"}, {"score": 0.002466303439899648, "phrase": "af-extended_models"}, {"score": 0.002202469129781332, "phrase": "recursive_attacks"}, {"score": 0.0021049977753042253, "phrase": "unified_algorithms"}], "paper_keywords": [""], "paper_abstract": "A Dung argumentation framework (AF) is a pair (A,R): A is a set of abstract arguments and R subset of A x A is a binary relation, so-called the attack relation, for capturing the conflicting arguments. \"Labeling\" based algorithms for enumerating extensions (i.e. sets of acceptable arguments) have been set out such that arguments (i.e. elements of A) are the only subject for labeling. In this paper we present implemented algorithms for listing extensions by labeling attacks (i.e. elements of R) along with arguments. Specifically, these algorithms are concerned with enumerating all extensions of an AF under a number of argumentation semantics: preferred, stable, complete, semi stable, stage, ideal and grounded. Our algorithms have impact, in particular, on enumerating extensions of AF-extended models that allow attacks on attacks. To demonstrate this impact, we instantiate our algorithms for an example of such models: namely argumentation frameworks with recursive attacks (AFRA), thereby we end up with unified algorithms that enumerate extensions of any AF/AFRA.", "paper_title": "Algorithms for Argumentation Semantics: Labeling Attacks as a Generalization of Labeling Arguments", "paper_id": "WOS:000335435500001"}