{"auto_keywords": [{"score": 0.03480136597681607, "phrase": "crsa_constructs"}, {"score": 0.015575242964281913, "phrase": "crsa"}, {"score": 0.012245747956051302, "phrase": "crsa_reducts"}, {"score": 0.010125257889291934, "phrase": "real-life_data_sets"}, {"score": 0.009184279745694466, "phrase": "drsa"}, {"score": 0.004510336430422002, "phrase": "closely_related_theories"}, {"score": 0.004426882270402403, "phrase": "dominance-based_rough_sets_approach"}, {"score": 0.004127394241838696, "phrase": "feature_selection"}, {"score": 0.0038301525703886585, "phrase": "data_exploration"}, {"score": 0.0036553070575015344, "phrase": "minimal_subsets"}, {"score": 0.003570889780957037, "phrase": "sufficiently_high_quality"}, {"score": 0.0035376693476114733, "phrase": "object_description"}, {"score": 0.003329117824699891, "phrase": "generalized_notion"}, {"score": 0.0031182092708983184, "phrase": "numerous_practical_experiments"}, {"score": 0.00237733844863506, "phrase": "presented_drsa_constructs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rough sets approach", " Reduct", " Construct", " Indiscemibility", " Similarity", " Dominance"], "paper_abstract": "The idea of the reduct, as defined in the Classic Rough Sets Approach (CRSA), has proven to be inspiring enough to get into closely related theories, including the Dominance-based Rough Sets Approach (DRSA). The procedure of reduction is generally similar to that of Feature Selection, but narrower, as it is the descriptive, rather than the predictive, aspect of data exploration that constitutes its principal goal. CRSA reducts are thus defined as minimal subsets of attributes that retain sufficiently high quality of object description. Developed within CRSA, the CRSA reducts have given rise to the generalized notion of CRSA constructs, which have turned out to be superior to reducts in numerous practical experiments with real-life data sets. The generalization process is continued in this paper, in which a definition of constructs in the context of DRSA is introduced. The definition, fully analogous to that of CRSA constructs, differs only in that it is context-based in DRSA, while context-free in CRSA. Consequently, the presented DRSA constructs are expected to have analogous properties to that of CRSA constructs, including superiority to DRSA reducts in experiments with real-life data sets. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Reducts and constructs in classic and dominance-based rough sets approach", "paper_id": "WOS:000336011900004"}