{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "process_discovery"}, {"score": 0.04547624598453918, "phrase": "recorded_behavior"}, {"score": 0.028027257201936957, "phrase": "discovery_process"}, {"score": 0.0046848991277194845, "phrase": "precision"}, {"score": 0.004651580784980564, "phrase": "generalization"}, {"score": 0.004607409049501398, "phrase": "simplicity"}, {"score": 0.0045691640746165045, "phrase": "process_discovery_algorithms"}, {"score": 0.004477992162329249, "phrase": "process_models"}, {"score": 0.004442032546224076, "phrase": "event_logs"}, {"score": 0.00421520166010848, "phrase": "process_discovery_algorithm"}, {"score": 0.004081385289516914, "phrase": "resulting_model"}, {"score": 0.0029434299787644445, "phrase": "existing_process_discovery_algorithms"}, {"score": 0.0026932247685847246, "phrase": "existing_approaches"}, {"score": 0.002607598760956807, "phrase": "user-defined_weights"}, {"score": 0.0025145109881926143, "phrase": "etm_algorithm"}, {"score": 0.0021049977753042253, "phrase": "replay_fitness"}], "paper_keywords": ["Process mining", " process discovery", " process model quality"], "paper_abstract": "Process discovery algorithms typically aim at discovering process models from event logs that best describe the recorded behavior. Often, the quality of a process discovery algorithm is measured by quantifying to what extent the resulting model can reproduce the behavior in the log, i.e. replay fitness. At the same time, there are other measures that compare a model with recorded behavior in terms of the precision of the model and the extent to which the model generalizes the behavior in the log. Furthermore, many measures exist to express the complexity of a model irrespective of the log. In this paper, we first discuss several quality dimensions related to process discovery. We further show that existing process discovery algorithms typically consider at most two out of the four main quality dimensions: replay fitness, precision, generalization and simplicity. Moreover, existing approaches cannot steer the discovery process based on user-defined weights for the four quality dimensions. This paper presents the ETM algorithm which allows the user to seamlessly steer the discovery process based on preferences with respect to the four quality dimensions. We show that all dimensions are important for process discovery. However, it only makes sense to consider precision, generalization and simplicity if the replay fitness is acceptable.", "paper_title": "Quality Dimensions in Process Discovery: The Importance of Fitness, Precision, Generalization and Simplicity", "paper_id": "WOS:000336257600002"}