{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "frame_coefficients"}, {"score": 0.015469842941326485, "phrase": "unknown_locations"}, {"score": 0.0057707583807024955, "phrase": "original_signal"}, {"score": 0.004661446705304497, "phrase": "new_approaches"}, {"score": 0.004494570360108983, "phrase": "rearranged_frame_coefficients"}, {"score": 0.004195418010131832, "phrase": "encoded_information"}, {"score": 0.003791141540467091, "phrase": "appropriate_choices"}, {"score": 0.0035530197642369464, "phrase": "known_locations"}, {"score": 0.0032629585038738856, "phrase": "cost-efficient_algorithm"}, {"score": 0.0030828215204304473, "phrase": "erased_coefficients"}, {"score": 0.002762941385784905, "phrase": "uniform_excess"}, {"score": 0.002696479050724968, "phrase": "almost_robust_frame"}, {"score": 0.0026423134393535265, "phrase": "erased_data"}, {"score": 0.002578745296475411, "phrase": "almost_all_the_signals"}, {"score": 0.0024862418814045723, "phrase": "original_order"}, {"score": 0.0023776656246300063, "phrase": "numerical_examples"}, {"score": 0.002320449502337321, "phrase": "main_results"}, {"score": 0.0022830706430588482, "phrase": "received_data"}, {"score": 0.0021049977753042253, "phrase": "disordered_set"}], "paper_keywords": ["Erasures", " almost robust frames", " almost self-located frames"], "paper_abstract": "We propose new approaches to the problems of recovering signals from the rearranged frame coefficients or frame coefficients with erasures at either known or unknown locations. These problems naturally arise from applications, where the encoded information needs to be transmitted, for example, in signal/image processing, information and coding theory, and communications. We show that with the appropriate choices of the frames that are used for encoding, the signal with erasures occurring at known locations can be easily recovered without inverting the (sub) frame operators each time. Our new easy to implement and cost-efficient algorithm provides perfect reconstruction of the original signal. To address the problem of recovering erased coefficients from unknown locations, we propose to use a class of frames that are almost robust with respect to m-erasures. We prove that every frame with uniform excess can be rescaled to an almost robust frame and the locations of erased data can be perfectly recovered for almost all the signals. Similar results are obtained for recovering the original order of a disordered (rearranged) set of frame coefficients. Numerical examples are presented to test the main results. Whenever the received data are noise free, we can recover the original signal exactly from frame coefficients with erasures at unknown locations or from a disordered set of frame coefficients.", "paper_title": "Reconstruction of Signals From Frame Coefficients With Erasures at Unknown Locations", "paper_id": "WOS:000341982200024"}