{"auto_keywords": [{"score": 0.040061502696484744, "phrase": "heavily_pigmented_iris_recognition"}, {"score": 0.00481495049065317, "phrase": "commercial_iris_recognition_systems"}, {"score": 0.004501453956464956, "phrase": "electromagnetic_spectrum"}, {"score": 0.004312622975366676, "phrase": "heavily_pigmented_iris_images"}, {"score": 0.0037459885494311217, "phrase": "multispectral_acquisition_system"}, {"score": 0.003545024951402818, "phrase": "narrow_spectral_bands"}, {"score": 0.00257735013358606, "phrase": "performance-equal_error_rate"}, {"score": 0.002499508839669243, "phrase": "false_rejection_rate"}, {"score": 0.0023507916951658455, "phrase": "visual_observations"}, {"score": 0.0023221248824337576, "phrase": "magnified_detailed_local_iris_texture_information"}, {"score": 0.0021049977753042253, "phrase": "single_band"}], "paper_keywords": ["Cross wavelength matching", " iris recognition", " multispectral imaging"], "paper_abstract": "Commercial iris recognition systems usually acquire images of the eye in 850-nm band of the electromagnetic spectrum. In this work, the heavily pigmented iris images are captured at 12 wavelengths, from 420 to 940 nm. The purpose is to find the most suitable wavelength band for the heavily pigmented iris recognition. A multispectral acquisition system is first designed for imaging the iris at narrow spectral bands in the range of 420-940 nm. Next, a set of 200 human black irises which correspond to the right and left eyes of 100 different subjects are acquired for an analysis. Finally, the most suitable wavelength for heavily pigmented iris recognition is found based on two approaches: 1) the quality assurance of texture; 2) matching performance-equal error rate (EER) and false rejection rate (FRR). This result is supported by visual observations of magnified detailed local iris texture information. The experimental results suggest that there exists a most suitable wavelength band for heavily pigmented iris recognition when using a single band of wavelength as illumination.", "paper_title": "An Optimized Wavelength Band Selection for Heavily Pigmented Iris Recognition", "paper_id": "WOS:000318595000006"}