{"auto_keywords": [{"score": 0.03486844077325946, "phrase": "proposed_algorithms"}, {"score": 0.00481495049065317, "phrase": "optical_router_control_architecture"}, {"score": 0.0034720284451902083, "phrase": "data_plane_switch_fabric_contention"}, {"score": 0.003244050414264445, "phrase": "multihop_ols_simulation_network"}, {"score": 0.003204232566468624, "phrase": "self-similar_traffic_input"}, {"score": 0.0030686679245324837, "phrase": "simulation_results"}, {"score": 0.0029207251108325006, "phrase": "multihop_ols_network_performance"}, {"score": 0.0028670988845838296, "phrase": "hardware-efficient_design"}, {"score": 0.002779894844207706, "phrase": "proposed_router_controller"}, {"score": 0.0027457584014804574, "phrase": "major_modules"}, {"score": 0.002323826502178581, "phrase": "combined_unicast"}, {"score": 0.002295277579105177, "phrase": "multicast_video"}, {"score": 0.002225426912273257, "phrase": "proposed_ols_router_control_techniques"}, {"score": 0.0021311850321045767, "phrase": "edge_routers"}], "paper_keywords": ["Optical packet switching (OPS)", " Optical label switching (OLS)", " Router controller", " Contention resolution"], "paper_abstract": "This paper presents a new optical-label switching (OLS) router control plane controller for multihop asynchronous, variable-length packet switching incorporating fast, fair, and wavelength-aware arbitration. The proposed optical router controller implements efficient unicast/multicast packet contention resolution algorithms and channel scheduling schemes to resolve the data plane switch fabric contention. The paper evaluates the performance of proposed algorithms in a multihop OLS simulation network with self-similar traffic input under various traffic scenarios. The simulation results demonstrate that the proposed algorithms effectively improve the multihop OLS network performance. The hardware-efficient design and implementation of the proposed router controller and major modules are evaluated in terms of the area and delay for various switch sizes on a Xilinx XCV1000E field programmable gate array (FPGA) chip. Finally, this paper experimentally demonstrates the combined unicast and multicast video streaming enabled by the proposed OLS router control techniques over a label switching testbed with edge routers and realistic Ethernet/IP traffic input.", "paper_title": "Optical Router Control Architecture and Contention Resolution Algorithms Capable of Asynchronous, Variable-Length Packet Switching", "paper_id": "WOS:000284851400009"}