{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "relational_databases"}, {"score": 0.015508240237658179, "phrase": "semantic_web"}, {"score": 0.009594656986340787, "phrase": "existing_database_instance"}, {"score": 0.004256533389293113, "phrase": "key_factor"}, {"score": 0.00419861271409079, "phrase": "huge_amounts"}, {"score": 0.004122604238556912, "phrase": "semantic_web_applications"}, {"score": 0.0039027036493682887, "phrase": "key_concepts"}, {"score": 0.003867206750827, "phrase": "main_vehicle"}, {"score": 0.0037798652680135106, "phrase": "semantic_web_research_area"}, {"score": 0.0034813964296826973, "phrase": "semantic_web_community"}, {"score": 0.003265591844292821, "phrase": "database-to-ontology_mapping_problem"}, {"score": 0.002782647772219627, "phrase": "existing_ontology"}, {"score": 0.002275299774554847, "phrase": "tabular_format"}, {"score": 0.0022136780933978612, "phrase": "classification_scheme"}, {"score": 0.0021340985236583034, "phrase": "future_research_steps"}, {"score": 0.0021049977753042253, "phrase": "seamless_and_meaningful_integration"}], "paper_keywords": ["Relational database", " ontology", " mapping", " OWL", " survey"], "paper_abstract": "Relational databases are considered one of the most popular storage solutions for various kinds of data and they have been recognized as a key factor in generating huge amounts of data for Semantic Web applications. Ontologies, on the other hand, are one of the key concepts and main vehicle of knowledge in the Semantic Web research area. The problem of bridging the gap between relational databases and ontologies has attracted the interest of the Semantic Web community, even from the early years of its existence and is commonly referred to as the database-to-ontology mapping problem. However, this term has been used interchangeably for referring to two distinct problems: namely, the creation of an ontology from an existing database instance and the discovery of mappings between an existing database instance and an existing ontology. In this paper, we clearly define these two problems and present the motivation, benefits, challenges and solutions for each one of them. We attempt to gather the most notable approaches proposed so far in the literature, present them concisely in tabular format and group them under a classification scheme. We finally explore the perspectives and future research steps for a seamless and meaningful integration of databases into the Semantic Web.", "paper_title": "Bringing relational databases into the Semantic Web: A survey", "paper_id": "WOS:000209436700005"}