{"auto_keywords": [{"score": 0.03445800071283227, "phrase": "delta_cp"}, {"score": 0.012045250725894626, "phrase": "solvation_energies"}, {"score": 0.00966984199100051, "phrase": "delta_s-fusion"}, {"score": 0.006997287981907033, "phrase": "solvation_energy"}, {"score": 0.006132315534286817, "phrase": "room_temperature"}, {"score": 0.00590879200400893, "phrase": "estimated_values"}, {"score": 0.005188373527561013, "phrase": "approximate_sizes"}, {"score": 0.00481495049065317, "phrase": "computational_solvation_free_energies"}, {"score": 0.004736045157669388, "phrase": "fifth_time"}, {"score": 0.004553764959068428, "phrase": "sampl_challenge"}, {"score": 0.0044514440242754815, "phrase": "related_structure"}, {"score": 0.004405694297130954, "phrase": "blind_sets"}, {"score": 0.004297795905522757, "phrase": "best_current_values"}, {"score": 0.004227329479384305, "phrase": "complete_documentation"}, {"score": 0.004201202199968683, "phrase": "experimental_origins"}, {"score": 0.004106770500518124, "phrase": "reported_data"}, {"score": 0.004047781270412204, "phrase": "particular_attention"}, {"score": 0.0038598374463252993, "phrase": "liquid_compound"}, {"score": 0.003773049633656302, "phrase": "vpsubcooled_liquid"}, {"score": 0.003757480190200645, "phrase": "vpsublimation"}, {"score": 0.0035755653799043, "phrase": "benzene_derivatives"}, {"score": 0.003516898780234098, "phrase": "final_compound"}, {"score": 0.0034024277222012597, "phrase": "modest_errors"}, {"score": 0.0031452231581533814, "phrase": "vpsubcooled"}, {"score": 0.0028894120284756707, "phrase": "boiling_point"}, {"score": 0.0025100713447593773, "phrase": "trustworthy_extrapolation"}, {"score": 0.0024586427394152196, "phrase": "lowest_temperature"}, {"score": 0.0024383748912010345, "phrase": "vp"}, {"score": 0.0023201669008927023, "phrase": "significant_effects"}, {"score": 0.0022773309395419427, "phrase": "experimental_values"}, {"score": 0.0022679195103377124, "phrase": "possible_intramolecular_hydrogen_bonds"}, {"score": 0.0021049977753042253, "phrase": "delta_gs"}], "paper_keywords": ["Solvation energies", " Solubility", " Vapor pressure", " Henry's Law Constant"], "paper_abstract": "For the fifth time I have provided a set of solvation energies (1 M gas to 1 M aqueous) for a SAMPL challenge. In this set there are 23 blind compounds and 30 supplementary compounds of related structure to one of the blind sets, but for which the solvation energy is readily available. The best current values of each compound are presented along with complete documentation of the experimental origins of the solvation energies. The calculations needed to go from reported data to solvation energies are presented, with particular attention to aspects which are new to this set. For some compounds the vapor pressures (VP) were reported for the liquid compound, which is solid at room temperature. To correct from VPsubcooled liquid to VPsublimation requires Delta S-fusion, which is only known for mannitol. Estimated values were used for the others, all but one of which were benzene derivatives and expected to have very similar values. The final compound for which Delta S-fusion was estimated was menthol, which melts at 42 A degrees C so that modest errors in Delta S-fusion will have little effect. It was also necessary to look into the effects of including estimated values of Delta Cp on this correction. The approximate sizes of the effects of inclusion of Delta Cp in the correction from VPsubcooled (liquid) to VPsublimation were estimated and it was noted that inclusion of Delta Cp invariably makes Delta G(S) more positive. To extend the set of compounds for which the solvation energy could be calculated we explored the use of boiling point (b.p.) data from Reaxys/Beilstein as a substitute for studies of the VP as a function of temperature. B.p. data are not always reliable so it was necessary to develop a criterion for rejecting outliers. For two compounds (chlorinated guaiacols) it became clear that inclusion represented overreach; for each there were only two independent pressure, temperature points, which is too little for a trustworthy extrapolation. For a number of compounds the extrapolation from lowest temperature at which the VP was reported to 25 A degrees C was long (sometimes over 100A degrees) so that it was necessary to consider whether Delta Cp might have significant effects. The problem is that there are no experimental values and possible intramolecular hydrogen bonds make estimation uncertain in some cases. The approximate sizes of the effects of Delta Cp were estimated, and it was noted that inclusion of Delta Cp in the extrapolation of VP down to room temperature invariably makes Delta Gs more negative.", "paper_title": "SAMPL4, a blind challenge for computational solvation free energies: the compounds considered", "paper_id": "WOS:000335233100002"}