{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "user_performance"}, {"score": 0.004763565662615503, "phrase": "two-dimensional_and_three-dimensional_perspective_displays"}, {"score": 0.0029064676523923886, "phrase": "significant_difference"}, {"score": 0.002460295872115956, "phrase": "detailed_design"}, {"score": 0.0024209250169088575, "phrase": "visual_display"}, {"score": 0.0023694065215394593, "phrase": "considerable_effect"}, {"score": 0.0022696277881969896, "phrase": "simulation_project"}, {"score": 0.0021975548867457606, "phrase": "overall_project"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Discrete event simulation", " Visual display", " Model validation", " Model verification", " Two-dimensional display", " Three-dimensional perspective"], "paper_abstract": "Several experiments were carried out to compare the impacts of using a two dimensional (2D) plan view or a three dimensional (3D) perspective view in discrete event simulation visual displays. The experiments measured the performance of participants in spotting errors, describing the model, and suggesting improvements to the system. The participants using the 3D perspective display performed much better in spotting errors, taking on average about one third of the time of participants observing the 2D display. They also did much better in describing the model. There was no significant difference in suggesting improvements although this may have been because this task was easy. Most participants preferred the 3D perspective view when asked to compare the displays. The experiments indicate that the detailed design of the visual display may have a considerable effect on some of the tasks in a simulation project and hence on whether the overall project is successful. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Experimental evaluation of user performance on two-dimensional and three-dimensional perspective displays in discrete-event simulation", "paper_id": "WOS:000341557500002"}