{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "improving_collections"}, {"score": 0.004784565134881178, "phrase": "shape_maps"}, {"score": 0.004620825188916713, "phrase": "long-standing_problem"}, {"score": 0.0044910139920501515, "phrase": "solution_approaches"}, {"score": 0.004175533280178052, "phrase": "pairwise_map"}, {"score": 0.004109926210263146, "phrase": "full_advantage"}, {"score": 0.004071055784602253, "phrase": "existing_information"}, {"score": 0.003994409920585572, "phrase": "notorious_problem"}, {"score": 0.0039691820377914635, "phrase": "computing_shape_maps"}, {"score": 0.0038821277513157973, "phrase": "symmetry_problem"}, {"score": 0.0038090252359678336, "phrase": "reflectional_symmetry"}, {"score": 0.0036785473375981533, "phrase": "intrinsic_mapping_algorithm"}, {"score": 0.0035412818367359378, "phrase": "prominent_issue"}, {"score": 0.0035189057079817285, "phrase": "shape_mapping_algorithms"}, {"score": 0.003261133560558666, "phrase": "additional_shape_maps"}, {"score": 0.0031493643207295406, "phrase": "global_map_consistency"}, {"score": 0.0028726685746632654, "phrase": "equally_good_symmetric_alternatives"}, {"score": 0.0028095957871860653, "phrase": "\"bad\"_pairwise_map"}, {"score": 0.00267905164093555, "phrase": "original_ones"}, {"score": 0.0025954008219792337, "phrase": "pairwise_shape_maps"}, {"score": 0.00255455751702188, "phrase": "optimization_problem"}, {"score": 0.0025063909490744855, "phrase": "alternative_maps"}, {"score": 0.0022216880365475418, "phrase": "seed_set"}, {"score": 0.0022076314894741394, "phrase": "good_pairwise_maps"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_mapping_methods"}], "paper_keywords": [""], "paper_abstract": "Finding an informative, structure-preserving map between two shapes has been a long-standing problem in geometry processing, involving a variety of solution approaches and applications. However, in many cases, we are given not only two related shapes, but a collection of them, and considering each pairwise map independently does not take full advantage of all existing information. For example, a notorious problem with computing shape maps is the ambiguity introduced by the symmetry problem - for two similar shapes which have reflectional symmetry there exist two maps which are equally favorable, and no intrinsic mapping algorithm can distinguish between them based on these two shapes alone. Another prominent issue with shape mapping algorithms is their relative sensitivity to how \"similar\" two shapes are - good maps are much easier to obtain when shapes are very similar. Given the context of additional shape maps connecting our collection, we propose to add the constraint of global map consistency, requiring that any composition of maps between two shapes should be independent of the path chosen in the network. This requirement can help us choose among the equally good symmetric alternatives, or help us replace a \"bad\" pairwise map with the composition of a few \"good\" maps between shapes that in some sense interpolate the original ones. We show how, given a collection of pairwise shape maps, to define an optimization problem whose output is a set of alternative maps, compositions of those given, which are consistent, and individually at times much better than the original. Our method is general, and can work on any collection of shapes, as long as a seed set of good pairwise maps is provided. We demonstrate the effectiveness of our method for improving maps generated by state-of-the-art mapping methods on various shape databases.", "paper_title": "An Optimization Approach to Improving Collections of Shape Maps", "paper_id": "WOS:000293524100012"}