{"auto_keywords": [{"score": 0.03618870164102205, "phrase": "climber"}, {"score": 0.00481495049065317, "phrase": "research_efforts"}, {"score": 0.004294724955301414, "phrase": "participating_peer's_resources"}, {"score": 0.0033285306462537884, "phrase": "streaming_system"}, {"score": 0.003143341238802547, "phrase": "hybrid_structure"}, {"score": 0.0028921584725218642, "phrase": "users'_dynamic"}, {"score": 0.0027454383581457555, "phrase": "incentive_mechanism"}, {"score": 0.002702887319160532, "phrase": "better_resilience"}, {"score": 0.002435542937327155, "phrase": "splitstream"}, {"score": 0.0024103044278902916, "phrase": "nice-prm."}, {"score": 0.00234834406550549, "phrase": "analytical_results"}, {"score": 0.002171836484200008, "phrase": "user_churning_rate"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["P2P live streaming", " Resilience", " Incentive", " Self-improvement", " Adaptation"], "paper_abstract": "Recently, there have been a lot of research efforts on peer-to-peer (P2P) live streaming services. P2P systems can be easily deployed since a participating peer's resources (i.e., upload link bandwidth) can be exploited to distribute contents. However, how to adapt to leaving peers and how to encourage peers to contribute resources voluntarily are still challenging issues. In this paper, we propose Climber, an adaptive P2P live streaming system with incentives for resilience. Climber is based on the hybrid structure of a tree and a mesh, so as to achieve self-improvement and adaptation to users' dynamic joining and leaving. Moreover, Climber substantiates an incentive mechanism that provides better resilience for peers with more upload bandwidth allocated. Simulation results reveal that Climber significantly reduces the topology maintenance cost compared to SplitStream and NICE-PRM. Also, simulation and analytical results verify that Climber can bound the level of disruption by dynamically adapting to the user churning rate. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "An adaptive peer-to-peer live streaming system with incentives for resilience", "paper_id": "WOS:000279039400006"}