{"auto_keywords": [{"score": 0.040600490254161195, "phrase": "knowledge_sharing"}, {"score": 0.00481495049065317, "phrase": "knowledge_sharing_processes"}, {"score": 0.004768378525561471, "phrase": "academic_conferences"}, {"score": 0.0035790515333340754, "phrase": "montreal"}, {"score": 0.003459191419478298, "phrase": "knowledge_content"}, {"score": 0.0030628762739398855, "phrase": "informal_knowledge_exchange"}, {"score": 0.00303319936111073, "phrase": "social_events"}, {"score": 0.0027922467043592597, "phrase": "formal_settings"}, {"score": 0.002711842889248926, "phrase": "informal_settings"}, {"score": 0.0026209522797963447, "phrase": "future_research"}, {"score": 0.002545468362709126, "phrase": "social_relationships"}, {"score": 0.0024842242921857705, "phrase": "informal_knowledge_sharing"}, {"score": 0.002436289099444074, "phrase": "job_enhancement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Academic conference", " Formal knowledge sharing", " Informal knowledge sharing", " Conference technology"], "paper_abstract": "Academic conferences are places of situated learning dedicated to the exchange of knowledge. Knowledge is exchanged between colleagues who are looking to enhance their future research by taking part in several formal and informal settings (lectures, discussions and social events). We studied the processes of knowledge sharing and the influence of the use of IT at the International Conference of Information Systems (ICIS2007) held in Montreal. We describe the categories of knowledge content shared at the conference. Two forms of knowledge sharing were analyzed: formal, guided, planned knowledge sharing in lectures or discussions, and informal knowledge exchange during social events. Data were collected from 274 participants at the conference. The intensity of knowledge sharing in the formal settings was higher compared to the informal settings and was perceived as contributing to future research and to the creation of social relationships. In contrast, informal knowledge sharing contributed mainly to job enhancement and to the initiation of meetings. The discussion centers on planning and evaluating conferences in terms of seeking, creating and sustaining knowledge sharing. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Knowledge exchange in the shrines of knowledge: The \"how's\" and \"where's\" of knowledge sharing processes", "paper_id": "WOS:000271297200025"}