{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "sensor_networks"}, {"score": 0.004504850679320975, "phrase": "recent_progress"}, {"score": 0.004434824354230475, "phrase": "low-power_embedded_systems"}, {"score": 0.0041167185402778425, "phrase": "static_sensor_networks"}, {"score": 0.004084584884062157, "phrase": "mobile_nodes"}, {"score": 0.003989675045520656, "phrase": "traditional_static_sensor_networks"}, {"score": 0.0038665369393234713, "phrase": "topology_control"}, {"score": 0.0038363485899400285, "phrase": "mobile_wireless_networks"}, {"score": 0.0032539388572032563, "phrase": "regular_tessellation"}, {"score": 0.0032158817866929563, "phrase": "geographical_area"}, {"score": 0.0030440661915657175, "phrase": "physical_phenomenon"}, {"score": 0.003020279889535487, "phrase": "network_nodes"}, {"score": 0.0028365413717574544, "phrase": "network_connectivity"}, {"score": 0.0026639507068734907, "phrase": "monitoring_configuration"}, {"score": 0.0025614418906438744, "phrase": "virtual_force-based_strategy"}, {"score": 0.0024436119167523156, "phrase": "optimal_centralized_solution"}, {"score": 0.002312960805824996, "phrase": "different_shapes"}, {"score": 0.002259123228671651, "phrase": "transient_behavior"}, {"score": 0.0021467260992026295, "phrase": "response_time"}, {"score": 0.0021215910859085146, "phrase": "proposed_solution"}], "paper_keywords": ["distributed algorithm", " mobile network", " sensor relocation", " wireless sensor network"], "paper_abstract": "Sensor networks are envisioned to revolutionize our daily life by ubiquitously monitoring our environment and/or adjusting it to suit our needs. Recent progress in robotics and low-power embedded systems has made it possible to add mobility to small, light, low-cost sensors to be used in teams or swarms. Augmenting static sensor networks with mobile nodes addresses many design challenges that exist in traditional static sensor networks. This paper addresses the problem of topology control in mobile wireless networks. Limitations in communication, computation and energy capabilities push towards the adoption of distributed, energy-efficient solutions to perform self-deployment and relocation of the nodes. We develop a unified; distributed algorithm that has the following features. During deployment, our algorithm yields a regular tessellation of the geographical area with a given node density, called monitoring configuration. Upon the occurrence of a physical phenomenon, network nodes relocate themselves so as to properly sample and control the event, while maintaining the network connectivity. Then, as soon as the event ends, all nodes return to the monitoring configuration. To achieve these goals, we use a virtual force-based strategy which proves to be very effective even when compared to an optimal centralized solution. We assess the performance of our approach in the presence of events with different shapes, and we investigate the transient behavior of our algorithm. This allows us to evaluate the effectiveness and the response time of the proposed solution under various environmental conditions.", "paper_title": "Sensor deployment and relocation: A unified scheme", "paper_id": "WOS:000255955800009"}