{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nurbs_curves"}, {"score": 0.04153811225149283, "phrase": "first_method"}, {"score": 0.03633602825352822, "phrase": "affine_transformation"}, {"score": 0.033891294628366764, "phrase": "second_method"}, {"score": 0.004023120753104693, "phrase": "cad_models"}, {"score": 0.0038217146888983576, "phrase": "exterior_knots"}, {"score": 0.003782655283668953, "phrase": "nurbs._watermarks"}, {"score": 0.0034133126639601208, "phrase": "mobius"}, {"score": 0.0031116963435584982, "phrase": "mobius_transformation"}, {"score": 0.0027646829399573434, "phrase": "linear_reparameterization"}, {"score": 0.002193447487477984, "phrase": "data_amount-preserving_properties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Digital watermarking", " NURBS curves and surfaces", " Knots", " Reparameterization", " Cross-ratio"], "paper_abstract": "This paper presents two watermarking methods for NURBS curves and surfaces. Both methods are blind, shape-preserving and data amount-preserving. These features are often required in watermarking of CAD models. The first method is based on the replacement of exterior knots of NURBS. Watermarks are embedded into the cross-ratio of four knots in the knot vector(s) and the method is robust to affine transformation, Mobius reparameterization, and interior knot insertion and removal operations. The second method is based on reparameterization using Mobius transformation. Watermarks are embedded into the ratio of two knot intervals selected from the knot vector(s) and the method is robust to affine transformation and linear reparameterization. The capacity of the first method is m - 1 for a degree m NURBS curve and m + n - 2 for a degree m x n NURBS surface, and the capacity of the second method is 1 for a curve and 2 for a surface. Experiments have been conducted to demonstrate the shape-preserving, data amount-preserving properties and robustness. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Blind watermarking of NURBS curves and surfaces", "paper_id": "WOS:000311972700007"}