{"auto_keywords": [{"score": 0.048019249999775485, "phrase": "future_internet"}, {"score": 0.03465835716137748, "phrase": "end_users"}, {"score": 0.0043519860930099795, "phrase": "interoperable_web_services"}, {"score": 0.004056334733843591, "phrase": "global_user-service_interaction"}, {"score": 0.003985602342418578, "phrase": "open_issue"}, {"score": 0.0034319005131102495, "phrase": "traditional_services"}, {"score": 0.0031289290660162145, "phrase": "service-based_applications"}, {"score": 0.002941913249957503, "phrase": "programming_skills"}, {"score": 0.002670296619878048, "phrase": "composite_applications"}, {"score": 0.002544017922741882, "phrase": "case_study"}, {"score": 0.0025106241866273897, "phrase": "current_user-centred_web_development_tools"}, {"score": 0.002381365139274329, "phrase": "statistical_data"}, {"score": 0.002339771435910601, "phrase": "proposed_architecture"}, {"score": 0.0021901687787200634, "phrase": "sfe"}, {"score": 0.0021709339252206825, "phrase": "open_alliance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Future Internet", " Internet of services", " Web 2.0", " Service front-ends", " User-service interaction", " Context", " SOA"], "paper_abstract": "The future Internet is expected to be composed of a mesh of interoperable web services accessible from all over the web. This approach has not yet caught on since global user-service interaction is still an open issue. This paper states one vision with regard to next-generation front-end Web 2.0 technology that will enable integrated access to services, contents and things in the future Internet. In this paper, we illustrate how front-ends that wrap traditional services and resources can be tailored to the needs of end users, converting end users into prosumers (creators and consumers of service-based applications). To do this, we propose an architecture that end users without programming skills can use to create front-ends, consult catalogues of resources tailored to their needs, easily integrate and coordinate front-ends and create composite applications to orchestrate services in their back-end. The paper includes a case study illustrating that current user-centred web development tools are at a very early stage of evolution. We provide statistical data on how the proposed architecture improves these tools. This paper is based on research conducted by the Service Front End (SFE) Open Alliance initiative. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Developing front-end Web 2.0 technologies to access services, content and things in the future Internet", "paper_id": "WOS:000317889500008"}