{"auto_keywords": [{"score": 0.04799343046418511, "phrase": "baf"}, {"score": 0.03296402795926519, "phrase": "hydrogen_bonds"}, {"score": 0.01571968879667472, "phrase": "barrier-to-autointegration_factor"}, {"score": 0.009887320014260006, "phrase": "baf."}, {"score": 0.008753167405273418, "phrase": "binding_free_energy"}, {"score": 0.004735363390351752, "phrase": "dna."}, {"score": 0.004656871909510407, "phrase": "binding_mechanism"}, {"score": 0.004466519142879166, "phrase": "wild_type"}, {"score": 0.004307824824939332, "phrase": "molecular_docking"}, {"score": 0.004236487143672267, "phrase": "crystal_structures"}, {"score": 0.00420127096865986, "phrase": "pdb"}, {"score": 0.00392975069429078, "phrase": "molecular_dynamics"}, {"score": 0.003675722511837565, "phrase": "monomer_baf"}, {"score": 0.003418958653159371, "phrase": "good_agreement"}, {"score": 0.0033905067962602515, "phrase": "experimental_results"}, {"score": 0.0032427017567827235, "phrase": "baf_conformation"}, {"score": 0.003188946047322158, "phrase": "deeper_investigation"}, {"score": 0.0031448288291084, "phrase": "baf_structures"}, {"score": 0.003075503355629819, "phrase": "great_contribution"}, {"score": 0.0027741761880779535, "phrase": "important_effect"}, {"score": 0.00223196703759329, "phrase": "decreasing_energy"}, {"score": 0.0022010598350982458, "phrase": "hydrophobic_pocket"}, {"score": 0.002182720878764192, "phrase": "binding_site"}], "paper_keywords": ["Barrier-to-autointegration factor", " DNA: protein docking", " Molecular dynamics", " Point mutation"], "paper_abstract": "In order to understand the binding mechanism between Barrier-to-autointegration factor (BAF) and DNA, two DNA: BAF complexes with wild type (WT) BAF and its Gly25Glu point mutate type (MT) were generated by molecular docking on the basis of the crystal structures of BAF (PDB code: 2ODG, chain A) and DNA (PDB code: 2BZF, chain B and C). Then, molecular dynamics (MD) simulations were performed on the two docked structures, as well as BAF (WT) and BAF (MT). The results show that monomer BAF is more flexible than BAF in DNA: BAF complex, suggesting that DNA is effective to stabilize conformation of BAF, which is in good agreement with the experimental results. Besides, the mutated Glu25 in DNA: BAF (MT) can change the BAF conformation to some extent. With deeper investigation on the DNA: BAF structures, the hydrogen bonds are found to make great contribution to the interaction between DNA and BAF. The hydrogen bonds in DNA: BAF (MT) are fewer than those in DNA: BAF (WT), indicating that the Gly25Glu mutation in BAF has an important effect on the hydrogen bonds in the DNA: BAF complex. Besides, the binding free energy in DNA: BAF (MT) is also higher than that in DNA: BAF (WT). It results from the influence of Glu25 side chain on the orientation of Lys6 and Lys33 in the interface between DNA and BAF. The binding free energy of Lys72, another key residue, decreases a lot in DNA: BAF (MT) anomalously. The decreasing energy causes the destruction of hydrophobic pocket in the binding site between DNA and BAF (MT). Our results are helpful for further experimental investigations.", "paper_title": "Molecular simulation investigation on the interaction between barrier-to-autointegration factor or its Gly25Glu mutant and DNA", "paper_id": "WOS:000336306200004"}