{"auto_keywords": [{"score": 0.03397371904693442, "phrase": "ehr"}, {"score": 0.014500217021189194, "phrase": "preventive_services"}, {"score": 0.009452434391339921, "phrase": "control_group"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record"}, {"score": 0.0047057084749407485, "phrase": "health_maintenance_clinical_guidelines"}, {"score": 0.004598933498016774, "phrase": "health_maintenance"}, {"score": 0.004517556521547285, "phrase": "premature_mortality"}, {"score": 0.0044150318724093226, "phrase": "recommended_intervals"}, {"score": 0.004314823905616251, "phrase": "up-to-date_information"}, {"score": 0.004238452771031322, "phrase": "electronic_health_records"}, {"score": 0.0041001740903338834, "phrase": "patient_input"}, {"score": 0.003906116922372891, "phrase": "current_state"}, {"score": 0.0038862297330905836, "phrase": "ehr_completeness"}, {"score": 0.0038369519063516703, "phrase": "added_value"}, {"score": 0.0036646500791760734, "phrase": "health_maintenance_procedure_information"}, {"score": 0.0033685408148574846, "phrase": "primary_care_practice"}, {"score": 0.0031440987202675332, "phrase": "additional_information"}, {"score": 0.003010496595090984, "phrase": "due_test_information"}, {"score": 0.0029196116767956273, "phrase": "medical_records"}, {"score": 0.002831462722290752, "phrase": "preventive_guidelines"}, {"score": 0.002656251288196166, "phrase": "patient_report"}, {"score": 0.0025760331710429976, "phrase": "health_maintenance_procedures"}, {"score": 0.002472822097373027, "phrase": "overall_adherence"}, {"score": 0.002435190484324197, "phrase": "cumulative_effects"}, {"score": 0.002422773998743726, "phrase": "additional_patient-reported_procedures"}, {"score": 0.002373736426377474, "phrase": "intervention_patients"}, {"score": 0.002361632539339945, "phrase": "higher_documented_adherence_rates"}, {"score": 0.0022154296909169826, "phrase": "useful_information"}, {"score": 0.0021817065300196634, "phrase": "patient_contributions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["electronic health record", " Personal health record", " quality of care", " quality measurement", " health maintenance"], "paper_abstract": "Background: Health maintenance is crucial for preventing morbidity and premature mortality, but many patients do not receive preventive services at recommended intervals. One reason for this is the lack of up-to-date information accurately reflecting patients' history. Electronic health records (EHRs) can be useful, but are often incomplete. Patient input has the potential to improve the accuracy of this information. In this study, we assessed the current state of EHR completeness for preventive services and the added value of patient reported information. Methods: Participants were sent a survey, pre-populated with health maintenance procedure information from their EHRs. They were asked to review this information and indicate whether it was accurate or if they had a procedure done more recently. Of 1098 patients recruited from a primary care practice, 163 returned the survey. When a patient reported a more recent test than was noted in the EHR, researchers updated the EHR to reflect the additional information. Data were also gathered from the EHR 6 months after surveys were completed to analyze whether providing due test information encouraged patients to get tested and vaccinated. A review of medical records was performed on a control group to analyze differences in adherence to preventive guidelines between those that were notified of their overdue status and those who were not notified. Results: The EHR was frequently incomplete when compared to patient report. In particular, many patients were misidentified as being overdue for health maintenance procedures when they had obtained them in other places. Showing patients their information resulted in little impact on overall adherence. However, with the cumulative effects of additional patient-reported procedures and procedures performed after the survey, intervention patients had higher documented adherence rates for every procedure than the control group. Conclusions: Health maintenance data in EHRs were often incomplete. Patients were often able to provide useful information, demonstrating the value of patient contributions in keeping records up-to-date. (c) 2005 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Improving electronic health record (EHR) accuracy and increasing compliance with health maintenance clinical guidelines through patient access and input", "paper_id": "WOS:000241649800001"}