{"auto_keywords": [{"score": 0.029037338139254607, "phrase": "multiple_categorical_data_sets"}, {"score": 0.011419491654324872, "phrase": "categorical_data"}, {"score": 0.004563028873351776, "phrase": "multiple_categorical_data"}, {"score": 0.004412285905508977, "phrase": "important_step"}, {"score": 0.0043533862892678864, "phrase": "data_mining_and_knowledge_management"}, {"score": 0.00398916666053909, "phrase": "continuous_data"}, {"score": 0.0031738126998349775, "phrase": "numerical_format"}, {"score": 0.0027741761880779535, "phrase": "new_measure"}, {"score": 0.002524688179363081, "phrase": "conventional_drawbacks"}, {"score": 0.0023131084326717755, "phrase": "mathematical_proofs"}, {"score": 0.0022365262201954643, "phrase": "experimental_result"}, {"score": 0.0021049977753042253, "phrase": "proper_data_distributions"}], "paper_keywords": ["Similarity", " Categorical data", " Distance measure", " Multiple categories"], "paper_abstract": "How to measure similarity or distance for multiple categorical data? It is an important step for Data Mining and Knowledge Management process to measure similarity or distance between objects appropriately. Measurements for continuous data have been well-defined and relatively easy to be calculated. However, the notion of similarity for categorical data is not simple, since categorical data usually is not simply translated into the numerical format, and they also have their own priority with structures and data distribution. In this paper, we propose a new measure for multiple categorical data sets using data distribution. Our new measure, MCSM (Multiple Categorical Similarity Measure), can solve conventional drawbacks of multiple categorical data sets successfully in which we prove the verification of our measure with mathematical proofs and experimentation. The experimental result shows that our measure is powerful for multiple categorical data sets with proper data distributions.", "paper_title": "How to measure similarity for multiple categorical data sets?", "paper_id": "WOS:000354493000017"}