{"auto_keywords": [{"score": 0.0493679546150361, "phrase": "youtube"}, {"score": 0.012925841292387745, "phrase": "youtube_users"}, {"score": 0.00481495049065317, "phrase": "content_analyses"}, {"score": 0.004757643419056999, "phrase": "purpose_-_the_video-sharing_website"}, {"score": 0.004589763483242731, "phrase": "user_comments_facility"}, {"score": 0.0041703614123283165, "phrase": "social_networking"}, {"score": 0.004133055661437163, "phrase": "question_answering"}, {"score": 0.003857871979942733, "phrase": "interactive_feature"}, {"score": 0.0036662773795817544, "phrase": "content_analysis"}, {"score": 0.0036225919379274875, "phrase": "youtube_videos"}, {"score": 0.0035687137873965684, "phrase": "classification_schema"}, {"score": 0.003371159698962328, "phrase": "ten_broad_categories"}, {"score": 0.0033011569787033297, "phrase": "wide-ranging_use"}, {"score": 0.0032716011062067286, "phrase": "youtube_comments_facility"}, {"score": 0.0031654684543975077, "phrase": "new_types"}, {"score": 0.0029722900280316216, "phrase": "initial_structure"}, {"score": 0.0028931405607654495, "phrase": "ongoing_use"}, {"score": 0.002867227226349298, "phrase": "youtube_comments"}, {"score": 0.0028330357751826934, "phrase": "communication_device"}, {"score": 0.0026521229155782654, "phrase": "user-generated_content"}, {"score": 0.0024604876113911173, "phrase": "user_intent"}, {"score": 0.002352202897945092, "phrase": "user_commenting_facility"}, {"score": 0.0021049977753042253, "phrase": "classification_scheme"}], "paper_keywords": ["Analysis", " Classification schemes", " Communication", " World Wide Web", " User studies", " Information management", " Video"], "paper_abstract": "Purpose - The video-sharing website YouTube encourages interaction between its users via the provision of a user comments facility. This was originally envisaged as a way for viewers to provide information about and reactions to videos, but is employed for other communicative purposes including sharing ideas, paying tributes, social networking, and question answering. This study seeks to examine and categorise the types of comments created by YouTube users to highlight the various ways in which this interactive feature has been employed as a means of communication and self-expression. Design/methodology/approach - By conducting a content analysis of 66,637 user comments on YouTube videos the authors created a classification schema which may be used to categorise the types of comments users leave. Findings - The schema reveals ten broad categories, and 58 subcategories which reflect the wide-ranging use of the YouTube comments facility. Research limitations/implications - As YouTube continues to evolve, new types of comments that do not appear in the scheme outlined will appear. However, this schema will provide an initial structure upon which other investigations can build when analysing the ongoing use of the YouTube comments feature as a communication device. Practical implications - This scheme may be used for researchers in a variety of disciplines who are interested in using user-generated content. The scheme will aid in the description and mining of this content and provides a way of structuring this content into categories representing user intent. Social implications - This study highlights the variety of purposes to which the user commenting facility of YouTube is employed. These include purposes such as reminiscence, grieving, giving advice and communication. Originality/value - This is the first detailed, content-based analysis. of the types of comments created by YouTube users. The classification scheme facilitates the analysis of these comments for a variety of purposes, including marketing, communication studies and studies of information seeking.", "paper_title": "A classification scheme for content analyses of You Tube video comments", "paper_id": "WOS:000325444500006"}