{"auto_keywords": [{"score": 0.04574248298084958, "phrase": "voltage_levels"}, {"score": 0.009998253522201924, "phrase": "significant_improvements"}, {"score": 0.00481495049065317, "phrase": "variation-aware_selection"}, {"score": 0.004475266375001531, "phrase": "multiple_frequency_and_voltage_domains"}, {"score": 0.003751011827704279, "phrase": "voltage_characteristics"}, {"score": 0.003623949225126944, "phrase": "different_voltage_domains"}, {"score": 0.003501175642882274, "phrase": "two-pronged_approach"}, {"score": 0.003324743991757282, "phrase": "conventional_fixed_coupling"}, {"score": 0.0031032109441552287, "phrase": "individual_chip_instances"}, {"score": 0.0026456667695073043, "phrase": "discrete_voltage_levels"}, {"score": 0.0026116610153271943, "phrase": "variation-aware_manner"}, {"score": 0.0025449518236394103, "phrase": "ideal_voltage_distribution"}, {"score": 0.002416589459425828, "phrase": "proposed_techniques"}, {"score": 0.002197801146305747, "phrase": "parametric_yield"}, {"score": 0.0021416404045850224, "phrase": "power_and_performance_targets"}, {"score": 0.0021049977753042253, "phrase": "conventional_voltage_scaling"}], "paper_keywords": ["Process variations", " voltage scaling"], "paper_abstract": "In this paper, we address the problem of variation-aware selection of voltage levels for system-on-chips (SoCs) that are organized into multiple frequency and voltage domains. Conventionally, the voltage levels for each domain, as well as the mapping between frequencies and voltages, are determined without considering variations. In the presence of variations, these choices are often suboptimal since the frequency versus voltage characteristics vary from one SoC instance to another and across different voltage domains within an instance. We present a two-pronged approach to address this problem. First, we propose breaking the conventional fixed coupling between voltage levels and frequencies and demonstrate that performing this association based on the characteristics of individual chip instances can lead to significant improvements in power and performance. Second, we show that voltage levels that are computed while accounting for variations can lead to further improvements. We present a methodology to determine a set of discrete voltage levels in a variation-aware manner by generating and quantizing the ideal voltage distribution for a given SoC. Our experiments on an 802.11 MAC processor SoC indicate that the proposed techniques lead to significant improvements in power and performance characteristics in the presence of variations. We obtained an improvement of up to 68% in parametric yield (number of chips meeting power and performance targets) compared to conventional voltage scaling.", "paper_title": "Variation-Aware Voltage Level Selection", "paper_id": "WOS:000302640200013"}