{"auto_keywords": [{"score": 0.04697189954855942, "phrase": "web_information"}, {"score": 0.00481495049065317, "phrase": "context-aware_personal_information_retrieval_from_multiple_social_networks"}, {"score": 0.004630423009638876, "phrase": "social_networking_services"}, {"score": 0.00445293569103488, "phrase": "future_reuse"}, {"score": 0.00409508755819924, "phrase": "online_conversation"}, {"score": 0.0037869901077566526, "phrase": "proper_cues"}, {"score": 0.003405472159599442, "phrase": "online_conversation_context"}, {"score": 0.0029282926103224717, "phrase": "retrieval_performance"}, {"score": 0.0028316582436089064, "phrase": "user's_web_information"}, {"score": 0.002707741309851526, "phrase": "participatory_context"}, {"score": 0.0025178072071268534, "phrase": "implicit-topical_context"}, {"score": 0.002341164727388944, "phrase": "targeting_user"}, {"score": 0.002263861731320045, "phrase": "experimental_results"}, {"score": 0.0021647386699037117, "phrase": "cpir"}, {"score": 0.002128694000627911, "phrase": "significant_improvements"}], "paper_keywords": [""], "paper_abstract": "People use a variety of social networking services to collect and organize web information for future reuse. When such contents are actually needed as reference to reply a post in an online conversation, however, the user may not be able to retrieve them with proper cues or may even forget their existence at all. In this paper, we study this problem in the online conversation context and investigate how to automatically retrieve the most context-relevant previously-seen web information without user intervention. We propose a Context-aware Personal Information Retrieval (CPIR) algorithm, which considers both the participatory and implicit-topical properties of the context to improve the retrieval performance. Since both the context and the user's web information are usually short and ambiguous, the participatory context is utilized to formulate and expand the query. Moreover, the implicit-topical context is exploited to implicitly determine the importance of each web information of the targeting user in the given context. The experimental results using real-world dataset demonstrate that CPIR can achieve significant improvements over several baselines.", "paper_title": "Context-Aware Personal Information Retrieval From Multiple Social Networks", "paper_id": "WOS:000334922500004"}