{"auto_keywords": [{"score": 0.03555054577107995, "phrase": "asynchronous_spectrum"}, {"score": 0.015719716506582538, "phrase": "cognitive_radio_networks"}, {"score": 0.004635477242873163, "phrase": "cognitive_radio_technology"}, {"score": 0.004548253531664032, "phrase": "spectrum_utilization_efficiency"}, {"score": 0.004399525320473839, "phrase": "licensed_spectrum"}, {"score": 0.004316722156877335, "phrase": "excessive_interference"}, {"score": 0.004136044939878838, "phrase": "existing_research"}, {"score": 0.0036727235025069828, "phrase": "unknown_behaviors"}, {"score": 0.0035864603175592854, "phrase": "synchronous_assumption"}, {"score": 0.00332375606483146, "phrase": "asynchronous_spectrum_access"}, {"score": 0.0031693980719538287, "phrase": "primary_channels"}, {"score": 0.002923214590192792, "phrase": "key_techniques"}, {"score": 0.002895535087931938, "phrase": "corresponding_solutions"}, {"score": 0.0026077803487003, "phrase": "non-cooperative_and_cooperative_scenarios"}, {"score": 0.002522344964242888, "phrase": "distributed_asynchronous_spectrum_access_algorithm"}, {"score": 0.0024281181691350085, "phrase": "proposed_schemes"}, {"score": 0.002382329940096419, "phrase": "existing_works"}, {"score": 0.0021049977753042253, "phrase": "access_schemes"}], "paper_keywords": [""], "paper_abstract": "Cognitive radio technology can significantly improve spectrum utilization efficiency by enabling SUs to access the licensed spectrum dynamically without causing excessive interference to PUs. Currently, most of the existing research on cognitive radio networks has been conducted based on an assumption that SUs can perfectly synchronize with PUs. However, when SUs are working with unknown behaviors of PUs, the synchronous assumption becomes invalid. To tackle this issue, we introduce several approaches for asynchronous spectrum sensing and asynchronous spectrum access, respectively, with which SUs can access the primary channels dynamically even without achieving synchronization with the PUs. In this article, we discuss the key techniques, corresponding solutions, and potential application scenarios of the asynchronous spectrum sensing and access schemes. Specifically, we present two asynchronous spectrum sensing schemes under non-cooperative and cooperative scenarios, respectively. Meanwhile, a distributed asynchronous spectrum access algorithm is also illustrated. Moreover, the proposed schemes are compared with existing works under the same framework, which enables readers to understand the motivation, problem formulation, methodology, and results of the asynchronous spectrum sensing and spectrum access schemes.", "paper_title": "Cognitive Radio Networks with Asynchronous Spectrum Sensing and Access", "paper_id": "WOS:000355756800014"}