{"auto_keywords": [{"score": 0.03172587391971231, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "haplotype_classification."}, {"score": 0.004773692073488661, "phrase": "genomic_data"}, {"score": 0.004692227830462433, "phrase": "gene_variations"}, {"score": 0.004592340708764929, "phrase": "hereditary_diseases"}, {"score": 0.004494570360108983, "phrase": "great_challenges"}, {"score": 0.004456044928556639, "phrase": "modern_bioinformatics"}, {"score": 0.0038326698261576023, "phrase": "simple_combinatorial_model"}, {"score": 0.0034118234596993836, "phrase": "uniform_clauses"}, {"score": 0.003310447652300423, "phrase": "satisfying_assignment"}, {"score": 0.003267925215811654, "phrase": "satisfiable_formula"}, {"score": 0.0031845067058084613, "phrase": "minimum_number"}, {"score": 0.0026004229197334875, "phrase": "first_non-trivial_exact_algorithm"}, {"score": 0.002566997205079849, "phrase": "uniform_minimum-ones"}, {"score": 0.0025122373359090433, "phrase": "running_time"}], "paper_keywords": ["Exact algorithms", " fixed-parameter algorithms", " minimum-ones 2SAT", " haplotypes"], "paper_abstract": "Analyzing genomic data for finding those gene variations which are responsible for hereditary diseases is one of the great challenges in modern bioinformatics. In many living beings (including the human), every gene is present in two copies, inherited from the two parents, the so-called haplotypes. In this paper, we propose a simple combinatorial model for classifying the set of haplotypes in a population according to their responsibility for a certain genetic disease. This model is based on the minimum-ones 2SAT problem with uniform clauses. The minimum-ones 2SAT problem asks for a satisfying assignment to a satisfiable formula in 2CNF which sets a minimum number of variables to true. This problem is well-known to be NP-hard, even in the case where all clauses are uniform, i.e., do not contain a positive and a negative literal. We analyze the approximability and present the first non-trivial exact algorithm for the uniform minimum-ones 2SAT problem with a running time of O(1.21061(n)) on a 2SAT formula with n variables. We also show that the problem is fixed-parameter tractable by showing that our algorithm can be adapted to verify in O*(2(k)) time whether an assignment with at most k true variables exists.", "paper_title": "THE UNIFORM MINIMUM-ONES 2SAT PROBLEM AND ITS APPLICATION TO HAPLOTYPE CLASSIFICATION", "paper_id": "WOS:000283579400005"}