{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computer-based_assessment"}, {"score": 0.015361973151232501, "phrase": "information_literacy"}, {"score": 0.003770633265791941, "phrase": "incorrectly_answered_questions"}, {"score": 0.003662410853488772, "phrase": "approximately_fifty_percent"}, {"score": 0.0034753508746887957, "phrase": "incorrect_answers"}, {"score": 0.003415137969569376, "phrase": "approximately_another_twenty-five_percent"}, {"score": 0.0030042210975126616, "phrase": "task_difficulty"}, {"score": 0.0029694040368299624, "phrase": "test_length"}, {"score": 0.0027687904688616983, "phrase": "average_attention"}, {"score": 0.0023792975669318615, "phrase": "number_increases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-based assessment for learning", " Elaborated feedback", " Information literacy"], "paper_abstract": "Three studies are presented on attention paid to feedback provided by a computer-based assessment for learning on information literacy. Results show that the attention paid to feedback varies greatly. In general the attention focuses on feedback of incorrectly answered questions. In each study approximately fifty percent of the respondents paid attention to feedback of incorrect answers only. Approximately another twenty-five percent did not pay attention to feedback at all. Results suggest that differences in attention paid to feedback are influenced by task difficulty and test length. Supervision, however, does not seem to influence the average attention paid to feedback. On the other hand, results show that indirect and direct supervision lead to a greater impact of feedback provided by a computer-based assessment for learning as the number increases of students taking the test and, as a consequence, paying attention to feedback. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Attention paid to feedback provided by a computer-based assessment for learning on information literacy", "paper_id": "WOS:000286682700037"}