{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "microarray_data"}, {"score": 0.00475924837336259, "phrase": "grey_relation_analysis"}, {"score": 0.004704187604192605, "phrase": "gene_selection"}, {"score": 0.004622783000449884, "phrase": "common_task"}, {"score": 0.004569293780076254, "phrase": "microarray_data_classification"}, {"score": 0.004067152645111547, "phrase": "discriminative_score"}, {"score": 0.0036838048761094933, "phrase": "top_ranked_ones"}, {"score": 0.0031476068430779367, "phrase": "abundant_data"}, {"score": 0.0029694040368299624, "phrase": "discrete_data_value"}, {"score": 0.002817639725689939, "phrase": "gene_ranking_method"}, {"score": 0.0027687904688616983, "phrase": "grey_relational_analysis"}, {"score": 0.0026892447164623247, "phrase": "grey_system_theory"}, {"score": 0.002536926192232391, "phrase": "data_distribution"}, {"score": 0.0024496978447849835, "phrase": "numerical_data_value"}, {"score": 0.002310915790114425, "phrase": "symmetrical_uncertainty"}], "paper_keywords": ["gene selection", " gene ranking", " grey relational analysis"], "paper_abstract": "Gene selection is a common task in microarray data classification. The most commonly used gene selection approaches are based on gene ranking, in which each gene is evaluated individually and assigned a discriminative score reflecting its correlation with the class according to certain criteria, genes are then ranked by their scores and top ranked ones are selected. Various discriminative scores have been proposed, including t-test, S2N,RelifF, Symmetrical Uncertainty and X-2-statistic. Among these methods, some require abundant data and require the data follow certain distribution, some require discrete data value. In this work, we propose a gene ranking method based on Grey Relational Analysis (GRA) in grey system theory, which requires less data, does not rely on data distribution and is more applicable to numerical data value. We experimentally compare our GRA method with several traditional methods, including Symmetrical Uncertainty, x(2)-statistic and ReliefF. The results show that the performance of our method is comparable with other methods, especially it is much faster than other methods.", "paper_title": "Gene selection for classifying microarray data using grey relation analysis", "paper_id": "WOS:000241631200046"}