{"auto_keywords": [{"score": 0.04916104605092019, "phrase": "cognitive_radio_networks"}, {"score": 0.008808935027807531, "phrase": "sensing_accuracy"}, {"score": 0.00481495049065317, "phrase": "secondary_users"}, {"score": 0.004662036750452837, "phrase": "balancing_sensing_accuracy"}, {"score": 0.004602233424629559, "phrase": "efficiency._cooperative_spectrum"}, {"score": 0.004484908028307205, "phrase": "promising_technique"}, {"score": 0.004342430078306461, "phrase": "multi-user_diversity"}, {"score": 0.0041773934798743405, "phrase": "cooperative_sensing"}, {"score": 0.003916098498242888, "phrase": "sensing_efficiency"}, {"score": 0.003531474887552889, "phrase": "overall_system_performance"}, {"score": 0.003310447652300423, "phrase": "fundamental_trade-off"}, {"score": 0.002726740692380339, "phrase": "proposed_cooperation_mechanisms"}, {"score": 0.002380381895973937, "phrase": "new_performance_metric_achievable_throughput"}, {"score": 0.0022897425998475362, "phrase": "transmission_gain"}, {"score": 0.0022168460543913787, "phrase": "illustrative_results"}, {"score": 0.0021742244283295986, "phrase": "parallel_and_asynchronous_cooperation_strategies"}], "paper_keywords": [""], "paper_abstract": "Cooperative spectrum sensing is a promising technique in cognitive radio networks by exploiting multi-user diversity to mitigate channel fading. Cooperative sensing is traditionally employed to improve the sensing accuracy while the sensing efficiency has been largely ignored. However, both sensing accuracy and efficiency have very significant impacts on the overall system performance. In this article, we first identify the fundamental trade-off between sensing accuracy and efficiency in spectrum sensing in cognitive radio networks. Then, we present several different cooperation mechanisms, including sequential, full-parallel, semi-parallel, synchronous, and asynchronous cooperative sensing schemes. The proposed cooperation mechanisms and the sensing accuracy-efficiency trade-off in these schemes are elaborated and analyzed with respect to a new performance metric achievable throughput, which simultaneously considers both transmission gain and sensing overhead. Illustrative results indicate that parallel and asynchronous cooperation strategies are able to achieve much higher performance, compared to existing and traditional cooperative spectrum sensing in cognitive radio networks.", "paper_title": "SECONDARY USERS COOPERATION IN COGNITIVE RADIO NETWORKS: BALANCING SENSING ACCURACY AND EFFICIENCY", "paper_id": "WOS:000303393200006"}