{"auto_keywords": [{"score": 0.04662320145990742, "phrase": "industrial_applications"}, {"score": 0.00481495049065317, "phrase": "comprehensive_analysis"}, {"score": 0.004761253507368234, "phrase": "mac_unreliability_problem"}, {"score": 0.004690583510896564, "phrase": "wireless_sensor_networks"}, {"score": 0.004501578643090429, "phrase": "wireless_technologies"}, {"score": 0.00436890075128947, "phrase": "credible_deployment"}, {"score": 0.004287961675700099, "phrase": "industrial_environment"}, {"score": 0.00387622209375571, "phrase": "ieee"}, {"score": 0.0037336520904376687, "phrase": "serious_unreliability_problem"}, {"score": 0.003637112258469488, "phrase": "power_management_mechanism"}, {"score": 0.003583067515485422, "phrase": "energy_efficiency"}, {"score": 0.003412887952564431, "phrase": "sensor_nodes"}, {"score": 0.0030049342542235466, "phrase": "fundamental_reasons"}, {"score": 0.002567498166608835, "phrase": "delivery_ratio"}, {"score": 0.002373214852820709, "phrase": "communication_reliability"}, {"score": 0.0023031224517224757, "phrase": "increased_latency"}, {"score": 0.002218404456227325, "phrase": "stringent_timing_requirements"}, {"score": 0.0021049977753042253, "phrase": "mac_parameter_values"}], "paper_keywords": ["Energy efficiency", " IEEE 802.15.4", " medium access control (MAC) protocol", " reliability", " scalability", " timeliness", " wireless sensor networks (WSNs)"], "paper_abstract": "Wireless Sensor Networks (WSNs) represent a very promising solution in the field of wireless technologies for industrial applications. However, for a credible deployment of WSNs in an industrial environment, four main properties need to be fulfilled, i.e., energy efficiency, scalability, reliability, and timeliness. In this paper, we focus on IEEE 802.15.4 WSNs and show that they can suffer from a serious unreliability problem. This problem arises whenever the power management mechanism is enabled for energy efficiency, and results in a very low packet delivery ratio, also when the number of sensor nodes in the network is very low (e.g., 5). We carried out an extensive analysis-based on both simulation and experiments on a real WSN-to investigate the fundamental reasons of this problem, and we found that it is caused by the contention-based Medium Access Control (MAC) protocol used for channel access and its default parameter values. We also found that, with a more appropriate MAC parameters setting, it is possible to mitigate the problem and achieve a delivery ratio up to 100%, at least in the scenarios considered in this paper. However, this improvement in communication reliability is achieved at the cost of an increased latency, which may not be acceptable for industrial applications with stringent timing requirements. In addition, in some cases this is possible only by choosing MAC parameter values formally not allowed by the standard.", "paper_title": "A Comprehensive Analysis of the MAC Unreliability Problem in IEEE 802.15.4 Wireless Sensor Networks", "paper_id": "WOS:000287087000005"}