{"auto_keywords": [{"score": 0.03893024483318683, "phrase": "nlp_techniques"}, {"score": 0.03861347711340031, "phrase": "equivalent_requirements"}, {"score": 0.00481495049065317, "phrase": "industrial_case_study"}, {"score": 0.004787874367741664, "phrase": "retrieving_equivalent_requirements"}, {"score": 0.0047609497747816525, "phrase": "natural_language_processing_techniques"}, {"score": 0.004681076799813777, "phrase": "software_engineering"}, {"score": 0.004525310204193961, "phrase": "different_types"}, {"score": 0.004193445699579727, "phrase": "natural_language_processing"}, {"score": 0.004123054121415497, "phrase": "candidate_links"}, {"score": 0.003907818467897337, "phrase": "reliable_evaluation_procedures"}, {"score": 0.0037670374369480363, "phrase": "seven_principles"}, {"score": 0.0031531835148998783, "phrase": "good_performance"}, {"score": 0.0030914555414246407, "phrase": "random_factor"}, {"score": 0.0029968794886425227, "phrase": "observed_performance"}, {"score": 0.002872544201947737, "phrase": "case_study"}, {"score": 0.002816294613779422, "phrase": "large_number"}, {"score": 0.0027301134307516103, "phrase": "italian_company"}, {"score": 0.0027070693607577, "phrase": "defense_and_aerospace_domain"}, {"score": 0.002684219275326868, "phrase": "current_application_context"}, {"score": 0.002572822239596127, "phrase": "proposed_principles"}, {"score": 0.0025295654969659724, "phrase": "estimation_technique"}, {"score": 0.0024940728986998463, "phrase": "binary_decision"}, {"score": 0.0023108344552493394, "phrase": "nlp"}, {"score": 0.0021049977753042253, "phrase": "estimation_method"}], "paper_keywords": ["Empirical software engineering", " traceability recovery", " natural language processing", " equivalent requirements", " metrics and measurement"], "paper_abstract": "Though very important in software engineering, linking artifacts of the same type (clone detection) or different types (traceability recovery) is extremely tedious, error-prone, and effort-intensive. Past research focused on supporting analysts with techniques based on Natural Language Processing (NLP) to identify candidate links. Because many NLP techniques exist and their performance varies according to context, it is crucial to define and use reliable evaluation procedures. The aim of this paper is to propose a set of seven principles for evaluating the performance of NLP techniques in identifying equivalent requirements. In this paper, we conjecture, and verify, that NLP techniques perform on a given dataset according to both ability and the odds of identifying equivalent requirements correctly. For instance, when the odds of identifying equivalent requirements are very high, then it is reasonable to expect that NLP techniques will result in good performance. Our key idea is to measure this random factor of the specific dataset(s) in use and then adjust the observed performance accordingly. To support the application of the principles we report their practical application to a case study that evaluates the performance of a large number of NLP techniques for identifying equivalent requirements in the context of an Italian company in the defense and aerospace domain. The current application context is the evaluation of NLP techniques to identify equivalent requirements. However, most of the proposed principles seem applicable to evaluating any estimation technique aimed at supporting a binary decision (e. g., equivalent/nonequivalent), with the estimate in the range [0, 1] (e.g., the similarity provided by the NLP), when the dataset(s) is used as a benchmark (i.e., testbed), independently of the type of estimator (i.e., requirements text) and of the estimation method (e.g., NLP).", "paper_title": "Empirical Principles and an Industrial Case Study in Retrieving Equivalent Requirements via Natural Language Processing Techniques", "paper_id": "WOS:000312996800002"}