{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_computing_applications"}, {"score": 0.004718314112245913, "phrase": "nanoinformatics"}, {"score": 0.004507882471601552, "phrase": "computing_applications"}, {"score": 0.0044398358177815305, "phrase": "nano_level"}, {"score": 0.0038520615699124123, "phrase": "new_devices"}, {"score": 0.003717656912608012, "phrase": "breakthrough_perspectives"}, {"score": 0.003393115177189967, "phrase": "different_aspects"}, {"score": 0.003308085469148074, "phrase": "five_research_topics"}, {"score": 0.0032415934630668484, "phrase": "new_research"}, {"score": 0.0028990018343924683, "phrase": "biological_and_clinical_applications"}, {"score": 0.0027414948679658816, "phrase": "related_concept"}, {"score": 0.0027000395818027366, "phrase": "extended_\"nanotype"}, {"score": 0.002214734873559146, "phrase": "toxicity_information"}, {"score": 0.0021923400552366756, "phrase": "clinical_and_personal_databases"}, {"score": 0.002159170788765385, "phrase": "new_approaches"}, {"score": 0.0021373366163721518, "phrase": "scientific_ontologies"}], "paper_keywords": ["Nanoinformatics", " Computing", " Nanotechnology", " Bioinformatics", " Medical Informatics", " Nanomedicine"], "paper_abstract": "Nanoinformatics has recently emerged to address the need of computing applications at the nano level. In this regard, the authors have participated in various initiatives to identify its concepts, foundations and challenges. While nanomaterials open up the possibility for developing new devices in many industrial and scientific areas, they also offer breakthrough perspectives for the prevention, diagnosis and treatment of diseases. In this paper, we analyze the different aspects of nanoinformatics and suggest five research topics to help catalyze new research and development in the area, particularly focused on nanomedicine. We also encompass the use of informatics to further the biological and clinical applications of basic research in nanoscience and nanotechnology, and the related concept of an extended \"nanotype\" to coalesce information related to nanoparticles. We suggest how nanoinformatics could accelerate developments in nanomedicine, similarly to what happened with the Human Genome and other -omics projects, on issues like exchanging modeling and simulation methods and tools, linking toxicity information to clinical and personal databases or developing new approaches for scientific ontologies, among many others.", "paper_title": "Nanoinformatics: developing new computing applications for nanomedicine", "paper_id": "WOS:000305030800003"}