{"auto_keywords": [{"score": 0.04191337609468309, "phrase": "fuzzy_ellipsoid_numbers"}, {"score": 0.02322730111336099, "phrase": "imprecise_or_uncertain_multi-channel_digital_information"}, {"score": 0.0072643611706630995, "phrase": "paraboloid_fuzzy_ellipsoid_numbers"}, {"score": 0.005979876220451743, "phrase": "special_fuzzy_ellipsoid_numbers"}, {"score": 0.00411182818527434, "phrase": "specific_real_functions"}, {"score": 0.0029152570900178956, "phrase": "special_types"}, {"score": 0.0021049977753042253, "phrase": "uncertain_or_imprecise_multichannel_digital_information"}], "paper_keywords": ["Fuzzy numbers", " fuzzy cell numbers", " fuzzy ellipsoid numbers", " expression of uncertain multichannel information"], "paper_abstract": "In this paper, in order to more rationally represent some imprecise or uncertain multi-channel digital information, the structure of fuzzy ellipsoid numbers is further investigated. Firstly, some results about using couples of specific real functions to represent fuzzy ellipsoid numbers are obtained. Such represented fuzzy ellipsoid numbers can be easy constructed, and can be more rationally (compared with cone fuzzy ellipsoid numbers or paraboloid fuzzy ellipsoid numbers) used to represent some imprecise or uncertain multi-channel digital information. Then, some definitions of special types of fuzzy ellipsoid numbers are presented, and these special fuzzy ellipsoid numbers are all shown to be extension and promotion of cone fuzzy ellipsoid numbers or paraboloid fuzzy ellipsoid numbers. And then, a method of constructing thus special fuzzy ellipsoid numbers is established from a group of uncertain or imprecise multichannel digital information. At last, some examples and remarks are given to demonstrate the rationality and the advantage of using these special fuzzy ellipsoid numbers defined to represent some imprecise or uncertain multi-channel digital information.", "paper_title": "Special fuzzy ellipsoid numbers and expressions of information", "paper_id": "WOS:000362627000015"}