{"auto_keywords": [{"score": 0.04970996416312493, "phrase": "artificial_neural_networks"}, {"score": 0.04663824550177328, "phrase": "ne"}, {"score": 0.042794291724518645, "phrase": "biological_brains"}, {"score": 0.03856602836307746, "phrase": "evolved_anns"}, {"score": 0.026955367144570398, "phrase": "connectivity_patterns"}, {"score": 0.00481495049065317, "phrase": "topographic_regularities"}, {"score": 0.004403480614319231, "phrase": "evolutionary_algorithms"}, {"score": 0.0041642891310893, "phrase": "ne_algorithms"}, {"score": 0.004118026552723285, "phrase": "distinctive_characteristics"}, {"score": 0.0039380388343479384, "phrase": "main-stream_subject"}, {"score": 0.0036281710561308377, "phrase": "hypercube-based_neuroevolution"}, {"score": 0.003587842947046177, "phrase": "topologies_algorithm"}, {"score": 0.0030451958332949735, "phrase": "checkers-playing_anns"}, {"score": 0.0030113280682863234, "phrase": "letter_show"}, {"score": 0.0029889584492584073, "phrase": "topographic_maps"}, {"score": 0.0027535633837592597, "phrase": "important_advantage"}, {"score": 0.0026726283357752585, "phrase": "evolved_maps"}, {"score": 0.0025940660106162404, "phrase": "novel_insight"}, {"score": 0.002259642580775186, "phrase": "intriguing_possibility"}, {"score": 0.0021446391766277817, "phrase": "increasing_relevance"}, {"score": 0.0021049977753042253, "phrase": "neural_computation"}], "paper_keywords": [""], "paper_abstract": "Looking to nature as inspiration, for at least the past 25 years, researchers in the field of neuroevolution (NE) have developed evolutionary algorithms designed specifically to evolve artificial neural networks (ANNs). Yet the ANNs evolved through NE algorithms lack the distinctive characteristics of biological brains, perhaps explaining why NE is not yet a main-stream subject of neural computation. Motivated by this gap, this letter shows that when geometry is introduced to evolved ANNs through the hypercube-based neuroevolution of augmenting topologies algorithm, they begin to acquire characteristics that indeed are reminiscent of biological brains. That is, if the neurons in evolved ANNs are situated at locations in space (i.e., if they are given coordinates), then, as experiments in evolving checkers-playing ANNs in this letter show, topographic maps with symmetries and regularities can evolve spontaneously. The ability to evolve such maps is shown in this letter to provide an important advantage in generalization. In fact, the evolved maps are sufficiently informative that their analysis yields the novel insight that the geometry of the connectivity patterns of more general players is significantly smoother and more contiguous than less general ones. Thus, the results reveal a correlation between generality and smoothness in connectivity patterns. They also hint at the intriguing possibility that as NE matures as a field, its algorithms can evolve ANNs of increasing relevance to those who study neural computation in general.", "paper_title": "Autonomous Evolution of Topographic Regularities in Artificial Neural Networks", "paper_id": "WOS:000278530200009"}