{"auto_keywords": [{"score": 0.049110045082843494, "phrase": "sustainability_information"}, {"score": 0.048727646052725185, "phrase": "local_governments"}, {"score": 0.00481495049065317, "phrase": "media_pressure"}, {"score": 0.004258843584164121, "phrase": "account_factors"}, {"score": 0.004206879557938045, "phrase": "political_ideology"}, {"score": 0.003908091457759849, "phrase": "econometric_model"}, {"score": 0.003828912548622257, "phrase": "dependency_techniques"}, {"score": 0.003797690272118125, "phrase": "cross-sectional_data"}, {"score": 0.003751331782523201, "phrase": "tobit_technique"}, {"score": 0.0035861227263414537, "phrase": "particular_considerations"}, {"score": 0.003556873173040169, "phrase": "extreme_scores"}, {"score": 0.003513443975425428, "phrase": "dependent_variable"}, {"score": 0.0029824560656987855, "phrase": "left-wing_parties"}, {"score": 0.0027141975147496264, "phrase": "information_index"}, {"score": 0.0026810296502682916, "phrase": "local_governments'_disclosure"}, {"score": 0.002500571634075998, "phrase": "left-wing_party"}, {"score": 0.0023610946923597405, "phrase": "municipal_corporation"}, {"score": 0.0023418133729330303, "phrase": "strategic_and_social_issues"}, {"score": 0.002131054594847684, "phrase": "moderating_effect"}, {"score": 0.0021049977753042253, "phrase": "ruling_party's_political_ideology"}], "paper_keywords": ["Corporate social responsibility", " Local government", " Information disclosure", " Political ideology"], "paper_abstract": "Purpose - The aim of this study is to analyse the level of environmental, economic, and social engagement disclosed by local governments, taking into account factors such as political ideology and media pressure. Design/methodology/approach - The authors analysed 102 large Spanish municipalities, using data from 2011. An econometric model was used based on dependency techniques for cross-sectional data. The Tobit technique is suitable, since it enables the authors to address particular considerations of extreme scores on the dependent variable. Findings - The results show that local governments report less strategic and socio-economic information when subjected to strong media pressure, because the press tends to focus on unusual, negative news, and ignores other issues such as the environment However, in municipalities governed by left-wing parties, media pressure actually promotes disclosure of this type of information. Research limitations/implications - It would be interesting to create an information index which includes local governments' disclosure, spanning a period of several years. Practical implications - Particularly in municipalities governed by a left-wing party, media pressure favours the disclosure of sustainability information, including information about the municipal corporation and strategic and social issues. Originality/value - This study analyses the impact of the press on the disclosure of sustainability information by local governments and also tests the moderating effect of the ruling party's political ideology. The authors did not find any paper that had analysed this impact before.", "paper_title": "The role of media pressure on the disclosure of sustainability information by local governments", "paper_id": "WOS:000330822300008"}