{"auto_keywords": [{"score": 0.045451378248315355, "phrase": "distributed_systems"}, {"score": 0.01559900243146645, "phrase": "machine-to-machine_systems"}, {"score": 0.010722294884266253, "phrase": "mirollo"}, {"score": 0.007023378037141877, "phrase": "mathematical_models"}, {"score": 0.00481495049065317, "phrase": "synchronization_mechanisms"}, {"score": 0.004630910803911567, "phrase": "natural_phenomena"}, {"score": 0.004577076689777069, "phrase": "computer_science_natural_phenomena"}, {"score": 0.004217286731331736, "phrase": "data_processing"}, {"score": 0.003977672712305348, "phrase": "computer_science"}, {"score": 0.0038554737609608255, "phrase": "role_models"}, {"score": 0.0036648265911110164, "phrase": "firefly_synchronization"}, {"score": 0.0034162643819889054, "phrase": "neuron_networks"}, {"score": 0.00337650257503995, "phrase": "circadian_pacemaker"}, {"score": 0.0032472646337850042, "phrase": "strogatz's_pulse"}, {"score": 0.003234615195382533, "phrase": "coupled_oscillator_model"}, {"score": 0.002865929543375884, "phrase": "mobile_and_faulty_oscillators"}, {"score": 0.002681859084438076, "phrase": "communication_delays"}, {"score": 0.002599365215003002, "phrase": "strogatz's_model"}, {"score": 0.002549096826249, "phrase": "real-world_environments"}, {"score": 0.0024418934977061876, "phrase": "related_work"}, {"score": 0.002154930852763048, "phrase": "large_differences"}], "paper_keywords": ["Biological inspiration", " Fireflies", " Pulse coupled oscillator model", " Real-world environments", " Self-organization"], "paper_abstract": "People have always tried to understand natural phenomena. In computer science natural phenomena are mostly used as a source of inspiration for solving various problems in distributed systems such as optimization, clustering, and data processing. In this paper we will give an overview of research in field of computer science where fireflies in nature are used as role models for time synchronization. We will compare two models of oscillators that explain firefly synchronization along with other phenomena of synchrony in nature (e.g., synchronization of pacemaker cells of the heart and synchronization of neuron networks of the circadian pacemaker). Afterwards, we will present Mirollo and Strogatz's pulse coupled oscillator model together with its limitations. As discussed by the authors of the model, this model lacks of explanation what happens when oscillators are nonidentical. It also does not support mobile and faulty oscillators. Finally, it does not take into consideration that in communication among oscillators there are communication delays. Since these limitations prevent Mirollo and Strogatz's model to be used in real-world environments (such as Machine-to-Machine systems), we will sum up related work in which scholars investigated how to modify the model in order for it to be applicable in distributed systems. However, one has to bear in mind that there are usually large differences between mathematical models in theory and their implementation in practice. Therefore, we give an overview of both mathematical models and mechanisms in distributed systems that were designed after them. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Survey on synchronization mechanisms in machine-to-machine systems", "paper_id": "WOS:000362130500028"}