{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "current_information_systems_security_challenges"}, {"score": 0.004608539830653038, "phrase": "information_systems_security"}, {"score": 0.004328856052035968, "phrase": "present-day_organizations"}, {"score": 0.0036097844103129043, "phrase": "unauthorized_access"}, {"score": 0.00347657813672945, "phrase": "secret_information_disclosure"}, {"score": 0.003306559295382181, "phrase": "widespread_and_growing_concern"}, {"score": 0.0028446460307503343, "phrase": "so-called_information_society"}, {"score": 0.0027395968397212053, "phrase": "wide_range"}, {"score": 0.0027054473441439422, "phrase": "software_systems"}, {"score": 0.0025892330566358503, "phrase": "air_traffic_control_systems"}, {"score": 0.002493592357827492, "phrase": "public_health_systems"}, {"score": 0.002447101794397243, "phrase": "potential_losses"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": [""], "paper_abstract": "Information Systems Security is one of the most pressing challenges confronting all kinds of present-day organizations. Although many companies have discovered how critical information is to the success of their business or operations, very few have managed to be effective in maintaining their information secure, avoiding unauthorized access, preventing intrusions, stopping secret information disclosure, etc. Security is currently a widespread and growing concern that affects all areas of society: business, domestic, financial, government, and so on. In fact, the so-called information society is increasingly dependent on a wide range of software systems whose mission is critical, such as air traffic control systems, financial systems, or public health systems. The potential losses that are confronted by businesses and organizations that rely on all these hardware and software systems have therefore led to a situation in which it is crucial for information systems to be properly secured from the outset.", "paper_title": "An Overview of Current Information Systems Security Challenges and Innovations J.UCS Special Issue", "paper_id": "WOS:000308796100001"}