{"auto_keywords": [{"score": 0.04562069191431079, "phrase": "joint_grant_proposals"}, {"score": 0.00481495049065317, "phrase": "collaborative_research"}, {"score": 0.004480307124735185, "phrase": "scholarly_publications"}, {"score": 0.004133627071344356, "phrase": "sole_measure"}, {"score": 0.004098725744818192, "phrase": "research_collaboration"}, {"score": 0.0038461532860146535, "phrase": "informal_communication"}, {"score": 0.003503497128638099, "phrase": "researchers'_networks"}, {"score": 0.0031643005824589917, "phrase": "data_collection"}, {"score": 0.002994449398035894, "phrase": "completed_collaborative_outputs"}, {"score": 0.002704403349815203, "phrase": "multiple_types"}, {"score": 0.0026815368507715, "phrase": "relationship_ties"}, {"score": 0.0025919830205975215, "phrase": "multiple_networks"}, {"score": 0.002570064617803693, "phrase": "exponential_random_graph_models"}, {"score": 0.0024114635128122783, "phrase": "collaborative_outputs"}, {"score": 0.0023013968622710847, "phrase": "mixed_gender_teams"}, {"score": 0.0021501863832966966, "phrase": "demographic_attributes"}, {"score": 0.0021229583685841405, "phrase": "additional_explanatory_power"}, {"score": 0.0021049977753042253, "phrase": "joint_patents"}], "paper_keywords": ["Collaborative networks", " Social network analysis", " Self reported data", " Exponential random graph models (ERGMs)"], "paper_abstract": "A frequently used measure of scientific (or research) collaboration is co-authorship in scholarly publications. Less frequently used are joint grant proposals and patents. Many scholars believe that the use of co-authorship as the sole measure of research collaboration is insufficient because collaboration between researchers might not result in co-authorship. Collaborations involve informal communication (i.e., conversational exchange) between researchers. Using self-reports from 100 tenured/tenure-track faculty in the College of Engineering at the University of South Florida, researchers' networks are constructed from their communication relationships and also from collaborations in three areas: joint publications, joint grant proposals, and joint patents. The data collection: (1) covers both researchers' in-progress and completed collaborative outputs, (2) yields a rating from the researchers on the importance of a relationship to them and (3) obtains multiple types of relationship ties between researchers allowing for the comparison of multiple networks. Exponential random graph models (ERGMs) results show that the more communication researchers have the more likely they produce collaborative outputs. Furthermore, we find that joint grant proposals tend to have mixed gender teams and that researchers of the same race are more likely to publish together, but those demographic attributes have no additional explanatory power regarding joint patents. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An evaluation of collaborative research in a college of engineering", "paper_id": "WOS:000360907400015"}