{"auto_keywords": [{"score": 0.043224465844417304, "phrase": "structurally_different_behaviors"}, {"score": 0.00481495049065317, "phrase": "behavioral_space_for_evolutionary_robotics"}, {"score": 0.0047732596509542135, "phrase": "evolutionary_robotics"}, {"score": 0.004745665541429529, "phrase": "population-based_evolutionary_computation"}, {"score": 0.004677372885331908, "phrase": "robot_neurocontrollers"}, {"score": 0.004530552828603269, "phrase": "user-defined_task"}, {"score": 0.0044653418703126365, "phrase": "standard_approach"}, {"score": 0.004413846562278824, "phrase": "canonical_evolutionary_algorithms"}, {"score": 0.004300133642951283, "phrase": "evolving_population"}, {"score": 0.004250535418141079, "phrase": "single_behavioral_solution"}, {"score": 0.004189337956225294, "phrase": "high-level_task"}, {"score": 0.003987755561492638, "phrase": "behavioral_diversity"}, {"score": 0.0038849770915807603, "phrase": "diverse_set"}, {"score": 0.0034692468245671243, "phrase": "particular_behavioral_structure"}, {"score": 0.003409348393161723, "phrase": "species_share"}, {"score": 0.003170667618004276, "phrase": "traversed_path"}, {"score": 0.003097865379563127, "phrase": "behavior_signatures"}, {"score": 0.003062091606343783, "phrase": "character_strings"}, {"score": 0.002974448752618528, "phrase": "string_similarity_measure"}, {"score": 0.002906138793910919, "phrase": "proposed_behavior-based_speciation"}, {"score": 0.0028725726762797374, "phrase": "canonical_evolution"}, {"score": 0.0028065957753430713, "phrase": "network_topology"}, {"score": 0.0027903390304306335, "phrase": "experimental_tests"}, {"score": 0.0026481898553135973, "phrase": "khepera"}, {"score": 0.0026329121040608093, "phrase": "pioneer"}, {"score": 0.0022439896633013297, "phrase": "speciation_method"}, {"score": 0.0021987994275190314, "phrase": "evolutionary_algorithm"}], "paper_keywords": ["Evolutionary robotics", " Speciation", " Behavioral space"], "paper_abstract": "In Evolutionary Robotics, population-based evolutionary computation is used to design robot neurocontrollers that produce behaviors which allow the robot to fulfill a user-defined task. However, the standard approach is to use canonical evolutionary algorithms, where the search tends to make the evolving population converge towards a single behavioral solution, even if the high-level task could be accomplished by structurally different behaviors. In this work, we present an approach that preserves behavioral diversity within the population in order to produce a diverse set of structurally different behaviors that the robot can use. In order to achieve this, we employ the concept of speciation, where the population is dynamically subdivided into sub-groups, or species, each one characterized by a particular behavioral structure that all individuals within that species share. Speciation is achieved by describing each neurocontroller using a representations that we call a behavior signature, these are descriptors that characterize the traversed path of the robot within the environment. Behavior signatures are coded using character strings, this allows us to compare them using a string similarity measure, and three measures are tested. The proposed behavior-based speciation is compared with canonical evolution and a method that speciates based on network topology. Experimental tests were carried out using two robot tasks (navigation and homing behavior), several training environments, and two different robots (Khepera and Pioneer), both real and simulated. Results indicate that behavior-based speciation increases the diversity of the behaviors based on their structure, without sacrificing performance. Moreover, the evolved controllers exhibit good robustness when the robot is placed within environments that were not used during training. In conclusion, the speciation method presented in this work allows an evolutionary algorithm to produce several robot behaviors that are structurally different but all are able to solve the same robot task.", "paper_title": "Speciation in Behavioral Space for Evolutionary Robotics", "paper_id": "WOS:000297365600003"}