{"auto_keywords": [{"score": 0.04187390781058265, "phrase": "online_cme_program"}, {"score": 0.009446844308176756, "phrase": "patient_outcomes"}, {"score": 0.008640669843316549, "phrase": "vitamin_d"}, {"score": 0.00481495049065317, "phrase": "general_practitioners'_knowledge"}, {"score": 0.004684935123146457, "phrase": "\"abc's_of_vitamin_d\"_program"}, {"score": 0.004581264535769701, "phrase": "cme"}, {"score": 0.004315487055548749, "phrase": "physician_practices"}, {"score": 0.004188459638572375, "phrase": "online_cme"}, {"score": 0.0039651694106206245, "phrase": "general_practitioners"}, {"score": 0.0038966399268244556, "phrase": "sun_health"}, {"score": 0.0038772776660971845, "phrase": "\"the_abc"}, {"score": 0.003781894548959589, "phrase": "design_principles"}, {"score": 0.0037631002998184076, "phrase": "physician-education_web_sites"}, {"score": 0.003661382948704217, "phrase": "program's_usability"}, {"score": 0.003643185395780667, "phrase": "acceptability_pilot_test_results"}, {"score": 0.003598138476240257, "phrase": "abc"}, {"score": 0.0035712919163869176, "phrase": "vitamin_d_program"}, {"score": 0.0035358770665604657, "phrase": "nine_principles"}, {"score": 0.003281186608301359, "phrase": "web_site_host"}, {"score": 0.0028822890425197582, "phrase": "eight_modules"}, {"score": 0.0026480044868438875, "phrase": "reasonable_amount"}, {"score": 0.0024879447331744883, "phrase": "accredited_cme_activity"}, {"score": 0.0023609780669713288, "phrase": "advice_patients"}, {"score": 0.0022970729721700604, "phrase": "theory_and_evidence_based_approach"}, {"score": 0.00215280156630672, "phrase": "gp_practices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Education medical continuing", " Online", " General practitioners", " Vitamin D deficiency"], "paper_abstract": "Background: Online continuing medical education (CME) offers a number of advantages for physicians including flexibility with regards to location and timing of use. In order to effect physician practices and improve patient outcomes, it is important that the development of online CME is theory and evidence-based. Objectives: This paper aims to describe the development of an online CME program for practising general practitioners (GPs) on vitamin D and sun health called \"The ABC's of Vitamin D for GPs\" using elements of design principles for physician-education web sites as a framework. The paper will also report the program's usability and acceptability pilot test results. Methods: The ABC's of Vitamin D program was developed following nine principles: needs assessment; evidence-based content development; multimodal program and modularisation; clinical cases; tailoring and interactivity; audit and feedback; credibility of the web site host; patient education materials; ease of use and navigation. Among the 20 GPs invited, acceptability and useability was tested with 12 GPs (60%) who agreed to participate and were interviewed following use of the program. The study was conducted between 2011 and 2013. Results: An online CME program consisting of eight modules was constructed. Of the 12 participating GPs, most (n = 11) reported that the program was clear and easy to understand, logical, easy to navigate, and took a reasonable amount of time (estimated between 1 and 3 h) to complete. Eleven of 12 participants said they would use the program as an accredited CME activity and all participants indicated that the program was 'very or somewhat' likely to lead to changes in the advice patients are given. Conclusion: This study found that a theory and evidence based approach for the development of an online CME program for GPs was acceptable to users. Further research is needed to examine whether the online CME program is effective at changing GP practices and improving patient outcomes. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "An internet based approach to improve general practitioners' knowledge and practices: The development and pilot testing of the \"ABC's of vitamin D\" program", "paper_id": "WOS:000352805000004"}