{"auto_keywords": [{"score": 0.04513432449227983, "phrase": "cics"}, {"score": 0.04183426270120353, "phrase": "biomedical_literature"}, {"score": 0.0048149719445490895, "phrase": "randomized"}, {"score": 0.0047363569540686936, "phrase": "clinical_informatics_consult_service"}, {"score": 0.004674402456361649, "phrase": "evidence-based_decision-making"}, {"score": 0.004478567563654688, "phrase": "synthesized_research_evidence"}, {"score": 0.004434547543497673, "phrase": "patient_care_practices"}, {"score": 0.004376523540676604, "phrase": "based_informatics_program"}, {"score": 0.004030618026002216, "phrase": "synthesized_information"}, {"score": 0.003951736710391294, "phrase": "consult_question"}, {"score": 0.0037119497772861165, "phrase": "online_post-consult_forms"}, {"score": 0.003158367829177805, "phrase": "service_results"}, {"score": 0.0029373757799982356, "phrase": "cics_provided_condition"}, {"score": 0.002908459938852865, "phrase": "greater_actual_and_potential_impact"}, {"score": 0.0028608962312791264, "phrase": "clinician_satisfaction"}, {"score": 0.002704906579783511, "phrase": "new_or_different_treatment"}, {"score": 0.0026696282447479084, "phrase": "ci"}, {"score": 0.0023471747824793015, "phrase": "treatment_issues"}, {"score": 0.0022118223311537954, "phrase": "effective_tool"}, {"score": 0.0021684583061292264, "phrase": "research_evidence"}, {"score": 0.002132970380372137, "phrase": "complex_patient_care"}, {"score": 0.0021049977753042253, "phrase": "clinicians'_engagement"}], "paper_keywords": [""], "paper_abstract": "Objective: To determine the effectiveness of providing synthesized research evidence to inform patient care practices via an evidence based informatics program, the Clinical Informatics Consult Service (CICS). Design: Consults were randomly assigned to one of two conditions: CICS Provided, in which clinicians received synthesized information from the biomedical literature addressing the consult question or No CICS Provided, in which no information was provided. Measurement: Outcomes were measured via online post-consult forms that assessed consult purpose, actual and potential impact, satisfaction, time spent searching, and other variables. Results: Two hundred twenty six consults were made during the 19-month study period. Clinicians primarily made requests in order to update themselves (65.0%, 147/226) and were satisfied with the service results (Mean 4.52 of possible 5.0, SD 0.94). Intention to treat (ITT) analyses showed that consults in the CICS Provided condition had a greater actual and potential impact on clinical actions and clinician satisfaction than No CICS consults. Evidence provided by the service primarily impacted the use of a new or different treatment (OR 8.19 95% CI 1.04-64.00). Reasons for no or little impact included a lack of evidence addressing the issue or that the clinician was already implementing the practices indicated by the evidence. Conclusions: Clinical decision-making, particularly regarding treatment issues, was statistically significantly impacted by the service. Programs such as the CICS may provide an effective tool for facilitating the integration of research evidence into the management of complex patient care and may foster clinicians' engagement with the biomedical literature.", "paper_title": "A Randomized effectiveness trial of a Clinical Informatics Consult Service: Impact on evidence-based decision-making and knowledge implementation", "paper_id": "WOS:000253957100011"}