{"auto_keywords": [{"score": 0.045051084910580984, "phrase": "percirs"}, {"score": 0.00481495049065317, "phrase": "personalized_and_collaborative_information_retrieval"}, {"score": 0.004582608049002167, "phrase": "personalization_techniques"}, {"score": 0.004464156619275582, "phrase": "collaborative_information_retrieval"}, {"score": 0.00443828610170899, "phrase": "cir"}, {"score": 0.0043487535506391275, "phrase": "new_personalized_cir_system"}, {"score": 0.004224008636767914, "phrase": "user_profile_similarity_calculation"}, {"score": 0.004199490556726464, "phrase": "upsc"}, {"score": 0.003938968581984988, "phrase": "proposed_cir_system"}, {"score": 0.0038259332670788748, "phrase": "cranfield"}, {"score": 0.003792657064634775, "phrase": "evaluation_techniques"}, {"score": 0.003662410853488772, "phrase": "new_user-centric_mechanism"}, {"score": 0.0033559647822437298, "phrase": "proposed_upsc_formulas"}, {"score": 0.0031476068430779367, "phrase": "nine_other_ir_systems"}, {"score": 0.002744683473733121, "phrase": "returned_documents"}, {"score": 0.002720785798036066, "phrase": "explicit_ranking"}, {"score": 0.0025816953009851072, "phrase": "ir_process"}, {"score": 0.0025002107252808966, "phrase": "-_the_value"}, {"score": 0.0024496978447849835, "phrase": "collaborative_and_personalized_ir"}, {"score": 0.0023723695202202276, "phrase": "personalized_ir_system"}, {"score": 0.002331221840164716, "phrase": "proposed_evaluation_mechanism"}, {"score": 0.0022841153001549193, "phrase": "personalized_ir_systems"}, {"score": 0.002237958497480754, "phrase": "significant_user_profile_similarity_calculation_formulas"}, {"score": 0.002123498271984762, "phrase": "user's_community"}, {"score": 0.0021049977753042253, "phrase": "social_networks"}], "paper_keywords": ["Information retrieval", " Social networks", " Customization", " Information systems"], "paper_abstract": "Purpose - This paper aims to discuss and test the claim that utilization of the personalization techniques can be valuable to improve the efficiency of collaborative information retrieval (CIR) systems. Design/methodology/approach - A new personalized CIR system, called PERCIRS, is presented based on the user profile similarity calculation (UPSC) formulas. To this aim, the paper proposes several UPSC formulas as well as two techniques to evaluate them. As the proposed CIR system is personalized, it could not be evaluated by Cranfield, like evaluation techniques (e.g. TREC). Hence, this paper proposes a new user-centric mechanism, which enables PERCIRS to be evaluated. This mechanism is generic and can be used to evaluate any other personalized IR system. Findings - The results show that among the proposed UPSC formulas in this paper, the (query-document)-graph based formula is the most effective. After integrating this formula into PERCIRS and comparing it with nine other IR systems, it is concluded that the results of the system are better than the other IR systems. In addition, the paper shows that the complexity of the system is less that the complexity of the other CIR systems. Research limitations/implications - This system asks the users to explicitly rank the returned documents, while explicit ranking is still not widespread enough. However it believes that the users should actively participate in the IR process in order to aptly satisfy their needs to information. Originality/value - The value of this paper lies in combining collaborative and personalized IR, as well as introducing a mechanism which enables the personalized IR system to be evaluated. The proposed evaluation mechanism is very valuable for developers of personalized IR systems. The paper also introduces some significant user profile similarity calculation formulas, and two techniques to evaluate them. These formulas can also be used to find the user's community in the social networks.", "paper_title": "PERCIRS: a system to combine personalized and collaborative information retrieval", "paper_id": "WOS:000282033200005"}