{"auto_keywords": [{"score": 0.04324575896473875, "phrase": "sfinx"}, {"score": 0.006434771561110305, "phrase": "patient_consultation"}, {"score": 0.00481495049065317, "phrase": "usage_patterns"}, {"score": 0.004713162564945179, "phrase": "drug-drug_interaction_database_sfinx._purpose"}, {"score": 0.004613516457919661, "phrase": "present_study"}, {"score": 0.004420472010542188, "phrase": "drug-drug_interaction_database_sfinx"}, {"score": 0.003902165732101058, "phrase": "registered_users"}, {"score": 0.0038606630003037864, "phrase": "web_application"}, {"score": 0.0038332390893263844, "phrase": "sfinx."}, {"score": 0.0038060092376105414, "phrase": "anonymous_answers"}, {"score": 0.003765525342866404, "phrase": "target_users"}, {"score": 0.0036596534390380287, "phrase": "descriptive_statistics"}, {"score": 0.003633652174971415, "phrase": "statistical_analysis"}, {"score": 0.0035822005511799036, "phrase": "age_and_gender_differences"}, {"score": 0.0035189057079817285, "phrase": "different_usage_patterns"}, {"score": 0.003371508176308189, "phrase": "response_rate"}, {"score": 0.0023681985426916366, "phrase": "direct_association"}, {"score": 0.002212892265364764, "phrase": "ddi_databases"}, {"score": 0.0021971473452127126, "phrase": "relevant_information"}, {"score": 0.002150580119047236, "phrase": "drug_treatment_outcome"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Drug interactions", " Decision support systems", " Clinical", " Questionnaires", " Medical order entry systems"], "paper_abstract": "Purpose: The aim of the present study was to investigate how prescribers and pharmacists use and perceive the drug-drug interaction database SFINX in their clinical work. Methods: A questionnaire was developed with questions aimed at the usage of SFINX, and the perceptions of the database. The questionnaire was sent out to all registered users of the web application of SFINX. The anonymous answers from the target users, prescribers and pharmacists were summarized using descriptive statistics. Statistical analysis was performed on age and gender differences for some questions regarding different usage patterns. Results: The questionnaire was sent to 11,763 registered SFINX users. The response rate was 23%, including 1871 answers from prescribers or pharmacists. SFINX was reported to be used at least weekly or more often by 45% of the prescribers and 51% of the pharmacists. Many prescribers reported using the database during the patient consultation (60%) or directly before or after (56%). Among the prescribers, 74% reported that the information received made them change their action at least sometimes. About 20% of the prescribers and 25% of the pharmacists considered the information as irrelevant sometimes or more often. Conclusion: Most prescribers and pharmacists reported using SFINX in direct association with a patient consultation. Information received by using SFINX makes prescribers and pharmacists change their handling of patients. DDI databases with relevant information about patient handling might improve drug treatment outcome. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Evaluation of usage patterns and user perception of the drug-drug interaction database SFINX", "paper_id": "WOS:000350968500004"}