{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "lp-sr"}, {"score": 0.004755054742217193, "phrase": "optimal_storage"}, {"score": 0.0047155367844327, "phrase": "retrieval_for_video-on-demand"}, {"score": 0.004447915226010682, "phrase": "local_servers"}, {"score": 0.004266067096140677, "phrase": "kappa_segments"}, {"score": 0.004040688646993605, "phrase": "critical_but_challenging_problem"}, {"score": 0.0039571974661570695, "phrase": "overall_system_deployment_cost"}, {"score": 0.00390792986752692, "phrase": "server_bandwidth"}, {"score": 0.0035648266669315943, "phrase": "movie_storage"}, {"score": 0.0034911335714333507, "phrase": "server_network"}, {"score": 0.003404703106153948, "phrase": "optimization_problem"}, {"score": 0.003321081928815714, "phrase": "np"}, {"score": 0.0031317126905234145, "phrase": "effective_and_implementable_heuristic_termed_lp-sr._lp-sr"}, {"score": 0.0029909851863915283, "phrase": "segment_storage"}, {"score": 0.002551612225562499, "phrase": "large_movie_pool"}, {"score": 0.002498812056838983, "phrase": "movie_grouping_algorithm"}, {"score": 0.002447101794397243, "phrase": "computational_complexity"}, {"score": 0.0023566987138026285, "phrase": "extensive_simulation"}, {"score": 0.00212268510072928, "phrase": "multiple_times"}], "paper_keywords": ["Distributed video-on-demand", " linear programming", " optimization", " segment storage and retrieval"], "paper_abstract": "In a distributed large-scale video-on-demand (VoD) streaming network, a content provider often deploys local servers close to their users. A movie is partitioned into kappa segments which the servers collaboratively replicate and retrieve (kappa >= 1). A critical but challenging problem is how to minimize overall system deployment cost consisting of server bandwidth, server storage, and network traffic among servers. In this paper, we address this problem through jointly optimizing movie storage and retrieval in the server network. We first formulate the optimization problem and show that it is NP-hard. To address the problem, we propose a novel, effective and implementable heuristic termed LP-SR. LP-SR decomposes the optimization problem into two computationally efficient linear programs (LPs) for segment storage and retrieval, respectively. The strength of LP-SR is that it is asymptotically optimal in terms of kappa, and kappa is not high to be closely optimal (around 5 to 10 in our study). For large movie pool, we propose a movie grouping algorithm to further reduce the computational complexity without compromising much on the performance. Through extensive simulation, LP-SR is shown to perform significantly the best as compared with other state-of-the-art and traditional schemes, reducing the deployment cost by a wide margin (by multiple times in many cases). It attains performance very close to the global optimum.", "paper_title": "LP-SR: Approaching Optimal Storage and Retrieval for Video-on-Demand", "paper_id": "WOS:000327393900032"}