{"auto_keywords": [{"score": 0.03254376137231176, "phrase": "closed_form"}, {"score": 0.004516962628112147, "phrase": "intrinsic_parameters"}, {"score": 0.004347057700479576, "phrase": "world_point_positions"}, {"score": 0.0037287578312533596, "phrase": "curve's_properties"}, {"score": 0.0034828730516958807, "phrase": "image_points"}, {"score": 0.0030127172247606812, "phrase": "orientation_constraints"}, {"score": 0.0028745946327439656, "phrase": "impossible_configurations"}, {"score": 0.002790004829699627, "phrase": "novel_algorithm"}, {"score": 0.0027311076665349657, "phrase": "essential_matrix"}, {"score": 0.0024969812322112174, "phrase": "notoriously_difficult_problem"}, {"score": 0.0023123057299992587, "phrase": "one-dimensional_parameter_domain"}, {"score": 0.0021688641066186817, "phrase": "intended_use"}, {"score": 0.0021049977753042253, "phrase": "hypothesise-and-test_architecture"}], "paper_keywords": ["structure-from-motion", " multi-view geometry", " minimal methods", " RANSAC", " Kruppa constraint", " algebraic curves"], "paper_abstract": "Suppose two perspective views of four world points are given and that the intrinsic parameters are known but the camera poses and the world point positions are not. We prove that the epipole in each view is then constrained to lie on a curve of degree ten. We derive the equation for the curve and establish many of the curve's properties. For example, we show that the curve has four branches through each of the image points and that it has four additional points on each conic of the pencil of conics through the four image points. We show how to compute the four curve points on each conic in closed form. We show that orientation constraints allow only parts of the curve and find that there are impossible configurations of four corresponding point pairs. We give a novel algorithm that solves for the essential matrix given three corresponding points and one of the epipoles. We then use the theory to create the most efficient solution yet to the notoriously difficult problem of solving for the pose of three views given four corresponding points. The solution is a search over a one-dimensional parameter domain, where each point in the search can be evaluated in closed form. The intended use for the solution is in a hypothesise-and-test architecture to solve for structure and motion.", "paper_title": "Four points in two or three calibrated views: Theory and practice", "paper_id": "WOS:000237985300005"}