{"auto_keywords": [{"score": 0.048004834084269775, "phrase": "icu"}, {"score": 0.034124088376251145, "phrase": "medical_errors"}, {"score": 0.00481495049065317, "phrase": "critical_care"}, {"score": 0.004652016085325825, "phrase": "intensive_care_unit"}, {"score": 0.004385367803204002, "phrase": "critically_ill_patients"}, {"score": 0.004236908273106904, "phrase": "good_care"}, {"score": 0.003954837422946628, "phrase": "treatment_purposes"}, {"score": 0.003728000957725218, "phrase": "error_evolution"}, {"score": 0.003462599815177726, "phrase": "critical_care_environment"}, {"score": 0.003168859801438632, "phrase": "ethnographic_observation_and_interview_data"}, {"score": 0.002899965889623787, "phrase": "key_personnel"}, {"score": 0.002538687900036229, "phrase": "observation_data"}, {"score": 0.0023346234464901978, "phrase": "generalize-able_cognitive_model"}, {"score": 0.0022890371899188466, "phrase": "intricate_workflow"}, {"score": 0.0022223176391038785, "phrase": "proposed_model"}, {"score": 0.0021049977753042253, "phrase": "error_prediction"}], "paper_keywords": ["medical errors", " critical care workflow", " error prediction", " decision making models"], "paper_abstract": "The intensive care unit (ICU) is an instance of a very dynamic health care setting where critically ill patients are being managed. To provide good care, art extensive and coordinated communication amongst the role players, use of numerous information systems and operation of devices for monitoring and treatment purposes are required. The purpose of this research is to study error evolution and management within this environment. The focus is on representing the workflow of critical care environment, which emphasizes the importance such a representation may play in strategizing the management of medical errors. We used ethnographic observation and interview data to build individual pieces of the workflow, dependent on the individual and the activity concerned. Key personnel were intensively followed during their respective patient care activities and the related actions. All interactions were recorded for analysis. These clinicians and nurses were interviewed to complement the observation data and to delineate their individual workflows. These pieces of the ICU workflow were used to develop a generalize-able cognitive model to represent the intricate workflow applicable to other health care settings. The proposed model can be used to identify and characterize medical errors and for error prediction in practice. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Workflow modeling in critical care: Piecing together your own puzzle", "paper_id": "WOS:000245699600001"}