{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "non-random_patterns"}, {"score": 0.04957786067961377, "phrase": "multivariate_control_charts"}, {"score": 0.03969560008499502, "phrase": "mean_square_successive_difference_matrix"}, {"score": 0.03107426778648457, "phrase": "new_robust_estimators"}, {"score": 0.004544127927346964, "phrase": "different_robust_estimators"}, {"score": 0.003839510177926892, "phrase": "sample_mean_vector"}, {"score": 0.0031428202743657057, "phrase": "multiple_outliers"}, {"score": 0.002997203022420553, "phrase": "mean_shift"}, {"score": 0.002813461335948151, "phrase": "mve"}, {"score": 0.002654911400878851, "phrase": "detection_performance"}, {"score": 0.0025858215477025117, "phrase": "simulation_approach"}, {"score": 0.0025452314655691165, "phrase": "control_limits"}, {"score": 0.0025052769325080255, "phrase": "signal_probabilities"}, {"score": 0.002376559242152662, "phrase": "multivariate_control_chart"}, {"score": 0.0022904032758108775, "phrase": "well-balanced_sensitivity"}, {"score": 0.002242577809454225, "phrase": "above-mentioned_non-random_patterns"}], "paper_keywords": ["Hotelling's T2 control chart", " minimum volume ellipsoid estimator", " overall false alarm rate", " signal probability"], "paper_abstract": "In the past decade, different robust estimators have been proposed by several researchers to improve the ability to detect non-random patterns such as trend, process mean shift, and outliers in multivariate control charts. However, the use of the sample mean vector and the mean square successive difference matrix in the T2 control chart is sensitive in detecting process mean shift or trend but less sensitive in detecting outliers. On the other hand, the minimum volume ellipsoid (MVE) estimators in the T2 control chart are sensitive in detecting multiple outliers but less sensitive in detecting trend or process mean shift. Therefore, new robust estimators using both merits of the mean square successive difference matrix and the MVE estimators are developed to modify Hotelling's T2 control chart. To compare the detection performance among various control charts, a simulation approach for establishing control limits and calculating signal probabilities is provided as well. Our simulation results show that a multivariate control chart using the new robust estimators can achieve a well-balanced sensitivity in detecting the above-mentioned non-random patterns. Finally, three numerical examples further demonstrate the usefulness of our new robust estimators.", "paper_title": "New robust estimators for detecting non-random patterns in multivariate control charts: a simulation approach", "paper_id": "WOS:000287499100003"}