{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "commercial_cloud_services"}, {"score": 0.023863596245976393, "phrase": "cloud_services_evaluation"}, {"score": 0.004671156704912419, "phrase": "cloud_computing"}, {"score": 0.004297388539539564, "phrase": "existing_evaluation_studies"}, {"score": 0.004184825434585617, "phrase": "tremendous_confusion"}, {"score": 0.00393844255111604, "phrase": "aforementioned_chaos"}, {"score": 0.0038207243221070166, "phrase": "existing_evaluation_implementations"}, {"score": 0.0036368625017975343, "phrase": "research_opportunities"}, {"score": 0.0035147642199945387, "phrase": "conceptual_evaluation_model"}, {"score": 0.0034881908940439213, "phrase": "six_steps"}, {"score": 0.003320277992107974, "phrase": "cloud_services_evaluation_step"}, {"score": 0.0031724417545242315, "phrase": "overall_data"}, {"score": 0.0030775481952376987, "phrase": "current_practical_landscape"}, {"score": 0.002929344511491418, "phrase": "future_evaluation_work"}, {"score": 0.002820202660128789, "phrase": "world-wide_research_topic"}, {"score": 0.002623881637290192, "phrase": "elasticity_and_security_evaluation"}, {"score": 0.002564763827975352, "phrase": "long-term_challenge"}, {"score": 0.002404381957892126, "phrase": "paas"}, {"score": 0.0023861839141022575, "phrase": "iaas"}, {"score": 0.002254003531073337, "phrase": "slr_study"}, {"score": 0.0022115879730677, "phrase": "previous_experiences"}, {"score": 0.0021865218861454256, "phrase": "new_evidence-based_software_engineering"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Cloud Computing", " Cloud service evaluation", " Systematic literature review"], "paper_abstract": "Background: Cloud Computing is increasingly booming in industry with many competing providers and services. Accordingly, evaluation of commercial Cloud services is necessary. However, the existing evaluation studies are relatively chaotic. There exists tremendous confusion and gap between practices and theory about Cloud services evaluation. Aim: To facilitate relieving the aforementioned chaos, this work aims to synthesize the existing evaluation implementations to outline the state-of-the-practice and also identify research opportunities in Cloud services evaluation. Method: Based on a conceptual evaluation model comprising six steps, the systematic literature review (SLR) method was employed to collect relevant evidence to investigate the Cloud services evaluation step by step. Results: This SLR identified 82 relevant evaluation studies. The overall data collected from these studies essentially depicts the current practical landscape of implementing Cloud services evaluation, and in turn can be reused to facilitate future evaluation work. Conclusions: Evaluation of commercial Cloud services has become a world-wide research topic. Some of the findings of this SLR identify several research gaps in the area of Cloud services evaluation (e.g., Elasticity and Security evaluation of commercial Cloud services could be a long-term challenge), while some other findings suggest the trend of applying commercial Cloud services (e.g., compared with PaaS, IaaS seems more suitable for customers and is particularly important in industry). This SLR study itself also confirms some previous experiences and records new evidence-based software engineering (EBSE) lessons. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "On evaluating commercial Cloud services: A systematic review", "paper_id": "WOS:000323870300015"}