{"auto_keywords": [{"score": 0.03682252724874875, "phrase": "anchoring_problem"}, {"score": 0.00481495049065317, "phrase": "multi-robot_applications"}, {"score": 0.004638602678192715, "phrase": "inferential_activities"}, {"score": 0.00458940888106061, "phrase": "symbolic_representations"}, {"score": 0.004374385639298755, "phrase": "physical_objects"}, {"score": 0.004103212598803194, "phrase": "ad-hoc_solutions"}, {"score": 0.003931798194574009, "phrase": "coradeschi"}, {"score": 0.0038900709793274484, "phrase": "safflotti"}, {"score": 0.0035908627899097407, "phrase": "symbolic_modelling_approach"}, {"score": 0.002915959014046924, "phrase": "percepts"}, {"score": 0.00260657976055413, "phrase": "tracking_model"}, {"score": 0.0024578219177450876, "phrase": "conceptual_instances"}, {"score": 0.0022806798371116698, "phrase": "software_module"}, {"score": 0.0021049977753042253, "phrase": "robotic_soccer_application"}], "paper_keywords": [""], "paper_abstract": "Robotic systems that carry out inferential activities over symbolic representations require a process that keeps a connection between physical objects and their symbolic image. Typically, this problem has been faced with ad-hoc solutions hardwired in the code. Recently, Coradeschi and Safflotti have formalized this problem and they have called it anchoring. We propose a symbolic modelling approach to deal with the anchoring problem, in applications involving several embodied agents, by applying standard At techniques. We discuss how such a modelling approach supports the process of instantiation of concepts by aggregating percepts possibly affected by imprecision and uncertainty. Percepts may come from several sensors possibly distributed both in the environment and on several mobile agents. Furthermore, we show how a tracking model can be used to maintain the link between percepts and conceptual instances in time. This approach to the anchoring problem has been implemented in a software module called MAP (MAP Anchors Perceptions), that has been tested in a robotic soccer application.", "paper_title": "Problems and solutions for anchoring in multi-robot applications", "paper_id": "WOS:000248524400004"}