{"auto_keywords": [{"score": 0.041382532531526364, "phrase": "prime_numbers"}, {"score": 0.00481495049065317, "phrase": "biological_phenomenon"}, {"score": 0.0047273580780589665, "phrase": "magicicada"}, {"score": 0.00458488025289647, "phrase": "unique_combination"}, {"score": 0.004556901872357751, "phrase": "long_life_cycles"}, {"score": 0.004487697242654525, "phrase": "mass_emergences"}, {"score": 0.004339108074589307, "phrase": "exit_tunnel"}, {"score": 0.0041316803676012155, "phrase": "adult_insects"}, {"score": 0.003534180765325899, "phrase": "prime_number_cycles"}, {"score": 0.003213920601037463, "phrase": "tacit_coordination"}, {"score": 0.002913650880082273, "phrase": "based_life_cycles"}, {"score": 0.002765683473800204, "phrase": "\"calculating\"_ability"}, {"score": 0.0025148871904409095, "phrase": "evolutionary_biology"}, {"score": 0.0024389277933858054, "phrase": "darwin's_theory"}, {"score": 0.0023652572260178637, "phrase": "collective_behaviour"}, {"score": 0.002336414425972225, "phrase": "simple_atomic_reactions"}, {"score": 0.0023221248824337576, "phrase": "agents'_level"}, {"score": 0.0021441057555396013, "phrase": "evolutionary_selection"}, {"score": 0.002124461969404541, "phrase": "life_cycles"}, {"score": 0.0021049977753042253, "phrase": "multi-run_technique"}], "paper_keywords": [""], "paper_abstract": "Magicicada is the genus of periodical cicadas which display a unique combination of long life cycles, periodicity, and mass emergences. Their nymphs live underground and stay immobile before constructing an exit tunnel in the spring of their 13th or 17th year, depending on the species. Once out, the adult insects live only for a few weeks with one sole purpose: reproduction. Both 13 and 17 are prime numbers; why did the cicadas \"choose\" these lengths for their life cycles? Two are the most interesting hypotheses (limited resources and hybridization avoidance) drawn by biologists, both bringing to the conclusion that the prime number cycles were selected because they were least likely to emerge with other cycles. If that's the case, then these lengths would have been selected via a sort of \"tacit coordination by evolution\". In the agent based model presented here, it is shown how the two major hypotheses must be both present in order to cause the emergency of the prime numbers based life cycles. A very important point here is that the agents in the model are not endowed with a \"calculating\" ability, in particular they lack the capacity of determining divisors. In the model no form of learning is present; the emergency of prime numbers is then a fact of evolutionary biology, a natural selection by adaptation, a la Darwin's theory known as \"survival of the fittest\". Collective behaviour thus emerges from simple atomic reactions at agents' level and from their reactions to the constraints imposed by the environment. In order to explore the space of parameters and to understand their role in the evolutionary selection of the life cycles, the multi-run technique is used (i.e.: changing a value at a time, the others being the same).", "paper_title": "An evolutionary selection model based on a biological phenomenon: The periodical magicicadas", "paper_id": "WOS:000242125300040"}