{"auto_keywords": [{"score": 0.048231156244864744, "phrase": "heterogeneous_stress_field"}, {"score": 0.023048605761850263, "phrase": "massive_structures"}, {"score": 0.020925141895273395, "phrase": "constitutive_model"}, {"score": 0.010612387000973441, "phrase": "localized_failure"}, {"score": 0.009290155671777623, "phrase": "massive_structure"}, {"score": 0.008828911432104724, "phrase": "three-point_bending_test"}, {"score": 0.004363846362238565, "phrase": "model_parameters"}, {"score": 0.0036697319652557363, "phrase": "salient_feature"}, {"score": 0.003405109584265324, "phrase": "so-called_fracture_process_zone"}, {"score": 0.0031719830393831115, "phrase": "thhe_tests"}, {"score": 0.0030494153169181334, "phrase": "simple_tension_test"}, {"score": 0.0028857130140890787, "phrase": "strain_field"}, {"score": 0.0028293966058473476, "phrase": "homogeneous_stress"}, {"score": 0.0027200305495826797, "phrase": "proposed_inverse_optimization_proble"}, {"score": 0.002494039334114861, "phrase": "proposed_methodology"}, {"score": 0.002455009746748708, "phrase": "corresponding_material_parameters"}, {"score": 0.002259883463607508, "phrase": "proposed_identification_procedure"}, {"score": 0.002224510044064184, "phrase": "corresponding_parameters"}, {"score": 0.0022070310530794097, "phrase": "damage_model"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["Structural engineering", " Structural design", " Failure (mechanical)"], "paper_abstract": "Purpose The purpose of this paper is too discuss the identification of the model parameters for constitutive model capable of representing the failure of massive structure. from two kinds of experiments, a uniaxial tensile test annd a three-point bending test. Design/methodology/approach - A detailed development of the ingredients for constitutive model for failure of massive structures are presented in Part I of this paper. The salient feature of the model is in its ability to correctly represent two different failure mechanisms for massive structures. the diffuse damage in so-called fracture process zone with microcracks and localized damage in a macrocrak. The identification of such model parameters is best performed from thhe tests under heterogeneous stress field. Two kinds of tests are used the simple tension test and the three-point bending test. The former allows us illustrate the non-homogeneity of the strain field at failure enve under homogeneous stress, whereas the latter provides a very good illustration for the proposed inverse optimization proble for which the specimanis subjected to a heterogeneous stress field. Findings Several numerical examples are presented in order to illustrate a very satisfying performance of the proposed methodology for identifying the corresponding material parameters of the constitutive model for failure of massive structures. Originality/value The paper confirms that one can make a very good use of the proposed identification procedure for estimating the corresponding parameters of damage model for localized failure of massive structure, and the advantages to using the experimental results obtained by testing under heterogeneous stress field.", "paper_title": "Novel anisotropic continuum-discrete damage model capable of representing localized failure of massive structures Part II: identification from tests under heterogeneous stress field", "paper_id": "WOS:000264968100007"}