{"auto_keywords": [{"score": 0.043521541207925805, "phrase": "beaconless_georouting_protocols"}, {"score": 0.036473241543419986, "phrase": "control_packets"}, {"score": 0.00481495049065317, "phrase": "beaconless_georouting"}, {"score": 0.004717960684395242, "phrase": "viable_packet-forwarding_technique"}, {"score": 0.004261419841494814, "phrase": "analytical_tools"}, {"score": 0.0038803710796509227, "phrase": "single_hop"}, {"score": 0.003802135020791801, "phrase": "end-to-end_performance_analysis"}, {"score": 0.003725470458263889, "phrase": "practical_application_scenarios"}, {"score": 0.003310236836421397, "phrase": "communication_range"}, {"score": 0.003217124533918232, "phrase": "packet_length"}, {"score": 0.0030635374056374016, "phrase": "data_packets"}, {"score": 0.0029773436815290215, "phrase": "substantial_discrepancy"}, {"score": 0.0027108021939930014, "phrase": "data_packet_communication"}, {"score": 0.0025918745925152423, "phrase": "realistic_analysis"}, {"score": 0.002560352786969071, "phrase": "end-to-end_performance"}, {"score": 0.002388817995161952, "phrase": "better_perspective"}, {"score": 0.0023026973099101876, "phrase": "hypothetical_limit_case"}, {"score": 0.0022561982694417116, "phrase": "optimal_energy"}, {"score": 0.0022378620428620782, "phrase": "latency_performance"}, {"score": 0.0021049977753042253, "phrase": "georouting_protocol"}], "paper_keywords": ["Average packet error rate (PER)", " beaconless georouting", " end-to-end performance", " energy", " latency", " packet detection criteria"], "paper_abstract": "Beaconless georouting has emerged as a viable packet-forwarding technique in distributed wireless networks, particularly for applications requiring portability and scalability. In this paper, we focus on fine-tuning and developing the analytical tools associated with the study of beaconless georouting protocols. For instance, they have been traditionally analyzed and simulated from the perspective of a single hop only. However, end-to-end performance analysis is instrumental when considering practical application scenarios. Furthermore, beaconless georouting protocols have been studied in literature assuming equal communication ranges for the data and control packets. In reality, this is not true since the communication range is actually a function of the packet length (among other factors). Control packets are typically much shorter than data packets. As a consequence, a substantial discrepancy exists in practice between their respective communication ranges, causing many data packet drops. Accordingly, we introduce two simple strategies for bridging the gap between the control and data packet communication ranges. Our primary objective in this paper is to construct a realistic analysis describing the end-to-end performance of beaconless georouting protocols. Two flagship protocols are selected in this paper for further investigation. For a better perspective, the two protocols are actually compared to a hypothetical limit case, one which offers optimal energy and latency performance. Finally, we present four different application scenarios. For each scenario, we highlight the georouting protocol which performs the best and discuss the reasons behind it.", "paper_title": "Beaconless Georouting Under The Spotlight: Practical Link Models and Application Scenarios", "paper_id": "WOS:000356714100014"}