{"auto_keywords": [{"score": 0.04787812087484255, "phrase": "erp."}, {"score": 0.0303000657797491, "phrase": "saas"}, {"score": 0.00481495049065317, "phrase": "semantic_web_based_software"}, {"score": 0.004563028873351776, "phrase": "ever_increasing_internet_bandwidth"}, {"score": 0.004517275498868226, "phrase": "fast_changing_needs"}, {"score": 0.004368037394395782, "phrase": "procurement_chain"}, {"score": 0.004266501496765747, "phrase": "information_systems_infrastructures"}, {"score": 0.0039367470511575756, "phrase": "software"}, {"score": 0.0037802952295316744, "phrase": "erp"}, {"score": 0.003679969180334367, "phrase": "software_provisioning"}, {"score": 0.003510754567808717, "phrase": "network_externalities"}, {"score": 0.003452218803245602, "phrase": "main_variables"}, {"score": 0.003417565253539315, "phrase": "utility_function"}, {"score": 0.0030278017562213265, "phrase": "saas_sourcing_decisions"}, {"score": 0.002937493907103812, "phrase": "integrative_framework"}, {"score": 0.002830757050018908, "phrase": "specific_context"}, {"score": 0.0026733579356594253, "phrase": "liberatore"}, {"score": 0.0026199146891406, "phrase": "relative_importance"}, {"score": 0.0022365262201954643, "phrase": "network_externality_benefits"}, {"score": 0.0021624739899833868, "phrase": "significant_determinants"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software as a Service (SaaS)", " Application Service Provider (ASP)", " IS outsourcing", " Outsourcing", " Semantic web", " E-procurement", " ERP"], "paper_abstract": "The ever increasing Internet bandwidth and the fast changing needs of businesses for effectiveness with the partners in the procurement chain and is leading organizations to adopt information systems infrastructures that are cost effective as well as flexible. The question seems to be: what is driving organizations to go in for Software as a Service (SaaS) based e-procurement and ERP, rather than the packaged model of software provisioning? Whereas there have been studies reporting technology, cost, quality, network externalities and process as the main variables in the utility function of the user, but most of the studies have modelled either one or two in the their models. The study is exploratory in nature and tries to identify, classify and rank dimensions affecting SaaS sourcing decisions. In this study, we developed an integrative framework to identify the determinants of choice of SaaS in the specific context of SaaS based e-procurement and ERP. The framework was then analyzed using the extended Analytic Hierarchy Process (AHP) method suggested by Liberatore (1987) and the relative importance and the weights of the criteria identified using data collected on 8 users and 9 service providers of SaaS based e-procurement and ERP. Although the analysis helped in identifying quality and costs as the two most important determinants of choice of SaaS based e-procurement and ERP, but the other criteria such as network externality benefits, technology and process were also found to be significant determinants of choice. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Determinants of choice of semantic web based Software as a Service: An integrative framework in the context of e-procurement and ERP", "paper_id": "WOS:000337882000003"}