{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "user_groups_on_erp_logs."}, {"score": 0.0047310525657970615, "phrase": "innovative_approach"}, {"score": 0.004567596860086148, "phrase": "social_network"}, {"score": 0.0045037997020733415, "phrase": "graph_coloring_problem"}, {"score": 0.004378854464130883, "phrase": "social_networks"}, {"score": 0.004302522426263979, "phrase": "company's_intranet"}, {"score": 0.0042126709243529275, "phrase": "user_groups"}, {"score": 0.0040957690050613185, "phrase": "enterprise_resource_planning"}, {"score": 0.0039264465913491356, "phrase": "work_practices"}, {"score": 0.00371148138781691, "phrase": "erp_logs"}, {"score": 0.0036467403626789666, "phrase": "internal_social_network"}, {"score": 0.0031455000569352454, "phrase": "workplace_location"}, {"score": 0.0030906010704382374, "phrase": "secondary_information"}, {"score": 0.002931569771634119, "phrase": "users'_groups"}, {"score": 0.0028201570908224166, "phrase": "graph_topology"}, {"score": 0.0026562224049977213, "phrase": "new_users"}, {"score": 0.0024236964502593254, "phrase": "user_clustering_solutions"}, {"score": 0.0023070189467375374, "phrase": "gravitational_swarm"}, {"score": 0.002290814637620121, "phrase": "graph_coloring"}], "paper_keywords": ["graph coloring", " identification", " nonstationary social networks"], "paper_abstract": "This article uses an innovative approach for the identification of groups of users in a social network by solving a graph coloring problem (GCP). We focus on social networks of users of a company's intranet. We want to identify user groups sharing the same behavior while interacting with the enterprise resource planning (ERP) as a means to verify that their roles, work practices, and positions held in the company are correct for each user. From the ERP logs, we generate the internal social network (ISN) graph where each vertex corresponds to a user and edges correspond to relations between users. Two users will be related if they frequently use the same programs. Other user attributes like the role assigned by the administrator, workplace location, or department offer secondary information to create the relations between users. After generating the graph we identify the users' groups solving a GCP on the ISN complementary graph. Moreover, ISN graph topology changes over time, so the composition of the groups of users may also change. New users can enter the intranet and exit it, and the behavior of the users may change. Therefore, we need approaches the quickly provide user clustering solutions to be able to adapt to the ISN time changes. We propose the gravitational swarm for graph coloring (GSGC) for this task and compare it with state-of-the-art approaches. We provide results on real-life (anonymized) cases.", "paper_title": "SWARM GRAPH COLORING FOR THE IDENTIFICATION OF USER GROUPS ON ERP LOGS", "paper_id": "WOS:000323877900003"}