{"auto_keywords": [{"score": 0.04804050199975018, "phrase": "kickback_rate"}, {"score": 0.017060596232422842, "phrase": "gini_index"}, {"score": 0.006851030816804423, "phrase": "fair_degree"}, {"score": 0.004827407523613097, "phrase": "social_wealth_distribution"}, {"score": 0.00481495049065317, "phrase": "kickback_rate."}, {"score": 0.0047113960612140335, "phrase": "asset_exchange_model"}, {"score": 0.004366106816225457, "phrase": "different_kickback_rates"}, {"score": 0.004112582094962078, "phrase": "related_gini_index"}, {"score": 0.003916098498242888, "phrase": "kickback_rate-gini_index_curve"}, {"score": 0.0023990982005125763, "phrase": "wealth_distribution"}, {"score": 0.0023219374444738723, "phrase": "moral_index"}, {"score": 0.0021987994275190314, "phrase": "social_moral_level"}, {"score": 0.0021049977753042253, "phrase": "social_moral_level_increase"}], "paper_keywords": ["Wealth distribution", " Gini index", " Monte Carlo", " kickback", " altruism"], "paper_abstract": "We define an asset exchange model by adding the kickback rate to the trade, and discuss the Gini index with different kickback rates. It is found that for every kickback rate, the related Gini index tends to be steady; thus, the kickback rate-Gini index curve may be obtained. Furthermore, it is shown that the Gini index decreases when the kickback rate increases, so that the fair degree of social wealth distribution gets better. The Gini index reaches a minimum when the kickback rate is 0.58, and then it increases, as the accretion of the kickback rate destroys the fair degree of social wealth distribution. However, in all situations, the Gini index with kickback rate is less than the one without kickback. This means that the introduction of kickback rate is favorable to the raising of the fair degree of wealth distribution. We also define a moral index similar to the Gini index to weigh the differences of social moral level, and find that the differences of social moral level increase with time for the model with kickback rate.", "paper_title": "THE WEALTH DISTRIBUTION MODEL WITH THE KICKBACK RATE", "paper_id": "WOS:000261383000007"}