{"auto_keywords": [{"score": 0.03954823418439521, "phrase": "timing_perturbations"}, {"score": 0.01563403217906638, "phrase": "stepping_stones"}, {"score": 0.012943720581834546, "phrase": "timing-based_correlation_approaches"}, {"score": 0.010829642869935692, "phrase": "unique_watermark"}, {"score": 0.007784989950833331, "phrase": "timing_perturbation"}, {"score": 0.00481495049065317, "phrase": "encrypted_attack_traffic"}, {"score": 0.004762027452336851, "phrase": "flow_watermarking"}, {"score": 0.00473578343131372, "phrase": "network-based_intruders"}, {"score": 0.004556062353747973, "phrase": "intermediate_\"stepping_stones"}, {"score": 0.004216736799385604, "phrase": "incoming_and_outgoing_flows"}, {"score": 0.004158847144705244, "phrase": "stepping_stone"}, {"score": 0.003978866233891427, "phrase": "connection_traffic"}, {"score": 0.0038489909212815485, "phrase": "encrypted_connections"}, {"score": 0.0035720061878618307, "phrase": "novel_watermark-based-correlation_scheme"}, {"score": 0.0032783981960897196, "phrase": "encrypted_flows"}, {"score": 0.003215502199994255, "phrase": "selected_packets"}, {"score": 0.0031364001483313534, "phrase": "encrypted_flow"}, {"score": 0.003067717298233605, "phrase": "passive_timing-based_correlation"}, {"score": 0.0029592913999522004, "phrase": "existing_passive_correlation_approaches"}, {"score": 0.0029024996328924197, "phrase": "limiting_assumptions"}, {"score": 0.002862600672991808, "phrase": "random_process"}, {"score": 0.0028389242954210254, "phrase": "original_interpacket_timing"}, {"score": 0.0028154431906571944, "phrase": "packet_flow"}, {"score": 0.0026054158371650884, "phrase": "sufficiently_long_flows"}, {"score": 0.0024311346712789553, "phrase": "accurate_quantitative_tradeoffs"}, {"score": 0.002411018291255539, "phrase": "achievable_correlation_effectiveness"}, {"score": 0.002391067964886602, "phrase": "defining_characteristics"}, {"score": 0.0022559519822122317, "phrase": "desired_correlation_effectiveness"}, {"score": 0.002206507059527714, "phrase": "experimental_results"}, {"score": 0.002134359860048694, "phrase": "passive_timing-based_correlation_methods"}, {"score": 0.0021049977753042253, "phrase": "random_timing_perturbations"}], "paper_keywords": ["Network-level security and protection", " intrusion tracing", " correlation", " stepping stone"], "paper_abstract": "Network-based intruders seldom attack their victims directly from their own computer. Often, they stage their attacks through intermediate \"stepping stones\" in order to conceal their identity and origin. To identify the source of the attack behind the stepping stone(s), it is necessary to correlate the incoming and outgoing flows or connections of a stepping stone. To resist attempts at correlation, the attacker may encrypt or otherwise manipulate the connection traffic. Timing-based correlation approaches have been shown to be quite effective in correlating encrypted connections. However, timing-based correlation approaches are subject to timing perturbations that may be deliberately introduced by the attacker at stepping stones. In this paper, we propose a novel watermark-based-correlation scheme that is designed specifically to be robust against timing perturbations. Unlike most previous timing-based correlation approaches, our watermark-based approach is \"active\" in that it embeds a unique watermark into the encrypted flows by slightly adjusting the timing of selected packets. The unique watermark that is embedded in the encrypted flow gives us a number of advantages over passive timing-based correlation in resisting timing perturbations by the attacker. In contrast to the existing passive correlation approaches, our active watermark-based correlation does not make any limiting assumptions about the distribution or random process of the original interpacket timing of the packet flow. In theory, our watermark-based correlation can achieve arbitrarily close to 100 percent correlation true positive rate (TPR), and arbitrarily close to 0 percent false positive rate (FPR) at the same time for sufficiently long flows, despite arbitrarily large (but bounded) timing perturbations of any distribution by the attacker. Our paper is the first that identifies 1) accurate quantitative tradeoffs between the achievable correlation effectiveness and the defining characteristics of the timing perturbation; and 2) a provable upper bound on the number of packets needed to achieve a desired correlation effectiveness, given the amount of timing perturbation. Experimental results show that our active watermark-based correlation performs better and requires fewer packets than existing, passive timing-based correlation methods in the presence of random timing perturbations.", "paper_title": "Robust Correlation of Encrypted Attack Traffic through Stepping Stones by Flow Watermarking", "paper_id": "WOS:000288453700009"}