{"auto_keywords": [{"score": 0.02949033820579446, "phrase": "polynomial_algorithm"}, {"score": 0.00481495049065317, "phrase": "cooperative_connectivity_games"}, {"score": 0.004558012799538011, "phrase": "important_network_servers"}, {"score": 0.004267643450023782, "phrase": "cooperative_game"}, {"score": 0.003528244907944199, "phrase": "power_indices"}, {"score": 0.003489714006817602, "phrase": "agent's_ability"}, {"score": 0.0032079118323314424, "phrase": "fair_share"}, {"score": 0.0030700099570048346, "phrase": "significant_possible_points"}, {"score": 0.002895291306821514, "phrase": "general_graphs"}, {"score": 0.002853183476661506, "phrase": "shapley_and_banzhaf_power_indices"}, {"score": 0.0026711292765356064, "phrase": "stable_payoff_divisions"}, {"score": 0.0026227019312249334, "phrase": "cgs"}, {"score": 0.002575042977852052, "phrase": "game_theoretic_solution"}, {"score": 0.002473325513637559, "phrase": "least_core"}, {"score": 0.0021049977753042253, "phrase": "epsilon-core_imputations"}], "paper_keywords": [""], "paper_abstract": "We consider how selfish agents are likely to share revenues derived from maintaining connectivity between important network servers. We model a network where a failure of one node may disrupt communication between other nodes as a cooperative game called the vertex Connectivity Game (CG). In this game, each agent owns a vertex, and controls all the edges going to and from that vertex. A coalition of agents wins if it fully connects a certain subset of vertices in the graph, called the primary vertices. Power indices measure an agent's ability to affect the outcome of the game. We show that in our domain, such indices can be used to both determine the fair share of the revenues an agent is entitled to, and identify significant possible points of failure affecting the reliability of communication in the network. We show that in general graphs, calculating the Shapley and Banzhaf power indices is #P-complete, but suggest a polynomial algorithm for calculating them in trees. We also investigate finding stable payoff divisions of the revenues in CGs, captured by the game theoretic solution of the core, and its relaxations, the epsilon-core and least core. We show a polynomial algorithm for computing the core of a CG, but show that testing whether an imputation is in the epsilon-core is coNP-complete. Finally, we show that for trees, it is possible to test for epsilon-core imputations in polynomial time.", "paper_title": "Sharing Rewards in Cooperative Connectivity Games", "paper_id": "WOS:000320362400001"}