{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "novel_ranking_algorithm"}, {"score": 0.0047515546458205046, "phrase": "random_walks"}, {"score": 0.004606843145343611, "phrase": "essential_roles"}, {"score": 0.004566308708871429, "phrase": "post-transcriptional_gene_regulation"}, {"score": 0.004330450801016359, "phrase": "experimental_methods"}, {"score": 0.004161553532799662, "phrase": "specific_environmental_conditions"}, {"score": 0.004124920849728372, "phrase": "cell_types"}, {"score": 0.004070573090297285, "phrase": "computational_methods"}, {"score": 0.004016938499717623, "phrase": "sufficient_number"}, {"score": 0.003929107176349023, "phrase": "training_samples"}, {"score": 0.0038431888954930083, "phrase": "genome_annotation"}, {"score": 0.003742554019950264, "phrase": "predicted_putative_mirnas"}, {"score": 0.0033805214040814233, "phrase": "existing_methods"}, {"score": 0.0029471818883482688, "phrase": "novel_mirna_prediction_method"}, {"score": 0.0027456676902333304, "phrase": "homo_sapiens_genome"}, {"score": 0.002615156460073562, "phrase": "prediction_accuracy"}, {"score": 0.0024688710065898646, "phrase": "anopheles_gambiae"}, {"score": 0.0023724231159960034, "phrase": "africa"}, {"score": 0.0021712920081029194, "phrase": "conserved_putative_mirnas"}, {"score": 0.0021521410307795657, "phrase": "good_candidates"}, {"score": 0.0021049977753042253, "phrase": "malaria_infection"}], "paper_keywords": [""], "paper_abstract": "MicroRNA (miRNAs) play essential roles in post-transcriptional gene regulation in animals and plants. Several existing computational approaches have been developed to complement experimental methods in discovery of miRNAs that express restrictively in specific environmental conditions or cell types. These computational methods require a sufficient number of characterized miRNAs as training samples, and rely on genome annotation to reduce the number of predicted putative miRNAs. However, most sequenced genomes have not been well annotated and many of them have a very few experimentally characterized miRNAs. As a result, the existing methods are not effective or even feasible for identifying miRNAs in these genomes. Aiming at identifying miRNAs from genomes with a few known miRNA and/or little annotation, we propose and develop a novel miRNA prediction method, miRank, based on our new random walks- based ranking algorithm. We first tested our method on Homo sapiens genome; using a very few known human miRNAs as samples, our method achieved a prediction accuracy greater than 95. We then applied our method to predict 200 miRNAs in Anopheles gambiae, which is the most important vector of malaria in Africa. Our further study showed that 78 out of the 200 putative miRNA precursors encode mature miRNAs that are conserved in at least one other animal species. These conserved putative miRNAs are good candidates for further experimental study to understand malaria infection.", "paper_title": "MicroRNA prediction with a novel ranking algorithm based on random walks", "paper_id": "WOS:000257169700028"}