{"auto_keywords": [{"score": 0.045290403341537215, "phrase": "ewma_statistic"}, {"score": 0.00481495049065317, "phrase": "monitoring_process_dispersion"}, {"score": 0.0045846424310611745, "phrase": "dispersion_increases"}, {"score": 0.003957477564354679, "phrase": "negative_normalized_observations"}, {"score": 0.003206916619690171, "phrase": "simulation_studies"}, {"score": 0.0031182092708983184, "phrase": "proposed_upper-sided_ewma_chart"}, {"score": 0.0028068030356445894, "phrase": "proposed_lower-sided_ewma_chart"}, {"score": 0.002473786357109046, "phrase": "proposed_two-sided_ewma_chart"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Process dispersion", " Exponentially weighted moving average", " Average run length", " ARL-unbiased", " In-control", " Out-of-control"], "paper_abstract": "There exist two EWMA-type dispersion charts for monitoring dispersion increases in the literature. One resets the EWMA statistic to zero whenever it is below zero. The other one truncates negative normalized observations to zero in the EWMA statistic. This paper proposes two one-sided EWMA charts for detecting dispersion increases and decreases, respectively, and one two-sided EWMA chart for monitoring dispersion increases or decreases simultaneously. Simulation studies show that the proposed upper-sided EWMA chart performs better than the two existing counterparts for detecting increases in dispersion, and that the proposed lower-sided EWMA chart significantly outperforms the two lower-sided EWMA charts developed similar to their two existing upper-sided EWMA charts for detecting decreases in dispersion. Moreover, the proposed two-sided EWMA chart provides much better sensitivity than the two two-sided EWMA charts generalized from the two existing upper-sided EWMA charts for detecting overall changes in dispersion. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "New EWMA control charts for monitoring process dispersion", "paper_id": "WOS:000279096500012"}