{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "web_search"}, {"score": 0.040572875711846985, "phrase": "individual_users"}, {"score": 0.03951367957277438, "phrase": "different_users"}, {"score": 0.0047820521205253035, "phrase": "social_network_analysis"}, {"score": 0.0047007816199415905, "phrase": "existing_web_search_solutions"}, {"score": 0.004620885890478087, "phrase": "broad_set"}, {"score": 0.004374192072307276, "phrase": "high_speed_intemet_applications"}, {"score": 0.003906034193833338, "phrase": "web_search_solutions"}, {"score": 0.003826441783705964, "phrase": "right_information"}, {"score": 0.0036846952802928, "phrase": "different_preferences"}, {"score": 0.00365949103351756, "phrase": "search_results"}, {"score": 0.0033933295645859015, "phrase": "personalized_web_search"}, {"score": 0.003114219280081737, "phrase": "search_engines"}, {"score": 0.002947723206640026, "phrase": "relevant_parts"}, {"score": 0.0027520299821330125, "phrase": "strong_correlation"}, {"score": 0.002733187900351625, "phrase": "relevant_information"}, {"score": 0.002640889905429026, "phrase": "personal_interests"}, {"score": 0.002431861192375809, "phrase": "user's_social_networks"}, {"score": 0.002278152865899792, "phrase": "user's_social_network"}, {"score": 0.0021861082519868567, "phrase": "search_engine"}], "paper_keywords": ["Personalization", " Social networks", " Search engine", " Optimization", " Ranking"], "paper_abstract": "Most of the existing Web search solutions are built for satisfying broad set of users regardless whether na ve or professionals. Further, with the emergence of high speed intemet applications and advanced Web 2.0 based Rich Internet Applications (i.e. blogs, wikis, etc.), it has become much easier for users to publish data over the Web. This brings a challenge for Web search solutions to let individual users find the right information as per their preferences. Different users of the Web may have different preferences. Search results for the same query from different users may differ in priority for individual users. In this paper, we describe our approach of enabling personalized Web search for users based on their preferences. It is a challenge in itself to have the preferences of the users known to and considered by search engines. We have designed and developed our unique approach of finding the preferences of users from the relevant parts of their social networks and communities. We believe that the information related to the queries posed by users may have strong correlation with relevant information in their social networks. In order to find out the personal interests and the social-contexts, we find out (1) activities of users in their social-networks, and (2) relevant information from user's social networks, based on our proposed trust and relevance matrices. We have developed a mechanism that extracts information from a user's social network and uses it to re-rank the results from a search engine. We have also discussed the implementation and evaluation of our proposed solution by emphasizing how it improves the Web search. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "On personalizing Web search using social network analysis", "paper_id": "WOS:000355050200005"}