{"auto_keywords": [{"score": 0.04927872927155838, "phrase": "many-to-one_interference_channel"}, {"score": 0.030570347867177793, "phrase": "possible_channel_gain_configurations"}, {"score": 0.00481495049065317, "phrase": "confidential_messages"}, {"score": 0.004425616928975799, "phrase": "interference_network"}, {"score": 0.004254814649568355, "phrase": "general_k-user_interference_channel"}, {"score": 0.004067635935640407, "phrase": "information_theoretic_secrecy"}, {"score": 0.0033974527047473044, "phrase": "interfering_users'_messages"}, {"score": 0.00319348234663792, "phrase": "achievable_secrecy_sum_rate"}, {"score": 0.003104849179057156, "phrase": "nested_lattice_codes"}, {"score": 0.00293487292076612, "phrase": "secrecy_sum_rate"}, {"score": 0.002727700630869639, "phrase": "upper_bound"}, {"score": 0.0026820015810254004, "phrase": "achieved_secrecy_sum_rate"}, {"score": 0.0023166075278110237, "phrase": "secure_degrees"}], "paper_keywords": ["Information theoretic secrecy", " interference channel", " lattice code"], "paper_abstract": "The many-to-one interference channel has received interest by virtue of embodying the essence of an interference network while being more tractable than the general K-user interference channel. In this paper, we introduce information theoretic secrecy to this model and consider the many-to-one interference channel with confidential messages, in which each receiver, in particular, the one subject to interference, is also one from which the interfering users' messages need to be kept secret from. We derive the achievable secrecy sum rate for this channel using nested lattice codes, as well as an upper bound on the secrecy sum rate for all possible channel gain configurations. We identify several nontrivial cases where the gap between the upper bound and the achieved secrecy sum rate is only a function of the number of the users, and is uniform over all possible channel gain configurations in each case. In addition, we identify the secure degrees of freedom for this channel and show it to be equivalent to its degrees of freedom, i.e., the secrecy in high SNR comes for free.", "paper_title": "The Gaussian Many-to-One Interference Channel With Confidential Messages", "paper_id": "WOS:000289836300012"}