{"auto_keywords": [{"score": 0.04773866258910522, "phrase": "agile_methods"}, {"score": 0.007112782501574196, "phrase": "nokia"}, {"score": 0.006975931172537702, "phrase": "agile_transformation"}, {"score": 0.00481495049065317, "phrase": "traditional_methods"}, {"score": 0.004767229500022124, "phrase": "large-scale_agile_transformation"}, {"score": 0.004466519142879166, "phrase": "organization-wide_transformations"}, {"score": 0.004331868846727089, "phrase": "agile_software_development_methods"}, {"score": 0.004283913685201902, "phrase": "mainstream_adoption_phase"}, {"score": 0.004248294537944227, "phrase": "software_industry"}, {"score": 0.004143196873246147, "phrase": "passing_fad"}, {"score": 0.004007083686875716, "phrase": "real_improvement"}, {"score": 0.0037795163893761027, "phrase": "growing_amount"}, {"score": 0.003758526624693449, "phrase": "anecdotal_evidence"}, {"score": 0.003675722511837565, "phrase": "wide_range"}, {"score": 0.0036553070575015344, "phrase": "different_real-life_development_settings"}, {"score": 0.003092690568543981, "phrase": "solid_quantitative_data"}, {"score": 0.002781919402709524, "phrase": "seven_different_countries"}, {"score": 0.0027664821161338207, "phrase": "europe"}, {"score": 0.0027510752634224726, "phrase": "north_america"}, {"score": 0.002728171861386551, "phrase": "asia"}, {"score": 0.002616443314319304, "phrase": "generally_claimed_benefits"}, {"score": 0.002565879248732055, "phrase": "higher_satisfaction"}, {"score": 0.0025162898934995895, "phrase": "increased_quality"}, {"score": 0.0024883835349005863, "phrase": "increased_autonomy"}, {"score": 0.002453934333239467, "phrase": "earlier_detection"}, {"score": 0.002346861891137455, "phrase": "old_way"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software engineering", " Agile software development", " Software processes", " Agile deployment"], "paper_abstract": "Context: Many organizations have started to deploy agile methods, but so far there exist only a few studies on organization-wide transformations. Are agile methods here to stay? Some claim that agile software development methods are in the mainstream adoption phase in the software industry, while others hope that those are a passing fad. The assumption here is that if agile would not provide real improvement, adopters would be eager at first but turn pessimistic after putting it into practice. Objective: Despite the growing amount of anecdotal evidence on the success of agile methods across a wide range of different real-life development settings, scientific studies remain scarce. Even less is known about the perception of the impacts of agile transformation when it is deployed in a very large software development environment, and whether agile methods are here to stay. This study aims to fill that gap by providing evidence from a large-scale agile transformation within Nokia. While we have yet to confirm these findings with solid quantitative data, we believe that the perception of the impacts already pinpoints the direction of the impacts of large-scale agile transformation. Method: The data were collected using a questionnaire. The population of the study contains more than 1000 respondents in seven different countries in Europe, North America, and Asia. Results: The results reveal that most respondents agree on all accounts with the generally claimed benefits of agile methods. These benefits include higher satisfaction, a feeling of effectiveness, increased quality and transparency, increased autonomy and happiness, and earlier detection of defects. Finally, 60% of respondents would not like to return to the old way of working. Conclusion: While the perception of the impact of agile methods is predominantly positive, several challenge areas were discovered. However, based on this study, agile methods are here to stay. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Agile methods rapidly replacing traditional methods at Nokia: A survey of opinions on agile transformation", "paper_id": "WOS:000288348500008"}