{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "data_exchange"}, {"score": 0.014885988331749166, "phrase": "target_schema"}, {"score": 0.010095119139268364, "phrase": "canonical_universal_solution"}, {"score": 0.00871370328955623, "phrase": "local_structure"}, {"score": 0.004650330504968421, "phrase": "source_schema"}, {"score": 0.004504355451608786, "phrase": "source_instance"}, {"score": 0.004350308086118336, "phrase": "data_exchange_problem"}, {"score": 0.004325148424301224, "phrase": "previous_work"}, {"score": 0.004262881313926916, "phrase": "desirable_solutions"}, {"score": 0.003918940000819495, "phrase": "materialized_target_instance"}, {"score": 0.00367658459781873, "phrase": "basic_questions"}, {"score": 0.003340768341189764, "phrase": "particular_solution"}, {"score": 0.003170667618004276, "phrase": "relational_algebra_queries"}, {"score": 0.0028642417249023877, "phrase": "structural_properties"}, {"score": 0.0027741761880779535, "phrase": "technical_machinery"}, {"score": 0.0027421300566115416, "phrase": "rewritability_proofs"}, {"score": 0.002427145218465736, "phrase": "first_simple_tool"}, {"score": 0.002250520617413885, "phrase": "arbitrary_transformations"}, {"score": 0.0021733853238695296, "phrase": "alternative_semantics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Data exchange", " Universal solutions", " Query answering", " Query rewriting", " Locality"], "paper_abstract": "Data exchange is the problem of taking data structured under a source schema and creating an instance of a target schema. Given a source instance, there may be many solutions - target instances that satisfy the constraints of the data exchange problem. Previous work has identified two classes of desirable solutions: canonical universal solutions, and their cores. Query answering in data exchange amounts to rewriting a query over the target schema to another query that, over a materialized target instance, gives the result that is semantically consistent with the source (specifically, the \"certain answers\"). Basic questions are then: (1) how do these solutions compare in terms of query rewriting? and (2) how can we determine whether a query is rewritable over a particular solution? Our goal is to answer these questions. Our first main result is that, in terms of rewritability by relational algebra queries, the core is strictly less expressive than the canonical universal solution, which in turn is strictly less expressive than the source. To develop techniques for proving queries non-rewritable, we establish structural properties of solutions; in fact they are derived from the technical machinery developed in the rewritability proofs. Our second result is that both the canonical universal solution and the core preserve the local structure of the data, and that every target query rewritable over any of these solutions cannot distinguish tuples whose neighborhoods in the source are similar. This gives us a first simple tool for checking whether a query is non-rewritable over the canonical universal solution or over the core. We also show that these tools generalize to arbitrary transformations that preserve the local structure of the data, and investigate an alternative semantics of query answering in data exchange. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Solutions and query rewriting in data exchange", "paper_id": "WOS:000322295300003"}