{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "protein_domain_interactions"}, {"score": 0.014131249959328275, "phrase": "protein-protein_interactions"}, {"score": 0.004784565134881178, "phrase": "protein-protein_interaction_data"}, {"score": 0.004724365740062236, "phrase": "cellular_processes"}, {"score": 0.004664920223650814, "phrase": "specific_interactions"}, {"score": 0.0045052562941109734, "phrase": "system_level"}, {"score": 0.004462663711734448, "phrase": "major_goal"}, {"score": 0.004351033214640434, "phrase": "greater_understanding"}, {"score": 0.0040969285074699, "phrase": "existing_high-throughput_experimental_techniques"}, {"score": 0.00393163747242631, "phrase": "direct_information"}, {"score": 0.0037136840686010303, "phrase": "domain_composition"}, {"score": 0.0035978443860856216, "phrase": "inference_problem"}, {"score": 0.003474575242120264, "phrase": "high_level"}, {"score": 0.003409120890690851, "phrase": "experimental_data"}, {"score": 0.00322003996276874, "phrase": "domain_interactions"}, {"score": 0.0031794625343029457, "phrase": "protein-protein_interaction_map"}, {"score": 0.002965229277927781, "phrase": "belief_propagation"}, {"score": 0.002854505078275351, "phrase": "message_passing"}, {"score": 0.002782989122345306, "phrase": "interaction_map"}, {"score": 0.0026875632003075804, "phrase": "domain_assignments"}, {"score": 0.002662109089955643, "phrase": "relevant_proteins"}, {"score": 0.0024435751724545193, "phrase": "protein-protein_interaction_dataset"}, {"score": 0.0021936636821827935, "phrase": "existing_computational_predictions"}, {"score": 0.0021591287487932667, "phrase": "experimentally_available_domain_interactions"}, {"score": 0.0021049977753042253, "phrase": "existing_algorithms"}], "paper_keywords": [""], "paper_abstract": "Motivation: Cellular processes often hinge upon specific interactions among proteins, and knowledge of these processes at a system level constitutes a major goal of proteomics. In particular, a greater understanding of protein-protein interactions can be gained via a more detailed investigation of the protein domain interactions that mediate the interactions of proteins. Existing high-throughput experimental techniques assay protein-protein interactions, yet they do not provide any direct information on the interactions among domains. Inferences concerning the latter can be made by analysis of the domain composition of a set of proteins and their interaction map. This inference problem is non-trivial, however, due to the high level of noise generally present in experimental data concerning protein-protein interactions. This noise leads to contradictions, i.e. the impossibility of having a pattern of domain interactions compatible with the protein-protein interaction map. Results: We formulate the problem of prediction of protein domain interactions in a form that lends itself to the application of belief propagation, a powerful algorithm for such inference problems, which is based on message passing. The input to our algorithm is an interaction map among a set of proteins, and a set of domain assignments to the relevant proteins. The output is a list of probabilities of interaction between each pair of domains. Our method is able to effectively cope with errors in the protein-protein interaction dataset and systematically resolve contradictions. We applied the method to a dataset concerning the budding yeast Saccharomyces cerevisiae and tested the quality of our predictions by cross-validation on this dataset, by comparison with existing computational predictions, and finally with experimentally available domain interactions. Results compare favourably to those by existing algorithms.", "paper_title": "Message-passing algorithms for the prediction of protein domain interactions from protein-protein interaction data", "paper_id": "WOS:000258959600014"}