{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "object_placement_planner"}, {"score": 0.042277656257898484, "phrase": "environment_surface"}, {"score": 0.004765173195920904, "phrase": "robotic_pick-and-place_tasks"}, {"score": 0.004547438494330851, "phrase": "grasped_object"}, {"score": 0.004500414250942443, "phrase": "pick-and-place_tasks"}, {"score": 0.004098397888277889, "phrase": "user-assigned_point"}, {"score": 0.003931402465972151, "phrase": "first_the_polygon_models"}, {"score": 0.003598705020845104, "phrase": "planar_region"}, {"score": 0.002579140290642792, "phrase": "polygon_model"}, {"score": 0.0024103044278902916, "phrase": "point_cloud"}, {"score": 0.0022291501521610737, "phrase": "pick-and-place_task"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Grasp", " Manipulation", " Pick and place", " Object place"], "paper_abstract": "This paper proposes an object placement planner for a grasped object during pick-and-place tasks. The proposed planner automatically determines the pose of an object that is stably placed near a user-assigned point on the environment surface. In our proposed method, first the polygon models of both the object and the environment are clustered, with each cluster being approximated by a planar region. The position/orientation of an object placed on the environment surface can be determined by selecting a pair of clusters: one from the object and the other from the environment. We furthermore conduct several tests to determine the position/orientation of the object, namely the Convexity Test, the Contact Test and the Stability Test. We demonstrate that, by using the polygon model of the environment that is obtained by means of conversion of the point cloud, we can determine the position/orientation of an object and can thereby realize a pick-and-place task. (C) 2014 The Authors. Published by Elsevier B.V.", "paper_title": "Validating an object placement planner for robotic pick-and-place tasks", "paper_id": "WOS:000341464300011"}