{"auto_keywords": [{"score": 0.04422676102094878, "phrase": "first_part"}, {"score": 0.00481495049065317, "phrase": "umls_semantic_type"}, {"score": 0.004784565134881178, "phrase": "group_neighborhood_auditing"}, {"score": 0.004562676524864167, "phrase": "dynamic_methodology"}, {"score": 0.004149166224411185, "phrase": "previously_introduced_refined_semantic_network"}, {"score": 0.004109926210263146, "phrase": "refined_semantic_types"}, {"score": 0.004083996021811133, "phrase": "rst"}, {"score": 0.004007083686875716, "phrase": "search_space"}, {"score": 0.00398177607914381, "phrase": "offending_concepts"}, {"score": 0.003474575242120264, "phrase": "missing_assignments"}, {"score": 0.003409120890690851, "phrase": "second_part"}, {"score": 0.0032302647179383915, "phrase": "s's_other_rsts"}, {"score": 0.0031294568052050186, "phrase": "similar_way"}, {"score": 0.002937153116494391, "phrase": "methodology's_efficiency"}, {"score": 0.0026202187680903063, "phrase": "environmental_effect_of_humans"}, {"score": 0.0025954008219792337, "phrase": "governmental_or"}, {"score": 0.002554593261776586, "phrase": "emd"}, {"score": 0.0023152577218214804, "phrase": "emd_assignment"}, {"score": 0.0022006365282969454, "phrase": "proposed_auditing_methodology"}, {"score": 0.0021049977753042253, "phrase": "particular_semantic_type"}], "paper_keywords": [""], "paper_abstract": "Objective: Each Unified Medical Language System (UMLS) concept is assigned one or more semantic types (ST). A dynamic methodology for aiding an auditor in finding concepts that are missing the assignment of a given ST, S is presented. Design: The first part of the methodology exploits the previously introduced Refined Semantic Network and accompanying refined semantic types (RST) to help narrow the search space for offending concepts. The auditing is focused in a neighborhood surrounding the extent of an RST, T (of S) called an envelope, consisting of parents and children of concepts in the extent. The audit moves outward as long as missing assignments are discovered. In the second part, concepts not reached previously are processed and reassigned T as needed during the processing of S's other RSTs. The set of such concepts is expanded in a similar way to that in the first part. Measurements: The number of errors discovered is reported. To measure the methodology's efficiency, \"error hit rates\" (i.e., errors found in concepts examined) are computed. Results: The methodology was applied to three STs: Experimental Model of Disease (EMD), Environmental Effect of Humans, and Governmental or Regulatory Activity. The EMD experienced the most drastic change. For its RST \"EMD boolean AND Neoplastic Process\" (RST \"EMD\") with only 33 (31) original concepts, 915 (134) concepts were found by the first (second) part to be missing the EMD assignment. Changes to the other two STs were smaller. Conclusion: The results show that the proposed auditing methodology can help to effectively and efficiently identify concepts lacking the assignment of a particular semantic type.", "paper_title": "Expanding the Extent of a UMLS Semantic Type via Group Neighborhood Auditing", "paper_id": "WOS:000269755500016"}