{"auto_keywords": [{"score": 0.02246846748295754, "phrase": "misclassification_tests"}, {"score": 0.004672444473700524, "phrase": "clinical_cardiac_ultrasound_images"}, {"score": 0.004568326972997448, "phrase": "cardiac_ultrasound_images"}, {"score": 0.0038431888954930083, "phrase": "raw_transducer_signal"}, {"score": 0.0034332736827447654, "phrase": "simple_empirical_models"}, {"score": 0.003382017342396959, "phrase": "first-order_statistics"}, {"score": 0.0032571885279065126, "phrase": "gray_levels"}, {"score": 0.002953711377604328, "phrase": "commercial_ultrasound_machines"}, {"score": 0.0029095936591723645, "phrase": "clinical_settings"}, {"score": 0.002719055901632759, "phrase": "unimodal_scalable_family"}, {"score": 0.0026186324161493225, "phrase": "plausible_model"}], "paper_keywords": ["cardiac image analysis", " speckle probability density", " ultrasound segmentation"], "paper_abstract": "Segmenting cardiac ultrasound images requires a model for the statistics of speckle in the images. Although the statistics of speckle are well understood for the raw transducer signal, the statistics of speckle in the image are not. This paper evaluates simple empirical models for first-order statistics for the distribution of gray levels in speckle. The models are created by analyzing over 100 images obtained from commercial ultrasound machines in clinical settings. The data in the images suggests a unimodal scalable family of distributions as a plausible model. Four families of distributions (Gamma, Weibull, Normal, and Log-normal) are compared with the data using goodness-of-fit and misclassification tests. Attention is devoted to the analysis of artifacts in images and to the choice of goodness-of-fit and misclassification tests. The distribution of parameters of one of the models is investigated and priors for the distribution are suggested.", "paper_title": "Evaluation of four probability distribution models for speckle in clinical cardiac ultrasound images", "paper_id": "WOS:000241805900009"}