{"auto_keywords": [{"score": 0.0493811307095677, "phrase": "lama"}, {"score": 0.005592493167442278, "phrase": "action_costs"}, {"score": 0.00481495049065317, "phrase": "cost-based_anytime_planning"}, {"score": 0.004692766317526887, "phrase": "classical_planning_system"}, {"score": 0.004624337472244542, "phrase": "forward_search"}, {"score": 0.004234129588974058, "phrase": "planning_task"}, {"score": 0.0041418132064539185, "phrase": "planning_system"}, {"score": 0.004051501401100304, "phrase": "binary_state_variables"}, {"score": 0.004021835438784141, "phrase": "multi-heuristic_search"}, {"score": 0.0038909934410379775, "phrase": "landmark_heuristic"}, {"score": 0.0038061298318563925, "phrase": "well-known_ff_heuristic"}, {"score": 0.0036553070575015344, "phrase": "high-quality_solutions"}, {"score": 0.003562444653947001, "phrase": "non-uniform_cost"}, {"score": 0.003471933181807712, "phrase": "iteratively_decreasing_weights"}, {"score": 0.0033220706785945815, "phrase": "better_quality"}, {"score": 0.003213920601037463, "phrase": "best_performance"}, {"score": 0.0031437775259091794, "phrase": "sequential_satisficing_track"}, {"score": 0.002857041057269513, "phrase": "individual_results"}, {"score": 0.002733646947011804, "phrase": "good_and_bad_cases"}, {"score": 0.002502576987281976, "phrase": "heuristic_estimators"}, {"score": 0.0023335495163073544, "phrase": "far_more_problems"}, {"score": 0.0021049977753042253, "phrase": "synergy_effects"}], "paper_keywords": [""], "paper_abstract": "LAMA is a classical planning system based on heuristic forward search. Its core feature is the use of a pseudo-heuristic derived from landmarks, propositional formulas that must be true in every solution of a planning task. LAMA builds on the Fast Downward planning system, using finite-domain rather than binary state variables and multi-heuristic search. The latter is employed to combine the landmark heuristic with a variant of the well-known FF heuristic. Both heuristics are cost-sensitive, focusing on high-quality solutions in the case where actions have non-uniform cost. A weighted A* search is used with iteratively decreasing weights, so that the planner continues to search for plans of better quality until the search is terminated. LAMA showed best performance among all planners in the sequential satisficing track of the International Planning Competition 2008. In this paper we present the system in detail and investigate which features of LAMA are crucial for its performance. We present individual results for some of the domains used at the competition, demonstrating good and bad cases for the techniques implemented in LAMA. Overall, we find that using landmarks improves performance, whereas the incorporation of action costs into the heuristic estimators proves not to be beneficial. We show that in some domains a search that ignores cost solves far more problems, raising the question of how to deal with action costs more effectively in the future. The iterated weighted A* search greatly improves results, and shows synergy effects with the use of landmarks.", "paper_title": "The LAMA Planner: Guiding Cost-Based Anytime Planning with Landmarks", "paper_id": "WOS:000282279300002"}