{"auto_keywords": [{"score": 0.04814050608144561, "phrase": "research_articles"}, {"score": 0.00481495049065317, "phrase": "mendeley_user_categories"}, {"score": 0.004231705388787518, "phrase": "mendeley"}, {"score": 0.004039423410198574, "phrase": "different_types"}, {"score": 0.003956784357357341, "phrase": "clinical_medicine"}, {"score": 0.003441352119167824, "phrase": "phd_students"}, {"score": 0.0030872017736888113, "phrase": "medical_professionals"}, {"score": 0.0030396665931462, "phrase": "highest_correlations"}, {"score": 0.002977419551510206, "phrase": "mendeley_readership_counts"}, {"score": 0.0028273061946184645, "phrase": "academic_articles"}, {"score": 0.002769395841379498, "phrase": "associate_professors"}, {"score": 0.0026570998719084153, "phrase": "mendeley_readership"}, {"score": 0.00257586859792573, "phrase": "traditional_citation_impact"}, {"score": 0.0023346234464901978, "phrase": "citation_counts"}, {"score": 0.00226322835801988, "phrase": "mendeley_statistics"}, {"score": 0.0022053994402287925, "phrase": "hidden_impact"}, {"score": 0.002126907587540404, "phrase": "educational_value"}, {"score": 0.0021049977753042253, "phrase": "nonauthor_users"}], "paper_keywords": ["webometrics", " scientometrics"], "paper_abstract": "Little detailed information is known about who reads research articles and the contexts in which research articles are read. Using data about people who register in Mendeley as readers of articles, this article explores different types of users of Clinical Medicine, Engineering and Technology, Social Science, Physics, and Chemistry articles inside and outside academia. The majority of readers for all disciplines were PhD students, postgraduates, and postdocs but other types of academics were also represented. In addition, many Clinical Medicine articles were read by medical professionals. The highest correlations between citations and Mendeley readership counts were found for types of users who often authored academic articles, except for associate professors in some sub-disciplines. This suggests that Mendeley readership can reflect usage similar to traditional citation impact if the data are restricted to readers who are also authors without the delay of impact measured by citation counts. At the same time, Mendeley statistics can also reveal the hidden impact of some research articles, such as educational value for nonauthor users inside academia or the impact of research articles on practice for readers outside academia.", "paper_title": "Who Reads Research Articles? An Altmetrics Analysis of Mendeley User Categories", "paper_id": "WOS:000359021200007"}