{"auto_keywords": [{"score": 0.04174304445487645, "phrase": "mcp"}, {"score": 0.019782967624503146, "phrase": "home_range"}, {"score": 0.004751216062917875, "phrase": "ugandan_mountain_gorilla_data"}, {"score": 0.00448958076531243, "phrase": "home_range_measures"}, {"score": 0.004400705158735729, "phrase": "species'_behavioral_ecology"}, {"score": 0.004342430078306461, "phrase": "critical_information"}, {"score": 0.004313581307559327, "phrase": "biological_conservation"}, {"score": 0.0042281749832498, "phrase": "mountain_gorilla"}, {"score": 0.00420008247608218, "phrase": "gorilla"}, {"score": 0.004116913661033223, "phrase": "bwindi_impenetrable_national_park"}, {"score": 0.004008568312912331, "phrase": "minimum_convex_polygon"}, {"score": 0.003903063128339768, "phrase": "geographic_information_system"}, {"score": 0.0037750632698768704, "phrase": "field_data"}, {"score": 0.003687960013746783, "phrase": "potential_utility"}, {"score": 0.003651245743840663, "phrase": "new_home_range_modeling_method"}, {"score": 0.0031845067058084583, "phrase": "yearly_home_ranges"}, {"score": 0.0031422859551159506, "phrase": "distinctively_different_ranging_behavior"}, {"score": 0.003049318402401662, "phrase": "yearly_home_range"}, {"score": 0.0029101233953870466, "phrase": "locoh_ranges"}, {"score": 0.0025806029313384504, "phrase": "different_proportions"}, {"score": 0.002366017944545902, "phrase": "appropriate_home_range_model"}, {"score": 0.0023424328921363585, "phrase": "spatial_pattern"}], "paper_keywords": ["ranging behavior", " Bwindi Impenetrable National Park", " minimum convex polygon", " local convex hull", " home range modeling"], "paper_abstract": "Home range is the area over which animals traverse in the course of their normal daily activities. Home range measures are essential to understanding a species' behavioral ecology and can be critical information for biological conservation. In the realm of mountain gorilla (Gorilla beringei beringei) management at Bwindi Impenetrable National Park, home range is typically calculated using the minimum convex polygon (MCP) approach. However, geographic information system has enabled more robust measures of home range to be calculated from field data. In order to assess the potential utility of a new home range modeling method, local convex hull (LoCoH), we compared LoCoH home ranges with those derived from MCP for several different gorilla groups. First, we evaluated the sensitivity of each method to outliers. Second, we compared the size of yearly home ranges for groups with distinctively different ranging behavior. Third, we compared the proportion of yearly home range found outside the park for two different groups. As anticipated, we found that LoCoH ranges are smaller (similar to 50%) than MCP ranges, but contrary to expectation our data show that MCP is not more sensitive to outliers than LoCoH. Our comparison also illustrates that the two methods result in different proportions of home range found outside the park; overall, MCP had a tendency to underestimate relative to LoCoH. Our results illustrate the importance of selecting an appropriate home range model for the spatial pattern of the data being modeled, the environment and context where the data were collected, and the motivation of the research. Overall, we found LoCoH to be a more effective home range modeling method for mountain gorilla conservation management.", "paper_title": "A comparison of two home range modeling methods using Ugandan mountain gorilla data", "paper_id": "WOS:000311086500007"}