{"auto_keywords": [{"score": 0.04971075098097409, "phrase": "polygonal_fuzzy_sets"}, {"score": 0.027360214453784133, "phrase": "fuzzy_rules"}, {"score": 0.015719716506582538, "phrase": "ranking_values"}, {"score": 0.013542592252167876, "phrase": "characteristic_points"}, {"score": 0.011530030307415737, "phrase": "ranking_value"}, {"score": 0.008099647291517494, "phrase": "sparse_fuzzy_rule-based_systems"}, {"score": 0.00758666868671335, "phrase": "proposed_method"}, {"score": 0.005638745346680066, "phrase": "polygonal_fuzzy_set"}, {"score": 0.004509057381424944, "phrase": "new_fuzzy_interpolative_reasoning_method"}, {"score": 0.0038189638340666936, "phrase": "alpha-cut_operations"}, {"score": 0.0030401074516310184, "phrase": "antecedent_polygonal_fuzzy_set"}, {"score": 0.00292477450010107, "phrase": "fuzzy_rule"}, {"score": 0.002879872305061576, "phrase": "obtained_differences"}, {"score": 0.0027175263159330523, "phrase": "antecedent_polygonal_fuzzy_sets"}, {"score": 0.002644920521740564, "phrase": "obtained_characteristic_points"}, {"score": 0.002345944657572499, "phrase": "fuzzy_interpolative_reasoning_result"}, {"score": 0.002283243905993669, "phrase": "experimental_results"}, {"score": 0.00218807532188779, "phrase": "existing_methods"}, {"score": 0.002171202123281881, "phrase": "fuzzy_interpolative_reasoning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Fuzzy interpolative reasoning", " Fuzzy rules", " Sparse fuzzy rule-based systems", " Polygonal fuzzy sets", " Ranking values"], "paper_abstract": "In this paper, we propose a new fuzzy interpolative reasoning method for sparse fuzzy rule-based systems based on ranking values of polygonal fuzzy sets and automatically generated weights of fuzzy rules. First, the proposed method gets the characteristic points of the observation polygonal fuzzy sets and the characteristic points of the antecedent polygonal fuzzy sets of the fuzzy rules, respectively, by using the alpha-cut operations, respectively, where alpha is an element of [0, 1]. Then, it calculates the ranking value of each observation polygonal fuzzy set and the ranking value of each antecedent polygonal fuzzy set, respectively. Then, it calculates the difference between the ranking value of each observation polygonal fuzzy set and the ranking value of each antecedent polygonal fuzzy set. Then, it calculates the weight of each fuzzy rule based on the obtained differences between the ranking values of the observation polygonal fuzzy sets and the ranking values of the antecedent polygonal fuzzy sets. Then, based on the obtained characteristic points of the observation polygonal fuzzy sets, the obtained characteristic points of the antecedent polygonal fuzzy sets, and the obtained weights of the fuzzy rules, it gets the characteristic points of the fuzzy interpolative reasoning result represented by a polygonal fuzzy set. The experimental results show that the proposed method can overcome the drawbacks of the existing methods for fuzzy interpolative reasoning in sparse fuzzy rule-based systems. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Fuzzy interpolative reasoning based on ranking values of polygonal fuzzy sets and automatically generated weights of fuzzy rules", "paper_id": "WOS:000362380600032"}