{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multifractal_singularity_spectra"}, {"score": 0.004776297980616768, "phrase": "sampled_data"}, {"score": 0.0046621835537196754, "phrase": "physical_variables"}, {"score": 0.004624751696958501, "phrase": "scale_invariant_systems"}, {"score": 0.004406360418456518, "phrase": "underlying_fractal"}, {"score": 0.004370973501074594, "phrase": "multifractal_structure"}, {"score": 0.004164516065972361, "phrase": "appropriate_methods"}, {"score": 0.004032302251481604, "phrase": "confidence_degree"}, {"score": 0.003810909603178837, "phrase": "different_techniques"}, {"score": 0.003765067028482197, "phrase": "multifractal_analysis"}, {"score": 0.003515479934694842, "phrase": "modulus_maxima"}, {"score": 0.003114584448820957, "phrase": "singularity_spectra"}, {"score": 0.0030895394261534776, "phrase": "multifractal_signals"}, {"score": 0.0025761937402886954, "phrase": "gmwp_method"}, {"score": 0.0025145109881926143, "phrase": "best_performance"}, {"score": 0.0024842242921857705, "phrase": "reliable_estimates"}, {"score": 0.002272964710550345, "phrase": "right_tail"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["fractals", " multifractals", " wavelets", " singularity analysis", " numerical methods", " WTMM"], "paper_abstract": "Physical variables in scale invariant systems often show chaotic, turbulent-like behavior, commonly associated to the existence of an underlying fractal or multifractal structure. However, the assessment of multifractality over experimental, discretized data requires of appropriate methods and to establish criteria to measure the confidence degree on the estimates. In this paper we have evaluated the quality of different techniques used for multifractal analysis. We have tested four different techniques: the moment (M) method, the wavelet transform modulus maxima (WTMM) method, the gradient modulus wavelet projection (GMWP) method and the gradient histogram (GH) method, which are used to estimate the singularity spectra of multifractal signals. The test consists in analyzing synthetic multifractal ID signals with given multifractal spectrum. We have compared the results, studying the sensibility of each method to the length of the series, size of the ensemble and type of spectrum. Our results show that GMWP method is the one attaining the best performance, providing reliable estimates which can be improved when the statistics is increased. All the other methods are affected by problems such as the linearization of the right tail of the spectrum, and some of them are very demanding in data. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Numerical methods for the estimation of multifractal singularity spectra on sampled data: A comparative study", "paper_id": "WOS:000237911000019"}