{"auto_keywords": [{"score": 0.027381144993037943, "phrase": "speech_recognition"}, {"score": 0.011476045403056544, "phrase": "ranking_distance"}, {"score": 0.009749810401152387, "phrase": "conventional_methods"}, {"score": 0.00481495049065317, "phrase": "intelligent_system"}, {"score": 0.0047846807459660376, "phrase": "information_technologies"}, {"score": 0.004626412128454998, "phrase": "information_devices"}, {"score": 0.004597322176624058, "phrase": "new_consumer_electronics"}, {"score": 0.004473355219942553, "phrase": "apple's_innovation"}, {"score": 0.00445458102342887, "phrase": "human-computer_interaction"}, {"score": 0.004371064158343562, "phrase": "ipod"}, {"score": 0.004334549044705742, "phrase": "sin"}, {"score": 0.0042531712404354095, "phrase": "typical_application"}, {"score": 0.004235317201291115, "phrase": "machine-learning_human-computer_interaction"}, {"score": 0.004121071308160911, "phrase": "gesture_recognition"}, {"score": 0.004103769515111558, "phrase": "speaker_recognition"}, {"score": 0.004077952371690825, "phrase": "product_recommendation_systems"}, {"score": 0.004043780961640122, "phrase": "existing_learning_algorithms"}, {"score": 0.003993057835864345, "phrase": "large_quantity"}, {"score": 0.003926411437309484, "phrase": "improved_learning"}, {"score": 0.0038446594916982215, "phrase": "ranking_data"}, {"score": 0.0038285137171597382, "phrase": "multiple_stages"}, {"score": 0.0038044216149605743, "phrase": "multistageboost_algorithm"}, {"score": 0.003772533587549841, "phrase": "existing_algorithms"}, {"score": 0.0036784583549599025, "phrase": "small_quantities"}, {"score": 0.0036476222647061243, "phrase": "boosting_algorithm"}, {"score": 0.0036246643358397272, "phrase": "faster_ranking_performance"}, {"score": 0.00357165418387663, "phrase": "original_binary_classification"}, {"score": 0.003526832204466656, "phrase": "fuzzily_weighted_membership"}, {"score": 0.003108320246757783, "phrase": "top_ones"}, {"score": 0.0029551255041250475, "phrase": "pair-wise_ranking_approach"}, {"score": 0.00286322585647695, "phrase": "different_weights"}, {"score": 0.0026097709055659273, "phrase": "ndcg."}, {"score": 0.002378697397220876, "phrase": "recognition_optimization_procedures"}, {"score": 0.0023290951071300433, "phrase": "recognition_rate"}, {"score": 0.0023046822999287994, "phrase": "personal_computing_device"}, {"score": 0.002294988811077664, "phrase": "industrial_personal_computer"}, {"score": 0.0022471281401375263, "phrase": "voice_management_system"}, {"score": 0.0022049056269515255, "phrase": "voice_response_questionnaire"}, {"score": 0.0021049977753042253, "phrase": "virtual_customer_service_person"}], "paper_keywords": ["Human computer interaction", " Boosting algorithm", " Pair-wise ranking", " Recommendation system", " Speech recognition"], "paper_abstract": "As information technologies advance and user-friendly interfaces develop, the interaction between humans and computers, information devices, and new consumer electronics is increasingly gaining attention. One example that most people can relate to is Apple's innovation in human-computer interaction which has been used on many products such as iPod and iPhone. Sin, the intelligent personal assistant, is a typical application of machine-learning human-computer interaction. Algorithms in machine learning have been employed in many disciplines, including gesture recognition, speaker recognition, and product recommendation systems. While the existing learning algorithms compute and learn from a large quantity of data, this study proposes an improved learning to rank algorithm named MultiStageBoost. In addition to ranking data through multiple stages, the MultiStageBoost algorithm significantly improves the existing algorithms in two ways. Firstly, it classifies and filters data to small quantities and applies the Boosting algorithm to achieve faster ranking performance. Secondly, it enhances the original binary classification by using the reciprocal of fuzzily weighted membership as the ranking distance. The importance of data is revealed in their ranked positions. Usually data ranked in the front are given more attention than those ranked in the middle. For example, after ranking 10,000 pieces of data, the top 10, or at most 100, are the most important and relevant. Whether the data after the top ones are ranked precisely does not really matter. Due to this reason, this study has made improvement on the conventional methods of the pair-wise ranking approach. Not only are data classified and ranked binarily, they are also given different weights depending on whether they are concordant or discordant. Incorporating the concept of weighting into the ranking distance allows us to increase the precision of ranking. Results from experiments demonstrate that our proposed algorithm outperforms the conventional methods in three evaluation measures: P@n, MAP, and NDCG. MultiStageBoost was then applied to speech recognition. However, we do not aim to improve the technology of speech recognition, but simply hope to provide evidences that MultiStageBoost can be used in the classification and ranking in speech recognition. Experiments show that the recognition optimization procedures established by this study are able to increase the recognition rate to over 95% in the personal computing device and industrial personal computer. It is expected that in the future this voice management system will accurately and effectively identify speakers answering the voice response questionnaire and will successfully carry out the functions in the choice of answers, paying the way for the formation of a virtual customer service person. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A multi-stage learning framework for intelligent system", "paper_id": "WOS:000316581300006"}