{"auto_keywords": [{"score": 0.015556930206334117, "phrase": "genetic_programming"}, {"score": 0.00481495049065317, "phrase": "financial_data"}, {"score": 0.00471465954562773, "phrase": "classification_and_regression_tasks"}, {"score": 0.004592214823540993, "phrase": "constructive_induction"}, {"score": 0.004449452743965974, "phrase": "high-quality_attributes"}, {"score": 0.00433386573276633, "phrase": "machine_learning"}, {"score": 0.004133292222875435, "phrase": "ci_method"}, {"score": 0.0032954888655173666, "phrase": "original_one"}, {"score": 0.0030935140058168885, "phrase": "classification_tasks"}, {"score": 0.002828331235643921, "phrase": "classification_and_regression_problems"}, {"score": 0.002531909865957984, "phrase": "gp"}, {"score": 0.0023146962503449186, "phrase": "second_one"}, {"score": 0.0022783523466965187, "phrase": "ipo_underpricing_prediction_domain"}, {"score": 0.0021049977753042253, "phrase": "competitive_results"}], "paper_keywords": [""], "paper_abstract": "The use of Constructive Induction (CI) methods for the generation of high-quality attributes is a very important issue in Machine Learning. In this paper, we present a CI method based in Genetic Programming (GP). This method is able to evolve projections that transform the dataset, constructing a new coordinates space in which the data can be more easily predicted. This coordinates space can be smaller than the original one, achieving two main goals at the same time: on one hand, improving classification tasks; on the other hand, reducing dimensionality of the problem. Also, our method can handle classification and regression problems. We have tested our approach in two financial prediction problems because their high dimensionality is very appropriate for our method. In the first one, GP is used to tackle prediction of bankruptcy of companies (classification problem). In the second one, an IPO Underpricing prediction domain (a classical regression problem) is confronted. Our method obtained in both cases competitive results and, in addition, it drastically reduced dimensionality of the problem.", "paper_title": "Projecting financial data using genetic programming in classification and regression tasks", "paper_id": "WOS:000237227900018"}