{"auto_keywords": [{"score": 0.026067145876595005, "phrase": "arbitrary_networks"}, {"score": 0.01023151965455642, "phrase": "exploration_problem"}, {"score": 0.007648066376126319, "phrase": "initial_configurations"}, {"score": 0.00481495049065317, "phrase": "deterministic_network_exploration"}, {"score": 0.004780334370089564, "phrase": "anonymous_silent_agents"}, {"score": 0.004745965928357563, "phrase": "local_traffic_reports"}, {"score": 0.0046276016230633495, "phrase": "unknown_number"}, {"score": 0.004594326191526569, "phrase": "mobile_agents"}, {"score": 0.004544859094594241, "phrase": "different_nodes"}, {"score": 0.004495922204117959, "phrase": "unknown_network"}, {"score": 0.0044314880575692175, "phrase": "different_times"}, {"score": 0.003877404180794398, "phrase": "synchronous_rounds"}, {"score": 0.0035942114996235803, "phrase": "visited_nodes"}, {"score": 0.0034666972896389777, "phrase": "additional_information"}, {"score": 0.003380129564214184, "phrase": "arbitrary_network"}, {"score": 0.0029571101238632783, "phrase": "node_nu"}, {"score": 0.0025405463228033486, "phrase": "small_amount"}, {"score": 0.0023804491500749106, "phrase": "deterministic_terminating_exploration_algorithm"}, {"score": 0.002198380879018061, "phrase": "different_views"}, {"score": 0.002127965733093433, "phrase": "polynomial_time"}], "paper_keywords": ["Deterministic algorithm", " anonymous mobile agents", " exploration", " graphs", " network"], "paper_abstract": "A team consisting of an unknown number of mobile agents starting from different nodes of an unknown network, possibly at different times, have to explore the network: Every node must be visited by at least one agent, and all agents must eventually stop. Agents are anonymous (identical), execute the same deterministic algorithm, and move in synchronous rounds along links of the network. They are silent: They cannot send any messages to other agents or mark visited nodes in any way. In the absence of any additional information, exploration with termination of an arbitrary network in this model, devoid of any means of communication between agents, is impossible. Our aim is to solve the exploration problem by giving to agents very restricted local traffic reports. Specifically, an agent that is at a node nu in a given round is provided with three bits of information answering the following questions: Am I alone at nu? Did any agent enter nu in this round? Did any agent exit v in this round? We show that this small amount of information permits us to solve the exploration problem in arbitrary networks. More precisely, we give a deterministic terminating exploration algorithm working in arbitrary networks for all initial configurations that are not perfectly symmetric; that is, in which there are agents with different views of the network. The algorithm works in polynomial time in the (unknown) size of the network. A deterministic terminating exploration algorithm working for all initial configurations in arbitrary networks does not exist.", "paper_title": "Deterministic Network Exploration by Anonymous Silent Agents with Local Traffic Reports", "paper_id": "WOS:000345574900003"}