{"auto_keywords": [{"score": 0.04219097367734987, "phrase": "cognitive_map"}, {"score": 0.00481495049065317, "phrase": "neural_network_model"}, {"score": 0.0047267100475487595, "phrase": "spatial_and_temporal_components"}, {"score": 0.00428257928723, "phrase": "sensory_events"}, {"score": 0.004204054047427536, "phrase": "prefrontal_cortex"}, {"score": 0.0037621210719690594, "phrase": "latent_learning"}, {"score": 0.003693103542455806, "phrase": "optimal_actions"}, {"score": 0.003145417398038261, "phrase": "spatial_and_temporal_knowledge"}, {"score": 0.0029027394930867902, "phrase": "continuous_place_navigation_task"}, {"score": 0.002728847267539957, "phrase": "unmarked_goal"}, {"score": 0.0023819914954155905, "phrase": "spatial_and_timing_prediction"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hippocampus", " Prefrontal cortex", " Navigation", " Timing"], "paper_abstract": "We present a neural network model where the spatial and temporal components of a task are merged and learned in the hippocampus as chains of associations between sensory events. The prefrontal cortex integrates this information to build a cognitive map representing the environment. The cognitive map can be used after latent learning to select optimal actions to fulfill the goals of the animal. A simulation of the architecture is made and applied to learning and solving tasks that involve both spatial and temporal knowledge. We show how this model can be used to solve the continuous place navigation task, where a rat has to navigate to an unmarked goal and wait for 2 seconds without moving to receive a reward. The results emphasize the role of the hippocampus for both spatial and timing prediction, and the prefrontal cortex in the learning of goals related to the task. (c) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The hippocampo-cortical loop: Spatio-temporal learning and goal-oriented planning in navigation", "paper_id": "WOS:000319237700002"}