{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "electronic_health_records"}, {"score": 0.008610073208843475, "phrase": "prior_information"}, {"score": 0.0045320819060445045, "phrase": "prior_clinical_information"}, {"score": 0.004499910169464113, "phrase": "observable_effects"}, {"score": 0.004389089062127892, "phrase": "emergency_departments"}, {"score": 0.004220406575749275, "phrase": "resource_utilization"}, {"score": 0.004145882022189891, "phrase": "retrospective_observational_studies"}, {"score": 0.003544088803300751, "phrase": "ed_orders"}, {"score": 0.00332375606483146, "phrase": "marital_status"}, {"score": 0.003265012781840765, "phrase": "acuity_level"}, {"score": 0.0032302647179383915, "phrase": "ed._results"}, {"score": 0.002830839166653185, "phrase": "ehr_patients"}, {"score": 0.002683304054823427, "phrase": "patient_ed_los"}, {"score": 0.0025892330566358503, "phrase": "demonstrable_impact"}, {"score": 0.0024108455980729284, "phrase": "significant_results"}, {"score": 0.002342972434255588, "phrase": "reduced_utilization"}, {"score": 0.002326304140277375, "phrase": "better_outcomes"}, {"score": 0.0022933216359142736, "phrase": "ehr_patients'_ed_los"}, {"score": 0.0021582723621960693, "phrase": "valuable_adjunct"}, {"score": 0.002120083747913758, "phrase": "diabetes_patients"}, {"score": 0.0021049977753042253, "phrase": "ed_settings"}], "paper_keywords": [""], "paper_abstract": "Objective To evaluate if electronic health records (EHR) with prior clinical information have observable effects for patients with diabetes presenting to emergency departments (ED), we examined measures of quality and resource utilization. Materials and methods Retrospective observational studies of patients in three ED (A=5510; B=4393; C=3324) were conducted comparing patients with prior information in the EHR to those without such information. Differences with respect to hospitalization, mortality, length of stay (LOS), and numbers of ED orders for tests, procedures and medications were examined after adjusting for age, gender, race, marital status, comorbidities and for acuity level within each ED. Results There were 7% fewer laboratory test orders at one ED and 3% fewer at another; fewer diagnostic procedures were performed at two of the sites. At one site 36% fewer medications were ordered. The odds of being hospitalized were lower for EHR patients at one site and hospital LOS was shorter at two of the sites. EHR patient ED LOS was 18% longer at one site. There was no demonstrable impact of an EHR on mortality. Results varied in magnitude and direction by site. Discussion The pattern of significant results varied by ED but tended to reveal reduced utilization and better outcomes for patients although EHR patients' ED LOS was longer at one site. Conclusions The presence of prior information in an EHR may be a valuable adjunct in the care of diabetes patients in ED settings but the pattern of impact may vary from ED to ED.", "paper_title": "The impact of electronic health records on people with diabetes in three different emergency departments", "paper_id": "WOS:000337672800012"}