{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "social_tagging"}, {"score": 0.04906009284763669, "phrase": "controlled_indexing"}, {"score": 0.01016789379806262, "phrase": "medical_subject_headings"}, {"score": 0.008102469484009125, "phrase": "citeulike_tags"}, {"score": 0.00703268184016045, "phrase": "common_annotations"}, {"score": 0.0045726216767108556, "phrase": "citeulike"}, {"score": 0.004323776691055635, "phrase": "information_resources"}, {"score": 0.004249957578636515, "phrase": "increasing_popularity"}, {"score": 0.003865826699096508, "phrase": "degree_social_tagging"}, {"score": 0.003501175642882274, "phrase": "medline."}, {"score": 0.003441352119167824, "phrase": "descriptive_analyses"}, {"score": 0.0033971539563683174, "phrase": "data_sets"}, {"score": 0.003324743991757282, "phrase": "paper-by-paper_analysis"}, {"score": 0.0032680389354475706, "phrase": "mesh"}, {"score": 0.0027861630854233693, "phrase": "lexical_differences"}, {"score": 0.0025780912201045555, "phrase": "paper-by-paper_basis"}, {"score": 0.0023650305205893353, "phrase": "increased_levels"}, {"score": 0.0023447155524245655, "phrase": "text_processing"}, {"score": 0.0021695394558562927, "phrase": "mesh_terms"}], "paper_keywords": ["knowledge representation", " automatic taxonomy generation", " automatic indexing"], "paper_abstract": "Social tagging and controlled indexing both facilitate access to information resources. Given the increasing popularity of social tagging and the limitations of controlled indexing (primarily cost and scalability), it is reasonable to investigate to what degree social tagging could substitute for controlled indexing. In this study, we compared CiteULike tags to Medical Subject Headings (MeSH) terms for 231,388 citations indexed in MEDLINE. In addition to descriptive analyses of the data sets, we present a paper-by-paper analysis of tags and MeSH terms: the number of common annotations, Jaccard similarity, and coverage ratio. In the analysis, we apply three increasingly progressive levels of text processing, ranging from normalization to stemming, to reduce the impact of lexical differences. Annotations of our corpus consisted of over 76,968 distinct tags and 21,129 distinct MeSH terms. The top 20 tags/MeSH terms showed little direct overlap. On a paper-by-paper basis, the number of common annotations ranged from 0.29 to 0.5 and the Jaccard similarity from 2.12% to 3.3% using increased levels of text processing. At most, 77,834 citations (33.6%) shared at least one annotation. Our results show that CiteULike tags and MeSH terms are quite distinct lexically, reflecting different viewpoints/processes between social tagging and controlled indexing.", "paper_title": "Social tagging is no substitute for controlled indexing: A comparison of Medical Subject Headings and CiteULike tags assigned to 231,388 papers", "paper_id": "WOS:000307730000004"}