{"auto_keywords": [{"score": 0.010612387000973441, "phrase": "sampled_sinusoidal_signals"}, {"score": 0.006435318866952439, "phrase": "least-square_method"}, {"score": 0.004610058444728656, "phrase": "new_four_parameter_estimator"}, {"score": 0.004176102823067887, "phrase": "sinusoidal_signals"}, {"score": 0.0034537189001268113, "phrase": "fixed_sampling_interval"}, {"score": 0.0034264854489231148, "phrase": "analytical_expressions"}, {"score": 0.003319675107116333, "phrase": "signal_differences"}, {"score": 0.003115908199991072, "phrase": "n_data_samples"}, {"score": 0.0028786467218197245, "phrase": "proposed_algorithm"}, {"score": 0.0028222016727557087, "phrase": "initial_guess"}, {"score": 0.002723367507064405, "phrase": "convergence_problem"}, {"score": 0.002648889316519512, "phrase": "required_numerical_operations"}, {"score": 0.0024960634897058394, "phrase": "processing_time"}, {"score": 0.0024763626300729575, "phrase": "parameter_estimation"}, {"score": 0.0023613726075968986, "phrase": "numerical_simulations"}, {"score": 0.0022606512324475584, "phrase": "estimation_error"}, {"score": 0.0022339335462778437, "phrase": "estimated_parameters"}, {"score": 0.002138636271204459, "phrase": "signal_to_noise_ratio"}], "paper_keywords": ["frequency estimation", " phase estimation", " Cramer-Rao bound", " IEEE-1057", " least square method"], "paper_abstract": "In this paper, we present a new four parameter estimator of sampled sinusoidal signals that does not require iteration. Mathematically, the four parameters (frequency, phase, magnitude, and dc offset) of sinusoidal signals can be obtained when four data points are given. In general, the parameters have to be calculated with iteration since the equations are nonlinear. In this paper, we point out that the four parameters can be obtained analytically if the four data points given are measured using a fixed sampling interval. Analytical expressions for the four parameters are derived using the signal differences. Based on this analysis, we suggest an algorithm of estimating the four parameters from N data samples corrupted by noise without iteration. When comparing with the IEEE-1057 method which is based on the least-square method, the proposed algorithm does not require the initial guess of the parameters for iteration and avoid the convergence problem. Also, the number of required numerical operations for estimation is fixed if N is determined. As a result, the processing time of parameter estimation is much faster than the least-square method which has been confirmed by numerical simulations. Simulation results and the quantitative analysis show that the estimation error of the estimated parameters is less than 1.2 times the square root of the Cramer-Rao bounds when the signal to noise ratio is larger than 20 dB.", "paper_title": "A New Four Parameter Estimator of Sampled Sinusoidal Signals without Iteration", "paper_id": "WOS:000331343200027"}