{"auto_keywords": [{"score": 0.03627761857457256, "phrase": "service_provision"}, {"score": 0.012555757904981884, "phrase": "ws-agreement_specification"}, {"score": 0.00481495049065317, "phrase": "dynamic_slas"}, {"score": 0.0047662895631964495, "phrase": "service_oriented_environments"}, {"score": 0.004670431171164122, "phrase": "service_oriented_architectures"}, {"score": 0.0046389067165295466, "phrase": "different_administrative_domains"}, {"score": 0.004592016716046632, "phrase": "service_providers"}, {"score": 0.004545598514506788, "phrase": "effective_mechanisms"}, {"score": 0.0044844333655153605, "phrase": "resource_management"}, {"score": 0.004247858437831649, "phrase": "service_provisioning"}, {"score": 0.004219174171937721, "phrase": "service_level_agreements"}, {"score": 0.004190696487010649, "phrase": "sla"}, {"score": 0.003916098498242888, "phrase": "service_provider"}, {"score": 0.0038764861784138117, "phrase": "service_consumer"}, {"score": 0.0036594395622282358, "phrase": "qos_level"}, {"score": 0.0035135619115963627, "phrase": "committed_agreement"}, {"score": 0.003249966782844541, "phrase": "signing_party"}, {"score": 0.0027804579695873827, "phrase": "final_service"}, {"score": 0.002687702958515561, "phrase": "single_sla."}, {"score": 0.0025717199672018304, "phrase": "possible_needs"}, {"score": 0.0023465400668244386, "phrase": "new_functionality"}, {"score": 0.002148315508445588, "phrase": "typical_scenario"}, {"score": 0.0021337783230121286, "phrase": "service_composition"}], "paper_keywords": ["Service level agreement (SLA)", " Service composition", " Negotiation", " SOA", " Grid"], "paper_abstract": "The increasing adoption of service oriented architectures across different administrative domains, forces service providers to use effective mechanisms and strategies of resource management in order for them to be able to guarantee the quality levels their customers demands during service provisioning. Service level agreements (SLA) are the most common mechanism used to establish agreements on the quality of a service (QoS) between a service provider and a service consumer. The WS-Agreement specification, developed by the Open Grid Forum, is a Web Service protocol to establish agreements on the QoS level to be guaranteed in the provision of a service. The committed agreement cannot be modified during service provision and is effective until all activities pertaining to it are finished or until one of the signing party decides to terminate it. In B2B scenarios where several service providers are involved in the composition of a service. and each of them plays both the parts of provider and customer, several one-to-one SLAs need to be signed. In such a rigid context the global QoS of the final service can be strongly affected by any violation on each single SLA. In order to prevent such violations, SLAs need to adapt to any possible needs that might come up during service provision. In this work we focus on the WS-Agreement specification and propose to enhance the flexibility of its approach. We integrate new functionality to the protocol that enable the parties of a WS-Agreement to re-negotiate and modify its terms during the service provision, and show how a typical scenario of service composition can benefit from our proposal. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Dynamic SLAs management in service oriented environments", "paper_id": "WOS:000265318300003"}