{"auto_keywords": [{"score": 0.04879257974669139, "phrase": "software-defined_vehicular_networks"}, {"score": 0.041712156789843864, "phrase": "inter-contact_time"}, {"score": 0.00481495049065317, "phrase": "communication_contacts"}, {"score": 0.004417012437860011, "phrase": "road-side_unit"}, {"score": 0.004259418153299952, "phrase": "network_efficiency"}, {"score": 0.004088807948906792, "phrase": "delivery_ratio"}, {"score": 0.0040334640350288, "phrase": "highly_reliable_transmission"}, {"score": 0.0030429511467945525, "phrase": "operational_taxies"}, {"score": 0.0030154062744601096, "phrase": "shanghai"}, {"score": 0.0028422946420821075, "phrase": "taxi-intersection_pairs"}, {"score": 0.0026548344763838213, "phrase": "small_value"}, {"score": 0.0025137856138000014, "phrase": "exponential_decay_model"}, {"score": 0.0024129269611844794, "phrase": "exponential_model"}, {"score": 0.0021731423856364003, "phrase": "exponential_decay"}, {"score": 0.0021049977753042253, "phrase": "future_study"}], "paper_keywords": ["Software-defined networks", " Vehicular networks", " Communication contact", " Performance modelling"], "paper_abstract": "In software-defined vehicular networks, a centralized controller in the network through the road-side unit will greatly promote the efficiency of the network efficiency by temporarily storing the packets, improving the delivery ratio and providing highly reliable transmission. The inter-contact time between moving vehicles and intersections, and the duration of each contact are two key metrics in the designing and evaluating of this kind of software-defined vehicular networks, because they decide the frequency of contacts between vehicles and the intersections and how much data can be sent during the contact. In this paper, we analyze traces of thousands of operational taxies in Shanghai. By studying the inter-contact time and the duration of each contact between taxi-intersection pairs, we find that the distribution of inter-contact time follows a power-law up to a small value and decays exponentially afterwards. We find that a power-law with exponential decay model can approximate the distribution of inter-contact time better than exponential model, power law model and piecewise exponential decay model. The duration of contacts, on the other hand, mainly exhibits an exponential decay. Our findings make way for the future study of and the deployment of software-defined vehicular networks.", "paper_title": "The Characterizes of Communication Contacts Between Vehicles and Intersections for Software-Defined Vehicular Networks", "paper_id": "WOS:000350570600010"}