{"auto_keywords": [{"score": 0.0456315961504987, "phrase": "hospital_workers"}, {"score": 0.00481495049065317, "phrase": "context-aware_hospital_applications"}, {"score": 0.004642604455537883, "phrase": "pervasive_networks"}, {"score": 0.004567990533989851, "phrase": "convenient_settings"}, {"score": 0.004476399615305783, "phrase": "context-aware_applications"}, {"score": 0.004281284532043714, "phrase": "contextual_variables"}, {"score": 0.00342568771304873, "phrase": "workplace_study"}, {"score": 0.003289534854212415, "phrase": "detailed_observation"}, {"score": 0.003210446135114967, "phrase": "contextual_information"}, {"score": 0.0028425481299483254, "phrase": "back_propagation_neural_network"}, {"score": 0.0028081546657056948, "phrase": "hospital_workers_activities"}, {"score": 0.002740607717745287, "phrase": "clinical_case_assessment"}, {"score": 0.0027184540871935284, "phrase": "patient_care"}, {"score": 0.002674681176379472, "phrase": "information_management"}, {"score": 0.002537216271965659, "phrase": "user_activity"}, {"score": 0.0022281257694320433, "phrase": "activity-aware_applications"}, {"score": 0.0021922308351126746, "phrase": "recent_advances"}, {"score": 0.0021745003291048356, "phrase": "pervasive_and_networking_technologies"}], "paper_keywords": ["activity estimation", " context-aware computing", " hospital activities", " neural networks"], "paper_abstract": "Hospitals are convenient settings for the deployment of context-aware applications. The information needs of hospital workers are highly dependent on contextual variables, such as location, role and activity. While some of these parameters can be easily determined, others, such as activity are much more complex to estimate. This paper describes an approach to estimate the activity being performed by hospital workers. The approach is based on information gathered from a workplace study conducted in a hospital, in which 196 It of detailed observation of hospital workers was recorded. Contextual information, such as the location of hospital workers, artifacts being used, the people with whom they collaborate and the time of the day, is used to train a back propagation neural network to estimate hospital workers activities. The activities estimated include clinical case assessment, patient care, preparation, information management, coordination and classes and certification. The results indicate that the user activity can be correctly estimated 75% of the time (on average) which is good enough for several applications. We discuss how these results can be used in the design of activity-aware applications, arguing that recent advances in pervasive and networking technologies hold great promises for the deployment of such applications.", "paper_title": "Activity recognition for context-aware hospital applications: Issues and opportunities for the deployment of pervasive networks", "paper_id": "WOS:000249395400005"}