{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bayesian_belief_networks"}, {"score": 0.026630859905305275, "phrase": "conditional_probability_tables"}, {"score": 0.0046857508651690916, "phrase": "bayesian_technologies"}, {"score": 0.004452731043379068, "phrase": "agent-based_decision_support_system"}, {"score": 0.004260134699483774, "phrase": "funded_project"}, {"score": 0.004216880725292, "phrase": "smart_decision_support_systems"}, {"score": 0.004075834722188658, "phrase": "important_factor"}, {"score": 0.004048194450210347, "phrase": "successful_military_missions"}, {"score": 0.004020740863986328, "phrase": "information_superiority"}, {"score": 0.0037818557818203188, "phrase": "information_overload"}, {"score": 0.0036305081978734127, "phrase": "information_related_capabilities"}, {"score": 0.0035571129372263532, "phrase": "operational_effects"}, {"score": 0.003520971639466546, "phrase": "operational_tempo"}, {"score": 0.003278024877215369, "phrase": "operational_situations"}, {"score": 0.003244709961388234, "phrase": "efficient_information_fusion"}, {"score": 0.0029697800659975668, "phrase": "csf"}, {"score": 0.002949598537993663, "phrase": "bbn_technology"}, {"score": 0.0029096837584084182, "phrase": "based_paradigm"}, {"score": 0.002831462722290752, "phrase": "military_missions"}, {"score": 0.002453934333239467, "phrase": "prior_knowledge"}, {"score": 0.002429128356484722, "phrase": "bbn"}, {"score": 0.00226892463779702, "phrase": "network_increases"}, {"score": 0.0021928902836049363, "phrase": "automated_configuration"}, {"score": 0.002163193271881447, "phrase": "hard_data"}, {"score": 0.002126635713519051, "phrase": "military_operational_scenarios"}, {"score": 0.0021049977753042253, "phrase": "computer_generated_forces"}], "paper_keywords": [""], "paper_abstract": "This paper outlines the application of Bayesian technologies to CSF (Critical Success Factor) assessment for parsimonious military decision making using an agent-based decision support system. ne research referred to in this paper is part of a funded project concerned with Smart Decision Support Systems (SDSS) within the General Dynamics led Data and Information Fusion Defence Technology Centre Consortium in the UK. An important factor for successful military missions is information superiority (IS). However, IS is not solely about minimising information related needs to avoid information overload and the reduction of bandwidth. It is concerned with creating information related capabilities that are aligned with achieving operational effects and raising operational tempo. Moreover good military decision making, agent based or otherwise, should take into account the uncertainty inherent in operational situations. While efficient information fusion may be achieved through the deployment of CSFs, Bayesian Belief Networks (BBNs) are employed to model uncertainty. This paper illustrates the application of CSF enabled BBN technology through an agent based paradigm for assessing the likelihood of success of military missions. BBNs are composed of two parts the quantitative and the qualitative. The former models the dependencies between the various random events and the latter the prior domain knowledge embedded in the network in the form of conditional probability tables (CPTs). Modelling prior knowledge in a BBN is a complex and time consuming task and sometimes intractable when the number of nodes and states of the network increases. This paper describes a method that enables the automated configuration of conditional probability tables from hard data generated from simulations of military operational scenarios using a computer generated forces (CGF) synthetic environment.", "paper_title": "Agent-based parsimonious decision support paradigm employing Bayesian belief networks", "paper_id": "WOS:000237044300003"}