{"auto_keywords": [{"score": 0.04675404263653011, "phrase": "laplacian_pyramid"}, {"score": 0.00481495049065317, "phrase": "robust_and_fast_image_denoising_method"}, {"score": 0.004023120753104693, "phrase": "redundancy_property"}, {"score": 0.003857871979942733, "phrase": "non-local_means"}, {"score": 0.003789137457228946, "phrase": "level_image"}, {"score": 0.0035473867669654174, "phrase": "image_features"}, {"score": 0.0031465436619697385, "phrase": "spatial_position"}, {"score": 0.0024311346712789553, "phrase": "accelerating_algorithm"}, {"score": 0.0022895278869126848, "phrase": "algorithm_-_similarity_computation"}, {"score": 0.0021049977753042253, "phrase": "original_non-local_means"}], "paper_keywords": ["image denoising", " non-local means", " Laplacian pyramid", " summed square image", " FFT"], "paper_abstract": "In the paper, we propose a robust and fast image denoising method. The approach integrates both Non-Local means algorithm and Laplacian Pyramid. Given an image to be denoised, we first decompose it into Laplacian pyramid. Exploiting the redundancy property of Laplacian pyramid, we then perform non-local means on every level image of Laplacian pyramid. Essentially, we use the similarity of image features in Laplacian pyramid to act as weight to denoise image. Since the features extracted in Laplacian pyramid are localized in spatial position and scale, they are much more able to describe image, and computing the similarity between them is more reasonable and more robust. Also, based on the efficient Summed Square Image (SSI) scheme and Fast Fourier Transform (FFT), we present an accelerating algorithm to break the bottleneck of non-local means algorithm - similarity computation of compare windows. After speedup, our algorithm is fifty times faster than original non-local means algorithm. Experiments demonstrated the effectiveness of our algorithm.", "paper_title": "A robust and fast non-local means algorithm for image denoising", "paper_id": "WOS:000254050000012"}