{"auto_keywords": [{"score": 0.03461617249114155, "phrase": "single_source_patterns"}, {"score": 0.00481495049065317, "phrase": "single-view_patterns"}, {"score": 0.004565876339189493, "phrase": "existing_multi-view_learning"}, {"score": 0.004512294927751344, "phrase": "mvl"}, {"score": 0.004228577663320847, "phrase": "multiple_information_sources"}, {"score": 0.003986103192038901, "phrase": "usual_single-view_learning"}, {"score": 0.003626626504149897, "phrase": "existing_mvl"}, {"score": 0.003338690782620756, "phrase": "new_multi-view_regularization"}, {"score": 0.002914288956035066, "phrase": "generated_feature_space"}, {"score": 0.002620040660435039, "phrase": "new_multi-view"}, {"score": 0.0023694065215394593, "phrase": "proposed_mvdr."}, {"score": 0.0023415390666563177, "phrase": "proposed_method"}, {"score": 0.0022201273900989416, "phrase": "multiple_views"}], "paper_keywords": ["Discriminative Regularization", " Multi-View Learning", " Single source patterns", " Multi-class problem", " Classification"], "paper_abstract": "The existing Multi-View Learning (MVL) is to discuss how to learn from patterns with multiple information sources and has been proven its superior generalization to the usual Single-View Learning (SVL). However, in most real-world cases there are just single source patterns available such that the existing MVL cannot work. The purpose of this paper is to develop a new multi-view regularization learning for single source patterns. Concretely, for the given single source patterns, we first map them into M feature spaces by M different empirical kernels, then associate each generated feature space with our previous proposed Discriminative Regularization (DR), and finally synthesize M DRs into one single learning process so as to get a new Multi-view Discriminative Regularization (MVDR), where each DR can be taken as one view of the proposed MVDR. The proposed method achieves: (1) the complementarity for multiple views generated from single source patterns; (2) an analytic solution for classification; (3) a direct optimization formulation for multi-class problems without one-against-all or one-against-one strategies.", "paper_title": "A Novel Regularization Learning for Single-View Patterns: Multi-View Discriminative Regularization", "paper_id": "WOS:000278096200001"}