{"auto_keywords": [{"score": 0.027698208431050645, "phrase": "spad"}, {"score": 0.013835602766947327, "phrase": "kinase_inhibitor"}, {"score": 0.010414505401450787, "phrase": "key_substructures"}, {"score": 0.004776297980616768, "phrase": "amino_acid_induction_peptides"}, {"score": 0.004718897469501381, "phrase": "novel_substructure_pair_descriptor"}, {"score": 0.004032302251481604, "phrase": "two-dimensional_qsar."}, {"score": 0.003920049436883885, "phrase": "important_element"}, {"score": 0.0038263136898042285, "phrase": "atom_pair"}, {"score": 0.003515479934694842, "phrase": "thirty-six_types"}, {"score": 0.003487222504700868, "phrase": "key_atoms"}, {"score": 0.0032038465090068646, "phrase": "forty-nine_types"}, {"score": 0.003114584448820957, "phrase": "amino_acid_residues"}, {"score": 0.002872979681637667, "phrase": "traditional_descriptors"}, {"score": 0.0028498718992429825, "phrase": "similarity_searches"}, {"score": 0.0024742098091226203, "phrase": "different_properties"}, {"score": 0.0024543014947630876, "phrase": "aph._conclusion"}, {"score": 0.0022365262201954643, "phrase": "powerful_descriptor"}, {"score": 0.0021049977753042253, "phrase": "spad."}], "paper_keywords": [""], "paper_abstract": "Background: Quantitative structure-activity relationships (QSAR) analysis of peptides is helpful for designing various types of drugs such as kinase inhibitor or antigen. Capturing various properties of peptides is essential for analyzing two-dimensional QSAR. A descriptor of peptides is an important element for capturing properties. The atom pair holographic (APH) code is designed for the description of peptides and it represents peptides as the combination of thirty-six types of key atoms and their intermediate binding between two key atoms. Results: The substructure pair descriptor (SPAD) represents peptides as the combination of forty-nine types of key substructures and the sequence of amino acid residues between two substructures. The size of the key substructures is larger and the length of the sequence is longer than traditional descriptors. Similarity searches on C5a inhibitor data set and kinase inhibitor data set showed that order of inhibitors become three times higher by representing peptides with SPAD, respectively. Comparing scope of each descriptor shows that SPAD captures different properties from APH. Conclusion: QSAR/QSPR for peptides is helpful for designing various types of drugs such as kinase inhibitor and antigen. SPAD is a novel and powerful descriptor for various types of peptides. Accuracy of QSAR/QSPR becomes higher by describing peptides with SPAD.", "paper_title": "2D-Qsar for 450 types of amino acid induction peptides with a novel substructure pair descriptor having wider scope", "paper_id": "WOS:000300232400001"}