{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_security_awareness"}, {"score": 0.004300453431933622, "phrase": "security_awareness_processes"}, {"score": 0.004180622964109706, "phrase": "interrelated_changes"}, {"score": 0.0037073529462522403, "phrase": "integrated_analytical_framework"}, {"score": 0.0035533891890176823, "phrase": "action_research"}, {"score": 0.003478813491904962, "phrase": "public_sector_organisation"}, {"score": 0.0034057975804778293, "phrase": "actor-network_theory"}, {"score": 0.003287482882222731, "phrase": "structuration_theory"}, {"score": 0.002833689453299307, "phrase": "security_awareness_programme"}, {"score": 0.0027741761880779535, "phrase": "research_setting"}, {"score": 0.0025664746452202522, "phrase": "ant"}, {"score": 0.002408052242408488, "phrase": "multi-level_changes"}], "paper_keywords": ["actor-network theory", " structuration theory", " contextualism", " information security awareness", " action research"], "paper_abstract": "Several studies explore information security awareness focusing on individual and/or organisational aspects. This paper argues that security awareness processes are associated with interrelated changes that occur at the organisational, the technological and the individual level. We introduce an integrated analytical framework that has been developed through action research in a public sector organisation, comprising actor-network theory (ANT), structuration theory and contextualisnn. We develop and use this framework to analyse and manage changes introduced by the implementation of a security awareness programme in the research setting. The paper illustrates the limitations of each theory (ANT, structuration theory and contextualism) to study multi-level changes when used individually, demonstrates the synergies of the three theories, and proposes how they can be used to study and manage awareness-related changes at the individual, organisational and technological level.", "paper_title": "Managing the introduction of information security awareness programmes in organisations", "paper_id": "WOS:000348095700004"}