{"auto_keywords": [{"score": 0.04173241924571679, "phrase": "service_providers"}, {"score": 0.00481495049065317, "phrase": "service_users"}, {"score": 0.004690305164360866, "phrase": "best_service"}, {"score": 0.003877737556673229, "phrase": "users'_preferences"}, {"score": 0.0036793800647811365, "phrase": "conflicting_nonfunctional_attributes"}, {"score": 0.0028857130140890787, "phrase": "novel_service_selection_method"}, {"score": 0.0028293966058473476, "phrase": "fuzzy_logic"}, {"score": 0.0027741761880779535, "phrase": "users'_personalized_preferences"}, {"score": 0.002649472341607234, "phrase": "service_selection"}, {"score": 0.0024325244760735566, "phrase": "linguistic_terms"}, {"score": 0.0022628564592874147, "phrase": "service_selection_framework"}, {"score": 0.0021610874773389096, "phrase": "real-world_airline_services"}, {"score": 0.0021049977753042253, "phrase": "proposed_framework's_application"}], "paper_keywords": ["Service selection", " fuzzy logic", " elastic nonfunctional attributes", " personalized preference", " personalized trade-off"], "paper_abstract": "For service users to get the best service that meet their requirements, they prefer to personalize their nonfunctional attributes, such as reliability and price. However, the personalization makes it challenging for service providers to completely meet users' preferences, because they have to deal with conflicting nonfunctional attributes when selecting services for users. With this in mind, users may sometimes want to explicitly specify their trade-offs among nonfunctional attributes to make their preferences known to service providers. In this article, we present a novel service selection method based on fuzzy logic that considers users' personalized preferences and their trade-offs on nonfunctional attributes during service selection. The method allows users to represent their elastic nonfunctional requirements and associated importance using linguistic terms to specify their personalized trade-off strategies. We present examples showing how the service selection framework is used and a prototype with real-world airline services to evaluate the proposed framework's application.", "paper_title": "Elastic Personalized Nonfunctional Attribute Preference and Trade-off Based Service Selection", "paper_id": "WOS:000348916600001"}