{"auto_keywords": [{"score": 0.049027569260597106, "phrase": "key_exchange_protocols"}, {"score": 0.00481495049065317, "phrase": "key_exchange_protocol"}, {"score": 0.00450456611645112, "phrase": "trusted_server"}, {"score": 0.0038556354709511818, "phrase": "three-party_protocol"}, {"score": 0.003770869401884267, "phrase": "key_management_problem"}, {"score": 0.0030189426536422577, "phrase": "security-sensitive_table"}, {"score": 0.0029789104204803137, "phrase": "server_side"}, {"score": 0.0025492038831408715, "phrase": "efficiency_bottleneck"}, {"score": 0.0024600113832396187, "phrase": "quick_response"}, {"score": 0.002405853977978678, "phrase": "light-weight_clients"}, {"score": 0.0023739321566540682, "phrase": "mobile_c-commerce"}, {"score": 0.0022806798371116698, "phrase": "computation-efficient_three-party"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["authentication", " key agreement", " authenticated key exchange", " network security"], "paper_abstract": "In three-party authenticated key exchange protocols, each client shares a secret only with a trusted server with assists in generating a session key used for securely sending messages between two communication clients. Compared with two-party authenticated key exchange protocols where each pair of parties must share a secret with each other, a three-party protocol does not cause any key management problem for the parties. In the literature, mainly there exist three issues in three-party authenticated key exchange protocols are discussed that need to be further improved: (1) to reduce latency, communication steps in the protocol should be as parallel as possible; (2) as the existence of a security-sensitive table on the server side may cause the server to become compromised, the table should be removed; (3) resources required for computation should be as few as possible to avoid the protocol to become an efficiency bottleneck. In various applications over networks, a quick response is required especially by light-weight clients in the mobile c-commerce. In this paper, a round- and computation-efficient three-party authenticated key exchange protocol is proposed which fulfils all of the above mentioned requirements. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "A round- and computation-efficient three-party authenticated key exchange protocol", "paper_id": "WOS:000259128100011"}