{"auto_keywords": [{"score": 0.04031435432022082, "phrase": "psmt"}, {"score": 0.026886420694635652, "phrase": "n_wires"}, {"score": 0.017655424281949307, "phrase": "asynchronous_network"}, {"score": 0.0068705014987515455, "phrase": "synchronous_networks"}, {"score": 0.006030957460048832, "phrase": "higher_connectivity"}, {"score": 0.00481495049065317, "phrase": "asynchronous_networks"}, {"score": 0.004777569299319633, "phrase": "perfectly_secure_message_transmission"}, {"score": 0.004712845879001401, "phrase": "sender_s"}, {"score": 0.004630910803911567, "phrase": "distributed_network"}, {"score": 0.004594951819987416, "phrase": "n_node_disjoint_paths"}, {"score": 0.004427906147395107, "phrase": "unbounded_computing_power"}, {"score": 0.004384960761826366, "phrase": "message_m"}, {"score": 0.00396218934254591, "phrase": "information_theoretic_sense"}, {"score": 0.0038932537400543027, "phrase": "statistically_secure_message_transmission"}, {"score": 0.0037516215763875225, "phrase": "sayeed"}, {"score": 0.00373701482510911, "phrase": "abu-amara"}, {"score": 0.0036648265911110164, "phrase": "psmt_protocol"}, {"score": 0.003483573659272443, "phrase": "perfect_security"}, {"score": 0.0030745737579268876, "phrase": "dolev_et_al"}, {"score": 0.0026871007973389314, "phrase": "psmt_protocols"}, {"score": 0.0025841817591285773, "phrase": "ssmt_protocol"}, {"score": 0.002437130875595661, "phrase": "franklin"}, {"score": 0.0024276393151438916, "phrase": "wright"}, {"score": 0.00238999059376225, "phrase": "kurosawa"}, {"score": 0.002380687975002626, "phrase": "suzuki"}, {"score": 0.0022939396079753463, "phrase": "ssmt"}, {"score": 0.002129818297734379, "phrase": "ssmt_protocols"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Information theoretic security", " Error probability", " Optimality", " Asynchronous networks"], "paper_abstract": "In the Perfectly Secure Message Transmission (PSMT) problem, a sender S and a receiver R are part of a distributed network and connected through n node disjoint paths, also called as wires, among which at most t wires are controlled by a static, Byzantine adversary A(t)(static), having unbounded computing power. S has a message m, which S intends to send to R. The challenge is to design a protocol, such that at the end of the protocol, R should correctly output m without any error (perfect reliability) and A(t)(static) should not get any information about m, whatsoever, in information theoretic sense (perfect security). The problem of Statistically Secure Message Transmission (SSMT) is same as PSMT, except that R should correctly output m with very high probability. Sayeed and Abu-Amara (1995) [37] have given a PSMT protocol in an asynchronous network tolerating A(t)(static), where S and R are connected by n = 2t + 1 wires. However, we show that their protocol does not provide perfect security. We then prove that in an asynchronous network, if all the n wires are directed from S to R, then any PSMT protocol tolerating A(t)(static) is possible iff n > 3t. Surprisingly, we also prove that even if all the n wires are bi-directional, then any PSMT protocol in asynchronous network tolerating A(t)(static) is possible iff n > 3t. This is quite surprising because for synchronous networks, by the results of Dolev et al. (1993) [16], if all the wires are unidirectional (directed from S to R), then PSMT tolerating A(t)(static) is possible iff n > 3t, where as if all the wires are bi-directional then PSMT tolerating A(t)(static) is possible if n > 2t. This shows that asynchrony of the network demands higher connectivity of the network for the existence of PSMT protocols. Interestingly, we further show that n > 2t wires are necessary and sufficient for the existence of any SSMT protocol in asynchronous network tolerating A(t)(static), irrespective of whether the n wires are unidirectional from S to R or the n wires are bi-directional. By the results of Franklin and Wright (2000) [18] and Kurosawa and Suzuki (2009) [22], n > 2t wires are necessary and sufficient for the existence of SSMT in synchronous networks, irrespective of whether the n wires are unidirectional from S to R or the n wires are bi-directional. This shows that asynchrony of the network does not demand higher connectivity of the network for SSMT protocols. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Secure message transmission in asynchronous networks", "paper_id": "WOS:000291913400001"}