{"auto_keywords": [{"score": 0.03652729889978431, "phrase": "sw-kprop"}, {"score": 0.022118612033026085, "phrase": "semantic_information"}, {"score": 0.008987818606453878, "phrase": "human_intervention"}, {"score": 0.007199059236620287, "phrase": "similarity_graph"}, {"score": 0.00481495049065317, "phrase": "image_databases"}, {"score": 0.004786821283037044, "phrase": "similarity_graphs"}, {"score": 0.0047172117216828, "phrase": "large-scale_image_indexing"}, {"score": 0.00454090611248773, "phrase": "manual_tagging"}, {"score": 0.004371160978838441, "phrase": "existing_methods"}, {"score": 0.004345613093011898, "phrase": "automated_image"}, {"score": 0.004269858032459539, "phrase": "accurate_results"}, {"score": 0.004026712228523795, "phrase": "semantic_annotation"}, {"score": 0.0039449104968131655, "phrase": "high_degree"}, {"score": 0.003487721546598799, "phrase": "influence_propagation_strategy"}, {"score": 0.0033868916699805224, "phrase": "initial_labeling"}, {"score": 0.0030295361111006866, "phrase": "combined_influences"}, {"score": 0.002994178996584381, "phrase": "sw-kprop_influence_propagation"}, {"score": 0.002924694271730544, "phrase": "matrix_computations"}, {"score": 0.002890557197908352, "phrase": "pairwise_similarities"}, {"score": 0.002701839495787648, "phrase": "reduced_feature"}, {"score": 0.002670296619878048, "phrase": "prelabeled_image"}, {"score": 0.002600661525224505, "phrase": "sw-kprop_method"}, {"score": 0.0025328377393370642, "phrase": "classification_tasks"}, {"score": 0.002388368786294332, "phrase": "digit_images"}, {"score": 0.002272053079580848, "phrase": "web_images"}, {"score": 0.002193367454830741, "phrase": "prelabeled_images"}, {"score": 0.0021049977753042253, "phrase": "feature_selection_strategy"}], "paper_keywords": ["Algorithms", " Classification", " feature selection", " image annotation", " iterative method", " linear system", " neighborhood"], "paper_abstract": "The practicality of large-scale image indexing and querying methods depends crucially upon the availability of semantic information. The manual tagging of images with semantic information is in general very labor intensive, and existing methods for automated image annotation may not always yield accurate results. The aim of this paper is to reduce to a minimum the amount of human intervention required in the semantic annotation of images, while preserving a high degree of accuracy. Ideally, only one copy of each object of interest would be labeled manually, and the labels would then be propagated automatically to all other occurrences of the objects in the database. To this end, we propose an influence propagation strategy, SW-KProp, that requires no human intervention beyond the initial labeling of a subset of the images. SW-KProp distributes semantic information within a similarity graph defined on all images in the database: each image iteratively transmits its current label information to its neighbors, and then readjusts its own label according to the combined influences of its neighbors. SW-KProp influence propagation can be efficiently performed by means of matrix computations, provided that pairwise similarities of images are available. We also propose a variant of SW-KProp which enhances the quality of the similarity graph by selecting a reduced feature set for each prelabeled image and rebuilding its neighborhood. The performances of the SW-KProp method and its variant were evaluated against several competing methods on classification tasks for three image datasets: a handwritten digit dataset, a face dataset and a web image dataset. For the digit images, SW-KProp and its variant performed consistently better than the other methods tested. For the face and web images, SW-KProp outperformed its competitors for the case when the number of prelabeled images was relatively small. The performance was seen to improve significantly when the feature selection strategy was applied. Categories and Subject Descriptors: H.2.4 [Database Management]: Systems-Multimedia databases", "paper_title": "Annotation Propagation in Image Databases Using Similarity Graphs", "paper_id": "WOS:000329025400007"}