{"auto_keywords": [{"score": 0.03490036478529983, "phrase": "hdr_image"}, {"score": 0.015719716506582538, "phrase": "high_dynamic_range"}, {"score": 0.0047145329604366395, "phrase": "novel_approach"}, {"score": 0.004500896652306301, "phrase": "hdr"}, {"score": 0.004016485454498076, "phrase": "commercial_hdr-enabled_drawing_programs"}, {"score": 0.003916098498242888, "phrase": "hdr_images"}, {"score": 0.0038343546245999285, "phrase": "intuitive_brush_interface"}, {"score": 0.003738502710504415, "phrase": "unmapped_hdr_imagery"}, {"score": 0.003584025547693836, "phrase": "typical_virtual_painting_interface"}, {"score": 0.0035240305920962766, "phrase": "adobe_photoshop"}, {"score": 0.003014422649429416, "phrase": "hdr_contrast_values"}, {"score": 0.002770273247998903, "phrase": "underlying_basis"}, {"score": 0.0026445028886931837, "phrase": "artistic_control"}, {"score": 0.0026112013707473938, "phrase": "hdr_contrasts"}, {"score": 0.0023694065215394593, "phrase": "image-based_rendering"}, {"score": 0.00231987280116332, "phrase": "ldr_representation"}, {"score": 0.0022145052062614514, "phrase": "real-time_visual_feedback"}, {"score": 0.0021590588269751816, "phrase": "image_manipulation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "We present a novel approach that allows users to intuitively and interactively manipulate High Dynamic Range (HDR) images using commonly available Low Dynamic Range (LDR) displays. This solves the problem of how to draw with contrasts that are much larger than the monitor can display. Whereas commercial HDR-enabled drawing programs manipulate tone mapped representations of HDR images, we provide an intuitive brush interface that supports interaction with the unmapped HDR imagery. Our approach introduces two new brush constructs to a typical virtual painting interface, such as Adobe Photoshop. First, we present a brush that locally adjusts the display of the HDR image to. a dynamic range specified within a real-time, interactive, local histogram of the region around the cursor. This affords precise, quantitative control of the HDR contrast values produced by the brush. Second, we demonstrate a brush that uses the perception of glare as the underlying basis for determining the contrasts painted onto the HDR image, giving artistic control over the HDR contrasts. By maintaining an HDR image, the result is available for further manipulation and processing by algorithms, such as those used in image-based rendering, for which an LDR representation is inadequate. Finally, we use the Graphics Processing Unit to provide real-time visual feedback for the effects of each image manipulation. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Painting in high dynamic range", "paper_id": "WOS:000250184000005"}