{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "video-based_fall_detection_system"}, {"score": 0.00462291551375938, "phrase": "video-based_robust_fall_detection_system"}, {"score": 0.0044747919503484055, "phrase": "smart_room_environment"}, {"score": 0.0044385053213394175, "phrase": "video_features"}, {"score": 0.004278807087784626, "phrase": "voxel_person"}, {"score": 0.004175533280178052, "phrase": "boundary_method"}, {"score": 0.003912112659326054, "phrase": "incoming_features"}, {"score": 0.003848886045448135, "phrase": "'fall_region"}, {"score": 0.0037866774001097596, "phrase": "feature_space"}, {"score": 0.003419943984098415, "phrase": "boundary_methods"}, {"score": 0.0030635374056374016, "phrase": "representative_test_datasets"}, {"score": 0.00266693888510356, "phrase": "training_dataset"}, {"score": 0.002560352786969071, "phrase": "test_phase"}, {"score": 0.0025189177411152645, "phrase": "comparison_results"}, {"score": 0.0024480094603893175, "phrase": "scmpm"}, {"score": 0.0024182330686905256, "phrase": "best_overall_performance"}, {"score": 0.0021926693625590006, "phrase": "experimental_part"}], "paper_keywords": [""], "paper_abstract": "In this study, the authors introduce a video-based robust fall detection system for monitoring an elderly person in a smart room environment. Video features, namely the centroid and orientation of a voxel person, are extracted. The boundary method, which is an example of one class classification technique, is then used to determine whether the incoming features lie in the 'fall region' of the feature space, and thereby effectively distinguishing a fall from other activities, such as walking, sitting, standing, crouching or lying. Four different types of boundary methods, k-centre, kth nearest neighbour, one class support vector machine and single class minimax probability machine (SCMPM) are assessed on representative test datasets. The comparison is made on the following three aspects: (i) true positive rate, false positive rate and geometric means in detection. (ii) Robustness to noise in the training dataset. (iii) The computational time for the test phase. From the comparison results, the authors show that the SCMPM achieves the best overall performance. By applying one class classification techniques with three-dimensional (3-d) features, the authors can obtain a more efficient fall detection system with acceptable performance, as shown in the experimental part; besides, it can avoid the drawbacks of other traditional fall detection methods.", "paper_title": "One class boundary method classifiers for application in a video-based fall detection system", "paper_id": "WOS:000302137600002"}