{"auto_keywords": [{"score": 0.04223218903917887, "phrase": "control_policies"}, {"score": 0.00481495049065317, "phrase": "stochastic_resource_allocation_problems"}, {"score": 0.004451676867747938, "phrase": "natural_generalization"}, {"score": 0.0041589926969138585, "phrase": "reactive_solutions"}, {"score": 0.003948062582285658, "phrase": "markov"}, {"score": 0.0035733198242955634, "phrase": "finite_state_and_action_spaces"}, {"score": 0.0031678720736808574, "phrase": "approximate_dynamic_programming"}, {"score": 0.0031348766737456443, "phrase": "adp"}, {"score": 0.0030378759123133644, "phrase": "fitted_q-learning"}, {"score": 0.0029284999172756103, "phrase": "efficient_control_policy"}, {"score": 0.002651015392318126, "phrase": "hash_tables"}, {"score": 0.0026233771102489394, "phrase": "support_vector_regression"}, {"score": 0.002387214876538434, "phrase": "limited-lookahead_rollout_algorithms"}, {"score": 0.0021049977753042253, "phrase": "benchmark_and_industry-related_data"}], "paper_keywords": [""], "paper_abstract": "The paper investigates stochastic resource allocation problems with scarce, reusable resources and non-preemtive, time-dependent, interconnected tasks. This approach is a natural generalization of several standard resource management problems, such as scheduling and transportation problems. First, reactive solutions are considered and defined as control policies of suitably reformulated Markov decision processes ( MDPs). We argue that this reformulation has several favorable properties, such as it has finite state and action spaces, it is aperiodic, hence all policies are proper and the space of control policies can be safely restricted. Next, approximate dynamic programming ( ADP) methods, such as fitted Q-learning, are suggested for computing an efficient control policy. In order to compactly maintain the cost-to-go function, two representations are studied: hash tables and support vector regression ( SVR), particularly, v-SVRs. Several additional improvements, such as the application of limited-lookahead rollout algorithms in the initial phases, action space decomposition, task clustering and distributed sampling are investigated, too. Finally, experimental results on both benchmark and industry-related data are presented.", "paper_title": "Adaptive stochastic resource control: A machine learning approach", "paper_id": "WOS:000257103000003"}