{"auto_keywords": [{"score": 0.011689258868326781, "phrase": "business_performance"}, {"score": 0.008148218076629556, "phrase": "corresponding_effects"}, {"score": 0.00481495049065317, "phrase": "information_systems_interoperability_business_value"}, {"score": 0.004782787810319066, "phrase": "european"}, {"score": 0.004563028873351776, "phrase": "information_systems"}, {"score": 0.004223708778943785, "phrase": "significant_business_value"}, {"score": 0.003949144559926685, "phrase": "research_gap"}, {"score": 0.0038964032225585117, "phrase": "empirical_study"}, {"score": 0.003522579870903474, "phrase": "balanced_scorecard_approach"}, {"score": 0.003293442130869165, "phrase": "large_dataset"}, {"score": 0.003163154491827937, "phrase": "e-business_watch_survey"}, {"score": 0.00300749708357049, "phrase": "positive_impact"}, {"score": 0.0029873281676201565, "phrase": "firm's_information_and_communication_technologies"}, {"score": 0.00279291004189267, "phrase": "industry-specific_interoperability_standards"}, {"score": 0.002764856305713066, "phrase": "highest_positive_effects"}, {"score": 0.0027370835853738626, "phrase": "xml-based_and_proprietary_standards"}, {"score": 0.002584879320145739, "phrase": "interoperability_standards"}, {"score": 0.002507748938616919, "phrase": "similar_magnitude"}, {"score": 0.0023053339328456234, "phrase": "firm's_e-sales"}, {"score": 0.0022668507535947976, "phrase": "valuable_empirical_evidence"}, {"score": 0.0022440691950725614, "phrase": "multidimensional_business_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Information systems (IS)", " Information and communication technologies (ICT)", " Interoperability", " Business value", " Balanced scorecard", " Business performance", " Business processes", " Innovation"], "paper_abstract": "It is widely believed that the establishment of interoperability of the information systems (IS) of a firm with those of its collaborators (e.g. customers, suppliers, and business partners) can generate significant business value. However, this has been empirically investigated only to a very limited extent. This paper contributes to filling this research gap by presenting an empirical study of the effect of adopting the three main types of IS interoperability standards (industry-specific, proprietary and XML-based ones) on the four important perspectives/dimensions of business performance proposed by the balanced scorecard approach (financial, customers, internal business processes, learning and innovation). Our study is based on a large dataset from 14,065 European firms (from 25 countries and 10 sectors) collected through the e-Business Watch Survey of the European Commission. It is concluded that all three examined types of IS interoperability standards increase considerably the positive impact of firm's information and communication technologies (ICT) infrastructure on the above four perspectives/dimensions of business performance; however, their effects differ significantly. The adoption of industry-specific interoperability standards has the highest positive effects, while XML-based and proprietary standards have similar lower positive effects. Furthermore, these effects of the industry-specific IS interoperability standards are quite strong, as they are of similar magnitude with the corresponding effects of the degree of development of firm's intra-organizational/internal IS, and of higher magnitude than the corresponding effects of the degree of development of firm's e-sales IS. These conclusions provide valuable empirical evidence of the multidimensional business value generated by IS interoperability, its big magnitude and its strong dependence on the type of IS interoperability standards adopted. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "An empirical investigation of information systems interoperability business value in European firms", "paper_id": "WOS:000318465100006"}