{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "technical_debt"}, {"score": 0.004652570301627026, "phrase": "software_engineering_metaphor"}, {"score": 0.004586531354697466, "phrase": "eventual_financial_consequences"}, {"score": 0.004554943986500788, "phrase": "financial_approaches"}, {"score": 0.004534372661692015, "phrase": "shrinking_product_time"}, {"score": 0.004406544829622101, "phrase": "software_product"}, {"score": 0.004356424011261929, "phrase": "development_phases"}, {"score": 0.004185429483528935, "phrase": "software_engineering"}, {"score": 0.004161553532799662, "phrase": "economic_theories"}, {"score": 0.00402111957601744, "phrase": "research_efforts"}, {"score": 0.003754255812075932, "phrase": "financial_aspects"}, {"score": 0.0035759747560154044, "phrase": "underlying_software_engineering_concepts"}, {"score": 0.0034850320520618872, "phrase": "abovementioned_goals"}, {"score": 0.0034355080345982755, "phrase": "standard_method"}, {"score": 0.003338554240844867, "phrase": "seven_general-scope_digital_libraries"}, {"score": 0.0032443276816348575, "phrase": "financial_aspect"}, {"score": 0.0031347485922104223, "phrase": "technical_debt_research"}, {"score": 0.0029687453443095094, "phrase": "real_options"}, {"score": 0.002724300844023273, "phrase": "different_studies"}, {"score": 0.0026625766466908825, "phrase": "clear_mapping"}, {"score": 0.0026473647763997476, "phrase": "financial_and_software_engineering_concepts"}, {"score": 0.002536004981903211, "phrase": "technical_managers"}, {"score": 0.002521514414371778, "phrase": "project_managers"}, {"score": 0.002450291099666278, "phrase": "common_vocabulary"}, {"score": 0.002394760204469008, "phrase": "quality-related_goals"}, {"score": 0.0023742613449123217, "phrase": "software_development"}, {"score": 0.002147659468862266, "phrase": "interesting_implications"}], "paper_keywords": ["Technical debt", " Financial debt", " Financial terms", " Systematic literature review"], "paper_abstract": "Context: Technical debt is a software engineering metaphor, referring to the eventual financial consequences of trade-offs between shrinking product time to market and poorly specifying, or implementing a software product, throughout all development phases. Based on its inter-disciplinary nature, i.e. software engineering and economics, research on managing technical debt should be balanced between software engineering and economic theories. Objective: The aim of this study is to analyze research efforts on technical debt, by focusing on their financial aspect. Specifically, the analysis is carried out with respect to: (a) how financial aspects are defined in the context of technical debt and (b) how they relate to the underlying software engineering concepts. Method: In order to achieve the abovementioned goals, we employed a standard method for SLRs and applied it on studies retrieved from seven general-scope digital libraries. In total we selected 69 studies relevant to the financial aspect of technical debt. Results: The most common financial terms that are used in technical debt research are principal and interest, whereas the financial approaches that have been more frequently applied for managing technical debt are real options, portfolio management, cost/benefit analysis and value-based analysis. However, the application of such approaches lacks consistency, i.e., the same approach is differently applied in different studies, and in some cases lacks a clear mapping between financial and software engineering concepts. Conclusion: The results are expected to prove beneficial for the communication between technical managers and project managers, in the sense that they will provide a common vocabulary, and will help in setting up quality-related goals, during software development. To achieve this we introduce: (a) a glossary of terms and (b) a classification scheme for financial approaches used for managing technical debt. Based on these, we have been able to underline interesting implications for researchers and practitioners. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "The financial aspect of managing technical debt: A systematic literature review", "paper_id": "WOS:000355365100004"}