{"auto_keywords": [{"score": 0.046888273895838085, "phrase": "mobile_anchors"}, {"score": 0.007616468754892845, "phrase": "wireless_sensor_networks"}, {"score": 0.007285487529633691, "phrase": "proposed_scheme"}, {"score": 0.00481495049065317, "phrase": "ring_overlapping"}, {"score": 0.0047761092701293474, "phrase": "utilizing_mobile_anchors"}, {"score": 0.0046238380150870435, "phrase": "efficient_localization_scheme"}, {"score": 0.0043161190928529755, "phrase": "wireless_sensor_network"}, {"score": 0.00374531366198605, "phrase": "relative_rssi"}, {"score": 0.0035819501337406596, "phrase": "mobile_beacons"}, {"score": 0.003398015125667192, "phrase": "reference_node"}, {"score": 0.0033433365160336842, "phrase": "blind_node"}, {"score": 0.0031459887611258765, "phrase": "reference_nodes"}, {"score": 0.0029602552900111433, "phrase": "multiple_mobile_beacons"}, {"score": 0.002707444334463544, "phrase": "blind_nodes"}, {"score": 0.0024761702541879213, "phrase": "regular_and_simple_movement_mechanisms"}, {"score": 0.002255431275670053, "phrase": "analytical_analysis_and_simulation_results"}, {"score": 0.0022190974300886467, "phrase": "proposed_localization_mechanism"}, {"score": 0.0021922308351126746, "phrase": "better_location_accuracy"}, {"score": 0.0021307975800397816, "phrase": "mobile_anchor"}], "paper_keywords": ["Experimentation", " Design", " Wireless sensor networks", " localization", " mobile anchors", " RSSI"], "paper_abstract": "This study proposes an efficient localization scheme in wireless sensor networks. The proposed scheme utilizes mobile anchors and is based on ring overlapping. In a wireless sensor network, the nodes that know their locations are called reference nodes, and the other nodes that are without the knowledge of their locations are called blind nodes. To localize a certain blind node, by comparing the relative RSSI (Received Signal Strength Indicator) values among nodes, mobile beacons are utilized to find out the rings that are centered at a reference node and contain the blind node. These rings are called B-Rings. Since the mobile anchors and the reference nodes know their own locations, the B-Rings can be precisely derived. Moreover, by using multiple mobile beacons, the widths of the B-Rings can be further minimized; and then by overlapping them, the location of the blind nodes can be efficiently estimated. Most existing localization schemes that utilize mobile anchors let the mobile anchors move randomly. In contrast, the proposed scheme provides regular and simple movement mechanisms for the mobile anchors. Thus, the mobile anchors consume less energy than the other schemes, in which the mobile anchors move randomly. Analytical analysis and simulation results show that the proposed localization mechanism can achieve better location accuracy as well as less movement length of the mobile anchor than the other existing related approaches.", "paper_title": "Efficient Localization Scheme with Ring Overlapping by Utilizing Mobile Anchors in Wireless Sensor Networks", "paper_id": "WOS:000327432400002"}