{"auto_keywords": [{"score": 0.029521802963172597, "phrase": "nucleo"}, {"score": 0.015719706115306438, "phrase": "teamwork_skills"}, {"score": 0.008275053531844948, "phrase": "activity_theory"}, {"score": 0.0047810714349158165, "phrase": "university_programming_courses"}, {"score": 0.004747429622531595, "phrase": "university_courses"}, {"score": 0.004714023408114857, "phrase": "computer_programming"}, {"score": 0.004566567411073082, "phrase": "technical_knowledge"}, {"score": 0.004392565073466714, "phrase": "real-life_software_projects"}, {"score": 0.004285289574869884, "phrase": "software_applications"}, {"score": 0.004240116703465252, "phrase": "coordinated_efforts"}, {"score": 0.004049783994776266, "phrase": "software_professionals"}, {"score": 0.003478813491904962, "phrase": "true_commitment"}, {"score": 0.0031732652552570644, "phrase": "dropout_rates"}, {"score": 0.0030521898646210413, "phrase": "nucleo_e-learning_framework"}, {"score": 0.0029775511937434797, "phrase": "effective_acquisition"}, {"score": 0.0027546167254869493, "phrase": "socio-constructivist_pedagogical_approach"}, {"score": 0.002658863179011018, "phrase": "problem_based_learning"}, {"score": 0.002603012037901889, "phrase": "design_decisions"}, {"score": 0.0023079225317714815, "phrase": "main_features"}, {"score": 0.002219790619936024, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cooperative/collaborative learning", " Learning communities", " Post-secondary education", " Teaching/learning strategies"], "paper_abstract": "University courses about computer programming usually seek to provide students not only with technical knowledge, but also with the skills required to work in real-life software projects. Nowadays, the development of software applications requires the coordinated efforts of the members of one or more teams. Therefore, it is important for software professionals to master the sort of skills that assure the success of teamwork, such as communication, leadership, negotiation, or team management. However, these abilities are difficult to teach, one of the reasons being that they require true commitment from the students. However, today students are taking a more and more passive role in their own education, two of the more evident consequences being the increase in dropout rates and the decrease in marks obtained in exams. The NUCLEO e-learning framework has been designed to promote the effective acquisition of teamwork skills and, at the same time, to promote the more active participation of the students in their own learning process. NUCLEO adopts a socio-constructivist pedagogical approach that pursues the development of communities of practice for Problem Based Learning. Our research has rooted the design decisions of NUCLEO in the analysis of its socio-cultural environment with Activity Theory, which considers conflicts within groups as the impetus of their evolution and the forges of their environments. This paper presents the analysis of the main features of NUCLEO according to Activity Theory, as well as the experimental results obtained with the framework in three different case studies in university courses. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Learning teamwork skills in university programming courses", "paper_id": "WOS:000267785400034"}