{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "national_research_assessment"}, {"score": 0.004605258779434384, "phrase": "performance_rankings"}, {"score": 0.0045599093158915326, "phrase": "labor_input"}, {"score": 0.004339744430169516, "phrase": "scientific_research_activity"}, {"score": 0.004296998284839309, "phrase": "critical_methodological_aspects"}, {"score": 0.0038919354605673104, "phrase": "research_productivity"}, {"score": 0.003853583126988071, "phrase": "academic_rank"}, {"score": 0.0036312482387007815, "phrase": "national_university_performance_rankings"}, {"score": 0.0032887360307856635, "phrase": "comparative_analysis"}, {"score": 0.0031609252620168446, "phrase": "bibliometric_rankings"}, {"score": 0.0026443691099806003, "phrase": "hard_sciences"}, {"score": 0.002618278365749875, "phrase": "performance_measures"}, {"score": 0.0023476849595393872, "phrase": "individual_disciplines"}], "paper_keywords": ["Research productivity", " University ranking", " Bibliometrics", " Cost efficiency"], "paper_abstract": "Measuring the efficiency of scientific research activity presents critical methodological aspects, many of which have not been sufficiently studied. Although many studies have assessed the relation between quality and research productivity and academic rank, not much is known about the extent of distortion in national university performance rankings when academic rank and the other labor factors are not considered as a factor of normalization. This work presents a comparative analysis that aims to quantify the sensitivity of bibliometric rankings to the choice of input, with input considered as only the number of researchers on staff, or alternatively where their cost is also considered. The field of observation consists of all 69 Italian universities active in the hard sciences. Performance measures are based on the 81,000 publications produced during the 2004-2006 triennium by all 34,000 research staff, with analysis carried out at the level of individual disciplines, 187 in total. The effect of the switch from labor to cost seems to be minimal except for a few outliers.", "paper_title": "National research assessment exercises: a measure of the distortion of performance rankings when labor input is treated as uniform", "paper_id": "WOS:000280274400004"}