{"auto_keywords": [{"score": 0.04619367167340768, "phrase": "mexico"}, {"score": 0.00481495049065317, "phrase": "mexican_physics"}, {"score": 0.0046159158660556985, "phrase": "detailed_analysis"}, {"score": 0.004345706062641742, "phrase": "physics_specialty"}, {"score": 0.004042166795461166, "phrase": "current_production_and_citation_patterns"}, {"score": 0.0033725614574134396, "phrase": "historical_coverage"}, {"score": 0.0032722454818973853, "phrase": "supplementary_data"}, {"score": 0.003117890043128058, "phrase": "five_research_types"}, {"score": 0.0027463775689957255, "phrase": "published_or_unpublished_sources"}, {"score": 0.002616762777413686, "phrase": "mppf"}, {"score": 0.0025697460140513932, "phrase": "traditional_theoretical_and_phenomenological_research"}, {"score": 0.0023470051993423483, "phrase": "community's_involvement"}, {"score": 0.0021827653135510225, "phrase": "experimental_physics"}, {"score": 0.0021049977753042253, "phrase": "review_papers"}], "paper_keywords": ["Mexican physics", " Physics particles and fields", " Big science", " Scientific communication patterns"], "paper_abstract": "A detailed analysis of the research carried out in Mexico in the physics specialty of particles and fields (MPPF) reveals the way the current production and citation patterns evolved over a period of 60 years. The basis for the analysis were the publications and citations registered in the Stanford Public Information REtrieval System-High Energy Physics (SPIRES) from 1970 to 2007. The historical coverage afforded by the Science Citation Index provided supplementary data from 1948 to 1979. Papers were classified into five research types: theoretical, phenomenological, experimental, cosmological, and other, while citations were identified as coming from: published or unpublished sources. Results show that the development of MPPF emerged from traditional theoretical and phenomenological research and that the most notable changes taking place in production and impact are associated with the community's involvement in more productive and more internationally visible research practices, characteristic of large international collaborations, leaders in experimental physics and in the authorship of review papers.", "paper_title": "Enriching knowledge production patterns of Mexican physics in particles and fields", "paper_id": "WOS:000283090300011"}