{"auto_keywords": [{"score": 0.03966714569442953, "phrase": "skait"}, {"score": 0.013659388603268052, "phrase": "intended_recipient"}, {"score": 0.010305342141188714, "phrase": "collusion-based_attacks"}, {"score": 0.00481495049065317, "phrase": "confidential_communication"}, {"score": 0.004769616966550469, "phrase": "constrained_ad_hoc_wireless_networks"}, {"score": 0.00470983237900705, "phrase": "cryptographic_keys"}, {"score": 0.004665483918844599, "phrase": "widely_used_approach"}, {"score": 0.004621551111118693, "phrase": "secure_communication"}, {"score": 0.004592491583367684, "phrase": "severely_resource-constrained_nodes"}, {"score": 0.0044922081848067135, "phrase": "network_infrastructure"}, {"score": 0.004325339932975582, "phrase": "communication_messages"}, {"score": 0.0036476222647061243, "phrase": "secure_and_confidential_channel"}, {"score": 0.00355665081072721, "phrase": "wireless_network"}, {"score": 0.0029991878310331767, "phrase": "parameterization"}, {"score": 0.0028332303659245085, "phrase": "increased_key_space_complexity"}, {"score": 0.002634629612115397, "phrase": "minimum_number"}, {"score": 0.0025285834281312705, "phrase": "single_large_key_assignment_instance"}, {"score": 0.0024038923350585962, "phrase": "significantly_better_resistance"}, {"score": 0.0023512871357696022, "phrase": "internal_confidentiality"}, {"score": 0.0022709326810964386, "phrase": "large_range"}, {"score": 0.002256619934086924, "phrase": "key_storage_capacities"}, {"score": 0.0021589195238286233, "phrase": "node_additions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Collusion resistance", " Confidential communication", " Key predistribution", " Symmetric key assignment"], "paper_abstract": "Predistribution of cryptographic keys is a widely used approach for establishing secure communication between severely resource-constrained nodes with limited or no access to network infrastructure. Many existing key predistribution schemes make the implicit assumption that the contents of the communication messages need not be kept private from nodes other than the intended recipient. Messages in such schemes are not guaranteed to be confidential-they may be read by nodes within the network other than the intended recipient. In this paper, we propose SKAIT, a parameterized symmetric key predistribution scheme that guarantees a secure and confidential channel between every pair of nodes in a wireless network. Specifically, our scheme guarantees that the contents of messages exchanged between two nodes in the network cannot be read even by other nodes within the network. But, like many other key assignment schemes, our scheme is also vulnerable to collusion-based attacks in which several nodes can pool their keys together to eavesdrop on communications between other nodes. Parameterization enables control over the number of keys assigned to a node, and allows users to trade increased key space complexity for improved resistance against collusion-based attacks. We also present an extension to SKAIT, referred to as SKAIT-MI, that reduces the minimum number of keys that a node is required to store by replacing the single large key assignment instance with several smaller key assignment instances. We show via simulation that SKAIT and its extension SKAIT-MI provide significantly better resistance against collusion than other proposed schemes that support internal confidentiality-by as much as a factor of two-for a large range of key storage capacities. Finally, we describe an extension to our key assignment schemes to add support for node additions and revocations. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "SKAIT: A parameterized key assignment scheme for confidential communication in resource constrained ad hoc wireless networks", "paper_id": "WOS:000337869200012"}