{"auto_keywords": [{"score": 0.037240107743167404, "phrase": "decomposition_strategy"}, {"score": 0.00481495049065317, "phrase": "tactical_and_operational_policies"}, {"score": 0.0047388139424516555, "phrase": "new_product_portfolio"}, {"score": 0.004701196193727585, "phrase": "effective_management"}, {"score": 0.004663875663629251, "phrase": "new_product_development"}, {"score": 0.004639172375986199, "phrase": "npd"}, {"score": 0.004469757288746157, "phrase": "long_term"}, {"score": 0.004340987740056419, "phrase": "challenging_goal"}, {"score": 0.004051118465276454, "phrase": "technical_success"}, {"score": 0.003944836112147246, "phrase": "npd_management"}, {"score": 0.003872095456544917, "phrase": "decision_making"}, {"score": 0.0033274169900727457, "phrase": "optimal_or_near_optimal_performances"}, {"score": 0.0032660238803713104, "phrase": "empirical_or_theoretical_results"}, {"score": 0.0031050177923315587, "phrase": "optimality_gap"}, {"score": 0.002975587744845635, "phrase": "comprehensive_decision_support_approach"}, {"score": 0.00281383959883688, "phrase": "sim-opt"}, {"score": 0.0027399283407250497, "phrase": "decision_making_levels"}, {"score": 0.0026679533188714434, "phrase": "specific_instance"}, {"score": 0.0025909569700927324, "phrase": "pharmaceutical_industry"}, {"score": 0.002536355456684191, "phrase": "resource_allocation_strategies"}, {"score": 0.002482901744545283, "phrase": "npd_portfolio"}, {"score": 0.0024370524156670506, "phrase": "integrated_strategy"}, {"score": 0.0023168173752116748, "phrase": "chosen_composition"}, {"score": 0.0022439477248503343, "phrase": "tactical_decision"}, {"score": 0.0021791613158909694, "phrase": "real_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["strategic", " tactical and operational decisions", " new product development", " portfolio management", " risk", " Sim-Opt", " discrete event simulation", " efficient frontier"], "paper_abstract": "The effective management of a new product development (NPD) pipeline is critical to guarantee the survival of the organization in the long term while maximizing the creation of value. This is a challenging goal, due to one or more of the following factors: intensive research and development investment, long and uncertain development times, low probability of technical success, and uncertain market impact and competition. In NPD management, as in any other area, decision making is commonly broken down into three independent hierarchical levels: strategic, tactical and operational; where each level uses data and models whose degree of aggregation depends on their corresponding scope and their dynamic or static character. In principle, this decomposition strategy allows managers to concentrate on the variables that are relevant to each level and therefore generate decisions that will be reflected in optimal or near optimal performances. However, there are no empirical or theoretical results reported in the literature that validate this assumption. The aim of this study is to characterize the optimality gap between the set of decisions based on a decomposition strategy and those obtained by using a comprehensive decision support approach, in which the dynamics of all the different decision making levels are considered simultaneously. For that purpose a multi-phase, multi-level Sim-Opt decision support framework capable of accommodating any set of decision making levels with any degree of detail is proposed. A specific instance of the framework is used in the context of the pharmaceutical industry to determine the effects of considering the resource allocation strategies on the composition and prioritization of an NPD portfolio. Results show that if an integrated strategy is not considered it is not even possible to roughly estimate the performance of the pipeline for the chosen composition and prioritization. The performance of the portfolios selected using a tactical decision making strategy slightly different than the one implemented in the real system proved to be significantly suboptimal, off target and sometimes unreachable. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Impact of tactical and operational policies in the selection of a new product portfolio", "paper_id": "WOS:000251636100026"}