{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "usability_evaluation_process"}, {"score": 0.009454646727112343, "phrase": "usability_evaluation"}, {"score": 0.009087236860397519, "phrase": "uesim"}, {"score": 0.0046269981365987915, "phrase": "usability_engineering"}, {"score": 0.004216362268148017, "phrase": "main_goal"}, {"score": 0.004078675940346967, "phrase": "system_dynamics_simulation_model"}, {"score": 0.0039323878878973284, "phrase": "usability_evaluation_team"}, {"score": 0.003308557560574077, "phrase": "literature_revision"}, {"score": 0.0032757395605609923, "phrase": "model_building"}, {"score": 0.0032217623556814543, "phrase": "model_simulation"}, {"score": 0.0031792196429621888, "phrase": "finally_the_reflexion"}, {"score": 0.00293547027122617, "phrase": "different_compositions"}, {"score": 0.00290634217991954, "phrase": "evaluation_team"}, {"score": 0.002820675782452964, "phrase": "simulation_results"}, {"score": 0.0027375275272639933, "phrase": "decision_making"}, {"score": 0.00256993314099902, "phrase": "main_advantages"}, {"score": 0.002444883254621769, "phrase": "key_indicators"}, {"score": 0.002420611343093316, "phrase": "evaluation_process"}, {"score": 0.002364907617070299, "phrase": "customisable_tool"}, {"score": 0.0021980296285911915, "phrase": "key_process_indicators"}, {"score": 0.0021617722702730407, "phrase": "main_management_options"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Usability evaluation", " Decision making", " Simulation modelling", " Systems dynamics", " Software process improvement"], "paper_abstract": "Context: This paper is developed in the context of Usability Engineering. More specifically, it focuses on the use of modelling and simulation to help decision-making in the scope of usability evaluation. Objective: The main goal of this paper is to present UESim: a System Dynamics simulation model to help decision-making in the make-up of the usability evaluation team during the process of usability evaluation. Method: To develop this research we followed four main research phases: (a) study identification, (b) study development, (c) running and observation and finally, (d) reflexion. In relation with these phases the paper describes the literature revision, the model building and validation, the model simulation and its results and finally the reflexion on it. Results: We developed and validated a model to simulate the usability evaluation process. Through three different simulations we analysed the effects of different compositions of the evaluation team on the outcome of the evaluation. The simulation results show the utility of the model in the decision making of the usability evaluation process by changing the number and expertise of evaluators employed. Conclusion: One of the main advantages of using such a simulation model is that it allows developers to observe the evolution of the key indicators of the evaluation process over time. UESim represents a customisable tool to help decision-making in the management of the usability evaluation process, since it makes it possible to analyse how the key process indicators are affected by the main management options of the Usability Evaluation Process. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Using simulation to aid decision making in managing the usability evaluation process", "paper_id": "WOS:000345947500029"}