{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_information"}, {"score": 0.006391737823332312, "phrase": "teflon-soled_shoes"}, {"score": 0.004558564684763264, "phrase": "uncertain_situations"}, {"score": 0.004387225575447685, "phrase": "social_signals"}, {"score": 0.004222299135545249, "phrase": "important_information"}, {"score": 0.004108288481894523, "phrase": "previous_work"}, {"score": 0.0036419834462626125, "phrase": "infants'_region"}, {"score": 0.003485824905231454, "phrase": "slippery_teflon-soled"}, {"score": 0.0032107911131811057, "phrase": "standard_crepe-soled_shoes"}, {"score": 0.0030562674358159945, "phrase": "shallower_range"}, {"score": 0.0026070408483940535, "phrase": "shallow_slopes"}, {"score": 0.002323446065342625, "phrase": "infants'_use"}, {"score": 0.0022359278646792153, "phrase": "situational_factors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Infant locomotion", " Social cognition", " Perceptual exploration", " Walking", " Communication"], "paper_abstract": "In uncertain situations such as descending challenging slopes, social signals from caregivers can provide infants with important information for guiding action. Previous work showed that 18-month-old walking infants use social information selectively, only when risk of falling is uncertain. Experiment 1 was designed to alter infants' region of uncertainty for walking down slopes. Slippery Teflon-soled shoes drastically impaired 18-month-olds' ability to walk down slopes compared with walking barefoot or in standard crepe-soled shoes, shifting the region of uncertainty to a shallower range of slopes. In Experiment 2, infants wore Teflon-soled shoes while walking down slopes as their mothers encouraged and discouraged them from walking. Infants relied on social information on shallow slopes, even at 0 degrees, where the probability of walking successfully was uncertain in the Teflon-soled shoes. Findings indicate that infants' use of social information is dynamically attuned to situational factors and the state of their current abilities. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Using social information to guide action: Infants' locomotion over slippery slopes", "paper_id": "WOS:000284437700010"}