{"auto_keywords": [{"score": 0.04588787596498028, "phrase": "etl_processes"}, {"score": 0.008408917493449101, "phrase": "data_warehouses"}, {"score": 0.007092274656768956, "phrase": "unified_views_model"}, {"score": 0.00703628809860145, "phrase": "uvm"}, {"score": 0.004429566229017728, "phrase": "primary_problems"}, {"score": 0.004156691746581458, "phrase": "dynamic_approach"}, {"score": 0.00396308097989371, "phrase": "new_architecture"}, {"score": 0.0037785068155409946, "phrase": "unified"}, {"score": 0.0036893794227117194, "phrase": "source_data_level"}, {"score": 0.0034208822062692127, "phrase": "source_data"}, {"score": 0.0030602966787192745, "phrase": "transparency_access"}, {"score": 0.00295264307195965, "phrase": "unified_view_level_and_source_data_level"}, {"score": 0.0028601252251285025, "phrase": "unified_view_level"}, {"score": 0.002737616062137444, "phrase": "etl"}, {"score": 0.002578946584040053, "phrase": "conceptual_modeling"}, {"score": 0.002372103459168231, "phrase": "etl_tool"}, {"score": 0.0023253461255420436, "phrase": "uvetl"}, {"score": 0.0021559025985688255, "phrase": "case_study"}], "paper_keywords": ["ETL processes", " data warehouses", " unified views model", " UML profile", " conceptual modeling"], "paper_abstract": "Extraction-Transformation-Loading (ETL) tools are pieces of software responsible for the extraction of data from several sources, their cleaning, customization and insertion into Data Warehouses (DWs). Complexity, usability and maintainability are the primary problems concerning ETL processes. To deal with these problems, in this paper we provide a dynamic approach for designing, modeling and realizing ETL processes. We propose a new architecture based on Unified Views Model (UVM) for ETL processes, in which Unified view layer is added between source data level and DWs level. The unified views model serves as the means to conform the structure and semantics of the source data to the ones of the data warehouses, and help designers understand and analyze the meaning, relationships and lineage of information. In order to guarantee the transparency access and the usability, two mapping methods are adopted between Unified view level and source data level as well as between DWs level and Unified view level. Based on this architecture, the method of constructing UVM and ETL operations among three levels is given. Then, we describe how to build the conceptual modeling for ETL processes based on UVM by using an extension of the Unified Modeling Language (UML). Finally, we present an ETL tool based on UVM (UVETL) with the goal of facilitating the design, modeling and realization of ETL processes, and give a case study to exemplify the benefits of our proposal.", "paper_title": "AN APPROACH FOR DESIGNING, MODELING AND REALIZING ETL PROCESSES BASED ON UNIFIED VIEWS MODEL", "paper_id": "WOS:000294664900003"}