{"auto_keywords": [{"score": 0.0444227308407221, "phrase": "spanning_tree"}, {"score": 0.00481495049065317, "phrase": "basic_question"}, {"score": 0.004556901872357751, "phrase": "metric_space"}, {"score": 0.003980400251874277, "phrase": "fundamental_problem"}, {"score": 0.003940706575253453, "phrase": "network_design"}, {"score": 0.0038431888954930083, "phrase": "distortion_embeddings"}, {"score": 0.0031606404966938568, "phrase": "finite_metric_space"}, {"score": 0.002976019715894587, "phrase": "graph_setting"}, {"score": 0.0028877818105020434, "phrase": "weighted_graph"}, {"score": 0.0026516890043911836, "phrase": "arbitrary_trees"}, {"score": 0.002560162916190598, "phrase": "average_distortion"}, {"score": 0.002362620540317279, "phrase": "probabilistic_embedding"}, {"score": 0.0023390219342052623, "phrase": "spanning_trees"}, {"score": 0.0022925278792429553, "phrase": "scaling_distortion"}, {"score": 0.0021369416775353107, "phrase": "constant_lq-distortion"}], "paper_keywords": ["embedding", " constant average distortion", " spanning tree"], "paper_abstract": "This paper addresses the basic question of how well a tree can approximate distances of a metric space or a graph. Given a graph, the problem of constructing a spanning tree in a graph which strongly preserves distances in the graph is a fundamental problem in network design. We present scaling distortion embeddings where the distortion scales as a function of epsilon, with the guarantee that for each epsilon simultaneously, the distortion of a fraction 1 - epsilon of all pairs is bounded accordingly. Quantitatively, we prove that any finite metric space embeds into an ultrametric with scaling distortion O(root 1/epsilon). For the graph setting, we prove that any weighted graph contains a spanning tree with scaling distortion O(root 1/epsilon). These bounds are tight even for embedding into arbitrary trees. These results imply that the average distortion of the embedding is constant and that the l2 distortion is O(root log n). For probabilistic embedding into spanning trees we prove a scaling distortion of (O) over bar (log(2)(1/epsilon)), which implies constant lq-distortion for every fixed q < infinity.", "paper_title": "EMBEDDING METRICS INTO ULTRAMETRICS AND GRAPHS INTO SPANNING TREES WITH CONSTANT AVERAGE DISTORTION", "paper_id": "WOS:000353967100006"}