{"auto_keywords": [{"score": 0.04663131840076252, "phrase": "geographic_information_systems"}, {"score": 0.03517083259120442, "phrase": "expert_knowledge"}, {"score": 0.00481495049065317, "phrase": "knowledge_discovery"}, {"score": 0.004678785623021003, "phrase": "classification_trees"}, {"score": 0.0041001740903338834, "phrase": "classification_techniques"}, {"score": 0.0038713805573219297, "phrase": "straightforward_use"}, {"score": 0.0033922781038328844, "phrase": "business_documents"}, {"score": 0.003166259444961177, "phrase": "human_experts"}, {"score": 0.00298942278888105, "phrase": "classification_tree"}, {"score": 0.0029214769181390653, "phrase": "inductive_knowledge"}, {"score": 0.002758273619951683, "phrase": "next_node"}, {"score": 0.002416589459425828, "phrase": "spatial_relationships"}, {"score": 0.002375253757224999, "phrase": "geographic_objects"}, {"score": 0.0021049977753042253, "phrase": "inductive_style"}], "paper_keywords": [""], "paper_abstract": "The use of classification trees in two quite different application areas business documents on one side and geographic information systems on the other- is presented. What is in common between such so different applications of the classification techniques based on trees is the need of complementing the straightforward use of induction with the exploitation of some form of deductive, or better to say expert, knowledge. When working on business documents, the expert knowledge, in the form of rules elicited from human experts, is used to improve the construction of the classification tree by complementing the inductive knowledge coming from the examples in the choice of the next node to add to the tree. When working on geographic information systems, the expert knowledge, in the form of specifying which are the spatial relationships among the geographic objects, is used to extract the information from the GIS in a form that can be then processed in an inductive style.", "paper_title": "Examples of integration of induction and deduction in knowledge discovery", "paper_id": "WOS:000241529700017"}