{"auto_keywords": [{"score": 0.03938200907320262, "phrase": "systematic_search"}, {"score": 0.01188859382496294, "phrase": "complex_networks"}, {"score": 0.010260388056448027, "phrase": "consistency_index"}, {"score": 0.00481495049065317, "phrase": "complex_networks_concepts"}, {"score": 0.004733743998574891, "phrase": "scientific_papers"}, {"score": 0.004620093797504386, "phrase": "scientific_journals"}, {"score": 0.004575397892643882, "phrase": "major_parameter"}, {"score": 0.004542158659382197, "phrase": "individual_researchers"}, {"score": 0.004465532290517327, "phrase": "impact_factor"}, {"score": 0.00443308765153716, "phrase": "fair_assessment"}, {"score": 0.0038593680920994146, "phrase": "related_work"}, {"score": 0.003685067218455088, "phrase": "seminal_or_very_related_papers"}, {"score": 0.003527181559366122, "phrase": "science_repositories"}, {"score": 0.0033433365160336842, "phrase": "similarity_index"}, {"score": 0.0029602552900111407, "phrase": "\"complex_networks"}, {"score": 0.002778682854371595, "phrase": "citation_network"}, {"score": 0.002745060001962805, "phrase": "traditional_random_walk_search"}, {"score": 0.0026209522797963447, "phrase": "ingoing_edges"}, {"score": 0.002400944221804575, "phrase": "arxiv_repository"}, {"score": 0.0021049977753042253, "phrase": "virtual_scientometry"}], "paper_keywords": ["Complex networks", " Virtual scientometry", " Similarity network"], "paper_abstract": "The number of citations received by authors in scientific journals has become a major parameter to assess individual researchers and the journals themselves through the impact factor. A fair assessment therefore requires that the criteria for selecting references in a given manuscript should be unbiased with regard to the authors or journals cited. In this paper, we assess approaches for citations considering two recommendations for authors to follow while preparing a manuscript: (i) consider similarity of contents with the topics investigated, lest related work should be reproduced or ignored; (ii) perform a systematic search over the network of citations including seminal or very related papers. We use formalisms of complex networks for two datasets of papers from the arXiv and the Web of Science repositories to show that neither of these two criteria is fulfilled in practice. By representing the texts as complex networks we estimated a similarity index between pieces of texts and found that the list of references did not contain the most similar papers in the dataset. This was quantified by calculating a consistency index, whose maximum value is one if the references in a given paper are the most similar in the dataset. For the areas of \"complex networks\" and \"graphenes\", the consistency index was only 0.11-0.23 and 0.10-0.25, respectively. To simulate a systematic search in the citation network, we employed a traditional random walk search (i.e. diffusion) and a random walk whose probabilities of transition are proportional to the number of the ingoing edges of the neighbours. The frequency of visits to the nodes (papers) in the network had a very small correlation with either the actual list of references in the papers or with the number of downloads from the arXiv repository. Therefore, apparently the authors and users of the repository did not follow the criterion related to a systematic search over the network of citations. Based on these results, we propose an approach that we believe is fairer for evaluating and complementing citations of a given author, effectively leading to a virtual scientometry.", "paper_title": "Using complex networks concepts to assess approaches for citations in scientific papers", "paper_id": "WOS:000303533600011"}