{"auto_keywords": [{"score": 0.036239981319313816, "phrase": "radio_resources"}, {"score": 0.00481495049065317, "phrase": "correlated_data_gathering"}, {"score": 0.004696491408936132, "phrase": "machine_wireless_networks"}, {"score": 0.004112020122418323, "phrase": "individual_machines"}, {"score": 0.004077995480957875, "phrase": "better_quality"}, {"score": 0.003706299561774348, "phrase": "data_gathering"}, {"score": 0.0031647054743284947, "phrase": "\"datacentric\"_resource_allocation"}, {"score": 0.0030995835539697893, "phrase": "information_entropy"}, {"score": 0.002646412155387084, "phrase": "distributed_source_coding"}, {"score": 0.002624482632439123, "phrase": "dependent_source_coding"}, {"score": 0.002549146857303602, "phrase": "neighboring_machines"}, {"score": 0.0024656866249273125, "phrase": "joint_optimization_problems"}, {"score": 0.0024452510143564057, "phrase": "evaluation_results"}, {"score": 0.0023948981440134478, "phrase": "conventional_\"machine-centric\"_resource_allocation"}, {"score": 0.002335838283092986, "phrase": "aggregate_data_rates"}, {"score": 0.002297274552621268, "phrase": "supported_machines"}, {"score": 0.002268769196700254, "phrase": "data-centric\"_resource_allocation"}], "paper_keywords": ["Theory", " Performance", " Algorithm", " Information theory", " coding and compression", " node selection", " resource allocation", " transmission scheduling"], "paper_abstract": "Many applications involving machine-to-machine (M2M) communications are characterized by the large amount of data to transport. To support these M2M applications, we argue in this article that instead of focusing on serving individual machines with better quality, one should focus on solutions that can better serve the data itself. To substantiate, we consider the application of data gathering from a set of machines that communicate directly to an aggregator. Since the aggregator has limited radio resources, the problem arises as to how the resource can be effectively utilized for supporting such an application. We investigate \"datacentric\" resource allocation that aims to maximize information entropy of data collected through selecting the subset of machines to transmit, determining the amount of resources to allocate, and scheduling the sequence of transmissions. We present two instantiations of the problems when machines can perform distributed source coding or dependent source coding based on the data overheard from neighboring machines and then propose algorithms for solving the joint optimization problems. Evaluation results show that compared to conventional \"machine-centric\" resource allocation that aims to maximize the aggregate data rates or number of supported machines, \"data-centric\" resource allocation exhibits significant performance gain in terms of the quality of data that can be collected for the given amount of radio resources.", "paper_title": "Not Every Bit Counts: Data-Centric Resource Allocation for Correlated Data Gathering in Machine-to-Machine Wireless Networks", "paper_id": "WOS:000351443600017"}