{"auto_keywords": [{"score": 0.043018969385883586, "phrase": "syfsa"}, {"score": 0.03574824228788165, "phrase": "idealized_space"}, {"score": 0.010512226284760125, "phrase": "natural_space"}, {"score": 0.00481495049065317, "phrase": "technological_or_organizational_systems"}, {"score": 0.004761968711051715, "phrase": "systematic_procedures"}, {"score": 0.004726970265271088, "phrase": "best_practices"}, {"score": 0.004374593906165761, "phrase": "inherent_uncertainty"}, {"score": 0.004139028737420222, "phrase": "systematic_yet_flexible_systems_analysis"}, {"score": 0.003353521531649663, "phrase": "best_practice"}, {"score": 0.003243871564587106, "phrase": "ideal_conditions"}, {"score": 0.0031727643282003976, "phrase": "task_actions"}, {"score": 0.003035177667751495, "phrase": "system_space"}, {"score": 0.002935905915691203, "phrase": "redesigned_system"}, {"score": 0.0027469703311742647, "phrase": "task_constraints"}, {"score": 0.0025892330566358503, "phrase": "graceful_degradation"}, {"score": 0.0024136132575631273, "phrase": "simplified_central_line_insertion_task"}, {"score": 0.0022918601312169676, "phrase": "alternative_designs"}, {"score": 0.002176235362654451, "phrase": "relative_cognitive_workload"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Flexibility", " Information theory", " Problem space analysis", " Systematic Yet Flexible systems", " Human factors engineering"], "paper_abstract": "Although technological or organizational systems that enforce systematic procedures and best practices can lead to improvements in quality, these systems must also be designed to allow users to adapt to the inherent uncertainty, complexity, and variations in healthcare. We present a framework, called Systematic Yet Flexible Systems Analysis (SYFSA) that supports the design and analysis of Systematic Yet Flexible (SYF) systems (whether organizational or technical) by formally considering the tradeoffs between systematicity and flexibility. SYFSA is based on analyzing a task using three related problem spaces: the idealized space, the natural space, and the system space. The idealized space represents the best practice how the task is to be accomplished under ideal conditions. The natural space captures the task actions and constraints on how the task is currently done. The system space specifies how the task is done in a redesigned system, including how it may deviate from the idealized space, and how the system supports or enforces task constraints. The goal of the framework is to support the design of systems that allow graceful degradation from the idealized space to the natural space. We demonstrate the application of SYFSA for the analysis of a simplified central line insertion task. We also describe several information-theoretic measures of flexibility that can be used to compare alternative designs, and to measure how efficiently a system supports a given task, the relative cognitive workload, and learnability. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "SYFSA: A framework for Systematic Yet Flexible Systems Analysis", "paper_id": "WOS:000322413500009"}