{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "generated_dust"}, {"score": 0.04576021885069074, "phrase": "previous_methods"}, {"score": 0.03796095151175545, "phrase": "fine_debris"}, {"score": 0.004430629452265786, "phrase": "computer_graphics"}, {"score": 0.0042148594491580324, "phrase": "physically-based_simulation"}, {"score": 0.004054299982508618, "phrase": "relatively_large_size_fragments"}, {"score": 0.003319939715683536, "phrase": "dust_generation"}, {"score": 0.003158088307044493, "phrase": "unified_framework"}, {"score": 0.0025287979714720423, "phrase": "fracture_energy"}, {"score": 0.002275369652100353, "phrase": "proposed_method"}, {"score": 0.0022007302738063566, "phrase": "generated_effects"}, {"score": 0.002164331818029166, "phrase": "simulation_speed"}, {"score": 0.0021049977753042253, "phrase": "simulation_results"}], "paper_keywords": ["Destruction simulation", " Fine debris", " Dust generation", " Voronoi diagram"], "paper_abstract": "Simulating the destruction of objects due to collisions has many applications in computer graphics. Previous methods on the destruction of objects perform physically-based simulation of the fracture of objects into relatively large size fragments. However, if we observe the process of the destruction of objects, we can see that dust and fine debris are also generated. In particular, previous methods do not take into account the dust generation. In this paper, we present a unified framework for simulating destruction and the generated dust and various sizes of debris. Our method simulates destruction on three different scales: coarse fracture, fine debris and dust. We compute the distribution and the amount of fine debris and dust based on the fracture energy which is the energy that causes the object to be fractured. We demonstrate the effectiveness of the proposed method, in terms of the generated effects and the simulation speed, by showing the simulation results of destruction caused by the collision between objects.", "paper_title": "A fast method for simulating destruction and the generated dust and debris", "paper_id": "WOS:000265539300038"}