{"auto_keywords": [{"score": 0.04617998264114106, "phrase": "medical_consultations"}, {"score": 0.00481495049065317, "phrase": "doctor-patient_conversation"}, {"score": 0.004294381488413906, "phrase": "patient's_records"}, {"score": 0.004012751049253625, "phrase": "adjacent_conversational_turns"}, {"score": 0.003978866233891427, "phrase": "conversation_analysis"}, {"score": 0.0036553070575015344, "phrase": "'free_turn"}, {"score": 0.0034299649219748513, "phrase": "intervening_pauses"}, {"score": 0.0029691377785333872, "phrase": "gp's_records"}, {"score": 0.002833689453299307, "phrase": "subsequent_analysis"}, {"score": 0.002809732883291955, "phrase": "topic_changes"}, {"score": 0.0025375331660958665, "phrase": "previous_topic"}, {"score": 0.0024858553289631743, "phrase": "data"}, {"score": 0.0023309080951251335, "phrase": "family_conversations"}, {"score": 0.0021501863832966966, "phrase": "possible_outcomes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Medical interaction", " Conversational pauses", " User interface design"], "paper_abstract": "Talk is often suspended during medical consultations while the clinician interacts with the patient's records and other information This study of four general practitioners (GPs) focused on these suspensions and the adjacent conversational turns. Conversation analysis revealed how GPs took action to close conversations down prior to attending to the records. resulting in a 'free turn' that could be taken up by either GP or patient The durations of the Intervening pauses were also analysed, exposing a hitherto unobserved 10-second timeframe within which both GP and patient showed a preference for the conversation to be resumed. Resumption was more likely to be achieved within 10 s when the GP's records were paper-based rather than computer-based. Subsequent analysis of topic changes on resumption of talk has revealed a 5-second timeframe, also undocumented, when pauses exceed this timeframe. it is rare for the previous topic to be resumed without a restatement Data recorded in the home suggest that these timeframes are also present in family conversations We argue for considering the two timeframes when designing systems for use in medical consultations and other conversational settings, and discuss possible outcomes (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Pauses in doctor-patient conversation during computer use: The design significance of their durations and accompanying topic changes", "paper_id": "WOS:000277930900007"}