{"auto_keywords": [{"score": 0.04475945425521394, "phrase": "linear_systems"}, {"score": 0.02551315525982757, "phrase": "wire-to-surface_junction_configuration"}, {"score": 0.014669418879075476, "phrase": "pec"}, {"score": 0.011740130220972665, "phrase": "wire-to-surface_junctions"}, {"score": 0.008713768692145013, "phrase": "fast-multipole_method"}, {"score": 0.008627541388969052, "phrase": "-pec_problems"}, {"score": 0.008584745465593709, "phrase": "triangular_type_wire-to-surface_junctions"}, {"score": 0.007302833447254299, "phrase": "far-field_terms"}, {"score": 0.00712324819462577, "phrase": "wire-to-surface_junction"}, {"score": 0.0065285472436279746, "phrase": "open-pec_problems"}, {"score": 0.006073360231161541, "phrase": "iterative_solver"}, {"score": 0.004512372714977782, "phrase": "perfect_electric_conductors"}, {"score": 0.004228728526110331, "phrase": "preconditioning_technique"}, {"score": 0.004155444164634209, "phrase": "fmm_scheme"}, {"score": 0.00400263757329054, "phrase": "impedance_matrix"}, {"score": 0.00379806606244624, "phrase": "convenient_form"}, {"score": 0.003732217713481807, "phrase": "fmm."}, {"score": 0.003713612964777365, "phrase": "iterative_scheme"}, {"score": 0.0036583529244497504, "phrase": "condition_number"}, {"score": 0.003445386206446506, "phrase": "crout_version"}, {"score": 0.0033771793949625806, "phrase": "convergence_rate"}, {"score": 0.003261039859823686, "phrase": "proposed_formulations"}, {"score": 0.002899491103450063, "phrase": "convergence_records"}, {"score": 0.002842060319876433, "phrase": "iluc_preconditioning_strategy"}, {"score": 0.002689907959061299, "phrase": "proposed_fmm_strategy"}, {"score": 0.0025779232815774807, "phrase": "antenna_arrays"}, {"score": 0.0025650581474069424, "phrase": "electromagnetic_compatibility_problems"}, {"score": 0.002520532409176914, "phrase": "overall_electromagnetic_simulation_progress"}, {"score": 0.0024705891356454524, "phrase": "dense_impedance_matrix"}, {"score": 0.0021049977753042253, "phrase": "iluc_preconditioner"}], "paper_keywords": ["electromagnetism", " numerical analysis", " electrical impedance"], "paper_abstract": "Purpose - The paper aims to focus on: implementation of the fast-multipole method (FMM) to open perfect electric conductors (PEC) problems involving triangular type wire-to-surface junctions; investigation and analysis of the effect of wire-to-surface junction configuration on the conditioning of the linear systems; application of the preconditioning technique to improve the efficiency of the FMM scheme on such problems. Design/methodology/approach - A complete set of formulations is proposed to evaluate the far-field terms of the impedance matrix that represent the couplings between the wire-to-surface junction and standard wire and PEC surfaces. The formulations are derived in a convenient form suitable for the application of the FMM. An iterative scheme is adopted to estimate the condition number of the linear systems arising from open-PEC problems with wire-to-surface junctions and to investigate the effect of wire-to-surface junction configuration on the conditioning of the linear systems. The Crout version of ILU (ILUC) preconditioning strategy is applied to improve the convergence rate of the iterative solver on such problems. Findings - The solutions show that the proposed formulations have accurately evaluated the far-field terms that represent the couplings between the wire-to-surface junction and standard wire and PEC surfaces. The investigation of the conditioning of open-PEC problems with junctions shows that the effect of the wire-to-surface junction configuration induced to the conditioning of the linear systems is negligible. The convergence records of several open-PEC problems involving wire-to-surface junctions show that the ILUC preconditioning strategy is suitable to apply to such problems, as it significantly improves the performance of the iterative solver. Practical implications - The proposed FMM strategy can be applied to many practical large-scale open-PEC problems that involve wire-to-surface junctions, such as antenna arrays and electromagnetic compatibility problems, to effectively speed up the overall electromagnetic simulation progress and overcome the bottleneck associated with the dense impedance matrix of the method-of-moments. Originality/value - The application of the FMM to open-PEC problems that involve wire-to-surface junctions has yet to be reported, which has been addressed in this work. This work also investigates the conditioning of such problems and analyzes the effect of wire-to-surface junction configuration on the conditioning of the linear systems. In addition, the performance of the ILUC preconditioner on such problems has not been reported, which has also been included in this report.", "paper_title": "The fast-multipole method applied to open-PEC problems with triangular type wire-to-surface junctions", "paper_id": "WOS:000256573500008"}