{"auto_keywords": [{"score": 0.04392019422481263, "phrase": "protein-coding_genes"}, {"score": 0.0061460226647442615, "phrase": "reannotating_algorithm"}, {"score": 0.00481495049065317, "phrase": "falsely_predicted_protein-coding_genes"}, {"score": 0.0046621835537196754, "phrase": "graphical_representation"}, {"score": 0.004081385289516914, "phrase": "modified_method"}, {"score": 0.004032302251481604, "phrase": "i-tn_curve"}, {"score": 0.0037955672944969287, "phrase": "corresponding_negative_samples"}, {"score": 0.003558294449586273, "phrase": "jackknife_test"}, {"score": 0.0026932247685847246, "phrase": "present_method"}, {"score": 0.002534906456854208, "phrase": "chlorobium_tepidum_tls_genome"}, {"score": 0.0024444073418288703, "phrase": "sufficient_sequences_analysis"}, {"score": 0.002385872451981323, "phrase": "random_sequences"}, {"score": 0.00224558083320154, "phrase": "significative_analysis"}, {"score": 0.0021917966722180132, "phrase": "artificial_parameters"}, {"score": 0.002165388556451298, "phrase": "graphical_representation_approaches"}, {"score": 0.0021220787047953093, "phrase": "helpful_information"}, {"score": 0.0021049977753042253, "phrase": "related_researches"}], "paper_keywords": [""], "paper_abstract": "The problem that how many protein-coding genes exist in Aeropyrum pernix K1 genome has confused many scientists since 1999. In this paper, we attempt to re-identify the protein-coding genes in this genome by proposing a modified method based on I-TN curve. Consequently, all of the 727 experimentally validated protein-coding genes and 726 of the corresponding negative samples are correctly predicted respectively, then an accuracy of 99.93% of self-test is obtained. In the Jackknife test, two positive samples and two negative samples are falsely predicted, respectively, and then the accuracy of cross-validation is 99.72%. In the testing set, all of the 132 putative genes are correctly predicted as protein-coding and 14 out of the 841 hypothetical genes are predicted as non-coding, the number of protein-coding genes is reduced to 1686 instead of 1700. Further analysis shows the performance of the reannotating algorithm is comparable to other prevalent programs, and the present method is much simple and efficient. We implement the reannotating algorithm trained by Aeropyrum pernix K1 to Chlorobium tepidum TLS genome, and 217 hypothetical genes are predicted as non-coding. Sufficient sequences analysis indicates most of them are random sequences that are falsely predicted as protein-coding genes. In addition, we also perform some significative analysis aiming to the influence of artificial parameters on the graphical representation approaches, which may provide helpful information for related researches.", "paper_title": "Discriminate the Falsely Predicted Protein-Coding Genes in Aeropyrum Pernix K1 Genome Based on Graphical Representation", "paper_id": "WOS:000304500100016"}