{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distributed"}, {"score": 0.004439097815805505, "phrase": "multi-robot_patrolling_problem"}, {"score": 0.003983016985197904, "phrase": "centralized_planners"}, {"score": 0.003947186611084043, "phrase": "global_knowledge"}, {"score": 0.0038764861784138117, "phrase": "priori_routes"}, {"score": 0.00298238929037041, "phrase": "first_technique"}, {"score": 0.0028764048059439205, "phrase": "robot's_local_gain"}, {"score": 0.0028376361457661415, "phrase": "second_one"}, {"score": 0.0024774888010414206, "phrase": "proposed_solution"}, {"score": 0.0024220634963019114, "phrase": "realistic_simulations"}, {"score": 0.0023571835517819124, "phrase": "robot_platforms"}, {"score": 0.0023253967212081626, "phrase": "small_lab_scenario"}, {"score": 0.00222249726328354, "phrase": "large_indoor_real-world_environment"}, {"score": 0.0021727640931660038, "phrase": "autonomous_mobile_robots"}, {"score": 0.0021337783230121286, "phrase": "fault-tolerance_assessment"}], "paper_keywords": ["Distributed systems", " Multi-robot patrol", " Scalability", " Fault-tolerance", " Security"], "paper_abstract": "This paper addresses the Multi-Robot Patrolling Problem, where agents must coordinate their actions while continuously deciding which place to move next after clearing their locations. This problem is commonly addressed using centralized planners with global knowledge and/or calculating a priori routes for all robots before the beginning of the mission. In this work, two distributed techniques to solve the problem are proposed. These are motivated by the need to adapt to the changes in the system at any time and the possibility to add or remove patrolling agents (e.g., due to faults). The first technique presented is greedy and aims to maximize robot's local gain. The second one is an extension of the former, which takes into account the distribution of agents in the space to reduce interference and foster scalability. The validation of the proposed solution is preliminarily conducted through realistic simulations as well as experiments with robot platforms in a small lab scenario. Subsequently, the work is verified in a large indoor real-world environment with a team of autonomous mobile robots with scalability and fault-tolerance assessment. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Distributed multi-robot patrol: A scalable and fault-tolerant framework", "paper_id": "WOS:000328178200025"}