{"auto_keywords": [{"score": 0.008559388843185136, "phrase": "domain_experts"}, {"score": 0.00481495049065317, "phrase": "automated_regulatory_compliance"}, {"score": 0.004772966298144304, "phrase": "construction_sector"}, {"score": 0.0047313464483758364, "phrase": "key_concern"}, {"score": 0.004622117681584223, "phrase": "regulatory_compliance"}, {"score": 0.004502232973788714, "phrase": "depth_technical_knowledge"}, {"score": 0.004347188587990755, "phrase": "technical_detail"}, {"score": 0.004005783122073581, "phrase": "rule-based_semantic_approach"}, {"score": 0.0037894584172273316, "phrase": "extensive_software_development"}, {"score": 0.003712727798045068, "phrase": "key_idea"}, {"score": 0.0035327654197058345, "phrase": "target_domain"}, {"score": 0.003381208502323146, "phrase": "data_format"}, {"score": 0.003179854375044433, "phrase": "semantic_domain"}, {"score": 0.003043391229097643, "phrase": "often_diverse_nature"}, {"score": 0.0029992135990155374, "phrase": "particular_domain"}, {"score": 0.002964332290433157, "phrase": "specific_semantics"}, {"score": 0.002723253153997129, "phrase": "construction_domain"}, {"score": 0.00261397020353106, "phrase": "real_building_data"}, {"score": 0.0025835577237136257, "phrase": "industry_specific_format"}, {"score": 0.002443849144972008, "phrase": "complex_sets"}, {"score": 0.0024295886469293962, "phrase": "construction_regulations"}, {"score": 0.002401316206692149, "phrase": "full_automation"}, {"score": 0.002380327476198495, "phrase": "regulation_scheme"}, {"score": 0.002325247976657323, "phrase": "positive_results"}, {"score": 0.002231901054023083, "phrase": "regulatory_compliance_systems"}, {"score": 0.0021422934905256956, "phrase": "tangible_benefits"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Compliance checking", " Regulations", " Rule engine", " Construction industry", " Regulatory compliance", " Semantics of regulations", " Semantics of Regulatory Compliance"], "paper_abstract": "A key concern for professionals in any industry is ensuring regulatory compliance. Regulations are often complex and require in depth technical knowledge of the domain in which they operate. The level of technical detail and complexity in regulations is a barrier to their automation due to extensive software development time and costs that are involved. In this paper we present a rule-based semantic approach formulated as a methodology to overcome these issues by allowing domain experts to specify their own regulatory compliance systems without the need for extensive software development. Our methodology is based on the key idea that three semantic contexts are needed to fully understand the regulations being automated: the semantics of the target domain, the specific semantics of regulations being considered, and the semantics of the data format that is to be checked for compliance. This approach allows domain experts to create and maintain their own regulatory compliance systems, within a semantic domain that is familiar to them. At the same time, our approach allows for the often diverse nature of semantics within a particular domain by decoupling the specific semantics of regulations from the semantics of the domain itself. This paper demonstrates how our methodology has been validated using a series of regulations automated by professionals within the construction domain. The regulations that have been developed are then in turn validated on real building data stored in an industry specific format (the IFCs). The adoption of this methodology has greatly advanced the process of automating these complex sets of construction regulations, allowing the full automation of the regulation scheme within 18 months. We believe that these positive results show that, by adopting our methodology, the barriers to the building of regulatory compliance systems will be greatly lowered and the adoption of three semantic domains proposed by our methodology provides tangible benefits. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A rule-based semantic approach for automated regulatory compliance in the construction sector", "paper_id": "WOS:000353746900016"}