{"auto_keywords": [{"score": 0.03761231727491441, "phrase": "sanitization_process"}, {"score": 0.00481495049065317, "phrase": "rapid_and_secure_device_sanitization"}, {"score": 0.004761132425263795, "phrase": "public_and_private_organizations"}, {"score": 0.004254814649568355, "phrase": "information_technology"}, {"score": 0.003823584649521733, "phrase": "reliable_and_efficient_methods"}, {"score": 0.0034359094594153304, "phrase": "persistent_malware"}, {"score": 0.003266201217790818, "phrase": "johns_hopkins_university_applied_physics_laboratory"}, {"score": 0.003018668521745676, "phrase": "sanitization_method"}, {"score": 0.0028857130140890787, "phrase": "network_devices"}, {"score": 0.0025208755851561368, "phrase": "magnitude_reduction"}, {"score": 0.0023166075278110237, "phrase": "significant_improvement"}, {"score": 0.0021773853011112882, "phrase": "persistent_malware_removal"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data privacy", " Data sanitization", " Disk sanitization", " NVRAM sanitization", " Security and privacy protection"], "paper_abstract": "Public and private organizations face the challenges of protecting their networks from cyber-attacks, while reducing the amount of time and money spent on Information Technology. Organizations can reduce their expenditures by reusing server, switch and router hardware, but they must use reliable and efficient methods of sanitizing these devices before they can be redeployed. The sanitization process removes proprietary, sensitive or classified data, as well as persistent malware from a device prior to reuse. The Johns Hopkins University Applied Physics Laboratory has developed an automated, rapid, and secure method for sanitizing servers, switches and routers. This sanitization method was implemented and tested on several different types of network devices during the Cyber Measurement & Analysis Center project, which was funded under Phases I and II of the DARPA (2008) National Cyber Range program. The performance of the automated sanitization system was excellent with an order of magnitude reduction in the time required to sanitize servers, routers and switches, and a significant improvement in the effectiveness of the sanitization process through the addition of persistent malware removal. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An automated system for rapid and secure device sanitization", "paper_id": "WOS:000335201000008"}