{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "carried_items"}, {"score": 0.004771196027464407, "phrase": "urban_environments"}, {"score": 0.004727837281331949, "phrase": "virtual_heritage"}, {"score": 0.004706305193222972, "phrase": "architectural_and_cultural_reconstructions"}, {"score": 0.004516856326107826, "phrase": "simulated_people"}, {"score": 0.004374772264092067, "phrase": "important_human_modeling_issues"}, {"score": 0.004256533389293113, "phrase": "situationally_appropriate_clothing"}, {"score": 0.003956558420993431, "phrase": "portable_items"}, {"score": 0.0036275736378775757, "phrase": "end_goal"}, {"score": 0.0028995712226514746, "phrase": "estimated_age_category"}, {"score": 0.0027073229284666294, "phrase": "basic_statistical_analysis"}, {"score": 0.0024706232839499524, "phrase": "indoor_setting"}, {"score": 0.0024147474002390763, "phrase": "outdoor_setting"}, {"score": 0.0021049977753042253, "phrase": "wide_range"}], "paper_keywords": [""], "paper_abstract": "Virtual heritage architectural and cultural reconstructions may be enhanced by populating the environment with simulated people. There are a number of important human modeling issues to address, such as situationally appropriate clothing, occupations, and behaviors. Our interest here is focused on how people interact with portable items in their environment: namely, whether they are carrying items and what those items are. With an end goal of enabling lifelike, data-driven, agent-based populace simulations, we conducted an informal but systematic ethnographic observational study of the items carried by more than 3,000 people in two different urban community environments: an indoor market and an outdoor city plaza. We recorded the number and types of items carried by each person, along with their gender, estimated age category, and whether they were alone or in a group. We performed a basic statistical analysis of the results. There were two highly significant findings: (1) a strong and similar majority of all people carry at least one item (76.63% in the indoor setting and 79.79% in the outdoor setting); and (2) the types and amounts of items carried were highly consistent across the two different environments, implying that the data may be applicable in a wide range of scenarios.", "paper_title": "The Distribution of Carried Items in Urban Environments", "paper_id": "WOS:000367239600003"}