{"auto_keywords": [{"score": 0.04940203756018457, "phrase": "alzheimer's_disease"}, {"score": 0.012333903339198827, "phrase": "everyday_cooking_activities"}, {"score": 0.00629895648100481, "phrase": "dual-modal_virtual_reality_platform"}, {"score": 0.004713162564945179, "phrase": "everyday_action_impairment"}, {"score": 0.004629977311316031, "phrase": "diagnostic_criteria"}, {"score": 0.004436247158342735, "phrase": "functional_autonomy"}, {"score": 0.004131135118662576, "phrase": "error_reduction"}, {"score": 0.0040726680518382965, "phrase": "naturalistic_clinical_settings"}, {"score": 0.0037387746981660717, "phrase": "training_tool"}, {"score": 0.0037122133844189296, "phrase": "everyday_activities"}, {"score": 0.0035567476133074533, "phrase": "virtual_kitchen"}, {"score": 0.0031845067058084613, "phrase": "training_methods"}, {"score": 0.0029652292779277782, "phrase": "verbal_interview"}, {"score": 0.002881793492919646, "phrase": "subjective_responses"}, {"score": 0.0028207566216121856, "phrase": "vr_experience"}, {"score": 0.002385166298265828, "phrase": "short_learning_session"}, {"score": 0.002342972434255588, "phrase": "learning_method"}, {"score": 0.0022933216359142736, "phrase": "preliminary_support"}, {"score": 0.0021049977753042253, "phrase": "clinical_application"}], "paper_keywords": [""], "paper_abstract": "Everyday action impairment is one of the diagnostic criteria of Alzheimer's disease and is associated with many serious consequences, including loss of functional autonomy and independence. It has been shown that the ( re) learning of everyday activities is possible in Alzheimer's disease by using error reduction teaching approaches in naturalistic clinical settings. The purpose of this study is to develop a dual-modal virtual reality platform for training in everyday cooking activities in Alzheimer's disease and to establish its value as a training tool for everyday activities in these patients. Two everyday tasks and two error reduction learning methods were implemented within a virtual kitchen. Two patients with Alzheimer's disease and two healthy elderly controls were tested. All subjects were trained in two learning sessions on two comparable cooking tasks. Within each group (i.e., patients and controls), the order of the training methods was counterbalanced. Repeated measure analysis before and after learning was performed. A questionnaire of presence and a verbal interview were used to obtain information about the subjective responses of the participants to the VR experience. The results in terms of errors, omissions, and perseverations (i.e., repetitive behaviors) indicate that the patients performed worse than the controls before learning, but that they reached a level of performance similar to that of the controls after a short learning session, regardless of the learning method employed. This finding provides preliminary support for the value of the dual-modal virtual reality platform for training in everyday cooking activities in Alzheimer's disease. However, further work is needed before it is ready for clinical application.", "paper_title": "A Dual-Modal Virtual Reality Kitchen for (Re) Learning of Everyday Cooking Activities in Alzheimer's Disease", "paper_id": "WOS:000304449500005"}