{"auto_keywords": [{"score": 0.040292626420034255, "phrase": "query_language"}, {"score": 0.013979496522088042, "phrase": "real_polynomial_constraints"}, {"score": 0.0119239834774906, "phrase": "euclidean_distance"}, {"score": 0.004815135315794928, "phrase": "first-order"}, {"score": 0.004764859786310636, "phrase": "constructible_spatial_database_queries"}, {"score": 0.004537875262684779, "phrase": "constraint_databases"}, {"score": 0.004443923599512759, "phrase": "revesz"}, {"score": 0.003946960862020283, "phrase": "polynomial_constraints"}, {"score": 0.003919515745050147, "phrase": "severe_implications"}, {"score": 0.0038787040860731935, "phrase": "expressive_power"}, {"score": 0.0037196472104696157, "phrase": "spatial_data"}, {"score": 0.003444732262403694, "phrase": "two-dimensional_constraint_databases"}, {"score": 0.0033615796302502547, "phrase": "constraint_model"}, {"score": 0.003303412571939192, "phrase": "linear_model"}, {"score": 0.0031348622158167195, "phrase": "euclidean_constructions"}, {"score": 0.0029852932802967224, "phrase": "programming_language"}, {"score": 0.002954180291607795, "phrase": "exactly_the_first-order_ruler-and-compass_constructions"}, {"score": 0.002506894277338543, "phrase": "natural_way"}, {"score": 0.0024634797027967203, "phrase": "finite_point_databases"}, {"score": 0.0022574026832458344, "phrase": "safe_fragment"}, {"score": 0.0021049977753042253, "phrase": "full_power"}], "paper_keywords": ["constraint databases", " real algebraic geometry", " first-order logic", " query languages", " ruler-and-compass constructions"], "paper_abstract": "The research presented in this paper is situated in the framework of constraint databases introduced by Kanellakis, Kuper, and Revesz in their seminal paper of 1990, specifically, the language with real polynomial constraints (FO + poly). For reasons of efficiency, this model is implemented with only linear polynomial constraints, but this limitation to linear polynomial constraints has severe implications on the expressive power of the query language. In particular, when used for modeling spatial data, important queries that involve Euclidean distance are not expressible. The aim of this paper is to identify a class of two-dimensional constraint databases and a query language within the constraint model that go beyond the linear model and allow the expression of queries concerning distance. We seek inspiration in the Euclidean constructions, i.e., constructions by ruler and compass. We first present a programming language that captures exactly the first-order ruler-and-compass constructions that are expressible in a first-order language with real polynomial constraints. If this language is extended with a while operator, we obtain a language that is complete for all ruler-and-compass constructions in the plane. We then transform this language in a natural way into a query language on finite point databases, but this language turns out to have the same expressive power as FO + poly and is therefore too powerful for our purposes. We then consider a safe fragment of this language and use this to construct a query language that allows the expression of Euclidean distance without having the full power of FO + poly.", "paper_title": "First-order languages expressing constructible spatial database queries", "paper_id": "WOS:000246299400003"}