{"auto_keywords": [{"score": 0.042458767687099844, "phrase": "dominating_set"}, {"score": 0.022888340513429906, "phrase": "dominating_set_problem"}, {"score": 0.022720676443770953, "phrase": "solution_size"}, {"score": 0.010612387000973441, "phrase": "claw-free_graphs"}, {"score": 0.009514163557077533, "phrase": "induced_subgraph"}, {"score": 0.00536626745829837, "phrase": "graph_classes"}, {"score": 0.0044563926211018704, "phrase": "complete_bipartite_graph"}, {"score": 0.0041141366614244074, "phrase": "claw-free_graph"}, {"score": 0.0037791348730306074, "phrase": "fpt_algorithm"}, {"score": 0.0036583529244497504, "phrase": "fft_algorithm"}, {"score": 0.003454008016586962, "phrase": "fixed_i"}, {"score": 0.0024705891356454524, "phrase": "related_connected_dominating_set"}, {"score": 0.0024582583326918876, "phrase": "dominating_clique_problems"}, {"score": 0.0023266052292186157, "phrase": "clique_problem"}, {"score": 0.002274796550579261, "phrase": "general_graphs"}, {"score": 0.0022465129832337396, "phrase": "t-claw-free_graphs"}, {"score": 0.002207504495379295, "phrase": "small_and_growing_collection"}, {"score": 0.0021637502817054115, "phrase": "excluded_subgraphs"}, {"score": 0.0021368444454600093, "phrase": "excluded_minors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fixed parameter tractability", " Dominating set", " Claw-free graphs", " Clique", " Connected dominating set"], "paper_abstract": "We show that the DOMINATING SET problem parameterized by solution size is fixed-parameter tractable (FPT) in graphs that do not contain the claw (K(1,3), the complete bipartite graph on four vertices where the two parts have one and three vertices, respectively) as an induced subgraph. We present an algorithm that uses 2(o)(k(2))n(o(1)) time and polynomial space to decide whether a claw-free graph on n vertices has a dominating set of size at most k. Note that this parameterization of DOMINATING SET is W[2]-hard on the set of all graphs, and thus is unlikely to have an FPT algorithm for graphs in general. The most general class of graphs for which an FFT algorithm was previously known for this parameterization of DOMINATING SET is the class of K(i,j)-free graphs, which exclude, for some fixed i, j is an element of N, the complete bipartite graph K(i,j) as a subgraph. For i, j >= 2, the class of claw-free graphs and any class of K(i,j)-free graphs are not comparable with respect to set inclusion. We thus extend the range of graphs over which this parameterization of DOMINATING SET is known to be fixed-parameter tractable. We also show that, in some sense, it is the presence of the claw that makes this parameterization of the DOMINATING SET problem hard. More precisely, we show that for any t >= 4, the DOMINATING SET problem parameterized by the solution size is W[2]-hard in graphs that exclude the t-claw K(l,t) as an induced subgraph. Our arguments also imply that the related CONNECTED DOMINATING SET and DOMINATING CLIQUE problems are W[2]-hard in these graph classes. Finally, we show that for any t is an element of N, the CLIQUE problem parameterized by solution size, which is W[1]-hard on general graphs, is FPT in t-claw-free graphs. Our results add to the small and growing collection of FPI results for graph classes defined by excluded subgraphs, rather than by excluded minors. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Dominating set is fixed parameter tractable in claw-free graphs", "paper_id": "WOS:000297442600009"}