{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "genetic_and_structural_features"}, {"score": 0.004283280680222718, "phrase": "structural_features"}, {"score": 0.004010342699414496, "phrase": "probabilistically_modeling_mutations"}, {"score": 0.003700170452390401, "phrase": "unique_statistical_procedure"}, {"score": 0.0034139056533151, "phrase": "different_co-receptors"}, {"score": 0.0031961879138783012, "phrase": "complicated_interactions"}, {"score": 0.002927278301452369, "phrase": "dual_usage"}, {"score": 0.002622647280008795, "phrase": "molecular_modeling_analyses"}, {"score": 0.0025468951021098717, "phrase": "new_insights"}, {"score": 0.0025098414374397308, "phrase": "molecular_basis"}, {"score": 0.002298544073884724, "phrase": "genotypic_tropism_testing"}, {"score": 0.002265095354846931, "phrase": "clinical_practice"}, {"score": 0.0021049977753042253, "phrase": "new_entry-inhibitors"}], "paper_keywords": [""], "paper_abstract": "Motivation: To define V3 genetic elements and structural features underlying different HIV-1 co-receptor usage in vivo. Results: By probabilistically modeling mutations in the viruses isolated from HIV-1 B subtype patients, we present a unique statistical procedure that would first identify V3 determinants associated with the usage of different co-receptors cooperatively or independently, and then delineate the complicated interactions among mutations functioning cooperatively. We built a model based on dual usage of CXCR4 and CCR5 co-receptors. The molecular basis of our statistical predictions is further confirmed by phenotypic and molecular modeling analyses. Our results provide new insights on molecular basis of different HIV-1 co-receptor usage. This is critical to optimize the use of genotypic tropism testing in clinical practice and to obtain molecular-implication for design of vaccine and new entry-inhibitors.", "paper_title": "Detecting and understanding genetic and structural features in HIV-1 B subtype V3 underlying HIV-1 co-receptor usage", "paper_id": "WOS:000315158500006"}