{"auto_keywords": [{"score": 0.042051296116313676, "phrase": "institutional_context"}, {"score": 0.01547004523638634, "phrase": "csr"}, {"score": 0.014508871120916401, "phrase": "galicia"}, {"score": 0.008160258761428039, "phrase": "theoretical_framework"}, {"score": 0.00481495049065317, "phrase": "institutional_theory"}, {"score": 0.0047761092701293474, "phrase": "corporate_social_responsibility"}, {"score": 0.0044045477797319075, "phrase": "spain"}, {"score": 0.0043161190928529755, "phrase": "northern_region"}, {"score": 0.004281305526646578, "phrase": "portugal"}, {"score": 0.004061584718427419, "phrase": "isomorphic_behaviour"}, {"score": 0.0035819501337406596, "phrase": "structural_equations_models"}, {"score": 0.003524322230452833, "phrase": "visual-pls."}, {"score": 0.003329804436286295, "phrase": "csr_practices"}, {"score": 0.003120568497402472, "phrase": "proposed_model"}, {"score": 0.003057910095857785, "phrase": "system_theory"}, {"score": 0.0029965060407413898, "phrase": "main_findings"}, {"score": 0.0027184540871935284, "phrase": "proposed_research_model"}, {"score": 0.002599763359352916, "phrase": "geographic_areas"}, {"score": 0.0025167026017217926, "phrase": "explanatory_capacity"}, {"score": 0.002387337550919433, "phrase": "main_contributions"}, {"score": 0.0022281257694320455, "phrase": "geographical_area"}], "paper_keywords": ["Management", " Sustainability", " Systems theory"], "paper_abstract": "Purpose - The authors want to study the connection between institutional theory and corporate social responsibility (CSR) in the set of hotels with three, four and five star situated in Galicia (Spain) and in the Northern region of Portugal. The authors aim to see whether there is a contrast of isomorphic behaviour in the institutional context of both regions. Design/methodology/approach - A quantitative study in which the authors apply the partial least square (PLS) technique, a methodology based on structural equations models using the software Visual-PLS. The authors intend to study the relationships between the pressures of institutional context and CSR practices, together with the relationship between legitimacy and these practices. The focus of the proposed model is based on the system theory. Findings - The main findings of this research clearly show that hotels are incorporated into an institutional context marked by enforced and regulatory pressures. Research limitations/implications - The proposed research model can be replicated using other units of study, sectors, geographic areas, among others, due to the explanatory capacity of the theoretical framework used. Originality/value - The originality of this work derives from the main contributions based on the theoretical framework (institutional theory and CSR), the object of study and geographical area (three, four and five star hotels located in Galicia and in the North of Portugal), the context (economic crisis), the field of study (private sphere) and the type of organizations (profit making).", "paper_title": "Institutional context and hotel social responsibility", "paper_id": "WOS:000334146900007"}