{"auto_keywords": [{"score": 0.04079379762467102, "phrase": "fusion_center"}, {"score": 0.012219592826017341, "phrase": "full_or_partial_knowledge"}, {"score": 0.00481495049065317, "phrase": "decentralized_detection"}, {"score": 0.004677847043645765, "phrase": "decentralized_binary_hypothesis_testing_problem"}, {"score": 0.004264697351852424, "phrase": "compressed_summaries"}, {"score": 0.0037989951856280423, "phrase": "second_message"}, {"score": 0.0036694287631595995, "phrase": "first_messages"}, {"score": 0.003503497128638099, "phrase": "one-message_feedback_architectures"}, {"score": 0.0028781635703691616, "phrase": "bayesian"}, {"score": 0.0025631294247072476, "phrase": "feedback_messages"}, {"score": 0.002461313735611462, "phrase": "sensor_messages"}, {"score": 0.002349884235026956, "phrase": "bayesian_detection_performance"}, {"score": 0.002309408211203032, "phrase": "one-message_feedback_architecture"}, {"score": 0.0021049977753042253, "phrase": "corresponding_optimal_error_exponents"}], "paper_keywords": ["Decentralized detection", " error exponent", " feedback", " sensor networks"], "paper_abstract": "We consider the decentralized binary hypothesis testing problem in networks with feedback, where some or all of the sensors have access to compressed summaries of other sensors' observations. We study certain two-message feedback architectures, in which every sensor sends two messages to a fusion center, with the second message based on full or partial knowledge of the first messages of the other sensors. We also study one-message feedback architectures, in which each sensor sends one message to a fusion center, with a group of sensors having full or partial knowledge of the messages from the sensors not in that group. Under either a Neyman-Pearson or a Bayesian formulation, we show that the asymptotically optimal (in the limit of a large number of sensors) detection performance (as quantified by error exponents) does not benefit from the feedback messages, if the fusion center remembers all sensor messages. However, feedback can improve the Bayesian detection performance in the one-message feedback architecture if the fusion center has limited memory; for that case, we determine the corresponding optimal error exponents.", "paper_title": "The Value of Feedback in Decentralized Detection", "paper_id": "WOS:000311359600015"}