{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "codonlogo"}, {"score": 0.0443587048584781, "phrase": "sequence_logos"}, {"score": 0.014328445601262854, "phrase": "multiple_sequence_alignment"}, {"score": 0.0045820747375409435, "phrase": "codon_patterns"}, {"score": 0.0032376465741070274, "phrase": "amino_acid_alphabets"}, {"score": 0.003132236287543072, "phrase": "messenger_rna"}, {"score": 0.0028360962841331634, "phrase": "conserved_codon_patterns"}, {"score": 0.0027286224888843956, "phrase": "first_application"}, {"score": 0.0026543514413663893, "phrase": "conserved_regions"}, {"score": 0.002337848196418384, "phrase": "inseparable_units"}, {"score": 0.0022122603123901114, "phrase": "codon_conservation"}, {"score": 0.002163930783583212, "phrase": "nucleotide_conservation"}, {"score": 0.0021049977753042253, "phrase": "standard_sequence_logos"}], "paper_keywords": [""], "paper_abstract": "Motivation: Conserved patterns across a multiple sequence alignment can be visualized by generating sequence logos. Sequence logos show each column in the alignment as stacks of symbol(s) where the height of a stack is proportional to its informational content, whereas the height of each symbol within the stack is proportional to its frequency in the column. Sequence logos use symbols of either nucleotide or amino acid alphabets. However, certain regulatory signals in messenger RNA (mRNA) act as combinations of codons. Yet no tool is available for visualization of conserved codon patterns. Results: We present the first application which allows visualization of conserved regions in a multiple sequence alignment in the context of codons. CodonLogo is based on WebLogo3 and uses the same heuristics but treats codons as inseparable units of a 64-letter alphabet. CodonLogo can discriminate patterns of codon conservation from patterns of nucleotide conservation that appear indistinguishable in standard sequence logos.", "paper_title": "CodonLogo: a sequence logo-based viewer for codon patterns", "paper_id": "WOS:000306136100024"}