{"auto_keywords": [{"score": 0.03908291158054249, "phrase": "ccs"}, {"score": 0.009203733379127334, "phrase": "fairness_assumption"}, {"score": 0.00481495049065317, "phrase": "fair_schedulers"}, {"score": 0.004652016085325825, "phrase": "ccs-like_languages"}, {"score": 0.004417848254181138, "phrase": "process_algebra_community"}, {"score": 0.0040767015025213625, "phrase": "distributed_system"}, {"score": 0.003961330917648707, "phrase": "standard_process-algebraic_specification_formalisms"}, {"score": 0.0039161012634587235, "phrase": "ccs."}, {"score": 0.003592896961105874, "phrase": "turing"}, {"score": 0.0032585499655442404, "phrase": "simple_fair_scheduler"}, {"score": 0.003166259444961177, "phrase": "suitable_variations"}, {"score": 0.002758273619951683, "phrase": "dekker's_and_peterson's_mutual_exclusion_protocols"}, {"score": 0.0024305347508230854, "phrase": "peterson"}, {"score": 0.0021539955106204354, "phrase": "expressive_power"}], "paper_keywords": [""], "paper_abstract": "In the process algebra community it is sometimes suggested that, on some level of abstraction, any distributed system can be modelled in standard process-algebraic specification formalisms like CCS. This sentiment is strengthened by results testifying that CCS, like many similar formalisms, is Turing powerful and provides a mechanism for interaction. This paper counters that sentiment by presenting a simple fair scheduler-one that in suitable variations occurs in many distributed systems-of which no implementation can be expressed in CCS, unless CCS is enriched with a fairness assumption. Since Dekker's and Peterson's mutual exclusion protocols implement fair schedulers, it follows that these protocols cannot be rendered correctly in CCS without imposing a fairness assumption. Peterson expressed this algorithm correctly in pseudocode without resorting to a fairness assumption, so it furthermore follows that CCS lacks the expressive power to accurately capture such pseudocode.", "paper_title": "CCS: It's not fair! Fair schedulers cannot be implemented in CCS-like languages even under progress and certain fairness assumptions", "paper_id": "WOS:000351160200005"}