{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "partition_selection"}, {"score": 0.004775918707955445, "phrase": "cube-shaped_topologies"}, {"score": 0.004737201825299411, "phrase": "non-contiguous_partitioning_strategies"}, {"score": 0.0044747919503484055, "phrase": "parallel_computer"}, {"score": 0.004420472010542188, "phrase": "particular_job"}, {"score": 0.004366808573435364, "phrase": "main_advantage"}, {"score": 0.004244102948402086, "phrase": "contiguous_ones"}, {"score": 0.004141663280057689, "phrase": "system_fragmentation"}, {"score": 0.003848886045448135, "phrase": "longer_job_execution_times"}, {"score": 0.002941147710077221, "phrase": "execution_times"}, {"score": 0.0028351712509358997, "phrase": "new_metrics"}, {"score": 0.0027666443986705453, "phrase": "partition-related_properties"}, {"score": 0.0024781515864648242, "phrase": "nas_parallel_benchmarks_suite"}, {"score": 0.002398583143633567, "phrase": "simulation-based_study"}, {"score": 0.0023405839743112482, "phrase": "large_set"}, {"score": 0.0022196745041124888, "phrase": "traffic_patterns"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Partition selection strategy", " Performance metric", " Application execution time", " Simulation-based evaluation"], "paper_abstract": "Non-contiguous partitioning strategies are often used to select and assign a set of nodes of a parallel computer to a particular job. The main advantage of these strategies, compared to contiguous ones, is the reduction of system fragmentation. However, without contiguity, locality in communications cannot be easily exploited, resulting in longer job execution times. Several metrics have been proposed in the literature to assess how fit a partition is to run an application on it. These metrics are computed considering the dispersion of the partition. In this paper we demonstrate that metrics based solely on dispersion are not always valid. Using simulation, we show how, for some applications, dispersion-based metrics of a partition do not correlate with the execution times of applications running on it. We define new metrics that do not only consider partition-related properties, but also application's communication patterns and path diversity for communicating tasks. We evaluate these metrics in 2D and 3D meshes, using the NAS Parallel Benchmarks suite of applications as testing workload. A simulation-based study was carried out with a large set of partitions. Results show how metrics that include information about the traffic patterns of applications have consistent strong (and positive) correlations with execution times. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Application-aware metrics for partition selection in cube-shaped topologies", "paper_id": "WOS:000338614300007"}