{"auto_keywords": [{"score": 0.035660227888555225, "phrase": "natural_disasters"}, {"score": 0.026815895908112265, "phrase": "ibr"}, {"score": 0.00481495049065317, "phrase": "malware_pollution"}, {"score": 0.00455202992136173, "phrase": "unsolicited_one-way_internet_traffic"}, {"score": 0.004234884779773412, "phrase": "malicious_activity"}, {"score": 0.003739421738326676, "phrase": "macroscopic_internet_events"}, {"score": 0.0035067452724203124, "phrase": "internet_communications"}, {"score": 0.0034647524666821614, "phrase": "recent_work"}, {"score": 0.0032491108935498794, "phrase": "new_metric"}, {"score": 0.0032231139180761183, "phrase": "local_ibr_activity"}, {"score": 0.003146360480030653, "phrase": "unique_ip_addresses"}, {"score": 0.002711714675297321, "phrase": "ibr_traffic"}, {"score": 0.0026792166577171476, "phrase": "important_building_block"}, {"score": 0.0026577673946415583, "phrase": "comprehensive_monitoring"}, {"score": 0.002327594516681507, "phrase": "network_infrastructure"}, {"score": 0.0021049977753042253, "phrase": "active_icmp"}], "paper_keywords": ["Measurement", " Performance", " Outages", " Censorship", " Earthquakes", " Network Telescope", " Malware"], "paper_abstract": "Unsolicited one-way Internet traffic, also called Internet background radiation (IBR), has been used for years to study malicious activity on the Internet, including worms, DoS attacks, and scanning address space looking for vulnerabilities to exploit. We show how such traffic can also be used to analyze macroscopic Internet events that are unrelated to malware. We examine two phenomena: country-level censorship of Internet communications described in recent work [17], and natural disasters (two recent earthquakes). We introduce a new metric of local IBR activity based on the number of unique IP addresses per hour contributing to IBR. The advantage of this metric is that it is not affected by bursts of traffic from a few hosts. Although we have only scratched the surface, we are convinced that IBR traffic is an important building block for comprehensive monitoring, analysis, and possibly even detection of events unrelated to the IBR itself. In particular, IBR offers the opportunity to monitor the impact of events such as natural disasters on network infrastructure, and in particular reveals a view of events that is complementary to many existing measurement platforms based on (BGP) control-plane views or targeted active ICMP probing.", "paper_title": "Extracting Benefit from Harm: Using Malware Pollution to Analyze the Impact of Political and Geophysical Events on the Internet", "paper_id": "WOS:000299325100004"}