{"auto_keywords": [{"score": 0.032805802476529713, "phrase": "global_archive"}, {"score": 0.015719716506582538, "phrase": "double-level_archives"}, {"score": 0.008139699920809535, "phrase": "proposed_algorithm"}, {"score": 0.004712463245074863, "phrase": "existing_multiobjective_evolutionary_algorithms"}, {"score": 0.004592340708764929, "phrase": "multiobjective_problem"}, {"score": 0.003933000051147382, "phrase": "priori_problem_decomposition"}, {"score": 0.0038326698261576023, "phrase": "population_diversity"}, {"score": 0.003686936319864422, "phrase": "moea"}, {"score": 0.003471135453226184, "phrase": "sub-problem-level_approaches"}, {"score": 0.0029722900280316216, "phrase": "new_individuals"}, {"score": 0.0027861630854233693, "phrase": "reproduced_individuals"}, {"score": 0.002726740692380339, "phrase": "fast_convergence"}, {"score": 0.0026456667695073043, "phrase": "solution_distribution"}, {"score": 0.002622947550220266, "phrase": "pareto_front"}, {"score": 0.0023650305205893353, "phrase": "truly_disconnected_problems"}, {"score": 0.0021695394558562927, "phrase": "competitive_advantages"}, {"score": 0.0021232579195855986, "phrase": "pf"}, {"score": 0.0021049977753042253, "phrase": "solution_coverage"}], "paper_keywords": ["Evolutionary algorithm (EA)", " global optimization", " multiobjective optimization"], "paper_abstract": "Existing multiobjective evolutionary algorithms (MOEAs) tackle a multiobjective problem either as a whole or as several decomposed single-objective sub-problems. Though the problem decomposition approach generally converges faster through optimizing all the sub-problems simultaneously, there are two issues not fully addressed, i.e., distribution of solutions often depends on a priori problem decomposition, and the lack of population diversity among sub-problems. In this paper, a MOEA with double-level archives is developed. The algorithm takes advantages of both the multiobjective-problem-level and the sub-problem-level approaches by introducing two types of archives, i.e., the global archive and the sub-archive. In each generation, self-reproduction with the global archive and cross-reproduction between the global archive and sub-archives both breed new individuals. The global archive and sub-archives communicate through cross-reproduction, and are updated using the reproduced individuals. Such a framework thus retains fast convergence, and at the same time handles solution distribution along Pareto front (PF) with scalability. To test the performance of the proposed algorithm, experiments are conducted on both the widely used benchmarks and a set of truly disconnected problems. The results verify that, compared with state-of-the-art MOEAs, the proposed algorithm offers competitive advantages in distance to the PF, solution coverage, and search speed.", "paper_title": "An Evolutionary Algorithm with Double-Level Archives for Multiobjective Optimization", "paper_id": "WOS:000360019000012"}