{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "curb_emerging_smartphone_malware"}, {"score": 0.004736045157669388, "phrase": "burgeoning_threat"}, {"score": 0.0046738485441681485, "phrase": "continuing_advancing"}, {"score": 0.004643055780443262, "phrase": "traditional_defenses"}, {"score": 0.004346020686558718, "phrase": "novel_mechanisms"}, {"score": 0.0042325743185503825, "phrase": "smartphone_malware"}, {"score": 0.004067910470129423, "phrase": "lightweight_permission_enforcement"}, {"score": 0.003832801887709817, "phrase": "simple_cyber-physical_human_interactions"}, {"score": 0.003587415196933649, "phrase": "users'_daily_activities"}, {"score": 0.0033465923623290034, "phrase": "access_request"}, {"score": 0.0029706504420983896, "phrase": "hand_waving_detection"}, {"score": 0.0029412916164128925, "phrase": "first_mechanism"}, {"score": 0.002761954897932813, "phrase": "second_mechanism"}, {"score": 0.0026281103468378856, "phrase": "phone's_screen"}, {"score": 0.00240328454980006, "phrase": "twr-enhanced_android_permission_model"}, {"score": 0.0023559890904375526, "phrase": "underlying_gesture_recognition_mechanisms"}, {"score": 0.0023096222276192194, "phrase": "novel_experiments"}, {"score": 0.002241773449372999, "phrase": "proposed_approach"}, {"score": 0.002175913488493802, "phrase": "quite_low_false_positives"}, {"score": 0.0021049977753042253, "phrase": "additional_burden"}], "paper_keywords": ["Malware", " mobile devices", " NFC", " context recognition", " sensors"], "paper_abstract": "Malware is a burgeoning threat for smartphones and continuing advancing. Traditional defenses to malware, however, are not suitable for smartphones due to their resource intensive nature. This necessitates the design of novel mechanisms that can consider the specifics of the smartphone malware and smartphones themselves. In this paper, we introduce a lightweight permission enforcement approach-Tap-Wave-Rub (TWR)-for smartphone malware prevention. TWR is based on simple cyber-physical human interactions, i.e., human gestures, that are very quick and intuitive but less likely to be exhibited in users' daily activities. Presence or absence of such gestures, prior to accessing an application, can effectively inform the OS whether the access request is benign or malicious. In particular, we present the design of two mechanisms: 1) acceleration-based phone tapping detection and 2) proximity-based finger tapping, rubbing, or hand waving detection. The first mechanism is geared for near field communication applications, which usually require the user to tap her phone with another device. The second mechanism involves very simple gestures, i.e., tapping or rubbing a finger near the top of phone's screen or waving a hand close to the phone, and broadly appeals to many applications (e.g., SMS). In addition, we present the TWR-enhanced Android permission model, the prototypes implementing the underlying gesture recognition mechanisms, and a variety of novel experiments to evaluate these mechanisms. Our results suggest the proposed approach could be very effective for malware detection/prevention, with quite low false positives and false negatives, while imposing little to no additional burden on the users.", "paper_title": "Tap-Wave-Rub: Lightweight Human Interaction Approach to Curb Emerging Smartphone Malware", "paper_id": "WOS:000360893000002"}