{"auto_keywords": [{"score": 0.05007818884515698, "phrase": "energetic_analysis"}, {"score": 0.026358892069751488, "phrase": "computed_free_energy"}, {"score": 0.024757854896285538, "phrase": "experimental_binding_affinity"}, {"score": 0.02246846748295755, "phrase": "pearls"}, {"score": 0.00475924837336259, "phrase": "receptor-ligand_system"}, {"score": 0.004569293780076254, "phrase": "small_molecule_ligand-protein"}, {"score": 0.00451642066363115, "phrase": "ligand-nucleic_acid"}, {"score": 0.004438250823243621, "phrase": "protein-nucleic_acid_interactions"}, {"score": 0.0042859292226559535, "phrase": "molecular_interactions"}, {"score": 0.003859500298805362, "phrase": "potential_new_ligands"}, {"score": 0.0038148090091532933, "phrase": "virtual_drug_screening"}, {"score": 0.003705323407433896, "phrase": "web-based_software"}, {"score": 0.00357806560856829, "phrase": "computing_interaction_energies"}, {"score": 0.0026736111900632934, "phrase": "empirical_solvation_free_energy_model"}, {"score": 0.0026119782818898193, "phrase": "ligand_conformational_entropy_change"}, {"score": 0.0025221759076833124, "phrase": "simple_model"}, {"score": 0.0024072121760839427, "phrase": "pdb_ligand-receptor_complexes"}, {"score": 0.0022841153001549193, "phrase": "substantial_degree"}], "paper_keywords": [""], "paper_abstract": "Analysis of the energetics of small molecule ligand-protein, ligand-nucleic acid, and protein-nucleic acid interactions facilitates the quantitative understanding of molecular interactions that regulate the function and conformation of proteins. It has also been extensively used for ranking potential new ligands in virtual drug screening. We developed a Web-based software, PEARLS (Program for Energetic Analysis of Ligand-Receptor Systems), for computing interaction energies of ligand-protein, ligand-nucleic acid, proteinnucleic acid, and ligand-protein-nucleic acid complexes from their 3D structures. AMBER molecular force field, Morse potential, and empirical energy functions are used to compute the van der Waals, electrostatic, hydrogen bond, metal-ligand bonding, and water-mediated hydrogen bond energies between the binding molecules. The change in the solvation free energy of molecular binding is estimated by using an empirical solvation free energy model. Contribution from ligand conformational entropy change is also estimated by a simple model. The computed free energy for a number of PDB ligand-receptor complexes were studied and compared to experimental binding affinity. A substantial degree of correlation between the computed free energy and experimental binding affinity was found, which suggests that PEARLS may be useful in facilitating energetic analysis of ligand-protein, ligand-nucleic acid, and protein-nucleic acid interactions. PEARLS can be accessed at http://ang.cz3.nus.edu.sg/cgi-bin/prog/rune.pi.", "paper_title": "PEARLS: Program for energetic analysis of receptor-ligand system", "paper_id": "WOS:000235021200048"}