{"auto_keywords": [{"score": 0.047112807253698846, "phrase": "open_peer_review"}, {"score": 0.032548317552603324, "phrase": "peer_review"}, {"score": 0.00481495049065317, "phrase": "current_and_future_issues"}, {"score": 0.004776669953449352, "phrase": "post-publication_open_peer_review"}, {"score": 0.004608121749000898, "phrase": "main_protagonists"}, {"score": 0.00407161650109722, "phrase": "new_and_established_platforms"}, {"score": 0.0037740295668681014, "phrase": "academic_community"}, {"score": 0.003714195746979591, "phrase": "researchers'_concerns"}, {"score": 0.003611751858608048, "phrase": "progressive_approach"}, {"score": 0.003583002730249742, "phrase": "scholarly_communication"}, {"score": 0.0034152340901585374, "phrase": "prominent_open_post-publication_platforms"}, {"score": 0.0032423089921154503, "phrase": "standard_model"}, {"score": 0.002922207118572208, "phrase": "other's_research"}, {"score": 0.0027964537059186893, "phrase": "new_era"}, {"score": 0.0027741761880779535, "phrase": "academic_openness"}, {"score": 0.002686821995335494, "phrase": "key_platforms"}, {"score": 0.00255068452076921, "phrase": "different_disciplines"}, {"score": 0.0024214281919523973, "phrase": "scholarly_communications"}, {"score": 0.0022987068521717765, "phrase": "new_platforms"}], "paper_keywords": ["Open Access", " Altmetrics", " Peer review", " Open peer review", " Post-publication peer review"], "paper_abstract": "Purpose - The purpose of this paper is twofold, first, to discuss the current and future issues around post-publication open peer review. Second, to highlight some of the main protagonists and platforms that encourages open peer review, pre- and post-publication. Design/methodology/approach - The first part of the paper aims to discuss the facilitators and barriers that will enable and prevent academics engaging with the new and established platforms of scholarly communication and review. These issues are covered with the intention of proposing further dialogue within the academic community that ultimately address researchers' concerns, whilst continuing to nurture a progressive approach to scholarly communication and review. The paper will continue to look at the prominent open post-publication platforms and tools and discuss whether in the future it will become a standard model. Findings - The paper identifies several problems, not exclusive to open peer review that could inhibit academics from being open with their reviews and comments of other's research. Whilst identifies opportunities to be had by embracing a new era of academic openness. Practical implications - The paper summarises key platforms and arguments for open peer review and will be of interest to researchers in different disciplines as well as the wider academic community wanting to know more about scholarly communications and measurement. Originality/value - This paper looks at many of the new platforms that have been previously ignored and discusses issues relating to open peer review that have only been touched on in brief by other published research.", "paper_title": "For what it's worth - the open peer review landscape", "paper_id": "WOS:000370546900003"}