{"auto_keywords": [{"score": 0.048799520930917564, "phrase": "nondeterministic_finite_automata"}, {"score": 0.026567751400338742, "phrase": "fuzzy_automata"}, {"score": 0.006258652225123065, "phrase": "nondeterministic_fuzzy_automata"}, {"score": 0.006009786139211489, "phrase": "fuzzy_languages"}, {"score": 0.00481495049065317, "phrase": "fuzzy_uncertainty"}, {"score": 0.004750178261675602, "phrase": "system_modeling"}, {"score": 0.004010102190292041, "phrase": "fundamental_property_nondeterminism"}, {"score": 0.0030783143919343972, "phrase": "mathematical_representation"}, {"score": 0.003036832649117453, "phrase": "nondeterministic_dynamic_fuzzy_systems"}, {"score": 0.0023465400668244386, "phrase": "well-known_equivalence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Fuzzy automaton", " Fuzzy language", " Nondeterministic finite automaton", " Nondeterministic fuzzy automaton", " Nondeterministic fuzzy automaton with epsilon-moves"], "paper_abstract": "To handle fuzzy uncertainty in system modeling, nondeterministic finite automata have been generalized into fuzzy automata. After a reexamination of the notions of fuzzy automata in the literature, we ascertain that the fundamental property nondeterminism in nondeterministic finite automata has not been well embodied in the generalization. In order to reflect nondeterminism in fuzzy automata, we introduce nondeterministic fuzzy automata with or without epsilon-moves and fuzzy languages recognized by them. Like nondeterministic finite automata, nondeterministic fuzzy automata provide a mathematical representation of nondeterministic dynamic fuzzy systems. Moreover, we show that (deterministic) fuzzy automata, nondeterministic fuzzy automata, and nondeterministic fuzzy automata with epsilon-moves are all equivalent in the sense that they recognize the same class of fuzzy languages, which is an extension of the well-known equivalence among finite automata, nondeterministic finite automata, and nondeterministic finite automata with epsilon-moves. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Nondeterministic fuzzy automata", "paper_id": "WOS:000302510400008"}