{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "heterogeneous_networks"}, {"score": 0.0440350934027006, "phrase": "heterogeneous_information_networks"}, {"score": 0.014918004761911316, "phrase": "homogeneous_networks"}, {"score": 0.009840540580956505, "phrase": "heterogeneous_network_clustering"}, {"score": 0.004141663280057689, "phrase": "multiple_types"}, {"score": 0.00399260264462941, "phrase": "real_life"}, {"score": 0.0038962096720793443, "phrase": "new_and_promising_field"}, {"score": 0.0038332390893263844, "phrase": "data_mining"}, {"score": 0.003740679163860117, "phrase": "important_way"}, {"score": 0.003695237613399466, "phrase": "underlying_patterns"}, {"score": 0.003051073364818384, "phrase": "brief_summary"}, {"score": 0.0030262967460085366, "phrase": "current_research"}, {"score": 0.0029531640201737384, "phrase": "promising_research_directions"}, {"score": 0.002870066750788841, "phrase": "formalized_definition"}, {"score": 0.002634506575564286, "phrase": "concise_classification"}, {"score": 0.0024680632991561074, "phrase": "experimental_developments"}, {"score": 0.002359759876402679, "phrase": "critical_issues"}, {"score": 0.0023405839743112482, "phrase": "future_research"}, {"score": 0.002321563536990284, "phrase": "wires_data_mining_knowl_discov"}], "paper_keywords": [""], "paper_abstract": "Objects that are interrelated with each other are often represented as homogeneous networks, in which objects are of the same entity type and relationships between objects are of the same relationship type. However, heterogeneous information networks, composed of multiple types of objects and/or relationships, are ubiquitous in real life. Mining heterogeneous information networks is a new and promising field of research in data mining, and clustering is an important way to identify underlying patterns in data. Although clustering on homogeneous networks has been studied for several decades, clustering on heterogeneous networks has been explored only recently. However, some progress has already been made with respect to this theme, ranging from algorithms to various related applications. This paper presents a brief summary of current research regarding heterogeneous network clustering and addresses some promising research directions. First, it presents a formalized definition and two important aspects of heterogeneous information networks to elaborate why clustering on heterogeneous networks is of significance. Then, this review provides a concise classification of existing heterogeneous network clustering algorithms based on their methodological principles. In addition, it discusses experimental developments and applications of heterogeneous network clustering. The paper addresses several open problems and critical issues for future research. WIREs Data Mining Knowl Discov 2014, 4:213-233. doi: 10.1002/widm.1126 Conflict of interest: The authors have declared no conflicts of interest for this article. For further resources related to this article, please visit the .", "paper_title": "Clustering on heterogeneous networks", "paper_id": "WOS:000334991200004"}