{"auto_keywords": [{"score": 0.03306344524372763, "phrase": "nonzero-quantized_ac_residuals"}, {"score": 0.007752615933461381, "phrase": "common_approach"}, {"score": 0.004815055596927209, "phrase": "digital"}, {"score": 0.004688321299229397, "phrase": "controlled_video_bit-rate_increase"}, {"score": 0.004347295388592986, "phrase": "p-"}, {"score": 0.004176813329075736, "phrase": "motion_compensation"}, {"score": 0.003995226376780718, "phrase": "compressed_video"}, {"score": 0.0036715973701254823, "phrase": "video_bit_rate"}, {"score": 0.0035590664550919854, "phrase": "detailed_overview"}, {"score": 0.0032706520949775065, "phrase": "video_watermarking"}, {"score": 0.003032405563826263, "phrase": "video_bit-rate_increase"}, {"score": 0.002965684305115369, "phrase": "reasonable_values"}, {"score": 0.002824005136794786, "phrase": "nonflat_areas"}, {"score": 0.0023113506171584157, "phrase": "watermark_detection_algorithm"}], "paper_keywords": ["bit-rate increase", " compressed domain", " digital watermarking", " human visual model", " H.264", " likelihood ratio test", " motion intensity", " P-frames", " temporal masking", " video", " watermark detection"], "paper_abstract": "Most video watermarking algorithms embed the watermark in I-frames, but refrain from embedding in P- and B-frames, which are highly compressed by motion compensation. However, P-frames appear more frequently in the compressed video and their watermarking capacity should be exploited, despite the fact that embedding the watemark in P-frames can increase the video bit rate significantly. This paper gives a detailed overview of a common approach for embedding the watermark in I-frames. This common approach is adopted to use P-frames for video watermarking. We show that by limiting the watermark to nonzero-quantized ac residuals in P-frames, the video bit-rate increase can be held to reasonable values. Since the nonzero-quantized ac residuals in P-frames correspond to nonflat areas that are in motion, temporal and texture masking are exploited at the same time. We also propose embedding the watermark in nonzero-quantized ac residuals with spatial masking capacity in I-frames. Since the locations of the nonzero-quantized ac residuals is lost after decoding, we develop a watermark detection algorithm that does not depend on this knowledge. Our video watermark detection algorithm has controllable performance. We demonstrate the robustness of our proposed algorithm to several different attacks.", "paper_title": "Digital video watermarking in P-frames with controlled video bit-rate increase", "paper_id": "WOS:000258913300011"}