{"auto_keywords": [{"score": 0.04566265099632426, "phrase": "rfid"}, {"score": 0.015719579693945065, "phrase": "wireless_sensor_networks"}, {"score": 0.0079886707686288, "phrase": "wireless_devices"}, {"score": 0.004757227624616643, "phrase": "radio_frequency_identification"}, {"score": 0.004533142516832776, "phrase": "wide_variety"}, {"score": 0.004425072111844721, "phrase": "current_and_future_systems"}, {"score": 0.003969640975997097, "phrase": "conventional_sensor_technologies"}, {"score": 0.0035609649472693895, "phrase": "wsn"}, {"score": 0.0031367803372203498, "phrase": "multihop_wireless_communications"}, {"score": 0.002830617996609902, "phrase": "recent_research_work"}, {"score": 0.0027133856739937133, "phrase": "sensor_networks"}, {"score": 0.0024632912250657636, "phrase": "wsn_nodes"}, {"score": 0.002361236012575149, "phrase": "wsn_noes"}, {"score": 0.0021306081217770173, "phrase": "new_challenges"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": [""], "paper_abstract": "Radio frequency identification and wireless sensor networks are two important wireless technologies that have a wide variety of applications in current and future systems. RFID facilitates detection and identification of objects that are not easily detectable or distinguishable by using conventional sensor technologies. However, it does not provide information about the condition of the objects it detects. WSN, on the other hand, not only provides information about the condition of the objects and environment but also enables multihop wireless communications. Hence, the integration of these technologies expands their overall functionality and capacity. This article investigates recent research work and applications that integrate RFID with sensor networks. Four classes of integration are discussed: integrating tags with sensors, integrating tags with WSN nodes and wireless devices, integrating readers with WSN noes and wireless devices, and a mix of RFID and WSNs. Finally, a discussion of new challenges and future work is presented.", "paper_title": "Taxonomy and Challenges of the Integration of RFID and Wireless Sensor Networks", "paper_id": "WOS:000261089300005"}