{"auto_keywords": [{"score": 0.05005707706182522, "phrase": "web_applications"}, {"score": 0.04092756411666653, "phrase": "nm"}, {"score": 0.004227653047394939, "phrase": "specific_conditions"}, {"score": 0.004163427731140163, "phrase": "definite_impact"}, {"score": 0.00411589720697736, "phrase": "overall_success"}, {"score": 0.004037877545494505, "phrase": "quality_attribute"}, {"score": 0.003931118518507637, "phrase": "navigational_model"}, {"score": 0.0038418515481939463, "phrase": "web_engineering"}, {"score": 0.003585986761045987, "phrase": "particular_we_methodologies"}, {"score": 0.0031121406603482112, "phrase": "proposed_navigability_measures"}, {"score": 0.003088384809415812, "phrase": "improvement_techniques"}, {"score": 0.002983700956478823, "phrase": "model-driven_engineering_approach"}, {"score": 0.00283870598459543, "phrase": "generic_approach"}, {"score": 0.002784828661426853, "phrase": "navigability_measurement_models"}, {"score": 0.0026191799769765085, "phrase": "model-driven_improvement_process"}, {"score": 0.0022815262950738814, "phrase": "objective_measures"}, {"score": 0.0021789194955896124, "phrase": "measurement_results"}], "paper_keywords": ["Web quality", " navigational model quality", " measures", " software measurement ontology", " empirical research", " model transformations", " model quality"], "paper_abstract": "Navigability in use, defined as the efficiency, effectiveness and satisfaction with which a user navigates through the system in order to fulfil her goals under specific conditions, has a definite impact on the overall success of Web applications. This quality attribute can be measured based on the navigational model (NM) provided by Web engineering (WE) methodologies. Most of the measures currently defined for NMs are tightly coupled with particular WE methodologies, however. Furthermore, modifications to the design of the NM, carried out with the aim of improving navigability, are performed manually. Both practices have seriously hampered the reusability and adoption of proposed navigability measures and improvement techniques. In this paper, we present a Model-Driven Engineering approach to solving these problems. On the one hand, we propose a generic approach for the definition of navigability measurement models that can be integrated into any WE methodology. On the other hand, we present a model-driven improvement process for the NM design that incurs no increase in costs or in time-to-market of Web applications. This process is divided into two phases: evaluation (i.e. assessment of the model through objective measures) and evolution (i.e. transformation of the model when the measurement results do not fall inside the boundaries set by certain quality decision criteria that have been defined previously).", "paper_title": "Towards improving the navigability of web applications: a model-driven approach", "paper_id": "WOS:000250383400012"}