{"auto_keywords": [{"score": 0.04913773168727959, "phrase": "fashion_information"}, {"score": 0.00709445513216119, "phrase": "mouth_information"}, {"score": 0.00481495049065317, "phrase": "social_network_properties"}, {"score": 0.004752056869578886, "phrase": "informational_properties"}, {"score": 0.004714454921245569, "phrase": "individual_characteristic_variables"}, {"score": 0.004240116703465252, "phrase": "internet_fashion_community"}, {"score": 0.004026598712747509, "phrase": "internet_fashion_information_community"}, {"score": 0.0037935066882208235, "phrase": "actual_effects"}, {"score": 0.0037485269508155516, "phrase": "empirical_way"}, {"score": 0.0036995113346814414, "phrase": "network_characteristic_variables"}, {"score": 0.003559675269411366, "phrase": "social_network_analysis"}, {"score": 0.0033668870709083884, "phrase": "community_members"}, {"score": 0.0032614317990293695, "phrase": "network_variables"}, {"score": 0.0030239842475439814, "phrase": "significance_test"}, {"score": 0.0027815466400771768, "phrase": "fashion_community_network"}, {"score": 0.002508073621696602, "phrase": "hypothesis_testing"}, {"score": 0.0022614266476954467, "phrase": "significant_influence"}, {"score": 0.0022345720876241044, "phrase": "verbal_acceptance"}, {"score": 0.0021049977753042253, "phrase": "mouth_marketing"}], "paper_keywords": ["e-WOM", " Fashion information", " On-line fashion community", " Social network"], "paper_abstract": "This study aims to investigate the acceptance of word-of-mouth information that is currently being disseminated between consumers in the internet fashion community. In particular, we suggest the network features formed in the internet fashion information community as variables influencing the acceptance of word-of-mouth information and analyze the actual effects in an empirical way. To do so, first of all, we conducted a social network analysis and investigated the features of the network spread patterns involving fashion information shared between community members. Thereafter, we set up the network variables as factor influencing the acceptance of fashion information in the internet and, including these variables, conducted a significance test on the impact of the informational properties and individual characteristic variables. As a result, in terms of the characteristics of the fashion community network, fashion information is produced intensively by a few information activists focusing on fashion information within the community and influences many information acceptors. In addition, as a result of hypothesis testing on the factors influencing the acceptance of the fashion information, we found that the informational properties, individual characteristic variables, as well as network characteristic variables, have a significant influence on the verbal acceptance, which confirms the importance of the network characteristic variables in the study of word of mouth marketing on the internet.", "paper_title": "The effects of social network properties on the acceleration of fashion information on the web", "paper_id": "WOS:000316876200014"}