{"auto_keywords": [{"score": 0.043872051098043104, "phrase": "independent_set"}, {"score": 0.01185418598951733, "phrase": "k_vertices"}, {"score": 0.00709226326122909, "phrase": "pattern_graph"}, {"score": 0.007032659239244329, "phrase": "fixed_size"}, {"score": 0.006463311491514681, "phrase": "induced_subgraph"}, {"score": 0.005567149828749619, "phrase": "induced_path"}, {"score": 0.00481495049065317, "phrase": "subgraph_isomorphism_problem"}, {"score": 0.004169849868036158, "phrase": "related_size"}, {"score": 0.0040998527410276995, "phrase": "fixed_pattern_graph"}, {"score": 0.004065294241465876, "phrase": "maximum_independent_set"}, {"score": 0.003570320280680356, "phrase": "induced_cycle"}, {"score": 0.003403004190606271, "phrase": "linear_time"}, {"score": 0.0032161400520923154, "phrase": "similar_corollaries"}, {"score": 0.003162101526249052, "phrase": "induced_complete_bipartite_graphs"}, {"score": 0.003135422638024283, "phrase": "induced_paw"}, {"score": 0.0030481030971279896, "phrase": "arbitrary_pattern_graph_h"}, {"score": 0.0029968794886425227, "phrase": "isolated_vertices"}, {"score": 0.0029548493827229088, "phrase": "simple_subdivision"}, {"score": 0.002808349127118576, "phrase": "distinct_path"}, {"score": 0.002558321963066762, "phrase": "so-called_diamond"}, {"score": 0.0023173649298618005, "phrase": "weaker_evidence"}, {"score": 0.002183801521729492, "phrase": "edge-colored_variant"}, {"score": 0.002171488970077653, "phrase": "induced_subgraph_isomorphism"}, {"score": 0.002141009796880959, "phrase": "standard_variant"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Induced subgraph isomorphism", " Detecting subgraphs", " Counting subgraphs", " Time complexity"], "paper_abstract": "The complexity of the subgraph isomorphism problem where the pattern graph is of fixed size is well known to depend on the topology of the pattern graph. Here, we present two results which, in contrast, provide evidence that no topology of an induced subgraph of fixed size can be substantially easier to detect or count than an independent set of related size. We show that any fixed pattern graph having a maximum independent set of size k that is disjoint from other maximum independent sets is not easier to detect as an induced subgraph than an independent set of size k. It follows in particular that an induced path on 2k-1 vertices is not easier to detect than an independent set on k vertices, and that an induced cycle on 2k vertices is not easier to detect than an independent set on k vertices. In view of linear time upper bounds on the detection of induced path of length two and three, our lower bound is tight. Similar corollaries hold for the detection of induced complete bipartite graphs and an induced paw and its generalizations. We show also that for an arbitrary pattern graph H on k vertices with no isolated vertices, there is a simple subdivision of H, resulting from splitting each edge into a path of length four and attaching a distinct path of length three at each vertex of degree one, that is not easier to detect or count than an independent set on k vertices, respectively. Next, we show that the so-called diamond and its generalizations on k vertices are not easier to detect as induced subgraphs than an independent set on three vertices or an independent set on k vertices, respectively. For C-4, we give a weaker evidence of its hardness in terms of an independent set on three vertices. Finally, we derive several results relating the complexity of the edge-colored variant of induced subgraph isomorphism to that of the standard variant. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Induced subgraph isomorphism: Are some patterns substantially easier than others?", "paper_id": "WOS:000365059800009"}