{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "reflective_systems"}, {"score": 0.004683293543941329, "phrase": "pharo"}, {"score": 0.004631672080824242, "phrase": "bootstrapping"}, {"score": 0.004406121974246201, "phrase": "language_definition"}, {"score": 0.003588291565092195, "phrase": "expression_power"}, {"score": 0.003158088776878876, "phrase": "smalltalk"}, {"score": 0.002905629026254221, "phrase": "reflective_system_bootstrap"}, {"score": 0.002643753276264565, "phrase": "object-oriented_reflective_systems"}, {"score": 0.0022880528191813083, "phrase": "reference_bootstrap_process"}, {"score": 0.0022502133699402018, "phrase": "reflective_system"}, {"score": 0.0022253345930383257, "phrase": "hazelnut"}, {"score": 0.002140400526572388, "phrase": "pharo_smalltalk-inspired_system"}], "paper_keywords": ["Object-oriented programming and design", " Bootstrap", " Smalltalk", " Software evolution"], "paper_abstract": "Bootstrapping is a technique commonly known by its usage in language definition by the introduction of a compiler written in the same language it compiles. This process is important to understand and modify the definition of a given language using the same language, taking benefit of the abstractions and expression power it provides. A bootstrap, then, supports the evolution of a language. However, the infrastructure of reflective systems like Smalltalk includes, in addition to a compiler, an environment with several self-references. A reflective system bootstrap should consider all its infrastructural components. In this paper, we propose a definition of bootstrap for object-oriented reflective systems, we describe the architecture and components it should contain and we analyze the challenges it has to overcome. Finally, we present a reference bootstrap process for a reflective system and Hazelnut, its implementation for bootstrapping the Pharo Smalltalk-inspired system. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Bootstrapping reflective systems: The case of Pharo", "paper_id": "WOS:000345180800010"}