{"auto_keywords": [{"score": 0.034789171521739305, "phrase": "ekda"}, {"score": 0.00481495049065317, "phrase": "framework_for_cloud_storage"}, {"score": 0.003931798194574009, "phrase": "users'_access"}, {"score": 0.0035527409334589317, "phrase": "interactive_protocol"}, {"score": 0.0030758904011907533, "phrase": "weighted_bloom_filter"}, {"score": 0.002931569771634119, "phrase": "encrypted_keywords"}, {"score": 0.0028391271282216758, "phrase": "lazy_revocation"}, {"score": 0.0028089634624677957, "phrase": "multi-tree_structure"}, {"score": 0.0025514745448798363, "phrase": "security_analysis"}, {"score": 0.0023802825369325354, "phrase": "dwbf"}, {"score": 0.0023549822490693344, "phrase": "ciphertext_retrieval"}, {"score": 0.002256435842862802, "phrase": "computation_overhead"}, {"score": 0.002185235873435714, "phrase": "proposed_framework"}, {"score": 0.0021049977753042253, "phrase": "data_access"}], "paper_keywords": ["cloud storage", " key derivation", " Bloom Filter", " privacy security", " encrypted keyword retrieval"], "paper_abstract": "In order to implement a privacy-preserving, efficient and secure data storage and access environment of cloud storage, the following problems must be considered: data index structure, generation and management of keys, data retrieval, treatments of change of users' access right and dynamic operations on data, and interactions among participants. To solve those problems, the interactive protocol among participants is introduced, an extirpation-based key derivation algorithm (EKDA) is designed to manage the keys, a double hashed and weighted Bloom Filter (DWBF) is proposed to retrieve the encrypted keywords, which are combined with lazy revocation, multi-tree structure, asymmetric and symmetric encryptions, to form a privacy-preserving, efficient and secure framework for cloud storage. The experiment and security analysis show that EKDA can reduce the communication and storage overheads efficiently, DWBF supports ciphertext retrieval and can reduce communication, storage and computation overhead as well, and the proposed framework is privacy-preserving while supporting data access efficiently.", "paper_title": "Study of Privacy-preserving Framework for Cloud Storage", "paper_id": "WOS:000295127500015"}