{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scopus"}, {"score": 0.015452073651821595, "phrase": "typical_university"}, {"score": 0.00478163886605204, "phrase": "web_of_science"}, {"score": 0.004634552430216732, "phrase": "isi_web"}, {"score": 0.004570634647887452, "phrase": "thomson_reuters"}, {"score": 0.004523272849033429, "phrase": "sole_publication"}, {"score": 0.004491970050862321, "phrase": "citation_database"}, {"score": 0.00435375504298636, "phrase": "invaluable_tool"}, {"score": 0.004323620278409076, "phrase": "bibliometric_analysis"}, {"score": 0.004249198969146494, "phrase": "elsevier"}, {"score": 0.0041184131734368825, "phrase": "good_alternative"}, {"score": 0.0038957429132649175, "phrase": "journal_coverage"}, {"score": 0.0038286491141253584, "phrase": "bibliometric_assessment"}, {"score": 0.003802135020791801, "phrase": "research_output"}, {"score": 0.0031955979242589494, "phrase": "detailed_paper"}, {"score": 0.0030756833977949273, "phrase": "isi_web_of_science"}, {"score": 0.0029092257197427195, "phrase": "portuguese_universities"}, {"score": 0.002879029968532794, "phrase": "detailed_analysis"}, {"score": 0.0026762323224804197, "phrase": "general_conclusion"}, {"score": 0.0023776656246300063, "phrase": "citation_impact"}, {"score": 0.0021049977753042253, "phrase": "high_impact_documents"}], "paper_keywords": [""], "paper_abstract": "For many years, the ISI Web of Knowledge from Thomson Reuters was the sole publication and citation database covering all areas of science thus becoming an invaluable tool in bibliometric analysis. In 2004, Elsevier introduced Scopus and this is rapidly becoming a good alternative. Several attempts have been made at comparing these two instruments from the point of view of journal coverage for research or for bibliometric assessment of research output. This paper attempts to answer the question that all researchers ask, i.e., what is to be gained by searching both databases? Or, if you are forced to opt for one of them, which should you prefer? To answer this question, a detailed paper by paper study is presented of the coverage achieved by ISI Web of Science and by Scopus of the output of a typical university. After considering the set of Portuguese universities, the detailed analysis is made for two of them for 2006, the two being chosen for their comprehensiveness typical of most European universities. The general conclusion is that about 2/3 of the documents referenced in any of the two databases may be found in both databases while a fringe of 1/3 are only referenced in one or the other. The citation impact of the documents in the core present in both databases is higher, but the impact of the fringe that are present only in one of the databases should not be disregarded as some high impact documents may be found among them.", "paper_title": "A comparison of Scopus and Web of Science for a typical university", "paper_id": "WOS:000270979000020"}