{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "engineering_drawings"}, {"score": 0.004735519962945449, "phrase": "product_lifecycle"}, {"score": 0.004580550308652044, "phrase": "aerospace_industry"}, {"score": 0.004309447157234078, "phrase": "mbd"}, {"score": 0.004076858589744185, "phrase": "reduced_time"}, {"score": 0.0039433581938239926, "phrase": "improved_product_quality"}, {"score": 0.003211145390854807, "phrase": "whole_product_lifecycle"}, {"score": 0.0030715948036518603, "phrase": "traditional_engineering_drawings"}, {"score": 0.003004103583782076, "phrase": "essential_part"}, {"score": 0.0028895324165046166, "phrase": "non-geometric_information"}, {"score": 0.0028260302580927856, "phrase": "thirty-four_interviews"}, {"score": 0.0023920904611571783, "phrase": "mbd_initiative"}, {"score": 0.0023136311468961125, "phrase": "necessary_elements"}, {"score": 0.0022880528191813083, "phrase": "specific_requirements"}, {"score": 0.0022007302738063566, "phrase": "emergent_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MBD", " Model-based Definition", " Engineering drawing", " Product lifecycle", " CAD"], "paper_abstract": "The Model-based Definition (MBD) approach is gaining popularity in various industries. MBD represents a trend in Computer-aided Design (CAD) that promises reduced time-to-market and improved product quality. Its main goal is to improve and accelerate the design, manufacturing and inspection processes by integrating drawing annotations directly onto a 3D model, therefore obviating the need to generate engineering drawings. However, its implementation throughout the whole product lifecycle has not yet been fully adopted. Traditional engineering drawings still play an essential part in the capture and distribution of non-geometric information. Based on thirty-four interviews conducted within the Engineering, Drafting, Configuration Management, Airworthiness and Certification, Manufacturing, Inspection and Knowledge Management departments from two Canadian Aerospace companies, the objective of this paper is to report on the main barriers that need to be overcome in order to fully implement the MBD initiative. In addition, the necessary elements and specific requirements needed to evaluate the capacities of emergent tools are proposed. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Will Model-based Definition replace engineering drawings throughout the product lifecycle? A global perspective from aerospace industry", "paper_id": "WOS:000279217100010"}