{"auto_keywords": [{"score": 0.04727623265628531, "phrase": "underlying_matroids"}, {"score": 0.009060411630948067, "phrase": "well-formed_system"}, {"score": 0.00481495049065317, "phrase": "conflicting_combinatorial_preprocessors_for_geometric_constraint_systems._polynomial_equation_systems"}, {"score": 0.004652016085325825, "phrase": "combinatorial_information"}, {"score": 0.004249957578636515, "phrase": "numeric-algebraic_techniques"}, {"score": 0.004159446063902181, "phrase": "graph_algorithms"}, {"score": 0.0036710872046569532, "phrase": "different_graph_algorithms"}, {"score": 0.0035620354052144656, "phrase": "key_challenge"}, {"score": 0.0032398798149196432, "phrase": "incident_rigid_bodies"}, {"score": 0.003050166508545763, "phrase": "decomposed_large_geometric_constraint_systems"}, {"score": 0.0028839363228932704, "phrase": "algebraic_complexity"}, {"score": 0.0028468767420392945, "phrase": "parametrized_system"}, {"score": 0.002703327151461985, "phrase": "numerical_errors"}, {"score": 0.002448061472257196, "phrase": "first_algorithm"}, {"score": 0.0022457226013538343, "phrase": "optimal_algebraic_complexity"}, {"score": 0.002132420504803564, "phrase": "well-behaved_maps"}, {"score": 0.0021049977753042253, "phrase": "associated_matroids"}], "paper_keywords": ["Combinatorial preprocessing of algebraic systems", " graph-based optimization of algebraic complexity", " 3D geometric constraint systems", " solving polynomial systems"], "paper_abstract": "Polynomial equation systems arising from real applications often have associated combinatorial information, expressible as graphs and underlying matroids. To simplify the system and improve its numerical robustness before attempting to solve it with numeric-algebraic techniques, solvers can employ graph algorithms to extract substructures satisfying or optimizing various combinatorial properties. When there are underlying matroids, these algorithms can be greedy and efficient. In practice, correct and effective merging of the outputs of different graph algorithms to simultaneously satisfy their goals is a key challenge. This paper merges and improves two highly effective but separate graph-based algorithms that preprocess systems for resolving the relative position and orientation of a collection of incident rigid bodies. Such collections naturally arise in many situations, for example in the recombination of decomposed large geometric constraint systems. Each algorithm selects a subset of incidences, one to optimize algebraic complexity of a parametrized system, the other to obtain a well-formed system that is robust against numerical errors. Both algorithms are greedy and can be proven correct by revealing underlying matroids. The challenge is that the output of the first algorithm is not guaranteed to be extensible to a well-formed system, while the output of the second may not have optimal algebraic complexity. Here we show how to reconcile the two algorithms by revealing well-behaved maps between the associated matroids.", "paper_title": "RECONCILING CONFLICTING COMBINATORIAL PREPROCESSORS FOR GEOMETRIC CONSTRAINT SYSTEMS", "paper_id": "WOS:000285838100001"}