{"auto_keywords": [{"score": 0.02473910650224089, "phrase": "full_ranking_information"}, {"score": 0.00481495049065317, "phrase": "evolutionary_algorithms"}, {"score": 0.004784565134881178, "phrase": "evolutionary_optimization"}, {"score": 0.004724365740062236, "phrase": "genetic_optimization"}, {"score": 0.004664920223650814, "phrase": "general_framework"}, {"score": 0.004228768988306315, "phrase": "widely_used_evolution_strategies"}, {"score": 0.004162328961227939, "phrase": "continuous_domains"}, {"score": 0.0037969755088553326, "phrase": "linear_convergence"}, {"score": 0.0036322130692776375, "phrase": "n_steps"}, {"score": 0.0035751195836400177, "phrase": "c-n"}, {"score": 0.003313236365209158, "phrase": "comparison-based_algorithms"}, {"score": 0.0031593653672862924, "phrase": "simplex_method"}, {"score": 0.0031195501386327047, "phrase": "direct_search_method"}, {"score": 0.0026452734009203764, "phrase": "former_results"}, {"score": 0.002367259428370391, "phrase": "faster_convergence_rates"}, {"score": 0.0021936636821827935, "phrase": "particular_cases"}, {"score": 0.0021386687477715494, "phrase": "lower_bounds"}, {"score": 0.0021049977753042253, "phrase": "superlinear_convergence_results"}], "paper_keywords": [""], "paper_abstract": "Evolutionary optimization, among which genetic optimization, is a general framework for optimization. It is known (i) easy to use (ii) robust (iii) derivative-free (iv) unfortunately slow. Recent work [8] in particular show that the convergence rate of some widely used evolution strategies (evolutionary optimization for continuous domains) can not be faster than linear (i.e. the logarithm of the distance to the optimum can not decrease faster than linearly), and that the constant in the linear convergence (i.e. the constant C such that the distance to the optimum after n steps is upper bounded by C-n) unfortunately converges quickly to I as the dimension increases to infinity. We here show a very wide generalization of this result: all comparison-based algorithms have such a limitation. Note that our result also concerns methods like the Hooke & Jeeves algorithm, the simplex method, or any direct search method that only compares the values to previously seen values of the fitness. But it does not cover methods that use the value of the fitness (see [5] for cases in which the fitness-values are used), even if these methods do not use gradients. The former results deal with convergence with respect to the number of comparisons performed, and also include a very wide family of algorithms with respect to the number of function-evaluations. However, there is still place for faster convergence rates, for more original algorithms using the full ranking information of the population and not only selections among the population. We prove that, at least in some particular cases, using the full ranking information can improve these lower bounds, and ultimately provide superlinear convergence results.", "paper_title": "General lower bounds for evolutionary algorithms", "paper_id": "WOS:000241446400003"}