{"auto_keywords": [{"score": 0.04970018005584556, "phrase": "datahub"}, {"score": 0.010612385608070223, "phrase": "collaborative_data_analytics"}, {"score": 0.008674922882640325, "phrase": "data_analysis"}, {"score": 0.005391488805597239, "phrase": "conference_attendees"}, {"score": 0.004554488671294504, "phrase": "large_volumes"}, {"score": 0.003994714109598034, "phrase": "heterogeneous_tools"}, {"score": 0.0034208822062692127, "phrase": "external_applications"}, {"score": 0.0033803056981691866, "phrase": "share_datasets"}, {"score": 0.0032614317990293695, "phrase": "datahub_platform"}, {"score": 0.0030602966787192745, "phrase": "multiple_conference_attendees"}, {"score": 0.00295264307195965, "phrase": "different_versions"}, {"score": 0.0024586427394152196, "phrase": "common_data_store"}, {"score": 0.0023439791019638535, "phrase": "python"}, {"score": 0.0023161450088927324, "phrase": "matlab"}, {"score": 0.0021049977753042253, "phrase": "datahub_notebook"}], "paper_keywords": [""], "paper_abstract": "While there have been many solutions proposed for storing and analyzing large volumes of data, all of these solutions have limited support for collaborative data analytics, especially given the many individuals and teams are simultaneously analyzing, modifying and exchanging datasets, employing a number of heterogeneous tools or languages for data analysis, and writing scripts to clean, preprocess, or query data. We demonstrate DataHub, a unified platform with the ability to load, store, query, collaboratively analyze, interactively visualize, interface with external applications, and share datasets. We will demonstrate the following aspects of the DataHub platform: (a) flexible data storage, sharing, and native versioning capabilities: multiple conference attendees can concurrently update the database and browse the different versions and inspect conflicts; (b) an app ecosystem that hosts apps for various data-processing activities: conference attendees will be able to effortlessly ingest, query, and visualize data using our existing apps; (c) thrift-based data serialization permits data analysis in any combination of 20+ languages, with DataHub as the common data store: conference attendees will be able to analyze datasets in R, Python, and Matlab, while the inputs and the results are still stored in DataHub. In particular, conference attendees will be able to use the DataHub notebook an IPython-based notebook for analyzing data and storing the results of data analysis.", "paper_title": "Collaborative Data Analytics with DataHub", "paper_id": "WOS:000386424800065"}