{"auto_keywords": [{"score": 0.049428038438509174, "phrase": "humanoid_robot"}, {"score": 0.013603136431888593, "phrase": "individual_concepts"}, {"score": 0.00481495049065317, "phrase": "probabilistic_concept_web"}, {"score": 0.004496280772084575, "phrase": "key_elements"}, {"score": 0.004315249628884236, "phrase": "important_problem"}, {"score": 0.00419861271409079, "phrase": "grounded_representation"}, {"score": 0.0039027036493682887, "phrase": "probabilistic_method"}, {"score": 0.003849579089885659, "phrase": "markov_random_fields"}, {"score": 0.0037798652680135106, "phrase": "concept_web"}, {"score": 0.003465521267039616, "phrase": "individual_concept"}, {"score": 0.0033872210664940786, "phrase": "prototype-based_conceptualization_method"}, {"score": 0.002527788827701828, "phrase": "perceptual_information"}, {"score": 0.0024593458703463474, "phrase": "corresponding_concepts"}], "paper_keywords": ["Concepts", " conceptualization", " concept web", " Markov Random Fields"], "paper_abstract": "It is now widely accepted that concepts and conceptualization are key elements towards achieving cognition on a humanoid robot. An important problem on this path is the grounded representation of individual concepts and the relationships between them. In this article, we propose a probabilistic method based on Markov Random Fields to model a concept web on a humanoid robot where individual concepts and the relations between them are captured. In this web, each individual concept is represented using a prototype-based conceptualization method that we proposed in our earlier work. Relations between concepts are linked to the cooccurrences of concepts in interactions. By conveying input from perception, action, and language, the concept web forms rich, structured, grounded information about objects, their affordances, words, etc. We demonstrate that, given an interaction, a word, or the perceptual information from an object, the corresponding concepts in the web are activated, much the same way as they are in humans. Moreover, we show that the robot can use these activations in its concept web for several tasks to disambiguate its understanding of the scene.", "paper_title": "A Probabilistic Concept Web on a Humanoid Robot", "paper_id": "WOS:000356164500003"}