{"auto_keywords": [{"score": 0.029420333683948755, "phrase": "one-phase_protocols"}, {"score": 0.028710465264333657, "phrase": "bridge_node"}, {"score": 0.026548870193745674, "phrase": "symmetric_functions"}, {"score": 0.00481495049065317, "phrase": "private_computations"}, {"score": 0.004790902617513584, "phrase": "information-theoretical_settings"}, {"score": 0.004377921202912336, "phrase": "lossy_private_protocols"}, {"score": 0.004334280585565239, "phrase": "private_protocols"}, {"score": 0.004195418010131832, "phrase": "good_protocols"}, {"score": 0.0036370297611938796, "phrase": "communication_strings"}, {"score": 0.003407549468745519, "phrase": "different_probability_distributions"}, {"score": 0.0032900200522703923, "phrase": "optimal_protocols"}, {"score": 0.003249031799973021, "phrase": "pairwise_disjoint_support"}, {"score": 0.002938931857801796, "phrase": "communication_complexity"}, {"score": 0.0028950342507292615, "phrase": "private_protocol"}, {"score": 0.0028446460307503343, "phrase": "constant_factors"}, {"score": 0.0027395968397212053, "phrase": "one-round_communication_protocols"}, {"score": 0.0024409687366442672, "phrase": "increasing_size"}, {"score": 0.002404491061319098, "phrase": "one-phase_protocol"}, {"score": 0.0021530945641993152, "phrase": "information_loss"}, {"score": 0.0021049977753042253, "phrase": "best_k-phase_protocol"}], "paper_keywords": ["Private computation", " Secure multi-party computation", " Secure function evaluation", " Communication complexity", " Graph connectivity", " Randomness"], "paper_abstract": "We study private computations in information-theoretical settings on networks that are not 2-connected. Non-2-connected networks are \"non-private\" in the sense that most functions cannot privately be computed on them. We relax the notion of privacy by introducing lossy private protocols, which generalize private protocols. We measure the information each player gains during the computation. Good protocols should minimize the amount of information they lose to the players. Throughout this work, privacy always means 1-privacy, i.e. players are not allowed to share their knowledge. Furthermore, the players are honest but curious, thus they never deviate from the given protocol. The randomness used by the protocol yields distributions on communication strings for each player and for each input. We define the loss of a protocol to a player as the logarithm of the number of different probability distributions the player can observe. This is justified since we prove that in optimal protocols, the distributions have pairwise disjoint support. Thus, the players can easily distinguish them, and the logarithm of their number is the number of bits the player learns. The simplest non-2-connected networks consists of two blocks that share one bridge node. We prove that on such networks, communication complexity and the loss of a private protocol are closely related: Up to constant factors, they are the same. Then we study one-phase protocols, an analogue of one-round communication protocols. In such a protocol each bridge node may communicate with each block only once. We investigate in which order a bridge node should communicate with the blocks to minimize the loss of information. In particular, for symmetric functions it is optimal to sort the components by increasing size. Then we design a one-phase protocol that for symmetric functions simultaneously minimizes the loss at all nodes where the minimum is taken over all one-phase protocols. Finally, we prove a phase hierarchy. For any k there is a function such that every (k-1)-phase protocol for this function has an information loss that is exponentially greater than that of the best k-phase protocol.", "paper_title": "Privacy in Non-private Environments", "paper_id": "WOS:000285875900010"}