{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "humanities_research"}, {"score": 0.004247696749118451, "phrase": "academic_monograph_-_considering_continuing_decline"}, {"score": 0.004054931951058077, "phrase": "digital_age"}, {"score": 0.003543804852018315, "phrase": "great_value"}, {"score": 0.0034624082435775676, "phrase": "humanities_field"}, {"score": 0.003336031521101184, "phrase": "career_progression"}, {"score": 0.002795762692061496, "phrase": "digital_versions"}, {"score": 0.0025952620596908773, "phrase": "viable_option"}, {"score": 0.0025474193855847074, "phrase": "continuing_publication"}, {"score": 0.002523828967909659, "phrase": "specialist_works"}, {"score": 0.0021746987512551693, "phrase": "unique_insight"}, {"score": 0.0021445492649196977, "phrase": "scholarly_communication_behaviour"}, {"score": 0.0021049977753042253, "phrase": "humanities_researchers"}], "paper_keywords": ["Monographics", " Academic staff", " Electronic books"], "paper_abstract": "Purpose - The purpose of this paper is to report on a project undertaken at University College London (UCL) examining the role and value of the academic monograph - considering continuing decline in sales and usage - and its possible survival in the digital age. Design/methodology/approach - A qualitative approach was adopted, in which 17 arts and humanities academics were interviewed in-depth on their experiences and views. Findings - The monograph continues to be of great value in the arts and humanities field, and is seen as essential for career progression. Much concern was expressed about the decline in quality of this and other forms of writing, with pressures of the university Research Assessment Exercise foremost in contributing to this decline. Reservations were expressed about moving towards digital versions of the monograph, although print-on-demand was considered to be a viable option to enable the continuing publication of specialist works. Originality/value - This is the first in-depth study of the role, value and future of the monograph from the viewpoint of the scholar, and so gives a unique insight into the scholarly communication behaviour of arts and humanities researchers.", "paper_title": "The role and future of the monograph in arts and humanities research", "paper_id": "WOS:000263451200004"}