{"auto_keywords": [{"score": 0.049178471674397164, "phrase": "chemical_analyses"}, {"score": 0.004814972659693092, "phrase": "excel"}, {"score": 0.004548253531664032, "phrase": "microsoft_excel_spreadsheet"}, {"score": 0.004316722156877335, "phrase": "orthorhombic_and_monoclinic_amphiboles"}, {"score": 0.004000741805312148, "phrase": "compositional_data"}, {"score": 0.0035525230119401153, "phrase": "oh_content"}, {"score": 0.003022186855664124, "phrase": "mandatory_chemical_prefixes"}, {"score": 0.002868116925014397, "phrase": "formula_results"}, {"score": 0.0026705669656375197, "phrase": "space_groups"}, {"score": 0.0024747842618794255, "phrase": "large_data_sets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Amphibole", " Electron microprobe", " Excel", " Guidelines", " Nomenclature", " Spreadsheet"], "paper_abstract": "A Microsoft Excel spreadsheet has been programmed to assist with classification of chemical analyses of orthorhombic and monoclinic amphiboles following the 2012 nomenclature recommended by the International Mineralogical Association. The spreadsheet is intended for use only with compositional data (wt% oxides and halogens, rather than atomic proportions) and provides options for the estimation of Fe3+/Sigma Fe and Mn3+/Sigma Mn ratios and OH content. Various cation normalization schemes can be automatically or manually selected. For each analysis, the output includes the group, subgroup (or B-occupancy for the oxo-amphiboles), and species name including any mandatory chemical prefixes, along with a formula based on 24 anions. The formula results can be exported in a form suitable for the AMPH2012 program. Prefixes related to space groups (proto-) and suffixes (-P2(1)/m) are not assigned in the spreadsheet. Large data sets (up to 200 analyses at a time) can be accommodated by the spreadsheet, which is accompanied by results calculated for more than 650 amphibole analyses taken from the literature. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "An Excel spreadsheet to classify chemical analyses of amphiboles following the IMA 2012 recommendations", "paper_id": "WOS:000328724500001"}