{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clinical_information_modelling_tools"}, {"score": 0.04592160859866953, "phrase": "existing_tools"}, {"score": 0.004694353795114243, "phrase": "consensus_requirements"}, {"score": 0.0045933810497156705, "phrase": "modelling_tasks"}, {"score": 0.0039019217388438134, "phrase": "clinical_information"}, {"score": 0.0038877961007492646, "phrase": "modelling_tools"}, {"score": 0.003831801113154043, "phrase": "literature_review"}, {"score": 0.0037357362372975327, "phrase": "classical_delphi_study_methodology"}, {"score": 0.003512308265830794, "phrase": "essential_requirements"}, {"score": 0.003314203895848455, "phrase": "clinical_information_modelling"}, {"score": 0.00320770578058916, "phrase": "certified_tools_list"}, {"score": 0.003115908199991072, "phrase": "essential_criteria"}, {"score": 0.003059869469624301, "phrase": "recommended_requirements"}, {"score": 0.0029294420752976947, "phrase": "superior_product"}, {"score": 0.002704554429386671, "phrase": "high_level"}, {"score": 0.0024430651605100214, "phrase": "identified_requirements"}, {"score": 0.0023730978395564116, "phrase": "new_basic_and_advanced_functionalities"}, {"score": 0.0023219374444738723, "phrase": "end_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic Health Record", " Semantic interoperability", " Clinical information modelling tools", " Archetypes", " Detailed Clinical Models", " Qualitative research", " Delphi study"], "paper_abstract": "Objective: This study proposes consensus requirements for clinical information modelling tools that can support modelling tasks in medium/large scale institutions. Rather than identify which functionalities are currently available in existing tools, the study has focused on functionalities that should be covered in order to provide guidance about how to evolve the existing tools. Methodology: After identifying a set of 56 requirements for clinical information modelling tools based on a literature review and interviews with experts, a classical Delphi study methodology was applied to conduct a two round survey in order to classify them as essential or recommended. Essential requirements are those that must be met by any tool that claims to be suitable for clinical information modelling, and if we one day have a certified tools list, any tool that does not meet essential criteria would be excluded. Recommended requirements are those more advanced requirements that may be met by tools offering a superior product or only needed in certain modelling situations. Results: According to the answers provided by 57 experts from 14 different countries, we found a high level of agreement to enable the study to identify 20 essential and 21 recommended requirements for these tools. Conclusions: It is expected that this list of identified requirements will guide developers on the inclusion of new basic and advanced functionalities that have strong support by end users. This list could also guide regulators in order to identify requirements that could be demanded of tools adopted within their institutions. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Requirements for clinical information modelling tools", "paper_id": "WOS:000353775000006"}