{"auto_keywords": [{"score": 0.04234293111782263, "phrase": "mathematical_formulations"}, {"score": 0.03738803173130437, "phrase": "entire_community"}, {"score": 0.02534559122367137, "phrase": "new_network"}, {"score": 0.00481495049065317, "phrase": "local_group_information"}, {"score": 0.004698086429418318, "phrase": "recent_interest"}, {"score": 0.004612294931699583, "phrase": "broad_range"}, {"score": 0.004066360459825868, "phrase": "wide_variety"}, {"score": 0.0037887998222248314, "phrase": "general_principle"}, {"score": 0.003189408489240117, "phrase": "well-connected_nodes"}, {"score": 0.003121462741365354, "phrase": "larger_communities"}, {"score": 0.003045575673942459, "phrase": "seven_real_networks"}, {"score": 0.0030083247178199434, "phrase": "external_annotation"}, {"score": 0.0029532983066856994, "phrase": "\"annotated_communities"}, {"score": 0.002890367960684987, "phrase": "annotated_communities"}, {"score": 0.002837493000816031, "phrase": "second_category"}, {"score": 0.0028200832328369816, "phrase": "community_detection_algorithms"}, {"score": 0.002759983642011259, "phrase": "first_category"}, {"score": 0.002709487386923251, "phrase": "flexible_algorithm_template"}, {"score": 0.0026273662637635747, "phrase": "small_sets"}, {"score": 0.0024704972295365164, "phrase": "single_node's_\"perception"}, {"score": 0.002224966726830651, "phrase": "multiple_subcommunities"}, {"score": 0.00217082725339744, "phrase": "overlapping_communities"}, {"score": 0.0021376596688185605, "phrase": "real_data"}], "paper_keywords": ["Algorithms", " Design", " Social networks", " communities"], "paper_abstract": "The recent interest in networks has inspired a broad range of work on algorithms and techniques to characterize, identify, and extract communities from networks. Such efforts are complicated by a lack of consensus on what a \"community\" truly is, and these disagreements have led to a wide variety of mathematical formulations for describing communities. Often, these mathematical formulations, such as modularity and conductance, have been founded in the general principle that communities, like a G(n, p) graph, are \"round,\" with connections throughout the entire community, and so algorithms were developed to optimize such mathematical measures. More recently, a variety of algorithms have been developed that, rather than expecting connectivity through the entire community, seek out very small groups of well-connected nodes and then connect these groups into larger communities. In this article, we examine seven real networks, each containing external annotation that allows us to identify \"annotated communities.\" A study of these annotated communities gives insight into why the second category of community detection algorithms may be more successful than the first category. We then present a flexible algorithm template that is based on the idea of joining together small sets of nodes. In this template, we first identify very small, tightly connected \"subcommunities\" of nodes, each corresponding to a single node's \"perception\" of the network around it. We then create a new network in which each node represents such a subcommunity, and then identify communities in this new network. Because each node can appear in multiple subcommunities, this method allows us to detect overlapping communities. When evaluated on real data, we show that our template outperforms many other state-of-the-art algorithms.", "paper_title": "Use of Local Group Information to Identify Communities in Networks", "paper_id": "WOS:000354053500008"}