{"auto_keywords": [{"score": 0.046030203640502004, "phrase": "context_information"}, {"score": 0.022485755538289118, "phrase": "context-aware_applications"}, {"score": 0.010496798602845584, "phrase": "reasoning_techniques"}, {"score": 0.00481495049065317, "phrase": "context_modelling"}, {"score": 0.0035953368057880593, "phrase": "pervasive_computing_community"}, {"score": 0.0034024277222012597, "phrase": "adequate_context_information_modelling"}, {"score": 0.002931569771634119, "phrase": "modelling_and_reasoning_techniques"}, {"score": 0.002758907973783665, "phrase": "context_information_types"}, {"score": 0.0026838147966444783, "phrase": "high-level_context_abstractions"}, {"score": 0.0025963890234079333, "phrase": "context_information_facts"}, {"score": 0.002286781334850213, "phrase": "current_context_modelling"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Context modelling", " Context reasoning", " Context management", " Quality of context", " Situation modelling"], "paper_abstract": "Development of context-aware applications is inherently complex. These applications adapt to changing context information: physical context, computational context, and user context/tasks. Context information is gathered from a variety of sources that differ in the quality of information they produce and that are often failure prone. The pervasive computing community increasingly understands that developing context-aware applications should be supported by adequate context information modelling and reasoning techniques. These techniques reduce the complexity of context-aware applications and improve their maintainability and evolvability. In this paper we discuss the requirements that context modelling and reasoning techniques should meet, including the modelling of a variety of context information types and their relationships, of high-level context abstractions describing real world situations using context information facts, of histories of context information, and of uncertainty of context information. This discussion is followed by a description and comparison of current context modelling and reasoning techniques and a lesson learned from this comparison. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A survey of context modelling and reasoning techniques", "paper_id": "WOS:000208192700002"}