{"auto_keywords": [{"score": 0.034166914460032366, "phrase": "megiddo's_result"}, {"score": 0.03235333437738429, "phrase": "optimization_problems"}, {"score": 0.00481495049065317, "phrase": "rational_objectives"}, {"score": 0.004700468701207975, "phrase": "linear_ones"}, {"score": 0.004607143715103441, "phrase": "megiddo"}, {"score": 0.003955593400628455, "phrase": "rational_function"}, {"score": 0.003301733505307784, "phrase": "rather_strong_assumption"}, {"score": 0.0032753168662834516, "phrase": "hashizume_et_al"}, {"score": 0.00319732428387928, "phrase": "approximation_algorithms"}, {"score": 0.003083793024782014, "phrase": "good_approximation_algorithms"}, {"score": 0.003034633345146293, "phrase": "possibly_negative_coefficients"}, {"score": 0.0028115863316685937, "phrase": "alternative_extension"}, {"score": 0.002668470532683947, "phrase": "large_class"}, {"score": 0.0024524733595572084, "phrase": "nonnegative_linear_function"}, {"score": 0.002209060366991921, "phrase": "nonnegative_rational_function"}, {"score": 0.0021049977753042253, "phrase": "network_design_problems"}], "paper_keywords": [""], "paper_abstract": "In the late seventies, Megiddo proposed a way to use an algorithm for the problem of minimizing a linear function a(0) + a(1)x(1) + - - - + a,x, subject to certain constraints to solve the problem of minimizing a rational function of the form (a(0) + a(1)x(1) + - - - + a(n)x(n))/(b(0) + b(1)x(1) + - - - + b(n)x(n)) subject to the same set of constraints, assuming that the denominator is always positive. Using a rather strong assumption, Hashizume et al. extended Megiddo's result to include approximation algorithms. Their assumption essentially asks for the existence of good approximation algorithms for optimization problems with possibly negative coefficients in the (linear) objective function, which is rather unusual for most combinatorial problems. In this paper, we present an alternative extension of Megiddo's result for approximations that avoids this issue and applies to a large class of optimization problems. Specifically, we show that, if there is an a-approximation for the problem of minimizing a nonnegative linear function subject to constraints satisfying a certain increasing property then there is an a-approximation (1/alpha-approximation) for the problem of minimizing (maximizing) a nonnegative rational function subject to the same constraints. Our framework applies to covering problems and network design problems, among others.", "paper_title": "Approximating rational objectives is as easy as approximating linear ones", "paper_id": "WOS:000239474700033"}