{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "article_impact"}, {"score": 0.03685346150401484, "phrase": "article's_total_number"}, {"score": 0.03162841317042495, "phrase": "citation_windows"}, {"score": 0.03069592066792996, "phrase": "simplified_weighted_sum"}, {"score": 0.03046698918573996, "phrase": "long-term_citation"}, {"score": 0.02945710664491916, "phrase": "standard_indicator"}, {"score": 0.004723502760019443, "phrase": "australia"}, {"score": 0.004633429997452688, "phrase": "recent_move"}, {"score": 0.004580314008293946, "phrase": "citation_analysis"}, {"score": 0.004323690117778359, "phrase": "uk_research_excellence_framework"}, {"score": 0.004208881856146758, "phrase": "citation_data"}, {"score": 0.004160612392068268, "phrase": "research_evaluation"}, {"score": 0.0037937873032347, "phrase": "individual_articles"}, {"score": 0.0036788184374592706, "phrase": "peer_review"}, {"score": 0.003636605792981828, "phrase": "new_hybrid_indicator"}, {"score": 0.0035948757703015287, "phrase": "weighted_sum"}, {"score": 0.0035399770257915466, "phrase": "common_usage"}, {"score": 0.0034326732528567826, "phrase": "citation_window"}, {"score": 0.003202944392720772, "phrase": "new_indicator"}, {"score": 0.003105824909705158, "phrase": "longer_citation_window"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bibliometrics", " Research evaluation", " Research impact", " REF", " RAE", " Citation analysis"], "paper_abstract": "In both the UK and Australia there has been a recent move to use citation analysis in the evaluation of the research of individuals. In particular, the future UK Research Excellence Framework (REF), proposes using citation data in the research evaluation of articles published as recently as the year prior to the evaluation. In response to this move, this research develops an indicator at the level of individual articles that, when normalized, can supplement peer review. The new hybrid indicator is the weighted sum of two indicators in common usage: the article's total number of citations in a citation window, and the Impact Factor of the journal in which the article was published. This research compares this new indicator with the article's total number of citations in a longer citation window (the standard indicator of article impact). For citation windows of 0 or 1 years, the correlation of the simplified weighted sum with long-term citation is substantially higher than the correlation of the standard indicator of article citation with long-term citation. Moreover, for citation windows of as long as 3 years the standard indicator of citation correlates significantly with the month of publication, in that articles published earlier in the year are on average more highly cited than those published later in the year. By contrast, the skewing of the simplified weighted sum towards articles published early in the year is considerably less than that of the standard indicator. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A combined bibliometric indicator to predict article impact", "paper_id": "WOS:000288407300012"}