{"auto_keywords": [{"score": 0.024577351981225137, "phrase": "facebook"}, {"score": 0.00481495049065317, "phrase": "explanations_styles"}, {"score": 0.004783607451937166, "phrase": "traditional_and_social_recommender_systems"}, {"score": 0.004629912133717504, "phrase": "better_help_users"}, {"score": 0.004525259757290933, "phrase": "even_friends"}, {"score": 0.004379828513102091, "phrase": "explanation_style"}, {"score": 0.004280804599325052, "phrase": "recommender_system"}, {"score": 0.0040893952934649485, "phrase": "different_recommender_systems_category"}, {"score": 0.004023120753104693, "phrase": "different_explanation_style_category"}, {"score": 0.0035230275854291554, "phrase": "netflix"}, {"score": 0.003361069456060196, "phrase": "human_style"}, {"score": 0.003263586288720322, "phrase": "similar_users"}, {"score": 0.003107337317471694, "phrase": "similar_items"}, {"score": 0.0029877254536170017, "phrase": "item_features"}, {"score": 0.0028633212043378564, "phrase": "aforementioned_styles"}, {"score": 0.0028076592725295646, "phrase": "hybrid_style"}, {"score": 0.002664446536828292, "phrase": "recommender_systems"}, {"score": 0.002578662558305782, "phrase": "inadequate_research"}, {"score": 0.0025368092524479615, "phrase": "social_web"}, {"score": 0.0025202582748972122, "phrase": "contemporary_recommender_systems"}, {"score": 0.002471248834609488, "phrase": "new_emerged_social_recommender_systems_i._e._facebook_connect_explanations"}, {"score": 0.0023298518405721804, "phrase": "social_data"}], "paper_keywords": ["Recommender systems", " Explanations", " Social justification"], "paper_abstract": "Recommender systems usually provide explanations of their recommendations to better help users to choose products, activities or even friends. Up until now, the type of an explanation style was considered in accordance to the recommender system that employed it. This relation was one-to-one, meaning that for each different recommender systems category, there was a different explanation style category. However, this kind of one-to-one correspondence can be considered as over-simplistic and non generalizable. In contrast, we consider three fundamental resources that can be used in an explanation: users, items and features and any combination of them. In this survey, we define (i) the Human style of explanation, which provides explanations based on similar users, (ii) the Item style of explanation, which is based on choices made by a user on similar items and (iii) the Feature style of explanation, which explains the recommendation based on item features rated by the user beforehand. By using any combination of the aforementioned styles we can also define the Hybrid style of explanation. We demonstrate how these styles are put into practice, by presenting recommender systems that employ them. Moreover, since there is inadequate research in the impact of social web in contemporary recommender systems and their explanation styles, we study new emerged social recommender systems i. e. Facebook Connect explanations (HuffPo, Netflix, etc.) and geo-social explanations that combine geographical with social data (Gowalla, Facebook Places, etc.). Finally, we summarize the results of three different user studies, to support that Hybrid is the most effective explanation style, since it incorporates all other styles.", "paper_title": "A generalized taxonomy of explanations styles for traditional and social recommender systems", "paper_id": "WOS:000302478900004"}