{"auto_keywords": [{"score": 0.04293428941101478, "phrase": "deterministic_routing_algorithm"}, {"score": 0.004732785510739708, "phrase": "interconnection_networks"}, {"score": 0.0045464538515249085, "phrase": "high-performance_parallel_computing"}, {"score": 0.004268293864953256, "phrase": "simple_but_very_efficient_routing_schemes"}, {"score": 0.0036763623220059933, "phrase": "-order_packet_delivery"}, {"score": 0.0034118234596993836, "phrase": "high_traffic_loads"}, {"score": 0.003372844338742438, "phrase": "hot-spot_traffic_scenarios"}, {"score": 0.003221316290858497, "phrase": "network_resources"}, {"score": 0.003006654007926993, "phrase": "network_performance"}, {"score": 0.0027424619603260837, "phrase": "hol-blocking_problem"}, {"score": 0.0026191799769765085, "phrase": "aforementioned_deterministic_routing_algorithm"}, {"score": 0.0023889533502525527, "phrase": "mentioned_environment"}, {"score": 0.0022296340517805125, "phrase": "switch_complexity"}, {"score": 0.002191489192077851, "phrase": "required_silicon_area"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["interconnection networks", " fat-trees", " deterministic routing", " head-of-line blocking"], "paper_abstract": "The fat-tree is one of the most common topologies among the interconnection networks of the systems currently used for high-performance parallel computing. Among other advantages, fat-trees allow the use of simple but very efficient routing schemes. One of them is a deterministic routing algorithm that has been recently proposed, offering a similar (or better) performance than adaptive routing while reducing complexity and guaranteeing in-order packet delivery. However, as other deterministic routing proposals, this deterministic routing algorithm cannot react when high traffic loads or hot-spot traffic scenarios produce severe contention for the use of network resources, leading to the appearance of Head-of-Line (HoL) blocking, which spoils the network performance. In that sense, we describe in this paper two simple, cost-effective strategies for dealing with the HoL-blocking problem that may appear in fat-trees with the aforementioned deterministic routing algorithm. From the results presented in the paper, we conclude that, in the mentioned environment, these proposals considerably reduce HoL-blocking without significantly increasing switch complexity and the required silicon area. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Cost-effective queue schemes for reducing head-of-line blocking in fat-trees", "paper_id": "WOS:000297145100016"}