{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_robots"}, {"score": 0.015499791416900133, "phrase": "virtual_structure"}, {"score": 0.014788358415917715, "phrase": "coordination_algorithm"}, {"score": 0.004136044939878838, "phrase": "efficient_architecture"}, {"score": 0.00388828234270598, "phrase": "meaningful_robot_formations"}, {"score": 0.00332375606483146, "phrase": "lyapunov_technique"}, {"score": 0.0032922964156452696, "phrase": "graph_theory"}, {"score": 0.002937153116494391, "phrase": "efficient_coordination"}, {"score": 0.0028140548269469934, "phrase": "useful_robot_formations"}, {"score": 0.0026705669656375197, "phrase": "differing_formations"}, {"score": 0.0023936956017015696, "phrase": "position_sensor_measurement_errors"}, {"score": 0.0021659920594094407, "phrase": "group_formation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Coordination", " Mobile robots", " Nonlinear control", " Virtual structure"], "paper_abstract": "This paper considers the problem of creating a coordination algorithm for a team of mobile robots. The goal for coordinating a group of mobile robots is to create an efficient architecture and control algorithm that enables them to work both individually and in meaningful robot formations. This is achieved by employing coordination and trajectory following techniques, and the knowledge derived by the localization of the robots from their environments. The model use a combination of the Lyapunov technique and graph theory embedded in the virtual structure. In this way, the knowledge derived by the localization of the robots in the group allows for efficient coordination and trajectory following, which can then create useful robot formations. The results obtained from experiments, using three mobile robots in differing formations, show the performance of the controller and the coordination algorithm. They also demonstrate the ability of the algorithm to recover from position sensor measurement errors and temporary delays or failures in the communication, which may cause the robots to momentarily abandon their place in the group formation. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Nonlinear coordination control for a group of mobile robots using a virtual structure", "paper_id": "WOS:000296221200002"}