{"auto_keywords": [{"score": 0.03900291508534277, "phrase": "cluster_class"}, {"score": 0.025859519724771372, "phrase": "computation_paths"}, {"score": 0.00481495049065317, "phrase": "edge_recognition"}, {"score": 0.004760765880314089, "phrase": "complexity_theory"}, {"score": 0.004689462599037994, "phrase": "path-cardinality-based_restrictions"}, {"score": 0.0040171817997972335, "phrase": "simple_order"}, {"score": 0.0037674258625824113, "phrase": "definition_changes"}, {"score": 0.0034933321145368336, "phrase": "balanced_turing_machine"}, {"score": 0.003363830908814182, "phrase": "length-respecting_total_order"}, {"score": 0.0031784960695034645, "phrase": "defining_paper's_focus"}, {"score": 0.0028919522313933525, "phrase": "cluster_computing"}, {"score": 0.0026611838252683486, "phrase": "new_robustness_results"}, {"score": 0.002552781867125423, "phrase": "closure_properties"}, {"score": 0.0024487847651989128, "phrase": "ordered_collection"}, {"score": 0.0022278779300543548, "phrase": "unique_discovery"}, {"score": 0.002169667676959813, "phrase": "nondeterministic_functions"}], "paper_keywords": [""], "paper_abstract": "Although complexity theory already extensively studies path-cardinality-based restrictions on the power of nondeterminism, this paper is motivated by a more recent goal: To gain insight into how much of a restriction it is of nondeterminism to limit machines to have just one contiguous (with respect to some simple order) interval of accepting paths. In particular, we study the robustness the invariance under definition changes-of the cluster class CL#P [8]. This class contains each #P function that is computed by a balanced Turing machine whose accepting paths always form a cluster with respect to some length-respecting total order with efficient adjacency checks. The definition of CL#P is heavily influenced by the defining paper's focus on (global) orders. In contrast, we define a cluster class, CLU#P, to capture what seems to us a more natural model of cluster computing. We prove that the naturalness is costless: CL#P = CLU#P. Then we exploit the more natural, flexible features of CLU#P to prove new robustness results for CL#P and to expand what is known about the closure properties of CL#P. The complexity of recognizing edges-of an ordered collection of computation paths or of a cluster of accepting computation paths-is central to this study. Most particularly, our proofs exploit the power of unique discovery of edges-the ability of nondeterministic functions to, in certain settings, discover on exactly one (in some cases, on at most one) computation path a critical piece of information regarding edges of orderings or clusters.", "paper_title": "Cluster computing and the power of edge recognition", "paper_id": "WOS:000238091800027"}