{"auto_keywords": [{"score": 0.04543297058735999, "phrase": "sponsored_links"}, {"score": 0.007809994129021345, "phrase": "ecommerce_information"}, {"score": 0.00481495049065317, "phrase": "searcher's_perceptions"}, {"score": 0.00407474190126995, "phrase": "six_ecommerce_web_searching_tasks"}, {"score": 0.003944112858235306, "phrase": "transaction_log"}, {"score": 0.0038962096720793443, "phrase": "web_search_engine"}, {"score": 0.003817655499320344, "phrase": "actual_ecommerce"}, {"score": 0.0037866774001097596, "phrase": "information_needs"}, {"score": 0.0036503460615862574, "phrase": "web_search_engine_results"}, {"score": 0.0027666443986705453, "phrase": "result_pages"}, {"score": 0.002581324549141829, "phrase": "strong_preference"}, {"score": 0.002560352786969071, "phrase": "nonsponsored_links"}, {"score": 0.0023121112251855667, "phrase": "viewing_sponsored_links"}, {"score": 0.00224701149477484, "phrase": "result_listing"}, {"score": 0.0021926693625590006, "phrase": "searcher_evaluation"}, {"score": 0.0021049977753042253, "phrase": "long-term_business_model"}], "paper_keywords": [""], "paper_abstract": "In this article, we report results of an investigation into the effect of sponsored links on ecommerce information seeking on the Web. In this research, 56 participants each engaged in six ecommerce Web searching tasks. We extracted these tasks from the transaction log of a Web search engine, so they represent actual ecommerce searching information needs. Using 60 organic and 30 sponsored Web links, the quality of the Web search engine results was controlled by switching nonsponsored and sponsored links on half of the tasks for each participant. This allowed for investigating the bias toward sponsored links while controlling for quality of content. The study also investigated the relationship between searching self-efficacy, searching experience, types of ecommerce information needs, and the order of links on the viewing of sponsored links. Data included 2,453 interactions with links from result pages and 961 utterances evaluating these links. The results of the study indicate that there is a strong preference for nonsponsored links, with searchers viewing these results first more than 82% of the time. Searching self-efficacy and experience does not increase the likelihood of viewing sponsored links, and the order of the result listing does not appear to affect searcher evaluation of sponsored links. The implications for sponsored links as a long-term business model are discussed.", "paper_title": "An examination of searcher's perceptions of nonsponsored and sponsored links during ecommerce Web searching", "paper_id": "WOS:000246285500008"}