{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "on-chip_networks"}, {"score": 0.033480592614420344, "phrase": "average_packet_latency"}, {"score": 0.03316599630489152, "phrase": "overall_execution_time"}, {"score": 0.03104244392514206, "phrase": "dependency_information"}, {"score": 0.03003061245400797, "phrase": "pdg_gen"}, {"score": 0.004676575291629554, "phrase": "large_scale_chip_multiprocessors"}, {"score": 0.00436890075128947, "phrase": "full-system_simulation"}, {"score": 0.0040222701316738295, "phrase": "design_space_exploration"}, {"score": 0.0038499929374478125, "phrase": "trace-based_simulation"}, {"score": 0.0037942165191367366, "phrase": "different_network_topologies"}, {"score": 0.0033433365160336842, "phrase": "trace-based_simulations"}, {"score": 0.0032471155306148156, "phrase": "incorrect_conclusions"}, {"score": 0.0032156592392706567, "phrase": "network_performance_metrics"}, {"score": 0.003092842645798083, "phrase": "primary_contributions"}, {"score": 0.0025578967205807843, "phrase": "multiple_full-system_simulations"}, {"score": 0.0021049977753042253, "phrase": "traditional_trace-based_methods"}], "paper_keywords": ["Modeling methodologies", " simulation"], "paper_abstract": "With the advent of large scale chip multiprocessors, there is growing interest in the design and analysis of on-chip networks. Full-system simulation is the most accurate way to perform such an analysis, but unfortunately it is very slow and thus limits design space exploration. To overcome this problem researchers frequently use trace-based simulation to study different network topologies and properties, which can be done much faster. Unfortunately, unless the traces that are used include information about dependencies between packets, trace-based simulations can lead one to draw incorrect conclusions about network performance metrics such as average packet latency and overall execution time. The primary contributions of this work are to demonstrate the importance of including dependency information in traces, and to present PDG_GEN, an inference-based technique for identifying and including dependencies in traces. This technique uses traces obtained from multiple full-system simulations of an application of interest to infer dependency information between packets and augment traces with this information. On the SPLASH-2 benchmark suite, PDG_GEN is 2.3 times more accurate at predicting overall execution time and almost 4,000 times more accurate at predicting average packet latency than traditional trace-based methods.", "paper_title": "PDG_GEN: A Methodology for Fast and Accurate Simulation of On-Chip Networks", "paper_id": "WOS:000333471800011"}