{"auto_keywords": [{"score": 0.04962913836247387, "phrase": "new_health_care_technologies"}, {"score": 0.04701209021022985, "phrase": "information_flow"}, {"score": 0.00481495049065317, "phrase": "evaluating_information_flow"}, {"score": 0.004571269461883144, "phrase": "distinct_yet_interrelated_factors"}, {"score": 0.004360412703519539, "phrase": "field_studies"}, {"score": 0.004299064805926241, "phrase": "hospital_ward"}, {"score": 0.004043003243656031, "phrase": "nurses'_information_flow"}, {"score": 0.003967314311312148, "phrase": "shift_change"}, {"score": 0.0035925056609681194, "phrase": "communication_mode"}, {"score": 0.002519739850807611, "phrase": "coherent_descriptions"}, {"score": 0.002437645786158106, "phrase": "technology_deployments"}, {"score": 0.0023030731312573246, "phrase": "infoflow_framework"}], "paper_keywords": [""], "paper_abstract": "This article presents a framework of 6 distinct yet interrelated factors for describing information flow that arose from a combination of field studies in a hospital ward and a review of literature. These studies investigated the dynamics of nurses' information flow, focusing on shift change. The InfoFlow Framework's 6 interrelated factors that affect the information flow are information, personnel, artifacts, spatiality, temporality, and communication mode. The framework is presented as a tool for evaluating new health care technologies. The 6 factors and their interrelationships are described first. Next, this structure is applied as a tool to aid in the analysis of the data generated in a study that assesses technology in use. Then the use of the framework is illustrated by structuring it as a set of questions that can be used as a guide for other researchers to generate coherent descriptions of the information flow and to evaluate technology deployments. Finally, there is a discussion of areas where the InfoFlow framework may be applied to allow an evaluation of the extent to which the framework may be generalized to other settings.", "paper_title": "InfoFlow Framework for Evaluating Information Flow and New Health Care Technologies", "paper_id": "WOS:000277470400004"}