{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "chemical_process_engineering"}, {"score": 0.0031561961485589633, "phrase": "proper_balance"}, {"score": 0.002921114512115261, "phrase": "principled_guidance"}, {"score": 0.0028693932802982417, "phrase": "better_understanding"}, {"score": 0.0028185852354729026, "phrase": "easier_further_development"}, {"score": 0.002768674345336861, "phrase": "exemplary_applications"}, {"score": 0.002655616553414394, "phrase": "computer-aided_process_engineering"}, {"score": 0.0025623821393275146, "phrase": "ontology's_range"}, {"score": 0.0021946656099592608, "phrase": "comprehensive_environment"}, {"score": 0.002168664249034289, "phrase": "adequate_computer_support"}, {"score": 0.0021049977753042253, "phrase": "complex_ontologies"}], "paper_keywords": ["ontology", " methodology", " structural design", " ontology evolution", " chemical engineering", " semantic annotation", " mathematical modeling", " computer-aided process engineering"], "paper_abstract": "An overview on OntoCAPE, a large-scale ontology for chemical process engineering, is given, and the development and some applications of OntoCAPE are reported. The methodology adopted for developing OntoCAPE is described to show how the ontology has evolved from its skeletal, informal specification to a complete, formal specification. Furthermore, the organization of the ontology is addressed through presenting its modular, layered structure. It is shown that this design enables a proper balance between usability and reusability of this ontology and that it provides a principled guidance for a better understanding and an easier further development. Some exemplary applications of OntoCAPE in the area of computer-aided process engineering are sketched to demonstrate the ontology's range of use. It is shown which advantageous features of OntoCAPE facilitate the handling of the changes of such a complex engineering ontology over a long period of evolution. A comprehensive environment providing adequate computer support for the evolution of complex ontologies is envisioned. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "OntoCAPE - A large-scale ontology for chemical process engineering", "paper_id": "WOS:000243698100004"}