{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "salient_regions"}, {"score": 0.004483120978156604, "phrase": "stable_components"}, {"score": 0.004303830426772906, "phrase": "salient_region"}, {"score": 0.004174064076143015, "phrase": "discriminative_local_features"}, {"score": 0.0036928221419965253, "phrase": "represented_object"}, {"score": 0.0035269696779744266, "phrase": "effective_matching"}, {"score": 0.0033685408148574846, "phrase": "coarse_scales"}, {"score": 0.0028170314398963704, "phrase": "efficient_subsequent_tasks"}, {"score": 0.0027741761880779535, "phrase": "desirable_characteristic"}, {"score": 0.0026091594819333654, "phrase": "shape_transformations"}, {"score": 0.0022041312401435346, "phrase": "visual_parts"}, {"score": 0.0021705796895687864, "phrase": "cognitive_science"}], "paper_keywords": ["3D features", " Mesh decomposition"], "paper_abstract": "In this paper, we present a method to detect stable components on 3D meshes. A component is a salient region on the mesh which contains discriminative local features. Our goal is to represent a 3D mesh with a set of regions, which we called key-components, that characterize the represented object and therefore, they could be used for effective matching and recognition. As key-components are features in coarse scales, they are less sensitive to mesh deformations such as noise. In addition, the number of key-components is low compared to other local representations such as keypoints, allowing us to use them in efficient subsequent tasks. A desirable characteristic of a decomposition is that the components should be repeatable regardless shape transformations. We show in the experiments that the key-components are repeatable and robust under several transformations using the SHREC'2010 feature detection benchmark. In addition, we discover the connection between the theory of saliency of visual parts from the cognitive science and the results obtained with our technique.", "paper_title": "Key-components: detection of salient regions on 3D meshes", "paper_id": "WOS:000326929200008"}