{"auto_keywords": [{"score": 0.03423934530657415, "phrase": "committed_students"}, {"score": 0.015719716506582538, "phrase": "peer_review"}, {"score": 0.004727995968069753, "phrase": "massive_courses"}, {"score": 0.004670896353428476, "phrase": "minimising_students'_frustration"}, {"score": 0.004614483128885678, "phrase": "traditional_pedagogical_approaches"}, {"score": 0.00436890075128947, "phrase": "increasing_challenges"}, {"score": 0.0043161190928529755, "phrase": "massive_open"}, {"score": 0.003916098498242888, "phrase": "new_paradigms"}, {"score": 0.003640516896245813, "phrase": "peer_review_methodology"}, {"score": 0.0034049123167891955, "phrase": "students'_frustration"}, {"score": 0.0026050445177883005, "phrase": "first_algorithm"}, {"score": 0.0021049977753042253, "phrase": "second_algorithm"}], "paper_keywords": ["Massive Open Online Courses", " peer review", " peer assessment", " peer evaluation", " evaluation", " assessment", " quality"], "paper_abstract": "Traditional pedagogical approaches are no longer sufficient to cope with the increasing challenges of Massive Open On-line Courses (MOOCs). Consequently, it is necessary to explore new paradigms. This paper describes an exploration of the adaptation of the peer review methodology for its application to MOOCs. Its main goal is to minimise the students' frustration through the reduction of the number of committed students that receive no feedback from their peers. In order to achieve this objective, we propose two algorithms for the peer review matching in MOOCs. Both reward committed students by prioritising the review of their submissions. The first algorithm uses sliding deadlines to minimise the probability of a submission not being reviewed. Our experiments show that it reduces dramatically the number of submissions from committed students that do not receive any review. The second algorithm is a simplification of the former. It is easier to implement and, despite performing worse than the first one, it also improves with respect to the baseline.", "paper_title": "An Algorithm for Peer Review Matching in Massive Courses for Minimising Students' Frustration", "paper_id": "WOS:000329491500002"}