{"auto_keywords": [{"score": 0.03901483931687473, "phrase": "malicious_peers"}, {"score": 0.004759635663291431, "phrase": "rss_feed"}, {"score": 0.004492406361795448, "phrase": "based_publish_subscribe"}, {"score": 0.004339293854115301, "phrase": "peer_delivery"}, {"score": 0.004071957673937727, "phrase": "content_server"}, {"score": 0.003933118499284644, "phrase": "dissemination_latency"}, {"score": 0.0035442655396704724, "phrase": "normal_peers"}, {"score": 0.003156984631072011, "phrase": "counterfeit_updates"}, {"score": 0.0030141556259370675, "phrase": "peer_mechanism"}, {"score": 0.00282822695516646, "phrase": "false_updates"}, {"score": 0.00273167822885383, "phrase": "independent_randomized_strategies"}, {"score": 0.0025929837295811673, "phrase": "marginal_overhead"}, {"score": 0.0023363141951290526, "phrase": "content_integrity"}, {"score": 0.0022828113789751694, "phrase": "web-based_publish-subscribe_applications"}], "paper_keywords": ["RSS", " Peer-to-Peer", " Content integrity", " Randomized sampling"], "paper_abstract": "RSS (really simple syndication) based feeds have become the defacto mechanism of web based publish subscribe. Peer-to-Peer delivery of such feeds can not only alleviate the load at the content server, but also reduce the dissemination latency. However, due to openness of P2P system, malicious peers can join the network as easily as normal peers do. Such malicious peers may pretend to relay but actually not, and thus deny service, or even disseminate counterfeit updates, rendering a Peer-to-Peer mechanism not only useless, but even harmful (e.g. by false updates). We propose overlay independent randomized strategies to mitigate these ill-effects of malicious peers at a marginal overhead, thus enjoying the benefits of Peer-to-Peer dissemination, along with the assurance of content integrity in RSS like web-based publish-subscribe applications without altering currently deployed server infrastructure. We conduct analysis of performance of our proposal by modeling behavior of the system and validating the same with simulation. Results show that our proposal is effective, robust and scalable.", "paper_title": "Attack resilient P2P dissemination of RSS feed", "paper_id": "WOS:000290276500008"}