{"auto_keywords": [{"score": 0.03857336425646007, "phrase": "product_platform"}, {"score": 0.010612387000973441, "phrase": "scale-based_product_platform_planning"}, {"score": 0.004068247867510688, "phrase": "ga"}, {"score": 0.003916098498242888, "phrase": "customer_requirements"}, {"score": 0.0037903327482565097, "phrase": "platform_planning"}, {"score": 0.003531474887552889, "phrase": "new_ga-based_method"}, {"score": 0.003362660648932244, "phrase": "proper_balance"}, {"score": 0.0031845067058084583, "phrase": "product_family"}, {"score": 0.0028249975318149468, "phrase": "diverse_customer_needs"}, {"score": 0.0027341763737751467, "phrase": "variable_product_attributes"}, {"score": 0.0024519545383399773, "phrase": "product_platform_planning"}, {"score": 0.002386062690026682, "phrase": "case_study"}, {"score": 0.002347378595930709, "phrase": "small-size_induction_motor_design"}, {"score": 0.0021049977753042253, "phrase": "optimal_performance"}], "paper_keywords": [""], "paper_abstract": "Product platform planning paves the way for DFMC (Design for Mass Customization). In this paper, we mainly focus on the development of a method for scale-based product platform planning using genetic algorithm (GA) to satisfy a set of customer requirements. Different from many usual methods for platform planning that need users to specify product platform prior to optimize it, the new GA-based method proposed by this paper focuses on searching a proper balance between the commonality of product platform and the performance of product family derived from the platform. The method improves as more commonality of the product platform as possible, within the satisfactory of the diverse customer needs, and then determines the variable product attributes and their variation ranges, and the common parameters of product platform and their optimal values. This method of product platform planning is validated by a case study of the small-size induction motor design. At last we compare the results from our GA-based method with the benchmark products that are individually designed to the optimal performance.", "paper_title": "A genetic algorithm for scale-based product platform planning", "paper_id": "WOS:000241891600092"}