{"auto_keywords": [{"score": 0.048140506081445586, "phrase": "interactive_information_complexity"}, {"score": 0.03947447987613364, "phrase": "information_complexity"}, {"score": 0.01419479635223656, "phrase": "alice"}, {"score": 0.013906310745107262, "phrase": "bob"}, {"score": 0.01190007195138197, "phrase": "prior_distribution"}, {"score": 0.00481495049065317, "phrase": "primary_goal"}, {"score": 0.004201202199968683, "phrase": "y._informally"}, {"score": 0.004031082737449308, "phrase": "least_amount"}, {"score": 0.003590383760209319, "phrase": "input_pairs"}, {"score": 0.0031582637043009562, "phrase": "basic_properties"}, {"score": 0.0028360962841331634, "phrase": "direct_sum_theorem"}, {"score": 0.002755104031926742, "phrase": "first_general_connection"}, {"score": 0.0026875205754965537, "phrase": "communication_complexity"}, {"score": 0.0026107601878587816, "phrase": "nontrivial_exchange"}, {"score": 0.002504880563070155, "phrase": "nontrivial_communication_complexity"}, {"score": 0.0021669202726173928, "phrase": "constant_error_probability"}, {"score": 0.0021049977753042253, "phrase": "linear_amount"}], "paper_keywords": ["information complexity", " information theory", " communication complexity"], "paper_abstract": "The primary goal of this paper is to define and study the interactive information complexity of functions. Let f(x, y) be a function, and suppose Alice is given x and Bob is given y. Informally, the interactive information complexity IC(f) of f is the least amount of information Alice and Bob need to reveal to each other to compute f. Previously, information complexity has been defined with respect to a prior distribution on the input pairs (x, y). Our first goal is to give a definition that is independent of the prior distribution. We show that several possible definitions are essentially equivalent. We establish some basic properties of the interactive information complexity IC(f). In particular, we show that IC(f) is equal to the amortized (randomized) communication complexity of f. We also show a direct sum theorem for IC(f) and give the first general connection between information complexity and (nonamortized) communication complexity. This connection implies that a nontrivial exchange of information is required when solving problems that have nontrivial communication complexity. We explore the information complexity of two specific problems: Equality and Disjointness. We show that only a constant amount of information needs to be exchanged when solving equality with no errors, while solving disjointness with a constant error probability requires the parties to reveal a linear amount of information to each other.", "paper_title": "INTERACTIVE INFORMATION COMPLEXITY", "paper_id": "WOS:000367020300006"}