{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_communities"}, {"score": 0.008590624240307038, "phrase": "yahoo"}, {"score": 0.008541792526080054, "phrase": "kimo_knowledge"}, {"score": 0.007016822714572535, "phrase": "virtual_community"}, {"score": 0.004938654612990989, "phrase": "different_levels"}, {"score": 0.004639287230742552, "phrase": "purpose_-_the_purpose"}, {"score": 0.004495691933332194, "phrase": "google"}, {"score": 0.004270074571192451, "phrase": "different_rewarding_mechanisms"}, {"score": 0.004233591368742499, "phrase": "different_outcomes"}, {"score": 0.004125993684094709, "phrase": "reasoned_action"}, {"score": 0.0036171490978544607, "phrase": "higher_levels"}, {"score": 0.003535267442543166, "phrase": "virtual_rewards"}, {"score": 0.003495021897720986, "phrase": "advanced_ranks"}, {"score": 0.003377004149966635, "phrase": "knowledge_providers"}, {"score": 0.0033194932199928267, "phrase": "important_factor"}, {"score": 0.003099048380523229, "phrase": "google_answers"}, {"score": 0.002843905418937706, "phrase": "others'_questions"}, {"score": 0.0027794789059440023, "phrase": "different_factors"}, {"score": 0.0026022472788688462, "phrase": "users'_knowledge"}, {"score": 0.002528749345006017, "phrase": "incentive_mechanism_design"}, {"score": 0.002471444757523519, "phrase": "research_models"}, {"score": 0.0024223669182785157, "phrase": "users'_intention"}, {"score": 0.002254892677810906, "phrase": "different_user_groups"}, {"score": 0.002229190333606617, "phrase": "knowledge_contribution"}, {"score": 0.0022101055924375725, "phrase": "research_design"}, {"score": 0.0021786592967334506, "phrase": "prior_literatures"}, {"score": 0.002117099797181169, "phrase": "incentive_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "knowledge_sharing"}], "paper_keywords": ["Knowledge sharing", " Virtual community", " Theory of reasoned action", " Virtual worlds", " Knowledge management"], "paper_abstract": "Purpose - The purpose of this paper is to answer the question: why Google Answers and Yahoo! Kimo Knowledge +, both virtual communities built on users asking and answering questions with different rewarding mechanisms, have different outcomes. Design/methodology/approach - Based on the theory of reasoned action (TRA), the authors developed the constructs, including self-efficacy, altruism, reward, and the sense of virtual community, that influence the intention of sharing knowledge in terms of answering questions on Knowledge +. Findings - The results show that users. showing higher levels of contribution tended to be motivated by virtual rewards, such as advanced ranks, and the need for self-fulfillment. Additionally, for these knowledge providers, altruism is also an important factor. Therefore, these users share not because of a reward but because of altruism and fulfillment. The findings can answer why Google Answers failed with its monetary rewards but Knowledge + remains with its virtual rewarding mechanism. Research limitations/implications - This study extends the literature on understanding the antecedents of sharing knowledge in terms of answering others' questions in virtual communities. Especially, it identifies different factors affecting the intention of users in different levels of engagement with the community to share knowledge. Practical implications - The various effective factors influencing users' knowledge sharing behavior identified in this study can guide the incentive mechanism design for virtual communities. Originality/value - Besides proposing research models to identify the constructs affecting the users' intention to answer questions in a virtual community, such as Knowledge +, this study compares the models explaining the intention to share knowledge in different user groups with different levels of knowledge contribution. This research design is unique from the prior literatures; Moreover, the results shed light on designing incentive mechanisms for knowledge sharing in virtual communities.", "paper_title": "Why people share knowledge in virtual communities? The use of Yahoo! Kimo Knowledge plus as an example", "paper_id": "WOS:000318127500002"}