{"auto_keywords": [{"score": 0.04755730354600057, "phrase": "prescribing_errors"}, {"score": 0.015719716506582538, "phrase": "community-based_providers"}, {"score": 0.011224625542490065, "phrase": "illegibility_errors"}, {"score": 0.010886082428232332, "phrase": "ci"}, {"score": 0.004722898398399427, "phrase": "objective_little"}, {"score": 0.004509057381424944, "phrase": "ambulatory_setting"}, {"score": 0.004109865377936045, "phrase": "non-randomized_cross-sectional_study"}, {"score": 0.0040002088320302935, "phrase": "new_york"}, {"score": 0.003938863745787525, "phrase": "massachusetts"}, {"score": 0.0038485929962942776, "phrase": "paper_prescriptions"}, {"score": 0.0037314328720368453, "phrase": "standardized_methodology"}, {"score": 0.003674192201248236, "phrase": "medical_records"}, {"score": 0.0034672240102960644, "phrase": "overall_prescribing_error_rate"}, {"score": 0.0028138046006772593, "phrase": "inappropriate_abbreviation"}, {"score": 0.002792119634261638, "phrase": "direction_errors"}, {"score": 0.0026043035241045394, "phrase": "vast_majority"}, {"score": 0.0024574537875026634, "phrase": "clinical_decision_support"}, {"score": 0.0024385083712241988, "phrase": "discussion_prescribing_errors"}, {"score": 0.002373339527491525, "phrase": "community-based_primary_care_providers"}, {"score": 0.00230098581403254, "phrase": "academic-affiliated_providers"}, {"score": 0.002265638487492082, "phrase": "nearly_threefold_lower_error_rates"}, {"score": 0.0021049977753042253, "phrase": "ambulatory_medication_safety"}], "paper_keywords": [""], "paper_abstract": "Objective Little is known about the frequency and types of prescribing errors in the ambulatory setting among community-based, primary care providers. Therefore, the rates and types of prescribing errors were assessed among community-based, primary care providers in two states. Material and Methods A non-randomized cross-sectional study was conducted of 48 providers in New York and 30 providers in Massachusetts, all of whom used paper prescriptions, from September 2005 to November 2006. Using standardized methodology, prescriptions and medical records were reviewed to identify errors. Results 9385 prescriptions were analyzed from 5955 patients. The overall prescribing error rate, excluding illegibility errors, was 36.7 per 100 prescriptions (95% CI 30.7 to 44.0) and did not vary significantly between providers from each state (p=0.39). One or more non-illegibility errors were found in 28% of prescriptions. Rates of illegibility errors were very high (175.0 per 100 prescriptions, 95% CI 169.1 to 181.3). Inappropriate abbreviation and direction errors also occurred frequently (13.4 and 4.2 errors per 100 prescriptions, respectively). Reviewers determined that the vast majority of errors could have been eliminated through the use of e-prescribing with clinical decision support. Discussion Prescribing errors appear to occur at very high rates among community-based primary care providers, especially when compared with studies of academic-affiliated providers that have found nearly threefold lower error rates. Illegibility errors are particularly problematical. Conclusions Further characterizing prescribing errors of community-based providers may inform strategies to improve ambulatory medication safety, especially e-prescribing.", "paper_title": "Ambulatory prescribing errors among community-based providers in two states", "paper_id": "WOS:000306024100026"}