{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "user_interaction"}, {"score": 0.004299621153829837, "phrase": "fine-grained_browsing_data"}, {"score": 0.004156012879026324, "phrase": "user_interactions"}, {"score": 0.004109212945115815, "phrase": "mouse_cursor_tracks"}, {"score": 0.0037959868107895053, "phrase": "traditional_online_video_inspection"}, {"score": 0.003689982350051231, "phrase": "full_capabilities"}, {"score": 0.0036073064072936626, "phrase": "interactive_techniques"}, {"score": 0.0032026066791743866, "phrase": "browsing_behavior"}, {"score": 0.0031665087019813244, "phrase": "feature-rich_hypervideo_visualizations"}, {"score": 0.0029083942467546305, "phrase": "unprecedented_visualization_capabilities"}, {"score": 0.0025097154697345096, "phrase": "prediction_experiments"}, {"score": 0.0024673738215365104, "phrase": "raw_cursor_data"}, {"score": 0.002190280748985751, "phrase": "research_hypotheses"}], "paper_keywords": ["Design", " Performance", " Human Factors", " User interaction", " cursor behavior", " hypervideo synthesis", " InfoVis", " interactive analysis", " usability evaluation"], "paper_abstract": "Processing data on any sort of user interaction is well known to be cumbersome and mostly time consuming. In order to assist researchers in easily inspecting fine-grained browsing data, current tools usually display user interactions as mouse cursor tracks, a video-like visualization scheme. However, to date, traditional online video inspection has not explored the full capabilities of hypermedia and interactive techniques. In response to this need, we have developed SMT2 epsilon, a Web-based tracking system for analyzing browsing behavior using feature-rich hypervideo visualizations. We compare our system to related work in academia and the industry, showing that ours features unprecedented visualization capabilities. We also show that SMT2 epsilon efficiently captures browsing data and is perceived by users to be both helpful and usable. A series of prediction experiments illustrate that raw cursor data are accessible and can be easily handled, providing evidence that the data can be used to construct and verify research hypotheses. Considering its limitations, it is our hope that SMT2 epsilon will assist researchers, usability practitioners, and other professionals interested in understanding how users browse the Web.", "paper_title": "Web Browsing Behavior Analysis and Interactive Hypervideo", "paper_id": "WOS:000327263000003"}