{"auto_keywords": [{"score": 0.04968510255692421, "phrase": "human_serum_paraoxonase"}, {"score": 0.03600975852354009, "phrase": "molecular_dynamics"}, {"score": 0.00481495049065317, "phrase": "vx_nerve_agent"}, {"score": 0.00443308765153716, "phrase": "previous_study"}, {"score": 0.00389994107619882, "phrase": "enhanced_vx-hydrolase_activity"}, {"score": 0.003473529187092258, "phrase": "bound_conformation"}, {"score": 0.0033883824438527316, "phrase": "solvated_interaction_energy_calculations"}, {"score": 0.0033053159828082095, "phrase": "vx's_lone_oxygen_atom"}, {"score": 0.0031977096047057898, "phrase": "direct_electrostatic_interaction"}, {"score": 0.003030247482854539, "phrase": "close_proximity"}, {"score": 0.0030052776870775535, "phrase": "vx"}, {"score": 0.0029437270961011077, "phrase": "future_mutagenesis_studies"}, {"score": 0.0025678829712650437, "phrase": "predicted_pka"}, {"score": 0.002546708483171714, "phrase": "physiological_ph."}, {"score": 0.002413256359147736, "phrase": "proton_donor"}, {"score": 0.002315367926547472, "phrase": "binding_simulations"}, {"score": 0.002203117204010397, "phrase": "accurate_binding_predictions"}, {"score": 0.0021490449563443025, "phrase": "closed_conformation"}, {"score": 0.002122507495446441, "phrase": "protein's_binding"}, {"score": 0.0021049977753042253, "phrase": "active_site"}], "paper_keywords": ["Binding", " Homology model", " HuPON1", " Steered molecular dynamics", " Solvated interaction energy", " VX"], "paper_abstract": "Human serum paraoxonase 1 (HuPON1) is an enzyme that can hydrolyze various chemical warfare nerve agents including VX. A previous study has suggested that increasing HuPON1's VX hydrolysis activity one to two orders of magnitude would make the enzyme an effective countermeasure for in vivo use against VX. This study helps facilitate further engineering of HuPON1 for enhanced VX-hydrolase activity by computationally characterizing HuPON1's tertiary structure and how HuPON1 binds VX. HuPON1's structure is first predicted through two homology modeling procedures. Docking is then performed using four separate methods, and the stability of each bound conformation is analyzed through molecular dynamics and solvated interaction energy calculations. The results show that VX's lone oxygen atom has a strong preference for forming a direct electrostatic interaction with HuPON1's active site calcium ion. Various HuPON1 residues are also detected that are in close proximity to VX and are therefore potential targets for future mutagenesis studies. These include E53, H115, N168, F222, N224, L240, D269, I291, F292, and V346. Additionally, D183 was found to have a predicted pKa near physiological pH. Given D183's location in HuPON1's active site, this residue could potentially act as a proton donor or accepter during hydrolysis. The results from the binding simulations also indicate that steered molecular dynamics can potentially be used to obtain accurate binding predictions even when starting with a closed conformation of a protein's binding or active site.", "paper_title": "Computational characterization of how the VX nerve agent binds human serum paraoxonase 1", "paper_id": "WOS:000286482700011"}