{"auto_keywords": [{"score": 0.048851194509091644, "phrase": "relevance_feedback"}, {"score": 0.04248955968880872, "phrase": "search_results"}, {"score": 0.010612387000973441, "phrase": "exploration-exploitation_tradeoff"}, {"score": 0.007087582076290157, "phrase": "overall_utility"}, {"score": 0.006799619415898931, "phrase": "entire_session"}, {"score": 0.004618893461411858, "phrase": "effective_technique"}, {"score": 0.004547438494330851, "phrase": "search_accuracy"}, {"score": 0.004500414250942443, "phrase": "interactive_information_retrieval"}, {"score": 0.004294724955301414, "phrase": "interesting_optimization_problem"}, {"score": 0.004250302819248558, "phrase": "interactive_feedback"}, {"score": 0.003993216345115755, "phrase": "highest_immediate_utility"}, {"score": 0.0037516215763875225, "phrase": "feedback_information"}, {"score": 0.0036174746598098863, "phrase": "best_potential"}, {"score": 0.0035614563596982306, "phrase": "useful_feedback_information"}, {"score": 0.0027886573969044042, "phrase": "relevance_judgments"}, {"score": 0.0022760856906838814, "phrase": "experiment_results"}, {"score": 0.002206045784326466, "phrase": "proposed_learning_approach"}, {"score": 0.0021049977753042253, "phrase": "traditional_relevance_feedback_approach"}], "paper_keywords": ["Interactive retrieval models", " Feedback", " Diversification", " User modeling"], "paper_abstract": "Relevance feedback is an effective technique for improving search accuracy in interactive information retrieval. In this paper, we study an interesting optimization problem in interactive feedback that aims at optimizing the tradeoff between presenting search results with the highest immediate utility to a user (but not necessarily most useful for collecting feedback information) and presenting search results with the best potential for collecting useful feedback information (but not necessarily the most useful documents from a user's perspective). Optimizing such an exploration-exploitation tradeoff is key to the optimization of the overall utility of relevance feedback to a user in the entire session of relevance feedback. We formally frame this tradeoff as a problem of optimizing the diversification of search results since relevance judgments on more diversified results have been shown to be more useful for relevance feedback. We propose a machine learning approach to adaptively optimizing the diversification of search results for each query so as to optimize the overall utility in an entire session. Experiment results on three representative retrieval test collections show that the proposed learning approach can effectively optimize the exploration-exploitation tradeoff and outperforms the traditional relevance feedback approach which only does exploitation without exploration.", "paper_title": "A learning approach to optimizing exploration-exploitation tradeoff in relevance feedback", "paper_id": "WOS:000319273400001"}