{"auto_keywords": [{"score": 0.0445181707495043, "phrase": "hansson"}, {"score": 0.038990164578869176, "phrase": "maximal_probabilities"}, {"score": 0.00481495049065317, "phrase": "probabilistic_systems"}, {"score": 0.004450568197899267, "phrase": "probabilistic_reactive_systems"}, {"score": 0.004299910946753963, "phrase": "strictly_alternating_model"}, {"score": 0.003479692058963528, "phrase": "alternative_characterisations"}, {"score": 0.003378385493203297, "phrase": "different_aspects"}, {"score": 0.003296212583539166, "phrase": "coloured_trace_equivalence"}, {"score": 0.0031845067058084613, "phrase": "probability_theory"}, {"score": 0.0028154895878702633, "phrase": "polynomial_complexity"}, {"score": 0.002680114113899346, "phrase": "better_understanding"}, {"score": 0.002464709648714996, "phrase": "alternating_model"}, {"score": 0.0023928819778638055, "phrase": "non-alternating_model"}, {"score": 0.0023694096965451296, "phrase": "segala"}, {"score": 0.0022890371899188466, "phrase": "latter_setting"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["branching bisimulation", " probabilistic systems", " alternating model", " abstraction"], "paper_abstract": "We address the concept of abstraction in the setting of probabilistic reactive systems, and study its formal underpinnings for the strictly alternating model of Hansson. In particular, we define the notion of branching bismilarity and study its properties by studying two other equivalence relations, viz. coloured trace equivalence and branching bisimilarity using maximal probabilities. We show that both alternatives coincide with branching bisimilarity. The alternative characterisations have their own merits and focus on different aspects of branching bisimilarity. Coloured trace equivalence can be understood without knowledge of probability theory and is independent of the notion of a scheduler. Branching bisimilarity, rephrased in terms of maximal probabilities gives rise to an algorithm of polynomial complexity for deciding the equivalence. Together they give a better understanding of branching bisimilarity. Furthermore, we show that the notions of branching bisimilarity in the alternating model of Hansson and in the non-alternating model of Segala differ: branching bisimilarity in the latter setting turns out to discriminate between systems that are intuitively branching bisimilar. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Branching bisimulation for probabilistic systems: Characteristics and decidability", "paper_id": "WOS:000237717500004"}