{"auto_keywords": [{"score": 0.0297380412153791, "phrase": "singapore"}, {"score": 0.00481495049065317, "phrase": "major_research_topic"}, {"score": 0.00454019648854141, "phrase": "numerous_areas"}, {"score": 0.004281053243493438, "phrase": "already_good_experiences"}, {"score": 0.004007083686875716, "phrase": "related_aspects"}, {"score": 0.0038909934410379775, "phrase": "good_understanding"}, {"score": 0.0037231102027070724, "phrase": "real_needs"}, {"score": 0.0033837135367113004, "phrase": "user_insights"}, {"score": 0.003309877074892399, "phrase": "different_approaches"}, {"score": 0.0031786562062819327, "phrase": "ethnographic_style_studies"}, {"score": 0.0031553611552558986, "phrase": "people's_homes"}, {"score": 0.003030247482854539, "phrase": "user_goals"}, {"score": 0.0028570410572695106, "phrase": "goal-directed_research"}, {"score": 0.0025868521085189843, "phrase": "online_survey"}, {"score": 0.0024569466759289055, "phrase": "general_holistic_overview"}, {"score": 0.0024389277933858054, "phrase": "kitchen_requirements"}, {"score": 0.002368160970983679, "phrase": "correct_problems"}, {"score": 0.0023421547766273015, "phrase": "positive_experiences"}, {"score": 0.0022575078732617678, "phrase": "user_requirements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Personas", " Goal-directed design", " Cooking needs", " User requirements"], "paper_abstract": "Technology to assist people in the kitchen has become a major research topic as technology becomes more ubiquitous in the home. Research is being carried out in numerous areas to assist with cooking, from solving difficulties in the kitchen to more recently enhancing already good experiences related to cooking. To design solutions that are not only usable, but useful in all related aspects of cooking, we must get a good understanding of the needs of the user. It is important that real needs are identified, so that products or systems designed are adopted and are sustainable. There are various methods that researchers and designers use to gain user insights and there is much debate on different approaches and their effectiveness. Whilst there have been a number of ethnographic style studies in people's homes, there has been little in the way of understanding user goals in the kitchen which could lead to more effective design solutions. In this paper, we present goal-directed research of cooking needs in Singapore. We produce three primary design personas and three secondary personas, describing their goals and needs and where they can be helped through technology. An online survey was carried out to validate our personas, comparing our qualitative and quantitative findings. We provide a general holistic overview of kitchen requirements for these personas, whether in helping correct problems or enhancing positive experiences and how these needs can be connected. The user requirements provided can help guide researchers and help designers produce more meaningful, complete and acceptable technology solutions in the kitchen. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Cooking personas: Goal-directed design requirements in the kitchen", "paper_id": "WOS:000328710100009"}