{"auto_keywords": [{"score": 0.04762987004578423, "phrase": "ascii"}, {"score": 0.00481495049065317, "phrase": "end-to-end_method"}, {"score": 0.004608997772926119, "phrase": "input_format"}, {"score": 0.004223032986655664, "phrase": "layout_information"}, {"score": 0.0038692638652494697, "phrase": "analyse_table-related_research"}, {"score": 0.003769006950727621, "phrase": "different_authors"}, {"score": 0.003703611021999795, "phrase": "paths_research"}, {"score": 0.003468287913322255, "phrase": "current_approaches"}, {"score": 0.003423042581201533, "phrase": "table_processing_algorithms"}, {"score": 0.00308163068747474, "phrase": "different_steps"}, {"score": 0.0029886047149545025, "phrase": "usual_order"}, {"score": 0.0028108690791085536, "phrase": "previously_unsolved_problems"}, {"score": 0.0027140798043053986, "phrase": "actual_interpretation"}, {"score": 0.0025750928944698673, "phrase": "overall_extraction_process"}, {"score": 0.0023487324083283205, "phrase": "context-specific_knowledge"}, {"score": 0.0021516366862117707, "phrase": "overall_method"}, {"score": 0.0021049977753042253, "phrase": "different_contexts"}], "paper_keywords": ["information extraction", " table recognition and understanding", " unstructured document conversion"], "paper_abstract": "This paper plans an end-to-end method for extracting information from tables embedded in documents; input format is ASCII, to which any richer fort-nat can be converted, preserving all textual and much of the layout information. We start by defining table. Then we describe the steps involved in extracting information from tables and analyse table-related research to place the contribution of different authors, find the paths research is following, and identify issues that are still unsolved. We then analyse current approaches to evaluating table processing algorithms and propose two new metrics for the task of segmenting cells/columns/rows. We proceed to design our own end-to-end method, where there is a higher interaction between different steps; we indicate how back loops in the usual order of the steps can reduce the possibility of errors and contribute to solving previously unsolved problems. Finally, we explore how the actual interpretation of the table not only allows inferring the accuracy of the overall extraction process but also contributes to actually improving its quality. In order to do so, we believe interpretation has to consider context-specific knowledge; we explore how the addition of this knowledge can be made in a plug-in/out manner, such that the overall method will maintain its operability in different contexts.", "paper_title": "Design of an end-to-end method to extract information from tables", "paper_id": "WOS:000247734500007"}