{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "older_adults"}, {"score": 0.010340002646532915, "phrase": "ict"}, {"score": 0.006214487883351285, "phrase": "selwyn_et_al"}, {"score": 0.006043311870169859, "phrase": "morris"}, {"score": 0.006020821786889981, "phrase": "venkatesh"}, {"score": 0.005887731955823475, "phrase": "tpb"}, {"score": 0.005373963799118521, "phrase": "modern_technologies"}, {"score": 0.0046300145350495125, "phrase": "healthcare_costs"}, {"score": 0.0045275291689837165, "phrase": "health-related_information_and_communication_technologies"}, {"score": 0.004289084090591395, "phrase": "prior_research_shows"}, {"score": 0.004209795182958811, "phrase": "ict_adoption"}, {"score": 0.004139683946222668, "phrase": "temporary_phenomenon"}, {"score": 0.003921584505453528, "phrase": "health-related_ict._method"}, {"score": 0.0038204557811949997, "phrase": "uk"}, {"score": 0.003777877561727097, "phrase": "survey_instrument"}, {"score": 0.0036735511622045715, "phrase": "planned_behavior"}, {"score": 0.003619089231666356, "phrase": "computer_use"}, {"score": 0.0036055999209376665, "phrase": "older_employees"}, {"score": 0.0035587806367598546, "phrase": "face-to-face_interviews"}, {"score": 0.003499490045157396, "phrase": "israel"}, {"score": 0.003486430642834394, "phrase": "spss"}, {"score": 0.003447583409461635, "phrase": "data_analysis"}, {"score": 0.0032354702639291453, "phrase": "ict_use"}, {"score": 0.0030363676525466876, "phrase": "healthier_older_people"}, {"score": 0.0027759052418096343, "phrase": "americans"}, {"score": 0.002765549485699295, "phrase": "israelis"}, {"score": 0.0027500887805468922, "phrase": "main_reason"}, {"score": 0.00270422192903727, "phrase": "'no_need"}, {"score": 0.0025424755217409822, "phrase": "previous_study"}, {"score": 0.00249073380270072, "phrase": "older_users"}, {"score": 0.0024537644463387023, "phrase": "perceived_usefulness"}, {"score": 0.0024083240905215814, "phrase": "pbc"}, {"score": 0.0022684708006269266, "phrase": "health-related_ict._health-related_ict"}, {"score": 0.0022264518498921223, "phrase": "substantial_benefits"}, {"score": 0.0022139982596603943, "phrase": "special_attention"}, {"score": 0.00217298610786873, "phrase": "specific_personal_and_cultural_characteristics"}, {"score": 0.002156794298405759, "phrase": "mandatory_conditions"}, {"score": 0.0021287477909672165, "phrase": "older_consumers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Older adults", " Technology and ICT use", " Healthcare ICT"], "paper_abstract": "Background: The proportion of older adults in the population is steadily increasing, causing healthcare costs to rise dramatically. This situation calls for the implementation of health-related information and communication technologies (ICT) to assist in providing more cost-effective healthcare to the elderly. In order for such a measure to succeed, older adults must be prepared to adopt these technologies. Prior research shows, however, that this population lags behind in ICT adoption, although some believe that this is a temporary phenomenon that will soon change. Objectives: To assess use by older adults of technology in general and ICT in particular, in order to evaluate their readiness to adopt health-related ICT. Method: We employed the questionnaire used by Selwyn et al. in 2000 in the UK, as well as a survey instrument used by Morris and Venkatesh, to examine the validity of the theory of planned behavior (TPB) in the context of computer use by older employees. 123 respondents answered the questions via face-to-face interviews, 63 from the US and 60 from Israel. SPSS 17.0 was used for the data analysis. Results: The results show that although there has been some increase in adoption of modern technologies, including ICT, most of the barriers found by Selwyn et al. are still valid. ICT use was determined by accessibility of computers and support and by age, marital status, education, and health. Health, however, was found to moderate the effect of age, healthier older people being far more likely to use computers than their unhealthy coevals. The TPB was only partially supported, since only perceived behavioral control (PBC) emerged as significantly affecting intention to use a computer, while age, contrary to the findings of Morris and Venkatesh, interacted differently for Americans and Israelis. The main reason for non-use was 'no interest' or 'no need', similar to findings from data collected in 2000. Conclusions: Adoption of technology by older adults is still limited, though it has increased as compared with results of the previous study. Modern technologies have been adopted (albeit selectively) by older users, who were presumably strongly motivated by perceived usefulness. Particularly worrying are the effects of health, PBC, and the fact that many older adults do not share the perception that ICT can significantly improve their quality of life. We therefore maintain that older adults are not yet ready to adopt health-related ICT. Health-related ICT for the elderly should be kept simple and demonstrate substantial benefits, and special attention should be paid to training and support and to specific personal and cultural characteristics. These are mandatory conditions for adoption by potential unhealthy and older consumers. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Older adults: Are they ready to adopt health-related ICT?", "paper_id": "WOS:000326372800001"}