{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "computational_biology"}, {"score": 0.03895000187878607, "phrase": "mammalian_group"}, {"score": 0.004741395005218184, "phrase": "phylogenetic_analysis"}, {"score": 0.004504193207111593, "phrase": "insulin_phylogenetics"}, {"score": 0.0043452175611323335, "phrase": "sequence_alignment"}, {"score": 0.004300830853119242, "phrase": "sequence_logos"}, {"score": 0.0035932440062595252, "phrase": "path_lengths"}, {"score": 0.0035201528214608914, "phrase": "distance_analysis"}, {"score": 0.002309242063033298, "phrase": "rapid_method"}, {"score": 0.002262209824105154, "phrase": "amino_acid_sequences"}, {"score": 0.0022161333611134806, "phrase": "evolutionary_conservation_rates"}, {"score": 0.0021709933368474223, "phrase": "molecular_phylogenetics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Bioinformatics", " Insulin", " Amino acid residues", " Phylogenetic relationships"], "paper_abstract": "Using computational biology, we have depicted the insulin phylogenetics. We have also analyzed the sequence alignment and sequence logos formation for both the insulin chain A and B for three groups namely, the mammalian group, vertebrates group and fish group. We have also analyzed cladograms of insulin for the mammalian group. In accordance with that path lengths, matrix for distance analysis, matching representation of nodes of the cladogram and dissimilarity between two nodes have been performed for both of the A and B chains of the mammalian group. Our results show that 12 amino acid residues (GlyA1, IleA2, ValA3, TyrA19, CysA20, AsnA21, LeuB6, GlyB8, LeuB11, ValB12, GlyB23 and PheB24) are highly conserved for all groups and among them some (GlyA1, IleA2, ValA3);(TyrA19, CysA20, AsnA21) are continuous. This study shows a rapid method to calculate the amino acid sequences in terms of evolutionary conservation rates as well as molecular phylogenetics. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Can computational biology improve the phylogenetic analysis of insulin?", "paper_id": "WOS:000310828200035"}