{"auto_keywords": [{"score": 0.035431234390884234, "phrase": "logical_rings"}, {"score": 0.035138412309081254, "phrase": "logical_trees"}, {"score": 0.00481495049065317, "phrase": "large_scale"}, {"score": 0.004496174406337201, "phrase": "mobile_and_wireless_networks"}, {"score": 0.004127094600862448, "phrase": "enhanced_services"}, {"score": 0.00409188863874203, "phrase": "mobile_collaborations"}, {"score": 0.0037078961288626185, "phrase": "wired_network_environment"}, {"score": 0.00350696416714684, "phrase": "ringnet_hierarchy"}, {"score": 0.0029416448256236057, "phrase": "tree-based_hierarchy"}, {"score": 0.0028181504086563967, "phrase": "fault-tolerant_group_communication_protocol"}, {"score": 0.0027583557819362034, "phrase": "highly_dynamic_groups"}, {"score": 0.0027230880516264685, "phrase": "theoretical_analysis_and_simulation_studies"}, {"score": 0.0024356742694508662, "phrase": "node_failure_probability"}, {"score": 0.0023233800372985686, "phrase": "service_providers"}, {"score": 0.0023035249767734286, "phrase": "network_operators"}, {"score": 0.002235356010935877, "phrase": "hierarchical_setting"}], "paper_keywords": ["group communication", " membership", " multicast", " fault tolerance", " the RingNet hierarchy"], "paper_abstract": "In recent years, the integration of mobile and wireless networks with wired ones has gained in popularity. Many new applications have been brought up and there is increasing demand for enhanced services supporting mobile collaborations. However, many challenging issues, such as scalability and reliability, are very difficult to tackle in such an integrated network environment rather than in the wired network environment. In this paper, we address these issues by proposing a RingNet hierarchy of proxies. This hierarchy is a combination of logical rings and logical trees. Therefore, it takes advantages of the simplicity of logical rings and the scalability of logical trees. More importantly, such a combination makes this hierarchy more reliable than the tree-based hierarchy. Based on this hierarchy, we propose a fault-tolerant group communication protocol in large scale and highly dynamic groups. Both theoretical analysis and simulation studies show that this protocol scales very well when the size of the network becomes large and that it is highly resilient to failures when the node failure probability becomes large. This protocol is especially suitable for those service providers and network operators who have deployed their machines in a hierarchical setting, where each machine can be locally configured to know the information about its sibling and parent machines.", "paper_title": "A fault-tolerant group communication protocol in large scale and highly dynamic mobile next-generation networks", "paper_id": "WOS:000242167300007"}