{"auto_keywords": [{"score": 0.04256558582750429, "phrase": "visual_words"}, {"score": 0.010612387000973441, "phrase": "visual_tag_dictionary"}, {"score": 0.010440608297385905, "phrase": "community-contributed_media_corpus"}, {"score": 0.004685012337701536, "phrase": "visual-word_based_image_representation"}, {"score": 0.004533685795068016, "phrase": "wide_variety"}, {"score": 0.003682100144121148, "phrase": "bag-of-words_representation"}, {"score": 0.003246173672295418, "phrase": "conventional_dictionaries"}, {"score": 0.0031584367879334114, "phrase": "textual_words"}, {"score": 0.0028932554846476718, "phrase": "fully_automatic_way"}, {"score": 0.0028460640294160383, "phrase": "community-contributed_images"}, {"score": 0.002361992359512022, "phrase": "tag-based_image_search"}, {"score": 0.00221153232497724, "phrase": "empirical_results"}], "paper_keywords": ["Flickr", " Tag", " Image search", " Image annotation"], "paper_abstract": "Visual-word based image representation has shown effectiveness in a wide variety of applications such as categorization, annotation and search. By detecting keypoints in images and treating their patterns as visual words, an image can be represented as a bag of visual words, which is analogous to the bag-of-words representation of text documents. In this paper, we construct a corpus named visual tag dictionary by mining community-contributed media corpus. Unlike the conventional dictionaries that define terms with textual words, the visual tag dictionary interprets each tag with visual words. The dictionary is constructed in a fully automatic way by exploring community-contributed images and their associated tags. With this dictionary, tags and images are connected via visual words and many applications can be thus facilitated. As examples, we empirically demonstrate the effectiveness of the dictionary in tag-based image search, tag ranking, image annotation and tag graph construction. Empirical results demonstrate the effectiveness of the dictionary. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Constructing visual tag dictionary by mining community-contributed media corpus", "paper_id": "WOS:000307152800002"}