{"auto_keywords": [{"score": 0.004339979174946844, "phrase": "visual_information"}, {"score": 0.0033393377529146893, "phrase": "intrinsic_and_stable_property"}, {"score": 0.003220709449062307, "phrase": "different_viewers"}, {"score": 0.0028505007899807446, "phrase": "single_view"}, {"score": 0.0027616550517346066, "phrase": "image_features"}, {"score": 0.0025113494092413604, "phrase": "global_image_descriptors"}, {"score": 0.0024440836179156593, "phrase": "image_memorability"}, {"score": 0.0023465400668244386, "phrase": "current_computer_vision_techniques"}, {"score": 0.0023044434462692483, "phrase": "memorable_images"}, {"score": 0.0022733662000757318, "phrase": "challenging_task"}, {"score": 0.0021434588322608653, "phrase": "first_attempt"}, {"score": 0.0021049977753042253, "phrase": "useful_property"}], "paper_keywords": ["Scene understanding", " image memorability", " global image features", " attributes"], "paper_abstract": "When glancing at a magazine, or browsing the Internet, we are continuously exposed to photographs. Despite this overflow of visual information, humans are extremely good at remembering thousands of pictures along with some of their visual details. But not all images are equal in memory. Some stick in our minds while others are quickly forgotten. In this paper, we focus on the problem of predicting how memorable an image will be. We show that memorability is an intrinsic and stable property of an image that is shared across different viewers, and remains stable across delays. We introduce a database for which we have measured the probability that each picture will be recognized after a single view. We analyze a collection of image features, labels, and attributes that contribute to making an image memorable, and we train a predictor based on global image descriptors. We find that predicting image memorability is a task that can be addressed with current computer vision techniques. While making memorable images is a challenging task in visualization, photography, and education, this work is a first attempt to quantify this useful property of images.", "paper_title": "What Makes a Photograph Memorable?", "paper_id": "WOS:000338209900013"}