{"auto_keywords": [{"score": 0.041361508715379594, "phrase": "recommender_systems"}, {"score": 0.04087780348021563, "phrase": "u-i_matrix"}, {"score": 0.00481495049065317, "phrase": "user-item_matrix"}, {"score": 0.004585433265422727, "phrase": "large_amount"}, {"score": 0.004548253531664032, "phrase": "research_effort"}, {"score": 0.004331393784852601, "phrase": "resulting_research_progress"}, {"score": 0.004108066884382925, "phrase": "individual_preferences"}, {"score": 0.0036652492107503956, "phrase": "new_recommendation_scenarios"}, {"score": 0.0035767311154996464, "phrase": "new_information"}, {"score": 0.0032040376301815544, "phrase": "interaction_information"}, {"score": 0.0029773436815290215, "phrase": "recommendation_scenarios"}, {"score": 0.0029531640201737384, "phrase": "information_sources"}, {"score": 0.0029172611440429963, "phrase": "cf_algorithms"}, {"score": 0.0027666443986705453, "phrase": "comprehensive_introduction"}, {"score": 0.0027330029055210926, "phrase": "large_body"}, {"score": 0.0023310544011985253, "phrase": "central_challenges"}, {"score": 0.0022933216359142736, "phrase": "recommender_system_technology"}, {"score": 0.0022196745041124888, "phrase": "existing_techniques"}], "paper_keywords": ["Algorithms", " Design", " Performance", " applications", " challenges", " collaborative filtering", " recommender systems", " social networks", " survey"], "paper_abstract": "Over the past two decades, a large amount of research effort has been devoted to developing algorithms that generate recommendations. The resulting research progress has established the importance of the user-item (U-I) matrix, which encodes the individual preferences of users for items in a collection, for recommender systems. The U-I matrix provides the basis for collaborative filtering (CF) techniques, the dominant framework for recommender systems. Currently, new recommendation scenarios are emerging that offer promising new information that goes beyond the U-I matrix. This information can be divided into two categories related to its source: rich side information concerning users and items, and interaction information associated with the interplay of users and items. In this survey, we summarize and analyze recommendation scenarios involving information sources and the CF algorithms that have been recently developed to address them. We provide a comprehensive introduction to a large body of research, more than 200 key references, with the aim of supporting the further development of recommender systems exploiting information beyond the U-I matrix. On the basis of this material, we identify and discuss what we see as the central challenges lying ahead for recommender system technology, both in terms of extensions of existing techniques as well as of the integration of techniques and technologies drawn from other research areas.", "paper_title": "Collaborative Filtering beyond the User-Item Matrix: A Survey of the State of the Art and Future Challenges", "paper_id": "WOS:000340820600003"}