{"auto_keywords": [{"score": 0.03639249050492223, "phrase": "time-course_data"}, {"score": 0.034124196593740774, "phrase": "conventional_clustering_methods"}, {"score": 0.007553342509366238, "phrase": "mmbc"}, {"score": 0.00481495049065317, "phrase": "high_dimensional_time-course_data"}, {"score": 0.003858697684681798, "phrase": "temporal_gene_expression_profiles"}, {"score": 0.0037188360359702182, "phrase": "dynamic_functional_properties"}, {"score": 0.0032800186243040663, "phrase": "functional_classes"}, {"score": 0.003161065111494053, "phrase": "sampling_data"}, {"score": 0.003091767402370757, "phrase": "time_point"}, {"score": 0.0029796206196589115, "phrase": "different_experimental_conditions"}, {"score": 0.0028085616610192456, "phrase": "time_periods_t"}, {"score": 0.0023519508354777215, "phrase": "proposed_method"}, {"score": 0.0022168460543913787, "phrase": "artificial_data"}, {"score": 0.0021363670305843403, "phrase": "saccharomyces_cerevisiae"}], "paper_keywords": [""], "paper_abstract": "Motivation. Classifying genes into clusters depending on their expression profiles is one of the most important analysis techniques for microarray data. Because temporal gene expression profiles are indicative of the dynamic functional properties of genes, the application of clustering analysis to time-course data allows the more precise division of genes into functional classes. Conventional clustering methods treat the sampling data at each time point as data obtained under different experimental conditions without considering the continuity of time-course data between time periods t and t +1. Here, we propose a method designated mathematical model-based clustering (MMBC). Results: The proposed method, designated MMBC, was applied to artificial data and time-course data obtained using Saccharomyces cerevisiae. Our method is able to divide data into clusters more accurately and coherently than conventional clustering methods. Furthermore, MMBC is more tolerant to noise than conventional clustering methods.", "paper_title": "Novel technique for preprocessing high dimensional time-course data from DNA microarray: mathematical model-based clustering", "paper_id": "WOS:000236251500011"}