{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "random_graphs"}, {"score": 0.004735519962945449, "phrase": "firefighter_problem"}, {"score": 0.004657393640152439, "phrase": "deterministic_discrete-time_model"}, {"score": 0.0034134024569847264, "phrase": "communication_networks"}, {"score": 0.0032290277960438855, "phrase": "practical_point"}, {"score": 0.0030208364972341096, "phrase": "good_strategy"}, {"score": 0.0029709144755382787, "phrase": "general_case"}, {"score": 0.002585638506308606, "phrase": "obtained_results"}, {"score": 0.002473203873496859, "phrase": "computational_tools"}, {"score": 0.002418829014435841, "phrase": "graph_topology"}, {"score": 0.0023920904611571783, "phrase": "graph_size"}, {"score": 0.0022129983153880467, "phrase": "best_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Firefighter problem", " Integer linear programming techniques", " Heuristics"], "paper_abstract": "The firefighter problem is a deterministic discrete-time model for the spread and containment of fire on a graph. Once the fire breaks out at a set of vertices, the goal addressed in this work is to save as many vertices as possible from burning. Although the problem finds applications in various real-world problems, such as the spread of diseases or hoaxes contention in communication networks, this problem has not been addressed from a practical point of view so far, in the sense of finding a good strategy for the general case. In this work, we develop and compare several integer linear programming techniques and heuristic methods. Random graphs are used for the purpose of comparison. The obtained results shed some light on the challenges for computational tools as caused by graph topology, graph size, and the number of firefighters per iteration, when looking for the best strategy for an a priori unknown graph. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "The firefighter problem: Empirical results on random graphs", "paper_id": "WOS:000353730600005"}