{"auto_keywords": [{"score": 0.04601284855430019, "phrase": "ss"}, {"score": 0.00481495049065317, "phrase": "inter-block_direct-sequence"}, {"score": 0.004195418010131832, "phrase": "cox_et_al"}, {"score": 0.004073359218158693, "phrase": "nxn_blocks"}, {"score": 0.003858697684681798, "phrase": "watermark_bit"}, {"score": 0.0031845067058084583, "phrase": "new_approach"}, {"score": 0.0029576827451501956, "phrase": "pn_sequence"}, {"score": 0.0026933542552712033, "phrase": "different_embedding_locations"}, {"score": 0.002357755095722877, "phrase": "new_\"inter-block\"_method"}, {"score": 0.002323142666222693, "phrase": "old_\"intra-block\"_method"}, {"score": 0.0021049977753042253, "phrase": "inter-block\"_techniques"}], "paper_keywords": ["Image watermark", " Direct sequence spread spectrum", " Frequency hop spread spectrum"], "paper_abstract": "One of the most popular image watermark embedding methods is the spread spectrum (SS) technique. The original SS technique proposed by Cox et al. divides the image into NxN blocks and the pseudo-noise (PN) sequence generated from each watermark bit is embedded in one of the blocks. Since there is only one watermark bit embedded in each block, we call this method \"intra-block\" method. In this paper, we proposed a new approach called \"inter-block\" method. In our method, vie embedded the PN sequence from one watermark bit into several different blocks as opposed to just one block. In other words, we comprehensively studied the effects of different embedding locations in this paper and to the best of our knowledge, whereas this study has not been done before. To thoroughly study the differences between the new \"inter-block\" method and the old \"intra-block\" method, we subjected both methods to various watermark attacks and compared their performances. From the experiments, we found that \"inter-block\" techniques perform better against all attacks.", "paper_title": "INTER-BLOCK DIRECT-SEQUENCE AND FREQUENCY-HOP SPREAD SPECTRUM IMAGE WATERMARKS", "paper_id": "WOS:000285273700037"}