{"auto_keywords": [{"score": 0.04595629913789722, "phrase": "inner_layers"}, {"score": 0.00481495049065317, "phrase": "new_and_automatic_node_projection_algorithm"}, {"score": 0.004686963264680882, "phrase": "extrusion_geometries"}, {"score": 0.004461051281091779, "phrase": "cap_surfaces"}, {"score": 0.004342430078306461, "phrase": "sweeping_mesh"}, {"score": 0.004208002469225673, "phrase": "least-squares_approximation"}, {"score": 0.0038810583785936505, "phrase": "affine_mapping"}, {"score": 0.003499864176875713, "phrase": "inner_layer"}, {"score": 0.0025892330566358503, "phrase": "pseudo-normal_vector"}, {"score": 0.0025316254589087973, "phrase": "new_projection_algorithm"}, {"score": 0.00247529638625566, "phrase": "functional_vector_parameters"}, {"score": 0.0023557346035701096, "phrase": "implementation_details"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithm"}], "paper_keywords": ["Finite element method", " Mesh generation", " Hexahedral elements", " Sweep", " Node projection", " Affine mapping"], "paper_abstract": "In this paper, we present a new and automatic node projection algorithm to generate hexahedral meshes in extrusion geometries. It is designed to preserve the shape of the cap surfaces in the inner layers of a sweeping mesh. The algorithm is based on least-squares approximation of affine mappings. We report that the functionals that have been traditionally used to compute the affine mapping generate four undesired effects on the inner layers of nodes. Namely, the flattening, skewing, offset scaling, and flipping of the inner layer meshes. To overcome these drawbacks we first analyze several properties of a new functional that depends on two vector parameters. Second, we introduce the concept of the pseudo-area and pseudo-normal vectors defined by a loop of nodes. In addition, we prove several geometrical properties of these vectors. Third, based on the properties of the new functional and on the definition of the pseudo-normal vector, we detail a new projection algorithm that automatically selects the functional vector parameters. The aim of this paper is to provide the implementation details to developers, although we also present the background of the algorithm. Finally, several mesh examples are discussed to assess the properties of the proposed algorithm.", "paper_title": "An automatic and general least-squares projection procedure for sweep meshing", "paper_id": "WOS:000281153100006"}