{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "actuator_outages"}, {"score": 0.0045876189888390895, "phrase": "known_set"}, {"score": 0.004550783060775205, "phrase": "hardware_configurations"}, {"score": 0.004442032546224076, "phrase": "sensor_losses"}, {"score": 0.004232232993872917, "phrase": "reconfiguration_strategy"}, {"score": 0.0037955672944969287, "phrase": "design_objective"}, {"score": 0.003515479934694842, "phrase": "passive_scheme"}, {"score": 0.003335804608791029, "phrase": "n_configurations"}, {"score": 0.003282383509542342, "phrase": "active_scheme_designs"}, {"score": 0.0032559935867182035, "phrase": "control_laws"}, {"score": 0.003003452468800793, "phrase": "general_frame"}, {"score": 0.002759279370360986, "phrase": "classical_passive_and_active_strategies"}, {"score": 0.0026715589067557526, "phrase": "single_set"}, {"score": 0.002607598760956807, "phrase": "n_sets"}, {"score": 0.0025866199378466754, "phrase": "single_faults"}, {"score": 0.002534906456854208, "phrase": "reliable_control_strategy"}, {"score": 0.002254672021120091, "phrase": "decision_frame"}, {"score": 0.002182959428033441, "phrase": "ftc"}, {"score": 0.0021049977753042253, "phrase": "non-recoverable_situation"}], "paper_keywords": ["fault tolerant control", " reliable control", " system reconfiguration", " linear systems", " feedback control"], "paper_abstract": "In many applications, faults of interest are associated with a known set of hardware configurations. Indeed, actuator outages, sensor losses, and more generally, any kind of fault when the reconfiguration strategy is used, result in only a subset of components being available for achieving the system mission, and therefore the hardware configurations of interest are defined by the power set of the components whose faults are considered. Whatever the design objective (stability, disturbance attenuation, H(infinity) or H(2) optimality, etc.), a passive scheme designs one single control law that guarantees stability and performances for the set of all N configurations, while an active scheme designs N control laws, each of them being dedicated to one configuration. Considering the case of actuator outages, this article introduces a general frame where several controllers are designed, each of them being dedicated to a subset of faults. This frame includes the classical passive and active strategies, which are respectively associated with the single set of all faults and with N sets of single faults, and extends the reliable control strategy where only one subset of faults is considered. This approach is also applicable when all faults are not recoverable. Its performance evaluation and optimisation is carried out by setting a decision frame in which the trade-off between the Fault Tolerant Control (FTC) complexity and the probability to face a non-recoverable situation is explicitly addressed.", "paper_title": "A general fault tolerant linear quadratic control strategy under actuator outages", "paper_id": "WOS:000280248000006"}