{"auto_keywords": [{"score": 0.03186747448054487, "phrase": "severe_disabilities"}, {"score": 0.00481495049065317, "phrase": "attentive_user_interfaces"}, {"score": 0.004621447740470602, "phrase": "rich_information"}, {"score": 0.004461761855323898, "phrase": "users'_gaze_behavior"}, {"score": 0.004332894955218135, "phrase": "relevant_aspects"}, {"score": 0.0041586840496756474, "phrase": "eye_gaze"}, {"score": 0.0041102032028337366, "phrase": "excellent_clue"}, {"score": 0.0034673190692473903, "phrase": "user's_current_information_need"}, {"score": 0.0030833537429977797, "phrase": "particular_benefits"}, {"score": 0.0029075757820516634, "phrase": "physical_device"}, {"score": 0.00284009509859163, "phrase": "mouse_pointer"}, {"score": 0.0024236964502593254, "phrase": "gaze_data"}, {"score": 0.0021049977753042253, "phrase": "user_interfaces"}], "paper_keywords": ["Attentiveinterfaces", " Disabilities", " Eye gaze"], "paper_abstract": "Attentive user interfaces (AUIs) capitalize on the rich information that can be obtained from users' gaze behavior in order to infer relevant aspects of their cognitive state. Not only is eye gaze an excellent clue to states of interest and intention, but also to preference and confidence in comprehension. AUIs are built with the aim of adapting the interface to the user's current information need, and thus reduce workload of interaction. Given those characteristics, it is believed that AUIs can have particular benefits for users with severe disabilities, for whom operating a physical device (like a mouse pointer) might be very strenuous or infeasible. This paper presents three studies that attempt to gauge uncertainty and intention on the part of the user from gaze data, and compare the success of each approach. The paper discusses how the application of the approaches adopted in each study to user interfaces can support users with severe disabilities.", "paper_title": "Attentive interfaces for users with disabilities: eye gaze for intention and uncertainty estimation", "paper_id": "WOS:000207889500008"}