{"auto_keywords": [{"score": 0.04058473010662897, "phrase": "testing_techniques"}, {"score": 0.00481495049065317, "phrase": "techniques_selection"}, {"score": 0.00474946741204285, "phrase": "odc_fault_types"}, {"score": 0.004706305193222972, "phrase": "software_metrics"}, {"score": 0.004663533386096864, "phrase": "software_testing_techniques"}, {"score": 0.0037626342268042997, "phrase": "detected_faults"}, {"score": 0.003310684108128973, "phrase": "testing-related_base"}, {"score": 0.003221111762383486, "phrase": "techniques_selection_process"}, {"score": 0.002926212333939311, "phrase": "empirical_basis"}, {"score": 0.002769950045729965, "phrase": "fault_types"}, {"score": 0.0024147474002390763, "phrase": "created_base"}, {"score": 0.0021834945657804193, "phrase": "testing_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Software testing"], "paper_abstract": "Software testing techniques differ in the type of faults they are more prone to detect, and their performance varies depending on the features of the application being tested. Practitioners often use informally their knowledge about the software under test in order to combine testing techniques for maximizing the number of detected faults. This work presents an approach to enable practitioners to select testing techniques according to the features of the software to test. A method to build a testing-related base of knowledge for tailoring the techniques selection process to the specific application(s) is proposed. The method grounds upon two basic steps: (i) constructing, on an empirical basis, models to characterize the software to test in terms of fault types it is more prone to contain; (ii) characterizing testing techniques with respect to fault types they are more prone to detect in the given context. Using the created base of knowledge, engineers within an organization can define the mix of techniques so as to maximize the effectiveness of the testing process for their specific software. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Testing techniques selection based on ODC fault types and software metrics", "paper_id": "WOS:000318330100011"}