{"auto_keywords": [{"score": 0.04343467329246281, "phrase": "mumda"}, {"score": 0.015719716506582538, "phrase": "dynamic_optimization_problems"}, {"score": 0.0045370785151713396, "phrase": "optimal_solutions"}, {"score": 0.0041995784967999985, "phrase": "multi-population_based_univariate_marginal_distribution_algorithm"}, {"score": 0.003933609372601274, "phrase": "main_idea"}, {"score": 0.0034715658596258018, "phrase": "search_space"}, {"score": 0.0031003255054939524, "phrase": "promising_areas"}, {"score": 0.002921114512115261, "phrase": "new_promising_optimal_solutions"}, {"score": 0.0028185852354729026, "phrase": "univariate_marginal_distribution_algorithm"}, {"score": 0.002785213017521349, "phrase": "umda"}, {"score": 0.0025471636425006155, "phrase": "proposed_algorithm"}, {"score": 0.002472412920623605, "phrase": "experimental_study"}, {"score": 0.0021049977753042253, "phrase": "dynamic_environments"}], "paper_keywords": ["Univariate marginal distribution algorithm (UMDA)", " Dynamic optimization problems", " Multi-population scheme"], "paper_abstract": "Many real-world problems are dynamic optimization problems in which the optimal solutions need to be continuously tracked over time. In this paper a multi-population based univariate marginal distribution algorithm (MUMDA) is proposed to solve dynamic optimization problems. The main idea of the algorithm is to construct several probability models by dividing the population into several parts. The objective is to divide the search space into several regions to maintain the diversity. Concretely, MUMDA uses one probability vector to do the search in the promising areas identified previously, and uses other probability vectors to search for new promising optimal solutions. Moreover the convergence of univariate marginal distribution algorithm (UMDA) is proved, which can be used to analyze the validity of the proposed algorithm. Finally, the experimental study was carried out to compare the performance of several UMDA, and the results show that the MUMDA is effective and can be well adaptive to the dynamic environments rapidly.", "paper_title": "Multi-population Based Univariate Marginal Distribution Algorithm for Dynamic Optimization Problems", "paper_id": "WOS:000280080700002"}