{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "interaction_design_education"}, {"score": 0.046481645015042976, "phrase": "design_process"}, {"score": 0.004785022360244881, "phrase": "design_practitioners'_conceptions"}, {"score": 0.004696344245532423, "phrase": "designed_product"}, {"score": 0.004223869454839947, "phrase": "successful_transfer"}, {"score": 0.003956012816350168, "phrase": "academically_oriented_teachers"}, {"score": 0.0037633479183921677, "phrase": "interaction_designers"}, {"score": 0.0037282779842373486, "phrase": "process_quality"}, {"score": 0.003647709172212356, "phrase": "research_questions"}, {"score": 0.0034269461127992688, "phrase": "interaction_design_projects"}, {"score": 0.0032195006850887363, "phrase": "practicing_interaction_designers"}, {"score": 0.0030817834479425535, "phrase": "established_methods"}, {"score": 0.0029963684169267406, "phrase": "resource_constraints"}, {"score": 0.002959167753690868, "phrase": "organizational_and_technological_limitations"}, {"score": 0.0028061343826918357, "phrase": "thought-through_rationale"}, {"score": 0.0026361695237709874, "phrase": "criteria-referenced_grading_scale"}, {"score": 0.002579140290642792, "phrase": "specific_grading_criteria"}, {"score": 0.00234834406550549, "phrase": "high_and_significant_covariation"}, {"score": 0.0023264294945973623, "phrase": "high_level"}, {"score": 0.002212951892867028, "phrase": "developed_criteria"}, {"score": 0.0021049977753042253, "phrase": "british_informatics_society_limited"}], "paper_keywords": ["Interaction design education", " Human-computer interaction education", " Design education", " Process quality in design", " Assessment", " Grading"], "paper_abstract": "The designed product is often assessed in interaction design education, but there are also courses that focus on learning the design process. It is then necessary to develop criteria for grading in such courses. To make a successful transfer from theory to practice, students also need to learn the criteria practitioners use, rather than the criteria that academically oriented teachers use. To do this, one approach is to align criteria with the conceptions practicing interaction designers have of process quality in design. Therefore, the research questions for this study are what those conceptions are, and how they can be utilized in grading criteria for interaction design projects in education. Interviews were made with 10 interaction designers. The interviews were qualitatively analyzed. The results demonstrate that practicing interaction designers conceptualize the quality of the design process in three ways: it is good if established methods are used and the design is managed within resource constraints, and within organizational and technological limitations, while also meeting stated objectives; it is even better if the design has a thought-through rationale; and ideally, the design should also be inspirational. These conceptions were transferred to points on a criteria-referenced grading scale which was used to develop course specific grading criteria. The criteria were evaluated in terms of comprehensibility and reliability. The evaluation showed that most of the students who also attended lectures understood the criteria. A high and significant covariation and a high level of agreement between the two teachers who graded the projects were shown. Further, the developed criteria should be generalizable to other process-centered interaction design courses and to assessment in other design disciplines. (C) 2012 British Informatics Society Limited. All rights reserved.", "paper_title": "Grading in interaction design education using design practitioners' conceptions of process quality", "paper_id": "WOS:000313135500004"}