{"auto_keywords": [{"score": 0.03157244457765463, "phrase": "n-step_mir_inequalities"}, {"score": 0.015719716506582538, "phrase": "mixed_integer"}, {"score": 0.015220669263409325, "phrase": "infinite_group_polyhedra"}, {"score": 0.014116099150079478, "phrase": "valid_inequalities"}, {"score": 0.004090274535243564, "phrase": "positive_integer"}, {"score": 0.0034180189629740426, "phrase": "n-step_mir_facet"}, {"score": 0.0031845067058084613, "phrase": "feasible_set"}, {"score": 0.002934764205541183, "phrase": "gomory_mixed_integer_cut"}, {"score": 0.002646267286675984, "phrase": "first_two_families"}, {"score": 0.0024386325347607674, "phrase": "periodic_functions"}, {"score": 0.002347378595930709, "phrase": "n-step_mir_functions"}, {"score": 0.0021049977753042253, "phrase": "two-slope_facets"}], "paper_keywords": ["Mixed integer rounding", " Mixed integer programming", " Infinite group polyhedron", " Valid inequality", " Facet"], "paper_abstract": "We present a generalization of the mixed integer rounding (MIR) approach for generating valid inequalities for (mixed) integer programming (MIP) problems. For any positive integer n, we develop n facets for a certain (n + 1)-dimensional single-constraint polyhedron in a sequential manner. We then show that for any n, the last of these facets (which we call the n-step MIR facet) can be used to generate a family of valid inequalities for the feasible set of a general (mixed) IP constraint, which we refer to as the n-step MIR inequalities. The Gomory Mixed Integer Cut and the 2-step MIR inequality of Dash and gunluk (Math Program 105(1):29-53, 2006) are the first two families corresponding to n = 1,2, respectively. The n-step MIR inequalities are easily produced using periodic functions which we refer to as the n-step MIR functions. None of these functions dominates the other on its whole period. Finally, we prove that the n-step MIR inequalities generate two-slope facets for the infinite group polyhedra, and hence are potentially strong.", "paper_title": "Generalized mixed integer rounding inequalities: facets for infinite group polyhedra", "paper_id": "WOS:000266010400002"}