{"auto_keywords": [{"score": 0.04844631776293273, "phrase": "uk"}, {"score": 0.008644138596019877, "phrase": "new_expectations"}, {"score": 0.00481495049065317, "phrase": "personal_medical_records"}, {"score": 0.0042044119437518335, "phrase": "objectives"}, {"score": 0.0038853267759462757, "phrase": "ehr"}, {"score": 0.003693973656103879, "phrase": "patients'_online_access"}, {"score": 0.003545439507880801, "phrase": "survey_questionnaire"}, {"score": 0.0034244174098170947, "phrase": "nhs"}, {"score": 0.0029990127367275966, "phrase": "open_ended_questions"}, {"score": 0.002896586744793007, "phrase": "record_access"}, {"score": 0.0026681430839293574, "phrase": "future_action"}, {"score": 0.0025365874386986493, "phrase": "healthcare_resources"}, {"score": 0.0024889396846235, "phrase": "qualitative_evidence"}, {"score": 0.0024654516678953658, "phrase": "active_ways"}, {"score": 0.002321744299010337, "phrase": "proportionate_health_management_strategies"}, {"score": 0.002292571801358424, "phrase": "personal_ehrs"}, {"score": 0.0021521046447238964, "phrase": "elsevier_ireland_ltd."}, {"score": 0.002125059113175028, "phrase": "open_access_article"}, {"score": 0.0021049977753042253, "phrase": "cc_by_license"}], "paper_keywords": ["Medical records", " Electronic health records", " Patient access", " Online access", " General practice", " Primary care", " National Health Service"], "paper_abstract": "Background: Initiatives in the UK to enable patients to access their electronic health records( EHRs) are gathering momentum. All citizens of the European Union should have access to their records by 2015, a target that the UK has endorsed. Objectives: To identify the ways in which patients used their access to their EHRs, what they sought to achieve, and the extent to which EHR access was related to the concept of making savings. Methods: An audit of patients' online access to medical records was conducted in July-August 2011 using a survey questionnaire. Two hundred and twenty six patients who were registered with two general practices in the National Health Service ( NHS) located in the UK and who had accessed their personal EHRs at least twice in the preceding 12 months i.e. from July 2010 to July 2011, completed the questionnaire. Data analysis A thematic analysis of the comments that patients gave in response to the open ended questions on the questionnaire. Results: Overall, evaluations of record access were positive. Four main themes relating to the ways in which patients accessed their records were identified: making savings, checking past activity, preparation for future action, and setting new expectations. Conclusions: Quite apart from any benefits of savings in healthcare resources, this study has provided qualitative evidence of the active ways in which patients may make use of access to their EHRs, many of which are in line with proportionate health management strategies. Access to personal EHRs may contribute to the development of new expectations among patients. (C) 2014 The Authors. Published by Elsevier Ireland Ltd. This is an open access article under the CC BY license", "paper_title": "Accessing personal medical records online: A means to what ends?", "paper_id": "WOS:000346422000003"}