{"auto_keywords": [{"score": 0.04252420525659764, "phrase": "tead"}, {"score": 0.005223427732928125, "phrase": "academic_detailers"}, {"score": 0.00481495049065317, "phrase": "evidence-based_prescribing"}, {"score": 0.004703830601110172, "phrase": "specially_trained_pharmacists"}, {"score": 0.004686963264680882, "phrase": "detailed_medication_knowledge_meeting"}, {"score": 0.004645057834614705, "phrase": "best_practices"}, {"score": 0.004554173999738137, "phrase": "physicians'_prescribing_behavior"}, {"score": 0.004513450434595191, "phrase": "key_challenge"}, {"score": 0.00446506039438222, "phrase": "rural_and_remote_locations"}, {"score": 0.004385555408850022, "phrase": "limited_ability"}, {"score": 0.004354149483556514, "phrase": "face-to-face_meetings"}, {"score": 0.004299726988991382, "phrase": "specially_trained_academic_detailers"}, {"score": 0.004155399041702324, "phrase": "information_technologies"}, {"score": 0.004074056512966141, "phrase": "technology-enabled_academic_detailing"}, {"score": 0.0038740879215858324, "phrase": "evidence-informed_prescribing_information"}, {"score": 0.0038601843968624843, "phrase": "diabetes-related_medications"}, {"score": 0.0038187713481137374, "phrase": "time_efficiency"}, {"score": 0.0037463448552884347, "phrase": "tead_sessions"}, {"score": 0.003737268370821561, "phrase": "knowledge_exchange"}, {"score": 0.0035858673522839407, "phrase": "british_columbia"}, {"score": 0.0035283010563420423, "phrase": "diabetes_medication_usage"}, {"score": 0.003428225501938859, "phrase": "intervention_groups"}, {"score": 0.003190240406666149, "phrase": "physician-completed_surveys"}, {"score": 0.003150319576043518, "phrase": "pharmacist_logs"}, {"score": 0.0031333634554162417, "phrase": "detailing_session"}, {"score": 0.003071965703296204, "phrase": "study_completion"}, {"score": 0.003038983069081333, "phrase": "technical_support_log"}, {"score": 0.0030171910207671205, "phrase": "phone_calls"}, {"score": 0.0029687268613641394, "phrase": "technical_challenges"}, {"score": 0.0029210388852074208, "phrase": "web_portal"}, {"score": 0.0026938159539864953, "phrase": "complete_data"}, {"score": 0.0024887002832414923, "phrase": "academic_detailing"}, {"score": 0.0024136908511423875, "phrase": "new_prescribing_insights"}, {"score": 0.0023578561657008235, "phrase": "acceptable_alternative"}, {"score": 0.002286781334850213, "phrase": "effective_knowledge_exchange"}, {"score": 0.0022785613865764923, "phrase": "interprofessional_collaboration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Technology", " Pharmaceutical", " Evidence-based medicine", " Education", " Academic detailing"], "paper_abstract": "Background: Academic detailing (AD) is the practice of specially trained pharmacists with detailed medication knowledge meeting with physicians to share best practices of prescribing. AD has demonstrated efficacy in positively influencing physicians' prescribing behavior. Nevertheless, a key challenge has been that physicians in rural and remote locations, or physicians who are time challenged, have limited ability to participate in face-to-face meetings with academic detailers, as these specially trained academic detailers are primarily urban-based and limited in numbers. Objective: To determine the feasibility of using information technologies to facilitate communication between academic detailers and physicians (known as Technology-Enabled Academic Detailing or TEAD) through a comparison to traditional face-to-face academic detailing (AD). Specifically, TEAD is compared to AD in terms of the ability to aid physicians in acquiring evidence-informed prescribing information on diabetes-related medications, measured in terms of time efficiency, satisfaction of both physicians and pharmacists, and quality of knowledge exchange. Methods: General Practitioner Physicians (n = 105) and pharmacists (n = 12) were recruited from across British Columbia. Pharmacists were trained to be academic detailers on diabetes medication usage. Physicians were assigned to one of four intervention groups to receive four academic detailing sessions from trained pharmacists. Intervention groups included: (1) AD only, (2) TEAD only, (3) TEAD crossed over to AD at midpoint, and (4) AD crossed over to TEAD at midpoint. Evaluation included physician-completed surveys before and after each session, pharmacist logs after each detailing session, interviews and focus groups with physicians and pharmacists at study completion, as well as a technical support log to record all phone calls and emails from physicians and pharmacists regarding any technical challenges during the TEAD sessions, or usage of the web portal. Results: Because recruitment was very low for the cross over groups, we analyzed the results in two groups instead: AD only and TEAD only. 354 sessions were conducted (AD = 161, TEAD = 193). Of these, complete data were available for 300 sessions, which were included in analysis (AD = 133, TEAD = 167). On average, TEAD sessions were 49 min long, and AD sessions 81 min long. Overall, physicians enjoyed both modalities of academic detailing (AD and TEAD) because they received information that both reinforced their existing diabetes knowledge and also provided new prescribing insights and approaches. Conclusion: The results suggest that TEAD is an acceptable alternative to AD for providing physicians advice about prescribing. TEAD is more time efficient, facilitates effective knowledge exchange and interprofessional collaboration, and can reach those physicians virtually where face-to-face AD is not possible or practical. Limitations: Due to logistics, physicians were allocated, rather than randomized, to receive AD and/or TEAD. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Technology-Enabled Academic Detailing: Computer-mediated education between pharmacists and physicians for evidence-based prescribing", "paper_id": "WOS:000323584700003"}