{"auto_keywords": [{"score": 0.03074880035138802, "phrase": "twitter"}, {"score": 0.004537875262684779, "phrase": "social_networks"}, {"score": 0.00450633982324153, "phrase": "micro-blogging_systems"}, {"score": 0.004246947739596565, "phrase": "different_backgrounds"}, {"score": 0.003905864553426306, "phrase": "popular_users"}, {"score": 0.0038787040860731935, "phrase": "authoritative_information_sources"}, {"score": 0.0036553070575015344, "phrase": "information_propagation"}, {"score": 0.0034327289845581693, "phrase": "information_networks"}, {"score": 0.0032462487283717546, "phrase": "novel_model"}, {"score": 0.0031130463625133496, "phrase": "social_network"}, {"score": 0.0030378759123133644, "phrase": "user_relationships"}, {"score": 0.002872783899731766, "phrase": "case_study"}, {"score": 0.002803398730609738, "phrase": "multiple_paths"}, {"score": 0.002651015392318126, "phrase": "information_contagion"}, {"score": 0.00227323596233465, "phrase": "vast_sample"}, {"score": 0.002249527353528286, "phrase": "twitter_network"}, {"score": 0.0021346343252001488, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "information_spread"}], "paper_keywords": ["Social computing", " User influence", " Information spread", " Social network", " Twitter"], "paper_abstract": "With the advent of social networks and micro-blogging systems, the way of communicating with other people and spreading information has changed substantially. Persons with different backgrounds, age and education exchange information and opinions, spanning various domains and topics, and have now the possibility to directly interact with popular users and authoritative information sources usually unreachable before the advent of these environments. As a result, the mechanism of information propagation changed deeply, the study of which is indispensable for the sake of understanding the evolution of information networks. To cope up with this intention, in this paper, we propose a novel model which enables to delve into the spread of information over a social network along with the change in the user relationships with respect to the domain of discussion. For this, considering Twitter as a case study, we aim at analyzing the multiple paths the information follows over the network with the goal of understanding the dynamics of the information contagion with respect to the change of the topic of discussion. We then provide a method for estimating the influence among users by evaluating the nature of the relationship among them with respect to the topic of discussion they share. Using a vast sample of the Twitter network, we then present various experiments that illustrate our proposal and show the efficacy of the proposed approach in modeling this information spread.", "paper_title": "The 10 million follower fallacy: audience size does not prove domain-influence on Twitter", "paper_id": "WOS:000359548100003"}