{"auto_keywords": [{"score": 0.046295259069903005, "phrase": "power_consumption"}, {"score": 0.0429841867448742, "phrase": "level_shifters"}, {"score": 0.020824501842681007, "phrase": "power_reduction"}, {"score": 0.00481495049065317, "phrase": "optimal_supply_voltage_assignment"}, {"score": 0.0041450181887917135, "phrase": "area_issue"}, {"score": 0.00393032656248792, "phrase": "superior_result"}, {"score": 0.0036553070575015344, "phrase": "circuit_area"}, {"score": 0.0034325187732054093, "phrase": "effective_integer_linear_programming"}, {"score": 0.003270396852243212, "phrase": "different_objectives"}, {"score": 0.0031614748814351823, "phrase": "timing_constraint"}, {"score": 0.003100865267124765, "phrase": "gecvs_algorithm"}, {"score": 0.002542642270762272, "phrase": "average_improvement"}, {"score": 0.0024224481033945943, "phrase": "gecvs"}, {"score": 0.002230984431056064, "phrase": "total_power_consumption"}, {"score": 0.0021461840368981475, "phrase": "minimum_circuit_delay_experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_ilp-based_msv_assignment_algorithm"}], "paper_keywords": ["level shifter", " multiple supply voltage", " low power", " voltage assignment", " integer linear programming"], "paper_abstract": "Multiple supply voltage (MSV) assignment is a highly effective means of reducing power consumption Many existing algorithms perform very well for power reduction However. they do not handle the area issue of level shifters In some cases, although one gels a superior result to reduce the power consumption. but many extra level shifters are needed to add so that the circuit area will be over the specification In this paper. we present an effective integer linear programming (ILP)-based MSV assignment approach to solve two problems with different objectives For he objective of power reduction under timing constraint, compared with GECVS algorithm [10], the power consumption obtained by our proposed approach can be further reduced 0 to 5 46% and the number of level shifters is improved 16 31% in average For the objective of power reduction under constraints of both timing and area of level shifters. the average improvement of power consumption obtained by our algorithm is still better than GECVS while reducing the number of level shifters by 22 92% in average In addition given a constraint of total power consumption. our algorithm will generate a design having minimum circuit delay Experimental results show that the proposed ILP-based MSV assignment algorithm solves different problems flexibly", "paper_title": "Optimal Supply Voltage Assignment under Timing, Power and Area Constraints", "paper_id": "WOS:000276848000012"}