{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "self-similar_social_networks"}, {"score": 0.004626255242038005, "phrase": "decentralized_systems"}, {"score": 0.004484596684703308, "phrase": "independent_pairs"}, {"score": 0.004405596416783185, "phrase": "mutual_exchange"}, {"score": 0.004327981760540394, "phrase": "e._g."}, {"score": 0.004048860957751714, "phrase": "enforcement_mechanism"}, {"score": 0.003198705576491802, "phrase": "new_generic_model"}, {"score": 0.0029394074636168435, "phrase": "dynamic_social_network"}, {"score": 0.0027252240573281163, "phrase": "unselfish_behavior"}, {"score": 0.0026652435674846095, "phrase": "higher_levels"}, {"score": 0.0026182085765020548, "phrase": "higher_payoff"}, {"score": 0.0025605773834404253, "phrase": "model's_behavior"}, {"score": 0.0021716540012278744, "phrase": "social_network"}, {"score": 0.002142832962924139, "phrase": "reflexive_cooperation_levels"}, {"score": 0.0021049977753042253, "phrase": "highly_effective_and_robust_incentive_mechanism"}], "paper_keywords": ["Algorithms", " Cooperation", " decentralized systems", " self-organization"], "paper_abstract": "We address the problem of cooperation in decentralized systems, specifically looking at interactions between independent pairs of peers where mutual exchange of resources (e. g., updating or sharing content) is required. In the absence of any enforcement mechanism or protocol, there is no incentive for one party to directly reciprocate during a transaction with another. Consequently, for such decentralized systems to function, protocols for self-organization need to explicitly promote cooperation in a manner where adherence to the protocol is incentivized. In this article we introduce a new generic model to achieve this. The model is based on peers repeatedly interacting to build up and maintain a dynamic social network of others that they can trust based on similarity of cooperation. This mechanism effectively incentivizes unselfish behavior, where peers with higher levels of cooperation gain higher payoff. We examine the model's behavior and robustness in detail. This includes the effect of peers self-adapting their cooperation level in response to maximizing their payoff, representing a Nash-equilibrium of the system. The study shows that the formation of a social network based on reflexive cooperation levels can be a highly effective and robust incentive mechanism for autonomous decentralized systems.", "paper_title": "Cooperation through Self-Similar Social Networks", "paper_id": "WOS:000275117800004"}