{"auto_keywords": [{"score": 0.04872267695171359, "phrase": "multimedia_security_systems"}, {"score": 0.04100765784456242, "phrase": "multiuser_collusion"}, {"score": 0.026699092039806232, "phrase": "selfish_colluder"}, {"score": 0.00481495049065317, "phrase": "traitor_behavior"}, {"score": 0.0046118021635786315, "phrase": "different_objectives"}, {"score": 0.004529696178827392, "phrase": "other's_performance"}, {"score": 0.00446506039438222, "phrase": "behavior_forensics"}, {"score": 0.004385555408850022, "phrase": "conflicting_interests"}, {"score": 0.0042004472903194616, "phrase": "thorough_understanding"}, {"score": 0.004110831924517065, "phrase": "digital_rights_enforcer_offer"}, {"score": 0.003637822529522622, "phrase": "content_owner"}, {"score": 0.0035858673522839407, "phrase": "important_issue"}, {"score": 0.0031164983132321417, "phrase": "selfish_colluders"}, {"score": 0.0028792911886505526, "phrase": "multimedia_forensics"}, {"score": 0.0026505322540093783, "phrase": "first_work"}, {"score": 0.0025938977569302177, "phrase": "colluder_dynamics"}, {"score": 0.002538470301402269, "phrase": "possible_strategies"}, {"score": 0.002262209824105154, "phrase": "colluded_copy"}, {"score": 0.002245975340642921, "phrase": "high_resolution"}, {"score": 0.0022298571016688335, "phrase": "good_quality"}, {"score": 0.002174346780014853, "phrase": "optimal_precollusion_processing_strategies"}, {"score": 0.0021049977753042253, "phrase": "quality_constraints"}], "paper_keywords": ["behavior forensic", " fairness", " multiuser collusion", " risk minimization", " traitors within traitors"], "paper_abstract": "Multimedia security systems have many users with different objectives and they influence each other's performance and decisions. Behavior forensics analyzes how users with conflicting interests interact with and respond to each other. Such investigation enables a thorough understanding of multimedia security systems and helps the digital rights enforcer offer stronger protection of multimedia. This paper analyzes the dynamics among attackers during multiuser collusion. The colluders share not only the profit from the redistribution of multimedia but also the risk of being detected by the content owner, and an important issue in collusion is fairness of the attack (i.e., whether all attackers share the same risk) (e.g., whether they have the same probability of being detected)., While they might agree so, some selfish colluders may break their fair-play agreement in order to further lower their risk. This paper investigates the problem of \"traitors within traitors\" in multimedia forensics, in an effort to formulate the dynamics among attackers and understand their behavior to minimize their own risk and protect their own interests. As the first work on the analysis of this colluder dynamics, this paper explores some possible strategies that a selfish colluder can use to minimize his or her probability of being caught. We show that processing his or her fingerprinted copy before multiuser collusion helps a selfish colluder further lower his or her risk, especially when the colluded copy has high resolution and good quality. This paper also investigates the optimal precollusion processing strategies for selfish colluders to minimize their risk under the quality constraints.", "paper_title": "Traitor-within-traitor behavior forensics: Strategy and risk minimization", "paper_id": "WOS:000246145600003"}