{"auto_keywords": [{"score": 0.02631519935316745, "phrase": "nonterminating_protocols"}, {"score": 0.009345977648089207, "phrase": "proof_system"}, {"score": 0.00481495049065317, "phrase": "first-class_agent_interaction_protocols."}, {"score": 0.0043753813457279404, "phrase": "executable_entities"}, {"score": 0.00363080961099728, "phrase": "hard-coded_decision-making_mechanisms"}, {"score": 0.0034348484776384643, "phrase": "protocol_specification"}, {"score": 0.003152531962718477, "phrase": "propositional_dynamic_logic"}, {"score": 0.002922705896608178, "phrase": "first-class_protocols"}, {"score": 0.0028212543389886133, "phrase": "pdl"}, {"score": 0.002750934994181092, "phrase": "recursively_defined_protocols"}, {"score": 0.0021049977753042253, "phrase": "restricted_class"}], "paper_keywords": ["multiagent systems", " agent interaction protocols", " propositional dynamic logic", " first-class protocols"], "paper_abstract": "For agents to fulfill their potential of being intelligent and adaptive, it is useful to model their interaction protocols as executable entities that can be referenced, inspected, composed, shared, and invoked between agents, all at runtime. We use the term first-class protocol to refer to such protocols. Rather than having hard-coded decision-making mechanisms for choosing their next move, agents can inspect the protocol specification at runtime to do so, increasing their flexibility. In this article, we show that propositional dynamic logic (PDL) can be used to represent and reason about the outcomes of first-class protocols. We define a proof system for PDL that permits reasoning about recursively defined protocols. The proof system is divided into two parts: one for reasoning about terminating protocols, and one for reasoning about nonterminating protocols. We prove that proofs about terminating protocols can be automated, while proofs about nonterminating protocols are unable to be automated in some cases. We prove that, for a restricted class of nonterminating protocols, proofs about them can be transformed to proofs about terminating protocols, making them automatable.", "paper_title": "PROPOSITIONAL DYNAMIC LOGIC FOR REASONING ABOUT FIRST-CLASS AGENT INTERACTION PROTOCOLS", "paper_id": "WOS:000295014200005"}