{"auto_keywords": [{"score": 0.04855826957755247, "phrase": "sensor_network"}, {"score": 0.013745698902620547, "phrase": "communication_cost"}, {"score": 0.011234383901961128, "phrase": "constructed_topology"}, {"score": 0.009630645023120101, "phrase": "connected_sensor_cover"}, {"score": 0.00481495049065317, "phrase": "sensor_networks"}, {"score": 0.0047839735747931605, "phrase": "efficient_query_execution"}, {"score": 0.004753194996637899, "phrase": "spatial_query_execution"}, {"score": 0.004707396263523012, "phrase": "essential_functionality"}, {"score": 0.0045726187330434025, "phrase": "sensor_data"}, {"score": 0.004528551999851654, "phrase": "specific_geographic_region"}, {"score": 0.004137119737646718, "phrase": "efficient_use"}, {"score": 0.00409723267214392, "phrase": "battery_energy"}, {"score": 0.0033971539563683174, "phrase": "self-organization_technique"}, {"score": 0.0030435998319355883, "phrase": "energy_consumption"}, {"score": 0.00281635677605879, "phrase": "near-optimal_connected_sensor_cover"}, {"score": 0.0026314443645799913, "phrase": "optimal_size"}, {"score": 0.0025808721879758243, "phrase": "network_size"}, {"score": 0.0025394700487126414, "phrase": "distributed_self-organization_version"}, {"score": 0.00244278788608393, "phrase": "communication_overhead"}, {"score": 0.002372693822379709, "phrase": "distributed_algorithm"}, {"score": 0.0023497779149212737, "phrase": "node_priorities"}, {"score": 0.0021672007484097575, "phrase": "distributed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "significant_communication_cost_reductions"}], "paper_keywords": ["Connected sensor cover", " query optimization", " sensor connectivity", " sensor coverage", " sensor networks"], "paper_abstract": "Spatial query execution is an essential functionality of a sensor network, where a query gathers sensor data within a specific geographic region. Redundancy within a sensor network can be exploited to reduce the communication cost incurred in execution of such queries. Any reduction in communication cost would result in an efficient use of the battery energy, which is very limited in sensors. One approach to reduce the communication cost of a query is to self-organize the network, in response to a query, into a topology that involves only a small subset of the sensors sufficient to process the query. The query is then executed using only the sensors in the constructed topology. The self-organization technique is beneficial for queries that run sufficiently long to amortize the communication cost incurred in self-organization. In this paper, we design and analyze algorithms for suchself-organization of a sensor network to reduce energy consumption. In particular, we develop the notion of a connected sensor cover and design a centralized approximation algorithm that constructs a topology involving a near-optimal connected sensor cover. We prove that the size of the constructed topology is within an O (log n) factor of the optimal size, where n is the network size. We develop a distributed self-organization version of the approximation algorithm, and propose several optimizations to reduce the communication overhead of the algorithm. We also design another distributed algorithm based on node priorities that has a further lower communication overhead, but does not provide any guarantee on the size of the connected sensor cover constructed. Finally, we evaluate the distributed algorithms using simulations and show that our approaches results in significant communication cost reductions.", "paper_title": "Connected sensor cover: Self-organization of sensor networks for efficient query execution", "paper_id": "WOS:000235479700005"}