{"auto_keywords": [{"score": 0.04258372657697968, "phrase": "efficient_algorithms"}, {"score": 0.013829364941111222, "phrase": "np"}, {"score": 0.004814958357105924, "phrase": "bilu"}, {"score": 0.004777239159135081, "phrase": "linial"}, {"score": 0.004521179256835894, "phrase": "optimal_clustering"}, {"score": 0.003787191644093659, "phrase": "max-cut_clustering"}, {"score": 0.0035981701736904495, "phrase": "center-based_objectives"}, {"score": 0.0035559065231811323, "phrase": "balcan"}, {"score": 0.0035280078542855656, "phrase": "liang"}, {"score": 0.00281826552772148, "phrase": "lower_bounds"}, {"score": 0.0026459927476753585, "phrase": "constant_multiplicative_resilience_parameters"}, {"score": 0.002553747223995378, "phrase": "clustering_problem"}, {"score": 0.0023600807990911145, "phrase": "additive_perturbations"}, {"score": 0.002286781334850213, "phrase": "multiplicative_notions"}, {"score": 0.002224510044064184, "phrase": "close_examination"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Clustering", " Data stability", " Resilience assumptions"], "paper_abstract": "We consider the model introduced by Bilu and Linial (2010) [13], who study problems for which the optimal clustering does not change when distances are perturbed. They show that even when a problem is NP-hard, it is sometimes possible to obtain efficient algorithms for instances resilient to certain multiplicative perturbations, e.g. on the order of O (root n) for max-cut clustering. Awasthi et al. (2012) [6] consider center-based objectives, and Balcan and Liang (2012) [9] analyze the k-median and min-sum objectives, giving efficient algorithms for instances resilient to certain constant multiplicative perturbations. Here, we are motivated by the question of to what extent these assumptions can be relaxed while allowing for efficient algorithms. We show there is little room to improve these results by giving NP-hardness lower bounds for both the k-median and min-sum objectives. On the other hand, we show that constant multiplicative resilience parameters can be so strong as to make the clustering problem trivial, leaving only a narrow range of resilience parameters for which clustering is interesting. We also consider a model of additive perturbations and give a correspondence between additive and multiplicative notions of stability. Our results provide a close examination of the consequences of assuming stability in data. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Data stability in clustering: A closer look", "paper_id": "WOS:000345181900005"}