{"auto_keywords": [{"score": 0.03830059436786332, "phrase": "fixed-length_feature_vector"}, {"score": 0.00481495049065317, "phrase": "spectral_minutiae"}, {"score": 0.004378958522416482, "phrase": "unordered_collection"}, {"score": 0.004330321475256457, "phrase": "minutiae_locations"}, {"score": 0.003960101604693806, "phrase": "spectral_minutiae_representation"}, {"score": 0.003808209866576388, "phrase": "novel_method"}, {"score": 0.0030451958332949735, "phrase": "fingerprint_recognition_systems"}, {"score": 0.0030113280682863234, "phrase": "template_protection_schemes"}, {"score": 0.002128694000627911, "phrase": "fusion_scheme"}, {"score": 0.0021049977753042253, "phrase": "singular_points"}], "paper_keywords": ["Biometrics", " fingerprint recognition", " minutiae matching", " template protection"], "paper_abstract": "Most fingerprint recognition systems are based on the use of a minutiae set, which is an unordered collection of minutiae locations and orientations suffering from various deformations such as translation, rotation, and scaling. The spectral minutiae representation introduced in this paper is a novel method to represent a minutiae set as a fixed-length feature vector, which is invariant to translation, and in which rotation and scaling become translations, so that they can be easily compensated for. These characteristics enable the combination of fingerprint recognition systems with template protection schemes that require a fixed-length feature vector. This paper introduces the concept of algorithms for two representation methods: the location-based spectral minutiae representation and the orientation-based spectral minutiae representation. Both algorithms are evaluated using two correlation-based spectral minutiae matching algorithms. We present the performance of our algorithms on three fingerprint databases. We also show how the performance can be improved by using a fusion scheme and singular points.", "paper_title": "Fingerprint Verification Using Spectral Minutiae Representations", "paper_id": "WOS:000269155900011"}