{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "simple_xpath_fragments"}, {"score": 0.04962396550254858, "phrase": "duplicate-free_dtds"}, {"score": 0.047626415189153566, "phrase": "xpath_satisfiability_problem"}, {"score": 0.025736720012408006, "phrase": "satisfiability_problem"}, {"score": 0.004313996835376177, "phrase": "expression_q"}, {"score": 0.00401560412621627, "phrase": "xml_document_t"}, {"score": 0.003632080001489739, "phrase": "unsatisfiable_xpath_expression"}, {"score": 0.003429544382524185, "phrase": "empty_set"}, {"score": 0.002859533151305368, "phrase": "node_test"}, {"score": 0.0026742419973883134, "phrase": "path_union"}, {"score": 0.002488985155689794, "phrase": "small_xpath_fragments"}, {"score": 0.002396451633274121, "phrase": "np"}, {"score": 0.0022294857939412073, "phrase": "xpath_fragments"}, {"score": 0.002105010001444307, "phrase": "ptime"}], "paper_keywords": ["XML", " XPath", " satisfiability"], "paper_abstract": "In this paper, we consider the XPath satisfiability problem under restricted DTDs called \"duplicate free\". For an)(Path expression q and a DTD D, q is satisfiable under D if there exists an XML document t such that t is valid against D and that the answer of q on t is nonempty. Evaluating an unsatisfiable XPath expression is meaningless, since such an expression can always be replaced by an empty set without evaluating it. However, it is shown that the XPath satisfiability problem is intractable for a large number of)(Path fragments. In this paper, we consider simple XPath fragments under two restrictions: (i) only a label can be specified as a node test and (ii) operators such as qualifier ([]) and path union (U) are not allowed. We first show that, for some small XPath fragments under the above restrictions, the satisfiability problem is NP-complete under DTDs without any restriction. Then we show that there exist XPath fragments, containing the above small fragments, for which the satisfiability problem is in PTIME under duplicate-free DTDs.", "paper_title": "Satisfiability of Simple XPath Fragments under Duplicate-Free DTDs", "paper_id": "WOS:000319085800004"}