{"auto_keywords": [{"score": 0.028617766540098524, "phrase": "similarity_measures"}, {"score": 0.026440097028952267, "phrase": "neighbourhood-based_similarity_measures"}, {"score": 0.014862137826237262, "phrase": "image_processing"}, {"score": 0.013994414650300624, "phrase": "image_quality_evaluation"}, {"score": 0.009172987966690754, "phrase": "human_perception"}, {"score": 0.00481495049065317, "phrase": "neighbourhood-based_and_histogram_similarity_measures"}, {"score": 0.004718431349852634, "phrase": "image_quality_measures"}, {"score": 0.0046803650677267146, "phrase": "fuzzy_techniques"}, {"score": 0.004246729915110547, "phrase": "objective_quality_measures"}, {"score": 0.0041279612688488445, "phrase": "great_importance"}, {"score": 0.0038375280115736958, "phrase": "different_algorithms"}, {"score": 0.0037150687722055727, "phrase": "noise_reduction"}, {"score": 0.003329804436286295, "phrase": "classical_quality_measures"}, {"score": 0.003158799690943562, "phrase": "psnr"}, {"score": 0.0030953529970646626, "phrase": "noise_ratio"}, {"score": 0.0029965060407413898, "phrase": "visual_observations"}, {"score": 0.0028541057064952876, "phrase": "new_quality_measures"}, {"score": 0.0021569129153653777, "phrase": "histogram_comparison"}, {"score": 0.0021049977753042253, "phrase": "perceptive_behaviour"}], "paper_keywords": [""], "paper_abstract": "Fuzzy techniques can be applied in several domains of image processing. In this paper we will show how fuzzy set theory is used in establishing measures for image quality evaluation. Objective quality measures or measures of comparison are of great importance in the field of image processing. These measures serve as a tool to evaluate and to compare different algorithms designed to solve problems, such as noise reduction, deblurring, compression ... Consequently these measures serve as a basis on which one algorithm is preferred to another. It is well-known that classical quality measures, such as the MSE (mean square error) or the PSNR (peak signal to noise ratio), do not always correspond to visual observations. Therefore, several researchers are - and have been looking for new quality measures, better adapted to human perception. In [1] we illustrated how similarity measures, originally introduced to express the degree of comparison between two fuzzy sets, can be used in the construction of neighbourhood-based similarity measures which outperform the MSE in the sense of image quality evaluation because the results of the neighbourhood-based similarity measures coincide better with human perception. In this paper we show how the neighbourhood-based similarity measures can be combined with similarity measures for histogram comparison in order to improve the perceptive behaviour of these similarity measures.", "paper_title": "Combining neighbourhood-based and histogram similarity measures for the design of image quality measures", "paper_id": "WOS:000235835400039"}