{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clinical_narratives"}, {"score": 0.011120268076100706, "phrase": "intermediate_and_novice_subjects"}, {"score": 0.009267867505634918, "phrase": "structured_form"}, {"score": 0.00476527679607755, "phrase": "electronic_medical_record_interface"}, {"score": 0.0046352930395962685, "phrase": "healthcare_practice_transitions"}, {"score": 0.004524455848517757, "phrase": "computer-based_records"}, {"score": 0.004385819169212677, "phrase": "effective_electronic_format"}, {"score": 0.00425141240073214, "phrase": "cognitive_science_methodology"}, {"score": 0.004164094489641152, "phrase": "medical_texts"}, {"score": 0.003872310849448784, "phrase": "discharge_summaries"}, {"score": 0.0038190873308414333, "phrase": "varying_expertise-experts"}, {"score": 0.003325343504284345, "phrase": "structured_discharge_summary"}, {"score": 0.0031680109156103334, "phrase": "qualitative_comparison"}, {"score": 0.0031352744329834676, "phrase": "interview_transcripts"}, {"score": 0.0025293860389728516, "phrase": "narrative_form"}, {"score": 0.002426378123762607, "phrase": "summary_use"}, {"score": 0.0023764543399388658, "phrase": "conceptual_representation"}, {"score": 0.002279660253812632, "phrase": "clinically_relevant_information"}, {"score": 0.0022250240576349267, "phrase": "medical_text"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["electronic medical records", " medical narratives", " cognitive science", " mental health care", " user interface"], "paper_abstract": "Objective: As healthcare practice transitions, from paper-based to computer-based records, there is increasing need to determine an effective electronic format for clinical narratives. Our research focuses on utilizing a cognitive science methodology to guide the conversion of medical texts. to a more structured, user-customized presentation in the electronic medical record (EMR). Design: We studied the use of discharge summaries by psychiatrists with varying expertise-experts, intermediates, and novices. Experts were given two hypothetical emergency care scenarios with narrative discharge summaries and asked to verbalize their clinical assessment. Based on the results, the narratives were presented in a more structured form. Intermediate and novice subjects received a narrative and a structured discharge summary, and were asked to verbalize their assessments of each. Measurements: A qualitative comparison of the interview transcripts of all subjects was done by analysis of recall and inference made with respect to level of expertise. Results: For intermediate and novice subjects, recall was greater with the structured form than with the narrative. Novices were also able to make more inferences (not always accurate) from the structured form than with the narrative. Errors occurred in assessments using the narrative form but not the structured form. Conclusions: Our cognitive methods to study discharge summary use enabled us to extract a conceptual representation of clinical narratives from end-users. This method allowed us to identify clinically relevant information that can be used to structure medical text for the EMR and potentially improve recall and reduce errors. (c) 2005 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Customizing clinical narratives for the electronic medical record interface using cognitive methods", "paper_id": "WOS:000236912800002"}