{"auto_keywords": [{"score": 0.049604883316905685, "phrase": "wikipedia"}, {"score": 0.00481495049065317, "phrase": "community-generated_content_-_a_user_study"}, {"score": 0.004558414405811025, "phrase": "information_consumers"}, {"score": 0.0043804319008535555, "phrase": "collaborative-writing_environment"}, {"score": 0.004230382915464492, "phrase": "sixty-four_users"}, {"score": 0.004065156038847781, "phrase": "five_articles"}, {"score": 0.0040048667115255, "phrase": "hebrew_wikipedia"}, {"score": 0.003906357144047631, "phrase": "highest-and_lowest-quality_article"}, {"score": 0.0034146585649631692, "phrase": "article's_current_content"}, {"score": 0.002769568481822277, "phrase": "external_links"}, {"score": 0.002481747081849503, "phrase": "subjective_concept"}, {"score": 0.002420611343093316, "phrase": "user's_unique_point"}, {"score": 0.002268598551466928, "phrase": "unique_editors"}, {"score": 0.0021049977753042253, "phrase": "high-quality_articles"}], "paper_keywords": ["Wikipedia", " user-study", " information quality assessment"], "paper_abstract": "This study examines the ways in which information consumers evaluate the quality of content in a collaborative-writing environment, in this case Wikipedia. Sixty-four users were asked to assess the quality of five articles from the Hebrew Wikipedia, to indicate the highest-and lowest-quality article of the five and explain their choices. Participants viewed both the article page, and the article's history page, so that their decision was based both on the article's current content and on its development. The analysis shows that the attributes that most frequently assisted the users in deciding about the quality of the items were not unique to Wikipedia: attributes such as amount of information, satisfaction with content and external links were mentioned frequently, as with other information quality studies on the web. The findings also support the claim that quality is a subjective concept which depends on the user's unique point of view. Attributes such as number of edits and number of unique editors received two contradictory meanings - both few edits/editors and many edits/editors were mentioned as attributes of high-quality articles.", "paper_title": "Information quality assessment of community-generated content - A user study of Wikipedia", "paper_id": "WOS:000295737200004"}