{"auto_keywords": [{"score": 0.0401475817258346, "phrase": "particular_set"}, {"score": 0.027744511726260433, "phrase": "unfamiliar_companies"}, {"score": 0.00481495049065317, "phrase": "consumers'_trust"}, {"score": 0.00476697427418509, "phrase": "internet_companies"}, {"score": 0.004625881588444304, "phrase": "ever-shifting_landscape"}, {"score": 0.004164007198843467, "phrase": "new_sets"}, {"score": 0.0038819041309353024, "phrase": "organization's_positioning"}, {"score": 0.003673675864705682, "phrase": "consumers'_later_judgment"}, {"score": 0.003097865379563127, "phrase": "significant_impact"}, {"score": 0.003021141590548526, "phrase": "consumer_judges"}, {"score": 0.0027602925235474317, "phrase": "priming_effect"}, {"score": 0.002665027876903159, "phrase": "experimental_study"}, {"score": 0.0025473475682739784, "phrase": "overall_assimilation_effect"}, {"score": 0.0023745087648471613, "phrase": "familiar_organizations"}, {"score": 0.002315658491366464, "phrase": "contrast_effect"}, {"score": 0.0022925278792429553, "phrase": "inexperienced_consumers"}, {"score": 0.002158505888557746, "phrase": "prior_models"}, {"score": 0.0021049977753042253, "phrase": "consumers'_on-line_trust"}], "paper_keywords": ["Assimilation", " contrast", " e-commerce", " priming", " trust", " Web site design"], "paper_abstract": "The Internet presents an ever-shifting landscape for consumers to navigate. Links that exist one day may be gone the next, only to be replaced by new sets of connections among organizations. This study addresses the question of how an organization's positioning in a particular set of links on the Web might bias consumers' later judgment of its trustworthiness. The study suggests that the particular set of links a consumer faces in navigating toward an organization constitutes a context for the encounter with that organization and may have a significant impact on the way the consumer judges the company after interacting with its Web site. The paper develops and tests hypotheses that argue for the priming effect of context. Results of an experimental study provide evidence that unfamiliar companies may benefit from an overall assimilation effect when a link to their sites is surrounded by links to more familiar organizations, and familiar organizations may benefit from a contrast effect when inexperienced consumers see their company link surrounded by links to unfamiliar companies. The paper extends prior models on the determinants of consumers' on-line trust by examining concepts from priming theory. The conclusions suggest that practitioners should be aware of the context in which links to their sites are placed.", "paper_title": "Contrast and Assimilation Effects on Consumers' Trust in Internet Companies", "paper_id": "WOS:000264724000004"}