{"auto_keywords": [{"score": 0.04688820719966082, "phrase": "load-balancing_algorithms"}, {"score": 0.04205123599692965, "phrase": "load-balancing_technical-factors"}, {"score": 0.03417212975519707, "phrase": "fsw"}, {"score": 0.00481495049065317, "phrase": "key_role"}, {"score": 0.0046238380150870435, "phrase": "heterogeneous_nodes"}, {"score": 0.004586531354697466, "phrase": "different_capacities"}, {"score": 0.004094639048362357, "phrase": "communication-overhead_increase"}, {"score": 0.0033433365160336842, "phrase": "overlay_network"}, {"score": 0.003120568497402472, "phrase": "heterogeneous_systems"}, {"score": 0.002865710140187219, "phrase": "network_diameter"}, {"score": 0.002762941385784905, "phrase": "time-delay_results"}, {"score": 0.0027295084882654917, "phrase": "tasks_remigration_process"}, {"score": 0.002674681176379472, "phrase": "improved_load-balancing_algorithm"}, {"score": 0.0025892330566358503, "phrase": "constructed_fsw"}, {"score": 0.0024862418814045723, "phrase": "average_effective-load"}, {"score": 0.00235843888868088, "phrase": "simulation_results"}, {"score": 0.0022923586577645143, "phrase": "original_neighborhood_approach"}, {"score": 0.002264607102799332, "phrase": "nearest_neighbor_approach"}, {"score": 0.0022281257694320455, "phrase": "response_time"}, {"score": 0.0021922308351126746, "phrase": "communication_overhead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Diffusion", " Distributed systems", " Dynamic load-balancing"], "paper_abstract": "Load-balancing algorithms play a key role in improving the performance of distributed-computing-systems that consist of heterogeneous nodes with different capacities. The performance of load-balancing algorithms and its convergence-rate deteriorate as the number-of-nodes in the system, the network-diameter, and the communication-overhead increase. Moreover, the load-balancing technical-factors significantly affect the performance of rebalancing the load among nodes. Therefore, we propose an approach that improves the performance of load-balancing algorithms by considering the load-balancing technical-factors and the structure of the network that executes the algorithm. We present the design of an overlay network, namely, functional small world (FSW) that facilitates efficient load-balancing in heterogeneous systems. The FSW achieves the efficiency by reducing the number-of-nodes that exchange their information, decreasing the network diameter, minimizing the communication-overhead, and decreasing the time-delay results from the tasks remigration process. We propose an improved load-balancing algorithm that will be effectively executed within the constructed FSW, where nodes consider the capacity and calculate the average effective-load. We compared our approach with two significant diffusion methods presented in the literature. The simulation results indicate that our approach considerably outperformed the original neighborhood approach and the nearest neighbor approach in terms of response time, throughput, communication overhead, and movements cost. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A small world based overlay network for improving dynamic load-balancing", "paper_id": "WOS:000358699700011"}