{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "ssc"}, {"score": 0.00481495049065317, "phrase": "asymptotically_critical_multi-class_fluid_networks"}, {"score": 0.004701247803858319, "phrase": "fluid_queueing_networks"}, {"score": 0.004669254965563445, "phrase": "multiple_fluid_classes"}, {"score": 0.004405919996432158, "phrase": "asymptotic_behavior"}, {"score": 0.004287166497171827, "phrase": "queueing_systems"}, {"score": 0.004243460284890507, "phrase": "heavy_traffic_regime"}, {"score": 0.0035892794633115227, "phrase": "fluid_class"}, {"score": 0.0032283609741926476, "phrase": "heavy_traffic"}, {"score": 0.0032063591061580526, "phrase": "state_space_collapse"}, {"score": 0.0029235593748707495, "phrase": "fluid_classes"}, {"score": 0.002730240935688002, "phrase": "deterministic_lifting_matrix_delta"}, {"score": 0.0022622607058782277, "phrase": "brownian"}, {"score": 0.0021049977753042253, "phrase": "tandem_queue"}], "paper_keywords": ["state space collapse", " reflected fractional Brownian motion", " fluid model", " multi-class queueing network", " workload process", " fluid queue process", " on-off sources", " heavy traffic", " completely-S matrix", " tandem queue"], "paper_abstract": "We consider a class of fluid queueing networks with multiple fluid classes and feedback allowed, which are fed by N heavy tailed ON/OFF sources. We study the asymptotic behavior when N -> infinity of these queueing systems in a heavy traffic regime (that is, when they are asymptotically critical). As performance processes we consider the workload W(N) (the amount of time needed for each server to complete processing of all the fluid in queue), and the fluid queue Z(N) (the quantity of each fluid class in the system). We show the convergence of root NW(N) and root N Z(N) (to (W) over cap and (Z) over cap) in heavy traffic if state space collapse (SSC) holds. (SSC) is a condition that establishes a relationship between those components of (Z) over cap that correspond to fluid classes processed by the same server, which implies that (Z) over cap =Delta(W) over cap for a deterministic lifting matrix Delta. Our main contribution is to prove that assuming that the other hypotheses are true, (SSC) is not only sufficient for this convergence, but necessary. Furthermore, we prove that processes (W) over cap and (Z) over cap conveniently scaled in time, converge to W (a reflected fractional Brownian motion) and Z (= Delta W). We illustrate the application of our results with some examples including a tandem queue.", "paper_title": "State space collapse for asymptotically critical multi-class fluid networks", "paper_id": "WOS:000258677300004"}