{"auto_keywords": [{"score": 0.044372506936841576, "phrase": "anisotropic_neighborhood"}, {"score": 0.008853175740205898, "phrase": "denoised_coarse_normal_field"}, {"score": 0.007920112320077484, "phrase": "isotropic_subneighborhoods"}, {"score": 0.00481495049065317, "phrase": "fine_normal"}, {"score": 0.004745260932479212, "phrase": "feature-preserving_mesh_denoising"}, {"score": 0.004161553532799662, "phrase": "feature_blurring"}, {"score": 0.004081385289516914, "phrase": "challenging_regions"}, {"score": 0.004041879818641576, "phrase": "shallow_features"}, {"score": 0.0039447744176901054, "phrase": "novel_mesh_denoising_framework"}, {"score": 0.003631671435460452, "phrase": "underlying_surface"}, {"score": 0.003579046565851265, "phrase": "noisy_mesh"}, {"score": 0.0031383410838018984, "phrase": "isotropic_subneighborhood"}, {"score": 0.0028195727965553367, "phrase": "normal_tensor_voting"}, {"score": 0.002751751956416832, "phrase": "normal_filter"}, {"score": 0.002608218347502229, "phrase": "normal_classification"}, {"score": 0.00247215300812495, "phrase": "feature_face"}, {"score": 0.002389276641014013, "phrase": "local_spectral_clustering"}, {"score": 0.0023431692392929353, "phrase": "normal_filtering"}, {"score": 0.0021049977753042253, "phrase": "better_performance"}], "paper_keywords": [""], "paper_abstract": "State-of-the?art normal filters usually denoise each face normal using its entire anisotropic neighborhood. However, enforcing these filters indiscriminately on the anisotropic neighborhood will lead to feature blurring, especially in challenging regions with shallow features. We develop a novel mesh denoising framework which can effectively preserve features with various sizes. Our idea is inspired by the observation that the underlying surface of a noisy mesh is piecewise smooth. In this regard, it is more desirable that we denoise each face normal within its piecewise smooth region (we call such a region as an isotropic subneighborhood) instead of using the anisotropic neighborhood. To achieve this, we first classify mesh faces into several types using a face normal tensor voting and then perform a normal filter to obtain a denoised coarse normal field. Based on the results of normal classification and the denoised coarse normal field, we segment the anisotropic neighborhood of every feature face into a number of isotropic subneighborhoods via local spectral clustering. Thus face normal filtering can be performed again on the isotropic subneighborhoods and produce a more accurate normal field. Extensive tests on various models demonstrate that our method can achieve better performance than state-of-the?art normal filters, especially in challenging regions with features.", "paper_title": "Coarse-to-Fine Normal Filtering for Feature-Preserving Mesh Denoising Based on Isotropic Subneighborhoods", "paper_id": "WOS:000327310800039"}