{"auto_keywords": [{"score": 0.012136457606838931, "phrase": "incomplete_information"}, {"score": 0.012007880917663905, "phrase": "knowledge_bases"}, {"score": 0.01075560535362115, "phrase": "representation_systems"}, {"score": 0.008718605874179572, "phrase": "strong_representation_system"}, {"score": 0.00481495049065317, "phrase": "data_exchange_beyond_complete_data"}, {"score": 0.004746558955503364, "phrase": "traditional_data_exchange_setting"}, {"score": 0.004294145092032327, "phrase": "typical_database_translation_scenario"}, {"score": 0.004084307764140389, "phrase": "wide_range"}, {"score": 0.0037480753312398754, "phrase": "usual_data_exchange_scenario"}, {"score": 0.003552084379143929, "phrase": "general_framework"}, {"score": 0.003526735797659508, "phrase": "data_exchange"}, {"score": 0.0032246835734680377, "phrase": "finite_descriptions"}, {"score": 0.0030779528295407925, "phrase": "classical_semantics"}, {"score": 0.0030017207229983385, "phrase": "logical_sentences"}, {"score": 0.0029590077170443666, "phrase": "meaningful_semantics"}, {"score": 0.0028446460307503343, "phrase": "standard_notions"}, {"score": 0.0027543636132088332, "phrase": "universal_solution"}, {"score": 0.0025182951088683863, "phrase": "query_language"}, {"score": 0.0022696277881969896, "phrase": "exchanging_problem"}, {"score": 0.0021049977753042253, "phrase": "computing_solutions"}], "paper_keywords": ["Algorithms", " Theory", " Data exchange", " knowledge exchange", " data integration", " representation system", " metadata management", " schema mapping"], "paper_abstract": "In the traditional data exchange setting, source instances are restricted to be complete in the sense that every fact is either true or false in these instances. Although natural for a typical database translation scenario, this restriction is gradually becoming an impediment to the development of a wide range of applications that need to exchange objects that admit several interpretations. In particular, we are motivated by two specific applications that go beyond the usual data exchange scenario: exchanging incomplete information and exchanging knowledge bases. In this article, we propose a general framework for data exchange that can deal with these two applications. More specifically, we address the problem of exchanging information given by representation systems, which are essentially finite descriptions of (possibly infinite) sets of complete instances. We make use of the classical semantics of mappings specified by sets of logical sentences to give a meaningful semantics to the notion of exchanging representatives, from which the standard notions of solution, space of solutions, and universal solution naturally arise. We also introduce the notion of strong representation system for a class of mappings, that resembles the concept of strong representation system for a query language. We show the robustness of our proposal by applying it to the two applications mentioned above: exchanging incomplete information and exchanging knowledge bases, which are both instantiations of the exchanging problem for representation systems. We study these two applications in detail, presenting results regarding expressiveness, query answering and complexity of computing solutions, and also algorithms to materialize solutions.", "paper_title": "Data Exchange Beyond Complete Data", "paper_id": "WOS:000324577800006"}