{"auto_keywords": [{"score": 0.027978842547789984, "phrase": "energy_function"}, {"score": 0.004816214760970976, "phrase": "blocks"}, {"score": 0.004704699244406775, "phrase": "physical_space"}, {"score": 0.004650519511749445, "phrase": "physical_laws"}, {"score": 0.003374655868348244, "phrase": "new_algorithm"}, {"score": 0.0033228699494959172, "phrase": "single_rgb-d_image"}, {"score": 0.0028687545730861665, "phrase": "depth_data"}, {"score": 0.0025643086619242814, "phrase": "block_representation"}, {"score": 0.0024574537875026634, "phrase": "depth_values"}, {"score": 0.002429090371567499, "phrase": "image_segments"}, {"score": 0.002265638487492082, "phrase": "complex_arrangements"}, {"score": 0.0022222152430170254, "phrase": "underlying_structure"}, {"score": 0.0021796224306652326, "phrase": "experimental_results"}, {"score": 0.002137847103548585, "phrase": "rgb-d"}, {"score": 0.0021049977753042253, "phrase": "volumetric_representation"}], "paper_keywords": ["Segmentation", " scene understanding", " computer vision"], "paper_abstract": "Objects occupy physical space and obey physical laws. To truly understand a scene, we must reason about the space that objects in it occupy, and how each objects is supported stably by each other. In other words, we seek to understand which objects would, if moved, cause other objects to fall. This 3D volumetric reasoning is important for many scene understanding tasks, ranging from segmentation of objects to perception of a rich 3D, physically well-founded, interpretations of the scene. In this paper, we propose a new algorithm to parse a single RGB-D image with 3D block units while jointly reasoning about the segments, volumes, supporting relationships, and object stability. Our algorithm is based on the intuition that a good 3D representation of the scene is one that fits the depth data well, and is a stable, self-supporting arrangement of objects (i.e., one that does not topple). We design an energy function for representing the quality of the block representation based on these properties. Our algorithm fits 3D blocks to the depth values corresponding to image segments, and iteratively optimizes the energy function. Our proposed algorithm is the first to consider stability of objects in complex arrangements for reasoning about the underlying structure of the scene. Experimental results show that our stability-reasoning framework improves RGB-D segmentation and scene volumetric representation.", "paper_title": "3D Reasoning from Blocks to Stability", "paper_id": "WOS:000352533000001"}