{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "systems_development_ambidexterity"}, {"score": 0.04877129670463601, "phrase": "formal_and_informal_controls"}, {"score": 0.04812988175391736, "phrase": "formal_and_informal_control_mechanisms"}, {"score": 0.0413995704929081, "phrase": "competing_theoretical_perspectives"}, {"score": 0.0047268728636719725, "phrase": "complementary_and_substitutive_roles"}, {"score": 0.004472146692254812, "phrase": "systems_development_projects"}, {"score": 0.004431041346291019, "phrase": "considerable_disagreement"}, {"score": 0.003468796799802612, "phrase": "competing_perspectives"}, {"score": 0.0033428820402140683, "phrase": "informal_and_formal_control_mechanisms"}, {"score": 0.00309023627455429, "phrase": "informal_control_mechanisms"}, {"score": 0.0030196181347744372, "phrase": "formal_behavior_control_mechanisms"}, {"score": 0.0028566300478906916, "phrase": "formal_outcome_control_mechanisms"}, {"score": 0.002765636101369536, "phrase": "key_contribution"}, {"score": 0.002640636493247601, "phrase": "control_mechanisms"}, {"score": 0.0026042472337367015, "phrase": "project's_control_portfolio"}, {"score": 0.002418453525649304, "phrase": "managers_guidance"}, {"score": 0.002266765479420981, "phrase": "formal_process-based_control_mechanisms"}, {"score": 0.0021945194903838132, "phrase": "project_goals"}, {"score": 0.002174303033371869, "phrase": "development_flexibility"}, {"score": 0.0021049977753042253, "phrase": "formal_outcome-based_control_mechanisms"}], "paper_keywords": ["ambidexterity", " control mechanisms", " interaction effects", " outsourcing", " project governance", " signaling", " software project control", " systems development"], "paper_abstract": "Although formal and informal control mechanisms are often simultaneously used to govern systems development projects, considerable disagreement exists about whether the use of one strengthens or diminishes the benefits of the other. In other words, are they complements or substitutes? Competing theoretical perspectives favor both sides of the argument, and neither the information systems (IS) controls literature nor the information technology (IT) outsourcing literature has addressed this issue. This study theoretically develops the idea that these competing perspectives are mutually compatible rather than contradictory because informal and formal control mechanisms can simultaneously be complements and substitutes. Using data from 120 outsourced systems development projects, it is shown that informal control mechanisms strengthen the influence of formal behavior control mechanisms on systems development ambidexterity (complementary effects) but weaken the influence of formal outcome control mechanisms (substitutive effects). The key contribution of the paper therefore lies in exploring interactions among control mechanisms in a project's control portfolio to reconcile the competing theoretical perspectives on whether formal and informal controls are complements or substitutes. The findings provide managers guidance on how to carefully combine formal and informal control mechanisms in a project. Combining informal with formal process-based control mechanisms can simultaneously enhance the fulfillment of project goals and development flexibility. However, combining informal with formal outcome-based control mechanisms can instead impair these objectives.", "paper_title": "Systems Development Ambidexterity: Explaining the Complementary and Substitutive Roles of Formal and Informal Controls", "paper_id": "WOS:000284138500004"}