{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "soa_migration"}, {"score": 0.009159085400954387, "phrase": "soa"}, {"score": 0.0047464608267006395, "phrase": "service_orientation"}, {"score": 0.004525088883501587, "phrase": "legacy_assets"}, {"score": 0.0032850648549389025, "phrase": "systematic_literature_review"}, {"score": 0.003087017178815267, "phrase": "research_community"}, {"score": 0.0030140547908298404, "phrase": "state-of-the-art_in_soa_migration_approaches"}, {"score": 0.002873247913129334, "phrase": "knowledge_elements"}, {"score": 0.002687070469080394, "phrase": "reference_model"}, {"score": 0.0024771000236931836, "phrase": "soa_migration_approaches"}, {"score": 0.002176747110119268, "phrase": "promising_future_research_directions"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["migration", " service orientation", " systematic literature review", " knowledge management"], "paper_abstract": "When Service Orientation was introduced as the solution for retaining and rehabilitating legacy assets, both researchers and practitioners proposed techniques, methods, and guidelines for SOA migration. With so much hype surrounding SOA, it is not surprising that the concept was interpreted in many different ways, and consequently, different approaches to SOA migration were proposed. Accordingly, soon there was an abundance of methods that were hard to compare and eventually adopt. Against this backdrop, this paper reports on a systematic literature review that was conducted to extract the categories of SOA migration proposed by the research community. We provide the state-of-the-art in SOA migration approaches, and discuss categories of activities carried out and knowledge elements used or produced in those approaches. From such categorization, we derive a reference model, called SOA migration frame of reference, that can be used for selecting and defining SOA migration approaches. As a co-product of the analysis, we shed light on how SOA migration is perceived in the field, which further points to promising future research directions. Copyright (c) 2015 John Wiley & Sons, Ltd.", "paper_title": "A systematic literature review on SOA migration", "paper_id": "WOS:000354364400002"}