{"auto_keywords": [{"score": 0.031143489006296914, "phrase": "facial_display"}, {"score": 0.010877362735923242, "phrase": "user_perceptions"}, {"score": 0.010787515453105814, "phrase": "affect_arousal"}, {"score": 0.010136659796745938, "phrase": "affect_valence"}, {"score": 0.00481495049065317, "phrase": "relational_agents"}, {"score": 0.0039737570920809215, "phrase": "animated_human_face"}, {"score": 0.003763763153640936, "phrase": "human_mannequin"}, {"score": 0.0036553070575015344, "phrase": "air_bladder"}, {"score": 0.0035947360742084253, "phrase": "user's_hand"}, {"score": 0.0034332736827447654, "phrase": "hand_squeeze_pressure"}, {"score": 0.0031448288291084, "phrase": "squeeze_duration"}, {"score": 0.0029909851863915283, "phrase": "affect-relevant_cues"}, {"score": 0.002346861891137455, "phrase": "affect_cues"}, {"score": 0.0022601535748259785, "phrase": "better_perceptions"}], "paper_keywords": ["Animations", " evaluation", " haptic I/O", " natural language", " user interfaces"], "paper_abstract": "We describe a series of experiments with an agent designed to model human conversational touch-capable of physically touching users in synchrony with speech and other nonverbal communicative behavior-and its use in expressing empathy to users in distress. The agent is composed of an animated human face that is displayed on a monitor affixed to the top of a human mannequin, with touch conveyed by an air bladder that squeezes a user's hand. We demonstrate that when touch is used alone, hand squeeze pressure and number of squeezes are associated with user perceptions of affect arousal conveyed by an agent, while number of squeezes and squeeze duration are associated with affect valence. We also show that, when affect-relevant cues are present in facial display, speech prosody, and touch used simultaneously by the agent, facial display dominates user perceptions of affect valence, and facial display and prosody are associated with affect arousal, while touch had little effect. Finally, we show that when touch is used in the context of an empathic, comforting interaction (but without the manipulation of affect cues in other modalities), it can lead to better perceptions of relationship with the agent, but only for users who are comfortable being touched by other people.", "paper_title": "Empathic Touch by Relational Agents", "paper_id": "WOS:000208757900007"}