{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "confluence_detection"}, {"score": 0.04911241438594345, "phrase": "labelled_transition_systems"}, {"score": 0.004598933498016774, "phrase": "complex_component_software_systems"}, {"score": 0.00437021209960886, "phrase": "abstract_model"}, {"score": 0.004216880725292, "phrase": "model_transformation"}, {"score": 0.004027586827290042, "phrase": "controlled_way"}, {"score": 0.003926105480202798, "phrase": "model_transformation_systems"}, {"score": 0.003438058620195309, "phrase": "unique_output_model"}, {"score": 0.002845984240785242, "phrase": "lts"}, {"score": 0.0027600360731762997, "phrase": "model_transformations"}, {"score": 0.002718045523483502, "phrase": "related_work"}, {"score": 0.0025826247025542213, "phrase": "general_graph_structures"}, {"score": 0.002392008392892289, "phrase": "special_cases"}, {"score": 0.002331641523873951, "phrase": "particular_structural_properties"}, {"score": 0.0021484955960643167, "phrase": "lts_transformation_systems"}], "paper_keywords": [""], "paper_abstract": "The development of complex component software systems can be made more manageable by first creating an abstract model and then incrementally adding details. Model transformation is an approach to add such details in a controlled way. In order for model transformation systems to be useful, it is crucial that they are confluent, i.e. that when applied on a given model, they will always produce a unique output model, independent of the order in which rules of the system are applied on the input. In this work, we consider Labelled Transition Systems (LTSs) to reason about the semantics of models, and LTS transformation systems to reason about model transformations. In related work, the problem of confluence detection has been investigated for general graph structures. We observe, however, that confluence can be detected more efficiently in special cases where the graphs have particular structural properties. In this paper, we present a number of observations to detect confluence of LTS transformation systems, and propose both a new confluence detection algorithm and a conflict resolution algorithm based on them.", "paper_title": "Confluence Detection for Transformations of Labelled Transition Systems", "paper_id": "WOS:000367334700001"}