{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uml_diagrams"}, {"score": 0.039896298229707874, "phrase": "software_maintenance"}, {"score": 0.014328599465269438, "phrase": "uml"}, {"score": 0.01360457244378082, "phrase": "empirical_evidence"}, {"score": 0.004762202897268383, "phrase": "code_maintenance"}, {"score": 0.004594713028452399, "phrase": "model-based_approaches"}, {"score": 0.00446987606516801, "phrase": "significant_resistance"}, {"score": 0.004445316841017889, "phrase": "model-based_development"}, {"score": 0.0039813976794342, "phrase": "practical_difference"}, {"score": 0.003778253716938922, "phrase": "forward_designed"}, {"score": 0.0037060428445111664, "phrase": "reverse_engineered"}, {"score": 0.0034024277222012597, "phrase": "individual_data_analysis"}, {"score": 0.0033373756615875517, "phrase": "whole_family"}, {"score": 0.003264547032549398, "phrase": "fd_diagrams"}, {"score": 0.003030247482854539, "phrase": "qualitative_data"}, {"score": 0.0029887355917821304, "phrase": "post-experiment_survey"}, {"score": 0.002828281528138126, "phrase": "objective_results"}, {"score": 0.0027437235598539904, "phrase": "maintenance_effectiveness"}, {"score": 0.0026764185202909395, "phrase": "fd_uml_diagrams"}, {"score": 0.0026470361470262637, "phrase": "subjective_opinions"}, {"score": 0.002518746501941657, "phrase": "design_phase"}, {"score": 0.002312174113289583, "phrase": "computer_science_undergraduate_students"}, {"score": 0.002286781334850213, "phrase": "small_systems"}, {"score": 0.0022679195103377124, "phrase": "well-known_domains"}, {"score": 0.002175913488493802, "phrase": "industrial_context"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software maintenance", " UML diagrams", " Reverse Engineering", " Maintainability", " Family of experiments", " Controlled experiment"], "paper_abstract": "Context: Although various success stories of model-based approaches are reported in literature, there is still a significant resistance to model-based development in many software organizations because the UML is perceived to be expensive and not necessarily cost-effective. It is also important to gather empirical evidence in which context and under which conditions the UML makes or does not make a practical difference. Objective: Our objective is to provide empirical evidence as to which UML diagrams are more helpful during software maintenance: Forward Designed (FD) UML diagrams or Reverse Engineered (RE) UML diagrams. Method: We carried out a family of experiments which consisted of one experiment and two replications with a total of 169 Computer Science undergraduate students. Results: The individual data analysis and the meta-analysis conducted on the whole family, show a tendency in favor of FD diagrams and are significantly different as regards the effectiveness and efficiency of the subjects who participated and played the role of maintainers. The analysis of the qualitative data, collected using a post-experiment survey, reveals that the subjects did not consider RE diagrams helpful. Conclusions: Our findings show that there are some objective results (descriptive statistics or statistical tests) related to the maintenance effectiveness and efficiency in favor of the use of FD UML diagrams during software maintenance. Subjective opinions also lead us to recommend the use of UML diagrams (especially class diagrams) created during the design phase for software maintenance because they improve the understanding of the system in comparison with RE diagrams. Nevertheless, we can only assume that these results are valid in the context of Computer Science undergraduate students when working with small systems related to well-known domains, and other contexts should be explored in order to reaffirm the results in an industrial context by carrying out replications with professionals. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Are Forward Designed or Reverse-Engineered UML diagrams more helpful for code maintenance?: A family of experiments", "paper_id": "WOS:000345947500036"}