{"auto_keywords": [{"score": 0.046493513028499536, "phrase": "pilot_implementations"}, {"score": 0.007740489563401459, "phrase": "health_information_systems"}, {"score": 0.005656635984942395, "phrase": "pilot_implementation"}, {"score": 0.004300453431933622, "phrase": "widely_used_approach"}, {"score": 0.004255121395629569, "phrase": "design_flaws"}, {"score": 0.00422516469733364, "phrase": "implementation_issues"}, {"score": 0.004195418010131832, "phrase": "full-scale_deployment"}, {"score": 0.004151188559520802, "phrase": "his."}, {"score": 0.003773449694108617, "phrase": "interpretive_case_study_approach"}, {"score": 0.003478813491904962, "phrase": "electronic_pregnancy_record"}, {"score": 0.0034178631156685777, "phrase": "denmark"}, {"score": 0.003334309053314909, "phrase": "semi-structured_interviews"}, {"score": 0.0032184697893776052, "phrase": "comprehensive_evaluation"}, {"score": 0.0031845067058084583, "phrase": "implementation_process"}, {"score": 0.003095674983836725, "phrase": "pilot_project"}, {"score": 0.0030199761431186434, "phrase": "namely_difficulties"}, {"score": 0.002946122903079259, "phrase": "appropriate_scope"}, {"score": 0.0028437313714204087, "phrase": "unanticipated_technical_and_practical_problems"}, {"score": 0.0027546167254869493, "phrase": "test_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Information systems", " Information systems development", " Computer systems development", " Computer systems evaluation", " Pilot studies", " Medical records systems, computerized", " Organizational case studies"], "paper_abstract": "Objectives: This study aims to explore the issues and challenges involved in designing and organizing pilot implementations of health information systems (HIS). Pilot implementations are a widely used approach for identifying design flaws and implementation issues before full-scale deployment of new HIS. However, it is not uncommon for pilot implementations to fail in the sense that little can be learned from them. Method: We employed an interpretive case study approach in attempting to throw light on the reasons why pilot implementations sometimes fail. We studied the (failed) pilot implementation of an electronic Pregnancy Record (ePR) in Denmark. Our primary data collection methods comprised participant observations, semi-structured interviews and document analyses. Results: Based on a comprehensive evaluation of the implementation process, we identify three major challenges that complicated the pilot project and eventually led to its failure, namely difficulties in (1) defining an appropriate scope for the pilot implementation, (2) coping with unanticipated technical and practical problems, and (3) ensuring commitment from test users and their managers. Conclusion: Pilot implementations are a very useful technique for developing HIS, but also one that is very difficult to do successfully. It is sometimes assumed that pilot implementations are less complicated and risky than regular, full-scale implementations. However, pilot implementations are not just small-scale versions of conventional implementations; they are fundamentally different and they have their own complications and issues to deal with that make them hard to design and manage. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Pilot implementation of health information systems: Issues and challenges", "paper_id": "WOS:000281675500004"}