{"auto_keywords": [{"score": 0.04624305326777518, "phrase": "invariant_subspace"}, {"score": 0.004715702140552199, "phrase": "hermitian_matrix"}, {"score": 0.0045547927862194856, "phrase": "iterative_algorithm"}, {"score": 0.004308630865024719, "phrase": "algebraically_smallest_eigenvalues"}, {"score": 0.004219774794569897, "phrase": "large_sparse_or_structured_hermitian_matrix_a."}, {"score": 0.0031956012520298082, "phrase": "rayleigh-ritz"}, {"score": 0.002939737235379635, "phrase": "preconditioned_conjugate_gradient"}, {"score": 0.002879029968532794, "phrase": "davidson_algorithm"}, {"score": 0.0027806165169981622, "phrase": "block_algorithm"}, {"score": 0.002540160379502092, "phrase": "multiple_levels"}, {"score": 0.0023859534478427313, "phrase": "practical_issues"}, {"score": 0.002164432930854161, "phrase": "high_performance_computer"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Preconditioned eigenvalue solvers", " Density functional theory based electronic structure calculations"], "paper_abstract": "We present an iterative algorithm for computing an invariant subspace associated with the algebraically smallest eigenvalues of a large sparse or structured Hermitian matrix A. We are interested in the case in which the dimension of the invariant subspace is large (e.g., over several hundreds or thousands) even though it may still be small relative to the dimension of A. These problems arise from, for example, density functional theory (DFT) based electronic structure calculations for complex materials. The key feature of our algorithm is that it performs fewer Rayleigh-Ritz calculations compared to existing algorithms such as the locally optimal block preconditioned conjugate gradient or the Davidson algorithm. It is a block algorithm, and hence can take advantage of efficient BLAS3 operations and be implemented with multiple levels of concurrency. We discuss a number of practical issues that must be addressed in order to implement the algorithm efficiently on a high performance computer. Published by Elsevier Inc.", "paper_title": "A projected preconditioned conjugate gradient algorithm for computing many extreme eigenpairs of a Hermitian matrix", "paper_id": "WOS:000351833400004"}