{"auto_keywords": [{"score": 0.011316586153892423, "phrase": "gene_sharing"}, {"score": 0.008396656259127758, "phrase": "hgt."}, {"score": 0.00481495049065317, "phrase": "horizontal_gene_transfer"}, {"score": 0.004568114160421233, "phrase": "hgt"}, {"score": 0.004472935829694716, "phrase": "crucial_role"}, {"score": 0.004356741449157895, "phrase": "prokaryotic_species"}, {"score": 0.003028969851366049, "phrase": "new_improved_method"}, {"score": 0.002798662730881037, "phrase": "simulated_datasets"}, {"score": 0.0024272350606639147, "phrase": "published_dataset"}, {"score": 0.002242577809454225, "phrase": "first_time"}, {"score": 0.0021957487795963666, "phrase": "accurate_highway_analysis"}, {"score": 0.0021273284545701896, "phrase": "large_datasets"}, {"score": 0.0021049977753042253, "phrase": "high_rates"}], "paper_keywords": [""], "paper_abstract": "Motivation: Horizontal gene transfer (HGT) plays a crucial role in the evolution of prokaryotic species. Typically, no more than a few genes are horizontally transferred between any two species. However, several studies identified pairs of species (or linages) between which many different genes were horizontally transferred. Such a pair is said to be linked by a highway of gene sharing. Inferring such highways is crucial to understanding the evolution of prokaryotes and for inferring past symbiotic and ecological associations among different species. Results: We present a new improved method for systematically detecting highways of gene sharing. As we demonstrate using a variety of simulated datasets, our method is highly accurate and efficient, and robust to noise and high rates of HGT. We further validate our method by applying it to a published dataset of > 22 000 gene trees from 144 prokaryotic species. Our method makes it practical, for the first time, to perform accurate highway analysis quickly and easily even on large datasets with high rates of HGT.", "paper_title": "Systematic inference of highways of horizontal gene transfer in prokaryotes", "paper_id": "WOS:000315623000005"}