{"auto_keywords": [{"score": 0.031653507648654204, "phrase": "ippr"}, {"score": 0.015173255815369994, "phrase": "online_companies"}, {"score": 0.012266393962458943, "phrase": "six_types"}, {"score": 0.012179617962260688, "phrase": "behavioral_responses"}, {"score": 0.010343041506126546, "phrase": "nomological_model"}, {"score": 0.00936222194729157, "phrase": "ippr."}, {"score": 0.007533165080810013, "phrase": "information_privacy_threats"}, {"score": 0.00481495049065317, "phrase": "internet_users"}, {"score": 0.004679134285953932, "phrase": "privacy_threats"}, {"score": 0.004482526999029664, "phrase": "complex_nature"}, {"score": 0.0038708031633013086, "phrase": "information_privacy-protective_responses"}, {"score": 0.003616252896285766, "phrase": "negative_word"}, {"score": 0.0034271313706984658, "phrase": "third-party_organizations"}, {"score": 0.0030779528295407925, "phrase": "perceived_justice"}, {"score": 0.0030450484042676023, "phrase": "societal_benefits"}, {"score": 0.002695768552609587, "phrase": "discernible_patterns"}, {"score": 0.0022696277881969896, "phrase": "fairly_systematic_manner"}, {"score": 0.0022054488653549175, "phrase": "researchers'_theory-building_efforts"}, {"score": 0.0021662599012740127, "phrase": "information_privacy"}, {"score": 0.0021430808503936963, "phrase": "new_ground"}, {"score": 0.0021049977753042253, "phrase": "individuals'_responses"}], "paper_keywords": ["information privacy", " responses to information privacy threats", " information privacy concerns", " ethical issues", " structural equation modeling", " causal model"], "paper_abstract": "Although Internet users are expected to respond in various ways to privacy threats from online companies, little attention has been paid so far to the complex nature of how users respond to these threats. This paper has two specific goals in its effort to fill this gap in the literature. The first, so that these outcomes can be systematically investigated, is to develop a taxonomy of information privacy-protective responses (IPPR). This taxonomy consists of six types of behavioral responses-refusal, misrepresentation, removal, negative word-of-mouth, complaining directly to online companies, and complaining indirectly to third-party organizations-that are classified into three categories: information provision, private action, and public action. Our second goal is to develop a nomological model with several salient antecedents-concerns for information privacy, perceived justice, and societal benefits from complaining-of IPPR, and to show how the antecedents differentially affect the six types of IPPR. The nomological model is tested with data collected from 523 Internet users. The results indicate that some discernible patterns emerge in the relationships between the antecedents and the three groups of IPPR. These patterns enable researchers to better understand why a certain type of IPPR is similar to or distinct from other types of IPPR Such an understanding could enable researchers to analyze a variety of behavioral responses to information privacy threats in a fairly systematic manner. Overall, this paper contributes to researchers' theory-building efforts in the area of information privacy by breaking new ground for the study of individuals' responses to information privacy threats.", "paper_title": "Internet users' information privacy-protective responses: A taxonomy and a nomological model", "paper_id": "WOS:000258859700004"}