{"auto_keywords": [{"score": 0.039041475324239176, "phrase": "boundary_objects"}, {"score": 0.023027782536146534, "phrase": "information_infrastructures"}, {"score": 0.01038306089653352, "phrase": "organisational_identities"}, {"score": 0.004371160978838441, "phrase": "collaborative_cross-organisational_practices"}, {"score": 0.00395069818358908, "phrase": "shared_understandings"}, {"score": 0.00376409764683147, "phrase": "shared_artefacts"}, {"score": 0.003539252646181146, "phrase": "translation_devices"}, {"score": 0.0028652153774536967, "phrase": "three-dimensional_modelling_technologies"}, {"score": 0.002693919110230191, "phrase": "case_studies"}, {"score": 0.0025778546800417808, "phrase": "cross-organisational_communication"}, {"score": 0.0021236300589450143, "phrase": "shared_boundary_objects"}, {"score": 0.0021049977753042253, "phrase": "boundary_practices"}], "paper_keywords": ["boundary objects", " boundary practices", " information infrastructures", " organisational identities", " organisational change"], "paper_abstract": "In recent years, more companies engage in collaborative cross-organisational practices to achieve their business objectives. To cooperate effectively across boundaries requires organisations to overcome the tension between their distinct backgrounds and the need to create shared understandings with their partners for collaboration. This requires the creation of shared artefacts such as boundary objects. Whereas the past work on boundary objects has highlighted their role as translation devices, we examine them in relation to the information infrastructures within which they are embedded, and the identities of the organisations that use them. We propose a model that outlines the relationships among the three concepts and illustrate its dynamics by presenting two case studies that describe the introduction of three-dimensional modelling technologies into the architecture, engineering, and construction industry. Based on the case studies we suggest that boundary objects, in addition to facilitating cross-organisational communication, also help to form organisational identities. We further suggest the occurrence of a process whereby changes in boundary objects enable changes in information infrastructures and identities in one organisation. These changes, in turn, create the conditions for change in bordering organisations through shared boundary objects and boundary practices.", "paper_title": "The dynamics of IT boundary objects, information infrastructures, and organisational identities: the introduction of 3D modelling technologies into the architecture, engineering, and construction industry", "paper_id": "WOS:000258072300008"}