{"auto_keywords": [{"score": 0.049643973872019624, "phrase": "nonholonomic-wheeled_mobile_robots"}, {"score": 0.00481495049065317, "phrase": "decentralized_connectivity_preservation"}, {"score": 0.004621148492564008, "phrase": "mobile_robot_networks"}, {"score": 0.004475798524102238, "phrase": "existing_algorithms"}, {"score": 0.003711409222544974, "phrase": "algebraic_graph_connectivity"}, {"score": 0.0035133644847622383, "phrase": "laplacian_l"}, {"score": 0.003356396922662246, "phrase": "amonotonic_increase"}, {"score": 0.0031917943932454314, "phrase": "previous_work"}, {"score": 0.003105428650735113, "phrase": "continuous_feedback_control_method"}, {"score": 0.0027322025124213566, "phrase": "entire_network"}, {"score": 0.002551022760887132, "phrase": "connectivity_controller"}, {"score": 0.0023386327847292805, "phrase": "artificial_potential-based_formation_controllers"}, {"score": 0.0021049977753042253, "phrase": "wheeled_mobile_robots"}], "paper_keywords": ["Connectivity control", " decentralized control", " multi-robot systems"], "paper_abstract": "The preservation of connectivity in mobile robot networks is critical to the success ofmost existing algorithms designed to achieve various goals. The most basic method to preserve connectivity is to have each agent preserve its set of neighbors for all time. More advanced methods preserve a (minimum) spanning tree in the network. Other methods are based on increasing the algebraic graph connectivity, which is given by the second smallest eigenvalue lambda(2)(L) of the graph Laplacian L that represents the network. Thesemethods typically result in amonotonic increase in connectivity until the network is completely connected. In previous work by the authors, a continuous feedback control method had been proposed which allows the connectivity to decrease, that is, edges in the network may be broken. This method requires agents to have knowledge of the entire network. In this paper, we modify the controller to use only local information. The connectivity controller is based on maximization of lambda(2)(L) and artificial potential functions and can be used in conjunction with artificial potential-based formation controllers. The controllers are extended for implementation on nonholonomic-wheeled mobile robots, and the performance is demonstrated in an experiment on a team of wheeled mobile robots.", "paper_title": "Collision-Free Formation Control with Decentralized Connectivity Preservation for Nonholonomic-Wheeled Mobile Robots", "paper_id": "WOS:000365085700003"}