{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hierarchical_multi-way_dataflow_constraint_systems"}, {"score": 0.029111190601923756, "phrase": "specialized_planners"}, {"score": 0.024835859660911497, "phrase": "constraint_systems"}, {"score": 0.004388035083357706, "phrase": "constraint_system"}, {"score": 0.00413096972023037, "phrase": "\"best\"_subset"}, {"score": 0.003888905257972882, "phrase": "multi-way_dataflow_constraint_system"}, {"score": 0.003747020072136732, "phrase": "user-defined_functions"}, {"score": 0.002874870266177579, "phrase": "potential_application"}, {"score": 0.0028482561434303886, "phrase": "program_specialization"}, {"score": 0.0024091057723923857, "phrase": "general_purpose_planner"}, {"score": 0.0022995854132747233, "phrase": "user_interface_programming"}, {"score": 0.0021848422732893926, "phrase": "user_interaction-specialized_planners"}, {"score": 0.0021246816854197732, "phrase": "guis'_responses"}, {"score": 0.0021049977753042253, "phrase": "user_interaction"}], "paper_keywords": ["Dataflow constraint systems", " user interfaces", " DFAs", " program specialization", " Algorithms", " Theory"], "paper_abstract": "A constraint system consists of variables and a set of constraints on those variables. To solve a constraint system is to find a valuation that satisfies all constraints; or the \"best\" subset of constraints if not all can simultaneously be satisfied. In a multi-way dataflow constraint system, solving requires selecting a set of user-defined functions which, when executed, will enforce the constraints. The task of selecting these functions is called planning. The planner has two kinds of input: the specification of the constraints and an order of priority for those constraints. The former typically changes seldom, while the latter frequently, making constraint planning a potential application for program specialization. This paper shows how to generate specialized planners for hierarchical multi-way dataflow constraint systems when the constraints are known in advance. The specialized planners are DFAs; they can be an order of magnitude or more faster than a general purpose planner for the same system. Our applications for constraint systems are in user interface programming, where constraint systems determine how a GUI should react to user interaction-specialized planners can help to ensure that GUIs' responses to user interaction are instantaneous.", "paper_title": "Specializing Planners for Hierarchical Multi-way Dataflow Constraint Systems", "paper_id": "WOS:000357124200001"}