{"auto_keywords": [{"score": 0.048534495128882256, "phrase": "spoken_systems"}, {"score": 0.013986395475240136, "phrase": "natural_referring_expressions"}, {"score": 0.012522993096132142, "phrase": "discourse_context"}, {"score": 0.008468585388724621, "phrase": "cognitive_load"}, {"score": 0.00481495049065317, "phrase": "natural_discourse_reference_generation"}, {"score": 0.004392565073466714, "phrase": "central_topic"}, {"score": 0.00433531459712787, "phrase": "computational_linguistics"}, {"score": 0.0041136473765874815, "phrase": "'the_baseball_cap"}, {"score": 0.003703611021999795, "phrase": "practical_implications"}, {"score": 0.0035605741849764187, "phrase": "expression_generation"}, {"score": 0.0028480459059007468, "phrase": "dual-task_paradigm"}, {"score": 0.0021049977753042253, "phrase": "referring_expression_generation"}], "paper_keywords": [""], "paper_abstract": "The generation of referring expressions is a central topic in computational linguistics. Natural referring expressions - both definite references like 'the baseball cap' and pronouns like 'it' - are dependent on discourse context. We examine the practical implications of context-dependent referring expression generation for the design of spoken systems. Currently, not all spoken systems have the goal of generating natural referring expressions. Many researchers believe that the context-dependency of natural referring expressions actually makes systems less usable. Using the dual-task paradigm, we demonstrate that generating natural referring expressions that are dependent on discourse context reduces cognitive load. Somewhat surprisingly, we also demonstrate that practice does not improve cognitive load in systems that generate consistent (context-independent) referring expressions. We discuss practical implications for spoken systems as well as other areas of referring expression generation.", "paper_title": "Natural discourse reference generation reduces cognitive load in spoken systems", "paper_id": "WOS:000292277800002"}