{"auto_keywords": [{"score": 0.04526611338914748, "phrase": "prism"}, {"score": 0.011544036888877143, "phrase": "possibilistic_logic_programs"}, {"score": 0.009506420124550368, "phrase": "restricted_plp"}, {"score": 0.009407053080156179, "phrase": "pita"}, {"score": 0.009284274474445502, "phrase": "answer_subsumption"}, {"score": 0.004689519124264954, "phrase": "logic_programs"}, {"score": 0.004591519902403534, "phrase": "probabilistic_logic_programming"}, {"score": 0.004413233203505802, "phrase": "annotated_disjunctions"}, {"score": 0.004355351995114594, "phrase": "problog"}, {"score": 0.004230652134869403, "phrase": "similar_distribution_semantics"}, {"score": 0.003970789286139509, "phrase": "general_plp_programs"}, {"score": 0.0037268284687939643, "phrase": "prism_system"}, {"score": 0.0035443310416417772, "phrase": "entirely_different_alternative"}, {"score": 0.003497803692581353, "phrase": "simpler_metric"}, {"score": 0.0034065726426476687, "phrase": "plp"}, {"score": 0.0033796614187448, "phrase": "possibilistic_logic_programming-"}, {"score": 0.0033352884949505537, "phrase": "different_domains"}, {"score": 0.0031802999916222792, "phrase": "model_problems"}, {"score": 0.0030085317219673046, "phrase": "pita_system"}, {"score": 0.0029611763591093727, "phrase": "general_plp_language"}, {"score": 0.002764435340592953, "phrase": "api"}, {"score": 0.002749826087585011, "phrase": "library_functions"}, {"score": 0.0026012484330695377, "phrase": "exc"}, {"score": 0.002500047699177405, "phrase": "discriminating_arguments"}, {"score": 0.002467194985250203, "phrase": "viterbi_paths"}, {"score": 0.0023837794149995533, "phrase": "complex_queries"}, {"score": 0.002371198394503181, "phrase": "hidden_markov_model_examples"}, {"score": 0.00223119159012786, "phrase": "different_explanations"}, {"score": 0.002161450631294569, "phrase": "possibilistic_logic_programming"}, {"score": 0.0021330378508881147, "phrase": "supported_package"}, {"score": 0.002104998245537197, "phrase": "xsb."}], "paper_keywords": ["Probabilistic Logic Programming", " Possibilistic Logic Programming", " Tabling", " Answer Subsumption", " Program Transformation"], "paper_abstract": "Many real world domains require the representation of a measure of uncertainty. The most common such representation is probability, and the combination of probability with logic programs has given rise to the field of Probabilistic Logic Programming (PLP), leading to languages such as the Independent Choice Logic, Logic Programs with Annotated Disjunctions (LPADs), Problog, PRISM, and others. These languages share a similar distribution semantics, and methods have been devised to translate programs between these languages. The complexity of computing the probability of queries to these general PLP programs is very high due to the need to combine the probabilities of explanations that may not be exclusive. As one alternative, the PRISM system reduces the complexity of query answering by restricting the form of programs it can evaluate. As an entirely different alternative, Possibilistic Logic Programs adopt a simpler metric of uncertainty than probability. Each of these approaches-general PLP, restricted PLP, and Possibilistic Logic Programming-can be useful in different domains depending on the form of uncertainty to be represented, on the form of programs needed to model problems, and on the scale of the problems to be solved. In this paper, we show how the PITA system, which originally supported the general PLP language of LPADs, can also efficiently support restricted PLP and Possibilistic Logic Programs. PITA relies on tabling with answer subsumption and consists of a transformation along with an API for library functions that interface with answer subsumption. We show that, by adapting its transformation and library functions, PITA can be parameterized to PITA(IND,EXC) which supports the restricted PLP of PRISM, including optimizations that reduce non-discriminating arguments and the computation of Viterbi paths. Furthermore, we show PITA to be competitive with PRISM for complex queries to Hidden Markov Model examples, and sometimes much faster. We further show how PITA can be parameterized to PITA(COUNT) which computes the number of different explanations for a subgoal, and to PITA(POSS) which scalably implements Possibilistic Logic Programming. PITA is a supported package in version 3.3 of XSB.", "paper_title": "The PITA system: Tabling and answer subsumption for reasoning under uncertainty", "paper_id": "WOS:000292701100002"}