{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "propagation_effects"}, {"score": 0.013054820368415215, "phrase": "security_risk_analysis"}, {"score": 0.004625255533545965, "phrase": "newly_developed_information_systems"}, {"score": 0.003902992784453769, "phrase": "information_security_technology"}, {"score": 0.003666217992454448, "phrase": "actual_causes"}, {"score": 0.003397866151093552, "phrase": "different_assets"}, {"score": 0.003367611042980526, "phrase": "complicated_networks"}, {"score": 0.0032492519841546682, "phrase": "comprehensive_preventive_measures"}, {"score": 0.0025863375961196005, "phrase": "real-time_comprehensive_methods"}, {"score": 0.0023437863565921053, "phrase": "modeling_technique"}, {"score": 0.002322895056238477, "phrase": "information_systems"}, {"score": 0.002251228471929216, "phrase": "petri-net"}, {"score": 0.0021049977753042253, "phrase": "epidemic_model"}], "paper_keywords": ["risk analysis", " intrusion", " damage propagation", " safeguard", " epidemic"], "paper_abstract": "The number of newly developed information systems has grown considerably in their areas of application, and their concomitant threats of intrusions for the systems over the Internet have increased, too. To reduce the possibilities of such threats, studies on security risk analysis in the field of information security technology have been actively conducted. However, it is very difficult to analyze actual causes of damage or to establish safeguards when intrusions on systems take place within the structure of different assets and complicated networks. Therefore, it is essential that comprehensive preventive measures against intrusions are established in advance through security risk analysis. Vulnerabilities and threats are increasing continuously, while safeguards against these risks are generally only realized some time after damage through an intrusion has occurred. Therefore, it is vital that the propagation effects and levels of damage are analyzed using real-time comprehensive methods in order to predict damage in advance and minimize the extent of the damage. For this reason we propose a modeling technique for information systems by making use of SPICE and Petri-Net, and methods for analyzing the propagation effects and levels of damage based on the epidemic model.", "paper_title": "Information system modeling for analysis of propagation effects and levels of damage", "paper_id": "WOS:000237648300007"}