{"auto_keywords": [{"score": 0.049505168345722585, "phrase": "sybil_attack"}, {"score": 0.00481495049065317, "phrase": "neighbor_similarity_trust"}, {"score": 0.004293584349522444, "phrase": "passive_and_active_attacks"}, {"score": 0.004116012194714212, "phrase": "potential_business_firms"}, {"score": 0.003922011960904278, "phrase": "best_benefit"}, {"score": 0.0038284549148537373, "phrase": "minimal_losses"}, {"score": 0.003626000977962191, "phrase": "trading_peers"}, {"score": 0.003080449000295983, "phrase": "bogus_and_multiple_identities"}, {"score": 0.002899861600151726, "phrase": "social_networks"}, {"score": 0.0027133856739937133, "phrase": "sybil_attack_peers"}, {"score": 0.0025853238923610076, "phrase": "neighbor_similarity_trust_relationship"}, {"score": 0.002389956401870098, "phrase": "neighbor_peers"}, {"score": 0.002209319719984651, "phrase": "performance_analysis"}], "paper_keywords": ["P2P", " trust", " Sybil attack", " collusion attack", " neighbor similarity"], "paper_abstract": "Peer to peer (P2P) e-commerce applications exist at the edge of the Internet with vulnerabilities to passive and active attacks. These attacks have pushed away potential business firms and individuals whose aim is to get the best benefit in e-commerce with minimal losses. The attacks occur during interactions between the trading peers as a transaction takes place. In this paper, we propose how to address Sybil attack, an active attack, in which peers can have bogus and multiple identities to fake their owns. Most existing work, which concentrates on social networks and trusted certification, has not been able to prevent Sybil attack peers from doing transactions. Our work exploits the neighbor similarity trust relationship to address Sybil attack. In our approach, duplicated Sybil attack peers can be identified as the neighbor peers become acquainted and hence more trusted to each other. Security and performance analysis shows that Sybil attack can be minimized by our proposed neighbor similarity trust.", "paper_title": "Neighbor Similarity Trust against Sybil Attack in P2P E-Commerce", "paper_id": "WOS:000349769500018"}