{"auto_keywords": [{"score": 0.04766724089045989, "phrase": "uncanny_valley"}, {"score": 0.004814962290280519, "phrase": "avatar"}, {"score": 0.004725385523804256, "phrase": "human's_job"}, {"score": 0.004637478829869904, "phrase": "authority_persists"}, {"score": 0.004487541157100498, "phrase": "physical_appearance"}, {"score": 0.00444559516711374, "phrase": "social_influence"}, {"score": 0.00440403952059725, "phrase": "human_communication"}, {"score": 0.004123781267600542, "phrase": "computer-animated_characters"}, {"score": 0.003701401653850141, "phrase": "greatest_risk"}, {"score": 0.0033851984021896287, "phrase": "previous_studies"}, {"score": 0.003306559295382181, "phrase": "left_side"}, {"score": 0.0031695693589575916, "phrase": "low_human_likeness"}, {"score": 0.003081400693055518, "phrase": "higher_human_realism"}, {"score": 0.0030097975788892896, "phrase": "factorial_experiment"}, {"score": 0.0028312983170567948, "phrase": "hypothetical_ethical_dilemma"}, {"score": 0.0027395968397212053, "phrase": "authority_figure"}, {"score": 0.0023346234464901978, "phrase": "sensitive_information"}, {"score": 0.0022168460543913787, "phrase": "ethical_dilemma"}, {"score": 0.0021652891317252994, "phrase": "animated_depiction"}, {"score": 0.0021049977753042253, "phrase": "human_depiction"}], "paper_keywords": [""], "paper_abstract": "Just as physical appearance affects social influence in human communication, it may also affect the processing of advice conveyed through avatars, computer-animated characters, and other human-like interfaces. Although the most persuasive computer interfaces are often the most human-like, they have been predicted to incur the greatest risk of falling into the uncanny valley, the loss of empathy attributed to characters that appear eerily human. Previous studies compared interfaces on the left side of the uncanny valley, namely, those with low human likeness. To examine interfaces with higher human realism, a between-groups factorial experiment was conducted through the internet with 426 midwestern U.S. undergraduates. This experiment presented a hypothetical ethical dilemma followed by the advice of an authority figure. The authority was manipulated in three ways: depiction (digitally recorded or computer animated), motion quality (smooth or jerky), and advice (disclose or refrain from disclosing sensitive information). Of these, only the advice changed opinion about the ethical dilemma, even though the animated depiction was significantly eerier than the human depiction. These results indicate that compliance with an authority persists even when using an uncannily realistic computer-animated double.", "paper_title": "Sending an Avatar to Do a Human's Job: Compliance with Authority Persists Despite the Uncanny Valley", "paper_id": "WOS:000354485200002"}