{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "journal_impact_factors"}, {"score": 0.004627944735913613, "phrase": "accepted_indicator"}, {"score": 0.004575854901681043, "phrase": "ranking_journals"}, {"score": 0.004132546937996706, "phrase": "sole_ranking_criteria"}, {"score": 0.0037745459666402915, "phrase": "immediacy_index"}, {"score": 0.0037320255482878365, "phrase": "citation_half-life"}, {"score": 0.0032575241721857343, "phrase": "great_degree"}, {"score": 0.002859345731792013, "phrase": "available_data_results"}, {"score": 0.0028271058251633815, "phrase": "multiple_different_rankings"}, {"score": 0.002656158309155626, "phrase": "statistical_standard_scores"}, {"score": 0.0024395426929046415, "phrase": "impact_factors"}, {"score": 0.002398382089724878, "phrase": "different_journals"}, {"score": 0.0021049977753042253, "phrase": "thomson_reuters"}], "paper_keywords": ["Journal quality measure", " Bibliometrics", " Relative measurement index", " Journal impact"], "paper_abstract": "Journal impact factors (JIF) have been an accepted indicator of ranking journals. However, there has been increasing arguments against the fairness of using the JIF as the sole ranking criteria. This resulted in the creation of many other quality metric indices such as the h-index, g-index, immediacy index, Citation Half-Life, as well as SCIMago journal rank (SJR) to name a few. All these metrics have their merits, but none include any great degree of normalization in their computations. Every citation and every publication is taken as having the same importance and therefore weight. The wealth of available data results in multiple different rankings and indexes existing. This paper proposes the use of statistical standard scores or z-scores. The calculation of the z-scores can be performed to normalize the impact factors given to different journals, the average of z-scores can be used across various criteria to create a unified relative measurement (RM) index score. We use the 2008 JCR provided by Thomson Reuters to demonstrate the differences in rankings that would be affected if the RM-index was adopted discuss the fairness that this index would provide to the journal quality ranking.", "paper_title": "Relative measure index: a metric to measure the quality of journals", "paper_id": "WOS:000310230400005"}