{"auto_keywords": [{"score": 0.041439091134021215, "phrase": "optimal_solutions"}, {"score": 0.034102752921677, "phrase": "equivalence_classes"}, {"score": 0.00481495049065317, "phrase": "solution_space"}, {"score": 0.0045324756541157574, "phrase": "comparative_genomics"}, {"score": 0.004301046274139699, "phrase": "evolutionary_scenarios"}, {"score": 0.004266501496765747, "phrase": "large-scale_genomic_mutations"}, {"score": 0.004147756103284082, "phrase": "main_problems"}, {"score": 0.003765067028482197, "phrase": "bergeron_et_al"}, {"score": 0.003403801095792972, "phrase": "complete_list"}, {"score": 0.0032559935867182035, "phrase": "group_solutions"}, {"score": 0.002838387600282891, "phrase": "open_problem"}, {"score": 0.0024149629835339926, "phrase": "better_theoretical_and_practical_complexity"}, {"score": 0.002385872451981323, "phrase": "complete_enumeration_method"}, {"score": 0.0021392979397427984, "phrase": "possible_scenarios"}, {"score": 0.0021049977753042253, "phrase": "mammalian_sex_chromosomes"}], "paper_keywords": ["computational biology", " genome rearrangements", " signed permutations", " sorting by reversals", " common intervals", " perfect", " sorting evolution"], "paper_abstract": "In comparative genomics, algorithms that sort permutations by reversals are often used to propose evolutionary scenarios of large-scale genomic mutations between species. One of the main problems of such methods is that they give one solution while the number of optimal solutions is huge, with no criteria to discriminate among them. Bergeron et al. started to give some structure to the set of optimal solutions, in order to be able to deliver more presentable results than only one solution or a complete list of all solutions. The structure is a way to group solutions into equivalence classes, and to identify in each class one particular representative. However, the design of an algorithm to compute this set of representatives without enumerating all solutions was stated to be an open problem. We propose, in this paper, an answer to this problem, that is, an algorithm which gives one representative for each class of solutions and counts the number of solutions in each class, with a better theoretical and practical complexity than the complete enumeration method. We give an example of how to reduce the number of equivalence classes obtained, using further constraints. Finally, we apply our algorithm to analyze the possible scenarios of rearrangements between mammalian sex chromosomes.", "paper_title": "Exploring the solution space of sorting by reversals, with experiments and an application to evolution", "paper_id": "WOS:000257981800004"}