{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pyridine_derivates"}, {"score": 0.004757849078050144, "phrase": "ikb_kinase_beta"}, {"score": 0.004673458200854065, "phrase": "serine-threonine_protein_kinase"}, {"score": 0.004563250218021092, "phrase": "transcription_factor"}, {"score": 0.0038956940500396086, "phrase": "previous_structure-activity_relationship_studies"}, {"score": 0.0036129455491136883, "phrase": "phase"}, {"score": 0.0035725770197245392, "phrase": "training_set"}, {"score": 0.0034986714994770995, "phrase": "five_orders"}, {"score": 0.0032859724984346966, "phrase": "seven_molecules"}, {"score": 0.003256657868307919, "phrase": "resulting_models"}, {"score": 0.0026578445199569893, "phrase": "second_test_set"}, {"score": 0.0023094564983770563, "phrase": "previous_structural-activity_studies"}], "paper_keywords": ["Phase", " Pharmacophore", " NF-kappa beta pathway", " Inflammation", " Structure-activity relationships"], "paper_abstract": "IkB kinase beta (IKK-2) is a serine-threonine protein kinase that is critically involved in activating the transcription factor NF-kappa beta in response to various inflammatory stimuli (hence, the interest in synthesizing molecules that can inhibit IKK-2). Some pyridine derivates have been shown to be among the most potent IKK-2 inhibitors known at present. This study reports how pyridine derivates have been used to develop a 3D-QSAR model for rationalizing results from previous structure-activity relationship studies on IKK-2 inhibition by these molecules; and predicting the IC(50) of other pyridine-derivate IKK-2 inhibitors whose activity is unknown. Therefore, 3D-QSAR models were built with PHASE and a training set of 21 molecules with IC50 values that span five orders of magnitude (ranging from 0.004 to more than 20 mu M) and in which each order of magnitude had from two to seven molecules. The resulting models were validated with a test set made up of 16 molecules of known IC(50). Only 3 out of 1245 3D-QSAR models had statistical parameter values in the following ranges: a) R(2), Q(2) and r-Pearson value >= 0.8000; b) RMSE/SD in the [0.90-1.05] interval; c) Q(2)/R(2)approximate to 1; and d) P<0.05 (statistical significance). Moreover, a second test set (consisting of 63 molecules whose activity has been reported in the form of the IC(50) interval to which it belongs) was used for selecting which of the three remaining 3D-QSAR models makes the best predictions. The best 3D-QSAR model obtained is associated with a pharmacophore that contains all the characteristics that previous structural-activity studies have reported to be essential if IKK-2 is to be inhibited by these ligands. Therefore, it is concluded that this 3D-QSAR model can be used to reliably predict how other pyridine derivates inhibit IKK-2.", "paper_title": "3D-QSAR Study of Pyridine Derivates as IKK-2 Inhibitors", "paper_id": "WOS:000268267100007"}