{"auto_keywords": [{"score": 0.049498146181447, "phrase": "mobile_content_sharing_games"}, {"score": 0.03227078104988102, "phrase": "task_performance"}, {"score": 0.00481495049065317, "phrase": "understanding_motivations"}, {"score": 0.004717960684395242, "phrase": "purpose_-_applications_blending_games"}, {"score": 0.004366808573435364, "phrase": "users'_motivations"}, {"score": 0.003740679163860117, "phrase": "user_study"}, {"score": 0.003433909720151841, "phrase": "interview_responses"}, {"score": 0.0031393948330209255, "phrase": "findings_-_motivations"}, {"score": 0.0030262967460085366, "phrase": "exploratory_play"}, {"score": 0.0030017207229983385, "phrase": "killing_time"}, {"score": 0.0028467558213723697, "phrase": "competitive_play"}, {"score": 0.00260246764210499, "phrase": "mobile_content_sharing_systems"}, {"score": 0.002560352786969071, "phrase": "mutually_beneficial_ecology"}, {"score": 0.002539550974361945, "phrase": "content_sharing"}, {"score": 0.002508663916554954, "phrase": "-_prior_work"}, {"score": 0.002350152413458658, "phrase": "actual_use"}, {"score": 0.0022196745041124888, "phrase": "incorporating_games"}, {"score": 0.0021309254505358253, "phrase": "\"cold-start\"_problem"}], "paper_keywords": ["Mobile content sharing", " Games", " Motivation (psychology)", " Mobile phone", " User studies", " Mobile technology", " Mobile networks"], "paper_abstract": "Purpose - Applications blending games with mobile content sharing have garnered much interest recently. In this paper, the authors aim to examine users' motivations for seeking and creating content in the context of Indagator, a mobile content sharing game. The authors also seek to investigate the impact of games on these motivations. Design/methodology/approach - The authors conducted a user study where 28 participants used Indagator for a week to create and share content (annotations). Participants were interviewed. All interview responses, and annotations sought (5,799) and generated (599) were manually examined and coded to ascertain motivations. Findings - Motivations for seeking content include awareness, task performance, exploratory play, killing time, and socialising. Those for creating include altruism, task performance, competitive play, killing time, reminder of experiences, self-presentation, and socialising. Additionally, games served as a motivator for mobile content sharing systems, forming a mutually beneficial ecology with content sharing. Originality/value - Prior work has not examined motivations for using mobile content sharing games, and has typically employed surveys rather than actual use of such applications. Understanding motivations has implications for developers. The benefits of incorporating games include increasing awareness for the application and addressing the \"cold-start\" problem inherent in many newly introduced applications.", "paper_title": "I played games as there was nothing else to do Understanding motivations for using mobile content sharing games", "paper_id": "WOS:000313387600002"}