{"auto_keywords": [{"score": 0.048348838729824414, "phrase": "mis"}, {"score": 0.0071523484073061335, "phrase": "maximal_independent_set"}, {"score": 0.005330891983383947, "phrase": "beeping_nodes"}, {"score": 0.0048707020811514035, "phrase": "lower_bound"}, {"score": 0.004579316323166273, "phrase": "extremely_harsh_broadcast_model"}, {"score": 0.004384407114103125, "phrase": "anonymous_broadcast_network"}, {"score": 0.0041837333868790134, "phrase": "even_an_upper_bound"}, {"score": 0.0036107002958650344, "phrase": "particular_time_slot"}, {"score": 0.00351525021580923, "phrase": "silent_nodes"}, {"score": 0.0030744279865523036, "phrase": "sub-polynomial_time"}, {"score": 0.002865521839875839, "phrase": "polylogarithmic_time"}, {"score": 0.0027341763737751467, "phrase": "network_size"}, {"score": 0.0025654738267173274, "phrase": "sleeping_nodes"}, {"score": 0.002367137788925062, "phrase": "wakeup_assumption"}, {"score": 0.0023434465472518943, "phrase": "sender-side_collision_detection"}, {"score": 0.0021049977753042253, "phrase": "synchronous_clocks"}], "paper_keywords": ["Maximal independent set", " Distributed", " Beeps", " Radio networks", " Asynchronous wakeup"], "paper_abstract": "We consider the problem of computing a maximal independent set (MIS) in an extremely harsh broadcast model that relies only on carrier sensing. The model consists of an anonymous broadcast network in which nodes have no knowledge about the topology of the network or even an upper bound on its size. Furthermore, it is assumed that an adversary chooses at which time slot each node wakes up. At each time slot a node can either beep, that is, emit a signal, or be silent. At a particular time slot, beeping nodes receive no feedback, while silent nodes can only differentiate between none of its neighbors beeping, or at least one of its neighbors beeping. We start by proving a lower bound that shows that in this model, it is not possible to locally converge to an MIS in sub-polynomial time. We then study four different relaxations of the model which allow us to circumvent the lower bound and find an MIS in polylogarithmic time. First, we show that if a polynomial upper bound on the network size is known, it is possible to find an MIS in time. Second, if we assume sleeping nodes are awoken by neighboring beeps, then we can also find an MIS in time. Third, if in addition to this wakeup assumption we allow sender-side collision detection, that is, beeping nodes can distinguish whether at least one neighboring node is beeping concurrently or not, we can find an MIS in time. Finally, if instead we endow nodes with synchronous clocks, it is also possible to find an MIS in time.", "paper_title": "Beeping a maximal independent set", "paper_id": "WOS:000322027500002"}