{"auto_keywords": [{"score": 0.03945629000021421, "phrase": "control_backbone"}, {"score": 0.015719716506582538, "phrase": "node's_importance"}, {"score": 0.011833677302143193, "phrase": "structural_controllability"}, {"score": 0.0047464608267006395, "phrase": "network_controllability"}, {"score": 0.004656647251517823, "phrase": "complex_networks"}, {"score": 0.004525088883501587, "phrase": "attractive_research_areas"}, {"score": 0.004073590964805314, "phrase": "single_node's_effort"}, {"score": 0.00349577373145384, "phrase": "random_sampling_algorithm"}, {"score": 0.00305762327908599, "phrase": "network's_underlying_degree_distribution"}, {"score": 0.0025614999929672, "phrase": "attack_strategy"}, {"score": 0.002500927169609655, "phrase": "malicious_networks"}, {"score": 0.0024652715040303416, "phrase": "simulation_results"}, {"score": 0.0024417832296664698, "phrase": "real_and_model_networks"}, {"score": 0.0021976915360493628, "phrase": "network's_structural_characteristics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Control backbone", " Minimal control scheme", " Maximum matching", " Network controllability", " Complex networks"], "paper_abstract": "Control over complex networks has been one of the attractive research areas for both network and control community, and has yielded many promising and significant results. Yet few studies have been dedicated to exploiting a single node's effort in the control of the network. In this paper, we introduce the concept of control backbone to quantify a node's importance for maintaining the structural controllability of the network. And a random sampling algorithm is developed to effectively compute it. Moreover, we demonstrate the distribution of the control backbone on various real and model networks and find that it is mainly determined by the network's underlying degree distribution. We also find the control backbone of a given node is positively correlated to its local topological feature, the ratio of the number of its siblings to the number of its superiors. Inspired by this relationship, we devise an attack strategy against the structural controllability of malicious networks. The simulation results on real and model networks show its effectiveness and efficiency compared to other commonly used attack strategies. The presented findings can help us further understand the relationship between the network's structural characteristics and its control. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Control backbone: An index for quantifying a node's importance for the network controllability", "paper_id": "WOS:000350524900031"}