{"auto_keywords": [{"score": 0.046633245390760185, "phrase": "blood_glucose_concentration"}, {"score": 0.04580780081873908, "phrase": "desired_range"}, {"score": 0.004610058444728656, "phrase": "automatic_controllers"}, {"score": 0.004225950334493496, "phrase": "appropriate_amount"}, {"score": 0.003996027647611435, "phrase": "exercise_disturbances"}, {"score": 0.0037318666008429014, "phrase": "individual's_health"}, {"score": 0.0028917056916949718, "phrase": "multi-parametric_model"}, {"score": 0.0027512482368183596, "phrase": "first_technique"}, {"score": 0.00266693888510356, "phrase": "objective_function"}, {"score": 0.002429161048032688, "phrase": "second_technique"}, {"score": 0.0023546984428119864, "phrase": "higher_priority"}], "paper_keywords": ["Insulin delivery", " Multi-parametric programming", " Multi-parametric model based control", " Multi-objective control"], "paper_abstract": "For people with type 1 diabetes, automatic controllers aim to maintain the blood glucose concentration within the desired range of 60-120 mg/dL by infusing the appropriate amount of insulin in the presence of meal and exercise disturbances. Blood glucose concentration outside the desired range can be harmful to an individual's health but concentration below 60 mg/dL, a state known as hypoglycemia, is considered to be more harmful than the concentration above 120 mg/dL, a state known as hyperglycemia. In this paper, two techniques to address this issue within a multi-parametric model based control framework are presented. The first technique introduces asymmetry into the objective function to penalize the deviation towards hypoglycemia more than the deviation towards hyperglycemia. The second technique is based upon placing higher priority on satisfaction of constraints on hypoglycemia than on satisfaction of constraints on hyperglycemia. The performance of both the control techniques is analyzed and compared in the presence of disturbances.", "paper_title": "Multi-objective blood glucose control for type 1 diabetes", "paper_id": "WOS:000263830000011"}