{"auto_keywords": [{"score": 0.03477294919904573, "phrase": "multimedia_tagging_tools"}, {"score": 0.004553128404612054, "phrase": "laborious_and_time-consuming_process"}, {"score": 0.004305481798183612, "phrase": "single_individual"}, {"score": 0.0037087324991876727, "phrase": "web_community"}, {"score": 0.0030017207229983385, "phrase": "collaborative_multimedia"}, {"score": 0.0027172453389893237, "phrase": "flickr"}, {"score": 0.0026836355916806066, "phrase": "youtube"}, {"score": 0.002474961375646351, "phrase": "detailed_analysis"}, {"score": 0.0022402661832994094, "phrase": "user_behaviours"}, {"score": 0.0022125358787611457, "phrase": "resultant_outcomes"}, {"score": 0.002131383155056741, "phrase": "subsequent_implications"}], "paper_keywords": ["Metadata", " MPEG-7", " Tagging", " Annotation", " Collaborative systems", " Folksonomy", " Experiment", " Multimedia"], "paper_abstract": "Whether unstructured or structured, tagging of multimedia resources is a laborious and time-consuming process when carried out in the context of a single individual. However, effort can be greatly reduced and the detail, quality and volume of metadata increased within the context of a web community. Despite this, little empirical research has been carried out to understand how users individually or collaboratively work with multimedia tagging tools, whether structured or unstructured. Consequently, we explore how to effectively achieve collaborative multimedia tagging through the results of an experiment that collected data from 51 users using both unstructured folksonomy (Flickr, YouTube and del.icio.us) and structured MPEG-7 tools (COSMOSIS). We contribute a detailed analysis of the use of the multimedia tagging tools used in the experiment and show the relationships between user behaviours, resultant outcomes of these behaviours, and subsequent implications for future collaborative multimedia MPEG-7 tagging tools.", "paper_title": "Experimenting with tagging and context for collaborative MPEG-7 metadata", "paper_id": "WOS:000313965800008"}