{"auto_keywords": [{"score": 0.04074917841641471, "phrase": "podcast_use"}, {"score": 0.03909417611526896, "phrase": "significant_difference"}, {"score": 0.004769182299692333, "phrase": "student_achievement"}, {"score": 0.004418287966422041, "phrase": "core_technology_course"}, {"score": 0.004293434614435972, "phrase": "teacher_licensure"}, {"score": 0.004232331639807526, "phrase": "large_research-intensive_university"}, {"score": 0.004172094622123562, "phrase": "southeastern_united_states"}, {"score": 0.004034841146538891, "phrase": "listening_preferences"}, {"score": 0.003977403701783668, "phrase": "podcast_group"}, {"score": 0.003632080001489739, "phrase": "preservice_teachers"}, {"score": 0.003580355398511932, "phrase": "podcast_instruction"}, {"score": 0.00349577373145384, "phrase": "lecture_instruction"}, {"score": 0.003207446643170565, "phrase": "blackboard"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["21st century skills", " Web 2.0", " Podcasts", " Delivery methods", " Teacher education"], "paper_abstract": "This study examined achievement when podcasts were used in place of lecture in the core technology course required for all students seeking teacher licensure at a large research-intensive university in the Southeastern United States. Further, it examined the listening preferences of the podcast group and the barriers to podcast use. The results revealed that there was no significant difference in the achievement of preservice teachers who experienced podcast instruction versus those who received lecture instruction. Further, there was no significant difference in their study habits. Participants preferred to use a computer and Blackboard for downloading the podcasts, which they primarily listened to at home. They tended to like the podcasts as well as the length of the podcasts and felt that they were reasonably effective for learning. They agreed that the podcasts were easy to use but disagreed that they should be used to replace lecture. Barriers to podcast use include unfamiliarity with podcasts, technical problems in accessing and downloading podcasts, and not seeing the relevance of podcasts to their learning. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Using podcasts to replace lecture: Effects on student achievement", "paper_id": "WOS:000294099000004"}