{"auto_keywords": [{"score": 0.038533818161098556, "phrase": "sensor_movements"}, {"score": 0.008227471502311075, "phrase": "limited_mobility_sensors"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.004778088905211055, "phrase": "limited_mobility_constraints"}, {"score": 0.004580314008293946, "phrase": "sensor_network_deployment"}, {"score": 0.004493130934067195, "phrase": "limited_mobility"}, {"score": 0.004390689303780405, "phrase": "maximum_distance"}, {"score": 0.004176640648520877, "phrase": "initial_deployment"}, {"score": 0.004050116768809519, "phrase": "multiple_regions"}, {"score": 0.003942544019605881, "phrase": "movement_plan"}, {"score": 0.0034725269588525534, "phrase": "linear_optimization_problem"}, {"score": 0.003445906915464945, "phrase": "appropriate_weight_assignments"}, {"score": 0.0031178024467857215, "phrase": "larger_weight_regions"}, {"score": 0.0030820072734233693, "phrase": "higher_priority"}, {"score": 0.003046621804854539, "phrase": "smaller_weight_regions"}, {"score": 0.002977061391551628, "phrase": "minimum_number"}, {"score": 0.0025917270871556475, "phrase": "minimum_cost_maximum_weighted_flow"}, {"score": 0.0023538120430501392, "phrase": "local_requests"}, {"score": 0.0022911901892022847, "phrase": "extensive_simulations"}, {"score": 0.0021876814398268775, "phrase": "variance_minimization"}, {"score": 0.0021049977753042253, "phrase": "different_initial_deployment_scenarios"}], "paper_keywords": ["sensor networks", " deployment", " limited mobility sensors"], "paper_abstract": "In this paper, we study the issue of sensor network deployment using limited mobility sensors. By limited mobility, we mean that the maximum distance that sensors are capable of moving to is limited. Given an initial deployment of limited mobility sensors in a field clustered into multiple regions, our deployment problem is to determine a movement plan for the sensors to minimize the variance in number of sensors among the regions and simultaneously minimize the sensor movements. Our methodology to solve this problem is to transfer the nonlinear variance/movement minimization problem into a linear optimization problem through appropriate weight assignments to regions. In this methodology, the regions are assigned weights corresponding to the number of sensors needed. During sensor movements across regions, larger weight regions are given higher priority compared to smaller weight regions, while simultaneously ensuring a minimum number of sensor movements. Following the above methodology, we propose a set of algorithms to our deployment problem. Our first algorithm is the Optimal Maximum Flow-based (OMF) centralized algorithm. Here, the optimal movement plan for sensors is obtained based on determining the minimum cost maximum weighted flow to the regions in the network. We then propose the Simple Peak-Pit-based distributed (SPP) algorithm that uses local requests and responses for sensor movements. Using extensive simulations, we demonstrate the effectiveness of our algorithms from the perspective of variance minimization, number of sensor movements, and messaging overhead under different initial deployment scenarios.", "paper_title": "Deploying wireless sensor networks under limited mobility constraints", "paper_id": "WOS:000248796900004"}