{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "blog_stickiness"}, {"score": 0.0046164478775379105, "phrase": "web_site_stickiness"}, {"score": 0.00433386573276633, "phrase": "visit_duration"}, {"score": 0.004288472456976113, "phrase": "user_retention"}, {"score": 0.004243552607799184, "phrase": "demographic_differences"}, {"score": 0.004068510313497539, "phrase": "research_question"}, {"score": 0.0040047396607954325, "phrase": "social_cognitive_theory"}, {"score": 0.003799275066001196, "phrase": "blog_quality"}, {"score": 0.003312901888725435, "phrase": "blog_reading_experience"}, {"score": 0.0031594291695784286, "phrase": "research_model"}, {"score": 0.0028886123801902517, "phrase": "blog_environment"}, {"score": 0.002858313353461727, "phrase": "social_influence"}, {"score": 0.0026270572353632297, "phrase": "blog_female_readers"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Cognition", " Influence", " Internet"], "paper_abstract": "Purpose While many studies have focussed on web Site stickiness, little is known about the antecedents of blog stickiness such as visit duration and user retention How demographic differences affect the antecedents of blog stickiness is another research question Based on social cognitive theory, the IS success model and individual differences theory, this study aims to explore blog quality, the need for cognition, and social influence as the antecedents of blog stickiness. Design/methodology/approach The subjects of this study were users who had blog reading experience. The structural equation modelling (SEM) approach was used to evaluate the research model. Findings After surveying 231 blog users, the results demonstrate that content is still king in the blog environment. Social influence affects the duration of visits to a blog, but not the retention to the blog Female readers are mainly interested in content, while males are more interested in system quality and social influence While blog veterans or heavy users care about content and social influence, blog \"newbies\" care about context and system quality Students and non-students also have different antecedents of blog stickiness Originality/value This study increases understanding of blog stickiness and suggests avenues for future research", "paper_title": "Demographic differences and the antecedents of blog stickiness", "paper_id": "WOS:000277111500002"}