{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stuttering_rates"}, {"score": 0.0046797114400479135, "phrase": "normal_verbal_behavior"}, {"score": 0.004215397034321004, "phrase": "multiple_samples"}, {"score": 0.003925414526537783, "phrase": "realistic_estimate"}, {"score": 0.003569451476205552, "phrase": "general_linear_models"}, {"score": 0.0031393948330209224, "phrase": "individual_speech_samples"}, {"score": 0.002708960273193547, "phrase": "negative_binomial_mixed_model_approach"}, {"score": 0.0022287497627555895, "phrase": "sample_size"}, {"score": 0.0021659920594094407, "phrase": "negative_binomial_distribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Stuttering involves disruptions to normal verbal behavior. The rate that these disruptions occur within individuals who stutter varies across time and also with speaking situation. Therefore multiple samples of speech are commonly taken from individuals, in an attempt to obtain a realistic estimate of the severity of their condition. Stuttering rates are commonly reported as the proportion of syllables stuttered. Traditionally, general linear models have been used to analyze and compare stuttering rates. However, the distribution of this type of data is not normal, the duration of the individual speech samples is not usually taken into account, and repeated measurements on individuals are often aggregated prior to analysis. We propose that these issues can be resolved by using a negative binomial mixed model approach. In this paper, we argue why this is sensible and then show that the model is practical to implement, drawing on data from two randomized controlled trials of interventions for treatment of stuttering. We also show how to estimate sample size for our proposed model based on a negative binomial distribution. (c) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Negative binomial mixed models for analysis of stuttering rates", "paper_id": "WOS:000270624600059"}