{"auto_keywords": [{"score": 0.04561683059234016, "phrase": "sla"}, {"score": 0.04164963732994353, "phrase": "availability_target"}, {"score": 0.027124727641420324, "phrase": "sla_violation_risk"}, {"score": 0.00481495049065317, "phrase": "shared-protected_dynamic_connections"}, {"score": 0.004732785510739708, "phrase": "automatized_management_systems"}, {"score": 0.0047057084749407485, "phrase": "optical_wdm_networks"}, {"score": 0.00407674512878246, "phrase": "sls"}, {"score": 0.0040186038781533946, "phrase": "holding_time"}, {"score": 0.003904871008565975, "phrase": "shared-path_protection"}, {"score": 0.0038271712887391015, "phrase": "proposed_approach"}, {"score": 0.0037402558657576124, "phrase": "actual_downtime"}, {"score": 0.003634371940842838, "phrase": "network_state_changes"}, {"score": 0.0035722806911457545, "phrase": "fault_occurrence"}, {"score": 0.003441352119167824, "phrase": "new_updated_availability_target"}, {"score": 0.003230584762460845, "phrase": "stipulated_availability_target"}, {"score": 0.00298942278888105, "phrase": "\"_availability_\"credits"}, {"score": 0.0028963961037320805, "phrase": "shareability_level"}, {"score": 0.0028715299874549245, "phrase": "backup_capacity"}, {"score": 0.0027821617251337304, "phrase": "living_connections"}, {"score": 0.0027189137945757866, "phrase": "provided_service"}, {"score": 0.0024515835042187985, "phrase": "higher_customer_satisfaction"}, {"score": 0.0024305268807926056, "phrase": "classical_statistical_availability"}, {"score": 0.0023480892503414596, "phrase": "blocking_probability"}, {"score": 0.0022749744354271816, "phrase": "sla_violations"}, {"score": 0.0022296340517805125, "phrase": "proposed_scheme"}, {"score": 0.002185195325707735, "phrase": "monitored_metric"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Optical network", " WDM", " Elastic availability", " Holding time", " Shared protection", " SLA Violation Risk"], "paper_abstract": "Novel automatized management systems for optical WDM networks promise to allow customers asking for a connection (i.e., a bandwidth service) to specify on-demand the terms of the Service Level Agreement (SLA) to be guaranteed by the Network Operator (NO). In this work, we exploit the knowledge, among the other Service Level Specifications (SLS), of the holding time and of the availability target of the connections to operate shared-path protection in a more effective manner. In the proposed approach, for each connection we monitor the actual downtime experienced by the connection, and, when the network state changes (typically, for a fault occurrence, or a connection departure or arrival), we estimate a new updated availability target for each connection based on our knowledge of all the predictable network-state changes, i.e., the future connection departures. Since some of the connections will be ahead of the stipulated availability target in their SLA (credit), while other connections will be behind their availability target (debit), we propose a mechanism that allows us to \"trade\" availability \"credits\" and \"debits\", by increasing or decreasing the shareability level of the backup capacity. Our approach permits to flexibly manage the availability provided to living connections during their holding times. The quality of the provided service is evaluated in terms of availability as well as probability of violation of availability target stipulated in the SLA (also called SLA Violation Risk), a recently-proposed metric that has been demonstrated to guarantee higher customer satisfaction than the classical statistical availability. For a typical wavelength-convertible 115 nationwide network, our approach obtains significative savings on Blocking Probability (BP), while reducing the penalties due to SLA violations. We also analytically demonstrate the proposed scheme can be highly beneficial if the monitored metric is the SLA Violation Risk instead of the availability. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Trading availability among shared-protected dynamic connections in WDM networks", "paper_id": "WOS:000307924300013"}