{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "plain_sense"}, {"score": 0.004747997855358171, "phrase": "complex_things"}, {"score": 0.003715579364728729, "phrase": "identical_elements"}, {"score": 0.002787181295054319, "phrase": "creative_process"}, {"score": 0.002729133029776093, "phrase": "chosen_purpose"}, {"score": 0.0026443135597866924, "phrase": "extensionality_principle"}, {"score": 0.0025711283781017424, "phrase": "assembling_process"}, {"score": 0.002422249273477746, "phrase": "specified_sense"}, {"score": 0.0023551955270737215, "phrase": "design_process"}, {"score": 0.0023387234705715154, "phrase": "design_things"}, {"score": 0.00231423064137482, "phrase": "canonical_correspondence"}, {"score": 0.002281971169774711, "phrase": "design_products"}, {"score": 0.0021878600131802453, "phrase": "approximate_artifacts"}, {"score": 0.0021347607855562102, "phrase": "spare_parts"}, {"score": 0.0021049977753042253, "phrase": "rough_mereology"}], "paper_keywords": ["Mereology", " Rough Mereology", " Artifacts", " Extensionality Property"], "paper_abstract": "The notion of extensionality means in plain sense that properties of complex things can be expressed by means of their simple components, in particular, that two things are identical if and only if certain of their components or features are identical; e.g., the Leibniz Identitas Indiscernibilium Principle: two things are identical if each applicable to them operator yields the same result on either; or, extensionality for sets, viz., two sets are identical if and only if they consist of identical elements. In mereology, this property is expressed by the statement that two things are identical if their parts are the same. However, building a thing from parts may proceed in various ways and this, unexpectedly, yields various extensionality principles. Also, building a thing may lead to things identical with respect to parts but distinct with respect, e.g., to usage. We address the question of extensionality for artifacts, i.e., things produced in some assembling or creative process in order to satisfy a chosen purpose of usage, and, we formulate the extensionality principle for artifacts which takes into account the assembling process and requires for identity of two artifacts that assembling graphs for the two be isomorphic in a specified sense. In parallel, we consider the design process and design things showing the canonical correspondence between abstracta as design products and concreta as artifacts. In the end, we discuss approximate artifacts as a result of assembling with spare parts which analysis does involve rough mereology.", "paper_title": "On a Notion of Extensionality for Artifacts", "paper_id": "WOS:000325745600008"}