{"auto_keywords": [{"score": 0.0485324803193334, "phrase": "base_stations"}, {"score": 0.006472394880182346, "phrase": "serving_radius"}, {"score": 0.006443951780792119, "phrase": "wireless_networks"}, {"score": 0.006195630495672659, "phrase": "capacity_constraints"}, {"score": 0.005080298007235858, "phrase": "first_model"}, {"score": 0.00481495049065317, "phrase": "variable_capacities"}, {"score": 0.0045165074710916365, "phrase": "second_model"}, {"score": 0.004315771670213371, "phrase": "increased_power_usage"}, {"score": 0.0042804804366777865, "phrase": "greater_serving_radius"}, {"score": 0.004130842663662047, "phrase": "covering_radius"}, {"score": 0.003993107198489063, "phrase": "third_model"}, {"score": 0.0039322149318145845, "phrase": "total_demand"}, {"score": 0.0035435867326548665, "phrase": "base_station"}, {"score": 0.0034478392374444177, "phrase": "maximum_total_profit_subject"}, {"score": 0.003299977511820374, "phrase": "associated_demand"}, {"score": 0.0032372917632693403, "phrase": "fixed_number"}, {"score": 0.0030229485340586473, "phrase": "profit_subject"}, {"score": 0.0026942333853202556, "phrase": "minimum_total_cost"}, {"score": 0.002650279521276126, "phrase": "entire_demand"}, {"score": 0.0025227915685074862, "phrase": "np"}, {"score": 0.0022980978400845144, "phrase": "column_generation_procedure"}, {"score": 0.002273025527678093, "phrase": "standard_linear_programming_model"}, {"score": 0.0022482261385133617, "phrase": "randomized_rounding_procedure"}, {"score": 0.0021994343316143125, "phrase": "column_generation"}, {"score": 0.0021694774708817498, "phrase": "randomly_generated_instances"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Facility location", " Capacitated covering", " Approximation algorithms", " Column generation", " Complexity", " Wireless networks"], "paper_abstract": "We consider the problem of allocating clients to base stations in wireless networks. Two design decisions are the location of the base stations, and the power levels of the base stations. We model the interference, due to the increased power usage resulting in greater serving radius, as capacities that are non-increasing with respect to the covering radius. Clients have demands that are not necessarily uniform and the capacity of a facility limits the total demand that can be served by the facility. We consider three models. In the first model, the location of the base stations and the clients are fixed, and the problem is to determine the serving radius for each base station so as to serve a set of clients with maximum total profit subject to the capacity constraints of the base stations. In the second model, each client has an associated demand in addition to its profit. A fixed number of facilities have to be opened from a candidate set of locations. The goal is to serve clients so as to maximize the profit subject to the capacity constraints. In the third model, the location and the serving radius of the base stations are to be determined. There are costs associated with opening the base stations, and the goal is to open a set of base stations of minimum total cost so as to serve the entire demand subject to the capacity constraints at the base stations. We show that for the first model the problem is NP-complete even when there are only two choices for the serving radius, and the capacities are 1,2. For the second model, we give a 1/2 approximation algorithm. For the third model, we give a column generation procedure for solving the standard linear programming model, and a randomized rounding procedure. We establish the efficacy of the column generation based rounding scheme on randomly generated instances. (C) 2014 The Authors. Published by Elsevier B.V.", "paper_title": "On a class of covering problems with variable capacities in wireless networks", "paper_id": "WOS:000351791600006"}