{"auto_keywords": [{"score": 0.034034183564694315, "phrase": "design_space"}, {"score": 0.00458869631642791, "phrase": "built-in_incentive_mechanism"}, {"score": 0.004338076511024884, "phrase": "fundamental_trade-off"}, {"score": 0.004234884779773412, "phrase": "good_performance"}, {"score": 0.0037095162593960727, "phrase": "better_performance"}, {"score": 0.003437036036889996, "phrase": "current_bt_protocol"}, {"score": 0.003368707839819003, "phrase": "whole_design_space"}, {"score": 0.00319732428387928, "phrase": "bt-like_protocols"}, {"score": 0.0028456853685842293, "phrase": "wide_range"}, {"score": 0.0028229071631385634, "phrase": "design_choices"}, {"score": 0.002733598121537801, "phrase": "file_download_time"}, {"score": 0.0026792166577171476, "phrase": "overall_fairness_measure"}, {"score": 0.0025633455664747606, "phrase": "simple_and_easily_implementable_design_knob"}, {"score": 0.002472269923319476, "phrase": "particular_point"}, {"score": 0.0023940274498526213, "phrase": "different_algorithms"}, {"score": 0.0022904619303011097, "phrase": "design_knob"}, {"score": 0.0022721178679337025, "phrase": "performance_evaluations"}, {"score": 0.002191366809047192, "phrase": "network_measurement"}, {"score": 0.0021049977753042253, "phrase": "bt-like_file_sharing_protocols"}], "paper_keywords": ["BitTorrent", " fairness", " file sharing protocol", " incentive mechanism", " performance"], "paper_abstract": "The BitTorrent (BT) file sharing protocol is very popular due to its scalability property and the built-in incentive mechanism to reduce free-riding. However, in designing such P2P file sharing protocols, there is a fundamental trade-off between keeping fairness and providing good performance. In particular, the system can either keep peers (especially those resourceful ones) in the system for as long as possible so as to help the system to achieve better performance, or allow more resourceful peers to finish their download as quickly as possible so as to achieve fairness. The current BT protocol represents only one possible implementation in this whole design space. The objective of this paper is to characterize the design space of BT-like protocols. The rationale for considering fairness in the P2P file sharing context is to use it as a measure of willingness to provide service. We show that there is a wide range of design choices, ranging from optimizing the performance of file download time, to optimizing the overall fairness measure. More importantly, we show that there is a simple and easily implementable design knob so that the system can operate at a particular point in the design space. We also discuss different algorithms, ranging from centralized to distributed, in realizing the design knob. Performance evaluations are carried out, both via simulation and network measurement, to quantify the merits and properties of the BT-like file sharing protocols.", "paper_title": "The Design Trade-Offs of BitTorrent-Like File Sharing Protocols", "paper_id": "WOS:000265437800001"}