{"auto_keywords": [{"score": 0.040575248947916934, "phrase": "bpmn"}, {"score": 0.009310128801108323, "phrase": "de_facto_standard"}, {"score": 0.007455217887853681, "phrase": "slr"}, {"score": 0.00481495049065317, "phrase": "business_process"}, {"score": 0.004676173016967478, "phrase": "explicit_control"}, {"score": 0.004378309349451268, "phrase": "business_process_model"}, {"score": 0.003327534497764259, "phrase": "semantic_examination"}, {"score": 0.003303259489028193, "phrase": "articles'_citations"}, {"score": 0.002863652837038965, "phrase": "general_aspects"}, {"score": 0.0025939803934423486, "phrase": "empirical_insights"}, {"score": 0.0025468951021098717, "phrase": "bpmn_acceptance"}, {"score": 0.002401875938287542, "phrase": "modelling_domain"}, {"score": 0.0021597049163247476, "phrase": "main_purpose"}, {"score": 0.0021049977753042253, "phrase": "business_processes"}], "paper_keywords": ["business process modelling", " BPMN", " acceptance", " use", " systematic literature review"], "paper_abstract": "Context: With business process modelling, companies and organizations can gain explicit control over their processes. Currently, there are many notations in the area of business process modelling, where Business Process Model and Notation (BPMN) is denoted as the de facto standard. Aims: The aim of this research is to provide the state-of-the-art results addressing the acceptance of BPMN, while also examining the purposes of its usage. Furthermore, the advantages, disadvantages and other interests related to BPMN were also investigated. Method: To achieve these objectives, a Systematic Literature Review (SLR) and a semantic examination of articles' citations was conducted. Results: After completing SLR, out of a total of 852 articles, 31 were deemed relevant. The majority of the articles analyzed the notation and compared it with other modelling techniques. The remainder evaluated general aspects of the notation, e.g. history and versions of the standard, usage of the notation or tools. Conclusion: Our findings demonstrate that there are empirical insights about the level of BPMN acceptance. They suggest that BPMN is still widely perceived as the de facto standard in the process modelling domain and its usage is ever-increasing. However, many studies report that only a limited set of elements are commonly used and to this end, several extensions were proposed. The main purpose of BPMN remains the description of business processes.", "paper_title": "Business Process Model and Notation: The Current State of Affairs", "paper_id": "WOS:000359611300011"}