{"auto_keywords": [{"score": 0.015719718815762243, "phrase": "frbr"}, {"score": 0.015605450652490877, "phrase": "frad"}, {"score": 0.013884547229285317, "phrase": "event_concept"}, {"score": 0.012952749851521606, "phrase": "event_entities"}, {"score": 0.008911901905650305, "phrase": "event_modeling"}, {"score": 0.007836281751195363, "phrase": "proposed_models"}, {"score": 0.0045726187330434025, "phrase": "functional_requirements"}, {"score": 0.004539005582217309, "phrase": "bibliographic_records"}, {"score": 0.004406994912939125, "phrase": "authority_data"}, {"score": 0.004139028737420222, "phrase": "minimal_modification"}, {"score": 0.003623949225126944, "phrase": "proposed_frbr-based_model"}, {"score": 0.003584025547693836, "phrase": "object-oriented_frbr"}, {"score": 0.003441352119167824, "phrase": "proposed_event-aware_frbr_model"}, {"score": 0.0030017207229983385, "phrase": "proposed_model"}, {"score": 0.002935905915691203, "phrase": "frbroo_model"}, {"score": 0.0027368368719283298, "phrase": "different_resource"}, {"score": 0.0026570998719084153, "phrase": "event-aware_frad_model"}, {"score": 0.002317423416027688, "phrase": "basic_structure"}, {"score": 0.0021049977753042253, "phrase": "stable_basis"}], "paper_keywords": ["Conceptual models", " Event awareness", " Bibliographic records", " Authority data", " Functional requirements for bibliographic records model", " Information management", " Functional requirements for authority data model", " Records management"], "paper_abstract": "Purpose - The purpose of this paper is to present functional requirements for bibliographic records (FRBR)-based model and functional requirements for authority data (FRAD)-based model; both of which incorporate an event concept that transforms FRBR and FRAD with minimal modification. Design/methodology/approach - Relationships between the entities defined in FRBR/FRAD are transformed into event entities and relationships with other kinds of entities. The cardinality of those relationships is also examined. In addition, a comparison of the proposed FRBR-based model with the object-oriented FRBR (FRBROO) is conducted. Findings - In the proposed event-aware FRBR model, an event and its output resource are dependent on each other and necessary information about an event can be expressed with information about its output resource, and vice versa. Therefore, the usefulness and expressiveness of the proposed model is limited. In the FRBROO model, dependency between an event and its output resource is not observed, except in a few cases, since a different resource and event modeling was adopted there. The event-aware FRAD model proposed is useful - but also the scope of its usefulness limited since dependency between an event and its input/output resource is not observed on some event entities. Originality/value - The proposed models are meaningful in terms of understanding the basic structure and features of a model that incorporates an event concept The usefulness and limitation of event modeling have been clarified through such model building. The proposed models provide a stable basis for examining FRBR/FRAD further.", "paper_title": "Event-aware FRBR and FRAD models: are they useful?", "paper_id": "WOS:000320742000008"}