{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "skyline_queries"}, {"score": 0.010226724472765293, "phrase": "salsa"}, {"score": 0.004707479285061122, "phrase": "pareto-optimal_tuples"}, {"score": 0.003841610436545169, "phrase": "dominance_tests"}, {"score": 0.00338493754743055, "phrase": "input_data"}, {"score": 0.002915701586760994, "phrase": "skyline_semantics"}, {"score": 0.0028505007899807446, "phrase": "skyline_logic"}, {"score": 0.0027867539356701302, "phrase": "limited_power"}, {"score": 0.002433048706565187, "phrase": "\"minimum_coordinate"}, {"score": 0.0024111277643627154, "phrase": "\"_minc"}, {"score": 0.0022836785412390544, "phrase": "data_distribution"}, {"score": 0.002232579371411546, "phrase": "asymmetric_sorting_function"}, {"score": 0.0021925226977381244, "phrase": "experimental_results"}, {"score": 0.002162951519368368, "phrase": "synthetic_and_real_datasets"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_sequential_skyline_algorithms"}], "paper_keywords": ["Algorithms", " Performance", " Skyline query", " Monotone functions"], "paper_abstract": "Skyline queries compute the set of Pareto-optimal tuples in a relation, that is, those tuples that are not dominated by any other tuple in the same relation. Although several algorithms have been proposed for efficiently evaluating skyline queries, they either necessitate the relation to have been indexed or have to perform the dominance tests on all the tuples in order to determine the result. In this article we introduce SaLSa, a novel skyline algorithm that exploits the idea of presorting the input data so as to effectively limit the number of tuples to be read and compared. This makes SaLSa also attractive when skyline queries are executed on top of systems that do not understand skyline semantics, or when the skyline logic runs on clients with limited power and/or bandwidth. We prove that, if one considers symmetric sorting functions, the number of tuples to be read is minimized by sorting data according to a \"minimum coordinate,\" minC, criterion, and that performance can be further improved if data distribution is known and an asymmetric sorting function is used. Experimental results obtained on synthetic and real datasets show that SaLSa consistently outperforms state-of-the-art sequential skyline algorithms and that its performance can be accurately predicted.", "paper_title": "Efficient Sort-Based Skyline Evaluation", "paper_id": "WOS:000263490800012"}