{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_target_point"}, {"score": 0.015614351255293793, "phrase": "humanoid_robots"}, {"score": 0.015457605318221648, "phrase": "neural-network-based_active_embedded_vision_system"}, {"score": 0.00411764975820144, "phrase": "vtp"}, {"score": 0.0037947482487057076, "phrase": "ball_field"}, {"score": 0.003545024951402818, "phrase": "complete_search"}, {"score": 0.003509006038574667, "phrase": "specific_ball"}, {"score": 0.002969760180816441, "phrase": "planned_posture"}, {"score": 0.0028801015154977885, "phrase": "stkvtp"}, {"score": 0.0027088011534576856, "phrase": "multilayer_neural_network"}, {"score": 0.0026359661683150984, "phrase": "connected_visible_region"}, {"score": 0.002556359086441866, "phrase": "error_sensitivities"}, {"score": 0.002530359917257626, "phrase": "pan_and_tilt_directions"}], "paper_keywords": ["Humanoid robot (HR)", " image processing for localization", " modeling using multilayer neural network (MNN)", " posture revision", " \"search, track, and kick\"", " strategy for visual navigation"], "paper_abstract": "In this paper, the task of \"search, track, and kick a ball to a virtual target point (STKVTP)\" of humanoid robots (HRs) is developed. It is not necessarily assumed that the virtual target point (VTP) is known all the time. On the other hand, it must be online estimated. First, the HR searches the ball field to find the gate or the ball, which is not necessarily in front of an HR. After the complete search of the specific ball or the gate, the HR is navigated by a neural-network-based active embedded vision system (AEVS). If the gate is far away from the HR (e.g., larger than 1.8 m), the ball is kicked and tracked by the HR. Then, the HR reaches the planned posture with respect to the gate, and the STKVTP of the HR is accomplished. Four important features are described as follows: 1) The modeling using multilayer neural network for four pitch angles of AEVS to form a connected visible region for navigation is established; 2) the error sensitivities in the pan and tilt directions and the height with respect to four view angles are analyzed and compared; 3) the search strategy for the specific ball or the gate is developed; and 4) the visual navigation strategy, including position and orientation revisions, for the STKVTP of the HR is designed. Finally, three representative experiments are applied to confirm the effectiveness and efficiency of our methodology.", "paper_title": "Search, Track, and Kick to Virtual Target Point of Humanoid Robots by a Neural-Network-Based Active Embedded Vision System", "paper_id": "WOS:000351075000012"}