{"auto_keywords": [{"score": 0.032733955867664956, "phrase": "new_calculus"}, {"score": 0.008121721594028627, "phrase": "fdpll"}, {"score": 0.007834708149857287, "phrase": "dpll_procedure"}, {"score": 0.00481495049065317, "phrase": "first-order_dpll_method"}, {"score": 0.004757370895731506, "phrase": "dpll"}, {"score": 0.004390607370861926, "phrase": "first-order_logic"}, {"score": 0.004234884779773412, "phrase": "propositional_logic"}, {"score": 0.00401961206251868, "phrase": "ground_formulas"}, {"score": 0.003971502222405927, "phrase": "fdpll_calculus"}, {"score": 0.003939750005657554, "phrase": "baumgartner"}, {"score": 0.0038925903520043623, "phrase": "first_successful_attempt"}, {"score": 0.0037847308929559163, "phrase": "first-order_level"}, {"score": 0.0036212219870826725, "phrase": "first-order_case"}, {"score": 0.0027667539384678814, "phrase": "universal_literals"}, {"score": 0.0025633455664747606, "phrase": "darwin_system"}, {"score": 0.002502264043067568, "phrase": "main_results"}, {"score": 0.0022812715029149216, "phrase": "high-level_description"}, {"score": 0.002253920389285441, "phrase": "proof_procedure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["DPLL procedure", " first-order logic", " sequent calculi", " model generation"], "paper_abstract": "The DPLL procedure is the basis of some of the most successful propositional satisfiability solvers to date. Although originally devised as a proof-procedure for first-order logic, it has been used almost exclusively for propositional logic so far because of its highly inefficient treatment of quantifiers, based on instantiation into ground formulas. The FDPLL calculus by Baumgartner was the first successful attempt to lift the procedure to the first-order level without resorting to ground instantiations. FDPLL lifts to the first-order case the core of the DPLL procedure, the splitting rule, but ignores other aspects of the procedure that, although not necessary for completeness, are crucial for its effectiveness in practice. In this paper, we present a new calculus loosely based on FDPLL that lifts these aspects as well. In addition to being a more faithful lifting of the DPLL procedure, the new calculus contains a more systematic treatment of universal literals, which are crucial to achieve efficiency in practice. The new calculus has been implemented successfully in the Darwin system, described elsewhere. The main results of this paper are theoretical, showing the soundness and completeness of the new calculus. In addition, the paper provides a high-level description of a proof procedure for the calculus, as well as a comparison with other calculi. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "The model evolution calculus as a first-order DPLL method", "paper_id": "WOS:000253329500009"}