{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quantitative_analysis"}, {"score": 0.0047588556219929756, "phrase": "demand_disruption_caused"}, {"score": 0.00454090611248773, "phrase": "consumers'_attitudes"}, {"score": 0.004307569753106432, "phrase": "supply_chain_demand"}, {"score": 0.004207734323806386, "phrase": "today's_internet_age"}, {"score": 0.00408617426304956, "phrase": "mathematical_model"}, {"score": 0.003968112038249246, "phrase": "demand_disruption"}, {"score": 0.0029075757820516634, "phrase": "firms'_perspective"}, {"score": 0.00224551648748308, "phrase": "new_method"}, {"score": 0.0022192891418394535, "phrase": "company_managers"}, {"score": 0.0021677478798910565, "phrase": "variation_trend"}, {"score": 0.0021049977753042253, "phrase": "demand_loss"}], "paper_keywords": ["Supply chain", " demand disruption", " rumor spreading", " SI2I model", " stimulation"], "paper_abstract": "Rumors greatly impact consumers' attitudes and purchasing intention. Rumor spreading can disrupt supply chain demand, particularly in today's Internet age. We propose a mathematical model for the quantitative analysis of demand disruption caused by rumor spreading based on the susceptible-infective-isolated-immune (SI2I) rumor spreading model, which extends the susceptible-infective-recovered (SIR) rumor spreading model by dividing stiflers into isolators and immunes. Both groups represent individuals who do not propagate a rumor, but the former believes the rumor while the latter does not. From the firms' perspective, only ignorants and immunes will still purchase their products and services after a rumor has spread. Hence, the influence of rumors on demand can be quantitatively reflected by the proportion of ignorants and immunes in the population. This study offers a new method for company managers to predict the variation trend of demand and estimate demand loss when a firm is attacked by rumors.", "paper_title": "A Mathematics Model for Quantitative Analysis of Demand Disruption Caused by Rumor Spreading", "paper_id": "WOS:000336411100007"}