{"auto_keywords": [{"score": 0.048636009815037955, "phrase": "tetrahedral_grids"}, {"score": 0.00481495049065317, "phrase": "hermite_weno"}, {"score": 0.004616560363089716, "phrase": "implicit_reconstructed_discontinuous_galerkin_method"}, {"score": 0.004409404470207072, "phrase": "compressible_euler_equations"}, {"score": 0.004163427731140163, "phrase": "least-squares_method"}, {"score": 0.003961330917648707, "phrase": "dg_formulation"}, {"score": 0.0035997452281985465, "phrase": "underlying_dg_method"}, {"score": 0.0034777887763821425, "phrase": "weno_reconstruction"}, {"score": 0.0031121406603482112, "phrase": "linear_equations"}, {"score": 0.00307657476125683, "phrase": "newton_linearization"}, {"score": 0.0029496099495185586, "phrase": "gauss-seidel"}, {"score": 0.002784828661426853, "phrase": "flow_problems"}, {"score": 0.002579326836642461, "phrase": "linear_stability"}, {"score": 0.002530359917257626, "phrase": "designed_third_order"}, {"score": 0.0023525950486853937, "phrase": "storage_requirements"}, {"score": 0.0022815262950738814, "phrase": "well_approximated_jacobian_matrix"}, {"score": 0.0022382002476510573, "phrase": "irdg_method"}, {"score": 0.0021539955106204354, "phrase": "large-scale_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Discontinuous Galerkin", " Reconstruction method", " WENO", " Compressible flows", " Implicit method", " Tetrahedral grids"], "paper_abstract": "An Implicit Reconstructed Discontinuous Galerkin method, IRDG (P1P2), is presented for solving the compressible Euler equations on tetrahedral grids. In this method, a quadratic polynomial (P-2) solution is first reconstructed using a least-squares method from the underlying linear polynomial (P-1) DG solution. By taking advantage of the derivatives in the DG formulation, the stencils used in the reconstruction involve only von Neumann neighborhood (adjacent face-neighboring cells) and thus are compact and consistent with the underlying DG method. The final P-2 solution is then obtained using a WENO reconstruction, which is necessary to ensure stability of the RDG ((Pi P2)) method. A matrix-free GMRES (generalized minimum residual) algorithm is presented to solve the approximate system of linear equations arising from Newton linearization. The LU-SGS (lower-upper symmetric Gauss-Seidel) preconditioner is applied with both the simplified and approximate Jacobian matrices. The numerical experiments on a variety of flow problems demonstrate that the developed IRDG (P1P2) method is able to obtain a speedup of at least two orders of magnitude than its explicit counterpart, maintain the linear stability, and achieve the designed third order of accuracy: one order of accuracy higher than the underlying second-order DG (P-1) method without significant increase in computing costs and storage requirements. It is also found that a well approximated Jacobian matrix is essential for the IRDG method to achieve fast converging speed and maintain robustness on large-scale problems. (c) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "An implicit Hermite WENO reconstruction-based discontinuous Galerkin method on tetrahedral grids", "paper_id": "WOS:000336775700031"}