{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intelligent_position-based_routing_protocols"}, {"score": 0.0047306078475683865, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.004466519142879166, "phrase": "challenging_issues"}, {"score": 0.004106725110985659, "phrase": "intelligent_solutions"}, {"score": 0.003306559295382181, "phrase": "intelligent_routing_algorithm"}, {"score": 0.003277433417137265, "phrase": "vanet."}, {"score": 0.0029471818883482688, "phrase": "routing_protocols"}, {"score": 0.002697474061842142, "phrase": "routing_process"}, {"score": 0.0026384167183586015, "phrase": "dynamic_nature"}, {"score": 0.002615156460073562, "phrase": "vehicular_networks"}, {"score": 0.002361923085067681, "phrase": "obtained_results"}, {"score": 0.0022999859758286423, "phrase": "average_delay"}, {"score": 0.0021906130276146325, "phrase": "failure_rate"}, {"score": 0.002161695357601592, "phrase": "performance_indicators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Vehicular network", " Velocity", " Density", " Routing", " Prediction", " Simulation"], "paper_abstract": "Recently, vehicular ad hoc networks (VANETs) have received more attention in both academic and industry settings. One of the challenging issues in this domain is routing algorithms. VANETs become even more challenging, when they get benefit from intelligent solutions to predict the most stable nodes in the network to communicate with. There are several contributing factors which have influence on this process; including density, velocity, location, and distance. To the best of our knowledge, density and velocity have the most impact on the precision of an intelligent routing algorithm for VANET. In this paper, we investigate how density along with velocity can affect intelligent position-based routing protocols in vehicular ad hoc networks. These types of routing protocols are selected since there is no requirement to establish and save a route between source and destination during the routing process which is suitable for dynamic nature of vehicular networks. We have analyzed the impact of velocity and density at the same time on most widely used position-based routing protocols using different scenarios through NS-2. The obtained results are then illustrated based on average delay, packet delivery ratio, routing overhead, and link failure rate as routing performance indicators. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Analyzing the impacts of velocity and density on intelligent position-based routing protocols", "paper_id": "WOS:000367774700019"}