{"auto_keywords": [{"score": 0.04308224514921984, "phrase": "cbir"}, {"score": 0.015622297747700074, "phrase": "mobile_systems"}, {"score": 0.014409168497948559, "phrase": "mobile_system"}, {"score": 0.00481495049065317, "phrase": "image_retrieval"}, {"score": 0.004680725471654037, "phrase": "cell_phones"}, {"score": 0.0046368166127362925, "phrase": "increasing_role"}, {"score": 0.004593317752310294, "phrase": "visual_contents"}, {"score": 0.004340724551091173, "phrase": "storage_technology"}, {"score": 0.004246271940215511, "phrase": "better_organization"}, {"score": 0.0041408296624638125, "phrase": "based_image_retrieval"}, {"score": 0.003721029388906273, "phrase": "significant_amounts"}, {"score": 0.003640011825552854, "phrase": "energy_conservation"}, {"score": 0.0027596607038845923, "phrase": "consecutive_user_queries"}, {"score": 0.0026158609712563737, "phrase": "cbir_algorithm"}, {"score": 0.0022207767448896515, "phrase": "wireless_bandwidth"}, {"score": 0.002186079683182129, "phrase": "indexed_images"}, {"score": 0.0021451564984201364, "phrase": "image_queries"}, {"score": 0.0021249824741421306, "phrase": "energy_consumption"}], "paper_keywords": ["Algorithms", " Design", " Measurement", " Performance", " Mobile content-based image retrieval", " energy saving", " adaptive feature reduction", " similarity index", " computation offloading"], "paper_abstract": "Mobile systems such as PDAs and cell phones play an increasing role in handling visual contents such as images. Thousands of images can be stored in a mobile system with the advances in storage technology: this creates the need for better organization and retrieval of these images. Content Based Image Retrieval (CBIR) is a method to retrieve images based on their visual contents. In CBIR, images are compared by matching their numerical representations called features; CBIR is computation and memory intensive and consumes significant amounts of energy. This article examines energy conservation for CBIR on mobile systems. We present three improvements to save energy while performing the computation on the mobile system: selective loading, adaptive loading, and caching features in memory. Using these improvements adaptively reduces the features to be loaded into memory for each search. The reduction is achieved by estimating the difficulty of the search. If the images in the collection are dissimilar, fewer features are sufficient; less computation is performed and energy can be saved. We also consider the effect of consecutive user queries and show how features can be cached in memory to save energy. We implement a CBIR algorithm on an HP iPAQ hw6945 and show that these improvements can save energy and allow CBIR to scale up to 50,000 images on a mobile system. We further investigate if energy can be saved by migrating parts of the computation to a server, called computation offloading. We analyze the impact of the wireless bandwidth, server speed, number of indexed images, and the number of image queries on the energy consumption. Using our scheme, CBIR can be made energy efficient under all conditions.", "paper_title": "Energy Conservation for Image Retrieval on Mobile Systems", "paper_id": "WOS:000309671200008"}