{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "active_sub-domains"}, {"score": 0.04072472046898861, "phrase": "wave_equation"}, {"score": 0.004757643419056999, "phrase": "fully_parallelized_solution"}, {"score": 0.004719816332271661, "phrase": "wave_equations"}, {"score": 0.004663636232080366, "phrase": "form_modeling"}, {"score": 0.004571478018964363, "phrase": "vast_number"}, {"score": 0.004463278123628969, "phrase": "different_methods"}, {"score": 0.004254467919664946, "phrase": "computational_cost"}, {"score": 0.004087910779160781, "phrase": "parallel_programming"}, {"score": 0.004023120753104693, "phrase": "large_impact"}, {"score": 0.003991110291836103, "phrase": "wave_field"}, {"score": 0.003804305595325308, "phrase": "independent_steps"}, {"score": 0.003758981686762617, "phrase": "finite_difference_solution"}, {"score": 0.003640730820018083, "phrase": "gpu_acceleration"}, {"score": 0.0035403060198952244, "phrase": "rather_limited_global_memory"}, {"score": 0.0031402604946939743, "phrase": "different_gpus"}, {"score": 0.00240213106042981, "phrase": "synthetic_examples"}, {"score": 0.002199725773957207, "phrase": "multi-cpu_computer_architectures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["GPU", " Wave propagation", " Two-scale methods"], "paper_abstract": "Wave form modeling is used in a vast number of applications. Therefore, different methods have been developed that exhibit different strengths and weaknesses in accuracy, stability and computational cost. The latter remains a problem for most applications. Parallel programming has had a large impact on wave field modeling since the solution of the wave equation can be divided into independent steps. The finite difference solution of the wave equation is particularly suitable for GPU acceleration; however, one problem is the rather limited global memory current CPUs are equipped with. For this reason, most large-scale applications require multiple GPUs to be employed. This paper proposes a method to optimally distribute the workload on different GPUs by avoiding devices that are running idle. This is done by using a list of active sub-domains so that a certain sub-domain is activated only if the amplitude inside the subdomain exceeds a given threshold. During the computation, every CPU checks if the sub-domain needs to be active. If not, the CPU can be assigned to another sub-domain. The method was applied to synthetic examples to test the accuracy and the efficiency of the method. The results show that the method offers a more efficient utilization of multi-CPU computer architectures. (C) 2015 The Author. Published by Elsevier B.V.", "paper_title": "A two-scale method using a list of active sub-domains for a fully parallelized solution of wave equations", "paper_id": "WOS:000367774700009"}