{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "aerospace_maintenance_operations"}, {"score": 0.004225950334493496, "phrase": "radio_frequency_identification"}, {"score": 0.0038737214010638745, "phrase": "typical_aircraft_maintenance"}, {"score": 0.003640183972131238, "phrase": "flow_line"}, {"score": 0.003399466007862412, "phrase": "simulated_model"}, {"score": 0.003336614511719501, "phrase": "operation_sequence_alternatives"}, {"score": 0.0030965805992969027, "phrase": "simulation_study"}, {"score": 0.0029830992938695007, "phrase": "real-time_resource_sharing"}, {"score": 0.0028737647829311587, "phrase": "alternative_resources"}, {"score": 0.0028382152567141784, "phrase": "station_level"}, {"score": 0.00266693888510356, "phrase": "manufacturing_flow_line"}, {"score": 0.0025691622090542304, "phrase": "system_throughput"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["resource allocation", " asset management", " flow lines", " radio frequency identification"], "paper_abstract": "In this article, dynamic resource allocation (DRA) policies for aerospace maintenance operations, enabled by deployment of radio frequency identification (RFID) technologies, are studied via simulation. Similar to a typical aircraft maintenance, repair and overhaul (MRO) type of flow line (i.e. pulse line), each station in the simulated model consists of operation sequence alternatives, as well as resource alternatives for each operation. The simulation study investigates station selection rules for real-time resource sharing, resource selection rules among alternative resources at station level, and number of resource duplicates available in a manufacturing flow line in terms of their effect on system throughput, manufacturing lead time, resource utilisation levels and process wait time for resources. With input provided by an aerospace company, a hypothetical maintenance line with 10 stations is modelled using the Arena (TM) Simulation package and experimental results are statistically analysed.", "paper_title": "RFID-enabled shared resource management for aerospace maintenance operations: a dynamic resource allocation model", "paper_id": "WOS:000301919900009"}