{"auto_keywords": [{"score": 0.035581377548100174, "phrase": "physical_architecture"}, {"score": 0.00481495049065317, "phrase": "black_and_white_box"}, {"score": 0.004776669953449352, "phrase": "purpose_-_delight"}, {"score": 0.004375061788023814, "phrase": "rigorous_way"}, {"score": 0.003991110291836103, "phrase": "vital_subject"}, {"score": 0.003927848423072668, "phrase": "design_work"}, {"score": 0.0035973486787314883, "phrase": "order_cybernetics"}, {"score": 0.003347673061814698, "phrase": "pask"}, {"score": 0.003321008590273796, "phrase": "glanville"}, {"score": 0.003268333444704392, "phrase": "significantly_different_and_contradictory_insights"}, {"score": 0.003190878119415192, "phrase": "interactive_performative_architecture"}, {"score": 0.0030781126453776723, "phrase": "postgraduate_students"}, {"score": 0.002818909613625567, "phrase": "physical_performance"}, {"score": 0.0027192536281209463, "phrase": "common_theoretical_frame"}, {"score": 0.0025918235228843444, "phrase": "rich_variety"}, {"score": 0.0025405019456703325, "phrase": "observer_construction"}, {"score": 0.0024408799645640323, "phrase": "different_distinctions"}, {"score": 0.0022712795176156536, "phrase": "external_environment"}, {"score": 0.002121913011761504, "phrase": "continual_delight"}], "paper_keywords": ["cybernetics", " design"], "paper_abstract": "Purpose - Delight, and the possibility that an observer might continually delight in the same thing, is difficult to deal with in a rigorous way. Very little has been written recently about this subject. The purpose of this paper is to offer insights about this vital subject with reference to design work being undertaken at UCL. Design/methodology/approach - It is the contention of this paper that arguments taken from constructivism and second, order cybernetics can help in this. The cyberneticians who have most significantly dealt with cybernetics and physical architecture are Pask and Glanville. They offer significantly different and contradictory insights. Techniques for conceptualising an interactive performative architecture are discussed, based on work undertaken with postgraduate students at the Bartlett Interactive Architecture Workshop, UCL. Findings - Glanville and Pask can be reconciled. When physical architecture can be considered as contributing to physical performance both sets of insights can exist in a common theoretical frame. Practical implications - Designers should consider creating work that contains rich variety and the cues for observer construction, while also offering the possibility of ambiguity where different distinctions are equally possible. It is possible to utilise the differences that arise from changes in the external environment to manipulate the latter. Originality/value - The paper suggests ways of creating places that offer continual delight to their observers.", "paper_title": "How to design a black and white box", "paper_id": "WOS:000251883500013"}