{"auto_keywords": [{"score": 0.04539751403115773, "phrase": "functional_descriptions"}, {"score": 0.00817540440622815, "phrase": "different_meanings"}, {"score": 0.00481495049065317, "phrase": "engineering_meanings"}, {"score": 0.00447115003744675, "phrase": "position_paper"}, {"score": 0.004175533280178052, "phrase": "methodological_point"}, {"score": 0.0038332390893263844, "phrase": "single_meaning"}, {"score": 0.0033048445033866795, "phrase": "family_resemblance_concept"}, {"score": 0.0031393948330209255, "phrase": "straightforward_response"}, {"score": 0.002965229277927781, "phrase": "engineering_research"}, {"score": 0.002931569771634119, "phrase": "design_methodology"}, {"score": 0.0027374647587075935, "phrase": "coexisting_meanings"}, {"score": 0.0023463203637929466, "phrase": "particular_meaning"}, {"score": 0.0021049977753042253, "phrase": "methodological_implications"}], "paper_keywords": ["Ambiguity of Functional Descriptions", " Conceptual Analysis", " Engineering Design Methods", " Functions"], "paper_abstract": "In this position paper, the ambiguity of functional descriptions in engineering is considered from a methodological point of view. Four responses to this ambiguity are discussed, ranging from defining a single meaning of function and rejecting the different meanings that are currently used in engineering to accepting these meanings as coexisting in engineering and taking function as a family resemblance concept. Rejecting the different meanings is described as the straightforward response to resolving the ambiguity of functional descriptions, yet in engineering research and design methodology it rather seems to be accepted that engineers do use the coexisting meanings side by side. In this paper, explanations are given of why this practice is beneficial to engineering. Then it is explored how the particular meaning that engineers attach to function depends on the tasks for which functional descriptions are used. Finally, the methodological implications of the four responses to the ambiguity of functional descriptions are discussed.", "paper_title": "The coexistence of engineering meanings of function: Four responses and their methodological implications", "paper_id": "WOS:000322175800002"}