{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "tree-like_super_entity_component"}, {"score": 0.03522217928496279, "phrase": "tree-like_super_entity"}, {"score": 0.0044692705329574, "phrase": "large-scale_integration"}, {"score": 0.0042912493195237725, "phrase": "multi-source_information"}, {"score": 0.003850299959557491, "phrase": "multiple_structures"}, {"score": 0.0034311578789991363, "phrase": "white-box_and_black-box_methods"}, {"score": 0.0030163012350270025, "phrase": "information_organization_method"}, {"score": 0.002975652654536407, "phrase": "multi-level_entities"}, {"score": 0.002687702958515561, "phrase": "information_presentation_method"}, {"score": 0.0026157259734105, "phrase": "editable_e-book_component"}, {"score": 0.00222249726328354, "phrase": "yangtze_river"}, {"score": 0.0021926568699349703, "phrase": "china"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["E-book", " Tree-like super entity", " Component", " Information presentation", " Multi-source", " QQ"], "paper_abstract": "Information systems are increasingly oriented in the direction of large-scale integration due to the explosion of multi-source information. It is therefore important to discuss how to reasonably organize and present information from multiple structures and sources on the same information system platform. In this study, we propose a 3C (Components, Connections, Container) component model by combining white-box and black-box methods, design a tree-like super entity based on the model, present its construction and related algorithm, and take a tree-like super entity as the information organization method for multi-level entities. In order to represent structural, semi-structural and non-structural data on the same information system platform, an information presentation method based on an editable e-book component has been developed by combining the tree-like super entity component, QQ-style menu and 1/K switch connection component, which has been successfully applied in the Flood Protection Project Information System of the Yangtze River in China. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "An information presentation method based on tree-like super entity component", "paper_id": "WOS:000292227600004"}