{"auto_keywords": [{"score": 0.04186435485228401, "phrase": "citizenship_behaviors"}, {"score": 0.017371488428113976, "phrase": "vc_attachment"}, {"score": 0.008473106723744593, "phrase": "vc"}, {"score": 0.00481495049065317, "phrase": "building_community_citizenship_behaviors"}, {"score": 0.004583878086896926, "phrase": "members'_voluntary_and_beneficial_behaviors"}, {"score": 0.004257806363128601, "phrase": "professional_virtual_communities"}, {"score": 0.0036553070575015344, "phrase": "theoretical_model"}, {"score": 0.003496868378204657, "phrase": "different_effects"}, {"score": 0.003378395207923185, "phrase": "vcs"}, {"score": 0.0032160319265621285, "phrase": "marketing_literature"}, {"score": 0.003016544840824688, "phrase": "vc-self_connection"}, {"score": 0.002680114113899346, "phrase": "professional_vc."}, {"score": 0.0022005118194652704, "phrase": "members'_vc_attachment"}], "paper_keywords": ["Virtual Community", " Citizenship Behaviors", " Self-Concept", " Virtual Community Attachment", " Satisfaction"], "paper_abstract": "Members' voluntary and beneficial behaviors (i.e., citizenship behaviors) are central to the development and success of professional virtual communities (VCs). In this study, we identify two types of citizenship behaviors in VCs: those directed toward the VC and those directed toward individuals. We propose a theoretical model to examine whether VC attachment and satisfaction can have different effects on the two types of citizenship behaviors in VCs. Drawing on the \"self-concept\" as noted in marketing literature, we identify three needs to be fulfilled in order to establish the VC-self connection and model them as the antecedents of VC attachment and satisfaction. We empirically test the model with data collected from 196 users of a professional VC. The results indicate that VC attachment plays a more important role in explaining citizenship behaviors directed toward the VC and that satisfaction plays a more important role in explaining citizenship behaviors directed toward individuals. In addition, the three aspects of the self-concept are associated with members' VC attachment and satisfaction. We discuss the implications of our findings.", "paper_title": "Building Community Citizenship Behaviors: The Relative Role of Attachment and Satisfaction", "paper_id": "WOS:000367680500002"}