{"auto_keywords": [{"score": 0.04510984240196651, "phrase": "geological_storytelling"}, {"score": 0.04310575418441609, "phrase": "geological_stories"}, {"score": 0.00481495049065317, "phrase": "structural_geological_models"}, {"score": 0.004780030485538593, "phrase": "exploratory_subsea_imaging"}, {"score": 0.004592427776766215, "phrase": "structural_geological_processes"}, {"score": 0.004192872425727907, "phrase": "rapid_and_expressive_geomodeling"}, {"score": 0.0040135756033094225, "phrase": "reasoning_process"}, {"score": 0.0037315599283579593, "phrase": "large_variety"}, {"score": 0.003201967054773186, "phrase": "illustrative_animations"}, {"score": 0.0031099353574309606, "phrase": "complex_geological_evolution"}, {"score": 0.003064913196639932, "phrase": "decision_makers"}, {"score": 0.003009548189374684, "phrase": "complete_pipeline"}, {"score": 0.0028597742552122305, "phrase": "externalized_artifacts"}, {"score": 0.002591595184168144, "phrase": "domain_experts"}, {"score": 0.0025447584328314754, "phrase": "modeling_challenges"}, {"score": 0.0025170626402362633, "phrase": "daily_basis"}, {"score": 0.002435766348668389, "phrase": "geological_storytelling_prototype"}, {"score": 0.002272641094287882, "phrase": "rapid_and_expressive_sketching"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sketch-based modeling", " Externalization of mental processes", " Storytelling", " 3D model synthesis", " Animation", " Alternatives exploration", " Geology", " Structural geological models"], "paper_abstract": "Developing structural geological models from exploratory subsea imaging is difficult and an ill-posed process. The structural geological processes that take place in the subsurface are both complex and time-dependent. We present Geological Storytelling, a novel graphical system for performing rapid and expressive geomodeling. Geologists can convey geological stories that externalize both their model and the reasoning process behind it through our simple, yet expressive sketch-based, flip-over canvases. This rapid modeling interface makes it easy to construct a large variety of geological stories, and our story tree concept facilitates easy management and the exploration of these alternatives. The stories are then animated and the geologists can examine and compare them to identify the most plausible models. Finally, the geological stories can be presented as illustrative animations of automatically synthesized 3D models, which efficiently communicate the complex geological evolution to non-experts and decision makers. Geological storytelling provides a complete pipeline from the ideas and knowledge in the mind of the geologist, through externalized artifacts specialized for discussion and knowledge dissemination among peer-experts, to automatically rendered illustrative 3D animations for communication to lay audience. We have developed geological storytelling in collaboration with domain experts that work with the modeling challenges on a daily basis. For evaluation, we have developed a geological storytelling prototype and presented it to experts and academics from the geosciences. In their feedback, they acknowledge that the rapid and expressive sketching of stories can make them explore more alternatives and that the 3D illustrative animations assist in communicating their models. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Geological storytelling", "paper_id": "WOS:000321532100014"}