{"auto_keywords": [{"score": 0.028205894990340208, "phrase": "pt"}, {"score": 0.0035965032173588753, "phrase": "complete_mutual_anonymity"}, {"score": 0.0034817084307034955, "phrase": "trust_management"}, {"score": 0.0033888405252810927, "phrase": "zero-knowledge_authentication_scheme"}, {"score": 0.003352388337911934, "phrase": "pseudo_trust"}, {"score": 0.003074495313651187, "phrase": "unforgeable_and_verifiable_pseudonym"}, {"score": 0.0030250067691601967, "phrase": "one-way_hash_function"}, {"score": 0.0029763124376934787, "phrase": "novel_authentication_scheme"}, {"score": 0.002928399649340438, "phrase": "zero-knowledge_proof"}, {"score": 0.0027443174539994925, "phrase": "sensitive_information"}, {"score": 0.002333044307949414, "phrase": "trace-driven_simulations"}, {"score": 0.0021049977753042253, "phrase": "centralized_trusted_party"}], "paper_keywords": ["Peer-to-Peer", " authentication", " mutual anonymity", " trust", " Zero-Knowledge Proof"], "paper_abstract": "Most trust models in Peer-to-Peer (P2P) systems are identity based, which means that in order for one peer to trust another, it needs to know the other peer's identity. Hence, there exists an inherent trade-off between trust and anonymity. To the best of our knowledge, there is currently no P2P protocol that provides complete mutual anonymity as well as authentication and trust management. We propose a zero-knowledge authentication scheme called Pseudo Trust (PT), where each peer, instead of using its real identity, generates an unforgeable and verifiable pseudonym using a one-way hash function. A novel authentication scheme based on Zero-Knowledge Proof is designed so that peers can be authenticated without leaking any sensitive information. With the help of PT, most existing identity-based trust management schemes become applicable in mutual anonymous P2P systems. We analyze the security and the anonymity in PT and evaluate its performance using trace-driven simulations and a prototype PT-enabled P2P network. The strengths of our design include the following: 1) no need for a centralized trusted party or Certificate Authority (CA); 2) high scalability and security; 3) low traffic and cryptography processing overheads; and 4) man-in-the-middle-attacks resistance.", "paper_title": "Pseudo trust: Zero-knowledge authentication in anonymous P2Ps", "paper_id": "WOS:000258642200003"}