{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ordinal-bounded_memory"}, {"score": 0.004707188147442449, "phrase": "bounded_example_memory_learner"}, {"score": 0.004567230180529598, "phrase": "finitely_many_data_items"}, {"score": 0.004348580182733617, "phrase": "set-driven_learning"}, {"score": 0.004267287100135339, "phrase": "stronger_and_stronger_learning_criteria"}, {"score": 0.0037109446302945903, "phrase": "constructive_transfinite"}, {"score": 0.003614124997453808, "phrase": "kleene's_universal_ordinal_notation_system"}, {"score": 0.0034539685987677376, "phrase": "learning_criterion"}, {"score": 0.003251376167695528, "phrase": "algorithmic_count-down"}, {"score": 0.003154566400499823, "phrase": "general_hierarchy_result"}, {"score": 0.002572158343938064, "phrase": "higher_ordinals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Inductive inference", " Bounded example memory", " Constructive ordinals", " Kolmogorov complexity"], "paper_abstract": "A bounded example memory learner operates incrementally and maintains a memory of finitely many data items. The paradigm is well-studied and known to coincide with set-driven learning. A hierarchy of stronger and stronger learning criteria had earlier been obtained when one considers, for each k is an element of N, iterative learners that can maintain a memory of at most k previously processed data items. We investigate an extension of the paradigm into the constructive transfinite. For this purpose we use Kleene's universal ordinal notation system O. To each ordinal notation in 0 one can associate a learning criterion in which the number of times a learner can extend its example memory is bounded by an algorithmic count-down from the notation. We prove a general hierarchy result: if b is larger than a in Kleene's system, then learners that extend their example memory \"at most b times\" can learn strictly more than learners that can extend their example memory \"at most a times\". For notations for ordinals below omega(2) the result only depends on the ordinals and is notation-independent. For higher ordinals it is notation-dependent. In the setting of learners with ordinal-bounded memory, we also study the impact of requiring that a learner cannot discard an element from memory without replacing it with a new one. A learner satisfying this condition is called cumulative. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Learning with ordinal-bounded memory from positive data", "paper_id": "WOS:000305312300022"}