{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "security_problem"}, {"score": 0.04958720442967608, "phrase": "inference_attacks"}, {"score": 0.00853632089695222, "phrase": "object-oriented_databases"}, {"score": 0.005178133883495694, "phrase": "static_type_inference"}, {"score": 0.004297795905522757, "phrase": "database_instance"}, {"score": 0.0034771228725942846, "phrase": "equational_logic"}, {"score": 0.003234299589505403, "phrase": "decidable_sufficient_condition"}, {"score": 0.0029620573986902416, "phrase": "sufficient_condition"}, {"score": 0.0029164434911787187, "phrase": "over-estimate_inference_attacks"}, {"score": 0.0028864239961184338, "phrase": "over-estimated_results"}, {"score": 0.0028127163745564777, "phrase": "third_contribution"}, {"score": 0.002408265305704217, "phrase": "static_type_inferability"}, {"score": 0.0022283519468680475, "phrase": "large_degree"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["object-oriented database", " database security", " inference attack", " computational complexity"], "paper_abstract": "A query is said to be secure against inference attacks by a user if there exists no database instance for which the user can infer the result of the query, using only authorized queries to the user. In this paper, first, the security problem against inference attacks on object-oriented databases is formalized. The definition of inference attacks is based on equational logic. Secondly, the security problem is shown to be undecidable, and a decidable sufficient condition for a given query to be secure under a given schema is proposed. The idea of the sufficient condition is to over-estimate inference attacks using over-estimated results of static type inference. The third contribution is to propose subclasses of schemas and queries for which the security problem becomes decidable. Lastly, the decidability of the security problem is shown to be incomparable with the static type inferability, although the tightness of the over-estimation of the inference attacks is affected in a large degree by that of the static type inference. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "An equational logic based approach to the security problem against inference attacks on object-oriented databases", "paper_id": "WOS:000246703900007"}