{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "academic_and_research_environment"}, {"score": 0.004656871909510407, "phrase": "purpose_-_the_purpose"}, {"score": 0.004143196873246147, "phrase": "e-mail_questionnaire"}, {"score": 0.0037168948492715386, "phrase": "new_technology"}, {"score": 0.0036553070575015344, "phrase": "faculty_members"}, {"score": 0.003404703106153948, "phrase": "highest_response"}, {"score": 0.0033204052817782438, "phrase": "ecological_science"}, {"score": 0.002978508766388785, "phrase": "e-mail_communication"}, {"score": 0.0029169007179202164, "phrase": "text_processing"}, {"score": 0.0028209599545587745, "phrase": "numerical_computing"}, {"score": 0.0027974705482714884, "phrase": "dna_sequence_analysis"}, {"score": 0.0025623050508233078, "phrase": "user_education"}, {"score": 0.0023864566654035924, "phrase": "free_trial_offer"}, {"score": 0.0023665781963822918, "phrase": "kluwer"}, {"score": 0.002346861891137455, "phrase": "edutech"}, {"score": 0.0022413233627905696, "phrase": "previous_study"}, {"score": 0.002194929830604162, "phrase": "users'_perspectives"}, {"score": 0.0021316247138109816, "phrase": "india"}, {"score": 0.0021049977753042253, "phrase": "questionnaire_method"}], "paper_keywords": ["electronic books", " academic libraries", " user studies", " case studies", " India"], "paper_abstract": "Purpose - The purpose of this study is to investigate the use and usability of e-books from the perspectives of users in an academic and research environment. Design/methodology/approach - This study involved an e-mail questionnaire to survey researchers in the academic and research environment of the Indian Institute of Science regarding their use of e-books. Findings - The responses indicated that the students tend to use this new technology more often than faculty members and staff. Those who did use e-books mostly used reference and technical material. The highest response was from the Centre for Ecological Science, followed by the Supercomputer Education and Research Centre, and then the Department of Molecular Reproduction and Development and Genetics. The majority of the respondents have used computers for over five years for a variety of purposes including e-mail communication, internet browsing and text processing as well as for other advanced uses such as numerical computing and DNA sequence analysis. However, the use of e-books appears to be very low, indicating a requirement for creating awareness and user education about both software and hardware related to e-books. Only 37 of the 104 respondents had used the free trial offer from Kluwer and Edutech eBooks during July 2004. Originality/value - There has been no previous study reported which has investigated users' perspectives of e-books in an academic and research environment in India using a questionnaire method.", "paper_title": "Use of e-books in an academic and research environment - A case study from the Indian Institute of Science", "paper_id": "WOS:000236038000005"}