{"auto_keywords": [{"score": 0.048564928403357514, "phrase": "network_applications"}, {"score": 0.00481495049065317, "phrase": "user_availability_prediction"}, {"score": 0.0047057084749407485, "phrase": "user_connectivity_patterns"}, {"score": 0.0038981499110532273, "phrase": "peer-to-peer_scenarios"}, {"score": 0.0037060428445111664, "phrase": "available_resources"}, {"score": 0.0035887342563437935, "phrase": "connectivity_patterns"}, {"score": 0.0035395987202335223, "phrase": "periodic_behavior"}, {"score": 0.0032436052954996097, "phrase": "future_user_connectivity"}, {"score": 0.002518746501941657, "phrase": "diverse_network_application_models"}, {"score": 0.002286781334850213, "phrase": "distributed_hash_tables"}, {"score": 0.002265833357217618, "phrase": "friend-to-friend_storage"}, {"score": 0.0022041312401435346, "phrase": "social_networks"}, {"score": 0.002163930783583212, "phrase": "substantial_gains"}, {"score": 0.0021441057555396013, "phrase": "data_availability"}, {"score": 0.002124461969404541, "phrase": "system_efficiency"}, {"score": 0.0021049977753042253, "phrase": "negligible_costs"}], "paper_keywords": ["Peer-to-peer computing", " predictive models", " user availability"], "paper_abstract": "User connectivity patterns in network applications are known to be heterogeneous and to follow periodic (daily and weekly) patterns. In many cases, the regularity and the correlation of those patterns is problematic: For network applications, many connected users create peaks of demand; in contrast, in peer-to-peer scenarios, having few users online results in a scarcity of available resources. On the other hand, since connectivity patterns exhibit a periodic behavior, they are to some extent predictable. This paper shows how this can be exploited to anticipate future user connectivity and to have applications proactively responding to it. We evaluate the probability that any given user will be online at any given time, and assess the prediction on 6-month availability traces from three different Internet applications. Building upon this, we show how our probabilistic approach makes it easy to evaluate and optimize the performance in a number of diverse network application models and to use them to optimize systems. In particular, we show how this approach can be used in distributed hash tables, friend-to-friend storage, and cache preloading for social networks, resulting in substantial gains in data availability and system efficiency at negligible costs.", "paper_title": "On User Availability Prediction and Network Applications", "paper_id": "WOS:000360067600021"}