{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "music_creation"}, {"score": 0.04915207774681705, "phrase": "networked_music_environments"}, {"score": 0.004562847483469705, "phrase": "experimental_artists"}, {"score": 0.004366387782457736, "phrase": "musical_purposes"}, {"score": 0.00428179779071721, "phrase": "evident_progress"}, {"score": 0.004198839649063847, "phrase": "networked_music_research"}, {"score": 0.0036079110889031874, "phrase": "rich_internet_applications"}, {"score": 0.003572795357205119, "phrase": "youtube"}, {"score": 0.00353798573140041, "phrase": "flickr"}, {"score": 0.0034693659976716197, "phrase": "passive_user"}, {"score": 0.0034187896011435245, "phrase": "active_producer"}, {"score": 0.003130396338031522, "phrase": "effective_support"}, {"score": 0.003099888654615187, "phrase": "musical_creation"}, {"score": 0.0028662606272282926, "phrase": "cooperative_ways"}, {"score": 0.002254510319372956, "phrase": "codes_design"}, {"score": 0.002157223877108711, "phrase": "good_starting_point"}, {"score": 0.0021049977753042253, "phrase": "novice-oriented_perspective"}], "paper_keywords": [""], "paper_abstract": "Networked music environments (NMEs) allow experimental artists to explore the implications of interconnecting their computers for musical purposes. Despite an evident progress in recent years of networked music research, very little attention has been paid to a very common potential kind of user: novices in music, that is, users with little or no previous music knowledge. Indeed, the same way that principles of Rich Internet Applications like YouTube and Flickr have turned the passive user into an active producer of content, we are investigating the issues to be considered by networked music environments in order to allow effective support of musical creation and experimentation by novices. CODES-a Web-based environment designed to support cooperative ways of music creation by novices-puts these principles into practice. The goal of this paper is to present, discuss and illustrate two main principles: (1) music creation by novices should be prototypical; and (2) music creation by novices should be cooperative. These principles have emerged during CODES design and development and we think they are a good starting point for further investigation of a novice-oriented perspective of NME dimensions.", "paper_title": "Principles for Music Creation by Novices in Networked Music Environments", "paper_id": "WOS:000299783300003"}