{"auto_keywords": [{"score": 0.044687140822566564, "phrase": "rtls"}, {"score": 0.010612385608070223, "phrase": "real-time_location_systems"}, {"score": 0.006515764014440988, "phrase": "organizational_constraints"}, {"score": 0.0044225461990535855, "phrase": "u._s._hospitals"}, {"score": 0.004034444399739595, "phrase": "organizational_effects"}, {"score": 0.003345680943026579, "phrase": "aggregate_analysis"}, {"score": 0.003255777265493076, "phrase": "specific_technologies"}, {"score": 0.0032336801561165113, "phrase": "hospital_case_studies"}, {"score": 0.002850819170139645, "phrase": "current_best_use"}, {"score": 0.0028026735035370206, "phrase": "asset_tracking"}, {"score": 0.0027459678326877744, "phrase": "whole-hospital_deployment"}, {"score": 0.0027088011534576856, "phrase": "centralized_control"}, {"score": 0.0026449626324264275, "phrase": "materials_management"}, {"score": 0.002627000223796678, "phrase": "biomedical_engineering_departments"}, {"score": 0.002547663224855668, "phrase": "organizational_barriers"}, {"score": 0.0023798115577749225, "phrase": "potential_benefits"}, {"score": 0.002284444272376043, "phrase": "available_technological_options"}, {"score": 0.0022154296909169826, "phrase": "myriad_material"}, {"score": 0.0021484955960643167, "phrase": "rtls_implementation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Real-time location systems (RTLS)", " RFID", " Equipment tracking", " Patient tracking", " Personnel tracking", " Hospitals", " Sociotechnical systems"], "paper_abstract": "Objective: The purpose of the research was to assess real-time location systems (RTLS) that have been implemented in U. S. hospitals. We examined the type of uses to which RTLS have been put, the degree of functionality of the various technologies and software, and the organizational effects of implementing RTLS. Methods: The project was a 3-year qualitative study of 23 U.S. hospitals that had implemented RTLS for the purpose of tracking assets, personnel, and/or patients. We observed the systems in use and conducted 80 semi-structured interviews with hospital personnel and vendors. In order to protect the confidentiality of the hospitals and vendors in our sample, we conducted an aggregate analysis of our findings rather than providing evaluations of specific technologies or hospital case studies. Results: The most important findings from our research were (1) substandard functionality of most real-time location systems in use and (2) serious obstacles to effective deployment of the systems due to the material and organizational constraints of the hospitals themselves. We found that the current best use of RTLS is for asset tracking, but importantly it requires whole-hospital deployment as well as centralized control of the system, preferably by materials management or biomedical engineering departments. Discussion: There are serious technological, material, and organizational barriers to the implementation of RTLS, and these barriers need to be overcome if hospitals are to maximize the potential benefits of these systems. Conclusion: In addition to considering the available technological options, hospitals must assess their unique environments, including the myriad material and organizational constraints that will affect the success of RTLS implementation. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Evaluation of real-time location systems in their hospital contexts", "paper_id": "WOS:000308976000017"}