{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "text_classification"}, {"score": 0.032219105140299784, "phrase": "misclassification_information"}, {"score": 0.004590217765551337, "phrase": "authors'_objective"}, {"score": 0.004497129150551236, "phrase": "document_categories"}, {"score": 0.004316552692395911, "phrase": "concept_hierarchy"}, {"score": 0.003701401653850141, "phrase": "\"non-sibling\"_relationships"}, {"score": 0.0034450303951025704, "phrase": "relationship_network"}, {"score": 0.0031305230217636495, "phrase": "nonobvious_category_relationships"}, {"score": 0.002953711377604328, "phrase": "potential_relationships"}, {"score": 0.0028446460307503343, "phrase": "statistically_significant_improvement"}, {"score": 0.002815604242104671, "phrase": "current_approach"}, {"score": 0.0026839372202435065, "phrase": "open_directories_project"}, {"score": 0.0025759787655463212, "phrase": "special_interest_group_on_information_retrieval"}, {"score": 0.0025409639091476363, "phrase": "data_sets"}, {"score": 0.002455489835065937, "phrase": "passage_classification"}, {"score": 0.0022311183974368484, "phrase": "sigir"}, {"score": 0.0021049977753042253, "phrase": "feature_selection"}], "paper_keywords": [""], "paper_abstract": "Discovering relationships among concepts and categories is crucial in various information systems. The authors' objective was to discover such relationships among document categories. Traditionally, such relationships are represented in the form of a concept hierarchy, grouping some categories under the same parent category. Although the nature of hierarchy supports the identification of categories that may share the same parent, not all of these categories have a relationship with each other other than sharing the same parent. However, some \"non-sibling\" relationships exist that although are related to each other are not identified as such. The authors identify and build a relationship network (relationship-net) with categories as the vertices and relationships as the edges of this network. They demonstrate that using a relationship-net, some nonobvious category relationships are detected. Their approach capitalizes on the misclassification information generated during the process of text classification to identify potential relationships among categories and automatically generate relationship-nets. Their results demonstrate a statistically significant improvement over the current approach by up to 73% on 20 News groups 20NG, up to 68% on 17 categories in the Open Directories Project (ODP17), and more than twice on ODP46 and Special Interest Group on Information Retrieval (SIGIR) data sets. Their results also indicate that using misclassification information stemming from passage classification as opposed to document classification statistically significantly improves the results on 20NG (8%), ODP17 (5%), ODP46 (73%), and SIGIR (117%) with respect to F1 measure. By assigning weights to relationships and by performing feature selection, results are further optimized.", "paper_title": "Detecting Relationships Among Categories Using Text Classification", "paper_id": "WOS:000276991500013"}