{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adverse_drug_reactions"}, {"score": 0.04959522198262252, "phrase": "medical_intensive_care_unit"}, {"score": 0.04558803874470615, "phrase": "positive_predictive_values"}, {"score": 0.004702168843383725, "phrase": "clinical_event_monitors"}, {"score": 0.004623224002010226, "phrase": "active_medication_monitoring_system"}, {"score": 0.0044844333655153605, "phrase": "possible_adverse_drug_reactions"}, {"score": 0.004439097815805505, "phrase": "primary_goal"}, {"score": 0.004335081499311714, "phrase": "select_signals"}, {"score": 0.00396954278887152, "phrase": "six-week_period"}, {"score": 0.0039028497942174777, "phrase": "five_signals"}, {"score": 0.0025630077791393125, "phrase": "blood_urea_nitrogen"}, {"score": 0.0025198864435531055, "phrase": "quinidine_alert"}, {"score": 0.0022992346264367374, "phrase": "intensive_care_unit_patient_safety_surveillance_systems"}, {"score": 0.002185092297972985, "phrase": "good_performance_characteristics"}, {"score": 0.002162951519368368, "phrase": "commonly_available_laboratory"}, {"score": 0.002148315508445588, "phrase": "medication_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Information systems", " Decision support systems", " Clinical", " Adverse drug reaction reporting systems", " Intensive care units", " Critical care", " Safety", " Adverse drug event", " Drug toxicity"], "paper_abstract": "Objective: Clinical event monitors are a type of active medication monitoring system that can use signals to alert clinicians to possible adverse drug reactions. The primary goal was to evaluate the positive predictive values of select signals used to automate the detection of ADRs in the medical intensive care unit. Method: This is a prospective, case series of adult patients in the medical intensive care unit during a six-week period who had one of five signals presents: an elevated blood urea nitrogen, vancomycin, or quinidine concentration, or a low sodium or glucose concentration. Alerts were assessed using 3 objective published adverse drug reaction determination instruments. An event was considered an adverse drug reaction when 2 out of 3 instruments had agreement of possible, probable or definite. Positive predictive values were calculated as the proportion of alerts that occurred, divided by the number of times that alerts occurred and adverse drug reactions were confirmed. Results: 145 patients were eligible for evaluation. For the 48 patients (50% male) having an alert, the mean +/- SD age was 62 +/- 19 years. A total of 253 alerts were generated. Positive predictive values were 1.0, 0.55, 0.38 and 0.33 for vancomycin, glucose, sodium, and blood urea nitrogen, respectively. A quinidine alert was not generated during the evaluation. Conclusions: Computerized clinical event monitoring systems should be considered when developing methods to detect adverse drug reactions as part of intensive care unit patient safety surveillance systems, since they can automate the detection of these events using signals that have good performance characteristics by processing commonly available laboratory and medication information. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Computerized detection of adverse drug reactions in the medical intensive care unit", "paper_id": "WOS:000292509100017"}