{"auto_keywords": [{"score": 0.04825088423412617, "phrase": "logical_arguments"}, {"score": 0.035136827273338375, "phrase": "weather_report"}, {"score": 0.02453805264720335, "phrase": "intended_logical_argument"}, {"score": 0.02396865354213625, "phrase": "intended_recipient"}, {"score": 0.004786211598268987, "phrase": "logic-based_models"}, {"score": 0.004011086974442549, "phrase": "real-world_agents"}, {"score": 0.0030904433394138963, "phrase": "assumed_knowledge"}, {"score": 0.0029991500396912923, "phrase": "intended_argument"}, {"score": 0.002741091312632307, "phrase": "logic-based_formalizations"}, {"score": 0.002628362641980801, "phrase": "logic-based_framework"}, {"score": 0.002581477142020187, "phrase": "design_features"}, {"score": 0.0025202582748972122, "phrase": "relevance_theory"}, {"score": 0.0024901970329668467, "phrase": "sperber"}, {"score": 0.0024758536318811755, "phrase": "wilson"}, {"score": 0.002387758958649797, "phrase": "cognitive_effect"}, {"score": 0.002366361492754389, "phrase": "cognitive_effort"}, {"score": 0.002124036931047162, "phrase": "sperber_andwilson's_relevance_theory"}, {"score": 0.0021049977753042253, "phrase": "formal_properties"}], "paper_keywords": ["Agents", " dialogue", " argumentation", " enthymemes", " relevance theory"], "paper_abstract": "In most proposals for logic-based models of argumentation dialogues between agents, the arguments exchanged are logical arguments of the form <<Phi,alpha >> where Phi is a set of formulae (called the support) and alpha is a formula (called the claim) such that Phi is consistent and Phi entails alpha. However, arguments presented by real-world agents do not normally fit the mould of being logical arguments. They are normally enthymemes, and so they only explicitly represent some of the premises for entailing their claim and/or they do not explicitly state their claim. For example, for a claim that 'you need an umbrella today', a husband may give his wife the premise 'the weather report predicts rain'. Clearly, the premise does not entail the claim, but it is easy for the wife to identify the assumed knowledge used by the husband in order to reconstruct the intended argument correctly (i.e. 'if the weather report predicts rain, then you need an umbrella'). Whilst humans are constantly handling examples like this, proposals for logic-based formalizations of the process remain underdeveloped. In this article, we present a logic-based framework for handling enthymemes, some design features of which are influenced by aspects of relevance theory (proposed by Sperber and Wilson). In particular, we use the ideas of maximizing cognitive effect and minimizing cognitive effort in order to enable a proponent of an intended logical argument to construct an enthymeme appropriate for the intended recipient, and for the intended recipient to deconstruct the intended logical argument from the enthymeme. We relate our framework back to Sperber andWilson's relevance theory via some formal properties.", "paper_title": "A Relevance-theoretic Framework for Constructing and Deconstructing Enthymemes", "paper_id": "WOS:000299346400004"}