{"auto_keywords": [{"score": 0.04959522198262252, "phrase": "tail_objectives"}, {"score": 0.015212216443097733, "phrase": "optimum_value"}, {"score": 0.00887102741824477, "phrase": "concurrent_games"}, {"score": 0.0059874450944054245, "phrase": "quantitative_analysis"}, {"score": 0.005021471456467087, "phrase": "omega-regular_objectives"}, {"score": 0.004814960788333101, "phrase": "concurrent"}, {"score": 0.004702168843383725, "phrase": "infinite_stochastic_games"}, {"score": 0.004607594060491493, "phrase": "finite_state_space"}, {"score": 0.0044844333655153605, "phrase": "infinite_traces"}, {"score": 0.004219174171937721, "phrase": "next_state"}, {"score": 0.00414830454375092, "phrase": "probability_distribution"}, {"score": 0.004078620439629185, "phrase": "current_state"}, {"score": 0.0039028497942174777, "phrase": "infinite_number"}, {"score": 0.0037984549828326106, "phrase": "concurrent_stochastic_games"}, {"score": 0.0030783143919343972, "phrase": "new_proof_techniques"}, {"score": 0.002905827490766696, "phrase": "positive_limit-one_property"}, {"score": 0.0027152006721460347, "phrase": "tail_objective"}, {"score": 0.0024690950486552653, "phrase": "optimum_values"}, {"score": 0.0023465400668244386, "phrase": "equilibrium_values"}, {"score": 0.0022605410856853785, "phrase": "simpler_reachability_objectives"}, {"score": 0.002199978308846543, "phrase": "polynomial_time_reduction"}, {"score": 0.0021410346041739804, "phrase": "qualitative_analysis"}, {"score": 0.0021049977753042253, "phrase": "one-player_stochastic_games"}], "paper_keywords": [""], "paper_abstract": "We study infinite stochastic games played by two-players over a finite state space, with objectives specified by sets of infinite traces. The games are concurrent (players make moves simultaneously and independently), stochastic (the next state is determined by a probability distribution that depends on the current state and chosen moves of the players) and infinite (proceeds for infinite number of rounds). The analysis of concurrent stochastic games can be classified into: quantitative analysis, analyzing the optimum value of the game; and qualitative analysis, analyzing the set of states with optimum value 1. We consider concurrent games with tail objectives, i.e., objectives that are independent of the finite-prefix of traces, and show that the class of tail objectives are strictly richer than the omega-regular objectives. We develop new proof techniques to extend several properties of concurrent games with omega-regular objectives to concurrent games with tail objectives. We prove the positive limit-one property for tail objectives, that states for all concurrent games if the optimum value for a player is positive for a tail objective Phi at some state, then there is a state where the optimum value is 1 for Phi, for the player. We also show that the optimum values of zero-sum (strictly conflicting objectives) games with tail objectives can be related to equilibrium values of nonzero-sum (not strictly conflicting objectives) games with simpler reachability objectives. A consequence of our analysis presents a polynomial time reduction of the quantitative analysis of tail objectives to the qualitative analysis for the sub-class of one-player stochastic games (Markov decision processes).", "paper_title": "Concurrent games with tail objectives", "paper_id": "WOS:000241587300017"}