{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "content_publishing"}, {"score": 0.0368372167659939, "phrase": "content_publishers"}, {"score": 0.004774115617883476, "phrase": "popular_bittorrent_portals"}, {"score": 0.004310173770196077, "phrase": "growing_popularity"}, {"score": 0.004130376386308024, "phrase": "valuable_content"}, {"score": 0.0039077616208517026, "phrase": "required_resources"}, {"score": 0.0034386016613475335, "phrase": "altruistic_fashion"}, {"score": 0.0033517342967390065, "phrase": "financial_incentives"}, {"score": 0.002790004829699627, "phrase": "major_publishers"}, {"score": 0.002742787059497186, "phrase": "antipiracy_agencies"}, {"score": 0.0027194778713860715, "phrase": "malicious_users"}, {"score": 0.002696366237523415, "phrase": "\"fake\"_files"}, {"score": 0.0026620655619396263, "phrase": "copyrighted_content"}, {"score": 0.002539978170928796, "phrase": "fake_publishers"}, {"score": 0.0024969812322112174, "phrase": "major_bittorrent_portals"}, {"score": 0.002253826965566618, "phrase": "profit-driven_publishers"}, {"score": 0.002215663255682209, "phrase": "altruistic_top_publishers"}, {"score": 0.0021504218042734677, "phrase": "larger_fraction"}, {"score": 0.002132135985573126, "phrase": "loyal_consumers"}, {"score": 0.0021049977753042253, "phrase": "higher_degree"}], "paper_keywords": ["BitTorrent", " business model", " content publishing", " measurements"], "paper_abstract": "BitTorrent is the most popular peer-to-peer (P2P) content delivery application where individual users share various types of content with tens of thousands of other users. The growing popularity of BitTorrent is primarily due to the availability of valuable content without any cost for the consumers. However, apart from the required resources, publishing valuable (and often copyrighted) content has serious legal implications for the users who publish the material. This raises the question that whether (at least major) content publishers behave in an altruistic fashion or have other motives such as financial incentives. In this paper, we identify the content publishers of more than 55 K torrents in two major BitTorrent portals and examine their characteristics. We discover that around 100 publishers are responsible for publishing 67% of the content, which corresponds to 75% of the downloads. Our investigation reveals several key insights about major publishers. First, antipiracy agencies and malicious users publish \"fake\" files to protect copyrighted content and spread malware, respectively. Second, excluding the fake publishers, content publishing in major BitTorrent portals appears to be largely driven by companies that try to attract consumers to their own Web sites for financial gain. Finally, we demonstrate that profit-driven publishers attract more loyal consumers than altruistic top publishers, whereas the latter have a larger fraction of loyal consumers with a higher degree of loyalty than the former.", "paper_title": "Unveiling the Incentives for Content Publishing in Popular BitTorrent Portals", "paper_id": "WOS:000329994300006"}