{"auto_keywords": [{"score": 0.022819514547430145, "phrase": "dbs"}, {"score": 0.00481495049065317, "phrase": "multi-modal_atlas"}, {"score": 0.00468991337957911, "phrase": "digital_brain_atlases"}, {"score": 0.004520272777451894, "phrase": "magnetic_resonance_imaging"}, {"score": 0.004133292222875435, "phrase": "digital_atlases"}, {"score": 0.00388016972840459, "phrase": "patient's_unique_anatomy"}, {"score": 0.0035665344993417603, "phrase": "popular_surgical_technique"}, {"score": 0.003529149828147388, "phrase": "parkinsonian_patients"}, {"score": 0.003312901888725435, "phrase": "postoperative_data"}, {"score": 0.0031594291695784286, "phrase": "basal_ganglia"}, {"score": 0.0030449789178940787, "phrase": "electrode_position"}, {"score": 0.0030130446986008277, "phrase": "post-operative_magnetic_resonance_imaging"}, {"score": 0.002798662730881037, "phrase": "atlas_space"}, {"score": 0.0024789887640568093, "phrase": "stn_dbs_electrodes"}, {"score": 0.0021612684684351974, "phrase": "probablisitic_distribution"}, {"score": 0.0021049977753042253, "phrase": "stn_electrodes"}], "paper_keywords": [""], "paper_abstract": "Digital brain atlases can be used in conjuction with magnetic resonance imaging (MRI) and computed tomography (CT) for planning and guidance during neurosurgery. Digital atlases are advantageous since they can be warped nonlinearly to fit each patient's unique anatomy. Functional neurosurgery with implantation of deep brain stimulating (DBS) electrodes requires accurate targeting, and has become a popular surgical technique in Parkinsonian patients. In this paper, we present a method for integrating postoperative data from subthalamic (STN) DBS implantation into an antomical atlas of the basal ganglia and thalamus. The method estimates electrode position from post-operative magnetic resonance imaging (MRI) data. These electrodes are then warped back into the atlas space and are modelled in three dimensions. The average of these models is then taken to show the region where the majority of STN DBS electrodes were implanted. The group with more favorable post-operative results was separated from the group which responded to the STN DBS implantation procedure less favourably to create a probablisitic distribution of DBS in the STN electrodes.", "paper_title": "Towards a multi-modal atlas for neurosurgical planning", "paper_id": "WOS:000241556700048"}