{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "iso"}, {"score": 0.016732311732762847, "phrase": "different_sectors"}, {"score": 0.009818924365313645, "phrase": "world-wide_diffusion"}, {"score": 0.004697655699119423, "phrase": "activity_sectors"}, {"score": 0.004659192888931046, "phrase": "purpose_-_the_purpose"}, {"score": 0.004380540407926982, "phrase": "industrial_sectors"}, {"score": 0.004238775572746022, "phrase": "quality_standards"}, {"score": 0.0035661605757956096, "phrase": "individual_industrial_sectors"}, {"score": 0.0032174507570710835, "phrase": "logistic_curve"}, {"score": 0.0031260524791486347, "phrase": "current_stage"}, {"score": 0.0030372426452745073, "phrase": "initial_stage"}, {"score": 0.0029631248341951064, "phrase": "saturation_stage"}, {"score": 0.002618730478351454, "phrase": "mathematical_models"}, {"score": 0.0023819914954155905, "phrase": "transition_period"}, {"score": 0.0021311850321045767, "phrase": "first_study"}, {"score": 0.0021049977753042253, "phrase": "heterogeneous_diffusion_pattern"}], "paper_keywords": ["ISO 9000 series", " Management standards", " Globolization", " Industrial performance"], "paper_abstract": "Purpose - The purpose of this paper is to analyse the evolution of the world-wide diffusion, according to industrial sectors of activity, of the ISO 9000 family of quality standards. Design/methodology/approach - Using data provided by the ISO itself, the evolution of the world-wide diffusion of the ISO 9000 family of standards from 1998 to 2008 is studied. Using two indices of instability, these data are then analysed in terms of individual industrial sectors to assess the heterogeneity of diffusion across different sectors of activity. Findings - The results show that the diffusion of ISO 9001 follows a logistic curve in all sectors, although the current stage of diffusion (in terms of initial stage, expansion stage, and saturation stage) differs between different sectors of activity. The sectors have been classified into three groups according to their possible future evolution. Research limitations/implications - Because the analysis of prediction is based on mathematical models, the validity of the data is crucial. Two weaknesses are detected in the data: the number of certificates during the transition period 2001-2003; and the number of certificates in 2008. However, both weaknesses are overcome in the paper. Originality/value - The paper presents the first study of the heterogeneous diffusion pattern of ISO 9001 in different sectors of activity.", "paper_title": "ISO 9001 diffusion analysis according to activity sectors", "paper_id": "WOS:000289587800016"}