{"auto_keywords": [{"score": 0.04739769411690479, "phrase": "wpasc"}, {"score": 0.015719716506582538, "phrase": "cooperative_programming_learning_behavior"}, {"score": 0.0047341211614980085, "phrase": "students'_learning_performance"}, {"score": 0.004607594060491493, "phrase": "web-based_programming_assisted_system"}, {"score": 0.004409127897028587, "phrase": "students'_cooperative_programming_learning"}, {"score": 0.004134273515080792, "phrase": "students'_opinions"}, {"score": 0.004078620439629185, "phrase": "learning_activity"}, {"score": 0.0037093941875325862, "phrase": "cooperative_programming_learning"}, {"score": 0.0036224139706218916, "phrase": "cooperative_programming_learning_activity"}, {"score": 0.00357362651129581, "phrase": "six_different_categories"}, {"score": 0.003294350220187021, "phrase": "confident_after_enlightenment_and_imitating_categories"}, {"score": 0.0029256091368059446, "phrase": "learning_motivation"}, {"score": 0.0028569549040495163, "phrase": "students'_learning_behavior"}, {"score": 0.0025028412246758994, "phrase": "programming_problem"}, {"score": 0.0022605410856853785, "phrase": "students'_learning_motivation"}, {"score": 0.002185092297972985, "phrase": "early_stage"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cooperative/collaborative learning", " Distributed learning environments", " Interactive learning environments", " Pedagogical issues", " Programming and programming languages"], "paper_abstract": "In this study we proposed a web-based programming assisted system for cooperation (WPASC) and we also designed one learning activity for facilitating students' cooperative programming learning. The aim of this study was to investigate cooperative programming learning behavior of students and its relationship with learning performance. Students' opinions and perceptions toward learning activity and the WPASC were also investigated. The results of this study revealed that most of students perceived that learning activity and the WPASC were useful for cooperative programming learning. Students' learning behavior during cooperative programming learning activity was classified into six different categories and we found that learning behavior has relationship with learning performance. Students from completely independent, self-improving using assistance, confident after enlightenment and imitating categories performed well due to their effective and motivated learning behavior. However, students from performing poorly without assistance and plagiarizing categories performed the worse; the former could not get assistance at all and the later had no learning motivation. The results also showed that students' learning behavior may have increasing, decreasing and no transition during problems solving. Therefore, performing poorly without assistance and plagiarizing learning behavior and decreasing transition or no transition in learning behavior should be identified right after completing a programming problem. Then the instructor should intervene into learning behavior in order to change it into more effective for learning. Besides, more incentives need to be given for increasing students' learning motivation and posting solutions and feedback by students at the early stage of a problem solving period. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A pilot study of cooperative programming learning behavior and its relationship with students' learning performance", "paper_id": "WOS:000301275600025"}