{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "asynchronous_e-learning"}, {"score": 0.00475924837336259, "phrase": "long-term_use"}, {"score": 0.003927516959113487, "phrase": "principal_aim"}, {"score": 0.0034753508746887957, "phrase": "teachers'_overall_satisfaction"}, {"score": 0.0030042210975126616, "phrase": "important_interaction_design"}, {"score": 0.0027687904688616983, "phrase": "e-learning_content"}, {"score": 0.0026119782818898193, "phrase": "cost-effective_educational_and_time_management"}, {"score": 0.0022841153001549193, "phrase": "human-computer_interaction_researchers"}, {"score": 0.0021927323694667694, "phrase": "usability_professionals"}, {"score": 0.002129701089817251, "phrase": "usability_and_accessibility_work"}, {"score": 0.0021049977753042253, "phrase": "e-learning_evaluation_studies"}], "paper_keywords": [""], "paper_abstract": "This article presents an evaluation of web-based, asynchronous e-learning in academic education, reflecting on its adoption and use in conjunction to teaching in the classroom. The principal aim of the study was to identify the implications of asynchronous e-learning to (a) students' and teachers' overall satisfaction and perceived performance, (b) the organization and management of learning, and (c) social interaction and collaboration between/among students and teachers. The results provide insights for important interaction design and development issues in e-learning such as note-taking and annotations on e-learning content, student comprehension and satisfaction, skipping courses, cost-effective educational and time management, social awareness, collaboration, oflaming,o and oborder-crossing.o The study reports on issues that need to be considered by human-computer interaction researchers, interaction design practitioners, and usability professionals and are complementary to usability and accessibility work in e-learning evaluation studies.", "paper_title": "Perceived Impact of Asynchronous E-Learning After Long-Term Use: Implications for Design and Development", "paper_id": "WOS:000286820100004"}