{"auto_keywords": [{"score": 0.037622209494166656, "phrase": "cve"}, {"score": 0.004327981760540394, "phrase": "users'_avatars"}, {"score": 0.004139850082354509, "phrase": "virtual_world"}, {"score": 0.003737485125097945, "phrase": "collaborative_task"}, {"score": 0.0034963129868796033, "phrase": "social_groups"}, {"score": 0.003449972561293443, "phrase": "graph-based_high_level_notation"}, {"score": 0.0032274710032321996, "phrase": "java"}, {"score": 0.0028875481626754696, "phrase": "developing_process_point"}, {"score": 0.0027865506182608263, "phrase": "collaboration_model"}, {"score": 0.00241658945942583, "phrase": "design_patterns"}, {"score": 0.002270546747744344, "phrase": "next_sections"}, {"score": 0.0021620042653528846, "phrase": "web_browser"}], "paper_keywords": [""], "paper_abstract": "A model and a Java Framework to aid the construction of 3D Web-based Collaborative Virtual Environments (3D-CVE) are described in this paper. The proposal emphasizes on the interaction and collaboration among the entities (users' avatars, agents, etc.) that populate the virtual world; and the services that they offer to each other in order to interact, or to carry out some kind of collaborative task. We propose a model for the conceptualization of CVE under the concept of social groups, a graph-based high level notation to specify the interactions among the entities that populate the CVE, and a Java based software framework that gives support to the model and the interaction graph in order to facilitate the implementation of the 3D-CVE. From the developing process point of view, the goal of the collaboration model and the framework proposed here is not only to develop 3D-CVE faster, but also the resulting 3D-CVEs have similar structures, they are easier to maintain and eventually to integrate. Design patterns were very useful to fulfill these characteristics, as we describe in the next sections. CVEs developed with the framework enable, through the Web browser, a shared understanding regarding many scientific, engineering and entertainment subjects concerned with three-dimensional data.", "paper_title": "3D Collaborative Virtual Environments over the Web", "paper_id": "WOS:000238089300090"}