{"auto_keywords": [{"score": 0.049850756629456816, "phrase": "bottleneck_routing_games"}, {"score": 0.03954731982213197, "phrase": "bottleneck_cost"}, {"score": 0.015535179707906162, "phrase": "routing_games"}, {"score": 0.013934496573549077, "phrase": "braess's_paradox"}, {"score": 0.013165058274950665, "phrase": "edge_removal"}, {"score": 0.012705606671785984, "phrase": "network_design_problem"}, {"score": 0.010564290379246024, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "network_design"}, {"score": 0.004723847090183984, "phrase": "selfish_behavior"}, {"score": 0.004601374835486024, "phrase": "network_performance"}, {"score": 0.004471370994268206, "phrase": "equilibrium_performance"}, {"score": 0.004313996835376177, "phrase": "counterintuitive_fact"}, {"score": 0.003939565240409143, "phrase": "computational_complexity"}, {"score": 0.00386496062825374, "phrase": "non-atomic_bottleneck_routing_games"}, {"score": 0.0037110661437700317, "phrase": "social_cost"}, {"score": 0.0035889249118247514, "phrase": "used_edge"}, {"score": 0.003253791343615811, "phrase": "linear_latencies"}, {"score": 0.0029498677789015766, "phrase": "poa"}, {"score": 0.002778604641920052, "phrase": "linear_bottleneck_routing_games"}, {"score": 0.002623536040408411, "phrase": "recursive_construction"}, {"score": 0.002611010097359509, "phrase": "hard_instances"}, {"score": 0.0025310328434864256, "phrase": "independent_interest"}, {"score": 0.0025069195918848166, "phrase": "positive_side"}, {"score": 0.0023613691428255455, "phrase": "nash"}, {"score": 0.0023388183537341213, "phrase": "best_subnetwork_routes"}, {"score": 0.0022834993174767016, "phrase": "used_edges"}, {"score": 0.0022509365210787993, "phrase": "running_time"}, {"score": 0.0022188370388602813, "phrase": "total_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bottleneck routing games", " Braess's paradox", " Selfish network design"], "paper_abstract": "In routing games, the selfish behavior of the players may lead to a degradation of the network performance at equilibrium. In more than a few cases however, the equilibrium performance can be significantly improved if we remove some edges from the network. This counterintuitive fact, widely known as Braess's paradox, gives rise to the (selfish) network design problem, where we seek to recognize routing games suffering from the paradox, and to improve their equilibrium performance by edge removal. In this work, we investigate the computational complexity and the approximability of the network design problem for non-atomic bottleneck routing games, where the individual cost of each player is the bottleneck cost of her path, and the social cost is the bottleneck cost of the network, i.e. the maximum latency of a used edge. We first show that bottleneck routing games do not suffer from Braess's paradox either if the network is series-parallel, or if we consider only subpath-optimal Nash flows. On the negative side, we prove that even for games with strictly increasing linear latencies, it is NP-hard not only to recognize instances suffering from the paradox, but also to distinguish between instances for which the Price of Anarchy (PoA) can decrease to 1 and instances for which the PoA cannot be improved by edge removal, even if their PoA is as large as Omega(n(0.121)). This implies that the network design problem for linear bottleneck routing games is NP-hard to approximate within a factor of O(n(0.121)-(epsilon))for any constant epsilon > 0. The proof is based on a recursive construction of hard instances that carefully exploits the properties of bottleneck routing games, and may be of independent interest. On the positive side, we present an algorithm for finding a subnetwork that is almost optimal with respect to the bottleneck cost of its worst Nash flow, when the worst Nash flow in the best subnetwork routes a non-negligible amount of flow on all used edges. We show that the running time is essentially determined by the total number of paths in the network, and is quasipolynomial when the number of paths is quasipolynomial. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "On the hardness of network design for bottleneck routing games", "paper_id": "WOS:000331433100009"}