{"auto_keywords": [{"score": 0.04871565848141454, "phrase": "fixed-point_digital_signal_processors"}, {"score": 0.00481495049065317, "phrase": "color_space_conversion"}, {"score": 0.004759635663291431, "phrase": "rounding_error_analysis"}, {"score": 0.004143196873246147, "phrase": "video_codecs"}, {"score": 0.0037989951856280423, "phrase": "video_analysis_algorithms"}, {"score": 0.0033839745649214548, "phrase": "hsv_conversion"}, {"score": 0.0033450437338616596, "phrase": "floating-point_multiplications"}, {"score": 0.003268516165008941, "phrase": "fixed-point_shifts"}, {"score": 0.0030141556259370675, "phrase": "floating-point_multiplication"}, {"score": 0.0026846436189970446, "phrase": "experimental_results"}, {"score": 0.002518989593177879, "phrase": "acceptable_range"}, {"score": 0.002418923027024191, "phrase": "proposed_algorithm"}, {"score": 0.0023363141951290526, "phrase": "traditional_ycbcr"}, {"score": 0.002309408211203032, "phrase": "hsv_conversion_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The YCbCr (luminance, chrominance-blue, and chrominance-red) color space is adopted in video codecs or transmission, while the HSV (hue, saturation and value) color space is used in some video analysis algorithms. In this paper, a fast algorithm based on fixed-point digital signal processors (DSPs) is proposed for YCbCr to HSV conversion. Floating-point multiplications are replaced with fixed-point shifts, 16-bit fixed-point multiplications, and additions. To compensate for rounding error and convert floating-point multiplication into 16-bit fixed-point multiplication in the calculation, tables occupying 225 bytes and 256 bytes are established, respectively. According to the experimental results, the error caused by the proposal is within the acceptable range. At the same time, the proposed algorithm is about 10 times faster than traditional YCbCr to HSV conversion algorithm on a fixed-point digital signal processor (DSP) platform and about 1.41 times faster on a personal computer (PC) platform. (c) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A fast algorithm for color space conversion and rounding error analysis based on fixed-point digital signal processors", "paper_id": "WOS:000336700800034"}