{"auto_keywords": [{"score": 0.041264883065262, "phrase": "nguyen"}, {"score": 0.00481495049065317, "phrase": "trapdoor-free_group_signature_schemes"}, {"score": 0.004725385523804256, "phrase": "group_signature_schemes"}, {"score": 0.004301834610818624, "phrase": "later_dispute"}, {"score": 0.004241648852523704, "phrase": "designated_group_manager"}, {"score": 0.003897744680678197, "phrase": "safavi-naini"}, {"score": 0.0038431888954930083, "phrase": "group_signature_scheme"}, {"score": 0.0037188360359702182, "phrase": "public_key"}, {"score": 0.0030525578912808647, "phrase": "safavi-naini's_scheme"}, {"score": 0.0026014425686078993, "phrase": "resulting_signature"}, {"score": 0.002564985233317994, "phrase": "third_party"}, {"score": 0.002248366278757655, "phrase": "even_the_group_manager"}, {"score": 0.0021049977753042253, "phrase": "new_scheme"}], "paper_keywords": ["digital signature", " cryptography", " information security"], "paper_abstract": "Group signature schemes allow a member of a group to sign messages anonymously on behalf of the group. In case of later dispute, a designated group manager can revoke the anonymity and identify the originator of a signature. In Asiacrypt2004, Nguyen and Safavi-Naini proposed a group signature scheme that has a constant-sized public key and signature length, and more importantly, their group signature scheme does not require trapdoor. Their scheme is very efficient and the sizes of signatures are smaller than those of the other existing schemes. In this paper, we point out that Nguyen and Safavi-Naini's scheme is insecure. In particular, it is shown in our cryptanalysis of-the scheme that it allows a non-member of the group to sign on behalf of the group. And the resulting signature convinces any third party that a member of the group has indeed generated such a signature, although none of the members has done so. Therefore is in case of dispute, even the group manager cannot identify who has signed the message. In the paper a new scheme that does not suffer from this problem is provided.", "paper_title": "Breaking and repairing trapdoor-free group signature schemes from Asiacrypt'2004", "paper_id": "WOS:000243890200009"}