{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "character_animation"}, {"score": 0.004783232571029632, "phrase": "motion_capture"}, {"score": 0.00462773520532301, "phrase": "real_entities"}, {"score": 0.004462494148878735, "phrase": "analysis_tool"}, {"score": 0.00443308765153716, "phrase": "biomechanics_research"}, {"score": 0.004274766964161756, "phrase": "motion_data"}, {"score": 0.00424659225577246, "phrase": "computer_animation"}, {"score": 0.004054479957160662, "phrase": "video_games"}, {"score": 0.004027751272984522, "phrase": "hand_motion_capture"}, {"score": 0.003794954883650141, "phrase": "new_human_computer_interaction_methods"}, {"score": 0.0037699306119313154, "phrase": "gesture_analysis"}, {"score": 0.003708086804757529, "phrase": "main_difficulties"}, {"score": 0.0036472537997966938, "phrase": "human_hand_motion"}, {"score": 0.0035519826240477444, "phrase": "ongoing_research"}, {"score": 0.0032376465741070274, "phrase": "existing_practice"}, {"score": 0.003091036449708673, "phrase": "animation_workflow"}, {"score": 0.003030247482854539, "phrase": "resulting_animations"}, {"score": 0.002883439044844259, "phrase": "prototype_camera_based_desktop_gesture_capture_system"}, {"score": 0.0025849489224175548, "phrase": "hand_gestures"}, {"score": 0.0025257081555100556, "phrase": "motion_tracking"}, {"score": 0.0024434201175883674, "phrase": "hand_motion_tracking"}, {"score": 0.0023795195973873636, "phrase": "gesture_capture"}, {"score": 0.00234043119560776, "phrase": "captured_gestures"}, {"score": 0.002234358539133758, "phrase": "motion_analysis_system"}, {"score": 0.002168715943767454, "phrase": "current_software"}, {"score": 0.002154392046210367, "phrase": "research_methods"}], "paper_keywords": ["Animation", " Gesture analysis", " Matchmoving", " Motion capture"], "paper_abstract": "Motion capture is a technique of digitally recording the movements of real entities, usually humans. It was originally developed as an analysis tool in biomechanics research, but has grown increasingly important as a source of motion data for computer animation. In this context it has been widely used for both cinema and video games. Hand motion capture and tracking in particular has received a lot of attention because of its critical role in the design of new Human Computer Interaction methods and gesture analysis. One of the main difficulties is the capture of human hand motion. This paper gives an overview of ongoing research \"HandPuppet3D\" being carried out in collaboration with an animation studio to employ computer vision techniques to develop a prototype desktop system and associated animation process that will allow an animator to control 3D character animation through the use of hand gestures. The eventual goal of the project is to support existing practice by providing a softer, more intuitive, user interface for the animator that improves the productivity of the animation workflow and the quality of the resulting animations. To help achieve this goal the focus has been placed on developing a prototype camera based desktop gesture capture system to capture hand gestures and interpret them in order to generate and control the animation of 3D character models. This will allow an animator to control 3D character animation through the capture and interpretation of hand gestures. Methods will be discussed for motion tracking and capture in 3D animation and in particular that of hand motion tracking and capture. HandPuppet3D aims to enable gesture capture with interpretation of the captured gestures and control of the target 3D animation software. This involves development and testing of a motion analysis system built from algorithms recently developed. We review current software and research methods available in this area and describe our current work.", "paper_title": "HandPuppet3D: Motion capture and analysis for character animation", "paper_id": "WOS:000272847500004"}