{"auto_keywords": [{"score": 0.033151764504575625, "phrase": "conceptual_models"}, {"score": 0.00481495049065317, "phrase": "data_warehouse_conceptual_models_understandability"}, {"score": 0.004725385523804256, "phrase": "principal_role"}, {"score": 0.004690025569165577, "phrase": "data_warehouses"}, {"score": 0.0045855181084455444, "phrase": "strategy_decisions"}, {"score": 0.004551199992546761, "phrase": "data_warehouse_quality"}, {"score": 0.004143196873246147, "phrase": "high_quality_dws"}, {"score": 0.003701401653850141, "phrase": "empirically_validated_metrics"}, {"score": 0.0035381202759091784, "phrase": "outstanding_model"}, {"score": 0.0031134856640797205, "phrase": "dws"}, {"score": 0.002920561105784389, "phrase": "empirical_validation_process"}, {"score": 0.002392453087295389, "phrase": "cumulative_knowledge"}, {"score": 0.002365587018070219, "phrase": "useful_measurement_conclusions"}, {"score": 0.0022441378838655712, "phrase": "proposed_metrics"}, {"score": 0.0022105951175680856, "phrase": "practical_indicators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["data warehouse quality", " data warehouse metrics", " metric validation", " data warehouse conceptual modelling"], "paper_abstract": "Due to the principal role of Data warehouses (DW) in making strategy decisions, data warehouse quality is crucial for organizations. Therefore, we should use methods, models, techniques and tools to help us in designing and maintaining high quality DWs. In the last years, there have been several approaches to design DWs from the conceptual, logical and physical perspectives. However, from our point of view. none of them provides a set of empirically validated metrics (objective indicators) to help the designer in accomplishing an outstanding model that guarantees the quality of the DW. In this paper, we firstly summarise the set of metrics we have defined to measure the understandability (a quality subcharacteristic) of conceptual models for DWs, and present their theoretical validation to assure their correct definition. Then, we focus on deeply describing the empirical validation process we have carried out through a family of experiments performed by students, professionals and experts in DWs. This family of experiments is a very important aspect in the process of validating metrics as it is widely accepted that only after performing I family of experiments, it is possible to build up the cumulative knowledge to extract useful measurement conclusions to be applied in practice. Our whole empirical process showed us that several of the proposed metrics seems to be practical indicators of the understandability of conceptual models for DWs. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Metrics for data warehouse conceptual models understandability", "paper_id": "WOS:000247844300004"}