{"auto_keywords": [{"score": 0.041439091134021215, "phrase": "behavioral_intention"}, {"score": 0.019433169484712243, "phrase": "patients'_acceptance"}, {"score": 0.01268665047134443, "phrase": "subjective_norm"}, {"score": 0.012385895445306666, "phrase": "perceived_usefulness"}, {"score": 0.005856216168913121, "phrase": "perceived_ease"}, {"score": 0.00481495049065317, "phrase": "home_care_patients'_acceptance"}, {"score": 0.004757087682427765, "phrase": "web-based_interactive_self-management_technology"}, {"score": 0.004624751696958501, "phrase": "personal_health_records"}, {"score": 0.004496080495247288, "phrase": "growing_need"}, {"score": 0.0038885527668812807, "phrase": "effective_use"}, {"score": 0.003734810936407523, "phrase": "cross-sectional_secondary_analysis"}, {"score": 0.003660226272906374, "phrase": "randomized_field_study"}, {"score": 0.003616189733352126, "phrase": "technology-assisted_home_care_nursing_practice"}, {"score": 0.0033764382987428497, "phrase": "validated_measurement_scales"}, {"score": 0.0033492947290751996, "phrase": "prior_research"}, {"score": 0.003152531962718477, "phrase": "parent_study_protocol"}, {"score": 0.003077092305006702, "phrase": "item_parceling_guided_assessment"}, {"score": 0.0030278017562213265, "phrase": "results_perceived_usefulness"}, {"score": 0.0027929100418926725, "phrase": "health_care_knowledge"}, {"score": 0.0026715589067557526, "phrase": "perceived_effective_use"}, {"score": 0.0024345529783611703, "phrase": "total_variance"}, {"score": 0.0021049977753042253, "phrase": "web-based_self-management_technology"}], "paper_keywords": [""], "paper_abstract": "Objective With the advent of personal health records and other patient-focused health technologies, there is a growing need to better understand factors that contribute to acceptance and use of such innovations. In this study, we employed the Unified Theory of Acceptance and Use of Technology as the basis for determining what predicts patients' acceptance (measured by behavioral intention) and perceived effective use of a web-based, interactive self-management innovation among home care patients. Design Cross-sectional secondary analysis of data from a randomized field study evaluating a technology-assisted home care nursing practice with adults with chronic cardiac disease. Measurement and analysis A questionnaire was designed based on validated measurement scales from prior research and was completed by 101 participants for measuring the acceptance constructs as part of the parent study protocol. Latent variable modeling with item parceling guided assessment of patients' acceptance. Results Perceived usefulness accounted for 53.9% of the variability in behavioral intention, the measure of acceptance. Together, perceived usefulness, health care knowledge, and behavioral intention accounted for 68.5% of the variance in perceived effective use. Perceived ease of use and subjective norm indirectly influenced behavioral intention, through perceived usefulness. Perceived ease of use and subjective norm explained 48% of the total variance in perceived usefulness. Conclusion The study demonstrates that perceived usefulness, perceived ease of use, subjective norm, and healthcare knowledge together predict most of the variance in patients' acceptance and self-reported use of the web-based self-management technology.", "paper_title": "Factors affecting home care patients' acceptance of a web-based interactive self-management technology", "paper_id": "WOS:000289218000009"}