{"auto_keywords": [{"score": 0.039044723702949105, "phrase": "resource_providers"}, {"score": 0.00481495049065317, "phrase": "cpu-based_guarantees"}, {"score": 0.004686688155058031, "phrase": "resource-level_qos_metrics"}, {"score": 0.004586531354697466, "phrase": "cloud_computing"}, {"score": 0.004298666679374568, "phrase": "service_level_agreements"}, {"score": 0.0034817084307034955, "phrase": "efficient_exploitation"}, {"score": 0.0032806521851034766, "phrase": "resource-level_metric"}, {"score": 0.0032278559855285975, "phrase": "fine-grain_guarantees"}, {"score": 0.002992456421856031, "phrase": "running_services"}, {"score": 0.0028195727965553367, "phrase": "customer's_cpu_usage"}, {"score": 0.0027741761880779535, "phrase": "metric_definition"}, {"score": 0.002714779217561487, "phrase": "fake_sla_violations"}, {"score": 0.0026710653215026685, "phrase": "customer's_task"}, {"score": 0.0024761702541879213, "phrase": "virtualized_provider"}, {"score": 0.0023970487263732737, "phrase": "needed_infrastructure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["QoS metrics", " SLA", " Cloud provider", " CPU guarantees"], "paper_abstract": "Success of Cloud computing requires that both customers and providers can be confident that signed Service Level Agreements (SLA) are supporting their respective business activities to their best extent. Currently used SLAs fail in providing such confidence, especially when providers outsource resources to other providers. These resource providers typically support very simple metrics like availability, or metrics that hinder an efficient exploitation of their resources. In this paper, we propose a resource-level metric for specifying fine-grain guarantees on CPU performance. This metric allows resource providers to allocate dynamically their resources among running services depending on their demand. This is accomplished by incorporating the customer's CPU usage in the metric definition, but avoiding fake SLA violations when the customer's task does not use all its allocated resources. We have conducted the evaluation in a virtualized provider where we have implemented the needed infrastructure for using our metric. As demonstrated in our evaluation, our solution presents fewer SLA violations than other CPU-related metrics while maintaining the Quality of Service. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Supporting CPU-based guarantees in cloud SLAs via resource-level QoS metrics", "paper_id": "WOS:000306888400014"}