{"auto_keywords": [{"score": 0.04510723877933964, "phrase": "ffa."}, {"score": 0.004717325943509345, "phrase": "brain_region"}, {"score": 0.004621671570727774, "phrase": "face_recognition"}, {"score": 0.004590217765551337, "phrase": "prosopagnosia"}, {"score": 0.004543436145505023, "phrase": "brain_disorder"}, {"score": 0.003577032245103867, "phrase": "feature_extracting_bidirectional_associative_memory"}, {"score": 0.0034686643139273934, "phrase": "topological_maps"}, {"score": 0.0033635683594830158, "phrase": "second_component"}, {"score": 0.0032952735750239924, "phrase": "bidirectional_heteroassociative_memory"}, {"score": 0.0031305230217636495, "phrase": "specific_semantic_labels"}, {"score": 0.0029135770621039926, "phrase": "visual_perceptual_system"}, {"score": 0.002815604242104671, "phrase": "low-pass_filter"}, {"score": 0.002702363975375762, "phrase": "extracted_map"}, {"score": 0.0026747708876640377, "phrase": "correct_label_information"}, {"score": 0.002497862210672172, "phrase": "recall_performance"}, {"score": 0.002246443296542436, "phrase": "human_ones"}, {"score": 0.0022234951091677085, "phrase": "higher_level"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Self-organising maps", " Prosopagnosia", " Brain disorder model", " Bidirectionnal associative memory"], "paper_abstract": "The Fusiform Face Area (FFA) is the brain region considered to be responsible for face recognition. Prosopagnosia is a brain disorder causing the inability to a recognise faces that is said to mainly affect the FFA. We put forward a model that simulates the capacity to retrieve label associated with faces and objects depending on the depth of treatment of the information. Akin to prosopagnosia, various localised \"lesions\" were inserted into the network in order to evaluate the degradation of performance. The network is first composed of a Feature Extracting Bidirectional Associative Memory (FEBAM-SOM) to represent the topological maps allowing the categorisation of all faces. The second component of the network is a Bidirectional Heteroassociative Memory (BHM) that links those representations to their semantic label. For the latter, specific semantic labels were used as well as more general ones. The inputs were images representing faces and various objects. Just like in the visual perceptual system, the images were pre-processed using a low-pass filter. Results showed that the network is able to associate the extracted map with the correct label information. The network is able to generalise and is robust to noise. Moreover, results showed that the recall performance of names associated with faces decrease with the size of lesion without affecting the performance of the objects. Finally, results obtained with the network are also consistent with human ones in that higher level, more general labels are more robust to lesion compared to low level, specific labels. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Depth of treatment sensitive noise resistant dynamic artificial neural networks model of recall in people with prosopagnosia", "paper_id": "WOS:000306162600006"}