{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adam"}, {"score": 0.015071140685378346, "phrase": "context-aware_applications"}, {"score": 0.0079207378933387, "phrase": "responsible_defects"}, {"score": 0.006376949233881144, "phrase": "environmental_changes"}, {"score": 0.004536244367689415, "phrase": "typical_type"}, {"score": 0.004497762477097628, "phrase": "self-adaptive_software_systems"}, {"score": 0.004421770937919324, "phrase": "increasing_attention"}, {"score": 0.0043106854803224865, "phrase": "error_types"}, {"score": 0.0042373381286051354, "phrase": "autonomic_way"}, {"score": 0.0039244530915794025, "phrase": "developer's_ability"}, {"score": 0.0037287578312533596, "phrase": "application_crash"}, {"score": 0.0034386016613475335, "phrase": "novel_approach"}, {"score": 0.0032810180076973806, "phrase": "context-aware_adaptation"}, {"score": 0.0032255172568437965, "phrase": "runtime_errors"}, {"score": 0.0031440159350875057, "phrase": "relevant_error_information"}, {"score": 0.0025291601927956765, "phrase": "adaptation_semantics"}, {"score": 0.002413153346716919, "phrase": "assertion_checkers"}, {"score": 0.0022442249871042026, "phrase": "promising_results"}, {"score": 0.0021049977753042253, "phrase": "useful_hints"}], "paper_keywords": ["Context-aware adaptation", " Defect", " Error detection", " Failure"], "paper_abstract": "Context-aware applications, as a typical type of self-adaptive software systems, are receiving increasing attention. These applications continually adapt to environmental changes in an autonomic way. However, their adaptation may contain defects when the complexity of modeling all environmental changes is beyond a developer's ability. Such defects can cause failure to the adaptation and result in application crash or freezing. Relating these failures back to responsible defects is challenging. In this paper we propose a novel approach, called ADAM, to assist identifying defects in the context-aware adaptation. ADAM monitors runtime errors for an application, logs relevant error information, and relates them to responsible defects in this application. To make our ADAM approach feasible, we investigate the error types that are commonly exhibited by various failures reported in context-aware applications. ADAM detects these errors in order to identify responsible defects in context-aware applications. To detect these errors, ADAM formally models the adaptation semantics for context-aware applications, and integrates into them a set of assertion checkers with respect to these error types. We experimentally evaluated ADAM through three context-aware applications. The experiments reported promising results that ADAM can effectively detect errors, identify their responsible defects in applications, and give useful hints on how these defects can be fixed. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "ADAM: Identifying defects in context-aware adaptation", "paper_id": "WOS:000310669500011"}