{"auto_keywords": [{"score": 0.035424122317531496, "phrase": "inflow_interval"}, {"score": 0.00481495049065317, "phrase": "n-symmetry_direction_field"}, {"score": 0.004444921827311577, "phrase": "direction_field"}, {"score": 0.00436661740263741, "phrase": "triangle_mesh"}, {"score": 0.003995226376780718, "phrase": "mesh_segmentation"}, {"score": 0.0038728151007982378, "phrase": "existing_algorithms"}, {"score": 0.0035118972210075633, "phrase": "triangle_boundary"}, {"score": 0.0034194194985380268, "phrase": "outflow_intervals"}, {"score": 0.0032852337992126564, "phrase": "outflow_interval"}, {"score": 0.0030868583963299698, "phrase": "entry_point"}, {"score": 0.002992195343569767, "phrase": "corresponding_outflow_interval"}, {"score": 0.0027495914857929584, "phrase": "new_direction_field_representation"}, {"score": 0.002641621667026613, "phrase": "guaranteed_combinatorial_algorithm"}, {"score": 0.00258347644721642, "phrase": "barycentric_positions"}, {"score": 0.0025605773834404253, "phrase": "arbitrary_precision_number_representation"}, {"score": 0.0022404162042797262, "phrase": "cross-free_and_merge-free_polylines"}, {"score": 0.002123831297790248, "phrase": "vector_field_singularities"}], "paper_keywords": ["Algorithms", " Computer graphics", " geometry", " streamline", " N-ROSY", " direction field", " tangent vector field"], "paper_abstract": "We are proposing an algorithm for tracing polylines that are oriented by a direction field defined on a triangle mesh. The challenge is to ensure that two such polylines cannot cross or merge. This property is fundamental for mesh segmentation and is impossible to enforce with existing algorithms. The core of our contribution is to determine how polylines cross each triangle. Our solution is inspired by EdgeMaps where each triangle boundary is decomposed into inflow and outflow intervals such that each inflow interval is mapped onto an outflow interval. To cross a triangle, we find the inflow interval that contains the entry point, and link it to the corresponding outflow interval, with the same barycentric coordinate. To ensure that polylines cannot merge or cross, we introduce a new direction field representation, we resolve the inflow/outflow interval pairing with a guaranteed combinatorial algorithm, and propagate the barycentric positions with arbitrary precision number representation. Using these techniques, two streamlines crossing the same triangle cannot merge or cross, but only locally overlap when all streamline extremities are located on the same edge. Cross-free and merge-free polylines can be traced on the mesh by iteratively crossing triangles. Vector field singularities and polyline/vertex crossing are characterized and consistently handled.", "paper_title": "Robust Polylines Tracing for N-Symmetry Direction Field on Triangulated Surfaces", "paper_id": "WOS:000337057200009"}