{"auto_keywords": [{"score": 0.04201582210404546, "phrase": "quilts"}, {"score": 0.005100738081673731, "phrase": "mixed_depiction"}, {"score": 0.00481495049065317, "phrase": "large_layered_graphs"}, {"score": 0.004774115617883476, "phrase": "traditional_layered_graph_depictions"}, {"score": 0.0047135086583390585, "phrase": "flow_charts"}, {"score": 0.004653667500876187, "phrase": "wide_use"}, {"score": 0.004310173770196077, "phrase": "matrix-based_depictions"}, {"score": 0.003776750773624222, "phrase": "better-known_node-link"}, {"score": 0.0036813725040313002, "phrase": "primary_weakness"}, {"score": 0.0035883942463601688, "phrase": "skip_links"}, {"score": 0.0034386016613475335, "phrase": "succeeding_layer"}, {"score": 0.0030776686414001964, "phrase": "link_depictions"}, {"score": 0.0029871209444889716, "phrase": "color-only_depiction"}, {"score": 0.002742787059497186, "phrase": "text-only_depiction"}, {"score": 0.0026058621464926826, "phrase": "node-link_diagrams"}, {"score": 0.0021049977753042253, "phrase": "matrix_depictions"}], "paper_keywords": ["Graph drawing", " layered graphs", " matrix based depiction", " node-link diagram"], "paper_abstract": "Traditional layered graph depictions such as flow charts are in wide use. Yet as graphs grow more complex, these depictions can become difficult to understand. Quilts are matrix-based depictions for layered graphs designed to address this problem. In this research, we first improve Quilts by developing three design alternatives, and then compare the best of these alternatives to better-known node-link and matrix depictions. A primary weakness in Quilts is their depiction of skip links, links that do not simply connect to a succeeding layer. Therefore in our first study, we compare Quilts using color-only, text-only, and mixed (color and text) skip link depictions, finding that path finding with the color-only depiction is significantly slower and less accurate, and that in certain cases, the mixed depiction offers an advantage over the text-only depiction. In our second study, we compare Quilts using the mixed depiction to node-link diagrams and centered matrices. Overall results show that users can find paths through graphs significantly faster with Quilts (46.6 secs) than with node-link (58.3 secs) or matrix (71.2 secs) diagrams. This speed advantage is still greater in large graphs (e. g. in 200 node graphs, 55.4 secs vs. 71.1 secs for node-link and 84.2 secs for matrix depictions).", "paper_title": "Developing and Evaluating Quilts for the Depiction of Large Layered Graphs", "paper_id": "WOS:000296241900058"}