{"auto_keywords": [{"score": 0.03751951230806167, "phrase": "ux"}, {"score": 0.00481495049065317, "phrase": "herzberg's_notion_of_hygienes"}, {"score": 0.0039055990919333082, "phrase": "user_experience"}, {"score": 0.003802135020791801, "phrase": "earlier_work"}, {"score": 0.0034890505116128606, "phrase": "shown_empirical_evidence"}, {"score": 0.00343992393686867, "phrase": "ux."}, {"score": 0.00323625520042892, "phrase": "herzberg's_methodology"}, {"score": 0.0028293966058473476, "phrase": "technical_quality"}, {"score": 0.0025137856138000014, "phrase": "typical_examples"}, {"score": 0.0024209250169088575, "phrase": "ux_literature"}, {"score": 0.0023189818169615135, "phrase": "non-instrumental_qualities"}, {"score": 0.002127765807039172, "phrase": "pragmatic_and_hedonic_quality"}, {"score": 0.0021049977753042253, "phrase": "psychological_need_fulfillment"}], "paper_keywords": ["Herzberg", " two-factor model", " user experience", " hygiene", " motivator"], "paper_abstract": "This article investigates Herzberg's [1959] notion of hygienes, factors contributing to dissatisfaction but not to satisfaction, and motivators, factors contributing to satisfaction but not to dissatisfaction, in the context of user experience (UX). Earlier work has theorized that the notion of hygienes and motivators applies to UX but has neither shown empirical evidence for this theory nor exemplified what such factors would look like in UX. We adapt Herzberg's methodology to analyze 303 events where users felt good or bad about their smartphone and derive factors that may work as hygienes or motivators. We identified technical quality and price as hygienes, and utility and convenience as motivators. These factors do not correspond to those mentioned as typical examples of hygienes and motivators in the UX literature (i.e., instrumental qualities such as usability for hygienes and non-instrumental qualities such as beauty for motivators). We discuss this discrepancy in the context of pragmatic and hedonic quality and psychological need fulfillment.", "paper_title": "Does Herzberg's Notion of Hygienes and Motivators Apply to User Experience?", "paper_id": "WOS:000357936900001"}