{"auto_keywords": [{"score": 0.004768378525561471, "phrase": "secondskin"}, {"score": 0.0046993598473345395, "phrase": "sketch-based_modeling_system"}, {"score": 0.004222707054751191, "phrase": "representative_artist_sketches"}, {"score": 0.004061584718427419, "phrase": "closed_loop"}, {"score": 0.003964007795174772, "phrase": "surface_patches"}, {"score": 0.003831310632470526, "phrase": "underlying_surfaces"}, {"score": 0.0035965032173588753, "phrase": "small_set"}, {"score": 0.003392507399258166, "phrase": "underlying_layer_geometry"}, {"score": 0.002685558057339722, "phrase": "curve_loops"}, {"score": 0.002545468362709126, "phrase": "underlying_layer"}, {"score": 0.0025085435314540837, "phrase": "additional_curves"}, {"score": 0.0023431692392929353, "phrase": "ground_truth_sketches"}, {"score": 0.0022101055924375725, "phrase": "compelling_gallery"}, {"score": 0.0021049977753042253, "phrase": "current_sketch_modelers"}], "paper_keywords": ["sketch-based modeling", " layers", " shells"], "paper_abstract": "SecondSkin is a sketch-based modeling system focused on the creation of structures comprised of layered, shape interdependent 3D volumes. Our approach is built on three novel insights gleaned from an analysis of representative artist sketches. First, we observe that a closed loop of strokes typically define surface patches that bound volumes in conjunction with underlying surfaces. Second, a significant majority of these strokes map to a small set of curve-types, that describe the 3D geometric relationship between the stroke and underlying layer geometry. Third, we find that a few simple geometric features allow us to consistently classify 2D strokes to our proposed set of 3D curve-types. Our algorithm thus processes strokes as they are drawn, identifies their curve-type, and interprets them as 3D curves on and around underlying 3D geometry, using other connected 3D curves for context. Curve loops are automatically surfaced and turned into volumes bound to the underlying layer, creating additional curves and surfaces as necessary. Stroke classification by 15 viewers on a suite of ground truth sketches validates our curve-types and classification algorithm. We evaluate SecondSkin via a compelling gallery of layered 3D models that would be tedious to produce using current sketch modelers.", "paper_title": "SecondSkin: Sketch-based Construction of Layered 3D Models", "paper_id": "WOS:000358786600092"}