{"auto_keywords": [{"score": 0.04816220601505016, "phrase": "systemic_yoyo_model"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.00469545352928726, "phrase": "general_thinking_logic"}, {"score": 0.0045789085863942825, "phrase": "novel_resolutions"}, {"score": 0.004273047608656344, "phrase": "brand_new_results"}, {"score": 0.004219663341808313, "phrase": "laboratory_observations"}, {"score": 0.004153866009835335, "phrase": "dishpan_experiments"}, {"score": 0.004076256554327002, "phrase": "general_systemic_yoyo_model"}, {"score": 0.0040379950810436995, "phrase": "calculus-based_differential_equations"}, {"score": 0.003975019199506057, "phrase": "organic_whole"}, {"score": 0.003651477256755136, "phrase": "systemic_yoyos"}, {"score": 0.003354180941665089, "phrase": "global_identity_crisis"}, {"score": 0.0032709824959070042, "phrase": "usa"}, {"score": 0.0032096540059468426, "phrase": "sole_superpower"}, {"score": 0.0031595558075901164, "phrase": "figurative_analysis"}, {"score": 0.0030424776690194714, "phrase": "external_pressures"}, {"score": 0.002957516535697149, "phrase": "prosperous_civilization"}, {"score": 0.002682575978422632, "phrase": "three-ringed_circulations"}, {"score": 0.0026490090146527407, "phrase": "human_desire"}, {"score": 0.0025831266474492308, "phrase": "permanent_instabilities"}, {"score": 0.0023875955141436363, "phrase": "rigorous_mathematics"}, {"score": 0.002186079683182131, "phrase": "short_time-series_data"}, {"score": 0.0021049977753042253, "phrase": "guess_work"}], "paper_keywords": ["Cybernetics", " Conflict", " History of civilization", " Modelling"], "paper_abstract": "Purpose - The purpose of this paper is to apply the general thinking logic and methodology of the systemic yoyo model to provide novel resolutions for some of the very important questions studied in the research of history and civilizations. Design/methodology/approach - To lay the foundation for brand new results and conclusions, laboratory observations, such as the dishpan experiments, the theory of the general systemic yoyo model, and calculus-based differential equations were combined into an organic whole of reasoning. What is obtained in this paper surely proves the merit of this approach. Findings - By modeling the world of civilizations using systemic yoyos, the paper provides novel and convincing answers to such important questions as who we are, asked in search for identities, and whether or not the appearance of the global identity crisis in the 1990s is an indicator for the USA to cease its global dominance as the sole superpower. By using the figurative analysis, naturally available along with the systemic yoyo model, the paper analyzes external pressures each civilization experiences and when and why a prosperous civilization would possibly choose to isolate itself from the rest of the world. By introducing the concepts of stirring energies and stirring momentum, it will be possible to study three-ringed circulations and explore the human desire for stability out of a universe of permanent instabilities. Originality/value - Instead of using statistics, this paper is among the first of its kind in the study of civilizations that collectively applies rigorous mathematics, the systems research and laboratory experiments in the study of social phenomena. So, when compared to other studies in the area of civilizations that are either language or statistics based using short time-series data, this work brings forward more affirmative conclusions without involving any chance or guess work.", "paper_title": "Interaction between civilizations", "paper_id": "WOS:000277539100018"}