{"auto_keywords": [{"score": 0.04901626150275962, "phrase": "cellular_networks"}, {"score": 0.0046659637258752535, "phrase": "vehicle_communications"}, {"score": 0.004521566043596533, "phrase": "future_vehicle_equipment"}, {"score": 0.004303591748086452, "phrase": "main_object"}, {"score": 0.003969250376327401, "phrase": "commercial_solutions"}, {"score": 0.00374399358035391, "phrase": "ad_hoc_networks"}, {"score": 0.0033011569787033297, "phrase": "communication_technology"}, {"score": 0.003085813569061001, "phrase": "present_paper"}, {"score": 0.002910545717767559, "phrase": "novel_communication_paradigm"}, {"score": 0.0027206133859493725, "phrase": "peer_network_technology"}, {"score": 0.0026481480455339055, "phrase": "cn_basis"}, {"score": 0.0026009105281485888, "phrase": "group-based_communication_infrastructure"}, {"score": 0.0025545134727682716, "phrase": "message_propagation"}, {"score": 0.002453116398642071, "phrase": "road_side_infrastructure"}, {"score": 0.002272415777234064, "phrase": "field_tests"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["vehicle communications", " V2V", " V2I", " cellular networks", " ITS"], "paper_abstract": "Vehicle communications are becoming the cornerstone in the future vehicle equipment. More specifically, vehicle to vehicle communications (V2V) are the main object of researching nowadays, because vehicle to infrastructure (V2I) approximations are already being developed as commercial solutions. Cellular networks (CN) are usually applied in V2I solutions, whereas ad hoc networks are practically the only technology considered in V2V communications. Due to fact that CN are currently a reality and the operators are continuously improving the network, this communication technology could be considered as a candidate to deal with V2V necessities as well. The present paper defends the applicability of CN in the V2V field, and presents a novel communication paradigm for vehicles which unifies both V2V and V2I paradigms into one system. A peer to peer network technology has been used over the CN basis to create a group-based communication infrastructure which enables the message propagation among vehicles and between the car and the road side infrastructure. The architecture has been implemented in both hardware and software terms, and multitude of field tests have been carried out, whose main performance results are shown in the paper. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Architecture and evaluation of a unified V2V and V2I communication system based on cellular networks", "paper_id": "WOS:000258367900009"}