{"auto_keywords": [{"score": 0.026057046832530392, "phrase": "file-sharing_system"}, {"score": 0.02246846748295755, "phrase": "network_structures"}, {"score": 0.00481495049065317, "phrase": "user_selfishness"}, {"score": 0.004139401327448807, "phrase": "multiple_nodes"}, {"score": 0.0038964032225585117, "phrase": "dependable_file-sharing_system"}, {"score": 0.003799397093447221, "phrase": "high_file_availability"}, {"score": 0.003073988343893906, "phrase": "unpopular_files"}, {"score": 0.0028070431733705735, "phrase": "effective_caching"}, {"score": 0.002764856305713066, "phrase": "whole_system"}, {"score": 0.002723301730223192, "phrase": "autonomous_and_selfish_node_behavior"}, {"score": 0.0026420518944303716, "phrase": "selfish_node_behavior"}, {"score": 0.002563219920877287, "phrase": "evolutionary_game_theory"}, {"score": 0.002524688179363081, "phrase": "theoretic_analysis"}, {"score": 0.0023053339328456234, "phrase": "demand_model"}], "paper_keywords": ["Peer-to-Peer (P2P) file-sharing system", " Evolutionary game theory", " Selfish node behavior"], "paper_abstract": "In a Peer-to-Peer (P2P) file-sharing system, a node finds and retrieves its desired file. If multiple nodes cache the same file to provide others, we can achieve a dependable file-sharing system with low latency and high file availability. However, a node has to spend costs, e. g., processing load or storage capacity, on caching a file. Consequently, a node may selfishly behave and hesitate to cache a file. In such a case, unpopular files are likely to disappear from the system. In this paper, we aim to reveal whether effective caching in the whole system emerges from autonomous and selfish node behavior. We discuss relationship between selfish node behavior and system dynamics by using evolutionary game theory. Through theoretic analysis, we show that a file-sharing system can be robust to file disappearance depending on a cost and demand model for caching even if nodes behave selfishly. Furthermore, we also conduct several simulation-based analysis in terms of network structures, evolving network, load balancing, and system stability. As a result, we demonstrate that a file-sharing system with good properties, i.e., robustness to file disappearance, low search latency, well load-balancing, and high stability, can be achieved independent of network structures and dynamics.", "paper_title": "User selfishness vs. file availability in P2P file-sharing systems: Evolutionary game theoretic approach", "paper_id": "WOS:000284093200003"}