{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "guarantee_availability"}, {"score": 0.046359770894318295, "phrase": "design_principle"}, {"score": 0.04330594339596592, "phrase": "protocol_analysis"}, {"score": 0.0380015063753839, "phrase": "goal_availability"}, {"score": 0.0047839735747931605, "phrase": "security_protocol_analysis"}, {"score": 0.004722613498487908, "phrase": "prudent_design_principles"}, {"score": 0.004677108044285109, "phrase": "established_approach"}, {"score": 0.004647013794908825, "phrase": "protocol_correctness"}, {"score": 0.004272890231368899, "phrase": "principal-centric_goals"}, {"score": 0.003865826699096508, "phrase": "clear_guidance"}, {"score": 0.0036592457471262894, "phrase": "analyzer's_skill"}, {"score": 0.003577414339646767, "phrase": "desirable_feature"}, {"score": 0.003430249143748777, "phrase": "realistic_analysis"}, {"score": 0.003163985877966426, "phrase": "protocol_goals"}, {"score": 0.003093195541269291, "phrase": "protocol_participants"}, {"score": 0.002735572813553256, "phrase": "analyzed_protocol"}, {"score": 0.0026830048370777315, "phrase": "existing_analysis"}, {"score": 0.002427035025924384, "phrase": "existing_design_principles"}, {"score": 0.0024035955457586103, "phrase": "particular_reference"}, {"score": 0.0022676260293002706, "phrase": "additional_protocol_niceties"}, {"score": 0.0022312377180023282, "phrase": "analyzer's_skills"}, {"score": 0.0021601997088758957, "phrase": "established_claim"}, {"score": 0.0021049977753042253, "phrase": "well-known_formal_method"}], "paper_keywords": ["Formal analysis", " Theorem proving", " Network protocol", " Trust"], "paper_abstract": "Conformity to prudent design principles is an established approach to protocol correctness although it is not free of limitations. We term goal availability a design principle that is often implicitly followed, prescribing protocols to aim at principal-centric goals. Adherence to a design principle is normally established through protocol analysis that is an evaluation of whether a protocol achieves its goals. However, the literature shows that there exists no clear guidance on how to conduct and interpret such an analysis, a process that is only left to the analyzer's skill and experience. Goal availability has the desirable feature that its supporting protocol analysis can be precisely guided by what becomes a principle of realistic analysis, which we call guarantee availability. It prescribes that the outcome of the analysis, which is the set of guarantees confirming the protocol goals, be practically applicable by the protocol participants. In consequence, the guarantees must be based on assumptions that the principals have the capacity to verify. Our focus then turns entirely to protocol analysis, because an analysis conforming to guarantee availability signifies that the analyzed protocol conforms to goal availability. Existing analysis of (both classical and deployed) protocols has been reconsidered with the aim of studying their conformity to guarantee availability. Some experiments clarify the relationships between goal availability and the existing design principles, with particular reference to explicitness. Other experiments demonstrate that boosting an analysis with guarantee availability generally makes it deeper, unveiling additional protocol niceties that depending on the analyzer's skills may remain overseen otherwise. In particular, an established claim about a protocol (made using a well-known formal method) can be subverted.", "paper_title": "The principle of guarantee availability for security protocol analysis", "paper_id": "WOS:000275791200001"}