{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hardware_transactional_memory_systems"}, {"score": 0.044875504899816884, "phrase": "data_conflicts"}, {"score": 0.004634459424542272, "phrase": "performance_losses"}, {"score": 0.00459039896577789, "phrase": "hardware_transactional_memory"}, {"score": 0.004334657104697421, "phrase": "root_causes"}, {"score": 0.0037199473428123175, "phrase": "performance_and_energy_losses"}, {"score": 0.003632080001489739, "phrase": "extra_communication"}, {"score": 0.0033969001271637934, "phrase": "classification_model"}, {"score": 0.0029147869733574844, "phrase": "false_sharing_conflicts"}, {"score": 0.00283229915062791, "phrase": "silent_store_conflicts"}, {"score": 0.002524982927936405, "phrase": "proposed_techniques"}, {"score": 0.0024534993283766332, "phrase": "lazy_versioning"}, {"score": 0.0024301229420875155, "phrase": "lazy_conflict_resolution"}, {"score": 0.002350041573006264, "phrase": "mesi_cache-coherence_infrastructure"}, {"score": 0.0021049977753042253, "phrase": "energy_consumption"}], "paper_keywords": ["Transactional memory", " Contamination misses", " Intermediate checkpointing", " Manycore"], "paper_abstract": "This paper analyzes the sources of performance losses in hardware transactional memory and investigates techniques to reduce the losses. It dissects the root causes of data conflicts in hardware transactional memory systems (HTM) into four classes of conflicts: true sharing, false sharing, silent store, and write-write conflicts. These conflicts can cause performance and energy losses due to aborts and extra communication. To quantify losses, the paper proposes the 5C cache-miss classification model that extends the well-established 4C model with a new class of cache misses known as contamination misses. The paper also contributes with two techniques for removal of data conflicts: One for removal of false sharing conflicts and another for removal of silent store conflicts. In addition, it revisits and adapts a technique that is able to reduce losses due to both true and false conflicts. All of the proposed techniques can be accommodated in a lazy versioning and lazy conflict resolution HTM built on top of a MESI cache-coherence infrastructure with quite modest extensions. Their ability to reduce performance is quantitatively established, individually as well as in combination. Performance and energy consumption are improved substantially.", "paper_title": "Removal of Conflicts in Hardware Transactional Memory Systems", "paper_id": "WOS:000329403900010"}