{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "door_handle"}, {"score": 0.015557955264077659, "phrase": "unknown_geometry"}, {"score": 0.01134019911726935, "phrase": "bounding_box"}, {"score": 0.010935184108700383, "phrase": "proposed_method"}, {"score": 0.004690694501758065, "phrase": "single_camera"}, {"score": 0.004522080178250592, "phrase": "mobile_manipulator"}, {"score": 0.0043367547691560175, "phrase": "challenging_task"}, {"score": 0.004291617358806677, "phrase": "current_approaches"}, {"score": 0.0031845067058084583, "phrase": "optical_flow"}, {"score": 0.003069867656852932, "phrase": "single_ccd_camera"}, {"score": 0.0030220049006970317, "phrase": "point_cloud"}, {"score": 0.0026233771102489394, "phrase": "principal_components"}, {"score": 0.0025824576209656676, "phrase": "handle_points"}], "paper_keywords": ["Door opening", " Door handle localization", " Mobile robots", " Optical flow", " Bounding box"], "paper_abstract": "Door-opening by a robot is a challenging task. Current approaches to localization of door handles are only applicable to certain types of handles or require the use of learning algorithms. In this paper, a method for localizing a door handle of unknown geometry is presented. The localization is performed by fitting a bounding box around the door handle. The proposed method extracts a three-dimensional (3D) point cloud using the optical flow calculated from images taken with a single CCD camera. The point cloud is then segmented to separate the door and the handle points. A bounding box is fitted to the door handle. The box is oriented along the principal components of the handle points after they are projected into the plane of the door, and the normal to the door. The box performs the function of both localizing the handle and estimating its pose. Experiments performed on a set of various door handles demonstrated the effectiveness of the proposed method.", "paper_title": "Localization of a door handle of unknown geometry using a single camera for door-opening with a mobile manipulator", "paper_id": "WOS:000307766800005"}