{"auto_keywords": [{"score": 0.03596176205294269, "phrase": "data_privacy"}, {"score": 0.00481495049065317, "phrase": "distributed_data"}, {"score": 0.003899269293218826, "phrase": "application_domains"}, {"score": 0.0038326698261576023, "phrase": "exact_distributed_versions"}, {"score": 0.0036553070575015344, "phrase": "initial_cluster_prototypes"}, {"score": 0.003324743991757282, "phrase": "complicating_factor"}, {"score": 0.0032398798149196432, "phrase": "k-means_limitations"}, {"score": 0.00306334226516593, "phrase": "final_model"}, {"score": 0.0030109772626153797, "phrase": "centralized_version"}, {"score": 0.0029722900280316216, "phrase": "clustering_algorithm"}, {"score": 0.0028468767420392945, "phrase": "distributed_data_subset"}, {"score": 0.002469269628821745, "phrase": "asymptotic_complexity_analyses"}, {"score": 0.002375253757224999, "phrase": "comparative_evaluation"}, {"score": 0.0022749744354271816, "phrase": "statistical_tests"}, {"score": 0.0021601997088758957, "phrase": "application_scenario"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Distributed clustering", " Evolutionary k-means", " Privacy preservation", " Low data transmission"], "paper_abstract": "Dealing with distributed data is one of the challenges for clustering, as most clustering techniques require the data to be centralized. One of them, k-means, has been elected as one of the most influential data mining algorithms for being simple, scalable, and easily modifiable to a variety of contexts and application domains. However, exact distributed versions of k-means are still sensitive to the selection of the initial cluster prototypes and require the number of clusters to be specified in advance. Additionally, preserving data privacy among repositories may be a complicating factor. In order to overcome k-means limitations, two different approaches were adopted in this paper: the first obtains a final model identical to the centralized version of the clustering algorithm and the second generates and selects clusters for each distributed data subset and combines them afterwards. It is also described how to apply the algorithms compared while preserving data privacy. The algorithms are compared experimentally from two perspectives: the theoretical one, through asymptotic complexity analyses, and the experimental one, through a comparative evaluation of results obtained from a collection of experiments and statistical tests. The results obtained indicate which algorithm is more suitable for each application scenario. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Comparison of distributed evolutionary k-means clustering algorithms", "paper_id": "WOS:000356196800010"}