{"auto_keywords": [{"score": 0.04637294642941193, "phrase": "disclosure_policies"}, {"score": 0.0059765805344967424, "phrase": "property-based_policies"}, {"score": 0.00481495049065317, "phrase": "trust_negotiations"}, {"score": 0.003955679223407243, "phrase": "disclosure_set"}, {"score": 0.003902992784453769, "phrase": "necessary_credentials"}, {"score": 0.003474694300991964, "phrase": "anonymization_techniques"}, {"score": 0.0033079039414389833, "phrase": "anonymous_one"}, {"score": 0.003177392642813126, "phrase": "alternative_anonymous_one_whose_information_content"}, {"score": 0.0031071175640144943, "phrase": "original_one"}, {"score": 0.0030656984915295275, "phrase": "alternative_disclosure_set"}, {"score": 0.002984504445973107, "phrase": "original_disclosure_policy"}, {"score": 0.0029447150254434842, "phrase": "trust_negotiation"}, {"score": 0.0027907771648224273, "phrase": "trust_negotiation_requirements"}, {"score": 0.002644865209801606, "phrase": "high-level_properties"}, {"score": 0.0024953686545818587, "phrase": "property-based_policy"}], "paper_keywords": [""], "paper_abstract": "Trust negotiation between two subjects require each one proving its properties to the other. Each subject specifies disclosure policies stating the types of credentials and attributes the counterpart has to provide to obtain a given resource. The counterpart, in response, provides a disclosure set containing the necessary credentials and attributes. If the counterpart wants to remain anonymous, its disclosure sets should not contain identity revealing information. In this paper, we propose anonymization techniques using which a subject can transform its disclosure set into an anonymous one. Anonymization transforms a disclosure set into an alternative anonymous one whose information content is different from the original one. This alternative disclosure set may no longer satisfy the original disclosure policy causing the trust negotiation to fail. To address this problem, we propose that trust negotiation requirements be expressed at a more abstract level using property-based policies. Property-based policies state the high-level properties that a counterpart has to provide to obtain a resource. A property-based policy can be implemented by a number of disclosure policies. Although these disclosure policies implement the same high-level property-based policy, they require different sets of credentials. Allowing the subject to satisfy any policy from the set of disclosure policies, increases not only the chances of a trust negotiation succeeding but also the probability of ensuring anonymity.", "paper_title": "Anonymity preserving techniques in trust negotiations", "paper_id": "WOS:000239416100007"}