{"auto_keywords": [{"score": 0.050075420470170544, "phrase": "phonetic_realizations"}, {"score": 0.049700683475412975, "phrase": "word-final_consonants"}, {"score": 0.046800023565389516, "phrase": "french"}, {"score": 0.004739773204474094, "phrase": "context_-_a_challenge"}, {"score": 0.0047026237903774895, "phrase": "french_grapheme-to-phoneme_converters"}, {"score": 0.00443308765153716, "phrase": "grapheme-to-phoneme_conversion"}, {"score": 0.0041136473765874815, "phrase": "foreign_language"}, {"score": 0.003757480190200645, "phrase": "les_escargots"}, {"score": 0.0036553070575015344, "phrase": "main_causes"}, {"score": 0.0035981701736904495, "phrase": "rule-based_methods"}, {"score": 0.0028293966058473476, "phrase": "required_phonetic_rules"}, {"score": 0.0027741761880779535, "phrase": "relative_efficiency"}, {"score": 0.00266693888510356, "phrase": "word-final_consonant_phoneme_prediction"}, {"score": 0.002573965014439041, "phrase": "obligatory_context_classification_errors"}, {"score": 0.002332322771009122, "phrase": "training_database"}, {"score": 0.0022157533515146503, "phrase": "context_classification"}, {"score": 0.002130056082139311, "phrase": "tts_application"}, {"score": 0.0021049977753042253, "phrase": "french_pronunciation"}], "paper_keywords": ["Decision trees", " Liaison in French", " Post-lexical rules", " Speech synthesis", " Grapheme-to-phoneme conversions"], "paper_abstract": "One of the main problems in developing a text-to-speech (TTS) synthesizer for French lies in grapheme-to-phoneme conversion. Automatic converters produce still too many errors in their phoneme sequences, to be helpful for people learning French as a foreign language. The prediction of the phonetic realizations of word-final consonants (WFCs) in general, and liaison in particular (les haricots vs. les escargots), are some of the main causes of such conversion errors. Rule-based methods have been used to solve these issues. Yet, the number of rules and their complex interaction make maintenance a problem. In order to alleviate such problems, we propose here an approach that, starting from a database (compiled from cases documented in the literature), allows to build C4.5 decision trees and subsequently, automate the generation of the required phonetic rules. We investigated the relative efficiency of this method both for classification of contexts and word-final consonant phoneme prediction. A prototype based on this approach reduced Obligatory context classification errors by 52%. Our method has the advantage to spare us the trouble to code rules manually, since they are contained already in the training database. Our results suggest that predicting the realization of WFCs as well as context classification is still a challenge for the development of a TTS application for teaching French pronunciation. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Predicting the phonetic realizations of word-final consonants in context - A challenge for French grapheme-to-phoneme converters", "paper_id": "WOS:000280917000006"}