{"auto_keywords": [{"score": 0.004598933498016774, "phrase": "network_security_management"}, {"score": 0.004342430078306461, "phrase": "based_network_management_approach"}, {"score": 0.0038713805573219297, "phrase": "policy_rules"}, {"score": 0.0030239842475439814, "phrase": "specific_configuration"}, {"score": 0.00283870598459543, "phrase": "formal_framework"}, {"score": 0.002758273619951683, "phrase": "network_security_management_information"}, {"score": 0.002416589459425828, "phrase": "information_models"}, {"score": 0.002375253757224999, "phrase": "abstraction_level"}, {"score": 0.002191489192077851, "phrase": "wbem_implementation"}, {"score": 0.0021539955106204354, "phrase": "formal_refinement_framework"}, {"score": 0.0021049977753042253, "phrase": "management_architectures"}], "paper_keywords": ["network security management", " security policy refinement", " formal specification", " WBEM"], "paper_abstract": "Today, users need to access their granted services from anywhere and at any time. Network security management must evolve to satisfy these requirements. The policy based network management approach proposes to separate the rules that govern the system from the functionalities provided by it. Nevertheless, the policy rules should be consistent, correct against the objectives and enforceable onto the devices. This problem becomes complex considering the dependencies of the rules - each rule on a device can impact another rule on another device - and each device needs specific configuration according to the technologies implemented. This article presents a formal framework for the refinement of network security management information. It includes three abstraction levels: the network security objectives, the network security tactics and the network security devices configurations. The information models of each abstraction level are formally specified and analysed (consistency, correctness and feasibility). A WBEM implementation of the formal refinement framework proves its feasibility in management architectures.", "paper_title": "Network security policy refinement process: Expression and analysis", "paper_id": "WOS:000239988500004"}