{"auto_keywords": [{"score": 0.039724546614597095, "phrase": "sender"}, {"score": 0.015718881972654863, "phrase": "judicial_debate"}, {"score": 0.014913345383019841, "phrase": "annotation_scheme"}, {"score": 0.013206392992709532, "phrase": "communicative_act"}, {"score": 0.004436716583179764, "phrase": "famous_scholars"}, {"score": 0.004258843584164121, "phrase": "cognitive_and_pragmatic_research"}, {"score": 0.004206879557938045, "phrase": "prosodic_and_visual_signals"}, {"score": 0.003972607172518598, "phrase": "sender's_literal_goal"}, {"score": 0.003892126266260425, "phrase": "meaning_x"}, {"score": 0.003372460634140967, "phrase": "antiphrastic_irony"}, {"score": 0.0033176589215021353, "phrase": "ironic_act"}, {"score": 0.003277140908834426, "phrase": "indirect_speech_act"}, {"score": 0.0030069962181403487, "phrase": "literal_meaning"}, {"score": 0.0028161764476743257, "phrase": "ironic_statement"}, {"score": 0.0023322317017275803, "phrase": "belief_view"}, {"score": 0.0021049977753042253, "phrase": "particular_case"}], "paper_keywords": ["irony", " goals and beliefs communication", " multimodal communication", " annotation"], "paper_abstract": "Irony has been studied by famous scholars across centuries, as well as more recently in cognitive and pragmatic research. The prosodic and visual signals of irony were also studied. Irony is a communicative act in which the Sender's literal goal is to communicate a meaning x, but through this meaning the Sender has the goal to communicate another meaning, y, which is contrasting, sometimes even opposite, to meaning x. In this case we have an antiphrastic irony. So an ironic act is an indirect speech act, in that its true meaning, the one really intended by the Sender, is not the one communicated by the literal meaning of the communicative act: it must be understood through inferences by the Addressee. The ironic statement may concern an event, object or person, and in this case, the Addressee, or a third person, or even the Sender itself (Self-irony). In this paper we define irony in terms of a goal and belief view of communication, and show how the annotation scheme, the Anvil-Score, and illustrate aspects of its expressive power by applying it to a particular case: ironic communication in a judicial debate.", "paper_title": "Irony in a judicial debate: Analyzing the subtleties of irony while testing the subtleties of an annotation scheme", "paper_id": "WOS:000254203200001"}