{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "evolving_interval"}, {"score": 0.004339609346924681, "phrase": "antecedent_part"}, {"score": 0.004162826481635768, "phrase": "takagi-sugeno-kang_fuzzy_inference_mechanism"}, {"score": 0.003850464100878052, "phrase": "data-driven_interval-reduction_approach"}, {"score": 0.0034881076466982226, "phrase": "sequential_algorithm"}, {"score": 0.0031270239691197515, "phrase": "metacognitive_learning_mechanism"}, {"score": 0.003062594954962045, "phrase": "metacognitive_learning"}, {"score": 0.0030151432267065815, "phrase": "learning_process"}, {"score": 0.002983916676307492, "phrase": "appropriate_selection"}, {"score": 0.0028178463431115562, "phrase": "input-output_relationship"}, {"score": 0.0027169974137406148, "phrase": "metacognitive_learning_algorithm"}, {"score": 0.002499798127196099, "phrase": "benchmark_time-series_problems"}, {"score": 0.0022291501521610737, "phrase": "practical_stock_price-tracking_problem"}], "paper_keywords": ["Adaptive interval reduction", " interval type-2 fuzzy set", " metacognition", " neurofuzzy inference system", " sequential learning"], "paper_abstract": "In this paper, we propose an evolving interval type-2 neurofuzzy inference system (IT2FIS) and its fully sequential learning algorithm. IT2FIS employs interval type-2 fuzzy sets in the antecedent part of each rule and the consequent realizes Takagi-Sugeno-Kang fuzzy inference mechanism. In order to render the inference fast and accurate, we propose a data-driven interval-reduction approach to convert interval type-1 fuzzy set in antecedent to type-1 fuzzy number in the consequent. During learning, the sequential algorithm learns a sample one-by-one and only once. The IT2FIS structure evolves automatically and adapts its network parameters using metacognitive learning mechanism concurrently. The metacognitive learning regulates the learning process by appropriate selection of learning strategies and helps the proposed IT2FIS to approximate the input-output relationship efficiently. An evolving IT2FIS employing a metacognitive learning algorithm is referred to as McTI2FIS. Performance of metacognitive interval type-2 neurofuzzy inference system (McIT2FIS) is evaluated using a set of benchmark time-series problems and is compared with existing type-2 and type-1 fuzzy inference systems. Finally, the performance of the proposed McIT2FIS has been evaluated using a practical stock price-tracking problem. The results clearly highlight that McIT2FIS performs better than other existing results in the literature.", "paper_title": "An Evolving Interval Type-2 Neurofuzzy Inference System and Its Metacognitive Sequential Learning Algorithm", "paper_id": "WOS:000365989300014"}