{"auto_keywords": [{"score": 0.04240035589136512, "phrase": "rough_k-means"}, {"score": 0.041760957509649324, "phrase": "rough_clustering"}, {"score": 0.03220820653441009, "phrase": "incorrectly_clustered_objects"}, {"score": 0.010628254117815735, "phrase": "correctly_clustered_objects"}, {"score": 0.0047395356621991935, "phrase": "important_role"}, {"score": 0.00468991337957911, "phrase": "data_mining"}, {"score": 0.004265953661191515, "phrase": "lingras"}, {"score": 0.004221433014141578, "phrase": "west"}, {"score": 0.004111584914709491, "phrase": "soft_clustering"}, {"score": 0.003819339842998955, "phrase": "pointed_evaluation"}, {"score": 0.002858313353461727, "phrase": "correctly_and_incorrectly_clustered_objects"}, {"score": 0.0025452314655691165, "phrase": "striking_relevance"}, {"score": 0.0021957487795963666, "phrase": "strong_alternative"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Rough clustering", " Soft clustering", " k-means"], "paper_abstract": "Clustering plays an important role in data mining. Some of the most famous clustering methods belong to the family of k-means algorithms. A decade ago, Lingras and West enriched the field of soft clustering by introducing rough k-means. Although rough clustering has been a very active field of research a pointed evaluation if it is really needed is still missing. Thus, the objective of the paper is to compare rough k-means and k-means. In k-means the number of correctly clustered objects is to be maximized which corresponds to minimizing the number of incorrectly clustered objects. In contrast to k-means, in rough clustering the numbers of correctly and incorrectly clustered objects are not complements anymore. Hence, in rough clustering the number of incorrectly clustered objects can be explicitly minimized. This is of striking relevance for many real life applications where minimizing the number of incorrectly clustered objects is more important than maximizing the number of correctly clustered objects. Therefore, we argue that rough k-means is often a strong alternative to k-means. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Is there any need for rough clustering?", "paper_id": "WOS:000349555500005"}