{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "authority"}, {"score": 0.008645719670190066, "phrase": "ranking_effects"}, {"score": 0.00844478431022745, "phrase": "data_fusion"}, {"score": 0.006193680159325495, "phrase": "result_lists"}, {"score": 0.004721162131188487, "phrase": "result_list_depth"}, {"score": 0.004468117364177126, "phrase": "key_role"}, {"score": 0.004261998281333649, "phrase": "potential_relevance"}, {"score": 0.0038624981944755813, "phrase": "ranked_lists"}, {"score": 0.003684213587410217, "phrase": "data_fusion_methods"}, {"score": 0.003584025547693836, "phrase": "different_retrieval_systems"}, {"score": 0.0033518704336033905, "phrase": "document's_probability"}, {"score": 0.0031100973266506163, "phrase": "systematic_examination"}, {"score": 0.00290855128461017, "phrase": "list_depth"}, {"score": 0.0025841336988141235, "phrase": "list_depths"}, {"score": 0.002464709648714996, "phrase": "large_number"}, {"score": 0.002445347925313158, "phrase": "relevant_documents"}, {"score": 0.002407078478216306, "phrase": "ranking_effect"}, {"score": 0.0021049977753042253, "phrase": "trec_test_collections"}], "paper_keywords": ["data fusion", " meta search", " Authority", " Ranking Effects"], "paper_abstract": "The Authority and Ranking Effects play a key role in data fusion. The former refers to the fact that the potential relevance of a document increases exponentially as the number of systems retrieving it increases and the latter to the phenomena that documents higher up in ranked lists and found by more systems are more likely to be relevant. Data fusion methods commonly use all the documents returned by the different retrieval systems being compared. Yet, as documents further down in the result lists are considered, a document's probability of being relevant decreases significantly and a major source of noise is introduced. This paper presents a systematic examination of the Authority and Ranking Effects as the number of documents in the result lists, called the list depth, is varied. Using TREC 3, 7, 8, 12 and 13 data, it is shown that the Authority and Ranking Effects are present at all list depths. However, if the systems in the same TREC track retrieve a large number of relevant documents, then the Ranking Effect only begins to emerge as more systems have found the same document and/or the list depth increases. It is also shown that the Authority and Ranking Effects are not an artifact of how the TREC test collections have been constructed. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Examining the Authority and Ranking Effects as the result list depth used in data fusion is varied", "paper_id": "WOS:000245605100014"}