{"auto_keywords": [{"score": 0.04357625316503966, "phrase": "cognitive_impairment"}, {"score": 0.011907582485447127, "phrase": "chronic_diseases"}, {"score": 0.007740489563401459, "phrase": "chronically_ill_patients"}, {"score": 0.006952423385878467, "phrase": "disease_self-management_interventions"}, {"score": 0.006797847411000363, "phrase": "chronic_illnesses"}, {"score": 0.0050734528654513365, "phrase": "mobile_technologies"}, {"score": 0.00453291458296651, "phrase": "disease_self-management"}, {"score": 0.00392100783796804, "phrase": "cognitive_disabilities"}, {"score": 0.0038048583022763796, "phrase": "on-line_solutions"}, {"score": 0.0036553070575015344, "phrase": "integrated_manner"}, {"score": 0.0033905067962602515, "phrase": "online_and_mobile_support"}, {"score": 0.0032900200522703923, "phrase": "disease-related_issues"}, {"score": 0.002830410693265704, "phrase": "online_support"}, {"score": 0.0027533766969174743, "phrase": "online_patient"}, {"score": 0.0025924833269301375, "phrase": "chronic_disease"}, {"score": 0.0025537472239953807, "phrase": "age-related_increases"}, {"score": 0.0025409639091476363, "phrase": "multiple_chronic_illnesses"}, {"score": 0.002515588444447652, "phrase": "technology_efficacy"}, {"score": 0.002465593351432208, "phrase": "mobile_support"}, {"score": 0.0024532502238727278, "phrase": "chronic_disease_self-management"}, {"score": 0.002241323362790572, "phrase": "suitable_integration"}, {"score": 0.002218933616777076, "phrase": "patient-caregiver_dyads"}, {"score": 0.0021912600076114033, "phrase": "online_applications"}, {"score": 0.002163930783583212, "phrase": "technology_adoption"}, {"score": 0.0021369416775353107, "phrase": "smart_home_technologies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Chronic disease", " Health self care", " Cognitive impairment", " Caregiver", " Smart homes", " Technology adoption", " Mobile technology", " Internet"], "paper_abstract": "Introduction: As the fraction of the population with chronic diseases continues to grow, methods and/or technologies must be found to help the chronically ill to take more responsibility to self-manage their illnesses. Internet based and/or mobile support for disease self-management interventions have often proved effective, but patients with chronic illnesses may have co-occurring cognitive impairment, making it more difficult for them to cope with technologies. Many older patients are also not familiar with technologies or they may have cognitive disabilities or dementia that reduce their ability to self-manage their healthcare. On-line solutions to the needs of chronically ill patients must be investigated and acted upon with care in an integrated manner, since resources invested in these solutions will be lost if patients do not adopt and continue to use them successfully. Objectives: To review the capabilities of online and mobile support for self-management of chronic illnesses, and the impacts that age and disease-related issues have on these interventions, including cognitive impairment and lack of access or familiarity with Internet or mobile technologies. Methods: This study includes a review of the co-occurrence of cognitive impairment with chronic diseases, and discusses how cognitive impairment, dyadic caregiver patient support, patient efficacy with technology, and smart home technologies can impact the effectiveness and sustainability of online support for disease self-management. Results: Disease self-management interventions (SMIs) using online patient centered support can often enable patients to manage their own chronic illnesses. However, our findings show that cognitive impairment often co-occurs in patients with chronic disease. This, along with age-related increases in multiple chronic illnesses and lack of technology efficacy, can be obstacles to Internet and mobile support for chronic disease self-management. Conclusion: Patients with chronic diseases may have greater than expected difficulties in using Internet and mobile technologies for disease self-management, often due to cognitive impairment or unfamiliarity with technology. Approaches to dealing with such barriers include suitable integration of solutions involving patient-caregiver dyads, better design of online applications, careful attention to technology adoption and sustainability, and smart home technologies. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Online self-management interventions for chronically ill patients: Cognitive impairment and technology issues", "paper_id": "WOS:000332397200003"}