{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "continuous_double_auctions"}, {"score": 0.013559460312265346, "phrase": "short-term_learning"}, {"score": 0.011692547173927453, "phrase": "market_information"}, {"score": 0.004673290248999786, "phrase": "novel_bidding_strategy"}, {"score": 0.004642377903273107, "phrase": "autonomous_trading_agents"}, {"score": 0.004230382915464495, "phrase": "wide_variety"}, {"score": 0.0034203358208034973, "phrase": "long-term_learning"}, {"score": 0.0033639840192975835, "phrase": "aggressiveness_factor"}, {"score": 0.0033306180744375616, "phrase": "agent's_choice"}, {"score": 0.0030246125031350903, "phrase": "principal_motivation"}, {"score": 0.0028966970007550824, "phrase": "market_fluctuations"}, {"score": 0.0027649684074145028, "phrase": "broader_trends"}, {"score": 0.002701361707441567, "phrase": "market_demand"}, {"score": 0.002595698433525986, "phrase": "current_state"}, {"score": 0.0025359761788258505, "phrase": "gdx"}, {"score": 0.002168975681697056, "phrase": "two-population_evolutionary_game_theoretic_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["continuous double auction", " bidding strategy", " evolutionary game theory"], "paper_abstract": "In this paper, we describe a novel bidding strategy that autonomous trading agents can use to participate in Continuous Double Auctions (CDAs). Our strategy is based on both short and long-term learning that allows Such agents to adapt their bidding behaviour to be efficient in a wide variety of environments. For the short-term learning, the agent updates the aggressiveness of its bidding behaviour (more aggressive means it will trade off profit to improve its chance of transacting, less aggressive that it targets more profitable transactions and is willing to trade off its chance of transacting to achieve them) based on market information observed after any bid or ask appears in the market. The long-term learning then determines how this aggressiveness factor influences an agent's choice of which bids or asks to submit in the market, and is based on market information observed after every transaction (successfully matched bid and ask). The principal motivation for the short-term learning is to enable the agent to immediately respond to market fluctuations, while for the long-term learning it is to adapt to broader trends in the way in which the market demand and supply changes over time. We benchmark Our strategy against the current state of the art (ZIP and GDX) and show that it outperforms these benchmarks in both static and dynamic environments. This is true both when the population is homogeneous (where the increase in efficiency is up to 5.2%) and heterogeneous (in which case there is a 0.85 probability of our strategy being adopted in a two-population evolutionary game theoretic analysis). (c) 2008 Published by Elsevier B.V.", "paper_title": "Strategic bidding in continuous double auctions", "paper_id": "WOS:000259170600004"}