{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "upload_competition"}, {"score": 0.03992659287798476, "phrase": "recent_measurements"}, {"score": 0.03414229704911109, "phrase": "new_problem"}, {"score": 0.004773040022691547, "phrase": "peer-to-peer_systems"}, {"score": 0.0041136473765874815, "phrase": "private_bittorrent_communities"}, {"score": 0.0035605741849764187, "phrase": "bandwidth_designers"}, {"score": 0.003334309053314909, "phrase": "selfish_peer'_problem"}, {"score": 0.002823207272381655, "phrase": "even_highly_cooperative_peers"}, {"score": 0.0025192983141887285, "phrase": "uploader_selection"}, {"score": 0.002453934333239467, "phrase": "sustained_sharing_ratio_enforcement"}, {"score": 0.0023694065215394593, "phrase": "existing_and_new_systems"}, {"score": 0.002297831085501592, "phrase": "important_design_consideration"}, {"score": 0.0022678201262721323, "phrase": "new_generation"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["peer-to-peer", " incentives"], "paper_abstract": "As peer-to-peer (P2P) file-sharing systems revolve around cooperation, the design of upload incentives has been one of the most important topics in P2P research for more than a decade. Several deployed systems, such as private BitTorrent communities, successfully manage to foster cooperation by banning peers when their sharing ratio becomes too low. Interestingly, recent measurements have shown that such systems tend to have an oversupply instead of an undersupply of bandwidth designers that have been obsessed with since the dawn of P2P. In such systems, the selfish peer' problem is finally solved, but a new problem has arisen: because peers have to keep up their sharing ratios, they now have to compete to upload. In this paper, we explore this new problem and show how even highly cooperative peers might in the end not survive the upload competition. On the basis of recent measurements of over half a million peers in private P2P communities, we propose and analyze several algorithms for uploader selection under oversupply. Our algorithms enable sustained sharing ratio enforcement and are easy to implement in both existing and new systems. Overall, we offer an important design consideration for the new generation of P2P systems in which selfishness is no longer an issue. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "The problem of upload competition in peer-to-peer systems with incentive mechanisms", "paper_id": "WOS:000317983600001"}