{"auto_keywords": [{"score": 0.04075292987843501, "phrase": "open_data"}, {"score": 0.010666500123125273, "phrase": "public_sector_information_data"}, {"score": 0.00481495049065317, "phrase": "free_public_sector_information"}, {"score": 0.00471003041684707, "phrase": "public_open_data_access"}, {"score": 0.0046328364646343375, "phrase": "direct_impact"}, {"score": 0.0045820747375409435, "phrase": "future_it_entrepreneurs'_perception"}, {"score": 0.004312629383852454, "phrase": "swedish"}, {"score": 0.004103942174451674, "phrase": "public_open_data"}, {"score": 0.003555902292752528, "phrase": "business_plan"}, {"score": 0.0034212450542713607, "phrase": "significant_interest"}, {"score": 0.002713604305939145, "phrase": "previous_discourse"}, {"score": 0.0025678829712650437, "phrase": "government_accountability"}, {"score": 0.0021879624017959493, "phrase": "traditional_sectors"}, {"score": 0.0021049977753042253, "phrase": "previously_calculated_societal_values"}], "paper_keywords": ["Open data", " entrepreneurs", " innovation", " public sector information", " PSI", " European Union", " entrepreneurial incentive"], "paper_abstract": "Public open data access has a direct impact on future IT entrepreneurs' perception of ability to execute their business plans. Using high quality (50%-98% response rate) survey data from 138 Swedish IT entrepreneurs, we find that access to public open data is considered very important for many IT-startups; 43% find open data essential for the realization of their business plan and 82% claim that access would support and strengthen the business plan. The survey also indicates a significant interest in, and willingness to pay for, public sector information data from companies that do not intend to commercialize data themselves but intend to use it to support or test other business models. From the survey, it is possible to infer that the previous discourse on open data, viewing it as a means for government accountability or e-government, or as the foundation for the commercialization of public sector information data is too limited. Open data should instead be seen as an enabler of innovation outside these traditional sectors. This also indicates that the previously calculated societal values of open data might be underestimated.", "paper_title": "Open Data as a Foundation for Innovation: The Enabling Effect of Free Public Sector Information for Entrepreneurs", "paper_id": "WOS:000209652700045"}