{"auto_keywords": [{"score": 0.030587330756505313, "phrase": "permutation_graphs"}, {"score": 0.015719716506582538, "phrase": "co-comparability_graphs"}, {"score": 0.011053303956930062, "phrase": "pdtc_problem"}, {"score": 0.01083625405153898, "phrase": "polynomial_time"}, {"score": 0.00843737392737618, "phrase": "bc_problem"}, {"score": 0.004719816332271661, "phrase": "delivery_tour_combination_problem"}, {"score": 0.004663636232080366, "phrase": "double_traveling_salesman_problem"}, {"score": 0.004553265070135597, "phrase": "vehicle_routing_problem"}, {"score": 0.00405538690701843, "phrase": "delivery_tour"}, {"score": 0.0038965930422333035, "phrase": "valid_distribution"}, {"score": 0.002957471572421436, "phrase": "bounded_coloring"}, {"score": 0.0029339958602628328, "phrase": "bc"}, {"score": 0.002841545331522694, "phrase": "latter_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bounded coloring", " Capacitated coloring", " Equitable coloring", " Permutation graphs", " Scheduling problems", " Thinness"], "paper_abstract": "The Double Traveling Salesman Problem with Multiple Stacks is a vehicle routing problem in which pickups and deliveries must be performed in two independent networks. The items are stored in stacks and repacking is not allowed. Given a pickup and a delivery tour, the problem of checking if there exists a valid distribution of items into s stacks of size h that is consistent with the given tours, is known as Pickup and Delivery Tour Combination (PDTC) problem. In the paper, we show that the PDTC problem can be solved in polynomial time when the number of stacks s is fixed but the size of each stack is not. We build upon the equivalence between the PDTC problem and the bounded coloring (BC) problem on permutation graphs: for the latter problem, s is the number of colors and h is the number of vertices that can get a same color. We show that the BC problem can be solved in polynomial time when s is a fixed constant on co-comparability graphs, a superclass of permutation graphs. To the contrary, the BC problem is known to be hard on permutation graphs when h >= 6 is a fixed constant, but s is unbounded. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Bounded coloring of co-comparability graphs and the pickup and delivery tour combination problem", "paper_id": "WOS:000296037000003"}