{"auto_keywords": [{"score": 0.04715783641110325, "phrase": "process_models"}, {"score": 0.008796633508734348, "phrase": "merged_models"}, {"score": 0.007555132311086664, "phrase": "merged_model"}, {"score": 0.00481495049065317, "phrase": "business_process_consolidation"}, {"score": 0.0046242451772036145, "phrase": "consolidated_business_process_models"}, {"score": 0.004461051281091779, "phrase": "common_fragments"}, {"score": 0.0042650992966174065, "phrase": "multiple_models"}, {"score": 0.0026481480455339055, "phrase": "extraction_algorithms"}, {"score": 0.0025089420019955232, "phrase": "multiple_application_domains"}, {"score": 0.0024311346712789553, "phrase": "merging_algorithm"}, {"score": 0.0024093494406195386, "phrase": "compact_models"}, {"score": 0.002272415777234064, "phrase": "case_study"}, {"score": 0.0022318655527987846, "phrase": "large_insurance_company"}, {"score": 0.0021336208506092173, "phrase": "extraction_operators"}, {"score": 0.0021049977753042253, "phrase": "practical_setting"}], "paper_keywords": ["Design", " Management", " Business process model", " variability", " model merging", " graph matching"], "paper_abstract": "This article addresses the problem of constructing consolidated business process models out of collections of process models that share common fragments. The article considers the construction of unions of multiple models (called merged models) as well as intersections (called digests). Merged models are intended for analysts who wish to create a model that subsumes a collection of process models - typically representing variants of the same underlying process - with the aim of replacing the variants with the merged model. Digests, on the other hand, are intended for analysts who wish to identify the most recurring fragments across a collection of process models, so that they can focus their efforts on optimizing these fragments. The article presents an algorithm for computing merged models and an algorithm for extracting digests from a merged model. The merging and digest extraction algorithms have been implemented and tested against collections of process models taken from multiple application domains. The tests show that the merging algorithm produces compact models and scales up to process models containing hundreds of nodes. Furthermore, a case study conducted in a large insurance company has demonstrated the usefulness of the merging and digest extraction operators in a practical setting.", "paper_title": "Business Process Model Merging: An Approach to Business Process Consolidation", "paper_id": "WOS:000322480600002"}