{"auto_keywords": [{"score": 0.04972074726974986, "phrase": "insider_attacks"}, {"score": 0.03115614200293424, "phrase": "risk_assessment_process"}, {"score": 0.00481495049065317, "phrase": "insider_threats"}, {"score": 0.0045855181084455444, "phrase": "insider_attack"}, {"score": 0.0038144050983900286, "phrase": "daunting_task"}, {"score": 0.003356675879109443, "phrase": "middle_ground"}, {"score": 0.003306559295382181, "phrase": "necessary_privileges"}, {"score": 0.003032528228056611, "phrase": "role-based_access_control"}, {"score": 0.0027916287357898544, "phrase": "suspicious_changes"}, {"score": 0.002770698757048806, "phrase": "users'_behavior"}, {"score": 0.002719055901632759, "phrase": "users'_trust"}, {"score": 0.002502995662011305, "phrase": "unauthorized_information"}, {"score": 0.0024563302149829, "phrase": "coloured-petri_net"}, {"score": 0.0023745087648471613, "phrase": "existing_role_activation_problem"}, {"score": 0.002295406551990453, "phrase": "risk_exposure"}, {"score": 0.0022105951175680856, "phrase": "inference_threats"}, {"score": 0.0021775526153883355, "phrase": "experimental_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Trust", " Risk management", " Insider threat", " Access control", " Role based access control", " Inference threat"], "paper_abstract": "Insider Attacks are one of the most dangerous threats organizations face today. An insider attack occurs when a person authorized to perform certain actions in an organization decides to abuse the trust, and harm the organization. These attacks may negatively impact the reputation of the organization, its productivity, and may produce losses in revenue and clients. Avoiding insider attacks is a daunting task. While it is necessary to provide privileges to employees so they can perform their jobs efficiently, providing too many privileges may backfire when users accidentally or intentionally abuse their privileges. Hence, finding a middle ground, where the necessary privileges are provided and malicious usage are avoided, is necessary. In this paper, we propose a framework that extends the role-based access control (RBAC) model by incorporating a risk assessment process, and the trust the system has on its users. Our framework adapts to suspicious changes in users' behavior by removing privileges when users' trust falls below a certain threshold. This threshold is computed based on a risk assessment process that includes the risk due to inference of unauthorized information. We use a Coloured-Petri net to detect inferences. We also redefine the existing role activation problem, and propose an algorithm that reduces the risk exposure. We propose a methodology to help administrators managing inference threats. We present experimental evaluation to validate our work. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "An adaptive risk management and access control framework to mitigate insider threats", "paper_id": "WOS:000329007400010"}