{"auto_keywords": [{"score": 0.02591362401088974, "phrase": "information_activities"}, {"score": 0.012927445151771308, "phrase": "credibility_judgements"}, {"score": 0.00481495049065317, "phrase": "upper_secondary_school_students'_narratives"}, {"score": 0.004294724955301414, "phrase": "information_seekers"}, {"score": 0.00422826362023938, "phrase": "school_context"}, {"score": 0.003993216345115755, "phrase": "-_blog_posts"}, {"score": 0.0038304902197108643, "phrase": "swedish_upper_secondary_school"}, {"score": 0.0037321585095070483, "phrase": "bottom-up_coding_process"}, {"score": 0.0036553070575015344, "phrase": "sociocultural_concept"}, {"score": 0.0034519997658752598, "phrase": "students'_accounts"}, {"score": 0.0033633514001658086, "phrase": "first_tension"}, {"score": 0.0031270239691197515, "phrase": "good_group_member"}, {"score": 0.003078577062864183, "phrase": "second_tension"}, {"score": 0.002968424524565369, "phrase": "independent_information_seeker"}, {"score": 0.0027169974137406148, "phrase": "school_setting"}, {"score": 0.002579140290642792, "phrase": "specific_social_practice"}, {"score": 0.00253916011199984, "phrase": "situated_activities"}, {"score": 0.002385326947545194, "phrase": "educational_contexts"}, {"score": 0.002299921909935613, "phrase": "social_norms"}, {"score": 0.0021945833590668973, "phrase": "discursive_interaction"}], "paper_keywords": ["Information literacy", " Learning", " Students", " Schools"], "paper_abstract": "Purpose - The purpose of this paper is to explore how students construct narratives of themselves as information seekers in a school context where their descriptions of their information activities are assessed and graded. Design/methodology/approach - Blog posts on credibility judgements written by 28 students at a Swedish upper secondary school were analysed through a bottom-up coding process based in the sociocultural concept of narratives of selves. Findings - Two tensions in the students' accounts are identified. The first tension is that between the description of the individual, independent student and the description of the good group member. The second tension is between describing oneself as an independent information seeker and at the same time as someone who seeks information in ways that are sanctioned within the school setting. Research limitations/implications - The study focuses on a specific social practice and on situated activities, but also illustrates some aspects of information activities that pertain to educational contexts in general. It explores how social norms related to credibility judgements are expressed and negotiated in discursive interaction. Practical implications - The study highlights that when information activities become objects of assessment, careful consideration of what aspects are meant to be assessed is necessary. Originality/value - The study is based on the idea of information activities as socially and discursively shaped, and it illustrates some of the consequences when information activities become objects of teaching, learning, and grading.", "paper_title": "To assess and be assessed Upper secondary school students' narratives of credibility judgements", "paper_id": "WOS:000349645500005"}