{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "blogging_-_an_analysis"}, {"score": 0.004227515355865597, "phrase": "widespread_blogging"}, {"score": 0.004139223748460922, "phrase": "bloggers'_partisanship"}, {"score": 0.0037906837773782, "phrase": "immediate_community"}, {"score": 0.003633927813203731, "phrase": "content_analysis"}, {"score": 0.0035579889785989738, "phrase": "additional_searches"}, {"score": 0.0035206146304891973, "phrase": "lexis-nexis_newspaper_archive"}, {"score": 0.003434922209075514, "phrase": "internet_poll_data"}, {"score": 0.003281367480608883, "phrase": "uk"}, {"score": 0.002994178996584381, "phrase": "campaign_issues"}, {"score": 0.0028702659563021047, "phrase": "overt_partisan_identity"}, {"score": 0.0027514668612638074, "phrase": "partisan_networks"}, {"score": 0.0026375718041787, "phrase": "similar_outlook"}, {"score": 0.0025106241866273897, "phrase": "campaign_news_agenda"}, {"score": 0.0024581013157048926, "phrase": "extensive_research"}, {"score": 0.002290814637620121, "phrase": "election_campaign_blogosphere"}, {"score": 0.002234988641498543, "phrase": "important_insights"}, {"score": 0.0022114807037424944, "phrase": "evolving_online_election_communication_environment"}, {"score": 0.0021049977753042253, "phrase": "general_election_campaigns"}], "paper_keywords": ["communication technologies", " worldwide web", " elections", " internet", " United Kingdom"], "paper_abstract": "Purpose - In light of the phenomenon of blogging in the 2004 US presidential campaign, this article aims to examine blogging during the 2005 British general election campaign. The article seeks to establish how widespread blogging was, the extent of bloggers' partisanship, what issues blogs were concerned with, what the purpose of the messages posted by the bloggers were, and what if any impact blogs had beyond the immediate community of users. Design/methodology/approach - These questions were addressed through a content analysis of over 300 blogs and 1,300 posted messages, by additional searches of the Lexis-Nexis newspaper archive, and via the use of internet poll data on blogging. Findings - The research showed that blogging in the UK is in its infancy. There were few bloggers posting messages about the campaign and few people accessed blogs regularly. Most of the comments posted focused on campaign issues and were observational. While some of the bloggers exhibited an overt partisan identity, most did not. There was also some evidence of partisan networks, with blogs of a particular partisan/ideological position hyperlinking to others with a similar outlook. However, unlike the 2004 US presidential election campaign, blogs had no impact on the campaign news agenda. Research limitations/implications - Despite extensive research it is difficult to ascertain whether the sample of blogs examined in the research represented the entirety of the election campaign blogosphere. Nevertheless, the findings provide important insights into the evolving online election communication environment in the UK. Originality/value - The study is the first to examine systematically the blogging about the general election campaigns in the UK.", "paper_title": "Online campaign communication and the phenomenon of blogging - An analysis of web logs during the 2005 British general election campaign", "paper_id": "WOS:000241245600004"}