{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "reputation_management_system_for_peer-to-peer_wireless_sensor_networks"}, {"score": 0.00464976086880886, "phrase": "dominant_challenges"}, {"score": 0.004386887374401584, "phrase": "peer_sensor_network"}, {"score": 0.004211731831120046, "phrase": "numerous_efforts"}, {"score": 0.004067152645111547, "phrase": "reputation_management_systems"}, {"score": 0.0038820411362656803, "phrase": "trustworthy_communication_partners"}, {"score": 0.0031111332159761344, "phrase": "new_reputation_system"}, {"score": 0.003039445153076014, "phrase": "authenticpeer"}, {"score": 0.002720785798036066, "phrase": "proposed_system"}, {"score": 0.0025221759076833124, "phrase": "common_threat_models"}, {"score": 0.00249293148301837, "phrase": "experimental_results"}, {"score": 0.0024640253074497114, "phrase": "enhanced_performance"}, {"score": 0.002435453488008121, "phrase": "authenticpeer_reputation_system"}, {"score": 0.002244494905883452, "phrase": "success_rate"}, {"score": 0.0022184630090454132, "phrase": "good_users"}, {"score": 0.0021672995161145276, "phrase": "inauthentic_downloads"}, {"score": 0.0021049977753042253, "phrase": "threat_models"}], "paper_keywords": [""], "paper_abstract": "Reputation and trust are dominant challenges in peer-to-peer (P2P) networks in general and peer-to-peer sensor network (P2PWSN) in particular. Numerous efforts have been devoted to developing reputation management systems that can alleviate the difficulties in finding trustworthy communication partners in P2P networks. There are two main approaches in this field: peer-based reputation systems and message-based reputation systems, each of which has its own advantages and limitations. In this paper, we propose a new reputation system for P2PWSN, AuthenticPeer, which utilizes techniques from both approaches in a way that maximizes their advantages and overcomes their limitations. The proposed system has been tested thoroughly in various simulated P2PWSN environments under various number of files and common threat models. Experimental results illustrate enhanced performance of AuthenticPeer reputation system when compared to two P2P reputation systems, EigenTrust and Incremental EigenTrust, in terms of success rate of good users and fraction of inauthentic downloads, specifically with the threat models: individual malicious, malicious collective, camouflaged collective, and malicious spies, regardless of the number of files in the networks.", "paper_title": "AuthenticPeer: A Reputation Management System for Peer-to-Peer Wireless Sensor Networks", "paper_id": "WOS:000364941900001"}