{"auto_keywords": [{"score": 0.03540816650742105, "phrase": "successive_solutions"}, {"score": 0.004791878972726824, "phrase": "random_linear_equations"}, {"score": 0.0047006879240764935, "phrase": "random_systems"}, {"score": 0.004655742198075387, "phrase": "linear_equations"}, {"score": 0.004458722048888919, "phrase": "k_variables"}, {"score": 0.004352876088312741, "phrase": "precise_description"}, {"score": 0.0028784478769295204, "phrase": "precisely_which_pairs"}, {"score": 0.0026395715432958665, "phrase": "random_hypergraphs"}, {"score": 0.0025892330566358503, "phrase": "independent_interest"}, {"score": 0.002467536552997677, "phrase": "random_k-uniform_hypergraph"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["random k-XORSAT", " solution clustering", " hypergraphs", " cores"], "paper_abstract": "We consider random systems of linear equations over GF(2) in which every equation binds k variables. We obtain a precise description of the clustering of solutions in such systems. In particular, we prove that with probability that tends to 1 as the number of variables, n, grows: for every pair of solutions sigma,, either there exists a sequence of solutions starting at sigma and ending at such that successive solutions have Hamming distance O(log n), or every sequence of solutions starting at sigma and ending at contains a pair of successive solutions with distance (n). Furthermore, we determine precisely which pairs of solutions are in each category. Key to our results is establishing the following high probability property of cores of random hypergraphs which is of independent interest. Every vertex not in the r-core of a random k-uniform hypergraph can be removed by a sequence of O(log n) steps, where each step amounts to removing one vertex of degree strictly less than r at the time of removal. (c) 2013 Wiley Periodicals, Inc. Random Struct. Alg., 46, 197-231, 2015", "paper_title": "The Solution Space Geometry of Random Linear Equations", "paper_id": "WOS:000348436600001"}