{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electronic_banking"}, {"score": 0.04107868567004354, "phrase": "trust-generating_mechanisms"}, {"score": 0.040600490254161195, "phrase": "different_effects"}, {"score": 0.0046004861111734185, "phrase": "trust_research"}, {"score": 0.004476399615305783, "phrase": "electronic_transactions"}, {"score": 0.004435782384431224, "phrase": "banking_industry"}, {"score": 0.004186926251483987, "phrase": "\"institution-based\"_trust_mechanisms"}, {"score": 0.004061584718427419, "phrase": "web_quality"}, {"score": 0.003775803846431323, "phrase": "interne_banking_services"}, {"score": 0.003651603914126771, "phrase": "experimental_design"}, {"score": 0.003618443379266972, "phrase": "internet_banking_users"}, {"score": 0.003194209418929854, "phrase": "bank_website's_quality"}, {"score": 0.00316518932828897, "phrase": "user_viewpoint"}, {"score": 0.003089080923888397, "phrase": "mere_presence"}, {"score": 0.0028978654846251047, "phrase": "electronic_banking_services"}, {"score": 0.002597126785932809, "phrase": "single_specific_context"}, {"score": 0.002414138203828421, "phrase": "web_design"}, {"score": 0.0023776656246300063, "phrase": "online_services"}, {"score": 0.002285389120812562, "phrase": "first_study"}, {"score": 0.002257721748924697, "phrase": "combined_effects"}, {"score": 0.0022101055924375725, "phrase": "bank's_website"}, {"score": 0.0021569129153653777, "phrase": "design_quality"}, {"score": 0.00211785847468134, "phrase": "greater_understanding"}, {"score": 0.0021049977753042253, "phrase": "navigation_behaviour"}], "paper_keywords": ["Virtual banking", " Shops"], "paper_abstract": "Purpose The purpose of this paper is to contribute to the field of trust research with a focus on optimising this perception via electronic transactions in the banking industry. Specifically, the study aims to examine trust toward a bank and its dependability using a variety of \"institution-based\" trust mechanisms, such as security of transaction, reputation and web quality. Design/methodology/approach It is expected that the manner in which the trust-generating mechanisms are presented has different effects on the level of trust in the interne banking services. The analysis of these influences is based on an experimental design applied to internet banking users with the aim of treating the scenarios defined by combinations of stimuli. In particular, a design was used with three intra-subject factors: the first two, manipulated a priori, combine seals and their associated clauses or arrangements, while the third considered a bank website's quality from the user viewpoint. Findings The analysis discovers that the mere presence of seals is not in itself important for the explanation of beliefs about trustworthiness and dependability of a website with electronic banking services. However, the manner in which the trust-generating mechanisms are presented, either individually or in their different combinations, has different effects on trust. Research limitations/implications The study is limited to data from one country and a single specific context (a new electronic banking website), so care should be taken when generalising to other electronic businesses. The findings contribute several recommendations for web design and optimisation of the online services and/or content offered by a bank. Originality/value This paper is the first study to evaluate the combined effects of four seals generators of trust in a bank's website and its associated arrangements or clauses as well as design quality. The study will provide greater understanding of navigation behaviour and the decisions made by users of electronic banking.", "paper_title": "How to improve trust toward electronic banking", "paper_id": "WOS:000288233100005"}