{"auto_keywords": [{"score": 0.04306043741334064, "phrase": "detection_risk"}, {"score": 0.015719716506582538, "phrase": "audit_detection_risk_assessment_system"}, {"score": 0.014506174382166821, "phrase": "audit_evidence"}, {"score": 0.008549529721792926, "phrase": "fuzzy_theory"}, {"score": 0.008468564815198948, "phrase": "audit_risk_model"}, {"score": 0.004568525347438891, "phrase": "audit_designation"}, {"score": 0.003413183361838603, "phrase": "traditional_determination_method"}, {"score": 0.0032850648549389025, "phrase": "audit_quality"}, {"score": 0.0031921317979928406, "phrase": "audit_failure"}, {"score": 0.003087017178815267, "phrase": "grounded_theory"}, {"score": 0.002873247913129334, "phrase": "delphi_method"}, {"score": 0.00276534038425712, "phrase": "empirical_audit_experts"}, {"score": 0.002537097217899195, "phrase": "audit_staff"}, {"score": 0.0023954743066925714, "phrase": "initial_audit_strategies"}, {"score": 0.0022725931637071852, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["detection risk", " grounded theory", " fuzzy theory", " audit risk model"], "paper_abstract": "The result of audit designation is significantly influenced by the audit evidence collected when planning the audit and the amount of audit evidence depends on the degree of detection risk. Therefore, when the assessment factors of detection risk arc more objective and correct, audit costs and the risk of audit failure can be reduced. Thus, the aim of this paper is to design an audit detection risk assessment system that could more precisely assess detection risk, comparing with the traditional determination method of detection risk in order to increase the audit quality and reduce the possibility Of audit failure. First of all, the grounded theory is used to reorganize 53 factors affecting detection risk mentioned in literatures and then employed the Delphi method to screen the 43 critical risk factors agreed upon by empirical audit experts. In addition, using the fuzzy theory and audit risk model to calculate the degree of detection risk allow the audit staff to further determine the amount of audit evidence collected and set tip initial audit strategies and construct the audit detection risk assessment system. Finally, we considered a case study to evaluate the system in terms of its feasibility and validity. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "The development of audit detection risk assessment system: Using the fuzzy theory and audit risk model", "paper_id": "WOS:000257993700047"}