{"auto_keywords": [{"score": 0.041843926397594905, "phrase": "sap-erp_system"}, {"score": 0.0368372167659939, "phrase": "user_satisfaction"}, {"score": 0.013392230105647267, "phrase": "human-centred_approach"}, {"score": 0.00481495049065317, "phrase": "erp_software"}, {"score": 0.004594582559945568, "phrase": "successful_products"}, {"score": 0.004536244367689415, "phrase": "successful_systems"}, {"score": 0.004201381218977942, "phrase": "existing_business_processes"}, {"score": 0.0037128955884188773, "phrase": "human-centred_dimensions"}, {"score": 0.0032810180076973806, "phrase": "systematic_and_successful_erp_system"}, {"score": 0.002742787059497186, "phrase": "erp_system"}, {"score": 0.00268488398249084, "phrase": "systematic_human-centred_model"}, {"score": 0.002539978170928796, "phrase": "proposed_five_dimensional_model"}, {"score": 0.002433843373780471, "phrase": "case_study"}, {"score": 0.0024028742248152425, "phrase": "quantitative_analysis"}, {"score": 0.0023221983158528163, "phrase": "urgent_and_immediate_need"}, {"score": 0.0022926465161639633, "phrase": "scientific_and_engineering_methodologies"}, {"score": 0.002215663255682209, "phrase": "complex_systems"}, {"score": 0.002178144355363467, "phrase": "fundamental_forms"}, {"score": 0.002159623311924437, "phrase": "human_activity"}, {"score": 0.0021049977753042253, "phrase": "communication_technology"}], "paper_keywords": ["Enterprise resource planning (ERP) system", " Human-centred approach", " SAP", " User satisfaction"], "paper_abstract": "Most software projects are largely undertaken with a focus on developing successful products rather than successful systems. For example, enterprise resource planning (ERP) products are generally developed in isolation from other system components like people, information or existing business processes. This paper applies the human-centred approach in studying the design of SAP-ERP system and measuring its user satisfaction. The objective of the paper is to explore the relationship between the human-centred dimensions (process, syntactic, semantic, social and pragmatic) and the user satisfaction on SAP-ERP system. This paper attempts to answer two questions: what human-centred model can provide a systematic and successful ERP system? And what methodology can be used for validating this model and how can it be applied for evaluating user satisfaction? The contributions of the paper are to address the need for the human-centred approach as a basis for the design of ERP system, to define a systematic human-centred model for measurement towards user satisfaction. This paper suggests the application of a proposed five dimensional model in measuring the human-centredness of SAP-ERP system and embarks a case study to conduct quantitative analysis. In conclusion the paper suggests an urgent and immediate need to develop scientific and engineering methodologies for designing, building, and analysing complex systems that centre on fundamental forms of human activity, supported by computer and communication technology.", "paper_title": "Successful product or successful system? User satisfaction measurement of ERP software", "paper_id": "WOS:000326297800006"}