{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "extra_virgin_olive_oils"}, {"score": 0.0403836663569968, "phrase": "pdo_sabina"}, {"score": 0.015297261702605477, "phrase": "phenolic_fraction"}, {"score": 0.004777214679969785, "phrase": "sabina_pdo"}, {"score": 0.004739773204474094, "phrase": "chromatographic_fingerprinting"}, {"score": 0.00443308765153716, "phrase": "chromatographic_fingerprint"}, {"score": 0.004295681900150244, "phrase": "chemometric_classification_techniques"}, {"score": 0.00414616342377235, "phrase": "protected_denomination"}, {"score": 0.00355590361476727, "phrase": "hplc"}, {"score": 0.003338690782620756, "phrase": "better_results"}, {"score": 0.002752390133272192, "phrase": "mid-level_data_fusion_approach"}, {"score": 0.0025638362414466278, "phrase": "traceability_model"}, {"score": 0.0023694065215394593, "phrase": "mass_spectroscopy"}, {"score": 0.0023415390666563177, "phrase": "vanillic_acid"}, {"score": 0.002323142666222693, "phrase": "p-coumaric_acid"}, {"score": 0.0021983430142660373, "phrase": "significant_role"}, {"score": 0.002181069180139225, "phrase": "traceability_markers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Extra virgin olive oil", " Phenolic fraction", " Partial least squares-discriminant analysis (PIS-DA)", " Backward-interval-PIS and genetic algorithms (biPLS-GA)"], "paper_abstract": "In this study, the possibility of using the chromatographic fingerprint of the phenolic fraction of extra virgin olive oils coupled to chemometric classification techniques to trace the origin of extra virgin olive oils with a protected denomination of origin (PDO) was investigated. In particular, this approach was used to characterize the PDO Sabina (an oil producing area in the center of Italy). Partial least squares-discriminant analysis (PLS-DA) models were at first built on the HPLC chromatographic profiles recorded at three different wavelengths (254 nm, 280 nm and 340 nm). Better results were obtained by selecting the most relevant regions of the chromatograms by a combination of backward-interval-PLS and genetic algorithms (biPIS-GA), especially in the case of the data at 280 nm and 340 nm (about 85% correct classification rate). Lastly, the use of a mid-level data fusion approach to combine the regions selected at 280 and 340 nm allowed further improving the specificity of the traceability model for PDO Sabina towards other oils. Identification of the compounds corresponding to regions of the chromatograms selected by biPLS-GA using mass spectroscopy suggested that vanillic acid, p-coumaric acid, luteolin, pinoresinol, acetoxypinoresinol, apigenin and metoxyluteolin can play a significant role as traceability markers for the PDO Sabina. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Geographical traceability of extra virgin olive oils from Sabina PDO by chromatographic fingerprinting of the phenolic fraction coupled to chemometrics", "paper_id": "WOS:000346398500021"}