{"auto_keywords": [{"score": 0.006761924940201737, "phrase": "trace_files"}, {"score": 0.00481495049065317, "phrase": "network_simulators"}, {"score": 0.004684157900507474, "phrase": "research_community"}, {"score": 0.004539005582217309, "phrase": "education_purpose"}, {"score": 0.00443308765153716, "phrase": "different_network_simulators"}, {"score": 0.00438105507792004, "phrase": "network_simulator_version"}, {"score": 0.0040176151419992956, "phrase": "generated_trace_files"}, {"score": 0.003939296259436904, "phrase": "easy_task"}, {"score": 0.003742711659195878, "phrase": "remote_simulation_facilities"}, {"score": 0.003626626504149897, "phrase": "trace_file_analysis"}, {"score": 0.0034185505275141077, "phrase": "single_environment"}, {"score": 0.003260690513595527, "phrase": "web_application"}, {"score": 0.0030135741897058844, "phrase": "remote_execution"}, {"score": 0.002931569771634119, "phrase": "wired_and_wireless_scenarios"}, {"score": 0.0028743610212291727, "phrase": "wireless_sensor_networks"}, {"score": 0.002818273496510737, "phrase": "bluetooth"}, {"score": 0.0027851425970797767, "phrase": "wimax"}, {"score": 0.0027200305495826797, "phrase": "standard_modules"}, {"score": 0.0021049977753042253, "phrase": "custom_scripts"}], "paper_keywords": [""], "paper_abstract": "The use of network simulators has not remained confined to the research community, but are increasingly being used for education purpose as well. Among the different network simulators available, Network Simulator version 2 (NS-2) is widely popular. However, installing NS-2, executing the simulations, and subsequently analyzing the generated trace files may not be an easy task, especially for novices. Although several tools have been developed to provide remote simulation facilities or to aid in the process of trace file analysis, often they have their own dependencies. Further, there is a lack of a single environment for simulation and post-processing. This paper presents ns2web, a web application to address such issues and provide a single, integrated environment for simulation with NS-2, and analysis of trace files. Ns2web enables remote execution of simulations with NS-2 for both wired and wireless scenarios. The latter includes Wireless Sensor Networks (WSNs), Bluetooth, and WiMax modules, apart from the standard modules that ship with NS-2.34. The software also provides a toolkit to analyze trace files generated as a result of the simulation. Further, ns2web is publicly available and could be accessed by anyone over the Web. This application enables a user to focus on simulations with NS-2, rather than spend his time in installing (or patching) the simulator or writing custom scripts for analysis.", "paper_title": "A WEB-BASED INTEGRATED ENVIRONMENT FOR SIMULATION AND ANALYSIS WITH NS-2", "paper_id": "WOS:000324598600016"}