{"auto_keywords": [{"score": 0.03121217513999791, "phrase": "nash_equilibrium"}, {"score": 0.015719716506582538, "phrase": "next-hop_routing"}, {"score": 0.004781357546476652, "phrase": "elastic_demands"}, {"score": 0.004633052743252902, "phrase": "self-interested_agents"}, {"score": 0.004411406624893529, "phrase": "autonomous_systems"}, {"score": 0.004319677360634253, "phrase": "pricing_decisions"}, {"score": 0.004041546659145336, "phrase": "downstream_neighbors"}, {"score": 0.0039024014688338964, "phrase": "next_hop"}, {"score": 0.0035750641312373202, "phrase": "traffic_demand"}, {"score": 0.003415812499773905, "phrase": "different_source_nodes"}, {"score": 0.003162252895465901, "phrase": "entire_route"}, {"score": 0.003021334228842501, "phrase": "sufficient_conditions"}, {"score": 0.0028765701985514294, "phrase": "efficient_algorithm"}, {"score": 0.0026166287606163145, "phrase": "single_source"}, {"score": 0.002456486927713543, "phrase": "minor_assumptions"}, {"score": 0.002439308179084911, "phrase": "player_behavior"}, {"score": 0.002371783323468861, "phrase": "arbitrary_convex_pricing_functions"}, {"score": 0.002195552442011313, "phrase": "non-linear_functions"}, {"score": 0.0021049977753042253, "phrase": "simple_discrete_pricing_models"}], "paper_keywords": ["Network pricing", " Selfish routing", " Elastic demand", " Price of stability", " Nash equilibrium"], "paper_abstract": "We consider a model of next-hop routing by self-interested agents. In this model, nodes in a graph (representing ISPs, Autonomous Systems, etc.) make pricing decisions of how much to charge for forwarding traffic from each of their upstream neighbors, and routing decisions of which downstream neighbors to forward traffic to (i.e., choosing the next hop). Traffic originates at a subset of these nodes that derive a utility when the traffic is routed to its destination node; the traffic demand is elastic and the utility derived from it can be different for different source nodes. Our next-hop routing and pricing model is in sharp contrast with the more common source routing and pricing models, in which the source of traffic determines the entire route from source to destination. For our model, we begin by showing sufficient conditions for prices to result in a Nash equilibrium, and in fact give an efficient algorithm to compute a Nash equilibrium which is as good as the centralized optimum, thus proving that the price of stability is 1. When only a single source node exists, then the price of anarchy is 1 as well, as long as some minor assumptions on player behavior is made. The above results hold for arbitrary convex pricing functions, but with the assumption that the utilities derived from getting traffic to its destination are linear. When utilities can be non-linear functions, we show that Nash equilibrium may not exist, even with simple discrete pricing models.", "paper_title": "Strategic Pricing in Next-Hop Routing with Elastic Demands", "paper_id": "WOS:000332831400004"}