{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "attribute_reduction"}, {"score": 0.04156226931091792, "phrase": "discernibility_matrix"}, {"score": 0.0045547927862194856, "phrase": "strongest_and_most_characteristic_result"}, {"score": 0.004104132253183181, "phrase": "rough_set"}, {"score": 0.0038286491141253584, "phrase": "theoretical_foundation"}, {"score": 0.00342568771304873, "phrase": "discernibility_function"}, {"score": 0.0033549790559972053, "phrase": "decision_table"}, {"score": 0.0030650070965891653, "phrase": "first_relative_discernibility_relation"}, {"score": 0.0029193609786176632, "phrase": "indispensable_and_dispensable_condition_attributes"}, {"score": 0.0028000270988465486, "phrase": "key_sample_pair"}, {"score": 0.0025937408242280757, "phrase": "key_sample_pair_sets"}, {"score": 0.0021049977753042253, "phrase": "sample_pair_selection"}], "paper_keywords": ["Rough set", " attribute reduction", " sample pair selection", " sample pair core"], "paper_abstract": "Attribute reduction is the strongest and most characteristic result in rough set theory to distinguish itself to other theories. In the framework of rough set, an approach of discernibility matrix and function is the theoretical foundation of finding reducts. In this paper, sample pair selection with rough set is proposed in order to compress the discernibility function of a decision table so that only minimal elements in the discernibility matrix are employed to find reducts. First relative discernibility relation of condition attribute is defined, indispensable and dispensable condition attributes are characterized by their relative discernibility relations and key sample pair set is defined for every condition attribute. With the key sample pair sets, all the sample pair selections can be found. Algorithms of computing one sample pair selection and finding reducts are also developed; comparisons with other methods of finding reducts are performed with several experiments which imply sample pair selection is effective as preprocessing step to find reducts.", "paper_title": "Sample Pair Selection for Attribute Reduction with Rough Set", "paper_id": "WOS:000308997600012"}