{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "knowledge_sharing"}, {"score": 0.00456020621016909, "phrase": "expertise_profiles"}, {"score": 0.0045108906244892165, "phrase": "company_employees"}, {"score": 0.004090274535243564, "phrase": "high_dimensional_vectors"}, {"score": 0.003980531478122155, "phrase": "expertise_domain"}, {"score": 0.003728966994353039, "phrase": "structured_view"}, {"score": 0.003668591097652231, "phrase": "employee's_expertise"}, {"score": 0.00349324530379071, "phrase": "layered_view"}, {"score": 0.003219368413618912, "phrase": "industrial_setting"}, {"score": 0.00295078850927459, "phrase": "existing_methods"}, {"score": 0.002631892325004253, "phrase": "specific_topic"}, {"score": 0.00217496508306238, "phrase": "realistic_dataset"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["knowledge management", " user profiling", " text mining", " tacit knowledge", " communities of practice"], "paper_abstract": "This paper describes an algorithm to automatically construct expertise profiles for company employees, based on documents authored and read by them. A profile consists of a series of high dimensional vectors, each describing an expertise domain, and provides a hierarchy between these vectors, enabling a structured view on an employee's expertise. The algorithm is novel in providing this layered view, as well as in its high degree of automation and its generic approach ensuring applicability in an industrial setting. The profiles provide support for several knowledge management functionalities that are difficult or impossible to achieve using existing methods. This paper in particular presents the initialization of communities of practice, bringing together both experts and novices on a specific topic. An algorithm to automatically discover relationships between employees based on their profiles is described. These relationships can be used to initiate communities of practice. The algorithms are validated by means of a realistic dataset. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Multiple-vector user profiles in support of knowledge sharing", "paper_id": "WOS:000258170300002"}