{"auto_keywords": [{"score": 0.047677709717395385, "phrase": "interdisciplinary_research"}, {"score": 0.007152368807539886, "phrase": "medical_informatics"}, {"score": 0.004344424495876066, "phrase": "informatics_and_medicine"}, {"score": 0.004234129588974058, "phrase": "k._a._kuhn_et_al"}, {"score": 0.0041418132064539185, "phrase": "methods_of_information"}, {"score": 0.004021835438784141, "phrase": "successfully_established_interdisciplinary_research"}, {"score": 0.0038909934410379775, "phrase": "interdisciplinary_field"}, {"score": 0.0037921662574137535, "phrase": "successful_interdisciplinary_research"}, {"score": 0.003536346954940087, "phrase": "complex_problem"}, {"score": 0.0033837135367113004, "phrase": "multiple_disciplines"}, {"score": 0.003297728079517964, "phrase": "personal_interactions"}, {"score": 0.0032021226849872054, "phrase": "extra_time"}, {"score": 0.003086492169113408, "phrase": "new_methodologies"}, {"score": 0.0029100802280971065, "phrase": "expressive_skills"}, {"score": 0.002888747754856871, "phrase": "effective_scientific_and_institutional_leadership"}, {"score": 0.0028153046221865386, "phrase": "interdisciplinary_groups"}, {"score": 0.002673957615079041, "phrase": "interdisciplinary_education"}, {"score": 0.00226583335721762, "phrase": "good_communication"}, {"score": 0.0022492129111567824, "phrase": "clear_goals"}, {"score": 0.002175913488493802, "phrase": "basic_monodisciplinary_research"}, {"score": 0.0021049977753042253, "phrase": "scientific_knowledge"}], "paper_keywords": ["medical informatics", " biomedical informatics", " interdisciplinarity"], "paper_abstract": "Objective: To discuss the elements of interdisciplinary research and to analyze its contribution to (bio)medical informatics. Method: Commenting on 'Informatics and Medicine From Molecules to Populations' from K. A. Kuhn et al. in this issue of Methods of Information in Medicine. Referring to examples of successfully established interdisciplinary research. Results and Conclusions: Medical informatics is an interdisciplinary field avant la lettre. Experience with successful interdisciplinary research already exists for many decades: Interdisciplinary research is not a category of research but a consequence of addressing a complex problem in society, involving the collaboration between and methods drawn from multiple disciplines. Because research is people, personal interactions are critical for interdisciplinary research. Collaboration takes extra time to develop, to build consensus and to understand new methodologies, languages, and each other's culture. Interdisciplinary research requires leaders with vision and expressive skills. Effective scientific and institutional leadership is critical to the success of interdisciplinary groups. Interdisciplinarity begins in the classroom. Interdisciplinary research cannot be effective without interdisciplinary education. Researchers and teachers should immerse themselves in the culture of other disciplines, learning to explain their work in terms understood by people outside their own discipline. Teams that perform interdisciplinary research should promote collaboration, meet regularly, and recognize that it requires a commitment toward good communication and clear goals. Although much progress is achieved by interdisciplinary research, basic monodisciplinary research is still required to advance the frontiers of scientific knowledge, such as in physics or biology.", "paper_title": "Medical informatics is interdisciplinary avant la lettre", "paper_id": "WOS:000258751400004"}