{"auto_keywords": [{"score": 0.044021069003900376, "phrase": "source_location_problem"}, {"score": 0.014976430915232056, "phrase": "source_location_problems"}, {"score": 0.011471632251014947, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "flow_requirements"}, {"score": 0.004157058883925715, "phrase": "edge-connectivity_requirement_a"}, {"score": 0.0029677378488677983, "phrase": "integral_capacity"}, {"score": 0.002791239714439304, "phrase": "extended_source_location_problems"}, {"score": 0.00257735013358606, "phrase": "pseudo-polynomial_time"}, {"score": 0.002453934333239467, "phrase": "vertex-connectivity_requirements"}, {"score": 0.0023079225317714815, "phrase": "polynomial_time"}, {"score": 0.002183938718432764, "phrase": "arc-connectivity_requirement"}], "paper_keywords": ["connectivity", " location problem", " combinatorial optimization", " and approximation algorithm"], "paper_abstract": "In this paper, we consider source location problems and their generalizations with three connectivity requirements A, K and R. We show that the source location problem with edge-connectivity requirement A in undirected networks is strongly NP-hard, and that no source location problems with three connectivity requirements in undirected/directed networks are approximable within a ratio of O(ln D), unless NP has an O(N(log) (log N))-time deterministic algorithm. Here D denotes the sum of given demands. We also devise (1 + ln D)-approximation algorithms for all the extended source location problems if we have the integral capacity and demand functions. Furthermore, we study the extended source location problems when a given graph is a tree. Our algorithms for all the extended source location problems run in pseudo-polynomial time and the ones for the source location problem with vertex-connectivity requirements kappa, and (kappa) over tilde run in polynomial time, where pseudo-polynomiality for the source location problem with the arc-connectivity requirement lambda is best possible unless P=NP, since it is known to be weakly NP-hard, even if a given graph is a tree.", "paper_title": "Minimum cost source location problems with flow requirements", "paper_id": "WOS:000236886100070"}