{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "blogger-centric_contextual_advertising"}, {"score": 0.03759935662216038, "phrase": "personal_interests"}, {"score": 0.004776297980616768, "phrase": "web_advertising"}, {"score": 0.0040978781692373005, "phrase": "personal_ads"}, {"score": 0.0040485975929323, "phrase": "blog_page"}, {"score": 0.003951800212882157, "phrase": "bloggers'_interests"}, {"score": 0.003810909603178837, "phrase": "personal_opinions"}, {"score": 0.003390092184270794, "phrase": "contextual_advertising"}, {"score": 0.0032559935867182035, "phrase": "constant_visitors"}, {"score": 0.0031780859997873803, "phrase": "potential_consumers"}, {"score": 0.0029553380263320195, "phrase": "text_mining_techniques"}, {"score": 0.0029197572138773237, "phrase": "bloggers'_immediate_personal_interests"}, {"score": 0.002861402531078998, "phrase": "online_contextual_advertising"}, {"score": 0.0027370835853738626, "phrase": "text_mining"}, {"score": 0.0023762535034673017, "phrase": "real_ads"}, {"score": 0.002357131515622894, "phrase": "actual_blog_pages"}, {"score": 0.002182958452794581, "phrase": "blogger's_personal_interests"}, {"score": 0.002165388556451298, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Online advertising", " Text mining", " Machine learning", " Marketing", " Information retrieval", " Language model"], "paper_abstract": "Web advertising (online advertising), a form of advertising that uses the World Wide Web to attract customers, has become one of the most commonly-used marketing channels. This paper addresses the concept of Blogger-Centric Contextual Advertising, which refers to the assignment of personal ads to any blog page, chosen in according to bloggers' interests. As blogs become a platform for expressing personal opinions, they naturally contain various kinds of statements, including facts, comments and statements about personal interests, of both a positive and negative nature. To extend the concept behind the Long Tail theory in contextual advertising, we argue that web bloggers, as the constant visitors of their own blog-sites, could be potential consumers who will respond to ads on their own blogs. Hence, in this paper, we propose using text mining techniques to discover bloggers' immediate personal interests in order to improve online contextual advertising. The proposed Blogger-Centric Contextual Advertising (BCCA) framework aims to combine contextual advertising matching with text mining in order to select ads that are related to personal interests as revealed in a blog and rank them according to their relevance. We validate our approach experimentally using a set of data that includes both real ads and actual blog pages. The results indicate that our proposed method could effectively identify those ads that are positively-correlated with a blogger's personal interests. Crown Copyright (C) 2010 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Blogger-Centric Contextual Advertising", "paper_id": "WOS:000284863200055"}