{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "patch_descriptor_performance"}, {"score": 0.004456980650437417, "phrase": "different_types"}, {"score": 0.004397487039229447, "phrase": "video_frame"}, {"score": 0.004280861452668641, "phrase": "distinctive_visual_landmarks"}, {"score": 0.003767599364361092, "phrase": "different_corridors"}, {"score": 0.0032494292163722065, "phrase": "different_techniques"}, {"score": 0.003216804708106142, "phrase": "visual_structure"}, {"score": 0.0031208772639433145, "phrase": "user's_position"}, {"score": 0.0030688220103201836, "phrase": "single-frame_descriptors"}, {"score": 0.002888488567436329, "phrase": "single-frame_indexing"}, {"score": 0.0028402984404136754, "phrase": "particular_dataset"}, {"score": 0.0026554236621262515, "phrase": "individual_steps"}, {"score": 0.0025761937402886954, "phrase": "appearance-based_information"}, {"score": 0.002541741549046619, "phrase": "additional_source"}, {"score": 0.002524688179363081, "phrase": "navigational_data_indoors"}, {"score": 0.0024493494346360415, "phrase": "radio_signal_strength_indicators"}, {"score": 0.0023603078194781965, "phrase": "low-resolution_video_feeds"}, {"score": 0.0022440691950725614, "phrase": "complementary_approach"}, {"score": 0.002206606452557159, "phrase": "simultaneous_localization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Visual localization", " Descriptors", " Human-computer interaction", " Assistive devices"], "paper_abstract": "Vision is one of the most important of the senses, and humans use it extensively during navigation. We evaluated different types of image and video frame descriptors that could be used to determine distinctive visual landmarks for localizing a person based on what is seen by a camera that they carry. To do this, we created a database containing over 3 km of video-sequences with ground-truth in the form of distance travelled along different corridors. Using this database, the accuracy of localization-both in terms of knowing which route a user is on-and in terms of position along a certain route, can be evaluated. For each type of descriptor, we also tested different techniques to encode visual structure and to search between journeys to estimate a user's position. The techniques include single-frame descriptors, those using sequences of frames, and both color and achromatic descriptors. We found that single-frame indexing worked better within this particular dataset. This might be because the motion of the person holding the camera makes the video too dependent on individual steps and motions of one particular journey. Our results suggest that appearance-based information could be an additional source of navigational data indoors, augmenting that provided by, say, radio signal strength indicators (RSSIs). Such visual information could be collected by crowdsourcing low-resolution video feeds, allowing journeys made by different users to be associated with each other, and location to be inferred without requiring explicit mapping. This offers a complementary approach to methods based on simultaneous localization and mapping (SLAM) algorithms. (C) 2015 The Authors. Published by Elsevier B.V.", "paper_title": "Appearance-based indoor localization: A comparison of patch descriptor performance", "paper_id": "WOS:000362271100013"}