{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "thermal_stability"}, {"score": 0.049558064870310475, "phrase": "nitroaromatic_compounds"}, {"score": 0.015386582271620543, "phrase": "dft"}, {"score": 0.004245476558619167, "phrase": "decomposition_enthalpies"}, {"score": 0.003997343989408636, "phrase": "extended_series"}, {"score": 0.003299977511820374, "phrase": "reliable_models"}, {"score": 0.0031240075437664314, "phrase": "similar_correlations"}, {"score": 0.0030899524399043863, "phrase": "calculated_and_experimental_data"}, {"score": 0.0024011766029754006, "phrase": "conceptual_dft_descriptors"}, {"score": 0.0021049977753042253, "phrase": "specific_class"}], "paper_keywords": ["Density functional theory (DFT)", " Nitroaromatic compounds", " Semi-empirical calculations", " Quantitative structure-property relationship (QSPR)", " Thermal stability"], "paper_abstract": "The quantitative structure-property relationship (QSPR) methodology was applied to predict the decomposition enthalpies of 22 nitroaromatic compounds, used as indicators of thermal stability. An extended series of descriptors (constitutional, topological, geometrical charge related and quantum chemical) was calculated at two different levels of theory: density functional theory (DFT) and semi-empirical AM1 approaches. Reliable models have been developed for each level, leading to similar correlations between calculated and experimental data (R(2)>0.98). Hence, both of them can be employed as screening tools for the prediction of thermal stability of nitroaromatic compounds. If using the AM1 model presents the advantage to be less time consuming, DFT allows the calculation of more accurate molecular quantum properties, e.g., conceptual DFT descriptors. In this study, our best QSPR model is based on such descriptors, providing more chemical comprehensive relationships with decomposition reactivity, a particularly complex property for the specific class of nitroaromatic compounds.", "paper_title": "QSPR modeling of thermal stability of nitroaromatic compounds: DFT vs. AM1 calculated descriptors", "paper_id": "WOS:000275122000018"}