{"auto_keywords": [{"score": 0.048193365666829385, "phrase": "hydrogen_bonds"}, {"score": 0.00481495049065317, "phrase": "sidechain_hydrogen-bonds"}, {"score": 0.004268293864953256, "phrase": "hydrogen_bonding_potential"}, {"score": 0.004219571240696568, "phrase": "amino_acids"}, {"score": 0.004053362743156545, "phrase": "unsatisfied_hydrogen-bond-capable_residues"}, {"score": 0.003916098498242888, "phrase": "mutant_proteins"}, {"score": 0.0037188360359702182, "phrase": "hydrogen_bonding"}, {"score": 0.0035518193979811367, "phrase": "hydrogen_bond"}, {"score": 0.003296212583539166, "phrase": "rapid_method"}, {"score": 0.0030414140732789186, "phrase": "novel_knowledge-based_approach"}, {"score": 0.0026342827320931937, "phrase": "high_resolution_crystal_structures"}, {"score": 0.002321234686549485, "phrase": "tumour-suppressor_protein"}, {"score": 0.0022041312401435346, "phrase": "distinct_mutations"}, {"score": 0.0021539955106204354, "phrase": "sidechain-sidechain_hydrogen_bonding"}], "paper_keywords": [""], "paper_abstract": "Motivation: Hydrogen bonds are one of the most important inter-atomic interactions in biology. Previous experimental, theoretical and bioinformatics analyses have shown that the hydrogen bonding potential of amino acids is generally satisfied and that buried unsatisfied hydrogen-bond-capable residues are destabilizing. When studying mutant proteins, or introducing mutations to residues involved in hydrogen bonding, one needs to know whether a hydrogen bond can be maintained. Our aim, therefore, was to develop a rapid method to evaluate whether a sidechain can form a hydrogen-bond. Results: A novel knowledge-based approach was developed in which the conformations accessible to the residues involved are taken into account. Residues involved in hydrogen bonds in a set of high resolution crystal structures were analyzed and this analysis is then applied to a given protein. The program was applied to assess mutations in the tumour-suppressor protein, p53. This raised the number of distinct mutations identified as disrupting sidechain-sidechain hydrogen bonding from 181 in our previous analysis to 202 in this analysis.", "paper_title": "Analysing the ability to retain sidechain hydrogen-bonds in mutant proteins", "paper_id": "WOS:000238768500010"}