{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "control_software"}, {"score": 0.004549242970806199, "phrase": "software-based_control_systems"}, {"score": 0.004164644263639545, "phrase": "microcontroller_device"}, {"score": 0.004009894739765119, "phrase": "formal_model-based_design_approaches"}, {"score": 0.0038853212888610234, "phrase": "embedded_systems_control_software"}, {"score": 0.003467940281748612, "phrase": "formal_model"}, {"score": 0.0033814348757887232, "phrase": "discrete-time_linear_hybrid_system"}, {"score": 0.0024654516678953658, "phrase": "ad_bits"}, {"score": 0.0022709326810964386, "phrase": "experimental_results"}, {"score": 0.0021453112313233554, "phrase": "buck_dc-dc_converter"}, {"score": 0.0021049977753042253, "phrase": "widely_used_mixed-mode_analog_circuit"}], "paper_keywords": ["Verification", " Hybrid systems", " correct-by-construction control software synthesis", " model-based design of control software"], "paper_abstract": "Many embedded systems are indeed software-based control systems, that is, control systems whose controller consists of control software running on a microcontroller device. This motivates investigation on formal model-based design approaches for automatic synthesis of embedded systems control software. We present an algorithm, along with a tool QKS implementing it, that from a formal model (as a discrete-time linear hybrid system) of the controlled system (plant), implementation specifications (that is, number of bits in the Analog-to-Digital, AD, conversion) and system-level formal specifications (that is, safety and liveness requirements for the closed loop system) returns correct-by-construction control software that has a Worst-Case Execution Time (WCET) linear in the number of AD bits and meets the given specifications. We show feasibility of our approach by presenting experimental results on using it to synthesize control software for a buck DC-DC converter, a widely used mixed-mode analog circuit, and for the inverted pendulum.", "paper_title": "Model-Based Synthesis of Control Software from System-Level Formal Specifications", "paper_id": "WOS:000331615400006"}