{"auto_keywords": [{"score": 0.03654516494859162, "phrase": "high_probability"}, {"score": 0.02242919840450765, "phrase": "fault-free_part"}, {"score": 0.0099570156394281, "phrase": "random_dependent_way"}, {"score": 0.007713056792830868, "phrase": "low_diameter"}, {"score": 0.00481495049065317, "phrase": "random_dependent_faults"}, {"score": 0.004613516457919661, "phrase": "n-node_networks"}, {"score": 0.004452078350485375, "phrase": "fault_dependencies"}, {"score": 0.004373480870285314, "phrase": "neighborhood_fault_model"}, {"score": 0.004326987090971404, "phrase": "damaging_events"}, {"score": 0.004175533280178052, "phrase": "probability_p"}, {"score": 0.003752126270661821, "phrase": "spot_probability"}, {"score": 0.0033475472608077823, "phrase": "constant_spot_probabilities"}, {"score": 0.0031731685183735508, "phrase": "smaller_spot_probabilities"}, {"score": 0.003072918736387408, "phrase": "bounded_degree_networks"}, {"score": 0.002454258761940649, "phrase": "constant_a"}, {"score": 0.0022608057001451414, "phrase": "first_analytic_paper"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["Fault-tolerance", " dependent faults", " connectivity", " diameter", " crash faults"], "paper_abstract": "We study the connectivity and diameter of the fault-free part of n-node networks where nodes fail in a random dependent way. To capture fault dependencies, we introduce the neighborhood fault model, where damaging events, called spots, occur randomly and independently with probability p at nodes of a network, causing faults in the given node and its neighbors; faults at distance at most 2 become dependent. We investigate the impact of the spot probability on the connectivity and diameter of the fault-free part of the network. We show a network which has a low diameter with high probability, if p <= 1/c log n. We also show that, for constant spot probabilities, most classes of networks do not have their fault-free part connected with high probability. For smaller spot probabilities, connectivity with high probability is supported even by bounded degree networks: the torus supports connectivity with high probability when p is an element of 1/omega (n(1/2)), and does not when p is an element of 1/0(n(1/2)); a network built of tori is designed, with the same fault-tolerance properties and additionally having low diameter. We show, however, that for networks of degree bounded above by a constant A, the fault-free part can not be connected with high probability if p is an element of 1/0(n(1/Delta)). This is the first analytic paper which investigates the connectivity and diameter of networks where nodes fail in a random dependent way. (C) 2009 Wiley Periodicals, Inc. NETWORKS, Vol. 56(2)9103-115 2010", "paper_title": "The Diameter and Connectivity of Networks with Random Dependent Faults", "paper_id": "WOS:000280902900003"}