{"auto_keywords": [{"score": 0.03738416398077957, "phrase": "webcam_condition"}, {"score": 0.021512040467911477, "phrase": "sex_differences"}, {"score": 0.010612387000973441, "phrase": "computer-mediated_affective_language"}, {"score": 0.00954218890326824, "phrase": "affective_communication"}, {"score": 0.004489952932659799, "phrase": "extant_empirical_evidence"}, {"score": 0.003920128102807887, "phrase": "young_adults"}, {"score": 0.0036703791815812328, "phrase": "same-sex_dyads"}, {"score": 0.003244050414264445, "phrase": "traditional_linguistic_and_conversational_style_measures"}, {"score": 0.003177958355586418, "phrase": "separate_significant_sex_x_webcam_condition_interactions"}, {"score": 0.0030247625535682987, "phrase": "computer-mediated_emotion"}, {"score": 0.002938821840519756, "phrase": "significantly_less_active_words"}, {"score": 0.0027176309244222, "phrase": "significantly_more_emoticons"}, {"score": 0.0023430556582539805, "phrase": "computer-mediated_affective_communication"}, {"score": 0.002285839246740627, "phrase": "undergraduate_sample"}], "paper_keywords": ["sex differences", " computer-mediated communication", " anonymity", " emotion"], "paper_abstract": "Although women have been stereotyped as more emotionally expressive than men, the extant empirical evidence on sex differences in the expression and use of affective communication is equivocal. The authors examined the influence of sex and context on the expression and use of computer-mediated affective language in a sample of young adults. A total of 56 undergraduates (28 males, 28 females) were paired in same-sex dyads and randomly assigned to either a webcam or no webcam condition. The participants engaged in a 10-min free chat online conversation in the laboratory. Transcripts were objectively coded for the use of affective communication and traditional linguistic and conversational style measures. The analyses revealed separate significant Sex x Webcam Condition interactions on the affective quality of language used and the expression of computer-mediated emotion. Men in the webcam condition used significantly less active words than men in the no webcam condition and less than women in the webcam condition. Women in the webcam condition used significantly more emoticons than women in the no webcam condition or men in either condition. Men and women did not differ in their use of emoticons in the no webcam condition. Results suggest that sex differences in the use and expression of computer-mediated affective communication are context specific in an undergraduate sample. Findings are discussed in terms of their larger implications for understanding sex differences in the expression and use of emotion in face-to-face (FTF) social interactions.", "paper_title": "Sex Differences in the Expression and Use of Computer-Mediated Affective Language Does Context Matter?", "paper_id": "WOS:000277089200004"}