{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "breast_cancer"}, {"score": 0.004775918707955445, "phrase": "neural_classifiers"}, {"score": 0.004737201825299411, "phrase": "first_warning_thermal_sensors"}, {"score": 0.0044025116437190785, "phrase": "nearby_tissues"}, {"score": 0.004192571571622019, "phrase": "leading_causes"}, {"score": 0.004091370602573054, "phrase": "cancer_development"}, {"score": 0.003912112659326054, "phrase": "breast_surface"}, {"score": 0.0037866774001097596, "phrase": "screening_modality"}, {"score": 0.003725470458263889, "phrase": "young_women"}, {"score": 0.003695237613399466, "phrase": "dense_breasts"}, {"score": 0.00332375606483146, "phrase": "discrete_thermal_data"}, {"score": 0.0032434583977423996, "phrase": "potential_tool"}, {"score": 0.0032040376301815544, "phrase": "early_detection"}, {"score": 0.0029895074299598275, "phrase": "breast_conditions"}, {"score": 0.0028121429464519733, "phrase": "neural_network_classifiers"}, {"score": 0.00266693888510356, "phrase": "temperature_data"}, {"score": 0.0021571717917276724, "phrase": "large_data_sets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["breast cancer", " neural network", " sensor", " classification", " temperature", " accuracy"], "paper_abstract": "Breast cancer occurs when cells in the breast begin to grow out of control and invade nearby tissues or spread throughout the body. It is one of the leading causes of death in women. Cancer development appears to generate an increase in the temperature on the breast surface. The limitations of mammography as a screening modality, especially in young women with dense breasts, necessitated the development of novel and more effective screening strategies with high sensitivity and specificity. The aim of this study was to evaluate the feasibility of discrete thermal data (DTD) as a potential tool for the early detection of the breast cancer. Our protocol uses 1170, 16-sensor data collected from 54 individuals consisting of three different kinds of breast conditions: namely, normal, benign and cancerous breast. We compared two different kinds of neural network classifiers: the feedforward neural network and the radial basis function classifier. Temperature data from the 16 temperature sensors on the surface of the two breasts (eight sensors on each side) are fed as input to the classifiers. We demonstrated a sensitivity of 84% and 91% for these classifiers (feedforward and radial basis function, respectively) with a specificity of 100%. Our classifying systems are ready to run on large data sets. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Detection and differentiation of breast cancer using neural classifiers with first warning thermal sensors", "paper_id": "WOS:000249068300018"}