{"auto_keywords": [{"score": 0.04522176534199055, "phrase": "society"}, {"score": 0.00481495049065317, "phrase": "society's_scholarly_contribution"}, {"score": 0.004585332915477379, "phrase": "society_for_modeling_and_simulation_international"}, {"score": 0.0031703706626348507, "phrase": "geographical_diversity"}, {"score": 0.003128336741911927, "phrase": "authors'_affiliations"}, {"score": 0.002952516738708181, "phrase": "overall_evolution"}, {"score": 0.0025605773834404253, "phrase": "predomination_application"}], "paper_keywords": ["profiling research", " simulation research", " simulation practice", " author productivity", " SCS", " SIMULATION: Transactions of the Society for Modeling and Simulation International"], "paper_abstract": "The Society for Modeling and Simulation International (SCS) is celebrating its 60th anniversary this year. Since its inception, the Society has widely disseminated the advancements in the field of modeling and simulation (M & S) through its peer-reviewed journals. In this paper we profile research that has been published in the journal SIMULATION: Transactions of the Society for Modeling and Simulation International from the turn of the millennium to 2010; the objective is to acknowledge the contribution of the authors and their seminal research papers, their respective universities/departments and the geographical diversity of the authors' affiliations. Yet another objective is to contribute towards the understanding of the overall evolution of the discipline of M & S; this is achieved through the classification of M & S techniques and its frequency of use, analysis of the sectors that have seen the predomination application of M & S and the context of its application. It is expected that this paper will lead to further appreciation of the contribution of the Society in influencing the growth of M & S as a discipline and, indeed, in steering its future direction.", "paper_title": "SCS: 60 years and counting! A time to reflect on the Society's scholarly contribution to M&S from the turn of the millennium", "paper_id": "WOS:000309142800004"}