{"auto_keywords": [{"score": 0.033073494988142736, "phrase": "recurrent_disease"}, {"score": 0.023051113253628765, "phrase": "neck_cancer"}, {"score": 0.01812357490433978, "phrase": "gold_standard_dataset"}, {"score": 0.008783715067784914, "phrase": "routine_datasets"}, {"score": 0.006546672431590319, "phrase": "automated_technique"}, {"score": 0.00481495049065317, "phrase": "disease_recurrence"}, {"score": 0.00475924837336259, "phrase": "routine_healthcare_data"}, {"score": 0.004695128668158797, "phrase": "os"}, {"score": 0.004604884367001791, "phrase": "key_outcome_measures"}, {"score": 0.004533977015480565, "phrase": "treatment_efficacy"}, {"score": 0.004464156619275582, "phrase": "health_services"}, {"score": 0.00443830093588711, "phrase": "uk"}, {"score": 0.004378384522635356, "phrase": "national_cancer_audits"}, {"score": 0.0042610532651691305, "phrase": "interval_data"}, {"score": 0.004244549215700218, "phrase": "patient_status"}, {"score": 0.004219912413995784, "phrase": "labour-intensive_method"}, {"score": 0.004130789575450601, "phrase": "hospital_admissions"}, {"score": 0.003889583851551197, "phrase": "neck_cancer_patients"}, {"score": 0.003874512990986722, "phrase": "routinely_acquired_data"}, {"score": 0.0037853015963603682, "phrase": "extracted_treatment_histories"}, {"score": 0.003770633265791941, "phrase": "hospital_notes"}, {"score": 0.0037125240439927114, "phrase": "routinely_collected_local_data"}, {"score": 0.0035850198321277418, "phrase": "computer_algorithm"}, {"score": 0.0035641974600358803, "phrase": "relevant_time_points"}, {"score": 0.0035229142507310213, "phrase": "pfs."}, {"score": 0.003408512155673965, "phrase": "correct_identification"}, {"score": 0.0033429545815200825, "phrase": "recurrence_events"}, {"score": 0.003190707487694852, "phrase": "pfs"}, {"score": 0.0030990692120386114, "phrase": "estimated_os"}, {"score": 0.0029809647917225786, "phrase": "good_agreement"}, {"score": 0.0029009722548088306, "phrase": "gold_standard"}, {"score": 0.0028897208272138973, "phrase": "routine_intervals"}, {"score": 0.002435453488008121, "phrase": "survival_information"}, {"score": 0.0023885663694117334, "phrase": "recurrence_rates"}, {"score": 0.0022708315711029423, "phrase": "national_level"}, {"score": 0.002253239756584183, "phrase": "new_approach"}, {"score": 0.0022271066624030785, "phrase": "larger_scale"}, {"score": 0.0021799789348982516, "phrase": "healthcare_provision"}, {"score": 0.0021505080212057743, "phrase": "different_disease_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Head and neck cancer", " Disease recurrence", " Routine datasets"], "paper_abstract": "Background: Overall survival (OS) and progression free survival (PFS) are key outcome measures for head and neck cancer as they reflect treatment efficacy, and have implications for patients and health services. The UK has recently developed a series of national cancer audits which aim to estimate survival and recurrence by relying on institutions manually submitting interval data on patient status, a labour-intensive method. However, nationally, data are routinely collected on hospital admissions, surgery, radiotherapy and chemotherapy. We have developed a technique to automate the interpretation of these routine datasets, allowing us to derive patterns of treatment in head and neck cancer patients from routinely acquired data. Methods: We identified 122 patients with head and neck cancer and extracted treatment histories from hospital notes to provide a gold standard dataset. We obtained routinely collected local data on inpatient admission and procedures, chemotherapy and radiotherapy for these patients and analysed them with a computer algorithm which identified relevant time points and then calculated OS and PFS. We validated these by comparison with the gold standard dataset. The algorithm was then optimised to maximise correct identification of each timepoint, and minimise false identification of recurrence events. Results: Of the 122 patients, 82% had locally advanced disease. OS was 88% at 1 year and 77% at 2 years and PFS was 75% and 66% at 1 and 2 years. 40 patients developed recurrent disease. Our automated method provided an estimated OS of 87% and 77% and PFS of 87% and 78% at 1 and 2 years; 98% and 82% of patients showed good agreement between the automated technique and Gold standard dataset of OS and PFS respectively (ratio of Gold standard to routine intervals of between 0.8 and 1.2). The automated technique correctly assigned recurrence in 101 out of 122 (83%) of the patients: 21 of the 40 patients with recurrent disease were correctly identified, 19 were too unwell to receive further treatment and were missed. Of the 82 patients who did not develop a recurrence, 77 were correctly identified and 2 were incorrectly identified as having recurrent disease when they did not. Conclusions: We have demonstrated that our algorithm can be used to automate the interpretation of routine datasets to extract survival information for this sample of patients. It currently underestimates recurrence rates due to many patients not being well-enough to be treated for recurrent disease. With some further optimisation, this technique could be extended to a national level, providing a new approach to measuring outcomes on a larger scale than is currently possible. This could have implications for healthcare provision and policy for a range of different disease types. (C) 2014 The Authors. Published by Elsevier Ireland Ltd.", "paper_title": "Automated estimation of disease recurrence in head and neck cancer using routine healthcare data", "paper_id": "WOS:000344937800002"}