{"auto_keywords": [{"score": 0.04748801430076137, "phrase": "computational_linguistics"}, {"score": 0.00481495049065317, "phrase": "similarity_search"}, {"score": 0.004744123493964429, "phrase": "fundamental_problems"}, {"score": 0.004622662375029505, "phrase": "data_integration"}, {"score": 0.004588531238691602, "phrase": "data_quality"}, {"score": 0.00388356203453764, "phrase": "different_data_sets"}, {"score": 0.0038263829059336564, "phrase": "subtle_variations"}, {"score": 0.003784049616066444, "phrase": "core_problems"}, {"score": 0.0037283301619292636, "phrase": "sheer_number"}, {"score": 0.00370077772049505, "phrase": "proposed_methods"}, {"score": 0.0036193316508938795, "phrase": "single_research_group"}, {"score": 0.003448940584469061, "phrase": "probably_largest_benchmark"}, {"score": 0.003323330859027428, "phrase": "resource_bottleneck"}, {"score": 0.0032261342460565457, "phrase": "international_competition"}, {"score": 0.003120171161064748, "phrase": "different_fields"}, {"score": 0.0028969560940141233, "phrase": "external_group"}, {"score": 0.00265987582861194, "phrase": "data_sets"}, {"score": 0.0026401983633087267, "phrase": "increasing_sizes"}, {"score": 0.0026109540617641593, "phrase": "different_characteristics"}, {"score": 0.0025251455169484557, "phrase": "wall_clock_time"}, {"score": 0.0024603551979225195, "phrase": "memory_usage"}, {"score": 0.002344398099179438, "phrase": "cpu_cores"}, {"score": 0.00222561197623787, "phrase": "particularly_interesting_observation"}], "paper_keywords": ["String search", " String join", " Scalability", " Comparison"], "paper_abstract": "String similarity search and its variants are fundamental problems with many applications in areas such as data integration, data quality, computational linguistics, or bioinformatics. A plethora of methods have been developed over the last decades. Obtaining an overview of the state-of-the-art in this field is difficult, as results are published in various domains without much cross-talk, papers use different data sets and often study subtle variations of the core problems, and the sheer number of proposed methods exceeds the capacity of a single research group. In this paper, we report on the results of the probably largest benchmark ever performed in this field. To overcome the resource bottleneck, we organized the benchmark as an international competition, a workshop at EDBT/ICDT 2013. Various teams from different fields and from all over the world developed or tuned programs for two crisply defined problems. All algorithms were evaluated by an external group on two machines. Altogether, we compared 14 different programs on two string matching problems (k-approximate search and k-approximate join) using data sets of increasing sizes and with different characteristics from two different domains. We compare programs primarily by wall clock time, but also provide results on memory usage, indexing time, batch query effects and scalability in terms of CPU cores. Results were averaged over several runs and confirmed on a second, different hardware platform. A particularly interesting observation is that disciplines can and should learn more from each other, with the three best teams rooting in computational linguistics, databases, and bioinformatics, respectively.", "paper_title": "State-of-the-art in String Similarity Search and Join", "paper_id": "WOS:000337057600008"}