{"auto_keywords": [{"score": 0.035755077006663374, "phrase": "atp_hydrolysis"}, {"score": 0.03528694083102479, "phrase": "atp_synthesis"}, {"score": 0.016785784234625508, "phrase": "backward_stepping"}, {"score": 0.010612387000973441, "phrase": "kinesin_processivity"}, {"score": 0.0068096385741591315, "phrase": "high_loads"}, {"score": 0.0045137173841642035, "phrase": "multiple_steps"}, {"score": 0.004048194450210347, "phrase": "detailed_study"}, {"score": 0.0037562016088622447, "phrase": "cellular_interactions"}, {"score": 0.0036928221419965253, "phrase": "probabilistic_timed_automaton"}, {"score": 0.003593623872399777, "phrase": "mechanical_processivity"}, {"score": 0.003532977898022071, "phrase": "theoretical_analysis"}, {"score": 0.003157510936118389, "phrase": "atp_concentration"}, {"score": 0.0030207674474548403, "phrase": "increasing_load"}, {"score": 0.002764741440770032, "phrase": "higher_frequency"}, {"score": 0.0025738397248551217, "phrase": "rising_load"}, {"score": 0.002339601774631419, "phrase": "synthesis_kinetic_cycles"}, {"score": 0.002200377880796801, "phrase": "backward_stepping_cycle"}, {"score": 0.0021049977753042253, "phrase": "forward_stepping_cycle"}], "paper_keywords": [""], "paper_abstract": "Motivation: Cellular interactions of kinesin-1, an adenosine triphosphate (ATP)-driven motor protein capable of undergoing multiple steps on a microtubule (MT), affect its mechanical processivity, the number of steps taken per encounter with MT. Even though the processivity of kinesin has been widely studied, a detailed study of the factors that affect the stepping of the motor along MT is still lacking. Results: We model the cellular interactions of kinesin as a probabilistic timed automaton and use the model to simulate the mechanical processivity of the motor. Theoretical analysis suggests: (i) backward stepping tends to be powered by ATP hydrolysis, rather than ATP synthesis, (ii) backward stepping powered by ATP synthesis is more likely to happen with limiting ATP concentration ([ATP]) at high loads and (iii) with increasing load the frequency of backward stepping powered by ATP hydrolysis at high [ATP] is greater than that powered by ATP synthesis at limiting [ATP]. Together, the higher frequency of backward stepping powered by ATP hydrolysis than by ATP synthesis is found to be a reason for the more dramatic falling of kinesin processivity with rising load at high [ATP] compared with that at low [ATP]. Simulation results further show that the processivity of kinesin can be determined by the number of ATP hydrolysis and synthesis kinetic cycles taken by the motor before becoming inactive. It is also found that the duration of a backward stepping cycle at high loads is more likely to be less than that of a forward stepping cycle.", "paper_title": "A stochastic automaton model for simulating kinesin processivity", "paper_id": "WOS:000350058800013"}