{"auto_keywords": [{"score": 0.04289725068536245, "phrase": "ptt"}, {"score": 0.017130003715785026, "phrase": "propofol_injection"}, {"score": 0.010515438232669158, "phrase": "drug_kinetics"}, {"score": 0.010419367858164594, "phrase": "vascular_changes"}, {"score": 0.0096814352938612, "phrase": "pulse_wave"}, {"score": 0.0080554320014001, "phrase": "general_anaesthesia"}, {"score": 0.006548087350158072, "phrase": "student's_t-test"}, {"score": 0.00481495049065317, "phrase": "pulse_transit_time"}, {"score": 0.004040123129261597, "phrase": "propofol's_effects"}, {"score": 0.00398452530840582, "phrase": "vascular_system"}, {"score": 0.003683565150278339, "phrase": "gynaecological_surgery"}, {"score": 0.0034528025626422154, "phrase": "ptt_measurements"}, {"score": 0.0027528751037412128, "phrase": "ptt_value"}, {"score": 0.0022355167967736326, "phrase": "vascular_dilation"}, {"score": 0.0021049977753042253, "phrase": "useful_guide"}], "paper_keywords": ["pulse transit time", " drug kinetics", " propofol", " vascular", " vasodilatation"], "paper_abstract": "Pulse transit time (PTT) is the duration in which a pulse wave travels between two arterial sites within the same cardiac cycle. The aim of our study is to use PTT to examine propofol's effects on the vascular system. Methods. We collected data from 50 healthy women, between 28 and 51 years old, who underwent gynaecological surgery under general anaesthesia. The general anaesthesia was induced with propofol injection (2 mg/kg). PTT measurements were obtained from the R-wave of electrocardiogram and the pulse wave of photoplethysmograph. Two PTT values were obtained; one before (the control) and the other after propofol injection. The results were analysed by Student's t-test. Results. After propofol injection, the PTT was prolonged. The change in the PTT value from that of baseline was significant statistically (P < 0.05, by Student's t-test). The PTT change over time correlated with the degree of vasodilatation over time. Monitoring of PTT not only revealed the magnitude of vascular changes but also demonstrated the onset of vascular dilation, its peak and duration. We conclude that PTT is a useful guide in monitoring the drug kinetics of propofol.", "paper_title": "Pulse transit time reveals drug kinetics on vascular changes affected by propofol", "paper_id": "WOS:000306745900006"}