{"auto_keywords": [{"score": 0.050072695418663875, "phrase": "electronic_resources"}, {"score": 0.04936608363599975, "phrase": "wuhan"}, {"score": 0.0490219456339607, "phrase": "china"}, {"score": 0.046799318215593744, "phrase": "users'_information_behaviour"}, {"score": 0.00477924690801092, "phrase": "seven_universities"}, {"score": 0.003865376734263166, "phrase": "central_china"}, {"score": 0.0036826458132500155, "phrase": "nsti"}, {"score": 0.003392804886610623, "phrase": "users'_education_level"}, {"score": 0.0030679850425428053, "phrase": "graduate_students"}, {"score": 0.003045195833294976, "phrase": "young_staff_members"}, {"score": 0.002977835845437357, "phrase": "male_users"}, {"score": 0.00295571428544335, "phrase": "female_ones"}, {"score": 0.002815864555488112, "phrase": "scientific_research"}, {"score": 0.0025366596616434767, "phrase": "users'_knowledge_service_types"}, {"score": 0.002443784721651744, "phrase": "citation_retrieval"}, {"score": 0.0024075916292945715, "phrase": "statistical_analysis"}, {"score": 0.002389696110283506, "phrase": "intelligent_retrieval"}, {"score": 0.0023719332915829268, "phrase": "knowledge_aggregation"}, {"score": 0.00229361668293267, "phrase": "electronic_resource_producers"}, {"score": 0.0021049977753042253, "phrase": "nstl"}], "paper_keywords": ["Electronic media", " Consumer behaviour", " User studies", " Academic libraries", " China"], "paper_abstract": "Purpose - The pm-pose of this paper is to report on users' information behaviour in China, a topic which has not been researched extensively. The aim is to help producers and providers collect and develop more electronic resources. Design/methodology/approach - The study investigates users' information behaviour at seven \"211 Project\" universities in Wuhan, a city in central China. These universities all have access to the resources of the National Science and Technology Library (NSTI,). The questionnaire includes questions about respondents' basic identifying information (educational level, job, etc.) and their information service requirements. Correlations among users' education level, users' jobs, users' retrieval methods, literature use, etc. were analysed. Findings - The results show that most NSTL users are graduate students and young staff members. and the number of male users surpasses female ones slightly. The purpose of the utilisation of electronic resources for customers is scientific research, teaching and the need for self-development. During a year, the demand of users is the highest in March and the lowest in August. The users' knowledge service types include learning the progress of science and technology, citation retrieval and analysis, statistical analysis, intelligent retrieval and knowledge aggregation. Practical implications - The findings suggest that electronic resource producers should offer more foreign literature and providers should improve the quality of services. Originality/value - The paper provides suggestions for the further improvement of NSTL to fulfill the information needs and requirements of users.", "paper_title": "A survey of the use of electronic resources at seven universities in Wuhan, China", "paper_id": "WOS:000288592300004"}