{"auto_keywords": [{"score": 0.04209445471630582, "phrase": "proposed_algorithm"}, {"score": 0.034842847240480694, "phrase": "external_archive"}, {"score": 0.015495960237696385, "phrase": "domination-based_sorting"}, {"score": 0.00481495049065317, "phrase": "combinatorial_optimization"}, {"score": 0.0045108906244892165, "phrase": "multiobjective_evolutionary_optimization"}, {"score": 0.004318881178805575, "phrase": "hybrid_multiobjective_evolutionary_algorithm"}, {"score": 0.004165105357908494, "phrase": "combinatorial_optimization_problems"}, {"score": 0.0036553070575015344, "phrase": "decomposition-based_strategy"}, {"score": 0.0027341763737751467, "phrase": "decomposition_strategy"}, {"score": 0.0024519545383399773, "phrase": "domination-based_approach"}], "paper_keywords": ["Combinatorial multiobjective optimization", " decomposition", " Pareto optimality"], "paper_abstract": "Domination-based sorting and decomposition are two basic strategies used in multiobjective evolutionary optimization. This paper proposes a hybrid multiobjective evolutionary algorithm integrating these two different strategies for combinatorial optimization problems with two or three objectives. The proposed algorithm works with an internal (working) population and an external archive. It uses a decomposition-based strategy for evolving its working population and uses a domination-based sorting for maintaining the external archive. Information extracted from the external archive is used to decide which search regions should be searched at each generation. In such a way, the domination-based sorting and the decomposition strategy can complement each other. In our experimental studies, the proposed algorithm is compared with a domination-based approach, a decomposition-based one, and one of its enhanced variants on two well-known multiobjective combinatorial optimization problems. Experimental results show that our proposed algorithm outperforms other approaches. The effects of the external archive in the proposed algorithm are also investigated and discussed.", "paper_title": "An External Archive Guided Multiobjective Evolutionary Algorithm Based on Decomposition for Combinatorial Optimization", "paper_id": "WOS:000358883500004"}