{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "ambient_media"}, {"score": 0.004128192012388041, "phrase": "new_media_form"}, {"score": 0.003899385109646589, "phrase": "media_environments"}, {"score": 0.0037682108720193956, "phrase": "natural_space"}, {"score": 0.0036001255166809793, "phrase": "digital_media_environments"}, {"score": 0.0034988876789164235, "phrase": "living_space"}, {"score": 0.002414290278501595, "phrase": "potential_future_development"}, {"score": 0.002373276186210053, "phrase": "digital_objects"}, {"score": 0.0023329572140896237, "phrase": "daily_living_space"}, {"score": 0.0022287497627555895, "phrase": "future_wheel_approach"}, {"score": 0.0021049977753042253, "phrase": "expert_workshop"}], "paper_keywords": ["Ambient media", " Ubiquitous computation", " Pervasive computation", " Human-computer-interaction", " Ambient assisted living", " IPTV", " Shape shifting media", " User experience", " Smart environments", " Smart cities", " Smart urban environments"], "paper_abstract": "Ambient media are novel, and this new media form alters our daily-living experience in many ways. Ambient media refer to media environments that are embedded throughout the natural space where people are following their daily activities. These digital media environments become part of the living space and altering our daily-living experience in many ways. The goal of this article is to elaborate the status of ambient media today and to forecast how ambient media will develop in the next decade. It clearly identifies megatrends and develops scenarios (e. g., ambient-assisted living) for the future. These scenarios shall shed light on the potentials and give a glimpse on the potential future development of embedding digital objects into the daily living space. This paper is based on a future wheel approach and on an analysis of the results of an expert workshop. The article concludes with a discussion of the results and an evaluation of the impact of each scenario.", "paper_title": "Ambient media today and tomorrow What have ambient media in common? What are ambient media today? Where will ambient media be in 2020?", "paper_id": "WOS:000338120700002"}