{"auto_keywords": [{"score": 0.04432077024897855, "phrase": "tsfs_data"}, {"score": 0.04119907429533016, "phrase": "parafac_analysis"}, {"score": 0.03761983319379271, "phrase": "eemf_layout"}, {"score": 0.010484970741791345, "phrase": "total_synchronous_fluorescence_spectroscopy"}, {"score": 0.010265624248058153, "phrase": "excitation-emission_matrix_fluorescence"}, {"score": 0.0057395957870745124, "phrase": "experimentally_acquired_information"}, {"score": 0.005568032802964724, "phrase": "computational_time"}, {"score": 0.00481495311281524, "phrase": "parafac"}, {"score": 0.004490020801780961, "phrase": "recently_developed_procedure"}, {"score": 0.004462819565604272, "phrase": "parallel_factor"}, {"score": 0.004000322474812552, "phrase": "data_sets"}, {"score": 0.0038336409728616035, "phrase": "significantly_large_number"}, {"score": 0.0037301606780397456, "phrase": "experimentally_acquired_fluorescence_information"}, {"score": 0.0034570880757509082, "phrase": "tsfs"}, {"score": 0.003425687882884989, "phrase": "eemf"}, {"score": 0.003107935254560724, "phrase": "zero_and_nan_values"}, {"score": 0.0028541057064952876, "phrase": "actual_and_retrieved_tsfs_profile"}, {"score": 0.0027685531038981847, "phrase": "parafac_algorithm"}, {"score": 0.0027433895507237584, "phrase": "obtained_results"}, {"score": 0.002726740692380339, "phrase": "parafac_analyses"}, {"score": 0.002669259222649505, "phrase": "better_analytical_results"}, {"score": 0.0023063614119692476, "phrase": "present_work"}, {"score": 0.0022440136394950632, "phrase": "zero_and_missing_values"}, {"score": 0.0021700901058417602, "phrase": "separated_tsfs_profile"}, {"score": 0.0021438155673297377, "phrase": "reasonable_purity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["PARAFAC", " TSFS", " EEMF", " Missing values", " Trilinear", " Core-consistency"], "paper_abstract": "In a recently developed procedure for parallel factor (PARAFAC) analysis of total synchronous fluorescence spectroscopy (TSFS), the issue of no-trilinearity of TSFS data set was addressed by representing the TSFS data in excitation-emission matrix fluorescence (EEMF) layout which ensures the trilinearity to data sets \"a must\" for PARAFAC analysis. This representation leads to generation of significantly large number of variables, which do not contain any experimentally acquired fluorescence information. It is essential that such variables be handled properly before subjecting TSFS data in EEMF layout to PARAFAC analysis. Based on our understanding of mechanism by which PARAFAC analysis on TSFS data in EEMF layout works, we used three possible ways: (i) assigning a value of zero, (ii) assigning missing (NaN) values, and (iii) combination of zero and NaN values to handle such variables. We evaluated each of these three possibilities and compared the outcomes of PARAFAC analysis with respect to two important parameters: (i) proximity between the actual and retrieved TSFS profile of all the three fluorophores and (ii) time taken for the convergence of PARAFAC algorithm. The obtained results of PARAFAC analyses on TSFS data in EEMF layout showed that better analytical results are obtained if we set all the variables with no experimentally acquired information to missing (NaN) values, though the computational time is significantly high. PARAFAC analysis tends to converge prematurely when a value of zero was assigned to all the variables in EEMF layout that do not contain any experimentally acquired information. The present work also showed that by using the combination of zero and missing values it is possible to optimize the computational time and retrieve PARAFAC separated TSFS profile from EEMF layout with reasonable purity. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Parallel factor (PARAFAC) analysis on total synchronous fluorescence spectroscopy (TSFS) data sets in excitation-emission matrix fluorescence (EEMF) layout: Certain practical aspects", "paper_id": "WOS:000362382600013"}