{"auto_keywords": [{"score": 0.04846322395795738, "phrase": "road_network"}, {"score": 0.013425152725720584, "phrase": "line_segments"}, {"score": 0.008713768692145006, "phrase": "road_networks"}, {"score": 0.0046983433525535365, "phrase": "mobile_intruder"}, {"score": 0.004375839387349825, "phrase": "stationary_guards"}, {"score": 0.004228133164066264, "phrase": "single_ray"}, {"score": 0.0037125668193275585, "phrase": "finite_time_interval"}, {"score": 0.003587168660793558, "phrase": "arbitrary_speed"}, {"score": 0.0034659912999351794, "phrase": "time_interval"}, {"score": 0.0034405602197336667, "phrase": "previously_illuminated_sections"}, {"score": 0.0032436937860730445, "phrase": "number_g"}, {"score": 0.003188418800032088, "phrase": "possible_locations"}, {"score": 0.0031034490909341243, "phrase": "complete_coverage"}, {"score": 0.0030430743286215672, "phrase": "worst-case_number"}, {"score": 0.0029692499675546017, "phrase": "guard_positions"}, {"score": 0.0026781944023444777, "phrase": "n_lines"}, {"score": 0.002403757058012995, "phrase": "guard_position"}, {"score": 0.0022660808716577717, "phrase": "axis-aligned_lines"}, {"score": 0.0022165055403539293, "phrase": "upper_bounds"}, {"score": 0.002184058009202751, "phrase": "search_schedule"}, {"score": 0.002146801124249881, "phrase": "claimed_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["The searchlight problem", " Graph searching", " Lines", " Line segments", " Grids"], "paper_abstract": "We consider the problem of searching for a mobile intruder hiding in a road network given as the union of two or more lines, or two or more line segments, in the plane. Some of the intersections of the road network are occupied by stationary guards equipped with a number of searchlights, each of which can emit a single ray of light in any, direction along the lines (or line segments) it is on. The goal is to detect the intruder, that is, to illuminate its location. Guards may alter the direction in which they aim a searchlight, but need to switch it off for some finite time interval to effect the change. In contrast, the intruder may move with arbitrary speed along the network (but cannot pass guards) and exploit this time interval to recontaminate previously illuminated sections of the network. For various classes of road networks characterized by the number n of lines (or line segments) comprising it and the number g (<= n-1) of possible locations of guards (fixed in advance and guaranteed to give complete coverage), we present several upper and lower bounds on the worst-case number of searchlights, each placed at one of the guard positions, required to successfully search a given road network. In particular, we prove the following results: 1. min{2g - 1, n - 2} searchlights are sometimes necessary and min{7/3g, n} - 1 are always sufficient for searching a road network given as the union of n lines; 2. Omega(g . log n/g) searchlights are sometimes necessary and O(g(2) . log n) searchlights are always sufficient for searching a road network given as the union of n line segments, and 3. at most one searchlight per guard position, and hence a total of at most g searchlights, is always sufficient for searching a road network given as the union of axis-aligned lines or line segments. The proofs of the upper bounds induce algorithms for generating a search schedule for detecting the intruder using the claimed number of searchlights. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "The searchlight problem for road networks", "paper_id": "WOS:000358627600005"}