{"auto_keywords": [{"score": 0.02734026317158217, "phrase": "focus_shifts"}, {"score": 0.004814974089936643, "phrase": "avatar"}, {"score": 0.004649409525552571, "phrase": "digital"}, {"score": 0.004488946121663966, "phrase": "empirical_research"}, {"score": 0.004444203710097833, "phrase": "virtual_reality_users'_avatar_embodiment"}, {"score": 0.004081385289516914, "phrase": "avatars'_failures"}, {"score": 0.00327356326590461, "phrase": "focus_shift"}, {"score": 0.0032085525502105836, "phrase": "different_types"}, {"score": 0.003097865379563127, "phrase": "multiple_elements"}, {"score": 0.0030060256866508606, "phrase": "thirty_participants"}, {"score": 0.0029169007179202164, "phrase": "videogame-like_virtual_environment"}, {"score": 0.0024105326885334962, "phrase": "significantly_high_number"}, {"score": 0.002327310963701377, "phrase": "defective_virtual_environment"}, {"score": 0.002224510044064184, "phrase": "mediation_theory"}, {"score": 0.0021049977753042253, "phrase": "avatar_embodiment"}], "paper_keywords": ["Embodiment", " Avatar", " Focus Shift", " Virtual Reality", " action", " agency"], "paper_abstract": "This paper provides an empirical research about virtual reality users' avatar embodiment. According to literature, users that are embodied/incarnated in their avatars show a tendency to perceive avatars' failures as their own mistakes. Therefore, they are likely to monitor their own hands on the device they're using (e.g.: keyboard) when they perceive a failure in the interaction (a behavior named \"focus shift\"). We hypothesize that the phenomenon of focus shift is sensitive to different types of failures that can affect the multiple elements involved in the interaction. Thirty participants guided an avatar through a videogame-like virtual environment. The participants were exposed to three experimental manipulations (defective keyboard, defective avatar, defective virtual environment). We counted the number of focus shifts that participants showed in response to these three manipulated anomalies. Results showed a significantly high number of focus shifts in the condition with defective virtual environment. The findings are discussed with reference to mediation theory, explaining the role of action/feedback matching in the phenomenon of avatar embodiment.", "paper_title": "Being in an Avatar: Action and Embodiment in a Digital Me", "paper_id": "WOS:000375005900020"}