{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "client-consultant_relationships"}, {"score": 0.003882970272082245, "phrase": "configurable_technologies"}, {"score": 0.0038392331564122387, "phrase": "empirical_evidence"}, {"score": 0.0025965853546625352, "phrase": "possession_and_practice_views"}, {"score": 0.0025239898026543964, "phrase": "configurable_technology_projects"}, {"score": 0.0023848164282879885, "phrase": "initial_set-up"}, {"score": 0.0022405528759521856, "phrase": "implementation_trajectories"}, {"score": 0.002129020447793464, "phrase": "project_results"}, {"score": 0.0021049977753042253, "phrase": "journal_of_information_technology"}], "paper_keywords": ["client-consultant relationship", " configurable technologies", " power/knowledge interplay", " knowing/powering mechanisms", " practice view", " global-local negotiations"], "paper_abstract": "In this paper, we investigate the dynamics of client-consultant relationships and analyze how power and knowledge are shared and negotiated between consultants and clients during the implementation of configurable technologies. Empirical evidence is provided by three case studies representing three classic types of client-consultant relationships. We draw on two complementary perspectives: possession view (i.e., power and knowledge are based on resources that can be owned or controlled by individuals) and practice view (i.e., power and knowledge are relational in nature and exercised in action). The paper develops a framework that shows that power and knowledge are closely intertwined and that the possession and practice views are complementary in understanding configurable technology projects. The paper also demonstrates the importance of the initial set-up of the project and how knowing/powering mechanisms can reinforce or change implementation trajectories, which, in turn, can affect project results. Journal of Information Technology (2012) 27, 35-56. doi: 10.1057/jit.2011.32 Published online 10 January 2012", "paper_title": "The dynamics of client-consultant relationships: exploring the interplay of power and knowledge", "paper_id": "WOS:000300416300003"}