{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "maximum_link_scheduling"}, {"score": 0.04960770684597511, "phrase": "sinr-based_interference_model"}, {"score": 0.004628101576367193, "phrase": "wireless_networks"}, {"score": 0.004339744430169516, "phrase": "key_issue"}, {"score": 0.0041567954854120695, "phrase": "signal"}, {"score": 0.0040491842732233154, "phrase": "noise_ratio"}, {"score": 0.0038919354605673104, "phrase": "graph-based_interference_models"}, {"score": 0.0037967593942595233, "phrase": "mls_problem"}, {"score": 0.00368710577308398, "phrase": "np"}, {"score": 0.0036133077234252633, "phrase": "sinr_interference_models"}, {"score": 0.0034217123057117796, "phrase": "mls"}, {"score": 0.0029784342137867776, "phrase": "novel_scheduling_method"}, {"score": 0.0029344771385297137, "phrase": "constant_approximation_ratio"}, {"score": 0.002724207384182295, "phrase": "constant_phi"}, {"score": 0.002670719148310961, "phrase": "better_mls_set"}, {"score": 0.0021259846592569386, "phrase": "time_complexity"}], "paper_keywords": [""], "paper_abstract": "A fundamental problem in wireless networks is the maximum link scheduling (MLS) problem. In this problem, interference is a key issue and past researchers have shown that determining reception using Signal-to-Interference plus Noise Ratio (SINR) is more realistic than graph-based interference models. Unfortunately, the MLS problem has been proven to be NP-hard for SINR interference models. To date, several approximation algorithms have been proposed to solve MLS under the SINR-based interference model. However, most of these works do not have either an approximation bound or a distributed version. To this end, we present a novel scheduling method with a constant approximation ratio which is much simpler and only 1/28 of it in past research. The improvement of constant phi also offers a better MLS set. In addition, based on our centralized method, we present a polynomial time, randomized, distributed algorithm, which only requires estimates of the number of links, and maximum and minimum link lengths. We prove its correctness and show that it can compute a MLS with time complexity of O(log(2) n), where n is an estimate of the number of links.", "paper_title": "Approximation Algorithms for Maximum Link Scheduling under SINR-Based Interference Model", "paper_id": "WOS:000359211300001"}