{"auto_keywords": [{"score": 0.05007843022623741, "phrase": "social_network_decision_making"}, {"score": 0.04439445244220926, "phrase": "iowa"}, {"score": 0.004762550320451225, "phrase": "linguistic_trustworthiness-based_induced_owa_operators"}, {"score": 0.00471071771178029, "phrase": "classic_aggregation_operators"}, {"score": 0.00465944657565638, "phrase": "group_decision"}, {"score": 0.004176321608449849, "phrase": "c-iowa"}, {"score": 0.003868142906199082, "phrase": "successful_tools"}, {"score": 0.003264010423431402, "phrase": "group_decision-making_problem"}, {"score": 0.0030064251340251196, "phrase": "previous_history"}, {"score": 0.0026357877401570764, "phrase": "decision-making_problems"}, {"score": 0.002273025527678093, "phrase": "linguistic_trustworthiness_information"}, {"score": 0.002223696715077018, "phrase": "experts'_social_network"}, {"score": 0.002175436093794315, "phrase": "social_group_preferences"}, {"score": 0.0021049977753042253, "phrase": "simple_but_illustrative_examples"}], "paper_keywords": [""], "paper_abstract": "Classic aggregation operators in group decision making such as the ordered weighted averaging (OWA), induced ordered weighted averaging (IOWA), C-IOWA, P-IOWA, and I-IOWA have shown to be successful tools to provide flexibility in the aggregation of preferences. However, these operators do not take advantage of information related to the interaction between experts. Experts involved in a group decision-making problem may have developed opinions about the reliability of other experts' judgments, either because they have previous history of interaction with each other or because they have knowledge that informs them on the reliability of other colleagues in the group in solving decision-making problems in the past. In this paper, and within the framework of social network decision making, we present three new social network analysis based IOWA operators that take advantage of the linguistic trustworthiness information gathered from the experts' social network to aggregate the social group preferences. Their use is analysed with simple but illustrative examples.", "paper_title": "Social Network Decision Making with Linguistic Trustworthiness-Based Induced OWA Operators", "paper_id": "WOS:000344449600004"}