{"auto_keywords": [{"score": 0.05007835923150684, "phrase": "real_time_pricing"}, {"score": 0.03840402806596224, "phrase": "rtp"}, {"score": 0.013540467606038827, "phrase": "rolling_horizon_procedure"}, {"score": 0.004774802526129115, "phrase": "primary_input"}, {"score": 0.004617515080028721, "phrase": "air_separation_plant"}, {"score": 0.00428222231579898, "phrase": "solution_approach"}, {"score": 0.004258372598568333, "phrase": "operating_decisions"}, {"score": 0.004187614134377688, "phrase": "mixed_integer_program"}, {"score": 0.004106541104485704, "phrase": "simulation_study"}, {"score": 0.0040157986370637465, "phrase": "unreliable_and_finite_information"}, {"score": 0.003776424440919605, "phrase": "robust_plans"}, {"score": 0.0037449033166879874, "phrase": "additional_simulation_study"}, {"score": 0.0036214184763804034, "phrase": "vis-a-vis_other_selected_electricity_pricing_schemes"}, {"score": 0.0034727526607880883, "phrase": "substantial_flexibility"}, {"score": 0.0034437574674180365, "phrase": "operating_environment"}, {"score": 0.0031227931314333534, "phrase": "increased_loads"}, {"score": 0.0031053806836154655, "phrase": "longer_ramp-ups"}, {"score": 0.0030282147475402736, "phrase": "operational_inflexibility"}, {"score": 0.002887634989058733, "phrase": "plant_operation_problem"}, {"score": 0.002839588181179663, "phrase": "industrial_gas_industry"}, {"score": 0.002823750388759926, "phrase": "production_facilities"}, {"score": 0.002776763584415067, "phrase": "primary_production_input"}, {"score": 0.0025675956623479363, "phrase": "optimization_based_planning_approach"}, {"score": 0.0022261705957258506, "phrase": "horizon_length"}, {"score": 0.0022013916728990564, "phrase": "electricity_prices"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["operations planning", " real time pricing", " mixed integer programming", " production planning"], "paper_abstract": "We examine the problem of planning the operation of an air separation plant where the price of its primary production input, electricity, changes hour to hour, a situation commonly referred to as real time pricing (RTP). We present a solution approach where operating decisions are obtained from optimizing a mixed integer program embedded in a rolling horizon procedure. A simulation study is conducted to assess the effect of unreliable and finite information on the efficiency of the operations plans generated by the procedure. Results of the study suggest that the rolling horizon procedure generates robust plans. An additional simulation study is conducted to identify the conditions under which RTP is attractive vis-a-vis other selected electricity pricing schemes. Results of the study indicate that RTP is most appealing when there is substantial flexibility in the operating environment in terms of the load placed on the plant (customer demand) and with regard to ramp-up (akin to set-up) times. Although this appeal diminishes with increased loads and longer ramp-ups, it is nevertheless the case that the operational inflexibility must be significant before RTP loses its allure. Scope and purpose: This paper considers the plant operation problem faced by firms in the industrial gas industry with production facilities where the price of the primary production input, that is electricity, changes hour to hour, which is often referred to as real time pricing. The purpose of this work is to present an optimization based planning approach that rigorously takes into account the realities of this environment. In addition this work seeks to identify, through the use of simulation, the conditions under which real time pricing is most appealing vis-a-vis other electricity pricing schemes, and also the degree to which planning horizon length and uncertainty in electricity prices impact the efficiency of the operations plans generated by our planning approach. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Operations planning with real time pricing of a primary input", "paper_id": "WOS:000241737500014"}