{"auto_keywords": [{"score": 0.028448572782996114, "phrase": "pls"}, {"score": 0.017780182671544485, "phrase": "tam"}, {"score": 0.005350729857314888, "phrase": "idt"}, {"score": 0.00481495049065317, "phrase": "online_shopping_adoption"}, {"score": 0.004375789703278455, "phrase": "electronic_commerce"}, {"score": 0.0043258453436258405, "phrase": "shoppers'_perspective"}, {"score": 0.0037259623657693794, "phrase": "non-shoppers'_segment"}, {"score": 0.0036553070575015344, "phrase": "business-to-consumer_electronic_commerce"}, {"score": 0.003545024951402821, "phrase": "theoretical_foundations"}, {"score": 0.0032585499655442404, "phrase": "specific_factor"}, {"score": 0.0031121406603482112, "phrase": "e-commerce_channel"}, {"score": 0.002700738055025905, "phrase": "partial_least_squares"}, {"score": 0.0026091594819333654, "phrase": "analysis_results"}, {"score": 0.0021049977753042253, "phrase": "final_section"}], "paper_keywords": ["electronic commerce", " B2C", " acceptance models", " TAM", " consumer behaviour", " perceived compatibility", " product offering", " non-shoppers"], "paper_abstract": "Acceptance of online shopping adoption by individuals has been a concerning issue for researchers in the past decade. However, most research has focused in evaluating the attitudes and intention to use electronic commerce from the shoppers' perspective, neglecting to analyze the behavior and attitudes of those who have not adopted e-commerce yet: the non-shoppers. The objective of this study is to explore and evaluate the behavior and attitudes of the non-shoppers' segment towards the acceptance of business-to-consumer electronic commerce (B2C-EC). The theoretical foundations of the study are provided by the Technology Acceptance Model (TAM) and the Innovations Diffusion Theory (IDT), with the addition of a specific factor related to the nature of B2C-EC: product offering of the e-commerce channel. This framework leads to an attitudinal/behavioral model which seeks to identify the factors perceived by non-shoppers as the most important for the adoption of B2C-EC. The model has been validated with data from 995 Spanish non-shoppers using the partial least squares (PLS) technique. Findings from the analysis results show that perceived usefulness, perceived compatibility and product offering affect positively the attitude of non-shoppers towards the adoption of B2C-EC and their intention to use it. Among these factors, perceived compatibility stands out as the most relevant factor to foster the adoption of B2C-EC among non-shoppers. Other implications for theory and practice are discussed in the final section.", "paper_title": "Exploring the Attitudes and Intentions of Non-shoppers in the Acceptance of e-Commerce", "paper_id": "WOS:000298048200007"}