{"auto_keywords": [{"score": 0.03149278777849825, "phrase": "diamond_model"}, {"score": 0.007383873799475829, "phrase": "asymmetric_constraints"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_run-length-constrained_channels"}, {"score": 0.004527024978801684, "phrase": "possible_exception"}, {"score": 0.004416713079266374, "phrase": "last_runs"}, {"score": 0.004204054047427536, "phrase": "binary_two-dimensional_array"}, {"score": 0.0036855132234738736, "phrase": "two-dimensional_data"}, {"score": 0.003352658916650986, "phrase": "different_directions"}, {"score": 0.0030123335878664064, "phrase": "two-dimensional_array"}, {"score": 0.002202617924488607, "phrase": "symmetric_constraints"}, {"score": 0.0021049977753042253, "phrase": "almost_complete_solution"}], "paper_keywords": ["asymmetric constraints", " capacity", " constrained codes", " diamond model", " hexagonal model", " permutation arrays", " square model", " tiling", " triangular model", " two-dimensional coding"], "paper_abstract": "A binary sequence satisfies a one-dimensional (d, k) constraint if every run of zeros (with possible exception of the first and the last runs) has length at least d and at most k. A binary two-dimensional array satisfies a (d, k) constraint if each row and each column satisfies the one-dimensional (d, k) constraint. Few models have been proposed in the literature to handle two-dimensional data: the diamond model, the square model, the hexagonal model, and the triangular model. The constraints in the different directions might be asymmetric and hence many kind of constraints are defined depending on the number of directions in the model. For example, a two-dimensional array in the diamond model satisfies a (d(1), k(1), d(2), k(2)) constraint if it satisfies the one-dimensional (d(1)1, k(1)) constraint horizontally and the one-dimensional (d(2), k(2)) constraint vertically. In this correspondence, the region in which the capacity is zero or positive, in the various models, is examined. Asymmetric constraints in the diamond model and symmetric constraints in the other models are considered. In particular, an almost complete solution for asymmetric constraints in the diamond model is provided.", "paper_title": "The positive capacity region of two-dimensional run-length-constrained channels", "paper_id": "WOS:000241805700029"}