{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hash_functions"}, {"score": 0.015069985381690323, "phrase": "hash_function"}, {"score": 0.009867702200662727, "phrase": "output_length"}, {"score": 0.00475924837336259, "phrase": "robust_combiner"}, {"score": 0.004219912413995784, "phrase": "single_property"}, {"score": 0.003965865989513521, "phrase": "tls"}, {"score": 0.0037125240439927114, "phrase": "robust_multi-property_combiners"}, {"score": 0.0036553070575015344, "phrase": "different_definitions"}, {"score": 0.0033952989364738353, "phrase": "secure_message_authentication_code"}, {"score": 0.0033170847930578473, "phrase": "strongest_notion"}, {"score": 0.0032155857567170696, "phrase": "combined_function"}, {"score": 0.003178326919668771, "phrase": "security_property"}, {"score": 0.0030810605918297584, "phrase": "underlying_hash_function"}, {"score": 0.003033546013625887, "phrase": "underlying_hash_functions"}, {"score": 0.002828611294209297, "phrase": "black-box_combiners"}, {"score": 0.0026272523687965615, "phrase": "hash_values"}, {"score": 0.0024592402228499105, "phrase": "random_oracle"}, {"score": 0.0022141537427057363, "phrase": "one-wayness_property"}, {"score": 0.0021049977753042253, "phrase": "input_length"}], "paper_keywords": ["Combiner", " Hash function", " Indifferentiability"], "paper_abstract": "A robust combiner for hash functions takes two candidate implementations and constructs a hash function which is secure as long as at least one of the candidates is secure. So far, hash function combiners only aim at preserving a single property such as collision-resistance or pseudorandomness. However, when hash functions are used in protocols like TLS they are often required to provide several properties simultaneously. We therefore put forward the notion of robust multi-property combiners and elaborate on different definitions for such combiners. We then propose a combiner that provably preserves (target) collision-resistance, pseudorandomness, and being a secure message authentication code. This combiner satisfies the strongest notion we propose, which requires that the combined function satisfies every security property which is satisfied by at least one of the underlying hash function. If the underlying hash functions have output length n, the combiner has output length 2n. This basically matches a known lower bound for black-box combiners for collision-resistance only, thus the other properties can be achieved without penalizing the length of the hash values. We then propose a combiner which also preserves the property of being indifferentiable from a random oracle, slightly increasing the output length to 2n+omega(logn). Moreover, we show how to augment our constructions in order to make them also robust for the one-wayness property, but in this case require an a priory upper bound on the input length.", "paper_title": "Robust Multi-Property Combiners for Hash Functions", "paper_id": "WOS:000336370500001"}