{"auto_keywords": [{"score": 0.04785918158121603, "phrase": "base_station"}, {"score": 0.046343996829934425, "phrase": "high_quality_video"}, {"score": 0.037304954519676234, "phrase": "passive_receivers"}, {"score": 0.03631918697181318, "phrase": "video_data"}, {"score": 0.028618307792589906, "phrase": "arsa"}, {"score": 0.00481495049065317, "phrase": "traditional_mobile_streaming_system"}, {"score": 0.00452876183569266, "phrase": "low_bandwidth"}, {"score": 0.00450198136261303, "phrase": "cellular_network"}, {"score": 0.004387742636311268, "phrase": "large-scale_deployment"}, {"score": 0.004361792415184563, "phrase": "mobile_multimedia_streaming_service"}, {"score": 0.004038025449634253, "phrase": "novel_network_architecture"}, {"score": 0.004006203114973972, "phrase": "pull-push_transmission_strategy"}, {"score": 0.003935513160201076, "phrase": "secondary_free_local_channels"}, {"score": 0.003904495523681369, "phrase": "mobile_devices"}, {"score": 0.003866065696848619, "phrase": "peer-to-peer_network"}, {"score": 0.0038053601712886563, "phrase": "local_network"}, {"score": 0.003664963414801933, "phrase": "cellular_channel"}, {"score": 0.003586052466121584, "phrase": "secondary_wireless_channel"}, {"score": 0.003557779256472077, "phrase": "lost_data"}, {"score": 0.003522749900725601, "phrase": "local_wireless_channel"}, {"score": 0.0030974565282107297, "phrase": "important_issue"}, {"score": 0.003085215969295327, "phrase": "seed_selection_strategy"}, {"score": 0.003066945490483524, "phrase": "network_architecture"}, {"score": 0.0029830992938695007, "phrase": "dynamic_networks"}, {"score": 0.002942037195749782, "phrase": "high_video_quality"}, {"score": 0.0028334016912935165, "phrase": "cost_sharing"}, {"score": 0.0027723454190363506, "phrase": "minimum_connected_dominating_set"}, {"score": 0.0027342044520299352, "phrase": "np-hard"}, {"score": 0.002717979064365263, "phrase": "heuristic_algorithm"}, {"score": 0.0027072340557482725, "phrase": "adaptive_role-switching_algorithm"}, {"score": 0.0025917987214878623, "phrase": "higher_priority"}, {"score": 0.0025611773887867255, "phrase": "greater_probability"}, {"score": 0.002437425029824563, "phrase": "node's_neighbors"}, {"score": 0.0021901023885734, "phrase": "windows_xp."}, {"score": 0.0021814396743238176, "phrase": "simulation_results"}, {"score": 0.002138636271204459, "phrase": "communication_cost"}, {"score": 0.0021301766910531137, "phrase": "cellular_bandwidth_requirement"}, {"score": 0.0021049977753042253, "phrase": "system_performance"}], "paper_keywords": [""], "paper_abstract": "In a traditional mobile streaming system, all users pull streams from the server. This model would cause users a high communication cost and heavy burden to the base station. At the same time, the low bandwidth of the cellular network cannot meet the requirements of high quality video, which greatly limits the large-scale deployment of the mobile multimedia streaming service. In this paper, we propose a fully distributed, scalable, and cost-effective system called Peer-to-Peer leveraged Mobile streaming based on Pull and Push (P2PMP2). Under this solution, a novel network architecture based-on pull-push transmission strategy is proposed, which makes use of the secondary free local channels already available in mobile devices today to form a peer-to-peer network. There are two roles in the local network: seed and passive receiver, as shown in Fig. 1. Seeds in P2PMP2 download video contents through the cellular channel, and share them with its nearby neighbors by broadcasting using the secondary wireless channel. Regarding the lost data, passive receivers use another local wireless channel to request from their neighbors. The way that seeds broadcast video data to passive receivers is called push. While the way that passive receivers request lost data from neighbors using another channel is called pull. This architecture aims at few users download video data from base station, and most users can get a high quality video. [image omitted]Figure 1. The network architecture of P2PMP2 In our paper, an important issue about seed selection strategy under this network architecture is addressed. It consists of two parts: Seed-selection. In dynamic networks, in order to get a high video quality, we should find out the nodes which are more suitable to be a seed. Fairness in cost sharing. This problem is equal to the problem of the minimum connected dominating set which has been proved to be NP-Hard. A heuristic algorithm called Adaptive Role-Switching Algorithm (ARSA) is presented. ARSA decides the role of a peer by its weight according to the principle of the higher priority a peer owns, the greater probability to be a seed. The weight of a peer is calculated using the following parameters: the available bandwidth, the number of a node's neighbors, capability, and mobility of a node. As to the fairness of the system, we use the strategy such as the weight of a seed decreases with the time, and the weight of a passive receiver increases with the time. Finally, we simulate P2PMP2 using Visual C++ under Windows XP. The simulation results show that the system can not only reduce the communication cost and cellular bandwidth requirement, but also improve the system performance obviously.", "paper_title": "P2PMP2: A Peer-to-Peer Leveraged Mobile Streaming System Based-on Push and Pull", "paper_id": "WOS:000265103800010"}