{"auto_keywords": [{"score": 0.0423453969367384, "phrase": "protein_structure"}, {"score": 0.009920551013982495, "phrase": "average_cross-docking_accuracy"}, {"score": 0.00771599292285814, "phrase": "docking_accuracy"}, {"score": 0.00481495049065317, "phrase": "molecular_recognition"}, {"score": 0.0046797114400479135, "phrase": "cross-docking_accuracy"}, {"score": 0.004366808573435364, "phrase": "protein_receptor"}, {"score": 0.004261419841494814, "phrase": "success_rate"}, {"score": 0.004192571571622019, "phrase": "self-docking_tests"}, {"score": 0.003755949722774176, "phrase": "different_ligand"}, {"score": 0.0036503460615862574, "phrase": "docking_program's_ability"}, {"score": 0.003605997900398767, "phrase": "x-ray_results"}, {"score": 0.0034620119220744347, "phrase": "cdocker"}, {"score": 0.003433915848825037, "phrase": "fred"}, {"score": 0.003392183107104319, "phrase": "rocs"}, {"score": 0.0033646448121751574, "phrase": "multiple_x-ray_structures"}, {"score": 0.0027441711627551064, "phrase": "docked_ligand_increases"}, {"score": 0.0023694065215394593, "phrase": "universal_predictors"}, {"score": 0.0023026973099101876, "phrase": "consistent_behavior"}], "paper_keywords": [""], "paper_abstract": "Docking methods are used to predict the manner in which a ligand binds to a protein receptor. Many studies have assessed the success rate of programs in self-docking tests, whereby a ligand is docked into the protein structure from which it was extracted. Cross-docking, or using a protein structure from a complex containing a different ligand, provides a more realistic assessment of a docking program's ability to reproduce X-ray results. In this work, cross-docking was performed with CDocker, Fred, and Rocs using multiple X-ray structures for eight proteins (two kinases, one nuclear hormone receptor, one serine protease, two metalloproteases, and two phosphodiesterases). While average cross-docking accuracy is not encouraging, it is shown that using the protein structure from the complex that contains the bound ligand most similar to the docked ligand increases docking accuracy for all methods (\"similarity selection\"). Identifying the most successful protein conformer (\"best selection\") and similarity selection substantially reduce the difference between self-docking and average cross-docking accuracy. We identify universal predictors of docking accuracy (i.e., showing consistent behavior across most protein-method combinations), and show that models for predicting docking accuracy built using these parameters can be used to select the most appropriate docking method.", "paper_title": "Lessons in molecular recognition. 2. Assessing and improving cross-docking accuracy", "paper_id": "WOS:000251216500029"}