{"auto_keywords": [{"score": 0.04941061878695797, "phrase": "external_memory"}, {"score": 0.018100843589098962, "phrase": "main_memory"}, {"score": 0.006656941090513677, "phrase": "random_accesses"}, {"score": 0.00481495049065317, "phrase": "processing_data"}, {"score": 0.004551563730037998, "phrase": "large_dataset"}, {"score": 0.0038309141193444015, "phrase": "abstract_model"}, {"score": 0.0035330290755534234, "phrase": "arbitrary_sequential_access"}, {"score": 0.003495915995048885, "phrase": "distinguishing_feature"}, {"score": 0.0033749889869455407, "phrase": "unlimited_external_memory"}, {"score": 0.0033395304916220086, "phrase": "intermediate_results"}, {"score": 0.0031344430376015033, "phrase": "lower_bounds"}, {"score": 0.002693919110230191, "phrase": "internal_memory_space"}, {"score": 0.0022507989506447413, "phrase": "randomized_algorithms"}, {"score": 0.002234988641498543, "phrase": "one-sided_bounded_error"}, {"score": 0.0021652024032375833, "phrase": "database_queries"}, {"score": 0.002142426911242168, "phrase": "similar_lower_bounds"}, {"score": 0.0021198904828154657, "phrase": "relational_algebra_queries"}, {"score": 0.0021049977753042253, "phrase": "relational_databases"}], "paper_keywords": ["Theory", " Languages", " Complexity", " data streams", " real-time data", " query processing", " query optimization", " semi-structured data", " XML"], "paper_abstract": "We consider a scenario where we want to query a large dataset that is stored in external memory and does not fit into main memory. The most constrained resources in such a situation are the size of the main memory and the number of random accesses to external memory. We note that sequentially streaming data from external memory through main memory is much less prohibitive. We propose an abstract model of this scenario in which we restrict the size of the main memory and the number of random accesses to external memory, but admit arbitrary sequential access. A distinguishing feature of our model is that it allows the usage of unlimited external memory for storing intermediate results, such as several hard disks that can be accessed in parallel. In this model, we prove lower bounds for the problem of sorting a sequence of strings (or numbers), the problem of deciding whether two given sets of strings are equal, and two closely related decision problems. Intuitively, our results say that there is no algorithm for the problems that uses internal memory space bounded by N(1-epsilon) and at most o( log N) random accesses to external memory, but unlimited \"streaming access\", both for writing to and reading from external memory. (Here, N denotes the size of the input and e is an arbitrary constant greater than 0.) We even permit randomized algorithms with one-sided bounded error. We also consider the problem of evaluating database queries and prove similar lower bounds for evaluating relational algebra queries against relational databases and XQuery and XPath queries against XML-databases.", "paper_title": "Lower Bounds for Processing Data with Few Random Accesses to External Memory", "paper_id": "WOS:000266650300002"}