{"auto_keywords": [{"score": 0.04214205053460077, "phrase": "mobile_device"}, {"score": 0.0068910518983256105, "phrase": "real_objects"}, {"score": 0.004944493649298105, "phrase": "tpo_condition"}, {"score": 0.00481495049065317, "phrase": "physical_environments"}, {"score": 0.0047051051659828275, "phrase": "split-attention_and_redundancy_effects"}, {"score": 0.00465661510300243, "phrase": "tp"}, {"score": 0.004390312150344245, "phrase": "different_combinations"}, {"score": 0.004290112502811656, "phrase": "fifth-grade_students"}, {"score": 0.0032066653632708965, "phrase": "comprehension_tests"}, {"score": 0.003177154457204778, "phrase": "learning_efficiency"}, {"score": 0.0030759821501544224, "phrase": "tp_condition"}, {"score": 0.002909960617042717, "phrase": "split-attention_effect"}, {"score": 0.0026775328564629577, "phrase": "redundancy_effect"}, {"score": 0.0021843879253500894, "phrase": "mobile_learning_environments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Applications in subject areas", " Elementary education", " Pedagogical issues"], "paper_abstract": "This study investigated split-attention and redundancy effects in a mobile learning environment on leaf morphology of plants as a function of different combinations of media. Eighty-one fifth-grade students were randomly assigned to the following three conditions: texts with pictures embedded in the mobile device (TP condition); texts embedded in the mobile device and real objects that are outside of the mobile device (TO condition); and texts with pictures embedded in the mobile device and real objects that are outside of the mobile device (TPO condition). Differences in performance on comprehension tests and learning efficiency were examined across conditions. The TP condition was expected to perform better than the TO condition due to a split-attention effect. The TP and TO conditions were expected to perform better than the TPO condition due to a redundancy effect. The results indicated no difference between the TP and the TO condition in comprehension and learning efficiency, but the TP and TO conditions performed better than the TPO condition on both measures. The implications of the results for research and design of mobile learning environments are discussed. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Split-attention and redundancy effects on mobile learning in physical environments", "paper_id": "WOS:000298524300017"}