{"auto_keywords": [{"score": 0.004630150894006861, "phrase": "efficient_broadcast_encryption_scheme"}, {"score": 0.004394688617163029, "phrase": "code_framework"}, {"score": 0.004189337956225294, "phrase": "probabilistic_construction"}, {"score": 0.003993544228876303, "phrase": "n_users"}, {"score": 0.003773870856027139, "phrase": "private_keys"}, {"score": 0.003581797255879607, "phrase": "constant_size"}, {"score": 0.0035199624440843892, "phrase": "additional_computational_assumption"}, {"score": 0.0032263862712733934, "phrase": "pirate_decoders"}, {"score": 0.0030888830649190282, "phrase": "practical_pirate_strategies"}, {"score": 0.002957222630196853, "phrase": "combinatorial_object"}, {"score": 0.0027104531025934865, "phrase": "new_requirement"}, {"score": 0.002686935113435742, "phrase": "revocation_capability"}, {"score": 0.002516917671182532, "phrase": "\"smart\"_pirates"}, {"score": 0.002462664392109308, "phrase": "tracing_technique"}, {"score": 0.002132711053003407, "phrase": "different_assumptions"}, {"score": 0.0021049977753042253, "phrase": "pirate's_strategies"}], "paper_keywords": ["Broadcast encryption", " Traitor tracing", " Disjunct matrix", " Shadow group testing"], "paper_abstract": "We address the problem of designing an efficient broadcast encryption scheme which is also capable of tracing traitors. We introduce a code framework to formalize the problem. Then, we give a probabilistic construction of a code which supports both traceability and revocation. Given N users with at most r revoked users and at most t traitors, our code construction gives rise to a Trace&Revoke system with private keys of size O((r+t)logN) (which can also be reduced to constant size based on an additional computational assumption), ciphertexts of size O((r+t)logN), and O(1) decryption time. Our scheme can deal with certain classes of pirate decoders, which we believe are sufficiently powerful to capture practical pirate strategies. In particular, our code construction is based on a combinatorial object called (r,s)-disjunct matrix, which is designed to capture both the classic traceability notion of disjunct matrix and the new requirement of revocation capability. We then probabilistically construct (r,s)-disjunct matrices which help design efficient Black-Box Trace&Revoke systems. For dealing with \"smart\" pirates, we introduce a tracing technique called \"shadow group testing\" that uses (close to) legitimate broadcast signals for tracing. Along the way, we also proved several bounds on the number of queries needed for black-box tracing under different assumptions about the pirate's strategies.", "paper_title": "Black-Box Trace&Revoke Codes", "paper_id": "WOS:000323224200008"}