{"auto_keywords": [{"score": 0.03633768465921191, "phrase": "message_manipulation_attacks"}, {"score": 0.00481495049065317, "phrase": "time_synchronization"}, {"score": 0.004706699397060569, "phrase": "fundamental_requirement"}, {"score": 0.004600870784042767, "phrase": "wide_spectrum"}, {"score": 0.0044634416051962545, "phrase": "wireless_sensor_networks"}, {"score": 0.003748937184382714, "phrase": "malicious_intruders"}, {"score": 0.0035550029054401016, "phrase": "secure_time_synchronization"}, {"score": 0.003320277992107974, "phrase": "theoretical_analysis"}, {"score": 0.0030542703032534766, "phrase": "maximum_consensus"}, {"score": 0.002431938580448072, "phrase": "smts"}, {"score": 0.0023235629819760018, "phrase": "simultaneous_compensation"}, {"score": 0.0021865218861454256, "phrase": "extensive_numerical_results"}], "paper_keywords": ["Wireless sensor networks", " time synchronization", " cyber physical security", " maximum consensus"], "paper_abstract": "Time synchronization is a fundamental requirement for the wide spectrum of applications with wireless sensor networks (WSNs). However, most existing time synchronization protocols are likely to deteriorate or even to be destroyed when the WSNs are attacked by malicious intruders. This paper is concerned with secure time synchronization for WSNs under message manipulation attacks. Specifically, the theoretical analysis and simulation results are first provided to demonstrate that the maximum consensus based time synchronization (MTS) protocol would be invalid under message manipulation attacks. Then, a novel secured maximum consensus based time synchronization (SMTS) protocol is proposed to detect and invalidate message manipulation attacks. Furthermore, we prove that SMTS is guaranteed to converge with simultaneous compensation of both clock skew and offset. Extensive numerical results show the effectiveness of our proposed protocol.", "paper_title": "Secure Time Synchronization in Wireless Sensor Networks: A Maximum Consensus-Based Approach", "paper_id": "WOS:000334672900022"}