{"auto_keywords": [{"score": 0.0500785012217586, "phrase": "different_cultures"}, {"score": 0.047908758244913474, "phrase": "computer_agents"}, {"score": 0.044762259968123067, "phrase": "behavioral_traits"}, {"score": 0.033952079309090645, "phrase": "lebanon"}, {"score": 0.032371224090823617, "phrase": "prior_data"}, {"score": 0.004775726266706856, "phrase": "rapid_dissemination"}, {"score": 0.004672676139571354, "phrase": "geographical_and_ethnic_lines"}, {"score": 0.004522236296659418, "phrase": "diverse_cultural_and_organizational_affiliations"}, {"score": 0.0041555469216463855, "phrase": "new_agent"}, {"score": 0.004132933092001644, "phrase": "repeated_bilateral_negotiation"}, {"score": 0.004010730084243186, "phrase": "individual_traits"}, {"score": 0.003945597700434767, "phrase": "agent's_decision-making_model"}, {"score": 0.0037564547588649104, "phrase": "rule-based_mechanism"}, {"score": 0.003715665312918371, "phrase": "utility_function"}, {"score": 0.0036553070575015344, "phrase": "negotiation_process"}, {"score": 0.0035763463424188457, "phrase": "strategic_setting"}, {"score": 0.0033955600883170986, "phrase": "negotiation_rounds"}, {"score": 0.003250403288147613, "phrase": "human_subjects"}, {"score": 0.0031628384576037954, "phrase": "dependency_relationships"}, {"score": 0.002986532180741284, "phrase": "different_negotiation_strategies"}, {"score": 0.0028666313115584853, "phrase": "different_negotiation_strategy"}, {"score": 0.0023870497011682676, "phrase": "high_reliability_measure"}, {"score": 0.0022911610600672445, "phrase": "human-computer_agent_designers"}, {"score": 0.002260059968281536, "phrase": "multicultural_settings"}, {"score": 0.002199115809008107, "phrase": "viable_approach"}], "paper_keywords": ["Experimentation", " Human-agent decision making", " cultural modeling"], "paper_abstract": "The rapid dissemination of technology such as the Internet across geographical and ethnic lines is opening up opportunities for computer agents to negotiate with people of diverse cultural and organizational affiliations. To negotiate proficiently with people in different cultures, agents need to be able to adapt to the way behavioral traits of other participants change over time. This article describes a new agent for repeated bilateral negotiation that was designed to model and adapt its behavior to the individual traits exhibited by its negotiation partner. The agent's decision-making model combined a social utility function that represented the behavioral traits of the other participant, as well as a rule-based mechanism that used the utility function to make decisions in the negotiation process. The agent was deployed in a strategic setting in which both participants needed to complete their individual tasks by reaching agreements and exchanging resources, the number of negotiation rounds was not fixed in advance and agreements were not binding. The agent negotiated with human subjects in the United States and Lebanon in situations that varied the dependency relationships between participants at the onset of negotiation. There was no prior data available about the way people would respond to different negotiation strategies in these two countries. Results showed that the agent was able to adopt a different negotiation strategy to each country. Its average performance across both countries was equal to that of people. However, the agent outperformed people in the United States, because it learned to make offers that were likely to be accepted by people, while being more beneficial to the agent than to people. In contrast, the agent was outperformed by people in Lebanon, because it adopted a high reliability measure which allowed people to take advantage of it. These results provide insight for human-computer agent designers in the types of multicultural settings that we considered, showing that adaptation is a viable approach towards the design of computer agents to negotiate with people when there is no prior data of their behavior.", "paper_title": "An Adaptive Agent for Negotiating with People in Different Cultures", "paper_id": "WOS:000313763200008"}