{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "big_data"}, {"score": 0.006432415891493091, "phrase": "key_challenges"}, {"score": 0.0052332042519563395, "phrase": "semantic_computing"}, {"score": 0.00450368324850566, "phrase": "widespread_attention"}, {"score": 0.004435782384431224, "phrase": "information_technology"}, {"score": 0.004174220694700258, "phrase": "relevant_and_valuable_information"}, {"score": 0.004136333933790974, "phrase": "high_volume"}, {"score": 0.0039280214778273925, "phrase": "smaller_datasets"}, {"score": 0.00386876598761639, "phrase": "manual_interpretation"}, {"score": 0.003822003373331997, "phrase": "semantic_computing_technologies"}, {"score": 0.003618443379266972, "phrase": "linked_data"}, {"score": 0.0034361227353612456, "phrase": "state-of-the-art_semantics-based_approaches"}, {"score": 0.0033230588808076267, "phrase": "today's_big_data"}, {"score": 0.003253047640423623, "phrase": "latest_literature"}, {"score": 0.003107935254560724, "phrase": "semantic_approaches"}, {"score": 0.0029783256772952073, "phrase": "cutting-edge_approaches"}, {"score": 0.002933354468864442, "phrase": "ontology_evolution"}, {"score": 0.0028890603352364273, "phrase": "relevant_information"}, {"score": 0.0026129863248033807, "phrase": "semantic_technology"}, {"score": 0.0024736587129641652, "phrase": "existing_body"}, {"score": 0.0024586427394152196, "phrase": "basic_knowledge"}, {"score": 0.0024288830311280573, "phrase": "computational_issues"}, {"score": 0.0022508572821818124, "phrase": "new_approaches"}, {"score": 0.0021438155673297377, "phrase": "true_power"}, {"score": 0.0021049977753042253, "phrase": "crucial_issues"}], "paper_keywords": ["Semantics", " Ontology", " Big Data", " Tools", " Challenges"], "paper_abstract": "The term \"big data\" has recently gained widespread attention in the field of information technology (IT). One of the key challenges in making use of big data lies in finding ways to uncover relevant and valuable information. The high volume, velocity, and variety of big data hinder the use of solutions that are available for smaller datasets, which involve the manual interpretation of data. Semantic computing technologies have been proposed as a means of dealing with these issues, and with the advent of linked data in recent years, have become central to mainstream semantic computing. This paper attempts to uncover the state-of-the-art semantics-based approaches and tools that can be leveraged to enrich and enhance today's big data. It presents research on the latest literature, including 61 studies from 2011 to 2014. In addition, it highlights the key challenges that semantic approaches need to address in the near future. For instance, this paper presents cutting-edge approaches to ontology engineering, ontology evolution, searching and filtering relevant information, extracting and reasoning, distributed (web-scale) reasoning, and representing big data. It also makes recommendations that may encourage researchers to more deeply explore the applications of semantic technology, which could improve the processing of big data. The findings of this study contribute to the existing body of basic knowledge on semantics and computational issues related to big data, and may trigger further research on the field. Our analysis shows that there is a need to put more effort into proposing new approaches, and that tools must be created that support researchers and practitioners in realizing the true power of semantic computing and solving the crucial issues of big data.", "paper_title": "Semantic Computing for Big Data: Approaches, Tools, and Emerging Directions (2011-2014)", "paper_id": "WOS:000338846200012"}