{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "special_type"}, {"score": 0.049584128839210984, "phrase": "jigsaw_puzzles"}, {"score": 0.04812854551814997, "phrase": "large_number"}, {"score": 0.003993216345115755, "phrase": "fragments'_images"}, {"score": 0.0039519004610213595, "phrase": "existing_jigsaw_puzzle_assembly_algorithms"}, {"score": 0.003771185758226876, "phrase": "main_limitation"}, {"score": 0.0034700069041302003, "phrase": "intact_banknote's_image"}, {"score": 0.00331125524068286, "phrase": "prior_information"}, {"score": 0.0029224275921964724, "phrase": "three-step_method"}, {"score": 0.002619748321217153, "phrase": "ransac_method"}, {"score": 0.002448260697722081, "phrase": "lower_dimensional_space"}, {"score": 0.002385326947545194, "phrase": "small_groups"}, {"score": 0.00234834406550549, "phrase": "modified_agglomerative_clustering_method"}], "paper_keywords": ["Agglomerative clustering", " banknote reconstruction", " jigsaw puzzle assembly", " spectral embedding"], "paper_abstract": "In this paper, we propose a method to solve a special type of jigsaw puzzles, reconstructing banknotes from a large number of fragments based on fragments' images. Existing jigsaw puzzle assembly algorithms have difficulty solving this problem effectively. A main limitation of these methods is that they do not leverage the following important observations: 1) an intact banknote's image is known and thus can be used as prior information; 2) if two aligned fragments overlap each other, they must not be from a same banknote. Based on these two important observations, a three-step method is proposed to reconstruct banknotes from their fragments. Each fragment is first aligned to its original position on the banknote by a RANSAC method. After evaluating every two aligned fragments' relationships, all fragments are embedded into a lower dimensional space and then clustered into small groups using a modified agglomerative clustering method. Fragments in a same cluster are likely to be from a same banknote. Experiments on both synthetic and real data demonstrate the effectiveness of our proposed method.", "paper_title": "Solving a Special Type of Jigsaw Puzzles: Banknote Reconstruction From a Large Number of Fragments", "paper_id": "WOS:000330245800024"}