{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "collocated_multi-user_tv"}, {"score": 0.0045075348899324425, "phrase": "central_role"}, {"score": 0.004340724551091173, "phrase": "common_reference_point"}, {"score": 0.004232946822003551, "phrase": "interactive_media"}, {"score": 0.004127834058321831, "phrase": "modern_day_tv"}, {"score": 0.003549570370358334, "phrase": "separate_and_private_activities"}, {"score": 0.003354180941665089, "phrase": "private_digital_bubbles"}, {"score": 0.003179500862953224, "phrase": "multi-user_use"}, {"score": 0.003081015075417782, "phrase": "existing_multi-screen_usage"}, {"score": 0.0029389598856744436, "phrase": "social_contexts"}, {"score": 0.0026241089938360634, "phrase": "multi-user_tv"}, {"score": 0.002599442416948628, "phrase": "shared-use_tv_interfaces"}, {"score": 0.002510960575700234, "phrase": "multi-screen_activity"}, {"score": 0.002433132434417479, "phrase": "multiple_independent_physical_views"}, {"score": 0.0023951255255435272, "phrase": "private_and_collaborative_activities"}, {"score": 0.002372606268769639, "phrase": "single_shared_display"}, {"score": 0.002328199473006809, "phrase": "new_technologies"}, {"score": 0.0022489295919084643, "phrase": "future_role"}, {"score": 0.0021723527926629234, "phrase": "existing_usage"}, {"score": 0.0021249824741421306, "phrase": "increasing_relevance"}], "paper_keywords": ["Multi-user", " TV", " Collaboration", " Multi-screening", " Multi-view"], "paper_abstract": "The TV plays a central role in our homes, bringing friends and family together by providing a common reference point for live, on-demand and interactive media. However, the capabilities of the modern day TV poorly reflect this social, multi-user context. The TV is in the process of being supplemented, and in some cases replaced, by other devices and displays (e.g. phones, tablets) in what is termed \"multi-screening\". This allows users to engage in separate and private activities alongside TV usage. The result of this is that users are \"together alone\" inhabiting private digital bubbles, their activity and interactions cut off from those around them. This paper outlines why facilitating multi-user use of the TV is important within the context of existing multi-screen usage, and reviews how we might go about designing TVs that better support the social contexts in which they reside. Firstly, we discuss how we interact with and share use of the TV, before examining how our TV usage has been augmented by multi-screening. We then review designs for multi-user TV: from shared-use TV interfaces, to using the TV as a medium by which multi-screen activity can be shared, to TVs capable of providing multiple independent physical views, allowing for both private and collaborative activities on a single shared display. Finally, we discuss new technologies that might have a part to play in determining the future role of the TV. This paper demonstrates that, contrary to existing usage, the TV can be of increasing relevance in the multi-user, multi-screen era.", "paper_title": "A review of collocated multi-user TV Examining the changing role of the TV in the multi-viewer, multi-screen home", "paper_id": "WOS:000359809000002"}