{"auto_keywords": [{"score": 0.04963294139988704, "phrase": "khanna"}, {"score": 0.049411544817531294, "phrase": "motwani"}, {"score": 0.04407294530763452, "phrase": "parameterized_complexity"}, {"score": 0.03832266475471311, "phrase": "running_time"}, {"score": 0.00481495049065317, "phrase": "polynomial-time_approximation"}, {"score": 0.0045625946800833895, "phrase": "putatively_fundamental_problems"}, {"score": 0.004467469857498581, "phrase": "optimization_problems"}, {"score": 0.004425828391572315, "phrase": "polynomial-time_approximation_scheme"}, {"score": 0.004364089641254575, "phrase": "main_contribution"}, {"score": 0.004058508269656021, "phrase": "optimization_problem"}, {"score": 0.0038276694156648386, "phrase": "parameter_value"}, {"score": 0.0037215597979390076, "phrase": "multiplicative_factor"}, {"score": 0.00359303482793932, "phrase": "fixed_value"}, {"score": 0.0030422064620877014, "phrase": "problem_parameter"}, {"score": 0.0029301953327083843, "phrase": "efficient_ptas"}, {"score": 0.0028222966708035726, "phrase": "fixed-parameter_tractable_algorithm"}, {"score": 0.002680376034383189, "phrase": "planar_mpsat"}, {"score": 0.0023175690579504645, "phrase": "useful_way"}, {"score": 0.0022691447401588494, "phrase": "garey"}, {"score": 0.0022586370747317568, "phrase": "johnson"}, {"score": 0.0021549785581216063, "phrase": "syntactic_restrictions"}, {"score": 0.0021049977753042253, "phrase": "positive_results"}], "paper_keywords": [""], "paper_abstract": "In 1996 Khanna and Motwani [KM] proposed three logic-based optirnization problems constrained by planar structure, and offered the hypothesis that these putatively fundamental problems might provide insight into characterizing the class of optimization problems that admit a polynomial-time approximation scheme (PTAS). The main contribution of this paper is to explore this program from the point of view of parameterized complexity. Problems of optimization are naturally parameterized by the parameter k = 1/epsilon. An optimization problem admits a PTAS if and only if there is an algorithm Phi, that, given an input of size n, and a parameter value k = 1/epsilon, produces a solution that is within a multiplicative factor of (1 + epsilon) of optimal, in a running time that is polynomial for every fixed value of epsilon. This definition admits the possibility that the degree of the polynomial that bounds the running time of Phi may increase, even quite dramatically, as a function of k = 1/epsilon. In fact, amongst the PTASs that are currently known, for an error of 20%, polynomial-time bounds no better than 0(n(2000)) are quite common [D]. Viewing k = 1/epsilon as a problem parameter, in the sense of parameterized complexity, leads naturally to the question of whether an efficient PTAS (EPTAS) might be possible for a given optimization problem. An EPTAS is simply a fixed-parameter tractable algorithm with respect to this parameter. We offer a number of results concerning the problems PLANAR TMIN, PLANAR TMAX and PLANAR MPSAT defined by Khanna and Motwani: (1) We show that each of these problems of approximation, naturally parameterized by k = 1/epsilon, is hard for W[ I], and thus it is highly unlikely that they admit EPTASs. (One could also interpret this as indicating that PTASs for these problems are unlikely to be a useful way of coping with intractability in the sense of Garey and Johnson [GJ].) (2) We show that there are EPTASs for some subproblems described by syntactic restrictions, and establish some limits on how far these positive results can be extended.", "paper_title": "The complexity of polynomial-time approximation", "paper_id": "WOS:000249654500006"}