{"auto_keywords": [{"score": 0.03465035281375812, "phrase": "svm"}, {"score": 0.015592948555377335, "phrase": "gene_microarray_classification"}, {"score": 0.013817573891461507, "phrase": "classification_performance"}, {"score": 0.00481495049065317, "phrase": "multiple_approaches"}, {"score": 0.0046797114400479135, "phrase": "microarray_report"}, {"score": 0.0044747919503484055, "phrase": "feature_vector"}, {"score": 0.003960210592458847, "phrase": "dimensionality'_problem"}, {"score": 0.003802135020791801, "phrase": "good_methods"}, {"score": 0.003310236836421397, "phrase": "support_vector_machine"}, {"score": 0.0031012349116334606, "phrase": "selected_genes"}, {"score": 0.0029652292779277782, "phrase": "neighborhood_preserving_embedding_feature_transform"}, {"score": 0.0028351712509358997, "phrase": "orthogonal_wavelet_coefficients"}, {"score": 0.0028121429464519733, "phrase": "different_wavelet_mothers"}, {"score": 0.0027218799769229596, "phrase": "texture_descriptors"}, {"score": 0.002529213370528279, "phrase": "best_feature_extraction_methods"}, {"score": 0.0024781515864648242, "phrase": "positive_results"}, {"score": 0.0024182330686905256, "phrase": "different_features_extraction_methods"}, {"score": 0.002388817995161952, "phrase": "system_performance"}, {"score": 0.00220163445285539, "phrase": "receiver_operating_characteristic"}, {"score": 0.002183753380130411, "phrase": "roc"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": [""], "paper_abstract": "Motivation: The microarray report measures the expressions of tens of thousands of genes, producing a feature vector that is high in dimensionality and that contains much irrelevant information. This dimensionality degrades classification performance. Moreover, datasets typically contain few samples for training, leading to the ` curse of dimensionality' problem. It is essential, therefore, to find good methods for reducing the size of the feature set. Results: In this article, we propose a method for gene microarray classification that combines different feature reduction approaches for improving classification performance. Using a support vector machine (SVM) as our classifier, we examine an SVM trained using a set of selected genes; an SVM trained using the feature set obtained by Neighborhood Preserving Embedding feature transform; a set of SVMs trained using a set of orthogonal wavelet coefficients of different wavelet mothers; a set of SVMs trained using texture descriptors extracted from the microarray, considering it as an image; and an ensemble that combines the best feature extraction methods listed above. The positive results reported offer confirmation that combining different features extraction methods greatly enhances system performance. The experiments were performed using several different datasets, and our results [expressed as both accuracy and area under the receiver operating characteristic (ROC) curve] show the goodness of the proposed approach with respect to the state of the art.", "paper_title": "Combining multiple approaches for gene microarray classification", "paper_id": "WOS:000302806900015"}