{"auto_keywords": [{"score": 0.028918836564422505, "phrase": "absolute_accelerations"}, {"score": 0.01565932312631369, "phrase": "classical_linear_optimal_control"}, {"score": 0.012748535166539164, "phrase": "proposed_approach"}, {"score": 0.008348699648829087, "phrase": "stiffness_parameters"}, {"score": 0.008020496388549323, "phrase": "proposed_active_approach"}, {"score": 0.00481495049065317, "phrase": "structural_response_under_earthquake_excitation"}, {"score": 0.004704844560325455, "phrase": "representative_simple_methods"}, {"score": 0.004643055780443262, "phrase": "suboptimal_passive_damping"}, {"score": 0.004566954456805558, "phrase": "optimal_control"}, {"score": 0.004403874076980828, "phrase": "exact_optimal_damping"}, {"score": 0.004176961840039024, "phrase": "structural_damping"}, {"score": 0.00409490456027741, "phrase": "proposed_suboptimal_ways"}, {"score": 0.00404109360612109, "phrase": "uncontrolled_vibrations"}, {"score": 0.00400119808662365, "phrase": "performance_levels"}, {"score": 0.003948613642680196, "phrase": "seismic_inputs"}, {"score": 0.003807529003314843, "phrase": "adaptive_property"}, {"score": 0.0037699306119313154, "phrase": "dynamic_effects"}, {"score": 0.0036836332308340923, "phrase": "new_performance_index"}, {"score": 0.0036352070472201086, "phrase": "mechanical_energy"}, {"score": 0.0035402494307399733, "phrase": "seismic_energies"}, {"score": 0.0034706569037527774, "phrase": "minimization_procedure"}, {"score": 0.0034024277222012597, "phrase": "resulting_closed-loop_control_algorithm"}, {"score": 0.003313530464737521, "phrase": "seismic_excitation"}, {"score": 0.0032483801419536675, "phrase": "nonlinear_matrix_riccati_equation"}, {"score": 0.0028360962841331634, "phrase": "numerical_simulation_results"}, {"score": 0.00280806350681826, "phrase": "proposed_algorithm"}, {"score": 0.002752824177838148, "phrase": "uncontrolled_seismic_structural_displacements"}, {"score": 0.0025935242726503964, "phrase": "comparable_control_effort"}, {"score": 0.002427286272201272, "phrase": "similar_performance"}, {"score": 0.0021049977753042253, "phrase": "simultaneous_reduction"}], "paper_keywords": [""], "paper_abstract": "This study firstly proposes some representative simple methods to obtain the suboptimal passive damping and stiffness parameters from the optimal control gain matrix since it is not possible to add the exact optimal damping and stiffness parameters to the structure in practice. It is shown numerically that modifying the structural damping and the stiffness in the proposed suboptimal ways may suppress the uncontrolled vibrations while the performance levels depend on the seismic inputs. Since the proposed approach is intrinsically passive and has no adaptive property against changing dynamic effects, this study secondly proposes a new performance index so that the mechanical energy of the structure, control and the seismic energies are considered simultaneously in the minimization procedure. The implementation of the resulting closed-loop control algorithm does not require both a priori knowledge of the seismic excitation and the solution of the nonlinear matrix Riccati equation. The performance of the proposed approach is investigated, e.g., structures subjected to three seismic inputs and compared to the performance of the uncontrolled, the classical linear optimal control, and the passive cases. It is shown by the numerical simulation results that the proposed algorithm is capable of suppressing the uncontrolled seismic structural displacements and the absolute accelerations simultaneously and performs almost as well as the classical linear optimal control in reducing the displacements with comparable control effort and performs better than the classical linear optimal control in reducing the absolute accelerations. The results show that while the proposed active approach has similar performance to the classical linear optimal control, the classical linear optimal control increases the absolute accelerations slightly compared to the proposed active approach in regulating displacements, while the proposed active approach regulates and reduces both displacements and absolute accelerations. The proposed approach is promising in protecting both the structural and non-structural members from the seismic forces since a simultaneous reduction both in the displacements and the absolute accelerations is achieved.", "paper_title": "Control of Structural Response Under Earthquake Excitation", "paper_id": "WOS:000307341600005"}