{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "frequent_itemsets"}, {"score": 0.044322505446268326, "phrase": "malicious_parties"}, {"score": 0.031960253074459766, "phrase": "collusion-free_model"}, {"score": 0.004683292152590589, "phrase": "malicious_participants"}, {"score": 0.004580550308652044, "phrase": "data_mining"}, {"score": 0.004530027909507501, "phrase": "ppdm"}, {"score": 0.004168349927332055, "phrase": "rule_mining_process"}, {"score": 0.0039433581938239926, "phrase": "semi-honest_model"}, {"score": 0.0034707339811048403, "phrase": "secret_values"}, {"score": 0.002970914475538276, "phrase": "frequent_itemset_mining_process"}, {"score": 0.0026881926384093088, "phrase": "main_step"}, {"score": 0.0026584843838039166, "phrase": "association_rule_mining_algorithms"}, {"score": 0.0024054226746197706, "phrase": "multi-party_states"}, {"score": 0.002262756631083292, "phrase": "privacy_measuring_technique"}, {"score": 0.0021049977753042253, "phrase": "sensitive_information"}], "paper_keywords": [""], "paper_abstract": "Privacy preserving data mining (PPDM) algorithms attempt to reduce the injuries to privacy caused by malicious parties during the rule mining process. Usually, these algorithms are designed for the semi-honest model, where participants do not deviate from the protocol. However, in the real-world, malicious parties may attempt to obtain the secret values of other parties by probing attacks or collusion. In this study, the authors study how to preserve the privacy of participants in a collusion-free model of the frequent itemset mining process, where the protocol protects against probing attacks and collusion. The mining of frequent itemsets is the main step of association rule mining algorithms, and, in this study, the authors propose two privacy-preserving frequent itemset mining algorithms for both two-party and multi-party states in a collusion-free model for vertically partitioned (heterogeneous) data; in addition, a privacy measuring technique is proposed, which quantifies privacy based on the amount of disclosed sensitive information.", "paper_title": "Mining frequent itemsets in the presence of malicious participants", "paper_id": "WOS:000295122000005"}