{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "uml_design_models"}, {"score": 0.015261059098791599, "phrase": "controlled_experiment"}, {"score": 0.01499221520704078, "phrase": "differentiated_replication"}, {"score": 0.013315425098142075, "phrase": "uml_class_and_sequence_diagrams"}, {"score": 0.004454377387615279, "phrase": "main_objective"}, {"score": 0.0042459818200777846, "phrase": "object-oriented_source-code"}, {"score": 0.003975200317233532, "phrase": "software_design_phase"}, {"score": 0.0036993855514735746, "phrase": "young_software_maintainers"}, {"score": 0.0035473886133680866, "phrase": "bachelor"}, {"score": 0.0035051129798529, "phrase": "master_students"}, {"score": 0.003109031770476385, "phrase": "average_improvement"}, {"score": 0.002841545331522694, "phrase": "comprehension_task"}, {"score": 0.0026126405272417783, "phrase": "comprehension_tasks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Design models", " Controlled experiment", " Source-code comprehension"], "paper_abstract": "Objective: The main objective is to investigate whether the comprehension of object-oriented source-code increases when it is added with UML class and sequence diagrams produced in the software design phase. Methods: We conducted a controlled experiment and a differentiated replication with young software maintainers. In particular, groups of Bachelor and Master students were involved. Results: The results show that more experienced participants better comprehend source-code when added with UML design models. An average improvement (or benefit) of circa 12% was achieved when the participants accomplished the comprehension task with UML class and sequence diagrams. The results of an analysis on the time to accomplish comprehension tasks showed that less experienced participants significantly spent more time when comprehending source-code with UML design models. This kind of participants spent on average 44.8% of the time to accomplish the same task with source-code alone. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Source-code comprehension tasks supported by UML design models: Results from a controlled experiment and a differentiated replication", "paper_id": "WOS:000353312200002"}