{"auto_keywords": [{"score": 0.048027271228811945, "phrase": "problem_list_completeness"}, {"score": 0.010327620533313512, "phrase": "success_factors"}, {"score": 0.00481495049065317, "phrase": "electronic_health_records"}, {"score": 0.0046316984634760874, "phrase": "financial_incentives"}, {"score": 0.004571055044692412, "phrase": "objective_measure"}, {"score": 0.004445441051049925, "phrase": "billing_codes"}, {"score": 0.004339459955098738, "phrase": "retrospective_analysis"}, {"score": 0.004315771670213371, "phrase": "electronic_health_record_data"}, {"score": 0.004268780663872836, "phrase": "ten_healthcare_organizations"}, {"score": 0.004222299135545249, "phrase": "united_kingdom"}, {"score": 0.004187778787646931, "phrase": "argentina"}, {"score": 0.004119550201381466, "phrase": "electronic_health_record_systems"}, {"score": 0.003908780649439832, "phrase": "healthcare_facilities"}, {"score": 0.0036121819729961384, "phrase": "informatics_leaders"}, {"score": 0.0034478392374444177, "phrase": "common_practices"}, {"score": 0.0034102660898135155, "phrase": "top_performing_sites"}, {"score": 0.003327211815476358, "phrase": "problem_list_management_practices"}, {"score": 0.003228434077467506, "phrase": "ten_sites"}, {"score": 0.0027843339377323878, "phrase": "global_data_integrity_problem"}, {"score": 0.002664850766529523, "phrase": "wide_range"}, {"score": 0.002571546590108763, "phrase": "high_levels"}, {"score": 0.0024410093024417527, "phrase": "patient_safety"}, {"score": 0.00235552395638113, "phrase": "ehr_systems"}, {"score": 0.002342640118816734, "phrase": "ten_healthcare_facilities"}, {"score": 0.002317082977487583, "phrase": "six_success_factors"}, {"score": 0.0022792679029952903, "phrase": "healthcare_organizations"}, {"score": 0.0022054750513000854, "phrase": "problem_oriented_charting"}, {"score": 0.002193410120879393, "phrase": "gap_reporting"}, {"score": 0.0021814110467069346, "phrase": "shared_responsibility"}, {"score": 0.0021399277552314067, "phrase": "organizational_culture"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health records", " Problem lists", " Diabetes", " Quality"], "paper_abstract": "Objective: To assess problem list completeness using an objective measure across a range of sites, and to identify success factors for problem list completeness. Methods: We conducted a retrospective analysis of electronic health record data and interviews at ten healthcare organizations within the United States, United Kingdom, and Argentina who use a variety of electronic health record systems: four self-developed and six commercial. At each site, we assessed the proportion of patients who have diabetes recorded on their problem list out of all patients with a hemoglobin A1c elevation > = 7.0%, which is diagnostic of diabetes. We then conducted interviews with informatics leaders at the four highest performing sites to determine factors associated with success. Finally, we surveyed all the sites about common practices implemented at the top performing sites to determine whether there was an association between problem list management practices and problem list completeness. Results: Problem list completeness across the ten sites ranged from 60.2% to 99.4%, with a mean of 78.2%. Financial incentives, problem-oriented charting, gap reporting, shared responsibility, links to billing codes, and organizational culture were identified as success factors at the four hospitals with problem list completeness at or near 90.0%. Discussion: Incomplete problem lists represent a global data integrity problem that could compromise quality of care and put patients at risk. There was a wide range of problem list completeness across the healthcare facilities. Nevertheless, some facilities have achieved high levels of problem list completeness, and it is important to better understand the factors that contribute to success to improve patient safety. Conclusion: Problem list completeness varies substantially across healthcare facilities. In our review of EHR systems at ten healthcare facilities, we identified six success factors which may be useful for healthcare organizations seeking to improve the quality of their problem list documentation: financial incentives, problem oriented charting, gap reporting, shared responsibility, links to billing codes, and organizational culture. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Problem list completeness in electronic health records: A multi-site study and assessment of success factors", "paper_id": "WOS:000360562100007"}