{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "higher-order_tetrahedral_data"}, {"score": 0.004187284711626886, "phrase": "non-linear_basis_functions"}, {"score": 0.003996727479807572, "phrase": "discontinuous_galerkin_methods"}, {"score": 0.0033170847930578473, "phrase": "mesh_simplification"}, {"score": 0.003039445153076014, "phrase": "point-based_visualization_system"}, {"score": 0.0026580683046325253, "phrase": "non-linear_solution_data"}, {"score": 0.002566685388128598, "phrase": "run_time"}, {"score": 0.0025221759076833124, "phrase": "gpu_memory_limits"}, {"score": 0.0024072121760839427, "phrase": "memory_consumption"}, {"score": 0.0023380300046435187, "phrase": "input_size"}, {"score": 0.0022576249214220187, "phrase": "order-independent_point_rendering_method"}, {"score": 0.0021049977753042253, "phrase": "interactive_rates"}], "paper_keywords": ["interactive large higher-order tetrahedral volume visualization", " point-based visualization"], "paper_abstract": "Computational simulations frequently generate solutions defined over very large tetrahedral volume meshes containing many millions of elements. Furthermore, such solutions may often be expressed using non-linear basis functions. Certain solution techniques, such as discontinuous Galerkin methods, may even produce non-conforming meshes. Such data is difficult to visualize interactively, as it is far too large to fit in memory and many common data reduction techniques, such as mesh simplification, cannot be applied to non-conforming meshes. We introduce a point-based visualization system for interactive rendering of large, potentially non-conforming, tetrahedral meshes. We propose methods for aclaptively sampling points from non-linear solution data and for decimating points at run time to fit GPU memory limits. Because these are streaming processes, memory consumption is independent of the input size. We also present an order-independent point rendering method that can efficiently render volumes on the order of 20 million tetrahedra at interactive rates.", "paper_title": "Interactive point-based rendering of higher-order tetrahedral data", "paper_id": "WOS:000241383300073"}