{"auto_keywords": [{"score": 0.04542391534309872, "phrase": "hessian_eigenvalues"}, {"score": 0.02819827616624647, "phrase": "hessian-based_enhancement_filters"}, {"score": 0.005369802079150655, "phrase": "processing_times"}, {"score": 0.00527628742143177, "phrase": "percentage_reductions"}, {"score": 0.005058409302394335, "phrase": "tubular-like_structures"}, {"score": 0.005022976752545719, "phrase": "two-dimensional_images"}, {"score": 0.004764987565598479, "phrase": "plane-like_structures"}, {"score": 0.0047316005673562036, "phrase": "three-dimensional_images"}, {"score": 0.00463229351153731, "phrase": "fast_computation"}, {"score": 0.0045037997020733415, "phrase": "particular_structures"}, {"score": 0.004472234553892357, "phrase": "medical_images"}, {"score": 0.004302522426263979, "phrase": "computational_costs"}, {"score": 0.004124688058533477, "phrase": "image_elements"}, {"score": 0.004081385289516914, "phrase": "filter_responses"}, {"score": 0.0040385352882334235, "phrase": "computing_eigenvalues"}, {"score": 0.003968112038249246, "phrase": "substantial_computational_effort"}, {"score": 0.003940286428597882, "phrase": "high_computational_cost"}, {"score": 0.003724566354526513, "phrase": "characteristic_polynomial_coefficients"}, {"score": 0.0036467403626789666, "phrase": "well-known_routh-hurwitz_criterion"}, {"score": 0.003447035529485425, "phrase": "hessian-based_enhancement_filter"}, {"score": 0.0032697235411641695, "phrase": "computational_cost"}, {"score": 0.0032013710938940424, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Hessian-based enhancement filter", " Routh-Hurwitz criterion", " Selective enhancement filter", " Hessian eigenvalue"], "paper_abstract": "This paper presents a method for fast computation of Hessian-based enhancement filters, whose conditions for identifying particular structures in medical images are associated only with the signs of Hessian eigenvalues. The computational costs of Hessian-based enhancement filters come mainly from the computation of Hessian eigenvalues conesponding to image elements to obtain filter responses, because computing eigenvalues of a matrix requires substantial computational effort. High computational cost has become a challenge in the application of Hessian-based enhancement filters. Using a property of the characteristic polynomial coefficients of a matrix and the well-known Routh-Hurwitz criterion in control engineering, it is shown that under certain conditions, the response of a Hessian-based enhancement filter to an image element can be obtained without having to compute Hessian eigenvalues. The computational cost can thus be reduced. Experimental results on several medical images show that the method proposed in this paper can reduce significantly the number of computations of Hessian eigenvalues and the processing times of images. The percentage reductions of the number of computations of Hessian eigenvalues for enhancing blob- and tubular-like structures in two-dimensional images are approximately 90% and 65%, respectively. For enhancing blob-, tubular-, and plane-like structures in three-dimensional images, the reductions are approximately 97%, 75%, and 12%, respectively. For the processing times, the percentage reductions for enhancing blob- and tubular-like structures in two-dimensional images are approximately 31% and 7.5%, respectively. The reductions for enhancing blob-, tubular-, and plane-like structures in three-dimensional images are approximately 68%, 55%, and 3%, respectively. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Fast computation of Hessian-based enhancement filters for medical images", "paper_id": "WOS:000339961000005"}