{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_method"}, {"score": 0.004203030435498069, "phrase": "concise_and_stable_basis"}, {"score": 0.004024072318264299, "phrase": "new_algorithm"}, {"score": 0.003980531478122155, "phrase": "feature_detection"}, {"score": 0.0037087324991876727, "phrase": "kernel-based_optimization_techniques"}, {"score": 0.0035701213515857227, "phrase": "continuous_scale-space"}, {"score": 0.0034180189629740426, "phrase": "image_regions"}, {"score": 0.0032546105164772995, "phrase": "image_description"}, {"score": 0.003048782877550259, "phrase": "image_content"}, {"score": 0.00295078850927459, "phrase": "viewpoint_changes"}, {"score": 0.0027491084541806823, "phrase": "experimental_results"}, {"score": 0.0026175952455594277, "phrase": "image_retrieval"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Image matching", " Segmentation", " Interest point operator", " Feature space", " Feature detector"], "paper_abstract": "We present a new method for describing images for the purposes of matching and registration. We take the point of view that large, coherent regions in the image provide a concise and stable basis for image description. We develop a new algorithm for feature detection that operates on several projections (feature spaces) of the image using kernel-based optimization techniques to locate local extrema of a continuous scale-space of image regions. Descriptors of these image regions and their relative geometry then form the basis of an image description. The emphasis of the work is on features that summarize image content and are highly robust to viewpoint changes and occlusion yet remain discriminative for matching and registration. We present experimental results of these methods applied to the problem of image retrieval. We find that our method performs comparably to two published techniques: Blobworld and SIFT features. However, compared to these techniques two significant advantages of our method are its (1) stability under large changes in the images and (2) its representational efficiency. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Image description with features that summarize", "paper_id": "WOS:000264230100002"}