{"auto_keywords": [{"score": 0.037606717309270815, "phrase": "detailed_description"}, {"score": 0.03733329838869367, "phrase": "goal_states"}, {"score": 0.00481495049065317, "phrase": "goal_life-cycle"}, {"score": 0.004707188147442449, "phrase": "fundamental_feature"}, {"score": 0.004671803485255806, "phrase": "intelligent_agents"}, {"score": 0.004398094237005956, "phrase": "unpredictable_ways"}, {"score": 0.004002044115117644, "phrase": "key_aspect"}, {"score": 0.003956971099850658, "phrase": "agent's_architecture"}, {"score": 0.003897659323896113, "phrase": "bdi_agents"}, {"score": 0.003049086085585051, "phrase": "operational_semantics"}, {"score": 0.0029694830678462787, "phrase": "abstract_agent_language"}, {"score": 0.002870173628745123, "phrase": "detailed_real-life_scenario"}, {"score": 0.0026511422582578027, "phrase": "rich_goals"}, {"score": 0.002552781867125423, "phrase": "first_specification"}, {"score": 0.0024120247307686084, "phrase": "plan_execution"}, {"score": 0.002120982646893519, "phrase": "correctness_verification"}, {"score": 0.0021049977753042253, "phrase": "agent_behaviour"}], "paper_keywords": ["BDI agents", " Goal management", " Operational semantics"], "paper_abstract": "A fundamental feature of intelligent agents is their ability to deliberate over their goals. Operating in an environment that may change in unpredictable ways, an agent needs to regularly evaluate whether its current set of goals is the most appropriate set to pursue. The management of goals is thus a key aspect of an agent's architecture. Focusing on BDI agents, we consider the various types of goals studied in the literature, including both achievement and maintenance goals. We develop a detailed description of goal states (such as whether goals have been suspended or not), and a comprehensive suite of operations that may be applied to goals (including dropping, aborting, suspending and resuming them). We provide an operational semantics corresponding to this detailed description in an abstract agent language (CAN), and demonstrate on a detailed real-life scenario. The three key contributions of our generic framework for goal states and transitions are (1) to encompass both goals of accomplishment and rich goals of monitoring, (2) to provide the first specification of abort and suspend for all the common goal types, and (3) to account for plan execution as well as the dynamics of subgoaling. Our semantics clarifies how an agent can manage its goals, based on the decisions that it chooses to make, and further provides a foundation for correctness verification of agent behaviour.", "paper_title": "An operational semantics for the goal life-cycle in BDI agents", "paper_id": "WOS:000330962900005"}