{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "live_chat_use"}, {"score": 0.04487452084591575, "phrase": "live_chat"}, {"score": 0.014766091862255162, "phrase": "online_stores"}, {"score": 0.012525722133877046, "phrase": "taobao.com"}, {"score": 0.008487930052317847, "phrase": "perceived_interactivity"}, {"score": 0.004777034835192062, "phrase": "electronic_markets"}, {"score": 0.004739416327250269, "phrase": "online_shopping"}, {"score": 0.004396426822203258, "phrase": "communication_dialogues"}, {"score": 0.00425951071471662, "phrase": "modern-day_consumers"}, {"score": 0.004176102823067887, "phrase": "online_sellers"}, {"score": 0.003982500388997762, "phrase": "live_chat_medium"}, {"score": 0.0037234376132464463, "phrase": "conceptual_framework"}, {"score": 0.0034129490818185595, "phrase": "one's_eventual_intention"}, {"score": 0.003306559295382181, "phrase": "trust-oriented_perspective"}, {"score": 0.003115908199991072, "phrase": "proposed_conceptual_model"}, {"score": 0.003066945490483524, "phrase": "research_hypotheses"}, {"score": 0.002971309306027602, "phrase": "perceived_information_asymmetry"}, {"score": 0.0029246121262946384, "phrase": "seller_opportunism"}, {"score": 0.0028786467218197245, "phrase": "motivation_dimension"}, {"score": 0.0028446460307503343, "phrase": "perceived_personal_expertise"}, {"score": 0.0027999339042953076, "phrase": "ability_dimension"}, {"score": 0.002370748155770563, "phrase": "one's_intention"}, {"score": 0.0021049977753042253, "phrase": "real-time_communication_technology"}], "paper_keywords": ["live chat", " MOA framework", " e-commerce", " intention to transact", " trust"], "paper_abstract": "Online shopping has progressed from having consumers passively browse through the webpages of online stores to having them proactively engage in communication dialogues with the sellers themselves via live chat. Modern-day consumers can now directly contact online sellers and inquire about the products they intend to purchase through the live chat medium available in the webpages of online stores, such as Taobao.com. In this study, the conceptual framework of motivation, opportunity, and ability was extended to understand the antecedents of using live chat and to lengthen such an understanding on one's eventual intention to transact on the website from the trust-oriented perspective. A total of 222 online consumers of Taobao.com were surveyed, and their responses validated the proposed conceptual model and confirmed the research hypotheses. Results of the investigation indicated that perceived information asymmetry and fears of seller opportunism, encapsulated under motivation dimension, and perceived personal expertise, which manifests ability dimension, significantly influence the use of live chat by consumers. The results further demonstrated that live chat use positively affects the perceived interactivity of consumers, thereby increasing their intention to transact. The influence of live chat use on the perceived interactivity of consumers and its effect on one's intention to transact online are negatively moderated by the trust of consumers in a seller. The findings contribute to our understanding communication services for e-commerce in general and to the realization of real-time communication technology in particular.", "paper_title": "Understanding the Antecedents and Consequences of Live Chat Use in Electronic Markets", "paper_id": "WOS:000354437100001"}