{"auto_keywords": [{"score": 0.03656307570619558, "phrase": "intermediate_time_scales"}, {"score": 0.00481495049065317, "phrase": "recent_advances"}, {"score": 0.0047747348769918, "phrase": "synthetic_biology"}, {"score": 0.004734853555630616, "phrase": "artificial_life"}, {"score": 0.004559451202070545, "phrase": "hot_topic"}, {"score": 0.003936698872193083, "phrase": "problematic_assumptions"}, {"score": 0.003838791650587681, "phrase": "impoverished_conception"}, {"score": 0.003619672388007568, "phrase": "new_consensus"}, {"score": 0.0033844715014920233, "phrase": "adequate_theory"}, {"score": 0.003245270848972794, "phrase": "living_beings"}, {"score": 0.002909482525367989, "phrase": "adaptive_behavior"}, {"score": 0.002873038567884343, "phrase": "morphological_changes"}, {"score": 0.0026193328696791306, "phrase": "minimal_model"}, {"score": 0.0025974077149412, "phrase": "lifelike_phenomena"}, {"score": 0.0024800509241747013, "phrase": "simple_reaction-diffusion_systems"}, {"score": 0.002299313860419974, "phrase": "prebiotic_systems"}, {"score": 0.0021861845339709533, "phrase": "faster-and_slower-paced_time_scales"}, {"score": 0.0021049977753042253, "phrase": "natural_selection"}], "paper_keywords": ["Origin of life", " adaptive behavior", " dissipative structure", " replicator-first", " metabolism-first", " reaction-diffusion system", " autopoiesis", " life-mind continuity"], "paper_abstract": "Due to recent advances in synthetic biology and artificial life, the origin of life is currently a hot topic of research. We review the literature and argue that the two traditionally competing replicator-first and metabolism-first approaches are merging into one integrated theory of individuation and evolution. We contribute to the maturation of this more inclusive approach by highlighting some problematic assumptions that still lead to an impoverished conception of the phenomenon of life. In particular, we argue that the new consensus has so far failed to consider the relevance of intermediate time scales. We propose that an adequate theory of life must account for the fact that all living beings are situated in at least four distinct time scales, which are typically associated with metabolism, motility, development, and evolution. In this view, self-movement, adaptive behavior, and morphological changes could have already been present at the origin of life. In order to illustrate this possibility, we analyze a minimal model of lifelike phenomena, namely, of precarious, individuated, dissipative structures that can be found in simple reaction-diffusion systems. Based on our analysis, we suggest that processes on intermediate time scales could have already been operative in prebiotic systems. They may have facilitated and constrained changes occurring in the faster-and slower-paced time scales of chemical self-individuation and evolution by natural selection, respectively.", "paper_title": "Motility at the Origin of Life: Its Characterization and a Model", "paper_id": "WOS:000327943100004"}