{"auto_keywords": [{"score": 0.04321077932593742, "phrase": "staircase_tableaux"}, {"score": 0.0421318407050913, "phrase": "random_staircase_tableaux"}, {"score": 0.014648102168126339, "phrase": "asymmetric_exclusion_process"}, {"score": 0.01324805769114047, "phrase": "general_model"}, {"score": 0.00481495049065317, "phrase": "weighted_random_staircase_tableaux"}, {"score": 0.004707672504464783, "phrase": "relatively_new_combinatorial_structure"}, {"score": 0.0044497893303279985, "phrase": "askey-wilson"}, {"score": 0.004318027255281003, "phrase": "considerable_interest"}, {"score": 0.004158794879468156, "phrase": "combinatorial_properties"}, {"score": 0.003945655733425476, "phrase": "greek"}, {"score": 0.0038144050983900286, "phrase": "arbitrary_positive_weights"}, {"score": 0.0033947594838968326, "phrase": "limiting_laws"}, {"score": 0.0031965070898750912, "phrase": "earlier_results"}, {"score": 0.003136952589428254, "phrase": "specific_values"}, {"score": 0.002953711377604328, "phrase": "extreme_values"}, {"score": 0.002931569771634119, "phrase": "zero_or_infinity"}, {"score": 0.002531418327080538, "phrase": "generating_functions"}, {"score": 0.0024196235355517827, "phrase": "two-parameter_family"}, {"score": 0.002365587018070219, "phrase": "classical_eulerian_polynomials"}, {"score": 0.0021775526153883355, "phrase": "urn_model"}, {"score": 0.0021049977753042253, "phrase": "philippe_flajolet"}], "paper_keywords": [""], "paper_abstract": "This paper concerns a relatively new combinatorial structure called staircase tableaux. They were introduced in the context of the asymmetric exclusion process and Askey-Wilson polynomials; however, their purely combinatorial properties have gained considerable interest in the past few years. In this paper we further study combinatorial properties of staircase tableaux. We consider a general model of random staircase tableaux in which symbols (Greek letters) that appear in staircase tableaux may have arbitrary positive weights. (We consider only the case with the parameters u = q = 1.) Under this general model we derive a number of results. Some of our results concern the limiting laws for the number of appearances of symbols in a random staircase tableaux. They generalize and subsume earlier results that were obtained for specific values of the weights. One advantage of our generality is that we may let the weights approach extreme values of zero or infinity, which covers further special cases appearing earlier in the literature. Furthermore, our generality allows us to analyse the structure of random staircase tableaux, and we obtain several results in this direction. One of the tools we use is the generating functions of the parameters of interest. This leads us to a two-parameter family of polynomials, generalizing the classical Eulerian polynomials. We also briefly discuss the relation of staircase tableaux to the asymmetric exclusion process, to other recently introduced types of tableaux, and to an urn model studied by a number of researchers, including Philippe Flajolet.", "paper_title": "Weighted Random Staircase Tableaux", "paper_id": "WOS:000343755200008"}