{"auto_keywords": [{"score": 0.04359507472924844, "phrase": "dtn"}, {"score": 0.01571964376917871, "phrase": "delay-tolerant_networking"}, {"score": 0.0047306971679760175, "phrase": "new_protocol"}, {"score": 0.004550469496119256, "phrase": "realistic_mobility_model"}, {"score": 0.004486640769041646, "phrase": "actual_performance"}, {"score": 0.004439354841093929, "phrase": "mobile_system"}, {"score": 0.0038953958723049287, "phrase": "mobile_models"}, {"score": 0.0035408501923902477, "phrase": "random_obstacle-based_mobility_model"}, {"score": 0.0034299649219748513, "phrase": "real_trajectory"}, {"score": 0.003207108833360533, "phrase": "arbitrary-shape_obstacles"}, {"score": 0.003150900886669123, "phrase": "actual_scene"}, {"score": 0.002988101395789399, "phrase": "mobile_path"}, {"score": 0.0028842551358494823, "phrase": "shortest_path"}, {"score": 0.0027546167254869493, "phrase": "propagation_model"}, {"score": 0.002548331088496964, "phrase": "complete_obstacle_mobility_model"}, {"score": 0.002408052242408488, "phrase": "'opportunistic_network_environment"}, {"score": 0.0023325586335885104, "phrase": "required_extensions"}, {"score": 0.0022276618873985445, "phrase": "new_model"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "When evaluating a new protocol in the network, it is important to use a realistic mobility model to reflect the actual performance of a mobile system. Only the realistic mobility model can better mimic the reality and get more reliable data. However, most existing mobile models of delay-tolerant networking (DTN) move randomly or on the road according to some rules under the environment without obstacles. These mobile models, without considering the impact of obstacles on the node, do not accord with the fact. To address this problem, we propose a random obstacle-based mobility model (ROM) aimed at better simulating the real trajectory of a human for DTN in the presence of obstacles. In this model, we can place arbitrary-shape obstacles in accordance with any actual scene, as well as considering the influence of obstacles on the signal. The mobile path of a node calculated by this node is the shortest path to the destination avoiding certain types of obstacles. In addition, the propagation model contains the attenuation of the signal due to the existence of obstacles. As a result, we have developed a complete obstacle mobility model which is more suitable for studying the performance of the network. We augment the 'opportunistic network environment' (ONE) simulator of DTN with required extensions and show that characteristics of the DTN are very different using the new model than it is under models that ONE currently provides. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "A random obstacle-based mobility model for delay-tolerant networking", "paper_id": "WOS:000295289000005"}