{"auto_keywords": [{"score": 0.0445564014257501, "phrase": "low-level_visual_features"}, {"score": 0.029063297113478832, "phrase": "good_predictor"}, {"score": 0.00481495049065317, "phrase": "feed-forward_model"}, {"score": 0.00470325458481566, "phrase": "goal-oriented_and_free-viewing_tasks"}, {"score": 0.004508661664944657, "phrase": "visual_attention"}, {"score": 0.004383406949799696, "phrase": "five_state-of-the-art_models"}, {"score": 0.003548111729206587, "phrase": "bottom-up_models"}, {"score": 0.0033377940531761985, "phrase": "salient_areas"}, {"score": 0.0030239842475439814, "phrase": "ground_truth"}, {"score": 0.0029260602766930065, "phrase": "proposed_model"}, {"score": 0.0028580564897994175, "phrase": "small_number"}, {"score": 0.0027012086158226456, "phrase": "human_visual_fixations"}, {"score": 0.0023902026696615473, "phrase": "free-viewing_task"}, {"score": 0.0023346234464901978, "phrase": "high-level_visual_task"}, {"score": 0.002196077907454079, "phrase": "complex_visual_scene"}, {"score": 0.0021349310877334378, "phrase": "viewing_duration"}, {"score": 0.0021049977753042253, "phrase": "eye_tracking_experiments"}], "paper_keywords": ["Bottom-up", " saliency", " visual attention"], "paper_abstract": "A purely bottom-up model of visual attention is proposed and compared to five state-of-the-art models. The role of the low-level visual features is examined in two contexts. Two datasets are used: one containing data coming from an eye tracking experiment obtained in a free-viewing task and a second containing 5000 hand-label pictures (observers had to enclose the most visually interesting objects in a rectangle). The relevance of the bottom-up models, i.e., the ability of a model to predict where the salient areas are located, is evaluated. Whatever the metrics and the datasets, the degree of similarity between predictions and ground truth is significantly above chance. The proposed model, resting on a small number of features, is shown to be a good predictor of the human visual fixations but also a good predictor of the objects chosen as interesting by observers. This study suggests that the low-level visual features have a significant role in a free-viewing task but also in a high-level visual task, such as the choice of the object of interest in a complex visual scene. Another outcome concerns the viewing duration used in eye tracking experiments. Results suggest that this parameter is finally not as critical as one would expect.", "paper_title": "Relevance of a Feed-Forward Model of Visual Attention for Goal-Oriented and Free-Viewing Tasks", "paper_id": "WOS:000283445600002"}