{"auto_keywords": [{"score": 0.0338579826762705, "phrase": "new_routes"}, {"score": 0.02575035175663128, "phrase": "zcg"}, {"score": 0.00481495049065317, "phrase": "based_routing_protocol"}, {"score": 0.0047637310731655155, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.004700468701207975, "phrase": "self-configuring_infrastructureless_networks"}, {"score": 0.0046256566852302256, "phrase": "wireless_links"}, {"score": 0.00405743174437322, "phrase": "fault_tolerance"}, {"score": 0.0039608892760521815, "phrase": "emergency_response"}, {"score": 0.003939748053452577, "phrase": "disaster_relief"}, {"score": 0.0038357160878153087, "phrase": "natural_disasters"}, {"score": 0.0035397566487231687, "phrase": "fundamental_research_issue"}, {"score": 0.003364201061591832, "phrase": "best_route"}, {"score": 0.003129553139991608, "phrase": "pure_broadcasting"}, {"score": 0.003055020877549054, "phrase": "substantial_amount"}, {"score": 0.0030225006196735707, "phrase": "intelligent"}, {"score": 0.0028879224619717714, "phrase": "message_collisions"}, {"score": 0.002722935880936231, "phrase": "routing"}, {"score": 0.002708084457786737, "phrase": "parallel_collision"}, {"score": 0.0026294345532129368, "phrase": "distributed_broadcasting_technique"}, {"score": 0.0025394168853656893, "phrase": "redundant_broadcasting"}, {"score": 0.0025056190491986943, "phrase": "path_discovery_process"}, {"score": 0.002472269923319476, "phrase": "high_reachability_ratio"}, {"score": 0.002439363579997196, "phrase": "node_energy_consumption"}, {"score": 0.00234324312505334, "phrase": "reliable_leaders"}, {"score": 0.002299689297293321, "phrase": "plentiful_battery_resources"}, {"score": 0.0022812715029149216, "phrase": "performance_characteristics"}, {"score": 0.0022630008787375435, "phrase": "zcg_protocol"}, {"score": 0.002179679270282842, "phrase": "aodv"}, {"score": 0.0021680003381981338, "phrase": "dsr."}], "paper_keywords": ["Mobile ad hoc networks", " MANET", " AODV", " DSR", " ZCG", " Zone based routing"], "paper_abstract": "Mobile Ad Hoc Networks (MANET) are self-configuring infrastructureless networks of mobile devices connected via wireless links. Each device can send and receive data, but it should also forward traffic unrelated to its own use. All need to maintain their autonomy, and effectively preserve their resources (e.g. battery power). Moreover, they can leave the network at any time. Their intrinsic dynamicity and fault tolerance makes them suitable for applications, such as emergency response and disaster relief, when infrastructure is nonexistent or damaged due to natural disasters, such as earthquakes and flooding, as well as more mundane, day-to-day, uses where their flexibility would be advantageous. Routing is the fundamental research issue for such networks and refers to finding and maintaining routes between nodes. Moreover, it involves selecting the best route where many may be available. However, due to the freedom of movement of nodes, new routes need to be constantly recalculated. Most routing protocols use pure broadcasting to discover new routes, which takes up a substantial amount of bandwidth. Intelligent rebroadcasting reduces these overheads by calculating the usefulness of a rebroadcast, and the likelihood of message collisions. Unfortunately, this introduces latency and parts of the network may become unreachable. This paper discusses the Zone based Routing with Parallel Collision Guided Broadcasting Protocol (ZCG) that uses parallel and distributed broadcasting technique (Basurra et al., 2010) [81 to reduce redundant broadcasting and to accelerate the path discovery process, while maintaining a high reachability ratio as well as keeping node energy consumption low. ZCG uses a one hop clustering algorithm that splits the network into zones led by reliable leaders that are mostly static and have plentiful battery resources. The performance characteristics of the ZCG protocol are established through simulations by comparing it to other well-known routing protocols, namely the: AODV and DSR. It emerges that ZCG performs well under many circumstances. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Energy efficient zone based routing protocol for MANETs", "paper_id": "WOS:000347756400002"}