{"auto_keywords": [{"score": 0.03839353580215102, "phrase": "backoff_parameters"}, {"score": 0.011779419602862622, "phrase": "stable_throughput"}, {"score": 0.009866024889106317, "phrase": "initial_backoff_window_size"}, {"score": 0.00481495049065317, "phrase": "unified_analysis"}, {"score": 0.00471143821939861, "phrase": "throughput"}, {"score": 0.00454254773622547, "phrase": "unified_analytical_framework"}, {"score": 0.004254393078576148, "phrase": "distributed_coordination_function"}, {"score": 0.004028220740657591, "phrase": "unsaturated_or_saturated_conditions"}, {"score": 0.003870009704443373, "phrase": "desired_stable_point"}, {"score": 0.0033451289921748407, "phrase": "undesired_stable_point"}, {"score": 0.0030873424635143045, "phrase": "stable_regions"}, {"score": 0.0030537595549694134, "phrase": "backoff_factor"}, {"score": 0.00289123004877327, "phrase": "basic_access_mechanism"}, {"score": 0.0025633909553815556, "phrase": "delay_analysis"}, {"score": 0.002526261001496249, "phrase": "lower_access_delay"}, {"score": 0.002480602069295564, "phrase": "basic_access_mode"}, {"score": 0.0024625698287060586, "phrase": "unsaturated_networks"}, {"score": 0.0023830293456003765, "phrase": "delay_performance"}, {"score": 0.002272641094287882, "phrase": "second_moments"}, {"score": 0.002256117165288155, "phrase": "access_delay"}, {"score": 0.002105055293254857, "phrase": "w."}], "paper_keywords": ["Stability", " throughput", " delay", " IEEE 802.11 DCF networks", " binary exponential backoff"], "paper_abstract": "In this paper, a unified analytical framework is established to study the stability, throughput, and delay performance of homogeneous buffered IEEE 802.11 networks with Distributed Coordination Function (DCF). Two steady-state operating points are characterized using the limiting probability of successful transmission of Head-of-Line (HOL) packets p given that the network is in unsaturated or saturated conditions. The analysis shows that a buffered IEEE 802.11 DCF network operates at the desired stable point p = p(L) if it is unsaturated. p(L) does not vary with backoff parameters, and a stable throughput can be always achieved at pL. If the network becomes saturated, in contrast, it operates at the undesired stable point p = pA, and a stable throughput can be achieved at pA if and only if the backoff parameters are properly selected. The stable regions of the backoff factor q and the initial backoff window size W are derived, and illustrated in cases of the basic access mechanism and the request-to-send/clear-to-send (RTS/CTS) mechanism. It is shown that the stable regions are significantly enlarged with the RTS/CTS mechanism, indicating that networks in the RTS/CTS mode are much more robust. Nevertheless, the delay analysis further reveals that lower access delay is incurred in the basic access mode for unsaturated networks. If the network becomes saturated, the delay performance deteriorates regardless of which mode is chosen. Both the first and the second moments of access delay at pA are sensitive to the backoff parameters, and shown to be effectively reduced by enlarging the initial backoff window size W.", "paper_title": "A Unified Analysis of IEEE 802.11 DCF Networks: Stability, Throughput, and Delay", "paper_id": "WOS:000322329900009"}