{"auto_keywords": [{"score": 0.008247553597632394, "phrase": "dissociation_energies"}, {"score": 0.004700193486903964, "phrase": "natural_bond"}, {"score": 0.004657867037187835, "phrase": "nbo"}, {"score": 0.0046159158660556985, "phrase": "nuclear_magnetic_resonance"}, {"score": 0.004579728204443819, "phrase": "nicsiso_values"}, {"score": 0.004398457709182882, "phrase": "nucleus-independent_chemical_shifts"}, {"score": 0.004372004407097848, "phrase": "nics"}, {"score": 0.004319566932528865, "phrase": "aromaticity_criterion"}, {"score": 0.0038867458668288557, "phrase": "cl"}, {"score": 0.0038633094721568675, "phrase": "br"}, {"score": 0.003832965535649496, "phrase": "stabilization_energies"}, {"score": 0.0035609154384221567, "phrase": "aromatic_molecules"}, {"score": 0.003423862933454743, "phrase": "magnetic_criteria"}, {"score": 0.0033827600969034873, "phrase": "aromatic_character"}, {"score": 0.0032920678776655783, "phrase": "sigma-delocalized_aromatic_species"}, {"score": 0.003252542052430779, "phrase": "mobius_sigma-aromatic_species"}, {"score": 0.003223208419566199, "phrase": "sigma-aromatic_character"}, {"score": 0.0029351141718104725, "phrase": "halogen_atoms"}, {"score": 0.002779769492357829, "phrase": "corresponding_dissociation_energies"}, {"score": 0.0026727010894851953, "phrase": "nbo_results"}, {"score": 0.002304824112812496, "phrase": "calculated_nicsiso_values"}], "paper_keywords": ["Hybrid-DFT calculations", " Al2F6", " Al2Cl6", " Al2Br6", " Al2I6", " AM1*", " NBO", " NICS"], "paper_abstract": "Natural bond orbital (NBO), nuclear magnetic resonance (NMR) analysis and hybrid-density functional theory based method (B3LYP/Def2-TZVPP) were used to investigate the correlation between the nucleus-independent chemical shifts [NICS, as an aromaticity criterion], sigma (Al(1)-X2(b)) -> sigma*(Al(3)-X4(b)) electron delocalizations and the dissociation energies of Al2F6, Al2Cl6, Al2Br6 and Al2I6 to 2AlX(3) (X = F, Cl, Br, I). The results obtained showed that the dissociation energies of Al2F6, Al2Cl6, Al2Br6 and Al2I6 decrease from Al2F6 to Al2I6. Like aromatic molecules, these compounds have relatively significant negative NICSiso(0) values. Clearly, based on magnetic criteria, they exhibit aromatic character and make it possible to consider them as sigma-delocalized aromatic species, such as Mobius sigma-aromatic species. The sigma-aromatic character which is demonstrated by their NICSiso(0) values decreases from Al2F6 to Al2I6. The NICSiso values are dominated by the in-plane sigma(22) (i.e., sigma(yy,) the plane containing halogen atoms bridged) chemical shift components. The increase of the NICSiso values explains significantly the decrease of the corresponding dissociation energies of Al2F6, Al2Cl6, Al2Br6 and Al2I6. Importantly, the NBO results suggest that in these compounds the dissociation energies are controlled by the stabilization energies associated with sigma (Al(1)-X2(b)) ->sigma*(Al(3)-X4(b)) electron delocalizations. The decrease of the stabilization energies associated with sigma (Al(1)-X2(b)) ->sigma*(Al(3)-X4(b)) electron delocalizations is in accordance with the variation of the calculated NICSiso values. The correlations between the dissociation energies of Al2F6, Al2Cl6, Al2Br6 and Al2I6, sigma (Al(1)-X2(b)) ->sigma*(Al(3)-X4(b)) electron delocalizations, natural atomic orbitals (NAOs) and NICSiso values have been investigated.", "paper_title": "Natural bond orbital, nuclear magnetic resonance analysis and hybrid-density functional theory study of sigma-aromaticity in Al2F6, Al2Cl6, Al2Br6 and Al2I6", "paper_id": "WOS:000319362500039"}