{"auto_keywords": [{"score": 0.03137710218489095, "phrase": "pre-drawn_use-case_diagram"}, {"score": 0.015719716506582538, "phrase": "attack_trees"}, {"score": 0.015605952122804403, "phrase": "misuse_cases"}, {"score": 0.004744748477093856, "phrase": "security_threat_identification"}, {"score": 0.004473982381245469, "phrase": "requirements_analysis_stage"}, {"score": 0.004408729661992651, "phrase": "industrial_take-up"}, {"score": 0.004157058883925715, "phrase": "controlled_experiments"}, {"score": 0.004081385289516914, "phrase": "early_elicitation"}, {"score": 0.004051501401100304, "phrase": "security_threats"}, {"score": 0.004021835438784141, "phrase": "namely_attack_trees"}, {"score": 0.00373682045166829, "phrase": "latin-squares_design"}, {"score": 0.0036553070575015344, "phrase": "task_order"}, {"score": 0.003615217162972726, "phrase": "dependent_variables"}, {"score": 0.0031786562062819327, "phrase": "post-task_questionnaire"}, {"score": 0.0030414140732789186, "phrase": "second_experiment"}, {"score": 0.0028153046221865365, "phrase": "first_experiment"}, {"score": 0.0026446021865907197, "phrase": "finding_threats"}, {"score": 0.002502576987281976, "phrase": "similar_opinions"}, {"score": 0.0022575078732617678, "phrase": "broader_range"}, {"score": 0.002224510044064184, "phrase": "additional_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Security requirements", " Security modelling", " Security threat identification", " Misuse cases", " Attack trees", " Experiments"], "paper_abstract": "A number of methods have been proposed or adapted to include security in the requirements analysis stage, but the industrial take-up has been limited and there are few empirical and comparative evaluations. This paper reports on a pair of controlled experiments that compared two methods for early elicitation of security threats, namely attack trees and misuse cases. The 28 and 35 participants in the two experiments solved two threat identification tasks individually by means of the two techniques, using a Latin-Squares design to control for technique and task order. The dependent variables were effectiveness of the techniques measured as the number of threats found, coverage of the techniques measured in terms of the types of threats found and perceptions of the techniques measured through a post-task questionnaire based on the Technology Acceptance Model. The only difference was that, in the second experiment, the participants were given a pre-drawn use-case diagram to use as a starting point for solving the tasks. In the first experiment, no pre-drawn use-case diagram was provided. The main finding was that attack trees were more effective for finding threats, in particular when there was no pre-drawn use-case diagram. However, the participants had similar opinions of the two techniques, and perception of a technique was not correlated with performance with that technique. The study underlines the need for further comparisons in a broader range of settings involving additional techniques, and it suggests several concrete experiments and other paths for further work. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Experimental comparison of attack trees and misuse cases for security threat identification", "paper_id": "WOS:000264648200008"}