{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "spatio-temporal_evolution"}, {"score": 0.004583579470330216, "phrase": "complex_networks"}, {"score": 0.004435514622798228, "phrase": "formal_models"}, {"score": 0.004199247711875386, "phrase": "graph-based_model"}, {"score": 0.003485824905231454, "phrase": "dependency_relations"}, {"score": 0.003318108914777263, "phrase": "different_properties"}, {"score": 0.0032107911131811057, "phrase": "emerging_properties"}, {"score": 0.0031240075437664314, "phrase": "local_and_global_levels"}, {"score": 0.0026942333853202556, "phrase": "local_level"}, {"score": 0.002664850766529523, "phrase": "global_properties"}, {"score": 0.002260591903283384, "phrase": "possible_routes"}, {"score": 0.002163535133532765, "phrase": "modelling_approach"}, {"score": 0.0021049977753042253, "phrase": "case_study"}], "paper_keywords": ["spatio-temporal information", " graph theory"], "paper_abstract": "Evolving entities in space and time generate complex networks whose structural properties require the development of formal models. The research presented in this paper introduces a graph-based model whose objective is to retain the semantic of these networks. Entities are related at a given time, through space according to the locations they occupy, and across time according to some dependency relations. We propose an approach that characteristics these different properties using several graphs, and where emerging properties are analysed at the local and global levels. This allows for a manipulation of these spatial, spatio-temporal, and temporal graphs using neighbourhood, descendant and ancestor operations at the local level. Global properties are studied according to the way two given entities in one of these graphs are related according to the way two given entities in one of these graphs are related according to the possible routes between them. The principles of the modelling approach are illustrated by a case study of the propagation of brambles.", "paper_title": "A Graph Model for Spatio-temporal Evolution", "paper_id": "WOS:000282703500006"}