{"auto_keywords": [{"score": 0.04951738916270167, "phrase": "protein_sequences"}, {"score": 0.012225099493657163, "phrase": "amino_acids"}, {"score": 0.00481495049065317, "phrase": "quantitative_association_rules"}, {"score": 0.004329630571352367, "phrase": "still_many_things"}, {"score": 0.0040097139701644165, "phrase": "amino_acid_sequences"}, {"score": 0.0031845067058084583, "phrase": "different_amino_acids"}, {"score": 0.0026986685585382347, "phrase": "protein_composition"}, {"score": 0.0025436978068459565, "phrase": "global_interactions"}, {"score": 0.002498961351132696, "phrase": "particular_sets"}, {"score": 0.0023694065215394593, "phrase": "strong_non-trivial_associations"}, {"score": 0.0021049977753042253, "phrase": "in-vitro_synthesis"}], "paper_keywords": ["data mining", " quantitative association rule mining", " protein composition"], "paper_abstract": "Lot of research has gone into understanding the composition and nature of proteins, still many things remain to be understood satisfactorily. It is now generally believed that amino acid sequences of proteins are not random, and thus the patterns of amino acids that we observe in the protein sequences are also non-random. In this study, we have attempted to decipher the nature of associations between different amino acids that are present in a protein. This very basic analysis provides insights into the co-occurrence of certain amino acids in a protein. Such association rules are desirable for enhancing our understanding of protein composition and hold the potential to give clues regarding the global interactions amongst some particular sets of amino acids occuring in proteins. Presence of strong non-trivial associations suggests further evidence for non-randomness of protein sequences. Knowledge of these rules or constraints is highly desirable for the in-vitro synthesis of artificial proteins.", "paper_title": "Mining quantitative association rules in protein sequences", "paper_id": "WOS:000236545100021"}