{"auto_keywords": [{"score": 0.04957786067961377, "phrase": "uncertain_linguistic_information"}, {"score": 0.008713768692145006, "phrase": "enterprise_strategic_crisis_management"}, {"score": 0.007846205614143393, "phrase": "linguistic_labels"}, {"score": 0.005940030394900297, "phrase": "probabilistic_information"}, {"score": 0.004265953661191515, "phrase": "new_decision_analysis"}, {"score": 0.0034193226278107346, "phrase": "wa_operator"}, {"score": 0.0033656939626264186, "phrase": "owa"}, {"score": 0.0030935140058168885, "phrase": "uncertain_information"}, {"score": 0.0028734230458881903, "phrase": "attitudinal_character"}, {"score": 0.002828331235643921, "phrase": "decision_maker"}, {"score": 0.002740253546178098, "phrase": "alternative_appraisal_values"}, {"score": 0.002266364679369248, "phrase": "illustrative_example"}, {"score": 0.0021498955164659145, "phrase": "developed_approach"}], "paper_keywords": ["Decision making", " uncertain linguistic information", " probabilistic", " generalized probabilistic uncertain linguistic weighted average (GP-ULWA) operator", " generalized probabilistic uncertain linguistic ordered weighted average (GP-ULOWA) operator", " enterprise strategic crisis management"], "paper_abstract": "With respect to decision making problems by using probabilities and information that can be represented with linguistic labels, some new decision analysis is proposed. Firstly, we shall develop two new aggregation operators: generalized probabilistic uncertain linguistic weighted average (GP-ULWA) operator and generalized probabilistic uncertain linguistic ordered weighted average (GP-ULOWA) operator. These operators use the WA operator, the OWA operator, uncertain linguistic information and probabilistic information. They are quite useful because they can assess the uncertain information within the problem by using both linguistic labels and the probabilistic information that considers the attitudinal character of the decision maker. In these approaches, alternative appraisal values are calculated by the aggregation of uncertain linguistic information. Thus, the ranking of alternative or selection of the most desirable alternative(s) is obtained by the comparison of uncertain linguistic information. Finally, we give an illustrative example for evaluating the enterprise strategic crisis management with uncertain linguistic information to verify the developed approach and to demonstrate its feasibility and practicality.", "paper_title": "An approach to evaluating the enterprise strategic crisis management with uncertain linguistic information", "paper_id": "WOS:000351140600002"}