{"auto_keywords": [{"score": 0.036850747740990404, "phrase": "exit_gradient"}, {"score": 0.02322730111336098, "phrase": "hydraulic_structures"}, {"score": 0.01731146281922694, "phrase": "uplift_force"}, {"score": 0.007948097042726305, "phrase": "seepage_losses"}, {"score": 0.0076305277955899965, "phrase": "downstream_end"}, {"score": 0.007355498292026518, "phrase": "downstream_floor"}, {"score": 0.004775726266706856, "phrase": "different_sheetpile_configurations"}, {"score": 0.004698229304089357, "phrase": "canal_banks"}, {"score": 0.004364696693320128, "phrase": "computer_model"}, {"score": 0.004293840838533456, "phrase": "finite_element_method"}, {"score": 0.004206879557938045, "phrase": "different_configurations"}, {"score": 0.003924121879214595, "phrase": "transverse_extension"}, {"score": 0.0028862761537904206, "phrase": "insignificant_effect"}, {"score": 0.002541910967437926, "phrase": "latter_sheetpile_extended_few_meters"}, {"score": 0.002275557501858879, "phrase": "present_study"}, {"score": 0.0022477377970612847, "phrase": "two-dimensional_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hydraulic structures", " Weirs", " Barrages", " Dams", " Sheetpile configurations"], "paper_abstract": "This research investigated seepage under hydraulic structures considering flow through the banks of the canal. A computer model, utilizing the finite element method, was used. Different configurations of sheetpile driven under the floor of the structure were studied. Results showed that the transverse extension of sheetpile, driven at the middle of the floor, into the banks of the canal had very little effect on seepage losses, uplift force, and on the exit gradient at the downstream end of the floor. Likewise, confining the downstream floor with sheetpile from three sides was not found effective. When the downstream floor was confined with sheetpile from all sides, this has significantly reduced the exit gradient. Furthermore, all the different configurations of the sheetpile had insignificant effect on seepage losses. The most effective configuration of the sheetpile was the case when two rows of sheetpiles were driven at the middle and at the downstream end of the floor, with the latter sheetpile extended few meters into the banks of the canal. This case has significantly reduced the exit gradient and caused only slight increase in the uplift force when compared to other sheetpile configurations. The present study suggests that two-dimensional analysis of seepage problems underestimates the exit gradient and uplift force on hydraulic structures. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Design of hydraulic structures considering different sheetpile configurations and flow through canal banks", "paper_id": "WOS:000291120100015"}