{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "security_notions"}, {"score": 0.004777034835192062, "phrase": "probabilistic_private-key_encryption"}, {"score": 0.004683540676363745, "phrase": "precise_definitions"}, {"score": 0.00450198136261303, "phrase": "detailed_understanding"}, {"score": 0.0043790755286923794, "phrase": "major_area"}, {"score": 0.0043103495043308755, "phrase": "modern_cryptography"}, {"score": 0.004143196873246147, "phrase": "private-key_encryption"}, {"score": 0.004046020290832207, "phrase": "public-key_setting"}, {"score": 0.003522749900725601, "phrase": "adversary's_ability"}, {"score": 0.0033860360186761533, "phrase": "challenge_ciphertext"}, {"score": 0.00316565009987584, "phrase": "complete_hierarchy"}, {"score": 0.002556109032208553, "phrase": "one-way_functions"}, {"score": 0.0024960634897058394, "phrase": "encryption_schemes"}, {"score": 0.002370748155770563, "phrase": "adaptive_chosen-plaintext_attack"}, {"score": 0.0022876877275935757, "phrase": "non-adaptive_chosen-plaintext_attack"}, {"score": 0.0021049977753042253, "phrase": "computational_and_information-theoretic_notions"}], "paper_keywords": ["private-key encryptions", " definitions"], "paper_abstract": "The development of precise definitions of security for encryption, as well as a detailed understanding of their relationships, has been a major area of research in modern cryptography. Here, we focus on the case of private-key encryption. Extending security notions from the public-key setting, we define security in the sense of both indistinguishability and non-malleability against chosen-plaintext and chosen-ciphertext attacks, considering both non-adaptive (i.e., \"lunchtime\") and adaptive oracle access (adaptive here refers to an adversary's ability to interact with a given oracle even after viewing the challenge ciphertext). We then characterize the 18 resulting security notions in two ways. First, we construct a complete hierarchy of security notions; that is, for every pair of definitions we show whether one definition is stronger than the other, whether the definitions are equivalent, or whether they are incomparable. Second, we partition these notions of security into two classes (computational or information-theoretic) depending on whether one-way functions are necessary in order for encryption schemes satisfying the definition to exist. Perhaps our most surprising result is that security against adaptive chosen-plaintext attack is (polynomially) equivalent to security against non-adaptive chosen-plaintext attack. On the other hand, the ability of an adversary to mount a (non-adaptive) chosen-plaintext attack is the key feature distinguishing computational and information-theoretic notions of security. These results hold for all security notions considered here.", "paper_title": "Characterization of security notions for probabilistic private-key encryption", "paper_id": "WOS:000234310800003"}