{"auto_keywords": [{"score": 0.04012556376962369, "phrase": "epid"}, {"score": 0.03755523031941763, "phrase": "blac"}, {"score": 0.03453405396039582, "phrase": "revocation_list"}, {"score": 0.03276627772070042, "phrase": "perea"}, {"score": 0.00481495049065317, "phrase": "anonymous_users"}, {"score": 0.004677965073019951, "phrase": "misbehaving_user's_ability"}, {"score": 0.0046276016230633495, "phrase": "future_accesses"}, {"score": 0.004479726755921316, "phrase": "powerful_trusted_third_parties"}, {"score": 0.004305364955542171, "phrase": "users'_connections"}, {"score": 0.004213123914295882, "phrase": "users'_anonymity"}, {"score": 0.003991040678278726, "phrase": "recent_schemes"}, {"score": 0.003948043391567917, "phrase": "blacklistable_anonymous_credentials"}, {"score": 0.003766991006640731, "phrase": "enhanced_revocation\"-servers"}, {"score": 0.003726398477619122, "phrase": "misbehaving_users"}, {"score": 0.0036862417490612673, "phrase": "ttp's_involvement"}, {"score": 0.0036072171658966348, "phrase": "revoked_users'_identities"}, {"score": 0.0029893477597041493, "phrase": "bottleneck_computation"}, {"score": 0.002852134080296829, "phrase": "time_complexity"}, {"score": 0.002750874355974879, "phrase": "revocation_window"}, {"score": 0.002672454243212711, "phrase": "subsequent_authentications"}, {"score": 0.002634084319025334, "phrase": "user's_misbehavior"}], "paper_keywords": ["Algorithms", " Security", " Privacy", " anonymous authentication", " usermisbehavior", " anonymous blacklisting", " privacy-enhanced revocation"], "paper_abstract": "Several anonymous authentication schemes allow servers to revoke a misbehaving user's ability to make future accesses. Traditionally, these schemes have relied on powerful Trusted Third Parties (TTPs) capable of deanonymizing ( or linking) users' connections. Such TTPs are undesirable because users' anonymity is not guaranteed, and users must trust them to judge misbehaviors fairly. Recent schemes such as Blacklistable Anonymous Credentials (BLAC) and Enhanced Privacy ID (EPID) support \"privacy- enhanced revocation\"-servers can revoke misbehaving users without a TTP's involvement, and without learning the revoked users' identities. In BLAC and EPID, however, the computation required for authentication at the server is linear in the size ( L) of the revocation list, which is impractical as the size approaches thousands of entries. We propose PEREA, a new anonymous authentication scheme for which this bottleneck computation is independent of the size of the revocation list. Instead, the time complexity of authentication is linear in the size of a revocation window K << L, the number of subsequent authentications before which a user's misbehavior must be recognized if the user is to be revoked. We extend PEREA to support more complex revocation policies that take the severity of misbehaviors into account. Users can authenticate anonymously if their naughtiness, i.e., the sum of the severities of their blacklisted misbehaviors, is below a certain naughtiness threshold. We call our extension PEREA-Naughtiness. We prove the security of our constructions, and validate their efficiency as compared to BLAC analytically and quantitatively.", "paper_title": "PEREA: Practical TTP-Free Revocation of Repeatedly Misbehaving Anonymous Users", "paper_id": "WOS:000298673600002"}