{"auto_keywords": [{"score": 0.049014830901543946, "phrase": "aircraft_turnaround_simulator"}, {"score": 0.014221965119404762, "phrase": "agent-oriented_requirements"}, {"score": 0.00481495049065317, "phrase": "agent_paradigm"}, {"score": 0.004500891637057374, "phrase": "research_results"}, {"score": 0.004400804926266097, "phrase": "technology_transfer_exercise"}, {"score": 0.004254814649568355, "phrase": "industry_partner"}, {"score": 0.00357395617690842, "phrase": "systematic_methods"}, {"score": 0.0035339597999254064, "phrase": "agent-oriented_requirements_elicitation"}, {"score": 0.0033218213825698417, "phrase": "prescribed_deliverables"}, {"score": 0.002918394200972564, "phrase": "agent-oriented_models"}, {"score": 0.0027741761880779535, "phrase": "complete_requirements_package"}, {"score": 0.0021049977753042253, "phrase": "repeatable_manner"}], "paper_keywords": ["Agent", " oriented software engineering", " agent-oriented modelling", " technology transfer"], "paper_abstract": "In this paper, we describe research results arising from a technology transfer exercise on agent-oriented requirements engineering with an industry partner. We introduce two improvements to the state-of-the-art in agent-oriented requirements engineering, designed to mitigate two problems experienced by ourselves and our industry partner: (1) the lack of systematic methods for agent-oriented requirements elicitation and modelling; and (2) the lack of prescribed deliverables in agent-oriented requirements engineering. We discuss the application of our new approach to an aircraft turnaround simulator built in conjunction with our industry partner, and show how agent-oriented models can be derived and used to construct a complete requirements package. We evaluate this by having three independent people design and implement prototypes of the aircraft turnaround simulator, and comparing the three prototypes. Our evaluation indicates that our approach is effective at delivering correct, complete, and consistent requirements that satisfy the stakeholders, and can be used in a repeatable manner to produce designs and implementations. We discuss lessons learnt from applying this approach.", "paper_title": "Requirements Elicitation and Specification Using the Agent Paradigm: The Case Study of an Aircraft Turnaround Simulator", "paper_id": "WOS:000343899100005"}