{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "video_digital_libraries"}, {"score": 0.021345884714353898, "phrase": "users'_criteria"}, {"score": 0.008118050156866412, "phrase": "coding_scheme"}, {"score": 0.004761253507368234, "phrase": "important_features"}, {"score": 0.004708152527097594, "phrase": "users'_responses"}, {"score": 0.004673079747693193, "phrase": "purpose_-_the_purpose"}, {"score": 0.004518442937844318, "phrase": "user-centred_analysis"}, {"score": 0.004256005669252138, "phrase": "study_participants"}, {"score": 0.003934456513187142, "phrase": "open-ended_responses"}, {"score": 0.003876010646939676, "phrase": "content_analysis"}, {"score": 0.0036507498735369576, "phrase": "simple_and_weighted_frequencies"}, {"score": 0.003569681826459428, "phrase": "ranked_set"}, {"score": 0.003516712900501414, "phrase": "cohen"}, {"score": 0.003387431241133385, "phrase": "inter-coder_reliability"}, {"score": 0.0030963190575539574, "phrase": "emergent_coding_method"}, {"score": 0.003073216350080926, "phrase": "continuous_refinements"}, {"score": 0.0028944757265206332, "phrase": "\"retrieval_functionality"}, {"score": 0.0025868090345615197, "phrase": "primary_research_contribution"}, {"score": 0.00244543519230361, "phrase": "future_studies"}, {"score": 0.0023554947277883535, "phrase": "initial_design_stages"}, {"score": 0.0023031224517224757, "phrase": "targeted_evaluations"}, {"score": 0.0022434880661725493, "phrase": "digital_libraries"}, {"score": 0.0022018377054878534, "phrase": "non-visual_contexts"}, {"score": 0.0021049977753042253, "phrase": "users'_experiences"}], "paper_keywords": ["Human computer interaction", " User criteria", " User interfaces", " Video digital libraries Paper type Research paper"], "paper_abstract": "Purpose - The purpose of this paper is to report on a user-centred analysis of video digital libraries and to present users' criteria based on concepts emerging directly from the responses of study participants. As a time-based and multi-channeled format, video warrants considerations for information delivery through interactive tools such as digital libraries. Design/methodology/approach - A survey method was used to collect open-ended responses from participants. Content analysis was performed on the responses, and categories then emerged to form the coding scheme where simple and weighted frequencies were calculated to obtain a ranked set of users' criteria. Cohen's. was 0.87, indicative of high-level of inter-coder reliability. In the end, 81 participants contributed a total of 385 open-ended responses, which were all then analysed and coded. Findings - The emergent coding method and continuous refinements to the coding scheme ultimately produced 28 criteria (subcategories) under four primary categories. Criteria corresponding to \"retrieval functionality\" of video digital libraries emerged as the highest, or most frequently referenced, primary category, while the \"user interface\", \"collection qualities\", and \"user support\" followed, respectively. Research limitations/implications - The primary research contribution is a baseline for video digital libraries that can be applicable throughout design and evaluation. Future studies can utilise findings presented here as guidance for the initial design stages and/or for assessing systems via targeted evaluations. Originality/value - While users' criteria of digital libraries have been analysed from non-visual contexts, they have not been directly assessed as they pertain to users' experiences and perceptions with video, which is needed as the nature and structure of video can influence users and use.", "paper_title": "Design criteria for video digital libraries Categories of important features emerging from users' responses", "paper_id": "WOS:000354652400006"}