{"auto_keywords": [{"score": 0.03718034097391595, "phrase": "lu"}, {"score": 0.035808583882404765, "phrase": "acknowledgment_timings"}, {"score": 0.025072096536657096, "phrase": "achievable_rate"}, {"score": 0.00481495049065317, "phrase": "nrl_network_pump"}, {"score": 0.004773692073488661, "phrase": "mitigating_covert_timing_channels"}, {"score": 0.0044369056710423065, "phrase": "covert_channels"}, {"score": 0.004249957578636515, "phrase": "high_user"}, {"score": 0.0042136320589484305, "phrase": "hu"}, {"score": 0.004106063237069123, "phrase": "low_user"}, {"score": 0.0036395944934310524, "phrase": "covert_timing_channel"}, {"score": 0.0031982609080278643, "phrase": "communication_system"}, {"score": 0.0030501665085457606, "phrase": "upper_bound"}, {"score": 0.0029722900280316216, "phrase": "covert_channel"}, {"score": 0.0027503564589458837, "phrase": "directed_information_flow"}, {"score": 0.0026116610153271943, "phrase": "achievable_scheme"}], "paper_keywords": ["Information-theoretic bounds", " network security", " NRL network pump", " queueing theory", " timing channels"], "paper_abstract": "The Naval Research Laboratory (NRL) Network Pump, or Pump, is a standard for mitigating covert channels that arise in a multilevel secure (MLS) system when a high user (HU) sends acknowledgements to a low user (LU). The issue here is that HU can encode information in the \"timings\" of the acknowledgements. The Pump aims at mitigating the covert timing channel by introducing buffering between HU and LU, as well as adding noise to the acknowledgment timings. We model the working of the Pump in certain situations, as a communication system with feedback and use then this perspective to derive an upper bound on the capacity of the covert channel between HU and LU in the Pump. This upper bound is presented in terms of a directed information flow over the dynamics of the system. We also present an achievable scheme that can transmit information over this channel. When the support of the noise added by Pump to acknowledgment timings is finite, the achievable rate is nonzero, i.e., infinite number of bits can be reliably communicated. If the support of the noise is infinite, the achievable rate is zero and hence a finite number of bits can be communicated.", "paper_title": "Characterizing the Efficacy of the NRL Network Pump in Mitigating Covert Timing Channels", "paper_id": "WOS:000299438100007"}