{"auto_keywords": [{"score": 0.04051211375775462, "phrase": "pricing_process"}, {"score": 0.03726682411720791, "phrase": "new_product"}, {"score": 0.03348243005934554, "phrase": "fuzzy_logic"}, {"score": 0.028964411436954378, "phrase": "fuzzy_expert_system"}, {"score": 0.00481495049065317, "phrase": "new_product_pricing"}, {"score": 0.004501774379030109, "phrase": "data_uncertainty"}, {"score": 0.0043738432231020885, "phrase": "important_industrial_challenge"}, {"score": 0.004069631519385246, "phrase": "meanwhile_the_other_factors"}, {"score": 0.0039729853486821995, "phrase": "firm's_strategy"}, {"score": 0.0029914213495838998, "phrase": "complicated_systems"}, {"score": 0.0025644240336018045, "phrase": "brief_introduction"}, {"score": 0.0023972750359328235, "phrase": "humans_reasoning"}, {"score": 0.00236289633510808, "phrase": "pricing_factors"}, {"score": 0.0022302306304023602, "phrase": "appropriate_price"}, {"score": 0.002166711569953301, "phrase": "related_parameters"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["New product", " Pricing factors", " Fuzzy logic", " Fuzzy expert system"], "paper_abstract": "This paper is focused on the representation and treatment of knowledge and data uncertainty within the context of an important industrial challenge, i.e., new product pricing. The most well known participating factor in pricing process is cost meanwhile the other factors like customer value and firm's strategy should be considered in the pricing process, as well. Besides, there are other important factors like the risks that consumer bear in purchasing new product which must be carefully analyzed and considered. Nonetheless, many of these factors are blended with uncertainty. In recent decades, fuzzy logic was well developed and implemented in many applications to treat vagueness in complicated systems. Finding the pricing process a critical and complicated process which includes many vague parameters, we tried to design a fuzzy expert system to cope with this challenge. In this paper, after a brief introduction of fuzzy logic which has revealed a methodology to work with uncertainty and imitate humans reasoning, the pricing factors are introduced. Then a fuzzy expert system is designed to find the appropriate price of the new product considering the related parameters. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Fuzzy expert systems and challenge of new product pricing", "paper_id": "WOS:000264037900011"}