{"auto_keywords": [{"score": 0.04974633013174414, "phrase": "landmark_images"}, {"score": 0.00481495049065317, "phrase": "exploitation_and_exploration_balanced_hierarchical_summary"}, {"score": 0.004682525167261325, "phrase": "significant_progress"}, {"score": 0.00464998919563789, "phrase": "image_understanding"}, {"score": 0.004522080178250592, "phrase": "ultimate_goal"}, {"score": 0.0043367547691560175, "phrase": "open_challenge"}, {"score": 0.0038116231917604054, "phrase": "different_parts"}, {"score": 0.0035920758080335655, "phrase": "common_request"}, {"score": 0.003444732262403694, "phrase": "existing_systems"}, {"score": 0.00293361812353423, "phrase": "hierarchical_summary"}, {"score": 0.0027838831266525773, "phrase": "hierarchical_summary_construction"}, {"score": 0.0026051114364288126, "phrase": "intrinsic_concept"}, {"score": 0.0024548872075607687, "phrase": "new_objective_function"}, {"score": 0.002289180040240783, "phrase": "optimal_hierarchical_summary"}, {"score": 0.0021646872269755067, "phrase": "best_objective_score"}, {"score": 0.0021496083700137305, "phrase": "extensive_quantitative_experimental_results"}, {"score": 0.0021346343252001488, "phrase": "comprehensive_user_studies"}, {"score": 0.0021049977753042253, "phrase": "optimized_hierarchical_summary"}], "paper_keywords": ["Content-based retrieval"], "paper_abstract": "While we have made significant progress over image understanding and search, how to meet the ultimate goal of satisfying both exploration and exploitation in one single system is still an open challenge. In the context of landmark images, it means that a system should not only be able to help users to quickly locate the photo they are interested in (exploitation), but also to discover different parts of the landmark which have never been seen before (exploration), which is a common request as evidenced by many recent multimedia studies. To the best of our knowledge, existing systems mainly focus on either exploration (e.g., photo browsing) or exploitation (e.g., representative photo identification), while users' need of exploration and exploitation is dynamically mixed. In this paper, we tackle the challenge by organizing landmark images into a hierarchical summary which gives user the flexibility of conducting both exploration and exploitation. In the hierarchical summary construction, we introduce two principles: the coherence principle and the diversity principle. Behind these two principles, the intrinsic concept is \"detail-level,\" which measures how much detail that an image reflects for a certain landmark. A new objective function is derived from the definition of both exploration and exploitation experience on detail-level. The problem of finding an optimal hierarchical summary is formulated as searching over a space of trees for the one that achieves the best objective score. Extensive quantitative experimental results and comprehensive user studies show that the optimized hierarchical summary is able to satisfy both experiences simultaneously.", "paper_title": "Exploitation and Exploration Balanced Hierarchical Summary for Landmark Images", "paper_id": "WOS:000361685400008"}