{"auto_keywords": [{"score": 0.037788297483525975, "phrase": "knowledge_base"}, {"score": 0.015719716506582538, "phrase": "bibliographic_citations"}, {"score": 0.009524694865678618, "phrase": "bibliographic_data"}, {"score": 0.004195418010131832, "phrase": "specific_delimiters"}, {"score": 0.004136548839735555, "phrase": "particular_citation_style"}, {"score": 0.004049783994776266, "phrase": "high_degree"}, {"score": 0.0037868092509097404, "phrase": "previous_methods"}, {"score": 0.003681238363808568, "phrase": "user-driven_training"}, {"score": 0.0035283552859817764, "phrase": "existing_set"}, {"score": 0.003503497128638099, "phrase": "sample_metadata_records"}, {"score": 0.0028437313714204087, "phrase": "different_fields"}, {"score": 0.0027741761880779535, "phrase": "precision_and_recall_levels"}, {"score": 0.0026967596578196325, "phrase": "perfect_extraction"}, {"score": 0.0026682872124177233, "phrase": "large_majority"}, {"score": 0.002548331088496964, "phrase": "state-of-the-art_information-extraction_method"}, {"score": 0.002316105585203396, "phrase": "extraction_process"}, {"score": 0.0022997683233147125, "phrase": "flux-cim"}, {"score": 0.002127472359795555, "phrase": "good_extraction_results"}], "paper_keywords": [""], "paper_abstract": "In this article we present FLUX-CiM, a novel method for extracting components (e.g., author names, article titles, venues, page numbers) from bibliographic citations. Our method does not rely on patterns encoding specific delimiters used in a particular citation style. This feature yields a high degree of automation and flexibility, and allows FLUX-CiM to extract from citations in any given format. Differently from previous methods that are based on models learned from user-driven training, our method relies on a knowledge base automatically constructed from an existing set of sample metadata records from a given field (e.g., computer science, health sciences, social sciences, etc.). These records are usually available on the Web or other public data repositories. To demonstrate the effectiveness and applicability of our proposed method, we present a series of experiments in which we apply it to extract bibliographic data from citations in articles of different fields. Results of these experiments exhibit precision and recall levels above 94% for all fields, and perfect extraction for the large majority of citations tested. In addition, in a comparison against a state-of-the-art information-extraction method, ours produced superior results without the training phase required by that method. Finally, we present a strategy for using bibliographic data resulting from the extraction process with FLUX-CiM to automatically update and expand the knowledge base of a given domain. We show that this strategy can be used to achieve good extraction results even if only a very small initial sample of bibliographic records is available for building the knowledge base.", "paper_title": "A Flexible Approach for Extracting Metadata From Bibliographic Citations", "paper_id": "WOS:000266303800006"}