{"auto_keywords": [{"score": 0.03968485176774296, "phrase": "quantifier-free_interpolants"}, {"score": 0.015719716506582538, "phrase": "quantifier-free_interpolation"}, {"score": 0.0045318666714939905, "phrase": "model_checking"}, {"score": 0.00443308765153716, "phrase": "enabling_technology"}, {"score": 0.004360412703519539, "phrase": "fast_and_robust_verification"}, {"score": 0.0034024277222012597, "phrase": "skolemized_version"}, {"score": 0.0033465923623290034, "phrase": "extensional_theory"}, {"score": 0.0025678829712650437, "phrase": "interpolating_procedure"}, {"score": 0.002470547930651519, "phrase": "array_updates"}, {"score": 0.00240328454980006, "phrase": "rewriting_techniques"}, {"score": 0.002337848196418384, "phrase": "key_steps"}, {"score": 0.0021049977753042253, "phrase": "first_successful_attempt"}], "paper_keywords": ["Amalgamation", " Modular constraints", " Interpolating metarules"], "paper_abstract": "The use of interpolants in model checking is becoming an enabling technology to allow fast and robust verification of hardware and software. The application of encodings based on the theory of arrays, however, is limited by the impossibility of deriving quantifier-free interpolants in general. In this paper, we show that it is possible to obtain quantifier-free interpolants for a Skolemized version of the extensional theory of arrays. We prove this in two ways: (1) non-constructively, by using the model theoretic notion of amalgamation, which is known to be equivalent to admit quantifier-free interpolation for universal theories; and (2) constructively, by designing an interpolating procedure, based on solving equations between array updates. (Interestingly, rewriting techniques are used in the key steps of the solver and its proof of correctness.) To the best of our knowledge, this is the first successful attempt of computing quantifier-free interpolants for a variant of the theory of arrays with extensionality.", "paper_title": "QUANTIFIER-FREE INTERPOLATION OF A THEORY OF ARRAYS", "paper_id": "WOS:000307646300004"}