{"auto_keywords": [{"score": 0.04274518365190482, "phrase": "sensor_error"}, {"score": 0.04135205133273676, "phrase": "interstitial_glucose_kinetics"}, {"score": 0.00481495049065317, "phrase": "glucose_sensor_error_components"}, {"score": 0.00443308765153716, "phrase": "cgm_readings"}, {"score": 0.004283019592801715, "phrase": "standard_fingerprick_blood_glucose"}, {"score": 0.004152288616186981, "phrase": "unavoidable_random_measurement_noise"}, {"score": 0.0038624981944755813, "phrase": "sensor_calibration_process"}, {"score": 0.003822778117250714, "phrase": "quantitative_assessment"}, {"score": 0.0036177098964897364, "phrase": "paramount_importance"}, {"score": 0.003555902292752528, "phrase": "cgm-based_applications"}, {"score": 0.0034593827783370927, "phrase": "ap"}, {"score": 0.003353521531649663, "phrase": "present_paper"}, {"score": 0.0030554300179552415, "phrase": "artificial_pancreas_studies"}, {"score": 0.0029620573986902416, "phrase": "recently_presented_\"fourth\"_generation"}, {"score": 0.0029416973901327925, "phrase": "dexcom_cgm"}, {"score": 0.0025361866386341796, "phrase": "error_model"}, {"score": 0.0024501740852758505, "phrase": "bg_samples"}, {"score": 0.0023426936553484524, "phrase": "technological_innovations"}, {"score": 0.002286781334850213, "phrase": "average_mean_absolute_relative_difference"}], "paper_keywords": ["Continuous glucose monitoring", " Measurement noise", " Diabetes", " Parameter estimation", " Sensor calibration"], "paper_abstract": "It is clinically well-established that minimally invasive subcutaneous continuous glucose monitoring (CGM) sensors can significantly improve diabetes treatment. However, CGM readings are still not as reliable as those provided by standard fingerprick blood glucose (BG) meters. In addition to unavoidable random measurement noise, other components of sensor error are distortions due to the blood-to-interstitial glucose kinetics and systematic under-/overestimations associated with the sensor calibration process. A quantitative assessment of these components, and the ability to simulate them with precision, is of paramount importance in the design of CGM-based applications, e.g., the artificial pancreas (AP), and in their in silico testing. In the present paper, we identify and assess a model of sensor error of for two sensors, i.e., the G4 Platinum (G4P) and the advanced G4 for artificial pancreas studies (G4AP), both belonging to the recently presented \"fourth\" generation of Dexcom CGM sensors but different in their data processing. Results are also compared with those obtained by a sensor belonging to the previous, \"third,\" generation by the same manufacturer, the SEVEN Plus (7P). For each sensor, the error model is derived from 12-h CGM recordings of two sensors used simultaneously and BG samples collected in parallel every 15 +/- A 5 min. Thanks to technological innovations, G4P outperforms 7P, with average mean absolute relative difference (MARD) of 11.1 versus 14.2 %, respectively, and lowering of about 30 % the error of each component. Thanks to the more sophisticated data processing algorithms, G4AP resulted more reliable than G4P, with a MARD of 10.0 %, and a further decrease to 20 % of the error due to blood-to-interstitial glucose kinetics.", "paper_title": "Model of glucose sensor error components: identification and assessment for new Dexcom G4 generation devices", "paper_id": "WOS:000365753000002"}