{"auto_keywords": [{"score": 0.036885508966645754, "phrase": "conti."}, {"score": 0.0344847971857534, "phrase": "jam_signal"}, {"score": 0.029280807749061458, "phrase": "conti"}, {"score": 0.00481495049065317, "phrase": "medium_access_control_scheme"}, {"score": 0.004779876533667754, "phrase": "wireless_lans"}, {"score": 0.004745056850725867, "phrase": "constant-time_contention"}, {"score": 0.004693300099911199, "phrase": "today's_wireless_networks"}, {"score": 0.004362326712297089, "phrase": "dcf's_performance"}, {"score": 0.004283280680222718, "phrase": "large_number"}, {"score": 0.00411436400374349, "phrase": "increasing_proliferation"}, {"score": 0.004084372444216856, "phrase": "wireless_devices"}, {"score": 0.0038381060946426236, "phrase": "dcf"}, {"score": 0.003633079011725194, "phrase": "constant_number"}, {"score": 0.0035671997165370403, "phrase": "constant_time"}, {"score": 0.003476963781647026, "phrase": "contention_resolution"}, {"score": 0.0034264254358037653, "phrase": "predefined_number"}, {"score": 0.003036468052876648, "phrase": "next_slot"}, {"score": 0.0027809588979112393, "phrase": "optimal_parameters"}, {"score": 0.002632272952905934, "phrase": "simulation_results"}, {"score": 0.002298544073884724, "phrase": "highest_throughput"}, {"score": 0.0021049977753042253, "phrase": "scheme's_operation"}], "paper_keywords": ["Computer networks", " wireless LAN", " access protocols"], "paper_abstract": "In today's wireless networks, stations using the IEEE 802.11 Standard contend for the channel using the Distributed Coordination Function (DCF). Research has shown that DCF's performance degrades especially with the large number of stations. This becomes more concerning due to the increasing proliferation of wireless devices. In this paper, we present a Medium Access Control (MAC) scheme for wireless LANs and compare its performance to DCF and to other efficient schemes. Our scheme, which attempts to resolve the contention in a constant number of slots (or constant time), is called CONTI. The contention resolution happens over a predefined number of slots. In a slot, the stations probabilistically send a jam signal on the channel. The stations listening retire if they hear a jam signal. The others continue to the next slot. Over several slots, we aim to have one station remaining in the contention, which will then transmit its data. We find the optimal parameters of CONTI and present an analysis on its performance. More comprehensive evaluation is presented in the simulation results where we compare CONTI, DCF, and other efficient schemes from the literature. We consider the number of slots used, the collision rate, the throughput, the delay, and the fairness. The highest throughput was achieved by CONTI. Moreover, our results provide measurements from each of the schemes that we consider and provide the insight on each scheme's operation.", "paper_title": "A Medium Access Control Scheme for Wireless LANs with Constant-Time Contention", "paper_id": "WOS:000285460600003"}