{"auto_keywords": [{"score": 0.04949240338189186, "phrase": "vulnerability_assessment"}, {"score": 0.03404407165486171, "phrase": "parametric_approach"}, {"score": 0.00481495049065317, "phrase": "flood_risk"}, {"score": 0.004076352180903171, "phrase": "flood-prone_areas"}, {"score": 0.003952513974962462, "phrase": "risk_management"}, {"score": 0.003880017219275826, "phrase": "high-level_planning_proposals"}, {"score": 0.0033251716926666437, "phrase": "computer-based_inundation_mapping"}, {"score": 0.0029207251108325006, "phrase": "decision_makers"}, {"score": 0.002549543418930337, "phrase": "fvi"}, {"score": 0.002323826502178581, "phrase": "deterministic_approach"}, {"score": 0.0021845387990972543, "phrase": "better_science_base"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Floods", " Vulnerability", " Risk", " Physically-based models", " Flood Vulnerability Index"], "paper_abstract": "Floods are one of the most common and widely distributed natural risks to life and property. There is a need to identify the risk in flood-prone areas to support decisions for risk management, from high-level planning proposals to detailed design. There are many methods available to undertake such studies. The most accepted, and therefore commonly used, of which is computer-based inundation mapping. By contrast the parametric approach of vulnerability assessment is increasingly accepted. Each of these approaches has advantages and disadvantages for decision makers and this paper focuses on how the two approaches compare in use. It is concluded that the parametric approach, here the FVI, is the only one which evaluates vulnerability to floods; whilst although the deterministic approach has limited evaluation of vulnerability, it has a better science base. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Parametric and physically based modelling techniques for flood risk and vulnerability assessment: A comparison", "paper_id": "WOS:000315974500008"}