{"auto_keywords": [{"score": 0.04925367071541481, "phrase": "map_navigation_systems"}, {"score": 0.00481495049065317, "phrase": "semantically-annotated_routes"}, {"score": 0.0047732596509542135, "phrase": "context-aware_recommendations"}, {"score": 0.004690952711665194, "phrase": "modern_technology"}, {"score": 0.0044718206943536514, "phrase": "constant_touch"}, {"score": 0.00417115038996633, "phrase": "convergence_point"}, {"score": 0.003924629168434799, "phrase": "gps_reception"}, {"score": 0.003757480190200645, "phrase": "current_location"}, {"score": 0.0031431690368229443, "phrase": "non-bloated_visualization"}, {"score": 0.003062091606343783, "phrase": "available_services"}, {"score": 0.002918826667294298, "phrase": "semantic_multicriteria_ant_colony_algorithm"}, {"score": 0.002855934865505357, "phrase": "user's_routes"}, {"score": 0.002818850283787242, "phrase": "associated_context_information"}, {"score": 0.0022472527731744974, "phrase": "consistent_solutions"}, {"score": 0.0022084059770026416, "phrase": "multiple_objective_ontological_terms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Semantic search", " Context-awareness", " Ant colony optimization", " Ontologies"], "paper_abstract": "Modern technology has brought many changes to our everyday lives. Our need to be in constant touch with others has been met with the cellphone, which has become our companion and the convergence point of many technological advances. The combination of capabilities such as browsing the Internet and GPS reception has multiplied the services and applications based on the current location of the user. However, providing the user with these services has certain drawbacks. Although map navigation systems are the most meaningful way of displaying this information, the user still has to manually set up the filter in order to obtain a non-bloated visualization of the map and the available services. To tackle this problem, we present here a semantic multicriteria ant colony algorithm capable of learning the user's routes, including associated context information, and then predicting the most likely route a user is following, given his current location and context data. This knowledge could then be used as the basis for offering services related to his current (or most likely future) context data close to the path he is following. Our experimental results show that our algorithm is capable of obtaining consistent solutions sets even when multiple objective ontological terms are included in the process. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Learning semantically-annotated routes for context-aware recommendations on map navigation systems", "paper_id": "WOS:000306107900033"}