{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "single_gap"}, {"score": 0.015317122751295029, "phrase": "flouri_et_al"}, {"score": 0.010922563515440072, "phrase": "next-generation_re-sequencing_application"}, {"score": 0.004773040022691547, "phrase": "pairwise_sequence_alignment"}, {"score": 0.004354315061804687, "phrase": "hamming_distance_model"}, {"score": 0.003903269701018361, "phrase": "shortest_sequence"}, {"score": 0.003752550907120244, "phrase": "maximum_allowed_length"}, {"score": 0.003247868216333148, "phrase": "reference_genome"}, {"score": 0.0023079225317714815, "phrase": "presented_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Algorithms on strings", " Pairwise sequence alignment", " Dynamic programming"], "paper_abstract": "Recently, the problem of extending an alignment with k-mismatches and a single gap for pairwise sequence alignment was introduced (Flouri et al., 2011). The authors considered the problem of extending an alignment under the Hamming distance model by also allowing the insertion of a single gap; and presented a Theta(m beta)-time algorithm to solve it, where m is the length of the shortest sequence to be extended, and beta is the maximum allowed length of the single gap. Very recently, it was shown (Flouri et al., 2012) that this problem is strongly and directly motivated by the next-generation re-sequencing application: aligning tens of millions of short DNA sequences against a reference genome. In this article, we consider an extension of this problem: extending an alignment with k-mismatches and two gaps; and present a Theta(m beta)-time algorithm to solve it. This extension is proved to be fundamental in the next-generation re-sequencing application (Alachiotis et al., 2012). In addition, we present a generalisation of our solution to solve the problem of extending an alignment with k-mismatches and l-gaps in time Theta(m beta l). The presented solutions work provided that all gaps in the alignment must occur in one of the two sequences. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Extending alignments with k-mismatches and l-gaps", "paper_id": "WOS:000334007300010"}