{"auto_keywords": [{"score": 0.004789272640417375, "phrase": "n_circles"}, {"score": 0.0046133037548004305, "phrase": "planar_case"}, {"score": 0.004280442521885289, "phrase": "polylogarithmic_factors"}, {"score": 0.004167451906343558, "phrase": "common_plane"}, {"score": 0.0028191285111793126, "phrase": "special_case"}, {"score": 0.0026223985384227957, "phrase": "improved_analysis"}, {"score": 0.0025944417620244924, "phrase": "subpolynomial_factors"}, {"score": 0.002512342528545883, "phrase": "fixed_epsilon"}, {"score": 0.00236849950258728, "phrase": "mutually_similar_triangles"}, {"score": 0.0022690748070048764, "phrase": "polynomial_partitioning_technique"}, {"score": 0.002256960984083442, "phrase": "guth"}, {"score": 0.002244937423304434, "phrase": "katz"}, {"score": 0.0021680000153405684, "phrase": "solymosi"}], "paper_keywords": [""], "paper_abstract": "We establish an improved upper bound for the number of incidences between m points and n circles in three dimensions. The previous best known bound, originally established for the planar case and later extended to any dimension >= 2, is O*(m(2)/(3)n(2)/(3) + m(6)/(11)n(9)/(11) + m + n), where the O*(.) notation hides polylogarithmic factors. Since all the points and circles may lie on a common plane (or sphere), it is impossible to improve the bound in R-3 without first improving it in the plane. Nevertheless, we show that if the set of circles is required to be 'truly three-dimensional' in the sense that no sphere or plane contains more than q of the circles, for some q << n, then for any epsilon > 0 the bound can be improved to O(m(3)/(7+epsilon)n(6/7) + m(2/3+epsilon)n(1/2)q(1/6) + m(6/11+epsilon)n(15/22)q(3/22) + m + n). For various ranges of parameters (e.g., when m = Theta(n) and q = o(n(7/9))), this bound is smaller than the lower bound Omega*(m(2/3)n(2/3) + m + n), which holds in two dimensions. We present several extensions and applications of the new bound. (i) For the special case where all the circles have the same radius, we obtain the improved bound O(m(5/11+epsilon)n(9/11) + m(2/3+epsilon)n(1/2)q(1/6) + m + n). (ii) We present an improved analysis that removes the subpolynomial factors from the bound when m = O(n(3/2-epsilon)) for any fixed epsilon > 0. (iii) We use our results to obtain the improved bound O(m(15/7)) for the number of mutually similar triangles determined by any set of m points in R-3. Our result is obtained by applying the polynomial partitioning technique of Guth and Katz using a constant-degree partitioning polynomial (as was also recently used by Solymosi and Tao). We also rely on various additional tools from analytic, algebraic, and combinatorial geometry.", "paper_title": "Improved Bounds for Incidences Between Points and Circles", "paper_id": "WOS:000356495300003"}