{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "point_cluster_generalization"}, {"score": 0.036334665679927644, "phrase": "new_point"}, {"score": 0.015527012368180961, "phrase": "voronoi_diagram"}, {"score": 0.012239969336361867, "phrase": "point_clusters"}, {"score": 0.012052042714321745, "phrase": "border_polygon"}, {"score": 0.004412397783369937, "phrase": "corresponding_types"}, {"score": 0.004223869454839947, "phrase": "statistical_information"}, {"score": 0.004145547550709817, "phrase": "thematic_information"}, {"score": 0.004106989552897294, "phrase": "voronoi"}, {"score": 0.0040686720114175, "phrase": "topological_information"}, {"score": 0.003931402465972151, "phrase": "metric_information"}, {"score": 0.003546664687195951, "phrase": "pseudo_points"}, {"score": 0.003491739070201915, "phrase": "original_point_clusters"}, {"score": 0.003405615832166661, "phrase": "range_polygon"}, {"score": 0.0033633514001658086, "phrase": "original_points"}, {"score": 0.0032906426750021153, "phrase": "voronoi_polygons"}, {"score": 0.0031696255948160923, "phrase": "so-called_relative_local_density"}, {"score": 0.003091422591911213, "phrase": "selection_probability"}, {"score": 0.002940740466043107, "phrase": "will-be-deleted_points"}, {"score": 0.002859223385284036, "phrase": "voronoi_neighboring_relations"}, {"score": 0.0027886573969044042, "phrase": "retained_points"}, {"score": 0.002579140290642792, "phrase": "second_step"}, {"score": 0.002422890839801611, "phrase": "generalized_point_clusters"}, {"score": 0.0021922980151500037, "phrase": "point_features"}, {"score": 0.002151565516513624, "phrase": "thematic_dot"}, {"score": 0.0021049977753042253, "phrase": "cartographic_maps"}], "paper_keywords": ["point clusters", " map generalization", " measures", " algorithms", " Voronoi diagrams"], "paper_abstract": "This paper presents an algorithm for point cluster generalization. Four types of information, i.e. statistical, thematic, topological, and metric information are considered, and measures are selected to describe corresponding types of information quantitatively in the algorithm, i.e. the number of points for statistical information, the importance value for thematic information, the Voronoi neighbors for topological information, and the distribution range and relative local density for metric information. Based on these measures, an algorithm for point cluster generalization is developed. Firstly, point clusters are triangulated and a border polygon of the point clusters is obtained. By the border polygon, some pseudo points are added to the original point clusters to form a new point set and a range polygon that encloses all original points is constructed. Secondly, the Voronoi polygons of the new point set are computed in order to obtain the so-called relative local density of each point. Further, the selection probability of each point is computed using its relative local density and importance value, and then mark those will-be-deleted points as 'deleted' according to their selection probabilities and Voronoi neighboring relations. Thirdly, if the number of retained points does not satisfy that computed by the Radical Law, physically delete the points marked as 'deleted' forming a new point set, and the second step is repeated; else physically deleted pseudo points and the points marked as 'deleted', and the generalized point clusters are achieved. Owing to the use of the Voronoi diagram the algorithm is parameter free and fully automatic. As our experiments show, it can be used in the generalization of point features arranged in clusters such as thematic dot. maps and control points on cartographic maps. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "An algorithm for point cluster generalization based on the Voronoi diagram", "paper_id": "WOS:000257017400007"}