{"auto_keywords": [{"score": 0.03465513169375728, "phrase": "reflection_space"}, {"score": 0.015719716506582538, "phrase": "knowledge_management"}, {"score": 0.01560793230355411, "phrase": "design_education"}, {"score": 0.015496930491878636, "phrase": "systematic_reflection_practice"}, {"score": 0.004694873827535293, "phrase": "significant_role"}, {"score": 0.0042898529847155255, "phrase": "key_factor"}, {"score": 0.004197942881217177, "phrase": "successful_continuing_professional_development"}, {"score": 0.004137761530535196, "phrase": "higher_education"}, {"score": 0.003991040678278726, "phrase": "individual_reflection_practice"}, {"score": 0.003753411452669234, "phrase": "central_role"}, {"score": 0.0035171528695692213, "phrase": "key_perspectives"}, {"score": 0.002643624979574088, "phrase": "case_study"}, {"score": 0.0025682543875086934, "phrase": "design_studio_module"}, {"score": 0.0024151333926491878, "phrase": "reflection_phase"}, {"score": 0.002363293825140551, "phrase": "key_reflective_perspectives"}, {"score": 0.0021049977753042253, "phrase": "traceable_manner"}], "paper_keywords": ["reflection space", " evidencing reflection", " learning and teaching", " design studio"], "paper_abstract": "The significant role of reflection in sustaining the quality of learning and teaching (L&T) activities at high levels has been widely acknowledged in literature. Reflection has been identified as a key factor underpinning both successful learning by students and successful continuing professional development by their teaching staff in higher education. This study focuses on aspects associated with the individual reflection practice of teaching staff. It is proposed and maintained that the establishment of systematic reflection practice has a central role in enhancing knowledge management in design education. To this end, the consistency and coherence, in which key perspectives of reflection are considered and evidenced by teaching staff, need to be both ensured and sustained. Reflection Space is introduced as an approach to support the establishment of systematic(1), evidenced(2), and traceable reflection practice. It is a means of representing the nature, or perspectives, of reflection required on L&T and it has been applied and evaluated to a number of L&T contexts. An application of Reflection Space is demonstrated through a case study that dealt with the development of a Design Studio module delivered to Year 2 Product Design students. Evaluation of the application has shown that use of Reflection Space during the reflection phase of L&T activities can ensure that key reflective perspectives of L&T have been considered and evidenced. As a result, actions for the enhancement and/or improvement of the deployed L&T activities can be determined in a systematic, evidenced, and traceable manner.", "paper_title": "Enhancing knowledge management in design education through systematic reflection practice", "paper_id": "WOS:000247566300007"}