{"auto_keywords": [{"score": 0.033718899089422216, "phrase": "key_stakeholders"}, {"score": 0.00481495049065317, "phrase": "stakeholder_conflict_resolution_model"}, {"score": 0.004630270043271386, "phrase": "supervised_learning"}, {"score": 0.004430920292612374, "phrase": "software_projects"}, {"score": 0.00413767314434795, "phrase": "requirements_elicitation_phase"}, {"score": 0.0031457622320220364, "phrase": "important_factor"}, {"score": 0.002729246328390722, "phrase": "actual_industrial_case_study"}, {"score": 0.002689430273401131, "phrase": "proposed_model"}, {"score": 0.002663208600887875, "phrase": "information_gain"}, {"score": 0.0021049977753042253, "phrase": "requirements_engineering"}], "paper_keywords": ["Stakeholder", " conflicts", " requirements engineering", " entropy", " information gain"], "paper_abstract": "Various stakeholders are involved in the creation of software projects. In general, the higher the number of stakeholders involved during the requirements elicitation phase, the better are the chances of success for the project. However, it is rather difficult to consider the opinion of all the stakeholders owing to constraints on time and resources. Furthermore, conflicts between stakeholders can become inevitable when the number of stakeholders increases. Thus, the identification of key stakeholders is an important factor in ensuring the success of a project. In this paper, a methodical stakeholder conflict resolution model (s-CRM) is proposed by considering an actual industrial case study. The proposed model uses information gain based on entropy when measuring the impurity of information. We believe that the proposed s-CRM is effective in identifying the key stakeholders and in intuitively indicating those stakeholders whose elicited requirements need to be weighted. In addition, the model provides a solution for conflicts among stakeholders during requirements engineering.", "paper_title": "Stakeholder Conflict Resolution Model (S-CRM) Based On Supervised Learning", "paper_id": "WOS:000313526300004"}