{"auto_keywords": [{"score": 0.032913335275332134, "phrase": "network_topology"}, {"score": 0.013041630102128388, "phrase": "malicious_nodes"}, {"score": 0.011058784929120997, "phrase": "routing_protocols"}, {"score": 0.01048210095223084, "phrase": "decision_procedure"}, {"score": 0.00481495049065317, "phrase": "ad_hoc"}, {"score": 0.0047292449487169345, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.0046659637258752535, "phrase": "mobile_wireless_devices"}, {"score": 0.004461051281091779, "phrase": "central_issue"}, {"score": 0.0040777192615062815, "phrase": "cryptographic_mechanisms"}, {"score": 0.003916098498242888, "phrase": "discovered_route"}, {"score": 0.0036443694410100507, "phrase": "security_protocols"}, {"score": 0.003563370084662192, "phrase": "secured_routing_protocols"}, {"score": 0.003499864176875713, "phrase": "standard_symbolic_models"}, {"score": 0.0033160345607565565, "phrase": "wireless_communication"}, {"score": 0.0028586411938040473, "phrase": "nptime"}, {"score": 0.0026009105281485888, "phrase": "bounded_number"}, {"score": 0.002192039950294826, "phrase": "srp"}, {"score": 0.0021626556377005424, "phrase": "dsr"}, {"score": 0.002143247921132179, "phrase": "sdmsr."}], "paper_keywords": [""], "paper_abstract": "Mobile ad hoc networks consist of mobile wireless devices which autonomously organize their infrastructure. In such networks, a central issue, addressed by routing protocols, is to find a route from one device to another. These protocols use cryptographic mechanisms in order to prevent malicious nodes from compromising the discovered route. Our contribution is twofold. We first propose a calculus for modeling and reasoning about security protocols, including in particular secured routing protocols. Our calculus extends standard symbolic models to take into account the characteristics of routing protocols and to model wireless communication in a more accurate way. Our second main contribution is a decision procedure for analyzing routing protocols for any network topology. By using constraint solving techniques, we show that it is possible to automatically discover (in NPTIME) whether there exists a network topology that would allow malicious nodes to mount an attack against the protocol, for a bounded number of sessions. We also provide a decision procedure for detecting attacks in case the network topology is given a priori. We demonstrate the usage and usefulness of our approach by analyzing protocols of the literature, such as SRP applied to DSR and SDMSR. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Modeling and verifying ad hoc routing protocols", "paper_id": "WOS:000343991900003"}