{"auto_keywords": [{"score": 0.03225744122190014, "phrase": "internet_advertising_adoption"}, {"score": 0.01460994626476257, "phrase": "internet_advertising"}, {"score": 0.00481495049065317, "phrase": "iranian_smes"}, {"score": 0.004434910775034831, "phrase": "iranian_small_and_medium-sized_enterprises"}, {"score": 0.004238775572746022, "phrase": "competitive_advantage"}, {"score": 0.004204054047427536, "phrase": "small_businesses"}, {"score": 0.003746673633703251, "phrase": "comprehensive_theoretical_framework"}, {"score": 0.003625347557965931, "phrase": "small_to_medium-sized_enterprises"}, {"score": 0.0033115182122122507, "phrase": "iran"}, {"score": 0.00327086925741257, "phrase": "structural_equation_model"}, {"score": 0.003244050414264445, "phrase": "lisrel_software"}, {"score": 0.003074991770768925, "phrase": "seven_latent_variables"}, {"score": 0.0025972447844047515, "phrase": "readiness_and_globalization_stages"}, {"score": 0.002565345470805401, "phrase": "small_and_medium-sized_enterprises"}, {"score": 0.0023624435546097658, "phrase": "iranian_experts"}, {"score": 0.0022670785913397637, "phrase": "first_attempts"}, {"score": 0.0022300169122921906, "phrase": "comprehensive_theoretical_model"}, {"score": 0.002139986159978777, "phrase": "new_scale"}, {"score": 0.0021049977753042253, "phrase": "higher_content_validity"}], "paper_keywords": ["Internet advertising", " Adoption", " Product involvement", " Internet publishers", " Small to medium-sized enterprises", " Advertising", " Iran"], "paper_abstract": "Purpose - The purpose of this paper is to provide some insights regarding the adoption of internet advertising by Iranian small and medium-sized enterprises. The recent negative trends leading to a lack of competitive advantage in small businesses and the advantages of internet advertising makes it imperative to study various factors affecting this area of marketing. Design/methodology/approach - This study reviewed 59 previous related studies, resulting in a comprehensive theoretical framework which explains the advantages of internet advertising for small to medium-sized enterprises (SMEs). Via questionnaire, the paper compiles 346 Iranian experts' opinions in order to test the validity and applicability of variables in Iran. A structural equation model and LISREL software were used to analyze the data. Findings - A total of seven latent variables of internet advertising adoption were examined: advertising agencies, internet publishers, small and middle-sized enterprises, government role, e-commerce development and user types. The paper found that these constructs successfully explain internet advertising adoption by incorporating readiness and globalization stages. The small and medium-sized enterprises were found to be the most significant for explaining internet advertising adoption. Research limitations/implications - The sample was restricted to Iranian experts. Originality/value - This study offers one of the first attempts to build a comprehensive theoretical model explaining internet advertising adoption. Second, this study offers a new scale for internet advertising adoption with higher content validity.", "paper_title": "Internet advertising adoption: a structural equation model for Iranian SMEs", "paper_id": "WOS:000309949000006"}