{"auto_keywords": [{"score": 0.0472887981125377, "phrase": "dynamic_power_consumption"}, {"score": 0.03827394525154412, "phrase": "encoding_strategies"}, {"score": 0.00481495049065317, "phrase": "reconfigurable_network"}, {"score": 0.004356926418550194, "phrase": "namely_crosstalk_interferences"}, {"score": 0.004299228562179176, "phrase": "wire_power_consumption"}, {"score": 0.003737485125097945, "phrase": "novel_reconfigurable_noc_design"}, {"score": 0.003543273649210823, "phrase": "intelligent_reasoning"}, {"score": 0.003359119985242403, "phrase": "encoding_strategy_selection"}, {"score": 0.0030799988391729464, "phrase": "design_time"}, {"score": 0.0029198522863606953, "phrase": "appropriate_encoding_method"}, {"score": 0.0023424328921363585, "phrase": "hardware_resources_pressnoc"}, {"score": 0.002295964130868963, "phrase": "higher_probability"}, {"score": 0.002220551141101661, "phrase": "crosstalk_interferences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "To solve two increasingly problematic issues, namely crosstalk interferences and wire power consumption, in a Network-on-Chip (NoC), Power-aware and Reliable Encoding Schemes Supported reconfigurable Network-on-Chip (PRESSNoC) is proposed. It includes a novel reconfigurable NoC design, four data encoding strategies, and an intelligent REasoning And Learning (REAL) framework for encoding strategy selection. Instead of pre-integrating all encoding strategies into a NoC at design time, REAL can configure PRESSNoC with an appropriate encoding method at run-time. Compared to baseline NoCs that use a fixed encoding method, the average benefit to overhead ratio of the PRESSNoC is greater by 88%, 39%, and 277%, at the interference, application, and system levels, respectively. Experiments show that at the same overheads of performance and hardware resources PRESSNoC induces a higher probability toward the reduction of crosstalk interferences and dynamic power consumption. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Learning-based adaptation to applications and environments in a reconfigurable network-on-chip for reducing crosstalk and dynamic power consumption", "paper_id": "WOS:000318454200027"}