{"auto_keywords": [{"score": 0.04920048477615093, "phrase": "complex_scenarios"}, {"score": 0.04765668038582168, "phrase": "false_detections"}, {"score": 0.03493300503751909, "phrase": "dummy_nodes"}, {"score": 0.015547854680881108, "phrase": "unified_handling"}, {"score": 0.014769979160054847, "phrase": "trajectory_terminations"}, {"score": 0.00481495049065317, "phrase": "online_multi-target"}, {"score": 0.004639822587124109, "phrase": "miss_detections"}, {"score": 0.004454497011118188, "phrase": "data_association"}, {"score": 0.004292422863834094, "phrase": "online_tracking-by-detection_method"}, {"score": 0.004167001961564886, "phrase": "aforementioned_complex_scenarios"}, {"score": 0.004120915812750583, "phrase": "current_detection_responses"}, {"score": 0.004045230861702083, "phrase": "previous_trajectories"}, {"score": 0.003970930401776528, "phrase": "dummy_node"}, {"score": 0.003539671663910004, "phrase": "source_nodes"}, {"score": 0.003410768840300913, "phrase": "new_targets"}, {"score": 0.0033730181385496186, "phrase": "standard_hungarian_algorithm"}, {"score": 0.0032141856243404618, "phrase": "online_data_association"}, {"score": 0.0031668306413359794, "phrase": "global_manner"}, {"score": 0.0028436862612859896, "phrase": "real_trajectory"}, {"score": 0.002689666606553487, "phrase": "consecutive_dummy_nodes"}, {"score": 0.0024330980793680337, "phrase": "experimental_results"}, {"score": 0.002250549946875429, "phrase": "quantitative_comparisons"}, {"score": 0.0022173607419126817, "phrase": "five_benchmark_sequences"}, {"score": 0.0021684903968454267, "phrase": "comparable_results"}], "paper_keywords": ["Multi-target tracking", " complex scenarios"], "paper_abstract": "Complex scenarios, including miss detections, occlusions, false detections, and trajectory terminations, make the data association challenging. In this paper, we propose an online tracking-by-detection method to track multiple targets with unified handling of aforementioned complex scenarios, where current detection responses are linked to the previous trajectories. We introduce a dummy node to each trajectory to allow it to temporally disappear. If a trajectory fails to find its matching detection, it will be linked to its corresponding dummy node until the emergence of its matching detection. Source nodes are also incorporated to account for the entrance of new targets. The standard Hungarian algorithm, extended by the dummy nodes, can be exploited to solve the online data association implicitly in a global manner, although it is formulated between two consecutive frames. Moreover, as dummy nodes tend to accumulate in a fake or disappeared trajectory while they only occasionally appear in a real trajectory, we can deal with false detections and trajectory terminations by simply checking the number of consecutive dummy nodes. Our approach works on a single, uncalibrated camera, and requires neither scene prior knowledge nor explicit occlusion reasoning, running at 132 frames/s on the PETS09-S2L1 benchmark sequence. The experimental results validate the effectiveness of the dummy nodes in complex scenarios and show that our proposed approach is robust against false detections and miss detections. Quantitative comparisons with other methods on five benchmark sequences demonstrate that we can achieve comparable results with the most existing offline methods and better results than other online algorithms.", "paper_title": "Online Multi-Target Tracking With Unified Handling of Complex Scenarios", "paper_id": "WOS:000357793200007"}