{"auto_keywords": [{"score": 0.04444288300280288, "phrase": "different_levels"}, {"score": 0.00481495049065317, "phrase": "eu_languages"}, {"score": 0.004765173195920904, "phrase": "text_compression"}, {"score": 0.004453874101119545, "phrase": "european_languages"}, {"score": 0.004407813106104401, "phrase": "statistical_and_unsupervised_methods"}, {"score": 0.003542976343910816, "phrase": "linguistic_groupings"}, {"score": 0.00331125524068286, "phrase": "kolmogorov_complexity"}, {"score": 0.0031762308449055305, "phrase": "language_structure"}, {"score": 0.003143341238802547, "phrase": "syntactic_and_morphological_levels"}, {"score": 0.0027169974137406148, "phrase": "classical_linguistic_classification"}, {"score": 0.002435542816459651, "phrase": "source_language"}, {"score": 0.002372935208038141, "phrase": "morphological_level"}, {"score": 0.0023361440016375972, "phrase": "target_language"}, {"score": 0.0022879728308318205, "phrase": "syntactic_level"}], "paper_keywords": [""], "paper_abstract": "In this article, we are studying the differences between the European languages using statistical and unsupervised methods. The analysis is conducted in different levels of language, lexical, morphological and syntactic. Our premise is that the difficulty of the translation could be perceived as differences or similarities in different levels of language. The results are compared to linguistic groupings. The analyses of this paper are based on the concept of Kolmogorov complexity, which is used to compare the language structure in syntactic and morphological levels. The way the languages convey information in these levels is taken as a measure of similarity or dissimilarity between languages and the results are compared to classical linguistic classification. The results will serve as a tool in developing machine translation system(s), e.g., in the following way: if source language conveys more information in the morphological level and the target language more in the syntactic level, it is clear that the (machine) translator must be able to transfer the information from one level to another.", "paper_title": "Analysis of EU languages through text compression", "paper_id": "WOS:000240270400010"}