{"auto_keywords": [{"score": 0.013772287570565658, "phrase": "selfish_load_balancing"}, {"score": 0.01210532942439844, "phrase": "online_load_balancing"}, {"score": 0.00481495049065317, "phrase": "selfish_and_greedy_load_balancing"}, {"score": 0.0047310525657970615, "phrase": "load_balancing_problem"}, {"score": 0.004363480951473701, "phrase": "permissible_servers"}, {"score": 0.004317682099870507, "phrase": "particular_client"}, {"score": 0.0038715697646612766, "phrase": "smallest_latency"}, {"score": 0.003483631502938922, "phrase": "irrevocable_decision"}, {"score": 0.0032467792804296036, "phrase": "global_criterion"}, {"score": 0.0032013710938940424, "phrase": "online_fashion"}, {"score": 0.0031677308747058187, "phrase": "natural_local_optimization_criterion"}, {"score": 0.002941913249957503, "phrase": "minimum_increase"}, {"score": 0.0029109914689364465, "phrase": "global_objective"}, {"score": 0.002850116748762153, "phrase": "greedy_online_solutions"}, {"score": 0.0025194861926779223, "phrase": "load_balancing"}, {"score": 0.0023563212280243682, "phrase": "greedy_algorithm"}, {"score": 0.0022747238867190417, "phrase": "total_latency"}, {"score": 0.0022192891418394514, "phrase": "linear_latency_functions"}, {"score": 0.002157583854640276, "phrase": "tight_upper_bound"}, {"score": 0.0021049977753042253, "phrase": "linear_congestion_games"}], "paper_keywords": ["Load balancing", " Price of anarchy", " Price of stability", " Congestion games", " Online algorithms"], "paper_abstract": "We study the load balancing problem in the context of a set of clients each wishing to run a job on a server selected among a subset of permissible servers for the particular client. We consider two different scenarios. In selfish load balancing, each client is selfish in the sense that it chooses, among its permissible servers, to run its job on the server having the smallest latency given the assignments of the jobs of other clients to servers. In online load balancing, clients appear online and, when a client appears, it has to make an irrevocable decision and assign its job to one of its permissible servers. Here, we assume that the clients aim to optimize some global criterion but in an online fashion. A natural local optimization criterion that can be used by each client when making its decision is to assign its job to that server that gives the minimum increase of the global objective. This gives rise to greedy online solutions. The aim of this paper is to determine how much the quality of load balancing is affected by selfishness and greediness. We characterize almost completely the impact of selfishness and greediness in load balancing by presenting new and improved, tight or almost tight bounds on the price of anarchy of selfish load balancing as well as on the competitiveness of the greedy algorithm for online load balancing when the objective is to minimize the total latency of all clients on servers with linear latency functions. In addition, we prove a tight upper bound on the price of stability of linear congestion games.", "paper_title": "Tight Bounds for Selfish and Greedy Load Balancing", "paper_id": "WOS:000293962400005"}