{"auto_keywords": [{"score": 0.04608946200992808, "phrase": "granular_media"}, {"score": 0.015719716506582538, "phrase": "granular_materials"}, {"score": 0.011855859414348548, "phrase": "overlapping_bridging_scale_methods"}, {"score": 0.004748556604045108, "phrase": "finite_element_facets"}, {"score": 0.004539005582217309, "phrase": "discrete_element"}, {"score": 0.0044608829094248985, "phrase": "multiscale_modeling_methodology"}, {"score": 0.004323620278409076, "phrase": "solid_deformable_bodies"}, {"score": 0.003936560022538905, "phrase": "particle_shape"}, {"score": 0.0038286491141253584, "phrase": "smooth_contact_interface_conditions"}, {"score": 0.0035965032173588753, "phrase": "concurrent_multiscale_modeling"}, {"score": 0.0035468507553681034, "phrase": "findings_-_a_closed-form_solution"}, {"score": 0.003285725064532174, "phrase": "gravity_deposition"}, {"score": 0.003107935254560724, "phrase": "de-fe_facet_coupling"}, {"score": 0.0030437652050982643, "phrase": "artificial_boundary_effects"}, {"score": 0.00301217724562369, "phrase": "shear_deformation_region"}, {"score": 0.002991300390411948, "phrase": "dem_granular_media"}, {"score": 0.0028392545452904762, "phrase": "couple_more_robustly_the_ellipsoidal_dem_code"}, {"score": 0.0027806165169981622, "phrase": "fe_code"}, {"score": 0.002657677633954843, "phrase": "boundary_placement"}, {"score": 0.002639251247218711, "phrase": "de_simulation"}, {"score": 0.002584733102974067, "phrase": "concurrent_multiscale_computational_modeling"}, {"score": 0.002540160379502092, "phrase": "deformable_solid_bodies"}, {"score": 0.002427826856342292, "phrase": "mechanical_behavior"}, {"score": 0.0024026156525362684, "phrase": "physical_particle_sizes"}, {"score": 0.0023611760395203106, "phrase": "interface_region"}, {"score": 0.0021049977753042253, "phrase": "fe_facets"}], "paper_keywords": ["Mechanical behavior of materials", " Modeling", " Finite element analysis"], "paper_abstract": "Purpose - The purpose of this paper is to develop a discrete element (DE) and multiscale modeling methodology to represent granular media at their particle scale as they interface solid deformable bodies, such as soil-tool, tire, penetrometer, pile, etc., interfaces. Design/methodology/approach - A three-dimensional ellipsoidal discrete element method (DEM) is developed to more physically represent particle shape in granular media while retaining the efficiency of smooth contact interface conditions for computation. DE coupling to finite element (FE) facets is presented to demonstrate initially the development of overlapping bridging scale methods for concurrent multiscale modeling of granular media. Findings - A closed-form solution of ellipsoidal particle contact resolution and stiffness is presented and demonstrated for two particle, and many particle contact simulations, during gravity deposition, and quasi-static oedometer, triaxial compression, and pile penetration. The DE-FE facet coupling demonstrates the potential to alleviate artificial boundary effects in the shear deformation region between DEM granular media and deformable solid bodies. Research limitations/implications - The research is being extended to couple more robustly the ellipsoidal DEM code and a higher order continuum FE code via overlapping bridging scale methods, in order to remove dependence of penetration/shear resistance on the boundary placement for DE simulation. Practical implications - When concurrent multiscale computational modeling of interface conditions between deformable solid bodies and granular materials reaches maturity, modelers will be able to simulate the mechanical behavior accounting for physical particle sizes and flow in the interface region, and thus design their tool, tire, penetrometer, or pile accordingly. Originality/value - A closed-form solution for ellipsoidal particle contact is demonstrated in this paper, and the ability to couple DE to FE facets.", "paper_title": "Three-dimensional ellipsoidal discrete element modeling of granular materials and its coupling with finite element facets", "paper_id": "WOS:000281276000011"}