{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gsm_schemas"}, {"score": 0.047791354135974656, "phrase": "case_management"}, {"score": 0.040650574499495426, "phrase": "gsm_schema"}, {"score": 0.004635187610736025, "phrase": "declarative_artifact_systems"}, {"score": 0.004462105963334103, "phrase": "important_paradigm"}, {"score": 0.004413846562278824, "phrase": "business_process_management"}, {"score": 0.004112582094962078, "phrase": "omg's_emerging_case_management_modeling_notation_standard"}, {"score": 0.0037087324991876727, "phrase": "formal_framework"}, {"score": 0.003201890266327127, "phrase": "original_schema"}, {"score": 0.002999386721353559, "phrase": "distributed_parties"}, {"score": 0.0028096544129939277, "phrase": "local_parts"}, {"score": 0.0026607205525625995, "phrase": "global_execution"}, {"score": 0.0025334249463305875, "phrase": "crisp_separation"}, {"score": 0.0024253827365474734, "phrase": "existing_gsm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Outsourcing", " Case management", " Privacy"], "paper_abstract": "Case Management is emerging as an important paradigm for Business Process Management. The Guard-Stage-Milestone (GSM) model is a recent case management approach that substantially influences OMG's emerging Case Management Modeling Notation standard. We study the problem of outsourcing part of a GSM schema to another party, and develop a formal framework that supports splitting and outsourcing of GSM schemas. One element of the framework focuses on restructuring the GSM schema to facilitate outsourcing while preserving the semantics of the original schema; the second focuses on locking protocols that define how the distributed parties should operate. Additionally, the framework allows parties to keep local parts of their GSM subschema private without affecting the outcomes of the global execution. The rules restructuring developed here enables a crisp separation of concerns, which allows reuse of existing GSM (and thus Case Management) engines for executing the subschemas. Both elements of the framework are formally proven correct. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Splitting GSM schemas: A framework for outsourcing of declarative artifact systems", "paper_id": "WOS:000340318800010"}