{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "horizontal_surface"}, {"score": 0.004214637810698362, "phrase": "virtual_reality-based_applications"}, {"score": 0.004084584884062157, "phrase": "multi-user_interactions"}, {"score": 0.0039122637074546895, "phrase": "tabletop_computers"}, {"score": 0.0037471850931318942, "phrase": "spatial_sound_production"}, {"score": 0.003533247407261015, "phrase": "lam"}, {"score": 0.003228517923065361, "phrase": "loudspeaker-based_amplitude"}, {"score": 0.003203294948113915, "phrase": "spatial_sound_techniques"}, {"score": 0.002892729377519916, "phrase": "virtual_sources"}, {"score": 0.002727409429089543, "phrase": "earlier_results"}, {"score": 0.0025917743904900576, "phrase": "sound_localization"}, {"score": 0.0025614418906438744, "phrase": "actual_sound_source"}, {"score": 0.002462867872567125, "phrase": "ground_truth"}, {"score": 0.0023773911659018803, "phrase": "previous_amplitude_panning-based_spatial_sound_techniques"}, {"score": 0.0022769287097263564, "phrase": "substantial_differences"}, {"score": 0.002250272652754455, "phrase": "previous_amplitude_panning_results"}, {"score": 0.002223927963267319, "phrase": "ground_truth_data"}, {"score": 0.0021721582450016, "phrase": "amplitude_panning"}, {"score": 0.0021467260992026295, "phrase": "viable_spatial_sound_technique"}, {"score": 0.0021049977753042253, "phrase": "horizontal_displays"}], "paper_keywords": ["Tabletop computer", " Surface computer", " Spatial sound", " Amplitude panning"], "paper_abstract": "As the technology improves and their cost decreases, tabletop computers and their inherent ability to promote collaboration amongst users are gaining in popularity. Their use in virtual reality-based applications including virtual training environments and gaming where multi-user interactions are common is poised to grow. However, before tabletop computers become widely accepted, there are many questions with respect to spatial sound production and reception for these devices that need to be addressed. Previous work (Lam et al. in ACM Comput Entertain 12(2): 4: 1-4: 19, 2014) has seen the development of loudspeaker-based amplitude panning spatial sound techniques to spatialize a sound to a position on a plane just above a tabletop computer's (horizontal) surface. Although it has been established that the localization of these virtual sources is prone to error, there is a lack of ground truth (reference) data with which to compare these earlier results. Here, we present the results of an experiment that measured sound localization of an actual sound source on a horizontal surface, thus providing such ground truth data. This ground truth data were then compared with the results of previous amplitude panning-based spatial sound techniques for tabletop computing displays. Preliminary results reveal that no substantial differences exist between previous amplitude panning results and the ground truth data reported here, indicating that amplitude panning is a viable spatial sound technique for tabletop computing and horizontal displays in general.", "paper_title": "Sound localization on a horizontal surface: virtual and real sound source localization", "paper_id": "WOS:000363862800006"}