{"auto_keywords": [{"score": 0.04840115289905245, "phrase": "constraint_satisfaction"}, {"score": 0.00481495049065317, "phrase": "functional_dependencies"}, {"score": 0.004149922666541166, "phrase": "structural_interactions"}, {"score": 0.003290494847464381, "phrase": "theoretical_bounds"}, {"score": 0.003251552926963083, "phrase": "actual_runtime"}, {"score": 0.0031561961485589663, "phrase": "complexity_parameter"}, {"score": 0.002921114512115261, "phrase": "nonstructural_aspects"}, {"score": 0.0025471636425006155, "phrase": "cnf_compilations"}, {"score": 0.002371424085814217, "phrase": "clausal_implication"}, {"score": 0.0023433334920926713, "phrase": "existential_quantification"}, {"score": 0.0023018188296933923, "phrase": "model_counting"}, {"score": 0.0022476051902301187, "phrase": "empirical_results"}, {"score": 0.002181626277903721, "phrase": "new_measure"}], "paper_keywords": [""], "paper_abstract": "Many reasoning problems in logic and constraint satisfaction have been shown to be exponential only in the treewidth of their interaction graph: a graph which captures the structural interactions among variables in a problem. It has long been observed in both logic and constraint satisfaction, however, that problems may be easy even when their treewidth is quite high. To bridge some of the gap between theoretical bounds and actual runtime, we propose a complexity parameter, called functional treewidth, which refines treewidth by being sensitive to nonstructural aspects of a problem: functional dependencies in particular. This measure dominates treewidth and can be used to bound the size of CNF compilations, which permit a variety of queries in polytime, including clausal implication, existential quantification, and model counting. We present empirical results which show how the new measure can predict the complexity of certain benchmarks, that would have been considered quite difficult based on treewidth alone.", "paper_title": "Functional treewidth: Bounding complexity in the presence of functional dependencies", "paper_id": "WOS:000240082500014"}