{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "email_classification"}, {"score": 0.004399525320473839, "phrase": "spam_classification"}, {"score": 0.004316722156877335, "phrase": "content_features"}, {"score": 0.004058180509184539, "phrase": "dimensionality_reduction"}, {"score": 0.0037610536973798113, "phrase": "first_one"}, {"score": 0.00370780481244907, "phrase": "classic_classification_scenario"}, {"score": 0.0035189057079817285, "phrase": "ling-spam"}, {"score": 0.0032302647179383915, "phrase": "second_schema"}, {"score": 0.003154360892955196, "phrase": "anticipatory_properties"}, {"score": 0.003094920033010818, "phrase": "classification_models"}, {"score": 0.0027479040199262393, "phrase": "exhaustive_comparison"}, {"score": 0.002632716358833918, "phrase": "different_benchmarking_corpora"}, {"score": 0.0025586128304269616, "phrase": "especially_the_technique"}, {"score": 0.0025343769150179764, "phrase": "biased_discriminant_analysis"}, {"score": 0.0025103699913760057, "phrase": "better_discriminative_features"}, {"score": 0.0024397017438101726, "phrase": "stable_classification_results"}, {"score": 0.0022933216359142736, "phrase": "time_and_data_setups"}, {"score": 0.0021971473452127126, "phrase": "commercial_setting"}, {"score": 0.0021659920594094407, "phrase": "short_profile_rules"}, {"score": 0.0021049977753042253, "phrase": "limited_number"}], "paper_keywords": ["Data mining", " Dimensionality reduction", " Email classification", " Feature extraction", " Feature selection"], "paper_abstract": "This paper reports on email classification and filtering, more specifically on spam versus ham and phishing versus spam classification, based on content features. We test the validity of several novel statistical feature extraction methods. The methods rely on dimensionality reduction in order to retain the most informative and discriminative features. We successfully test our methods under two schemas. The first one is a classic classification scenario using a 10-fold cross-validation technique for several corpora, including four ground truth standard corpora: Ling-Spam, SpamAssassin, PU1, and a subset of the TREC 2007 spam corpus, and one proprietary corpus. In the second schema, we test the anticipatory properties of our extracted features and classification models with two proprietary datasets, formed by phishing and spam emails sorted by date, and with the public TREC 2007 spam corpus. The contributions of our work are an exhaustive comparison of several feature selection and extraction methods in the frame of email classification on different benchmarking corpora, and the evidence that especially the technique of biased discriminant analysis offers better discriminative features for the classification, gives stable classification results notwithstanding the amount of features chosen, and robustly retains their discriminative value over time and data setups. These findings are especially useful in a commercial setting, where short profile rules are built based on a limited number of features for filtering emails.", "paper_title": "Highly discriminative statistical features for email classification", "paper_id": "WOS:000303129500002"}