{"auto_keywords": [{"score": 0.04370887662987756, "phrase": "different_fingerprints"}, {"score": 0.013081218311759506, "phrase": "metabolism_data_sets"}, {"score": 0.0077628231958883805, "phrase": "different_isoforms"}, {"score": 0.00481495049065317, "phrase": "cyp-mediated_metabolism"}, {"score": 0.004787116526591974, "phrase": "chemical_fingerprints"}, {"score": 0.004731928080086235, "phrase": "atom_fingerprints"}, {"score": 0.004677372885331908, "phrase": "path-based_daylight_fingerprints"}, {"score": 0.004517435235940661, "phrase": "metabolism_prediction_models"}, {"score": 0.004426664694837159, "phrase": "metabolism_prediction"}, {"score": 0.004300133642951283, "phrase": "fingerprint_parameters"}, {"score": 0.004250535418141079, "phrase": "metabolism_predictions"}, {"score": 0.0040226133433241065, "phrase": "specific_site"}, {"score": 0.0039531986393405785, "phrase": "improved_models"}, {"score": 0.00367658459781873, "phrase": "search_depths"}, {"score": 0.0036026484429137998, "phrase": "subgraph_fingerprints"}, {"score": 0.003409348393161723, "phrase": "ring_bonds"}, {"score": 0.0033797867987390394, "phrase": "nonring_bonds"}, {"score": 0.0033021988455635403, "phrase": "meta_positioning"}, {"score": 0.0032170325106123626, "phrase": "optimal_fingerprint_models"}, {"score": 0.003189133102243104, "phrase": "cross-validation_performance"}, {"score": 0.0031614748814351823, "phrase": "full_training_data"}, {"score": 0.003044377127036318, "phrase": "roc"}, {"score": 0.0027984556312357673, "phrase": "cross-validation_fold"}, {"score": 0.0027501068128017924, "phrase": "different_folds"}, {"score": 0.00269475174341129, "phrase": "generalization_error"}, {"score": 0.0026100018366802613, "phrase": "top_few_fingerprints_yields_performances_improvements"}, {"score": 0.0023168823213024856, "phrase": "top_performing_fingerprints"}, {"score": 0.002218054404179068, "phrase": "important_gains"}, {"score": 0.0021860555252905876, "phrase": "metabolism_modeling"}, {"score": 0.00211727014324916, "phrase": "optimal_site"}, {"score": 0.0021049977753042253, "phrase": "metabolism_models"}], "paper_keywords": [""], "paper_abstract": "Molecule and atom fingerprints, similar to path-based Daylight fingerprints, can substantially improve the accuracy of P450 site-of-metabolism prediction models. Only two chemical fingerprints have been used in metabolism prediction, so little is known about the importance of fingerprint parameters on site of metabolism predictions. It is possible that different fingerprints might yield more accurate models. Here, we study if tuning fingerprints to specific site of metabolism data sets can lead to improved models. We measure the impact of 484 specific chemical fingerprints on the accuracy of P450 site-of-metabolism prediction models on nine P450 isoform site of metabolism data sets. Using a range of search depths, we study path, circular, and subgraph fingerprints. Two different labelings, also, are considered, both standard SMILES labels and also a labeling that marks ring bonds differently than nonring bonds, enabling ortho, para, and meta positioning of substituents to be more clearly encoded. Optimal fingerprint models chosen by cross-validation performance on the full training data are, on average, 3.8% (Top-2; percent of molecules with a site of metabolism in the top two predictions) and 1.4% (AUC; area under the ROC curve) more accurate than base fingerprint models. These gains represent, respectively, a 25.6% and 16.7% reduction in error. A more rigorous assessment selects fingerprints within each cross-validation fold, sometimes selecting different fingerprints for different folds, but yielding a more reliable estimate of generalization error. In this assessment, averaging the scores from the top few fingerprints yields performances improvements of, on average, 3.0% (Top-2) and 0.7% (AUC). These gains are statistically significant and represent, respectively, a 20.1% and 8.8% reduction in error. Between different isoforms, not many consistencies were observed among the top performing fingerprints, with different fingerprints working best for different isoforms. These results suggest that there are important gains achievable in site of metabolism modeling by including and optimizing atom and molecule fingerprints. The optimal site of metabolism models determined by this approach are available for use at http://swami.wustl.edu/.", "paper_title": "Improved Prediction of CYP-Mediated Metabolism with Chemical Fingerprints", "paper_id": "WOS:000355382200007"}