{"auto_keywords": [{"score": 0.04962913836247387, "phrase": "adaptive_dynamic_programming"}, {"score": 0.03728661882776104, "phrase": "final_time_step"}, {"score": 0.027412986283269016, "phrase": "clipping_problem"}, {"score": 0.004814951205791253, "phrase": "neurocontrol"}, {"score": 0.004592905436175987, "phrase": "reinforcement_learning"}, {"score": 0.004218602458288531, "phrase": "total_cost_function"}, {"score": 0.004023947242621452, "phrase": "discretized_time"}, {"score": 0.003102752392819577, "phrase": "first_terminal_state"}, {"score": 0.0024960069794216977, "phrase": "explicit_derivatives"}, {"score": 0.002460825108719896, "phrase": "model_functions"}, {"score": 0.0023806459272452353, "phrase": "learning_gradient"}, {"score": 0.0022385926290967263, "phrase": "dual_heuristic_programming"}, {"score": 0.0021049977753042253, "phrase": "heuristic_dynamic_programming"}], "paper_keywords": ["Backpropagation through time (BPTT)", " clipping", " dual heuristic programming (DHP)", " neurocontrol", " value-gradient learning"], "paper_abstract": "In adaptive dynamic programming, neurocontrol, and reinforcement learning, the objective is for an agent to learn to choose actions so as to minimize a total cost function. In this paper, we show that when discretized time is used to model the motion of the agent, it can be very important to do clipping on the motion of the agent in the final time step of the trajectory. By clipping, we mean that the final time step of the trajectory is to be truncated such that the agent stops exactly at the first terminal state reached, and no distance further. We demonstrate that when clipping is omitted, learning performance can fail to reach the optimum, and when clipping is done properly, learning performance can improve significantly. The clipping problem we describe affects algorithms that use explicit derivatives of the model functions of the environment to calculate a learning gradient. These include backpropagation through time for control and methods based on dual heuristic programming. However, the clipping problem does not significantly affect methods based on heuristic dynamic programming, temporal differences learning, or policy-gradient learning algorithms.", "paper_title": "Clipping in Neurocontrol by Adaptive Dynamic Programming", "paper_id": "WOS:000343704900014"}