{"auto_keywords": [{"score": 0.04312419408962291, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.01582510332767377, "phrase": "proposed_similarity_measure"}, {"score": 0.015719716506582538, "phrase": "novel_similarity_measure"}, {"score": 0.011432197033582893, "phrase": "intuitionistic_fuzzy_values"}, {"score": 0.006995506802007591, "phrase": "pattern_recognition_problems"}, {"score": 0.0068685195080904005, "phrase": "medical_diagnosis_problems"}, {"score": 0.003555902292752528, "phrase": "new_similarity_measure"}, {"score": 0.003213920601037463, "phrase": "hausdorff_distance"}, {"score": 0.0030135741897058844, "phrase": "uncertainty_degrees"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["Intuitionistic fuzzy values", " intuitionistic fuzzy sets", " similarity measure", " median distance", " Hausdorff distance", " uncertainty degree"], "paper_abstract": "In this paper, we propose a novel similarity measure between intuitionistic fuzzy sets and apply it to deal with pattern recognition problems and medical diagnosis problems. First, we propose a new similarity measure between intuitionistic fuzzy values based on the medians of intervals, the Hausdorff distance, and the ratio of the uncertainty degrees of intuitionistic fuzzy values. We also prove some properties of the proposed similarity measure between intuitionistic fuzzy values. Then, based on the proposed similarity measure between intuitionistic fuzzy values, we propose a novel similarity measure between intuitionistic fuzzy sets. It can overcome the drawbacks of existing methods for measuring the degree of similarity between intuitionistic fuzzy sets. We also prove some properties of the proposed similarity measure between intuitionistic fuzzy sets. Finally, we apply the proposed similarity measure between intuitionistic fuzzy sets to deal with pattern recognition problems and medical diagnosis problems.", "paper_title": "A NOVEL SIMILARITY MEASURE BETWEEN INTUITIONISTIC FUZZY SETS AND ITS APPLICATIONS", "paper_id": "WOS:000327353700002"}