{"auto_keywords": [{"score": 0.03740843681471831, "phrase": "trend_animation"}, {"score": 0.03504330295761372, "phrase": "static_depictions"}, {"score": 0.031246924350827786, "phrase": "small_multiples_display"}, {"score": 0.00481495049065317, "phrase": "trend_visualization"}, {"score": 0.004551781491498328, "phrase": "multi-dimensional_data"}, {"score": 0.004376131419366239, "phrase": "new_prominence"}, {"score": 0.004207230913063179, "phrase": "gapminder_trendalyzer"}, {"score": 0.00413684709497912, "phrase": "trendalyzer"}, {"score": 0.004022137057452406, "phrase": "interesting_data"}, {"score": 0.003954837422946628, "phrase": "engaging_presenter"}, {"score": 0.0023560952790080943, "phrase": "fastest_technique"}, {"score": 0.0021049977753042253, "phrase": "least_effective_form"}], "paper_keywords": ["Information visualization", " animation", " trends", " design", " experiment"], "paper_abstract": "Animation has been used to show trends in multi-dimensional data. This technique has recently gained new prominence for presentations, most notably with Gapminder Trendalyzer. In Trendalyzer, animation together with interesting data and an engaging presenter helps the audience understand the results of an analysis of the data. It is less clear whether trend animation is effective for analysis. This paper proposes two alternative trend visualizations that use static depictions of trends: one which shows traces of all trends overlaid simultaneously in one display and a second that uses a small multiples display to show the trend traces side-by-side. The paper evaluates the three visualizations for both analysis and presentation. Results indicate that trend animation can be challenging to use even for presentations; while it is the fastest technique for presentation and participants find it enjoyable and exciting, it does lead to many participant errors. Animation is the least effective form for analysis; both static depictions of trends are significantly faster than animation, and the small multiples display is more accurate.", "paper_title": "Effectiveness of Animation in Trend Visualization", "paper_id": "WOS:000260384700026"}