{"auto_keywords": [{"score": 0.031554716442117194, "phrase": "bdtex"}, {"score": 0.004814951205790949, "phrase": "gqm"}, {"score": 0.00476308533086429, "phrase": "bayesian"}, {"score": 0.004508286991825192, "phrase": "negative_impact"}, {"score": 0.004054598617367474, "phrase": "quality_assessment"}, {"score": 0.003995697901740734, "phrase": "human-centric_process"}, {"score": 0.003952082333580496, "phrase": "contextual_data"}, {"score": 0.0035025108234594668, "phrase": "inherent_uncertainty"}, {"score": 0.0034642599795044445, "phrase": "detection_process"}, {"score": 0.00336428077531883, "phrase": "bayesian_detection_expert"}, {"score": 0.0032433414042726356, "phrase": "based_approach"}, {"score": 0.0032079118323314424, "phrase": "bayesian_belief_networks"}, {"score": 0.0030143100083252516, "phrase": "rule-based_models"}, {"score": 0.002948798472453167, "phrase": "blob_antipattern"}, {"score": 0.0025190543221075275, "phrase": "decor"}, {"score": 0.0023154527779996213, "phrase": "industrial_context"}, {"score": 0.002298544073884724, "phrase": "eclipse_jdt"}, {"score": 0.002248553559414903, "phrase": "novel_classification"}, {"score": 0.0021518035978153878, "phrase": "automatic_detection_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Code smells", " Antipatterns", " Detection"], "paper_abstract": "The presence of antipatterns can have a negative impact on the quality of a program. Consequently, their efficient detection has drawn the attention of both researchers and practitioners. However, most aspects of antipatterns are loosely specified because quality assessment is ultimately a human-centric process that requires contextual data. Consequently, there is always a degree of uncertainty on whether a class in a program is an antipattern or not. None of the existing automatic detection approaches handle the inherent uncertainty of the detection process. First, we present BDTEX (Bayesian Detection Expert), a Goal Question Metric (GQM) based approach to build Bayesian Belief Networks (BBNs) from the definitions of antipatterns. We discuss the advantages of BBNs over rule-based models and illustrate BDTEX on the Blob antipattern. Second, we validate BDTEX with three antipatterns: Blob, Functional Decomposition, and Spaghetti code, and two open-source programs: GanttProject v1.10.2 and Xerces v2.7.0. We also compare the results of BDTEX with those of another approach, DECOR, in terms of precision, recall, and utility. Finally, we also show the applicability of our approach in an industrial context using Eclipse JDT and JHotDraw and introduce a novel classification of antipatterns depending on the effort needed to map their definitions to automatic detection approaches. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "BDTEX: A GQM-based Bayesian approach for the detection of antipatterns", "paper_id": "WOS:000288142500004"}