{"auto_keywords": [{"score": 0.01014501256623573, "phrase": "alternative_dna_repair_pathways"}, {"score": 0.00712582126744694, "phrase": "dna_interstrand_cross-links"}, {"score": 0.004852348138089315, "phrase": "checkpoint_proteins"}, {"score": 0.004815031464759317, "phrase": "boolean"}, {"score": 0.0043527164193299574, "phrase": "chromosomal_instability_syndrome"}, {"score": 0.004271100220705305, "phrase": "inherited_mutations"}, {"score": 0.003717368939083015, "phrase": "spontaneous_chromosomal_aberrations"}, {"score": 0.0034461093496505127, "phrase": "dna_damage"}, {"score": 0.0032556926399045635, "phrase": "cell_cycle"}, {"score": 0.002887450071878095, "phrase": "dna_integrity"}, {"score": 0.0027625134766418266, "phrase": "boolean_network_model"}, {"score": 0.0024968185204913935, "phrase": "largest_network_model"}, {"score": 0.002449915958738505, "phrase": "dna_repair_pathway"}, {"score": 0.0023290951071300433, "phrase": "icl_repair_process"}, {"score": 0.0021589195238286233, "phrase": "recurrent_dna_damage"}, {"score": 0.0021049977753042253, "phrase": "dna_double-strand_breaks"}], "paper_keywords": [""], "paper_abstract": "Motivation: Fanconi anemia (FA) is a chromosomal instability syndrome originated by inherited mutations that impair the Fanconi Anemia/Breast Cancer (FA/BRCA) pathway, which is committed to the repair of DNA interstrand cross-links (ICLs). The disease displays increased spontaneous chromosomal aberrations and hypersensitivity to agents that create DNA interstrand cross-links. In spite of DNA damage, FA/BRCA-deficient cells are able to progress throughout the cell cycle, probably due to the activity of alternative DNA repair pathways, or due to defects in the checkpoints that monitor DNA integrity. Results: We propose a Boolean network model of the FA/BRCA pathway, Checkpoint proteins and some alternative DNA repair pathways. To our knowledge, this is the largest network model incorporating a DNA repair pathway. Our model is able to simulate the ICL repair process mediated by the FA/BRCA pathway, the activation of Checkpoint proteins observed by recurrent DNA damage, as well as the repair of DNA double-strand breaks and DNA adducts. We generated a series of simulations for mutants, some of which have never been reported and thus constitute predictions about the function of the FA/BRCA pathway. Finally, our model suggests alternative DNA repair pathways that become active whenever the FA/BRCA pathway is defective.", "paper_title": "A Boolean network model of the FA/BRCA pathway", "paper_id": "WOS:000301972900015"}