{"auto_keywords": [{"score": 0.048450141536466075, "phrase": "multi-agent_system"}, {"score": 0.00481495049065317, "phrase": "game_theoretic_study"}, {"score": 0.0038781372962808894, "phrase": "deep_need"}, {"score": 0.003828091961373454, "phrase": "collaborative_protocol"}, {"score": 0.0037623642073222547, "phrase": "multi-agent_transactions"}, {"score": 0.0036500346000495317, "phrase": "multi-agent_concept"}, {"score": 0.003480230347985338, "phrase": "game_theoretic_taste"}, {"score": 0.0033909518548844047, "phrase": "pre-learning_processes"}, {"score": 0.0031230216871739776, "phrase": "communicating_protocol"}, {"score": 0.00308269056870936, "phrase": "also_the_learning"}, {"score": 0.003003579442221871, "phrase": "concept_learning"}, {"score": 0.0024928553725344933, "phrase": "innovative_ideas"}, {"score": 0.0024606422183102382, "phrase": "multi-agent_realm"}, {"score": 0.0023562342764987254, "phrase": "reasoning_process"}], "paper_keywords": ["Agent", " Multi-agent systems", " Game theory", " Concept", " Learning", " Ontology", " Feature", " Non-unanimous concept", " Negotiation", " Group", " Voting", " Query", " Response"], "paper_abstract": "In this paper, we intend to have a game theoretic study on the concept learning problem in a multi-agent system. Concept learning is a very essential and well-studied domain of machine learning when it is studied under the characteristics of a multi-agent system. The most important reasons are the partiality of the environment perception for any agent and also the communication holdbacks, resulting into a deep need for a collaborative protocol in favor of multi-agent transactions. Here we wish to investigate multi-agent concept learning with the help of its components, thoroughly with a game theoretic taste, esp. on the pre-learning processes. Based on two standard notations, we address the non-unanimity of concepts, classification of objects, voting and communicating protocol, and also the learning itself. In such a game of concept learning, we consider a group of agents, communicating and consulting to upgrade their ontologies based on their conceptualizations of the environment. For this purpose, we investigate the problem in two separate and standard distinctions of game theory study, cooperation and competition. Several solution concepts and innovative ideas from the multi-agent realm are used to produce an approach that contains the reasoning process of the agents in this system. Some experimentations come at the end to show the functionality of our approach. These experimentations come distinctly for both cooperative and competitive views.", "paper_title": "Concept learning games", "paper_id": "WOS:000322901700011"}