{"auto_keywords": [{"score": 0.03326095884454222, "phrase": "web_censorship"}, {"score": 0.00481495049065317, "phrase": "web_censorship_worldwide"}, {"score": 0.004704187604192605, "phrase": "opennet_initiative_data"}, {"score": 0.004361428012479218, "phrase": "web_censorship_data"}, {"score": 0.0042610532651691305, "phrase": "opennet_initiative"}, {"score": 0.004162978902905443, "phrase": "user-based_testing"}, {"score": 0.004114787982556699, "phrase": "locally_relevant_content"}, {"score": 0.0032031180198375283, "phrase": "technical_means"}, {"score": 0.002952146666681891, "phrase": "prior_analyses"}, {"score": 0.002867348342846275, "phrase": "considerable_variability"}, {"score": 0.0022708315711029423, "phrase": "technical_analysis"}, {"score": 0.0021049977753042253, "phrase": "future_network_measurement_platforms"}], "paper_keywords": ["Measurement", " Security", " Censorship", " network measurement"], "paper_abstract": "In this study, we take another look at 5 years of web censorship data gathered by the OpenNet Initiative in 77 countries using user-based testing with locally relevant content. Prior to our work, this data had been analyzed with little automation, focusing on what content had been blocked, rather than how blocking was carried out. In this study, we use more rigorous automation to obtain a longitudinal, global view of the technical means used for web censorship. We also identify blocking that had been missed in prior analyses. Our results point to considerable variability in the technologies used for web censorship, across countries, time, and types of content, and even across ISPs in the same country. In addition to characterizing web censorship in countries that, thus far, have eluded technical analysis, we also discuss the implications of our observations on the design of future network measurement platforms and circumvention technologies.", "paper_title": "Characterizing Web Censorship Worldwide: Another Look at the OpenNet Initiative Data", "paper_id": "WOS:000348916600004"}