{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "design_outcomes"}, {"score": 0.004548253531664032, "phrase": "appropriate_triggers"}, {"score": 0.004337276328199398, "phrase": "solution_spaces"}, {"score": 0.004215397034321004, "phrase": "solution_space"}, {"score": 0.0040969285074699, "phrase": "creative_solutions"}, {"score": 0.00369022262431101, "phrase": "vital_role"}, {"score": 0.0032302647179383915, "phrase": "six_design_engineers"}, {"score": 0.002787406053363446, "phrase": "five_prespecified_triggers"}, {"score": 0.0026077803487003, "phrase": "trigger-representation_combination"}, {"score": 0.002359759876402679, "phrase": "design_engineers"}, {"score": 0.0022824314760583834, "phrase": "significant_influence"}, {"score": 0.0021049977753042253, "phrase": "resulting_ideas"}], "paper_keywords": ["creativity", " design representation", " multimodal", " trigger"], "paper_abstract": "Creativity of designers can be enhanced by the application of appropriate triggers. The presence of triggers helps designers to search solution spaces. The searching of a solution space increases the possibility of finding creative solutions. Both representation and content of the triggers or stimulus to which the designers are exposed are believed to play a vital role in the representation and content of the outcome of the designers during problem solving. We studied the effect of representation of triggers on ideas generated by six design engineers while trying to solve a given problem. A variety of representations (video/animation and audio, text, explanation, and others) that are potentially useful to designers for five prespecified triggers were administered to each designer, who generated ideas in response to each trigger-representation combination individually. The effect of representations of these triggers on the content and representation of the solutions generated by the design engineers was studied. The results showed significant influence of the representation of the triggers on the representations, number, and quality of the resulting ideas that were generated.", "paper_title": "The effect of representation of triggers on design outcomes", "paper_id": "WOS:000254593300003"}