{"auto_keywords": [{"score": 0.04934553301452922, "phrase": "wireless_sensor_networks"}, {"score": 0.02994167456199593, "phrase": "overall_energy_consumption"}, {"score": 0.00481495049065317, "phrase": "based_query_aggregation"}, {"score": 0.004355026964936104, "phrase": "wireless_sensor_network"}, {"score": 0.0042552618754756934, "phrase": "requested_data"}, {"score": 0.0038485929962942776, "phrase": "data_aggregation"}, {"score": 0.0034008496666026585, "phrase": "high_query_rates"}, {"score": 0.0033486631403337555, "phrase": "query_aggregation"}, {"score": 0.003051887221639784, "phrase": "effective_query_aggregation_algorithm"}, {"score": 0.0030283730114326014, "phrase": "saqa"}, {"score": 0.0026965813247045427, "phrase": "new_aggregation_algorithm"}, {"score": 0.002476546030310661, "phrase": "original_queries"}, {"score": 0.0021049977753042253, "phrase": "sensor_network_lifetime"}], "paper_keywords": [""], "paper_abstract": "In most wireless sensor networks, applications submit their requests as queries and wireless sensor network transmits the requested data to the applications. However, most existing work in this area focuses on data aggregation, not much attention has been paid to query aggregation. For many applications, especially ones with high query rates, query aggregation is very important. In this paper, we design an effective query aggregation algorithm SAQA to reduce the number of duplicate/overlapping queries and save overall energy consumption in the wireless sensor networks. This new aggregation algorithm focuses on the duplicate/overlapping spatial and attribute information in the original queries submitted by the applications. Our performance evaluations show that by applying our query aggregation algorithm, the overall energy consumption can be significantly reduced and the sensor network lifetime can be prolonged correspondingly.", "paper_title": "SAQA: Spatial and attribute based query aggregation in wireless sensor networks", "paper_id": "WOS:000239570300003"}