{"auto_keywords": [{"score": 0.045768011357986534, "phrase": "dmpo"}, {"score": 0.03617574288837127, "phrase": "weak_interactions"}, {"score": 0.015719716506582538, "phrase": "transition_state"}, {"score": 0.014660020266338492, "phrase": "ts"}, {"score": 0.00478672147169923, "phrase": "fast_reactions"}, {"score": 0.0046480280613451, "phrase": "dmpo-a_dft_approach"}, {"score": 0.004434391660327048, "phrase": "trapping_reaction"}, {"score": 0.004268032298330859, "phrase": "molecular_mechanisms"}, {"score": 0.003749747076821239, "phrase": "intrinsic_reaction"}, {"score": 0.0036624867688882356, "phrase": "new_understandings"}, {"score": 0.003535375475035123, "phrase": "reaction_paths"}, {"score": 0.0034026280732569773, "phrase": "charge_transfer"}, {"score": 0.0030966491684507646, "phrase": "stronger_mo_interactions"}, {"score": 0.002919505506619585, "phrase": "significant_mo_interactions"}, {"score": 0.002885308262488126, "phrase": "relatively_small_contribution"}, {"score": 0.0026962843404969286, "phrase": "unpaired_electron"}, {"score": 0.0024900877185228647, "phrase": "beta_orbitals"}, {"score": 0.0022197067349433897, "phrase": "resultant_theoretical_models"}, {"score": 0.002180793657565869, "phrase": "hyperfine_coupling_constants"}, {"score": 0.002155230514219992, "phrase": "biological-esr_spin"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Density functional theory", " Spin-trapping", " Free radical", " DMPO", " Hydroxyl and methyl radicals", " Electron spin resonance"], "paper_abstract": "Up to date, attempts to locate the transition state (TS) for the trapping reaction between (OH)-O-center dot and DMPO have been unsuccessful, and the lack of molecular mechanisms by which (OH)-O-center dot binds to the spin-trap constitutes a question still unsolved. Herein, we have taken a step forward on this task by describing the theoretical IS for the trapping of 'OH and (CH3)-C-center dot by DMPO and the intrinsic reaction coordinates. This work aims to provide new understandings on the molecular orbital (MO) interactions that rule these reaction paths. Besides we assessed the degree of involvement of weak interactions and the charge transfer (CT) phenomenon involved in such interactions. Regarding the trapping of (OH)-O-center dot, the beginning of the reaction would be ruled by weak interactions to then give way to stronger MO interactions conducive to the formation of the TS. For (CH3)-C-center dot, the reaction is, instead, early ruled by significant MO interactions, and a relatively small contribution in the weak interactions range. At the TS, both reactions share the formation of an antibonding orbital responsible for hosting the unpaired electron, and two bonding orbitals between the radical and the spin-trap. Additionally, the charge is transferred primarily from DMPO to (OH)-O-center dot through beta orbitals, while for (CH3)-C-center dot, the CT occurs in both directions, so that while DMPO behaves like an alpha-acceptor/beta-donor, (CH3)-C-center dot acts as a beta-acceptor/alpha-donor. Finally, we provide evidence showing that the resultant theoretical models are in agreement with the hyperfine coupling constants as obtained from biological-ESR spin trapping experiments. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Identification of the transition state for fast reactions: The trapping of hydroxyl and methyl radicals by DMPO-A DFT approach", "paper_id": "WOS:000349278200007"}