{"auto_keywords": [{"score": 0.05007542047017057, "phrase": "fasdim"}, {"score": 0.04940127790362786, "phrase": "simple_de-identification"}, {"score": 0.04207327056775179, "phrase": "french"}, {"score": 0.004706821999798591, "phrase": "unstructured_free-text_clinical_records"}, {"score": 0.004653667500876187, "phrase": "medical_free-text_records"}, {"score": 0.004601110504747972, "phrase": "rich_information"}, {"score": 0.004396725551762061, "phrase": "protected_health_information"}, {"score": 0.004189463229526967, "phrase": "matching_techniques"}, {"score": 0.0041657281535389615, "phrase": "pre-defined_dictionaries"}, {"score": 0.004118658982032481, "phrase": "learning_techniques"}, {"score": 0.004083705021550205, "phrase": "extensive_training"}, {"score": 0.003958049372486465, "phrase": "weak_results"}, {"score": 0.003718175518916747, "phrase": "french_medical_free-text_records"}, {"score": 0.0035629847652158663, "phrase": "authorized_word_list"}, {"score": 0.00343371736655812, "phrase": "protection_patterns"}, {"score": 0.003404556450666522, "phrase": "corresponding_lists"}, {"score": 0.00317095235382607, "phrase": "records_de-identification"}, {"score": 0.0030820480406334927, "phrase": "independent_medical_experts"}, {"score": 0.002978637124196612, "phrase": "fasdim."}, {"score": 0.002758437099292967, "phrase": "authorized_words"}, {"score": 0.0026058621464926826, "phrase": "removed_protected_health_information"}, {"score": 0.0025493352590918667, "phrase": "precision"}, {"score": 0.0025188494638691125, "phrase": "phi"}, {"score": 0.0024969812322112174, "phrase": "removed_token"}, {"score": 0.002253826965566618, "phrase": "good_results"}, {"score": 0.0021412594173592513, "phrase": "predefined_dictionary"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Anonymization", " De-identification", " Confidentiality", " Free text", " Natural language processing"], "paper_abstract": "Purpose: Medical free-text records enable to get rich information about the patients, but often need to be de-identified by removing the Protected Health Information (PHI), each time the identification of the patient is not mandatory. Pattern matching techniques require pre-defined dictionaries, and machine learning techniques require an extensive training set. Methods exist in French, but either bring weak results or are not freely available. The objective is to define and evaluate FASDIM, a Fast And Simple De-Identification Method for French medical free-text records. Methods: FASDIM consists in removing all the words that are not present in the authorized word list, and in removing all the numbers except those that match a list of protection patterns. The corresponding lists are incremented in the course of the iterations of the method. For the evaluation, the workload is estimated in the course of records de-identification. The efficiency of the de-identification is assessed by independent medical experts on 508 discharge letters that are randomly selected and de-identified by FASDIM. Finally, the letters are encoded after and before de-identification according to 3 terminologies (ATC, ICD10, CCAM) and the codes are compared. Results: The construction of the list of authorized words is progressive: 12 h for the first 7000 letters, 16 additional hours for 20,000 additional letters. The Recall (proportion of removed Protected Health Information, PHI) is 98.1%, the Precision (proportion of PHI within the removed token) is 79.6% and the F-measure (harmonic mean) is 87.9%. In average 30.6 terminology codes are encoded per letter, and 99.02% of those codes are preserved despite the de-identification. Conclusion: FASDIM gets good results in French and is freely available. It is easy to implement and does not require any predefined dictionary. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Proposal and evaluation of FASDIM, a Fast And Simple De-Identification Method for unstructured free-text clinical records", "paper_id": "WOS:000332397200008"}