{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "playout_scheduling"}, {"score": 0.004377806391261418, "phrase": "adopted_playout_policy"}, {"score": 0.004247180402119585, "phrase": "streaming_systems"}, {"score": 0.003980191398041843, "phrase": "playout_points"}, {"score": 0.003945879572348638, "phrase": "different_nodes"}, {"score": 0.003634262647873338, "phrase": "different_playout_points"}, {"score": 0.003361702510958392, "phrase": "late_frames"}, {"score": 0.0032331613500559764, "phrase": "strict_bidirectional_interactivity_requirements"}, {"score": 0.0030166226457616616, "phrase": "available_frames"}, {"score": 0.002990592465417758, "phrase": "different_playout_buffers"}, {"score": 0.0028762004595878714, "phrase": "upstream_relay_nodes"}, {"score": 0.0027304365438083874, "phrase": "playout_quality"}, {"score": 0.002525489173110693, "phrase": "diverging_playout_points"}, {"score": 0.0024713335323674223, "phrase": "upstream_parents"}, {"score": 0.0024183363693242943, "phrase": "gapless_relay"}, {"score": 0.0022464835515931592, "phrase": "fundamental_philosophy"}, {"score": 0.002169882514603539, "phrase": "original_service_point"}], "paper_keywords": ["Playout scheduling", " Video streaming", " Peer-to-peer streaming"], "paper_abstract": "In this paper we examine the impact of the adopted playout policy on the performance of P2P live streaming systems. We argue and demonstrate experimentally that (popular) playout policies which permit the divergence of the playout points of different nodes can deteriorate drastically the performance of P2P live streaming. Consequently, we argue in favor of keeping different playout points \"near-in-time\", even if this requires sacrificing (dropping) some late frames that could otherwise be rendered (assuming no strict bidirectional interactivity requirements are in place). Such nearly synchronized playout policies create \"positive correlation\" with respect to the available frames at different playout buffers. Therefore, they increase the number of upstream relay nodes from which a node can pull frames and thus boost the playout quality of both single-parent (tree) and multiple-parent (mesh) systems. On the contrary, diverging playout points reduce the number of upstream parents that can offer a gapless relay of the stream. This is clearly undesirable and should be avoided as it contradicts the fundamental philosophy of P2P systems which is to supplement an original service point with as many additional ones presented by the very own users of the service. (C) 2008 Elsevier B.V. All rights reserved", "paper_title": "On the impact of playout scheduling on the performance of peer-to-peer live streaming", "paper_id": "WOS:000264083300003"}