{"auto_keywords": [{"score": 0.04013856515910984, "phrase": "physicochemical_properties"}, {"score": 0.004648292940755605, "phrase": "property_distributions"}, {"score": 0.004574449773348889, "phrase": "successful_design"}, {"score": 0.0044873778175404475, "phrase": "nutritional_supplements"}, {"score": 0.0043738432231020885, "phrase": "great_importance"}, {"score": 0.003909828033238252, "phrase": "small_organic_molecules"}, {"score": 0.0037262941538784094, "phrase": "characteristic_features"}, {"score": 0.003631945391344252, "phrase": "human_metabolites"}, {"score": 0.003608732492631878, "phrase": "tcm_molecules"}, {"score": 0.003330746760940307, "phrase": "physicochemical_property_space"}, {"score": 0.0032672702570491164, "phrase": "holistic_perspective"}, {"score": 0.0032256239062596944, "phrase": "data_set"}, {"score": 0.0031439119753810434, "phrase": "metabolic_system"}, {"score": 0.0030642636185693054, "phrase": "rapid_elimination"}, {"score": 0.0030058503645435455, "phrase": "third_part"}, {"score": 0.002967526288858809, "phrase": "global_shifts"}, {"score": 0.0029109517286657486, "phrase": "individual_metabolic_reactions"}, {"score": 0.0028830690329478465, "phrase": "better_resolution"}, {"score": 0.0027830917623582903, "phrase": "ii_biotransformations"}, {"score": 0.002495411946660959, "phrase": "enhanced_efficacy"}, {"score": 0.002125371638869951, "phrase": "large_molecules"}, {"score": 0.0021049977753042253, "phrase": "phase_ii_conjugates"}], "paper_keywords": [""], "paper_abstract": "Understanding which physicochemical properties, or property distributions, are favorable for successful design and development of drugs, nutritional supplements, cosmetics, and agrochemicals is of great importance. In this study we have analyzed molecules from three distinct chemical spaces (i) approved drugs, (ii) human metabolites, and (iii) traditional Chinese medicine (TCM) to investigate four aspects determining the disposition of small organic molecules. First, we examined the physicochemical properties of these three classes of molecules and identified characteristic features resulting from their distinctive biological functions. For example, human metabolites and TCM molecules can be larger and more hydrophobic than drugs, which makes them less likely to cross membranes. We then quantified the shifts in physicochemical property space induced by metabolism from a holistic perspective by analyzing a data set of several thousand experimentally observed metabolic trees. Results show how the metabolic system aims to retain nutrients/micronutrients while facilitating a rapid elimination of xenobiotics. In the third part we compared these global shifts with the contributions made by individual metabolic reactions. For better resolution, all reactions were classified into phase I and phase II biotransformations. Interestingly, not all metabolic reactions lead to more hydrophilic molecules. We were able to identify biotransformations leading to an increase of logP by more than one log unit, which could be used for the design of drugs with enhanced efficacy. The study closes with the analysis of the physicochemical properties of metabolites found in the bile, faeces, and urine. Metabolites in the bile can be large and are often negatively charged. Molecules with molecular weight >500 Da are rarely found in the urine, and most of these large molecules are charged phase II conjugates.", "paper_title": "How Do Metabolites Differ from Their Parent Molecules and How Are They Excreted?", "paper_id": "WOS:000315478900006"}