{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "elastic_properties"}, {"score": 0.0077353992631212735, "phrase": "percolation_threshold"}, {"score": 0.004655285779819366, "phrase": "early_ages"}, {"score": 0.004500891637057374, "phrase": "numerical_calculation"}, {"score": 0.004376131419366239, "phrase": "simulated_microstructure"}, {"score": 0.004327196832280818, "phrase": "cement_paste"}, {"score": 0.0041136473765874815, "phrase": "accurate_results"}, {"score": 0.003954837422946628, "phrase": "tricalcium_silicate_pastes"}, {"score": 0.0034166271604770576, "phrase": "meshing_procedure"}, {"score": 0.0033594249301033604, "phrase": "simulated_elastic_moduli"}, {"score": 0.00266693888510356, "phrase": "vector_microstructures"}, {"score": 0.002535115422089855, "phrase": "better_agreement"}, {"score": 0.0024926348205500715, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "calcium_silicate_hydrate"}], "paper_keywords": ["elastic properties", " Ca3SiO5", " microstructure", " hydration", " finite element analysis"], "paper_abstract": "This paper describes the numerical calculation of elastic properties of a simulated microstructure of cement paste from very early age, when most previous models fail to give accurate results. The development of elastic properties of tricalcium silicate pastes was calculated by discretising a numerical resolution-free 3D vector microstructure to a regular cubic mesh. Due to the connections formed in the microstructure as an artefact of the meshing procedure, the simulated elastic moduli were found to be higher than expected. Furthermore, the percolation of the solids was found to occur even before hydration started. A procedure to remove these artefacts, on the basis of the information available in the vector microstructures was developed. After this correction, a better agreement of the experimental results with calculations was obtained between 20% and 40% hydration. However, percolation threshold was found to be delayed significantly. More realistic estimates of percolation threshold were obtained if either flocculation or a densification of calcium silicate hydrate with hydration was assumed.", "paper_title": "Microstructural modelling of the elastic properties of tricalcium silicate pastes at early ages", "paper_id": "WOS:000358477700007"}