{"auto_keywords": [{"score": 0.038209904942478966, "phrase": "total_flow_time"}, {"score": 0.00481495049065317, "phrase": "flow_time"}, {"score": 0.0047090997998449095, "phrase": "energy-efficient_scheduling"}, {"score": 0.004167001961564886, "phrase": "scheduling_algorithm"}, {"score": 0.004045230861702083, "phrase": "processor_allocations"}, {"score": 0.004015345955907906, "phrase": "processor_speeds"}, {"score": 0.003941592232278979, "phrase": "parallel_jobs"}, {"score": 0.003912469968653304, "phrase": "time-varying_parallelism"}, {"score": 0.0037560869590718966, "phrase": "total_energy_consumption"}, {"score": 0.0032622464094096463, "phrase": "remaining_parallelism"}, {"score": 0.0030401601744013767, "phrase": "best_known_non-clairvoyant_algorithm"}, {"score": 0.002582032847722892, "phrase": "non-clairvoyant_scheduling"}, {"score": 0.0024061422012437344, "phrase": "arbitrary_release_time"}, {"score": 0.0023184226291364097, "phrase": "identical_release_time"}, {"score": 0.002176560171729638, "phrase": "competitive_ratio"}, {"score": 0.002152440300818582, "phrase": "non-clairvoyant_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multiprocessors", " Online scheduling", " Dynamic speed scaling", " Energy-performance tradeoff", " Competitive analysis", " Total flow time", " Makespan"], "paper_abstract": "We consider energy-efficient scheduling on multiprocessors, where the speed of each processor can be individually scaled, and a processor consumes power s(alpha) when running at speed s, for alpha > 1. A scheduling algorithm needs to decide at any time both processor allocations and processor speeds for a set of parallel jobs with time-varying parallelism. The objective is to minimize the sum of the total energy consumption and certain performance metric, which in this paper includes total flow time and makespan. For both objectives, we present instantaneous parallelism-clairvoyant (IP-clairvoyant) algorithms that are aware of the instantaneous parallelism of the jobs at any time but not their future characteristics, such as remaining parallelism and work. For total flow time plus energy, we present an O (1)-competitive algorithm, which significantly improves upon the best known non-clairvoyant algorithm. In the case of makespan plus energy, we present an O (ln(1-1/alpha) P)-competitive algorithm, where P is the total number of processors. We show that this algorithm is asymptotically optimal by providing a matching lower bound. In addition, we study non-clairvoyant scheduling for total flow time plus energy, and present an algorithm that is O (ln P)-competitive for jobs with arbitrary release time and O (ln(1/alpha) P)-competitive for jobs with identical release time. Finally, we prove an Omega (ln(1/alpha) P) lower bound on the competitive ratio of any non-clairvoyant algorithm. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Energy-efficient multiprocessor scheduling for flow time and makespan", "paper_id": "WOS:000341551600001"}