{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "memory_clients"}, {"score": 0.049725544371589304, "phrase": "memory_channels"}, {"score": 0.004744123493964429, "phrase": "ever-increasing_demands"}, {"score": 0.0047090997998449095, "phrase": "main_memory_bandwidth"}, {"score": 0.00452101969521343, "phrase": "multiple_memory_channels"}, {"score": 0.004454497011118188, "phrase": "wide_io"}, {"score": 0.004356535752468849, "phrase": "multichannel_memory"}, {"score": 0.0043083624695326745, "phrase": "shared_resource"}, {"score": 0.004276541976450121, "phrase": "multiprocessor_real-time_systems"}, {"score": 0.003956234229826621, "phrase": "memory_capacity"}, {"score": 0.003840598580753804, "phrase": "real-time_memory_controller"}, {"score": 0.0036598289615980837, "phrase": "multichannel_memories"}, {"score": 0.0036327808996444904, "phrase": "real-time_systems"}, {"score": 0.0032381271420557052, "phrase": "novel_method"}, {"score": 0.0031786037839399055, "phrase": "-physical_address_translation"}, {"score": 0.0029077288662492894, "phrase": "integer_programming_formulation"}, {"score": 0.002875529792120695, "phrase": "mapping_problem"}, {"score": 0.002740059168271987, "phrase": "real-time_guarantees"}, {"score": 0.002543967677678384, "phrase": "mapping_problem_formulation"}, {"score": 0.0024879169065840493, "phrase": "heuristic_algorithm"}, {"score": 0.0024330980793680337, "phrase": "computation_time"}, {"score": 0.002344398099179438, "phrase": "optimal_solution"}, {"score": 0.0021927897271015657, "phrase": "realistically_sized_problems"}, {"score": 0.002128587147609539, "phrase": "wide_io_dram"}], "paper_keywords": ["Algorithms", " Design", " Performance", " Multichannel memories", " memory controller", " optimal mapping", " heuristic algorithm"], "paper_abstract": "Ever-increasing demands for main memory bandwidth and memory speed/power tradeoff led to the introduction of memories with multiple memory channels, such as Wide IO DRAM. Efficient utilization of a multichannel memory as a shared resource in multiprocessor real-time systems depends on mapping of the memory clients to the memory channels according to their requirements on latency, bandwidth, communication, and memory capacity. However, there is currently no real-time memory controller for multichannel memories, and there is no methodology to optimally configure multichannel memories in real-time systems. As a first work toward this direction, we present two main contributions in this article: (1) a configurable real-time multichannel memory controller architecture with a novel method for logical-to-physical address translation and (2) two design-time methods to map memory clients to the memory channels, one an optimal algorithm based on an integer programming formulation of the mapping problem, and the other a fast heuristic algorithm. We demonstrate the real-time guarantees on bandwidth and latency provided by our multichannel memory controller architecture by experimental evaluation. Furthermore, we compare the performance of the mapping problem formulation in a solver and the heuristic algorithm against two existing mapping algorithms in terms of computation time and mapping success ratio. We show that an optimal solution can be found in 2 hours using the solver and in less than 1 second with less than 7% mapping failure using the heuristic for realistically sized problems. Finally, we demonstrate configuring a Wide IO DRAM in a high-definition (HD) video and graphics processing system to emphasize the practical applicability and effectiveness of this work.", "paper_title": "A Real-Time Multichannel Memory Controller and Optimal Mapping of Memory Clients to Memory Channels", "paper_id": "WOS:000352224800006"}