{"auto_keywords": [{"score": 0.04370085000080102, "phrase": "access_structure"}, {"score": 0.00657606195929295, "phrase": "secret-sharing_scheme"}, {"score": 0.006265736012462119, "phrase": "brickell"}, {"score": 0.006228010240012088, "phrase": "davenport"}, {"score": 0.0058449710225569815, "phrase": "necessary_condition"}, {"score": 0.00481495049065317, "phrase": "nonideal_secret_sharing"}, {"score": 0.004785896736401194, "phrase": "secret-sharing_schemes"}, {"score": 0.004559661374976129, "phrase": "secret_string"}, {"score": 0.004278807087784626, "phrase": "authorized_sets"}, {"score": 0.0037449799711986, "phrase": "ideal_access_structures"}, {"score": 0.003189336613974265, "phrase": "ideal_scheme"}, {"score": 0.003141364320497748, "phrase": "access_structures"}, {"score": 0.0030383422480050573, "phrase": "main_result"}, {"score": 0.0029565723712576086, "phrase": "seymour"}, {"score": 0.0028251102433433433, "phrase": "vamos_matroid"}, {"score": 0.0025951294037626174, "phrase": "second_result"}, {"score": 0.0025794354905140527, "phrase": "nonideal_secret-sharing_schemes"}, {"score": 0.002405618568415162, "phrase": "lower_and_upper_bounds"}, {"score": 0.002298605785178457, "phrase": "nonideal_schemes"}, {"score": 0.0021567204376536503, "phrase": "ideal_schemes"}, {"score": 0.0021049977753042253, "phrase": "nonideal_access_structure"}], "paper_keywords": ["secret-sharing schemes", " Vamos matroid", " weakly private secret-sharing schemes"], "paper_abstract": "Secret-sharing schemes are a tool used in many cryptographic protocols. In these schemes, a dealer holding a secret string distributes shares to the parties such that only authorized subsets of participants can reconstruct the secret from their shares. The collection of authorized sets is called an access structure. An access structure is ideal if there is a secret-sharing scheme realizing it such that the shares are taken from the same domain as the secrets. Brickell and Davenport (Journal of Cryptology, 1991) have shown that ideal access structures are closely related to matroids. They give a necessary condition for an access structure to be ideal-the access structure must be induced by a matroid. Seymour (Journal of Combinatorial Theory B, 1992) has proved that the necessary condition is not sufficient: There exists an access structure induced by a matroid that does not have an ideal scheme. The research on access structures induced by matroids is continued in this work. The main result in this paper is strengthening the result of Seymour. It is shown that in any secret-sharing scheme realizing the access structure induced by the Vamos matroid with domain of the secrets of size k, the size of the domain of the shares is at least k + Omega(root k). The second result considers nonideal secret-sharing schemes realizing access structures induced by matroids. It is proved that the fact that an access structure is induced by a matroid implies lower and upper bounds on the size of the domain of shares of subsets of participants even in nonideal schemes (as long as the shares are still relatively short). This generalized results of Brickell and Davenport for ideal schemes. Finally, an example of a nonideal access structure that is nearly ideal is presented.", "paper_title": "On matroids and nonideal secret sharing", "paper_id": "WOS:000258033700018"}