{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "casual_point-and-tilt_interactions"}, {"score": 0.004231699728933577, "phrase": "mobile_devices"}, {"score": 0.003835972725191194, "phrase": "rich_record"}, {"score": 0.0031845067058084583, "phrase": "visual_map_feedback"}, {"score": 0.0030872017736888113, "phrase": "simpler_visual_interface"}, {"score": 0.0030083825666563898, "phrase": "eyes-free_interaction"}, {"score": 0.0027837615811247963, "phrase": "visual_display"}, {"score": 0.0026026666736474404, "phrase": "interaction_styles"}, {"score": 0.0024586427394152196, "phrase": "interaction_speed"}, {"score": 0.0023958326775913165, "phrase": "interaction_methods"}, {"score": 0.0021826828321952615, "phrase": "wider_class"}, {"score": 0.0021049977753042253, "phrase": "mobile_spatial_information_access"}], "paper_keywords": [""], "paper_abstract": "People record and share their experiences through text, audio and video. Increasingly they do this blogging from mobile devices. We illustrate a novel, mobile, low interaction cost approach to support the creation of a rich record of journeys made and places encountered: by pointing and tilting a mobile, users indicate their interests in a location. We built three mobile prototypes to explore the approach-the first one combines gestures and visual map feedback; the second provides a simpler visual interface; the third supports eyes-free interaction, allowing the user to simply point-and-tilt, with no visual display required. We describe two field studies undertaken to understand the value of the interaction styles afforded, then continue with a further user study to assess the interaction speed and accuracy between these interaction methods. We present the results of these studies and raise issues relevant to their design and to the wider class of devices and services concerned with mobile spatial information access.", "paper_title": "Exploring casual point-and-tilt interactions for mobile geo-blogging", "paper_id": "WOS:000277245300005"}