{"auto_keywords": [{"score": 0.04923607408107278, "phrase": "multimedia_delivery"}, {"score": 0.00481495049065317, "phrase": "service_provision"}, {"score": 0.004772367030970874, "phrase": "cloud-based_storage_system"}, {"score": 0.00436661740263741, "phrase": "major_traffic"}, {"score": 0.0037542011329731386, "phrase": "youtube"}, {"score": 0.0035590664550919854, "phrase": "media_content"}, {"score": 0.0034807976670686628, "phrase": "traditional_cloud-based_storage"}, {"score": 0.003299880298525127, "phrase": "storages_devices"}, {"score": 0.0031703706626348507, "phrase": "performance_bottleneck"}, {"score": 0.003128336741911927, "phrase": "whole_system"}, {"score": 0.0030459283281463953, "phrase": "differential_classes"}, {"score": 0.0029789104204803137, "phrase": "large-scale_situation"}, {"score": 0.0026534064006291853, "phrase": "adaptive_quality_of_service"}, {"score": 0.0025492038831408715, "phrase": "differential_service_levels"}, {"score": 0.0023113506171584157, "phrase": "overall_system_performance"}, {"score": 0.002290858045013009, "phrase": "fault_tolerance"}, {"score": 0.002250415129116109, "phrase": "experiment_results"}, {"score": 0.00221068461235127, "phrase": "proposed_system"}, {"score": 0.0021049977753042253, "phrase": "practical_commercial_service_environment"}], "paper_keywords": ["Cloud computing", " content delivery system", " multimedia application"], "paper_abstract": "With the emergence of various multimedia applications, service and devices, multimedia delivery is expected to become the major traffic of Internet which will keep increasing rapidly. In order to serve such large scale multimedia applications, more and more service providers store their video assets in the cloud and delivery streaming to their consumers cross cloud, for example, YouTube. Along with the growth of users and the amount of media content constantly being produced, traditional cloud-based storage has two drawbacks. First, a lot of servers and storages devices are needed, which could easily be the performance bottleneck in the whole system. Second, to provide differential classes of services in the large-scale situation, system tends to need many additional devices. This article proposes a robust, scalable, highly available and service level provisioning cloud-based storage system designed specifically for distributing multimedia content. The proposed system contains a proven Adaptive Quality of Service (AQoS) algorithm in order to provide differential service levels. The system can also be used flexibly in large, medium and small-scale environment. In addition, some algorithms are also developed to increase overall system performance and fault tolerance. Implementations and experiment results show that the proposed system can meet the requirements both in the laboratory and a practical commercial service environment.", "paper_title": "Quality of Service Provision in Cloud-based Storage System for Multimedia Delivery", "paper_id": "WOS:000331983100033"}