{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "paedophile_activity"}, {"score": 0.01154860262063986, "phrase": "paedophile_queries"}, {"score": 0.0046937237797352515, "phrase": "increasing_knowledge"}, {"score": 0.004529093447865156, "phrase": "crucial_societal_concern"}, {"score": 0.004460309246062286, "phrase": "important_consequences"}, {"score": 0.0044150318724093226, "phrase": "child_protection"}, {"score": 0.00437021209960886, "phrase": "policy_making"}, {"score": 0.0040481944502103505, "phrase": "rigorous_analysis_methodology"}, {"score": 0.0032336801561165113, "phrase": "-based_queries"}, {"score": 0.0031521392193570846, "phrase": "paedophile_query_detection_tool"}, {"score": 0.0030726480920918097, "phrase": "false_positive_and_false_negative_rates"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Log analysis", " Information retrieval", " Computer networks", " Measurement", " Paedophile activity"], "paper_abstract": "Increasing knowledge of paedophile activity in P2P systems is a crucial societal concern, with important consequences on child protection, policy making, and internet regulation. Because of a lack of traces of P2P exchanges and rigorous analysis methodology, however, current knowledge of this activity remains very limited. We consider here a widely used P2P system, eDonkey, and focus on two key statistics: the fraction of paedophile queries entered in the system and the fraction of users who entered such queries. We collect hundreds of millions of keyword-based queries; we design a paedophile query detection tool for which we establish false positive and false negative rates using assessment by experts; with this tool and these rates, we then estimate the fraction of paedophile queries in our data; finally, we design and apply methods for quantifying users who entered such queries. We conclude that approximately 0.25% of queries are paedophile, and that more than 0.2% of users enter such queries. These statistics are by far the most precise and reliable ever obtained in this domain. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Quantifying paedophile activity in a large P2P system", "paper_id": "WOS:000313466600017"}