{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "query_result_diversification"}, {"score": 0.00953513926250309, "phrase": "k_tuples"}, {"score": 0.008361403526464625, "phrase": "objective_function"}, {"score": 0.004732100994830163, "phrase": "bi-criteria_optimization_problem"}, {"score": 0.004602483094756597, "phrase": "database_d"}, {"score": 0.0045547927862194856, "phrase": "query_q"}, {"score": 0.0035468507553681034, "phrase": "information_retrieval"}, {"score": 0.0035100601949451028, "phrase": "operations_research"}, {"score": 0.003413800638453572, "phrase": "result_diversification"}, {"score": 0.003390149669470349, "phrase": "relational_queries"}, {"score": 0.00266693888510356, "phrase": "query_languages"}, {"score": 0.0026027798552168344, "phrase": "gollapudi"}, {"score": 0.0025847365657453007, "phrase": "sharma"}, {"score": 0.0025137856138000036, "phrase": "upper_and_lower_bounds"}, {"score": 0.002427826856342292, "phrase": "combined_complexity"}, {"score": 0.0024109902338204873, "phrase": "data_complexity"}, {"score": 0.0022963507669678815, "phrase": "tractable_cases"}, {"score": 0.0021795515361987144, "phrase": "compatibility_constraints"}], "paper_keywords": ["Design", " Algorithms", " Theory", " Result diversification", " relevance", " diversity", " recommender systems", " database queries", " combined complexity", " data complexity", " counting problems"], "paper_abstract": "Query result diversification is a bi-criteria optimization problem for ranking query results. Given a database D, a query Q, and a positive integer k, it is to find a set of k tuples from Q(D) such that the tuples are as relevant as possible to the query, and at the same time, as diverse as possible to each other. Subsets of Q(D) are ranked by an objective function defined in terms of relevance and diversity. Query result diversification has found a variety of applications in databases, information retrieval, and operations research. This article investigates the complexity of result diversification for relational queries. (1) We identify three problems in connection with query result diversification, to determine whether there exists a set of k tuples that is ranked above a bound with respect to relevance and diversity, to assess the rank of a given k-element set, and to count how many k-element sets are ranked above a given bound based on an objective function. (2) We study these problems for a variety of query languages and for the three objective functions proposed in Gollapudi and Sharma [2009]. We establish the upper and lower bounds of these problems, all matching, for both combined complexity and data complexity. (3) We also investigate several special settings of these problems, identifying tractable cases. Moreover, (4) we reinvestigate these problems in the presence of compatibility constraints commonly found in practice, and provide their complexity in all these settings.", "paper_title": "On the Complexity of Query Result Diversification", "paper_id": "WOS:000336443800006"}