{"auto_keywords": [{"score": 0.04951738916270167, "phrase": "enterprise_interoperability"}, {"score": 0.00481495049065317, "phrase": "technical_service_level"}, {"score": 0.004154332348800334, "phrase": "business_level"}, {"score": 0.00387011040370557, "phrase": "interoperability_solutions"}, {"score": 0.003459191419478298, "phrase": "model_transformations"}, {"score": 0.0027796495180095657, "phrase": "so-called_choreography"}, {"score": 0.0024405312482831646, "phrase": "actual_technical_services"}, {"score": 0.0023976048394496446, "phrase": "interoperating_enterprises"}, {"score": 0.0023139986108451967, "phrase": "technical_challenges"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "Enterprise Interoperability is the ability of enterprises to interoperate in order to achieve their business goals. Although the purpose of enterprise interoperability is determined at the business level, the use of technical (IT) services to support business services implies that interoperability solutions at both the business and technical level should be aligned. This paper introduces and demonstrates the suitability of an approach based on model transformations to automate enterprise interoperability. We start by considering that a set of enterprises are willing to interoperate in the context of their individual goals. The interactions necessary for their cooperation are then properly captured in terms of a so-called choreography. Our approach allows a choreography to be mapped and transformed to an orchestration, which defines the operation of the actual technical services of the interoperating enterprises. The paper discusses the technical challenges of implementing the transformation, and illustrates our approach with two application scenarios. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Model-driven approach to enterprise interoperability at the technical service level", "paper_id": "WOS:000325675600007"}