{"auto_keywords": [{"score": 0.04691761730258079, "phrase": "range-free_positioning_algorithms"}, {"score": 0.03171223291640471, "phrase": "probabilistic_multilateration_method"}, {"score": 0.02659838519836964, "phrase": "dv-hop"}, {"score": 0.00481495049065317, "phrase": "location_estimation"}, {"score": 0.004534136929881113, "phrase": "specialized_hardware"}, {"score": 0.004237666411136617, "phrase": "mobile_ad_hoc_network"}, {"score": 0.003916098498242888, "phrase": "gps_system"}, {"score": 0.003771631577951067, "phrase": "main_weakness"}, {"score": 0.003382017342396959, "phrase": "reference_nodes"}, {"score": 0.003113441660343867, "phrase": "range-free_positioning_systems"}, {"score": 0.002628506002255396, "phrase": "proposed_method"}, {"score": 0.0025795066118838067, "phrase": "detailed_simulation-based_analysis"}, {"score": 0.0024842350145129173, "phrase": "amorphous"}, {"score": 0.0024657026976656134, "phrase": "centroid"}, {"score": 0.0024471021586248394, "phrase": "apit"}, {"score": 0.0024014759148123736, "phrase": "modified_versions"}, {"score": 0.0023390219342052623, "phrase": "probabilistic_multilateration"}, {"score": 0.0021940118003312397, "phrase": "aforementioned_algorithms"}, {"score": 0.0021049977753042253, "phrase": "traditional_trilateration_method"}], "paper_keywords": ["Location estimation", " MANET", " range-free positioning"], "paper_abstract": "Due to their simplicity, low energy cost and the fact that they do not require specialized hardware, range-free positioning algorithms are a convenient alternative to estimate the location of a set of nodes in a mobile ad hoc network (or MANET). This is particularly true when nodes are either not equipped with a GPS or the GPS system is not available. However, one of the main weakness of many of the range-free positioning algorithms proposed up to date is that they employ trilateration which is well known to perform poorly if either the information regarding the location of the reference nodes or the distance estimates to them are noisy. Unfortunately, the latter is precisely the case in the context of range-free positioning systems for MANETs. In this paper we present the probabilistic multilateration method, a novel technique that can be used to estimate the location of a node based on the position of three or more references and noisy distance estimates to them. To asses the effectiveness of the proposed method, we present a detailed simulation-based analysis of four of the most representative range-free positioning algorithms, namely DV-Hop, Amorphous, Centroid and APIT, as well as modified versions of DV-Hop and Amorphous that employ probabilistic multilateration. We used 2D and 3D radio-signal propagation models to evaluate the performance of 2D and 3D versions of the aforementioned algorithms. Our experimental results show that the probabilistic multilateration method is superior to the traditional trilateration method.", "paper_title": "A Probabilistic Approach to Location Estimation in MANETs", "paper_id": "WOS:000359489000006"}