{"auto_keywords": [{"score": 0.0035705347414368726, "phrase": "pan_attachment"}, {"score": 0.0034319005131102495, "phrase": "movement_notification"}, {"score": 0.0031289290660162145, "phrase": "wireless_link"}, {"score": 0.00308788133472785, "phrase": "router_solicitation"}, {"score": 0.0030206579994328975, "phrase": "router_advertisement"}, {"score": 0.00299428813997637, "phrase": "ra"}, {"score": 0.002941913249957503, "phrase": "performance_results"}, {"score": 0.002802825862847951, "phrase": "handoff_latency"}, {"score": 0.0025892330566358503, "phrase": "healthcare_system"}, {"score": 0.0025328377393370642, "phrase": "experimental_results"}, {"score": 0.0023708980662168525, "phrase": "battery_lifetime"}, {"score": 0.0021049977753042253, "phrase": "mobility_protocol_stack"}], "paper_keywords": ["6LoWPAN", " proxy mobile IPv6", " sensor node mobility"], "paper_abstract": "In this paper, we focus on a scheme that supports mobility for IPv6 over Low power Wireless Personal Area Network (6LoWPAN) sensor nodes. We define a protocol for 6LoWPAN mobile sensor node, named 6LoMSN, based on Proxy Mobile IPv6 (PMIPv6). The conventional PMIPv6 standard supports only single-hop networks and cannot be applied to multihop-based 6LoWPAN. It does not support the mobility of 6LoMSNs and 6LoWPAN gateways, named 6LoGW, cannot detect the PAN attachment of the 6LoMSN. Therefore, we define the movement notification of a 6LoMSN in order to support its mobility in multihop-based 6LoWPAN environments. The attachment of 6LoMSNs reduces signaling costs over the wireless link by using router solicitation (RS) and router advertisement (RA) messages. Performance results show that our proposed scheme can minimize the total signaling costs and handoff latency. Additionally, we present the design and implementation of the 6LoMSN mobility based on PMIPv6 for a healthcare system. According to the experimental results, the 6LoMSN of the proposed PMIPv6-based 6LoWPAN can be expected to use more of the battery lifetime. We also verify that the 6LoMSN can maintain connectivity, even though it has the freedom of being able to move between PANs without a mobility protocol stack.", "paper_title": "A 6LoWPAN Sensor Node Mobility Scheme Based on Proxy Mobile IPv6", "paper_id": "WOS:000310390400009"}