{"auto_keywords": [{"score": 0.03871041115511337, "phrase": "rendezvous_application"}, {"score": 0.00481495049065317, "phrase": "location_awareness"}, {"score": 0.004484332781147261, "phrase": "rendezvous_experience"}, {"score": 0.004245476558619167, "phrase": "location-aware_map_application"}, {"score": 0.003743102131902864, "phrase": "user_interactions"}, {"score": 0.003602302241898501, "phrase": "relevant_information"}, {"score": 0.003175792987190496, "phrase": "user's_location"}, {"score": 0.0030229485340586473, "phrase": "rendezvous_location"}, {"score": 0.002550481822137976, "phrase": "unique_instances"}, {"score": 0.0024815011359381692, "phrase": "automation_process"}, {"score": 0.002163535133532765, "phrase": "location-aware_rendezvous_application"}, {"score": 0.002128220632893247, "phrase": "important_design_considerations"}, {"score": 0.0021049977753042253, "phrase": "future_work"}], "paper_keywords": ["Location awareness", " Rendezvous", " Map interaction", " Automation", " Field study", " Autofocus"], "paper_abstract": "Location awareness can help facilitate a rendezvous of two or more persons. To further enhance the rendezvous experience, we conducted two complementary field studies to identify what information in a location-aware map application is important to rendezvous individuals (study 1) and to explore the use of autofocus, our automation technique to reduce user interactions with the rendezvous application while still providing relevant information to assist users with their navigation task (study 2). Overall, our results highlight the importance of maintaining the visibility of the user's location in relation to that of their partner(s) and rendezvous location. Additionally, we show that automation is useful in the context of a rendezvous application, but that the considerations are significantly more nuanced than originally conceived. We discuss unique instances when and why the automation process broke-down or did not perform as required by users. The results of this work demonstrate the potential for automation in a location-aware rendezvous application and identify important design considerations for future work in this area.", "paper_title": "Mobile map interactions during a rendezvous: exploring the implications of automation", "paper_id": "WOS:000273362500001"}