{"auto_keywords": [{"score": 0.03912955297452614, "phrase": "intercalation_gap"}, {"score": 0.008388233529290884, "phrase": "experimental_data"}, {"score": 0.00481495049065317, "phrase": "dna-ligand_interactions"}, {"score": 0.0045198174374297285, "phrase": "important_target"}, {"score": 0.004396426822203258, "phrase": "docking_programs"}, {"score": 0.00316565009987584, "phrase": "main_dna"}, {"score": 0.003153140905312787, "phrase": "binding_modes"}, {"score": 0.003042752533935891, "phrase": "artificial_intercalation_gap"}, {"score": 0.0029595657769783314, "phrase": "default_protocol"}, {"score": 0.0029246121262946384, "phrase": "dna_binding_modes"}, {"score": 0.0028786467218197245, "phrase": "modified_canonical_dna"}, {"score": 0.002669959049383929, "phrase": "predicted_binding_modes"}, {"score": 0.0023801608396295374, "phrase": "complete_agreement"}, {"score": 0.0021471293746360026, "phrase": "suitable_starting_point"}, {"score": 0.0021049977753042253, "phrase": "molecular_dynamics_simulations"}], "paper_keywords": [""], "paper_abstract": "Despite DNA being an important target for several drugs, most of the docking programs are validated only for proteins and their ligands. In this paper, we used AutoDock 4.0 to perform self-dockings and cross dockings between two DNA ligands (a minor groove binder and an intercalator) and four distinct receptors: 1) crystallographic DNA without intercalation gap; 2) crystallographic DNA with intercalation gap; 3) canonical B-DNA; and 4) modified B-DNA with intercalation gap. Besides being efficient in self-dockings, AutoDock is capable of correctly identifying two of the main DNA binding modes with the condition that the target possesses an artificial intercalation gap. Therefore, we suggest a default protocol to identify DNA binding modes which uses a modified canonical DNA (with gap) as receptor. This protocol was applied to dock two different Troger bases to DNA and the predicted binding modes agree with those suggested, yet not established, by experimental data. We also applied the protocol to dock aflatoxin B(1) exo-8,9-epoxide, and the results are in complete agreement with experimental data from the literature. We propose that this approach can be used to investigate other ligands whose binding mode to DNA remains unknown, yielding a suitable starting point for further theoretical studies such as molecular dynamics simulations.", "paper_title": "Docking Studies on DNA-Ligand Interactions: Building and Application of a Protocol To Identify the Binding Mode", "paper_id": "WOS:000269088500008"}