{"auto_keywords": [{"score": 0.021813373801919028, "phrase": "information-centric_services"}, {"score": 0.006555939014230945, "phrase": "content_distribution_services"}, {"score": 0.00481495049065317, "phrase": "advanced_information-centric_services"}, {"score": 0.004790382781589865, "phrase": "structured_peer-to-peer_systems"}, {"score": 0.004610058444728656, "phrase": "peer_systems"}, {"score": 0.004470676692857709, "phrase": "range_queries"}, {"score": 0.00436890075128947, "phrase": "specific_peer-to-peer_overlay"}, {"score": 0.003953873350660293, "phrase": "peer-generic_solution"}, {"score": 0.003824450466148272, "phrase": "portability_issue"}, {"score": 0.003746912275953477, "phrase": "peer_networks"}, {"score": 0.003469839225256456, "phrase": "peer_network"}, {"score": 0.003408184275204962, "phrase": "bottom_layer"}, {"score": 0.0033476211806800753, "phrase": "middle_layer"}, {"score": 0.003221430908449659, "phrase": "multi-dimensional_application_data_domains"}, {"score": 0.003148004393603339, "phrase": "wide_variety"}, {"score": 0.003107935254560724, "phrase": "large_scale"}, {"score": 0.0030370877795599413, "phrase": "data_management"}, {"score": 0.002990752951987369, "phrase": "spatial_queries"}, {"score": 0.002841334261018958, "phrase": "data_management_services"}, {"score": 0.002805157565568473, "phrase": "pull_mode"}, {"score": 0.0026649864769874294, "phrase": "push_mode"}, {"score": 0.002467720457471785, "phrase": "existing_spns"}, {"score": 0.0024238286657286864, "phrase": "critical_mass"}, {"score": 0.0023990982005125763, "phrase": "end-user_applications"}, {"score": 0.002285022889269964, "phrase": "new_synergies"}, {"score": 0.0022328922381961024, "phrase": "application_data_domain"}, {"score": 0.002181948298004013, "phrase": "necessary_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Distributed middleware", " Application portability", " Peer-to-peer networks"], "paper_abstract": "A common factor among all the existing distributed, peer-to-peer systems is their lack of genericity. Typically, information-centric services (such as range queries) are deployed ad-hoc onto a specific peer-to-peer overlay. These kinds of solutions make them probably efficient but non-portable to other peer-to-peer infrastructures, and so the services and applications constructed over them. We do believe, instead, that a peer-to-peer-generic solution is feasible. In this paper, we tackle the genericity and portability issue specifically on structured peer-to-peer networks (SPNs). To do so, we introduce a distributed 3-layer architecture, which abstracts applications (on top of the architecture) and the peer-to-peer network currently in use (in the bottom layer). Our middleware appears in the middle layer, which is responsible to address two major challenges: (i) supporting complex, multi-dimensional application data domains and (ii) performing efficiently for a wide variety of information-centric services in the large scale. Broadly speaking, information-centric services are classified as data management (such as range or spatial queries) and content distribution services (like publish/subscribe), and our middleware is an umbrella for all them. Notice that data management services are based on the pull mode (i.e., a user lookups information previously stored in the system), whilst content distribution services obey to a push mode (i.e., the system delivers the information timely to users). The benefits of our approach are clear: (i) Our middleware can be easily deployed over existing SPNs, guaranteeing the portability of a critical mass of services and end-user applications; (ii) Several services can be added to the middleware, which will facilitate the appearance of new synergies; and (iii) our middleware deals with the application data domain transparently to services and applications, including the necessary algorithms for services to be efficiently deployed into our middleware. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Enabling portability in advanced information-centric services over structured peer-to-peer systems", "paper_id": "WOS:000280973800004"}