{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "packet_interference"}, {"score": 0.011481472158331271, "phrase": "probabilistic_graphs"}, {"score": 0.004740476936977635, "phrase": "hopping_systems"}, {"score": 0.004618913016362256, "phrase": "bluetooth"}, {"score": 0.004407813106104401, "phrase": "graph-based_model"}, {"score": 0.004055998173160551, "phrase": "successive_packets"}, {"score": 0.003972504904621217, "phrase": "different_frequencies"}, {"score": 0.003911010373894104, "phrase": "pseudo-random_sequence"}, {"score": 0.003850464100878052, "phrase": "frequency_band"}, {"score": 0.0026471739851621143, "phrase": "expected_number"}, {"score": 0.002461044825190643, "phrase": "wireless_channels"}, {"score": 0.0023361440016375972, "phrase": "heterogeneous_cluster"}, {"score": 0.002311933249234786, "phrase": "bluetooth_piconets"}], "paper_keywords": ["probabilistic graphs", " frequency hopping systems", " bluetooth technology", " packet interference"], "paper_abstract": "In this paper, we present a graph-based model for analyzing interference between two frequency hopping systems for wireless communication. Informally, frequency hopping means that successive packets are transmitted on different frequencies from a pseudo-random sequence. The frequency band occupied by a packet may be narrow or wide. Our model is based on the concept of probabilistic graphs, where a node represents a \"channel\" and an edge denotes the probability of interference between two packets belonging to two different channels. Two packets on two channels are said to be mutually interfering if the two packets overlap in time and are transmitted on the same frequency. Thus, from the viewpoint of probabilistic graphs, the expected number of nodes with at least one incident edge is a measure of packet interference in a collection of wireless channels. We apply this model of packet interference to a heterogeneous cluster of Bluetooth piconets, where a piconet could be either of 79-hop type or of 23-hop type. Though the 23-hop type has been phased out, we use it as an example in this paper. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A random graph-based model to analyze packet interference between frequency hopping systems with an application to Bluetooth", "paper_id": "WOS:000259618400026"}