{"auto_keywords": [{"score": 0.03678902168567898, "phrase": "self-reported_craving"}, {"score": 0.0058770547555062145, "phrase": "virtual_environments"}, {"score": 0.00481495049065317, "phrase": "virtual_reality_exposure"}, {"score": 0.004768378525561471, "phrase": "cue_exposure_treatment"}, {"score": 0.00472227218565755, "phrase": "cet"}, {"score": 0.004520132822496416, "phrase": "drug-related_stimuli"}, {"score": 0.00436890075128947, "phrase": "virtual_reality"}, {"score": 0.004181839414007266, "phrase": "promising_tool"}, {"score": 0.003409057326528229, "phrase": "vr_environments"}, {"score": 0.003376037544631762, "phrase": "forty-six_smokers"}, {"score": 0.003310951184365485, "phrase": "seven_complex_virtual_environments"}, {"score": 0.0032629585038738856, "phrase": "typical_situations"}, {"score": 0.0029458777184930896, "phrase": "predictor_variables"}, {"score": 0.0028890603352364273, "phrase": "nicotine_dependence"}, {"score": 0.0024481856932959227, "phrase": "predictive_power"}, {"score": 0.002366110899738696, "phrase": "virtual_breakfast"}, {"score": 0.002199363362666037, "phrase": "virtual_reality_technology"}, {"score": 0.0021049977753042253, "phrase": "substance_use_disorders"}], "paper_keywords": [""], "paper_abstract": "Cue exposure treatment (CET) consists of controlled and repeated exposure to drug-related stimuli in order to reduce cue-reactivity. Virtual reality (VR) has proved to be a promising tool for exposition. However, identifying the variables that can modulate the efficacy of this technique is essential for selecting the most appropriate exposure modality. The aim of this study was to determine the relation between several individual variables and self-reported craving in smokers exposed to VR environments. Forty-six smokers were exposed to seven complex virtual environments that reproduce typical situations in which people smoke. Self-reported craving was selected as the criterion variable and three types of variables were selected as the predictor variables: related to nicotine dependence, related to anxiety and impulsivity, and related to the sense of presence in the virtual environments. Sense of presence was the only predictor of self-reported craving in all the experimental virtual environments. Nicotine dependence variables added predictive power to the model only in the virtual breakfast at home. No relation was found between anxiety or impulsivity and self-reported craving. Virtual reality technology can be very helpful for improving CET for substance use disorders. However, the use of virtual environments would make sense only insofar as the sense of presence was high. Otherwise, the effectiveness of exposure might be affected.", "paper_title": "Predictors of Smoking Craving During Virtual Reality Exposure", "paper_id": "WOS:000311184100005"}