{"auto_keywords": [{"score": 0.027391768253076345, "phrase": "mdl"}, {"score": 0.00481495049065317, "phrase": "flexible_language"}, {"score": 0.0047872135686404275, "phrase": "mission_description"}, {"score": 0.004759635663291431, "phrase": "multi-robot_missions"}, {"score": 0.004505405926927455, "phrase": "joint_execution"}, {"score": 0.004479444135872163, "phrase": "cooperative_missions"}, {"score": 0.004415189385015778, "phrase": "robotic_vehicles"}, {"score": 0.004252389342697521, "phrase": "formal_languages"}, {"score": 0.003503497128638099, "phrase": "autonomous_vehicles"}, {"score": 0.0034732277874585968, "phrase": "mdl_definition"}, {"score": 0.0033937776228549557, "phrase": "possibly_dependent_phases"}, {"score": 0.0033644530302903513, "phrase": "high-level_concepts"}, {"score": 0.0031845067058084583, "phrase": "xml_schema"}, {"score": 0.0029281780903782284, "phrase": "xml_files"}, {"score": 0.0029028648824177715, "phrase": "defined_schema"}, {"score": 0.0027237824436573085, "phrase": "mission_specification"}, {"score": 0.0022565201625076876, "phrase": "sus_scale"}, {"score": 0.002141898874982106, "phrase": "user-friendly_interface"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multi-robot mission", " Mission definition", " XML dialect"], "paper_abstract": "The work described in this paper is part of the development of a framework to support the joint execution of cooperative missions by a group of robotic vehicles, in a simulated, augmented or real environment. Such framework brings forward the need for formal languages in which to specify the group of vehicles that compose a team; the scenario in which they will operate; and the definition of the mission to be performed (surveillance, pollution detection, search and rescue operations, and so on). This paper presents the Mission Description Language (MDL), a XML dialect that describes the specifics of a mission to be performed by a team of autonomous vehicles. The MDL definition decomposes a mission into a number of possibly dependent phases and uses high-level concepts that facilitate the specification of a mission by both experts and non-experts. The dialect was defined using XML Schema, with all the required information being integrated in the definition. An interface was developed and incorporated into the framework, as to allow for the creation and edition of XML files following the defined schema. Once the information is correctly specified, it can be used in the framework, thus facilitating the process of mission specification and deployment. A survey answered by both practitioners and researchers shows that the degree of satisfaction with MDL is elevated (the overall evaluation of MDL achieved a 3.97 score (out of 5), with 82.05% of the answers being equal to or above 4); also, the usability of the interface was evaluated, having achieved a score of 82.9 in the SUS scale. These results imply that MDL is flexible enough to represent several types of missions, through a user-friendly interface. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Development of a flexible language for mission description for multi-robot missions", "paper_id": "WOS:000343345500004"}