{"auto_keywords": [{"score": 0.045947063889934796, "phrase": "eu"}, {"score": 0.004784229425687481, "phrase": "mds"}, {"score": 0.004753437286163315, "phrase": "som."}, {"score": 0.004344176114026701, "phrase": "social_sciences"}, {"score": 0.004288648163837944, "phrase": "eu_policies"}, {"score": 0.003957261767109878, "phrase": "eu_project"}, {"score": 0.0032518541963473405, "phrase": "latter's_derivatives"}, {"score": 0.0031185496507887857, "phrase": "text_analyses"}, {"score": 0.0030885689801303123, "phrase": "document_titles"}, {"score": 0.003019726786531033, "phrase": "full_text_analysis"}, {"score": 0.002886598310196588, "phrase": "text_mining_problems"}, {"score": 0.0027152365187093244, "phrase": "mds_map"}, {"score": 0.002629160426591144, "phrase": "text_mining"}, {"score": 0.002311230481682913, "phrase": "powerful_platform"}, {"score": 0.0021880094145128957, "phrase": "computation_intensive_eu-project"}, {"score": 0.00214610313234565, "phrase": "result_consistency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Text mining", " Data warehousing", " High dimensional data", " Visualisation methods", " High performance computing (HPC)", " Parallel algorithms"], "paper_abstract": "In this article, we discuss a number of methods and tools to cluster a 7000 document inventory in order to evaluate the impact of EU funded research in social sciences and humanities on EU policies. The inventory, which is not publicly available, but provided to us by the European Union (EU) in the framework of an EU project, could be divided into three main categories: research documents, influential policy documents, and policy documents. To represent the results in a way that non-experts could make use of it, we explored and compared two visualisation techniques, multi-dimensional scaling (MDS) and the self-organising map (SOM), and one of the latter's derivatives, the U-matrix. Contrary to most other approaches, which perform text analyses only on document titles and abstracts, we performed a full text analysis on more than 300,000 pages in total. Due to the inability of many software suites to handle text mining problems of this size, we developed our own analysis platform. We show that the combination of a U-matrix and an MDS map, which is rarely performed in the domain of text mining, reveals information that would go unnoticed otherwise. Furthermore, we show that the combination of a database, to store the data and the (intermediate) results, and a webserver, to visualise the results, offers a powerful platform to analyse the data and share the results with all participants/collaborators involved in a data- and computation intensive EU-project, thereby guaranteeing both data- and result consistency. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A clustering study of a 7000 EU document inventory using MDS and SOM", "paper_id": "WOS:000289047700102"}