{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "food_advergames"}, {"score": 0.009452979655151517, "phrase": "nutritional_quality"}, {"score": 0.006388518375665832, "phrase": "reaching_children"}, {"score": 0.006337561903524587, "phrase": "ad_breaks"}, {"score": 0.004700468701207975, "phrase": "nutrient_quality"}, {"score": 0.004101088357088207, "phrase": "child_visitors"}, {"score": 0.0038152404172111815, "phrase": "internet_audience_measurement_metrics"}, {"score": 0.0037095162593960727, "phrase": "food_advergame_content"}, {"score": 0.0035778632599436024, "phrase": "dietary_quality"}, {"score": 0.003301733505307784, "phrase": "cfbai"}, {"score": 0.00328849874768242, "phrase": "participating_companies"}, {"score": 0.0029982770062678926, "phrase": "age_limit_specification"}, {"score": 0.0027778947555117243, "phrase": "healthy_lifestyle_information"}, {"score": 0.0027008385562908425, "phrase": "advergames_reaching_children"}, {"score": 0.0026471070725516467, "phrase": "higher_level"}, {"score": 0.002625914195439153, "phrase": "brand_integration"}, {"score": 0.002384422461262006, "phrase": "brand_identifiers"}, {"score": 0.002308953751676031, "phrase": "unique_visitors"}, {"score": 0.002253920389285441, "phrase": "increased_attention"}, {"score": 0.002209060366991921, "phrase": "innovative_and_interactive_food_marketing"}], "paper_keywords": ["Internet marketing", " Content analysis", " Children"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the content of food advergames and the nutritional quality of foods promoted in those advergames with the presence of child visitors. Design/methodology/approach - This study integrates three different sources of data, first, characteristics of the audience from internet audience measurement metrics; second, an analysis of food advergame content; and third, an analysis of the dietary quality of the foods in advergames. Findings - The results show that 83.2 percent of the total 143 advergames are sponsored by CFBAI participating companies and 79.5 percent of the total 44 advergames reaching children are sponsored by those companies. About 87 percent of the advergames reaching children do not include age limit specification. By contrast, about 71 percent of the advergames reaching children include ad breaks and about half of the advergames reaching children include healthy lifestyle information. Compared to the total, advergames reaching children seem to have a higher level of brand integration. Moreover, most foods that the advergames promote are classified as unhealthy. Finally, the results show that ad breaks and number of brand identifiers are the two significant predictors of food advergames with child unique visitors. Originality/value - Despite the increased attention to and scrutiny of innovative and interactive food marketing targeting children, little is known about the extent to which such techniques actually reach children, nor about the content and nutritional quality of foods they promote. This study attempts to fill in the gap by focussing on food advergames.", "paper_title": "Characteristics of food advergames that reach children and the nutrient quality of the foods they advertise", "paper_id": "WOS:000329948100004"}