{"auto_keywords": [{"score": 0.04252300072846253, "phrase": "multi-site_distributed_environment"}, {"score": 0.02860256406694623, "phrase": "software_engineering"}, {"score": 0.00481495049065317, "phrase": "remote_communication"}, {"score": 0.004775982436102607, "phrase": "face-to-face_communication"}, {"score": 0.004239232828870618, "phrase": "software_engineer"}, {"score": 0.004182172788492861, "phrase": "project_plan"}, {"score": 0.004004670513560508, "phrase": "just-in-time_decision"}, {"score": 0.0039507551536392595, "phrase": "different_teams"}, {"score": 0.003563947870911093, "phrase": "wrong_tasks"}, {"score": 0.0034218637688148653, "phrase": "proper_details"}, {"score": 0.003285425464512383, "phrase": "situational_awareness"}, {"score": 0.002939536124277051, "phrase": "project_delay"}, {"score": 0.002845347968246455, "phrase": "multi-agents_system"}, {"score": 0.002776687200568343, "phrase": "agreed_knowledge"}, {"score": 0.0027318337844924427, "phrase": "domain_knowledge"}, {"score": 0.0026731512522544312, "phrase": "shared_information_resource_platform"}, {"score": 0.002608634873428449, "phrase": "distributed_teams"}, {"score": 0.0025595311522722936, "phrase": "intelligent_agents"}, {"score": 0.002504540558270083, "phrase": "initial_communication"}, {"score": 0.0024242565729744826, "phrase": "first_instance"}, {"score": 0.0023657330062474996, "phrase": "key_challenges"}, {"score": 0.0023529203904298864, "phrase": "multi-site_software_engineering"}, {"score": 0.0023148964315569866, "phrase": "commonly_shared_conceptualisations"}, {"score": 0.0023023585070519803, "phrase": "software_development"}, {"score": 0.0022713093139061277, "phrase": "agent_communication"}, {"score": 0.002228541063618486, "phrase": "man-machine_interactions"}, {"score": 0.0022104586816588294, "phrase": "great_potential"}, {"score": 0.002139581380750111, "phrase": "multi-site_environments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["ontology development", " software engineering ontology", " agent-based system", " multi-site software development"], "paper_abstract": "The disadvantages associated with remote communication rather than face-to-face communication is a key problem in the multi-site distributed software development environment. Awareness of what work has been done, what task has been misunderstood, what problems have been raised, what issues have been clarified, and understanding of why a team or a software engineer does not follow the project plan, and how to carry out a discussion over a multi-site distributed environment and to make a just-in-time decision are the challenge. Different teams might not be aware of what tasks are being carried out by others, potentially leading to problems such as two groups overlapping in some work or other work not being performed due to misinterpretation of the task. Wrong tasks may be carried out due to ignorance of who to contact to get the proper details. If everyone working on a certain project is located in the same area, then situational awareness is relatively straightforward but the overheads in communications to get together to discuss the problems, to raise issues, to make decisions and to find answers in a multi-site distributed environment can become very large. Consequently, these problems cause project delay and anxiety among teams and managers. Ontologies coupled with a multi-agents system allow greater ease of communication by aggregating the agreed knowledge about the project, the domain knowledge, the concepts of software engineering into a shared information resource platform and allow them to be shared among the distributed teams across the sites and enable the intelligent agents to use the ontology to carry out initial communication and classification with developers when the problem is raised in the first instance. In this paper, we present the key challenges in multi-site software engineering and the ontology representation of commonly shared conceptualisations in software development. We demonstrate the agent communication with developers in the form of man-machine interactions and the great potential of such a system to be used in the future for software engineering in multi-site environments. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Ontology-based multi-site software development methodology and tools", "paper_id": "WOS:000242133700005"}