{"auto_keywords": [{"score": 0.028591303357322805, "phrase": "driver_support"}, {"score": 0.00454090611248773, "phrase": "automobile_driver"}, {"score": 0.004232475065285966, "phrase": "driver's_behavior"}, {"score": 0.0040385352882334235, "phrase": "driver's_intent"}, {"score": 0.0038761135052054765, "phrase": "traffic_condition"}, {"score": 0.0037862398004482253, "phrase": "medium_fidelity"}, {"score": 0.0033473779327638322, "phrase": "auditory_warning"}, {"score": 0.002994178996584381, "phrase": "autonomous_safety_control_action"}, {"score": 0.002409503258044183, "phrase": "accident_prevention"}, {"score": 0.0023124457559811087, "phrase": "driver_support_functions"}, {"score": 0.0021677478798910565, "phrase": "systeminitiated_automation_invocation"}, {"score": 0.0021049977753042253, "phrase": "automation_surprises"}], "paper_keywords": ["proactive safety", " intelligent driver support", " adaptive automation", " levels of automation"], "paper_abstract": "This paper tries to answer the following question: What type of support should be given to an automobile driver when it is determined, via some method to monitor the driver's behavior and the traffic environment, that the driver's intent may not be appropriate to a traffic condition? With a medium fidelity, moving-base driving simulator, three conditions were compared: (a) Warning type support in which an auditory warning is given to the driver to enhance his/her situation recognition, (b) action type support in which an autonomous safety control action is executed to avoid an accident, and (c) the baseline condition in which no driver support is given. Results were as follows: (1) Either type of driver support was effective in accident prevention. (2) Acceptance of driver support functions varied context dependently. (3) Participants accepted a systeminitiated automation invocation as long as no automation surprises were possible to occur.", "paper_title": "Support by warning or by action: Which is appropriate under mismatches between driver intent and traffic conditions?", "paper_id": "WOS:000251227200027"}