{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "crisp_output"}, {"score": 0.049483572884790016, "phrase": "fuzzy_inference_system"}, {"score": 0.0047155367844327, "phrase": "fuzzy_models"}, {"score": 0.004160531596936783, "phrase": "crisp_value"}, {"score": 0.004108742905942481, "phrase": "defuzzification_methods"}, {"score": 0.003701401653850141, "phrase": "output_membership_function"}, {"score": 0.0034620831765465425, "phrase": "quartile_deviation"}, {"score": 0.0032246835734680377, "phrase": "large_number"}, {"score": 0.0030541531847589833, "phrase": "university_teaching_activity"}, {"score": 0.0028926147550022607, "phrase": "good_measure"}, {"score": 0.002856563331151566, "phrase": "vagueness_dispersion"}, {"score": 0.0027395968397212053, "phrase": "useful_indication"}, {"score": 0.002671722386856879, "phrase": "solution's_shape"}, {"score": 0.0026164433143193015, "phrase": "rough_estimate"}, {"score": 0.002509284173541882, "phrase": "solution_fuzzy_region"}, {"score": 0.0022886952510350416, "phrase": "true_values"}, {"score": 0.0022601535748259785, "phrase": "standard_deviations"}, {"score": 0.0021315842986705485, "phrase": "fuzzy_output_dispersion"}], "paper_keywords": ["Triangular fuzzy number", " Triangular distribution", " Quartile deviation", " Skewness"], "paper_abstract": "Fuzzy models generally provide an output characterized by vagueness, which is expressed through a solution fuzzy set. In many applications, the response of the model is transformed in a crisp value through some defuzzification methods for solution fuzzy region, thus losing its fuzziness. Only to preserve a few indications of its vagueness, some indices summarizing the spread of the output membership function could be used to associate them with the crisp output, such as its standard deviation, the quartile deviation, the coefficients of skewness and kurtosis. The behaviour of such indices is examined in a large number of possible, though unlikely, output solutions and in an application of a fuzzy inference system for evaluating university teaching activity. The results seem to suggest that the 20-80 mid-percentile range could be a good measure of the vagueness dispersion, while the coefficient of skewness could provide a useful indication about the asymmetry of the solution's shape. Moreover, a rough estimate of dispersion was obtained from a triangle approximating the solution fuzzy region because the results were straightforwardly deduced from formulae involving the abscissae of its vertices. The results generally appear to underestimate the true values of the standard deviations; the 15-85 mid-percentile range of the approximating triangle seemed to be a more suitable rough appraisal of fuzzy output dispersion. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Vagueness evaluation of the crisp output in a fuzzy inference system", "paper_id": "WOS:000260652000005"}