{"auto_keywords": [{"score": 0.04760688643890386, "phrase": "care_record_query"}, {"score": 0.03239325431135684, "phrase": "draft_standard"}, {"score": 0.00481495049065317, "phrase": "care_records"}, {"score": 0.004680851157467745, "phrase": "health_level"}, {"score": 0.004518442937844318, "phrase": "care_record"}, {"score": 0.0042102651938187114, "phrase": "american_national_standards_institute"}, {"score": 0.0038954080332391115, "phrase": "cda"}, {"score": 0.0038407203087210775, "phrase": "overall_advantage"}, {"score": 0.003760137090849196, "phrase": "human_communication"}, {"score": 0.0036424097335610492, "phrase": "structured_data"}, {"score": 0.0036167509502276294, "phrase": "electronic_messages"}, {"score": 0.0035283552859817764, "phrase": "interactive_structured_data_exchange"}, {"score": 0.0033579708256295847, "phrase": "use_cases"}, {"score": 0.003264316172836322, "phrase": "information_analysis"}, {"score": 0.003241312187060814, "phrase": "model_building"}, {"score": 0.00316206336164649, "phrase": "group_meetings"}, {"score": 0.0030414140732789186, "phrase": "trial_use"}, {"score": 0.0030199761431186434, "phrase": "pilot_implementations"}, {"score": 0.002988101395789399, "phrase": "subsequent_evaluation"}, {"score": 0.002793874145713024, "phrase": "formal_ballot_process"}, {"score": 0.0027255350933549703, "phrase": "normative_standard"}, {"score": 0.0026777469499249364, "phrase": "ansi"}, {"score": 0.0024597305738431226, "phrase": "care_transfer"}], "paper_keywords": [""], "paper_abstract": "Objective This paper describes Health Level 7 (HL7) V. 3 Care Transfer, Care Record Query, and Care Record messages. This is the core of the Care Provision Domain in the HL7 standard which became normative at the end of 2012 and is an American National Standards Institute (ANSI)-approved HL7 standard. Background and significance Using a message is somewhat different from the approach offered in the current HL7 Clinical Document Architecture (CDA). The overall advantage is human-to-human communication and system-to-system processing of structured data through electronic messages, supporting continuity of care and interactive structured data exchange through querying. Materials and methods The Care Provision Domain Model in HL7 was developed based on use cases from several projects internationally. Use case and information analysis, model building, HL7 consensus methods (eg, working group meetings), conference calls, balloting, a draft standard for trial use, pilot implementations, and subsequent evaluation were applied. Results The membership and pilot implementers gave feedback to improve the draft standard. After the formal ballot process, HL7 membership accepted it as a normative standard and it is now ANSI approved. The Care Provision Domain Model defines the structure (data exchanged) and dynamics (workflow and communications) of the Care Record, Care Record Query, and Care Transfer. Discussion and conclusions The HL7 V3 Care Provision Domain differs from the HL7 CDA regarding support of the dynamics of care (eg, for continuity of care) as provided through a series of interactions and queries, but is similar with respect to the data and their organization.", "paper_title": "Exchanging care records using HL7 V3 care provision messages", "paper_id": "WOS:000341858100027"}