{"auto_keywords": [{"score": 0.043663842484019465, "phrase": "language_use"}, {"score": 0.028987935259312994, "phrase": "physical_world"}, {"score": 0.00481495049065317, "phrase": "ontological_and_linguistic_metamodelling"}, {"score": 0.0047527118741586055, "phrase": "language_use_approach"}, {"score": 0.004410068751933955, "phrase": "linguistic_metamodelling"}, {"score": 0.0035343512834706417, "phrase": "conceptual-analytical_approach"}, {"score": 0.003488607816047529, "phrase": "published_arguments"}, {"score": 0.003443454339200118, "phrase": "alternative_metamodelling_architecture"}, {"score": 0.0032792555200980783, "phrase": "language_use_perspective"}, {"score": 0.003236802914194731, "phrase": "traditional_modelling_concepts"}, {"score": 0.003133052778244851, "phrase": "traditional_approaches"}, {"score": 0.0030326180561817497, "phrase": "previous_work"}, {"score": 0.0029933487820771217, "phrase": "set_theory"}, {"score": 0.002935393439834135, "phrase": "extensional_and_intensional_aspects"}, {"score": 0.0027953532094590625, "phrase": "social_world"}, {"score": 0.002688133833564332, "phrase": "deeper_understanding"}, {"score": 0.0026104197983396367, "phrase": "ontological_and_linguistic_views"}, {"score": 0.002576603426735759, "phrase": "modelling_world"}, {"score": 0.0024858445890050614, "phrase": "language_use_ideas"}, {"score": 0.0024696889464469805, "phrase": "traditional_modelling"}, {"score": 0.002181882210287102, "phrase": "one-to-one_correspondence_relationship"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Concepts", " Speech act theory", " Set theory", " Metamodel"], "paper_abstract": "Context: Although metamodelling is generally accepted as important for our understanding of software and systems development, arguments about the validity and utility of ontological versus linguistic metamodelling continue. Objective: The paper examines the traditional, metamodel-focused construction of modelling languages in the context of language use, and particularly speech act theory. These concepts are then applied to the problems introduced by the \"Orthogonal Classification Architecture\" that is often called the ontological/linguistic paradox. The aim of the paper is to show how it is possible to overcome these problems. Method: The paper adopts a conceptual-analytical approach by revisiting the published arguments and developing an alternative metamodelling architecture based on language use. Results: The analysis shows that when we apply a language use perspective of meaning to traditional modelling concepts, a number of incongruities and misconceptions in the traditional approaches are revealed - issues that are not evident in previous work based primarily on set theory. Clearly differentiating between the extensional and intensional aspects of class concepts (as sets) and also between objects (in the social world) and things (in the physical world) allows for a deeper understanding to be gained of the relationship between the ontological and linguistic views promulgated in the modelling world. Conclusions: We propose that a viewpoint that integrates language use ideas into traditional modelling (and metamodelling) is vital, and stress that meaning is not inherent in the physical world; meaning, and thus socially valid objects, are constructed by use of language, which may or may not establish a one-to-one correspondence relationship between objects and physical things. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Ontological and linguistic metamodelling revisited: A language use approach", "paper_id": "WOS:000326258100003"}