{"auto_keywords": [{"score": 0.045827291636174224, "phrase": "zigbee_network"}, {"score": 0.027060559102518075, "phrase": "router_nodes"}, {"score": 0.02332296469574755, "phrase": "new_node"}, {"score": 0.008713768692145006, "phrase": "kmcd-ime"}, {"score": 0.008568642604425997, "phrase": "maximum_communication_distance"}, {"score": 0.008079319992405585, "phrase": "zigbee_networks"}, {"score": 0.004500891637057374, "phrase": "effective_routing"}, {"score": 0.004333283735537634, "phrase": "finite_address_space"}, {"score": 0.004242868712089958, "phrase": "potential_parent_device"}, {"score": 0.0041194351307673556, "phrase": "join_request"}, {"score": 0.004067635935640407, "phrase": "address_space"}, {"score": 0.003584025547693836, "phrase": "sufficient_address_space"}, {"score": 0.003335873298309004, "phrase": "router_capability"}, {"score": 0.003117986133774198, "phrase": "association_procedure"}, {"score": 0.002889778121878728, "phrase": "worst_case"}, {"score": 0.0025137879526642842, "phrase": "zigbee"}, {"score": 0.002471661547432869, "phrase": "first_condition"}, {"score": 0.0023794391656001466, "phrase": "would-be_parent_node"}, {"score": 0.0021682027434117095, "phrase": "effective_routing_topology"}, {"score": 0.0021049977753042253, "phrase": "kmcd-ime_algorithm"}], "paper_keywords": ["topology control algorithm", " LQI", " ZigBee", " Cskip", " effective routing"], "paper_abstract": "In a ZigBee network, a finite address space is allocated to every potential parent device and a device may disallow a join request once this address space is exhausted. When a new node (child) requests to a coordinator (parent) to join a ZigBee network, the coordinator checks its address space. If it has sufficient address space, the coordinator accepts the new node as its child in the ZigBee network. If the new node has router capability (JoinAsRouter), it becomes a router in the ZigBee network. However, this association procedure makes ZigBee networks inefficient for routing, because the coordinator checks only the maximum and current numbers of child nodes. In the worst case, the network will be arranged so that the router nodes are crowded in the network. Therefore, we propose the KMCD-IME (Keeping the Maximum Communication Distance and Initial Mutual Exclusion among router nodes) algorithm with two additional conditions when a new node joins the ZigBee network. The first condition maintains the maximum communication distance between the new node and the would-be parent node. The second condition is the Initial Mutual Exclusion among router nodes. The router nodes are evenly spread across the network by KMCD-IME and an effective routing topology is formed. Therefore, the KMCD-IME algorithm extends the lifetime of the ZigBee network.", "paper_title": "KMCD-IME (Keeping the Maximum Communication Distance and Initial Mutual Exclusion among Router Nodes) Topology Control Algorithm for Effective Routing in ZigBee Networks", "paper_id": "WOS:000285489200005"}