{"auto_keywords": [{"score": 0.04962396550254858, "phrase": "virtual_humans"}, {"score": 0.04806360678457014, "phrase": "vr_applications"}, {"score": 0.040375697685509034, "phrase": "natural_laws"}, {"score": 0.00481495049065317, "phrase": "virtual_realty_applications"}, {"score": 0.004376273644295806, "phrase": "complex_tasks"}, {"score": 0.004054169947971483, "phrase": "credible_virtual_characters"}, {"score": 0.003996458454723708, "phrase": "major_role"}, {"score": 0.003920780681351006, "phrase": "motion_editing_techniques"}, {"score": 0.0037556843869894566, "phrase": "prerecorded_trajectories"}, {"score": 0.0035632774896594524, "phrase": "credible_autonomous_actors"}, {"score": 0.0034790978593553794, "phrase": "complete_knowledge"}, {"score": 0.0029996699429582835, "phrase": "interactive_environment"}, {"score": 0.002845883666777154, "phrase": "users_orders"}, {"score": 0.0026742419973883134, "phrase": "real_time"}, {"score": 0.002648768009464535, "phrase": "complex_constraints"}, {"score": 0.002327648608736437, "phrase": "enhanced_inverse_kinetics"}, {"score": 0.002176747110119268, "phrase": "motor_behavior"}, {"score": 0.0021049977753042253, "phrase": "virtual_environments"}], "paper_keywords": [""], "paper_abstract": "Virtual humans are more and more used in VR applications, but their animation is still a challenge, especially if complex tasks must be carried out in interaction with the user. In many applications with virtual humans, credible virtual characters play a major role in presence. Motion editing techniques assume that the natural laws are intrinsically encoded in prerecorded trajectories and that modifications may preserve these natural laws, leading to credible autonomous actors. However, a complete knowledge of all the constraints is required to ensure continuity or to synchronize and blend several actions necessary to achieve a given task. We propose a framework capable of performing these tasks in an interactive environment that can change at each frame, depending on the users orders. This framework enables VR applications to animate from dozens of characters in real time for complex constraints, to hundreds of characters if only ground adaptation is performed. It offers the following capabilities: motion synchronization, blending, retargeting, and adaptation thanks to enhanced inverse kinetics and kinematics solver. To evaluate this framework, we have compared the motor behavior of subjects in real and in virtual environments.", "paper_title": "MKM: A global framework for animating humans in virtual realty applications", "paper_id": "WOS:000252667000002"}