{"auto_keywords": [{"score": 0.0467633416687467, "phrase": "agent's_information"}, {"score": 0.00481495049065317, "phrase": "dynamic_epistemic_logic_for_implicit_and_explicit_beliefs"}, {"score": 0.004769182299692333, "phrase": "epistemic_logic"}, {"score": 0.004397230847865867, "phrase": "propositional_facts"}, {"score": 0.003958439439112026, "phrase": "logical_consequence"}, {"score": 0.0037377733149169573, "phrase": "unrealistic_idealisation"}, {"score": 0.002873247913129334, "phrase": "recent_works"}, {"score": 0.0026742419973883134, "phrase": "agent's_implicit_and_explicit_knowledge"}, {"score": 0.002537097217899195, "phrase": "agent's_implicit_and_explicit_beliefs"}, {"score": 0.0022294857939412073, "phrase": "existing_notion"}, {"score": 0.00220823903315848, "phrase": "belief_revision"}, {"score": 0.0021354538918029286, "phrase": "rich_framework"}, {"score": 0.0021049977753042253, "phrase": "diverse_forms"}], "paper_keywords": ["Epistemic logic", " Dynamic epistemic logic", " Knowledge", " Beliefs", " Belief revision", " Inference"], "paper_abstract": "Epistemic logic with its possible worlds semantic model is a powerful framework that allows us to represent an agent's information not only about propositional facts, but also about her own information. Nevertheless, agents represented in this framework are logically omniscient: their information is closed under logical consequence. This property, useful in some applications, is an unrealistic idealisation in some others. Many proposals to solve this problem focus on weakening the properties of the agent's information, but some authors have argued that solutions of this kind are not completely adequate because they do not look at the heart of the matter: the actions that allow the agent to reach such omniscient state. Recent works have explored how acts of observation, inference, consideration and forgetting affect an agent's implicit and explicit knowledge; the present work focuses on acts that affect an agent's implicit and explicit beliefs. It starts by proposing a framework in which these two notions can be represented, and then it looks into their dynamics, first by reviewing the existing notion of belief revision, and then by introducing a rich framework for representing diverse forms of inference that involve both knowledge and beliefs.", "paper_title": "Dynamic Epistemic Logic for Implicit and Explicit Beliefs", "paper_id": "WOS:000209641000002"}