{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "astronomical_resources"}, {"score": 0.04892132379047204, "phrase": "historical_star_catalogues"}, {"score": 0.004312622975366676, "phrase": "important_astronomical_information"}, {"score": 0.004081385289516914, "phrase": "documental_description"}, {"score": 0.003886230888568081, "phrase": "eighteenth"}, {"score": 0.003438058620195309, "phrase": "information_patterns"}, {"score": 0.0031747618267940155, "phrase": "technical_parameters"}, {"score": 0.0030414140732789186, "phrase": "cataloguing_standards"}, {"score": 0.002860546817196148, "phrase": "bibliographic_descriptions"}, {"score": 0.0028084079003212947, "phrase": "specialised_documents"}, {"score": 0.002723607240517261, "phrase": "great_interest"}, {"score": 0.0025615908073796027, "phrase": "star_catalogues"}, {"score": 0.0025148871904409095, "phrase": "cartographic_information"}, {"score": 0.0022382002476510573, "phrase": "new_technical_parameters"}, {"score": 0.0021049977753042253, "phrase": "bibliographic_records"}], "paper_keywords": ["Astronomical information retrieval", " Cartographic resources", " Cataloguing quality", " Cataloguing standards", " Royal institute and observatory of the spanish navy", " Star catalogues"], "paper_abstract": "Purpose - The purpose of this paper is to show that some important astronomical information is still not taken into account in the documental description of historical star catalogues. Design/methodology/approach - A sample of 28 historical star catalogues (eighteenth, nineteenth and twentieth centuries) from the Royal Institute and Observatory of the Spanish Navy was selected in order to analyse their structure and to identify information patterns. Findings - The analysis shows that there are a number of technical parameters which are not present in the cataloguing standards and which should be taken into account in the bibliographic descriptions of these specialised documents since they are of great interest to astronomers and astrophysicists. On the other hand, star catalogues provide some cartographic information which can be described by these standards but whose corresponding fields are not widely used by cataloguers. Originality/value - A proposal of new technical parameters is given in order to try to improve the bibliographic records of these astronomical resources. Some directions are also given in order to identify the sections of the catalogues where these parameters may be found, making the task of locating them easier.", "paper_title": "A new proposal to improve the description of astronomical resources The case of historical star catalogues", "paper_id": "WOS:000352716700008"}