{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "simple_directed_graph"}, {"score": 0.004669845451682529, "phrase": "function_alpha"}, {"score": 0.004446677711302801, "phrase": "positive_integer"}, {"score": 0.004157058883925715, "phrase": "communication_channels"}, {"score": 0.004093901605219401, "phrase": "individual_upsilon"}, {"score": 0.00346980631146264, "phrase": "minimum_number_min-seed"}, {"score": 0.0031277561510163966, "phrase": "np"}, {"score": 0.002985988377995789, "phrase": "special_case"}, {"score": 0.0027572166867780275, "phrase": "strict-majority_scenario"}, {"score": 0.0026576091519087065, "phrase": "high_probability"}, {"score": 0.00226583335721762, "phrase": "positive_minimum_indegree"}, {"score": 0.0022041312401435346, "phrase": "vertical_bar_v_vertical_bar"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Irreversible dynamo", " Global cascade", " Trust propagation"], "paper_abstract": "We model a network in which messages spread by a simple directed graph G = (V, E) and a function alpha : V -> N mapping each upsilon is an element of V to a positive integer less than or equal to the indegree of upsilon. The graph G represents the individuals in the network and the communication channels between them. An individual upsilon is an element of V will be convinced of a message when at least alpha(upsilon) of its in-neighbors are convinced. Suppose we are to convince a message to the individuals by first convincing a subset of individuals, called the seeds, and then let the message spread. We study the minimum number min-seed (G, alpha) of seeds needed to convince all individuals at the end. In particular, we prove a lower bound on min-seed (G, alpha) and the NP-completeness of computing min-seed (G, alpha). We also analyze the special case, called the strict-majority scenario, where each individual is convinced of a message when more than half of its in-neighbors are convinced. For the strict-majority scenario, we prove three results. First, we show that with high probability over the Erdos-Renyi random graphs G(n, p), Omega(min{n, 1/p}) seeds are needed to convince all individuals at the end. Second, if G = (V, E) is undirected, then a set of s uniformly random samples from V convinces no more than an expected s(2 vertical bar E vertical bar + 2 vertical bar V vertical bar)vertical bar V vertical bar individuals at the end. Third, in a digraph G = (V, E) with a positive minimum indegree, one can find in polynomial (in vertical bar V vertical bar) time a set of at most (23/27)vertical bar V vertical bar seeds convincing all individuals. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Spreading messages", "paper_id": "WOS:000267160800015"}