{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "coke"}, {"score": 0.004798473247675652, "phrase": "crypto-less"}, {"score": 0.004557943646825813, "phrase": "novel_probabilistic_protocol"}, {"score": 0.004344294963066981, "phrase": "ota"}, {"score": 0.004285101149043392, "phrase": "shared_secret"}, {"score": 0.004169117683086526, "phrase": "globally_eavesdropping_adversary"}, {"score": 0.004126434472502474, "phrase": "proposed_solution"}, {"score": 0.0037484651075873968, "phrase": "one-bit_transmission"}, {"score": 0.0034758549674203825, "phrase": "low_requirements"}, {"score": 0.0032452142903668666, "phrase": "constrained_wireless_devices"}, {"score": 0.0029376169407844314, "phrase": "security_challenging_setting"}, {"score": 0.0022703369939978185, "phrase": "key_establishment_session"}, {"score": 0.002247049536955401, "phrase": "thorough_analysis"}, {"score": 0.0021711323811863963, "phrase": "packet_loss"}, {"score": 0.002148860300945803, "phrase": "energy_consumption"}, {"score": 0.0021049977753042253, "phrase": "extensive_simulations_results"}], "paper_keywords": ["Wireless security", " anonymous channels", " key-establishment"], "paper_abstract": "In this paper, we present a novel probabilistic protocol (COKE) to allow two wireless communicating parties to commit over-the-air (OTA) on a shared secret, even in the presence of a globally eavesdropping adversary. The proposed solution leverages no crypto but just plaintext messages exchange. Indeed, the security of the solution relies on the difficulty for the adversary to correctly identify, for each one-bit transmission, the sender of that bit-not its value, which is indeed exchanged in cleartext. Due to the low requirements of COKE (essentially, the capability to send a few wireless messages), it is particularly suited for resource constrained wireless devices (e. g., WNSs, wireless embedded systems), as well as for those scenarios where just energy saving is at premium, such as smartphones. For instance-under a security challenging setting-it is possible for the two parties to commit, with a probability greater than (1 - 2(-48)), on a 128 secret bits key exchanging as few as 1300 one-bit messages. Under less stressing conditions, establishing a 128 secret bits key with the same probability requires just as few as 300 one-bit messages. The security parameters (that is, secret-key length and its establishment probability) are adjustable: they can be agreed between the two parties for each key establishment session. A thorough analysis characterizing the security of the protocol, its robustness to packet loss, and energy consumption is provided. Finally, extensive simulations results support the quality and viability of the proposal.", "paper_title": "COKE Crypto-Less Over-the-Air Key Establishment", "paper_id": "WOS:000318595000014"}