{"auto_keywords": [{"score": 0.0482467347935346, "phrase": "sensor_nodes"}, {"score": 0.007275014780218942, "phrase": "key_predistribution"}, {"score": 0.006759656126470509, "phrase": "wireless_sensor_networks"}, {"score": 0.004663716126870148, "phrase": "pairwise_keys"}, {"score": 0.0043289723873340255, "phrase": "sensors'_expected_locations"}, {"score": 0.0041780882724537, "phrase": "keying_materials"}, {"score": 0.003905689096176873, "phrase": "correct_location_discovery"}, {"score": 0.0038506359988314787, "phrase": "hostile_environments"}, {"score": 0.0037561467438280175, "phrase": "group-based_deployment_model"}, {"score": 0.0034739608505535017, "phrase": "critical_observation"}, {"score": 0.003224336566887827, "phrase": "deployment_model"}, {"score": 0.0029294877178473017, "phrase": "novel_framework"}, {"score": 0.00286770704394124, "phrase": "group-based_deployment_knowledge"}, {"score": 0.0025144238077014114, "phrase": "sensors'_locations"}, {"score": 0.0024613749081680474, "phrase": "practical_key_predistribution_schemes"}, {"score": 0.0021811799507898792, "phrase": "pairwise_key_establishment"}, {"score": 0.0021657265492371976, "phrase": "sensor_networks"}, {"score": 0.0021049977753042253, "phrase": "previous_key_predistribution_schemes"}], "paper_keywords": ["security", " design", " algorithms", " sensor networks", " security", " pairwise key establishment", " key predistribution", " group-based deployment"], "paper_abstract": "Many key predistribution techniques have been developed recently to establish pairwise keys between sensor nodes in wireless sensor networks. To further improve these schemes, researchers have also proposed to take advantage of the sensors' expected locations and discovered locations to help the predistribution of the keying materials. However, in many cases, it is very difficult to deploy sensor nodes at their expected locations or guarantee the correct location discovery at sensor nodes in hostile environments. In this article, a group-based deployment model is developed to improve key predistribution. In this model, sensor nodes are only required to be deployed in groups. The critical observation in the article is that the sensor nodes in the same group are usually close to each other after deployment. This deployment model is practical; it greatly simplifies the deployment of sensor nodes, while still providing an opportunity to improve key predistribution. Specifically, the article presents a novel framework for improving key predistribution using the group-based deployment knowledge. This framework does not require the knowledge of the sensors' expected or discovered locations and is thus suitable for applications where it is difficult to deploy the sensor nodes at their expected locations or correctly estimate the sensors' locations after deployment. To seek practical key predistribution schemes, the article presents two efficient instantiations of this framework, a hash key-based scheme and a polynomial-based scheme. The evaluation shows that these two schemes are efficient and effective for pairwise key establishment in sensor networks; they can achieve much better performance than the previous key predistribution schemes when the sensor nodes are deployed in groups.", "paper_title": "Group-based key predistribution for wireless sensor networks", "paper_id": "WOS:000258298800006"}