{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "different_peer-to-peer_traffic_management_schemas"}, {"score": 0.0044702911400353535, "phrase": "unprecedented_pressure"}, {"score": 0.0044289730051264116, "phrase": "internet_service_providers"}, {"score": 0.003320561182494713, "phrase": "first_time"}, {"score": 0.0032745778756077693, "phrase": "joint_implementation"}, {"score": 0.0031845067058084613, "phrase": "coherent_framework"}, {"score": 0.0031550351923674337, "phrase": "tod-cache"}, {"score": 0.0027062100658653485, "phrase": "optimal_caching"}, {"score": 0.0026811531172346676, "phrase": "redirection_problem"}, {"score": 0.0025592969422491476, "phrase": "highly_adaptive_and_scalable_heuristic_algorithm"}, {"score": 0.002523828967909659, "phrase": "close-to-optimal_performance"}, {"score": 0.0023867931451842087, "phrase": "diverse_network_and_end-system_configurations"}, {"score": 0.0021746987512551693, "phrase": "traditional_cache"}, {"score": 0.0021049977753042253, "phrase": "device_number"}], "paper_keywords": ["P2P", " BitTorrent", " Traffic management"], "paper_abstract": "The fast-growing traffic of peer-to-peer (P2P) applications, most notably BitTorrent, is putting unprecedented pressure to Internet Service Providers (ISPs). To address this challenge, a number of P2P traffic management schemes have been proposed in recent years, among which caching and redirection are two representatives. Both of them have shown their success in theory and in practice. Yet, their implementations are largely independent, making the overall effectiveness sub-optimal. In this paper, we for the first time examine the joint implementation of these two promising solutions under a coherent framework, Tod-Cache (Traffic Orientated Distributed Caching). We show that the combination of caching and redirection can dramatically reduce the P2P traffic traversing across ISPs. Under this framework, we formulate the optimal caching and redirection problem, and show its complexity. We then present a highly adaptive and scalable heuristic algorithm which achieves close-to-optimal performance with much lower computational complexity. We extensively evaluate our framework under diverse network and end-system configurations. Our simulation results show that, under the same configuration, it can achieve at least 85 % of performance of the traditional cache with at most 1/10 of the device number.", "paper_title": "On the collaboration of different peer-to-peer traffic management schemas", "paper_id": "WOS:000339877700012"}