{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "deterministic_catalytic_systems"}, {"score": 0.014480199250072661, "phrase": "noncatalyst_symbols"}, {"score": 0.014001338951863944, "phrase": "catalytic_system"}, {"score": 0.011721344350657264, "phrase": "next_configuration"}, {"score": 0.004760765880314089, "phrase": "i-membrane_catalytic_p_system"}, {"score": 0.004524348699657099, "phrase": "noncatalyst_symbol"}, {"score": 0.0042351951710402425, "phrase": "language_acceptor"}, {"score": 0.00417961150804265, "phrase": "input_alphabet_sigma"}, {"score": 0.004101464142010922, "phrase": "initial_configuration"}, {"score": 0.004047628461126961, "phrase": "fixed_string"}, {"score": 0.0038903078921935486, "phrase": "nonnegative_integers"}, {"score": 0.003739919686346847, "phrase": "sigma"}, {"score": 0.003689982350051231, "phrase": "maximal_multiset"}, {"score": 0.0036073064072936626, "phrase": "current_configuration"}, {"score": 0.003332210257373994, "phrase": "unary_recursively_enumerable_language"}, {"score": 0.003269854964322253, "phrase": "purely_catalytic_systems"}, {"score": 0.00307221807606505, "phrase": "unique_maximally_parallel_multiset"}, {"score": 0.003020415128902982, "phrase": "open_problem"}, {"score": 0.003009022147559257, "phrase": "deterministic_systems"}, {"score": 0.002913895605074143, "phrase": "membership_problem"}, {"score": 0.002843188885353517, "phrase": "parikh"}, {"score": 0.0027532820796396713, "phrase": "deterministic_catalytic_system"}, {"score": 0.0027377145516773137, "phrase": "simple_semilinear_set"}, {"score": 0.0026361507196990624, "phrase": "first_example"}, {"score": 0.0026113524778702624, "phrase": "p_systems"}, {"score": 0.002591681512611419, "phrase": "nondeterministic_version"}, {"score": 0.002562451837774567, "phrase": "deterministic_version"}, {"score": 0.0024441593713908196, "phrase": "reachable_configurations"}, {"score": 0.00241658945942583, "phrase": "effective_semilinear"}, {"score": 0.002322515212654509, "phrase": "reachability_set_non-semilinear"}, {"score": 0.0022963142779850562, "phrase": "multi-membrane_deterministic_catalytic_systems"}, {"score": 0.002141134176057931, "phrase": "contrasting_results"}, {"score": 0.0021049977753042253, "phrase": "semilinear_sets"}], "paper_keywords": [""], "paper_abstract": "We look at a I-membrane catalytic P system with evolution rules of the form Ca -> C nu or a -> nu, where C is a catalyst, a is a noncatalyst symbol, and nu is a (possibly null) string representing a multiset of noncatalyst symbols. (Note that we are only interested in the multiplicities of the symbols.) A catalytic system can be regarded as a language acceptor in the following sense. Given an input alphabet Sigma consisting of noncatalyst symbols, the system starts with an initial configuration wz, where w is a fixed string of catalysts and noncatalysts not containing any symbol in z, and z = a(1)(n1)...a(k)(nk) for some nonnegative integers n(1),..., n(k), with {a(1),..., a(k)} subset of Sigma. At each step, a maximal multiset of rules is nondeterministically selected and applied in parallel to the current configuration to derive the next configuration (note that the next configuration is not unique, in general). The string z is accepted if the system eventually halts. It is known that a 1-membrane catalytic system is universal in the sense that any unary recursively enumerable language can be accepted by a 1-membrane catalytic system (even by purely catalytic systems, i.e., when all rules are of the form Ca -> C nu). A catalytic system is said to be deterministic if at each step, there is a unique maximally parallel multiset of rules applicable. It has been an open problem whether deterministic systems of this kind are universal. We answer this question negatively: We show that the membership problem for deterministic catalytic systems is decidable. In fact, we show that the Parikh map of the language (subset of a(1)(*)...a(k)(*)) accepted by any deterministic catalytic system is a simple semilinear set which can be effectively constructed. Since non-deterministic 1-membrane catalytic system acceptors (with 2 catalysts) are universal, our result gives the first example of a variant of P systems for which the nondeterministic version is universal, but the deterministic version is not. We also show that for a deterministic 1-membrane catalytic system using only rules of type Ca -> C nu, the set of reachable configurations from a given initial configuration is an effective semilinear set. The application of rules of type a -> nu, however, is sufficient to render the reachability set non-semilinear. Our results generalize to multi-membrane deterministic catalytic systems. We also consider deterministic catalytic systems which allow rules to be prioritized and investigate three classes of such systems, depending on how priority in the application of the rules is interpreted. For these three prioritized systems, we obtain contrasting results: two are universal and one only accepts semilinear sets.", "paper_title": "On deterministic catalytic systems", "paper_id": "WOS:000236480300014"}