{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "geometric_range_spaces"}, {"score": 0.004714023408114857, "phrase": "geometric_range-spaces"}, {"score": 0.004502513902377422, "phrase": "sensor_networks"}, {"score": 0.0035283552859817764, "phrase": "k_colors"}, {"score": 0.0033698643928647726, "phrase": "k_points"}, {"score": 0.0028842607155980513, "phrase": "symmetrically"}, {"score": 0.0028437313714204087, "phrase": "finite_set"}, {"score": 0.0026307897899760383, "phrase": "sufficiently_large_number"}, {"score": 0.0025573643582417573, "phrase": "k_different_colors"}, {"score": 0.0024947959375982614, "phrase": "covering_regions"}, {"score": 0.0024510413243251906, "phrase": "allowed_colors"}, {"score": 0.00229164285862567, "phrase": "region_families"}, {"score": 0.002157811371348755, "phrase": "previous_results"}, {"score": 0.0021426102976193385, "phrase": "pach"}, {"score": 0.0021274945376796974, "phrase": "tardos"}, {"score": 0.002105008120514369, "phrase": "toth"}], "paper_keywords": ["Coloring", " Covering", " Decompositions", " Geometric hypergraphs"], "paper_abstract": "We study several coloring problems for geometric range-spaces. In addition to their theoretical interest, some of these problems arise in sensor networks. Given a set of points in R(2) or R(3), we want to color them so that every region of a certain family (e. g., every disk containing at least a certain number of points) contains points of many (say, k) different colors. In this paper, we think of the number of colors and the number of points as functions of k. Obviously, for a fixed k using k colors, it is not always possible to ensure that every region containing k points has all colors present. Thus, we introduce two types of relaxations: either we allow the number of colors used to increase to c(k), or we require that the number of points in each region increases to p(k). Symmetrically, given a finite set of regions in R(2) or R(3), we want to color them so that every point covered by a sufficiently large number of regions is contained in regions of k different colors. This requires the number of covering regions or the number of allowed colors to be greater than k. The goal of this paper is to bound these two functions for several types of region families, such as halfplanes, halfspaces, disks, and pseudo-disks. This is related to previous results of Pach, Tardos, and Toth on decompositions of coverings.", "paper_title": "Coloring Geometric Range Spaces", "paper_id": "WOS:000262696300012"}