{"auto_keywords": [{"score": 0.004776297980616768, "phrase": "multiplayer_games"}, {"score": 0.0038417798012011155, "phrase": "common_objective"}, {"score": 0.003675023529026644, "phrase": "multiplayer_coalition_games"}, {"score": 0.003417565253539315, "phrase": "winning_objective"}, {"score": 0.0032956583072431423, "phrase": "linear_temporal_logic"}, {"score": 0.003216804708106142, "phrase": "together_attempt"}, {"score": 0.0031271827534050493, "phrase": "possible_strategies"}, {"score": 0.002896274285996145, "phrase": "module-controller_pair"}, {"score": 0.0028498718992429825, "phrase": "quantified_boolean_formula-based_methods"}, {"score": 0.0027704444816096484, "phrase": "winning_coalition_strategy"}, {"score": 0.0027370835853738626, "phrase": "coalition_strategy"}, {"score": 0.002347628167175859, "phrase": "dynamic_simulation-based_approach"}, {"score": 0.002263799931018574, "phrase": "coalition_requirements"}, {"score": 0.0021306709646058295, "phrase": "winning_strategy"}, {"score": 0.0021049977753042253, "phrase": "intelligent_environment"}], "paper_keywords": ["Quantified Boolean formulas (QBF)", " realizability", " simulation", " test generation"], "paper_abstract": "Multiplayer games are played by a set of agents, where, at each round, all players give their moves, and the combination of their moves defines the successor states for the game. In such games, the players pursue certain goals with their moves and in that pursuit, they can form coalitions to fulfill a common objective. In this paper, we adopt this model of multiplayer coalition games in the context of 3-party systems, consisting of a module, its environment, and a controller. The winning objective of our game is given as a specification in linear temporal logic and the module and controller together attempt to satisfy the specification for all possible strategies of the environment. In this paper, we analyze the problem for various degrees of observability of the module-controller pair, and provide quantified Boolean formula-based methods for investigating the existence of a winning coalition strategy. The coalition strategy can only be fulfilled on carefully implementing both the module and the controller such that they can cooperate. We also consider the problem where the implementations of the module and the controller are available and we present a dynamic simulation-based approach for verifying whether these implementations conform to the coalition requirements. In case, they do not, we provide algorithms for designing the winning strategy for an intelligent environment to drive the coalition to a refutation.", "paper_title": "Verifying Coalitions in 3-Party Systems", "paper_id": "WOS:000307974800012"}