{"auto_keywords": [{"score": 0.040552623246943253, "phrase": "empirical_model"}, {"score": 0.015719716506582538, "phrase": "everyday_life_information"}, {"score": 0.015444893574401788, "phrase": "urban_teenagers"}, {"score": 0.012131189380720095, "phrase": "theoretical_model"}, {"score": 0.004430452655732319, "phrase": "second_part"}, {"score": 0.004352123742308589, "phrase": "two-part_article"}, {"score": 0.004249825947483216, "phrase": "theoretical_and_an_empirical_model"}, {"score": 0.0034304883989739804, "phrase": "project_data"}, {"score": 0.0030819219279832224, "phrase": "seven_independent_variables"}, {"score": 0.0025776913268808124, "phrase": "previous_researchers"}, {"score": 0.002315574871863272, "phrase": "similar_information"}, {"score": 0.0021049977753042253, "phrase": "additional_research"}], "paper_keywords": [""], "paper_abstract": "This is the second part of a two-part article that presents a theoretical and an empirical model of the everyday life information needs of urban teenagers. Part 2 focuses on the derivation of the empirical model-and on its relationship to the theoretical model presented in Part 1. Part 2 also provides examples from the project data to support each of the components of the empirical model, which ties 28 information needs topics to the seven independent variables in the theoretical model. Comparison of the empirical model to the results of past youth information behavior research shows that the participants in this study tended to have the same types of information needs as previous researchers have found with more advantaged, nonminority groups of teens. This finding is significant because it suggests that teenagers have similar information needs across socioeconomic, ethnic, cultural, and geographic boundaries. Due to the exploratory nature of this study, however, additional research is necessary to confirm this possibility.", "paper_title": "Toward a model of the everyday life information needs of urban teenagers, part 2: Empirical model", "paper_id": "WOS:000239672100002"}