{"auto_keywords": [{"score": 0.03187891831312188, "phrase": "melodic_expectations"}, {"score": 0.00481495049065317, "phrase": "short_melodies"}, {"score": 0.0045411156682300695, "phrase": "timbre_identification"}, {"score": 0.0037112756920669593, "phrase": "theoretical_accounts"}, {"score": 0.0034099718632933027, "phrase": "preceding_melody"}, {"score": 0.003257960296952439, "phrase": "proposed_interactions"}, {"score": 0.0030524448705134283, "phrase": "theoretical_work"}, {"score": 0.0026104197983396367, "phrase": "relatively_early_stage"}, {"score": 0.002576603426735759, "phrase": "perceptual_processing"}, {"score": 0.002477753633057247, "phrase": "priming_effects"}, {"score": 0.0023826870912207303, "phrase": "musical_training"}, {"score": 0.002232261129770455, "phrase": "passive_exposure"}, {"score": 0.0021049977753042253, "phrase": "formal_training"}], "paper_keywords": [""], "paper_abstract": "In this study, participants identified the timbre of pitches when they occurred in isolation, and again when they occurred appended to short melodies. For pitches congruent with the melody, timbre identification generally improved when the pitches were appended to the melody in comparison to when they occurred in isolation. In addition, the amount of improvement was broadly consistent with theoretical accounts of the degree to which the pitches were expected, given the preceding melody. This finding relates both to proposed interactions in processing between pitch and timbre, and to theoretical work regarding melodic expectations. It suggests that melodic expectations can be revealed implicitly, and is consistent with the idea that they operate at a relatively early stage of perceptual processing. In this study, priming effects were shown in listeners without musical training, demonstrating that expectations can develop in response to passive exposure to music, not only in response to formal training.", "paper_title": "Timbre priming effects and expectation in melody", "paper_id": "WOS:000241439600005"}