{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "url_queries"}, {"score": 0.004813478739605526, "phrase": "non-url_queries"}, {"score": 0.004666228956744244, "phrase": "relatively_unexamined_query_type"}, {"score": 0.004359500411441827, "phrase": "user_click-through_behavior"}, {"score": 0.0040094142308666975, "phrase": "search_log"}, {"score": 0.0038049789989278463, "phrase": "qualitative_and_quantitative_analyses"}, {"score": 0.0034992667091713813, "phrase": "statistically_significant_differences"}, {"score": 0.003320756562046789, "phrase": "query_length"}, {"score": 0.0026649432435828842, "phrase": "informational_and_transactional_queries"}, {"score": 0.0021496083700137305, "phrase": "user's_url"}, {"score": 0.0021049977753042253, "phrase": "optimal_strategy"}], "paper_keywords": [""], "paper_abstract": "This study investigated a relatively unexamined query type, queries composed of URLs. The extent, variation, and user click-through behavior was examined to determine the intent behind URL queries. The study made use of a search log from which URL queries were identified and selected for both qualitative and quantitative analyses. It was found that URL queries accounted for similar to 17% of the sample. There were statistically significant differences between URL queries and non-URL queries in the following attributes: mean query length; mean number of tokens per query; and mean number of clicks per query. Users issuing such queries clicked on fewer result list items higher up the ranking compared to non-URL queries. Classification indicated that nearly 86% of queries were navigational in intent with informational and transactional queries representing about 7% of URL queries each. This is in contrast to past research that suggested that URL queries were 100% navigational. The conclusions of this study are that URL queries are relatively common and that simply returning the page that matches a user's URL is not an optimal strategy.", "paper_title": "Analyzing URL Queries", "paper_id": "WOS:000283565500011"}