{"auto_keywords": [{"score": 0.004583205112737672, "phrase": "process_variation_problems"}, {"score": 0.004178198896815672, "phrase": "process_variation"}, {"score": 0.003738973626996355, "phrase": "yield_losses"}, {"score": 0.0030123335878664064, "phrase": "novel_cache_architecture"}, {"score": 0.0029570303644956128, "phrase": "narrow-width_values"}, {"score": 0.002456744238900652, "phrase": "meaningful_data"}, {"score": 0.0024116163689723354, "phrase": "cache_arrays"}, {"score": 0.0023382335380460304, "phrase": "high_energy-_efficiency"}, {"score": 0.0022811346113905295, "phrase": "high_cache_yield"}, {"score": 0.002144400314994328, "phrase": "failure-induced_yield_losses"}, {"score": 0.0021049977753042253, "phrase": "leakage-induced_yield_losses"}], "paper_keywords": ["3D microprocessor", " last-level cache", " leakage energy optimization", " narrow-width value", " process variation", " yield"], "paper_abstract": "As process technologies evolves, tackling process variation problems is becoming more challenging in 3D (i.e., die- stacked) microprocessors. Process variation adversely affects performance, power, and reliability of the 3D microprocessors, which in turn results in yield losses. In particular, last-level caches (LLCs: L2 or L3 caches) are known as the most vulnerable component to process variation in 3D microprocessors. In this paper, we propose a novel cache architecture that exploits narrow-width values for yield improvement of LLCs (in this paper, L2 caches) in 3D microprocessors. Our proposed architecture disables faulty cache subparts and turns on only the portions that store meaningful data in the cache arrays, which results in high energy- efficiency as well as high cache yield. In an energy-/performance-efficient manner, our proposed architecture significantly recovers not only SRAM cell failure-induced yield losses but also leakage-induced yield losses.", "paper_title": "An Energy-Efficient Last-Level Cache Architecture for Process Variation-Tolerant 3D Microprocessors", "paper_id": "WOS:000359236500004"}