{"auto_keywords": [{"score": 0.04910845908100794, "phrase": "predictive_maintenance_program"}, {"score": 0.04753117215441004, "phrase": "industrial_plants"}, {"score": 0.043652565151265574, "phrase": "predictive_maintenance_programs"}, {"score": 0.00481495049065317, "phrase": "predictive_maintenance_techniques"}, {"score": 0.004621671570727774, "phrase": "significant_benefits"}, {"score": 0.003284026247389735, "phrase": "industrial_plant"}, {"score": 0.003152006152091526, "phrase": "different_alternatives"}, {"score": 0.003025277245730244, "phrase": "technological_level"}, {"score": 0.002748984715897838, "phrase": "vibration_analysis"}, {"score": 0.0027116246112603875, "phrase": "lubricant_analysis"}, {"score": 0.0024138345020219333, "phrase": "proposed_model"}], "paper_keywords": ["predictive maintenance", " analytic hierarchy process", " lubricant analysis", " vibration analysis"], "paper_abstract": "A Predictive Maintenance Program can provide significant benefits to industrial plants in the areas of security, quality and availability. However, Predictive Maintenance Programs have lacked analysis in matters related to their set up, management and control. In this paper, a model is proposed in order to select the most suitable Predictive technique to set up in an industrial plant. For this purpose, different alternatives are proposed depending on the technological level of the Predictive Maintenance Program. The condition monitoring techniques considered in the model are: vibration analysis and lubricant analysis; the integration of both techniques is also considered in the construction of alternatives. The proposed model can facilitate the decision making process for setting up Predictive Maintenance programs, and also help to avoid the failure of such programs. The model has been tested in a set of industrial plants with a Predictive Maintenance Program.", "paper_title": "Model for the selection of predictive maintenance techniques", "paper_id": "WOS:000257231600004"}