{"auto_keywords": [{"score": 0.04964156968469263, "phrase": "bayesian_probabilities"}, {"score": 0.012695244357335721, "phrase": "chemical_modelling"}, {"score": 0.00481495049065317, "phrase": "chemical_models"}, {"score": 0.004536029676655286, "phrase": "chemical_property"}, {"score": 0.0041001740903338834, "phrase": "differentiated_manner"}, {"score": 0.0039341294012600085, "phrase": "practical_context"}, {"score": 0.003689053436223376, "phrase": "high_variety"}, {"score": 0.0036553070575015344, "phrase": "underlying_modelling_algorithms"}, {"score": 0.0036218682585355895, "phrase": "high-dimensionality_problems"}, {"score": 0.00338060449446278, "phrase": "alternative_principles"}, {"score": 0.002799810685137358, "phrase": "probability_modelling"}, {"score": 0.002416920221610185, "phrase": "bayesian"}, {"score": 0.002318566141177149, "phrase": "possible_approaches"}, {"score": 0.002224510044064184, "phrase": "active_choice"}, {"score": 0.0021049977753042253, "phrase": "validated_and_reliable_ways"}], "paper_keywords": ["Bayesian inference", " Predictive posterior", " Gaussian process", " Bootstrapping", " Meta-modelling", " Decision making"], "paper_abstract": "A prediction of a chemical property or activity is subject to uncertainty. Which type of uncertainties to consider, whether to account for them in a differentiated manner and with which methods, depends on the practical context. In chemical modelling, general guidance of the assessment of uncertainty is hindered by the high variety in underlying modelling algorithms, high-dimensionality problems, the acknowledgement of both qualitative and quantitative dimensions of uncertainty, and the fact that statistics offers alternative principles for uncertainty quantification. Here, a view of the assessment of uncertainty in predictions is presented with the aim to overcome these issues. The assessment sets out to quantify uncertainty representing error in predictions and is based on probability modelling of errors where uncertainty is measured by Bayesian probabilities. Even though well motivated, the choice to use Bayesian probabilities is a challenge to statistics and chemical modelling. Fully Bayesian modelling, Bayesian meta-modelling and bootstrapping are discussed as possible approaches. Deciding how to assess uncertainty is an active choice, and should not be constrained by traditions or lack of validated and reliable ways of doing it.", "paper_title": "Assessment of uncertainty in chemical models by Bayesian probabilities: Why, when, how?", "paper_id": "WOS:000357465200001"}