{"auto_keywords": [{"score": 0.047153975166672836, "phrase": "traction_battery"}, {"score": 0.009410260879861871, "phrase": "fuzzy_comprehensive_theory"}, {"score": 0.007413564187281155, "phrase": "appraisal_system"}, {"score": 0.005926822441399532, "phrase": "ahp"}, {"score": 0.00481495049065317, "phrase": "traction_battery_performance_appraisal"}, {"score": 0.004758457292840376, "phrase": "fuzzy_comprehensive_and_ahp._purpose_-_the_purpose"}, {"score": 0.004485735417293941, "phrase": "electric_vehicle"}, {"score": 0.0038624981944755813, "phrase": "estimating_system"}, {"score": 0.0037133478610481994, "phrase": "analytic_hierarchy_process"}, {"score": 0.003312486229143855, "phrase": "weighting_value_vector"}, {"score": 0.0031719830393831115, "phrase": "appraisal_objects"}, {"score": 0.0027741761880779535, "phrase": "application_example"}, {"score": 0.002573965014439041, "phrase": "different_criteria"}, {"score": 0.0025038930574283174, "phrase": "ev_type"}, {"score": 0.0024842242921857705, "phrase": "application_condition"}, {"score": 0.0023787690061742566, "phrase": "ev_designers"}, {"score": 0.0021049977753042253, "phrase": "evaluating_process"}], "paper_keywords": ["Fuzzy logic", " Analytic hierarchy process", " cybernetics", " Systems analysis", " Electric cells"], "paper_abstract": "Purpose - The purpose of this paper is to establish an appraisal system for evaluating and choosing traction battery for electric vehicle (EV) quantitatively and effectively. Design/methodology/approach - Traction battery always bottlenecks the development of EV. It is difficult to evaluate and choose traction battery for EV because there are many kinds of battery and each kind has many performance parameters. An estimating system for traction battery was proposed with every factor considered. Analytic hierarchy process (AHP) and fuzzy comprehensive theory are both used to evaluate program with many aims and influencing factors. It is relatively easy and exact using AHP to determine the weighting value vector of every criterion but not so exact when marking the appraisal objects. Objections am be marked more reasonably with fuzzy comprehensive theory. Both the advantages of these two theories were integrated in this paper in order to evaluate battery more effectively. It was proved effective by the application example. Findings - An estimating system and appraisal method for traction battery. Research limitations/implications - Weighing factors of different criteria should be determined based on the EV type and application condition. Practical implications - Very useful method and system for EV designers to choose and evaluate traction battery. Originality/value - The appraisal system eliminates the blindness when choosing and evaluating traction battery for EV. Both the merits of AHP and fuzzy comprehensive theory were combined for the evaluating process.", "paper_title": "Modelling of traction battery performance appraisal based on fuzzy comprehensive and AHP", "paper_id": "WOS:000267416500007"}