{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "social_change"}, {"score": 0.004330321475256457, "phrase": "web_sites"}, {"score": 0.0036214184763804034, "phrase": "five_basic_structural_questions"}, {"score": 0.0033301694494391612, "phrase": "social_movement_organizations"}, {"score": 0.0026330549554033876, "phrase": "different_types"}, {"score": 0.0024211009463218484, "phrase": "web_site"}, {"score": 0.002354302193867031, "phrase": "clearer_understanding"}, {"score": 0.0023281003994670714, "phrase": "online_opportunities"}, {"score": 0.0021526564019119466, "phrase": "best_approximations"}, {"score": 0.002128694000627911, "phrase": "reachable_populations"}, {"score": 0.0021049977753042253, "phrase": "online_content"}], "paper_keywords": ["petition", " boycott", " letter-writing", " e-mailing", " methodology", " sampling", " activism", " social movement"], "paper_abstract": "This article examines the distribution and architecture of web sites hosting or directly linking to opportunities to participate in four online activist tactics: online petitioning, boycotting, and e-mailing and letter-writing campaigns. Specifically, this article addresses five basic structural questions: (1) Are opportunities to engage in these tactics usually organized around social movement organizations and/or actors? (2) Do sites tend to host or link to these tactics? (3) On average, how tactically specialized or tactically diversified are sites? (4) How are these tactics distributed across different types of sites? and (5) How many implementations of each tactic were offered per web site? Contributions include a clearer understanding of online opportunities to participate in these four tactics and the introduction of an innovative, methodological technique that generates best approximations of reachable populations of online content, which can be randomly sampled when those populations are large.", "paper_title": "Pursuing social change - Online the use of four protest tactics on the Internet", "paper_id": "WOS:000239092100007"}