{"auto_keywords": [{"score": 0.04595882709092281, "phrase": "original_message"}, {"score": 0.011186725381849989, "phrase": "achievable_rate"}, {"score": 0.00816029038629704, "phrase": "joint_decoding"}, {"score": 0.006929873636420754, "phrase": "el_gamal"}, {"score": 0.006875332285110895, "phrase": "decoding_process"}, {"score": 0.00481495049065317, "phrase": "optimal_compressions"}, {"score": 0.00477697450538617, "phrase": "compress-and-forward_relay_schemes"}, {"score": 0.004726803158961502, "phrase": "classical_compress-and-forward_relay_scheme"}, {"score": 0.004604771615106045, "phrase": "multiple_relays"}, {"score": 0.004579414215146498, "phrase": "successive_way"}, {"score": 0.00446009116328642, "phrase": "relay's_observation"}, {"score": 0.004322028657344352, "phrase": "successive_decoding"}, {"score": 0.003525646552423009, "phrase": "modified_compress-and-forward_relay_schemes"}, {"score": 0.0033089729811373336, "phrase": "kim"}, {"score": 0.0032226176041578697, "phrase": "single-relay_case"}, {"score": 0.00285355076155907, "phrase": "achievable_rates"}, {"score": 0.0024347729296556844, "phrase": "repetitive_encoding_framework"}, {"score": 0.002409141581517314, "phrase": "lim_et_al"}, {"score": 0.0023092800159571773, "phrase": "interesting_discovery"}, {"score": 0.0022489748481844853, "phrase": "repetitive_encoding"}, {"score": 0.0022135486371828795, "phrase": "delayed_decoding"}, {"score": 0.0021217773701268706, "phrase": "simpler_classical_encoding_process"}, {"score": 0.0021105762086304544, "phrase": "cover_and_el_gamal_with_a"}, {"score": 0.0021049977753042253, "phrase": "block-by-block_backward_decoding_process"}], "paper_keywords": ["Backward decoding", " compress-and-forward", " compression-message joint decoding", " compression-message successive decoding", " multiple-relay channel"], "paper_abstract": "In the classical compress-and-forward relay scheme developed by Cover and El Gamal, the decoding process operates in a successive way: the destination first decodes the compression of the relay's observation and then decodes the original message of the source. Recently, several modified compress-and-forward relay schemes were proposed, where the destination jointly decodes the compression and the message, instead of successively. Such a modification on the decoding process was motivated by realizing that it is generally easier to decode the compression jointly with the original message, and more importantly, the original message can be decoded even without completely decoding the compression. Thus, joint decoding provides more freedom in choosing the compression at the relay. However, the question remains in these modified compress-and-forward relay schemes-whether this freedom of selecting the compression necessarily improves the achievable rate of the original message. It has been shown by El Gamal and Kim in 2010 that the answer is negative in the single-relay case. In this paper, it is further demonstrated that in the case of multiple relays, there is no improvement on the achievable rate by joint decoding either. More interestingly, it is discovered that any compressions not supporting successive decoding will actually lead to strictly lower achievable rates for the original message. Therefore, to maximize the achievable rate for the original message, the compressions should always be chosen to support successive decoding. Furthermore, it is shown that any compressions not completely decodable even with joint decoding will not provide any contribution to the decoding of the original message. The above phenomenon is also shown to exist under the repetitive encoding framework recently proposed by Lim et al., which improved the achievable rate in the case of multiple relays. Here, another interesting discovery is that the improvement is not a result of repetitive encoding, but the benefit of delayed decoding after all the blocks have been finished. The same rate is shown to be achievable with the simpler classical encoding process of Cover and El Gamal with a block-by-block backward decoding process.", "paper_title": "On the Optimal Compressions in the Compress-and-Forward Relay Schemes", "paper_id": "WOS:000318163500005"}