{"auto_keywords": [{"score": 0.046030203640501983, "phrase": "service_pool"}, {"score": 0.010265348107704058, "phrase": "service_pools"}, {"score": 0.00481495049065317, "phrase": "aware_service_pool"}, {"score": 0.004762202897268383, "phrase": "dependable_service"}, {"score": 0.0046073860169839305, "phrase": "popular_approach"}, {"score": 0.004556901872357751, "phrase": "dependable_service_oriented_architecture"}, {"score": 0.004149429072483132, "phrase": "different_service_providers"}, {"score": 0.004081385289516914, "phrase": "desired_reliability"}, {"score": 0.0033465923623290034, "phrase": "automated_approach"}, {"score": 0.0030808211830129304, "phrase": "typical_triangle_soa_model"}, {"score": 0.0021049977753042253, "phrase": "different_pooling_algorithms"}], "paper_keywords": ["service oriented architecture", " service pool", " dependability", " performance"], "paper_abstract": "As a popular approach to dependable service oriented architecture (SOA), a service pool collects a set of services that provide the same functionality by different service providers for achieving desired reliability. However, if the tradeoff between reliability and other important qualities, e.g., performance, has to be considered, the construction and management of a service pool become much more complex. In this paper, an automated approach to this problem is presented. Based on the investigation of service pools in the typical triangle SOA model, two challenges critical to the effectiveness and efficiency of service pools are identified, including which services should be held by a pool and what order these services are invoked in. A set of algorithms are designed to address the two challenges and then a service pool can be automatically constructed and managed for given reliability and performance requirements in polynomial time. The approach is demonstrated on a J2EE based service platform and the comparison results between different pooling algorithms are evaluated.", "paper_title": "Performance aware service pool in dependable service oriented architecture", "paper_id": "WOS:000239255200014"}