{"auto_keywords": [{"score": 0.031246924350827786, "phrase": "positive_and_negative_emotions"}, {"score": 0.00481495049065317, "phrase": "affective_analysis_of_professional_and_amateur_abstract_paintings_using_statistical_analysis"}, {"score": 0.004774530554776604, "phrase": "art_theory"}, {"score": 0.004444317282171449, "phrase": "resulting_works"}, {"score": 0.004242868712089958, "phrase": "artists'_mood"}, {"score": 0.003722761107761564, "phrase": "different_backgrounds"}, {"score": 0.0036296886647898094, "phrase": "emotional_messages"}, {"score": 0.0030657684627749364, "phrase": "state-of-the-art_recognition_system"}, {"score": 0.002889778121878728, "phrase": "professional_and_amateur_abstract_artworks"}, {"score": 0.002723862897844177, "phrase": "ground_truth"}, {"score": 0.002600194073758015, "phrase": "computer_vision_techniques"}, {"score": 0.0022145052062614514, "phrase": "new_opportunities"}, {"score": 0.0021590588269751816, "phrase": "specific_painting"}, {"score": 0.0021049977753042253, "phrase": "global_and_local_scales"}], "paper_keywords": ["Visual Art", " Abstract Paintings", " Emotion Recognition", " Eye tracking"], "paper_abstract": "When artists express their feelings through the artworks they create, it is believed that the resulting works transform into objects with \"emotions\" capable of conveying the artists' mood to the audience. There is little to no dispute about this belief: Regardless of the artwork, genre, time, and origin of creation, people from different backgrounds are able to read the emotional messages. This holds true even for the most abstract paintings. Could this idea be applied to machines as well? Can machines learn what makes a work of art \"emotional\"? In this work, we employ a state-of-the-art recognition system to learn which statistical patterns are associated with positive and negative emotions on two different datasets that comprise professional and amateur abstract artworks. Moreover, we analyze and compare two different annotation methods in order to establish the ground truth of positive and negative emotions in abstract art. Additionally, we use computer vision techniques to quantify which parts of a painting evoke positive and negative emotions. We also demonstrate how the quantification of evidence for positive and negative emotions can be used to predict which parts of a painting people prefer to focus on. This method opens new opportunities of research on why a specific painting is perceived as emotional at global and local scales.", "paper_title": "Affective Analysis of Professional and Amateur Abstract Paintings Using Statistical Analysis and Art Theory", "paper_id": "WOS:000361248300003"}