{"auto_keywords": [{"score": 0.04670169813494038, "phrase": "metalib"}, {"score": 0.01572041380253572, "phrase": "google"}, {"score": 0.010945761276929557, "phrase": "google_scholar"}, {"score": 0.004687159050154687, "phrase": "purpose_-_this_paper"}, {"score": 0.004545240514015278, "phrase": "search_tools"}, {"score": 0.004390689303780405, "phrase": "prior_instruction"}, {"score": 0.0040971095888461045, "phrase": "morae_software"}, {"score": 0.003622642432563435, "phrase": "findings_-_google_scholar"}, {"score": 0.0035673211706948576, "phrase": "almost_all_measures"}, {"score": 0.0034993519231560637, "phrase": "positive_effect"}, {"score": 0.0030232568024943455, "phrase": "metalib_implementation"}, {"score": 0.0027992118597278087, "phrase": "practical_implications_-_training"}, {"score": 0.0027143009946473937, "phrase": "user_interface"}, {"score": 0.0026421139329830755, "phrase": "students'_expectations"}, {"score": 0.002532526438148958, "phrase": "first_alternative_search"}, {"score": 0.002493810638588771, "phrase": "academic_literature"}, {"score": 0.002308910575113746, "phrase": "academic_library"}, {"score": 0.002221655243524476, "phrase": "academic_libraries"}, {"score": 0.002121281184742656, "phrase": "one's_knowledge"}], "paper_keywords": ["search engines", " students", " research methods", " user interfaces", " customer satisfaction"], "paper_abstract": "Purpose - This paper aims to understand how students experience the search tools Google Scholar and Metalib and the role of prior instruction. Design/methodology/approach - A total of 32 undergraduate students searched academic articles for their thesis work. Searches were recorded using Morae software and were analysed along with the number of articles saved and responses to a questionnaire. All searched with both tools. Half of the students received training before searching. Findings - Google Scholar performed better in almost all measures. Training had a positive effect on the amount and quality of articles saved. Responses to Google Scholar were more positive than to Metalib. However, the students were not overwhelmingly enthusiastic about either of the tools. Research limitations/implications - Each Metalib implementation is to some extent unique, which limits the extent to which results can be generalised to other implementations. Practical implications - Training is valuable for both tools. The user interface to Metalib does not conform with students' expectations and needs further improvement. Both tools strive to be a first alternative search too. for academic literature but neither performed well enough in this study to recommend it to be used in that role in an academic library setting. Originality/value - These tools are important to academic libraries but few user studies have been published. particularly on Google Scholar. To one's knowledge no other user study on these tools has looked at the effects of instruction.", "paper_title": "Metalib and google scholar: a user study", "paper_id": "WOS:000248348700008"}