{"auto_keywords": [{"score": 0.03506708166115819, "phrase": "symmetric_soliton"}, {"score": 0.015719716506582538, "phrase": "dual-core_systems"}, {"score": 0.01100140245793754, "phrase": "bifurcation_loop"}, {"score": 0.010171980841240427, "phrase": "reverse_bifurcation"}, {"score": 0.008783928016167605, "phrase": "asymmetric_solitons"}, {"score": 0.0047820521205253035, "phrase": "cubic-quintic_nonlinearity"}, {"score": 0.004359216541892805, "phrase": "asymmetric_soliton"}, {"score": 0.004314595541370065, "phrase": "subcritical_bifurcation"}, {"score": 0.004270429323002124, "phrase": "similar_phenomenon"}, {"score": 0.004197817125707719, "phrase": "dual-core_system"}, {"score": 0.004098221047046135, "phrase": "linearly_coupled_fiber_bragg_gratings"}, {"score": 0.004000978459274141, "phrase": "symmetry-breaking_bifurcation"}, {"score": 0.0036469533983843755, "phrase": "basic_model"}, {"score": 0.0035118324133358706, "phrase": "linearly_coupled_nls_equations"}, {"score": 0.003428467738516592, "phrase": "cq"}, {"score": 0.0032675746199502614, "phrase": "supercritical_bifurcation"}, {"score": 0.0031790442889277864, "phrase": "larger_value"}, {"score": 0.0028876014831335, "phrase": "second_bifurcation"}, {"score": 0.002809336972473929, "phrase": "broad_interval"}, {"score": 0.0026958888229781618, "phrase": "stable_symmetric"}, {"score": 0.0024069209350505933, "phrase": "symmetric_solitons"}, {"score": 0.0022703369939978185, "phrase": "dynamical_symmetrization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["bifurcation", " symmetry breaking", " bistability", " soliton collisions"], "paper_abstract": "It is well known that a symmetric soliton in coupled nonlinear Schrodinger (NLS) equations with the cubic nonlinearity loses its stability with the increase of the energy, featuring a transition into an asymmetric soliton via a subcritical bifurcation. A similar phenomenon was found in a dual-core system with quadratic nonlinearity, and in linearly coupled fiber Bragg gratings, with a difference that the symmetry-breaking bifurcation is supercritical in those cases. We aim to study transitions between symmetric and asymmetric solitons in dual-core systems with saturable nonlinearity. We demonstrate that a basic model of this type, viz., a pair of linearly coupled NLS equations with the cubic-quintic (CQ) nonlinearity, features a bifurcation loop: a symmetric soliton loses its stability via a supercritical bifurcation, which is followed, at a larger value of the energy, by a reverse bifurcation that restores the stability of the symmetric soliton. If the linear-coupling constant; is small enough, the second bifurcation is subcritical, and there is a broad interval of energies in which the system is bistable, with coexisting stable symmetric and asymmetric solitons. At larger., the reverse bifurcation is supercritical, and at very large X the bifurcation loop disappears, the symmetric soliton being always stable. Collisions between solitons are studied too. Symmetric solitons always collide elastically, while collisions between asymmetric solitons turns them into breathers, that subsequently undergo dynamical symmetrization. In terms of optics, the model may be realized in both the temporal and spatial domains. (c) 2006 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "Transitions between symmetric and asymmetric solitons in dual-core systems with cubic-quintic nonlinearity", "paper_id": "WOS:000245216500006"}