{"auto_keywords": [{"score": 0.0455567754671588, "phrase": "medical_devices"}, {"score": 0.009534940173782465, "phrase": "emr"}, {"score": 0.009343600560575104, "phrase": "emr_system"}, {"score": 0.009262780462845897, "phrase": "outpatient_clinical_setting"}, {"score": 0.007875180585511257, "phrase": "emr."}, {"score": 0.00481495049065317, "phrase": "seamless_and_comprehensive_integrated_medical_device_interface_system"}, {"score": 0.004704187604192605, "phrase": "general_hospital"}, {"score": 0.004529581568905548, "phrase": "key_strategies"}, {"score": 0.004451184959169275, "phrase": "healthcare_services"}, {"score": 0.004386887374401584, "phrase": "system's_interoperability"}, {"score": 0.0042859292226559535, "phrase": "big_barrier"}, {"score": 0.00400838009056285, "phrase": "comprehensively_integrated_medical_device_interface_system"}, {"score": 0.0036411406244705557, "phrase": "relevant_standards"}, {"score": 0.003365755538047523, "phrase": "samsung_medical_center"}, {"score": 0.003346371899138418, "phrase": "smc"}, {"score": 0.0031476068430779367, "phrase": "personal_computers"}, {"score": 0.003039445153076014, "phrase": "smc's_long_term"}, {"score": 0.0029867619862229853, "phrase": "first_deployment"}, {"score": 0.0027931086065664354, "phrase": "medical_device"}, {"score": 0.0026503306888150426, "phrase": "storage_space"}, {"score": 0.0022974765563692776, "phrase": "slow_speed"}, {"score": 0.0022774637727808237, "phrase": "old-fashioned_medical_devices"}, {"score": 0.002231441081806766, "phrase": "current_implementation"}, {"score": 0.002212002242551553, "phrase": "medical_device_interface_system"}, {"score": 0.002186346373382786, "phrase": "smc_framework"}, {"score": 0.0021609874288933163, "phrase": "clinical_workflow"}, {"score": 0.002142161017595363, "phrase": "satisfactory_manner"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Medical device interface", " Interoperability", " Connectivity", " EMR"], "paper_abstract": "Purpose: Implementing an efficient Electronic Medical Record (EMR) system is regarded as one of the key strategies for improving the quality of healthcare services. However, the system's interoperability between medical devices and the EMR is a big barrier to deploying the EMR system in an outpatient clinical setting. The purpose of this study is to design a framework for a seamless and comprehensively integrated medical device interface system, and to develop and implement a system for accelerating the deployment of the EMR system. Methods: We designed and developed a framework that could transform data from medical devices into the relevant standards and then store them in the EMR. The framework is composed of 5 interfacing methods according to the types of medical devices utilized at an outpatient clinical setting, registered in Samsung Medical Center (SMC) database. The medical devices used for this study were devices that have microchips embedded or that came packaged with personal computers. The devices are completely integrated with the EMR based on SMC's long term IT strategies. Results: First deployment of integrating 352 medical devices into the EMR took place in April, 2006, and it took about 48 months. By March, 2010, every medical device was interfaced with the EMR. About 66,000 medical examinations per month were performed taking up an average of 50GB of storage space. We surveyed users, mainly the technicians. Out of 73 that responded, 76% of the respondents replied that they were strongly satisfied or satisfied, 20% replied as being neutral and only 4% complained about the speed of the system, which was attributed to the slow speed of the old-fashioned medical devices and computers. Conclusion: The current implementation of the medical device interface system based on the SMC framework significantly streamlines the clinical workflow in a satisfactory manner. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Design and implementation of a seamless and comprehensive integrated medical device interface system for outpatient electronic medical records in a general hospital", "paper_id": "WOS:000288201100005"}