{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud"}, {"score": 0.004664352260912174, "phrase": "diverse_kinds"}, {"score": 0.00453643016617164, "phrase": "sophisticated_analytics"}, {"score": 0.00450052670755585, "phrase": "mash-up_applications"}, {"score": 0.004325208730208653, "phrase": "grand_visions"}, {"score": 0.004240116703465252, "phrase": "cyber-physical_systems"}, {"score": 0.004156691746581458, "phrase": "cloud_infrastructure"}, {"score": 0.0037040785566765954, "phrase": "data_owners"}, {"score": 0.003559675269411366, "phrase": "cloud_users"}, {"score": 0.003517458289610994, "phrase": "cloud_platform"}, {"score": 0.0034619440946558186, "phrase": "flexible_mechanisms"}, {"score": 0.0030602966787192745, "phrase": "comprehensive_set"}, {"score": 0.003036040409062437, "phrase": "practical_scenarios"}, {"score": 0.002737615043512257, "phrase": "existing_basic_access_control_mechanisms"}, {"score": 0.002694375425481759, "phrase": "adequate_flexibility"}, {"score": 0.002429451930463481, "phrase": "popular_xacml_model"}, {"score": 0.002391067964886602, "phrase": "flexible_access_control_decisions"}, {"score": 0.0023346234464901978, "phrase": "seamless_fashion"}, {"score": 0.0022345720876241044, "phrase": "commercial_cloud_environment"}, {"score": 0.0022168460543913787, "phrase": "experimental_runs"}, {"score": 0.0021049977753042253, "phrase": "implemented_prototype"}], "paper_keywords": ["Cloud computing", " Access control", " Flexible sharing", " Fine-grained policies", " XACML"], "paper_abstract": "Sharing data from various sources and of diverse kinds, and fusing them together for sophisticated analytics and mash-up applications are emerging trends, and are prerequisites for realizing grand visions such as that of cyber-physical systems enabled smart cities. Cloud infrastructure can enable such data sharing both because it can scale easily to an arbitrary volume of data and computation needs on demand, as well as because of natural collocation of diverse such data sets within the infrastructure. However, in order to convince data owners that their data are well protected while being shared among cloud users, the cloud platform needs to provide flexible mechanisms for the users to express the constraints (access rules) subject to which the data should be shared, and likewise, enforce them effectively. We study a comprehensive set of practical scenarios where data sharing needs to be enforced by methods such as aggregation, windowed frame, value constrains, etc., and observe that existing basic access control mechanisms do not provide adequate flexibility to support effective data sharing in a secure and controlled manner. In this paper, we thus propose a framework for cloud that extends popular XACML model significantly by integrating flexible access control decisions and data access in a seamless fashion. We have prototyped the framework and deployed it on commercial cloud environment for experimental runs to test the efficacy of our approach and evaluate the performance of the implemented prototype.", "paper_title": "City on the Sky: Extending XACML for Flexible, Secure Data Sharing on the Cloud", "paper_id": "WOS:000302869400009"}