{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "quantum_shannon_theory"}, {"score": 0.015040308686576824, "phrase": "coding_theorems"}, {"score": 0.004523103062368843, "phrase": "classical_and_quantum_source_compression"}, {"score": 0.004482873744893272, "phrase": "noisy_channel_coding_theorems"}, {"score": 0.004287008195370748, "phrase": "asymptotic_properties"}, {"score": 0.004248869786808024, "phrase": "quantum_and_classical_channels"}, {"score": 0.004045068727683462, "phrase": "unified_approach"}, {"score": 0.003991196463806465, "phrase": "important_class"}, {"score": 0.003382704886584695, "phrase": "larger_hilbert_space"}, {"score": 0.002984588143879959, "phrase": "shannon"}, {"score": 0.0028795712616923462, "phrase": "direct_coding_theorems"}, {"score": 0.002729029534060092, "phrase": "resource_calculus"}, {"score": 0.0026330549554033876, "phrase": "resource_inequalities"}, {"score": 0.0025404470150468387, "phrase": "structural_insights"}, {"score": 0.002506562885555113, "phrase": "logical_dependencies"}, {"score": 0.0024292428060702803, "phrase": "above-mentioned_basic_coding_results"}, {"score": 0.002271476019266231, "phrase": "related_resource_inequalities"}, {"score": 0.0021720199689914464, "phrase": "optimal_tradeoff_curves"}], "paper_keywords": ["asymptotic resource inequalities", " family of quantum protocols", " resource calculus", " tradeoff curves"], "paper_abstract": "Quantum Shannon theory is loosely defined as a collection of coding theorems, such as classical and quantum source compression, noisy channel coding theorems, entanglement distillation, etc., which characterize asymptotic properties of quantum and classical channels and states. In this paper, we advocate a unified approach to an important class of problems in quantum Shannon theory, consisting of those that are bipartite, unidirectional, and memoryless. We formalize two principles that have long been tacitly understood. First, we describe how the Church of the larger Hilbert space allows us to move flexibly between states, channels, ensembles, and their purifications. Second, we introduce finite and asymptotic (quantum) information processing resources as the basic objects of quantum Shannon theory and recast the protocols used in direct coding theorems as inequalities between resources. We develop the rules of a resource calculus which allows us to manipulate and combine resource inequalities. This framework simplifies many coding theorem proofs and provides structural insights into the logical dependencies among coding theorems. We review the above-mentioned basic coding results and show how a subset of them can be unified into a family of related resource inequalities. Finally, we use this family to find optimal tradeoff curves for all protocols involving one noisy quantum resource and two noiseless ones.", "paper_title": "A resource framework for quantum Shannon theory", "paper_id": "WOS:000259407000013"}