{"auto_keywords": [{"score": 0.02384891513100404, "phrase": "buchi"}, {"score": 0.00481495049065317, "phrase": "partial-observation_stochastic_parity_games"}, {"score": 0.0046004861111734185, "phrase": "omega-regular_winning_conditions"}, {"score": 0.004382196270563035, "phrase": "reactive_systems"}, {"score": 0.0043161190928529755, "phrase": "complexity_results"}, {"score": 0.004086350434865782, "phrase": "special_cases"}, {"score": 0.0037988336463795963, "phrase": "winning_mode"}, {"score": 0.0035100601949451028, "phrase": "partial_view"}, {"score": 0.0031364320619313765, "phrase": "complete_view"}, {"score": 0.003070340620983981, "phrase": "one-sided_partial-observation_games"}, {"score": 0.0029422942175866057, "phrase": "partial-observation_markov_decision"}, {"score": 0.0028715299874549245, "phrase": "blind_one-player_games"}, {"score": 0.0028367868542874737, "phrase": "probabilistic_automata"}, {"score": 0.002565695161331182, "phrase": "probability_distribution"}, {"score": 0.002526938673434697, "phrase": "actual_random_choice"}, {"score": 0.002370437342182877, "phrase": "full_randomization"}, {"score": 0.002285389120812562, "phrase": "parity_objective"}, {"score": 0.0022168460543913787, "phrase": "cobuchi_condition"}, {"score": 0.0021049977753042253, "phrase": "winning_condition"}], "paper_keywords": ["Partial-observation games", " Stochastic games", " omega-regular conditions and parity objectives"], "paper_abstract": "We consider two-player zero-sum stochastic games on graphs with omega-regular winning conditions specified as parity objectives. These games have applications in the design and control of reactive systems. We survey the complexity results for the problem of deciding the winner in such games, and in classes of interest obtained as special cases, based on the information and the power of randomization available to the players, on the class of objectives and on the winning mode. On the basis of information, these games can be classified as follows: (a) partial-observation (both players have partial view of the game); (b) one-sided partial-observation (one player has partial-observation and the other player has complete-observation); and (c) complete-observation (both players have complete view of the game). The one-sided partial-observation games have two important subclasses: the one-player games, known as partial-observation Markov decision processes (POMDPs), and the blind one-player games, known as probabilistic automata. On the basis of randomization, (a) the players may not be allowed to use randomization (pure strategies), or (b) they may choose a probability distribution over actions but the actual random choice is external and not visible to the player (actions invisible), or (c) they may use full randomization. Finally, various classes of games are obtained by restricting the parity objective to a reachability, safety, Buchi, or coBuchi condition. We also consider several winning modes, such as sure-winning (i.e., all outcomes of a strategy have to satisfy the winning condition), almost-sure winning (i.e., winning with probability 1), limit-sure winning (i.e., winning with probability arbitrarily close to 1), and value-threshold winning (i.e., winning with probability at least nu, where nu is a given rational).", "paper_title": "A survey of partial-observation stochastic parity games", "paper_id": "WOS:000324114600006"}