{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "concept_mapping"}, {"score": 0.04955634432616475, "phrase": "medical_narratives"}, {"score": 0.02726923497736462, "phrase": "mapping_rate"}, {"score": 0.004671744927552112, "phrase": "free_text_phrases"}, {"score": 0.004646166761323157, "phrase": "pre-defined_concepts"}, {"score": 0.004557735965224235, "phrase": "clinical_notes"}, {"score": 0.004483272938890684, "phrase": "natural_language_processing_systems"}, {"score": 0.004326065324764224, "phrase": "token-order-specific_naive_bayes-based_machine_learning_system"}, {"score": 0.0041287394089001405, "phrase": "reference_standard"}, {"score": 0.00390803830940721, "phrase": "mcvs_natural_language_processing_system"}, {"score": 0.0035889534160030386, "phrase": "va_documents"}, {"score": 0.0034820976803610513, "phrase": "mcvs"}, {"score": 0.0034345606706788273, "phrase": "snomed_ct"}, {"score": 0.0033970080655122965, "phrase": "token-order-specific_language_model"}, {"score": 0.0030434427368516556, "phrase": "bayes"}, {"score": 0.0026742845156077174, "phrase": "token-order-specific_model"}, {"score": 0.0025874530719850156, "phrase": "single_discharge_summary"}, {"score": 0.0025103303020759956, "phrase": "processed_documents"}, {"score": 0.002482857818141971, "phrase": "high_performance"}, {"score": 0.0021816694697063843, "phrase": "wide_range"}, {"score": 0.0021696949408934857, "phrase": "medical_concepts"}, {"score": 0.002145942273032774, "phrase": "token-order-specific_naive_bayes_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Natural language processing", " Bayesian prediction", " Machine learning", " Systematized nomenclature of medicine"], "paper_abstract": "Rapid, automated determination of the mapping of free text phrases to pre-defined concepts could assist in the annotation of clinical notes and increase the speed of natural language processing systems. The aim of this study was to design and evaluate a token-order-specific naive Bayes-based machine learning system (RapTAT) to predict associations between phrases and concepts. Performance was assessed using a reference standard generated from 2860 VA discharge summaries containing 567,520 phrases that had been mapped to 12,056 distinct Systematized Nomenclature of Medicine - Clinical Terms (SNOMED CT) concepts by the MCVS natural language processing system. It was also assessed on the manually annotated, 2010 i2b2 challenge data. Performance was established with regard to precision, recall, and F-measure for each of the concepts within the VA documents using bootstrapping. Within that corpus, concepts identified by MCVS were broadly distributed throughout SNOMED CT, and the token-order-specific language model achieved better performance based on precision, recall, and F-measure (0.95 +/- 0.15, 0.96 +/- 0.16, and 0.95 +/- 0.16, respectively; mean +/- SD) than the bag-of-words based, naive Bayes model (0.64 +/- 0.45, 0.61 +/- 0.46, and 0.60 +/- 0.45, respectively) that has previously been used for concept mapping. Precision, recall, and F-measure on the i2b2 test set were 92.9%, 85.9%, and 89.2% respectively, using the token-order-specific model. RapTAT required just 7.2 ms to map all phrases within a single discharge summary, and mapping rate did not decrease as the number of processed documents increased. The high performance attained by the tool in terms of both accuracy and speed was encouraging, and the mapping rate should be sufficient to support near-real-time, interactive annotation of medical narratives. These results demonstrate the feasibility of rapidly and accurately mapping phrases to a wide range of medical concepts based on a token-order-specific naive Bayes model and machine learning. Published by Elsevier Inc.", "paper_title": "Development and evaluation of RapTAT: A machine learning system for concept mapping of phrases from medical narratives", "paper_id": "WOS:000335429200006"}