{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_consultation"}, {"score": 0.0040869663676860535, "phrase": "physician-patient_interactions"}, {"score": 0.0040591367766929344, "phrase": "general_practice_consultations"}, {"score": 0.003963211180578005, "phrase": "observational_qualitative_study"}, {"score": 0.00388278852285898, "phrase": "phenomenological_tradition"}, {"score": 0.0038563438670516127, "phrase": "irving_goffman"}, {"score": 0.003803991592917943, "phrase": "australian_general_practice"}, {"score": 0.0037651925588909783, "phrase": "single_digital_video_recording"}, {"score": 0.003613899384402803, "phrase": "tagging_software_program"}, {"score": 0.003528458369404996, "phrase": "iterative_process"}, {"score": 0.003141246279336443, "phrase": "lower_pole"}, {"score": 0.00293357578778008, "phrase": "-those_physicians"}, {"score": 0.002447101794397243, "phrase": "physician-patient_interaction"}, {"score": 0.002148677187261496, "phrase": "general_practice"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Physician-patient relationship", " Medical informatics", " Qualitative research", " Office visits"], "paper_abstract": "Purpose: The use of a computer during general/family practice consultations is on the rise across the world, yet little is known about the effect the use of a computer may have on the all important physician-patient relationship. This paper provides a framework for further analysis of computers influence on physician-patient interactions during general practice consultations. Methods: This is an observational qualitative study informed by hermeneutics and the phenomenological tradition of Irving Goffman, based in Australian general practice. A single digital video recording of 141 patient encounters over 6 months was made and imported into a tagging software program to facilitate analysis. Through an iterative process several keys and behaviours were described for doctors, patients and the computers in the interaction. Results: Physicians tended to fall into two categories; unipolar-those who tend to maintain the lower pole of their body facing the computer except were examination of the patient or some other action demands otherwise, and bipolar-those physicians who repeatedly alternate the orientation of their lower pole between the computer and the patient. Patients tended to demonstrate behaviours that focused on the physician to the exclusion of the computer (dyadic) and included the computer in the consultation (triadic). The computer was also seen to influence the physician-patient interaction passively or actively. Conclusion: In describing and categorising the behaviours of the computer, in addition to the humans in the consultation, a framework is provided for further analytical work on the impact of computers in general practice. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Doctor, patient and computer-A framework for the new consultation", "paper_id": "WOS:000262768000004"}