{"auto_keywords": [{"score": 0.049629989081335604, "phrase": "temporal_coherence"}, {"score": 0.03946251376776597, "phrase": "straightforward_method"}, {"score": 0.02945039190682477, "phrase": "individual_lines"}, {"score": 0.004725048156646577, "phrase": "traditional_animation"}, {"score": 0.004680725471654037, "phrase": "laborious_task"}, {"score": 0.0046368166127362925, "phrase": "key_drawings"}, {"score": 0.004535950496583731, "phrase": "thereafter_inbetween_drawings"}, {"score": 0.004232946822003551, "phrase": "non-trivial_task"}, {"score": 0.004127834058321831, "phrase": "alternate_approach"}, {"score": 0.0038038433163457754, "phrase": "animation_quality"}, {"score": 0.003651477256755136, "phrase": "unsatisfactory_visual_artifacts"}, {"score": 0.0034504976926879424, "phrase": "high-order_derivatives"}, {"score": 0.0033226745641157527, "phrase": "triangle_meshes"}, {"score": 0.003229914287184765, "phrase": "temporal_continuity"}, {"score": 0.0030424776690194714, "phrase": "improved_approach"}, {"score": 0.0028839835971201846, "phrase": "time_domain"}, {"score": 0.0028211393326371035, "phrase": "visual_artifacts"}, {"score": 0.0027946258636360245, "phrase": "temporal_relationship"}, {"score": 0.0027509877943131945, "phrase": "entire_animation_sequence"}, {"score": 0.0026910337912859268, "phrase": "correspondent_trajectory"}, {"score": 0.0026158609712563737, "phrase": "global_optimization"}, {"score": 0.002510960575700234, "phrase": "fully_automatic_novel_approach"}], "paper_keywords": [""], "paper_abstract": "Producing traditional animation is a laborious task where the key drawings are first drawn by artists and thereafter inbetween drawings are created, whether it is by hand or computer-assisted. Auto-inbetweening of these 2D key drawings by computer is a non-trivial task as 3D depths are missing. An alternate approach is to generate all the drawings by extracting lines directly from animated 3D models frame by frame, concatenating and rendering them together into an animation. However, animation quality generated using this straightforward method bears two problems. Firstly, the animation contains unsatisfactory visual artifacts such as line flickering and popping. This is especially pronounced when the lines are extracted using high-order derivatives, such as ridges and valleys, from 3D models represented in triangle meshes. Secondly, there is a lack of temporal continuity as each drawing is generated without taking its neighboring drawings into consideration. In this paper, we propose an improved approach over the straightforward method by transferring extracted 3D line drawings of each frame into individual 3D lines and processing them along the time domain. Our objective is to minimize the visual artifacts and incorporate temporal relationship of individual lines throughout the entire animation sequence. This is achieved by creating correspondent trajectory of each line from each frame and applying global optimization on each trajectory. To realize this target, we present a fully automatic novel approach, which consists of (1) a line matching algorithm, (2) an optimizing algorithm, taking into account both the variations of numbers and lengths of 3D lines in each frame, and (3) a robust tracing method for transferring collections of line segments extracted from the 3D models into individual lines. We evaluate our approach on several animated model sequences to demonstrate its effectiveness in producing line drawing animations with temporal coherence.", "paper_title": "Animated 3D Line Drawings with Temporal Coherence", "paper_id": "WOS:000327310800030"}