{"auto_keywords": [{"score": 0.04979663082346403, "phrase": "multi-interface_networks"}, {"score": 0.042795631880665826, "phrase": "coverage_problem"}, {"score": 0.04104649579233778, "phrase": "connectivity_problem"}, {"score": 0.03821955337502036, "phrase": "maximum_cost_set"}, {"score": 0.03803163656923421, "phrase": "active_interfaces"}, {"score": 0.03414229704911109, "phrase": "np"}, {"score": 0.029987513498409158, "phrase": "eta_ln_i"}, {"score": 0.026543394503465437, "phrase": "exact_algorithms"}, {"score": 0.02641131020118906, "phrase": "special_cases"}, {"score": 0.00481495049065317, "phrase": "maximum_duty"}, {"score": 0.0047057084749407485, "phrase": "multiple_wired_or_wireless_interfaces"}, {"score": 0.0043258453436258405, "phrase": "activation_cost"}, {"score": 0.003956279504935489, "phrase": "second_one"}, {"score": 0.00385658790017119, "phrase": "connecting_path"}, {"score": 0.0035905670850420943, "phrase": "single_node"}, {"score": 0.0033685408148574876, "phrase": "first_case"}, {"score": 0.0033004240095380623, "phrase": "second_case"}, {"score": 0.0031926502105078494, "phrase": "fixed_delta"}, {"score": 0.003089607312104677, "phrase": "delta"}, {"score": 0.0030648097361278856, "phrase": "maximum_degree"}, {"score": 0.0030028163106553345, "phrase": "different_interfaces"}, {"score": 0.0027529929913806066, "phrase": "general_approximation_algorithm"}, {"score": 0.0026025004034550114, "phrase": "input_graph"}, {"score": 0.00235560370536971, "phrase": "ka_parts"}, {"score": 0.0022961534630650347, "phrase": "inapproximability_result"}, {"score": 0.0021049977753042253, "phrase": "general_problem"}], "paper_keywords": ["Multi-interface network", " Energy saving", " Computational complexity", " Approximation algorithm"], "paper_abstract": "We consider devices equipped with multiple wired or wireless interfaces. By switching of various interfaces, each device might establish several connections. A connection is established when the devices at its endpoints share at least one active interface. Each interface is assumed to require an activation cost. In this paper, we consider two basic networking problems in the field of multi-interface networks. The first one, known as the Coverage problem, requires to establish the connections defined by a network. The second one, known as Connectivity problem, requires to guarantee a connecting path between any pair of nodes of a network. Both are subject to the constraint of keeping as low as possible the maximum cost set of active interfaces at each single node. We study the problems of minimizing the maximum cost set of active interfaces among the nodes of the network in order to cover all the edges in the first case, or to ensure connectivity in the second case. We prove that the Coverage problem is NP-hard for any fixed Delta a parts per thousand yen5 and ka parts per thousand yen16, with Delta being the maximum degree, and k being the number of different interfaces among the network. We also show that, unless P=NP, the problem cannot be approximated within a factor of eta ln I\", for a certain constant eta. We then provide a general approximation algorithm which guarantees a factor of O((1+b)ln I\"), with b being a parameter depending on the topology of the input graph. Interestingly, b can be bounded by a constant for many graph classes. Other approximation and exact algorithms for special cases are presented. Concerning the Connectivity problem, we prove that it is NP-hard for any fixed Delta a parts per thousand yen3 and ka parts per thousand yen10. Also for this problem, the inapproximability result holds, that is, unless P=NP, the problem cannot be approximated within a factor of eta ln I\", for a certain constant eta. We then provide approximation and exact algorithms for the general problem and for special cases, respectively.", "paper_title": "Minimize the Maximum Duty in Multi-interface Networks", "paper_id": "WOS:000299482700013"}