{"auto_keywords": [{"score": 0.05007841602719238, "phrase": "erroneous_atom-to-atom_mapping"}, {"score": 0.04613998105509959, "phrase": "cgr"}, {"score": 0.02805478355966996, "phrase": "correct_and_wrong_mappings"}, {"score": 0.004245051445971095, "phrase": "atom-to-atom_mapping"}, {"score": 0.0040978781692373005, "phrase": "automated_mapping_tool"}, {"score": 0.004056769841308405, "phrase": "chem_axon"}, {"score": 0.00376127170364341, "phrase": "kegg_database"}, {"score": 0.003233075944817365, "phrase": "chemical_transformations"}, {"score": 0.003073988343893906, "phrase": "matching_atom_pairs"}, {"score": 0.0029672941061574375, "phrase": "automated_mappings"}, {"score": 0.0028933521924166287, "phrase": "human_expert"}, {"score": 0.002723301730223192, "phrase": "isida_fragment_descriptors"}, {"score": 0.002563219920877287, "phrase": "machine_learning"}, {"score": 0.002524688179363081, "phrase": "learned_models"}, {"score": 0.0024617483174454113, "phrase": "n-fold_cross-validation"}, {"score": 0.0022937210378944457, "phrase": "external_test_set"}, {"score": 0.0021049977753042253, "phrase": "wrongly_mapped_reactions"}], "paper_keywords": [""], "paper_abstract": "Machine learning (SVM and JRip rule learner) methods have been used in conjunction with the Condensed Graph of Reaction (CGR) approach to identify errors in the atom-to-atom mapping of chemical reactions produced by an automated mapping tool by Chem Axon. The modeling has been performed on the three first enzymatic classes of metabolic reactions from the KEGG database. Each reaction has been converted into a CGR representing a pseudomolecule with conventional (single, double, aromatic, etc.) bonds and dynamic bonds characterizing chemical transformations. The Chem Axon tool was used to automatically detect the matching atom pairs in reagents and products. These automated mappings were analyzed by the human expert and classified as \"correct\" or \"wrong\". ISIDA fragment descriptors generated for CGRs for both correct and wrong mappings were used as attributes in machine learning. The learned models have been validated in n-fold cross-validation on the training set followed by a challenge to detect correct and wrong mappings within an external test set of reactions, never used for learning. Results show that both SVM and JRip models detect most of the wrongly mapped reactions. We believe that this approach could be used to identify erroneous atom-to-atom mapping performed by any automated algorithm.", "paper_title": "Models for Identification of Erroneous Atom-to-Atom Mapping of Reactions Performed by Automated Algorithms", "paper_id": "WOS:000312563800002"}