{"auto_keywords": [{"score": 0.043113908496203904, "phrase": "music_algorithm"}, {"score": 0.00481495049065317, "phrase": "joint_beamforming"}, {"score": 0.0046876650517406, "phrase": "doa"}, {"score": 0.004543352284098364, "phrase": "imprecise_knowledge"}, {"score": 0.004482873744893272, "phrase": "array_manifold"}, {"score": 0.00341309513558946, "phrase": "doa_estimation"}, {"score": 0.003293142761521425, "phrase": "specific_source's_doa"}, {"score": 0.0031210475158175432, "phrase": "array_output"}, {"score": 0.0022311596751824416, "phrase": "iterative_algorithm"}, {"score": 0.0022112700457629494, "phrase": "inter-cooperative_beamforming"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithm"}], "paper_keywords": ["Direction of arrival", " Beamforming", " Eigen-decomposition"], "paper_abstract": "The MUltiple Signal Classification (MUSIC) algorithm for DoA is known to degrade due to imprecise knowledge about the array manifold. In this paper, we present a theorem, to show how imprecise knowledge affects the performance of the MUSIC algorithm. This theorem Proves that performance of the MUSIC algorithm degrades less if the array responses of the sources impinging on the array are less correlated with each other, or if just a single source exists. This insult inspired us to develop a method for improving DoA estimation. That is, in estimating a specific source's DoA, we try to remove the influences of other sources from the array output, so that the input includes only a single source approximately. If so, the MUSIC algorithm should be relatively robust, because only one source is approximately involved in the estimation. A beamformer, at least approximately, can serve this purpose. On the other hand, more exact DoA estimation can further improve beamforming. As these two steps iteratively continue, we can obtain much more exact beamforming and DoA estimation. On the basis of this idea, we propose an iterative algorithm for inter-cooperative beamforming and DoA estimation. Our numerical experiments show the validity of the proposed algorithm.", "paper_title": "AN ITERATIVE ALGORITHM FOR JOINT BEAMFORMING AND DOA ESTIMATION", "paper_id": "WOS:000290601400036"}