{"auto_keywords": [{"score": 0.04480024954324635, "phrase": "residential_addresses"}, {"score": 0.01554812470465916, "phrase": "different_granularity"}, {"score": 0.010530856385300479, "phrase": "different_databases"}, {"score": 0.005988732730825417, "phrase": "target_database"}, {"score": 0.00481495049065317, "phrase": "hierarchical_data_sources"}, {"score": 0.004613825044585923, "phrase": "real_world"}, {"score": 0.00445550467119693, "phrase": "data_items"}, {"score": 0.004219912413995784, "phrase": "particular_interest"}, {"score": 0.004090901264701185, "phrase": "related_pieces"}, {"score": 0.0037414662674652805, "phrase": "non-matching_street_names"}, {"score": 0.0036695284042874395, "phrase": "different_levels"}, {"score": 0.003612971658533784, "phrase": "address_synchronization"}, {"score": 0.00354349559754076, "phrase": "common_approaches"}, {"score": 0.0035024506353894644, "phrase": "authoritative_reference_set"}, {"score": 0.0034753508746887957, "phrase": "correct_residential_addresses"}, {"score": 0.0031050953733360825, "phrase": "address_connector"}, {"score": 0.0028067105937184954, "phrase": "lookup_function"}, {"score": 0.002742017872865778, "phrase": "query_address"}, {"score": 0.0023471384232499016, "phrase": "global_greedy_address-matching_algorithm"}, {"score": 0.00224013518726087, "phrase": "address_containment"}, {"score": 0.0021049977753042253, "phrase": "real-world_data"}], "paper_keywords": ["Data quality", " Record linkage", " Entity resolution", " Hierarchical data", " Trees", " Approximate matching", " Similarity query", " Residential addresses"], "paper_abstract": "Different databases often store information about the same or related objects in the real world. To enable collaboration between these databases, data items that refer to the same object must be identified. Residential addresses are data of particular interest as they often provide the only link between related pieces of information in different databases. Unfortunately, residential addresses that describe the same location might vary considerably and hence need to be synchronized. Non-matching street names and addresses stored at different levels of granularity make address synchronization a challenging task. Common approaches assume an authoritative reference set and correct residential addresses according to the reference set. Often, however, no reference set is available, and correcting addresses with different granularity is not possible. We present the address connector, which links residential addresses that refer to the same location. Instead of correcting addresses according to an authoritative reference set, the connector defines a lookup function for residential addresses. Given a query address and a target database, the lookup returns all residential addresses in the target database that refer to the same location. The lookup supports addresses that are stored with different granularity. To align the addresses of two matching streets, we use a global greedy address-matching algorithm that guarantees a stable matching. We define the concept of address containment that allows us to correctly link addresses with different granularity. The evaluation of our solution on real-world data from a municipality shows that our solution is both effective and efficient.", "paper_title": "The address connector: noninvasive synchronization of hierarchical data sources", "paper_id": "WOS:000326936100006"}