{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_producing_organization"}, {"score": 0.01552028008826851, "phrase": "open_software_enterprise_model"}, {"score": 0.015388708155101178, "phrase": "software_producing_organizations"}, {"score": 0.003751011827704279, "phrase": "intellectual_property_laws"}, {"score": 0.003130077012135034, "phrase": "objective_assessment"}, {"score": 0.002703327151461985, "phrase": "five_interviews"}, {"score": 0.0025892330566358503, "phrase": "organizational_openness"}, {"score": 0.0025449518236394103, "phrase": "complex_variables"}, {"score": 0.002197801146305747, "phrase": "surrounding_software_ecosystem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Software ecosystems", " Product software vendors", " Platforms", " Software development governance", " Organizational openness"], "paper_abstract": "Software producing organizations are frequently judged by others for being 'open' or 'closed', where a more 'closed' organization is seen as being detrimental to its software ecosystem. These qualifications can harm the reputation of these companies, for they are deemed to promote vendor lock-in, use closed data formats, and are seen as using intellectual property laws to harm others. These judgements, however, are frequently based on speculation and the need arises for a method to establish openness of an organization, such that decisions are no longer based on prejudices, but on an objective assessment of the practices of a software producing organization. In this article the open software enterprise model is presented that enables one to establish the degree of openness of a software producing organization. The model has been evaluated in five interviews, is illustrated using three case studies, and shows that organizational openness and transparency are complex variables, that should not be determined based on belief or prejudice. Furthermore, the model can be used by software producing organizations as a reference for further opening up their business, to stimulate the surrounding software ecosystem, and further their business goals. (c) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Shades of gray: Opening up a software producing organization with the open software enterprise model", "paper_id": "WOS:000304722300005"}