{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sodium_radio-iodide"}, {"score": 0.004048483412089098, "phrase": "density_functional_theory_geometrical_optimizations"}, {"score": 0.003755307753574745, "phrase": "radioactive_content"}, {"score": 0.0033450437338616596, "phrase": "sodium_radio-iodide_molecules"}, {"score": 0.0032309093154028663, "phrase": "mulliken_charge_distribution_analysis"}, {"score": 0.003120657021758196, "phrase": "small_charge_transfer"}, {"score": 0.003031650815900696, "phrase": "fullerene's_carbon_atoms"}, {"score": 0.002911278281894321, "phrase": "bond_lengths"}, {"score": 0.0027795345823932406, "phrase": "binding_energy"}], "paper_keywords": ["Buckyball", " C-60", " Fullerene", " Nanocapsule", " Sodium radio-iodide"], "paper_abstract": "In this work we have studied the well-known \"Buckminsterfullerene\" C-60 containing different amounts, from one to four molecules, of sodium radio-iodide ((NaI)-I-131), with density functional theory geometrical optimizations and molecular dynamics at 310 K and atmospheric pressure. We found that nanocapsules with the radioactive content (NaI)-I-131@C-60, 2Na(131)I@C-60 and 3Na(131)I@C-60 are stable. Furthermore, the C-60 fullerene undergoes expansion when the number of sodium radio-iodide molecules inside increases. Utilizing the Mulliken charge distribution analysis it was shown that a small charge transfer occurs from iodine to fullerene's carbon atoms. This produces repulsion which increases bond lengths thus the structure is weakened while the binding energy per atom decreases. For the case in which the fullerene initially contains four sodium radio-iodide molecules the expansion is greater than that which the structure can withstand. So the fullerene breaks and releases its contents. This result leads us to conclude that the fullerene can encapsulate up to three molecules of sodium radio-iodide.", "paper_title": "Encapsulation of sodium radio-iodide in fullerene C-60", "paper_id": "WOS:000332180100025"}