{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "biometric_system_performance"}, {"score": 0.004728499903204582, "phrase": "common_criteria"}, {"score": 0.004494570360108983, "phrase": "licensed_laboratories"}, {"score": 0.0043345662747335065, "phrase": "predefined_set"}, {"score": 0.004303252595782034, "phrase": "security_specifications"}, {"score": 0.004150030918669128, "phrase": "international_common_criteria"}, {"score": 0.00370900100807903, "phrase": "cc"}, {"score": 0.0035766032751309677, "phrase": "special_characteristics"}, {"score": 0.0034742854447532678, "phrase": "specific_guidelines"}, {"score": 0.0031960852616842207, "phrase": "security_properties"}, {"score": 0.002918845343769625, "phrase": "cem"}, {"score": 0.00269475174341129, "phrase": "biometric_technical_performance"}, {"score": 0.0022472527731744974, "phrase": "cc_standard"}, {"score": 0.002151388538895855, "phrase": "biometric_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Biometrics", " Security evaluation", " Common Criteria (CC)", " Common Evaluation Methodology (CEM)", " Biometric performance testing", " Vulnerability"], "paper_abstract": "Nowadays, many Information Technology (IT) systems and applications are assessed by licensed laboratories in order to guarantee that these products fulfil a predefined set of security specifications. These evaluations are carried out in accordance with international Common Criteria (CC) for IT Security Evaluation and its Common Evaluation Methodology (CEM), with the objective of obtaining a certificate which will be recognised in several countries. Nevertheless, CC does not go into detail of each of the special characteristics for most of the IT technologies. Therefore specific guidelines must be developed to help testing organisations to understand how to apply CEM to each kind of product, especially when the security properties to be analysed are different from other previously-defined technologies. This is currently the case for biometrics. In this paper, the authors define how CEM is to be interpreted in the context of biometrics, and the correct way to apply it for testing biometric system performance. Biometric technical performance is one of the most important security parameters to be analysed in the case of biometrics, because it not only quantifies the capability to correctly identify individuals, but also measures the probability of countering impersonation and disguise threats. These guidelines have been developed by considering the most recent version of the CC standard and ISO/IEC 19795 multipart standard, which establish the principles for the evaluation of biometric performance. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Evaluation of biometric system performance in the context of Common Criteria", "paper_id": "WOS:000323015000016"}