{"auto_keywords": [{"score": 0.03726682411720791, "phrase": "hausdorff_distance"}, {"score": 0.009020823522996648, "phrase": "nurbs"}, {"score": 0.007520596124321659, "phrase": "bounding-box_pairs"}, {"score": 0.004815072515236847, "phrase": "gpu"}, {"score": 0.004746206435786583, "phrase": "hausdorff"}, {"score": 0.004655742198075387, "phrase": "dynamic_deformable_nurbs_surfaces"}, {"score": 0.004545240514015278, "phrase": "parallel_gpu-accelerated_algorithm"}, {"score": 0.004458722048888919, "phrase": "directed_hausdorff_distance"}, {"score": 0.004168618849008299, "phrase": "axis-aligned_bounding-box_hierarchies"}, {"score": 0.0038047474331318974, "phrase": "bounding-box_hierarchies"}, {"score": 0.003750260412839128, "phrase": "nurbs_surfaces"}, {"score": 0.003608741436364746, "phrase": "cpu."}, {"score": 0.0032308006242867224, "phrase": "two-sided_culling_tests"}, {"score": 0.0030939108879709477, "phrase": "gpu."}, {"score": 0.0028923335491735564, "phrase": "bounding_boxes"}, {"score": 0.0026523079380037706, "phrase": "accuracy_bounds"}, {"score": 0.002166711569953301, "phrase": "dynamic_deformable_surfaces"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hausdorff distance", " NURBS", " GPU", " Geometric algorithms"], "paper_abstract": "We present a parallel GPU-accelerated algorithm for computing the directed Hausdorff distance from one NURBS surface to another, within a bound. We make use of axis-aligned bounding-box hierarchies that bound the NURBS surfaces to accelerate the computations. We dynamically construct as well as traverse the bounding-box hierarchies for the NURBS surfaces using operations that are optimized for the CPU. To compute the Hausdorff distance, we traverse this hierarchy after culling bounding-box pairs that do not contribute to the Hausdorff distance. Our contribution includes two-sided culling tests that can be performed in parallel using the GPU. The culling, based on the minimum and maximum distance ranges between the bounding boxes, eliminates bounding-box pairs from both surfaces that do not contribute to the Hausdorff distance simultaneously. We calculate accuracy bounds for our computed Hausdorff distance based on the curvature of the surfaces. Our algorithm runs in real-time with very small guaranteed error bounds for complex NURBS surfaces. Since we dynamically construct our bounding-box hierarchy, our algorithm can be used to interactively compute the Hausdorff distance for models made of dynamic deformable surfaces. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "GPU-accelerated Hausdorff distance computation between dynamic deformable NURBS surfaces", "paper_id": "WOS:000297495200007"}