{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "low-energy_tautomers"}, {"score": 0.00452101969521343, "phrase": "molecular_modelling"}, {"score": 0.004487635647709636, "phrase": "virtual_screening_experiments"}, {"score": 0.004292422863834094, "phrase": "typical_solvents"}, {"score": 0.004198010835867604, "phrase": "available_organic_chemistry_knowledge"}, {"score": 0.004015345955907906, "phrase": "software_packages"}, {"score": 0.0038691879515317267, "phrase": "esoteric_cases"}, {"score": 0.0038263829059336564, "phrase": "charged_molecules"}, {"score": 0.0036870776660851007, "phrase": "reliable_predictions"}, {"score": 0.0036598289615980837, "phrase": "low_energy_tautomers"}, {"score": 0.0034875380341306468, "phrase": "latter_problem"}, {"score": 0.0033480826365657303, "phrase": "nucleic_acid_bases"}, {"score": 0.0032381271420557052, "phrase": "dna_damage"}, {"score": 0.0032141856243404618, "phrase": "low-energy_electrons"}, {"score": 0.0031786037839399055, "phrase": "charge_transfer"}, {"score": 0.0031551734789836586, "phrase": "dna."}, {"score": 0.0028436862612859896, "phrase": "electronic_structure_methods"}, {"score": 0.002534539169474629, "phrase": "hybrid_approach"}, {"score": 0.002184659911556181, "phrase": "molecular_systems"}, {"score": 0.0021604504765314497, "phrase": "common_chemical_knowledge"}, {"score": 0.0021049977753042253, "phrase": "definite_predictions"}], "paper_keywords": ["Tautomer", " Combinatorial approach", " Electronic structure methods", " Chemoinformatics"], "paper_abstract": "Finding the most stable tautomer or a set of low-energy tautomers of molecules is critical in many aspects of molecular modelling or virtual screening experiments. Enumeration of low-energy tautomers of neutral molecules in the gas-phase or typical solvents can be performed by applying available organic chemistry knowledge. This kind of enumeration is implemented in a number of software packages and it is relatively reliable. However, in esoteric cases such as charged molecules in uncommon, non-aqueous solvents there is simply not enough available knowledge to make reliable predictions of low energy tautomers. Over the last few years we have been developing an approach to address the latter problem and we successfully applied it to discover the most stable anionic tautomers of nucleic acid bases that might be involved in the process of DNA damage by low-energy electrons and in charge transfer through DNA. The approach involves three steps: (1) combinatorial generation of a library of tautomers, (2) energy-based screening of the library using electronic structure methods, and (3) analysis of the information generated in step (2). In steps 1-3 we employ combinatorial, computational and chemoinformatics techniques, respectively. Therefore, this hybrid approach is named \"Combinatorial*Computational*Chemoinformatics\", or just abbreviated as C-3 (or C-cube) approach. This article summarizes our developments and most interesting methodological aspects of the C-3 approach. It can serve as an example how to identify the most stable tautomers of molecular systems for which common chemical knowledge had not been sufficient to make definite predictions.", "paper_title": "Combinatorial-computational-chemoinformatics (C-3) approach to finding and analyzing low-energy tautomers", "paper_id": "WOS:000278894800014"}