{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "deteriorating_jobs"}, {"score": 0.004435363840720883, "phrase": "actual_processing_time"}, {"score": 0.004235095881928715, "phrase": "increasing_linear_function"}, {"score": 0.0039010428828989826, "phrase": "completion_times"}, {"score": 0.0034308688638878286, "phrase": "objective_functions"}, {"score": 0.0033096502887394233, "phrase": "six_scheduling_problems"}, {"score": 0.00325901518290063, "phrase": "different_combinations"}, {"score": 0.0031277316566463978, "phrase": "maximum_cost"}, {"score": 0.0027223626424366207, "phrase": "different_scenarios"}, {"score": 0.00250732953434891, "phrase": "computational_complexity"}, {"score": 0.0023694065215394593, "phrase": "optimal_solution"}, {"score": 0.0022856052476424344, "phrase": "upper_bound"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Single machine", " Two agents", " Deteriorating jobs"], "paper_abstract": "We consider several two-agent single-machine scheduling problems with deteriorating jobs. By deteriorating jobs we mean that the actual processing time of any job of the two agents is an increasing linear function of its starting time. Each agent wants to minimize a certain objective function, which depends on the completion times of its jobs only. The goal is to schedule the jobs such that the performance of the schedule is satisfactory with respect to the objective functions of both agents. We consider six scheduling problems associated with different combinations of the two agents' objective functions, which include the maximum cost, total weighted completion time, discounted total weighted completion time, maximum earliness cost, total earliness, and total weighted earliness. We examine different scenarios depending on the trade-off between the two agents. Under each scenario, we address the computational complexity and solvability issues of various problems that seek to find the optimal solution for one agent, subject to an upper bound on the maximum (earliness) cost of the other agent. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Two-agent single-machine scheduling with deteriorating jobs", "paper_id": "WOS:000350778100017"}