{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "abelian_periods"}, {"score": 0.0047464608267006395, "phrase": "string_in_quadratic_time_and_relevant_problems._abelian_periodicity"}, {"score": 0.0044820646535905445, "phrase": "constantinescu"}, {"score": 0.004376273644295806, "phrase": "abelian_period"}, {"score": 0.003939565240409143, "phrase": "classical_period"}, {"score": 0.003632080001489739, "phrase": "internal_permutation"}, {"score": 0.0033645655483989746, "phrase": "string_y."}, {"score": 0.003332537728389913, "phrase": "first_one_maps"}, {"score": 0.003253791343615811, "phrase": "suitable_number"}, {"score": 0.00305762327908599, "phrase": "unique_sum"}, {"score": 0.00276534038425712, "phrase": "prime_number"}, {"score": 0.002598543802992702, "phrase": "unique_product"}, {"score": 0.0023840346303791032, "phrase": "weak_abelian_periods"}], "paper_keywords": ["Strings", " algorithms", " abelian periods"], "paper_abstract": "Abelian periodicity of strings has been studied extensively over the last years. In 2006 Constantinescu and The defined the abelian period of a string and several algorithms for the computation of all abelian periods of a string were given. In contrast to the classical period of a word, its abelian version is more flexible, factors of the word are considered the same under any internal permutation of their letters. We show two O(vertical bar y vertical bar(2)) algorithms for the computation of all abelian periods of a string y. The first one maps each letter to a suitable number such that each factor of the string can be identified by the unique sum of the numbers corresponding to its letters and hence abelian periods can be identified easily. The other one maps each letter to a prime number such that each factor of the string can be identified by the unique product of the numbers corresponding to its letters and so abelian periods can be identified easily. We also define weak abelian periods on strings and give an O(vertical bar y vertical bar log(vertical bar y vertical bar)) algorithm for their computation, together with some other algorithms for more basic problems.", "paper_title": "IDENTIFYING ALL ABELIAN PERIODS OF A STRING IN QUADRATIC TIME AND RELEVANT PROBLEMS", "paper_id": "WOS:000311560300012"}