{"auto_keywords": [{"score": 0.04805212023869437, "phrase": "spain"}, {"score": 0.01491853651647037, "phrase": "simulation_techniques"}, {"score": 0.009713391326691028, "phrase": "esl"}, {"score": 0.00481495049065317, "phrase": "microsimulation_techniques"}, {"score": 0.004746065479362881, "phrase": "monetary_costs"}, {"score": 0.004188702178897384, "phrase": "future_behaviour"}, {"score": 0.004050116768809519, "phrase": "public_economy"}, {"score": 0.0038415095105632157, "phrase": "increasing_interest"}, {"score": 0.0036611708297251645, "phrase": "different_public_policies"}, {"score": 0.003325410433297401, "phrase": "empirical_evidence"}, {"score": 0.003293570937654716, "phrase": "simulation_literature"}, {"score": 0.0029914213495838998, "phrase": "early_school_leaving"}, {"score": 0.0029203055813347874, "phrase": "spain's_esl_rate"}, {"score": 0.002810103522641227, "phrase": "eu"}, {"score": 0.00247944491239733, "phrase": "behavioural_microsimulation_model"}], "paper_keywords": ["education", " econometrics", " public expenditure", " statistics", " behaviour"], "paper_abstract": "Simulation techniques are nowadays widely applied in many areas of knowledge, as a means to provide tools for predicting future behaviour and reactions. In the last few years, public economy is one of the areas where there has been an increasing interest in simulation techniques in order to evaluate the achievement of different public policies, though these techniques are not as developed as in other subject areas. In this context, this paper provides empirical evidence for simulation literature, addressing two main aspects: first, an extended and alarming problem in Spain, the monetary costs associated with early school leaving (ESL) (Spain's ESL rate is one of the highest in the EU); and, second, a not very common methodology to investigate this phenomenon: micro-simulation techniques. More specifically, a behavioural microsimulation model is proposed in order to study the effects on employment and wages of eradicating ESL in Spain over a 20-year time horizon. Our results, under various scenarios, indicate that an increase in GDP of between 4 and 17% could be achieved.", "paper_title": "Too much to pay: an estimation through microsimulation techniques of the monetary costs of early school leaving in Spain", "paper_id": "WOS:000343956200008"}