{"auto_keywords": [{"score": 0.048566997341190736, "phrase": "quantized_measurements"}, {"score": 0.012735152392130626, "phrase": "target_tracking"}, {"score": 0.007367012962053228, "phrase": "uwsns"}, {"score": 0.0071635717766461585, "phrase": "underwater_nodes"}, {"score": 0.00481495049065317, "phrase": "node_topology_effect"}, {"score": 0.004628880101492352, "phrase": "pcrlb"}, {"score": 0.004425979295788883, "phrase": "underwater_wireless_sensor_networks"}, {"score": 0.0034647524666821614, "phrase": "node_topology"}, {"score": 0.0027446057983474994, "phrase": "regular_triangle"}, {"score": 0.0025944417620244924, "phrase": "posterior_cramer-rao"}, {"score": 0.0025224615049571427, "phrase": "node's_position"}, {"score": 0.0024623517958288228, "phrase": "arbitrary_topology"}, {"score": 0.002384422461262006, "phrase": "optimal_topology_selection_scheme"}, {"score": 0.0022630008787375435, "phrase": "energy_consumption"}, {"score": 0.0022268964676199292, "phrase": "multisensor_particle_filter"}, {"score": 0.002156402793481102, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_scheme"}], "paper_keywords": ["Node topology", " posterior Cramer-Rao lower bound (PCRLB)", " quantized measurements", " target tracking", " underwater wireless sensor networks (UWSNs)"], "paper_abstract": "On one hand, due to the energy and bandwidth constraint of underwater wireless sensor networks (UWSNs), local data quantization/compression is not only a necessity, but also an integral part of the design of UWSNs; on the other hand, since underwater nodes provide measurements for target tracking based on UWSNs, node topology, which is made up of the underwater nodes, may affect the performance of target tracking. This paper studies the effect of node topology on the target tracking in UWSNs using quantized measurements. Firstly, by using the knowledge of geometry, the effects of four typical topologies on target tracking using quantized measurements are analyzed qualitatively. The four typical topologies include two nodes are close to each other, three nodes are close to each other, three nodes are co-linear, and three nodes form a regular triangle. Secondly, under the condition of quantized measurements, the relationship between the posterior Cramer-Rao lower bound (PCRLB) and node's position is derived to evaluate the arbitrary topology. Thirdly, our target tracking scheme consisting of the optimal topology selection scheme by minimizing PCRLB, the optimal fusion center selection scheme by minimizing energy consumption, and the multisensor particle filter with quantized measurements is designed. Last, simulation results show the effectiveness of the proposed scheme.", "paper_title": "Node Topology Effect on Target Tracking Based on UWSNs Using Quantized Measurements", "paper_id": "WOS:000361751900026"}