{"auto_keywords": [{"score": 0.04946824888397643, "phrase": "information_science"}, {"score": 0.015067887427285617, "phrase": "french_conception"}, {"score": 0.004814989640898546, "phrase": "french"}, {"score": 0.004234532601573088, "phrase": "shannon's_mathematical_theory"}, {"score": 0.0036605323485683983, "phrase": "similar_conceptions"}, {"score": 0.0035676056286816915, "phrase": "similar_theoretical_foundations"}, {"score": 0.0034919649825540396, "phrase": "socio-constructivist_theory"}, {"score": 0.003331134183901191, "phrase": "dual_nature"}, {"score": 0.002904040426340639, "phrase": "geographic_and_cultural_zones"}, {"score": 0.0027702126237754625, "phrase": "computer_science"}, {"score": 0.0026312238938540787, "phrase": "anglophone_information_science"}, {"score": 0.002404522326122611, "phrase": "converging_analyses"}, {"score": 0.0023434058350520763, "phrase": "linguistic_and_geographical_regions"}, {"score": 0.002274059352027924, "phrase": "better_understanding"}, {"score": 0.0021049977753042253, "phrase": "global_information_science_community"}], "paper_keywords": ["information science", " information science history"], "paper_abstract": "The French conception of information science is often contrasted with the Anglophone one, which is perceived as different and rooted mainly in Shannon's mathematical theory of communication. While there is such a thing as a French conception of information science, this conception is not totally divorced from the Anglophone one. Unbeknownst to researchers from the two geographical and cultural regions, they share similar conceptions of the field and invoke similar theoretical foundations, in particular the socio-constructivist theory. There is also a convergence of viewpoints on the dual nature of information science, i.e., the fact that it is torn between two competing paradigmsobjectivist and subjectivist. Technology is another area where a convergence of viewpoints is noticeable: Scholars from both geographic and cultural zones display the same suspicion toward the role of technology and of computer science. It would therefore be misleading to uphold the view that Anglophone information science is essentially objectivist and technicist while the French conception is essentially social and rooted in the humanities. This paper highlights converging analyses from authors based in both linguistic and geographical regions with the aim to foster a better understanding of the challenges that information science is facing worldwide and to help trace a path to how the global information science community can try to meet them.", "paper_title": "The French conception of information science: \"Une exception francaise\"?", "paper_id": "WOS:000307730000001"}