{"auto_keywords": [{"score": 0.040838917851158764, "phrase": "architecture_model"}, {"score": 0.00481495049065317, "phrase": "model-driven_design"}, {"score": 0.004642604455537883, "phrase": "design_model"}, {"score": 0.004382196270563035, "phrase": "multiprocessor_systems"}, {"score": 0.004263972370406983, "phrase": "chip_or_off-chip_high-speed_cross-bar_switches"}, {"score": 0.004123781267600542, "phrase": "new_systematic_model-driven_flow"}, {"score": 0.004073948834684065, "phrase": "new_scalable_multi-facet_arbiters"}, {"score": 0.003976076057473637, "phrase": "template-based_modular_design_approach"}, {"score": 0.0039280214778273925, "phrase": "design_model_derivation_phase"}, {"score": 0.0035855828944304506, "phrase": "design_flow"}, {"score": 0.003520751317164754, "phrase": "arbiter_design_model"}, {"score": 0.0034781805438547017, "phrase": "careful_analysis"}, {"score": 0.0034570879043633114, "phrase": "arbiter_design_issues"}, {"score": 0.0034361227353612456, "phrase": "systematic_design_space"}, {"score": 0.003089080923888397, "phrase": "architecture_models"}, {"score": 0.0029512611306191194, "phrase": "different_but_better_arbiters"}, {"score": 0.0028715299874549245, "phrase": "scalable_decentralized_parallel_tree_structure"}, {"score": 0.0028195727965553367, "phrase": "efficient_arbiter_hardware_implementation"}, {"score": 0.0027685531038981847, "phrase": "final_phase"}, {"score": 0.0026937446571204653, "phrase": "modular_and_reusable_hardware_implementation_structure"}, {"score": 0.0026050445177883005, "phrase": "parametric_arbiter_generator"}, {"score": 0.0025423706961391034, "phrase": "hardware_implementation_design"}, {"score": 0.0021767087933168717, "phrase": "first_time"}], "paper_keywords": ["Architecture model", " architecture template", " decentralized parallel tree", " design model", " design space", " generator", " model-driven design flow", " multi-facet arbiter"], "paper_abstract": "Designing of arbiters has become increasingly important due to their wide use in the areas such as multiprocessor systems-on-a-chip and on-chip or off-chip high-speed cross-bar switches and networks. In this paper, we proposed a new systematic model-driven flow for designing the new scalable multi-facet arbiters through a 3-phase process combined with the template-based modular design approach that includes the design model derivation phase, the architecture model (or template) design phase as well as the arbiter hardware implementation and generation phase. First, we described the phase 1 of the design flow of how to induce an arbiter design model in detail by careful analysis of arbiter design issues and systematic design space exploring the construction of the model. Then, we continue to discuss the phase 2 of how to derive an architecture model or template using the reusability, modularity and expansibility techniques. With both the design and the architecture models, designers can easily design or at least understand and thus choose many kinds of different but better arbiters efficiently. Finally, we have developed a scalable decentralized parallel tree structure and corresponding modular algorithms for efficient arbiter hardware implementation, which also is the final phase of our proposed 3-phase model-driven design flow. Moreover, based on this modular and reusable hardware implementation structure as well as the algorithms, we have designed a parametric arbiter generator that automatically generates various multi-facet arbiters. Using this hardware implementation design and the generator, not only a fast and small round-robin arbiter but also other type arbiters were designed and generated on the fly. The hardware implementation algorithms, the generator, and the experiment results all were given to verify their performances. To our knowledge, this is the first time that such a systematic model-driven design approach is proposed in the practical hardware design and such a multi-facet arbiter is designed.", "paper_title": "Model-Driven Design and Generation of New Multi-Facet Arbiters: From the Design Model to the Hardware Synthesis", "paper_id": "WOS:000293709000009"}