{"auto_keywords": [{"score": 0.04896221231267544, "phrase": "new_malwares"}, {"score": 0.027065515534290523, "phrase": "anti-virus_vendors"}, {"score": 0.00884162095225992, "phrase": "existing_al_method"}, {"score": 0.004976394836648013, "phrase": "random_selection"}, {"score": 0.00481495049065317, "phrase": "novel_active_learning_methods"}, {"score": 0.004789760466836797, "phrase": "enhanced_pc_malware_detection"}, {"score": 0.004641351004344458, "phrase": "significant_challenge"}, {"score": 0.004544963224988473, "phrase": "manually_crafted_signatures"}, {"score": 0.0044622600011936095, "phrase": "known_malware_instances"}, {"score": 0.004392565073466714, "phrase": "new_and_unknown_malwares"}, {"score": 0.004167982855788402, "phrase": "information_security_experts"}, {"score": 0.00404937519538515, "phrase": "suspected_files"}, {"score": 0.0040176151419992956, "phrase": "time-consuming_task"}, {"score": 0.003732898113268911, "phrase": "suspect_files"}, {"score": 0.0035981701736904495, "phrase": "essential_element"}, {"score": 0.003432044343307207, "phrase": "updatability_gap"}, {"score": 0.003387270217282478, "phrase": "active_learning"}, {"score": 0.0031636612155559267, "phrase": "new_al_methods"}, {"score": 0.0031141853323221414, "phrase": "new_malware_acquisition"}, {"score": 0.0029938442475631946, "phrase": "unknown_files"}, {"score": 0.0029162040199773027, "phrase": "ten-day_period"}, {"score": 0.0028630535573013686, "phrase": "existing_high_performance_al_methods"}, {"score": 0.0027961342030212353, "phrase": "naive_method"}, {"score": 0.0027596331277401766, "phrase": "al_methods"}, {"score": 0.002723607240517261, "phrase": "performance_measures"}, {"score": 0.002236239369521732, "phrase": "daily_improvement"}, {"score": 0.0021667778225942227, "phrase": "increased_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Malware", " Malicious code", " Machine Learning", " Active learning", " SVM"], "paper_abstract": "The formation of new malwares every day poses a significant challenge to anti-virus vendors since antivirus tools, using manually crafted signatures, are only capable of identifying known malware instances and their relatively similar variants. To identify new and unknown malwares for updating their anti-virus signature repository, anti-virus vendors must daily collect new, suspicious files that need to be analyzed manually by information security experts who then label them as malware or benign. Analyzing suspected files is a time-consuming task and it is impossible to manually analyze all of them. Consequently, anti-virus vendors use machine learning algorithms and heuristics in order to reduce the number of suspect files that must be inspected manually. These techniques, however, lack an essential element - they cannot be daily updated. In this work we introduce a solution for this updatability gap. We present an active learning (AL) framework and introduce two new AL methods that will assist anti-virus vendors to focus their analytical efforts by acquiring those files that are most probably malicious. Those new AL methods are designed and oriented towards new malware acquisition. To test the capability of our methods for acquiring new malwares from a stream of unknown files, we conducted a series of experiments over a ten-day period. A comparison of our methods to existing high performance AL methods and to random selection, which is the naive method, indicates that the AL methods outperformed random selection for all performance measures. Our AL methods outperformed existing AL method in two respects, both related to the number of new malwares acquired daily, the core measure in this study. First, our best performing AL method, termed \"Exploitation\", acquired on the 9th day of the experiment about 2.6 times more malwares than the existing AL method and 7.8 more times than the random selection. Secondly, while the existing AL method showed a decrease in the number of new malwares acquired over 10 days, our AL methods showed an increase and a daily improvement in the number of new malwares acquired. Both results point towards increased efficiency that can possibly assist anti-virus vendors. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Novel active learning methods for enhanced PC malware detection in windows OS", "paper_id": "WOS:000336872300016"}