{"auto_keywords": [{"score": 0.031185443736095782, "phrase": "two-factors_second-order_fuzzy-trend"}, {"score": 0.018759240356348305, "phrase": "proposed_method"}, {"score": 0.00481495049065317, "phrase": "fuzzy_forecasting_based"}, {"score": 0.004769702911065878, "phrase": "two-factors_second-order_fuzzy-trend_logical_relationship_groups"}, {"score": 0.00438105507792004, "phrase": "new_method"}, {"score": 0.004339867166576126, "phrase": "fuzzy_forecasting"}, {"score": 0.003967314311312148, "phrase": "fuzzy-trend_logical_relationships"}, {"score": 0.003820144626025562, "phrase": "historical_training_data"}, {"score": 0.003766369160795001, "phrase": "main_factor"}, {"score": 0.0037133478610481994, "phrase": "secondary_factor"}, {"score": 0.003678414118674967, "phrase": "fuzzy_sets"}, {"score": 0.0033624514778823763, "phrase": "obtained_two-factors_second-order_fuzzy_logical_relationships_into_two-factors_second-order_fuzzy-trend"}, {"score": 0.002270604636015939, "phrase": "taiex"}, {"score": 0.002175913488493802, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["Fuzzy forecasting", " fuzzy logical relationships", " fuzzy time series", " fuzzy-trend logical relationship groups", " probabilities of trends"], "paper_abstract": "In this paper, we present a new method for fuzzy forecasting based on two-factors second-order fuzzy-trend logical relationship groups and the probabilities of trends of fuzzy-trend logical relationships. Firstly, the proposed method fuzzifies the historical training data of the main factor and the secondary factor into fuzzy sets, respectively, to form two-factors second-order fuzzy logical relationships. Then, it groups the obtained two-factors second-order fuzzy logical relationships into two-factors second-order fuzzy-trend logical relationship groups. Then, it calculates the probability of the \"down-trend,\" the probability of the \"equal-trend\" and the probability of the \"up-trend\" of the two-factors second-order fuzzy-trend logical relationships in each two-factors second-order fuzzy-trend logical relationship group, respectively. Finally, it performs the forecasting based on the probabilities of the down-trend, the equal-trend, and the up-trend of the two-factors second-order fuzzy-trend logical relationships in each two-factors second-order fuzzy-trend logical relationship group. We also apply the proposed method to forecast the Taiwan Stock Exchange Capitalization Weighted Stock Index (TAIEX) and the NTD/USD exchange rates. The experimental results show that the proposed method outperforms the existing methods.", "paper_title": "Fuzzy Forecasting Based on Two-Factors Second-Order Fuzzy-Trend Logical Relationship Groups and the Probabilities of Trends of Fuzzy Logical Relationships", "paper_id": "WOS:000350146900005"}