{"auto_keywords": [{"score": 0.04520816487989674, "phrase": "parallel_computations"}, {"score": 0.0439602210203305, "phrase": "mutable_references"}, {"score": 0.00481495049065317, "phrase": "channel_locality"}, {"score": 0.004476399615305783, "phrase": "higher-order_channels"}, {"score": 0.004411588377842043, "phrase": "advanced_form"}, {"score": 0.00436890075128947, "phrase": "task_parallelism"}, {"score": 0.004061584718427419, "phrase": "safety_problem"}, {"score": 0.003925633992809873, "phrase": "remote_threads"}, {"score": 0.0037030390595465673, "phrase": "ml-like_parallel_language"}, {"score": 0.0036671822784770463, "phrase": "type-safe_higher-order_channels"}, {"score": 0.0030628762739398855, "phrase": "type_system"}, {"score": 0.003018468582368033, "phrase": "typing_judgment"}, {"score": 0.002608218347502229, "phrase": "desirable_feature"}, {"score": 0.0024481856932959227, "phrase": "unique_thread"}, {"score": 0.002297949552105756, "phrase": "sequential_computations"}, {"score": 0.0021049977753042253, "phrase": "sequential_programming"}], "paper_keywords": [""], "paper_abstract": "As a means of transmitting not only data but also code encapsulated within functions, higher-order channels provide an advanced form of task parallelism in parallel computations. In the presence of mutable references, however, they pose a safety problem because references may be transmitted to remote threads where they are no longer valid. This paper presents an ML-like parallel language with type-safe higher-order channels. By type safety, we mean that no value written to a channel contains references, or equivalently, that no reference escapes via a channel from the thread where it is created. The type system uses a typing judgment that is capable of deciding whether the value to which a term evaluates contains references or not. The use of such a typing judgment also makes it easy to achieve another desirable feature of channels, channel locality, that associates every channel with a unique thread for serving all values addressed to it. Our type system permits Mutable references in sequential computations and also ensures that mutable references never interfere with parallel computations. Thus, it provides both flexibility in sequential programming and ease of implementing parallel computations.", "paper_title": "Type-safe higher-order channels with channel locality", "paper_id": "WOS:000262322500006"}