{"auto_keywords": [{"score": 0.04586846484671967, "phrase": "ses"}, {"score": 0.00481495049065317, "phrase": "children's_emergent_literacy"}, {"score": 0.0047709540557306284, "phrase": "low_versus_middle_ses_groups"}, {"score": 0.004641351004344458, "phrase": "educational_electronic_book"}, {"score": 0.003970439654470374, "phrase": "ses_group"}, {"score": 0.0033037970113095577, "phrase": "fourth_group"}, {"score": 0.0031845067058084583, "phrase": "regular_program"}, {"score": 0.0031121406603482112, "phrase": "pre-_and_post-intervention_emergent_literacy_measures"}, {"score": 0.002985988377995789, "phrase": "phonological_awareness"}, {"score": 0.00283870598459543, "phrase": "middle_and_low_ses"}, {"score": 0.002786964045867666, "phrase": "educational_e-book_activity"}, {"score": 0.002686284749214443, "phrase": "lses_children's_emergent_literacy_levels"}, {"score": 0.0025537472239953807, "phrase": "mses_children"}, {"score": 0.002361632539339945, "phrase": "activity_modes"}, {"score": 0.002255431275670053, "phrase": "\"read_story"}, {"score": 0.002183938718432764, "phrase": "future_research"}], "paper_keywords": ["electronic book", " emergent literacy", " SES", " kindergarteners"], "paper_abstract": "The effects of an educational electronic book (e-book) on 149 five-to six-year-old kindergarteners' emergent literacy levels were researched in two SES groups: low (LSES) (79 children) vs. middle (MSES) (70 children). In each SES group, children were randomly assigned to four groups. Three groups were assigned to work individually in one of three e-book activity modes: \"Read story only\", \"Read with dictionary\", or \"Read and play\" during three similar activity sessions and the fourth group served as a control which received the regular program of the kindergarten. Pre- and post-intervention emergent literacy measures included word meaning, word recognition, and phonological awareness. Results show that word meaning of children from both middle and low SES improved following the educational e-book activity, regardless of mode. Second, LSES children's emergent literacy levels showed relatively greater improvement rates than did those of the MSES children. Third, children in the \"Read with dictionary\" and \"Read and play\" activity modes showed more improvement in their emergent literacy levels than did those in the \"Read story only\" mode. Implications for future research and for education are discussed. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "The educational electronic book as a tool for supporting children's emergent literacy in low versus middle SES groups", "paper_id": "WOS:000250796900008"}