{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multimode_user-centric"}, {"score": 0.004758188582347737, "phrase": "wireless_sensor_networks"}, {"score": 0.004720717782144015, "phrase": "long-term_monitoring"}, {"score": 0.00425951071471662, "phrase": "network_performance"}, {"score": 0.004159617445102161, "phrase": "sensing_and_reliable_data_delivery"}, {"score": 0.003812896124654341, "phrase": "underlying_heavy_burden"}, {"score": 0.0033860360186761533, "phrase": "user_operation"}, {"score": 0.003319675107116333, "phrase": "users'_burden"}, {"score": 0.0027450280220853137, "phrase": "runtime_interference"}, {"score": 0.002576442680766742, "phrase": "sensor_platform"}, {"score": 0.002546002312015341, "phrase": "long-lived_microclimate_monitoring_system"}, {"score": 0.0025059724686541263, "phrase": "wildland_heritage_site"}, {"score": 0.002486193594641237, "phrase": "mogao_grottoes"}, {"score": 0.002207530926563892, "phrase": "network_deployment"}, {"score": 0.002155656133617155, "phrase": "network_maintenance"}, {"score": 0.0021301766910531137, "phrase": "field_experts"}], "paper_keywords": ["Design", " Experimentation", " Human Factors", " Performance", " Wireless sensor networks", " user-centric design", " MC2 framework"], "paper_abstract": "Real-world, long-running wireless sensor networks (WSNs) require intense user intervention in the development, hardware testing, deployment, and maintenance stages. A majority of network design is network centric and focuses primarily on network performance, for example, efficient sensing and reliable data delivery. Although several tools have been developed to assist debugging and fault diagnosis, it is yet to systematically examine the underlying heavy burden that users face throughout the lifetime of WSNs. In this article, we propose a general Multimode user-CentriC (MC2) framework that can, with simple user inputs, adjust itself to assist user operation and thus reduce the users' burden at various stages. In particular, we have identified utilities that are essential at each stage and grouped them into modes. In each mode, only the corresponding utilities will be loaded, and modes can be easily switched using the customized MC2 sensor platform. As such, we reduce the runtime interference between various utilities and simplify their development as well as their debugging. We validated our MC2 software and the sensor platform in a long-lived microclimate monitoring system deployed at a wildland heritage site, Mogao Grottoes. In our current system, 241 sensor nodes have been deployed in 57 caves, and the network has been running for over five years. Our experimental validation shows that the MC2 framework shortens the time for network deployment and maintenance, and makes network maintenance doable by field experts (in our case, historians).", "paper_title": "MC2: Multimode User-Centric Design of Wireless Sensor Networks for Long-Term Monitoring", "paper_id": "WOS:000337804100015"}