{"auto_keywords": [{"score": 0.04260087512471619, "phrase": "quorum_system"}, {"score": 0.015448758509906445, "phrase": "wireless_sensor_networks"}, {"score": 0.013487353526655416, "phrase": "key_matrix"}, {"score": 0.011447732769538588, "phrase": "shared_key"}, {"score": 0.010977824488541742, "phrase": "common_key"}, {"score": 0.00944542574098924, "phrase": "kds"}, {"score": 0.0074696362985526114, "phrase": "group_key"}, {"score": 0.004814965865863829, "phrase": "quorum"}, {"score": 0.004764435715755502, "phrase": "key_management_scheme"}, {"score": 0.004487989502479992, "phrase": "robust_key_management_scheme"}, {"score": 0.0043481611772332495, "phrase": "quorum-based_key_management_scheme"}, {"score": 0.004227515355865597, "phrase": "key_distribution_server"}, {"score": 0.003940286428597882, "phrase": "set_system"}, {"score": 0.0028201570908224166, "phrase": "joining_sensor_id."}, {"score": 0.0027806988302728633, "phrase": "broadcast_message"}, {"score": 0.002555247330102505, "phrase": "key_update_process"}, {"score": 0.0024236964502593254, "phrase": "multiple_sensors"}, {"score": 0.0023729878025466836, "phrase": "secure_group_communication"}, {"score": 0.002298902547676131, "phrase": "partial_information"}, {"score": 0.002134888329742086, "phrase": "secret_sharing_technique"}], "paper_keywords": ["Wireless sensor network", " key management", " quorum", " group key"], "paper_abstract": "To ensure the security of wireless sensor networks, it is important to have a robust key management scheme. In this paper, we propose a Quorum-based key management scheme. A specific sensor, called as key distribution server (KDS), generates a key matrix and establishes a quorum system from the key matrix. The quorum system is a set system of subsets that the intersection of any two subsets is non-empty. In our scheme, each sensor is assigned a subset of the quorum system as its pre-distributed keys. Whenever any two sensors need a shared key, they exchange their IDs, and then each sensor by itself finds a common key from its assigned subset. A shared key is then generated by the two sensors individually based on the common key. By our scheme, no key is needed to be refreshed as a sensor leaves the network. Upon a sensor joining the network, the KDS broadcasts a message containing the joining sensor ID. After receiving the broadcast message, each sensor updates the key which is in common with the new joining one. Only XOR and hash operations are required to be executed during key update process, and each sensor needs to update one key only. Furthermore, if multiple sensors would like to have a secure group communication, the KDS broadcasts a message containing the partial information of a group key, and then each sensor in the group by itself is able to restore the group key by using the secret sharing technique without cooperating with other sensors in the group.", "paper_title": "Quorum-based Key Management Scheme in Wireless Sensor Networks", "paper_id": "WOS:000310982100027"}