{"auto_keywords": [{"score": 0.04622434726748134, "phrase": "mobius_reparameterization"}, {"score": 0.0216292419957259, "phrase": "affine_transformations"}, {"score": 0.010495245158238842, "phrase": "rational_bezier"}, {"score": 0.00481495049065317, "phrase": "blind_digital_watermarking"}, {"score": 0.004306205029641728, "phrase": "blind_watermarking_scheme"}, {"score": 0.004211069233133584, "phrase": "b-spline_curves"}, {"score": 0.0037658881407605445, "phrase": "geometric_modeling_operations"}, {"score": 0.003724034990158436, "phrase": "cad_systems"}, {"score": 0.0036214184763804034, "phrase": "watermark_polynomial"}, {"score": 0.0035811651542886746, "phrase": "real_coefficients"}, {"score": 0.003149094460617212, "phrase": "original_curve"}, {"score": 0.002895721231882758, "phrase": "subsequent_affine_transformations"}, {"score": 0.0023151088048303705, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Digital watermarking", " Rational Bezier curves and surfaces", " Rational B-spline curves and surfaces", " Cross-ratio"], "paper_abstract": "We present a blind watermarking scheme for rational Bezier and B-spline curves and surfaces which is shape-preserving and robust against the affine transformations and Mobius reparameterization that are commonly used in geometric modeling operations in CAD systems. We construct a watermark polynomial with real coefficients of degree four which has the watermark as the cross-ratio of its complex roots. We then multiply the numerator and denominator of the original curve or surface by this polynomial, increasing its degree by four but preserving its shape. Subsequent affine transformations and Mobius reparameterization leave the cross-ratio of these roots unchanged. The watermark can be extracted by finding all the roots of the numerator and denominator of the curve or surface: the cross-ratio of the four common roots will be the watermark. Experimental results confirm both the shape-preserving property and its robustness against attacks by affine transformations and Mobius reparameterization. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Blind digital watermarking of rational Bezier and B-spline curves and surfaces with robustness against affine transformations and Mobius reparameterization", "paper_id": "WOS:000291337300007"}