{"auto_keywords": [{"score": 0.048865388205435026, "phrase": "significant_differences"}, {"score": 0.010318524742126144, "phrase": "stress_response"}, {"score": 0.0092186722447375, "phrase": "distance_estimation_accuracy"}, {"score": 0.008891877730881412, "phrase": "personality_measures"}, {"score": 0.00481495049065317, "phrase": "physiological_response"}, {"score": 0.004749943032800224, "phrase": "immersive_virtual_environments"}, {"score": 0.00472846857843889, "phrase": "previous_work"}, {"score": 0.004636523669192239, "phrase": "initial_spatial_judgments"}, {"score": 0.004622537121967155, "phrase": "different_types"}, {"score": 0.004580862984871352, "phrase": "phillips"}, {"score": 0.0045670096506304336, "phrase": "interrante"}, {"score": 0.00455323184029986, "phrase": "kaeding"}, {"score": 0.004371231242220018, "phrase": "photorealistic_replica"}, {"score": 0.004351461454901626, "phrase": "real_place"}, {"score": 0.004183810181472331, "phrase": "distance_perception_accuracy"}, {"score": 0.004171183567784957, "phrase": "individual_participants"}, {"score": 0.003992305364645059, "phrase": "virtual_environment"}, {"score": 0.0038268498626854264, "phrase": "well-defined_tasks"}, {"score": 0.003809532730956554, "phrase": "delimited_path"}, {"score": 0.0037808441490764406, "phrase": "control_version"}, {"score": 0.003729746009849634, "phrase": "stressful_variant"}, {"score": 0.003690479168330654, "phrase": "marked_path"}, {"score": 0.0036296046589482478, "phrase": "participants'_sense"}, {"score": 0.003585961656498363, "phrase": "diverse_set"}, {"score": 0.0035321425082328207, "phrase": "heart_rate"}, {"score": 0.0035214756532133806, "phrase": "galvanic_skin_response"}, {"score": 0.0034113934750826425, "phrase": "stressful_and_nonstressful_versions"}, {"score": 0.003334869466546008, "phrase": "different_virtual_environment_conditions"}, {"score": 0.003264991493865837, "phrase": "significant_physiological_indications"}, {"score": 0.0031343219691028416, "phrase": "different_virtual_environment_locales"}, {"score": 0.0030966158238468484, "phrase": "significant_difference"}, {"score": 0.0030732794674638766, "phrase": "subjective_presence"}, {"score": 0.0029907109224534853, "phrase": "photorealistic_replica_room"}, {"score": 0.0029771661505315202, "phrase": "significantly_greater_reduction"}, {"score": 0.0029681702980040316, "phrase": "stride_speed"}, {"score": 0.002959201546810185, "phrase": "stride_length"}, {"score": 0.002936897705138857, "phrase": "pit_version"}, {"score": 0.0028193218114103366, "phrase": "potential_correlations"}, {"score": 0.0027518744469275298, "phrase": "different_immersive_virtual_environment_conditions"}, {"score": 0.0027352655528108992, "phrase": "pretest_questionnaires"}, {"score": 0.0026496951400111187, "phrase": "photorealistic_non-replica_environment"}, {"score": 0.0026138451561714066, "phrase": "ive"}, {"score": 0.002598066391801921, "phrase": "control_trials"}, {"score": 0.0025167773038441464, "phrase": "physiological_measures"}, {"score": 0.002452833848265094, "phrase": "neutral_and_pit-enhanced_versions"}, {"score": 0.0024050316508707967, "phrase": "brief_presence_questionnaire"}, {"score": 0.002358158847172148, "phrase": "significantly_greater_distance_estimation_errors"}, {"score": 0.002347472125014595, "phrase": "unfamiliar_room_environment"}, {"score": 0.0023332982838849183, "phrase": "replica_room_environment"}, {"score": 0.0022878203196446214, "phrase": "significant_positive_correlation"}, {"score": 0.002243226766476785, "phrase": "notable_significant_correlations"}, {"score": 0.0021049977753042253, "phrase": "existing_measures"}], "paper_keywords": [""], "paper_abstract": "In previous work, we have found significant differences in the accuracy with which people make initial spatial judgments in different types of head-mounted, display-based immersive virtual environments (IVEs; Phillips, Interrante, Kaeding, Ries, & Anderson, 2010). In particular, we have found that people tend to less severely underestimate egocentric distances in a virtual environment that is a photorealistic replica of a real place that they have recently visited than when the virtual environment is either a photorealistic replica of an unfamiliar place, or a nonphotorealistically (NPR) portrayed version of a familiar space. We have also noted significant differences in the effect of environment type on distance perception accuracy between individual participants. In this paper, we report the results of two experiments that seek further insight into these phenomena, focusing on factors related to depth of presence in the virtual environment. In our reported first experiment, we immersed users (between-subjects) in one of the three different types of IVEs and asked them to perform a series of well-defined tasks along a delimited path, first in a control version of the environment, and then in a stressful variant in which the floor around the marked path was cut away to reveal a 20-ft drop. We assessed participants' sense of presence during each trial using a diverse set of measures, including: questionnaires, recordings of heart rate and galvanic skin response, and gait metrics derived from tracking data. We computed the differences in each of these measures between the stressful and nonstressful versions of each environment, and then compared the changes due to stress between the different virtual environment conditions. Pooling the data over all participants in each group, we found significant physiological indications of stress after the appearance of the pit in all three environments, but we did not find significant differences in the magnitude of the stress response between the different virtual environment locales. We also did not find any significant difference in the level of subjective presence reported in each environment. However, we did find significant differences in gait: participants in the photorealistic replica room showed a significantly greater reduction in stride speed and stride length between the control and pit version of the room than did participants in either the photorealistically rendered nonreplica environment or the NPR replica environment conditions. Our second experiment, conducted with a new set of participants, sought to more directly investigate potential correlations between distance estimation accuracy and personality, stress response, and reported sense of presence, comparatively across different immersive virtual environment conditions. We used pretest questionnaires to assess a variety of personality measures, and then randomly immersed participants (between-subjects) in either the photorealistic replica or photorealistic non-replica environment and assessed the accuracy of their egocentric distance judgments in that IVE, followed by control trials in a neutral, real-world location. We then had participants go through the same set of tasks as in our first experiment while we collected physiological measures of their stress level and tracked their gait, and we compared the changes in these measures between the neutral and pit-enhanced versions of the environment. Finally, we had people fill out a brief presence questionnaire. Analyzing all of these data, we found that participants made significantly greater distance estimation errors in the unfamiliar room environment than in the replica room environment, but no other differences between the two environments were significant. We found significant positive correlation between several of the personality measures, but we did not find any notable significant correlations between personality and presence, or between either personality or presence and gait changes or distance estimation accuracy. These results suggest to us that the relationship between personality, presence, and performance in IVEs is complicated and not easily captured by existing measures.", "paper_title": "Correlations Between Physiological Response, Gait, Personality, and Presence in Immersive Virtual Environments", "paper_id": "WOS:000305913300001"}