{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "different_fuzzy_operators"}, {"score": 0.04959024199151092, "phrase": "fuzzy_bi-objective_cell_loading_problem"}, {"score": 0.003921129887153952, "phrase": "proposed_mathematical_model"}, {"score": 0.003861175855298779, "phrase": "problem_arc"}, {"score": 0.00374399358035391, "phrase": "tardy_jobs"}, {"score": 0.0036490529923833884, "phrase": "total_manpower"}, {"score": 0.003574830654211291, "phrase": "mathematical_model"}, {"score": 0.0033957904376127187, "phrase": "cell_size"}, {"score": 0.003343841875107018, "phrase": "opened_cell"}, {"score": 0.0029255474957478474, "phrase": "fuzzy_aspiration_levels"}, {"score": 0.0028659990472580154, "phrase": "objective_functions"}, {"score": 0.0024186620196958867, "phrase": "example_problem"}, {"score": 0.0021049977753042253, "phrase": "efficient_solutions"}], "paper_keywords": ["Cell loading", " Manpower allocation", " Fuzzy aspiration levels", " Fuzzy operators", " Mathematical programming"], "paper_abstract": "In this study, a fuzzy bi-objective cell loading problem in labor-intensive cellular environments is presented and the effects of different fuzzy operators on the model are investigated. The objective functions of the proposed mathematical model for the problem arc minimizing the number of the tardy jobs and the minimizing the total manpower needed. The mathematical model determines the number of cells to open and the cell size for each opened cell and assigns products to cells (cell loading) and also determines the sequence of products in each cell simultaneously. Fuzziness stems from the fuzzy aspiration levels attained to both objective functions. To solve the model, fuzzy mathematical programming approach is used and fuzzy achievement function of the model is defined by six different fuzzy operators which are min. fuzzy and, fuzzy or, minimum bounded stun, acid, and product. An example problem is solved to represent the performance of the operators. Experimentation shows that the fuzzy and-operator and product-operator arc suitable to reach efficient solutions for the problem on hand. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Effects of different fuzzy operators on fuzzy bi-objective cell loading problem in labor-intensive manufacturing cells", "paper_id": "WOS:000264037900003"}