{"auto_keywords": [{"score": 0.04589193974665994, "phrase": "functional_groups"}, {"score": 0.0405121137577546, "phrase": "reaction_conditions"}, {"score": 0.015061579614650438, "phrase": "synthesis_design_system"}, {"score": 0.009901187418897034, "phrase": "interaction_data"}, {"score": 0.00481495049065317, "phrase": "functional_group_reactivity_database"}, {"score": 0.0046781613377273774, "phrase": "reaction_database"}, {"score": 0.0034558655164987134, "phrase": "relative_reactivity"}, {"score": 0.0030790429005600898, "phrase": "\"interaction_data"}, {"score": 0.0029203055813347874, "phrase": "synsup."}, {"score": 0.002716915166374506, "phrase": "reaction_databases"}, {"score": 0.002467536552997677, "phrase": "useful_reactions"}, {"score": 0.0023743009016047424, "phrase": "inert_functional_groups"}, {"score": 0.0021563019696857768, "phrase": "multiple_relative_rate_datasets"}], "paper_keywords": [""], "paper_abstract": "To be able to estimate the reactivity of functional groups under certain reaction conditions, we have stored three types of data: (1) data of change or destruction of the functional groups by the conditions of the reaction conditions; (2) data showing no influence of the reaction conditions on the functional groups; and (3) data showing the relative reactivity of two functional groups in the presence of certain reaction conditions. These three types of data, considered together, form entities that are referenced as \"interaction data\". These interaction data are used in a synthesis design system called SYNSUP. A new module in our system has been constructed that automatically generates interaction data from the reaction databases. From 15 265 reactions in the database, our program selected 2763 useful reactions with yields of >= 90% and one functional group change. From these useful reactions, data regarding 465 interferences, 815 cases of inert functional groups (under the reaction conditions), and 62 relative rate data could be extracted. In addition, with the use of multiple relative rate datasets, the reactivity of more than two functional groups could be deduced.", "paper_title": "Construction of Functional Group Reactivity Database under Various Reaction Conditions Automatically Extracted from Reaction Database in a Synthesis Design System", "paper_id": "WOS:000275858000001"}