{"auto_keywords": [{"score": 0.029139449391002575, "phrase": "pstg"}, {"score": 0.015589188592772321, "phrase": "uniform_and_variable_strength"}, {"score": 0.00481495049065317, "phrase": "particle_swarm_optimization"}, {"score": 0.004481954307639453, "phrase": "artificial_intelligence"}, {"score": 0.004278807087784626, "phrase": "interaction_strength"}, {"score": 0.004067635935640407, "phrase": "ant_colony"}, {"score": 0.004033464035028803, "phrase": "simulated_annealing"}, {"score": 0.003999578057088828, "phrase": "genetic_algorithm"}, {"score": 0.003949280009382125, "phrase": "tabu_search"}, {"score": 0.0036450381529042103, "phrase": "existing_ai-based_t-way_testing_strategies"}, {"score": 0.003335873298309004, "phrase": "recent_studies"}, {"score": 0.002770273247998903, "phrase": "particle_swarm_search_process"}, {"score": 0.0027123819773059127, "phrase": "high_interaction_strengths"}, {"score": 0.002524428047147766, "phrase": "benchmark_experiments"}, {"score": 0.0022145052062614514, "phrase": "fault_detection"}, {"score": 0.0021590588269751816, "phrase": "input_components"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software testing", " t-way testing", " Variable strength interaction", " Artificial Intelligence", " Particle Swarm Optimization"], "paper_abstract": "Recently, researchers have started to explore the use of Artificial Intelligence (AI)-based algorithms as t-way ( where t indicates the interaction strength) testing strategies. Many AI-based strategies have been developed, such as Ant Colony, Simulated Annealing, Genetic Algorithm, and Tabu Search. Although useful, most existing AI-based t-way testing strategies adopt complex search processes and require heavy computations. For this reason, existing AI-based t-way testing strategies have been confined to small interaction strengths (i.e., t <= 3) and small test configurations. Recent studies demonstrate the need to go up to t = 6 in order to capture most faults. In this paper, we demonstrate the effectiveness of our proposed Particle Swarm-based t-way Test Generator (PSTG) for generating uniform and variable strength covering arrays. Unlike other existing AI-based t-way testing strategies, the lightweight computation of the particle swarm search process enables PSTG to support high interaction strengths of up to t = 6. The performance of our proposed PSTG is evaluated using several sets of benchmark experiments. Comparatively, PSTG consistently outperforms its AI counterparts and other existing testing strategies as far as the size of the array is concerned. Furthermore, our case study demonstrates the usefulness of PSTG for facilitating fault detection owing to interactions of the input components. (c) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Application of Particle Swarm Optimization to uniform and variable strength covering array construction", "paper_id": "WOS:000300609500010"}