{"auto_keywords": [{"score": 0.032262692011100026, "phrase": "arrow"}, {"score": 0.004725787037228084, "phrase": "longstanding_problem"}, {"score": 0.004518442937844318, "phrase": "black_holes"}, {"score": 0.00436890075128947, "phrase": "architectural_solutions"}, {"score": 0.004023775199194536, "phrase": "widespread_adoption"}, {"score": 0.00342568771304873, "phrase": "aforementioned_internet_vulnerabilities"}, {"score": 0.003324614337607016, "phrase": "reliable_routing"}, {"score": 0.0030847461428168614, "phrase": "participating_providers"}, {"score": 0.002993714571653971, "phrase": "isp"}, {"score": 0.0029713625496165944, "phrase": "tunneled_transit"}, {"score": 0.0029053368919259985, "phrase": "packet_transformation"}, {"score": 0.0027159094186967247, "phrase": "reliable_end"}, {"score": 0.0026357223464279983, "phrase": "participating_and_non-participating_isps"}, {"score": 0.002373214852820709, "phrase": "well-known_internet_vulnerabilities"}, {"score": 0.002193600680263771, "phrase": "small-scale_wide-area_isp"}, {"score": 0.0021049977753042253, "phrase": "live_settings"}], "paper_keywords": ["Internet", " Source routing", " Overlay networks", " BGP", " Reliability"], "paper_abstract": "A longstanding problem with the Internet is that it is vulnerable to outages, black holes, hijacking and denial of service. Although architectural solutions have been proposed to address many of these issues, they have had difficulty being adopted due to the need for widespread adoption before most users would see any benefit. This is especially relevant as the Internet is increasingly used for applications where correct and continuous operation is essential. In this paper, we study whether a simple, easy to implement model is sufficient for addressing the aforementioned Internet vulnerabilities. Our model, called ARROW (Advertised Reliable Routing Over Waypoints), is designed to allow users to configure reliable and secure end to end paths through participating providers. With ARROW, a highly reliable ISP offers tunneled transit through its network, along with packet transformation at the ingress, as a service to remote paying customers. Those customers can stitch together reliable end to end paths through a combination of participating and non-participating ISPs in order to improve the fault-tolerance, robustness, and security of mission critical transmissions. Unlike efforts to redesign the Internet from scratch, we show that ARROW can address a set of well-known Internet vulnerabilities, for most users, with the adoption of only a single transit ISP. To demonstrate ARROW, we have added it to a small-scale wide-area ISP we control. We evaluate its performance and failure recovery properties in both simulation and live settings.", "paper_title": "One Tunnel is (Often) Enough", "paper_id": "WOS:000350564600013"}