{"auto_keywords": [{"score": 0.034526216484340115, "phrase": "adjustability_dimensions"}, {"score": 0.009336575615143065, "phrase": "reusable_set"}, {"score": 0.005706891611376354, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "identified_adjustability_dimensions"}, {"score": 0.004763565662615503, "phrase": "product_specific_requirements_specification"}, {"score": 0.0046875099587735825, "phrase": "requirements_reuse_setups"}, {"score": 0.004649936560866145, "phrase": "reusable_requirement"}, {"score": 0.004563427013973105, "phrase": "reusable_requirements"}, {"score": 0.004502617157140059, "phrase": "product_specific_requirements_sets"}, {"score": 0.004383406949799696, "phrase": "ideal_scenario"}, {"score": 0.004121015016128205, "phrase": "product_development"}, {"score": 0.00409895142748329, "phrase": "new_requirements"}, {"score": 0.004022651232112008, "phrase": "critical_issue"}, {"score": 0.0036815763368083197, "phrase": "specific_method"}, {"score": 0.003584025547693836, "phrase": "possible_dimensions"}, {"score": 0.003526735797659508, "phrase": "product_requirement"}, {"score": 0.003442507726823741, "phrase": "six_adjustability_dimensions"}, {"score": 0.003387472413228962, "phrase": "extensive_state"}, {"score": 0.003306559295382181, "phrase": "presented_methods"}, {"score": 0.0031845067058084583, "phrase": "requirement_reuse_approach"}, {"score": 0.002969628818856786, "phrase": "possible_methods"}, {"score": 0.0028986672783671147, "phrase": "user_friendly_and_sustainable_approach"}, {"score": 0.0027766627317272427, "phrase": "danfoss_solar_inverters"}, {"score": 0.0027621438019075524, "phrase": "si"}, {"score": 0.0027395968397212053, "phrase": "danfoss_frequency_drives"}, {"score": 0.002520552881436672, "phrase": "reuse_implementation"}, {"score": 0.002407941567598653, "phrase": "adjustability_dimension"}, {"score": 0.0023566987138026285, "phrase": "specific_criterions"}, {"score": 0.0022393151471501137, "phrase": "previous_research"}, {"score": 0.002209406458446019, "phrase": "useful_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Requirements reuse", " Requirements specification", " Product development", " Adjustability dimensions"], "paper_abstract": "A requirements reuse setups typically includes reusable requirement set(s) containing a collection of reusable requirements and a number of product specific requirements sets which are drawn from the reusable set(s). The ideal scenario when reusing requirements is that all the product requirements can be drawn directly from the reusable set. However, this is rarely the case in product development as new requirements are likely to surface. A critical issue in requirements reuse therefore becomes how to enable products to efficiently reuse requirements as well incorporating changes to the product set. In this paper the objective is not to present a specific method for requirements reuse but to introduce and discuss the possible dimensions of adjustability when generating a product requirement set by reusing requirements from a reusable set. Six adjustability dimensions have been identified. An extensive state of the art is included to introduce the presented methods related to each adjustability dimensions. The options for implementing each adjustability dimensions in a requirement reuse approach are illustrated along with a discussion regarding the benefits and issues resulting from each option. This discussion should help practitioners to better understand the possible methods that can be implemented and to design a user friendly and sustainable approach. A case study, describing how the dimensions are incorporated in two requirements reuse approaches, for Danfoss Solar Inverters (SI) and Danfoss Frequency Drives is provided. As a result an overview of how each adjustability dimensions is implemented in each case is presented. The case study demonstrates that all the identified adjustability dimensions were important elements in requirements reuse implementation. The case study furthermore highlights the need, not only to understand the effects of each adjustability dimension but also of the dependencies to case specific criterions. The classification of adjustability dimensions in requirements reuse and the options for their implementation has not been outlined by previous research and should be a useful contribution both to researchers and practitioners working in the field of requirements reuse. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Identified adjustability dimensions when generating a product specific requirements specification by requirements reuse", "paper_id": "WOS:000338410200004"}