{"auto_keywords": [{"score": 0.03755359252962418, "phrase": "wuep"}, {"score": 0.007190371394895334, "phrase": "model-driven_web_development_processes"}, {"score": 0.00481495049065317, "phrase": "usability_inspection_method"}, {"score": 0.004781915513030716, "phrase": "model-driven_web_development"}, {"score": 0.004209893377338457, "phrase": "empirically_validated_methods"}, {"score": 0.004025531820226182, "phrase": "early_stages"}, {"score": 0.003997891221012094, "phrase": "web_development_processes"}, {"score": 0.003822778117250714, "phrase": "suitable_context"}, {"score": 0.003757480190200645, "phrase": "early_usability_evaluations"}, {"score": 0.003592859432554987, "phrase": "web_usability_evaluation_process"}, {"score": 0.0032848684681050745, "phrase": "wuep."}, {"score": 0.003130077012135034, "phrase": "master's_computer_science_students"}, {"score": 0.0030135741897058844, "phrase": "participants'_effectiveness"}, {"score": 0.0028321862184182913, "phrase": "industrial_widely_used_inspection_method"}, {"score": 0.0028127163745564777, "phrase": "heuristic_evaluation"}, {"score": 0.0027551040319267446, "phrase": "statistical_analysis"}, {"score": 0.002527451565708784, "phrase": "usability_problems"}, {"score": 0.002224510044064184, "phrase": "promising_usability_inspection_method"}, {"score": 0.0021490449563443025, "phrase": "model-driven_development_processes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Usability inspection", " Web applications", " Model-driven development", " Family of experiments"], "paper_abstract": "Web applications should be usable in order to be accepted by users and to improve their success probability. Despite the fact that this requirement has promoted the emergence of several usability evaluation methods, there is a need for empirically validated methods that provide evidence about their effectiveness and that can be properly integrated into early stages of Web development processes. Model-driven Web development processes have grown in popularity over the last few years, and offer a suitable context in which to perform early usability evaluations due to their intrinsic traceability mechanisms. These issues have motivated us to propose a Web Usability Evaluation Process (WUEP) which can be integrated into model-driven Web development processes. This paper presents a family of experiments that we have carried out to empirically validate WUEP. The family of experiments was carried out by 64 participants, including PhD and Master's computer science students. The objective of the experiments was to evaluate the participants' effectiveness, efficiency, perceived ease of use and perceived satisfaction when using WUEP in comparison to an industrial widely used inspection method: Heuristic Evaluation (HE). The statistical analysis and meta-analysis of the data obtained separately from each experiment indicated that WUEP is more effective and efficient than HE in the detection of usability problems. The evaluators were also more satisfied when applying WUEP, and found it easier to use than HE. Although further experiments must be carried out to strengthen these results. WUEP has proved to be a promising usability inspection method for Web applications which have been developed by using model-driven development processes. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Empirical validation of a usability inspection method for model-driven Web development", "paper_id": "WOS:000312927100014"}