{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pregnant_cows"}, {"score": 0.004712463245074863, "phrase": "online_image_analysis"}, {"score": 0.004268293864953256, "phrase": "human_intervention"}, {"score": 0.004106063237069123, "phrase": "automatic_real-time_monitoring_technique"}, {"score": 0.003751011827704279, "phrase": "purpose_video_surveillance_images"}, {"score": 0.003531474887552889, "phrase": "seven_different_variables"}, {"score": 0.003382547312072468, "phrase": "automatic_real-time_monitor"}, {"score": 0.003296212583539166, "phrase": "x-y_coordinates"}, {"score": 0.0032538723984338615, "phrase": "geometrical_top_view_centre_point"}, {"score": 0.00306334226516593, "phrase": "main_axis"}, {"score": 0.002822434555587263, "phrase": "specific_behaviours"}, {"score": 0.0023958326775913165, "phrase": "eight_cows"}, {"score": 0.002255431275670053, "phrase": "developed_technique"}, {"score": 0.0021883400011393564, "phrase": "additional_tests"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["computer vision", " behaviour classification", " cows"], "paper_abstract": "Monitoring the locomotion and posture behaviour of pregnant cows close to calving is essential in determining if there is a need for human intervention to assist parturition. In this study an automatic real-time monitoring technique is described in detail which allows identifying the locomotion and posturing behaviour of pregnant cows prior to calving. For this purpose video surveillance images of eight cows for the last 24 h prior to their calving were analysed. Data on seven different variables with time were obtained for each cow using an automatic real-time monitor. These were namely: x-y coordinates of the geometrical top view Centre point of the cow; walking trajectory; distance walked; orientation of the main axis; body width/length ratio; hip length and back area. These variables were then used to classify specific behaviours such as standing or lying (including incidences of motion during lying), and eating or drinking. On average 85% of the standing and lying and 87% of the eating or drinking behaviour of the eight cows during the last 24 h before calving could be correctly classified. However, the developed technique needs to be further validated with additional tests in the field. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Automatic real-time monitoring of locomotion and posture behaviour of pregnant cows prior to calving using online image analysis", "paper_id": "WOS:000259462800010"}