{"auto_keywords": [{"score": 0.046656508908776206, "phrase": "global_resource"}, {"score": 0.015719716506582538, "phrase": "controller_problem"}, {"score": 0.010046358844850866, "phrase": "message_complexity"}, {"score": 0.007606196290450261, "phrase": "lower_bound"}, {"score": 0.004712581514907594, "phrase": "afek"}, {"score": 0.004690129126861074, "phrase": "awerbuch"}, {"score": 0.004667791875315048, "phrase": "plotkin"}, {"score": 0.004634472160787128, "phrase": "saks"}, {"score": 0.00459039896577789, "phrase": "basic_distributed_tool"}, {"score": 0.004439445472040688, "phrase": "distributed_dynamic_network"}, {"score": 0.004272969980602508, "phrase": "arbitrary_nodes"}, {"score": 0.004212157020917929, "phrase": "node_u"}, {"score": 0.003967910285854432, "phrase": "finite_time"}, {"score": 0.003702206069379459, "phrase": "designated_root_node"}, {"score": 0.0036669760226536977, "phrase": "execution_permits"}, {"score": 0.003580355398511932, "phrase": "network's_links"}, {"score": 0.003332537728389913, "phrase": "fundamental_rule"}, {"score": 0.002893943130124219, "phrase": "dynamic_network"}, {"score": 0.002873247913129334, "phrase": "node_insertions"}, {"score": 0.002611010097359509, "phrase": "important_case"}, {"score": 0.002543176085553453, "phrase": "common_case"}, {"score": 0.002494949035510408, "phrase": "surprising_reduction"}, {"score": 0.0023669772238591844, "phrase": "long_lasting_conjecture"}, {"score": 0.002333226812828489, "phrase": "monotonic_labeling_problem"}, {"score": 0.002140572489970108, "phrase": "new_construction"}], "paper_keywords": ["(M, W)-controller", " Monotonic labeling"], "paper_abstract": "The (M, W)-controller, originally studied by Afek, Awerbuch, Plotkin, and Saks, is a basic distributed tool that provides an abstraction for managing the consumption of a global resource in a distributed dynamic network. The input to the controller arrives online in the form of requests presented at arbitrary nodes. A request presented at node u corresponds to the \"desire\" of some entity to consume one unit of the global resource at u and the controller should handle this request within finite time either by granting it with a permit or by denying it. Initially, M permits (corresponding to M units of the global resource) are stored at a designated root node. Throughout the execution permits can be transported from place to place along the network's links so that they can be granted to requests presented at various nodes; when a permit is granted to some request, it is eliminated from the network. The fundamental rule of an (M, W)-controller is that a request should not be denied unless it is certain that at least M - W permits are eventually granted. The most efficient (M, W)-controller known to date has message complexity O(N log(2) N log M/W+1), where N is the number of nodes that ever existed in the network (the dynamic network may undergo node insertions and deletions). In this paper we establish two new lower bounds on the message complexity of the controller problem. We first prove a simple lower bound stating that any (M, W)-controllermust send Omega(N log M/W+1) messages. Second, for the important case when W is proportional to M (this is the common case in most applications), we use a surprising reduction from the (centralized) monotonic labeling problem to show that any (M, W)-controller must send Omega(N log N) messages. In fact, under a long lasting conjecture regarding the complexity of the monotonic labeling problem, this lower bound is improved to a tight Omega(N log(2) N). The proof of this lower bound requires that N = O(M) which turns out to be somewhat inevitable due to a new construction of an (M, M/2)-controller with message complexity O(N log(2) M).", "paper_title": "New bounds for the controller problem", "paper_id": "WOS:000296516700005"}