{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "metamap"}, {"score": 0.023060501939844918, "phrase": "medline"}, {"score": 0.02281242025037779, "phrase": "novel_associations"}, {"score": 0.02084429796172801, "phrase": "clinical_dataset"}, {"score": 0.008399146138250026, "phrase": "medline_citations"}, {"score": 0.007525719286770829, "phrase": "manual_review"}, {"score": 0.004675565200598801, "phrase": "large_clinical_dataset"}, {"score": 0.004624337472244542, "phrase": "feasibility_analysis"}, {"score": 0.004265354774450696, "phrase": "international_classification_of_disease"}, {"score": 0.0037231102027070724, "phrase": "methods_pairwise_associations"}, {"score": 0.003109280367693954, "phrase": "medline_associations"}, {"score": 0.002975024676463106, "phrase": "clinical_and_medline_datasets"}, {"score": 0.0027946649584841754, "phrase": "medline_dataset"}, {"score": 0.0026059610060579145, "phrase": "co-occurring_diagnoses"}, {"score": 0.002530359917257626, "phrase": "clinically_meaningful_associations"}, {"score": 0.002502576987281976, "phrase": "identifying_novel_associations"}, {"score": 0.00247509835229599, "phrase": "large_clinical_datasets"}, {"score": 0.00241214634516517, "phrase": "sole_data_source"}, {"score": 0.0023944552329463035, "phrase": "existing_knowledge"}, {"score": 0.0023249757987087055, "phrase": "widely_known_associations"}], "paper_keywords": [""], "paper_abstract": "Objective We describe experiments designed to determine the feasibility of distinguishing known from novel associations based on a clinical dataset comprised of International Classification of Disease, V.9 (ICD-9) codes from 1.6 million patients by comparing them to associations of ICD-9 codes derived from 20.5 million Medline citations processed using MetaMap. Associations appearing only in the clinical dataset, but not in Medline citations, are potentially novel. Methods Pairwise associations of ICD-9 codes were independently identified in both the clinical and Medline datasets, which were then compared to quantify their degree of overlap. We also performed a manual review of a subset of the associations to validate how well MetaMap performed in identifying diagnoses mentioned in Medline citations that formed the basis of the Medline associations. Results The overlap of associations based on ICD-9 codes in the clinical and Medline datasets was low: only 6.6% of the 3.1 million associations found in the clinical dataset were also present in the Medline dataset. Further, a manual review of a subset of the associations that appeared in both datasets revealed that co-occurring diagnoses from Medline citations do not always represent clinically meaningful associations. Discussion Identifying novel associations derived from large clinical datasets remains challenging. Medline as a sole data source for existing knowledge may not be adequate to filter out widely known associations. Conclusions In this study, novel associations were not readily identified. Further improvements in accuracy and relevance for tools such as MetaMap are needed to realize their expected utility.", "paper_title": "Applying MetaMap to Medline for identifying novel associations in a large clinical dataset: a feasibility analysis", "paper_id": "WOS:000340581400023"}