{"auto_keywords": [{"score": 0.04972867160744286, "phrase": "digital_environments"}, {"score": 0.01605676505952405, "phrase": "tide"}, {"score": 0.006818367948249152, "phrase": "service_providers"}, {"score": 0.00481495049065317, "phrase": "initial_transactions"}, {"score": 0.004641351004344458, "phrase": "significant_benefits"}, {"score": 0.004187718090913465, "phrase": "widespread_use"}, {"score": 0.0039053194919285725, "phrase": "de-facto_standard"}, {"score": 0.0038483286199081, "phrase": "certification_authorities"}, {"score": 0.0036958398682001015, "phrase": "provided_services"}, {"score": 0.003536346954940087, "phrase": "single_point"}, {"score": 0.00327356326590461, "phrase": "effective_and_resilient_trust_mechanism"}, {"score": 0.0030414140732789186, "phrase": "invalid_transactions"}, {"score": 0.0029100802280971065, "phrase": "service_provider"}, {"score": 0.002878140062594849, "phrase": "prior_historical_transactions"}, {"score": 0.002763988044737562, "phrase": "challenging_issues"}, {"score": 0.0026155681847364483, "phrase": "initial_trustworthiness"}, {"score": 0.002511803988580901, "phrase": "trust_computation"}, {"score": 0.0024842242921857705, "phrase": "raters'_feedback"}, {"score": 0.00238565827614317, "phrase": "raters'_participation"}, {"score": 0.0023421547766273015, "phrase": "raters'_category"}, {"score": 0.0022994427535192514, "phrase": "dynamic_personalities"}], "paper_keywords": ["Design", " Algorithms", " Experimentation", " Trust", " reputation", " trust models", " digital environments online communities"], "paper_abstract": "The advent of digital environments has generated significant benefits for businesses, organizations, governments, academia and societies in general. Today, over millions of transactions take place on the Internet. Although the widespread use of digital environments has generally provided opportunities for societies, a number of threats have limited their adoption. The de-facto standard today is for certification authorities to authenticate the identity of service providers while trust on the provided services is implied. This approach has certain shortcomings, for example, single point of failure, implied trust rather than explicit trust and others. One approach for minimizing such threats is to introduce an effective and resilient trust mechanism that is capable of determining the trustworthiness of service providers in providing their services. Determining the trustworthiness of services reduces invalid transactions in digital environments and further encourages collaborations. Evaluating trustworthiness of a service provider without any prior historical transactions (i.e. the initial transaction) pose a number of challenging issues. This article presents TIDE - a decentralized reputation trust mechanism that determines the initial trustworthiness of entities in digital environments. TIDE improves the precision of trust computation by considering raters' feedback, number of transactions, credibility, incentive to encourage raters' participation, strategy for updating raters' category, and safeguards against dynamic personalities. Furthermore, TIDE classifies raters into three categories and promotes the flexibility and customization through its parameters. Evaluation of TIDE against several attack vectors demonstrates its accuracy, robustness and resilience.", "paper_title": "Modeling Decentralized Reputation-Based Trust for Initial Transactions in Digital Environments", "paper_id": "WOS:000331608300002"}