{"auto_keywords": [{"score": 0.046128953888597814, "phrase": "cpoe_system"}, {"score": 0.028344637852256386, "phrase": "professional_groups"}, {"score": 0.015035373317048208, "phrase": "dutch_academic_hospital"}, {"score": 0.014322255999836846, "phrase": "inter-professional_workflow"}, {"score": 0.014149248637184152, "phrase": "medication_process"}, {"score": 0.00481495049065317, "phrase": "computerized_provider_order_entry_system"}, {"score": 0.004698229304089357, "phrase": "inter-professional_medication_process"}, {"score": 0.003892126266260425, "phrase": "handwritten_and_system-generated_documents"}, {"score": 0.003331275574328097, "phrase": "existing_work_procedures"}, {"score": 0.0029100272315053253, "phrase": "patients'_medication-related_information"}, {"score": 0.0028161764476743257, "phrase": "electronic_records"}, {"score": 0.0027477745788313163, "phrase": "different_professional_domains"}, {"score": 0.0026920404458807444, "phrase": "limited_support"}, {"score": 0.0025315126622525424, "phrase": "mutual_intelligibility"}, {"score": 0.002510843167476253, "phrase": "new_changes"}, {"score": 0.002480154140902474, "phrase": "medication_plan"}, {"score": 0.0023322317017275803, "phrase": "new_steps"}, {"score": 0.0023131855385489764, "phrase": "extra_coordinative_tasks"}, {"score": 0.0021049977753042253, "phrase": "system_design"}], "paper_keywords": ["Medical order entry systems", " computerized physician order entry", " clinical workflow", " evaluation studies", " collaboration", " CPOE"], "paper_abstract": "Objectives: To assess the effects of a CPOE system on inter-professional workflow in the medication process. Methods: Twenty-three semi-structured interviews with physicians, nurses, and pharmacists were conducted in a Dutch academic hospital. In addition, the handwritten and system-generated documents used daily were collected for analysis. Data was analyzed on the basis of three conceptual themes in the inter-professional workflow: division of tasks, flow of information, and task coordination. Results: The CPOE system reorganized the existing work procedures, affecting the workflow among the three professional groups both advantageously and disadvantageously. The system resulted in the reassignment of tasks and reallocation of areas of expertise in the medication process, Moreover, patients' medication-related information became fragmented in both the paper records and in the electronic records, as well as in different professional domains. The system provided limited support for professional groups to coordinate their tasks temporally. It also made it difficult to build mutual intelligibility upon new changes in the medication plan. To integrate tasks, the professional groups had to bypass the system or add new steps and extra coordinative tasks. Conclusion: We identified several workflow integration issues after the implementation of a CPOE system. Our insights into these issues can help ensure that the system design or redesign properly integrates all tasks, information, and areas of expertise of professional groups into those of the physicians.", "paper_title": "Computerized Provider Order Entry System - Does it Support the Inter-professional Medication Process? Lessons from a Dutch Academic Hospital", "paper_id": "WOS:000274131600003"}