{"auto_keywords": [{"score": 0.03635537723701014, "phrase": "computational_cost"}, {"score": 0.00481495049065317, "phrase": "new_method"}, {"score": 0.004694700982410341, "phrase": "main_advantage"}, {"score": 0.004577440795549049, "phrase": "important_time-complexity_reduction"}, {"score": 0.0038996120252338556, "phrase": "lossless_representation"}, {"score": 0.0033078284621762817, "phrase": "ordinal_and_nominal_types"}, {"score": 0.0032115093493071366, "phrase": "modulo_one"}, {"score": 0.003104849179057156, "phrase": "non-empty_bins"}, {"score": 0.002723862897844177, "phrase": "obtained_histograms"}, {"score": 0.0023594160789762227, "phrase": "public_databases"}, {"score": 0.00231987280116332, "phrase": "mobile_robots"}, {"score": 0.002271372252250557, "phrase": "indoor_scenes"}, {"score": 0.0022238834225283594, "phrase": "learning_stage"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["distance between histograms", " signature", " Earth Mover Distance", " second-order random graphs"], "paper_abstract": "The aim of this paper is to present a new method to compare histograms. The main advantage is that there is an important time-complexity reduction with respect to the methods presented before. This reduction is statistically and analytically demonstrated in the paper. The distances between histograms that we presented are defined on a structure called signature, which is a lossless representation of histograms. Moreover, the type of the elements of the sets that the histograms represent are ordinal, nominal and modulo. We show that the computational cost of these distances is P(z') for the ordinal and nominal types and O(z'(2)) for the modulo one, z' being the number of non-empty bins of the histograms. The computational cost of the algorithms presented in the literature depends on the number of bins of the histograms. In most of the applications, the obtained histograms are sparse; then considering only the non-empty bins drastically decreases the time consumption of the comparison. The distances and algorithms presented in this paper are experimentally validated on the comparison of images obtained from public databases and positioning of mobile robots through the recognition of indoor scenes (captured in a learning stage). (c) 2006 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Signatures versus histograms: Definitions, distances and algorithms", "paper_id": "WOS:000236164800015"}