{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wireless_sensor_network_virtualization"}, {"score": 0.003693533648584145, "phrase": "redundant_wsn_deployments"}, {"score": 0.0032940691998512963, "phrase": "multiple_independent_entities"}, {"score": 0.0030308784612749647, "phrase": "novel_architecture"}, {"score": 0.0029994894380575604, "phrase": "wsn_virtualization"}, {"score": 0.0029530125680590413, "phrase": "proposed_architecture"}, {"score": 0.0026061419474030633, "phrase": "constrained_application_protocol"}, {"score": 0.002422890839801611, "phrase": "single_wsn"}, {"score": 0.002372935208038141, "phrase": "multiple_applications"}, {"score": 0.0022879728308318205, "phrase": "fire_monitoring_application"}, {"score": 0.0022291501521610737, "phrase": "proof-of-concept_prototype"}, {"score": 0.0021493248730171132, "phrase": "performance_measurements"}, {"score": 0.0021049977753042253, "phrase": "future_research_directions"}], "paper_keywords": [""], "paper_abstract": "WSNs have become pervasive and are used in many applications and services. Usually, deployments of WSNs are task-oriented and domain-specific, thereby precluding reuse when other applications and services are contemplated. This inevitably leads to the proliferation of redundant WSN deployments. Virtualization is a technology that can aid in tackling this issue, as it enables the sharing of resources/infrastructure by multiple independent entities. In this article we critically review the state of the art and propose a novel architecture for WSN virtualization. The proposed architecture has four layers (physical layer, virtual sensor layer, virtual sensor access layer, and overlay layer) and relies on a constrained application protocol. We illustrate its potential by using it in a scenario where a single WSN is shared by multiple applications, one of which is a fire monitoring application. We present the proof-of-concept prototype we have built along with the performance measurements, and discuss future research directions.", "paper_title": "Wireless Sensor Network Virtualization: Early Architecture and Research Perspectives", "paper_id": "WOS:000355756800016"}