{"auto_keywords": [{"score": 0.04871093899700793, "phrase": "top_most_discriminating_genes"}, {"score": 0.04586846484671967, "phrase": "cancer_detection"}, {"score": 0.00450000390667755, "phrase": "dna_array_technology"}, {"score": 0.004350308086118336, "phrase": "dna_array_expression_data"}, {"score": 0.0035336109352157763, "phrase": "hybrid_gene_selection_method"}, {"score": 0.00320770578058916, "phrase": "non-redundant_clusters"}, {"score": 0.0030267296900520217, "phrase": "discriminating_genes"}, {"score": 0.0028147603684576306, "phrase": "cmst"}, {"score": 0.0027741761880779535, "phrase": "gap_statistic"}, {"score": 0.00269475174341129, "phrase": "optimal_similarity_measure_a"}, {"score": 0.002579847272930948, "phrase": "gene_selection_method"}, {"score": 0.0023990982005125763, "phrase": "gene_pattern"}, {"score": 0.002177600561610171, "phrase": "classification_rate"}, {"score": 0.0021049977753042253, "phrase": "selection_scheme"}], "paper_keywords": [""], "paper_abstract": "The development of DNA array technology makes it feasible to cancer detection with DNA array expression data. However, the research is usually plagued with the problem of \"curse of dimensionality\", and the capability of discrimination is weakened seriously by the noise and the redundancy that are abundant in these datasets. This paper proposes a hybrid gene selection method for cancer detection based on clustering of most similarity tree (CMST). By this method, a number of non-redundant clusters and the most discriminating gene from each cluster can be acquired. These discriminating genes are then used for training of a perceptron that produces a very efficient classification. In CMST, the Gap statistic is used to determine the optimal similarity measure A and the number of clusters. And a gene selection method with optimal self-adaptive CMST(OS-CMST) for cancer detection is presented. The experiments show that the gene pattern pre-processing based on CMST not only reduces the dimensionality of the attributes significantly but also improves the classification rate effectively in cancer detection. And the selection scheme based on OS-CMST can acquire the top most discriminating genes.", "paper_title": "Using most similarity tree based clustering to select the top most discriminating genes for cancer detection", "paper_id": "WOS:000239600000098"}