{"auto_keywords": [{"score": 0.04165826455732131, "phrase": "random_variables"}, {"score": 0.0203699857510296, "phrase": "stereo_effect"}, {"score": 0.00481495049065317, "phrase": "planar-to-stereo_image_conversion"}, {"score": 0.004790893189300704, "phrase": "different_distributions"}, {"score": 0.0045959609346817535, "phrase": "image_processing"}, {"score": 0.0038820411362656803, "phrase": "conversion_control"}, {"score": 0.002884111441153185, "phrase": "different_values"}, {"score": 0.00249293148301837, "phrase": "root-mean-square_errors"}, {"score": 0.002351705899181029, "phrase": "small_influence"}, {"score": 0.002231441081806766, "phrase": "normal_distribution"}, {"score": 0.002205560249972527, "phrase": "better_stereo_effect"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["stereo vision", " conversion", " planar", " stereo", " image processing"], "paper_abstract": "Research on planar-to-stereo image conversion has significant theoretical and practical implications for image processing. In this paper we use a method which segments an image into sub-blocks to perform this kind of conversion; parameters such as random variables are used for conversion control. We use two quantitative criteria, cross-entropy and root-mean-square error, to evaluate the stereo effect. Furthermore, the stereo effect that the random variables create is discussed. The results of the experiment show that, (i) when all random variables have the same distribution, different values of these random variables only slightly affect the stereo effect; and (ii) when different distributions are applied to the random variables, the cross-entropies or root-mean-square errors are slightly different, which indicates different distributions have a small influence on the stereo effect. Generally, we recommend normal distribution for better stereo effect in most cases. (C) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Stereo effect of image converted from planar", "paper_id": "WOS:000255537200012"}