{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "computer-generated_narratives"}, {"score": 0.0046073860169839305, "phrase": "key_concept"}, {"score": 0.0038838500580958744, "phrase": "creative_process"}, {"score": 0.003841263262252044, "phrase": "human_beings"}, {"score": 0.0034024277222012597, "phrase": "similarity_metrics"}, {"score": 0.0030638704739988595, "phrase": "relevant_elements"}, {"score": 0.002758907973783665, "phrase": "simple_plots"}, {"score": 0.0027286224888843956, "phrase": "basic_narrative_elements"}, {"score": 0.002539689093411356, "phrase": "empirical_results"}, {"score": 0.00241658945942583, "phrase": "computational_metrics"}, {"score": 0.0023768935613577985, "phrase": "automatic_assessment"}], "paper_keywords": ["Similarity metrics", " Novelty assessment", " Story generation", " Creative systems", " Computational creativity"], "paper_abstract": "Novelty is a key concept to understand creativity. Evaluating a piece of artwork or other creation in terms of novelty requires comparisons to other works and considerations about the elements that have been reused in the creative process. Human beings perform this analysis intuitively, but in order to simulate it using computers, the objects to be compared and the similarity metrics to be used should be formalized and explicitly implemented. In this paper we present a study on relevant elements for the assessment of novelty in computer-generated narratives. We focus on the domain of folk-tales, working with simple plots and basic narrative elements: events, characters, props and scenarios. Based on the empirical results of this study we propose a set of computational metrics for the automatic assessment of novelty. Although oriented to the implementation of our own story generation system, the measurement methodology we propose can be easily generalized to other creative systems.", "paper_title": "Assessing the Novelty of Computer-Generated Narratives Using Empirical Metrics", "paper_id": "WOS:000284546600005"}