{"auto_keywords": [{"score": 0.015542316130590986, "phrase": "interaction_structures"}, {"score": 0.015366886500072011, "phrase": "networked_multiagent_systems"}, {"score": 0.00481495049065317, "phrase": "decision_making_of_networked_multiagent_systems"}, {"score": 0.0045726187330434025, "phrase": "large-scale_application_environments"}, {"score": 0.0036553070575015344, "phrase": "agent's_strategies"}, {"score": 0.003166259444961177, "phrase": "novel_decision-making_model"}, {"score": 0.002711109302199029, "phrase": "presented_model"}, {"score": 0.002664749302333897, "phrase": "resulting_strategies"}, {"score": 0.0023346234464901978, "phrase": "isomorphic_interaction_structures"}, {"score": 0.0022296340517805125, "phrase": "multiagent_citation_network"}, {"score": 0.002191489192077851, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "presented_decision-making_model"}], "paper_keywords": ["Citation networks", " decision making", " multiagents", " networked interaction structures", " social network analyses"], "paper_abstract": "Networked multiagent systems are very popular in large-scale application environments. In networked multiagent systems, the interaction structures can be shaped into the form of networks where each agent occupies a position that is determined by such agent's relations with others. To avoid collisions between agents, the decision of each agent's strategies should match its own interaction position, so that the strategies available to all agents are in line with their interaction structures. Therefore, this paper presents a novel decision-making model for networked multiagent strategies based on their interaction structures, where the set of strategies for an agent is conditionally decided by other agents within its dependence interaction substructure. With the presented model, the resulting strategies available to all agents can minimize the collisions of multiagents regarding their interaction structures, and the model can produce the same resulting strategies for the isomorphic interaction structures. Furthermore, this paper uses a multiagent citation network as a case study to demonstrate the effectiveness of the presented decision-making model.", "paper_title": "Decision Making of Networked Multiagent Systems for Interaction Structures", "paper_id": "WOS:000296017400006"}