{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "middle_school_students'_information_behavior_via_kuhlthau's_isp_model"}, {"score": 0.004603244077348199, "phrase": "field_study"}, {"score": 0.004450568197899267, "phrase": "information_behavior"}, {"score": 0.0036966717141736355, "phrase": "isp_model_concepts"}, {"score": 0.003284637361174143, "phrase": "study_participants"}, {"score": 0.003140004304719746, "phrase": "unique_feature"}, {"score": 0.003035711716881469, "phrase": "unlimited_access"}, {"score": 0.00293487292076612, "phrase": "real-life_history_class"}, {"score": 0.0026820015810254004, "phrase": "factor_analysis"}, {"score": 0.002506715532901322, "phrase": "inquiry-based_project"}, {"score": 0.0024234059612683032, "phrase": "second_main_finding"}, {"score": 0.0023428586429492713, "phrase": "students'_consultations"}], "paper_keywords": [""], "paper_abstract": "The article reports a field study investigating the temporality of the information behavior of 44 grade 8 students from initiation to completion of their school inquiry-based history project. The conceptual framework for the study is Kuhlthau's 6-stage information-search process (ISP) model. The objective of the study is to test and extend ISP model concepts. As per other ISP model studies, our study measured the evolution of the feelings, thoughts, and actions of the study participants over the 3-month period of their class project. The unique feature of this study is the unlimited access the researchers had to a real-life history class, resulting in 12 separate measuring periods. We report 2 important findings of the study. First, through factor analysis, we determined 5 factors that define the temporality of completing an inquiry-based project for these grade 8 students. The second main finding is the importance of the students' consultations with their classmates, siblings, parents, and teachers in the construction of the knowledge necessary to complete their project.", "paper_title": "Tracking Middle School Students' Information Behavior Via Kuhlthau's ISP Model: Temporality", "paper_id": "WOS:000353654600007"}