{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conceptual_model"}, {"score": 0.004690305164360866, "phrase": "tremendous_development"}, {"score": 0.004479855062309818, "phrase": "ontology_increases"}, {"score": 0.004392565073466714, "phrase": "ontology_evaluation"}, {"score": 0.004140726362519362, "phrase": "fundamental_characteristics"}, {"score": 0.003877737556673229, "phrase": "estimate_cost"}, {"score": 0.003802135020791801, "phrase": "future_maintenance"}, {"score": 0.0034911335714333507, "phrase": "common_feature"}, {"score": 0.003334309053314909, "phrase": "fundamental_complexity"}, {"score": 0.0032266093099550955, "phrase": "well-defined_metrics"}, {"score": 0.002530359917257626, "phrase": "gene_ontology"}, {"score": 0.0022777800735119405, "phrase": "biological_process_ontology"}, {"score": 0.0021049977753042253, "phrase": "molecular_function_ontology"}], "paper_keywords": [""], "paper_abstract": "With the tremendous development in size, the complexity of ontology increases. Thus ontology evaluation becomes extremely important for developers to determine the fundamental characteristics of ontologies in order to improve the quality, estimate cost and reduce future maintenance. Our research examines the concepts and their hierarchy in ontology conceptual model, the common feature of most ontologies, which reflects the fundamental complexity. We suggest some well-defined metrics of complexity, which mainly examine the quantity, ratio and correlativity of concepts and relationships, to evaluate ontology from the viewpoint of complexity and evolution. In the study, we measured three ontologies in Gene Ontology to verify our metrics. The results indicate that these metrics works well, and the biological process ontology is the most complex one from the view of complexity, and the molecular function ontology is the unsteadiest one from the view of evolution.", "paper_title": "Ontology analysis on complexity and evolution based on conceptual model", "paper_id": "WOS:000239622300017"}