{"auto_keywords": [{"score": 0.029515680762896488, "phrase": "cvml"}, {"score": 0.00481495049065317, "phrase": "side_information"}, {"score": 0.004402295697276237, "phrase": "single-view_classification_tasks"}, {"score": 0.0041469500929423595, "phrase": "multi-view_classification_tasks"}, {"score": 0.0040048667115255, "phrase": "multiple_representations"}, {"score": 0.0034146585649631692, "phrase": "multi-view_data"}, {"score": 0.0032004205378150354, "phrase": "learning_framework"}, {"score": 0.0031372369299648203, "phrase": "multi-view_classifiers"}, {"score": 0.0030600032877646263, "phrase": "weak_side_information"}, {"score": 0.002701361707441567, "phrase": "traditional_single-view"}, {"score": 0.0022913497040895586, "phrase": "multi-view_classification_situations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Classification", " Multi-view learning", " Without correspondence", " Unpaired multi-view data", " Cross-view side information"], "paper_abstract": "Side information, like must-link (ML) and cannot-link (CL), has been widely used in single-view classification tasks. However, so far such information has never been applied in multi-view classification tasks. In many real world situations, data with multiple representations or views are frequently encountered, and most proposed algorithms for such learning situations require that all the multi-view data should be paired. Yet this requirement is difficult to satisfy in some settings and the multi-view data could be totally unpaired. In this paper, we propose an learning framework to design the multi-view classifiers by only employing the weak side information of cross-view must-links (CvML) and cross-view cannot-links (CvCL). The CvML and the CvCL generalize the traditional single-view must-link (SvML) and single-view cannot-link (SvCL), and to the best of our knowledge, are first definitely introduced and applied into the multi-view classification situations. Finally, we demonstrate the effectiveness of our method in our experiments. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Multi-view classification with cross-view must-link and cannot-link side information", "paper_id": "WOS:000327685800013"}