{"auto_keywords": [{"score": 0.040927564116666516, "phrase": "news_stories"}, {"score": 0.03181453891630958, "phrase": "inquiry_task"}, {"score": 0.030651807250622283, "phrase": "students'_information_literacy"}, {"score": 0.00481495049065317, "phrase": "inquiry_a_level_one_psychology_module"}, {"score": 0.004741845603430361, "phrase": "purpose_-_this_paper"}, {"score": 0.004581373625744533, "phrase": "curriculum_development_project"}, {"score": 0.004195418010131832, "phrase": "cilass"}, {"score": 0.0041001740903338834, "phrase": "information_literacy_development"}, {"score": 0.004053362743156545, "phrase": "level_one_module"}, {"score": 0.004007083686875716, "phrase": "inquiry-based_learning_pedagogical_approach"}, {"score": 0.0038125469099459905, "phrase": "real_psychological_research"}, {"score": 0.0037259623657693794, "phrase": "related_research_paper"}, {"score": 0.0034911335714333507, "phrase": "assessed_work"}, {"score": 0.0032836104153151973, "phrase": "evaluation_instruments"}, {"score": 0.0030414140732789186, "phrase": "student_perceptions"}, {"score": 0.002860546817196148, "phrase": "\"theory_of_change\"_evaluation_methodology"}, {"score": 0.0027741761880779535, "phrase": "evaluation_activities"}, {"score": 0.0027215202678634517, "phrase": "sconul_seven_pillars"}, {"score": 0.002700738055025905, "phrase": "information_literacy_model"}, {"score": 0.0024918548761791435, "phrase": "appropriate_academic_resources"}, {"score": 0.0023981301755351607, "phrase": "google_scholar"}, {"score": 0.002272794656458419, "phrase": "significant_abilities"}, {"score": 0.0022125996721544514, "phrase": "journal_articles"}, {"score": 0.0021049977753042253, "phrase": "postgraduate_tutors"}], "paper_keywords": ["Learning", " Information literacy", " Curriculum development"], "paper_abstract": "Purpose - This paper aims to report on the evaluation of a curriculum development project that took place in the Department of Psychology at the University of Sheffield. The project, funded by a Centre for Excellence in Teaching and Learning (CILASS), sought to embed information literacy development in a Level One module using an inquiry-based learning pedagogical approach. Students worked collaboratively to find news stories that were purportedly based on real psychological research and then searched for the related research paper. They reflected on this task and the differences between the two sources as part of the assessed work for the module. Design/methodology/approach - The paper synthesizes the results of a number of evaluation instruments (questionnaire, information literacy competency test, focus group, student reflective work) to examine staff and student perceptions of the inquiry task, and how effective the task was in building students' information literacy. A \"Theory of Change\" evaluation methodology was used to define the scope of evaluation activities. Findings - The SCONUL Seven Pillars of Information Literacy model is used to structure the findings from the various evaluation methods. Students developed their knowledge of, and ability to search, appropriate academic resources, although they demonstrated a preference for searching via Google Scholar over Web of Knowledge. Originality/value - Students demonstrated through their reflective comments that they had developed significant abilities to compare and evaluate news stories and journal articles, although they reported a lack of confidence in these abilities. Postgraduate tutors thought the inquiry task was successful in developing students' information literacy and both students and staff responded positively to the ability to choose topics of interest to investigate.", "paper_title": "Information literacy through inquiry A Level One psychology module at the University of Sheffield", "paper_id": "WOS:000291912000007"}