{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "fuzzy_logic"}, {"score": 0.004781915513030716, "phrase": "breast_cancer_categorization"}, {"score": 0.0045726187330434025, "phrase": "computational_systems"}, {"score": 0.004312622975366676, "phrase": "medical_image_analysis"}, {"score": 0.004152288616186981, "phrase": "new_method"}, {"score": 0.004109600767747015, "phrase": "fuzzy_logic_concepts"}, {"score": 0.003984141889010296, "phrase": "image_description"}, {"score": 0.0037704502704526996, "phrase": "computer-aided_diagnosis_tool"}, {"score": 0.00373167377872746, "phrase": "bi-rads"}, {"score": 0.003693293499842943, "phrase": "breast_lesions"}, {"score": 0.003435426082776884, "phrase": "bi-rads_classification"}, {"score": 0.0032848684681050745, "phrase": "image_descriptor"}, {"score": 0.0030554300179552415, "phrase": "linguistic_variables"}, {"score": 0.002982557900944478, "phrase": "fuzzy_inference_system"}, {"score": 0.002931569771634119, "phrase": "membership_functions"}, {"score": 0.002803031561019101, "phrase": "statistical_analysis"}, {"score": 0.002707993764473537, "phrase": "different_classes"}, {"score": 0.0025537472239953807, "phrase": "resulting_evaluations"}, {"score": 0.002294686545883412, "phrase": "linguistic_rules"}, {"score": 0.00227890329511847, "phrase": "numerical_models"}, {"score": 0.0022168460543913787, "phrase": "tighter_connection"}, {"score": 0.0021714122348552747, "phrase": "computer_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-aided diagnosis", " Breast cancer", " Fuzzy logic", " Decision support", " Healthcare informatics"], "paper_abstract": "Background: Fuzzy logic can help reduce the difficulties faced by computational systems to represent and simulate the reasoning and the style adopted by radiologists in the process of medical image analysis. The study described in this paper consists of a new method that applies fuzzy logic concepts to improve the representation of features related to image description in order to make it semantically more consistent. Specifically, we have developed a computer-aided diagnosis tool for automatic BI-RADS categorization of breast lesions. The user provides parameters such as contour, shape and density and the system gives a suggestion about the BI-RADS classification. Methods: Initially, values of malignancy were defined for each image descriptor, according to the BI-RADS standard. When analyzing contour, for example, our method considers the matching of features and linguistic variables. Next, we created the fuzzy inference system. The generation of membership functions was carried out by the Fuzzy Omega algorithm, which is based on the statistical analysis of the dataset This algorithm maps the distribution of different classes in a set. Results: Images were analyzed by a group of physicians and the resulting evaluations were submitted to the Fuzzy Omega algorithm. The results were compared, achieving an accuracy of 76.67% for nodules and 83.34% for calcifications. Conclusions: The fit of definitions and linguistic rules to numerical models provided by our method can lead to a tighter connection between the specialist and the computer system, yielding more effective and reliable results. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Computer-aided diagnosis system based on fuzzy logic for breast cancer categorization", "paper_id": "WOS:000361412500034"}