{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "task_placement"}, {"score": 0.01220382087207383, "phrase": "virtual_machines"}, {"score": 0.0054055285460134425, "phrase": "virtual_computing_systems"}, {"score": 0.004220406575749275, "phrase": "application_scalability"}, {"score": 0.004190438004831167, "phrase": "application_performance"}, {"score": 0.003819599991449801, "phrase": "dynamic_adaptability"}, {"score": 0.0037789720824759503, "phrase": "development_and_deployment_oriented_parallel_computing"}, {"score": 0.003685840071638243, "phrase": "real-time_constraints"}, {"score": 0.0035949949979695063, "phrase": "feature_model"}, {"score": 0.003544088803300751, "phrase": "formal_description"}, {"score": 0.003383552654319383, "phrase": "different_layers"}, {"score": 0.0032418062548293745, "phrase": "goal_function"}, {"score": 0.003083899825125453, "phrase": "personal_preference"}, {"score": 0.0027025233739857374, "phrase": "tpvm"}, {"score": 0.002635850034826311, "phrase": "optimal_scheme"}, {"score": 0.002561658528837694, "phrase": "tevm"}, {"score": 0.00238516629826583, "phrase": "estimated_method"}, {"score": 0.0021049977753042253, "phrase": "guiding_significance"}], "paper_keywords": ["Virtual machine", " virtual computing systems", " performance", " feature model", " task placement", " task scheduling"], "paper_abstract": "Task placement and scheduling are traditionally studied in following aspects: resource utilization, application throughput, application execution latency and starvation, and recently, the studies are more on application scalability and application performance. A methodology for task placement and scheduling centered on tasks based on virtual machines is studied in this paper to improve the performances of systems and dynamic adaptability in applications development and deployment oriented parallel computing. For parallel applications with no real-time constraints, we describe a thought of feature model and make a formal description for four layers of task placement and scheduling. To place the tasks to different layers of virtual computing systems, we take the performances of four layers as the goal function in the model of task placement and scheduling. Furthermore, we take the personal preference, the application scalability for a designer in his (her) development and deployment, as the constraint of this model. The workflow of task placement and scheduling based on virtual machines has been discussed. Then, an algorithm TPVM is designed to work out the optimal scheme of the model, and an algorithm TEVM completes the execution of tasks in four layers. The experiments have been performed to validate the effectiveness of time estimated method and the feasibility and rationality of algorithms. It is seen from the experiments that our algorithms are better than other four algorithms in performance. The results show that the methodology presented in this paper has guiding significance to improve the efficiency of virtual computing systems.", "paper_title": "A Methodology for Task placement and Scheduling Based on Virtual Machines", "paper_id": "WOS:000296499700004"}