{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intrinsic_motivation"}, {"score": 0.04028465982960715, "phrase": "rehabilitation_process"}, {"score": 0.0046993598473345395, "phrase": "ankle_training"}, {"score": 0.00445830200258645, "phrase": "great_discomfort"}, {"score": 0.004404445045826858, "phrase": "long-term_effects"}, {"score": 0.0043161190928529755, "phrase": "future_health"}, {"score": 0.004144723510171449, "phrase": "wobble_boards"}, {"score": 0.004094639048362357, "phrase": "relatively_inexpensive_type"}, {"score": 0.003947973513495612, "phrase": "one's_ankles"}, {"score": 0.003171615440419782, "phrase": "games'_potential"}, {"score": 0.002900806476592644, "phrase": "wobble_board"}, {"score": 0.0028081546657056948, "phrase": "necessary_exercises"}, {"score": 0.0027295084882654917, "phrase": "ankle_rehabilitation"}, {"score": 0.002547535564922075, "phrase": "quantitative_test"}, {"score": 0.002416589459425828, "phrase": "needed_motivation"}, {"score": 0.002246292543825748, "phrase": "correct_ankle_training"}, {"score": 0.0021049977753042253, "phrase": "test_participants"}], "paper_keywords": [""], "paper_abstract": "Injuries to the ankle may be a source of great discomfort and the long-term effects can negatively influence the future health of the individual who has suffered the injury. Wobble boards represent a relatively inexpensive type of equipment that may be used to train one's ankles preventively or as part of the rehabilitation process once the damage has been done. However, individuals in need of such training frequently lack the motivation necessary in order to successfully complete the training or rehabilitation process. This paper details the design and implementation of a prototype intended to alleviate this problem by leveraging games' potential as a source of intrinsic motivation. More specifically, the prototype enables users to control a game by means of a wobble board, thus allowing them to perform the necessary exercises while playing. An expert on ankle rehabilitation assessed the efficacy of the training facilitated by the prototype, and 40 individuals partook in a quantitative test performed in order to determine whether the prototype could potentially provide the needed motivation. Based on the findings from the two tests, it is concluded that the prototype does ensure correct ankle training and the act of playing was experienced as intrinsically motivating by the majority of the test participants.", "paper_title": "Gameplay as a Source of Intrinsic Motivation for Individuals in Need of Ankle Training or Rehabilitation", "paper_id": "WOS:000304449500007"}