{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "epistemological_beliefs"}, {"score": 0.01050192559427679, "phrase": "online_peer_questioning"}, {"score": 0.007125594668200081, "phrase": "collaborative_summary"}, {"score": 0.006977512594317037, "phrase": "collaborative_argumentation"}, {"score": 0.005960132971886292, "phrase": "case_problems"}, {"score": 0.00468991337957911, "phrase": "current_study"}, {"score": 0.004243552607799184, "phrase": "web-based_learning_environments"}, {"score": 0.004047141845635495, "phrase": "educational_technology_course"}, {"score": 0.0035853745478488254, "phrase": "group_argument"}, {"score": 0.0033656930865509547, "phrase": "group_work"}, {"score": 0.003312901888725435, "phrase": "higher_comprehension"}, {"score": 0.003278167066287366, "phrase": "reading_materials"}, {"score": 0.0028734230458881903, "phrase": "interaction_effect"}, {"score": 0.002518525107994039, "phrase": "higher_quality_arguments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-supported collaborative learning", " Peer questioning", " Wikis", " Epistemological beliefs"], "paper_abstract": "The current study examines the assertion that students are motivated and learn more by carrying out tasks consistent with their epistemological beliefs in web-based learning environments. In the study, 120 undergraduate students in an educational technology course participated as part of their coursework. Using a wiki, triads reciprocally asked and responded to questions as constructing either a group summary or a group argument. Students with less advanced epistemological beliefs more actively coordinated formats and procedures for group work and achieved higher comprehension of reading materials in the collaborative summary than in the collaborative argumentation. By contrast, these differences were not found for students with more advanced epistemological beliefs. However, the interaction effect between tasks and epistemological beliefs disappeared for the quality of argumentation on case problems. Independently of epistemological beliefs, collaborative argumentation promoted more constructive and interactive peer questioning activities and helped to construct higher quality arguments in case problems than collaborative summary. Therefore, the effects of matching tasks and epistemological beliefs varied depending on types of learning outcomes (comprehension vs. argumentation) in online peer questioning. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "The role of tasks and epistemological beliefs in online peer questioning", "paper_id": "WOS:000283916000012"}