{"auto_keywords": [{"score": 0.04881990207677595, "phrase": "aggregation_functions"}, {"score": 0.00481495049065317, "phrase": "recurrent_neural_networks"}, {"score": 0.0047385702897315436, "phrase": "empirical_categorization"}, {"score": 0.004638602678192715, "phrase": "numerous_applications"}, {"score": 0.004540734419151103, "phrase": "-based_representations"}, {"score": 0.004421284843189731, "phrase": "feature_vectors"}, {"score": 0.004327981760540394, "phrase": "standard_machine_learning_methods"}, {"score": 0.004038076978795421, "phrase": "single_fixed-length_vector"}, {"score": 0.003571751184289622, "phrase": "baseline_results"}, {"score": 0.0035150223642728437, "phrase": "existing_rnns"}, {"score": 0.003404244237372396, "phrase": "order_invariant_aggregation_functions"}, {"score": 0.0022806798371116698, "phrase": "rnn_architectures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Recurrent Neural Networks", " Order invariance", " Aggregation"], "paper_abstract": "Numerous applications benefit from parts-based representations resulting in sets of feature vectors. To apply standard machine learning methods, these sets of varying cardinality need to be aggregated into a single fixed-length vector. We have evaluated three common Recurrent Neural Network (RNN) architectures, Elman, Williams & Zipser and Long Short Term Memory networks, on approximating eight aggregation functions of varying complexity. The goal is to establish baseline results showing whether existing RNNs can be applied to learn order invariant aggregation functions. The results indicate that the aggregation functions can be categorized according to whether they entail (a) selection of a subset of elements and/or (b) non-linear operations on the elements. We have found that RNNs can very well learn to approximate aggregation functions requiring either (a) or (b) and those requiring only linear sub functions with very high accuracy. However, the combination of (a) and (b) cannot be learned adequately by these RNN architectures, regardless of size and architecture. (C) 2010 IMACS. Published by Elsevier B.V. All rights reserved.", "paper_title": "Learning over sets with Recurrent Neural Networks: An empirical categorization of aggregation functions", "paper_id": "WOS:000298461600008"}