{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud_computing_infrastructures"}, {"score": 0.004637478829869904, "phrase": "cloud_resources"}, {"score": 0.004529881123652277, "phrase": "main_disadvantages"}, {"score": 0.004342430078306461, "phrase": "efficient_architectures"}, {"score": 0.004047020753789236, "phrase": "complete_set"}, {"score": 0.003229741076887148, "phrase": "real_world_settings"}, {"score": 0.0031399038722901788, "phrase": "real_cloud_computing_infrastructure"}, {"score": 0.0028047899594686003, "phrase": "empirical_comparison"}, {"score": 0.0025892330566358503, "phrase": "monpaas"}, {"score": 0.0024935968124910617, "phrase": "openstack"}, {"score": 0.0024014759148123736, "phrase": "best_architecture"}, {"score": 0.0021755038991725147, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cloud computing", " Architecture evaluation", " Infrastructure monitoring", " Service monitoring", " Infrastructure-as-a-Service", " Monitoring-as-a-Service"], "paper_abstract": "The lack of control over the cloud resources is one of the main disadvantages associated to cloud computing. The design of efficient architectures for monitoring such resources can help to overcome this problem. This contribution describes a complete set of architectures for monitoring cloud computing infrastructures, and provides a taxonomy of them. The architectures are described in detail, compared among them, and analysed in terms of performance, scalability, usage of resources, and security capabilities. The architectures have been implemented in real world settings and empirically validated against a real cloud computing infrastructure based on OpenStack. More than 1000 virtual machines (VMs) have been executed for more than 2 months in scenarios ranging between 18 and 24 simultaneous VMs in order to achieve the empirical comparison provided in this contribution. The implementation of all the monitoring architectures has been released to the community as MonPaaS, a public open source project for OpenStack. Also, some recommendations about the best architecture in terms of performance and security have been covered in this contribution as part of the analysis carried out. Crown Copyright (C) 2015 Published by Elsevier B.V. All rights reserved.", "paper_title": "Comparative analysis of architectures for monitoring cloud computing infrastructures", "paper_id": "WOS:000352174300002"}