{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "user-dependent_identification_authentication"}, {"score": 0.030996237718162283, "phrase": "pen-grasping_posture"}, {"score": 0.004598933498016774, "phrase": "video-based_identification_authentication_framework"}, {"score": 0.004426308135681733, "phrase": "pen-grasping_posture_analysis"}, {"score": 0.003976523732243618, "phrase": "pressure-sensitive_tablet"}, {"score": 0.003797978200741566, "phrase": "proposed_reliable_verification_method"}, {"score": 0.003683407561208816, "phrase": "pressure-sensitive_digitising_tablets"}, {"score": 0.0031121406603482112, "phrase": "video-based_handwritten_signature_verification"}, {"score": 0.0025694584194998335, "phrase": "signature_trajectories"}, {"score": 0.002435190484324197, "phrase": "modified_motion_energy_images"}, {"score": 0.0022041312401435346, "phrase": "low_false-rejection_rates"}, {"score": 0.0021705796895687864, "phrase": "low_false-acceptance_rates"}], "paper_keywords": [""], "paper_abstract": "This article proposes a video-based identification authentication framework via signature verification and pen-grasping posture analysis. The authors consider the case of using a camera instead of a pressure-sensitive tablet to acquire signatures. The proposed reliable verification method is useful when pressure-sensitive digitising tablets are not available. In addition, the authors can acquire more information in addition to the trajectories of the signature in video-based handwritten signature verification. The entire writing process and the pen-grasping posture are personalised features that cannot be easily imitated and forged. The authors analyse the signature trajectories using curvelets and the pen-grasping posture using modified motion energy images to perform user-dependent identification authentication. The proposed system is able to achieve both low false-rejection rates and low false-acceptance rates for database containing both unskilled and skilled imitation signatures.", "paper_title": "Video-based signature verification and pen-grasping posture analysis for user-dependent identification authentication", "paper_id": "WOS:000309959000003"}