{"auto_keywords": [{"score": 0.04035919930938948, "phrase": "rate-distortion_function"}, {"score": 0.027401781279336176, "phrase": "side_information"}, {"score": 0.022462010128639714, "phrase": "cr_constraint"}, {"score": 0.020354115406259015, "phrase": "hb_problem"}, {"score": 0.007118264540018082, "phrase": "decoder's_estimate"}, {"score": 0.004911458237740758, "phrase": "cascade_problem"}, {"score": 0.004839961133088358, "phrase": "rate-distortion_region"}, {"score": 0.00481495066943768, "phrase": "heegard-berger"}, {"score": 0.004733267566274583, "phrase": "common_reconstruction_constraints"}, {"score": 0.004723093742825198, "phrase": "final_node"}, {"score": 0.0046986841646790315, "phrase": "lossy_source_coding"}, {"score": 0.004609035203755789, "phrase": "intermediate_node"}, {"score": 0.0035379628447303703, "phrase": "cooperating_decoders"}, {"score": 0.0034187896011435245, "phrase": "encoder_broadcasting"}, {"score": 0.003385480888810982, "phrase": "respective_side_information"}, {"score": 0.0033607117763948873, "phrase": "cascade_source_coding_problem"}, {"score": 0.003319830633865628, "phrase": "two-hop_system"}, {"score": 0.003263428402502978, "phrase": "intermediate_and_final_nodes"}, {"score": 0.003122741472032058, "phrase": "side_information_sequences"}, {"score": 0.0029959845134510422, "phrase": "gaussian"}, {"score": 0.002951739421935396, "phrase": "quadratic_distortion_metric"}, {"score": 0.002873288586504574, "phrase": "hamming_distortion"}, {"score": 0.002468450551616404, "phrase": "corresponding_problem"}, {"score": 0.002420539890527584, "phrase": "outer_and_inner_bounds"}, {"score": 0.0021049977753042253, "phrase": "constrained_reconstruction"}], "paper_keywords": ["Cascade source coding", " common reconstruction (CR)", " Heegard-Berger (HB) problem", " source coding with side information"], "paper_abstract": "In lossy source coding with side information at the decoder (i.e., the Wyner-Ziv problem), the estimate of the source obtained at the decoder cannot be generally reproduced at the encoder, due to its dependence on the side information. In some applications, this may be undesirable, and a common reconstruction (CR) requirement, whereby one imposes that the encoder and decoder be able to agree on the decoder's estimate, may be instead in order. The rate-distortion function under the CR constraint has been derived recently for a point-to-point (Wyner-Ziv) problem. In this paper, this result is extended to three multiterminal settings with three nodes, namely the Heegard-Berger (HB) problem, its variant with cooperating decoders, and the cascade source coding problem. The HB problem consists of an encoder broadcasting to two decoders with respective side information. The cascade source coding problem is characterized by a two-hop system with side information available at the intermediate and final nodes. For the HB problem with the CR constraint, the rate-distortion function is derived under the assumption that the side information sequences are (stochastically) degraded. The rate-distortion function is also calculated explicitly for three examples, namely Gaussian source and side information with quadratic distortion metric, and binary source and side information with erasure and Hamming distortion metrics. The rate-distortion function is then characterized for the HB problem with cooperating decoders and (physically) degraded side information. For the cascade problem with the CR constraint, the rate-distortion region is obtained under the assumption that side information at the final node is physically degraded with respect to that at the intermediate node. For the latter two cases, it is worth emphasizing that the corresponding problem without the CR constraint is still open. Outer and inner bounds on the rate-distortion region are also obtained for the cascade problem under the assumption that the side information at the intermediate node is physically degraded with respect to that at the final node. For the three examples mentioned above, the bounds are shown to coincide. Finally, for the HB problem, the rate-distortion function is obtained under the more general requirement of constrained reconstruction, whereby the decoder's estimate must be recovered at the encoder only within some distortion.", "paper_title": "Heegard-Berger and Cascade Source Coding Problems With Common Reconstruction Constraints", "paper_id": "WOS:000315120400016"}