{"auto_keywords": [{"score": 0.029673016834524942, "phrase": "newton's_method"}, {"score": 0.00481495049065317, "phrase": "tree-like_qbds"}, {"score": 0.004752022662995341, "phrase": "pushdown_systems"}, {"score": 0.004299776199854382, "phrase": "ts-qbds"}, {"score": 0.004232396043643437, "phrase": "probabilistic_pushdown_systems"}, {"score": 0.004177049813981273, "phrase": "recursive_markov_chains"}, {"score": 0.00399420843228663, "phrase": "new_algorithmic_upper_and_lower_bounds"}, {"score": 0.003839510177926892, "phrase": "arbitrary_qbd"}, {"score": 0.003623352647973122, "phrase": "additive_error"}, {"score": 0.003446455900643722, "phrase": "unit-cost_rational_arithmetic_ram_model"}, {"score": 0.003356836689343337, "phrase": "decomposed_newton's_method"}, {"score": 0.0030051134531731793, "phrase": "encoding_size"}, {"score": 0.0028886123801902517, "phrase": "recent_results"}, {"score": 0.0026270572353632297, "phrase": "classic_condition_number"}, {"score": 0.0025926490547191487, "phrase": "linear_systems"}, {"score": 0.002498678935673443, "phrase": "strongly_connected_monotone_systems"}, {"score": 0.002440071551819324, "phrase": "quantitative_termination_decision_problem"}, {"score": 0.0021957487795963666, "phrase": "termination_probabilities"}, {"score": 0.00218419478369074, "phrase": "tl-qbds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Quasi-Birth-Death Processes", " Tree-Like QBDs", " Probabilistic 1-Counter Automata", " Pushdown Systems", " Newton's method"], "paper_abstract": "We begin by observing that (discrete-time) Quasi-Birth-Death Processes (QBDs) are equivalent, in a precise sense, to probabilistic 1-Counter Automata (p1CAs), and both Tree-Like QBDs (TL-QBDs) and Tree-Structured QBDs (TS-QBDs) are equivalent to both probabilistic Pushdown Systems (pPDSs) and Recursive Markov Chains (RMCs). We then proceed to exploit these connections to obtain a number of new algorithmic upper and lower bounds for central computational problems about these models. Our main result is this: for an arbitrary QBD, we can approximate its termination probabilities (i.e., its G matrix) to within i bits of precision (i.e., within additive error 1/2(i)), in time polynomial in both the encoding size of the QBD and in i, in the unit-cost rational arithmetic RAM model of computation. Specifically, we show that a decomposed Newton's method can be used to achieve this. We emphasize that this bound is very different from the well-known \"linear/quadratic convergence\" of numerical analysis, known for QBDs and TL-QBDs, which typically gives no constructive bound in terms of the encoding size of the system being solved. In fact, we observe (based on recent results) that for the more general TL-QBDs such a polynomial upper bound on Newton's method fails badly. Our upper bound proof for QBDs combines several ingredients: a detailed analysis of the structure of 1-Counter Automata, an iterative application of a classic condition number bound for errors in linear systems, and a very recent constructive bound on the performance of Newton's method for strongly connected monotone systems of polynomial equations. We show that the quantitative termination decision problem for QBDs (namely, \"is G(u,v) >= 1/2?\") is at least as hard as long-standing open problems in the complexity of exact numerical computation, specifically the square-root sum problem. On the other hand, it follows from our earlier results for RMCs that any non-trivial approximation of termination probabilities for TL-QBDs is sqrt-root-sum-hard. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Quasi-Birth Death Processes, Tree-Like QBDs, Probabilistic 1-Counter Automata, and Pushdown Systems", "paper_id": "WOS:000279521700006"}