{"auto_keywords": [{"score": 0.04768187184530004, "phrase": "self-interested_agents"}, {"score": 0.00994152900390187, "phrase": "five_methods"}, {"score": 0.00481495049065317, "phrase": "improve_cooperative_information_gathering"}, {"score": 0.004504193207111593, "phrase": "better_information"}, {"score": 0.004367581653370531, "phrase": "different_options"}, {"score": 0.0041703614123283165, "phrase": "individual_findings"}, {"score": 0.003961613484271729, "phrase": "substantial_improvement"}, {"score": 0.003921129887153952, "phrase": "overall_and_individual_expected_benefits"}, {"score": 0.0035201528214608914, "phrase": "fully_cooperative_ones"}, {"score": 0.0033096502887394233, "phrase": "potential_benefits"}, {"score": 0.002971016979295967, "phrase": "cooperative_information_gathering"}, {"score": 0.0026126405272417783, "phrase": "limited_sharing"}, {"score": 0.002546315584783112, "phrase": "resulting_substantial_improvement"}, {"score": 0.00250732953434891, "phrase": "equilibrium_individual_information_gathering_strategies"}, {"score": 0.002309242063033298, "phrase": "important_contribution"}, {"score": 0.0021487685525986094, "phrase": "wide_range"}, {"score": 0.0021049977753042253, "phrase": "improved_individual_expected_benefit"}], "paper_keywords": [""], "paper_abstract": "This paper considers the problem of cooperation between self-interested agents in acquiring better information regarding the nature of the different options and opportunities available to them. By sharing individual findings with others, the agents can potentially achieve a substantial improvement in overall and individual expected benefits. Unfortunately, it is well known that with self-interested agents equilibrium considerations often dictate solutions that are far from the fully cooperative ones, hence the agents do not manage to fully exploit the potential benefits encapsulated in such cooperation. In this paper we introduce, analyze and demonstrate the benefit of five methods aiming to improve cooperative information gathering. Common to all five that they constrain and limit the information sharing process. Nevertheless, the decrease in benefit due to the limited sharing is outweighed by the resulting substantial improvement in the equilibrium individual information gathering strategies. The equilibrium analysis given in the paper, which, in itself is an important contribution to the study of cooperation between self-interested agents, enables demonstrating that for a wide range of settings an improved individual expected benefit is achieved for all agents when applying each of the five methods.", "paper_title": "Constraining Information Sharing to Improve Cooperative Information Gathering", "paper_id": "WOS:000365179300001"}