{"auto_keywords": [{"score": 0.048339607507904336, "phrase": "high-level_cognitive_skills"}, {"score": 0.00481495049065317, "phrase": "knowledge_modules"}, {"score": 0.004335739075947899, "phrase": "changing_profile"}, {"score": 0.004001593118269276, "phrase": "information_and_communication_technologies"}, {"score": 0.0037854112749311844, "phrase": "teaching_practices"}, {"score": 0.003693103542455806, "phrase": "higher_education"}, {"score": 0.003558830226733501, "phrase": "methodological_framework"}, {"score": 0.0034720284451902083, "phrase": "disciplinary_course_modules"}, {"score": 0.0029937855454238507, "phrase": "primary_currents"}, {"score": 0.0029570303644956128, "phrase": "educational_psychology"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Improving classroom teaching", " Teaching strategies", " Learning strategies", " Collaborative learning", " Pedagogical issues"], "paper_abstract": "The changing profile of students, the expectations of business and the capabilities offered by Information and Communication Technologies (ICT) makes it necessary to change teaching practices, particularly in higher education. This paper proposes a methodological framework destined to force disciplinary course modules to evolve in order to integrate high-level cognitive skills and professional competencies. In this paper, we examine this Framework in terms of the primary currents in educational psychology: behaviorism, cognitivism, constructivism and social constructivism. We present and analyze three case studies showing the evolution of three disciplinary course modules. We show that the lessons taught in these three modules are more motivating and more efficient, producing results that are closer to what employers are asking of their employees. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Framework for the evolution of acquiring knowledge modules to integrate the acquisition of high-level cognitive skills and professional competencies: Principles and case studies", "paper_id": "WOS:000292437400013"}