{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cmos_bandgap_reference"}, {"score": 0.004747997855358171, "phrase": "low_dropout"}, {"score": 0.004552648949390462, "phrase": "low-power_bandgap_reference"}, {"score": 0.004224912982246114, "phrase": "ldo"}, {"score": 0.003587616378156851, "phrase": "zero_load"}, {"score": 0.0035376693476114733, "phrase": "power_consumption"}, {"score": 0.002622755848331379, "phrase": "temperature_coefficient"}, {"score": 0.0023223663501882917, "phrase": "reference_voltage"}, {"score": 0.002175099985348912, "phrase": "bgr"}, {"score": 0.002154835714714195, "phrase": "standard_digital_cmos_processes"}, {"score": 0.0021049977753042253, "phrase": "portable_and_switching_applications"}], "paper_keywords": ["CMOS bandgap", " low dropout", " source follower", " sub-1V"], "paper_abstract": "We present a low-power bandgap reference (BGR), functional from sub-1 V to 5 V supply voltage with either a low dropout (LDO) regulator or source follower (SF) output stage, denoted as the LDO or SF mode, in a 0.5-mu m standard digital CMOS process with V-tn approximate to 0.6 V and vertical bar V-tp vertical bar approximate to 0.7 V at 27 degrees C. Both modes operate at sub-1 V under zero load with a power consumption of around 26 mu W. At 1 V (1.1 V) supply, the LDO (SF) mode provides an output current up to 1.1 mA (0.35 mA), a load regulation of +/- 8.5 mV/mA (+/- 33 mV/mA) with approximately 10 mu s transient, a line regulation of +/- 4.2 mV/V (+/- 50 mu V/V), and a temperature compensated reference voltage of 0.228 V (0.235 V) with a temperature coefficient around 34 ppm/degrees C from -20 degrees C to 120 degrees C. At 1.5 V supply, the LDO (SF) mode can further drive up to 9.6 mA (3.2 mA) before the reference voltage falls to 90% of its nominal value. Such low-supply-voltage and high-current-driving BGR in standard digital CMOS processes is highly useful in portable and switching applications.", "paper_title": "A Sub-1 V, 26 mu W, Low-Output-Impedance CMOS Bandgap Reference With a Low Dropout or Source Follower Mode", "paper_id": "WOS:000292098600016"}