{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "proof_procedures"}, {"score": 0.004597622380240611, "phrase": "dialectic_proof_procedures"}, {"score": 0.004527371799277529, "phrase": "admissibility_semantics"}, {"score": 0.004481132747216135, "phrase": "assumption-based_argumentation"}, {"score": 0.004300830853119242, "phrase": "conventional_logic"}, {"score": 0.0041703614123283165, "phrase": "inference_rules"}, {"score": 0.003941319912895672, "phrase": "dialectic_argumentation_system"}, {"score": 0.003574830654211291, "phrase": "initial_set"}, {"score": 0.002940626369102927, "phrase": "search_strategy"}, {"score": 0.002708399936381754, "phrase": "backward_reasoning"}, {"score": 0.0023331227492950422, "phrase": "winning_strategy"}, {"score": 0.002250601866422547, "phrase": "non-deterministic_program"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["argumentation", " admissibility semantics", " dialectic", " proof procedure", " assumption-based reasoning", " dispute"], "paper_abstract": "We present a family of dialectic proof procedures for the admissibility semantics of assumption-based argumentation. These proof procedures are defined for any conventional logic formulated as a collection of inference rules and show how any such logic can be extended to a dialectic argumentation system. The proof procedures find a set of assumptions, to defend a given belief, by starting from an initial set of assumptions that supports an argument for the belief and adding defending assumptions incrementally to counter-attack all attacks. The proof procedures share the same notion of winning strategy for a dispute and differ only in the search strategy they use for finding it. The novelty of our approach lies mainly in its use of backward reasoning to construct arguments and potential arguments, and the fact that the proponent and opponent can attack one another before an argument is completed. The definition of winning strategy can be implemented directly as a non-deterministic program, whose search strategy implements the search for defences. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Dialectic proof procedures for assumption-based, admissible argumentation", "paper_id": "WOS:000234778500002"}