{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "operator's_cognitive_behavioral_models"}, {"score": 0.004508286991825192, "phrase": "monocular_camera"}, {"score": 0.004426607895888934, "phrase": "online_freehand_videos"}, {"score": 0.004378309349451268, "phrase": "hand_pose_tracker"}, {"score": 0.0043305354943056875, "phrase": "reliable_initial_pose"}, {"score": 0.004283280680222718, "phrase": "first_frame"}, {"score": 0.004236539316738291, "phrase": "novel_approach"}, {"score": 0.004025040955430234, "phrase": "paper_visualization"}, {"score": 0.003937649447496154, "phrase": "operators'_cognitive_behaviors"}, {"score": 0.0034642599795044445, "phrase": "main_contribution"}, {"score": 0.003327534497764259, "phrase": "first_time"}, {"score": 0.0032671775301001483, "phrase": "human-computer_interaction"}, {"score": 0.0030587884803931964, "phrase": "coarse-tuning_time"}, {"score": 0.0028116863172018593, "phrase": "operator's_hand_image"}, {"score": 0.002730488910300527, "phrase": "cognitive_behavior"}, {"score": 0.002710557619357275, "phrase": "operator's_hand"}, {"score": 0.002613056713968863, "phrase": "cognitive_behavioral_models"}, {"score": 0.0025468951021098717, "phrase": "cognitive_loads"}, {"score": 0.0024106932919085097, "phrase": "operators'_hand_poses"}, {"score": 0.0023496433751182162, "phrase": "high_dimensionality"}, {"score": 0.0021049977753042253, "phrase": "simulation_virtual_assembly_system"}], "paper_keywords": ["3D Freehand pose model", " Features extraction", " Initialization", " Visualization", " Cognitive behavioral models"], "paper_abstract": "Tracking, recognition and interaction based on 3D freehand are a part of our virtual assembly system, in which monocular camera is used to input online freehand videos and the hand pose tracker requires a reliable initial pose in the first frame. A novel approach to initializing 3D pose and position of freehand is put forward in this paper visualization of 3D hand model and modeling the operators' cognitive behaviors. Our approach is composed of three phases: hand posture recognition, coarse-tuning and fine-tuning. The operator moves his/her hand onto the to meet the needs of our virtual assembly system. The main contribution of this paper is that the three core techniques are for the first time integrated together, including human-computer interaction (HCI) in the process of initializing, projection of the 3D hand model in the period of coarse-tuning time. Then, the computer repeatedly fine-tunes the 3D hand model until the projection of the 3D hand model is completely superimposed onto the operator's hand image. We focus on exploring and modeling cognitive behavior of operator's hand upon which we design our initialization algorithm. Our research shows that cognitive behavioral models are not only beneficial to reducing cognitive loads for operators, because it makes the computers cater for the changes of the operators' hand poses, but also helpful to address high dimensionality of articulated 3D hand model. Our experimental results also show that the approach presented in this paper is easier, more pleasurable and satisfactory experience for the operators. Our initialization system has successfully been applied to our 3D freehand tracking system and a simulation virtual assembly system.", "paper_title": "3D-freehand-pose initialization based on operator's cognitive behavioral models", "paper_id": "WOS:000278135800021"}