{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scatter_plots"}, {"score": 0.04790331843683929, "phrase": "parallel_coordinates_plots"}, {"score": 0.009130552826709699, "phrase": "data_tables"}, {"score": 0.004668059458774745, "phrase": "previous_empirical_studies"}, {"score": 0.004188198923320451, "phrase": "value_retrieval"}, {"score": 0.004039423410198574, "phrase": "limited_advantage"}, {"score": 0.0037769520261285872, "phrase": "empirical_study"}, {"score": 0.0037188360359702182, "phrase": "user_performance"}, {"score": 0.0035866734383189396, "phrase": "response_time"}, {"score": 0.0031354779851351287, "phrase": "relative_merits"}, {"score": 0.0030083825666563898, "phrase": "common_base_line"}, {"score": 0.0027126684113045756, "phrase": "parallel_coordinate_plots"}, {"score": 0.0025625729433234623, "phrase": "value_retrieval_task"}, {"score": 0.002420762293555924, "phrase": "subjective_feedbacks"}, {"score": 0.002310578855290687, "phrase": "quantitative_analyses"}, {"score": 0.0022053994402287925, "phrase": "multiple_observational_and_analytical_tasks"}, {"score": 0.0021490449563443025, "phrase": "new_evidence"}, {"score": 0.0021049977753042253, "phrase": "prevailing_enthusiasm"}], "paper_keywords": [""], "paper_abstract": "Previous empirical studies for comparing parallel coordinates plots and scatter plots showed some uncertainty about their relative merits. Some of these studies focused on the task of value retrieval, where visualization usually has a limited advantage over reading data directly. In this paper, we report an empirical study that compares user performance, in terms of accuracy and response time, in the context of four different visualization tasks, namely value retrieval, clustering, outlier detection, and change detection. In order to evaluate the relative merits of the two types of plots with a common base line (i.e., reading data directly), we included three forms of stimuli, data tables, scatter plots, and parallel coordinate plots. Our results show that data tables are better suited for the value retrieval task, while parallel coordinates plots generally outperform the two other visual representations in three other tasks. Subjective feedbacks from the users are also consistent with the quantitative analyses. As visualization is commonly used for aiding multiple observational and analytical tasks, our results provided new evidence to support the prevailing enthusiasm for parallel coordinates plots in the field of visualization.", "paper_title": "A Multi-task Comparative Study on Scatter Plots and Parallel Coordinates Plots", "paper_id": "WOS:000358328200029"}