{"auto_keywords": [{"score": 0.0495037775396638, "phrase": "medication_errors"}, {"score": 0.039860121328897394, "phrase": "medication_orders"}, {"score": 0.00481495049065317, "phrase": "electronic_prescribing"}, {"score": 0.0043358695338488445, "phrase": "computerized_physician_order_entry_system"}, {"score": 0.004301046274139699, "phrase": "basic_clinical_decision_support"}, {"score": 0.004081385289516914, "phrase": "preventable_adverse_drug_events"}, {"score": 0.003951800212882157, "phrase": "time-series_design"}, {"score": 0.0038728990904778678, "phrase": "primary_outcome_measurements"}, {"score": 0.003216804708106142, "phrase": "significant_immediate_absolute_reduction"}, {"score": 0.0029792984108210525, "phrase": "mean_percentage"}, {"score": 0.0029553380263320195, "phrase": "admitted_patients"}, {"score": 0.002628747284714371, "phrase": "interrupted_time-series_design"}, {"score": 0.0024345529783611703, "phrase": "observed_underlying_negative_trend"}, {"score": 0.0024052270356036743, "phrase": "pre-cpoe_period"}, {"score": 0.0021220787047953093, "phrase": "direct_effect"}, {"score": 0.0021049977753042253, "phrase": "actual_patient_harm"}], "paper_keywords": [""], "paper_abstract": "Objective: This study evaluated the effect of a Computerized Physician Order Entry system with basic Clinical Decision Support (CPOE/CDSS) on the incidence of medication errors (MEs) and preventable adverse drug events (pADEs). Design: Interrupted time-series design. Measurements: The primary outcome measurements comprised the percentage of medication orders with one or more MEs and the percentage of patients with one or more pADEs. Results: Pre-implementation, the mean percentage of medication orders containing at least one ME was 55%, whereas this became 1.7% post-implementation. The introduction of CPOE/CDSS has led to a significant immediate absolute reduction of 40.3% (95% Cl: -45.13%; -35.48%) in medication orders with one or more errors. Pre-implementation, the mean percentage of admitted patients experiencing at least one pADE was 15.5%, as opposed to 7.3% post-implementation. However, this decrease could not be attributed to the introduction of CPOE/CDSS: taking into consideration the interrupted time-series design, the immediate change was not significant (-0.42%, 95% Cl: -15.52%; 14.68%) because of the observed underlying negative trend during the pre-CPOE period of -4.04% [95% Cl: -7.70%; -0.38%] per month. Conclusions: This study has shown that CPOE/CDSS reduces the incidence of medication errors. However, a direct effect on actual patient harm (pADEs) was not demonstrated. J Am Med Inform Assoc. 2009;16:816-825. DOI 10.1.197/jamia.M3099.", "paper_title": "The Influence that Electronic Prescribing Has on Medication Errors and Preventable Adverse Drug Events: an Interrupted Time-series Study", "paper_id": "WOS:000271730000008"}