{"auto_keywords": [{"score": 0.02303198152722746, "phrase": "texture_feature_vectors"}, {"score": 0.00481495049065317, "phrase": "invariant_ranklet_features"}, {"score": 0.004724708238414131, "phrase": "novel_invariant_texture_classification_method"}, {"score": 0.004244234872662471, "phrase": "ranklet_transform"}, {"score": 0.003934681262271618, "phrase": "relative_rank"}, {"score": 0.0038608868685001308, "phrase": "father"}, {"score": 0.00355665081072721, "phrase": "ranklet_images"}, {"score": 0.0034244153725855, "phrase": "different_resolutions"}, {"score": 0.003317970131738248, "phrase": "fanklet"}, {"score": 0.0028692628457408025, "phrase": "texture_feature_vector"}, {"score": 0.0027976491158911514, "phrase": "support_vector_machine"}, {"score": 0.0024654516678953658, "phrase": "vistex_datasets"}, {"score": 0.002419136901298873, "phrase": "proposed_method"}, {"score": 0.002186395051086251, "phrase": "svm_classifier"}, {"score": 0.0021049977753042253, "phrase": "original_images"}], "paper_keywords": ["ranklets", " support vector machine", " texture", " Brodatz", " VisTex"], "paper_abstract": "A novel invariant texture classification method is proposed. Invariance to linear/non-linear monotonic gray-scale transformations is achieved by submitting the image under study to the ranklet transform, an image processing technique relying on the analysis of the relative rank of pixels Father than on their gray-scale value. Some texture features are then extracted from the ranklet images resulting from the application at different resolutions and orientations of the Fanklet transform to the image. Invariance to 90 degrees-rotations is achieved by averaging, for each resolution, correspondent vertical, horizontal, and diagonal texture features. Finally, a texture class membership is assigned to the texture feature vector by using a Support vector machine (SVM) classifier. Compared to three recent methods found in literature and having being evaluated on the same Brodatz and Vistex datasets, the proposed method performs better. Also, invariance to linear/non-linear monotonic gray-scale transformations and 90 degrees-rotations are evidenced by training the SVM classifier on texture feature vectors formed from the original images, then testing it on texture feature vectors formed from contrast-enhanced, gamma-corrected, histogram-equalized, and 90 degrees-rotated images. (c) 2008 Elsevier B.V. All Fights reserved.", "paper_title": "Texture classification using invariant ranklet features", "paper_id": "WOS:000259712200010"}