{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "local_and_social_performances"}, {"score": 0.010490323772805274, "phrase": "multi-agent_societies"}, {"score": 0.004622783000449884, "phrase": "harmonious_multi-agent_society"}, {"score": 0.004336115760817672, "phrase": "agent_coordination"}, {"score": 0.0031111332159761344, "phrase": "unified_and_flexible_manner"}, {"score": 0.0030572112793962004, "phrase": "experimental_results"}, {"score": 0.002817639725689939, "phrase": "local_performance"}, {"score": 0.0027687904688616983, "phrase": "globally_social_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-agent Society", " Social performance", " Local performance", " Compatibility", " Coordination", " Unification trend"], "paper_abstract": "To realize a harmonious multi-agent society, in previous work there are always two separated methods to make agent coordination: individual-local balance perspective and individual-society balance perspective. The two separated methods may bring out the conflicts between local and social performances. To achieve the compatibility between the local and social performances, this paper combines the two perspectives together and makes trade-off between them. With our presented model, the individual, local and social concerns can be balanced well in a unified and flexible manner. The experimental results show that there are often situations in which it is better for the local performance if the globally social performance is improved, and vice versa; thus the two coordination perspectives are not conflictive but often bring out the better in each other. Therefore, it concludes that the local and social performances in multi-agent societies can be compatible if we combine the two coordination methods together. (c) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Compatibility between the local and social performances of multi-agent societies", "paper_id": "WOS:000263584100034"}