{"auto_keywords": [{"score": 0.025572630019904487, "phrase": "proposed_scheme"}, {"score": 0.00481495049065317, "phrase": "concurrent_cts"}, {"score": 0.004678785623021003, "phrase": "media_acquisition_process"}, {"score": 0.0046253989970108985, "phrase": "wireless_multicast"}, {"score": 0.003938650032712796, "phrase": "wireless_unicast"}, {"score": 0.0038713805573219297, "phrase": "packet_collisions"}, {"score": 0.0037617986040878342, "phrase": "wireless_multicast_scheme"}, {"score": 0.0032585499655442404, "phrase": "local_cell_level"}, {"score": 0.003130077012135034, "phrase": "new_mac_layer_protocol"}, {"score": 0.0030239842475439814, "phrase": "distributed_multicast_tree_construction_algorithm"}, {"score": 0.0028880836335117297, "phrase": "local_multicast_gain"}, {"score": 0.0026494723416072316, "phrase": "media_access_stage"}, {"score": 0.002294686545883412, "phrase": "considerable_improvement"}, {"score": 0.002268441347979241, "phrase": "multicast_turnaround_time"}, {"score": 0.0021416404045850224, "phrase": "network_topology_changes"}, {"score": 0.0021049977753042253, "phrase": "node_movements"}], "paper_keywords": ["Distributed multicast algorithm", " CTS Collision", " Spectrum spreading", " MAC protocols", " Robustness"], "paper_abstract": "Media acquisition process in wireless multicast requires that the sender obtains confirmation replies from a set of receivers. If replies are uncoordinated, the process can be much more time consuming than that of wireless unicast due to packet collisions. We propose a wireless multicast scheme that utilizes a novel concurrent Clear-To-Send (CTS) transmission method and a distributed multicast tree construction method. The concurrent CTS based MAC (Media Access Control) layer design can significantly reduce packet collisions and signaling overhead at the local cell level. Built on top of this new MAC layer protocol, we further propose a distributed multicast tree construction algorithm which grows the tree by maximizing the local multicast gain. The uniqueness of our algorithm is that the tree is constructed implicitly during the media access stage and the algorithm requires little additional message overhead. Extensive simulations are conducted to evaluate the performance of the proposed scheme. Our results indicate that the proposed scheme offers considerable improvement in multicast turnaround time and efficiency. The proposed scheme is also robust against network topology changes caused by node movements.", "paper_title": "An energy-efficient, distributed wireless multicast protocol based on concurrent CTS and N-2 connectivity", "paper_id": "WOS:000282914100014"}