{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "framing_effect"}, {"score": 0.013385318894321544, "phrase": "subjects'_level"}, {"score": 0.004415523687947897, "phrase": "internet_buyers'_attitude"}, {"score": 0.0038634281440398355, "phrase": "individual_decision_makers'_involvement_level"}, {"score": 0.0036597104126905437, "phrase": "individual_differences"}, {"score": 0.0036072171658966348, "phrase": "warning_messages"}, {"score": 0.0035683401689358993, "phrase": "experimental_results"}, {"score": 0.003529880686744397, "phrase": "significant_framing_effect"}, {"score": 0.0034792431564692997, "phrase": "positive_condition"}, {"score": 0.0034046409849387365, "phrase": "negative_condition"}, {"score": 0.003343691804204423, "phrase": "debiasing_effect"}, {"score": 0.0032957163929772716, "phrase": "warning_instructions"}, {"score": 0.0032018141503341365, "phrase": "positive_and_negative_conditions"}, {"score": 0.0031444844772458504, "phrase": "warning_message"}, {"score": 0.0029785631356166594, "phrase": "weak_and_strong_warning_conditions"}, {"score": 0.002852134080296829, "phrase": "people's_responses"}, {"score": 0.002468107263634476, "phrase": "high_involvement_participants"}, {"score": 0.0023462618437394616, "phrase": "weak_warning_message"}, {"score": 0.0023125643872311994, "phrase": "effective_debiasing_mechanism"}, {"score": 0.0021904435447196884, "phrase": "strong_warning_messages"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Framing effect", " Debias", " Experiment", " Warning", " Decision making", " Online consumer"], "paper_abstract": "This study reports on an experiment that examined the effect of message framing on the Internet buyers' attitude and purchase intention. The effect of two possible moderators in framing effect including warning about the possibilities of bias and the subjects' level of involvement were considered in the experiment. In addition, the influence of the individual decision makers' involvement level on the joint effect of warning and framing was also examined to understand the individual differences in sensitivity to warning messages. The experimental results suggested a significant framing effect that participants in positive condition revealed more favorable responses than their counterparts in negative condition. Further, the debiasing effect of prompting the warning instructions was observed. Differences between responses in positive and negative conditions were significant when no warning message was prompted, and the magnitude of framing effect was attenuated and eliminated in weak and strong warning conditions respectively. In addition, the effect of framing messages on people's responses was moderated by their level of involvement. Less involved participants were more susceptible to framing effect than more involved subjects. Finally, the debiasing effect of warning on message framing depended upon the subjects' level of involvement. The framing effect is diminished when high involvement participants were prompted with either weak or strong warning messages. For less involved participants, the prompt of weak warning message is not an effective debiasing mechanism to prevent the occurrence of framing effect. Only when they were exposed to strong warning messages can the framing effect be eliminated. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Debiasing the framing effect: The effect of warning and involvement", "paper_id": "WOS:000278895600009"}