{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "qr_codes"}, {"score": 0.022893348986787777, "phrase": "anesthesia_information_management_system"}, {"score": 0.004698000536608171, "phrase": "resident_case_log_management"}, {"score": 0.0041136473765874815, "phrase": "resident_case_logging"}, {"score": 0.0036194914688460656, "phrase": "logging_practices"}, {"score": 0.003462599815177726, "phrase": "qr_code_use"}, {"score": 0.003247868216333148, "phrase": "qr_code_introduction"}, {"score": 0.003091767402370757, "phrase": "remaining_residents"}, {"score": 0.002943147037670826, "phrase": "case_list"}, {"score": 0.002899965889623787, "phrase": "anesthesia_information_management_system_database"}, {"score": 0.002464709648714996, "phrase": "residents'_case"}, {"score": 0.0022005118194652704, "phrase": "medical_practice"}, {"score": 0.0021682027434117095, "phrase": "data_transfer"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Medical informatics", " Anesthesiology", " Medical records systems computerized", " Hospital information systems"], "paper_abstract": "Background: Quick response (QR) codes containing anesthesia syllabus data were introduced into an anesthesia information management system. The code was generated automatically at the conclusion of each case and available for resident case logging using a smartphone or tablet. The goal of this study was to evaluate the use and usability/user-friendliness of such system. Methods: Resident case logging practices were assessed prior to introducing the QR codes. QR code use and satisfactions amongst residents was reassessed at three and six months. Results: Before QR code introduction only 12/23 (52.2%) residents maintained a case log. Most of the remaining residents (9/23, 39.1%) expected to receive a case list from the anesthesia information management system database at the end of their residency. At three months and six months 17/26 (65.4%) and 15/25 (60.0%) residents, respectively, were using the QR codes. Satisfaction was rated as very good or good. Conclusions: QR codes for residents' case logging with smartphones or tablets were successfully introduced in an anesthesia information management system and used by most residents. QR codes can be successfully implemented into medical practice to support data transfer. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Integration of QR codes into an anesthesia information management system for resident case log management", "paper_id": "WOS:000349471500006"}