{"auto_keywords": [{"score": 0.035058070890390466, "phrase": "interval_volume"}, {"score": 0.015457069351653625, "phrase": "interval_volumes"}, {"score": 0.00918977985139089, "phrase": "minimal_isodiamond_hierarchy"}, {"score": 0.008514333371148724, "phrase": "significantly_less_memory"}, {"score": 0.00481495049065317, "phrase": "efficient_multiresolution_representations"}, {"score": 0.0045556080393342165, "phrase": "volume_data_sizes"}, {"score": 0.004516962628112147, "phrase": "processing_speed"}, {"score": 0.004328576620172575, "phrase": "tetrahedral_clusters"}, {"score": 0.004273601449537163, "phrase": "longest_edge_bisection"}, {"score": 0.003468053168607071, "phrase": "geometric_and_topological_information"}, {"score": 0.003211788912325178, "phrase": "first_multiresolution_model"}, {"score": 0.002850168497994985, "phrase": "second_model"}, {"score": 0.0026620655619396263, "phrase": "extracted_isosurface"}, {"score": 0.002561752783323717, "phrase": "faster_selective_refinement_queries"}, {"score": 0.0025291601927956765, "phrase": "original_multiresolution_scalar_field"}, {"score": 0.002465210678474529, "phrase": "dynamic_isovalue_modifications"}, {"score": 0.002372298201966367, "phrase": "intersected_isodiamonds"}, {"score": 0.0022731540640627307, "phrase": "relevant_isodiamond_hierarchy"}, {"score": 0.0022062235065459274, "phrase": "isodiamond_hierarchies"}, {"score": 0.0021504218042734677, "phrase": "indexed_representation"}, {"score": 0.0021049977753042253, "phrase": "full_resolution"}], "paper_keywords": ["Isosurfaces", " interval volumes", " multiresolution models", " longest edge bisection", " diamond hierarchies"], "paper_abstract": "Efficient multiresolution representations for isosurfaces and interval volumes are becoming increasingly important as the gap between volume data sizes and processing speed continues to widen. Our multiresolution scalar field model is a hierarchy of tetrahedral clusters generated by longest edge bisection that we call a hierarchy of diamonds. We propose two multiresolution models for representing isosurfaces, or interval volumes, extracted from a hierarchy of diamonds which exploit its regular structure. These models are defined by subsets of diamonds in the hierarchy that we call isodiamonds, which are enhanced with geometric and topological information for encoding the relation between the isosurface, or interval volume, and the diamond itself. The first multiresolution model, called a relevant isodiamond hierarchy, encodes the isodiamonds intersected by the isosurface, or interval volume, as well as their nonintersected ancestors, while the second model, called a minimal isodiamond hierarchy, encodes only the intersected isodiamonds. Since both models operate directly on the extracted isosurface or interval volume, they require significantly less memory and support faster selective refinement queries than the original multiresolution scalar field, but do not support dynamic isovalue modifications. Moreover, since a minimal isodiamond hierarchy only encodes intersected isodiamonds, its extracted meshes require significantly less memory than those extracted from a relevant isodiamond hierarchy. We demonstrate the compactness of isodiamond hierarchies by comparing them to an indexed representation of the mesh at full resolution.", "paper_title": "Isodiamond Hierarchies: An Efficient Multiresolution Representation for Isosurfaces and Interval Volumes", "paper_id": "WOS:000277650300006"}