{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mavis"}, {"score": 0.004564291332315995, "phrase": "collaborative_distance_learning_environment"}, {"score": 0.00443308765153716, "phrase": "new_model"}, {"score": 0.00436890075128947, "phrase": "algorithm_visualization_system"}, {"score": 0.004263972370406983, "phrase": "visualization_system"}, {"score": 0.004202223763361474, "phrase": "integral_part"}, {"score": 0.004141365648080381, "phrase": "broader_distance_learning_environment"}, {"score": 0.003685067218455088, "phrase": "expected_users"}, {"score": 0.0035100601949451028, "phrase": "multi-level_visualizations"}, {"score": 0.0031383410838018984, "phrase": "studied_materials"}, {"score": 0.002875027551180213, "phrase": "client_machines"}, {"score": 0.0026337482179592422, "phrase": "communication_loads"}, {"score": 0.00259554612218815, "phrase": "important_aspect"}, {"score": 0.0025578967205807843, "phrase": "distance_learning_environment"}, {"score": 0.0025331002386232014, "phrase": "collaboration_and_data_sharing"}], "paper_keywords": ["algorithm visualization", " algorithm animation", " distance learning", " collaboration"], "paper_abstract": "This paper presents a new model for an algorithm visualization system. Our model views the visualization system as an integral part of a broader distance learning environment. As such, it supports the heterogeneity of the Internet the visualization is expected to run on and the diversity of the expected users. It does so by defining several ways for handling multi-level visualizations. First, a visualization can run in various abstraction levels of the algorithm, depending on the familiarity of the students with the studied materials. Second, a visualization can use various levels of graphics, depending on the capabilities of the client machines. Third, the messages sent between the machines can be of various levels, depending on the communication loads. Another important aspect of a distance learning environment is collaboration and data sharing. Our model facilitates the collaboration between the students and the instructor and between the students themselves. Finally, this paper presents a system, MAVIS, that realizes the model, and demonstrates its use on several algorithms. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "MAVIS: A multi-level algorithm visualization system within a collaborative distance learning environment", "paper_id": "WOS:000255187300002"}