{"auto_keywords": [{"score": 0.04035198377468263, "phrase": "pais"}, {"score": 0.01612614939923904, "phrase": "pais."}, {"score": 0.009914764673062796, "phrase": "common_understanding"}, {"score": 0.00481495049065317, "phrase": "process-aware_information_systems_-_constitution"}, {"score": 0.0047468516620285525, "phrase": "future_directions"}, {"score": 0.004693063440166313, "phrase": "process-aware_information_systems"}, {"score": 0.004613516457919661, "phrase": "increased_attention"}, {"score": 0.004587300172928083, "phrase": "current_research"}, {"score": 0.004116440453049531, "phrase": "research_challenges"}, {"score": 0.004023619476547389, "phrase": "comprehensive_and_systematic_overview"}, {"score": 0.003528957477793481, "phrase": "security_controls"}, {"score": 0.003459191419478298, "phrase": "systematic_literature_review"}, {"score": 0.00308610073274614, "phrase": "systematic_mapping_approach"}, {"score": 0.002881793492919646, "phrase": "security_requirements"}, {"score": 0.0028490783932465288, "phrase": "access_control_mechanisms"}, {"score": 0.0028247853353817044, "phrase": "inter-organizational_scenarios"}, {"score": 0.0027296612757740707, "phrase": "security_concepts"}, {"score": 0.002570817338292482, "phrase": "open_research_challenges"}, {"score": 0.0024984517279573906, "phrase": "possible_solutions"}, {"score": 0.002442025065383455, "phrase": "comprehensive_review"}, {"score": 0.0024281181691350085, "phrase": "current_security_practice"}, {"score": 0.0023530305476484807, "phrase": "challenging_interdisciplinary_research_field"}, {"score": 0.0023329572140896237, "phrase": "research_methods"}, {"score": 0.0022287497627555895, "phrase": "rich_set"}, {"score": 0.0021971473452127126, "phrase": "access_control_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Business Process Management", " Business process security", " Process-Aware Information Systems", " Security", " Systematic literature review", " Workflow security"], "paper_abstract": "Context: Security in Process-Aware Information Systems (PAIS) has gained increased attention in current research and practice. However, a common understanding and agreement on security is still missing. In addition, the proliferation of literature makes it cumbersome to overlook and determine state of the art and further to identify research challenges and gaps. In summary, a comprehensive and systematic overview of state of the art in research and practice in the area of security in PAIS is missing. Objective: This paper investigates research on security in PAIS and aims at establishing a common understanding of terminology in this context. Further it investigates which security controls are currently applied in PAIS. Method: A systematic literature review is conducted in order to classify and define security and security controls in PAIS. From initially 424 papers, we selected in total 275 publications that related to security and PAIS between 1993 and 2012. Furthermore, we analyzed and categorized the papers using a systematic mapping approach which resulted into 5 categories and 12 security controls. Results: In literature, security in PAIS often centers on specific (security) aspects such as security policies, security requirements, authorization and access control mechanisms, or inter-organizational scenarios. In addition, we identified 12 security controls in the area of security concepts, authorization and access control, applications, verification, and failure handling in PAIS. Based on the results, open research challenges and gaps are identified and discussed with respect to possible solutions. Conclusion: This survey provides a comprehensive review of current security practice in PAIS and shows that security in PAIS is a challenging interdisciplinary research field that assembles research methods and principles from security and PAIS. We show that state of the art provides a rich set of methods such as access control models but still several open research challenges remain. (C) 2013 The Authors. Published by Elsevier B.V. All rights reserved.", "paper_title": "A systematic review on security in Process-Aware Information Systems - Constitution, challenges, and future directions", "paper_id": "WOS:000331353000001"}