{"auto_keywords": [{"score": 0.042782732344020774, "phrase": "reverse_engineering"}, {"score": 0.02937671093533993, "phrase": "source_code"}, {"score": 0.00481495049065317, "phrase": "knowledge_based_systems"}, {"score": 0.003867206750827, "phrase": "already_existing_system"}, {"score": 0.0037284065559949064, "phrase": "intricate_task"}, {"score": 0.003119659433566212, "phrase": "knowledge-based_systems"}, {"score": 0.002634031703695684, "phrase": "knowledge_base"}, {"score": 0.002403724423251419, "phrase": "graphic_representation"}, {"score": 0.002370955769074803, "phrase": "unified_modeling_language"}, {"score": 0.0021537217025910356, "phrase": "test_cases"}, {"score": 0.0021049977753042253, "phrase": "reverse_engineering_process"}], "paper_keywords": [""], "paper_abstract": "Reverse engineering, also called reengineering, is used to modify systems that have functioned for many years, but which can no longer accomplish their intended tasks and, therefore, need to be updated. Reverse engineering can support the modification and extension of the knowledge in an already existing system. However, this can be an intricate task for a large, complex and poorly documented knowledge-based system. The rules in the knowledge base must be gathered, analyzed and understood, but also checked for verification and validation. We introduce an approach that uses reverse engineering for the knowledge in knowledge-based systems. The knowledge is encapsulated in rules, facts and conclusions, and in the relationships between them. Reverse engineering also collects functionality and source code. The outcome of reverse engineering is a model of the knowledge base, the functionality and the source code connected to the rules. These models are presented in diagrams using a graphic representation similar to Unified Modeling Language and employing ontology. Ontology is applied on top of rules, facts and relationships. From the diagrams, test cases are generated during the reverse engineering process and adopted to verify and validate the system.", "paper_title": "Using reengineering for knowledge based systems", "paper_id": "WOS:000250839700004"}