{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "intelligent_product_manuals"}, {"score": 0.04334736474777171, "phrase": "just-in-time_support"}, {"score": 0.03475977605571358, "phrase": "product_data"}, {"score": 0.004407813106104401, "phrase": "interactive_product_support_systems"}, {"score": 0.004339609346924681, "phrase": "product_life-cycle_information"}, {"score": 0.0038304902197108643, "phrase": "main_phases"}, {"score": 0.003398548324740385, "phrase": "ipm"}, {"score": 0.0031762308449055305, "phrase": "knowledge_base"}, {"score": 0.0029072537537959374, "phrase": "user's_requirements"}, {"score": 0.0027886573969044042, "phrase": "expert_knowledge"}, {"score": 0.002422890839801611, "phrase": "user-tailored_and_task-specific_product_support"}, {"score": 0.002171836484200008, "phrase": "-terrain_forklift_trucks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["intelligent product support", " technical manuals", " knowledge-based systems", " integration of knowledge", " knowledge models"], "paper_abstract": "This paper outlines a methodology for developing intelligent product manuals (IPMs). They are computerised interactive product support systems that employ product life-cycle information, expert knowledge, and hypermedia to provide just-in-time support to the user during the life of a product. The methodology describes the main phases in the development of an IPM. These are specification of requirements, construction of the team responsible for the production of the IPM, collection and structuring of product data and knowledge, development of the knowledge base, authoring, verification, evaluation, publishing and maintenance. The emphasis is on the user's requirements, integration of product data, utilisation of expert knowledge and the mechanisms for providing just-in-time support. The methodology explains how knowledge about products, users, and their tasks can be integrated and used to deliver user-tailored and task-specific product support. The solutions proposed in the paper are illustrated with examples based on prototypes developed for a manufacturer of all-terrain forklift trucks. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A methodology for developing intelligent product manuals", "paper_id": "WOS:000240857500007"}