{"auto_keywords": [{"score": 0.04938419617030255, "phrase": "artificial_neural_network"}, {"score": 0.00481495049065317, "phrase": "infrared_spectroscopy"}, {"score": 0.004159763048814389, "phrase": "synchronous_and_rapid_determination"}, {"score": 0.0038946650372062783, "phrase": "rifampicin_tablets"}, {"score": 0.0035671997165370403, "phrase": "levenberg-marquardt_training_algorithm"}, {"score": 0.0035153544006182834, "phrase": "log-sigmoid_transfer_function"}, {"score": 0.002992313172550772, "phrase": "new_evaluation_criterion"}, {"score": 0.002720505061804933, "phrase": "predicted_results"}, {"score": 0.002565626044684815, "phrase": "suitable_topologic_structure_parameters"}, {"score": 0.0025098414374397308, "phrase": "best_numbers"}, {"score": 0.002401875938287542, "phrase": "bp_networks"}, {"score": 0.0021049977753042253, "phrase": "square_error"}], "paper_keywords": [""], "paper_abstract": "This paper has investigated the application of near infrared (NIR) spectroscopy with artificial neural network (ANN) for synchronous and rapid determination of rifampicin, isoniazid and pyrazinamide in compound rifampicin tablets. We have developed Back-Propagation (BP) Networks which adopted Levenberg-Marquardt training algorithm and Log-sigmoid transfer function basing on NIR spectra of samples and contents of rifampicin, isoniazid and pyrazinamide. The degree of approximation, a new evaluation criterion of the network was employed, which proved the accuracy of the predicted results. The BP Networks have been optimized by selecting suitable topologic structure parameters and the best numbers of training. Using these BP Networks for predicting the amounts of rifampicin, isoniazid and pyrazinamide in prediction set, the root mean square error of prediction (RMSEP) are 0.00668, 0.00508 and 0.00680. These results demonstrate that this method is feasible. This method is convenient, rapid, has no pretreatment and no pollution.", "paper_title": "Rapid determination of compound rifampicin tablets using near infrared spectroscopy with artificial neural network", "paper_id": "WOS:000237642900102"}