{"auto_keywords": [{"score": 0.02764241852575682, "phrase": "contrasting_viewpoints"}, {"score": 0.004817940959278263, "phrase": "bias"}, {"score": 0.0047386923107107645, "phrase": "controversial_topics"}, {"score": 0.0044990584725586764, "phrase": "deeper_understanding"}, {"score": 0.003611751858608048, "phrase": "confirmation_bias"}, {"score": 0.0034841647157189985, "phrase": "controversial_topic"}, {"score": 0.003456427643307907, "phrase": "human_biases"}, {"score": 0.003190878119415192, "phrase": "interesting_challenge"}, {"score": 0.0028076592725295646, "phrase": "additional_information"}, {"score": 0.0027852927366010406, "phrase": "controversial_claims"}, {"score": 0.002752075650871066, "phrase": "unbiased_fashion"}, {"score": 0.0026760974046034854, "phrase": "user_study"}, {"score": 0.002581477142020187, "phrase": "source_expertise_ratings"}, {"score": 0.0025101968585850474, "phrase": "evidence_documents"}, {"score": 0.0023545567809591804, "phrase": "contrasting_evidence"}, {"score": 0.0023079225317714815, "phrase": "well-rounded_understanding"}, {"score": 0.002244178699939059, "phrase": "explicit_knowledge"}, {"score": 0.0021049977753042253, "phrase": "evidence_document"}], "paper_keywords": ["human computer interaction", " content analysis", " information dissemination"], "paper_abstract": "Deciding whether a claim is true or false often requires a deeper understanding of the evidence supporting and contradicting the claim. However, when presented with many evidence documents, users do not necessarily read and trust them uniformly. Psychologists and other researchers have shown that users tend to follow and agree with articles and sources that hold viewpoints similar to their own, a phenomenon known as confirmation bias. This suggests that when learning about a controversial topic, human biases and viewpoints about the topic may affect what is considered \"trustworthy\" or credible. It is an interesting challenge to build systems that can help users overcome this bias and help them decide the truthfulness of claims. In this article, we study various factors that enable humans to acquire additional information about controversial claims in an unbiased fashion. Specifically, we designed a user study to understand how presenting evidence with contrasting viewpoints and source expertise ratings affect how users learn from the evidence documents. We find that users do not seek contrasting viewpoints by themselves, but explicitly presenting contrasting evidence helps them get a well-rounded understanding of the topic. Furthermore, explicit knowledge of the credibility of the sources and the context in which the source provides the evidence document not only affects what users read but also whether they perceive the document to be credible.", "paper_title": "Overcoming Bias to Learn About Controversial Topics", "paper_id": "WOS:000357817600009"}