{"auto_keywords": [{"score": 0.03655467446128729, "phrase": "bimodal_perceptual_architecture"}, {"score": 0.02839450905400057, "phrase": "recurrent_connections"}, {"score": 0.00481495049065317, "phrase": "internal_simulation_of_perceptions"}, {"score": 0.004594951819987416, "phrase": "neural_network_architectures"}, {"score": 0.004294724955301414, "phrase": "associative_self-organizing"}, {"score": 0.004098397888277889, "phrase": "perceptual_neural_network"}, {"score": 0.003693533648584145, "phrase": "arbitrary_number"}, {"score": 0.0033633514001658086, "phrase": "action_neural_network"}, {"score": 0.0032940691998512963, "phrase": "delta_rule"}, {"score": 0.0029224275921964724, "phrase": "appropriate_sequences"}, {"score": 0.0028921584725218642, "phrase": "activity_patterns"}, {"score": 0.0028178463431115562, "phrase": "sensory_input"}, {"score": 0.002592606058287124, "phrase": "training_samples"}, {"score": 0.0025259712348798323, "phrase": "test_samples"}], "paper_keywords": [""], "paper_abstract": "We present a study of neural network architectures able to internally simulate perceptions and actions. All these architectures employ the novel Associative Self-Organizing Map (A-SOM) as a perceptual neural network. The A-SOM develops a representation of its input space, but in addition also learns to associate its activity with an arbitrary number of additional (possibly delayed) inputs. One architecture is a bimodal perceptual architecture whereas the others include an action neural network adapted by the delta rule. All but one architecture are recurrently connected. We have tested the architectures with very encouraging simulation results. The bimodal perceptual architecture was able to simulate appropriate sequences of activity patterns in the absence of sensory input for several epochs in both modalities. The architecture without recurrent connections correctly classified 100% of the training samples and 80% of the test samples. After ceasing to receive any input the best of the architectures with recurrent connections was able to continue to produce 100% correct output sequences for 28 epochs (280 iterations), and then to continue with 90% correct output sequences until epoch 42.", "paper_title": "Internal Simulation of Perceptions and Actions", "paper_id": "WOS:000293603200008"}