{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "iterative_optimization"}, {"score": 0.004743423032820112, "phrase": "popular_compiler_optimization_approach"}, {"score": 0.004420397388608833, "phrase": "icc"}, {"score": 0.0043677654541943505, "phrase": "gcc"}, {"score": 0.004047296286849109, "phrase": "best_compiler_optimizations"}, {"score": 0.0038810583785936505, "phrase": "first_time"}, {"score": 0.003526186748088922, "phrase": "kdatasets"}, {"score": 0.003311067956326299, "phrase": "compiler_optimizations"}, {"score": 0.0032326031622964477, "phrase": "best_possible_speedup"}, {"score": 0.0031654739035313776, "phrase": "intel"}, {"score": 0.0031277329861565525, "phrase": "gnu"}, {"score": 0.003071965703296204, "phrase": "optimal_combination"}, {"score": 0.0028844769395018595, "phrase": "highest_optimization_level"}, {"score": 0.0025660347613972573, "phrase": "compiler_choice"}, {"score": 0.0024311346712789553, "phrase": "different_programs"}, {"score": 0.00241658945942583, "phrase": "different_compilers"}, {"score": 0.0023381288193776778, "phrase": "optimal_combinations"}, {"score": 0.0021049977753042253, "phrase": "irreplaceable_and_important_compiler_strategy"}], "paper_keywords": ["Design", " Experimentation", " Measurement", " Performance", " Compiler optimization", " Benchmarking", " Iterative optimization"], "paper_abstract": "Iterative optimization is a popular compiler optimization approach that has been studied extensively over the past decade. In this article, we deconstruct iterative optimization by evaluating whether it works across datasets and by analyzing why it works. Up to now, most iterative optimization studies are based on a premise which was never truly evaluated: that it is possible to learn the best compiler optimizations across datasets. In this article, we evaluate this question for the first time with a very large number of datasets. We therefore compose KDataSets, a dataset suite with 1000 datasets for 32 programs, which we release to the public. We characterize the diversity of KDataSets, and subsequently use it to evaluate iterative optimization. For all 32 programs, we find that there exists at least one combination of compiler optimizations that achieves at least 83% or more of the best possible speedup across all datasets on two widely used compilers (Intel's ICC and GNU's GCC). This optimal combination is program-specific and yields speedups up to 3.75x (averaged across datasets of a program) over the highest optimization level of the compilers (-O3 for GCC and -fast for ICC). This finding suggests that optimizing programs across datasets might be much easier than previously anticipated. In addition, we evaluate the idea of introducing compiler choice as part of iterative optimization. We find that it can further improve the performance of iterative optimization because different programs favor different compilers. We also investigate why iterative optimization works by analyzing the optimal combinations. We find that only a handful optimizations yield most of the speedup. Finally, we show that optimizations interact in a complex and sometimes counterintuitive way through two case studies, which confirms that iterative optimization is an irreplaceable and important compiler strategy.", "paper_title": "Deconstructing Iterative Optimization", "paper_id": "WOS:000309671700009"}