{"auto_keywords": [{"score": 0.03320243009253214, "phrase": "one-constraint_case"}, {"score": 0.00481495049065317, "phrase": "scientific_computing"}, {"score": 0.004687159050154687, "phrase": "widely_used_tool"}, {"score": 0.004651271219032404, "phrase": "one-constraint_domain_decomposition"}, {"score": 0.00451043437607004, "phrase": "multi-dimensional_data"}, {"score": 0.0037792227071149985, "phrase": "mesh_elements"}, {"score": 0.003735862292632131, "phrase": "nearly_perfect_load_balancing"}, {"score": 0.0036646935906338414, "phrase": "reasonable_partition_surface_sizes"}, {"score": 0.0034725269588525534, "phrase": "two-constraint_settings"}, {"score": 0.0032777653153451265, "phrase": "splitting_operation"}, {"score": 0.003093893243443715, "phrase": "perfect_balancing"}, {"score": 0.002853620962601042, "phrase": "induced_surface_sizes"}, {"score": 0.0027670642397888494, "phrase": "multiple_strategies"}, {"score": 0.0026117657828249137, "phrase": "heuristic_algorithm"}, {"score": 0.002344762593995099, "phrase": "metis_software_package"}, {"score": 0.002273605493468005, "phrase": "higher_surface_sizes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Space Filling Curves", " Two-constraint domain decomposition"], "paper_abstract": "In scientific computing, Space Filling Curves are a widely used tool for one-constraint domain decomposition. They provide a mechanism to sort multi-dimensional data in a locality preserving way, and, in this way, a (one dimensional) list of mesh elements is established which is subsequently split into 3 partitions under consideration of the constraint. This procedure has a runtime of O(NlogN) (N is the number of mesh elements) while nearly perfect load balancing can be established with reasonable partition surface sizes. In this work, we discuss the extensibility of this procedure to two-constraint settings which is desirable, since the methodology is extremely fast. Here, the splitting operation is subject to two constraints, and, unlike to the one-constraint case, obtaining near perfect balancing is often hard to establish, and is, even more as in the one-constraint case, in conflict with the induced surface sizes (or edge-cuts). We discuss multiple strategies to tackle the splitting, and we present a fast, O(NlogN) splitting heuristic algorithm which provides an integer a that allows to trade off between balancing and surface sizes which results in a O(NlogN) two-constraint decomposition method. Results are compared to the multi-constraint domain decomposition abilities implemented in the Metis software package, and show that the method produces higher surface sizes, but is orders of magnitudes faster which makes the method superior for certain applications. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Two-constraint domain decomposition with Space Filling Curves", "paper_id": "WOS:000292412200001"}