{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "-inspired_long-term_data"}, {"score": 0.004611554879923759, "phrase": "growing_volumes"}, {"score": 0.004471530397729526, "phrase": "digital_content"}, {"score": 0.004335739075947899, "phrase": "clear_need"}, {"score": 0.0041269626762569095, "phrase": "relevant_information"}, {"score": 0.003832423454781517, "phrase": "evolving_context_information"}, {"score": 0.0034935290662899488, "phrase": "human_brain"}, {"score": 0.0029753513692467315, "phrase": "redundant_information"}, {"score": 0.002849442549612025, "phrase": "forgetful_digital_memory"}, {"score": 0.0026622351303038885, "phrase": "human_remembering"}, {"score": 0.0023967582707115354, "phrase": "multi-faceted_information_assessment"}, {"score": 0.002225426912273257, "phrase": "\"keep-it-all\"_strategy"}, {"score": 0.0021049977753042253, "phrase": "important_content"}], "paper_keywords": [""], "paper_abstract": "With the growing volumes of and reliance on digital content, there is a clear need for better information management approaches that keep relevant information accessible and usable in long-term encapsulated together with the evolving context information that is needed for its interpretation. Inspired by the role of forgetting in the human brain, in this paper, we envision a concept of managed forgetting for systematically dealing with information that progressively ceases in importance and also with redundant information - leading to a form of Forgetful Digital Memory. Managed forgetting is meant to complement rather than copy human remembering and forgetting. It can be regarded as functions of attention and significance dynamics relying on multi-faceted information assessment. Its goal is to introduce an alternative to the dominating \"keep-it-all\" strategy for digital content, which ensures that the important content is kept safe, useful, and understandable over time.", "paper_title": "Forgetful Digital Memory: Towards Brain-Inspired Long-Term Data and Information Management", "paper_id": "WOS:000364948700007"}