{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "upper_and_lower_membership_functions"}, {"score": 0.004076352180903171, "phrase": "general_matching_algorithm"}, {"score": 0.003244050414264445, "phrase": "proposed_matching_procedure"}, {"score": 0.003145417398038261, "phrase": "experimental_methodology"}, {"score": 0.002938821840519756, "phrase": "experimental_results"}, {"score": 0.0028670988845838296, "phrase": "proposed_methodology"}, {"score": 0.0026133424923929227, "phrase": "suitable_classification_problem_instances"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Interval type-2 fuzzy sets", " Similarity and dissimilarity measures", " Distinguishability of interval type-2 fuzzy sets", " Unconventional pattern classification"], "paper_abstract": "In this paper, we deal with the problem of classification of interval type-2 fuzzy sets through evaluating their distinguishability. To this end, we exploit a general matching algorithm to compute their similarity measure. The algorithm is based on the aggregation of two core similarity measures applied independently on the upper and lower membership functions of the given pair of interval type-2 fuzzy sets that are to be compared. Based on the proposed matching procedure, we develop an experimental methodology for evaluating the distinguishability of collections of interval type-2 fuzzy sets. Experimental results on evaluating the proposed methodology are carried out in the context of classification by considering interval type-2 fuzzy sets as patterns of suitable classification problem instances. We show that considering only the upper and lower membership functions of interval type-2 fuzzy sets is sufficient to (i) accurately discriminate between them and (ii) judge and quantify their distinguishability. (C) 2014 Elsevier B. V. All rights reserved.", "paper_title": "Distinguishability of interval type-2 fuzzy sets data by analyzing upper and lower membership functions", "paper_id": "WOS:000331545600008"}