{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "thesaurus_size"}, {"score": 0.012361432652157521, "phrase": "different_thesauri"}, {"score": 0.010750074737100275, "phrase": "thesaurus_database"}, {"score": 0.0047144599471419975, "phrase": "thesaurus"}, {"score": 0.004551563730037998, "phrase": "data_warehousing"}, {"score": 0.004519665344659923, "phrase": "semantic_query_processing_and_schema_matching"}, {"score": 0.004183137595671171, "phrase": "semantic_correspondence"}, {"score": 0.003968112038249246, "phrase": "identical_knowledge_domain"}, {"score": 0.003817456968395921, "phrase": "schema_matching"}, {"score": 0.0037508743235608872, "phrase": "specific_knowledge_field"}, {"score": 0.0033868916699805224, "phrase": "new_method"}, {"score": 0.0031455000569352454, "phrase": "individual_shared_elements"}, {"score": 0.002941913249957503, "phrase": "efficient_algorithm"}, {"score": 0.002501793273494325, "phrase": "positive_results"}, {"score": 0.0024842242921857705, "phrase": "average_precision_of"}, {"score": 0.0022192891418394514, "phrase": "exact_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Schema matching", " Thesaurus", " Information Retrieval", " Searching", " Performance", " Text similarity", " Structured vocabulary"], "paper_abstract": "Thesaurus is used in many Information Retrieval (IR) applications such as data integration, data warehousing, semantic query processing and schema matching. Schema matching or mapping is one of the most important basic steps in data integration. It is the process of identifying the semantic correspondence or equivalent between two or more schemas. Considering the fact of the existence of many thesauri for identical knowledge domain, the quality and the change in the results of schema matching when using different thesauri in specific knowledge field are not predictable. In this research, we studied the effect of thesaurus size on schema matching quality by conducting many experiments using different thesauri. In addition, a new method in calculating the similarity between vectors extracted from thesaurus database is proposed. The method is based on the ratio of individual shared elements to the elements in the compound set of the vectors. Moreover, we explained in details the efficient algorithm used in searching thesaurus database. After describing the experiments, results that show enhancement in the average of the similarity is presented. The completeness, effectiveness, and their harmonic mean measures were calculated to quantify the quality of matching. Experiments on two different thesauri show positive results with average Precision of 35% and a less value in the average of Recall. The effect of thesaurus size on the quality of matching was statically insignificant; however, other factors affecting the output and the exact value of change are still in the focus of our future study. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Effect of thesaurus size on schema matching quality", "paper_id": "WOS:000345817600019"}