{"auto_keywords": [{"score": 0.03696700047294347, "phrase": "presburger_arithmetic"}, {"score": 0.004814971944570536, "phrase": "mccarthy"}, {"score": 0.00469159356595623, "phrase": "mathematical_science"}, {"score": 0.004531997388646422, "phrase": "computer_science"}, {"score": 0.0042656009036320585, "phrase": "program_analysis"}, {"score": 0.003828091961373454, "phrase": "ground_literals"}, {"score": 0.0035410467987580484, "phrase": "algebraic_structure"}, {"score": 0.0033471722682967046, "phrase": "additional_symbols"}, {"score": 0.0030693625816617044, "phrase": "available_decision_procedures"}, {"score": 0.0029519664912853938, "phrase": "automatic_instantiation_strategies"}, {"score": 0.002863762666256937, "phrase": "satisfiability_problem"}, {"score": 0.0026603411931700556, "phrase": "available_procedures"}, {"score": 0.002525489173110693, "phrase": "existing_techniques"}, {"score": 0.0024288443150616056, "phrase": "proposed_methods"}, {"score": 0.0022957232752482196, "phrase": "rewriting-based_theorem"}, {"score": 0.002169882514603539, "phrase": "theories_communities"}, {"score": 0.0021325650133686516, "phrase": "decision_procedures"}], "paper_keywords": ["constraint satisfiability problems", " decision procedures", " combination methods", " instantiation strategies", " theory of arrays with extensionality", " presburger arithmetic"], "paper_abstract": "The theory of arrays, introduced by McCarthy in his seminal paper \"Towards a mathematical science of computation,\" is central to Computer Science. Unfortunately, the theory alone is not sufficient for many important verification applications such as program analysis. Motivated by this observation, we study extensions of the theory of arrays whose satisfiability problem (i.e., checking the satisfiability of conjunctions of ground literals) is decidable. In particular, we consider extensions where the indexes of arrays have the algebraic structure of Presburger arithmetic and the theory of arrays is augmented with axioms characterizing additional symbols such as dimension, sortedness, or the domain of definition of arrays. We provide methods for integrating available decision procedures for the theory of arrays and Presburger arithmetic with automatic instantiation strategies which allow us to reduce the satisfiability problem for the extension of the theory of arrays to that of the theories decided by the available procedures. Our approach aims to re-use as much as possible existing techniques so as to ease the implementation of the proposed methods. To this end, we show how to use model-theoretic, rewriting-based theorem proving (i.e., superposition), and techniques developed in the Satisfiability Modulo Theories communities to implement the decision procedures for the various extensions.", "paper_title": "Decision procedures for extensions of the theory of arrays", "paper_id": "WOS:000248940100002"}