{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "emotional_competence"}, {"score": 0.008720343234966442, "phrase": "general_users"}, {"score": 0.007647964109859035, "phrase": "online_game_use"}, {"score": 0.006384869520939972, "phrase": "emotional_intelligence"}, {"score": 0.005525486108326459, "phrase": "high-risk_users"}, {"score": 0.004533142516832776, "phrase": "cross-sectional_descriptive_survey"}, {"score": 0.004242085112539693, "phrase": "south_korea"}, {"score": 0.004091248980678087, "phrase": "positive_emotion"}, {"score": 0.004042166795461166, "phrase": "emotional_expression"}, {"score": 0.0036479584876742085, "phrase": "excessive_online_game_use"}, {"score": 0.0033895917080039337, "phrase": "online_games"}, {"score": 0.0032722454818973823, "phrase": "female_adolescents"}, {"score": 0.0030069062905274976, "phrase": "significant_gender_differences"}, {"score": 0.002830617996609902, "phrase": "high-risk_game_users"}, {"score": 0.0025083651612064144, "phrase": "important_factor"}, {"score": 0.0024336917123957387, "phrase": "psychomedical_fields"}], "paper_keywords": ["Adolescents", " Emotional competence", " Online game"], "paper_abstract": "The purpose of this study was to explore the relations between emotional competence and online game use in adolescents. This study is a cross-sectional descriptive survey using a convenience sample. The participants were 2199 adolescents in South Korea. Online game use and emotional competence including positive emotion, emotional expression, and emotional intelligence were measured. The study results indicated that emotional competence was negatively correlated with excessive online game use. All variables of emotional competence were significantly lower in high-risk users compared with general users. In addition, female adolescents were rated significantly higher in emotional competence among general users, but there were no significant gender differences among high-risk users. The results of our study imply that high-risk game users have lower levels of emotional intelligence than general users do. The results of this study suggest that emotion is an important factor to which practitioners in psychomedical fields and nursing should pay attention. Therefore, nurses in schools and communities should regularly screen the emotions of adolescents who habitually play online games and develop a program to enhance emotional competence associated with online games.", "paper_title": "Emotional Competence and Online Game Use in Adolescents", "paper_id": "WOS:000312797600003"}