{"auto_keywords": [{"score": 0.047995721209163386, "phrase": "csdms"}, {"score": 0.005877822033342411, "phrase": "csdms_modeling_framework"}, {"score": 0.00481495049065317, "phrase": "plug-and-play_models"}, {"score": 0.004571559854487074, "phrase": "cuahsi-his."}, {"score": 0.004471035765089235, "phrase": "increased_focus"}, {"score": 0.004421601997620278, "phrase": "earth_science_community"}, {"score": 0.004324361008753555, "phrase": "modeling_resources"}, {"score": 0.003941592232278979, "phrase": "cuahsi"}, {"score": 0.00388356203453764, "phrase": "primary_focus"}, {"score": 0.0036327808996444904, "phrase": "simulation_model"}, {"score": 0.0032261342460565457, "phrase": "different_data_providers"}, {"score": 0.0030176779201170306, "phrase": "scientific_analysis"}, {"score": 0.002995361424576051, "phrase": "natural_resource_management"}, {"score": 0.002791393223133408, "phrase": "his."}, {"score": 0.0026109540617641593, "phrase": "hydrologic_data"}, {"score": 0.002534539169474629, "phrase": "csdms_model_components"}, {"score": 0.0024512358145634336, "phrase": "csdms_component"}, {"score": 0.0021927897271015657, "phrase": "large_sets"}, {"score": 0.002176560171729638, "phrase": "scientific_data"}, {"score": 0.002152440300818582, "phrase": "sophisticated_modeling_framework"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Integrated modeling", " Hydrologic data", " Components", " Web services"], "paper_abstract": "There has recently been an increased focus within the earth science community on integration of data and modeling resources. Two examples of projects in this area are the Community Surface Dynamics Modeling System (CSDMS) and the Hydrologic Information System (HIS) project of the Consortium of Universities for the Advancement of Hydrologic Science, Inc. (CUAHSI). The primary focus of CSDMS is on modeling, specifically on approaches and tools that allow scientists to construct a simulation model as a configuration of linked, interchangeable model components. The primary focus of the HIS is on data, specifically on approaches and tools that allow scientists to easily access and integrate data from different data providers. The synergies between these two projects are obvious as both data and models are needed to support scientific analysis and natural resource management. For this reason, we have explored a means for providing interoperability between the CSDMS and the HIS. In the approach presented here, the HIS web services are used within the CSDMS modeling framework to search and download hydrologic data that can then be easily fed into CSDMS model components. The result of the work is a CSDMS component able to query, download, and provide plug-and-play access to HIS data directly within the CSDMS modeling framework. This approach therefore provides a means for leveraging large sets of scientific data within a sophisticated modeling framework. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Driving plug-and-play models with data from web services: A demonstration of interoperability between CSDMS and CUAHSI-HIS", "paper_id": "WOS:000317164000017"}