{"auto_keywords": [{"score": 0.04690657035888381, "phrase": "user's_location_privacy"}, {"score": 0.023005456367220813, "phrase": "mobile_behavior"}, {"score": 0.016823189823780647, "phrase": "mac_address"}, {"score": 0.008199887710865491, "phrase": "neighboring_nodes"}, {"score": 0.007771938958339502, "phrase": "opportune_moment"}, {"score": 0.0063632909812613376, "phrase": "network_throughput"}, {"score": 0.00481495049065317, "phrase": "wlan_location_privacy"}, {"score": 0.0046986841646790315, "phrase": "wireless_network"}, {"score": 0.004562847483469705, "phrase": "daily_life"}, {"score": 0.004345085569121329, "phrase": "wireless_local_area_network"}, {"score": 0.004302806202311396, "phrase": "wlan"}, {"score": 0.003661275004971829, "phrase": "key_factor"}, {"score": 0.003303617297414837, "phrase": "existing_schemes"}, {"score": 0.002663208600887875, "phrase": "relative_positioning_scheme"}, {"score": 0.0024383967028975616, "phrase": "experiment_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Location privacy", " WLAN", " MAC address", " Relative localization technology"], "paper_abstract": "Recently wireless network is massively used in the daily life, but user's location privacy can be threatened. In a wireless local area network (WLAN), an adversary can track a user through his/her unchanged MAC address. Many correlation researches have been proposed to combat this issue, but they have not included mobile behavior of neighboring nodes as a key factor; therefore, their solutions may miss the opportune moment to update MAC address to improve the user's location privacy. In other words, the existing schemes in the opportune moment to update MAC address may not be the best one. Furthermore, they will have many unnecessary MAC addresses to be updated; it then causes the network throughput being reduced. In this paper, we are going to enhance user's location privacy with the relative positioning scheme. We analyze the mobile behavior of neighboring nodes to decide which mobile nodes are going to update their MAC addresses. The experiment results show that our scheme can decrease the time of changing MAC address, and also to enhance the user's location privacy, although the network throughput is a little decrease. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Enhancing WLAN location privacy using mobile behavior", "paper_id": "WOS:000282607800022"}