{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "verification_problem"}, {"score": 0.04977563261359395, "phrase": "weak_memory_models"}, {"score": 0.038635731992653306, "phrase": "\"_relaxation"}, {"score": 0.02811223834300324, "phrase": "reachability_problem"}, {"score": 0.004679198657323125, "phrase": "finite-state_concurrent_programs"}, {"score": 0.004391013899148212, "phrase": "modern_multi-processor_architectures"}, {"score": 0.004199866682506738, "phrase": "concurrency_libraries"}, {"score": 0.003991539512905838, "phrase": "compiler_backends"}, {"score": 0.003817715315140651, "phrase": "paper_combinations"}, {"score": 0.0032150572968898923, "phrase": "essentially_pso"}, {"score": 0.0028578496983461136, "phrase": "abstract_operational_models"}, {"score": 0.0028037753646260937, "phrase": "state_machines"}, {"score": 0.0026057765979649785, "phrase": "tso_model"}, {"score": 0.0021319959284827896, "phrase": "repeated_reachability_problem"}], "paper_keywords": ["Verification", " Theory", " Reliability", " Program verification", " Relaxed memory models", " Infinite state systems", " Lossy channel systems"], "paper_abstract": "We address the verification problem of finite-state concurrent programs running under weak memory models. These models capture the reordering of program (read and write) operations done by modern multi-processor architectures for performance. The verification problem we study is crucial for the correctness of concurrency libraries and other performance-critical system services employing lock-free synchronization, as well as for the correctness of compiler backends that generate code targeted to run on such architectures. We consider in this paper combinations of three well-known program order relaxations. We consider first the \"write to read\" relaxation, which corresponds to the TSO (Total Store Ordering) model. This relaxation is used in most hardware architectures available today. Then, we consider models obtained by adding either (1) the \"write to write\" relaxation, leading to a model which is essentially PSO (Partial Store Ordering), or (2) the \"read to read/write\" relaxation, or (3) both of them, as it is done in the RMO (Relaxed Memory Ordering) model for instance. We define abstract operational models for these weak memory models based on state machines with (potentially unbounded) FIFO buffers, and we investigate the decidability of their reachability and their repeated reachability problems. We prove that the reachability problem is decidable for the TSO model, as well as for its extension with \"write to write\" relaxation (PSO). Furthermore, we prove that the reachability problem becomes undecidable when the \"read to read/write\" relaxation is added to either of these two memory models, and we give a condition under which this addition preserves the decidability of the reachability problem. We show also that the repeated reachability problem is undecidable for all the considered memory models.", "paper_title": "On the Verification Problem for Weak Memory Models", "paper_id": "WOS:000274028100003"}