{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_cellular_manufacturing_systems"}, {"score": 0.04835978765719222, "phrase": "manufacturing_cell_creation"}, {"score": 0.03794384973700695, "phrase": "proposed_aco_algorithm"}, {"score": 0.02896921689056607, "phrase": "genetic_algorithm"}, {"score": 0.004591466267316524, "phrase": "production_scheduling_problems"}, {"score": 0.004362326712297089, "phrase": "total_materials"}, {"score": 0.0041294419262414995, "phrase": "mathematical_model"}, {"score": 0.00385214804128572, "phrase": "maximum_capacities"}, {"score": 0.0037961770933599135, "phrase": "critical_tools_limitation"}, {"score": 0.003541182515693916, "phrase": "feasible_schedule"}, {"score": 0.003291188255149539, "phrase": "final_schedule"}, {"score": 0.0031961879138783012, "phrase": "proposed_methodology"}, {"score": 0.003036468052876648, "phrase": "manufacturing_cells"}, {"score": 0.002981557145348661, "phrase": "china"}, {"score": 0.002959617637433, "phrase": "internal_combustion_engine_components"}, {"score": 0.0027911639820564897, "phrase": "existing_manufacturing_system"}, {"score": 0.002690771424958613, "phrase": "virtual_cellular_manufacturing_concept"}, {"score": 0.0026419338604879404, "phrase": "current_manufacturing_practice"}, {"score": 0.0026035011274172753, "phrase": "average_workstation_utilization"}, {"score": 0.002584494385587982, "phrase": "product_completion_time"}, {"score": 0.0024642796422450755, "phrase": "randomly_generated_numerical_experiments"}, {"score": 0.0024106932919085097, "phrase": "excellent_final_solutions"}, {"score": 0.0022239665922395104, "phrase": "paper_form"}, {"score": 0.0021049977753042253, "phrase": "scheduling_problems"}], "paper_keywords": ["virtual cellular manufacturing cells", " ant colony optimization", " production scheduling", " manufacturing cell creation"], "paper_abstract": "This paper presents a methodology to solve the manufacturing cell creation and the production scheduling problems for designing virtual cellular manufacturing systems (VCMSs). The objective is to minimize the total materials and components travelling distance incurred. The methodology consists of (i) a mathematical model that describes the characteristics of a VCMS and includes constraints such as delivery due dates of products, maximum capacities of resources, critical tools limitation, and (ii) an ant colony optimization (ACO) algorithm for manufacturing cell formation and production scheduling. Since the proposed ACO algorithm does not indicate a feasible schedule explicitly, two simple heuristics are developed to assign workstations to the operations of the jobs, and to construct the final schedule. To demonstrate the effectiveness of the proposed methodology, both the ACO algorithm and the genetic algorithm are applied to design manufacturing cells for a company in China producing internal combustion engine components. Comparison of the results obtained with the results supplied by the company on the existing manufacturing system show that both the ACO algorithm and the genetic algorithm together with the virtual cellular manufacturing concept perform better than the current manufacturing practice in terms of average workstation utilization, product completion time and system throughput. Also, the results of a set of randomly generated numerical experiments show that the proposed ACO algorithm generates excellent final solutions in a much shorter computation time when compared with the genetic algorithm. Therefore, the mathematical model and the ACO algorithm proposed in this paper form a simple, but effective and efficient methodology to solve the manufacturing cell creation and production scheduling problems for designing VCMSs.", "paper_title": "An ant colony optimization algorithm for scheduling virtual cellular manufacturing systems", "paper_id": "WOS:000248334000002"}