{"auto_keywords": [{"score": 0.0407832063611011, "phrase": "edited_books"}, {"score": 0.023227301113361, "phrase": "social_sciences"}, {"score": 0.006120826638489124, "phrase": "book_chapters"}, {"score": 0.004632975348826732, "phrase": "monographs"}, {"score": 0.004496174406337201, "phrase": "scholarly_communication"}, {"score": 0.004307700591183651, "phrase": "edited_book"}, {"score": 0.004162602203448056, "phrase": "different_authors"}, {"score": 0.003920295222165263, "phrase": "collaboration_patterns"}, {"score": 0.0038044740295890495, "phrase": "belgium"}, {"score": 0.003447349911141396, "phrase": "flemish_university_affiliation"}, {"score": 0.0027940789980683, "phrase": "unique_authors"}, {"score": 0.0025865184994601697, "phrase": "english"}, {"score": 0.002553382046204689, "phrase": "dominant_publication_language"}], "paper_keywords": ["Co-authorship", " Co-editorship", " Social Sciences and Humanities", " Flanders", " Collaboration", " Edited books"], "paper_abstract": "Monographs and edited books are important in scholarly communication, especially in the Social Sciences and Humanities. An edited book is a collection of chapters written by different authors, gathered and harmonized by one or more editors. This article analyses the characteristics and collaboration patterns of edited books in the Social Sciences and Humanities as practiced in Flanders, the Northern Dutch speaking part of Belgium. It is based upon a comprehensive set of 753 peer reviewed edited books, of which at least one of the editors has a Flemish university affiliation, and the 12,913 chapters published therein. The article analyses various characteristics of edited books, i.e. the distribution over publishers, the places of publication, language use, the presence of introductions and conclusions, the occurrence of co-editorship and co-authorship, and the number of unique authors and book chapters per volume. Almost half of the edited books are published with about 5 % of the publishers. English is the dominant publication language for all places of publication. Writing a conclusion seems rather uncommon. All in all, about 90 % of all volumes are co-edited. Edited books in the Social Sciences have a more diverse authorship then edited books in the Humanities. In general, the more co-authorship for articles occurs within a discipline, the more co-authorship occurs for book chapters, whereas the number of editors is independent from this trend.", "paper_title": "Edited books in the Social Sciences and Humanities: Characteristics and collaboration analysis", "paper_id": "WOS:000355948600010"}