{"auto_keywords": [{"score": 0.04947447224326206, "phrase": "network_coding"}, {"score": 0.007740489563401459, "phrase": "wireless_networks"}, {"score": 0.007633626412037719, "phrase": "cooperative_channelization"}, {"score": 0.006775673477072731, "phrase": "resource_reservation"}, {"score": 0.006359194961229923, "phrase": "multicast_flows"}, {"score": 0.004461359547152617, "phrase": "multicast_traffic"}, {"score": 0.004404994123834589, "phrase": "multihop_wireless_networks"}, {"score": 0.003521513329271534, "phrase": "overall_network_performance"}, {"score": 0.0033937776228549557, "phrase": "different_destinations"}, {"score": 0.003245900020944865, "phrase": "extremely_high_congestion"}, {"score": 0.003204841443605308, "phrase": "repair_capability"}, {"score": 0.002821685815956478, "phrase": "transmission_media"}, {"score": 0.0024842242921857705, "phrase": "health_metric"}, {"score": 0.002316105585203396, "phrase": "different_multicast_links"}], "paper_keywords": ["Wireless networks", " resource reservation", " channelization", " network coding"], "paper_abstract": "In this paper, we address congestion of multicast traffic in multihop wireless networks through a combination of network coding and resource reservation. Network coding reduces the number of transmissions required in multicast flows, thus allowing a network to approach its multicast capacity. In addition, it efficiently repairs errors in multicast flows by combining packets lost at different destinations. However, under conditions of extremely high congestion the repair capability of network coding is seriously degraded. In this paper, we propose cooperative channelization, in which portions of the transmission media are allocated to links that are congested at the point where network coding cannot efficiently repair loss. A health metric is proposed to allow comparison of need for channelization of different multicast links. Cooperative channelization considers the impact of channelization on overall network performance before resource reservation is triggered. Our results show that cooperative channelization improves overall network performance while being well suited for wireless networks using network coding.", "paper_title": "Cooperative Channelization in Wireless Networks with Network Coding", "paper_id": "WOS:000290871100001"}