{"auto_keywords": [{"score": 0.04398714383022719, "phrase": "three-dimensional_model"}, {"score": 0.04257844278060511, "phrase": "two-dimensional_model"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_and_three-dimensional_human_eye_models"}, {"score": 0.003956113993518042, "phrase": "authors'_earlier_work"}, {"score": 0.0038764861784138117, "phrase": "central_corneal_temperature"}, {"score": 0.0034079696245884073, "phrase": "c._comparisons"}, {"score": 0.0032279990773657215, "phrase": "human_eye"}, {"score": 0.0031203609829058587, "phrase": "initial_investigations"}, {"score": 0.0027616550517346066, "phrase": "thermal_symmetry"}, {"score": 0.00237861522566195, "phrase": "human_eye_model"}, {"score": 0.002237637525225501, "phrase": "future_works"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["finite element method", " eye temperature", " three-dimensional", " isotherm", " bioheat transfer"], "paper_abstract": "A comparative study between the ocular temperature predicted by both the two-dimensional and three-dimensional human eye models is carried out in this paper. The three-dimensional model is generated from the two-dimensional model reported in the authors' earlier work. The central corneal temperature for the three-dimensional model is found to be 34.48 degrees C compared to the two-dimensional model which has a value of 33.64 degrees C. Comparisons between the temperatures at various points inside the human eye suggest that for some initial investigations, the use of a two-dimensional model may be sufficient. In other cases such as the loss of thermal symmetry (asymmetrical boundary conditions, power deposition inside the eye), the use of a three-dimensional model is preferable. Methods to improve the accuracy of the human eye model in terms of its anatomical and physiological features are also suggested for future works to be considered. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A comparative study between the two-dimensional and three-dimensional human eye models", "paper_id": "WOS:000257950200005"}