{"auto_keywords": [{"score": 0.029600443367118274, "phrase": "decision_tables"}, {"score": 0.015373231474255324, "phrase": "predictive_models"}, {"score": 0.00481495049065317, "phrase": "decision_table"}, {"score": 0.004654928974748418, "phrase": "important_objective"}, {"score": 0.004620093797504386, "phrase": "data_mining"}, {"score": 0.004158794879468156, "phrase": "new_observations"}, {"score": 0.003916098498242888, "phrase": "comparatively_little_research"}, {"score": 0.0036461569988218267, "phrase": "subjective_nature"}, {"score": 0.0034203874753429113, "phrase": "user's_experience"}, {"score": 0.0032694619052789768, "phrase": "representation_formats"}, {"score": 0.003066945490483524, "phrase": "empirical_study"}, {"score": 0.002942619810718864, "phrase": "alternative_representation_formats"}, {"score": 0.0028661330049356186, "phrase": "key_requirement"}, {"score": 0.002628506002255396, "phrase": "end-user_experiment"}, {"score": 0.0024563302149829, "phrase": "problem-solving_tasks"}, {"score": 0.0024287485834314027, "phrase": "former_representations"}, {"score": 0.00223570488212345, "phrase": "clear_preference"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Data mining", " Classification", " Knowledge representation", " Comprehensibility", " Decision tables"], "paper_abstract": "An important objective of data mining is the development of predictive models. Based on a number of observations, a model is constructed that allows the analysts to provide classifications or predictions for new observations. Currently, most research focuses on improving the accuracy or precision of these models and comparatively little research has been undertaken to increase their comprehensibility to the analyst or end-user. This is mainly due to the subjective nature of 'comprehensibility', which depends on many factors outside the model, such as the user's experience and his/her prior knowledge. Despite this influence of the observer, some representation formats are generally considered to be more easily interpretable than others. In this paper, an empirical study is presented which investigates the suitability of a number of alternative representation formats for classification when interpretability is a key requirement. The formats under consideration are decision tables, (binary) decision trees, propositional rules, and oblique rules. An end-user experiment was designed to test the accuracy, response time, and answer confidence for a set of problem-solving tasks involving the former representations. Analysis of the results reveals that decision tables perform significantly better on all three criteria, while post-test voting also reveals a clear preference of users for decision tables in terms of ease of use. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "An empirical evaluation of the comprehensibility of decision table, tree and rule based predictive models", "paper_id": "WOS:000288519200014"}