{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "gravity_dam"}, {"score": 0.014120226724576518, "phrase": "stress_concentration"}, {"score": 0.013506294677366568, "phrase": "stress_condition"}, {"score": 0.007937840541717154, "phrase": "cosserat_theory"}, {"score": 0.004690583510896564, "phrase": "purpose_-_traditional_continuum_theory"}, {"score": 0.004271953920234395, "phrase": "dam_heel"}, {"score": 0.003876010646939676, "phrase": "concrete_masses"}, {"score": 0.0038471128411102914, "phrase": "macroscopic_inhomogeneity"}, {"score": 0.0038041680562514064, "phrase": "new_model"}, {"score": 0.0036781781340563748, "phrase": "mechanics_behaviour"}, {"score": 0.0032629585038738856, "phrase": "cosserat_granular_model"}, {"score": 0.003178550413662537, "phrase": "mass_concrete_structure"}, {"score": 0.0031313032638307574, "phrase": "cosserat"}, {"score": 0.0027985291920293127, "phrase": "cosserat_results"}, {"score": 0.0027363334666886912, "phrase": "traditional_numerical_solution"}, {"score": 0.00252930673503721, "phrase": "dam_hell"}, {"score": 0.002364338228716365, "phrase": "granular_model"}, {"score": 0.0022773736136311056, "phrase": "dam_body"}, {"score": 0.002251911996999611, "phrase": "first_time"}, {"score": 0.0021049977753042253, "phrase": "traditional_continuum_model"}], "paper_keywords": ["Dams", " Mass concrete", " Stress (material)"], "paper_abstract": "Purpose - Traditional continuum theory is usually applied in analysis of a gravity dam and its foundation; as we all know, both analytic and numerical solution of traditional theory imply that stress concentration around the dam heel and toe is very severe. However, stress condition of the dam and its foundation seems better for it can work normally for decades. Since concrete masses have macroscopic inhomogeneity, a new model has been built in order to simulate the mechanics behaviour of dam and its foundation rationally as the influence of inhomogeneity of the material has been taken into consideration. The purpose of this paper is to describe the application of the Cosserat granular model to analyze the stress condition of a mass concrete structure. Design/methodology/approach - Granular model of Cosserat theory has been built and adopted to model the gravity, considering the influence of the couple-stresses, due to the inhomogeneity of the material. Findings - The Cosserat results have been compared with the traditional numerical solution, and the outcome indicates that the distributions of the stresses and displacements are rational, and the stress concentration around dam hell and toe is less severe and closer to the reality when Cosserat theory adopted. Originality/value - The granular model based on Cosserat theory has been used in modelling a dam body for the first time; because the model can reflect the influence of the inhomogeneity, it is more suitable than traditional continuum model under this condition.", "paper_title": "Analysis of a gravity dam considering the influence of couple-stresses", "paper_id": "WOS:000289390600003"}