{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "human_recognition"}, {"score": 0.0047035227618053965, "phrase": "person-following_behaviour"}, {"score": 0.004656557209439822, "phrase": "mobile_robot"}, {"score": 0.004548778268252678, "phrase": "personal_robots"}, {"score": 0.004225950334493496, "phrase": "in-depth_study"}, {"score": 0.004141936429360251, "phrase": "colour_camera"}, {"score": 0.0039259432210911925, "phrase": "reliable_person-following_behaviour"}, {"score": 0.0036107002958650344, "phrase": "texture_recognition"}, {"score": 0.003410871299189454, "phrase": "real-time_restrictions"}, {"score": 0.003331828027460222, "phrase": "reduced_subset"}, {"score": 0.0032546105164772995, "phrase": "computational_burden"}, {"score": 0.003126365132352301, "phrase": "redundancy_analysis"}, {"score": 0.003013237619840709, "phrase": "similar_human_torsos"}, {"score": 0.002827365415832384, "phrase": "particular_conditions"}, {"score": 0.0024643161985886085, "phrase": "adaptive_system"}, {"score": 0.0023277839538663834, "phrase": "reliable_person-following_behaviours"}, {"score": 0.0021987994275190314, "phrase": "experimental_results"}, {"score": 0.00216950156199795, "phrase": "real_robot"}, {"score": 0.0021477840826122853, "phrase": "real_and_difficult_scenarios"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Image features", " Feature selection", " Human recognition", " Person following", " Robot vision"], "paper_abstract": "One of the most important abilities that personal robots need when interacting with humans is the ability to discriminate amongst them. In this paper, we carry out an in-depth study of the possibilities of a colour camera placed on top of a robot to discriminate between humans, and thus get a reliable person-following behaviour on the robot. In particular we have reviewed and analysed the possibility of using the most popular colour and texture features used in object and texture recognition, to identify and model the target (person being followed). Nevertheless, the real-time restrictions make necessary the selection of a reduced subset of these features to reduce the computational burden. This subset of features was selected after carrying out a redundancy analysis, and considering how these features perform when discriminating amongst similar human torsos. Finally, we also describe several scoring functions able to dynamically adjust the relevance of each feature considering the particular conditions of the environment where the robot moves, together with the characteristics of the clothes worn by the persons that are in the scene. The results of this in-depth study have been implemented in a novel and adaptive system (described in this paper), which is able to discriminate between humans to get reliable person-following behaviours in a mobile robot. The performance of our proposal is clearly shown through a set of experimental results obtained with a real robot working in real and difficult scenarios. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Feature analysis for human recognition and discrimination: Application to a person-following behaviour in a mobile robot", "paper_id": "WOS:000306769100002"}