{"auto_keywords": [{"score": 0.04583730350205629, "phrase": "multilevel_regression"}, {"score": 0.017181033748835773, "phrase": "multilevel_bayesian_networks"}, {"score": 0.010612387000973441, "phrase": "hierarchical_health_care_data"}, {"score": 0.00527129167440458, "phrase": "multiple_diseases"}, {"score": 0.00475390577915698, "phrase": "large_health_care_datasets"}, {"score": 0.004693631352125911, "phrase": "hierarchical_structure"}, {"score": 0.004488598908225753, "phrase": "different_practices"}, {"score": 0.004184274042752558, "phrase": "statistical_analysis"}, {"score": 0.003950631096355195, "phrase": "bayesian_networks"}, {"score": 0.0037062400890170064, "phrase": "hierarchical_data"}, {"score": 0.003601235776892337, "phrase": "new_formalism"}, {"score": 0.003465827053421054, "phrase": "hierarchically_structured_health_care_data"}, {"score": 0.0032617323680009217, "phrase": "clinical_data"}, {"score": 0.003240958183116486, "phrase": "family_practices"}, {"score": 0.003139048969111903, "phrase": "heart_failure"}, {"score": 0.0031190537176106386, "phrase": "diabetes_mellitus"}, {"score": 0.002788993760769774, "phrase": "prediction_model"}, {"score": 0.0027447761472348614, "phrase": "net_reclassification_improvements"}, {"score": 0.0026499429068956686, "phrase": "considerable_more_insight"}, {"score": 0.0024937735547989445, "phrase": "suitable_alternative"}, {"score": 0.002346786090713685, "phrase": "multilevel_bayesian_network_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bayesian network", " Multilevel analysis", " Disease prediction", " Multimorbidity", " Inter-practice variation", " Cardiovascular disease"], "paper_abstract": "Objective: Large health care datasets normally have a hierarchical structure, in terms of levels, as the data have been obtained from different practices, hospitals, or regions. Multilevel regression is the technique commonly used to deal with such multilevel data. However, for the statistical analysis of interactions between entities from a domain, multilevel regression yields little to no insight. While Bayesian networks have proved to be useful for analysis of interactions, they do not have the capability to deal with hierarchical data. In this paper, we describe a new formalism, which we call multilevel Bayesian networks; its effectiveness for the analysis of hierarchically structured health care data is studied from the perspective of multimorbidity. Methods: Multilevel Bayesian networks are formally defined and applied to analyze clinical data from family practices in The Netherlands with the aim to predict interactions between heart failure and diabetes mellitus. We compare the results obtained with multilevel regression. Results: The results obtained by multilevel Bayesian networks closely resembled those obtained by multilevel regression. For both diseases, the area under the curve of the prediction model improved, and the net reclassification improvements were significantly positive. In addition, the models offered considerable more insight, through its internal structure, into the interactions between the diseases. Conclusions: Multilevel Bayesian networks offer a suitable alternative to multilevel regression when analyzing hierarchical health care data. They provide more insight into the interactions between multiple diseases. Moreover, a multilevel Bayesian network model can be used for the prediction of the occurrence of multiple diseases, even when some of the predictors are unknown, which is typically the case in medicine. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Multilevel Bayesian networks for the analysis of hierarchical health care data", "paper_id": "WOS:000318838200002"}