{"auto_keywords": [{"score": 0.02994075482408088, "phrase": "patent_information"}, {"score": 0.00481495049065317, "phrase": "technological_knowledge"}, {"score": 0.004655285779819366, "phrase": "patent_data"}, {"score": 0.004623990904432388, "phrase": "technological_information"}, {"score": 0.004455575231721042, "phrase": "firm_innovative_processes"}, {"score": 0.0042500322609733574, "phrase": "large_databases"}, {"score": 0.003999578057088828, "phrase": "xml-based_codification"}, {"score": 0.003700833742881285, "phrase": "technological_field"}, {"score": 0.0035779805381654438, "phrase": "hierarchical_classification_approach"}, {"score": 0.0030735451757603555, "phrase": "description_logics"}, {"score": 0.0026759663480185047, "phrase": "formal_representation"}, {"score": 0.0026579417954765137, "phrase": "patent_code_classification_hierarchies"}, {"score": 0.002640038329840458, "phrase": "description-logics-based_reasoning"}, {"score": 0.0025095411819626152, "phrase": "patent_classification_codes"}, {"score": 0.0024926348205500715, "phrase": "concept_hierarchies"}, {"score": 0.0024343522820859578, "phrase": "automatic_inference"}, {"score": 0.0024179512279236207, "phrase": "implicit_knowledge"}, {"score": 0.0023935561037315375, "phrase": "reclassification_techniques"}, {"score": 0.002361410799860054, "phrase": "different_application_domains"}, {"score": 0.002148136905808445, "phrase": "patent_information_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ontology", " OWL", " Patent", " IPC classification"], "paper_abstract": "Patent data provide technological information essential to define strategies and decisions in the context of firm innovative processes. At present, information regarding patents is usually represented and stored in large databases. Information from these databases is commonly retrieved in the form of files with a CSV- or XML-based codification but with little semantics that enable the inference of further relationships among patents. In these databases, each patent is associated with a technological field by a code. Although the codes assume a hierarchical classification approach, inclusion/subsumption relationships are not explicitly specified such that computers can process them automatically. In recent years, ontologies have been proven to facilitate the exchange of information between people and systems. In this context, the Web Ontology Language (OWL), whose formal semantics are based on description logics, has become the most widely used language for the representation of ontologies. Certain patent ontologies have already been developed in OWL to benefit from the semantics of patent information. However, none have fully exploited the information that can be derived from the formal representation of patent code classification hierarchies through description-logics-based reasoning. This paper presents an approach to automatically translate the hierarchies found in the patent classification codes into concept hierarchies. This proposal also enables the automatic inference of implicit knowledge based on reclassification techniques and relationships between different application domains without changing the applications that make use of patent information. Several examples are presented to illustrate the applicability of the proposal and how it can assist firms in patent information management. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Managing technological knowledge of patents: HCOntology, a semantic approach", "paper_id": "WOS:000358461300001"}