{"auto_keywords": [{"score": 0.026392644474033274, "phrase": "system's_response_time"}, {"score": 0.00481495049065317, "phrase": "sru's_access_request_queue"}, {"score": 0.004574085781766281, "phrase": "comprehensive_description"}, {"score": 0.003941319912895672, "phrase": "service_requests"}, {"score": 0.0038810583785936505, "phrase": "multi-server_queueing_model"}, {"score": 0.0038413947966606118, "phrase": "first-in-first-out"}, {"score": 0.0035382855372646164, "phrase": "above-mentioned_communication_system"}, {"score": 0.003275807170434343, "phrase": "model's_mathematical_tractability"}, {"score": 0.0031116963435584982, "phrase": "realistic_scenario"}, {"score": 0.0030017207229983385, "phrase": "proposed_approximate_model"}, {"score": 0.002895620643297197, "phrase": "system's_performance"}, {"score": 0.002793260314529581, "phrase": "reported_results"}, {"score": 0.0027505037762786087, "phrase": "cataclysmic_access_request"}, {"score": 0.0024436718485762207, "phrase": "arda"}, {"score": 0.0022973933270056743, "phrase": "overall_blocking_probability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Modelling", " Performance", " V2I"], "paper_abstract": "This paper presents a concise yet comprehensive description of a multi-channel Vehicle-to-Infrastructure (V2I) communication system. Existing mathematical models for such a system overlook some of its essential behavioural characteristics such as the reneging, force-termination and ultimately blocking of service requests. A multi-server queueing model with First-In-First-Out (FIFO) service policy is proposed for the purpose of accurately capturing the dynamics of the above-mentioned communication system and evaluating its performance. Approximations were exploited as a mean to enhance this model's mathematical tractability. Simulations are conducted in the context of a realistic scenario with the objective of validating the proposed approximate model, verifying its accuracy and characterizing the system's performance in terms of several new metrics. The reported results indicate a cataclysmic access request blocking probability ranging from 66% to 85%. An Access Request Deadline-Aware (ARDA) service policy is then proposed to reduce the blocking probability and improve the system's response time. Indeed ARDA achieved an improvement over FIFO of almost 70% in terms of the overall blocking probability and 22% to 66% in terms of the system's response time. (C) 2015 Published by Elsevier B.V.", "paper_title": "Modelling, analysis and performance improvement of an SRU's access request queue in multi-channel V2I communications", "paper_id": "WOS:000359026500007"}