{"auto_keywords": [{"score": 0.04526211521024839, "phrase": "clinical_trials"}, {"score": 0.00481495049065317, "phrase": "standard_operating_procedures"}, {"score": 0.004655743062576869, "phrase": "kks"}, {"score": 0.0031389196811235577, "phrase": "germany"}, {"score": 0.0030058503645435455, "phrase": "descriptive_analyses_results"}, {"score": 0.0029627701619228527, "phrase": "return_rate"}, {"score": 0.0028100102841877835, "phrase": "daily_work"}, {"score": 0.002677964894127131, "phrase": "corresponding_sop"}, {"score": 0.0023972750359328235, "phrase": "electronic_sops"}, {"score": 0.0021049977753042253, "phrase": "computet-based_information_retrieval_system"}], "paper_keywords": ["Clinical research", " clinical trial", " standards", " medical informatics", " standard operating procedures (SOPs)"], "paper_abstract": "Objectives: With Standard Operating Procedures (SOPs) the conduction of clinical trials should be standardized so that the results are comparable and traceable. This aim can only be reached if the staff of clinical trials really uses the SOPs. Therefore, we conducted a survey to explore the use and usability of SOPs in clinical trials and to identify problems for their handling. Method: Standardized, validated questionnaire among the staff of all 12 coordination centers for clinical trials in Germany (n = 238), anonymous, descriptive analyses Results: A return rate of 58.8% was reached. When having questions about the daily work 18.4% more likely ask a colleague than feud the corresponding SOP (13.8%). For the relevance of SOPs 16.9% of the staff regard less than 10% of SOPs as relevant for them. Exclusively working with electronic SOPs are 4%. Conclusions: The results of the survey indicate that improvements for the handling of SOPs are necessary. They could be used to design a computet-based information retrieval system for SOPs to increase the ease-of-use and usefulness of SOPs in clinical trials.", "paper_title": "Usage and Usability of Standard Operating Procedures (SOPs) among the Coordination Centers for Clinical Trials (KKS)", "paper_id": "WOS:000261884700006"}