{"auto_keywords": [{"score": 0.034568109650219274, "phrase": "primary_relationships"}, {"score": 0.034300144615685896, "phrase": "secondary_relationships"}, {"score": 0.015719716506582538, "phrase": "biochemical_pathways"}, {"score": 0.004776484866276242, "phrase": "fuzzy-c_means_clustering"}, {"score": 0.00440825801245188, "phrase": "mathematical_models"}, {"score": 0.00401961206251868, "phrase": "intuitive_comprehension"}, {"score": 0.003876996400581697, "phrase": "perceptive_insight"}, {"score": 0.0036651042289628324, "phrase": "control_hierarchies"}, {"score": 0.003635790924434452, "phrase": "lower_level_functional_relationships"}, {"score": 0.00340954056723008, "phrase": "dynamic_models"}, {"score": 0.0033283624928018177, "phrase": "different_functional_groups"}, {"score": 0.0025633455664747606, "phrase": "low_level_functional_structure"}, {"score": 0.0024922258873137093, "phrase": "potential_hierarchical_control"}, {"score": 0.0023558375480288297, "phrase": "epidermal_growth_factor_signal_transduction_pathway"}, {"score": 0.0022001958412800745, "phrase": "previous_computational_decomposition_studies"}, {"score": 0.0021049977753042253, "phrase": "current_computational_approaches"}], "paper_keywords": ["Clustering algorithms", " functional analysis", " fuzzy systems", " systems biology", " time series analysis"], "paper_abstract": "Biological systems that are representative of regulatory, metabolic, or signaling pathways can be highly complex. Mathematical models that describe such systems inherit this complexity. As a result, these models can often fail to provide a path toward the intuitive comprehension of these systems. More coarse information that allows a perceptive insight of the system is sometimes needed in combination with the model to understand control hierarchies or lower level functional relationships. In this paper, we present a method to identify relationships between components of dynamic models of biochemical pathways that reside in different functional groups. We find primary relationships and secondary relationships. The secondary relationships reveal connections that are present in the system, which current techniques that only identify primary relationships are unable to show. We also identify how relationships between components dynamically change over time. This results in a method that provides the hierarchy of the relationships among components, which can help us to understand the low level functional structure of the system and to elucidate potential hierarchical control. As a proof of concept, we apply the algorithm to the epidermal growth factor signal transduction pathway, and to the C3 photosynthesis pathway. We identify primary relationships among components that are in agreement with previous computational decomposition studies, and identify secondary relationships that uncover connections among components that current computational approaches were unable to reveal.", "paper_title": "Hierarchical Modularization Of Biochemical Pathways Using Fuzzy-C Means Clustering", "paper_id": "WOS:000342226900019"}