{"auto_keywords": [{"score": 0.046433377080865965, "phrase": "context-based_scores"}, {"score": 0.00481495049065317, "phrase": "context-based_features_enhance_protein_secondary_structure"}, {"score": 0.004695389394526107, "phrase": "new_approach"}, {"score": 0.004645057834614705, "phrase": "statistical_context-based_scores"}, {"score": 0.004546000131069232, "phrase": "neural_networks"}, {"score": 0.004497262692458022, "phrase": "secondary_structure_prediction_accuracy_improvement"}, {"score": 0.003923144245133288, "phrase": "long-standing_difficulty"}, {"score": 0.0038950367927745267, "phrase": "neural_network-based_secondary_structure_predictions"}, {"score": 0.0037845987749316632, "phrase": "neighboring_residues"}, {"score": 0.0035729944980593324, "phrase": "prediction_accuracy"}, {"score": 0.0035473867669654174, "phrase": "secondary_structure_predictions"}, {"score": 0.0030171910207671205, "phrase": "popularly_used_secondary_structure_prediction_servers"}, {"score": 0.002984794722633428, "phrase": "psipred"}, {"score": 0.002963390095037466, "phrase": "profphd"}, {"score": 0.002942138511829811, "phrase": "jpred"}, {"score": 0.00284837132359445, "phrase": "netsurf"}, {"score": 0.0027775064989253575, "phrase": "sov_accuracy"}, {"score": 0.0026505322540093783, "phrase": "best_sov_accuracy"}, {"score": 0.0025293479382942257, "phrase": "eight-state_secondary_structure_prediction"}, {"score": 0.0022703709180757576, "phrase": "high-confidence_predictions"}, {"score": 0.0022379017425216917, "phrase": "rather_high_accuracy"}, {"score": 0.002143247921132179, "phrase": "eight-state_prediction_servers"}], "paper_keywords": [""], "paper_abstract": "We report a new approach of using statistical context-based scores as encoded features to train neural networks to achieve secondary structure prediction accuracy improvement. The context-based scores are pseudo-potentials derived by evaluating statistical, high-order inter-residue interactions, which estimate the favorability of a residue adopting certain secondary structure conformation within its amino acid environment. Encoding these context-based scores as important training and prediction features provides a way to address a long-standing difficulty in neural network-based secondary structure predictions of taking interdependency among secondary structures of neighboring residues into account. Our computational results have shown that the context-based scores are effective features to enhance the prediction accuracy of secondary structure predictions. An overall 7-fold cross-validated Q3 accuracy of 82.74% and Segment Overlap Accuracy (SOV) accuracy of 86.25% are achieved on a set of more than 7987 protein chains with, at most, 25% sequence identity. The Q3 prediction accuracy on benchmarks of CB513, Manesh215, Carugo338, as well as CASP9 protein chains is higher than popularly used secondary structure prediction servers, including Psipred, Profphd, Jpred, Porter (ab initio), and Netsurf. More significant improvement is observed in the SOV accuracy, where more than 4% enhancement is observed, compared to the server with the best SOV accuracy. A Q8 accuracy of >70% (71.5%) is also found in eight-state secondary structure prediction. The majority of the Q3 accuracy improvement is contributed from correctly identifying beta-sheets and alpha-helices. When the context-based scores are incorporated, there are 15.5% more residues predicted with >90% confidence. These high-confidence predictions usually have a rather high accuracy (averagely, similar to 95%). The three- and eight-state prediction servers (SCORPION) implementing our methods are available online.", "paper_title": "Context-Based Features Enhance Protein Secondary Structure Prediction Accuracy", "paper_id": "WOS:000333478800030"}