{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "informetrics_research"}, {"score": 0.004498812433096501, "phrase": "information_science_research_field"}, {"score": 0.004373267443572639, "phrase": "publication_strategies"}, {"score": 0.004039995317682942, "phrase": "informetrics_researchers"}, {"score": 0.003648411055689428, "phrase": "citation_impact"}, {"score": 0.0032575241721857343, "phrase": "primary_authors"}, {"score": 0.0028111220617485985, "phrase": "high_total_citation_impact"}, {"score": 0.0025239898026543964, "phrase": "highly_productive_researchers"}, {"score": 0.0024395426929046415, "phrase": "high_impact_researchers"}, {"score": 0.002202742267484358, "phrase": "best_chance"}, {"score": 0.002129020447793464, "phrase": "next_generation"}, {"score": 0.0021049977753042253, "phrase": "highly_productive_informetricians"}], "paper_keywords": ["Scientific productivity", " Co-authorship", " Social network analysis", " Centrality measures", " Informetrics", " Scientometrics", " Bibliometrics", " Cybermetrics", " Webometrics"], "paper_abstract": "This paper analyses the information science research field of informetrics to identify publication strategies that have been important for its successful researchers. The study uses a micro-analysis of informetrics researchers from 5,417 informetrics papers published in 7 core informetrics journals during 1948-2012. The most productive informetrics researchers were analysed in terms of productivity, citation impact, and co-authorship. The 30 most productive informetrics researchers of all time span several generations and seem to be usually the primary authors of their research, highly collaborative, affiliated with one institution at a time, and often affiliated with a few core European centres. Their research usually has a high total citation impact but not the highest citation impact per paper. Perhaps surprisingly, the US does not seem to be good at producing highly productive researchers but is successful at producing high impact researchers. Although there are exceptions to all of the patterns found, researchers wishing to have the best chance of being part of the next generation of highly productive informetricians may wish to emulate some of these characteristics.", "paper_title": "Sixty-four years of informetrics research: productivity, impact and collaboration", "paper_id": "WOS:000342228300026"}