{"auto_keywords": [{"score": 0.026452279654774383, "phrase": "perceived_usefulness"}, {"score": 0.015423788060513921, "phrase": "multimedia-based_learning_system"}, {"score": 0.008060530316078908, "phrase": "cognitive_engagement"}, {"score": 0.00481495049065317, "phrase": "learner_acceptance"}, {"score": 0.004633429997452688, "phrase": "present_study"}, {"score": 0.004545240514015278, "phrase": "technology_acceptance_model"}, {"score": 0.004345909305473054, "phrase": "learners'_behavioral_intention"}, {"score": 0.004050116768809519, "phrase": "multimedia_presentation"}, {"score": 0.003998531873723384, "phrase": "perceived_learner_control"}, {"score": 0.003608732492631878, "phrase": "specific_behavioral_context"}, {"score": 0.0034725269588525534, "phrase": "second-order_construct"}, {"score": 0.0030741085942960814, "phrase": "hypothesized_conceptual_framework"}, {"score": 0.00299622333197717, "phrase": "sample_data"}, {"score": 0.002864628676257225, "phrase": "online_survey_instrument"}, {"score": 0.0027920359090544107, "phrase": "structural_equation_analysis"}, {"score": 0.002259054486157494, "phrase": "immediate_antecedents"}, {"score": 0.002145942273032774, "phrase": "key_intervening_variable"}], "paper_keywords": [""], "paper_abstract": "The present study applied the technology acceptance model to examine the determinants leading to learners' behavioral intention to use a multimedia-based learning system. Four exogenous constructsmultimedia self-efficacy, perceived richness of multimedia presentation, perceived learner control, and perceived system responsivenesswere externally added to the framework to improve its predictive power for the specific behavioral context. In addition, the second-order construct of cognitive engagement was created based upon the dimensions of curiosity, attention focus, and interest and was subsequently incorporated into the framework. The hypothesized conceptual framework was validated using sample data collected from 286 respondents who completed an online survey instrument. Results from structural equation analysis revealed that (a) behavioral intention was jointly determined by attitude and perceived usefulness; (b) attitude was jointly determined by perceived usefulness and cognitive engagement; (c) multimedia self-efficacy, perceived richness of multimedia presentation, and cognitive engagement were immediate antecedents to perceived usefulness; and (d) cognitive engagement was a key intervening variable linking the four exogenous constructs with perceived usefulness.", "paper_title": "Learner Acceptance of a Multimedia-Based Learning System", "paper_id": "WOS:000318734600004"}