{"auto_keywords": [{"score": 0.043849502004616674, "phrase": "video_decoding"}, {"score": 0.029305203799766647, "phrase": "complexity_model"}, {"score": 0.00481495049065317, "phrase": "video_decoding_systems"}, {"score": 0.004757227624616643, "phrase": "significant_power_savings"}, {"score": 0.003352256019007896, "phrase": "time-varying_workload"}, {"score": 0.0030069062905274976, "phrase": "display_deadline"}, {"score": 0.002680789041160613, "phrase": "video_compression_and_platform_specifics"}, {"score": 0.002616762777413686, "phrase": "execution_times"}, {"score": 0.0024336917123957387, "phrase": "dynamic_voltage"}, {"score": 0.002361236012575149, "phrase": "effective_deadlines"}, {"score": 0.0023328599525181707, "phrase": "frame_decoding_jobs"}, {"score": 0.0022361964497681934, "phrase": "buffer-constrained_optimization"}, {"score": 0.0021827653135510225, "phrase": "significant_improvements"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_dynamic_voltage_scaling_techniques"}], "paper_keywords": ["complexity prediction", " dynamic voltage scaling", " video decoding"], "paper_abstract": "Significant power savings can be achieved on voltage/ frequency configurable platforms by dynamically adapting the frequency and voltage according to the workload (complexity). Video decoding is one of the most complex tasks performed on such systems due to its computationally demanding operations like inverse filtering, interpolation, motion compensation and entropy decoding. Dynamically adapting the frequency and voltage for video decoding is attractive due to the time-varying workload and because the utility of decoding a frame is dependent only on decoding the frame before the display deadline. Our contribution in this paper is twofold. First, we adopt a complexity model that explicitly considers the video compression and platform specifics to accurately predict execution times. Second, based on this complexity model, we propose a dynamic voltage scaling algorithm that changes effective deadlines of frame decoding jobs. We pose our problem as a buffer-constrained optimization and show that significant improvements can be achieved over the state-of-the-art dynamic voltage scaling techniques without any performance degradation.", "paper_title": "Complexity model based Proactive dynamic voltage scaling for video decoding systems", "paper_id": "WOS:000250447400013"}