{"auto_keywords": [{"score": 0.04782041185401739, "phrase": "security_policy"}, {"score": 0.00481495049065317, "phrase": "authorization_problem"}, {"score": 0.004255902303152008, "phrase": "trust-management_system"}, {"score": 0.003802135020791801, "phrase": "certificate_chains"}, {"score": 0.003741371936431574, "phrase": "certificate-chain-discovery_problem"}, {"score": 0.0035078427258024613, "phrase": "certificate-chain-discovery_algorithms"}, {"score": 0.00323625520042892, "phrase": "certificate-chain_discovery_problem"}, {"score": 0.0026242699269026204, "phrase": "distributed_model-checking_algorithms"}, {"score": 0.0023189818169615135, "phrase": "multiple_certificate_chains"}, {"score": 0.0021049977753042253, "phrase": "prototype_and_report_preliminary_results"}], "paper_keywords": [""], "paper_abstract": "The authorization problem is to decide whether, according to a security policy, some principal should be allowed access to a resource. In the trust-management system SPKI/SDSI, the security policy is given by a set of certificates, and proofs of authorization take the form of certificate chains. The certificate-chain-discovery problem is to discover a proof of authorization for a given request. Certificate-chain-discovery algorithms for SPKI/SDSI have been investigated by several researchers. We consider a variant of the certificate-chain discovery problem where the certificates are distributed over a number of servers, which then have to cooperate to identify the proof of authorization for a given request. We propose two protocols for this purpose. These protocols are based on distributed model-checking algorithms for weighted pushdown systems (WPDSs). These protocols can also handle cases where certificates are labeled with weights and where multiple certificate chains must be combined to form a proof of authorization. We have implemented these protocols in a prototype and report preliminary results of our evaluation.", "paper_title": "Weighted pushdown systems and trust-management systems", "paper_id": "WOS:000236941100001"}