{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "protein_sequences"}, {"score": 0.037519512308061685, "phrase": "morfchibi"}, {"score": 0.004610058444728656, "phrase": "essential_role"}, {"score": 0.004225950334493496, "phrase": "protein_domains"}, {"score": 0.004110549138321181, "phrase": "disorder-to-order_transition"}, {"score": 0.00395111389294443, "phrase": "high_accuracy"}, {"score": 0.003904495523681369, "phrase": "important_computational_challenge"}, {"score": 0.003650488388949457, "phrase": "fast_and_accurate_prediction"}, {"score": 0.0033460624879847667, "phrase": "high_noise_tolerance"}, {"score": 0.00328051535233219, "phrase": "svms"}, {"score": 0.0032034752726003025, "phrase": "maximal_information"}, {"score": 0.00316565009987584, "phrase": "general_contrast"}, {"score": 0.003140680985599885, "phrase": "amino_acid_compositions"}, {"score": 0.002913052619634697, "phrase": "svmt"}, {"score": 0.002788865808981643, "phrase": "query_sequence"}, {"score": 0.00238017200223107, "phrase": "anchor"}, {"score": 0.0022696277881969896, "phrase": "different_evaluation_metrics"}], "paper_keywords": [""], "paper_abstract": "Motivation: Intrinsically disordered regions of proteins play an essential role in the regulation of various biological processes. Key to their regulatory function is the binding of molecular recognition features (MoRFs) to globular protein domains in a process known as a disorder-to-order transition. Predicting the location of MoRFs in protein sequences with high accuracy remains an important computational challenge. Method: In this study, we introduce MoRFCHiBi, a new computational approach for fast and accurate prediction of MoRFs in protein sequences. MoRFCHiBi combines the outcomes of two support vector machine (SVM) models that take advantage of two different kernels with high noise tolerance. The first, SVMS, is designed to extract maximal information from the general contrast in amino acid compositions between MoRFs, their surrounding regions (Flanks), and the remainders of the sequences. The second, SVMT, is used to identify similarities between regions in a query sequence and MoRFs of the training set. Results: We evaluated the performance of our predictor by comparing its results with those of two currently available MoRF predictors, MoRFpred and ANCHOR. Using three test sets that have previously been collected and used to evaluate MoRFpred and ANCHOR, we demonstrate that MoRFCHiBi outperforms the other predictors with respect to different evaluation metrics. In addition, MoRFCHiBi is downloadable and fast, which makes it useful as a component in other computational prediction tools.", "paper_title": "Computational identification of MoRFs in protein sequences", "paper_id": "WOS:000356625300006"}