{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "missing_operations"}, {"score": 0.011109914859198114, "phrase": "first_stage"}, {"score": 0.010855213265543394, "phrase": "second_stage"}, {"score": 0.004747997855358171, "phrase": "scheduling_problem"}, {"score": 0.004681971826924847, "phrase": "multi-stage_hybrid_flowshop"}, {"score": 0.004552648949390462, "phrase": "considerable_research"}, {"score": 0.0037069087922811488, "phrase": "stainless_steel_factory"}, {"score": 0.003587616378156851, "phrase": "studied_production_system"}, {"score": 0.002722758109991685, "phrase": "addressed_scheduling_problem"}, {"score": 0.002422249273477746, "phrase": "non-permutation_schedule"}, {"score": 0.0022475295254231714, "phrase": "computational_results"}, {"score": 0.0021649437083408425, "phrase": "better_nps_solutions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["scheduling", " hybrid flowshop", " missing operations", " makespan"], "paper_abstract": "The scheduling problem in a multi-stage hybrid flowshop has been the subject of considerable research. All the studies on this subject assume that each job has to be processed on all the stages, i.e., there are no missing operations for a job at any stage. However, missing operations usually exist in many real-life production systems, such as a system in a stainless steel factory investigated in this note. The studied production system in the factory is composed of two stages in series. The first stage contains only one machine while the second stage consists of two identical machines (namely a 1 x 2 hybrid flowshop). In the system, some jobs have to be processed on both stages, but others need only to be processed on the second stage. Accordingly, the addressed scheduling problem is a I x 2 hybrid flowshop with missing operations at the first stage. In this note, we develop a heuristic for the problem to generate a non-permutation schedule (NPS) from a given permutation schedule, with the objective of minimizing the makespan. Computational results demonstrate that the heuristic can efficiently generate better NPS solutions. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A note on two-stage hybrid flowshop scheduling with missing operations", "paper_id": "WOS:000254157500027"}