{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_characters"}, {"score": 0.010104441935538888, "phrase": "new_audience-participating_movie_form"}, {"score": 0.007871886257884129, "phrase": "sdim"}, {"score": 0.007524898717172825, "phrase": "sfdim"}, {"score": 0.004775531918452571, "phrase": "audiences'_movie_experience"}, {"score": 0.004380540407926982, "phrase": "computer_graphics"}, {"score": 0.0041696157492057, "phrase": "pre-rendered_movie"}, {"score": 0.00388800655625083, "phrase": "physiological_and_subjective_evaluation_methods"}, {"score": 0.003464890914694523, "phrase": "audience's_virtual_character"}, {"score": 0.003244050414264445, "phrase": "subjective_evaluation_results"}, {"score": 0.0031260524791486347, "phrase": "increased_subjective_sense"}, {"score": 0.0031004173389196387, "phrase": "spatial_presence"}, {"score": 0.0030372426452745073, "phrase": "emotional_reaction"}, {"score": 0.002843581231499026, "phrase": "friends'_virtual_characters"}, {"score": 0.0027514186391258263, "phrase": "audiences_experience"}, {"score": 0.002461810159687652, "phrase": "increased_phasic_gsr_responses"}, {"score": 0.002323826502178581, "phrase": "evaluation_results"}, {"score": 0.0021576973674470997, "phrase": "role-playing_entertainment_interface"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["User experience", " Virtual character", " Physiological evaluation"], "paper_abstract": "In this paper, we first present a new audience-participating movie form in which 3D virtual characters of audiences are constructed by computer graphics (CC) technologies and are embedded into a in a pre-rendered movie as different roles. Then, we investigate how the audiences respond to these virtual characters using physiological and subjective evaluation methods. To facilitate the investigation, we present three versions of a movie to an audience a Traditional version, its SDIM version with the participation of the audience's virtual character, and its SFDIM version with the co-participation of the audience and her/his friends' virtual characters. The subjective evaluation results show that the participation of virtual characters indeed causes increased subjective sense of spatial presence and engagement, and emotional reaction; moreover, SFDIM performs significantly better than SDIM, due to the co-participation of friends' virtual characters. Also, we find that the audiences experience not only significantly different galvanic skin response (GSR) changes on average changing trend over time and number of fluctuations but they also show the increased phasic GSR responses to the appearance of their own or friends' virtual 3D characters on the screen. The evaluation results demonstrate the success of the new audience-participating movie form and contribute to understanding how people respond to virtual characters in a role-playing entertainment interface. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "The effects of virtual characters on audiences' movie experience", "paper_id": "WOS:000276328600006"}