{"auto_keywords": [{"score": 0.01159084937434576, "phrase": "master_data_management"}, {"score": 0.007088499324571087, "phrase": "master_data"}, {"score": 0.0046632033374901715, "phrase": "multidimensional_concept"}, {"score": 0.004594026340246432, "phrase": "successful_one_master_data_implementation"}, {"score": 0.004554956246520397, "phrase": "large_high-tech_companies"}, {"score": 0.0045162169185355, "phrase": "related_current_challenges_companies"}, {"score": 0.004226900601658479, "phrase": "interview_study"}, {"score": 0.004181997052907647, "phrase": "eight_high-tech_companies"}, {"score": 0.004041473488242287, "phrase": "information_systems"}, {"score": 0.003998531873723384, "phrase": "key_challenges"}, {"score": 0.0038973170902076707, "phrase": "unclear_and_overall_data_quality"}, {"score": 0.0037024804835018373, "phrase": "continuous_data_quality_practices"}, {"score": 0.0036553070575015344, "phrase": "fundamental_challenge"}, {"score": 0.003608732492631878, "phrase": "holistic_one_master_data"}, {"score": 0.003524889550236177, "phrase": "mdm"}, {"score": 0.003494866798828308, "phrase": "good_views"}, {"score": 0.003479957715785264, "phrase": "topical_issues"}, {"score": 0.003465112013649405, "phrase": "large_companies"}, {"score": 0.0034209525226533903, "phrase": "general_view"}, {"score": 0.003370141486407152, "phrase": "special_company_situations"}, {"score": 0.0033200826267264383, "phrase": "presented_concepts"}, {"score": 0.0032918110127650403, "phrase": "significant_implication"}, {"score": 0.0032777653153451265, "phrase": "future_research"}, {"score": 0.0031607633767842896, "phrase": "managerial_challenge"}, {"score": 0.0031405524575069646, "phrase": "structural_changes"}, {"score": 0.0030414140732789186, "phrase": "better_understanding"}, {"score": 0.002738797804069541, "phrase": "data_processes"}, {"score": 0.0026808309026963976, "phrase": "managerial_level"}, {"score": 0.002635339648135844, "phrase": "unified_data_model"}, {"score": 0.0025521085778978042, "phrase": "current_understanding"}, {"score": 0.002541211702298678, "phrase": "mdm."}, {"score": 0.0025195550121331345, "phrase": "business_managers"}, {"score": 0.0024036960052273362, "phrase": "existing_practical_research"}, {"score": 0.002347775213789611, "phrase": "general_challenges"}, {"score": 0.0022980652695552698, "phrase": "practical_research"}, {"score": 0.002273605493468005, "phrase": "obtained_results"}, {"score": 0.0022207044559147786, "phrase": "business_relevant_data_management"}, {"score": 0.0021049977753042253, "phrase": "data_ownership"}], "paper_keywords": ["Communication technologies", " Information systems", " Data handling"], "paper_abstract": "Purpose - This paper aims to provide a framework of the multidimensional concept of one master data. Preconditions required for successful one master data implementation and usage in large high-tech companies are presented and related current challenges companies have today are identified. Design/methodology/approach - This paper is qualitative in nature. First, literature was studied to find out the elements of one master data. Second, an interview study was carried out in eight high-tech companies and in three expert companies. Findings - One master data management framework is the composition of data, processes and information systems. Accordingly, the key challenges related to the data are that the definitions of master data are unclear and overall data quality is poor. Challenges on processes related to managing master data are inadequately defined data ownership, incoherent data management practices and lack of continuous data quality practices. Integrations between applications are fundamental challenge to tackle when constructing an holistic one master data. Research limitations/implications - Studied companies are vanguards in the area of master data management (MDM), providing good views on topical issues in large companies. This study offers a general view of the topic but not describes special company situations as companies need to adapt the presented concepts for their specific case. Significant implication for future research is that MDM can no more be classified and discussed as only an IT problem but it is a managerial challenge which requires structural changes on mindset how issues are handled. Practical implications - This paper provides a better understanding over the issues which are impacting on the implementation of one master data. The preconditions of implementing and executing one master data are: an organization wide and defined data model; clear data ownership definitions; pro-active data quality surveillance; data friendly company culture; the clear definitions of roles and responsibilities; organizational structure that supports data processes; clear data process definitions; support from the managerial level; and information systems that utilize the unified data model. The list of preconditions is wide and it also describes the incoherence of current understanding about MDM. This list helps business managers to understand the extent of the concept and to see that master data management is not only an IT issue. Originality/value - The existing practical research on master data management is limited and, for example, the general challenges have not been reported earlier. This paper offers practical research on one master data. The obtained results illustrates the extent of the topic and the fact that business relevant data management is not only an IT (application) issue but requires understanding of the data, its utilization in organization and supporting practices such as data ownership.", "paper_title": "Managing one master data - challenges and preconditions", "paper_id": "WOS:000289587800008"}