{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "vehicle_routing_problem"}, {"score": 0.004660453113061494, "phrase": "new_hybrid_algorithmic_nature_inspired_approach"}, {"score": 0.0038948525410795517, "phrase": "proposed_algorithm"}, {"score": 0.0034554281349858836, "phrase": "multiple_phase_neighborhood_search-greedy_randomized_adaptive_search_procedure"}, {"score": 0.0034180194713459584, "phrase": "mpns"}, {"score": 0.003290237137651949, "phrase": "expanding_neighborhood_search"}, {"score": 0.002646267286675984, "phrase": "benchmark_instances"}, {"score": 0.0024923577071656014, "phrase": "fifth_place"}, {"score": 0.0023602032679095977, "phrase": "first_place"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Nature inspired intelligence", " Vehicle routing problem", " Metaheuristics", " Particle swarm optimization", " Expanding neighborhood search"], "paper_abstract": "This paper introduces a new hybrid algorithmic nature inspired approach based on particle swarm optimization, for successfully solving one of the most popular supply chain management problems, the vehicle routing problem. The vehicle routing problem is considered one of the most well studied problems in operations research. The proposed algorithm for the solution of the vehicle routing problem, the hybrid particle swarm optimization (HybPSO), combines a particle swarm optimization (PSO) algorithm, the multiple phase neighborhood search-greedy randomized adaptive search procedure (MPNS-GRASP) algorithm, the expanding neighborhood search (ENS) strategy and a path relinking (PR) strategy. The algorithm is suitable for solving very large-scale vehicle routing problems as well as other, more difficult combinatorial optimization problems, within short computational time. It is tested on a set of benchmark instances and produced very satisfactory results. The algorithm is ranked in the fifth place among the 39 most known and effective algorithms in the literature and in the first place among all nature inspired methods that have ever been used for this set of instances. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A hybrid particle swarm optimization algorithm for the vehicle routing problem", "paper_id": "WOS:000277872700004"}