{"auto_keywords": [{"score": 0.04966229511350135, "phrase": "mutable_data_structures"}, {"score": 0.04548554730183367, "phrase": "intuitionistic_logic"}, {"score": 0.00481495049065317, "phrase": "assertion_language"}, {"score": 0.004731771591161973, "phrase": "reynolds"}, {"score": 0.004278807087784626, "phrase": "spatial_form"}, {"score": 0.003954837422946628, "phrase": "bunched_implications"}, {"score": 0.003920386421293712, "phrase": "o'hearn"}, {"score": 0.0036553070575015344, "phrase": "excluded_middle"}, {"score": 0.0034835017385881385, "phrase": "classical_logic"}, {"score": 0.003393206299636482, "phrase": "intuitionistic_and_classical_versions"}, {"score": 0.002962543869356265, "phrase": "bi's_spatial_implication"}, {"score": 0.002898378776839434, "phrase": "weakest_preconditions"}, {"score": 0.0028731024405707277, "phrase": "object-component_assignments"}, {"score": 0.0027741761880779535, "phrase": "cons_cell"}, {"score": 0.002464709648714996, "phrase": "latter_a_feature"}, {"score": 0.0022579036318895753, "phrase": "local_character"}, {"score": 0.0021049977753042253, "phrase": "frame_axioms"}], "paper_keywords": [""], "paper_abstract": "Reynolds has developed a logic for reasoning about mutable data structures in which the pre- and postconditions are written in an intuitionistic logic enriched with a spatial form of conjunction. We investigate the approach from the point of view of the logic BI of bunched implications of O'Hearn and Pym. We begin by giving a model in which the law of the excluded middle holds, thus showing that the approach is compatible with classical logic. The relationship between the intuitionistic and classical versions of the system is established by a translation, analogous to a translation from intuitionistic logic into the modal logic S4. We also consider the question of completeness of the axioms. BI's spatial implication is used to express weakest preconditions for object-component assignments, and an axiom for allocating a cons cell is shown to be complete under an interpretation of triples that allows a command to be applied to states with dangling pointers. We make this latter a feature, by incorporating an operation, and axiom, for disposing of memory. Finally, we describe a local character enjoyed by specifications in the logic, and show how this enables a class of frame axioms, which say what parts of the heap don't change, to be inferred automatically.", "paper_title": "BI as an Assertion Language for Mutable Data Structures", "paper_id": "WOS:000300080800004"}