{"auto_keywords": [{"score": 0.04555412771114012, "phrase": "singaporeans"}, {"score": 0.004652016085325825, "phrase": "purpose_-_the_purpose"}, {"score": 0.004231699728933577, "phrase": "historical_research"}, {"score": 0.00419542424515967, "phrase": "mcmillan"}, {"score": 0.004159446063902181, "phrase": "chavis"}, {"score": 0.003967021436047945, "phrase": "analytical_framework"}, {"score": 0.003686935223424015, "phrase": "important_role"}, {"score": 0.003426556090707852, "phrase": "truly_public_institution"}, {"score": 0.003212074324593725, "phrase": "local_singaporeans"}, {"score": 0.003170811465728631, "phrase": "bidirectional_process"}, {"score": 0.003037047249598515, "phrase": "strenuous_efforts"}, {"score": 0.002934098412396701, "phrase": "myriad_ways"}, {"score": 0.0027622407190589326, "phrase": "shared_emotional_connection"}, {"score": 0.0026342827320931937, "phrase": "frequent_contact"}, {"score": 0.0026116610153271943, "phrase": "high-quality_interaction"}, {"score": 0.0021049977753042253, "phrase": "potential_and_power"}], "paper_keywords": ["Libraries", " Library users", " Singapore", " Communities", " Library history"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the role of the National Library of Singapore in the life of Singaporeans. Design/methodology/approach - The paper uses historical research. McMillan and Chavis' theory of sense of community is adopted as the analytical framework to delineate the role of the National Library of Singapore. Findings - The paper finds that the National Library of Singapore plays an important role in fostering a sense of community among Singaporeans. The transformation of the library to a truly public institution in 1950s effectively enlarged its boundaries. Upon joining the community of the library, local Singaporeans underwent a bidirectional process of influencing and being influenced. The library made strenuous efforts to meet the needs of Singaporeans in myriad ways, resulting in reinforcement of the sense of community among Singaporeans. A shared emotional connection in the community was engendered as a result of the frequent contact and high-quality interaction. Originality/value - While being influenced by various social and cultural frameworks under which it operates, the library actively takes part in and influences the society. The study of the library in the life of the users via the lens of sense of community provides a perspective to further understand the potential and power of libraries and how libraries can positively contribute to the society at large.", "paper_title": "The National Library of Singapore: creating a sense of community", "paper_id": "WOS:000341924700010"}