{"auto_keywords": [{"score": 0.04821371094523723, "phrase": "common_elements"}, {"score": 0.03703773443586108, "phrase": "classification_framework"}, {"score": 0.00481495049065317, "phrase": "\"coming_across_information_serendipitously_-_part"}, {"score": 0.004590820632326585, "phrase": "researchers'_experiences"}, {"score": 0.0037634608487353153, "phrase": "particular_experience"}, {"score": 0.003313741359811683, "phrase": "critical_incident_interviews"}, {"score": 0.0032744315183287024, "phrase": "serendipity_stories"}, {"score": 0.0029762350325031207, "phrase": "almost_all_the_experiences"}, {"score": 0.0028944757265206332, "phrase": "different_mixes"}, {"score": 0.0027926389474730927, "phrase": "interviewees'_experiences"}, {"score": 0.0027594936602962075, "phrase": "multi-dimensional_conceptual_space"}, {"score": 0.0026836723685046407, "phrase": "\"serendipity_space"}, {"score": 0.002599560451267203, "phrase": "different_\"strengths"}, {"score": 0.0024006068621542642, "phrase": "serendipity_space"}, {"score": 0.0021559025985688255, "phrase": "structured_means"}, {"score": 0.0021049977753042253, "phrase": "potentially_serendipitous_experiences"}], "paper_keywords": ["Serendipity", " Serendipitous", " Chance", " Information discovery", " Encountering", " Classification", " Classification schemes"], "paper_abstract": "Purpose - In \"Coming across information serendipitously - Part 1: a process model\" the authors identified common elements of researchers' experiences of \"coming across information serendipitously\". These experiences involve a mix of unexpectedness and insight and lead to a valuable, unanticipated outcome. In this article, the authors aim to show how the elements of unexpectedness, insight and value form a framework for subjectively classifying whether a particular experience might be considered serendipitous and, if so, just how serendipitous. Design/methodology/approach - The classification framework was constructed by analysing 46 experiences of coming across information serendipitously provided by 28 interdisciplinary researchers during critical incident interviews. \"Serendipity stories\" were written to summarise each experience and to facilitate their comparison. The common elements of unexpectedness, insight and value were identified in almost all the experiences. Findings - The presence of different mixes of unexpectedness, insight and value in the interviewees' experiences define a multi-dimensional conceptual space (which the authors call the \"serendipity space\"). In this space, different \"strengths\" of serendipity exist. The classification framework can be used to reason about whether an experience falls within the serendipity space and, if so, how \"pure\" or \"dilute\" it is. Originality/value - The framework provides researchers from various disciplines with a structured means of reasoning about and classifying potentially serendipitous experiences.", "paper_title": "Coming across information serendipitously - Part 2 A classification framework", "paper_id": "WOS:000309295600007"}