{"auto_keywords": [{"score": 0.04711187924763277, "phrase": "hmt"}, {"score": 0.00481495049065317, "phrase": "feature_extraction"}, {"score": 0.004774115617883476, "phrase": "noisy_images"}, {"score": 0.0047135086583390585, "phrase": "grayscale_hit-or-miss_transforms"}, {"score": 0.004440648141548589, "phrase": "well-known_morphological_transform"}, {"score": 0.004328576620172571, "phrase": "digital_images"}, {"score": 0.003891140864902669, "phrase": "different_ways"}, {"score": 0.003557924423642353, "phrase": "noise_robustness"}, {"score": 0.003512702405367876, "phrase": "rank-order_operators"}, {"score": 0.0034532961266947734, "phrase": "standard_morphological_erosions"}, {"score": 0.0033804443117334535, "phrase": "major_issue"}, {"score": 0.0033374705499418377, "phrase": "proposed_methods"}, {"score": 0.0028745946327439656, "phrase": "new_conceptual_interpretation"}, {"score": 0.0027194778713860715, "phrase": "single_pass"}, {"score": 0.0026058621464926826, "phrase": "novel_design_tool"}, {"score": 0.002550842302473891, "phrase": "po_function"}, {"score": 0.0021049977753042253, "phrase": "hmt."}], "paper_keywords": ["Machine vision", " morphological operations", " object recognition", " segmentation"], "paper_abstract": "The hit-or-miss transform (HMT) is a well-known morphological transform capable of identifying features in digital images. When image features contain noise, texture, or some other distortion, the HMT may fail. Various researchers have extended the HMT in different ways to make it more robust to noise. The most successful, and most recent extensions of the HMT for noise robustness, use rank-order operators in place of standard morphological erosions and dilations. A major issue with the proposed methods is that no technique is provided for calculating the parameters that are introduced to generalize the HMT, and, in most cases, these parameters are determined empirically. We present here, a new conceptual interpretation of the HMT which uses a percentage occupancy (PO) function to implement the erosion and dilation operators in a single pass of the image. Further, we present a novel design tool, derived from this PO function that can be used to determine the only parameter for our routine and for other generalizations of the HMT proposed in the literature. We demonstrate the power of our technique using a set of very noisy images and draw a comparison between our method and the most recent extensions of the HMT.", "paper_title": "A New Design Tool for Feature Extraction in Noisy Images Based on Grayscale Hit-or-Miss Transforms", "paper_id": "WOS:000291823600014"}