{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "picture-logic_puzzles"}, {"score": 0.004749824776508639, "phrase": "picture-logic_puzzle"}, {"score": 0.004539005582217305, "phrase": "n_x_m_grid"}, {"score": 0.003378385493203297, "phrase": "mobile_phones"}, {"score": 0.0033326252993345685, "phrase": "main_problem"}, {"score": 0.0031845067058084583, "phrase": "large_number"}, {"score": 0.002988101395789399, "phrase": "generation_process"}, {"score": 0.0029209233709517634, "phrase": "important_task"}, {"score": 0.0027910516355928983, "phrase": "automated_generation"}, {"score": 0.0025951294037626174, "phrase": "digital_rgb_color_image"}, {"score": 0.002525248554951453, "phrase": "visualization_interface"}, {"score": 0.0024460897937643032, "phrase": "puzzle_generation_process"}, {"score": 0.002305589818994465, "phrase": "puzzle_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["picture-logic puzzles", " puzzles solvers", " graphic interfaces", " automated puzzles generation", " algorithms", " heuristics"], "paper_abstract": "A picture-logic puzzle is a game that takes the form of an N x M grid, with numbers situated on the left of its rows and on the top of its columns, which give the clues for solving the puzzle. These puzzles have gained popularity in the last years all over the world, and there are companies involved in the commercialization of products related to them, mainly magazines, on-line puzzles via the web and games for mobile phones. The main problem with selling picture-logic puzzles is the need to generate a large number of picture-logic puzzles per month, or even per week, so automating the generation process of such puzzles is an important task. In this paper we propose algorithms for the automated generation of picture-logic puzzles (both black and white and color puzzles), starting from any digital RGB color image. We also present a visualization interface which provides several useful tools for finishing the puzzle generation process, like the possibility of changing colors and displaying the process of puzzle solution. We show the performance of the algorithms for generating picture-logic puzzles with several examples. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Automated generation and visualization of picture-logic puzzles", "paper_id": "WOS:000251127000008"}