{"auto_keywords": [{"score": 0.049188612914091503, "phrase": "doctor_patient_relationship"}, {"score": 0.00481495049065317, "phrase": "primary_care_consultation"}, {"score": 0.004778923541463994, "phrase": "objective_studies"}, {"score": 0.004318027255281003, "phrase": "widespread_adoption"}, {"score": 0.004205940624913343, "phrase": "third_party"}, {"score": 0.003916098498242888, "phrase": "new_relationship"}, {"score": 0.0036052633308076933, "phrase": "goffman's_dramaturgy"}, {"score": 0.0035648266669315943, "phrase": "patients'_approaches"}, {"score": 0.0035248419365839856, "phrase": "doctor's_computer"}, {"score": 0.0033947594838968326, "phrase": "patient_doctor_relationship"}, {"score": 0.0033190180867511605, "phrase": "australian_general_practice"}, {"score": 0.0031845067058084613, "phrase": "hermeneutic_framework"}, {"score": 0.0031606404966938568, "phrase": "results_patients"}, {"score": 0.00266837303806956, "phrase": "doctor's_desk"}, {"score": 0.0023214774334744713, "phrase": "doctor's_statements"}, {"score": 0.0021209097150420896, "phrase": "triadic_relationship"}, {"score": 0.0021049977753042253, "phrase": "routine_use"}], "paper_keywords": [""], "paper_abstract": "Objective Studies of the doctor patient relationship have focused on the elaboration of power and/or authority using a range of techniques to study the encounter between doctor and patient. The widespread adoption of computers by doctors brings a third party into the consultation. While there has been some research into the way doctors view and manage this new relationship, the behavior of patients in response to the computer is rarely studied. In this paper, the authors use Goffman's dramaturgy to explore patients' approaches to the doctor's computer in the consultation, and its influence on the patient doctor relationship. Design Observational study of Australian general practice. 141 consultations from 20 general practitioners were videotaped and analyzed using a hermeneutic framework. Results Patients negotiated the relationship between themselves, the doctor, and the computer demonstrating two themes: dyadic (dealing primarily with the doctor) or triadic (dealing with both computer and doctor). Patients used three signaling behaviors in relation to the computer on the doctor's desk (screen watching, screen ignoring, and screen excluding) to influence the behavior of the doctor. Patients were able to draw the doctor to the computer, and used the computer to challenge doctor's statements. Conclusion This study demonstrates that in consultations where doctors use computers, the computer can legitimately be regarded as part of a triadic relationship. Routine use of computers in the consultation changes the doctor patient relationship, and is altering the distribution of power and authority between doctor and patient.", "paper_title": "The patient and the computer in the primary care consultation", "paper_id": "WOS:000288718400007"}