{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "recommender_system"}, {"score": 0.049558064870310475, "phrase": "sport_videos"}, {"score": 0.004685012337701536, "phrase": "user_audiovisual_consumption"}, {"score": 0.004222299135545249, "phrase": "large-scale_events"}, {"score": 0.003910740988145338, "phrase": "audiovisual_consumption"}, {"score": 0.003602302241898501, "phrase": "client_side"}, {"score": 0.003373101013123386, "phrase": "central_server"}, {"score": 0.003264010423431402, "phrase": "large_number"}, {"score": 0.0027691111795848183, "phrase": "implicit_information"}, {"score": 0.0024011766029754006, "phrase": "specific_action"}, {"score": 0.002361992359512022, "phrase": "important_characteristic"}, {"score": 0.0021049977753042253, "phrase": "previous_systems"}], "paper_keywords": ["Audiovisual consumption", " hidden Markov model (HMM)", " recommender system", " sport videos"], "paper_abstract": "This paper describes a recommender system for sport videos, transmitted over the Internet and/or broadcast, in the context of large-scale events, which has been tested for the Olympic Games. The recommender is based on audiovisual consumption and does not depend on the number of users, running only on the client side. This avoids the concurrence, computation and privacy problems of central server approaches in scenarios with a large number of users, such as the Olympic Games. The system has been designed to take advantage of the information available in the videos, which is used along with the implicit information of the user and the modeling of his/her audiovisual content consumption. The system is thus transparent to the user, who does not need to take any specific action. Another important characteristic is that the system can produce recommendations for both live and recorded events. Testing has showed advantages compared to previous systems, as will be shown in the results.", "paper_title": "Recommender System for Sport Videos Based on User Audiovisual Consumption", "paper_id": "WOS:000311800400005"}