{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "google_scholar"}, {"score": 0.009270500609763645, "phrase": "citation_data"}, {"score": 0.006173947270617779, "phrase": "social_sciences"}, {"score": 0.0045804107341714, "phrase": "nobel_prize_winners"}, {"score": 0.004240120484148769, "phrase": "scopus"}, {"score": 0.0038368442918503072, "phrase": "alternative_source"}, {"score": 0.003683097597914604, "phrase": "credible_alternative"}, {"score": 0.003503497128638099, "phrase": "comprehensive_coverage"}, {"score": 0.0034403745992576808, "phrase": "non-biased_comparisons"}, {"score": 0.0032725712584012953, "phrase": "longitudinal_study"}, {"score": 0.0031129269142224194, "phrase": "considerable_stability"}, {"score": 0.002765776659294382, "phrase": "google_scholar's_coverage"}, {"score": 0.002153450937601075, "phrase": "traditionally_disadvantaged_position"}, {"score": 0.0021049977753042253, "phrase": "citation_analysis"}], "paper_keywords": ["Google Scholar", " Web of science", " Social sciences", " Citation analysis"], "paper_abstract": "Most governmental research assessment exercises do not use citation data for the Social Sciences and Humanities as Web of Science or Scopus coverage in these disciplines is considered to be insufficient. We therefore assess to what extent Google Scholar can be used as an alternative source of citation data. In order to provide a credible alternative, Google Scholar needs to be stable over time, display comprehensive coverage, and provide non-biased comparisons across disciplines. This article assesses these conditions through a longitudinal study of 20 Nobel Prize winners in Chemistry, Economics, Medicine and Physics. Our results indicate that Google Scholar displays considerable stability over time. However, coverage for disciplines that have traditionally been poorly represented in Google Scholar (Chemistry and Physics) is increasing rapidly. Google Scholar's coverage is also comprehensive; all of the 800 most cited publications by our Nobelists can be located in Google Scholar, although in four cases there are some problems with the results. Finally, we argue that Google Scholar might provide a less biased comparison across disciplines than the Web of Science. The use of Google Scholar might therefore redress the traditionally disadvantaged position of the Social Sciences in citation analysis.", "paper_title": "A preliminary test of Google Scholar as a source for citation data: a longitudinal study of Nobel prize winners", "paper_id": "WOS:000314753500017"}