{"auto_keywords": [{"score": 0.04464053001280883, "phrase": "organizational_ecology"}, {"score": 0.03524369468825586, "phrase": "project's_ability"}, {"score": 0.004501774379030109, "phrase": "long-term_sustainability"}, {"score": 0.00433200902751133, "phrase": "project_sustainability"}, {"score": 0.0038415135083689836, "phrase": "sourceforge"}, {"score": 0.003643607569483598, "phrase": "project's_development_base"}, {"score": 0.003108814986752103, "phrase": "perceived_project_legitimacy"}, {"score": 0.0030058503645435455, "phrase": "strong_predictor"}, {"score": 0.0029627701619228527, "phrase": "project's_future_sustainability"}, {"score": 0.002837188425640173, "phrase": "user_resources"}, {"score": 0.0027564303939865476, "phrase": "mediating_role"}, {"score": 0.0021876814398268775, "phrase": "floss_development_environment"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["FLOSS", " sustainability", " organizational ecology", " legitimacy", " developer activity"], "paper_abstract": "This paper examines the factors that influence the long-term sustainability of FLOSS projects. A model of project sustainability based on organizational ecology is developed and tested empirically. Data about activity and contribution patterns over the course of five years for 2,772 projects registered with SourceForge is analyzed. Our results suggest that the size of the project's development base, project age and the size of niche occupied by the project are positively related to the project's ability to attract user and/or developer resources. The ability to attract resources is an indicator of the perceived project legitimacy, which in turn is a strong predictor of the project's future sustainability. Thus a project's ability to attract developer and user resources is shown to play a mediating role between the demographic (size and age) and ecological (niche) characteristics of the project and its future sustainability. Our results support the applicability of tenets of organizational ecology related to the liability of smallness, the liability of newness, and population characteristics (niche size) to the FLOSS development environment. The implications of the results for future research and practice are discussed.", "paper_title": "Sustainability of Free/Libre Open Source Projects: A Longitudinal Study", "paper_id": "WOS:000286316700003"}