{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "twitter"}, {"score": 0.006845423034304368, "phrase": "published_work"}, {"score": 0.004547782274166457, "phrase": "microblogging_system"}, {"score": 0.004479961909330417, "phrase": "rich_dataset"}, {"score": 0.004143196873246147, "phrase": "twitter_based_research"}, {"score": 0.0038663716354483176, "phrase": "microblogging_research"}, {"score": 0.003740568332108757, "phrase": "open_coded_content_analysis"}, {"score": 0.0036847412633483788, "phrase": "paper's_title"}, {"score": 0.003267003547703286, "phrase": "methodological_approaches"}, {"score": 0.003198912570466607, "phrase": "identified_domains"}, {"score": 0.0030577296589049704, "phrase": "database_search"}, {"score": 0.002940406485632161, "phrase": "full_papers"}, {"score": 0.002719055901632759, "phrase": "book_chapters"}, {"score": 0.002461883922643093, "phrase": "overarching_study"}, {"score": 0.002360250030403706, "phrase": "research_subject"}, {"score": 0.0023390219342052623, "phrase": "paper's_major_contribution"}, {"score": 0.0021563397322290445, "phrase": "twitter_related_topics"}], "paper_keywords": ["Twitter", " Microblogging", " Abstracts", " Papers", " Classification", " Social network systems", " Social networking sites", " Blogs"], "paper_abstract": "Purpose - Since its introduction in 2006, messages posted to the microblogging system Twitter have provided a rich dataset for researchers, leading to the publication of over a thousand academic papers. This paper aims to identify this published work and to classify it in order to understand Twitter based research. Design/methodology/approach - Firstly the papers on Twitter were identified. Secondly, following a review of the literature, a classification of the dimensions of microblogging research was established. Thirdly, papers were qualitatively classified using open coded content analysis, based on the paper's title and abstract, in order to analyze method, subject, and approach. Findings - The majority of published work relating to Twitter concentrates on aspects of the messages sent and details of the users. A variety of methodological approaches is used across a range of identified domains. Research limitations/implications - This work reviewed the abstracts of all papers available via database search on the term \"Twitter\" and this has two major implications: the full papers are not considered and so works may be misclassified if their abstract is not clear; publications not indexed by the databases, such as book chapters, are not included. The study is focussed on microblogging, the applicability of the approach to other media is not considered. Originality/value - To date there has not been an overarching study to look at the methods and purpose of those using Twitter as a research subject. The paper's major contribution is to scope out papers published on Twitter until the close of 2011. The classification derived here will provide a framework within which researchers studying Twitter related topics will be able to position and ground their work.", "paper_title": "What do people study when they study Twitter? Classifying Twitter related academic papers", "paper_id": "WOS:000320742000004"}