{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_random_variables"}, {"score": 0.019370760952736422, "phrase": "fuzzy_random_variable"}, {"score": 0.004451546786101008, "phrase": "linguistic_label_information"}, {"score": 0.004290112502811656, "phrase": "classical_random_variables"}, {"score": 0.0037177622939493084, "phrase": "crisp_number"}, {"score": 0.0035010071030752883, "phrase": "second_case"}, {"score": 0.0033739270918502285, "phrase": "fuzzy_interval"}, {"score": 0.0032968474833776906, "phrase": "gradual_description"}, {"score": 0.00288317238346065, "phrase": "random_variables"}, {"score": 0.0028303313661029597, "phrase": "fuzzy_relation"}, {"score": 0.0027913353347879507, "phrase": "ill-known_conditional_probability"}, {"score": 0.0025447065763362984, "phrase": "imprecise_probabilities"}, {"score": 0.0025096359514694523, "phrase": "new_variance"}, {"score": 0.0024750474634399797, "phrase": "real_interval"}, {"score": 0.0023851187337905412, "phrase": "previous_definitions"}, {"score": 0.002341384304635523, "phrase": "representation_simplicity"}, {"score": 0.002225196379204285, "phrase": "simple_examples"}], "paper_keywords": ["Fuzzy random variable", " imprecise probabilities", " random set", " second-order possibility measure", " variance"], "paper_abstract": "Fuzzy random variables possess several interpretations. Historically, they were proposed either as a tool for handling linguistic label information in statistics or to represent uncertainty about classical random variables. Accordingly, there are two different approaches to the definition of the variance of a fuzzy random variable. In the first one, the variance of the fuzzy random variable is defined as a crisp number, which makes it easier to handle in further processing. In the second case, the variance is defined as a fuzzy interval, thus offering a gradual description of our incomplete knowledge about the variance of an underlying, imprecisely observed, classical random variable. In this paper, we also discuss another view of fuzzy random variables, which comes down to a set of random variables induced by a fuzzy relation describing an ill-known conditional probability. This view leads to yet another definition of the variance of a fuzzy random variable in the context of the theory of imprecise probabilities. The new variance is a real interval, which achieves a compromise between both previous definitions in terms of representation simplicity. Our main objective is to demonstrate, with the help of simple examples, the practical significance of these definitions of variance induced by various existing views of fuzzy random variables.", "paper_title": "On the Variability of the Concept of Variance for Fuzzy Random Variables", "paper_id": "WOS:000270591900007"}