{"auto_keywords": [{"score": 0.0369853278754472, "phrase": "milc"}, {"score": 0.00481495049065317, "phrase": "key_issue"}, {"score": 0.004762893197005439, "phrase": "mobile_application"}, {"score": 0.004060719270512444, "phrase": "gartner"}, {"score": 0.003958937342925219, "phrase": "consumer_mobile_applications"}, {"score": 0.0037222099716098783, "phrase": "location-based_services"}, {"score": 0.0036553070575015344, "phrase": "mobile_instant_messaging"}, {"score": 0.003537886893587656, "phrase": "novel_application"}, {"score": 0.0033021988455635403, "phrase": "interchange_geographic_co-ordinates"}, {"score": 0.0032664447473827953, "phrase": "splashes"}, {"score": 0.003037736332283186, "phrase": "real_security"}, {"score": 0.0028352726653271187, "phrase": "acceptable_level"}, {"score": 0.0025059724686541263, "phrase": "theoretical_background"}, {"score": 0.002460876181416983, "phrase": "technical_part"}, {"score": 0.0023903999901926224, "phrase": "milc_system"}, {"score": 0.0023051296931856265, "phrase": "different_services"}, {"score": 0.002263639474937039, "phrase": "system_architecture"}, {"score": 0.002151388538895855, "phrase": "google's_android_os"}, {"score": 0.0021049977753042253, "phrase": "proposed_system"}], "paper_keywords": ["Mobile social networking", " Virtual communities", " Security", " Privacy", " Chat", " Location-based services", " Spatial messaging"], "paper_abstract": "The key issue for any mobile application or service is the way it is delivered and experienced by users, who eventually may decide to keep it on their software portfolio or not. Without doubt, security and privacy have both a crucial role to play towards this goal. Very recently, Gartner has identified the top ten of consumer mobile applications that are expected to dominate the market in the near future. Among them one can earmark location-based services in number 2 and mobile instant messaging in number 9. This paper presents a novel application namely MILC that blends both features. That is, MILC offers users the ability to chat, interchange geographic co-ordinates and make Splashes in real-time. At present, several implementations provide these services separately or jointly, but none of them offers real security and preserves the privacy of the end-users at the same time. On the contrary, MILC provides an acceptable level of security by utilizing both asymmetric and symmetric cryptography, and most importantly, put the user in control of her own personal information and her private sphere. The analysis and our contribution are threefold starting from the theoretical background, continuing to the technical part, and providing an evaluation of the MILC system. We present and discuss several issues, including the different services that MILC supports, system architecture, protocols, security, privacy etc. Using a prototype implemented in Google's Android OS, we demonstrate that the proposed system is fast performing, secure, privacy-preserving and potentially extensible.", "paper_title": "MILC: A secure and privacy-preserving mobile instant locator with chatting", "paper_id": "WOS:000305746400002"}