{"auto_keywords": [{"score": 0.03349261766104111, "phrase": "job_completion"}, {"score": 0.010670944589078704, "phrase": "cloud_resources"}, {"score": 0.00481495049065317, "phrase": "reliable_job_completion"}, {"score": 0.004645057834614705, "phrase": "major_performance_issue"}, {"score": 0.004603525341738782, "phrase": "large-scale_decentralized_distributed_systems"}, {"score": 0.004284302478991387, "phrase": "estimated_completion_times"}, {"score": 0.0041891398413899435, "phrase": "resource_performance_fluctuations"}, {"score": 0.0040777192615062815, "phrase": "advance_reservation"}, {"score": 0.0037608593980593035, "phrase": "non-negligent_practicality_hurdles"}, {"score": 0.003611751858608048, "phrase": "attractive_alternative"}, {"score": 0.003044455555031339, "phrase": "grid_resources"}, {"score": 0.0025892330566358503, "phrase": "independent_tasks"}, {"score": 0.0025545134727682716, "phrase": "job_model"}, {"score": 0.0024421008630165046, "phrase": "novel_rescheduling_technique"}, {"score": 0.002366361492754389, "phrase": "reliable_completion"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "A major performance issue in large-scale decentralized distributed systems, such as grids, is how to ensure that jobs finish their execution within the estimated completion times in the presence of resource performance fluctuations. Previously, several techniques including advance reservation, rescheduling and migration have been adopted to resolve/relieve this issue; however, they have some non-negligent practicality hurdles. The use of clouds may be an attractive alternative, since resources in clouds are much more reliable than those in grids. This paper investigates the effectiveness of rescheduling using cloud resources to increase the reliability of job completion. Specifically, schedules are initially generated using grid resources, and cloud resources (relatively costlier) are used only for rescheduling to cope with a delay in job completion. A job in our study refers to a bag-of-tasks (BoT) application that consists of a large number of independent tasks; this job model is common in many science and engineering applications. We have devised a novel rescheduling technique, called rescheduling using clouds for reliable completion (RC2) and applied it to three well-known existing heuristics. Our experimental results reveal that RC2 significantly reduces delay in job completion. (c) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Rescheduling for reliable job completion with the support of clouds", "paper_id": "WOS:000281508700014"}