{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "high_security_applications"}, {"score": 0.011947060069329085, "phrase": "hybrid_ensemble_framework"}, {"score": 0.011051344931686049, "phrase": "zero_false_acceptance_rate"}, {"score": 0.004555499634179394, "phrase": "civilian_or_forensic_applications"}, {"score": 0.004451546786101008, "phrase": "deficient_analysis"}, {"score": 0.004270347498153512, "phrase": "general_solutions"}, {"score": 0.004153647187175639, "phrase": "challenging_issue"}, {"score": 0.004040123129261597, "phrase": "systematic_analysis"}, {"score": 0.003787108326100196, "phrase": "performance_requirements"}, {"score": 0.0037006243674469657, "phrase": "double_low_problem"}, {"score": 0.003484864867147635, "phrase": "adequately_high_threshold"}, {"score": 0.0032066653632708965, "phrase": "false_reject_rate"}, {"score": 0.0025683581446365165, "phrase": "art_methods"}, {"score": 0.0025096359514694523, "phrase": "face_verification"}, {"score": 0.002418453525649304, "phrase": "large_reduction"}, {"score": 0.002396179086883187, "phrase": "incorrect_classification"}, {"score": 0.002225196379204285, "phrase": "gait_verification"}], "paper_keywords": ["biometric verification", " hybrid ensemble framework", " high security applications"], "paper_abstract": "Research on biometrics for high security applications has not attracted as much attention as civilian or forensic applications. Limited research and deficient analysis so far has led to a lack of general solutions and leaves this as a challenging issue. This work provides a systematic analysis and identification of the problems to be solved in order to meet the performance requirements for high security applications, a double low problem. A hybrid ensemble framework is proposed to solve this problem. Setting an adequately high threshold for each matcher can guarantee a zero false acceptance rate (FAR) and then use the hybrid ensemble framework makes the false reject rate (FRR) as low as possible. Three experiments are performed to verify the effectiveness and generalization of the framework. First, two fingerprint verification algorithms are fused. In this test only 10.55% of fingerprints are falsely rejected with zero false acceptance rate, this is significantly lower than other state of the art methods. Second, in face verification, the framework also results in a large reduction in incorrect classification. Finally, assessing the performance of the framework on a combination of face and gait verification using a heterogeneous database show this framework can achieve both 0% false rejection and 0% false acceptance simultaneously.", "paper_title": "A hybrid biometric identification framework for high security applications", "paper_id": "WOS:000354194300006"}