{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "competitive_positioning"}, {"score": 0.01052600853621539, "phrase": "complementary_organisational_resources"}, {"score": 0.00954218890326824, "phrase": "sustainable_improvements"}, {"score": 0.0045084510240032535, "phrase": "resource-based_theory"}, {"score": 0.004221379262804442, "phrase": "information_systems_initiatives"}, {"score": 0.004135458387200662, "phrase": "research_model"}, {"score": 0.0034364867143322274, "phrase": "new_is_initiative"}, {"score": 0.003394314924677555, "phrase": "indirect_contribution"}, {"score": 0.0030876784650745973, "phrase": "main_limitations"}, {"score": 0.0029753513692467315, "phrase": "\"convenience\"_sample"}, {"score": 0.0022117133940361025, "phrase": "significant_departure"}, {"score": 0.0021049977753042253, "phrase": "process-level_impacts"}], "paper_keywords": ["Resource-based view", " Improved competitive positioning", " Sustainability", " Complementary resources", " Resources", " Competitive strategy", " Information systems"], "paper_abstract": "Purpose - In this paper, the authors seek to draw upon resource-based theory to explore the role of existing, complementary organisational resources, in leveraging sustainable improvements in competitive positioning, resulting from information systems initiatives. Design/methodology/approach - A research model has been derived from the literature, which is then used to guide the conduct of a major, integrated quantitative and qualitative survey of managers. Findings - In this paper, it is shown that improvements in competitive positioning are likely to be more significant and sustainable when a new IS initiative makes an indirect contribution, through the leveraging of complementary organisational resources, rather than stemming directly from the functionality of the IT asset. Research limitations/implications - The main limitations of this study relate to its use of a \"convenience\" sample and a \"single-informant\". However, both these comprises were viewed as being worthwhile, as it gave the authors the opportunity to conduct a study that was both broad and deep, in terms of the data collected. Practical implications - The authors draw out the implications of their empirical study for the management of IT projects, to improve their ability to deliver sustainable improvements in competitive positioning. Originality/value - This research makes a significant departure from the aggregated, enterprise-level orientation of prior studies, by focusing upon the process-level impacts of individual IS initiatives.", "paper_title": "Improving competitive positioning through complementary organisational resources", "paper_id": "WOS:000319640600005"}