{"auto_keywords": [{"score": 0.04765491130400516, "phrase": "anonymous_communication_systems"}, {"score": 0.029962918011620092, "phrase": "analysis_results"}, {"score": 0.004396790930873782, "phrase": "load_balance"}, {"score": 0.004102639724186862, "phrase": "system_designs"}, {"score": 0.0037623642073222547, "phrase": "system_design"}, {"score": 0.003405671497507337, "phrase": "quantitative_analysis"}, {"score": 0.0033471722682967046, "phrase": "information_theory"}, {"score": 0.0031502008922533894, "phrase": "key_system_design_strategies"}, {"score": 0.0030960762496815737, "phrase": "network_architecture"}, {"score": 0.002913837945508097, "phrase": "anonymous_communications"}, {"score": 0.002558549084795168, "phrase": "system_scale"}, {"score": 0.0024713335323674223, "phrase": "higher_anonymity"}, {"score": 0.0022464835515931592, "phrase": "possible_strategies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Anonymity analysis", " Anonymous communications", " Peer-to-peer", " Network security"], "paper_abstract": "Compared with traditional static Client/Server architecture, the P2P architecture is more suitable for anonymous communication systems because it is more flexible and can keep load balance better. However, in order to make the system usable and reliable, some system designs make tradeoffs between anonymity and performance such as reliability, latency and throughput. Tradeoffs are sometimes unavoidable in system design, but which tradeoffs are acceptable and which are not is very important for developers. This paper models the P2P anonymous communications and takes quantitative analysis of anonymity by information theory with entropy. Based on this analysis, it studies the effect of key system design strategies on anonymity in network architecture, routing and message relay, and measures which strategies should be used in anonymous communications and which are unreasonable. Some analysis results are contrary to our intuition. For example, it quantitatively concludes that in some cases the anonymity is not enhanced when the system scale increases, and too long an anonymous tunnel may not provide higher anonymity but lowers performance. These analysis results are valuable for developers of P2P anonymous communication systems. Besides, this paper also discusses some possible strategies such as trust and reputation to enhance the P2P anonymous communications. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Anonymity analysis of P2P anonymous communication systems", "paper_id": "WOS:000287274400019"}