{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "chromatogram_handler"}, {"score": 0.004646852519870358, "phrase": "liquid_chromatographic_investigations"}, {"score": 0.0046194096969523315, "phrase": "organic_ligand_adsorption"}, {"score": 0.004592128194844475, "phrase": "mineral_surfaces"}, {"score": 0.004042866322177613, "phrase": "geochemically-relevant_ligands"}, {"score": 0.004007083686875716, "phrase": "dissolved_organic_matter"}, {"score": 0.003517107332500739, "phrase": "data_management"}, {"score": 0.0033641042076609645, "phrase": "large_data_volumes"}, {"score": 0.0032177356154317895, "phrase": "processing_run"}, {"score": 0.0031703706626348507, "phrase": "detector_output_files"}, {"score": 0.003132979607342419, "phrase": "lc_experiment"}, {"score": 0.0030504492628487413, "phrase": "ms_excel_output_file"}, {"score": 0.0029966367645372096, "phrase": "detection_channel"}, {"score": 0.0027741761880779535, "phrase": "raw_data"}, {"score": 0.002685089327921282, "phrase": "multiple_detection_channels"}, {"score": 0.0026143265665547525, "phrase": "recovery_values"}, {"score": 0.0025758208205978825, "phrase": "different_detection_channels"}, {"score": 0.0023987234349331383, "phrase": "additional_operations"}, {"score": 0.0023704114738284667, "phrase": "multi-channel_experiments"}, {"score": 0.0023079225317714815, "phrase": "differing_surface_behavior"}, {"score": 0.0022942608418577313, "phrase": "distinct_dom_sub-fractions"}, {"score": 0.0022470772167953123, "phrase": "spectroscopic_indices"}, {"score": 0.0022271532243556373, "phrase": "useful_new_form"}, {"score": 0.002168432656901106, "phrase": "solution-phase_dom_composition"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["C#", " Liquid chromatography", " Adsorption", " Absorbance", " Fluorescence", " Metal oxide", " Adsorptive fractionation"], "paper_abstract": "We describe a unique C# computer program developed in our laboratory to efficiently manipulate data generated when a novel liquid chromatographic (LC) 'pulsed addition' technique is used to study organic ligand interactions with mineral surfaces. We are not aware of the existence of a program of this nature elsewhere. Geochemically-relevant ligands studied include dissolved organic matter (DOM) mixtures and single component low molecular weight organic acids. Although our LC system has three optical (absorbance and fluorescence) detection channels, the utility can process data from experiments in which data was collected in one, two or three detection channels. If not automated, data management and processing for the technique is prohibitively complex and time-consuming, due large data volumes and the number of operations involved. The input for the utility in a processing run is the set of detector output files generated during an LC experiment. During processing, the utility generates an MS Excel output file within which, for each detection channel: (i) chromatographic peak areas and peak retention times are determined, (ii) area-normalized per-injection and cumulative adsorption densities are calculated, and (iii) graphical representations of various quantities calculated from the raw data are automatically generated. When processing data from experiments with multiple detection channels, the utility additionally prepares graphs that compare recovery values calculated from data in different detection channels, and calculates (and plots) spectroscopic/chromatographic indices which are ratios of signals in various detection channels. The utility was programmed to perform these additional operations on data from multi-channel experiments because (i) 'Interchannel' comparisons of recovery provide insight into the differing surface behavior of distinct DOM sub-fractions, and (ii) the spectroscopic indices provide a useful new form of data that provides insight into changes in solution-phase DOM composition due to adsorptive fractionation. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Chromatogram Handler: A unique computer program that efficiently processes data generated in liquid chromatographic investigations of organic ligand adsorption on mineral surfaces", "paper_id": "WOS:000307924200017"}