{"auto_keywords": [{"score": 0.0375870267646803, "phrase": "users'_location_privacy"}, {"score": 0.00481495049065317, "phrase": "mobile_crowd"}, {"score": 0.004436716583179764, "phrase": "lbs_server"}, {"score": 0.004189698902282913, "phrase": "private_information"}, {"score": 0.004121680445736014, "phrase": "lbs"}, {"score": 0.003924121879214595, "phrase": "user-collaborative_privacy-preserving_approach"}, {"score": 0.003751331782523201, "phrase": "lbs_server_architecture"}, {"score": 0.0036753171449945654, "phrase": "third_party_servers"}, {"score": 0.0034422330919613294, "phrase": "mobile_devices"}, {"score": 0.0030069962181403487, "phrase": "sought_information"}, {"score": 0.002921975748248106, "phrase": "bayesian_localization_attacks"}, {"score": 0.0028744731986533076, "phrase": "strong_adversaries"}, {"score": 0.002827740707723551, "phrase": "prior_knowledge"}, {"score": 0.0027477745788313163, "phrase": "novel_epidemic_model"}, {"score": 0.0025945450101602825, "phrase": "bayesian_inference_framework"}, {"score": 0.002459902948098627, "phrase": "users'_querying_rates"}, {"score": 0.0024099937116733227, "phrase": "context_information"}, {"score": 0.002294294558114909, "phrase": "high_fraction"}, {"score": 0.002275557501858879, "phrase": "location-based_queries"}, {"score": 0.002184137736856711, "phrase": "real_mobility"}, {"score": 0.0021049977753042253, "phrase": "mobile_platforms"}], "paper_keywords": ["Mobile networks", " location-based services", " location privacy", " Bayesian inference attacks", " epidemic models"], "paper_abstract": "Location-aware smartphones support various location-based services (LBSs): users query the LBS server and learn on the fly about their surroundings. However, such queries give away private information, enabling the LBS to track users. We address this problem by proposing a user-collaborative privacy-preserving approach for LBSs. Our solution does not require changing the LBS server architecture and does not assume third party servers; yet, it significantly improves users' location privacy. The gain stems from the collaboration of mobile devices: they keep their context information in a buffer and pass it to others seeking such information. Thus, a user remains hidden from the server, unless all the collaborative peers in the vicinity lack the sought information. We evaluate our scheme against the Bayesian localization attacks that allow for strong adversaries who can incorporate prior knowledge in their attacks. We develop a novel epidemic model to capture the, possibly time-dependent, dynamics of information propagation among users. Used in the Bayesian inference framework, this model helps analyze the effects of various parameters, such as users' querying rates and the lifetime of context information, on users' location privacy. The results show that our scheme hides a high fraction of location-based queries, thus significantly enhancing users' location privacy. Our simulations with real mobility traces corroborate our model-based findings. Finally, our implementation on mobile platforms indicates that it is lightweight and the cost of collaboration is negligible.", "paper_title": "Hiding in the Mobile Crowd: Location Privacy through Collaboration", "paper_id": "WOS:000342084700007"}