{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "consistent_initialization"}, {"score": 0.038754497436400887, "phrase": "dae_systems"}, {"score": 0.033432006348234344, "phrase": "proposed_approach"}, {"score": 0.004489810932879285, "phrase": "consistent_initial_conditions"}, {"score": 0.004321772629297024, "phrase": "successful_solution"}, {"score": 0.004267163206961948, "phrase": "differential-algebraic_equation"}, {"score": 0.00378145978325955, "phrase": "efficient_perturbation_approach"}, {"score": 0.003503497128638099, "phrase": "dae_models"}, {"score": 0.0033508547759861186, "phrase": "different_existing_solvers"}, {"score": 0.0030457198309616694, "phrase": "nonlinear_solver"}, {"score": 0.002532151331015729, "phrase": "wider_range"}, {"score": 0.0025000985765154028, "phrase": "inconsistent_initial_conditions"}, {"score": 0.0023309080951251335, "phrase": "present_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["DAE", " Initialization", " Consistent initial condition", " Perturbation approach", " Index-1 DAEs"], "paper_abstract": "Estimation of consistent initial conditions is very crucial for the successful solution of differential-algebraic equation (DAE) systems that arise in many fields of science and engineering. In this paper, an efficient perturbation approach for initialization of DAE systems of index-1 is proposed and implemented for DAE models governing batteries. In addition, different existing solvers are compared for consistent initialization of DAE systems. The proposed approach does not necessarily require a nonlinear solver for initialization and builds on the applicability and usability of robust and efficient explicit, linearly implicit and semi-implicit integrators in time. Three different problems are presented wherein the proposed approach is observed to work for a wider range of inconsistent initial conditions compared to other existing generally used routines. It is also observed that the present approach is computationally efficient compared to the other existing approaches in a given environment. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A perturbation approach for consistent initialization of index-1 explicit differential-algebraic equations arising from battery model simulations", "paper_id": "WOS:000295723900006"}