{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "magnetic_thrusts"}, {"score": 0.009868928965769583, "phrase": "high-dynamics_linear_actuators"}, {"score": 0.009516775404636722, "phrase": "optimal_topology"}, {"score": 0.009387950962420724, "phrase": "permanent_magnets"}, {"score": 0.008494582580813143, "phrase": "design_space"}, {"score": 0.004771196027464407, "phrase": "topology_optimization_methods"}, {"score": 0.004727837281331949, "phrase": "purpose_-_the_paper"}, {"score": 0.0039027036493682887, "phrase": "topology_optimization_method"}, {"score": 0.003545625043276134, "phrase": "-_several_aspects"}, {"score": 0.00325069754015951, "phrase": "weight_constraint"}, {"score": 0.003021392767766593, "phrase": "moving_part"}, {"score": 0.002953097497434808, "phrase": "local_minimizers"}, {"score": 0.0029128614098881253, "phrase": "optimization_problem"}, {"score": 0.0028340217672278975, "phrase": "different_magnetization_directions"}, {"score": 0.0023927516438886445, "phrase": "magnetization_directions"}, {"score": 0.002370955769074803, "phrase": "practical_implications"}, {"score": 0.0021834945657804193, "phrase": "mechanical_thrusts"}, {"score": 0.0021049977753042253, "phrase": "topology_optimization_approach"}], "paper_keywords": ["Optimization techniques", " Actuators", " Finite element analysis", " Topologies"], "paper_abstract": "Purpose - The paper aims at optimizing magnetic thrusts in the framework of the design of high-dynamics linear actuators. The goal is to find the optimal topology of the permanent magnets in order to maximize the velocity of the actuator. Design/methodology/approach - The optimization is performed by a topology optimization method. The design space is divided in cells in which the method have to distribute permanent magnets and determine their magnetization directions. Findings - Several aspects of the optimization are discussed in the paper, such as the effect of the introduction of a weight constraint on the thrust. Some issues are highlighted regarding the length of design space for the moving part and the presence of local minimizers in the optimization problem. Research limitations/implications - Having different magnetization directions in each cell makes the manufacturing harder. The results could thus be completed either by the design of a system able to create such permanent magnets or by the introduction of a constraint limiting the number of magnetization directions. Practical implications - Finding the optimal topology of magnetic thrusts is motivated by the interest in avoiding the shocks related to mechanical thrusts. Originality/value - This paper applies the topology optimization approach for the design of magnetic thrusts in order to increase the performances of high-dynamics linear actuators.", "paper_title": "Design of magnetic thrusts using topology optimization methods", "paper_id": "WOS:000289045400014"}