{"auto_keywords": [{"score": 0.0442639629630938, "phrase": "strictly_temporally_periodic_configurations"}, {"score": 0.036115158017236984, "phrase": "cellular_automaton"}, {"score": 0.015094621173936337, "phrase": "dynamical_complexity"}, {"score": 0.014494016758311584, "phrase": "surjective_cellular_automata"}, {"score": 0.00804959036919008, "phrase": "strictly_temporally_periodic_points"}, {"score": 0.00481495049065317, "phrase": "cellular_automata"}, {"score": 0.004487989502479992, "phrase": "periodic_configurations"}, {"score": 0.003119760592916715, "phrase": "strictly_positive_measure"}, {"score": 0.0027417911324611917, "phrase": "almost_equicontinuous_surjective_cellular_automata"}, {"score": 0.002615977783510631, "phrase": "positively_expansive_ones"}, {"score": 0.0025254115243261875, "phrase": "additive_cellular_automata"}, {"score": 0.0021049977753042253, "phrase": "general_transitive_cellular_automata"}], "paper_keywords": ["cellular automata", " symbolic dynamics", " spatially and temporally periodic configurations"], "paper_abstract": "We investigate the relationships between dynamical complexity and the set of periodic configurations of surjective Cellular Automata. We focus on the set of strictly temporally periodic configurations, i.e., the set of those configurations which are temporally but not spatially periodic for a given surjective automaton. The cardinality of this set turns out to be inversely related to the dynamical complexity of the cellular automaton. In particular, we show that for surjective Cellular Automata, the set of strictly temporally periodic configurations has strictly positive measure if and only if the cellular automaton is equicontinuous. Furthermore, we show that the set of strictly temporally periodic configurations is dense for almost equicontinuous surjective cellular automata, while it is empty for the positively expansive ones. In the class of additive cellular automata, the set of strictly temporally periodic points can be either dense or empty. The latter happens if and only if the cellular automaton is topologically transitive. This is not true for general transitive Cellular Automata, where the set of of strictly temporally periodic points can be non-empty and non-dense.", "paper_title": "Periodic Orbits and Dynamical Complexity in Cellular Automata", "paper_id": "WOS:000324968900004"}