{"auto_keywords": [{"score": 0.03426487420547398, "phrase": "local_decoding"}, {"score": 0.00481495049065317, "phrase": "alignment-free_comparison"}, {"score": 0.0046797114400479135, "phrase": "important_role"}, {"score": 0.004357927940322685, "phrase": "\"local_decoding"}, {"score": 0.004215397034321004, "phrase": "\"_an_alternative"}, {"score": 0.003603549914861701, "phrase": "hidden_markov_modeling"}, {"score": 0.003022186855664124, "phrase": "total_length"}, {"score": 0.0028274743316389437, "phrase": "memory_space"}, {"score": 0.0024281181691350085, "phrase": "length_n."}, {"score": 0.0022393843660697484, "phrase": "reference_alignment-based_distance"}, {"score": 0.0021049977753042253, "phrase": "recent_alignment-free_comparison"}], "paper_keywords": ["algorithm", " HMM decoding", " sequences comparison"], "paper_abstract": "Subword composition plays an important role in a lot of analyses of sequences. Here we define and study the \"local decoding of order N of sequences,\" an alternative that avoids some drawbacks of \"subwords of length N\" approaches while keeping informations about environments of length N in the sequences (\"decoding\" is taken here in the sense of hidden Markov modeling, i.e., associating some state to all positions of the sequence). We present an algorithm for computing the local decoding of order N of a given set of sequences. Its complexity is linear in the total length of the set (whatever the order N) both in time and memory space. In order to show a use of local decoding, we propose a very basic dissimilarity measure between sequences which can be computed both from local decoding of order N and composition in subwords of length N. The accuracies of these two dissimilarities are evaluated, over several datasets, by computing their linear correlations with a reference alignment-based distance. These accuracies are also compared to the one obtained from another recent alignment-free comparison.", "paper_title": "Local decoding of sequences and alignment-free comparison", "paper_id": "WOS:000241815900005"}