{"auto_keywords": [{"score": 0.04915207774681703, "phrase": "mixed_scale-free_networks"}, {"score": 0.040549873447721874, "phrase": "scale-free_networks"}, {"score": 0.015568434073667519, "phrase": "community_detection"}, {"score": 0.013078103573639399, "phrase": "node_degree"}, {"score": 0.012160445279871238, "phrase": "normal_distribution"}, {"score": 0.010822781634528681, "phrase": "scale-free_properties"}, {"score": 0.00481495049065317, "phrase": "weight_method"}, {"score": 0.004518442937844318, "phrase": "edge_weight_method"}, {"score": 0.003920891569777894, "phrase": "power_law"}, {"score": 0.003572766402294553, "phrase": "community_detection_algorithms"}, {"score": 0.002689430273401131, "phrase": "power_law_distribution"}, {"score": 0.0023104373174118458, "phrase": "nmi_-_normalized_mutual_information_-"}, {"score": 0.0022107428653358715, "phrase": "scale-free_and_non_scale-free_community_detection_methods"}], "paper_keywords": ["Community detection", " scale-free", " weighting scheme"], "paper_abstract": "In this paper, we proposed an edge weight method for performing a community detection on mixed scale-free networks. We use the phrase \"mixed scale-free networks\" for networks where some communities have node degree that follows a power law similar to scale-free networks, while some have node degree that follows normal distribution. In this type of network, community detection algorithms that are designed for scale-free networks will have reduced accuracy because some communities do not have scale-free properties. On the other hand, algorithms that are not designed for scale-free networks will also have reduced accuracy because some communities have scale-free properties. To solve this problem, our algorithm consists of two community detection steps; one is aimed at extracting communities whose node degree follows power law distribution (scale-free), while the other one is aimed at extracting communities whose node degree follows normal distribution (non scale-free). To evaluate our method, we use NMI - Normalized Mutual Information - to measure our results on both synthetic and real-world datasets comparing with both scale-free and non scale-free community detection methods. The results show that our method outperforms all other based line methods on mixed scale-free networks.", "paper_title": "Edge Weight Method for Community Detection on Mixed Scale-Free Networks", "paper_id": "WOS:000352909400004"}