{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "sketch_quality"}, {"score": 0.010690574406026854, "phrase": "toaster_concept"}, {"score": 0.004722254884093624, "phrase": "product-idea_creativity"}, {"score": 0.003721098220825489, "phrase": "different_backgrounds"}, {"score": 0.0034760655218366, "phrase": "idea_creativity"}, {"score": 0.003018468582368033, "phrase": "higher_quality_idea_sketches"}, {"score": 0.002931569771634119, "phrase": "higher_creativity_rank"}, {"score": 0.0027383842769094354, "phrase": "lower_creativity_rank"}, {"score": 0.0026337482179592422, "phrase": "toaster_idea"}, {"score": 0.0025829353063908256, "phrase": "highest_quality_level"}, {"score": 0.002366110899738696, "phrase": "idea_sketches"}, {"score": 0.0021049977753042253, "phrase": "design_curriculum"}], "paper_keywords": ["Creativity", " Idea Evaluation", " Sketching"], "paper_abstract": "This paper explores the relationship between the quality of a sketch and how others perceive the creativity of the idea portrayed by the sketch. In this study, sketch quality is characterized through its line work, perspective, and proportions. Four different toaster ideas were each sketched by four people with different backgrounds and levels of sketching proficiency. Then, 360 reviewers ranked the toasters for idea creativity, referring to a set of four sketches: one sketch for each toaster concept. The level of sketch quality for each toaster concept was varied among one of four quality levels. Higher quality idea sketches were found to correlate with higher creativity rank (p > 0.005), and lower quality sketches correlated with a lower creativity rank (p > 0.0005). A toaster idea portrayed with the highest quality level of sketch was 2.3 times more likely to be ranked as the most creative idea within the given set of idea sketches. The results underscore the importance of how an idea is presented, and support the need for sketching instruction in engineering and design curriculum.", "paper_title": "The influence of sketch quality on perception of product-idea creativity", "paper_id": "WOS:000307946900003"}