{"auto_keywords": [{"score": 0.015565095312068409, "phrase": "single_cell"}, {"score": 0.015060424860442949, "phrase": "electroporation_phenomenon"}, {"score": 0.014052494513513966, "phrase": "numerical_simulations"}, {"score": 0.01191267345337435, "phrase": "vitro_experiment"}, {"score": 0.00481495049065317, "phrase": "electroporation_effect"}, {"score": 0.004242291530697285, "phrase": "asymptotic_approximation"}, {"score": 0.004186105377259855, "phrase": "smoluchowski_theory"}, {"score": 0.004103212598803194, "phrase": "pore_generation"}, {"score": 0.003955465362027017, "phrase": "spherical_cell_model"}, {"score": 0.0038900709793274484, "phrase": "suspension_medium"}, {"score": 0.0037750632698768704, "phrase": "numerical_calculations"}, {"score": 0.003712640297460159, "phrase": "finite_difference_method"}, {"score": 0.0034730657554172405, "phrase": "propidium_iodide"}, {"score": 0.0033367819052051995, "phrase": "portable_electric_pulse_generator"}, {"score": 0.0032925489316383955, "phrase": "rectangular_pulses"}, {"score": 0.00312138530097218, "phrase": "pulse_generator"}, {"score": 0.003029246206908903, "phrase": "dc"}, {"score": 0.002668211079063252, "phrase": "cell_membrane"}, {"score": 0.0025125868638809284, "phrase": "applied_electric_pulse"}, {"score": 0.0024875444192203485, "phrase": "radii_sizes"}, {"score": 0.0022806798371116698, "phrase": "fluorescence_microscopy_exhibit"}, {"score": 0.002220551141101661, "phrase": "strong_evidence"}, {"score": 0.0021404485085209143, "phrase": "thorough_study"}], "paper_keywords": ["Electroporation", " Electric fields", " Finite difference methods"], "paper_abstract": "Purpose - This paper aims to investigate the electroporation phenomenon in a single cell exposed to ultra short (mu s) and high voltage (kV) electric pulses. Design/methodology/approach - The problem is addressed by two complementary approaches. First, numerical simulations based on an asymptotic approximation derived from the Smoluchowski theory are used to calculate the pore generation, growth and size evolution at the membrane of a spherical cell model, immersed in a suspension medium and consisting of cytoplasm and membrane. The numerical calculations are solved using the finite difference method. Second, an in vitro experiment with LLC-MK2 cells is carried out in which electroporation was monitored with molecules of propidium iodide. This part also comprehended the design and manufacturing of a portable electric pulse generator capable of providing rectangular pulses with amplitude of 1,000 V and duration in the range of 1-mu s to 100-mu s. The pulse generator is composed of three modules: a high voltage DC source, a control module, and an energy storage and high voltage switching. Findings - The numerical simulations considered a 5-mu m radius cell submitted to a 500 kV/m rectangular electric pulse for 1-mu s. The results indicate the formation of around 3,500 pores at the cell membrane, most of them, around 950, located at the poles of the cell aligned to the applied electric pulse, with radii sizes varying from 0.5-nm to 13-nm. The in vitro experiment considered exposition of LLC-MK2 cells to pulses of 200 V, 500 V, and 700 V, and 1-mu s. Images from fluorescence microscopy exhibit the LLC-MK2 cells with intense red, a strong evidence of the electroporation. Originality/value - The work presents a thorough study of the electroporation phenomenon combining two complementary approaches, a rigorous numerical simulation and a detailed in vitro experiment", "paper_title": "Investigation of the electroporation effect in a single cell", "paper_id": "WOS:000324445800019"}