{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "power_system"}, {"score": 0.004770211811866158, "phrase": "undergraduate_students"}, {"score": 0.004703878334423852, "phrase": "matlab-simulink._accurate_knowledge_characteristics"}, {"score": 0.0038301525703886585, "phrase": "dominant_frequency"}, {"score": 0.0037768417338850274, "phrase": "periodic_oscillations"}, {"score": 0.0037069087922811488, "phrase": "network_frequency"}, {"score": 0.0030891871245908665, "phrase": "equipment_damage"}, {"score": 0.0030178044717552605, "phrase": "protective_devices"}, {"score": 0.002893434697072309, "phrase": "high_voltage_laboratory"}, {"score": 0.0028664985822266344, "phrase": "specially_designed_exercises"}, {"score": 0.002787252424952955, "phrase": "matlab"}, {"score": 0.0026974065918918275, "phrase": "matlab_based_technology"}, {"score": 0.002333258365963461, "phrase": "wiley_periodicals"}], "paper_keywords": ["MATLAB-SIMULINK", " power system", " ferroresonance", " harmonic", " FFT"], "paper_abstract": "Accurate knowledge characteristics of a power system are very essential to have an idea of its operation conditions. The ferroresonant circuit exhibits oscillations characterized by frequency that is in accordance to the voltage applied on, and the currents circulating through the components of the circuit. The dominant frequency of these periodic oscillations could be the network frequency (fundamental ferroresonance) or a fraction of it (sub-harmonic ferroresonance). This phenomenon (both fundamental and sub-harmonic ferroresonance) is characterized by overvoltages or overcurrents, which may provoke the equipment damage and malfunctioning of the protective devices. The article presents an approach to teaching high voltage laboratory using specially designed exercises that can be done using MATLAB 6.5. This article present a MATLAB based technology to simulate ferroresonance in power system. Evaluation of the simulation with more than 30 students is very positive in terms of their developing confidence in and understanding of this simulation. (c) 2009 Wiley Periodicals, Inc. Comput Appl Eng Educ 19: 347-357, 2011; View this article online at wileyonlinelibrary.com; DOI 10.1002/cae.20316", "paper_title": "Teaching Ferroresonance in Power System to Undergraduate Students by Using MATLAB-SIMULINK", "paper_id": "WOS:000290678900015"}