{"auto_keywords": [{"score": 0.034808694084095974, "phrase": "u-commerce_systems"}, {"score": 0.00481495049065317, "phrase": "ubiquitous_networks"}, {"score": 0.004574449773348889, "phrase": "autonomous_fair_signature_exchange"}, {"score": 0.004345909305473054, "phrase": "exchange_task"}, {"score": 0.004235938758522453, "phrase": "authorised_devices"}, {"score": 0.003362944428837724, "phrase": "important_autonomy_feature"}, {"score": 0.0032359856233193504, "phrase": "proposed_work"}, {"score": 0.0031743093007496736, "phrase": "novel_approach"}, {"score": 0.003133844153806967, "phrase": "symmetric-key_based_verifiable_proxy_encryption"}, {"score": 0.002864628676257225, "phrase": "resource-limited_devices"}, {"score": 0.0026184796288543878, "phrase": "new_exchange_protocol"}, {"score": 0.0022882500116799777, "phrase": "related_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Ubiquitous computing", " Fair exchange", " Signature", " Communication protocol"], "paper_abstract": "This paper addresses the issue of autonomous fair signature exchange in emerging ubiquitous (u-) commerce systems, which require that the exchange task be delegated to authorised devices for its autonomous and secure execution. Relevant existing work is either inefficient or ineffective in dealing with such delegated exchange. To rectify this situation, this paper aims to propose an effective, efficient and secure solution to the delegated exchange to support the important autonomy feature offered by u-commerce systems. The proposed work includes a novel approach to symmetric-key based verifiable proxy encryption to make the exchange delegation flexible, efficient and simple to implement on resource-limited devices commonly used in u-commerce systems. This approach is then applied to design a new exchange protocol. An analysis of the protocol is also provided to confirm its security and fairness. Moreover, a comparison with related work is presented to demonstrate its much better efficiency and simplicity. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Fair signature exchange via delegation on ubiquitous networks", "paper_id": "WOS:000349741800001"}