{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "recommender_systems"}, {"score": 0.00459393336391459, "phrase": "new_products"}, {"score": 0.004021065055449586, "phrase": "particular_item"}, {"score": 0.003547084456662448, "phrase": "new_technique"}, {"score": 0.0031534367609709233, "phrase": "regression_model"}, {"score": 0.002892729377519916, "phrase": "target_item"}, {"score": 0.002748895580860912, "phrase": "movielens_data"}, {"score": 0.0023588019302482367, "phrase": "automatic_procedure"}, {"score": 0.0022948742034852917, "phrase": "different_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Recommender system", " Recommendation explanation", " Learning"], "paper_abstract": "Although recommender systems are extremely useful when it comes to recommending new products to users, it is important that these applications explain their recommendations so that users can consider and trust them. There is also another reason: by analyzing why the system recommends a particular item or proposes a certain rating, the user might also consider the quality of the recommendation and, if appropriate, change its predicted value. On this basis, this paper presents a new technique to improve recommendations based on a series of explanations that should be given when various already-known items are recommended. To summarize, the aim of our proposal is to learn a regression model from the information presented in these explanations and, where appropriate, use this model to change the recommendation for a target item. In order to test this approach, we experimented with the MovieLens data set. A number of lessons can be learned: firstly, it is possible to learn from a set of explanations, although this is highly user-dependent; and secondly, we can use an automatic procedure to analyze the role of the different features presented in an explanation. We consider these results to be interesting and to validate our novel approach. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Learning from explanations in recommender systems", "paper_id": "WOS:000342541400009"}