{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "authorship_disambiguation"}, {"score": 0.004770461993586338, "phrase": "urgent_issue"}, {"score": 0.004682708592184678, "phrase": "digital_library_services"}, {"score": 0.004625100791402994, "phrase": "supervised_solutions"}, {"score": 0.004401639026078196, "phrase": "particular_challenges"}, {"score": 0.004347473906950474, "phrase": "prohibitive_cost"}, {"score": 0.004307286039184164, "phrase": "vast_amounts"}, {"score": 0.0041759790955637225, "phrase": "huge_hypothesis_space"}, {"score": 0.003723879111071547, "phrase": "full_potential"}, {"score": 0.0035991257427992764, "phrase": "associative_author_name_disambiguation_approach"}, {"score": 0.0035110198699787013, "phrase": "training_examples"}, {"score": 0.003467776242953087, "phrase": "citation_features"}, {"score": 0.003320561182494713, "phrase": "specific_authors"}, {"score": 0.003044558129699335, "phrase": "association_rules"}, {"score": 0.0030257422786589723, "phrase": "name_disambiguation"}, {"score": 0.0028615323526689582, "phrase": "demand-driven_basis"}, {"score": 0.0028001000510468324, "phrase": "hypothesis_space"}, {"score": 0.0025592969422491476, "phrase": "self-training_capabilities"}, {"score": 0.0024658019116387845, "phrase": "effective_disambiguation_functions"}, {"score": 0.0022818212023413983, "phrase": "sland"}, {"score": 0.0022467024793003812, "phrase": "state-of-the-art_supervised_disambiguators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Machine learning", " Digital libraries", " Author name disambiguation", " Associative methods", " Lazy strategies"], "paper_abstract": "Authorship disambiguation is an urgent issue that affects the quality of digital library services and for which supervised solutions have been proposed, delivering state-of-the-art effectiveness. However, particular challenges such as the prohibitive cost of labeling vast amounts of examples (there are many ambiguous authors), the huge hypothesis space (there are several features and authors from which many different disambiguation functions may be derived), and the skewed author popularity distribution (few authors are very prolific, while most appear in only few citations), may prevent the full potential of such techniques. In this article, we introduce an associative author name disambiguation approach that identifies authorship by extracting, from training examples, rules associating citation features (e.g., coauthor names, work title, publication venue) to specific authors. As our main contribution we propose three associative author name disambiguators: (1) EAND (Eager Associative Name Disambiguation), our basic method that explores association rules for name disambiguation; (2) LAND (Lazy Associative Name Disambiguation), that extracts rules on a demand-driven basis at disambiguation time, reducing the hypothesis space by focusing on examples that are most suitable for the task; and (3) SLAND (Self-Training LAND), that extends LAND with self-training capabilities, thus drastically reducing the amount of examples required for building effective disambiguation functions, besides being able to detect novel/unseen authors in the test set. Experiments demonstrate that all our disambigutators are effective and that, in particular, SLAND is able to outperform state-of-the-art supervised disambiguators, providing gains that range from 12% to more than 400%, being extremely effective and practical. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Cost-effective on-demand associative author name disambiguation", "paper_id": "WOS:000305170900006"}