{"auto_keywords": [{"score": 0.04166660066361688, "phrase": "family_data"}, {"score": 0.04107868567004354, "phrase": "pedigree_information"}, {"score": 0.0329235942341221, "phrase": "external_information"}, {"score": 0.00481495049065317, "phrase": "snp_genotype"}, {"score": 0.004657739551687038, "phrase": "single_nucleotide_polymorphism"}, {"score": 0.004555781299332848, "phrase": "standard_clustering_methods"}, {"score": 0.004456044928556639, "phrase": "snp_genotypes"}, {"score": 0.004278807087784626, "phrase": "genotype_clusters"}, {"score": 0.004108589735101849, "phrase": "specific_features"}, {"score": 0.004063348730077936, "phrase": "genotype_calling_problem"}, {"score": 0.003830312347175889, "phrase": "prior_information"}, {"score": 0.0036105923401756126, "phrase": "appropriate_model-based_clustering_method"}, {"score": 0.003531474887552889, "phrase": "genotype_calls"}, {"score": 0.0033288399506044763, "phrase": "trisomic_individuals"}, {"score": 0.0032199943889464873, "phrase": "trisomic_genotypes"}, {"score": 0.0025892330566358503, "phrase": "k-means_method"}, {"score": 0.002422552850701705, "phrase": "likelihood-based_method"}, {"score": 0.0023887694534827984, "phrase": "gaussian"}, {"score": 0.0023694065215394593, "phrase": "beta-mixture_model"}, {"score": 0.002233301265743633, "phrase": "simulation_studies"}, {"score": 0.0021363670305843403, "phrase": "real_dataset"}, {"score": 0.0021049977753042253, "phrase": "illumina_platform"}], "paper_keywords": [""], "paper_abstract": "Motivation: Most genotyping technologies for single nucleotide polymorphism (SNP) markers use standard clustering methods to 'call' the SNP genotypes. These methods are not always optimal in distinguishing the genotype clusters of a SNP because they do not take advantage of specific features of the genotype calling problem. In particular, when family data are available, pedigree information is ignored. Furthermore, prior information about the distribution of the measurements for each cluster can be used to choose an appropriate model-based clustering method and can significantly improve the genotype calls. One special genotyping problem that has never been discussed in the literature is that of genotyping of trisomic individuals, such as individuals with Down syndrome. Calling trisomic genotypes is a more complicated problem, and the addition of external information becomes very important. Results: In this article, we discuss the impact of incorporating external information into clustering algorithms to call the genotypes for both disomic and trisomic data. We also propose two new methods to call genotypes using family data. One is a modi. cation of the K-means method and uses the pedigree information by updating all members of a family together. The other is a likelihood-based method that combines the Gaussian or beta-mixture model with pedigree information. We compare the performance of these two methods and some other existing methods using simulation studies. We also compare the performance of these methods on a real dataset generated by the Illumina platform (www.illumina.com).", "paper_title": "Smarter clustering methods for SNP genotype calling", "paper_id": "WOS:000261168600001"}