{"auto_keywords": [{"score": 0.043891862951523704, "phrase": "proposed_method"}, {"score": 0.01273208208757219, "phrase": "reflectance_component"}, {"score": 0.00481495049065317, "phrase": "singular_value_decomposition_algorithm"}, {"score": 0.003965468669507077, "phrase": "svd_algorithm"}, {"score": 0.003795335309109018, "phrase": "homomorphic_transform"}, {"score": 0.0035204268675160257, "phrase": "low_energy"}, {"score": 0.0032246835734680377, "phrase": "block-by-block_implementation"}, {"score": 0.002953711377604328, "phrase": "block-by-block_basis"}, {"score": 0.0027741761880779535, "phrase": "comparison_study"}, {"score": 0.002671722386856879, "phrase": "traditional_svd_watermarking_method"}, {"score": 0.0023566987138026285, "phrase": "chaotic_encrypted_watermarks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Image watermarking", " Homomorphic transform", " SVD", " Wavelet transform"], "paper_abstract": "In this paper, a new homomorphic image watermarking method implementing the Singular Value Decomposition (SVD) algorithm is presented. The idea of the proposed method is based on embedding the watermark with the SVD algorithm in the reflectance component after applying the homomorphic transform. The reflectance component contains most of the image features but with low energy, and hence watermarks embedded in this component will be invisible. A block-by-block implementation of the proposed method is also introduced. The watermark embedding on a block-by-block basis makes the watermark more robust to attacks. A comparison study between the proposed method and the traditional SVD watermarking method is presented in the presence of attacks. The proposed method is more robust to various attacks. The embedding of chaotic encrypted watermarks is also investigated in this paper to increase the level of security. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Homomorphic image watermarking with a singular value decomposition algorithm", "paper_id": "WOS:000342546900005"}