{"auto_keywords": [{"score": 0.03846975906528394, "phrase": "convergence_reliability"}, {"score": 0.026575839655862715, "phrase": "candidate_solutions"}, {"score": 0.00481495049065317, "phrase": "mutation_donor"}, {"score": 0.004790756351382389, "phrase": "differential_evolution"}, {"score": 0.004766683200410046, "phrase": "purpose_-_the_purpose"}, {"score": 0.004671588539217021, "phrase": "existing_differential_evolution"}, {"score": 0.004364370022234019, "phrase": "convex_combination"}, {"score": 0.004087562358167396, "phrase": "original_de_version"}, {"score": 0.004046588370206344, "phrase": "de"}, {"score": 0.003985816112027955, "phrase": "nine_well-known_test_functions"}, {"score": 0.003906238496137473, "phrase": "practical_application_case"}, {"score": 0.0038379074449947067, "phrase": "aerodynamic_data"}, {"score": 0.003808988441163669, "phrase": "obtained_numerical_simulation_results"}, {"score": 0.0037423521744765075, "phrase": "mutation_operator"}, {"score": 0.003704797078215222, "phrase": "de's_convergence_performance"}, {"score": 0.0033832583769880576, "phrase": "well-known_\"no_free_lunch\"_theorem"}, {"score": 0.003274113838379828, "phrase": "particular_class"}, {"score": 0.0032249300977069345, "phrase": "current_observations"}, {"score": 0.0031845067058084583, "phrase": "practical_implications"}, {"score": 0.003012560489169148, "phrase": "current_computer_capability"}, {"score": 0.0029449158645099447, "phrase": "considerably_better_convergence_performance"}, {"score": 0.002764856305713066, "phrase": "higher_convergence_rate"}, {"score": 0.002723301730223192, "phrase": "optimization_method"}, {"score": 0.0026891491143652083, "phrase": "global_optimum"}, {"score": 0.0026688629249775925, "phrase": "non-linear_objective_function"}, {"score": 0.002524688179363081, "phrase": "single_solution"}, {"score": 0.0024679712175516757, "phrase": "optimization_process"}, {"score": 0.002388283252319309, "phrase": "overall_optimization_cost"}, {"score": 0.0022879364955824153, "phrase": "acceptable_time"}, {"score": 0.002186268610027078, "phrase": "sub-optimal_solution"}, {"score": 0.0021263705039915198, "phrase": "new_strategies"}, {"score": 0.0021049977753042253, "phrase": "current_de_algorithm"}], "paper_keywords": ["Programming", " Algorithmic languages"], "paper_abstract": "Purpose - The purpose of this paper is to improve the existing differential evolution (DE) mutation operator so as to accelerate its convergence. Design/methodology/approach - A new general donor form for mutation operation in DE is presented, which defines a donor as a convex combination of the triplet of individuals selected for a mutation. Three new donor schemes from that form are deduced. Findings The three donor schemes were empirically compared with the original DE version and three existing variants of DE by using a suite of nine well-known test functions, and were also demonstrated by a practical application case training a neural network to approximate aerodynamic data. The obtained numerical simulation results suggested that these modifications to the mutation operator could improve the DE's convergence performance in both the convergence rate and the convergence reliability. Research limitations/implications - Further research is still needed for adequately explaining why it was possible to simultaneously improve both the convergence rate and the convergence reliability of DE to that extent despite the well-known \"No Free Lunch\" theorem. Also further research is considered necessary for outlining more distinctively the particular class of problems, where the current observations can be generalized. Practical implications - More complicated engineering problems could be solved sub-optimally, whereas their real optimal solution may never be reached subject to the current computer capability. Originality/value - Though DE has demonstrated a considerably better convergence performance than the other evolutionary algorithms (EAs), its convergence rate is still far from what is hoped for by scientists. On the one hand, a higher convergence rate is always expected for any optimization method used in seeking the global optimum of a non-linear objective function. On the other hand, since all EAs, including DE, work with a population of solutions rather than a single solution, many evaluations of candidate solutions are required in the optimization process. If evaluation of candidate solutions is too time-consuming, the overall optimization cost may become too expensive. One often has to limit the algorithm to operate within an acceptable time, which maybe is not enough to find the global optimum (optima), but enough to obtain a sub-optimal solution. Therefore, it is continuously necessary to investigate the new strategies to improve the current DE algorithm.", "paper_title": "Some improvement to the mutation donor of differential evolution", "paper_id": "WOS:000277296900011"}