{"auto_keywords": [{"score": 0.04320512154983126, "phrase": "bmu"}, {"score": 0.00481495049065317, "phrase": "selectively_refractory_neighborhood"}, {"score": 0.004496174406337201, "phrase": "final_states"}, {"score": 0.00443878620915958, "phrase": "self-organizing_map"}, {"score": 0.004270960586542813, "phrase": "high-dimensional_input_data"}, {"score": 0.0041984140090404985, "phrase": "classic_som_model"}, {"score": 0.004162602203448056, "phrase": "best_matching_units"}, {"score": 0.00385368199735867, "phrase": "som_algorithm"}, {"score": 0.0036605323485683983, "phrase": "affected_units"}, {"score": 0.0030183163057929687, "phrase": "previous_epochs"}, {"score": 0.0025099367332615794, "phrase": "proposed_modification"}, {"score": 0.0021049977753042253, "phrase": "original_som_model"}], "paper_keywords": ["Self-organizing maps", " Asymmetric neighborhood", " Map formation"], "paper_abstract": "Decreasing neighborhood with distance has been identified as one of a few conditions to achieve final states in the self-organizing map (SOM) that resemble the distribution of high-dimensional input data. In the classic SOM model, best matching units (BMU) decrease their influence area as a function of distance. We introduce a modification to the SOM algorithm in which neighborhood is contemplated from the point of view of affected units, not from the view of BMUs. In our proposal, neighborhood for BMUs is not reduced, instead the rest of the units exclude some BMUs from affecting them. Each neuron identifies, from the set of BMUs that influenced it in previous epochs, those to whom it becomes refractory to for the rest of the process. Despite that the condition of decreasing neighborhood over distance is not maintained, self-organization still persists, as shown by several experiments. The maps achieved by the proposed modification have, in many cases, a lower error measure than the maps formed by SOM. Also, the model is able to remove discontinuities (kinks) from the map in a very small number of epochs, which contrasts with the original SOM model.", "paper_title": "Self-Organizing Map Formation with a Selectively Refractory Neighborhood", "paper_id": "WOS:000329633000001"}