{"auto_keywords": [{"score": 0.04967086723428986, "phrase": "portfolio_selection_problem"}, {"score": 0.0442846155712289, "phrase": "qpso"}, {"score": 0.03587486340548494, "phrase": "qpso_model"}, {"score": 0.015719713042815744, "phrase": "quantum-behaved_particle_swarm_optimization"}, {"score": 0.010958761235242727, "phrase": "best_portfolio"}, {"score": 0.008167598139717732, "phrase": "better_results"}, {"score": 0.004672808182229058, "phrase": "popular_methods"}, {"score": 0.004613175917207636, "phrase": "combinational_problems"}, {"score": 0.004515467468684217, "phrase": "swarm-based_methods"}, {"score": 0.0040223714916651845, "phrase": "well-known_population-based_swarm_intelligence_algorithm"}, {"score": 0.0038702288460744274, "phrase": "classical_pso_philosophy"}, {"score": 0.003837205620832367, "phrase": "quantum_mechanics"}, {"score": 0.0036605323485683983, "phrase": "portfolio_selection"}, {"score": 0.003137074867443131, "phrase": "systematic_and_non-systematic_risks"}, {"score": 0.003044313656896057, "phrase": "sharp_ratio"}, {"score": 0.0029797347088361056, "phrase": "obtained_results"}, {"score": 0.002746549549029177, "phrase": "markowitz's_classic_model"}, {"score": 0.0026882700311968025, "phrase": "basically_some_advantages"}, {"score": 0.0021049977753042253, "phrase": "best_portfolio_selection"}], "paper_keywords": ["Swarm algorithm", " portfolio selection", " GA", " risk", " return"], "paper_abstract": "One of the popular methods for optimizing combinational problems such as portfolio selection problem is swarm-based methods. In this paper, we have proposed an approach based on Quantum-Behaved Particle Swarm Optimization (QPSO) for the portfolio selection problem. The Particle Swarm Optimization (PSO) is a well-known population-based swarm intelligence algorithm. QPSO is also proposed by combining the classical PSO philosophy and quantum mechanics to improve performance of PSO. Generally, investors, in portfolio selection, simultaneously consider such contradictory objectives as the rate of return, risk and liquidity. We employed QPSO model to select the best portfolio in 50 supreme tehran stock exchange companies in order to optimize the objectives of the rate of return, systematic and non-systematic risks, return skewness, liquidity and sharp ratio. Finally, the obtained results were compared with Markowitz's classic and Genetic Algorithms (GA) models indicated that although return of the portfolio of QPSO model was less that that in Markowitz's classic model, the QPSO had basically some advantages in decreasing risk in the sense that it completely covers the rate of return and leads to better results and proposes more versatility portfolios in compared with the other models. Therefore, we could conclude that as far as selection of the best portfolio is concerned, QPSO model can lead to better results and may help the investors to make the best portfolio selection.", "paper_title": "Using Quantum-Behaved Particle Swarm Optimization for Portfolio Selection Problem", "paper_id": "WOS:000316841900001"}