{"auto_keywords": [{"score": 0.04192434000814603, "phrase": "hydroxyl_group"}, {"score": 0.00481495049065317, "phrase": "functional_theory_calculations"}, {"score": 0.003501575317842644, "phrase": "tm"}, {"score": 0.003282383509542342, "phrase": "intramolecular_interactions"}, {"score": 0.0031694856662296284, "phrase": "aim"}, {"score": 0.003114584448820957, "phrase": "natural_bond"}, {"score": 0.003003452468800793, "phrase": "bond_orders"}, {"score": 0.0029553380263320195, "phrase": "lone_pair_electrons"}, {"score": 0.0027816546451972725, "phrase": "electronic_energy"}, {"score": 0.002759279370360986, "phrase": "dipole_moment"}, {"score": 0.0026500668745484957, "phrase": "electronic_properties"}, {"score": 0.0024642355970277497, "phrase": "electrophilicity_index"}, {"score": 0.0021479597698614373, "phrase": "anomalous_stability"}, {"score": 0.0021049977753042253, "phrase": "self-assembly_phenomena"}], "paper_keywords": ["Atoms in molecules theory", " Density functional theory", " Glycolipids", " Hydrogen bonding", " Natural bond orbital analysis"], "paper_abstract": "Density functional theory calculations on two glycosides, namely, n-octyl-beta-D-glucopyranoside (C8O-beta-Glc) and n-octyl-beta-D-galactopyranoside (C8O-beta-Gal) were performed for geometry optimization at the B3LYP/6-31G level. Both molecules are stereoisomers (epimers) differing only in the orientation of the hydroxyl group at the C4 position. Thus it is interesting to investigate electronically the effect of the direction (axial/equatorial) of the hydroxyl group at the C4 position. The structure parameters of X-Ha (TM) a (TM) a (TM) Y intramolecular hydrogen bonds were analyzed, while the nature of these bonds and the intramolecular interactions were considered using the atoms in molecules (AIM) approach. Natural bond orbital analysis (NBO) was used to determine bond orders, charge and lone pair electrons on each atom and effective non-bonding interactions. We have also reported electronic energy and dipole moment in gas and solution phases. Further, the electronic properties such as the highest occupied molecular orbital, lowest unoccupied molecular orbital, ionization energy, electron affinity, electronic chemical potential, chemical hardness, softness and electrophilicity index, are also presented here for both C8O-beta-Glc and C8O-beta-Gal. These results show that, while C8O-beta-Glc possess- only one hydrogen bond, C8O-beta-Gal has two intramolecular hydrogen bonds, which further confirms the anomalous stability of the latter in self-assembly phenomena.", "paper_title": "Hydrogen bonds in galactopyranoside and glucopyranoside: a density functional theory study", "paper_id": "WOS:000314051200011"}