{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "operating_system_kernel"}, {"score": 0.010427228559062638, "phrase": "modularity_concept"}, {"score": 0.010066448865811147, "phrase": "new_architecture"}, {"score": 0.009109994672220099, "phrase": "traditional_kernel"}, {"score": 0.00843985084732487, "phrase": "policy_module"}, {"score": 0.008341183628632962, "phrase": "monitoring_module"}, {"score": 0.003338690782620756, "phrase": "system_error"}, {"score": 0.003260690513595527, "phrase": "important_data"}, {"score": 0.002931569771634119, "phrase": "cpu_time"}, {"score": 0.002897109710213723, "phrase": "important_system_data_structures"}, {"score": 0.0023976048394496446, "phrase": "techniques'_implementation"}, {"score": 0.0023415390666563177, "phrase": "important_data_structures"}, {"score": 0.002259883463607508, "phrase": "potential_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Operating system", " Kernel", " Modularity", " System safety"], "paper_abstract": "This paper presents a new architecture of operating system kernel. The new architecture discussed is based on modularity concept and consideration of the shortcomings of traditional kernel, and the operating system kernel is divided into three independent modules-executing module, policy module and monitoring module. Policy module determines the policy of process scheduling separated from traditional kernel. Monitoring module is responsible for monitoring processes, handling system error and detecting of important data. These three modules work independently and communicate with each other by interrupts to ensure the safety of CPU time, important system data structures and user data. As a result, these three independent modules improve the expandability and simplify maintenance of the operating system kernel and enhance the robustness of the system. In this paper, techniques' implementation is given and important data structures a redefined. Finally, potential problems of this architecture are also discussed. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Research of an architecture of operating system kernel based on modularity concept", "paper_id": "WOS:000276820900023"}