{"auto_keywords": [{"score": 0.014431645207993267, "phrase": "uml"}, {"score": 0.010576414361125608, "phrase": "webml"}, {"score": 0.0048149569268520565, "phrase": "uml."}, {"score": 0.004586531354697466, "phrase": "web_engineering_community"}, {"score": 0.004464326432401002, "phrase": "standard_unified_modelling_language"}, {"score": 0.0041840994704406866, "phrase": "web_systems"}, {"score": 0.00385832528624328, "phrase": "development_processes"}, {"score": 0.0035771121569391916, "phrase": "increasing_need"}, {"score": 0.0030250067691601967, "phrase": "precise_and_natural_way"}, {"score": 0.0024495111090152857, "phrase": "webml_models"}, {"score": 0.002333044307949414, "phrase": "modelling_tools"}, {"score": 0.0021510820434023207, "phrase": "web_modelling"}, {"score": 0.0021049977753042253, "phrase": "key_requirements"}], "paper_keywords": [""], "paper_abstract": "In recent years, we have witnessed how the Web Engineering community has started using the standard unified modelling language (UML) notation, techniques and supporting tools for modelling Web systems, which has led to the adaptation to UML of several existing modelling languages, notations and development processes. This interest for being MOF and UML-compliant arises from the increasing need to interoperate with other notations and tools, and to exchange data and models, thus facilitating reuse. WebML, like any other domain-specific language, allows one to express in a precise and natural way the concepts and mechanisms of its domain of reference. However, it cannot fully interoperate with other notations, nor be integrated with other model-based tools. As a solution to these requirements, a UML 2.0 profile for WebML which allows WebML models to be used in conjunction with other notations and modelling tools has been described. The paper also evaluates UML 2.0 as a platform for Web modelling and identifies some key requirements for making this version of the standard more usable.", "paper_title": "WebML modelling in UML", "paper_id": "WOS:000248759300001"}