{"auto_keywords": [{"score": 0.046433377080865965, "phrase": "wgsa"}, {"score": 0.004714205004500723, "phrase": "np"}, {"score": 0.004661775069083667, "phrase": "combinatorial_optimization"}, {"score": 0.004562362497952548, "phrase": "shortest_common_superstring_problem"}, {"score": 0.004481132747216135, "phrase": "whole-genome_sequence_assembly"}, {"score": 0.004276610897002087, "phrase": "greedy_and_heuristic_methods"}, {"score": 0.004052148727852149, "phrase": "local_searches"}, {"score": 0.003798231095121328, "phrase": "complex_structures"}, {"score": 0.003690527690610707, "phrase": "best_heuristics"}, {"score": 0.0035473867669654174, "phrase": "input_data"}, {"score": 0.003509317669345521, "phrase": "available_long_range_information"}, {"score": 0.002931569771634119, "phrase": "constrained_search"}, {"score": 0.0028381384547894865, "phrase": "quick_identification"}, {"score": 0.002797572252783356, "phrase": "implausible_overlays"}, {"score": 0.00267931029131157, "phrase": "score_functions"}, {"score": 0.002612640527241776, "phrase": "different_structural_properties"}, {"score": 0.00245753647863636, "phrase": "detailed_description"}, {"score": 0.0024311346712789553, "phrase": "novel_assembly_framework"}, {"score": 0.0023877977072508283, "phrase": "scoring"}, {"score": 0.0022298571016688335, "phrase": "next-generation_sequencing_technology_data"}, {"score": 0.002190064650401852, "phrase": "experimental_evidence"}, {"score": 0.002166530105679438, "phrase": "assembly_quality"}, {"score": 0.0021049977753042253, "phrase": "minimum_overlap_parameter_k."}], "paper_keywords": [""], "paper_abstract": "Motivation: Mired by its connection to a well-known NP-complete combinatorial optimization problem-namely, the Shortest Common Superstring Problem (SCSP)-historically, the whole-genome sequence assembly (WGSA) problem has been assumed to be amenable only to greedy and heuristic methods. By placing efficiency as their first priority, these methods opted to rely only on local searches, and are thus inherently approximate, ambiguous or error prone, especially, for genomes with complex structures. Furthermore, since choice of the best heuristics depended critically on the properties of (e.g. errors in) the input data and the available long range information, these approaches hindered designing an error free WGSA pipeline. Results: We dispense with the idea of limiting the solutions to just the approximated ones, and instead favor an approach that could potentially lead to an exhaustive (exponential-time) search of all possible layouts. Its computational complexity thus must be tamed through a constrained search (Branch-and-Bound) and quick identification and pruning of implausible overlays. For his purpose, such a method necessarily relies on a set of score functions (oracles) that can combine different structural properties (e.g. transitivity, coverage, physical maps, etc.). We give a detailed description of this novel assembly framework, referred to as Scoring-and-Unfolding Trimmed Tree Assembler (SUTTA), and present experimental results on several bacterial genomes using next-generation sequencing technology data. We also report experimental evidence that the assembly quality strongly depends on the choice of the minimum overlap parameter k.", "paper_title": "Scoring-and-unfolding trimmed tree assembler: concepts, constructs and comparisons", "paper_id": "WOS:000286215200002"}