{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "three-dimensional_ultrasound"}, {"score": 0.004388796812234033, "phrase": "temporal_sequence"}, {"score": 0.00406250784433007, "phrase": "external_tracking_systems"}, {"score": 0.003789561910103601, "phrase": "image-based_methods"}, {"score": 0.0036600192572132676, "phrase": "immediate_feedback"}, {"score": 0.003548579306515579, "phrase": "real-time_image-based_algorithm"}, {"score": 0.0033877275374263314, "phrase": "small_probe_displacements"}, {"score": 0.0032592499906265882, "phrase": "feature_detection"}, {"score": 0.0029589086332593674, "phrase": "global_set"}, {"score": 0.0027813397260607487, "phrase": "registration_error"}, {"score": 0.0025151755329660837, "phrase": "accelerated_framework"}, {"score": 0.002486147565139633, "phrase": "graphics_processing_unit"}, {"score": 0.0024574537875026634, "phrase": "algorithm's_parameter_selection"}, {"score": 0.002345944657572499, "phrase": "water_tank"}, {"score": 0.0023278569001363263, "phrase": "clinical_images"}, {"score": 0.00230098581403254, "phrase": "resulting_registration_accuracy"}, {"score": 0.002265638487492082, "phrase": "similar_feature-based_registration_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ultrasound", " Registration", " Real-time", " Image-based"], "paper_abstract": "Registration of three-dimensional ultrasound (3DUS) volumes is necessary in several applications, such as when stitching volumes to expand the field of view or when stabilizing a temporal sequence of volumes to cancel out motion of the probe or anatomy. Current systems that register 3DUS volumes either use external tracking systems (electromagnetic or optical), which add expense and impose limitations on acquisitions, or are image-based methods that operate offline and are incapable of providing immediate feedback to clinicians. This paper presents a real-time image-based algorithm for rigid registration of 3DUS volumes designed for acquisitions in which small probe displacements occur between frames. Described is a method for feature detection and descriptor formation that takes into account the characteristics of 3DUS imaging. Volumes are registered by determining a correspondence between these features. A global set of features is maintained and integrated into the registration, which limits the accumulation of registration error. The system operates in real-time (i.e. volumes are registered as fast or faster than they are acquired) by using an accelerated framework on a graphics processing unit. The algorithm's parameter selection and performance is analyzed and validated in studies which use both water tank and clinical images. The resulting registration accuracy is comparable to similar feature-based registration methods, but in contrast to these methods, can register 3DUS volumes in real-time. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Real-time image-based rigid registration of three-dimensional ultrasound", "paper_id": "WOS:000300754400005"}