{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_topsis"}, {"score": 0.0050660206828479735, "phrase": "fuzzy_vikor"}, {"score": 0.00470975295439431, "phrase": "candidate_assessment"}, {"score": 0.0046477357199085035, "phrase": "primarily_aim"}, {"score": 0.004506171772318298, "phrase": "best_alternative"}, {"score": 0.004407690586271672, "phrase": "possible_alternatives"}, {"score": 0.004330450801016359, "phrase": "correct_decision"}, {"score": 0.004292337783332826, "phrase": "multiple_criteria"}, {"score": 0.004198510172614725, "phrase": "really_difficult_process"}, {"score": 0.0037925389501636975, "phrase": "group_consensus"}, {"score": 0.003660700128133065, "phrase": "decision_making"}, {"score": 0.003628460890653392, "phrase": "madm"}, {"score": 0.00342568771304873, "phrase": "decision_makers"}, {"score": 0.002535344521369057, "phrase": "human_resources_management"}, {"score": 0.0024148064819862337, "phrase": "real_case_staff_selection_problem"}, {"score": 0.0022396701580315744, "phrase": "fad"}, {"score": 0.002219916677664081, "phrase": "identical_candidate_rankings"}, {"score": 0.0021426288417854987, "phrase": "different_ranking"}, {"score": 0.002104997853677991, "phrase": "fad."}], "paper_keywords": ["Decision making", " fuzzy TOPS IS", " fuzzy VIKOR", " fuzzy axiomatic design", " evaluation of candidates"], "paper_abstract": "The primarily aim of the decision-making is determine the best alternative among a set of possible alternatives. Making a correct decision under multiple criteria is regarded as a really difficult process. This procedure gets more and more difficult when group decision making problem is addressed, since it is needed to satisfy group consensus as well. Therefore, many multi attribute decision making (MADM) methods have been developed and they have used widely preferred by decision makers to rank alternatives with respect to several attributes. In this paper, three of the decision making methods. Fuzzy TOPSIS (Technique for Order Preference by Similarity loan Ideal Solution), Fuzzy VIKOR ('VlseKriterijumska Optimizacija I Kompromisno Resenje) Method, Fuzzy Axiomatic Design (FAD) are handled so as to emphasize the differences and similarity between Fuzzy TOPSIS and Fuzzy VIKOR and between Fuzzy TOPSIS and Fuzzy Axiomatic Design. Moreover the assessment of candidates among several applicants is one of the most strategic processes in human resources management. In this context, methods are applied to a real case staff selection problem for nurse position in a hospital. The findings of this paper illustrate that Fuzzy TOPSIS and FAD have identical candidate rankings. However, Fuzzy VIKOR has suggested a different ranking than Fuzzy TOPSIS and FAD.", "paper_title": "Fuzzy VIKOR and Fuzzy Axiomatic Design Versus to Fuzzy TOPSIS: An Application of Candidate Assessment", "paper_id": "WOS:000266509100006"}