{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "preference-inconsistent_recommendations"}, {"score": 0.01520397201724326, "phrase": "confirmation_bias"}, {"score": 0.008568642604425997, "phrase": "effective_approach"}, {"score": 0.007746872402509793, "phrase": "different_opinions"}, {"score": 0.004545018615899665, "phrase": "divergent_thinking"}, {"score": 0.004450568197899267, "phrase": "perfect_backdrop"}, {"score": 0.004400804926266097, "phrase": "opinion_formation"}, {"score": 0.003888659470009222, "phrase": "preference-inconsistent_information"}, {"score": 0.0035339597999254064, "phrase": "recommender_systems"}, {"score": 0.0031223774204093713, "phrase": "preference-consistent_recommendations"}, {"score": 0.00305285084207725, "phrase": "control_condition"}, {"score": 0.002727700630869639, "phrase": "controversial_topic"}, {"score": 0.0022270182923887012, "phrase": "future_research"}, {"score": 0.0022020622730208514, "phrase": "practical_implications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Adult learning", " Human-computer interface", " Navigation"], "paper_abstract": "The Web is a perfect backdrop for opinion formation as a multitude of different opinions is publicly available. However, the different opinions often remain unexploited: Learners prefer preference-consistent over preference-inconsistent information, a phenomenon called confirmation bias. Two experiments were designed to test whether technologies such as recommender systems can be used to overcome this bias. The role of preference-inconsistent recommendations was explored by comparing their influence to a condition with preference-consistent recommendations and to a control condition without recommendations. In Study 1, preference-inconsistent recommendations led to a reduction of confirmation bias and to a more moderate view of the controversial topic of neuro-enhancement. In Study 2, we found that preference-inconsistent recommendations stimulated balanced recall and divergent thinking. Together these studies showed that preference-inconsistent recommendations are an effective approach for reducing confirmation bias and stimulating divergent thinking. In conclusion, future research and practical implications are discussed. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Preference-inconsistent recommendations: An effective approach for reducing confirmation bias and stimulating divergent thinking?", "paper_id": "WOS:000298523800010"}