{"auto_keywords": [{"score": 0.04296486508114674, "phrase": "associated_concepts"}, {"score": 0.00481495049065317, "phrase": "gene_annotation"}, {"score": 0.00464310078297457, "phrase": "biomedical_concepts"}, {"score": 0.004576082753070803, "phrase": "biological_processes"}, {"score": 0.0045100276713428205, "phrase": "annotation_purposes"}, {"score": 0.004455707458103357, "phrase": "new_hypotheses"}, {"score": 0.004338484872090817, "phrase": "vector_space_model"}, {"score": 0.0037693455100358876, "phrase": "important_issue"}, {"score": 0.0035475738398639627, "phrase": "comparative_studies"}, {"score": 0.003521850480918619, "phrase": "different_approaches"}, {"score": 0.003437440835673069, "phrase": "large_scale_classification_experiment"}, {"score": 0.0030520948971800212, "phrase": "weighting_schemes"}, {"score": 0.0029789104204803137, "phrase": "gene_ontology_codes"}, {"score": 0.0029501289059597206, "phrase": "gold_standard"}, {"score": 0.0028793823531397585, "phrase": "gene_ontology_annotation_project"}, {"score": 0.0028103275796882376, "phrase": "receiver_operating_characteristics"}, {"score": 0.0026192683039329987, "phrase": "median_auc_scores"}, {"score": 0.0025502357521389307, "phrase": "binary_approach"}, {"score": 0.0024890550307322054, "phrase": "gene_ontology"}, {"score": 0.0024769957140276704, "phrase": "excellent_performance"}, {"score": 0.0023941967976779583, "phrase": "whole_experiment"}, {"score": 0.002291785580827107, "phrase": "important_variable"}, {"score": 0.0022751471169846576, "phrase": "larger_amounts"}, {"score": 0.002220551141101661, "phrase": "concepts'_vectors"}, {"score": 0.0021567588189376815, "phrase": "uncertainty_coefficient"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["text-mining", " vector space model", " gene ontology"], "paper_abstract": "Background: Text-mining has been used to link biomedical concepts, such as genes or biological processes, to each other for annotation purposes or the generation of new hypotheses. To relate two concepts to each other several authors have used the vector space model, as vectors can be compared efficiently and transparently. Using this model, a concept is characterized by a list of associated concepts, together with weights that indicate the strength of the association. The associated concepts in the vectors and their weights are derived from a set of documents linked to the concept of interest. An important issue with this approach is the determination of the weights of the associated concepts. Various schemes have been proposed to determine these weights, but no comparative studies of the different approaches are available. Here we compare several weighting approaches in a large scale classification experiment. Methods: Three different techniques were evaluated: (1) weighting based on averaging, an empirical approach; (2) the log likelihood ratio, a test-based measure; (3) the uncertainty coefficient, an information-theory based measure. The weighting schemes were applied in a system that annotates genes with Gene Ontology codes. As the gold standard for our study we used the annotations provided by the Gene Ontology Annotation project. Classification performance was evaluated by means of the receiver operating characteristics (ROC) curve using the area under the curve (AUC) as the measure of performance. Results and discussion: All methods performed well with median AUC scores greater than 0.84, and scored considerably higher than a binary approach without any weighting. Especially for the more specific Gene Ontology codes excellent performance was observed. The differences between the methods were small when considering the whole experiment. However, the number of documents that were linked to a concept proved to be an important variable. When larger amounts of texts were available for the generation of the concepts' vectors, the performance of the methods diverged considerably, with the uncertainty coefficient then outperforming the two other methods. (c) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Literature-based concept profiles for gene annotation: The issue of weighting", "paper_id": "WOS:000255676800007"}