{"auto_keywords": [{"score": 0.042289534117489945, "phrase": "field_differences"}, {"score": 0.01557604867641885, "phrase": "citation_impact"}, {"score": 0.01272320301765646, "phrase": "field_classification_system"}, {"score": 0.00481495049065317, "phrase": "normalized_indicators"}, {"score": 0.00466102244911872, "phrase": "different_approaches"}, {"score": 0.004596561972944185, "phrase": "empirical_comparison"}, {"score": 0.004554082077300675, "phrase": "different_scientific_fields"}, {"score": 0.0045119929871912405, "phrase": "different_citation_practices"}, {"score": 0.0044702911400353535, "phrase": "citation-based_bibliometric_indicators"}, {"score": 0.004208427318712072, "phrase": "meaningful_between-field_comparisons"}, {"score": 0.0033515736929172644, "phrase": "source_normalization"}, {"score": 0.003244275497488318, "phrase": "alternative_approach"}, {"score": 0.002997735656669146, "phrase": "referencing_behavior"}, {"score": 0.0025952620596908773, "phrase": "traditional_normalization_approach"}, {"score": 0.002195033004022173, "phrase": "traditional_classification-system-based_normalization_approach"}], "paper_keywords": ["Bibliometric indicator", " Citation analysis", " Field normalization", " Source normalization"], "paper_abstract": "Different scientific fields have different citation practices. Citation-based bibliometric indicators need to normalize for such differences between fields in order to allow for meaningful between-field comparisons of citation impact. Traditionally, normalization for field differences has usually been done based on a field classification system. In this approach, each publication belongs to one or more fields and the citation impact of a publication is calculated relative to the other publications in the same field. Recently, the idea of source normalization was introduced, which offers an alternative approach to normalize for field differences. In this approach, normalization is done by looking at the referencing behavior of citing publications or citing journals. In this paper, we provide an overview of a number of source normalization approaches and we empirically compare these approaches with a traditional normalization approach based on a field classification system. We also pay attention to the issue of the selection of the journals to be included in a normalization for field differences. Our analysis indicates a number of problems of the traditional classification-system-based normalization approach, suggesting that source normalization approaches may yield more accurate results.", "paper_title": "Source normalized indicators of citation impact: an overview of different approaches and an empirical comparison", "paper_id": "WOS:000323437400004"}