{"auto_keywords": [{"score": 0.022439216118034826, "phrase": "large_percentage"}, {"score": 0.010612387000973441, "phrase": "frequent_itemset_mining"}, {"score": 0.009555485976097594, "phrase": "small_subset"}, {"score": 0.006880172684330697, "phrase": "existing_frequent_itemset_mining_software"}, {"score": 0.0047310525657970615, "phrase": "small_itemset"}, {"score": 0.004056334733843591, "phrase": "warehousing_performance"}, {"score": 0.0038989120088094185, "phrase": "highly_automated_order_completion_zone"}, {"score": 0.0036179751816682454, "phrase": "good_solution"}, {"score": 0.003477505397536663, "phrase": "novel_approach"}, {"score": 0.003198554193075258, "phrase": "simple_transformations"}, {"score": 0.002753891109273246, "phrase": "large_order_database"}, {"score": 0.002499590390751339, "phrase": "decision_maker"}, {"score": 0.0023708980662168547, "phrase": "order_database"}, {"score": 0.002339771435910601, "phrase": "real_warehouse"}, {"score": 0.0022192891418394535, "phrase": "experimental_results"}, {"score": 0.0021613897794439227, "phrase": "existing_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["frequent itemset mining", " warehousing", " 80-20 rule", " item-order completion distribution", " association"], "paper_abstract": "In a warehouse, if we can identify a small subset of items that can satisfy a large percentage of orders, we can improve the warehousing performance by assigning the small subset of items to a highly automated order completion zone. Current approach to identify such a small subset of items is heuristic based and does not guarantee a good solution. In this paper, we propose a novel approach to identify all the small subsets of items that can satisfy a large percentage of orders. We show that, with simple transformations, we can use the existing frequent itemset mining software or algorithm to solve the problem. Our approach has all the advantages provided by frequent itemset mining, including the capability of considering associations among items and the capability of handling a large order database. Our approach can be implemented with little effort by using existing frequent itemset mining software or algorithm. Furthermore, our approach guarantees all the desired solutions and allows the decision maker the fullest flexibility to plan the warehouse. Experiments on an order database of a real warehouse were performed to demonstrate the effectiveness of this approach. The experimental results show that our approach outperforms the existing approach. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Applying frequent itemset mining to identify a small itemset that satisfies a large percentage of orders in a warehouse", "paper_id": "WOS:000237180200008"}