{"auto_keywords": [{"score": 0.026323895476991866, "phrase": "mi_method"}, {"score": 0.00481495049065317, "phrase": "multiple_imputation_methods"}, {"score": 0.0047707093928203, "phrase": "nonparametric_multivariate_outlier_identifiers"}, {"score": 0.0047268728636719725, "phrase": "depth-based_performance_criteria"}, {"score": 0.004451546786101008, "phrase": "multivariate_outlier"}, {"score": 0.0038935506745975835, "phrase": "nonparametric_depth-based_multivariate_outlier_identifiers"}, {"score": 0.0037696519417841287, "phrase": "numerical_study"}, {"score": 0.003700788874098959, "phrase": "mi"}, {"score": 0.0030336118627011786, "phrase": "depth_functions"}, {"score": 0.002950608985750058, "phrase": "mahalanobis_distance"}, {"score": 0.0029234476524900794, "phrase": "robust_mahalanobis_distance"}, {"score": 0.00288317238346065, "phrase": "generalized_principle_component_analysis"}, {"score": 0.002640636493247601, "phrase": "outlier_detection_methods"}, {"score": 0.002407290605654707, "phrase": "depth-based_outlier_detection_criterion"}, {"score": 0.0022355167967736326, "phrase": "missing_components"}], "paper_keywords": ["multiple imputation", " multivariate", " nonparametric", " outlier detection", " depth functions", " missing values"], "paper_abstract": "It is well known that if a multivariate outlier has one or more missing component values, then multiple imputation (MI) methods tend to impute nonextreme values and make the outlier become less extreme and less likely to be detected. In this paper, nonparametric depth-based multivariate outlier identifiers are used as criteria in a numerical study comparing several established methods of MI as well as a new proposed one, nine in all, in a setting of several actual clinical laboratory data sets of different dimensions. Two criteria, an 'outlier recovery probability' and a 'relative accuracy measure', are developed, based on depth functions. Three outlier identifiers, based on Mahalanobis distance, robust Mahalanobis distance, and generalized principle component analysis are also included in the study. Consequently, not only the comparison of imputation methods but also the comparison of outlier detection methods is accomplished in this study. Our findings show that the performance of an MI method depends on the choice of depth-based outlier detection criterion, as well as the size and dimension of the data and the fraction of missing components. By taking these features into account, an MI method for a given data set can be selected more optimally.", "paper_title": "A numerical study of multiple imputation methods using nonparametric multivariate outlier identifiers and depth-based performance criteria with clinical laboratory data", "paper_id": "WOS:000290769600002"}