{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intelligent_speech_interfaces"}, {"score": 0.004642377903273107, "phrase": "bayesian_networks-based_solution"}, {"score": 0.004461131750106576, "phrase": "carefully_designed_contextual_information_handling_strategies"}, {"score": 0.004272724011826495, "phrase": "spoken_dialogue_system"}, {"score": 0.004216362268148017, "phrase": "hi-fi_audio_system"}, {"score": 0.0041195049121633956, "phrase": "real-user_evaluation"}, {"score": 0.003893406207928709, "phrase": "different_implementation"}, {"score": 0.003778755692995768, "phrase": "actuation_order"}, {"score": 0.003691913669486176, "phrase": "proper_order"}, {"score": 0.003352825186671963, "phrase": "hi-fi_audio_box"}, {"score": 0.0032975819773787985, "phrase": "defined_metrics"}, {"score": 0.003106112985011102, "phrase": "proposed_solutions"}, {"score": 0.0029160193808720016, "phrase": "user_satisfaction"}, {"score": 0.002887083738036996, "phrase": "thorough_and_comprehensive_study"}, {"score": 0.0028584344002749395, "phrase": "main_differences"}, {"score": 0.0026304533650262545, "phrase": "scenario_factors"}, {"score": 0.0022200746395981876, "phrase": "approached_dialogue_management_solutions"}, {"score": 0.0021049977753042253, "phrase": "british_informatics_society_limited"}], "paper_keywords": ["Spoken dialogue systems", " Mixed initiative", " Bayesian Networks", " Contextual information", " Usability", " Electronic devices control"], "paper_abstract": "In this paper a Bayesian Networks-based solution for dialogue modelling is presented. This solution is combined with carefully designed contextual information handling strategies. With the purpose of validating these solutions, and introducing a spoken dialogue system for controlling a Hi-Fi audio system as the selected prototype, a real-user evaluation has been conducted. Two different versions of the prototype are compared. Each version corresponds to a different implementation of the algorithm for the management of the actuation order, the algorithm for deciding the proper order to carry out the actions required by the user. The evaluation is carried out in terms of a battery of both subjective and objective metrics collected from speakers interacting with the Hi-Fi audio box through predefined scenarios. Defined metrics have been specifically adapted to measure: first, the usefulness and the actual relevance of the proposed solutions, and, secondly, their joint performance through their intelligent combination mainly measured as the level achieved with regard to the user satisfaction. A thorough and comprehensive study of the main differences between both approaches is presented. Two-way analysis of variance (ANOVA) tests are also included to measure the effects of both: the system used and the type of scenario factors, simultaneously. Finally, the effect of bringing this flexibility, robustness and naturalness into our home dialogue system is also analyzed through the results obtained. These results show that the intelligence of our speech interface has been well perceived, highlighting its excellent ease of use and its good acceptance by users, therefore validating the approached dialogue management solutions and demonstrating that a more natural, flexible and robust dialogue is possible thanks to them. (C) 2012 British Informatics Society Limited. All rights reserved.", "paper_title": "Towards building intelligent speech interfaces through the use of more flexible, robust and natural dialogue management solutions", "paper_id": "WOS:000313135500005"}