{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "distribution_algorithms"}, {"score": 0.02144516075256888, "phrase": "candidate_individuals"}, {"score": 0.004576491793324233, "phrase": "traditional_estimation"}, {"score": 0.004335081499311714, "phrase": "probability_distribution"}, {"score": 0.0043058107942196945, "phrase": "promising_individuals"}, {"score": 0.003811350661783412, "phrase": "different_saliences"}, {"score": 0.0035016702571862165, "phrase": "novel_class"}, {"score": 0.0034311578789991363, "phrase": "subspace_estimation"}, {"score": 0.0033280337910399104, "phrase": "new_perspective"}, {"score": 0.0032170707904803125, "phrase": "model_building"}, {"score": 0.0031522712014385845, "phrase": "edas'_performance"}, {"score": 0.0031203609829058587, "phrase": "subedas"}, {"score": 0.002669525619637691, "phrase": "high_quality_individuals"}, {"score": 0.0025543250296793554, "phrase": "high_quality"}, {"score": 0.0025370474510475628, "phrase": "low_quality_individuals"}, {"score": 0.0022300545742463262, "phrase": "comparative_result"}, {"score": 0.002199978308846543, "phrase": "problem_variables"}, {"score": 0.002148315508445588, "phrase": "traditional_edas"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b._v."}], "paper_keywords": ["Estimation of distribution algorithms (EDAs)", " Subspace estimation of distribution algorithms (subEDAs)", " Univariate marginal distribution algorithm (UMDA)", " Estimation of Bayesian network algorithm (EBNA)"], "paper_abstract": "In the traditional estimation of distribution algorithms (EDAs), all the variables of candidate individuals are perturbed through sampling from a probability distribution of promising individuals. However, it may be unnecessary for the EDAs to perturb all variables of candidate individuals at each generation. This is because one variable may be dependent on another variable and all variables may have different saliences even if they are independent. Therefore, only a subset of all variables in EDAs really function at each generation. This paper proposes a novel class of EDAs, termed as subspace estimation of distribution algorithms (subEDAs), from a new perspective to reduce the space of variables for use in model building and model sampling based on EDAs' performance. In subEDAs, only part of all variables of candidate individuals are perturbed at each generation. Three schemes are described in details to determine which variables should be perturbed at each generation: the random picking method (RP), the majority voting based on the similarity between high quality individuals (MVSH) and the majority voting based on the difference between high quality and low quality individuals (MVDHL). Then, subEDAs + RP, subEDAs + MVSH and subEDAs + MVDHL are tested on several benchmark functions and their algorithmic results are compared with those obtained by EDAs. Our experimental results indicate that subEDAs are able to obtain a comparative result using only a subset of problem variables in the model when compared with traditional EDAs. (C) 2010 Elsevier B. V. All rights reserved.", "paper_title": "Subspace estimation of distribution algorithms: To perturb part of all variables in estimation of distribution algorithms", "paper_id": "WOS:000287479200004"}