{"auto_keywords": [{"score": 0.031539476490019626, "phrase": "grand_coalition"}, {"score": 0.012843820133346605, "phrase": "cooperative_interval_games"}, {"score": 0.010541773286379893, "phrase": "real_numbers"}, {"score": 0.004238452771031322, "phrase": "upper_and_lower_bounds"}, {"score": 0.003711723285313348, "phrase": "interval_data"}, {"score": 0.0036553070575015344, "phrase": "cooperative_environment"}, {"score": 0.003403122817578447, "phrase": "interval_allocation"}, {"score": 0.003250238918180901, "phrase": "compact_intervals"}, {"score": 0.0031521392193570846, "phrase": "payoff_vector"}, {"score": 0.002860546817196148, "phrase": "multiple_stages"}, {"score": 0.0028026735035370206, "phrase": "research_question"}, {"score": 0.0024918548761791435, "phrase": "promised_range"}, {"score": 0.0022154296909169826, "phrase": "important_one"}, {"score": 0.0021049977753042253, "phrase": "game_practice"}], "paper_keywords": ["Interval uncertainty", " cooperative games", " allocation rules", " bankruptcy"], "paper_abstract": "Uncertainty accompanies almost every situation in our lives and it influences our decisions. On many occasions uncertainty is so severe that we can only predict some upper and lower bounds for the outcome of our (collaborative) actions, i.e., payoffs lie in some intervals. Cooperative interval games have been proved useful for solving reward/cost sharing problems in situations with interval data in a cooperative environment. In this paper we propose two procedures for cooperative interval games. Both transform an interval allocation, i.e., a payoff vector whose components are compact intervals of real numbers, into a payoff vector (whose components are real numbers) when the value of the grand coalition becomes known (at once or in multiple stages). The research question addressed here is: How to determine for each player his/her/its a payoff generated by cooperation within the grand coalition - in the promised range of payoffs to establish such cooperation - after the uncertainty on the payoff for the grand coalition is resolved? This question is an important one that deserves attention both in the literature and in game practice.", "paper_title": "HOW TO HANDLE INTERVAL SOLUTIONS FOR COOPERATIVE INTERVAL GAMES", "paper_id": "WOS:000276080500002"}