{"auto_keywords": [{"score": 0.025403408196310283, "phrase": "better_performance"}, {"score": 0.00481495049065317, "phrase": "multi-core_platforms"}, {"score": 0.004656871909510407, "phrase": "immersive-audio_technologies"}, {"score": 0.004541712637353326, "phrase": "experimental_and_commercial_audio_systems"}, {"score": 0.0043560464825349275, "phrase": "standard_pcs"}, {"score": 0.004283913685201902, "phrase": "performance_limitations"}, {"score": 0.004248294537944227, "phrase": "excessive_power_consumption"}, {"score": 0.004074574278425223, "phrase": "implementation_prospectives"}, {"score": 0.003334309053314909, "phrase": "cuda_environment"}, {"score": 0.002856563331151566, "phrase": "openmp-annotated_software"}, {"score": 0.002762601646452813, "phrase": "experimental_results"}, {"score": 0.0024779995338749237, "phrase": "wfs."}, {"score": 0.002447101794397243, "phrase": "high-end_gpu_and_fpga_solutions"}, {"score": 0.0023666598192411017, "phrase": "bf"}, {"score": 0.002337066031028783, "phrase": "approximately_two_orders"}, {"score": 0.0022887112679081272, "phrase": "wfs"}, {"score": 0.0022226496830385304, "phrase": "single-chip_gpu_and_fpga_implementations"}, {"score": 0.00212268510072928, "phrase": "loudspeaker_setups"}, {"score": 0.0021049977753042253, "phrase": "pc-based_approaches"}], "paper_keywords": ["Audio systems", " digital signal processors", " reconfigurable architectures"], "paper_abstract": "Immersive-Audio technologies are widely used to build experimental and commercial audio systems. However, most of them are based on standard PCs, which introduce performance limitations and excessive power consumption. To address these drawbacks, we explore the implementation prospectives of two Immersive-Audio technologies: the beamforming (BF) and the wave field synthesis (WFS). We target two popular multi-core platforms, namely graphic processor units (GPUs) and field programmable gate arrays (FPGAs). We identify the most computationally intensive parts of both applications and employ the CUDA environment to map them onto a Quadro FX1700, a GeForce 8600GT, a GTX275, and a GTX460 GPU. Furthermore, we design our custom multi-core hardware accelerators for both algorithms and map them onto Virtex6 FPGAs. Both GPU and FPGA implementations are compared against OpenMP-annotated software running on a Core2 Duo at 3.0 GHz. Experimental results suggest that middle-range GPUs process data equally well as the Core2 Duo for the BF, and approximately two times faster for the WFS. However, high-end GPU and FPGA solutions provide an order of magnitude better performance for BF, and approximately two orders of magnitude better performance for WFS than the Core2 Duo. Ultimately, single-chip GPU and FPGA implementations can provide more power-effective solutions, since they can drive more complex microphone and loudspeaker setups than PC-based approaches.", "paper_title": "Multi-Core Platforms for Beamforming and Wave Field Synthesis", "paper_id": "WOS:000288661800006"}