{"auto_keywords": [{"score": 0.04138579382509756, "phrase": "fuzzy_logic"}, {"score": 0.015719716506582538, "phrase": "database_management_systems"}, {"score": 0.004688989566904871, "phrase": "future_prospects"}, {"score": 0.004143196873246147, "phrase": "prospective_future_developments"}, {"score": 0.003676926952533304, "phrase": "broader_issue"}, {"score": 0.0036124465071873998, "phrase": "information_management"}, {"score": 0.0034714553759044664, "phrase": "new_applications"}, {"score": 0.0032629585038738856, "phrase": "basic_relational_database_model"}, {"score": 0.0030399188412691914, "phrase": "human_consistent_and_friendly_way"}, {"score": 0.0029602552900111433, "phrase": "real_human_intentions"}, {"score": 0.00289546142998427, "phrase": "natural_language"}, {"score": 0.002832081745025006, "phrase": "possibility_theory"}, {"score": 0.002697474061842142, "phrase": "linguistic_quantifiers"}, {"score": 0.0026267609106294817, "phrase": "linguistic_summaries"}, {"score": 0.002512990657100351, "phrase": "bipolar_queries"}, {"score": 0.0024579623598183355, "phrase": "users'_intentions"}, {"score": 0.0021426288417854987, "phrase": "brief_position_statements"}, {"score": 0.0021049977753042253, "phrase": "relevant_and_promising_directions"}], "paper_keywords": ["Database management systems", " DBMS", " Database querying", " Fuzzy logic", " Possibility theory", " Bipolar queries"], "paper_abstract": "This comprehensive, bird's view research note combines the state of the art, a brief presentation of the history and some original solutions, and position like views of some prospective future developments of one of the most relevant and interesting areas related to the use of fuzzy logic in database management systems, notably in its querying component, and - to some extent - in a broader issue of data and information management. We briefly summarize the roots of those new applications of fuzzy logic, more relevant proposals and development in the context of fuzzification of the basic relational database model, and then some of its further generalizations. We particularly focus on fuzzy querying as a human consistent and friendly way of retrieving information due to real human intentions and preferences expressed in natural language represented via fuzzy logic and possibility theory. We mention some extensions, notably fuzzy queries with linguistic quantifiers, and point their close relation to linguistic summaries. As for newer, prospective developments, we mainly focus on bipolar queries that can accomodate the users' intentions and preferences involving some sort of a required and desired, mandatory and optional, etc. conditions. We show various ways of handling such queries. We conclude with some brief position statements of our view on relevant and promising directions, and challenges. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Fuzziness in database management systems: Half a century of developments and future prospects", "paper_id": "WOS:000363458900024"}