{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rainbow_connectivity"}, {"score": 0.003500812175550438, "phrase": "distinct_colors"}, {"score": 0.0034660938095219846, "phrase": "chakraborty_et_al"}, {"score": 0.0031686717525002935, "phrase": "chen_et_al"}, {"score": 0.0031061129850110994, "phrase": "vertex-coloring_version"}, {"score": 0.002925728709297618, "phrase": "total-coloring_version"}, {"score": 0.0028113140998735366, "phrase": "precise_computational_complexities"}, {"score": 0.0027284410545226306, "phrase": "graph_diameters"}, {"score": 0.002420611343093316, "phrase": "fpt_algorithms"}, {"score": 0.0023609780669713288, "phrase": "general_graphs"}, {"score": 0.002158179521369965, "phrase": "polynomial_time"}, {"score": 0.0021049977753042253, "phrase": "n_vertices"}], "paper_keywords": ["Cactus", " Fixed parameter tractability", " Outerplanar graph", " Rainbow coloring", " Series-parallel graph"], "paper_abstract": "For a graph G=(V,E) and a color set C, let f:E -> C be an edge-coloring of G in which two adjacent edges may have the same color. Then, the graph G edge-colored by f is rainbow connected if every two vertices of G have a path in which all edges are assigned distinct colors. Chakraborty et al. defined the problem of determining whether the graph colored by a given edge-coloring is rainbow connected. Chen et al. introduced the vertex-coloring version of the problem as a variant, and we introduce the total-coloring version in this paper. We settle the precise computational complexities of all the three problems with regards to graph diameters, and also characterize these with regards to certain graph classes: cacti, outer planer and series-parallel graphs. We then give FPT algorithms for the three problems on general graphs when parameterized by the number of colors in C; our FPT algorithms imply that all the three problems can be solved in polynomial time for any graph with n vertices if |C|=O(logn).", "paper_title": "On the Rainbow Connectivity of Graphs: Complexity and FPT Algorithms", "paper_id": "WOS:000321908000004"}