{"auto_keywords": [{"score": 0.04439563634541904, "phrase": "b-chromatic_number"}, {"score": 0.005164178773213867, "phrase": "stability_number"}, {"score": 0.00481495049065317, "phrase": "co-bipartite_graphs"}, {"score": 0.004540365779658683, "phrase": "proper_coloring"}, {"score": 0.00446481608187988, "phrase": "color_class"}, {"score": 0.004071121244999291, "phrase": "maximum_number"}, {"score": 0.0040489698651806575, "phrase": "polynomial_time_dynamic_programming_algorithm"}, {"score": 0.0035296217979800463, "phrase": "induced_subgraph"}, {"score": 0.003245270848972794, "phrase": "exactly_the_complements"}, {"score": 0.0032181231788427655, "phrase": "triangle-free_graphs"}, {"score": 0.0031248767378106663, "phrase": "bipartite_graphs"}, {"score": 0.0030857431184193765, "phrase": "main_results"}, {"score": 0.0027548146060608902, "phrase": "augmenting_paths"}, {"score": 0.0024185297601571182, "phrase": "np"}, {"score": 0.0023284972218506157, "phrase": "co-bipartite_graph"}], "paper_keywords": ["b-Coloring", " Stability number two", " Co-triangle-free graphs", " NP-hardness", " Treecographs", " Polytime dynamic programming algorithms"], "paper_abstract": "A b-coloring of a graph is a proper coloring such that every color class contains a vertex that is adjacent to all other color classes. The b-chromatic number of a graph , denoted by , is the maximum number such that admits a b-coloring with colors. A graph is called b-continuous if it admits a b-coloring with colors, for every , and b-monotonic if for every induced subgraph of , and every induced subgraph of . We investigate the b-chromatic number of graphs with stability number two. These are exactly the complements of triangle-free graphs, thus including all complements of bipartite graphs. The main results of this work are the following: (1) We characterize the b-colorings of a graph with stability number two in terms of matchings with no augmenting paths of length one or three. We derive that graphs with stability number two are b-continuous and b-monotonic. (2) We prove that it is NP-complete to decide whether the b-chromatic number of co-bipartite graph is at least a given threshold. (3) We describe a polynomial time dynamic programming algorithm to compute the b-chromatic number of co-trees. (4) Extending several previous results, we show that there is a polynomial time dynamic programming algorithm for computing the b-chromatic number of tree-cographs. Moreover, we show that tree-cographs are b-continuous and b-monotonic.", "paper_title": "b-Coloring is NP-hard on Co-bipartite Graphs and Polytime Solvable on Tree-Cographs", "paper_id": "WOS:000360668100003"}