{"auto_keywords": [{"score": 0.0494713765104406, "phrase": "enterprise_environment"}, {"score": 0.015262923148784984, "phrase": "forensic_investigation"}, {"score": 0.014327639846727086, "phrase": "database_servers"}, {"score": 0.012838462902079458, "phrase": "sql_server"}, {"score": 0.012411773895831557, "phrase": "database_system"}, {"score": 0.00481495049065317, "phrase": "database_server_forensics"}, {"score": 0.004459605573798577, "phrase": "important_data"}, {"score": 0.0038912753334042712, "phrase": "oracle"}, {"score": 0.0036501160751879784, "phrase": "single_methodology"}, {"score": 0.003527712410706358, "phrase": "unique_characteristics"}, {"score": 0.0030908254851076005, "phrase": "existing_investigation"}, {"score": 0.0030645676308053444, "phrase": "server_systems"}, {"score": 0.0029491324941225356, "phrase": "disc_imaging"}, {"score": 0.0028139168128067343, "phrase": "great_losses"}, {"score": 0.002561752783323717, "phrase": "on-line_state"}, {"score": 0.0022926465161639633, "phrase": "new_forensic_investigation_method"}, {"score": 0.0021688641066186817, "phrase": "mysql_databases"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["forensic", " enterprise", " database server", " network topology"], "paper_abstract": "When a forensic investigation is carried out in the enterprise environment, most of the important data are stored in database servers, and data stored in them are very important elements for a forensic investigation. As for database servers with such data stored, there are over 10 various kinds, such as SQL Server and Oracle. All the methods of investigating a database system are important, but this study suggests a single methodology likely to investigate all the database systems while considering the unique characteristics of each database system. A method of detecting a server and acquiring and investigating data in the server can be effectively used for such an investigation on the enterprise environment. For the existing investigation on server systems, severs should be shut down, and disc imaging should be conducted first. However, such a method may inflict great losses on the company in some cases. That is why we need a method to acquire data of a server in on-line state, and this study discusses this method. Besides, on the basis of methodology, this study attempts to determine a possibility that this new forensic investigation method can be practically used by directly applying this method to SQL Server and MySQL databases. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "The effective method of database server forensics on the enterprise environment", "paper_id": "WOS:000309238700002"}