{"auto_keywords": [{"score": 0.04878084216757441, "phrase": "phase_spectrum"}, {"score": 0.0431995346859382, "phrase": "speech_quality"}, {"score": 0.010369789642120111, "phrase": "accurate_phase_spectrum_estimates"}, {"score": 0.007635222381688344, "phrase": "ams"}, {"score": 0.007064482268731857, "phrase": "spectrum_computation"}, {"score": 0.006852471381024715, "phrase": "psc"}, {"score": 0.00633990719415678, "phrase": "magnitude_spectrum"}, {"score": 0.005671889136197017, "phrase": "phase_spectrum_computation"}, {"score": 0.0053687083831499855, "phrase": "mismatched_window_approach"}, {"score": 0.0053278948636797125, "phrase": "non-oracle_case"}, {"score": 0.00481495049065317, "phrase": "speech_enhancement"}, {"score": 0.004800267481708808, "phrase": "typical_speech_enhancement_methods"}, {"score": 0.0047637546163517425, "phrase": "short-time_fourier_analysis-modification-synthesis"}, {"score": 0.004564332342225615, "phrase": "enhancement_process"}, {"score": 0.004529605931216657, "phrase": "resulting_speech"}, {"score": 0.004467759856759422, "phrase": "analysis_windows"}, {"score": 0.004346578458255975, "phrase": "matched_or_mismatched_analysis_windows"}, {"score": 0.004333317512916776, "phrase": "magnitude_and_phase_spectra_estimation"}, {"score": 0.004274140002917499, "phrase": "phase_spectrum_compensation"}, {"score": 0.004183681623478058, "phrase": "objective_and_subjective_experiments"}, {"score": 0.004107664885273563, "phrase": "systematic_manner"}, {"score": 0.004033023763592415, "phrase": "maximum_speech_quality_improvements"}, {"score": 0.003917595152222843, "phrase": "purpose_speech"}, {"score": 0.0038699836459096817, "phrase": "ams_processing"}, {"score": 0.0038287966546968434, "phrase": "clean_speech"}, {"score": 0.0037822602407339757, "phrase": "noisy_speech"}, {"score": 0.0036908711317197506, "phrase": "useful_insight"}, {"score": 0.003612712332149502, "phrase": "first_case"}, {"score": 0.0035416137837591902, "phrase": "analysis_window_type"}, {"score": 0.003493210162898443, "phrase": "spectral_dynamic_range"}, {"score": 0.0033263863142838314, "phrase": "speech_quality_improvements"}, {"score": 0.003260904249649166, "phrase": "improvement_exists"}, {"score": 0.003191821365607734, "phrase": "third_case"}, {"score": 0.0031675040820902662, "phrase": "psc_algorithm"}, {"score": 0.003086198406318254, "phrase": "mismatched_window_techniques"}, {"score": 0.003067372029429801, "phrase": "preceding_cases"}, {"score": 0.002988628906174229, "phrase": "ams_framework"}, {"score": 0.0029794985216490136, "phrase": "noisy_magnitude_spectrum"}, {"score": 0.0029522738951003966, "phrase": "fourth_case"}, {"score": 0.002872079231194257, "phrase": "traditional_magnitude_spectrum-based_enhancement_methods"}, {"score": 0.002640252720685075, "phrase": "mismatched_analysis_windows"}, {"score": 0.002604135905159385, "phrase": "phase_spectra"}, {"score": 0.0025922068056102813, "phrase": "significant_improvements"}, {"score": 0.0025333739266590397, "phrase": "analysis_window"}, {"score": 0.002382916858066829, "phrase": "oracle_case"}, {"score": 0.002357518784454348, "phrase": "better_phase_spectrum_estimation_algorithms"}, {"score": 0.002304000094573908, "phrase": "psc_experiments"}, {"score": 0.0022899343106251094, "phrase": "psc_method"}, {"score": 0.0022829335792733194, "phrase": "better_speech_quality_improvements"}, {"score": 0.0022482489333754603, "phrase": "mmse_experiments"}, {"score": 0.002207320707223336, "phrase": "existing_magnitude_spectrum-based_methods"}, {"score": 0.002190487480572462, "phrase": "non-oracle_approaches"}, {"score": 0.0021671359402491703, "phrase": "mmse_stsa_method"}, {"score": 0.0021473181424523746, "phrase": "significantly_better_speech_quality_improvements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Speech enhancement", " Analysis window", " Short-time Fourier analysis", " Analysis-modification-synthesis (AMS)", " Magnitude spectrum", " Minimum mean-square error (MMSE) short-time spectral amplitude (STSA) estimator", " Phase spectrum", " Phase spectrum compensation (PSC)", " MMSE PSC"], "paper_abstract": "Typical speech enhancement methods, based on the short-time Fourier analysis-modification-synthesis (AMS) framework, modify only the magnitude spectrum and keep the phase spectrum unchanged. In this paper our aim is to show that by modifying the phase spectrum in the enhancement process the quality of the resulting speech can be improved. For this we use analysis windows of 32 ms duration and investigate a number of approaches to phase spectrum computation. These include the use of matched or mismatched analysis windows for magnitude and phase spectra estimation during AMS processing, as well as the phase spectrum compensation (PSC) method. We consider four cases and conduct a series of objective and subjective experiments that examine the importance of the phase spectrum for speech quality in a systematic manner. In the first (oracle) case, our goal is to determine maximum speech quality improvements achievable when accurate phase spectrum estimates are available, but when no enhancement is performed on the magnitude spectrum. For this purpose speech stimuli are constructed, where (during AMS processing) the phase spectrum is computed from clean speech, while the magnitude spectrum is computed from noisy speech. While such a situation does not arise in practice, it does provide us with a useful insight into how much a precise knowledge of the phase spectrum can contribute towards speech quality. In this first case, matched and mismatched analysis window approaches are investigated. Particular attention is given to the choice of analysis window type used during phase spectrum computation, where the effect of spectral dynamic range on speech quality is examined. In the second (non-oracle) case, we consider a more realistic scenario where only the noisy spectra (observable in practice) is available. We study the potential of the mismatched window approach for speech quality improvements in this non-oracle case. We would also like to determine how much room for improvement exists between this case and the best (oracle) case. In the third case, we use the PSC algorithm to enhance the phase spectrum. We compare this approach with the oracle and non-oracle matched and mismatched window techniques investigated in the preceding cases. While in the first three cases we consider the usefulness of various approaches to phase spectrum computation within the AMS framework when noisy magnitude spectrum is used, in the fourth case we examine the usefulness of these techniques when enhanced magnitude spectrum is employed. Our aim (in the context of traditional magnitude spectrum-based enhancement methods) is to determine how much benefit in terms of speech quality can be attained by also processing the phase spectrum. For this purpose, the minimum mean-square error (M M SE) short-time spectral amplitude (STSA) estimates are employed instead of noisy magnitude spectra. The results of the oracle experiments show that accurate phase spectrum estimates can considerably contribute towards speech quality, as well as that the use of mismatched analysis windows (in the computation of the magnitude and phase spectra) provides significant improvements in both objective and subjective speech quality - especially, when the choice of analysis window used for phase spectrum computation is carefully considered. The mismatched window approach was also found to improve speech quality in the non-oracle case. While the improvements were found to be statistically significant, they were only modest compared to those observed in the oracle case. This suggests that researc into better phase spectrum estimation algorithms, while a challenging task, could be worthwhile. The results of the PSC experiments indicate that the PSC method achieves better speech quality improvements than the other non-oracle methods considered. The results of the MMSE experiments suggest that accurate phase spectrum estimates have a potential to significantly improve performance of existing magnitude spectrum-based methods. Out of the non-oracle approaches considered, the combination of the MMSE STSA method with the PSC algorithm produced significantly better speech quality improvements than those achieved by these methods individually. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "The importance of phase in speech enhancement", "paper_id": "WOS:000288929000002"}