{"auto_keywords": [{"score": 0.04865550139605982, "phrase": "hie"}, {"score": 0.012010214586100932, "phrase": "emergency_physicians"}, {"score": 0.00837737686551536, "phrase": "written_reports"}, {"score": 0.00481495049065317, "phrase": "health_information_exchange"}, {"score": 0.0046018264570209765, "phrase": "potentially_powerful_technology"}, {"score": 0.00443141503046841, "phrase": "emergency_departments"}, {"score": 0.004315879542755464, "phrase": "emergency_physicians'_current_perceptions"}, {"score": 0.004283423748543866, "phrase": "hie._objectives"}, {"score": 0.004171730509424374, "phrase": "emergency_physicians'_perceived_needs"}, {"score": 0.004109212945115815, "phrase": "hie._methods"}, {"score": 0.0038683363637006902, "phrase": "web-based_tool"}, {"score": 0.003614124997453808, "phrase": "new_york_city"}, {"score": 0.003546513036085932, "phrase": "response_rate"}, {"score": 0.0033008858616145205, "phrase": "external_health_information"}, {"score": 0.0030606302942851027, "phrase": "external_data"}, {"score": 0.0027532820796396713, "phrase": "rank-order_list"}, {"score": 0.0026212437316947197, "phrase": "discharge_summaries"}, {"score": 0.002458061764297101, "phrase": "advanced_imaging"}, {"score": 0.0024395426929046415, "phrase": "cardiac_studies"}, {"score": 0.0023758152068732025, "phrase": "strong_perceived_need"}, {"score": 0.0021049977753042253, "phrase": "new_york_city_region"}], "paper_keywords": [""], "paper_abstract": "Background: Health information exchange (HIE) is a potentially powerful technology that can improve the quality of care delivered in emergency departments, but little is known about emergency physicians' current perceptions of HIE. Objectives: This study sought to assess emergency physicians' perceived needs and knowledge of HIE. Methods: A questionnaire was developed based on heuristics from the literature and implemented in a Web-based tool. The survey was sent as a hyperlink via e-mail to 371 attending emergency physicians at 12 hospitals in New York city. Results: The response rate was 58% (n = 216). Although 63% said more than one quarter of their patients would benefit from external health information, the barriers to obtain it without HIE are too high-85% said it was difficult or very difficult to obtain external data, taking an average of 66 minutes, 72% said that their attempts fail half of the time, and 56% currently attempt to obtain external data less than 10% of the time. When asked to create a rank-order list, electrocardiograms (ECGs) were ranked the highest, followed by discharge summaries. Respondents also chose images over written reports for ECGs and X-rays, but preferred written reports for advanced imaging and cardiac studies. Conclusion: There is a strong perceived need for HIE, most respondents were not aware of HIE prior to this study, and there are certain types of data and presentations of data that are preferred by emergency physicians in the New York City region.", "paper_title": "Emergency physicians' perceptions of health information exchange", "paper_id": "WOS:000251377300003"}