{"auto_keywords": [{"score": 0.049529099900281724, "phrase": "online_algorithms"}, {"score": 0.03280004691092879, "phrase": "double_coverage"}, {"score": 0.032252032181894714, "phrase": "lazy_double_coverage"}, {"score": 0.008960918483761729, "phrase": "greedy"}, {"score": 0.008032513781632765, "phrase": "relative_worst_order_analysis"}, {"score": 0.00481495049065317, "phrase": "performance_measures"}, {"score": 0.004597457370802855, "phrase": "systematic_study"}, {"score": 0.004339293854115301, "phrase": "specific_problem"}, {"score": 0.0038431888954930083, "phrase": "core_challenge"}, {"score": 0.0035648266669315943, "phrase": "competitive_analysis"}, {"score": 0.0034036089823450385, "phrase": "bijective_analysis"}, {"score": 0.003138768436081888, "phrase": "greedy_algorithm"}, {"score": 0.0030141556259370675, "phrase": "commonly_studied_algorithms"}, {"score": 0.0029281780903782284, "phrase": "server_problems"}, {"score": 0.0021049977753042253, "phrase": "first_proof"}], "paper_keywords": ["Online algorithms", " K-server problem", " Performance measures"], "paper_abstract": "This paper provides a systematic study of several proposed measures for online algorithms in the context of a specific problem, namely, the two server problem on three colinear points. Even though the problem is simple, it encapsulates a core challenge in online algorithms which is to balance greediness and adaptability. We examine Competitive Analysis, the Max/Max Ratio, the Random Order Ratio, Bijective Analysis and Relative Worst Order Analysis, and determine how these measures compare the Greedy Algorithm, Double Coverage, and Lazy Double Coverage, commonly studied algorithms in the context of server problems. We find that by the Max/Max Ratio and Bijective Analysis, Greedy is the best of the three algorithms. Under the other measures, Double Coverage and Lazy Double Coverage are better, though Relative Worst Order Analysis indicates that Greedy is sometimes better. Only Bijective Analysis and Relative Worst Order Analysis indicate that Lazy Double Coverage is better than Double Coverage. Our results also provide the first proof of optimality of an algorithm under Relative Worst Order Analysis.", "paper_title": "A Comparison of Performance Measures for Online Algorithms", "paper_id": "WOS:000356461400004"}