{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "artificial_neural_networks"}, {"score": 0.004763565662615503, "phrase": "genetic_algorithms"}, {"score": 0.004662427600500598, "phrase": "algo-trading_model"}, {"score": 0.004612662942073808, "phrase": "intra-day_foreign_exchange_speculation"}, {"score": 0.003990385737207714, "phrase": "short_term_prediction"}, {"score": 0.003342280102112269, "phrase": "intra-day_market_prediction"}, {"score": 0.003018257474553252, "phrase": "ann"}, {"score": 0.0025962029048520324, "phrase": "initial_statistical_tests"}, {"score": 0.002473560912156024, "phrase": "daily_forex_currency_rates_time_series"}, {"score": 0.002382182688788248, "phrase": "important_result"}, {"score": 0.0023314867226678555, "phrase": "proposed_model"}, {"score": 0.0022333012657436307, "phrase": "optimal_trading_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Foreign exchange", " Artificial neural networks", " Genetic algorithms", " Trading strategies", " Technical analysis"], "paper_abstract": "The Foreign Exchange Market is the biggest and one of the most liquid markets in the world. This market has always been one of the most challenging markets as far as short term prediction is concerned. Due to the chaotic, noisy, and non-stationary nature of the data, the majority of the research has been focused on daily, weekly, or even monthly prediction. The literature review revealed that there is a gap for intra-day market prediction. Identifying this gap, this paper introduces a prediction and decision making model based on Artificial Neural Networks (ANN) and Genetic Algorithms. The dataset utilized for this research comprises of 70 weeks of past currency rates of the 3 most traded currency pairs: GBP\\USD, EUR\\GBP, and EUR\\USD. The initial statistical tests confirmed with a significance of more than 95% that the daily FOREX currency rates time series are not randomly distributed. Another important result is that the proposed model achieved 72.5% prediction accuracy. Furthermore, implementing the optimal trading strategy, this model produced 23.3% Annualized Net Return. (c) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Utilizing artificial neural networks and genetic algorithms to build an algo-trading model for intra-day foreign exchange speculation", "paper_id": "WOS:000321700400034"}