{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dynamic_playlist_generation_heuristics"}, {"score": 0.004688321299229397, "phrase": "dynamic_way"}, {"score": 0.00378767277402891, "phrase": "currently_played_song"}, {"score": 0.0037076911119175455, "phrase": "skip_button"}, {"score": 0.003629392214109574, "phrase": "current_song"}, {"score": 0.0033861224940737846, "phrase": "next_song"}, {"score": 0.0027349450784503247, "phrase": "general_unified_framework"}, {"score": 0.0025514745448798363, "phrase": "existing_heuristics"}, {"score": 0.002470987929071079, "phrase": "extensive_experimental_evaluations"}, {"score": 0.0023675986784123656, "phrase": "presented_formal_framework"}, {"score": 0.0021735890994119757, "phrase": "specific_circumstances"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Dynamic playlist generation", " Fuzzy connectives and aggregation operators", " Fuzzy relations", " Music similarity"], "paper_abstract": "We study a dynamic way of automatically generating sequences of songs in this paper Starting from a given seed song, a sequence is generated on-the-fly while listening to the music. During this process, the user can express his or her dislike for the currently played song by pressing a skip button. When the current song is finished or skipped, a heuristic is used to choose the next song to be played. We introduce fuzzy set theory as a formalism for defining such heuristics, because this allows us to make the definitions systematic, formal, and intuitively clear. By doing this, we obtain a general unified framework that includes all heuristics introduced previously by other authors. We compare these existing heuristics with several novel ones by means of extensive experimental evaluations. Moreover, we demonstrate that the presented formal framework can be used to easily generate variations of a heuristic that perform significantly better under specific circumstances. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A fuzzy framework for defining dynamic playlist generation heuristics", "paper_id": "WOS:000272130200002"}