{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "europe"}, {"score": 0.04624526983627953, "phrase": "urban_sprawl"}, {"score": 0.004555217356295278, "phrase": "present_paper"}, {"score": 0.004309434349688514, "phrase": "multidimensional_point"}, {"score": 0.004009555045206973, "phrase": "population_size"}, {"score": 0.0033384259516301223, "phrase": "main_european_cities"}, {"score": 0.003211145390854807, "phrase": "best_possible_dataset"}, {"score": 0.0030208364972341096, "phrase": "self-organizing_map"}, {"score": 0.0026584843838039166, "phrase": "clustering_technique"}, {"score": 0.002392160074827245, "phrase": "germany"}, {"score": 0.0022129983153880467, "phrase": "average_city"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Urban sprawl", " Self-organizing maps", " Connectivity", " Density", " Scattering", " Europe"], "paper_abstract": "The present paper addresses the issue of urban sprawl in Europe from a multidimensional point of view, identifying the most sprawled areas and characterizing them in terms of population size. The literature is reviewed to categorize and extract the most relevant six dimensions that define the concept and several indices are specified to implement them. These are then calculated for a sample of the main European cities that uses several sources to obtain the best possible dataset to measure urban sprawl. All this information is brought together using the self-organizing map (SOM) algorithm to be visualized and further studied, taking advantage of its properties as a data-reduction as well as a clustering technique. The analysis locates the hot-spots of urban sprawl in Europe in the centre of the continent, around Germany, and characterizes such urban areas as small, always half the size of the average city of the sample. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Multidimensional urban sprawl in Europe: A self-organizing map approach", "paper_id": "WOS:000291916900001"}