{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "materialized_view_selection"}, {"score": 0.031724438080077695, "phrase": "lower_bound"}, {"score": 0.004666756595735701, "phrase": "large_number"}, {"score": 0.004625255533545965, "phrase": "online_analytical_processing"}, {"score": 0.0044231966846655394, "phrase": "data_warehouse"}, {"score": 0.004154995396099332, "phrase": "system_throughput"}, {"score": 0.003991196463806465, "phrase": "materialized_views"}, {"score": 0.0039380388343479384, "phrase": "view_selection"}, {"score": 0.003902992784453769, "phrase": "resource_constraint"}, {"score": 0.003732368382223596, "phrase": "data_warehouses"}, {"score": 0.0035851703423654432, "phrase": "limited_resource"}, {"score": 0.0035532533960012298, "phrase": "disk_space"}, {"score": 0.0034283921404628975, "phrase": "total_query_processing_cost"}, {"score": 0.0032638170723261538, "phrase": "disk-space_constraint"}, {"score": 0.0032492519841546682, "phrase": "s._many"}, {"score": 0.0032347516831068685, "phrase": "efficient_greedy_algorithms"}, {"score": 0.003065698491529525, "phrase": "greedy_solutions"}, {"score": 0.0021334650920198715, "phrase": "proposed_algorithm"}], "paper_keywords": ["A* search", " materialized view selection", " online analytical processing (OLAP)"], "paper_abstract": "Decision support systems issue a large number of online analytical processing (OLAP) queries to access very large databases. A data warehouse needs to precompute or materialize some of such OLAP queries in order to improve the system throughput, since many coming queries can benefit greatly from these materialized views. Materialized view selection with resource constraint is one of the most important issues in the management of data warehouses. It addresses how to fully utilize the limited resource, disk space, or maintenance time to minimize the total query processing cost. This paper revisits the problem of materialized view selection under a disk-space constraint S. Many efficient greedy algorithms have been developed to address this problem. The quality of greedy solutions is guaranteed by a lower bound. However, it is observed that, when S is small, this lower bound can be very small and even be negative. In such cases, their solution quality will not be guaranteed well. In order to improve further the solution quality in such cases, a new competitive A* algorithm is proposed. It is shown that it is just the distinctive topological structure of the dependent lattice that makes the A* search a very competitive strategy for this problem. Both theoretical and experimental results show that the proposed algorithm is a powerful, efficient, and flexible approach to this problem.", "paper_title": "A* search: An efficient and flexible approach to materialized view selection", "paper_id": "WOS:000237580400013"}