{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cross-boundary_information_sharing"}, {"score": 0.009368766767996263, "phrase": "interagency_information_sharing"}, {"score": 0.0045759914672856275, "phrase": "taiwan"}, {"score": 0.0041167185402778425, "phrase": "case_study"}, {"score": 0.004084584884062157, "phrase": "taiwan_e-government"}, {"score": 0.003732526540522333, "phrase": "exploratory_inquiry"}, {"score": 0.003561017335579207, "phrase": "government_agencies"}, {"score": 0.00351938145050947, "phrase": "information-sharing_initiatives"}, {"score": 0.0032667240408191015, "phrase": "technological_factors"}, {"score": 0.003092200512475624, "phrase": "organizational_factors"}, {"score": 0.0030440661915657175, "phrase": "situational_factors"}, {"score": 0.002973261772253616, "phrase": "respective_impacts"}, {"score": 0.002825435048559866, "phrase": "current_literature"}, {"score": 0.0028033523242224833, "phrase": "newly_identified_factors"}, {"score": 0.002612194827110595, "phrase": "agencies'_intentions"}, {"score": 0.002551409948440577, "phrase": "planned_behaviour"}, {"score": 0.0024920359789965783, "phrase": "theoretical_discussion"}, {"score": 0.002453221048083196, "phrase": "identified_factors"}, {"score": 0.002405549400304955, "phrase": "practical_implications"}, {"score": 0.0021383149182448544, "phrase": "future_studies"}, {"score": 0.0021049977753042253, "phrase": "current_work"}], "paper_keywords": ["Boundary", " government", " information sharing", " inter-organization"], "paper_abstract": "This paper explores the complexity of cross-boundary information sharing in the public sector. In particular, determinants influencing interagency information sharing are investigated and discussed, and a case study of Taiwan e-Government is employed. Four perspectives, including technology, organization, legislation and policy, and environment, are used to conduct this exploratory inquiry. Legislation and policy is found to be the most influential factor among government agencies participating in information-sharing initiatives. Organizational factors are also found to be significant, but less so than legislation and policy. Technological factors are considered relatively more easily addressed when compared with legislation and policy and organizational factors. Finally, situational factors are also found to have respective impacts on interagency information sharing. In addition to factors that are discussed in the current literature, newly identified factors are illustrated to provide insights. Moreover, in order to better conceptualize how identified factors determine agencies' intentions towards cross-boundary information sharing, theory of planned behaviour is used to form a theoretical discussion by integrating the identified factors of the study. Practical implications are also provided to address how cross-boundary information sharing among government agencies can be better achieved. Lastly, the conclusion outlines the contributions and limitations of this research and suggests future studies related to the current work.", "paper_title": "Exploring the determinants of cross-boundary information sharing in the public sector: An e-Government case study in Taiwan", "paper_id": "WOS:000342200700008"}