{"auto_keywords": [{"score": 0.04902996110334028, "phrase": "mobile_wireless_sensor_networks"}, {"score": 0.013355454340398799, "phrase": "cellular-automaton-based_algorithms"}, {"score": 0.007970546996801303, "phrase": "mobile_sensors"}, {"score": 0.007920406337477742, "phrase": "mobile_objects"}, {"score": 0.00481495049065317, "phrase": "cellular_automaton"}, {"score": 0.004739344544832536, "phrase": "mobile_sensor_networks"}, {"score": 0.00459165923324494, "phrase": "traditional_networks"}, {"score": 0.00444855545435494, "phrase": "unconventional_computational_model"}, {"score": 0.004309892341117025, "phrase": "unconventional_model"}, {"score": 0.004122964978180509, "phrase": "main_advantage"}, {"score": 0.004019797503157808, "phrase": "strictly_local_algorithms"}, {"score": 0.003906804492585634, "phrase": "sensor_networks"}, {"score": 0.003725470458263889, "phrase": "first_problem"}, {"score": 0.003666908853711961, "phrase": "connected_sensors"}, {"score": 0.003441693005357189, "phrase": "single_location"}, {"score": 0.0033983319323179495, "phrase": "second_problem"}, {"score": 0.0029001301231553005, "phrase": "initial_configuration"}, {"score": 0.00261191993113166, "phrase": "direct_line"}, {"score": 0.0024669449102126518, "phrase": "third_problem"}, {"score": 0.002367259428370391, "phrase": "dense_area"}, {"score": 0.0021251363422701446, "phrase": "existing_algorithms"}], "paper_keywords": ["Mobile sensor networks", " cellular automata", " local algorithm", " synchronous gathering", " chain length", " object monitoring", " perfomance evaluation"], "paper_abstract": "Mobile wireless sensor networks involve many aspects not dealt with in traditional networks, and therefore, can be viewed as an unconventional computational model. We design algorithms for mobile wireless sensor networks based on another unconventional model of computation, namely, the biologically-inspired cellular automaton. The main advantage of using cellular-automaton-based algorithms is that they are strictly local algorithms, and as such are more suitable for sensor networks. We design cellular-automaton-based algorithms for three optimization problems in connection with mobile wireless sensor networks. The first problem involves a set of connected sensors that are deployed randomly in a network. The goal of the algorithm is to gather all the sensors at a single location. In the second problem, we are given a set of sensors which form a chain. All sensors except for the two end points of the chain are connected to their two neighbors, right and left. The two end points are fixed and can directly communicate with only one neighbor. Other sensors can move autonomously. At an initial configuration of the network, the chain can be winding and even overlap with itself. Our goal is to move the sensors so that they can come as close as possible to the direct line between the two end points, and while the sensors move the network should remain connected. In the third problem, a number of mobile sensors and mobile objects are deployed randomly in a dense area of the network and are allowed to move within the network. Our main goal is to monitor the mobile objects by the mobile sensors as long as possible. We show that our algorithms perform better than existing algorithms for all three problems.", "paper_title": "Cellular Automaton Based Localized Algorithms for Mobile Sensor Networks", "paper_id": "WOS:000372944400005"}