{"auto_keywords": [{"score": 0.044266248034728096, "phrase": "pooling-based_gwa_studies"}, {"score": 0.01394145443288174, "phrase": "human_genome"}, {"score": 0.009641149362626276, "phrase": "single_marker_analysis"}, {"score": 0.007429976858422516, "phrase": "neighboring_snps"}, {"score": 0.00481495049065317, "phrase": "multiple_platform_pooling-based_genome-wide_association_studies"}, {"score": 0.004618342952383313, "phrase": "marginal_increase"}, {"score": 0.004531637625717547, "phrase": "substantial_cost"}, {"score": 0.004330099613414957, "phrase": "correlation_structure"}, {"score": 0.003923532450854754, "phrase": "genomic_coverage"}, {"score": 0.0035820833812158005, "phrase": "linkage_disequilibrium"}, {"score": 0.0034096661914349577, "phrase": "new_non-haplotype_multimarker_multi-loci_method"}, {"score": 0.0031365196064043494, "phrase": "theoretical_framework"}, {"score": 0.002985484575498061, "phrase": "multimarker_approach"}, {"score": 0.002841701708055512, "phrase": "different_pools"}, {"score": 0.002820202660128789, "phrase": "hapmap_individuals"}, {"score": 0.0027151161550531206, "phrase": "combined_total"}, {"score": 0.002623881637290192, "phrase": "multimarker_analysis"}, {"score": 0.002574523719093119, "phrase": "pooling-based_studies"}, {"score": 0.0025357050267224715, "phrase": "efficient_integration"}, {"score": 0.0025165151708122957, "phrase": "multiple_microarray_platforms"}, {"score": 0.0023235629819760018, "phrase": "association_significance"}, {"score": 0.0022454568164873576, "phrase": "ld."}, {"score": 0.0022284577808744316, "phrase": "multimarker_method"}], "paper_keywords": [""], "paper_abstract": "For many genome-wide association (GWA) studies individually genotyping one million or more SNPs provides a marginal increase in coverage at a substantial cost. Much of the information gained is redundant due to the correlation structure inherent in the human genome. Pooling-based GWA studies could benefit significantly by utilizing this redundancy to reduce noise, improve the accuracy of the observations and increase genomic coverage. We introduce a measure of correlation between individual genotyping and pooling, under the same framework that r(2) provides a measure of linkage disequilibrium (LD) between pairs of SNPs. We then report a new non-haplotype multimarker multi-loci method that leverages the correlation structure between SNPs in the human genome to increase the efficacy of pooling-based GWA studies. We first give a theoretical framework and derivation of our multimarker method. Next, we evaluate simulations using this multimarker approach in comparison to single marker analysis. Finally, we experimentally evaluate our method using different pools of HapMap individuals on the Illumina 450S Duo, Illumina 550K and Affymetrix 5.0 platforms for a combined total of 1 333 631 SNPs. Our results show that use of multimarker analysis reduces noise specific to pooling-based studies, allows for efficient integration of multiple microarray platforms and provides more accurate measures of significance than single marker analysis. Additionally, this approach can be extended to allow for imputing the association significance for SNPs not directly observed using neighboring SNPs in LD. This multimarker method can now be used to cost-effectively complete pooling-based GWA studies with multiple platforms across over one million SNPs and to impute neighboring SNPs weighted for the loss of information due to pooling.", "paper_title": "Multimarker analysis and imputation of multiple platform pooling-based genome-wide association studies", "paper_id": "WOS:000258860700010"}