{"auto_keywords": [{"score": 0.0424973314681819, "phrase": "box_offices"}, {"score": 0.015719716506582538, "phrase": "online_social_media"}, {"score": 0.013739267148407565, "phrase": "social_media"}, {"score": 0.003935892934907777, "phrase": "previous_work"}, {"score": 0.003780286517897356, "phrase": "related_microblogs"}, {"score": 0.0029672941061574375, "phrase": "garbage_microblogs"}, {"score": 0.0026288296376857506, "phrase": "svm"}, {"score": 0.0026023381988430666, "phrase": "neutral_network"}, {"score": 0.002524688179363081, "phrase": "prediction_method"}, {"score": 0.0023405257495466352, "phrase": "tencent_microblog"}, {"score": 0.0022253272487899587, "phrase": "china"}, {"score": 0.0021049977753042253, "phrase": "predictive_power"}], "paper_keywords": ["Box office", " Microblog", " Social media", " Prediction model"], "paper_abstract": "As the importance and popularity of online social media has become more obvious, there are more researches aiming at making use of information from them. One important topic of this is predicting the future with social media. This paper focuses on predicting box offices using microblog. Compared with previous work which makes use of the count of related microblogs simply, the information from social media has been utilized more deeply in this paper. Two sets of features have been extracted: count based features and content based features. For the former, the information in the aspect of users, which decrease the influence of garbage microblogs, has been exploited. For content based features, a new box office oriented semantic classification method has been provided to make the features more relative with box offices. Meanwhile, more complex machine learning models such as SVM and neutral network have been applied to the prediction method. Our prediction model is more accurate and reliable. With our prediction method, the data in Tencent microblog has been utilized to predict box offices of certain movies in China. With the results, the strength of our method and predictive power of online social media can be completely demonstrated. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Box office prediction based on microblog", "paper_id": "WOS:000329955900016"}