{"auto_keywords": [{"score": 0.032292199824268716, "phrase": "cellular_efforts"}, {"score": 0.004651057147690674, "phrase": "specific_brain_areas"}, {"score": 0.004537401559396022, "phrase": "homeostatic_equilibrium"}, {"score": 0.004404658750724105, "phrase": "basic_goal"}, {"score": 0.0043183186953102805, "phrase": "living_cells"}, {"score": 0.004009288598277725, "phrase": "physiological_damage"}, {"score": 0.0037222908218253054, "phrase": "homeostatic_protection"}, {"score": 0.003421697038352743, "phrase": "neuron's_activity"}, {"score": 0.0031609252620168446, "phrase": "minimum_awareness"}, {"score": 0.0021049977753042253, "phrase": "intentional_action"}], "paper_keywords": ["homeostasis", " consciousness", " protection", " goal-directed actions", " regulation", " neuron", " damage"], "paper_abstract": "Behaviour can be both unpredictable and goal directed, as animals act in correspondence with their motivation. Motivation arises when neurons in specific brain areas leave the state of homeostatic equilibrium and are injured. The basic goal of organisms and living cells is to maintain their life and their functional state is optimal if it does not lead to physiological damage. This can somehow be sensed by neurons and the occurrence of damage elicits homeostatic protection to recover excitability and the ability to produces spikes. It can be argued that the neuron's activity is guided on the scale of \"damage-protection\" and it behaves as an object possessing minimum awareness. The approach of death increases cellular efforts to operate. Thus, homeostasis may evidently produce both maintenance of life and will. The question is - how does homeostasis reach the optimum? We have no possibility of determining how the cell evaluates its own states, e.g. as \"too little free energy\" or in terms of \"threat\" to life. In any case, the approach of death increases cellular efforts to operate. For the outside observer, this is reminiscent of intentional action and a manifestation of will.", "paper_title": "Consciousness, endogenous generation of goals and homeostasis", "paper_id": "WOS:000357322000005"}