{"auto_keywords": [{"score": 0.049636680610423214, "phrase": "biomedical_informatics"}, {"score": 0.00802791687326689, "phrase": "related_disciplines"}, {"score": 0.00481495049065317, "phrase": "biomedical_informatics_-_a_confluence_of"}, {"score": 0.004726382602809228, "phrase": "broad_discipline"}, {"score": 0.0038648914374241447, "phrase": "international_group"}, {"score": 0.00365532401354066, "phrase": "medicine"}, {"score": 0.003446353878654566, "phrase": "invited_experts"}, {"score": 0.0032796556275748842, "phrase": "interdisciplinary_field"}, {"score": 0.0032192371383026543, "phrase": "different_scientific_backgrounds"}, {"score": 0.003080821932646019, "phrase": "research_findings"}, {"score": 0.003016377872938571, "phrase": "constructive_aspect"}, {"score": 0.0027741761880779535, "phrase": "biomedical_content"}, {"score": 0.0026811531172346676, "phrase": "rigid_disciplinary_structures"}, {"score": 0.0026399046763432906, "phrase": "sufficient_adaptability"}, {"score": 0.002607362103727335, "phrase": "important_trends"}, {"score": 0.0022960215670802774, "phrase": "different_languages"}, {"score": 0.002239743716564573, "phrase": "separate_bibliographic_databases"}, {"score": 0.0022052711621931144, "phrase": "potentially_connected_findings"}, {"score": 0.0021050099682349646, "phrase": "bridges"}], "paper_keywords": ["Biomedical informatics", " bioinformatics", " health informatics", " multidisciplinarity", " interdisciplinarity", " education"], "paper_abstract": "Background: Biomedical informatics is a broad discipline that borrows many methods and techniques from other disciplines. Objective: To reflect a) on the character of biomedical informatics and to determine whether it is multi-disciplinary or inter-disciplinary; b) on the question whether biomedical informatics is more than the sum of its supporting disciplines and c) on the position of biomedical informatics with respect to related disciplines. Method: Inviting an international group of experts in biomedical informatics and related disciplines on the occasion of the 50th anniversary of Methods of information in Medicine to present their viewpoints. Results and Conclusions: This paper contains the reflections of a number of the invited experts on the character of biomedical informatics. Most of the authors agree that biomedical informatics is an interdisciplinary field of study where researchers with different scientific backgrounds alone or in combination carry out research. Biomedical informatics is a very broad scientific field and still expanding, yet comprised of a constructive aspect (designing and building systems). One author expressed that the essence of biomedical informatics, as opposed to related disciplines, lies in the modelling of the biomedical content. Interdisciplinarity also has consequences for education. Maintaining. rigid disciplinary structures does not allow for sufficient adaptability to capitalize on important trends nor to leverage the influences these trends may have on biomedical informatics. It is therefore important for students to become aware of research findings in related disciplines. In this respect, it was also noted that the fact that many scientific fields use different languages and that the research findings are stored in separate bibliographic databases makes it possible that potentially connected findings will never be linked, despite the fact that these findings were published. Bridges between the sciences are needed for the success of biomedical informatics.", "paper_title": "Biomedical Informatics - A Confluence of Disciplines?", "paper_id": "WOS:000298834500003"}