{"auto_keywords": [{"score": 0.04798652790106824, "phrase": "university_digital_libraries"}, {"score": 0.03531917121851836, "phrase": "user_profiles"}, {"score": 0.015719716506582538, "phrase": "incomplete_information"}, {"score": 0.015461469888833061, "phrase": "fuzzy_linguistic_recommender_system"}, {"score": 0.01026306887064034, "phrase": "user_preferences"}, {"score": 0.00428222231579898, "phrase": "main_problem"}, {"score": 0.004211069233133584, "phrase": "academic_digital_libraries"}, {"score": 0.004118026552723285, "phrase": "similar_tools"}, {"score": 0.0035811651542886746, "phrase": "research_resources"}, {"score": 0.0028795712616923462, "phrase": "new_fuzzy_linguistic_recommender_system"}, {"score": 0.0025461386232786356, "phrase": "incomplete_fuzzy_linguistic_preference_relation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Recommender systems", " Fuzzy linguistic modeling", " University digital libraries", " Incomplete fuzzy linguistic preference relation"], "paper_abstract": "As in the Web, the growing of information is the main problem of the academic digital libraries. Thus, similar tools could be applied in university digital libraries to facilitate the information access by the students and teachers. In 1461 we presented a fuzzy linguistic recommender system to advice research resources in university digital libraries. The problem of this system is that the user profiles are provided directly by the own users and the process for acquiring user preferences is quite difficult because it requires too much user effort. In this paper we present a new fuzzy linguistic recommender system that facilitates the acquisition of the user preferences to characterize the user profiles. We allow users to provide their preferences by means of incomplete fuzzy linguistic preference relation. We include tools to manage incomplete information when the users express their preferences, and, in such a way, we show that the acquisition of the user profiles is improved. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Dealing with incomplete information in a fuzzy linguistic recommender system to disseminate information in university digital libraries", "paper_id": "WOS:000273385100005"}