{"auto_keywords": [{"score": 0.030514940731389485, "phrase": "confidence_score"}, {"score": 0.00481495049065317, "phrase": "predicted_protein-protein_interaction_scores"}, {"score": 0.004585212379675535, "phrase": "functional_components"}, {"score": 0.004260906498835763, "phrase": "mature_academic_research"}, {"score": 0.003998380230709541, "phrase": "human_ppis"}, {"score": 0.003099888654615187, "phrase": "user-friendly_interface"}, {"score": 0.002838319783373086, "phrase": "candidate_protein_interaction"}, {"score": 0.0027159094186967247, "phrase": "false_positive_interactions"}, {"score": 0.0026501935378083663, "phrase": "existing_databases"}, {"score": 0.0026115277372906805, "phrase": "new_protein_interactions"}, {"score": 0.002523481637809674, "phrase": "true_protein_interaction"}, {"score": 0.0024028135317872, "phrase": "hybrid_methodology"}, {"score": 0.0022107428653358715, "phrase": "accurate_and_interpretable_scoring_methodology"}, {"score": 0.002125735077004312, "phrase": "proposed_scoring_scheme"}, {"score": 0.0021049977753042253, "phrase": "existing_computational_methods"}], "paper_keywords": ["Protein-protein interactions", " Human", " PPI scoring methods", " Genetic algorithms", " Kalman Filters", " Knowledge base"], "paper_abstract": "Proteins are the functional components of many cellular processes and the identification of their physical protein-protein interactions (PPIs) is an area of mature academic research. Various databases have been developed containing information about experimentally and computationally detected human PPIs as well as their corresponding annotation data. However, these databases contain many false positive interactions, are partial and only a few of them incorporate data from various sources. To overcome these limitations, we have developed HINT-KB (http://biotools.ceid.upatras.gr/hint-kb), a knowledge base that integrates data from various sources, provides a user-friendly interface for their retrieval, calculates a set of features of interest and computes a confidence score for every candidate protein interaction. This confidence score is essential for filtering the false positive interactions which are present in existing databases, predicting new protein interactions and measuring the frequency of each true protein interaction. For this reason, a novel machine learning hybrid methodology, called (Evolutionary Kalman Mathematical Modelling-EvoKalMaModel), was used to achieve an accurate and interpretable scoring methodology. The experimental results indicated that the proposed scoring scheme outperforms existing computational methods for the prediction of PPIs.", "paper_title": "The Human Interactome Knowledge Base (HINT-KB): an integrative human protein interaction database enriched with predicted protein-protein interaction scores using a novel hybrid technique", "paper_id": "WOS:000343751600008"}