{"auto_keywords": [{"score": 0.046211774964878174, "phrase": "conversational_recommender_system"}, {"score": 0.035921135294622444, "phrase": "undominated_options"}, {"score": 0.032366879511350186, "phrase": "preference_dominance"}, {"score": 0.00481495049065317, "phrase": "preference_dominance_reasoning"}, {"score": 0.004595356579614969, "phrase": "comparative_preferences"}, {"score": 0.004344965512058521, "phrase": "small_set"}, {"score": 0.0036382660173943393, "phrase": "user's_preferences"}, {"score": 0.003313592421224647, "phrase": "best_options"}, {"score": 0.0032219438233946312, "phrase": "user_preferences"}, {"score": 0.0029343128039167185, "phrase": "query_suggestion"}, {"score": 0.002853124436286834, "phrase": "first_instance"}, {"score": 0.0027483472371835865, "phrase": "basic_quantitative_preferences_formalism"}, {"score": 0.002538263784314365, "phrase": "qualitative_preference_formalism"}, {"score": 0.0023662411481713704, "phrase": "generalised_lexicographic_order"}, {"score": 0.002333258365963461, "phrase": "key_feature"}], "paper_keywords": [""], "paper_abstract": "A conversational recommender system iteratively shows a small set of options for its user to choose between. In order to select these options, the system may analyze the queries tried by the user to derive whether one option is dominated by others with respect to the user's preferences. The system can then suggest that the user try one of the undominated options, as they represent the best options in the light of the user preferences elicited so far. This paper describes a framework for preference dominance. Two instances of the framework are developed for query suggestion in a conversational recommender system. The first instance of the framework is based on a basic quantitative preferences formalism, where options are compared using sums of weights of their features. The second is a qualitative preference formalism, using a language that generalises CP-nets, where models are a kind of generalised lexicographic order. A key feature of both methods is that deductions of preference dominance can be made efficiently, since this procedure needs to be applied for many pairs of options. We show that, by allowing the recommender to focus on undominated options, which are ones that the user is likely to be contemplating, both approaches can dramatically reduce the amount of advice the recommender needs to give to a user compared to what would be given by systems without this kind of reasoning.", "paper_title": "PREFERENCE DOMINANCE REASONING FOR CONVERSATIONAL RECOMMENDER SYSTEMS: A COMPARISON BETWEEN A COMPARATIVE PREFERENCES AND A SUM OF WEIGHTS APPROACH", "paper_id": "WOS:000293513700002"}