{"auto_keywords": [{"score": 0.03130213614376333, "phrase": "pdes"}, {"score": 0.019819150527011768, "phrase": "high_selectivity"}, {"score": 0.00481495049065317, "phrase": "great_attention"}, {"score": 0.004720792132470776, "phrase": "clinical_significance"}, {"score": 0.0044199701363984495, "phrase": "erectile_dysfunction"}, {"score": 0.00433350214927936, "phrase": "side_effects"}, {"score": 0.004305055407631358, "phrase": "visual_functions"}, {"score": 0.004248718518635191, "phrase": "similar_potencies"}, {"score": 0.0038110933504990683, "phrase": "crystal_structure"}, {"score": 0.0035916263154651975, "phrase": "homology_modeling"}, {"score": 0.003463754811167655, "phrase": "molecular_docking"}, {"score": 0.0034409976875396596, "phrase": "molecular_dynamics"}, {"score": 0.0033514495661346524, "phrase": "free_energy_calculations"}, {"score": 0.0033184711049370425, "phrase": "present_work"}, {"score": 0.002908459938852868, "phrase": "binding_free_energy_results"}, {"score": 0.0028514769721161037, "phrase": "external_bioassay_studies"}, {"score": 0.0023471747824793015, "phrase": "continuous_puzzle"}, {"score": 0.0022560515732199062, "phrase": "visual_disorders"}, {"score": 0.002161313898853851, "phrase": "homology_model"}], "paper_keywords": [""], "paper_abstract": "Great attention has been paid to the clinical significance of phosphodiesterase 5 (PDE5) inhibitors, such as sildenafil, tadalafil, and vardenafil widely used for erectile dysfunction. However, sildenafil causes side effects on visual functions since it shows similar potencies to inhibit PDE5 and PDE6, whereas tadalafil gives a high selectivity of 1020-fold against PDE6. Till now, their molecular mechanisms of selectivity of PDE5 versus PDE6 have remained unknown in the absence of the crystal structure of PDE6. In order to elucidate its isoform-selective inhibitory mechanism, a 3D model of PDE6 was constructed by homology modeling, and its interaction patterns with tadalafil plus sildenafil were exploited by molecular docking, molecular dynamics (MD) simulations, and binding free energy calculations. The present work reveals that tadalafil exhibits a less negative predicted binding free energy of -35.21 kcal/mol with PDE6 compared with the value of -41.12 kcal/mol for PDE5, which suggests that tadalafil prefers PDE5 rather than PDE6 and confers a high selectivity for PDES versus PDE6. The binding free energy results for tadalafil were consistent with external bioassay studies (IC50 = 5100 and 5 nM toward PDE6 and PDES, respectively). Two important residues from the Q(2) pockets (Val782 and Leu804 in PDE5 and their corresponding Val738 and Met760 in PDE6) were further identified to account for the high selectivity of tadalafil for PDES versus PDE6. These findings have shed light on the continuous puzzle of why sildenafil (IC50 = 74 and 6 nM toward PDE6 and PDES, respectively) causes visual disorders because of its poor selectivity but tadalafil does not. In addition, the homology model of PDE6 can be used to design more potent and selective second-generation PDE5 inhibitors with less inhibitory potency against PDE6.", "paper_title": "The Molecular Basis for the Selectivity of Tadalafil toward Phosphodiesterase 5 and 6: A Modeling Study", "paper_id": "WOS:000327747200024"}