{"auto_keywords": [{"score": 0.04646244182734315, "phrase": "proposed_middleware"}, {"score": 0.04574099110284336, "phrase": "virtual_humans"}, {"score": 0.00481495049065317, "phrase": "behavioral_animation-based_virtual_worlds"}, {"score": 0.004768012159430855, "phrase": "multi-agent_architecture"}, {"score": 0.004645057834614705, "phrase": "distributed_middleware"}, {"score": 0.004540064673326908, "phrase": "deterministic_virtual_scenes"}, {"score": 0.004184010117063648, "phrase": "user_defined_goals"}, {"score": 0.004102780105064226, "phrase": "behavioral_animation"}, {"score": 0.003635444740897197, "phrase": "intelligent_algorithm"}, {"score": 0.0033173903774253856, "phrase": "virtual_human"}, {"score": 0.003295763459241421, "phrase": "main_components"}, {"score": 0.0030870755475461494, "phrase": "declarative_virtual_editor"}, {"score": 0.0030369955065974222, "phrase": "virtual_world"}, {"score": 0.002948883844627217, "phrase": "physic_laws"}, {"score": 0.0028821186265508597, "phrase": "language_declarative_language"}, {"score": 0.0028076592725295646, "phrase": "rendering_tool"}, {"score": 0.002708399936381754, "phrase": "agent's_control_module"}, {"score": 0.0026470650216161577, "phrase": "different_virtual_life_creatures"}, {"score": 0.0024391051991149663, "phrase": "scene_controller"}, {"score": 0.002307083221755957, "phrase": "natural_laws"}, {"score": 0.0022401007567642347, "phrase": "graphic_primitives"}, {"score": 0.002125776260994065, "phrase": "local_states"}, {"score": 0.0021049977753042253, "phrase": "actions_loops"}], "paper_keywords": [""], "paper_abstract": "In this article is proposed a distributed middleware useful to handle the evolution of deterministic virtual scenes in a 3D world. The proposed middleware allows interaction necessitated among virtual humans [1] and the environment. This interaction allows virtual humans to get user defined goals. As stated in the behavioral animation [3,4] paradigm, the user only tells characters \"what to do\" (goals) instead of \"how to do it\" (actions). Every virtual human computes dynamically by means of an intelligent algorithm, the actions to achieve its goal based on: a) its actual state; b) the stimuli perceived from the environment, and c) the personality of the virtual human. Main components of the proposed middleware is part of a more complex system we call GeDA-3D [5,6], this system includes a Declarative Virtual Editor useful to create the virtual world, an Context Descriptor used to define the physic laws ruling the environment, increment the language declarative language with definitions, concepts etc. A Rendering Tool useful to display the evolution of the scene, an Agent's Control module to control the agents managing the different virtual life creatures and all this is around a Geda-3D's kernel that provides all the stuff necessary to all these modules interact. Briefly the behavior of these middleware is: The scene controller receives the actions, validates them, handles the effect of the actions according to the natural laws of the world, resolves a set of graphic primitives to render and launches an event for every goal achieved. The cycle of sending local states and receiving actions loops until no goal is left to fulfill.", "paper_title": "GeDA-3D a middleware useful to handle the evolution in Behavioral Animation-based virtual worlds with a multi-agent architecture", "paper_id": "WOS:000237210900017"}