{"auto_keywords": [{"score": 0.04717487490094824, "phrase": "gaussian"}, {"score": 0.00481495049065317, "phrase": "k-user_interference_channel"}, {"score": 0.003621588555525458, "phrase": "capacity_region"}, {"score": 0.0035222812668916736, "phrase": "constant_gap"}, {"score": 0.003449585750738867, "phrase": "generalized_degrees"}, {"score": 0.0028078746437378756, "phrase": "tin"}, {"score": 0.002630085891013006, "phrase": "polyhedral_relaxation"}, {"score": 0.002575756583567029, "phrase": "gdof_region"}, {"score": 0.002419393934835993, "phrase": "dual_characterization"}, {"score": 0.0023694065215394593, "phrase": "polyhedral_region"}, {"score": 0.0022883734727569298, "phrase": "potential_functions"}, {"score": 0.0021049977753042253, "phrase": "desired_regime"}], "paper_keywords": ["Capacity region", " Gaussian interference channel", " generalized degrees of freedom (GDoF)", " treating interference as noise (TIN)"], "paper_abstract": "It is shown that in the K-user interference channel, if for each user the desired signal strength is no less than the sum of the strengths of the strongest interference from this user and the strongest interference to this user (all values in decibel scale), then the simple scheme of using point-to-point Gaussian codebooks with appropriate power levels at each transmitter and treating interference as noise (TIN) at every receiver (in short, TIN scheme) achieves all points in the capacity region to within a constant gap. The generalized degrees of freedom (GDoF) region under this condition is a polyhedron, which is shown to be fully achieved by the same scheme, without the need for time-sharing. The results are proved by first deriving a polyhedral relaxation of the GDoF region achieved by TIN, and then providing a dual characterization of this polyhedral region via the use of potential functions, and finally proving the optimality of this region in the desired regime.", "paper_title": "On the Optimality of Treating Interference as Noise", "paper_id": "WOS:000351470800016"}