{"auto_keywords": [{"score": 0.030296967498600766, "phrase": "trust_propensity"}, {"score": 0.029668259727588443, "phrase": "trust_formation"}, {"score": 0.004652016085325825, "phrase": "lower_cost"}, {"score": 0.0044560853139803, "phrase": "taiwan"}, {"score": 0.004305203085016233, "phrase": "online_stores"}, {"score": 0.004268293864953256, "phrase": "auction_websites"}, {"score": 0.0037188360359702182, "phrase": "future_development"}, {"score": 0.003471135453226184, "phrase": "key_success_factors"}, {"score": 0.003382547312072468, "phrase": "consumers'_purchasing_behavior"}, {"score": 0.0031845067058084613, "phrase": "research_model"}, {"score": 0.002668582249630492, "phrase": "positive_effects"}, {"score": 0.0025892330566358503, "phrase": "moderating_effect"}, {"score": 0.0024799423362011582, "phrase": "interpersonal_trust"}, {"score": 0.0023958326775913165, "phrase": "institutional_trust"}, {"score": 0.0022457226013538343, "phrase": "direct_and_moderating_effect"}, {"score": 0.0021049977753042253, "phrase": "direct_effect"}], "paper_keywords": ["Internet", " Interpersonal trust", " Institutional trust", " Trust propensity", " E-Commerce"], "paper_abstract": "The Internet makes communication easier at lower cost. It is estimated that 60% of people in Taiwan have purchased products through e-channels such as online stores or auction websites. Although the ratio again increased rapidly in 2008, 35% of consumers on average spent less than NT$1,000. How to attract other 40% has a very important role to play in the future development of e-commerce. Many believe that the trustworthiness of the website is one of the key success factors in terms of positively influencing consumers' purchasing behavior. In this study, we refer to the literature to propose a research model that consists of three independent variables, namely, institutional trust, trust propensity, and interpersonal trust, as well as the moderating effect of trust propensity on the relationship between trust formation and the other two independent variables. We find that these three variables have positive effects on trust formation in e-commerce. The moderating effect of trust propensity however is found to only exist between interpersonal trust and trust formation, but not between institutional trust and trust formation. Overall, the interpretation of the model which considers the direct and moderating effect of the variables is better than that of the model which only considers the direct effect of variables.", "paper_title": "Trust Formation in E-Commerce: The Moderating Effect of Trust Propensity", "paper_id": "WOS:000298061100007"}