{"auto_keywords": [{"score": 0.04071201963678792, "phrase": "biothesaurus"}, {"score": 0.00481495049065317, "phrase": "dictionary-based_protein"}, {"score": 0.004536592536813498, "phrase": "biological_literature"}, {"score": 0.004486212539464774, "phrase": "critical_step"}, {"score": 0.00445293569103488, "phrase": "biological_literature_mining"}, {"score": 0.004419904580451831, "phrase": "biological_named_entity_tagging"}, {"score": 0.0041642891310893, "phrase": "biological_databases"}, {"score": 0.004012061349250865, "phrase": "quantitative_assessment"}, {"score": 0.0039380388343479384, "phrase": "bnet"}, {"score": 0.0039088121438737924, "phrase": "protein_entities"}, {"score": 0.003779943062894615, "phrase": "uniprot_knowledgebase"}, {"score": 0.0036553070575015344, "phrase": "online_resources"}, {"score": 0.0027433143290371293, "phrase": "current_version"}, {"score": 0.002389696110283506, "phrase": "biocreative_data"}, {"score": 0.002363101338529545, "phrase": "medline_abstracts"}, {"score": 0.002193193339812606, "phrase": "multiple_names"}], "paper_keywords": [""], "paper_abstract": "Objective: Natural language processing (NLP) approaches have been explored to manage and mine information recorded in biological literature. A critical step for biological literature mining is biological named entity tagging (BNET) that identifies names mentioned in text and normalizes them with entries in biological databases. The aim of this study was to provide quantitative assessment of the complexity of BNET on protein entities through BioThesaurus, a thesaurus of gene/protein names for UniProt knowledgebase (UniProtKB) entries that was acquired using online resources. Methods: We evaluated the complexity through several perspectives: ambiguity (i.e., the number of genes/proteins represented by one name), synonymy (i.e., the number of names associated with the same gene/ protein), and coverage (i.e., the percentage of gene/protein names in text included in the thesaurus). We also normalized names in BioThesaurus and measures were obtained twice, once before normalization and once after. Results: The current version of BioThesaurus has over 2.6 million names or 2.1 million normalized names covering more than 1.8 million UniProtKB entries. The average synonymy is 3.53 (2.86 after normalization), ambiguity is 2.31 before normalization and 2.32 after, while the coverage is 94.0% based on the BioCreAtive data set comprising MEDLINE abstracts containing genes/proteins. Conclusion: The study indicated that names for genes/proteins are highly ambiguous and there are usually multiple names for the same gene or protein. It also demonstrated that most gene/protein names appearing in text can be found in BioThesaurus.", "paper_title": "Quantitative assessment of dictionary-based protein named entity tagging", "paper_id": "WOS:000240607400006"}