{"auto_keywords": [{"score": 0.04957466661795797, "phrase": "non-uniform_illumination_images"}, {"score": 0.010391207622785536, "phrase": "image_enhancement"}, {"score": 0.00481495049065317, "phrase": "naturalness_preserved_enhancement_algorithm"}, {"score": 0.004639712384096822, "phrase": "important_role"}, {"score": 0.004590820632326585, "phrase": "image_processing"}, {"score": 0.0044237033788643715, "phrase": "retinex-based_algorithms"}, {"score": 0.004151188559520802, "phrase": "retinex-based_algorithms_regard_illumination_removal"}, {"score": 0.0034849681064606543, "phrase": "pleasing_perceptual_quality"}, {"score": 0.0032355864829403413, "phrase": "enhancement_algorithm"}, {"score": 0.0029565620771207003, "phrase": "lightness-order-error_measure"}, {"score": 0.002879158342988017, "phrase": "naturalness_preservation"}, {"score": 0.0027889366191837504, "phrase": "bright-pass_filter"}, {"score": 0.002365815362517737, "phrase": "bi-log_transformation"}, {"score": 0.0021501863832966966, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_algorithm"}], "paper_keywords": ["Bi-log transformation", " bright-pass filter", " image enhancement", " lightness-order-error measure", " naturalness"], "paper_abstract": "Image enhancement plays an important role in image processing and analysis. Among various enhancement algorithms, Retinex-based algorithms can efficiently enhance details and have been widely adopted. Since Retinex-based algorithms regard illumination removal as a default preference and fail to limit the range of reflectance, the naturalness of non-uniform illumination images cannot be effectively preserved. However, naturalness is essential for image enhancement to achieve pleasing perceptual quality. In order to preserve naturalness while enhancing details, we propose an enhancement algorithm for non-uniform illumination images. In general, this paper makes the following three major contributions. First, a lightness-order-error measure is proposed to access naturalness preservation objectively. Second, a bright-pass filter is proposed to decompose an image into reflectance and illumination, which, respectively, determine the details and the naturalness of the image. Third, we propose a bi-log transformation, which is utilized to map the illumination to make a balance between details and naturalness. Experimental results demonstrate that the proposed algorithm can not only enhance the details but also preserve the naturalness for non-uniform illumination images.", "paper_title": "Naturalness Preserved Enhancement Algorithm for Non-Uniform Illumination Images", "paper_id": "WOS:000324382700009"}