{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "customer_requirement-based_reference_design_retrieval"}, {"score": 0.004684157900507474, "phrase": "knowledge-intensive_process"}, {"score": 0.004598933498016774, "phrase": "conceptual_design"}, {"score": 0.004556901872357751, "phrase": "detailed_design"}, {"score": 0.004515252649226697, "phrase": "engineering_analysis"}, {"score": 0.004473982381245469, "phrase": "assembly_design"}, {"score": 0.00443308765153716, "phrase": "process_design"}, {"score": 0.004372442291178139, "phrase": "performance_evaluation"}, {"score": 0.003916098498242888, "phrase": "product_development_capability"}, {"score": 0.0036721416244816455, "phrase": "development_cycle"}, {"score": 0.0035072146967082083, "phrase": "engineering_knowledge"}, {"score": 0.0033961782274326948, "phrase": "engineering_knowledge_management"}, {"score": 0.0031845067058084583, "phrase": "easy_access"}, {"score": 0.0031553611552558986, "phrase": "relevant_design"}, {"score": 0.003126481516783286, "phrase": "associated_knowledge"}, {"score": 0.002931569771634119, "phrase": "customer_requirement-based_reference_design_retrieval_process"}, {"score": 0.002673957615079041, "phrase": "customer_requirement-based_reference_design_retrieval_mechanism"}, {"score": 0.0025655216052760093, "phrase": "customer_requirement-based_query"}, {"score": 0.0021049977753042253, "phrase": "designed_entities"}], "paper_keywords": ["knowledge retrieval", " knowledge management", " engineering design"], "paper_abstract": "Engineering design is a knowledge-intensive process, and includes conceptual design, detailed design, engineering analysis, assembly design, process design, and performance evaluation. Each task involves various aspects of knowledge and experience. Whether this knowledge and experience can be effectively shared is key to increasing product development capability and quality, and also to reducing the duration and cost of the development cycle. Therefore, offering engineering designers various query methods for retrieving engineering knowledge is one of the most important tasks in engineering knowledge management. The study develops a technology for customer requirement-based reference design retrieval to provide engineering designers with easy access to relevant design and associated knowledge. The tasks involved in this research include (i) designing a customer requirement-based reference design retrieval process, (ii) developing techniques related to the technology for customer requirement-based reference design retrieval, and (iii) implementing a customer requirement-based reference design retrieval mechanism. The retrieval process comprises the steps of customer requirement-based query, case searching and matching, and case ranking. The technology involves (1) a structured query model for customer requirement, (2) an index structure for historical design cases, (3) customer requirement-based case searching and matching mechanisms, (4) a customer requirement-based case ranking mechanism, and (5) a case-based representation of designed entities. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Development of technology for customer requirement-based reference design retrieval", "paper_id": "WOS:000233285700004"}