{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "consistent_cohort_discovery"}, {"score": 0.004779564521350969, "phrase": "financial_analyses"}, {"score": 0.004310501708408856, "phrase": "healthcare_system"}, {"score": 0.0040334640350288, "phrase": "diagnosis-related_queries"}, {"score": 0.003959706549088536, "phrase": "coding_schemes"}, {"score": 0.0039016690475620185, "phrase": "healthcare_administrators"}, {"score": 0.0037325918533747953, "phrase": "dually-coded_datasets"}, {"score": 0.003531474887552889, "phrase": "convoluted_representations"}, {"score": 0.0028928306994090453, "phrase": "external_causes"}, {"score": 0.002777595758483679, "phrase": "greatest_challenges"}, {"score": 0.0025796799784169196, "phrase": "web_portal_tool"}, {"score": 0.0025606791601860543, "phrase": "translation_tables"}, {"score": 0.0024860616730750158, "phrase": "specific_input"}, {"score": 0.0021049977753042253, "phrase": "ambiguous_and_complex_translations"}], "paper_keywords": ["ICD-10-CM", " medical informatics", " network patterns", " patient cohort", " financial analyses", " ICD-9-CM"], "paper_abstract": "In the United States, International Classification of Disease Clinical Modification (ICD-9-CM, the ninth revision) diagnosis codes are commonly used to identify patient cohorts and to conduct financial analyses related to disease. In October 2015, the healthcare system of the United States will transition to ICD-10-CM (the tenth revision) diagnosis codes. One challenge posed to clinical researchers and other analysts is conducting diagnosis-related queries across datasets containing both coding schemes. Further, healthcare administrators will manage growth, trends, and strategic planning with these dually-coded datasets. The majority of the ICD-9-CM to ICD-10-CM translations are complex and nonreciprocal, creating convoluted representations and meanings. Similarly, mapping back from ICD-10-CM to ICD-9-CM is equally complex, yet different from mapping forward, as relationships are likewise nonreciprocal. Indeed, 10 of the 21 top clinical categories are complex as 78% of their diagnosis codes are labeled as \"convoluted\" by our analyses. Analysis and research related to external causes of morbidity, injury, and poisoning will face the greatest challenges due to 41 745 (90%) convolutions and a decrease in the number of codes. We created a web portal tool and translation tables to list all ICD-9-CM diagnosis codes related to the specific input of ICD-10-CM diagnosis codes and their level of complexity: \"identity\" (reciprocal), \"class-to-subclass,\" \"subclass-to-class,\" \"convoluted, \"or\" no mapping.\" These tools provide guidance on ambiguous and complex translations to reveal where reports or analyses may be challenging to impossible.", "paper_title": "Metrics and tools for consistent cohort discovery and financial analyses post-transition to ICD-10-CM", "paper_id": "WOS:000356717100027"}