{"auto_keywords": [{"score": 0.0493187379183741, "phrase": "solver_brokerages"}, {"score": 0.00481495049065317, "phrase": "sustainable_crowdsourcing"}, {"score": 0.0046781613377273774, "phrase": "open_innovation"}, {"score": 0.004618614357974438, "phrase": "intellectual_property"}, {"score": 0.004589254929995361, "phrase": "ip"}, {"score": 0.004473027089024405, "phrase": "existing_hierarchical_or_market_relationships"}, {"score": 0.004235938758522453, "phrase": "prior_relationship"}, {"score": 0.004089239912167375, "phrase": "innovation_exchange"}, {"score": 0.003872414709826833, "phrase": "innovation_intermediary"}, {"score": 0.003750260412839128, "phrase": "innovation_exchanges"}, {"score": 0.0037024804835018373, "phrase": "unknown_external_firms"}, {"score": 0.0035627492415494216, "phrase": "commercial_success"}, {"score": 0.003298856341173034, "phrase": "crowdsourcing_processes"}, {"score": 0.003215295260684715, "phrase": "extant_research"}, {"score": 0.003194736764837261, "phrase": "innovation_networks"}, {"score": 0.0028923335491735564, "phrase": "field_study"}, {"score": 0.002527654365712841, "phrase": "knowledge_mobility"}, {"score": 0.002416589459425828, "phrase": "solver_brokerage"}, {"score": 0.0023252743521788876, "phrase": "innovation_providers"}, {"score": 0.002280916026414715, "phrase": "broker-provided_value-added_'orchestration'_services"}, {"score": 0.0021876814398268775, "phrase": "'unsuccessful'_innovation_seekers"}, {"score": 0.002166711569953301, "phrase": "appropriate_sufficient_value"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Open innovation", " Crowdsourcing", " Interorganisational systems", " Knowledge mobility", " Appropriability", " Stability"], "paper_abstract": "Exemplars of open innovation have revealed that intellectual property (IP) need not only be sourced through existing hierarchical or market relationships. Rather IP can be acquired from individuals and firms with whom an organization has no prior relationship. In such cases, an intermediary, operating as an innovation exchange or brokerage, frequently facilitates the development and acquisition of IP. This paper examines one type of innovation intermediary, the 'Solver Brokerage,' which enables innovation exchanges between organizations and unknown external firms and individuals (i.e. a crowdsourcing process). While the commercial success of Solver Brokerages indicates the potency of arguments concerning the potential of crowdsourcing, little is known about the operation of such brokerages or the crowdsourcing processes that they enable. This paper examines extant research on innovation networks, crowdsourcing, and electronic marketplaces to identify three processes (knowledge mobility, appropriability and stability) that we argue are necessary to 'orchestrate' crowdsourcing. Using a field study of four Solver Brokerages, an innovation seeking organization, as well as 15 innovation providers (i.e. members of the 'crowd'), the paper illustrates the ways in which the three orchestration processes are enhanced in Solver Brokerages. It reveals that while knowledge mobility and appropriability processes can be enhanced by activities under the control of the Solver Brokerage, stability is largely determined by innovation seeking organizations and the innovation providers. The paper concludes that broker-provided value-added 'orchestration' services need to enable knowledge mobility and appropriability, and to ensure that 'unsuccessful' innovation seekers and providers appropriate sufficient value to participate again. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "'Orchestrating' sustainable crowdsourcing: A characterisation of solver brokerages", "paper_id": "WOS:000310105100005"}