{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "original_face_image"}, {"score": 0.01947823281995979, "phrase": "mirror_image"}, {"score": 0.010420432572757203, "phrase": "face_recognition"}, {"score": 0.008759994247123181, "phrase": "face_image"}, {"score": 0.004556901872357751, "phrase": "axis-symmetrical_structure"}, {"score": 0.003757480190200645, "phrase": "possible_pose"}, {"score": 0.0032886455096627324, "phrase": "representation-based_face_recognition"}, {"score": 0.003140888248194296, "phrase": "almost_all_the_representation-based_classification_methods"}, {"score": 0.0030135741897058844, "phrase": "underlying_rationales"}, {"score": 0.0027614468443073028, "phrase": "misalignment_problem"}, {"score": 0.002361632539339945, "phrase": "proposed_scheme"}, {"score": 0.002276283303864666, "phrase": "representation-based_classification_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Pattern recognition", " Biometrics", " Face recognition", " Mirror image", " Sparse representation"], "paper_abstract": "The face almost always has an axis-symmetrical structure. However, as the face usually does not have an absolutely frontal pose when it is imaged, the majority of face images are not symmetrical images. These facts inspire us that the mirror image of the face image might be viewed as a representation of the face with a possible pose opposite to that of the original face image. In this paper we propose a scheme to produce the mirror image of the face and integrate the original face image and its mirror image for representation-based face recognition. This scheme is simple and computationally efficient. Almost all the representation-based classification methods can be improved by this scheme. The underlying rationales of the scheme are as follows: first, the use of the mirror image can somewhat overcome the misalignment problem of the face image in face recognition. Second, it is able to somewhat eliminate the side-effect of the variation of the pose and illumination of the original face image. The experiments show that the proposed scheme can greatly improve the accuracy of the representation-based classification methods. The proposed scheme might be also helpful for improving other face recognition methods. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Integrate the original face image and its mirror image for face recognition", "paper_id": "WOS:000332805700021"}