{"auto_keywords": [{"score": 0.049465088868450476, "phrase": "power_management"}, {"score": 0.048658242994016845, "phrase": "ad_hoc_networks"}, {"score": 0.04353040808935283, "phrase": "power_consumption"}, {"score": 0.004817085729836053, "phrase": "lifetime"}, {"score": 0.004773692073488661, "phrase": "ad_hoc_networks_using_hierarchical_cluster-based"}, {"score": 0.004612147352416241, "phrase": "limited_battery_capacity"}, {"score": 0.004513957235071457, "phrase": "portable_devices"}, {"score": 0.004106063237069123, "phrase": "important_issue"}, {"score": 0.003967021436047945, "phrase": "wireless_technology"}, {"score": 0.003933000051147382, "phrase": "mobile_devices"}, {"score": 0.003686935223424015, "phrase": "real-time_streaming"}, {"score": 0.002691715708265637, "phrase": "cpm"}, {"score": 0.002624925853588578, "phrase": "time"}, {"score": 0.00255595347074366, "phrase": "ttl"}, {"score": 0.0025230952890994236, "phrase": "mobile_hosts"}, {"score": 0.0022168460543913787, "phrase": "proposed_scheme"}, {"score": 0.0021049977753042253, "phrase": "total_ttls"}], "paper_keywords": ["Ad Hoc networks", " cluster", " power management", " P2P", " real-time streaming"], "paper_abstract": "One inevitable problem in Ad Hoc networks is the limited battery capacity, which explains why portable devices might shut down suddenly when the power of hardware is depleted. Hence, how to decrease the power consumption is an important issue in ad hoc networks. With the development of wireless technology, mobile devices can transmit voices, surf the Internet, download entertaining stuffs, and even support some P2P applications, like sharing real-time streaming. In order to keep the quality stable, the transmission must be continuous and it is thus necessary to select some managers to coordinate all nodes in a P2P community. In addition to assigning jobs to the staffs (children) when needed, these managers (ancestors) are able to reappoint jobs in advance when employees retire. This paper proposed a mechanism called Cluster-based Power Management (CPM) to stabilize the transmissions and increase Time to Live (TTL) of mobile hosts. In our new proposed method, we establish the clusters according to every node's joining order and capability, and adjust their sleep time dynamically through three different mathematical models. Our simulation results reveal that this proposed scheme not only reduces the power consumption efficiently, but also increases the total TTLs evidently.", "paper_title": "Increasing the Lifetime of Ad Hoc Networks Using Hierarchical Cluster-based Power Management", "paper_id": "WOS:000288500600001"}