{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "\"off-the-shelf\"_tools"}, {"score": 0.004688823162073856, "phrase": "intensive_care"}, {"score": 0.003893406207928709, "phrase": "commercial_products"}, {"score": 0.0038676325043529524, "phrase": "even_turnkey_systems"}, {"score": 0.00361906209437624, "phrase": "additional_expense"}, {"score": 0.003547642961654828, "phrase": "commercial_software"}, {"score": 0.003477628306017313, "phrase": "custom_software"}, {"score": 0.0034545974376846687, "phrase": "hardware_systems"}, {"score": 0.0034203358208034973, "phrase": "associated_investment"}, {"score": 0.003286642683771891, "phrase": "computer_system"}, {"score": 0.003264872488939969, "phrase": "long-term_large-scale_recording"}, {"score": 0.0031476805104529377, "phrase": "commercial_solutions"}, {"score": 0.003075296862372287, "phrase": "existing_hospital_it_infrastructure"}, {"score": 0.0028394925080958205, "phrase": "file-based_vital_sign_data_bank"}, {"score": 0.0027649684074145028, "phrase": "total_db_size"}, {"score": 0.0026923949531431667, "phrase": "vital_signs"}, {"score": 0.002613043160857883, "phrase": "ecg"}, {"score": 0.002527556628744957, "phrase": "monitored_numeric_data"}, {"score": 0.0021474369836979048, "phrase": "physiologic_signals"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Data acquisition", " Databasing", " Database", " Databank", " Physiological monitoring", " Physiologic signals", " Waveforms", " Vital signs", " Intensive care"], "paper_abstract": "Until now, the creation of massive (long-term and multichannel) waveform databases in intensive care required an interdisciplinary team of clinicians, engineers and informaticians and, in most cases, also design-specific software and hardware development. Recently, several commercial software tools for waveform acquisition became available. Although commercial products and even turnkey systems are now being marketed as simple and effective, the performance of those solutions is not known. The additional expense upfront may be worthwhile if commercial software can eliminate the need for custom software and hardware systems and the associated investment in teams and development. We report the development of a computer system for long-term large-scale recording and storage of multichannel physiologic signals that was built using commercial solutions (software and hardware) and existing hospital IT infrastructure. Both numeric (1 Hz) and waveform (62.5-500 Hz) data were captured from 24 SICU bedside monitors simultaneously and stored in a file-based vital sign data bank (VSDB) during one-year period (total DB size is 4.21 TB). In total, vital signs were recorded from 1175 critically ill patients. Up to six ECG leads, all other monitored waveforms, and all monitored numeric data were recorded in most of the cases. We describe the details of building blocks of our system, provide description of three datasets exported from our VSDB and compare the contents of our VSDB with other available waveform databases. Finally, we summarize lessons learned during recording, storage, and pre-processing of physiologic signals. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Using \"off-the-shelf\" tools for terabyte-scale waveform recording in intensive care: Computer system design, database description and lessons learned", "paper_id": "WOS:000293995200005"}