{"auto_keywords": [{"score": 0.03644451033122436, "phrase": "smartphone_applications"}, {"score": 0.035594013179046376, "phrase": "external_devices"}, {"score": 0.03204003536468291, "phrase": "remote_lock_system"}, {"score": 0.00481495049065317, "phrase": "bluetooth_remote_lock_system"}, {"score": 0.004698985440736935, "phrase": "mobile_devices"}, {"score": 0.004635765943321778, "phrase": "wireless_technologies"}, {"score": 0.00442708558833968, "phrase": "regular_change"}, {"score": 0.004367508141547766, "phrase": "state-of-the-art_computing_devices"}, {"score": 0.004070337076924151, "phrase": "pervasive_computing"}, {"score": 0.0037830375312466608, "phrase": "ordinary_internal_processes"}, {"score": 0.0037219886365287085, "phrase": "phone_calls"}, {"score": 0.0036918332580584768, "phrase": "text_messages"}, {"score": 0.003652004401697793, "phrase": "mobile_banking"}, {"score": 0.003267648184498275, "phrase": "even_cars"}, {"score": 0.003171573259648412, "phrase": "evolving_technological_possibilities"}, {"score": 0.0030122115889639626, "phrase": "wireless_communication"}, {"score": 0.0029077996390372996, "phrase": "lock_system"}, {"score": 0.002845347968246455, "phrase": "dedicated_android_application"}, {"score": 0.002791824625495338, "phrase": "bluetooth"}, {"score": 0.0026804172569808854, "phrase": "existing_bluetooth_function"}, {"score": 0.0026659048913727106, "phrase": "android_smartphones"}, {"score": 0.002608634873428449, "phrase": "users'_lock_information"}, {"score": 0.0025595311522722936, "phrase": "real_time"}, {"score": 0.0024640724199520877, "phrase": "server_manager"}, {"score": 0.0023148964315569866, "phrase": "user_manual"}, {"score": 0.0022104586816588294, "phrase": "management_functions"}, {"score": 0.002139581380750111, "phrase": "user's_own_locks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Remote lock system", " Bluetooth", " Mobile device", " Wireless communication", " Pervasive computing"], "paper_abstract": "With the advent of mobile devices and the convergence of wireless technologies and the Internet, both the content and the quality of research in this field are subject to regular change. A variety of state-of-the-art computing devices that are compatible with each other have been produced. These devices have the ability to interact with people. This is also known as pervasive computing. Particularly, as smartphones have recently become one of the most popular devices worldwide, various convenient applications are being released. Smartphones available today not only provide the ordinary internal processes such as dialing or receiving phone calls, sending text messages, and doing mobile banking, but also increasingly control various other devices that are part of our daily lives. In effect, this means that through smartphone applications, we can remotely control a variety of external devices such as televisions, projectors for presentations, computers, and even cars. The research in this paper is based on the evolving technological possibilities of using smartphone applications to control external devices. This paper presents the design and implementation of a remote lock system using wireless communication on a smartphone. In this context, remote lock system refers to a lock system that can be controlled remotely by a dedicated Android application. Every smartphone is equipped with Bluetooth which makes this technology possible. The application proposed in this paper uses the existing Bluetooth function on Android smartphones to open and manage locks. The users' lock information can be stored and managed in real time in the database via a server that is built and managed by a server manager. Even if users forget the password of the lock, our proposed lock system can guide them to retrieve it easily, and a user manual is included to help users navigate the system. This system also provides a variety of management functions such as adding, deleting, modifying, and purchasing the user's own locks. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Utilizing a Bluetooth remote lock system for a smartphone", "paper_id": "WOS:000365335400013"}