{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "built-in_kinematic_sensors"}, {"score": 0.004697308822154191, "phrase": "physical_activity"}, {"score": 0.004448471107649881, "phrase": "public_healthcare"}, {"score": 0.004382913938427474, "phrase": "body-worn_sensors"}, {"score": 0.004212759658511567, "phrase": "activity_patterns"}, {"score": 0.004171259063201874, "phrase": "long_periods"}, {"score": 0.003989487818395848, "phrase": "special_microsensors"}, {"score": 0.002993231973906559, "phrase": "different_pa."}, {"score": 0.0029344771385297137, "phrase": "combined_algorithm"}, {"score": 0.0029055323737809825, "phrase": "fisher's_discriminant_ratio_criterion"}, {"score": 0.0028203950416405563, "phrase": "feature_selection"}, {"score": 0.0027787638791664663, "phrase": "hierarchical_classifiers_system"}, {"score": 0.0027513507830537165, "phrase": "fourteen_classifiers"}, {"score": 0.002657511557782469, "phrase": "fifteen_activities"}, {"score": 0.002618278365749875, "phrase": "optimal_features"}, {"score": 0.0023476849595393872, "phrase": "pa_recognition"}, {"score": 0.0021902063413831545, "phrase": "body_posture"}, {"score": 0.0021049977753042253, "phrase": "total_classification_accuracy"}], "paper_keywords": [""], "paper_abstract": "Physical activity (PA) recognition has recently become important in activity monitoring for the public healthcare. Although body-worn sensors are well suited to collect data on activity patterns for long periods of time, users may forget to wear special microsensors. On the contrary, more and more people take smartphone with them almost anytime. At present, most popular smartphones have three built-in kinematic sensors (triaccelerometer, gyroscope, and magnetic sensor) which could be utilized to recognize PA. This study utilized three built-in kinematic sensors in a smartphone to recognize PA and found out which features derived from the three sensors were significant to different PA. We used a combined algorithm of Fisher's discriminant ratio criterion and J(3) criterion for feature selection. A hierarchical classifiers system including fourteen classifiers was proposed and employed to recognize fifteen activities. The optimal features derived from the built-in kinematic sensors of the smartphone were selected from 140 features. The results indicated that the accelerometer was significant to PA recognition, while gyroscope and orientation sensor were effective to recognize the change of body posture and detect falls, respectively. The total classification accuracy of 95.03% demonstrated the feasibility of utilizing the built-in kinematic sensors of the smartphone to recognize PA.", "paper_title": "Physical Activity Recognition Utilizing the Built-In Kinematic Sensors of a Smartphone", "paper_id": "WOS:000317771700001"}