{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "stabilizer_zx-calculus"}, {"score": 0.004556901872357751, "phrase": "graphical_language"}, {"score": 0.004501453956464956, "phrase": "quantum_processes"}, {"score": 0.004446677711302801, "phrase": "built-in_rewrite_rules"}, {"score": 0.003459191419478298, "phrase": "scalar-free_pure_qubit_stabilizer_quantum_mechanics"}, {"score": 0.0031942814007173254, "phrase": "non-zero_scalar_factor"}, {"score": 0.0030789331635764122, "phrase": "graphical_rewrite_rules"}, {"score": 0.002949598537993663, "phrase": "scalar-free_rewrite_rules"}, {"score": 0.0027069560455629917, "phrase": "new_rewrite_rule"}, {"score": 0.0025615908073796027, "phrase": "pure_qubit_stabilizer_quantum_mechanics"}, {"score": 0.0024842242921857705, "phrase": "completeness_property"}, {"score": 0.00226583335721762, "phrase": "stabilizer_zero_diagrams"}, {"score": 0.0021705796895687864, "phrase": "zero_matrix"}], "paper_keywords": [""], "paper_abstract": "The ZX-calculus is a graphical language for quantum processes with built-in rewrite rules. The rewrite rules allow equalities to be derived entirely graphically, leading to the question of completeness: can any equality that is derivable using matrices also be derived graphically? The ZX-calculus is known to be complete for scalar-free pure qubit stabilizer quantum mechanics, meaning any equality between two pure stabilizer operators that is true up to a non-zero scalar factor can be derived using the graphical rewrite rules. Here, we replace those scalar-free rewrite rules with correctly scaled ones and show that, by adding one new diagram element and a new rewrite rule, the calculus can be made complete for pure qubit stabilizer quantum mechanics with scalars. This completeness property allows amplitudes and probabilities to be calculated entirely graphically. We also explicitly consider stabilizer zero diagrams, i.e. diagrams that represent a zero matrix, and show that two new rewrite rules suffice to make the calculus complete for those.", "paper_title": "Making the stabilizer ZX-calculus complete for scalars", "paper_id": "WOS:000367346600003"}