{"auto_keywords": [{"score": 0.04837235315601027, "phrase": "spl"}, {"score": 0.00481495049065317, "phrase": "stochastic_point_location_problem"}, {"score": 0.0047881480263782675, "phrase": "metalevel_nonstationary_environments"}, {"score": 0.00470862827326028, "phrase": "first_known_solution"}, {"score": 0.004669362683840143, "phrase": "stochastic_point_location"}, {"score": 0.004515532787428149, "phrase": "spl_problem"}, {"score": 0.004477870190590885, "phrase": "general_learning_problem"}, {"score": 0.004428139418750855, "phrase": "learning_mechanism"}, {"score": 0.004318246489874451, "phrase": "learning_automaton"}, {"score": 0.004027031316965272, "phrase": "closed_interval"}, {"score": 0.003776424440919605, "phrase": "nonstationary_setting"}, {"score": 0.0035811651542886746, "phrase": "probability_p"}, {"score": 0.0034727526607880883, "phrase": "unknown_point"}, {"score": 0.003348838095597268, "phrase": "fascinating_case"}, {"score": 0.0031403029065308766, "phrase": "intermediate_entity"}, {"score": 0.002722930209707764, "phrase": "overall_setting"}, {"score": 0.0026626797255348287, "phrase": "possibly_incorrect_information"}, {"score": 0.002282945386810049, "phrase": "controlled_random_walk"}, {"score": 0.0022261705957258506, "phrase": "analytic_results"}, {"score": 0.002176887956041267, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "potential_applications"}], "paper_keywords": ["learning automata (LA)", " nonstationary stochastic point location (NS-SPL) problem", " nonstationary stochastic teacher", " stochastic point location (SPL) problem", " teachers and students"], "paper_abstract": "This paper reports the first known solution to the stochastic point location (SPL) problem when the environment is nonstationary. The SPL problem involves a general learning problem in which the learning mechanism (which could be a robot, a learning automaton, or, in general, an algorithm) attempts to learn a \"parameter,\" for example, lambda*, within a closed interval. However, unlike the earlier reported results, we consider the scenario when the learning is to be done in a nonstationary setting. For each guess, the environment essentially informs the mechanism, possibly erroneously (i.e., with probability p), which way it should move to reach the unknown point. Unlike the results available in the literature, we consider the fascinating case when the point sought for is itself stochastically moving (which is modeled as follows). The environment communicates with an intermediate entity (referred to as the teacher/oracle) about the point itself, i.e., advising where it should go. The mechanism that searches for the point in turn receives responses from the teacher/oracle, which directs how it should move. Therefore, the point itself, in the overall setting, is moving, i.e., delivering possibly incorrect information about its location to the teacher/oracle. This in turn means that the \"environment\" is itself nonstationary, which implies that the advice of the teacher/oracle is both uncertain and changing with time-rendering the problem extremely fascinating. The heart of the strategy we propose involves discretizing the space and performing a controlled random walk on this space. Apart from deriving some analytic results about our solution, we also report the simulation results that demonstrate the power of the scheme, and state some potential applications.", "paper_title": "A solution to the stochastic point location problem in metalevel nonstationary environments", "paper_id": "WOS:000254029400016"}