{"auto_keywords": [{"score": 0.03719514310310038, "phrase": "tableprog"}, {"score": 0.01191330136271885, "phrase": "example_input"}, {"score": 0.008364967940527122, "phrase": "progfromex"}, {"score": 0.00481495049065317, "phrase": "computer_end-users"}, {"score": 0.0046437283535486545, "phrase": "programming_knowledge"}, {"score": 0.0044491728131708505, "phrase": "automatic_technique"}, {"score": 0.00384894851099016, "phrase": "programs_tableprog"}, {"score": 0.0037736090925144807, "phrase": "real_users"}, {"score": 0.003687568028560351, "phrase": "algorithm_progfromex"}, {"score": 0.0036153760112398485, "phrase": "output_table"}, {"score": 0.0032858160838749196, "phrase": "example_output"}, {"score": 0.003116989767430614, "phrase": "\"similar\"_layout"}, {"score": 0.003086311260099341, "phrase": "example_input_table"}, {"score": 0.003015893651662638, "phrase": "corresponding_table"}, {"score": 0.002927705457700311, "phrase": "example_output_table"}, {"score": 0.002832731124016696, "phrase": "multiple_small_examples"}, {"score": 0.002651901053070293, "phrase": "\"noisy\"_examples"}, {"score": 0.0024662589776071864, "phrase": "microsoft_excel_spreadsheet_program"}, {"score": 0.002339442939538852, "phrase": "online_excel_help_forums"}, {"score": 0.0022118223311537954, "phrase": "larger_input_tables"}, {"score": 0.0021049977753042253, "phrase": "tabular_data"}], "paper_keywords": ["Languages", " Algorithms", " Human Factors", " Program Synthesis", " End-user Programming", " Programming by Example", " Spreadsheet Programming", " Table Manipulation", " User Intent"], "paper_abstract": "Every day, millions of computer end-users need to perform tasks over large, tabular data, yet lack the programming knowledge to do such tasks automatically. In this work, we present an automatic technique that takes from a user an example of how the user needs to transform a table of data, and provides to the user a program that implements the transformation described by the example. In particular, we present a language of programs TableProg that can describe transformations that real users require. We then present an algorithm ProgFromEx that takes an example input and output table, and infers a program in TableProg that implements the transformation described by the example. When the program is applied to the example input, it reproduces the example output. When the program is applied to another, potentially larger, table with a \"similar\" layout as the example input table, then the program produces a corresponding table with a layout that is similar to the example output table. A user can apply ProgFromEx interactively, providing multiple small examples to obtain a program that implements the transformation that the user desires. Moreover, ProgFromEx can help identify \"noisy\" examples that contain errors. To evaluate the practicality of TableProg and ProgFromEx, we implemented ProgFromEx as a module for the Microsoft Excel spreadsheet program. We applied the module to automatically implement over 50 table transformations specified by end-users through examples on online Excel help forums. In seconds, ProgFromEx found programs that satisfied the examples and could be applied to larger input tables. This experience demonstrates that TableProg and ProgFromEx can significantly automate the tasks over tabular data that users need to perform.", "paper_title": "Spreadsheet Table Transformations from Examples", "paper_id": "WOS:000294609500028"}