{"auto_keywords": [{"score": 0.04212755136497283, "phrase": "off-line_phase"}, {"score": 0.0390554772284772, "phrase": "uncertain_processing_time"}, {"score": 0.034021124392426265, "phrase": "dominant_schedules"}, {"score": 0.010255849244084618, "phrase": "sufficient_conditions"}, {"score": 0.010196678115577885, "phrase": "schedule_domination"}, {"score": 0.009055492281489746, "phrase": "feasible_realizations"}, {"score": 0.008977141674551508, "phrase": "uncertain_processing_times"}, {"score": 0.00481495049065317, "phrase": "two-machine_flow-shop"}, {"score": 0.00478701880312723, "phrase": "interval_processing_times"}, {"score": 0.004569293780076254, "phrase": "two-phase_scheduling_decision_framework"}, {"score": 0.00451642066363115, "phrase": "two-machine_flow-shop_scheduling_problem"}, {"score": 0.004199490556726464, "phrase": "scheduling_objective"}, {"score": 0.004055329874540865, "phrase": "scheduling_process"}, {"score": 0.003916098498242888, "phrase": "on-line_phase"}, {"score": 0.0035989687070420977, "phrase": "local_information"}, {"score": 0.003435092524339692, "phrase": "corresponding_operation"}, {"score": 0.0032406665327678616, "phrase": "minimal_set"}, {"score": 0.0029435555176530732, "phrase": "on-line_scheduling_decision"}, {"score": 0.0026119782818898193, "phrase": "dominant_set"}, {"score": 0.0023792975669318615, "phrase": "randomly_generated_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Flow-shop", " Makespan", " Uncertainty", " Dominant schedule"], "paper_abstract": "This paper addresses the issue of how to best execute the schedule in a two-phase scheduling decision framework by considering a two-machine flow-shop scheduling problem in which each uncertain processing time of a job on a machine may take any value between a lower and upper bound. The scheduling objective is to minimize the makespan. There are two phases in the scheduling process: the off-line phase (the schedule planning phase) and the on-line phase (the schedule execution phase). The information of the lower and upper bound for each uncertain processing time is available at the beginning of the off-line phase while the local information on the realization (the actual value) of each uncertain processing time is available once the corresponding operation (of a job on a machine) is completed. In the off-line phase, a scheduler prepares a minimal set of dominant schedules, which is derived based on a set of sufficient conditions for schedule domination that we develop in this paper. This set of dominant schedules enables a scheduler to quickly make an on-line scheduling decision whenever additional local information on realization of an uncertain processing time is available. This set of dominant schedules can also optimally cover all feasible realizations of the uncertain processing times in the sense that for any feasible realizations of the uncertain processing times there exists at least one schedule in this dominant set which is optimal. Our approach enables a scheduler to best execute a schedule and may end up with executing the schedule optimally in many instances according to our extensive computational experiments which are based on randomly generated data up to 1000 jobs. The algorithm for testing the set of sufficient conditions of schedule domination is not only theoretically appealing (i.e., polynomial in the number of jobs) but also empirically fast, as our extensive computational experiments indicate. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Schedule execution for two-machine flow-shop with interval processing times", "paper_id": "WOS:000263151100014"}