{"auto_keywords": [{"score": 0.039254191205731113, "phrase": "ehr_use"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record_workarounds"}, {"score": 0.004780183091824403, "phrase": "small-to-medium_size"}, {"score": 0.0041051328120736575, "phrase": "perceived_limitations"}, {"score": 0.004060718465754644, "phrase": "technical_system"}, {"score": 0.0037087324991876727, "phrase": "seven_independent_primary_care_practices"}, {"score": 0.003525074461418428, "phrase": "patient_pathways"}, {"score": 0.003350480663660326, "phrase": "wide_range"}, {"score": 0.0033262524445013303, "phrase": "ehr-related_problems"}, {"score": 0.0032783186166708985, "phrase": "user_interface_issues"}, {"score": 0.0031500213134140953, "phrase": "electronic_health_information_exchange"}, {"score": 0.003059869469624301, "phrase": "new_technologies"}, {"score": 0.003037736332283186, "phrase": "existing_office_space"}, {"score": 0.0029830992938695033, "phrase": "observed_workarounds"}, {"score": 0.002887210021573995, "phrase": "specific_clinical_or_administrative_processes"}, {"score": 0.002646267286675984, "phrase": "daily_workflow"}, {"score": 0.0025892330566358503, "phrase": "short-term_solution"}, {"score": 0.0024519545383399773, "phrase": "practice's_power"}, {"score": 0.0023644936731468252, "phrase": "strategically_chosen_adaptations"}, {"score": 0.0023135183406982414, "phrase": "workaround_typology"}, {"score": 0.0022718774783143203, "phrase": "ehr_users"}, {"score": 0.002135812692862058, "phrase": "different_types"}, {"score": 0.002120349374832685, "phrase": "ehr_workarounds"}, {"score": 0.0021049977753042253, "phrase": "patient_safety"}], "paper_keywords": [""], "paper_abstract": "Objective Electronic health record (EHR) use in ambulatory care can improve safety and quality; however, problems with design, implementation, and poor interface with other systems lead users to develop 'workarounds', or behaviors users adopt to overcome perceived limitations in a technical system. We documented workarounds used in independent, community-based primary care practices, and developed a typology of their key features. Materials and methods Comparative case study of EHR use in seven independent primary care practices. Field researchers spent approximately 1 month in each practice to observe EHR use, conduct patient pathways, and interview clinicians and staff. Results We observed workarounds addressing a wide range of EHR-related problems, including: user interface issues (eg, insufficient data fields, limited templates), barriers to electronic health information exchange with external organizations, and struggles incorporating new technologies into existing office space. We analyzed the observed workarounds inductively to develop a typology that cuts across specific clinical or administrative processes to highlight the following key formal features of workarounds in general: temporary/routinized, which captures whether the workaround is taken for granted as part of daily workflow or is understood as a short-term solution; avoidable/unavoidable, referring to the extent to which the workaround is within the practice's power to eliminate; and deliberately chosen/unplanned, which differentiates strategically chosen adaptations from less thoughtful workarounds. Conclusions This workaround typology provides a framework for EHR users to identify and address workarounds in their own practices, and for researchers to examine the effect of different types of EHR workarounds on patient safety, care quality, and efficiency.", "paper_title": "A typology of electronic health record workarounds in small-to-medium size primary care practices", "paper_id": "WOS:000337672800013"}