{"auto_keywords": [{"score": 0.04680478981285888, "phrase": "video_game"}, {"score": 0.043891862951523725, "phrase": "young_children"}, {"score": 0.015719716506582538, "phrase": "educational_video_games"}, {"score": 0.004553510708976456, "phrase": "player_experience"}, {"score": 0.004042056914551798, "phrase": "long_time"}, {"score": 0.0037101871762082153, "phrase": "non-time_consuming"}, {"score": 0.0036826452656927877, "phrase": "significant_evaluation_method"}, {"score": 0.0034695189961509625, "phrase": "evaluation_method"}, {"score": 0.0028795712616923462, "phrase": "post-test_classic_structure"}, {"score": 0.0026428931714865115, "phrase": "reading-writing_skills"}, {"score": 0.002480520548392772, "phrase": "emotional_impact"}, {"score": 0.0023107943665108465, "phrase": "proposed_method"}, {"score": 0.0022428442879034636, "phrase": "educational_video_game"}, {"score": 0.0021049977753042253, "phrase": "analysis_method"}], "paper_keywords": ["Educational videogames", " evaluation of emotions", " children's evaluation"], "paper_abstract": "Although several evaluation analyses have recently been proposed to assess the user or player experience of playing a video game, we found the need for these to be adapted when we wanted to apply them to young children. However, young children are unable to spend a long time grading many attributes or indexes after playing. Thus, selecting the most important aspects to be analyzed is required in order to perform a non-time consuming and significant evaluation method to be used with children. Hence, this work is focused on designing an evaluation method to assess emotions when young children (3-5 years old) play a video game. In particular, we are interested in educational video games because of the importance that emotion has in motivation, which in turn is highly important in education. Although the method presented follows the pre-test, test and post-test classic structure, the activities carried out in each of these phases have been modified to, firstly, include no elements which require reading-writing skills, which are as yet undeveloped at this age and, secondly, to limit the emotional impact that children can suffer when they are aware that they are being evaluated. We have applied the proposed method in a sample of 39 children playing the educational video game \"Ato's Adventure\", which was in its final development phases, obtaining very promising results both for the analysis method and for the video game.", "paper_title": "A Method to Evaluate Emotions in Educational Video Games for Children", "paper_id": "WOS:000327373500004"}