{"auto_keywords": [{"score": 0.04926219622874721, "phrase": "locally_closed_databases"}, {"score": 0.010255297248935084, "phrase": "cwa"}, {"score": 0.009317482541705861, "phrase": "complete_knowledge"}, {"score": 0.007985176635504757, "phrase": "lcwa"}, {"score": 0.005090558532597316, "phrase": "query_answering"}, {"score": 0.00481495049065317, "phrase": "logical_reconstruction"}, {"score": 0.004684157900507474, "phrase": "closed_world_assumption"}, {"score": 0.0037834649508375544, "phrase": "standard_database_instance"}, {"score": 0.003693293499842943, "phrase": "local_closed_world_assumptions"}, {"score": 0.0035804980565263024, "phrase": "\"local\"_form"}, {"score": 0.003483120583663528, "phrase": "database_relation"}, {"score": 0.0032176163279340206, "phrase": "knowledge_representation"}, {"score": 0.003173545808843704, "phrase": "computational_perspective"}, {"score": 0.003130077012135034, "phrase": "representation_level"}, {"score": 0.0026616868981501006, "phrase": "reasoning_level"}, {"score": 0.002318566141177149, "phrase": "efficient_approximate_methods"}, {"score": 0.0022476609946536345, "phrase": "useful_classes"}, {"score": 0.002126907587540404, "phrase": "original_query"}, {"score": 0.0021049977753042253, "phrase": "tractable_way"}], "paper_keywords": ["Theory", " Databases", " closed world assumption", " locally closed databases"], "paper_abstract": "The Closed World Assumption (CWA) on databases expresses the assumption that an atom not in the database is false. This assumption is applicable only in cases where the database has complete knowledge about the domain of discourse. In this article, we investigate locally closed databases, that is: databases that are sound but partially incomplete about their domain. Such databases consist of a standard database instance, augmented with a collection of Local Closed World Assumptions (LCWAs). A LCWA is a \"local\" form of the CWA, expressing that a database relation is complete in a certain area, called a window of expertise. In this work, we study locally closed databases both from a knowledge representation and from a computational perspective. At the representation level, the approach taken in this article distinguishes between the data that is conveyed by a database and the metaknowledge about the area in which the data is complete. We study the semantics of the LCWA's and relate it to several knowledge representation formalisms. At the reasoning level, we study the complexity of, and algorithms for two basic reasoning tasks: computing certain and possible answers to queries and determining whether a database has complete knowledge on a query. As the complexity of these tasks is unacceptably high, we develop efficient approximate methods for query answering. We also prove that for useful classes of queries and locally closed databases, these methods are optimal, and thus they solve the original query in a tractable way. As a result, we obtain classes of queries and locally closed databases for which query answering is tractable.", "paper_title": "Towards a Logical Reconstruction of a Theory for Locally Closed Databases", "paper_id": "WOS:000280544600007"}