{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "java_profilers"}, {"score": 0.004764859786310636, "phrase": "performance_analysts"}, {"score": 0.0038854765143440965, "phrase": "hot_methods"}, {"score": 0.0035361001070845677, "phrase": "good_chance"}, {"score": 0.0034088473318056537, "phrase": "performance_analyst"}, {"score": 0.003373334961160647, "phrase": "wasting_time"}, {"score": 0.003320756562046789, "phrase": "cold_method"}, {"score": 0.0032012284065895537, "phrase": "causality_analysis"}, {"score": 0.0028527866590859967, "phrase": "fundamental_requirement"}, {"score": 0.002823050755743821, "phrase": "sampling-based_profilers"}, {"score": 0.002721388234661538, "phrase": "sampling-based_profiler"}, {"score": 0.0025824576209656676, "phrase": "proof-of-concept_profiler"}, {"score": 0.002289180040240783, "phrase": "case_studies"}], "paper_keywords": ["Experimentation", " Performance", " Bias", " Profiling", " Observer effect"], "paper_abstract": "Performance analysts profile their programs to find methods that are worth optimizing: the \"hot\" methods. This paper shows that four commonly-used Java profilers (xprof, hprof, jprofile, and yourkit) often disagree on the identity of the hot methods. If two profilers disagree, at least one must be incorrect. Thus, there is a good chance that a profiler will mislead a performance analyst into wasting time optimizing a cold method with little or no performance improvement. This paper uses causality analysis to evaluate profilers and to gain insight into the source of their incorrectness. It shows that these profilers all violate a fundamental requirement for sampling-based profilers: to be correct, a sampling-based profiler must collect samples randomly. We show that a proof-of-concept profiler, which collects samples randomly, does not suffer from the above problems. Specifically, we show, using a number of case studies, that our profiler correctly identifies methods that are important to optimize; in some cases other profilers report that these methods are cold and thus not worth optimizing.", "paper_title": "Evaluating the Accuracy of Java Profilers", "paper_id": "WOS:000279357500016"}