{"auto_keywords": [{"score": 0.03093857357761819, "phrase": "proposed_method"}, {"score": 0.03073184135939817, "phrase": "feature_extraction"}, {"score": 0.00481495049065317, "phrase": "recognition_scenarios"}, {"score": 0.004765482708043842, "phrase": "frontal_faces"}, {"score": 0.004732785510739708, "phrase": "mug_shots"}, {"score": 0.004039423410198574, "phrase": "forensic_applications"}, {"score": 0.003889206369317587, "phrase": "face_recognition"}, {"score": 0.0037060428445111694, "phrase": "surveillance_camera"}, {"score": 0.0036301992752948956, "phrase": "different_scenario"}, {"score": 0.003555902292752528, "phrase": "multiple_poses"}, {"score": 0.003435426082776884, "phrase": "mug_shot"}, {"score": 0.00276462370914216, "phrase": "subject's_face"}, {"score": 0.0025981810951165836, "phrase": "pose_class"}, {"score": 0.002580315755140875, "phrase": "embedded_hidden_markov_model"}, {"score": 0.002408265305704217, "phrase": "facial_components"}, {"score": 0.0023346234464901978, "phrase": "adaboost_weighting_scheme"}, {"score": 0.002286781334850213, "phrase": "component_classifiers"}, {"score": 0.0022710523337245337, "phrase": "sspo"}, {"score": 0.002163930783583212, "phrase": "component-based_classifier"}, {"score": 0.0021490449563443025, "phrase": "local_facial_features"}, {"score": 0.0021049977753042253, "phrase": "extensive_performance_evaluation_study"}], "paper_keywords": ["Adaboost classification", " face recognition", " facial features", " feature extraction", " hidden Markov model (HMM)"], "paper_abstract": "Most face recognition scenarios assume that frontal faces or mug shots are available for enrollment to the database, faces of other poses are collected in the probe set. Given a face from the probe set, one needs to determine whether a match in the database exists. This is under the assumption that in forensic applications, most suspects have their mug shots available in the database, and face recognition aims at recognizing the suspects when their faces of various poses are captured by a surveillance camera. This paper considers a different scenario: given a face with multiple poses available, which may or may not include a mug shot, develop a method to recognize the face with poses different from those captured. That is, given two disjoint sets of poses of a face, one for enrollment and the other for recognition, this paper reports a method best for handling such cases. The proposed method includes feature extraction and classification. For feature extraction, we first cluster the poses of each subject's face in the enrollment set into a few pose classes and then decompose the appearance of the face in each pose class using Embedded Hidden Markov Model, which allows us to define a set of subject-specific and pose-priented (SSPO) facial components for each subject. For classification, an Adaboost weighting scheme is used to fuse the component classifiers with SSPO component features. The proposed method is proven to outperform other approaches, including a component-based classifier with local facial features cropped manually, in an extensive performance evaluation study.", "paper_title": "Subject-Specific and Pose-Oriented Facial Features for Face Recognition Across Poses", "paper_id": "WOS:000308995500005"}