{"auto_keywords": [{"score": 0.04392395216758153, "phrase": "asynchronous_sn_p_systems"}, {"score": 0.015578419346664837, "phrase": "local_synchronization"}, {"score": 0.011875290368254509, "phrase": "standard_spiking_rules"}, {"score": 0.008713768692145013, "phrase": "neural_p_systems"}, {"score": 0.004435112270935294, "phrase": "distributed_parallel_computing_devices"}, {"score": 0.004160435626849478, "phrase": "non-synchronized_systems"}, {"score": 0.003561865840737996, "phrase": "turing_machines"}, {"score": 0.003433987036569199, "phrase": "biological_inspiration"}, {"score": 0.003325852346387272, "phrase": "specific_biological_functioning"}, {"score": 0.0029128614098881253, "phrase": "computation_power"}, {"score": 0.0027573101010593863, "phrase": "general_neurons"}, {"score": 0.002493333098814506, "phrase": "bounded_neurons"}, {"score": 0.0024258208033731154, "phrase": "semilinear_sets"}, {"score": 0.002403724423251419, "phrase": "natural_numbers"}, {"score": 0.0021735249249471614, "phrase": "desired_computation_power"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Bio-inspired computing", " Spiking neural P system", " Turing completeness", " Asynchronization", " Local synchronization"], "paper_abstract": "Spiking neural P systems (SN P systems, for short) are a class of distributed parallel computing devices inspired from the way neurons communicate by means of spikes. Asynchronous SN P systems are non-synchronized systems, where the use of spiking rules (even if they are enabled by the contents of neurons) is not obligatory. It remains open whether asynchronous SN P systems with standard spiking rules are equivalent with Turing machines. In this paper, with a biological inspiration (in order to achieve some specific biological functioning, neurons from the same functioning motif or community work synchronously to cooperate with each other), we introduce the notion of local synchronization into asynchronous SN P systems. The computation power of asynchronous SN P systems with local synchronization is investigated. Such systems consisting of general neurons (respectively, unbounded neurons) and using standard spiking rules are proved to be universal. Asynchronous SN P systems with local synchronization consisting of bounded neurons and using standard spiking rules characterize the semilinear sets of natural numbers. These results show that the local synchronization is useful, it provides some \"programming capacity\" useful for achieving a desired computation power. el (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Asynchronous spiking neural P systems with local synchronization", "paper_id": "WOS:000310825500011"}