{"auto_keywords": [{"score": 0.0389569451865242, "phrase": "optimization_phase_order_space"}, {"score": 0.03763732545652386, "phrase": "reasonable_amount"}, {"score": 0.0046739596755881185, "phrase": "long-standing_problem"}, {"score": 0.0045370785151713396, "phrase": "exhaustive_evaluation"}, {"score": 0.004456872931482395, "phrase": "possible_orderings"}, {"score": 0.004404188306112211, "phrase": "optimization_phases"}, {"score": 0.004149922666541166, "phrase": "production-quality_compilers"}, {"score": 0.003118838635447237, "phrase": "optimization_phase_order_search_space"}, {"score": 0.002852356597632014, "phrase": "program_simulations"}, {"score": 0.0027852126030055305, "phrase": "program_performance"}, {"score": 0.0027358910467781155, "phrase": "distinct_phase"}, {"score": 0.0024577274522206436, "phrase": "best_phase"}, {"score": 0.0022610379771517966, "phrase": "interesting_properties"}, {"score": 0.0021049977753042253, "phrase": "related_problems"}], "paper_keywords": ["Performance", " Measurement", " Algorithms", " Phase ordering", " exhaustive search", " iterative compilation"], "paper_abstract": "Choosing the most appropriate optimization phase ordering has been a long-standing problem in compiler optimizations. Exhaustive evaluation of all possible orderings of optimization phases for each function is generally dismissed as infeasible for production-quality compilers targeting accepted benchmarks. In this article, we show that it is possible to exhaustively evaluate the optimization phase order space for each function in a reasonable amount of time for most of the functions in our benchmark suite. To achieve this goal, we used various techniques to significantly prune the optimization phase order search space so that it can be inexpensively enumerated in most cases and reduce the number of program simulations required to evaluate program performance for each distinct phase ordering. The techniques described are applicable to other compilers in which it is desirable to find the best phase ordering for most functions in a reasonable amount of time. We also describe some interesting properties of the optimization phase order space, which will prove useful for further studies of related problems in compilers.", "paper_title": "Practical Exhaustive Optimization Phase Order Exploration and Evaluation", "paper_id": "WOS:000267268500001"}