{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "important_international_academic_awards"}, {"score": 0.00475413908468027, "phrase": "international_academic_awards"}, {"score": 0.004240116703465252, "phrase": "significant_role"}, {"score": 0.004159997145421619, "phrase": "performance_evaluations"}, {"score": 0.003829877278269543, "phrase": "relative_importance"}, {"score": 0.0034812740368914455, "phrase": "comprehensive_global_map"}, {"score": 0.0033084729942065142, "phrase": "relative_reputations"}, {"score": 0.003204841443605308, "phrase": "close_or_distant_relationships"}, {"score": 0.002931569771634119, "phrase": "above-average_reputations"}, {"score": 0.0022578275190855124, "phrase": "mapping_software"}, {"score": 0.0021049977753042253, "phrase": "reputation_scores"}], "paper_keywords": ["International academic award", " Reputation survey", " Co-awardees", " Mapping"], "paper_abstract": "International academic awards are popular as incentives and rewards for academics all over the world, and have played a significant role in the performance evaluations of individuals and institutions. However, little is known about the relative importance of awards and the relationships between awards. This study aims to establish a comprehensive global map of important international academic awards, which visually presents the relative reputations of awards and the close or distant relationships between awards. By surveying the reputations of the preselected 207 awards, 90 important international academic awards with above-average reputations were identified. Then, based on the number of \"awardees in common\" or named \"co-awardees\" between every pair of these 90 awards, a network of co-awardees was built. Finally, using mapping software of VOSviewer, these 90 important international academic awards were mapped by taking the reputation scores as the weights of awards and the network of co-awardees as the basis of the relationships between awards.", "paper_title": "Mapping of important international academic awards", "paper_id": "WOS:000359143200008"}