{"auto_keywords": [{"score": 0.04965333175972822, "phrase": "hjorland"}, {"score": 0.049231556988166246, "phrase": "nissen_pedersen"}, {"score": 0.01019663021207881, "phrase": "exhaustive_and_universal_classification"}, {"score": 0.004081385289516914, "phrase": "interdisciplinary_scholarship"}, {"score": 0.0039380388343479384, "phrase": "literature-based_conceptual_analysis"}, {"score": 0.0033227310662785293, "phrase": "deductive_approach"}, {"score": 0.003249251984154665, "phrase": "inductive_approach"}, {"score": 0.002418393046947528, "phrase": "causal_links"}, {"score": 0.0023125191783901367, "phrase": "information_science"}, {"score": 0.002241171326888997, "phrase": "science_literatures"}, {"score": 0.0021049977753042253, "phrase": "great_value"}], "paper_keywords": ["classification", " information retrieval", " curricula"], "paper_abstract": "Purpose - This paper aims to respond to the 2005 paper by Hjorland and Nissen Pedersen by suggesting that an exhaustive and universal classification of the phenomena that scholars study, and the methods and theories they apply, is feasible. It seeks to argue that such a classification is critical for interdisciplinary scholarship. Design/methodology/approach - The paper presents a literature-based conceptual analysis, taking Hjorland and Nissen Pedersen as its starting point. Hjorland and Nissen Pedersen had identified several difficulties that would be encountered in developing such a classification; the paper suggests how each of these can be overcome. It also urges a deductive approach as complementary to the inductive approach recommended by Hjorland and Nissen Pedersen. Findings - The paper finds that an exhaustive and universal classification of scholarly documents in terms of (at least) the phenomena that scholars study, and the theories and methods they apply, appears to be both possible and desirable. Practical implications - The paper suggests how such a project can be begun. In particular it stresses the importance of classifying documents in terms of causal links between phenomena. Originality/value - The paper links the information science, interdisciplinary, and study of science literatures, and suggests that the types of classification outlined above would be of great value to scientists/scholars, and that they are possible.", "paper_title": "Classification, interdisciplinarity, and the study of science", "paper_id": "WOS:000258733900002"}