{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "outsourcing_contracts"}, {"score": 0.004568108391981922, "phrase": "new_ideas"}, {"score": 0.004520272777451894, "phrase": "business_partners"}, {"score": 0.00433386573276633, "phrase": "good_contract_management"}, {"score": 0.004243552607799184, "phrase": "innovative_behavior"}, {"score": 0.003330406613112555, "phrase": "contractual_view"}, {"score": 0.0032437952431945724, "phrase": "innovation_view"}, {"score": 0.002697245874076643, "phrase": "innovation_focus"}, {"score": 0.0025858215477025117, "phrase": "\"extreme_contracting"}, {"score": 0.0023025177990160487, "phrase": "outsourcing_arrangements"}, {"score": 0.002266364679369248, "phrase": "successful_manner"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Outsourcing", " Innovation", " Paradox"], "paper_abstract": "This paper identifies the conditions that create a paradox when firms try to obtain innovation using outsourcing contracts. While outsourcing can be a way to obtain new ideas from business partners, most of the guidelines related to good contract management seem to deter innovative behavior. Managers trying to innovate using outsourcing are therefore facing two opposing sets of constraints, and have to manage both at the same time. In this paper, the nature of the \"innovation through outsourcing\" paradox is discussed in terms of the tensions between a contractual view of outsourcing and an innovation view of outsourcing, along with their associated reinforcing cycles. The paper outlines four mechanisms that are essentially self-correcting cycles. They include: 1) dual formal reviews; 2) matching governance with level of innovation focus; 3) dynamic decision-making/ \"extreme contracting\"; and 4) ambidextrous organization. These can enable managers to deal with this paradox and obtain innovation from outsourcing arrangements in a successful manner. Complexities involved in implementing these mechanisms are discussed and some avenues for future research are offered. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Exploring and managing the \"innovation through outsourcing\" paradox", "paper_id": "WOS:000367121600005"}