{"auto_keywords": [{"score": 0.041046638947291096, "phrase": "medication_administration"}, {"score": 0.027880547210140456, "phrase": "potential_generalizability"}, {"score": 0.00481495049065317, "phrase": "clinician_performance"}, {"score": 0.004326624385772596, "phrase": "multiple_threads"}, {"score": 0.0040027552011993005, "phrase": "safety-critical_aspects"}, {"score": 0.0036553070575015344, "phrase": "safety-critical_work_tasks"}, {"score": 0.003493021648360933, "phrase": "unintended_consequences"}, {"score": 0.0034368195287290465, "phrase": "higher_yield"}, {"score": 0.0033815186230026243, "phrase": "better_evidence"}, {"score": 0.003359647377874098, "phrase": "better_guidance"}, {"score": 0.0033379171194742614, "phrase": "healthcare_communities"}, {"score": 0.003294875957676514, "phrase": "viewpoint_paper"}, {"score": 0.00325238798404366, "phrase": "key_papers"}, {"score": 0.0030086877092638945, "phrase": "field_interventions"}, {"score": 0.00250041084632787, "phrase": "healthcare_clinical_context"}, {"score": 0.002373807808495538, "phrase": "cognitive_context"}, {"score": 0.00235843888868088, "phrase": "healthcare_work"}, {"score": 0.0021464286727045623, "phrase": "individual_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interruptions", " Distractions", " Multitasking", " Healthcare", " Representative design"], "paper_abstract": "Interruptions and distractions are a feature of work in most complex sociotechnical systems in which people must handle multiple threads of work. Over the last 10-15 years there has been a crescendo of reviews and investigations into the impact that interruptions and distractions have on safety-critical aspects of healthcare work, such as medication administration, but findings are still inconclusive. Despite this, many healthcare communities have taken steps to reduce interruptions and distractions in safety-critical work tasks, a step that will usually do no harm but that may have unintended consequences. Investigations with a higher yield of certainty would provide better evidence and better guidance to healthcare communities. In this viewpoint paper we survey some key papers reporting investigations of interruptions and distractions in the field, in simulators, and in the laboratory. We also survey reports of field interventions aimed at minimizing interruptions and distractions with the intention of improving the safety of medication administration and other safety-critical healthcare tasks. To analyse the papers adopting each form of investigation, we use the three dimensions of fidelity, formal control exercised, and the potential generalizability to the field. We argue that studies of interruptions and distractions outside the healthcare clinical context, but intended to generalize to it, should become more formally representative of the cognitive context of healthcare work. Research would be improved if investigators undertook programs of studies that successively achieve fidelity, control, and potential generalizability, or if they strengthened the design of individual studies. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "How do interruptions affect clinician performance in healthcare? Negotiating fidelity, control, and potential generalizability in the search for answers", "paper_id": "WOS:000355048100008"}