{"auto_keywords": [{"score": 0.045247351989859186, "phrase": "visibility_graph"}, {"score": 0.00481495049065317, "phrase": "simple_polygons"}, {"score": 0.0047277417909824745, "phrase": "telling_convex"}, {"score": 0.004693315901660278, "phrase": "reflex"}, {"score": 0.004558012799538011, "phrase": "simple_polygon_p"}, {"score": 0.0038946650372062783, "phrase": "line_segment"}, {"score": 0.0035541673947328163, "phrase": "counterclockwise_order"}, {"score": 0.0031039212233596415, "phrase": "distant_vertices"}, {"score": 0.0029813748433158032, "phrase": "upper_bound"}, {"score": 0.002853183476661506, "phrase": "general_result"}, {"score": 0.00276066021951467, "phrase": "arc-labeled_graph_g"}, {"score": 0.002710557619357275, "phrase": "base_graph"}, {"score": 0.002622647280008795, "phrase": "smallest_graph"}, {"score": 0.002298544073884724, "phrase": "polygon_p"}, {"score": 0.0022734117274137468, "phrase": "preceding_capabilities"}, {"score": 0.0021996478802839316, "phrase": "p._we"}, {"score": 0.0021049977753042253, "phrase": "weak_rendezvous_problem"}], "paper_keywords": ["Algorithms", " Theory", " Polygons", " robots", " mapping", " visibility graphs", " rendezvous", " angles"], "paper_abstract": "We consider the exploration of a simple polygon P by a robot that moves from vertex to vertex along edges of the visibility graph of P. The visibility graph has a vertex for every vertex of P and an edge between two vertices if they see each other-that is, if the line segment connecting them lies inside P entirely. While located at a vertex, the robot is capable of ordering the vertices it sees in counterclockwise order as they appear on the boundary, and for every two such vertices, it can distinguish whether the angle between them is convex (<=pi) or reflex (>pi). Other than that, distant vertices are indistinguishable to the robot. We assume that an upper bound on the number of vertices is known. We obtain the general result that a robot exploring any locally oriented, arc-labeled graph G can always determine the base graph of G. Roughly speaking, this is the smallest graph that cannot be distinguished by a robot from G by its observations alone, no matter how it moves. Combining this result with various other techniques allows the ability to show that a robot exploring a polygon P with the preceding capabilities is always capable of reconstructing the visibility graph of P. We also show that multiple identical, indistinguishable, and deterministic robots of this kind can always solve the weak rendezvous problem in which they need to position themselves such that they mutually see each other-for instance, such that they form a clique in the visibility graph.", "paper_title": "Mapping Simple Polygons: The Power of Telling Convex from Reflex", "paper_id": "WOS:000357122300009"}