{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "partial_supervision"}, {"score": 0.041612822961875004, "phrase": "proposed_algorithm"}, {"score": 0.004278807087784626, "phrase": "semi-supervised_clustering_algorithm"}, {"score": 0.004187917910692495, "phrase": "modified_version"}, {"score": 0.003802135020791801, "phrase": "traditional_unsupervised_clustering"}, {"score": 0.0034332736827447654, "phrase": "first_component"}, {"score": 0.00323625520042892, "phrase": "scaling_factor"}, {"score": 0.0032016639006812826, "phrase": "comprehensive_experimental_studies"}, {"score": 0.0028446460307503343, "phrase": "induced_classifier"}, {"score": 0.0027841357057119295, "phrase": "completely_labeled_data"}, {"score": 0.002681315076008658, "phrase": "fully_supervised_classifiers"}, {"score": 0.002652639568848117, "phrase": "namely_support_vector_machines"}, {"score": 0.002382182688788248, "phrase": "partly_labeled_data"}, {"score": 0.0021049977753042253, "phrase": "linear_regression_model"}], "paper_keywords": ["clustering", " partial supervision", " classification", " class discrimination", " linear regression"], "paper_abstract": "Clustering with partial supervision finds its application in situations where data is neither entirely nor accurately labeled. This paper discusses a semi-supervised clustering algorithm based on a modified version of the fuzzy C-Means (FCM) algorithm. The objective function of the proposed algorithm consists of two components. The first concerns traditional unsupervised clustering while the second tracks the relationship between classes (available labels) and the clusters generated by the first component. The balance between the two components is tuned by a scaling factor. Comprehensive experimental studies are presented. First, the discrimination of the proposed algorithm is discussed before its reformulation as a classifier is addressed. The induced classifier is evaluated on completely labeled data and validated by comparison against some fully supervised classifiers, namely support vector machines and neural networks. This classifier is then evaluated and compared against three semi-supervised algorithms in the context of learning from partly labeled data. In addition, the behavior of the algorithm is discussed and the relation between classes and clusters is investigated using a linear regression model. Finally, the complexity of the algorithm is briefly discussed.", "paper_title": "Data clustering with partial supervision", "paper_id": "WOS:000235449300003"}