{"auto_keywords": [{"score": 0.04590884875550197, "phrase": "cio"}, {"score": 0.033638949764559736, "phrase": "enterprise_architecture"}, {"score": 0.03141916098213543, "phrase": "decision_support"}, {"score": 0.026419140324743146, "phrase": "business_organization"}, {"score": 0.00481495049065317, "phrase": "cio_concerns"}, {"score": 0.004755650013733963, "phrase": "enterprise_architecture_frameworks"}, {"score": 0.00446987606516801, "phrase": "organizational_role"}, {"score": 0.004115267130977749, "phrase": "general_acceptance"}, {"score": 0.003459191419478298, "phrase": "swedish_cios"}, {"score": 0.003093595537995837, "phrase": "cio_role"}, {"score": 0.0030554300179552415, "phrase": "primary_stakeholder"}, {"score": 0.002931569771634119, "phrase": "enterprise_architecture_research"}, {"score": 0.0028010985923790036, "phrase": "brief_review"}, {"score": 0.002676418520290942, "phrase": "cio._results"}, {"score": 0.002305799666781492, "phrase": "new_computer-aided_support"}, {"score": 0.0022122603123901114, "phrase": "cios'_prioritization"}, {"score": 0.0021049977753042253, "phrase": "largest_disharmony"}], "paper_keywords": ["enterprise architecture", " Chief Information Officer (CIO)", " enterprise architecture frameworks", " strategic information system management", " IT management"], "paper_abstract": "The challenge of IT management is today considerable. In industry, the organizational role of the Chief Information Officer (CIO) has been promoted as the owner of these challenges. In spite of a general acceptance of the problems associated with the responsibilities of the CIO, very little academic research has been conducted on the issues and constraints of this role. In order to address these shortcomings, this article presents the results of a survey in which Swedish CIOs have prioritized their most important concerns. In academia, a response to the IT system management challenges has presented itself in the discipline of Enterprise Architecture. The article argues that the CIO role is the primary stakeholder of Enterprise Architecture, so his/her need for decision support should guide Enterprise Architecture research and framework development. Therefore, the article presents a brief review over how well two existing Enterprise Architecture frameworks address the surveyed concerns of the CIO. Results from the survey indicate that the three highest prioritized concerns of CIOs are to decrease the cost related to the business organization, to improve the quality of the interplay between the IT organization and the business organization and to provide new computer-aided support to the business organization. The comparison between the CIOs' prioritization and the foci of the frameworks shows some discrepancies. The largest disharmony lies in the lack of decision support for issues related to the IT organization. Furthermore, support for explicitly estimating and managing costs is lacking within the frameworks.", "paper_title": "A survey on CIO concerns - do enterprise architecture frameworks support them?", "paper_id": "WOS:000237861100003"}