{"auto_keywords": [{"score": 0.03236108182338282, "phrase": "fpga"}, {"score": 0.010306769923077642, "phrase": "ilp"}, {"score": 0.00481495049065317, "phrase": "hybrid_systems"}, {"score": 0.004762893197005439, "phrase": "integer_linear_programming"}, {"score": 0.004610058444728656, "phrase": "hw_platforms"}, {"score": 0.004381962669035583, "phrase": "introduced_model"}, {"score": 0.004303252595782034, "phrase": "scheduling_problems"}, {"score": 0.0036157418067192136, "phrase": "fpgas'_reconfigurations"}, {"score": 0.003254610516477302, "phrase": "time_intervals"}, {"score": 0.0031386091093713706, "phrase": "execution_time"}, {"score": 0.002993947751499058, "phrase": "reconfiguration_time"}, {"score": 0.002897710777957041, "phrase": "memory_requirements"}, {"score": 0.0028352726653271187, "phrase": "configuration_codes"}, {"score": 0.002646267286675984, "phrase": "resource_conflicts"}, {"score": 0.0024253827365474734, "phrase": "resource_sharing"}, {"score": 0.0022967713922705, "phrase": "real-application_example"}, {"score": 0.0021049977753042253, "phrase": "generated_constraints"}], "paper_keywords": [""], "paper_abstract": "An integer linear programming (ILP) model for mapping applications on HW platforms that consist of mu Ps, ASICs and FPGAs is proposed. The introduced model solves the assignment and scheduling problems taking into consideration the time required to reconfigure the FPGAs. Specifically, the type of the tasks that are executed on the FPGAs is taken into account, so that tasks which perform the same function are scheduled consecutively. In that way the number of the FPGAs' reconfigurations is reduced and the performance is improved. Also, the configuration of the FPGAs is hidden because it happens, if it is possible, in the time intervals that the FPGAs are idle. Thus, the execution time of the task mapped on the FPGA does not increase due to reconfiguration time and performance is improved. Moreover, the memory requirements for storing the program and configuration codes of the tasks that are executed on mPs and FPGAs are taken into consideration. In addition, resource conflicts due to tasks/data transfers whose execution times are overlapped in time and are assigned on the same resource (PE/bus) are addressed. Finally, resource sharing is supported. The above features are validated by a series of experiments including a real-application example, the M-JPEG encoder. Also, the complexity of the model is studied in terms of the number of the generated constraints and variables and time required for solving it.", "paper_title": "An integer linear programming model for mapping applications on hybrid systems", "paper_id": "WOS:000262865800004"}