{"auto_keywords": [{"score": 0.028218718504283608, "phrase": "theoretical_and_empirical_articles"}, {"score": 0.0047468516620285525, "phrase": "journal_articles"}, {"score": 0.00459165923324494, "phrase": "impact_factor"}, {"score": 0.004275904315753662, "phrase": "theoretical_and_empirical_types"}, {"score": 0.004155742403177802, "phrase": "citation_impact"}, {"score": 0.004116440453049531, "phrase": "spanish_psychology_journals"}, {"score": 0.0036553070575015344, "phrase": "psicothema"}, {"score": 0.0036207206487324506, "phrase": "twenty-three_psychology_journals"}, {"score": 0.0035865093827416442, "phrase": "spanish"}, {"score": 0.0035189057079817285, "phrase": "source_journals"}, {"score": 0.003419943984098415, "phrase": "sixty-seven_issues"}, {"score": 0.00332375606483146, "phrase": "ninety-three_issues"}, {"score": 0.0031693980719538287, "phrase": "six_highly_trained_psychologists"}, {"score": 0.003022186855664124, "phrase": "empirical_and_theoretical_articles"}, {"score": 0.0028006988338192375, "phrase": "article_type"}, {"score": 0.0025343769150179764, "phrase": "theoretical_articles"}, {"score": 0.002486589906779091, "phrase": "twice_as_many_references"}, {"score": 0.0024513404432665153, "phrase": "empirical_ones"}, {"score": 0.0021049977753042253, "phrase": "similar_percentage"}], "paper_keywords": [""], "paper_abstract": "The study discusses the necessity to analyze the influence of theoretical and empirical types of journal articles on the citation impact of Spanish psychology journals. Three of the most representative Spanish psychology journals were selected for the purposes of this study: Papeles del Psiclogo, Analisis y Modificacin de Conducta and Psicothema. Twenty-three psychology journals in Spanish were used as source journals. Altogether, there were sixty-seven issues reviewed for the references and ninety-three issues for the articles. The bibliometricanalysis was conducted by six highly trained psychologists. The results demonstrated differences regarding the percentages of empirical and theoretical articles published in the three examined journals and the number of citations received by them based on the article type. When normalizing the results according to the number of theoretical and empirical articles that were published, it becomes evident that the theoretical articles receive on average twice as many references as the empirical ones. We discuss the importance of this effect on the comparison of journals based on their citation impact and show the evidence that it is only valid to compare journals which publish a similar percentage of theoretical and empirical articles.", "paper_title": "Analysis of the influence of the two types of the journal articles; theoretical and empirical on the impact factor of a journal", "paper_id": "WOS:000267368100015"}