{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "name_disambiguation"}, {"score": 0.004769958800452922, "phrase": "bibliographic_citations"}, {"score": 0.004594137808658537, "phrase": "bibliographic_citation"}, {"score": 0.00444559516711374, "phrase": "digital_libraries"}, {"score": 0.00440403952059725, "phrase": "previous_methods"}, {"score": 0.004143196873246147, "phrase": "excessive_attributes"}, {"score": 0.004066076430818046, "phrase": "institutional_affiliation"}, {"score": 0.004028054020045027, "phrase": "research_area"}, {"score": 0.003615443704375908, "phrase": "novel_coarse-to-fine_framework"}, {"score": 0.0031995142224983094, "phrase": "multiple_clustering"}, {"score": 0.0029816229984366374, "phrase": "rough_clusters"}, {"score": 0.002765490759189057, "phrase": "title_information"}, {"score": 0.0027267406923803367, "phrase": "bigger_fragments"}, {"score": 0.002552946390854313, "phrase": "latent_relations"}, {"score": 0.0025053520095236694, "phrase": "experimental_results"}, {"score": 0.002470237978694949, "phrase": "digital_bibliography_and_library_project"}, {"score": 0.0021049977753042253, "phrase": "execution_time"}], "paper_keywords": [""], "paper_abstract": "Name ambiguity in the context of bibliographic citation affects the quality of services in digital libraries. Previous methods are not widely applied in practice because of their high computational complexity and their strong dependency on excessive attributes, such as institutional affiliation, research area, address, etc., which are difficult to obtain in practice. To solve this problem, we propose a novel coarse-to-fine framework for name disambiguation which sequentially employs 3 common and easily accessible attributes (i.e., coauthor name, article title, and publication venue). Our proposed framework is based on multiple clustering and consists of 3 steps: (a) clustering articles by coauthorship and obtaining rough clusters, that is fragments; (b) clustering fragments obtained in step 1 by title information and getting bigger fragments; (c) and clustering fragments obtained in step 2 by the latent relations among venues. Experimental results on a Digital Bibliography and Library Project (DBLP) data set show that our method outperforms the existing state-of-the-art methods by 2.4% to 22.7% on the average pairwise F1 score and is 10 to 100 times faster in terms of execution time.", "paper_title": "A Fast Method Based on Multiple Clustering for Name Disambiguation in Bibliographic Citations", "paper_id": "WOS:000350100500014"}