{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "rule_interestingness_measures"}, {"score": 0.00477513738640734, "phrase": "alternative_approaches"}, {"score": 0.004561950666122737, "phrase": "interestingness_measures"}, {"score": 0.004358240019060018, "phrase": "bayesian_confirmation_property"}, {"score": 0.0039120325834029355, "phrase": "symmetry_properties"}, {"score": 0.003151572886432253, "phrase": "confirmation_concept"}, {"score": 0.002900037689072025, "phrase": "weak_l"}, {"score": 0.0027934768366077397, "phrase": "confirmation_measures"}, {"score": 0.002668524425703961, "phrase": "desired_properties"}, {"score": 0.0024759682272230735, "phrase": "considered_properties"}, {"score": 0.0021853532419450887, "phrase": "single_measure"}, {"score": 0.002158233639156017, "phrase": "desirable_properties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rule interestingness measures", " Properties of measures", " Confirmation", " Normalization"], "paper_abstract": "We are considering properties of interestingness measures of rule; induced from data. These are: Bayesian confirmation property, two properties related to the case of entailment or refutation, called (Ex(1)) and logicality L, and a group of symmetry properties. We propose a modification of properties (Ex(1)) and L, called weak (Ex(1)), and weak 1, that deploy the concept of confirmation in its larger sense. We demonstrate that properties (Ex(1)) and L do not fully reflect such understanding of the confirmation concept, and thus, we propose to substitute (Ex(1)) by weak (Ex(1)) and L by weak L Moreover, we introduce four new approaches to normalization of confirmation measures in order to transform measures so that they would obtain desired properties. The analysis of the results of the normalizations of the confirmation measures takes into account all considered properties. We advocate for two normalized confirmation measures: measure Z considered in the literature, and newly proposed measure A. Finally, we provide some ideas for combining them in a single measure keeping all desirable properties. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Properties of rule interestingness measures and alternative approaches to normalization of measures", "paper_id": "WOS:000308383100001"}