{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "e-speranto_-_a_computer_language"}, {"score": 0.0046221918332842995, "phrase": "present_paper"}, {"score": 0.004357245559948974, "phrase": "multilingual_texts"}, {"score": 0.004070276454809864, "phrase": "international_auxiliary_language_esperanto"}, {"score": 0.003716724243777879, "phrase": "key_features"}, {"score": 0.003584025547693836, "phrase": "natural_integration"}, {"score": 0.0035515951985356374, "phrase": "e-speranto_documents"}, {"score": 0.003257727050827128, "phrase": "user's_preferred_language"}, {"score": 0.0031129269142224194, "phrase": "formal_language"}, {"score": 0.0028293966058473476, "phrase": "natural_languages"}, {"score": 0.002548331088496964, "phrase": "practical_application"}, {"score": 0.002491015208328868, "phrase": "linguistic_group"}, {"score": 0.002326669201839705, "phrase": "proof-of-concept_implementation"}], "paper_keywords": ["E-speranto", " multilingual Web", " interpretation", " XML"], "paper_abstract": "The present paper describes the design of E-speranto, a formal computer language for recording multilingual texts on the Web. The vocabulary and grammar of E-speranto are based on the international auxiliary language Esperanto, while its syntax is based on XML (eXtensible Markup Language). The latter is one of the key features of E-speranto, as it enables a natural integration of E-speranto documents into web pages. When a user visits such a web page, its content is interpreted and displayed in the user's preferred language. Due to the fact that E-speranto is a formal language, it is much easier for computers to comprehend documents created in this language than to comprehend texts written in natural languages. The documents in E-speranto can be created directly with the aid of tools designed especially for this purpose. For a practical application of E-speranto, each linguistic group merely needs to develop the interpreter of E-speranto for their own language. We designed a proof-of-concept implementation of the multilingual Web based on E-speranto. The testing confirmed the applicability of the concept and indicated the guidelines for further development.", "paper_title": "THE DESIGN OF E-SPERANTO - A COMPUTER LANGUAGE FOR RECORDING MULTILINGUAL TEXTS ON THE WEB", "paper_id": "WOS:000309483900003"}