{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hesitant_fuzzy_linguistic_term_sets"}, {"score": 0.049038638823551965, "phrase": "multi-criteria_decision_making"}, {"score": 0.028591303357322805, "phrase": "proposed_distance"}, {"score": 0.00440976345264104, "phrase": "expert's_hesitant_preferences"}, {"score": 0.004332894955218135, "phrase": "linguistic_variable"}, {"score": 0.00416478405812793, "phrase": "linguistic_information"}, {"score": 0.0037311260623089436, "phrase": "decision_making"}, {"score": 0.003477505397536663, "phrase": "different_types"}, {"score": 0.00308788133472785, "phrase": "weighted_or_ordered_weighted_distance_and_similarity_measures"}, {"score": 0.002941913249957503, "phrase": "discrete_and_continuous_cases"}, {"score": 0.0027782510491938315, "phrase": "decision_making_problems"}, {"score": 0.0024451427672857458, "phrase": "practical_example"}, {"score": 0.002248816575548875, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Hesitant fuzzy linguistic term set", " Distance measure", " Similarity measure", " Multi-criteria decision making"], "paper_abstract": "The hesitant fuzzy linguistic term sets (HFLTSs), which can be used to represent an expert's hesitant preferences when assessing a linguistic variable, increase the flexibility of eliciting and representing linguistic information. The HFLTSs have attracted a lot of attention recently due to their distinguished power and efficiency in representing uncertainty and vagueness within the process of decision making. To enhance and extend the applicability of HFLTSs, this paper investigates and develops different types of distance and similarity measures for HFLTSs. The paper first proposes a family of distance and similarity measures between two HFLTSs. Then a variety of weighted or ordered weighted distance and similarity measures between two collections of HFLTSs are proposed and analyzed for discrete and continuous cases respectively. After that, the application of these measures to multi-criteria decision making problems is given. Based on the proposed distance and similarity measures, the satisfaction degrees for different alternatives are established and are then used to rank alternatives in multi-criteria decision making. Finally a practical example concerning the evaluation of the quality of movies is given to illustrate the applicability and advantage of the proposed approach and the differences between the proposed distance and similarity measures. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Distance and similarity measures for hesitant fuzzy linguistic term sets and their application in multi-criteria decision making", "paper_id": "WOS:000336011900009"}