{"auto_keywords": [{"score": 0.04028465982960715, "phrase": "ecg"}, {"score": 0.00481495049065317, "phrase": "intelligent_system"}, {"score": 0.004756805752518494, "phrase": "genetic_programming"}, {"score": 0.004718431349852634, "phrase": "atrial_fibrillation_classification."}, {"score": 0.004567990533989851, "phrase": "intelligent_classifiers"}, {"score": 0.004333642054036135, "phrase": "cardiac_diseases"}, {"score": 0.003996271202811961, "phrase": "atrial_fibrillations"}, {"score": 0.0035965032173588753, "phrase": "specific_pathology"}, {"score": 0.003453584878128719, "phrase": "different_ways"}, {"score": 0.003370565320453525, "phrase": "best_possible_way"}, {"score": 0.003120568497402472, "phrase": "ecg_treatment_methodologies"}, {"score": 0.0029126002350975634, "phrase": "best_results"}, {"score": 0.0028195727965553367, "phrase": "ecg_recordings"}, {"score": 0.002751751956416832, "phrase": "atrial_fibrillation"}, {"score": 0.0025892330566358503, "phrase": "great_amount"}, {"score": 0.0024761702541879213, "phrase": "additional_characteristics"}, {"score": 0.00233936726307301, "phrase": "new_method"}, {"score": 0.002311047934798247, "phrase": "evolutionary_algorithms"}, {"score": 0.0021049977753042253, "phrase": "different_types"}], "paper_keywords": [""], "paper_abstract": "This article focuses on the development of intelligent classifiers in the area of biomedicine, focusing on the problem of diagnosing cardiac diseases based on the electrocardiogram (ECG), or more precisely, on the differentiation of the types of atrial fibrillations. First of all, we will study the ECG, and the treatment of the ECG in order to work with it with this specific pathology. In order to achieve this we will study different ways of elimination, in the best possible way, of any activity that is not caused by the auriculars. We will study and imitate the ECG treatment methodologies and the characteristics extracted from the electrocardiograms that were used by the researchers who obtained the best results in the Physionet Challenge, where the classification of ECG recordings according to the type of atrial fibrillation (AF) that they showed, was realized. We will extract a great amount of characteristics, partly those used by these researchers and additional characteristics that we consider to be important for the distinction previously mentioned. A new method based on evolutionary algorithms will be used to realize a selection of the most relevant characteristics and to obtain a classifier that will be capable of distinguishing the different types of this pathology.", "paper_title": "INTELLIGENT SYSTEM BASED ON GENETIC PROGRAMMING FOR ATRIAL FIBRILLATION CLASSIFICATION", "paper_id": "WOS:000271813000001"}