{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service_discovery"}, {"score": 0.010484032587658981, "phrase": "semantic_overlay"}, {"score": 0.0038154673253945003, "phrase": "web_services"}, {"score": 0.0035887342563437935, "phrase": "key_role"}, {"score": 0.002913650880082273, "phrase": "service_semantic_overlay_architecture"}, {"score": 0.002673957615079041, "phrase": "service_resources"}, {"score": 0.0025615908073796027, "phrase": "semantic_web_service_superiority"}, {"score": 0.002409188797323273, "phrase": "service_semantic_model"}, {"score": 0.002183938718432764, "phrase": "service_semantic_overlay"}, {"score": 0.0021049977753042253, "phrase": "peer's_service_repository"}], "paper_keywords": ["information search and retrieval", " intelligent web services", " semantic web", " knowledge management"], "paper_abstract": "Service Oriented Architecture (SOA) and Peer-to-Peer (P2P) computing share many common characteristics. It is believed that the combination of the two emerging techniques is a very promising method in promoting the web services (WS). Because the service discovery plays a key role in the integration, here a P2P-based framework to manage the knowledge of service and locating services is proposed. In this paper, the details of the principle, constructing and maintaining of service semantic overlay architecture have been described, and the way how the semantic overlay facilitates discovery of service resources is illustrated. To enable the semantic web service superiority, Service Ontology, which is considered as the service semantic model, is employed to depict service. The service discovery includes two phases: searching on the service semantic overlay; and local discovery in peer's service repository. Various solutions have been proposed to realize those two phases. Furthermore, tests are carried out to evaluate service discovery on the architecture.", "paper_title": "Facilitating service discovery with semantic overlay", "paper_id": "WOS:000239255200016"}