{"auto_keywords": [{"score": 0.040179907029343674, "phrase": "carp"}, {"score": 0.004652016085325825, "phrase": "np-hard_combinatorial_optimization_problem"}, {"score": 0.004520438007604407, "phrase": "undirected_graph"}, {"score": 0.004317576641196539, "phrase": "minimum_cost_set"}, {"score": 0.0040767015025213625, "phrase": "positive_demand"}, {"score": 0.004030157055463817, "phrase": "capacity_constraints"}, {"score": 0.0036763623220059933, "phrase": "ocarp"}, {"score": 0.0031845067058084613, "phrase": "new_integer_linear_programming_formulation"}, {"score": 0.0029552551661591988, "phrase": "reactive_path-scanning_heuristic"}, {"score": 0.0028715299874549245, "phrase": "cost-demand_edge-selection"}, {"score": 0.002268441347979241, "phrase": "first_lower_and_upper_bounds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Arc routing", " Computational complexity", " Path-scanning heuristic"], "paper_abstract": "The Open Capacitated Arc Routing Problem (OCARP) is a NP-hard combinatorial optimization problem where, given an undirected graph, the objective is to find a minimum cost set of tours that services a subset of edges with positive demand under capacity constraints. This problem is related to the Capacitated Arc Routing Problem (CARP) but differs from it since OCARP does not consider a depot, and tours are not constrained to form cycles. Applications to OCARP from literature are discussed. A new integer linear programming formulation is given, followed by some properties of the problem. A reactive path-scanning heuristic, guided by a cost-demand edge-selection and ellipse rules, is proposed and compared with other successful CARP path-scanning heuristics from literature. Computational tests were conducted using a set of 411 instances, divided into three classes according to the tightness of the number of vehicles available; results reveal the first lower and upper bounds, allowing to prove optimality for 133 instances. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The open capacitated arc routing problem", "paper_id": "WOS:000289604700009"}