{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dag_data"}, {"score": 0.04315880828482172, "phrase": "association_rules"}, {"score": 0.026033701006803824, "phrase": "predecessor-successor_rules"}, {"score": 0.00476697427418509, "phrase": "data_mining"}, {"score": 0.004040688646993609, "phrase": "large_amount"}, {"score": 0.003729335910488339, "phrase": "directed_acyclic_graph"}, {"score": 0.00354700018079049, "phrase": "hidden_knowledge"}, {"score": 0.00327356326590461, "phrase": "family_genealogy_profiles"}, {"score": 0.003240895431893266, "phrase": "product_structures"}, {"score": 0.002931569771634119, "phrase": "new_kind"}, {"score": 0.002902304851882577, "phrase": "association_rule"}, {"score": 0.002873331232538783, "phrase": "dag_databases"}, {"score": 0.0027327327233891865, "phrase": "node_x"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Data mining extracts implicit, previously unknown, and potentially useful information from databases. Many approaches have been proposed to extract information, and one of the most important ones is finding association rules. Although a large amount of research has been devoted to this subject, none of it finds association rules from directed acyclic graph (DAG) data. Without such a mining method, the hidden knowledge, if any, cannot be discovered from the databases storing DAG data such as family genealogy profiles, product structures, XML documents, task precedence relations, and course structures. In this article, we define a new kind of association rule in DAG databases called the predecessor-successor rule, where a node x is a predecessor of another node y if we can find a path in DAG where x appears before y. The predecessor-successor rules enable us to observe how the characteristics of the predecessors influence the successors. An approach containing four stages is proposed to discover the predecessor-successor rules. (c) 2006 Wiley Periodicals, Inc.", "paper_title": "Mining predecessor-successor rules from DAG data", "paper_id": "WOS:000237675300005"}