{"auto_keywords": [{"score": 0.04564244721554724, "phrase": "qoe"}, {"score": 0.043127505273167596, "phrase": "carim"}, {"score": 0.015140583317928913, "phrase": "mobile_environments"}, {"score": 0.012598785862285753, "phrase": "mobile_scenarios"}, {"score": 0.004823848351718167, "phrase": "context"}, {"score": 0.004519908617935935, "phrase": "novel_approach"}, {"score": 0.004154332348800334, "phrase": "ratings_interaction_model"}, {"score": 0.004050514095922329, "phrase": "open_questions"}, {"score": 0.003965975628742746, "phrase": "user_experiences"}, {"score": 0.0037543106253910313, "phrase": "different_qoe_records"}, {"score": 0.003131178497790961, "phrase": "uniform_representation"}, {"score": 0.003078740573398959, "phrase": "dynamic_analysis"}, {"score": 0.002914288956035066, "phrase": "different_interaction_records"}, {"score": 0.0028293966058473476, "phrase": "context-_and_qoe-based_decisions"}, {"score": 0.002689564715486338, "phrase": "better_experience"}, {"score": 0.00257831812581194, "phrase": "unified_criteria"}, {"score": 0.002271372252250557, "phrase": "real_users"}, {"score": 0.0022238834225283594, "phrase": "user_behavior_hypotheses"}, {"score": 0.0021049977753042253, "phrase": "mobile_applications"}], "paper_keywords": [""], "paper_abstract": "This article describes a novel approach to model the quality of experience (QoE) of users in mobile environments. The context-aware and ratings interaction model (CARIM) addresses the open questions of how to quantify user experiences from the analysis of interaction in mobile scenarios, and how to compare different QoE records to each other. A set of parameters are used to dynamically describe the interaction between the user and the system, the context in which it is performed and the perceived quality of users. CARIM structures these parameters into a uniform representation, supporting the dynamic analysis of interaction to determine QoE of users and enabling the comparison between different interaction records. Its run-time nature allows applications to make context- and QoE-based decisions in real time to adapt themselves, and thus provide a better experience to users. As a result, CARIM provides unified criteria for the inference and analysis of QoE in mobile scenarios. Its design and implementation can be integrated (and easily extended if needed) into many different development environments. An experiment with real users comparing two different interaction designs and validating user behavior hypotheses proved the effectiveness of applying CARIM for the assessment of QoE in mobile applications.", "paper_title": "A Context-Aware Interaction Model for the Analysis of Users' QoE in Mobile Environments", "paper_id": "WOS:000343217800002"}