{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "approximate_folding_landscapes"}, {"score": 0.04220229729764972, "phrase": "folding_process"}, {"score": 0.03551850183005748, "phrase": "population_kinetics"}, {"score": 0.02986025230798369, "phrase": "tryptophan_residues"}, {"score": 0.004735651915966323, "phrase": "protein_motions"}, {"score": 0.004677032188041644, "phrase": "essential_role"}, {"score": 0.004599994523941615, "phrase": "lab_studies"}, {"score": 0.004146327465630697, "phrase": "native_state"}, {"score": 0.004112020122418323, "phrase": "kinetic_metrics"}, {"score": 0.004077995480957875, "phrase": "quantifiable_measurements"}, {"score": 0.0038157022294338454, "phrase": "wild-type_protein"}, {"score": 0.0034967818541774844, "phrase": "monte_carlo"}, {"score": 0.003424850089214916, "phrase": "protein_kinetics"}, {"score": 0.0033964919992320024, "phrase": "folding_rates"}, {"score": 0.00284034646798833, "phrase": "structure_formation"}, {"score": 0.002690820958068933, "phrase": "circular_dichroism"}, {"score": 0.002646412155387084, "phrase": "spectra_analysis_and_tryptophan_fluorescence_experiments"}, {"score": 0.002591927716261631, "phrase": "approximated_landscape_models"}, {"score": 0.0025070703395635133, "phrase": "protein_conformations"}, {"score": 0.0023261372216194383, "phrase": "traditional_master_equation"}, {"score": 0.002306855521822739, "phrase": "monte_carlo_simulation"}, {"score": 0.0021944684609599245, "phrase": "full-length_detailed_protein_models"}, {"score": 0.0021049977753042253, "phrase": "known_experimental_results"}], "paper_keywords": [""], "paper_abstract": "Motivation: Protein motions play an essential role in many biochemical processes. Lab studies often quantify these motions in terms of their kinetics such as the speed at which a protein folds or the population of certain interesting states like the native state. Kinetic metrics give quantifiable measurements of the folding process that can be compared across a group of proteins such as a wild-type protein and its mutants. Results: We present two new techniques, map-based master equation solution and map-based Monte Carlo simulation, to study protein kinetics through folding rates and population kinetics from approximate folding landscapes, models called maps. From these two new techniques, interesting metrics that describe the folding process, such as reaction coordinates, can also be studied. In this article we focus on two metrics, formation of helices and structure formation around tryptophan residues. These two metrics are often studied in the lab through circular dichroism ( CD) spectra analysis and tryptophan fluorescence experiments, respectively. The approximated landscape models we use here are the maps of protein conformations and their associated transitions that we have presented and validated previously. In contrast to other methods such as the traditional master equation and Monte Carlo simulation, our techniques are both fast and can easily be computed for full-length detailed protein models. We validate our map-based kinetics techniques by comparing folding rates to known experimental results. We also look in depth at the population kinetics, helix formation and structure near tryptophan residues for a variety of proteins.", "paper_title": "Kinetics analysis methods for approximate folding landscapes", "paper_id": "WOS:000248620400087"}