{"auto_keywords": [{"score": 0.030356301219378365, "phrase": "manipulative_trading"}, {"score": 0.00481495049065317, "phrase": "widely_held_belief"}, {"score": 0.0047057084749407485, "phrase": "stock_prices"}, {"score": 0.004641351004344458, "phrase": "seasoned_equity_offerings"}, {"score": 0.004253618550301311, "phrase": "significant_evidence"}, {"score": 0.0035395987202335223, "phrase": "previous_empirical_evidence"}, {"score": 0.0035072146967082083, "phrase": "previous_literature"}, {"score": 0.0032886494232010847, "phrase": "gerard"}, {"score": 0.0032585509350066687, "phrase": "nanda"}, {"score": 0.002999749669403939, "phrase": "real_world"}, {"score": 0.0027741761880779535, "phrase": "securities_and_exchange_commission"}, {"score": 0.002748899285508913, "phrase": "sec"}, {"score": 0.0025655216052760093, "phrase": "seo_discount"}, {"score": 0.002472822097373027, "phrase": "previous_literature_delineating_methodology"}, {"score": 0.002427732996314194, "phrase": "seo_discount_change"}, {"score": 0.0022347698358650514, "phrase": "undervalued_firms"}, {"score": 0.0021342613107011624, "phrase": "stock_price_informativeness"}, {"score": 0.0021049977753042253, "phrase": "overvalued_firms"}], "paper_keywords": ["Seasoned equity offering", " informed investor", " manipulative trading", " equilibrium"], "paper_abstract": "There exists a widely held belief that informed investors manipulate stock prices prior to seasoned equity offerings (SEO). Contrary to this assertion, a model is developed, which demonstrates there is significant evidence that informed investors not to manipulate trading prior to a SEO. Furthermore, there is an arguement that informed investors to trade the stock in the same direction indicated by their private information. In addition, the model is consistent with previous empirical evidence. Previous literature heavily relies on the Gerard and Nanda (1993) model. The model allows for more than one informed investors, whereas Gerard and Nanda de facto allows for only one. This model setting is not only more realistic to the real world, but also dramatically reverses its conclusion that there exists manipulative trading. It also indicated that following Securities and Exchange Commission (SEC) Rule 10b-21 and Rule 105, whose intention is to curb this manipulation, the SEO discount will change in either direction. Thus previous literature delineating methodology of utilizing the SEO discount change to test for the existence of manipulative trading is not well grounded. The model also predicts that undervalued firms tend to disclose more information in order to improve the stock price informativeness, whereas overvalued firms tend to do the contrary.", "paper_title": "MANIPULATION AND EQUILIBRIUM AROUND SEASONED EQUITY OFFERINGS", "paper_id": "WOS:000294612300002"}