{"auto_keywords": [{"score": 0.034102752921677, "phrase": "complexity_management"}, {"score": 0.00481495049065317, "phrase": "irish_eco-village"}, {"score": 0.004776297980616768, "phrase": "purpose_-_the_purpose"}, {"score": 0.0045876189888390895, "phrase": "recent_research"}, {"score": 0.00421520166010848, "phrase": "methodological_and_epistemological_issues"}, {"score": 0.003935892934907777, "phrase": "recent_research_findings"}, {"score": 0.003765067028482197, "phrase": "complexity_approaches"}, {"score": 0.0036898803847106023, "phrase": "methodological_framework"}, {"score": 0.00363080961099728, "phrase": "action_research"}, {"score": 0.003515479934694842, "phrase": "european_eco-community"}, {"score": 0.0031398318568608505, "phrase": "s._beer"}, {"score": 0.0029913511336659327, "phrase": "complex_adaptive_systems"}, {"score": 0.002838387600282891, "phrase": "organisational_dynamics"}, {"score": 0.0028042108531816943, "phrase": "structural_changes"}, {"score": 0.002759279370360986, "phrase": "community_members"}, {"score": 0.0027370835853738626, "phrase": "interesting_insights"}, {"score": 0.0025658094607383646, "phrase": "multi-methodological_approaches"}, {"score": 0.0023381630439887184, "phrase": "theoretical_frameworks"}, {"score": 0.0023099954987126, "phrase": "broader_research"}, {"score": 0.002263799931018574, "phrase": "wide_variety"}, {"score": 0.002182958452794581, "phrase": "organisational_transformations"}, {"score": 0.0021566565951738658, "phrase": "networking_management"}], "paper_keywords": ["Cybernetics", " Ireland", " Systems analysis", " Social networks", " Communities"], "paper_abstract": "Purpose - The purpose of this paper is to reflect on results of recent research about the self-organisation (SO) of communities that aim to regenerate and/or improve their sustainability, also to reflect upon methodological and epistemological issues related to the application of complexity approaches to support SO in communities and in general, social enterprises. Design/methodology/approach - The paper summarises recent research findings on SO and self-transformation in communities using a combination of complexity approaches. It describes the methodological framework used to conduct action research about the self-transformation and learning of a European eco-community and reflects about the approaches used and lessons learned. Findings - This research confirms the complementarity between two approaches to complexity management: the viable systems model from S. Beer, a pioneering approach to managing complexity in institutions, and complex adaptive systems, a more recent approach to deal with SO in organisations. Mapping the organisational dynamics and the structural changes decided by the community members shows interesting insights about emergence and SO. This is a state-of-the-art research on multi-methodological approaches to support complexity management in organisations. Originality/value - As in many action research projects, early findings are limited to one particular organisation. Nevertheless, the theoretical frameworks of the broader research are useful for a wide variety of organisations, both in terms of guiding organisational transformations and supporting networking management of networks collaborating to create more sustainable evolutionary pathways.", "paper_title": "Complexity approaches to self-organisation: a case study from an Irish eco-village", "paper_id": "WOS:000293669700013"}