{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "turn-taking_cues"}, {"score": 0.006842017926260374, "phrase": "synthetic_voice"}, {"score": 0.004778594263962987, "phrase": "human_and_synthetic_voice"}, {"score": 0.004724571550328985, "phrase": "previous_line"}, {"score": 0.004600870784042767, "phrase": "appropriate_places"}, {"score": 0.004429727701202369, "phrase": "preceding_speaker"}, {"score": 0.004248782702870078, "phrase": "additive_effect"}, {"score": 0.00421668332357505, "phrase": "listeners'_turn-taking_attempts"}, {"score": 0.00362308996613223, "phrase": "human_voice"}, {"score": 0.0030775481952377017, "phrase": "lexical_repetitions"}, {"score": 0.0028309318332306703, "phrase": "corresponding_human_version"}, {"score": 0.0027566738323014, "phrase": "reaction_times"}, {"score": 0.00265394824073552, "phrase": "duncan's_findings"}, {"score": 0.002386181960126766, "phrase": "expected_outcome"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Turn-taking", " Speech synthesis", " Human-like interaction", " Conversational interfaces"], "paper_abstract": "A previous line of research suggests that interlocutors identify appropriate places to speak by cues in the behaviour of the preceding speaker. If used in combination, these cues have an additive effect on listeners' turn-taking attempts. The present study further explores these findings by examining the effect of such turn-taking cues experimentally. The objective is to investigate the possibilities of generating turn-taking cues with a synthetic voice. Thus, in addition to stimuli realized with a human voice, the experiment included dialogues where one of the speakers is replaced with a synthesis. The turn-taking cues investigated include intonation, phrase-final lengthening, semantic completeness, stereotyped lexical expressions and non-lexical speech production phenomena such as lexical repetitions, breathing and lip-smacks. The results show that the turn-taking cues realized with a synthetic voice affect the judgements similar to the corresponding human version and there is no difference in reaction times between these two conditions. Furthermore, the results support Duncan's findings: the more turn-taking cues with the same pragmatic function, turn-yielding or turn-holding, the higher the agreement among subjects on the expected outcome. In addition, the number of turn-taking cues affects the reaction times for these decisions. Thus, the more cues, the faster the reaction time. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "The additive effect of turn-taking cues in human and synthetic voice", "paper_id": "WOS:000285663700003"}