{"auto_keywords": [{"score": 0.03660909854594217, "phrase": "cremofac"}, {"score": 0.034407466506535825, "phrase": "chromatin-remodeling_factors"}, {"score": 0.00481495049065317, "phrase": "chromatin_remodeling_factors"}, {"score": 0.004622783000449884, "phrase": "important_event"}, {"score": 0.004542780650208743, "phrase": "eukaryotic_nucleus"}, {"score": 0.004490212943845175, "phrase": "nucleosomal_dna"}, {"score": 0.004361428012479218, "phrase": "remodeling_factors"}, {"score": 0.0042859292226559535, "phrase": "dynamic_nature"}, {"score": 0.004114787982556699, "phrase": "collective_action"}, {"score": 0.0029694040368299624, "phrase": "comprehensive_search"}, {"score": 0.00280126189041041, "phrase": "in-depth_information"}, {"score": 0.002435453488008121, "phrase": "phylogenetic_relationships"}, {"score": 0.0022708315711029423, "phrase": "central_repository"}], "paper_keywords": [""], "paper_abstract": "Motivation: Chromatin-remodeling is an important event in the eukaryotic nucleus rendering nucleosomal DNA accessible for various transaction processes. Remodeling Factors facilitate the dynamic nature of chromatin through participation of the collective action of (i) ATP and (ii) Non-ATP dependent factors. Considering the importance of these factors in eukaryotes, we have developed, CREMOFAC, a dedicated and frequently updated web-database for chromatin-remodeling factors. Results: The database harbors factors from 49 different organisms reported in literature and facilitates a comprehensive search for them. In addition, it also provides in-depth information for the factors reported in the three widely studied mammals namely, human, mouse and rat. Further, information on literature, pathways and phylogenetic relationships has also been covered. The development of CREMOFAC as a central repository for chromatin-remodeling factors and the absence of such a pre-existing database heighten its utility thus making its presence indispensable.", "paper_title": "CREMOFAC- a database of chromatin remodeling factors", "paper_id": "WOS:000242246300016"}