{"auto_keywords": [{"score": 0.020242667985317098, "phrase": "health_informatics"}, {"score": 0.008166784661886296, "phrase": "school"}, {"score": 0.004719664411221952, "phrase": "integrative_model"}, {"score": 0.004688321299229397, "phrase": "health_informatics_education"}, {"score": 0.004549821572786755, "phrase": "increasing_need"}, {"score": 0.0045196012587080114, "phrase": "well_qualified_health_informatics_practitioners"}, {"score": 0.0042281749832498, "phrase": "educational_programs"}, {"score": 0.004144452614362445, "phrase": "school's_objective"}, {"score": 0.003813017794036879, "phrase": "health_care_systems"}, {"score": 0.0036269721030245507, "phrase": "integrated_\"holistic\"_approach"}, {"score": 0.003438483411236772, "phrase": "interdisciplinary_skills"}, {"score": 0.003359119985242403, "phrase": "pro_cess"}, {"score": 0.003314591878914152, "phrase": "key_stakeholders"}, {"score": 0.003131818247415968, "phrase": "distributed_msc_degree_program"}, {"score": 0.0030391594477173485, "phrase": "collaborating_canadian_universities"}, {"score": 0.0027131212233443137, "phrase": "core_undergraduate_curriculum"}, {"score": 0.00255488432062653, "phrase": "distributed_msc_program"}, {"score": 0.002430076037416881, "phrase": "dispersed_geographical_locations"}, {"score": 0.00241392746999738, "phrase": "canada"}, {"score": 0.00235813005446246, "phrase": "health_information_science"}, {"score": 0.002295964130868963, "phrase": "unique_i_interdisciplinary_education"}, {"score": 0.0021910825909008946, "phrase": "integrated_education"}, {"score": 0.0021404485085209143, "phrase": "new_areas"}, {"score": 0.0021191072118924067, "phrase": "distance_education"}, {"score": 0.0021049977753042253, "phrase": "cross-canadian_collaborations"}], "paper_keywords": ["health information science", " health informatics", " education", " training", " distance education"], "paper_abstract": "Objectives: There is an increasing need for well qualified health informatics practitioners and for educational programs that produce them. Since 1981, the School of Health Information Science at the University of Victoria has delivered a range of educational programs,in health informatics. The School's objective has been to produce graduates who can assume a range of roles in health informatics, including managers, developers, researchers and evaluators of health care systems. Methods, The approach taken by the School has been to provide an integrated \"holistic\" approach to health informatics education that balances both theory and practice. The curriculum has emphasized interdisciplinary skills and has been based on a pro cess of consultation with key stakeholders in both industry and academia. In addition, several now distance collaborative models for health informatics education (including a distributed MSc degree program) have been recently initiated through the University of Victoria with collaborating Canadian universities. Results, To date, graduates of the programs offered have become highly sought after, with the demand for graduates of the programs continually exceeding the number of graduates. The core undergraduate curriculum has recently been undergone refinement to include training in now emerging areas of health informatics. In addition, a distributed MSc program has been successfully initiated by the School, currently with 23 student participating from dispersed geographical locations across Canada. Conclusions: The School of Health Information Science at the University of Victoria has been involved in providing unique i interdisciplinary education in health informatics for over twenty years. The School continues to maintain its emphasis on integrated education, refining it curriculum and moving into new areas such as distance education and cross-Canadian collaborations.", "paper_title": "The School of Health Information Science at the University of Victoria: Towards an integrative model for health informatics education and research", "paper_id": "WOS:000242775200025"}