{"auto_keywords": [{"score": 0.035544412132803634, "phrase": "composite_annotations"}, {"score": 0.011622685973312933, "phrase": "multiple_reference_ontologies"}, {"score": 0.00481495049065317, "phrase": "biosimulation_models"}, {"score": 0.004668059458774745, "phrase": "rich_set"}, {"score": 0.004549063619065006, "phrase": "detailed_semantics"}, {"score": 0.00450231514359539, "phrase": "biological_entities"}, {"score": 0.004145143433523008, "phrase": "single_source_ontology"}, {"score": 0.0040186038781533946, "phrase": "biological_phenomena"}, {"score": 0.0038959121068990517, "phrase": "physiological_biosimulation_models"}, {"score": 0.0033190180867511605, "phrase": "multiple_ontologies"}, {"score": 0.0032510690712452147, "phrase": "physics-based_meaning"}, {"score": 0.0031032109441552287, "phrase": "semantic_expressivity"}, {"score": 0.0030239842475439814, "phrase": "often-complex_features"}, {"score": 0.002841971477743441, "phrase": "model_merging"}, {"score": 0.0025493457404304446, "phrase": "semgen"}, {"score": 0.0023711591828229736, "phrase": "orthogonal_reference_ontologies"}, {"score": 0.002126907587540404, "phrase": "semgen_tool"}], "paper_keywords": ["Biomedical ontology", " Biosimulation", " Annotation", " Computer simulation"], "paper_abstract": "There now exists a rich set of ontologies that provide detailed semantics for biological entities of interest. However, there is not (nor should there be) a single source ontology that provides all the necessary semantics for describing biological phenomena. In the domain of physiological biosimulation models, researchers use annotations to convey semantics, and many of these annotations require the use of multiple reference ontologies. Therefore, we have developed the idea of composite annotations that access multiple ontologies to capture the physics-based meaning of model variables. These composite annotations provide the semantic expressivity needed to disambiguate the often-complex features of biosimulation models, and can be used to assist with model merging and interoperability. In this paper, we demonstrate the utility of composite annotations for model merging by describing their use within SemGen, our semantics-based model composition software. More broadly, if orthogonal reference ontologies are to meet their full potential, users need tools and methods to connect and link these ontologies. Our composite annotations and the SemGen tool provide one mechanism for leveraging multiple reference ontologies. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Multiple ontologies in action: Composite annotations for biosimulation models", "paper_id": "WOS:000288289900016"}