{"auto_keywords": [{"score": 0.03493800030657344, "phrase": "information_infrastructures"}, {"score": 0.004815021286812087, "phrase": "infrastructures"}, {"score": 0.004640079189342692, "phrase": "cscw_field"}, {"score": 0.004545675105321216, "phrase": "open-ended_agenda"}, {"score": 0.004489952932659799, "phrase": "continuing_commitment"}, {"score": 0.004416713079266374, "phrase": "different_contexts"}, {"score": 0.0041696157492057, "phrase": "major_cscw_outlets"}, {"score": 0.00405127920820053, "phrase": "particular_forms"}, {"score": 0.004018087343963485, "phrase": "cooperative_work"}, {"score": 0.0038403151693333017, "phrase": "'localist_studies"}, {"score": 0.0037621210719690594, "phrase": "particular_settings"}, {"score": 0.0034083145672246067, "phrase": "integrated_and_interconnected_workplace_information_technologies"}, {"score": 0.0031779621378253534, "phrase": "cscw"}, {"score": 0.0027856252557826467, "phrase": "greater_cscw_attention"}, {"score": 0.0025130460190930554, "phrase": "non-local_constraints"}, {"score": 0.0021049977753042253, "phrase": "previous_studies"}], "paper_keywords": ["Infrastructures", " Ethnography", " Localist", " CSCW"], "paper_abstract": "In their initial articulation of the direction of the CSCW field, scholars advanced an open-ended agenda. This continuing commitment to open-ness to different contexts and approaches is not, however, reflected in the contents of the major CSCW outlets. The field appears to privilege particular forms of cooperative work. We find many examples of what could be described as 'localist studies', restricted to particular settings and timeframes. This focus on the 'here and now' is particularly problematic when one considers the kinds of large-scale, integrated and interconnected workplace information technologies-or what we are calling Information Infrastructures-increasingly found within and across organisations today. CSCW appears unable (or unwilling) to grapple with these technologies-which were at the outset envisaged as falling within the scope of the field. Our paper hopes to facilitate greater CSCW attention to Information Infrastructures through offering a re-conceptualisation of the role and nature of 'design'. Design within an Information Infrastructures perspective needs to accommodate non-local constraints. We discuss two such forms of constraint: standardisation (how local fitting entails unfitting at other sites) and embeddedness (the entanglement of one technology with other apparently unrelated ones). We illustrate these themes through introducing case material drawn on from a number of previous studies.", "paper_title": "From Artefacts to Infrastructures", "paper_id": "WOS:000324272400006"}