{"auto_keywords": [{"score": 0.04906531875041212, "phrase": "legal_and_forensic_medicine"}, {"score": 0.04501851799576053, "phrase": "spanish_universities"}, {"score": 0.04095180159873686, "phrase": "spanish_university_teacher"}, {"score": 0.00481495049065317, "phrase": "spanish_university_scientific_output"}, {"score": 0.004363401436068803, "phrase": "international_readership"}, {"score": 0.004216436047843637, "phrase": "legal"}, {"score": 0.0040223714916651845, "phrase": "medline_data_base"}, {"score": 0.003971006689166329, "phrase": "analyse_research_articles"}, {"score": 0.003274499008699115, "phrase": "spanish_author"}, {"score": 0.002842428606954139, "phrase": "english_language_scientific_journals"}, {"score": 0.0028060889647071787, "phrase": "preferred_channel"}, {"score": 0.0024884913795612707, "phrase": "english_journals"}, {"score": 0.002373767863833987, "phrase": "spanish_journals"}, {"score": 0.0023233800372985686, "phrase": "close_relationship"}, {"score": 0.002274059352027922, "phrase": "authority_index"}, {"score": 0.002254624822004988, "phrase": "inter-institutional_co-operation"}, {"score": 0.0021049977753042253, "phrase": "published_paper"}], "paper_keywords": [""], "paper_abstract": "We set out to analyse and quantify the papers published (for an international readership) by Spanish universities in the field of Legal and Forensic Medicine. For this, we used the MEDLINE data base, to analyse research articles in which a Spanish university teacher (whose sole employment was with a university, as registered by the Ministry of Education in July 2005, (n = 67), appeared as author or co-author in this field. The years covered are 1952 (First year that a Spanish author appears for an article on Legal and Forensic Medicine in this service) to July 2005. A total of 770 articles were counted; the productivity in this area was increasing substantially from the 1980's onwards. English language scientific journals were the preferred channel of communication. Slightly more than 85% of the works can be classified into four themes, of which Genetics is the most prolific. The number of papers published in English journals represented 84% of the total and only 13% was published in Spanish journals. There was a close relationship between growth in the authority index and inter-institutional co-operation, which boosted the production of articles. When at least one of the authorship of a published paper was a Spanish university teacher, the research was led by a university in 62.4% of cases, and of this 85.6% were Spanish universities.", "paper_title": "Quantitative analysis of Spanish university scientific output in the area of Legal and Forensic Medicine: International exposure", "paper_id": "WOS:000263155900001"}