{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "specialty_care"}, {"score": 0.004630055463858585, "phrase": "electronic_health_records"}, {"score": 0.00454027551702508, "phrase": "great_potential"}, {"score": 0.004181743040532619, "phrase": "key_concern"}, {"score": 0.0038363485899400285, "phrase": "primary_care"}, {"score": 0.0036457672198249333, "phrase": "specialists'_time"}, {"score": 0.003397362086358944, "phrase": "physician_time"}, {"score": 0.0033314049082500794, "phrase": "integrated_delivery_system"}, {"score": 0.003128798520531889, "phrase": "time-motion_method"}, {"score": 0.002973261772253616, "phrase": "attending_physicians"}, {"score": 0.0028701222153940283, "phrase": "paper_records"}, {"score": 0.0028365413717574544, "phrase": "web-based_ambulatory_ehr._across"}, {"score": 0.0026954938318408464, "phrase": "paper-based_records"}, {"score": 0.0025715131759585052, "phrase": "ehr_implementation"}, {"score": 0.002541417196444962, "phrase": "average_adjusted_total_time"}, {"score": 0.0021215910859085146, "phrase": "overall_visit_time"}, {"score": 0.0021049977753042253, "phrase": "specialty_clinics"}], "paper_keywords": [""], "paper_abstract": "Background: Electronic health records (EHRs) have great potential to improve safety, quality, and efficiency in medicine. However, adoption has been slow, and a key concern has been that clinicians will require more time to complete their work using EHRs. Most previous studies addressing this issue have been done in primary care. Objective: To assess the impact of using an EHR on specialists' time. Design: Prospective, before-after trial of the impact of an EHR on attending physician time in four specialty clinics at an integrated delivery system: cardiology, dermatology, endocrine, and pain. Measurements: We used a time-motion method to measure physician time spent in one of 85 designated activities. Results: Attending physicians were monitored before and after the switch from paper records to a web-based ambulatory EHR. Across all specialties, 15 physicians were observed treating 157 patients while still using paper-based records, and 15 physicians were observed treating 146 patients after adoption. Following EHR implementation, the average adjusted total time spent per patient across all specialties increased slightly but not significantly (Delta = 0.94 min., p = 0.83) from 28.8 (SE = 3.6) to 29.8 (SE = 3.6) min. Conclusion: These data suggest that implementation of an EHR had little effect on overall visit time in specialty clinics.", "paper_title": "Electronic health records in specialty care: A time-motion study", "paper_id": "WOS:000249769700009"}