{"auto_keywords": [{"score": 0.04470188200853082, "phrase": "electronic_market"}, {"score": 0.00481495049065317, "phrase": "customer_privacy_concern"}, {"score": 0.004710306419574744, "phrase": "purpose_-_this"}, {"score": 0.004487989502479992, "phrase": "conceptual_delimitation"}, {"score": 0.004371160978838441, "phrase": "customer_concern"}, {"score": 0.0038309141193444015, "phrase": "main_proposals"}, {"score": 0.0037973594873521596, "phrase": "regards_dimensions"}, {"score": 0.0032697235411641695, "phrase": "construct's_dimensionality"}, {"score": 0.003198554193075258, "phrase": "aforementioned_literature_overview"}, {"score": 0.0031151864044353245, "phrase": "main_results"}, {"score": 0.002941913249957503, "phrase": "internet_construct"}, {"score": 0.0027417911324611917, "phrase": "different_contexts"}, {"score": 0.0025328377393370642, "phrase": "personal_information"}, {"score": 0.0024024377855956136, "phrase": "paper's_main_contributions"}, {"score": 0.0021049977753042253, "phrase": "different_situations"}], "paper_keywords": ["Internet", " privacy", " data security", " electronic commerce"], "paper_abstract": "Purpose - This study attempts to carry out an approximation both to the conceptual delimitation and to the measuring of customer concern for privacy on the electronic market. Design/methodology/approach - To complete the objective of this research, an overview of the literature is made in an attempt to summarise the main proposals as regards dimensions of the construct analysed. Furthermore, two studies were carried out with the aim of evaluating the instruments to measure concern for privacy on the internet and which support the conclusion concerning the construct's dimensionality, reached following the aforementioned literature overview. Findings - From the main results reached, we can highlight that the concern for privacy on the internet construct has a structure consisting of two dimensions, which are confirmed through the scales evaluated for different contexts of use of the internet. These dimensions are: concern for control over the collecting of personal information, and its use on the electronic market. Originality/value - The paper's main contributions are threefold: a conceptual revision of the construct; a proposal of the dimensions for the construct; and an evaluation of two scales to measure the construct in different situations.", "paper_title": "The dimensionality of customer privacy concern on the internet", "paper_id": "WOS:000249328100002"}