{"auto_keywords": [{"score": 0.014927135767070426, "phrase": "reputation_systems"}, {"score": 0.00466638177012212, "phrase": "digital"}, {"score": 0.004030449969901066, "phrase": "business-to-customer_contexts"}, {"score": 0.0038450179181069833, "phrase": "mainstream_acceptance"}, {"score": 0.0038049789989278463, "phrase": "business-to-business"}, {"score": 0.0034992667091713813, "phrase": "feedback_collection"}, {"score": 0.0032861588691414667, "phrase": "reputation_target"}, {"score": 0.003069867656852932, "phrase": "large_number"}, {"score": 0.0029131986574478046, "phrase": "wide_variation"}, {"score": 0.0028828348726682965, "phrase": "user_expertise"}, {"score": 0.0028527866590859967, "phrase": "feedback_forms"}, {"score": 0.002721388234661538, "phrase": "significant_negative_consequences"}, {"score": 0.002693018258362651, "phrase": "rating_accuracy"}, {"score": 0.0025960262223338293, "phrase": "expertise_prediction_algorithm"}, {"score": 0.0024634797027967203, "phrase": "target_business"}], "paper_keywords": ["Digital ecosystems", " Reputation systems", " Business-to-Business", " Collaborative filtering", " Trust"], "paper_abstract": "Digital ecosystems rely on reputation systems in order to build trust and to foster collaborations among users. Reputation systems are commonplace in the Customer-to-Customer and Business-to-Customer contexts, however, they have not yet found mainstream acceptance in Business-to-Business (B2B) environments. Our first contribution in this paper is to identify the particularities of feedback collection in B2B reputation systems. An issue that we identify is that the reputation target in the B2B context is a business, which requires evaluation on a large number of criteria. We observe that due to the wide variation in user expertise, feedback forms that require users to evaluate all criteria have significant negative consequences for rating accuracy. Our second contribution is to propose an expertise prediction algorithm for B2B reputation systems, which filters the criteria describing the target business such that each user rates only on those criteria that he has expertise in. Experiments based on our real dataset show that the algorithm accurately predicts the expertise of users in given criteria. The algorithm may also increase the motivation of users to submit feedback as well as the confidence of users in B2B reputation systems.", "paper_title": "Improving the accuracy of Business-to-Business (B2B) reputation systems through rater expertise prediction", "paper_id": "WOS:000347404700003"}