{"auto_keywords": [{"score": 0.03363896917055258, "phrase": "original_curve"}, {"score": 0.0047057084749407485, "phrase": "frechet_distance"}, {"score": 0.004243862930012258, "phrase": "natural_approach"}, {"score": 0.0041316803676012155, "phrase": "batched_outliers"}, {"score": 0.004007083686875716, "phrase": "minimum_frechet_distance"}, {"score": 0.003961330917648707, "phrase": "possible_such_shortcuts"}, {"score": 0.003585986761045987, "phrase": "new_algorithm"}, {"score": 0.0031360786664165093, "phrase": "line_segment"}, {"score": 0.0027741761880779535, "phrase": "optimal_approximation"}, {"score": 0.0027215202678634517, "phrase": "constant_factor"}, {"score": 0.0026393362602995254, "phrase": "polygonal_curve"}, {"score": 0.0026191799769765085, "phrase": "k_vertices"}, {"score": 0.002416589459425828, "phrase": "approximate_frechet_distance_queries"}, {"score": 0.002370704665003412, "phrase": "query_polygonal_curve"}, {"score": 0.0023435920614377306, "phrase": "query_time"}, {"score": 0.002272794656458419, "phrase": "query_curve"}, {"score": 0.0021049977753042253, "phrase": "first_data_structures"}], "paper_keywords": ["Frechet distance", " geometric similarity", " outliers", " approximation algorithms"], "paper_abstract": "The similarity of two polygonal curves can be measured using the Frechet distance. We introduce the notion of a more robust Frechet distance, where one is allowed to shortcut between vertices of one of the curves. This is a natural approach for handling noise, in particular batched outliers. We compute a (3 + epsilon)-approximation to the minimum Frechet distance over all possible such shortcuts, in near linear time, if the curve is c-packed and the number of shortcuts is either small or unbounded. To facilitate the new algorithm we develop several new tools: (a) a data structure for preprocessing a curve (not necessarily c-packed) that supports (1 + epsilon)-approximate Frechet distance queries between a subcurve (of the original curve) and a line segment; (b) a near linear time algorithm that computes a permutation of the vertices of a curve, such that any prefix of 2k - 1 vertices of this permutation forms an optimal approximation (up to a constant factor) to the original curve compared to any polygonal curve with k vertices, for any k > 0; and (c) a data structure for preprocessing a curve that supports approximate Frechet distance queries between a subcurve and query polygonal curve. The query time depends quadratically on the complexity of the query curve and only (roughly) logarithmically on the complexity of the original curve. To our knowledge, these are the first data structures to support these kind of queries efficiently.", "paper_title": "JAYWALKING YOUR DOG: COMPUTING THE FRECHET DISTANCE WITH SHORTCUTS", "paper_id": "WOS:000328889100003"}