{"auto_keywords": [{"score": 0.0046593017130868, "phrase": "data_integration_field"}, {"score": 0.004551199992546761, "phrase": "rigorous_empirical_evaluations"}, {"score": 0.004508661664944657, "phrase": "research_ideas"}, {"score": 0.004342430078306461, "phrase": "major_roadblock"}, {"score": 0.004201991568145053, "phrase": "comprehensive_metadata_generators"}, {"score": 0.004028054020045027, "phrase": "different_integration_tasks"}, {"score": 0.0038794730876377057, "phrase": "integration_solutions"}, {"score": 0.0034332736827447654, "phrase": "integration_tasks"}, {"score": 0.0030097975788892896, "phrase": "meta_data"}, {"score": 0.002675914969626753, "phrase": "realistic_scenarios"}, {"score": 0.002650857539177183, "phrase": "different_characteristics"}, {"score": 0.002470237978694949, "phrase": "intricate_control"}, {"score": 0.0024128022009415476, "phrase": "metadata_scenarios"}, {"score": 0.0023789822182914877, "phrase": "new_and_important_empirical_insights"}, {"score": 0.0021450029487459403, "phrase": "empirical_evaluation"}, {"score": 0.0021049977753042253, "phrase": "data_integration_systems"}], "paper_keywords": [""], "paper_abstract": "Given the maturity of the data integration field it is surprising that rigorous empirical evaluations of research ideas are so scarce. We identify a major roadblock for empirical work- the lack of comprehensive metadata generators that can be used to create benchmarks for different integration tasks. This makes it difficult to compare integration solutions, understand their generality, and understand their performance. We present iBench, the first metadata generator that can be used to evaluate a wide-range of integration tasks (data exchange, mapping creation, mapping composition, schema evolution, among many others). iBench permits control over the size and characteristics of the meta data it generates (schemas, constraints, and mappings). Our evaluation demonstrates that iBench can efficiently generate very large, complex, yet realistic scenarios with different characteristics. We also present an evaluation of three mapping creation systems using iBench and show that the intricate control that iBench provides over metadata scenarios can reveal new and important empirical insights. iBench is an open-source, extensible tool that we are providing to the community. We believe it will raise the bar for empirical evaluation and comparison of data integration systems.", "paper_title": "The iBench Integration Metadata Generator", "paper_id": "WOS:000386425900003"}