{"auto_keywords": [{"score": 0.04866694555848204, "phrase": "centinela"}, {"score": 0.009939649776188107, "phrase": "acceleration_data"}, {"score": 0.009821951008354824, "phrase": "vital_signs"}, {"score": 0.00481495049065317, "phrase": "vital_sign_data"}, {"score": 0.004375061788023814, "phrase": "highly_accurate_activity_recognition"}, {"score": 0.004271490815763164, "phrase": "five_activities"}, {"score": 0.003857871979942733, "phrase": "portable_and_unobtrusive_real-time_data_collection_platform"}, {"score": 0.003611751858608048, "phrase": "mobile_phone"}, {"score": 0.0031845067058084583, "phrase": "vital_sign_stabilization"}, {"score": 0.003109031770476385, "phrase": "eight_different_classifiers"}, {"score": 0.0028245516301681713, "phrase": "current_approaches"}, {"score": 0.002790867657645595, "phrase": "similar_conditions"}, {"score": 0.0023171750718791713, "phrase": "classification_accuracy"}, {"score": 0.0021050011192089513, "phrase": "elsevier"}], "paper_keywords": ["Feature extraction", " Classification", " Subject-independent analysis", " Transient features"], "paper_abstract": "This paper presents Centinela, a system that combines acceleration data with vital signs to achieve highly accurate activity recognition. Centinela recognizes five activities: walking, running, sitting, ascending, and descending. The system includes a portable and unobtrusive real-time data collection platform, which only requires a single sensing device and a mobile phone. To extract features, both statistical and structural detectors are applied, and two new features are proposed to discriminate among activities during periods of vital sign stabilization. After evaluating eight different classifiers and three different time window sizes, our results show that Centinela achieves up to 95.7% overall accuracy, which is higher than current approaches under similar conditions. Our results also indicate that vital signs are useful to discriminate between certain activities. Indeed, Centinela achieves 100% accuracy for activities such as running and sitting, and slightly improves the classification accuracy for ascending compared to the cases that utilize acceleration data only. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "Centinela: A human activity recognition system based on acceleration and vital sign data", "paper_id": "WOS:000308425900007"}