{"auto_keywords": [{"score": 0.03211942512231789, "phrase": "proposed_algorithm"}, {"score": 0.015411355512057627, "phrase": "multiple_traveling_salesman_problem"}, {"score": 0.014026098184460703, "phrase": "nmaco"}, {"score": 0.01361470737886886, "phrase": "mtsp"}, {"score": 0.004579780586951551, "phrase": "new_modified_version"}, {"score": 0.004060986196931943, "phrase": "effective_criterion"}, {"score": 0.00396050388346298, "phrase": "local_optimum_points"}, {"score": 0.003356675879109443, "phrase": "np-hard_problems"}, {"score": 0.003306559295382181, "phrase": "meta-heuristic_approaches"}, {"score": 0.0030823667846259836, "phrase": "classical_aco"}, {"score": 0.0029611289031152856, "phrase": "current_best_solution"}, {"score": 0.0029169007179202164, "phrase": "best_found_solution"}, {"score": 0.002816246391862638, "phrase": "new_state_transition_rule"}, {"score": 0.0027741761880779535, "phrase": "efficient_candidate_list"}, {"score": 0.0025219085140220773, "phrase": "standard_instances"}], "paper_keywords": ["Multiple Traveling Salesman Problem", " Ant Colony Optimization", " Updating Pheromone", " Combinatorial Optimization Problems"], "paper_abstract": "This article presents a new modified version of the ant colony optimization (ACO) mixed with insert, swap and 2-opt algorithm called NMACO for solving the multiple traveling salesman problem (MTSP) which utilizes an effective criterion for escaping from the local optimum points. The MTSP is one of the most important combinatorial optimization problems in which the objective is to minimize the distance traveled by several salesmen for servicing a set of nodes. Since this problem belongs to NP-hard Problems, some meta-heuristic approaches have been used to solve it in recent years. In contrast to the classical ACO, the proposed algorithm uses only a global updating for the current best solution and the best found solution until now. Furthermore, a new state transition rule and an efficient candidate list are used in order to assess the efficiency of the proposed algorithm. The proposed algorithm is tested on some standard instances available from the literature and their results were compared with other well-known meta-heuristic algorithms. The results indicate that the NMACO has been able to improve the efficiency of the ACO in all instances and is quite competitive with other meta-heuristic algorithms.", "paper_title": "Modification of the Ant Colony Optimization for Solving the Multiple Traveling Salesman Problem", "paper_id": "WOS:000328194800005"}