{"auto_keywords": [{"score": 0.012288368011015101, "phrase": "binding_hot_spots"}, {"score": 0.008147986959208762, "phrase": "hot_spot_residues"}, {"score": 0.00481495049065317, "phrase": "structural_analysis"}, {"score": 0.004764648644792333, "phrase": "hot_spots"}, {"score": 0.004350040802144489, "phrase": "substantial_mortality"}, {"score": 0.004229847379280629, "phrase": "new_surge"}, {"score": 0.004127394241838696, "phrase": "epitope_conservation"}, {"score": 0.0036382660173943393, "phrase": "antibody_cross-neutralization"}, {"score": 0.0035625556447293804, "phrase": "predictive_methods"}, {"score": 0.0034884152484429207, "phrase": "epitope_sites"}, {"score": 0.0034038593017883295, "phrase": "paratope_sites"}, {"score": 0.00329813918116714, "phrase": "six_mutations"}, {"score": 0.0030747771905143273, "phrase": "free_energy"}, {"score": 0.002607464886544904, "phrase": "common_hot_spots"}, {"score": 0.0024651215047303593, "phrase": "mutation_candidates"}, {"score": 0.0023968838023247533, "phrase": "immune_system"}, {"score": 0.0023551955270737215, "phrase": "eight_residues"}, {"score": 0.002330530593384484, "phrase": "paratope_site"}], "paper_keywords": [""], "paper_abstract": "Motivation: Worldwide and substantial mortality caused by the 2009 H1N1 influenza A has stimulated a new surge of research on H1N1 viruses. An epitope conservation has been learned in the HA1 protein that allows antibodies to cross-neutralize both 1918 and 2009 H1N1. However, few works have thoroughly studied the binding hot spots in those two antigen-antibody interlaces which are responsible for the antibody cross-neutralization. Results: We apply predictive methods to identify binding hot spots at the epitope sites of the HA1 proteins and at the paratope sites of the 2D1 antibody. We find that the six mutations at the HA1's epitope from 1918 to 2009 should not harm its binding to 2D1. Instead, the change of binding free energy on the whole exhibits an increased tendency after these mutations, making the binding stronger. This is consistent with the observation that the 1918 H1N1 neutralizing antibody can cross-react with 2009 H1N1. We identified three distinguished hot spot residues, including Lys(166), common between the two epitopes. These common hot spots again can explain why 2D1 cross-reacted. We believe that these hot spot residues are mutation candidates which may help H1N1 viruses to evade the immune system. We also identified eight residues at the paratope site of 2D1, five from its heavy chain and three from its light chain, that are predicted to be energetically important in the HA1 recognition. The identification of these hot spot residues and their structural analysis are potentially useful to fight against H1N1 viruses.", "paper_title": "Structural analysis of the hot spots in the binding between H1N1 HA and the 2D1 antibody: do mutations of H1N1 from 1918 to 2009 affect much on this binding?", "paper_id": "WOS:000294755400008"}