{"auto_keywords": [{"score": 0.03644451033122438, "phrase": "project's_capabilities"}, {"score": 0.00481495049065317, "phrase": "software_future_sustainability"}, {"score": 0.004644014990871423, "phrase": "today's_organisations"}, {"score": 0.004209893377338457, "phrase": "oss_projects"}, {"score": 0.0037188360359702182, "phrase": "oss_projects'_sustainability"}, {"score": 0.003513264130359459, "phrase": "longitudinal_impact"}, {"score": 0.0032848684681050745, "phrase": "longitudinal_fashion"}, {"score": 0.0030396665931462, "phrase": "research_model"}, {"score": 0.0028127163745564777, "phrase": "temporal_persistence"}, {"score": 0.0025493457404304446, "phrase": "defect-removal_rate"}, {"score": 0.0025230952890994236, "phrase": "functionality-enhancement_rate"}, {"score": 0.0024842242921857705, "phrase": "development_sustainability"}, {"score": 0.0022515555308477526, "phrase": "oss"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Software adoption", " Development sustainability", " Dynamic capabilities", " OSS"], "paper_abstract": "Whereas today's organisations have embraced Open Source Software (OSS) applications because of the significant values that these products have to offer, the majority of OSS projects have difficulties sustaining their development activities, and hence experience failure. Even though many researchers have worked on uncovering the influence of the determinants of OSS projects' sustainability, there is a lack of research that investigates the longitudinal impact of a project's capabilities on its sustainability. Collecting data from 1409 OSS projects in a longitudinal fashion (over a period of 16 months), this paper develops and tests a research model that examines the influences of a project's capabilities on its development sustainability. The results demonstrated a temporal persistence in the relationship between sustainability and the speed of defect-removal and functionality-enhancement, whereas the effect that the defect-removal rate and functionality-enhancement rate have on development sustainability was discovered to significantly decrease as the project grows old. These findings have implications for both the OSS research community and OSS practitioners; these are derived and stated. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Predicting software future sustainability: A longitudinal perspective", "paper_id": "WOS:000349573600003"}