{"auto_keywords": [{"score": 0.043891862951523725, "phrase": "tcs"}, {"score": 0.02850911253422653, "phrase": "tp_model"}, {"score": 0.004689650818647484, "phrase": "chase_et_al"}, {"score": 0.004581000737445643, "phrase": "key_building_block"}, {"score": 0.00454090611248773, "phrase": "zero-knowledge_sets"}, {"score": 0.004487998837494252, "phrase": "micali"}, {"score": 0.004461787045590831, "phrase": "rabin"}, {"score": 0.0044356940482097144, "phrase": "kilian"}, {"score": 0.004098171194242233, "phrase": "additional_freedom"}, {"score": 0.003367077034382727, "phrase": "strictly_stronger_assumptions"}, {"score": 0.003298631258267805, "phrase": "affirmative_answer"}, {"score": 0.0032315723330399375, "phrase": "simple_constructions"}, {"score": 0.0031845067058084583, "phrase": "trapdoor_bit_commitment_scheme"}, {"score": 0.0030563268358422503, "phrase": "trusted_parameters"}, {"score": 0.00270978310478061, "phrase": "one-way_function"}, {"score": 0.0026313840069327713, "phrase": "special_flavor"}, {"score": 0.00249592321829865, "phrase": "random_string"}, {"score": 0.0024813376682564815, "phrase": "srs"}, {"score": 0.0023953929817357882, "phrase": "surprisingly_simple_variations"}, {"score": 0.002381365139274329, "phrase": "trapdoor_commitments"}, {"score": 0.0023466530426848064, "phrase": "non-interactive_zero-knowledge_sets"}, {"score": 0.002298902547676131, "phrase": "collision-resistant_hash_functions"}, {"score": 0.002186934375727305, "phrase": "mercurial_commitments"}], "paper_keywords": [""], "paper_abstract": "(Non-interactive) Trapdoor Mercurial Commitments (TMCs) were introduced by Chase et al. [8] and form a key building block for constructing zero-knowledge sets (introduced by Micali, Rabin and Kilian [28]). TMCs are quite similar and certainly imply ordinary (non-interactive) trapdoor commitments (TCs). Unlike TCs, however, they allow for some additional freedom in the way the message is opened: informally, by allowing one to claim that \"if this commitment can be opened at all, then it would open to this message\". Prior to this work, it was not clear if this addition is critical or not, since all the constructions of TMCs presented in [8] and [28] used strictly stronger assumptions than TCs. We give an affirmative answer to this question, by providing simple constructions of TMCs from any trapdoor bit commitment scheme. Moreover, by plugging in various trapdoor bit commitment schemes, we get, in the trusted parameters (TP) model, all the efficient constructions from [28] and [8], as well as several immediate new (either generic or efficient) constructions. In particular, we get a construction of TMCs from any one-way function in the TP model, and, by using a special flavor of TCs, called hybrid TCs [6], even in the (weaker) shared random string (SRS) model. Our results imply that (a) mercurial commitments can be viewed as surprisingly simple variations of trapdoor commitments; and (b) the existence of non-interactive zero-knowledge sets is equivalent to the existence of collision-resistant hash functions. Of independent interest, we also give a stronger and yet much simpler definition of mercurial commitments than that of [8], which is also met by our constructions in the TP model.", "paper_title": "Mercurial commitments: Minimal assumptions and efficient constructions", "paper_id": "WOS:000236909300007"}