{"auto_keywords": [{"score": 0.0468535498485826, "phrase": "secret_keys"}, {"score": 0.04643876418254707, "phrase": "multiple_authorities"}, {"score": 0.04461509693576422, "phrase": "central_authority"}, {"score": 0.012664754261604171, "phrase": "users'_privacy"}, {"score": 0.00481495049065317, "phrase": "decentralized_ciphertext-policy_attribute-based_encryption"}, {"score": 0.004748371393578422, "phrase": "previous_privacy-preserving_multiauthority_attribute-based_encryption"}, {"score": 0.00413096972023037, "phrase": "user's_identity_information"}, {"score": 0.003961842092184655, "phrase": "existing_ppma-abe_schemes"}, {"score": 0.00357689487273538, "phrase": "ciphertext-policy_abe"}, {"score": 0.003336031521101184, "phrase": "flexible_access_structures"}, {"score": 0.00321425262806329, "phrase": "challenging_and_important_work"}, {"score": 0.003140401552000472, "phrase": "ppma-abe_scheme"}, {"score": 0.0027062100658653485, "phrase": "privacy-preserving_decentralized_cp-abe"}], "paper_keywords": ["CP-ABE", " decentralization", " privacy"], "paper_abstract": "In previous privacy-preserving multiauthority attribute-based encryption (PPMA-ABE) schemes, a user can acquire secret keys from multiple authorities with them knowing his/her attributes and furthermore, a central authority is required. Notably, a user's identity information can be extracted from his/her some sensitive attributes. Hence, existing PPMA-ABE schemes cannot fully protect users' privacy as multiple authorities can collaborate to identify a user by collecting and analyzing his attributes. Moreover, ciphertext-policy ABE (CP-ABE) is a more efficient public-key encryption, where the encryptor can select flexible access structures to encrypt messages. Therefore, a challenging and important work is to construct a PPMA-ABE scheme where there is no necessity of having the central authority and furthermore, both the identifiers and the attributes can be protected to be known by the authorities. In this paper, a privacy-preserving decentralized CP-ABE (PPDCP-ABE) is proposed to reduce the trust on the central authority and protect users' privacy. In our PPDCP-ABE scheme, each authority can work independently without any collaboration to initial the system and issue secret keys to users. Furthermore, a user can obtain secret keys from multiple authorities without them knowing anything about his global identifier and attributes.", "paper_title": "Improving Privacy and Security in Decentralized Ciphertext-Policy Attribute-Based Encryption", "paper_id": "WOS:000350151500001"}