{"auto_keywords": [{"score": 0.028029181332742757, "phrase": "random"}, {"score": 0.00481495049065317, "phrase": "replication_algorithm"}, {"score": 0.0035914198812657897, "phrase": "video_server"}, {"score": 0.0035060903664150115, "phrase": "sufficient_bandwidth"}, {"score": 0.0034063576796640603, "phrase": "fundamental_question"}, {"score": 0.0032777653153451265, "phrase": "storage_capacity"}, {"score": 0.0029203055813347874, "phrase": "video_server_bandwidth"}, {"score": 0.0027965187255008647, "phrase": "simple_statistical_model"}, {"score": 0.0026523079380037706, "phrase": "generic_replication_algorithm"}, {"score": 0.0026142814606853037, "phrase": "load_balancing"}, {"score": 0.0023515464194592195, "phrase": "upload_bandwidth"}, {"score": 0.0022409963215568565, "phrase": "sensitivity_analysis"}], "paper_keywords": ["Peer-to-peer assisted video-on-demand (P2P VoD)", " replication", " scheduling", " stationary"], "paper_abstract": "Traditional video-on-demand (VoD) systems rely purely on servers to stream video content to clients, which does not scale. In recent years, peer-to-peer assisted VoD (P2P VoD) has proven to be practical and effective. In P2P VoD, each peer contributes some storage to store videos (or segments of videos) to help the video server. Assuming peers have sufficient bandwidth for the given video playback rate, a fundamental question is what is the relationship between the storage capacity (at each peer), the number of videos, the number of peers, and the resultant off-loading of video server bandwidth. In this paper, we use a simple statistical model to derive this relationship. We propose and analyze a generic replication algorithm Random with Load Balancing (RLB) that balances the service to all movies for both deterministic and random (but stationary) demand models and both homogeneous and heterogeneous peers (in upload bandwidth). We use simulation to validate our results for sensitivity analysis and for comparisons to other popular replication algorithms. This study leads to several fundamental insights for P2P VoD system design in practice.", "paper_title": "On Replication Algorithm in P2P VoD", "paper_id": "WOS:000315353500018"}