{"auto_keywords": [{"score": 0.03712948918190359, "phrase": "new_arguments"}, {"score": 0.03592892330172109, "phrase": "former_argument"}, {"score": 0.00481495049065317, "phrase": "argumentation_frameworks"}, {"score": 0.004707188147442449, "phrase": "semantics_sigma"}, {"score": 0.004039995317682942, "phrase": "af_h"}, {"score": 0.003648411055689428, "phrase": "dynamic_process"}, {"score": 0.0030955250132409964, "phrase": "arbitrary_expansions"}, {"score": 0.002795228413298423, "phrase": "old_arguments"}, {"score": 0.002253299769886694, "phrase": "mentioned_notions"}, {"score": 0.0021778895748464024, "phrase": "so-called_weak_and_local_expansion_equivalence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Abstract argumentation", " Meta-properties", " Equivalence relations"], "paper_abstract": "Given a semantics sigma, two argumentation frameworks (AFs) F and G are said to be standard equivalent if they possess the same extensions and strongly equivalent if, for any AF H, F conjoined with H and G conjoined with H are standard equivalent. Argumentation is a dynamic process and, in general, new arguments occur in response to a former argument or, more precisely, attack a former argument. For this reason, rather than considering arbitrary expansions we focus here on expansions where new arguments and attacks may be added but the attacks among the old arguments remain unchanged. We define and characterize two new notions of equivalence between AFs (which lie in-between standard and strong equivalence), namely normal and strong expansion equivalence. Furthermore, using the characterization theorems proved in this paper, we draw the connections between all mentioned notions of equivalence including further equivalence relations, so-called weak and local expansion equivalence. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Normal and strong expansion equivalence for argumentation frameworks", "paper_id": "WOS:000311977500002"}