{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "complex_situations"}, {"score": 0.0045318666714939905, "phrase": "alternative_systems_thinking-based_perspective"}, {"score": 0.004408729661992651, "phrase": "requirements_elicitation_process"}, {"score": 0.004218602458288531, "phrase": "requirements_engineering_elicitation"}, {"score": 0.003970439654470374, "phrase": "system_observer"}, {"score": 0.0036958398682001015, "phrase": "system_environment"}, {"score": 0.003030247482854539, "phrase": "emerging_design_reality"}, {"score": 0.002996992362027833, "phrase": "requirements_engineering_processes"}, {"score": 0.002931569771634119, "phrase": "high_levels"}, {"score": 0.002470547930651519, "phrase": "simple_and_technically_driven_systems"}, {"score": 0.00240328454980006, "phrase": "proven_methods"}, {"score": 0.0021049977753042253, "phrase": "systems_theory"}], "paper_keywords": ["Complex situation", " Requirements elicitation", " System complexity", " Systems theory", " Systems thinking"], "paper_abstract": "The purpose of this paper is to present an alternative systems thinking-based perspective and approach to the requirements elicitation process in complex situations. Three broad challenges associated with the requirements engineering elicitation in complex situations are explored, including the (1) role of the system observer, (2) nature of system requirements in complex situations, and (3) influence of the system environment. Authors have asserted that the expectation of unambiguous, consistent, complete, understandable, verifiable, traceable, and modifiable requirements is not consistent with complex situations. In contrast, complex situations are an emerging design reality for requirements engineering processes, marked by high levels of ambiguity, uncertainty, and emergence. This paper develops the argument that dealing with requirements for complex situations requires a change in paradigm. The elicitation of requirements for simple and technically driven systems is appropriately accomplished by proven methods. In contrast, the elicitation of requirements in complex situations (e.g., integrated multiple critical infrastructures, system-of-systems, etc.) requires more holistic thinking and can be enhanced by grounding in systems theory.", "paper_title": "System requirements engineering in complex situations", "paper_id": "WOS:000331559400003"}