{"auto_keywords": [{"score": 0.04374169091510021, "phrase": "order_parameters"}, {"score": 0.042150781020745584, "phrase": "simulation_temperature"}, {"score": 0.040448007601905894, "phrase": "long_chains"}, {"score": 0.039295476540132504, "phrase": "short_ones"}, {"score": 0.00481495049065317, "phrase": "peo-pmma_block_copolymers"}, {"score": 0.004712988631183401, "phrase": "six_kinds"}, {"score": 0.004337634476417911, "phrase": "k"}, {"score": 0.004289291421348352, "phrase": "mesoscopic_modeling"}, {"score": 0.004074397977869244, "phrase": "block_copolymers"}, {"score": 0.003537155405923517, "phrase": "plain_copolymers"}, {"score": 0.003447368368810501, "phrase": "peo"}, {"score": 0.003288567185099276, "phrase": "different_order_parameter_values"}, {"score": 0.003232653376857698, "phrase": "triblock_copolymer"}, {"score": 0.002746549549029177, "phrase": "highest_order_parameter_values"}, {"score": 0.0024566655761509276, "phrase": "mesoscopic_phase"}], "paper_keywords": ["PEO-b-PMMA copolymer", " Computer simulation", " Nanoparticle effect"], "paper_abstract": "The compatibility of six kinds of designed poly(ethylene oxide)-block-poly(methyl methacrylate) (PEO-b-PMMA) copolymers was studied at 270, 298 and 400 K via mesoscopic modeling. The values of the order parameters depended on both the structures of the block copolymers and the simulation temperature, while the values of the order parameters of the long chains were higher than those of the short ones; temperature had a more obvious effect on long chains than on the short ones. Plain copolymers doped with poly(ethylene oxide) (PEO) or poly(methyl methacrylate) (PMMA) homopolymer showed different order parameter values. When a triblock copolymer had the same component at both ends and was doped with one of its component polymers as a homopolymer (such as A5B6A5 doped with B6 or A5 homopolymer), the value of its order parameter depended on the simulation temperature. The highest order parameter values were observed for A5B6A5 doped with B6 at 400 K and for A5B6A5 doped with A5 at 270 K. A study of copolymers doped with nanoparticles showed that the mesoscopic phase was influenced by not only the properties of the nanoparticles, such as the size and density, but also the compositions of the copolymers. Increasing the size of the nanoparticles used as a dopant had the most significant effect on the phase morphologies of the copolymers.", "paper_title": "Effects of nanoparticles on the compatibility of PEO-PMMA block copolymers", "paper_id": "WOS:000297548000001"}