{"auto_keywords": [{"score": 0.026403106330269006, "phrase": "time_complexity"}, {"score": 0.00481495049065317, "phrase": "betweenness_centrality"}, {"score": 0.0047851345246117455, "phrase": "betweenness-centrality_measure"}, {"score": 0.0047113960612140335, "phrase": "social_and_computer_communication_networks"}, {"score": 0.004653220443592979, "phrase": "potential_monitoring"}, {"score": 0.004332349760703992, "phrase": "rbc"}, {"score": 0.004265531504874966, "phrase": "previously_well_known_betweenness_measures"}, {"score": 0.004199766284749713, "phrase": "flow_betweenness"}, {"score": 0.004160792819919432, "phrase": "traffic_load_centrality"}, {"score": 0.004122179528285764, "phrase": "network_flows"}, {"score": 0.004083923108969583, "phrase": "arbitrary_loop-free_routing_strategies"}, {"score": 0.003617616153730564, "phrase": "control_data_flows"}, {"score": 0.0032953582866530966, "phrase": "sequence_process"}, {"score": 0.0028737647829311587, "phrase": "different_sampling_rates"}, {"score": 0.002855934865505357, "phrase": "network_monitors"}, {"score": 0.0028293966058473476, "phrase": "arbitrary_communication_patterns"}, {"score": 0.00231111848128734, "phrase": "routing_tree"}, {"score": 0.0022825131641434964, "phrase": "routing_directed_acyclic_graph"}, {"score": 0.002226357953581725, "phrase": "multi-path_routing_strategies"}, {"score": 0.0021049977753042253, "phrase": "routing_decisions"}], "paper_keywords": ["Algorithms", " Measurement", " Betwenness", " centrality", " communication networks", " probabilistic routing"], "paper_abstract": "Betweenness-Centrality measure is often used in social and computer communication networks to estimate the potential monitoring and control capabilities a vertex may have on data flowing in the network. In this article, we define the Routing Betweenness Centrality (RBC) measure that generalizes previously well known Betweenness measures such as the Shortest Path Betweenness, Flow Betweenness, and Traffic Load Centrality by considering network flows created by arbitrary loop-free routing strategies. We present algorithms for computing RBC of all the individual vertices in the network and algorithms for computing the RBC of a given group of vertices, where the RBC of a group of vertices represents their potential to collaboratively monitor and control data flows in the network. Two types of collaborations are considered: (i) conjunctive-the group is a sequences of vertices controlling traffic where all members of the sequence process the traffic in the order defined by the sequence and (ii) disjunctive-the group is a set of vertices controlling traffic where at least one member of the set processes the traffic. The algorithms presented in this paper also take into consideration different sampling rates of network monitors, accommodate arbitrary communication patterns between the vertices (traffic matrices), and can be applied to groups consisting of vertices and/or edges. For the cases of routing strategies that depend on both the source and the target of the message, we present algorithms with time complexity of O(n(2)m) where n is the number of vertices in the network and m is the number of edges in the routing tree (or the routing directed acyclic graph (DAG) for the cases of multi-path routing strategies). The time complexity can be reduced by an order of n if we assume that the routing decisions depend solely on the target of the messages. Finally, we show that a preprocessing of O(n(2)m) time, supports computations of RBC of sequences in O(kn) time and computations of RBC of sets in O(k(3)n) time, where k in the number of vertices in the sequence or the set.", "paper_title": "Routing Betweenness Centrality", "paper_id": "WOS:000279362300006"}