{"auto_keywords": [{"score": 0.027911490635928782, "phrase": "mccdsp"}, {"score": 0.014207281010356865, "phrase": "extreme_hyperpartisanship"}, {"score": 0.0072458339305608655, "phrase": "-approximation_algorithm"}, {"score": 0.00481495049065317, "phrase": "effective_decision"}, {"score": 0.004673530058379246, "phrase": "social_network_analysis"}, {"score": 0.004633888966463624, "phrase": "recent_years"}, {"score": 0.0039244530915794025, "phrase": "severe_gridlock"}, {"score": 0.003394891095032025, "phrase": "social_network_analysis_techniques"}, {"score": 0.0033374705499418377, "phrase": "effective_leadership_group"}, {"score": 0.0030908254851076005, "phrase": "effective_representative_group"}, {"score": 0.0029116257477000617, "phrase": "minimum_size_representative_group"}, {"score": 0.002790004829699627, "phrase": "set_problem"}, {"score": 0.0025947642929906407, "phrase": "mccdsp-c"}, {"score": 0.0023123057299992587, "phrase": "approximation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "mccdsp-sc."}], "paper_keywords": ["Dominating set", " Social networks", " Approximation algorithm", " k-core", " Vertex connectivity"], "paper_abstract": "Recent years have witnessed how much a decision making group can be dysfunctional due to the extreme hyperpartisanship. While partisanship is crucial for the representatives to pursue the wishes of those whom they represent for, such an extremism results in a severe gridlock in the decision making progress, and makes themselves highly inefficient. It is known that such a problem can be mitigated by having negotiators in the group. This paper investigates the potential of social network analysis techniques to choose an effective leadership group of a society such that it suffers less from the extreme hyperpartisanship. We establish three essential requirements for an effective representative group, namely Influenceability, Partisanship, and Bipartisanship. Then, we formulate the problem of finding a minimum size representative group satisfying the three requirements as the minimum connected -core dominating set problem (MCCDSP), and show its NP-hardness. We introduce an extension of MCCDSP, namely MCCDSP-C, which assumes the society has a number of sub-communities and requires at least one representative from each sub-community should be in the leadership. We also propose an approximation algorithm for a subclass of MCCDSP with , and show an -approximation algorithm of MCCDSP can be used to obtain an -approximation algorithm of MCCDSP-SC.", "paper_title": "Computing an effective decision making group of a society using social network analysis", "paper_id": "WOS:000341498700006"}