{"auto_keywords": [{"score": 0.03502138116720423, "phrase": "intermediate_processing"}, {"score": 0.031090267766204292, "phrase": "block_length"}, {"score": 0.00481495049065317, "phrase": "line_networks"}, {"score": 0.004646654984830476, "phrase": "discrete_memoryless_channels"}, {"score": 0.004344577216137524, "phrase": "coding_schemes"}, {"score": 0.0043103495043308755, "phrase": "arbitrary_complexity"}, {"score": 0.0042426974826585695, "phrase": "intermediate_relay_nodes"}, {"score": 0.004110549138321181, "phrase": "fixed_length"}, {"score": 0.0034674164050273568, "phrase": "infinite_cascades"}, {"score": 0.00344007531836105, "phrase": "fixed_intermediate_processing_length"}, {"score": 0.0030068193773923387, "phrase": "best_zero-error_code"}, {"score": 0.0028222016727557087, "phrase": "fixed_and_identical_intermediate_processing"}, {"score": 0.0023896108055582615, "phrase": "constant_end-to-end_rate"}, {"score": 0.0022517100995552443, "phrase": "network_length"}, {"score": 0.002172811149894415, "phrase": "zero-error_capacity"}, {"score": 0.0021049977753042253, "phrase": "interest_logarithmic_growth"}], "paper_keywords": ["capacity", " network coding", " zero-error capacity"], "paper_abstract": "We consider communication through a cascade of discrete memoryless channels (DMCs). The source and destination node of this cascade are allowed to use coding schemes of arbitrary complexity, but the intermediate relay nodes are restricted to process only blocks of a fixed length. We investigate how the processing at the relays must be chosen in order to maximize the capacity of the cascade, that is, the maximum achievable end-to-end rate between the source and the destination. For infinite cascades with fixed intermediate processing length at the relays, we prove that this intermediate processing can be chosen to be identical without loss of optimality, and that the capacity of the cascade coincides with the rate of the best zero-error code of length equal to the block length of the intermediate processing. We further show that for fixed and identical intermediate processing at all relays, convergence of capacity as the length of the cascade goes to infinity is exponentially fast. Finally, we characterize how the block length of the intermediate processing must scale with the length of the cascade to guarantee a constant end-to-end rate. We prove that it is sufficient that the block length scales logarithmically with the network length in order to achieve any rate above the zero-error capacity. We show that in many cases of interest logarithmic growth is also necessary.", "paper_title": "On capacity of line networks", "paper_id": "WOS:000250448800013"}