{"auto_keywords": [{"score": 0.0430022764227854, "phrase": "present_study"}, {"score": 0.035147217988379366, "phrase": "unanswered_questions"}, {"score": 0.00481495049065317, "phrase": "unanswered_clinical_questions"}, {"score": 0.004566384853664753, "phrase": "previous_study"}, {"score": 0.004509780213218666, "phrase": "primary_care_physicians"}, {"score": 0.004384960761826366, "phrase": "patient_care"}, {"score": 0.004158500036893521, "phrase": "generic_types"}, {"score": 0.003919154537171269, "phrase": "success_rate"}, {"score": 0.0038106195546165574, "phrase": "unanswered_question_types"}, {"score": 0.0036363418376496484, "phrase": "earlier_study"}, {"score": 0.003149891887446744, "phrase": "\"undiagnosed_finding\"_questions"}, {"score": 0.003091422591911213, "phrase": "abnormal_clinical_findings"}, {"score": 0.0030057412068719646, "phrase": "test_results"}, {"score": 0.0028237205895435733, "phrase": "otherwise_simple_questions"}, {"score": 0.002669320541871186, "phrase": "qualifying_condition"}, {"score": 0.0025630734211267102, "phrase": "\"compound\"_questions"}, {"score": 0.0024002822777025906, "phrase": "clinical_information_retrieval"}, {"score": 0.0021991611806433634, "phrase": "clinical_information_resources"}, {"score": 0.0021248309394183945, "phrase": "clinical_information_systems"}, {"score": 0.0021049977753042253, "phrase": "clearer_and_more_explicit_answers"}], "paper_keywords": [""], "paper_abstract": "Objective: To describe the characteristics of unanswered clinical questions and propose interventions that could improve the chalice of finding answers. Design: In a previous study, investigators observed primary care physicians in their offices and recorded questions that arose during patient care. Questions that were pursued by the physician, but remained unanswered, were grouped into generic types. In the present study, investigators attempted to answer these questions and developed recommendations aimed at improving the success rate of finding answers. Measurements: Frequency of unanswered question types and recommendations to increase the chance of finding answers. Results: In an earlier study, 48 physicians asked 1062 questions during 192 half-day office observations. Physicians could not find answers to 237 (41%) of the 585 questions they pursued. The present study grouped the unanswered questions into 19 generic types. Three types accounted for 128 (54%) of the unanswered questions: (1) \"Undiagnosed finding\" questions asked about the Management of abnormal clinical findings, such as symptoms, signs, and test results (What is the approach to finding X?); (2) \"Conditional\" questions contained qualifying conditions that were appended to otherwise simple questions (What is the management of X, given Y? where \"given Y\" is the qualifying condition that makes the question difficult.); and (3) \"Compound\" questions asked about the association between two highly specific elements (Can X cause Y?). The study identified strategies to improve clinical information retrieval, listed below. Conclusion: To improve the chance of finding answers, physicians should change their search strategies by rephrasing their questions and searching more clinically oriented resources. Authors of clinical information resources should anticipate questions that may arise in practice, and clinical information systems should provide clearer and more explicit answers.", "paper_title": "Patient-care questions that physicians are unable to answer", "paper_id": "WOS:000248103000005"}