{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "scholarly_data"}, {"score": 0.004502943680955863, "phrase": "use_control_policies"}, {"score": 0.0036826452656927877, "phrase": "purposive_exploratory_sample"}, {"score": 0.003601235776892337, "phrase": "content_analysis"}, {"score": 0.003561205990687285, "phrase": "repository_website_documentation"}, {"score": 0.003501991125315889, "phrase": "web_survey"}, {"score": 0.0034630606658026595, "phrase": "repository_managers"}, {"score": 0.0030794433253250476, "phrase": "use_control"}, {"score": 0.002800158709933889, "phrase": "commons_theory"}, {"score": 0.0027535633837592597, "phrase": "guiding_theoretical_framework"}, {"score": 0.0026478260192958924, "phrase": "repository_rules"}, {"score": 0.002603758927691463, "phrase": "data_commons_boundaries"}, {"score": 0.0025461386232786356, "phrase": "decision_making"}, {"score": 0.0021049977753042253, "phrase": "specific_sorts"}], "paper_keywords": ["data", " information access", " digital rights management"], "paper_abstract": "This paper describes the range and variation in access and use control policies and tools used by 24 web-based data repositories across a variety of fields. It also describes the rationale provided by repositories for their decisions to control data or provide means for depositors to do so. Using a purposive exploratory sample, we employed content analysis of repository website documentation, a web survey of repository managers, and selected follow-up interviews to generate data. Our results describe the range and variation in access and use control policies and tools employed, identifying both commonalities and distinctions across repositories. Using concepts from commons theory as a guiding theoretical framework, our analysis describes the following five dimensions of repository rules, or data commons boundaries: locus of decision making (depositor vs. repository), degree of variation in terms of use within the repository, the mission of the repository in relation to its scholarly field, what use means in relation to specific sorts of data, and types of exclusion.", "paper_title": "Managing the data commons: Controlled sharing of scholarly data", "paper_id": "WOS:000340479500002"}