{"auto_keywords": [{"score": 0.03499736019589013, "phrase": "aggregation_weights"}, {"score": 0.004717723626157272, "phrase": "cross-efficiency_evaluations"}, {"score": 0.004506048850130758, "phrase": "cross-efficiency_evaluation"}, {"score": 0.004303830426772906, "phrase": "particular_type"}, {"score": 0.004027586827290042, "phrase": "weighted_average"}, {"score": 0.003866443402315402, "phrase": "cross-efficiency_scores"}, {"score": 0.003769006950727621, "phrase": "usual_arithmetic_mean"}, {"score": 0.0034733518170738517, "phrase": "main_purpose"}, {"score": 0.003250238918180901, "phrase": "decision_maker"}, {"score": 0.0031360786664165093, "phrase": "relative_importance"}, {"score": 0.002964706925144123, "phrase": "different_decision-making_units"}, {"score": 0.0026359661683151006, "phrase": "iowa_operator_weights"}], "paper_keywords": [""], "paper_abstract": "This paper proposes an enhancement of the cross-efficiency evaluation through the aggregation of cross-efficiencies by using a particular type of induced ordered weighted averaging (IOWA) operator. The use of a weighted average of cross-efficiencies for the calculation of the cross-efficiency scores, instead of the usual arithmetic mean, allows us to introduce some flexibility into the analysis. In particular, the main purpose of the approach we present is to provide aggregation weights that reflect the decision maker (DM) preferences regarding the relative importance that should be attached to the cross-efficiencies provided by the different decision-making units. To do it, an ordering is to be induced in the rows of the matrix of cross-efficiencies, so the IOWA operator weights can be attached accordingly to the elements in each of the columns. The DM can thus incorporate his/her preferences by means of the choice of the variable that induces such ordering, and he/she may also adjust the importance to be attached to the most preferred cross-efficiencies with the level of orness that is used when the aggregation weights are obtained.", "paper_title": "Using Induced Ordered Weighted Averaging (IOWA) Operators for Aggregation in Cross-Efficiency Evaluations", "paper_id": "WOS:000344449600003"}