{"auto_keywords": [{"score": 0.040984823331088605, "phrase": "open_data_benchmarks"}, {"score": 0.004635477242873163, "phrase": "public_organizations"}, {"score": 0.0042354707960660706, "phrase": "open_data_adoption"}, {"score": 0.004000741805312148, "phrase": "better_understanding"}, {"score": 0.003944112858235306, "phrase": "common_and_differentiating_elements"}, {"score": 0.0035022161192936234, "phrase": "interpretive_meta-analysis_approach"}, {"score": 0.003436242862104006, "phrase": "five_benchmarks"}, {"score": 0.0026705669656375197, "phrase": "specific_situations"}, {"score": 0.00258307991054107, "phrase": "different_scope"}, {"score": 0.002522344964242888, "phrase": "different_methodologies"}, {"score": 0.0024747842618794255, "phrase": "different_results"}, {"score": 0.0024281181691350085, "phrase": "country_ranks"}, {"score": 0.002371018116266096, "phrase": "obvious_gap"}, {"score": 0.0022715929119140194, "phrase": "end-user_practices"}, {"score": 0.0022181655497912796, "phrase": "open_data"}], "paper_keywords": ["open data", " maturity", " adoption", " benchmark", " index", " open government", " evaluation", " ranking", " open data models"], "paper_abstract": "Public organizations release their data for use by the public to open the government. Various benchmarks for evaluating the progress of open data adoption have emerged recently. In order to help bring about a better understanding of the common and differentiating elements in open data benchmarks and to identify the methodologies and metrics affecting their variation, this article compares open data benchmarks and describes lessons learned from their analysis. An interpretive meta-analysis approach was used and five benchmarks were compared with regard to metadata (key concepts, themes, and metaphors), meta-methods (methodologies underlying the benchmarks) and metatheories (theoretical assumptions at the foundation of the benchmarks). It was found that each benchmark has its strengths and weaknesses and is applicable in specific situations. Since the open data benchmarks have a different scope and focus and use different methodologies, they produce different results in terms of country ranks. There is an obvious gap in both the literature and benchmarks regarding the evolution of end-user practices and individual adoption of open data. Furthermore, lessons are drawn for the development of more comprehensive open data benchmarks and open government evaluation in general.", "paper_title": "Benchmarks for Evaluating the Progress of Open Data Adoption: Usage, Limitations, and Lessons Learned", "paper_id": "WOS:000360817500007"}