{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ad-hoc_networks"}, {"score": 0.00470862827326028, "phrase": "set_s"}, {"score": 0.004428139418750855, "phrase": "euclidean_space"}, {"score": 0.004354572391793908, "phrase": "root_b"}, {"score": 0.0041642891310893, "phrase": "h-hops_convergecast_problem"}, {"score": 0.004027031316965272, "phrase": "minimal_energy-cost_range_assignment"}, {"score": 0.0035216195857272403, "phrase": "main_goal"}, {"score": 0.002911961514073769, "phrase": "efficient_parameterized_randomized_protocol"}, {"score": 0.0028795712616923462, "phrase": "h-hops_convergecast"}, {"score": 0.002784540221128404, "phrase": "random_instances"}, {"score": 0.002722930209707764, "phrase": "n_points"}, {"score": 0.002603758927691463, "phrase": "side_length"}, {"score": 0.0023941575109692336, "phrase": "constant_factor"}, {"score": 0.0022137465420508785, "phrase": "wide_experimental_study"}], "paper_keywords": [""], "paper_abstract": "Given a set S of points (stations) located in the d-dim. Euclidean space and a root b is an element of S, the h-HOPS CONVERGECAST problem asks to find for a minimal energy-cost range assignment which allows to perform the converge-cast primitive (i.e. node accumulation) towards b in at most h hops. For this problem no polynomial time algorithm is known even for h = 2. The main goal of this work is the design of an efficient distributed heuristic (i.e. protocol) and the analysis (both theoretical and experimental) of its expected solution cost. In particular, we introduce an efficient parameterized randomized protocol for h-HOPS CONVERGECAST and we analyze it on random instances created by placing n points uniformly at random in a d-cube of side length L. We prove that for h = 2, its expected approximation ratio is bounded by some constant factor. Finally, for h = 3,...,8, we provide a wide experimental study showing that our protocol has very good performances when compared with previously introduced (centralized) heuristics.", "paper_title": "A distributed protocol for the bounded-hops converge-cast in ad-hoc networks", "paper_id": "WOS:000240073200007"}