{"auto_keywords": [{"score": 0.040117765102206285, "phrase": "unlabeled_image"}, {"score": 0.016745812662446243, "phrase": "backward_sr"}, {"score": 0.01049117252012799, "phrase": "semi-supervised_image_annotation"}, {"score": 0.009325076819356973, "phrase": "labeled_images"}, {"score": 0.00658150618214638, "phrase": "image_annotation"}, {"score": 0.00481495049065317, "phrase": "cooperative_sparse_representation"}, {"score": 0.004664352260912174, "phrase": "sparse_representation"}, {"score": 0.004492406361795448, "phrase": "powerful_classification_capability"}, {"score": 0.004339293854115301, "phrase": "cooperative_sr"}, {"score": 0.004179280538985628, "phrase": "training_image_classifiers"}, {"score": 0.003967379852781603, "phrase": "usual_sr_method"}, {"score": 0.0036482665232275583, "phrase": "labeled_ones"}, {"score": 0.0035340293330075483, "phrase": "sr_method"}, {"score": 0.0034134687245359376, "phrase": "labeled_image"}, {"score": 0.0029197159945990015, "phrase": "forward_sr."}, {"score": 0.00282822695516646, "phrase": "semi-supervised_method"}, {"score": 0.0026924262536607915, "phrase": "complementary_nature"}, {"score": 0.0025929837295811673, "phrase": "kernel_space"}, {"score": 0.002570560704334778, "phrase": "cooperative_kernel_sparse_representation"}, {"score": 0.0024899850926034567, "phrase": "experimental_results"}, {"score": 0.0023430894142828155, "phrase": "image_annotation_performance"}, {"score": 0.0022696277881969896, "phrase": "local_and_global_consistency"}, {"score": 0.0022499947003073654, "phrase": "gaussian_fields"}, {"score": 0.002237000206023246, "phrase": "harmonic_functions"}, {"score": 0.0022240805921303875, "phrase": "comparative_experiments"}, {"score": 0.0022048406330100697, "phrase": "nonsparse_solution"}, {"score": 0.002135704168014609, "phrase": "important_role"}, {"score": 0.0021049977753042253, "phrase": "image_representations"}], "paper_keywords": ["Co-training", " image annotation", " image retrieval", " semi-supervised learning", " sparse representation (SR)"], "paper_abstract": "Recent studies have shown that sparse representation (SR) can deal well with many computer vision problems, and its kernel version has powerful classification capability. In this paper, we address the application of a cooperative SR in semi-supervised image annotation which can increase the amount of labeled images for further use in training image classifiers. Given a set of labeled (training) images and a set of unlabeled (test) images, the usual SR method, which we call forward SR, is used to represent each unlabeled image with several labeled ones, and then to annotate the unlabeled image according to the annotations of these labeled ones. However, to the best of our knowledge, the SR method in an opposite direction, that we call backward SR to represent each labeled image with several unlabeled images and then to annotate any unlabeled image according to the annotations of the labeled images which the unlabeled image is selected by the backward SR to represent, has not been addressed so far. In this paper, we explore how much the backward SR can contribute to image annotation, and be complementary to the forward SR. The co-training, which has been proved to be a semi-supervised method improving each other only if two classifiers are relatively independent, is then adopted to testify this complementary nature between two SRs in opposite directions. Finally, the co-training of two SRs in kernel space builds a cooperative kernel sparse representation (Co-KSR) method for image annotation. Experimental results and analyses show that two KSRs in opposite directions are complementary, and Co-KSR improves considerably over either of them with an image annotation performance better than other state-of-the-art semi-supervised classifiers such as transductive support vector machine, local and global consistency, and Gaussian fields and harmonic functions. Comparative experiments with a nonsparse solution are also performed to show that the sparsity plays an important role in the cooperation of image representations in two opposite directions. This paper extends the application of SR in image annotation and retrieval.", "paper_title": "Cooperative Sparse Representation in Two Opposite Directions for Semi-Supervised Image Annotation", "paper_id": "WOS:000307896800032"}