{"auto_keywords": [{"score": 0.039135607661357236, "phrase": "sal"}, {"score": 0.00481495049065317, "phrase": "z_formal_specification_language"}, {"score": 0.004579005794486596, "phrase": "automated_verification_tools"}, {"score": 0.004072275820209647, "phrase": "novel_approach"}, {"score": 0.003202361402737197, "phrase": "important_issues"}, {"score": 0.0030451958332949735, "phrase": "finite_models"}, {"score": 0.002977835845437357, "phrase": "bdd-based_symbolic_checker"}, {"score": 0.002911961514073769, "phrase": "non-constructive_and_piecemeal_style"}, {"score": 0.002707741309851526, "phrase": "rich_set-based_vocabulary"}, {"score": 0.0026626797255348287, "phrase": "z_mathematical_toolkit"}, {"score": 0.0025178072071268534, "phrase": "complete_and_faithful_a_translation"}, {"score": 0.0023281003994670714, "phrase": "available_optimisations"}, {"score": 0.002176887956041267, "phrase": "complete_working_example"}, {"score": 0.0021049977753042253, "phrase": "performance_data"}], "paper_keywords": ["Z", " model-checking", " SAL"], "paper_abstract": "Despite being widely known and accepted in industry, the Z formal specification language has not so far been well supported by automated verification tools, mostly because of the challenges in handling the abstraction of the language. In this paper we discuss a novel approach to building a model-checker for Z, which involves implementing a translation from Z into SAL, the input language for the Symbolic Analysis Laboratory, a toolset which includes a number of model-checkers and a simulator. The Z2SAL translation deals with a number of important issues, including: mapping unbounded, abstract specifications into bounded, finite models amenable to a BDD-based symbolic checker; converting a non-constructive and piecemeal style of functional specification into a deterministic, automaton-based style of specification; and supporting the rich set-based vocabulary of the Z mathematical toolkit. This paper discusses progress made towards implementing as complete and faithful a translation as possible, while highlighting certain assumptions, respecting certain limitations and making use of available optimisations. The translation is illustrated throughout with examples; and a complete working example is presented, together with performance data.", "paper_title": "Z2SAL: a translation-based model checker for Z", "paper_id": "WOS:000285879000004"}