{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "new_top-hat_transformation"}, {"score": 0.027361755236220836, "phrase": "infrared_dim_small_target_detection"}, {"score": 0.007518967536238915, "phrase": "multi-scale_operations"}, {"score": 0.006526969353189998, "phrase": "classical_top-hat_transformation"}, {"score": 0.004471530397729526, "phrase": "top-hat_transformation"}, {"score": 0.004335739075947899, "phrase": "simple_and_effective_way"}, {"score": 0.0034294219963679857, "phrase": "difference_information"}, {"score": 0.0033251716926666437, "phrase": "surrounding_regions"}, {"score": 0.002814454488050123, "phrase": "multi-scale_operation"}, {"score": 0.0026953359825383646, "phrase": "good_performance"}, {"score": 0.002456744238900652, "phrase": "proper_selection"}, {"score": 0.002426566352219338, "phrase": "structuring_elements"}, {"score": 0.002323826502178581, "phrase": "experimental_results"}, {"score": 0.002198084195030656, "phrase": "infrared_dim_small_target"}], "paper_keywords": ["Top-hat transformation", " Structuring element", " Infrared dim small target", " Target detection"], "paper_abstract": "To improve the performance of top-hat transformation for infrared dim small target detection in a simple and effective way, the definition, properties, multi-scale operations of new top-hat transformation and the application for infrared dim small target detection are addressed in this paper. The definition of new top-hat transformation uses two different but correlated structuring elements to reorganize the classical top-hat transformation, and takes into account of the difference information between the target and surrounding regions. Given this definition, the new top-hat transformation has some special properties and three types of multi-scale operations, which are discussed in detail. Subsequently, one application case of multi-scale operation for noise suppression is given. Good performance of the application for infrared dim small target detection is obtained, which could be ascribed to the proper selection of structuring elements based on the properties. The experimental results of the application demonstrate that new top-hat transformation can detect infrared dim small target more efficiently than classical top-hat transformation and some other widely used methods. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis of new top-hat transformation and the application for infrared dim small target detection", "paper_id": "WOS:000275987700012"}