{"auto_keywords": [{"score": 0.049435104149514145, "phrase": "opportunistic_networks"}, {"score": 0.005578806162242377, "phrase": "generic_mobile_ad_hoc_networks"}, {"score": 0.00481495049065317, "phrase": "mutual_exclusion"}, {"score": 0.004499647408293102, "phrase": "transient_connectivity"}, {"score": 0.0037473054818679763, "phrase": "exclusive_access"}, {"score": 0.003671865026158296, "phrase": "shared_object"}, {"score": 0.0034311578789991363, "phrase": "challenging_problem"}, {"score": 0.0033167679667625667, "phrase": "limited_pairwise_connectivity_and_node_failures"}, {"score": 0.0031415984808041324, "phrase": "mutual_exclusion_algorithms"}, {"score": 0.003036849027691884, "phrase": "manets"}, {"score": 0.0026157259734105, "phrase": "simulation_results"}, {"score": 0.0021776870246727233, "phrase": "intercontact_time_distributions"}], "paper_keywords": ["Opportunistic networks", " Critical section", " Mutual exclusion", " Token passing", " Distributed resources"], "paper_abstract": "Opportunistic networks are essentially distributed networks with transient connectivity among nodes. Nodes in opportunistic networks are resource constrained, mobile and opportunistically come in contact with each other. In such a distributed network, nodes may require exclusive access to a shared object or resource. Ensuring freedom from starvation is a challenging problem in opportunistic networks due to limited pairwise connectivity and node failures. In this paper, we review mutual exclusion algorithms proposed for generic mobile ad hoc networks (MANETs) and discuss their applicability to opportunistic networks. Further, we propose a novel token based algorithm(1) and prove its correctness. Simulation results show that our algorithm is communication efficient as compared to other algorithms proposed for generic mobile ad hoc networks. We also propose a timeout based fault detection algorithm that exploits the intercontact time distributions. (C) 2011 Elsevier B. V. All rights reserved.", "paper_title": "A token based distributed algorithm for supporting mutual exclusion in opportunistic networks", "paper_id": "WOS:000308425900012"}