{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "integrated_management"}, {"score": 0.004411744930153217, "phrase": "transparent_sharing"}, {"score": 0.004319566932528865, "phrase": "computer_processing_power"}, {"score": 0.004029988158236421, "phrase": "resource_management_part"}, {"score": 0.003922011960904278, "phrase": "specific_features"}, {"score": 0.00384002686613679, "phrase": "simultaneous_access"}, {"score": 0.003626000977962191, "phrase": "resource_sharing"}, {"score": 0.0035288105310344463, "phrase": "dedicated_servers"}, {"score": 0.0034032496750682753, "phrase": "limited_number"}, {"score": 0.0033020239107199876, "phrase": "resource_management_mechanisms"}, {"score": 0.003232956879952914, "phrase": "resource_management"}, {"score": 0.0030991131563500446, "phrase": "ever_growing_extent"}, {"score": 0.0030342774028555377, "phrase": "integrated_framework"}, {"score": 0.00291743479583421, "phrase": "dynamic_structure"}, {"score": 0.002705199644897355, "phrase": "operating_systems"}, {"score": 0.002680789041160613, "phrase": "proposed_framework"}, {"score": 0.002640591917408814, "phrase": "dynamically_reconfigurable_resource_management_mechanisms"}, {"score": 0.0024410581599518784, "phrase": "shared_resources"}, {"score": 0.0022429664506287577, "phrase": "distributed_resources"}, {"score": 0.0022160085332710265, "phrase": "dynamically_reconfigurable_structures"}], "paper_keywords": ["P2P distributed systems", " Integrated resource management", " Resource sharing", " Framework", " Operating system"], "paper_abstract": "Traditional Peer-to-Peer (P2P) systems were restricted to sharing of files on the Internet. Although some of the more recent P2P distributed systems have tried to support transparent sharing of other types of resources, like computer processing power, but none allow and support sharing of all types of resources available on the Internet. This is mainly because the resource management part of P2P systems are custom designed in support of specific features of only one type of resource, making simultaneous access to all types of resources impractical. Another shortcoming of existing P2P systems is that they follow a client/server model of resource sharing that makes them structurally constrained and dependent on dedicated servers (resource managers). Clients must get permission from a limited number of servers to share or access resources, and resource management mechanisms run on these servers. Because resource management by servers is not dynamically reconfigurable, such P2P systems are not scalable to the ever growing extent of Internet. We present an integrated framework for sharing of all types of resources in P2P systems by using a dynamic structure for managing four basic types of resources, namely process, file, memory, and I/O, in the same way they are routinely managed by operating systems. The proposed framework allows P2P systems to use dynamically reconfigurable resource management mechanisms where each machine in the P2P system can at the same time serve both as a server and as a client. The pattern of requests for shared resources at a given time identifies which machines are currently servers and which ones are currently clients. The client server pattern changes with changes in the pattern of requests for distributed resources. Scalable P2P systems with dynamically reconfigurable structures can thus be built using our proposed resource management mechanisms. This dynamic structure also allows for the interoperability of different P2P systems.", "paper_title": "A dynamic framework for integrated management of all types of resources in P2P systems", "paper_id": "WOS:000276498300004"}