{"auto_keywords": [{"score": 0.032828548091871176, "phrase": "j_levels"}, {"score": 0.026871147693477287, "phrase": "throughput_rate"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_discrete_wavelet_transform"}, {"score": 0.004706305193222972, "phrase": "novel_architectures"}, {"score": 0.004537525607322823, "phrase": "lifting_schemes"}, {"score": 0.004374772264092067, "phrase": "embedded_decimation_technique"}, {"score": 0.0042178318724732005, "phrase": "i-d_dwt"}, {"score": 0.00393852508392789, "phrase": "low-_and_high-frequency_components"}, {"score": 0.0036944890904337833, "phrase": "efficient_line-based_architecture"}, {"score": 0.003545625043276134, "phrase": "parallel_and_pipeline_techniques"}, {"score": 0.0033410898465226417, "phrase": "parallel_and_pipeline_fashion"}, {"score": 0.002254571365634257, "phrase": "previous_literature"}, {"score": 0.0022238315004700607, "phrase": "proposed_architectures"}, {"score": 0.0021834945657804193, "phrase": "efficient_alternatives"}, {"score": 0.0021438877099090262, "phrase": "hardware_cost"}, {"score": 0.0021049977753042253, "phrase": "output_latency"}], "paper_keywords": ["discrete wavelet transform (DWT)", " embedded decimation", " lifting scheme", " line-based architecture", " parallel"], "paper_abstract": "Novel architectures for 1-D and 2-D discrete wavelet transform (DWT) by using lifting schemes are presented in this paper. An embedded decimation technique is exploited to optimize the architecture for I-D DWT, which is designed to receive an input and generate an output with the low- and high-frequency components of original data being available alternately. Based on this 1-D DWT architecture, an efficient line-based architecture for 2-D DWT is further proposed by employing parallel and pipeline techniques, which is mainly composed of two horizontal filter modules and one vertical filter module, working in parallel and pipeline fashion with 100% hardware utilization. This 2-D architecture is called fast architecture (FA) that can perform J levels of decomposition for N*N image in approximately 2N(2)(1-4(-J))/3 internal clock cycles. Moreover, another efficient generic line-based 2-D architecture is proposed by exploiting the parallelism among four subband transforms in lifting-based 2-D DWT, which can perform J levels of decomposition for N*N image in approximately N-2(1-4(-J))/3 internal clock cycles; hence, it is called high-speed architecture. The throughput rate of the latter is increased by two times when comparing with the former 2-D architecture, but only less additional hardware cost is added. Compared with the works reported in previous literature, the proposed architectures for 2-D DWT are efficient alternatives in tradeoff among hardware cost, throughput rate, output latency and control complexity, etc.", "paper_title": "Efficient architectures for two-dimensional discrete wavelet transform using lifting scheme", "paper_id": "WOS:000244311100002"}