{"auto_keywords": [{"score": 0.036653305954379496, "phrase": "implantation_rate"}, {"score": 0.031131744248455703, "phrase": "women's_age"}, {"score": 0.00481495049065317, "phrase": "different_embryo_scores"}, {"score": 0.004772518445873925, "phrase": "vitro_fertilization"}, {"score": 0.004674952036988355, "phrase": "multiple_pregnancies"}, {"score": 0.004525629293824217, "phrase": "mathematical_model"}, {"score": 0.00447251540886613, "phrase": "embryo's_potential_ability"}, {"score": 0.0036159291978698016, "phrase": "main_result"}, {"score": 0.0035106702438029913, "phrase": "significant_improvement"}, {"score": 0.0034185505275141077, "phrase": "blastomere_values"}, {"score": 0.0033684179374769605, "phrase": "grade_factor_values"}, {"score": 0.0032223742018434856, "phrase": "two-three_to_five-six_blastomeres"}, {"score": 0.0031285355811105945, "phrase": "embryo_traceability"}, {"score": 0.002821044196775531, "phrase": "fitted_model"}, {"score": 0.002738860577028354, "phrase": "implantation_potential"}, {"score": 0.0025892330566358503, "phrase": "embryo_quality_index"}, {"score": 0.0024333239726872604, "phrase": "statistical_techniques"}, {"score": 0.0024118292918742967, "phrase": "receiver_operating_characteristics"}, {"score": 0.0023764249306830196, "phrase": "bootstrap_procedures"}, {"score": 0.0022935555629405003, "phrase": "embryo_score"}, {"score": 0.002130056082139311, "phrase": "top_embryos"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": ["Generalised linear models", " Categorical predictors", " Generalised linear mixed models", " ROC curve", " Embryo score", " Bootstrapping"], "paper_abstract": "In Vitro Fertilization (IVF) units need to decrease multiple pregnancies without affecting their overall success rate. In this study we propose a mathematical model to evaluate an embryo's potential ability to implant in the uterus. Embryos are graded by the embryologist based on the number of blastomeres, evenness of growth and degree of fragmentation. Therefore, the following variables were considered: number of blastomeres produced by division of the egg after fertilisation (blastomeres), symmetry and fragmentation of the embryo (grade). This model evaluates the embryos assigning them a score which represents their quality. The main result derived from this model is the estimation of the significant improvement in the implantation rate due to the increase in blastomere values and the decrease in grade factor values. But the increase from two-three to four produces more improvement in the implantation rate than two-three to five-six blastomeres. First, statistical models were used to study embryo traceability from transfer to implantation and to evaluate the effect of the quality of the embryos (embryo score) and women's age on implantation potential. This score was obtained by making predictions from the fitted model which was used to rank embryos in terms of implantation potential. Then we totalled the scores of embryos that had been transferred to each woman for obtaining the Embryo Quality Index (EQI). In addition, we studied the effects of EQI and women's age on pregnancy. Finally, statistical techniques such as Receiver Operating Characteristics (ROC) and bootstrap procedures were used to assess the accuracy of this model. This embryo score is a quick, efficient and accurate tool to optimise embryo selection for transfers on the second day after fertilisation. This tool is especially useful for transfers involving non-top embryos. Published by Elsevier Ltd", "paper_title": "Mathematical methodology to obtain and compare different embryo scores", "paper_id": "WOS:000314102400036"}