{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "umls_semantic_network"}, {"score": 0.0495037775396638, "phrase": "seed_ontology"}, {"score": 0.0225928119032953, "phrase": "medical_domain"}, {"score": 0.00788621725510162, "phrase": "semantic_relations"}, {"score": 0.004370973501074594, "phrase": "unified_medical_language_system"}, {"score": 0.004164516065972361, "phrase": "medical_field_ontology"}, {"score": 0.004064958518350867, "phrase": "knowledge_engineering_approach"}, {"score": 0.0038728990904778678, "phrase": "colon_cancer_treatment"}, {"score": 0.003601628511550962, "phrase": "extracted_concepts"}, {"score": 0.003543966226822055, "phrase": "protege"}, {"score": 0.002748159131396737, "phrase": "\"colon_cancer_treatment\"_domain"}, {"score": 0.002639385610609024, "phrase": "colon_cancer_treatment_domain"}, {"score": 0.002545165985686468, "phrase": "breast_cancer_treatment"}, {"score": 0.0024642355970277497, "phrase": "better_generalization"}, {"score": 0.0021917966722180132, "phrase": "basic_guidelines"}, {"score": 0.0021049977753042253, "phrase": "umls."}], "paper_keywords": ["information retrieval", " semantics", " knowledge engineering", " medical information systems"], "paper_abstract": "Purpose - The purpose of this article is to examine the effectiveness of the unified medical language system (UMLS) semantic network as a seed ontology for building a medical field ontology. Design/methodology/approach - The information extraction process known as the knowledge engineering approach was used to extract concepts and their semantic relations from documents on \"colon cancer treatment\". The UMLS semantic network was used as a seed ontology, and was extended and enriched with the extracted concepts and semantic relations using Protege. Findings - Only half of the semantic relations extracted manually were defined (or inferable) in the UMLS semantic network. The remaining half could be added to the network to extend its coverage. In addition, two semantic types in the network were found to be too general and four new sublevel semantic types were proposed to make them more specific. Research limitations/implications - Since only 109 research paper abstracts in the \"colon cancer treatment\" domain were analyzed in this study, more abstracts from the colon cancer treatment domain as well as from other cancer treatment domains (such as breast cancer treatment) can be analyzed to give a better generalization of our findings. Originality/value - This study shares our findings on the effectiveness of the UMLS semantic network as a seed ontology for building a medical domain ontology, and also provides the basic guidelines for building or extending a medical domain ontology using the UMLS.", "paper_title": "Effectiveness of UMLS semantic network as a seed ontology for building a medical domain ontology", "paper_id": "WOS:000258536600003"}