{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interactive_genetic_algorithm"}, {"score": 0.004690305164360866, "phrase": "video_scene_retrieval_algorithm"}, {"score": 0.004450568197899267, "phrase": "video_clip"}, {"score": 0.004373398434399966, "phrase": "specific_story"}, {"score": 0.004297560964892607, "phrase": "five_video_features"}, {"score": 0.004223032986655664, "phrase": "average_color_histogram"}, {"score": 0.003852371777780562, "phrase": "\"gradual_change_rate"}, {"score": 0.003498782065781398, "phrase": "emotional_space"}, {"score": 0.00308163068747474, "phrase": "new_chromosomes"}, {"score": 0.0030547611342112693, "phrase": "crossover_and_feature_vectors"}, {"score": 0.0030148941188459987, "phrase": "database_videos"}, {"score": 0.002936709606809639, "phrase": "similarity_function"}, {"score": 0.002823207272381655, "phrase": "next_generation"}, {"score": 0.0024864020775253767, "phrase": "proposed_method"}, {"score": 0.002464709648714996, "phrase": "six_example_categories"}, {"score": 0.0023798115577749225, "phrase": "\"_\"quietness"}], "paper_keywords": ["emotion-based retrieval", " video scene retrieval", " commercial video retrieval", " interactive genetic algorithm (IGA)"], "paper_abstract": "This paper proposes a video scene retrieval algorithm based on emotion. First, abrupt/gradual shot boundaries are detected in the video clip of representing a specific story. Then, five video features such as \"average color histogram,\" \"average brightness,\" \"average edge histogram,\" \"average shot duration,\" and \"gradual change rate\" are extracted from each of the videos, and mapping through an interactive genetic algorithm is conducted between these features and the emotional space that a user has in mind. After the proposed algorithm selects the videos that contain the corresponding emotion from the initial population of videos, the feature vectors from them are regarded as chromosomes, and a genetic crossover is applied to those feature vectors. Next, new chromosomes after crossover and feature vectors in the database videos are compared based on a similarity function to obtain the most similar videos as solutions of the next generation. By iterating this process, a new population of videos that a user has in mind are retrieved. In order to show the validity of the proposed method, six example categories of \"action,\" \"excitement,\" \"suspense,\" \"quietness,\" \"relaxation,\" and \"happiness\" are used as emotions for experiments. This method of retrieval shows 70% of effectiveness on the average over 300 commercial videos.", "paper_title": "Video scene retrieval with interactive genetic algorithm", "paper_id": "WOS:000248008500003"}