{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "osgi_framework"}, {"score": 0.010185314503510515, "phrase": "ubiquitous_computing_environment"}, {"score": 0.00443308765153716, "phrase": "local_network"}, {"score": 0.0041666157975446564, "phrase": "standard_execution_environment"}, {"score": 0.004132312946154097, "phrase": "service_interface"}, {"score": 0.004031082737449308, "phrase": "dynamic_discovery"}, {"score": 0.00389994107619882, "phrase": "different_sources"}, {"score": 0.003804381587788162, "phrase": "unique_opportunity"}, {"score": 0.003773049633656302, "phrase": "ubiquitous_computing"}, {"score": 0.003726533059542558, "phrase": "potential_framework"}, {"score": 0.0036202043425301042, "phrase": "home_appliances"}, {"score": 0.0035755653799043, "phrase": "networked_devices"}, {"score": 0.0034879261743468574, "phrase": "remote_installation"}, {"score": 0.0031064226956732497, "phrase": "specific_form"}, {"score": 0.0029194625087935345, "phrase": "heterogeneous_network"}, {"score": 0.0027665315772006575, "phrase": "dynamic_service's_mobility"}, {"score": 0.0025892330566358503, "phrase": "osgi_framework_environment"}, {"score": 0.002494531100339247, "phrase": "mobile_service_management_system"}, {"score": 0.0021049977753042253, "phrase": "mobile_services"}], "paper_keywords": [""], "paper_abstract": "The Open Services Gateway Initiative (OSGi) attempts to meet the ubiquitous computing environment by providing a managed, extensible framework to connect various devices in a local network such as in a home, office, or automobile. By defining a standard execution environment and service interface, the OSGi promotes the dynamic discovery and collaboration of devices and services from different sources. The OSGi offers a unique opportunity for ubiquitous computing as a potential framework for achieving interoperability between various sensors, home appliances, and networked devices. The OSGi framework supports a remote installation of a bundle, which is a unit that installs and deploys services. However, in order for the service in execution to move, a specific form of bundle such a mobile service manager is needed, one which is able to move through a heterogeneous network. This paper proposes a method that can manage bundles for supporting dynamic service's mobility between frameworks, in order to ensure the mobility of services in a multiple the OSGi framework environment. For our purposes, we have designed the mobile service management system for managing the lifecycle of the bundle and for the mobility of services in the OSGi framework. The mobile service management system we are proposing implements a bundle form which can perform in an OSGi framework as well as manage the mobile services. As a result, mobility in a ubiquitous computing environment will be supported more efficiently.", "paper_title": "Service mobility manager for OSGi framework", "paper_id": "WOS:000237649800003"}