{"auto_keywords": [{"score": 0.047170124188342995, "phrase": "static_optimisation"}, {"score": 0.01249709649927002, "phrase": "global_minimum"}, {"score": 0.00481495049065317, "phrase": "gradient-based_and_random_search_static_optimisation_algorithms"}, {"score": 0.004301834610818624, "phrase": "over-estimating_force_magnitudes"}, {"score": 0.003916098498242888, "phrase": "sqp's_difficulty"}, {"score": 0.003771631577951067, "phrase": "complex_optimisation_problems"}, {"score": 0.0034118234596993836, "phrase": "muscle_forces"}, {"score": 0.003265365666305185, "phrase": "lower_extremity"}, {"score": 0.003125175084962886, "phrase": "stance_phase"}, {"score": 0.002341958851390876, "phrase": "smaller_cost_function_scores"}, {"score": 0.0021857688650276743, "phrase": "sqp"}, {"score": 0.0021049977753042253, "phrase": "cubed_muscle"}], "paper_keywords": ["muscle force", " optimisation", " random search", " running"], "paper_abstract": "Muscle forces during locomotion are often predicted using static optimisation and SQP. SQP has been criticised for over-estimating force magnitudes and under-estimating co-contraction. These problems may be related to SQP's difficulty in locating the global minimum to complex optimisation problems. Algorithms designed to locate the global minimum may be useful in addressing these problems. Muscle forces for 18 flexors and extensors of the lower extremity were predicted for 10 subjects during the stance phase of running. Static optimisation using SQP and two random search (RS) algorithms (a genetic algorithm and simulated annealing) estimated muscle forces by minimising the sum of cubed muscle stresses. The RS algorithms predicted smaller peak forces (42% smaller on average) and smaller muscle impulses (46% smaller on average) than SQP, and located solutions with smaller cost function scores. Results suggest that RS may be a more effective tool than SQP for minimising the sum of cubed muscle stresses in static optimisation.", "paper_title": "Muscle forces during running predicted by gradient-based and random search static optimisation algorithms", "paper_id": "WOS:000263717100010"}