{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "infused_design"}, {"score": 0.0047057084749407485, "phrase": "human_creativity"}, {"score": 0.004620093797504386, "phrase": "computational_means"}, {"score": 0.0032886455096627324, "phrase": "design_solutions"}, {"score": 0.0031845067058084583, "phrase": "remote_disciplines"}, {"score": 0.00283870598459543, "phrase": "underlying_discrete_mathematical_representation"}, {"score": 0.002723607240517261, "phrase": "computer_tool"}, {"score": 0.0024501740852758505, "phrase": "new_active_torque_amplifier_system"}, {"score": 0.002255431275670053, "phrase": "design_methods"}, {"score": 0.002214297250267208, "phrase": "future_developments"}, {"score": 0.0021049977753042253, "phrase": "elseiver_ltd."}], "paper_keywords": ["Creativity", " Conceptual design", " Graph representation", " Collaborative design", " Design support systems", " Framework", " Analogy"], "paper_abstract": "Many methods that support human creativity by manual or computational means have been proposed in the past. They rely on the assumption that following a certain process of reasoning might lead to generating ideas considered creative. We start by defining creativity as a capability that enables the creation of systems that are patentable. We review the state-of-the-art of creative conceptual design and organize it with a framework. Subsequently, we present a method called infused design that guarantees the generation of design solutions by transforming systems and methods from remote disciplines. In many cases, these solutions would be deemed creative. Finding these systems and their transformations is done through a process based on the underlying discrete mathematical representation. This process is partially supported by a computer tool. We describe the method of infused design and illustrate its operation through part of the results achieved until now, including designing a new active torque amplifier system. We further demonstrate its benefits through other examples. We discuss the relation of infused design with other creativity or design methods and conclude with future developments of the method. (C) 2009 Published by Elseiver Ltd.", "paper_title": "Creative conceptual design: Extending the scope by infused design", "paper_id": "WOS:000265816300002"}