{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-resolution_occupied_voxel_lists"}, {"score": 0.004492841495994535, "phrase": "large_part"}, {"score": 0.004211594861013822, "phrase": "large_amount"}, {"score": 0.0038046452381676967, "phrase": "occupied_voxel_lists"}, {"score": 0.0035994372026264478, "phrase": "voxel_lists"}, {"score": 0.003517223847512266, "phrase": "voxel_based_data_structures"}, {"score": 0.0031045562469735307, "phrase": "range_sensor"}, {"score": 0.0030617935728586006, "phrase": "prior_global_map"}, {"score": 0.0030196181347744372, "phrase": "office_environment"}, {"score": 0.0025565050791036973, "phrase": "mrol_based_sequential_scan_matching"}, {"score": 0.00249805321224923, "phrase": "standard_iterative_closest_point"}, {"score": 0.0023851187337905412, "phrase": "initial_pose_estimate"}, {"score": 0.0022772782536385717, "phrase": "mrol"}], "paper_keywords": ["Mobile robotics", " Localisation", " 3D mapping", " 3D laser scanner", " SLAM"], "paper_abstract": "Most current navigation algorithms in mobile robotics produce 2D maps from data provided by 2D sensors. In large part this is due to the availability of suitable 3D sensors and difficulties of managing the large amount of data supplied by 3D sensors. This paper presents a novel, multi-resolution algorithm that aligns 3D range data stored in occupied voxel lists so as to facilitate the construction of 3D maps. Multi-resolution occupied voxel lists (MROL) are voxel based data structures that efficiently represent 3D scan and map information. The process described in this research can align a sequence of scans to produce maps and localise a range sensor within a prior global map. An office environment (200 square metres) is mapped in 3D at 0.02 m resolution, resulting in a 200,000 voxel occupied voxel list. Global localisation within this map, with no prior pose estimate, is completed in 5 seconds on a 2 GHz processor. The MROL based sequential scan matching is compared to a standard iterative closest point (ICP) implementation with an error in the initial pose estimate of plus or minus 1 m and 90 degrees. MROL correctly scan matches 94% of scans to within 0.1 m as opposed to ICP with 30% within 0.1 m.", "paper_title": "3D mapping with multi-resolution occupied voxel lists", "paper_id": "WOS:000273234700002"}