{"auto_keywords": [{"score": 0.04327832021381774, "phrase": "aggregation_operators"}, {"score": 0.00481495049065317, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.0038761135052054765, "phrase": "multidimensional_evaluation_values"}, {"score": 0.0038085117064624208, "phrase": "intuitionistic_fuzzy_values"}, {"score": 0.00376409764683147, "phrase": "collective_values"}, {"score": 0.0035915423738916256, "phrase": "intuitionistic_fuzzy_hybrid_weighted_aggregation_operators"}, {"score": 0.003487721546598799, "phrase": "intuitionistic_fuzzy_hybrid"}, {"score": 0.003212663446866794, "phrase": "generalized_intuitionistic_fuzzy_hybrid"}, {"score": 0.002725740264152553, "phrase": "desirable_properties"}, {"score": 0.002353554841514325, "phrase": "intuitionistic_fuzzy_information"}, {"score": 0.0022455164874830777, "phrase": "human_resource_management"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": [""], "paper_abstract": "Intuitionistic fuzzy sets (IFSs) have attracted more and more scholars' attention due to their powerfulness in expressing vagueness and uncertainty. In the course of decision making with IFSs, aggregation operators play a very important role since they can be used to synthesize multidimensional evaluation values represented as intuitionistic fuzzy values into collective values. This paper proposes a family of intuitionistic fuzzy hybrid weighted aggregation operators, such as the intuitionistic fuzzy hybrid weighted averaging operator, the intuitionistic fuzzy hybrid weighted geometric operator, the generalized intuitionistic fuzzy hybrid weighted averaging operator, and the generalized intuitionistic fuzzy hybrid weighted geometric operator. All these newly developed operators not only can weight both the arguments and their ordered positions simultaneously but also have some desirable properties, such as idempotency, boundedness, and monotonicity. To show the applications of our proposed intuitionistic fuzzy hybrid weighted aggregation operators, a simple schema for decision making with intuitionistic fuzzy information is developed. An example concerning the human resource management is given to illustrate the validity and applicability of the proposed method and also the hybrid weighted aggregation operators.", "paper_title": "Intuitionistic Fuzzy Hybrid Weighted Aggregation Operators", "paper_id": "WOS:000342345100001"}