{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "use_it-questionnaire"}, {"score": 0.008668637022125577, "phrase": "use_it-model"}, {"score": 0.0047323590206695305, "phrase": "healthcare_professionals"}, {"score": 0.004631099806015235, "phrase": "combined_quantitative_and_qualitative_socio-technical_approach"}, {"score": 0.004473552224535518, "phrase": "electronic_patient_records"}, {"score": 0.004102639724186862, "phrase": "care_providers"}, {"score": 0.004014800383343256, "phrase": "research_approach"}, {"score": 0.003828091961373454, "phrase": "use_it-interview_model"}, {"score": 0.003618558599449415, "phrase": "valid_and_useful_integrated_approach"}, {"score": 0.0033471722682967046, "phrase": "principal_component_analysis"}, {"score": 0.0033039560332995136, "phrase": "quantitative_results"}, {"score": 0.003109519872758431, "phrase": "resulting_factors"}, {"score": 0.0029647862293448895, "phrase": "factor_analysis"}, {"score": 0.002888692115811987, "phrase": "six_valid_factors"}, {"score": 0.002766934368402589, "phrase": "interface"}, {"score": 0.0024078737745407614, "phrase": "detailed_questions"}, {"score": 0.0021982976170703884, "phrase": "construct_task_support_satisfaction"}], "paper_keywords": ["Electronic health records", " qualitative evaluation", " quantitative evaluation", " socio-technical research"], "paper_abstract": "Background: A combined quantitative and qualitative socio-technical approach is applied in two evaluation studies of electronic patient records (EPR). In these studies the focus was on factors influencing the adoption of the EPR by care providers. Objective: The research approach is based on the USE IT-model. In addition to the USE IT-interview model, the USE IT-questionnaire is presented and evaluated in order to present a valid and useful integrated approach for the evaluation of IT-adoption in healthcare. Methods: The USE IT-questionnaire was evaluated by applying a principal component analysis of the quantitative results in two cases (n = 222), and by comparison of the resulting factors with the determinants of the USE IT-model. Results: The factor analysis of the USE IT-questionnaire resulted in six valid factors: 1. Task support satisfaction, 2. Interface satisfaction, 3. Compatibility, 4. Collaboration, 5. Learnability, and 6. Accessibility. The questions about resources did not combine into a factor. Conclusion: The detailed questions of the questionnaire lead to decomposition of the constructs Task support satisfaction and Ease of use into factors. The construct Task support satisfaction which was supposed to measure relevance was decomposed in two factors measuring relevance and two factors measuring micro-requirements.", "paper_title": "Evaluation of the USE IT-questionnaire for the Evaluation of the Adoption of Electronic Patient Records by Healthcare Professionals", "paper_id": "WOS:000319711200003"}