{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "beta_regression"}, {"score": 0.004316722156877335, "phrase": "maximum_likelihood_estimator"}, {"score": 0.003815064377019477, "phrase": "beta_regression_toolbox"}, {"score": 0.0034526196622103066, "phrase": "smithson"}, {"score": 0.0031096747349602344, "phrase": "classical_least_squares_regression"}, {"score": 0.0029652292779277782, "phrase": "lemon-based_drinks"}, {"score": 0.002546466113418944, "phrase": "r_package_betareg"}, {"score": 0.002416589459425828, "phrase": "generic_algorithms"}, {"score": 0.0023485549678832628, "phrase": "model-based_recursive_partioning"}, {"score": 0.0023152577218214804, "phrase": "finite_mixture_models"}, {"score": 0.0022393843660697484, "phrase": "new_functions"}, {"score": 0.0021352776064254195, "phrase": "object-oriented_flexible_implementation"}, {"score": 0.0021049977753042253, "phrase": "r_packages_party"}], "paper_keywords": ["beta regression", " bias correction", " bias reduction", " recursive partitioning", " finite mixture", " R"], "paper_abstract": "Beta regression -an increasingly popular approach for modeling rates and proportions - is extended in various directions: (a) bias correction/reduction of the maximum likelihood estimator, (b) beta regression tree models by means of recursive partitioning, (c) latent class beta regression by means of finite mixture models. All three extensions may be of importance for enhancing the beta regression toolbox in practice to provide more reliable inference and capture both observed and unobserved/latent heterogeneity in the data. Using the analogy of Smithson and Verkuilen (2006), these extensions make beta regression not only \"a better lemon squeezer\" (compared to classical least squares regression) but a full-fledged modern juicer offering lemon-based drinks: shaken and stirred (bias correction and reduction), mixed (finite mixture model), or partitioned (tree model). All three extensions are provided in the R package betareg (at least 2.4-0), building on generic algorithms and implementations for bias correction/reduction, model-based recursive partioning, and finite mixture models, respectively. Specifically, the new functions betatree () and betamix () reuse the object-oriented flexible implementation from the R packages party and flexmix, respectively.", "paper_title": "Extended Beta Regression in R: Shaken, Stirred, Mixed, and Partitioned", "paper_id": "WOS:000305118500001"}