{"auto_keywords": [{"score": 0.048412942923644654, "phrase": "long-term_activity"}, {"score": 0.046448599314105624, "phrase": "health_status"}, {"score": 0.03977533980933178, "phrase": "subject's_body"}, {"score": 0.004814996258446894, "phrase": "accelerometer"}, {"score": 0.004485735417293941, "phrase": "good_indicator"}, {"score": 0.00438105507792004, "phrase": "mobility_data"}, {"score": 0.004228577663320847, "phrase": "elderly_patients"}, {"score": 0.004065348865695599, "phrase": "long-term_physical_activity"}, {"score": 0.003832198214757852, "phrase": "different_positions"}, {"score": 0.003584025547693836, "phrase": "existing_accelerometer-based_activity_recognition_systems"}, {"score": 0.003299460925313939, "phrase": "unsupervised_free-living"}, {"score": 0.00320970209394799, "phrase": "fixed_life_pattern"}, {"score": 0.003085681391556093, "phrase": "novel_single-triaxial-accelerometer-based_activity_recognition_system"}, {"score": 0.002763261749602258, "phrase": "seven_activities"}, {"score": 0.002494039334114861, "phrase": "five_positions"}, {"score": 0.002181069180139225, "phrase": "average_recognition_accuracy"}, {"score": 0.0021049977753042253, "phrase": "continuous_long-term_activity"}], "paper_keywords": ["Physical activity recognition", " Accelerometer", " Linear discriminant analysis", " Artificial neural nets"], "paper_abstract": "Mobility is a good indicator of health status and thus objective mobility data could be used to assess the health status of elderly patients. Accelerometry has emerged as an effective means for long-term physical activity monitoring in the elderly. However, the output of an accelerometer varies at different positions on a subject's body, even for the same activity, resulting in high within-class variance. Existing accelerometer-based activity recognition systems thus require firm attachment of the sensor to a subject's body. This requirement makes them impractical for long-term activity monitoring during unsupervised free-living as it forces subjects into a fixed life pattern and impede their daily activities. Therefore, we introduce a novel single-triaxial-accelerometer-based activity recognition system that reduces the high within-class variance significantly and allows subjects to carry the sensor freely in any pocket without its firm attachment. We validated our system using seven activities: resting (lying/sitting/standing), walking, walking-upstairs, walking-downstairs, running, cycling, and vacuuming, recorded from five positions: chest pocket, front left trousers pocket, front right trousers pocket, rear trousers pocket, and inner jacket pocket. Its simplicity, ability to perform activities unimpeded, and an average recognition accuracy of 94% make our system a practical solution for continuous long-term activity monitoring in the elderly.", "paper_title": "Accelerometer's position independent physical activity recognition system for long-term activity monitoring in the elderly", "paper_id": "WOS:000284781400012"}