{"auto_keywords": [{"score": 0.031565831968408925, "phrase": "repeat_units"}, {"score": 0.008008734271580432, "phrase": "electron_transport"}, {"score": 0.004491506786670695, "phrase": "empirical_dispersion_correction"}, {"score": 0.0036753171449945654, "phrase": "binding_energies"}, {"score": 0.0035861227263414537, "phrase": "metal-free_nanoarrays"}, {"score": 0.0034847851398628546, "phrase": "metal-containing_ones"}, {"score": 0.0034422330919613294, "phrase": "band_gaps"}, {"score": 0.003304097742490624, "phrase": "infinite_chain_limit"}, {"score": 0.003158522476399068, "phrase": "band_gap_size"}, {"score": 0.0029100272315053253, "phrase": "ionization_potentials"}, {"score": 0.0028862761537904206, "phrase": "electron_affinities"}, {"score": 0.0026810296502682916, "phrase": "polaron_delocalization"}, {"score": 0.0026482660253173075, "phrase": "related_reorganization_energies"}, {"score": 0.0025211567863488962, "phrase": "themetal-free_and_zn-containing_nanoarrays"}, {"score": 0.002266246304762945, "phrase": "reorganization_energies"}, {"score": 0.0022111720236287547, "phrase": "infinitely_long_chain"}, {"score": 0.0021662983565317283, "phrase": "cd-"}, {"score": 0.002148604369150115, "phrase": "hg-containing_nanoarrays"}], "paper_keywords": ["Porphyrin", " DFT", " Dispersion correction", " Reorganization energy", " Polarons"], "paper_abstract": "Metal-free, Zn-, Cd-, and Hg-containing one-dimensional tetraphenylporphyrin arrays containing up to eight repeat units were modeled at the PBE/def2-SVP level of theory with D3 empirical dispersion correction. Two different configurations-face to face (F) and parallel displaced (P)-were detected, the latter being the most stable for all types of nanoarrays. According to the calculations, the binding that occurs in nanoarrays is mostly due to dispersion, with binding energies of 33-35 kcal/mol seen for the metal-free nanoarrays and energies of 37-40 kcal/mol for the metal-containing ones. The band gaps, estimated as the S0 -> S1 excitation energies and extrapolated to the infinite chain limit using the TD-CAM-B3LYP/def2-SVP model, were close to 2 eV; the band gap size was barely dependent on the nature of the metal and the number of repeat units in the nanoarray. The ionization potentials and electron affinities were greatly influenced by the number of repeat units due to delocalization of polarons across each nanoarray. Polaron delocalization and the related reorganization energies were clearly dependent on the nature of the metal. For themetal-free and Zn-containing nanoarrays, the reorganization energies for hole and electron transport decreased linearly with 1/n, where n is the number of repeat units in the nanoaggregate. The reorganization energies therefore reach zero for an infinitely long chain. These energies for Cd- and Hg-containing nanoarrays were found to be one order of magnitude higher for both hole and electron transport due to the localization of polarons in these nanoarrays.", "paper_title": "Zinc-, cadmium-, and mercury-containing one-dimensional tetraphenylporphyrin arrays: a DFT study", "paper_id": "WOS:000334934900009"}