{"auto_keywords": [{"score": 0.036588740387536144, "phrase": "dominance_relation"}, {"score": 0.008713768692145006, "phrase": "qualitative_preferences"}, {"score": 0.007739373246339948, "phrase": "functional_requirement"}, {"score": 0.007158737643064031, "phrase": "user_preferences"}, {"score": 0.0047823219739028325, "phrase": "compositional_systems"}, {"score": 0.0038336889370744662, "phrase": "non-functional_properties"}, {"score": 0.0036553070575015344, "phrase": "relative_importance"}, {"score": 0.0031682817605340028, "phrase": "key_properties"}, {"score": 0.003010496595090984, "phrase": "strict_partial_order"}, {"score": 0.002949598537993663, "phrase": "preference_relations"}, {"score": 0.002929573369977573, "phrase": "strict_partial_orders"}, {"score": 0.0028997895009747502, "phrase": "relative_importance_preference_relation"}, {"score": 0.0028703075616629634, "phrase": "interval_order"}, {"score": 0.00240426758768164, "phrase": "simulation_experiments"}, {"score": 0.0023798115577749225, "phrase": "proposed_algorithms"}, {"score": 0.0021484955960643167, "phrase": "interesting_conjectures"}], "paper_keywords": [""], "paper_abstract": "Many applications, e.g., Web service composition, complex system design, team formation, etc., rely on methods for identifying collections of objects or entities satisfying some functional requirement. Among the collections that satisfy the functional requirement, it is often necessary to identify one or more collections that are optimal with respect to user preferences over a set of attributes that describe the non-functional properties of the collection. We develop a formalism that lets users express the relative importance among attributes and qualitative preferences over the valuations of each attribute. We define a dominance relation that allows us to compare collections of objects in terms of preferences over attributes of the objects that make up the collection. We establish some key properties of the dominance relation. In particular, we show that the dominance relation is a strict partial order when the intra-attribute preference relations are strict partial orders and the relative importance preference relation is an interval order. We provide algorithms that use this dominance relation to identify the set of most preferred collections. We show that under certain conditions, the algorithms are guaranteed to return only (sound), all (complete), or at least one (weakly complete) of the most preferred collections. We present results of simulation experiments comparing the proposed algorithms with respect to (a) the quality of solutions (number of most preferred solutions) produced by the algorithms, and (b) their performance and efficiency. We also explore some interesting conjectures suggested by the results of our experiments that relate the properties of the user preferences, the dominance relation, and the algorithms.", "paper_title": "Representing and Reasoning with Qualitative Preferences for Compositional Systems", "paper_id": "WOS:000296924000001"}