{"auto_keywords": [{"score": 0.049010515885303176, "phrase": "linguistic_terms"}, {"score": 0.02819827616624647, "phrase": "group_recommendations"}, {"score": 0.018263080193260405, "phrase": "group_consensus_degree"}, {"score": 0.013563847145710937, "phrase": "likelihood-based_comparison_relations"}, {"score": 0.007344180178332139, "phrase": "proposed_method"}, {"score": 0.00439918275666155, "phrase": "new_method"}, {"score": 0.0040010534672646775, "phrase": "collective_interval_linguistic_preference_matrix"}, {"score": 0.0038070472635126276, "phrase": "collective_preference_matrix"}, {"score": 0.003638823482920949, "phrase": "obtained_collective_preference_matrix"}, {"score": 0.0031917146566068245, "phrase": "consensus_degree"}, {"score": 0.0029289191071848403, "phrase": "predefined_threshold_value"}, {"score": 0.002712131567923321, "phrase": "interval_linguistic_preference_matrix"}, {"score": 0.002367875199095903, "phrase": "predefined_consensus_threshold_value"}, {"score": 0.0022733662000757318, "phrase": "ben-arieh"}, {"score": 0.002252880693912436, "phrase": "chen's_method"}, {"score": 0.002232579371411546, "phrase": "chen_and_lee's_method"}, {"score": 0.0021049977753042253, "phrase": "useful_way"}], "paper_keywords": ["Consensus measures", " group decision making", " intervals of linguistic terms", " likelihood-based comparison relations"], "paper_abstract": "In this paper, we propose a new method for autocratic decision making using group recommendations based on intervals of linguistic terms and likelihood-based comparison relations. Firstly, the proposed method builds a collective interval linguistic preference matrix and uses likelihood-based comparison relations of intervals of linguistic terms to build a collective preference matrix for all experts. Then, based on the obtained collective preference matrix, it calculates the score of each alternative. The larger the score, the better the preference order of the alternative. Then, it calculates the consensus degree of each expert and calculates the group consensus degree of all experts. If the group consensus degree is smaller than a predefined threshold value between zero and one, then it modifies some of the intervals of linguistic terms in the interval linguistic preference matrix of the expert whose consensus degree is smaller than the group consensus degree. The above process is performed repeatedly, until the group consensus degree for all experts is larger than or equal to a predefined consensus threshold value. The proposed method can overcome the drawbacks of Ben-Arieh and Chen's method and Chen and Lee's method for autocratic decision making using group recommendations. It provides us with a useful way for autocratic decision making using group recommendations based on intervals of linguistic terms and likelihood-based comparison relations.", "paper_title": "Autocratic Decision Making Using Group Recommendations Based on Intervals of Linguistic Terms and Likelihood-Based Comparison Relations", "paper_id": "WOS:000348126100006"}