{"auto_keywords": [{"score": 0.042212060457322266, "phrase": "composite_lineages"}, {"score": 0.019078982092666594, "phrase": "path_lineages"}, {"score": 0.009902952514198086, "phrase": "conjunctive_queries"}, {"score": 0.008621977002752622, "phrase": "lineage_graphs"}, {"score": 0.00481495049065317, "phrase": "responsibility_analysis_for_lineages_of_conjunctive_queries"}, {"score": 0.003581797255879607, "phrase": "shortest_path_problem"}, {"score": 0.003459191419478298, "phrase": "dynamic_programming_algorithm"}, {"score": 0.0034292003259811946, "phrase": "ptime."}, {"score": 0.003129515081085354, "phrase": "ptime"}, {"score": 0.00303553181618577, "phrase": "iq_queries"}, {"score": 0.0029701328654852246, "phrase": "previous_results"}, {"score": 0.002918826667294298, "phrase": "responsibility_analysis"}, {"score": 0.002652039172817654, "phrase": "data_population"}, {"score": 0.0022967713922705, "phrase": "greedy_algorithm"}, {"score": 0.002218054404179068, "phrase": "set_cover_problem"}, {"score": 0.00212343307513777, "phrase": "proposed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "extensive_experimental_results"}], "paper_keywords": ["Lineage", " responsibility", " conjunctive queries with inequalities", " dynamic programming algorithm", " greedy algorithm"], "paper_abstract": "This paper investigates the problem of efficiently computing responsibility for lineages of conjunctive queries with inequalities on databases. We classify the lineages of a class of queries with inequalities, called IQ queries, into path and composite lineages. We first compile path lineages into lineage graphs and transform lineage graphs into matrices. Then we reduce the problem of computing responsibility for path lineages to the shortest path problem, which can be solved by the dynamic programming algorithm in PTIME. We further prove composite lineages can be decomposed into path lineages for computing responsibility. Thus, our first main result shows it is in PTIME to compute responsibility for lineages of IQ queries. We generalize the previous results on dichotomy of responsibility analysis for lineages of conjunctive queries with equalities, now in the presence of inequalities. After decomposing composite lineages into path lineages, the data population needed for computing responsibility decreases more than one order of magnitude. Thus, our algorithm can efficiently compute responsibility for composite lineages. In order to compute responsibility for lineages in general, we introduce a greedy algorithm, consisting of a reduction to the set cover problem. Finally, we demonstrate the benefits of the proposed algorithms with extensive experimental results.", "paper_title": "Responsibility Analysis for Lineages of Conjunctive Queries with Inequalities", "paper_id": "WOS:000340205000017"}