{"auto_keywords": [{"score": 0.05007848702261487, "phrase": "conjunctive_queries"}, {"score": 0.031901763874956926, "phrase": "ucq"}, {"score": 0.03126302789039481, "phrase": "ucq_query_q"}, {"score": 0.004571133708117498, "phrase": "query_answering"}, {"score": 0.0038304902197108643, "phrase": "efficient_sound_and_complete_algorithm"}, {"score": 0.0037516215763875225, "phrase": "equivalent_rewritings"}, {"score": 0.003693533648584145, "phrase": "minimum_number"}, {"score": 0.0034881076466982226, "phrase": "view_tuple_generating_dependencies"}, {"score": 0.00331125524068286, "phrase": "efficient_algorithm"}, {"score": 0.0032430426853131346, "phrase": "maximally_contained_rewritings"}, {"score": 0.003078577062864183, "phrase": "finite_unions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Conjunctive queries", " Views", " Certain answers", " Query rewritings", " Dependencies"], "paper_abstract": "In this paper we consider conjunctive queries and views, and we investigate the problem of query answering using views in the presence of dependencies and in particular the problem of finding equivalent and maximally contained rewritings of a query using a set of views in the presence of dependencies. We present an efficient sound and complete algorithm CoreCoverC which finds equivalent rewritings with the minimum number of subgoals in the presence of weakly acyclic local as view tuple generating dependencies (C(LAV)(W)). We also present an efficient algorithm MINICONC that finds maximally contained rewritings (MCRs) with respect to the language of finite unions of conjunctive queries (UCQ) of a UCQ query Q in the presence of C(LAV)(W). We also prove that an IVICR of a UCQ query Q with respect to UCQ computes al the certain answers of Q both in the absence and presence of a set of dependencies C if the chase of Q with C terminates (and, in the case of dependencies, if such an MCR exists). (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Computing certain answers in the presence of dependencies", "paper_id": "WOS:000273100000003"}