{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "identifying_objects"}, {"score": 0.004762202897268383, "phrase": "physical_space"}, {"score": 0.004523552067565685, "phrase": "unique_identification"}, {"score": 0.0043764594918057915, "phrase": "physical_world"}, {"score": 0.004234129588974058, "phrase": "small_tag"}, {"score": 0.003977741661623133, "phrase": "optical_communication_link"}, {"score": 0.0038909934410379775, "phrase": "reader_device"}, {"score": 0.0038342108263454628, "phrase": "unique_id"}, {"score": 0.0037921662574137535, "phrase": "tag_memory"}, {"score": 0.0035887342563437935, "phrase": "cloud_database"}, {"score": 0.0033220706785945815, "phrase": "optical_instead_of_rf_communication"}, {"score": 0.003190367939051776, "phrase": "single_number"}, {"score": 0.0031553611552558986, "phrase": "size_requirements"}, {"score": 0.0030526216870671325, "phrase": "larger_scale_prototype"}, {"score": 0.00300803677566719, "phrase": "end-to-end_operation"}, {"score": 0.002888747754856871, "phrase": "optical_tag"}, {"score": 0.0028675712105299496, "phrase": "active_photovoltaic_area"}, {"score": 0.0025868521085189843, "phrase": "tagid_and_taginfo_data_maintenance"}, {"score": 0.0021049977753042253, "phrase": "cyber_worlds"}], "paper_keywords": ["Internet of Things", " micropackaging", " optical identification (ID)", " smart tag"], "paper_abstract": "In this paper, an infrastructure that enables the association of a unique identification (ID) number to objects in the physical world is proposed. The system consists of a small tag that can be attached to any object. The tag is powered optically and establishes an optical communication link with a Reader. The Reader device can write a unique ID in the tag memory and can also readout the number. Each ID is also stored in a cloud database, which allows for associations of other attributes to the tag. By removing the need for a battery, using optical instead of RF communication, and minimizing the need for storing much information besides a single number, the size requirements on the tag are significantly reduced. A larger scale prototype is developed and end-to-end operation of the infrastructure is demonstrated. Prototyping is comprised the optical tag with active photovoltaic area of 1.44 mm(2) and dimension of 9.7 mm x 6.9 mm, a Reader that optically interrogates with tag through 9600 baud UART protocol, a two-columned debatable for TagID and TagInfo data maintenance and a mobile application. In the end, basic packaging requirements of the tags are discussed and custom spherical packages with 1.8-mm diameter are developed. In the future, it is possible to mass produce the tags at a very low cost and attach them to many physical objects in the environment-creating a bridge between the physical and the cyber worlds.", "paper_title": "UBITag: A Ubiquitous Optical Wireless Tag for Identifying Objects in the Physical Space", "paper_id": "WOS:000373098500009"}