{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "drop_port"}, {"score": 0.03862495247285584, "phrase": "oadf"}, {"score": 0.014594565606926128, "phrase": "bragg"}, {"score": 0.004184921610672245, "phrase": "optical_fiber_coupler"}, {"score": 0.0036370297611938796, "phrase": "fiber_grating-assisted_mismatched_coupler"}, {"score": 0.0034765814975475425, "phrase": "fbg"}, {"score": 0.0032571885279065126, "phrase": "fiber_grating"}, {"score": 0.002816246391862638, "phrase": "uniform_fbg"}, {"score": 0.002362620540317279, "phrase": "experimental_results"}, {"score": 0.002327310963701377, "phrase": "theoretical_analysis"}, {"score": 0.0021369416775353124, "phrase": "chirped_coefficient"}, {"score": 0.0021049977753042253, "phrase": "linearly_chirped_fbg."}], "paper_keywords": ["optical add/drop filter", " fiber Bragg grating", " coupler", " optical fiber communication"], "paper_abstract": "Writing a fiber Bragg grating (FBG) in an optical fiber coupler is a very effective way to implement an optical add/drop filter (OADF). In order to analyze the influences on the bandwidth at the drop port of the OADF using fiber grating-assisted mismatched coupler, a uniform FBG and a linearly chirped FBG were written on the coupler, and two different OADFs were fabricated. The fiber grating is written in a 2x2 mismatched coupler, which is fused and tapered with a standard single mode fiber (SMF) and a high germanium doped photosensitive fiber, by using a 248 nm ultraviolet laser. For the OADF using the uniform FBG, the 3 dB and 20 dB bandwidths are 0.1 nm and 0.3 nm, respectively; for the OADF using the linear chirped FBG, the 3 dB and 20 dB bandwidths are 0.8 nm and 2 nm, respectively. The experimental results meet the theoretical analysis well. The bandwidth at the drop port of the device can be adjusted by adjusting the chirped coefficient of the linearly chirped FBG.", "paper_title": "Influences on the bandwidth at the drop port of the add/drop filter using a fiber grating coupler by uniform and linearly chirped fiber Bragg grating", "paper_id": "WOS:000320077800004"}