{"auto_keywords": [{"score": 0.02311336431160628, "phrase": "spain"}, {"score": 0.00481495049065317, "phrase": "current_organization_systems"}, {"score": 0.004545240514015278, "phrase": "internal_controls"}, {"score": 0.004069631519385246, "phrase": "decision_support_process"}, {"score": 0.0037683358267785435, "phrase": "internal_auditing"}, {"score": 0.003138874040786261, "phrase": "associated_risk"}, {"score": 0.0030790429005600898, "phrase": "erroneous_processes"}, {"score": 0.0029203055813347874, "phrase": "developed_model"}, {"score": 0.002467536552997677, "phrase": "different_problem-solving_method"}, {"score": 0.0023743009016047424, "phrase": "reasoning_cycle"}, {"score": 0.0021049977753042253, "phrase": "obtained_results"}], "paper_keywords": [""], "paper_abstract": "The complexity of current organization systems, and the increase in the importance of the realization of internal controls in firms, make it necessary to construct models that automate and facilitate the work of auditors. A tool for the decision support process has been developed. The objective of the system is to facilitate the process of internal auditing in small and medium-sized enters prises. The system analyzes the data that characterizes each one of the activities carried out by the firm, then determines the state of each activity, calculates the associated risk, detects the erroneous processes, and generates recommendations to improve these processes. The developed model is composed of two case-based reasoning systems. One is used to identify the activities that may be improved and the other to determine how the activities could be improved. Each of the two subsystems use a different problem-solving method in each of the steps of the reasoning cycle. The system has been tested in 22 small and medium-sized companies in the textile sector, located in the northwest of Spain during the lost 38 months and the obtained results are very encouraging.", "paper_title": "A complex case-based advisor", "paper_id": "WOS:000256188700001"}