{"auto_keywords": [{"score": 0.03896650159418718, "phrase": "ra"}, {"score": 0.009927354421222548, "phrase": "requirements_elicitation"}, {"score": 0.00481495049065317, "phrase": "maturation_type"}, {"score": 0.004534428070512318, "phrase": "requirements_changes"}, {"score": 0.004136548839735555, "phrase": "software_component"}, {"score": 0.0041074234667687875, "phrase": "requirements_maturation"}, {"score": 0.0037336520904376687, "phrase": "requirements_analyst"}, {"score": 0.0035283552859817764, "phrase": "additional_requirements"}, {"score": 0.003264316172836322, "phrase": "maturation_periods"}, {"score": 0.00310664242361199, "phrase": "requirements_maturation_efficiency"}, {"score": 0.0028236828952575735, "phrase": "requirements_maturation_period"}, {"score": 0.002754616862142511, "phrase": "rme."}, {"score": 0.002706320734526367, "phrase": "rme"}, {"score": 0.002612238631882345, "phrase": "requirements_source"}, {"score": 0.0023491282852109757, "phrase": "model_stability"}, {"score": 0.00232431758517087, "phrase": "requirements_maturation_index"}, {"score": 0.002307924020868725, "phrase": "rmi"}, {"score": 0.002259426425685763, "phrase": "multiple_regression_analysis"}, {"score": 0.0021049977753042253, "phrase": "significant_level"}], "paper_keywords": ["requirements accessibility", " requirements stability", " requirements maturation"], "paper_abstract": "The success of any project can be affected by requirements changes. Requirements elicitation is a series of activities of adding, deleting, and modifying requirements. We refer to the completion of requirements elicitation of a software component as requirements maturation. When the requirements of each component have reached the 100% maturation point, no requirement will come to the component. This does not mean that a requirements analyst (RA) will reject the addition of requirements, but simply, that the additional requirements will not come to the project. Our motivation is to provide measurements by which an RA can estimate one of the maturation periods: the early, middle, or late period of the project. We will proceed by introducing the requirements maturation efficiency (RME). The RME of the requirements represents how quickly the requirements of a component reach 100% maturation. Then, we will estimate the requirements maturation period for every component by applying the RME. We assume that the RME is derived from its accessibility from an RA to the requirements source and the stability of the requirements. We model accessibility as the number of information flows from the source of the requirements to the RA, and further, model stability with the requirements maturation index (RMI). According to the multiple regression analysis of a case, we are able to get an equation on RME derived from these two factors with a significant level of 5%. We evaluated the result by comparing it to another case, and then discuss the effectiveness of the measurements.", "paper_title": "Estimation of the Maturation Type of Requirements from Their Accessibility and Stability", "paper_id": "WOS:000342784200004"}