{"auto_keywords": [{"score": 0.04166278199109335, "phrase": "base_station"}, {"score": 0.036917619129108854, "phrase": "proposed_algorithm"}, {"score": 0.015719716506582538, "phrase": "multicellular_network"}, {"score": 0.015270393623197247, "phrase": "user_demands"}, {"score": 0.004713379149462482, "phrase": "power_allocation"}, {"score": 0.004601658429231648, "phrase": "large_number"}, {"score": 0.004468684611798047, "phrase": "challenging_task"}, {"score": 0.004327981760540394, "phrase": "system_architecture"}, {"score": 0.004169394481182493, "phrase": "rate_allocation_algorithms"}, {"score": 0.004103212598803194, "phrase": "interfering_channels"}, {"score": 0.003757480190200645, "phrase": "achievable_limits"}, {"score": 0.0034684348261345295, "phrase": "fully_co-operative"}, {"score": 0.0034407781868385423, "phrase": "almost_no_co-operation"}, {"score": 0.003359119985242403, "phrase": "rate_allocation"}, {"score": 0.0031172218298389652, "phrase": "minimal_information"}, {"score": 0.002994859407965545, "phrase": "transmission_rates"}, {"score": 0.002947266048104005, "phrase": "time_slot"}, {"score": 0.002908181499274949, "phrase": "power_allocation_problem"}, {"score": 0.0028315560662729353, "phrase": "system_specific_capacity_region"}, {"score": 0.0027865506182608263, "phrase": "ordinary_differential_equation"}, {"score": 0.0026486862281576086, "phrase": "tracking_abilities"}, {"score": 0.00260657976055413, "phrase": "heterogeneous_networks"}, {"score": 0.0025109095718850376, "phrase": "synchronous_manner"}, {"score": 0.002431699464104896, "phrase": "simple_example_scenario"}, {"score": 0.002405853977978678, "phrase": "heterogeneous_agents"}, {"score": 0.0023675986784123656, "phrase": "different_speeds"}, {"score": 0.00232995025271599, "phrase": "numerical_examples"}, {"score": 0.002150481043278758, "phrase": "operating_speeds"}, {"score": 0.0021390191069313945, "phrase": "different_agents"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cellular networks", " MIMO", " Power allocation", " Stochastic approximation", " Ordinary differential equations"], "paper_abstract": "Power allocation to satisfy user demands, in the presence of large number of interferers (in a multicellular network), is a challenging task. Further, the power to be allocated depends upon the system architecture, for example upon components like coding, modulation, transmit precoder, rate allocation algorithms, available knowledge of the interfering channels, etc. This calls for an algorithm via which each base station in the network can simultaneously allocate power to their respective users so as to meet their demands (whenever they are within the achievable limits), using whatever information is available of the other users. The goal of our research is to propose one such algorithm which in fact is universal: the proposed algorithm works from a fully co-operative setting to almost no co-operation and or for any configuration of modulation, rate allocation, etc. schemes. The algorithm asymptotically satisfies the user demands, running simultaneously and independently within a given total power budget at each base station. Further, it requires minimal information to achieve this: every base station needs to know its own users demands, its total power constraint and the transmission rates allocated to its users in every time slot. We formulate the power allocation problem in a system specific game theoretic setting, define system specific capacity region and analyze the proposed algorithm using ordinary differential equation (ODE) framework. Simulations further confirm the effectiveness of the proposed algorithm. We also demonstrate the tracking abilities of the algorithm. In heterogeneous networks, it is hard to expect the various agents to update their algorithms in a synchronous manner. Using two time scale stochastic approximation analysis we study the proposed algorithm operating in a simple example scenario, wherein the heterogeneous agents update (their power profiles) at different speeds. Further, backed by numerical examples (for various generic example scenarios), we show that the algorithm converges to the same power profile, as long as the demands remain same, irrespective of the disparities in the operating speeds at different agents. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Satisfying demands in a multicellular network: A universal power allocation algorithm", "paper_id": "WOS:000326365800010"}