{"auto_keywords": [{"score": 0.04797725309056393, "phrase": "company_identity_information_disclosure"}, {"score": 0.014384077437632927, "phrase": "first_visit"}, {"score": 0.014225189651094485, "phrase": "company_website"}, {"score": 0.010338881166908653, "phrase": "consumer_self-disclosure"}, {"score": 0.0040997480534580065, "phrase": "subject_experiment_design"}, {"score": 0.0037476506056460957, "phrase": "lisrel"}, {"score": 0.0036235254023315798, "phrase": "analytical_results"}, {"score": 0.0033747739383101095, "phrase": "greater_intentions"}, {"score": 0.003275197814021, "phrase": "study's_results"}, {"score": 0.003238616481108356, "phrase": "consumer's_trust"}, {"score": 0.0031195948946937378, "phrase": "practical_implications_-_companies"}, {"score": 0.0030502854924662837, "phrase": "personal_information"}, {"score": 0.002606264765409507, "phrase": "higher_disclosure_intentions"}, {"score": 0.002418099158357658, "phrase": "previous_research"}, {"score": 0.002373214852820709, "phrase": "online_information_disclosure"}, {"score": 0.002260367486652148, "phrase": "potential_impact"}, {"score": 0.0021049977753042253, "phrase": "important_role"}], "paper_keywords": ["Disclosure", " Communication", " Trust", " Corporate identity", " Internet"], "paper_abstract": "Purpose - This paper aims to investigate the relationship between company identity information disclosure, trust, and consumer self-disclosure intentions during the first visit to a company website. Design/methodology/approach - This study conducts one-factor (company identity information disclosure) between-subject experiment design. Participants were randomly assigned into two groups: company identity information disclosure - high vs low. Furthermore, this study also uses LISREL to analyse the model. Findings - The analytical results indicate that when a company website discloses much of its identity information, consumers trust the company more, and exhibit greater intentions to provide their personal information. Specifically, this study's results show that consumer's trust mediates the relationship between company identity information disclosure and consumer self-disclosure intentions. Practical implications - Companies often invite consumers to disclose personal information on websites, and then use this information to build and maintain relationships with these customers. This study suggests that a company can disclose their information more on their website. Consequently, consumers trust more toward the company and then have higher disclosure intentions. Originality/value - Traditionally, most interpersonal communication research indicates when someone discloses more, the other communication participant also discloses more. Although previous research investigates the impact of online information disclosure on trust and consumer self-disclosure, there are no studies that address the potential impact of a company disclosing information about its identity. This study examines the influence of company identity information disclosure and emphasises the important role of trust during the first visit to a website.", "paper_title": "Mutual self-disclosure online in the B2C context", "paper_id": "WOS:000272529200002"}