{"auto_keywords": [{"score": 0.04903589335092133, "phrase": "optimal_search_strategies"}, {"score": 0.0443587048584781, "phrase": "multiple_search_platforms"}, {"score": 0.009000054634664946, "phrase": "sghc_algorithms"}, {"score": 0.00481495049065317, "phrase": "simultaneous_generalized_hill"}, {"score": 0.004408729661992651, "phrase": "limited_assets"}, {"score": 0.00433645229352341, "phrase": "significant_interest"}, {"score": 0.00428892403807229, "phrase": "military_decision_makers"}, {"score": 0.004195418010131832, "phrase": "varying_capabilities"}, {"score": 0.003555902292752528, "phrase": "efficient_use"}, {"score": 0.003516898780234098, "phrase": "available_search_platforms"}, {"score": 0.0031495640320537252, "phrase": "multiple_traveling_salesman_problem"}, {"score": 0.002996992362027833, "phrase": "simultaneous_generalized_hill_climbing_algorithms"}, {"score": 0.0027741761880779535, "phrase": "mtsp._computational_results"}, {"score": 0.0026838151961101455, "phrase": "mtsp"}, {"score": 0.0025537472239953807, "phrase": "limited_computing_budgets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["search and rescue operations", " simulated annealing", " local search algorithms", " traveling salesman problem"], "paper_abstract": "Optimal search strategies for conducting reconnaissance, surveillance or search and rescue operations with limited assets are of significant interest to military decision makers. Multiple search platforms with varying capabilities can be deployed individually or simultaneously for these operations (e.g., helicopters, fixed wing or satellite). Due to the timeliness required in these operations, efficient use of available search platforms is critical to the success of such missions. Designing optimal search strategies over multiple search platforms can be modeled and solved as a multiple traveling salesman problem (MTSP). This paper demonstrates how simultaneous generalized hill climbing algorithms (SGHC) can be used to determine optimal search strategies over multiple search platforms for the MTSP. Computational results with SGHC algorithms applied to the MTSP are reported. These results demonstrate that when limited computing budgets are available, optimal/near-optimal search strategies over multiple search platforms can be obtained more efficiently using SGHC algorithms compared to other generalized hill climbing algorithms. Applications and extensions of this research to other military applications are also discussed. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Optimal search strategies using simultaneous generalized hill climbing algorithms", "paper_id": "WOS:000237816000007"}