{"auto_keywords": [{"score": 0.04326384103650438, "phrase": "csit."}, {"score": 0.020151104268036277, "phrase": "asymmetric_output_feedback"}, {"score": 0.015521846236898933, "phrase": "csit"}, {"score": 0.009241250144143516, "phrase": "mimo_x-channel"}, {"score": 0.007578802698366366, "phrase": "two-user_mimo_bc"}, {"score": 0.00540766342611604, "phrase": "security_constraints"}, {"score": 0.00481495049065317, "phrase": "mimo_x-channels"}, {"score": 0.004659951478263083, "phrase": "secure_transmission"}, {"score": 0.00428214338552216, "phrase": "different_transmitter"}, {"score": 0.0037770164557554635, "phrase": "optimal_sum_secure_degrees"}, {"score": 0.0035959257387697097, "phrase": "delayed_csit"}, {"score": 0.003461080809857424, "phrase": "sdof_region"}, {"score": 0.0031542123661080375, "phrase": "performance_loss"}, {"score": 0.0031199418866663543, "phrase": "sum_sdof"}, {"score": 0.0030860426028530646, "phrase": "distributed_nature"}, {"score": 0.002882336475814422, "phrase": "symmetric_manner"}, {"score": 0.0023418133729330303, "phrase": "optimal_sum_dof_region"}, {"score": 0.0022416018710803122, "phrase": "dof_region"}, {"score": 0.0021049977753042253, "phrase": "numerical_examples"}], "paper_keywords": ["Secrecy capacity", " degrees of freedom", " MIMO-X channels", " feedback", " channel state information"], "paper_abstract": "We investigate the problem of secure transmission over a two-user multi-input multi-output (MIMO) X-channel in which channel state information is provided with one-unit delay to both transmitters (CSIT), and each receiver feeds back its channel output to a different transmitter. We refer to this model as MIMO X-channel with asymmetric output feedback and delayed CSIT. The transmitters are equipped with antennas each, and the receivers are equipped with antennas each. For this model, accounting for both messages at each receiver, we characterize the optimal sum secure degrees of freedom (SDoF) region. We show that, in the presence of asymmetric output feedback and delayed CSIT, the sum SDoF region of the MIMO X-channel is the same as the SDoF region of a two-user MIMO BC with antennas at the transmitter, antennas at each receiver, and delayed CSIT. This result shows that, upon availability of asymmetric output feedback and delayed CSIT, there is no performance loss in terms of sum SDoF due to the distributed nature of the transmitters. Next, we show that this result also holds if only output feedback is conveyed to the transmitters, but in a symmetric manner, i.e., each receiver feeds back its output to both transmitters and no CSIT. We also study the case in which only asymmetric output feedback is provided to the transmitters, i.e., without CSIT, and derive a lower bound on the sum SDoF for this model. Furthermore, we specialize our results to the case in which there are no security constraints. In particular, similar to the setting with security constraints, we show that the optimal sum DoF region of the (M,M,N,N)-MIMO X-channel with asymmetric output feedback and delayed CSIT is the same as the DoF region of a two-user MIMO BC with antennas at the transmitter, antennas at each receiver, and delayed CSIT. We illustrate our results with some numerical examples.", "paper_title": "Secure Degrees of Freedom of MIMO X-Channels With Output Feedback and Delayed CSIT", "paper_id": "WOS:000327278100005"}