{"auto_keywords": [{"score": 0.04698204562156966, "phrase": "environmental_efficiency"}, {"score": 0.024111817871665685, "phrase": "beijing"}, {"score": 0.006759656126470509, "phrase": "beijing's_environmental_efficiency"}, {"score": 0.006592841763747953, "phrase": "dea_model"}, {"score": 0.006510974567715149, "phrase": "undesirable_outputs"}, {"score": 0.005488320127655414, "phrase": "first_step"}, {"score": 0.004703400342975225, "phrase": "independent_variables"}, {"score": 0.004337900700685262, "phrase": "data_envelopment_analysis"}, {"score": 0.004301838354975663, "phrase": "dea"}, {"score": 0.0039737570920809215, "phrase": "two-step_method"}, {"score": 0.003670608022642996, "phrase": "second_step"}, {"score": 0.003306559295382181, "phrase": "regression_model"}, {"score": 0.0024065032567542107, "phrase": "high_environmental_efficiency"}, {"score": 0.002346861891137455, "phrase": "tertiary_industry"}, {"score": 0.00231759652007697, "phrase": "whole_industries"}, {"score": 0.0022133711375320244, "phrase": "beijing's_industrial_structure"}, {"score": 0.002158505888557746, "phrase": "city's_environmental_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["DEA model", " Environmental efficiency", " Undesirable outputs"], "paper_abstract": "In this study, the environmental efficiency of Beijing in the past five years is evaluated using a data envelopment analysis (DEA) model that considers undesirable outputs. We analyze the factors that influence the environmental efficiency of Beijing using a two-step method. In the first step, a DEA model is used to assess the environmental efficiency of Beijing. In the second step, the efficiency from the first step is used as a dependent variable and factors that impact the environmental efficiency are used as independent variables. The regression model and the coefficients of the independent variables determine which factors influence the environmental efficiency and the strength of the influence. Finally, we interpret the enlightenment to the reality and the future development based on its results. The conclusion shows that the environmental efficiency of Beijing over 2005-2009 has been rising. From 2005 to 2007, the environmental efficiency of Beijing continued to increase. In 2008, the environmental efficiency reached a maximum. In 2009, Beijing maintained a high environmental efficiency. The proportion of the tertiary industry to the whole industries is the most important factor that impacts Beijing's environmental efficiency, that is, Beijing's industrial structure has the most influence on the city's environmental efficiency. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis of Beijing's environmental efficiency and related factors using a DEA model that considers undesirable outputs", "paper_id": "WOS:000321700400006"}