{"auto_keywords": [{"score": 0.04581803251369689, "phrase": "ethnic_group"}, {"score": 0.044476153128415595, "phrase": "historical_period"}, {"score": 0.00481495049065317, "phrase": "stylistic_feature_sets_as_classifiers"}, {"score": 0.003956784357357341, "phrase": "six_sets"}, {"score": 0.003916098498242888, "phrase": "stylistic_features"}, {"score": 0.0035866734383189396, "phrase": "application_domain"}, {"score": 0.0035497797026638033, "phrase": "jewish_law_articles"}, {"score": 0.003234299589505403, "phrase": "logistic_regression_method"}, {"score": 0.003168079471049896, "phrase": "best_accuracy_results"}, {"score": 0.002740885774408238, "phrase": "quantitative_feature"}, {"score": 0.0025493457404304446, "phrase": "lexical_and_function_feature_sets"}, {"score": 0.0023834640793589414, "phrase": "function_features"}, {"score": 0.0022168460543913787, "phrase": "similar_classification_tasks"}, {"score": 0.0021049977753042253, "phrase": "text_classification_community"}], "paper_keywords": [""], "paper_abstract": "This research investigates classification of documents according to the ethnic group of their authors and/or to the historical period when the documents were written. The classification is done using various combinations of six sets of stylistic features: quantitative, orthographic, topographic, lexical, function, and vocabulary richness. The application domain is Jewish Law articles written in Hebrew-Aramaic, languages that are rich in their morphological forms. Four popular machine learning methods have been applied. The logistic regression method led to the best accuracy results: about 99.6% while classifying to the ethnic group of their authors or to the historical period when the articles were written and about 98.3% while classifying to both classifications. The quantitative feature set was found as very successful and superior to all other sets. The lexical and function feature sets have also been found to be useful. The quantitative and the function features are domain independent and language independent. These two feature sets might be generalized to similar classification tasks for other languages and can therefore be useful for the text classification community at large.", "paper_title": "STYLISTIC FEATURE SETS AS CLASSIFIERS OF DOCUMENTS ACCORDING TO THEIR HISTORICAL PERIOD AND ETHNIC ORIGIN", "paper_id": "WOS:000282582000002"}