{"auto_keywords": [{"score": 0.04845849110410781, "phrase": "structure-preserving_matrix_method"}, {"score": 0.013612826711716843, "phrase": "exact_polynomial"}, {"score": 0.010839836774761205, "phrase": "rational_function"}, {"score": 0.009894180486871712, "phrase": "coefficient_matrix"}, {"score": 0.0037834649508375544, "phrase": "practical_situations"}, {"score": 0.0032460913210906783, "phrase": "simplest_method"}, {"score": 0.0031360786664165093, "phrase": "least_squares_minimisation"}, {"score": 0.0031002400518251936, "phrase": "over-determined_system"}, {"score": 0.0029952177247681965, "phrase": "toeplitz"}, {"score": 0.0029158847555394714, "phrase": "polynomial_approximation"}, {"score": 0.0027741761880779535, "phrase": "improved_result"}, {"score": 0.002700738055025905, "phrase": "toeplitz_structure"}, {"score": 0.002472822097373027, "phrase": "polynomial_solution"}, {"score": 0.002370704665003412, "phrase": "theoretically_exact_solution"}, {"score": 0.002325689073229477, "phrase": "computed_solution"}, {"score": 0.0023079225317714815, "phrase": "computational_examples"}, {"score": 0.0021705796895687864, "phrase": "least_squares_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Polynomial deconvolution", " Bernstein basis polynomials", " Structure-preserving matrix methods"], "paper_abstract": "This paper describes the application of a structure-preserving matrix method to the deconvolution of two Bernstein basis polynomials. Specifically, the deconvolution (h) over cap/(f) over cap yields a polynomial (g) over cap provided the exact polynomial (f) over cap is a divisor of the exact polynomial (h) over cap and all computations are performed symbolically. In practical situations, however, inexact forms, h and f of, respectively, (h) over cap and (f) over cap are specified, in which case g = h/f is a rational function and not a polynomial. The simplest method to calculate the coefficients of g is the least squares minimisation of an over-determined system of linear equations in which the coefficient matrix is Toeplitz, but the solution is a polynomial approximation of a rational function. It is shown in this paper that an improved result for g is obtained when the Toeplitz structure of the coefficient matrix is preserved, that is, a structure-preserving matrix method is used. In particular, this method guarantees that a polynomial solution to the deconvolution h/f is obtained, and thus an essential property of the theoretically exact solution is retained in the computed solution. Computational examples that show the improvement in the solution obtained from the structure-preserving matrix method with respect to the least squares solution are presented. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A structure-preserving matrix method for the deconvolution of two Bernstein basis polynomials", "paper_id": "WOS:000343380700004"}