{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mesostructure_roughness"}, {"score": 0.004612662942073808, "phrase": "effective_cue"}, {"score": 0.004563427013973105, "phrase": "image_segmentation"}, {"score": 0.0044426140044122545, "phrase": "small-scale_bumps"}, {"score": 0.0037615180375561805, "phrase": "camera_plane"}, {"score": 0.003306559295382181, "phrase": "constructive_approach"}, {"score": 0.0032016639006812826, "phrase": "meta-texture_image"}, {"score": 0.003066945490483524, "phrase": "underlying_surface-roughness"}, {"score": 0.0028446460307503343, "phrase": "sample_images"}, {"score": 0.002769209760453212, "phrase": "different_patches"}, {"score": 0.0022941723937662927, "phrase": "salient_mesostructure_roughness"}, {"score": 0.0022213218042340735, "phrase": "line-based_boundary-detection"}, {"score": 0.0021049977753042253, "phrase": "known_algorithms"}], "paper_keywords": ["Texture analysis", " Image segmentation", " Intrinsic images"], "paper_abstract": "This paper introduces mesostructure roughness as an effective cue in image segmentation. Mesostructure roughness corresponds to small-scale bumps on the macrostructure (i.e., geometry) of objects. Specifically, the focus is on the texture that is created by the projection of the mesostructure roughness on the camera plane. Three intrinsic images are derived: reflectance, smooth-surface shading and mesostructure roughness shading (meta-texture images). A constructive approach is proposed for computing a meta-texture image by preserving, equalizing and enhancing the underlying surface-roughness across color, brightness and illumination variations. We evaluate the performance on sample images and illustrate quantitatively that different patches of the same material, in an image, are normalized in their statistics despite variations in color, brightness and illumination. We develop an algorithm for segmentation of an image into patches that share salient mesostructure roughness. Finally, segmentation by line-based boundary-detection is proposed and results are provided and compared to known algorithms.", "paper_title": "Segmentation using Appearance of Mesostructure Roughness", "paper_id": "WOS:000264547900003"}