{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "structural"}, {"score": 0.004675930527604869, "phrase": "current_and_potential_future_climates"}, {"score": 0.004487989502479992, "phrase": "world's_main_carbohydrates_sources"}, {"score": 0.004014923642015515, "phrase": "crop_growth"}, {"score": 0.0038309141193444015, "phrase": "predicted_yield"}, {"score": 0.00376409764683147, "phrase": "hotter_sites"}, {"score": 0.003212663446866794, "phrase": "growth_parameters_values"}, {"score": 0.0031565959573536194, "phrase": "observed_data"}, {"score": 0.0030653094605910727, "phrase": "previously_determined_rue"}, {"score": 0.0028568174308720167, "phrase": "higher_yields"}, {"score": 0.0027741761880779535, "phrase": "higher_sensitivity"}, {"score": 0.002555247330102505, "phrase": "better_estimations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Sugarcane", " Simulation", " Uncertainty", " Calibration", " Model intercomparison", " Process-based model", " Climate change"], "paper_abstract": "Sugarcane is one of the world's main carbohydrates sources. We analysed the APSIM-Sugar (AS) and DSSAT/CANEGRO (DC) models to determine their structural differences, and how these differences affect their predictions of crop growth and production. The AS model under predicted yield at the hotter sites, because the algorithm for computing the degree-days is based in only one upper cardinal temperature. The models did not accurately predict canopy and stalk development through time using growth parameters values developed from observed data, in combination with previously determined RUE for the cultivars. In response to elevated CO2, both predicted higher yields, although AS showed higher sensitivity to CO2 concentration, rainfall and temperature than DC. The Mean of simulations from both models produced better estimations than predictions from either model individually. Thus, applying the two models (in their current form) is likely to give the more accurate predictions than focusing on one model alone. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Sugarcane model intercomparison: Structural differences and uncertainties under current and potential future climates", "paper_id": "WOS:000361906400032"}