{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cross-domain_research_output"}, {"score": 0.03650725283056864, "phrase": "most-cited_papers"}, {"score": 0.004484596684703308, "phrase": "significant_differences"}, {"score": 0.004386063799793622, "phrase": "research_publishing_formats"}, {"score": 0.0036715973701254823, "phrase": "cross-domain_differences"}, {"score": 0.0036390887584943723, "phrase": "quantitative_and_qualitative_measures"}, {"score": 0.003359119985242403, "phrase": "research_group_sizes"}, {"score": 0.0032416819339366712, "phrase": "research_output"}, {"score": 0.0031845152332945726, "phrase": "slovenia"}, {"score": 0.0029789104204803137, "phrase": "comparative_measures"}, {"score": 0.0028875481626754696, "phrase": "research_impact_cube"}, {"score": 0.0027495914857929584, "phrase": "highest_impact_factors"}, {"score": 0.0027252240573281163, "phrase": "citation_distribution_graphs"}, {"score": 0.0026182085765020548, "phrase": "lotka's_model"}, {"score": 0.0021620042653528846, "phrase": "definite_time_period"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["h-Index", " Fields of science", " Research impact cube", " Binary citation index", " Scientometrics", " Lorenz curves"], "paper_abstract": "Across the various scientific domains, significant differences occur with respect to research publishing formats, frequencies and citing practices, the nature and organisation of research and the number and impact of a given domain's academic journals. Consequently, differences occur in the citations and h-indices of the researchers. This paper attempts to identify cross-domain differences using quantitative and qualitative measures. The study focuses on the relationships among citations, most-cited papers and h-indices across domains and for research group sizes. The analysis is based on the research output of approximately 10,000 researchers in Slovenia, of which we focus on 6536 researchers working in 284 research group programmes in 2008-2012. As comparative measures of cross-domain research output, we propose the research impact cube (RIC) representation and the analysis of most-cited papers, highest impact factors and citation distribution graphs (Lorenz curves). The analysis of Lotka's model resulted in the proposal of a binary citation frequencies (BCF) distribution model that describes well publishing frequencies. The results may be used as a model to measure, compare and evaluate fields of science on the global, national and research community level to streamline research policies and evaluate progress over a definite time period. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A comparative study of cross-domain research output and citations: Research impact cubes and binary citation frequencies", "paper_id": "WOS:000331771900014"}