{"auto_keywords": [{"score": 0.046481645015043, "phrase": "diseased_vessel"}, {"score": 0.03132636493645231, "phrase": "therapeutic_decisions"}, {"score": 0.00481495049065317, "phrase": "patient-specific_risk_assessment"}, {"score": 0.004696344245532423, "phrase": "vascular_disease"}, {"score": 0.004552167735445606, "phrase": "large_extent"}, {"score": 0.004384960761826366, "phrase": "particular_vascular_disease"}, {"score": 0.004303664701305258, "phrase": "geometrical_parameter"}, {"score": 0.004005694797072747, "phrase": "clinical_practice"}, {"score": 0.003956012816350168, "phrase": "epidemiological_knowledge"}, {"score": 0.003870541730075597, "phrase": "clinical_studies"}, {"score": 0.0038464610418635892, "phrase": "large_numbers"}, {"score": 0.0036137129449624727, "phrase": "individual_patients"}, {"score": 0.003459191419478298, "phrase": "vascular_hemodynamics"}, {"score": 0.0032803844011304283, "phrase": "vessel_wall"}, {"score": 0.0031696255948160923, "phrase": "substantial_number"}, {"score": 0.0031107911390188055, "phrase": "hemodynamic_modeling"}, {"score": 0.0030530454211138594, "phrase": "first_evidence"}, {"score": 0.002745438358145758, "phrase": "patient-specific_hemodynamic_modeling_methodology"}, {"score": 0.002422890839801611, "phrase": "input_data"}, {"score": 0.002385326947545194, "phrase": "different_users"}, {"score": 0.002212951892867028, "phrase": "risk_assessment"}, {"score": 0.0021049977753042253, "phrase": "abdominal_aorta"}], "paper_keywords": ["Hemodynamics", " Vascular disease", " Abdominal aortic aneurysm", " Flow modeling", " Biomechanical stress modeling", " Patient specificity"], "paper_abstract": "Diagnosis of vascular disease and selection and planning of therapy are to a large extent based on the geometry of the diseased vessel. Treatment of a particular vascular disease is usually considered if the geometrical parameter that characterizes the severity of the disease, e.g. % vessel narrowing, exceeds a threshold. The thresholds that are used in clinical practice are based on epidemiological knowledge, which has been obtained by clinical studies including large numbers of patients. They may apply \"on average\", but they can be sub-optimal for individual patients. To realize more patient-specific treatment decision criteria, more detailed knowledge may be required about the vascular hemodynamics, i.e. the blood flow and pressure in the diseased vessel and the biomechanical reaction of the vessel wall to this flow and pressure. Over the last decade, a substantial number of publications have appeared on hemodynamic modeling. Some studies have provided first evidence that this modeling may indeed be used to support therapeutic decisions. The goal of the research reported in this paper is to go one step further, namely to investigate the feasibility of a patient-specific hemodynamic modeling methodology that is not only effective (improves therapeutic decisions), but that is also efficient (easy to use, fast, as much as possible automatic) and robust (insensitive to variation in the quality of the input data, same outcome for different users). A review is presented of our research performed during the last 5 years and the results that were achieved. This research focused on the risk assessment for one particular disease, namely abdominal aortic aneurysm, a life-threatening dilatation of the abdominal aorta.", "paper_title": "Towards patient-specific risk assessment of abdominal aortic aneurysm", "paper_id": "WOS:000260960200004"}