{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "smart_grid"}, {"score": 0.004768649568826951, "phrase": "time-series_data"}, {"score": 0.004543708337879809, "phrase": "smart_electricity_infrastructure"}, {"score": 0.004456717971917794, "phrase": "huge_volumes"}, {"score": 0.004308455856718928, "phrase": "smart_electricity_meters"}, {"score": 0.0036553070575015344, "phrase": "short-term_forecasting"}, {"score": 0.00346589179059467, "phrase": "huge_amounts"}, {"score": 0.0033182152378613767, "phrase": "storage_space"}, {"score": 0.003146212656743413, "phrase": "compression_technique"}, {"score": 0.003100865267124765, "phrase": "piecewise_regression"}, {"score": 0.002883718207958817, "phrase": "general_approach"}, {"score": 0.002855934865505357, "phrase": "time-series_compression"}, {"score": 0.002630299922281955, "phrase": "use-case_scenario"}, {"score": 0.002387507583705495, "phrase": "proposed_technique"}, {"score": 0.0023530698447434308, "phrase": "related_work"}, {"score": 0.0021670777282518424, "phrase": "proposed_compression_technique"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_database_management_system"}], "paper_keywords": ["Data compression", " Time series", " Piecewise regression", " Smart grid"], "paper_abstract": "Time-series data is increasingly collected in many domains. One example is the smart electricity infrastructure, which generates huge volumes of such data from sources such as smart electricity meters. Although today these data are used for visualization and billing in mostly 15-min resolution, its original temporal resolution frequently is more fine-grained, e.g., seconds. This is useful for various analytical applications such as short-term forecasting, disaggregation and visualization. However, transmitting and storing huge amounts of such fine-grained data are prohibitively expensive in terms of storage space in many cases. In this article, we present a compression technique based on piecewise regression and two methods which describe the performance of the compression. Although our technique is a general approach for time-series compression, smart grids serve as our running example and as our evaluation scenario. Depending on the data and the use-case scenario, the technique compresses data by ratios of up to factor 5,000 while maintaining its usefulness for analytics. The proposed technique has outperformed related work and has been applied to three real-world energy datasets in different scenarios. Finally, we show that the proposed compression technique can be implemented in a state-of-the-art database management system.", "paper_title": "A time-series compression technique and its application to the smart grid", "paper_id": "WOS:000351381200002"}