{"auto_keywords": [{"score": 0.048186916426953504, "phrase": "optimal_solutions"}, {"score": 0.015623161739083244, "phrase": "polynomial_time"}, {"score": 0.014514542286714822, "phrase": "minimum_set"}, {"score": 0.0072873733751396205, "phrase": "uncertain_objects"}, {"score": 0.0072435627648861035, "phrase": "skyline_probabilities"}, {"score": 0.005239112223727235, "phrase": "lower_orthant_order"}, {"score": 0.005219111576282975, "phrase": "np"}, {"score": 0.00491204380105933, "phrase": "usual_order"}, {"score": 0.004795585480947173, "phrase": "multiple_criteria"}, {"score": 0.00452334946216661, "phrase": "key_feature"}, {"score": 0.004468975181025719, "phrase": "multidimensional_space"}, {"score": 0.004089623449342148, "phrase": "uncertain_data"}, {"score": 0.004064958518350867, "phrase": "probabilistic_skyline_model"}, {"score": 0.003912151526033363, "phrase": "monotonic_utility_functions"}, {"score": 0.0038186039088445524, "phrase": "novel_skyline_operator"}, {"score": 0.003734810936407523, "phrase": "expected_utility_principle"}, {"score": 0.003608901805093855, "phrase": "utility_functions"}, {"score": 0.0035654805454859214, "phrase": "lskyline_operator"}, {"score": 0.0035368226370312596, "phrase": "lower_orthant_orders"}, {"score": 0.003417565253539315, "phrase": "monotonic_multiplicative_utility_functions"}, {"score": 0.003342542886191616, "phrase": "multiplicative_functions"}, {"score": 0.0031909403420958752, "phrase": "general_stochastic_skyline_operator"}, {"score": 0.003146175521737397, "phrase": "usual_orders"}, {"score": 0.003114584448820957, "phrase": "minimum_candidate"}, {"score": 0.003070887504200816, "phrase": "monotonic_functions"}, {"score": 0.0030461927840680584, "phrase": "first_time"}, {"score": 0.0030278017562213265, "phrase": "existing_literature"}, {"score": 0.002973290218318437, "phrase": "stochastic_order"}, {"score": 0.0027426157829488476, "phrase": "interesting_result"}, {"score": 0.0025400310545133247, "phrase": "general_framework"}, {"score": 0.0024345529783611703, "phrase": "efficient_and_effective_filtering_techniques"}, {"score": 0.0024247382451294255, "phrase": "novel_and_efficient_verification_algorithms"}, {"score": 0.002385872451981323, "phrase": "multidimensional_uncertain_data"}, {"score": 0.0022546720211200893, "phrase": "theoretical_analysis"}, {"score": 0.002174155795026218, "phrase": "conventional_skyline"}, {"score": 0.0021566565951738658, "phrase": "comprehensive_experiments"}, {"score": 0.0021050052988874166, "phrase": "io"}], "paper_keywords": ["Algorithms", " Performance", " Skyline", " uncertain data", " stochastic order"], "paper_abstract": "In many applications involving multiple criteria optimal decision making, users may often want to make a personal trade-off among all optimal solutions for selecting one object that fits best their personal needs. As a key feature, the skyline in a multidimensional space provides the minimum set of candidates for such purposes by removing all points not preferred by any (monotonic) utility/scoring functions; that is, the skyline removes all objects not preferred by any user no matter how their preferences vary. Driven by many recent applications with uncertain data, the probabilistic skyline model is proposed to retrieve uncertain objects based on skyline probabilities. Nevertheless, skyline probabilities cannot capture the preferences of monotonic utility functions. Motivated by this, in this article we propose a novel skyline operator, namely stochastic skylines. In the light of the expected utility principle, stochastic skylines guarantee to provide the minimum set of candidates to optimal solutions over a family of utility functions. We first propose the lskyline operator based on the lower orthant orders. lskyline guarantees to provide the minimum set of candidates to the optimal solutions for the family of monotonic multiplicative utility functions. While lskyline works very effectively for the family of multiplicative functions, it may miss optimal solutions for other utility /scoring functions (e.g., linear functions). To resolve this, we also propose a general stochastic skyline operator, gskyline, based on the usual orders. gskyline provides the minimum candidate set to the optimal solutions for all monotonic functions. For the first time regarding the existing literature, we investigate the complexities of determining a stochastic order between two uncertain objects whose probability distributions are described discretely. We firstly show that determining the lower orthant order is NP-complete with respect to the dimensionality; consequently the problem of computing lskyline is NP-complete. We also show an interesting result as follows. While the usual order involves more complicated geometric forms than the lower orthant order, the usual order may be determined in polynomial time regarding all the inputs, including the dimensionality; this implies that gskyline can be computed in polynomial time. A general framework is developed for efficiently and effectively retrieving lskyline and gskyline from a set of uncertain objects, respectively, together with efficient and effective filtering techniques. Novel and efficient verification algorithms are developed to efficiently compute lskyline over multidimensional uncertain data, which run in polynomial time if the dimensionality is fixed, and to efficiently compute gskyline in polynomial time regarding all inputs. We also show, by theoretical analysis and experiments, that the sizes of lskyline and gskyline are both quite similar to that of conventional skyline over certain data. Comprehensive experiments demonstrate that our techniques are efficient and scalable regarding both CPU and IO costs.", "paper_title": "Stochastic Skylines", "paper_id": "WOS:000304769100007"}