{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "approximate_repetitions"}, {"score": 0.0101241949583858, "phrase": "dna_sequence"}, {"score": 0.004764542405129454, "phrase": "dna_sequences"}, {"score": 0.004496542293425754, "phrase": "important_topic"}, {"score": 0.004449452743965974, "phrase": "gene_analysis"}, {"score": 0.004133292222875435, "phrase": "varying_lengths"}, {"score": 0.0034555479218891638, "phrase": "new_function"}, {"score": 0.0031098631445657158, "phrase": "computational_complexity"}, {"score": 0.0029657683623403085, "phrase": "frequency_distance"}, {"score": 0.0029346624184926305, "phrase": "pearson_correlation"}, {"score": 0.0026972470784512774, "phrase": "sua"}, {"score": 0.002440071551819324, "phrase": "approximate_repetition"}, {"score": 0.002207363758847308, "phrase": "bigger_number"}, {"score": 0.0021049977753042253, "phrase": "tandem_repeat_finder"}], "paper_keywords": [""], "paper_abstract": "Searching for approximate repetitions in a DNA sequence has been an important topic in gene analysis. One of the problems in the study is that because of the varying lengths of patterns, the similarity between patterns cannot be judged accurately if we use only the concept of ED ( Edit Distance ). In this paper we shall make effort to define a new function to compute similarity, which considers both the difference and sameness between patterns at the same time. Seeing the computational complexity, we shall also propose two new filter methods based on frequency distance and Pearson correlation, with which we can sort out candidate set of approximate repetitions efficiently. We use SUA instead of sliding window to get the fragments in a DNA sequence, so that the patterns of an approximate repetition have no limitation on length. The results show that with our technique we are able to find a bigger number of approximate repetitions than that of those found with tandem repeat finder.", "paper_title": "A new method for finding approximate repetitions in DNA sequences", "paper_id": "WOS:000239658700034"}