{"auto_keywords": [{"score": 0.044756524567110365, "phrase": "ad_hoc_networks"}, {"score": 0.00481495049065317, "phrase": "olsr_routing_protocol"}, {"score": 0.004167086373747367, "phrase": "wireless_range"}, {"score": 0.0038590090616766434, "phrase": "remote_nodes"}, {"score": 0.0038070472635126276, "phrase": "entire_network"}, {"score": 0.0036224139706218916, "phrase": "security_solution"}, {"score": 0.0035898158129721003, "phrase": "olsr_protocol"}, {"score": 0.003369669078274226, "phrase": "explicit_trust_management"}, {"score": 0.002955533639862811, "phrase": "trust-based_security"}, {"score": 0.0029289208505455635, "phrase": "olsr."}, {"score": 0.0028764202155040146, "phrase": "olsr"}, {"score": 0.0028376361457661415, "phrase": "trust_specification_language"}, {"score": 0.0027616550517346066, "phrase": "trust-based_reasoning"}, {"score": 0.0025572160146590623, "phrase": "misbehaving_nodes"}, {"score": 0.0023465400668244386, "phrase": "malicious_nodes"}, {"score": 0.002252880693912436, "phrase": "different_simulated_attacks_scenarios"}, {"score": 0.002105007807034302, "phrase": "elsevier"}], "paper_keywords": ["Trust", " Ad hoc networks", " Security", " Routing protocol", " OLSR"], "paper_abstract": "The trust is always present implicitly in the protocols based on cooperation, in particular, between the entities involved in routing operations in Ad hoc networks. Indeed, as the wireless range of such nodes is limited, the nodes mutually cooperate with their neighbors in order to extend the remote nodes and the entire network. In our work, we are interested by trust as security solution for OLSR protocol. This approach fits particularly with characteristics of ad hoc networks. Moreover, the explicit trust management allows entities to reason with and about trust, and to take decisions regarding other entities. In this paper, we detail the techniques and the contributions in trust-based security in OLSR. We present trust-based analysis of the OLSR protocol using trust specification language, and we show how trust-based reasoning can allow each node to evaluate the behavior of the other nodes. After the detection of misbehaving nodes, we propose solutions of prevention and countermeasures to resolve the situations of inconsistency, and counter the malicious nodes. We demonstrate the effectiveness of our solution taking different simulated attacks scenarios. Our approach brings few modifications and is still compatible with the bare OLSR. (C) 2013 Elsevier BM. All rights reserved.", "paper_title": "Trust-based security for the OLSR routing protocol", "paper_id": "WOS:000320838600005"}