{"auto_keywords": [{"score": 0.04590884875550199, "phrase": "state_space"}, {"score": 0.03994932833136189, "phrase": "finite_axiomatization"}, {"score": 0.039317403151617226, "phrase": "partial_functions"}, {"score": 0.031545737862860815, "phrase": "resulting_algebras"}, {"score": 0.00481495049065317, "phrase": "algebraic_theory"}, {"score": 0.004775335634705251, "phrase": "computable_functions"}, {"score": 0.004525629293824217, "phrase": "computer_programs"}, {"score": 0.004014452814186653, "phrase": "boolean_algebra"}, {"score": 0.003473529187092258, "phrase": "halting_programs"}, {"score": 0.003264547032549398, "phrase": "halting_case"}, {"score": 0.0031977096047057898, "phrase": "natural_\"fix"}, {"score": 0.0028953973490895746, "phrase": "current_setting"}, {"score": 0.0026324658253309673, "phrase": "finite_axiomatizations"}, {"score": 0.002344311033783139, "phrase": "partial_predicate"}, {"score": 0.0021669202726173928, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Computable partial functions", " Algebraic models of computation", " Deterministic programs", " Domain", " Restriction semigroup", " If-then-else"], "paper_abstract": "We study the algebraic theory of computable functions, which can be viewed as arising from possibly non-halting computer programs or algorithms, acting on some state space, equipped with operations of composition, if-then-else and while-do defined in terms of a Boolean algebra of conditions. It has previously been shown that there is no finite axiomatization of algebras of partial functions under these operations alone, and this holds even if one restricts attention to transformations (representing halting programs) rather than partial functions, and omits while-do from the signature. In the halting case, there is a natural \"fix\", which is to allow composition of halting programs with conditions, and then the resulting algebras admit a finite axiomatization. In the current setting such compositions are not possible, but by extending the notion of if-then-else, we are able to give finite axiomatizations of the resulting algebras of (partial) functions, with while-do in the signature if the state space is assumed finite. The axiomatizations are extended to consider the partial predicate of equality. All algebras considered turn out to be enrichments of the notion of a (one-sided) restriction semigroup. Crown Copyright (C) 2014 Published by Elsevier Inc. All rights reserved.", "paper_title": "Monoids with tests and the algebra of possibly non-halting programs", "paper_id": "WOS:000350077300004"}