{"auto_keywords": [{"score": 0.04895692824063779, "phrase": "wire_sculptures"}, {"score": 0.04487452084591575, "phrase": "mesh_surface"}, {"score": 0.01523556019791563, "phrase": "duotone_surfaces"}, {"score": 0.0048186755003798, "phrase": "hamiltonian"}, {"score": 0.004466519142879166, "phrase": "\"hamiltonian_cycle_art"}, {"score": 0.00395111389294443, "phrase": "hamiltonian_triangle_strips"}, {"score": 0.0031035949505887083, "phrase": "first_method"}, {"score": 0.0030791137853734152, "phrase": "equal_diameter_wires"}, {"score": 0.003042752533935891, "phrase": "second_method"}, {"score": 0.0029949359231919307, "phrase": "varying_diameter"}, {"score": 0.0023801608396295374, "phrase": "appropriate_textures"}, {"score": 0.002324238863944163, "phrase": "initial_mesh"}, {"score": 0.0022967713922705, "phrase": "resulting_textured_surfaces"}, {"score": 0.0022250978492127163, "phrase": "planar_tsp"}, {"score": 0.002155656133617155, "phrase": "truchet-like_curves"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Shape modeling", " Computer aided sculpting", " Texture mapping", " Computational aesthetics", " Computational art"], "paper_abstract": "In this work, we present the concept of \"Hamiltonian cycle art\" that is based on the fact that any mesh surface can be converted to a single closed 3D curve. These curves are constructed by connecting the centers of every two neighboring triangles in the Hamiltonian triangle strips. We call these curves surface covering since they follow the shape of the mesh surface by meandering over it like a river. We show that these curves can be used to create wire sculptures and duotone (two-color painted) surfaces. To obtain surface covering wire sculptures we have developed two methods to construct corresponding 3D wires from surface covering curves. The first method constructs equal diameter wires. The second method creates wires with varying diameter and can produce wires that densely cover the mesh surface. For duotone surfaces, we have developed a method to obtain surface covering curves that can divide any given mesh surface into two regions that can be painted in two different colors. These curves serve as a boundary that define two visually interlocked regions in the surface. We have implemented this method by mapping appropriate textures to each face of the initial mesh. The resulting textured surfaces look aesthetically pleasing since they closely resemble planar TSP (traveling salesmen problem) art and Truchet-like curves. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Hamiltonian cycle art: Surface covering wire sculptures and duotone surfaces", "paper_id": "WOS:000321532100005"}