{"auto_keywords": [{"score": 0.04692598988147936, "phrase": "list-based_model"}, {"score": 0.00481495049065317, "phrase": "randomized_gossip_protocols"}, {"score": 0.004742730438544081, "phrase": "quasi-random_rumor"}, {"score": 0.004683372025919927, "phrase": "doerr"}, {"score": 0.004659840652610948, "phrase": "friedrich"}, {"score": 0.004624752109170243, "phrase": "sauerwald"}, {"score": 0.004408581547122343, "phrase": "cyclic_list"}, {"score": 0.0043403087343434395, "phrase": "np"}, {"score": 0.004245051445971095, "phrase": "random_position"}, {"score": 0.003935892934907777, "phrase": "random_phone-call_model"}, {"score": 0.003867045158434887, "phrase": "potential_applications"}, {"score": 0.003576286811853861, "phrase": "n-node_m-edge_network"}, {"score": 0.003374735421132299, "phrase": "maximum_number"}, {"score": 0.0026221200591873056, "phrase": "additional_feature"}, {"score": 0.002486734224234698, "phrase": "polynomial_time"}, {"score": 0.002388283252319309, "phrase": "latter_result"}, {"score": 0.0022706700510423954, "phrase": "worst_case_behavior"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Rumor spreading", " Broadcast", " Gossip", " Random phone-call model"], "paper_abstract": "This paper considers the quasi-random rumor spreading model introduced by Doerr, Friedrich, and Sauerwald in [10], hereafter referred to as the list-based model. Each node is provided with a cyclic list of all its neighbors, and, upon reception of a message, it chooses a random position in its list, and from then on calls its neighbors in the order of the list. This model is known to perform asymptotically at least as well as the random phone-call model, for many network classes. Motivated by potential applications of the list-based model to live streaming, we are interested in its worst case behavior. Our first main result is the design of an 0 (m + n logn)-time algorithm that, given any n-node m-edge network G, and any source-target pair s, t is an element of V (G), computes the maximum number of rounds it may take for a rumor to be broadcast from s to t in G, in the list-based model. Hence, the list-based model is computationally easy to tackle in its basic version. The situation is radically different when one is considering variants of the model in which nodes are aware of the status of their neighbors, i.e., are aware of whether or not they have already received the rumor, at any point in time. Indeed, our second main result states that, unless P = NP, the worst case behavior of the list-based model with the additional feature that every node is perpetually aware of which of its neighbors have already received the rumor cannot be approximated in polynomial time within a (1/n)(1/2-epsilon) multiplicative factor, for any epsilon > 0. As a byproduct of this latter result, we can show that, unless P = NP, there are no PTAS enabling to approximate the worst case behavior of the list-based model, whenever every node perpetually keeps track of the subset of its neighbors which have sent the rumor to it so far. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "The worst case behavior of randomized gossip protocols", "paper_id": "WOS:000347601100002"}