{"auto_keywords": [{"score": 0.042785519110424185, "phrase": "admission_forms"}, {"score": 0.0393905066064559, "phrase": "comprehensiveness_rates"}, {"score": 0.017769343673891217, "phrase": "information_category_level"}, {"score": 0.009078600084152254, "phrase": "different_formats"}, {"score": 0.008645946593338777, "phrase": "completeness_rate"}, {"score": 0.0077457932221490795, "phrase": "overall_completeness"}, {"score": 0.00481495049065317, "phrase": "paper-based_resident_admission_forms"}, {"score": 0.004791415854989106, "phrase": "australian"}, {"score": 0.004675361410340781, "phrase": "paper-based_and_electronic_formats"}, {"score": 0.004573377746592963, "phrase": "australia"}, {"score": 0.0044844784352041835, "phrase": "resident_admission_information"}, {"score": 0.004259360749748044, "phrase": "documentation_quality"}, {"score": 0.004238516946277247, "phrase": "paper-based_and_electronic_resident_admission_forms"}, {"score": 0.004166360284269931, "phrase": "admission_data"}, {"score": 0.003899319124792991, "phrase": "comprehensiveness_rate"}, {"score": 0.0038612347035351696, "phrase": "documented_data_element"}, {"score": 0.0037034667501733383, "phrase": "general_level"}, {"score": 0.003560851640790967, "phrase": "varying_practice"}, {"score": 0.003534727008906385, "phrase": "participant_facilities"}, {"score": 0.0033819418638350073, "phrase": "electronic_health_records"}, {"score": 0.0033488936470967485, "phrase": "paper-based_records"}, {"score": 0.0030356102878825357, "phrase": "varying_degrees"}, {"score": 0.002954700775643824, "phrase": "different_form_formats"}, {"score": 0.0028618482635623084, "phrase": "negative_association"}, {"score": 0.0023167624518936713, "phrase": "resident_admission_forms"}, {"score": 0.002288467996411331, "phrase": "electronic_documentation_systems"}, {"score": 0.0022716570840201167, "phrase": "previous_paper-based_systems"}, {"score": 0.002178696355804523, "phrase": "resident_admission_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Admission form", " Auditing", " Electronic health record", " Electronic record", " Evaluation", " Nursing documentation", " Paper record", " Quality"], "paper_abstract": "Purpose: To describe the paper-based and electronic formats of resident admission forms used in several aged care facilities in Australia and to compare the extent to which resident admission information was documented in paper-based and the electronic health records. Methods: Retrospective auditing and comparison of the documentation quality of paper-based and electronic resident admission forms were conducted. A checklist of admission data was qualitatively derived from different formats of the admission forms collected. Three measures were used to assess the quality of documentation of the admission forms, including completeness rate, comprehensiveness rate and frequency of documented data element. The associations between the number of items and their completeness and comprehensiveness rates were estimated at a general level and at each information category level. Results: Various paper-based and electronic formats of admission forms were collected, reflecting varying practice among the participant facilities. The overall completeness and comprehensiveness rates of the admission forms were poor, but were higher in the electronic health records than in the paper-based records (60% versus 56% and 40% versus 29% respectively, p < 0.01). There were differences in the overall completeness and comprehensiveness rates between the different formats of admission forms (p < 0.01). At each information category level, varying degrees of difference in the completeness and comprehensiveness rates were found between different form formats and between the paper-based and the electronic records. A negative association between the completeness rate and the number of items in a form was found at each information category level (p < 0.01), i.e., more data items designed in a form, the less likely that the items would be completely filled. However, the associations between the comprehensiveness rates and the number of items were highly positive at both overall and individual information category levels (p < 0.01), suggesting more items designed in a form, more information would be captured. Conclusion: Better quality of documentation in resident admission forms was identified in the electronic documentation systems than in previous paper-based systems, but still needs to be further improved in practice. The quality of documentation of resident admission data should be further analysed in relation to its specific content. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Description and comparison of quality of electronic versus paper-based resident admission forms in Australian aged care facilities", "paper_id": "WOS:000318998000018"}