{"auto_keywords": [{"score": 0.04599283119366167, "phrase": "fuzzy_preference_relation"}, {"score": 0.04222565054522196, "phrase": "weak_transitivity"}, {"score": 0.00782438878963722, "phrase": "decision_maker"}, {"score": 0.006510304236228513, "phrase": "additive_consistency"}, {"score": 0.00481495049065317, "phrase": "fuzzy_preference_relations"}, {"score": 0.004634799977448855, "phrase": "inconsistency_problems"}, {"score": 0.004576253356889219, "phrase": "preference_information"}, {"score": 0.004240116703465252, "phrase": "analysis_method"}, {"score": 0.003287482882222731, "phrase": "graph_theory"}, {"score": 0.002857849698346116, "phrase": "inconsistent_fuzzy_preference_relation"}, {"score": 0.0026475981474045414, "phrase": "synthesis_matrix"}, {"score": 0.0023309080951251335, "phrase": "convergence_theorem"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["fuzzy preference relations", " additive consistency", " weak transitivity", " inconsistency"], "paper_abstract": "This paper investigates the inconsistency problems of preference information about alternatives expressed as a fuzzy preference relation by a decision maker. An analysis method is presented to identify the inconsistency and weak transitivity of a fuzzy preference relation and to repair its inconsistency to reach weak transitivity. First, several definitions are given on additive consistency, inconsistency and weak transitivity of a fuzzy preference relation. Next, two methods derived from graph theory are presented to judge whether a fuzzy preference relation has weak transitivity or not. Then, an algorithm is developed to repair an inconsistent fuzzy preference relation and to make it become one with weak transitivity, via a synthesis matrix which reflects the relationship between the fuzzy preference relation with additive consistency and the initial one given by a decision maker. A convergence theorem is also given for the algorithm. Lastly, two numerical examples are shown to illustrate the proposed method. (C) 2005 Elsevier B.V All rights reserved.", "paper_title": "A method for repairing the inconsistency of fuzzy preference relations", "paper_id": "WOS:000233156900002"}