{"auto_keywords": [{"score": 0.049445419527232116, "phrase": "self-determination_theory_perspective"}, {"score": 0.037622209494166656, "phrase": "parental_support"}, {"score": 0.03730035335254252, "phrase": "peer_influence"}, {"score": 0.03698114486737466, "phrase": "internet_self-efficacy"}, {"score": 0.00481495049065317, "phrase": "high_school_students'_internet_use"}, {"score": 0.004386063799793622, "phrase": "high_school_students'_intrinsic_motivations"}, {"score": 0.003959863717046575, "phrase": "seven_junior_and_ten_senior_high_schools"}, {"score": 0.003821503621554738, "phrase": "central_china"}, {"score": 0.00378767277402891, "phrase": "existing_instruments"}, {"score": 0.003754140294151593, "phrase": "previous_research"}, {"score": 0.0032272929113113203, "phrase": "structural_equation_modeling"}, {"score": 0.0031006232333900055, "phrase": "research_model"}, {"score": 0.002952516738708181, "phrase": "perceived_autonomy_dimension"}, {"score": 0.0029263562233195423, "phrase": "teacher_support"}, {"score": 0.0027865506182608263, "phrase": "significant_effect"}, {"score": 0.0026652435674846095, "phrase": "perceived_relatedness_dimension"}, {"score": 0.002572001496778222, "phrase": "greatest_influence"}, {"score": 0.002438203996977464, "phrase": "perceived_competence_dimension"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Pedagogical issues", " Computer-mediated communication", " Secondary education"], "paper_abstract": "From a self-determination theory perspective, this study tries to investigate how perceived autonomy support, perceived relatedness and competence affect high school students' intrinsic motivations (enjoyment and curiosity) to use the Internet, and the related outcomes of the motivation. Surveys are distributed to seven junior and ten senior high schools in a prefectural-level city in central China. Existing instruments from previous research are adapted to measure the following constructs: teacher support, parental support, peer influence, Internet self-efficacy, enjoyment, curiosity, flow state and online exploratory behavior. Finally, 3475 valid responses are collected. Structural Equation Modeling (SEM) is used to test the research model and the following results are obtained: i) for the perceived autonomy dimension, teacher support only significantly affects curiosity while parental support doesn't have any significant effect on the two intrinsic motivations; ii) as to the perceived relatedness dimension, peer influence is found to exert the greatest influence on both motivations, and Internet self-efficacy, which belongs to the perceived competence dimension, also positively relates to enjoyment and curiosity; iii) as to the outcomes of intrinsic motivations, both enjoyment and curiosity lead to flow state, however, curiosity rather than enjoyment positively relates to online exploratory behavior, and flow experience also predicts exploratory behaviors. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "What makes them happy and curious online? An empirical study on high school students' Internet use from a self-determination theory perspective", "paper_id": "WOS:000284819800003"}