{"auto_keywords": [{"score": 0.03322415849611772, "phrase": "cloud_monitoring"}, {"score": 0.00481495049065317, "phrase": "cloud_computing"}, {"score": 0.004497762477097628, "phrase": "cloud-based_services"}, {"score": 0.003991932110277654, "phrase": "effective_and_efficient_monitoring"}, {"score": 0.0038253590626087237, "phrase": "cloud_properties"}, {"score": 0.003760685138103153, "phrase": "underlying_technologies"}, {"score": 0.003423969509052361, "phrase": "detailed_analysis"}, {"score": 0.0033527345240630486, "phrase": "cloud"}, {"score": 0.0030127172247606812, "phrase": "also_definitions"}, {"score": 0.002790004829699627, "phrase": "monitoring_system"}, {"score": 0.002539978170928796, "phrase": "current_platforms"}, {"score": 0.0022442249871042026, "phrase": "open_issues"}, {"score": 0.0022251433045184454, "phrase": "main_challenges"}, {"score": 0.0022062235065459274, "phrase": "future_directions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cloud monitoring", " Cloud measurements", " SLA monitoring", " Cloud resource monitoring", " Cloud monitoring metrics", " Cloud monitoring platforms"], "paper_abstract": "Nowadays, Cloud Computing is widely used to deliver services over the Internet for both technical and economical reasons. The number of Cloud-based services has increased rapidly and strongly in the last years, and so is increased the complexity of the infrastructures behind these services. To properly operate and manage such complex infrastructures effective and efficient monitoring is constantly needed. Many works in literature have surveyed Cloud properties, features, underlying technologies (e.g. virtualization), security and privacy. However, to the best of our knowledge, these surveys lack a detailed analysis of monitoring for the Cloud. To fill this gap, in this paper we provide a survey on Cloud monitoring. We start analyzing motivations for Cloud monitoring, providing also definitions and background for the following contributions. Then, we carefully analyze and discuss the properties of a monitoring system for the Cloud, the issues arising from such properties and how such issues have been tackled in literature. We also describe current platforms, both commercial and open source, and services for Cloud monitoring, underlining how they relate with the properties and issues identified before. Finally, we identify open issues, main challenges and future directions in the field of Cloud monitoring.(1) (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Cloud monitoring: A survey", "paper_id": "WOS:000320680500012"}