{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "self-learning_assembly_language_programming"}, {"score": 0.004321118442104989, "phrase": "different_teaching"}, {"score": 0.004195418010131832, "phrase": "particular_teaching_assembly_language_programming"}, {"score": 0.004073359218158693, "phrase": "undergraduate_studies"}, {"score": 0.003935420482629049, "phrase": "self-learning_tool"}, {"score": 0.0036553070575015344, "phrase": "prototype_systems"}, {"score": 0.003496868378204654, "phrase": "microprocessor-based_systems"}, {"score": 0.003445591238183763, "phrase": "educational_tool"}, {"score": 0.002986969236641105, "phrase": "hands-on_experience"}, {"score": 0.0028293966058473476, "phrase": "new_modules"}, {"score": 0.002576503437739865, "phrase": "supplementary_tool"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["assembly language programming", " computer-aided learning", " microprocessor-based systems"], "paper_abstract": "This article presents the design of a system that can be used in different teaching and learning activities, in particular teaching assembly language programming and basic computer architecture for undergraduate studies. The system can be a self-learning tool for students. On the other hand, teachers can utilize this system to develop prototype systems and to demonstrate theories pertaining to operations of microprocessor-based systems. This educational tool includes hardware and software components, which were developed by the authors. The design of this system is based on principles of constructivism and learning is through hands-on experience. The system is very flexible and users can incorporate new modules for more advanced learning. Due to its flexibility and ease of use, it can also be employed as a supplementary tool for teaching other engineering subjects. Data collected from our evaluation study shows that majority of users found the system easy to use. In this article, features of the system, as well as its design and evaluation results are presented. (c) 2009 Wiley Periodicals, Inc. Comput Appl Eng Educ 19: 286-293, 2011; View this article online at wileyonlinelibrary.com; DOI 10.1002/cae.20310", "paper_title": "A Tool for Self-Learning Assembly Language Programming and Computer Architecture: Design and Evaluation", "paper_id": "WOS:000290678900009"}