{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "real_world_knowledge"}, {"score": 0.004760394308239882, "phrase": "ubiquitous_applications"}, {"score": 0.004706453355638515, "phrase": "electronic_tourist_guide_systems"}, {"score": 0.004522406417999492, "phrase": "navigation_information"}, {"score": 0.0037042817107563785, "phrase": "real_world"}, {"score": 0.0028490783932465288, "phrase": "nearby_buildings"}, {"score": 0.002585539416877115, "phrase": "mapping_technology"}, {"score": 0.0025127604406208668, "phrase": "urban_spaces"}, {"score": 0.002386869729952315, "phrase": "geotagged_photos"}, {"score": 0.002359759876402679, "phrase": "mark_foci_polygons"}, {"score": 0.0022802596433757565, "phrase": "visibility-filtered_information"}, {"score": 0.0021659920594094407, "phrase": "user_experience"}, {"score": 0.0021049977753042253, "phrase": "irrelevant_information"}], "paper_keywords": [""], "paper_abstract": "Electronic tourist guide systems typically recommend locations and sometimes provide navigation information. However, previously such systems were rather naive about what constituted information close to and thus relevant for the user. In this paper we show how to exploit knowledge about features in the real world to compute whether an information resource concerns something that the user can probably see. At run-time, we can take a set of foci, that is 2D polygons to which data is attached, and then filter away those foci that are invisible because they are occluded by nearby buildings. This is performed with the awareness of the inconsistencies and lack of accuracy in both mapping technology and GPS positioning in urban spaces. We have also developed tools to upload geotagged photos and mark foci polygons on a map. Using visibility-filtered information, less cluttered maps can be provided, and the user experience enhanced through removal of irrelevant information.", "paper_title": "Exploiting real world knowledge in ubiquitous applications", "paper_id": "WOS:000248884300003"}