{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "tm"}, {"score": 0.009325581079916778, "phrase": "tm_network"}, {"score": 0.00909237314052153, "phrase": "average_distance"}, {"score": 0.006953528634001225, "phrase": "interconnection_networks"}, {"score": 0.0038407203087210775, "phrase": "novel_topology"}, {"score": 0.003629557750546267, "phrase": "nxn_network"}, {"score": 0.003591272267478512, "phrase": "total_number"}, {"score": 0.003313215752800657, "phrase": "fully-adaptive_routing"}, {"score": 0.00294612567942717, "phrase": "tms"}, {"score": 0.0029150253706493852, "phrase": "virtual_network"}, {"score": 0.0027741761880779535, "phrase": "deterministic_and_fully-adaptive_routing_techniques"}, {"score": 0.002603012037901889, "phrase": "diameter_reduction"}, {"score": 0.002548331088496964, "phrase": "performance_enhancement"}, {"score": 0.002530359917257626, "phrase": "sufficient_simulation_results"}, {"score": 0.00232431758517087, "phrase": "mesh_network"}, {"score": 0.002127472359795555, "phrase": "experimental_results"}], "paper_keywords": ["Interconnect architecture", " Topology", " Mesh", " TM", " Virtual network partitioning"], "paper_abstract": "The selection of a topology is essential to the performance of interconnection networks, so designing a new, cost-effective topology is very significant. 2D mesh is one of the most popular topologies. However, the diameter and average distance of a 2D mesh are large enough to greatly influence the performance of the network. This paper presents a novel topology called TM, which combines the advantages of both a 2D torus and a 2D mesh. For an nxn network, the total number of links in a TM is the same as that in a mesh, while the diameter of a TM is extremely close to that of a torus. Besides, the average distance of a TM is at the middle of that of a torus and that of a mesh. To prevent deadlocks in TMs, a virtual network partitioning scheme is adopted into the TM network. Moreover, both of the deterministic and fully-adaptive routing techniques in TMs are proposed in this paper. Compared to mesh, the TM network provides average distance and diameter reduction, which contributes to the performance enhancement. Sufficient simulation results are presented to show the effectiveness of the TM network, and the new routing schemes proposed for it, by comparing with the mesh network. Compared to the torus, which requires at least 3 virtual channels to support fully-adaptive routing, the TM network can support fully-adaptive routing with only 2 virtual channels. Seen from the experimental results, in most cases, the performance of TM is worse than the torus, while in some cases, the performance of TM is comparable to torus or even better than the torus.", "paper_title": "TM: a new and simple topology for interconnection networks", "paper_id": "WOS:000325022800026"}