{"auto_keywords": [{"score": 0.04230518402390077, "phrase": "awasthi_et_al"}, {"score": 0.028198276166246455, "phrase": "shen_et_al"}, {"score": 0.004721711709176679, "phrase": "timestamp-based_password_authentication_scheme"}, {"score": 0.004302791070310513, "phrase": "forged_login_attacks"}, {"score": 0.004178351419209898, "phrase": "improved_schemes"}, {"score": 0.003940122359770492, "phrase": "additional_security_threat"}, {"score": 0.0036792371574197826, "phrase": "enhanced_scheme"}, {"score": 0.003520687960750365, "phrase": "additional_attack"}, {"score": 0.003024909947609294, "phrase": "forged_login_attack"}, {"score": 0.0027026375053777543, "phrase": "original_scheme"}, {"score": 0.0026115277372906805, "phrase": "improved_version"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["authentication", " forged login attack", " attack analysis", " smart card loss", " perfect secrecy"], "paper_abstract": "In 2003, Shen et al. proposed a timestamp-based password authentication scheme by using smart card. Later, in 2005 and 2008, this scheme was found susceptible to forged login attacks by some researchers, and improved schemes were proposed. In 2011, Awasthi et al. pointed out an additional security threat on the scheme of Shen et al. and also suggested remedy by proposing an enhanced scheme. In this paper, we analyze the additional attack identified by Awasthi et al. on the scheme of Shen et al. show its flaws and rectify it. Further, we find that the scheme of Awasthi et al. still fails to withstand forged login attack, smart card loss attack, offline password guessing attack, and so on, and also inherits some weaknesses from the original scheme. Therefore, we propose an improved version of the scheme of Awasthi et al. Our improved scheme not only resists the attacks that we depict on the scheme of Awasthi et al. but is also free from the attacks pointed out so far on the scheme of Shen et al. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "An improved timestamp-based password authentication scheme: comments, cryptanalysis, and improvement", "paper_id": "WOS:000344322100022"}