{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_similarity"}, {"score": 0.004759635663291431, "phrase": "relatedness_for_improving_recommendation_accuracy"}, {"score": 0.0045709675813472884, "phrase": "new_measures"}, {"score": 0.004415189385015778, "phrase": "ontological_concepts"}, {"score": 0.003306559295382181, "phrase": "different_properties"}, {"score": 0.003120657021758196, "phrase": "user_interest_values"}, {"score": 0.0030847461428168614, "phrase": "ontology-based_user_models"}, {"score": 0.002877769867854964, "phrase": "event_recommendation_domain"}, {"score": 0.00282822695516646, "phrase": "recipe_domain"}, {"score": 0.0027634902834910184, "phrase": "property-based_propagation"}, {"score": 0.0026691455928407022, "phrase": "standard_edge-based_propagation"}, {"score": 0.0021049977753042253, "phrase": "cross-domain_recommendation"}], "paper_keywords": ["Intelligent System", " Ontology", " Properties", " Relatedness", " Similarity", " User Interest Propagation", " User Model"], "paper_abstract": "The authors introduce new measures of semantic similarity and relatedness for ontological concepts, based on the properties associated to them. They consider two concepts similar if, for some properties they have in common, they also have the same values assigned to these properties. On the other hand, the authors consider two concepts related if they have the same values assigned to different properties. These measures are used in the propagation of user interest values in ontology-based user models to other similar or related concepts in the domain. The authors tested their algorithm in event recommendation domain and in recipe domain and showed that property-based propagation based on similarity outperforms the standard edge-based propagation. Adding relatedness as a criterion for propagation improves diversity without sacrificing accuracy. In addition, assigning a certain relevance to each property improves the accuracy of recommendation. Finally, the property-based spreading activation is effective for cross-domain recommendation.", "paper_title": "Property-based Semantic Similarity and Relatedness for Improving Recommendation Accuracy and Diversity", "paper_id": "WOS:000370264600001"}