{"auto_keywords": [{"score": 0.035006469729082716, "phrase": "semifast_implementations"}, {"score": 0.004757143740648968, "phrase": "time-efficient_implementations"}, {"score": 0.0047342149054612264, "phrase": "atomic_read-write_registers"}, {"score": 0.0047113960612140335, "phrase": "message-passing_systems"}, {"score": 0.0045108906244892165, "phrase": "single_writer"}, {"score": 0.0044891433447112605, "phrase": "multiple_readers"}, {"score": 0.004225950334493496, "phrase": "dutta_et_al"}, {"score": 0.004165105357908494, "phrase": "r._guerraoui"}, {"score": 0.0041450181887917135, "phrase": "r.r._levy"}, {"score": 0.004125027493339274, "phrase": "a._chakraborty"}, {"score": 0.00393032656248792, "phrase": "distributed_computing"}, {"score": 0.003799509133780117, "phrase": "fast_implementations"}, {"score": 0.0032467458539453577, "phrase": "fast_reads"}, {"score": 0.0030048355421601705, "phrase": "single_communication_round-trip"}, {"score": 0.002862855577155183, "phrase": "simulated_scenarios"}, {"score": 0.0027808993286206466, "phrase": "second_communication_round-trip"}, {"score": 0.0026817365934071486, "phrase": "concurrent_readers"}, {"score": 0.002598652897946253, "phrase": "non-unique_virtual_ids"}, {"score": 0.002530359917257626, "phrase": "virtual_id_form"}, {"score": 0.0025181367444581993, "phrase": "virtual_node"}, {"score": 0.00249386680748172, "phrase": "proposed_definition"}, {"score": 0.0023817332409567403, "phrase": "virtual_ids"}, {"score": 0.0022581640371583233, "phrase": "required_communication"}, {"score": 0.002177600561610171, "phrase": "read_operation"}, {"score": 0.0021461840368981475, "phrase": "write_operation"}, {"score": 0.0021049977753042253, "phrase": "semifast_implementation"}], "paper_keywords": ["Fault-tolerance", " Distributed algorithms", " Atomicity", " Read/Write registers", " Communication rounds"], "paper_abstract": "This paper investigates time-efficient implementations of atomic read-write registers in message-passing systems where the number of readers can be unbounded. In particular we study the case of a single writer, multiple readers, and S servers, Such that the writer, any subset of the readers, and up to t servers may crash. A recent result of Dutta et al. [P. Dutta, R. Guerraoui, R.R. Levy, A. Chakraborty, How fast call a distributed atomic read be? In: Proceedings of the 23rd ACM Symposium On Principles of Distributed Computing, 2004, pp. 236-245] shows how to obtain fast implementations in which both reads and writes complete in one communication round-trip, under the constraint that the number of readers is less than s/t - 2, where t < s/2. In that same paper the authors pose a question of whether it is possible to relax the bound on readers, and at what cost, if semifast implementations are considered, i.e., implementations that have fast reads or fast writes. This paper provides an answer to this question. it is shown that one can obtain implementations where all Writes are fast, i.e., involving a single communication round-trip, and where reads complete in one to two communication round-trips under the assumption that no More than t < servers crash. Simulated scenarios included in this paper indicate that only a small fraction of reads require a second communication round-trip. Interestingly the correctness of the implementation does nor depend on the number of concurrent readers in the system. The solution is obtained with the help of non-unique virtual ids assigned to each reader, where the readers sharing a virtual id form a virtual node. For the proposed definition of semifast implementations it is shown that implementations satisfying certain assumptions are semifast if and only if the number of virtual ids in the system is less than s/t - 2. This result is proved to be tight in terms of the required communication. It is shown that only a single complete two communication round-trip read operation may be necessary for each write operation. It is furthermore shown that no semifast implementation exists for the multi-reader, multi-writer model. (C) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Fault-tolerant semifast implementations of atomic read/write registers", "paper_id": "WOS:000261775800007"}