{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "level_one_trauma_center"}, {"score": 0.004711694724000522, "phrase": "emergency_department"}, {"score": 0.004610643000357845, "phrase": "government_agencies"}, {"score": 0.004588481668397177, "phrase": "patient_safety_organizations"}, {"score": 0.0045226318509883606, "phrase": "medical_errors"}, {"score": 0.004372617893717023, "phrase": "contextualize_activities"}, {"score": 0.004087292029393738, "phrase": "ethnographic_study_design"}, {"score": 0.004057843220539914, "phrase": "shadowing_method"}, {"score": 0.004009230728025144, "phrase": "convenience_sample"}, {"score": 0.0037656427459541787, "phrase": "detailed_qualitative_investigations"}, {"score": 0.003684805881902893, "phrase": "small_sample_size"}, {"score": 0.003667078247127308, "phrase": "ethical_approval"}, {"score": 0.0036144035798673967, "phrase": "institutional_ethic_committees"}, {"score": 0.0035539019235553897, "phrase": "community_consent"}, {"score": 0.003511305304824043, "phrase": "ed_staff"}, {"score": 0.0034944094552943, "phrase": "in-service_education"}, {"score": 0.0034111377664032437, "phrase": "trauma_section"}, {"score": 0.0033621270749688748, "phrase": "tertiary_teaching_hospital"}, {"score": 0.003297869502310498, "phrase": "major_medical_center"}, {"score": 0.0032428121024927975, "phrase": "usa"}, {"score": 0.0031883503257472347, "phrase": "ed_physicians"}, {"score": 0.003097367136394196, "phrase": "eight_rns"}, {"score": 0.00291604764120401, "phrase": "hymcia"}, {"score": 0.0028950130802141293, "phrase": "registered_nurses"}, {"score": 0.0028810741581197234, "phrase": "slightly_more_interruptions"}, {"score": 0.002725506980772018, "phrase": "physical_environment"}, {"score": 0.0026605092991308895, "phrase": "physical_design"}, {"score": 0.002456788502135613, "phrase": "enhanced_understanding"}, {"score": 0.0023866312758257188, "phrase": "work_constraints"}, {"score": 0.0022522565004588113, "phrase": "minimal_negative_impact"}, {"score": 0.002161667440995402, "phrase": "negative_impact"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["interruption", " distraction", " emergency medicine"], "paper_abstract": "Background: The emergency department has been characterized as interrupt-driven. Government agencies and patient safety organizations recognize that interruptions contribute to medical errors. The purpose of this study was to observe, record, and contextualize activities and interruptions experienced by physicians and Registered Nurses (RNs) working in a Level One Trauma Center. Methods: Design: A case study that relied on an ethnographic study design using the shadowing method. Subjects: A convenience sample of physicians and RNs, each with at least 6 months of experience in the Emergency Department (ED), were asked to participate. In these kinds of detailed qualitative investigations, it is quite common to have a small sample size. Ethical approval: Approval was obtained from institutional ethic committees prior to initiating the study. Community consent was obtained from the ED staff through in-service education. Setting: All observations were made in the trauma section of the ED of a tertiary teaching hospital. The hospital is situated in a major medical center in the Gulf Coast region of the United States of America (USA). Findings: Five attending ED physicians were observed for a total of 29 h, 31 min. Eight RNs were shadowed for a total of 40h, 9 min. Interruptions and activities were categorized using the Hybrid Method to Categorize Interruptions and Activities (HyMCIA). Registered Nurses received slightly more interruptions per hour than physicians. People, pagers, and telephones were identified as mediums through which interruptions were delivered. The physical environment was found to contribute to interruptions in workflowbecause of physical design and when supplies were not available. Physicians and RNs usually returned to the original, interrupted activity more often than leaving the activity unfinished. Conclusion: This research provides an enhanced understanding of interruptions in workflow in the ED, the identification of work constraints, and the need to develop interventions to manage interruptions. It is crucial that interruptions be delivered in such a way that there is minimal negative impact on performance. The significance and importance of the interruption must always be weighed against the negative impact that it has on smooth, efficient workflow. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Interruptions in a level one trauma center: A case study", "paper_id": "WOS:000255676600003"}