{"auto_keywords": [{"score": 0.039886264626885645, "phrase": "cloud_computing_environment"}, {"score": 0.014519918378238761, "phrase": "software"}, {"score": 0.011008390143786928, "phrase": "saas_erp_package"}, {"score": 0.009748664079072206, "phrase": "qos_model"}, {"score": 0.008569011562219073, "phrase": "quality_clusters"}, {"score": 0.007735655746851228, "phrase": "priority_weights"}, {"score": 0.004814953708764168, "phrase": "mcdm"}, {"score": 0.004779773142725556, "phrase": "saas_erp_applications"}, {"score": 0.004756463788853192, "phrase": "social_network"}, {"score": 0.004733267566274583, "phrase": "cloud_computing"}, {"score": 0.004630270043271386, "phrase": "user's_data"}, {"score": 0.004607686390487483, "phrase": "system_resources"}, {"score": 0.00413767314434795, "phrase": "application_software"}, {"score": 0.004027830092522303, "phrase": "traditional_way"}, {"score": 0.003988611346253368, "phrase": "enterprise_resource_planning"}, {"score": 0.003920891569777894, "phrase": "system_service_environment"}, {"score": 0.003697287104870263, "phrase": "erp_system_service"}, {"score": 0.0029589763499261726, "phrase": "saas_erp."}, {"score": 0.002944520141417657, "phrase": "proposed_qos_model"}, {"score": 0.00290883667820865, "phrase": "functionality"}, {"score": 0.0028803954441904635, "phrase": "usability"}, {"score": 0.0027225697292481165, "phrase": "saas_erp"}, {"score": 0.00265669312053797, "phrase": "priority_order"}, {"score": 0.002579736401984506, "phrase": "expert_group"}, {"score": 0.002523481637809674, "phrase": "social_network_group"}, {"score": 0.002511147699138714, "phrase": "social_networks"}, {"score": 0.002444378128300023, "phrase": "expert_groups"}, {"score": 0.002379379676378223, "phrase": "pairwise_comparisons"}, {"score": 0.002276717177453959, "phrase": "quality_network_model"}, {"score": 0.002227055417826555, "phrase": "saas_erps"}, {"score": 0.0021049977753042253, "phrase": "users'_needs"}], "paper_keywords": ["SaaS", " SaaS ERP", " Cloud computing", " SaaS quality", " MCDM", " Quality evaluation model", " Pairwise comparison"], "paper_abstract": "Cloud computing delivers almost all of its services including software, user's data, system resources, processes and their computation over the Internet. Cloud computing consists of three main classes; Software as a Service, Infrastructure as a Service and Platform as a Service. Using Software as a Service (SaaS), users are able to rent application software and databases which they then install onto their computer in the traditional way. In the Enterprise Resource Planning (ERP) system, the system service environment changed so as to allow the application of the SaaS in the cloud computing environment. This change was implemented in order to provide the ERP system service to users in a cheaper, more convenient and efficient form through the Internet as opposed to having to set up their own computer. Recently many SaaS ERP packages are available on the Internet. For this reason, it is very difficult for users to find the SaaS ERP package that would best suit their requirements. The QoS (Quality of Service) model can provide a solution to this problem. However, according to recent research, not only quality attributes' identification for SaaS ERP, but also a process for finding and recommending software in the cloud computing environment, has proved to be lacking. In this paper, we propose a QoS model for SaaS ERP. The proposed QoS model consists of 6 criteria; Functionality, Reliability, Usability, Efficiency, Maintainability and Business. Using this QoS model, we propose a Multi Criteria Decision Making (MCDM) system that finds the best fit for the SaaS ERP in the cloud computing environment and makes recommendations to users in priority order. In order to organize the quality clusters, we organized an expert group and got their opinion to organize the quality clusters using Social Network Group. Social Networks can be used efficiently to get opinion by various types of expert groups. In order to establish the priority, we used pairwise comparisons to calculate the priority weights of each quality attribute while accounting for their interrelation. Finally, using the quality network model and priority weights, this study evaluated three types of SaaS ERPs. Our results show how to find the most suitable SaaS ERPs according to their correlation with the criteria and to recommend a SaaS ERP package which best suits users' needs.", "paper_title": "The QoS-based MCDM system for SaaS ERP applications with Social Network", "paper_id": "WOS:000326461100002"}