{"auto_keywords": [{"score": 0.04382023823397116, "phrase": "rfid"}, {"score": 0.00481495049065317, "phrase": "efficient_services_management"}, {"score": 0.004749913509007163, "phrase": "ai_and_wireless_techniques"}, {"score": 0.004717723626157272, "phrase": "radio_frequency"}, {"score": 0.004560002169647084, "phrase": "wide_variety"}, {"score": 0.004483120978156604, "phrase": "highway_toll_collection"}, {"score": 0.004437613070853689, "phrase": "access_control"}, {"score": 0.004103662938882996, "phrase": "modest_investment"}, {"score": 0.003899476621346112, "phrase": "new_use"}, {"score": 0.0037818557818203188, "phrase": "physical_location"}, {"score": 0.00356924199356768, "phrase": "desired_locations"}, {"score": 0.003509006038574667, "phrase": "sigueme"}, {"score": 0.003403122817578447, "phrase": "meco's_public_library"}, {"score": 0.003357248260399312, "phrase": "spain"}, {"score": 0.0031682817605340028, "phrase": "rfid_sensors_system"}, {"score": 0.0030310732341527168, "phrase": "users'_requests"}, {"score": 0.002755338691613447, "phrase": "wireless_communications_system"}, {"score": 0.0027273213556458214, "phrase": "zigbee_technology"}, {"score": 0.002565084553019013, "phrase": "rfid_users"}, {"score": 0.0023717148226629105, "phrase": "reading_rooms"}, {"score": 0.00226892463779702, "phrase": "library_staff"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Libraries", " Orientation", " Planning", " RFID", " Zigbee"], "paper_abstract": "Radio Frequency IDentification (RFID) has been used in a wide variety of applications such as highway toll collection, building access control, animal tracking, remote keyless entry for automobiles and tracking assets. For example, RFID in libraries, with a modest investment, can improve the capabilities of both librarians and users. This paper presents a new use of RFID in libraries to help determining the physical location of a book within the library and to provide assistance to users to arrive to the desired locations. Our initial prototype, named SIGUEME, has been extended and experimentally implemented in Meco's Public Library (Madrid, Spain). The application comprises three main systems; an electronic one - which detects users through a RFID sensors system; an AI-based system to plan and to monitor the users' requests according to their interests; and finally a screen-based information system that communicates visually the directions the users have to follow. We have developed a wireless communications system based on Zigbee technology to allow both, the information flow across the building and to connect the antennas to detect RFID users. This eliminates the need for using wires. The application not only helps users to easily locate the books or the reading rooms inside the building, but also automates tasks manually performed by the library staff (i.e. generate statistics about books usage time, age-related usage, etc). (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Efficient Services Management in Libraries using AI and Wireless techniques", "paper_id": "WOS:000341462600021"}