{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "u.k."}, {"score": 0.023128863051107496, "phrase": "e-government_literature"}, {"score": 0.004374593906165761, "phrase": "exploratory_research_project"}, {"score": 0.00388729255686046, "phrase": "research_agenda"}, {"score": 0.0037188360359702182, "phrase": "solid_practical_ground"}, {"score": 0.003479692058963528, "phrase": "novel_methodology"}, {"score": 0.003378385493203297, "phrase": "road_map"}, {"score": 0.0033288399506044763, "phrase": "future_e-government_initiatives"}, {"score": 0.0027673496368158545, "phrase": "viego_workshops"}, {"score": 0.0026867260506696455, "phrase": "e-government_research_agenda"}, {"score": 0.0024586427394152196, "phrase": "empirical_case-based_experience"}, {"score": 0.0023694065215394593, "phrase": "e-government_processes"}, {"score": 0.0021049977753042253, "phrase": "research_questions"}], "paper_keywords": ["electronic government", " report", " VIEGO", " survey", " research agenda"], "paper_abstract": "This paper presents the findings of an exploratory research project into future e-Government (electronic Government) initiatives. The Virtual Institute for Electronic Government Research (VIEGO) project aimed at identifying and further developing the research agenda of e-Government based on a solid practical ground. As such, the paper offers a novel methodology in identifying the road map for future e-Government initiatives based on a series of workshops organised around the U.K. hosting a mixture of stakeholders involving both academics and practitioners. The analysis of the VIEGO workshops depicted that an e-Government research agenda involves a combination of social, technological and organisational issues at both governmental and individual citizen level, ultimately driven by empirical case-based experience and active participation in e-Government processes. Unlike other propositions for the future of e-Government offered in the e-Government literature, it raised research questions not only originated from an analysis of e-Government literature but also on the outcome of brainstorming, reflections and contemplations throughout the duration of the project.", "paper_title": "Electronic transformation of government in the U.K.: a research agenda", "paper_id": "WOS:000250383400004"}