{"auto_keywords": [{"score": 0.04850161465082996, "phrase": "multi-secret_sharing_scheme"}, {"score": 0.04056623242689927, "phrase": "multi-secret_sharing_schemes"}, {"score": 0.00481495049065317, "phrase": "multiple_secrets"}, {"score": 0.004338390136272005, "phrase": "distinct_family"}, {"score": 0.0039380388343479384, "phrase": "information-theoretic_approach"}, {"score": 0.003779943062894615, "phrase": "specific_models"}, {"score": 0.0035479614996805383, "phrase": "security_properties"}, {"score": 0.003405472159599445, "phrase": "security_property"}, {"score": 0.003293142761521425, "phrase": "particular_probability_distribution"}, {"score": 0.0031726587374218277, "phrase": "analogous_result"}, {"score": 0.0031140747752837826, "phrase": "single-secret_sharing_schemes"}, {"score": 0.0027433143290371293, "phrase": "lower_bounds"}, {"score": 0.0025940660106162404, "phrase": "general_case"}, {"score": 0.002217880187104576, "phrase": "specific_access_structures"}, {"score": 0.0022013916728990564, "phrase": "particular_interest"}, {"score": 0.0021526564019119466, "phrase": "access_structures"}, {"score": 0.002136651746284283, "phrase": "threshold_structures"}, {"score": 0.0021049977753042253, "phrase": "tight_bounds"}], "paper_keywords": ["data security", " cryptography", " secret sharing schemes", " information theory"], "paper_abstract": "A multi-secret sharing scheme is a protocol to share more than one secret among a set of participants, where each secret may have a distinct family of subsets of participants (also called 'Cyaccess structure') that are qualified to recover it. In this paper we use an information-theoretic approach to analyze two different models for multi-secret sharing schemes. The proposed models generalize specific models which have already been considered in the literature. We first analyze the relationships between the security properties of the two models. Afterwards, we show that the security property of a multi-secret sharing scheme does not depend on the particular probability distribution on the sets of secrets. This extends the analogous result for the case of single-secret sharing schemes and implies that the bounds on the size of the information distributed to participants in multi-secret sharing schemes can all be strengthened. For each of the two models considered in this paper, we show lower bounds on the size of the shares distributed to participants. Specifically, for the general case in which the secrets are shared according to a tuple of arbitrary (and possibly different) access structures, we show a combinatorial condition on these structures that is sufficient to require a participant to hold information of size larger than a certain subset of secrets. For specific access structures of particular interest, namely, when all access structures are threshold structures, we show tight bounds on the size of the information distributed to participants.", "paper_title": "Sharing multiple secrets: Models, schemes and analysis", "paper_id": "WOS:000235443600008"}