{"auto_keywords": [{"score": 0.004379737380744606, "phrase": "mesh_deformation"}, {"score": 0.004155113657645735, "phrase": "free_and_moving_boundary_problems"}, {"score": 0.0036810726176482278, "phrase": "computational_tetrahedral_mesh"}, {"score": 0.0034555479218891638, "phrase": "negative_subdomains"}, {"score": 0.003383475802364289, "phrase": "set'_functions"}, {"score": 0.002798662730881037, "phrase": "computational_mesh"}, {"score": 0.0027547408718334603, "phrase": "implicitly-defined_domain"}, {"score": 0.0025994945418484935, "phrase": "three-dimensional_domain"}, {"score": 0.0024529757621396717, "phrase": "surface_and_volume_parts"}, {"score": 0.002266364679369248, "phrase": "mesh_generation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Remeshing", " Level set method", " Mesh evolution", " Shape optimization", " Bifluid flows"], "paper_abstract": "The aim of this paper is to propose a method for dealing with the problem of mesh deformation (or mesh evolution) in the context of free and moving boundary problems, in three space dimensions. The method consists in combining two different numerical parameterizations of domains: on the one hand, domains are equipped with a computational tetrahedral mesh, and on the other hand, they are represented as the negative subdomains of 'level set' functions. We then consistently switch from one description to the other, depending on their respective convenience with respect to the operations to be performed. Among other things, doing so implies to be able to get a computational mesh from an implicitly-defined domain. This in turns relies on an algorithm for handling three-dimensional domain remeshing (that is, remeshing at the same time both surface and volume parts of a given tetrahedral mesh). Applications are considered in the fields of mesh generation, shape optimization, and computational fluid dynamics. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Three-dimensional adaptive domain remeshing, implicit domain meshing, and applications to free and moving boundary problems", "paper_id": "WOS:000330955200020"}