{"auto_keywords": [{"score": 0.046154511977577965, "phrase": "software_system"}, {"score": 0.004582897918101983, "phrase": "code_cloning"}, {"score": 0.0043619799095455415, "phrase": "bad_practice"}, {"score": 0.004208002469225673, "phrase": "system's_design"}, {"score": 0.003951453722517865, "phrase": "significant_evidence"}, {"score": 0.0037272031155266556, "phrase": "principled_engineering_tool"}, {"score": 0.003595552309967789, "phrase": "possible_new_features"}, {"score": 0.0034685354330506605, "phrase": "affected_subsystems"}, {"score": 0.003406713877432236, "phrase": "new_features"}, {"score": 0.003141830113006653, "phrase": "experimental_subsystems"}, {"score": 0.0030171910207671205, "phrase": "stable_code_base"}, {"score": 0.002845809662579165, "phrase": "stable_version"}, {"score": 0.0023451630074289146, "phrase": "apache"}, {"score": 0.002292965705677312, "phrase": "gnumeric_spreadsheet_application"}, {"score": 0.0021049977753042253, "phrase": "positive_impact"}], "paper_keywords": ["Clone detection", " Clone analysis", " Reverse engineering", " Case study"], "paper_abstract": "Literature on the topic of code cloning often asserts that duplicating code within a software system is a bad practice, that it causes harm to the system's design and should be avoided. However, in our studies, we have found significant evidence that cloning is often used in a variety of ways as a principled engineering tool. For example, one way to evaluate possible new features for a system is to clone the affected subsystems and introduce the new features there, in a kind of sandbox testbed. As features mature and become stable within the experimental subsystems, they can be migrated incrementally into the stable code base; in this way, the risk of introducing instabilities in the stable version is minimized. This paper describes several patterns of cloning that we have observed in our case studies and discusses the advantages and disadvantages associated with using them. We also examine through a case study the frequencies of these clones in two medium-sized open source software systems, the Apache web server and the Gnumeric spreadsheet application. In this study, we found that as many as 71% of the clones could be considered to have a positive impact on the maintainability of the software system.", "paper_title": "Cloning considered harmful considered harmful: patterns of cloning in software", "paper_id": "WOS:000262725700003"}