{"auto_keywords": [{"score": 0.037650280669234266, "phrase": "cvar_approximation"}, {"score": 0.00481495049065317, "phrase": "value-at-risk_constrained_programs"}, {"score": 0.004582528208024817, "phrase": "optimization_problems"}, {"score": 0.004382960174765274, "phrase": "var"}, {"score": 0.004296998284839309, "phrase": "coherent_risk_measure"}, {"score": 0.0034901729647741353, "phrase": "best_convex_conservative_approximation"}, {"score": 0.0033545600622020464, "phrase": "poor_performance"}, {"score": 0.0031609252620168446, "phrase": "different_perspective"}, {"score": 0.0029344771385297163, "phrase": "lost_part"}, {"score": 0.002806449337145999, "phrase": "sequential_convex_approximation_approach"}, {"score": 0.002670719148310961, "phrase": "cvar-like_approximation"}, {"score": 0.002467038647952607, "phrase": "var_constraints"}, {"score": 0.0021902063413831545, "phrase": "target_problem"}, {"score": 0.002157857111130435, "phrase": "numerical_experiments"}], "paper_keywords": ["value-at-risk", " conditional value-at-risk", " Monte Carlo", " CVaR-like approximation"], "paper_abstract": "We study optimization problems with value-at-risk (VaR) constraints. Because it lacks subadditivity, VaR is not a coherent risk measure and does not necessarily preserve the convexity. Thus, the problems we consider are typically not provably convex. As such, the conditional value-at-risk (CVaR) approximation is often used to handle such problems. Even though the CVaR approximation is known as the best convex conservative approximation, it sometimes leads to solutions with poor performance. In this paper, we investigate the CVaR approximation from a different perspective and demonstrate what is lost in this approximation. We then show that the lost part of this approximation can be remedied using a sequential convex approximation approach, in which each iteration only requires solving a CVaR-like approximation via certain Monte Carlo techniques. We show that the solution found by this approach generally makes the VaR constraints binding and is guaranteed to be better than the solution found by the CVaR approximation and moreover is empirically often globally optimal for the target problem. The numerical experiments show the effectiveness of our approach.", "paper_title": "Conditional Value-at-Risk Approximation to Value-at-Risk Constrained Programs: A Remedy via Monte Carlo", "paper_id": "WOS:000334602800014"}