{"auto_keywords": [{"score": 0.049835326202745084, "phrase": "strategic_fixation"}, {"score": 0.01569462054257878, "phrase": "jotmail"}, {"score": 0.010612387000973441, "phrase": "speech_data"}, {"score": 0.004227653047394939, "phrase": "transcript-centric_access"}, {"score": 0.004163427731140163, "phrase": "speech_access"}, {"score": 0.004068907083697369, "phrase": "external_visual_indices"}, {"score": 0.003956279504935489, "phrase": "information-rich_regions"}, {"score": 0.00385658790017119, "phrase": "transcribing_speech"}, {"score": 0.0038369519063516703, "phrase": "automatic_speech_recognition"}, {"score": 0.0037498152007206815, "phrase": "visual_cues"}, {"score": 0.0037212099691734477, "phrase": "resulting_enriched_transcript"}, {"score": 0.0036553070575015344, "phrase": "original_speech"}, {"score": 0.003535985831484511, "phrase": "additional_visual_cues"}, {"score": 0.0033173234105492895, "phrase": "reference_tasks"}, {"score": 0.0032752356604145738, "phrase": "current_voicemail_practice"}, {"score": 0.003250238918180901, "phrase": "field_trial_evaluation"}, {"score": 0.003160200215473349, "phrase": "commercial_unified_messaging_clients"}, {"score": 0.0029196116767956273, "phrase": "manual_notes"}, {"score": 0.00288255520607591, "phrase": "effective_retrieval_indices"}, {"score": 0.002753001049291581, "phrase": "asr"}, {"score": 0.002690406375639144, "phrase": "scanmail"}, {"score": 0.0026698611202305715, "phrase": "information_extraction_techniques"}, {"score": 0.0026359661683151006, "phrase": "potential_interest"}, {"score": 0.0025694584194998356, "phrase": "laboratory_and_field_trials"}, {"score": 0.0024602142099138706, "phrase": "information_extraction"}, {"score": 0.0023798115577749225, "phrase": "asr_transcripts"}, {"score": 0.002361632539339945, "phrase": "highly_effective_tool"}, {"score": 0.0023197517832705297, "phrase": "enriched_transcript"}, {"score": 0.0022786120364641674, "phrase": "underlying_speech"}, {"score": 0.002165037521598491, "phrase": "long-term_field_trials"}, {"score": 0.0021049977753042253, "phrase": "mobile_access"}], "paper_keywords": [""], "paper_abstract": "When users access information from text, they engage in strategic fixation, visually scanning the text to focus on regions of interest. However, because speech is both serial and ephemeral, it does not readily support strategic fixation. This paper describes two design principles, indexing and transcript-centric access that address the problem of speech access by supporting strategic fixation. Indexing involves users constructing external visual indices into speech. Users visually scan these indices to find information-rich regions of speech for more detailed processing and playback. Transcription involves transcribing speech using automatic speech recognition (ASR) and enriching that transcription with visual cues. The resulting enriched transcript is time-aligned to the original speech, allowing users to scan the transcript as a whole or the additional visual cues present in the transcript, to fixate and play regions of interest. We tested the effectiveness of these two approaches on a set of reference tasks derived from observations of current voicemail practice. A field trial evaluation of JotMail, an indexed-based interface similar to commercial unified messaging clients, showed that our approaches were effective in supporting speech scanning, information extraction and status tracking, but not archive management. However, users found it onerous to take manual notes with JotMail to provide effective retrieval indices. We therefore built SCANMail, a transcript-based interface that constructs indices automatically, using ASR to generate a transcript of the speech data. SCANMail also uses information extraction techniques to identify regions of potential interest, e.g. telephone numbers, within the transcript. Laboratory and field trials showed that SCANMail overcame most of the problems users reported with JotMail, supporting scanning, information extraction and archiving. Importantly, our evaluations showed that, despite errors, ASR transcripts provide a highly effective tool for browsing. Users exploited the enriched transcript to determine the gist of the underlying speech, and as a guide to identifying areas of speech that it was critical for them to play. Long-term field trials also showed the utility of transcripts to support notification and mobile access. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Accessing speech data using strategic fixation", "paper_id": "WOS:000242491800005"}