{"auto_keywords": [{"score": 0.047869525215773305, "phrase": "personalized_system"}, {"score": 0.00481495049065317, "phrase": "formative_evaluations"}, {"score": 0.004459334186889869, "phrase": "unique_output"}, {"score": 0.003916098498242888, "phrase": "specific_new_usability_issues"}, {"score": 0.003735349093835257, "phrase": "personalized_systems"}, {"score": 0.0032033846797483475, "phrase": "usability_problems"}, {"score": 0.00314708280192844, "phrase": "personalized_search_engine"}, {"score": 0.00266693888510356, "phrase": "specific_usability_issues"}, {"score": 0.002426137929553722, "phrase": "intended_context"}, {"score": 0.002181069180139225, "phrase": "disproportionate_number"}, {"score": 0.002155412043665635, "phrase": "positive_comments"}, {"score": 0.0021049977753042253, "phrase": "formative_evaluation"}], "paper_keywords": [""], "paper_abstract": "A personalized system is one that generates unique output for each individual. As a result, personalization has transformed the interaction between the user and the system, and specific new usability issues have arisen. Methods used for evaluating personalized systems should be able to reveal the issues and problems specifically associated with personalization. Therefore this study evaluated three of the most common test methods used to detect usability problems in a personalized search engine. This was done by comparing the comments generated from thinking-aloud, questionnaires, and interviews. Questionnaires and interviews appear to be more useful for assessing specific usability issues for personalization, whereas thinking-aloud generates more comments on the usefulness of the system in the intended context of use and identifies the most critical and serious problems. Interviews, on the other hand, appear to yield a disproportionate number of positive comments. During the formative evaluation of a personalized system it is best to use a combination of thinking-aloud and questionnaires. This article concludes with a summary of implications for practitioners.", "paper_title": "Identifying Usability Issues for Personalization During Formative Evaluations: A Comparison of Three Methods", "paper_id": "WOS:000290686300005"}