{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "optimal_water_resources_deployment"}, {"score": 0.006943746883815172, "phrase": "mcoa"}, {"score": 0.0054821154799686595, "phrase": "proposed_algorithm"}, {"score": 0.004666756595735701, "phrase": "water_resources_deployment_problem"}, {"score": 0.00458412183693466, "phrase": "multi-objective_nonlinear_problem"}, {"score": 0.004482873744893272, "phrase": "space-time_variability"}, {"score": 0.004009074013302036, "phrase": "chaotic_optimization"}, {"score": 0.0036498637283470386, "phrase": "chaotic_series"}, {"score": 0.003601235776892337, "phrase": "logistic_mapping"}, {"score": 0.0035532533960012298, "phrase": "feasible_region"}, {"score": 0.003474694300991964, "phrase": "best_results"}, {"score": 0.0034437574674180365, "phrase": "iterative_comparison"}, {"score": 0.0031350397225314262, "phrase": "global_optimization_method"}, {"score": 0.003093249591867931, "phrase": "high_efficiency"}, {"score": 0.002957919048133256, "phrase": "optimal_deployment"}, {"score": 0.002931569771634119, "phrase": "water_resources"}, {"score": 0.0027659126653647712, "phrase": "entropy_change_theory"}, {"score": 0.002418393046947528, "phrase": "main_limitations"}, {"score": 0.002162316557411786, "phrase": "new_optimization_algorithm"}, {"score": 0.0021049977753042253, "phrase": "mcoa."}], "paper_keywords": ["Optimization techniques", " Water supply", " Cybernetics"], "paper_abstract": "Purpose - To solve the water resources deployment problem which is a multi-objective nonlinear problem with the characteristic of space-time variability, involving many factors, such as economy, society, ecology, environment and projects. Design/methodology/approach - Coupling the characteristic of multi-objective with chaotic optimization, a multi-objective chaotic optimization algorithm (MCOA) is proposed for optimal water resources deployment. The algorithm magnifies the chaotic series generated by logistic mapping to the feasible region, and seeks the best results by iterative comparison which can avoid the difficulties that objective functions and the constraints should be continuous and differentiable. MCOA is a global optimization method and has high efficiency. Findings - The proposed algorithm is applied to the optimal deployment of water resources in a certain river basin. The rationality of results is verified by the entropy change theory. The results indicate that the optimal water resources deployment can be realized using the proposed algorithm in a more rational way. Research limitations/implications - The numbers and the bounds of variables are the main limitations which the algorithm will be applied. Practical implications - A very useful optimization algorithm for optimal water resources deployment. Originality/value - The paper highlights the new optimization algorithm for optimal water resources deployment due to the MCOA.", "paper_title": "Multi-objective chaotic optimization algorithm and its application in optimal water resources deployment", "paper_id": "WOS:000261315700022"}