{"auto_keywords": [{"score": 0.04941343102175344, "phrase": "schnyder_woods"}, {"score": 0.04810827982024645, "phrase": "specific_way"}, {"score": 0.03741188355038357, "phrase": "schnyder_decompositions"}, {"score": 0.014069798099945605, "phrase": "schnyder_decomposition"}, {"score": 0.010855213265543394, "phrase": "distinguished_vertex_v"}, {"score": 0.00481495049065317, "phrase": "regular_plane_graphs"}, {"score": 0.004703878334423852, "phrase": "simple_triangulations"}, {"score": 0.004355121994670442, "phrase": "da_parts"}, {"score": 0.004137044258506928, "phrase": "internal_edge"}, {"score": 0.004069963083642548, "phrase": "spanning_forests"}, {"score": 0.0037856752600638243, "phrase": "alternative_formulations"}, {"score": 0.0035294124702649927, "phrase": "fixed_d-angulation"}, {"score": 0.0034802729280592097, "phrase": "natural_structure"}, {"score": 0.0034640450599342488, "phrase": "distributive_lattice"}, {"score": 0.0033603864623013733, "phrase": "d-regular_plane_graphs"}, {"score": 0.0030248681019630166, "phrase": "even_values"}, {"score": 0.0029002080677372195, "phrase": "additional_properties"}, {"score": 0.0028732090786345063, "phrase": "reduced_formulation"}, {"score": 0.0028068030356445894, "phrase": "well-studied_structures"}, {"score": 0.0026166287606163145, "phrase": "even_schnyder_decompositions"}, {"score": 0.002410942838102255, "phrase": "permutation_pattern"}, {"score": 0.0023829065537836138, "phrase": "orthogonal_drawing"}, {"score": 0.0023223663501882917, "phrase": "exactly_one_bend"}, {"score": 0.002170015433265059, "phrase": "drawing_algorithms"}, {"score": 0.0021447748132703078, "phrase": "obtained_grid-size"}, {"score": 0.0021049977753042253, "phrase": "uniformly_random_instance"}], "paper_keywords": ["Schnyder woods", " Schnyder labelling", " Forest decomposition", " Nash-Williams theorem", " 4-regular map", " Straight-line drawing", " Orthogonal drawing"], "paper_abstract": "Schnyder woods are decompositions of simple triangulations into three edge-disjoint spanning trees crossing each other in a specific way. In this article, we generalize the definition of Schnyder woods to d-angulations (plane graphs with faces of degree d) for all da parts per thousand yen3. A Schnyder decomposition is a set of d spanning forests crossing each other in a specific way, and such that each internal edge is part of exactly d-2 of the spanning forests. We show that a Schnyder decomposition exists if and only if the girth of the d-angulation is d. As in the case of Schnyder woods (d=3), there are alternative formulations in terms of orientations (\"fractional\" orientations when da parts per thousand yen5) and in terms of corner-labellings. Moreover, the set of Schnyder decompositions of a fixed d-angulation of girth d has a natural structure of distributive lattice. We also study the dual of Schnyder decompositions which are defined on d-regular plane graphs of mincut d with a distinguished vertex v (au): these are sets of d spanning trees rooted at v (au) crossing each other in a specific way and such that each edge not incident to v (au) is used by two trees in opposite directions. Additionally, for even values of d, we show that a subclass of Schnyder decompositions, which are called even, enjoy additional properties that yield a reduced formulation; in the case d=4, these correspond to well-studied structures on simple quadrangulations (2-orientations and partitions into 2 spanning trees). In the case d=4, we obtain straight-line and orthogonal planar drawing algorithms by using the dual of even Schnyder decompositions. For a 4-regular plane graph G of mincut 4 with a distinguished vertex v (au) and n-1 other vertices, our algorithms places the vertices of G\\v (au) on a (n-2)x(n-2) grid according to a permutation pattern, and in the orthogonal drawing each of the 2n-4 edges of G\\v (au) has exactly one bend. The vertex v (au) can be embedded at the cost of 3 additional rows and columns, and 8 additional bends. We also describe a further compaction step for the drawing algorithms and show that the obtained grid-size is strongly concentrated around 25n/32x25n/32 for a uniformly random instance with n vertices.", "paper_title": "Schnyder Decompositions for Regular Plane Graphs and Application to Drawing", "paper_id": "WOS:000298852300025"}