{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ensemble-based_classification"}, {"score": 0.004771435352180973, "phrase": "mining_data_streams"}, {"score": 0.004685575787741084, "phrase": "important_and_challenging_task"}, {"score": 0.0046221918332842995, "phrase": "wide_range"}, {"score": 0.004051828608343507, "phrase": "accurate_model"}, {"score": 0.0038194503801108324, "phrase": "smart_way"}, {"score": 0.0033630629374009576, "phrase": "fast_reaction"}, {"score": 0.0031990183472675377, "phrase": "data_trend"}, {"score": 0.003056819704624705, "phrase": "novel_data_structures"}, {"score": 0.002778385486855157, "phrase": "introduced_model"}, {"score": 0.0027407299369891502, "phrase": "overall_ensemble_architecture"}, {"score": 0.002548331088496964, "phrase": "numerical_attributes"}, {"score": 0.0025137856138000014, "phrase": "large_part"}, {"score": 0.0021049977753042253, "phrase": "top_level"}], "paper_keywords": ["Mining data streams", " Classification", " Concept drifting", " Ensemble classifier", " Data aggregation"], "paper_abstract": "Mining data streams has become an important and challenging task for a wide range of applications. In these scenarios, data tend to arrive in multiple, rapid and time-varying streams, thus constraining data mining algorithms to look at data only once. Maintaining an accurate model, e.g. a classifier, while the stream goes by requires a smart way of keeping track of the data already passed away. Such a synthetic structure has to serve two purposes: distilling the most of information out of past data and allowing a fast reaction to concept drifting, i.e. to the change of the data trend that necessarily affects the model. The paper outlines novel data structures and algorithms to tackle the above problem, when the model mined out of the data is a classifier. The introduced model and the overall ensemble architecture are presented in details, even considering how the approach can be extended for treating numerical attributes. A large part of the paper discusses the experiments and the comparisons with several existing systems. The comparisons show that the performance of our system in general, and in particular with respect to the reaction to concept drifting, is at the top level.", "paper_title": "Stream mining: a novel architecture for ensemble-based classification", "paper_id": "WOS:000299092500001"}