{"auto_keywords": [{"score": 0.012474359287767797, "phrase": "ehr"}, {"score": 0.00481495049065317, "phrase": "privacy_management"}, {"score": 0.004698086429418318, "phrase": "user_activities"}, {"score": 0.004514173914270395, "phrase": "collaborative_clinical_work"}, {"score": 0.0044181310380945705, "phrase": "hospital_it_staff"}, {"score": 0.004258195773502909, "phrase": "hospital_it_staff_members'_perceptions"}, {"score": 0.004066360459825868, "phrase": "patient_information"}, {"score": 0.0039920586058503705, "phrase": "patients'_private_information"}, {"score": 0.0038831337860595434, "phrase": "important_role"}, {"score": 0.00369674903275185, "phrase": "user_work_practices"}, {"score": 0.0036628073805800377, "phrase": "users'_actual_work_practices"}, {"score": 0.0034022184461070114, "phrase": "collaboration_challenges"}, {"score": 0.003340011311961488, "phrase": "privacy_breaches"}, {"score": 0.003278937848591921, "phrase": "qualitative_data_collection_methods"}, {"score": 0.003209090947105003, "phrase": "semi-structured_interviews"}, {"score": 0.003121462741365354, "phrase": "ehr_users"}, {"score": 0.0030927866759789045, "phrase": "inpatient_units"}, {"score": 0.002971528026470718, "phrase": "users'_work_activities"}, {"score": 0.0029171727082441244, "phrase": "privacy-compromising_workarounds"}, {"score": 0.0025713631281616784, "phrase": "hospital's_it_staff"}, {"score": 0.0025477277691093097, "phrase": "daunting_task"}, {"score": 0.002524309110841349, "phrase": "users'_collaborative_work_practices"}, {"score": 0.002462903804873404, "phrase": "effective_privacy_mechanisms"}, {"score": 0.002359008443447167, "phrase": "clear_understanding"}, {"score": 0.002197730652838317, "phrase": "patient_privacy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["IT Staff", " Workarounds", " Collaboration", " Privacy", " Electronic health record (EHR)", " Users"], "paper_abstract": "Purpose: We examined the role of privacy in collaborative clinical work and how it is understood by hospital IT staff. The purpose of our study was to identify the gaps between hospital IT staff members' perceptions of how electronic health record (EHR) users' protect the privacy of patient information and how users actually protect patients' private information in their daily collaborative activities. Since the IT staff play an important role in implementing and maintaining the EHR, any gaps that exist between the IT staff's perceptions of user work practices and the users' actual work practices can result in a number of problems in the configuration, implementation, or customization of the EHR, which can lead to collaboration challenges, interrupted workflow, and privacy breaches. Methods: We used qualitative data collection methods for this study. We conducted semi-structured interviews with 20 hospital IT staff members. We also conducted observations of EHR users in the inpatient units of the same hospital. Results: We identified gaps in IT staff's understandings of users' work activities, especially in regards to privacy-compromising workarounds that are used by users and why they are used. Discussion: We discuss the reasons why this gap may exist between IT staff and users and ways to improve IT staff's understanding of why users perform certain privacy-compromising workarounds. Conclusion: A hospital's IT staff face a daunting task in ensuring users' collaborative work practices are supported by the system while providing effective privacy mechanisms. In order to achieve both goals, the IT staff must have a clear understanding of their users' practices. However, as this study highlights, there may be a mismatch between the IT staff's understandings of how users protect patient privacy and how users actually protect privacy. (C) 2015 Published by Elsevier Ireland Ltd.", "paper_title": "Designing for privacy management in hospitals: Understanding the gap between user activities and IT staff's understandings", "paper_id": "WOS:000363858100008"}