{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "ultimate_tensile_strength"}, {"score": 0.04243432406014923, "phrase": "chemical_compositions"}, {"score": 0.014283156728644386, "phrase": "ann"}, {"score": 0.004481954307639453, "phrase": "new_approach"}, {"score": 0.004406994912939125, "phrase": "artificial_neural_network"}, {"score": 0.004189523950071494, "phrase": "thermomechanical_treatment"}, {"score": 0.00413684709497912, "phrase": "independent_variables"}, {"score": 0.0038668462001710314, "phrase": "ceiiw"}, {"score": 0.0037070855410818986, "phrase": "chemical_portion"}, {"score": 0.003660452313567116, "phrase": "ito-bessyo_carbon_equivalent_equation"}, {"score": 0.0033218213825698417, "phrase": "niobium_and_vanadium_concentrations"}, {"score": 0.003117986133774198, "phrase": "copper_concentrations"}, {"score": 0.0029765021982951162, "phrase": "cvn"}, {"score": 0.0027009493171069763, "phrase": "experimental_results"}, {"score": 0.0026222551419772867, "phrase": "ann_model"}, {"score": 0.0025458479274370832, "phrase": "seven_input_parameters"}, {"score": 0.002450864311898833, "phrase": "charpy"}, {"score": 0.0021049977753042253, "phrase": "mechanical_properties"}], "paper_keywords": ["Artificial neural network (ANN)", " Microalloyed steel", " Carbon equivalent", " Mechanical properties", " API X70 steel"], "paper_abstract": "The paper presents some results of the research connected with the development of new approach based on the artificial neural network (ANN) of predicting the ultimate tensile strength of the API X70 steels after thermomechanical treatment. The independent variables in the model are chemical compositions (carbon equivalent), based upon the International Institute of Welding equation (CEIIW), the carbon equivalent, based upon the chemical portion of the Ito-Bessyo carbon equivalent equation (CEPcm), the sum of the niobium, vanadium and titanium concentrations (VTiNb), the sum of the niobium and vanadium concentrations (NbV), the sum of the chromium, molybdenum, nickel and copper concentrations (CrMoNiCu), Charpy impact energy at -10 A degrees C (CVN) and yield strength at 0.005 offset (YS). For purpose of constructing these models, 104 different data were gathered from the experimental results. The data used in the ANN model is arranged in a format of seven input parameters that cover the chemical compositions, yield stress and Charpy impact energy, and output parameter which is ultimate tensile strength. In this model, the training, validation and testing results in the ANN have shown strong potential for prediction of relations between chemical compositions and mechanical properties of API X70 steels.", "paper_title": "Artificial neural networks application to predict the ultimate tensile strength of X70 pipeline steels", "paper_id": "WOS:000326889800050"}