{"auto_keywords": [{"score": 0.04896221231267542, "phrase": "sudoku"}, {"score": 0.00481495049065317, "phrase": "sudoku_puzzles"}, {"score": 0.004739773204474094, "phrase": "cryptographic_and_physical_zero-knowledge_proof_schemes"}, {"score": 0.0041625173012740544, "phrase": "sudoku_puzzle"}, {"score": 0.0030374213037172803, "phrase": "cryptographic_protocol"}, {"score": 0.002966438503447793, "phrase": "usual_model"}, {"score": 0.002897109710213723, "phrase": "cryptography_literature"}, {"score": 0.0027200305495826797, "phrase": "computational_hardness"}, {"score": 0.0026774738852854427, "phrase": "physical_protocol"}, {"score": 0.002573965014439041, "phrase": "common_objects"}, {"score": 0.0023976048394496446, "phrase": "scratch-off_cards"}, {"score": 0.002242127152093798, "phrase": "cryptographic_protocols"}, {"score": 0.0021049977753042253, "phrase": "physical_protocols"}], "paper_keywords": ["Cryptography", " Zero-knowledge proofs", " Puzzles"], "paper_abstract": "We consider cryptographic and physical zero-knowledge proof schemes for Sudoku, a popular combinatorial puzzle. We discuss methods that allow one party, the prover, to convince another party, the verifier, that the prover has solved a Sudoku puzzle, without revealing the solution to the verifier. The question of interest is how a prover can show: (i) that there is a solution to the given puzzle, and (ii) that he knows the solution, while not giving away any information about the solution to the verifier. In this paper we consider several protocols that achieve these goals. Broadly speaking, the protocols are either cryptographic or physical. By a cryptographic protocol we mean one in the usual model found in the foundations of cryptography literature. In this model, two machines exchange messages, and the security of the protocol relies on computational hardness. By a physical protocol we mean one that is implementable by humans using common objects, and preferably without the aid of computers. In particular, our physical protocols utilize items such as scratch-off cards, similar to those used in lotteries, or even just simple playing cards. The cryptographic protocols are direct and efficient, and do not involve a reduction to other problems. The physical protocols are meant to be understood by \"lay-people\" and implementable without the use of computers.", "paper_title": "Cryptographic and Physical Zero-Knowledge Proof Systems for Solutions of Sudoku Puzzles", "paper_id": "WOS:000263099400009"}