{"auto_keywords": [{"score": 0.038107877365654706, "phrase": "ir-based_trace_recovery"}, {"score": 0.015719716506582538, "phrase": "systematic_mapping"}, {"score": 0.004662427600500598, "phrase": "software_traceability"}, {"score": 0.004563427013973105, "phrase": "large-scale_software_development"}, {"score": 0.004466519142879166, "phrase": "large_amounts"}, {"score": 0.004143196873246147, "phrase": "trace_links"}, {"score": 0.0035457302646174148, "phrase": "particular_focus"}, {"score": 0.0035078427258024613, "phrase": "previous_evaluations"}, {"score": 0.0031335830806256777, "phrase": "algebraic_ir_models"}, {"score": 0.002953711377604328, "phrase": "ir-based_trace_recovery_tools"}, {"score": 0.0027102997281261733, "phrase": "candidate_trace_links"}, {"score": 0.0025137856138000014, "phrase": "industrial_case_studies"}, {"score": 0.002407941567598653, "phrase": "overall_quality"}, {"score": 0.002174041708084857, "phrase": "ir_terminology"}], "paper_keywords": ["Traceability", " Information retrieval", " Software artifacts", " Systematic mapping study"], "paper_abstract": "Engineers in large-scale software development have to manage large amounts of information, spread across many artifacts. Several researchers have proposed expressing retrieval of trace links among artifacts, i.e. trace recovery, as an Information Retrieval (IR) problem. The objective of this study is to produce a map of work on IR-based trace recovery, with a particular focus on previous evaluations and strength of evidence. We conducted a systematic mapping of IR-based trace recovery. Of the 79 publications classified, a majority applied algebraic IR models. While a set of studies on students indicate that IR-based trace recovery tools support certain work tasks, most previous studies do not go beyond reporting precision and recall of candidate trace links from evaluations using datasets containing less than 500 artifacts. Our review identified a need of industrial case studies. Furthermore, we conclude that the overall quality of reporting should be improved regarding both context and tool details, measures reported, and use of IR terminology. Finally, based on our empirical findings, we present suggestions on how to advance research on IR-based trace recovery.", "paper_title": "Recovering from a decade: a systematic mapping of information retrieval approaches to software traceability", "paper_id": "WOS:000343910700002"}