{"auto_keywords": [{"score": 0.01043477444380794, "phrase": "cover_media"}, {"score": 0.00481495049065317, "phrase": "secret_message"}, {"score": 0.004299621153829837, "phrase": "hidden_communication_purposes"}, {"score": 0.0037745459666402915, "phrase": "new_steganography_method"}, {"score": 0.0037320255482878365, "phrase": "speech_signals"}, {"score": 0.0035869274480340727, "phrase": "silence_intervals"}, {"score": 0.0031665087019813244, "phrase": "main_feature"}, {"score": 0.002843180211561427, "phrase": "speech_stream"}, {"score": 0.0026262033625248445, "phrase": "hiding_capacity"}, {"score": 0.002495521662819317, "phrase": "listening_tests"}, {"score": 0.0024120247307686084, "phrase": "speech_quality"}, {"score": 0.002253299769886694, "phrase": "chaotic_features"}, {"score": 0.0021049977753042253, "phrase": "chaotic-based_steganalysis_methods"}], "paper_keywords": [""], "paper_abstract": "Embedding a secret message into a cover media without attracting any attention, known as steganography, is one of the methods used for hidden communication purposes. One of the cover media that can be used for steganography is speech. In this study, the authors propose a new steganography method in speech signals. In this method, the silence intervals of speech are found and the length (number of samples) of these intervals is changed to hide information. The main feature of our method is robustness to MPEG-1 layer III (MP3) compression. This method can hide information in a speech stream with very low processing time which makes it a real-time steganography method. The hiding capacity of our method is comparable with other MP3 resistance methods and the listening tests show that the degradation in speech quality is not annoying. Additionally, the effect of our method on chaotic features is negligible, so it is difficult to detect our method with chaotic-based steganalysis methods.", "paper_title": "Real-time and MPEG-1 layer III compression resistant steganography in speech", "paper_id": "WOS:000295121800001"}