{"auto_keywords": [{"score": 0.03611386090532676, "phrase": "abstract_specification"}, {"score": 0.0334685934695294, "phrase": "concurrent_indexes"}, {"score": 0.00481495049065317, "phrase": "complex_concurrent_indexes"}, {"score": 0.0046176782475198085, "phrase": "associative_arrays"}, {"score": 0.004291617358806677, "phrase": "file_systems"}, {"score": 0.004246947739596565, "phrase": "dynamic_languages"}, {"score": 0.004137288854115515, "phrase": "sequential_index"}, {"score": 0.0040094142308666975, "phrase": "partial_function"}, {"score": 0.002867771524071872, "phrase": "specific_underlying_implementations"}, {"score": 0.002651015392318126, "phrase": "standard_implementations"}, {"score": 0.0024634797027967203, "phrase": "linked_lists"}, {"score": 0.0024377918036784336, "phrase": "hash_tables"}, {"score": 0.002127186380459509, "phrase": "client's_view"}], "paper_keywords": ["Algorithms", " Theory", " Verification", " Concurrency", " Indexes", " B-Trees", " Separation Logic"], "paper_abstract": "Indexes are ubiquitous. Examples include associative arrays, dictionaries, maps and hashes used in applications such as databases, file systems and dynamic languages. Abstractly, a sequential index can be viewed as a partial function from keys to values. Values can be queried by their keys, and the index can be mutated by adding or removing mappings. Whilst appealingly simple, this abstract specification is insufficient for reasoning about indexes accessed concurrently. We present an abstract specification for concurrent indexes. We verify several representative concurrent client applications using our specification, demonstrating that clients can reason abstractly without having to consider specific underlying implementations. Our specification would, however, mean nothing if it were not satisfied by standard implementations of concurrent indexes. We verify that our specification is satisfied by algorithms based on linked lists, hash tables and B(Link) trees. The complexity of these algorithms, in particular the B(Link) tree algorithm, can be completabely hidden from the client's view by our abstract specification.", "paper_title": "A Simple Abstraction for Complex Concurrent Indexes", "paper_id": "WOS:000298294500050"}