{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "co-creation_process"}, {"score": 0.011895919025337614, "phrase": "existing_value"}, {"score": 0.004675930527604869, "phrase": "pro-active_strategy"}, {"score": 0.004461761855323898, "phrase": "co-opting_consumer_competences"}, {"score": 0.003212663446866794, "phrase": "increased_success"}, {"score": 0.0030653094605910727, "phrase": "unified_model"}, {"score": 0.002924694271730544, "phrase": "supplier-consumer_involvement"}, {"score": 0.002646880721119838, "phrase": "co-creation_techniques"}, {"score": 0.002600661525224505, "phrase": "step-by-step_approach"}, {"score": 0.002381365139274329, "phrase": "semiconductor_company"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Co-creation", " Value", " Collaborative design", " User-centred design", " User innovation"], "paper_abstract": "Co-creation is a pro-active strategy for enabling firms to create value through co-opting consumer competences. Several studies have conceptualised factors for characterizing the co-creation process. A few propose methodologies for co-creation. However, only a handful have so far analysed co-creation in a manner that emphasises the role of existing value or formalised the co-creation process with a view to adding rigour to research/practice and providing insights into activities - leading to increased success of co-creation. This article proposes a unified model for co-creation that integrates functions for strategising supplier-consumer involvement based on existing value-in-exchange and value-in-use and for selecting co-creation techniques. A step-by-step approach to using the unified model is then presented and applied through two collaborative projects within a semiconductor company. The article concludes by discussing the implications of the model for research and practice. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A unified model of the co-creation process", "paper_id": "WOS:000333778000030"}