{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smart_classroom_system"}, {"score": 0.004270347498153512, "phrase": "current_level"}, {"score": 0.0038935506745975835, "phrase": "training_dataset"}, {"score": 0.0037179518766150476, "phrase": "matlab"}, {"score": 0.0033274664434575136, "phrase": "students'_motion"}, {"score": 0.003118942369691329, "phrase": "system_performance"}, {"score": 0.0030196181347744372, "phrase": "total_average_accuracy"}, {"score": 0.00274017282519193, "phrase": "real-time_annotator"}, {"score": 0.0026163210719740847, "phrase": "system_output"}, {"score": 0.0025922289692173997, "phrase": "live_lectures"}, {"score": 0.0025565050791036973, "phrase": "average_accuracy"}, {"score": 0.002225196379204285, "phrase": "novel_approach"}, {"score": 0.0021049977753042253, "phrase": "classroom_environment"}], "paper_keywords": ["Ambient intelligence", " classification", " signal processing", " pattern recognition", " smart classroom", " pervasive computing"], "paper_abstract": "In this paper, a smart classroom system that enables a lecturer to monitor the current level of interest of the audience is presented. The system is based on the Adaboost M1 machine learning algorithm using a training dataset collected from 20 lectures. The system is implemented in Matlab and is capable of recognizing patterns from the sound (i.e. spectral entropy and formant frequency), images (i.e. descriptors of students' motion) and a 3-axis accelerometer (i.e. lecturers' motion descriptors). A system performance is evaluated by 10-fold cross validation. The total average accuracy during the simulation was 92.2%. After the simulation, the system was implemented and its performance evaluated by comparing a real-time annotator (i.e. the students' feedback) with the system output during live lectures. The average accuracy of the system evaluated for three different groups of students was 81.9%; indicating that there is still room for improvement, but that it can be the basis of a novel approach for detecting the level of interest a lecture creates in a classroom environment.", "paper_title": "Smart classroom system for detecting level of interest a lecture creates in a classroom", "paper_id": "WOS:000352647600011"}