{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "publicly_available_human_protein_interaction_databases"}, {"score": 0.004180234323211199, "phrase": "cell_type-specific_differences"}, {"score": 0.003980531478122155, "phrase": "six_interaction_databases"}, {"score": 0.003916098498242888, "phrase": "tissue-specific_gene_expression_information"}, {"score": 0.003728966994353039, "phrase": "scientific_literature"}, {"score": 0.003648683020392928, "phrase": "good_quality_interactions"}, {"score": 0.00349324530379071, "phrase": "evaluated_databases"}, {"score": 0.0033810134162565843, "phrase": "node_connectivity"}, {"score": 0.0030654278282822027, "phrase": "interaction_partners"}, {"score": 0.002918826667294298, "phrase": "tissue-specific_expression_information"}, {"score": 0.002855934865505357, "phrase": "interaction_landscape"}, {"score": 0.0026033756286033285, "phrase": "low_confidence_scores"}, {"score": 0.0025334249463305875, "phrase": "interaction_databases"}, {"score": 0.0025059724686541263, "phrase": "valuable_research_tools"}, {"score": 0.0024386325347607674, "phrase": "different_predictions"}, {"score": 0.0022228943786652914, "phrase": "organ-and_cell_type-specific_gene_expression"}], "paper_keywords": [""], "paper_abstract": "Motivation: Protein-protein interaction (PPI) databases are widely used tools to study cellular pathways and networks; however, there are several databases available that still do not account for cell type-specific differences. Here, we evaluated the characteristics of six interaction databases, incorporated tissue-specific gene expression information and finally, investigated if the most popular proteins of scientific literature are involved in good quality interactions. Results: We found that the evaluated databases are comparable in terms of node connectivity (i.e. proteins with few interaction partners also have few interaction partners in other databases), but may differ in the identity of interaction partners. We also observed that the incorporation of tissue-specific expression information significantly altered the interaction landscape and finally, we demonstrated that many of the most intensively studied proteins are engaged in interactions associated with low confidence scores. In summary, interaction databases are valuable research tools but may lead to different predictions on interactions or pathways. The accuracy of predictions can be improved by incorporating datasets on organ-and cell type-specific gene expression, and by obtaining additional interaction evidence for the most 'popular' proteins.", "paper_title": "Tissue-specific subnetworks and characteristics of publicly available human protein interaction databases", "paper_id": "WOS:000294067300013"}