{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "satisfactory_conversion"}, {"score": 0.004707913053935566, "phrase": "agent-based_information_systems"}, {"score": 0.0043029342321223825, "phrase": "information_systems"}, {"score": 0.0038668462001710314, "phrase": "semantic_point"}, {"score": 0.00378080526397273, "phrase": "real_communication"}, {"score": 0.0033218213825698417, "phrase": "software_agents"}, {"score": 0.003175556211659149, "phrase": "semantic_communication"}, {"score": 0.002984867789900281, "phrase": "main_components"}, {"score": 0.002651960559564796, "phrase": "communication_conversion"}, {"score": 0.0025928815987676535, "phrase": "event_calculus_interpretation"}, {"score": 0.0022906498741695094, "phrase": "motivating_example"}, {"score": 0.0021773853011112882, "phrase": "whole_picture"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interoperability", " Ontology", " Event calculus", " Agent communication"], "paper_abstract": "Over the last years, there has been a change of perspective concerning the management of information systems, since they are no longer isolated and need to communicate with others. However, from a semantic point of view, real communication is difficult to achieve due to the heterogeneity of the systems. We present a proposal which, considering information systems are represented by software agents, provides a framework that favors a semantic communication among them, overcoming the heterogeneity of their agent communication languages. The main components of the framework are a suite of ontologies - conceptualizing communication acts - that will be used for generating the communication conversion, and an Event Calculus interpretation of the communications, which will be used for formalizing the notion of a satisfactory conversion. Moreover, we present a motivating example in order to complete the explanation of the whole picture. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Towards a satisfactory conversion of messages among agent-based information systems", "paper_id": "WOS:000315616500010"}