{"auto_keywords": [{"score": 0.048268778929004275, "phrase": "cold_chain_system"}, {"score": 0.015719716506582538, "phrase": "real-time_localization"}, {"score": 0.004476963405985556, "phrase": "quality_requirements"}, {"score": 0.004326188427877999, "phrase": "well-being_culture"}, {"score": 0.004234532601573088, "phrase": "safe_cold_chain"}, {"score": 0.003988055287053139, "phrase": "food_poisoning_incidents"}, {"score": 0.0038868464660354626, "phrase": "important_issues"}, {"score": 0.0034179225740833055, "phrase": "managing_foods"}, {"score": 0.003288567185099276, "phrase": "existing_cold_chain_system"}, {"score": 0.0031640918630415566, "phrase": "ubiquitous_sensor_networks"}, {"score": 0.003057421171112342, "phrase": "cdma"}, {"score": 0.0028916124463906983, "phrase": "particular_area"}, {"score": 0.002477837342313456, "phrase": "environmental_measurements"}, {"score": 0.0024566655761509276, "phrase": "cellular_phone"}, {"score": 0.0024356742694508662, "phrase": "smart_phone"}, {"score": 0.0021049977753042253, "phrase": "usn_technologies"}], "paper_keywords": [""], "paper_abstract": "As consumers increase the level of quality requirements for foods due to the spread of well-being culture, the demands for safe cold chain have been continuously increased. However, as we can see from the food poisoning incidents that have recently occurred, important issues are how to keep the items (foods) and manage them. Although many people are aware that these issues are important, development and investment for keeping and managing foods are not enough at present. In the existing cold chain system, it is seen that the technologies of ubiquitous sensor networks (USNs), GPS, and CDMA have been used. However, this is only applied to a particular area, and the refrigeration/freezing level is the same as the existing one. In this paper, in order to increase the utilization of the cold chain system, we use both the commercial technologies of sensors and ZigBee for environmental measurements and cellular phone or smart phone with GPS for real-time localization and date transmissions. It is expected that our implementation system that is instantly ready to use leads to the expansion of cold chain system to various fields and the development of USN technologies.", "paper_title": "Research on Real-Time Localization and Environmental Monitoring Using Sensors and ZigBee for Cold Chain System", "paper_id": "WOS:000322232800001"}