{"auto_keywords": [{"score": 0.028032019313733603, "phrase": "predicted_demand"}, {"score": 0.00481495049065317, "phrase": "scheduling_problem"}, {"score": 0.004758053266234474, "phrase": "uncertain_demands."}, {"score": 0.004483450050677258, "phrase": "flexible_job_shop_scheduling_problem"}, {"score": 0.004326321719714357, "phrase": "fjsp"}, {"score": 0.0038411109150557504, "phrase": "genetic_algorithms"}, {"score": 0.003118838635447237, "phrase": "known_characteristics"}, {"score": 0.0028865314258560214, "phrase": "uncertain_jobs"}, {"score": 0.0028354207806133153, "phrase": "actual_demand"}, {"score": 0.002719644855867468, "phrase": "genetic_algorithm"}, {"score": 0.0025020469669826497, "phrase": "different_scheduling_solutions"}, {"score": 0.002142970278347126, "phrase": "real_values"}], "paper_keywords": ["flexible job shop scheduling", " insertion", " makespan", " predicted demands", " lower bounds"], "paper_abstract": "This paper proposes various lower bounds to the makespan of the flexible job shop scheduling problem (FJSP). The FJSP is known in the literature as one of the most difficult combinatorial optimisation problems (NP-hard). We will use genetic algorithms for the optimisation of this type of problems. The list of the demands is divided in two sets: the actual demand, which is considered as certain (a list of jobs with known characteristics), and the predicted demand, which is a list of uncertain jobs. The actual demand is scheduled in priority by the genetic algorithm. Then, the predicted demand is inserted using various methods in order to generate different scheduling solutions. Two lower bounds are given for the makespan before and after the insertion of the predicted demand. The performance of solutions is evaluated by comparing the real values obtained on many static and dynamic scheduling examples with the corresponding lower bounds.", "paper_title": "LOWER BOUNDS FOR THE SCHEDULING PROBLEM WITH UNCERTAIN DEMANDS", "paper_id": "WOS:000208555300011"}