{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "group_recommender_systems"}, {"score": 0.004737579882204798, "phrase": "key_issue"}, {"score": 0.004686688155058031, "phrase": "group_recommendation"}, {"score": 0.004537254814246843, "phrase": "individual_preferences"}, {"score": 0.004488505301335364, "phrase": "different_users"}, {"score": 0.0037150687722055727, "phrase": "preference_models"}, {"score": 0.003675120438902734, "phrase": "individual_users"}, {"score": 0.0034817084307034955, "phrase": "whole_group"}, {"score": 0.003352388337911934, "phrase": "good_results"}, {"score": 0.003057910095857785, "phrase": "domain-independent_grs"}, {"score": 0.0028502479839354637, "phrase": "group_preference_model"}, {"score": 0.0021745003291048356, "phrase": "final_recommendations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Group recommender systems", " Group profile", " Preference elicitation"], "paper_abstract": "A key issue in group recommendation is how to combine the individual preferences of different users that form a group and elicit a profile that accurately reflects the tastes of all members in the group. Most Group Recommender Systems (GRSs) make use of some sort of method for aggregating the preference models of individual users to elicit a recommendation that is satisfactory for the whole group. In general, most GRSs offer good results, but each of them have only been tested in one application domain. This paper describes a domain-independent GRS that has been used in two different application domains. In order to create the group preference model, we select two techniques that are widely used in other GRSs and we compare them with two novel techniques. Our aim is to come up with a model that weighs the preferences of all the individuals to the same extent in such a way that no member in the group is particularly satisfied or dissatisfied with the final recommendations. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Preference elicitation techniques for group recommender systems", "paper_id": "WOS:000300201800010"}