{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "selfish_behaviors"}, {"score": 0.00470325458481566, "phrase": "hybrid_client-server"}, {"score": 0.0045726187330434025, "phrase": "peer_caching_systems"}, {"score": 0.003789395499639015, "phrase": "search_process"}, {"score": 0.0034494494982242187, "phrase": "peer_population_size"}, {"score": 0.003369322866499541, "phrase": "selfish_peers"}, {"score": 0.0030239842475439814, "phrase": "query_requests"}, {"score": 0.002726740692380339, "phrase": "non-forwarding_behaviors"}, {"score": 0.0026014425686078993, "phrase": "high_server_load"}, {"score": 0.002493592357827492, "phrase": "non-resolving_selfish_peers"}, {"score": 0.0023566987138026285, "phrase": "incentive_mechanism"}, {"score": 0.0023346234464901978, "phrase": "content_sharing"}, {"score": 0.002280333649167796, "phrase": "stark_contrast"}, {"score": 0.0022273034991008326, "phrase": "incentivizing_peers"}, {"score": 0.0021349310877334378, "phrase": "key_factor"}, {"score": 0.0021049977753042253, "phrase": "system's_scalability"}], "paper_keywords": ["Hybrid", " incentive mechanism", " peer-to-peer", " scalability", " selfish behaviors"], "paper_abstract": "This paper considers a hybrid peer-to-peer (p2p) system, a dynamic distributed caching system with an authoritative server dispensing contents only if the contents fail to be found by searching an unstructured p2p system. We study the case when some peers may not be fully cooperative in the search process and examine the impact of various noncooperative behaviors in the aspect of scalability, more specifically average server load and average peer load as the peer population size increases. We categorize selfish peers into three classes: impatient peers that directly query the server without searching the p2p system, non-forwarders that refuse to forward query requests, and non-resolvers that refuse to share contents. It is shown that in the hybrid p2p system, impatient and/or non-forwarding behaviors prevent the system from scaling well because of the high server load, while the system scales well under the non-resolving selfish peers. Our study implies that the hybrid p2p system does not mandate an incentive mechanism for content sharing, which is in stark contrast to unstructured p2p systems, where incentivizing peers to share contents is known to be a key factor for the system's scalability.", "paper_title": "Impacts of Selfish Behaviors on the Scalability of Hybrid Client-Server and Peer-to-Peer Caching Systems", "paper_id": "WOS:000367100900010"}