{"auto_keywords": [{"score": 0.010421831388043154, "phrase": "online_communities"}, {"score": 0.008282303097261887, "phrase": "ocs"}, {"score": 0.006691012779127917, "phrase": "user_participation"}, {"score": 0.005908680519831897, "phrase": "oc_operators"}, {"score": 0.00542735540107478, "phrase": "users'_trust_perceptions"}, {"score": 0.00478579024367007, "phrase": "influencing_trust"}, {"score": 0.004544919390397046, "phrase": "trusting_atmosphere"}, {"score": 0.004435782384431224, "phrase": "different_information_technology"}, {"score": 0.0043161190928529755, "phrase": "secure_and_high-quality_environment"}, {"score": 0.0042252744467257885, "phrase": "personal_information"}, {"score": 0.004148924650733264, "phrase": "users'_perspective"}, {"score": 0.0039280214778273925, "phrase": "right_levers"}, {"score": 0.0038923605771735838, "phrase": "previous_research"}, {"score": 0.003685067218455088, "phrase": "comprehensive_perspective"}, {"score": 0.003563841266960747, "phrase": "operators'_efforts"}, {"score": 0.0034049123167891955, "phrase": "technology-trust-participation_research_model"}, {"score": 0.0032431667821391044, "phrase": "it-based_signals"}, {"score": 0.0031269043024513567, "phrase": "comprehensive_quantitative_research_study"}, {"score": 0.0030424424705823455, "phrase": "content_analysis"}, {"score": 0.002969276778056666, "phrase": "five_clusters"}, {"score": 0.002669259222649505, "phrase": "specific_it_features"}, {"score": 0.002466139325703204, "phrase": "different_theoretical_paths"}, {"score": 0.0023417427763424916, "phrase": "perceptual_and_objective_data"}, {"score": 0.0022371907579775796, "phrase": "perceived_and_actual_significance"}, {"score": 0.0021049977753042253, "phrase": "users'_experiences"}], "paper_keywords": ["Online communities", " participation", " privacy", " quality-assured content", " security", " signaling theory", " transparency", " trust", " usability"], "paper_abstract": "Operators of online communities (OCs) continuously try to create a trusting atmosphere and encourage user participation in their OC by implementing different information technology (IT) features that should signal a secure and high-quality environment for the exchange of content and personal information. However, without including users' perspective on which IT features actually affect trust and participation, uncertainty remains about whether OC operators are pulling the right levers. Although previous research has examined the effects of IT features on trust and participation in OCs, the field lacks a comprehensive perspective that compares users' trust perceptions and participation behavior induced by IT features with operators' efforts to provide these IT features in their OC. Drawing on signaling theory, we develop a technology-trust-participation research model that captures a dual perspective on how the provision of IT features, conceived of as IT-based signals or cues, affects users' trust perceptions and participation behavior. Employing a comprehensive quantitative research study, including an online-survey of 364 OC members and a content analysis of 80 general interest OCs, the authors show that five clusters of IT features (usability, transparency, quality-assured content, security, and privacy) vary in their impact on trust and participation, providing insights into their relative effectiveness. We found that although specific IT features are strong in building trust and participation, they are not sufficiently implemented in OCs. The results of this study advance our understanding about the different theoretical paths by which IT feature signals influence user participation and thus serve to mitigate uncertainty in online communities. By juxtaposing perceptual and objective data of users and OC operators, we are also able to identify various divergences between the perceived and actual significance of IT Features' influence on trust and participation. Our findings also provide operators with guidelines that support them to effectively shape users' experiences in OCs.", "paper_title": "The Signaling Role of IT Features in Influencing Trust and Participation in Online Communities", "paper_id": "WOS:000292942400002"}