{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_shopping"}, {"score": 0.0426592730356598, "phrase": "previous_use"}, {"score": 0.03818047705679454, "phrase": "socioeconomic_variables"}, {"score": 0.004144510906908392, "phrase": "technology_acceptance_model"}, {"score": 0.004002426645789667, "phrase": "perceived_self-efficacy"}, {"score": 0.0037326500020622715, "phrase": "causal_and_multi-sample_analyses"}, {"score": 0.0033265580369717996, "phrase": "experienced_e-shopper"}, {"score": 0.0031239353051539347, "phrase": "experienced_e-shoppers"}, {"score": 0.002542174767860791, "phrase": "initial_online_purchase"}, {"score": 0.0024721021985994115, "phrase": "existing_studies"}, {"score": 0.002412371116984224, "phrase": "current_development"}, {"score": 0.002387214876538434, "phrase": "online_environment"}, {"score": 0.002329530057661417, "phrase": "new_kind"}, {"score": 0.0021875036343988806, "phrase": "research_field"}, {"score": 0.0021049977753042253, "phrase": "socioeconomic_characteristics"}], "paper_keywords": ["Electronic commerce", " Internet shopping", " Age groups", " Gender", " Income", " Spain"], "paper_abstract": "Purpose - The objective of this paper is to analyse whether individuals' socioeconomic characteristics - age, gender and income - influence their online shopping behaviour. The individuals analysed are experienced e-shoppers i.e. individuals who often make purchases on the internet. Design/methodology/approach - The technology acceptance model was broadened to include previous use of the internet and perceived self-efficacy. The perceptions and behaviour of e-shoppers are based on their own experiences. The information obtained has been tested using causal and multi-sample analyses. Findings - The results show that socioeconomic variables moderate neither the influence of previous use of the internet nor the perceptions of e-commerce; in short, they do not condition the behaviour of the experienced e-shopper. Practical implications - The results obtained help to determine that once individuals attain the status of experienced e-shoppers their behaviour is similar, independently of their socioeconomic characteristics. The internet has become a marketplace suitable for all ages and incomes and both genders, and thus the prejudices linked to the advisability of selling certain products should be revised. Originality/value - Previous research related to the socioeconomic variables affecting e-commerce has been aimed at forecasting who is likely to make an initial online purchase. In contrast to the majority of existing studies, it is considered that the current development of the online environment should lead to analysis of a new kind of e-shopper (experienced purchaser), whose behaviour differs from that studied at the outset of this research field. The experience acquired with online shopping nullifies the importance of socioeconomic characteristics.", "paper_title": "Age, gender and income: do they really moderate online shopping behaviour?", "paper_id": "WOS:000288877000007"}