{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data-driven_non-linear_methods"}, {"score": 0.044446599157377184, "phrase": "climate_regimes"}, {"score": 0.033413566842277836, "phrase": "model_performance"}, {"score": 0.004211594861013822, "phrase": "differing_hydrological_characteristics"}, {"score": 0.00398452530840582, "phrase": "wavelet_transforms"}, {"score": 0.0038935506745975835, "phrase": "lead_times"}, {"score": 0.003281663000504564, "phrase": "mediterranean"}, {"score": 0.0032066653632708965, "phrase": "hemiboreal"}, {"score": 0.002950608985750058, "phrase": "fractional_standard_error"}, {"score": 0.0028566304730051205, "phrase": "nash-sutcliffe"}, {"score": 0.002714943351733626, "phrase": "false_alarm_rate"}, {"score": 0.0026899455459275575, "phrase": "svr_based_models"}, {"score": 0.0022772782536385717, "phrase": "higher_persistence"}, {"score": 0.0022563011263787847, "phrase": "slower_hydrological_processes"}, {"score": 0.0021245712108461227, "phrase": "reliable_forecasting"}, {"score": 0.0021049977753042253, "phrase": "daily_and_multi-day_lead_times"}], "paper_keywords": ["artificial neural networks", " climate regime", " forecasting", " streamflow", " support vector regression", " times series analysis"], "paper_abstract": "Considering the popularity of using data-driven non-linear methods for forecasting streamflow, there has been no exploration of how well such models perform in climate regimes with differing hydrological characteristics, nor has the performance of these models, coupled with wavelet transforms, been compared for lead times of less than 1 month. This study compares the use of four different models, namely artificial neural networks (ANNs), support vector regression (SVR), wavelet-ANN, and wavelet-SVR in a Mediterranean, Oceanic, and Hemiboreal watershed. Model performance was tested for 1, 2 and 3 day forecasting lead times, measured by fractional standard error, the coefficient of determination, Nash-Sutcliffe model efficiency, multiplicative bias, probability of detection and false alarm rate. SVR based models performed best overall, but no one model outperformed the others in more than one watershed, suggesting that some models may be more suitable for certain types of data. Overall model performance varied greatly between climate regimes, suggesting that higher persistence and slower hydrological processes (i.e. snowmelt, glacial runoff, and subsurface flow) support reliable forecasting using daily and multi-day lead times.", "paper_title": "Multi-step streamflow forecasting using data-driven non-linear methods in contrasting climate regimes", "paper_id": "WOS:000336401200009"}