{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "six_sigma_projects"}, {"score": 0.048951593908953754, "phrase": "semiconductor_foundry"}, {"score": 0.04821371094523721, "phrase": "six_sigma"}, {"score": 0.004206548500039536, "phrase": "quality_management"}, {"score": 0.004123781267600542, "phrase": "well-structured_methodology"}, {"score": 0.004010624853427534, "phrase": "expected_goal"}, {"score": 0.003978866233891427, "phrase": "continuous_project_improvement"}, {"score": 0.003674738405118697, "phrase": "feasible_projects"}, {"score": 0.003575467017219769, "phrase": "sigma"}, {"score": 0.003503497128638099, "phrase": "finite_resources"}, {"score": 0.003353521531649663, "phrase": "novel_approach"}, {"score": 0.003313741359811683, "phrase": "critical_six_sigma_projects"}, {"score": 0.0027594936602962075, "phrase": "hierarchical_failure_mode_effects_analysis"}, {"score": 0.002439143581855858, "phrase": "project_benefits"}, {"score": 0.0023532890136269986, "phrase": "green_belt"}, {"score": 0.0023346234464901978, "phrase": "black_belt"}, {"score": 0.0022524395393089544, "phrase": "empirical_case_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["six sigma", " project selection", " six sigma projects", " FMEA", " AHP"], "paper_abstract": "Nowadays, Six Sigma has been widely adopted in a variety of industries in the world and it has become one of the most important subjects of debate in quality management. Six Sigma is a well-structured methodology that can help a company achieve expected goal through continuous project improvement. Some challenges, however, have emerged with the execution of the Six Sigma. For examples, how are feasible projects generated? How are critical Six Sigma projects selected given the finite resources of the organization? This study aims to develop a novel approach to create critical Six Sigma projects and identify the priority of these projects. Firstly, the projects are created from two aspects, namely, organization's business strategic policies and voice of customer. Secondly, an analytic hierarchy process (AHP) model is implemented to evaluate the benefits of each project and; a hierarchical failure mode effects analysis (FMEA) is also developed to evaluate the risk of each project; and from which the priority of Six Sigma projects can be determined. Finally, based on the project benefits and risk, projects can be defined as Green Belt, Black Belt, or others types of projects. An empirical case study of semiconductor foundry will be utilized to explore the effectiveness of our proposed approach. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A systematic methodology for the creation of Six Sigma projects: A case study of semiconductor foundry", "paper_id": "WOS:000253521900046"}