{"auto_keywords": [{"score": 0.024501160430422636, "phrase": "syntactic_boundedness"}, {"score": 0.00481495049065317, "phrase": "checking_zenoness"}, {"score": 0.004680851157467745, "phrase": "dense-timed_petri_nets"}, {"score": 0.004550469496119256, "phrase": "petri_nets"}, {"score": 0.004408106853358092, "phrase": "real-valued_clock"}, {"score": 0.0035159043158639633, "phrase": "open_problem"}, {"score": 0.003417859963947459, "phrase": "related_question"}, {"score": 0.0033698643928647726, "phrase": "arbitrarily_fast_computations"}, {"score": 0.0026682872124177233, "phrase": "coverability_problem"}, {"score": 0.0025036399134110822, "phrase": "reachable_markings"}, {"score": 0.002275477757478827, "phrase": "dead_tokens"}, {"score": 0.002211947103318718, "phrase": "semantic_boundedness"}, {"score": 0.0021049977753042253, "phrase": "karp-miller_algorithm"}], "paper_keywords": ["Real-time systems", " Timed Petri nets", " Verification", " Zenoness"], "paper_abstract": "We consider Dense-Timed Petri Nets (TPN), an extension of Petri nets in which each token is equipped with a real-valued clock and where the semantics is lazy (i.e., enabled transitions need not fire; time can pass and disable transitions). We consider the following verification problems for TPNs. (i) Zenoness: whether there exists a zeno-computation from a given marking, i. e., an infinite computation which takes only a finite amount of time. We show decidability of zenoness for TPNs, thus solving an open problem from [dFERA00]. Furthermore, the related question if there exist arbitrarily fast computations from a given marking is also decidable. On the other hand, universal zenoness, i. e., the question if all infinite computations from a given marking are zeno, is undecidable. (ii) Token liveness: whether a token is alive in a marking, i. e., whether there is a computation from the marking which eventually consumes the token. We show decidability of the problem by reducing it to the coverability problem, which is decidable for TPNs. (iii) Boundedness: whether the size of the reachable markings is bounded. We consider two versions of the problem; namely semantic boundedness where only live tokens are taken into consideration in the markings, and syntactic boundedness where also dead tokens are considered. We show undecidability of semantic boundedness, while we prove that syntactic boundedness is decidable through an extension of the Karp-Miller algorithm.", "paper_title": "DENSE-TIMED PETRI NETS: CHECKING ZENONESS, TOKEN LIVENESS AND BOUNDEDNESS", "paper_id": "WOS:000262497000001"}