{"auto_keywords": [{"score": 0.01563373853270319, "phrase": "genetic_algorithms"}, {"score": 0.014921426769410445, "phrase": "message_scheduling"}, {"score": 0.012970882014317795, "phrase": "message_word"}, {"score": 0.004722408916485981, "phrase": "hash_functions"}, {"score": 0.004683292152590589, "phrase": "important_role"}, {"score": 0.004657393640152439, "phrase": "modem_cryptography"}, {"score": 0.004631637679516574, "phrase": "matusiewicz_et_al"}, {"score": 0.004309434349688514, "phrase": "hash_operations"}, {"score": 0.004088184726308455, "phrase": "sha_algorithm"}, {"score": 0.004065563703649516, "phrase": "higher_security_complexity"}, {"score": 0.004031865694174726, "phrase": "fitness_value"}, {"score": 0.004009555045206973, "phrase": "genetic_algorithm"}, {"score": 0.003608266908414448, "phrase": "chabaud"}, {"score": 0.003588294233112022, "phrase": "joux"}, {"score": 0.003470902471718931, "phrase": "wang"}, {"score": 0.003211145390854807, "phrase": "message_blocks"}, {"score": 0.0028260302580927856, "phrase": "new_view"}, {"score": 0.0025217811081981174, "phrase": "message_schedule"}, {"score": 0.0024939073328022507, "phrase": "security_fitness"}, {"score": 0.0024390784088340715, "phrase": "near-optimal_message_schedule_parameter_sets"}, {"score": 0.0022253345930383257, "phrase": "modular-addition-free_hash_function"}, {"score": 0.0021763973978248005, "phrase": "lower_gate_count"}, {"score": 0.002152332983488664, "phrase": "found_message_schedule_parameter_sets"}, {"score": 0.0021285340816566906, "phrase": "good_reference"}, {"score": 0.0021049977753042253, "phrase": "sha_functions"}], "paper_keywords": ["genetic algorithms", " cryptography", " secure hash algorithm", " message scheduling", " optimisation"], "paper_abstract": "One-way hash functions play an important role in modem cryptography. Matusiewicz et al. proved that the message scheduling is essential for the security of SHA-256 by showing that it is possible to find collisions with complexity 2(64) hash operations for a variant without it. In this article, we first proposed the conjecture that message scheduling of SHA algorithm has higher security complexity (or fitness value in Genetic algorithm) if each message word (W-t) involves more message blocks (M-i) in each round. We found some evidence supports the conjecture. Consider the security of SHA-0 and SHA-1. Since Chabaud and Joux shown that SHA-1 is more secure than SHA-0. Further, Wang found collisions in full SHA-0 and SHA-1 hash operations with complexities less than 2(39) and 2(69), respectively. We found it is consistent from the viewpoint of message blocks (terms) involved in each message word. It clearly shown that the number of terms involved in SHA-1 is more than that in SHA-0, taking W-27 as an example, 14 and 6, respectively. Based on the conjecture we proposed a new view of complexity for SHA-256-XOR functions, a variant of SHA-256, by counting the terms involved in each equation, instead of analyzing the probability of finding collisions within SHA-256-XOR hash function. Our experiments shown that the parameter set in each equation of message schedule is crucial to security fitness. We applied genetic algorithms to find the near-optimal message schedule parameter sets that enhance the complexity 4 times for SHA-1 and 1.5 times for SHA-256-XOR, respectively, when compared to original SHA-1 and SHA-256-XOR functions. The analysis would be interesting for designers on the security of modular-addition-free hash function which is good for hardware implementation with lower gate count. And the found message schedule parameter sets would be a good reference for further improvement of SHA functions.", "paper_title": "Finding Near-Optimum Message Scheduling Settings for SHA-256 Variants Using Genetic Algorithms", "paper_id": "WOS:000325302300006"}