{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ignorance_situations_in_multi-person_decision_making._multi-person_decision_making_problems"}, {"score": 0.004348363291608004, "phrase": "precise_or_sufficient_level"}, {"score": 0.003745179888113379, "phrase": "fuzzy_preference_relations"}, {"score": 0.003624361893008392, "phrase": "incomplete_information_situations"}, {"score": 0.003419084516677794, "phrase": "missing_information"}, {"score": 0.003381905288924267, "phrase": "preference_relation"}, {"score": 0.0028493650087584774, "phrase": "particular_alternative"}, {"score": 0.0027775505385261553, "phrase": "total_ignorance"}, {"score": 0.0025447584328314754, "phrase": "individual_preference_relation"}, {"score": 0.0022234280592615756, "phrase": "individual_and_social_strategies"}, {"score": 0.0021049977753042253, "phrase": "experts_preference_relations"}], "paper_keywords": ["Ignorance", " decision making", " fuzzy preference relations", " consistency", " consensus"], "paper_abstract": "Multi-person decision making problems involve the preferences of some experts about a set of alternatives in order to find the best one. However, sometimes experts might not possess a precise or sufficient level of knowledge of part of the problem and as a consequence that expert might not give all the information that is required. Indeed, this may be the case when the number of alternatives is high and experts are using fuzzy preference relations to represent their preferences. In the literature, incomplete information situations have been studied, and as a result, procedures that are able to compute the missing information of a preference relation have been designed. However, these approaches usually need at least a piece of information about every alternative in the problem in order to be successful in estimating all the missing preference values. In this paper, we address situations in which an expert does not provide any information about a particular alternative, which we call situations of total ignorance. We analyze several strategies to deal with these situations. We classify these strategies into: (i) individual strategies that can be applied to each individual preference relation without taking into account any information from the rest of experts and (ii) social strategies, that is, strategies that make use of the information available from the group of experts. Both individual and social strategies use extra assumptions or knowledge, which could not be directly instantiated in the experts preference relations. We also provide an analysis of the advantages and disadvantages of each one of the strategies presented, and the situations where some of them may be more adequate to be applied than the others.", "paper_title": "INDIVIDUAL AND SOCIAL STRATEGIES TO DEAL WITH IGNORANCE SITUATIONS IN MULTI-PERSON DECISION MAKING", "paper_id": "WOS:000267703000007"}