{"auto_keywords": [{"score": 0.03363896917055259, "phrase": "stable_structure"}, {"score": 0.01380176100861923, "phrase": "communication_patterns"}, {"score": 0.00481495049065317, "phrase": "communication_networks"}, {"score": 0.004778923541463994, "phrase": "open_source_software_projects"}, {"score": 0.004517137548648729, "phrase": "large_variety"}, {"score": 0.004416465443332974, "phrase": "software_engineering_folklore"}, {"score": 0.00396050388346298, "phrase": "formal_organization"}, {"score": 0.003916098498242888, "phrase": "communication_network_structures"}, {"score": 0.0038721890530859578, "phrase": "oss_project"}, {"score": 0.003743381699791, "phrase": "non-cooperative_game-theoretic_model"}, {"score": 0.0036324746826127997, "phrase": "oss_team"}, {"score": 0.0035648266669315943, "phrase": "stable_and_efficient_structures"}, {"score": 0.002920561105784389, "phrase": "group_interest"}, {"score": 0.002688532127821979, "phrase": "efficiency_perspective"}, {"score": 0.002569816610348772, "phrase": "stable_network"}, {"score": 0.0025409639091476363, "phrase": "efficient_one"}, {"score": 0.0024748913336907923, "phrase": "latent_class_model"}, {"score": 0.0024196235355517827, "phrase": "source_forge"}, {"score": 0.002365587018070219, "phrase": "different_types"}, {"score": 0.0021530945641993152, "phrase": "developer_abilities"}, {"score": 0.0021209097150420896, "phrase": "communication_network_formation"}, {"score": 0.0021049977753042253, "phrase": "oss_projects"}], "paper_keywords": ["analytical modeling", " economics of IS", " network formation", " software development"], "paper_abstract": "Over the past few years, open source software (OSS) development has gained a huge popularity and has attracted a large variety of developers. According to software engineering folklore, the architecture and the organization of software depend on the communication patterns of the contributors. Communication patterns among developers influence knowledge sharing among them. Unlike in a formal organization, the communication network structures in an OSS project evolve unrestricted and unplanned. We develop a non-cooperative game-theoretic model to investigate the network formation in an OSS team and to characterize the stable and efficient structures. Developer heterogeneity in the network is incorporated based on their informative value. We find that there may exist several stable structures that are inefficient and there may not always exist a stable structure that is efficient. The tension between the stability and efficiency of structures results from developers acting in their self-interest rather than the group interest. Whenever there is such tension, the stable structure is either underconnected across types or overconnected within type of developers from an efficiency perspective. We further discuss how an administrator can help evolve a stable network into an efficient one. Empirically, we use the latent class model and analyze two real-world OSS projects hosted at Source Forge. For each project, different types of developers and a stable structure are identified, which fits well with the predictions of our model. Overall, our study sheds light on how developer abilities and incentives affect communication network formation in OSS projects.", "paper_title": "Developer Heterogeneity and Formation of Communication Networks in Open Source Software Projects", "paper_id": "WOS:000288635100008"}