{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_context"}, {"score": 0.04888338488077779, "phrase": "afryca"}, {"score": 0.004463096299091981, "phrase": "increasingly_important_role"}, {"score": 0.0043699845927285905, "phrase": "group_decision_making_problems"}, {"score": 0.004016485454498076, "phrase": "consensus_approaches"}, {"score": 0.003465036432323081, "phrase": "existing_approaches"}, {"score": 0.0033641551050434663, "phrase": "reaching_processes"}, {"score": 0.003078740573398959, "phrase": "existing_consensus_models"}, {"score": 0.002889778121878728, "phrase": "main_features"}, {"score": 0.002633355582628613, "phrase": "group_decision"}, {"score": 0.0025674490885184173, "phrase": "different_consensus_models"}, {"score": 0.0024097920845706795, "phrase": "consensus_model"}, {"score": 0.002280990744438186, "phrase": "specific_problem"}, {"score": 0.0022522565004588113, "phrase": "experimental_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Group decision making", " Consensus reaching process", " Consensus model", " Consensus support system", " Consensus measure"], "paper_abstract": "Consensus reaching processes play an increasingly important role in the resolution of group decision making problems: a solution acceptable to all the experts participating in a problem is necessary in many real-life contexts. A large number of consensus approaches have been proposed to support groups in such processes, each one with its own characteristics, such as the methods utilized for the fusion of information regarding the preferences of experts. Given this variety of existing approaches in the literature to support consensus reaching processes, this paper considers two main objectives. Firstly, we propose a taxonomy that provides an overview and categorization of some existing consensus models for group decision making problems defined in a fuzzy context, taking into account the main features of each model. Secondly, the paper presents AFRYCA, a simulation-based analysis framework for the resolution of group decision making problems by means of different consensus models. The framework is aimed at facilitating a study of the performance of each consensus model, as well as determining the most suitable model/s for the resolution of a specific problem. An experimental study is carried out to show the usefulness of the framework. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Consensus under a fuzzy context: Taxonomy, analysis framework AFRYCA and experimental case of study", "paper_id": "WOS:000337863500023"}