{"auto_keywords": [{"score": 0.049596205816074254, "phrase": "sicily"}, {"score": 0.04414155505649602, "phrase": "uneq"}, {"score": 0.03907066801265238, "phrase": "valli_trapanesi"}, {"score": 0.03339126972779516, "phrase": "simca"}, {"score": 0.00481495049065317, "phrase": "italian_oils"}, {"score": 0.00469445816161498, "phrase": "protected_denomination"}, {"score": 0.004135562737140424, "phrase": "pattern_recognition"}, {"score": 0.00409382470158851, "phrase": "italian_extra_virgin_oils"}, {"score": 0.0037555742428544096, "phrase": "monte_etna"}, {"score": 0.0036801209922064817, "phrase": "monti_iblei"}, {"score": 0.003393115177189967, "phrase": "whole_data"}, {"score": 0.0029584874121320165, "phrase": "leave-one-out_cross-validation"}, {"score": 0.002797757576619329, "phrase": "complete_data"}], "paper_keywords": ["olive oil", " protected designation of origin", " class-modeling", " SIMCA", " UNEQ", " supervised pattern recognition"], "paper_abstract": "In this paper, an example of the application of two chemometric class-modeling tools (SIMCA and UNEQ) to the pattern recognition of Italian extra virgin oils from three different Protected Denominations of Origin is reported. In particular, 200 oil samples from three different PDOs of Sicily (Monte Etna, Valli Trapanesi and Monti Iblei; harvests 2002 and 2003) have been considered. The models built using the whole data set (22 chemical and physico-chemical indices were determined on each sample) resulted in 87% (SIMCA) or 77% (UNEQ) predictive ability, as evaluated by leave-one-out cross-validation. Therefore, SIMCA seems to perform better on the complete data set. A further investigation on the subsets from each of the two production years has shown that the 2003 data (mainly from the category Valli Trapanesi) are significantly different from the 2002 ones. Interestingly, when performing class-modeling on each of these two subsets, UNEQ provides better (or at least comparable) results than SIMCA. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Class-modeling techniques in the authentication of Italian oils from Sicily with a Protected Denomination of Origin (PDO)", "paper_id": "WOS:000234969400015"}