{"auto_keywords": [{"score": 0.042864004242999014, "phrase": "cdss"}, {"score": 0.00481495049065317, "phrase": "clinical_rules"}, {"score": 0.0047631192993526465, "phrase": "standalone_pharmacy"}, {"score": 0.004644329185633612, "phrase": "hospitalized_and_nursing_home_patients"}, {"score": 0.004528488165249491, "phrase": "current_standalone_pharmacy_clinical_decision_support_system"}, {"score": 0.0041677440361312604, "phrase": "executed_clinical_rules"}, {"score": 0.003933813742509612, "phrase": "executed_clinical_rule_alerts"}, {"score": 0.0033196177202591843, "phrase": "new_alerts"}, {"score": 0.002643624979574088, "phrase": "reference_limits"}, {"score": 0.002522240133079871, "phrase": "used_system"}, {"score": 0.002486021541116251, "phrase": "alert_criteria"}, {"score": 0.0022143417457627006, "phrase": "different_aspects"}, {"score": 0.002143416464171068, "phrase": "efficient_cdss."}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Clinical decision support systems", " Decision support techniques", " Algorithms", " Efficiency"], "paper_abstract": "Objectives: To improve the current standalone pharmacy clinical decision support system (CDSS) by identifying and quantifying the benefits and limitations of the system. Methods: Alerts and handling of the executed clinical rules were extracted from the CDSS from the period September 2011 to December 2011. The number of executed clinical rule alerts, number of actions on alerts, and the reason why alerts were classified as not relevant were analyzed. The alerts where considered clinically relevant when the pharmacist needed to contact the physician. Results: The 4065 alerts have been separated into: 1137 (28.0%) new alerts, 2797 (68.8%) repeat alerts and 131 (3.2%) double alerts. When the alerts were analyzed, only 3.6% were considered clinically relevant. Reasons why alerts were considered as not to be relevant were: (a) the dosage was correct or already adjusted, (b) the drug was (temporarily) stopped and (c) the monitored laboratory value or drug dosage had already reverted to be within the reference limits. The reasons for no action were linked to three categorical limitations of the used system: 'algorithm alert criteria', 'CDSS optimization', and 'data delivery'. Conclusion: This study highlighted a number of ways in which the CDSS could be improved. These different aspects have been identified as important for developing an efficient CDSS. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Evaluation of clinical rules in a standalone pharmacy based clinical decision support system for hospitalized and nursing home patients", "paper_id": "WOS:000352805000002"}