{"auto_keywords": [{"score": 0.04903392340696014, "phrase": "different_purposes"}, {"score": 0.029390190655120524, "phrase": "collaborative_mode"}, {"score": 0.00481495049065317, "phrase": "playful_interactions"}, {"score": 0.004739630859016419, "phrase": "engaging_applications"}, {"score": 0.004592491583367684, "phrase": "serious_games"}, {"score": 0.004244234872662471, "phrase": "great_reinforcement"}, {"score": 0.0038730779753083787, "phrase": "playful_interaction_system"}, {"score": 0.0036476222647061243, "phrase": "natural_gestures"}, {"score": 0.0033814348757887232, "phrase": "forty_six_children"}, {"score": 0.003144527847739642, "phrase": "historical_periods"}, {"score": 0.002989553951264878, "phrase": "effective_transmitter"}, {"score": 0.002896586744793007, "phrase": "post-knowledge_scores"}, {"score": 0.0028332303659245085, "phrase": "statistically_significant_differences"}, {"score": 0.0026850589169993143, "phrase": "greater_extent"}, {"score": 0.0026597250663309385, "phrase": "individual_mode"}, {"score": 0.0022142194702079866, "phrase": "playful_interaction"}, {"score": 0.0021049977753042253, "phrase": "computer-supported_learning_systems"}], "paper_keywords": ["Playful interactions", " serious games", " collaborative", " autostereoscopy", " Natural User Interfaces"], "paper_abstract": "Playful interactions facilitate the development of engaging applications for different purposes. This aspect is very important for serious games, and especially when these games are for children. Another aspect to consider is the interaction among children, which could be a great reinforcement in learning environments. Children enjoy playing, and they like playing with other children. This relationship could encourage their motivation and their learning outcomes. In this paper, a playful interaction system for learning about a period of history is presented. The interaction of the system was achieved using natural gestures and the visualization was autostereoscopic. A study was carried out to determine whether their learning outcomes were greater playing collaboratively or playing individually. Forty six children from 7 to 10 years old participated in the study. The analysis of the pre-tests and the post-tests indicate that the children increased their knowledge about historical periods after playing with the two modes. Therefore, the game could be used as an effective transmitter of knowledge both collaboratively and individually. When the post-knowledge scores for the two modes were compared, statistically significant differences were found in favor of the collaborative mode. Therefore, the collaborative mode facilitates learning to a greater extent than the individual mode. The rest of the questions indicated that the children had a lot of fun while playing the game; they found the game easy to play; they would recommend the game to their friends; and they scored the game as a mean of 9.57 over 10. Finally, we believe that the combination of playful interaction and autostereoscopy is an option that should be exploited not only for the development of computer-supported learning systems, but also for the development of systems for different purposes.", "paper_title": "Playful interaction for learning collaboratively and individually", "paper_id": "WOS:000336091500005"}