{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "user_interests"}, {"score": 0.049648703742940906, "phrase": "ontology-based_user_models"}, {"score": 0.028276684020075243, "phrase": "conceptual_hierarchy"}, {"score": 0.004459190343665408, "phrase": "conceptual_hierarchies"}, {"score": 0.00439918275666155, "phrase": "domain_ontologies"}, {"score": 0.0040373708328770306, "phrase": "hierarchical_structure"}, {"score": 0.003738847528809348, "phrase": "principal_contributions"}, {"score": 0.0034623203126093833, "phrase": "vertical_propagation"}, {"score": 0.0029289191071848403, "phrase": "specific_applications"}, {"score": 0.0028376361457661415, "phrase": "dynamic_ontology_maintenance"}, {"score": 0.0027741761880779535, "phrase": "user_interest_values"}, {"score": 0.0026157259734105, "phrase": "finer_recommendation_modalities"}, {"score": 0.002522738549524317, "phrase": "cold_start_problem"}, {"score": 0.0024220634963019114, "phrase": "small_number"}, {"score": 0.002400241288973103, "phrase": "initial_concepts"}, {"score": 0.0022733662000757318, "phrase": "field_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["User model", " Ontology", " Conceptual hierarchy", " Propagation of interests"], "paper_abstract": "This work contributes to the development of ontology-based user models, devised as overlays over conceptual hierarchies derived from domain ontologies. We tackle the problem of propagation of user interests in such a conceptual hierarchy. In addition to accounting for the hierarchical structure of the domain and the type and amount of feedback provided by the user, the principal contributions introduced in this work are: (i) horizontal propagation which enables propagation among siblings, in addition to vertical propagation among ancestors and descendants; (ii) anisotropic vertical propagation which permits user interests to be propagated differently upward and downward; (iii) con text-dependance which introduces the possibility to propagate differently according to various contexts for specific applications; (iv) support for dynamic ontology maintenance, i.e. preserving the user interest values when adding or removing a node from the conceptual hierarchy. Our approach supports finer recommendation modalities and contributes to the resolution of the cold start problem, since it allows for propagation from a small number of initial concepts to other related domain concepts by exploiting the conceptual hierarchy of the domain. A field evaluation confirmed the effectiveness of our approach w.r.t. the traditional vertical propagation. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Anisotropic propagation of user interests in ontology-based user models", "paper_id": "WOS:000325041400003"}