{"auto_keywords": [{"score": 0.030147208882915975, "phrase": "voltage_drop"}, {"score": 0.01291404129387297, "phrase": "voltage_drop_constraint"}, {"score": 0.010324665318936773, "phrase": "total_on-chip_decoupling_capacitance_area"}, {"score": 0.008843720710518576, "phrase": "on-chip_capacitance"}, {"score": 0.008428446243419206, "phrase": "proposed_algorithm"}, {"score": 0.00481495049065317, "phrase": "greedy_algorithm"}, {"score": 0.004637478829869904, "phrase": "drop_constraint"}, {"score": 0.004490552331642995, "phrase": "process_technology"}, {"score": 0.004395185177346749, "phrase": "low_voltage_power_supplies"}, {"score": 0.004165497627464024, "phrase": "voltage_margin"}, {"score": 0.0040334640350288, "phrase": "on-chip_decoupling_capacitance_optimization"}, {"score": 0.003701401653850141, "phrase": "on-chip_decoupling_capacitance_area"}, {"score": 0.002985631781749091, "phrase": "network_algorithm"}, {"score": 0.0024339783012484032, "phrase": "greatest_influence"}, {"score": 0.0023694065215394593, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "conventional_algorithm"}], "paper_keywords": ["power supply noise", " power distribution network", " signal integrity", " circuit simulation"], "paper_abstract": "With the progress of process technology in recent years, low voltage power supplies have become quite predominant. With this, the voltage margin has decreased and therefore the on-chip decoupling capacitance optimization that satisfies the voltage drop constraint becomes more important. In addition, the reduction of the on-chip decoupling capacitance area will reduce the chip area and, therefore, manufacturing costs. Hence, we propose an algorithm that satisfies the voltage drop constraint and at the same time, minimizes the total on-chip decoupling capacitance area. The proposed algorithm uses the idea of the network algorithm where the path which has the most influence on voltage drop is found. Voltage drop is improved by adding the on-chip capacitance to the node on the path. The proposed algorithm is efficient and effectively adds the on-chip capacitance to the greatest influence on the voltage drop. Experimental results demonstrate that, with the proposed algorithm, real size power/ground network could be optimized in just a few minutes which are quite practical. Compared with the conventional algorithm, we confirmed that the total on-chip decoupling capacitance area of the power/ground network was reducible by about 40 similar to 50%.", "paper_title": "Greedy Algorithm for the On-Chip Decoupling Capacitance Optimization to Satisfy the Voltage Drop Constraint", "paper_id": "WOS:000298304800002"}