{"auto_keywords": [{"score": 0.02937671093533994, "phrase": "random_forgeries"}, {"score": 0.00481495049065317, "phrase": "writer-independent_off-line_signature_verification"}, {"score": 0.004537525607322823, "phrase": "off-line_signature_verification"}, {"score": 0.004414907432703781, "phrase": "feature_extraction"}, {"score": 0.0037454814403672697, "phrase": "bezier_curves"}, {"score": 0.0035781807623238905, "phrase": "second_important_aspect"}, {"score": 0.0034027387694902287, "phrase": "graphometric_features"}, {"score": 0.003221111762383486, "phrase": "false_acceptance"}, {"score": 0.003105428650735113, "phrase": "standard_genetic_algorithm"}, {"score": 0.0030771609361092164, "phrase": "different_fitness_functions"}, {"score": 0.002539379289856756, "phrase": "simple_and_simulated_forgeries"}, {"score": 0.0023818288346547692, "phrase": "base_classifiers"}, {"score": 0.0022962183207691188, "phrase": "thorough_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Signature verification", " Graphometrics", " Forgeries"], "paper_abstract": "In this work we address two important issues of off-line signature verification. The first one regards feature extraction. We introduce a new graphometric feature set that considers the curvature of the most important segments, perceptually speaking, of the signature. The idea is to simulate the shape of the signature by using Bezier curves and then extract features from these curves. The second important aspect is the use of an ensemble of classifiers based on graphometric features to improve the reliability of the classification, hence reducing the false acceptance. The ensemble was built using a standard genetic algorithm and different fitness functions were assessed to drive the search. Two different scenarios were considered in our experiments. In the former, we assume that only genuine signatures and random forgeries are available to guide the search. In the latter, on the other hand, we assume that simple and simulated forgeries also are available during the optimization of the ensemble. The pool of base classifiers is trained using only genuine signatures and random forgeries. Thorough experiments were conduct on a database composed of 100 writers and the results compare favorably. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Reducing forgeries in writer-independent off-line signature verification through ensemble of classifiers", "paper_id": "WOS:000270261500032"}