{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "one-dimensional_cellular_automata"}, {"score": 0.04844894171082025, "phrase": "spatial_prisoner's_dilemma"}, {"score": 0.004720606036240263, "phrase": "evolutionary_patterns"}, {"score": 0.004582528208024817, "phrase": "prototype_model"}, {"score": 0.003989487818395848, "phrase": "prisoner's_dilemma"}, {"score": 0.003815607281455725, "phrase": "rich_phase_diagram"}, {"score": 0.0033379819706003885, "phrase": "simple_manner"}, {"score": 0.0031453010852936334, "phrase": "lattice_size"}, {"score": 0.003023047748772801, "phrase": "multiple_advantages"}, {"score": 0.0027650234530228897, "phrase": "previously_considered_lattices"}, {"score": 0.002710735995572145, "phrase": "faster_convergence"}, {"score": 0.0026839922027139967, "phrase": "stationary_values"}, {"score": 0.002516457934208144, "phrase": "spatio-temporal_evolution"}, {"score": 0.0023828731731474306, "phrase": "interesting_patterns"}, {"score": 0.0021365562685368767, "phrase": "presented_approach"}, {"score": 0.0021049977753042253, "phrase": "new_paradigm"}], "paper_keywords": ["Prisoner's Dilemma", " game theory", " evolutionary dynamics", " computational modeling", " sociophysics"], "paper_abstract": "The spatial Prisoner's Dilemma is a prototype model to show the emergence of cooperation in very competitive environments. It considers players, at sites of lattices, that can either cooperate or defect when playing the Prisoner's Dilemma with z other players. This model presents a rich phase diagram. Here we consider players in cells of one-dimensional cellular automata. Each player interacts with z other players. This geometry allows us to vary, in a simple manner, the number of neighbors ranging from one up to the lattice size, including self-interaction. This approach has multiple advantages. It is simple to implement numerically and we are able to retrieve all the results found in the previously considered lattices, with a faster convergence to stationary values. More remarkable, it permits us to keep track of the spatio-temporal evolution of each player of the automaton, giving rise to interesting patterns. These patterns allow the interpretation of cooperation/defection clusters as particles, which can be absorbed and collided among themselves. The presented approach represents a new paradigm to study the emergence and maintenance of cooperation in the spatial Prisoner's Dilemma.", "paper_title": "Prisoner's Dilemma in one-dimensional cellular automata: Visualization of evolutionary patterns", "paper_id": "WOS:000254193900012"}