{"auto_keywords": [{"score": 0.03486762958298175, "phrase": "exploration_algorithm"}, {"score": 0.027746624062048694, "phrase": "competitive_ratio"}, {"score": 0.013236930158705312, "phrase": "minimum_number"}, {"score": 0.00481495049065317, "phrase": "available_information"}, {"score": 0.004722969348897542, "phrase": "network_problems"}, {"score": 0.004515091332353969, "phrase": "concerned_availability"}, {"score": 0.004486147558765763, "phrase": "particular_items"}, {"score": 0.0036749658368075027, "phrase": "quantitative_approach"}, {"score": 0.0036513878928387047, "phrase": "available_knowledge"}, {"score": 0.0035931003474699583, "phrase": "tree_exploration"}, {"score": 0.003558573794178866, "phrase": "mobile_entity"}, {"score": 0.0034347810592224096, "phrase": "unknown_tree"}, {"score": 0.0030885689801303123, "phrase": "shortest_path"}, {"score": 0.0025376170201746213, "phrase": "exact_threshold_oracle_size"}, {"score": 0.00248903151226017, "phrase": "roughly_log_log"}, {"score": 0.002356353539621074, "phrase": "constant_c"}, {"score": 0.0021049977753042253, "phrase": "function_g"}], "paper_keywords": [""], "paper_abstract": "We study the amount of knowledge about the network that is required in order to efficiently solve a task concerning this network. The impact of available information on the efficiency of solving network problems, such as communication or exploration, has been investigated before but assumptions concerned availability of particular items of information about the network, such as the size, the diameter, or a map of the network. In contrast, our approach is quantitative: we investigate the minimum number of bits of information (minimum oracle size) that has to be given to an algorithm in order to perform a task with given efficiency. We illustrate this quantitative approach to available knowledge by the task of tree exploration. A mobile entity (robot) has to traverse all edges of an unknown tree, using as few edge traversals as possible. The quality of an exploration algorithm A is measured by its competitive ratio, i.e., by comparing its cost (number of edge traversals) to the length of the shortest path containing all edges of the tree. Depth-First-Search has competitive ratio 2 and, in the absence of any information about the tree, no algorithm can beat this value. We determine the minimum number of bits of information that has to be given to an exploration algorithm in order to achieve competitive ratio strictly smaller than 2. Our main result establishes an exact threshold oracle size that turns out to be roughly log log D, where D is the diameter of the tree. More precisely, for any constant c, we construct an exploration algorithm with competitive ratio smaller than 2, using an oracle of size at most log log D - c, and we show that every algorithm using an oracle of size log log D - g(D), for any function g unbounded from above, has competitive ratio at least 2.", "paper_title": "Tree exploration with an oracle", "paper_id": "WOS:000240271700002"}