{"auto_keywords": [{"score": 0.04296486508114674, "phrase": "pwn"}, {"score": 0.007220128924268177, "phrase": "fiwn"}, {"score": 0.004672727518631859, "phrase": "large-scale_lexical_databases"}, {"score": 0.0045346863560033175, "phrase": "language-aware_software_applications"}, {"score": 0.004327981760540394, "phrase": "finnish_wordnet"}, {"score": 0.003916098498242888, "phrase": "professional_translators"}, {"score": 0.003877121909026298, "phrase": "direct_translation_approach"}, {"score": 0.003737485125097945, "phrase": "language-independent_real-world_concepts"}, {"score": 0.0033367819052051995, "phrase": "extensive_finnish_wordnet"}, {"score": 0.003216542938791835, "phrase": "translation_relation"}, {"score": 0.0029198522863606953, "phrase": "first_time"}, {"score": 0.0028052155436760528, "phrase": "spelling_and_translation_quality"}, {"score": 0.0027131212233443137, "phrase": "synonym_quality"}, {"score": 0.0026771333996253783, "phrase": "lexeme_and_concept_level"}, {"score": 0.0025978919678702793, "phrase": "resulting_lexical_resource"}, {"score": 0.002537880772794665, "phrase": "language-technological_task"}, {"score": 0.0024958641143547856, "phrase": "new_problems"}, {"score": 0.002438209804747943, "phrase": "pwn."}, {"score": 0.00235813005446246, "phrase": "scientific_discourse"}, {"score": 0.0021049977753042253, "phrase": "currently_the_largest_wordnet"}], "paper_keywords": ["Wordnet", " Bilingual lexicon", " Quality assessment", " Knowledge representation", " Word-sense disambiguation"], "paper_abstract": "Wordnets are large-scale lexical databases of related words and concepts, useful for language-aware software applications. They have recently been built for many languages by using various approaches. The Finnish wordnet, FinnWordNet (FiWN), was created by translating the more than 200,000 word senses in the English Princeton WordNet (PWN) 3.0 in 100 days. To ensure quality, they were translated by professional translators. The direct translation approach was based on the assumption that most synsets in PWN represent language-independent real-world concepts. Thus also the semantic relations between synsets were assumed mostly language-independent, so the structure of PWN could be reused as well. This approach allowed the creation of an extensive Finnish wordnet directly aligned with PWN and also provided us with a translation relation and thus a bilingual wordnet usable as a dictionary. In this paper, we address several concerns raised with regard to our approach, many of them for the first time. We evaluate the craftsmanship of the translators by checking the spelling and translation quality, the viability of the approach by assessing the synonym quality both on the lexeme and concept level, as well as the usefulness of the resulting lexical resource both for humans and in a language-technological task. We discovered no new problems compared with those already known in PWN. As a whole, the paper contributes to the scientific discourse on what it takes to create a very large wordnet. As a side-effect of the evaluation, we extended FiWN to contain 208,645 word senses in 120,449 synsets, effectively making version 2.0 of FiWN currently the largest wordnet in the world by these statistics.", "paper_title": "Is it possible to create a very large wordnet in 100 days? An evaluation", "paper_id": "WOS:000335779200001"}