{"auto_keywords": [{"score": 0.044869792207088685, "phrase": "protein_identification"}, {"score": 0.02542937115779678, "phrase": "unique_tags"}, {"score": 0.00481495049065317, "phrase": "unique_mass_and_peptide_signatures"}, {"score": 0.0045464538515249085, "phrase": "measured_molecular_mass"}, {"score": 0.004494570360108983, "phrase": "peptide_sequence"}, {"score": 0.004123781267600542, "phrase": "publicly_available_web_application"}, {"score": 0.0030239842475439814, "phrase": "swiss-prot_database"}, {"score": 0.0028550709503536494, "phrase": "unique_protein_fragments"}, {"score": 0.002790170184447136, "phrase": "enzymatic_digestion"}, {"score": 0.002321234686549485, "phrase": "molecular_mass_level"}, {"score": 0.002268441347979241, "phrase": "sequence_level"}, {"score": 0.0021049977753042253, "phrase": "biomarker_discovery"}], "paper_keywords": [""], "paper_abstract": "The uniqueness of a measured molecular mass or peptide sequence plays a very important role in the fields of protein identification and peptide/protein-biomarker investigation. We present a publicly available web application that offers information concerning the uniqueness of one or more molecular masses and one or more peptide sequences in the human proteome. When a sequence is found to be unique in humans, the application is able to search across all species querying whether this sequence is unique, not only in humans but also in other species found in the Swiss-Prot Database. The application is also able to search for unique protein fragments derived computationally from enzymatic digestion driven by certain enzymes. Furthermore, the application can list all the unique masses and peptides of a given protein. Through this application, researchers are able to find unique tags, either on a molecular mass level or on a sequence level. These unique tags are remarkably important in research related to protein identification or biomarker discovery and measurements.", "paper_title": "UniMaP: finding unique mass and peptide signatures in the human proteome", "paper_id": "WOS:000271564300023"}