{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "lung_cancer"}, {"score": 0.004779085953614184, "phrase": "biological_networks"}, {"score": 0.004192803336288522, "phrase": "final_sum"}, {"score": 0.003919763262805793, "phrase": "gene_interactions"}, {"score": 0.0037336520904376687, "phrase": "different_cohorts"}, {"score": 0.003691969158027291, "phrase": "gene_and_gene-product_interaction_networks"}, {"score": 0.003556345965454902, "phrase": "small_subset"}, {"score": 0.0034904076588243315, "phrase": "consistently_high_expression_change"}, {"score": 0.0034514309280805106, "phrase": "cancerous_tissue"}, {"score": 0.003226513431715486, "phrase": "larger_scale_perturbations"}, {"score": 0.0031904741237384106, "phrase": "overall_landscape"}, {"score": 0.0031666711243198992, "phrase": "expression_levels"}, {"score": 0.003073216350080926, "phrase": "simulated_data"}, {"score": 0.0029713625496165944, "phrase": "true_gene_list"}, {"score": 0.002949189427671915, "phrase": "noisy_measurement_data"}, {"score": 0.0025868090345615197, "phrase": "gene_sets"}, {"score": 0.002418099158357658, "phrase": "per-patient_basis"}, {"score": 0.002391067964886602, "phrase": "large_cohorts"}, {"score": 0.002260367486652148, "phrase": "expression_studies"}, {"score": 0.002193600680263771, "phrase": "small_set"}, {"score": 0.002177218756653181, "phrase": "influential_genes"}, {"score": 0.0021049977753042253, "phrase": "genome-wide_expression_changes"}], "paper_keywords": [""], "paper_abstract": "Motivation: Lung cancer is often discovered long after its onset, making identifying genes important in its initiation and progression a challenge. By the time the tumors are discovered, we only observe the final sum of changes of the few genes that initiated cancer and thousands of genes that they have influenced. Gene interactions and heterogeneity of samples make it difficult to identify genes consistent between different cohorts. Using gene and gene-product interaction networks, we propose a principled approach to identify a small subset of genes whose network neighbors exhibit consistently high expression change ( in cancerous tissue versus normal) regardless of their own expression. We hypothesize that these genes can shed light on the larger scale perturbations in the overall landscape of expression levels. Results: We benchmark our method on simulated data, and show that we can recover a true gene list in noisy measurement data. We then apply our method to four non-small cell lung cancer and two pancreatic cancer cohorts, finding several genes that are consistent within all cohorts of the same cancer type. Conclusion: Our model is flexible, robust and identifies gene sets that are more consistent across cohorts than several other approaches. Additionally, our method can be applied on a per-patient basis not requiring large cohorts of patients to find genes of influence. Our approach is generally applicable to gene expression studies where the goal is to identify a small set of influential genes that may in turn explain the much larger set of genome-wide expression changes.", "paper_title": "Unsupervised detection of genes of influence in lung cancer using biological networks", "paper_id": "WOS:000296637500013"}