{"auto_keywords": [{"score": 0.04945540937697203, "phrase": "similarity_searching"}, {"score": 0.04615766476303907, "phrase": "relative_performance"}, {"score": 0.04472882712454684, "phrase": "similarity_coefficients"}, {"score": 0.030570347867177793, "phrase": "nonbinary_data"}, {"score": 0.00481495049065317, "phrase": "nonbinary_similarity_coefficients"}, {"score": 0.004167982855788402, "phrase": "chemical_databases"}, {"score": 0.004086744751579196, "phrase": "binary_fingerprints"}, {"score": 0.0036553070575015344, "phrase": "database_clustering"}, {"score": 0.003584025547693836, "phrase": "dissimilarity-based_compound_selection"}, {"score": 0.003269266730193333, "phrase": "molecular_size"}, {"score": 0.00308163068747474, "phrase": "alternative_form"}, {"score": 0.002480961181275199, "phrase": "twelve_coefficients"}, {"score": 0.0022928018832993387, "phrase": "single_coefficient"}, {"score": 0.002146926767291475, "phrase": "size_bias"}, {"score": 0.0021049977753042253, "phrase": "binary_data"}], "paper_keywords": [""], "paper_abstract": "Several recent studies have compared the relative performance of a selection of similarity coefficients when applied to chemical databases represented by binary fingerprints. Considerable variation in performance, when used for (dis)similarity-based techniques, such as similarity searching, database clustering, and dissimilarity-based compound selection, has been reported, the reasons for which are closely related to molecular size. For many of these similarity coefficients, an alternative form can be derived which is applicable to sets of nonbinary data, such as calculated or measured physicochemical properties, or counts of substructural fragments. Here we report on several studies which have been undertaken to investigate the relative performance of twelve coefficients when applied to nonbinary data using such (dis)similarity-based techniques. Results suggest that no single coefficient is appropriate for all methodologies investigated and that the size bias detected with binary data is not as apparent when the data and, hence, coefficient are nonbinary in nature.", "paper_title": "Comparison of Nonbinary Similarity Coefficients for Similarity Searching, Clustering and Compound Selection", "paper_id": "WOS:000266327000006"}