{"auto_keywords": [{"score": 0.04971075098097412, "phrase": "reconfigurable_manufacturing_systems"}, {"score": 0.03351309712344681, "phrase": "product_families"}, {"score": 0.00481495049065317, "phrase": "product_families_formation"}, {"score": 0.004526503177267299, "phrase": "effective_working"}, {"score": 0.004338239182984759, "phrase": "next_step"}, {"score": 0.00415777266387528, "phrase": "highly_customised_and_complex_products"}, {"score": 0.00406250784433007, "phrase": "mass_production"}, {"score": 0.0038189638340666936, "phrase": "system_configuration"}, {"score": 0.0036884198249734863, "phrase": "first_family"}, {"score": 0.0034405207528624983, "phrase": "second_family"}, {"score": 0.0032849177991349163, "phrase": "rms"}, {"score": 0.0031968441980848436, "phrase": "best_set"}, {"score": 0.0028576796380512157, "phrase": "core_importance"}, {"score": 0.002707033618304716, "phrase": "product_demand"}, {"score": 0.0024669814850296146, "phrase": "ahp_methodology"}, {"score": 0.0024385083712241988, "phrase": "unique_matrix"}, {"score": 0.002401053532270901, "phrase": "similarity_values"}, {"score": 0.002205079358459154, "phrase": "diverse_sets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["reconfigurable manufacturing", " product families"], "paper_abstract": "The aim of this work is to establish a methodology for an effective working of Reconfigurable Manufacturing Systems (RMSs). These systems are the next step in manufacturing, allowing the production of any quantity of highly customised and complex products together with the benefits of mass production. In RMSs, products are grouped into families, each of which requires a system configuration. The system is configured to produce the first family of products. Once it is finished, the system is reconfigured in order to produce the second family, and so forth. Therefore, the effectiveness of a RMS depends on the formation of the best set of product families. Therefore, a methodology for grouping products into families, which takes into account the requirements of products in RMSs, is an issue of core importance. These requirements are modularity, commonality, compatibility, reusability, and product demand. The methodology starts by calculating, for each product requirement, a matrix that summarises the similarity between pairs of products. Then, through the use of the AHP methodology, a unique matrix that comprises the similarity values between products is obtained. The Average Linkage Clustering algorithm is applied to this matrix in order to obtain a dendogram that shows the diverse sets of product families that may be formed. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A systematic approach for product families formation in Reconfigurable Manufacturing Systems", "paper_id": "WOS:000247258500001"}