{"auto_keywords": [{"score": 0.04967913398382337, "phrase": "localized_maximum-margin_learning"}, {"score": 0.015719716506582538, "phrase": "local_region"}, {"score": 0.009864030362701465, "phrase": "candidate_contextual_visual_words"}, {"score": 0.004597861947580946, "phrase": "visual_recognition"}, {"score": 0.004540365779658683, "phrase": "scene_categorization"}, {"score": 0.004390517953424082, "phrase": "local_feature"}, {"score": 0.0034130176595901104, "phrase": "bocvw"}, {"score": 0.003370287778450475, "phrase": "eventual_scene_classification"}, {"score": 0.0033280910751441522, "phrase": "proposed_method_fuses"}, {"score": 0.0032181231788427655, "phrase": "best_contextual_visual_word"}, {"score": 0.0029463874016490976, "phrase": "unknown_region"}, {"score": 0.0028015105858516702, "phrase": "proposed_method"}, {"score": 0.0026975346834867335, "phrase": "single_feature"}, {"score": 0.0026637384761565605, "phrase": "local_regions"}, {"score": 0.002630364569659531, "phrase": "contextual_visual_words"}], "paper_keywords": ["Scene categorization", " Image recognition", " Feature fusion", " Similarity-metric learning"], "paper_abstract": "In the field of visual recognition such as scene categorization, representing an image based on the local feature (e.g., the bag-of-visual-word (BOVW) model and the bag-of-contextual-visual-word (BOCVW) model) has become popular and one of the most successful methods. In this paper, we propose a method that uses localized maximum-margin learning to fuse different types of features during the BOCVW modeling for eventual scene classification. The proposed method fuses multiple features at the stage when the best contextual visual word is selected to represent a local region (hard assignment) or the probabilities of the candidate contextual visual words used to represent the unknown region are estimated (soft assignment). The merits of the proposed method are that (1) errors caused by the ambiguity of single feature when assigning local regions to the contextual visual words can be corrected or the probabilities of the candidate contextual visual words used to represent the region can be estimated more accurately; and that (2) it offers a more flexible way in fusing these features through determining the similarity-metric locally by localized maximum-margin learning. The proposed method has been evaluated experimentally and the results indicate its effectiveness. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Feature fusion within local region using localized maximum-margin learning for scene categorization", "paper_id": "WOS:000300459000036"}