{"auto_keywords": [{"score": 0.039843010884554754, "phrase": "erp_system"}, {"score": 0.00842153950104588, "phrase": "heterogeneous_information"}, {"score": 0.00481495049065317, "phrase": "enterprise_resource_planning_system"}, {"score": 0.00469445816161498, "phrase": "enterprise_resource_planning"}, {"score": 0.00441738161338662, "phrase": "complete_range"}, {"score": 0.00437281181878921, "phrase": "business_processes"}, {"score": 0.0040525061916685924, "phrase": "great_deal"}, {"score": 0.003308085469148074, "phrase": "different_parameters"}, {"score": 0.002928594036918225, "phrase": "different_nature"}, {"score": 0.0026057256900479026, "phrase": "evaluation_process"}, {"score": 0.0024516267507109753, "phrase": "fuzzy_evaluation_model"}, {"score": 0.0023183698048498797, "phrase": "multi-expert_decision-making"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multi-expert decision-making", " Evaluation", " Heterogeneous information", " ERP"], "paper_abstract": "The use of enterprise resource planning (ERP) as a foundation for the integration of the complete range of business processes and functions, is clearly useful and economically profitable in most very large organizations which manage a great deal of data in their information systems. However, the decision of installing an ERP system in all the companies is not always so clear, it will depend on the size, future profits and other features of the company. Therefore, different parameters (features, aspects) will be evaluated to make a decision about the Suitability of the ERP system. These parameters might have different nature or the knowledge about them could be vague or imprecise. Thus, this implies that it Would be suitable that the evaluation process can manage heterogeneous information. In this paper we shall present a fuzzy evaluation model to evaluate the suitability of an ERP system based on a multi-expert decision-making (ME-DM) process that is able to deal with heterogeneous information. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "A fuzzy model to evaluate the suitability of installing an enterprise resource planning system", "paper_id": "WOS:000266646900006"}