{"auto_keywords": [{"score": 0.0374992556433536, "phrase": "group_recommendations"}, {"score": 0.010612387000973441, "phrase": "group_recommendation_algorithms"}, {"score": 0.004756161254039343, "phrase": "recommender_systems"}, {"score": 0.004698086429418318, "phrase": "common_tool"}, {"score": 0.0046407174174471644, "phrase": "information_overload_problem"}, {"score": 0.004612294931699583, "phrase": "educational_and_informative_web_sites"}, {"score": 0.004514173914270395, "phrase": "online_shops"}, {"score": 0.0044181310380945705, "phrase": "individual_users"}, {"score": 0.004350777114615379, "phrase": "selected_items"}, {"score": 0.004219121035447185, "phrase": "personal_usage"}, {"score": 0.004066360459825868, "phrase": "effective_group_recommendations"}, {"score": 0.003955416337187053, "phrase": "group_members'_preferences"}, {"score": 0.0038239045109853633, "phrase": "group_members'_recommendations"}, {"score": 0.0037424924896976093, "phrase": "traditional_recommendation_algorithms"}, {"score": 0.0036628073805800377, "phrase": "five_commonly_used_recommendation_algorithms"}, {"score": 0.0035958527554878655, "phrase": "different_group_compositions"}, {"score": 0.0029806849142611984, "phrase": "grouping_strategy"}, {"score": 0.0028550099401780803, "phrase": "individual_recommendations"}, {"score": 0.00276849045705109, "phrase": "grouping_strategies"}, {"score": 0.002734619281384385, "phrase": "individual_strategy"}, {"score": 0.002532091374790013, "phrase": "group_increases"}, {"score": 0.0024103977660677677, "phrase": "large_extent"}, {"score": 0.0023808972257735018, "phrase": "used_grouping_strategy"}, {"score": 0.002366282306226484, "phrase": "recommendation_algorithm"}, {"score": 0.002218126296988689, "phrase": "desired_quality_metrics"}, {"score": 0.0021049977753042253, "phrase": "selection_process"}], "paper_keywords": ["Group recommender", " Evaluation", " User modeling", " Algorithms"], "paper_abstract": "In recent years recommender systems have become the common tool to handle the information overload problem of educational and informative web sites, content delivery systems, and online shops. Although most recommender systems make suggestions for individual users, in many circumstances the selected items (e.g., movies) are not intended for personal usage but rather for consumption in groups. This paper investigates how effective group recommendations for movies can be generated by combining the group members' preferences (as expressed by ratings) or by combining the group members' recommendations. These two grouping strategies, which convert traditional recommendation algorithms into group recommendation algorithms, are combined with five commonly used recommendation algorithms to calculate group recommendations for different group compositions. The group recommendations are not only assessed in terms of accuracy, but also in terms of other qualitative aspects that are important for users such as diversity, coverage, and serendipity. In addition, the paper discusses the influence of the size and composition of the group on the quality of the recommendations. The results show that the grouping strategy which produces the most accurate results depends on the algorithm that is used for generating individual recommendations. Therefore, the paper proposes a combination of grouping strategies which outperforms each individual strategy in terms of accuracy. Besides, the results show that the accuracy of the group recommendations increases as the similarity between members of the group increases. Also the diversity, coverage, and serendipity of the group recommendations are to a large extent dependent on the used grouping strategy and recommendation algorithm. Consequently for (commercial) group recommender systems, the grouping strategy and algorithm have to be chosen carefully in order to optimize the desired quality metrics of the group recommendations. The conclusions of this paper can be used as guidelines for this selection process.", "paper_title": "Comparison of group recommendation algorithms", "paper_id": "WOS:000340550300020"}