{"auto_keywords": [{"score": 0.003680587852807675, "phrase": "first_algorithm"}, {"score": 0.0035866734383189396, "phrase": "iterated_local_search_algorithm"}, {"score": 0.0033883824438527316, "phrase": "local_search_moves"}, {"score": 0.00330189927527898, "phrase": "second_algorithm"}, {"score": 0.0032510690712452147, "phrase": "hybrid_genetic_search"}, {"score": 0.003168079471049896, "phrase": "shortest_hamiltonian_path"}, {"score": 0.002769395841379498, "phrase": "solution_representation"}, {"score": 0.002740885774408238, "phrase": "large_neighborhoods"}, {"score": 0.0026161698049580804, "phrase": "bi-directional_dynamic_programming"}, {"score": 0.0025361866386341796, "phrase": "appropriate_data_structures"}, {"score": 0.0025100713447593773, "phrase": "extensive_computational_experiments"}, {"score": 0.0024586427394152196, "phrase": "benchmark_instances"}, {"score": 0.0021714122348552747, "phrase": "average_cluster_size"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Clustered Vehicle Routing", " Iterated Local Search", " Hybrid Genetic Algorithm", " Large neighborhoods", " Shortest path"], "paper_abstract": "The Clustered Vehicle Routing Problem (CluVRP) is a variant of the Capacitated Vehicle Routing Problem in which customers are grouped into clusters. Each cluster has to be visited once, and a vehicle entering a cluster cannot leave it until all customers have been visited. This paper presents two alternative hybrid metaheuristic algorithms for the CluVRP. The first algorithm is based on an Iterated Local Search algorithm, in which only feasible solutions are explored and problem-specific local search moves are utilized. The second algorithm is a hybrid genetic search, for which the shortest Hamiltonian path between each pair of vertices within each cluster should be precomputed. Using this information, a sequence of clusters can be used as a solution representation and large neighborhoods can be efficiently explored, by means of bi-directional dynamic programming, sequence concatenation, and appropriate data structures. Extensive computational experiments are performed on benchmark instances from the literature, as well as new large scale instances. Recommendations on the choice of algorithm are provided, based on average cluster size. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Hybrid metaheuristics for the Clustered Vehicle Routing Problem", "paper_id": "WOS:000351967100009"}