{"auto_keywords": [{"score": 0.04395571076903231, "phrase": "deterministic_and_nondeterministic_versions"}, {"score": 0.015544254836988954, "phrase": "restricted_model"}, {"score": 0.00869057864446488, "phrase": "membrane_computing"}, {"score": 0.004144908086646161, "phrase": "positive_integer_r"}, {"score": 0.004051828608343507, "phrase": "unary_language_l"}, {"score": 0.0037421447950935836, "phrase": "unary_input_alphabet"}, {"score": 0.003683097597914604, "phrase": "deterministic_and_nondeterministic_linear-bounded_automata"}, {"score": 0.003287482882222731, "phrase": "nonnegative_integer_t"}, {"score": 0.0032429499567088113, "phrase": "environment_alphabet_e"}, {"score": 0.003077740778989273, "phrase": "infinite_hierarchy"}, {"score": 0.002835838311928684, "phrase": "string_languages"}, {"score": 0.0027974062863324873, "phrase": "deterministic_version"}, {"score": 0.0027594936602962075, "phrase": "nondeterministic_version"}, {"score": 0.002722093453065922, "phrase": "complexity_issues"}, {"score": 0.0024460897937643032, "phrase": "restricted_p_systems"}, {"score": 0.0023856341531435297, "phrase": "previous_results"}, {"score": 0.0022847009758393405, "phrase": "recent_article"}, {"score": 0.0022640009579466924, "phrase": "twenty_six_open_problems"}, {"score": 0.0022231606165229235, "phrase": "p_systems_web_page"}, {"score": 0.0021980095412862635, "phrase": "gheorghe_paun"}, {"score": 0.0021632743048552536, "phrase": "earlier_results"}], "paper_keywords": ["symport/antiport system", " communicating P system", " Turing machine", " multihead two-way finite automaton", " multicounter machine", " hierarchy", " deterministic", " nondeterministic"], "paper_abstract": "We introduce a restricted model of a one-membrane symport/antiport system, called bounded S/A system. We show the following: 1. A language L subset of a(1)*... a(k)* is accepted by a bounded S/A system if and only if it is accepted by a log n space-bounded Turing machine. This holds for both deterministic and nondeterministic versions. 2. For every positive integer r, there is an s > r and a unary language L that is accepted by a bounded S/A system with s objects that cannot be accepted by any bounded S/A system with only r objects. This holds for both deterministic and nondeterministic versions. 3. Deterministic and nondeterministic bounded S/A systems over a unary input alphabet are equivalent if and only if deterministic and nondeterministic linear-bounded automata (over an arbitrary input alphabet) are equivalent. We also introduce a restricted model of a multi-membrane S/A system, called special S/A system. The restriction guarantees that the number of objects in the system at any time during the computation remains constant. We show that for every nonnegative integer t, special S/A systems with environment alphabet E of t symbols (note that other symbols are allowed in the system if they are not transported into the environment) has an infinite hierarchy in terms of the number of membranes. Again, this holds for both deterministic and nondeterministic versions. Finally, we introduce a model of a one-membrane bounded S/A system, called bounded SA acceptor, that accepts string languages. We show that the deterministic version is strictly weaker than the nondeterministic version. Clearly, investigations into complexity issues (hierarchies, determinism versus nondeterminism, etc.) in membrane computing are natural and interesting from the points of view of foundations and applications, e.g., in modeling and simulating of cells. Some of the results above have been shown for other types of restricted P systems (that are not symport/antiport). However, these previous results do not easily translate for the models of S/A systems we consider here. In fact, in a recent article, \"Further Twenty Six Open Problems in Membrane Computing\" (January 26, 2005; see P Systems Web Page at http://psystems.disco.unimib.it), Gheorghe Paun poses the question of whether the earlier results, e.g., concerning determinism versus nondeterminism can be proved for restricted S/A systems.", "paper_title": "On bounded symport/antiport P systems", "paper_id": "WOS:000238093800010"}