{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "oncodriverole"}, {"score": 0.00476697427418509, "phrase": "cancer_driver_genes"}, {"score": 0.004184921610672245, "phrase": "cancer_development"}, {"score": 0.004143196873246147, "phrase": "specific_alterations"}, {"score": 0.0038431888954930083, "phrase": "gene_product"}, {"score": 0.003729335910488339, "phrase": "tumor_suppressors"}, {"score": 0.003021141590548526, "phrase": "multiple_gene_features"}, {"score": 0.002931569771634119, "phrase": "genomic_alterations"}, {"score": 0.002816246391862638, "phrase": "lof_cancer_genes"}, {"score": 0.0027327327233891865, "phrase": "automated_approach"}, {"score": 0.0026516890043911836, "phrase": "novel_cancer_drivers"}, {"score": 0.0025219085140220773, "phrase": "machine_learning-based_approach"}, {"score": 0.002191261639178101, "phrase": "matthew"}, {"score": 0.0021049977753042253, "phrase": "cancer_gene_census"}], "paper_keywords": [""], "paper_abstract": "Motivation: Several computational methods have been developed to identify cancer drivers genes-genes responsible for cancer development upon specific alterations. These alterations can cause the loss of function (LoF) of the gene product, for instance, in tumor suppressors, or increase or change its activity or function, if it is an oncogene. Distinguishing between these two classes is important to understand tumorigenesis in patients and has implications for therapy decision making. Here, we assess the capacity of multiple gene features related to the pattern of genomic alterations across tumors to distinguish between activating and LoF cancer genes, and we present an automated approach to aid the classification of novel cancer drivers according to their role. Result: OncodriveROLE is a machine learning-based approach that classifies driver genes according to their role, using several properties related to the pattern of alterations across tumors. The method shows an accuracy of 0.93 and Matthew's correlation coefficient of 0.84 classifying genes in the Cancer Gene Census.", "paper_title": "OncodriveROLE classifies cancer driver genes in loss of function and activating mode of action", "paper_id": "WOS:000342912400029"}