{"auto_keywords": [{"score": 0.043994741050811886, "phrase": "feature_points"}, {"score": 0.018068332529127335, "phrase": "training_images"}, {"score": 0.010900539979883463, "phrase": "transformation_parameters"}, {"score": 0.008713768692145006, "phrase": "face_recognition"}, {"score": 0.006653664314230959, "phrase": "zernike_moments"}, {"score": 0.0047277417909824745, "phrase": "image_registration"}, {"score": 0.004676173016967478, "phrase": "face_recognition_technique"}, {"score": 0.0043305354943056875, "phrase": "image_registration_technique"}, {"score": 0.0038240605592708083, "phrase": "mexican-hat_wavelet"}, {"score": 0.0037684961730030235, "phrase": "feature_point_locations"}, {"score": 0.0035153544006182834, "phrase": "third_step"}, {"score": 0.0032433414042726356, "phrase": "iterative_least_squares_technique"}, {"score": 0.002710557619357275, "phrase": "registration_part"}, {"score": 0.0024462867877027435, "phrase": "valid_match"}, {"score": 0.0023582694348219233, "phrase": "proposed_method"}, {"score": 0.0022158306933307685, "phrase": "existing_techniques"}, {"score": 0.0021676351850669017, "phrase": "proposed_technique"}, {"score": 0.0021518035978153878, "phrase": "excellent_results"}, {"score": 0.0021049977753042253, "phrase": "varying_pose"}], "paper_keywords": ["Face recognition", " image registration", " mexican-hat wavelet"], "paper_abstract": "This paper presents a technique for face recognition that is based on image registration. The face recognition technique consists of three parts: a training part, an image registration part and a post-processing part. The image registration technique is based on finding a set of feature points in the two images and using these feature points for registration. This is done in four steps. In the first, images are filtered with the Mexican-hat wavelet to obtain the feature point locations. In the second, the Zernike moments of neighborhoods around the feature points are calculated and compared in the third step to establish correspondence between feature points in the two images. In the fourth, the transformation parameters between images are obtained using an iterative least squares technique to eliminate outliers.(1,2) During training, a set of images are chosen as the training images and the Zernike moments for the feature points of the training images are obtained and stored. The choice of training images depends on the changes of poses and illumination that are expected. In the registration part, the transformation parameters to register the training images with the images under consideration are obtained. In the post-processing, these transformation parameters are used to determine whether a valid match is found or not. The performance of the proposed method is evaluated using various face databases(3-5) and it is compared with the performance of existing techniques. Results indicate that the proposed technique gives excellent results for face recognition in conditions of varying pose, illumination, background and scale.", "paper_title": "A METHOD FOR FACE RECOGNITION USING IMAGE REGISTRATION", "paper_id": "WOS:000297938900014"}