{"auto_keywords": [{"score": 0.04963668061042319, "phrase": "unknown_environments"}, {"score": 0.00481495049065317, "phrase": "ubiquitous_robot_deployment"}, {"score": 0.004575272950516775, "phrase": "multi-agent_system"}, {"score": 0.0044495843279816075, "phrase": "intelligent_cameras"}, {"score": 0.004388035083357706, "phrase": "easy_and_fast_deployment"}, {"score": 0.0035273744062641636, "phrase": "neighbourhood_relationships"}, {"score": 0.0033828748627992193, "phrase": "fields_of_view"}, {"score": 0.00321425262806329, "phrase": "passable_path"}, {"score": 0.002997735656669146, "phrase": "coordination_processes"}, {"score": 0.002267708463966758, "phrase": "experimental_section"}, {"score": 0.002164602220179823, "phrase": "different_real_world_settings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-camera network", " Multi-agent system", " Service robot", " Robot deployment", " Ubiquitous robot"], "paper_abstract": "In this paper, we present a multi-agent system based on a network of intelligent cameras for the easy and fast deployment of mobile robots in unknown environments. The cameras are able to detect events which require the presence of the robots, calculate routes of cameras through which the robots can navigate, and support this navigation. A route is a list of cameras connected by neighbourhood relationships: the cameras may be neighbours if their Fields of View (FOVs) overlap, or if there exists a passable path among them (if their FOVs do not overlap). In our system, all coordination processes are fully distributed, based only on local-interactions, and self-organization. Our system is robust and redundant, and scales well with the size of the environment and the number of cameras and robots. Finally, it is flexible to the environment, to the number of agents used, and to their disposition. In the experimental section, we show the performance of this system in different real world settings. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Self-organized multi-camera network for ubiquitous robot deployment in unknown environments", "paper_id": "WOS:000320685500003"}