{"auto_keywords": [{"score": 0.048923016754706915, "phrase": "irregular_algorithms"}, {"score": 0.014548855767276554, "phrase": "regular_codes"}, {"score": 0.00481495049065317, "phrase": "domain-based_parallel_irregular_algorithms"}, {"score": 0.004240116703465252, "phrase": "parallel_skeletons"}, {"score": 0.004097389262726735, "phrase": "regular_algorithms"}, {"score": 0.003940122359770492, "phrase": "irregular_ones"}, {"score": 0.0037336520904376687, "phrase": "common_patterns"}, {"score": 0.0032554492909625653, "phrase": "higher_degree"}, {"score": 0.0028106505443369545, "phrase": "simple_and_effective_parallelization"}, {"score": 0.002573424607574822, "phrase": "parallel_tasks"}, {"score": 0.0023677483882740317, "phrase": "multicore_systems"}], "paper_keywords": ["Parallel skeletons", " Amorphous parallelism", " Libraries"], "paper_abstract": "The parallelization of irregular algorithms has not been as widely studied as the one of regular codes. In particular, while there are many proposals of parallel skeletons and libraries very well suited to regular algorithms, this is not the case for irregular ones. This is probably due to the complexity of finding common patterns, behaviors and semantics in these algorithms. This is unfortunate, as the parallelization of irregular algorithms would benefit even more than that of regular codes from the higher degree of abstraction provided by skeletons. This work proposes to exploit the concept of domain defined on some property of the elements to process in order to enable the simple and effective parallelization of irregular applications. Namely, we propose to use such domains both to decompose the computations in parallel tasks and to detect and avoid conflicts between these tasks. A generic C++ library providing a skeleton for multicore systems built on this idea is described and evaluated. Our experimental results show that this library is a very practical tool for the parallelization of irregular algorithms with little programming effort.", "paper_title": "An Algorithm Template for Domain-Based Parallel Irregular Algorithms", "paper_id": "WOS:000341498400004"}