{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "correlated_equilibrium"}, {"score": 0.018213793286432252, "phrase": "maximal_welfare"}, {"score": 0.004776484866276242, "phrase": "nash_equilibrium"}, {"score": 0.004719359108879602, "phrase": "correlation_devices"}, {"score": 0.004497576466646301, "phrase": "trusted_administrator"}, {"score": 0.00401961206251868, "phrase": "multi-agent_systems"}, {"score": 0.003987474771008829, "phrase": "ai._aumann"}, {"score": 0.0035350218469335573, "phrase": "mixed-strategy_equilibria"}, {"score": 0.0033958751452139984, "phrase": "anarchy_literature"}, {"score": 0.0031845067058084583, "phrase": "nonnegative_payoffs"}, {"score": 0.0029504765287722465, "phrase": "mixed-strategy_equilibrium"}, {"score": 0.0028456853685842293, "phrase": "mediation_value"}, {"score": 0.0025840347813610815, "phrase": "enforcement_value"}, {"score": 0.002472269923319476, "phrase": "mediation_and_enforcement_values"}, {"score": 0.0022268964676199292, "phrase": "congestion_games"}, {"score": 0.0021049977753042253, "phrase": "recent_literature"}], "paper_keywords": [""], "paper_abstract": "Correlated equilibrium generalizes Nash equilibrium to allow correlation devices. Correlated equilibrium captures the idea that in many systems there exists a trusted administrator who can recommend behavior to a set of agents, but cannot enforce such behavior. This makes this solution concept most appropriate to the study of multi-agent systems in AI. Aumann showed an example of a game, and of a correlated equilibrium in this game in which the agents' welfare (expected sum of players' utilities) is greater than their welfare in all mixed-strategy equilibria. Following the idea initiated by the price of anarchy literature this suggests the study of two major measures for the value of correlation in a game with nonnegative payoffs: 1. The ratio between the maximal welfare obtained in a correlated equilibrium to the maximal welfare obtained in a mixed-strategy equilibrium. We refer to this ratio as the mediation value. 2. The ratio between the maximal welfare to the maximal welfare obtained in a correlated equilibrium. We refer to this ratio as the enforcement value. In this work we initiate the study of the mediation and enforcement values, providing several general results on the value of correlation as captured by these concepts. We also present a set of results for the more specialized case of congestion games, a class of games that received a lot of attention in the recent literature.", "paper_title": "On the Value of Correlation", "paper_id": "WOS:000262181000004"}