{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "noise-corrupted_multiview_depth_videos"}, {"score": 0.004513151518938864, "phrase": "imaging_functionalities"}, {"score": 0.004361077072629878, "phrase": "virtual_images"}, {"score": 0.004327981760540394, "phrase": "freely_chosen_viewpoints"}, {"score": 0.004295136518467118, "phrase": "depth-image-based_rendering"}, {"score": 0.004246333442872459, "phrase": "depth_maps-projections"}, {"score": 0.004134596278123439, "phrase": "chosen_camera_viewpoints"}, {"score": 0.004010477922833839, "phrase": "inexpensive_depth_sensors"}, {"score": 0.0039049226745413224, "phrase": "non-negligible_acquisition_noise"}, {"score": 0.003687960013746783, "phrase": "efficient_network_transmission"}, {"score": 0.0033399639721674954, "phrase": "better_overall_performance"}, {"score": 0.003130325700934738, "phrase": "rate-constrained_estimation_problem"}, {"score": 0.003047865053078826, "phrase": "observed_noise-corrupted_depth_maps"}, {"score": 0.002867425368894356, "phrase": "representation_size"}, {"score": 0.0028132529128565282, "phrase": "prespecified_rate_constraint"}, {"score": 0.0023694065215394593, "phrase": "mvc_codec"}, {"score": 0.0023335099338323974, "phrase": "multiview_depth_video"}, {"score": 0.0023157656212149367, "phrase": "mpeg_free_viewpoint_video_sequences"}, {"score": 0.0022806798371116698, "phrase": "experimental_results"}, {"score": 0.002203663884543687, "phrase": "coding_rate"}, {"score": 0.002186904773823281, "phrase": "depth_maps"}, {"score": 0.0021455612994325424, "phrase": "unconstrained_estimated_surfaces"}, {"score": 0.0021049977753042253, "phrase": "synthesized_virtual_views"}], "paper_keywords": ["Multiview video", " image denoising", " depth image compression"], "paper_abstract": "Transmitting compactly represented geometry of a dynamic 3D scene from a sender can enable a multitude of imaging functionalities at a receiver, such as synthesis of virtual images at freely chosen viewpoints via depth-image-based rendering. While depth maps-projections of 3D geometry onto 2D image planes at chosen camera viewpoints-can nowadays be readily captured by inexpensive depth sensors, they are often corrupted by non-negligible acquisition noise. Given depth maps need to be denoised and compressed at the encoder for efficient network transmission to the decoder, in this paper, we consider the denoising and compression problems jointly, arguing that doing so will result in a better overall performance than the alternative of solving the two problems separately in two stages. Specifically, we formulate a rate-constrained estimation problem, where given a set of observed noise-corrupted depth maps, the most probable (maximum a posteriori (MAP)) 3D surface is sought within a search space of surfaces with representation size no larger than a prespecified rate constraint. Our rate-constrained MAP solution reduces to the conventional unconstrained MAP 3D surface reconstruction solution if the rate constraint is loose. To solve our posed rate-constrained estimation problem, we propose an iterative algorithm, where in each iteration the structure (object boundaries) and the texture (surfaces within the object boundaries) of the depth maps are optimized alternately. Using the MVC codec for compression of multiview depth video and MPEG free viewpoint video sequences as input, experimental results show that rate-constrained estimated 3D surfaces computed by our algorithm can reduce coding rate of depth maps by up to 32% compared with unconstrained estimated surfaces for the same quality of synthesized virtual views at the decoder.", "paper_title": "Rate-Constrained 3D Surface Estimation From Noise-Corrupted Multiview Depth Videos", "paper_id": "WOS:000337842700011"}