{"auto_keywords": [{"score": 0.040179907029343674, "phrase": "laboratory_session"}, {"score": 0.008835742670562427, "phrase": "eg"}, {"score": 0.007728068708626978, "phrase": "perceived_difficulty"}, {"score": 0.0069487027547905185, "phrase": "laboratory_time"}, {"score": 0.00481495049065317, "phrase": "low-cost_web-based_simulation"}, {"score": 0.004752221133109136, "phrase": "medical_education"}, {"score": 0.004698000536608171, "phrase": "undergraduate_medical_education"}, {"score": 0.004606479650820579, "phrase": "available_laboratory_time"}, {"score": 0.004591399650001409, "phrase": "practice_materials"}, {"score": 0.004561386908745206, "phrase": "blood_samples"}, {"score": 0.004278807087784626, "phrase": "computer-based_simulations"}, {"score": 0.004174824849669107, "phrase": "development_costs"}, {"score": 0.004073359218158693, "phrase": "low-cost_simulation"}, {"score": 0.004053362743156545, "phrase": "medical_students"}, {"score": 0.0040334640350288, "phrase": "practical_exercises"}, {"score": 0.004013662619667083, "phrase": "web-based_e-learning_environment"}, {"score": 0.003795901488754236, "phrase": "large-scale_investment"}, {"score": 0.003584025547693836, "phrase": "student_satisfaction"}, {"score": 0.003502612572302602, "phrase": "practical_exercise"}, {"score": 0.0034854081367558147, "phrase": "physiology_course"}, {"score": 0.0034512514926836667, "phrase": "blood_sample"}, {"score": 0.003428665921276366, "phrase": "experimental_group"}, {"score": 0.003334309053314909, "phrase": "control_group"}, {"score": 0.0031223774204093713, "phrase": "hct_final_value"}, {"score": 0.002824753338885917, "phrase": "significant_difference"}, {"score": 0.002778736549111225, "phrase": "hct_measures"}, {"score": 0.0027605398374811667, "phrase": "eg_group"}, {"score": 0.002724502145870067, "phrase": "higher_reliability"}, {"score": 0.00270221723573854, "phrase": "hct_value"}, {"score": 0.00261918044482033, "phrase": "dfd"}, {"score": 0.0025722741181993278, "phrase": "satisfaction_test"}, {"score": 0.0022443390559699974, "phrase": "eg_students"}, {"score": 0.002157538586313944, "phrase": "increased_reliability"}, {"score": 0.002146926767291475, "phrase": "low-cost_simulations"}, {"score": 0.0021363670305843403, "phrase": "good_complement"}, {"score": 0.002125859121671525, "phrase": "laboratory_sessions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Education", " Medical", " Undergraduate", " Computer-assisted instruction", " Computer simulation", " Physiology"], "paper_abstract": "Background: Practical sessions in undergraduate medical education are often costly and have to face constraints in terms of available laboratory time and practice materials (e. g. blood samples from animals). This makes it difficult to increase the time each student spends at the laboratory. We consider that it would be possible to improve the effectiveness of the laboratory time by providing the students with computer-based simulations for prior rehearsal. However, this approach still presents issues in terms of development costs and distribution to the students. Objective: This study investigates the employment of low-cost simulation to allow medical students to rehearse practical exercises through a web-based e-learning environment. The aim is to maximize the efficiency of laboratory time and resources allocated by letting students become familiarized with the equipment and the procedures before they attend a laboratory session, but without requiring large-scale investment. Moreover, students can access the simulation via the Internet and rehearse at their own pace. We have studied the effects of such a simulation in terms of impact on the laboratory session, learning outcomes and student satisfaction. Methods: We created a simulation that covers the steps of a practical exercise in a Physiology course (measuring hematocrit in a blood sample). An experimental group (EG, n = 66) played the simulation 1 week before the laboratory session. A control group (CG, n = 77) attended the laboratory session without playing the simulation. After the session, all students completed a survey about their perception of the difficulty of the exercise on a scale of 1 - 10 and the HCT final value that they obtained. The students in the EG also completed a survey about their satisfaction with the experience. Results: After the laboratory session, the perceived difficulty of the procedure was lower on average in the EG compared to the CG (3.52 vs. 4.39, 95% CI: 0.16 - 1.57, P =.016). There was no significant difference in terms of perceived difficulty using the equipment. The HCT measures reported by the EG group also presented a much lower dispersion, meaning a higher reliability, in determining the HCT value (3.10 vs. 26.94, SD; variances significantly different, P < .001, F: 75.25, Dfd: 68.19 for EG and CG). In the satisfaction test, the majority of the students in the EG reported that the experience was positive or very positive (80.7%) and reported that it had helped them to identify and use the equipment (78%) and to perform the exercise (66%). The simulation was well received by students in the EG, who felt more comfortable during the laboratory session, and it helped them to perform the exercise better, obtaining more accurate results, which indicates more effective training. EG students perceived the procedure as easier to perform, but did not report an improvement in the perceived difficulty in using the equipment. The increased reliability demonstrates that low-cost simulations are a good complement to the laboratory sessions. (C) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Application of a low-cost web-based simulation to improve students' practical skills in medical education", "paper_id": "WOS:000278192800009"}