{"auto_keywords": [{"score": 0.02880582080932757, "phrase": "hot_spot_problem"}, {"score": 0.00481495049065317, "phrase": "probabilistic_routing"}, {"score": 0.004485735417293941, "phrase": "large-scale_unattended_deployments"}, {"score": 0.004105558123159003, "phrase": "key_point"}, {"score": 0.0036481158025940047, "phrase": "energy_conservative_protocols"}, {"score": 0.003562912424153324, "phrase": "physical_and_link_layer_efforts"}, {"score": 0.003479692058963528, "phrase": "energy_consumption"}, {"score": 0.0030554300179552415, "phrase": "gradient-based_routing_protocols"}, {"score": 0.0028293966058473476, "phrase": "packet_delivery_ratio"}, {"score": 0.0023976048394496446, "phrase": "monitored_area"}, {"score": 0.0022070310530794097, "phrase": "probabilistic_route_selection_techniques"}, {"score": 0.0021049977753042253, "phrase": "network_lifespan"}], "paper_keywords": [""], "paper_abstract": "WSNs are nowadays adopted by the industry in large-scale unattended deployments, and thus we can state that the technology is reaching its maturity. The key point in the success relies on robustness, long lifespan, and reliability, features that are directly related to energy conservative protocols. Notwithstanding, Physical and Link Layer efforts to keep the energy consumption small are usually obviated by routing protocols, which put their efforts on maintaining reliability and throughput instead. For example, gradient-based routing protocols deliver the data through the most reliable links in the network ensuring about 99% of packet delivery ratio, but they suffer from the hot spot problem, that is, the most reliable routes are forced to waste their energy, which fast partitions the network and reduces the monitored area. In order to cope with hot spot problem, we investigate the use of probabilistic route selection techniques. The goal is to increase the network lifespan while reliability is sustained.", "paper_title": "Generalizing CTP: Does Probabilistic Routing in WSN Make Sense?", "paper_id": "WOS:000285608600001"}