{"auto_keywords": [{"score": 0.04616065522315394, "phrase": "protocol_correctness"}, {"score": 0.00481495049065317, "phrase": "correctness_of_security"}, {"score": 0.004459605573798577, "phrase": "informal_analyses"}, {"score": 0.0042373381286051354, "phrase": "security_protocols"}, {"score": 0.004189463229526967, "phrase": "large_variety"}, {"score": 0.004072119477195683, "phrase": "increasing_domains"}, {"score": 0.003946818902700736, "phrase": "secure_access"}, {"score": 0.0039244530915794025, "phrase": "local-area_network_services"}, {"score": 0.0038471623091755804, "phrase": "public-key_registration"}, {"score": 0.003552871243410983, "phrase": "universal_and_unambiguous_interpretation"}, {"score": 0.0034532961266947734, "phrase": "security_problems"}, {"score": 0.0033374705499418377, "phrase": "detailed_and_appropriate_model"}, {"score": 0.003290360233643709, "phrase": "secure_system"}, {"score": 0.0031981188104809994, "phrase": "second_and_significant_source"}, {"score": 0.0031799821835592447, "phrase": "perhaps_useless_debates"}, {"score": 0.002886885861509621, "phrase": "protocol_designers"}, {"score": 0.002782079283183827, "phrase": "different_threat_model"}, {"score": 0.002742787059497186, "phrase": "different_goals"}, {"score": 0.0025763725301629846, "phrase": "single_sheet"}, {"score": 0.0025112322629187787, "phrase": "hard-back_bulky_book"}, {"score": 0.002433843373780471, "phrase": "bulky_book"}, {"score": 0.0023994575666886485, "phrase": "particular_attention"}, {"score": 0.002385839330752606, "phrase": "similar_issues"}, {"score": 0.0023655564168769917, "phrase": "position_paper"}, {"score": 0.0022093656223897322, "phrase": "particular_protocols"}, {"score": 0.002165779466198928, "phrase": "author's_favourite_tool"}], "paper_keywords": ["Protocol goal", " threat model", " protocol verification", " Inductive Method"], "paper_abstract": "As soon as major protocol flaws were discovered empirically - a good luck that is not older than the early 1990s - this title question came up to the world. It was soon realised that some notion of formal correctness was necessary to substantiate the confidence derived from informal analyses. But protocol correctness was born in a decade when security in general was only beginning to ferment. Security protocols aim at a large variety of goals. This is partly due to the increasing domains where the protocols are finding an application, such as secure access to local-area network services, secure e-mail, e-commerce, public-key registration at certification authorities and so on. Also, several interpretations are possible about each goal. Clearly, it is impossible to study protocol correctness profitably without a universal and unambiguous interpretation of its goals. What may be typical of security problems is that it is at least as important to state a detailed and appropriate model of threats that a secure system is meant to withstand. This has been a second and significant source of perhaps useless debates around many protocols. These are certain to be some of the reasons why dozens of papers appeared about one, now popular, protocol attack in just a few years of the second half of the last decade. One of the protocol designers firmly refused those \"findings\" because his protocol had been conceived within a different threat model - and perhaps for different goals from the one that the publications had been constructed upon. It seems obvious that an ant may survive under a single sheet of paper but certainly will not under a hard-back bulky book. It should be clarified what an ant and a bulky book precisely are. With particular attention to similar issues, this position paper discusses some findings of the author's in the area of protocol formal analysis. Their significance mostly is methodical rather than specific for particular protocols. The paper then outlines the author's favourite tool, the Inductive Method, and concludes with a few open problems.", "paper_title": "What is Correctness of Security Protocols?", "paper_id": "WOS:000261554700008"}