{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_robustness"}, {"score": 0.004706206193274572, "phrase": "increased_use"}, {"score": 0.004617455679463816, "phrase": "key_functions"}, {"score": 0.004582423717777699, "phrase": "modern_society"}, {"score": 0.004513151518938864, "phrase": "utmost_importance"}, {"score": 0.004118874671285618, "phrase": "coherent_and_summary_view"}, {"score": 0.003919830848124645, "phrase": "literature_review"}, {"score": 0.003659954070354848, "phrase": "systematic_literature_reviews"}, {"score": 0.0036321600255449613, "phrase": "systematic_reviews"}, {"score": 0.0035230711775515854, "phrase": "existing_and_available_literature"}, {"score": 0.0032272929113113203, "phrase": "multi-step_filtering_process"}, {"score": 0.002922637921202474, "phrase": "evaluation_type"}, {"score": 0.002596653214530156, "phrase": "robustness_requirements"}, {"score": 0.002537880772794665, "phrase": "solution_proposals"}, {"score": 0.0021537671245615286, "phrase": "requirements_engineering"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Systematic review", " Robustness", " Software robustness"], "paper_abstract": "Context: With the increased use of software for running key functions in modern society it is of utmost importance to understand software robustness and how to support it. Although there have been many contributions to the field there is a lack of a coherent and summary view. Objective: To address this issue, we have conducted a literature review in the field of robustness. Method: This review has been conducted by following guidelines for systematic literature reviews. Systematic reviews are used to find and classify all existing and available literature in a certain field. Results: From 9193 initial papers found in three well-known research databases, the 144 relevant papers were extracted through a multi-step filtering process with independent validation in each step. These papers were then further analyzed and categorized based on their development phase, domain, research, contribution and evaluation type. The results indicate that most existing results on software robustness focus on verification and validation of Commercial of the shelf (COTS) or operating systems or propose design solutions for robustness while there is a lack of results on how to elicit and specify robustness requirements. The research is typically solution proposals with little to no evaluation and when there is some evaluation it is primarily done with small, toy/academic example systems. Conclusion: We conclude that there is a need for more software robustness research on real-world, industrial systems and on software development phases other than testing and design, in particular on requirements engineering. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A systematic review of software robustness", "paper_id": "WOS:000311013200001"}