{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "formalising_design_guidelines"}, {"score": 0.004631099806015235, "phrase": "drug_infusion_pumps"}, {"score": 0.004473552224535518, "phrase": "automated_reasoning_tools"}, {"score": 0.004284100953217494, "phrase": "user_interface"}, {"score": 0.003828091961373454, "phrase": "hospital_ward"}, {"score": 0.003795086335272422, "phrase": "medical_devices"}, {"score": 0.0037138072936226, "phrase": "reliable_devices"}, {"score": 0.003163878786694538, "phrase": "current_perceptible_output"}, {"score": 0.0028513785049061767, "phrase": "current_state"}, {"score": 0.0028267701593809877, "phrase": "higher-order_logic"}, {"score": 0.002637377202509382, "phrase": "real_interactive_number_entry_systems"}, {"score": 0.0024183363693242943, "phrase": "patient's_body"}, {"score": 0.0023974563359295043, "phrase": "controlled_amounts"}, {"score": 0.0022758994740331258, "phrase": "verified_solutions"}, {"score": 0.002179313258573377, "phrase": "design_modifications"}, {"score": 0.0021511430180912164, "phrase": "user_strategies"}, {"score": 0.0021049977753042253, "phrase": "identified_issues"}], "paper_keywords": ["Predictability", " Interactive system design", " Model checking", " Higher-order logic", " SAL"], "paper_abstract": "A demonstration is presented of how automated reasoning tools can be used to check the predictability of a user interface. Predictability concerns the ability of a user to determine the outcomes of their actions reliably. It is especially important in situations such as a hospital ward where medical devices are assumed to be reliable devices by their expert users (clinicians) who are frequently interrupted and need to quickly and accurately continue a task. There are several forms of predictability. A definition is considered where information is only inferred from the current perceptible output of the system. In this definition, the user is not required to remember the history of actions that led to the current state. Higher-order logic is used to specify predictability, and the Symbolic Analysis Laboratory is used to automatically verify predictability on real interactive number entry systems of two commercial drug infusion pumps-devices used in the healthcare domain to deliver fluids (e.g., medications, nutrients) into a patient's body in controlled amounts. Areas of unpredictability are precisely identified with the analysis. Verified solutions that make an unpredictable system predictable are presented through design modifications and verified user strategies that mitigate against the identified issues.", "paper_title": "The benefits of formalising design guidelines: a case study on the predictability of drug infusion pumps", "paper_id": "WOS:000357528300002"}