{"auto_keywords": [{"score": 0.04174304445487645, "phrase": "supply_chain"}, {"score": 0.010612387000973441, "phrase": "manufacturing_organizations"}, {"score": 0.007847602186902572, "phrase": "downstream_firms"}, {"score": 0.005915834545763468, "phrase": "overlapped_impacts"}, {"score": 0.004782977628406988, "phrase": "supply_chain_structure"}, {"score": 0.004580243025274209, "phrase": "management_strategy"}, {"score": 0.004549821572786755, "phrase": "materials_supply"}, {"score": 0.004386063799793622, "phrase": "combined_impacts"}, {"score": 0.004256455007398593, "phrase": "individual_firms"}, {"score": 0.0042281749832498, "phrase": "entire_supply_chain"}, {"score": 0.004144452614362445, "phrase": "related_management_implications"}, {"score": 0.00406238127438793, "phrase": "supply_chain_network_model"}, {"score": 0.0036028592508983402, "phrase": "supplier_relationships"}, {"score": 0.003461506316502541, "phrase": "cmi"}, {"score": 0.0032925489316383955, "phrase": "quantity_games"}, {"score": 0.0030290342352603124, "phrase": "supplier_relationship"}, {"score": 0.002777264648691937, "phrase": "firm's_materials_supply_strategies"}, {"score": 0.0027312956497456374, "phrase": "firm's_performance"}, {"score": 0.0026593184154220123, "phrase": "exogenous_parameters"}, {"score": 0.0026328173871352635, "phrase": "initial_market_demand"}, {"score": 0.0026152965305133373, "phrase": "market_price_and_manufacturing_costs"}, {"score": 0.002529421374791293, "phrase": "different_supply_chains"}, {"score": 0.0023113506171584157, "phrase": "innovation_ability"}, {"score": 0.0022579435307530944, "phrase": "better_results"}, {"score": 0.0021476098263617954, "phrase": "win-win_result"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["materials supply strategy", " supply chain structure", " externality", " game"], "paper_abstract": "Supply chain structure and externality are two important factors that should be considered when manufacturing organizations make the management strategy of materials supply. The purpose of this paper is to analyze the combined impacts of these two factors on the performance of both individual firms and entire supply chain so as to find some related management implications. We set up a supply chain network model composed of two supply chains and each supply chain has two modes, namely, upstream and downstream firms. Two types of externalities, i.e., negative (substitution) and positive (complementarity), and three types of supplier relationships between upstream and downstream firms, i.e., DMI, UMI and CMI are considered, respectively. We first give the equilibrium for the price and quantity games between upstream and downstream firms in their material purchasing transactions. We then show that, no matter the externality appears to be negative or positive, changing supplier relationship from arms-length to partnership would enable a firm to have the initiative in the competition. However, two different types of externalities have opposite impacts on the firm's materials supply strategies and finally on the firm's performance. We also analyze the overlapped impacts of exogenous parameters such as initial market demand, market price and manufacturing costs and results show that the overlapped impacts make competition between different supply chains more serious when the externalities are negative. While if both the upstream and downstream firms in one supply chain, under certain coordination mechanism, jointly improve their products quality and innovation ability, this supply chain would finally get better results than another supply chain, therefore makes the two firms in this supply chain to get a win-win result. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Management strategy of materials supply for manufacturing organizations", "paper_id": "WOS:000250075200018"}