{"auto_keywords": [{"score": 0.046433377080865965, "phrase": "mmass_platform"}, {"score": 0.03852759913182569, "phrase": "mmass_model"}, {"score": 0.014903641190830543, "phrase": "related_solutions"}, {"score": 0.012473497961976302, "phrase": "mmass_agents"}, {"score": 0.011247860402878236, "phrase": "spatial_features"}, {"score": 0.00481495049065317, "phrase": "multi-layered_multi-agent_situated_system"}, {"score": 0.004695389394526107, "phrase": "field_diffusion"}, {"score": 0.0042920078348374375, "phrase": "simulation_applications"}, {"score": 0.004230749292148046, "phrase": "multilayered_multi-agent_situated_system_model"}, {"score": 0.004155399041702324, "phrase": "mmass"}, {"score": 0.004081385289516914, "phrase": "multi-agent_systems"}, {"score": 0.004052298370945512, "phrase": "mas"}, {"score": 0.0037305551963210523, "phrase": "spatial_structure"}, {"score": 0.0035858673522839407, "phrase": "long-term_research"}, {"score": 0.0034967186553667715, "phrase": "application_domains"}, {"score": 0.00326572165784246, "phrase": "domain_models"}, {"score": 0.0031845067058084583, "phrase": "mas_approach"}, {"score": 0.003161674440750158, "phrase": "simulation_purposes"}, {"score": 0.003071965703296204, "phrase": "available_tools"}, {"score": 0.0029740732099993706, "phrase": "agent_environment"}, {"score": 0.002952745241052452, "phrase": "interaction_mechanisms"}, {"score": 0.002584576723303367, "phrase": "mmass._design_issues"}, {"score": 0.0023536149458842992, "phrase": "conceptual_model"}, {"score": 0.0022058958906038466, "phrase": "agent_structured_environment"}, {"score": 0.0021049977753042253, "phrase": "agent_actions"}], "paper_keywords": [""], "paper_abstract": "The paper introduces some issues and related solutions adopted in order to realize the MMASS platform. This is a framework to specify and execute simulation applications based on the multilayered multi-agent situated system model (MMASS). MMASS is a model for multi-agent systems (MAS) situated in an environment whose structure is explicitly defined. The behavior and interaction models of MMASS agents are strongly related to the spatial structure of their environment. The MMASS model is the result of a long-term research that has its roots and motivations on application domains and problems that require spatial features to be considered. Our experiences with these problems have concerned the design of domain models and their implementations, according to the MAS approach for simulation purposes. This activity has revealed that currently available tools do not support the management of spatial features of agent environment and interaction mechanisms defined by the MMASS model and thus they are not suitable for our purposes. The paper focuses on the MMASS platform that aims to support the specification and development of applications (mainly, simulations) based on MMASS. Design issues and related solutions that have been adopted in order to manage those aspects that characterize the MMASS model will be shown. After a description of the conceptual model that underlies the MMASS platform and its general architecture, we will overview how the platform supports the specification of agent structured environment, behavior and interaction, and how it supports the execution of agent actions and interactions. Then we will describe issues and adopted solutions (both algorithmic and implementative ones) to manage at-a-distance interaction among MMASS agents.", "paper_title": "Toward a platform for multi-layered multi-agent situated system (MMASS)-based simulations: Focusing on field diffusion", "paper_id": "WOS:000236388900011"}