{"auto_keywords": [{"score": 0.029790074854292515, "phrase": "moore"}, {"score": 0.00481495049065317, "phrase": "information_technology"}, {"score": 0.004024242000713225, "phrase": "occupational_or_organizational_norms"}, {"score": 0.0037743802306714545, "phrase": "display_norms"}, {"score": 0.0033845816848753073, "phrase": "emotional_display"}, {"score": 0.0033200826267264383, "phrase": "employee's_felt_emotion"}, {"score": 0.0030741085942960814, "phrase": "exhaustion_job_satisfaction"}, {"score": 0.0026693851900137953, "phrase": "emotional_dissonance"}, {"score": 0.002378114613631841, "phrase": "role_ambiguity"}, {"score": 0.002347775213789611, "phrase": "work_exhaustion"}, {"score": 0.0023029886389559122, "phrase": "turn_job_satisfaction"}, {"score": 0.002273605493468005, "phrase": "employee_turnover_intention"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["IT workforce", " emotional dissonance", " work exhaustion", " turnover intention", " job satisfaction"], "paper_abstract": "The information technology professional regularly expected to work with colleagues in both IT and other areas of the organization. During these interactions, the IT employee is expected to conform to occupational or organizational norms regarding the display of emotion. How do these display norms affect the IT professional? This study examines an IT professional's emotional dissonance, the conflict between norms of emotional display and an employee's felt emotion. Emotional dissonance is studied as a factor of IT professionals work exhaustion Job satisfaction, and trunover intention, modeled as an extension to the work of Moore (2000a). The results indicate emotional dissonance predicts work exhaustion better than do perceived workload, role conflict, or role ambiguity, constructs which have long been associated with work exhaustion. Job satisfaction is influenced directly by role ambiguity and work exhaustion. In turn job satisfaction influences employee turnover intention. We discuss implications of these findings for both IT management and future research.", "paper_title": "Emotional dissonance and the information technology professional", "paper_id": "WOS:000258859700009"}