{"auto_keywords": [{"score": 0.036878849518784715, "phrase": "proposed_scheme"}, {"score": 0.03275097241605011, "phrase": "energy_consumption"}, {"score": 0.029332667264960744, "phrase": "available_networks"}, {"score": 0.00481495049065317, "phrase": "iot_communications"}, {"score": 0.004460309246062286, "phrase": "essential_competences"}, {"score": 0.00410645614623058, "phrase": "heterogeneous_mobile_ad_hoc_network"}, {"score": 0.0038981499110532273, "phrase": "mobile_node"}, {"score": 0.0038271712887391015, "phrase": "target_network"}, {"score": 0.0037921662574137535, "phrase": "energy_efficient_scanning"}, {"score": 0.003769006950727621, "phrase": "efficient_handover"}, {"score": 0.0036218682585355895, "phrase": "vertical_handover_scheme"}, {"score": 0.003534180765325899, "phrase": "appropriate_network"}, {"score": 0.0031747618267940155, "phrase": "network_selection_process"}, {"score": 0.0030695103543472908, "phrase": "particular_application"}, {"score": 0.0029411166562130766, "phrase": "mn"}, {"score": 0.002878140062594849, "phrase": "highest_quality"}, {"score": 0.0025537472239953807, "phrase": "selected_network"}, {"score": 0.0025226117209113737, "phrase": "five_parameters"}, {"score": 0.0024766170166319735, "phrase": "bit_error_rate"}, {"score": 0.0023798115577749225, "phrase": "numerical_and_experimental_results"}, {"score": 0.0021772489804440646, "phrase": "handoff_related_parameters"}, {"score": 0.0021441057555396013, "phrase": "significant_improvement"}, {"score": 0.002124461969404541, "phrase": "existing_models"}, {"score": 0.0021049977753042253, "phrase": "similar_purpose"}], "paper_keywords": [""], "paper_abstract": "Machine-to-Machine (M2M) communications framework is evolving to sustain faster networks with the potential to connect millions of devices in the following years. M2M is one of the essential competences for implementing Internet of Things (IoT). Therefore, various organizations are now focusing on enhancing improvements into their standards to support M2M communications. Thus, Heterogeneous Mobile Ad Hoc Network (HetMANET) can normally be considered appropriate for M2M challenges. These challenges incorporated when a mobile node (MN) selects a target network in an energy efficient scanning for efficient handover. Therefore, to cope with these constraints, we proposed a vertical handover scheme for handover triggering and selection of an appropriate network. The proposed scheme is composed of two phases. Firstly, the MNs perform handover triggering based on the optimization of the Receive Signal Strength (RSS) from an access point/base station (AP/BS). Secondly, the network selection process is performed by considering the cost and energy consumption of a particular application during handover. Moreover, if there are more networks available, then the MN selects the one provided with the highest quality of service (QoS). The decision regarding the selection of available networks is made on three metrics, that is, cost, energy, and data rate. Furthermore, the selection of an AP/BS of the selected network is made on five parameters: delay, jitter, Bit Error Rate (BER), communication cost, and response time. The numerical and experimental results are compared in the context of energy consumption by an MN, traffic management on an AP/BS, and QoS of the available networks. The proposed scheme efficiently optimizes the handoff related parameters, and it shows significant improvement in the existing models used for similar purpose.", "paper_title": "Power Aware Mobility Management of M2M for IoT Communications", "paper_id": "WOS:000363632800001"}