{"auto_keywords": [{"score": 0.03207271611039307, "phrase": "manifold_dimension"}, {"score": 0.008432059424047041, "phrase": "signal's_manifold_dimension"}, {"score": 0.008017047830027633, "phrase": "noiseless_case"}, {"score": 0.00481495049065317, "phrase": "effective_measure"}, {"score": 0.004788265996598997, "phrase": "dimension"}, {"score": 0.004650175539595746, "phrase": "low-dimensional_models"}, {"score": 0.004606219233601922, "phrase": "recent_decade"}, {"score": 0.004255639740735269, "phrase": "relatively_small_number"}, {"score": 0.004149166224411185, "phrase": "compressed_sensing"}, {"score": 0.004032551494961167, "phrase": "matrix_completion"}, {"score": 0.0038698476651328898, "phrase": "logarithmic_factor"}, {"score": 0.0037610536973798113, "phrase": "new_natural_low-dimensional_signal_model"}, {"score": 0.00369022262431101, "phrase": "cosparse_analysis"}, {"score": 0.003474575242120264, "phrase": "combinatorial_search"}, {"score": 0.0027479040199262393, "phrase": "real_barrier"}, {"score": 0.002713260031399583, "phrase": "cosparse_signals"}, {"score": 0.002522344964242888, "phrase": "cosparse_signal"}, {"score": 0.002300610527451917, "phrase": "numerical_simulations"}, {"score": 0.0022572213326336374, "phrase": "convex_relaxations"}, {"score": 0.0021454671611847507, "phrase": "practical_counterexample"}, {"score": 0.0021251363422701446, "phrase": "growing_literature"}, {"score": 0.0021049977753042253, "phrase": "compressed_acquisition"}], "paper_keywords": ["Compressed sensing", " sparse representations", " manifold dimension", " total variation", " the analysis model"], "paper_abstract": "Many applications have benefited remarkably from low-dimensional models in the recent decade. The fact that many signals, though high dimensional, are intrinsically low dimensional has given the possibility to recover them stably from a relatively small number of their measurements. For example, in compressed sensing with the standard (synthesis) sparsity prior and in matrix completion, the number of measurements needed is proportional (up to a logarithmic factor) to the signal's manifold dimension. Recently, a new natural low-dimensional signal model has been proposed: the cosparse analysis prior. In the noiseless case, it is possible to recover signals from this model, using a combinatorial search, from a number of measurements proportional to the signal's manifold dimension. However, if we ask for stability to noise or an efficient (polynomial complexity) solver, all the existing results demand a number of measurements, which is far removed from the manifold dimension, sometimes far greater. Thus, it is natural to ask whether this gap is a deficiency of the theory and the solvers, or if there exists a real barrier in recovering the cosparse signals by relying only on their manifold dimension. Is there an algorithm which, in the presence of noise, can accurately recover a cosparse signal from a number of measurements proportional to the manifold dimension? In this paper, we prove that there is no such algorithm. Furthermore, we show through the numerical simulations that even in the noiseless case convex relaxations fail when the number of measurements is comparable with the manifold dimension. This gives a practical counterexample to the growing literature on the compressed acquisition of signals based on manifold dimension.", "paper_title": "On the Effective Measure of Dimension in the Analysis Cosparse Model", "paper_id": "WOS:000361486800035"}