{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "management_commitments"}, {"score": 0.004737579882204798, "phrase": "business_impact"}, {"score": 0.00436890075128947, "phrase": "growing_number"}, {"score": 0.004321952227344232, "phrase": "it-related_opportunities"}, {"score": 0.004028796143006953, "phrase": "firm-wide_commitments"}, {"score": 0.003695040819303525, "phrase": "small_set"}, {"score": 0.0025717770066591076, "phrase": "higher_business_impact"}, {"score": 0.0024495111090152857, "phrase": "higher_financial_performance"}, {"score": 0.002222102813520549, "phrase": "overarching_concept"}, {"score": 0.0021394674440767124, "phrase": "important_management_practices"}, {"score": 0.0021049977753042253, "phrase": "previous_work"}], "paper_keywords": ["business value of IT", " information systems and organizational change", " case studies", " survey", " firm performance", " commitment"], "paper_abstract": "As digitization becomes pervasive, many organizations struggle to drive value from the growing number of IT-related opportunities. We show how the drivers of IT value creation can be framed as firm-wide commitments to a set of IT capabilities. On the basis of 20 published case studies, we identify a small set of IT decisions that organizations must make to use IT to successfully enhance their impact. We group these decisions into a framework of four commitments. Making these commitments helps organizations reinforce what really matters over time, which in turn helps focus the attention of their employees. We demonstrate, via a survey of 210 publicly traded firms, that firms which are more effective in making these four commitments have higher business impact from IT, which in turn correlates with higher financial performance. We suggest the construct of commitment is a step toward unifying the IT value literature and creating an overarching concept that brings together many of the important management practices identified in previous work.", "paper_title": "Management commitments that maximize business impact from IT", "paper_id": "WOS:000336890300002"}