{"auto_keywords": [{"score": 0.04660802533264657, "phrase": "delete_effects"}, {"score": 0.025248171746263842, "phrase": "\"typical\"_problems"}, {"score": 0.00481495049065317, "phrase": "classical_planning"}, {"score": 0.004755054742217193, "phrase": "problem_abstractions"}, {"score": 0.00422177384286051, "phrase": "seminal_classical_planning_heuristics"}, {"score": 0.004015458740397976, "phrase": "conceptual_tools"}, {"score": 0.0036324746826127997, "phrase": "optimal_cost_solutions"}, {"score": 0.0033905067962602515, "phrase": "heuristic-search_classical_planning"}, {"score": 0.0031845067058084583, "phrase": "novel_heuristic_function"}, {"score": 0.003125175084962886, "phrase": "\"informed\"_set-structured_cost_estimates"}, {"score": 0.0028986672783671147, "phrase": "clear_evidence"}, {"score": 0.0027916287357898544, "phrase": "heuristic_estimate"}, {"score": 0.0021049977753042253, "phrase": "formal_account"}], "paper_keywords": ["Planning", " Heuristic search", " Cost sharing"], "paper_abstract": "Problem abstractions based on (either completely or partially) ignoring delete effects of the actions provide the basis for some seminal classical planning heuristics. However, the palette of the conceptual tools exploited by these heuristics remains rather limited. We study a framework for approximating the optimal cost solutions for problems with no delete effects that bridges between certain works on heuristic-search classical planning and on probabilistic reasoning. Our analysis results in developing a novel heuristic function that combines \"informed\" set-structured cost estimates and \"conservative\" action cost sharing. Our empirical comparative evaluation provides a clear evidence for the attractiveness of this heuristic estimate. In addition, we examine a (suggested before in the context of probabilistic reasoning) admissible heuristic based on a stronger variant of action cost sharing. We show that what is good for \"typical\" problems of probabilistic reasoning turns out not to be so for \"typical\" problems of classical planning, and provide a formal account for that difference.", "paper_title": "Set-structured and cost-sharing heuristics for classical planning", "paper_id": "WOS:000274497700005"}