{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "qspr_models"}, {"score": 0.006955839596976286, "phrase": "classical_metrics"}, {"score": 0.004781777766309739, "phrase": "quantitative_structure_property_relationship"}, {"score": 0.0045088388224419, "phrase": "new_chemicals"}, {"score": 0.004477765573115626, "phrase": "validation_strategies"}, {"score": 0.004050442607427367, "phrase": "internal_validation"}, {"score": 0.0034305738274625634, "phrase": "present_attempt"}, {"score": 0.0033951334049808733, "phrase": "additional_variants"}, {"score": 0.0028852371404397862, "phrase": "training_and_test_sets"}, {"score": 0.0027582072733520475, "phrase": "training_set_compounds"}, {"score": 0.0026643006135750025, "phrase": "test_set_compounds"}, {"score": 0.0026004698404274483, "phrase": "particular_data"}, {"score": 0.00246877952076635, "phrase": "different_validation_metrics"}, {"score": 0.002426378123762607, "phrase": "different_variants"}, {"score": 0.0024096216848276094, "phrase": "e_metrics"}, {"score": 0.002164180792169302, "phrase": "predictive_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["QSPR", " QSAR", " QSTR", " Validation", " r(m)(2)"], "paper_abstract": "Quantitative structure property relationship (QSPR) models are widely used for prediction of properties, activities and/or toxicities of new chemicals. Validation strategies check the reliability of predictions of QSPR models. The classical metrics like Q(2) and R-pred(2) (Q(ext)(2)) are commonly used, besides other techniques, for internal validation (mostly leave-one-out) and external validation (test set validation) respectively. Recently, we have proposed a set of novel r(m)(2) metrics which has been extensively used by us and other research groups for validation of QSPR models. In the present attempt, some additional variants of r(m)(2) metrics have been proposed and their applications in judging the quality of predictions of QSPR models have been shown by analyzing results of the QSPR models obtained from three different data sets (n = 119, 90, and 384). In each case, 50 combinations of training and test sets have been generated, and models have been developed based on the training set compounds and subsequently applied for prediction of responses of the test set compounds. Finally, models for a particular data set have been ranked according to the quality of predictions. The role of different validation metrics (including classical metrics and different variants of e metrics) in differentiating the \"good\" (predictive) models from the \"bad\" (low predictive) models has been studied. Finally, a set of guidelines has been proposed for checking the predictive quality of QSPR models. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Further exploring r(m)(2) metrics for validation of QSPR models", "paper_id": "WOS:000291714700023"}