{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "linux"}, {"score": 0.01027073690670819, "phrase": "chou_et_al"}, {"score": 0.009796517046114958, "phrase": "linux_versions"}, {"score": 0.008656329630549707, "phrase": "research_efforts"}, {"score": 0.004475436844227947, "phrase": "static_analyzer"}, {"score": 0.0043464021636703066, "phrase": "major_result"}, {"score": 0.004252063063815893, "phrase": "drivers_directory"}, {"score": 0.0038380787059463075, "phrase": "driver_code"}, {"score": 0.003541182515693916, "phrase": "new_development"}, {"score": 0.0035153544006182834, "phrase": "release_model"}, {"score": 0.003376619185594497, "phrase": "code_quality"}, {"score": 0.003327534497764259, "phrase": "still_a_major_problem"}, {"score": 0.002632272952905934, "phrase": "large_part"}, {"score": 0.0026035011274172753, "phrase": "kernel_code"}, {"score": 0.0024373408958597645, "phrase": "hal"}, {"score": 0.0021049977753042253, "phrase": "public_archive"}], "paper_keywords": ["Reliability", " Experimentation", " Measurement", " Linux", " fault-finding tools"], "paper_abstract": "In 2001, Chou et al. published a study of faults found by applying a static analyzer to Linux versions 1.0 through 2.4.1. A major result of their work was that the drivers directory contained up to 7 times more of certain kinds of faults than other directories. This result inspired a number of development and research efforts on improving the reliability of driver code. Today Linux is used in a much wider range of environments, provides a much wider range of services, and has adopted a new development and release model. What has been the impact of these changes on code quality? Are drivers still a major problem? To answer these questions, we have transported the experiments of Chou et al. to Linux versions 2.6.0 to 2.6.33, released between late 2003 and early 2010. We find that Linux has more than doubled in size during this period, but that the number of faults per line of code has been decreasing. And, even though drivers still accounts for a large part of the kernel code and contains the most faults, its fault rate is now below that of other directories, such as arch (HAL) and fs (file systems). These results can guide further development and research efforts. To enable others to continually update these results as Linux evolves, we define our experimental protocol and make our checkers and results available in a public archive.", "paper_title": "Faults in Linux: Ten Years Later", "paper_id": "WOS:000290854400025"}