{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_imputation"}, {"score": 0.004725787037228084, "phrase": "unknown_or_missing_data"}, {"score": 0.004673079747693193, "phrase": "crucial_task"}, {"score": 0.004586531354697466, "phrase": "biomedical_datasets"}, {"score": 0.0043363441738461335, "phrase": "incomplete_vectors"}, {"score": 0.004240116703465252, "phrase": "missing_values"}, {"score": 0.003934456513187142, "phrase": "incomplete_data"}, {"score": 0.003719705944877787, "phrase": "machine_learning_applications"}, {"score": 0.003637112258469488, "phrase": "effective_missing_value_estimation_methods"}, {"score": 0.003583067515485422, "phrase": "different_methods"}, {"score": 0.003543059748318891, "phrase": "data_imputations"}, {"score": 0.0034001358540125303, "phrase": "appropriate_technique"}, {"score": 0.002916238693326477, "phrase": "microarray_datasets"}, {"score": 0.0028301536956600137, "phrase": "huge_computational_resources"}, {"score": 0.0027057544777834086, "phrase": "public_software_application"}, {"score": 0.002655544981260646, "phrase": "computing_capabilities"}, {"score": 0.00252930673503721, "phrase": "new_public_tool"}, {"score": 0.00244543519230361, "phrase": "computer_cluster"}, {"score": 0.0024000447011533078, "phrase": "high_computational_tasks"}, {"score": 0.002260367486652148, "phrase": "registered_users"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Imputation", " Missing data", " Machine learning", " Web application"], "paper_abstract": "The imputation of unknown or missing data is a crucial task on the analysis of biomedical datasets. There are several situations where it is necessary to classify or identify instances given incomplete vectors, and the existence of missing values can much degrade the performance of the algorithms used for the classification/recognition. The task of learning accurately from incomplete data raises a number of issues some of which have not been completely solved in machine learning applications. In this sense, effective missing value estimation methods are required. Different methods for missing data imputations exist but most of the times the selection of the appropriate technique involves testing several methods, comparing them and choosing the right one. Furthermore, applying these methods, in most cases, is not straightforward, as they involve several technical details, and in particular in cases such as when dealing with microarray datasets, the application of the methods requires huge computational resources. As far as we know, there is not a public software application that can provide the computing capabilities required for carrying the task of data imputation. This paper presents a new public tool for missing data imputation that is attached to a computer cluster in order to execute high computational tasks. The software WIMP (Web IMPutation) is a public available web site where registered users can create, execute, analyze and store their simulations related to missing data imputation. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "WIMP: Web server tool for missing data imputation", "paper_id": "WOS:000311976100034"}