{"auto_keywords": [{"score": 0.04247114644429954, "phrase": "hydrogen_gas"}, {"score": 0.00481495049065317, "phrase": "nanowire_networks"}, {"score": 0.004723847090183984, "phrase": "dynamic_environment"}, {"score": 0.004678940805063634, "phrase": "recent_advances"}, {"score": 0.004397230847865867, "phrase": "hydrogen_gas_nanosensors"}, {"score": 0.004132411680987228, "phrase": "ultra_small_palladium_nanowires"}, {"score": 0.003902085339580381, "phrase": "discrete_random_variable"}, {"score": 0.0028053237950173508, "phrase": "nanoscale_components"}, {"score": 0.002778604641920052, "phrase": "unique_difficulties"}, {"score": 0.002524982927936405, "phrase": "flexible_model"}, {"score": 0.0024652715040303416, "phrase": "unknown_characteristics"}, {"score": 0.0021049977753042253, "phrase": "reasonable_choice"}], "paper_keywords": ["Bernoulli random variable", " dynamic environment", " majorization", " percolation", " Scur-convex", " site percolation"], "paper_abstract": "Recent advances in nanotechnology have provided the opportunity to significantly enhance the performance of hydrogen gas nanosensors. Our research focuses on the reliability of one particular nanosensor, a network of ultra small palladium nanowires, which detects hydrogen gas through a change in resistivity. The discrete random variable, representing the lifetime of the nanosensor, is defined as the number of exposures to, or cycles of, hydrogen gas that the nanosensor can withstand before it no longer functions. The nanosensor is modeled, and the reliability is analyzed under the assumption that the nanosensor is performing in an environment where the probability of a nanowire breaking changes after each cycle of hydrogen gas. Nanoscale components present unique difficulties when evaluating the reliability of any device. We attempt to resolve some of these issues by creating a flexible model that allows for the unknown characteristics of the nanosensor to be accounted for. Although this work is motivated by one particular nanosensor, our results can also be applied to assess the reliability of any nanodevice where our proposed model is a reasonable choice.", "paper_title": "Reliability of Sensors Based on Nanowire Networks Operating in a Dynamic Environment", "paper_id": "WOS:000327953900016"}