{"auto_keywords": [{"score": 0.049522654987196275, "phrase": "measurement_independence"}, {"score": 0.04915532646265492, "phrase": "fine_tuning"}, {"score": 0.047357133829478835, "phrase": "invariant_set"}, {"score": 0.0451128146367674, "phrase": "cosmological_invariant_set_postulate"}, {"score": 0.027612944106591132, "phrase": "quantum_theory"}, {"score": 0.00481495049065317, "phrase": "invariant_set_theory"}, {"score": 0.004612896435506914, "phrase": "free_will"}, {"score": 0.0044192837023190445, "phrase": "locally_causal_ontic_theory"}, {"score": 0.004168240841388958, "phrase": "deterministic_dynamical_system"}, {"score": 0.003916098498242888, "phrase": "bell_inequalities"}, {"score": 0.0035940277928341265, "phrase": "experimenter_free_will"}, {"score": 0.0032727116186194584, "phrase": "conventional_ontic_models"}, {"score": 0.0032094634756436595, "phrase": "zero_measure"}, {"score": 0.0031474338010045386, "phrase": "cantor_set"}, {"score": 0.0030865992688177005, "phrase": "p-adic_integers"}, {"score": 0.002681859084438076, "phrase": "technical_means"}, {"score": 0.00253916011199984, "phrase": "singular_limit"}, {"score": 0.002366763442497185, "phrase": "top-down_constraint"}, {"score": 0.0022939396079753463, "phrase": "gravitational_and_quantum_physics"}, {"score": 0.0022407927161620855, "phrase": "gravitational_theory"}], "paper_keywords": [""], "paper_abstract": "Invariant Set (IS) theory is a locally causal ontic theory of physics based on the Cosmological Invariant Set postulate that the universe U can be considered a deterministic dynamical system evolving precisely on a (suitably constructed) fractal dynamically invariant set in U's state space. IS theory violates the Bell inequalities by violating Measurement Independence. Despite this, IS theory is not fine tuned, is not conspiratorial, does not constrain experimenter free will and does not invoke retrocausality. The reasons behind these claims are discussed in this paper. These arise fromproperties not found in conventional ontic models: the invariant set has zero measure in its Euclidean embedding space, has Cantor Set structure homeomorphic to the p-adic integers (p >>> 0) and is non-computable. In particular, it is shown that the p-adic metric encapulates the physics of the Cosmological Invariant Set postulate, and provides the technical means to demonstrate no fine tuning or conspiracy. Quantum theory can be viewed as the singular limit of IS theory when when p is set equal to infinity. Since it is based around a top-down constraint from cosmology, IS theory suggests that gravitational and quantum physics will be unified by a gravitational theory of the quantum, rather than a quantum theory of gravity. Some implications arising from such a perspective are discussed.", "paper_title": "Invariant Set Theory: Violating Measurement Independence without Fine Tuning, Conspiracy, Constraints on Free Will or Retrocausality", "paper_id": "WOS:000367346600022"}