{"auto_keywords": [{"score": 0.025981753614250383, "phrase": "distributed_team_members"}, {"score": 0.00481495049065317, "phrase": "distributed_work"}, {"score": 0.004708056866527125, "phrase": "onsite_and_offshore_vendor_teams"}, {"score": 0.004322967486451877, "phrase": "central_concern"}, {"score": 0.0042650992966174065, "phrase": "distributed_work_literature"}, {"score": 0.0040777192615062815, "phrase": "socio-cognitive_acts"}, {"score": 0.0037948184359488284, "phrase": "case_study"}, {"score": 0.00374399358035391, "phrase": "geographically_distributed_information_systems_development_project"}, {"score": 0.003677280504320636, "phrase": "india's_largest_offshore_vendors"}, {"score": 0.0034685354330506605, "phrase": "task_characteristics"}, {"score": 0.003256922225995089, "phrase": "onsite_and_offshore_team_members"}, {"score": 0.002845809662579165, "phrase": "congruent_and_actionable_understandings"}, {"score": 0.0027206133859493725, "phrase": "novel_understandings"}, {"score": 0.0023770362063833903, "phrase": "transfer_preexisting_understandings"}, {"score": 0.0023451553255837317, "phrase": "cocreate_novel_understandings"}, {"score": 0.0021049977753042253, "phrase": "distributed_workers"}], "paper_keywords": ["understanding", " offshore", " information systems development", " ISD", " social cognition", " sensegiving", " sensemaking", " sensedemanding", " sensebreaking", " value creation"], "paper_abstract": "Achieving shared, common, or mutual understandings among geographically dispersed workers is a central concern in the distributed work literature. Nonetheless, little is known yet about the socio-cognitive acts and communication processes involved with synchronizing and cocreating understandings in such settings. Building on a case study of a geographically distributed information systems development project at one of India's largest offshore vendors, we postulate that knowledge and experience asymmetries, and requirements and task characteristics (such as complexity, instability, ambiguity, and novelty) prompt onsite and offshore team members to engage in acts of sensegiving, sensedemanding, and sensebreaking. This allows them to make sense of their tasks and their environment, and it increases the likelihood that congruent and actionable understandings emerge. Furthermore, it assists them in cocreating novel understandings, especially when acts of sensegiving and sensedemanding are complemented with instances of sensebreaking. Our results contribute to the literature by explaining how distributed team members mitigate problems of understanding, transfer preexisting understandings, and cocreate novel understandings. Acts of sensegiving, sensedemanding, and sensebreaking allow distributed team members to jointly explore and generate value, thereby amplifying the performance of distributed workers.", "paper_title": "Cocreating understanding and value in distributed work: How members of onsite and offshore vendor teams give, make, demand, and break sense", "paper_id": "WOS:000256271400003"}