{"auto_keywords": [{"score": 0.03648530308667908, "phrase": "slow_traffic"}, {"score": 0.00481495049065317, "phrase": "computer_vision-based_traffic_monitoring_system"}, {"score": 0.004466519142879166, "phrase": "main_traffic_variables"}, {"score": 0.004167218012926657, "phrase": "complete_set"}, {"score": 0.004119313626110943, "phrase": "statistical_variables"}, {"score": 0.0038431888954930083, "phrase": "existing_traffic_systems"}, {"score": 0.003777088546146369, "phrase": "balanced_accuracy"}, {"score": 0.0035442655396704724, "phrase": "heavy_vehicles"}, {"score": 0.0032122679403131537, "phrase": "long_periods"}, {"score": 0.003138768436081888, "phrase": "human_intervention"}, {"score": 0.003031650815900696, "phrase": "changing_environmental_conditions"}, {"score": 0.0023228223366301226, "phrase": "heavy_vehicle_identification"}, {"score": 0.0022305310659333864, "phrase": "specific_methodology"}, {"score": 0.0021049977753042253, "phrase": "different_methods"}], "paper_keywords": [""], "paper_abstract": "In this paper we describe a computer vision-based traffic monitoring system able to detect individual vehicles in real-time. Our fully integrated system first obtains the main traffic variables: counting, speed and category; and then computes a complete set of statistical variables. The objective is to investigate some of the difficulties impeding existing traffic systems to achieve balanced accuracy in every condition; i.e. day and night transitions, shadows, heavy vehicles, occlusions, slow traffic and congestions. The system we present is autonomous, works for long periods of time without human intervention and adapts automatically to the changing environmental conditions. Several innovations, designed to deal with the above circumstances, are proposed in the paper: an integrated calibration and image rectification step, differentiated methods for day and night, an adaptive segmentation algorithm, a multistage shadow detection method and special considerations for heavy vehicle identification and treatment of slow traffic. A specific methodology has been developed to benchmark the accuracy of the different methods proposed.", "paper_title": "An adaptive, real-time, traffic monitoring system", "paper_id": "WOS:000277415700011"}