{"auto_keywords": [{"score": 0.05007820304388614, "phrase": "umn-mapserver"}, {"score": 0.045620393012770176, "phrase": "internet_technologies"}, {"score": 0.02620095076944781, "phrase": "wms"}, {"score": 0.02598468129300403, "phrase": "wcs"}, {"score": 0.02576996237862411, "phrase": "gml"}, {"score": 0.004404994123834589, "phrase": "recent_advances"}, {"score": 0.004294381488413906, "phrase": "wide_adoption"}, {"score": 0.004240116703465252, "phrase": "web_services_paradigm"}, {"score": 0.004204320052179726, "phrase": "interoperability_standards"}, {"score": 0.004064117897000019, "phrase": "geo-spatial_information_distribution"}, {"score": 0.0040298010803060495, "phrase": "online_geo-processing"}, {"score": 0.003797530813314321, "phrase": "web_gises"}, {"score": 0.0033295966773779174, "phrase": "system_performance"}, {"score": 0.0031912706211861324, "phrase": "client-side_web_gises"}, {"score": 0.0028822153400215973, "phrase": "regional_natural_resource_mapping"}, {"score": 0.002833689453299307, "phrase": "nrams"}, {"score": 0.0027741761880779535, "phrase": "biweekly_avhrr_imagery"}, {"score": 0.002401245209275692, "phrase": "wfs."}, {"score": 0.002205692205167157, "phrase": "interoperability_point"}], "paper_keywords": ["WebGIS", " WMS", " WMT", " GML", " WFS", " load-balancing architecture"], "paper_abstract": "Recent advances in Internet technologies, coupled with wide adoption of the web services paradigm and interoperability standards, makes the World Wide Web a popular vehicle for geo-spatial information distribution and online geo-processing. Web GIS is rapidly evolving and adapting to advances in Internet technologies. Web GISes are predominantly designed under a \"thin-client/fat-server\" paradigm. This approach has several disadvantages. For example, as the number of users increases, the load on the server increases and system performance decreases. Recently the focus has been shifted towards client-side Web GISes, which are heavy-duty, stand-alone systems. We take an opposing approach and present a load balancing client/server Web-based spatial analysis system, UMN-MapServer, and evaluate its performance in a regional natural resource mapping and analysis (NRAMS) application which utilizes biweekly AVHRR imagery and several other raster and vector geo-spatial datasets. We also evaluate alternative approaches and assess the pros and cons of our design and implementation. UMN-MapServer also implements several open standards, such as, WMS, WCS, GML and WFS. In this paper, we also describe in detail the WMS, WCS,and GML extensions from the interoperability point of view, and discuss issues related to adoption of such standards.", "paper_title": "UMN-MapServer: A high-performance, interoperable, and open source web mapping and geo-spatial analysis system", "paper_id": "WOS:000241576100026"}