{"auto_keywords": [{"score": 0.04973625252864221, "phrase": "chest-wall_deformity"}, {"score": 0.009744437023978215, "phrase": "fully_automatic_algorithm"}, {"score": 0.007603107618106526, "phrase": "chest_patients"}, {"score": 0.005852350678536401, "phrase": "initialization_processes"}, {"score": 0.005707177397548649, "phrase": "ct_images"}, {"score": 0.005254927699711176, "phrase": "proposed_algorithm"}, {"score": 0.00481495049065317, "phrase": "quantitative_assessment"}, {"score": 0.004595263305771512, "phrase": "computerized_technique"}, {"score": 0.004406869115238945, "phrase": "semi-automatic_algorithm"}, {"score": 0.004354149483556514, "phrase": "active_contour_model"}, {"score": 0.004276610897002087, "phrase": "quantitative_indices"}, {"score": 0.004215571179806372, "phrase": "patient's_ct_image"}, {"score": 0.004110831924517065, "phrase": "manual_initialization_processes"}, {"score": 0.004023120753104693, "phrase": "additional_training_processes"}, {"score": 0.00397996666534913, "phrase": "engineering_contents"}, {"score": 0.0034467717443162015, "phrase": "histogram_analysis"}, {"score": 0.0034220655476652683, "phrase": "point_detection"}, {"score": 0.003385336776758738, "phrase": "object_recognition"}, {"score": 0.0025752890978323873, "phrase": "whole_index_calculation_process"}, {"score": 0.0023536149458842992, "phrase": "significant_difference"}, {"score": 0.002245975340642921, "phrase": "relatively_shorter_processing_time"}, {"score": 0.0021202154023229123, "phrase": "funnel_chest_patients"}, {"score": 0.0021049977753042253, "phrase": "clinical_doctors"}], "paper_keywords": ["Fully automatic initialization", " Segmentation", " Active contour model", " Quantitative assessment index", " Funnel chest", " Chest-wall deformity"], "paper_abstract": "In our previous study, we developed a computerized technique that measured degree of chest-wall deformity in funnel chest patients using several image processing techniques, such as, active contour model. It could calculate quantitative indices for chest-wall deformity using patient's CT image. However, the algorithm contained manual initialization processes that required clinicians to obtain additional training processes to understand engineering contents and be familiar with the technique. In this study, we suggested a fully automatic algorithm that can measure the degree of chest-wall deformity by automating initialization processes. The initialization processes to segment CT images were automated by applying various image processing techniques such as histogram analysis, point detection, and object recognition. In order to evaluate the performance of the proposed algorithm, both the previous algorithm (semi-automatic) and newly suggested algorithm (fully automatic) were applied to preoperative CT images of 61 funnel chest patients to calculate several indices that represented chest-wall deformity quantitatively and to measure their processing time of our algorithm using a computer. The time required for initialization processes was 28.12 s using the semi-automatic algorithm and 0.07 s using the fully automatic algorithm (99.75% speed enhancement) and the time required for whole index calculation process was 61.12 s in semi-automatic algorithm and 30.09 s in fully automatic algorithm (50.76% speed enhancement). In most indices, calculation results of the two algorithms showed no significant difference between each other. The proposed algorithm could calculate chest-wall deformity more accurately with relatively shorter processing time than our previous method. Applying this algorithm is expected to facilitate more efficient diagnosis and evaluation processes of funnel chest patients for clinical doctors.", "paper_title": "Fully automatic initialization method for quantitative assessment of chest-wall deformity in funnel chest patients", "paper_id": "WOS:000278693900009"}