{"auto_keywords": [{"score": 0.004346139434813299, "phrase": "grand_challenges"}, {"score": 0.004287166497171827, "phrase": "high_performance_computing"}, {"score": 0.0038170129089059013, "phrase": "reasonable_time"}, {"score": 0.0037395458116642306, "phrase": "elaborate_evolutionary_models"}, {"score": 0.003613899384402803, "phrase": "severe_computational_cost"}, {"score": 0.00332924643541238, "phrase": "challenging_computational_burden"}, {"score": 0.0028641729745364952, "phrase": "high_performance_computing_techniques"}, {"score": 0.0026565317818265394, "phrase": "comprehensive_introduction"}, {"score": 0.002567180189640976, "phrase": "computational_evolutionary_biology"}, {"score": 0.002480826434008026, "phrase": "computing_background"}, {"score": 0.0022234951091677085, "phrase": "leading-edge_technical_and_algorithmic_developments"}, {"score": 0.0021340178074057245, "phrase": "open_problems"}, {"score": 0.0021049977753042253, "phrase": "potential_solutions"}], "paper_keywords": [""], "paper_abstract": "The computation of ever larger as well as more accurate phylogenetic (evolutionary) trees with the ultimate goal to compute the tree of life represents one of the grand challenges in High Performance Computing (HPC) Bioinformatics. Unfortunately, the size of trees which can be computed in reasonable time based on elaborate evolutionary models is limited by the severe computational cost inherent to these methods. There exist two orthogonal research directions to overcome this challenging computational burden: First, the development of novel, faster, and more accurate heuristic algorithms and second, the application of high performance computing techniques. The goal of this chapter is to provide a comprehensive introduction to the field of computational evolutionary biology to an audience with computing background, interested in participating in research and/or commercial applications of this field. Moreover, we will cover leading-edge technical and algorithmic developments in the field and discuss open problems and potential solutions.", "paper_title": "Computational grand challenges in assembling the tree of life: Problems and solutions", "paper_id": "WOS:000243217700004"}