{"auto_keywords": [{"score": 0.040838917851158764, "phrase": "pca-based_global_method"}, {"score": 0.027507999683207576, "phrase": "low_resolution_observation"}, {"score": 0.004342430078306461, "phrase": "alias_removal"}, {"score": 0.003775803846431323, "phrase": "super-resolved_image"}, {"score": 0.0037075456471849892, "phrase": "blurred_and_noisy_low_resolution_input"}, {"score": 0.0034465894339710864, "phrase": "best_edges"}, {"score": 0.0033230588808076267, "phrase": "image_database"}, {"score": 0.0029602552900111407, "phrase": "local_methods"}, {"score": 0.002751751956416832, "phrase": "local_and_global_approaches"}, {"score": 0.0024963543716522087, "phrase": "alias_removal_technique"}, {"score": 0.002436289099444074, "phrase": "alias-free_upsampling_scheme"}, {"score": 0.0023776656246300063, "phrase": "unknown_high_frequency_components"}, {"score": 0.0021966859554037174, "phrase": "interpolant_subject"}, {"score": 0.0021049977753042253, "phrase": "alias_free_spectral_components"}], "paper_keywords": ["super-resolution", " principal components", " wavelet", " contourlet decomposition", " filter banks", " edge primitives", " image interpolation", " aliasing"], "paper_abstract": "In this paper we study the usefulness of different local and global, learning-based, single-frame image super-resolution reconstruction techniques in handling three specific tasks, namely, de-blurring, de-noising and alias removal. We start with the global, iterative Papoulis-Gerchberg method for super-resolving a scene. Next we describe a PCA-based global method which faithfully reproduces a super-resolved image from a blurred and noisy low resolution input. We also study several multi-resolution processing schemes for super-resolution where the best edges are learned locally from an image database. We show that the PCA-based global method is efficient in handling blur and noise in the data. The local methods are adept in capturing the edges properly. However, both local and global approaches cannot properly handle the aliasing present in the low resolution observation. Hence we propose an alias removal technique by designing an alias-free upsampling scheme. Here the unknown high frequency components of the given partially aliased (low resolution) image is generated by minimizing the total variation of the interpolant subject to the constraint that part of alias free spectral components in the low resolution observation are known precisely and under the assumption of sparsity in the data.", "paper_title": "Single frame image super-resolution: should we process locally or globally?", "paper_id": "WOS:000246565700006"}