{"auto_keywords": [{"score": 0.03503987270340682, "phrase": "first_stage"}, {"score": 0.034539130410996904, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "simulated_annealing_meta-heuristic_algorithm"}, {"score": 0.004582528208024817, "phrase": "microarray_gene_expression_data"}, {"score": 0.004492717291734985, "phrase": "novel_two_stage_meta-heuristic_algorithm"}, {"score": 0.004254671386496732, "phrase": "main_aim"}, {"score": 0.00419195822011581, "phrase": "research_isto"}, {"score": 0.004130165601475531, "phrase": "powerful_data"}, {"score": 0.003989487818395848, "phrase": "highly_uncertain_environments"}, {"score": 0.0037407704200033607, "phrase": "clustering_algorithm"}, {"score": 0.0035249212996297332, "phrase": "meta-heuristic_optimization_framework"}, {"score": 0.003192406091820197, "phrase": "annealing_process"}, {"score": 0.0029490571526071016, "phrase": "second_stage"}, {"score": 0.0028203950416405585, "phrase": "heuristic_algorithm"}, {"score": 0.002592444377471345, "phrase": "better_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["General type-2 fuzzy sets", " Clustering", " Gene expression data", " Simulated annealing", " alpha-plane representation"], "paper_abstract": "This paper considers microarray gene expression data clustering using a novel two stage meta-heuristic algorithm based on the concept of alpha-planes in general type-2 fuzzy sets. The main aim of this research isto present a powerful data clustering approach capable of dealing with highly uncertain environments. In this regard, first, a new objective function using a-planes for general type-2 fuzzy c-means clustering algorithm is represented. Then, based on the philosophy of the meta-heuristic optimization framework 'Simulated Annealing', a two stage optimization algorithm is proposed. The first stage of the proposed approach is devoted to the annealing process accompanied by its proposed perturbation mechanisms. After termination of the first stage, its output is inserted to the second stage where it is checked with other possible local optima through a heuristic algorithm. The output of this stage is then re-entered to the first stage until no better solution is obtained. The proposed approach has been evaluated using several synthesized datasets and three microarray gene expression datasets. Extensive experiments demonstrate the capabilities of the proposed approach compared with some of the state-of-the-art techniques in the literature. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Alpha-plane based automatic general type-2 fuzzy clustering based on simulated annealing meta-heuristic algorithm for analyzing gene expression data", "paper_id": "WOS:000361412500035"}