{"auto_keywords": [{"score": 0.04974208475172307, "phrase": "hairpin_formations"}, {"score": 0.01287885093880505, "phrase": "regular_languages"}, {"score": 0.010960955380806558, "phrase": "first-order_definable_languages"}, {"score": 0.009260646843787189, "phrase": "manea_et_al"}, {"score": 0.00481495049065317, "phrase": "theoretical_properties"}, {"score": 0.00469740813902244, "phrase": "biochemical_processes"}, {"score": 0.004631527916092452, "phrase": "important_role"}, {"score": 0.004534428070512318, "phrase": "language_theoretical_properties"}, {"score": 0.004078502325220629, "phrase": "l._assume"}, {"score": 0.00388165472334023, "phrase": "mild_closure_property"}, {"score": 0.003800215925586887, "phrase": "restricted_concatenation"}, {"score": 0.0028437313714204087, "phrase": "open_question"}, {"score": 0.002180961427543987, "phrase": "lda"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Hairpin completion", " (iterated) Hairpin lengthening", " Regular languages", " Varieties"], "paper_abstract": "Hairpin formations arise in biochemical processes and play an important role in DNA-computing. We study language theoretical properties of hairpin formations and our new results concern the hairpin completion H-kappa(L-1, L-2) of two regular languages L-1 and L-2 and the iterated hairpin lengthening HL kappa*(L) of any language L. Assume that L-1 and L-2 belong to a certain variety of regular languages which satisfies a mild closure property (being closed by a restricted concatenation), then either H-kappa(L-1, L-2) is not regular or it belongs to the same variety as L-1 and L-2. This result applies, in particular, to the class of first-order definable languages (which is the class of aperiodic or star-free languages) and it applies to the class of first-order definable languages in two variables with predicates < and successor +1 (i.e., languages in the variety LDA). Furthermore, we solve an open question from Manea et al. [15]: we prove that regular languages are closed under iterated hairpin lengthening. (This has been independently shown in Manea et al. [16].) However, the result here is more precise: if L belongs to a class of languages which satisfies a certain closure property with respect to locally testable languages, then HL kappa*(L) belongs to the same class. This applies to the class of aperiodic languages and many other classes. We also show that the variety DA is not closed under the operation L -> HL kappa*(L). For LDA the situation remains open. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Language theoretical properties of hairpin formations", "paper_id": "WOS:000302822300007"}