{"auto_keywords": [{"score": 0.04835227522307675, "phrase": "unknown_target"}, {"score": 0.008713768692145006, "phrase": "planar_maps"}, {"score": 0.00461302961851157, "phrase": "planar_map"}, {"score": 0.0041316803676012155, "phrase": "linear_probes"}, {"score": 0.0039851554495614295, "phrase": "generalized_voronoi_diagrams"}, {"score": 0.0039341294012600085, "phrase": "general_purpose_reconstruction_algorithm"}, {"score": 0.002641360377825228, "phrase": "topological_sense"}, {"score": 0.00259320616168125, "phrase": "metric_sense"}, {"score": 0.0022797772939670063, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "simpler_alternative_method"}], "paper_keywords": ["approximation", " planar map", " random line", " Integral Geometry", " generalized", " Voronoi diagram"], "paper_abstract": "Given an unknown target planar map, we present an algorithm for constructing an approximation of the unknown target based on information gathered from linear probes of the target. Our algorithm is a general purpose reconstruction algorithm that can be applied in many settings. Our algorithm is particularly suited for the setting where computing the intersection of a line with an unknown target is much simpler than computing the unknown target itself. The algorithm maintains a triangulation from which the approximation of the unknown target can be extracted. We evaluate the quality of the approximation with respect to the target both in the topological sense and the metric sense. The correctness of the algorithm and the evaluation of its time complexity are also presented. Finally, we present some experimental results. For example, since generalized Voronoi diagrams are planar maps, our algorithm presents a simpler alternative method for constructing approximations of generalized Voronoi diagrams, which are notoriously difficult to compute.", "paper_title": "A general approximation algorithm for planar maps with applications", "paper_id": "WOS:000252048100001"}