{"auto_keywords": [{"score": 0.04979106692834644, "phrase": "mbd"}, {"score": 0.00481495049065317, "phrase": "minimum_barrier_distance"}, {"score": 0.004519491332356944, "phrase": "compact_subsets"}, {"score": 0.004478782833067256, "phrase": "euclidean_space_r-n"}, {"score": 0.004345706062641742, "phrase": "continuous_setting"}, {"score": 0.004267757384195032, "phrase": "simply_connected_region"}, {"score": 0.004091248980678087, "phrase": "digital_scene"}, {"score": 0.00399367108161192, "phrase": "minimal_value"}, {"score": 0.0039576799833721315, "phrase": "barrier_strength"}, {"score": 0.0037939470786850457, "phrase": "smallest_interval"}, {"score": 0.0030897670291134645, "phrase": "last_result"}, {"score": 0.0028477727736832283, "phrase": "efficient_computational_solution"}, {"score": 0.0022633993976138387, "phrase": "favorable_outcome"}, {"score": 0.002202651051682622, "phrase": "proposed_minimum_barrier_distance"}, {"score": 0.002169607777109063, "phrase": "different_imaging_tasks"}, {"score": 0.002143529653780496, "phrase": "image_segmentation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Image processing", " Distance function", " Distance transform", " Fuzzy subset", " Path strength"], "paper_abstract": "In this paper we introduce a minimum barrier distance, MBD, defined for the (graphs of) real-valued bounded functions f(A), whose domain D is a compact subsets of the Euclidean space R-n. The formulation of MBD is presented in the continuous setting, where D is a simply connected region in R-n, as well as in the case where D is a digital scene. The MBD is defined as the minimal value of the barrier strength of a path between the points, which constitutes the length of the smallest interval containing all values of f(A) along the path. We present several important properties of MBD, including the theorems: on the equivalence between the MBD rho(A) and its alternative definition phi(A); and on the convergence of their digital versions, (rho(A)) over cap and (phi(A)) over cap, to the continuous MBD rho(A) = phi(A) as we increase a precision of sampling. This last result provides an estimation of the discrepancy between the value of (rho(A)) over cap and of its approximation (phi(A)) over cap. An efficient computational solution for the approximation (phi(A)) over cap of (rho(A)) over cap is presented. We experimentally investigate the robustness of MBD to noise and blur, as well as its stability with respect to the change of a position of points within the same object (or its background). These experiments are used to compare MBD with other distance functions: fuzzy distance, geodesic distance, and max-arc distance. A favorable outcome for MBD of this comparison suggests that the proposed minimum barrier distance is potentially useful in different imaging tasks, such as image segmentation. (C) 2012 Elsevier Inc. All rights reserved(.)", "paper_title": "The minimum barrier distance", "paper_id": "WOS:000315556800012"}