{"auto_keywords": [{"score": 0.04281790003438998, "phrase": "coordinating_nurse"}, {"score": 0.00481495049065317, "phrase": "emergency-department_whiteboard"}, {"score": 0.0047306078475683865, "phrase": "coordinative_practices"}, {"score": 0.004506171772318298, "phrase": "joint_commitment"}, {"score": 0.004254558771304349, "phrase": "emergency_department"}, {"score": 0.003999217176949845, "phrase": "main_keeper"}, {"score": 0.003676926952533304, "phrase": "highly_intertwined_process"}, {"score": 0.0036445446531633368, "phrase": "technologically_mediated_visual_overview"}, {"score": 0.0035965032173588753, "phrase": "orally_communicated_details"}, {"score": 0.00354909279546064, "phrase": "oral_details"}, {"score": 0.003121719509312159, "phrase": "whiteboard_information"}, {"score": 0.002341094670523097, "phrase": "smooth_transitions"}, {"score": 0.002320449502337321, "phrase": "instrumental_and_communicative_coordination"}, {"score": 0.0022696277881969896, "phrase": "coordinative_function"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Overview", " Instrumental coordination", " Communicative coordination", " Whiteboard", " Large display groupware", " Healthcare"], "paper_abstract": "Whiteboards facilitate coordinative practices by making information publicly accessible and thereby strengthening communication and joint commitment about it. This study investigates how coordination is accomplished in an emergency department through interactions with the whiteboard and with the coordinating nurse, who is the main keeper of the whiteboard. On the basis of observations, we find that coordination is accomplished through a highly intertwined process of technologically mediated visual overview combined with orally communicated details. The oral details serve to clarify and elaborate information at a more fine-grained level than the overview information on the whiteboard, to negotiate and reach agreement about the decisions that underlie the whiteboard information, and as a safeguard against misunderstandings and errors. This process is contingent on the clinicians tending to perceive the whiteboard and the coordinating nurse as a unit in the sense that they frequently update the whiteboard by informing the coordinating nurse about the change and, similarly, consider making a change on the whiteboard the same as having informed the coordinating nurse. These smooth transitions between instrumental and communicative coordination are central to the coordinative function of the whiteboard. We discuss this and other implications for design. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Visual overview, oral detail: The use of an emergency-department whiteboard", "paper_id": "WOS:000360595400003"}