{"auto_keywords": [{"score": 0.035594612090225276, "phrase": "social_relations"}, {"score": 0.00481495049065317, "phrase": "nonplayer_characters'_emotions"}, {"score": 0.004566567411073082, "phrase": "main_challenges"}, {"score": 0.004470823343432748, "phrase": "video_game_industry"}, {"score": 0.004330941610682453, "phrase": "believable_nonplayer_characters"}, {"score": 0.004085713541752114, "phrase": "key_role"}, {"score": 0.003773449694108617, "phrase": "npcs'_behavior"}, {"score": 0.0030199761431186434, "phrase": "computer_science"}, {"score": 0.0029722900280316216, "phrase": "human_and_social_sciences"}, {"score": 0.002481588370380518, "phrase": "dynamic_model"}, {"score": 0.0024423826953133844, "phrase": "socioemotional_state"}, {"score": 0.002328434471939886, "phrase": "game_programmers"}], "paper_keywords": ["Emotions", " nonplayer character (NPC)", " personality", " social relations"], "paper_abstract": "One of the main challenges faced by the video game industry is to give life to believable nonplayer characters (NPCs). Research shows that emotions play a key role in determining the behavior of individuals. In order to improve the believability of NPCs' behavior, we propose in this paper a model of the dynamics of emotions taking into account the personality and the social relations of the character. First, we present work from the literature on emotions, personality, and social relations in computer science and in human and social sciences. We focus on the influence of personality on the triggering of emotions, and the influence of emotions on the dynamics of social relations. Based on this work, we propose a dynamic model of the socioemotional state and its implementation as part of a tool for game programmers. This tool aims at the simulation of the evolution of emotions and social relations of NPCs based on their personality and roles.", "paper_title": "Simulation of the Dynamics of Nonplayer Characters' Emotions and Social Relations in Games", "paper_id": "WOS:000208082100003"}