{"auto_keywords": [{"score": 0.04609324853438294, "phrase": "innermost_termination_modulo_permutative_theories"}, {"score": 0.03265371529136076, "phrase": "innermost_termination"}, {"score": 0.004506048850130758, "phrase": "modulo_permutative_theories"}, {"score": 0.004260134699483774, "phrase": "term_rewrite_systems"}, {"score": 0.003509006038574667, "phrase": "shallow_trs."}, {"score": 0.003403122817578447, "phrase": "shallow_trs"}, {"score": 0.0030414140732789186, "phrase": "decidability_results"}, {"score": 0.002875200380397413, "phrase": "right-flat_right-linear"}, {"score": 0.0025826247025542213, "phrase": "flat_terms"}, {"score": 0.0024918548761791435, "phrase": "right-flat_trs"}, {"score": 0.0024289743270061157, "phrase": "non-terminating_derivations"}, {"score": 0.0023079225317714815, "phrase": "negative_side"}, {"score": 0.0021928902836049384, "phrase": "shallow_right-linear"}, {"score": 0.0021049977753042253, "phrase": "flat_trs."}], "paper_keywords": ["term rewriting", " termination", " decidability", " complexity"], "paper_abstract": "We present decidability results for termination of classes of term rewriting systems modulo permutative theories. Termination and innermost termination modulo permutative theories are shown to be decidable for term rewrite systems (TRS) whose right-hand side terms are restricted to be shallow (variables occur at depth at most one) and linear (each variable occurs at most once). Innermost termination modulo permutative theories is also shown to be decidable for shallow TRS. We first show that a shallow TRS can be transformed into a flat (only variables and constants occur at depth one) TRS while preserving termination and innermost termination. The decidability results are then proved by showing that (a) for right-flat right-linear (flat) TRS, non-termination (respectively, innermost non-termination) implies non-termination starting from flat terms, and (b) for right-flat TRS, the existence of non-terminating derivations starting from a given term is decidable. On the negative side, we show PSPACE-hardness of termination and innermost termination for shallow right-linear TRS, and undecidability of termination for flat TRS.", "paper_title": "TERMINATION OF REWRITING WITH RIGHT-FLAT RULES MODULO PERMUTATIVE THEORIES", "paper_id": "WOS:000282653500008"}