{"auto_keywords": [{"score": 0.049818512053858996, "phrase": "mobile_entities"}, {"score": 0.00481495049065317, "phrase": "black_holes"}, {"score": 0.004509919457793852, "phrase": "faulty_nodes"}, {"score": 0.0043766186644841575, "phrase": "entering_entity"}, {"score": 0.004121672175779706, "phrase": "fixed_range"}, {"score": 0.003625495268063948, "phrase": "minimum_number"}, {"score": 0.0036057554517052227, "phrase": "synchronous_steps"}, {"score": 0.0035665965151915804, "phrase": "safe_all_the_graph"}, {"score": 0.00335867620389808, "phrase": "theoretical_point"}, {"score": 0.0032606201834155515, "phrase": "np"}, {"score": 0.003052510519032211, "phrase": "higher_one"}, {"score": 0.0028666313115584853, "phrase": "optimal_solution"}, {"score": 0.0027817658627604653, "phrase": "infinite_number"}, {"score": 0.0025768806441902295, "phrase": "bounded_k"}, {"score": 0.002426516860597627, "phrase": "time_complexity"}, {"score": 0.0023610946923597405, "phrase": "experimental_point"}, {"score": 0.0022849068677290836, "phrase": "different_scenarios"}, {"score": 0.0022111720236287547, "phrase": "theoretical_analysis"}, {"score": 0.0021515433205041585, "phrase": "best_exploration_strategy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mobile entities", " Black-holes", " Exploration algorithms", " Time complexity", " Experiments"], "paper_abstract": "In this paper, we study the problem of mobile entities that synchronously have to explore and repair a graph with faulty nodes, usually called black-holes, that destroy any entering entity. We consider the scenario where the destruction of an entity by means of a black-hole also affects all the entities within a fixed range r (in terms of number of edges), while the black-hole disappears. Clearly, if there are b black-holes in the graph, then k >= b entities are necessary to remove all of them from that graph. We ask for the minimum number of synchronous steps needed to make safe all the graph. The results of this paper are both theoretical and experimental, and can be summarized as follows. From the theoretical point of view, first we show that the problem is NP-hard even for b = k = 1. Then, we provide a general lower bound holding when r >= 0 and a higher one for the case of r > 0. We then consider the case of r <= 1. We propose an optimal solution holding when k is unbounded, that is, an infinite number of robots is available. Then, we provide three different exploration strategies, named snake, scout, and parallel-scout, respectively, for the case of bounded k, that is, the number of robots is fixed a priori. The three strategies are then analyzed according to the time complexity with respect to the lower bound. From the experimental point of view, we implemented the three strategies and tested them on different scenarios with the aim of assessing their practical performance. The experiments confirm the theoretical analysis and show that parallel-scout is always by far the best exploration strategy in practice. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Explore and repair graphs with black holes using mobile entities", "paper_id": "WOS:000365059800010"}