{"auto_keywords": [{"score": 0.004730458558634266, "phrase": "required_component"}, {"score": 0.00443308765153716, "phrase": "easier_program_comprehension"}, {"score": 0.004329630571352367, "phrase": "software_maintenance"}, {"score": 0.003939296259436904, "phrase": "published_evaluation"}, {"score": 0.0038246602895705643, "phrase": "requirements_traceability"}, {"score": 0.003378385493203297, "phrase": "development_tasks"}, {"score": 0.0031845067058084613, "phrase": "controlled_experiment"}, {"score": 0.003073545175760353, "phrase": "real_maintenance_tasks"}, {"score": 0.0021049977753042253, "phrase": "software_maintenance_quality"}], "paper_keywords": ["Requirements traceability", " Software traceability", " Software maintenance", " Software evolution", " Traceability usage", " Traceability effect", " Traceability benefit", " Empirical software engineering", " Controlled experiment", " Study"], "paper_abstract": "Software traceability is a required component of many software development processes. Advocates of requirements traceability cite advantages like easier program comprehension and support for software maintenance (i.e., software change). However, despite its growing popularity, there exists no published evaluation about the usefulness of requirements traceability. It is important, if not crucial, to investigate whether the use of requirements traceability can significantly support development tasks to eventually justify its costs. We thus conducted a controlled experiment with 71 subjects re-performing real maintenance tasks on two third-party development projects: half of the tasks with and the other half without traceability. Subjects sketched their task solutions on paper to focus on the their ability to solving the problems rather than their programming skills. Our findings show that subjects with traceability performed on average 24 % faster on a given task and created on average 50 % more correct solutions-suggesting that traceability not only saves effort but can profoundly improve software maintenance quality.", "paper_title": "Do developers benefit from requirements traceability when evolving and maintaining a software system?", "paper_id": "WOS:000353824000006"}