{"auto_keywords": [{"score": 0.026139046507165746, "phrase": "modified_current_conveyors"}, {"score": 0.004815009485683114, "phrase": "cmos"}, {"score": 0.004793151252365412, "phrase": "cci"}, {"score": 0.0041827333568982055, "phrase": "proposed_circuit"}, {"score": 0.004070276454809864, "phrase": "layout_editor"}, {"score": 0.004015182362035361, "phrase": "performance_characteristics"}, {"score": 0.003925004567341077, "phrase": "hspice_postlayout_simulations"}, {"score": 0.003600351201298387, "phrase": "power_consumption"}, {"score": 0.003287482882222731, "phrase": "port_x"}, {"score": 0.0029209233709517634, "phrase": "presented_circuit"}, {"score": 0.002401972657236928, "phrase": "special_circuit_topologies"}, {"score": 0.0023802126605244438, "phrase": "new_circuit_function"}, {"score": 0.002203016940021265, "phrase": "standard_current_conveyor"}, {"score": 0.0021731423856364003, "phrase": "proposed_approach"}, {"score": 0.0021242471042435037, "phrase": "deeper_insight"}, {"score": 0.0021049977753042253, "phrase": "circuit_synthesis"}], "paper_keywords": ["Design procedure", " CCI", " modified CCI", " all-pass filter", " grounded capacitor"], "paper_abstract": "A differential pair-based, high-performance, first-generation current conveyor is proposed. The proposed circuit is laid out using the Mentor Graphics IC Station layout editor. The performance characteristics have been determined from HSpice postlayout simulations using the Austria Mikro Systeme 0.35 mu m, 3.3 V process parameters. During the simulations, +/- 1.65 V supply voltages and a 25 mu A biasing current are used. The power consumption is about 1.12 mW. The circuit also has very high voltage swings on ports X and Y, a very small impedance value on port X, high impedance values on ports Y and Z, and high-valued current and voltage transfer bandwidths. It is shown that the presented circuit can satisfy both the low-voltage/low-power and high-frequency performance current conveyor needs of the analog circuit applications. Furthermore, 2 new all-pass filter circuits as application examples are given and a procedure that can be used to search for the opportunities that would result from the use of the modified current conveyors is presented. Some special circuit topologies and new circuit function possibilities can be obtained by redesigning circuits with modified current conveyors, which is not possible with a standard current conveyor. The proposed approach is expected to allow deeper insight into circuit synthesis using modified current conveyors.", "paper_title": "High-performance CMOS CCI in a 0.35 mu m CMOS technology and a new all-pass filter application", "paper_id": "WOS:000325373300006"}