{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "adaptive_allele_consolidation"}, {"score": 0.04379677900638105, "phrase": "genotype_elimination"}, {"score": 0.014635310505107954, "phrase": "lange-goradia_algorithm"}, {"score": 0.004223941453664225, "phrase": "equivalent_output"}, {"score": 0.00391167729353583, "phrase": "mendelian_law"}, {"score": 0.0037219886365287085, "phrase": "genetic_data"}, {"score": 0.0036224139706218916, "phrase": "preprocessing_step"}, {"score": 0.003525493807130663, "phrase": "linkage_analysis"}, {"score": 0.0034937647771945803, "phrase": "haplotype_imputation"}, {"score": 0.003309278541665552, "phrase": "allele_consolidation"}, {"score": 0.00326469463991041, "phrase": "existing_technique"}, {"score": 0.0031629800646754505, "phrase": "single_\"lumped\"_allele"}, {"score": 0.0028248293967214947, "phrase": "existing_allele_consolidation_techniques"}, {"score": 0.002367875199095903, "phrase": "high_performance"}, {"score": 0.002212460748734582, "phrase": "celer"}, {"score": 0.0021531831652035482, "phrase": "large_set"}, {"score": 0.0021049977753042253, "phrase": "good_results"}], "paper_keywords": ["Genotype elimination", " allele consolidation", " pedigree"], "paper_abstract": "We propose the technique of Adaptive Allele Consolidation, that greatly improves the performance of the Lange-Goradia algorithm for genotype elimination in pedigrees [1], while still producing equivalent output. Genotype elimination consists in removing from a pedigree those genotypes that are impossible according to the Mendelian law of inheritance. This is used to find errors in genetic data and is useful as a preprocessing step in other analyses (such as linkage analysis or haplotype imputation). The problem of genotype elimination is intrinsically combinatorial, and Allele Consolidation is an existing technique where several alleles are replaced by a single \"lumped\" allele in order to reduce the number of combinations of genotypes that have to be considered, possibly at the expense of precision. In existing Allele Consolidation techniques, alleles are lumped once and for all before performing genotype elimination. The idea of Adaptive Allele Consolidation is to dynamically change the set of alleles that are lumped together during the execution of the Lange-Goradia algorithm, so that both high performance and precision are achieved. We have implemented the technique in a tool called Celer and evaluated it on a large set of scenarios, with good results.", "paper_title": "Efficient Genotype Elimination via Adaptive Allele Consolidation", "paper_id": "WOS:000304147000024"}