{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "buxus_sempervirens_l."}, {"score": 0.004747997855358171, "phrase": "molecular_docking_studies"}, {"score": 0.00428451995524549, "phrase": "buxus_sempervirens"}, {"score": 0.004224911726496726, "phrase": "bioassay-guided_fractionation"}, {"score": 0.003976007772514762, "phrase": "inhibitory_activities"}, {"score": 0.00379452936798156, "phrase": "quite_selective_inhibitors"}, {"score": 0.0036213041338584756, "phrase": "electric_eel"}, {"score": 0.0030891871245908665, "phrase": "different_ache"}, {"score": 0.0028664985822266344, "phrase": "x-ray_crystal_structures"}, {"score": 0.0026722904884984348, "phrase": "horse_bche"}, {"score": 0.0026105159490849364, "phrase": "human_bche"}, {"score": 0.002195552442011313, "phrase": "acyl-binding_pocket"}, {"score": 0.0021649437083408425, "phrase": "active_site_gorge"}], "paper_keywords": ["Alzheimer's disease", " acetylcholinesterase", " butyrylcholinesterase", " docking", " homology modeling"], "paper_abstract": "In this work, two alkaloids namely (+)-buxabenzamidienine (1) and (+)-buxamidine (2) were isolated from Buxus sempervirens, using bioassay-guided fractionation and isolation method. Their acetyl-(AChE) and butyrylcholinesterase (BChE) inhibitory activities were studied and the compounds were found to be quite selective inhibitors of AChE. IC(50) values of compound 1 for electric eel AChE and horse BChE were 0.787 and 7.68 mM, respectively; while the corresponding IC(50) of compound 2 were 1.70 and 549.98 mM, respectively. Theoretical (quantum mechanical, homology modelling and docking) calculations were performed in order to explain their interactions with different AChE (electric eel and human) and BChE (horse and human). The x-ray crystal structures of electric eel AChE, human AChE, human BChE and a model of horse BChE constructed by homology with human BChE were used for docking of compounds 1 and 2. Density functional theory (DFT) calculations of the compounds were performed at the B3LYP/6-31G** level using the program Spartan (TM), and their HOMO and LUMO energy levels were calculated. Docking studies exhibited that compound 1 interacts with the acyl-binding pocket of the active site gorge of huAChE, and including several other hydrophobic interactions.", "paper_title": "Selective Cholinesterase Inhibitors from Buxus sempervirens L. and their Molecular Docking Studies", "paper_id": "WOS:000298590400007"}