{"auto_keywords": [{"score": 0.04962656673317322, "phrase": "collection_responsibility_sharing"}, {"score": 0.02731720525179705, "phrase": "cost_parameter"}, {"score": 0.015354860008307247, "phrase": "closed-loop_supply_chain"}, {"score": 0.011686570588253498, "phrase": "manufacturer_collection"}, {"score": 0.01157687557080965, "phrase": "third-party_collection"}, {"score": 0.008679068819378062, "phrase": "retailer_collection"}, {"score": 0.00481495049065317, "phrase": "reverse_channels"}, {"score": 0.004441517985511521, "phrase": "re-manufacturing_consisting"}, {"score": 0.004316722156877335, "phrase": "third-party_logistics"}, {"score": 0.004155742403177802, "phrase": "product_recycling_responsibilities"}, {"score": 0.0037969755088553326, "phrase": "different_reverse_channels"}, {"score": 0.0031845067058084583, "phrase": "responsibility_sharing"}, {"score": 0.0027479040199262393, "phrase": "worst_choice"}, {"score": 0.0024747842618794255, "phrase": "reverse_collection_tasks"}, {"score": 0.0021763278640166707, "phrase": "best_choice"}, {"score": 0.0021049977753042253, "phrase": "high_values"}], "paper_keywords": ["Closed-loop supply chain", " Re-manufacturing", " Collection responsibility sharing", " Reverse collection channels"], "paper_abstract": "This paper considers a closed-loop supply chain with re-manufacturing consisting of retailers, manufacturers and third-party logistics service providers; all participating in the product recycling responsibilities. The effectiveness of methods that can be used to share responsibilities amongst these parties is quantified using different reverse channels. First, re-manufacturing models with three different reverse channels for retailer collection, manufacturer collection and third-party collection are developed using collection responsibility sharing. Next, by comparing these models with the case of no collection responsibility sharing, the effectiveness of responsibility sharing is analysed and quantified. The results for the three models support the following conclusions: (i) from the point of view of the retailer, third-party collection is always the worst choice; (ii) the choice between retailer collection and manufacturer collection depends on the cost parameter representing the resources required in performing the reverse collection tasks; (iii) from the point of view the manufacturer, when the value of the cost parameter is small, collection by manufacturer is the best choice; retailer collection will be best for high values of the cost parameter.", "paper_title": "Choosing reverse channels under collection responsibility sharing in a closed-loop supply chain with re-manufacturing", "paper_id": "WOS:000351138700014"}