{"auto_keywords": [{"score": 0.047424185998726213, "phrase": "gsm"}, {"score": 0.004653120760786245, "phrase": "global_systems"}, {"score": 0.004600389726895716, "phrase": "mobile_communications"}, {"score": 0.004247560712327667, "phrase": "mature_technology"}, {"score": 0.004081385289516914, "phrase": "late_eighties"}, {"score": 0.0037042817107563785, "phrase": "underlying_communication_protocol"}, {"score": 0.0033048445033866795, "phrase": "phone_call"}, {"score": 0.0031573626285069157, "phrase": "new_and_more_secure_algorithms"}, {"score": 0.0029652292779277782, "phrase": "gsm_networks"}, {"score": 0.0029148831519944358, "phrase": "fallback_option"}, {"score": 0.0027374647587075935, "phrase": "gsm_based_conversations"}, {"score": 0.0022933216359142736, "phrase": "canonical_scientific_literature"}, {"score": 0.0021049977753042253, "phrase": "hacker_conferences"}], "paper_keywords": ["GSM", " mobile security", " security attacks", " encryption"], "paper_abstract": "The Global Systems for Mobile communications (GSM) is actually the most widespread mobile communication technology existing nowadays. Despite being a mature technology, its introduction dates back to the late eighties, it suffers from several security vulnerabilities, which have been targeted by many attacks aimed to break the underlying communication protocol. Most of these attacks focuses on the A5/1 algorithm used to protect over-the-air communication between the two parties of a phone call. This algorithm has been superseded by new and more secure algorithms. However, it is still in use in the GSM networks as a fallback option, thus still putting at risk the security of the GSM based conversations. The objective of this work is to review some of the most relevant results in this field and discuss their practical feasibility. To this end, we consider not only the contributions coming from the canonical scientific literature but also those that have been proposed in a more informal context, such as during hacker conferences.", "paper_title": "Security Issues and Attacks on the GSM Standard: a Review", "paper_id": "WOS:000329856400007"}