{"auto_keywords": [{"score": 0.04708779177439743, "phrase": "social_networks"}, {"score": 0.04172081011102645, "phrase": "previous_experiences"}, {"score": 0.0347069666231989, "phrase": "social_network"}, {"score": 0.00481495049065317, "phrase": "multi-agent_approach_for_trust-based_service_discovery_and_selection_in_social_networks._service_discovery_and_selection_approaches"}, {"score": 0.004603945840067339, "phrase": "quality_of_service"}, {"score": 0.0043775495353727085, "phrase": "service_providers"}, {"score": 0.004292530731019078, "phrase": "new_requester's_expectations"}, {"score": 0.004232811526417572, "phrase": "theses_approaches"}, {"score": 0.004104325562579697, "phrase": "social_dimension"}, {"score": 0.003848088904418221, "phrase": "multi-agent_systems"}, {"score": 0.003752216951715829, "phrase": "previous_interactions"}, {"score": 0.003498211093849399, "phrase": "service_discovery"}, {"score": 0.003430211567320493, "phrase": "societal_view"}, {"score": 0.0034110262089604355, "phrase": "trust_modeling"}, {"score": 0.0032430998954652043, "phrase": "trust_model"}, {"score": 0.002989714021608139, "phrase": "expert-based_component"}, {"score": 0.002834505099882888, "phrase": "recommender-based_component"}, {"score": 0.0025193357295530535, "phrase": "direct_interactions"}, {"score": 0.002401935608502315, "phrase": "probabilistic_model"}, {"score": 0.00236181671164665, "phrase": "non_adjacent_agents"}, {"score": 0.002335442877228571, "phrase": "account_roles"}, {"score": 0.002289993730291136, "phrase": "intermediate_agents"}, {"score": 0.0022454270608956023, "phrase": "distributed_algorithm"}, {"score": 0.0022328534191265854, "phrase": "trustworthy_service_discovery"}, {"score": 0.0022079164993671655, "phrase": "referral_systems"}, {"score": 0.0021347607855562102, "phrase": "existing_ones"}], "paper_keywords": ["Service Discovery and Selection", " Multi Agent System", " Trust Model", " Referral Systems", " Social Networks"], "paper_abstract": "Service discovery and selection approaches are often done using a centralized registry-based technique, which only captures common Quality of Service criteria. With more and more services offered via social networks, these approaches are not able to evaluate trust in service providers and often fail to comply with new requester's expectations. This is because theses approaches are not able (i) to take into consideration the social dimension and (ii) to capitalize on information resulting from previous experiences. To address these challenges, we propose the use of multi-agent systems as they have demonstrated the capability to use previous interactions, knowledge representation and distributed reasoning, as well as social metaphors like trust. More precisely, in this paper, we enhance service discovery and selection processes by integrating the societal view in trust modeling. Based on relationships between agents, their previous experiences and extracted information from social network, we define a trust model built upon social, expert and recommender-based components. The social-based component judges whether the provider is worthwhile pursuing before using his services (viz. trust in sociability). The expert-based component estimates whether the service behaves well and as expected (viz. trust in expertise). The recommender-based component assesses for an agent whether one's can rely on its recommendations (viz. trust in recommendation). However, when searching for a service in a social network, agents (service requester and service providers) may have no direct interactions or previous experiences. This requires a method to infer trust between them. Based on a probabilistic model, we estimate trust between non adjacent agents while taking into account roles (recommender or provider) of intermediate agents. Moreover, we propose a distributed algorithm for trustworthy service discovery and selection using referral systems in social networks. Experiments demonstrate that our approach is effective and outperforms existing ones, and can deliver more trustworthy results.", "paper_title": "A MULTI-AGENT APPROACH FOR TRUST-BASED SERVICE DISCOVERY AND SELECTION IN SOCIAL NETWORKS", "paper_id": "WOS:000371914800004"}