{"auto_keywords": [{"score": 0.047349156496294, "phrase": "nanosciences"}, {"score": 0.00481495049065317, "phrase": "scientific_production"}, {"score": 0.003995226376780718, "phrase": "great_help"}, {"score": 0.0038900709793274484, "phrase": "policy_makers"}, {"score": 0.0036100762867678415, "phrase": "time_relations"}, {"score": 0.003332332086930163, "phrase": "science-generated_knowledge"}, {"score": 0.0031422859551159506, "phrase": "patent_citations"}, {"score": 0.003010893527930816, "phrase": "time_lag"}, {"score": 0.0029630461161780203, "phrase": "journal_articles"}, {"score": 0.002537880772794665, "phrase": "collateral_measures"}, {"score": 0.002393034183276193, "phrase": "spatial_origin"}, {"score": 0.0021276181317652163, "phrase": "scientific_knowledge"}], "paper_keywords": ["Patent-research relations", " Patent", " Journal article", " Nanosciences", " Nanotechnologies", " Technological trajectories", " Data mining", " Innovation", " Knowledge diffusion"], "paper_abstract": "Nanosciences and nanotechnologies are considered important for the development of science, technology and innovation, and the study of their characters can be a great help to the decisions of policy makers and of practitioners. This work is centred on the issue of the time relations between science and technology/innovation, and in particular on the speed of transfer of science-generated knowledge towards its exploitation in patenting. A methodology based on patent citations is used in order to measure the time lag between cited journal articles and citing patent, and thus the time proximity between the two steps. Keywords regarding nanotechnology/nanoscience items are searched in order to collect data useful for the analysis. Collateral measures, performed on another class of materials and on the spatial origin of citing/cited documents, help giving evidence of the peculiarity of the behaviour and on its nature. The most representative time lag between production of scientific knowledge and its technological exploitation appears being around 3-4 years.", "paper_title": "Time relations between scientific production and patenting of knowledge: the case of nanotechnologies", "paper_id": "WOS:000294839200002"}