{"auto_keywords": [{"score": 0.04318562459045211, "phrase": "model_selection"}, {"score": 0.015719716506582524, "phrase": "diverse_usage"}, {"score": 0.015554840617080826, "phrase": "m-commerce_services"}, {"score": 0.009163925128320559, "phrase": "grey_relational_analysis"}, {"score": 0.004259293347851015, "phrase": "new_approach"}, {"score": 0.003952828685048176, "phrase": "icomp_criteria"}, {"score": 0.003687960013746783, "phrase": "variable_clustering"}, {"score": 0.0035150223642728437, "phrase": "twenty_variables"}, {"score": 0.0030595112110658675, "phrase": "proposed_approach_support"}, {"score": 0.0023051837161137674, "phrase": "icomp_approach"}, {"score": 0.002256435842862802, "phrase": "best_fitting_models"}, {"score": 0.0021049977753042253, "phrase": "tow_folds"}], "paper_keywords": ["M-commerce", " ICOMP", " Model selection", " Variable clustering"], "paper_abstract": "This paper conducted the validation of diverse usage in m-commerce services among the countries. In order to determine whether there is a discrepancy between samples, this study proposed a new approach based on ICOMP to perform model selection and variables clustering. According to the ICOMP criteria, the model selection implied that there is heterogeneity between samples. The variable clustering, whatever within a group or with all twenty variables, indicated that there are differences in ranking the most relevant variables between samples. That is, whatever model selection or variables clustering, all results based on the proposed approach support that there were discrepancies in using m-commerce services among the countries. Characters of both the ICOMP approach and the grey relational analysis in distinguishing the diverse usage were discussed. In short, both approaches can conclude there are discrepancies between the samples. The grey relational analysis is good to determine the preferences within a sample; and the ICOMP approach can determine the best fitting models for samples. The contribution of this paper towards the field in tow folds: the new approach to analyze the discrepancy; and the validation.", "paper_title": "Validation for the Diversity of Usage in M-Commerce among Countries by ICOMP", "paper_id": "WOS:000287064400003"}