{"auto_keywords": [{"score": 0.04971245563968758, "phrase": "shape_function"}, {"score": 0.02322730111336099, "phrase": "modified_gradient"}, {"score": 0.018028339518967398, "phrase": "original_material_point_method"}, {"score": 0.015785453299579665, "phrase": "material_point"}, {"score": 0.009535292477273624, "phrase": "material_points"}, {"score": 0.007265612714842623, "phrase": "characteristic_function"}, {"score": 0.00524353674291579, "phrase": "energy_conservation"}, {"score": 0.004723322467153553, "phrase": "numerical_scheme"}, {"score": 0.004687159050154687, "phrase": "computing_quantities"}, {"score": 0.004615656893404919, "phrase": "shape_functions"}, {"score": 0.004527804152066942, "phrase": "material_point_method"}, {"score": 0.00427410962921379, "phrase": "cell_boundaries"}, {"score": 0.0041446453895708, "phrase": "cell_crossing"}, {"score": 0.0035536228914319354, "phrase": "one-dimensional_cases"}, {"score": 0.0034194902384248006, "phrase": "generalized_interpolation_material_point"}, {"score": 0.0033672608231654897, "phrase": "special_case"}, {"score": 0.002735284807307981, "phrase": "immediate_neighbor_cells"}, {"score": 0.0025034338848015166, "phrase": "unstructured_grids"}, {"score": 0.002427473263013356, "phrase": "mass_and_momentum_conservations"}, {"score": 0.002326767693352058, "phrase": "second_order"}, {"score": 0.00230003335593664, "phrase": "spatial_and_temporal_discretizations"}, {"score": 0.0021049977753042253, "phrase": "significantly_better_energy_conservation_properties"}], "paper_keywords": ["Particle-in-cell", " Material point method", " Multiphase flow", " Fluid-structure interaction"], "paper_abstract": "A numerical scheme of computing quantities involving gradients of shape functions is introduced for the material point method (MPM), so that the quantities are continuous as material points move across cell boundaries. The noise and instability caused by cell crossing of the material points are then eliminated. In this scheme, the formulas used to compute these quantities can be expressed in the same forms as in the original material point method, but with the gradient of the shape function modified. For one-dimensional cases, the gradient of the shape function used in the generalized interpolation material point (GIMP) method is a special case of the modified gradient if the characteristic function of a material point is introduced. The characteristic function of a material point is not otherwise needed in this scheme, therefore difficulties in tracking its evolution are avoided. Although the support of the modified gradient of a shape function is enlarged from the cell containing the material point to also include the immediate neighbor cells, all the non-local effects of a material point can be accounted for by two consecutive local operations. Therefore this scheme can be used in calculations with unstructured grids. This scheme is proved to satisfy mass and momentum conservations exactly. The error in energy conservation is shown to be second order on both spatial and temporal discretizations. Although the error in energy conservation is the same order as that in the original material point method, numerical examples show that this scheme has significantly better energy conservation properties than those of the original material point method. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Material point method enhanced by modified gradient of shape function", "paper_id": "WOS:000292365800011"}