{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rule_sets"}, {"score": 0.012216925242525899, "phrase": "information_content"}, {"score": 0.0074120333660794, "phrase": "outer_impartation_information_content"}, {"score": 0.004914709715858842, "phrase": "conditional_information_content"}, {"score": 0.004641005983799053, "phrase": "inner_mutual_information_content"}, {"score": 0.004533585346030341, "phrase": "conventional_objective_interestingness_measures"}, {"score": 0.004505333081584977, "phrase": "new_measures"}, {"score": 0.0044883089984593455, "phrase": "information_theory"}, {"score": 0.004443482801729777, "phrase": "inner_mutual_information"}, {"score": 0.004297256607382827, "phrase": "mutual_information"}, {"score": 0.004046020290832207, "phrase": "outer_impartation_information"}, {"score": 0.003598629227969919, "phrase": "input_universe"}, {"score": 0.0035270425911920595, "phrase": "binary_relations"}, {"score": 0.003433796409346569, "phrase": "rule_set"}, {"score": 0.0029139401928060123, "phrase": "inconsistent_knowledge"}, {"score": 0.0027525658515943985, "phrase": "interesting_results"}, {"score": 0.0023356021521252495, "phrase": "new_method"}, {"score": 0.0022967713922705, "phrase": "rule_mining_algorithm"}, {"score": 0.0022284920601703595, "phrase": "rpcic"}, {"score": 0.0021767893059191795, "phrase": "new_methods"}], "paper_keywords": ["rule interestingness measure", " information content of rules", " information content of rule sets", " conditional information content of rules and rule sets"], "paper_abstract": "The information content of rules is categorized into inner mutual information content and outer impartation information content. Actually, the conventional objective interestingness measures based on information theory are all inner mutual information, which represent the confidence of rules and the mutual information between the antecedent and consequent. Moreover, almost all of these measures lose sight of the outer impartation information, which is conveyed to the user and help the user to make decisions. We put forward the viewpoint that the outer impartation information content of rules and rule sets can be represented by the relations from input universe to output universe. By binary relations, the interaction of rules in a rule set can be easily represented by operators: union and intersection. Based on the entropy of relations, the outer impartation information content of rules and rule sets are well measured. Then, the conditional information content of rules and rule sets, the independence of rules and rule sets and the inconsistent knowledge of rule sets are defined and measured. The properties of these new measures are discussed and some interesting results are proven, such as the information content of a rule set may be bigger than the sum of the information content of rules in the rule set, and the conditional information content of rules may be negative. At last, the applications of these new measures are discussed. The new method for the appraisement of rule mining algorithm, and two rule pruning algorithms, lambda-choice and RPCIC, are put forward. These new methods and algorithms have predominance in satisfying the need of more efficient decision information.", "paper_title": "The information content of rules and rule sets and its application", "paper_id": "WOS:000260770400004"}