{"auto_keywords": [{"score": 0.04071777520893947, "phrase": "finland"}, {"score": 0.00481495049065317, "phrase": "mobile_media"}, {"score": 0.004456611869693865, "phrase": "interactive_and_ubiquitous_multimedia"}, {"score": 0.004261419841494814, "phrase": "ethnographic_investigation"}, {"score": 0.004141663280057689, "phrase": "human_memory"}, {"score": 0.004058180509184539, "phrase": "large-scale_event"}, {"score": 0.003912112659326054, "phrase": "fia_world_rally_championship"}, {"score": 0.003802135020791801, "phrase": "multimedia_mobile_phones"}, {"score": 0.003695237613399466, "phrase": "experience-related_activities"}, {"score": 0.0036503460615862574, "phrase": "mass_event"}, {"score": 0.0035913348026306306, "phrase": "active_role"}, {"score": 0.003562186600028245, "phrase": "technology-mediated_memories"}, {"score": 0.0032567057896906314, "phrase": "group_identity"}, {"score": 0.0031650944584992726, "phrase": "important_social_aspects"}, {"score": 0.002941147710077221, "phrase": "multimedia-mediated_forms"}, {"score": 0.002265422518417868, "phrase": "human_experience"}, {"score": 0.0022287497627555895, "phrase": "later_use"}], "paper_keywords": ["large-scale events", " ethnographic field study", " sharing experiences", " constructive memory", " mobile and ubiquitous multimedia", " active spectators"], "paper_abstract": "To fully appreciate the opportunities provided by interactive and ubiquitous multimedia to record and share experiences, we report on an ethnographic investigation on the settings and nature of human memory and experience at a large-scale event. We studied two groups of spectators at a FIA World Rally Championship in Finland, both equipped with multimedia mobile phones. Our analysis of the organization of experience-related activities in the mass event focuses on the active role of technology-mediated memories in constructing experiences. Continuity, reflexivity with regard to the Self and the group, maintaining and re-creating group identity, protagonism and active spectatorship were important social aspects of the experience and were directly reflected in how multimedia was used. Particularly, we witnessed multimedia-mediated forms of expression, such as staging, competition, storytelling, joking, communicating presence, and portraying others; and the motivation for these stemmed from the engaging, processual, and shared nature of experience. Moreover, we observed how temporality and spatiality provided a platform for constructing experiences. The analysis advocates applications that not only store or capture human experience for sharing or later use but also actively participates in the very construction of experience. The approach conveys several valuable design implications.", "paper_title": "Active construction of experience through mobile media: a field study with implications for recording and sharing", "paper_id": "WOS:000246339700002"}