{"auto_keywords": [{"score": 0.04871873141728569, "phrase": "public_health"}, {"score": 0.03692204774997178, "phrase": "gho"}, {"score": 0.004567129988306349, "phrase": "main_indicators"}, {"score": 0.004523455475492876, "phrase": "societal_progress"}, {"score": 0.004480196733208298, "phrase": "statistical_data"}, {"score": 0.004069631519385246, "phrase": "life_sciences"}, {"score": 0.0036261282565554507, "phrase": "global_scale"}, {"score": 0.0035399770257915466, "phrase": "global_health_observatory"}, {"score": 0.002864628676257225, "phrase": "complex_spreadsheets"}, {"score": 0.0025892330566358503, "phrase": "significant_amount"}, {"score": 0.0025644240336018045, "phrase": "manual_work"}, {"score": 0.002467587612641478, "phrase": "rdf"}, {"score": 0.0023857603808363527, "phrase": "data_re-use"}, {"score": 0.0022409963215568565, "phrase": "publication_process"}, {"score": 0.0021049977753042253, "phrase": "gho_data"}], "paper_keywords": ["RDF", " health", " WHO", " GHO", " statistics", " datacube", " CSV", " spreadsheets"], "paper_abstract": "The improvement of public health is one of the main indicators for societal progress. Statistical data for monitoring public health is highly relevant for a number of sectors, such as research (e.g. in the life sciences or economy), policy making, health care, pharmaceutical industry, insurances etc. Such data is meanwhile available even on a global scale, e.g. in the Global Health Observatory (GHO) of the United Nations's World Health Organization (WHO). GHO comprises more than 50 different datasets, it covers all 198 WHO member countries and is updated as more recent or revised data becomes available or when there are changes to the methodology being used. However, this data is only accessible via complex spreadsheets and, therefore, queries over the 50 different datasets as well as combinations with other datasets are very tedious and require a significant amount of manual work. By making the data available as RDF, we lower the barrier for data re-use and integration. In this article, we describe the conversion and publication process as well as use cases, which can be implemented using the GHO data.", "paper_title": "Publishing and interlinking the Global Health Observatory dataset", "paper_id": "WOS:000209437200013"}