{"auto_keywords": [{"score": 0.0455532614264726, "phrase": "rbfnn"}, {"score": 0.015601764971246643, "phrase": "radial_basis_function_neural_networks"}, {"score": 0.00915697561407203, "phrase": "new_algorithm"}, {"score": 0.008049152639474375, "phrase": "target_function"}, {"score": 0.00481495049065317, "phrase": "value-based_initialization"}, {"score": 0.004582423717777699, "phrase": "functional_approximation_problems"}, {"score": 0.004246333442872459, "phrase": "first_step"}, {"score": 0.004041155193307942, "phrase": "initialization_task"}, {"score": 0.00364603066037512, "phrase": "good_results"}, {"score": 0.0035500334260484376, "phrase": "clustering_problem"}, {"score": 0.0035096666710980108, "phrase": "next_step"}, {"score": 0.0028893844749296863, "phrase": "input_vectors_positions"}, {"score": 0.0025867643733794724, "phrase": "activation_grades"}, {"score": 0.0023784664152543718, "phrase": "center's_positions"}], "paper_keywords": ["RBF", " neural networks", " RBFNN", " initialization", " function approximation", " radii", " centers"], "paper_abstract": "The use of Radial Basis Function Neural Networks (RBFNNs) to solve functional approximation problems has been addressed many times in the literature. When designing an RBFNN to approximate a function, the first step consists of the initialization of the centers of the RBFs. This initialization task is very important because the rest of the steps are based on the positions of the centers. Many clustering techniques have been applied for this purpose achieving good results although they were constrained to the clustering problem. The next step of the design of an RBFNN, which is also very important, is the initialization of the radii for each RBF. There are few heuristics that are used for this problem and none of them use the information provided by the output of the function, but only the centers or the input vectors positions are considered. In this paper, a new algorithm to initialize the centers and the radii of an RBFNN is proposed. This algorithm uses the perspective of activation grades for each neuron, placing the centers according to the output of the target function. The radii are initialized using the center's positions and their activation grades so the calculation of the radii also uses the information provided by the output of the target function. As the experiments show, the performance of the new algorithm outperforms other algorithms previously used for this problem.", "paper_title": "Output value-based initialization for radial basis function neural networks", "paper_id": "WOS:000247531700004"}