{"auto_keywords": [{"score": 0.049272197070513044, "phrase": "host_rocks"}, {"score": 0.011146232925837307, "phrase": "decarbonation_reactions"}, {"score": 0.008713768692145006, "phrase": "igneous_intrusions"}, {"score": 0.0072565163578002575, "phrase": "-water_evaporation"}, {"score": 0.006271378339006007, "phrase": "pore-water_evaporation"}, {"score": 0.006062031947766676, "phrase": "thermal_effect"}, {"score": 0.004766090327062509, "phrase": "peak_temperatures"}, {"score": 0.004407530256797396, "phrase": "permian_irati_formation"}, {"score": 0.004347972379250724, "phrase": "south_america"}, {"score": 0.0042025601346464365, "phrase": "numerical_investigation"}, {"score": 0.0041598882840506385, "phrase": "heat_conduction_models"}, {"score": 0.004075834722188658, "phrase": "emplacement_mechanism"}, {"score": 0.003873027670786261, "phrase": "peak_temperature"}, {"score": 0.003509006038574667, "phrase": "instantaneous_intrusion_mechanism"}, {"score": 0.003255777265493076, "phrase": "maximum_effect"}, {"score": 0.002889928791032578, "phrase": "maximum_deviation"}, {"score": 0.0024372660612788184, "phrase": "thermal_modeling"}, {"score": 0.0023879358679564527, "phrase": "finite-time_intrusion_mechanism"}, {"score": 0.002339601774631419, "phrase": "natural_condition"}, {"score": 0.002200377880796801, "phrase": "important_roles"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Igneous intrusions", " Peak temperature", " Dehydration and decarbonation", " Evaporation", " Intrusion mechanism"], "paper_abstract": "Using a 13-m-thick basic sill and its limestone host rocks of the Permian Irati Formation from the Parana Basin, South America, as an example, this paper presents a numerical investigation based on heat conduction models on the effect of the emplacement mechanism of igneous intrusions, pore-water evaporation, and dehydration and decarbonation of host rocks on the peak temperature (T(peak)) of host rocks. Our results demonstrate that: (1) the finite-time intrusion mechanism of magma can lower the predicted T(peak) of host rocks by up to 100 degrees C relative to the instantaneous intrusion mechanism, and although pore-water evaporation together with dehydration and decarbonation reactions can also depress the thermal effect of the sill on its host rocks, the maximum effect of these mechanisms on T(peak) only reaches approximately 50 degrees C. (2) The effect of pore-water evaporation on T(peak) is obviously greater than that of the dehydration and decarbonation reactions: the former can cause a maximum deviation of 40 degrees C in the predicted T(peak), whereas the deviation due to the latter is less than 20 degrees C. Further, the effect of the dehydration and decarbonation reactions on T(peak) is less than 10 degrees C if pore-water evaporation is allowed simultaneously in the models and can hence be ignored in thermal modeling. (3) The finite-time intrusion mechanism of magma probably represents the natural condition of the sill. Pore-water evaporation and dehydration and decarbonation of host rocks are also likely to play important roles in lowering the thermal effect of the sill. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The influence of igneous intrusions on the peak temperatures of host rocks: Finite-time emplacement, evaporation, dehydration, and decarbonation", "paper_id": "WOS:000298524100011"}