{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "co-occurrence_matrices"}, {"score": 0.007279854043529042, "phrase": "mobile_malware"}, {"score": 0.004772818068176176, "phrase": "mobile_malware_detection"}, {"score": 0.004669085371587273, "phrase": "mobile_operating_system_market"}, {"score": 0.004567596860086148, "phrase": "rapid_spread"}, {"score": 0.004332894955218135, "phrase": "system_call_sequence_analysis"}, {"score": 0.004128317208406523, "phrase": "malware_detection_accuracy"}, {"score": 0.004092168350316413, "phrase": "existing_approaches"}, {"score": 0.004041752711292472, "phrase": "anncmdroid"}, {"score": 0.003682207422331339, "phrase": "new_scheme"}, {"score": 0.0036499505265403377, "phrase": "artificial_neural_networks"}, {"score": 0.003170520716404193, "phrase": "benign_software"}, {"score": 0.002802825862847951, "phrase": "system_call_sequences"}, {"score": 0.002623732472012513, "phrase": "ann"}, {"score": 0.002488604965680912, "phrase": "real_experiments"}, {"score": 0.0024667783849055634, "phrase": "experimental_results"}, {"score": 0.0021901499935368853, "phrase": "f-score"}], "paper_keywords": ["Android", " mobile malware", " malware detection", " system call sequence", " Artificial Neural Network", " co-occurrence matrix"], "paper_abstract": "Android dominates the mobile operating system market, which stimulates the rapid spread of mobile malware. It is quite challenging to detect mobile malware. System call sequence analysis is widely used to identify malware. However, the malware detection accuracy of existing approaches is not satisfactory since they do not consider correlation of system calls in the sequence. In this paper, we propose a new scheme called Artificial Neural Networks (ANNs) on Co-occurrence Matrices Droid (ANNCMDroid), using co-occurrence matrices to mine correlation of system calls. Our key observation is that correlation of system calls is significantly different between malware and benign software, which can be accurately expressed by co-occurrence matrices, and ANNs can effectively identify anomaly in the co-occurrence matrices. Thus at first we calculate co-occurrence matrices from the system call sequences and then convert them into vectors. Finally, these vectors are fed into ANN to detect malware. We demonstrate the effectiveness of ANNCMDroid by real experiments. Experimental results show that only 4 applications among 594 evaluated benign applications are falsely detected as malware, and only 18 applications among 614 evaluated malicious applications are not detected. As a result, ANNCMDroid achieved an F-Score of 0.981878, which is much higher than other methods.", "paper_title": "ANNs on Co-occurrence Matrices for Mobile Malware Detection", "paper_id": "WOS:000358997000023"}