{"auto_keywords": [{"score": 0.03314280676724775, "phrase": "florida"}, {"score": 0.00481495049065317, "phrase": "live_video_transmission"}, {"score": 0.004007083686875716, "phrase": "verizon_business"}, {"score": 0.003545024951402818, "phrase": "current_hardware"}, {"score": 0.003213920601037463, "phrase": "network_node"}, {"score": 0.0031747618267940155, "phrase": "tampa"}, {"score": 0.0029859892666078526, "phrase": "miami"}, {"score": 0.002860546817196148, "phrase": "video_and_pseudorandom_test_sequences"}, {"score": 0.0026091594819333654, "phrase": "field_trial"}, {"score": 0.0023798115577749225, "phrase": "long-haul_transmission"}, {"score": 0.0023507916951658455, "phrase": "single-polarization_dqpsk"}, {"score": 0.0023079225317714815, "phrase": "line_rate"}, {"score": 0.002224510044064184, "phrase": "net_information_bit_rate"}, {"score": 0.002104998088798404, "phrase": "alcatel-lucent"}], "paper_keywords": [""], "paper_abstract": "Successful transmission of live (real time) video traffic is demonstrated using a prototype 100 Gb/s single-polarization differential quadrature phase shift keying (DQPSK) transmitter and receiver over an in-service 504 km link of the LambdaXtreme (R) optical transport platform. Teaming with Verizon Business, we demonstrate the feasibility of upgrading an existing, live traffic bearing network to 100 Gb/s per wavelength without any changes to the current hardware or software. The 107Gb/s signal is added at a reconfigurable optical add/drop multiplexer (ROADM) at a network node in Tampa, Florida, and dropped at a ROADM in Miami, Florida, where both live video and pseudorandom test sequences are received. In addition, we discuss the steps leading up to this field trial that included several important precursor laboratory experiments. We detail the generation, detection, coding, and long-haul transmission of single-polarization DQPSK at a line rate of 53.5 Gbaud to support a net information bit rate of 100 Gb/s. (C) 2010 Alcatel-Lucent.", "paper_title": "100 Gb/s DQPSK Field Trial: Live Video Transmission Over an Operating LambdaXtreme (R) Network", "paper_id": "WOS:000275380400008"}