{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "noncovalent_interactions"}, {"score": 0.04500629809327725, "phrase": "dynamical_nature"}, {"score": 0.03621068587559538, "phrase": "main-chain_atoms"}, {"score": 0.004635477242873163, "phrase": "fully_folded_functional_protein"}, {"score": 0.00452670409375785, "phrase": "conformational_motions"}, {"score": 0.004494570360108983, "phrase": "existing_noncovalent_interactions"}, {"score": 0.004389089062127892, "phrase": "new_interactions"}, {"score": 0.004275904315753662, "phrase": "different_types"}, {"score": 0.004185463886003309, "phrase": "structural_stability"}, {"score": 0.0040678331568263105, "phrase": "experimental_limitations"}, {"score": 0.004010258381362604, "phrase": "different_noncovalent_interactions"}, {"score": 0.003916098498242888, "phrase": "molecular_dynamics_simulations"}, {"score": 0.003842358763279932, "phrase": "-alpha_class_proteins"}, {"score": 0.0037610536973798113, "phrase": "-beta_class_proteins"}, {"score": 0.0037166271786171464, "phrase": "eight_different_noncovalent_interactions"}, {"score": 0.0036640049696800266, "phrase": "maximum_residence_time"}, {"score": 0.003569451476205552, "phrase": "conventional_hydrogen_bonds"}, {"score": 0.003544088803300751, "phrase": "dominant_interactions"}, {"score": 0.0033795330711815998, "phrase": "simulation_time"}, {"score": 0.003363524285161247, "phrase": "mrt"}, {"score": 0.00323795451607596, "phrase": "secondary_structures"}, {"score": 0.0031693980719538317, "phrase": "overall_stability"}, {"score": 0.0031244995579170465, "phrase": "weak_c-h_center_dot_center_dot_center_dot_o_hydrogen_bond"}, {"score": 0.003036595866130997, "phrase": "large_number"}, {"score": 0.002965229277927781, "phrase": "all-beta_proteins"}, {"score": 0.002807368910151021, "phrase": "strong_cation_center"}, {"score": 0.0026264601495742295, "phrase": "higher_strength"}, {"score": 0.002576941349223576, "phrase": "pi-electron_cloud"}, {"score": 0.0024108455980729284, "phrase": "weak_c-h_center_dot_center_dot_center_dot_o_interactions"}, {"score": 0.002337403139264533, "phrase": "all-alpha_and_all-beta_class"}, {"score": 0.0022824314760583834, "phrase": "additional_stability"}, {"score": 0.002266192902146669, "phrase": "-beta_protein_structures"}, {"score": 0.0021150431408355104, "phrase": "pathological_state"}], "paper_keywords": [""], "paper_abstract": "A fully folded functional protein is stabilized by several noncovalent interactions. When a protein undergoes conformational motions, the existing noncovalent interactions may be maintained. They may also break or new interactions may be formed. Knowledge of the dynamical nature of the different types of noncovalent interactions is extremely important to understand the structural stability, function, and folding of a protein. There are experimental limitations to investigate the dynamics of different noncovalent interactions simultaneously in a biomolecule. We have carried out molecular dynamics simulations on four different proteins, two belonging to all-alpha class proteins and the other two are representatives of all-beta class proteins. The dynamical nature of eight different noncovalent interactions was studied by monitoring the maximum residence time (MRT) and lifetime (LT). The conventional hydrogen bonds are the dominant interactions in all four proteins, and the majority of those formed between the main-chain atoms were maintained during most of the simulation time with MRT greater than 10 ns. Such interactions with more than 1 ns lifetime provide stability to the secondary structures, and hence they are responsible for the overall stability of the protein. The weak C-H center dot center dot center dot O hydrogen bond is the next major type of interactions. However, a large number of such interactions are observed between the main-chain atoms only in all-beta proteins as interstrand interactions, and, surprisingly, they are observed during most part of the simulation although their average lifetime is only about 20 to 30 Ps. The strong cation center dot center dot center dot pi and salt-bridge interactions are present few in number. However, in many cases they are almost uninterrupted indicating the higher strength of these interactions. Four other interactions involving the pi-electron cloud of aromatic rings are very small in number, and, in many cases, their presence is not maintained throughout the simulation. Our results dearly indicate that the weak C-H center dot center dot center dot O interactions between the main-chain atoms are the distinguishing factor between the all-alpha and all-beta class of proteins, and these interstrand interactions can provide additional stability to all-beta protein structures. Based on these results, we hypothesize that such weak C-H center dot center dot center dot O interstrand interactions could play a major role in providing stability to amyloid type of aggregates that are responsible for the pathological state of many proteins.", "paper_title": "Dynamics of Noncovalent Interactions in All-alpha and All-beta Class Proteins: Implications for the Stability of Amyloid Aggregates", "paper_id": "WOS:000298315900018"}