{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "potential_and_actual_infinities"}, {"score": 0.013716422713538333, "phrase": "thinking_logic"}, {"score": 0.013609878192062082, "phrase": "actual_infinities"}, {"score": 0.012886584687733323, "phrase": "potential_infinities"}, {"score": 0.008784070830156301, "phrase": "modem_mathematics"}, {"score": 0.004721162131188487, "phrase": "purpose_-_the_paper"}, {"score": 0.004503422625191897, "phrase": "conceptual_approach"}, {"score": 0.004346704947011699, "phrase": "common_belief"}, {"score": 0.00429578178900184, "phrase": "cantor"}, {"score": 0.004262002714850496, "phrase": "zermelo"}, {"score": 0.0041136473765874815, "phrase": "naive_and_modem_axiomatic_set_theory"}, {"score": 0.004049594822850906, "phrase": "cauchy"}, {"score": 0.00401766381002822, "phrase": "weierstrass"}, {"score": 0.0037133478610481994, "phrase": "essential_intensions"}, {"score": 0.003445591238183763, "phrase": "realistic_situations"}, {"score": 0.003299460925313939, "phrase": "modern_system"}, {"score": 0.0031845067058084583, "phrase": "set_theory"}, {"score": 0.0024842242921857705, "phrase": "modern_mathematics"}, {"score": 0.002286781334850213, "phrase": "thinking_logics"}, {"score": 0.0021049977753042253, "phrase": "first_time"}], "paper_keywords": ["cybernetics", " set theory"], "paper_abstract": "Purpose - The paper aims to introduce the concepts of potential and actual infinities. Design/methodology/approach - A conceptual approach is taken. Findings - It is a common belief that both Cantor and Zermelo completely employed the thinking logic of actual infinities in the naive and modem axiomatic set theory, and that Cauchy and Weierstrass completely applied that of potential infinities in the theory of limits. However, when it explores in depth the essential intensions of both potential and actual infinities, and after sufficiently understanding the difference and connections between the infinities and revisiting the realistic situations on how the concept of infinities has been employed in modern system of mathematics, it is discovered that in set theory, the thinking logic of actual infinities has not been applied consistently throughout, and that in the theory of limits, the idea of potential infinities has not been utilized consistently throughout, either. As for those subsystems involving the concepts of infinities of modem mathematics, they generally contain both kinds of infinities at the same time. As a matter of fact in modern mathematics and its theoretical foundation, one only needs to slightly analyze and dig deeper, one will see the reality that the thinking logics and method of analysis of employing both kinds of infinities are everywhere implicitly. Originality/value - The authors show the first time in history that the system of modem mathematics is not consistent as what has been believed.", "paper_title": "Wide-range co-existence of potential and actual infinities in modern mathematics", "paper_id": "WOS:000256048100004"}