{"auto_keywords": [{"score": 0.043967328978991624, "phrase": "book_reviews"}, {"score": 0.00481495049065317, "phrase": "humanities_research_evaluations"}, {"score": 0.004780633011300165, "phrase": "bibliometric_evaluations"}, {"score": 0.004746558955503364, "phrase": "research_outputs"}, {"score": 0.004695900553353526, "phrase": "social_sciences"}, {"score": 0.00449859196755507, "phrase": "science_data"}, {"score": 0.0044346739635814135, "phrase": "background_literature"}, {"score": 0.004233119608341877, "phrase": "special_attention"}, {"score": 0.0041580507929967645, "phrase": "web_of_science"}, {"score": 0.0041136473765874815, "phrase": "literature_journals"}, {"score": 0.0036815763368083197, "phrase": "bibliometric_data"}, {"score": 0.0035904480418810837, "phrase": "large_set"}, {"score": 0.0034890505116128606, "phrase": "general_publication_patterns"}, {"score": 0.0029169007179202164, "phrase": "referencing_culture"}, {"score": 0.002482443883144136, "phrase": "scholarly_communication_system"}, {"score": 0.002229300966775032, "phrase": "positive_step"}, {"score": 0.0022054488653549175, "phrase": "research_evaluations"}, {"score": 0.0021662599012740127, "phrase": "new_set"}, {"score": 0.0021507795710951384, "phrase": "journal_quality_indicators"}], "paper_keywords": [""], "paper_abstract": "Bibliometric evaluations of research outputs in the social sciences and humanities are challenging due to limitations associated with Web of Science data; however, background literature has shown that scholars are interested in stimulating improvements. We give special attention to book reviews processed by Web of Science history and literature journals, focusing on two types: Type I (i.e., reference to book only) and Type II (i.e., reference to book and other scholarly sources). Bibliometric data are collected and analyzed for a large set of reviews (1981-2009) to observe general publication patterns and patterns of citedness and co-citedness with books under review. Results show that reviews giving reference only to the book (Type I) are published more frequently while reviews referencing the book and other works (Type II) are more likely to be cited. The referencing culture of the humanities makes it difficult to understand patterns of co-citedness between books and review articles without further in-depth content analyses. Overall, citation counts to book reviews are typically low, but our data showed that they are scholarly and do play a role in the scholarly communication system. In the disciplines of history and literature, where book reviews are prominent, counting the number and type of reviews that a scholar produces throughout his/her career is a positive step forward in research evaluations. We propose a new set of journal quality indicators for the purpose of monitoring their scholarly influence.", "paper_title": "Book Reviews in Humanities Research Evaluations", "paper_id": "WOS:000295458700010"}