{"auto_keywords": [{"score": 0.047748521831607424, "phrase": "information_space"}, {"score": 0.012421384716028864, "phrase": "information_visualization"}, {"score": 0.004548253531664032, "phrase": "mental_healthcare"}, {"score": 0.004420472010542188, "phrase": "major_social_and_economic_challenges"}, {"score": 0.004311598785718415, "phrase": "coming_decades"}, {"score": 0.004101797841848363, "phrase": "people's_access"}, {"score": 0.00388828234270598, "phrase": "mental_healthcare_services"}, {"score": 0.003765525342866404, "phrase": "crucial_role"}, {"score": 0.0037387746981660717, "phrase": "people's_interaction"}, {"score": 0.003531474887552889, "phrase": "cognitive_maps"}, {"score": 0.0034567253581991226, "phrase": "well-designed_information_visualization_methods"}, {"score": 0.0032766780632972363, "phrase": "good_mental_health"}, {"score": 0.003218764138744059, "phrase": "latest_study"}, {"score": 0.003195885276330599, "phrase": "mental_capability"}, {"score": 0.0030078460113945136, "phrase": "crucial_part"}, {"score": 0.002923214590192792, "phrase": "visualization_approaches"}, {"score": 0.0028006988338192375, "phrase": "research_gap"}, {"score": 0.002751174423568564, "phrase": "new_information_visualization_method"}, {"score": 0.0027121844541913367, "phrase": "user's_visual_perception"}, {"score": 0.0025343769150179764, "phrase": "human_movement"}, {"score": 0.0021049977753042253, "phrase": "ergonomic_perception"}], "paper_keywords": ["3D interaction", " Information visualization", " Six degree of freedom", " Human space perception", " Focus plus context", " Spatial ability", " Spatial manipulation"], "paper_abstract": "Mental healthcare has been identified as one of the major social and economic challenges that society will face in the coming decades. In this paper, we explore the potential of technology to improve people's access to and engagement in, as well as the effectiveness and affordability of, mental healthcare services while interacting with computers. Information visualization plays a crucial role in people's interaction with computers. Specifically, information visualization represents data or concepts graphically and helps people construct cognitive maps i.e., mental representations of the information space. Well-designed information visualization methods enable users to employ their mental capabilities to manipulate an information space and perceive it based on good mental health. According to the latest study of mental capability, movement will guide insight in problem solving situations. Movement in the 3D world is a crucial part of our mental capability, but traditional information,visualization approaches fail to consider it. In an attempt to fill this research gap, we propose a new information visualization method that integrates a user's visual perception and his/her ergonomic perception. Specifically, the approach enables users to manipulate an information space to follow the behavior of human movement in the 3D world with six degrees of freedom. Users can move an information space along the x-, y-, and z-axes as well as rotate it-giving six degrees of freedom. Manipulating the information space in this way provides users with a more comprehensive understanding of the space, and integrates their visual capability and ergonomic perception so that they can fully utilize their mental capabilities. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Embodied cognition of information visualization: Human-computer interaction with six degrees of freedom in movement of an information space", "paper_id": "WOS:000291118500002"}