{"auto_keywords": [{"score": 0.02664484551875223, "phrase": "turkey"}, {"score": 0.011717646619739579, "phrase": "hc"}, {"score": 0.00481495049065317, "phrase": "human_capital_measurement_indicators"}, {"score": 0.004777034835192062, "phrase": "fuzzy_ahp._people"}, {"score": 0.0046650615456476155, "phrase": "important_and_essential_asset"}, {"score": 0.004225950334493496, "phrase": "human_capital"}, {"score": 0.003982500388997765, "phrase": "intellectual_capital"}, {"score": 0.003319675107116333, "phrase": "hc_measurement_indicators"}, {"score": 0.003140680985599885, "phrase": "fuzzy_analytic_hierarchy_process"}, {"score": 0.00311591353107022, "phrase": "ahp"}, {"score": 0.0030068193773923387, "phrase": "five_main_attributes"}, {"score": 0.0027341763737751467, "phrase": "proposed_model"}, {"score": 0.002576442680766742, "phrase": "numerical_example"}, {"score": 0.0023896108055582615, "phrase": "cultural_characteristics"}, {"score": 0.002155656133617155, "phrase": "\"succession_rate"}, {"score": 0.002138636271204459, "phrase": "training_programs"}], "paper_keywords": ["human capital", " measurement indicators", " fuzzy sets", " AHP", " prioritization"], "paper_abstract": "People in an organization constitute an important and essential asset which tremendously contributes to development and growth of that company by the help of their collective attitudes, skills and abilities. This is why the human capital (HC) can be considered the most important sub-dimension of the intellectual capital. Since you cannot manage what you cannot control, and you cannot control what you do not measure, the measurement of HC is a very important issue. This study aims at defining a methodology to improve the quality of prioritization of HC measurement indicators under fuzziness. To do so, a methodology based on the extent fuzzy analytic hierarchy process (AHP) is proposed. Within the model, five main attributes; talent, strategical integration, cultural relevance, knowledge management, and leadership; their sub-attributes, and 20 indicators are defined. The proposed model can be used for any country. However, the results obtained in the numerical example reflect the situation of HC in Turkey, since the experts are asked to make their evaluations considering the cultural characteristics of Turkey. The results of the study indicate that \"creating results by using knowledge\", \"employees' skills index\", \"sharing and reporting knowledge\", and \"succession rate of training programs\" are the four most important measurement indicators for the HC in Turkey. (C) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Prioritization of human capital measurement indicators using fuzzy AHP", "paper_id": "WOS:000243797800014"}