{"auto_keywords": [{"score": 0.0318802032589797, "phrase": "total_reward"}, {"score": 0.015724052495022012, "phrase": "markov"}, {"score": 0.015556930206334117, "phrase": "imprecise_parameters"}, {"score": 0.013944789098735892, "phrase": "computational_costs"}, {"score": 0.01054517824888298, "phrase": "expected_total_reward"}, {"score": 0.010192545056018952, "phrase": "pomdpips"}, {"score": 0.004449452743965974, "phrase": "observation_functions"}, {"score": 0.004133292222875435, "phrase": "new_framework"}, {"score": 0.003941964605885606, "phrase": "interval_case"}, {"score": 0.003799275066001196, "phrase": "possible_values"}, {"score": 0.003623352647973122, "phrase": "probability_distribution"}, {"score": 0.0035477930970463432, "phrase": "possible_distributions"}, {"score": 0.0035013678095961497, "phrase": "new_optimality_criterion"}, {"score": 0.0034283652406607913, "phrase": "pomdps"}, {"score": 0.003069150817884928, "phrase": "parameter_imprecision"}, {"score": 0.002989313352047128, "phrase": "arbitrary_second-order_beliefs"}, {"score": 0.0029346624184926305, "phrase": "imprecisely_specified_state_transition_functions"}, {"score": 0.002850788243123556, "phrase": "second-order_beliefs"}, {"score": 0.0026339933320302725, "phrase": "multiple_optimal_policies"}, {"score": 0.002345424272005733, "phrase": "exact_solution_algorithm"}, {"score": 0.0022307779508260205, "phrase": "computational_complexity"}, {"score": 0.0021669774367188673, "phrase": "empirical_studies"}, {"score": 0.002132947962296264, "phrase": "satisfactory_policies"}], "paper_keywords": ["POMDP", " second-order beliefs", " parameter set", " probability interval"], "paper_abstract": "This study extends the framework of partially observable Markov decision processes (POMDPs) to allow their parameters, i.e., the probability values in the state transition functions and the observation functions, to be imprecisely specified. It is shown that this extension can reduce the computational costs associated with the solution of these problems. First, the new framework, POMDPs with imprecise parameters (POMDPIPs), is formulated. We consider (1) the interval case, in which each parameter is imprecisely specified by an interval that indicates possible values of the parameter, and (2) the point-set case, in which each probability distribution is imprecisely specified by a set of possible distributions. Second, a new optimality criterion for POMDPIPs is introduced. As in POMDPs, the criterion is to regard a policy, i.e., an action-selection rule, as optimal if it maximizes the expected total reward. The expected total reward, however, cannot be calculated precisely in POMDPIPs, because of the parameter imprecision. Instead, we estimate the total reward by adopting arbitrary second-order beliefs, i.e., beliefs in the imprecisely specified state transition functions and observation functions. Although there are many possible choices for these second-order beliefs, we regard a policy as optimal as long as there is at least one of such choices with which the policy maximizes the total reward. Thus there can be multiple optimal policies for a POMDPIP. We regard these policies as equally optimal, and aim at obtaining one of them. By appropriately choosing which second-order beliefs to use in estimating the total reward, computational costs incurred in obtaining such an optimal policy can be reduced significantly. We provide an exact solution algorithm for POMDPIPs that does this efficiently. Third, the performance of such an optimal policy, as well as the computational complexity of the algorithm, are analyzed theoretically. Last, empirical studies show that our algorithm quickly obtains satisfactory policies to many POMDPIPs. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Partially observable Markov decision processes with imprecise parameters", "paper_id": "WOS:000247770200001"}