{"auto_keywords": [{"score": 0.042996465062631, "phrase": "software_managers"}, {"score": 0.00481495049065317, "phrase": "professionals'_information_needs"}, {"score": 0.00471811808206897, "phrase": "empirical_software_engineering"}, {"score": 0.004592016716046632, "phrase": "appropriate_technology"}, {"score": 0.0043058107942196945, "phrase": "empirical_research"}, {"score": 0.004190682785437681, "phrase": "company_decision_makers"}, {"score": 0.0037093941875325862, "phrase": "software_engineering_technologies"}, {"score": 0.0036470559917231218, "phrase": "communication_gap"}, {"score": 0.0034311578789991363, "phrase": "empirical_software_engineering_researchers"}, {"score": 0.0032061793819537633, "phrase": "decision_makers'_information"}, {"score": 0.00304715054446383, "phrase": "software_technology"}, {"score": 0.0028764048059439205, "phrase": "relevant_information"}, {"score": 0.002789907247876628, "phrase": "existing_reporting_guidelines"}, {"score": 0.0026157259734105, "phrase": "experiment_report"}, {"score": 0.0025804616931593897, "phrase": "proposed_model"}, {"score": 0.0025543250296793554, "phrase": "technology's_appropriateness"}, {"score": 0.002185092297972985, "phrase": "development_costs"}, {"score": 0.0021337783230121286, "phrase": "product_quality"}, {"score": 0.0021049977753042253, "phrase": "decision_makers"}], "paper_keywords": ["Software manager", " Information needs", " Technology selection", " Experiment", " Reporting"], "paper_abstract": "Although the aim of empirical software engineering is to provide evidence for selecting the appropriate technology, it appears that there is a lack of recognition of this work in industry. Results from empirical research only rarely seem to find their way to company decision makers. If information relevant for software managers is provided in reports on experiments, such reports can be considered as a source of information for them when they are faced with making decisions about the selection of software engineering technologies. To bridge this communication gap between researchers and professionals, we propose characterizing the information needs of software managers in order to show empirical software engineering researchers which information is relevant for decision-making and thus enable them to make this information available. We empirically investigated decision makers' information needs to identify which information they need to judge the appropriateness and impact of a software technology. We empirically developed a model that characterizes these needs. To ensure that researchers provide relevant information when reporting results from experiments, we extended existing reporting guidelines accordingly. We performed an experiment to evaluate our model with regard to its effectiveness. Software managers who read an experiment report according to the proposed model judged the technology's appropriateness significantly better than those reading a report about the same experiment that did not explicitly address their information needs. Our research shows that information regarding a technology, the context in which it is supposed to work, and most importantly, the impact of this technology on development costs and schedule as well as on product quality is crucial for decision makers.", "paper_title": "Reporting experiments to satisfy professionals' information needs", "paper_id": "WOS:000343910700011"}