{"auto_keywords": [{"score": 0.03861999295576571, "phrase": "battery_life"}, {"score": 0.00481495049065317, "phrase": "energy_efficient_monitoring"}, {"score": 0.004791539509460757, "phrase": "sensor_networks"}, {"score": 0.004676173016967478, "phrase": "efficient_battery_energy_utilization"}, {"score": 0.004608284537368354, "phrase": "wireless_sensor_network"}, {"score": 0.004530320329534992, "phrase": "sensor_network_lifetime"}, {"score": 0.004453669239644422, "phrase": "basic_problem"}, {"score": 0.00394245456672012, "phrase": "sensor_network"}, {"score": 0.0038474525637752946, "phrase": "k_sets"}, {"score": 0.003718269036351807, "phrase": "different_time-slot"}, {"score": 0.003506786811867418, "phrase": "total_coverage"}, {"score": 0.003398668159915177, "phrase": "np"}, {"score": 0.0033397385936467204, "phrase": "improved_approximation_algorithm"}, {"score": 0.003275161642653995, "phrase": "max_k-cut"}, {"score": 0.0031420385282097804, "phrase": "almost_optimal_solutions"}, {"score": 0.0029632328136277968, "phrase": "alpha_different_sets"}, {"score": 0.0027945739686623585, "phrase": "richer_space"}, {"score": 0.0027472099202288823, "phrase": "different_coverage_requirements"}, {"score": 0.0026290604866305058, "phrase": "time_slot"}, {"score": 0.002461271691636336, "phrase": "time_slots"}, {"score": 0.0024313928936469955, "phrase": "randomized_rounding_algorithm"}, {"score": 0.0022158306933307685, "phrase": "directional_camera"}, {"score": 0.0021570679320000565, "phrase": "adjacent_targets"}, {"score": 0.0021049977753042253, "phrase": "first_approximation_algorithms"}], "paper_keywords": ["Algorithms", " Complexity", " Approximation algorithm", " Sensor networks", " Energy efficiency", " Target monitoring"], "paper_abstract": "We study a set of problems related to efficient battery energy utilization for monitoring applications in a wireless sensor network with the goal to increase the sensor network lifetime. We study several generalizations of a basic problem called Set k-Cover. The problem can be described as follows: we are given a set of sensors, and a set of targets to be monitored. Each target can be monitored by a subset of the sensors. To increase the lifetime of the sensor network, we would like to partition the sensors into k sets (or time-slots), and activate each set of sensors in a different time-slot, thus extending the battery life of the sensors by a factor of k. The goal is to find a partitioning that maximizes the total coverage of the targets for a given k. This problem is known to be NP-hard. We develop an improved approximation algorithm for this problem using a reduction to Max k-Cut. Moreover, we are able to demonstrate that this algorithm is efficient, and yields almost optimal solutions in practice. We also consider generalizations of this problem in several different directions. First, we allow each sensor to be active in alpha different sets (time-slots). This means that the battery life is extended by a factor of k/alpha, and allows for a richer space of solutions. We also consider different coverage requirements, such as requiring that all targets, or at least a certain number of targets, be covered in each time slot. In the Set k-Cover formulation, there is no requirement that a target be monitored at all, or in any number of time slots. We develop a randomized rounding algorithm for this problem. We also consider extensions where each sensor can monitor only a bounded number of targets in any time-slot, and not all the targets adjacent to it. This kind of problem may arise when a sensor has a directional camera, or some other physical constraint might prevent it from monitoring all adjacent targets even when it is active. We develop the first approximation algorithms for this problem.", "paper_title": "Energy Efficient Monitoring in Sensor Networks", "paper_id": "WOS:000286525300008"}