{"auto_keywords": [{"score": 0.047547044341195374, "phrase": "key_exchange_protocols"}, {"score": 0.011180088972858425, "phrase": "explicit_server_authentication"}, {"score": 0.011046906221865663, "phrase": "implicit_server_authentication"}, {"score": 0.008232454355542226, "phrase": "proposed_protocols"}, {"score": 0.00481495049065317, "phrase": "key_exchange"}, {"score": 0.004757227624616643, "phrase": "server_public_keys"}, {"score": 0.004216566615939546, "phrase": "network_communications"}, {"score": 0.003969640975997097, "phrase": "public_networks"}, {"score": 0.0038749521906474593, "phrase": "easy-to-remember_passwords"}, {"score": 0.003252542052430779, "phrase": "mutual_authentication"}, {"score": 0.0024336917123957387, "phrase": "public_keys"}, {"score": 0.0022771244331421586, "phrase": "random_oracle_model"}, {"score": 0.002222717552124615, "phrase": "existing_protocols"}, {"score": 0.0021049977753042253, "phrase": "greater_security"}], "paper_keywords": ["Authentication", " 3PAKE", " Password-based", " Three-party key exchange", " Network security", " Communicating protocol"], "paper_abstract": "Password-based three-party authenticated key exchange protocols are extremely important to secure communications and are now extensively adopted in network communications. These protocols allow users to communicate securely over public networks simply by using easy-to-remember passwords. In considering authentication between a server and user, this study categorizes password-based three-party authenticated key exchange protocols into explicit server authentication and implicit server authentication. The former must achieve mutual authentication between a server and users while executing the protocol, while the latter only achieves authentication among users. This study presents two novel, simple and efficient three-party authenticated key exchange protocols. One protocol provides explicit server authentication, and the other provides implicit server authentication. The proposed protocols do not require server public keys. Additionally, both protocols have proven secure in the random oracle model. Compared with existing protocols, the proposed protocols are more efficient and provide greater security. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Simple password-based three-party authenticated key exchange without server public keys", "paper_id": "WOS:000275707200013"}