{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "business_value"}, {"score": 0.0230080390463545, "phrase": "open_source_infrastructure_technologies"}, {"score": 0.004413846562278824, "phrase": "proprietary_or_commercial_solutions"}, {"score": 0.0037087324991876727, "phrase": "new_model"}, {"score": 0.003637669525737665, "phrase": "organizational_benefits"}, {"score": 0.0033021988455635403, "phrase": "human_and_technological_capacities"}, {"score": 0.0029830992938695007, "phrase": "technologies'_communities"}, {"score": 0.0028421434495262796, "phrase": "open_source_databases"}, {"score": 0.002707829887747594, "phrase": "open_source_infrastructure_technology"}, {"score": 0.0026687841359431105, "phrase": "pls_analysis"}, {"score": 0.002530359917257626, "phrase": "absorptive_capacity"}, {"score": 0.0023417010799384524, "phrase": "open_source_it_infrastructure"}, {"score": 0.0023079225317714815, "phrase": "mysql_utilization"}, {"score": 0.0022202042044679984, "phrase": "open_source_technology"}, {"score": 0.0021254913611527455, "phrase": "numerous_potential_benefits"}, {"score": 0.0021049977753042253, "phrase": "open_source_technologies"}], "paper_keywords": ["Open source", " IT infrastructure", " business value of IT", " databases", " absorptive capacity", " value co-creation", " community-of-practice"], "paper_abstract": "Organizations are increasingly interested in exploring Free/Libre Open Source Software (FLOSS) based technologies as viable alternatives to proprietary or commercial solutions, but research on the business value of such technologies is lacking. In this paper, we contribute to this important, yet understudied, topic by examining the antecedents of the business value of open source infrastructure technologies. The paper puts forward a new model for explicating the organizational benefits of these technologies. Our findings suggest that in order to realize benefits from open source infrastructure technologies, organizations should have the human and technological capacities to absorb and utilize them as well as the ability to establish, maintain, and leverage ties with the technologies' communities of developers and users. The paper focuses on open source databases (specifically, MySQL) as an instance of open source infrastructure technology. A PLS analysis of 149 responses from organizations that have implemented MySQL revealed that absorptive capacity for the database, ties with the technology's user/developer community-of-practice, and an open source IT infrastructure that facilitates MySQL utilization explain about 20 per cent of the business value of the open source technology. These findings should help organizations realize the numerous potential benefits of open source technologies.", "paper_title": "An Empirical Analysis of the Business Value of Open Source Infrastructure Technologies", "paper_id": "WOS:000286316700005"}