{"auto_keywords": [{"score": 0.04953037099094609, "phrase": "dutch_patients"}, {"score": 0.01159084937434577, "phrase": "ethnographic_research"}, {"score": 0.011371750097739967, "phrase": "lay_assessment_practices"}, {"score": 0.004723322467153553, "phrase": "web-based_medical_information"}, {"score": 0.004545240514015278, "phrase": "end_users"}, {"score": 0.00451043437607004, "phrase": "reliable_health-related_information"}, {"score": 0.004407599980762272, "phrase": "assessment_practices"}, {"score": 0.004081385289516914, "phrase": "important_background_information"}, {"score": 0.003957735532719663, "phrase": "medical_content"}, {"score": 0.0037072310568610723, "phrase": "information_reliability"}, {"score": 0.00322769360059123, "phrase": "qualitative_interviews"}, {"score": 0.0031906408161077792, "phrase": "patient_search_practices"}, {"score": 0.0030583717270715556, "phrase": "last_searches"}, {"score": 0.002954228277691572, "phrase": "standardized_questions"}, {"score": 0.002820850247525606, "phrase": "special_user_tools"}, {"score": 0.002601727192945944, "phrase": "explicit_strategies"}, {"score": 0.002474674704809152, "phrase": "offline_triangulation"}, {"score": 0.002427473263013356, "phrase": "information_provider_information"}, {"score": 0.002326767693352058, "phrase": "standardized_checklists"}, {"score": 0.0021625417261202603, "phrase": "current_literature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["medical end users", " reliability of world wide web"], "paper_abstract": "Introduction: In the discussion about helping lay end users find reliable health-related information on the web, lay assessment practices of the reliability of information are often dismissed as insufficient. It is suggested that patients do not check important background information (authors, dates) for the medical content on websites. However, little effort has been made to understand how lay practices enable patients to assess information reliability in respect to their specific health situations. Objective: This paper draws upon ethnographic research among Dutch patients to understand lay assessment practices. Objective: This paper draws upon ethnographic research among Dutch patients to understand lay assessment practices. Methods: We conducted qualitative interviews and observed patient search practices. Patients were asked to describe and then repeat the Last searches they had conducted. They were also given standardized questions for searching for information. Results: Patients did not utilize special user tools (checklists, seats, portals) to assist in searching for and evaluating information. However, we saw explicit strategies for checking information within their established patterns of searching, such as on and offline triangulation of information and checking information provider information and dates. Conclusion: Although patients do not follow standardized checklists, this is not to say that they are not assessing information. Their assessment processes are more extensive than current literature suggests. (c) 2005 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Looking for answers, constructing reliability: An exploration into how Dutch patients check web-based medical information", "paper_id": "WOS:000234947400007"}