{"auto_keywords": [{"score": 0.005529907751140459, "phrase": "corresponding_plpenn_solver"}, {"score": 0.004600228893803583, "phrase": "joint-angle_drift_phenomenon"}, {"score": 0.0044398358177815305, "phrase": "novel_scheme"}, {"score": 0.004395040468458808, "phrase": "simultaneous_repetitive_motion_planning"}, {"score": 0.004220314322073171, "phrase": "joint-acceleration_level"}, {"score": 0.0039310261964323545, "phrase": "performance_index"}, {"score": 0.003871653343842317, "phrase": "srmpc_subscheme"}, {"score": 0.003717656912608012, "phrase": "gradient_dynamics"}, {"score": 0.0032415934630668484, "phrase": "zhang_neural-dynamics_method"}, {"score": 0.0028697077879305064, "phrase": "piecewise-linear_projection_equation-based_neural_network"}, {"score": 0.0027414948679658816, "phrase": "unified_qp_problem"}, {"score": 0.0026592094867526803, "phrase": "strictly_convex_qp_problem"}, {"score": 0.002618995204424126, "phrase": "inverse-free_manner"}, {"score": 0.002248755794042486, "phrase": "computer-simulation_results"}, {"score": 0.0021591707887653865, "phrase": "srmpc_scheme"}, {"score": 0.0021049977753042253, "phrase": "synchronous_manipulation"}], "paper_keywords": ["Gradient dynamics", " joint-acceleration level", " quadratic program (QP)", " simultaneous repetitive motion planning and control (SRMPC)", " two redundant robot arms"], "paper_abstract": "In this paper, to remedy the joint-angle drift phenomenon for manipulation of two redundant robot arms, a novel scheme for simultaneous repetitive motion planning and control (SRMPC) at the joint-acceleration level is proposed, which consists of two subschemes. To do so, the performance index of each SRMPC subscheme is derived and designed by employing the gradient dynamics twice, of which a convergence theorem and its proof are presented. In addition, for improving the accuracy of the motion planning and control, position error, and velocity, error feedbacks are incorporated into the forward kinematics equation and analyzed via Zhang neural-dynamics method. Then the two subschemes are simultaneously reformulated as two quadratic programs (QPs), which are finally unified into one QP problem. Furthermore, a piecewise-linear projection equation-based neural network (PLPENN) is used to solve the unified QP problem, which can handle the strictly convex QP problem in an inverse-free manner. More importantly, via such a unified QP formulation and the corresponding PLPENN solver, the synchronism of two redundant robot arms is guaranteed. Finally, two given tasks are fulfilled by 2 three-link and 2 five-link planar robot arms, respectively. Computer-simulation results validate the efficacy and accuracy of the SRMPC scheme and the corresponding PLPENN solver for synchronous manipulation of two redundant robot arms.", "paper_title": "G2-Type SRMPC Scheme for Synchronous Manipulation of Two Redundant Robot Arms", "paper_id": "WOS:000348071500001"}