{"auto_keywords": [{"score": 0.04159113919702044, "phrase": "scj"}, {"score": 0.018649946749635493, "phrase": "ancestral_genomes"}, {"score": 0.008990384722119901, "phrase": "scj's_ability"}, {"score": 0.00481495049065317, "phrase": "single-cut-or-join_operation"}, {"score": 0.0046183948967353766, "phrase": "multichromosomal_genomes"}, {"score": 0.004375839387349825, "phrase": "new_distance"}, {"score": 0.004269820894273856, "phrase": "relevant_problems"}, {"score": 0.0041971335590067676, "phrase": "evolutionary_history"}, {"score": 0.004115570004186379, "phrase": "current_knowledge"}, {"score": 0.004055434970616805, "phrase": "evolutionary_reconstruction"}, {"score": 0.003947451229473741, "phrase": "evolutionary_topologies"}, {"score": 0.0037400009050652765, "phrase": "scj-based_methods"}, {"score": 0.0035521221228706277, "phrase": "first_question"}, {"score": 0.0033819418638350073, "phrase": "robinson-foulds_distance"}, {"score": 0.0032357392638163803, "phrase": "original_splits"}, {"score": 0.003188418800032085, "phrase": "reconstructed_tree"}, {"score": 0.0031572556929059053, "phrase": "second_question"}, {"score": 0.0029258152870805586, "phrase": "gene_adjacencies"}, {"score": 0.0025686401881053517, "phrase": "relatively_larger_amount"}, {"score": 0.002556048933789233, "phrase": "false_negatives"}, {"score": 0.0025124623973213083, "phrase": "real_data"}, {"score": 0.002494010152215751, "phrase": "campanulaceae_and_protostomes_groups"}, {"score": 0.002427501007681458, "phrase": "accepted_trees"}, {"score": 0.0021894328283867085, "phrase": "typical_desktop_computer"}, {"score": 0.0021310679044789006, "phrase": "java"}, {"score": 0.0021049977753042253, "phrase": "significant_effort"}], "paper_keywords": ["Genome rearrangement", " phylogeny"], "paper_abstract": "Recently, the Single-Cut-or-Join (SCJ) operation was proposed as a basis for a new rearrangement distance between multichromosomal genomes, leading to very fast algorithms, both in theory and in practice. However, it was not clear how well this new distance fares when it comes to using it to solve relevant problems, such as the reconstruction of evolutionary history. In this paper, we advance current knowledge, by testing SCJ's ability regarding evolutionary reconstruction in two aspects: 1) How well does SCJ reconstruct evolutionary topologies? and 2) How well does SCJ reconstruct ancestral genomes? In the process of answering these questions, we implemented SCJ-based methods, and made them available to the community. We ran experiments using as many as 200 genomes, with as many as 3,000 genes. For the first question, we found out that SCJ can recover typically between 60 percent and more than 95 percent of the topology, as measured through the Robinson-Foulds distance (a.k.a. split distance) between trees. In other words, 60 percent to more than 95 percent of the original splits are also present in the reconstructed tree. For the second question, given a topology, SCJ's ability to reconstruct ancestral genomes depends on how far from the leaves the ancestral is. For nodes close to the leaves, about 85 percent of the gene adjacencies can be recovered. This percentage decreases as we move up the tree, but, even at the root, about 50 percent of the adjacencies are recovered, for as many as 64 leaves. Our findings corroborate the fact that SCJ leads to very conservative genome reconstructions, yielding very few false-positive gene adjacencies in the ancestrals, at the expense of a relatively larger amount of false negatives. In addition, experiments with real data from the Campanulaceae and Protostomes groups show that SCJ reconstructs topologies of quality comparable to the accepted trees of the species involved. As far as time is concerned, the methods we implemented can find a topology for 64 genomes with 2,000 genes each in about 10.7 minutes, and reconstruct the ancestral genomes in a 64-leaf tree in about 3 seconds, both on a typical desktop computer. It should be noted that our code is written in Java and we made no significant effort to optimize it.", "paper_title": "Rearrangement-Based Phylogeny Using the Single-Cut-or-Join Operation", "paper_id": "WOS:000319477300012"}