{"auto_keywords": [{"score": 0.049757144405741305, "phrase": "qualitative_preferences"}, {"score": 0.005403791879076138, "phrase": "new_procedure"}, {"score": 0.00481495049065317, "phrase": "satisfiability_problems"}, {"score": 0.004531357177195719, "phrase": "central_issue"}, {"score": 0.004500891637057374, "phrase": "artificial_intelligence"}, {"score": 0.004293267161763508, "phrase": "propositional_satisfiability"}, {"score": 0.003932654396285872, "phrase": "branching_heuristic"}, {"score": 0.0038930368103015467, "phrase": "sat_solver"}, {"score": 0.003802135020791801, "phrase": "first_solution"}, {"score": 0.0035539019235553897, "phrase": "previous_one"}, {"score": 0.003412783661090541, "phrase": "specific_classes"}, {"score": 0.0033330581836898032, "phrase": "empty_partial_order"}, {"score": 0.003255189076644247, "phrase": "superior_performance"}, {"score": 0.00305285084207725, "phrase": "new_effective_procedure"}, {"score": 0.0028824650336365465, "phrase": "first_approach"}, {"score": 0.002631131751548729, "phrase": "better_solutions"}, {"score": 0.0025870463897472943, "phrase": "experimental_analysis"}, {"score": 0.0025609496151442696, "phrase": "previous_papers"}, {"score": 0.002526561920777972, "phrase": "wide_variety"}, {"score": 0.002442594378453517, "phrase": "non-empty_partial_order"}, {"score": 0.0022829193139224636, "phrase": "\"hard\"_problems"}, {"score": 0.0022522565004588113, "phrase": "preliminary_result"}, {"score": 0.0021049977753042253, "phrase": "quantitative_preferences"}], "paper_keywords": ["Satisfiability", " preferences", " search", " experimental evaluation"], "paper_abstract": "The ability to effectively reason in the presence of qualitative preferences on literals or formulas is a central issue in Artificial Intelligence. In the last few years, two procedures have been presented in order to reason with propositional satisfiability (SAT) problems in the presence of additional, partially ordered qualitative preferences on literals or formulas: the first requires a modification of the branching heuristic of the SAT solver in order to guarantee that the first solution is optimal, while the second computes a sequence of solutions, each guaranteed to be better than the previous one. The two approaches have their own advantages and disadvantages and when compared on specific classes of instances - each having an empty partial order - the second seems to have superior performance. In this paper we show that the above two approaches for reasoning with qualitative preferences can be combined yielding a new effective procedure. In particular, in the new procedure we modify the branching heuristic - as in the first approach - by possibly changing the polarity of the returned literal, and then we continue the search - as in the second approach - looking for better solutions. We extended the experimental analysis conducted in previous papers by considering a wide variety of problems, having both an empty and a non-empty partial order: the results show that the new procedure performs better than the two previous approaches on average, and especially on the \"hard\" problems. As a preliminary result, we show that the framework of qualitative preferences on literals is more general and expressive than the framework on quantitative preferences.", "paper_title": "Combining approaches for solving satisfiability problems with qualitative preferences", "paper_id": "WOS:000324551500004"}