{"auto_keywords": [{"score": 0.0449978553936974, "phrase": "reaction_rules"}, {"score": 0.029606819671378203, "phrase": "saturated_semantics"}, {"score": 0.00481495049065317, "phrase": "process_calculi"}, {"score": 0.004676575291629554, "phrase": "labelled_transition_systems"}, {"score": 0.00443308765153716, "phrase": "name_calculi"}, {"score": 0.003614044704141927, "phrase": "unlabelled_transition_systems"}, {"score": 0.0031383410838018984, "phrase": "resulting_equivalences"}, {"score": 0.0029602552900111433, "phrase": "standard_semantics"}, {"score": 0.002725081358527507, "phrase": "weaker_notion"}, {"score": 0.002424471831667623, "phrase": "petri"}, {"score": 0.002199363362666037, "phrase": "coalgebraic_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Behavioral equivalences", " Reactive systems", " Logic programming", " Petri nets"], "paper_abstract": "The semantics of process calculi has traditionally been specified by labelled transition systems (LTSS), but, with the development of name calculi, it turned Out that reaction rules (i.e., Unlabelled transition rules) are often more natural. This leads to the question of how behavioral equivalences (bisimilarity, trace equivalence, etc.) defined for US can be transferred to unlabelled transition systems. Recently, in order to answer this question, several proposals have been made with the aim of automatically deriving an LTS from reaction rules in Such a way that the resulting equivalences are congruences. Furthermore, these equivalences should agree with the standard semantics, whenever one exists. In this paper, we propose saturated semantics, based on a weaker notion of observation and orthogonal to all the previous proposals, and we demonstrate the appropriateness of our semantics by means of two examples: logic programming and open Petri nets. We also show that saturated semantics can be efficiently characterized through the so called semi-saturated games. Finally, we provide coalgebraic models relying on presheaves. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Reactive systems, (semi-)saturated semantics and coalgebras on presheaves", "paper_id": "WOS:000269865800004"}