{"auto_keywords": [{"score": 0.033755479770491835, "phrase": "parity_games"}, {"score": 0.011400787621416596, "phrase": "muller_games"}, {"score": 0.009024341466542678, "phrase": "infinitely_many_priorities"}, {"score": 0.008027331682312164, "phrase": "min-parity_games"}, {"score": 0.00481495049065317, "phrase": "positional_determinacy_of_games"}, {"score": 0.004696407360309416, "phrase": "two-player_games"}, {"score": 0.00456448259718331, "phrase": "finite_or_infinite_game_graphs"}, {"score": 0.004326987090971404, "phrase": "current_position"}, {"score": 0.003916098498242888, "phrase": "positional_winning_strategy"}, {"score": 0.003531474887552889, "phrase": "finite_set"}, {"score": 0.0035189057079817285, "phrase": "c._specifically"}, {"score": 0.003218764138744059, "phrase": "important_special_case"}, {"score": 0.002912803994461996, "phrase": "finite-memory_strategies"}, {"score": 0.002654730366598922, "phrase": "pushdown_games"}, {"score": 0.002635850034826311, "phrase": "winning_conditions"}, {"score": 0.0026077803487003, "phrase": "stack_contents"}, {"score": 0.002480680078868508, "phrase": "max-parity_games"}, {"score": 0.002368198542691635, "phrase": "infinite_memory"}, {"score": 0.0021893168527276105, "phrase": "min-parity_condition"}, {"score": 0.0021276671435454656, "phrase": "positional_determinacy"}, {"score": 0.0021049977753042253, "phrase": "game_graphs"}], "paper_keywords": ["Games", " logic", " positional determinacy", " parity games", " Muller games"], "paper_abstract": "We study two-player games of infinite duration that are played on finite or infinite game graphs. A winning strategy for such a game is positional if it only depends on the current position, and not on the history of the play. A game is positionally determined if, from each position, one of the two players has a positional winning strategy. The theory of such games is well studied for winning conditions that are defined in terms of a mapping that assigns to each position a priority from a finite set C. Specifically, in Muller games the winner of a play is determined by the set of those priorities that have been seen infinitely often; an important special case are parity games where the least (or greatest) priority occurring infinitely often determines the winner. It is well-known that parity games are positionally determined whereas Muller games are determined via finite-memory strategies. In this paper, we extend this theory to the case of games with infinitely many priorities. Such games arise in several application areas, for instance in pushdown games with winning conditions depending on stack contents. For parity games there are several generalisations to the case of infinitely many priorities. While max-parity games over omega or min-parity games over larger ordinals than omega require strategies with infinite memory, we can prove that min-parity games with priorities in omega are positionally determined. Indeed, it turns out that the min-parity condition over omega is the only infinitary Muller condition that guarantees positional determinacy on all game graphs.", "paper_title": "POSITIONAL DETERMINACY OF GAMES WITH INFINITELY MANY PRIORITIES", "paper_id": "WOS:000209479600006"}