{"auto_keywords": [{"score": 0.028294782921857924, "phrase": "multi-user_polling"}, {"score": 0.004815309424877423, "phrase": "mac"}, {"score": 0.004751216062917875, "phrase": "next-generation_wlans"}, {"score": 0.004709193603747991, "phrase": "wireless_lan_technology"}, {"score": 0.004565007074039171, "phrase": "revolutionary_development"}, {"score": 0.004048860957751714, "phrase": "unreliable_wireless_nature"}, {"score": 0.003942299471749811, "phrase": "relatively_large_overhead"}, {"score": 0.0038556354709511818, "phrase": "throughput_performance"}, {"score": 0.003754140294151593, "phrase": "underlying_physical_layer_rate"}, {"score": 0.0034963499042536617, "phrase": "wlan"}, {"score": 0.003359119985242403, "phrase": "higher-capacity_wlans"}, {"score": 0.0031703706626348507, "phrase": "new_medium_access_control_protocol"}, {"score": 0.003128336741911927, "phrase": "next-generation_highspeed_wlans"}, {"score": 0.0030868583963299698, "phrase": "proposed_medium_access_control"}, {"score": 0.0025950024597986366, "phrase": "contention_overhead"}, {"score": 0.0025266078302900036, "phrase": "higher_network_utilization"}, {"score": 0.0024930878032164757, "phrase": "polling_controlled_channel_access"}, {"score": 0.002220551141101661, "phrase": "improved_medium_access_control_performance"}, {"score": 0.0021716540012278744, "phrase": "aggregate_throughput"}, {"score": 0.0021049977753042253, "phrase": "relevant_qos_requirements"}], "paper_keywords": [""], "paper_abstract": "Wireless LAN technology has been shown to be a revolutionary development during the last decade. Recently popularized IEEE 802.11a/g-based products can support up to 54 Mb/s physical layer rate and provide wireless access to the Internet. However, in order to deal robustly with the unreliable wireless nature, the 802.11 medium access control protocol has a relatively large overhead and hence, the throughput performance is much worse than the underlying physical layer rate. Moreover, along with many emerging applications and services over WLANs, such as voice over WLAN and audio/video streaming, the demand for faster and higher-capacity WLANs has been growing recently. In this article, we propose a new medium access control protocol for the next-generation highspeed WLANs. The proposed medium access control, called multi-user polling controlled channel access, is composed of two components: multi-layer frame aggregation, which performs aggregation at both the medium access control and the physical layers; and multi-user polling, used to reduce the contention overhead and in turn, achieve higher network utilization. Multi-user polling controlled channel access is compared with the 802.11e-enhanced distributed channel access medium access control. Highly enhanced medium access control efficiency can be achieved by applying multi-user polling controlled channel access. We show the improved medium access control performance in terms of the aggregate throughput of non-QoS flows with relevant QoS requirements.", "paper_title": "MCCA: A high-throughput MAC strategy for next-generation WLANs", "paper_id": "WOS:000253325100006"}