{"auto_keywords": [{"score": 0.0490692031182167, "phrase": "design_patterns"}, {"score": 0.007312458270244395, "phrase": "different_types"}, {"score": 0.00481495049065317, "phrase": "design_patterns_detection"}, {"score": 0.004663396040465122, "phrase": "reverse_engineering"}, {"score": 0.004540734419151103, "phrase": "program_comprehension"}, {"score": 0.004492573860101133, "phrase": "design_recovery"}, {"score": 0.0037474693720823643, "phrase": "building_blocks"}, {"score": 0.0028391271282216758, "phrase": "different_micro-structures"}, {"score": 0.0027349450784503273, "phrase": "different_design_motifs"}, {"score": 0.0026771333996253783, "phrase": "statistical_analysis"}, {"score": 0.002537880772794665, "phrase": "different_design_patterns"}, {"score": 0.0022685255265595624, "phrase": "combined_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Design patterns", " Micro-structures", " Design motif detection"], "paper_abstract": "One important issue concerning design patterns in reverse engineering is their detection to support program comprehension, design recovery, system (re-)documentation, and software evolution. The objectives of this paper are to identify and analyze different types of building blocks of design patterns and to evaluate if the detection of these building blocks (called micro-structures) is relevant for the detection of occurrences of the design patterns. This analysis is useful to understand how the different types of micro-structures can be combined to better comprehend design patterns and to improve their detection. To achieve the objectives, the paper provides a description of different micro-structures, an analysis of their relevance in different design motifs, and a statistical analysis on the number and types of micro-structures present in different design patterns. Finally, we investigate if the detection of some design patterns can be performed only through the detection of a combined set of micro-structures, or other techniques should be exploited. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Understanding the relevance of micro-structures for design patterns detection", "paper_id": "WOS:000296415100024"}