{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "non-free-choice_constructs"}, {"score": 0.0046221918332842995, "phrase": "event_logs"}, {"score": 0.004539005582217309, "phrase": "business_process"}, {"score": 0.004397000006837371, "phrase": "process_mining"}, {"score": 0.003996983218174335, "phrase": "particular_way"}, {"score": 0.0038368442918503072, "phrase": "diagnosis_and_treatment_activities"}, {"score": 0.0037506567448470163, "phrase": "hospital_information_system"}, {"score": 0.003683097597914604, "phrase": "health-care_professionals"}, {"score": 0.002855251306715901, "phrase": "non-free-choice_behavior"}, {"score": 0.0026790983342162887, "phrase": "petri-net-based_representation"}, {"score": 0.002559951153813876, "phrase": "causal_dependencies"}, {"score": 0.002203016940021265, "phrase": "prom_framework"}, {"score": 0.0021830553825770097, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "existing_process_mining_techniques"}], "paper_keywords": ["process mining", " implicit dependency", " event log", " non-free-choice constructs"], "paper_abstract": "Process mining aims at extracting information from event logs to capture the business process as it is being executed. Process mining is particularly useful in situations where events are recorded but there is no system enforcing people to work in a particular way. Consider for example a hospital where the diagnosis and treatment activities are recorded in the hospital information system, but where health-care professionals determine the \"careflow.\" Many process mining approaches have been proposed in recent years. However, in spite of many researchers' persistent efforts, there are still several challenging problems to be solved. In this paper, we focus on mining non-free-choice constructs, i.e., situations where there is a mixture of choice and synchronization. Although most real-life processes exhibit non-free-choice behavior, existing algorithms are unable to adequately deal with such constructs. Using a Petri-net-based representation, we will show that there are two kinds of causal dependencies between tasks, i.e., explicit and implicit ones. We propose an algorithm that is able to deal with both kinds of dependencies. The algorithm has been implemented in the ProM framework and experimental results shows that the algorithm indeed significantly improves existing process mining techniques.", "paper_title": "Mining process models with non-free-choice constructs", "paper_id": "WOS:000248894200002"}