{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "individualised_computer-generated_feedback"}, {"score": 0.004712988631183401, "phrase": "traditional_way"}, {"score": 0.00418046991987597, "phrase": "computer-based_applications"}, {"score": 0.004127094600862448, "phrase": "students'_answers"}, {"score": 0.0038868464660354626, "phrase": "student's_answers"}, {"score": 0.0037558704408683905, "phrase": "subject_matter"}, {"score": 0.0035676056286816915, "phrase": "computerised_routines"}, {"score": 0.00350696416714684, "phrase": "individual_student's_performance"}, {"score": 0.00319134078848996, "phrase": "specified_areas"}, {"score": 0.003044313656896057, "phrase": "relevant_skills"}, {"score": 0.00296698375549856, "phrase": "appropriate_feedback"}, {"score": 0.002904040426340639, "phrase": "large_numbers"}, {"score": 0.0024252458095689847, "phrase": "traditional_marking"}, {"score": 0.0023233800372985686, "phrase": "subject_instructor"}, {"score": 0.002274059352027922, "phrase": "feedback-generating_applications"}, {"score": 0.0021231452870210965, "phrase": "useful_basis"}], "paper_keywords": ["teaching technology", " computer-generated feedback", " methodology and design", " teaching large classes"], "paper_abstract": "The traditional way of providing feedback to students after tests or assignments is labour-intensive. This paper explains the concepts and techniques used by the author to build computer-based applications that analyse students' answers and generate individualised, detailed and constructive feedback. The paper explains how the data gathered from a student's answers can be combined with other knowledge about the subject matter being taught, and the specific test questions, to create computerised routines that evaluate the individual student's performance. This information can be presented in ways that help students to assess their progress, both in relation to their acquired knowledge in specified areas of study, and with regard to their ability to exercise relevant skills. In this way, appropriate feedback can be provided to large numbers of students quickly and efficiently. The same techniques can be used to provide information to the instructor about the performance of the group as a whole, with a degree of detail and accuracy that exceeds the impressions usually gained through traditional marking. The paper also explains the role of the subject instructor in designing and creating feedback-generating applications. The methodologies described provide insight into the details of the process and are a useful basis for further experimentation and development.", "paper_title": "A methodology for providing individualised computer-generated feedback to students", "paper_id": "WOS:000255137100008"}