{"auto_keywords": [{"score": 0.03970880462070679, "phrase": "dynamical_cluster_index"}, {"score": 0.015496930491878636, "phrase": "complex_systems"}, {"score": 0.00481495049065317, "phrase": "candidate_relevant_subsets"}, {"score": 0.004610934029355486, "phrase": "relevant_subsets"}, {"score": 0.0044314880575692175, "phrase": "dynamical_system"}, {"score": 0.004320932773749168, "phrase": "relevant_subset"}, {"score": 0.004258995791471342, "phrase": "strong_integration"}, {"score": 0.003933813742509612, "phrase": "previous_work"}, {"score": 0.0039055075176836263, "phrase": "neural_networks"}, {"score": 0.0036729522133392175, "phrase": "good_candidate_relevant_subsets"}, {"score": 0.0035683401689358993, "phrase": "previous_knowledge"}, {"score": 0.0034918342672996066, "phrase": "system_variables"}, {"score": 0.0032250366795039715, "phrase": "random_boolean_networks"}, {"score": 0.003178758306417406, "phrase": "whole_network"}, {"score": 0.0031331419276289306, "phrase": "different_subnetworks"}, {"score": 0.003110579040263398, "phrase": "different_topological_relationships"}, {"score": 0.002914669083129816, "phrase": "mapk"}, {"score": 0.002682133505994396, "phrase": "known_dynamical_model"}, {"score": 0.0025868936783877035, "phrase": "significant_aspects"}, {"score": 0.002406415352892016, "phrase": "field_data"}, {"score": 0.0022876085523721324, "phrase": "relative_frequencies"}], "paper_keywords": ["Information theory", " mutual information", " information integration", " dynamical cluster index", " dynamical system", " Boolean networks", " catalytic reactions", " MAPK"], "paper_abstract": "We describe a method to identify relevant subsets of variables, useful to understand the organization of a dynamical system. The variables belonging to a relevant subset should have a strong integration with the other variables of the same relevant subset, and a much weaker interaction with the other system variables. On this basis, extending previous work on neural networks, an information-theoretic measure, the dynamical cluster index, is introduced in order to identify good candidate relevant subsets. The method does not require any previous knowledge of the relationships among the system variables, but relies on observations of their values over time. We show its usefulness in several application domains, including: (i) random Boolean networks, where the whole network is made of different subnetworks with different topological relationships (independent or interacting subnetworks); (ii) leader-follower dynamics, subject to noise and fluctuations; (iii) catalytic reaction networks in a flow reactor; (iv) the MAPK signaling pathway in eukaryotes. The validity of the method has been tested in cases where the data are generated by a known dynamical model and the dynamical cluster index is applied in order to uncover significant aspects of its organization; however, it is important that it can also be applied to time series coming from field data without any reference to a model. Given that it is based on relative frequencies of sets of values, the method could be applied also to cases where the data are not ordered in time. Several indications to improve the scope and effectiveness of the dynamical cluster index to analyze the organization of complex systems are finally given.", "paper_title": "The Search for Candidate Relevant Subsets of Variables in Complex Systems", "paper_id": "WOS:000365192900003"}