{"auto_keywords": [{"score": 0.041778426998238964, "phrase": "wider_community"}, {"score": 0.04092471788849643, "phrase": "quixote_project"}, {"score": 0.00481495049065317, "phrase": "quixote"}, {"score": 0.004786936489838101, "phrase": "collaborative"}, {"score": 0.004768269217639729, "phrase": "open_quantum_chemistry"}, {"score": 0.004722038375317162, "phrase": "internet_age"}, {"score": 0.004703671193348433, "phrase": "computational_quantum_chemistry"}, {"score": 0.00458600558590272, "phrase": "small_to_medium_sized_molecules"}, {"score": 0.004445201314525908, "phrase": "experimental_accuracy"}, {"score": 0.004300310127339099, "phrase": "standard_formats"}, {"score": 0.004250302819248558, "phrase": "unified_databases"}, {"score": 0.004217286731331736, "phrase": "qc_data"}, {"score": 0.0038031945574892386, "phrase": "different_molecular_quantum_chemistry_packages"}, {"score": 0.0037371020555751707, "phrase": "qc"}, {"score": 0.0036648265911110164, "phrase": "standardised_representation"}, {"score": 0.0036221822903900725, "phrase": "software_interoperability"}, {"score": 0.0035660913513115267, "phrase": "analysis_tools"}, {"score": 0.003531474887552889, "phrase": "different_qc_packages"}, {"score": 0.0034363199267463222, "phrase": "repository_infrastructure"}, {"score": 0.003383097368113117, "phrase": "open_software_components"}, {"score": 0.0033437202959232235, "phrase": "individual_researcher"}, {"score": 0.0033048000276562016, "phrase": "community_level"}, {"score": 0.003279104360078518, "phrase": "exciting_possibility"}, {"score": 0.003234615195382533, "phrase": "qc_results"}, {"score": 0.0031474338010045386, "phrase": "crystallography_and_bioinformatics_results"}, {"score": 0.0030986716686217768, "phrase": "quantum_chemists"}, {"score": 0.0030625949549620475, "phrase": "quixote_infrastructure"}, {"score": 0.0029742246613577825, "phrase": "greater_rewards"}, {"score": 0.002854761308379149, "phrase": "valuable_source"}, {"score": 0.0028436364707396613, "phrase": "chemical_data"}, {"score": 0.0027081700202929884, "phrase": "full_definition"}, {"score": 0.0026923527275481804, "phrase": "data_model"}, {"score": 0.0026146376479775, "phrase": "real_value"}, {"score": 0.0025690867646665835, "phrase": "searchable_repositories"}, {"score": 0.0025540797188868037, "phrase": "early_participation"}, {"score": 0.00253916011199984, "phrase": "broader_community"}, {"score": 0.0024803459795996116, "phrase": "early_stages"}, {"score": 0.00243237365704391, "phrase": "chemical_subject"}, {"score": 0.0022583704173318123, "phrase": "incremental_manner"}, {"score": 0.0022451743023649017, "phrase": "additional_value"}, {"score": 0.0021846024965600235, "phrase": "data_management_model"}, {"score": 0.002163367190715979, "phrase": "quantum_chemistry"}, {"score": 0.0021049977753042253, "phrase": "computational_and_experimental_science"}], "paper_keywords": [""], "paper_abstract": "Computational Quantum Chemistry has developed into a powerful, efficient, reliable and increasingly routine tool for exploring the structure and properties of small to medium sized molecules. Many thousands of calculations are performed every day, some offering results which approach experimental accuracy. However, in contrast to other disciplines, such as crystallography, or bioinformatics, where standard formats and well-known, unified databases exist, this QC data is generally destined to remain locally held in files which are not designed to be machine-readable. Only a very small subset of these results will become accessible to the wider community through publication. In this paper we describe how the Quixote Project is developing the infrastructure required to convert output from a number of different molecular quantum chemistry packages to a common semantically rich, machine-readable format and to build respositories of QC results. Such an infrastructure offers benefits at many levels. The standardised representation of the results will facilitate software interoperability, for example making it easier for analysis tools to take data from different QC packages, and will also help with archival and deposition of results. The repository infrastructure, which is lightweight and built using Open software components, can be implemented at individual researcher, project, organisation or community level, offering the exciting possibility that in future many of these QC results can be made publically available, to be searched and interpreted just as crystallography and bioinformatics results are today. Although we believe that quantum chemists will appreciate the contribution the Quixote infrastructure can make to the organisation and and exchange of their results, we anticipate that greater rewards will come from enabling their results to be consumed by a wider community. As the respositories grow they will become a valuable source of chemical data for use by other disciplines in both research and education. The Quixote project is unconventional in that the infrastructure is being implemented in advance of a full definition of the data model which will eventually underpin it. We believe that a working system which offers real value to researchers based on tools and shared, searchable repositories will encourage early participation from a broader community, including both producers and consumers of data. In the early stages, searching and indexing can be performed on the chemical subject of the calculations, and well defined calculation meta-data. The process of defining more specific quantum chemical definitions, adding them to dictionaries and extracting them consistently from the results of the various software packages can then proceed in an incremental manner, adding additional value at each stage. Not only will these results help to change the data management model in the field of Quantum Chemistry, but the methodology can be applied to other pressing problems related to data in computational and experimental science.", "paper_title": "The Quixote project: Collaborative and Open Quantum Chemistry data management in the Internet age", "paper_id": "WOS:000300232100005"}