{"auto_keywords": [{"score": 0.04614766352910894, "phrase": "real-time_model"}, {"score": 0.03808744219400253, "phrase": "specific_respiratory_patterns"}, {"score": 0.004815012705729753, "phrase": "affect"}, {"score": 0.004275904315753662, "phrase": "virtual_humans"}, {"score": 0.0042354707960660706, "phrase": "fourteen_affective_states"}, {"score": 0.0034526191487098093, "phrase": "affective_states"}, {"score": 0.0031244995579170465, "phrase": "respiration_rate"}, {"score": 0.003094920033010818, "phrase": "respiration_depth"}, {"score": 0.003051073364818384, "phrase": "respiration_cycle_curve"}, {"score": 0.002923214590192792, "phrase": "respiratory_patterns"}, {"score": 0.0026705669656375197, "phrase": "virtual_human"}, {"score": 0.002632716358833918, "phrase": "affective_state"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["respiration", " affect", " virtual humans", " real-time"], "paper_abstract": "Affect has been shown to influence respiration in people. This paper takes this insight and proposes a real-time model to express affect through respiration in virtual humans. Fourteen affective states are explored: excitement, relaxation, focus, pain, relief, boredom, anger, fear, panic, disgust, surprise, startle, sadness, and joy. Specific respiratory patterns are described from the literature for each of these affective states. Then, a real-time model of respiration is proposed that uses morphing to animate breathing and provides parameters to control respiration rate, respiration depth and the respiration cycle curve. These parameters are used to implement the respiratory patterns. Finally, a within-subjects study is described where subjects are asked to classify videos of the virtual human expressing each affective state with or without the specific respiratory patterns. The study was presented to 41 subjects and the results show that the model improved perception of excitement, pain, relief, boredom, anger, fear, panic, disgust, and startle. Copyright (C) 2010 John Wiley & Sons, Ltd.", "paper_title": "Real-time expression of affect through respiration", "paper_id": "WOS:000280135400010"}