{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "square_lattice"}, {"score": 0.004339867166576126, "phrase": "two-dimensional_square_lattice"}, {"score": 0.004198722289738563, "phrase": "total_fraction_p"}, {"score": 0.003930000775297499, "phrase": "drift_ability"}, {"score": 0.0038746849003761024, "phrase": "focal_agents"}, {"score": 0.00314708280192844, "phrase": "\"bounded_confidence"}, {"score": 0.0029454679553901613, "phrase": "vacancy_location"}, {"score": 0.002822712709335093, "phrase": "empty_sites"}, {"score": 0.002769805263310232, "phrase": "focal_agent's_neighborhood"}, {"score": 0.00240328454980006, "phrase": "statistical_properties"}, {"score": 0.0023694065215394593, "phrase": "final_state"}, {"score": 0.00218623706110975, "phrase": "dispersal_abilities"}, {"score": 0.0021049977753042253, "phrase": "bounded_confidence"}], "paper_keywords": ["opinion spreading", " consensus formation", " complex network", " bounded confidence"], "paper_abstract": "In this paper, we study a model of opinion spreading and consensus formation on a square lattice. Given a two-dimensional square lattice with periodic boundary condition, a total fraction p of the sites are occupied by agents. We take into account the drift ability of the focal agents whose opinions' difference is too large. The dynamics of the model is governed by the following two rules. At each time step, the agents (or individuals) can exchange their opinions with those of their neighbors if the difference between them is smaller than the \"bounded confidence\" is an element of; Otherwise, one can move to a vacancy location if permitted (i.e., there are any empty sites existing among the focal agent's neighborhood). The distribution of opinions over the population evolves toward either a consensus state that all individuals share the same opinion or polarization and fragmentation states where two or more opinions can coexist. The statistical properties of this final state vary considerably as the parameters p and E change. It is shown that, when dispersal abilities of the individuals are considered, the bounded confidence which is required to attain consensus can be remarkably decreased.", "paper_title": "Opinion spreading and consensus formation on square lattice", "paper_id": "WOS:000251711700001"}