{"auto_keywords": [{"score": 0.008596364137702362, "phrase": "proxy_cache"}, {"score": 0.00481495049065317, "phrase": "design_and_evaluation"}, {"score": 0.004706895428234964, "phrase": "peer-to-peer_traffic"}, {"score": 0.004518442937844318, "phrase": "current_internet_traffic"}, {"score": 0.004337502738649814, "phrase": "isp_networks"}, {"score": 0.0041827333568982055, "phrase": "customer_networks"}, {"score": 0.0038895008852940323, "phrase": "negative_impacts"}, {"score": 0.003503497128638099, "phrase": "caching_system"}, {"score": 0.0027159094186967247, "phrase": "new_storage_system"}, {"score": 0.0026069623057065664, "phrase": "storage_system"}, {"score": 0.002391067964886602, "phrase": "new_algorithm"}, {"score": 0.002124247104243502, "phrase": "actual_implementation"}], "paper_keywords": ["Caching", " peer-to-peer systems", " file sharing", " storage systems", " performance evaluation"], "paper_abstract": "Peer-to-peer (P2P) systems generate a major fraction of the current Internet traffic, and they significantly increase the load on ISP networks and the cost of running and connecting customer networks (e. g., universities and companies) to the Internet. To mitigate these negative impacts, many previous works in the literature have proposed caching of P2P traffic, but very few (if any) have considered designing a caching system to actually do it. This paper demonstrates that caching P2P traffic is more complex than caching other Internet traffic, and it needs several new algorithms and storage systems. Then, the paper presents the design and evaluation of a complete, running, proxy cache for P2P traffic, called pCache. pCache transparently intercepts and serves traffic from different P2P systems. A new storage system is proposed and implemented in pCache. This storage system is optimized for storing P2P traffic, and it is shown to outperform other storage systems. In addition, a new algorithm to infer the information required to store and serve P2P traffic by the cache is proposed. Furthermore, extensive experiments to evaluate all aspects of pCache using actual implementation and real P2P traffic are presented.", "paper_title": "Design and Evaluation of a Proxy Cache for Peer-to-Peer Traffic", "paper_id": "WOS:000290867300005"}