{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "point_target"}, {"score": 0.021777270889720427, "phrase": "distributed_target"}, {"score": 0.005777646121582454, "phrase": "traditional_algorithms"}, {"score": 0.004722898398399427, "phrase": "neural_network"}, {"score": 0.004668510065740584, "phrase": "important_study"}, {"score": 0.0040002088320302935, "phrase": "desired_target"}, {"score": 0.003833749901796579, "phrase": "pulse_compression_processing"}, {"score": 0.0037170399498025215, "phrase": "pulse_compression_algorithms"}, {"score": 0.0033616344666486725, "phrase": "point_target's_range_sidelobes"}, {"score": 0.0032592499906265882, "phrase": "weak_distributed_target"}, {"score": 0.00317221667574882, "phrase": "extended_range"}, {"score": 0.003087500254099842, "phrase": "neighboring_point_target"}, {"score": 0.0028138046006772593, "phrase": "valid_data"}, {"score": 0.002686169280393858, "phrase": "well_performance"}, {"score": 0.002665465323614577, "phrase": "nnpc."}, {"score": 0.0025842289219860795, "phrase": "direct_autocorrelation_filter"}, {"score": 0.0025643157872770844, "phrase": "acf"}, {"score": 0.0025347150832077175, "phrase": "least_squares"}, {"score": 0.0023188652648490874, "phrase": "proposed_nnpc"}, {"score": 0.0022744242010653997, "phrase": "high_signal-to-sidelobe_ratio"}, {"score": 0.002213632404491679, "phrase": "isl"}, {"score": 0.0021796224306652326, "phrase": "high_target_discrimination_ratio"}, {"score": 0.0021213575697367148, "phrase": "nnpc_algorithm"}, {"score": 0.0021049977753042253, "phrase": "significant_advantages"}], "paper_keywords": ["barker code", " distributed target", " least squares inverse filter", " linear programming filter", " neural network", " pulse compression", " point target", " sidelobe"], "paper_abstract": "An important study of the responses to the point target and the distributed target of the radar echoes processed by a neural network pulse compression (NNPC) algorithm is presented in this paper. For whatever the purpose of a radar system, both of the point target and distributed target echoes are received simultaneously. It is always necessary and helpful to discriminate them clearly while detecting the desired target, which will reduce the influence for each other in pulse compression processing. However, in most of the pulse compression algorithms, it is only considered the radar purpose to process one type of the targets but neglect the other. This will make either the presence of a point target's range sidelobes masking and corrupting the observation of the weak distributed target nearby or a distributed target with extended range interfering with the detection of the neighboring point target. By completely considering the interactions of a point target with a distributed target, we acquire all the possible data occurred in the procedure. Using these valid data, we can train the backpropagation (BP) network to construct it as a well performance of NNPC. To compare with the traditional algorithms such as direct autocorrelation filter (ACF), least squares (LS) inverse filter, and linear programming (LP) filter based on 13-element Barker code (B13 code), the proposed NNPC provides the requirements of high signal-to-sidelobe ratio, low integrated sidelobe level (ISL), and high target discrimination ratio. Simulation results show that this NNPC algorithm has significant advantages in targets discrimination ability, range resolution ability, and noise rejection performance while processing the interaction of point target with distributed target, which are superior to the traditional algorithms.", "paper_title": "Radar pulse compression for point target and distributed target using neural network", "paper_id": "WOS:000243764700010"}