{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spanish"}, {"score": 0.004730458558634266, "phrase": "real-time_analysis"}, {"score": 0.0045122922461952805, "phrase": "important_platform"}, {"score": 0.004278807087784626, "phrase": "political_decisions"}, {"score": 0.003584025547693836, "phrase": "spanish_politicians"}, {"score": 0.0032800186243040663, "phrase": "sentistrength"}, {"score": 0.003073545175760353, "phrase": "spanish_political_tweeting"}, {"score": 0.0025587867729949037, "phrase": "key_politicians"}, {"score": 0.002498961351132696, "phrase": "main_official_polls"}, {"score": 0.0024118292918742967, "phrase": "voting_intention"}, {"score": 0.002273292707863821, "phrase": "primary_role"}, {"score": 0.002142696637011647, "phrase": "political_events"}, {"score": 0.0021049977753042253, "phrase": "traditional_media"}], "paper_keywords": ["Political analysis", " sentiment analysis", " Twitter"], "paper_abstract": "Twitter is an important platform for sharing opinions about politicians, parties and political decisions. These opinions can be exploited as a source of information to monitor the impact of politics on society. This article analyses the sentiment of 2,704,523 tweets referring to Spanish politicians and parties from a month in 2014-2015. The article makes three specific contributions: (a) enriching SentiStrength, a fast unsupervised sentiment strength detection system, for Spanish political tweeting; (b) analysing how linguistic phenomena such as negation, idioms and character duplication influence Spanish sentiment strength detection accuracy; and (c) analysing Spanish political tweets to rank political leaders, parties and personalities for popularity. Sentiment in Twitter for key politicians broadly reflects the main official polls for popularity but not for voting intention. In addition, the data suggests that the primary role of Twitter in politics is to select and amplify political events published by traditional media.", "paper_title": "The megaphone of the people? Spanish SentiStrength for real-time analysis of political tweets", "paper_id": "WOS:000365429600005"}