{"auto_keywords": [{"score": 0.04849740587280194, "phrase": "grids"}, {"score": 0.00481495049065317, "phrase": "cooperative_secondary_authorization_recycling"}, {"score": 0.004718897469501381, "phrase": "enterprise_systems"}, {"score": 0.0038833278847237858, "phrase": "poor_scalability"}, {"score": 0.003679969180334367, "phrase": "application_server"}, {"score": 0.0033946556965877873, "phrase": "authorization_server_failures"}, {"score": 0.0033492947290751996, "phrase": "network_delays"}, {"score": 0.0030278017562213265, "phrase": "prototype_implementation"}, {"score": 0.0027741761880779535, "phrase": "authorization_infrastructures"}, {"score": 0.002206606452557159, "phrase": "deployment_scenario"}, {"score": 0.0021624739899833868, "phrase": "average_time"}, {"score": 0.0021049977753042253, "phrase": "application_request"}], "paper_keywords": ["Access control", " authorization recycling", " cooperative secondary authorization recycling", " cooperation"], "paper_abstract": "As enterprise systems, Grids, and other distributed applications scale up and become increasingly complex, their authorization infrastructures-based predominantly on the request-response paradigm-are facing the challenges of fragility and poor scalability. We propose an approach where each application server recycles previously received authorizations and shares them with other application servers to mask authorization server failures and network delays. This paper presents the design of our cooperative secondary authorization recycling system and its evaluation using simulation and prototype implementation. The results demonstrate that our approach improves the availability and performance of authorization infrastructures. Specifically, by sharing authorizations, the cache hit rate-an indirect metric of availability-can reach 70 percent, even when only 10 percent of authorizations are cached. Depending on the deployment scenario, the average time for authorizing an application request can be reduced by up to a factor of two compared with systems that do not employ cooperation.", "paper_title": "Cooperative Secondary Authorization Recycling", "paper_id": "WOS:000261892000012"}