{"auto_keywords": [{"score": 0.039668861806856366, "phrase": "visual_cues"}, {"score": 0.02322730111336099, "phrase": "semantic_judgments"}, {"score": 0.004434824354230475, "phrase": "\"externalized_knowledge"}, {"score": 0.004331811712726697, "phrase": "office_work"}, {"score": 0.004149103940568346, "phrase": "knowledge_information_workers"}, {"score": 0.003974071684351861, "phrase": "paper_documents"}, {"score": 0.003717925116469845, "phrase": "field_data"}, {"score": 0.0031907572162427978, "phrase": "physical_documents"}, {"score": 0.003056029284235528, "phrase": "different_aspects"}, {"score": 0.0030321497870310077, "phrase": "task_context"}, {"score": 0.002612194827110595, "phrase": "one's_work"}, {"score": 0.00238674051726235, "phrase": "someone's_activities"}, {"score": 0.0021049977753042253, "phrase": "future_research_directions"}], "paper_keywords": [""], "paper_abstract": "In this article, we present the results of a study that systematically explored \"externalized knowledge\" in the context of office work. The aim of the study was to investigate what knowledge information workers externalize into their physical environment (e.g., when shuffling or relocating paper documents on their desks) and how this knowledge is \"encoded\" in visual cues. Based on field data, categories of visual cues and semantic judgments were derived, a way to aggregate these categories into clusters was proposed, and a model of the relationships among cues and judgments was developed. We conclude that visual cues of physical documents represent, besides their content, information about the features of content and about different aspects of task context and overview. Three clusters outline the space of visual cues: (a) content that resides in (b) a holder that is (c) located somewhere in space. The three identified clusters of semantic judgments express three aggregation levels of one's work: (a) individual document, (b) the context of this document, and (c) an overview over someone's activities. The nature of the relationships among these clusters is reviewed through three aspects: content-dependence, flexibility, and effort. We conclude with implications of the results and future research directions.", "paper_title": "Connecting Visual Cues to Semantic Judgments in the Context of the Office Environment", "paper_id": "WOS:000265420700005"}