{"auto_keywords": [{"score": 0.03443231786711392, "phrase": "combinatorial_representation"}, {"score": 0.00481495049065317, "phrase": "double_base_number_system"}, {"score": 0.004352876088312741, "phrase": "traditional_number_systems"}, {"score": 0.004089239912167375, "phrase": "decimal_systems"}, {"score": 0.0035741900278634616, "phrase": "current_article"}, {"score": 0.003169222811082848, "phrase": "interesting_results"}, {"score": 0.003123808471618783, "phrase": "double_and_multibase_representation"}, {"score": 0.0029914213495838998, "phrase": "simple_combinatorial_arguments"}, {"score": 0.002864628676257225, "phrase": "graph_theoretic_proof"}, {"score": 0.0028235667474151714, "phrase": "recurrence_relation"}, {"score": 0.0027431953780099826, "phrase": "double_base_representations"}, {"score": 0.0024914105981393127, "phrase": "interesting_properties"}, {"score": 0.0023743009016047424, "phrase": "base_representation"}, {"score": 0.002340250894008014, "phrase": "positive_integer_n."}, {"score": 0.0021876814398268775, "phrase": "better_understanding"}, {"score": 0.0021049977753042253, "phrase": "base_number_systems"}], "paper_keywords": ["double base number system", " DBNS-graphs", " MB-graphs"], "paper_abstract": "In Signal Processing and Cryptography a non-standard number representation, called Double Base Number System (DENS) has found many applications. This representation has many interesting and useful properties. In traditional number systems, there is one radix used to represent numbers. For example in decimal systems, numbers are expressed as sum of powers of 10. In DENS numbers are represented as sum of product of powers of 2 radices. In the current article we present a scheme to represent numbers in double (and multi-) base format by combinatorial objects like graphs and diagraphs. The combinatorial representation leads to proof of some interesting results about the double and multibase representation of integers. These proofs are based on simple combinatorial arguments. In this article we have provided a graph theoretic proof of the recurrence relation satisfied by the number of double base representations of a given integer. The result has been further generalized to more than 2 bases. Also, we have uncovered some interesting properties of the sequence representing the number of double (multi-) base representation of a positive integer n. It is expected that the combinatorial representation can serve as a tool for a better understanding of the double (and multi-) base number systems and uncover some of the mysteries still associated with it.", "paper_title": "A combinatorial interpretation of double base number system and some consequences", "paper_id": "WOS:000256120100004"}