{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "weak_supervision"}, {"score": 0.004766090327062509, "phrase": "textual_stories"}, {"score": 0.004483120978156604, "phrase": "automated_video_annotation"}, {"score": 0.004238452771031322, "phrase": "soap_series"}, {"score": 0.00411064950774695, "phrase": "narrative_texts"}, {"score": 0.0036181717017041387, "phrase": "labeled_exemplars"}, {"score": 0.003438058620195309, "phrase": "multiple_co-occurrences"}, {"score": 0.0029798924689472014, "phrase": "expectation_maximization_algorithm"}, {"score": 0.002889928791032578, "phrase": "unsupervised_methods"}, {"score": 0.002860546817196148, "phrase": "competitive_results"}, {"score": 0.0028170314398963704, "phrase": "prior_human_effort"}, {"score": 0.0026494723416072316, "phrase": "face-name_pairs"}, {"score": 0.0026091594819333654, "phrase": "human_supervision"}, {"score": 0.002261204313587616, "phrase": "proposed_approaches"}], "paper_keywords": ["Cross-media mining", " Video annotation", " Expectation Maximization", " Unsupervised alignment"], "paper_abstract": "In this paper, we focus on the problem of automated video annotation. We report on the application of naming faces in soap series by using the weak supervision of narrative texts that describe the events in the video and that are drafted by fans. Several unsupervised methods that operate without any manual labeling of exemplar faces, and methods that use a limited number of labeled exemplars are presented and evaluated. All methods exploit the multiple co-occurrences between faces shown in the video and names mentioned in the texts to compute the strength of the linking and reinforce this coupling by means of an Expectation Maximization algorithm. We show that the unsupervised methods attain competitive results without any prior human effort. The results show F1 values between 80% and 86% for the recognition of the face-name pairs without any human supervision. These figures rise only slightly when a number of faces were manually labeled beforehand. The study gives insights in the benefits and bottlenecks of the proposed approaches, and an error analysis results in guidelines for the choice of a certain technique. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Naming persons in video: Using the weak supervision of textual stories", "paper_id": "WOS:000324848700019"}