{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "many-objective_optimization"}, {"score": 0.004772818068176176, "phrase": "many-objective_optimization_problems"}, {"score": 0.004567596860086148, "phrase": "multiobjective_problems"}, {"score": 0.00431388720289049, "phrase": "multiobjective_evolutionary_algorithms"}, {"score": 0.0035082436540296406, "phrase": "existing_moeas"}, {"score": 0.00346223706087128, "phrase": "two-archive_algorithm"}, {"score": 0.003372019835750424, "phrase": "low-complexity_algorithm"}, {"score": 0.00307431840409833, "phrase": "significantly_improved_two-archive_algorithm"}, {"score": 0.0028526276660691525, "phrase": "different_selection_principles"}, {"score": 0.0027783560642198014, "phrase": "pareto"}, {"score": 0.002339771435910601, "phrase": "wide_range"}, {"score": 0.0023192471808039746, "phrase": "benchmark_problems"}, {"score": 0.002298902547676131, "phrase": "different_numbers"}, {"score": 0.002248816575548875, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "satisfactory_convergence"}], "paper_keywords": ["Evolutionary algorithm", " L-p-norm", " many-objective optimization", " two-archive algorithm (Two_Arch)"], "paper_abstract": "Many-objective optimization problems (ManyOPs) refer, usually, to those multiobjective problems (MOPs) with more than three objectives. Their large numbers of objectives pose challenges to multiobjective evolutionary algorithms (MOEAs) in terms of convergence, diversity, and complexity. Most existing MOEAs can only perform well in one of those three aspects. In view of this, we aim to design a more balanced MOEA on ManyOPs in all three aspects at the same time. Among the existing MOEAs, the two-archive algorithm (Two_Arch) is a low-complexity algorithm with two archives focusing on convergence and diversity separately. Inspired by the idea of Two_Arch, we propose a significantly improved two-archive algorithm (i.e., Two_Arch2) for ManyOPs in this paper. In our Two_Arch2, we assign different selection principles (indicator-based and Pareto-based) to the two archives. In addition, we design a new Lp-norm-based (p < 1) diversity maintenance scheme for ManyOPs in Two_Arch2. In order to evaluate the performance of Two_Arch2 on ManyOPs, we have compared it with several MOEAs on a wide range of benchmark problems with different numbers of objectives. The experimental results show that Two_Arch2 can cope with ManyOPs (up to 20 objectives) with satisfactory convergence, diversity, and complexity.", "paper_title": "Two_Arch2: An Improved Two-Archive Algorithm for Many-Objective Optimization", "paper_id": "WOS:000358883500005"}