{"auto_keywords": [{"score": 0.049438579755394736, "phrase": "family_resemblance_concept"}, {"score": 0.00481495049065317, "phrase": "engineering_function"}, {"score": 0.0038636556112977226, "phrase": "wittgensteinian_sense"}, {"score": 0.0035156341294017685, "phrase": "biological_functions"}, {"score": 0.00333097896868937, "phrase": "different_meanings"}, {"score": 0.002453116398642071, "phrase": "current_proposals"}, {"score": 0.0023451553255837317, "phrase": "meta-ontological_goals"}, {"score": 0.0021049977753042253, "phrase": "descriptive_strategy"}], "paper_keywords": ["Functions in engineering", " family resemblance concepts", " formalization strategies", " minimality for ontologies", " adequacy for ontologies"], "paper_abstract": "In this paper we argue that the challenge of the formalization of functions not merely consists of analyzing and formalizing yet another concept; the challenge may also consist of formalizing a concept that is to be taken as a family resemblance concept in the Wittgensteinian sense. We focus on engineering for giving this argument and indicate briefly how the argument can also be given for biological functions. We demonstrate that in engineering there are a number of different meanings attached to the term \"function\", and observe that engineers moreover seem to hold that having all these meanings is useful in their field. This observation make plausible that function indeed is to be taken as a family resemblance concept. Then we describe three strategies for the formalization of functions - the revisionary, the overarching and the descriptive strategies - and relate them to a number of the current proposals for this formalization. Assessing the strategies with the meta-ontological goals for formalizations of adequacy and minimality, we argue that if function indeed is to be taken as a family resemblance concept, then the descriptive strategy is to be preferred.", "paper_title": "If engineering function is a family resemblance concept: Assessing three formalization strategies", "paper_id": "WOS:000290997300004"}