{"auto_keywords": [{"score": 0.047383019958100334, "phrase": "global_solution"}, {"score": 0.03929444231178765, "phrase": "proposed_sms"}, {"score": 0.015719716506582538, "phrase": "multistage_plastic_deformation_processes"}, {"score": 0.01531585695973888, "phrase": "sustainable_manufacturing_system"}, {"score": 0.004472935829694716, "phrase": "industrial_processes"}, {"score": 0.004426092397211699, "phrase": "plastic_deformation"}, {"score": 0.0034738037330064885, "phrase": "proposed_solution_framework"}, {"score": 0.002740253546178098, "phrase": "sos_approach"}, {"score": 0.0024659480471085405, "phrase": "total_energy"}, {"score": 0.002207363758847308, "phrase": "simulation_results"}, {"score": 0.0021273284545701896, "phrase": "experimental_results"}], "paper_keywords": ["Deformation process", " intelligent system", " sustainable manufacturing system (SMS)", " system of systems (SoS)"], "paper_abstract": "This paper presents a global solution for solving industrial processes of plastic deformation through a sustainable manufacturing system (SMS). The requirements of multistage plastic deformation processes which are characterized by their need to be solved in several stages tend to increase their process time and the associated costs. The proposed SMS is capable of obtaining a global solution for these types of processes. The proposed solution framework is a System of Systems (SoS) made up of the following four distributed, complex and component systems or subsystems: scientific, technological, economical and environmental. The three case studies considered in this paper not only demonstrate the potential of the SoS approach in representing the proposed SMS in order to find the global solution in terms of its total process time, total cost, and total energy consumed during the process but also highlight other significant improvements that could be achieved by this method. The comparison between the simulation results obtained by the proposed SMS and the experimental results showed very high validation accuracy.", "paper_title": "Improving Multistage Plastic Deformation Processes by Means of a Sustainable Manufacturing System", "paper_id": "WOS:000294170600003"}