{"auto_keywords": [{"score": 0.0500603991578004, "phrase": "clinical_traits"}, {"score": 0.04969102668589498, "phrase": "multiple_sclerosis"}, {"score": 0.04932423812826638, "phrase": "electronic_medical_records"}, {"score": 0.048598348852348996, "phrase": "clinical_course"}, {"score": 0.03525910668671781, "phrase": "ms"}, {"score": 0.03407267492437522, "phrase": "clinical_subtype"}, {"score": 0.00447282529270722, "phrase": "research_data_collection"}, {"score": 0.004319322238010043, "phrase": "natural_language_processing_techniques"}, {"score": 0.004171065188039856, "phrase": "ms_patients"}, {"score": 0.004122781047853192, "phrase": "key_clinical_traits"}, {"score": 0.0036553070575015344, "phrase": "vanderbilt_university"}, {"score": 0.0035989687070420977, "phrase": "training_dataset"}, {"score": 0.003408512155673965, "phrase": "detailed_information"}, {"score": 0.00326594229173048, "phrase": "medical_records"}, {"score": 0.003178326919668771, "phrase": "oligoclonal_bands"}, {"score": 0.0030572112793962004, "phrase": "first_symptom"}, {"score": 0.002536926192232391, "phrase": "recall_values"}, {"score": 0.0024977819584875573, "phrase": "edss_scores"}, {"score": 0.0023654615987859402, "phrase": "clinical_data"}, {"score": 0.002319918823705175, "phrase": "largest_databases"}, {"score": 0.0022141537427057363, "phrase": "detailed_clinical_information"}, {"score": 0.0021214346747442363, "phrase": "research_purposes"}, {"score": 0.0021049977753042253, "phrase": "high_reliability"}], "paper_keywords": [""], "paper_abstract": "Objectives The clinical course of multiple sclerosis (MS) is highly variable, and research data collection is costly and time consuming. We evaluated natural language processing techniques applied to electronic medical records (EMR) to identify MS patients and the key clinical traits of their disease course. Materials and methods We used four algorithms based on ICD-9 codes, text keywords, and medications to identify individuals with MS from a de-identified, research version of the EMR at Vanderbilt University. Using a training dataset of the records of 899 individuals, algorithms were constructed to identify and extract detailed information regarding the clinical course of MS from the text of the medical records, including clinical subtype, presence of oligoclonal bands, year of diagnosis, year and origin of first symptom, Expanded Disability Status Scale (EDSS) scores, timed 25-foot walk scores, and MS medications. Algorithms were evaluated on a test set validated by two independent reviewers. Results We identified 5789 individuals with MS. For all clinical traits extracted, precision was at least 87% and specificity was greater than 80%. Recall values for clinical subtype, EDSS scores, and timed 25-foot walk scores were greater than 80%. Discussion and conclusion This collection of clinical data represents one of the largest databases of detailed, clinical traits available for research on MS. This work demonstrates that detailed clinical information is recorded in the EMR and can be extracted for research purposes with high reliability.", "paper_title": "Automated extraction of clinical traits of multiple sclerosis in electronic medical records", "paper_id": "WOS:000336517800021"}