{"auto_keywords": [{"score": 0.04475284813658567, "phrase": "afterschool_programs"}, {"score": 0.00481495049065317, "phrase": "afterschool_learning"}, {"score": 0.0044002186469797476, "phrase": "digital_badge_system"}, {"score": 0.004348813532606792, "phrase": "high_school_credit"}, {"score": 0.0043148760739240575, "phrase": "students_participation"}, {"score": 0.00423118169200579, "phrase": "-dominant_youth"}, {"score": 0.003974071684351861, "phrase": "afterschool_mentors"}, {"score": 0.0036457672198249333, "phrase": "learners'_credibility"}, {"score": 0.0034782306784111494, "phrase": "trustworthy_record"}, {"score": 0.0031907572162427978, "phrase": "dominant_challenge"}, {"score": 0.0031534367609709264, "phrase": "digital_badges"}, {"score": 0.0029966788947444535, "phrase": "one's_credibility"}, {"score": 0.002973261772253616, "phrase": "external_audiences"}, {"score": 0.0029040994533437903, "phrase": "college_admissions_officers"}, {"score": 0.0027060907634889734, "phrase": "program_staff"}, {"score": 0.0026327757304477665, "phrase": "essential_criterion"}, {"score": 0.0022152149658434916, "phrase": "openly_networked_learning_environments"}, {"score": 0.0021551702945512494, "phrase": "diverse_social_settings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Digital badges", " Gamification", " Human-computer interface", " Informal learning", " Secondary education"], "paper_abstract": "This paper explores the opportunities and challenges associated with implementing a digital badge system that awards high school credit for students participation in afterschool programs serving non-dominant youth. Data include interviews and focus groups with 43 students, and interviews with 24 teachers and afterschool mentors and one college admissions director. Across all stakeholders, the most frequently cited opportunity related to the potential that badges hold for establishing learners' credibility outside the context in which their badges were earned by providing a trustworthy record of the skills and achievements that students gain through their participation in the afterschool programs. However, credibility also emerged as the dominant challenge associated with digital badges. Participants observed that in order for badges to succeed in proving one's credibility to external audiences, these audiences such as college admissions officers and employers must know about and recognize the validity of badges. Students, teachers, and program staff all expressed the belief that this essential criterion had not yet been achieved. We examine these findings in light of theory and research on the role of artifacts within and outside the communities of practice in which they were created and used. The findings hold implications for designers of openly networked learning environments that seek to span and connect diverse social settings. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Digital badges in afterschool learning: Documenting the perspectives and experiences of students and educators", "paper_id": "WOS:000363818800007"}