{"auto_keywords": [{"score": 0.01329286351861084, "phrase": "virtual_screening"}, {"score": 0.004741395005218184, "phrase": "screening_site"}, {"score": 0.004621279527317074, "phrase": "s-warfarin_pockets"}, {"score": 0.004550669123303854, "phrase": "effective_virtual_screening_protocol"}, {"score": 0.004435363840720883, "phrase": "extended_active_site"}, {"score": 0.004256895619944631, "phrase": "x-ray_structures"}, {"score": 0.003782655283668953, "phrase": "mutation_data"}, {"score": 0.00374399358035391, "phrase": "structural_analysis"}, {"score": 0.0036303546926971966, "phrase": "enrichment_study"}, {"score": 0.0035932440062595252, "phrase": "key_role"}, {"score": 0.0034841647157189985, "phrase": "ligand_binding"}, {"score": 0.003209152260950748, "phrase": "ranked_database"}, {"score": 0.0031277316566463978, "phrase": "random_situation"}, {"score": 0.002971016979295967, "phrase": "selectivity_studies"}, {"score": 0.0026126405272417783, "phrase": "structure-based_pharmacophore_constraints"}, {"score": 0.002393907896783117, "phrase": "application_domain"}, {"score": 0.0022275639370573264, "phrase": "active_site"}, {"score": 0.0021049977753042253, "phrase": "protein_flexibility"}], "paper_keywords": ["CYP2C9", " docking", " protein-based pharmacophore", " selectivity", " virtual screening"], "paper_abstract": "An effective virtual screening protocol was developed against an extended active site of CYP2C9, which was derived from X-ray structures complexed with flubiprofen and S-warfarin. Virtual screening has been effectively supported by our structure-based pharmacophore model. Importance of hot residues identified by mutation data and structural analysis was first estimated in an enrichment study. Key role of Arg108 and Phe114 in ligand binding was also underlined. Our screening protocol successfully identified 76% of known CYP2C9 ligands in the top 1% of the ranked database resulting 76-fold enrichment relative to random situation. Relevance of the protocol was further confirmed in selectivity studies, when 89% of CYP2C9 ligands were retrieved from a mixture of CYP2C9 and CYP2C8 ligands, while only 22% of CYP2C8 ligands were found applying the structure-based pharmacophore constraints. Moderate discrimination of CYP2C9 ligands from CYP2C18 and CYP2C19 ligands could also be achieved extending the application domain of our virtual screening protocol for the entire CYP2C family. Our findings further demonstrate the existence of an active site comprising of at least two binding pockets and strengthens the need of involvement of protein flexibility in virtual screening.", "paper_title": "Effective virtual screening protocol for CYP2C9 ligands using a screening site constructed from flurbiprofen and S-warfarin pockets", "paper_id": "WOS:000250581200006"}