{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "space-time_interaction"}, {"score": 0.041119376424415405, "phrase": "population_shift_bias"}, {"score": 0.0034083145672246067, "phrase": "study_short_periods"}, {"score": 0.003204233360929415, "phrase": "knox"}, {"score": 0.0031779596163322306, "phrase": "mantel"}, {"score": 0.00313894917464766, "phrase": "jacquez"}, {"score": 0.0030623570435946977, "phrase": "simulation_study"}, {"score": 0.0028670988845838296, "phrase": "population_movement_scenarios"}, {"score": 0.0028086649378423357, "phrase": "positive_relationship"}, {"score": 0.002728847267539957, "phrase": "population_growth"}, {"score": 0.0024017007954518065, "phrase": "serious_problem"}, {"score": 0.0023819914954155905, "phrase": "short_study_periods"}, {"score": 0.002295277579105177, "phrase": "unbiased_approach"}, {"score": 0.002239225269052105, "phrase": "space-time_interaction_test_results"}, {"score": 0.002202617924488607, "phrase": "spatially_heterogeneous_population_change"}, {"score": 0.002157697367447098, "phrase": "study_area"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Space-time interaction", " Jacquez test", " Mantel test", " Knox test", " Population shift bias"], "paper_abstract": "Common to all tests of space-time interaction is the assumption that the population underlying the events of interest exhibits a trajectory of growth that is consistent through time and across space. In practice, however, this assumption is often untenable and, when violated, can introduce population shift bias into the results of these tests. While this problem is widely recognized, more work remains to compare its effect across tests and to determine the extent to which it is a problem for study short periods. This paper quantifies and compares the population shift bias present in the results of the Knox. Mantel, and Jacquez tests of space-time interaction. A simulation study is carried out which quantifies the bias present in each test across a variety of population movement scenarios. Results show a positive relationship between population shift bias and the heterogeneity in population growth across all the tests. They also demonstrate variability in the size of the bias across the three tests for space-time interaction considered. Finally, the results illustrate that population shift bias can be a serious problem for short study periods. Collectively, these findings suggest that an unbiased approach to assessing the significance of space-time interaction test results is needed whenever spatially heterogeneous population change is identified within a study area. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Population shift bias in tests of space-time interaction", "paper_id": "WOS:000312421300003"}