{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "design_science"}, {"score": 0.004645959941491617, "phrase": "acceptable_approach"}, {"score": 0.0046046429665581555, "phrase": "information_systems_research"}, {"score": 0.003732368382223596, "phrase": "completed_research"}, {"score": 0.0034283921404628975, "phrase": "new_method"}, {"score": 0.003382704886584695, "phrase": "electronic_workflows"}, {"score": 0.0033227310662785293, "phrase": "associated_digital_signatures"}, {"score": 0.0029447150254434842, "phrase": "ds._epistemologically"}, {"score": 0.0027535633837592597, "phrase": "subtle_differences"}, {"score": 0.002181766829493483, "phrase": "pluralist_attempts"}, {"score": 0.0021239335561699106, "phrase": "european_journal"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["research methods", " Action Research", " Design Science", " pluralism"], "paper_abstract": "As Design Science (DS) establishes itself as an acceptable approach to Information Systems research, many have commented on the similarity, or otherwise, between DS and Action Research (AR). Most of the writing on this topic has been conceptual, and not grounded in practice. In this paper, we present a piece of completed research that was perceived and executed as AR, but also reflected upon as DS. The research produced a new method for diagramming electronic workflows and creating the associated digital signatures, within the domain of eGovernment. Our conclusion is that AR that produces an artefact can be quite easily, and perhaps superficially, presented as DS. Epistemologically, there is little to separate the two methodologies. However, there are some subtle differences in practice, especially with regard to the role of the artefact, the structuring of the process, the focus of evaluation of the intervention and research, and the emphasis on learning and knowledge. We provide guidance to researchers contemplating either approach, and also consider the role of pluralist attempts to combine the approaches. European Journal of Information Systems (2012) 21, 147-159. doi:10.1057/ejis.2011.50; published online 15 November 2011", "paper_title": "The action research vs design science debate: reflections from an intervention in eGovernment", "paper_id": "WOS:000301619100004"}