{"auto_keywords": [{"score": 0.04940203756018457, "phrase": "domain-specific_ontologies"}, {"score": 0.043196436521446537, "phrase": "semantic_correspondences"}, {"score": 0.04183702514410671, "phrase": "heterogeneous_ontologies"}, {"score": 0.030248823367965923, "phrase": "knowledge_bases"}, {"score": 0.00481495049065317, "phrase": "semantic_heterogeneity"}, {"score": 0.004792143536555493, "phrase": "multiple_knowledge_base"}, {"score": 0.004668613659668831, "phrase": "semantic_web"}, {"score": 0.004409986283958706, "phrase": "conceptual_and_terminological_differences"}, {"score": 0.004296264970612285, "phrase": "major_limiting_factor"}, {"score": 0.004215397034321004, "phrase": "key_solution"}, {"score": 0.0038515000499988673, "phrase": "ontology_alignment"}, {"score": 0.00370780481244907, "phrase": "single_coherent_ontology"}, {"score": 0.003569451476205552, "phrase": "heavyweight_ontologies"}, {"score": 0.0032073043728420843, "phrase": "external_semantic_resources"}, {"score": 0.0030150079328226205, "phrase": "semantic_heterogeneity_problem"}, {"score": 0.0029722900280316216, "phrase": "multiple_external_semantic_resources"}, {"score": 0.0029301755897053598, "phrase": "proposed_approach"}, {"score": 0.002868116925014397, "phrase": "multiple_external_resources"}, {"score": 0.0028140548269469934, "phrase": "aggregated_decisions"}, {"score": 0.002696101728474703, "phrase": "proposed_framework"}, {"score": 0.0026452734009203764, "phrase": "semantic_relations"}, {"score": 0.0026264601495742295, "phrase": "ontology_concepts"}, {"score": 0.0025586128304269616, "phrase": "background_knowledge"}, {"score": 0.0024984517279573906, "phrase": "exploited_knowledge_bases"}, {"score": 0.0024747842618794255, "phrase": "integrated_statistical_and_semantic_technique"}, {"score": 0.002445514186654732, "phrase": "proposed_solution"}, {"score": 0.0024108455980729284, "phrase": "missing_background_knowledge"}, {"score": 0.002359759876402679, "phrase": "newly_obtained_knowledge"}, {"score": 0.0023485549678832628, "phrase": "future_ontology_merging_tasks"}, {"score": 0.0022608057001451414, "phrase": "produced_results"}, {"score": 0.0022076314894741394, "phrase": "semantic_based_systems"}, {"score": 0.0021659920594094407, "phrase": "proposed_techniques"}, {"score": 0.0021352776064254195, "phrase": "environmental_domain"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["World Wide Web", " Semantic heterogeneity", " Ontologies", " Knowledge base assisted merging", " Missing background knowledge"], "paper_abstract": "With the development of the Semantic Web (SW), the creation of ontologies to formally conceptualize our understanding of various domains has widely increased in number. However, the conceptual and terminological differences (a.k.a semantic heterogeneity problem) between ontologies form a major limiting factor towards their use/reuse and full adoption in practical settings. A key solution to addressing this problem can be through identifying semantic correspondences between the entities (including concepts, relations, and instances) of heterogeneous ontologies, and consequently achieving interoperability between them. This process is also known as ontology alignment. The output of this process can be further exploited to merge ontologies into a single coherent ontology. Indeed, this is widely regarded as a crucial, yet difficult task, specifically when dealing with heavyweight ontologies that consist of hundreds of thousands of concepts. To address this issue, various ontology merging approaches have been proposed. These approaches can be classified into three categories: single-strategy-based approaches, multiple-strategy-based approaches, and approaches based on exploiting external semantic resources. In this paper, we first discuss the strengths and limitations of each of these approaches, and then present our framework for addressing the semantic heterogeneity problem through merging domain-specific ontologies based on multiple external semantic resources. The novelty of the proposed approach is mainly based on employing knowledge represented by multiple external resources (knowledge bases in our work) to make aggregated decisions on the semantic correspondences between the entities of heterogeneous ontologies. Other important issues that we attempt to tackle in the proposed framework are: (i) Identifying and handling inconsistency of semantic relations between the ontology concepts and, (ii) Handling the issue of missing background knowledge (such as concepts and instances) in the exploited knowledge bases by utilizing an integrated statistical and semantic technique. Additionally, the proposed solution soundly enriches the knowledge bases with missing background knowledge, and thus enables the reuse of the newly obtained knowledge in future ontology merging tasks. To validate our proposal, we tested the framework using the OAEI 2009 benchmark and compared the produced results with state-of-the-art syntactic and semantic based systems. In addition, we utilized the proposed techniques to merge three heavyweight ontologies from the environmental domain. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Addressing semantic heterogeneity through multiple knowledge base assisted merging of domain-specific ontologies", "paper_id": "WOS:000346224900017"}