{"auto_keywords": [{"score": 0.03039937299603838, "phrase": "proposed_framework"}, {"score": 0.019954324161770547, "phrase": "historical_samples"}, {"score": 0.010332646891009906, "phrase": "preventive_maintenance"}, {"score": 0.00561757301566415, "phrase": "solution_b"}, {"score": 0.00481495049065317, "phrase": "degradation_histories"}, {"score": 0.00432423070113186, "phrase": "similarity-based_residual_life_prediction"}, {"score": 0.0030895394261534776, "phrase": "sbrlp_approach"}, {"score": 0.002830757050018908, "phrase": "solution_a"}, {"score": 0.0027741761880779535, "phrase": "corresponding_classical_sbrlp_approach"}, {"score": 0.002507748938616919, "phrase": "ineffective_when_failed_historical_samples"}, {"score": 0.0023131084326717755, "phrase": "available_failed_historical_samples"}, {"score": 0.0022215160785078797, "phrase": "numerical_investigation"}, {"score": 0.0021049977753042253, "phrase": "solution_a_when_failed_historical_samples"}], "paper_keywords": ["Prognostics", " residual life prediction", " similarity"], "paper_abstract": "This paper presents a framework of similarity-based residual life prediction (SbRLP) approaches in which historical samples that fail and do not fail (due to preventive maintenance or suspension) are both utilized. Within the framework, two solutions are proposed to estimate the lifetimes of the preventively maintained or suspended historical samples, and to utilize their degradation histories in a SbRLP approach. An extensive numerical investigation verifies the superiority of the proposed framework using Solution A over the corresponding classical SbRLP approach. In addition, the investigation results reveal that the proposed framework using Solution B is ineffective when failed historical samples are limited, but its performance improves fast with the increment of available failed historical samples. The findings in the numerical investigation suggest the use of the proposed framework using Solution A when failed historical samples are limited, and the use of the proposed framework using Solution B when abundant failed historical samples are available.", "paper_title": "A Framework of Similarity-Based Residual Life Prediction Approaches Using Degradation Histories With Failure, Preventive Maintenance, and Suspension Events", "paper_id": "WOS:000316200300012"}