{"auto_keywords": [{"score": 0.048010005733846825, "phrase": "dynamic_decode-and-forward_protocol"}, {"score": 0.01892727639405779, "phrase": "relay_channels"}, {"score": 0.006922911860703755, "phrase": "decode-and-forward_protocol"}, {"score": 0.006065548941010514, "phrase": "static_compress-and-forward_protocol"}, {"score": 0.00481495049065317, "phrase": "dynamic_decode"}, {"score": 0.00469500313566324, "phrase": "mimo_half-duplex_relay_channel"}, {"score": 0.004650793657308996, "phrase": "diversity-multiplexing_tradeoff"}, {"score": 0.004534917050845832, "phrase": "half-duplex_three-terminal"}, {"score": 0.004325339932975582, "phrase": "destination_terminals"}, {"score": 0.004164644263639545, "phrase": "tradeoff_curve"}, {"score": 0.002980124909321296, "phrase": "high_multiplexing_gains"}, {"score": 0.002860212113080887, "phrase": "low_multiplexing"}, {"score": 0.0028332303659245085, "phrase": "diversity_orders"}, {"score": 0.00264296841319955, "phrase": "static_half_duplex_protocols"}, {"score": 0.002396306027986643, "phrase": "relay_node"}, {"score": 0.002299830460180699, "phrase": "full-duplex_relay_channel"}, {"score": 0.0022637650216685906, "phrase": "half-duplex_constraint"}, {"score": 0.0022142194702079866, "phrase": "dynamic_operation"}, {"score": 0.0021726139494880653, "phrase": "relay_switches"}, {"score": 0.0021317885325570604, "phrase": "transmit_mode"}, {"score": 0.0021049977753042253, "phrase": "source-relay_channel_quality"}], "paper_keywords": ["Decode-and-forward", " diversity-multiplexing tradeoff", " dynamic protocol", " half-duplex relay", " MIMO", " relay channel"], "paper_abstract": "The diversity-multiplexing tradeoff of the dynamic decode-and-forward protocol is characterized for the half-duplex three-terminal (m, k, n)-relay channel where the source, relay and the destination terminals have m, k and n antennas, respectively. The tradeoff curve is obtained as a solution to a simple, two-variable, convex optimization problem which is explicitly solved in closed-form for certain special classes of relay channels, namely, the (1, k, 1) relay channel, the (n, 1, n) relay channel and the (2, k, 2) relay channel. Moreover, the tradeoff curves for a certain class of relay channels, such as the (m, k, n > k) channels, are found to be identical to those for the decode-and-forward protocol for the full duplex channel while for other classes of channels they are marginally lower at high multiplexing gains. Our results also show that for some classes of relay channels and at low multiplexing gains the diversity orders of the dynamic decode-and-forward protocol are greater than those of the static compress-and-forward protocol which in turn is known to be tradeoff optimal over all static half duplex protocols. In general, the dynamic decode-and-forward protocol has a performance that is comparable to that of the static compress-and-forward protocol which, unlike the dynamic decode-and-forward protocol, requires global channel state information at the relay node. Its performance is also close to that of the decode-and-forward protocol over the full-duplex relay channel thereby indicating that the half-duplex constraint can be compensated for by the dynamic operation of the relay wherein the relay switches from the receive to the transmit mode based on the source-relay channel quality.", "paper_title": "The Diversity-Multiplexing Tradeoff of the Dynamic Decode-and-Forward Protocol on a MIMO Half-Duplex Relay Channel", "paper_id": "WOS:000295739000018"}