{"auto_keywords": [{"score": 0.04488170016920939, "phrase": "social_construction"}, {"score": 0.015719716506582524, "phrase": "information_systems"}, {"score": 0.015489269450147036, "phrase": "banking_sector"}, {"score": 0.004085499732108965, "phrase": "brazil"}, {"score": 0.0036070601923916196, "phrase": "country's_largest_banks"}, {"score": 0.0034146585649631692, "phrase": "socially_constructed_phenomenon"}, {"score": 0.0030906666356950887, "phrase": "structured_interviews"}, {"score": 0.0030600032877646263, "phrase": "direct_observation"}, {"score": 0.002969821115740559, "phrase": "structural_protocol"}, {"score": 0.0022016885701010088, "phrase": "individual_and_organisational_objectives"}, {"score": 0.0021049977753042253, "phrase": "main_findings"}], "paper_keywords": ["IT assimilation", " conformity", " conformism", " bank sector", " Brazil", " social construction of information technology"], "paper_abstract": "This article presents the results of a study conducted in order to understand under what circumstances the process of social construction of information systems (ISs) in the banking sector in Brazil takes place. It presents an analysis of the implementation, use and procedures for improvement of three systems, used in two of the country's largest banks. We started from the premise that technology is a socially constructed phenomenon, with a structure of use that is formed by its practical application. The data were collected through 46 semi-structured interviews, direct observation and documental analyses. A structural protocol has been used to interpret and analyse the data. This analysis revealed a process of social construction that generated four types of use of IS: total use, partial use, combination and adaptation. The characteristics and outcomes of each will be explained in this article. The assimilation of systems has been influenced by the confluence of individual and organisational objectives and the type of training applied. The main findings revealed practices that integrate the structure that underlies the process of social construction of the systems investigated.", "paper_title": "Social construction of information systems in the banking sector", "paper_id": "WOS:000326230600004"}