{"auto_keywords": [{"score": 0.03616871357676423, "phrase": "probability_p"}, {"score": 0.0047796691404327725, "phrase": "n_seats"}, {"score": 0.004365120658858325, "phrase": "empty_ones"}, {"score": 0.004145969697200968, "phrase": "new_incoming_theatregoers"}, {"score": 0.0040653963585724545, "phrase": "specific_seat"}, {"score": 0.003908898549551755, "phrase": "free_space"}, {"score": 0.0037491904072444373, "phrase": "overall_seat_occupancy"}, {"score": 0.0028408373362772566, "phrase": "expected_number"}, {"score": 0.002826915576472664, "phrase": "occupied_seats"}, {"score": 0.0027855571699975322, "phrase": "total_number"}, {"score": 0.0026325305008425446, "phrase": "interesting_variants"}, {"score": 0.002409671236035625, "phrase": "multiple_aisles"}, {"score": 0.0023110757763310733, "phrase": "geometric_distribution"}, {"score": 0.0022940991707691713, "phrase": "zipf_distribution"}, {"score": 0.0022605183161521825, "phrase": "uniform_distribution"}, {"score": 0.0021049977753042253, "phrase": "theatre_seating_arrangements"}], "paper_keywords": ["(p-)Courteous", " Theatregoers", " Theatre occupancy", " Seat", " Selfish", " Row", " Uniform distribution", " Geometric distribution", " Zipf distribution"], "paper_abstract": "Consider a theatre consisting of m rows each containing n seats. Theatregoers enter the theatre along aisles and pick a row which they enter along one of its two entrances so as to occupy a seat. Assume they select their seats uniformly and independently at random among the empty ones. A row of seats is narrow and an occupant who is already occupying a seat is blocking passage to new incoming theatregoers. As a consequence, occupying a specific seat depends on the courtesy of theatregoers and their willingness to get up so as to create free space that will allow passage to others. Thus, courtesy facilitates and may well increase the overall seat occupancy of the theatre. We say a theatregoer is courteous if (s)he will get up to let others pass. Otherwise, the theatregoer is selfish. A set of theatregoers is courteous with probability p (or p-courteous, for short) if each theatregoer in the set is courteous with probability p, randomly and independently. It is assumed that the behaviour of a theatregoer does not change during the occupancy of the row. Thus, p=1 represents the case where all theatregoers are courteous and p=0 when they are all selfish. In this paper, we are interested in the following question: what is the expected number of occupied seats as a function of the total number of seats in a theatre, n, and the probability that a theatregoer is courteous, p? We study and analyze interesting variants of this problem reflecting behaviour of the theatregoers as entirely selfish, and p-courteous for a row of seats with one or two entrances and as a consequence for a theatre with m rows of seats with multiple aisles. We also consider the case where seats in a row are chosen according to the geometric distribution and the Zipf distribution (as opposed to the uniform distribution) and provide bounds on the occupancy of a row (and thus the theatre) in each case. Finally, we propose several open problems for other seating probability distributions and theatre seating arrangements. (C) 2015 Elsevier BY. All rights reserved.", "paper_title": "Excuse me! or the courteous theatregoers' problem", "paper_id": "WOS:000356751800008"}