{"auto_keywords": [{"score": 0.00474946741204285, "phrase": "wireless_networks"}, {"score": 0.004179480763003705, "phrase": "node_and_link_failures"}, {"score": 0.00393852508392789, "phrase": "file_sharing"}, {"score": 0.0039027036493682887, "phrase": "resource_discovery"}, {"score": 0.003867206750827, "phrase": "instant_messaging"}, {"score": 0.003832031470970347, "phrase": "online_collaboration_services"}, {"score": 0.0037971749182744334, "phrase": "wireless_environments"}, {"score": 0.0036776458116294986, "phrase": "dynamic_wireless_networks"}, {"score": 0.0025047659706737215, "phrase": "transmission_delay"}, {"score": 0.0024706232839499546, "phrase": "mac_layer"}, {"score": 0.0024147474002390763, "phrase": "gnutella-like_protocol_show"}, {"score": 0.002327956449278255, "phrase": "controller-based_network"}, {"score": 0.0022962183207691188, "phrase": "hit_rate"}, {"score": 0.0022238315004700607, "phrase": "best_manual_configuration"}, {"score": 0.0021834945657804193, "phrase": "acceptable_energy_consumption"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless networks", " Peer-to-peer", " Self-configuration", " Fuzzy logic"], "paper_abstract": "In wireless networks, the peer-to-peer (P2P) paradigm has been extensively used for information sharing due to the similarities of both networks. Both P2P and wireless networks are decentralized and designed to cope with node and link failures. As a consequence of this synergy, P2P services are employed for file sharing, resource discovery, instant messaging and online collaboration services in wireless environments. Unstructured P2P protocols are the most commonly used protocol in dynamic wireless networks, due to their high degree of tolerance to failure and support of more sophisticated query mechanisms. It has been demonstrated that the performance of P2P protocols depends heavily on the deployment. Thus, the parameters of the protocol must be tuned to maximize performance. This article proposes a controller that adjusts the load of the P2P application in real-time by tuning the \"number of neighbors\" of unstructured P2P protocols. This adaptation avoids the saturation of the network, allowing more messages to be delivered and reducing the transmission delay at the MAC layer. Simulations for a Gnutella-like protocol show that, on each deployment, the controller-based network presents a hit rate and response time comparable to the best manual configuration while presenting an acceptable energy consumption and fairness. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Fuzzy-based load self-configuration in mobile P2P services", "paper_id": "WOS:000291175500016"}