{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "predicted_structures"}, {"score": 0.004776297980616768, "phrase": "kappa_opioid_g-protein"}, {"score": 0.0047379542803396915, "phrase": "receptor_bound"}, {"score": 0.004699916946246509, "phrase": "selective_agonists"}, {"score": 0.0046621835537196754, "phrase": "human_kappa"}, {"score": 0.004232232993872917, "phrase": "drug_target"}, {"score": 0.004131063310728304, "phrase": "pain_perception"}, {"score": 0.0040978781692373005, "phrase": "neuroendocrine_physiology"}, {"score": 0.004064958518350867, "phrase": "affective_behavior"}, {"score": 0.003660226272906374, "phrase": "x-ray_structure"}, {"score": 0.003501322813520807, "phrase": "activated_gpcrs"}, {"score": 0.003390092184270794, "phrase": "inactive_gpcrs"}, {"score": 0.0032559935867182035, "phrase": "human_kappa_opioid_receptor"}, {"score": 0.0027929100418926725, "phrase": "darwindock_complete_sampling_method"}, {"score": 0.0027481591313967394, "phrase": "binding_sites"}, {"score": 0.0027260525536580912, "phrase": "five_known_agonists"}, {"score": 0.0024543014947630876, "phrase": "receptor_conformations"}, {"score": 0.0024149629835339926, "phrase": "salt_bridge"}, {"score": 0.002319346861878611, "phrase": "active_conformations"}, {"score": 0.00224558083320154, "phrase": "structural_basis"}, {"score": 0.0021049977753042253, "phrase": "subtype_specific_drug_design"}], "paper_keywords": [""], "paper_abstract": "Human kappa opioid receptor (kappa-OR), a G protein-coupled receptor (GPCR), has been identified as a drug target for treatment of such human disorders as pain perception, neuroendocrine physiology, affective behavior, and cognition. In order to find more selective and active agonists, one would like to do structure based drug design. Indeed, there is an X-ray structure for an antagonist bound to kappa-OR, but structures for activated GPCRs are quite different from those for the inactive GPCRs. Here we predict the ensemble of 24 low-energy structures of human kappa opioid receptor (kappa-OR), obtained by application of the GEnSeMBLE (GPCR Ensemble of Structures in Membrane Bilayer Environment) complete sampling method, which evaluates 13 trillion combinations of tilt and rotation angles for kappa-OR to select the best 24. To validate these structures, we used the DarwinDock complete sampling method to predict the binding sites for five known agonists (ethylketocyclazocine, bremazocine, pentazocine, nalorphine, and morphine) bound to all 24 kappa-OR conformations. We find that some agonists bind selectively to receptor conformations that lack the salt bridge between transmembrane domains 3 and 6 as expected for active conformations. These 3D structures for kappa-OR provide a structural basis for understanding ligand binding and activation of kappa-OR, which should be useful for guiding subtype specific drug design.", "paper_title": "Predicted Structures for Kappa Opioid G-Protein Coupled Receptor Bound to Selective Agonists", "paper_id": "WOS:000351652900013"}