{"auto_keywords": [{"score": 0.04944133332190207, "phrase": "uml_diagrams"}, {"score": 0.007740489563401459, "phrase": "empirical_studies"}, {"score": 0.005970376542797507, "phrase": "source_code_maintenance"}, {"score": 0.0043482604833437735, "phrase": "de_facto_standard"}, {"score": 0.004290305466333274, "phrase": "object-oriented_software_systems"}, {"score": 0.003947765701573287, "phrase": "systematic_mapping_study"}, {"score": 0.003802135020791801, "phrase": "current_existing_empirical_evidence"}, {"score": 0.0034610501297253895, "phrase": "common_belief"}, {"score": 0.0034148869960458485, "phrase": "uml"}, {"score": 0.0030097975788892896, "phrase": "system's_documentation"}, {"score": 0.0029299945756268756, "phrase": "source_code_maintainability"}, {"score": 0.0026384167183586015, "phrase": "case_studies"}, {"score": 0.002603191465943781, "phrase": "industrial_contexts"}, {"score": 0.002568435291444709, "phrase": "real_systems"}, {"score": 0.0025478041555687036, "phrase": "maintenance_tasks"}, {"score": 0.0025137856138000014, "phrase": "real_conditions"}, {"score": 0.002209406458446019, "phrase": "consistent_and_simultaneous_maintenance"}, {"score": 0.0021507795710951384, "phrase": "future_empirical_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["UML", " Empirical studies", " Software maintenance", " Systematic mapping study", " Systematic literature review"], "paper_abstract": "Context: The Unified Modelling Language (UML) has, after ten years, become established as the de facto standard for the modelling of object-oriented software systems. It is therefore relevant to investigate whether its use is important as regards the costs involved in its implantation in industry being worthwhile. Method: We have carried out a systematic mapping study to collect the empirical studies published in order to discover \"What is the current existing empirical evidence with regard to the use of UML diagrams in source code maintenance and the maintenance of the UML diagrams themselves? Results: We found 38 papers, which contained 63 experiments and 3 case studies. Conclusion: Although there is common belief that the use of UML is beneficial for source code maintenance, since the quality of the modifications is greater when UML diagrams are available, only 3 papers concerning this issue have been published. Most research (60 empirical studies) concerns the maintainability and comprehensibility of the UML diagrams themselves which form part of the system's documentation, since it is assumed that they may influence source code maintainability, although this has not been empirically validated. Moreover, the generalizability of the majority of the experiments is questionable given the material, tasks and subjects used. There is thus a need for more experiments and case studies to be performed in industrial contexts, i.e., with real systems and using maintenance tasks conducted by practitioners under real conditions that truly show the utility of UML diagrams in maintaining code, and that the fact that a diagram is more comprehensible or modifiable influences the maintainability of the code itself. This utility should also be studied from the viewpoint of cost and productivity, and the consistent and simultaneous maintenance of diagrams and code must also be considered in future empirical studies. (C) 2013 Published by Elsevier B.V.", "paper_title": "Empirical studies concerning the maintenance of UML diagrams and their use in the maintenance of code: A systematic mapping study", "paper_id": "WOS:000320217900001"}