{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "range-only_measurements"}, {"score": 0.00463507149599759, "phrase": "mobile_robot"}, {"score": 0.004547656324173302, "phrase": "unknown_relative_and_absolute_positions"}, {"score": 0.004278807087784626, "phrase": "kinematic_variables"}, {"score": 0.003995226376780718, "phrase": "variable_and_unknown_drifts"}, {"score": 0.003831224748279043, "phrase": "marine_vehicles"}, {"score": 0.0037589124802364384, "phrase": "range_measurements"}, {"score": 0.0034963129868796033, "phrase": "complete_solution"}, {"score": 0.003352722512047951, "phrase": "lyapunov_theory"}, {"score": 0.0031784407245606704, "phrase": "unmodeled_terms"}, {"score": 0.00293380698353469, "phrase": "control_law"}, {"score": 0.0025769130946296927, "phrase": "system_dynamics"}, {"score": 0.002557322657104706, "phrase": "increasing_actuation"}, {"score": 0.0025282151875392817, "phrase": "approach_trajectory"}, {"score": 0.002246124435189668, "phrase": "experimental_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Autonomous underwater vehicle", " Nonlinear control", " Gradient tracking", " Robust control", " Model uncertainties"], "paper_abstract": "The problem of homing a mobile robot to a given reference location under unknown relative and absolute positions is addressed in this paper. This problem is easy to solve when all the positions and kinematic variables are known or are observable, but remains a challenge when only range is measured. Its complexity further increases when variable and unknown drifts are added to the motion, which is typical for marine vehicles. Based on the range measurements, it is possible to drive the robot arbitrarily close to the reference. This paper presents a complete solution and demonstrates the validity of the approach based on the Lyapunov theory. The use of models, which are often affected by uncertainties and/or unmodeled terms, is intended to be minimal and only some constraints are imposed on the speed of the robot. We derive a control law that makes the robot converge asymptotically to the reference and prove its stability theoretically. Nevertheless, as it is well known, practical limitations on the actuation can weaken some properties of convergence, namely when the system dynamics require increasing actuation along the approach trajectory. We will demonstrate that the robot reaches a positively invariant set around the reference whose upper bound is determined. Finally, we conclude our work by presenting simulation and experimental data and by demonstrating the validity and the robustness of the method. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Homing a robot with range-only measurements under unknown drifts", "paper_id": "WOS:000352673400002"}