{"auto_keywords": [{"score": 0.04865164533052967, "phrase": "literature_review"}, {"score": 0.015115602828422068, "phrase": "source_papers"}, {"score": 0.007107393470038988, "phrase": "source_sentences"}, {"score": 0.005051055708019866, "phrase": "literature_review_writing"}, {"score": 0.00481495049065317, "phrase": "researchers'_preferences"}, {"score": 0.004742642920057203, "phrase": "cited_papers"}, {"score": 0.004504786051750715, "phrase": "selected_information"}, {"score": 0.004370457120206237, "phrase": "larger_project"}, {"score": 0.004317848984770719, "phrase": "automatic_summarization_method"}, {"score": 0.004278807087784626, "phrase": "human_literature_review"}, {"score": 0.004227297479492541, "phrase": "research_questions"}, {"score": 0.0034823290869920804, "phrase": "literature_review_sections"}, {"score": 0.003297461568377559, "phrase": "referencing_sentences"}, {"score": 0.0030017207229983385, "phrase": "editing_changes"}, {"score": 0.002765776659294382, "phrase": "conclusion_sections"}, {"score": 0.002724157916806019, "phrase": "descriptive_literature_reviews"}, {"score": 0.0026508118618120114, "phrase": "abstract_and_introduction_sections"}, {"score": 0.0025872705784794198, "phrase": "high-level_summary"}, {"score": 0.0024572448003065423, "phrase": "editing_-_substitutions"}, {"score": 0.0022434880661725493, "phrase": "automatic_summarization_systems"}, {"score": 0.0022231606165229235, "phrase": "human_literature_review_writing"}, {"score": 0.0021049977753042253, "phrase": "literature_reviews"}], "paper_keywords": ["Literature review writing", " Multi-document summarization", " Information science", " Information extraction", " Information selection", " Information", " Information searches"], "paper_abstract": "Purpose - This paper aims to report a study of researchers' preferences in selecting information from cited papers to include in a literature review, and the kinds of transformations and editing applied to the selected information. Design/methodology/approach - This is a part of a larger project to develop an automatic summarization method that emulates human literature review writing behaviour. Research questions were: how are literature reviews written - where do authors select information from, what types of information do they select and how do they transform it? What is the relationship between styles of literature review (integrative and descriptive) and each of these variables (source sections, types of information and types of transformation)? The authors analysed the literature review sections of 20 articles from the Journal of the American Society for Information Science and Technology, 2001-2008, to answer these questions. Referencing sentences were mapped to 279 source papers to determine the source sentences. The type of information selected, the sections of source papers where the information was taken from, and the types of editing changes made to include in the literature review were analyzed. Findings - Integrative literature reviews contain more research result information and critique, and reference more information from the results and conclusion sections of the source papers. Descriptive literature reviews contain more research method information, and reference more information from the abstract and introduction sections. The most common kind of transformation is the high-level summary, though descriptive literature reviews have more cut-pasting, especially for information taken from the abstract. The types of editing - substitutions, insertions and deletions - applied to the source sentences are identified. Practical implications - The results are useful in the teaching of literature review writing, and indicate ways for automatic summarization systems to emulate human literature review writing. Originality/value - Though there have been several studies of abstracts and abstracting, there are few studies of literature reviews and literature review writing. Little is known about how writers select information from source papers, integrate it and present it in a literature review. This paper fills some of the gaps.", "paper_title": "Literature review writing: how information is selected and transformed", "paper_id": "WOS:000321800800005"}