{"auto_keywords": [{"score": 0.04548273268995462, "phrase": "gnutella"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_search"}, {"score": 0.0045717473871437425, "phrase": "wide_variety"}, {"score": 0.004543951416376968, "phrase": "distributed_systems"}, {"score": 0.00442093689661089, "phrase": "file_sharing"}, {"score": 0.004327555970055785, "phrase": "kazza"}, {"score": 0.00405903443476192, "phrase": "random_walking"}, {"score": 0.0038187460155038383, "phrase": "distributed_inverted_index"}, {"score": 0.003749462025612395, "phrase": "search_mechanism"}, {"score": 0.0035382184560822437, "phrase": "search_problem"}, {"score": 0.0035059659238897644, "phrase": "satisfactory_way"}, {"score": 0.003189372286182993, "phrase": "partial_index"}, {"score": 0.003169954314343514, "phrase": "shared_data"}, {"score": 0.0029369469007332963, "phrase": "data_properties"}, {"score": 0.0026879721810996906, "phrase": "similar_interests"}, {"score": 0.002663449329156526, "phrase": "unstructured_search_overlay"}, {"score": 0.002623072765271526, "phrase": "peer_interests"}, {"score": 0.0025597362836527705, "phrase": "search_hints"}, {"score": 0.0024903043450159594, "phrase": "peer_interest_locality"}, {"score": 0.0024227511485666697, "phrase": "second-chance_search"}, {"score": 0.0023570261027098293, "phrase": "unpopular_data_items"}, {"score": 0.002265217884758413, "phrase": "lightweight_partial_indexing_service"}, {"score": 0.002230864807344675, "phrase": "success_rate"}, {"score": 0.0021049977753042253, "phrase": "low_search_latency"}], "paper_keywords": ["distributed systems", " information search and retrieval"], "paper_abstract": "In the past few years, peer-to-peer (P2P) networks have become a promising paradigm for building a wide variety of distributed systems and applications. The most popular P2P application till today is file sharing, e. g., Gnutella, Kazza, etc. These systems are usually referred to as unstructured, and search in unstructured P2P networks usually involves flooding or random walking. On the other hand, in structured P2P networks (DHTs), search is usually performed by looking up a distributed inverted index. The efficiency of the search mechanism is the key to the scalability of a P2P content sharing system. So far, neither unstructured nor structured P2P networks alone can solve the search problem in a satisfactory way. In this paper, we propose to combine the strengths of both unstructured and structured P2P networks to achieve more efficient search. Specifically, we propose to enhance search in unstructured P2P overlay networks by building a partial index of shared data using a structured P2P network. The index maintains two types of information: the top interests of peers and globally unpopular data, both characterized by data properties. The proposed search protocol, assisted search with partial indexing, makes use of the index to improve search in three ways: First, the index assists peers to find other peers with similar interests and the unstructured search overlay is formed to reflect peer interests. Second, the index also provides search hints for those data difficult to locate by exploring peer interest locality, and these hints can be used for second-chance search. Third, the index helps to locate unpopular data items. Experiments based on a P2P file sharing trace show that the assisted search with a lightweight partial indexing service can significantly improve the success rate in locating data than Gnutella and a hit-rate-based protocol in unstructured P2P systems, while incurring low search latency and overheads.", "paper_title": "Assisted peer-to-peer search with partial indexing", "paper_id": "WOS:000247541500011"}