{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "alternative_hypothesis"}, {"score": 0.015236319355575356, "phrase": "speaker_verification"}, {"score": 0.009825831642449597, "phrase": "proposed_framework"}, {"score": 0.004764542405129454, "phrase": "minimum_verification_error_training"}, {"score": 0.004472935829694716, "phrase": "statistical_hypothesis_testing_problem"}, {"score": 0.004047141845635495, "phrase": "target_speaker's_voice"}, {"score": 0.00388016972840459, "phrase": "non-target_speakers'_voices"}, {"score": 0.003623352647973122, "phrase": "unknown_impostors"}, {"score": 0.0030772505522663612, "phrase": "target_speaker"}, {"score": 0.00291923164591297, "phrase": "weighted_arithmetic_combination"}, {"score": 0.002888613884697113, "phrase": "wac"}, {"score": 0.002828331235643921, "phrase": "weighted_geometric_combination"}, {"score": 0.0027547408718334603, "phrase": "useful_information"}, {"score": 0.0026689487424251907, "phrase": "pre-trained_background_models"}, {"score": 0.0021498955164659145, "phrase": "false_rejection_probability"}], "paper_keywords": ["Genetic algorithm", " Hypothesis testing", " Log-likelihood ratio", " Minimum verification error training", " Speaker verification"], "paper_abstract": "Speaker verification is usually formulated as a statistical hypothesis testing problem and solved by a log-likelihood ratio (LLR) test. A speaker verification system's performance is highly dependent on modeling the target speaker's voice (the null hypothesis) and characterizing non-target speakers' voices (the alternative hypothesis). However, since the alternative hypothesis involves unknown impostors, it is usually difficult to characterize a priori. in this paper, we propose a framework to better characterize the alternative hypothesis with the goal of optimally distinguishing the target speaker from impostors. The proposed framework is built on a weighted arithmetic combination (WAC) or a weighted geometric combination (WGC) of useful information extracted from a set of pre-trained background models. The parameters associated with WAC or WGC are then optimized using two discriminative training methods, namely, the minimum verification error (MVE) training method and the proposed evolutionary, MVE (EMVE) training method, such that both the false acceptance probability and the false rejection probability are minimized. Our experiment results show that the proposed framework Outperforms conventional LLR-based approaches. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Improving the characterization of the alternative hypothesis via minimum verification error training with applications to speaker verification", "paper_id": "WOS:000265365500014"}