{"auto_keywords": [{"score": 0.0486868426803837, "phrase": "real_signer"}, {"score": 0.007740489563401459, "phrase": "group_signature"}, {"score": 0.005175128264598608, "phrase": "new_variant"}, {"score": 0.005124497689488527, "phrase": "ring_signature"}, {"score": 0.005049474369103038, "phrase": "revocable_ring_signature"}, {"score": 0.00447251540886613, "phrase": "trusted_party"}, {"score": 0.004216112320418982, "phrase": "absolute_power"}, {"score": 0.00376488621224566, "phrase": "signer_anonymity"}, {"score": 0.002706659627293686, "phrase": "desirable_properties"}, {"score": 0.0022890371899188466, "phrase": "ring_formation"}, {"score": 0.002233301265743633, "phrase": "formal_security_model"}, {"score": 0.0021682027434117095, "phrase": "efficient_construction"}], "paper_keywords": ["anonymity", " group signature", " revocability", " ring signature"], "paper_abstract": "Group signature allows the anonymity of a real signer in a group to be revoked by a trusted party called group manager. It also gives the group manager the absolute power of controlling the formation of the group. Ring signature, on the other hand, does not allow anyone to revoke the signer anonymity, while allowing the real signer to form a group (also known as a ring) arbitrarily without being controlled by any other party. In this paper, we propose a new variant for ring signature, called Revocable Ring Signature. The signature allows a real signer to form a ring arbitrarily while allowing a set of authorities to revoke the anonymity of the real signer. This new variant inherits the desirable properties from both group signature and ring signature in such a way that the real signer will be responsible for what it has signed as the anonymity is revocable by authorities while the real signer still has the freedom on ring formation. We provide a formal security model for revocable ring signature and propose an efficient construction which is proven secure under our security model.", "paper_title": "Revocable ring signature", "paper_id": "WOS:000251010700001"}