{"auto_keywords": [{"score": 0.044919229938350444, "phrase": "london"}, {"score": 0.00481495049065317, "phrase": "collaborative_multimodal_mixed_reality_environments"}, {"score": 0.004253655843277786, "phrase": "barcelona"}, {"score": 0.003997891221012094, "phrase": "triadic_audiovisual_telecommunication"}, {"score": 0.0038959121068990517, "phrase": "spatial_and_multimodal_collaborative_mixed_reality_environment"}, {"score": 0.003816197777388722, "phrase": "\"destination-visitor\"_paradigm"}, {"score": 0.003168079471049896, "phrase": "director's_experience"}, {"score": 0.0028864239961184364, "phrase": "heterogeneous_form"}, {"score": 0.0027837615811247963, "phrase": "common_spatial_frame"}, {"score": 0.0025892330566358503, "phrase": "theatrical_acting"}, {"score": 0.0024971144603069006, "phrase": "gross_gesture"}, {"score": 0.0024586427394152196, "phrase": "unambiguous_instruction"}, {"score": 0.0023834640793589435, "phrase": "relative_inexpressivity"}, {"score": 0.0023467391904246834, "phrase": "actors'_embodiments"}, {"score": 0.002286781334850213, "phrase": "central_limitation"}, {"score": 0.002126907587540404, "phrase": "consequential_facial_expression"}, {"score": 0.0021049977753042253, "phrase": "subtle_gesture"}], "paper_keywords": [""], "paper_abstract": "This paper presents the use of our multimodal mixed reality telecommunication system to support remote acting rehearsal. The rehearsals involved two actors, located in London and Barcelona, and a director in another location in London. This triadic audiovisual telecommunication was performed in a spatial and multimodal collaborative mixed reality environment based on the \"destination-visitor\" paradigm, which we define and put into use. We detail our heterogeneous system architecture, which spans the three distributed and technologically asymmetric sites, and features a range of capture, display, and transmission technologies. The actors' and director's experience of rehearsing a scene via the system are then discussed, exploring successes and failures of this heterogeneous form of telecollaboration. Overall, the common spatial frame of reference presented by the system to all parties was highly conducive to theatrical acting and directing, allowing blocking, gross gesture, and unambiguous instruction to be issued. The relative inexpressivity of the actors' embodiments was identified as the central limitation of the telecommunication, meaning that moments relying on performing and reacting to consequential facial expression and subtle gesture were less successful.", "paper_title": "Acting Rehearsal in Collaborative Multimodal Mixed Reality Environments", "paper_id": "WOS:000311184100004"}