{"auto_keywords": [{"score": 0.03884530215596663, "phrase": "rfid"}, {"score": 0.009654553681347471, "phrase": "recent_trends"}, {"score": 0.009153950846937785, "phrase": "shorter_time"}, {"score": 0.008302064866165155, "phrase": "five_paperless_picking_systems"}, {"score": 0.00481495049065317, "phrase": "different_paperless_picking_systems"}, {"score": 0.0047864177420244795, "phrase": "purpose_-_warehouse"}, {"score": 0.0045236118305957175, "phrase": "manual_warehouses"}, {"score": 0.003450966222451681, "phrase": "-_warehouse_picking"}, {"score": 0.0029826318985134944, "phrase": "better_performing_systems"}, {"score": 0.002852356597632014, "phrase": "present_paper"}, {"score": 0.0027277558893834273, "phrase": "voice_picking"}, {"score": 0.0025776913268808124, "phrase": "proposed_approach"}, {"score": 0.002509510672395393, "phrase": "different_technologies"}, {"score": 0.0024946054043656113, "phrase": "different_application_fields"}, {"score": 0.002428617044669043, "phrase": "low-level_warehouse"}, {"score": 0.002399850604120431, "phrase": "greater_benefits"}, {"score": 0.0023503248644593908, "phrase": "multilevel_shelving"}, {"score": 0.0022012144080075114, "phrase": "traditional_solutions"}, {"score": 0.002181626277903721, "phrase": "innovative_ones"}, {"score": 0.0021622120805979937, "phrase": "economic_evaluation"}, {"score": 0.002142970278347126, "phrase": "presented_hourly_cost_function"}, {"score": 0.0021049977753042253, "phrase": "different_errors"}], "paper_keywords": ["Hourly cost function", " Paperless picking", " Warehouse manual picking"], "paper_abstract": "Purpose - Warehouse picking is often referred to as the most labour-intensive, expensive and time consuming operation in manual warehouses. These factors are becoming even more crucial due to recent trends in manufacturing and warehousing requiring the processing of orders that are always smaller and needed in a shorter time. For this reason, in recent years more efficient and better performing systems have been developed, employing various technological solutions that can support pickers during their work. The purpose of this paper is to introduce a comparison of five paperless picking systems (i.e. barcodes handheld, RFID tags handheld, voice picking, traditional pick-to-light, RFID pick-to-light). Design/methodology/approach - Warehouse picking is often referred to as themost labour-intensive, expensive and time consuming operation in manual warehouses. These factors are becoming even more crucial due to recent trends in manufacturing and warehousing requiring the processing of orders that are always smaller and needed in a shorter time. For this reason, in recent years more efficient and better performing systems have been developed, employing various technological solutions that can support pickers during their work. The present paper introduces a comparison of five paperless picking systems (i.e. barcodes handheld, RFID tags handheld, voice picking, traditional pick-to-light, RFID pick-to-light. Findings - The proposed approach contributes to the understanding of the performance of different technologies in different application fields; some solutions are more suitable for a low-level warehouse, others bring greater benefits in the case of picking from multilevel shelving. Originality/value - The study concerns an issue that until now has received very little attention in the literature. It compares some traditional solutions with some innovative ones by an economic evaluation. The presented hourly cost function also takes into account the different errors arising and their probability of occurrence.", "paper_title": "A comparative analysis of different paperless picking systems", "paper_id": "WOS:000354647900005"}