{"auto_keywords": [{"score": 0.01872320858697405, "phrase": "full_model"}, {"score": 0.00671249082632118, "phrase": "predicted_values"}, {"score": 0.006569635292192492, "phrase": "random_effects"}, {"score": 0.00481495049065317, "phrase": "linear_mixed_models"}, {"score": 0.00471228691115201, "phrase": "linear_mixed_model"}, {"score": 0.0037710151976096985, "phrase": "fixed-effect_covariates"}, {"score": 0.0036247638406450735, "phrase": "overfitted_model"}, {"score": 0.0035858673522839407, "phrase": "additional_covariates"}, {"score": 0.0031845067058084613, "phrase": "correct_model"}, {"score": 0.0031277316566463978, "phrase": "important_fixed-effect_covariates"}, {"score": 0.0021509807762081145, "phrase": "reduced_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["linear mixed model", " goodness-of-fit", " model adequacy", " model fit", " model selection"], "paper_abstract": "In the linear mixed model (LMM), several R-2 statistics have been proposed for assessing the goodness-of-fit of fixed effects. However, the performance of these statistics has not been fully demonstrated either analytically or through simulations. We report results of simulations to asses the ability of these statistics to select the most parsimonious model. R-2 statistics from a full model were compared to other models in which fixed-effect covariates were removed. The full model was also compared to an overfitted model that included additional covariates not linked to the outcome. All models compared involved the same random effects. In this paper, we show that R-2 statistics that involve the residuals are unable to adequately discriminate between the correct model and one from which important fixed-effect covariates are omitted if the computation of the predicted values for the residuals included the random effects (referred to as conditional R-2 statistics). However, if the random effects are excluded from the computation of the predicted values that lead to the residuals, these R-2 statistics (referred to as marginal R-2 statistics) are able to select the most parsimonious model. Other R-2 statistics that have been proposed by Xu [2003. Measuring explained variation in linear mixed effects models. Statist. Med. 22(22), 3527-3541] performed poorly in that there was little variation in the value of these statistics from a full model to a reduced model. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Fixed-effect variable selection in linear mixed models using R-2 statistics", "paper_id": "WOS:000253283500010"}