{"auto_keywords": [{"score": 0.0360445530776084, "phrase": "equivalent_system"}, {"score": 0.03395053002397818, "phrase": "grobner_basis"}, {"score": 0.03168010654497529, "phrase": "constraint_problems"}, {"score": 0.02607772622602604, "phrase": "polynomial_time"}, {"score": 0.00481495049065317, "phrase": "finite-domain_constraint_problems"}, {"score": 0.004441517985511521, "phrase": "multivariate_polynomials"}, {"score": 0.0038332390893263844, "phrase": "uniform_way"}, {"score": 0.0035864603175592854, "phrase": "general_techniques"}, {"score": 0.0032766780632972363, "phrase": "general_algorithms"}, {"score": 0.0031845067058084583, "phrase": "doubly_exponential_complexity"}, {"score": 0.002965229277927781, "phrase": "finite_domains"}, {"score": 0.0026452734009203764, "phrase": "grobner_bases"}, {"score": 0.002382329940096419, "phrase": "modified_algorithms"}, {"score": 0.002304263635960015, "phrase": "local-consistency_algorithms"}, {"score": 0.0022715929119140194, "phrase": "constraint_programming"}, {"score": 0.0021049977753042253, "phrase": "adaptive_consistency_techniques"}], "paper_keywords": ["Constraint satisfaction", " Groebner basis", " Consistency"], "paper_abstract": "In this paper we investigate the use of a system of multivariate polynomials to represent the restrictions imposed by a collection of constraints. One advantage of using polynomials to represent constraints is that it allows many different forms of constraints to be treated in a uniform way. Systems of polynomials have been widely studied, and a number of general techniques have been developed, including algorithms that generate an equivalent system with certain desirable properties, called a Grobner Basis. General algorithms to compute a Grobner Basis have doubly exponential complexity, but we observe that for the systems we use to describe constraint problems over finite domains a Grobner Basis can be computed more efficiently than this. We also describe a family of algorithms, related to the calculation of Grobner Bases, that can be used on any system of polynomials to compute an equivalent system in polynomial time. We show that these modified algorithms can simulate the effect of the local-consistency algorithms used in constraint programming and hence solve certain broad classes of constraint problems in polynomial time. Finally we discuss the use of adaptive consistency techniques for systems of polynomials.", "paper_title": "Representing and solving finite-domain constraint problems using systems of polynomials", "paper_id": "WOS:000321520600005"}