{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "closing_price"}, {"score": 0.04849105041601803, "phrase": "online_auctions"}, {"score": 0.03504330295761372, "phrase": "closing_prices"}, {"score": 0.004519908617935935, "phrase": "electronic_marketplace"}, {"score": 0.004388450908826472, "phrase": "authors'_knowledge"}, {"score": 0.0038668462001710314, "phrase": "service_providers"}, {"score": 0.0035389348527719404, "phrase": "virtual_platform"}, {"score": 0.0033641551050434663, "phrase": "new_methodology"}, {"score": 0.0032524418285459324, "phrase": "first_few_bids"}, {"score": 0.0032115093493071366, "phrase": "corresponding_auctions"}, {"score": 0.0031710903727066313, "phrase": "real_time"}, {"score": 0.0029764767329116875, "phrase": "real_time_information_and_prediction_rules"}, {"score": 0.0029020077365708966, "phrase": "live_auctions"}, {"score": 0.002805597755796506, "phrase": "static_prediction_approach"}, {"score": 0.0026112013707473938, "phrase": "item_features"}, {"score": 0.0025674490885184173, "phrase": "seller's_reputation"}, {"score": 0.0024926348205500715, "phrase": "discretized_auction_data"}, {"score": 0.002419995316129757, "phrase": "two-year_period"}], "paper_keywords": ["Data mining", " Closing price prediction", " Duration prediction", " Online auctions", " English reverse auctions", " B2B auctions", " Electronic commerce"], "paper_abstract": "Nowadays, online auctions have become the most successful business model in the electronic marketplace. To the best of the authors' knowledge, no other work has been devoted to the prediction of closing price and duration of Business-to-Business (B2B) English reverse online auctions in which goods or service providers compete with each other to win contracts by lowering offering prices with each bid, which is conducted on a virtual platform hosted on the Internet. This research designs and proposes a new methodology to predict closing prices and duration within the first few bids of the corresponding auctions based on real time bidding information rather than static auction information. In this article, we employ real time information and prediction rules to forecast the behavior of live auctions. This is in contrast to the static prediction approach that takes into consideration only information available at the beginning of an auction such as products, item features, or the seller's reputation. This simulation is based on discretized auction data derived from a B2B online auction marketplace over a two-year period. Three measurements including accuracy, coverage, and benefit are used to evaluate the methodology. Results show that after observing the first 4 bids, this methodology can predict closing prices and duration with 84.6 and 71.9% accuracy, respectively.", "paper_title": "Real time prediction of closing price and duration of B2B reverse auctions", "paper_id": "WOS:000307331500009"}