{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "selective_kappa-opioid_receptor_agonists"}, {"score": 0.0043533862892678864, "phrase": "best_output_hypothesis"}, {"score": 0.00418134346679498, "phrase": "five_features"}, {"score": 0.00363080961099728, "phrase": "highest_scoring_model"}, {"score": 0.0035386657056888917, "phrase": "phase"}, {"score": 0.002907992115184249, "phrase": "test_set_prediction"}, {"score": 0.002723301730223192, "phrase": "highly_potent_kappa-agonists"}, {"score": 0.002628747284714371, "phrase": "satisfactory_enrichments"}, {"score": 0.0024493494346360415, "phrase": "experiment_data"}, {"score": 0.002214048743052355, "phrase": "valuable_tools"}, {"score": 0.0021049977753042253, "phrase": "novel_kappa-agonists"}], "paper_keywords": ["Catalyst/HypoGen", " kappa-opioid receptor agonists", " Pharmacophore models", " Phase", " QSAR"], "paper_abstract": "Two chemical function-based pharmacophore models of selective kappa-opioid receptor agonists were generated by using two different programs: Catalyst/HypoGen and Phase. The best output hypothesis (Hypo1) of HypoGen consisted of five features: one hydrogen-bond acceptor (HA), three hydrophobic points (HY), and one positive ionizable function (PI). The highest scoring model (Hypo2) produced by Phase comprised four features: one acceptor (A), one positive ionizable function (P), and two aromatic ring features (R). These two models (Hypo1 and Hypo2) were then validated by test set prediction and enrichment factors. They were shown to be able to identify highly potent kappa-agonists within a certain range, and satisfactory enrichments were achieved. The features of these two pharmacophore models were similar and consistent with experiment data. The models produced here were also generally in accord with other reported models. Therefore, our pharmacophore models were considered as valuable tools for 3D virtual screening, and could be useful for designing novel kappa-agonists.", "paper_title": "Chemical function-based pharmacophore generation of selective kappa-opioid receptor agonists by catalyst and phase", "paper_id": "WOS:000268250500002"}