{"auto_keywords": [{"score": 0.037960153617312316, "phrase": "snomed's_schemas"}, {"score": 0.03678902168567898, "phrase": "root_cause"}, {"score": 0.00481495049065317, "phrase": "snomed_ct_hierarchies"}, {"score": 0.004783852487938866, "phrase": "practical_applications"}, {"score": 0.004512814529823301, "phrase": "systematised_nomenclature"}, {"score": 0.004483659121004398, "phrase": "medicine_clinical_terms"}, {"score": 0.0037635782112965662, "phrase": "simple_local_errors"}, {"score": 0.0037392451233558234, "phrase": "systematic_inferences"}, {"score": 0.0037030390595465673, "phrase": "snomed's_classification_process"}, {"score": 0.0034368195287290465, "phrase": "intended_effects"}, {"score": 0.003348764681887211, "phrase": "major_problems"}, {"score": 0.0032418515965728775, "phrase": "myocardial_infarction"}, {"score": 0.0030678504924907166, "phrase": "fundamental_errors"}, {"score": 0.0027651847105654363, "phrase": "preliminary_'experiment"}, {"score": 0.0024761702541879213, "phrase": "systematic_quality_assurance"}, {"score": 0.0024048460326284416, "phrase": "sound_techniques"}, {"score": 0.0023815296953640383, "phrase": "software_engineering"}, {"score": 0.002268287853885277, "phrase": "snomed_codes"}, {"score": 0.0021049977753042253, "phrase": "meaningful_use"}], "paper_keywords": [""], "paper_abstract": "Objectives (a) To determine the extent and range of errors and issues in the Systematised Nomenclature of Medicine Clinical Terms (SNOMED CT) hierarchies as they affect two practical projects. (b) To determine the origin of issues raised and propose methods to address them. Methods The hierarchies for concepts in the Core Problem List Subset published by the Unified Medical Language System were examined for their appropriateness in two applications. Anomalies were traced to their source to determine whether they were simple local errors, systematic inferences propagated by SNOMED's classification process, or the result of problems with SNOMED's schemas. Conclusions were confirmed by showing that altering the root cause and reclassifying had the intended effects, and not others. Main results Major problems were encountered, involving concepts central to medicine including myocardial infarction, diabetes, and hypertension. Most of the issues raised were systematic. Some exposed fundamental errors in SNOMED's schemas, particularly with regards to anatomy. In many cases, the root cause could only be identified and corrected with the aid of a classifier. Limitations This is a preliminary 'experiment of opportunity.' The results are not exhaustive; nor is consensus on all points definitive. Conclusions The SNOMED CT hierarchies cannot be relied upon in their present state in our applications. However, systematic quality assurance and correction are possible and practical but require sound techniques analogous to software engineering and combined lexical and semantic techniques. Until this is done, anyone using SNOMED codes should exercise caution. Errors in the hierarchies, or attempts to compensate for them, are likely to compromise interoperability and meaningful use.", "paper_title": "Getting the foot out of the pelvis: modeling problems affecting use of SNOMED CT hierarchies in practical applications", "paper_id": "WOS:000292061700014"}