{"auto_keywords": [{"score": 0.042412816998429005, "phrase": "galois_group"}, {"score": 0.007882247233251054, "phrase": "scott"}, {"score": 0.007824370469897797, "phrase": "grassl"}, {"score": 0.00481495049065317, "phrase": "galois_automorphisms_of_a"}, {"score": 0.004797225036013284, "phrase": "symmetric_measurement._symmetric_informationally_complete_positive_operator_valued_measures"}, {"score": 0.00424734451992536, "phrase": "finite_dimension"}, {"score": 0.0040186038781533946, "phrase": "sics_covariant"}, {"score": 0.003945117054416623, "phrase": "weyl-heisenberg_group"}, {"score": 0.0037602557461171478, "phrase": "great_majority"}, {"score": 0.0036508108698357932, "phrase": "known_examples"}, {"score": 0.003479692058963528, "phrase": "known_exact_wh_sic"}, {"score": 0.003196292402522254, "phrase": "corresponding_galois_group"}, {"score": 0.00266693888510356, "phrase": "extended_clifford_group"}, {"score": 0.0025796799784169196, "phrase": "known_exact_fiducials"}, {"score": 0.0024677487011556427, "phrase": "nine_conjectures"}, {"score": 0.0023958326775913165, "phrase": "considerable_strengthening"}], "paper_keywords": ["Quantum Measurement", " Symmetric Informationally Complete Positive Operator Valued Measure", " Clifford Group", " Galois Theory"], "paper_abstract": "Symmetric Informationally Complete Positive Operator Valued Measures (usually referred to as SIC-POVMs or simply as SICs) have been constructed in every dimension <= 67. However, a proof that they exist in every finite dimension has yet to be constructed. In this paper we examine the Galois group of SICs covariant with respect to the Weyl-Heisenberg group (or WH SICs as we refer to them). The great majority (though not all) of the known examples are of this type. Scott and Grassl have noted that every known exact WH SIC is expressible in radicals (except for dimension 3 which is exceptional in this and several other respects), which means that the corresponding Galois group is solvable. They have also calculated the Galois group for most known exact examples. The purpose of this paper is to take the analysis of Scott and Grassl further. We first prove a number of theorems regarding the structure of the Galois group and the relation between it and the extended Clifford group. We then examine the Galois group for the known exact fiducials and on the basis of this we propose a list of nine conjectures concerning its structure. These conjectures represent a considerable strengthening of the theorems we have actually been able to prove. Finally we generalize the concept of an anti-unitary to the concept of a g-unitary, and show that every WE SIC fiducial is an eigenvector of a family of g-unitaries (apart from dimension 3).", "paper_title": "GALOIS AUTOMORPHISMS OF A SYMMETRIC MEASUREMENT", "paper_id": "WOS:000324004300008"}