{"auto_keywords": [{"score": 0.042051296116313676, "phrase": "human_user"}, {"score": 0.03363896917055258, "phrase": "attractive_agent"}, {"score": 0.00481495049065317, "phrase": "attractive_agents"}, {"score": 0.004395532072377065, "phrase": "virtual_agents"}, {"score": 0.0041112665381266315, "phrase": "artificial_entities"}, {"score": 0.0034049123167891955, "phrase": "agent_attractiveness"}, {"score": 0.00303319936111073, "phrase": "participant's_opinion"}, {"score": 0.0029602552900111407, "phrase": "unattractive_agent"}, {"score": 0.0028890603352364273, "phrase": "greater_behavioral_change"}, {"score": 0.002320449502337321, "phrase": "powerful_influence"}, {"score": 0.002278440725193305, "phrase": "agent's_physical_appearance"}, {"score": 0.0021966859554037174, "phrase": "interaction-based_context"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": [""], "paper_abstract": "Advances in more ubiquitous human-computer interface technologies have resulted in the increased use of virtual agents, thus highlighting the need to understand the impact these artificial entities have on the human user in terms of how the user both perceives and behaves toward these characters. We report the results of an experiment based on the Desert Survival task, where the effect of agent attractiveness on persuasion was tested. The results suggest that the attractive agent was significantly more persuasive in changing the participant's opinion than was the unattractive agent. Furthermore, greater behavioral change was observed when the participant interacted with the attractive agent, in terms of persuasiveness, including the attribution of more positive personality traits toward this agent (the attractiveness stereotype). These findings provide further evidence of the powerful influence of the agent's physical appearance on the human user in an interaction-based context. We conclude by pointing toward future research and potential within the area.", "paper_title": "Attractive Agents Are More Persuasive", "paper_id": "WOS:000328929800004"}