{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "qt-cbp"}, {"score": 0.009983744130543856, "phrase": "collision_bit_positioning"}, {"score": 0.004708646690764068, "phrase": "rfid"}, {"score": 0.004187614134377688, "phrase": "tag_anti-collision_algorithm"}, {"score": 0.0039380388343479384, "phrase": "air_interface"}, {"score": 0.0036826452656927877, "phrase": "great_influence"}, {"score": 0.0035216195857272403, "phrase": "multiple_tag_recognition"}, {"score": 0.003405472159599442, "phrase": "new_memoryless_tag_anti-collision_algorithm"}, {"score": 0.002784540221128404, "phrase": "detailed_information"}, {"score": 0.0027382040767844093, "phrase": "collision_condition"}, {"score": 0.0026330549554033876, "phrase": "collision_bits"}, {"score": 0.0025178072071268534, "phrase": "enhanced_algorithm"}, {"score": 0.0023281003994670714, "phrase": "simulation_study"}, {"score": 0.0021526564019119466, "phrase": "similar_tag_ids"}], "paper_keywords": [""], "paper_abstract": "The ability to recognize many tags simultaneously is crucial for many advanced RFID-based applications. The tag anti-collision algorithm of an RFID system, which arbitrates collisions on the air interface among tags in the same reading range of a reader, makes a great influence on the speed and the reliability in multiple tag recognition. This paper presents a new memoryless tag anti-collision algorithm, QT-CBP (Query Tree with Collision Bit Positioning), which is designed based on QT (Query Tree) algorithm. QT-CBP is likely to make more concise tree traversal than QT by extracting and making use of detailed information on a collision condition, such as the number of collision bits and their positions. Basically QT-CBP is an enhanced algorithm for readers running QT, so no change is required at tags. Simulation study shows that QT-CBP outperforms QT, especially on the condition where tags have similar tag IDs by having the same company or product ID prefixes.", "paper_title": "QT-CBP: A new RFID tag anti-collision algorithm using collision bit positioning", "paper_id": "WOS:000240081000060"}