{"auto_keywords": [{"score": 0.04862939342842758, "phrase": "knowledge_base"}, {"score": 0.008768875719646897, "phrase": "cais_system"}, {"score": 0.00481495049065317, "phrase": "comparative_anatomy_information_system"}, {"score": 0.004796494787797015, "phrase": "cais"}, {"score": 0.004714255662374791, "phrase": "homologous_anatomical_structures"}, {"score": 0.004416079619543104, "phrase": "relevant_informatics_contributions"}, {"score": 0.004307099985737249, "phrase": "structural_difference_method"}, {"score": 0.0042495320879288615, "phrase": "anatomical_similarities"}, {"score": 0.0040971095888461045, "phrase": "anatomical_models"}, {"score": 0.004034572092608487, "phrase": "specific_structures"}, {"score": 0.0039048188626673455, "phrase": "internal_syntax"}, {"score": 0.0038674532861321864, "phrase": "query_language"}, {"score": 0.0037792227071149985, "phrase": "working_system"}, {"score": 0.003650622777534568, "phrase": "human_anatomy"}, {"score": 0.0036296174225016963, "phrase": "result_sets"}, {"score": 0.0035741900278634616, "phrase": "symbolic_terms"}, {"score": 0.003412917664088872, "phrase": "domain_knowledge"}, {"score": 0.0033932753847910366, "phrase": "medically_relevant_structural_questions"}, {"score": 0.003296741166072345, "phrase": "initial_foray"}, {"score": 0.0032214884853316184, "phrase": "user_questionnaires"}, {"score": 0.002982797108993439, "phrase": "graph-matching_techniques"}, {"score": 0.0029656229252935417, "phrase": "graphical_user_interface"}, {"score": 0.002837188425640173, "phrase": "diverse_information_sources"}, {"score": 0.002820850247525606, "phrase": "domain_experts"}, {"score": 0.0028100102841877835, "phrase": "peer-reviewed_articles"}, {"score": 0.002793828175091038, "phrase": "reference_books"}, {"score": 0.0027195318489720978, "phrase": "comparative_anatomy_studies"}, {"score": 0.002427473263013356, "phrase": "different_types"}, {"score": 0.0024181413029825205, "phrase": "possible_queries"}, {"score": 0.0023949676781722, "phrase": "interface_issues"}, {"score": 0.002340250894008014, "phrase": "partial_and_complex_homologies"}, {"score": 0.002256155453630723, "phrase": "translational_medicine_researchers"}, {"score": 0.0022474806085983536, "phrase": "possible_applications"}, {"score": 0.0022302306304023602, "phrase": "theoretical_work"}, {"score": 0.002166711569953301, "phrase": "genotype-phenotype_relationships"}, {"score": 0.0021376902861998865, "phrase": "wide_array"}, {"score": 0.0021294699637639564, "phrase": "clinical_and_scientific_initiatives"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ontology", " Anatomy", " Comparative anatomy", " Knowledge base", " Protege", " Homology", " Graph matching", " Graph similarity", " Isomorphism", " Foundational Model of Anatomy"], "paper_abstract": "Introduction: This paper describes the design, implementation, and potential use of a comparative anatomy information system (CAIS) for querying on similarities and differences between homologous anatomical structures across species, the knowledge base it operates upon, the method it uses for determining the answers to the queries, and the user interface it employs to present the results. The relevant informatics contributions of our work include (1) the development and application of the structural difference method, a formalism for symbolically representing anatomical similarities and differences across species; (2) the design of the structure of a mapping between the anatomical models of two different species and its application to information about specific structures in humans, mice, and rats; and (3) the design of the internal syntax and semantics of the query language. These contributions provide the foundation for the development of a working system that allows users to submit queries about the similarities and differences between mouse, rat, and human anatomy; delivers result sets that describe those similarities and differences in symbolic terms; and serves as a prototype for the extension of the knowledge base to any number of species. Additionally, we expanded the domain knowledge by identifying medically relevant structural questions for the human, the mouse, and the rat, and made an initial foray into the validation of the application and its content by means of user questionnaires, software testing, and other feedback. Methods: The anatomical structures of the species to be compared, as well as the mappings between species, are modeled on templates from the Foundational Model of Anatomy knowledge base, and compared using graph-matching techniques. A graphical user interface allows users to issue queries that retrieve information concerning similarities and differences between structures in the species being examined. Queries from diverse information sources, including domain experts, peer-reviewed articles, and reference books, have been used to test the system and to illustrate its potential use in comparative anatomy studies. Results: 157 test queries were submitted to the CAIS system, and all of them were correctly answered. The interface was evaluated in terms of clarity and ease of use. This testing determined that the application works well, and is fairly intuitive to use, but users want to see more clarification of the meaning of the different types of possible queries. Some of the interface issues will naturally be resolved as we refine our conceptual model to deal with partial and complex homologies in the content. Conclusions: The CAIS system and its associated methods are expected to be useful to biologists and translational medicine researchers. Possible applications range from supporting theoretical work in clarifying and modeling ontogenetic, physiological, pathological, and evolutionary transformations, to concrete techniques for improving the analysis of genotype-phenotype relationships among various animal models in support of a wide array of clinical and scientific initiatives. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "An ontology-based comparative anatomy information system", "paper_id": "WOS:000286856300001"}