{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "iterated_prisoner's_dilemma"}, {"score": 0.0424769430590298, "phrase": "strategy_sigma"}, {"score": 0.024248904998550345, "phrase": "bounded_memory"}, {"score": 0.004293840838533456, "phrase": "highly_desirable_property"}, {"score": 0.004224144177879657, "phrase": "ipd"}, {"score": 0.0034847851398628546, "phrase": "well_known_simple_strategy"}, {"score": 0.0031845067058084583, "phrase": "already_one_mistake"}, {"score": 0.0030069962181403487, "phrase": "ultimate_resistance"}, {"score": 0.002898127432512101, "phrase": "perfect_fault-tolerance"}, {"score": 0.0027253441561528495, "phrase": "arbitrary_finite_number"}, {"score": 0.002626645763725465, "phrase": "perfectly_fault-tolerant_strategies"}, {"score": 0.0021049977753042253, "phrase": "fixed_initial_segment"}], "paper_keywords": ["Prisoner's Dilemma", " Robust strategy", " Algorithms", " Fault-tolerance", " Bounded memory"], "paper_abstract": "The aim of this paper is to determine how well can strategies in the Iterated Prisoner's Dilemma (IPD) behave in the presence of errors. A highly desirable property of strategies in IPD, even without errors, is their robustness. A strategy sigma is called robust, if in any population consisting of copies of two types of strategies, sigma itself and some other strategy tau, the strategy sigma is never worse than tau. For example, the well known simple strategy tit-for-tat is robust. However, tit-for-tat is very vulnerable to errors: already one mistake in its execution can cause it to lose the property of robustness. The ultimate resistance to errors is captured by the notion of perfect fault-tolerance: a strategy has this property, if any distortion of it on an arbitrary finite number of moves remains robust. Do there exist perfectly fault-tolerant strategies in IPD? Somewhat surprisingly, the answer is yes: indeed we describe such a strategy and we prove that it has this very strong resistance to errors. However, we prove that no strategy with bounded memory can have this property. We then go on to show that preserving robustness under distortions on any fixed initial segment of moves is possible with bounded memory. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Fault-tolerant strategies in the Iterated Prisoner's Dilemma", "paper_id": "WOS:000277661100008"}