{"auto_keywords": [{"score": 0.03136475967133101, "phrase": "semantic_annotations"}, {"score": 0.00481495049065317, "phrase": "resource-_and_system-building_efforts"}, {"score": 0.004742511243894382, "phrase": "johns_hopkins_university_human_language_technology_center_of_excellence"}, {"score": 0.004671156704912419, "phrase": "applied_language_exploration"}, {"score": 0.004583464412234181, "phrase": "semantically_informed_machine_translation"}, {"score": 0.004153207234462926, "phrase": "annotation_scheme"}, {"score": 0.00330770035909988, "phrase": "structure-based_mn_tagger_results"}, {"score": 0.0031484483754909026, "phrase": "standard_ldc_data"}, {"score": 0.0030658872249549893, "phrase": "statistical_machine_translation"}, {"score": 0.0030311679447397725, "phrase": "syntactic_framework"}, {"score": 0.002940487679224863, "phrase": "syntactic_tags"}, {"score": 0.00286336417751658, "phrase": "parse_trees"}, {"score": 0.0028309318332306703, "phrase": "target-language_training_texts"}, {"score": 0.002777689934513217, "phrase": "tree_grafting"}, {"score": 0.002643888053328987, "phrase": "tree_grafting_procedure"}, {"score": 0.002574523719093119, "phrase": "semantic_information"}, {"score": 0.002497470177389344, "phrase": "named_entities"}, {"score": 0.0024504843466435487, "phrase": "pre-existing_tagger"}, {"score": 0.0023952639120005193, "phrase": "mn_elements"}, {"score": 0.002314752262613559, "phrase": "resulting_system"}, {"score": 0.002279841453843241, "phrase": "linguistically_naive_baseline_model"}, {"score": 0.0022115879730677, "phrase": "highest_scores"}], "paper_keywords": [""], "paper_abstract": "This article describes the resource- and system-building efforts of an 8-week Johns Hopkins University Human Language Technology Center of Excellence Summer Camp for Applied Language Exploration (SCALE-2009) on Semantically Informed Machine Translation (SIMT). We describe a new modality/negation (MN) annotation scheme, the creation of a (publicly available) MN lexicon, and two automated MN taggers that we built using the annotation scheme and lexicon. Our annotation scheme isolates three components of modality and negation: a trigger (a word that conveys modality or negation), a target (an action associated with modality or negation), and a holder (an experiencer of modality). We describe how our MN lexicon was semi-automatically produced and we demonstrate that a structure-based MN tagger results in precision around 86% (depending on genre) for tagging of a standard LDC data set. We apply our MN annotation scheme to statistical machine translation using a syntactic framework that supports the inclusion of semantic annotations. Syntactic tags enriched with semantic annotations are assigned to parse trees in the target-language training texts through a process of tree grafting. Although the focus of our work is modality and negation, the tree grafting procedure is general and supports other types of semantic information. We exploit this capability by including named entities, produced by a pre-existing tagger, in addition to the MN elements produced by the taggers described here. The resulting system significantly outperformed a linguistically naive baseline model (Hiero), and reached the highest scores yet reported on the NIST 2009 Urdu-English test set. This finding supports the hypothesis that both syntactic and semantic information can improve translation quality.", "paper_title": "Use of Modality and Negation in Semantically-Informed Syntactic MT", "paper_id": "WOS:000306100900006"}