{"auto_keywords": [{"score": 0.014519752052297774, "phrase": "double-branch_hash_functions"}, {"score": 0.012384261452956884, "phrase": "ripemd"}, {"score": 0.011988879256241583, "phrase": "full_version"}, {"score": 0.008067195947779405, "phrase": "attacked_steps"}, {"score": 0.004715819915695707, "phrase": "meet-in-the-middle_preimage_attack_framework"}, {"score": 0.004591345494188032, "phrase": "narrow-pipe_hash_functions"}, {"score": 0.004237208239631876, "phrase": "refined_strategy"}, {"score": 0.004137600338433322, "phrase": "-middle_attack_framework"}, {"score": 0.004028326293950714, "phrase": "new_local-collision_approach"}, {"score": 0.004004436217742343, "phrase": "one-message-word_local_collision"}, {"score": 0.003728529119516347, "phrase": "pseudo-preimage_attack"}, {"score": 0.003481911583035097, "phrase": "second_preimage_attack"}, {"score": 0.0033299015941662302, "phrase": "previous_preimage_attacks"}, {"score": 0.0028779496327516634, "phrase": "preimage_attack"}, {"score": 0.0026874405408023956, "phrase": "brute-force_attack"}, {"score": 0.0026241684260044414, "phrase": "theoretical_security"}, {"score": 0.00247978844626184, "phrase": "maximum_number"}, {"score": 0.002414191082427217, "phrase": "previous_works"}, {"score": 0.002234252028553481, "phrase": "full-version_ripemd"}, {"score": 0.0021946656099592608, "phrase": "security_mergin"}], "paper_keywords": ["RIPEMD", " RIPEMD-128", " meet-in-the-middle", " one-message-word local collision"], "paper_abstract": "Even though meet-in-the-middle preimage attack framework has been successfully applied to attack most of narrow-pipe hash functions, it seems difficult to apply this framework to attack double-branch hash functions. Only few results have been published on this research. This paper proposes a refined strategy of applying meet-in-the-middle attack framework to double-branch hash functions. The main novelty is a new local-collision approach named one-message-word local collision. We have applied our strategy to two double-branch hash functions RIPEMD and RIPEMD-128, and obtain the following results. On RIPEMD, We find a pseudo-preimage attack on 47-step compression function, where the full version has 48 steps, with a complexity of 2(119). It can be converted to a second preimage attack on 47-step hash function with a complexity of 2(124.5). Moreover, we also improve previous preimage attacks on (intermediate) 35-step RIPEMD, and reduce the complexity from 2(113) to 2(96). On RIPEMD-128, We find a pseudo-preimage on (intermediate) 36-step compression function, where the full version has 64 steps, with a complexity of 2(123). It can1 be converted to a preimage attack on (intermediate) 36-step hash function with a complexity of 2(126.5). Both RIPEMD and RIPEMD-128 produce 128-bit digests. Therefore our attacks are faster than the brute-force attack, which means that our attacks break the theoretical security bound of the above step-reduced variants of those two hash functions in the sense of (second) preimage resistance. The maximum number of the attacked steps on both those two hash functions is 35 among previous works based to our best knowledge. Therefore we have successfully increased the number of the attacked steps. We stress that our attacks does not break the security of full-version RIPEMD and RIPEMD-128. But the security mergin of RIPEMD becomes very narrow. On the other hand, RIPEMD-128 still has enough security margin.", "paper_title": "Meet-in-the-Middle (Second) Preimage Attacks on Two Double-Branch Hash Functions RIPEMD and RIPEMD-128", "paper_id": "WOS:000299588300010"}