{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_ontologies"}, {"score": 0.010516506735069962, "phrase": "heterogeneous_linguistic_information"}, {"score": 0.007113204996260697, "phrase": "different_linguistic_term_sets"}, {"score": 0.005715685826198048, "phrase": "multi-granular_fuzzy_linguistic_methods"}, {"score": 0.004621148492564008, "phrase": "real_world_environments"}, {"score": 0.004579147045265106, "phrase": "fuzzy_sets_mathematical_environment"}, {"score": 0.004066498558415824, "phrase": "real_world"}, {"score": 0.0038849148160362257, "phrase": "imprecise_nature_words"}, {"score": 0.003711409222544974, "phrase": "high_amount"}, {"score": 0.003356396922662246, "phrase": "linguistic_information"}, {"score": 0.0032955848190195343, "phrase": "different_sources"}, {"score": 0.0026949679939994226, "phrase": "new_proposed_approaches"}, {"score": 0.0023927516438886445, "phrase": "linguistic_term_sets"}, {"score": 0.002275299774554847, "phrase": "user-computer_communication"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fuzzy linguistic modeling", " Multi-granular linguistic information", " Computing with words", " Fuzzy ontology"], "paper_abstract": "Fuzzy ontologies allow the modeling of real world environments using fuzzy sets mathematical environment and linguistic modeling. Therefore, fuzzy ontologies become really useful when the information that is worked with is imprecise. This happens a lot in real world environments because humans are more used to think using imprecise nature words instead of numbers. Furthermore, there is a high amount of concepts that, because of their own nature, cannot be measured numerically. Moreover, due to the fact that linguistic information is extracted from different sources and is represented using different linguistic term sets, to deal with it can be problematic. In this paper, three different novel approaches that can help us to build and manage fuzzy ontologies using heterogeneous linguistic information are proposed. Advantages and drawbacks of all of the new proposed approaches are exposed. Thanks to the use of multi-granular fuzzy linguistic methods, information can be expressed using different linguistic term sets. Multi-granular fuzzy linguistic methods can also allow users to choose the linguistic term sets that they prefer to formulate their queries. In such a way, user-computer communication is improved since users feel more comfortable when using the system. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Building and managing fuzzy ontologies with heterogeneous linguistic information", "paper_id": "WOS:000362611600013"}