{"auto_keywords": [{"score": 0.02820377049747823, "phrase": "gss"}, {"score": 0.004721162131188487, "phrase": "powerful_tool"}, {"score": 0.004665764181113345, "phrase": "multidimensional_data"}, {"score": 0.004503422625191897, "phrase": "multidimensional_points"}, {"score": 0.004129873531628877, "phrase": "visual_metaphor"}, {"score": 0.0040334640350288, "phrase": "important_aspect"}, {"score": 0.0038624981944755813, "phrase": "local_trend"}, {"score": 0.00314708280192844, "phrase": "perceived_trends"}, {"score": 0.0030135741897058844, "phrase": "local_sensitivity"}, {"score": 0.002931569771634119, "phrase": "visual_perception"}, {"score": 0.0026355812883224203, "phrase": "sensitivity_coefficients"}, {"score": 0.0025841336988141235, "phrase": "flow_lines"}, {"score": 0.0023976048394496446, "phrase": "data_points"}, {"score": 0.0023507916951658455, "phrase": "higher_dimensional_space"}, {"score": 0.0022157533515146503, "phrase": "multidimensional_data_sets"}, {"score": 0.002130056082139311, "phrase": "well-known_data_sets"}, {"score": 0.0021049977753042253, "phrase": "regression_and_classification_tasks"}], "paper_keywords": ["Sensitivity analysis", " data transformations", " model fitting", " multidimensional data visualization"], "paper_abstract": "Scatterplots remain a powerful tool to visualize multidimensional data. However, accurately understanding the shape of multidimensional points from 2D projections remains challenging due to overlap. Consequently, there are a lot of variations on the scatterplot as a visual metaphor for this limitation. An important aspect often overlooked in scatterplots is the issue of sensitivity or local trend, which may help in identifying the type of relationship between two variables. However, it is not well known how or what factors influence the perception of trends from 2D scatterplots. To shed light on this aspect, we conducted an experiment where we asked people to directly draw the perceived trends on a 2D scatterplot. We found that augmenting scatterplots with local sensitivity helps to fill the gaps in visual perception while retaining the simplicity and readability of a 2D scatterplot. We call this augmentation the generalized sensitivity scatterplot (GSS). In a GSS, sensitivity coefficients are visually depicted as flow lines, which give a sense of continuity and orientation of the data that provide cues about the way data points are scattered in a higher dimensional space. We introduce a series of glyphs and operations that facilitate the analysis of multidimensional data sets using GSS, and validate with a number of well-known data sets for both regression and classification tasks.", "paper_title": "The Generalized Sensitivity Scatterplot", "paper_id": "WOS:000323473800015"}