{"auto_keywords": [{"score": 0.04315995617089533, "phrase": "structural_metadata"}, {"score": 0.03446868368519102, "phrase": "scholarwiki"}, {"score": 0.00481495049065317, "phrase": "referential_representation_of_scholarly_output"}, {"score": 0.00474946741204285, "phrase": "scientific_metadata_model"}, {"score": 0.004600100053651545, "phrase": "classical_descriptive_metadata"}, {"score": 0.004435732154802217, "phrase": "dc"}, {"score": 0.004160435626849478, "phrase": "classical_model"}, {"score": 0.004066498558415824, "phrase": "structural_vocabulary"}, {"score": 0.004029517895918228, "phrase": "research_publications"}, {"score": 0.0039928721865882, "phrase": "referential_metadata"}, {"score": 0.003832031470970347, "phrase": "scholarly_output"}, {"score": 0.003418327319110734, "phrase": "underlying_assumptions"}, {"score": 0.0033410898465226417, "phrase": "major_component"}, {"score": 0.0030352396244492604, "phrase": "wiki_platform"}, {"score": 0.002993887707344862, "phrase": "user_interaction"}, {"score": 0.0025627194819793347, "phrase": "metadata_editing"}, {"score": 0.002493333098814506, "phrase": "larger_community"}, {"score": 0.0023818288346547692, "phrase": "machine-learning_techniques"}, {"score": 0.002327956449278255, "phrase": "self-enhanced_metadata"}, {"score": 0.0021049977753042253, "phrase": "metadata_wiki_pages"}], "paper_keywords": [""], "paper_abstract": "The scientific metadata model proposed in this article encompasses both classical descriptive metadata such as those defined in the Dublin Core Metadata Element Set (DC) and the innovative structural and referential metadata properties that go beyond the classical model. Structural metadata capture the structural vocabulary in research publications; referential metadata include not only citations but also data about other types of scholarly output that is based on or related to the same publication. The article describes the structural, descriptive, and referential (SDR) elements of the metadata model and explains the underlying assumptions and justifications for each major component in the model. ScholarWiki, an experimental system developed as a proof of concept, was built over the wiki platform to allow user interaction with the metadata and the editing, deleting, and adding of metadata. By allowing and encouraging scholars (both as authors and as users) to participate in the knowledge and metadata editing and enhancing process, the larger community will benefit from more accurate and effective information retrieval. The ScholarWiki system utilizes machine-learning techniques that can automatically produce self-enhanced metadata by learning from the structural metadata that scholars contribute, which will add intelligence to enhance and update automatically the publication of metadata Wiki pages.", "paper_title": "An Interactive Metadata Model for Structural, Descriptive, and Referential Representation of Scholarly Output", "paper_id": "WOS:000335583800007"}