{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "korea"}, {"score": 0.00424779023663186, "phrase": "efficient_strategies"}, {"score": 0.004036852178449883, "phrase": "delphi_survey_method"}, {"score": 0.003688892770976908, "phrase": "nursing_informatics"}, {"score": 0.0036031440110534853, "phrase": "three-round_delphi_survey"}, {"score": 0.003203294948113915, "phrase": "telenursing_specialties"}, {"score": 0.003020279889535487, "phrase": "business_model"}, {"score": 0.0029384777371425862, "phrase": "government_plans"}, {"score": 0.002892729377519916, "phrase": "e-health_industry"}, {"score": 0.0028143720888311537, "phrase": "important_requirements"}, {"score": 0.0027814417101979317, "phrase": "successful_introduction"}, {"score": 0.0025614418906438744, "phrase": "target_market"}, {"score": 0.002531463482341473, "phrase": "expense_sharing"}, {"score": 0.0023680783509308525, "phrase": "health_professionals"}, {"score": 0.0021049977753042253, "phrase": "practical_strategy"}], "paper_keywords": ["Delphi", " strategy", " SWOT", " telenursing"], "paper_abstract": "This study aimed to evaluate the feasibility of telenursing, to analyze the issues that should be considered for the development of telenursing in the future, and to provide efficient strategies for the implementation of telenursing in Korea. The authors used the Delphi survey method and a strengths, weaknesses, opportunities, and threats analysis. A total of 30 experts and specialists in the field of nursing informatics and telemedicine contributed to a three-round Delphi survey. The results of the study suggest that telenursing can potentially be implemented in Korea. However, to implement telenursing in Korea, it is necessary to identify telenursing specialties, to construct an infrastructure within which telenursing can function, to develop a business model, and to integrate strategies with government plans to develop the e-health industry. The issues that emerged as important requirements for the successful introduction of telenursing were classified as systematic, economic, societal, or technical. Issues such as driving force, target market, and expense sharing were examined in detail from both ideal and realistic points of view. The results of this study will enable health professionals to appreciate the feasibility of implementing telenursing in Korea, In addition, the study suggests that telenursing could be used efficiently in a variety of environments as a practical strategy to improve healthcare in Korea.", "paper_title": "Strategy development for the implementation of telenursing in Korea", "paper_id": "WOS:000249599600009"}