{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large_deformation_image_registration"}, {"score": 0.0047588556219929756, "phrase": "nonrigid_medical_image_registration"}, {"score": 0.00454090611248773, "phrase": "invertible_transformation"}, {"score": 0.004461761855323898, "phrase": "inherently_symmetric_problem"}, {"score": 0.004282391936827106, "phrase": "image_pair"}, {"score": 0.003591542373891629, "phrase": "inverse_consistent_registration"}, {"score": 0.003487721546598799, "phrase": "practical_estimation"}, {"score": 0.0034268702387746106, "phrase": "available_registration_algorithms"}, {"score": 0.0033277936960179892, "phrase": "inverse_inconsistent_transformations"}, {"score": 0.0029766550209309127, "phrase": "large_deformation_diffeomorphic_framework"}, {"score": 0.0028069426877159642, "phrase": "symmetric_data-attachment_terms"}, {"score": 0.002693919110230191, "phrase": "matching_error"}, {"score": 0.0021677478798910565, "phrase": "cost_functions"}, {"score": 0.002142426911242168, "phrase": "present_experimental_results"}], "paper_keywords": [""], "paper_abstract": "Nonrigid medical image registration between images that are linked by an invertible transformation is an inherently symmetric problem. The transformation that registers the image pair should ideally be the inverse of the transformation that registers the pair with the order of images interchanged. This property is referred to as symmetry in registration or inverse consistent registration. However, in practical estimation, the available registration algorithms have tended to produce inverse inconsistent transformations when the template and target images are interchanged. In this paper, we propose two novel cost functions in the large deformation diffeomorphic framework that are inverse consistent. These cost functions have symmetric data-attachment terms; in the first, the matching error is measured at all points along the flow between template and target, and in the second, matching is enforced only at the midpoint of the How between the template and target. We have implemented these cost functions and present experimental results to validate their inverse consistent property and registration accuracy.", "paper_title": "Symmetric data attachment terms for large deformation image registration", "paper_id": "WOS:000249213500005"}