{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "polarity_classification"}, {"score": 0.011700128389379397, "phrase": "voting_system"}, {"score": 0.0104588814931592, "phrase": "oca"}, {"score": 0.00947489707838409, "phrase": "proposed_method"}, {"score": 0.00468627326602559, "phrase": "machine_learning_and_semantic_orientation_approaches"}, {"score": 0.0045200127552893704, "phrase": "main_tasks"}, {"score": 0.004439097815805505, "phrase": "opinion_mining_and_sentiment_analysis_fields"}, {"score": 0.0038070472635126276, "phrase": "knowledge_resources"}, {"score": 0.0035095935622207956, "phrase": "majority_rule"}, {"score": 0.003249966782844541, "phrase": "opinion_corpus"}, {"score": 0.0032207278946434375, "phrase": "arabic"}, {"score": 0.003134503353065008, "phrase": "english_version"}, {"score": 0.0026514708899935333, "phrase": "best_performance"}, {"score": 0.002488724764295623, "phrase": "best_results"}, {"score": 0.0023571835517819124, "phrase": "evoca"}, {"score": 0.0021531831652035482, "phrase": "polarity_detection"}, {"score": 0.0021049977753042253, "phrase": "bilingual_parallel_corpora"}], "paper_keywords": ["natural language processing"], "paper_abstract": "Polarity classification is one of the main tasks related to the opinion mining and sentiment analysis fields. The aim of this task is to classify opinions as positive or negative. There are two main approaches to carrying out polarity classification: machine learning and semantic orientation based on the integration of knowledge resources. In this study, we propose to combine both approaches using a voting system based on the majority rule. In this way, we attempt to improve the polarity classification of two parallel corpora such as the opinion corpus for Arabic (OCA) and the English version of the OCA (EVOCA). Several experiments have been performed to check the feasibility of the proposed method. The results show that the experiment that took into account both approaches in the voting system obtained the best performance. Moreover, it is also shown that the proposed method slightly improves the best results obtained using machine learning approaches solely over the OCA and the EVOCA separately. Therefore, we can conclude that the approach proposed here might be considered a good strategy for polarity detection when we work with bilingual parallel corpora.", "paper_title": "Improving polarity classification of bilingual parallel corpora combining machine learning and semantic orientation approaches", "paper_id": "WOS:000322870300010"}