{"auto_keywords": [{"score": 0.042389058155836365, "phrase": "victim_nodes"}, {"score": 0.03838966001402311, "phrase": "sleep_deprivation_attack"}, {"score": 0.015057811791245978, "phrase": "sensor_nodes"}, {"score": 0.012330724603970628, "phrase": "barrage_attack"}, {"score": 0.00481495049065317, "phrase": "sensor_networks"}, {"score": 0.00453772385360173, "phrase": "low_power_sleep_mode"}, {"score": 0.00443133501650381, "phrase": "network_longevity"}, {"score": 0.004344577216137524, "phrase": "adversary_nodes"}, {"score": 0.004192653260742387, "phrase": "cluster_heads"}, {"score": 0.0037087324991876727, "phrase": "legitimate_requests"}, {"score": 0.0032804824152243106, "phrase": "slightly_more_energy"}, {"score": 0.002867268370615848, "phrase": "energy_savings"}, {"score": 0.002788865808981643, "phrase": "sleep_mode"}, {"score": 0.0023896108055582615, "phrase": "adversary's_attack"}, {"score": 0.0023058910418682676, "phrase": "cluster_head"}, {"score": 0.0021049977753042253, "phrase": "hash-based_scheme"}], "paper_keywords": ["energy attacks", " secure cluster head election", " distributed algorithms", " sensor networks"], "paper_abstract": "The ability of sensor nodes to enter a low power sleep mode is very useful for extending network longevity. We show how adversary nodes can exploit clustering algorithms to ensure their selection as cluster heads for the purpose of launching attacks that prevent victim nodes from sleeping. We present two such attacks: the barrage attack and the sleep deprivation attack. The barrage attack bombards victim nodes with legitimate requests, whereas the sleep deprivation attack makes requests of victim nodes only as often as in necessary to keep the victims awake. We show that while the barrage attack causes its victims to spend slightly more energy, it is more easily detected and requires more effort on behalf of the attacker. Thus, we have focused our research on the sleep deprivation attack. Our analysis indicates that this attack can nullify any energy savings obtained by allowing sensor nodes to enter sleep mode. We also analyze three separate methods for mitigating this attack: the random vote scheme, the round robin scheme, and the hash-based scheme. We have evaluated these schemes based upon their ability to reduce the adversary's attack the amount of time required to select a cluster head, and the amount of energy required to perform each scheme. We have found that of the three clustering methods analyzed, the hash-based scheme is the best at mitigating the sleep deprivation attack.", "paper_title": "The sleep deprivation attack in sensor networks: Analysis and methods of defense", "paper_id": "WOS:000239140800005"}