{"auto_keywords": [{"score": 0.04040281946301967, "phrase": "fuel_molecules"}, {"score": 0.035170832591204404, "phrase": "gvstd"}, {"score": 0.015719716506582538, "phrase": "guide_vane_swirl"}, {"score": 0.015323334533395763, "phrase": "air_flow"}, {"score": 0.004652016085325825, "phrase": "ci_engine"}, {"score": 0.0045464538515249085, "phrase": "alternative_fuels"}, {"score": 0.004456044928556639, "phrase": "crude_oil"}, {"score": 0.0044305441225064345, "phrase": "environmental_pollutions"}, {"score": 0.004379977556546879, "phrase": "main_concerns"}, {"score": 0.004354910160382692, "phrase": "automotive_industry"}, {"score": 0.004329986892325184, "phrase": "biodiesel"}, {"score": 0.004268293864953256, "phrase": "primary_selection"}, {"score": 0.004111960807556655, "phrase": "world_production"}, {"score": 0.004007083686875716, "phrase": "higher_viscosity"}, {"score": 0.003972720096368191, "phrase": "conventional_diesel"}, {"score": 0.0035620354052144656, "phrase": "intake_port"}, {"score": 0.0035213462189102713, "phrase": "organized_turbulence"}, {"score": 0.003130077012135034, "phrase": "experimental_results"}, {"score": 0.003068159785087078, "phrase": "ca"}, {"score": 0.003006654007926993, "phrase": "in-cylinder_airflow_characteristics"}, {"score": 0.0026955672787561742, "phrase": "intake_runner"}, {"score": 0.0025596276616952516, "phrase": "combustion_chamber"}, {"score": 0.0024096506756019704, "phrase": "injected_fuel_region"}, {"score": 0.0022619269791898378, "phrase": "engine_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Guide vanes", " Biodiesel", " Compression ignition (CI) engine", " Turbulence kinetic energy (TKE)", " CFD"], "paper_abstract": "The demand for alternative fuels has increased since the recession of crude oil and environmental pollutions have become the main concerns in automotive industry. Biodiesel is seen as the primary selection in this category as it is renewable and able to mitigate the world production of greenhouse gas CO2. However, biodiesel has a higher viscosity compared to conventional diesel, consequently making it less susceptible to evaporation since the fuel molecules are heavier and move slower than diesel. This paper proposes that a Guide Vane Swirl and Tumble Device (GVSTD) be installed in front of the intake port to develop an organized turbulence to assist in the breakup of fuel molecules for improved mixing with air. To investigate the effect of GVSTD to generate better in-cylinder air flow, ANSYS-CFX was used to run a 3D cold flow IC engine simulation. The model was validated with the experimental results of in-cylinder pressure from 0 degrees CA to 540 degrees CA and the results of in-cylinder airflow characteristics from simulations were compared with other related research works. In this research, three designs of the GVSTD with the height of the vanes varied at 0.25R, 0.50R and 0.75R, where R is the radius of the intake runner, were compared with the model without GVSTD to investigate its effect on the air flow inside the combustion chamber. The results showed that the 0.25R guide vanes created more turbulence, in-cylinder velocity, swirl and tumble in the injected fuel region than the other designs, which is needed to break up the fuel molecules to mix with air that will eventually improve the engine performance with biodiesel. The resistance to the air flow due to the vanes was also least for the 0.25R guide vanes. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "CFD modelling of the effect of guide vane swirl and tumble device to generate better in-cylinder air flow in a CI engine fuelled by biodiesel", "paper_id": "WOS:000323464300022"}