{"auto_keywords": [{"score": 0.047232975924705364, "phrase": "medical_materials"}, {"score": 0.015719716506582538, "phrase": "periodic_working_time"}, {"score": 0.015517134593481398, "phrase": "single_machine"}, {"score": 0.003920384090110374, "phrase": "wrapping_machine"}, {"score": 0.003408091901859624, "phrase": "supply_chain_scheduling_problem"}, {"score": 0.0031223774204093713, "phrase": "periodic_maintenance"}, {"score": 0.003068166587650604, "phrase": "wrapping_interruption"}, {"score": 0.0028480459059007468, "phrase": "wrapped_packages"}, {"score": 0.002690406375639144, "phrase": "delivery_batch"}, {"score": 0.0025192983141887285, "phrase": "total_delivery_time"}, {"score": 0.0024864020775253767, "phrase": "total_delivery_cost"}, {"score": 0.002328238264850759, "phrase": "-approximation_algorithm"}, {"score": 0.0022579036318895753, "phrase": "branch-and-bound_algorithm"}, {"score": 0.0022089663761854657, "phrase": "computational_results"}, {"score": 0.0021422271362195734, "phrase": "numerical_simulation_results"}, {"score": 0.0021049977753042253, "phrase": "approximation_algorithm"}], "paper_keywords": ["Supply chain scheduling", " Periodic maintenance", " Nonresumable job", " Approximation algorithm", " Branch-and-bound algorithm"], "paper_abstract": "The warehouse of a hospital is responsible for wrapping medical materials into packages by a baler and dispatching packages to the departments of the hospital periodically to guarantee the requirements of patients. The manager of the warehouse wants to efficiently utilize the wrapping machine and reduce the times of distributions to decrease logistics cost. If we regard the baler as a single machine and medical materials as jobs, the problem can be summarized as a supply chain scheduling problem integrated with production and delivery. Owing to periodic working time of workers, the machine can be viewed as having periodic maintenance. Because the wrapping interruption of medical materials is not allowed in the hospital, processing of any job is nonresumable. All wrapped packages are dispatched before workers are off duty. This means that each delivery batch is delivered just before each maintenance. Our goal is to minimize sum of the total delivery time and the total delivery cost. We show that the problem is strongly NP-hard and provide a -approximation algorithm. Moreover, we propose a branch-and-bound algorithm. Finally we present computational results for some instances generated randomly. Numerical simulation results show that the approximation algorithm performs efficiently.", "paper_title": "Supply chain scheduling problem in the hospital with periodic working time on a single machine", "paper_id": "WOS:000363033600005"}