{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "group_strategyproof_budget-balanced_cost-sharing_mechanisms"}, {"score": 0.0046928556063004214, "phrase": "cooperative_cost-sharing_games"}, {"score": 0.003971006689166329, "phrase": "positive_transfer"}, {"score": 0.0036605323485683983, "phrase": "total_amount"}, {"score": 0.0034033029171804106, "phrase": "group_strategyproofness"}, {"score": 0.003031287195944274, "phrase": "serviced_users"}, {"score": 0.002904040426340639, "phrase": "upper_continuous_mechanisms"}, {"score": 0.0028060889647071787, "phrase": "known_general_techniques"}, {"score": 0.002597577409911978, "phrase": "first_negative_results"}, {"score": 0.002414861891567233, "phrase": "interesting_generalization"}, {"score": 0.0023942269247089277, "phrase": "cost-sharing_games"}, {"score": 0.002264321283759897, "phrase": "generalized_cost-sharing_games"}, {"score": 0.0022067604433257814, "phrase": "known_cost-sharing_games"}, {"score": 0.002178529882942255, "phrase": "interesting_practical_applications"}, {"score": 0.0021049977753042253, "phrase": "multicast_transmissions"}], "paper_keywords": [""], "paper_abstract": "We study mechanisms for cooperative cost-sharing games satisfying: voluntary participation (i.e., no user is forced to pay more her valuation of the service), consumer sovereignty (i.e, every user can get the service if her valuation is large enough), no positive transfer (i.e., no user receives money from the mechanism), budget balance (i.e., the total amount of money that users pay is equal to the cost of servicing them), and group strategyproofness (i.e., the mechanism is resistant to coalitions). We show that mechanisms satisfying all these requirements must obey certain algorithmic properties (which basically specify how the serviced users are selected). Our results yield a characterization of upper continuous mechanisms (this class is interesting as all known general techniques yield mechanisms of this type). Finally, we extend some of our negative results and obtain the first negative results on the existence of mechanisms satisfying all requirements above. We apply these results to an interesting generalization of cost-sharing games in which the mechanism cannot service certain \"forbidden\" subsets of users. These generalized cost-sharing games correspond to natural variants of known cost-sharing games and have interesting practical applications (e.g., sharing the cost of multicast transmissions which cannot be encrypted).", "paper_title": "The algorithmic structure of group strategyproof budget-balanced cost-sharing mechanisms", "paper_id": "WOS:000236464100027"}