{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "heuristic-search_based_engines"}, {"score": 0.004598933498016774, "phrase": "heuristic-search_based_chess_programs"}, {"score": 0.004460309246062286, "phrase": "human_skill_levels"}, {"score": 0.004195418010131832, "phrase": "programs'_evaluations"}, {"score": 0.0036181717017041387, "phrase": "heuristic-search_based_programs"}, {"score": 0.0033857878144822906, "phrase": "large_data_sets"}, {"score": 0.003351381374975648, "phrase": "recorded_human_decisions"}, {"score": 0.003250238918180901, "phrase": "skill-based_performances"}, {"score": 0.0032172054825137866, "phrase": "selected_chess_players"}, {"score": 0.0025046245057922557, "phrase": "human_world_chess_champions"}, {"score": 0.0024289743270061157, "phrase": "strongest_chess_programs"}, {"score": 0.0022961534630650347, "phrase": "crafty."}, {"score": 0.0022267859286766553, "phrase": "computer_heuristic_search"}, {"score": 0.0021705796895687864, "phrase": "skill_levels"}, {"score": 0.0021484955960643167, "phrase": "chess_players"}], "paper_keywords": [""], "paper_abstract": "Establishing heuristic-search based chess programs as appropriate tools for estimating human skill levels at chess may seem impossible due to the following issues: the programs' evaluations and decisions tend to change with the depth of search and with the program used. In this research, we provide an analysis of the differences between heuristic-search based programs in estimating chess skill. We used four different chess programs to perform analyses of large data sets of recorded human decisions, and obtained very similar rankings of skill-based performances of selected chess players using any of these programs at various levels of search. A conclusion is that, given two chess players, all the programs unanimously rank one player to be clearly stronger than the other, or all the programs assess their strengths to be similar. We also repeated our earlier analysis with the program CRAFTY of the human World Chess Champions with currently one of the strongest chess programs, RYBKA 3(2), and obtained qualitatively very similar results as with CRAFTY. This speaks in favour of computer heuristic search being adequate for estimating skill levels of chess players, despite the above stated issues.", "paper_title": "Using Heuristic-Search Based Engines for Estimating Human Skill at Chess", "paper_id": "WOS:000295384100001"}