{"auto_keywords": [{"score": 0.03898843416319269, "phrase": "cluster_ensembles"}, {"score": 0.02322730111336099, "phrase": "collaborative_filtering_recommendation"}, {"score": 0.004776484866276242, "phrase": "recommender_systems"}, {"score": 0.004286171444202565, "phrase": "collaborative_filtering"}, {"score": 0.004234884779773412, "phrase": "widely_used_recommendation_technique"}, {"score": 0.0038305869305614504, "phrase": "clustering_techniques"}, {"score": 0.002868646843975439, "phrase": "cluster-based_similarity"}, {"score": 0.002625914195439153, "phrase": "experimental_results"}, {"score": 0.0025840393971281513, "phrase": "movielens"}, {"score": 0.002512342528545883, "phrase": "better_recommendation_performance"}, {"score": 0.0024922258873137093, "phrase": "single_clustering_techniques"}, {"score": 0.0024524733595572084, "phrase": "recommendation_accuracy"}, {"score": 0.0023558375480288297, "phrase": "statistically_significant_differences"}, {"score": 0.0022358683283304533, "phrase": "som_or_k-means_ensembles"}, {"score": 0.002156402793481102, "phrase": "baseline_collaborative_filtering_technique"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Recommender systems", " Collaborative filtering", " k-Means", " Self-organizing maps", " Cluster ensembles"], "paper_abstract": "Recommender systems, which recommend items of information that are likely to be of interest to the users, and filter out less favored data items, have been developed. Collaborative filtering is a widely used recommendation technique. It is based on the assumption that people who share the same preferences on some items tend to share the same preferences on other items. Clustering techniques are commonly used for collaborative filtering recommendation. While cluster ensembles have been shown to outperform many single clustering techniques in the literature, the performance of cluster ensembles for recommendation has not been fully examined. Thus, the aim of this paper is to assess the applicability of cluster ensembles to collaborative filtering recommendation. In particular, two well-known clustering techniques (self-organizing maps (SOM) and k-means), and three ensemble methods (the cluster-based similarity partitioning algorithm (CSPA), hypergraph partitioning algorithm (HGPA), and majority voting) are used. The experimental results based on the Movielens dataset show that cluster ensembles can provide better recommendation performance than single clustering techniques in terms of recommendation accuracy and precision. In addition, there are no statistically significant differences between either the three SOM ensembles or the three k-means ensembles. Either the SOM or k-means ensembles could be considered in the future as the baseline collaborative filtering technique. (c) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Cluster ensembles in collaborative filtering recommendation", "paper_id": "WOS:000300609500017"}