{"auto_keywords": [{"score": 0.04835227522307675, "phrase": "imbalanced_datasets"}, {"score": 0.00481495049065317, "phrase": "different_methods"}, {"score": 0.004744748477093856, "phrase": "class_imbalance_problem"}, {"score": 0.004457579615095599, "phrase": "standard_classification_methods"}, {"score": 0.004392565073466714, "phrase": "accurate_predictions"}, {"score": 0.004218602458288531, "phrase": "majority_class"}, {"score": 0.004172360444377281, "phrase": "minority_classes"}, {"score": 0.003948613642680196, "phrase": "pathological_conditions"}, {"score": 0.0036418947847496365, "phrase": "state-of-the-art_classification_methods"}, {"score": 0.003433847524648519, "phrase": "one-class_and_dimension_reduction"}, {"score": 0.0029532175351058864, "phrase": "novel_ensemble"}, {"score": 0.0028360962841331634, "phrase": "class_imbalance"}, {"score": 0.00280496585980086, "phrase": "proposed_ensemble"}, {"score": 0.0025868521085189843, "phrase": "keel-dataset_repository"}, {"score": 0.0024389277933858054, "phrase": "open_literature"}, {"score": 0.0023335495163073544, "phrase": "fair_comparison"}, {"score": 0.0023164335087514274, "phrase": "different_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Imbalanced dataset", " Ensemble of classifiers", " Support vector machine", " Downsampling/oversampling"], "paper_abstract": "Many classification problems must deal with imbalanced datasets where one class - the majority class outnumbers the other classes. Standard classification methods do not provide accurate predictions in this setting since classification is generally biased towards the majority class. The minority classes are oftentimes the ones of interest (e.g., when they are associated with pathological conditions in patients), so methods for handling imbalanced datasets are critical. Using several different datasets, this paper evaluates the performance of state-of-the-art classification methods for handling the imbalance problem in both binary and multi-class datasets. Different strategies are considered, including the one-class and dimension reduction approaches, as well as their fusions. Moreover, some ensembles of classifiers are tested, in addition to stand-alone classifiers, to assess the effectiveness of ensembles in the presence of imbalance. Finally, a novel ensemble of ensembles is designed specifically to tackle the problem of class imbalance: the proposed ensemble does not need to be tuned separately for each dataset and outperforms all the other tested approaches. To validate our classifiers we resort to the KEEL-dataset repository, whose data partitions (training/test) are publicly available and have already been used in the open literature: as a consequence, it is possible to report a fair comparison among different approaches in the literature. Our best approach (MATIAB code and datasets not easily accessible elsewhere) will be available at https://www.dei.unipd.it/node/2357. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Coupling different methods for overcoming the class imbalance problem", "paper_id": "WOS:000352173100006"}