{"auto_keywords": [{"score": 0.04972395969484311, "phrase": "collaborative_learning"}, {"score": 0.04937176974353987, "phrase": "knowledge_management"}, {"score": 0.004587535692463736, "phrase": "users'_experiences"}, {"score": 0.004306205029641728, "phrase": "higher_education"}, {"score": 0.004211069233133584, "phrase": "postgraduate_students"}, {"score": 0.004133390261297075, "phrase": "hong_kong"}, {"score": 0.004087470148108129, "phrase": "mediawiki"}, {"score": 0.003865376734263166, "phrase": "course_requirements"}, {"score": 0.0036281710561308377, "phrase": "students'_perceptions"}, {"score": 0.003392804886610623, "phrase": "suitable_tools"}, {"score": 0.003367611042980526, "phrase": "group_projects"}, {"score": 0.003293142761521425, "phrase": "group_collaboration"}, {"score": 0.0031257046538823354, "phrase": "knowledge_construction"}, {"score": 0.0025556529150386168, "phrase": "wild_variants"}, {"score": 0.002443784721651744, "phrase": "best_choice"}, {"score": 0.0023368018449680295, "phrase": "different_types"}, {"score": 0.0021049977753042253, "phrase": "appropriate_wiki"}], "paper_keywords": ["Wilds", " Collaborative learning", " Knowledge management", " Knowledge sharing"], "paper_abstract": "Purpose - This study aims to examine users' experiences and perceptions associated with the use of two wild variants in the context of collaborative learning and knowledge management in higher education. Design/methodology/approach - Participants included two groups of postgraduate students from a university in Hong Kong who used MediaWiki (n = 21) and TWiki (n = 16) in completing course requirements. Using a multiple case study approach and a mixed methods research design, data logs on the wiki platforms were downloaded and the contents were analysed. Students' perceptions were examined through a survey. Findings - The findings indicate that both wikis were regarded as suitable tools for group projects, and that they improved group collaboration and work quality. Both wilds were also viewed as enabling tools for knowledge construction and sharing. Research limitations/implications - This study provides insights that may inform the decisions of educators who are considering the use of wilds in their courses as a platform to enhance collaborative learning and knowledge management. Originality/value - Previous research has shown that wilds can be effectively used in education. However there are a number of wild variants and it may be difficult to identify which variant would be the best choice. There is a dearth of research comparing the effectiveness of different types of wilds. This study compares two wiki variants on a number of outcomes which may provide some insights to teachers who are in the process of selecting an appropriate wiki for teaching and learning.", "paper_title": "Users' experiences and perceptions on using two wiki platforms for collaborative learning and knowledge management", "paper_id": "WOS:000320636600009"}