{"auto_keywords": [{"score": 0.04142946866573755, "phrase": "serious_leisure"}, {"score": 0.041148614087474424, "phrase": "information_practices"}, {"score": 0.0044237033788643715, "phrase": "australian_re-enactors"}, {"score": 0.003760137090849196, "phrase": "research_styles"}, {"score": 0.0037336520904376687, "phrase": "decision-making_processes"}, {"score": 0.003629557750546267, "phrase": "authentic_impressions"}, {"score": 0.0035659724303237937, "phrase": "ethnographic_case_study"}, {"score": 0.0033698643928647726, "phrase": "stebbins's_categorisation"}, {"score": 0.0031732652552570644, "phrase": "common_practices"}, {"score": 0.002998688867384969, "phrase": "collectively_agreed_standard"}, {"score": 0.0027159094186967247, "phrase": "individual_knowledge"}, {"score": 0.0024772013657695896, "phrase": "historical_perspective"}, {"score": 0.0024251568696803177, "phrase": "first_time"}, {"score": 0.002357457094026928, "phrase": "information_studies_perspective"}, {"score": 0.002219790619936024, "phrase": "understanding_authenticity"}, {"score": 0.0021885820862000962, "phrase": "expert_amateur"}, {"score": 0.0021501863832966966, "phrase": "specialist_skills"}, {"score": 0.0021049977753042253, "phrase": "fuller_investigation"}], "paper_keywords": ["Behaviour", " Communities", " Authenticity", " Leisure activities"], "paper_abstract": "Purpose - The purpose of this paper is to explore the practices used by Australian re-enactors to achieve authenticity, a communally agreed measure of acceptability in the creation of an impression, the dress, behaviours and accoutrements of the period, through the concepts of serious leisure and information practices. Design/methodology/approach - Re-enactment is a practical, information-based performative activity. In this paper, the research styles and decision-making processes developed and employed by its enthusiasts to create authentic impressions are examined through an ethnographic case study. Findings - The re-enactors are identified as \"makers and tinkerers\", in Stebbins's categorisation of serious leisure. Research, documentation and the sharing of information, knowledge and skills are common practices among re-enactors and acknowledged as integral to the processes of creating an impression to a collectively agreed standard of authenticity. Re-enactors' \"making\" includes not only the creation of the impression but also the documentation of their process of creating it. They prize individual knowledge and expertise and through this, seek to stand out from the collective. Originality/value - Although communities of re-enactors are often studied from a historical perspective, this may be the first time a study has been undertaken from an information studies perspective. The tension between the collective, social norms and standards that support the functioning of the group in understanding authenticity, and the expert amateur; the individual with specialist skills and talents, encourages a fuller investigation of the relationships between the individual and the collective in the context of information practices.", "paper_title": "Re-enactment and its information practices; tensions between the individual and the collective", "paper_id": "WOS:000355922100010"}