{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "product_placement"}, {"score": 0.015581461158943833, "phrase": "social_media"}, {"score": 0.004229927464182562, "phrase": "-_two_field_experiments"}, {"score": 0.004136469845987887, "phrase": "research_models"}, {"score": 0.003991196463806465, "phrase": "random_sampling"}, {"score": 0.0037997077863530897, "phrase": "different_experimental_settings"}, {"score": 0.0035374012552316573, "phrase": "brand_impression"}, {"score": 0.0026806139086152365, "phrase": "deeper_browsing_depth"}, {"score": 0.002644865209801606, "phrase": "browsing_time"}, {"score": 0.0026095920086044145, "phrase": "product_web_site"}, {"score": 0.0025518429503461736, "phrase": "higher_awareness_vehicle"}, {"score": 0.0022816681646340518, "phrase": "marketing_message"}], "paper_keywords": ["Social media", " Product placement", " Brand awareness", " Placement presentation", " Product prominence", " Vehicle and product match"], "paper_abstract": "Purpose - The purpose of this paper is to focus specifically on the examination of factors influencing the effectiveness of product placement in social media. Design/methodology/approach - Two field experiments were used to test research models and questions. In each experiment, random sampling was used to assign volunteers into groups, controlled by different experimental settings. Questionnaires were distributed to the volunteers in order to collect their attitude toward advertisement, brand impression, and intention to click the advertisement. Their browsing behavior was measured by click through rate, browse depth, and browsing time. Findings - The paper found that the effects of product placement conducts ( product prominence and presentation) in social media are similar to the effects of product placement in other media. Also, a match between the vehicle and product would create deeper browsing depth and longer browsing time on the product web site. Product placement on a higher awareness vehicle would be more effective for marketing. Originality/value - This study makes its contribution in understanding the effectiveness of product placement in social media on delivering a marketing message. The results further highlight the importance of \"integrating\" the product placement content with its context and its vehicle.", "paper_title": "An exploratory study of product placement in social media", "paper_id": "WOS:000352105300008"}