{"auto_keywords": [{"score": 0.036142415231628956, "phrase": "concept_lattice"}, {"score": 0.00481495049065317, "phrase": "formal_concept_analysis"}, {"score": 0.004769197175280734, "phrase": "fca"}, {"score": 0.004568525347438891, "phrase": "knowledge_representation"}, {"score": 0.004397230847865867, "phrase": "different_areas"}, {"score": 0.004212157020917929, "phrase": "computational_cost"}, {"score": 0.004132411680987228, "phrase": "large_number"}, {"score": 0.00409310463335204, "phrase": "formal_concepts"}, {"score": 0.003597514862052876, "phrase": "irrelevant_details"}, {"score": 0.0033969001271637964, "phrase": "appropriate_complexity"}, {"score": 0.0032537918276414226, "phrase": "fca."}, {"score": 0.0026999603129904902, "phrase": "concept_lattice_reduction"}, {"score": 0.002524982927936405, "phrase": "main_techniques"}, {"score": 0.002406968743305622, "phrase": "seven_dimensions"}, {"score": 0.00220823903315848, "phrase": "computational_complexity"}, {"score": 0.002166349705365602, "phrase": "different_classes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Formal concept analysis", " Concept lattices", " Reduction"], "paper_abstract": "Formal concept analysis (FCA) is currently considered an important formalism for knowledge representation, extraction and analysis with applications in different areas. A problem identified in several applications is the computational cost due to the large number of formal concepts generated. Even when that number is not very large, the essential aspects, those effectively needed, can be immersed in a maze of irrelevant details. In fact, the problem of obtaining a concept lattice of appropriate complexity and size is one of the most important problems of FCA. In literature, several different approaches to control the complexity and size of a concept lattice have been described, but so far they have not been properly analyzed, compared and classified. We propose the classification of techniques for concept lattice reduction in three groups: redundant information removal, simplification, and selection. The main techniques to reduce concept lattice are analyzed and classified based on seven dimensions, each one composed of a set of characteristics. Considerations are made about the applicability and computational complexity of approaches of different classes. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Concept lattices reduction: Definition, analysis and classification", "paper_id": "WOS:000357230000022"}