{"auto_keywords": [{"score": 0.04923904483098963, "phrase": "affymetrix_snp_arrays"}, {"score": 0.03562070667849401, "phrase": "non-relevant_effects"}, {"score": 0.034222039272388, "phrase": "biologically_relevant_effect"}, {"score": 0.029139449391002575, "phrase": "italics"}, {"score": 0.00481495049065317, "phrase": "dna_copy_number"}, {"score": 0.00443308765153716, "phrase": "dna_copy_number_measurement"}, {"score": 0.004178935413340453, "phrase": "precise_localization"}, {"score": 0.004129873531628877, "phrase": "genomic_alterations"}, {"score": 0.0040097139701644165, "phrase": "powerful_tool"}, {"score": 0.00387011040370557, "phrase": "copy_number_polymorphism"}, {"score": 0.0036914757355166966, "phrase": "non-relevant_sources"}, {"score": 0.002620040660435039, "phrase": "biological_and_non-relevant_effects"}, {"score": 0.0025436978068459565, "phrase": "iterative_manner"}, {"score": 0.0024842242921857705, "phrase": "irrelevant_effects"}, {"score": 0.0021049977753042253, "phrase": "quantitative_pcr."}], "paper_keywords": [""], "paper_abstract": "Motivation: Affymetrix SNP arrays can be used to determine the DNA copy number measurement of 11 000-500 000 SNPs along the genome. Their high density facilitates the precise localization of genomic alterations and makes them a powerful tool for studies of cancers and copy number polymorphism. Like other microarray technologies it is influenced by non-relevant sources of variation, requiring correction. Moreover, the amplitude of variation induced by non-relevant effects is similar or greater than the biologically relevant effect (i.e. true copy number), making it difficult to estimate non-relevant effects accurately without including the biologically relevant effect. Results: We addressed this problem by developing ITALICS, a normalization method that estimates both biological and non-relevant effects in an alternate, iterative manner, accurately eliminating irrelevant effects. We compared our normalization method with other existing and available methods, and found that ITALICS outperformed these methods for several in-house datasets and one public dataset. These results were validated biologically by quantitative PCR.", "paper_title": "ITALICS: an algorithm for normalization and DNA copy number calling for Affymetrix SNP arrays", "paper_id": "WOS:000254010400005"}