{"auto_keywords": [{"score": 0.029590162289605374, "phrase": "host_graph"}, {"score": 0.02802353521893136, "phrase": "poa"}, {"score": 0.00481495049065317, "phrase": "general_host_graphs"}, {"score": 0.004682575242681044, "phrase": "classic_network_creation_game"}, {"score": 0.004600228893803583, "phrase": "n_players"}, {"score": 0.004263336444795021, "phrase": "physical_limitations"}, {"score": 0.004042241624040812, "phrase": "routing_cost_component"}, {"score": 0.0038423027485217738, "phrase": "popular_routing_cost"}, {"score": 0.003462704420080129, "phrase": "associated_pure_nash_equilibria"}, {"score": 0.0033759367489122716, "phrase": "corresponding_price"}, {"score": 0.003200714172124464, "phrase": "lower_bound"}, {"score": 0.002482962582546729, "phrase": "positive_side"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Network creation games", " Pure Nash equilibrium", " Price of Anarchy", " Host graph"], "paper_abstract": "In this paper we study a generalization of the classic network creation game in the scenario in which the n players sit on a given arbitrary host graph, which constrains the set of edges a player can activate at a cost of alpha >= 0 each. This finds its motivations in the physical limitations one can have in constructing links in practice, and it has been studied in the past only when the routing cost component of a player is given by the sum of distances to all the other nodes. Here, we focus on another popular routing cost, namely that which takes into account for each player her maximum distance to any other player. For this version of the game, we first analyze some of its computational and dynamic aspects, and then we address the problem of understanding the structure of associated pure Nash equilibria. In this respect, we show that the corresponding price of anarchy (PoA) is fairly bad, even for very simple host graph topologies. More precisely, we first exhibit a lower bound of Omega(root n/(1 + alpha)) for any alpha = 0(n). Notice that this implies a counter-intuitive lower bound of Omega (root n) even for alpha = 0, i.e., when edges can be activated for free. Then, we show that when the host graph is restricted to be either k-regular (for any constant k >= 3), or a 2-dimensional grid, the PoA is still Omega(1 + min{alpha, n/alpha}), which is proven to be tight for alpha = Omega(root n). On the positive side, if alpha >= n, we show that the PoA is at most 2. Finally, in the case in which the host graph is very sparse (i.e., vertical bar E(H)vertical bar = n - 1+k, with k = 0(1)), we prove that the PoA is 0(1), for any alpha. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "The max-distance network creation game on general host graphs", "paper_id": "WOS:000350835500004"}