{"auto_keywords": [{"score": 0.049571431541439746, "phrase": "intelligent_computational_methods"}, {"score": 0.013704352423712624, "phrase": "qos_multicast_trees"}, {"score": 0.00481495049065317, "phrase": "multimedia_group_communications"}, {"score": 0.004259293347851015, "phrase": "unified_framework"}, {"score": 0.003952828685048176, "phrase": "multimedia_communication_network"}, {"score": 0.0038487848937121204, "phrase": "qos_multicast_routing_problem"}, {"score": 0.003668333531296882, "phrase": "-based_qos_multicast_routing_algorithms"}, {"score": 0.0030923570058383355, "phrase": "end-to-end_delay"}, {"score": 0.003010893527930816, "phrase": "qos_parameters"}, {"score": 0.00260657976055413, "phrase": "small-scale_real-world_multimedia_communication_network"}, {"score": 0.002470987929071079, "phrase": "simulation_results"}, {"score": 0.002393034183276193, "phrase": "near-optimal_qos_multicast_trees"}, {"score": 0.0022685255265595624, "phrase": "running_time"}, {"score": 0.0021735890994119757, "phrase": "algorithmic_structures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["QoS multicast", " multimedia group communications", " intelligent computational methods", " multicast tree"], "paper_abstract": "In this paper, we investigate the problem of quality-of-service (QoS) multicast routing for multimedia group communications. We first develop a unified framework for achieving QoS multicast trees using intelligent computational methods. The framework consists of the model for multimedia communication network, the formulation of QoS multicast routing problem, and three key components used in intelligent computational methods-based QoS multicast routing algorithms. Then we propose three QoS multicast algorithms based on three representative intelligent computational methods (i.e., genetic algorithm, simulated annealing, and Tabu search), separately. In these algorithms, both the network resource requirements and the end-to-end delay are considered as the QoS parameters. Various issues are analyzed and designed for applying these three intelligent computational methods to construct QoS multicast trees. By simulation, we evaluate the performance of these three algorithms on a small-scale real-world multimedia communication network and a randomly generated large-scale network. Simulation results show that our algorithms can find near-optimal QoS multicast trees with high success rate. We also compare the running time among them, which help explain the algorithmic structures. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "QoS multicast routing for multimedia group communications using intelligent computational methods", "paper_id": "WOS:000239484800004"}