{"auto_keywords": [{"score": 0.049604883316905664, "phrase": "torus"}, {"score": 0.00481495049065317, "phrase": "low-profile_expansion_cards"}, {"score": 0.004650086856905758, "phrase": "direct_topologies"}, {"score": 0.004188459638572375, "phrase": "five_and_six_dimensions"}, {"score": 0.0038676325043529524, "phrase": "low-profile_communication_expansion_cards"}, {"score": 0.003347259612209552, "phrase": "four-port_expansion_cards"}, {"score": 0.0024571101010891347, "phrase": "six_neighbor_nodes"}, {"score": 0.0021798257311714665, "phrase": "detailed_study"}, {"score": 0.0021474369836979048, "phrase": "possible_port_configurations"}, {"score": 0.0021049977753042253, "phrase": "specific_network_conditions"}], "paper_keywords": ["Interconnection network", " torus topology", " switch architecture", " formal analysis", " performance evaluation"], "paper_abstract": "Torus is a subclass of direct topologies that was defined in theory to support dimensions. Although recently some supercomputers have been built on a network with five and six dimensions, the most common case is when only three dimensions are implemented. In the market, there are low-profile communication expansion cards that have a reduced number of ports which is not enough to build tori of a certain number of dimensions. In this paper, we will deal with four-port expansion cards. By means of one of these cards per node, a 2-D torus topology could be built, but not a 3-D torus topology. However, two of these cards could be used to build each node of a 3-D torus topology. In this case, two ports are used to interconnect both cards each other, and the other six ports to connect to six neighbor nodes in the 3-D torus. Theoretically, there are several ways of assigning the dimension and direction of the ports. This paper presents a detailed study of the possible port configurations, and under specific network conditions, the best of them is obtained.", "paper_title": "Building 3D Torus Using Low-Profile Expansion Cards", "paper_id": "WOS:000343887700006"}