{"auto_keywords": [{"score": 0.043832044934933846, "phrase": "service_delivery_organization"}, {"score": 0.03205338130903694, "phrase": "interaction_network"}, {"score": 0.00481495049065317, "phrase": "value_creation_networks"}, {"score": 0.004693476992528682, "phrase": "natural_ranking_problem"}, {"score": 0.004459605573798577, "phrase": "regular_interactions"}, {"score": 0.004421770937919324, "phrase": "end_goal"}, {"score": 0.004310173770196077, "phrase": "academic_collaboration_networks"}, {"score": 0.004285757761346838, "phrase": "creative_collaborations"}, {"score": 0.00402610372759447, "phrase": "service_requests"}, {"score": 0.0038145036431349202, "phrase": "multiple_agents"}, {"score": 0.0036139842783886205, "phrase": "problem_resolution"}, {"score": 0.0035629847652158663, "phrase": "customer_satisfaction"}, {"score": 0.003309124298009635, "phrase": "network_structure"}, {"score": 0.0031529693013776852, "phrase": "respective_agents"}, {"score": 0.0030558645258141888, "phrase": "influential_agents"}, {"score": 0.0030127172247606812, "phrase": "effective_and_efficient_spreading"}, {"score": 0.0028542251004668156, "phrase": "novel_algorithm"}, {"score": 0.0027979528910467705, "phrase": "key_aspect"}, {"score": 0.002758437099292967, "phrase": "special_nodes"}, {"score": 0.0025910754941526194, "phrase": "external_status"}, {"score": 0.0022474211029652313, "phrase": "experimental_results"}, {"score": 0.0022283123058680658, "phrase": "public_domain_real-life_datasets"}, {"score": 0.0021412594173592513, "phrase": "citation_ratings"}, {"score": 0.0021049977753042253, "phrase": "dblp_database"}], "paper_keywords": ["Node ranking", " Interaction networks", " Value creation", " Service science"], "paper_abstract": "In this paper, we consider a natural ranking problem that arises in settings in which a community of people (or agents) are engaged in regular interactions with an end goal of creating value. Examples of such scenarios are academic collaboration networks, creative collaborations, and interactions between agents of a service delivery organization. For instance, consider a service delivery organization which essentially resolves a sequence of service requests from its customers by deploying its agents to resolve the requests. Typically, resolving a request requires interaction between multiple agents and results in an outcome (or value). The outcome could be success or failure of problem resolution or an index of customer satisfaction. For this scenario, the ranking of the agents of the network should take into account two aspects: importance of the agents in the network structure that arises as a result of interactions and the value generated by the interactions involving the respective agents. Such a ranking can be used for several purposes such as identifying influential agents of the interaction network, effective and efficient spreading of messages in the network. In this paper, we formally model the above ranking problem and develop a novel algorithm for computing the ranking. The key aspect of our approach is creating special nodes in the interaction network corresponding to the outcomes and endowing them independent, external status. The algorithm then iteratively spreads the external status of the outcomes to the agents based on their interactions and the outcome of those interactions. This results in an eigenvector like formulation, which results in a method requiring computing the inverse of a matrix rather than the eigenvector. We present several theoretical characterizations of our algorithmic approach. We present experimental results on the public domain real-life datasets from the Internet Movie Database and a dataset constructed by retrieving impact and citation ratings for papers listed in the DBLP database.", "paper_title": "Outcome aware ranking in value creation networks", "paper_id": "WOS:000331974100002"}