{"auto_keywords": [{"score": 0.03390664563872252, "phrase": "outcome_indicators"}, {"score": 0.013416469432922695, "phrase": "cdr"}, {"score": 0.00481495049065317, "phrase": "electronic_medical_record"}, {"score": 0.004510502900568775, "phrase": "chronic_disease_registry"}, {"score": 0.004023120753104693, "phrase": "study_period"}, {"score": 0.003731774879299358, "phrase": "seven_process_indicators"}, {"score": 0.0034955755279605146, "phrase": "health_insurers"}, {"score": 0.0034276650497743603, "phrase": "reference_standard"}, {"score": 0.0033942044841803105, "phrase": "process_indicators"}, {"score": 0.0032742770692989766, "phrase": "patient_level"}, {"score": 0.0031482594269532254, "phrase": "compliant_or_non-compliant_values"}, {"score": 0.0030569295881497176, "phrase": "diagnostic_or"}, {"score": 0.002816860758719358, "phrase": "process_indicator"}, {"score": 0.002789346122034762, "phrase": "highest_dor._blood_pressure_measurement"}, {"score": 0.002735124197234483, "phrase": "bmi"}, {"score": 0.002708399936381754, "phrase": "eye_assessment"}, {"score": 0.0026907324647716395, "phrase": "low_dor."}, {"score": 0.0026470650216161577, "phrase": "highest_dor"}, {"score": 0.0026297965957221554, "phrase": "creatinine_clearance"}, {"score": 0.002545125352770175, "phrase": "lowest_dor"}, {"score": 0.0023682987863242427, "phrase": "good_concordance"}, {"score": 0.0022109627716538614, "phrase": "emr"}, {"score": 0.0021049977753042253, "phrase": "good_patient_overview"}], "paper_keywords": [""], "paper_abstract": "Objective Quality indicators for the treatment of type 2 diabetes are often retrieved from a chronic disease registry (CDR). This study investigates the quality of recording in a general practitioner's (GP) electronic medical record (EMR) compared to a simple, web-based CDR. Methods The GPs entered data directly in the CDR and in their own EMR during the study period (2011). We extracted data from 58 general practices (8235 patients) with type 2 diabetes and compared the occurrence and value of seven process indicators and 12 outcome indicators in both systems. The CDR, specifically designed for monitoring type 2 diabetes and reporting to health insurers, was used as the reference standard. For process indicators we examined the presence or absence of recordings on the patient level in both systems, for outcome indicators we examined the number of compliant or non-compliant values of recordings present in both systems. The diagnostic OR (DOR) was calculated for all indicators. Results We found less concordance for process. indicators than for outcome indicators. HbA1c testing was the process indicator with the highest DOR. Blood pressure measurement, urine albumin test, BMI recorded and eye assessment showed low DOR. For outcome indicators, the highest DOR was creatinine clearance <30 mL/min or mUmin/1.73 m(2) and the lowest DOR was systolic blood pressure <140 mm Hg. Conclusions Clinical items are not always adequately recorded in an EMR for retrieving indicators, but there is good concordance for the values of these items. If the quality of recording improves, indicators can be reported from the EMR, which will reduce the workload of GPs and enable GPs to maintain a good patient overview.", "paper_title": "Is the quality of data in an electronic medical record sufficient for assessing the quality of primary care?", "paper_id": "WOS:000337660600023"}