{"auto_keywords": [{"score": 0.0432381282696211, "phrase": "polynomial_number"}, {"score": 0.033224158496117734, "phrase": "best_nash_equilibrium"}, {"score": 0.00481495049065317, "phrase": "good_behavior."}, {"score": 0.004733625412289433, "phrase": "dramatic_difference"}, {"score": 0.0045556080393342165, "phrase": "nash_equilibria"}, {"score": 0.0044786435725543685, "phrase": "pure_strategies"}, {"score": 0.003841699919521703, "phrase": "global_information"}, {"score": 0.0037128955884188773, "phrase": "common_knowledge"}, {"score": 0.0035883942463601688, "phrase": "helpful_central_agency"}, {"score": 0.0034828730516958807, "phrase": "wide_range"}, {"score": 0.0034532961266947734, "phrase": "interesting_games"}, {"score": 0.002936577024096783, "phrase": "low-cost_states"}, {"score": 0.0028139168128067343, "phrase": "fair_cost-sharing_and_party_affiliation_games"}, {"score": 0.0026394405584281443, "phrase": "central_agency"}, {"score": 0.0025291601927956765, "phrase": "public_service_advertising_campaign"}, {"score": 0.002475755804232436, "phrase": "\"_behavior"}, {"score": 0.002444254652283002, "phrase": "good_state"}, {"score": 0.0022442249871042026, "phrase": "additional_input"}, {"score": 0.0021412594173592513, "phrase": "additional_information"}, {"score": 0.0021049977753042253, "phrase": "natural_dynamics"}], "paper_keywords": ["game theory", " dynamics in games", " potential games", " quality of equilibria"], "paper_abstract": "Many natural games have a dramatic difference between the quality of their best and worst Nash equilibria, even in pure strategies. Yet, nearly all results to date on dynamics in games show only convergence to some equilibrium, especially within a polynomial number of steps. In this work we initiate a theory of how well-motivated multiagent dynamics can make use of global information about the game-which might be common knowledge or injected into the system by a helpful central agency-and show that in a wide range of interesting games this can allow the dynamics to quickly reach (within a polynomial number of steps) states of cost comparable to the best Nash equilibrium. We present several natural models for dynamics that can use such additional information and analyze their ability to reach low-cost states for two important and widely studied classes of potential games: network design with fair cost-sharing and party affiliation games (which include consensus and cut games). From the perspective of a central agency, our work can be viewed as analyzing how a public service advertising campaign can help \"nudge\" behavior into a good state, when players cannot be expected to all blindly follow along but instead view the information as an additional input into their dynamics. We show that in many cases, this additional information is sufficient for natural dynamics to quickly reach states of cost comparable to the best Nash equilibrium of the game.", "paper_title": "CIRCUMVENTING THE PRICE OF ANARCHY: LEADING DYNAMICS TO GOOD BEHAVIOR", "paper_id": "WOS:000315579100010"}