{"auto_keywords": [{"score": 0.04085830846571713, "phrase": "analytical_analysis"}, {"score": 0.015719716506582538, "phrase": "cache-based_memory_copy_hardware_accelerator"}, {"score": 0.011921195444036414, "phrase": "multicore_system"}, {"score": 0.010848750246578352, "phrase": "full-system_simulator"}, {"score": 0.004761494044422926, "phrase": "multicore_systems"}, {"score": 0.004528156929805637, "phrase": "new_architecture"}, {"score": 0.00409508755819924, "phrase": "memory_data_movements"}, {"score": 0.00400459716272594, "phrase": "memory_copies"}, {"score": 0.003829548069657859, "phrase": "open-queuing_theory"}, {"score": 0.0033864888703414903, "phrase": "necessary_information"}, {"score": 0.0028959529647849354, "phrase": "stream"}, {"score": 0.002354302193867031, "phrase": "higher_cache"}, {"score": 0.0022013916728990564, "phrase": "average_number"}], "paper_keywords": ["Hardware accelerator", " cache", " multicore", " TCP/IP", " open-queuing theory"], "paper_abstract": "In this paper, we present a new architecture of the cache-based memory copy hardware accelerator in a multicore system supporting message passing. The accelerator is able to accelerate memory data movements, in particular memory copies. We perform an analytical analysis based on open-queuing theory to study the utilization of our accelerator in a multicore system. In order to correctly model the system, we gather the necessary information by utilizing a full-system simulator. We present both the simulation results and the analytical analysis. We demonstrate the advantages of our solution based on a full-system simulator utilizing several applications: the STREAM benchmark and the receiver-side of the TCP/IP stack. Our accelerator provides speedups from 2.96 to 4.61 for the receiver-side of the TCP/IP stack, reduces the number of instructions from 26 percent to 44 percent and achieves a higher cache hit rate. Utilizing the analytical analysis, our accelerator reduces in the average number of cycles executed per instruction up to 50 percent for one of the CPUs in the multicore system.", "paper_title": "Cache-Based Memory Copy Hardware Accelerator for Multicore Systems", "paper_id": "WOS:000282091200005"}