{"auto_keywords": [{"score": 0.037519512308061685, "phrase": "delta"}, {"score": 0.00481495049065317, "phrase": "simple_shear_flow"}, {"score": 0.004780633011300165, "phrase": "finite_reynolds_numbers"}, {"score": 0.004482526999029664, "phrase": "shear_flow"}, {"score": 0.004371660146981191, "phrase": "viscosity_ratios"}, {"score": 0.004294145092032327, "phrase": "different_geometries"}, {"score": 0.004248294537944227, "phrase": "full_navier-stokes_equations"}, {"score": 0.0041136473765874815, "phrase": "experimental_data"}, {"score": 0.004084307764140389, "phrase": "different_cases"}, {"score": 0.003815770872944475, "phrase": "drop_centres"}, {"score": 0.003775008774288817, "phrase": "velocity_gradient_direction"}, {"score": 0.003464150192089816, "phrase": "new_steady-state_value"}, {"score": 0.003111211706454155, "phrase": "low_initial_offset"}, {"score": 0.0030124946762144717, "phrase": "maximum_deformation"}, {"score": 0.0029590077170443666, "phrase": "equal_drop_sizes"}, {"score": 0.0028142286985235977, "phrase": "initial_offset_increases"}, {"score": 0.0025638362414466278, "phrase": "approaching_stage"}, {"score": 0.002509284173541882, "phrase": "different_initial_offsets"}, {"score": 0.0021049977753042253, "phrase": "increased_lambda"}], "paper_keywords": ["Two-phase flow", " Front tracking", " Reynolds number", " Weber number", " Capillary number", " Offset", " Drainage time"], "paper_abstract": "The collision of two equal-size drops in an immiscible phase undergoing a shear flow is simulated over a range of viscosity ratios (lambda) and different geometries. The full Navier-Stokes equations are solved by a finite difference/front tracking method. Based on experimental data, different cases were simulated by changing the offset, size of drops, and viscosity ratio. The distance between drop centres along the velocity gradient direction (z) was measured as a function of time. It was found that Delta z increases after collision and reaches a new steady-state value after separation. The values of Delta z, during the interaction, increases with increasing initial offset. Our results show that the time of approaching of drops at low initial offset is greater than the other cases, but the maximum deformation is the same for equal drop sizes. The deformation decreases with decreasing the size of drops. As the initial offset increases, the drops rotate more quickly and the available contact time for film drainage decreases. We found that the trajectories of drops in the approaching stage are different owing to the different initial offsets. However, after the drops come into contact, it observed that they follow the same trajectories. As lambda increases, the drops rotate more slowly, and the point at which the drops separate is delayed. The trajectories of drops become more symmetric with the increased lambda. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Binary collision of drops in simple shear flow at finite Reynolds numbers: Geometry and viscosity ratio effects", "paper_id": "WOS:000292951300008"}