{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "demonstrative_pronouns"}, {"score": 0.015385313167193859, "phrase": "hindi"}, {"score": 0.008619924064770678, "phrase": "indirect_anaphora"}, {"score": 0.004437910956996051, "phrase": "probabilistic_neural_networks"}, {"score": 0.004295459433506106, "phrase": "classification_scheme"}, {"score": 0.004157561334726201, "phrase": "hindi_corpus"}, {"score": 0.003167217223469026, "phrase": "linguistic_patterns"}, {"score": 0.0030157628075954588, "phrase": "semantic_inference_process"}, {"score": 0.0028249975318149468, "phrase": "syntactic_category"}, {"score": 0.0027943943921568456, "phrase": "semantic_cues"}, {"score": 0.002675252546913683, "phrase": "noun_phrase_antecedent"}, {"score": 0.002631892325004253, "phrase": "written_corpus"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Anaphora", " Semantic", " Neural network"], "paper_abstract": "In this paper, we propose the application of probabilistic neural networks (PNNs) to the classification scheme of demonstrative pronouns for indirect anaphora in Hindi corpus. The Demonstrative Pronouns in Hindi, \"yeh\"(this/it), \"veh\"(that/those), \"iss\"(this/it), and \"uss\"(that/those) can be personal or demonstrative. The differentiation can be ascertained from only the situation or the context. The case marking of pronouns further add the constraints on linguistic patterns. We propose to cast such an anaphora as a semantic inference process, which encompasses several salient linguistic characteristic features such as grammatical role, proximity, syntactic category and semantic cues. Our focus of study is demonstrative pronouns without noun phrase antecedent in Hindi written corpus. We analyzed 313 news items having 3890 sentences, 3101 pronouns, of which 608 instances covered those demonstrative pronouns, which had 183 instances with non-NP-antecedents. The effectiveness of the approach is demonstrated through set of simulations and evaluations. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Probabilistic neural network approach to the classification of demonstrative pronouns for indirect anaphora in Hindi", "paper_id": "WOS:000278376100009"}