{"auto_keywords": [{"score": 0.04167518006179969, "phrase": "pp"}, {"score": 0.01722673980756471, "phrase": "pp's_effectiveness"}, {"score": 0.01040283494162814, "phrase": "systematic_literature_review"}, {"score": 0.00949493629937825, "phrase": "pedagogical_tool"}, {"score": 0.004776669953449352, "phrase": "higher_education"}, {"score": 0.004517055580214742, "phrase": "current_evidence"}, {"score": 0.0044101380740283825, "phrase": "pair_programming"}, {"score": 0.004104269996872886, "phrase": "empirical_studies"}, {"score": 0.003758981686762617, "phrase": "seventy-four_papers"}, {"score": 0.0034152340901585374, "phrase": "students'_skill_level"}, {"score": 0.0030904433394138963, "phrase": "students'_satisfaction"}, {"score": 0.0028529310661977577, "phrase": "students'_grades"}, {"score": 0.002623111480310373, "phrase": "test_cases"}, {"score": 0.0025918235228843444, "phrase": "academic_performance"}, {"score": 0.002560907803820395, "phrase": "expert_opinion"}, {"score": 0.002530359917257626, "phrase": "quality_measures"}, {"score": 0.00240213106042981, "phrase": "research_field"}, {"score": 0.0023079225317714815, "phrase": "pair_compatibility_factors"}, {"score": 0.0021049977753042253, "phrase": "programming_tasks"}], "paper_keywords": ["Empirical studies", " pair programming", " systematic review"], "paper_abstract": "The objective of this paper is to present the current evidence relative to the effectiveness of pair programming (PP) as a pedagogical tool in higher education CS/SE courses. We performed a systematic literature review (SLR) of empirical studies that investigated factors affecting the effectiveness of PP for CS/SE students and studies that measured the effectiveness of PP for CS/SE students. Seventy-four papers were used in our synthesis of evidence, and 14 compatibility factors that can potentially affect PP's effectiveness as a pedagogical tool were identified. Results showed that students' skill level was the factor that affected PP's effectiveness the most. The most common measure used to gauge PP's effectiveness was time spent on programming. In addition, students' satisfaction when using PP was overall higher than when working solo. Our meta-analyses showed that PP was effective in improving students' grades on assignments. Finally, in the studies that used quality as a measure of effectiveness, the number of test cases succeeded, academic performance, and expert opinion were the quality measures mostly applied. The results of this SLR show two clear gaps in this research field: 1) a lack of studies focusing on pair compatibility factors aimed at making PP an effective pedagogical tool and 2) a lack of studies investigating PP for software design/modeling tasks in conjunction with programming tasks.", "paper_title": "Empirical Studies of Pair Programming for CS/SE Teaching in Higher Education: A Systematic Literature Review", "paper_id": "WOS:000293456000004"}