{"auto_keywords": [{"score": 0.04875424985601543, "phrase": "virtual_humans"}, {"score": 0.04538347249829899, "phrase": "emotional_bias"}, {"score": 0.014110364056376676, "phrase": "gender_perception"}, {"score": 0.00481495049065317, "phrase": "motion_type"}, {"score": 0.004426180319550746, "phrase": "different_emotional_conditions"}, {"score": 0.004119762981892093, "phrase": "motion_types"}, {"score": 0.004081385289516914, "phrase": "different_levels"}, {"score": 0.004055998173160551, "phrase": "physiological_cues"}, {"score": 0.0034484095283984443, "phrase": "captured_facial_and_body_motions"}, {"score": 0.0033633514001658086, "phrase": "basic_emotions"}, {"score": 0.0031205207286957013, "phrase": "male_and_female_motions"}, {"score": 0.0030817834479425535, "phrase": "different_sex"}, {"score": 0.0030057412068719646, "phrase": "gender_judgments"}, {"score": 0.0027799596509593166, "phrase": "different_emotional_states"}, {"score": 0.002595307614796063, "phrase": "gender_ratings"}, {"score": 0.002555077462660864, "phrase": "displayed_emotion"}, {"score": 0.002468747242613056, "phrase": "gender_stereotypes"}, {"score": 0.0024457118327295456, "phrase": "greater_extent"}, {"score": 0.002212951892867028, "phrase": "male_actors"}, {"score": 0.002171836484200008, "phrase": "slight_effect"}, {"score": 0.0021181992520858057, "phrase": "different_types"}, {"score": 0.0021049977753042253, "phrase": "virtual_models"}], "paper_keywords": ["Experimentation", " Human Factors", " Facial animation", " emotions", " gender"], "paper_abstract": "In this article, we investigate the perception of gender from the motion of virtual humans under different emotional conditions and explore the effect of emotional bias on gender perception (e.g., anger being attributed to males more than females). As motion types can present different levels of physiological cues, we also explore how two types of motion (walking and conversations) are affected by emotional bias. Walking typically displays more physiological cues about gender (e.g., hip sway) and therefore is expected to be less affected by emotional bias. To investigate these effects, we used a corpus of captured facial and body motions from four male and four female actors, performing basic emotions through conversation and walk. We expected that the appearance of the model would also influence gender perception; therefore, we displayed both male and female motions on two virtual models of different sex. Two experiments were then conducted to assess gender judgments from these motions. In both experiments, participants were asked to rate how male or female they considered the motions to be under different emotional states, then classified the emotions to determine how accurately they were portrayed by actors. Overall, both experiments showed that gender ratings were affected by the displayed emotion. However, we found that conversations were influenced by gender stereotypes to a greater extent than walking motions. This was particularly true for anger, which was perceived as male on both male and female motions, and sadness, which was perceived as less male when portrayed by male actors. We also found a slight effect of the model when observing gender on different types of virtual models. These results have implications for the design and animation of virtual humans.", "paper_title": "Exploring the Effect of Motion Type and Emotions on the Perception of Gender in Virtual Humans", "paper_id": "WOS:000360006600005"}