{"auto_keywords": [{"score": 0.04932930879059259, "phrase": "fuzzy_random_variable"}, {"score": 0.015719716506582538, "phrase": "fuzzy_random_variables"}, {"score": 0.006773795539453168, "phrase": "classical_probability_measure"}, {"score": 0.0046164478775379105, "phrase": "imprecise_observation"}, {"score": 0.004472935829694716, "phrase": "random_experiment"}, {"score": 0.004068510313497539, "phrase": "imprecise_probabilities_theory"}, {"score": 0.003819339842998955, "phrase": "classical_measurable_functions"}, {"score": 0.003623352647973122, "phrase": "higher_order_possibility_model"}, {"score": 0.0035477930970463432, "phrase": "imprecise_information"}, {"score": 0.0033656930865509547, "phrase": "previous_classical_models"}, {"score": 0.0031761255583359726, "phrase": "acceptability_function"}, {"score": 0.002858313353461727, "phrase": "natural_way"}, {"score": 0.0024529757621396717, "phrase": "fuzzy_probability_envelope"}, {"score": 0.002219040041886641, "phrase": "relevant_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["imprecise probabilities", " second order possibility measure", " random set", " fuzzy random variable"], "paper_abstract": "A fuzzy random variable is viewed as the imprecise observation of the outcomes in a random experiment. Since randomness and vagueness coexist in the same framework, it seems reasonable to integrate fuzzy random variables into imprecise probabilities theory. Nevertheless, fuzzy random variables are commonly presented in the literature as classical measurable functions associated to a classical probability measure. We present here a higher order possibility model that represents the imprecise information provided by a fuzzy random variable. We compare it with previous classical models in the literature. First, some aspects about the acceptability function associated to a fuzzy random variable are investigated. Secondly, we present three different higher order possibility models, all of them arising in a natural way. We investigate their similarities and differences, and observe that the first one (the fuzzy probability envelope) is the most informative. Finally we compare the fuzzy probability envelope with the (classical) probability measure induced by the fuzzy random variable. We conclude that the classical probability measure does not always contain all relevant information provided by a fuzzy random variable. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Higher order models for fuzzy random variables", "paper_id": "WOS:000251918900001"}