{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "html"}, {"score": 0.004459334186889869, "phrase": "data_modeling"}, {"score": 0.004406994912939125, "phrase": "ir_functionalities"}, {"score": 0.004081385289516914, "phrase": "industrial_and_academic_researchers"}, {"score": 0.0036481158025940016, "phrase": "derived_expressiveness"}, {"score": 0.003584025547693836, "phrase": "file_sharing_primitives"}, {"score": 0.003541923233726252, "phrase": "lookup_mechanisms"}, {"score": 0.0031845067058084583, "phrase": "overall_data_domain"}, {"score": 0.002914288956035066, "phrase": "ir_methodologies"}, {"score": 0.0025137856138000014, "phrase": "representation_and_extraction_models"}, {"score": 0.002155412043665635, "phrase": "data_format"}], "paper_keywords": [""], "paper_abstract": "Knowledge representation and extraction techniques can be efficiently used to improve data modeling and IR functionalities of P2P Information Systems, which have recently attracted a lot of attention from industrial and academic researchers. These functionalities can be achieved by pushing semantics in both data and queries, and exploiting the derived expressiveness to improve file sharing primitives and lookup mechanisms made available from first-generation P2P systems. XXIL-based P2P Information Systems are a more specific and interesting instance of this class of systems, where the overall data domain is composed by very large, Intemet-like distributed XML repositories from which users extract useful knowledge manly by means of IR methodologies implemented on the top of XML join queries. This paper focuses on several aspects of XML-based P2P Information Systems, raging from foundations and definitions to knowledge representation and extraction models and algorithms, along with their experimental evaluation. However, the results presented in this paper can also be adapted to deal with any kind of data format (e.g., HTML).", "paper_title": "On semantically-augmented XML-based P2P information systems", "paper_id": "WOS:000238575000037"}