{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "missing_attribute_values"}, {"score": 0.004171402455813099, "phrase": "\"do_not_care\"_conditions"}, {"score": 0.003296212583539166, "phrase": "lost_values"}, {"score": 0.00290473242917264, "phrase": "attribute_value"}, {"score": 0.002758273619951683, "phrase": "entire_paper"}, {"score": 0.0026041635822373265, "phrase": "attribute-value_pairs"}, {"score": 0.002530359917257626, "phrase": "incomplete_data"}, {"score": 0.002472822097373027, "phrase": "characteristic_relations"}, {"score": 0.002321234686549485, "phrase": "lower_and_upper_approximations"}, {"score": 0.0021539955106204354, "phrase": "different_interpretations"}, {"score": 0.0021049977753042253, "phrase": "different_approximation_definitions"}], "paper_keywords": ["incomplete data sets", " lost values", " \"do not care\" conditions", " attribute-concept values", " blocks of attribute-value pairs", " characteristic sets", " characteristic relations"], "paper_abstract": "In this paper we discuss four kinds of missing attribute values: lost values (the values that were recorded but currently are unavailable), \"do not care\" conditions (the original values were irrelevant), restricted \"do not care\" conditions (similar to ordinary \"do not care\" conditions but interpreted differently, these missing attribute values may occur when in the same data set there are lost values and \"do not care\" conditions), and attribute-concept values (these missing attribute values may be replaced by any attribute value limited to the same concept). Through the entire paper the same calculus, based on computations of blocks of attribute-value pairs, is used. Incomplete data are characterized by characteristic relations, which in general are neither symmetric nor transitive. Lower and upper approximations are generalized for data with missing attribute values. Finally, some experiments on different interpretations of missing attribute values and different approximation definitions are cited.", "paper_title": "A rough set approach to data with missing attribute values", "paper_id": "WOS:000239623500010"}