{"auto_keywords": [{"score": 0.04727252346167318, "phrase": "godfrey"}, {"score": 0.00481495049065317, "phrase": "related_random_choices"}, {"score": 0.0047273577269638725, "phrase": "classical_balls"}, {"score": 0.004690305164360866, "phrase": "-bins_games"}, {"score": 0.004556901872357751, "phrase": "godfrey's_model"}, {"score": 0.00433531459712787, "phrase": "beta-balanced_set"}, {"score": 0.0041136473765874815, "phrase": "logarithmic_number"}, {"score": 0.0039965797272907095, "phrase": "uniform-like_selection"}, {"score": 0.003903269701018361, "phrase": "parameter_beta"}, {"score": 0.00348655247465418, "phrase": "bins_b-i"}, {"score": 0.0033255627814855163, "phrase": "empty_bins"}, {"score": 0.0029238768315330305, "phrase": "maximum_load"}, {"score": 0.0028857130140890787, "phrase": "main_goal"}, {"score": 0.00281826552772148, "phrase": "maximum_number"}, {"score": 0.0027164585428301837, "phrase": "high_probability"}, {"score": 0.0026529564991826966, "phrase": "godfrey's_result"}, {"score": 0.0022837769780376846, "phrase": "previous_ball's_choice"}, {"score": 0.002183938718432764, "phrase": "remaining_probability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Stochastic processes", " Load balancing", " Balls into bins", " Peer-to-peer"], "paper_abstract": "We consider a variation of classical balls-into-bins games. We randomly allocate m balls into n bins. Following Godfrey's model (Godfrey, 2008) [7], we assume that each ball i comes with a beta-balanced set of clusters B-i = {B-1, ..., B-si}, each containing a logarithmic number of balls. The condition of beta-balancedness essentially enforces a uniform-like selection of bins for the clusters, where the parameter beta >= 1 governs the deviation from uniformity. Each ball i = 1, ..., m, in turn, runs the following protocol: (i) it i.u.r. (independently and uniformly at random) chooses a cluster of bins B-i is an element of B-i, and (ii) it i.u.r. chooses one of the empty bins in B-i and allocates itself to it. Should the cluster not contain at least a single empty bin, then the protocol fails. If the protocol terminates successfully, that is, every ball has indeed been able to find at least one empty bin in its chosen cluster, then this will obviously result in a maximum load of one. The main goal is to find a tight bound on the maximum number of balls, in, so that the protocol terminates successfully with a high probability. In this paper, we improve on Godfrey's result and show that m = n/Theta(beta). We use a more relaxed notion of balancedness than (Godfrey, 2008) [7] and show that our upper bounds hold for this type of balancedness. It even holds when we generalise the model and allow runs where each ball i tosses a coin and it copies the previous ball's choice Bi-1 with constant probability p(i) (0 < p(i) <= 1). With the remaining probability the ball uses the protocol as described above. (C) 2011 Elsevier Inc. All rights reserved,", "paper_title": "Balls into bins with related random choices", "paper_id": "WOS:000299139000013"}