{"auto_keywords": [{"score": 0.04407253113473033, "phrase": "smc"}, {"score": 0.004597622380240611, "phrase": "nonlinear_systems"}, {"score": 0.003724810609448597, "phrase": "sliding_surface"}, {"score": 0.0035201528214608914, "phrase": "asymptotic_stability"}, {"score": 0.0034663083890589235, "phrase": "closed-loop_system"}, {"score": 0.003413284742632989, "phrase": "lyapunov_stability_method"}, {"score": 0.0030957429853133147, "phrase": "design_procedure"}, {"score": 0.002940626369102927, "phrase": "typical_second_order_linear_interval_system"}, {"score": 0.0027646829399573434, "phrase": "pole_characteristics"}, {"score": 0.00250732953434891, "phrase": "proposed_method"}, {"score": 0.002468938912850425, "phrase": "simulation_results"}, {"score": 0.0023816257768353344, "phrase": "best_tracking_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["interval type-2 fuzzy logic control", " Interval type-2 fuzzy sliding-mode control", " Lyapunov function", " sliding mode", " type-2 fuzzy set"], "paper_abstract": "In this paper, an interval type-2 fuzzy sliding-mode controller (IT2FSMC) is proposed for linear and nonlinear systems. The proposed IT2FSMC is a combination of the interval type-2 fuzzy logic control (IT2FLC) and the sliding-mode control (SMC) which inherits the benefits of these two methods. The objective of the controller is to allow the system to move to the sliding surface and remain in on it so as to ensure the asymptotic stability of the closed-loop system. The Lyapunov stability method is adopted to verify the stability of the interval type-2 fuzzy sliding-mode controller system. The design procedure of the IT2FSMC is explored in detail. A typical second order linear interval system with 50% parameter variations, an inverted pendulum with variation of pole characteristics, and a Duffing forced oscillation with uncertainty and disturbance are adopted to illustrate the validity of the proposed method. The simulation results show that the IT2FSMC achieves the best tracking performance in comparison with the type-1 Fuzzy logic controller (T1FLC), the IT2FLC, and the type-1 fuzzy sliding-mode controller (T1FSMC). (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Design of interval type-2 fuzzy sliding-mode controller", "paper_id": "WOS:000253660400018"}