{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_followers"}, {"score": 0.03218534538955472, "phrase": "optimal_solution"}, {"score": 0.014479940433458955, "phrase": "decision_entities"}, {"score": 0.012723763620146692, "phrase": "uncooperative_situation"}, {"score": 0.0046467264207419425, "phrase": "tri"}, {"score": 0.004361792415184563, "phrase": "three-level_hierarchy"}, {"score": 0.003650488388949457, "phrase": "decision_results"}, {"score": 0.0029830992938695007, "phrase": "three-level_vertical_structure"}, {"score": 0.00294793168341202, "phrase": "nash"}, {"score": 0.0027668603377225564, "phrase": "general_linear_mftl_decision_model"}, {"score": 0.002669959049383929, "phrase": "mftl_kth-best_algorithm"}, {"score": 0.0025259082947443343, "phrase": "compromised_result"}, {"score": 0.0023334673218688437, "phrase": "fuzzy_programming_approach"}, {"score": 0.0022250978492127163, "phrase": "real-world_case_study"}, {"score": 0.002207530926563892, "phrase": "production-inventory_planning"}, {"score": 0.002155656133617155, "phrase": "proposed_mftl_decision_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Tri-level decision-making", " Multilevel programming", " Kth-Best algorithm", " Fuzzy programming", " Production-inventory planning"], "paper_abstract": "Tri-level decision-making arises to address compromises among interacting decision entities distributed throughout a three-level hierarchy; these entities are respectively termed the top-level leader, the middle-level follower and the bottom-level follower. This study considers an uncooperative situation where multiple followers at the same (middle or bottom) level make their individual decisions independently but consider the decision results of their counterparts as references through information exchanged among themselves. This situation is called a reference-based uncooperative multi-follower tri-level (MFTL) decision problem which appears in many real-world applications. To solve this problem, we need to find an optimal solution achieving both the Stackelberg equilibrium in the three-level vertical structure and the Nash equilibrium among multiple followers at the same horizontal level. In this paper, we first propose a general linear MFTL decision model for this situation. We then develop a MFTL Kth-Best algorithm to find an optimal solution to the model. Since the optimal solution means a compromised result in the uncooperative situation and it is often imprecise or ambiguous for decision entities to identify their related satisfaction, we use a fuzzy programming approach to characterize and evaluate the solution obtained. Lastly, a real-world case study on production-inventory planning illustrates the effectiveness of the proposed MFTL decision techniques. (c) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Tri-level decision-making with multiple followers: Model, algorithm and case study", "paper_id": "WOS:000354504900011"}