{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "main_features"}, {"score": 0.004314127287770832, "phrase": "well-known_impact_factor"}, {"score": 0.003610929883213109, "phrase": "recent_studies"}, {"score": 0.003554661425339528, "phrase": "bibliometric_literature"}, {"score": 0.003480993634130542, "phrase": "scientific_impact"}, {"score": 0.003102195256794215, "phrase": "single_indicator"}, {"score": 0.0027645030021576926, "phrase": "complementary_features"}, {"score": 0.0027071661844502992, "phrase": "journal_quality"}, {"score": 0.002450602177683066, "phrase": "scholarly_publications"}, {"score": 0.0022772115643656153, "phrase": "metric_manipulation"}, {"score": 0.0022299587520401747, "phrase": "unintended_result"}, {"score": 0.002127186380459509, "phrase": "gold_standard"}, {"score": 0.0021049977753042253, "phrase": "publication_quality"}], "paper_keywords": ["Bibliometrics", " impact factor", " journal ranking", " Eigenfactor", " popularity indicators", " prestige indicators", " research evaluation"], "paper_abstract": "This paper provides an overview of the main features of several bibliometric indicators which were proposed in the last few decades. Their pros and cons are highlighted and compared with the features of the well-known impact factor (IF) to show how alternative metrics are specifically designed to address the flaws that the IF was shown to have, especially in the last few years. We also report the results of recent studies in the bibliometric literature showing how the scientific impact of journals as evaluated by bibliometrics is a very complicated matter and it is completely unrealistic to try to capture it by any single indicator, such as the IF or any other. As such, we conclude that the adoption of more metrics, with complementary features, to assess journal quality would be very beneficial as it would both offer a more comprehensive and balanced view of each journal in the space of scholarly publications, as well as eliminate the pressure on individuals and their incentive to do metric manipulation which is an unintended result of the current (mis)use of the IF as the gold standard for publication quality.", "paper_title": "Bibliometric Indicators: Why Do We Need More Than One?", "paper_id": "WOS:000209652700017"}