{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "library_associations"}, {"score": 0.008548583873776999, "phrase": "social_media"}, {"score": 0.0038674532861321864, "phrase": "library_associations'_web_sites"}, {"score": 0.003265175268104804, "phrase": "american_continents_library_associations"}, {"score": 0.0030701668257221144, "phrase": "asian_continent_library_associations"}, {"score": 0.002853651216601807, "phrase": "facebook"}, {"score": 0.0028317947898649307, "phrase": "twitter"}, {"score": 0.002810019588710478, "phrase": "rss"}, {"score": 0.002777743542308786, "phrase": "linkedin"}, {"score": 0.002756439316478466, "phrase": "flickr"}, {"score": 0.002735296307507458, "phrase": "blogs"}, {"score": 0.002522791642460087, "phrase": "libraries_associations"}, {"score": 0.002474674704809152, "phrase": "future_research"}, {"score": 0.0023357478549318102, "phrase": "particular_country"}, {"score": 0.0021049977753042253, "phrase": "new_technology"}], "paper_keywords": ["Internet", " World Wide Web", " Social media", " Web 2.0", " Library associations"], "paper_abstract": "Purpose - The purpose of this paper is to discuss the adoption of Web 2.0 in library associations in the presence of social media. This paper attempts to measure the penetration of Web 2.0 tools in various library associations all over the world. Design/methodology/approach - The study was conducted through an assessment of the library associations' web sites. A total of 188 library associations' web sites were analysed, out of which 115 library associations have implemented Web 2.0 applications; this is 61.17 percent of the total. Findings - On the basis of the analysis it was found that the majority of Web 2.0 tools have been used by American continents library associations. This stands at, 89.86 percent, whereas only a small number of Web 2.0 tools have been used by Asian continent library associations, that is, 25.64 percent. The most of Web 2.0 tools used by library associations, is, Facebook, Twitter, RSS feeds, LinkedIn, Flickr and Blogs. Research limitations/implications - The findings of this study can be utilized to assess the status of assorted Web 2.0 tools used in libraries associations. It may enable future research to investigate other aspects, such as the adoption of Web 2.0 tools in library associations of a particular country as well as continent. Originality/value - The paper begins with an introduction to Web 2.0 technology and attempts has been made to analyse the usage of this new technology in library associations worldwide.", "paper_title": "Adoption of Web 2.0 in library associations in the presence of social media", "paper_id": "WOS:000353321400003"}