{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "active_collaborative_learning"}, {"score": 0.014184707443615914, "phrase": "learning_process"}, {"score": 0.013019150526315023, "phrase": "student_learning_performance"}, {"score": 0.00415625929636759, "phrase": "thorough_understanding"}, {"score": 0.004102639724186862, "phrase": "underlying_mechanisms"}, {"score": 0.004049709080817396, "phrase": "advanced_technologies"}, {"score": 0.003465189575252443, "phrase": "conceptual_framework"}, {"score": 0.0032331613500559764, "phrase": "positive_effects"}, {"score": 0.0031365819432206004, "phrase": "student_learning"}, {"score": 0.002990592465417758, "phrase": "university_class"}, {"score": 0.0028390477456009568, "phrase": "social_sciences_degree"}, {"score": 0.0027781870000242004, "phrase": "strong_support"}, {"score": 0.0026835045963349647, "phrase": "high_level"}, {"score": 0.0022464835515931592, "phrase": "student_learning_experience"}, {"score": 0.0021982976170703884, "phrase": "educational_settings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Clickers", " Learning performance", " Engagement", " Collaborative learning", " Interactivity"], "paper_abstract": "As more and more educational institutions are integrating new technologies (e.g. audience response systems) into their learning systems to support the learning process, it is becoming increasingly necessary to have a thorough understanding of the underlying mechanisms of these advanced technologies and their consequences on student learning performance. In this study, our primary objective is to investigate the effect of clickers (i.e. audience response systems) on student learning performance. To do so, we develop a conceptual framework in which we propose that interactivity, active collaborative learning and engagement are three key underlying forces that explain the positive effects and benefits of clickers in enhancing student learning, performance. We test these relationships empirically in a university class setting using data from a survey answered by students in a social sciences degree. The results provide strong support for our proposed framework and they reveal that the high level of interactivity with peers and with the teacher that is promoted by the use of clickers positively influences active collaborative learning and engagement, which, in turn, improves student learning performance. These results show the importance of clickers in improving the student learning experience and recommend their use in educational settings to support the learning process. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Using clickers in class. The role of interactivity, active collaborative learning and engagement in learning performance", "paper_id": "WOS:000316523100011"}