{"auto_keywords": [{"score": 0.046812928375307615, "phrase": "polynomial_optimization_problems"}, {"score": 0.03951288245948403, "phrase": "cartesian_product"}, {"score": 0.00481495049065317, "phrase": "deterministic_approximation_algorithms"}, {"score": 0.004718897469501381, "phrase": "homogeneous_polynomial_optimization_problems"}, {"score": 0.004578382275810468, "phrase": "numerous_applications"}, {"score": 0.004016072233242585, "phrase": "homogeneous_polynomial"}, {"score": 0.0038186039088445524, "phrase": "multilinear_form"}, {"score": 0.003576286811853861, "phrase": "multiquadratic_form"}, {"score": 0.0032658649336454923, "phrase": "polynomial-time_approximation_algorithms"}, {"score": 0.0024247382451294255, "phrase": "currently_best_known_approximation"}, {"score": 0.0021479597698614373, "phrase": "approximation_algorithms"}, {"score": 0.0021049977753042253, "phrase": "provable_guarantees"}], "paper_keywords": ["Polynomial optimization", " Approximation algorithms", " Diameters of convex bodies", " Convex programming"], "paper_abstract": "Due to their fundamental nature and numerous applications, sphere constrained polynomial optimization problems have received a lot of attention lately. In this paper, we consider three such problems: (i) maximizing a homogeneous polynomial over the sphere; (ii) maximizing a multilinear form over a Cartesian product of spheres; and (iii) maximizing a multiquadratic form over a Cartesian product of spheres. Since these problems are generally intractable, our focus is on designing polynomial-time approximation algorithms for them. By reducing the above problems to that of determining the L(2)-diameters of certain convex bodies, we show that they can all be approximated to within a factor of Omega ((log n/n)(d/2-1)) deterministically, where n is the number of variables and d is the degree of the polynomial. This improves upon the currently best known approximation bound of Omega ((1/n)(d/2-1)) in the literature. We believe that our approach will find further applications in the design of approximation algorithms for polynomial optimization problems with provable guarantees.", "paper_title": "Deterministic approximation algorithms for sphere constrained homogeneous polynomial optimization problems", "paper_id": "WOS:000295785000009"}