{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "transposition_distance"}, {"score": 0.0044800522651664695, "phrase": "adjacent_interval_exchanges"}, {"score": 0.004261885692956071, "phrase": "shortest_possible_length"}, {"score": 0.0038782499819752423, "phrase": "apparently_intuitive_nature"}, {"score": 0.0036892826130957195, "phrase": "bafna"}, {"score": 0.003648553571147862, "phrase": "pevzner"}, {"score": 0.003490056936165004, "phrase": "optimal_sequence"}, {"score": 0.0028895324165046166, "phrase": "linear_time"}, {"score": 0.0027486060614330043, "phrase": "graph_structure"}, {"score": 0.002473203873496859, "phrase": "new_tight_upper_bound"}, {"score": 0.0023525345110929326, "phrase": "improved_bounds"}, {"score": 0.0022007302738063566, "phrase": "exact_distance"}, {"score": 0.0021049977753042253, "phrase": "polynomial_time"}], "paper_keywords": ["genome rearrangements", " permutations", " sorting by transpositions"], "paper_abstract": "The problem of sorting by transpositions asks for a sequence of adjacent interval exchanges that sorts a permutation and is of the shortest possible length. The distance of the permutation is defined as the length of such a sequence. Despite the apparently intuitive nature of this problem, introduced in 1995 by Bafna and Pevzner, the complexity of both finding an optimal sequence and computing the distance remains open today. In this paper, we establish connections between two different graph representations of permutations, which allows us to compute the distance of a few nontrivial classes of permutations in linear time and space, bypassing the use of any graph structure. By showing that every permutation can be obtained from one of these classes, we prove a new tight upper bound on the transposition distance. Finally, we give improved bounds on some other families of permutations and prove formulas for computing the exact distance of other classes of permutations, again in polynomial time.", "paper_title": "New bounds and tractable instances for the transposition distance", "paper_id": "WOS:000241720700007"}