{"auto_keywords": [{"score": 0.04359848301759339, "phrase": "information_overload"}, {"score": 0.010220360418366901, "phrase": "knowledge_map"}, {"score": 0.009510670276450313, "phrase": "important_knowledge"}, {"score": 0.006756931287372809, "phrase": "browsing_process"}, {"score": 0.005983059617503583, "phrase": "domain_knowledge"}, {"score": 0.0059377288222714035, "phrase": "new_knowledge_users"}, {"score": 0.005608456699924283, "phrase": "social_network_analysis"}, {"score": 0.005481890005738807, "phrase": "knowledge_users"}, {"score": 0.00481495049065317, "phrase": "map-based_method"}, {"score": 0.004688321299229397, "phrase": "exponential_growth"}, {"score": 0.004652754203582873, "phrase": "available_information"}, {"score": 0.004565007074039171, "phrase": "knowledge_management_systems"}, {"score": 0.004530371221172796, "phrase": "excessive_information"}, {"score": 0.004478907336898875, "phrase": "end_users"}, {"score": 0.004230188765513944, "phrase": "increased_emphasis"}, {"score": 0.0039049226745413224, "phrase": "information_overload_problem"}, {"score": 0.0038605361756636667, "phrase": "searching_process"}, {"score": 0.00293380698353469, "phrase": "text_mining"}, {"score": 0.0026976391682197133, "phrase": "knowledge_user"}, {"score": 0.0022894012453842064, "phrase": "highly_acceptable_level"}, {"score": 0.002263336340041527, "phrase": "constructed_knowledge_map"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Information overload", " Knowledge browsing", " Knowledge map", " Social network analysis"], "paper_abstract": "The exponential growth of available information and the deployment of knowledge management systems delivers excessive information to the end users that they cannot manage at once. This problem has led to an increased emphasis on solutions to information overload. Searching and browsing are two methods to locate information. Many studies have focused on solving the information overload problem in the searching process, but the methods to alleviate information overload in browsing process have not been adequately studied. Hence, a method that addresses information overload in the browsing process is presented in this paper. The aim is to reduce the information overload during browsing domain knowledge for new knowledge users who have little understanding of the information. In this method, a knowledge map and social network analysis are utilized to navigate the knowledge users. Technologies first construct a knowledge map from text mining and the important knowledge that includes more information about the domain is then identified via social network analysis. Based on this process, the knowledge user can browse the domain knowledge starting from the important knowledge and navigate via the knowledge map. We applied the method to assist new knowledge users in browsing the Computer Numerical Control (CNC) domain knowledge base to validate the method. The results indicate that the method can identify the important knowledge at a highly acceptable level, the constructed knowledge map can efficiently navigate the knowledge users, and the information overload can be significantly decreased. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Knowledge map-based method for domain knowledge browsing", "paper_id": "WOS:000335113700010"}