{"auto_keywords": [{"score": 0.041346674528199574, "phrase": "nonlinear_systems"}, {"score": 0.014664841853641758, "phrase": "new_stability_conditions"}, {"score": 0.011340584127978585, "phrase": "parameter_uncertainties"}, {"score": 0.007180742621979651, "phrase": "proposed_conditions"}, {"score": 0.00481495049065317, "phrase": "relaxed_stability_conditions_for"}, {"score": 0.003985487777785535, "phrase": "wide_class"}, {"score": 0.0033163269450817716, "phrase": "practical_applications"}, {"score": 0.003245359940011418, "phrase": "parameters_uncertainties"}, {"score": 0.0029126002350975634, "phrase": "stability_conditions"}, {"score": 0.0027443174539994925, "phrase": "linear_matrix_inequalities"}, {"score": 0.0025440911575156755, "phrase": "existing_stability_conditions"}, {"score": 0.002258485755625332, "phrase": "theoretical_poof"}, {"score": 0.002127915423138391, "phrase": "stability_analysis"}], "paper_keywords": ["interval type-2 fuzzy set", " interval type-2 T-S fuzzy system", " linear matrix inequalities", " stability analysis"], "paper_abstract": "This paper proposes new stability conditions for interval type-2 fuzzy-model-based (FMB) control systems. The type-1 T-S fuzzy model has been widely studied because it can represent a wide class of nonlinear systems. Many favorable results for type-1 T-S fuzzy model have been reported. However, most of conclusions for type-1 T-S fuzzy model can not be applied to nonlinear systems subject to parameter uncertainties. In fact, Most of the practical applications are subject to parameters uncertainties. To address above problem, an interval type-2 T-S fuzzy model has been proposed to approximate nonlinear systems subject to parameter uncertainties, and stability conditions for interval type-2 FMB control systems have also been presented in the form of linear matrix inequalities (LMIs). The aim of this paper is to relax the existing stability conditions. The new stability conditions in terms of LMIs are derived to guarantee the stability of interval type-2 FMB control systems. The theoretical poof is given to show the proposed conditions reduce the conservativeness in stability analysis. Several numerical examples are also provided to illustrate the effectiveness of the proposed conditions.", "paper_title": "RELAXED STABILITY CONDITIONS FOR INTERVAL TYPE-2 FUZZY-MODEL-BASED CONTROL SYSTEMS", "paper_id": "WOS:000334139000005"}