{"auto_keywords": [{"score": 0.04817552345370084, "phrase": "social_cost"}, {"score": 0.008713768692145006, "phrase": "atomic_splittable_routing_games"}, {"score": 0.004220314322073171, "phrase": "single_player"}, {"score": 0.0038520615699124123, "phrase": "post-collusion_equilibrium"}, {"score": 0.0036988415150699945, "phrase": "pre-collusion_equilibrium"}, {"score": 0.003341839487905525, "phrase": "natural_condition"}, {"score": 0.0032088487124106936, "phrase": "delay_functions"}, {"score": 0.0026457367614424777, "phrase": "novel_flow-augmenting_algorithm"}, {"score": 0.002226017732566121, "phrase": "non-trivial_subclass"}, {"score": 0.002203509076886664, "phrase": "selfish_routing_games"}, {"score": 0.0021373366163721518, "phrase": "exact_equilibrium"}, {"score": 0.0021049977753042253, "phrase": "polynomial_time"}], "paper_keywords": ["Selfish routing", " Collusion", " Social cost", " Nash equilibria", " Exact algorithms"], "paper_abstract": "We study how collusion affects the social cost in atomic splittable routing games. Suppose that players form coalitions and each coalition behaves as if it were a single player controlling all the flows of its participants. We investigate the following question: under what conditions would the social cost of the post-collusion equilibrium be bounded by the social cost of the pre-collusion equilibrium? We show that if (i) the network is \"well-designed\" (satisfying a natural condition), and (ii) the delay functions are affine, then collusion is always beneficial for the social cost in the equilibrium flows. On the other hand, if either of the above conditions is unsatisfied, collusion can worsen the social cost. Our main technique is a novel flow-augmenting algorithm to build equilibrium flows. Our positive result for collusion is obtained by applying this algorithm simultaneously to two different flow value profiles of players and observing the difference in the derivatives of their social costs. Moreover, for a non-trivial subclass of selfish routing games, this algorithm finds the exact equilibrium flows in polynomial time.", "paper_title": "Collusion in Atomic Splittable Routing Games", "paper_id": "WOS:000317611100008"}