{"auto_keywords": [{"score": 0.04887439861725414, "phrase": "pharmacological_properties"}, {"score": 0.04162229438748574, "phrase": "lpv"}, {"score": 0.04118659576133817, "phrase": "expanded_active_site_cavity"}, {"score": 0.011907774976271249, "phrase": "lost_contacts"}, {"score": 0.008849937950832346, "phrase": "binding_affinity"}, {"score": 0.0045591142048535165, "phrase": "extended_lopinavir_analogs"}, {"score": 0.003998983496539902, "phrase": "binding_orientation"}, {"score": 0.003745179888113379, "phrase": "current_study"}, {"score": 0.0035849585026689573, "phrase": "lpv_analogs"}, {"score": 0.003132693064568434, "phrase": "twelve_proposed_extensions"}, {"score": 0.0031099353574309606, "phrase": "different_combinations"}, {"score": 0.0030315735229977927, "phrase": "para-fluoro_phenyl_group"}, {"score": 0.0028702214190712036, "phrase": "improved_binding_profile"}, {"score": 0.002808104467715375, "phrase": "mdr_protease"}, {"score": 0.002717433692385074, "phrase": "lpv."}, {"score": 0.0026586145364395544, "phrase": "wild_type"}, {"score": 0.0023229408675543147, "phrase": "higher_potency"}, {"score": 0.002167355210897559, "phrase": "mdr_variants"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["HIV/AIDS", " HIV-1 protease", " Multidrug-resistance", " Protease inhibitors", " Lopinavir", " Virtual screening"], "paper_abstract": "Crystal structure of multidrug-resistant (MDR) clinical isolate 769, human immunodeficiency virus type-1 (HIV-1) protease in complex with lopinavir (LPV) (PDB ID: 1RV7) showed altered binding orientation of LPV in the expanded active site cavity, causing loss of contacts and decrease in potency. In the current study, with a goal to restore the lost contacts, three libraries of LPV analogs containing extended P1 and/or P1' phenyl groups were designed and docked into the expanded active site cavity of the MDR769 HIV-1 protease. The compounds were then ranked based on three criteria: binding affinity, overall binding profile and predicted pharmacological properties. Among the twelve proposed extensions in different combinations, compound 14 (consists of para-fluoro phenyl group as both P1 and P1' moieties) was identified as a lead with improved binding profile, binding affinity against the MDR protease and favorable predicted pharmacological properties comparable to those of LPV. The binding affinity of 14 against wild type (NL4-3) HIV-1 protease was comparable to that of LPV and was better than LPV against an ensemble of MDR HIV-1 protease variants. Thus, 14 shows enhanced binding affinity by restoring lost contacts in the expanded active site cavity of MDR769 HIV-1 protease variants suggesting that it may have higher potency compared to that of LPV and hence should be further synthesized and evaluated against NL4-3 as well as MDR variants of HIV-1. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "P1 and P1 ' para-fluoro phenyl groups show enhanced binding and favorable predicted pharmacological properties: Structure-based virtual screening of extended lopinavir analogs against multi-drug resistant HIV-1 protease", "paper_id": "WOS:000330262100003"}