{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "visible_region"}, {"score": 0.004571478018964363, "phrase": "point_p"}, {"score": 0.004187049198138107, "phrase": "generic_radar-like_algorithm"}, {"score": 0.0035973486787314883, "phrase": "visible_segments"}, {"score": 0.0035544816252832375, "phrase": "cross_sections"}, {"score": 0.0031152526492532785, "phrase": "specific_way"}, {"score": 0.00287583918696114, "phrase": "alternative_algorithm"}, {"score": 0.0024901940672239806, "phrase": "p_queries"}, {"score": 0.0024311346712789553, "phrase": "query_point_q"}, {"score": 0.0021561514733516676, "phrase": "natural_error_measure"}, {"score": 0.0021049977753042253, "phrase": "radar-like_algorithm"}], "paper_keywords": ["algorithms", " triangulated irregular networks", " visibility"], "paper_abstract": "Given a terrain and a point p on or above it, we wish to compute the region R(p) that is visible from p. We present a generic radar-like algorithm for computing an approximation of R(p) . The algorithm interpolates the visible region between two consecutive rays (emanating from p) whenever the rays are close enough; that is, whenever the difference between the sets of visible segments along the cross sections in the directions specified by the rays is below some threshold. Thus the density of the sampling by rays is sensitive to the shape of the visible region. We suggest a specific way to measure the resemblance (difference) and to interpolate the visible region between two consecutive rays. We also present an alternative algorithm, which uses circles of increasing radii centered at p instead of rays emanating from p. Both algorithms compute a representation of the (approximated) visible region that is especially suitable for is-visible-from-p queries, i.e., given a query point q on the terrain determine whether q is visible from p. Finally, we report on the experiments that we performed with these algorithms and with their corresponding fixed versions, using a natural error measure. Our main conclusion is that the radar-like algorithm is significantly better than the others.", "paper_title": "Approximating the visible region of a point on a terrain", "paper_id": "WOS:000253128600002"}