{"auto_keywords": [{"score": 0.041791008124514514, "phrase": "kim's_method"}, {"score": 0.004815203617189901, "phrase": "kim"}, {"score": 0.004646088032529303, "phrase": "content-based_image_copy_detection_method"}, {"score": 0.0041316803676012155, "phrase": "water_coloring"}, {"score": 0.003104201872147936, "phrase": "elliptical_track_division_strategy"}, {"score": 0.0028459677232555176, "phrase": "dynamic_center_point_detection_mechanism"}, {"score": 0.002676692093594358, "phrase": "shifting_process"}, {"score": 0.0026359661683151006, "phrase": "experimental_results"}, {"score": 0.0025826247025542213, "phrase": "proposed_methods"}, {"score": 0.0022267859286766553, "phrase": "accurate_detection_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["copy detection", " elliptical track division strategy", " relative mean feature", " variation feature", " rotation tolerance"], "paper_abstract": "In 2003, Kim applied the discrete cosine transform (DCT) technique to propose a content-based image copy detection method. He successfully detected the copies both with and without modifications, and his method is the first to detect the copies with water coloring and twirling modifications. However, Kim's method can only detect copies having a 180 rotation. When copies have a 90 degrees or 270 degrees rotation, Kim's method fails to discover them. Also, his method cannot deal with copies having only minor rotations of 1 degrees or 5 degrees, and so on. To conquer this weakness, we propose an elliptical track division strategy to extract two kinds of features in the design of our proposed methods. Furthermore, we propose a dynamic center point detection mechanism for the elliptical track of each image to deal with the shifting process. The experimental results confirm that both proposed methods can successfully capture the features of an image even if it is shifted, cropped or rotated to any degree. In addition, our hybrid method can further provide accurate detection performance for a variety of manipulations. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Novel image copy detection with rotating tolerance", "paper_id": "WOS:000247453800013"}