{"auto_keywords": [{"score": 0.020639988433922157, "phrase": "interpolating_surface"}, {"score": 0.008547947232949186, "phrase": "signed_distance_field"}, {"score": 0.00849337160273716, "phrase": "adaptive_resolution"}, {"score": 0.006550927778854751, "phrase": "interpolating_surfaces"}, {"score": 0.0064054077204094865, "phrase": "proposed_method"}, {"score": 0.00461786618294789, "phrase": "range_finders"}, {"score": 0.004179703591623336, "phrase": "novel_method"}, {"score": 0.004060432002446197, "phrase": "incomplete_model"}, {"score": 0.004008516312861836, "phrase": "intermediate_representation"}, {"score": 0.003770804164370454, "phrase": "nearest_point"}, {"score": 0.0037345764328235564, "phrase": "mesh_model"}, {"score": 0.003674974033320428, "phrase": "sdf"}, {"score": 0.0034347810592224096, "phrase": "real_surfaces"}, {"score": 0.0032102434609532888, "phrase": "real_or_interpolating_surface"}, {"score": 0.0031589756301986763, "phrase": "signed_distances"}, {"score": 0.0029240263074648792, "phrase": "signed_distance"}, {"score": 0.0025376170201746213, "phrase": "partial_differential_equations"}, {"score": 0.0024571577953004546, "phrase": "boundary_condition"}, {"score": 0.002433519998239738, "phrase": "initial_state"}, {"score": 0.0023336832083729973, "phrase": "closest_point"}, {"score": 0.002311230481682913, "phrase": "real_surface"}, {"score": 0.0021809687586808544, "phrase": "large_holes"}, {"score": 0.002153031476985805, "phrase": "high_curvature"}], "paper_keywords": ["three-dimensional modeling", " interpolation of a mesh model", " adaptive signed distance field"], "paper_abstract": "When we use range finders to observe the shape of an object, many occluded areas may occur. These become holes and gaps in the model and make it undesirable for various applications. We propose a novel method to fill holes and gaps to complete this incomplete model. As an intermediate representation, we use a Signed Distance Field (SDF), which stores euclidean signed distances from a voxel to the nearest point of the mesh model. By using an SDF, we can obtain interpolating surfaces for holes and gaps. The proposed method generates an interpolating surface that becomes smoothly continuous with real surfaces by minimizing the area of the interpolating surface. Since the isosurface of an SDF can be identified as being a real or interpolating surface from the magnitude of signed distances, our method computes the area of an interpolating surface in the neighborhood of a voxel both before and after flipping the sign of the signed distance of the voxel. If the area is reduced by flipping the sign, then our method changes the sign for the voxel. Therefore, we minimize the area of the interpolating surface by iterating this computation until convergence. Unlike methods based on Partial Differential Equations (PDEs), our method does not require any boundary condition and the initial state that we use is automatically obtained by computing the distance to the closest point of the real surface. Moreover, because our method can be applied to an SDF of adaptive resolution, our method efficiently interpolates large holes and gaps of high curvature. We tested the proposed method with both synthesized and real objects and evaluated the interpolating surfaces.", "paper_title": "Hole filling of a 3D model by flipping signs of a signed distance field in adaptive resolution", "paper_id": "WOS:000253135600011"}