{"auto_keywords": [{"score": 0.024940466246661852, "phrase": "future_research"}, {"score": 0.00481495049065317, "phrase": "voluntary_turnover_research"}, {"score": 0.004695900553353526, "phrase": "numerous_studies"}, {"score": 0.00422177384286051, "phrase": "general_turnover_trend"}, {"score": 0.0035648266669315943, "phrase": "similar_studies"}, {"score": 0.003369322866499541, "phrase": "similar_results"}, {"score": 0.0029909851863915283, "phrase": "newer_research_directions"}, {"score": 0.0026055251533586804, "phrase": "new_research_frontiers"}, {"score": 0.002509284173541882, "phrase": "comprehensive_review"}, {"score": 0.0022696277881969896, "phrase": "existing_knowledge"}, {"score": 0.0022273034991008326, "phrase": "paper_reviews"}, {"score": 0.002172093645267283, "phrase": "existing_literature"}, {"score": 0.0021315842986705485, "phrase": "voluntary_turnover"}], "paper_keywords": ["Information technology workforce", " Information systems workforce", " IT professionals", " IT employees", " IT workers", " Voluntary turnover research", " Literature review"], "paper_abstract": "Despite the numerous studies on the topic of IT employee turnover and recommendations to organizations on how to retain their employees, the general turnover trend of IT professionals remains high. The need for further research on IT turnover has been called for by many, but much of the literature continues to conduct similar studies using the same constructs, and these studies find similar results. Now is the time to turn our research attention to directions that have been unexplored or less explored. Newer research directions for the IT turnover literature will provide insights for refining and easing the impact of turnover on organizations. As we embark on new research frontiers in the IT turnover phenomenon, a comprehensive review and assessment of the state of the literature may facilitate future research in building off of existing knowledge. This paper reviews and assesses the existing literature on the voluntary turnover of IT employees, identifies the areas where research has matured, and raises directions for future research that are less chartered.", "paper_title": "The information technology workforce: A review and assessment of voluntary turnover research", "paper_id": "WOS:000351520100010"}