{"auto_keywords": [{"score": 0.049581014501477026, "phrase": "intelligent_environments"}, {"score": 0.00481495049065317, "phrase": "multispectrum_activity_interpretation"}, {"score": 0.004246947739596565, "phrase": "general_description"}, {"score": 0.0038049789989278463, "phrase": "information_fusion_abilities"}, {"score": 0.0036680857629458816, "phrase": "model-view-controller_paradigm"}, {"score": 0.0035361001070845677, "phrase": "hybrid_distributed_system"}, {"score": 0.003444732262403694, "phrase": "common_model"}, {"score": 0.003373334961160647, "phrase": "data_structures"}, {"score": 0.0024250482323322606, "phrase": "system_functionality"}, {"score": 0.0022772115643656153, "phrase": "elderly_fall_detection"}, {"score": 0.002172266188075892, "phrase": "proposed_framework"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Monitoring and activity interpretation", " INT3-Horus framework", " Intelligent environments", " Fall detection"], "paper_abstract": "The INT3-Horus framework, dedicated to monitoring and activity interpretation in intelligent environments is introduced. Firstly, the paper introduces a general description of the INT3-Horus approach. The following aspects of the proposal are highlighted: the framework is multisensory by nature and includes information fusion abilities; it is based on the model-view-controller paradigm; it is defined as a hybrid distributed system; it incorporates a Common Model that houses the data structures to support the exchange of information between levels of the framework. Then, the INT3-Horus framework ontological model is introduced. The ontology is composed of a couple of classes, namely the Level Class and the DataType Class. The paper also describes the relations between both classes, as well as it introduces the notion of set of rules which determine the system functionality for a given domain. Lastly, a case of study on elderly fall detection is described to show the efficiency of the proposed framework. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "INT3-Horus framework for multispectrum activity interpretation in intelligent environments", "paper_id": "WOS:000326214700005"}