{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "data_provenance"}, {"score": 0.004759507166427077, "phrase": "privacy_breaches"}, {"score": 0.004722898398399427, "phrase": "forensic_analysis"}, {"score": 0.00468656988857138, "phrase": "computer_systems"}, {"score": 0.004579244735256393, "phrase": "suspicious_objects"}, {"score": 0.004141742095830515, "phrase": "vast_amounts"}, {"score": 0.0038485929962942776, "phrase": "detailed_information"}, {"score": 0.0034806529881619454, "phrase": "forensic_platform"}, {"score": 0.0033357416981328577, "phrase": "virtualized_environment"}, {"score": 0.003111472132927442, "phrase": "causal_chain"}, {"score": 0.002665465323614577, "phrase": "recorded_events"}, {"score": 0.0024957862318504753, "phrase": "extensive_empirical_evaluation"}, {"score": 0.0024574537875026634, "phrase": "real-world_case_study"}, {"score": 0.002364172626241202, "phrase": "valuable_information"}, {"score": 0.0021544587602892466, "phrase": "tracking_mechanism"}, {"score": 0.0021213575697367148, "phrase": "data_exfiltration_attempts"}, {"score": 0.0021049977753042253, "phrase": "multiple_disks"}], "paper_keywords": ["Computer security", " information security", " intrusion detection", " system recovery", " checkpointing", " virtual machine monitors", " operating systems"], "paper_abstract": "Forensic analysis of computer systems requires that one first identify suspicious objects or events, and then examine them in enough detail to form a hypothesis as to their cause and effect. Sadly, while our ability to gather vast amounts of data has improved significantly over the past two decades, it is all too often the case that we lack detailed information just when we need it the most. In this paper, we attempt to improve on the state of the art by providing a forensic platform that transparently monitors and records data access events within a virtualized environment using only the abstractions exposed by the hypervisor. Our approach monitors accesses to objects on disk and follows the causal chain of these accesses across processes, even after the objects are copied into memory. Our forensic layer records these transactions in a tamper evident version-based audit log that allows for faithful, and efficient, reconstruction of the recorded events and the changes they induced. To demonstrate the utility of our approach, we provide an extensive empirical evaluation, including a real-world case study demonstrating how our platform can be used to reconstruct valuable information about the what, when, and how, after a compromise has been detected. We also extend our earlier work by providing a tracking mechanism that can monitor data exfiltration attempts across multiple disks and also block attempts to copy data over the network.", "paper_title": "Trail of Bytes: New Techniques for Supporting Data Provenance and Limiting Privacy Breaches", "paper_id": "WOS:000311702600018"}