{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "predictive_values"}, {"score": 0.009430806413690802, "phrase": "global_hypothesis_test"}, {"score": 0.007120837590418086, "phrase": "diagnostic_test"}, {"score": 0.004690694501758065, "phrase": "positive_and_negative_predictive_values"}, {"score": 0.0046176782475198085, "phrase": "binary_diagnostic_test"}, {"score": 0.004498490110526062, "phrase": "clinical_accuracy"}, {"score": 0.004115697805448384, "phrase": "disease_prevalence"}, {"score": 0.0038450179181069833, "phrase": "paired_designs"}, {"score": 0.003303412571939192, "phrase": "gold_standard"}, {"score": 0.0031348622158167195, "phrase": "random_sample"}, {"score": 0.0030378759123133644, "phrase": "asymptotic_hypothesis_test"}, {"score": 0.002974886152979993, "phrase": "chi-square_distribution"}, {"score": 0.0024634797027967203, "phrase": "simulation_experiments"}, {"score": 0.002172266188075892, "phrase": "coronary_disease"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Global hypothesis test", " Positive and negative predictive values", " Multiple comparisons"], "paper_abstract": "The positive and negative predictive values of a binary diagnostic test are measures of the clinical accuracy of the diagnostic test, which depend on the sensitivity and specificity of the diagnostic test and the disease prevalence, and therefore they are two interdependent parameters. The comparisons of predictive values in paired designs do not consider the dependence between predictive values. A global hypothesis test has been studied in order to simultaneously compare the predictive values of two or more binary diagnostic tests when the binary tests and the gold standard are applied to all of the individuals in a random sample. This global hypothesis test is an asymptotic hypothesis test based on the chi-square distribution. Simulation experiments have been carried out in order to study the type I error and the power of the global hypothesis test when comparing the predictive values of two and three binary diagnostic tests, respectively. From the results of the simulation experiments, a method has been proposed to simultaneously compare the predictive values of two or more binary diagnostic tests. The results have been applied to the diagnosis of coronary disease. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Global hypothesis test to simultaneously compare the predictive values of two binary diagnostic tests", "paper_id": "WOS:000301688100015"}