{"auto_keywords": [{"score": 0.04072472046898861, "phrase": "operational_requirements"}, {"score": 0.004645057834614705, "phrase": "requirements_specification"}, {"score": 0.0044277810648955624, "phrase": "operational_requirements_specification"}, {"score": 0.0035473867669654174, "phrase": "model_checking"}, {"score": 0.003505112979852903, "phrase": "inductive_learning"}, {"score": 0.002910545717767559, "phrase": "inductive_learning_process"}, {"score": 0.0027741761880779535, "phrase": "user-provided_positive_examples"}, {"score": 0.002387758958649797, "phrase": "goal_violation"}, {"score": 0.0023171750718791713, "phrase": "proposed_framework"}, {"score": 0.0021821915946356168, "phrase": "engineer's_knowledge"}, {"score": 0.0021049977753042253, "phrase": "envisioned_system"}], "paper_keywords": ["Requirements elaboration", " goal operationalization", " behavior model refinement", " model checking", " inductive learning"], "paper_abstract": "The process of Requirements Engineering (RE) includes many activities, from goal elicitation to requirements specification. The aim is to develop an operational requirements specification that is guaranteed to satisfy the goals. In this paper, we propose a formal, systematic approach for generating a set of operational requirements that are complete with respect to given goals. We show how the integration of model checking and inductive learning can be effectively used to do this. The model checking formally verifies the satisfaction of the goals and produces counterexamples when incompleteness in the operational requirements is detected. The inductive learning process then computes operational requirements from the counterexamples and user-provided positive examples. These learned operational requirements are guaranteed to eliminate the counterexamples and be consistent with the goals. This process is performed iteratively until no goal violation is detected. The proposed framework is a rigorous, tool-supported requirements elaboration technique which is formally guided by the engineer's knowledge of the domain and the envisioned system.", "paper_title": "Elaborating Requirements Using Model Checking and Inductive Learning", "paper_id": "WOS:000315520700005"}