{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "high-level_petri_nets"}, {"score": 0.04550288640963527, "phrase": "great_deal"}, {"score": 0.04132712815039597, "phrase": "behavioral_patterns"}, {"score": 0.024787986813741118, "phrase": "generated_behavioral_patterns"}, {"score": 0.024385803439436308, "phrase": "actual_behavioral_patterns"}, {"score": 0.004637478829869904, "phrase": "internet_use"}, {"score": 0.004541712637353326, "phrase": "-learning_systems"}, {"score": 0.004266067096140677, "phrase": "high_quality_e-learning_environments"}, {"score": 0.004195418010131832, "phrase": "adaptive_learning_environments"}, {"score": 0.0039737570920809215, "phrase": "large_amounts"}, {"score": 0.0037795163893761027, "phrase": "sufficient_behavioral_patterns"}, {"score": 0.0034911335714333507, "phrase": "browsing_behavior_model"}, {"score": 0.003279039724748895, "phrase": "students'_behavioral_patterns"}, {"score": 0.0032246840531778725, "phrase": "hlpn"}, {"score": 0.0030414140732789186, "phrase": "colored_tokens"}, {"score": 0.0028091907694771613, "phrase": "timed_petri"}, {"score": 0.0022601535748259785, "phrase": "elementary_school_students"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["B-2 model", " Behavioral patterns", " E-learning", " High-Level Petri Nets"], "paper_abstract": "As Internet use has proliferated, e-learning systems have become increasingly popular. Many researchers have taken a great deal of effort to promote high quality e-learning environments, such as adaptive learning environments, personalized/adaptive guidance mechanisms, and so on. These researches need to collect large amounts of behavioral patterns for the verification and/or experimentation. However, collecting sufficient behavioral patterns usually takes a great deal of time and effort. To solve this problem, this paper proposes a browsing behavior model (B-2 Model) based on High-Level Petri Nets (HLPNs) to model and generate students' behavioral patterns. The adopted HLPN contains (1) Colored Petri Nets (CPNs), in which colored tokens can be used to identify and separate student, learning content and assessment, and (2) Timed Petri Nets (TPNs), in which time variable can be used to represent the time at which a student reads learning content. Besides, to validate the viability of the B-2 model, this paper implements a B-2 modeling tool to generate behavioral patterns. The generated behavioral patterns are compared with actual behavioral patterns collected from elementary school students. The results confirm that the generated behavioral patterns are analogous to actual behavioral patterns. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "B-2 model: A browsing behavior model based on High-Level Petri Nets to generate behavioral patterns for e-learning", "paper_id": "WOS:000270646200046"}