{"auto_keywords": [{"score": 0.03690455333353583, "phrase": "packet_significance"}, {"score": 0.009449872724942522, "phrase": "user_perceivable_qos."}, {"score": 0.00481495049065317, "phrase": "packet_semantics"}, {"score": 0.004752954376588157, "phrase": "real-time_multimedia_streaming"}, {"score": 0.004616352597792864, "phrase": "novel_packet_scheduling_algorithm"}, {"score": 0.004397313229350093, "phrase": "overall_packet_loss"}, {"score": 0.004148084083511323, "phrase": "packet_scheduling_mechanism"}, {"score": 0.003989797665674148, "phrase": "packet_loss"}, {"score": 0.003305584108847751, "phrase": "modern_compression_schemes"}, {"score": 0.0031690434364310435, "phrase": "packet_scheduling"}, {"score": 0.003048001809453513, "phrase": "limited_network_bandwidth_availability"}, {"score": 0.002893753089970741, "phrase": "entire_set"}, {"score": 0.002828740624702789, "phrase": "greedy_approach"}, {"score": 0.0027295084882654917, "phrase": "selection_criteria"}, {"score": 0.002685558057339722, "phrase": "transmission_interval"}, {"score": 0.002599763359352916, "phrase": "simulation_based_experiments"}, {"score": 0.0025829353063908256, "phrase": "eight_video_clips"}, {"score": 0.0025248881422983553, "phrase": "decoding_engine"}, {"score": 0.002373807808495538, "phrase": "proposed_algorithm"}, {"score": 0.00235843888868088, "phrase": "best_effort_scheduling_scheme"}, {"score": 0.002327998222143962, "phrase": "simple_qos_metric_based_scheduling_scheme"}, {"score": 0.00221729614713299, "phrase": "best_user_perceivable_qos._saps"}, {"score": 0.0021745003291048356, "phrase": "burstier_traffic"}, {"score": 0.0021049977753042253, "phrase": "overall_user_perceivable"}], "paper_keywords": ["Real-time multimedia streaming", " Scalable encoding", " Packet significance", " Traffic smoothing", " Packet scheduling"], "paper_abstract": "In this work, we develop a novel packet scheduling algorithm that properly incorporates the semantics of a packet. We find that improvement in overall packet loss does not necessarily coincide with improvement in user perceivable QoS. The objective of this work is to develop a packet scheduling mechanism which can improve the user perceivable QoS. We do not focus on improving packet loss, delay, or burstiness. We develop a metric called, \"Packet Significance,\" that effectively quantifies the importance of a packet that properly incorporates the semantics of a packet from the perspective of compression. Packet significance elaborately incorporates inter-frame, intra-frame information dependency, and the transitive information dependency characteristics of modern compression schemes. We apply packet significance in scheduling the packet. In our context, packet scheduling consists of two technical ingredients: packet selection and interval selection. Under limited network bandwidth availability, it is desirable to transmit the subset of the packets rather than transmitting the entire set of packets. We use a greedy approach in selecting packets for transmission and use packet significance as the selection criteria. In determining the transmission interval of a packet, we incorporate the packet significance. Simulation based experiments with eight video clips were performed. We embed the decoding engine in our simulation software and examine the user perceivable QoS (PSNR). We compare the performance of the proposed algorithm with best effort scheduling scheme and one with simple QoS metric based scheduling scheme. Our Significance-Aware Scheduling scheme (SAPS) effectively incorporates the semantics of a packet and delivers best user perceivable QoS. SAPS can result in more packet loss or burstier traffic. Despite these limitations, SAPS successfully improves the overall user perceivable QoS.", "paper_title": "Incorporating packet semantics in scheduling of real-time multimedia streaming", "paper_id": "WOS:000273480300013"}