{"auto_keywords": [{"score": 0.030322073346072554, "phrase": "bn"}, {"score": 0.00481495049065317, "phrase": "football_results"}, {"score": 0.0047908297061814336, "phrase": "bayesian_nets"}, {"score": 0.004754873823321114, "phrase": "learning_techniques"}, {"score": 0.0047310525657970615, "phrase": "bayesian_networks"}, {"score": 0.004707369312884874, "phrase": "bns"}, {"score": 0.004533308740981974, "phrase": "usable_form"}, {"score": 0.004069096437466151, "phrase": "tottenham_hotspur_football_club"}, {"score": 0.003821297056249902, "phrase": "subjective_judgement"}, {"score": 0.0037452213615708522, "phrase": "comparative_accuracy"}, {"score": 0.0036706546272761787, "phrase": "alternative_ml_models"}, {"score": 0.0035975671431900777, "phrase": "two-year_period"}, {"score": 0.0035705347414368696, "phrase": "additional_ml_techniques"}, {"score": 0.0034731361817923636, "phrase": "naive_bayesian_learner"}, {"score": 0.003180504445263932, "phrase": "predictive_accuracy"}, {"score": 0.00304737045343781, "phrase": "key_respects"}, {"score": 0.0030244597238450795, "phrase": "study_assumptions"}, {"score": 0.0029124565592269992, "phrase": "bn_prediction"}, {"score": 0.002700706591870657, "phrase": "'each_way"}, {"score": 0.0025424177449894906, "phrase": "key_players"}, {"score": 0.0024420674564756208, "phrase": "excellent_potential"}, {"score": 0.002387367008622037, "phrase": "reliable_domain_expert"}, {"score": 0.0023515808351427165, "phrase": "accurate_predictions"}, {"score": 0.0023163298440214194, "phrase": "obvious_bonus"}, {"score": 0.0021478278695820268, "phrase": "similar_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bayesian nets", " machine learning", " football"], "paper_abstract": "Bayesian networks (BNs) provide a means for representing, displaying, and making available in a usable form the knowledge of experts in a given field. In this paper, we look at the performance of an expert constructed BN compared with other machine learning (ML) techniques for predicting the outcome (win, lose, or draw) of matches played by Tottenham Hotspur Football Club. The period under study was 1995-1997 - the expert BN was constructed at the start of that period, based almost exclusively on subjective judgement. Our objective was to determine retrospectively the comparative accuracy of the expert BN compared to some alternative ML models that were built using data from the two-year period. The additional ML techniques considered were: MC4, a decision tree learner; Naive Bayesian learner; Data Driven Bayesian (a BN whose structure and node probability tables are learnt entirely from data); and a K-nearest neighbour learner. The results show that the expert BN is generally superior to the other techniques for this domain in predictive accuracy. The results are even more impressive for BNs given that, in a number of key respects, the study assumptions place them at a disadvantage. For example, we have assumed that the BN prediction is 'incorrect' if a BN predicts more than one outcome as equally most likely (whereas, in fact, such a prediction would prove valuable to somebody who could place an 'each way' bet on the outcome). Although the expert BN has now long been irrelevant (since it contains variables relating to key players who have retired or left the club) the results here tend to confirm the excellent potential of BNs when they are built by a reliable domain expert. The ability to provide accurate predictions without requiring much learning data are an obvious bonus in any domain where data are scarce. Moreover, the BN was relatively simple for the expert to build and its structure could be used again in this and similar types of problems. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Predicting football results using Bayesian nets and other machine learning techniques", "paper_id": "WOS:000242636900011"}