{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fresh_produce"}, {"score": 0.004586531354697466, "phrase": "freshness-condition-dependent_demand"}, {"score": 0.00436890075128947, "phrase": "inventory_control_problems"}, {"score": 0.004116823963855969, "phrase": "deteriorating_inventory_control"}, {"score": 0.0034629341517018438, "phrase": "nondecaying_utilities"}, {"score": 0.003107935254560724, "phrase": "important_role"}, {"score": 0.002881255933884771, "phrase": "single-period_inventory_and_shelf-space_allocation_model"}, {"score": 0.002656650588033728, "phrase": "demand_rate"}, {"score": 0.0021863046959469863, "phrase": "different_sizes"}, {"score": 0.0021049977753042253, "phrase": "modified_generalized_reduced_gradient_algorithm"}], "paper_keywords": ["inventory", " shelf-space allocation", " fresh produce", " optimization"], "paper_abstract": "A significant amount of work has investigated inventory control problems associated with fresh produce. Much of this work has considered deteriorating inventory control with many models having been proposed for various situations. However, no researchers have specifically studied fresh produce, which has its own special characteristics. Most research categorizes fresh produce into more general deteriorating categories with random lifetimes and nondecaying utilities. However, this classification is not reasonable or practical because the freshness of an item usually plays an important role in influencing the demand for the produce. In this paper, a single-period inventory and shelf-space allocation model is proposed for fresh produce. These items usually have a very short lifetime. The demand rate is assumed to be deterministic and dependent on both the displayed inventory (the number of facings of items on the shelves) and the items' freshness condition (which decreases over time). Several problem instances of different sizes are provided and solved by a modified generalized reduced gradient algorithm.", "paper_title": "A model for fresh produce shelf-space allocation and inventory management with freshness-condition-dependent demand", "paper_id": "WOS:000254140400008"}