{"auto_keywords": [{"score": 0.04971747610320425, "phrase": "data-intensive_jobs"}, {"score": 0.04935889043076212, "phrase": "computing-intensive_jobs"}, {"score": 0.042372790327092964, "phrase": "nine_heuristics"}, {"score": 0.015719716506582538, "phrase": "nine_heuristic_algorithms"}, {"score": 0.015312565222620566, "phrase": "dynamic_environment"}, {"score": 0.0085123451883073, "phrase": "finished_jobs"}, {"score": 0.004090682761004765, "phrase": "simulation_environment"}, {"score": 0.0028525124381208705, "phrase": "different_arrival_rates"}, {"score": 0.0028309318332306703, "phrase": "five_parameters"}, {"score": 0.0026843584448921565, "phrase": "average_execution_time"}, {"score": 0.0025165151708122957, "phrase": "file_size"}, {"score": 0.0022972306948217548, "phrase": "simulation_results"}, {"score": 0.0022200068884960836, "phrase": "relative_good_performance"}, {"score": 0.0021948455916770233, "phrase": "job_scheduling"}, {"score": 0.002169968849836984, "phrase": "grid_systems"}, {"score": 0.002121056250381627, "phrase": "asjs"}, {"score": 0.0021049977753042253, "phrase": "olb."}], "paper_keywords": [""], "paper_abstract": "This study focuses on a dynamic environment where data-intensive jobs and computing-intensive jobs are submitted to a grid at the same time. The authors analyse nine heuristic algorithms in a grid and give a comparison of them in a simulation environment. The nine heuristics are: (i) min-min, (ii) max-min, (iii) duplex, (iv) sufferage, (v) minimum execution time (MET), (vi) opportunistic load balancing (OLB), (vii) fast-fit, (viii) best-fit and (ix) adaptive scoring job scheduling (ASJS). In the simulation, different ratios between the data-intensive jobs and computing-intensive jobs are used to investigate for the performance of the nine heuristics under different arrival rates. Five parameters are used to estimate the performance of those methods. Those parameters include average execution time, average waiting time, the number of finished jobs (FB), the sum of file size that has been submitted to the grid (SFS) and the total number of instructions of all finished jobs (SINI). Simulation results show that four out of the nine heuristics have relative good performance in the job scheduling in the grid systems. They are best-fit, MET, ASJS and OLB.", "paper_title": "Evaluation of nine heuristic algorithms with data-intensive jobs and computing-intensive jobs in a dynamic environment", "paper_id": "WOS:000350153000002"}