{"auto_keywords": [{"score": 0.04399950949312563, "phrase": "water_surface"}, {"score": 0.00481495049065317, "phrase": "mobile_underwater_acoustic_sensor_networks"}, {"score": 0.004669845451682529, "phrase": "maximized_coverage"}, {"score": 0.004646088032529303, "phrase": "underwater_acoustic_sensor_networks"}, {"score": 0.00437021209960886, "phrase": "final_network"}, {"score": 0.004027586827290042, "phrase": "initial_connectivity"}, {"score": 0.003936137932404253, "phrase": "fully_distributed_node_deployment_scheme"}, {"score": 0.0038763239921683463, "phrase": "random_dropping"}, {"score": 0.0037023751900951947, "phrase": "cds"}, {"score": 0.0036646500791760734, "phrase": "initial_network"}, {"score": 0.003535985831484511, "phrase": "particular_dominator_node"}, {"score": 0.0033004240095380623, "phrase": "leader_node"}, {"score": 0.0031845067058084613, "phrase": "depth_adjustment"}, {"score": 0.0031280790061449736, "phrase": "possible_topology_alterations"}, {"score": 0.0031042018721479385, "phrase": "water_mobility"}, {"score": 0.0029951555610569225, "phrase": "random_surface_effects"}, {"score": 0.0029722900280316216, "phrase": "network_coverage"}, {"score": 0.0029571431113892504, "phrase": "connectivity_performance"}, {"score": 0.0025433263646920364, "phrase": "best_node_deployment_time"}, {"score": 0.002392008392892289, "phrase": "current_mobility_model"}, {"score": 0.00235560370536971, "phrase": "existing_mobility_models"}, {"score": 0.002290291401956985, "phrase": "proposed_approach"}, {"score": 0.002255431275670053, "phrase": "simulations_results"}, {"score": 0.0021817065300196634, "phrase": "range_ratio"}, {"score": 0.0021375377706211686, "phrase": "coverage-aware_deployment_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Self-deployment", " Coverage maximization", " Connectivity", " Underwater acoustic sensor networks", " Mobility model"], "paper_abstract": "Self-deployment of sensors with maximized coverage in Underwater Acoustic Sensor Networks (UWASNs) is challenging due to difficulty of access to 3-D underwater environments. The problem is further compounded if the connectivity of the final network is desired. One possible approach to this problem is to drop the sensors on the water surface and then move them to certain depths in the water to maximize the 3-0 coverage while maintaining the initial connectivity. In this paper, we propose a fully distributed node deployment scheme for UWASNs which only requires random dropping of sensors on the water surface. The idea is based on determining the connected dominating set (CDS) of the initial network on the surface and then adjust the depths of all neighbors of a particular dominator node (i.e., the backbone of the network) for minimizing the coverage overlaps among them while still keeping the connectivity with the dominator. The process starts with a leader node and spans all the dominators in the network for repositioning them. In addition to depth adjustment, we studied the effects of possible topology alterations due to water mobility caused by several factors such as waves, winds, currents, vortices or random surface effects, on network coverage and connectivity performance. On the one hand the mobility of nodes may help the topology to get stretched in 2-D, which helps to maximize the coverage in 3-0. On the other hand the mobility may cause the network to get partitioned where some of the nodes are disconnected from the rest of the topology. We investigated the best node deployment time where 2-D coverage is maximized and the network is still connected. To simulate the mobility of the sensors, we implemented meandering current mobility model which is one of the existing mobility models for UWASNs that fits our needs. The performance of the proposed approach is validated through simulation. Simulations results indicate that connectivity can be guaranteed regardless of the transmission and sensing range ratio with a coverage very close to a coverage-aware deployment approach. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Self-deployment of mobile underwater acoustic sensor networks for maximized coverage and guaranteed connectivity", "paper_id": "WOS:000366774800014"}