{"auto_keywords": [{"score": 0.04268813213127871, "phrase": "multiple_defender_resources"}, {"score": 0.042403964177785004, "phrase": "jointly_coordinated_activities"}, {"score": 0.00481495049065317, "phrase": "joint_activity"}, {"score": 0.004798265909863013, "phrase": "based_security_games"}, {"score": 0.004602483094756597, "phrase": "transit_system"}, {"score": 0.0044608829094248985, "phrase": "scheduling_systems"}, {"score": 0.004414653335578912, "phrase": "algorithmic_advances"}, {"score": 0.004384098916012568, "phrase": "stackelberg_security_games"}, {"score": 0.004234456398783788, "phrase": "existing_algorithms"}, {"score": 0.0034857716240772165, "phrase": "smart"}, {"score": 0.0031845067058084613, "phrase": "defender's_resources"}, {"score": 0.002980916123365584, "phrase": "smart_instances"}, {"score": 0.0028293966058473476, "phrase": "individual_defender_strategies"}, {"score": 0.0027903049766389433, "phrase": "search_space"}, {"score": 0.002770961604021066, "phrase": "column_generation"}, {"score": 0.002723186210025975, "phrase": "traveling_salesman"}, {"score": 0.0025937408242280757, "phrase": "coordinated_strategies"}, {"score": 0.0025578967205807843, "phrase": "tight_upper_bounds"}, {"score": 0.002427826856342292, "phrase": "extensive_empirical_and_theoretical_analysis"}, {"score": 0.002344800544183559, "phrase": "large_scale_real-world_experiment"}, {"score": 0.0023043558058824572, "phrase": "first_head-to-head_comparison"}, {"score": 0.0021871503075921537, "phrase": "one-day_patrol_exercise"}, {"score": 0.002149418970824546, "phrase": "los_angeles_metro_system"}, {"score": 0.0021049977753042253, "phrase": "game-theoretic_schedules"}], "paper_keywords": ["Game theory", " Security", " Stackelberg games", " Simulations", " Field evaluation"], "paper_abstract": "In recent years, several security agencies have been deploying scheduling systems based on algorithmic advances in Stackelberg security games (SSGs). Unfortunately, none of the existing algorithms can scale up to domains where benefits are accrued from multiple defender resources performing jointly coordinated activities. Yet in many domains, including port patrolling where SSGs are in use, enabling multiple defender resources to perform jointly coordinated activities would significantly enhance the effectiveness of the patrols. To address this challenge, this paper presents four contributions. First, we present Smart (Security games with Multiple coordinated Activities and Resources that are Time-dependent), a novel SSG model that explicitly represents jointly coordinated activities between defender's resources. Second, we present two branch-and-price algorithms, -an optimal algorithm, and -a heuristic approach, to solve Smart instances. The two algorithms present three novel features: (i) a novel approach to generate individual defender strategies by ordering the search space during column generation using insights from the Traveling Salesman Problem(TSP); (ii) exploitation of iterative modification of rewards of multiple defender resources to generate coordinated strategies and (iii) generation of tight upper bounds for pruning using the structure of the problem. Third, we present an extensive empirical and theoretical analysis of both and . Fourth, we describe a large scale real-world experiment whereby we run the first head-to-head comparison between game-theoretic schedules generated using against schedules generated by humans on a one-day patrol exercise over one train line of the Los Angeles Metro System. Our results show that game-theoretic schedules were evaluated to be superior to ones generated by humans.", "paper_title": "Efficient solutions for joint activity based security games: fast algorithms, results and a field experiment on a transit system", "paper_id": "WOS:000357652000003"}