{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "governance_mechanisms"}, {"score": 0.049178471674397164, "phrase": "electronic_repositories"}, {"score": 0.04349317877091025, "phrase": "community-governed_repositories"}, {"score": 0.03348422535817348, "phrase": "sensitive_content"}, {"score": 0.03109989611572896, "phrase": "peer_input"}, {"score": 0.030813660850066347, "phrase": "expert_opinion"}, {"score": 0.004569905085027681, "phrase": "popular_mechanisms"}, {"score": 0.004058180509184539, "phrase": "qualitative_study"}, {"score": 0.0038332390893263844, "phrase": "grounded_theory_approach"}, {"score": 0.0036727235025069828, "phrase": "contribution_behaviors"}, {"score": 0.003485605409687907, "phrase": "content-based_categories"}, {"score": 0.0031393948330209255, "phrase": "need-based_categories"}, {"score": 0.003094920033010818, "phrase": "different_needs"}, {"score": 0.002416589459425828, "phrase": "expert-governed_repositories"}, {"score": 0.0022076314894741394, "phrase": "extant_work"}, {"score": 0.0021049977753042253, "phrase": "salient_categories"}], "paper_keywords": ["Expert-governance", " community-governance", " contribution behaviors"], "paper_abstract": "Expert- and community-governance are becoming popular mechanisms to verify contributions in electronic repositories. This study examines the conditions under which employees make contributions to expert- and community-governed repositories. We conduct a qualitative study using data collected through interviews. Analysis of data using the grounded theory approach reveals that two groups of categories are salient for contribution behaviors: content-based, and need-based. Content-based categories concern the type of content provided for each contribution and involve whether contributions are suggestions/ideas and whether they have sensitive content. Need-based categories concern the different needs of employees and involve whether employees have a need for peer input, expert opinion, or recognition. Findings suggest that employees are more likely to contribute to community-governed repositories if contributions are suggestions/ideas and there is a need for peer input. On the other hand, employees are more likely to contribute to expert-governed repositories if contributions have sensitive content and there is a need for expert opinion and recognition. This study contributes to extant work by distinguishing between two types of governance mechanisms and identifying the salient categories in contributing to repositories that employ these mechanisms.", "paper_title": "The Salience of Governance Mechanisms in Contributing to Electronic Repositories", "paper_id": "WOS:000336562300002"}