{"auto_keywords": [{"score": 0.027952062234018398, "phrase": "wsqh-sc"}, {"score": 0.015584374765208468, "phrase": "enhanced_pixel-wise_masking"}, {"score": 0.01293696589560445, "phrase": "satisfactory_reversibility"}, {"score": 0.01212210441895536, "phrase": "watermarked_images"}, {"score": 0.00481634783567357, "phrase": "clustering"}, {"score": 0.004470071518923524, "phrase": "host_images"}, {"score": 0.004373398434399966, "phrase": "unintentional_attacks"}, {"score": 0.004297560964892607, "phrase": "conventional_rrw_methods"}, {"score": 0.003920384090110374, "phrase": "large-scale_image_datasets"}, {"score": 0.0036553070575015344, "phrase": "different_unintentional_attacks"}, {"score": 0.003498782065781398, "phrase": "extremely_poor_invisibility"}, {"score": 0.003108735847242537, "phrase": "novel_pragmatic_framework"}, {"score": 0.00308163068747474, "phrase": "wavelet-domain_statistical_quantity"}, {"score": 0.002949598537993663, "phrase": "conventional_methods"}, {"score": 0.0028857130140890787, "phrase": "new_watermark_embedding"}, {"score": 0.002860546817196148, "phrase": "extraction_procedures"}, {"score": 0.0026786469998321084, "phrase": "run-time_complexity"}, {"score": 0.0025977542995083624, "phrase": "property-inspired_pixel_adjustment"}, {"score": 0.002228412982799273, "phrase": "extensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "histogram_rotation-based_and_histogram_distribution"}], "paper_keywords": ["Integer wavelet transform", " k-means clustering", " masking", " robust reversible watermarking (RRW)"], "paper_abstract": "Robust reversible watermarking (RRW) methods are popular in multimedia for protecting copyright, while preserving intactness of host images and providing robustness against unintentional attacks. However, conventional RRW methods are not readily applicable in practice. That is mainly because: 1) they fail to offer satisfactory reversibility on large-scale image datasets; 2) they have limited robustness in extracting watermarks from the watermarked images destroyed by different unintentional attacks; and 3) some of them suffer from extremely poor invisibility for watermarked images. Therefore, it is necessary to have a framework to address these three problems, and further improve its performance. This paper presents a novel pragmatic framework, wavelet-domain statistical quantity histogram shifting and clustering (WSQH-SC). Compared with conventional methods, WSQH-SC ingeniously constructs new watermark embedding and extraction procedures by histogram shifting and clustering, which are important for improving robustness and reducing run-time complexity. Additionally, WSQH-SC includes the property-inspired pixel adjustment to effectively handle overflow and underflow of pixels. This results in satisfactory reversibility and invisibility. Furthermore, to increase its practical applicability, WSQH-SC designs an enhanced pixel-wise masking to balance robustness and invisibility. We perform extensive experiments over natural, medical, and synthetic aperture radar images to show the effectiveness of WSQH-SC by comparing with the histogram rotation-based and histogram distribution constrained methods.", "paper_title": "Robust Reversible Watermarking via Clustering and Enhanced Pixel-Wise Masking", "paper_id": "WOS:000306598100021"}