{"auto_keywords": [{"score": 0.0496578611773389, "phrase": "linear_regression"}, {"score": 0.008039491112666748, "phrase": "nnsg"}, {"score": 0.007213603117310911, "phrase": "graph_structure"}, {"score": 0.006994435395049835, "phrase": "label_prediction"}, {"score": 0.0062092915387420905, "phrase": "new_samples"}, {"score": 0.00481495049065317, "phrase": "nonnegative_sparse_graph"}, {"score": 0.0039815737219022675, "phrase": "graph_structure_construction"}, {"score": 0.0031774686451753477, "phrase": "novel_method"}, {"score": 0.0027947199430705077, "phrase": "learning_process"}, {"score": 0.0027578496677536373, "phrase": "label_information"}, {"score": 0.0025806490053534316, "phrase": "discriminative_projection"}, {"score": 0.0025578967205807843, "phrase": "better_fit_sample_labels"}, {"score": 0.002479827946513971, "phrase": "effective_algorithm"}, {"score": 0.0024148064819862337, "phrase": "corresponding_optimization_problem"}, {"score": 0.0023935128386292966, "phrase": "fast_convergence"}, {"score": 0.002320449502337321, "phrase": "unified_perceptiveness"}, {"score": 0.0022696277881969896, "phrase": "graph-based_learning_methods"}, {"score": 0.002200337772403983, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "conventional_g-ssl_methods"}], "paper_keywords": ["Graph learning", " linear regression", " label propagation", " semi-supervised classification"], "paper_abstract": "Previous graph-based semisupervised learning (G-SSL) methods have the following drawbacks: 1) they usually predefine the graph structure and then use it to perform label prediction, which cannot guarantee an overall optimum and 2) they only focus on the label prediction or the graph structure construction but are not competent in handling new samples. To this end, a novel nonnegative sparse graph (NNSG) learning method was first proposed. Then, both the label prediction and projection learning were integrated into linear regression. Finally, the linear regression and graph structure learning were unified within the same framework to overcome these two drawbacks. Therefore, a novel method, named learning a NNSG for linear regression was presented, in which the linear regression and graph learning were simultaneously performed to guarantee an overall optimum. In the learning process, the label information can be accurately propagated via the graph structure so that the linear regression can learn a discriminative projection to better fit sample labels and accurately classify new samples. An effective algorithm was designed to solve the corresponding optimization problem with fast convergence. Furthermore, NNSG provides a unified perceptiveness for a number of graph-based learning methods and linear regression methods. The experimental results showed that NNSG can obtain very high classification accuracy and greatly outperforms conventional G-SSL methods, especially some conventional graph construction methods.", "paper_title": "Learning a Nonnegative Sparse Graph for Linear Regression", "paper_id": "WOS:000355760300001"}