{"auto_keywords": [{"score": 0.04057426281126848, "phrase": "ijmi"}, {"score": 0.014774462867897282, "phrase": "biomedical_and_health_informatics"}, {"score": 0.012331772719118141, "phrase": "mim"}, {"score": 0.011620630935440319, "phrase": "model_types"}, {"score": 0.008556788875419637, "phrase": "medical_informatics"}, {"score": 0.00481495049065317, "phrase": "biomedical_informatics"}, {"score": 0.004626680470601208, "phrase": "significant_part"}, {"score": 0.004247560712327667, "phrase": "scientific_journals"}, {"score": 0.004128192012388041, "phrase": "medical_informatics_curricula"}, {"score": 0.003989351600022163, "phrase": "recent_publications"}, {"score": 0.003528957477793481, "phrase": "random_samples"}, {"score": 0.003267342521938321, "phrase": "special_issues"}, {"score": 0.0032027318619522916, "phrase": "special_topics"}, {"score": 0.002999274091205852, "phrase": "high_variation"}, {"score": 0.0029483516334882862, "phrase": "theme-centered_sits"}, {"score": 0.002881793492919646, "phrase": "formal_knowledge"}, {"score": 0.0028409576481842457, "phrase": "strong_engineering_background"}, {"score": 0.002706383680762465, "phrase": "related_skills"}, {"score": 0.0026604207233593973, "phrase": "consecutive_b.sc"}, {"score": 0.0026377343815230095, "phrase": "m.sc"}, {"score": 0.002477140909481497, "phrase": "health_information_systems"}, {"score": 0.0022737565087825058, "phrase": "major_task"}, {"score": 0.002178400923036365, "phrase": "broad_range"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["modeling", " biomedical informatics", " medical informatics", " health informatics"], "paper_abstract": "Objective: Modeling is a significant part of research, education and practice in biomedical and health informatics. Our objective was to explore which types of models of processes are used in current biomedical/health informatics research, as reflected in publications of scientific journals in this field. Also, the implications for medical informatics curricula were investigated. Methods: Retrospective, prolective observational study on recent publications of the two official journals of the International Medical Informatics Association (IMIA), the International journal of Medical Informatics (IJMI) and Methods of Information in Medicine (MIM). All publications of the years 2004 and 2005 from these journals were indexed according to a given list of model types. Random samples out of these publications were analysed in more depth. Results: Three hundred and eighty-four publications have been analysed, 190 of IJMI and 194 of MIM. For publications in special issues (121 in IJMI) and special topics (132 in MIM) we found differences between theme-centered and conference-centered special issues/special topics (SIT) publications. In particular, we could observe a high variation between modeling in publications of theme-centered SITs. It became obvious that often sound formal knowledge as well as a strong engineering background is needed for carrying out this type of research. Usually, this knowledge and the related skills can be best provided in consecutive B.Sc. and M.Sc. programs in medical informatics (respectively, health informatics, biomedical informatics). If the focus should be primarily on health information systems and evaluation this can be offered in a M.Sc. program in medical informatics. Conclusions: In analysing the 384 publications it became obvious that modeling continues to be a major task in research, education and practice in biomedical and health informatics. Knowledge and skills on a broad range of model types are needed in biomedical/health informatics. (c) 2006 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Modeling in biomedical informatics - An exploratory analysis - Part 2", "paper_id": "WOS:000244812500004"}