{"auto_keywords": [{"score": 0.0500785012217586, "phrase": "password-based_authentication_key_exchange"}, {"score": 0.04974492695968205, "phrase": "pake"}, {"score": 0.04011963660553964, "phrase": "peer_channel"}, {"score": 0.004304574865291508, "phrase": "\"client-server\"_applications"}, {"score": 0.004127394241838696, "phrase": "rapid_developments"}, {"score": 0.004098578483988551, "phrase": "modern_communication_environments"}, {"score": 0.004041546659145336, "phrase": "ad-hoc_networks"}, {"score": 0.003768028741967194, "phrase": "quite_a_different_paradigm"}, {"score": 0.003286596407873823, "phrase": "three-party_setting"}, {"score": 0.0029172107428045964, "phrase": "efficient_password-based_authentication_key_exchange_protocol"}, {"score": 0.0028166655005289073, "phrase": "standard_model"}, {"score": 0.002729133029776093, "phrase": "human-memorable_passwords"}, {"score": 0.0022032718573953922, "phrase": "random_oracles"}, {"score": 0.0021198271568336063, "phrase": "expensive_signature_schemes"}, {"score": 0.0021049977753042253, "phrase": "zero-knowlegde_proofs"}], "paper_keywords": ["Cryptography", " provably security", " key exchange", " three-party setting", " dictionary attacks", " undetectable dictionary attacks"], "paper_abstract": "Password-based authentication key exchange (PAKE) protocols in the literature typically assume a password that is shared between a client and a server. PAKE has been applied in various environments, especially in the \"client-server\" applications of remotely accessed systems, such as e-banking. With the rapid developments in modern communication environments, such as ad-hoc networks and ubiquitous computing, it is customary to construct a secure peer-to-peer channel, which is quite a different paradigm from existing paradigms. In such a peer-to-peer channel, it would be much more common for users to not share a password with others. In this paper, we consider password-based authentication key exchange in the three-party setting, where two users do not share a password between themselves but only with one server. The users make a session-key by using their different passwords with the help of the server. We propose an efficient password-based authentication key exchange protocol with different passwords that achieves forward secrecy in the standard model. The protocol requires parties to only memorize human-memorable passwords; all other information that is necessary to run the protocol is made public. The protocol is also light-weighted, i.e., it requires only three rounds and four modular exponentiations per user. In fact, this amount of computation and the number of rounds are comparable to the most efficient password-based authentication key exchange protocol in the random-oracle model. The dispensation of random oracles in the protocol does not require the security of any expensive signature schemes or zero-knowlegde proofs.", "paper_title": "Practical Password-Authenticated Three-Party Key Exchange", "paper_id": "WOS:000270933500003"}