{"auto_keywords": [{"score": 0.01053449915958766, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.010418726645955065, "phrase": "transmission_bandwidth"}, {"score": 0.008319876512950655, "phrase": "bandwidth-based_power-aware_routing_protocol"}, {"score": 0.007338026921649715, "phrase": "possible_amount"}, {"score": 0.007097969548433312, "phrase": "remaining_power"}, {"score": 0.0069166630501607115, "phrase": "data_transmission"}, {"score": 0.00481495049065317, "phrase": "power_saving"}, {"score": 0.004554650954322244, "phrase": "power_consumption"}, {"score": 0.0040904740665330805, "phrase": "gps_device"}, {"score": 0.003956234229826621, "phrase": "hardware_cost"}, {"score": 0.003912469968653304, "phrase": "power_consumption_increase"}, {"score": 0.0036734281414482735, "phrase": "gps_devices"}, {"score": 0.0035135084960705816, "phrase": "received_signal_variation"}, {"score": 0.0027502501046865525, "phrase": "network_lifetime"}, {"score": 0.0024971726615908617, "phrase": "mmbcr"}, {"score": 0.002353120949568249, "phrase": "rerouting_paths"}, {"score": 0.0021604504765314497, "phrase": "active_nodes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Power-aware routing protocol", " Bandwidth", " Signal strength"], "paper_abstract": "The transmission bandwidth between two nodes in mobile ad hoc networks is important in terms of power consumption. However, the bandwidth between two nodes is always treated the same, regardless of what the distance is between the two nodes. If a node equips a GPS device to determine the distance between two nodes, the hardware cost and the power consumption increase. In this paper, we propose using a bandwidth-based power-aware routing protocol with signal detection instead of using GPS devices to determine the distance. In our proposed routing protocol, we use the received signal variation to predict the transmission bandwidth and the lifetime of a link. Accordingly, the possible amount of data that can be transmitted and the remaining power of nodes in the path after data transmission can be predicted. By predicting the possible amount of data that can be transmitted and the remaining power of nodes after data transmission, we can design a bandwidth-based power-aware routing protocol that has power efficiency and that prolongs network lifetime. In our simulation, we compare our proposed routing protocol with two signal-based routing protocols, SSA and ABR, and a power-aware routing protocol, MMBCR, in terms of the throughput, the average transmission bandwidth, the number of rerouting paths, the path lifetime, the power consumed when a byte is transmitted, and the network lifetime (the ratio of active nodes). (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Signal strength based routing for power saving in mobile ad hoc networks", "paper_id": "WOS:000279365400010"}