{"auto_keywords": [{"score": 0.008528459817950295, "phrase": "overlapping_cervical_cells"}, {"score": 0.00481495049065317, "phrase": "multiple_level"}, {"score": 0.004583205112737672, "phrase": "improved_algorithm"}, {"score": 0.004204054047427536, "phrase": "poor_contrast"}, {"score": 0.004178198896815672, "phrase": "cell_cytoplasm"}, {"score": 0.00405127920820053, "phrase": "inflammatory_cells"}, {"score": 0.003940338160665297, "phrase": "joint_optimization"}, {"score": 0.003916098498242888, "phrase": "multiple_level_set_functions"}, {"score": 0.0036365535913458705, "phrase": "contour_length"}, {"score": 0.003614175930699828, "phrase": "edge_strength"}, {"score": 0.0035808664384880213, "phrase": "cell_shape"}, {"score": 0.0035369291417564606, "phrase": "pairwise_constraint"}, {"score": 0.0034400245101881936, "phrase": "overlapping_regions"}, {"score": 0.0031260524791486347, "phrase": "synthetically_overlapping_images"}, {"score": 0.0031068064097811844, "phrase": "free-lying_cervical_cells"}, {"score": 0.002938821840519756, "phrase": "overlap_coefficient"}, {"score": 0.00284065508239492, "phrase": "quantitative_assessment"}, {"score": 0.002541677703992971, "phrase": "individual_cells"}, {"score": 0.002367315484467406, "phrase": "field_images"}, {"score": 0.0021510385886131557, "phrase": "cell_nuclei_segmentation"}, {"score": 0.0021049977753042253, "phrase": "current_state"}], "paper_keywords": ["Overlapping cell segmentation", " Pap smear image analysis", " level set method"], "paper_abstract": "In this paper, we present an improved algorithm for the segmentation of cytoplasm and nuclei from clumps of overlapping cervical cells. This problem is notoriously difficult because of the degree of overlap among cells, the poor contrast of cell cytoplasm and the presence of mucus, blood, and inflammatory cells. Our methodology addresses these issues by utilizing a joint optimization of multiple level set functions, where each function represents a cell within a clump, that have both unary (intracell) and pairwise (intercell) constraints. The unary constraints are based on contour length, edge strength, and cell shape, while the pairwise constraint is computed based on the area of the overlapping regions. In this way, our methodology enables the analysis of nuclei and cytoplasm from both free-lying and overlapping cells. We provide a systematic evaluation of our methodology using a database of over 900 images generated by synthetically overlapping images of free-lying cervical cells, where the number of cells within a clump is varied from 2 to 10 and the overlap coefficient between pairs of cells from 0.1 to 0.5. This quantitative assessment demonstrates that our methodology can successfully segment clumps of up to 10 cells, provided the overlap between pairs of cells is <0.2. Moreover, if the clump consists of three or fewer cells, then our methodology can successfully segment individual cells even when the overlap is similar to 0.5. We also evaluate our approach quantitatively and qualitatively on a set of 16 extended depth of field images, where we are able to segment a total of 645 cells, of which only similar to 10% are free-lying. Finally, we demonstrate that our method of cell nuclei segmentation is competitive when compared with the current state of the art.", "paper_title": "An Improved Joint Optimization of Multiple Level Set Functions for the Segmentation of Overlapping Cervical Cells", "paper_id": "WOS:000356036600005"}