{"auto_keywords": [{"score": 0.032501446262619214, "phrase": "receptor_binding"}, {"score": 0.004565876339189493, "phrase": "important_cytokine"}, {"score": 0.004485735417293941, "phrase": "immune_system"}, {"score": 0.003916098498242888, "phrase": "similar_tertiary_structures"}, {"score": 0.0037133478610481994, "phrase": "receptor_activation"}, {"score": 0.0034388111429203222, "phrase": "major_differences"}, {"score": 0.00314708280192844, "phrase": "variable_loops"}, {"score": 0.0030374213037172803, "phrase": "molecular_dynamics_simulations"}, {"score": 0.002931569771634119, "phrase": "significant_changes"}, {"score": 0.0028800314406625996, "phrase": "dynamic_range"}, {"score": 0.0021049977753042253, "phrase": "lower_conformational_entropy"}], "paper_keywords": ["Chicken interleukin-1 beta", " Homology modeling", " Molecular docking", " Molecular dynamics", " Type I interleukin-1 receptor"], "paper_abstract": "Interleukin-1 beta (IL-1 beta) is an important cytokine in the immune system. Mammalian and avian IL-1 beta s share only 31-35% sequence identity, and the function of avian IL-1 beta s is less well understood by comparison. Although chicken and mammalian IL-1 beta s have similar tertiary structures, these ILs differ significantly with respect to receptor activation. Analysis of the structures and sequences of IL-1 beta s reveals that the major differences lie in loops. Modeling docking of chicken IL-1 beta to its receptor reveals that these variable loops are critical for receptor binding. Molecular dynamics simulations of the IL-1 beta s reveal significant changes in the dynamic range of motion upon receptor binding. Loops 3 and 9 of the unbound chicken IL-1 beta had greater fluctuations compared with the other loops. Upon binding, the flexibility of these loops, which directly contact the receptor, markedly decreases. Taken together, these results suggest that receptor binding leads to not only favorable enthalpy but also lower conformational entropy.", "paper_title": "Comparative analysis of receptor binding by chicken and human interleukin-1 beta", "paper_id": "WOS:000291041800007"}