{"auto_keywords": [{"score": 0.04797258478251987, "phrase": "authoring_tool"}, {"score": 0.04377352312035198, "phrase": "suitable_authoring_tools"}, {"score": 0.042148418405646954, "phrase": "reusable_quizzes"}, {"score": 0.037817265253462316, "phrase": "existing_learning_resources"}, {"score": 0.02958201596178897, "phrase": "higher_quality"}, {"score": 0.00481495049065317, "phrase": "web-based_learning_resources"}, {"score": 0.004400804926266097, "phrase": "web-based_education"}, {"score": 0.003932654396285872, "phrase": "existing_materials"}, {"score": 0.0037595947142663997, "phrase": "online_e-learning_authoring_tool"}, {"score": 0.002506715532901322, "phrase": "main_contribution"}, {"score": 0.0023035922232490106, "phrase": "assessment_resources"}, {"score": 0.0021896891011033105, "phrase": "different_factors"}, {"score": 0.0021049977753042253, "phrase": "created_quizzes"}], "paper_keywords": ["Authoring tool", " assessment", " quiz", " quality"], "paper_abstract": "Quizzes are among the most widely used resources in Web-based education due to their many benefits. However, educators need suitable authoring tools that can be used to create reusable quizzes and to enhance existing materials with them. This paper presents an online e-Learning authoring tool for creating and integrating reusable quizzes and enhancing existing learning resources with them. The evaluation of this authoring tool showed that teachers found it useful and easy to use. A total of 246 educational resources created with the tool were evaluated, and the results were analyzed, showing that the resources that included quizzes had higher quality and that the resources that had higher quality were more likely to contain quizzes. These findings are the main contribution of this paper, and they show that educators can enhance existing learning resources by adding assessment resources if suitable authoring tools are provided. Finally, the different factors that assure the reusability of the created quizzes and resources are also exposed.", "paper_title": "Enhancing Web-Based Learning Resources With Existing and Custom Quizzes Through an Authoring Tool", "paper_id": "WOS:000372658300004"}