{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "constraint-based_clustering"}, {"score": 0.04936752816788871, "phrase": "homogeneous_groups"}, {"score": 0.04661815751258512, "phrase": "confounding_factor"}, {"score": 0.02441957721066634, "phrase": "ms_patients"}, {"score": 0.0047197594186799054, "phrase": "multiple_sclerosis_patients"}, {"score": 0.004638005069508673, "phrase": "unsupervised_data"}, {"score": 0.004591922752626493, "phrase": "undesirable_clustering_results"}, {"score": 0.0045349602638676805, "phrase": "medical_datasets"}, {"score": 0.004357365123444528, "phrase": "patient's_disease"}, {"score": 0.003933255917889961, "phrase": "multiple_sclerosis"}, {"score": 0.003826640124836338, "phrase": "physician_subjectivity"}, {"score": 0.0038075670544062724, "phrase": "patient_data"}, {"score": 0.003436785843635843, "phrase": "b_bins"}, {"score": 0.0031884897583149083, "phrase": "similar_f_value"}, {"score": 0.0031175486694208156, "phrase": "single_bin"}, {"score": 0.0030634619419916214, "phrase": "feature_f"}, {"score": 0.0030178471028791424, "phrase": "remaining_steps"}, {"score": 0.0029067508382150807, "phrase": "clustering_results"}, {"score": 0.0028778201936562452, "phrase": "pair-wise_constraints"}, {"score": 0.002842060319876433, "phrase": "constraint-based_clustering_algorithm"}, {"score": 0.0028137717176055835, "phrase": "final_grouping"}, {"score": 0.002744272593470898, "phrase": "synthetic_datasets"}, {"score": 0.002676485464655112, "phrase": "numeric_confounding_factors"}, {"score": 0.002610368383831601, "phrase": "womens_hospital"}, {"score": 0.0025714826897097927, "phrase": "novel_grouping"}, {"score": 0.0025079529641763095, "phrase": "impact_disease_progression"}, {"score": 0.002274796550579261, "phrase": "clinically_recognizable_differences"}, {"score": 0.0021475664838460137, "phrase": "treatment_decisions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Constraint-based clustering", " Confounding factor", " Mining medical data", " Physician subjectivity", " Multiple sclerosis"], "paper_abstract": "Objectives: Confounding factors in unsupervised data can lead to undesirable clustering results. For example in medical datasets, age is often a confounding factor in tests designed to judge the severity of a patient's disease through measures of mobility, eyesight and hearing. In such cases, removing age from each instance will not remove its effect from the data as other features will be correlated with age. Motivated by the need to find homogeneous groups of multiple sclerosis (MS) patients, we apply our approach to remove physician subjectivity from patient data. Methods: We present a method based on constraint-based clustering to remove the impact of such confounding factors. Given knowledge about which feature (or set of features) is a confounding factor, call it F. Our method first partitions the data into b bins: if F is categorical, instances from the same category construct one bin; if F is numeric, then we split bins such that each bin contains instances of similar F value. Thus each instance is assigned to a single bin for factor F. We then remove feature F from each instance for the remaining steps. Next, we cluster the data separately in each bin. Using these clustering results, we generate pair-wise constraints and then run a constraint-based clustering algorithm to produce a final grouping. Results: In a series of experiments with synthetic datasets, we compare our proposed methods to detrending when one has numeric confounding factors. We apply our method to the Comprehensive Longitudinal Investigation of Multiple Sclerosis at Brigham and Womens Hospital dataset, and find a novel grouping of patients that can help uncover the factors that impact disease progression in MS. Conclusions: Our method groups data removing the effect of confounding factors without making any assumptions about the form of the influence of these factors on the other features. We identified clusters of MS patients that have clinically recognizable differences. Because patients more likely to progress are found using this approach, our results have the potential to aid physicians in tailoring treatment decisions for MS patients. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Removing confounding factors via constraint-based clustering: An application to finding homogeneous groups of multiple sclerosis patients", "paper_id": "WOS:000363826900002"}