{"auto_keywords": [{"score": 0.041976525668421014, "phrase": "network_lifetime"}, {"score": 0.00481495049065317, "phrase": "multiple_connected-covered_topologies"}, {"score": 0.0046242451772036145, "phrase": "energy_constrained_sensor_devices"}, {"score": 0.004303591748086452, "phrase": "higher_densities"}, {"score": 0.0041891398413899435, "phrase": "high_level"}, {"score": 0.004133055661437163, "phrase": "simplest_strategy"}, {"score": 0.003595552309967789, "phrase": "active_nodes"}, {"score": 0.0033459905006404207, "phrase": "connected_sets"}, {"score": 0.002910545717767559, "phrase": "dense_sensor_deployment_scenarios"}, {"score": 0.002833035775182696, "phrase": "near-optimal_topologies"}, {"score": 0.002708399936381754, "phrase": "location_information"}, {"score": 0.0026481480455339055, "phrase": "individual_sensor_nodes"}, {"score": 0.0024641814990854463, "phrase": "wake-up_based_topology_construction_algorithms"}, {"score": 0.0023770362063833903, "phrase": "realistic_sensor_deployments"}, {"score": 0.0023451553255837317, "phrase": "varying_node_densities"}, {"score": 0.0022520496048464406, "phrase": "required_level"}, {"score": 0.0021821915946356168, "phrase": "sensor_location_information"}, {"score": 0.002143247921132179, "phrase": "connected-covered_topologies"}], "paper_keywords": ["connectivity", " coverage", " reliability", " wake-up management", " sensor networks"], "paper_abstract": "It is likely that low-cost energy constrained sensor devices will be prone to failure. This necessitates that these devices must be deployed in higher densities than required. At a high level, the simplest strategy that can be exploited to prolong network lifetime is to activate only a subset of nodes at a time, while keeping the other nodes asleep, so that the topology formed by the active nodes is connected and provides coverage of the area of interest. Providing diversity in the connected sets of nodes also improves network lifetime significantly. We propose and evaluate different distributed, random and pattern-based wake-up policies for sensor nodes to construct connected-covered topologies. Through analysis and simulations we demonstrate that in dense sensor deployment scenarios, these policies can construct near-optimal topologies with minimal coordination between nodes, as long as location information is available at the individual sensor nodes. Based on these observations, we develop and evaluate a few simple distributed, wake-up based topology construction algorithms that can realise similar performance bounds in realistic sensor deployments, with varying node densities. These algorithms differ in terms of the required level of coordination and the use of sensor location information, and generate connected-covered topologies efficiently, with very low message-exchange overhead.", "paper_title": "Low-coordination wake-up algorithms for multiple connected-covered topologies in sensornets", "paper_id": "WOS:000279970700004"}