{"auto_keywords": [{"score": 0.044566699646831034, "phrase": "distributional_nodes"}, {"score": 0.00481495049065317, "phrase": "probabilistic_xml_models"}, {"score": 0.004714023408114857, "phrase": "probabilistic_xml"}, {"score": 0.004518442937844318, "phrase": "abstract_notion"}, {"score": 0.004353948887538618, "phrase": "ordinary_nodes"}, {"score": 0.004173244935967375, "phrase": "possible_worlds"}, {"score": 0.004085713541752114, "phrase": "particular_families"}, {"score": 0.0036942726653704213, "phrase": "structural_constraints"}, {"score": 0.0034299649219748513, "phrase": "resulting_families"}, {"score": 0.0033937776228549557, "phrase": "natural_extensions"}, {"score": 0.003322540556404882, "phrase": "previously_studied_probabilistic_xml_models"}, {"score": 0.003150900886669123, "phrase": "expressive_power"}, {"score": 0.0021049977753042253, "phrase": "value-based_and_object-based_semantics"}], "paper_keywords": ["XML", " Probabilistic databases", " Probabilistic XML", " Expressiveness", " Updates"], "paper_abstract": "Various known models of probabilistic XML can be represented as instantiations of the abstract notion of p-documents. In addition to ordinary nodes, p-documents have distributional nodes that specify the possible worlds and their probabilistic distribution. Particular families of p-documents are determined by the types of distributional nodes that can be used as well as by the structural constraints on the placement of those nodes in a p-document. Some of the resulting families provide natural extensions and combinations of previously studied probabilistic XML models. The focus of the paper is on the expressive power of families of p-documents. In particular, two main issues are studied. The first is the ability to (efficiently) translate a given p-document of one family into another family. The second is closure under updates, namely, the ability to (efficiently) represent the result of updating the instances of a p-document of a given family as another p-document of that family. For both issues, we distinguish two variants corresponding to value-based and object-based semantics of p-documents.", "paper_title": "On the expressiveness of probabilistic XML models", "paper_id": "WOS:000270651600004"}