{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "marketanalyzer"}, {"score": 0.04734547775045444, "phrase": "competitive_intelligence"}, {"score": 0.013148771185143857, "phrase": "sale_data"}, {"score": 0.004636594774238505, "phrase": "competitive_advantage_using_point"}, {"score": 0.004483585361583022, "phrase": "systematic_approach"}, {"score": 0.004281372589330329, "phrase": "informed_business_decisions"}, {"score": 0.003887438245620965, "phrase": "critical_importance"}, {"score": 0.00377487157059352, "phrase": "existing_tools"}, {"score": 0.003589404014552974, "phrase": "new_approaches"}, {"score": 0.003485437176235259, "phrase": "better_analysis"}, {"score": 0.003456287408801543, "phrase": "decision_making"}, {"score": 0.0031117775337824853, "phrase": "pixel-based_matrices"}, {"score": 0.0030857431184193765, "phrase": "present_sale_data"}, {"score": 0.0029340342068081247, "phrase": "entire_market"}, {"score": 0.002897283610433351, "phrase": "single_display"}, {"score": 0.002813307389456184, "phrase": "advanced_underlying_analytical_methods"}, {"score": 0.002766415324343602, "phrase": "quick_evaluation"}, {"score": 0.0026975346834867313, "phrase": "market_sectors"}, {"score": 0.0025541050375256992, "phrase": "geographical_views"}, {"score": 0.0024284701569889113, "phrase": "regional_demographics"}, {"score": 0.0023481578019624843, "phrase": "detailed_information"}, {"score": 0.0022800613046444563, "phrase": "coordinated_multiple_views"}, {"score": 0.0021049977753042253, "phrase": "market_analysts"}], "paper_keywords": ["I.3.3 [Computer Graphics]: Pixel-based visualization, Linked Views, Geospatial, Temporal, Multi-variate, Business Intelligence, Competitive Intelligence, Market Analysis"], "paper_abstract": "Competitive intelligence is a systematic approach for gathering, analyzing, and managing information to make informed business decisions. Many companies use competitive intelligence to identify risks and opportunities within markets. Point of sale data that retailers share with vendors is of critical importance in developing competitive intelligence. However, existing tools do not easily enable the analysis of such large and complex data. therefore, new approaches are needed in order to facilitate better analysis and decision making. In this paper, we present MarketAnalyzer, an interactive visual analytics system designed to allow vendors to increase their competitive intelligence. MarketAnalyzer utilizes pixel-based matrices to present sale data, trends, and market share growths of products of the entire market within a single display. These matrices are augmented by advanced underlying analytical methods to enable the quick evaluation of growth and risk within market sectors. Furthermore, our system enables the aggregation of point of sale data in geographical views that provide analysts with the ability to explore the impact of regional demographics and trends. Additionally, overview and detailed information is provided through a series of coordinated multiple views. In order to demonstrate the effectiveness of our system, we provide two use-case scenarios as well as feedback from market analysts.", "paper_title": "MarketAnalyzer: An Interactive Visual Analytics System for Analyzing Competitive Advantage Using Point of Sale Data", "paper_id": "WOS:000305603700014"}