{"auto_keywords": [{"score": 0.042335347716798616, "phrase": "finite_derivation_type"}, {"score": 0.00777136505226742, "phrase": "finite_complete"}, {"score": 0.004410938507689426, "phrase": "right_ideals"}, {"score": 0.004195418010131832, "phrase": "finite_complete_rewriting_systems"}, {"score": 0.0032246835734680377, "phrase": "complete_rewriting_systems"}, {"score": 0.002953711377604328, "phrase": "isometric_cayley_graphs"}, {"score": 0.0024625017739528096, "phrase": "finitely_generated_groups"}, {"score": 0.002341958851390876, "phrase": "quasi-isometry_invariant"}, {"score": 0.0021049977753042253, "phrase": "finite_green_index_extensions"}], "paper_keywords": ["Complete rewriting systems", " Finitely presented groups and monoids", " Finiteness conditions", " Homotopy bases", " Finite derivation type", " Schiltzenberger group"], "paper_abstract": "We give an example of a monoid with finitely many left and right ideals, all of whose Schutzenberger groups are presentable by finite complete rewriting systems, and so each have finite derivation type, but such that the monoid itself does not have finite derivation type, and therefore does not admit a presentation by a finite complete rewriting system. The example also serves as a counterexample to several other natural questions regarding complete rewriting systems and finite derivation type. Specifically it allows us to construct two finitely generated monoids M and N with isometric Cayley graphs, where N has finite derivation type (respectively, admits a presentation by a finite complete rewriting system) but M does not. This contrasts with the case of finitely generated groups for which finite derivation type is known to be a quasi-isometry invariant. The same example is also used to show that neither of these two properties is preserved under finite Green index extensions. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "On properties not inherited by monoids from their Schatzenberger groups", "paper_id": "WOS:000291507900008"}