{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "deniable_authentication"}, {"score": 0.009575418808432339, "phrase": "forward_deniability"}, {"score": 0.0047689174754929195, "phrase": "deniable_authentication_protocols"}, {"score": 0.00439555656882915, "phrase": "receiver"}, {"score": 0.00429057323623293, "phrase": "third_party"}, {"score": 0.0036611708297251645, "phrase": "cca-secure_encryption"}, {"score": 0.003608732492631878, "phrase": "previous_known_solutions"}, {"score": 0.0034892684482068347, "phrase": "different_generic_approach"}, {"score": 0.0033575566897536906, "phrase": "new_approaches"}, {"score": 0.0030938932434437178, "phrase": "subtle_definitional_issue"}, {"score": 0.002756529243888597, "phrase": "sender"}, {"score": 0.0025644240336018045, "phrase": "simulation-based_definition"}, {"score": 0.0024088451312725924, "phrase": "real_protocol"}, {"score": 0.0021049977753042253, "phrase": "stricter_requirement"}], "paper_keywords": ["Authentication", " Deniability", " Zero-knowledge"], "paper_abstract": "Deniable Authentication protocols allow a Sender to authenticate a message for a Receiver, in a way that the Receiver cannot convince a third party that such authentication (or any authentication) ever took place. We present two new approaches to the problem of deniable authentication. The novelty of our schemes is that they do not require the use of CCA-secure encryption (all previous known solutions did), thus showing a different generic approach to the problem of deniable authentication. These new approaches are practically relevant as they lead to more efficient protocols. In the process we point out a subtle definitional issue for deniability. In particular, we propose the notion of forward deniability, which requires that the authentications remain deniable even if the Sender wants to later prove that she authenticated a message. We show that a simulation-based definition of deniability, where the simulation can be computationally indistinguishable from the real protocol does not imply forward deniability. Thus, for deniability one needs to restrict the simulation to be perfect (or statistically close). Our new protocols satisfy this stricter requirement.", "paper_title": "New Approaches for Deniable Authentication", "paper_id": "WOS:000268492600005"}