{"auto_keywords": [{"score": 0.044251665003668526, "phrase": "ionic_strength"}, {"score": 0.010190481864655347, "phrase": "medium_conditions"}, {"score": 0.01001962684877236, "phrase": "great_interest"}, {"score": 0.008374147580418408, "phrase": "multivariate_curve_resolution-alternating_least_squares"}, {"score": 0.00481495072903252, "phrase": "mcr-als"}, {"score": 0.004701710196317656, "phrase": "biochemical_variables"}, {"score": 0.004437613070853689, "phrase": "pharmacological_perspective"}, {"score": 0.004188287972391714, "phrase": "important_role"}, {"score": 0.0038598702839340794, "phrase": "chemometrics_approach"}, {"score": 0.003820664678548735, "phrase": "experimental_design_techniques"}, {"score": 0.003426469605016069, "phrase": "ph"}, {"score": 0.0029798924689472014, "phrase": "anova_analysis"}, {"score": 0.002547663224855668, "phrase": "association_process"}, {"score": 0.0025131738347596586, "phrase": "neutral_ph"}, {"score": 0.002479150189700726, "phrase": "aggregation_process"}, {"score": 0.0024455860314641243, "phrase": "acidic_conditions"}, {"score": 0.0023475891378276735, "phrase": "feasible_band_boundaries"}, {"score": 0.0023079225317714815, "phrase": "optical_images"}, {"score": 0.002284444272376043, "phrase": "final_product"}, {"score": 0.0021049977753042253, "phrase": "bioanalytical_studies"}], "paper_keywords": ["Insulin", " Experimental design", " Insulin aggregation", " Insulin association", " Infrared spectroscopy (FTIR-ATR)", " MCR-ALS", " Chemometrics"], "paper_abstract": "The influence of medium conditions on insulin aggregation/association is of great interest from both a therapeutic and a pharmacological perspective. It is widely accepted that temperature, acidity (pH) and ionic strength play an important role in these processes, but studying these aspects in isolation ignores the interaction between variables. In this study, we used a chemometrics approach based on experimental design techniques and multivariate curve resolution-alternating least squares of the infrared spectra recorded in the association/aggregation process in order to simultaneously analyse the effect of acidity, temperature and ionic strength. The influence of acidity was studied at pH ranging between 3 and 7, temperature at between 35 degrees C and 45 degrees C and ionic strength at between 0.3 mM and 1.5 mM. The experiments were designed following a 2(3) full factorial design and the infrared spectra were collected between 1100 and 2000 cm(-1). An ANOVA analysis of the effect on the aggregation/association time revealed that the effect of temperature and pH cannot be quantified without also considering ionic strength. Concentration and spectral profiles recovered by means of multivariate curve resolution-alternating least squares allowed us to conclude that, regardless of temperature and ionic strength, the association process is promoted by neutral pH, while the aggregation process is promoted by acidic conditions. The uncertainty of the solutions was assessed by calculating the feasible band boundaries of the solutions. Optical images of each final product were captured to characterise the influence of the medium conditions on their morphology. The method we propose may be of great interest in many types of bioanalytical studies. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "MCR-ALS analysis of insulin aggregation/association processes. Influence of biochemical variables", "paper_id": "WOS:000324011300007"}