{"auto_keywords": [{"score": 0.037664055996144176, "phrase": "confirmatory_testing"}, {"score": 0.015719716506582538, "phrase": "scaffold_discovery"}, {"score": 0.013938375469171102, "phrase": "active_scaffolds"}, {"score": 0.009247301967270331, "phrase": "dop"}, {"score": 0.004768378525561471, "phrase": "diversity-oriented_prioritization"}, {"score": 0.004653900688892822, "phrase": "high-throughput_screens"}, {"score": 0.0046089247707152056, "phrase": "hts"}, {"score": 0.004542158659382197, "phrase": "small_molecules"}, {"score": 0.003775803846431323, "phrase": "active_molecules"}, {"score": 0.003409057326528229, "phrase": "new_extension"}, {"score": 0.003359647377874098, "phrase": "recently_proposed_economic_framework"}, {"score": 0.0028471655497661528, "phrase": "retrospective_and_prospective_experiments"}, {"score": 0.0027383842769094354, "phrase": "scaffold_discoveries"}, {"score": 0.002672511078070529, "phrase": "confirmatory_experiments"}, {"score": 0.002436289099444074, "phrase": "confirmatory_test_batches"}, {"score": 0.002264607102799332, "phrase": "optimal_number"}, {"score": 0.0021049977753042253, "phrase": "additional_scaffold"}], "paper_keywords": [""], "paper_abstract": "Motivation: In high-throughput screens (HTS) of small molecules for activity in an in vitro assay, it is common to search for active scaffolds, with at least one example successfully confirmed as an active. The number of active scaffolds better reflects the success of the screen than the number of active molecules. Many existing algorithms for deciding which hits should be sent for confirmatory testing neglect this concern. Results: We derived a new extension of a recently proposed economic framework, diversity-oriented prioritization (DOP), that aims-by changing which hits are sent for confirmatory testing-to maximize the number of scaffolds with at least one confirmed active. In both retrospective and prospective experiments, DOP accurately predicted the number of scaffold discoveries in a batch of confirmatory experiments, improved the rate of scaffold discovery by 8-17%, and was surprisingly robust to the size of the confirmatory test batches. As an extension of our previously reported economic framework, DOP can be used to decide the optimal number of hits to send for confirmatory testing by iteratively computing the cost of discovering an additional scaffold, the marginal cost of discovery.", "paper_title": "Enhancing the rate of scaffold discovery with diversity-oriented prioritization", "paper_id": "WOS:000293620800014"}