{"auto_keywords": [{"score": 0.0489886197243292, "phrase": "alice"}, {"score": 0.04867636963067597, "phrase": "bob"}, {"score": 0.00913795092766583, "phrase": "constant_fraction"}, {"score": 0.00481495049065317, "phrase": "private_interactive_communication_across"}, {"score": 0.004783358523770212, "phrase": "adversarial_channel"}, {"score": 0.004613254605667248, "phrase": "private_inputs"}, {"score": 0.004319255461225845, "phrase": "information_theoretic_sense"}, {"score": 0.004030618026002216, "phrase": "communication_channel"}, {"score": 0.0033294278310493524, "phrase": "total_number"}, {"score": 0.00327500240690856, "phrase": "fundamental_question"}, {"score": 0.0031067299689394065, "phrase": "large_number"}, {"score": 0.0028514769721161063, "phrase": "quite_robust_protocols"}, {"score": 0.002565850749422255, "phrase": "parties'_inputs"}, {"score": 0.002339442939538852, "phrase": "contradictory_goals"}, {"score": 0.0021470954708827125, "phrase": "error-less_setting"}, {"score": 0.0021049977753042253, "phrase": "private_and_correct_protocol"}], "paper_keywords": ["Interactive communication", " coding", " privacy", " adversarial noise", " information-theoretic security"], "paper_abstract": "Consider two parties, Alice and Bob, who hold private inputs x and y, and wish to compute a function f (x, y) privately in the information theoretic sense; that is, each party should learn nothing beyond f (x, y). However, the communication channel available to them is noisy. This means that the channel can introduce errors in the transmission between the two parties. Moreover, the channel is adversarial in the sense that it knows the protocol that Alice and Bob are running, and maliciously introduces errors to disrupt the communication, subject to some bound on the total number of errors. A fundamental question in this setting is to design a protocol that remains private in the presence of large number of errors. If Alice and Bob are only interested in computing f (x, y) correctly, and not privately, then quite robust protocols are known that can tolerate a constant fraction of errors. However, none of these solutions is applicable in the setting of privacy, as they inherently leak information about the parties' inputs. This leads to the question whether we can simultaneously achieve privacy and error-resilience against a constant fraction of errors. We show that privacy and error-resilience are contradictory goals. In particular, we show that for every constant c > 0, there exists a function f which is privately computable in the error-less setting, but for which no private and correct protocol is resilient against a c-fraction of errors.", "paper_title": "Private Interactive Communication Across an Adversarial Channel", "paper_id": "WOS:000368420200029"}