{"auto_keywords": [{"score": 0.04869658238235114, "phrase": "ar"}, {"score": 0.004257360656055417, "phrase": "large_databases"}, {"score": 0.0034068225125064586, "phrase": "possible_rules"}, {"score": 0.0028736379396305596, "phrase": "interesting_rules"}, {"score": 0.0027741761880779535, "phrase": "multistep_approach"}, {"score": 0.0026781477395106993, "phrase": "potentially_interesting_items"}, {"score": 0.002646880721119838, "phrase": "well-known_techniques"}, {"score": 0.002615977783510631, "phrase": "multidimensional_data_analysis"}, {"score": 0.0025106241866273897, "phrase": "well-defined_degree"}, {"score": 0.0024379730432321656, "phrase": "item_pair"}, {"score": 0.002206290313627494, "phrase": "considered_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["association rules", " multidimensional data analysis", " binary variables"], "paper_abstract": "Association rules (AR) represent one of the most powerful and largely used approaches to detect the presence of regularities and paths in large databases. Rules express the relations (in terms of co-occurrence) between pairs of items and are defined in two measures: support and confidence. Most techniques for finding AR scan the whole data set, evaluate all possible rules and retain only rules that have support and confidence greater than thresholds, which should be fixed in order to avoid both that only trivial rules are retained and also that interesting rules are not discarded. A multistep approach aims to the identification of potentially interesting items exploiting well-known techniques of multidimensional data analysis. In particular, interesting pairs of items have a well-defined degree of association: an item pair is well defined if its degree of co-occurrence is very high with respect to one or more subsets of the considered set of transactions. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Exploratory data analysis leading towards the most interesting simple association rules", "paper_id": "WOS:000254422400029"}