{"auto_keywords": [{"score": 0.03444175794330926, "phrase": "information_technology_material_weaknesses"}, {"score": 0.014209396327662783, "phrase": "information_technology"}, {"score": 0.00481495049065317, "phrase": "information_technology_control_weaknesses_on_management_information_systems"}, {"score": 0.004284755353695709, "phrase": "management_information_systems"}, {"score": 0.004222707054751191, "phrase": "subsequent_forecasting_ability"}, {"score": 0.003983334573043943, "phrase": "sarbanes-oxley_act"}, {"score": 0.0038499929374478125, "phrase": "information_system"}, {"score": 0.003614044704141927, "phrase": "internal_controls"}, {"score": 0.0035616743422949766, "phrase": "financial_reporting_component"}, {"score": 0.0035100601949451028, "phrase": "firm's_management_information_systems"}, {"score": 0.003376037544631762, "phrase": "management_forecasts"}, {"score": 0.0026337482179592422, "phrase": "forecast_accuracy"}, {"score": 0.0024963543716522087, "phrase": "data_processing_integrity"}, {"score": 0.002331781764406665, "phrase": "management_information_system"}, {"score": 0.0021569129153653777, "phrase": "complementary_nature"}, {"score": 0.0021049977753042253, "phrase": "information_and_systems_quality_literature"}], "paper_keywords": ["Sarbanes-Oxley", " internal controls", " information quality", " management forecast"], "paper_abstract": "In this article, the association between the strength of information technology controls over management information systems and the subsequent forecasting ability of the information produced by those systems is investigated. The Sarbanes-Oxley Act of 2002 highlights the importance of information system controls by requiring management and auditors to report on the effectiveness of internal controls over the financial reporting component of the firm's management information systems. We hypothesize and find evidence that management forecasts are less accurate for firms with information technology material weaknesses in their financial reporting system than the forecasts for firms that do not have information technology material weaknesses. In addition, we examine three dimensions of information technology material weaknesses: data processing integrity, system access and security, and system structure and usage. We find that the association with forecast accuracy appears to be strongest for IT control weaknesses most directly related to data processing integrity. Our results support the contention that information technology controls, as apart of the management information system, affect the quality of the information produced by the system. We discuss the complementary nature of our findings to the information and systems quality literature.", "paper_title": "THE CONSEQUENCES OF INFORMATION TECHNOLOGY CONTROL WEAKNESSES ON MANAGEMENT INFORMATION SYSTEMS: THE CASE OF SARBANES-OXLEY INTERNAL CONTROL REPORTS", "paper_id": "WOS:000300480200012"}