{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "complex_adaptive_systems"}, {"score": 0.004614483128885678, "phrase": "spatial_data_infrastructures"}, {"score": 0.00450368324850566, "phrase": "real_forces"}, {"score": 0.004049257973730703, "phrase": "proper_theory"}, {"score": 0.0039280214778273925, "phrase": "new_approach"}, {"score": 0.003384262486955773, "phrase": "feedback_loop_mechanism"}, {"score": 0.0033433365160336842, "phrase": "initial_conditions"}, {"score": 0.0031845592902036493, "phrase": "netherlands"}, {"score": 0.003165310335160479, "phrase": "australia"}, {"score": 0.0031460336914213402, "phrase": "poland"}, {"score": 0.0030610130156108833, "phrase": "cas_features"}, {"score": 0.0029874020705125356, "phrase": "internet_survey"}, {"score": 0.002969276778056666, "phrase": "sdi_experts"}, {"score": 0.0027939468213968683, "phrase": "explorative_study"}, {"score": 0.0026050445177883005, "phrase": "similar_way"}, {"score": 0.0025501219226203515, "phrase": "significant_implications"}, {"score": 0.0024288830311280573, "phrase": "key_factors"}, {"score": 0.002399482671479507, "phrase": "sdi_functioning"}, {"score": 0.002278440725193305, "phrase": "assessment_techniques"}, {"score": 0.0022440136394950632, "phrase": "predictable_systems"}, {"score": 0.0022033855800303623, "phrase": "complex_and_adaptive_systems"}, {"score": 0.0021700901058417602, "phrase": "future_studies"}, {"score": 0.0021307975800397816, "phrase": "sdi_assessment_framework"}, {"score": 0.0021049977753042253, "phrase": "complex_and_adaptive_nature"}], "paper_keywords": ["spatial data infrastructures", " complex adaptive systems", " SDI assessment"], "paper_abstract": "Many researchers throughout the world have been struggling to better understand and describe spatial data infrastructures (SDIs). Our knowledge of the real forces and mechanisms behind SDIs is still very limited. The reason for this difficulty might lie in the complex, dynamic and multifaceted nature of SDIs. To evaluate the functioning and effects of SDIs we must have a proper theory and understanding of their nature. This article describes a new approach to understanding SDIs by looking at them through the lens of complex adaptive systems (CASs). CASs are frequently described by the following features and behaviours: complexity, components, self-organization, openness, unpredictability, nonlinearity and adaptability, scale-independence, existence of feedback loop mechanism and sensitivity to initial conditions. In this article both CAS and SDI features are presented, examined and compared using three National SDI case studies from the Netherlands, Australia and Poland. These three National SDIs were carefully analysed to identify CAS features and behaviours. In addition, an Internet survey of SDI experts was carried out to gauge the degree to which they consider SDIs and CASs to be similar. This explorative study provides evidence that to a certain extent SDIs can be viewed as CASs because they have many features in common and behave in a similar way. Studying SDIs as CASs has significant implications for our understanding of SDIs. It will help us to identify and better understand the key factors and conditions for SDI functioning. Assuming that SDIs behave much like CASs, this also has implications for their assessment: assessment techniques typical for linear and predictable systems may not be valid for complex and adaptive systems. This implies that future studies on the development of an SDI assessment framework must consider the complex and adaptive nature of SDIs.", "paper_title": "Spatial data infrastructures as complex adaptive systems", "paper_id": "WOS:000275390800007"}