{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "peer_database_network"}, {"score": 0.030681804342544482, "phrase": "concurrent_transactions"}, {"score": 0.00529881096125774, "phrase": "consistent_execution_view"}, {"score": 0.0051304250152070805, "phrase": "global_transaction_coordinator"}, {"score": 0.0046834372388970405, "phrase": "transaction_processing_mechanism"}, {"score": 0.004370087541308677, "phrase": "autonomous_data_sources"}, {"score": 0.0043449924135121895, "phrase": "consistent_execution"}, {"score": 0.004172874316207784, "phrase": "conventional_database_management_system"}, {"score": 0.0041154571996523505, "phrase": "inter-operability_layer"}, {"score": 0.0036328561748082138, "phrase": "related_data"}, {"score": 0.0032968474833776906, "phrase": "data-level_mappings"}, {"score": 0.0032066653632708965, "phrase": "data_heterogeneity"}, {"score": 0.0031333949463567554, "phrase": "transaction_processing"}, {"score": 0.002652878591019016, "phrase": "different_peers"}, {"score": 0.0026163210719740847, "phrase": "different_execution_views"}, {"score": 0.0024636239664210433, "phrase": "potential_problems"}, {"score": 0.0022563011263787847, "phrase": "correctness_criteria"}, {"score": 0.0021945194903838132, "phrase": "merged_transactions"}, {"score": 0.002174303519062047, "phrase": "otm"}], "paper_keywords": ["Peer-to-peer", " Transaction processing", " Data sharing", " Database"], "paper_abstract": "This paper investigates a transaction processing mechanism in a peer to peer database network. A peer to peer database network is a collection of autonomous data sources, called peers, where each peer augments a conventional database management system with an inter-operability layer (i.e. mappings) for sharing data. In this network, each peer independently manages its database and executes queries as well as updates over the related data in other peers. In this paper, we consider a peer to peer database network where mappings between peers are established through data-level mappings for sharing data and resolving data heterogeneity. With regards to transaction processing in a peer to peer database network, we mainly focus on how to maintain a consistent execution view of concurrent transactions in peers without a global transaction coordinator. Since there is no global transaction coordinator and each peer executes concurrent transactions independently, different peers may produce different execution views for the same set of transactions. For this purpose, we investigate potential problems that arise when maintaining a consistent execution of concurrent transactions. In order to guarantee consistent execution, we introduce a correctness criteria and propose two approaches, namely Merged Transactions and OTM based propagation. We assume that one single peer initiates the concurrent transactions. We also present a solution for ensuring the consistent execution view of concurrent transactions considering the failures of transactions. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Transaction processing in a peer to peer database network", "paper_id": "WOS:000289016000001"}