{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "production_systems"}, {"score": 0.04410542580519602, "phrase": "lawley"}, {"score": 0.04191165799288373, "phrase": "unreliable_resources"}, {"score": 0.034012312611945685, "phrase": "supervisory_controllers"}, {"score": 0.0300058283536059, "phrase": "resource_failures"}, {"score": 0.004778594263962987, "phrase": "supervisory_control"}, {"score": 0.004742511243894382, "phrase": "deadlock-free_resource_allocation"}, {"score": 0.004671156704912419, "phrase": "active_area"}, {"score": 0.004635881163634672, "phrase": "manufacturing_systems_research"}, {"score": 0.004497410940849537, "phrase": "allocated_resources"}, {"score": 0.003923532450854754, "phrase": "production_research"}, {"score": 0.003706511543510185, "phrase": "sulistyono"}, {"score": 0.0035550029054401016, "phrase": "manufacturing_systems"}, {"score": 0.003501452436803395, "phrase": "ieee_transactions"}, {"score": 0.0032578629307203097, "phrase": "single_unreliable_resource"}, {"score": 0.0031845067058084583, "phrase": "robust_deadlock-free_operation"}, {"score": 0.0031246358910995316, "phrase": "resource_failure"}, {"score": 0.002555040841339798, "phrase": "failed_resources"}, {"score": 0.00233240715947344, "phrase": "feasible_initial_states"}], "paper_keywords": ["deadlock avoidance", " robust supervisory control", " flexible manufacturing systems"], "paper_abstract": "Supervisory control for deadlock-free resource allocation has been an active area of manufacturing systems research. To date, most work assumes that allocated resources do not fail. Little research has addressed allocating resources that may fail. In our previous work (Lawley, M., 2002. Control of deadlock and blocking for production systems with unreliable resources. International Journal of Production Research, 40 (17), 4563-4582; Lawley, M. and Sulistyono, W., 2002. Robust supervisory control policies for manufacturing systems with unreliable resources. IEEE Transactions on Robotics and Automation, 18 (3), 346-359), we assumed a single unreliable resource and developed supervisory controllers to ensure robust deadlock-free operation in the event of resource failure. In this article, we assume that several unreliable resources may fail simultaneously. In this case, the controller must guarantee that a set of resource failures does not propagate through blocking to stall other portions of the system. That is, it must ensure that every part type not requiring any of the failed resources should continue to produce smoothly without disruption. To do this, the controller must constrain the system to states that serve as feasible initial states for (i) a reduced system when resource failures occur and (ii) an upgraded system when failed resources are repaired. We develop the properties that such a controller must possess and then develop supervisory controllers that satisfy these properties.", "paper_title": "Resource failure and blockage control for production systems", "paper_id": "WOS:000287695000004"}