{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "string_similarity"}, {"score": 0.004771196027464407, "phrase": "entity_aliases"}, {"score": 0.004558289038745564, "phrase": "vital_role"}, {"score": 0.004160435626849478, "phrase": "real_identities"}, {"score": 0.0039027036493682887, "phrase": "close_attention"}, {"score": 0.0032955848190195343, "phrase": "pair-wise_comparison"}, {"score": 0.00325069754015951, "phrase": "subset-based_method"}, {"score": 0.0031339552246625463, "phrase": "entity_subsets"}, {"score": 0.003091262582401731, "phrase": "active_learning_classifier"}, {"score": 0.0030076088903023034, "phrase": "entity_subset"}, {"score": 0.0022136780933978612, "phrase": "new_active_learning_classifier"}, {"score": 0.002163600705898299, "phrase": "existing_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Alias detection", " Entity subset", " Active learning", " Supervised classification"], "paper_abstract": "Entity aliases commonly exist. Accurately detecting these aliases plays a vital role in various applications. In particular, it is critical to detect the aliases that are intentionally hidden from the real identities, such as those of terrorists and frauds. Most existing work does not pay close attention to the aliases that have low/no string similarity to the given entities. In this paper, we propose a classifier that is based on active learning for detecting this type of aliasing. To minimize the cost of pair-wise comparison, a subset-based method is designed to restrict the selection within entity subsets. An active learning classifier is then employed in each entity subset to find the probability of whether a candidate is the alias of a given entity within the subset. After all of the results from the classifier are integrated, a list of aliases is returned for each given entity. For evaluation, we implemented four state-of-the-art methods and compared them with our proposed approach on three datasets. The results clearly demonstrate that this new active learning classifier is superior to those existing methods. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Toward detection of aliases without string similarity", "paper_id": "WOS:000331689700005"}