{"auto_keywords": [{"score": 0.04491277859602561, "phrase": "hybrid_trapdoor_commitments"}, {"score": 0.043891862951523725, "phrase": "mixed_commitments"}, {"score": 0.007972083328629883, "phrase": "sole_assumption"}, {"score": 0.00662484808264344, "phrase": "springer-verlag"}, {"score": 0.00481495049065317, "phrase": "zero-knowledge_proof_systems"}, {"score": 0.004715109042114676, "phrase": "hybrid_trapdoor_commitment_schemes"}, {"score": 0.0046589847106386605, "phrase": "hybrid_trapdoor_commitment_scheme"}, {"score": 0.004414542249381157, "phrase": "commitment_parameters"}, {"score": 0.0041454540442545885, "phrase": "damgard"}, {"score": 0.004120728093422925, "phrase": "nielsen"}, {"score": 0.003987126862293129, "phrase": "polynomially_trapdoor_commitments"}, {"score": 0.00396330930564811, "phrase": "unconditionally_binding_commitments"}, {"score": 0.0038694478796567353, "phrase": "extractable_commitments"}, {"score": 0.0037778009042360758, "phrase": "strong_notions"}, {"score": 0.003732791585248997, "phrase": "simulation_sound"}, {"score": 0.0035901685646972585, "phrase": "one-way_functions"}, {"score": 0.00353677092936782, "phrase": "efficient_constructions"}, {"score": 0.0035051129798529, "phrase": "standard_number-theoretic_assumptions"}, {"score": 0.0033011569787033297, "phrase": "stronger_theoretical_assumptions"}, {"score": 0.0031277316566463978, "phrase": "concurrent_and_simulation-sound_zero-knowledge_proof_systems"}, {"score": 0.002841545331522694, "phrase": "simulation-sound_trapdoor_commitments"}, {"score": 0.0027328817607818207, "phrase": "springerverlag"}, {"score": 0.0026521229155782654, "phrase": "r._gennaro"}, {"score": 0.0026362590493392785, "phrase": "multi-trapdoor_commitments"}, {"score": 0.0024384399939984163, "phrase": "lecture_notes_in_computer_science"}, {"score": 0.0023033100935570755, "phrase": "common_reference_string_model"}, {"score": 0.0022419349154472806, "phrase": "general_constructions"}, {"score": 0.002143247921132179, "phrase": "number-theoretic_assumptions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["commitment schemes", " zero-knowledge proofs"], "paper_abstract": "We introduce the notion of hybrid trapdoor commitment schemes. Intuitively a hybrid trapdoor commitment scheme is a primitive which can be either an unconditionally binding commitment scheme or a trapdoor commitment scheme depending on the distribution of commitment parameters. Moreover, such two possible distributions are computationally indistinguishable. Hybrid trapdoor commitments are related but different with respect to mixed commitments (introduced by Damgard and Nielsen at Crypto 2002). In particular hybrid trapdoor commitments can either be polynomially trapdoor commitments or unconditionally binding commitments, while mixed commitments can be either trapdoor commitments or extractable commitments. In this paper we show that strong notions (e.g., simulation sound, multi-trapdoor) of hybrid trapdoor commitments admit constructions based on the sole assumption that one-way functions exist as well as efficient constructions based on standard number-theoretic assumptions. To further stress the difference between hybrid and mixed commitments, we remark here that mixed commitments seem to require stronger theoretical assumptions (and the known number-theoretic construction,. are less efficient). Our main result, is to show how to construct concurrent and simulation-sound zero-knowledge proof systems (in contrast to the arguments recently presented in [I. Damgard, Efficient concurrent zero-knowledge in the auxiliary string model, in: Advances n Cryptology - Eurocrypt'00, in: Lecture Notes in Computer Science, vol. 1807, Springer-Verlag, 2000, pp. 418-430; P. MacKer zie, K. Yang, On simulation-sound trapdoor commitments, in: Advances in Cryptology - Eurocrypt'04, in: Lecture Notes in Computer Science, vol. 3027, SpringerVerlag, 2004, pp. 382-400; R. Gennaro, Multi-trapdoor commitments and their applications to proofs of knowledge secure under concurrent man-in-the-middle attacks, in: Advances in Cryptology - Crypto'04, in: Lecture Notes in Computer Science, vol. 3152, Springer-Verlag, 2004, pp. 220-236]) in the common reference string model. We crucially use hybrid trapdoor commitments since we present general constructions based on the sole assumption that one-way functions exist and very efficient constructions based on number-theoretic assumptions. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Hybrid commitments and their applications to zero-knowledge proof systems", "paper_id": "WOS:000246170000020"}