{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gaussian-hermite_moments"}, {"score": 0.02029712278825925, "phrase": "orthogonal_moments"}, {"score": 0.010548253458455899, "phrase": "geometric_moment_invariants"}, {"score": 0.007905999704809291, "phrase": "hermite_polynomials"}, {"score": 0.007739578049303575, "phrase": "rotation_invariants"}, {"score": 0.006874052124916372, "phrase": "geometric_moments"}, {"score": 0.004684633969993391, "phrase": "image_analysis"}, {"score": 0.004656154865460475, "phrase": "pattern_recognition"}, {"score": 0.004516323676817212, "phrase": "flusser"}, {"score": 0.00442093689661089, "phrase": "independent_and_complete_set"}, {"score": 0.004096353910862841, "phrase": "useful_tools"}, {"score": 0.004071436484098846, "phrase": "image_representation"}, {"score": 0.003913112416104065, "phrase": "interesting_subject"}, {"score": 0.0036367606686493227, "phrase": "gaussian-hermite"}, {"score": 0.003288255061396602, "phrase": "conventional_methods"}, {"score": 0.0032582736131450316, "phrase": "orthogonal_moment_invariants"}, {"score": 0.003228564642402843, "phrase": "image_normalization"}, {"score": 0.003160289566495475, "phrase": "linear_combination"}, {"score": 0.003000411392166266, "phrase": "identical_forms"}, {"score": 0.002805422862625723, "phrase": "translation_invariants"}, {"score": 0.002737695457580011, "phrase": "coordinate_origin"}, {"score": 0.0027127202051739608, "phrase": "image_centroid"}, {"score": 0.0024751319658027765, "phrase": "transformed_gray-level_images"}, {"score": 0.0024227511485666697, "phrase": "proposed_invariant_descriptors"}, {"score": 0.0023787343905076024, "phrase": "noise-free_and_noisy_conditions"}, {"score": 0.002230864807344675, "phrase": "better_performance"}, {"score": 0.002210502984649107, "phrase": "gaussian-hermite_invariants"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Orthogonal polynomials", " Gaussian-Hermite moments", " Moment invariants", " Rotation and translation invariants"], "paper_abstract": "Geometric moment invariants are widely used in many fields of image analysis and pattern recognition since their first introduction by Hu in 1962. A few years ago, Flusser has proved how to find the independent and complete set of geometric moment invariants corresponding to a given order. On the other hand, the properties of orthogonal moments show that they can be recognized as useful tools for image representation and reconstruction. Therefore, derivation of invariants from orthogonal moments becomes an interesting subject and some results have been reported in literature. In this paper, we propose to use a family of orthogonal moments, called Gaussian-Hermite moments and defined with Hermite polynomials, for deriving their corresponding invariants. The rotation invariants of Gaussian-Hermite moments can be achieved algebraically according to a property of Hermite polynomials. This approach is definitely different from the conventional methods which derive orthogonal moment invariants either by image normalization or by an expression as a linear combination of the invariants of geometric moments. One significant conclusion drawn is that the rotation invariants of Gaussian-Hermite moments have the identical forms to those of geometric moments. This coincidence is also proved mathematically in the appendix of the paper. Moreover, the translation invariants could be easily constructed by translating the coordinate origin to the image centroid. The invariants of Gaussian-Hermite moments both to rotation and to translation are accomplished by the combination of these two kinds of invariants. Their rotational and translational invariance is evaluated by a set of transformed gray-level images. The numeric stabilities of the proposed invariant descriptors are also discussed under both noise-free and noisy conditions. The computational complexity and time for implementing such invariants are analyzed as well. In addition to this, the better performance of the Gaussian-Hermite invariants is experimentally demonstrated by pattern matching in comparison with geometric moment invariants. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Rotation and translation invariants of Gaussian-Hermite moments", "paper_id": "WOS:000291771100007"}