{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "design_patterns"}, {"score": 0.004578165674080246, "phrase": "flexible_problem"}, {"score": 0.004507667881645218, "phrase": "dynamic_world"}, {"score": 0.00440394242852293, "phrase": "technology_changes"}, {"score": 0.00436989807912238, "phrase": "complexity_increases"}, {"score": 0.004336115760817672, "phrase": "increased_efficiency"}, {"score": 0.0037125240439927114, "phrase": "design_solutions"}, {"score": 0.003627028894710926, "phrase": "specific_domain"}, {"score": 0.0032786537599187125, "phrase": "generic_theory-based_transfer"}, {"score": 0.003093054709625219, "phrase": "design_efficiency"}, {"score": 0.0028729252198422825, "phrase": "specific_added_value"}, {"score": 0.002763415176377921, "phrase": "design_skills"}, {"score": 0.002742017872865778, "phrase": "domain_knowledge"}, {"score": 0.002617059777997427, "phrase": "cognitive_load"}, {"score": 0.0025967927629150715, "phrase": "cognitive_learning_processes"}, {"score": 0.0022576249214220187, "phrase": "computer-based_teaching"}, {"score": 0.002205560249972527, "phrase": "potential_support_tool"}, {"score": 0.002154693685426657, "phrase": "pattern_languages"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Design patterns", " Cognitive load", " Design skills", " Learning efficiency", " Expertise reversal effect"], "paper_abstract": "Nowadays we need to teach students how to become flexible problem solvers in a dynamic world. The pace in which technology changes and complexity increases requires increased efficiency in learning and understanding. This requires the engineers of tomorrow to quickly gain knowledge and insight outside their prime area of expertise. To transfer practical, how-to knowledge, to re-use design solutions and to teach students design solutions in the context of a specific domain, design patterns can be used. Design patterns offer a way to transfer knowledge that is more practical and 'ready for use' than a generic theory-based transfer of knowledge. However, the advantage of design patterns might go beyond re-use, design efficiency and flexibility. This paper argues that in addition to the benefits described above, there is a specific added value for the use of design patterns by students to acquire design skills and domain knowledge. To analyze this proposition we will analyze the literature on cognitive load and cognitive learning processes, and relate this to experiences from three case studies in which novices and experts were offered design patterns to develop and implement systems and processes. We will reflect on implications of the use of design patterns in computer-based teaching as well as on a potential support tool to improve the accessibility of pattern languages. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Cognitive learning efficiency through the use of design patterns in teaching", "paper_id": "WOS:000275220700005"}