{"auto_keywords": [{"score": 0.03994869299943247, "phrase": "basic_versions"}, {"score": 0.03963215824845641, "phrase": "bbo"}, {"score": 0.015719588352598665, "phrase": "evolutionary_algorithms"}, {"score": 0.011804144401249538, "phrase": "ga"}, {"score": 0.009811614379049653, "phrase": "advanced_versions"}, {"score": 0.004677711903652145, "phrase": "fast_and_robust_computation_methods"}, {"score": 0.004271234971981848, "phrase": "genetic_algorithm"}, {"score": 0.0039649719120779066, "phrase": "particle_swarm"}, {"score": 0.0036806198670157595, "phrase": "pso"}, {"score": 0.0035755653799043, "phrase": "global_uniform_recombination"}, {"score": 0.0033883824438527316, "phrase": "biological_motivations"}, {"score": 0.003360464999544279, "phrase": "implementation_details"}, {"score": 0.0032109670662222416, "phrase": "ea_research"}, {"score": 0.002778006389296707, "phrase": "real-world_continuous_optimization_problems"}, {"score": 0.0022773309395419427, "phrase": "conceptual_equivalence"}, {"score": 0.002184943946549964, "phrase": "algorithmic_modifications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Evolutionary algorithms", " Genetic algorithm", " Biogeography-based optimization", " Differential evolution", " Evolution strategy", " Particle swarm optimization"], "paper_abstract": "Evolutionary algorithms (EAs) are fast and robust computation methods for global optimization, and have been widely used in many real-world applications. We first conceptually discuss the equivalences of various popular EAs including genetic algorithm (GA), biogeography-based optimization (BBO), differential evolution (DE), evolution strategy (ES) and particle swarm optimization (PSO). We find that the basic versions of BBO, DE, ES and PSO are equal to the GA with global uniform recombination (GA/GUR) under certain conditions. Then we discuss their differences based on biological motivations and implementation details, and point out that their distinctions enhance the diversity of EA research and applications. To further study the characteristics of various EAs, we compare the basic versions and advanced versions of GA, BBO, DE, ES and PSO to explore their optimization ability on a set of real-world continuous optimization problems. Empirical results show that among the basic versions of the algorithms, BBO performs best on the benchmarks that we studied. Among the advanced versions of the algorithms, DE and ES perform best on the benchmarks that we studied. However, our main conclusion is that the conceptual equivalence of the algorithms is supported by the fact that algorithmic modifications result in very different performance levels. (C) 2013 Elsevier Ltd. All fights reserved.", "paper_title": "On the equivalences and differences of evolutionary algorithms", "paper_id": "WOS:000326904500013"}