{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "novel_public_health_information_exchange"}, {"score": 0.004666228956744244, "phrase": "hiv-related_outcomes"}, {"score": 0.004486741056531641, "phrase": "hiv-infected_individuals"}, {"score": 0.004104944397138138, "phrase": "multi-geographical_idn"}, {"score": 0.004072851768196397, "phrase": "louisiana_public_health_authority"}, {"score": 0.004019918396263479, "phrase": "high_proportion"}, {"score": 0.0038854765143440965, "phrase": "real-time_provider_alerts"}, {"score": 0.003855093052725243, "phrase": "hiv-infected_person"}, {"score": 0.0036873373225096624, "phrase": "non-hiv_care"}, {"score": 0.0036584981135988435, "phrase": "idn"}, {"score": 0.003629882559085245, "phrase": "immediate_linkage"}, {"score": 0.003610929883213109, "phrase": "hiv_specialty_care"}, {"score": 0.0035361001070845677, "phrase": "system's_implementation"}, {"score": 0.0034901182546029346, "phrase": "case-cohort_approach"}, {"score": 0.0033469428631415807, "phrase": "-care_controls"}, {"score": 0.002771754731852373, "phrase": "median_time"}, {"score": 0.002678944072162297, "phrase": "laphie_identification"}, {"score": 0.0024060573724654553, "phrase": "information_exchange"}, {"score": 0.0023072505282428117, "phrase": "care_hiv-infected_persons"}, {"score": 0.0022241213593294164, "phrase": "significant_improvements"}, {"score": 0.0022124922742064947, "phrase": "hiv-related_utilization_and_disease_progression_indices"}, {"score": 0.0021665794900241056, "phrase": "innovative_strategy"}, {"score": 0.0021496083700137305, "phrase": "hiv_care"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Public health informatics", " Healthcare information technology", " HIV"], "paper_abstract": "Purpose: The purpose of this study was to evaluate HIV-related outcomes associated with use of a novel public health information exchange that was designed to identify out of care HIV-infected individuals seen within a large, integrated delivery network (IDN). Methods: A novel, secure, bidirectional health care delivery-public health information exchange, the Louisiana Public Health Information Exchange (LaPHIE) was developed between a multi-geographical IDN and the Louisiana public health authority in response to the high proportion of out of care HIV-infected persons. The system provides real-time provider alerts when any HIV-infected person who has not had CD4 or HIV viral load (VL) monitoring in >1 year receives non-HIV care within the IDN, allowing immediate linkage to HIV specialty care. Persons identified over the first 30 months of the system's implementation were characterized using a case-cohort approach to compare out-of-care individuals with randomly sampled, time-matched in-care controls. Results: Between 2/1/09 and 7/31/11, 549 alerts identified 419 unduplicated HIV-infected individuals without a CD4 count or VL in >1 year. Patients were identified at 60 clinics and alerts shown to 223 clinicians in 7 participating facilities. A quarter (24%) of those identified had not had a CD4 count or VL conducted since their initial diagnosis. Of the remaining 76% who had been in care previously, over half (55%) had been out of care for >= 18 months, with a median time of 19.4 months [IQR 15.0-32.5] since their previous visit. Following LaPHIE identification, 42% had CD4 counts <200 cells/mm(3) and 62% had VL >10,000 RNA copies/mL. Of the 344 patients with at least 6 months of follow up, 85% had at least one CD4 and/or VL test after being identified. Conclusions: The results of this study demonstrate that an information exchange can effectively facilitate engagement, re-engagement, and retention of out-of care HIV-infected persons in HIV specialty care. Within two years, we were able to observe significant improvements in HIV-related utilization and disease progression indices. Future programs should consider adopting this innovative strategy to improve HIV care at both the individual and population levels. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Improved HIV-related outcomes associated with implementation of a novel public health information exchange", "paper_id": "WOS:000308976000004"}