{"auto_keywords": [{"score": 0.004360412703519539, "phrase": "mach-zehnder_intensity"}, {"score": 0.003883851790254319, "phrase": "mzm"}, {"score": 0.0036958398682001015, "phrase": "optical_pulse_train"}, {"score": 0.0031150035760241705, "phrase": "extinction_ratio"}, {"score": 0.002915437843874821, "phrase": "rz-bpsk_transmission"}, {"score": 0.0025537472239953807, "phrase": "receiving_power_sensitivity"}, {"score": 0.0024842242921857705, "phrase": "requested_bit_error_rate"}, {"score": 0.0023900527169254744, "phrase": "dc_bias"}, {"score": 0.0023507916951658455, "phrase": "bpsk_demodulator"}, {"score": 0.0021879624017959493, "phrase": "power_penalty"}, {"score": 0.0021049977753042253, "phrase": "back-to-back_case"}], "paper_keywords": ["40 GHz", " DFBLD-MZM", " Optoelectronic feedback loop", " RZ-BPSK", " Self-started pulsation"], "paper_abstract": "A self-starting pulsed encoding of a Mach-Zehnder intensity modulator (MZM) is demonstrated to generate a 40 Gbit/s return-to-zero binary phase-shifted-keying (RZ-BPSK) data stream by using the optoelectronic feedback loop. By driving the MZM with an optoelectronic oscillator, both the electrical clock and the optical pulse train at 40 GHz can be extracted to deliver and trigger the synthesizer-free 40 Gbit/s RZ-BPSK data. The pulsed RZ carrier with a pulsewidth of 10.5 ps provides a jitter as low as 150 fs and an extinction ratio as high as 7.8 dB, which is particularly suitable for the RZ-BPSK transmission at 40 Gbit/s. The back-to-back transmitted synthesizer-free 40 Gbit/s RZ-BPSK data with a pattern length of 2(23) - 1 reveals a receiving power sensitivity of -16.3 dBm at the requested bit error rate of 10(-9) by setting the DC bias of the BPSK demodulator at 3.76 V. After 25 km single-mode-fiber transmission, the RZ-BPSK data indicates a power penalty of 4 dB when compared with the back-to-back case.", "paper_title": "40 Gbit/s Pulsed RZ-BPSK Transmission With a 40 GHz Self-Pulsated Distributed Feedback Laser Diode Mach-Zehnder Intensity Modulator Link", "paper_id": "WOS:000338924800003"}