{"auto_keywords": [{"score": 0.047262804125856143, "phrase": "wikipedia"}, {"score": 0.008652059368240036, "phrase": "wikipedia_editors"}, {"score": 0.007560431257278662, "phrase": "external_sources"}, {"score": 0.005549199689121776, "phrase": "participatory_encyclopaedia"}, {"score": 0.00481495049065317, "phrase": "everyday_life"}, {"score": 0.00456448259718331, "phrase": "trustworthy_knowledge_claims"}, {"score": 0.004420472010542188, "phrase": "everyday_practices"}, {"score": 0.003944112858235306, "phrase": "online_ethnography"}, {"score": 0.003819599991449801, "phrase": "sociotechnical_resources"}, {"score": 0.003633652174971415, "phrase": "web_documents"}, {"score": 0.003395640013786862, "phrase": "science_and_technology_studies"}, {"score": 0.0033356305227059072, "phrase": "findings_-_wikipedia"}, {"score": 0.0032418062548293745, "phrase": "knowledge_construction"}, {"score": 0.003007846011394511, "phrase": "established_media"}, {"score": 0.002830839166653185, "phrase": "obligatory_passage_point"}, {"score": 0.0027413748388534025, "phrase": "active_wikipedia_editors"}, {"score": 0.002454258761940649, "phrase": "innovative_understanding"}, {"score": 0.0024281181691350085, "phrase": "knowledge_construction_culture"}, {"score": 0.0021049977753042253, "phrase": "information_literacy_training"}], "paper_keywords": ["Wikipedia", " Credibility", " Science and technology studies (STS)", " Online ethnography", " Knowledge management", " Information", " Web sites"], "paper_abstract": "Purpose - The aim of this paper is to explore how trustworthy knowledge claims in Wikipedia are constructed by focusing on the everyday practices of Wikipedia editors. The paper seeks to focus particularly on the role of references to external sources for the stabilisation of knowledge in Wikipedia. Design/methodology/approach - The study is inspired by online ethnography. It includes 11 Wikipedia editors, together with the sociotechnical resources in Wikipedia. The material was collected through interviews, online observations, web documents and discussions, and e-mail questions. The analysis was carried out from a perspective of science and technology studies (STS). Findings - Wikipedia can be regarded as a laboratory for knowledge construction in which the already published is being recycled. The references to external sources anchor the participatory encyclopaedia in the ecology of established media and attribute trust to the knowledge published. The policy on Verifiability is analysed as an obligatory passage point to which all actors have to adjust. Active Wikipedia editors can be seen as being akin to janitors of knowledge, as they are those who, through their hands-on activities, keep Wikipedia stable. Originality/value - The study develops an innovative understanding of the knowledge construction culture in one of the most popular sources for information on the internet. By highlighting the ways in which trust is established in Wikipedia, a more reflexive use of the participatory encyclopaedia is made possible. This is of value for information literacy training.", "paper_title": "Janitors of knowledge: constructing knowledge in the everyday life of Wikipedia editors", "paper_id": "WOS:000296598600006"}