{"auto_keywords": [{"score": 0.04957891638694611, "phrase": "process_performance"}, {"score": 0.040802461081561964, "phrase": "formal_and_informal_controls"}, {"score": 0.00481495049065317, "phrase": "formal_and_informal_control"}, {"score": 0.004411406624893529, "phrase": "poor_process_performance"}, {"score": 0.003768028741967194, "phrase": "key_risks"}, {"score": 0.0036002125374696237, "phrase": "control_stream"}, {"score": 0.0033330104902937413, "phrase": "obvious_question"}, {"score": 0.003151184191185831, "phrase": "particular_risks"}, {"score": 0.0029688173975648173, "phrase": "research_model"}, {"score": 0.0027970605347908046, "phrase": "china"}, {"score": 0.0027483472371835865, "phrase": "moderating_effects"}, {"score": 0.002729133029776093, "phrase": "requirements_risk"}, {"score": 0.0027100527874262446, "phrase": "user_risk"}, {"score": 0.0024999636244840647, "phrase": "current_state"}, {"score": 0.0022660100755784057, "phrase": "positive_influence"}, {"score": 0.002195552442011313, "phrase": "solid_controls"}, {"score": 0.0021049977753042253, "phrase": "good_process_performance"}], "paper_keywords": ["IT project management", " formal and informal controls", " requirements risk", " user risk", " process performance"], "paper_abstract": "Improving the management of information technology (IT) projects is of prime concern to both IS researchers and practitioners, as IT projects are notorious for poor process performance, frequently running over budget and behind schedule. Over the years, at least two separate streams of research have emerged with the aim of contributing to our understanding of IT project management. One of these focuses on the exercise of formal and informal controls, while another focuses on identifying and managing key risks such as those associated with requirements and users. Proponents of the control stream would argue that the exercise of formal and informal controls can improve process performance and there is some evidence that this is so. An obvious question that emerges, however, is how effective these controls are in the presence of particular risks. In this study, we seek to answer this question by developing and testing a research model that integrates these two streams of research. On the basis of data collected from 63 completed IT projects in China, we examine the moderating effects of requirements risk and user risk on the relationship between control (both formal and informal) and the process performance of IT projects. We contribute to the current state of knowledge by clearly demonstrating that both types of risk moderate the effects of formal and informal controls on performance. Specifically, both requirements risk and user risk were found to reduce the positive influence of controls on process performance, implying that implementing solid controls is a necessary, but not sufficient, condition to ensure good process performance.", "paper_title": "How user risk and requirements risk moderate the effects of formal and informal control on the process performance of IT projects", "paper_id": "WOS:000326504000006"}