{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "vcmos"}, {"score": 0.004712065638657606, "phrase": "gm-c"}, {"score": 0.004512814529823301, "phrase": "front-end_ultrasonic_receivers"}, {"score": 0.004392565073466714, "phrase": "bandpass_sigma-delta_modulator"}, {"score": 0.003964007795174772, "phrase": "high_power-efficiency"}, {"score": 0.0036553070575015344, "phrase": "intermediate_frequency"}, {"score": 0.0032278559855285945, "phrase": "dynamic_range"}, {"score": 0.002928399649340438, "phrase": "final_snr"}, {"score": 0.002656650588033728, "phrase": "programming_method"}, {"score": 0.002599763359352916, "phrase": "corresponding_circuit"}, {"score": 0.0025167026017217926, "phrase": "central_frequency"}, {"score": 0.0024231382864800173, "phrase": "different_regions"}, {"score": 0.002258485755625332, "phrase": "dobbler_mode_applications"}, {"score": 0.002222102813520547, "phrase": "effective_facilities"}, {"score": 0.0021745003291048356, "phrase": "valuable_property"}], "paper_keywords": ["ultrasonic-receiver", " analog-to-digital converter (ADC)", " sigma-delta", " bandpass", " programmable", " Gm-C"], "paper_abstract": "A 4th order bandpass sigma-delta modulator for ultrasound applications is presented. By cascading two second-order identical Gm-C bandpass filters, a 4th-order modulator was designed with high power-efficiency, stability, tunability and programmability. The modulator is dedicated for application with intermediate frequency of 3 MHz and bandwidth of 200 kHz. Implemented in a standard 0.18 mu m CMOS technology, the post-layout simulation of the modulator gives a dynamic range of 78 dB. Chip measurements are reported after successfully tuning the modulator to operate at four-time of its folded specifications. The final SNR achieves 58 dB at 0.75 MHz with 50 kHz bandwidth. The modulator consumes 2.5 mW from 1.8 V power supply. Moreover, a programming method is introduced and corresponding circuit is designed to change the central frequency of the modulator between 3 and 20 MHz for scanning different regions of the body. However the 200 kHz bandwidth limits the modulator only for Dobbler mode applications, the effective facilities of programmability are valuable property to expand this application to other wide band applications in future.", "paper_title": "A 1.8 VCMOS fourth-order Gm-C bandpass sigma-delta modulator dedicated to front-end ultrasonic receivers", "paper_id": "WOS:000238267700006"}