{"auto_keywords": [{"score": 0.04869060492148341, "phrase": "background_modeling"}, {"score": 0.0384946458472326, "phrase": "bayes'_rule"}, {"score": 0.03733329838869367, "phrase": "background_likelihood"}, {"score": 0.03708885589993471, "phrase": "foreground_likelihood"}, {"score": 0.004822514805010041, "phrase": "background"}, {"score": 0.004509009676783725, "phrase": "stationary_camera"}, {"score": 0.004270509580123581, "phrase": "background_model"}, {"score": 0.003945037259654532, "phrase": "foreground_model"}, {"score": 0.00372779984173696, "phrase": "logical_endpoint"}, {"score": 0.0034435465205842172, "phrase": "simple_application"}, {"score": 0.0033970336459232834, "phrase": "posterior_probability"}, {"score": 0.0033058779704993727, "phrase": "component_models"}, {"score": 0.0030467824582741557, "phrase": "spatial_neighborhood"}, {"score": 0.002958281631770322, "phrase": "neighboring_pixels"}, {"score": 0.002918304161227186, "phrase": "earlier_pixelwise_models"}, {"score": 0.002827105825163379, "phrase": "joint_domain-range_model"}, {"score": 0.002671263324230699, "phrase": "background_and_foreground_labels"}, {"score": 0.0026531475439267216, "phrase": "previous_frame"}, {"score": 0.002635154295298248, "phrase": "spatial_smoothing"}, {"score": 0.0025412259366265925, "phrase": "current_frame"}, {"score": 0.0024065584090318315, "phrase": "different_ways"}, {"score": 0.0022841883008682985, "phrase": "model_components"}, {"score": 0.0022278779300543548, "phrase": "model_component"}, {"score": 0.0021049977753042253, "phrase": "overall_system"}], "paper_keywords": ["Background modeling", " Motion segmentation", " Surveillance"], "paper_abstract": "In its early implementations, background modeling was a process of building a model for the background of a video with a stationary camera, and identifying pixels that did not conform well to this model. The pixels that were not well-described by the background model were assumed to be moving objects. Many systems today maintain models for the foreground as well as the background, and these models compete to explain the pixels in a video. If the foreground model explains the pixels better, they are considered foreground. Otherwise they are considered background. In this paper, we argue that the logical endpoint of this evolution is to simply use Bayes' rule to classify pixels. In particular, it is essential to have a background likelihood, a foreground likelihood, and a prior at each pixel. A simple application of Bayes' rule then gives a posterior probability over the label. The only remaining question is the quality of the component models: the background likelihood, the foreground likelihood, and the prior. We describe a model for the likelihoods that is built by using not only the past observations at a given pixel location, but by also including observations in a spatial neighborhood around the location. This enables us to model the influence between neighboring pixels and is an improvement over earlier pixelwise models that do not allow for such influence. Although similar in spirit to the joint domain-range model, we show that our model overcomes certain deficiencies in that model. We use a spatially dependent prior for the background and foreground. The background and foreground labels from the previous frame, after spatial smoothing to account for movement of objects, are used to build the prior for the current frame. These components are, by themselves, not novel aspects in background modeling. As we will show, many existing systems account for these aspects in different ways. We argue that separating these components as suggested in this paper yields a very simple and effective model. Our intuitive description also isolates the model components from the classification or inference step. Improvements to each model component can be carried out without any changes to the inference or other components. The various components can hence be modeled effectively and their impact on the overall system understood more easily.", "paper_title": "Background subtraction: separating the modeling and the inference", "paper_id": "WOS:000337091200006"}