{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "prepositional_phrase_attachment"}, {"score": 0.004520132822496416, "phrase": "prepositional_phrase"}, {"score": 0.00436890075128947, "phrase": "four-way_disambiguation_problem"}, {"score": 0.0031231012822640672, "phrase": "supervised_classification_experiments"}, {"score": 0.0027922467043592597, "phrase": "linguistic_diagnostics"}, {"score": 0.00259554612218815, "phrase": "best_method"}, {"score": 0.002545468362709126, "phrase": "four-way_classification"}, {"score": 0.0025207920578878894, "phrase": "potentially_ambiguous_prepositional_phrases"}, {"score": 0.002331781764406665, "phrase": "single_four-way_classification_task"}, {"score": 0.0021569129153653777, "phrase": "two-step_process"}, {"score": 0.0021049977753042253, "phrase": "attachment_site"}], "paper_keywords": [""], "paper_abstract": "In this article we refine the formulation of the problem of prepositional phrase (PP) attachment as a four-way disambiguation problem. We argue that, in interpreting PPs, both knowledge about the site of the attachment (the traditional noun-verb attachment distinction) and the nature Of the attachment (the distinction of arguments from adjuncts) are needed. We introduce a method to learn arguments and adjuncts based on a definition of arguments as a vector of features. In a series of supervised classification experiments, first we explore the features that enable us to learn the distinction between arguments and adjuncts. We find that both linguistic diagnostics of argumenthood and lexical semantic classes are useful. Second, we investigate the best method to reach the four-way classification of potentially ambiguous prepositional phrases. We find that whereas it is overall better to solve the problem as a single four-way classification task, verb arguments are sometimes more precisely identified if the classification is done as a two-step process,first choosing the attachment site and then labeling it as argument or adjunct.", "paper_title": "The notion of argument in prepositional phrase attachment", "paper_id": "WOS:000240734900002"}