{"auto_keywords": [{"score": 0.048313706083567, "phrase": "web_services"}, {"score": 0.005615859630536269, "phrase": "organizational_assimilation"}, {"score": 0.00481495049065317, "phrase": "web_services_technology"}, {"score": 0.004551199992546761, "phrase": "extremely_promising_technology"}, {"score": 0.004301834610818624, "phrase": "information_systems"}, {"score": 0.0037246656582642272, "phrase": "significant_impact"}, {"score": 0.0036324746826127997, "phrase": "information_technology"}, {"score": 0.0026384167183586015, "phrase": "research_framework"}, {"score": 0.0023419588513908783, "phrase": "assimilation_patterns"}, {"score": 0.002172093645267283, "phrase": "proposed_framework"}, {"score": 0.0021049977753042253, "phrase": "research_agenda"}], "paper_keywords": ["enterprise systems integration", " research framework", " organizational assimilation", " Web services", " service-oriented architectures"], "paper_abstract": "Web services is an extremely promising technology that has the potential to revolutionize many aspects of information systems. Web services facilitates vendor-, platform-, and language-independent, loosely coupled, inexpensive integration of both internal and external systems. Although there is a general agreement that Web services will have a significant impact on applications of information technology in organizations, there is a disagreement regarding the speed and spread of assimilation due to a multitude of inhibitors. In this article, we identify 3 areas of assimilation of Web services in organizations: information systems departmental assimilation, intraorganizational assimilation, and interorganizational assimilation. We propose a research framework for investigating various issues related to organizational assimilation of Web services. In addition, we developed a projection of the assimilation patterns for the 3 areas of organizational assimilation of Web services. Based on the proposed framework, we outline a research agenda on the organizational assimilation of Web services.", "paper_title": "Organizational assimilation of web services technology: A research framework", "paper_id": "WOS:000246860800002"}