{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-factory_supply_chain_scheduling"}, {"score": 0.004568525347438891, "phrase": "supply_chain"}, {"score": 0.004525088883501587, "phrase": "interrelated_factories"}, {"score": 0.004034841146538891, "phrase": "good_performance"}, {"score": 0.00386496062825374, "phrase": "jobs_transportation"}, {"score": 0.003791763445590174, "phrase": "also_delivery"}, {"score": 0.0026235360404084137, "phrase": "transportation_cost"}, {"score": 0.002598543802992702, "phrase": "tardiness_cost"}, {"score": 0.002537097217899195, "phrase": "bound_method"}, {"score": 0.0023840346303791032, "phrase": "standalone_heuristic"}, {"score": 0.002316532084420729, "phrase": "upper_bound"}, {"score": 0.0022617389804167943, "phrase": "computational_tests"}, {"score": 0.002166349705365602, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-factory scheduling", " Supply chain", " Batch delivery", " Branch and bound", " Heuristic"], "paper_abstract": "This study addresses the scheduling of supply chain with interrelated factories containing suppliers and manufacturers. These elements of the chain are positioned in series and thus the efficient design of the link among them would insure good performance of the whole. In this paper, jobs transportation among factories and also delivery to the customer can be performed by batch of jobs. The capacity of each batch is limited and the cost per batch delivery is fixed and independent of the number of jobs in the batch. Thus decision should be made on the number of batches, assignment of each job to a batch and also production and delivery scheduling of batches in each factory. The problem scrutinization is on the tradeoff between minimizing transportation cost and tardiness cost. A branch and bound method for solving this problem is presented. A lower bound and a standalone heuristic which is used as an upper bound are also introduced. Computational tests are conducted to evaluate the performance of the proposed method. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A branch and bound method for solving multi-factory supply chain scheduling with batch delivery", "paper_id": "WOS:000344034300020"}