{"auto_keywords": [{"score": 0.04061527582181809, "phrase": "amazon"}, {"score": 0.011707724764083712, "phrase": "library_catalogues"}, {"score": 0.010300817125187683, "phrase": "six_library_catalogues"}, {"score": 0.00481495049065317, "phrase": "new_generation"}, {"score": 0.004289291421348352, "phrase": "online_library_catalogues"}, {"score": 0.0040223714916651845, "phrase": "next_generation_catalogues"}, {"score": 0.003920295222165263, "phrase": "new_tools"}, {"score": 0.003788196352457501, "phrase": "expert_study"}, {"score": 0.003374250301861101, "phrase": "traditional_catalogue"}, {"score": 0.003274499008699115, "phrase": "modernised_catalogues"}, {"score": 0.003177687211289478, "phrase": "\"next_generation_catalogue"}, {"score": 0.0026538960171433985, "phrase": "examined_features"}, {"score": 0.002586457551025025, "phrase": "chosen_set"}, {"score": 0.002564360070426064, "phrase": "tested_catalogues"}, {"score": 0.0024252458095689847, "phrase": "whole_population"}, {"score": 0.0023233800372985686, "phrase": "current_state"}, {"score": 0.002244969789802093, "phrase": "important_issues"}, {"score": 0.0021692000054033956, "phrase": "tabular_outline"}], "paper_keywords": ["libraries", " catalogues", " information retrieval", " communication technologies", " online catalogues"], "paper_abstract": "Purpose - The purpose of this paper is to describe some of the problems and issues faced by online library catalogues. It aims to establish how libraries have undertaken the mission of developing the next generation catalogues and how they compare to new tools such as Amazon. Deign/methodology/approach - An expert study was carried out in January 2008 to evaluate six library catalogues (one traditional and five recently modernised) and compare them to Amazon. Findings - While the traditional catalogue has stayed far behind, the modernised catalogues have taken two different approaches in becoming the \"next generation catalogue\". Two catalogues focused on improving functionality while two others decided to introduce Web/Library 2.0 trends first. At this point, none of the catalogues offer as vast a range of features as Amazon does, but one catalogue managed to surpass Amazon in some of the examined features. Research limitations/implications - The chosen set of tested catalogues may not be representative and we cannot draw conclusions for the whole population of library catalogues. Originality/value - The paper shows the current state of library catalogues and draws attention to some important issues concerning Web 2.0 trends. Features presented in the tabular outline can be used as pointers for further development of library catalogues.", "paper_title": "New generation of catalogues for the new generation of users - A comparison of six library catalogues", "paper_id": "WOS:000258724700004"}