{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "planning"}, {"score": 0.004506968388996092, "phrase": "winning_system"}, {"score": 0.004462494148878735, "phrase": "deterministic_track"}, {"score": 0.00443308765153716, "phrase": "optimal_planners"}, {"score": 0.0042325743185503825, "phrase": "planning_problem"}, {"score": 0.0034363735647539267, "phrase": "satisfiability_approach"}, {"score": 0.0032807941194429235, "phrase": "simple_preferences"}, {"score": 0.003020232503089429, "phrase": "'soft'_goals"}, {"score": 0.0029903851294825023, "phrase": "basic_idea"}, {"score": 0.0029412916164128925, "phrase": "search_space"}, {"score": 0.002921879966280267, "phrase": "possible_plans"}, {"score": 0.002798780784517325, "phrase": "fixed_makespan"}, {"score": 0.002752824177838148, "phrase": "'optimal'_plan"}, {"score": 0.0024842242921857705, "phrase": "optimal_plans"}, {"score": 0.0024434201175883674, "phrase": "considerable_better_quality"}, {"score": 0.0023716501597131024, "phrase": "better_plan"}, {"score": 0.0023481972886024347, "phrase": "soft_goals"}, {"score": 0.002226968099778524, "phrase": "plan_quality"}, {"score": 0.0022049428043454966, "phrase": "sgplan"}, {"score": 0.002154392046210367, "phrase": "'simplepreferences'_category"}], "paper_keywords": ["Planning", " satisfiability", " preferences"], "paper_abstract": "Planning as Satisfiability is one of the most well-known and effective techniques for classical planning: satplan has been the winning system in the deterministic track for optimal planners in the 4th International Planning Competition (IPC) and a cow-inner in the 5th IPC. Given a planning problem Pi and a makespan n, the approach based on satisfiability (a.k.a. SAT-based) simply works by (i) constructing a SAT formula Pi(n) and (ii) checking Pi(n) for satisfiability: if there is a model for Pi(n) then we have found a plan, otherwise n is increased. The approach guarantees that the makespan is optimal, i. e. minimum. In this article we extend the Planning as Satisfiability approach in order to handle preferences and satplan in order to solve problems with simple preferences. This allows, e. g. to take into consideration 'plan quality' issues other than makespan, like number of actions and 'soft' goals. The basic idea is to explore the search space of possible plans in accordance with the given partially ordered preferences. We first prove that, at fixed makespan, our approach returns an 'optimal' plan, if any. Then, considering both classical planning problems and problems coming from IPC-5, we show that satplan extended in order to deal with preferences: (i) returns optimal plans that are often of considerable better quality, i. e. with fewer actions or with a better plan metric on soft goals, than satplan; and (ii) is overall competitive, in terms of plan quality, with SGPLAN, the winning system in the 'SimplePreferences' category of the IPC-5. Notably, such results are often obtained without sacrificing efficiency.", "paper_title": "Introducing Preferences in Planning as Satisfiability", "paper_id": "WOS:000289165700005"}