{"auto_keywords": [{"score": 0.02860414781778371, "phrase": "bin_packing_game"}, {"score": 0.012317486549872459, "phrase": "subset_sum_algorithm"}, {"score": 0.010100225323236857, "phrase": "selfish_agents"}, {"score": 0.008687331638909201, "phrase": "social_cost"}, {"score": 0.007551590929511989, "phrase": "different_bins"}, {"score": 0.005815685607313065, "phrase": "strong_nash_equilibria"}, {"score": 0.005197502394421791, "phrase": "lower_bound_instance"}, {"score": 0.00481495049065317, "phrase": "selfish_bin_packing"}, {"score": 0.0047838119150154824, "phrase": "recent_interest"}, {"score": 0.0047323590206695305, "phrase": "computer_science_problems"}, {"score": 0.0047017520455875025, "phrase": "game_theoretic_setting"}, {"score": 0.004651177631663439, "phrase": "well_known_bin_packing_problem"}, {"score": 0.004435006247087171, "phrase": "used_bin_space"}, {"score": 0.00404095366803036, "phrase": "social_goal"}, {"score": 0.0038033110689987474, "phrase": "pure_nash_equilibrium"}, {"score": 0.0037218565370221, "phrase": "smaller_cost"}, {"score": 0.003665874747419775, "phrase": "different_bin"}, {"score": 0.0035951292118383336, "phrase": "strong_nash_equilibrium"}, {"score": 0.0033544295486106867, "phrase": "subset_profit"}, {"score": 0.003268367644196327, "phrase": "strictly_smaller_cost"}, {"score": 0.003109519872758431, "phrase": "standard_measures"}, {"score": 0.0030494782368868743, "phrase": "worst_case"}, {"score": 0.0029519664912853938, "phrase": "optimal_packing"}, {"score": 0.0029012378668247397, "phrase": "recently_introduced_measures"}, {"score": 0.002766171878646582, "phrase": "nearly_tight_lower_and_upper_bounds"}, {"score": 0.0026718978608934077, "phrase": "previous_result"}, {"score": 0.0026603415891509976, "phrase": "bil"}, {"score": 0.0025641008851554274, "phrase": "strong_nash_equilibrium_iff"}, {"score": 0.002520020763745833, "phrase": "bin_packing"}, {"score": 0.002449997042686432, "phrase": "approximation_ratio"}, {"score": 0.0024078737745407614, "phrase": "almost_tight"}, {"score": 0.0023056996845692355, "phrase": "small_modification"}, {"score": 0.002290751232484371, "phrase": "item_sizes"}, {"score": 0.002137194450679042, "phrase": "polynomial_time_algorithm"}], "paper_keywords": [""], "paper_abstract": "Following recent interest in the study of computer science problems in a game theoretic setting, we consider the well known bin packing problem where the items are controlled by selfish agents. Each agent is charged with a cost according to the fraction of the used bin space its item requires. That is, the cost of the bin is split among the agents, proportionally to their sizes. Thus, the selfish agents prefer their items to be packed in a bin that is as full as possible. The social goal is to minimize the number of the bins used. The social cost in this case is therefore the number of bins used in the packing. A pure Nash equilibrium is a packing where no agent can obtain a smaller cost by unilaterally moving his item to a different bin, while other items remain in their original positions. A Strong Nash equilibrium is a packing where there exists no subset of agents, all agents in which can profit from jointly moving their items to different bins. We say that all agents in a subset profit from moving their items to different bins if all of them have a strictly smaller cost as a result of moving, while the other items remain in their positions. We measure the quality of the equilibria using the standard measures PoA and PoS that are defined as the worst case worst/best asymptotic ratio between the social cost of a (pure) Nash equilibrium and the cost of an optimal packing, respectively. We also consider the recently introduced measures SPoA and SPoS, that are defined similarly to the PoA and the PoS, but consider only Strong Nash equilibria. We give nearly tight lower and upper bounds of 1.6416 and 1.6428, respectively, on the PoA of the bin packing game, improving upon previous result by Bil. We study the Strong Nash equilibria of the bin packing game, and show that a packing is a Strong Nash equilibrium iff it is produced by the Subset Sum algorithm for bin packing. This characterization implies that the SPoA of the bin packing game equals the approximation ratio of the Subset Sum algorithm, for which an almost tight bound is known. Moreover, the fact that any lower bound instance for the Subset Sum algorithm can be converted by a small modification of the item sizes to a lower bound instance on the SPoS, implies that in the bin packing game SPoA=SPoS. Finally, we address the issue of complexity of computing a Strong Nash packing and show that no polynomial time algorithm exists for finding Strong Nash equilibria, unless P=NP.", "paper_title": "Selfish Bin Packing", "paper_id": "WOS:000288752600010"}