{"auto_keywords": [{"score": 0.025372286719485562, "phrase": "group-buying_websites"}, {"score": 0.011022660116112559, "phrase": "reasoned_action"}, {"score": 0.010872852845511469, "phrase": "gefen's_summarization"}, {"score": 0.010725059502701372, "phrase": "trust_antecedents"}, {"score": 0.010579253609833843, "phrase": "chinese_group_buying"}, {"score": 0.00481495049065317, "phrase": "group_buying_websites"}, {"score": 0.004749251041134215, "phrase": "china"}, {"score": 0.004588389551682397, "phrase": "important_role"}, {"score": 0.004109600767747015, "phrase": "chinese_group-buying_websites"}, {"score": 0.0025892330566358503, "phrase": "cognition-based_trust_antecedent"}, {"score": 0.0025014259919355453, "phrase": "chinese_customers'_trust"}, {"score": 0.002286781334850213, "phrase": "significantly_lower_general_trust"}, {"score": 0.0021049977753042253, "phrase": "significantly_higher_purchasing_probabilities"}], "paper_keywords": [""], "paper_abstract": "Trust plays an important role in the transaction of e-commerce. This research aimed to investigate (a) the influences of trust on Chinese group-buying websites, (b) the differences of trust between group-buying and business to consumer (B2C) websites, and (c) the applicability of the theory of reasoned action and Gefen's summarization of trust antecedents for Chinese group buying. The study consisted of (a) a prequestionnaire measuring general trust, (b) an in-lab experiment, and (c) a short open interview. Three major results were found. First, Cognition-Based Trust Antecedent was the most important factor influencing Chinese customers' trust and purchasing probabilities of both B2C and group-buying websites. Second, participants showed significantly lower general trust on group-buying websites. However, in the same trust situations, participants show significantly higher purchasing probabilities on group-buying websites. Third, the theory of reasoned action and Gefen's summarization of trust antecedents were not applicable for Chinese group buying.", "paper_title": "Effects of Trust on Group Buying Websites in China", "paper_id": "WOS:000337576600002"}