{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "small_scale_industries"}, {"score": 0.004780301659170006, "phrase": "india"}, {"score": 0.00467677555573346, "phrase": "present_scenario"}, {"score": 0.004509594355983191, "phrase": "economic_growth"}, {"score": 0.0040135756033094225, "phrase": "indian_ssis"}, {"score": 0.0038841330270679097, "phrase": "competitive_priorities"}, {"score": 0.0038559375376635047, "phrase": "competencies_development"}, {"score": 0.003611179715045633, "phrase": "questionnaire-based_survey"}, {"score": 0.0034692911858848893, "phrase": "statistical_analysis"}, {"score": 0.003357343256340741, "phrase": "reliability_test"}, {"score": 0.0032371745435372168, "phrase": "findings_-_cost_reduction"}, {"score": 0.0030986183831544487, "phrase": "major_challenges"}, {"score": 0.0030537595549694134, "phrase": "market_research"}, {"score": 0.0029123920023263446, "phrase": "major_areas"}, {"score": 0.0028493650087584774, "phrase": "information_technology"}, {"score": 0.002737327060030586, "phrase": "significant_relationship"}, {"score": 0.0026201089205321704, "phrase": "business_environment"}, {"score": 0.0024004805502253427, "phrase": "strategy_development"}, {"score": 0.002374351263279043, "phrase": "human_resource"}, {"score": 0.0023570895666021664, "phrase": "vendor_development"}, {"score": 0.002339953069296797, "phrase": "organization_culture"}, {"score": 0.0021049977753042253, "phrase": "market_scenario"}], "paper_keywords": ["India", " Small enterprises", " Competitive strategy", " Business development", " Product management"], "paper_abstract": "Purpose - In the present scenario of e-globalization, small scale industries (SSIs) are considered engine for economic growth all over the world. After markets globalization, SSIs are facing many pressures and constraints to sustain their competitiveness. The purpose of this paper is to examine various issues in context of Indian SSIs such as nature of pressures and constraints, competitive priorities, competencies development, areas of investment, and their relationship with performance. Design/methodology/approach - For collecting data, a questionnaire-based survey was conducted. In total, 75 valid responses were received. Statistical analysis of data acquired from survey is done by reliability test, t-test, and correlation analysis. Findings - Cost reduction, quality improvement, and delivery in time have emerged as major challenges for SSIs. Market research, welfare of employees, and research and development are found as major areas for investment. Use of information technology, training of employees, and research and development has significant relationship with performance. Research limitations/implications - Organizations should develop their strategies after analysing business environment and SSIs should utilize their resources judiciously. However, it is felt that this study can be further explored by considering other aspects of strategy development such as human resource, vendor development, organization culture, etc. Originality/value - Findings and issues of the paper will be highly useful for SSIs in framing their strategies, and academia for further research in the context of changing market scenario.", "paper_title": "Strategy development by small scale industries in India", "paper_id": "WOS:000282918900007"}