{"auto_keywords": [{"score": 0.049766045322984266, "phrase": "face_recognition"}, {"score": 0.009953377748538227, "phrase": "projection_direction"}, {"score": 0.00807666390494904, "phrase": "pcsda"}, {"score": 0.007740489563401459, "phrase": "semisupervised_discriminant_analysis"}, {"score": 0.006423886248394328, "phrase": "sparse_representation"}, {"score": 0.006076156275534177, "phrase": "labeled_and_unlabeled_data"}, {"score": 0.005175128264598604, "phrase": "pairwise_costs"}, {"score": 0.004614038128321949, "phrase": "cost-sensitive_learning_problem"}, {"score": 0.004465187726543722, "phrase": "sufficient_attention"}, {"score": 0.004363846362238565, "phrase": "cost-sensitive_dimensionality_reduction"}, {"score": 0.0042928648367867835, "phrase": "cost-sensitive_semisupervised_dimensionality_reduction"}, {"score": 0.004168101640216023, "phrase": "pairwise_bayesian_risk"}, {"score": 0.004167982855788402, "phrase": "sensitive_semisupervised_discriminant_analysis"}, {"score": 0.004073359218158693, "phrase": "first_work"}, {"score": 0.003941882222595145, "phrase": "soft_label"}, {"score": 0.003916098498242888, "phrase": "unlabeled_sample"}, {"score": 0.003814632693659797, "phrase": "misclassification_costs"}, {"score": 0.0033016282588376397, "phrase": "minimal_misclassification_loss_criterion"}, {"score": 0.0030017207229983385, "phrase": "unlabeled_data"}, {"score": 0.0024891269874339553, "phrase": "data_sets"}, {"score": 0.0024007585788965655, "phrase": "class_imbalance_problem"}, {"score": 0.0022406537579986842, "phrase": "outliers_and_class_imbalance_problem"}, {"score": 0.0021398811716327273, "phrase": "yale_b_data_sets"}, {"score": 0.0021049977753042253, "phrase": "pcsda."}], "paper_keywords": ["Cost sensitive", " dimensionality reduction", " face recognition", " semi-supervised learning"], "paper_abstract": "In recent years, face recognition is being recognized as a cost-sensitive learning problem. Many cost-sensitive classifiers have been proposed. However, no sufficient attention is paid to the research on cost-sensitive dimensionality reduction, especially on the cost-sensitive semisupervised dimensionality reduction. To the best of our knowledge, cost sensitive semisupervised discriminant analysis (CS3DA) may be the first work. CS3DA first uses the sparse representation to infer a soft label for unlabeled sample and then learns the projection direction by incorporating misclassification costs into both labeled and unlabeled data. Although CS3DA reduces the loss of misclassification, it has two major drawbacks: 1) the sparsity is not a feature of face recognition, and therefore sparse approximations may not deliver the robustness or performance desired and 2) CS3DA is not proven to satisfy the minimal misclassification loss criterion. In this paper, we embed pairwise costs in semisupervised discriminant analysis (PCSDA) for face recognition. PCSDA first uses a simple l(2) approach to predict the label of unlabeled data, and then learns the projection direction by embedding pairwise costs in both labeled and unlabeled data. Compared with CS3DA, PCSDA has three major advantages: 1) l(2) approach is more accurate and robust than sparse representation for face recognition; 2) we prove that CS3DA approximates the pairwise Bayesian risk only when the classes are balanced and without outliers in face data sets; and 3) PCSDA approximates the pairwise Bayesian risk considering the class imbalance problem and outliers in face recognition. Hence, the projection direction obtained by using PCSDA can be more discriminative, immunes to outliers and class imbalance problem. The experimental results on AR, PIE, ORL, and extended Yale B data sets demonstrate the effectiveness of PCSDA.", "paper_title": "Pairwise Costs in Semisupervised Discriminant Analysis for Face Recognition", "paper_id": "WOS:000348129200004"}