{"auto_keywords": [{"score": 0.0496578611773389, "phrase": "cloud_providers"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_cloud_resources"}, {"score": 0.004466519142879166, "phrase": "virtual_machine"}, {"score": 0.004427251712121205, "phrase": "vm"}, {"score": 0.004161553532799662, "phrase": "major_challenges"}, {"score": 0.0036445446531633368, "phrase": "auction-based_models"}, {"score": 0.003410565849262162, "phrase": "autonomic_vm_provisioning"}, {"score": 0.003335948601271999, "phrase": "auction-based_model"}, {"score": 0.0032057142600527, "phrase": "approximation_mechanism"}, {"score": 0.0029602552900111407, "phrase": "allocated_resources"}, {"score": 0.00278237555651743, "phrase": "strongest_approximation_result"}, {"score": 0.002626760910629479, "phrase": "proposed_approximation_mechanism"}, {"score": 0.002592100731070259, "phrase": "polynomial-time_approximation_scheme"}, {"score": 0.002219916677664081, "phrase": "extensive_experiments"}, {"score": 0.002200337772403981, "phrase": "real_workload"}, {"score": 0.0021049977753042253, "phrase": "proposed_mechanism"}], "paper_keywords": ["Cloud computing", " strategy-proof mechanism", " virtual machine provisioning", " resource allocation", " polynomial time approximation scheme"], "paper_abstract": "Cloud providers provision their heterogeneous resources such as CPUs, memory, and storage in the form of virtual machine (VM) instances which are then allocated to the users. One of the major challenges faced by the cloud providers is to allocate and provision these resources such that their profit is maximized, and the resources are utilized efficiently. Recently, cloud providers have introduced auction-based models which allow users to submit bids for their requested VMs. We address the problem of autonomic VM provisioning and allocation for the auction-based model considering multiple types of resources by designing an approximation mechanism. In addition, the mechanism determines the payment the users have to pay for using the allocated resources. This problem is computationally intractable, and our proposed mechanism is by far the strongest approximation result that can be achieved for this problem. We show that the proposed approximation mechanism is a polynomial-time approximation scheme (PTAS). Furthermore, our proposed mechanism drives the system into an equilibrium in which the users do not have incentives to manipulate the system by untruthfully reporting their VM bundle requests and valuations. We perform extensive experiments using real workload traces in order to investigate the performance of the proposed mechanism.", "paper_title": "A PTAS Mechanism for Provisioning and Allocation of Heterogeneous Cloud Resources", "paper_id": "WOS:000361640800002"}