{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "seamless_stereoscopic_image_cloning"}, {"score": 0.042401911602059444, "phrase": "proposed_method"}, {"score": 0.03565024895550413, "phrase": "cloned_region"}, {"score": 0.004645057834614705, "phrase": "novel_technique"}, {"score": 0.00429715240295033, "phrase": "stereoscopic_composite"}, {"score": 0.003975200317233532, "phrase": "iterative_disparity_adaptation_process"}, {"score": 0.003633464433320317, "phrase": "gradient_domain"}, {"score": 0.002945669860541221, "phrase": "estimated_disparities"}, {"score": 0.0027575842698911173, "phrase": "models_local_perspective_projection"}, {"score": 0.0025202582748972122, "phrase": "easy_cloning"}, {"score": 0.0024604876113911173, "phrase": "intricate_silhouettes"}, {"score": 0.0024311346712789553, "phrase": "vague_boundaries"}, {"score": 0.0023451553255837317, "phrase": "precise_segmentation"}], "paper_keywords": ["Seamless cloning", " stereoscopic images", " image gradients", " disparity gradients", " Poisson equation", " disparity adaptation", " perspective-aware warping"], "paper_abstract": "This paper presents a novel technique for seamless stereoscopic image cloning, which performs both shape adjustment and color blending such that the stereoscopic composite is seamless in both the perceived depth and color appearance. The core of the proposed method is an iterative disparity adaptation process which alternates between two steps: disparity estimation, which re-estimates the disparities in the gradient domain so that the disparities are continuous across the boundary of the cloned region; and perspective-aware warping, which locally re-adjusts the shape and size of the cloned region according to the estimated disparities. This process guarantees not only depth continuity across the boundary but also models local perspective projection in accordance with the disparities, leading to more natural stereoscopic composites. The proposed method allows for easy cloning of objects with intricate silhouettes and vague boundaries because it does not require precise segmentation of the objects. Several challenging cases are demonstrated to show that our method generates more compelling results compared to methods with only global shape adjustment.", "paper_title": "Perspective-Aware Warping for Seamless Stereoscopic Image Cloning", "paper_id": "WOS:000311298900056"}