{"auto_keywords": [{"score": 0.04073140347229938, "phrase": "monotone_function"}, {"score": 0.00481495049065317, "phrase": "monotonicity_reconstruction"}, {"score": 0.004721602309430702, "phrase": "ailon_et_al"}, {"score": 0.00459393336391459, "phrase": "localized_setting"}, {"score": 0.00452252857066346, "phrase": "oracle_access"}, {"score": 0.004469700997700534, "phrase": "nonnegative_real-valued_function"}, {"score": 0.0036172962914449826, "phrase": "point_x"}, {"score": 0.0029966788947444535, "phrase": "single_short_random_seed"}, {"score": 0.0025816239578784067, "phrase": "minimum_possible_hamming_distance"}, {"score": 0.002349561762300369, "phrase": "local_implementation"}], "paper_keywords": ["sublinear algorithms", " monotonicity", " property testing", " local reconstruction"], "paper_abstract": "We investigate the problem of monotonicity reconstruction, as defined by Ailon et al. (2004) in a localized setting. We have oracle access to a nonnegative real-valued function f defined on the domain [n](d) = {1, ... , n}(d) (where d is viewed as a constant). We would like to closely approximate f by a monotone function g. This should be done by a procedure (a filter) that given as input a point x is an element of [n](d) outputs the value of g(x), and runs in time that is polylogarithmic in n. The procedure can (indeed must) be randomized, but we require that all of the randomness be specified in advance by a single short random seed. We construct such an implementation where the time and space per query is (logn)(O(1)) and the size of the seed is polynomial in log n and d. Furthermore, with high probability, the ratio of the (Hamming) distance between g and f to the minimum possible Hamming distance between a monotone function and f is bounded above by a function of d (independent of n). This allows for a local implementation: one can initialize many copies of the filter with the same short random seed, and they can autonomously handle queries, while producing outputs that are consistent with the same approximating function g.", "paper_title": "LOCAL MONOTONICITY RECONSTRUCTION", "paper_id": "WOS:000280847900007"}