{"auto_keywords": [{"score": 0.04126630752096143, "phrase": "greedy_routing"}, {"score": 0.02322730111336099, "phrase": "long-range_links"}, {"score": 0.010480137629968012, "phrase": "augmented_graph_model"}, {"score": 0.01037123565506224, "phrase": "kleinberg"}, {"score": 0.006893928326957132, "phrase": "high_clustering_coefficient"}, {"score": 0.005952008038795656, "phrase": "expected_performances"}, {"score": 0.004587666042418808, "phrase": "appealing_model"}, {"score": 0.004539687360758312, "phrase": "social_networks"}, {"score": 0.004316252588345957, "phrase": "inter-node_distances"}, {"score": 0.0040014674678590925, "phrase": "probability_distribution_phi"}, {"score": 0.0039181589253084025, "phrase": "augmented_graphs_g"}, {"score": 0.003820466176897793, "phrase": "intermediate_node"}, {"score": 0.003772533587549841, "phrase": "target_t"}, {"score": 0.003504631847292796, "phrase": "augmented_graph"}, {"score": 0.00322159890493599, "phrase": "base_graph_h"}, {"score": 0.0031748083977025006, "phrase": "g."}, {"score": 0.003088746131758051, "phrase": "doubling_dimension"}, {"score": 0.0030628383337454345, "phrase": "simple_local_maximum_likelihood_algorithm"}, {"score": 0.00286322585647695, "phrase": "small_stretch"}, {"score": 0.0027858879993125888, "phrase": "undetected_long-range_links"}, {"score": 0.002571667597151487, "phrase": "h."}, {"score": 0.0025553618781201434, "phrase": "latter_result"}, {"score": 0.0022805247948067585, "phrase": "local_maximum_likelihood_algorithm"}, {"score": 0.0021317885325570604, "phrase": "good_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Small world", " Doubling dimension", " Bounded growth"], "paper_abstract": "The augmented graph model, as introduced in Kleinberg, STOC (2000) [23], is an appealing model for analyzing navigability in social networks. Informally, this model is defined by a pair (H, phi), where H is a graph in which inter-node distances are supposed to be easy to compute or at least easy to estimate. This graph is \"augmented\" by links, called long-range links, that are selected according to the probability distribution phi. The augmented graph model enables the analysis of greedy routing in augmented graphs G is an element of (H, phi). In greedy routing, each intermediate node handling a message for a target t selects among all its neighbors in G the one that is the closest to t in H and forwards the message to it. This paper addresses the problem of checking whether a given graph G is an augmented graph. It answers part of the questions raised by Kleinberg in his Problem 9 (Int. Congress of Math. 2006). More precisely. given G is an element of (H, phi), we aim at extracting the base graph H and the long-range links R out of G. We prove that if H has a high clustering coefficient and H has bounded doubling dimension, then a simple local maximum likelihood algorithm enables us to partition the edges of G into two sets H' and R' such that E(H) subset of H' and the edges in H' \\ E(H) are of small stretch, i.e., the map H is not perturbed too greatly by undetected long-range links remaining in H. The perturbation is actually so small that we can prove that the expected performances of greedy routing in G using the distances in H' are close to the expected performances of greedy routing using the distances in H. Although this latter result may appear intuitively straightforward, since H' superset of E(H), it is not, as we also show that routing with a map more precise than H may actually damage greedy routing significantly. Finally, we show that in the absence of a hypothesis regarding the high clustering coefficient, any local maximum likelihood algorithm extracting the long-range links can miss the detection of Omega(n(5 epsilon)/log n) long-range links of stretch Omega(n(1/5-epsilon)) for any 0 < epsilon < 1/5, and thus the map H cannot be recovered with good accuracy. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Recovering the long-range links in augmented graphs", "paper_id": "WOS:000275934200007"}