{"auto_keywords": [{"score": 0.04385943794070392, "phrase": "packet_delivery_ratio"}, {"score": 0.013324812062135136, "phrase": "delay-tolerant_fashion"}, {"score": 0.009162172690143664, "phrase": "partially_connected_networks"}, {"score": 0.008872111626356854, "phrase": "packet_lifetime"}, {"score": 0.008357365351791908, "phrase": "partially_connected_vanets"}, {"score": 0.008092575220397944, "phrase": "hop_count"}, {"score": 0.007728677670642464, "phrase": "ttl_field"}, {"score": 0.005321287276419124, "phrase": "proposed_approaches"}, {"score": 0.00481495049065317, "phrase": "delay-tolerant_communications"}, {"score": 0.0047707093928203, "phrase": "partially_connected_vehicular_ad_hoc_networks"}, {"score": 0.0045765783794477505, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.004431041346291019, "phrase": "network_connectivity"}, {"score": 0.0042506731642425275, "phrase": "delay-tolerant_approach"}, {"score": 0.004077616905584829, "phrase": "previous_studies"}, {"score": 0.003966162568548304, "phrase": "vehicle's_packet"}, {"score": 0.003616108223034427, "phrase": "hop_limit_field"}], "paper_keywords": ["delay-tolerant communications", " IPv6", " TTL", " carry time", " packet delivery ratio", " lifetime", " partial connectivity"], "paper_abstract": "The packet delivery ratio and throughput in Vehicular Ad Hoc Networks (VANETs) depend on the network connectivity and degrade as the connectivity decreases. A delay-tolerant approach increases the packet delivery ratio in partially connected networks. In the previous studies, the packet lifetime and the vehicle's packet carry time are determined to maximise the packet delivery ratio in partially connected VANETs. However, IPv6 uses the hop count in the Hop Limit field instead of using seconds in the TTL field, as in IPv4. Similarly, although IPv4 packets are designed to carry the packet lifetime in seconds in the TTL field, this field is used for the hop count in practice. In this case, there is no mechanism to determine how long vehicles will carry packets in VANETs when delivering packets in a delay-tolerant fashion. In this study, we propose approaches for the delivery of IPv6 packets in a delay-tolerant fashion in partially connected networks. We also propose another method that enhances these proposed approaches and optimises the packet delivery ratio. Our analysis shows that the proposed approaches can be easily adopted for IPv6/IPv4 packets to be delivered in a delay-tolerant fashion. Additionally, we observe that our approaches increase the packet delivery ratio in partially connected VANETs and can also be used in networks where the nodes are mobile or connections get broken frequently.", "paper_title": "Enabling delay-tolerant communications for partially connected vehicular ad hoc networks", "paper_id": "WOS:000311137300007"}