{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "staffing_policy"}, {"score": 0.049613254104042076, "phrase": "technology_investment"}, {"score": 0.048923016754706936, "phrase": "specialty_hospital"}, {"score": 0.04054987344772189, "phrase": "telemedicine_technology"}, {"score": 0.004496402246090618, "phrase": "traditional_face-to-face_consultations"}, {"score": 0.003901754272977278, "phrase": "optimal_investment_level"}, {"score": 0.003572766402294553, "phrase": "queuing_theory"}, {"score": 0.0034863899423238707, "phrase": "optimal_investment"}, {"score": 0.0032079813320482304, "phrase": "incorrect_treatment"}, {"score": 0.002769650208851401, "phrase": "technology_level"}, {"score": 0.002498873893632724, "phrase": "optimal_tele-specialist_policy"}, {"score": 0.002321787726770895, "phrase": "face-to-face_consultation"}], "paper_keywords": ["Telemedicine", " E-health", " Information technology investment", " Queuing system"], "paper_abstract": "We study a specialty hospital providing traditional face-to-face consultations by experts and telemedicine services by tele-specialists. As accuracy of diagnosis and treatment by tele-specialists are paramount in such a setting (unlike call center management), our main focus is to determine the optimal investment level in telemedicine technology with the trade off being between accuracy/quality and cost. Using a heuristic proposed in queuing theory, we provide the optimal investment in telemedicine technology together with the staffing policy, considering the various cost components, including staffing, technology investment, incorrect treatment. and waiting. The model also incorporates buy-in by the patients in the form of the arrival (show-up) rate dependent on the technology level established. We find that under certain conditions the hospital should not invest in telemedicine. Finally, we provide the optimal tele-specialist policy of the ratio of patients to treat via telemedicine and to refer to the face-to-face consultation. Our model also suggests that a policy of treating all patients via telemedicine is never optimal. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "On the staffing policy and technology investment in a specialty hospital offering telemedicine", "paper_id": "WOS:000262760000002"}