{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "double-branch_compression"}, {"score": 0.004558289038745564, "phrase": "differential-based_distinguishers"}, {"score": 0.004516856326107826, "phrase": "double-branch_compression_functions"}, {"score": 0.004414907432703781, "phrase": "iso_standard_hash_functions"}, {"score": 0.00429558848734449, "phrase": "double-branch_compression_function"}, {"score": 0.004141476915000558, "phrase": "chaining_variable"}, {"score": 0.003920573616298175, "phrase": "second-order_differential_paths"}, {"score": 0.003310684108128973, "phrase": "new_properties"}, {"score": 0.003221111762383486, "phrase": "q-multi-second-order_collision"}, {"score": 0.0026949679939994226, "phrase": "brute_force_attack"}, {"score": 0.002370955769074803, "phrase": "q-multi-second-order_collision_attacks"}], "paper_keywords": ["RIPEMD-128", " RIPEMD-160", " double-branch structure", " 2-dimension sum", " q-multi-second-order collision"], "paper_abstract": "This paper presents differential-based distinguishers against double-branch compression functions and applies them to ISO standard hash functions RIPEMD-128 and RIPEMD-160. A double-branch compression function computes two branch functions to update a chaining variable and then merges their outputs. For such a compression function, we observe that second-order differential paths will be constructed by finding a sub-path in each branch independently. This leads to 4-sum attacks on 47 steps (out of 64 steps) of RIPEMD-128 and 40 steps (out of 80 steps) of RIPEMD-160. Then new properties called a (partial) 2-dimension sum and a q-multi-second-order collision are considered. The partial 2-dimension sum is generated on 48 steps of RIPEMD-128 and 42 steps of RIPEMD-160, with complexities of 2(35) and 2(36), respectively. Theoretically, the 2-dimension sum is generated faster than the brute force attack up to 52 steps of RIPEMD-128 and 51 steps of RIPEMD-160, with complexities of 2101 and 2(158), respectively. The results on RIPEMD-128 can also be viewed as q-multi-second-order collision attacks. The practical attacks have been implemented and examples are presented. We stress that our results do not impact to the security of full RIPEMD-128 and RIPEMD-160 hash functions.", "paper_title": "Distinguishers on Double-Branch Compression Function and Applications to Round-Reduced RIPEMD-128 and RIPEMD-160", "paper_id": "WOS:000330553400022"}