{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cost_savings"}, {"score": 0.049722360725641276, "phrase": "cloud-based_hosting"}, {"score": 0.004451360793577698, "phrase": "better_scalability"}, {"score": 0.0040691889755318155, "phrase": "existing_limitations"}, {"score": 0.0033747739383101095, "phrase": "claimed_advantages"}, {"score": 0.003214455466823939, "phrase": "tangible_cost_savings"}, {"score": 0.003178550413662537, "phrase": "cloud-based_hosting_offerings"}, {"score": 0.0031195948946937378, "phrase": "wide_range"}, {"score": 0.002949189427671915, "phrase": "different_way"}, {"score": 0.0028728747019026485, "phrase": "in-depth_understanding"}, {"score": 0.002840774188169279, "phrase": "cost_implications"}, {"score": 0.0026956374041441126, "phrase": "diverse_set"}, {"score": 0.002675516297446243, "phrase": "key_factors"}, {"score": 0.002625866440129899, "phrase": "deployment_choices"}, {"score": 0.002418099158357658, "phrase": "different_deployment_choices"}, {"score": 0.002382124723569496, "phrase": "important_application_characteristics"}, {"score": 0.0023554947277883535, "phrase": "workload_intensity"}, {"score": 0.002337906603857861, "phrase": "growth_rate"}, {"score": 0.002320449502337321, "phrase": "traffic_size"}, {"score": 0.002218404456227325, "phrase": "overall_costs"}, {"score": 0.002152874480615438, "phrase": "workload_variance"}], "paper_keywords": ["Cloud computing", " cloud economics", " application migration and cost analysis"], "paper_abstract": "Cloud-based hosting is claimed to possess many advantages over traditional in-house (on-premise) hosting such as better scalability, ease of management, and cost savings. It is not difficult to understand how cloud-based hosting can be used to address some of the existing limitations and extend the capabilities of many types of applications. However, one of the most important questions is whether cloud-based hosting will be economically feasible for my application if migrated into the cloud. It is not straightforward to answer this question because it is not clear how my application will benefit from the claimed advantages, and, in turn, be able to convert them into tangible cost savings. Within cloud-based hosting offerings, there is a wide range of hosting options one can choose from, each impacting the cost in a different way. Answering these questions requires an in-depth understanding of the cost implications of all the possible choices specific to my circumstances. In this study, we identify a diverse set of key factors affecting the costs of deployment choices. Using benchmarks representing two different applications (TPC-W and TPC-E) we investigate the evolution of costs for different deployment choices. We consider important application characteristics such as workload intensity, growth rate, traffic size, storage, and software license to understand their impact on the overall costs. We also discuss the impact of workload variance and cloud elasticity, and certain cost factors that are subjective in nature.", "paper_title": "Cloudy with a Chance of Cost Savings", "paper_id": "WOS:000318499900017"}