{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple-part_manuscripts"}, {"score": 0.007546169821323108, "phrase": "monthly_weather_review"}, {"score": 0.005977987144073793, "phrase": "two-part_manuscripts"}, {"score": 0.0037887998222248314, "phrase": "final_decision"}, {"score": 0.003674086624699676, "phrase": "average_acceptance_rate"}, {"score": 0.0035301176972299627, "phrase": "lower_acceptance_rate"}, {"score": 0.0033813554890743665, "phrase": "higher_acceptance_rate"}, {"score": 0.0032488198151299826, "phrase": "acceptance_rate"}, {"score": 0.003160110202677729, "phrase": "typical_reviewer_comments"}, {"score": 0.0030268930660241563, "phrase": "available_results"}, {"score": 0.002890367960684987, "phrase": "unseen_part_ii._typical_comments"}, {"score": 0.002811418334221172, "phrase": "somewhat_contradictory_statements"}, {"score": 0.0023956021950024124, "phrase": "reviewers'_comments"}, {"score": 0.0023735785441690097, "phrase": "substantial_reorganization"}, {"score": 0.0021641529087429797, "phrase": "minimal_reference"}, {"score": 0.0021508655858525683, "phrase": "unsubmitted_manuscripts"}, {"score": 0.0021049977753042253, "phrase": "scientific_content"}], "paper_keywords": ["Multiple-part manuscripts", " Rejection rate", " Reviewers", " Editors"], "paper_abstract": "Multiple-part manuscripts are those submitted to a journal and intended for publication as a series, usually having \"Part 1,\" \"Part I,\" ... \"Part N\" in the title. Although some journals prohibit such submissions, other journals (including Monthly Weather Review) have no such restrictions. To examine how reviewers and editors view multiple-part manuscripts, 308 multiple-part manuscripts submitted to Monthly Weather Review from May 2001 through February 2010 were examined. For multiple-part manuscripts having reached a final decision, 67% were accepted, which was also the average acceptance rate of all manuscripts (67%). Part I manuscripts submitted alone had a lower acceptance rate (61%) than the average, whereas Part II manuscripts submitted alone had a higher acceptance rate (77%) than the average. Two-part manuscripts submitted together had an acceptance rate (67%) comparable to the average. Typical reviewer comments for Part I manuscripts submitted alone included the manuscript being too long for the available results and the author making claims in Part I that would be supported in the unseen Part II. Typical comments for Part 11 manuscripts submitted alone included the somewhat contradictory statements that material was unnecessarily duplicated in the two manuscripts and more repetition was needed between the two parts. For two-part manuscripts submitted together, reviewers often recommended condensing the two manuscripts and merging them into one. In some cases, editors rejected manuscripts even though no reviewer recommended rejection because the sum of all reviewers' comments would require substantial reorganization of the manuscripts. The results of this study suggest the following recommendations for authors considering writing multiple-part manuscripts: Write manuscripts that are sensibly independent of each other, make minimal reference to unsubmitted manuscripts, and have sufficient and substantiated scientific content within each manuscript.", "paper_title": "Rejection rates for multiple-part manuscripts", "paper_id": "WOS:000286496200003"}