{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "document_summaries"}, {"score": 0.00476323161560059, "phrase": "subspace_clustering"}, {"score": 0.004712065638657606, "phrase": "clustering-based_optimization"}, {"score": 0.004139128578531134, "phrase": "existing_clustering-based_summarization_approaches"}, {"score": 0.00342568771304873, "phrase": "systematic_approach"}, {"score": 0.0032278559855285975, "phrase": "integrated_clustering-based_summarization_framework"}, {"score": 0.0026423134393535265, "phrase": "newly_emerged_subspace"}, {"score": 0.0025440911575156755, "phrase": "keyword_selection"}, {"score": 0.0025031188149336257, "phrase": "improved_quality"}, {"score": 0.0024761702541879213, "phrase": "sentence_clustering"}, {"score": 0.002222102813520549, "phrase": "experimental_results"}, {"score": 0.0021863046959469863, "phrase": "duc_datasets"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Document summarization", " Information diversity", " Information coverage", " Subspace clustering"], "paper_abstract": "Sentence clustering has been successfully applied in document summarization to discover the topics conveyed in a collection of documents. However, existing clustering-based summarization approaches are seldom targeted for both diversity and coverage of summaries, which are believed to be the two key issues to determine the quality of summaries. The focus of this work is to explore a systematic approach that allows diversity and coverage to be tackled within an integrated clustering-based summarization framework. Given the fact that normally each topic can be described by a set of keywords and the choice of the keywords among the topics is topic-dependent, we take the advantage of the newly emerged subspace clustering to enable the flexibility of keyword selection and the improved quality of sentence clustering. On this basis, we develop two clustering-based optimization strategies, namely local optimization and global optimization to pursue our targets. Experimental results on the DUC datasets demonstrate effectiveness and robustness of the proposed approach. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Enhancing diversity and coverage of document summaries through subspace clustering and clustering-based optimization", "paper_id": "WOS:000337985200052"}