{"auto_keywords": [{"score": 0.03525836607351927, "phrase": "probalign"}, {"score": 0.02816687185612394, "phrase": "real_and_simulated_data"}, {"score": 0.00481495049065317, "phrase": "partition_function_posterior_probabilities"}, {"score": 0.0045765783794477505, "phrase": "multiple_sequence_alignment"}, {"score": 0.004534517530868195, "phrase": "pairwise_posterior_probabilities"}, {"score": 0.004370087541308677, "phrase": "partition_function_methodology"}, {"score": 0.004058826900076531, "phrase": "first_time"}, {"score": 0.004002972723329302, "phrase": "maximal_expected_accuracy_sequence_alignments"}, {"score": 0.0037177622939493084, "phrase": "probalign_alignments"}, {"score": 0.0035172243705873657, "phrase": "mafft"}, {"score": 0.0034848990727940833, "phrase": "muscle"}, {"score": 0.0032364494905485677, "phrase": "homstrad_and_oxbench_benchmarks"}, {"score": 0.002991823455621222, "phrase": "deeper_scrutiny"}, {"score": 0.0027528751037412128, "phrase": "long_and_heterogeneous_length_proteins"}, {"score": 0.0025683581446365165, "phrase": "accurate_alignments"}, {"score": 0.0025447065763362984, "phrase": "long_and_heterogeneous_length_datasets"}, {"score": 0.0024636239664210433, "phrase": "alignment_accuracy_scores"}, {"score": 0.0023522423291484212, "phrase": "standard_deviation"}, {"score": 0.0021049977753042253, "phrase": "simulated_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: The maximum expected accuracy optimization criterion for multiple sequence alignment uses pairwise posterior probabilities of residues to align sequences. The partition function methodology is one way of estimating these probabilities. Here, we combine these two ideas for the first time to construct maximal expected accuracy sequence alignments. Results: We bridge the two techniques within the program Probalign. Our results indicate that Probalign alignments are generally more accurate than other leading multiple sequence alignment methods (i. e. Probcons, MAFFT and MUSCLE) on the BAliBASE 3.0 protein alignment benchmark. Similarly, Probalign also outperforms these methods on the HOMSTRAD and OXBENCH benchmarks. Probalign ranks statistically highest (P-value < 0.005) on all three benchmarks. Deeper scrutiny of the technique indicates that the improvements are largest on datasets containing N/C-terminal extensions and on datasets containing long and heterogeneous length proteins. These points are demonstrated on both real and simulated data. Finally, our method also produces accurate alignments on long and heterogeneous length datasets containing protein repeats. Here, alignment accuracy scores are at least 10% and 15% higher than the other three methods when standard deviation of length is > 300 and 400, respectively. Availability: Open source code implementing Probalign as well as for producing the simulated data, and all real and simulated data are freely available from http://www.cs.njit.edu/usman/probalign Contact: usman@cs.njit.edu.", "paper_title": "Probalign: multiple sequence alignment using partition function posterior probabilities", "paper_id": "WOS:000241958000002"}