{"auto_keywords": [{"score": 0.04281989940407483, "phrase": "user_satisfaction"}, {"score": 0.016535473192888173, "phrase": "perceived_usability"}, {"score": 0.01638777803564297, "phrase": "perceived_aesthetics"}, {"score": 0.010612387000973441, "phrase": "user_experience"}, {"score": 0.007000901769852925, "phrase": "interaction_types"}, {"score": 0.004771435352180973, "phrase": "computer-based_applications"}, {"score": 0.0047283116134926645, "phrase": "different_use_purposes"}, {"score": 0.004051828608343507, "phrase": "users'_perceptions"}, {"score": 0.003925004567341077, "phrase": "use_situations"}, {"score": 0.003716724243777879, "phrase": "similar_levels"}, {"score": 0.0036167509502276294, "phrase": "forty-five_engineering_students"}, {"score": 0.0031990183472675377, "phrase": "use_purposes"}, {"score": 0.0029209233709517634, "phrase": "users'_goal-directed_activities"}, {"score": 0.0027159094186967247, "phrase": "useful_information"}, {"score": 0.0026188490199688013, "phrase": "specific_use_goal"}, {"score": 0.002559951153813876, "phrase": "strong_relationship"}, {"score": 0.0021049977753042253, "phrase": "different_contextual_features"}], "paper_keywords": [""], "paper_abstract": "The concept of user experience emphasizes the importance of understanding users for applications that have various contextual features. To address this issue, this study examines the changes in the relationships among user satisfaction and users' perceptions of usability and aesthetics according to use situations. For data, an experiment was conducted using 15 existing websites with similar levels of usability and aesthetics. Forty-five engineering students participated in the experiment. The results indicated that the relationships among perceived usability, perceived aesthetics, and user satisfaction could be dependent on how users perceived the use purposes and interaction types of the websites. Specifically, the relationship between perceived usability and user satisfaction was stronger for websites requiring users' goal-directed activities, whereas the relationship between perceived aesthetics and user satisfaction was stronger for the websites mainly providing useful information, regardless of the existence of a specific use goal. Also, the strong relationship between perceived usability and perceived aesthetics was more obvious for websites where users mainly wanted to obtain information than for those where users primarily wanted to use the leisure and relaxation content. The findings can be utilized in the design of websites with different contextual features, especially related to use purposes and interaction types.", "paper_title": "Understanding User Experience with Computer-Based Applications with Different Use Purposes", "paper_id": "WOS:000324002000001"}