{"auto_keywords": [{"score": 0.04975844688475772, "phrase": "biological_sequences"}, {"score": 0.009793679575971785, "phrase": "exact_motifs"}, {"score": 0.00481495049065317, "phrase": "maximal_motifs"}, {"score": 0.004593787100061613, "phrase": "string_algorithm_designers"}, {"score": 0.004412285905508977, "phrase": "molecular_biology"}, {"score": 0.003717273538121102, "phrase": "existing_algorithms"}, {"score": 0.0036064757492752703, "phrase": "input_size"}, {"score": 0.0035463496793144748, "phrase": "output_size"}, {"score": 0.0033832583769880576, "phrase": "approximation_degree"}, {"score": 0.003163154491827937, "phrase": "high_degree"}, {"score": 0.0030278017562213265, "phrase": "traditional_requirements"}, {"score": 0.002465895175961543, "phrase": "approximate_motifs"}, {"score": 0.0024493494346360415, "phrase": "hamming_distance"}, {"score": 0.0023842666006371267, "phrase": "maximal_motifs_oil"}, {"score": 0.0023682672729645714, "phrase": "suffix_tree"}, {"score": 0.0023287359930308864, "phrase": "data_structure"}, {"score": 0.0022898630573629144, "phrase": "whole_class"}, {"score": 0.0022744957687536307, "phrase": "motif_extraction_tools"}, {"score": 0.0021770860717929192, "phrase": "maximality_requirement"}, {"score": 0.0021479597698614355, "phrase": "asymptotical_complexity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Motif discovery", " Maximal motifs", " Suffix tree"], "paper_abstract": "Finding motifs in biological sequences is one of the most intriguing problems for string algorithm designers due to, on the one hand, the numerous applications of this problem in molecular biology and, on the other hand, the challenging aspects of the computational problem. Indeed, when dealing with biological sequences it is necessary to work with approximations (that is, to identify fragments that are not necessarily identical, but just similar, according to a given similarity notion), and this complicates the problem. Existing algorithms run in time linear with respect to the input size. Nevertheless, the output size can be very large due to the approximation (namely exponential in the approximation degree). This often makes the output unreadable, as well as slowing down the inference itself. A high degree of redundancy has been detected in the set of motifs that satisfy traditional requirements, even for exact motifs. Moreover, it has been observed many times that only a subset of these motifs, namely the maximal motifs, could be enough to provide the information of all of them. In this paper, we aim at removing such redundancy. We extend some notions of maximality already defined for exact motifs to the case of approximate motifs with Hamming distance, and we give a characterization of maximal motifs oil the suffix tree. Given that this data structure is used by a whole class of motif extraction tools, we show how these tools can be modified to include the maximality requirement without changing the asymptotical complexity. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Suffix tree characterization of maximal motifs in biological sequences", "paper_id": "WOS:000270627100011"}