{"auto_keywords": [{"score": 0.04530974547483828, "phrase": "venezuela"}, {"score": 0.0450471722488638, "phrase": "spain"}, {"score": 0.04478537198237169, "phrase": "france"}, {"score": 0.03885289703110208, "phrase": "national_language"}, {"score": 0.03259626827675194, "phrase": "case_reports"}, {"score": 0.027318531257671388, "phrase": "non-anglophone_journals"}, {"score": 0.004814955496267426, "phrase": "scholarly"}, {"score": 0.00477079124890959, "phrase": "five_geographical_contexts"}, {"score": 0.004612294931699583, "phrase": "acknowledgment_paratext"}, {"score": 0.004584045720295891, "phrase": "medical_discourse"}, {"score": 0.004404577716425371, "phrase": "medical_articles"}, {"score": 0.004364165612189736, "phrase": "five_countries"}, {"score": 0.004258340030253736, "phrase": "uk"}, {"score": 0.004232318655508908, "phrase": "usa"}, {"score": 0.0037887998222248314, "phrase": "highest_impact_factors"}, {"score": 0.0037310040297385346, "phrase": "native_speakers"}, {"score": 0.003131080208280537, "phrase": "research_papers"}, {"score": 0.0025477277691093097, "phrase": "overall_increase"}, {"score": 0.002493417909212525, "phrase": "non-english_publications"}, {"score": 0.002440262939107715, "phrase": "english_language_journals"}, {"score": 0.00221130685073215, "phrase": "intellectual_indebtedness"}], "paper_keywords": ["Acknowledgments", " Medicine", " Diachronic", " Genre", " Research article", " Review article", " Case reports"], "paper_abstract": "This study analyzed the use of acknowledgements in medical articles published in five countries (Venezuela, Spain, France, UK and USA) from 1950 to 2010. For each country, we selected 54 papers (18 research papers, 18 reviews and 18 case reports), evenly distributed over six decades, from two medical journals with the highest impact factors. Only papers written by native speakers in the national language were included. The evolution of the frequency and length of acknowledgments was analyzed. Of 270 articles studied, 127 (47%) had acknowledgments. The presence of acknowledgments was associated with country (p = 0.001), this section being more common and longer in US and UK journals. Acknowledgments were most common in research papers (70 vs. 40% in case reports and 31% in reviews, p < 0.001). Reviews without acknowledgments were significantly more common than those with (69 vs. 31%), but there was no trend in case reports. Altogether, articles with acknowledgments predominated only after 2000. Since the frequency of use of acknowledgments remained stable over time in US and UK journals but increased in non-Anglophone journals, the overall increase is attributed to the change in non-English publications. Authors acknowledged sub-authorship more in English language journals than in those published in the national language in France, Spain and Venezuela. However, the practice of acknowledging is increasing in non-Anglophone journals. We conclude that the concept of intellectual indebtedness does not only differ from one geographical context to another, but also over time and from one academic genre to another.", "paper_title": "Scholarly gratitude in five geographical contexts: a diachronic and cross-generic approach of the acknowledgment paratext in medical discourse (1950-2010)", "paper_id": "WOS:000286627500014"}