{"auto_keywords": [{"score": 0.032631650349210554, "phrase": "historical_records"}, {"score": 0.008118279295371277, "phrase": "generalized_multilevel_regression_model"}, {"score": 0.007698961852183293, "phrase": "major_depression"}, {"score": 0.00703268184016045, "phrase": "population-average_predictions"}, {"score": 0.006923737021774344, "phrase": "subject-specific_predictions"}, {"score": 0.006383675553871715, "phrase": "predictive_accuracy"}, {"score": 0.006206656016704347, "phrase": "classification_ability"}, {"score": 0.00481495049065317, "phrase": "longitudinal_data_a"}, {"score": 0.004579780586951551, "phrase": "\"big_data"}, {"score": 0.004410938507689426, "phrase": "common_and_often_undiagnosed_condition"}, {"score": 0.00422177384286051, "phrase": "healthcare_outcomes"}, {"score": 0.0040916230716372265, "phrase": "suicide_risk"}, {"score": 0.003965468669507077, "phrase": "diabetes_patients"}, {"score": 0.003928383344128396, "phrase": "promising_and_valuable_tool"}, {"score": 0.0038552459083505985, "phrase": "depressive_symptoms"}, {"score": 0.0036324746826127997, "phrase": "longitudinal_data"}, {"score": 0.003587235362628753, "phrase": "recent_large-scale_clinical_trial"}, {"score": 0.003066945490483524, "phrase": "newly_obtained_patient_records"}, {"score": 0.0029816229984366374, "phrase": "prediction_model"}, {"score": 0.002962986184540317, "phrase": "root-mean-square_errors"}, {"score": 0.0024625017739528096, "phrase": "predicted_scores"}, {"score": 0.0024241817763927163, "phrase": "individual_patients"}, {"score": 0.002386463179315773, "phrase": "rmse"}, {"score": 0.0023346234464901978, "phrase": "receiver_operating_characteristic"}, {"score": 0.0023200303129867618, "phrase": "roc"}, {"score": 0.0021450029487459403, "phrase": "generalized_multilevel_regression"}, {"score": 0.0021249064184347658, "phrase": "longitudinal_patient_records"}, {"score": 0.0021049977753042253, "phrase": "high_predictive_ability"}], "paper_keywords": ["Depression", " diabetes mellitus", " comorbidity", " machine learning", " multilevel regression"], "paper_abstract": "Introduction: This article is part of the Focus Theme of Methods of Information in Medicine on \"Big Data and Analytics in Healthcare\". Background: Depression is a common and often undiagnosed condition for patients with diabetes. It is also a condition that significantly impacts healthcare outcomes, use, and cost as well as elevating suicide risk. Therefore, a model to predict depression among diabetes patients is a promising and valuable tool for providers to proactively assess depressive symptoms and identify those with depression. Objectives: This study seeks to develop a generalized multilevel regression model, using a longitudinal data set from a recent large-scale clinical trial, to predict depression severity and presence of major depression among patients with diabetes. Methods: Severity of depression was measured by the Patient Health Questionnaire PHQ-9 score. Predictors were selected from 29 candidate factors to develop a 2-level Poisson regression model that can make population-average predictions for all patients and subject-specific predictions for individual patients with historical records. Newly obtained patient records can be incorporated with historical records to update the prediction model. Root-mean-square errors (RMSE) were used to evaluate predictive accuracy of PHQ-9 scores. The study also evaluated the classification ability of using the predicted PHQ-9 scores to classify patients as having major depression. Results: Two time-invariant and 10 time-varying predictors were selected for the model. Incorporating historical records and using them to update the model may improve both predictive accuracy of PHQ-9 scores and classification ability of the predicted scores. Subject-specific predictions (for individual patients with historical records) achieved RMSE about 4 and areas under the receiver operating characteristic (ROC) curve about 0.9 and are better than population-average predictions. Conclusions: The study developed a generalized multilevel regression model to predict depression and demonstrated that using generalized multilevel regression based on longitudinal patient records can achieve high predictive ability.", "paper_title": "Predicting Depression among Patients with Diabetes Using Longitudinal Data A Multilevel Regression Model", "paper_id": "WOS:000366043500012"}