{"auto_keywords": [{"score": 0.031373073722341535, "phrase": "echt"}, {"score": 0.010612387000973441, "phrase": "constraint_handling_techniques"}, {"score": 0.004515004397496303, "phrase": "evolutionary_algorithms"}, {"score": 0.00419195822011581, "phrase": "single_constraint_handling_technique"}, {"score": 0.0031453010852936334, "phrase": "real-parameter_optimization_problems"}, {"score": 0.00308357048262018, "phrase": "constraint_handling_method"}, {"score": 0.0030081030319492343, "phrase": "distinguishing_feature"}, {"score": 0.0028768722873689432, "phrase": "function_call"}, {"score": 0.0026973310437053573, "phrase": "general_concept"}, {"score": 0.002579622880371082, "phrase": "existing_ea."}, {"score": 0.002394719113232821, "phrase": "evolutionary_programming"}, {"score": 0.0023710856920150574, "phrase": "differential_evolution"}, {"score": 0.002336098034290849, "phrase": "eas"}, {"score": 0.0023130151703068444, "phrase": "experimental_results"}, {"score": 0.0021902063413831545, "phrase": "single_constraint_handling_method"}, {"score": 0.0021049977753042253, "phrase": "respective_ea"}], "paper_keywords": ["Constrained optimization", " differential evolution", " ensemble of constraint handling techniques", " ensemble of optimization algorithms", " evolutionary programming"], "paper_abstract": "During the last three decades, several constraint handling techniques have been developed to be used with evolutionary algorithms (EAs). According to the no free lunch theorem, it is impossible for a single constraint handling technique to outperform all other techniques on every problem. In other words, depending on several factors such as the ratio between feasible search space and the whole search space, multimodality of the problem, the chosen EA, and global exploration/local exploitation stages of the search process, different constraint handling methods can be effective during different stages of the search process. Motivated by these observations, we propose an ensemble of constraint handling techniques (ECHT) to solve constrained real-parameter optimization problems, where each constraint handling method has its own population. A distinguishing feature of the ECHT is the usage of every function call by each population associated with each constraint handling technique. Being a general concept, the ECHT can be realized with any existing EA. In this paper, we present two instantiations of the ECHT using four constraint handling methods with the evolutionary programming and differential evolution as the EAs. Experimental results show that the performance of ECHT is better than each single constraint handling method used to form the ensemble with the respective EA, and competitive to the state-of-the-art algorithms.", "paper_title": "Ensemble of Constraint Handling Techniques", "paper_id": "WOS:000283535700006"}