{"auto_keywords": [{"score": 0.03474563460250596, "phrase": "memory_accesses"}, {"score": 0.02733610848541187, "phrase": "proposed_data_structure"}, {"score": 0.00481495049065317, "phrase": "multiprefix_trie"}, {"score": 0.004741395005218184, "phrase": "new_data_structure_for_designing_dynamic_router-tables"}, {"score": 0.004692980391580608, "phrase": "ip_lookup"}, {"score": 0.004550669123303854, "phrase": "incoming_packet"}, {"score": 0.004106612344123407, "phrase": "important_role"}, {"score": 0.0038217146888983576, "phrase": "new_data_structure"}, {"score": 0.003611751858608048, "phrase": "dynamic_router-tables"}, {"score": 0.0030171910207671205, "phrase": "longest_matching_prefix"}, {"score": 0.002971016979295967, "phrase": "internal_node"}, {"score": 0.002494466951433885, "phrase": "dynamic_router-table_operations"}], "paper_keywords": ["Classless inter domain routing", " dynamic router-tables", " IP address lookup", " longest matching prefix", " multiprefix trie"], "paper_abstract": "IP lookup affects the speed of an incoming packet and the time required to determine which output port the packet should be sent to; hence, it plays an important role in the design of router-tables. In this paper, we propose a new data structure, called a multiprefix trie, for use in designing dynamic router-tables. One key feature of our data structure is that each node can store more than one prefix, which reduces the number of memory accesses. When performing lookup, the structure can search more prefixes in one node and may find the longest matching prefix in an internal node rather than on a leaf. Moreover, when updating the router-table, it does not need to reconstruct the table. As a by-product, the proposed data structure minimizes the time required for dynamic router-table operations, including lookup, insertion, and deletion, and also reduces the number of memory accesses. We report the results of experiments conducted to compare the proposed data structure with other structures using the benchmark IPv4 prefix database AS4637 with 219,581 prefixes.", "paper_title": "Multiprefix Trie: A New Data Structure for Designing Dynamic Router-Tables", "paper_id": "WOS:000288751800007"}