{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "everlasting_security"}, {"score": 0.008290099061016309, "phrase": "honest_parties"}, {"score": 0.00700326432459643, "phrase": "bounded_storage_model"}, {"score": 0.004751822933030409, "phrase": "storage_model"}, {"score": 0.0046402620167923896, "phrase": "storage_space"}, {"score": 0.004483705545285162, "phrase": "public_transmission"}, {"score": 0.004448330443523693, "phrase": "long_random_string_r"}, {"score": 0.0041972651315217765, "phrase": "encryption_schemes"}, {"score": 0.004131276214550217, "phrase": "appealing_property"}, {"score": 0.004012968487151253, "phrase": "encrypted_message"}, {"score": 0.0037071854953981435, "phrase": "private_information"}, {"score": 0.003688538972291721, "phrase": "low_storage_everlasting_security"}, {"score": 0.003629639728243997, "phrase": "high_storage_capacity"}, {"score": 0.0033975748841512036, "phrase": "hybrid_bounded_storage_model"}, {"score": 0.0031468450866998523, "phrase": "computationally_secure_key_agreement_protocol"}, {"score": 0.003089140979429533, "phrase": "shared_private_key"}, {"score": 0.0030647443558892355, "phrase": "bsm"}, {"score": 0.0030085317219673046, "phrase": "low_memory_requirements"}, {"score": 0.002699382455240472, "phrase": "semantic_security"}, {"score": 0.002670972967408955, "phrase": "negative_side"}, {"score": 0.0026219720371350942, "phrase": "low_storage_requirements"}, {"score": 0.0025806855118648245, "phrase": "black-box_reductions"}, {"score": 0.002553522361080638, "phrase": "bsm."}, {"score": 0.002454174800250118, "phrase": "previous_results"}, {"score": 0.002272906032304683, "phrase": "random_oracle"}, {"score": 0.002178679246985881, "phrase": "broadcast_string"}, {"score": 0.0021729212034657477, "phrase": "r._finally"}, {"score": 0.0021049977753042253, "phrase": "bounded_storage_oblivious_transfer_protocols"}], "paper_keywords": [""], "paper_abstract": "The bounded storage model (BSM) bounds the storage space of an adversary rather than its running time. It utilizes the public transmission of a long random string R of length r, and relies on the assumption that an eavesdropper cannot possibly store all of this string. Encryption schemes in this model achieve the appealing property of everlasting security. In short, this means that an encrypted message remains secure even if the adversary eventually gains more storage or gains knowledge of (original) secret keys that may have been used. However, if the honest parties do not share any private information in advance, then achieving everlasting security requires high storage capacity from the honest parties (storage of Omega(root r), as shown in [9]). We consider the idea of a hybrid bounded storage model were computational limitations on the eavesdropper are assumed up until the time that the transmission of R has ended. For example, can the honest parties run a computationally secure key agreement protocol in order to agree on a shared private key for the BSM, and thus achieve everlasting security with low memory requirements? We study the possibility and impossibility of everlasting security in the hybrid bounded storage model. We start by formally defining the model and everlasting security for this model. We show the equivalence of two flavors of definitions: indistinguishability of encryptions and semantic security. On the negative side, we show that everlasting security with low storage requirements cannot be achieved by black-box reductions in the hybrid BSM. This serves as a further indication to the hardness of achieving low storage everlasting security, adding to previous results of this nature [9,15]. On the other hand, we show two augmentations of the model that allow for low storage everlasting security. The first is by adding a random oracle to the model, while the second bounds the accessibility of the adversary to the broadcast string R. Finally, we show that in these two modified models, there also exist bounded storage oblivious transfer protocols with low storage requirements.", "paper_title": "On everlasting security in the hybrid bounded storage model", "paper_id": "WOS:000239475900017"}