{"auto_keywords": [{"score": 0.004623696669036629, "phrase": "small_arithmetic_circuit"}, {"score": 0.004509780213218666, "phrase": "oracle_access"}, {"score": 0.004440005714775306, "phrase": "n-variate_polynomials"}, {"score": 0.004384960761826366, "phrase": "finite_field"}, {"score": 0.004263581204982932, "phrase": "addition_gate"}, {"score": 0.004018249115372555, "phrase": "multilinear"}, {"score": 0.003906944616017869, "phrase": "multiplication_gates"}, {"score": 0.0038826383289526857, "phrase": "multilinear_polynomials"}, {"score": 0.003625009798162227, "phrase": "running_time"}, {"score": 0.0032701580015554025, "phrase": "time_algorithm"}, {"score": 0.0031696255948160923, "phrase": "succinct_representation"}, {"score": 0.0028237205895435733, "phrase": "remaining_linear_functions"}, {"score": 0.002595307614796063, "phrase": "quasi-polynomial_number"}, {"score": 0.002468747242613056, "phrase": "restricted_models"}, {"score": 0.0023630680726174627, "phrase": "even_just_two_multiplication_gates"}, {"score": 0.002283210560032092, "phrase": "factorization_algorithm"}, {"score": 0.002268983004273332, "phrase": "multivariate_black-box_polynomials"}, {"score": 0.0021991611806433634, "phrase": "locally_decodable_codes"}], "paper_keywords": ["arithmetic circuits", " exact learning", " interpolation", " reconstruction", " depth-3"], "paper_abstract": "In this paper we consider the problem of constructing a small arithmetic circuit for a polynomial for which we have oracle access. Our focus is on n-variate polynomials, over a finite field F, that have depth-3 arithmetic circuits (with an addition gate at the top) with two multiplication gates of degree at most d. We obtain the following results: 1. Multilinear case. When the circuit is multilinear (multiplication gates compute multilinear polynomials) we give an algorithm that outputs, with probability 1-o(1), all the depth-3 circuits with two multiplication gates computing the polynomial. The running time of the algorithm is poly(n, |F|). 2. General case. When the circuit is not multilinear we give a quasi-polynomial (in n, d, |F|) time algorithm that outputs, with probability 1-o(1), a succinct representation of the polynomial. In particular, if the depth-3 circuit for the polynomial is not of small depth-3 rank (namely, after removing the g. c. d. (greatest common divisor) of the two multiplication gates, the remaining linear functions span a not too small linear space), then we output the depth-3 circuit itself. In the case that the rank is small we output a depth-3 circuit with a quasi-polynomial number of multiplication gates. (sic) Prior to our work there have been several interpolation algorithms for restricted models. However, all the techniques used there completely fail when dealing with depth-3 circuits with even just two multiplication gates. Our proof technique is new and relies on the factorization algorithm for multivariate black-box polynomials, on lower bounds on the length of linear locally decodable codes with two queries, and on a theorem regarding the structure of identically zero depth-3 circuits with four multiplication gates.", "paper_title": "INTERPOLATION OF DEPTH-3 ARITHMETIC CIRCUITS WITH TWO MULTIPLICATION GATES", "paper_id": "WOS:000266018400002"}