{"auto_keywords": [{"score": 0.04465012940866223, "phrase": "biological_effects"}, {"score": 0.004773904938276846, "phrase": "dose_reconstruction"}, {"score": 0.004109454074072009, "phrase": "promising_methodology"}, {"score": 0.003788196352457501, "phrase": "chemical_absorption"}, {"score": 0.003331134183901191, "phrase": "multiple_scales"}, {"score": 0.0033026956021014204, "phrase": "biological_organization"}, {"score": 0.0028916124463906983, "phrase": "biomarker_levels"}, {"score": 0.002842428606954139, "phrase": "chemical_species"}, {"score": 0.0027230880516264685, "phrase": "foreign_chemical"}, {"score": 0.002665305036900055, "phrase": "chemical_dose"}, {"score": 0.00249919111154604, "phrase": "relevant_biomarkers"}, {"score": 0.0024252458095689847, "phrase": "population_variability"}, {"score": 0.0021414489155042885, "phrase": "broad_range"}, {"score": 0.0021049977753042253, "phrase": "dosesim"}], "paper_keywords": [""], "paper_abstract": "A: Assessing and improving the safety of chemicals and the efficacy of drugs depends on an understanding of the biodistribution, clearance and biological effects of the chemical(s) of interest. A promising methodology for the prediction of these phenomena is physiologically based pharmacokinetic/pharmacodynamic modeling, which centers on the prediction of chemical absorption, distribution, metabolism and excretion (pharmacokinetics) and the biological effects (pharmacodynamics) of the chemical on the organism. Strengths of this methodology include modeling across multiple scales of biological organization and facilitate the extrapolation of results across routes of exposure, dosing levels and species. It is also useful as the foundation for tools to (i) predict biomarker levels (concentrations of chemical species found in the body that indicate exposure to a foreign chemical), given a chemical dose or exposure; (ii) reconstruct a dose, given the levels of relevant biomarkers; and (iii) estimate population variability. Despite the importance and promise of physiologically based pharmacokinetic /pharmacodynamics-based approaches to forward and reverse dosimetry, there is currently a lack of user-friendly, freely available implementations that are accessible and useful to a broad range of users. DoseSim was developed to begin to fill this gap.", "paper_title": "DoseSim: a tool for pharmacokinetic/pharmacodynamic analysis and dose reconstruction", "paper_id": "WOS:000314892000019"}