{"auto_keywords": [{"score": 0.04911241438594345, "phrase": "non-trivial_loops"}, {"score": 0.038565030222758194, "phrase": "handle_and_tunnel_loops"}, {"score": 0.00481495049065317, "phrase": "reeb_graphs"}, {"score": 0.004529093447865156, "phrase": "geometric_features"}, {"score": 0.004245667843980468, "phrase": "tunnel_loops"}, {"score": 0.004188287972391714, "phrase": "broad_range"}, {"score": 0.003926105480202798, "phrase": "existing_efficient_algorithms"}, {"score": 0.0037818557818203188, "phrase": "special_type"}, {"score": 0.0036181717017041387, "phrase": "serious_drawback"}, {"score": 0.003485196263406553, "phrase": "exterior_spaces"}, {"score": 0.0033116807159861766, "phrase": "non-trivial_task"}, {"score": 0.0031467766123827717, "phrase": "surface_mesh"}, {"score": 0.0030936482163040823, "phrase": "undesirable_side-effect"}, {"score": 0.0030207674474548403, "phrase": "altered_surface_mesh"}, {"score": 0.002929573369977573, "phrase": "efficient_algorithm"}, {"score": 0.002764741440770032, "phrase": "large_meshes"}, {"score": 0.0026630475331025955, "phrase": "original_input_mesh"}, {"score": 0.002618064695883914, "phrase": "refined_version"}, {"score": 0.002530359917257626, "phrase": "reeb_graph"}, {"score": 0.0024455860314641243, "phrase": "initial_set"}, {"score": 0.0023636455694730787, "phrase": "tunnel_basis"}, {"score": 0.0023158019935841235, "phrase": "novel_strategy"}, {"score": 0.002284444272376043, "phrase": "handle_and_tunnel_basis_loops"}], "paper_keywords": ["geometric processing", " surface features", " handle and tunnel loops", " Reeb graph"], "paper_abstract": "A special family of non-trivial loops on a surface called handle and tunnel loops associates closely to geometric features of \"handles\" and \"tunnels\" respectively in a 3D model. The identification of these handle and tunnel loops can benefit a broad range of applications from topology simplification/repair, and surface parameterization, to feature and shape recognition. Many of the existing efficient algorithms for computing non-trivial loops cannot be used to compute these special type of loops. The two algorithms known for computing handle and tunnel loops provably have a serious drawback that they both require a tessellation of the interior and exterior spaces bounded by the surface. Computing such a tessellation of three dimensional space around the surface is a non-trivial task and can be quite expensive. Furthermore, such a tessellation may need to refine the surface mesh, thus causing the undesirable side-effect of outputting the loops on an altered surface mesh. In this paper, we present an efficient algorithm to compute a basis for handle and tunnel loops without requiring any 3D tessellation. This saves time considerably for large meshes making the algorithm scalable while computing the loops on the original input mesh and not on some refined version of it. We use the concept of the Reeb graph which together with several key theoretical insights on linking number provide an initial set of loops that provably constitute a handle and a tunnel basis. We further develop a novel strategy to tighten these handle and tunnel basis loops to make them geometrically relevant. We demonstrate the efficiency and effectiveness of our algorithm as well as show its robustness against noise, and other anomalies in the input.", "paper_title": "An Efficient Computation of Handle and Tunnel Loops via Reeb Graphs", "paper_id": "WOS:000321840100001"}