{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mohawk"}, {"score": 0.004615202066192795, "phrase": "verifying_access_control_policies"}, {"score": 0.004537631845923196, "phrase": "access-control_systems"}, {"score": 0.004499334809770281, "phrase": "desired_security_properties"}, {"score": 0.004404994123834589, "phrase": "important_problem"}, {"score": 0.004330941610682453, "phrase": "enterprise_access-control_systems"}, {"score": 0.0038461532860146535, "phrase": "bounded_model_checkers"}, {"score": 0.0037178514898264536, "phrase": "arbac"}, {"score": 0.0032184697893776052, "phrase": "verification_question"}, {"score": 0.0029565620771207003, "phrase": "bound-estimation_portion"}, {"score": 0.002785978280998868, "phrase": "reachability_graph"}, {"score": 0.0026701760128830573, "phrase": "state-change_rules"}, {"score": 0.0025375331660958665, "phrase": "conventional_bounded_model_checking"}, {"score": 0.0022722584151582616, "phrase": "access-control_policy_analysis_tool"}, {"score": 0.0022530375696567136, "phrase": "mohawk."}, {"score": 0.002168531704054597, "phrase": "realistic_policies"}, {"score": 0.0021049977753042253, "phrase": "prior_tools"}], "paper_keywords": ["Algorithms", " Security", " Verification"], "paper_abstract": "Verifying that access-control systems maintain desired security properties is recognized as an important problem in security. Enterprise access-control systems have grown to protect tens of thousands of resources, and there is a need for verification to scale commensurately. We present techniques for abstraction-refinement and bound-estimation for bounded model checkers to automatically find errors in Administrative Role-Based Access Control (ARBAC) security policies. ARBAC is the first and most comprehensive administrative scheme for Role-Based Access Control (RBAC) systems. In the abstraction-refinement portion of our approach, we identify and discard roles that are unlikely to be relevant to the verification question (the abstraction step). We then restore such abstracted roles incrementally (the refinement steps). In the bound-estimation portion of our approach, we lower the estimate of the diameter of the reachability graph from the worst-case by recognizing relationships between roles and state-change rules. Our techniques complement one another, and are used with conventional bounded model checking. Our approach is sound and complete: an error is found if and only if it exists. We have implemented our technique in an access-control policy analysis tool called MOHAWK. We show empirically that MOHAWK scales well to realistic policies, and provide a comparison with prior tools.", "paper_title": "MOHAWK: Abstraction-Refinement and Bound-Estimation for Verifying Access Control Policies", "paper_id": "WOS:000317427400004"}