{"auto_keywords": [{"score": 0.04373758664416466, "phrase": "atomic_action"}, {"score": 0.008314172198537756, "phrase": "isolated_atomic_action"}, {"score": 0.00481495049065317, "phrase": "isolated_protocols"}, {"score": 0.00469545352928726, "phrase": "refinement_development"}, {"score": 0.0044792964927609456, "phrase": "common_before-state"}, {"score": 0.004354387464909719, "phrase": "different_possible_outcomes"}, {"score": 0.0037681291547896198, "phrase": "relational_refinement"}, {"score": 0.003594507685403249, "phrase": "'big_diagram'_simulation"}, {"score": 0.0034941851527001146, "phrase": "'small_diagram'_simulation"}, {"score": 0.0033859850551189938, "phrase": "individual_step"}, {"score": 0.0030233895551146695, "phrase": "synchronisation_point"}, {"score": 0.0028839835971201846, "phrase": "backward_simulations"}, {"score": 0.002777088408582301, "phrase": "multiple_interleaved_transactions"}, {"score": 0.002733723435814484, "phrase": "clean_picture"}, {"score": 0.0026573612772397832, "phrase": "isolated_protocol"}, {"score": 0.002463970672403004, "phrase": "co-operating_agents"}, {"score": 0.002335542599406245, "phrase": "'ragged_starts"}, {"score": 0.00227743851871825, "phrase": "protocol_instantiations"}, {"score": 0.0022489295919084643, "phrase": "potential_overlaps"}, {"score": 0.002234808936443945, "phrase": "unrelated_protocol_instances"}, {"score": 0.0021655216339356693, "phrase": "existing_mondex_refinements"}, {"score": 0.0021049977753042253, "phrase": "mechanical_verification"}], "paper_keywords": ["Atomic actions", " Protocols", " Synchronisation", " Serialisation", " 2-Phase protocols", " Forward and backward simulation", " Refinement", " Mondex"], "paper_abstract": "Inspired by the properties of the refinement development of the Mondex Electronic Purse, we view an isolated atomic action as a family of transitions with a common before-state, and different after-states corresponding to different possible outcomes when the action is attempted. We view a protocol for an atomic action as a computation DAG, each path of which achieves in several steps one of the outcomes of the atomic action. We show that in this picture, the protocol can be viewed as a relational refinement of the atomic action in a number of ways. Firstly, it yields a 'big diagram' simulation A la ASM. Secondly, it yields a 'small diagram' simulation, in which the atomic action is synchronised with an individual step along each path through the protocol, and all the other steps of the path simulate skip. We show that provided each path through the protocol contains one step synchronised with the atomic action, the choice of synchronisation point can be made freely. We describe the relationship between such synchronisations and forward and backward simulations. We relate this theory to serialisations of system runs containing multiple interleaved transactions, showing how the clean picture of the refinement of an isolated atomic action to an isolated protocol becomes obscured by the details of the interleaving. In effect, the fact that protocols are typically executed by a number of co-operating agents, not all of which embark on executing the protocol at the same moment, results in 'ragged starts' and 'ragged ends' to protocol instantiations, leading to potential overlaps between unrelated protocol instances that the theory must handle. We show how existing Mondex refinements embody the ideas developed, and describe a mechanical verification of the results presented.", "paper_title": "Atomic actions, and their refinements to isolated protocols", "paper_id": "WOS:000273979400003"}