{"auto_keywords": [{"score": 0.048835745230446155, "phrase": "online_optimizations"}, {"score": 0.004640808212832262, "phrase": "miss_rate_curves"}, {"score": 0.004155113657645735, "phrase": "optimal_cache_sizes"}, {"score": 0.004025885154716127, "phrase": "shared-cache_multicore_processor"}, {"score": 0.003312901888725435, "phrase": "low-overhead_software_technique"}, {"score": 0.0031929098985796814, "phrase": "current_processors"}, {"score": 0.0029501745152877706, "phrase": "application_source_code"}, {"score": 0.002813457986293993, "phrase": "rapidmrc"}, {"score": 0.0027547408718334603, "phrase": "single_probing_period"}, {"score": 0.002440071551819324, "phrase": "obtained_mrcs"}, {"score": 0.0021612684684351974, "phrase": "cache_partitions"}, {"score": 0.0021049977753042253, "phrase": "performance_improvements"}], "paper_keywords": ["Experimentation", " Measurement", " Performance", " Management"], "paper_abstract": "Miss rate curves (MRCs) are useful in a number of contexts. In our research, online L2 cache MRCs enable us to dynamically identify optimal cache sizes when cache-partitioning a shared-cache multicore processor. Obtaining L2 MRCs has generally been assumed to be expensive when done in software and consequently, their usage for online optimizations has been limited. To address these problems and opportunities, we have developed a low-overhead software technique to obtain L2 MRCs online on current processors, exploiting features available in their performance monitoring units so that no changes to the application source code or binaries are required. Our technique, called RapidMRC, requires a single probing period of roughly 221 million processor cycles (147 ms), and subsequently 124 million cycles (83 ms) to process the data. We demonstrate its accuracy by comparing the obtained MRCs to the actual L2 MRCs of 30 applications taken from SPECcpu2006, SPECcpu2000, and SPECjbb2000. We show that RapidMRC can be applied to sizing cache partitions, helping to achieve performance improvements of up to 27%.", "paper_title": "RapidMRC: Approximating L2 Miss Rate Curves on Commodity Systems for Online Optimizations", "paper_id": "WOS:000266820200011"}