{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "energy_savings"}, {"score": 0.004674952036988355, "phrase": "key_inputs"}, {"score": 0.004592905436175987, "phrase": "energy_and_comfort_management_systems"}, {"score": 0.004539005582217309, "phrase": "detailed_and_precise_office_activity_information"}, {"score": 0.004253618550301311, "phrase": "monitored_areas"}, {"score": 0.003562912424153324, "phrase": "user_comfort"}, {"score": 0.0034185505275141077, "phrase": "activity_recognition_solution"}, {"score": 0.0031100973266506163, "phrase": "comfort_management_systems"}, {"score": 0.0030554300179552415, "phrase": "proposed_solution"}, {"score": 0.002966438503447793, "phrase": "ontological_approach"}, {"score": 0.0027146742941153443, "phrase": "seven_typical_office_activities"}, {"score": 0.0023834640793589435, "phrase": "coffee_break"}, {"score": 0.0021049977753042253, "phrase": "average_accuracy"}], "paper_keywords": ["Energy saving buildings", " Ontological reasoning", " Activity recognition"], "paper_abstract": "One of the key inputs for building energy and comfort management systems is detailed and precise office activity information, i.e., what is happening in each of the monitored areas (e.g., working place, meeting room, coffee corner, etc.). Such information can be used to control appliances for saving energy while still satisfying user comfort needs accordingly. We propose an activity recognition solution that effectively handles multiple-user, multiple-area situations, rapidly recognizing office activities as inputs for building energy and comfort management systems. The proposed solution is based on an ontological approach, using low-cost, binary, and wireless sensors. Through initial experiments, our prototype is able to recognize seven typical office activities (working at a desk with or without a PC, having a meeting, giving a presentation, having a coffee break, and presence/absence) at three office activity areas (working room, meeting room, and coffee corner) for two persons with average accuracy of more than 92%.", "paper_title": "Ontology-based office activity recognition with applications for energy savings", "paper_id": "WOS:000351241600006"}