{"auto_keywords": [{"score": 0.03625279201562384, "phrase": "sparse_regression"}, {"score": 0.019779581519119745, "phrase": "graph_embedding"}, {"score": 0.01303090391384611, "phrase": "proposed_framework"}, {"score": 0.010612387000973441, "phrase": "joint_graph_embedding"}, {"score": 0.010375584776531884, "phrase": "dimensionality_reduction"}, {"score": 0.004761644347346842, "phrase": "sparse_regression_method"}, {"score": 0.0045804107341714, "phrase": "large_number"}, {"score": 0.004357245559948974, "phrase": "different_motivations"}, {"score": 0.004144908086646161, "phrase": "common_framework"}, {"score": 0.003960831041259951, "phrase": "significant_features"}, {"score": 0.003871869188502677, "phrase": "sparse_regression_algorithms"}, {"score": 0.003257727050827128, "phrase": "constructed_graph"}, {"score": 0.0030707512751243214, "phrase": "objective_functions"}, {"score": 0.0025951294037626174, "phrase": "unsupervised_learning_algorithms"}, {"score": 0.0024572448003065423, "phrase": "optimization_problem"}, {"score": 0.0022847009758393405, "phrase": "feature_selection"}, {"score": 0.002203016940021265, "phrase": "seven_standard_databases"}, {"score": 0.0021049977753042253, "phrase": "recognition_performance"}], "paper_keywords": ["Graph embedding", " sparse regression", " feature selection", " subspace learning", " L-2,L-1-norm"], "paper_abstract": "Over the past few decades, a large number of algorithms have been developed for dimensionality reduction. Despite the different motivations of these algorithms, they can be interpreted by a common framework known as graph embedding. In order to explore the significant features of data, some sparse regression algorithms have been proposed based on graph embedding. However, the problem is that these algorithms include two separate steps: 1) embedding learning and 2) sparse regression. Thus their performance is largely determined by the effectiveness of the constructed graph. In this paper, we present a framework by combining the objective functions of graph embedding and sparse regression so that embedding learning and sparse regression can be jointly implemented and optimized, instead of simply using the graph spectral for sparse regression. By the proposed framework, supervised, semisupervised, and unsupervised learning algorithms could be unified. Furthermore, we analyze two situations of the optimization problem for the proposed framework. By adopting an L-2,L-1-norm regularization for the proposed framework, it can perform feature selection and subspace learning simultaneously. Experiments on seven standard databases demonstrate that joint graph embedding and sparse regression method can significantly improve the recognition performance and consistently outperform the sparse regression method.", "paper_title": "A Framework of Joint Graph Embedding and Sparse Regression for Dimensionality Reduction", "paper_id": "WOS:000351088600002"}