{"auto_keywords": [{"score": 0.03955596240607207, "phrase": "information_objects"}, {"score": 0.00481495049065317, "phrase": "data_dissemination"}, {"score": 0.004613516457919661, "phrase": "peer_network"}, {"score": 0.004420472010542188, "phrase": "available_information_objects"}, {"score": 0.004326987090971404, "phrase": "modern_algorithms"}, {"score": 0.004175533280178052, "phrase": "peer_ids"}, {"score": 0.0038744481564444173, "phrase": "data_pieces"}, {"score": 0.0037924666577694222, "phrase": "set_o"}, {"score": 0.003105979498529766, "phrase": "equal_probability"}, {"score": 0.003029382820031577, "phrase": "fresh_samples"}, {"score": 0.0028511121935559072, "phrase": "communication_overhead"}, {"score": 0.002751174423568564, "phrase": "fair_and_small_k-samples"}, {"score": 0.002635850034826311, "phrase": "particular_usage"}, {"score": 0.0026171036268367713, "phrase": "uniform_sampling"}, {"score": 0.002454258761940649, "phrase": "non-uniform_sampling"}, {"score": 0.002359759876402679, "phrase": "smallest_possible_fair_k-sample"}, {"score": 0.002309754152767196, "phrase": "available_dependencies"}, {"score": 0.0022608057001451414, "phrase": "sample_size"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["data dissemination", " heterogeneous information", " peer-to-peer", " peer sampling"], "paper_abstract": "We consider data dissemination in a peer-to-peer network, where each user wishes to obtain some subset of the available information objects. In most of the modern algorithms for such data dissemination, the users periodically obtain samples of peer IDs (possibly with some summary of their content). They then use the samples for connecting to other peers and downloading data pieces from them. For a set O of information objects, we call a sample of peers, containing at least k possible providers for each object o is an element of O, a k-sample. In order to balance the load, the k-samples should be fair, in the sense that for every object, its providers should appear in the sample with equal probability. Also, since most algorithms send fresh samples frequently, the size of the k-samples should be as small as possible, to minimize communication overhead. We describe in this paper two novel techniques for generating fair and small k-samples in a P2P setting. The first is based on a particular usage of uniform sampling and has the advantage that it allows to build on standard P2P uniform sampling tools. The second is based on non-uniform sampling and requires more particular care, but is guaranteed to generate the smallest possible fair k-sample. The two algorithms exploit available dependencies between information objects to reduce the sample size, and are proved, both theoretically and experimentally, to be extremely effective. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Compact samples for data dissemination", "paper_id": "WOS:000256462000004"}