{"auto_keywords": [{"score": 0.04493359254818517, "phrase": "wireless_sensor_networks"}, {"score": 0.004688321299229397, "phrase": "sensor_networks"}, {"score": 0.004444921827311577, "phrase": "pertinent_features"}, {"score": 0.004242291530697285, "phrase": "ieee_standards"}, {"score": 0.004021954624114115, "phrase": "main_features"}, {"score": 0.003942299471749811, "phrase": "mac_protocols"}, {"score": 0.0030189426536422577, "phrase": "large_networks"}, {"score": 0.002861961643289598, "phrase": "clear_winner"}, {"score": 0.0027495914857929584, "phrase": "best_protocol"}, {"score": 0.0026771333996253783, "phrase": "underlying_technology"}, {"score": 0.0024545413637350765, "phrase": "particular_sensing_application"}, {"score": 0.002389839896897424, "phrase": "main_focus"}, {"score": 0.0023113506171584157, "phrase": "mac_layer"}], "paper_keywords": ["IEEE Std 802.15.1", " IEEE Std 802.15.4", " medium access control (MAC) protocols", " bluetooth", " time-division multiplex (TDM)", " carrier-sense multiple access with collision avoidance (CSMA-CA)"], "paper_abstract": "In this paper we compare the pertinent features of the two emerging technologies for wireless sensor networks: IEEE Standards 802.15.1 and 802.15.4. We review the main features of the MAC protocols defined by those standards, describe their operation, and compare them in terms of characteristics such as performance (access and end-to-end packet delays), bandwidth utilization, and scalability for the deployment of large networks. Our findings indicate that there is no clear winner in all categories; the best protocol (and the underlying technology) to use, are heavily dependent upon the requirements for a particular sensing application. While the main focus of our analysis is the MAC layer, certain important parameters of the Physical (PHY) layer are considered as well, together with some other networking aspects. The results of this analysis should be of interest to the designer and operators of wireless sensor networks.", "paper_title": "Sensing with one or with four? A comparison of two IEEE 802.15.x protocols for use in sensor networks", "paper_id": "WOS:000244425700007"}