{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_filtering"}, {"score": 0.04746040725383538, "phrase": "scottish_public_library_authorities"}, {"score": 0.04642059407256737, "phrase": "public_access_internet_management_tool"}, {"score": 0.037749103834791596, "phrase": "public_library_services"}, {"score": 0.004783232571029632, "phrase": "scottish_public_libraries"}, {"score": 0.00424659225577246, "phrase": "filtering_systems"}, {"score": 0.003961694867182568, "phrase": "actual_policies"}, {"score": 0.003871024872459116, "phrase": "library_authority"}, {"score": 0.003832801887709817, "phrase": "public_access"}, {"score": 0.0036958398682001015, "phrase": "literature_review"}, {"score": 0.0034706569037527774, "phrase": "information_requests"}, {"score": 0.003216285378512588, "phrase": "filtering_software"}, {"score": 0.0031845067058084583, "phrase": "internet_access"}, {"score": 0.003153041030690117, "phrase": "main_justifications"}, {"score": 0.003060491505805715, "phrase": "illegal_or_inappropriate_materials"}, {"score": 0.002789528662623221, "phrase": "external_it_staff"}, {"score": 0.002752824177838148, "phrase": "major_issues"}, {"score": 0.0027166013332405453, "phrase": "historical_role"}, {"score": 0.0025257081555100556, "phrase": "local_authorities"}, {"score": 0.002500820522034446, "phrase": "uk"}, {"score": 0.002387415084371473, "phrase": "geographic_sample"}, {"score": 0.002118993962770973, "phrase": "public_libraries"}, {"score": 0.0021050046721435936, "phrase": "scotland"}], "paper_keywords": ["Internet filtering", " Equity of access", " Public libraries", " Access policies", " United Kingdom", " Libraries", " Internet"], "paper_abstract": "Purpose - The purpose of this paper is to examine the way that Scottish public library authorities are implementing filtering software as a public access internet management tool. The aim of the study is to determine the extent to which filtering systems are used as a public access internet management tool and to examine the nature of this implementation. This constitutes an analysis of the actual policies and procedures in place within each library authority to manage public access to the internet. Design/methodology/approach - The paper utilizes a literature review and an analysis of data supplied by the public library services. The data required was gathered through Freedom of Information requests sent to all Scottish public library authorities. Findings - A total of 31 of the 32 public library services operating within the 32 Scottish local authorities utilized some form of filtering software to control internet access. The main justifications cited for this were to prevent access to illegal or inappropriate materials; however it was found that in the majority of cases the decision to implement the software was not made by the management of the library but external IT staff. This raises major issues related to the historical role of the librarian as selector of content for their community. Research limitations/implications - The paper presents results from a subset of local authorities in the UK, thus cannot claim to be anything more than indicative of the geographic sample. Practical implications - The findings can help inform the rationale utilized by public library services in implementing filtering policies. Originality/value - This paper is the only paper to directly address the issue of internet filtering in all public libraries in Scotland.", "paper_title": "The implementation of internet filtering in Scottish public libraries", "paper_id": "WOS:000317150400005"}