{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "topology_optimization"}, {"score": 0.004693167092003573, "phrase": "static_and_dynamic_constraints"}, {"score": 0.0044873778175404475, "phrase": "outstanding_advantages"}, {"score": 0.0043738432231020885, "phrase": "sectional_optimization"}, {"score": 0.0036788184374592706, "phrase": "comparatively_large_cost"}, {"score": 0.0034725269588525534, "phrase": "fundamental_frequencies"}, {"score": 0.0033200826267264383, "phrase": "easily_obtained_characteristics"}, {"score": 0.003113804826864362, "phrase": "dangerous_resonance_phenomenon"}, {"score": 0.003054450075234415, "phrase": "dynamic_excitations"}, {"score": 0.002738797804069541, "phrase": "truss_structures"}], "paper_keywords": ["Topology optimization", " Charged system search (CSS)", " Truss structures", " Static and dynamic constraints"], "paper_abstract": "Topology optimization of structures reveals outstanding advantages when compared to sectional optimization. Many unnecessary members and nodes may exist in a structure and a topology optimization provides an opportunity to remove them. This advantage will specially become apparent when comparatively large cost of the nodes is taken into account. Fundamental frequencies of a structure are important, easily obtained characteristics which allow the designer to keep out from the dangerous resonance phenomenon. When dynamic excitations are critical, these characteristics cannot be neglected. In this paper, topology optimization of truss structures is investigated considering stress, displacement, buckling and frequency constraints. To perform such an optimization is not simple because of large, highly nonlinear and non-convex search space. Here the newly developed charged system search algorithm is used to accomplish this optimization. (C) 2012 Elsevier B. V. All rights reserved.", "paper_title": "Topology optimization of trusses considering static and dynamic constraints using the CSS", "paper_id": "WOS:000319205200045"}