{"auto_keywords": [{"score": 0.03577773358930474, "phrase": "learning_process"}, {"score": 0.015719716506582538, "phrase": "constructivist_learning_methods"}, {"score": 0.015233268351698488, "phrase": "different_types"}, {"score": 0.013384500583422358, "phrase": "ict_education"}, {"score": 0.0047810714349158165, "phrase": "supporting_tooling"}, {"score": 0.004330941610682453, "phrase": "constructivist_methods"}, {"score": 0.0042102651938187114, "phrase": "social_and_constructivist_theories"}, {"score": 0.004007083686875716, "phrase": "literature_review"}, {"score": 0.0038407203087210775, "phrase": "supportive_tools"}, {"score": 0.003813669883040509, "phrase": "specific_ict_areas"}, {"score": 0.0034543031591181546, "phrase": "educational_tooling"}, {"score": 0.0033579708256295847, "phrase": "learning_benefits"}, {"score": 0.003241312187060814, "phrase": "different_combinations"}, {"score": 0.0031845067058084583, "phrase": "tooling_implementations"}, {"score": 0.0029357204796552653, "phrase": "studied_learning_scenarios"}, {"score": 0.0028336894532993047, "phrase": "scaffolding_techniques"}, {"score": 0.002530359917257626, "phrase": "pedagogical_methods"}, {"score": 0.0025125151618810523, "phrase": "activity_flows"}, {"score": 0.00241658945942583, "phrase": "specific_actions"}, {"score": 0.002316105585203396, "phrase": "generic_tool"}, {"score": 0.002211947103318718, "phrase": "different_supportive_tools"}, {"score": 0.0021049977753042253, "phrase": "specific-purpose_tooling"}], "paper_keywords": ["Literature Review", " ICT Engineering Education", " Teaching and Learning Strategies", " Constructivism", " Scaffolding"], "paper_abstract": "Information and Communication Technology (ICT) engineering education is facing a decreasing interest by students. To deal with this issue, a need for shifting from traditional learning approaches to constructivist methods has been identified. Several pedagogical methodologies based on social and constructivist theories are being applied to engage students in ICT education. This paper presents a literature review of studies carried out from 2000 to 2010 that have applied constructivist learning methods with supportive tools to specific ICT areas. From the analysis of the literature review this paper identifies the most representative constructivist learning methods within the field of ICT education. In particular, we pay attention to the educational tooling used to support the learning process and the learning benefits of applying such methods. The analysis also reveals that different combinations of guidance approaches and tooling implementations are often adopted to scaffold the learning process. With the aim of understanding to what extent and how scaffolding is present in the studied learning scenarios, this document proposes a definition of different types of scaffolding techniques. Namely: social-guidance and system-guidance scaffolding, depending on whether an individual or a tool is the responsible for providing support to students; macro-scaffolding when pedagogical methods define activity flows, or micro-scaffolding when the support is provided to perform specific actions within activities; and tool-enveloped scaffolding, when a generic tool such a learning management system scaffolds the learning process by the integration of different supportive tools, and tool-embedded scaffolding when the scaffolding is applied within a specific-purpose tooling.", "paper_title": "A Review of Constructivist Learning Methods with Supporting Tooling in ICT Higher Education: Defining Different Types of Scaffolding", "paper_id": "WOS:000313205600008"}