{"auto_keywords": [{"score": 0.03108426086192512, "phrase": "evaluation_biases"}, {"score": 0.011235438943195803, "phrase": "normal_distributions"}, {"score": 0.00481495049065317, "phrase": "non-parametric_hypothesis_testing_model"}, {"score": 0.004619295212985837, "phrase": "software_debugging"}, {"score": 0.004431554974667461, "phrase": "program_feature_spectra"}, {"score": 0.004401011982385274, "phrase": "passed_runs"}, {"score": 0.0043106348117582915, "phrase": "existing_approaches"}, {"score": 0.0042809216371527785, "phrase": "estimation_formulas"}, {"score": 0.004236733825313407, "phrase": "mean_values"}, {"score": 0.004193000200816171, "phrase": "underlying_program_feature_spectra"}, {"score": 0.004022515690178811, "phrase": "non-parametric_approach"}, {"score": 0.003939880387831148, "phrase": "fault-relevant_positions"}, {"score": 0.0037019839121200508, "phrase": "underlying_properties"}, {"score": 0.0036384794303356413, "phrase": "fault_localization"}, {"score": 0.0035147084172295123, "phrase": "feature_spectra"}, {"score": 0.003490462324829042, "phrase": "program_elements"}, {"score": 0.0033951334049808733, "phrase": "parametric_techniques"}, {"score": 0.0031789986177545586, "phrase": "program_predicate_perspective"}, {"score": 0.003124437382827821, "phrase": "experimental_study"}, {"score": 0.0030814613175385672, "phrase": "siemens_suite"}, {"score": 0.0023847032316716503, "phrase": "evaluation_bias"}, {"score": 0.002149231173009159, "phrase": "underlying_program_spectra"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fault localization", " Non-parametric", " Hypothesis testing", " Normality"], "paper_abstract": "Fault localization is one of the most difficult activities in software debugging. Many existing statistical fault-localization techniques estimate the fault positions of programs by comparing the program feature spectra between passed runs and failed runs. Some existing approaches develop estimation formulas based on mean values of the underlying program feature spectra and their distributions alike. Our previous work advocates the use of a non-parametric approach in estimation formulas to pinpoint fault-relevant positions. It is worthy of further study to resolve the two schools of thought by examining the fundamental, underlying properties of distributions related to fault localization. In particular, we ask: Can the feature spectra of program elements be safely considered as normal distributions so that parametric techniques can be soundly and powerfully applied? In this paper, we empirically investigate this question from the program predicate perspective. We conduct an experimental study based on the Siemens suite of programs. We examine the degree of normality on the distributions of evaluation biases of the predicates, and obtain three major results from the study. First, almost all examined distributions of evaluation biases are either normal or far from normal, but not in between. Second, the most fault-relevant predicates are less likely to exhibit normal distributions in terms of evaluation biases than other predicates. Our results show that normality is not common as far as evaluation bias can represent. Furthermore, the effectiveness of our non-parametric predicate-based fault-localization technique weakly correlates with the distributions of evaluation biases, making the technique robust to this type of uncertainty in the underlying program spectra. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Is non-parametric hypothesis testing model robust for statistical fault localization?", "paper_id": "WOS:000270619300009"}