{"auto_keywords": [{"score": 0.032156246811331966, "phrase": "intimate_relationships"}, {"score": 0.014466609932748245, "phrase": "geographic_distance"}, {"score": 0.010504395856650564, "phrase": "hci_research"}, {"score": 0.008320542473767947, "phrase": "hci"}, {"score": 0.00481495049065317, "phrase": "human-computer_interaction's_approach"}, {"score": 0.004606843145343611, "phrase": "communication_technology"}, {"score": 0.004235793609579307, "phrase": "five_themes"}, {"score": 0.003775803846431323, "phrase": "existing_practices"}, {"score": 0.003066945490483524, "phrase": "social_psychology"}, {"score": 0.002721464488351771, "phrase": "holistic_experience"}, {"score": 0.0021426288417854987, "phrase": "technological_support"}, {"score": 0.0021049977753042253, "phrase": "geographically_distant_intimates"}], "paper_keywords": ["mediated intimacy", " HCI", " social impact"], "paper_abstract": "An analysis of information and communication technology designed to support communication between intimates at a geographic distance is carried out via a framework that consists of five themes. This framework was developed by considering what has emerged from human-computer interaction's (HCI) research on supporting mediated intimacy. Themes are: (1) drawing on existing practices, (2) a focus on the capability of technology, (3) increasing levels of contact, (4) idealising intimacy, and (5) prescribing what constitutes intimacy. The HCI research on intimacy is explored thematically in light of the social psychology of intimate relationships. The tensions that are reported in HCI research on intimacy can be interpreted as emanating from a tendency to fragment what is necessarily a holistic experience. Intimate relationships are complex and delicately balanced, thus a reductionist approach to mediating intimacy may be undermining HCI's potential to address the challenge of supporting intimates living at a geographic distance. While a fragmentation of the experience of intimacy can be methodologically productive for HCI, a more holistic approach to intimate relationships may enhance technological support for communication between geographically distant intimates.", "paper_title": "Maintaining intimacy at a distance: an exploration of human-computer interaction's approach to mediating intimacy", "paper_id": "WOS:000340299600003"}