{"auto_keywords": [{"score": 0.02774181557759339, "phrase": "online_communities"}, {"score": 0.016874843064572414, "phrase": "interaction_patterns"}, {"score": 0.012066804425221565, "phrase": "online_community"}, {"score": 0.009832008478480321, "phrase": "individual_participants"}, {"score": 0.007210445693511993, "phrase": "individual_participant"}, {"score": 0.00481495049065317, "phrase": "online_community_dynamics"}, {"score": 0.004550256658193504, "phrase": "centrality_measure"}, {"score": 0.004525422904374878, "phrase": "different_roles"}, {"score": 0.004371245822400339, "phrase": "individual_participant's_role"}, {"score": 0.00433154951134118, "phrase": "information_sharing_activities"}, {"score": 0.003982778635612119, "phrase": "log_files"}, {"score": 0.003968266142987231, "phrase": "korean_online_discussion_communities"}, {"score": 0.003925043932432774, "phrase": "crawler_program"}, {"score": 0.003903608996333321, "phrase": "social_network_analysis"}, {"score": 0.0038190289897059456, "phrase": "centrality_measures"}, {"score": 0.0037912433212001664, "phrase": "time_series_cross-sectional_analysis"}, {"score": 0.003675383584521095, "phrase": "longitudinal_setting"}, {"score": 0.0035630518377071916, "phrase": "previous_time_periods"}, {"score": 0.003524227590204673, "phrase": "current_periods"}, {"score": 0.003422744912405573, "phrase": "discussion_issues"}, {"score": 0.0033916328188225843, "phrase": "different_interaction_patterns"}, {"score": 0.0032939556818556595, "phrase": "network_variable"}, {"score": 0.003252108434817128, "phrase": "large_online_community"}, {"score": 0.0032049315080707546, "phrase": "strong_impact"}, {"score": 0.0031297196594081964, "phrase": "participant's_behaviors"}, {"score": 0.0030064251340251196, "phrase": "future_studies"}, {"score": 0.0028827015183359008, "phrase": "practical_implications_-_online_communities"}, {"score": 0.002835681717699601, "phrase": "public_opinions"}, {"score": 0.002659984828725904, "phrase": "large_online_communities"}, {"score": 0.0025975282109677086, "phrase": "right_way"}, {"score": 0.0025786066704445304, "phrase": "right_time"}, {"score": 0.0025691975171205504, "phrase": "social_implications"}, {"score": 0.002564505790176378, "phrase": "-_online_communities"}, {"score": 0.0025180559929210552, "phrase": "free_exchange"}, {"score": 0.0024997119121882372, "phrase": "personal_information"}, {"score": 0.002463422700287848, "phrase": "social_network"}, {"score": 0.0024499501461252475, "phrase": "massive_influence"}, {"score": 0.002370644470486607, "phrase": "important_role"}, {"score": 0.0022074923009656987, "phrase": "subjective_data"}, {"score": 0.0021954163595717716, "phrase": "participant's_perception_data"}, {"score": 0.0021794175785436794, "phrase": "particular_time"}, {"score": 0.0021049977753042253, "phrase": "vast_amount"}], "paper_keywords": ["Information sharing", " Online community", " Social network analysis", " Centrality", " Time series analysis"], "paper_abstract": "Purpose - The purpose of this paper is to explore the dynamics of an online community by examining its participants' centrality measures: degree, closeness, and the betweenness centrality. Each centrality measure shows the different roles and positions of an individual participant within an online community. To be specific, this research examines how an individual participant's role and position affects her/his information sharing activities within an online community over time. Additionally, it investigates the differences between two different online communities (a personal interest focussed community and a social interest focussed community), in terms of the interaction patterns of participants. Design/methodology/approach - For this research, the authors collected log files from Korean online discussion communities (cafe.naver.com) using a crawler program. A social network analysis was used to explore the interaction patterns of participants and calculate the centrality measures of individual participants. Time series cross-sectional analysis was used to analyze the effects of the roles and the positions on their information sharing activities in a longitudinal setting. Findings - The results of this research showed that all three centrality measures of an individual participant in previous time periods positively influenced his/her information sharing activity in the current periods. In addition, this research found that, depending on the nature of the discussion issues, the participants showed different interaction patterns. Throughout this research, the authors explored the interaction patterns of individual participants by using a network variable, the centrality, within a large online community, and found that the interaction patterns provided strong impact on their information sharing activities in the following months. Research limitations/implications - To investigate the changes of participant's behaviors, this study simply relies on the numbers of comments received and posted without considering the contents of the comments. Future studies might need to analyze the contents of the comments exchanged between participants, as well as the social network among participants. Practical implications - Online communities have developed to take a more active role in inviting public opinions and promoting discussion about various socio-economic issues. Governments and companies need to understand the dynamics which are created by the interactions among many participants. This study offers them a framework for analyzing the dynamics of large online communities. Furthermore, it helps them to respond to online communities in the right way and in the right time. Social implications - Online communities do not merely function as a platform for the free exchange and sharing of personal information and knowledge, but also as a social network that exerts massive influence in various parts of society including politics, economy, and culture. Now online communities become playing an important role in our society. By examining communication or interaction behaviors of individual participants, this study tries to understand how the online communities are evolved over time. Originality/value - In the area of online communities, many previous studies have relied on the subjective data, like participant's perception data, in a particular time by using survey or interview. However, this study explores the dynamics of online communities by analyzing the vast amount of data accumulated in online communities.", "paper_title": "Longitudinal analysis of online community dynamics", "paper_id": "WOS:000356441200005"}