{"auto_keywords": [{"score": 0.04206676320028, "phrase": "ordered_position"}, {"score": 0.029420333683948755, "phrase": "ivif-phwa_operator"}, {"score": 0.00481495049065317, "phrase": "decision_making"}, {"score": 0.004765173195920904, "phrase": "interval-valued_intuitionistic_fuzzy_numbers"}, {"score": 0.004362226376603478, "phrase": "accurate_description"}, {"score": 0.004317109072311102, "phrase": "incomplete_and_uncertain_information"}, {"score": 0.004250302819248558, "phrase": "existing_ivifn-based_works"}, {"score": 0.0037321585095070483, "phrase": "practical_use"}, {"score": 0.003434085751246066, "phrase": "interval-valued_intuitionistic_fuzzy_prioritized_hybrid_weighted_aggregation"}, {"score": 0.0028325548627901004, "phrase": "uphwa_operator"}, {"score": 0.002512850690695835, "phrase": "incomplete_and_imprecise_information"}, {"score": 0.0024103044278902916, "phrase": "ivif-phwa_operator-based_multi-attribute_decision"}, {"score": 0.0022879728308318205, "phrase": "ivif_environment"}, {"score": 0.0022291501521610737, "phrase": "practical_example"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Interval-valued intuitionistic fuzzy set", " multi-attribute decision making", " hybrid weighted aggregation operator", " prioritization relationship"], "paper_abstract": "Interval-valued intuitionistic fuzzy numbers (IVIFNs) are usually utilized in multi-attribute decision making problems, providing an accurate description of incomplete and uncertain information. The existing IVIFN-based works mainly focus on either the prioritization relationship of attributes or both the importance and the ordered position of them. However, these aspects of attributes are all important in practical use and they should be simultaneously considered. To this end, this paper proposes an interval-valued intuitionistic fuzzy prioritized hybrid weighted aggregation (IVIF-PHWA) operator. The contribution of this paper is threefold: 1) A unit prioritized hybrid weighted aggregation (UPHWA) operator is proposed, which considers the prioritization relationship, the importance and the ordered position of attributes. 2) The UPHWA operator is extended into IVIF-PHWA operator, whose properties are all investigated. These properties illustrate that the IVIF-PHWA operator can better deal with the incomplete and imprecise information. 3) This work develops an IVIF-PHWA operator-based multi-attribute decision making method to solve the decision making problems in IVIF environment. Finally, a practical example is provided to validate the efficiency and effectiveness of the proposed approach.", "paper_title": "Interval-valued intuitionistic fuzzy prioritized hybrid weighted aggregation operator and its application in decision making", "paper_id": "WOS:000364407900039"}