{"auto_keywords": [{"score": 0.04710047763260585, "phrase": "patch-based_methods"}, {"score": 0.02985638999130369, "phrase": "spectral_decomposition"}, {"score": 0.00481495049065317, "phrase": "global_image_denoising"}, {"score": 0.00443141503046841, "phrase": "patch_matching"}, {"score": 0.0042351951710402425, "phrase": "sufficiently_similar_patches"}, {"score": 0.004047628461126961, "phrase": "diminishing_returns"}, {"score": 0.003971938976270902, "phrase": "performance_improvement"}, {"score": 0.003853757393357659, "phrase": "lower_likelihood"}, {"score": 0.003810348067898898, "phrase": "sufficiently_close_matches"}, {"score": 0.0037674258625824113, "phrase": "net_effect"}, {"score": 0.0032026066791743866, "phrase": "truly_global_filtering"}, {"score": 0.0028919522313933525, "phrase": "statistical_analysis"}, {"score": 0.0025335509856200433, "phrase": "nystrom_extension"}, {"score": 0.0024487847651989128, "phrase": "global_filter"}, {"score": 0.0023758152068732025, "phrase": "fairly_small_percentage"}, {"score": 0.0022363199197710385, "phrase": "existing_denoising_filters"}, {"score": 0.0021049977753042253, "phrase": "best_patch-based_methods"}], "paper_keywords": ["Image denoising", " non-local filters", " Nystrom extension", " spatial domain filter", " risk estimator"], "paper_abstract": "Most existing state-of-the-art image denoising algorithms are based on exploiting similarity between a relatively modest number of patches. These patch-based methods are strictly dependent on patch matching, and their performance is hamstrung by the ability to reliably find sufficiently similar patches. As the number of patches grows, a point of diminishing returns is reached where the performance improvement due to more patches is offset by the lower likelihood of finding sufficiently close matches. The net effect is that while patch-based methods, such as BM3D, are excellent overall, they are ultimately limited in how well they can do on (larger) images with increasing complexity. In this paper, we address these shortcomings by developing a paradigm for truly global filtering where each pixel is estimated from all pixels in the image. Our objectives in this paper are two-fold. First, we give a statistical analysis of our proposed global filter, based on a spectral decomposition of its corresponding operator, and we study the effect of truncation of this spectral decomposition. Second, we derive an approximation to the spectral (principal) components using the Nystrom extension. Using these, we demonstrate that this global filter can be implemented efficiently by sampling a fairly small percentage of the pixels in the image. Experiments illustrate that our strategy can effectively globalize any existing denoising filters to estimate each pixel using all pixels in the image, hence improving upon the best patch-based methods.", "paper_title": "Global Image Denoising", "paper_id": "WOS:000329581800021"}