{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "structural_optimization"}, {"score": 0.014203024301248444, "phrase": "eslso"}, {"score": 0.009322661440069775, "phrase": "static_analysis"}, {"score": 0.007244693015882715, "phrase": "equivalent_static_loads"}, {"score": 0.006039104880214678, "phrase": "linear_static_response"}, {"score": 0.00477924690801092, "phrase": "non_linear_static_responses"}, {"score": 0.00470862827326028, "phrase": "real_world"}, {"score": 0.004673709383305897, "phrase": "structural_systems"}, {"score": 0.0046046429665581555, "phrase": "linear_static_characteristics"}, {"score": 0.00443638953122199, "phrase": "static_responses"}, {"score": 0.004403480614319231, "phrase": "sensitivity_analysis"}, {"score": 0.004370814742381778, "phrase": "static_finite_element_analysis"}, {"score": 0.004133390261297075, "phrase": "engineering_community"}, {"score": 0.003923398381490749, "phrase": "finite_element_method"}, {"score": 0.003405472159599445, "phrase": "dynamic_effects"}, {"score": 0.0033426036530090205, "phrase": "conventional_optimization"}, {"score": 0.0032444113660668743, "phrase": "non_linear_static_response"}, {"score": 0.0026232532659260033, "phrase": "process_iterates"}, {"score": 0.0025940660106162404, "phrase": "software_system"}, {"score": 0.0025652026679268713, "phrase": "automatic_use"}, {"score": 0.002389696110283506, "phrase": "well_developed_commercial_software_systems"}, {"score": 0.002268088741853586, "phrase": "developed_system"}, {"score": 0.0021049977753042253, "phrase": "windows_operating_system"}], "paper_keywords": ["Structural optimization", " Equivalent static loads (ESLs)", " Equivalent static loads method for non linear static response structural optimization (ESLSO)"], "paper_abstract": "In the real world, structural systems may not have linear static characteristics. However, structural optimization has been developed based on static responses because sensitivity analysis regarding static finite element analysis is developed quite well. Analyses other than static analysis are heavily required in the engineering community these days. Techniques for such analyses have been extensively developed and many software systems using the finite element method are easily available in the market. On the other hand, development of structural optimization using such analyses is fairly slow due to many obstacles. One obstacle is that it is very difficult and expensive to consider the nonlinearities or dynamic effects in the way of conventional optimization. Recently, the equivalent static loads method for non linear static response structural optimization (ESLSO) has been proposed for structural optimization with various responses: linear dynamic response, nonlinear static response, and nonlinear dynamic response. In ESLSO, finite element analysis other than static analysis is performed, equivalent static loads (ESLs) are generated, linear static response structural optimization is carried out with the ESLs and the process iterates. A software system for the automatic use of ESLSO is developed and described. One of the advantages of ESLSO is that it can use well developed commercial software systems for structural analysis and linear static response structural optimization. Various analysis and optimization systems are integrated in the developed system. The structure of the system is systematically defined and the software is developed by the C++ language on the Windows operating system.", "paper_title": "A software development framework for structural optimization considering non linear static responses", "paper_id": "WOS:000358060800012"}