{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "lightning_classification"}, {"score": 0.0045249263666466005, "phrase": "prototype_generation"}, {"score": 0.004441359373498799, "phrase": "cluster-based_nearest-neighbour_classifier"}, {"score": 0.004225950334493496, "phrase": "test_pattern"}, {"score": 0.0037551444630619015, "phrase": "efficient_method"}, {"score": 0.003506851152129303, "phrase": "similar_patterns"}, {"score": 0.0033159224502739247, "phrase": "learning_method"}, {"score": 0.0029279232349513724, "phrase": "simple_adaptive_distance_measure"}, {"score": 0.0025532173213934422, "phrase": "lightning_classification_task"}, {"score": 0.0021715812867126884, "phrase": "proposed_methods"}], "paper_keywords": ["nearest-neighbour classifier", " clustering", " adaptive distance"], "paper_abstract": "The problem addressed in this paper concerns the prototype generation for a cluster-based nearest-neighbour classifier. It considers, to classify a test pattern, the lines that link the patterns of the training set and a set of prototypes. An efficient method based on clustering is here used for finding subgroups of similar patterns with centroid being used as prototype. A learning method is used for iteratively adjusting both position and local-metric of the prototypes. Finally, we show that a simple adaptive distance measure improves the performance of our nearest-neighbour-based classifier. The performance improvement with respect to other nearest-neighbour-based classifiers is validated by testing our method on a lightning classification task using data acquired from the Fast On-orbit Recording of Transient Events (FORTE) satellite, moreover the performance improvement is validated through experiments with several benchmark datasets. The performance of the proposed methods are also validated using the Wilcoxon Signed-Rank test.", "paper_title": "Cluster-based nearest-neighbour classifier and its application on the lightning classification", "paper_id": "WOS:000257809900006"}