{"auto_keywords": [{"score": 0.033576268938320386, "phrase": "retailer_credibility"}, {"score": 0.015719716506582538, "phrase": "on-line_shopping_comparison_sites"}, {"score": 0.007817274528510158, "phrase": "objective_product_information"}, {"score": 0.004633429997452688, "phrase": "incomplete_information"}, {"score": 0.004580314008293946, "phrase": "retailer's_credibility"}, {"score": 0.004493130934067195, "phrase": "retailer's_brand"}, {"score": 0.004340343873304156, "phrase": "noncontractible_aspects"}, {"score": 0.0040190868373730015, "phrase": "first_strategy"}, {"score": 0.0038674532861321864, "phrase": "lowest_expected_cost"}, {"score": 0.0038230844545071303, "phrase": "highest_utility"}, {"score": 0.0035810720634458933, "phrase": "best-known_retailer"}, {"score": 0.003485913728272778, "phrase": "lowest-price_retailer"}, {"score": 0.003445906915464945, "phrase": "immediate_costs"}, {"score": 0.003046621804854539, "phrase": "simulated_shopping_experiments"}, {"score": 0.003011641380351577, "phrase": "nine_periods"}, {"score": 0.002631959004685823, "phrase": "product_information"}, {"score": 0.0024842242921857705, "phrase": "search-result_pages"}, {"score": 0.0024556852466581527, "phrase": "on-line_shopping_comparison_site"}, {"score": 0.0021961259795489833, "phrase": "dramatic_increase"}, {"score": 0.0021792693001152896, "phrase": "expected-value_choices"}, {"score": 0.002154226045704907, "phrase": "corresponding_decrease"}, {"score": 0.0021049977753042253, "phrase": "price-aversion_choices"}], "paper_keywords": ["comparison shopping", " electronic commerce", " experimental design", " information processing", " multinomial logit analysis"], "paper_abstract": "Consumers purchasing products over the Internet generally have incomplete information about the retailer's credibility. This makes the retailer's brand very important for those who care about the noncontractible aspects of after-orders. Three choice strategies are possible at on-line shopping comparison sites, and logit models are used to capture their characteristics. The first strategy, expected value, chooses the retailer with the lowest expected cost (or highest utility) in terms of price, brand, and expected credibility. The second, brand seeking, chooses the best-known retailer. The third, price aversion, chooses the lowest-price retailer to minimize immediate costs. These three strategies, and the effect on them of four attributes (price, objective product information, perception of retailer credibility, correlation between brand and credibility) were tested in simulated shopping experiments played over nine periods for 241 graduate students. A set of two items was chosen: digital cameras and books. The experiment yielded 2,169 retailer choices for each item and 10,845 observations. It found (I) that price, objective product information, and perceptions of retailer credibility are the three important attributes when consumers select retailers on the search-result pages of an on-line shopping comparison site; (2) that consumers consider objective product information and perceptions of retailer credibility regardless of their brand-seeking or price-aversion strategy; and (3) that an increase in objective product information leads to a dramatic increase in expected-value choices and a corresponding decrease in brand-seeking and price-aversion choices. The implications for practitioners and academics are discussed.", "paper_title": "Consumer e-tailer choice strategies at on-line shopping comparison sites", "paper_id": "WOS:000246043400006"}