{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "anomaly_detection"}, {"score": 0.04977446649828202, "phrase": "discrete_sequences"}, {"score": 0.047694529084181286, "phrase": "existing_research"}, {"score": 0.044592077145871066, "phrase": "existing_techniques"}, {"score": 0.041554759596607975, "phrase": "problem_formulation"}, {"score": 0.040420945274423636, "phrase": "problem_formulations"}, {"score": 0.02866716169851262, "phrase": "different_techniques"}, {"score": 0.004619356874848538, "phrase": "comprehensive_and_structured_overview"}, {"score": 0.004347629793717084, "phrase": "global_understanding"}, {"score": 0.004306205029641728, "phrase": "sequence_anomaly_detection_problem"}, {"score": 0.004170940184489072, "phrase": "key_contribution"}, {"score": 0.003777932022044434, "phrase": "anomalous_sequences"}, {"score": 0.003694423910900128, "phrase": "normal_sequences"}, {"score": 0.0036243109044803924, "phrase": "anomalous_subsequence"}, {"score": 0.003589753165698119, "phrase": "long_sequence"}, {"score": 0.002935319576795509, "phrase": "underlying_algorithm"}, {"score": 0.0028520942752886507, "phrase": "basic_anomaly_detection_technique"}, {"score": 0.0027535633837592597, "phrase": "basic_technique"}, {"score": 0.0025830324526904427, "phrase": "new_variants"}, {"score": 0.002438581238635582, "phrase": "relative_strengths"}, {"score": 0.0022948394240866555, "phrase": "different_formulation"}, {"score": 0.0022368751421148947, "phrase": "different_problem_formulations"}, {"score": 0.0021185060549341974, "phrase": "online_anomaly_detection"}, {"score": 0.0021049977753042253, "phrase": "time_series_anomaly_detection"}], "paper_keywords": ["Discrete sequences", " anomaly detection"], "paper_abstract": "This survey attempts to provide a comprehensive and structured overview of the existing research for the problem of detecting anomalies in discrete/symbolic sequences. The objective is to provide a global understanding of the sequence anomaly detection problem and how existing techniques relate to each other. The key contribution of this survey is the classification of the existing research into three distinct categories, based on the problem formulation that they are trying to solve. These problem formulations are: 1) identifying anomalous sequences with respect to a database of normal sequences; 2) identifying an anomalous subsequence within a long sequence; and 3) identifying a pattern in a sequence whose frequency of occurrence is anomalous. We show how each of these problem formulations is characteristically distinct from each other and discuss their relevance in various application domains. We review techniques from many disparate and disconnected application domains that address each of these formulations. Within each problem formulation, we group techniques into categories based on the nature of the underlying algorithm. For each category, we provide a basic anomaly detection technique, and show how the existing techniques are variants of the basic technique. This approach shows how different techniques within a category are related or different from each other. Our categorization reveals new variants and combinations that have not been investigated before for anomaly detection. We also provide a discussion of relative strengths and weaknesses of different techniques. We show how techniques developed for one problem formulation can be adapted to solve a different formulation, thereby providing several novel adaptations to solve the different problem formulations. We also highlight the applicability of the techniques that handle discrete sequences to other related areas such as online anomaly detection and time series anomaly detection.", "paper_title": "Anomaly Detection for Discrete Sequences: A Survey", "paper_id": "WOS:000301746800005"}