{"auto_keywords": [{"score": 0.04924496525218245, "phrase": "information_visibility"}, {"score": 0.004669085371587273, "phrase": "large_internal_information_technology"}, {"score": 0.003698442219929622, "phrase": "large_financial_institute"}, {"score": 0.0036499505265403377, "phrase": "log_data"}, {"score": 0.003342471131048328, "phrase": "significant_positive_correlation"}, {"score": 0.0024130437638400404, "phrase": "dependent_teams_results"}, {"score": 0.0023918783117166326, "phrase": "higher_incident"}, {"score": 0.002238930800075706, "phrase": "large_it_providers"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["incident handling performance", " information visibility", " service teams"], "paper_abstract": "In large internal information technology (IT) organizations, multiple teams are often involved in handling incidents, so these teams come to depend on one another. We hypothesize that the knowledge these teams have of the agreed upon and realized incident handling performance of themselves and other teams will impact their performance. We tested this hypothesis at a large financial institute, using log data from the IT service management application and a survey to measure the knowledge of teams. We found (1) a significant positive correlation between incident handling performance of a team and the knowledge a team has of its own performance; (2) no correlation between the knowledge of agreed upon performance and realized performance within a team; (3) that teams have very little knowledge of agreed upon or realized performance of other teams; and (4) that improving the knowledge a team has of the agreed upon and realized performance of that team and dependent teams results in higher incident handling performance. The results show that increasing information visibility within and across teams in large IT providers is one way to improve incident handling performance. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Improving IT incident handling performance with information visibility", "paper_id": "WOS:000346649500003"}