{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "corporate_entrepreneurship"}, {"score": 0.004778923541463994, "phrase": "technological_variables"}, {"score": 0.004517137548648729, "phrase": "different_technological_aspects"}, {"score": 0.004449772140968921, "phrase": "spanish_high-technology_firms'_performance"}, {"score": 0.004253618550301311, "phrase": "structural_equation_model"}, {"score": 0.003757480190200645, "phrase": "top_managers"}, {"score": 0.003687512797620773, "phrase": "organizational_learning"}, {"score": 0.0036052633308076933, "phrase": "technological_distinctive_competencies"}, {"score": 0.0034203874753429113, "phrase": "organizational_performance"}, {"score": 0.003113441660343867, "phrase": "main_limitations"}, {"score": 0.0030098327296979883, "phrase": "spain"}, {"score": 0.0028446460307503343, "phrase": "single_method"}, {"score": 0.002719055901632759, "phrase": "perfect_adaptation"}, {"score": 0.002560162916190598, "phrase": "high-technology_sector_firms'_performance"}, {"score": 0.002502995662011305, "phrase": "important_role"}, {"score": 0.0024748913336907923, "phrase": "top_manager's_support"}, {"score": 0.0024287485834314027, "phrase": "ol._success"}, {"score": 0.0023834640793589435, "phrase": "vital_importance"}, {"score": 0.0022610992177831643, "phrase": "new_lines"}, {"score": 0.002128910637262527, "phrase": "new_relationships"}], "paper_keywords": ["Spain", " Technological distinctive competencies", " Top management support", " Organizational learning", " Corporate entrepreneurship", " Organizational performance"], "paper_abstract": "Purpose - The aim of this paper is to highlight the importance of different technological aspects of organizations on Spanish high-technology firms' performance. Design/methodology/approach - The relationships studied are confirmed empirically using a structural equation model to demonstrate our hypotheses. The sample was selected from the database \"Dun & Bradstreet Espana\" in the year 2005 and includes 201 Spanish firms. CEOs were our main informants. Findings - The results obtained show that support from top managers will directly influence the organizational learning (OL) process and technological distinctive competencies (TDCs) (antecedents of corporate entrepreneurship) and that corporate entrepreneurship finally influences organizational performance. Research limitations/implications - The paper is exploratory in character, and its goal is to show whether interrelations exist between the variables. The main limitations are: the sectors chosen refer only to Spain; the analysis is cross-sectional in character; the study uses a single method and self-reports (CEOs). Practical implications - To obtain perfect adaptation of the firm to its environment, it is crucial that managers develop corporate entrepreneurship to improve high-technology sector firms' performance. The paper shows the important role of the top manager's support in developing TDCs and OL. Success in such issues is of vital importance to corporate entrepreneurship in the firm. Originality/value - The paper seeks to stimulate new lines of research on one variable (TDCs) and to relate it to other constructs, producing new relationships and observing their repercussions for the firm.", "paper_title": "The influence on corporate entrepreneurship of technological variables", "paper_id": "WOS:000295553200001"}