{"auto_keywords": [{"score": 0.0445650695614191, "phrase": "ehr_implementation"}, {"score": 0.015278153214618216, "phrase": "clinical_review"}, {"score": 0.01003292174951556, "phrase": "ehr_technology"}, {"score": 0.00481495049065317, "phrase": "electronic_health_record_technology"}, {"score": 0.0046739596755881185, "phrase": "intensive_care_unit"}, {"score": 0.004456872931482395, "phrase": "icu_physicians"}, {"score": 0.004378078970574258, "phrase": "icu_resident"}, {"score": 0.004174677062711731, "phrase": "electronic_order_management"}, {"score": 0.004149922872133506, "phrase": "cpoe"}, {"score": 0.004040324509631854, "phrase": "physician_documentation"}, {"score": 0.0038640303886081444, "phrase": "observation_pre-"}, {"score": 0.0036192370470277957, "phrase": "icu"}, {"score": 0.003369778677878286, "phrase": "time_distribution"}, {"score": 0.0033003027425118005, "phrase": "temporal_patterns"}, {"score": 0.0032035208958667064, "phrase": "attending_physicians"}, {"score": 0.0027277558893834273, "phrase": "temporal_flow"}, {"score": 0.0025471636425006155, "phrase": "conversational_tasks"}, {"score": 0.002524504774013978, "phrase": "physical_care"}, {"score": 0.002414191082427217, "phrase": "major_impact"}, {"score": 0.002399850604120431, "phrase": "icu_physician_work"}, {"score": 0.0022677843776709103, "phrase": "focal_point"}, {"score": 0.002181626277903721, "phrase": "physician_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Critical care", " Electronic health record", " Time study", " Physician work", " Human factors engineering"], "paper_abstract": "Objective: To assess the impact of EHR technology on the work and workflow of ICU physicians and compare time spent by ICU resident and attending physicians on various tasks before and after EHR implementation. Design: EHR technology with electronic order management (CPOE, medication administration and pharmacy system) and physician documentation was implemented in October 2007. Measurement: We collected a total of 289 h of observation pre- and post-EHR implementation. We directly observed the work of residents in three ICUs (adult medical/surgical ICU, pediatric ICU and neonatal ICU) and attending physicians in one ICU (adult medical/surgical ICU). Results: EHR implementation had an impact on the time distribution of tasks as well as the temporal patterns of tasks. After EHR implementation, both residents and attending physicians spent more of their time on clinical review and documentation (40% and SS% increases, respectively). EHR implementation also affected the frequency of switching between tasks, which increased for residents (from 117 to 154 tasks per hour) but decreased for attendings (from 138 to 106 tasks per hour), and the temporal flow of tasks, in particular around what tasks occurred before and after clinical review and documentation. No changes in the time spent in conversational tasks or the physical care of the patient were observed. Conclusions: The use of EHR technology has a major impact on ICU physician work (e.g., increased time spent on clinical review and documentation) and workflow (e.g., clinical review and documentation becoming the focal point of many other tasks). Further studies should evaluate the impact of changes in physician work on the quality of care provided. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Impact of electronic health record technology on the work and workflow of physicians in the intensive care unit", "paper_id": "WOS:000355796900005"}