{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "cognitive_abilities"}, {"score": 0.04952003448686005, "phrase": "machine_kingdom"}, {"score": 0.012848747686206632, "phrase": "universal_psychometrics"}, {"score": 0.00459393336391459, "phrase": "'universal_psychometrics"}, {"score": 0.0036172962914449826, "phrase": "related_areas"}, {"score": 0.003397362086358944, "phrase": "machine_intelligence_measurement"}, {"score": 0.0032667240408191015, "phrase": "artificial_intelligence"}, {"score": 0.003228517923065361, "phrase": "general_approach"}, {"score": 0.0030440661915657175, "phrase": "big_issues"}, {"score": 0.002926973459215349, "phrase": "new_foundation"}, {"score": 0.002792375587031108, "phrase": "cognitive_task"}, {"score": 0.002541417196444962, "phrase": "universal_cognitive_test"}, {"score": 0.002206536029072657, "phrase": "related_notions"}, {"score": 0.002180702259644951, "phrase": "-free-lunch_theorems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cognitive system evaluation", " Psychometrics", " Cognitive abilities", " Artificial intelligence", " Algorithmic information theory"], "paper_abstract": "We present and develop the notion of 'universal psychometrics' as a subject of study, and eventually a discipline, that focusses on the measurement of cognitive abilities for the machine kingdom, which comprises any (cognitive) system, individual or collective, either artificial, biological or hybrid. Universal psychometrics can be built, of course, upon the experience, techniques and methodologies from (human) psychometrics, comparative cognition and related areas. Conversely, the perspective and techniques which are being developed in the area of machine intelligence measurement using (algorithmic) information theory can be of much broader applicability and implication outside artificial intelligence. This general approach to universal psychometrics spurs the re-understanding of most (if not all) of the big issues about the measurement of cognitive abilities, and creates a new foundation for (re) defining and mathematically formalising the concept of cognitive task, evaluable subject, interface, task choice, difficulty, agent response curves, etc. We introduce the notion of a universal cognitive test and discuss whether (and when) it may be necessary for exploring the machine kingdom. On the issue of intelligence and very general abilities, we also get some results and connections with the related notions of no-free-lunch theorems and universal priors. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Universal psychometrics: Measuring cognitive abilities in the machine kingdom", "paper_id": "WOS:000327484900005"}