{"auto_keywords": [{"score": 0.0490047077785489, "phrase": "relevant_tasks"}, {"score": 0.04153021766515564, "phrase": "state_space"}, {"score": 0.00481495049065317, "phrase": "large_processes"}, {"score": 0.004559661374976129, "phrase": "challenging_topic"}, {"score": 0.004518442937844318, "phrase": "business_process_languages"}, {"score": 0.004477595431209663, "phrase": "verification_techniques"}, {"score": 0.004240116703465252, "phrase": "domain-specific_requirements"}, {"score": 0.004070276454809864, "phrase": "full-state_verification_techniques"}, {"score": 0.0036332251283046997, "phrase": "process_schema"}, {"score": 0.0033630629374009576, "phrase": "-specific_reduction_techniques"}, {"score": 0.002491015208328868, "phrase": "real-world_industrial_processes"}, {"score": 0.002391067964886602, "phrase": "heavy_use"}, {"score": 0.0023479408542211875, "phrase": "full-state-search_verification_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Business process management", " Business process modeling", " Workflow modeling", " Verification", " Model checking", " Petri net"], "paper_abstract": "Verification recently has become a challenging topic for business process languages. Verification techniques like model checking allow to ensure that a process complies with domain-specific requirements, prior to the execution. To execute full-state verification techniques like model checking, the state space of the process needs to be constructed. This tends to increase exponentially with the size of the process schema, or it can even be infinite. We address this issue by means of requirements-specific reduction techniques, i.e., reducing the size of the state space without changing the result of the verification. We present an approach that, for a given requirement the system must fulfill, identifies the tasks relevant for the verification. Our approach then uses these relevant tasks for a reduction that confines the process to regions of interest for the verification. To evaluate our new technique, we use real-world industrial processes and requirements. Mainly because these processes make heavy use of parallelization, full-state-search verification algorithms are not able to verify them. With our reduction in turn, even complex processes with many parallel branches can be verified in less than 10 s. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A new verification technique for large processes based on identification of relevant tasks", "paper_id": "WOS:000344201100005"}