{"auto_keywords": [{"score": 0.04664571852812291, "phrase": "serial_activation"}, {"score": 0.04191337609468307, "phrase": "temporal_transition"}, {"score": 0.015719716506582538, "phrase": "multiple_information"}, {"score": 0.012840900469763014, "phrase": "ppi_networks"}, {"score": 0.011549917181336035, "phrase": "probabilistic_model"}, {"score": 0.009827567285747803, "phrase": "tempi"}, {"score": 0.00466102244911872, "phrase": "differential_protein-protein_interaction"}, {"score": 0.00415019999222481, "phrase": "network_inference"}, {"score": 0.00411182818527434, "phrase": "current_methods"}, {"score": 0.003817306032290766, "phrase": "structural_transition"}, {"score": 0.0034785371344994197, "phrase": "time-evolving_differential"}, {"score": 0.0033051623473192814, "phrase": "probabilistic_relationships"}, {"score": 0.0032745778756077693, "phrase": "network_structures"}, {"score": 0.003244275497488318, "phrase": "time-course_gene_expression_data"}, {"score": 0.00321425262806329, "phrase": "gene_ontology"}, {"score": 0.0029699874949715367, "phrase": "jointly_the_time-evolving_differential_ppi_networks"}, {"score": 0.0028615323526689582, "phrase": "ppi_network_structures"}, {"score": 0.0027570267191549774, "phrase": "transiting_networks"}, {"score": 0.0027188259793109264, "phrase": "joint_estimation"}, {"score": 0.002267708463966758, "phrase": "time-dependent_associations"}, {"score": 0.0021246816854197732, "phrase": "key_drps"}], "paper_keywords": [""], "paper_abstract": "Motivation: Time-evolving differential protein-protein interaction (PPI) networks are essential to understand serial activation of differentially regulated (up- or downregulated) cellular processes (DRPs) and their interplays over time. Despite developments in the network inference, current methods are still limited in identifying temporal transition of structures of PPI networks, DRPs associated with the structural transition and the interplays among the DRPs over time. Results: Here, we present a probabilistic model for estimating Time-Evolving differential PPI networks with MultiPle Information (TEMPI). This model describes probabilistic relationships among network structures, time-course gene expression data and Gene Ontology biological processes (GOBPs). By maximizing the likelihood of the probabilistic model, TEMPI estimates jointly the time-evolving differential PPI networks (TDNs) describing temporal transition of PPI network structures together with serial activation of DRPs associated with transiting networks. This joint estimation enables us to interpret the TDNs in terms of temporal transition of the DRPs. To demonstrate the utility of TEMPI, we applied it to two time-course datasets. TEMPI identified the TDNs that correctly delineated temporal transition of DRPs and time-dependent associations between the DRPs. These TDNs provide hypotheses for mechanisms underlying serial activation of key DRPs and their temporal associations.", "paper_title": "TEMPI: probabilistic modeling time-evolving differential PPI networks with multiPle information", "paper_id": "WOS:000342912400016"}