{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "context_rules"}, {"score": 0.03899523601303667, "phrase": "context_primitives"}, {"score": 0.007874271288763156, "phrase": "decision_events"}, {"score": 0.00465634671242413, "phrase": "dynamic_generation"}, {"score": 0.0044695432851061525, "phrase": "mobile_devices"}, {"score": 0.004403480614319231, "phrase": "social_and_physical_settings"}, {"score": 0.004322267755421529, "phrase": "existing_context-aware_systems"}, {"score": 0.004242546312843817, "phrase": "predefined_rules"}, {"score": 0.0039674831861175935, "phrase": "design_time"}, {"score": 0.0037940502405699765, "phrase": "system_designer"}, {"score": 0.0033550841271846065, "phrase": "sensory_data"}, {"score": 0.0030794433253250476, "phrase": "specified_context_primitives"}, {"score": 0.00296675450822924, "phrase": "similar_situation"}, {"score": 0.0028053842615436706, "phrase": "possible_alternatives"}, {"score": 0.0025556529150386168, "phrase": "flexible_use"}, {"score": 0.0021687806803474367, "phrase": "decision-context_associations"}, {"score": 0.0021049977753042253, "phrase": "context-aware_e-pad"}], "paper_keywords": [""], "paper_abstract": "This paper presents a scheme for the dynamic generation of context rules which are useful for modifying the behaviour of mobile devices according to the social and physical settings of their users. Existing context-aware systems employ a pool of predefined rules which will be executed whenever a context of interest is sensed and captured. Defining rules at design time, however, has the following limitations: (1) The system designer should identify the set of context primitives which describe a context of interest as accurately as possible; (2) the various states of each context primitive should be predetermined and mapped to sensory data, which often requires experience or expertise; (3) the availability of mechanisms for capturing the context primitives is presupposed; if instead of the specified context primitives other context primitives are discovered, which may equally describe a similar situation, the system does not react to them, unless of course, all possible alternatives are foreseen; and (4) the desired behaviour itself may not be a priori known, as it is specific to the user. To facilitate a flexible use of context rules, they should be generated dynamically. The scheme proposed in this paper associates decision events - signifying the activities of a user - with a set of context primitives which are acquired at the time the decision events are produced. From the decision-context associations, context rules are generated. The Context-Aware E-Pad will be introduced to illustrate the scheme proposed.", "paper_title": "Dynamic generation of context rules", "paper_id": "WOS:000239454400008"}