{"auto_keywords": [{"score": 0.04300723495941336, "phrase": "pli"}, {"score": 0.01061238142937899, "phrase": "cortical_source_signals"}, {"score": 0.010446092364396711, "phrase": "eeg."}, {"score": 0.0044826811976193485, "phrase": "statistical_sense"}, {"score": 0.004447201233380302, "phrase": "phase_synchronization"}, {"score": 0.0037336520904376687, "phrase": "simple_analytical_models"}, {"score": 0.0036601552758254757, "phrase": "simulated_csss"}, {"score": 0.0034482025128821548, "phrase": "numerical_simulations"}, {"score": 0.0031718628581265266, "phrase": "biological_tissues"}, {"score": 0.0030119758165837625, "phrase": "useful_interdependency_measure"}, {"score": 0.0028487656293168795, "phrase": "common_interdependency_measure"}, {"score": 0.0027815466400771768, "phrase": "direct_comparison"}, {"score": 0.002429451930463481, "phrase": "novel_statistical_measure"}, {"score": 0.0023626775529531486, "phrase": "performance_measures"}, {"score": 0.0021049977753042253, "phrase": "epileptic_patients"}], "paper_keywords": ["Phase locking", " EEG", " Cortical sources", " Correlation", " Coupling", " Interdependency", " Contrast", " Distribution function", " Model"], "paper_abstract": "The phase locking index (PLI) was introduced to quantify in a statistical sense the phase synchronization of two signals. It has been commonly used to process biosignals. In this article, we investigate the PLI for measuring the interdependency of cortical source signals (CSSs) recorded in the Electroencephalogram (EEG). To this end, we consider simple analytical models for the mapping of simulated CSSs into the EEG. For these models, the PLI is investigated analytically and through numerical simulations. An evaluation is made of the sensitivity of the PLI to the amount of crosstalk between the sources through biological tissues of the head. It is found that the PLI is a useful interdependency measure for CSSs, especially when the amount of crosstalk is small. Another common interdependency measure is the coherence. A direct comparison of both measures has not been made in the literature so far. We assess the performance of the PLI and coherence for estimation and detection purposes based on, respectively, a normalized variance and a novel statistical measure termed contrast. Based on these performance measures, it is found that the PLI is similar or better than the CM in most cases. This result is also confirmed through analysis of EEGs recorded from epileptic patients.", "paper_title": "An investigation of the phase locking index for measuring of interdependency of cortical source signals recorded in the EEG", "paper_id": "WOS:000263868500003"}