{"auto_keywords": [{"score": 0.010444846439780468, "phrase": "ieee"}, {"score": 0.00792924340229676, "phrase": "analytical_model"}, {"score": 0.0069210087547969465, "phrase": "simulation_and_experimental_results"}, {"score": 0.00481495049065317, "phrase": "novel_cheater"}, {"score": 0.004776484866276242, "phrase": "jammer_detection_scheme"}, {"score": 0.004700468701207975, "phrase": "wireless_lans"}, {"score": 0.00432070565627091, "phrase": "available_network"}, {"score": 0.004167451906343558, "phrase": "novel_malicious_entity_detection_method"}, {"score": 0.00401961206251868, "phrase": "new_metric"}, {"score": 0.003845994935767022, "phrase": "detection_process"}, {"score": 0.0037244390953401533, "phrase": "beacon_frames"}, {"score": 0.0033150213498435617, "phrase": "adversary_detection_capabilities"}, {"score": 0.003171740347925348, "phrase": "real_testbed"}, {"score": 0.0029386456078004863, "phrase": "measurement_results"}, {"score": 0.0028229071631385634, "phrase": "malicious_entity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["IEEE 802.11", " WLAN", " Jamming", " Cheater", " Security"], "paper_abstract": "The proliferation of IEEE 802.11 networks has made them an easy and attractive target for malicious devices/adversaries which intend to misuse the available network. In this paper, we introduce a novel malicious entity detection method for IEEE 802.11 networks. We propose a new metric, the Beacon Access Time (BAT), which is employed in the detection process and inherits its characteristics from the fact that beacon frames are always given preference in IEEE 802.11 networks. An analytical model to define the aforementioned metric is presented and evaluated with experiments and simulations. Furthermore, we evaluate the adversary detection capabilities of our scheme by means of simulations and experiments over a real testbed. The simulation and experimental results indicate consistency and both are found to follow the trends indicated in the analytical model. Measurement results indicate that our scheme is able to correctly detect a malicious entity at a distance of, at least, 120 m. Analytical, simulation and experimental results signify the validity of our scheme and highlight the fact that our scheme is both efficient and successful in detecting an adversary (either a jammer or a cheating device). As a proof of concept, we developed an application that when deployed at the IEEE 802.11 Access Point, is able to effectively detect an adversary. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A novel cheater and jammer detection scheme for IEEE 802.11-based wireless LANs", "paper_id": "WOS:000357904200004"}