{"auto_keywords": [{"score": 0.04961049691122095, "phrase": "tompa"}, {"score": 0.004721162131188487, "phrase": "woll"}, {"score": 0.004406994912939125, "phrase": "invalid_secret"}, {"score": 0.004174824849669107, "phrase": "lower_bounds"}, {"score": 0.003896871009090446, "phrase": "maximum_successful_cheating_probability"}, {"score": 0.003428665921276366, "phrase": "vertical_bar_s_vertical_bar"}, {"score": 0.0031377955308198634, "phrase": "distributed_secret"}, {"score": 0.0030314419455512013, "phrase": "previous_schemes"}, {"score": 0.0025638362414466278, "phrase": "new_scheme"}, {"score": 0.002464709648714996, "phrase": "bit_length"}, {"score": 0.002404706573379854, "phrase": "proposed_scheme"}, {"score": 0.002323142666222693, "phrase": "known_bound"}, {"score": 0.0022443390559699974, "phrase": "tighter_bound"}], "paper_keywords": ["secret sharing", " cheating detection"], "paper_abstract": "In (k, n) threshold scheme, Tompa and Woll considered a problem of cheaters who try to make another participant reconstruct an invalid secret. Later, some models of such cheating were formalized and lower bounds of the size of share were shown in the situation of fixing the maximum successful cheating probability to is an element of. Some efficient schemes in which size of share is equal to the lower bound were also proposed. Let vertical bar S vertical bar be the field size of the secret. Under the assumption that cheaters do not know the distributed secret, these sizes of share of previous schemes which can work for is an element of > 1/vertical bar S vertical bar are somewhat larger than the bound. In this paper, we show the bound for this case is really tight by constructing a new scheme. When distributing uniform secret, the bit length of share in the proposed scheme is only 1 bit longer than the known bound. Further, we show a tighter bound of the size of share in case of is an element of < 1/vertical bar S vertical bar.", "paper_title": "A Simple and Efficient Secret Sharing Scheme Secure against Cheating", "paper_id": "WOS:000292480700015"}