{"auto_keywords": [{"score": 0.0346192590968319, "phrase": "consenting_process"}, {"score": 0.030319531161931416, "phrase": "new_systems"}, {"score": 0.02994167456199593, "phrase": "conventional_methods"}, {"score": 0.00481495049065317, "phrase": "electronic_consenting_interfaces"}, {"score": 0.004790230103466081, "phrase": "research_permissions_management_system"}, {"score": 0.00457335448397295, "phrase": "consent_form"}, {"score": 0.004526503177267299, "phrase": "medical_treatment"}, {"score": 0.004468610388406918, "phrase": "research_study"}, {"score": 0.0043215158337835706, "phrase": "paper-based_forms"}, {"score": 0.004277233379125199, "phrase": "patient_preference_data"}, {"score": 0.004125773078637226, "phrase": "health_sciences_of_south_carolina"}, {"score": 0.0040416348762873115, "phrase": "academic_medical_institutions"}, {"score": 0.004020868719566642, "phrase": "research_universities"}, {"score": 0.0040002088320302935, "phrase": "south_carolina"}, {"score": 0.0039490205074757985, "phrase": "electronic_consenting_system"}, {"score": 0.0035715136739149027, "phrase": "paper-based_and_topaz-based_systems"}, {"score": 0.0031477782772867655, "phrase": "hospital_staff"}, {"score": 0.003123527559542239, "phrase": "subjective_ratings"}, {"score": 0.0030676643955722884, "phrase": "post-test_questionnaires"}, {"score": 0.003005039427642664, "phrase": "empirical_study"}, {"score": 0.002802941205762953, "phrase": "registration_staff"}, {"score": 0.0027813397260607487, "phrase": "least_workload"}, {"score": 0.0027457055568702975, "phrase": "touchscreen-based_conditions"}, {"score": 0.0026551731045904854, "phrase": "proposed_electronic_systems"}, {"score": 0.00260766437999449, "phrase": "better_comprehension"}, {"score": 0.0025412618552660567, "phrase": "new_interfaces"}, {"score": 0.002463801498645709, "phrase": "patient_consents"}, {"score": 0.002303956142358743, "phrase": "cautious_adoption"}, {"score": 0.002292097733181405, "phrase": "electronic_consenting_systems"}, {"score": 0.00218807532188779, "phrase": "complex_research_being"}, {"score": 0.0021378442381693847, "phrase": "biomedical_sciences"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Informed consent", " Mobile devices", " Electronic consenting systems", " iPad", " Registration staff", " Data collection", " Informatics"], "paper_abstract": "Purpose: Ethical and legal requirements for healthcare providers in the United States, stipulate that patients sign a consent form prior to undergoing medical treatment or participating in a research study.. Currently, the majority of the hospitals obtain these consents using paper-based forms, which makes patient preference data cumbersome to store, search and retrieve. To address these issues, Health Sciences of South Carolina (HSSC), a collaborative of academic medical institutions and research universities in South Carolina, is developing an electronic consenting system, the Research Permissions Management System (RPMS). This article reports the findings of a study conducted to investigate the efficacy of the two proposed interfaces for this system an iPad-based and touchscreen-based by comparing them to the paper-based and Topaz-based systems currently in use. Methods: This study involved 50 participants: 10 hospital admission staff and 40 patients. The four systems were compared with respect to the time taken to complete the consenting process, the number of errors made by the patients, the workload experienced by the hospital staff and the subjective ratings of both patients and staff on post-test questionnaires. Results: The results from the empirical study indicated no significant differences in the time taken to complete the tasks. More importantly, the participants found the new systems more usable than the conventional methods with the registration staff experiencing the least workload in the iPad and touchscreen-based conditions and the patients experiencing more privacy and control during the consenting process with the proposed electronic systems. In addition, they indicated better comprehension and awareness of what they were signing using the new interfaces. Discussion: The results indicate the two methods proposed for capturing patient consents are at least as effective as the conventional methods, and superior in several important respects. While more research is needed, these findings suggest the viability of cautious adoption of electronic consenting systems, especially because these new systems appear to address the challenge of identifying the participants required for the complex research being conducted as the result of advances in the biomedical sciences. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "An investigation of the efficacy of electronic consenting interfaces of research permissions management system in a hospital setting", "paper_id": "WOS:000323584700011"}