{"auto_keywords": [{"score": 0.04776153899320316, "phrase": "quantum_state_secure_transmission"}, {"score": 0.00481495049065317, "phrase": "network_communications"}, {"score": 0.004312622975366672, "phrase": "new_protocols"}, {"score": 0.004265354774450696, "phrase": "joint_remote_state_preparation"}, {"score": 0.003970439654470374, "phrase": "n-to-two_and_n"}, {"score": 0.00325555555110395, "phrase": "arbitrary_number"}, {"score": 0.0030135741897058844, "phrase": "large-scale_network_communications"}, {"score": 0.002511803988580901, "phrase": "proposed_protocol"}, {"score": 0.0024569466759289055, "phrase": "general_model"}, {"score": 0.0022368274529152342, "phrase": "threshold_secret_sharing"}, {"score": 0.0022122603123901114, "phrase": "secure_broadcasting"}, {"score": 0.002175913488493802, "phrase": "multiparty_computation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Remote state preparation", " Quantum cryptography", " Quantum network communications", " Quantum secret sharing", " Secure broadcasting", " Secure multi-party computation"], "paper_abstract": "In this paper, we investigate the quantum state secure transmission in network communications. First of all, we propose new protocols of joint remote state preparation (RSP). A variety of situations are investigated, including N-to-two and N-to-M RSP of general 2-level states, N-to-M RSP of both equatorial and general d-level states. Compared with the previous papers, our protocols demonstrate several distinctive features, i.e., scalability, synchronization, randomness. An arbitrary number of participants can participate in the protocols, which is suitable for the large-scale network communications. The desired information can be securely reconstructed by all the receivers simultaneously. Each sender can be randomly categorized as either an information sender or a supervisor. Furthermore, it is found that the proposed protocol can become a general model of quantum state secure transmission in network communications. It can be widely applied in various cryptographic communication protocols, such as threshold secret sharing, secure broadcasting and secure multiparty computation. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Quantum state secure transmission in network communications", "paper_id": "WOS:000337647300025"}