{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "eigenvector_method"}, {"score": 0.022406432450957112, "phrase": "students'_learning_achievement_evaluation"}, {"score": 0.015924163980723948, "phrase": "attribute_vectors"}, {"score": 0.009998061291359139, "phrase": "proposed_method"}, {"score": 0.008555073873616526, "phrase": "accuracy_rate"}, {"score": 0.00835860525641763, "phrase": "time_rate"}, {"score": 0.008085673239791154, "phrase": "relative_importance_degrees"}, {"score": 0.006939796503925124, "phrase": "fitness_degrees"}, {"score": 0.004672727518631859, "phrase": "new_method"}, {"score": 0.0041721750101390825, "phrase": "students'_learning_achievement"}, {"score": 0.003314591878914152, "phrase": "correlation_coefficients"}, {"score": 0.0032489004068215407, "phrase": "standard_deviations"}, {"score": 0.0026950674053179404, "phrase": "importance_degrees"}, {"score": 0.0025806029313384504, "phrase": "relation_matrix"}, {"score": 0.002446359075737736, "phrase": "importance_degrees_vector"}, {"score": 0.002397833600728684, "phrase": "grade_matrix"}, {"score": 0.0023190823948528953, "phrase": "learning_achievement_index"}, {"score": 0.0021910825909008946, "phrase": "useful_way"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Eigenvector method", " Fuzzy sets", " Learning achievement index", " Membership functions", " Students' learning achievement evaluation"], "paper_abstract": "In this paper, we present a new method for students' learning achievement evaluation based on the eigenvector method. The proposed method considers the \"accuracy rate\", the \"time rate\", the \"importance\" and the \"complexity\" for evaluating students' learning achievement. First, the proposed method transforms the attributes \"accuracy rate\" and \"time rate\" into the \"effect of accuracy rate\" and the \"effect of time rate\", respectively. Then, it generates the relative importance degrees of the attributes \"effect of accuracy rate\", \"effect of time rate\", \"importance\" and \"complexity\" based on the eigenvector method. Then, it uses the correlation coefficients between the attribute vectors and the standard deviations of the elements in the attribute vectors to calculate the fitness degrees of the attributes, where the attribute vectors represent the relationships between the attributes and the questions. Then, it generates the weights of the attributes based on the relative importance degrees of the attributes and the fitness degrees of the attributes. Then, it generates the importance degrees of the questions according to the weights of the attributes and the relation matrix representing the relationships between the questions and the attributes. Finally, based on the importance degrees vector of the questions, the grade matrix, the accuracy rate matrix, it calculates the learning achievement index of each student having the same original total score for students' learning achievement evaluation. The proposed method provides us with a useful way for students' learning achievement evaluation based on the eigenvector method. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating students' learning achievement based on the eigenvector method", "paper_id": "WOS:000289047700038"}