{"auto_keywords": [{"score": 0.047342472915882707, "phrase": "urban_environment"}, {"score": 0.013073343184996268, "phrase": "immersive_driving_simulator"}, {"score": 0.012534269005208059, "phrase": "traffic_model"}, {"score": 0.00481495049065317, "phrase": "urban_traffic"}, {"score": 0.004783607451937166, "phrase": "real_conditions"}, {"score": 0.004584769330512473, "phrase": "large-scale_traffic"}, {"score": 0.004394159734054881, "phrase": "realistic_and_detailed_simulation"}, {"score": 0.003945001936004421, "phrase": "driving_position"}, {"score": 0.003731774879299358, "phrase": "general_behavior"}, {"score": 0.0033942044841803105, "phrase": "traffic_density"}, {"score": 0.0032529303004879325, "phrase": "adjacent_areas"}, {"score": 0.003221169966797793, "phrase": "vehicle_model"}, {"score": 0.00259559608895677, "phrase": "urban_traffic_circulation"}, {"score": 0.0025618392173552052, "phrase": "lane_changes"}, {"score": 0.002471248834609488, "phrase": "traffic_light_regulation_model"}, {"score": 0.002447101794397243, "phrase": "complete_signposting"}, {"score": 0.0023451553255837317, "phrase": "developed_traffic_model"}, {"score": 0.002314647987893668, "phrase": "large-scale_traffic_simulation"}, {"score": 0.002232779081720735, "phrase": "complex_behaviors"}], "paper_keywords": ["Traffic simulation", " traffic model", " large-scale simulation", " microscopic model", " driving simulator"], "paper_abstract": "This paper describes a model capable of simulating large-scale traffic in an urban environment. The goal is of this work is the realistic and detailed simulation of the traffic, reproducing the behavior of each vehicle involved in the environment individually. This model has been developed in order to be integrated in an immersive driving simulator, where the driving position is the center of the simulation and the traffic model reproduces what happens around them. The general behavior of the traffic model is based on the following theory. Depending on the size of the urban environment to be simulated, the number of vehicles involved, and the traffic density, the environment can be studied as a whole or segmented in adjacent areas. Each vehicle model has two components. First, the behavior of the vehicle is simulated individually, modeling acceleration and braking, depending on the type and characteristics of each vehicle (mass, power, size, etc.). Second, the behavior of the drivers is also modeled, by type (passive, moderate, aggressive), playing various maneuvers also common in urban traffic circulation, such as lane changes, behavior at crossings and intersections, etc. A traffic light regulation model and the complete signposting of the urban environment are also included. As a result, the developed traffic model is applicable to large-scale traffic simulation integrated in an immersive driving simulator and is very useful when investigating complex behaviors of these environments. The model has been validated comparing it with results obtained from various references and very satisfactory results have been obtained.", "paper_title": "A full-scale simulation model to reproduce urban traffic in real conditions in driving simulators", "paper_id": "WOS:000324473000006"}