{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adaptive_hypermedia_learning_systems"}, {"score": 0.03492129383115456, "phrase": "adaptive_hypermedia_learning_system"}, {"score": 0.012500201296972982, "phrase": "cognitive_styles"}, {"score": 0.012296909584276821, "phrase": "student_learning"}, {"score": 0.004014452814186653, "phrase": "students'_prior_knowledge"}, {"score": 0.003883850058095871, "phrase": "previous_research"}, {"score": 0.0036352070472201086, "phrase": "learners_process"}, {"score": 0.00325555555110395, "phrase": "students'_cognitive_styles"}, {"score": 0.0031495640320537252, "phrase": "pask's_holist-serialist_dimension"}, {"score": 0.0029641011108505785, "phrase": "learning_performance"}, {"score": 0.00280496585980086, "phrase": "forty-four_undergraduate_and_postgraduate_students"}, {"score": 0.002363806685815014, "phrase": "students'_perceptions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Cognitive styles", " Adaptive educational hypermedia", " Holist-Serialist"], "paper_abstract": "In the past decade, a number of adaptive hypermedia learning systems have been developed. However, most of these systems tailor presentation content and navigational support solely according to students' prior knowledge. On the other hand, previous research suggested that cognitive styles significantly affect student learning because they refer to how learners process and organize information. To this end, the study presented in this paper developed an adaptive hypermedia learning system tailored to students' cognitive styles, with an emphasis on Pask's Holist-Serialist dimension. How students react to this adaptive hypermedia learning system, including both learning performance and perceptions, was examined in this study. Forty-four undergraduate and postgraduate students participated in the study. The findings indicated that, in general, adapting to cognitive styles improves student learning. The results also showed that the adaptive hypermedia learning system have more effects on students' perceptions than performance. The implications of these results for the design of adaptive hypermedia learning systems are discussed. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Design of adaptive hypermedia learning systems: A cognitive style approach", "paper_id": "WOS:000287343900009"}