{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quadratic_assignment_problem"}, {"score": 0.0300157551882993, "phrase": "external_memory"}, {"score": 0.02792535671061131, "phrase": "partial_solutions"}, {"score": 0.02693386827570259, "phrase": "solution_construction"}, {"score": 0.0047267100475487595, "phrase": "colony_optimization"}, {"score": 0.004230068512904886, "phrase": "empty_solution"}, {"score": 0.0036477941360224435, "phrase": "max-min_ant_system"}, {"score": 0.0033664873319204027, "phrase": "iterated_greedy_algorithms"}, {"score": 0.0030123335878664064, "phrase": "closely_related_research"}, {"score": 0.002797121441432477, "phrase": "aco."}, {"score": 0.002678734566245688, "phrase": "aco_variants"}, {"score": 0.002471973283582411, "phrase": "previously_reported_results"}, {"score": 0.0024416087858984644, "phrase": "external_memory_il_usage"}, {"score": 0.002157697367447098, "phrase": "improved_performance"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_aco_algorithms"}], "paper_keywords": [""], "paper_abstract": "Ant colony optimization (ACO) algorithms construct solutions each time starting from scratch, that is, from an empty solution. Differently from ACO algorithms, iterated greedy, another constructive stochastic local search method, starts the solution construction from partial solutions. In this paper, we examine the performance of a variation of MAX-MIN Ant System, one of the most successful ACO algorithms, that exploits this idea central to iterated greedy algorithms. We consider the quadratic assignment problem as a case-study, since this problem was also tackled in a closely related research to ours, the one on the usage of external memory in ACO. The usage of external memory resulted in ACO variants, where partial solutions are used to seed the solution construction. Contrary to previously reported results on external memory IL usage, our computational results are more pessimistic in the sense that starting the solution construction from partial solutions does not necessarily lead to improved performance when compared to state-of-the-art ACO algorithms.", "paper_title": "Iterated ants: An experimental study for the quadratic assignment problem", "paper_id": "WOS:000241466100016"}