{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "distributed_systems"}, {"score": 0.0117698495856667, "phrase": "distributed_system"}, {"score": 0.009593081849849017, "phrase": "mobile_agents"}, {"score": 0.0047357308775561255, "phrase": "mobile_agent"}, {"score": 0.004550856732700044, "phrase": "existing_technology"}, {"score": 0.004446349752828045, "phrase": "existing_work"}, {"score": 0.004216362268148017, "phrase": "distributed_applications"}, {"score": 0.003778755692995768, "phrase": "distributed_control_functions"}, {"score": 0.003691913669486176, "phrase": "logical_relationship"}, {"score": 0.0036311037851931498, "phrase": "processing_entities"}, {"score": 0.0035594478687904743, "phrase": "novel_framework"}, {"score": 0.0034317185678527672, "phrase": "cooperating_mobile_agents"}, {"score": 0.0033306180744375616, "phrase": "cooperation_tasks"}, {"score": 0.0031792196429621888, "phrase": "load_balancing"}, {"score": 0.0031581587465429593, "phrase": "mutual_exclusion"}, {"score": 0.003004572722189157, "phrase": "novel_approach"}, {"score": 0.0026480044868438875, "phrase": "deadlock_information"}, {"score": 0.0026130182682465096, "phrase": "network_sites"}, {"score": 0.002453027723284009, "phrase": "adaptive_hybrid_algorithm"}, {"score": 0.002310482790486003, "phrase": "system_state"}, {"score": 0.002287542098172185, "phrase": "different_deadlock_detection_strategies"}, {"score": 0.0022423402528961144, "phrase": "proposed_algorithm"}, {"score": 0.002133196554995389, "phrase": "existing_algorithms"}, {"score": 0.0021049977753042253, "phrase": "fixed_deadlock_detection_strategy"}], "paper_keywords": ["mobile agent", " internet computing", " distributed systems", " deadlock detection"], "paper_abstract": "Mobile agent has shown its promise as a powerful means to complement and enhance existing technology in various application areas. In particular, existing work has demonstrated that MA can simplify the development and improve the performance of certain classes of distributed applications, especially for those running on a wide-area, heterogeneous, and dynamic networking environment like the Internet. In our previous work, we extended the application of MA to the design of distributed control functions, which require the maintenance of logical relationship among and/or coordination of processing entities in a distributed system. A novel framework is presented for structuring and building distributed systems, which use cooperating mobile agents as an aid to carry out coordination and cooperation tasks in distributed systems. The framework has been used for designing various distributed control functions such as load balancing and mutual exclusion in our previous work. In this paper, we use the framework to propose a novel approach to detecting deadlocks in distributed system by using mobile agents, which demonstrates the advantage of being adaptive and flexible of mobile agents. We first describe the MAEDD (Mobile Agent Enabled Deadlock Detection) scheme, in which mobile agents are dispatched to collect and analyze deadlock information distributed across the network sites and, based on the analysis, to detect and resolve deadlocks. Then the design of an adaptive hybrid algorithm derived from the framework is presented. The algorithm can dynamically adapt itself to the changes in system state by using different deadlock detection strategies. The performance of the proposed algorithm has been evaluated using simulations. The results show that the algorithm can outperform existing algorithms that use a fixed deadlock detection strategy.", "paper_title": "Mobile agent-enabled framework for structuring and building distributed systems on the internet", "paper_id": "WOS:000244103600010"}