{"auto_keywords": [{"score": 0.04974633013174414, "phrase": "geometric_routing"}, {"score": 0.04925194419954486, "phrase": "virtual_locations"}, {"score": 0.032135267432065205, "phrase": "decreasing_distance"}, {"score": 0.004682525167261325, "phrase": "elegant_way"}, {"score": 0.004633805690244912, "phrase": "network_routing_problems"}, {"score": 0.0037587915908689497, "phrase": "origin_vertex_u"}, {"score": 0.0035299344877334385, "phrase": "neighbor_t"}, {"score": 0.003456777366713296, "phrase": "location_information"}, {"score": 0.003314965171168532, "phrase": "greedy_routing_scheme"}, {"score": 0.0027741761880779535, "phrase": "greedy_routing"}, {"score": 0.0026233771102489416, "phrase": "generalized_greedy_routing_algorithm"}, {"score": 0.00256895975568914, "phrase": "routing_paths"}, {"score": 0.002524473047010871, "phrase": "local_information"}, {"score": 0.0024894376091589244, "phrase": "simple_generalized_greedy_routing_algorithms"}, {"score": 0.0022260654608669593, "phrase": "arbitrary_trees"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Network routing", " Greedy routing", " Plane graph"], "paper_abstract": "Geometric routing by using virtual locations is an elegant way for solving network routing problems. In its simplest form, greedy routing, a message is simply forwarded to a neighbor that is closer to the destination. One main drawback of this approach is that the coordinates of the virtual locations require Omega(n log n) bits to represent, which makes this scheme infeasible in some applications. The essence of the geometric routing is the following: When an origin vertex u wants to send a message to a destination vertex w, it forwards the message to a neighbor t, solely based on the location information of u, w and all neighbors of u. In the greedy routing scheme, the decision is based on decreasing distance. For this idea to work, however, the decision needs not be based on decreasing distance. As long as the decision is made locally, this scheme will work fine. In this paper, we introduce a version of greedy routing which we call generalized greedy routing algorithm. Instead of relying on decreasing distance, a generalized greedy routing algorithm uses other criteria to determine routing paths, solely based on local information. We present simple generalized greedy routing algorithms based on st-coordinates (consisting of two integers between 0 and n-1), which are derived from an st-orientation of a 2-connected plane graph. We also generalize this result to arbitrary trees. Both algorithms are natural and simple to be implemented. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "A generalized greedy routing algorithm for 2-connected graphs", "paper_id": "WOS:000284252800003"}