{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "novel_putative_mitogen-activated_kinase_cascade"}, {"score": 0.004630626571109149, "phrase": "computational_approaches"}, {"score": 0.0042550030421781605, "phrase": "mental_retardation"}, {"score": 0.003834099867584972, "phrase": "known_genes"}, {"score": 0.0035458802311188497, "phrase": "ds_phenotype"}, {"score": 0.0033439771810057717, "phrase": "functional_hypothesis"}, {"score": 0.0032792555200980783, "phrase": "fold_recognition"}, {"score": 0.003236802914194731, "phrase": "hidden_markov_model_techniques"}, {"score": 0.0031127040190005216, "phrase": "ds_candidate_region"}, {"score": 0.0025934566395017424, "phrase": "structural_scaffold"}, {"score": 0.002398274973378986, "phrase": "biological_behavior"}, {"score": 0.0022468671200629024, "phrase": "specifically_designed_experiments"}, {"score": 0.0021049977753042253, "phrase": "therapeutic_approaches"}], "paper_keywords": [""], "paper_abstract": "Summ.: Down syndrome (DS) is the most frequent form of mental retardation and is caused by chromosome 21 (HSA21) trisomy. Despite the number of known genes involved in DS and its high therapeutic interest, biological mechanisms leading to the DS phenotype are not fully clear. We present a functional hypothesis based on fold recognition and hidden Markov model techniques for four HSA21 genes located in the DS Candidate Region (DSCR). More specifically, we propose that they are members of a novel mitogen-activated protein kinase pathway with DYRK1A, SNF1LK and RIPK4 gene products being elements of the kinase cascade and the DSCR3 acting as structural scaffold for their interaction. This hypothesis finds support in various biochemical studies concerning the biological behavior and features of the involved HSA21 proteins. Our analysis calls for specifically designed experiments to validate our prediction and establish its relevance in terms of therapeutic approaches to the disease.", "paper_title": "Identification of a novel putative mitogen-activated kinase cascade on human chromosome 21 by computational approaches", "paper_id": "WOS:000236251500001"}