{"auto_keywords": [{"score": 0.049474472243262034, "phrase": "piecewise_polynomial_lyapunov_functions"}, {"score": 0.04353594735474428, "phrase": "nonlinear_systems"}, {"score": 0.0245181241294545, "phrase": "bilinear_sos_problems"}, {"score": 0.02246846748295755, "phrase": "proposed_methodologies"}, {"score": 0.00481495049065317, "phrase": "stability_analysis_and_region-of-_attraction_estimation"}, {"score": 0.004081385289516914, "phrase": "polynomial_fuzzy_models"}, {"score": 0.003709974534103202, "phrase": "maximum-type_and_minimum-type_pplfs"}, {"score": 0.003525861581971337, "phrase": "less-conservative_results"}, {"score": 0.0033937776228549557, "phrase": "global_stability"}, {"score": 0.0033508547759861186, "phrase": "local_stability"}, {"score": 0.0026307897899760383, "phrase": "estimated_roa"}, {"score": 0.0022292394795878643, "phrase": "path-following_method"}], "paper_keywords": ["Path-following method", " piecewise polynomial Lyapunov function (PPLF)", " polynomial fuzzy model", " region-of-attraction (ROA)", " stability", " sum-of-squares (SOS)"], "paper_abstract": "This paper proposes sum-of-squares (SOS) methodologies for stability analysis and region-of-attraction (ROA) estimation for nonlinear systems represented by polynomial fuzzy models via piecewise polynomial Lyapunov functions (PPLFs). At first, two SOS-based global stability criteria are proposed by applying maximum-type and minimum-type PPLFs, respectively. It is known that less-conservative results can be obtained by reducing global stability to local stability, since it is usually the case for nonlinear systems that the stability cannot be reached globally. Therefore, based on the two types of PPLFs, two local stability criteria are further proposed with the algorithms that enlarge the estimated ROA as much as possible. The constraints for checking (global and local) stability and enlarging the estimated ROA are represented in terms of bilinear SOS problems. Hence, the path-following method is applied to solve the bilinear SOS problems in the proposed methodologies. Finally, some examples are provided to illustrate the utility of the proposed methodologies.", "paper_title": "Stability Analysis and Region-of- Attraction Estimation Using Piecewise Polynomial Lyapunov Functions: Polynomial Fuzzy Model Approach", "paper_id": "WOS:000359262400044"}