{"auto_keywords": [{"score": 0.04968705263604004, "phrase": "search_engine_marketing"}, {"score": 0.010612387000973441, "phrase": "long_tail"}, {"score": 0.004621043537046209, "phrase": "online_advertising"}, {"score": 0.004344662696228875, "phrase": "\"long_tail"}, {"score": 0.003985166330358716, "phrase": "search_engine_marketing_campaigns"}, {"score": 0.0027514186391258263, "phrase": "varying_total_number"}, {"score": 0.0025865679621853667, "phrase": "relatively_few_keywords"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Long tail", " Search engine marketing", " Online marketing"], "paper_abstract": "Search engine marketing is currently the most popular form of online advertising. Many advertising agencies and bloggers claim that the success of search engine marketing is driven by the \"long tail\", defined in this research as the many less popular keywords employed by users to search the Internet, and suggest that search engine marketing campaigns need to have hundreds or thousands of keywords to accommodate this phenomenon. We doubt this claim. Our data from three search engine marketing campaigns in two countries, which report the success of a total of 4908 keywords over 36 weeks, covering 10,104,015 searches and 492,735 clicks, show that the top 20% of all keywords attract on average 98.16% of all searches and generate 97.21% of all clicks. The use of the top 100 keywords in each campaign attracts on average 88.57% of all searches and 81.40% of all clicks. These results are fairly stable across a varying total number of keywords in use and suggest that the success of search engine marketing is driven by relatively few keywords. However, we also show that the set of the top 100 keywords changes over time. Hence, advertisers need to concentrate on finding the top 100 keywords, but they do not need to bother too much about the performance of keywords in the long tail. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "An analysis of the importance of the long tail in search engine marketing", "paper_id": "WOS:000282274200003"}