{"auto_keywords": [{"score": 0.04828362906607965, "phrase": "single_disk_failures"}, {"score": 0.030300638905853418, "phrase": "recovery_cost"}, {"score": 0.004192078165260057, "phrase": "n_disks"}, {"score": 0.003939565240409143, "phrase": "parity_codes"}, {"score": 0.0037377733149169573, "phrase": "parity_groups"}, {"score": 0.003597514862052876, "phrase": "positive_and_negative_slopes"}, {"score": 0.0032850648549389025, "phrase": "multistep_recovery_process"}, {"score": 0.002752139271586703, "phrase": "disk_loads"}, {"score": 0.002687070469080394, "phrase": "overall_load_increase"}, {"score": 0.002598543802992702, "phrase": "failed_disks"}, {"score": 0.002512926336312949, "phrase": "successive_n_x_n_arrays"}, {"score": 0.002406968743305622, "phrase": "load_increase"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Disk arrays", " Erasure coding", " RAID", " Performance analysis", " Fault tolerance", " Performance evaluation"], "paper_abstract": "X-code extends parity coding for correcting single disk failures in RAID 5 to two disks. Similar to RAID 6 X-code uses the minimum level of redundancy by dedicating the capacity of two out of N disks to check disks, but unlike RAID 6 it solely relies on parity codes, which are placed horizontally rather than vertically. The parity groups in X-code are defined as diagonals with positive and negative slopes. This study is mainly concerned with X-code arrays with two disk failures, since it requires a multistep recovery process, while its operation is otherwise similar to RAID 6. We use examples to gain insight into the cost of recovery and to develop an algorithm to estimate recovery cost for reconstructing two failed disks. We observe that disk loads are unbalanced and the overall load increase depends on the separation of the failed disks. Cyclically shifting or randomly permuting successive N x N arrays of blocks may be used to reduce the load increase to the mean across all of the possible (N - 1)/2 distances of the failed disks. We also present an improvement in recovery cost for single disk failures. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "X-code double parity array operation with two disk failures", "paper_id": "WOS:000290743600003"}