{"auto_keywords": [{"score": 0.04963913874714362, "phrase": "multidocument_summarization"}, {"score": 0.009325055592040053, "phrase": "qia_framework"}, {"score": 0.00481495049065317, "phrase": "quantum_physics_formalism"}, {"score": 0.004683503672929168, "phrase": "mds"}, {"score": 0.004349955692802962, "phrase": "different_query-related_themes"}, {"score": 0.0038046452381676967, "phrase": "salient_sentences"}, {"score": 0.003752275718257509, "phrase": "different_documents"}, {"score": 0.0036665842836420223, "phrase": "identified_themes"}, {"score": 0.003281643474564305, "phrase": "major_extension"}, {"score": 0.0031625006830124512, "phrase": "quantum_information_access"}, {"score": 0.0031333949463567554, "phrase": "qia"}, {"score": 0.0029642838574678526, "phrase": "information_access"}, {"score": 0.002909960617042717, "phrase": "probabilistic_formalism"}, {"score": 0.002883172383460653, "phrase": "quantum_physics"}, {"score": 0.0027275289970185015, "phrase": "current_lsa-based_approaches"}, {"score": 0.0026651772919894534, "phrase": "new_principled_criterium"}, {"score": 0.002418453525649304, "phrase": "lsa-based_approaches"}, {"score": 0.002174303033371869, "phrase": "yearly_duc_competitions"}, {"score": 0.0021245712108461227, "phrase": "potential_impact"}, {"score": 0.0021049977753042253, "phrase": "quantum-inspired_approaches"}], "paper_keywords": [""], "paper_abstract": "Multidocument summarization (MDS) aims for each given query to extract compressed and relevant information with respect to the different query-related themes present in a set of documents. Many approaches operate in two steps. Themes are first identified from the set, and then a summary is formed by extracting salient sentences within the different documents of each of the identified themes. Among these approaches, latent semantic analysis (LSA) based approaches rely on spectral decomposition techniques to identify the themes. In this article, we propose a major extension of these techniques that relies on the quantum information access (QIA) framework. The latter is a framework developed for modeling information access based on the probabilistic formalism of quantum physics. The QIA framework not only points out the limitations of the current LSA-based approaches, but motivates a new principled criterium to tackle multidocument summarization that addresses these limitations. As a byproduct, it also provides a way to enhance the LSA-based approaches. Extensive experiments on the DUC 2005, 2006 and 2007 datasets show that the proposed approach consistently improves over both the LSA-based approaches and the systems that competed in the yearly DUC competitions. This demonstrates the potential impact of quantum-inspired approaches to information access in general, and of the QIA framework in particular.", "paper_title": "On using a quantum physics formalism for multidocument summarization", "paper_id": "WOS:000303500300002"}