{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "linear_time_suffix_array_construction"}, {"score": 0.003989351600022163, "phrase": "proposed_algorithms"}, {"score": 0.0038114397487574838, "phrase": "variable-length_leftmost_s-type"}, {"score": 0.0034789831290103967, "phrase": "problem_reduction"}, {"score": 0.0033048445033866795, "phrase": "sampled_substrings"}, {"score": 0.0031573626285069157, "phrase": "variable-length_lms_substrings"}, {"score": 0.0030164423559955896, "phrase": "fixed-length_d-critical_substrings"}, {"score": 0.0028490783932465288, "phrase": "elegant_design_framework"}, {"score": 0.0026452734009203764, "phrase": "fully_functional_sample_implementations"}], "paper_keywords": ["Suffix array", " linear time", " divide-and-conquer"], "paper_abstract": "We present, in this paper, two efficient algorithms for linear time suffix array construction. These two algorithms achieve their linear time complexities, using the techniques of divide-and-conquer, and recursion. What distinguish the proposed algorithms from other linear time suffix array construction algorithms (SACAs) are the variable-length leftmost S-type (LMS) substrings and the fixed-length d-critical substrings sampled for problem reduction, and the simple algorithms for sorting these sampled substrings: the induced sorting algorithm for the variable-length LMS substrings and the radix sorting algorithm for the fixed-length d-critical substrings. The very simple sorting mechanisms render our algorithms an elegant design framework, and, in turn, the surprisingly succinct implementations. The fully functional sample implementations of our proposed algorithms require only around 100 lines of C code for each, which is only 1/10 of the implementation of the KA [1] algorithm and comparable to that of the KS [2] algorithm. The experimental results demonstrate that these two newly proposed algorithms yield the best time and space efficiencies among all the existing linear time SACAs.", "paper_title": "Two Efficient Algorithms for Linear Time Suffix Array Construction", "paper_id": "WOS:000294421000007"}