{"auto_keywords": [{"score": 0.045411026539702984, "phrase": "sensor_networks"}, {"score": 0.00481495049065317, "phrase": "space-time_sensor_network_data"}, {"score": 0.004546970518808189, "phrase": "fully_model-based_analysis"}, {"score": 0.004382591802405206, "phrase": "data_transmission"}, {"score": 0.004241451614311598, "phrase": "increasingly_common_data_collection_mechanism"}, {"score": 0.003797690272118125, "phrase": "stable_path"}, {"score": 0.0036156119373414067, "phrase": "process_model"}, {"score": 0.0026482660253173075, "phrase": "information_loss"}, {"score": 0.00241989408309933, "phrase": "varying_extents"}, {"score": 0.002380534385718454, "phrase": "varying_incidence"}, {"score": 0.002294294558114909, "phrase": "fully_model-based_analyses"}, {"score": 0.0022385401780982204, "phrase": "hierarchical_models"}, {"score": 0.00219311232069446, "phrase": "borrowing_strength"}, {"score": 0.0021398115287338693, "phrase": "available_data"}, {"score": 0.0021049977753042253, "phrase": "local_process_behavior"}], "paper_keywords": ["Hierarchical models", " Information loss", " Linear constraints", " Spatio temporal models", " Wireless sensor networks"], "paper_abstract": "In this paper we present a fully model-based analysis of the effects of suppression and failure in data transmission with sensor networks. Sensor networks are becoming an increasingly common data collection mechanism in a variety of fields. Sensors can be created to collect data at very high temporal resolution. However, during periods when the process is following a stable path, transmission of such high resolution data would carry little additional information with regard to the process model, i.e., all of the data that is collected need not be transmitted. In particular, when there is cost to transmission, we find ourselves moving to consideration of suppression in transmission. Additionally, for many sensor networks, in practice, we will experience failures in transmission-messages sent by a sensor but not received at the gateway, messages sent but arriving corrupted. Evidently, both suppression and failure lead to information loss which will be reflected in inference associated with our process model. Our effort here is to assess the impact of such information loss under varying extents of suppression and varying incidence of failure. We consider two illustrative process models, presenting fully model-based analyses of suppression and failure using hierarchical models. Such models naturally facilitate borrowing strength across nodes, leveraging all available data to learn about local process behavior.", "paper_title": "Analyzing space-time sensor network data under suppression and failure in transmission", "paper_id": "WOS:000281983200002"}