{"auto_keywords": [{"score": 0.044944435151402035, "phrase": "body_workspace"}, {"score": 0.040771302659816676, "phrase": "next_swing_leg"}, {"score": 0.015719716506582538, "phrase": "legged_locomotion"}, {"score": 0.014836304843108768, "phrase": "quadruped_walking_robot"}, {"score": 0.01301098665935525, "phrase": "inverse_kinematic_solutions"}, {"score": 0.012566108285675183, "phrase": "next_desired_foothold"}, {"score": 0.004200874581076468, "phrase": "valid_body_configurations"}, {"score": 0.004152018764100109, "phrase": "next_step"}, {"score": 0.004055998173160551, "phrase": "body_position"}, {"score": 0.0037957839728524046, "phrase": "static_equilibrium"}, {"score": 0.0033372020049592726, "phrase": "determined_space"}, {"score": 0.0027995677499976406, "phrase": "possible_solutions"}, {"score": 0.002756180088265064, "phrase": "next_body_configuration"}, {"score": 0.0026402908398883832, "phrase": "robot's_performances"}, {"score": 0.002579140290642792, "phrase": "intrinsic_role"}, {"score": 0.002559072326933071, "phrase": "static_walking"}, {"score": 0.0023946630984825207, "phrase": "pure_geometric_method"}, {"score": 0.002146527342660575, "phrase": "robot's_ability"}, {"score": 0.0021049977753042253, "phrase": "potential_applicability"}], "paper_keywords": ["Body movement", " Body workspace", " Legged robot", " Quadruped robot"], "paper_abstract": "This paper discusses on determination of the workspace of the body of a quadruped walking robot, called \"body workspace\", and its applicability in legged locomotion. The body workspace represents the set of all valid body configurations for a next step by considering three constraints of a body position: existence of the inverse kinematic solutions, reach-ability of the next swing leg to the next desired foothold, and static equilibrium of the robot when the next swing leg is lifted. The space contains all the body positions that ensure the existence of inverse kinematic solutions, is calculated in the first. Then, a subspace inside the determined space that allows the robot to reach the next desired foothold is analyzed. Finally, the workspace is obtained by excluding all the positions inside the subspace that do not ensure the equilibrium of the robot when the next swing leg is lifted. Therefore, the workspace shows all possible solutions for choosing the next body configuration of a given static walking problem. It is significant in improving the robot's performances since moving body takes an intrinsic role in static walking, besides swinging a leg. The algorithm runs fast in real-time because it is a pure geometric method. The body workspace of a quadruped walking robot is visualized to help the understanding of the algorithm. In addition, applications of using the body workspace in improving the robot's ability are presented to show potential applicability of the workspace.", "paper_title": "Body Workspace of Quadruped Walking Robot and its Applicability in Legged Locomotion", "paper_id": "WOS:000307716700007"}