{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_lifetime"}, {"score": 0.010539391314675699, "phrase": "sensor_networks"}, {"score": 0.007802396862689577, "phrase": "routing_tree"}, {"score": 0.004748556604045108, "phrase": "energy-constrained_sensor_networks"}, {"score": 0.0044608829094248985, "phrase": "prevalent_operation"}, {"score": 0.004384098916012568, "phrase": "significant_power_constraints"}, {"score": 0.004293693193836074, "phrase": "energy_efficient_methods"}, {"score": 0.004219774794569897, "phrase": "data_gathering"}, {"score": 0.0033433365160336842, "phrase": "internal_node"}, {"score": 0.002980916123365584, "phrase": "future_query_arrivals"}, {"score": 0.0029602552900111433, "phrase": "generation_rates"}, {"score": 0.0028293966058473476, "phrase": "data_gathering_queries"}, {"score": 0.0027903049766389433, "phrase": "first_node"}, {"score": 0.0026027798552168344, "phrase": "generic_cost_model"}, {"score": 0.002584733102974067, "phrase": "energy_consumption"}, {"score": 0.002479043701859468, "phrase": "query_evaluation"}, {"score": 0.0024029423526011353, "phrase": "np"}, {"score": 0.002233301265743633, "phrase": "proposed_algorithms"}, {"score": 0.002171979107594173, "phrase": "experimental_results"}], "paper_keywords": ["sensor network", " data gathering", " energy consumption optimization", " network lifetime", " sensor database", " sensornet query optimization"], "paper_abstract": "Energy-constrained sensor networks have been deployed widely for monitoring and surveillance purposes. Data gathering in such networks is often a prevalent operation. Since sensors have significant power constraints (battery life), energy efficient methods must be employed for data gathering to prolong network lifetime. We consider an online data gathering problem in sensor networks, which is stated as follows: Assume that there is a sequence of data gathering queries, which arrive one by one. To respond to each query as it arrives, the system builds a routing tree for it. Within the tree, the volume of the data transmitted by each internal node depends on not only the volume of sensed data by the node itself, but also the volume of data received from its children. The objective is to maximize the network lifetime without any knowledge of future query arrivals and generation rates. In other words, the objective is to maximize the number of data gathering queries answered until the first node in the network fails. For the problem of concern, in this paper, we first present a generic cost model of energy consumption for data gathering queries if a routing tree is used for the query evaluation. We then show the problem to be NP-complete and propose several heuristic algorithms for it. We finally conduct experiments by simulation to evaluate the performance of the proposed algorithms in terms of network lifetime delivered. The experimental results show that, among the proposed algorithms, one algorithm that takes into account both the residual energy and the volume of data at each sensor node significantly outperforms the others.", "paper_title": "Online data gathering for maximizing network lifetime in sensor networks", "paper_id": "WOS:000242117500001"}