{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service_network"}, {"score": 0.010150083881031724, "phrase": "web_services"}, {"score": 0.005863282709985305, "phrase": "functionality_reuse"}, {"score": 0.004829381636963937, "phrase": "opencyc"}, {"score": 0.0045357787854931894, "phrase": "software_industry"}, {"score": 0.004424268136268051, "phrase": "specific_functionality"}, {"score": 0.004243069282751866, "phrase": "service_semantics"}, {"score": 0.004180152442675688, "phrase": "association_semantics"}, {"score": 0.0041469500929423595, "phrase": "major_limitation"}, {"score": 0.0040449598280454645, "phrase": "manual_efforts"}, {"score": 0.0034938640424838257, "phrase": "service_composition"}, {"score": 0.0033140589981208693, "phrase": "domain_ontologies"}, {"score": 0.0031061129850110994, "phrase": "automatic_construction"}, {"score": 0.0027557911038816256, "phrase": "semantic_support"}, {"score": 0.002457110101089137, "phrase": "association_relations"}, {"score": 0.0023727863021828547, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "composite_service"}], "paper_keywords": ["Association Semantics", " OpenCyc", " Service Network", " Service Semantics", " Web Service"], "paper_abstract": "With the advent of Web Services, the software industry is evolving from developing specific functionality from scratch to reusing functionalities off the shelf. However, a major limitation of Web Services is that manual efforts are required in the functionality reuse. Thus, Service Network is proposed as an infrastructure that allows users to discover, deploy, synthesize and compose Web Services automatically. Nevertheless, the construction of Service Network suffers from the lack of domain ontologies. Based on OpenCyc, this paper presents an approach for the automatic construction of Service Network. In particular, the authors concentrate on two fundamental concepts in Service Network, including the service semantics and the association semantics. With the semantic support of OpenCyc, the service semantics is generated by augmenting the semantics of services, and the association semantics is acquired by identifying the association relations among services. And then a case study of service composition is presented to demonstrate how Service Network facilitates the functionality reuse. It is suggested that Service Network not only can effectively generate a composite service, but also can reduce the complexity of service composition.", "paper_title": "Automatic Construction of Service Network Based on OpenCyc", "paper_id": "WOS:000353297300001"}