{"auto_keywords": [{"score": 0.04927872927155838, "phrase": "medical_errors"}, {"score": 0.00481495049065317, "phrase": "clinical_guidelines"}, {"score": 0.004681525814235883, "phrase": "computer-interpretable_guidelines"}, {"score": 0.004500891637057374, "phrase": "patient_care"}, {"score": 0.0043029342321223825, "phrase": "evidence-based_recommendations"}, {"score": 0.004183638135671596, "phrase": "exceptional_behavior"}, {"score": 0.0036553070575015344, "phrase": "normal_cig_execution"}, {"score": 0.0032115093493071366, "phrase": "recommended_tasks"}, {"score": 0.0023166075278110254, "phrase": "generic_plan"}, {"score": 0.0022522565004588113, "phrase": "chronic_disease"}, {"score": 0.0021773853011112882, "phrase": "hypertension_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Clinical guidelines", " Exceptions", " Exception handling", " Goals", " Medical errors"], "paper_abstract": "Computer-interpretable guidelines (CIGs) aim to improve patient care and reduce medical errors. Although CIGs implement evidence-based recommendations they cannot prevent exceptional behavior from happening. To address this problem we developed a framework that can monitor, detect, and handle exceptions that occur during normal CIG execution and can potentially prevent them from developing into medical errors. Our framework enables specifying the goals of a guideline and linking them with recommended tasks that could satisfy the goals. Exceptions are linked with goals that manage them, which can be realized by tasks or plans. To achieve a link between the tasks, plans, goals, monitored effects, and exceptions, our definition of goals and exceptions is state-based. We demonstrate our approach using a generic plan for management of a chronic disease and a particular instantiation for hypertension management. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "A goal-oriented framework for specifying clinical guidelines and handling medical errors", "paper_id": "WOS:000276012800012"}