{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scholarly_communication"}, {"score": 0.014906290897332967, "phrase": "electronic_journals"}, {"score": 0.013238195930065694, "phrase": "electronic_resources"}, {"score": 0.008431881069079333, "phrase": "japan"}, {"score": 0.004506968388996092, "phrase": "common_use"}, {"score": 0.0033883824438527316, "phrase": "japanese_researchers'_information_behavior"}, {"score": 0.0033190180867511605, "phrase": "main_focus"}, {"score": 0.0032242793143795454, "phrase": "scholarly_journal"}, {"score": 0.0031845067058084583, "phrase": "electronic_form"}, {"score": 0.002665362204725326, "phrase": "main_results"}, {"score": 0.0026107601878587816, "phrase": "japanese_researchers"}, {"score": 0.0025892330566358503, "phrase": "stm_fields"}, {"score": 0.0022492129111567824, "phrase": "traditional_patterns"}, {"score": 0.002175913488493802, "phrase": "traditional_scholarly_journals"}], "paper_keywords": ["electronic journals", " scholarly journals", " scholarly communication", " electronic resources", " e-print archive", " researchers' use pattern"], "paper_abstract": "In recent years, electronic journals are in common use in scholarly communication and we can interpret this situation in various ways. On the one hand, we can say that scholarly communication is now much dependent on electronic resources. On the other hand, it would be too simplistic to say that scholarly communication is now greatly dependent on electronic resources because researchers seldom use other electronic resources. The purpose of this article is to show the position of electronic journals in scholarly communication based on Japanese researchers' information behavior and estimation. The main focus is on distinguishing the function of scholarly journal and the electronic form. A questionnaire was sent to 1427 physicists, 1026 chemists and 1276 pathologists in universities and other research institutes all over Japan, of whom 775 (54.3%), 494 (48.1%) and 541 (42.4%), respectively, supplied answers. The main results are as follows. Japanese researchers in STM fields use electronic journals as a matter of course, and other electronic resources to some extent, for accessing information; but this shift to electronic resources seemed to be not a transformation but a modification of traditional patterns of use. Researchers still rely on traditional scholarly journals for accessing information and publication, although their recognition has begun to change. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Electronic journals and their unbundled functions in scholarly communication: Views and utilization by scientific, technological and medical researchers in Japan", "paper_id": "WOS:000246869800016"}