{"auto_keywords": [{"score": 0.03137538591643984, "phrase": "ay_and_ac_values"}, {"score": 0.013928106633700756, "phrase": "possible_bridge_damage"}, {"score": 0.012865167676675547, "phrase": "taiwan"}, {"score": 0.009840540580956505, "phrase": "historical_cases"}, {"score": 0.00481495049065317, "phrase": "bridge_diagnostic"}, {"score": 0.0047145329604366395, "phrase": "evolutionary_support_vector_machine_inference_model"}, {"score": 0.004425616928975799, "phrase": "traffic_gridlock"}, {"score": 0.0042250123967577284, "phrase": "different_seismic_intensity_levels"}, {"score": 0.0037543106253910313, "phrase": "traditional_structural_analysis"}, {"score": 0.0033078284621762817, "phrase": "inference_model"}, {"score": 0.0029266219967426224, "phrase": "mapping_relation"}, {"score": 0.0029020077365708966, "phrase": "preliminary_assessment_factors"}, {"score": 0.002805597755796506, "phrase": "detailed_assessment"}, {"score": 0.0024926348205500715, "phrase": "bridge_management_personnel"}, {"score": 0.002461241017147324, "phrase": "short_period"}, {"score": 0.00231987280116332, "phrase": "training_cases"}, {"score": 0.002233301265743633, "phrase": "root_mean_square_error"}], "paper_keywords": [""], "paper_abstract": "Because earthquakes cause bridge damage resulting in incidents such as traffic gridlock and casualties, it is necessary to assess possible bridge damage under different seismic intensity levels in order to reduce the incidence of disasters. However, because there are many bridges in Taiwan, the time and budget will be restricted to conduct traditional structural analysis (preliminary assessment, detailed analysis) of each bridge to obtain its yield acceleration (Ay) and collapse acceleration (Ac). Hence, this study developed an inference model by integrating two AI techniques: support vector machines (SVM) and fast messy genetic algorithms (fmGA). The study applied historical cases to infer Ay and Ac values by the mapping relation between preliminary assessment factors (input) of historical cases and the detailed assessment of Ay and Ac values (output). According to the above inference model to predict Ay and Ac values, the probability of possible bridge damage by earthquakes can be predicted as a suggestion for bridge management personnel in a short period of time. This study adopted 121 RC bridges in Taiwan and selected 109 bridges for training cases and 12 bridges for testing cases to calculate the root mean square error (RMSE). The results indicate that the RMSE of training is 0.087 and of testing is 0.0869.", "paper_title": "SEISMIC ASSESSMENT OF BRIDGE DIAGNOSTIC IN TAIWAN USING THE EVOLUTIONARY SUPPORT VECTOR MACHINE INFERENCE MODEL (ESIM)", "paper_id": "WOS:000337240100002"}