{"auto_keywords": [{"score": 0.04788368904917638, "phrase": "program_schemes"}, {"score": 0.007279765847271696, "phrase": "exactly_the_class"}, {"score": 0.007227558125321501, "phrase": "recursively_enumerable_problems"}, {"score": 0.006080305712881483, "phrase": "npsq"}, {"score": 0.004814996969601165, "phrase": "queues"}, {"score": 0.004745965928357563, "phrase": "zero-one"}, {"score": 0.004447509888681154, "phrase": "additional_numeric_universe"}, {"score": 0.0042898529847155255, "phrase": "resulting_class"}, {"score": 0.0034417406427881075, "phrase": "infinite_hierarchy"}, {"score": 0.003283830127906969, "phrase": "first_class"}, {"score": 0.0031444844772458504, "phrase": "npsq."}, {"score": 0.0028418430688995247, "phrase": "vectorized_lindstrom_logics"}, {"score": 0.002634084319025334, "phrase": "zero-one_law"}, {"score": 0.0023977287074829798, "phrase": "particular_vectorized_lindstrom_logic"}, {"score": 0.0022876085523721324, "phrase": "logical_characterizations"}, {"score": 0.0022711207841260767, "phrase": "complexity_classes"}, {"score": 0.0022466111771668406, "phrase": "logical_analogues"}, {"score": 0.0021746545596056125, "phrase": "computational_complexity_theory"}, {"score": 0.0021281828046950096, "phrase": "np"}, {"score": 0.002104997853677991, "phrase": "elementary."}], "paper_keywords": ["program schemes", " descriptive complexity", " Lindstrom logics", " zero-one laws"], "paper_abstract": "We prove that a very basic class of program schemes augmented with access to a queue and an additional numeric universe within which counting is permitted, so that the resulting class is denoted NPSQ(+)(1), is such that the class of problems accepted by these program schemes is exactly the class of recursively enumerable problems. The class of problems accepted by the program schemes of the class NPSQ (1) where only access to a queue, and not the additional numeric universe, is allowed is exactly the class of recursively enumerable problems that are closed under extensions. We define an infinite hierarchy of classes of program schemes for which NPSQ (1) is the first class and the union of the classes of which is the class NPSQ. We show that the class of problems accepted by the program schemes of NPSQ is the union of the classes of problems defined by the sentences of all vectorized Lindstrom logics formed using operators whose corresponding problems are recursively enumerable and closed under extensions, and, as a result, has a zero-one law. Moreover, we also show that this class of problems can be realized as the class of problems defined by the sentences of a particular vectorized Lindstrom logic. Finally, we show how our results can be applied to yield logical characterizations of complexity classes and provide logical analogues to a number of inequalities and hypotheses from computational complexity theory involving (non-deterministic) complexity classes ranging from NP through to ELEMENTARY.", "paper_title": "Program Schemes, Queues, the Recursive Spectrum and Zero-one Laws", "paper_id": "WOS:000265239300011"}