{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "communication_complexity"}, {"score": 0.008015857592209422, "phrase": "jain_et_al"}, {"score": 0.005782716546720348, "phrase": "set-disjointness_problem"}, {"score": 0.004571692719970733, "phrase": "one-way_public-coin_model"}, {"score": 0.004483659121004398, "phrase": "x_x_y_x_z"}, {"score": 0.004107935669507044, "phrase": "worst-case_error_e"}, {"score": 0.0036671822784770463, "phrase": "tight_characterization"}, {"score": 0.003527181559366122, "phrase": "new_characterization"}, {"score": 0.0034035317633176352, "phrase": "independent_interest"}, {"score": 0.0033271045779740683, "phrase": "two-way_public-coin_communication_complexity"}, {"score": 0.0031383410838018984, "phrase": "new_complexity_measure"}, {"score": 0.0029892206557359836, "phrase": "two-way_product_subdistribution"}, {"score": 0.002659527314613792, "phrase": "completely_different_arguments"}, {"score": 0.0026423134393535265, "phrase": "strong_direct_product_result"}, {"score": 0.0024521640882380477, "phrase": "tight_lower_bound"}, {"score": 0.002389276641014013, "phrase": "n-bit_inputs"}], "paper_keywords": ["Theory", " Algorithms", " Performance", " Communication complexity", " strong direct product", " information theory"], "paper_abstract": "We show two new direct product results in two different models of communication complexity. Our first result is in the one-way public-coin model. Let f subset of X x Y x Z be a relation and epsilon > 0 be a constant. Let R1, pub e (f) represent the communication complexity of f, with worst-case error e in this model. We show that if for computing f(k) (k independent copies of f) in this model, o(k.R-1/3(1,pub)(f)) communication is used, then the success is exponentially small in k. We show a new tight characterization of communication complexity in this model which strengthens the tight characterization shown in Jain et al. [2008]. We use this new characterization to show our direct product result and this characterization may also be of independent interest. Our second direct product result is in themodel of two-way public-coin communication complexity. We show a direct product result for all relations in this model in terms of a new complexity measure that we define. Our new measure is a generalization to nonproduct distributions, of the two-way product subdistribution bound of Jain et al. [2008]. Our direct product result therefore generalizes to nonproduct distributions, their direct product result in terms of the two-way product subdistribution bound. As an application of our new direct product result, we reproduce (via completely different arguments) strong direct product result for the set-disjointness problem which was previously shown by Klauck [2010]. We show this by proving that our new complexity measure gives a tight lower bound of Omega(n) for the set-disjointness problem on n-bit inputs (this strengthens the linear lower bound on the rectangle/corruption bound for set-disjointness shown by Razborov [1992]). In addition, we show that many previously known direct product results in this model are uniformly implied and often strengthened by our result.", "paper_title": "New Strong Direct Product Results in Communication Complexity", "paper_id": "WOS:000357529300003"}