{"auto_keywords": [{"score": 0.034915179178448524, "phrase": "calculation_complexity"}, {"score": 0.004439097815805505, "phrase": "data_mining"}, {"score": 0.004300951511110487, "phrase": "linguistic_terms"}, {"score": 0.004243064277617193, "phrase": "fuzzy_sets"}, {"score": 0.00418595288276353, "phrase": "owa_mechanism"}, {"score": 0.0040010534672646775, "phrase": "zhou_et_al"}, {"score": 0.003400274964240732, "phrase": "fuzzy_weighted_average"}, {"score": 0.0031917146566068245, "phrase": "recent_fwa_approaches"}, {"score": 0.003148709618042979, "phrase": "important_reference"}, {"score": 0.002675571068567923, "phrase": "proposed_odsowa_algorithm"}, {"score": 0.002367875199095903, "phrase": "odsfwa"}, {"score": 0.0022940375532231145, "phrase": "computational_costs"}, {"score": 0.0022733662000757318, "phrase": "cpu_time_costs"}, {"score": 0.002202469129781332, "phrase": "odsowa_approach"}, {"score": 0.0021727640931660038, "phrase": "arithmetical_operations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["OWA operators", " FWA operators", " Type-1 OWA operators", " Fuzzy set", " Calculation complexity"], "paper_abstract": "Type-1 ordered weighted average (OWA) operator is important in decision making and data mining because it is able to aggregate linguistic terms represented as fuzzy sets via the OWA mechanism. Currently, the most efficient type-1 OWA operator is that proposed by Zhou et al. [10], namely, the alpha-level type-1 OWA. The calculation complexity of the operator is between O(n) and O(n(2)). Since the calculation of alpha-level type-1 OWA is very similar to that of fuzzy weighted average (FWA) and the calculation complexity of several most efficient FWA algorithms is O(n), the recent FWA approaches may provide important reference for improving the efficiency of the alpha-level type-1 OWA operator. In this paper, an opposite direction searching algorithm for calculating type-1 OWA (ODSOWA) is proposed based on ODSFWA, one of the most efficient FWA algorithms at present. Procedures of the proposed ODSOWA algorithm for calculating the type-1 OWA are explained, and the calculation complexity of the algorithm is proved to be O(n). Simulation was performed to compare the ODSFWA with the alpha-level type-1 OWA in terms of computational costs and CPU time costs. The results indicate that the ODSOWA approach can save arithmetical operations significantly. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "An opposite direction searching algorithm for calculating the type-1 ordered weighted average", "paper_id": "WOS:000325600200014"}