{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "route_directions"}, {"score": 0.004537254814246843, "phrase": "assumed_spatial_knowledge"}, {"score": 0.004050625770007516, "phrase": "today's_navigation_systems"}, {"score": 0.003900257249255497, "phrase": "current_research"}, {"score": 0.0035965032173588753, "phrase": "individual_users"}, {"score": 0.0034629341517018438, "phrase": "extended_learning_phase"}, {"score": 0.003298441494378465, "phrase": "adaptive_route_directions"}, {"score": 0.003124790943886441, "phrase": "turn_directions"}, {"score": 0.0030911702059432224, "phrase": "destination_descriptions"}, {"score": 0.002881255933884771, "phrase": "wayfinder's_previous_knowledge"}, {"score": 0.0026710653215026685, "phrase": "presented_information"}, {"score": 0.0025440911575156755, "phrase": "problem_formalization"}, {"score": 0.002345707314211983, "phrase": "actual_dialog"}], "paper_keywords": ["route directions", " destination description", " turn-by-turn directions"], "paper_abstract": "Humans adapt the instructions provided in route directions to the assumed spatial knowledge of the receivers; the majority of route directions is provided to wayfinders with at least partial spatial knowledge of the environment. However, today's navigation systems assume no a priori knowledge. Most of current research addresses this by exploring means to personalize assistance through the capture of knowledge about individual users. Accordingly, such systems require an extended learning phase. In this paper, an approach to adaptive route directions based on a combination of turn-by-turn directions and destination descriptions is presented. This approach does not rely on information on a wayfinder's previous knowledge. Instead, a wayfinder can adjust the type and detail of the presented information via dialog. The paper focuses on the problem formalization and its algorithmic realization; the approach is generic with respect to the modality of the actual dialog (e.g., verbal or key-press based computer interfaces). The paper provides a contribution towards non-static, adaptive route direction services. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A dialog-driven process of generating route directions", "paper_id": "WOS:000257017100006"}