{"auto_keywords": [{"score": 0.0457532685054208, "phrase": "natural_numbers"}, {"score": 0.03418287568362411, "phrase": "upper_bounds"}, {"score": 0.00481495049065317, "phrase": "model_classes"}, {"score": 0.004549734943142138, "phrase": "finite_upper_bounds"}, {"score": 0.004485735417293941, "phrase": "future_draw"}, {"score": 0.004422632150619634, "phrase": "unknown_distribution_p"}, {"score": 0.003820144626025562, "phrase": "probability_distributions"}, {"score": 0.0036610702290043387, "phrase": "distributions_p"}, {"score": 0.003459191419478298, "phrase": "prediction_game"}, {"score": 0.0033943947596098583, "phrase": "infinitely_many_draws"}, {"score": 0.002917736974519881, "phrase": "finite_time"}, {"score": 0.0025922974876210194, "phrase": "prescribed_confidence"}, {"score": 0.002358220053411644, "phrase": "infinite_time_window"}, {"score": 0.0022175019341824603, "phrase": "model_class_p"}, {"score": 0.0021049977753042253, "phrase": "class_p"}], "paper_keywords": ["insurance", " l(1) topology of probability distributions over countable sets", " non-parametric approaches", " prediction of quantiles of distributions", " universal compression"], "paper_abstract": "Motivated by problems in insurance, our task is to predict finite upper bounds on a future draw from an unknown distribution p over natural numbers. We can only use past observations generated independently and identically distributed according to p. While p is unknown, it is known to belong to a given collection P of probability distributions on the natural numbers. The support of the distributions p is an element of P may be unbounded, and the prediction game goes on for infinitely many draws. We are allowed to make observations without predicting upper bounds for some time. But we must, with probability 1, start and then continue to predict upper bounds after a finite time irrespective of which p is an element of P governs the data. If it is possible, without knowledge of p and for any prescribed confidence however close to 1, to come up with a sequence of upper bounds that is never violated over an infinite time window with confidence at least as big as prescribed, we say the model class P is insurable. We completely characterize the insurability of any class P of distributions over natural numbers by means of a condition on how the neighborhoods of distributions in P should be, one that is both necessary and sufficient.", "paper_title": "Agnostic Insurability of Model Classes", "paper_id": "WOS:000369887600006"}