{"auto_keywords": [{"score": 0.04346060492379688, "phrase": "structural_properties"}, {"score": 0.03936500973903664, "phrase": "co-expression_networks"}, {"score": 0.00481495049065317, "phrase": "microarray-based_gene_expression_data"}, {"score": 0.004678384952779725, "phrase": "different_biological_processes"}, {"score": 0.004602085616330634, "phrase": "gene_co-expression_networks"}, {"score": 0.003952513974962462, "phrase": "known_biological_networks"}, {"score": 0.0036855132234738736, "phrase": "species_saccharomyces_cerevisiae"}, {"score": 0.0035956327252723483, "phrase": "topological_properties"}, {"score": 0.0035225628368257757, "phrase": "mips"}, {"score": 0.003464890914694523, "phrase": "protein-protein_interaction"}, {"score": 0.0033115124244647736, "phrase": "topological_comparisons"}, {"score": 0.0031518989079229714, "phrase": "mips_physical_interaction_networks"}, {"score": 0.0031132086055691214, "phrase": "important_structural_differences"}, {"score": 0.0027514186391258263, "phrase": "high_gene_expression_correlation_degree"}, {"score": 0.002618730478351454, "phrase": "physical_binding"}, {"score": 0.0024821782596371536, "phrase": "mips_physical_interaction"}, {"score": 0.002391825892939338, "phrase": "yeast_regulatory_network"}, {"score": 0.0023721974375323267, "phrase": "inferred_yeast_co-expression_networks"}, {"score": 0.0021049977753042253, "phrase": "ppi_or_mips_physical_interaction_networks"}], "paper_keywords": [""], "paper_abstract": "Motivation: Microarray-based gene expression data have been generated widely to study different biological processes and systems. Gene co-expression networks are often used to extract information about groups of genes that are 'functionally' related or co-regulated. However, the structural properties of such co-expression networks have not been rigorously studied and fully compared with known biological networks. In this article, we aim at investigating the structural properties of co-expression networks inferred for the species Saccharomyces Cerevisiae and comparing them with the topological properties of the known, well-established transcriptional network, MIPS physical network and protein-protein interaction (PPI) network of yeast. Results: These topological comparisons indicate that co-expression networks are not distinctly related with either the PPI or the MIPS physical interaction networks, showing important structural differences between them. When focusing on a more literal comparison, vertex by vertex and edge by edge, the conclusion is the same: the fact that two genes exhibit a high gene expression correlation degree does not seem to obviously correlate with the existence of a physical binding between the proteins produced by these genes or the existence of a MIPS physical interaction between the genes. The comparison of the yeast regulatory network with inferred yeast co-expression networks would suggest, however, that they could somehow be related. Conclusions: We conclude that the gene expression-based coexpression networks reflect more on the gene regulatory networks but less on the PPI or MIPS physical interaction networks.", "paper_title": "Co-expression networks: graph properties and topological comparisons", "paper_id": "WOS:000273696900009"}