{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "it-business_strategic_alignment"}, {"score": 0.04168332478241091, "phrase": "alignment_paradox"}, {"score": 0.004703878334423852, "phrase": "meta-analysis._research"}, {"score": 0.004406260054779782, "phrase": "firm_performance"}, {"score": 0.004205226397573506, "phrase": "apparently_conflicting_findings"}, {"score": 0.003587616378156851, "phrase": "alignment_dimensions"}, {"score": 0.0033919477901198716, "phrase": "unique_relationships"}, {"score": 0.0033447157263095223, "phrase": "different_performance_types"}, {"score": 0.0030747771905143273, "phrase": "alignment's_nomological_network"}, {"score": 0.0030178044717552605, "phrase": "corrected_correlations"}, {"score": 0.0029343128039167185, "phrase": "dependent_variables"}, {"score": 0.002839812512030847, "phrase": "credibility_interval_values"}, {"score": 0.0026474076254702525, "phrase": "extant_literature"}, {"score": 0.0022686625017583387, "phrase": "alignment_research"}, {"score": 0.0021049977753042253, "phrase": "future_it_research"}], "paper_keywords": ["Alignment", " business-IT strategic alignment", " alignment paradox", " IT value", " productivity paradox", " meta-analysis", " review"], "paper_abstract": "Research examining the relationship between IT-business strategic alignment (hereafter referred to as alignment) and firm performance (hereafter referred to as performance) has produced apparently conflicting findings (i.e., an alignment paradox). To examine the alignment paradox, we conducted a meta-analysis that probed the interrelationships between alignment, performance, and context constructs. We found the alignment dimensions (intellectual, operational, and cross-domain) demonstrate unique relationships with the different performance types (financial performance, productivity, and customer benefit) and with many of the other constructs in alignment's nomological network. All mean corrected correlations between dimensions of alignment and dependent variables were positive and most of the credibility interval values in these analyses were also positive. Overall, the evidence gathered from the extant literature suggests there is not much of an alignment paradox. This study contributes to the literature by clarifying the relationships between alignment and performance outcomes and offering insight into sources of inconsistencies in alignment research. By doing so, this paper lays a foundation for more consistent treatment of alignment in future IT research.", "paper_title": "LOOKING TOWARD THE FUTURE OF IT-BUSINESS STRATEGIC ALIGNMENT THROUGH THE PAST: A META-ANALYSIS", "paper_id": "WOS:000348600300011"}