{"auto_keywords": [{"score": 0.024894938256952034, "phrase": "stm"}, {"score": 0.00481495049065317, "phrase": "executive_information_system_development_risks"}, {"score": 0.004639612079116459, "phrase": "valuable_tools"}, {"score": 0.0045160988337296605, "phrase": "strategic_decisions"}, {"score": 0.004293267161763508, "phrase": "numerous_risks"}, {"score": 0.004193059395895776, "phrase": "socio-technical_model"}, {"score": 0.003879919492075319, "phrase": "risk_management_strategies"}, {"score": 0.0038278890186559276, "phrase": "current_practices"}, {"score": 0.0035665572404924052, "phrase": "eis."}, {"score": 0.0033898129842622536, "phrase": "detailed_experiences"}, {"score": 0.003299460925313939, "phrase": "eis_projects"}, {"score": 0.002758597251689795, "phrase": "risk_management"}, {"score": 0.0027032319980161805, "phrase": "eis._conclusion"}, {"score": 0.002685024286204448, "phrase": "executive_information_systems"}, {"score": 0.0026579417954765137, "phrase": "integral_role"}, {"score": 0.002640038329840458, "phrase": "business_decision_making"}, {"score": 0.0025180372061991206, "phrase": "clear_understanding"}, {"score": 0.0024926348205500715, "phrase": "appropriate_technology"}, {"score": 0.0023139986108451946, "phrase": "useful_tool"}, {"score": 0.002148136905808445, "phrase": "development_approaches"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Executive information systems", " Project management", " Software development", " Risk", " Socio-technical model"], "paper_abstract": "Context: Executive information systems (EIS) are valuable tools that enable executives to formulate and execute strategic decisions in their organizations. However, implementation of an EIS is complex and laden with numerous risks. Objective: We apply the socio-technical model (STM) to propose a framework of risks for the development and implementation of an EIS. Such a framework may serve to guide risk management strategies and procedures beyond current practices. Method: To assess, and better understand, the risks associated with implementing an EIS, interviews were conducted with the employees of three principle stakeholders of a taxation EIS. The interviews centered on the detailed experiences of the participants applying and working with EIS projects at their respective organizations. Results: Content analysis of the interviews confirmed an ability to designate risks to both the project and the product of development through dimensions of task, actor, structure and technology as well as the fit between each combination. The result adds credence to the model for purposes of risk management in the development of an EIS. Conclusion: Executive information systems play an integral role in business decision making. The successful construction and implementation of an EIS are reliant upon a clear understanding of the appropriate technology to be used, the end-user accessing the system, and the tasks executed. The STM is a useful tool for the identification of risks in the creation of an EIS. Further work should consider the extendability to other systems and its compatibility with development approaches. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "The roots of executive information system development risks", "paper_id": "WOS:000363076200003"}