{"auto_keywords": [{"score": 0.04188956702114718, "phrase": "gnutella_network"}, {"score": 0.007998497403938407, "phrase": "detailed_analysis"}, {"score": 0.006933559687034643, "phrase": "current_gnutella_network"}, {"score": 0.004313998277748922, "phrase": "gnutella"}, {"score": 0.004054169947971483, "phrase": "power-law_distributions"}, {"score": 0.003939565240409143, "phrase": "previous_researchers"}, {"score": 0.0037556843869894566, "phrase": "earlier_power-laws"}, {"score": 0.003429544382524185, "phrase": "important_trends"}, {"score": 0.003043031131345537, "phrase": "novel_two-layered_approach"}, {"score": 0.002500927169609655, "phrase": "two-layered_overlay"}, {"score": 0.0024771000236931836, "phrase": "present_six_power-laws"}, {"score": 0.0023388183537341213, "phrase": "two-layered_approach"}, {"score": 0.0022834993174767016, "phrase": "realistic_topologies"}, {"score": 0.0021976915360493628, "phrase": "artificial_topologies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["peer-to-peer", " overlay network", " network topology", " power-law"], "paper_abstract": "Modeling peer-to-peer (P2P) networks is a challenge for P2P researchers. In this paper, we provide a detailed analysis of large-scale hybrid P2P overlay network topology, using Gnutella as a case study. First, we re-examine the power-law distributions of the Gnutella network discovered by previous researchers. Our results show that the current Gnutella network deviates from the earlier power-laws, suggesting that the Gnutella network topology may have evolved a lot over time. Second, we identify important trends with regard to the evolution of the Gnutella network between September 2005 and February 2006. Upon analyzing the limitations of the power-laws, we provide a novel two-layered approach to study the topology of the Gnutella network. We divide the Gnutella network into two layers, namely the mesh and the forest, to model the hybrid and highly dynamic architecture of the current Gnutella network. We give a detailed analysis of the two-layered overlay and present six power-laws and one empirical law to characterize the topology. Using the two-layered approach and laws proposed, realistic topologies can be generated and the realism of artificial topologies can be validated. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Analysis of hybrid P2P overlay network topology", "paper_id": "WOS:000253303100002"}