{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "conceptualizing_it_capability"}, {"score": 0.0045124316982387315, "phrase": "information_technology"}, {"score": 0.004302680891412643, "phrase": "information_systems_scholars"}, {"score": 0.004247180402119585, "phrase": "relevant_studies"}, {"score": 0.0034953361767153285, "phrase": "capability_research"}, {"score": 0.003450213580299164, "phrase": "theoretical_lens"}, {"score": 0.0033039560332995136, "phrase": "imbrication_metaphor"}, {"score": 0.0032471982781283374, "phrase": "early_study"}, {"score": 0.0031230216871739776, "phrase": "firm's_it_capability"}, {"score": 0.00308269056870936, "phrase": "sociomaterial_perspective"}, {"score": 0.0030166226457616616, "phrase": "key_building_blocks"}, {"score": 0.0028513785049061767, "phrase": "existing_studies"}, {"score": 0.0028145455182562807, "phrase": "expanded_imbrication_metaphor"}, {"score": 0.0026835045963349647, "phrase": "third-order_construct"}, {"score": 0.002637377202509382, "phrase": "entanglement_concept"}, {"score": 0.002525489173110693, "phrase": "traditional_modeling_approaches"}, {"score": 0.0023562342764987254, "phrase": "true_contribution"}, {"score": 0.0022957232752482196, "phrase": "business_performance"}, {"score": 0.002236762786982225, "phrase": "practical_implications"}], "paper_keywords": ["imbrication metaphor", " IT capability", " sociomaterialism", " sociomateriality", " third-order factor"], "paper_abstract": "Sociomateriality (or sociomaterialism) allows us to approach the information technology (IT) capability research from an angle that has been rarely visited by information systems scholars. While relevant studies presume that humans and materials are distinct and largely independent, sociomateriality emphasizes agency that represents the relational, emergent, and shifting capacity realized through the association of actors (both humans and materials). The objective of this paper is to explore the value of conducting IT capability research through the theoretical lens of sociomaterialism. For this, we expand the imbrication metaphor introduced in an early study to explain the formation and advancement of a firm's IT capability from the sociomaterial perspective. Then, the key building blocks of IT capability of an organization are conceptualized based on the combination of existing studies and the expanded imbrication metaphor. Lastly, the effectiveness of formulating IT capability as a third-order construct that substantiates the entanglement concept of sociomaterialism is examined in comparison with that of traditional modeling approaches. We confirm the value of sociomaterialism in conceptualizing IT capability and subsequently in unraveling the true contribution of IT capability toward strengthening business performance. The findings also have practical implications in which IT capability is a function of IT management capability as well as IT personnel capability and IT infrastructure capability.", "paper_title": "Investigating the Value of Sociomaterialism in Conceptualizing IT Capability of a Firm", "paper_id": "WOS:000318678100011"}