{"auto_keywords": [{"score": 0.041212910961789084, "phrase": "nursing_assessment_documentation"}, {"score": 0.010612387000973441, "phrase": "nursing_assessment"}, {"score": 0.007423195039742247, "phrase": "assessment_forms"}, {"score": 0.006799041422771783, "phrase": "paper-based_records"}, {"score": 0.004782455247247007, "phrase": "paper-based_and_electronic_systems"}, {"score": 0.0047501930781356705, "phrase": "australian"}, {"score": 0.004607594060491493, "phrase": "nursing_assessment_documentation_practices"}, {"score": 0.004576491793324233, "phrase": "aged_care_organizetions"}, {"score": 0.004439097815805505, "phrase": "paper-based_documentation"}, {"score": 0.0042912493195237725, "phrase": "retrospective_nursing_documentation_audit_study"}, {"score": 0.0039028497942174777, "phrase": "participating_aged_care_homes"}, {"score": 0.0036224139706218916, "phrase": "seven_measures"}, {"score": 0.003272083495778595, "phrase": "varying_practice"}, {"score": 0.0031845067058084583, "phrase": "different_aged_care_organizations"}, {"score": 0.003141598480804135, "phrase": "electronic_resident_records"}, {"score": 0.0031203609829058587, "phrase": "higher_numbers"}, {"score": 0.0028184476518849015, "phrase": "documentation_systems"}, {"score": 0.002678598911294797, "phrase": "different_care_domains"}, {"score": 0.002624616889866485, "phrase": "personal_hygiene_assessment_forms"}, {"score": 0.0025028412246758994, "phrase": "documentation_structure"}, {"score": 0.0021703067932421463, "phrase": "documentation_quality"}, {"score": 0.002148315508445588, "phrase": "clinical_perspective"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic health records", " Paper records", " Assessment forms", " Audit", " Evaluation", " Quality", " Aged care"], "paper_abstract": "Purpose: To describe nursing assessment documentation practices in aged care organizetions and to evaluate the quality of electronic versus paper-based documentation of nursing assessment. Methods: This was a retrospective nursing documentation audit study. Study samples were 2299 paper-based and 6997 electronic resident assessment forms contained in 159 paper-based and 249 electronic resident nursing records, respectively, from three aged care organizations. The practice of nursing assessment documentation in participating aged care homes was described. Three attributes of quality of nursing assessment documentation 'were evaluated: format and structure, process, and content by seven measures: quantity, completeness, timeliness comprehensiveness, frequencies of documentation specific to care domains and data items, and whether assessment forms were signed and dated. Results: Varying practice in documentation of nursing assessment was found among different aged care organizations and homes. Electronic resident records contained higher numbers and more comprehensive resident assessment forms than paper-based records. The frequency of documentation was higher in electronic than in paper-based records in relation to most care domains. There was no difference between the two types of documentation systems on other aspects of nursing assessment documentation (overall completeness and timeliness, variation of frequencies among different care domains, and item completion in personal hygiene assessment forms). Conclusions: Electronic nursing documentation systems could improve the quality of documentation structure and format, process and content in the aspects of quantity, comprehensiveness and signing and dating of assessment forms. Further studies are needed to understand the factors leading to the variations of practice and the limitations of nursing assessment documentation and to evaluate documentation quality from a clinical perspective. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Description and comparison of documentation of nursing assessment between paper-based and electronic systems in Australian aged care homes", "paper_id": "WOS:000323584700005"}