{"auto_keywords": [{"score": 0.038719753539566616, "phrase": "grid_points"}, {"score": 0.02888394196529328, "phrase": "local_grids"}, {"score": 0.00481495049065317, "phrase": "overlapping_grids"}, {"score": 0.004707188147442449, "phrase": "rigid_objects"}, {"score": 0.0046018264570209765, "phrase": "computational_fluid_dynamics"}, {"score": 0.004464987136420614, "phrase": "natural_phenomena"}, {"score": 0.004299621153829837, "phrase": "single_grid"}, {"score": 0.003480161521018509, "phrase": "computational_cost"}, {"score": 0.0033008858616145205, "phrase": "multiple_grids"}, {"score": 0.0031665087019813244, "phrase": "large_single_grid"}, {"score": 0.003026127736667187, "phrase": "simulation_space"}, {"score": 0.0030033417337933625, "phrase": "separate_grids"}, {"score": 0.0028271058251633815, "phrase": "local_grid"}, {"score": 0.0027532820796396713, "phrase": "global_grid"}, {"score": 0.002402921062033032, "phrase": "appropriate_resolutions"}, {"score": 0.0021451873499061633, "phrase": "gpu_implementation"}, {"score": 0.0021049977753042253, "phrase": "real-time_simulation"}], "paper_keywords": [""], "paper_abstract": "Recently, many techniques using computational fluid dynamics have been proposed for the simulation of natural phenomena such as smoke and fire. Traditionally, a single grid is used for computing the motion of fluids. When an object interacts with a fluid, the resolution of the grid must be sufficiently high because the shape of the object is represented by a shape sampled at the grid points. This increases the number of grid points that are required, and hence the computational cost is increased. To address this problem, we propose a method using multiple grids that overlap with each other. In addition to a large single grid (a global grid) that covers the whole of the simulation space, separate grids (local grids) are generated that surround each object. The resolution of a local grid is higher than that of the global grid. The local grids move according to the motion of the objects. Therefore, the process of resampling the shape of the object is unnecessary when the object moves. To accelerate the computation, appropriate resolutions are adaptively-determined for the local grids according to their distance from the viewpoint. Furthermore, since we use regular (orthogonal) lattices for the grids, the method is suitable for GPU implementation. This realizes the real-time simulation of interactions between objects and smoke.", "paper_title": "A fast simulation method using overlapping grids for interactions between smoke and rigid objects", "paper_id": "WOS:000255285500037"}