{"auto_keywords": [{"score": 0.0422819185099689, "phrase": "finite_simplicial_complex"}, {"score": 0.04107868567004354, "phrase": "boundary_matrix"}, {"score": 0.03530992522222898, "phrase": "total_unimodularity"}, {"score": 0.031325598349779195, "phrase": "polynomial_time"}, {"score": 0.00481495049065317, "phrase": "simplicial_complex"}, {"score": 0.00448958076531243, "phrase": "minimal_weight"}, {"score": 0.0032489004068215407, "phrase": "optimization_problem"}, {"score": 0.0032058286587989234, "phrase": "inherently_an_integer_programming_problem"}, {"score": 0.003163326114997034, "phrase": "linear_program"}, {"score": 0.00312138530097218, "phrase": "integer_solution"}, {"score": 0.003039159447717346, "phrase": "optimal_cycles"}, {"score": 0.00285242509099472, "phrase": "recent_result"}, {"score": 0.0027876870537233787, "phrase": "np"}, {"score": 0.002413901117219286, "phrase": "orientable_compact_d-manifold"}, {"score": 0.002242911772136627, "phrase": "optimal_chain"}, {"score": 0.0021049977753042253, "phrase": "topological_characterization"}], "paper_keywords": ["computational topology", " homology localization", " simplicial complex", " optimal chain"], "paper_abstract": "Given a simplicial complex with weights on its simplices, and a nontrivial cycle on it, we are interested in finding the cycle with minimal weight which is homologous to the given one. Assuming that the homology is defined with integer (Z) coefficients, we show the following (Theorem 5.2): For a finite simplicial complex K of dimension greater than p, the boundary matrix [partial derivative(p+1)] is totally unimodular if and only if H(p)(L, L(0)) is torsion-free for all pure subcomplexes L(0), L in K of dimensions p and p+1, respectively, where L(0) subset of L. Because of the total unimodularity of the boundary matrix, we can solve the optimization problem, which is inherently an integer programming problem, as a linear program and obtain an integer solution. Thus, the problem of finding optimal cycles in a given homology class can be solved in polynomial time. This result is surprising in the backdrop of a recent result which says that the problem is NP-hard under Z(2) coefficients which, being a field, is in general easier to deal with. Our result implies, among other things, that one can compute in polynomial time an optimal (d - 1)-cycle in a given homology class for any triangulation of an orientable compact d-manifold or for any finite simplicial complex embedded in R(d). Our optimization approach can also be used for various related problems, such as finding an optimal chain homologous to a given one when these are not cycles. Our result can also be viewed as providing a topological characterization of total unimodularity.", "paper_title": "OPTIMAL HOMOLOGOUS CYCLES, TOTAL UNIMODULARITY, AND LINEAR PROGRAMMING", "paper_id": "WOS:000294296100003"}