{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "workflow_models"}, {"score": 0.04971075098097409, "phrase": "event_logs"}, {"score": 0.013804161200635167, "phrase": "complex_system"}, {"score": 0.013646628051868434, "phrase": "multiple_workflow_models"}, {"score": 0.01308403010571668, "phrase": "current_approaches"}, {"score": 0.004632597963417253, "phrase": "co-clustering_approach"}, {"score": 0.004304856672196293, "phrase": "existing_process_mining_approaches"}, {"score": 0.0039085400187964196, "phrase": "single_workflow_model"}, {"score": 0.0034405207528624983, "phrase": "important_context"}, {"score": 0.00317221667574882, "phrase": "user_behavior_pattern"}, {"score": 0.003087500254099842, "phrase": "usage_pattern"}, {"score": 0.003005039427642664, "phrase": "business_process_system"}, {"score": 0.002902236818129282, "phrase": "event_log"}, {"score": 0.0027706013216537042, "phrase": "probabilistic_distribution"}, {"score": 0.0025942468561537682, "phrase": "co-cluster_users"}, {"score": 0.0024479627964740748, "phrase": "similar_ubp"}, {"score": 0.002292097733181405, "phrase": "workflow_model"}, {"score": 0.0021796224306652326, "phrase": "comprehensive_experimental_study"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Co-Clustering", " Probabilistic Suffix Tree", " Process Mining", " User Behavior Pattern (UBP)", " Workflow Model Discovery"], "paper_abstract": "The authors propose a co-clustering approach to extract workflow models by analyzing event logs. The authors consider two major issues that are overlooked by most of the existing process mining approaches. First, a complex system typically runs multiple workflow models, all of which share the same log system. However, current approaches mainly focus on learning a single workflow model from event logs. Second, most systems support multi-users and each user is typically associated with (or use) certain number of operation sequences, which may follow one or more than one workflow models. Users can thus be leveraged as an important context when learning workflow models. However, this is not considered by current approaches. Therefore, the authors propose to learn User Behavior Pattern (UBP) that reflects the usage pattern of a user when accessing a business process system and exploit it to discover multiple workflow models from the event log of a complex system. The authors model a UBP as a probabilistic distribution on sequences, which allows computing the similarity between UBPs and sequences. The authors then co-cluster users and sequences to generate two types of clusters: user clusters that group users sharing similar UBP, and sequence clusters that group sequences that are the instances of the same workflow models. The workflow model can then be learned by analyzing its instances. The authors conducted a comprehensive experimental study to evaluate the effectiveness and efficiency of the proposed approach.", "paper_title": "Learning Workflow Models from Event Logs Using Co-clustering", "paper_id": "WOS:000330770600004"}