{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "unstable_context_inconsistency"}, {"score": 0.004774324145784758, "phrase": "context-aware_applications"}, {"score": 0.0043678116213858, "phrase": "dependable_applications"}, {"score": 0.004098725744818192, "phrase": "context_values"}, {"score": 0.003978866233891427, "phrase": "context_changes"}, {"score": 0.0034154440860550564, "phrase": "misaligned_sensor_sampling"}, {"score": 0.0033865859510157238, "phrase": "improper_inconsistency_detection_scheduling"}, {"score": 0.0031242709509664837, "phrase": "unnecessary_inconsistency"}, {"score": 0.002857849698346116, "phrase": "theoretical_analysis"}, {"score": 0.0023210293050850276, "phrase": "real-world_applications"}, {"score": 0.002215081186105616, "phrase": "numerous_stins"}, {"score": 0.002196342933346204, "phrase": "negligible_overhead"}, {"score": 0.0021319959284827896, "phrase": "stable_context_inconsistencies"}, {"score": 0.0021049977753042253, "phrase": "inconsistency_handling"}], "paper_keywords": ["Constraint", " context inconsistency", " impact propagation", " instability analysis", " pervasive computing"], "paper_abstract": "Context-aware applications adapt their behavior based on contexts. Contexts can, however, be incorrect. A popular means to build dependable applications is to augment them with a set of constraints to govern the consistency of context values. These constraints are evaluated upon context changes to detect inconsistencies so that they can be timely handled. However, we observe that many context inconsistencies are unstable. They vanish by themselves and do not require handling. Such inconsistencies are detected due to misaligned sensor sampling or improper inconsistency detection scheduling. We call them unstable context inconsistencies (or STINs). STINs should be avoided to prevent unnecessary inconsistency handling and unstable behavioral adaptation to applications. In this article, we study STINs systematically, from examples to theoretical analysis, and present algorithms to suppress their detection. Our key insight is that only certain patterns of context changes can make a consistency constraint subject to the detection of STINs. We derive such patterns and proactively use them to suppress the detection of STINs. We implemented our idea and applied it to real-world applications. Experimental results confirmed its effectiveness in suppressing the detection of numerous STINs with negligible overhead, while preserving the detection of stable context inconsistencies that require inconsistency handling.", "paper_title": "CINA: Suppressing the Detection of Unstable Context Inconsistency", "paper_id": "WOS:000361700500001"}