{"auto_keywords": [{"score": 0.04969278858326932, "phrase": "time_series"}, {"score": 0.015719716506582538, "phrase": "similarity_measurement"}, {"score": 0.0046993598473345395, "phrase": "large_time_series"}, {"score": 0.004642604455537883, "phrase": "similarity_searching"}, {"score": 0.004586531354697466, "phrase": "frequent_subroutine"}, {"score": 0.004512814529823301, "phrase": "similar_time_series"}, {"score": 0.0041784516085055035, "phrase": "searching_results"}, {"score": 0.00412796126884884, "phrase": "proposed_methods"}, {"score": 0.003916098498242888, "phrase": "time_points"}, {"score": 0.003133252930886608, "phrase": "multi-hierarchical_representation"}, {"score": 0.0027517535946117275, "phrase": "mhr"}, {"score": 0.0026316112429083235, "phrase": "original_one"}, {"score": 0.002568299907890696, "phrase": "multi-hierarchical_subseries"}, {"score": 0.0023680327896318915, "phrase": "measuring_result"}, {"score": 0.002320449502337321, "phrase": "synthetic_and_real_data_sets"}, {"score": 0.0022738201751000865, "phrase": "effectiveness_experiments"}, {"score": 0.0021307975800397816, "phrase": "real_data"}], "paper_keywords": [""], "paper_abstract": "In a large time series database, similarity searching is a frequent subroutine to find the similar time series of the given one. In the process, the performance of similarity measurement directly effects the usability of the searching results. The proposed methods mostly use the sum of the distances between the values on the time points, e.g. Euclidean Distance, dynamic time warping (DTW) etc. However, in measuring, they do not consider the hierarchy of each point in time series according to importance. This causes that they cannot accurately and efficiently measure similarity of time series. In the paper, we propose a Multi-Hierarchical Representation (MHR) to replace the original one based on the opinion that the points of one time series should be compared with the ones of another with the same importance in measuring. MHR gives the hierarchies of the points, and then the original one can be represented by the Multi-Hierarchical subseries, which consist of points in the same hierarchy. The distance between the representations can be computed as the measuring result. Finally, the synthetic and real data sets were used in the effectiveness experiments comparing ours with other major methods. And the comparison of their efficiencies was also performed on the real data set. All the results showed the superiority of ours in terms of effectiveness and efficiency.", "paper_title": "A multi-hierarchical representation for similarity measurement of time series", "paper_id": "WOS:000237249600088"}