{"auto_keywords": [{"score": 0.003916098498242888, "phrase": "input_dataset"}, {"score": 0.0037617986040878342, "phrase": "original_dataset"}, {"score": 0.0034512514926836667, "phrase": "data_points"}, {"score": 0.003166259444961177, "phrase": "image_segmentation_techniques"}, {"score": 0.0029722900280316216, "phrase": "resulting_clusters"}, {"score": 0.0027741761880779535, "phrase": "proposed_framework"}, {"score": 0.0026041635822373265, "phrase": "updated_records"}, {"score": 0.002402731767209114, "phrase": "streaming_data"}, {"score": 0.002375253757224999, "phrase": "experimental_results"}, {"score": 0.0022296340517805125, "phrase": "data_distributions"}], "paper_keywords": ["clustering framework", " image processing", " fuzzy set", " hierarchical clustering", " dynamic clustering"], "paper_abstract": "Most existing clustering approaches not only require several scans of a dataset but also have a very high computational cost. In this paper, we propose a novel, efficient, and effective clustering framework which requires only one scan of the input dataset. In the beginning, the original dataset is transformed and merged into a hyper-image. After that, the dissimilarities between data points arc measured, once and for all, by using various image-processing methodologies. Then, image segmentation techniques are applied to extract clusters from the hyper-image. The resulting clusters can be further processed to achieve fuzzy and/or hierarchical clustering effects. Moreover, the proposed framework can cluster incrementally and even dynamically with only one scan of the updated records. With this capability, it can also be used to effectively cluster streaming data. Experimental results show that our approach is robust and stable under various parameter settings and data distributions, and it is more powerful and sophisticated than other methodologies.", "paper_title": "HIC: A Robust and Efficient Hyper-Image-Based Clustering for Very Large Datasets", "paper_id": "WOS:000276057900009"}