{"auto_keywords": [{"score": 0.04967710401179305, "phrase": "small_animal"}, {"score": 0.017179745190017838, "phrase": "implantable_capsule"}, {"score": 0.016942988352028156, "phrase": "wireless_energy_transmission_system"}, {"score": 0.01012005037821042, "phrase": "blood_pressure"}, {"score": 0.00978619740481066, "phrase": "physiological_and_psychological_conditions"}, {"score": 0.009049025541516896, "phrase": "long_term"}, {"score": 0.008250588598006698, "phrase": "implantable_radio-telemetry_system"}, {"score": 0.007757522074630727, "phrase": "data_logger"}, {"score": 0.005876860679014119, "phrase": "sd_card"}, {"score": 0.00481495049065317, "phrase": "multiple_bio-parameters"}, {"score": 0.004734448316824488, "phrase": "wireless_energy_transmission"}, {"score": 0.004551781491498328, "phrase": "core_body_temperature"}, {"score": 0.0036966717141736355, "phrase": "long_term_blood_pressure"}, {"score": 0.0033879057307626328, "phrase": "pressure_sensor"}, {"score": 0.003175556211659149, "phrase": "third_sensor"}, {"score": 0.003113601003720005, "phrase": "analog_outputs"}, {"score": 0.0029020077365708966, "phrase": "digital_converter"}, {"score": 0.002853396755102163, "phrase": "digital_data"}, {"score": 0.0027977092483619896, "phrase": "animal's_body"}, {"score": 0.0027741761880779535, "phrase": "wireless_communication_chip"}, {"score": 0.0026820015810254004, "phrase": "time_stamps"}, {"score": 0.0024097920845706795, "phrase": "animal's_normal_conditions"}, {"score": 0.0023166075278110237, "phrase": "arbitrary_position"}, {"score": 0.0022713722522505592, "phrase": "vivo_experiment_results"}, {"score": 0.0021408862709571615, "phrase": "expected_requirements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Implantable radio-telemetry system", " Wireless energy transmission system", " Blood pressure", " Temperature", " Biopotential"], "paper_abstract": "Background and problem: The bio-parameters such as the blood pressure, the core body temperature and the biopotential are very important clinical clues to evaluate the physiological and psychological conditions of an animal. And these bio-parameters are also important for other clinical application. However, it is difficult to get the bio-parameters of a small animal for the long term under its normal state. It is a challenge for researchers to propose a method to acquire the bio-parameters of a small animal for the long term under its normal state. Method: This paper proposes an implantable radio-telemetry system to simultaneously detect long term blood pressure, temperature and biopotential of a small animal under its normal state. This system comprises an implantable capsule, a data logger and wireless energy transmission system. Three sensors are integrated into the implantable capsule. A pressure sensor is designed to detect the blood pressure, a temperature sensor to detect the inside body temperature, two tiny soft silver wires as the third sensor to detect the biopotential. The analog outputs of the three sensors are conditioned by their respective amplifiers. The three amplified bio-parameters are digitalized by an AD7683 (a 16-bit, charge redistribution, successive approximation, PulSAR analog-to-digital converter). Microprocessor PIC16F690 reads the digital data and sends it out of the animal's body through a wireless communication chip. A data logger can receive the data and save it with time stamps into a SD card. The data in the SD card can be processed with a computer. Curves of three bio-parameters can be used for evaluating physiological and psychological conditions of the animal. Wireless energy transmission system provides energy to the implantable capsule under the animal's normal conditions. A 3D secondary coil of the wireless energy transmission system enables itself to receive enough energy in an arbitrary position and posture. Results: In vivo experiment results show that the implantable radio-telemetry system can detect the blood, the temperature and biopotential of a rabbit. It meets the expected requirements. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An implantable radio-telemetry system for detecting multiple bio-parameters of a small animal based on wireless energy transmission", "paper_id": "WOS:000357223500003"}