{"auto_keywords": [{"score": 0.04186018237198311, "phrase": "distribution_centers"}, {"score": 0.00481495049065317, "phrase": "facility_location-allocation_problem"}, {"score": 0.004610058444728656, "phrase": "logistics_system"}, {"score": 0.004244375827831527, "phrase": "whole_logistics_system"}, {"score": 0.0041170581247889654, "phrase": "logistics_network"}, {"score": 0.003907586297783078, "phrase": "best_strategy"}, {"score": 0.0030754582519753474, "phrase": "hybrid_variable"}, {"score": 0.0030223381739019894, "phrase": "mixed-integer_programming_model"}, {"score": 0.002996122158460243, "phrase": "random_fuzzy_facility_location-allocation_problem"}, {"score": 0.002918826667294298, "phrase": "chance_constraint_programming_technique"}, {"score": 0.002818850283787242, "phrase": "deterministic_model"}, {"score": 0.0027581067089091434, "phrase": "priority-based_genetic_algorithm"}, {"score": 0.002686935113435742, "phrase": "proposed_programming_model"}, {"score": 0.0025059724686541263, "phrase": "numerical_example"}, {"score": 0.0023886641270884973, "phrase": "fla_problems"}, {"score": 0.002132711053003407, "phrase": "appropriate_tools"}], "paper_keywords": ["Random fuzzy", " Hybrid variable", " Location-allocation problem", " Genetic algorithms"], "paper_abstract": "In logistics system, facility location-allocation problem, which can be used to determine the mode, the structure and the form of the whole logistics system, is a very important decision problem in the logistics network. It involves locating plants and distribution centers, and determining the best strategy for allocation the product from the plants to the distribution centers and from the distribution centers to the customers. Often uncertainty may be associated with demand, supply or various relevant costs. In many cases, randomness and fuzziness simultaneously appear in a system, in order to describe this phenomenon; we introduce the concept of hybrid variable and propose a mixed-integer programming model for random fuzzy facility location-allocation problem. By expected value and chance constraint programming technique, this model is reduced to a deterministic model. Furthermore, a priority-based genetic algorithm is designed for solving the proposed programming model and the efficacy and the efficiency of this method and algorithm are demonstrated by a numerical example. Till now, few has formulated or attacked the FLA problems in the above manner. Furthermore, the techniques illustrated in this paper can easily be applied to other SCN problems. Therefore, these techniques are the appropriate tools to tackle other supply chain network problems in realistic environments.", "paper_title": "A study on facility location-allocation problem in mixed environment of randomness and fuzziness", "paper_id": "WOS:000290574400006"}