{"auto_keywords": [{"score": 0.049435104149514096, "phrase": "static_obstacles"}, {"score": 0.030879127828332683, "phrase": "potential_field_method"}, {"score": 0.00481495049065317, "phrase": "real_wheeled_robot"}, {"score": 0.0043793594257092805, "phrase": "present_study"}, {"score": 0.0037898820206470085, "phrase": "soft_computing-based_navigation_schemes"}, {"score": 0.003638823482920949, "phrase": "optimal_motion_planner"}, {"score": 0.003557509959237602, "phrase": "real_robot"}, {"score": 0.0035095935622207956, "phrase": "ccd_camera"}, {"score": 0.003309278541665552, "phrase": "collected_data"}, {"score": 0.0031773149810690494, "phrase": "host_computer"}, {"score": 0.0030644247579222333, "phrase": "radio-frequency_module"}, {"score": 0.0028505007899807446, "phrase": "traveling_time"}, {"score": 0.002712131567923321, "phrase": "fuzzy_logic-based_motion_planner"}, {"score": 0.002603918128553617, "phrase": "neural_network-based_motion_planner"}, {"score": 0.0023044434462692483, "phrase": "feasible_solution"}, {"score": 0.0021337783230121286, "phrase": "soft_computing-based_approaches"}], "paper_keywords": ["car-like robot", " navigation", " real experiment", " fuzzy logic", " neural network", " genetic algorithm", " potential field method"], "paper_abstract": "Collision-free, time-optimal navigation of a real wheeled robot in the presence of some static obstacles is undertaken in the present study. Two soft computing-based approaches, namely genetic-fuzzy system and genetic-neural system and a conventional potential field approach have been developed for this purpose. Training is given to the soft computing-based navigation schemes off-line and the performance of the optimal motion planner is tested on a real robot. A CCD camera is used to collect information of the environment. After processing the collected data, the communication between the robot and the host computer is obtained with the help of a radio-frequency module. Both the soft computing-based approaches are found to perform better than the potential field method in terms of the traveling time taken by the robot. Moreover, the performance of fuzzy logic-based motion planner is found to be comparable with that of neural network-based motion planner, although the training of the former is seen to be computationally less expensive than the latter. Sometimes the potential field method is unable to yield any feasible solution, specifically when the obstacle is found to be just ahead of the robot, whereas soft computing-based approaches have tackled such a situation well.", "paper_title": "Soft computing-based navigation schemes for a real wheeled robot moving among static obstacles", "paper_id": "WOS:000252541000005"}