{"auto_keywords": [{"score": 0.027507999683207576, "phrase": "dc_firms"}, {"score": 0.00481495049065317, "phrase": "delphi-bayesian"}, {"score": 0.00475413908468027, "phrase": "business_data_integrity_policy_a_benchmark_data_center_case_study"}, {"score": 0.00454725669814484, "phrase": "major_disasters"}, {"score": 0.004280750808007532, "phrase": "data_centers"}, {"score": 0.004159997145421619, "phrase": "critical_business_data_operations"}, {"score": 0.004017006809411963, "phrase": "dual-sided_business_data_integrity_policy_framework"}, {"score": 0.003891268447737902, "phrase": "available_literature"}, {"score": 0.0038665952212144214, "phrase": "case_studies"}, {"score": 0.003769450990471342, "phrase": "top_ceos"}, {"score": 0.0036747384051186937, "phrase": "fuzzy_delphi_method"}, {"score": 0.003559675269411366, "phrase": "risk_evaluation_rule"}, {"score": 0.003503497128638099, "phrase": "bayesian_decision_analysis"}, {"score": 0.0033615344963450343, "phrase": "delphi_method"}, {"score": 0.003194686937263323, "phrase": "taiwan"}, {"score": 0.003144222265269426, "phrase": "proposed_framework"}, {"score": 0.0030847461428168614, "phrase": "critical_service_advantages"}, {"score": 0.002556459595882617, "phrase": "robust_facilities"}, {"score": 0.0025160740422447837, "phrase": "five_operation_elements"}, {"score": 0.0023309080951251335, "phrase": "hybrid_delphi-bayesian_method"}, {"score": 0.0023013968622710847, "phrase": "new_framework"}, {"score": 0.002215081186105616, "phrase": "business_decision_makers"}, {"score": 0.0022010126160835024, "phrase": "higher_professionalism"}, {"score": 0.0021870332034407817, "phrase": "content_validity"}, {"score": 0.0021049977753042253, "phrase": "service_quality"}], "paper_keywords": ["Cybernetics", " Risk management", " Fuzzy logic", " Delphi method", " Decision making", " Data security"], "paper_abstract": "Purpose - Over the past decade, many small- and medium-sized enterprises have incurred dramatic losses due to major disasters, causing loss of their business information systems and transaction data, so, they have started to outsource their information operations to data centers (DCs), in order to monitor critical business data operations. The purpose of this paper is to propose a dual-sided business data integrity policy framework. Design/methodology/approach - Based on a review of the available literature, case studies, and in-depth interviews with top CEOs and experts in the field, a fuzzy Delphi method is proposed in two frameworks. In addition, a risk evaluation rule is derived by applying Bayesian decision analysis to mitigate the risk and lower the cost in their outsourcing policy; and Delphi method is used to extract 11 DC service quality evaluation indicators and also use these indicators to conduct a benchmark in Taiwan. Furthermore, the proposed framework is applied to figure out critical service advantages as well as suggestions for the DC involved in the benchmark. Findings - The results of framework point out that enterprises should monitor the four operation elements (facility and infrastructure, server system management, information security management, and disaster recovery (DR) mechanism) to ensure and improve their data integrity; and DC firms need to build robust facilities and services in the five operation elements (customizability, serviceability, information technology infrastructure, security management, and knowledge intensity). Originality/value - This paper uses a hybrid Delphi-Bayesian method to propose a new framework, which is adequately integrated with the consensus of experts and business decision makers; higher professionalism and content validity are achieved. Enterprises can use these indicators to evaluate the service quality of DCs among DC firms.", "paper_title": "A hybrid Delphi-Bayesian method to establish business data integrity policy A benchmark data center case study", "paper_id": "WOS:000280669700010"}