{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "source_software_projects"}, {"score": 0.041556321142828326, "phrase": "empirical_evidence"}, {"score": 0.004766536335036112, "phrase": "numerous_open_source_software_projects"}, {"score": 0.0046593686062545185, "phrase": "continuous_influx"}, {"score": 0.004363058588000252, "phrase": "single_contribution"}, {"score": 0.0042865396174255966, "phrase": "project_member"}, {"score": 0.004003707862291159, "phrase": "systematic_literature_review"}, {"score": 0.003758430609434303, "phrase": "twenty_studies"}, {"score": 0.0036738448109068025, "phrase": "backward_snowballing_approach"}, {"score": 0.0035640069880288243, "phrase": "selected_papers"}, {"score": 0.003537062684306625, "phrase": "potential_studies"}, {"score": 0.0034749794034364197, "phrase": "coding_approach"}, {"score": 0.003448705829033573, "phrase": "open_coding"}, {"score": 0.003431300185872735, "phrase": "axial_coding_procedures"}, {"score": 0.003413982088174383, "phrase": "grounded_theory"}, {"score": 0.0033455764382772754, "phrase": "selected_studies"}, {"score": 0.0032209766681045365, "phrase": "oss_projects"}, {"score": 0.0030775481952377017, "phrase": "five_categories"}, {"score": 0.0029330542146690087, "phrase": "technical_hurdles"}, {"score": 0.0027323553805486496, "phrase": "oss_practitioners"}, {"score": 0.0026372024005284892, "phrase": "technical_and_non-technical_barriers"}, {"score": 0.0026172464423564515, "phrase": "newcomers'_first_contributions"}, {"score": 0.00245669781073535, "phrase": "high_focus"}, {"score": 0.0024319378563138223, "phrase": "mailing_lists"}, {"score": 0.0023412849215629986, "phrase": "in-depth_studies"}, {"score": 0.0023001417397839714, "phrase": "code_issues"}, {"score": 0.002225637256299616, "phrase": "historical_data"}, {"score": 0.002208788753080851, "phrase": "software_repositories"}, {"score": 0.002153540857619362, "phrase": "qualitative_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Open source software", " Newcomers", " Joining", " Barriers to entry", " Onboarding", " Systematic literature review"], "paper_abstract": "Context: Numerous open source software projects are based on volunteers collaboration and require a continuous influx of newcomers for their continuity. Newcomers face barriers that can lead them to give up. These barriers hinder both developers willing to make a single contribution and those willing to become a project member. Objective: This study aims to identify and classify the barriers that newcomers face when contributing to open source software projects. Method: We conducted a systematic literature review of papers reporting empirical evidence regarding the barriers that newcomers face when contributing to open source software (OSS) projects. We retrieved 291 studies by querying 4 digital libraries. Twenty studies were identified as primary. We performed a backward snowballing approach, and searched for other papers published by the authors of the selected papers to identify potential studies. Then, we used a coding approach inspired by open coding and axial coding procedures from Grounded Theory to categorize the barriers reported by the selected studies. Results: We identified 20 studies providing empirical evidence of barriers faced by newcomers to OSS projects while making a contribution. From the analysis, we identified 15 different barriers, which we grouped into five categories: social interaction, newcomers' previous knowledge, finding a way to start, documentation, and technical hurdles. We also classified the problems with regard to their origin: newcomers, community, or product. Conclusion: The results are useful to researchers and OSS practitioners willing to investigate or to implement tools to support newcomers. We mapped technical and non-technical barriers that hinder newcomers' first contributions. The most evidenced barriers are related to socialization, appearing in 75% (15 out of 20) of the studies analyzed, with a high focus on interactions in mailing lists (receiving answers and socialization with other members). There is a lack of in-depth studies on technical issues, such as code issues. We also noticed that the majority of the studies relied on historical data gathered from software repositories and that there was a lack of experiments and qualitative studies in this area. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A systematic literature review on the barriers faced by newcomers to open source software projects", "paper_id": "WOS:000349427200005"}