{"auto_keywords": [{"score": 0.04093796918366915, "phrase": "ann_model"}, {"score": 0.015719716506582538, "phrase": "soil_electrical_resistivity"}, {"score": 0.012631617325730524, "phrase": "electrical_resistivity"}, {"score": 0.004729977262447766, "phrase": "basic_parameter"}, {"score": 0.004613516457919661, "phrase": "soil_status"}, {"score": 0.004145882022189891, "phrase": "artificial_neural_networks"}, {"score": 0.004015025120733852, "phrase": "complex_relationships"}, {"score": 0.003986509098918949, "phrase": "multidimensional_data"}, {"score": 0.0038332390893263844, "phrase": "fine_grained_soil"}, {"score": 0.0036727235025069828, "phrase": "resistivity_cone_penetration_testing"}, {"score": 0.0035822005511799036, "phrase": "basic_parameters"}, {"score": 0.003544088803300751, "phrase": "water_content"}, {"score": 0.003481465013724763, "phrase": "soil_porosity_ratio"}, {"score": 0.0033119237381809617, "phrase": "undisturbed_soil_samples"}, {"score": 0.003265012781840765, "phrase": "different_laboratory_tests"}, {"score": 0.0028715299874549245, "phrase": "performance_criteria"}, {"score": 0.0027413748388534025, "phrase": "square_error"}, {"score": 0.0024984517279573906, "phrase": "training_data_sets"}, {"score": 0.002480680078868508, "phrase": "validation_data_sets"}, {"score": 0.0024630345285372958, "phrase": "testing_data_sets"}, {"score": 0.00223672097810462, "phrase": "verification_data"}], "paper_keywords": ["Artificial neural networks", " resistivity cone penetration test", " electrical resistivity", " basic parameters"], "paper_abstract": "Soil electrical resistivity is a basic parameter that can be used to predict soil status. It is always obtained in situ, little literatures discusses about how to predict the resistivity by two or more basic parameters, as the relationships between resistivity and other parameters are complex. Artificial neural networks (ANN) are very useful in learning complex relationships between multidimensional data, so this study developed ANN model to predict electrical resistivity of fine grained soil by using three basic parameters. Soil electrical resistivity (rho) were obtained by resistivity cone penetration testing (RCPTU) in situ, basic parameters such as water content (omega), soil porosity ratio (e), degree of saturation (S-r) of undisturbed soil samples were obtained by different laboratory tests. ANN model was developed with three input data, that is omega, e and (S-r), only one output data, that is rho. Results obtained from ANN model were compared with the results measured in situ. Performance criteria such as the coefficient of determination (R-2), root mean square error (RMSE), and variance (VAF) were used to evaluate the performance of the model developed in this study. R-2 of training data sets, validation data sets and testing data sets are 0.971, 0.957, 0.978, respectively. Furthermore, data set from literature has been used to testify the ANN model, R-2 of the verification data is 0.999. It has been depicted that the ANN model is useful in predicting electrical resistivity by three parameters, and can be employed to determine electrical resistivity of soil quite efficiently.", "paper_title": "Artificial neural network model for predicting soil electrical resistivity", "paper_id": "WOS:000365138800003"}