{"auto_keywords": [{"score": 0.03224383874903183, "phrase": "p-gp_substrates"}, {"score": 0.02902586596767585, "phrase": "p-gp_substrate_specificity"}, {"score": 0.02855927470714215, "phrase": "data_set"}, {"score": 0.025908988665146106, "phrase": "modified_ps_algorithm"}, {"score": 0.00481495049065317, "phrase": "p-glycoprotein_substrates"}, {"score": 0.004755353864362941, "phrase": "support_vector_machine"}, {"score": 0.004677032188041644, "phrase": "particle_swarm"}, {"score": 0.004146327465630697, "phrase": "cancer_and_influence_pharmacokinetic_properties"}, {"score": 0.00402748353567517, "phrase": "great_deal"}, {"score": 0.003706299561774348, "phrase": "clear_understanding"}, {"score": 0.003615016816532732, "phrase": "three-dimensional_structure"}, {"score": 0.0035113478590679133, "phrase": "drug_efflux_pump"}, {"score": 0.0034678302347682694, "phrase": "molecular_level"}, {"score": 0.0033266163944946185, "phrase": "p-gp_substrate"}, {"score": 0.0032717489668326275, "phrase": "computational_methods"}, {"score": 0.0032044314332538154, "phrase": "cancer_treatment"}, {"score": 0.0031647054743284947, "phrase": "drug_discovery_processes"}, {"score": 0.003010651173285521, "phrase": "average_accuracy"}, {"score": 0.0028760125558659907, "phrase": "higher_accuracies"}, {"score": 0.0027934768366077397, "phrase": "previous_studies"}, {"score": 0.0026247185383834436, "phrase": "ps"}, {"score": 0.002249961956629804, "phrase": "feature_selection"}, {"score": 0.0022036216160494925, "phrase": "qsar_model"}, {"score": 0.0021492686054379755, "phrase": "multiple_linear"}, {"score": 0.0021049977753042253, "phrase": "svm_approach"}], "paper_keywords": [""], "paper_abstract": "P-Glycoprotein (P-gp) contributes to extruding a structurally, chemically, and pharmacologically diverse range of substrates out of cells. This function may result in the failure of chemotherapy in cancer and influence pharmacokinetic properties of many drugs. Although a great deal of research has been devoted to the investigation of P-gp and its substrate specificity, still we do not have a clear understanding of the resolution of the three-dimensional structure of P-gp and its working role as a drug efflux pump at a molecular level. Hence to identify whether a compound is a P-gp substrate or not, computational methods are promising both in cancer treatment and the drug discovery processes. We have established more effective models for prediction of P-gp substrates with an average accuracy of > 90% using a Particle Swarm (PS) algorithm and a Support Vector Machine (SVM) approach. The applied models yielded higher accuracies and contained fewer variables in comparison with previous studies. An analysis of P-gp substrate specificity based on the data set is also presented by a PS and a SVM. The aim of this study is 3-fold: (i) presentation of a modified PS algorithm that is applicable for selection of molecular descriptors in quantitative structure-activity relationship (QSAR) model construction, (ii) application of this modified PS algorithm as a wrapper to undertake feature selection in construction of a QSAR model to predict P-gp substrates with a multiple linear (ML) and SVM approach, and (iii) also finding factors (molecular descriptors) that most likely are associated with P-gp substrate specificity by using a PS and a SVM from the data set.", "paper_title": "Identifying P-glycoprotein substrates using a support vector machine optimized by a particle swarm", "paper_id": "WOS:000248192200036"}