{"auto_keywords": [{"score": 0.03750628528480423, "phrase": "increasing_trees"}, {"score": 0.03210196695888402, "phrase": "polynomial_families"}, {"score": 0.00481495049065317, "phrase": "f_trees"}, {"score": 0.003592258384936271, "phrase": "simple_families"}, {"score": 0.0034647524666821614, "phrase": "recursive_trees"}, {"score": 0.0029034358982402346, "phrase": "random_variable"}, {"score": 0.002733598121537801, "phrase": "random_trees"}, {"score": 0.002553063001454623, "phrase": "limiting_distribution"}, {"score": 0.002534507337459453, "phrase": "gaussian"}, {"score": 0.0023182554418193927, "phrase": "additional_results"}, {"score": 0.002191366809047192, "phrase": "hwang's_quasi_power_theorem"}, {"score": 0.0021391300942881, "phrase": "earlier_results"}, {"score": 0.0021219995627541123, "phrase": "devroye"}, {"score": 0.002104998715788785, "phrase": "mahmoud"}], "paper_keywords": ["increasing trees", " node level", " limiting distribution"], "paper_abstract": "Simply, generated families ( f trees are described by the equation T(z) = phi(T(z)) for their generating function. If a tree has n nodes, we say that it is increasing if each node has a label is an element of {1,..., n}, no label occurs twice, and whenever we proceed from the root to a leaf, the labels are increasing. This leads to the concept of simple families of increasing trees. Three such families are especially important: recursive trees, heap ordered trees, and binaty increasing trees. They belong to the subclass of very simple families of increasing trees, which can be characterized in 3 different ways. This paper contains results about these families as well as about polynomial families (the function phi(u) is just a polynomial). The random variable of interest is the level of the node (labelled) j, in random trees of size n >= j. For very simple families, this is independent of n, and the limiting distribution is Gaussian. For polynomial families, we can prove this as well for j, n ->infinity such that n-j is fixed. Additional results are also given. These results follow from the study of certain trivariate generating functions and Hwang's quasi power theorem. They unify and extend earlier results by Devroye, Mahmoud, and others.", "paper_title": "Level of nodes in increasing trees revisited", "paper_id": "WOS:000248816600005"}