{"auto_keywords": [{"score": 0.03583574966327729, "phrase": "information_architecture"}, {"score": 0.007408432974607224, "phrase": "technological_solution"}, {"score": 0.006763343349900662, "phrase": "gpm_framework"}, {"score": 0.00481495049065317, "phrase": "performance_management_framework"}, {"score": 0.00457013354092966, "phrase": "performance_management"}, {"score": 0.004530552828603269, "phrase": "collaborative_environments"}, {"score": 0.0044524122425287005, "phrase": "wide_variety"}, {"score": 0.00420760449108585, "phrase": "common_gap"}, {"score": 0.004153041453795458, "phrase": "information_treatment"}, {"score": 0.003856898743576605, "phrase": "small_and_medium-sized_enterprises"}, {"score": 0.0035662378173267647, "phrase": "global_performance_management"}, {"score": 0.0027822459052173113, "phrase": "used_information"}, {"score": 0.002675252546913683, "phrase": "real_model"}, {"score": 0.0025500402081330394, "phrase": "engineering_and_conceptual_environment"}, {"score": 0.0025059724686541263, "phrase": "real-world_operational_and_executable_environment"}, {"score": 0.0023168823213024856, "phrase": "satisfactory_results"}, {"score": 0.0021987994275190314, "phrase": "main_barriers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Performance management", " Information architecture", " Performance measurement system", " Pilot case"], "paper_abstract": "Recently, much attention has been given to performance management within collaborative environments resulting in a wide variety of performance measurement/management frameworks. However, practically all of these frameworks present a common gap regarding the information treatment needs that support these frameworks. This issue is even more important in the case of Small and Medium-sized Enterprises (SMEs) due to their special characteristics. For that purpose, this paper presents an approach called Global Performance Management (GPM) Framework composed of a methodology, an information architecture and a technological solution, focusing mainly on the information architecture. The methodology guides SMEs when defining, developing, deploying and operating the GPM framework. The information architecture consists of a set of elements that support the tasks of collection, treatment and analysis of the used information, which complement the methodology to build a real model for the GPM framework. Finally, the technological solution bridges the engineering and conceptual environment, with the real-world operational and executable environment, following the path defined by the methodology. The information architecture was applied to two European pilots, achieving satisfactory results, which are highlighted in the paper as well as the main barriers encountered and solutions provided. (c) 2010 Elsevier B.V. All rights reserved.", "paper_title": "An information architecture for a performance management framework by collaborating SMEs", "paper_id": "WOS:000280907900007"}