{"auto_keywords": [{"score": 0.02880781948027875, "phrase": "dishonest_selling_agents"}, {"score": 0.00481495049065317, "phrase": "direct_experience_trust_modelling"}, {"score": 0.004337028108577593, "phrase": "electronic_marketplace"}, {"score": 0.004294052530714228, "phrase": "multiple_selling_agents"}, {"score": 0.0041469500929423595, "phrase": "different_qualities"}, {"score": 0.004105850229681625, "phrase": "selling_agents"}, {"score": 0.003829290275367182, "phrase": "dishonest_sellers"}, {"score": 0.0035891316580885665, "phrase": "high_quality"}, {"score": 0.003264872488939969, "phrase": "reinforcement_learning"}, {"score": 0.003044785536429499, "phrase": "high_value_goods"}, {"score": 0.0028822890425197582, "phrase": "theoretical_results"}, {"score": 0.0024327171018928458, "phrase": "infinite_loss"}, {"score": 0.002168975681697056, "phrase": "related_work"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Adaptive and learning agents", " Trust modelling", " Multi-agent scenarios", " Electronic commerce applications"], "paper_abstract": "In this paper, we describe a framework for modelling the trustworthiness of sellers in the context of an electronic marketplace where multiple selling agents may offer the same good with different qualities and selling agents may alter the quality of their goods. We consider that there may be dishonest sellers in the market (for example, agents who offer goods with high quality and later offer the same goods with very low quality). In our approach, buying agents use a combination of reinforcement learning and trust modelling to enhance their knowledge about selling agents and hence their opportunities to purchase high value goods in the marketplace. This paper focuses on presenting the theoretical results demonstrating how the modelling of trust can protect buying agents from dishonest selling agents. The results show that our proposed buying agents will not be harmed infinitely by dishonest selling agents and therefore will not incur infinite loss, if they are cautious in setting their penalty factor. We also discuss the value of our particular model for trust, in contrast with related work and conclude with directions for future research.", "paper_title": "Protecting buying agents in e-marketplaces by direct experience trust modelling", "paper_id": "WOS:000273811900003"}