{"auto_keywords": [{"score": 0.049447946898790056, "phrase": "information_systems"}, {"score": 0.04509655915119651, "phrase": "generic_applications"}, {"score": 0.021975614328788678, "phrase": "integrated_framework"}, {"score": 0.006028837168389019, "phrase": "development_phases"}, {"score": 0.00481495049065317, "phrase": "continuous_improvement"}, {"score": 0.004783105609960904, "phrase": "user_satisfaction"}, {"score": 0.004673290248999786, "phrase": "primary_purpose"}, {"score": 0.004520750567829338, "phrase": "user_interface_prototyping"}, {"score": 0.00397175830521626, "phrase": "selection_rules"}, {"score": 0.003945467978172845, "phrase": "relevant_methods"}, {"score": 0.003829290275367182, "phrase": "unified_modeling_language"}, {"score": 0.003500812175550438, "phrase": "information_system_development"}, {"score": 0.003477628306017313, "phrase": "usability_evaluation"}, {"score": 0.003386412845243943, "phrase": "evaluation_method"}, {"score": 0.003254041350487688, "phrase": "development_lifecycle"}, {"score": 0.0031164532805849432, "phrase": "time_study"}, {"score": 0.0030650927026564146, "phrase": "vender-provided_systems"}, {"score": 0.003004572722189157, "phrase": "user_base"}, {"score": 0.002701361707441567, "phrase": "future_works"}, {"score": 0.0026745503978347143, "phrase": "object-oriented_programming_framework"}, {"score": 0.002527556628744957, "phrase": "comprehensive_framework"}, {"score": 0.00234142781099973, "phrase": "formal_modeling"}, {"score": 0.0023259039577313294, "phrase": "user_interface_construction"}, {"score": 0.002249811525923913, "phrase": "candidate_systems"}], "paper_keywords": ["user studies", " information systems", " prototypes"], "paper_abstract": "Purpose - The primary purpose of this paper is to present an integrated framework for user interface prototyping and evaluation for the development of information systems and to present architecture for evaluating generic applications. Design/methodology/approach - The framework is constructed through combining two distinctive methods of prototyping and evaluation, statechart and goals, operators, methods, and selection rules. Relevant methods and architectures of the integrated framework are presented in unified modeling language when possible. Findings - The importance of the usability of information systems is highlighted in this research. However, it still lacks an integrated framework for information system development and usability evaluation. This paper provides a framework that evaluation method is intertwined with user interface prototyping to shorten the time of development lifecycle. The architecture for evaluating generic applications is also invaluable for motion and time study and the procurement of vender-provided systems. Research limitations/implications - The user base of information systems is diverse and the requirements of these systems change over time. This paper provides a framework that helps managers and engineers smooth and shorten the development phases. For future works, an object-oriented programming framework and a tool for evaluating generic applications will be developed. Originality/value - This paper proposes a comprehensive framework for combining prototyping and evaluation, as well as architecture for the evaluation of generic applications. It shortens the development phases by using formal modeling for user interface construction and evaluation. It also provides means to evaluate candidate systems whose program logics cannot be accessed and modified. It also complements the models used in the framework by extending their practical and academic values.", "paper_title": "An integrated framework for continuous improvement on user satisfaction of information systems", "paper_id": "WOS:000241397100016"}