{"auto_keywords": [{"score": 0.04522176534199055, "phrase": "tpmsvm"}, {"score": 0.016620628983706177, "phrase": "linear_equations"}, {"score": 0.010612387000973441, "phrase": "twin_parametric-margin_support_vector_machine"}, {"score": 0.009111721468496613, "phrase": "lstpmsvm"}, {"score": 0.0030595112110658675, "phrase": "extremely_simple_and_fast_algorithm"}, {"score": 0.0029789104204803137, "phrase": "nonlinear_kernel"}, {"score": 0.0029394074636168435, "phrase": "reduced_technique"}, {"score": 0.0026771333996253783, "phrase": "large_datasets"}, {"score": 0.00260657976055413, "phrase": "external_optimizers"}, {"score": 0.002421975107313603, "phrase": "parameter_selection"}, {"score": 0.0022057677637040396, "phrase": "comparable_classification_accuracy"}, {"score": 0.0021049977753042253, "phrase": "remarkably_less_computational_time"}], "paper_keywords": ["Pattern classification", " Support vector machines", " Twin support vector machines", " Least squares", " Particle swarm optimization"], "paper_abstract": "In this paper, we propose a novel least squares twin parametric-margin support vector machine (TPMSVM) for binary classification, called LSTPMSVM for short. LSTPMSVM attempts to solve two modified primal problems of TPMSVM, instead of two dual problems usually solved. The solution of the two modified primal problems reduces to solving just two systems of linear equations as opposed to solving two quadratic programming problems along with two systems of linear equations in TPMSVM, which leads to extremely simple and fast algorithm. Classification using nonlinear kernel with reduced technique also leads to systems of linear equations. Therefore our LSTPMSVM is able to solve large datasets accurately without any external optimizers. Further, a particle swarm optimization (PSO) algorithm is introduced to do the parameter selection. Our experiments on synthetic as well as on several benchmark data sets indicate that our LSTPMSVM has comparable classification accuracy to that of TPMSVM but with remarkably less computational time.", "paper_title": "Least squares twin parametric-margin support vector machine for classification", "paper_id": "WOS:000324107400001"}