{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "drug-induced_ototoxicity"}, {"score": 0.009395852826315115, "phrase": "drug_discovery"}, {"score": 0.007008275532089864, "phrase": "optimal_support_vector_machine"}, {"score": 0.005432849539832136, "phrase": "early_stage"}, {"score": 0.004483120978156604, "phrase": "toxic_side_effect"}, {"score": 0.004392565073466714, "phrase": "important_issue"}, {"score": 0.004174064076143015, "phrase": "current_experimental_methods"}, {"score": 0.0037498152007206815, "phrase": "large-scale_evaluation"}, {"score": 0.00342054627009158, "phrase": "effective_computational_prediction_model"}, {"score": 0.0032336801561165113, "phrase": "ga-cg-svm._three_ga-cg-svm_models"}, {"score": 0.0030569913145731408, "phrase": "different_risk_levels"}, {"score": 0.002676692093594358, "phrase": "ga-cg-svm_model"}, {"score": 0.002556359086441866, "phrase": "prediction_accuracies"}, {"score": 0.002392008392892289, "phrase": "good_performance"}, {"score": 0.00235560370536971, "phrase": "ga-cg-svm_model_ii"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Drug-induced ototoxicity", " Support vector machine", " Naive Bayesian", " Recursive partitioning", " Classification"], "paper_abstract": "Drug-induced ototoxicity, as a toxic side effect, is an important issue needed to be considered in drug discovery. Nevertheless, current experimental methods used to evaluate drug-induced ototoxicity are often time-consuming and expensive, indicating that they are not suitable for a large-scale evaluation of drug-induced ototoxicity in the early stage of drug discovery. We thus, in this investigation, established an effective computational prediction model of drug-induced ototoxicity using an optimal support vector machine (SVM) method, GA-CG-SVM. Three GA-CG-SVM models were developed based on three training sets containing agents bearing different risk levels of drug-induced ototoxicity. For comparison, models based on naive Bayesian (NB) and recursive partitioning (RP) methods were also used on the same training sets. Among all the prediction models, the GA-CG-SVM model II showed the best performance, which offered prediction accuracies of 85.33% and 83.05% for two independent test sets, respectively. Overall, the good performance of the GA-CG-SVM model II indicates that it could be used for the prediction of drug-induced ototoxicity in the early stage of drug discovery. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A prediction model of drug-induced ototoxicity developed by an optimal support vector machine (SVM) method", "paper_id": "WOS:000340018800013"}