{"auto_keywords": [{"score": 0.04476011617302401, "phrase": "sensory_characteristics"}, {"score": 0.0386284122510087, "phrase": "overall_acceptance"}, {"score": 0.00481495049065317, "phrase": "fuzzy_linear_regression_method"}, {"score": 0.0046937237797352515, "phrase": "fried_donut"}, {"score": 0.004646088032529303, "phrase": "sensory_evaluation"}, {"score": 0.00457553517865013, "phrase": "scientific_discipline"}, {"score": 0.004347972379250724, "phrase": "food_products"}, {"score": 0.0038271712887391015, "phrase": "fuzzy_linear_regression"}, {"score": 0.0033004240095380623, "phrase": "fried_donuts"}, {"score": 0.0031845067058084613, "phrase": "independent_variables"}, {"score": 0.003088384809415812, "phrase": "triangular_fuzzy_numbers"}, {"score": 0.0030615901798545482, "phrase": "coefficients"}, {"score": 0.002392008392892289, "phrase": "strongest_effect"}, {"score": 0.002284444272376043, "phrase": "crust_color"}, {"score": 0.002249672943553135, "phrase": "oiliness_reduced_desirability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fuzzy linear regression", " Sensory evaluation", " Linear programming", " Donut"], "paper_abstract": "Sensory evaluation is a scientific discipline that is widely used to determine the quality of food products. But sensory characteristics cannot be quantified exactly; hence, the relationships among variables are not clear. In this paper, a Fuzzy linear regression was proposed to model the relationship between overall acceptance and sensory characteristics (aroma, surface color, porosity, hardness, oiliness, and flavor) of 36 different types of fried donuts. Modeling was done assuming that independent variables are crisp and coefficients are triangular fuzzy numbers. Coefficients were estimated considering 864 limits due to 36 samples, 12 evaluators (432 instance) and 2 limits for each sample. Between different states of fuzzy numbers (symmetrical, constant asymmetrical, increasing asymmetrical and decreasing asymmetrical) symmetrical fuzzy coefficient provided the best fitting of sensory data. This function showed aroma did not have any effect on overall acceptance, on the contrary, flavor exerted the strongest effect on desirability of donuts, increasing brownness of crust color yet decreasing oiliness reduced desirability of donuts. More porous and softer texture led to more acceptable products. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Application of fuzzy linear regression method for sensory evaluation of fried donut", "paper_id": "WOS:000338706600034"}