{"auto_keywords": [{"score": 0.04954033184026155, "phrase": "pervasive_healthcare_applications"}, {"score": 0.04769951483161258, "phrase": "pervasive_healthcare"}, {"score": 0.045923793841804846, "phrase": "wireless_systems"}, {"score": 0.00481495049065317, "phrase": "rfid-embedded_objects"}, {"score": 0.004039995317682942, "phrase": "remote_locations"}, {"score": 0.0037320255482878365, "phrase": "radio_frequency_identification"}, {"score": 0.002859345731792013, "phrase": "tag_reader"}, {"score": 0.0025966158885803834, "phrase": "rfid"}, {"score": 0.002279011030331704, "phrase": "location_accuracy"}, {"score": 0.002253299769886694, "phrase": "rfid_tag_readers"}, {"score": 0.002190280748985751, "phrase": "appropriate_data_collection"}, {"score": 0.0021049977753042253, "phrase": "data_inference"}], "paper_keywords": ["RFID", " Pervasive healthcare", " Read rate", " False reads"], "paper_abstract": "The organization and delivery of pervasive healthcare have benefited much from advances in wireless systems. While wireless systems and their components have certainly enhanced the quality of pervasive healthcare administered in remote locations, their potential in other areas of healthcare cannot be underestimated. We consider Radio Frequency Identification (RFID) tags. which are increasingly being used in pervasive healthcare applications. Specifically, we study the dynamics of locating and identifying the presence of a tag in such systems. Although a tag may be present, it may not necessarily be visible to the tag reader due to various constraints or reasons. We propose and illustrate several algorithms for locating the presence of RFID tagged objects in the field of the reader and study their dynamics as well as their strengths and benefits. Our results indicate that the location accuracy of RFID tag readers can be improved through appropriate data collection as well as algorithms used for data inference. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Identifying RFID-embedded objects in pervasive healthcare applications", "paper_id": "WOS:000262760000013"}