{"auto_keywords": [{"score": 0.049648703742940926, "phrase": "soa"}, {"score": 0.023227048304568804, "phrase": "security_concepts"}, {"score": 0.009027831547100656, "phrase": "soa_functionality_layer"}, {"score": 0.0045404698551856125, "phrase": "recent_research_effort"}, {"score": 0.004281568920264999, "phrase": "fault_taxonomy"}, {"score": 0.0038070472635126276, "phrase": "generic_interactive_relationships"}, {"score": 0.003688497722149817, "phrase": "security_attributes"}, {"score": 0.003309278541665552, "phrase": "underlying_distributed_systems"}, {"score": 0.0030505976034245234, "phrase": "new_angle"}, {"score": 0.0030094882299407256, "phrase": "major_contribution"}, {"score": 0.0028764048059439205, "phrase": "feedback_control_system"}, {"score": 0.0028376361457661415, "phrase": "integration_vehicle"}, {"score": 0.0023571835517819124, "phrase": "novel_idea"}, {"score": 0.00233594452829104, "phrase": "basic_fault_building_blocks"}, {"score": 0.0022631003204259224, "phrase": "scalability_issue"}, {"score": 0.002232579371411546, "phrase": "layer_interactions"}, {"score": 0.002162951519368368, "phrase": "basic_building_blocks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Dependability", " Security", " Taxonomy", " SOA"], "paper_abstract": "Recent research effort has been made to integrate both dependability and security concepts for SOA using fault taxonomy. However most of such work is confined to the SOA functionality layer excluding the interactions with its underlying distributed systems. Also many elements of taxonomies proposed are loosely integrated without generic interactive relationships. This is especially true when security attributes are included. There is a lack of framework that can systematically and genuinely integrate dependability and security concepts for SOA and also include underlying distributed systems of SOA. This paper attempts to address this issue by providing a taxonomy and framework from a new angle. The major contribution of this paper is that we have introduced a feedback control system as an integration vehicle to integrate concepts and attributes of both dependability and security in SOA, so that they can be more generically integrated and more systematically constructed. Furthermore, the framework proposed in this paper covers the SOA functionality layer and its underlying distributed systems. A novel idea of basic fault building blocks has been proposed to address the scalability issue due to layer interactions. Various fault taxonomies are constructed from these basic building blocks. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Seamless integration of dependability and security concepts in SOA: A feedback control system based framework and taxonomy", "paper_id": "WOS:000291846700014"}