{"auto_keywords": [{"score": 0.037984575058489865, "phrase": "management_styles"}, {"score": 0.03363896917055258, "phrase": "team_members"}, {"score": 0.0322229253613515, "phrase": "project_managers"}, {"score": 0.00481495049065317, "phrase": "bureaucratic_and_collaborative_management_styles"}, {"score": 0.004657739551687038, "phrase": "information_systems"}, {"score": 0.00447251540886613, "phrase": "'control_ambidexterity"}, {"score": 0.004342430078306461, "phrase": "different_types"}, {"score": 0.004263046902817659, "phrase": "conflicting_demands"}, {"score": 0.004139028737420222, "phrase": "contrasting_styles"}, {"score": 0.0040334640350288, "phrase": "managerial_practice"}, {"score": 0.003858697684681798, "phrase": "theoretical_gap"}, {"score": 0.003774164192882704, "phrase": "exploratory_case_study"}, {"score": 0.0036914757355166966, "phrase": "financial_services_industry"}, {"score": 0.0035708152831417104, "phrase": "meta-theoretical_perspective"}, {"score": 0.002618104519194264, "phrase": "single_project"}, {"score": 0.0025137856138000014, "phrase": "illustrative_example"}, {"score": 0.0021363670305843403, "phrase": "important_implications"}, {"score": 0.0021049977753042253, "phrase": "control_ambidexterity"}], "paper_keywords": ["control ambidexterity", " IS project management", " tensions", " contrasting management styles", " tandem project management structure"], "paper_abstract": "Managing information systems (IS) projects requires what we refer to as 'control ambidexterity', which is the use of different types of control to meet conflicting demands. This leads to the use of contrasting styles of IS project management and creates tensions in managerial practice, neither of which are well understood. We address this theoretical gap in our understanding based on an exploratory case study of an IS implementation project in the financial services industry. Adopting the lens of management styles as a meta-theoretical perspective, we sought to address two research questions: (1) Which management style(s) do IS project managers draw upon in practice and why? (2) What kinds of tensions result for IS project managers and team members from drawing upon contrasting management styles in combination and how do IS project managers and team members deal with these tensions? Two contrasting styles of management emerged from our data bureaucratic and collaborative that are drawn upon by IS project managers to achieve control ambidexterity. Furthermore, drawing upon these two different styles in combination within the confines of a single project creates tensions. We explore these tensions and present an illustrative example of how IS project managers can deal with these tensions successfully in practice. Specifically, we find that they can be dealt with effectively by a tandem of two project managers who share responsibility for managing the IS project. The findings of this study have important implications for our understanding of control ambidexterity in IS projects.", "paper_title": "Blending bureaucratic and collaborative management styles to achieve control ambidexterity in IS projects", "paper_id": "WOS:000336477500007"}