{"auto_keywords": [{"score": 0.04978895903400396, "phrase": "lis_educational_texts"}, {"score": 0.047667240890459914, "phrase": "controversial_materials"}, {"score": 0.00481495049065317, "phrase": "sexual_discourse"}, {"score": 0.004490020801780961, "phrase": "sexual_nature"}, {"score": 0.004303023184313407, "phrase": "lis_literature"}, {"score": 0.0039280214778273925, "phrase": "collection_development"}, {"score": 0.00386876598761639, "phrase": "intellectual_freedom"}, {"score": 0.0035855828944304506, "phrase": "deeper_analysis"}, {"score": 0.003563841266960747, "phrase": "individual_definitions"}, {"score": 0.0034994014234054397, "phrase": "michel_foucault's_perspective"}, {"score": 0.0034361227353612456, "phrase": "well-trodden_battle_lines"}, {"score": 0.0033739844237277213, "phrase": "educational_system"}, {"score": 0.003343336516033681, "phrase": "political_means"}, {"score": 0.0031555744873774686, "phrase": "findings_-_findings"}, {"score": 0.0030424424705823455, "phrase": "sexual_topics"}, {"score": 0.0029422942175866057, "phrase": "different_types"}, {"score": 0.0029066973917258655, "phrase": "sexual_materials"}, {"score": 0.0027602786135844264, "phrase": "usa"}, {"score": 0.0027184540871935284, "phrase": "american_bias"}, {"score": 0.0026530590435527527, "phrase": "american_legal_terminology"}, {"score": 0.0026129863248033807, "phrase": "american_library_association_guidelines"}, {"score": 0.002597126785932809, "phrase": "examination_purposes"}, {"score": 0.0025578967205807843, "phrase": "american_terminology"}, {"score": 0.002481200970201421, "phrase": "north_america"}, {"score": 0.0023417427763424916, "phrase": "mainstream_popularity"}, {"score": 0.002124318196932935, "phrase": "greater_understanding"}, {"score": 0.0021049977753042253, "phrase": "discipline's_biases"}], "paper_keywords": ["Ethics", " Collection development", " Censorship"], "paper_abstract": "Purpose - This research seeks to discover the type of discourse encouraged around controversial materials, particularly those of a sexual nature, in LIS educational texts. Censorship and controversial materials are often issues addressed in the LIS literature, but even with ideals of neutrality it can be difficult to remain balanced on certain issues, particularly those dealing with sex. Design/methodology/approach - A content analysis of 85 US texts on collection development, reference, and intellectual freedom was completed using the following thematic elements: sex, pornography, erotica, curiosa, facetiae, obscenity, censorship, and controversial materials. Deeper analysis of individual definitions and usages was informed by Michel Foucault's perspective that education \"follows the well-trodden battle lines of social conflict. Every educational system is a political means of maintaining or of modifying the appropriation of discourse\" (Foucault, 1972, p. 227). Findings - Findings from the investigation indicate that US texts are predominately pejorative when discussing sexual topics such as erotica and pornography. Few texts provide distinctions between different types or genres of sexual materials. Research limitations/implications - The majority of texts analyzed for this study were published in the USA and hence have an American bias. This bias necessitated the use of American legal terminology and a reliance on American Library Association guidelines for examination purposes. The emphasis on American terminology may limit the applicability of the results outside of North America. Originality/value - Sex is one of the most highly cited reasons for challenges to materials in libraries. At the same time the mainstream popularity of the Fifty Shades of Grey trilogy has created a new, widespread interest in the publishing, reading, and collecting of erotica. An understanding of how these texts are defined and identified in the US literature provides greater understanding of the discipline's biases.", "paper_title": "Beyond obscenity: an analysis of sexual discourse in LIS educational texts", "paper_id": "WOS:000329769200005"}