{"auto_keywords": [{"score": 0.028265614718550273, "phrase": "potts"}, {"score": 0.015572514689996445, "phrase": "probabilistic_pairwise_markov_models"}, {"score": 0.014179225335653162, "phrase": "diagnostic_resolution"}, {"score": 0.009221254809575447, "phrase": "potential_functions"}, {"score": 0.008023557919170463, "phrase": "ppmm"}, {"score": 0.00481495049065317, "phrase": "prostate_cancer"}, {"score": 0.004792208732166814, "phrase": "histological_sections"}, {"score": 0.004680093492185585, "phrase": "high-throughput_system"}, {"score": 0.004516797236672313, "phrase": "radical_prostatectomies"}, {"score": 0.00440066313698287, "phrase": "markov_random_field"}, {"score": 0.004318073739627171, "phrase": "digitized_hs"}, {"score": 0.004197083915940331, "phrase": "gleason"}, {"score": 0.00401236106110633, "phrase": "cancerous_regions"}, {"score": 0.003909145893227657, "phrase": "detection_step"}, {"score": 0.0037459227957578225, "phrase": "cap_detection_system"}, {"score": 0.0037018003824739625, "phrase": "entire_digitized_whole-mount_hs"}, {"score": 0.0035894903821255698, "phrase": "desktop_computer"}, {"score": 0.0035472039917651774, "phrase": "cap_detection_sensitivity"}, {"score": 0.0033589915496757316, "phrase": "low_resolution"}, {"score": 0.0030768787520830377, "phrase": "individual_glands"}, {"score": 0.0030047730356199116, "phrase": "proximate_glands"}, {"score": 0.0029553038373267217, "phrase": "latter_feature"}, {"score": 0.002934352120961826, "phrase": "spatial_dependency"}, {"score": 0.002858788378807115, "phrase": "markov_priors"}, {"score": 0.0027719836045074606, "phrase": "mathematical_abstractions"}, {"score": 0.0027134326564541614, "phrase": "ad_hoc_procedure"}, {"score": 0.0026878074815686447, "phrase": "simplistic_models"}, {"score": 0.002569345532992206, "phrase": "probability_density_functions"}, {"score": 0.0023478184025779586, "phrase": "system_performance"}, {"score": 0.0022443073514354333, "phrase": "cap_sensitivity"}, {"score": 0.0022231026365146815, "phrase": "accompanying_false_positive_rates"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Markov random fields", " Prostate cancer detection", " Histology", " Digital pathology"], "paper_abstract": "In this paper we present a high-throughput system for detecting regions of carcinoma of the prostate (Cap) in HSs from radical prostatectomies (RPs) using probabilistic pairwise Markov models (PPMMs), a novel type of Markov random field (MRF). At diagnostic resolution a digitized HS can contain 80 K x 70 K pixels - far too many for current automated Gleason grading algorithms to process. However, grading can be separated into two distinct steps: (1) detecting cancerous regions and (2) then grading these regions. The detection step does not require diagnostic resolution and can be performed much more quickly. Thus, we introduce a CaP detection system capable of analyzing an entire digitized whole-mount HS (2 x 1.75 cm(2)) in under three minutes (on a desktop computer) while achieving a CaP detection sensitivity and specificity of 0.87 and 0.90, respectively. We obtain this high-throughput by tailoring the system to analyze the HSs at low resolution (8 mu m per pixel). This motivates the following algorithm: (Step 1) glands are segmented, (Step 2) the segmented glands are classified as malignant or benign, and (Step 3) the malignant glands are consolidated into continuous regions. The classification of individual glands leverages two features: gland size and the tendency for proximate glands to share the same class. The latter feature describes a spatial dependency which we model using a Markov prior. Typically, Markov priors are expressed as the product of potential functions. Unfortunately, potential functions are mathematical abstractions, and constructing priors through their selection becomes an ad hoc procedure, resulting in simplistic models such as the Potts. Addressing this problem, we introduce PPMMs which formulate priors in terms of probability density functions, allowing the creation of more sophisticated models. To demonstrate the efficacy of our CaP detection system and assess the advantages of using a PPMM prior instead of the Potts, we alternately incorporate both priors into our algorithm and rigorously evaluate system performance, extracting statistics from over 6000 simulations run across 40 RP specimens. Perhaps the most indicative result is as follows: at a CaP sensitivity of 0.87 the accompanying false positive rates of the system when alternately employing the PPMM and Potts priors are 0.10 and 0.20, respectively. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "High-throughput detection of prostate cancer in histological sections using probabilistic pairwise Markov models", "paper_id": "WOS:000279759800011"}