{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "distributionally_robust_perspective"}, {"score": 0.004050116768809519, "phrase": "multiple_safety_conditions"}, {"score": 0.003998531873723384, "phrase": "high_probability"}, {"score": 0.00299622333197717, "phrase": "ambiguous_distribution"}, {"score": 0.0027564303939865476, "phrase": "generalized_moment_bounds"}, {"score": 0.0027212777001495176, "phrase": "structural_properties"}, {"score": 0.0024088451312725924, "phrase": "ambiguity-averse_uncertainty_quantification"}, {"score": 0.002273605493468005, "phrase": "distributionally_robust_optimization"}, {"score": 0.0022159566043745724, "phrase": "explicit_conic_reformulations"}, {"score": 0.0021876814398268775, "phrase": "tractable_problem_classes"}, {"score": 0.0021322065604537617, "phrase": "computable_conservative_approximations"}, {"score": 0.0021049977753042253, "phrase": "intractable_ones"}], "paper_keywords": [""], "paper_abstract": "The objective of uncertainty quantification is to certify that a given physical, engineering or economic system satisfies multiple safety conditions with high probability. A more ambitious goal is to actively influence the system so as to guarantee and maintain its safety, a scenario which can be modeled through a chance constrained program. In this paper we assume that the parameters of the system are governed by an ambiguous distribution that is only known to belong to an ambiguity set characterized through generalized moment bounds and structural properties such as symmetry, unimodality or independence patterns. We delineate the watershed between tractability and intractability in ambiguity-averse uncertainty quantification and chance constrained programming. Using tools from distributionally robust optimization, we derive explicit conic reformulations for tractable problem classes and suggest efficiently computable conservative approximations for intractable ones.", "paper_title": "A distributionally robust perspective on uncertainty quantification and chance constrained programming", "paper_id": "WOS:000354623300003"}