{"auto_keywords": [{"score": 0.048255519436473625, "phrase": "rsi"}, {"score": 0.008713760232270575, "phrase": "booming_countries"}, {"score": 0.007716334639223999, "phrase": "research_profile"}, {"score": 0.006015511760188644, "phrase": "increased_representation"}, {"score": 0.005325445955689942, "phrase": "china"}, {"score": 0.004683292152590589, "phrase": "relative_specialization_index"}, {"score": 0.004555217356295278, "phrase": "country_level"}, {"score": 0.00370981613076245, "phrase": "world_total"}, {"score": 0.0032470094613727433, "phrase": "different_research_profiles"}, {"score": 0.002486987042061596, "phrase": "basic_research_profile"}, {"score": 0.0021049977753042253, "phrase": "general_changes"}], "paper_keywords": ["Publication indicators", " Relative specialization index", " Activity index", " Scientific specialisation", " Web of Science", " China"], "paper_abstract": "The Relative Specialization Index (RSI) is an indicator that measures the research profile of a country by comparing the share of a given field in the publications of a given country with the share of the same field in the world total of publications. If measured over time, this indicator may be influenced in the world total by the increased representation of certain other countries with different research profiles. As a case, we study the effect on the RSI for The Netherlands of the increased representation of China in the ISI Web of Science. Although the booming of China is visible in the RSI for The Netherlands, especially in the last decade and in fields where the countries have opposite specializations, the basic research profile as measured by the RSI remains the same. We conclude that the indicator is robust with regard to booming countries, and that it may suffice to observe the general changes in the research profile of the database if the RSI for a country is studied over time.", "paper_title": "The effect of booming countries on changes in the relative specialization index (RSI) on country level", "paper_id": "WOS:000343609900029"}