{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "security_lessons"}, {"score": 0.04217208370496877, "phrase": "generic_security_templates"}, {"score": 0.03725049175533517, "phrase": "security_incidents"}, {"score": 0.030366548063439067, "phrase": "cyber_security_lessons"}, {"score": 0.0043509032299218955, "phrase": "different_healthcare_organisations"}, {"score": 0.004317109072311102, "phrase": "recent_studies"}, {"score": 0.004103728794623367, "phrase": "security_knowledge"}, {"score": 0.004055998173160551, "phrase": "future_attacks"}, {"score": 0.003870541730075597, "phrase": "knowledge_transfer"}, {"score": 0.0037079710789139305, "phrase": "potential_users"}, {"score": 0.0036791522245326514, "phrase": "healthcare_organisations"}, {"score": 0.0036221822903900725, "phrase": "gst_technique"}, {"score": 0.0034162643819889054, "phrase": "case_studies"}, {"score": 0.003234615195382533, "phrase": "security_incident"}, {"score": 0.002980115908651862, "phrase": "chinese"}, {"score": 0.0027995677499976406, "phrase": "chinese_healthcare_organisation"}, {"score": 0.002599365215003002, "phrase": "future_improvements"}, {"score": 0.002366763442497185, "phrase": "applicable_security_standards"}, {"score": 0.0023209828061385596, "phrase": "previous_breaches"}, {"score": 0.002197443382039439, "phrase": "future_work"}, {"score": 0.002171836484200008, "phrase": "similar_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Generic Security Template", " Lessons learned", " Security incident", " Knowledge redistribution", " Healthcare"], "paper_abstract": "Context: The recurrence of past security breaches in healthcare showed that lessons had not been effectively learned across different healthcare organisations. Recent studies have identified the need to improve learning from incidents and to share security knowledge to prevent future attacks. Generic Security Templates (GSTs) have been proposed to facilitate this knowledge transfer. The objective of this paper is to evaluate whether potential users in healthcare organisations can exploit the GST technique to share lessons learned from security incidents. Methodology: We conducted a series of case studies to evaluate GSTs. In particular, we used a GST for a security incident in the US Veterans' Affairs Administration to explore whether security lessons could be applied in a very different Chinese healthcare organisation. Results: The results showed that Chinese security professional accepted the use of GSTs and that cyber security lessons could be transferred to a Chinese healthcare organisation using this approach. The users also identified the weaknesses and strengths of GSTs, providing suggestions for future improvements. Conclusion: Generic Security Templates can be used to redistribute lessons learned from security incidents. Sharing cyber security lessons helps organisations consider their own practices and assess whether applicable security standards address concerns raised in previous breaches in other countries. The experience gained from this study provides the basis for future work in conducting similar studies in other healthcare organisations. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Improving the redistribution of the security lessons in healthcare: An evaluation of the Generic Security Template", "paper_id": "WOS:000362411900007"}