{"auto_keywords": [{"score": 0.049561472167574526, "phrase": "uncertain_trajectories"}, {"score": 0.04729673582544897, "phrase": "nearest_neighbor"}, {"score": 0.042389058155836386, "phrase": "continuous_nature"}, {"score": 0.03157244457765463, "phrase": "continuous_nn_queries"}, {"score": 0.00481495049065317, "phrase": "continuous_nearest_neighbors"}, {"score": 0.0042489946866108895, "phrase": "nn_query"}, {"score": 0.003668591097652231, "phrase": "non-zero_probability"}, {"score": 0.0029029754274913803, "phrase": "tree_structure"}, {"score": 0.002779217021776702, "phrase": "efficient_algorithms"}, {"score": 0.0026033756286033285, "phrase": "nn_queries"}, {"score": 0.0024653491388223546, "phrase": "road_networks"}, {"score": 0.0021987994275190314, "phrase": "proposed_algorithms_yield"}], "paper_keywords": ["Nearest neighbor", " Uncertainty", " Moving objects database"], "paper_abstract": "This article addresses the problem of performing Nearest Neighbor (NN) queries on uncertain trajectories. The answer to an NN query for certain trajectories is time parameterized due to the continuous nature of the motion. As a consequence of uncertainty, there may be several objects that have a non-zero probability of being a nearest neighbor to a given querying object, and the continuous nature further complicates the semantics of the answer. We capture the impact that the uncertainty of the trajectories has on the semantics of the answer to continuous NN queries and we propose a tree structure for representing the answers, along with efficient algorithms to compute them. We also address the issue of performing NN queries when the motion of the objects is restricted to road networks. Finally, we formally define and show how to efficiently execute several variants of continuous NN queries. Our experiments demonstrate that the proposed algorithms yield significant performance improvements when compared with the corresponding na < ve approaches.", "paper_title": "Ranking continuous nearest neighbors for uncertain trajectories", "paper_id": "WOS:000295170200007"}