{"auto_keywords": [{"score": 0.031461310706329015, "phrase": "associated_single_criterion_problems"}, {"score": 0.027974447194407184, "phrase": "bicriteria_problem"}, {"score": 0.00481495049065317, "phrase": "single_machine_scheduling"}, {"score": 0.004760017604908536, "phrase": "controllable_processing_times_by_submodular_optimization."}, {"score": 0.004652016085325825, "phrase": "controllable_processing_times_the_actual_processing_time"}, {"score": 0.003916098498242888, "phrase": "single_machine"}, {"score": 0.003511246498068952, "phrase": "job_completion_times"}, {"score": 0.0031845067058084583, "phrase": "optimal_trade-off"}, {"score": 0.0028550709503536494, "phrase": "objective_functions"}, {"score": 0.0025596276616952516, "phrase": "parametric_linear_programs"}, {"score": 0.0024586427394152196, "phrase": "submodular_polyhedron"}, {"score": 0.0023346234464901978, "phrase": "feasible_region"}, {"score": 0.002268441347979241, "phrase": "so-called_base_polyhedron"}, {"score": 0.0021416404045850224, "phrase": "greedy_algorithm"}], "paper_keywords": ["Single machine scheduling", " controllable processing times", " polymatroid", " base polyhedron"], "paper_abstract": "In scheduling with controllable processing times the actual processing time of each job is to be chosen from the interval between the smallest (compressed or fully crashed) value and the largest (decompressed or uncrashed) value. In the problems under consideration, the jobs are processed on a single machine and the quality of a schedule is measured by two functions: the maximum cost (that depends on job completion times) and the total compression cost. Our main model is bicriteria and is related to determining an optimal trade-off between these two objectives. Additionally, we consider a pair of associated single criterion problems, in which one of the objective functions is bounded while the other one is to be minimized. We reduce the bicriteria problem to a series of parametric linear programs defined over the intersection of a submodular polyhedron with a box. We demonstrate that the feasible region is represented by a so-called base polyhedron and the corresponding problem can be solved by the greedy algorithm that runs two orders of magnitude faster than known previously. For each of the associated single criterion problems, we develop algorithms that deliver the optimum faster than it can be deduced from a solution to the bicriteria problem.", "paper_title": "SINGLE MACHINE SCHEDULING WITH CONTROLLABLE PROCESSING TIMES BY SUBMODULAR OPTIMIZATION", "paper_id": "WOS:000265086600003"}