{"auto_keywords": [{"score": 0.02714978140601789, "phrase": "high_level"}, {"score": 0.02310864726552979, "phrase": "manual_operations"}, {"score": 0.00481495049065317, "phrase": "business_processes"}, {"score": 0.004662427600500598, "phrase": "information_system"}, {"score": 0.004233119608341877, "phrase": "supported_business_process"}, {"score": 0.003856971411867688, "phrase": "current_paper"}, {"score": 0.0036553070575015344, "phrase": "cost_efficiency"}, {"score": 0.003552084379143929, "phrase": "theoretical_model"}, {"score": 0.003023307182674672, "phrase": "later_system"}, {"score": 0.0029064676523923886, "phrase": "process_performance"}, {"score": 0.002591554263245753, "phrase": "business_process"}, {"score": 0.0025364139244227458, "phrase": "structural_and_environmental_uncertainty"}, {"score": 0.0025003054002226965, "phrase": "low_level"}, {"score": 0.002482443883144136, "phrase": "process_uncertainty"}, {"score": 0.0023440589015485077, "phrase": "high_process_variability"}, {"score": 0.002285961573963468, "phrase": "flexibility_management"}, {"score": 0.0021049977753042253, "phrase": "process_requirements"}], "paper_keywords": ["business processes", " cost efficiency", " economics of IS flexibility", " IS flexibility", " Lorenz curve", " theory", " building research", " theory of IS flexibility"], "paper_abstract": "In order to be effective, an information system ( IS) needs to be flexible, that is, it must be able to accommodate a certain amount of variation regarding the requirements of the supported business process. Despite many previous studies on the flexibility of organizations, processes, and various organizational technologies, the economics of flexibility are not yet well understood. The current paper contributes to IS theory building with a focus on the impact of IS flexibility on the cost efficiency of a given business process. We present a theoretical model that details the economics of two generic strategies of IS flexibility (i.e., flexibility-to-use regarding the IS features that are provided at the time of implementation, and flexibility-to-change regarding the IS features that constitute an option for later system upgrade), and that also includes the possibility of process performance outside of the IS ( manual operations). Based on an analysis of the model, we conclude that IS flexibility-to-change is cost efficiently deployed to support a business process characterized by a high level of structural and environmental uncertainty, whereas a low level of process uncertainty corresponds efficiently with IS flexibility-to-use. The model also indicates that high process variability can improve the importance of IS flexibility management in general, as it tends to limit the value of an IS over manual operations, whereas a high level of time-criticality of process requirements tends to increase the value of an IS over manual operations.", "paper_title": "Information system flexibility and the cost efficiency of business processes", "paper_id": "WOS:000246737700001"}