{"auto_keywords": [{"score": 0.004545793387330536, "phrase": "academics'_searching"}, {"score": 0.004498490110526062, "phrase": "sensemaking_processes"}, {"score": 0.004428452434981208, "phrase": "exploratory_tasks"}, {"score": 0.004291617358806677, "phrase": "-existing_frames"}, {"score": 0.004137288854115515, "phrase": "\"_tasks"}, {"score": 0.003610929883213109, "phrase": "different_levels"}, {"score": 0.0035176353680157367, "phrase": "exploratory_search_tasks"}, {"score": 0.003444732262403694, "phrase": "influential_members"}, {"score": 0.003373334961160647, "phrase": "\"rising_stars"}, {"score": 0.003251920460276645, "phrase": "unfamiliar_academic_community"}, {"score": 0.0031845067058084583, "phrase": "-aloud_sessions"}, {"score": 0.0031348622158167195, "phrase": "semi-structured_interviews"}, {"score": 0.0030062165552187086, "phrase": "specific_and_general_domain_expertise"}, {"score": 0.0029131986574478046, "phrase": "knowledge_construction"}, {"score": 0.0027645030021576926, "phrase": "iterative_and_interactive_process"}, {"score": 0.0025555322596460036, "phrase": "determined_qualities"}, {"score": 0.002399760112755228, "phrase": "sensitising_theoretical_constructs"}, {"score": 0.002253461585851626, "phrase": "starting_point"}, {"score": 0.0021049977753042253, "phrase": "ill-defined_or_non-existent_initial_frames"}], "paper_keywords": ["information seeking", " domain knowledge", " knowledge"], "paper_abstract": "The motivation for this study was to better understand academics' searching and sensemaking processes when solving exploratory tasks for which they lack pre-existing frames. We focus on \"influence\" tasks because, although they appear to be unfamiliar, they arise in much academic discourse, at least tacitly. We report the processes of academics at different levels of seniority when completing exploratory search tasks that involved identifying influential members of their academic community and \"rising stars,\" and similarly for an unfamiliar academic community. 11 think-aloud sessions followed by semi-structured interviews were conducted to investigate the roles of specific and general domain expertise in shaping information seeking and knowledge construction. Academics defined and completed the tasks through an iterative and interactive process of seeking and sensemaking, during which they constructed an understanding of their communities and determined qualities of \"being influential\". The Data/Frame Theory of Sensemaking was used to provide sensitising theoretical constructs. The study shows that both external and internal knowledge resources are essential to define a starting point or frame, make and support decisions, and experience satisfaction. Ill-defined or non-existent initial frames may cause unsubstantial or arbitrary decisions, and feelings of uncertainty and lack of confidence.", "paper_title": "Understanding \"Influence:\" An Exploratory Study of Academics' Processes of Knowledge Construction Through Iterative and Interactive Information Seeking", "paper_id": "WOS:000357817600004"}