{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "agricultural_machinery"}, {"score": 0.004748740786945996, "phrase": "fuzzy_sets_theory"}, {"score": 0.004492841495994535, "phrase": "basic_factors"}, {"score": 0.004451546786101008, "phrase": "successful_agricultural_production"}, {"score": 0.004270347498153512, "phrase": "clear_need"}, {"score": 0.004192190072470619, "phrase": "exact_indicator"}, {"score": 0.0038046452381676967, "phrase": "different_working_conditions"}, {"score": 0.0036496814103475174, "phrase": "synthesis_indicators"}, {"score": 0.003517223847512266, "phrase": "technical_systems"}, {"score": 0.0033428820402140683, "phrase": "fuzzy_set_theory"}, {"score": 0.003177154457204775, "phrase": "influence_indicators"}, {"score": 0.0029234476524900794, "phrase": "typical_representative"}, {"score": 0.002896535621940078, "phrase": "agro_machinery"}, {"score": 0.00274017282519193, "phrase": "linguistic_description"}, {"score": 0.0026284507395498897, "phrase": "max-min_composition"}, {"score": 0.002407290605654707, "phrase": "climatic_and_soil_conditions"}, {"score": 0.0021945194903838132, "phrase": "achieved_effects"}], "paper_keywords": ["Agricultural machinery", " Effectiveness", " Fuzzy set", " Max-min composition"], "paper_abstract": "The quality of service of agricultural machinery represents one of the basic factors for successful agricultural production. In this sense, there is a clear need for defining the exact indicator of the quality of these machines, according to which it could be possible to determine which machine is optimal for different working conditions. The concept of effectiveness represents one of synthesis indicators of the quality of service of the technical systems. In this paper the effectiveness is defined using the fuzzy set theory, and reliability, maintainability and functionality are used as influence indicators of the effectiveness. In that sense the model for assessing the effectiveness of tractor as a typical representative of agro machinery has been formed. The model is based on integration of linguistic description of the above mentioned influence indicators using fuzzy set theory and max-min composition. The model was tested on the example of three tractors of the same category, which are exploited in climatic and soil conditions in the wider Belgrade (Serbia) area. Even if the conditions in this experiment were approximately equal, the difference of the achieved effects was attained and very significant, compared to other operation parameters. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Effectiveness assessment of agricultural machinery based on fuzzy sets theory", "paper_id": "WOS:000303281800046"}