{"auto_keywords": [{"score": 0.03614022543627635, "phrase": "graph_layout"}, {"score": 0.03576330697023563, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "visual_complexity"}, {"score": 0.0045612889352793584, "phrase": "desired_properties"}, {"score": 0.004383766516923386, "phrase": "produced_layers"}, {"score": 0.004122850924351265, "phrase": "user_study"}, {"score": 0.003933813742509612, "phrase": "experimental_analysis"}, {"score": 0.0039055075176836263, "phrase": "popular_force-directed_graph"}, {"score": 0.003699579190650754, "phrase": "smallest_number"}, {"score": 0.003331633090341137, "phrase": "graph_layouts"}, {"score": 0.0032601856292942106, "phrase": "presented_user_study"}, {"score": 0.0032134045046357876, "phrase": "interesting_considerations"}, {"score": 0.0031672925196105663, "phrase": "experimental_evaluation"}, {"score": 0.00296781730323553, "phrase": "reliable_measure"}, {"score": 0.0027113815712365924, "phrase": "larger_drawings"}, {"score": 0.002634084319025334, "phrase": "time_complexity"}, {"score": 0.002279349794239275, "phrase": "application_domains"}, {"score": 0.0021825348057711628, "phrase": "new_visualization_paradigms"}, {"score": 0.002151183757599893, "phrase": "stratified_drawings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Network exploration", " Human-computer interaction", " Graph visualization", " Information visualization"], "paper_abstract": "We propose an approach that allows a user (e.g., an analyst) to explore a layout produced by any graph drawing algorithm, in order to reduce the visual complexity and clarify its presentation. Our approach is based on stratifying the drawing into layers with desired properties; to this aim, heuristics are presented. The produced layers can be explored and combined by the user to gradually acquire details. We present a user study to test the effectiveness of our approach. Furthermore, we performed an experimental analysis on popular force-directed graph drawing algorithms, in order to evaluate what is the algorithm that produces the smallest number of layers and if there is any correlation between the number of crossings and the number of layers of a graph layout. The proposed approach is useful to explore graph layouts, as confirmed by the presented user study. Furthermore, interesting considerations arise from the experimental evaluation, in particular, our results suggest that the number of layers of a graph layout may represent a reliable measure of its visual complexity. The algorithms presented in this paper can be effectively applied to graph layouts with a few hundreds of edges and vertices. For larger drawings that contain lots of crossings, the time complexity of our algorithms grows quadratically in the number of edges and more efficient techniques need to be devised. The proposed approach takes as input a layout produced by any graph drawing algorithm, therefore it can be applied in a variety of application domains. Several research directions can be explored to extend our framework and to devise new visualization paradigms to effectively present stratified drawings. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Techniques for Edge Stratification of Complex Graph Drawings", "paper_id": "WOS:000338482400018"}