{"auto_keywords": [{"score": 0.046308404263363405, "phrase": "prescription_drugs"}, {"score": 0.00481495049065317, "phrase": "adverse_drug-drug_interactions"}, {"score": 0.004703671193348433, "phrase": "multiple_drugs"}, {"score": 0.004648995193787914, "phrase": "adverse_effects"}, {"score": 0.004471270242168067, "phrase": "package_inserts"}, {"score": 0.004283576270012874, "phrase": "adverse_interactions"}, {"score": 0.003993216345115755, "phrase": "health_professionals"}, {"score": 0.003946766004066276, "phrase": "comprehensive_view"}, {"score": 0.003916098498242888, "phrase": "drug-drug_interactions"}, {"score": 0.003781005930058317, "phrase": "computational_method"}, {"score": 0.00373701482510911, "phrase": "potential_interactions"}, {"score": 0.0036363418376496484, "phrase": "practical_value"}, {"score": 0.0034032058199751644, "phrase": "japan"}, {"score": 0.0031597433845085092, "phrase": "kegg_drug_database"}, {"score": 0.0029338597685088603, "phrase": "overlapping_targets"}, {"score": 0.00277778944472107, "phrase": "different_but_similar_targets"}, {"score": 0.0026923527275481804, "phrase": "different_targets"}, {"score": 0.002579140290642792, "phrase": "extracted_interaction_data"}, {"score": 0.002519402443228795, "phrase": "interaction_patterns"}, {"score": 0.002470676601347937, "phrase": "drug_groups"}, {"score": 0.0024040357029838774, "phrase": "high-resolution_network"}, {"score": 0.0023209828061385596, "phrase": "low-resolution_global_network"}, {"score": 0.0022320551224679526, "phrase": "drug-drug_interaction_retrieval_system"}, {"score": 0.0021049977753042253, "phrase": "known_drug-drug_interactions"}], "paper_keywords": [""], "paper_abstract": "Co-administration of multiple drugs may cause adverse effects, which are usually known but sometimes unknown. Package inserts of prescription drugs are supposed to contain contraindications and warnings on adverse interactions, but such information is not necessarily complete. Therefore, it is becoming more important to provide health professionals with a comprehensive view on drug-drug interactions among all the drugs in use as well as a computational method to identify potential interactions, which may also be of practical value in society. Here we extracted 1,306,565 known drug-drug interactions from all the package inserts of prescription drugs marketed in Japan. They were reduced to 45,180 interactions involving 1352 drugs (active ingredients) identified by the D numbers in the KEGG DRUG database, of which 14,441 interactions involving 735 drugs were linked to the same drug-metabolizing enzymes and/or overlapping drug targets. The interactions with overlapping targets were further classified into three types; acting on the same target, acting on different but similar targets in the same protein family, and acting on different targets belonging to the same pathway. For the rest of the extracted interaction data, we attempted to characterize interaction patterns in terms of the drug groups defined by the Anatomical Therapeutic Chemical (ATC) classification system, where the high-resolution network at the D number level is progressively reduced to a low-resolution global network. Based on this study we have developed a drug-drug interaction retrieval system in the KEGG DRUG database, which may be used for both searching against known drug-drug interactions and predicting potential interactions.", "paper_title": "Network-Based Analysis and Characterization of Adverse Drug-Drug Interactions", "paper_id": "WOS:000297275000020"}