{"auto_keywords": [{"score": 0.03191759067672406, "phrase": "systematic_errors"}, {"score": 0.004579244735256393, "phrase": "experimental_uncertainty"}, {"score": 0.0035899674590142653, "phrase": "extrapolated_or_interpolated_value"}, {"score": 0.0034806529881619454, "phrase": "least_squares"}, {"score": 0.0032216622984027558, "phrase": "correct_values"}, {"score": 0.00317221667574882, "phrase": "full_formula"}, {"score": 0.00292477450010107, "phrase": "highly_hydrophobic_and_highly_insoluble_compounds"}, {"score": 0.0027492483892113, "phrase": "suspended_nanodroplets"}, {"score": 0.002675797331220082, "phrase": "high_apparent_solubilities"}, {"score": 0.0025054621733192283, "phrase": "desired_extrapolation"}, {"score": 0.002401053532270901, "phrase": "possible_error"}, {"score": 0.002171202123281881, "phrase": "expected_uncertainty"}, {"score": 0.0021049977753042253, "phrase": "good_publishing_practice"}], "paper_keywords": ["Experimental error", " Error propagation", " Variance and covariance", " Systematic errors"], "paper_abstract": "Data always have an experimental uncertainty, i.e. error limits within which the value is very likely to be found. Although the use of statistics is common as is the use of least squares it remains uncommon to see reported the covariance between parameters for an equation to which data have been fitted. This means that a reader cannot properly calculate the error in an extrapolated or interpolated value. Even when the uncertainties in the least squares parameters are reported, errors calculated without the covariance are often too large and almost always different from the correct values calculated using the full formula. This report will demonstrate the importance of covariance in several examples. Systematic errors are also touched on; solubilities of highly hydrophobic and highly insoluble compounds are very difficult to measure for reasons not widely enough appreciated. Aggregation leading to suspended nanodroplets or nanocrystals can lead to spuriously high apparent solubilities. Another class of systematic errors comes from using an equation which is too simple for a desired extrapolation to a value of interest. The magnitude of this possible error is presented for a number of cases. Extrapolation can lead to a value of some use even though it is very uncertain, but expected uncertainty should be pointed out. Recommendations for good publishing practice are proposed for both authors and editors.", "paper_title": "Presenting data in such a fashion that they can be used by other scientists", "paper_id": "WOS:000362964600006"}