{"auto_keywords": [{"score": 0.043452207739444186, "phrase": "lightweight_assessment"}, {"score": 0.00481495049065317, "phrase": "assessment_experience"}, {"score": 0.004096082254543022, "phrase": "lightweight_assessment_method"}, {"score": 0.003951453722517865, "phrase": "task_checklist"}, {"score": 0.0038290829316346654, "phrase": "customized_procedures"}, {"score": 0.0033160345607565565, "phrase": "acceptable_way"}, {"score": 0.002820319063320601, "phrase": "readiness_checking"}, {"score": 0.0027950561494657633, "phrase": "forthcoming_tasks"}, {"score": 0.002398529964696261, "phrase": "daily_routine_tool"}, {"score": 0.0023557346035701096, "phrase": "actual_status"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["ISO/IEC 29110", " software process improvement", " software process assessment", " very small entity (VSE)"], "paper_abstract": "In January 2011, a new standard ISO/IEC 29110 was published. To evaluate effectiveness of the assessment using ISO/IEC 29110, we have performed a series of lightweight assessment. The lightweight assessment method taken in this trial was using the task checklist based on ISO/IEC 29110-5 with the customized procedures based on ISO/IEC 15504-2. Through the trial, we found that the lightweight assessment required little effort to the project. Moreover, we found that the lightweight assessment was an acceptable way for the project to extract issues and risks in the project and urge awareness. Regarding the one aforementioned, the lightweight assessment using ISO/IEC 29110 has two benefits. Firstly, it is useful for the readiness checking of forthcoming tasks and workproducts. Secondly, the lightweight assessment are performed iteratively and repeatedly performed several times with little effort. As mentioned earlier, lightweight assessment should be performed not for the evaluation but as a daily routine tool to obtain the actual status and performance of management and to identify the problems. In this way, the ISO/IEC 29110 lightweight assessment is useful. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Report on an assessment experience based on ISO/IEC 29110", "paper_id": "WOS:000333022100005"}