{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rna_secondary_structure"}, {"score": 0.004145287175409325, "phrase": "space_complexity"}, {"score": 0.0035486713647627246, "phrase": "nested_rna_secondary_structure_algorithms"}, {"score": 0.0033384259516301223, "phrase": "fast_algorithm"}, {"score": 0.003088702479841264, "phrase": "greedy_principle"}, {"score": 0.002857605453835429, "phrase": "greedy_algorithm"}, {"score": 0.0026001981239112634, "phrase": "np"}, {"score": 0.002445865715873089, "phrase": "valuable_and_useful_method"}, {"score": 0.0023265270905455334, "phrase": "new_algorithm"}, {"score": 0.0021763973978248005, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "good_accuracy"}], "paper_keywords": ["Cybernetics", " Programming and algorithm theory", " Biology", " Biophysics", " Systems"], "paper_abstract": "Purpose - The purpose of this paper is to design an algorithm to predict RNA secondary structure, compared with other relevant algorithm, its time complexity and space complexity are reduced. Design/methodology/approach - The dynamic programming algorithm need more time and space; it is very difficult to predict the RNA secondary structure which have more 1,000 bases. The nested RNA secondary structure algorithms cannot predict the RNA secondary structure containing pseudoknots, so the fast algorithm is needed to predict the RNA secondary structure containing pseudoknots urgently. Based on the greedy principle, a model is designed to solve the problem. Findings - A greedy algorithm is presented to predict RNA secondary structure. Research limitations/implications The problem for predicting RNA secondary structure including pseudoknots is NP-complete. Practical implications - The paper presents a valuable and useful method for predicting the RNA secondary structure. Originality/value - The new algorithm needs O(n(3)) time and O(n) space; the experimental results indicate that the algorithm has good accuracy and sensitivity.", "paper_title": "A predicting algorithm of RNA secondary structure based on stems", "paper_id": "WOS:000280732800023"}