{"auto_keywords": [{"score": 0.03880550409822826, "phrase": "spectral_reflectance"}, {"score": 0.00481495049065317, "phrase": "multispectral_imaging_system"}, {"score": 0.004406994912939125, "phrase": "imaging_system"}, {"score": 0.004228577663320847, "phrase": "spectral_measurements"}, {"score": 0.004129873531628877, "phrase": "reflective_surfaces"}, {"score": 0.0040097139701644165, "phrase": "necessary_and_sufficient_conditions"}, {"score": 0.003939296259436904, "phrase": "sensor_space"}, {"score": 0.00320338467974835, "phrase": "sample_spectral_data"}, {"score": 0.00314708280192844, "phrase": "extracted_teeth"}, {"score": 0.0028800314406625996, "phrase": "wolski's_method"}, {"score": 0.0026355812883224203, "phrase": "tristimulus_values"}, {"score": 0.002181069180139225, "phrase": "sample_data"}, {"score": 0.0021049977753042253, "phrase": "test_illuminant"}], "paper_keywords": ["color", " filter design", " multispectral", " subspace"], "paper_abstract": "In this paper, we present a methodology to design filters for an imaging system to improve the accuracy of the spectral measurements for families of reflective surfaces. We derive the necessary and sufficient conditions that the sensor space of the system must obey in order to measure the spectral reflectance of the surfaces accurately. Through simulations, we show how these conditions can be applied to design filters using a set of sample spectral data acquired from extracted teeth. For this set of data, we also compare our results to those of Wolski's method [1], a conventional filter design method which produces filters that recover tristimulus values of surfaces accurately under several illuminants. We show that our method produces filters that capture the spectral reflectance better given the same number of measurements. The errors in predicting the color of the sample data are much lower under every test illuminant when the filters designed with our method are used.", "paper_title": "A subspace matching color filter design methodology for a multispectral imaging system", "paper_id": "WOS:000239774800015"}