{"auto_keywords": [{"score": 0.04857317035991675, "phrase": "biomedical_informatics"}, {"score": 0.04094340266958054, "phrase": "clinical_informatics"}, {"score": 0.015719716506582538, "phrase": "biological_and_clinical_informatics"}, {"score": 0.00474946741204285, "phrase": "graduate_training_program"}, {"score": 0.004435112270935294, "phrase": "significant_differences"}, {"score": 0.0042178318724732005, "phrase": "uniform_educational_solution"}, {"score": 0.004066498558415824, "phrase": "columbia_university"}, {"score": 0.0039928721865882, "phrase": "graduate_program"}, {"score": 0.00393852508392789, "phrase": "initial_focus"}, {"score": 0.003660879039645457, "phrase": "medical_and_biological_informatics_cultures"}, {"score": 0.003310684108128973, "phrase": "bioinformatics_students"}, {"score": 0.0029128614098881253, "phrase": "application_domains"}, {"score": 0.002769950045729965, "phrase": "new_curriculum"}, {"score": 0.0025627194819793347, "phrase": "key_feature"}, {"score": 0.002493333098814506, "phrase": "new_course"}, {"score": 0.0023818288346547692, "phrase": "informatics_principles"}, {"score": 0.002244277924422011, "phrase": "biomedical_spectrum"}, {"score": 0.0021537217025910356, "phrase": "informatics_training_programs"}], "paper_keywords": ["curriculum", " graduate education", " computational biology", " bioinformatics", " medical informatics"], "paper_abstract": "Several training programs in biomedical informatics in the United States are attempting to integrate biological and clinical informatics. However, significant differences in the cultures underlying these two disciplines pose barriers to a uniform educational solution. This paper recounts the experience at Columbia University in adapting a graduate program with an initial focus on clinical informatics to train bioinformaticians. The analysis begins by considering the development of the medical and biological informatics cultures over a 17-year period. Then we review how two separate curricula evolved to serve the needs of each group. Interviews with bioinformatics students and faculty indicated some dissatisfaction with the curriculum that developed within clinical informatics. Their comments are considered in the light of an analysis of the relationship between the application domains of biomedical informatics as a discipline. In response, a new curriculum was developed in which bioinformatics and clinical informatics are regarded as subdivisions of the same subject. A key feature of this curriculum is a new course, Theory and Methods in Biomedical Informatics, which presents informatics principles in their general form, and illustrates their application with examples drawn from across the biomedical spectrum. The paper concludes with suggestions for integrating informatics training programs at other institutions. (c) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Bridging the gap between biological and clinical informatics in a graduate training program", "paper_id": "WOS:000243216000008"}