{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "engineering_and_industrial_processes"}, {"score": 0.004532988904965752, "phrase": "elementary_functions"}, {"score": 0.00428733103049275, "phrase": "shift-and-add_algorithms"}, {"score": 0.003943481134959376, "phrase": "computer_resources"}, {"score": 0.003852939975815287, "phrase": "almost_the_only_operations"}, {"score": 0.0035110198699787013, "phrase": "digital_processor"}, {"score": 0.003367188029221534, "phrase": "fairly_good_precision"}, {"score": 0.003336031521101184, "phrase": "low_cost_iterations"}, {"score": 0.003199345207727474, "phrase": "cordic._cordic"}, {"score": 0.003096905353118796, "phrase": "wide_variety"}, {"score": 0.002997735656669146, "phrase": "slight_change"}, {"score": 0.002795762692061496, "phrase": "engineering_and_industrial_problems"}, {"score": 0.0023210846870653757, "phrase": "different_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Shift-and-add algorithms", " Engineering", " CAD/CAM"], "paper_abstract": "Different kinds of algorithms can be chosen so as to compute elementary functions. Among all of them, it is worthwhile mentioning the shift-and-add algorithms due to the fact that they have been specifically designed to be very simple and to save computer resources. In fact, almost the only operations usually involved with these methods are additions and shifts, which can be easily and efficiently performed by a digital processor. Shift-and-add algorithms allow fairly good precision with low cost iterations. The most famous algorithm belonging to this type is CORDIC. CORDIC has the capability of approximating a wide variety of functions with only the help of a slight change in their iterations. In this paper, we will analyze the requirements of some engineering and industrial problems in terms of type of operands and functions to approximate. Then, we will propose the application of shift-and-add algorithms based on CORDIC to these problems. We will make a comparison between the different methods applied in terms of the precision of the results and the number of iterations required. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "An approach to the application of shift-and-add algorithms on engineering and industrial processes", "paper_id": "WOS:000315863300031"}