{"auto_keywords": [{"score": 0.047188363272757154, "phrase": "event_handlers"}, {"score": 0.01842466992595032, "phrase": "eventbreak"}, {"score": 0.007095290124638654, "phrase": "execution_time"}, {"score": 0.00481495049065317, "phrase": "user_interfaces"}, {"score": 0.004772367030970874, "phrase": "performance-guided_test_generation"}, {"score": 0.004730158389701481, "phrase": "event-driven_user_interface_applications"}, {"score": 0.004444921827311577, "phrase": "input_events"}, {"score": 0.004066898031169739, "phrase": "short_amount"}, {"score": 0.0034194194985380268, "phrase": "key_idea"}, {"score": 0.0028366012006726896, "phrase": "javascript-based_web_applications"}, {"score": 0.0026182085765020548, "phrase": "unbounded_way"}, {"score": 0.00241658945942583, "phrase": "severe_scalability_problem"}, {"score": 0.0021049977753042253, "phrase": "handler's_execution_time"}], "paper_keywords": ["Web applications", " Testing", " Test generation", " Responsiveness", " Performance"], "paper_abstract": "Event-driven user interface applications typically have a single thread of execution that processes event handlers in response to input events triggered by the user, the network, or other applications. Programmers must ensure that event handlers terminate after a short amount of time because otherwise, the application may become unresponsive. This paper presents EventBreak, a performance-guided test generation technique to identify and analyze event handlers whose execution time may gradually increase while using the application. The key idea is to systematically search for pairs of events where triggering one event increases the execution time of the other event. For example, this situation may happen because one event accumulates data that is processed by the other event. We implement the approach for JavaScript-based web applications and apply it to three real-world applications. EventBreak discovers events with an execution time that gradually increases in an unbounded way, which makes the application unresponsive, and events that, if triggered repeatedly, reveal a severe scalability problem, which makes the application unusable. The approach reveals two known bugs and four previously unknown responsiveness problems. Furthermore, we show that EventBreak helps in testing that event handlers avoid such problems by bounding a handler's execution time.", "paper_title": "EventBreak: Analyzing the Responsiveness of User Interfaces through Performance-Guided Test Generation", "paper_id": "WOS:000348907400003"}