{"auto_keywords": [{"score": 0.04777478798596821, "phrase": "artificial_neural_network"}, {"score": 0.014382022204073421, "phrase": "alkali-silica_reaction"}, {"score": 0.00481495049065317, "phrase": "artificial_neural_networks"}, {"score": 0.004610058444728656, "phrase": "experimental_studies"}, {"score": 0.004439519886195092, "phrase": "concrete_admixture"}, {"score": 0.004337710093279712, "phrase": "reactive_aggregates"}, {"score": 0.0041170581247889654, "phrase": "high_reactivity"}, {"score": 0.0038513073787989054, "phrase": "expansive_pressure"}, {"score": 0.0035097605605135473, "phrase": "specific_surface_area"}, {"score": 0.00327356326590461, "phrase": "calcium_hydroxide"}, {"score": 0.003189133102243104, "phrase": "c-s-h_gel"}, {"score": 0.003115908199991072, "phrase": "astm"}, {"score": 0.00303553181618577, "phrase": "different_mix_proportions"}, {"score": 0.002983100847441762, "phrase": "kerman"}, {"score": 0.002906138793910919, "phrase": "different_proportions"}, {"score": 0.0026175952455594277, "phrase": "mortar_bars"}, {"score": 0.0025279105573394727, "phrase": "lowest_length_expansion"}, {"score": 0.0024842242921857705, "phrase": "best_proportion"}, {"score": 0.002448394921890037, "phrase": "alkali-silica_reactivity"}, {"score": 0.0023101592330916822, "phrase": "backpropagation_network"}, {"score": 0.002263639474937039, "phrase": "different_algorithms"}, {"score": 0.0022116174573590434, "phrase": "best_amount"}, {"score": 0.0021987994275190314, "phrase": "nano_silica"}, {"score": 0.0021420294823879292, "phrase": "best_algorithm"}, {"score": 0.0021049977753042253, "phrase": "hidden_layer"}], "paper_keywords": ["Nano-Silica", " Alkali-Silica Reaction (ASR)", " Mix Design", " Artificial Neural Network (ANN)", " Backpropagation"], "paper_abstract": "In this article, by using experimental studies and artificial neural network has been tried to investigate the use of nano-silica as concrete admixture to reduce alkali-silica reaction. If there are reactive aggregates and alkali of cement with enough moisture in concrete, a gel will be formed. Then with high reactivity between alkali of cement and existence of silica in aggregates, this gel will expand by absorption of water, and causes expansive pressure and cracks be formed. At the time passes, this gel will reduce both durability and strength of the concrete. By reducing the size of silicate to nano, specific surface area of particles and number of atoms on the surface will be increased, which causes more pozzolanic activity of them. Nano-silica can react with calcium hydroxide (Ca (OH)(2)) and produces C-S-H gel. In this study, accelerated mortar bar specimens according to ASTM C 1260 and ASTM C 1567, with different mix proportions were prepared using aggregates of Kerman, such as: none admixture and plasticizer, different proportions of nano-silica separately. By opening the moulds after 24 hour and curing in water at 80 degrees C for 24 hour, then curing in (1N NaOH) at 80 degrees C for 14 days, length expansion of mortar bars were measured and compared. It was noted that, the lowest length expansion of a specimens shows the best proportion of admixture based on alkali-silica reactivity. Then, prediction of alkali-silica reaction of concrete has been investigated by using artificial neural network. In this study the backpropagation network has been used and compared with different algorithms to train network. Finally, the best amount of nano silica for adding to mix proportion, also the best algorithm and number of neurons in hidden layer of artificial neural network have been offered.", "paper_title": "The use of artificial neural networks in predicting ASR of concrete containing nano-silica", "paper_id": "WOS:000344577600003"}