{"auto_keywords": [{"score": 0.03634236367125269, "phrase": "wavelet_coefficients"}, {"score": 0.029089461005203602, "phrase": "hybrid_filter-wrapper_genetic_algorithm"}, {"score": 0.01523158788019835, "phrase": "chemical_process_installations"}, {"score": 0.013081218311759506, "phrase": "acoustic_waves"}, {"score": 0.012968885710218678, "phrase": "acoustic_activity"}, {"score": 0.011492705023386302, "phrase": "feature_subset_selection"}, {"score": 0.01051087380399872, "phrase": "statistical_dependencies"}, {"score": 0.00481495049065317, "phrase": "informative_basis_function_selection"}, {"score": 0.0047732596509542135, "phrase": "wavelet_packet_decomposition"}, {"score": 0.004718230196581402, "phrase": "corrosion_identification"}, {"score": 0.004690952711665194, "phrase": "acoustic_emission"}, {"score": 0.004610058444728656, "phrase": "aggressive_chemicals"}, {"score": 0.004413846562278824, "phrase": "unexpected_plant_shutdown"}, {"score": 0.003884977091580757, "phrase": "corrosion_monitoring"}, {"score": 0.0038401488612789963, "phrase": "wavelet_packet_coefficients"}, {"score": 0.003623620572273257, "phrase": "corrosion_process"}, {"score": 0.00353019387659895, "phrase": "chemical_process_industry"}, {"score": 0.0033602211267167435, "phrase": "different_corrosion_processes"}, {"score": 0.00303553181618577, "phrase": "local_discriminant_basis_selection_algorithms"}, {"score": 0.0027822459052173113, "phrase": "wavelet-specific_local_discriminant_basis_selection_algorithm"}, {"score": 0.002702591051318831, "phrase": "relevance-redundancy_approach"}, {"score": 0.0026791410961432677, "phrase": "local_search_procedure"}, {"score": 0.0026328482281238927, "phrase": "highest_classification_accuracies"}, {"score": 0.0024987020562103448, "phrase": "proposed_algorithm"}, {"score": 0.002343970440509428, "phrase": "naive_bayes_classifier"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Acoustic emission", " Corrosion monitoring", " Feature subset selection", " Genetic algorithm", " Mutual information", " Wavelet Packet Transform"], "paper_abstract": "Chemical process installations are exposed to aggressive chemicals and conditions leading to corrosion. The damage from corrosion can lead to an unexpected plant shutdown and to the exposure of people and the environment to chemicals. Due to changes within and on the surface of materials subjected to corrosion, energy is released in the form of acoustic waves. This acoustic activity can be captured and used for corrosion monitoring in chemical process installations. Wavelet packet coefficients extracted from the acoustic activity have been considered to determine whether corrosion occurs, and to identify the type of corrosion process, at least for the most important corrosion processes in the chemical process industry. Feature subset selection is then applied to these wavelet coefficients to achieve a much higher accuracy in the identification of different corrosion processes than when no feature subset selection is applied to the acoustic waves. However, due to the statistical dependencies that potentially exist between the wavelet coefficients, the latter should not be selected independently from each other. Local discriminant basis selection algorithms do not take the statistical dependencies between wavelet coefficients into account. In this paper, we have used several mutual information-based approaches that take these dependencies into account and compared them to the wavelet-specific local discriminant basis selection algorithm. Furthermore, a hybrid filter-wrapper genetic algorithm, which uses a relevance-redundancy approach as a local search procedure, was designed. The highest classification accuracies are obtained with the hybrid filter-wrapper genetic algorithm, for all classifiers used in this paper. Furthermore, the proposed algorithm easily outperformed one of the most commonly used classifiers in chemometrics: partial least squares discriminant analysis (PLS-DA). A naive Bayes classifier that uses the features selected by the hybrid filter-wrapper genetic algorithm was able to identify the absence of corrosion, uniform corrosion, pitting and stress corrosion cracking, with an accuracy of up to 87.20%. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Genetic algorithm for informative basis function selection from the wavelet packet decomposition with application to corrosion identification using acoustic emission", "paper_id": "WOS:000293263600012"}