{"auto_keywords": [{"score": 0.0497491013599731, "phrase": "software_projects"}, {"score": 0.044898745253041106, "phrase": "software_project"}, {"score": 0.00481495049065317, "phrase": "viable_systems_model"}, {"score": 0.004732444672509326, "phrase": "ict_sector"}, {"score": 0.004699837689671504, "phrase": "castilla_y_leon"}, {"score": 0.004667454318370122, "phrase": "purpose_-_the_purpose"}, {"score": 0.0044315727523877605, "phrase": "vsm"}, {"score": 0.0043555900164106934, "phrase": "stafford_beer"}, {"score": 0.0041211075804202905, "phrase": "quantitative_analysis"}, {"score": 0.004008624230034271, "phrase": "theoretical_constructs"}, {"score": 0.0035391223341472502, "phrase": "standardised_measurement_tool"}, {"score": 0.0034544053534458093, "phrase": "data_collection"}, {"score": 0.003360057874429478, "phrase": "information_and_communications_technology_sector"}, {"score": 0.003336875060853387, "phrase": "castilla"}, {"score": 0.00327961310338175, "phrase": "obtained_data"}, {"score": 0.003113637673848439, "phrase": "structural_equation_model"}, {"score": 0.0030285690317007805, "phrase": "particular_importance"}, {"score": 0.0025293860389728516, "phrase": "appropriate_prevention_actions"}, {"score": 0.0022404996930993413, "phrase": "vsm_application"}, {"score": 0.0022250240576349267, "phrase": "software_projects_organisation"}, {"score": 0.0021716944668428865, "phrase": "vsm_formalisation"}, {"score": 0.0021566930572796935, "phrase": "practical_application"}], "paper_keywords": ["Project management", " Cybernetics", " Viable systems"], "paper_abstract": "Purpose - The purpose of this paper is to detect the degree of influence between applying the Viable Systems Model (VSM), developed by Stafford Beer, on a software project and its viability or success. Design/methodology/approach - The authors performed a quantitative analysis in which it was necessary to identify theoretical constructs of the VSM (Systems One to Five) and of the viability or success of the software project, measuring each of the indicators together. These indicators have been included in a questionnaire or standardised measurement tool, which was subsequently used for data collection by a number of companies in the information and communications technology sector in Castilla y Leon. The obtained data served as the basis for a number of results through the definition of a structural equation model. Findings - The results support the particular importance of Systems One and Four in a software project. In other words, software projects need to clearly define their operational elements (e.g. organisational units, business units, working environments, and working teams) and the relationships that appear between them. Additionally, in software projects it is necessary to determine the appropriate prevention actions to be able to observe the changes that take place in their environment and thus make decisions that allow the project to adapt to these changes. Originality/value - The originality is based on the VSM application in software projects organisation. The value is based on VSM formalisation and practical application, to overcome the criticism about its abstract nature.", "paper_title": "Quantitative analysis of viable systems model on software projects in the ICT sector in Castilla y Leon", "paper_id": "WOS:000359057900010"}