{"auto_keywords": [{"score": 0.02541129294690603, "phrase": "dynamic_strategy"}, {"score": 0.004569630374630379, "phrase": "distribution_centre"}, {"score": 0.004537895824476776, "phrase": "taiwan"}, {"score": 0.0043976740574978085, "phrase": "picking_area"}, {"score": 0.004321656690200878, "phrase": "different_zones"}, {"score": 0.0036680857629458816, "phrase": "best_zone-visitation_sequence"}, {"score": 0.003234934827553253, "phrase": "two-phase_optimization_process"}, {"score": 0.0032012284065895537, "phrase": "initial_starting_solution"}, {"score": 0.0031458272260508637, "phrase": "nearest-neighbour_type_generative_algorithm_npzf"}, {"score": 0.003102195256794215, "phrase": "simulated_annealing_improvement_algorithm"}, {"score": 0.00293361812353423, "phrase": "good_exemplars"}, {"score": 0.002892920908794289, "phrase": "simulation_experiments"}, {"score": 0.002803398730609738, "phrase": "proposed_strategies"}, {"score": 0.0026634753750025817, "phrase": "time"}, {"score": 0.002614228362365338, "phrase": "picking_operations"}, {"score": 0.0024721021985994115, "phrase": "simulation_results"}, {"score": 0.0024377918036784336, "phrase": "fixed_strategy"}, {"score": 0.0023705908463302378, "phrase": "ttd"}, {"score": 0.002289180040240783, "phrase": "trst"}, {"score": 0.00227323630082804, "phrase": "tpt."}, {"score": 0.002202847728425357, "phrase": "better_strategy"}, {"score": 0.0021571346514418226, "phrase": "possible_physical_fatigue"}, {"score": 0.0021049977753042253, "phrase": "greater_travel_distance"}], "paper_keywords": ["order-picking operation", " zone-visitation sequencing strategy", " distribution centre"], "paper_abstract": "The environment of this study is modelled after a distribution centre in Taiwan. One unique characteristic of this environment is that the picking area has been divided into different zones. A picker often has to visit more than one zone to pick all the items in an order. This environment has one important restriction - no more than one picker can simultaneously be in the same zone. This paper focuses on one problem of this environment, i.e. finding the best zone-visitation sequence a picker can follow. Two zone-visitation sequencing strategies - the fixed zone-visitation sequencing strategy and the dynamic zone-visitation sequencing strategy - are proposed and studied for the problem. Both strategies incorporate a two-phase optimization process. An initial starting solution is found using a nearest-neighbour type generative algorithm NPZF, then a simulated annealing improvement algorithm SA brings this solution towards optimality. This ensures that each strategy is represented by good exemplars of their class. Simulation experiments are conducted to evaluate the performance of the proposed strategies in three performance measures - total travel distance of pickers (TTD), total required system Time to complete the picking operations (TRST), and total picking time of pickers (TPT). The simulation results show that the fixed strategy is about 20.9% better than the dynamic strategy in TTD, but about 17% less effective than the dynamic strategy in TRST and TPT. This indicates that the dynamic strategy will be a better strategy if one can prevent the possible physical fatigue experienced by pickers due to the greater travel distance. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "A comparison of two zone-visitation sequencing strategies in a distribution centre", "paper_id": "WOS:000241688300006"}