{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "theoretical_approaches"}, {"score": 0.0045726187330434025, "phrase": "scientific_status"}, {"score": 0.0043875257506180865, "phrase": "document_abstracting_studies"}, {"score": 0.004327500975159818, "phrase": "different_perspectives"}, {"score": 0.004025531820226182, "phrase": "analysis_proposals"}, {"score": 0.003543667617024855, "phrase": "different_levels"}, {"score": 0.0035193239615499074, "phrase": "theoretical_and_methodological_abstraction"}, {"score": 0.0032176163279340206, "phrase": "great_challenge"}, {"score": 0.0031193028729331667, "phrase": "conceptual_apparatus"}, {"score": 0.0030135741897058844, "phrase": "semiotic_and_socio-interactional_perspectives"}, {"score": 0.002931569771634119, "phrase": "suitable_empirical_research"}, {"score": 0.0029114187110123105, "phrase": "operative_designs"}, {"score": 0.0028914057633212045, "phrase": "ad_hoc_measuring_instruments"}, {"score": 0.0027551040319267446, "phrase": "good_abstract"}, {"score": 0.0026616868981501006, "phrase": "theoretical_baggage"}, {"score": 0.002408265305704217, "phrase": "quality_abstract"}, {"score": 0.0023426936553484546, "phrase": "small_map"}, {"score": 0.002302619021497886, "phrase": "document_abstracting"}, {"score": 0.002255431275670053, "phrase": "conceptual_and_methodological_framework"}, {"score": 0.0021416404045850224, "phrase": "communicative_and_interactional_approach"}, {"score": 0.0021049977753042253, "phrase": "new_systematic_framework"}], "paper_keywords": ["Abstracting", " Document management", " Information retrieval", " Research"], "paper_abstract": "Purpose - The aim of this paper is to systemize and improve the scientific status of studies on document abstracting. This is a diachronic, systematic study of document abstracting studies carried out from different perspectives and models (textual, psycholinguistic, social and communicative). Design/methodology/approach - A review of the perspectives and analysis proposals which are of interest to the various theoreticians of abstracting is carried out using a variety of techniques and approaches (cognitive, linguistic, communicative-social, didactic, etc.), each with different levels of theoretical and methodological abstraction and degrees of application. The most significant contributions of each are reviewed and highlighted, along with their limitations. Findings - It is found that the great challenge in abstracting is the systemization of models and conceptual apparatus, which open up this type of research to semiotic and socio-interactional perspectives. It is necessary to carry out suitable empirical research with operative designs and ad hoc measuring instruments which can measure the efficiency of the abstracting and the efficiency of a good abstract, while at the same time feeding back into the theoretical baggage of this type of study. Such research will have to explain and provide answers to all the elements and variables, which affect the realization and the reception of a quality abstract. Originality/value - The paper provides a small map of the studies on document abstracting. This shows how the conceptual and methodological framework has extended at the same time as the Science of Documentation has been evolving. All the models analysed the communicative and interactional approach are integrated in a new systematic framework.", "paper_title": "Perspectives of studies on document abstracting Towards an integrated view of models and theoretical approaches", "paper_id": "WOS:000282033200006"}