{"auto_keywords": [{"score": 0.04853248031933338, "phrase": "character_education"}, {"score": 0.04439445244220924, "phrase": "moral_and_social_situations"}, {"score": 0.04347083934822724, "phrase": "animated_vignettes"}, {"score": 0.00481495049065317, "phrase": "personally-constructed_animated_vignettes"}, {"score": 0.004583579470330216, "phrase": "improved_moral_thinking"}, {"score": 0.004533685795068016, "phrase": "pro_social_behavior"}, {"score": 0.00441130431691048, "phrase": "effective_method"}, {"score": 0.0038893838564184107, "phrase": "existing_tools"}, {"score": 0.003246173672295418, "phrase": "computational_tool"}, {"score": 0.0026942333853202556, "phrase": "meaningful_vignettes"}, {"score": 0.002175436093794315, "phrase": "similar_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["animation", " character education", " multimedia", " narratives", " vignettes"], "paper_abstract": "Schools are increasingly integrating character education to facilitate improved moral thinking and pro social behavior among students. An effective method for delivering character education is problem solving moral and social situations represented visually as animated vignettes. However, schools are rarely able to use animated vignettes since existing tools do not allow them to be easily created and having them created externally is overly expensive. In this paper, we describe the design, use, and evaluation of a computational tool that enables students to construct their own animated vignettes. By building, sharing, and responding to vignettes, students become engaged in problem solving moral and social situations. Evaluations showed that users are able to build meaningful vignettes, our tool is easy to learn and fun to use, and our tool's multimedia features are often used and well-liked. Educators can download and use our tool while researchers can draw upon our design rationale and lessons learned when building similar tools. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Clover: Connecting technology and character education using personally-constructed animated vignettes", "paper_id": "WOS:000238876500013"}