{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "misuse_case_models"}, {"score": 0.00862995130770555, "phrase": "smcd"}, {"score": 0.0069033200606285604, "phrase": "functional_security_requirements"}, {"score": 0.0044967055264893184, "phrase": "crucial_requirement"}, {"score": 0.004445739135694758, "phrase": "software_systems"}, {"score": 0.004199406257273994, "phrase": "requirements_phase"}, {"score": 0.004081385289516914, "phrase": "misuse_case"}, {"score": 0.0033811403330431897, "phrase": "misuse_case_model"}, {"score": 0.0032860401904845522, "phrase": "downstream_development_efforts"}, {"score": 0.003193606324727067, "phrase": "undesired_attribute"}, {"score": 0.002931569771634119, "phrase": "controlled_experiment"}, {"score": 0.0026003455833291124, "phrase": "structured_misuse_case_descriptions"}, {"score": 0.002216054733102974, "phrase": "consistency_levels"}, {"score": 0.0021784009230363627, "phrase": "developed_misuse_case_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Misuse cases", " Subject-based experiment", " SMCD"], "paper_abstract": "Security is a crucial requirement in software systems which need to be addressed as early as the requirements phase. The technique of misuse case modeling has been introduced slightly over a decade ago to elicit and specify functional security requirements. Development efforts downstream will be driven by the functional security requirements specified in misuse case models. Consequently, the quality of a misuse case model influences the effectiveness of downstream development efforts. Inconsistencies are an undesired attribute that can severely reduce the quality of misuse case models. In this paper, a controlled experiment involving students is presented which evaluates the reduction of inconsistencies in misuse case models resulting from utilizing a structure called SMCD (Structured Misuse Case Descriptions). The experiment also examines the impact of using SMCD upon other quality attributes of misuse case models. The results of the experiment indicate that using SMCD improves the consistency levels of the developed misuse case models. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Using SMCD to reduce inconsistencies in misuse case models: A subject-based empirical evaluation", "paper_id": "WOS:000329273400008"}