{"auto_keywords": [{"score": 0.04960202571834175, "phrase": "inter-domain_handover"}, {"score": 0.01040317395438002, "phrase": "ietf"}, {"score": 0.007192559035187468, "phrase": "multicast_server"}, {"score": 0.004511485198940203, "phrase": "ip_network"}, {"score": 0.004334280585565239, "phrase": "intra-domain_handover"}, {"score": 0.0038239757564863057, "phrase": "previously_proposed_method"}, {"score": 0.003424677513304057, "phrase": "new_method"}, {"score": 0.002946494813590116, "phrase": "mn"}, {"score": 0.0027602925235474317, "phrase": "ip_service"}, {"score": 0.0026252106881752067, "phrase": "previous_application"}, {"score": 0.0025219085140220773, "phrase": "lower_latency_intra-domain_handover"}, {"score": 0.002398464540102246, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["PMIPv6", " MIPv6", " Handover", " Intra-domain", " Inter-domain"], "paper_abstract": "IETF has proposed the use of PMIPv6 in the IP network in order to reduce the latency of intra-domain handover and to enable handover in the Mobile Node (MN). However, since PMIPv6 does not support inter-domain handover, IETF is considering the use of the previously proposed method, MIPv6, for inter-domain handover (Giaretta et al., 2010) [4]. This paper proposes a new method of enabling inter-domain handover with just PMIPv6 by adding a multicast server to it. Adding the multicast server keeps the L4 connection in both intra and inter-domains and supports the handover of MN, which originally is not supported. Also, it enables the IP service to remain connected anywhere without having to modify the previous application. In addition, this method allows lower latency intra-domain handover than MIPv6. To prove the effectiveness of this proposed method, the comparison between the performance of PMIPv6 and MIPv6 for the intra-domain and inter-domain is shown in this paper. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Multicast based Proxy Mobile IPv6 for inter-domain handover", "paper_id": "WOS:000318915800026"}