{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "classification_rules"}, {"score": 0.00797360988908546, "phrase": "new_framework"}, {"score": 0.004772593750252861, "phrase": "rule_induction"}, {"score": 0.004688989566904871, "phrase": "great_deal"}, {"score": 0.004606843145343611, "phrase": "machine_learning_and_data_mining"}, {"score": 0.004106725110985659, "phrase": "ultimate_user"}, {"score": 0.0033955105098235345, "phrase": "large_set"}, {"score": 0.0032485526269852606, "phrase": "\"unsatisfactory_situation"}, {"score": 0.003121719509312159, "phrase": "appropriate_actions"}, {"score": 0.002733539375462443, "phrase": "action_recommendations"}, {"score": 0.002697474061842142, "phrase": "complex_notions"}, {"score": 0.002535344521369057, "phrase": "environmental_application"}, {"score": 0.0023307492812556204, "phrase": "stream-water_quality"}, {"score": 0.0021049977753042253, "phrase": "real-world_application"}], "paper_keywords": ["Actionability", " Decision support", " Rule-based classifier"], "paper_abstract": "Rule induction has attracted a great deal of attention in Machine Learning and Data Mining. However, generating rules is not an end in itself because their applicability is not straightforward especially when their number is large. Ideally, the ultimate user would like to use these rules to decide which actions to undertake. In the literature, this notion is usually referred to as actionability. We propose a new framework to address actionability. Our goal is to lighten the burden of analyzing a large set of classification rules when the user is confronted to an \"unsatisfactory situation\" and needs help to decide about the appropriate actions to remedy to this situation. The method consists in comparing the situation to a set of classification rules. For this purpose, we propose a new framework for learning action recommendations dealing with complex notions of feasibility and quality of actions. Our approach has been motivated by an environmental application aiming at building a tool to help specialists in charge of the management of a catchment to preserve stream-water quality. The results show the utility of this methodology with regard to enhancing the actionability of a set of classification rules in a real-world application.", "paper_title": "Building actions from classification rules", "paper_id": "WOS:000313714100002"}