{"auto_keywords": [{"score": 0.004775531918452571, "phrase": "peer-to-peer_networks"}, {"score": 0.004564401713056939, "phrase": "maintenance_strategy"}, {"score": 0.004471530397729526, "phrase": "key_factor"}, {"score": 0.004434910775034831, "phrase": "structured_peer-to-peer_networks"}, {"score": 0.004152502093643003, "phrase": "static_and_quasi-static_networks"}, {"score": 0.004067977399245212, "phrase": "good_performance"}, {"score": 0.004034649282040889, "phrase": "dynamic_network_environments"}, {"score": 0.003968806706727518, "phrase": "open_question"}, {"score": 0.0037159680715717056, "phrase": "inherent_difference"}, {"score": 0.003479180627368156, "phrase": "dual_strategy"}, {"score": 0.0034364867143322304, "phrase": "routing_overlays"}, {"score": 0.0030247625535682987, "phrase": "maintenance_overhead"}, {"score": 0.002999955539996569, "phrase": "large_networks"}, {"score": 0.0029753513692467315, "phrase": "high_churn_rates"}, {"score": 0.002938821840519756, "phrase": "routing_performance"}, {"score": 0.002890810475014827, "phrase": "kleinberg's_small_worlds_model"}, {"score": 0.0026953359825383624, "phrase": "markov_chain_model"}, {"score": 0.0025027144548626975, "phrase": "system's_size"}, {"score": 0.0024116163689723354, "phrase": "maintenance_traffic"}, {"score": 0.0022670785913397637, "phrase": "maintenance_behaviour"}], "paper_keywords": ["peer-to-peer routing", " overlay", " \"small-worlds\" network", " stochastic maintenance", " Poisson process"], "paper_abstract": "Peer-to-peer networks have widespread and got commonly used in our every day life. The maintenance strategy of overlays is a key factor in structured peer-to-peer networks. Most of these routing overlays scale well even for a very large number of nodes in static and quasi-static networks. However, providing good performance in dynamic network environments is still an open question. We analyse maintenance of routing overlays in structured P2P systems under churn. We exploit the inherent difference in the role of local (short-range) and long-range connections. We propose a dual strategy for the routing overlays: (i) we reuse strict, proactive and self-stabilizing short-range connection maintenance and (ii) we define a novel, loose and stochastic long-range connection maintenance mechanism, which can significantly reduce maintenance overhead in large networks with high churn rates without affecting routing performance. We use Kleinberg's small worlds model to describe and (re)construct long-range connections. We formally describe the evolution of our proposed system under churn by a Markov chain model and we derive its steady state maintenance traffic (overhead). We formally show that our maintenance method scales logarithmically with the system's size, which is the theoretical lower bound for maintenance traffic to ensure connectivity of the network. Finally, we numerically analyse overlay and maintenance behaviour using various protocol parameter settings and conclude that an overlay with our maintenance method is stable at very high levels of churn. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Stochastic maintenance of overlays in structured P2P systems", "paper_id": "WOS:000258464100014"}