{"auto_keywords": [{"score": 0.045563865001511814, "phrase": "master_type"}, {"score": 0.03660745570085101, "phrase": "beneficial_mutations"}, {"score": 0.032947107477147845, "phrase": "steady_state"}, {"score": 0.00481495049065317, "phrase": "quasi-species_model"}, {"score": 0.004674402456361649, "phrase": "eigen's_quasi-species_model"}, {"score": 0.00458297991625839, "phrase": "different_mutants"}, {"score": 0.004537938301016805, "phrase": "high_fitness_\"master"}, {"score": 0.004405440436639404, "phrase": "lower_fitness"}, {"score": 0.004179328666330398, "phrase": "mutation_rate"}, {"score": 0.003977858136481356, "phrase": "wide_range"}, {"score": 0.003951736710391294, "phrase": "mutant_types"}, {"score": 0.0038236703468417215, "phrase": "so-called_\"error_catastrophe"}, {"score": 0.003651294258881569, "phrase": "huge_amounts"}, {"score": 0.0035562929339427803, "phrase": "important_consequence"}, {"score": 0.0031792617363515948, "phrase": "error_catastrophe"}, {"score": 0.003158367829177805, "phrase": "eigen's_model"}, {"score": 0.003076152130543236, "phrase": "viral_population"}, {"score": 0.002704906579783511, "phrase": "small_amount"}, {"score": 0.0026871217010784143, "phrase": "low_fitness_virions"}, {"score": 0.0026171408377811687, "phrase": "initial_regime"}, {"score": 0.0023317365065820554, "phrase": "host_cells"}, {"score": 0.0022045353683203626, "phrase": "viral_infection"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Evolution", " Quasi-species", " Replicator-mutator", " Population dynamics"], "paper_abstract": "Eigen's quasi-species model describes viruses as ensembles of different mutants of a high fitness \"master\" genotype. Mutants are assumed to have lower fitness than the master type, yet they coexist with it forming the quasi-species. When the mutation rate is sufficiently high, the master type no longer survives and gets replaced by a wide range of mutant types, thus destroying the quasi-species. It is the so-called \"error catastrophe\". But natural selection acts on phenotypes, not genotypes, and huge amounts of genotypes yield the same phenotype. An important consequence of this is the appearance of beneficial mutations which increase the fitness of mutants. A model has been recently proposed to describe quasi-species in the presence of beneficial mutations. This model lacks the error catastrophe of Eigen's model and predicts a steady state in which the viral population grows exponentially. Extinction can only occur if the infectivity of the quasi-species is so low that this exponential is negative. In this work I investigate the transient of this model when infection is started from a small amount of low fitness virions. I prove that, beyond an initial regime where viral population decreases (and can go extinct), the growth of the population is super-exponential. Hence this population quickly becomes so huge that selection due to lack of host cells to be infected begins to act before the steady state is reached. This result suggests that viral infection may widespread before the virus has developed its optimal form. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Huge progeny production during the transient of a quasi-species model of viral infection, reproduction and mutation", "paper_id": "WOS:000293269200010"}