{"auto_keywords": [{"score": 0.04874330526858656, "phrase": "elicitation_process"}, {"score": 0.00481495049065317, "phrase": "explicit_preference_elicitation"}, {"score": 0.004707188147442449, "phrase": "preference_representation"}, {"score": 0.004398094237005956, "phrase": "quantitative_preference_representations"}, {"score": 0.0043362886339595366, "phrase": "users'_mental_preference_models"}, {"score": 0.003927203683176278, "phrase": "acquired_model"}, {"score": 0.003850121210842558, "phrase": "different_options"}, {"score": 0.003597102547969587, "phrase": "first_experiment"}, {"score": 0.003546513036085932, "phrase": "different_preference_elicitation_methods"}, {"score": 0.0035065523764817143, "phrase": "cognitively_less_demanding_methods"}, {"score": 0.003285333896994258, "phrase": "perceived_effort"}, {"score": 0.0030606302942851027, "phrase": "feedback_mechanism"}, {"score": 0.002916650173868229, "phrase": "second_experiment"}, {"score": 0.002851251547908585, "phrase": "detailed_preference_feedback"}, {"score": 0.0027325449069867222, "phrase": "important_factors"}, {"score": 0.0026788479270073566, "phrase": "affective_feedback"}, {"score": 0.0026411384812121503, "phrase": "finer_grained_one-dimensional_rating_scale"}, {"score": 0.0025819015229390663, "phrase": "third_study"}, {"score": 0.0024814079299143536, "phrase": "participatory_set"}, {"score": 0.002246917304058838, "phrase": "additional_effort"}, {"score": 0.002135068739125385, "phrase": "interface_design"}, {"score": 0.0021229892538028937, "phrase": "preference_elicitation"}, {"score": 0.0021049977753042253, "phrase": "user_view"}], "paper_keywords": ["Preference elicitation", " Constructive preferences", " Interface design"], "paper_abstract": "Two problems may arise when an intelligent (recommender) system elicits users' preferences. First, there may be a mismatch between the quantitative preference representations in most preference models and the users' mental preference models. Giving exact numbers, e.g., such as \"I like 30 days of vacation 2.5 times better than 28 days\" is difficult for people. Second, the elicitation process can greatly influence the acquired model (e.g., people may prefer different options based on whether a choice is represented as a loss or gain). We explored these issues in three studies. In the first experiment we presented users with different preference elicitation methods and found that cognitively less demanding methods were perceived low in effort and high in liking. However, for methods enabling users to be more expressive, the perceived effort was not an indicator of how much the methods were liked. We thus hypothesized that users are willing to spend more effort if the feedback mechanism enables them to be more expressive. We examined this hypothesis in two follow-up studies. In the second experiment, we explored the trade-off between giving detailed preference feedback and effort. We found that familiarity with and opinion about an item are important factors mediating this trade-off. Additionally, affective feedback was preferred over a finer grained one-dimensional rating scale for giving additional detail. In the third study, we explored the influence of the interface on the elicitation process in a participatory set-up. People considered it helpful to be able to explore the link between their interests, preferences and the desirability of outcomes. We also confirmed that people do not want to spend additional effort in cases where it seemed unnecessary. Based on the findings, we propose four design guidelines to foster interface design of preference elicitation from a user view.", "paper_title": "Designing interfaces for explicit preference elicitation: a user-centered investigation of preference representation and elicitation process", "paper_id": "WOS:000305210700003"}