{"auto_keywords": [{"score": 0.047719606869824786, "phrase": "inverse_problem"}, {"score": 0.015577637864277776, "phrase": "semiconductor_devices"}, {"score": 0.00481495049065317, "phrase": "doping_profiles"}, {"score": 0.0047057084749407485, "phrase": "boltzmann-poisson_model"}, {"score": 0.004494570360108983, "phrase": "boltzmann-poisson_system"}, {"score": 0.0039522429946090174, "phrase": "source_function"}, {"score": 0.0038981499110532273, "phrase": "mathematical_model"}, {"score": 0.003555902292752528, "phrase": "unknown_doping_profile_function"}, {"score": 0.003334309053314909, "phrase": "numerical_examples"}, {"score": 0.0031991799574455555, "phrase": "doping_profile"}, {"score": 0.003140888248194296, "phrase": "relatively_accurate_time-dependent_or_time-independent_measurements"}, {"score": 0.00281281200675311, "phrase": "bp"}, {"score": 0.002613163083407071, "phrase": "bp_model"}, {"score": 0.002427732996314194, "phrase": "drift-diffusion-poisson_equation"}, {"score": 0.002276283303864666, "phrase": "measured_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Boltzmann-Poisson system", " Semiconductor devices", " Doping profile", " Inverse problems", " Parameter identification", " Inverse doping", " Drift-diffusion"], "paper_abstract": "We investigate numerically an inverse problem related to the Boltzmann-Poisson system of equations for transport of electrons in semiconductor devices. The objective of the (ill-posed) inverse problem is to recover the doping profile of a device, presented as a source function in the mathematical model, from its current-voltage characteristics. To reduce the degree of ill-posedness of the inverse problem, we proposed to parameterize the unknown doping profile function to limit the number of unknowns in the inverse problem. We showed by numerical examples that the reconstruction of a few low moments of the doping profile is possible when relatively accurate time-dependent or time-independent measurements are available, even though the later reconstruction is less accurate than the former. We also compare reconstructions from the Boltzmann-Poisson (BP) model to those from the classical drift-diffusion-Poisson (DDP) model, assuming that measurements are generated with the BP model. We show that the two type of reconstructions can be significantly different in regimes where drift-diffusion-Poisson equation fails to model the physics accurately. However, when noise presented in measured data is high, no difference in the reconstructions can be observed. (c) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Recovering doping profiles in semiconductor devices with the Boltzmann-Poisson model", "paper_id": "WOS:000289446800008"}