{"auto_keywords": [{"score": 0.035714486002063964, "phrase": "codeguard"}, {"score": 0.016743066234398318, "phrase": "attacker_nodes"}, {"score": 0.010612387000973441, "phrase": "wireless_interflow_network_coding_systems"}, {"score": 0.00857958397949531, "phrase": "pollution_attacks"}, {"score": 0.004724365740062236, "phrase": "data_pollution_attacks"}, {"score": 0.004441517985511521, "phrase": "intraflow_network_coding_systems"}, {"score": 0.004275904315753662, "phrase": "interflow_coding_systems"}, {"score": 0.004136044939878838, "phrase": "interflow_network_coding"}, {"score": 0.0036379729015583975, "phrase": "network_topology"}, {"score": 0.0032149396890830575, "phrase": "efficient_bit-level_traceback"}, {"score": 0.0031693980719538317, "phrase": "novel_cross-examination_technique"}, {"score": 0.0027610089418453614, "phrase": "pollution_attack"}, {"score": 0.0022933216359142736, "phrase": "system_throughput"}, {"score": 0.0022608057001451414, "phrase": "high_level"}, {"score": 0.0021049977753042253, "phrase": "underlying_network_coding_system"}], "paper_keywords": ["Pollution attacks", " wireless networks", " interflow network coding"], "paper_abstract": "We study data pollution attacks in wireless interflow network coding systems. Although several defenses for these attacks are known for intraflow network coding systems, none of them are applicable to interflow coding systems. We formulate a model for interflow network coding that encompasses all the existing systems, and use it to analyze the impact of pollution attacks. Our analysis shows that the effects of pollution attacks depend not only on the network topology, but also on the location and strategy of the attacker nodes. We propose CodeGuard, a reactive attestation-based defense mechanism that uses efficient bit-level traceback and a novel cross-examination technique to unequivocally identify attacker nodes. We analyze the security of CodeGuard and prove that it is always able to identify and isolate at least one attacker node on every occurrence of a pollution attack. We analyze the overhead of CodeGuard and show that the storage, computation, and communication overhead are practical. We experimentally demonstrate that CodeGuard is able to identify attacker nodes quickly (within 500 ms) and restore system throughput to a high level, even in the presence of many attackers, thus preserving the performance of the underlying network coding system.", "paper_title": "Pollution Attacks and Defenses in Wireless Interflow Network Coding Systems", "paper_id": "WOS:000306557900010"}