{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "intelligent_speed_adaptation_device"}, {"score": 0.033375408400206516, "phrase": "usability_study"}, {"score": 0.004611369021812453, "phrase": "ad_hoc_definitions"}, {"score": 0.004229556887896042, "phrase": "steep_learning_curve"}, {"score": 0.003695040819303525, "phrase": "alternative_approach"}, {"score": 0.0034629341517018438, "phrase": "main_usability_literature"}, {"score": 0.003298441494378465, "phrase": "specific_product"}, {"score": 0.002928399649340438, "phrase": "usability_requirements_analysis"}, {"score": 0.0028968858148006823, "phrase": "heuristic_evaluation"}, {"score": 0.0028502479839354637, "phrase": "subjective_analysis"}, {"score": 0.0025578967205807843, "phrase": "context-specific_usability_taxonomy"}, {"score": 0.0023712394008737958, "phrase": "real-world_usability_results"}, {"score": 0.0021049977753042253, "phrase": "study's_taxonomy"}], "paper_keywords": [""], "paper_abstract": "Usability studies are often based on ad hoc definitions of usability. These studies can be difficult to generalize, they might have a steep learning curve, and there is always the danger of being inconsistent with the concept of usability as defined in standards and the literature. This alternative approach involves comprehensive, general-purpose, and hierarchically structured taxonomies that follow closely the main usability literature. These taxonomies are then instantiated for a specific product. To illustrate this approach, a usability study for a prototype of an Intelligent Speed Adaptation device is described. The usability study consists of usability requirements analysis, heuristic evaluation, and subjective analysis, which helped identify problems of clarity, operability, robustness, safety, and aesthetics. As a context-specific usability taxonomy for this particular field of application happened to exist, the way that real-world usability results can be mapped to that taxonomy compared to the taxonomy in this article is examined, with the argument that this study's taxonomy is more complete and generalizable.", "paper_title": "A Taxonomy-Based Usability Study of an Intelligent Speed Adaptation Device", "paper_id": "WOS:000337180300007"}