{"auto_keywords": [{"score": 0.049734762741514144, "phrase": "fuzzy_eer_models"}, {"score": 0.009808216995596912, "phrase": "fuzzy_owl_ontologies"}, {"score": 0.0091613912340198, "phrase": "fuzzy_ontologies"}, {"score": 0.006037878069991874, "phrase": "constructed_fuzzy_ontologies"}, {"score": 0.0044635893862404385, "phrase": "different_sources"}, {"score": 0.0041677440361312604, "phrase": "fuzzy_information"}, {"score": 0.004137778194486206, "phrase": "er"}, {"score": 0.0041079938275505575, "phrase": "extended_entity-relationship"}, {"score": 0.003529880686744397, "phrase": "semantics-preserving_approach"}, {"score": 0.0034918342672996066, "phrase": "automated_tool"}, {"score": 0.003190265467214105, "phrase": "fuzzy_owl_language"}, {"score": 0.0031331419276289306, "phrase": "fuzzy_extension"}, {"score": 0.0025405463228033486, "phrase": "semantics_preservation"}, {"score": 0.002468107263634476, "phrase": "detailed_transformation_example"}, {"score": 0.002406415352892016, "phrase": "prototype_tool"}, {"score": 0.002222365485177405, "phrase": "constructed_fuzzy_owl_ontologies"}, {"score": 0.0021825348057711628, "phrase": "reasoning_approach"}, {"score": 0.002151183757599893, "phrase": "reasoning_example"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fuzzy OWL ontology", " Construction", " Fuzzy EER model", " Reasoning"], "paper_abstract": "Currently, many research studies have been concentrated on construction of fuzzy ontologies from different sources. Over the years, standard and variations of the entity-relationship (ER) model has widespread use, and also some approaches have been proposed for modeling fuzzy information in ER and extended entity-relationship (EER) models. Therefore,constructing fuzzy ontologies from fuzzy EER models may be valuable to the development of fuzzy ontologies, and in turn the constructed fuzzy ontologies may be useful for reasoning about the fuzzy EER models. In this paper, we develop a semantics-preserving approach and an automated tool for constructing fuzzy ontologies from fuzzy EER models, and investigate how to apply the constructed fuzzy ontologies to reason on fuzzy EER models. The constructed fuzzy ontologies are represented by the fuzzy OWL language, which is a fuzzy extension of the W3C recommendation standard ontology language OWL (Web Ontology Language). Firstly, we give the formalization of fuzzy EER models. On this basis, we propose an approach for constructing fuzzy OWL ontologies from fuzzy EER models, which can transform fuzzy EER models (including the structure and instance information of fuzzy EER models) into fuzzy OWL ontologies. Also, we give the proof for the semantics preservation of the transformation, and provide a detailed transformation example. Furthermore, we implement a prototype tool FEER2FOnto, which can automatically construct fuzzy OWL ontologies from fuzzy EER models. Finally, we investigate how to reason on fuzzy EER models with the constructed fuzzy OWL ontologies, and propose the reasoning approach and provide a reasoning example. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Construction of fuzzy OWL ontologies from fuzzy EER models: A semantics-preserving approach", "paper_id": "WOS:000324012200001"}