{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "privacy_risks"}, {"score": 0.0047026237903774895, "phrase": "personalization-based_systems"}, {"score": 0.004565876339189493, "phrase": "powerful_tools"}, {"score": 0.004459334186889869, "phrase": "user_experience"}, {"score": 0.00438105507792004, "phrase": "wide_variety"}, {"score": 0.004154332348800334, "phrase": "new_privacy_concerns"}, {"score": 0.00387011040370557, "phrase": "physical_location"}, {"score": 0.0036914757355166966, "phrase": "user's_friends'_search_history"}, {"score": 0.003500313767208306, "phrase": "wide_adoption"}, {"score": 0.003459191419478298, "phrase": "personalization_technologies"}, {"score": 0.002931569771634119, "phrase": "user_attitudes"}, {"score": 0.0021682027434117095, "phrase": "privacy_challenges"}, {"score": 0.0021049977753042253, "phrase": "personalization_systems"}], "paper_keywords": ["Privacy", " Personalization", " Human-computer interaction", " Social networks", " E-commerce", " Location-based services"], "paper_abstract": "Personalization technologies offer powerful tools for enhancing the user experience in a wide variety of systems, but at the same time raise new privacy concerns. For example, systems that personalize advertisements according to the physical location of the user or according to the user's friends' search history, introduce new privacy risks that may discourage wide adoption of personalization technologies. This article analyzes the privacy risks associated with several current and prominent personalization trends, namely social-based personalization, behavioral profiling, and location-based personalization. We survey user attitudes towards privacy and personalization, as well as technologies that can help reduce privacy risks. We conclude with a discussion that frames risks and technical solutions in the intersection between personalization and privacy, as well as areas for further investigation. This frameworks can help designers and researchers to contextualize privacy challenges of solutions when designing personalization systems.", "paper_title": "Personalization and privacy: a survey of privacy risks and remedies in personalization-based systems", "paper_id": "WOS:000302477200009"}