{"auto_keywords": [{"score": 0.01194569643275137, "phrase": "sequential_grid_layout"}, {"score": 0.007740489563401459, "phrase": "temporal_and_color-based_coherences"}, {"score": 0.006835965105344126, "phrase": "mouse_interactions"}, {"score": 0.0064872712056736745, "phrase": "photo_visualization_system"}, {"score": 0.004690305164360866, "phrase": "scrollable_view"}, {"score": 0.004583878086896926, "phrase": "photo_thumbnails"}, {"score": 0.004539005582217309, "phrase": "default_order"}, {"score": 0.00433531459712787, "phrase": "photo_layout"}, {"score": 0.004113764618891061, "phrase": "space_efficiency"}, {"score": 0.003703611021999795, "phrase": "similar_photos"}, {"score": 0.0036553070575015344, "phrase": "color_histogram"}, {"score": 0.003334309053314909, "phrase": "similar_feelings"}, {"score": 0.0032160319265621285, "phrase": "hierarchical_clustering_method"}, {"score": 0.0030314419455512013, "phrase": "small_groups"}, {"score": 0.0029238768315330305, "phrase": "representative_photo"}, {"score": 0.0028293966058473476, "phrase": "summarized_view"}, {"score": 0.0028108690791085536, "phrase": "multiple_photos"}, {"score": 0.0027289810731258865, "phrase": "seven_experiments"}, {"score": 0.0025977542995083646, "phrase": "computational_evaluations"}, {"score": 0.002538687900036229, "phrase": "temporal_stability"}, {"score": 0.0025220591847502356, "phrase": "color-based_consistency"}, {"score": 0.0024485643104830814, "phrase": "cluster_similarity"}, {"score": 0.002233301265743633, "phrase": "subjective_human_perspective"}], "paper_keywords": ["Photo management", " Photo clustering", " Photo visualization", " EXIF"], "paper_abstract": "Most photograph management systems use a scrollable view based on a sequential grid layout that arranges photo thumbnails in some default order on the screen. Although users are very accustomed to this kind of photo layout, multiple drag and drop mouse interactions are required to search and obtain an overview of their photos. This paper describes a photo visualization system that visualizes hundreds of photos on a 2D grid space in order to help users manage their photos(.) Our system provides the following three main functions. First, it places similar photos in terms of color histogram and shoot time close together on the grid. Therefore, users can find their photos using temporal and color-based coherences relating to human sensory information such as colors that invokes similar feelings and photo shoot time. Second, our system provides a hierarchical clustering method based on a 2D grid space. This function can decrease drag and drop mouse interactions when classifying photos into small groups compared to the sequential grid layout. Finally, our system displays a representative photo from each cluster, in order to provide a summarized view of multiple photos. For evaluation of our system, we conducted seven experiments consisting of four computational and three subjective evaluations making a comparison with a sequential grid layout. The computational evaluations consider the four features of space efficiency, temporal stability and color-based consistency between neighbor photos of the grid, and cluster similarity. The evaluations establish that our system can decrease space efficiency while improving the other features. The three subjective evaluations deal with our system's ease-of-use from a subjective human perspective. Most people that participated in our experiments found that this photo visualization system was quite suited to finding and summarizing their photo content.", "paper_title": "A hierarchical photo visualization system emphasizing temporal and color-based coherences", "paper_id": "WOS:000309861700002"}