{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "local_government_decision_makers"}, {"score": 0.004764648644792333, "phrase": "integration_technologies"}, {"score": 0.004633052743252902, "phrase": "innovative_and_revolutionary_integration_technologies"}, {"score": 0.004505074966056871, "phrase": "local_government_authorities"}, {"score": 0.004229847379280629, "phrase": "serious_investment"}, {"score": 0.004027412633636142, "phrase": "integration_problems"}, {"score": 0.00379452936798156, "phrase": "electronic_government"}, {"score": 0.0034640450599342488, "phrase": "earlier_research"}, {"score": 0.0034038593017883295, "phrase": "inttech"}, {"score": 0.0033447157263095223, "phrase": "e.g._pressure"}, {"score": 0.0029792474431139067, "phrase": "highly_considered_phenomenon"}, {"score": 0.0029172107428045964, "phrase": "organisation's_operations"}, {"score": 0.0028564621282167685, "phrase": "individual's_attitudes"}, {"score": 0.0028068030356445894, "phrase": "surrounding_context"}, {"score": 0.0027100527874262446, "phrase": "empirical_evidence"}, {"score": 0.0025801648787263662, "phrase": "decision_makers"}, {"score": 0.002447882520797866, "phrase": "risky_decisions"}, {"score": 0.0022032718573953922, "phrase": "top_management's_decision-making_process"}, {"score": 0.002149799391146313, "phrase": "lgas'_operational_reforms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Individual", " Decision", " Organisation", " Integration technologies", " Adoption", " Local government authorities", " LGA", " Decision-making process"], "paper_abstract": "The emergence of innovative and revolutionary Integration Technologies (IntTech) has highly influenced the local government authorities (LGAs) in their decision-making process. LGAs that plan to adopt such IntTech may consider this as a serious investment. Advocates, however, claim that such IntTech have emerged to overcome the integration problems at all levels (e.g. data, object and process). With the emergence of electronic government (e-Government), LGAs have turned to IntTech to fully automate and offer their services on-line and integrate their IT infrastructures. While earlier research on the adoption of IntTech has considered several factors (e.g. pressure, technological, support, and financial), inadequate attention and resources have been applied in systematically investigating the individual, decision and organisational context factors, influencing top management's decisions for adopting IntTech in LGAs. It is a highly considered phenomenon that the success of an organisation's operations relies heavily on understanding an individual's attitudes and behaviours, the surrounding context and the type of decisions taken. Based on empirical evidence gathered through two intensive case studies, this paper attempts to investigate the factors that influence decision makers while adopting IntTech. The findings illustrate two different doctrines one inclined and receptive towards taking risky decisions, the other disinclined. Several underlying rationales can be attributed to such mind-sets in LGAs. The authors aim to contribute to the body of knowledge by exploring the factors influencing top management's decision-making process while adopting IntTech vital for facilitating LGAs' operational reforms. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Investigating factors influencing local government decision makers while adopting integration technologies (IntTech)", "paper_id": "WOS:000350181800001"}