{"auto_keywords": [{"score": 0.04792179493631917, "phrase": "institutional_fact"}, {"score": 0.017640663471241005, "phrase": "false_beliefs"}, {"score": 0.009305858059441409, "phrase": "relevant_attitude"}, {"score": 0.00481495049065317, "phrase": "recent_accounts"}, {"score": 0.004785466029391189, "phrase": "institutional_and_social_facts"}, {"score": 0.004091432545219401, "phrase": "institutional_terms"}, {"score": 0.0038474874533431977, "phrase": "new_facts"}, {"score": 0.0035084732022668654, "phrase": "sentence_p"}, {"score": 0.0033709718729037943, "phrase": "relevant_group"}, {"score": 0.0030927866759789045, "phrase": "required_attitude"}, {"score": 0.002908210365588114, "phrase": "false_reasons"}, {"score": 0.0027011613811219323, "phrase": "performativity_thesis"}, {"score": 0.0022525395705281083, "phrase": "factual_belief"}, {"score": 0.002224966726830651, "phrase": "last_part"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["institutional facts", " social ontology", " searle"], "paper_abstract": "Recent accounts of institutional and social facts share at least three theses. (1) Performativity: a shared attitude of certain type towards an institutional fact may contribute to the truth of a sentence describing the fact. ( 2) Reflexivity: if a sentence describing an institutional fact is true, the relevant attitude is present. (3) Qualified realism: institutional terms refer to entities and properties that exist. The problem discussed in this paper is the following: can new facts and things of this type emerge in a group without at least some of its members having some false beliefs about those facts? Thesis (2) states that a sentence p describing an institutional fact can be true only if the members of the relevant group have the relevant attitude at time t (typically, they at least believe that p is true). But if they do not already hold the required attitude before t, how can they correctly form it at time t? They may form the belief for false reasons: they may, for example, form the belief that p has always been true. And then, according to the Performativity Thesis (1), p may become true. But it seems that they need some false beliefs in order to begun the process of creating the institutional fact. The idea that the emergence of new social/institutional facts requires false beliefs is disturbing. But, perhaps, the attitude needed in Thesis (1) should not be analysed as a factual belief. In the last part of the article the notion of recognition is offered as an alternative. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Institutional facts, performativity and false beliefs", "paper_id": "WOS:000242626300015"}