{"auto_keywords": [{"score": 0.04776606071215513, "phrase": "mobile_work"}, {"score": 0.00481495049065317, "phrase": "mobile_spaces"}, {"score": 0.004651057147690674, "phrase": "train_travel"}, {"score": 0.004296998284839309, "phrase": "specific_context"}, {"score": 0.004130165601475531, "phrase": "current_study"}, {"score": 0.003989487818395848, "phrase": "onboard_trains"}, {"score": 0.003853583126988071, "phrase": "general_issues"}, {"score": 0.0036133077234252633, "phrase": "mobile_work_oil"}, {"score": 0.003421697038352743, "phrase": "reliable_communications_network"}, {"score": 0.003176626803985225, "phrase": "communicative_tasks"}, {"score": 0.0026973310437053573, "phrase": "technological_task"}, {"score": 0.002670719148310961, "phrase": "contextual_adaptations"}, {"score": 0.002516457934208144, "phrase": "socially_interdependent_work"}, {"score": 0.0021259846592569386, "phrase": "technology_design"}], "paper_keywords": ["Mobile work", " Mobile technologies", " Adaptation", " Train travel"], "paper_abstract": "Whilst mobile work is increasingly prevalent, there is little detailed study of this phenomenon in the specific context of a train. Thus. the current study focuses on how mobile work is conducted onboard trains. as a way of exploring general issues relating to mobility. Through survey and interview data, several constraints to mobile work oil the train were revealed. These include the lack of reliable communications network, access to co-workers and lack of privacy which together restrict the types of communicative tasks people carry Out. We found that the majority of tasks conducted were socially independent in nature (without the need for communication with others). However, people made some technological task and contextual adaptations which allowed them to work around these limitations to conduct some socially interdependent work (with the need for communication with others). We explain why and how specific technologies/media are used (and adapted) in this setting and explore the implications this has for technology design and Our thinking about mobile work. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Mobile technologies in mobile spaces: Findings from the context of train travel", "paper_id": "WOS:000261278100006"}