{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "teaching_blogs"}, {"score": 0.02277234663612144, "phrase": "perceived_voluntariness"}, {"score": 0.015123554449178593, "phrase": "perceived_usefulness"}, {"score": 0.007917963222252841, "phrase": "intention_usage_relationship"}, {"score": 0.00652839816469572, "phrase": "continuance_intention"}, {"score": 0.006096750296908364, "phrase": "continued_usage"}, {"score": 0.004318422955036175, "phrase": "teachers'_ongoing_participation"}, {"score": 0.004232232993872917, "phrase": "limited_research"}, {"score": 0.004016072233242585, "phrase": "teachers'_continued_usage"}, {"score": 0.0038417798012011155, "phrase": "underlying_reasons"}, {"score": 0.003765067028482197, "phrase": "bhattacherjee's_expectation_confirmation_model"}, {"score": 0.003558294449586273, "phrase": "longitudinal_data"}, {"score": 0.003487222504700868, "phrase": "survey_questionnaire"}, {"score": 0.0032559935867182035, "phrase": "structural_models"}, {"score": 0.0031398318568608505, "phrase": "direct_effect"}, {"score": 0.002524688179363081, "phrase": "higher_level"}, {"score": 0.0021917966722180132, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human-computer interface", " Learning communities", " Secondary education", " Teaching/learning strategies"], "paper_abstract": "The importance of teaching blogs motivates schools to adopt them. The value realized from these teaching blogs depends on teachers' ongoing participation and contribution, but limited research explains why teachers continue to use teaching blogs after their initial adoption. To promote teachers' continued usage of teaching blogs, it is important to know the underlying reasons. This study extended Bhattacherjee's expectation confirmation model by adding two moderating effects (perceived voluntariness and habit) on the intention usage relationship. Longitudinal data were collected from a survey questionnaire completed by 195 Taiwanese senior and vocational school teachers. The partial least squares model was used to test the measurement and structural models. The results indicate that confirmation has a direct effect on perceived usefulness, while satisfaction is jointly determined by perceived usefulness and confirmation. The continuance intention of teaching blogs is jointly determined by satisfaction and perceived usefulness, with 34% variance explained. The continued usage of teaching blogs is jointly determined by perceived voluntariness and habit, with 42% variance explained. The results also show that a higher level of perceived voluntariness for teaching blogs increases the effect of continuance intention on continued usage. However, habit does not moderate the intention usage relationship. The implications for theory and practice, as well as suggestions for future research, are also discussed. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Why do teachers continue to use teaching blogs? The roles of perceived voluntariness and habit", "paper_id": "WOS:000349723200020"}