{"auto_keywords": [{"score": 0.032745627884517375, "phrase": "vertical_bar"}, {"score": 0.006387378433330178, "phrase": "antimorphic_involution_theta"}, {"score": 0.004742731847462945, "phrase": "watson-crick"}, {"score": 0.004475736220464172, "phrase": "classical_notions"}, {"score": 0.00404686025077383, "phrase": "sigma"}, {"score": 0.003935892934907777, "phrase": "wk-complementarity_being"}, {"score": 0.0037707671704262217, "phrase": "u_u"}, {"score": 0.0034435227255605787, "phrase": "fine_and_wilf's_theorem"}, {"score": 0.0032249300977069345, "phrase": "common_prefix"}, {"score": 0.0029973957125353306, "phrase": "vertical_bar_-_gcd"}, {"score": 0.002764856305713066, "phrase": "improved_bound_b"}, {"score": 0.0021049977753042253, "phrase": "sturmian_words"}], "paper_keywords": ["(extended) Fine and Wilf's theorem", " pseudo-primitivity", " antimorphic involution", " optimal bound", " Sturmian word"], "paper_abstract": "Considering two DNA molecules which are Watson-Crick (WK) complementary to each other \"equivalent\" with respect to the information they encode enables us to extend the classical notions of repetition, period, and power. WK-complementarity has been modelled mathematically by an antimorphic involution theta, i.e., a function theta such that theta( xy) = theta(y)theta(x) for any x, y is an element of Sigma*, and theta(2) is the identity. The WK-complementarity being thus modelled, any word which is a repetition of u and theta(u) such as u u, u theta(u)u, and u theta(u)theta(u)theta(u) can be regarded repetitive in this sense, and hence, called a theta-power of u. Taking the notion of theta-power into account, the Fine and Wilf's theorem was extended as \"given an antimorphic involution theta and words u, v, if a theta-power of u and a theta-power of v have a common prefix of length at least b (vertical bar u vertical bar, vertical bar v vertical bar) = 2 vertical bar u vertical bar + vertical bar v vertical bar - gcd (vertical bar u vertical bar, vertical bar v vertical bar), then u and v are theta-powers of a same word.\" In this paper, we obtain an improved bound b' (vertical bar u vertical bar, vertical bar v vertical bar) = b (vertical bar u vertical bar, vertical bar v vertical bar) -[gcd (vertical bar u vertical bar, vertical bar v vertical bar)/2.. Then we show all the cases when this bound is optimal by providing all the pairs of words (u,v) such that they are not theta-powers of a same word, but one can construct a theta-power of u and a theta-power of v whose maximal common prefix is of length equal to b'(vertical bar u vertical bar, vertical bar v vertical bar) - 1. Furthermore, we characterize such words in terms of Sturmian words.", "paper_title": "An Improved Bound for an Extension of Fine and Wilf's Theorem and Its Optimality", "paper_id": "WOS:000282465400004"}