{"auto_keywords": [{"score": 0.04573629565804585, "phrase": "one-click_hosting"}, {"score": 0.00481495049065317, "phrase": "effective_peer-to-peer_downloads"}, {"score": 0.0037052054802048707, "phrase": "active_research_area"}, {"score": 0.003622464064512193, "phrase": "coins"}, {"score": 0.0034311578789991363, "phrase": "game_theory"}, {"score": 0.0033544692489307676, "phrase": "cooperative_behavior"}, {"score": 0.003220709449062307, "phrase": "better_quality"}, {"score": 0.0031203609829058587, "phrase": "free-riding_problem"}, {"score": 0.0029959082125682918, "phrase": "\"responsiveness_bonus"}, {"score": 0.0029289191071848403, "phrase": "overall_contribution"}, {"score": 0.0027741761880779535, "phrase": "game_theory_utility_concept"}, {"score": 0.002712131567923321, "phrase": "empirical_results"}, {"score": 0.0023571835517819124, "phrase": "download_time"}, {"score": 0.0022427071130840647, "phrase": "self-interested_strategies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Peer-to-Peer", " Coalition", " Game theory", " Incentives mechanism"], "paper_abstract": "Although the proportion of Peer-to-Peer (P2P) traffic has declined in recent years in favor of video streaming and one-click hosting. P2P traffic is predicted to increase in the years to come. Moreover, P2P principles can be applied to improve both, video streaming and one-click hosting, so. P2P is going to continue to be an active research area. This paper presents COINS, a new coalition-formation and incentive mechanism based on game theory. This mechanism encourages cooperative behavior, since contributing peers receive in return a better quality of service, whilst preventing the free-riding problem. To achieve this, we define a \"Responsiveness bonus\" that reflects the overall contribution of the peer to the system, and we use the game theory utility concept to calculate it. Empirical results, obtained through simulations, show the ability of the coalitions to effectively stop free-riding and promote contribution, increasing the performance of the P2P network and obtaining an improvement in download time. In addition, we prove that users that pursue self-interested strategies, and that contribute, benefit the system. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "COINS: COalitions and INcentiveS for effective Peer-to-Peer downloads", "paper_id": "WOS:000312683300044"}