{"auto_keywords": [{"score": 0.048811828059843985, "phrase": "partial_reference_alignments"}, {"score": 0.03771465750530587, "phrase": "domain_knowledge"}, {"score": 0.031930046038106896, "phrase": "ontology_network"}, {"score": 0.00481495049065317, "phrase": "-a_structure"}, {"score": 0.0044426140044122545, "phrase": "semantically-enabled_applications"}, {"score": 0.004077005481951783, "phrase": "current_work"}, {"score": 0.003990385737207714, "phrase": "semantic_defects"}, {"score": 0.0037213333316218522, "phrase": "severe_defects"}, {"score": 0.0033602844686125375, "phrase": "missing_structural_relations"}, {"score": 0.003306559295382181, "phrase": "-a_hierarchy"}, {"score": 0.00323625520042892, "phrase": "fundamental_kind"}, {"score": 0.0025409639091476363, "phrase": "possible_repairing_actions"}, {"score": 0.0022818671653408278, "phrase": "implemented_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ontologies", " Ontology engineering", " Ontology debugging"], "paper_abstract": "With the proliferation of ontologies and their use in semantically-enabled applications, the issue of finding and repairing defects in ontologies has become increasingly important. Current work mostly targets debugging semantic defects in ontologies. In our work, we focus on another kind of severe defects, modeling defects, which require domain knowledge to detect and resolve. In particular, we debug the missing structural relations (is-a hierarchy) in a fundamental kind of ontologies, i.e. taxonomies. The context of our study is an ontology network consisting of several taxonomies networked by partial reference alignments. We use the ontology network as domain knowledge to detect the missing is-a relations in these ontologies. We also propose algorithms to generate possible repairing actions, rank missing is-a relations, recommend and execute repairing actions. Further, we discuss an implemented system RepOSE and experiments on ontologies of the Ontology Alignment Evaluation Initiative and the Finnish Ontology Library Service. (c) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Debugging the missing is-a structure within taxonomies networked by partial reference alignments", "paper_id": "WOS:000320353700010"}