{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "energy_savings"}, {"score": 0.02574442147377712, "phrase": "adaptive_behavior"}, {"score": 0.0047517225918491226, "phrase": "smart_street_lighting"}, {"score": 0.00462773520532301, "phrase": "adaptive_control_system"}, {"score": 0.004536862734384202, "phrase": "driving_force"}, {"score": 0.004447766706144458, "phrase": "smart_city_initiative"}, {"score": 0.003794954883650141, "phrase": "apparently_competing_goals"}, {"score": 0.0031739835218110015, "phrase": "smart_lighting"}, {"score": 0.002951045605925464, "phrase": "intelligent_street_light_control_system"}, {"score": 0.0028930017387859804, "phrase": "adaptive_behavior_rules"}, {"score": 0.002689746491842271, "phrase": "wireless_sensor_networks"}, {"score": 0.0025173564697303836, "phrase": "precise_simulation"}, {"score": 0.0022196020509093694, "phrase": "lighting_system"}], "paper_keywords": [""], "paper_abstract": "The driving force behind the smart city initiative is to offer better, more specialized services which can improve the quality of life of the citizens while promoting sustainability. To achieve both of these apparently competing goals, services must be increasingly autonomous and continuously adaptive to changes in their environment and the information coming from other services. In this paper we focus on smart lighting, a relevant application domain for which we propose an intelligent street light control system based on adaptive behavior rules. We evaluate our approach by using a simulator which combines wireless sensor networks and belief-desire-intention (BDI) agents to enable a precise simulation of both the city infrastructure and the adaptive behavior that it implements. The results reveal energy savings of close to 35% when the lighting system implements an adaptive behavior as opposed to a rigid, predefined behavior.", "paper_title": "Estimating Energy Savings in Smart Street Lighting by Using an Adaptive Control System", "paper_id": "WOS:000336178000001"}