{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "information_literacy_skills"}, {"score": 0.011371198359510814, "phrase": "environmental_scanning"}, {"score": 0.004634799977448855, "phrase": "business_environment"}, {"score": 0.004399566471767846, "phrase": "information_literacy"}, {"score": 0.004321772629297024, "phrase": "systematic_way"}, {"score": 0.004055511503825102, "phrase": "adaptive_strategies"}, {"score": 0.00378145978325955, "phrase": "effective_and_efficient_environmental_scanning_activities"}, {"score": 0.003663067281537946, "phrase": "information_intensive_process"}, {"score": 0.003503497128638099, "phrase": "information_technology"}, {"score": 0.0031242709509664806, "phrase": "higher_requirements"}, {"score": 0.0030071857666598193, "phrase": "environmental_information"}, {"score": 0.002548331088496964, "phrase": "specific_business_management_activity"}, {"score": 0.0023758843175179702, "phrase": "real_business_applications"}, {"score": 0.0021870332034407817, "phrase": "refined_model"}, {"score": 0.0021049977753042253, "phrase": "environmental_uncertainty"}], "paper_keywords": ["environmental scanning", " information literacy"], "paper_abstract": "The business environment is increasingly becoming uncertain and complex. Environmental scanning is a systematic way for organizations to detect changes, and hence formulate adaptive strategies for coping with uncertainties. Information literacy skills are required to conduct effective and efficient environmental scanning activities as it is an information intensive process. Moreover, the development of information technology and telecommunication provides various channels and applications for accessing, processing and distributing information, which also proposes higher requirements of information literacy skills for dealing with environmental information. However, despite the number of studies undertaken to investigate the role of information literacy at the workplace, few have integrated information literacy skills with a specific business management activity or have tried to evaluate the impact of information literacy on real business applications. This paper provides an overview of environmental scanning and information literacy skills. A refined model, showing the relationship between environmental uncertainty, information literacy skills and environmental scanning, is also presented.", "paper_title": "Environmental scanning: An application of information literacy skills at the workplace", "paper_id": "WOS:000285087200004"}