{"auto_keywords": [{"score": 0.04681643026384778, "phrase": "linear_complexity_profile"}, {"score": 0.04624543835729454, "phrase": "correlation_measure"}, {"score": 0.007055186462615184, "phrase": "winterhof"}, {"score": 0.006576212264160482, "phrase": "interleaved_sequence"}, {"score": 0.00481495049065317, "phrase": "interleaved_sequences"}, {"score": 0.004633429997452688, "phrase": "positive_integer"}, {"score": 0.0035399770257915466, "phrase": "first_base_sequence"}, {"score": 0.0034063576796640603, "phrase": "second_base_sequence"}, {"score": 0.0032359856233193504, "phrase": "brandstatter"}, {"score": 0.0026523079380037706, "phrase": "power_correlation_measure"}, {"score": 0.002601797016859288, "phrase": "chen"}, {"score": 0.0024243586247372087, "phrase": "lower_bounds"}], "paper_keywords": ["Interleaved sequences", " linear complexity profile", " correlation measures", " Legendre sequences"], "paper_abstract": "Let m be a positive integer. We study the linear complexity profile and correlation measure of two interleaved m-ary sequences of length s and t, respectively. In the case that s >= 2t or s = t and m is prime we estimate the correlation measure in terms of the correlation measure of the first base sequence and the length of the second base sequence. In this case a relation by Brandstatter and Winterhof immediately implies a lower bound on the linear complexity profile of the interleaved sequence. If m is not a prime, under the same restrictions on s and t, the power correlation measure introduced by Chen and Winterhof takes the role of the correlation measure to obtain lower bounds on the linear complexity profile. Moreover, we show that these restrictions on s and t are necessary, and otherwise the (power) correlation measure can be close to st. However, introducing and estimating the (power) correlation measure with bounded lags we are able to get a lower bound on the linear complexity profile of the interleaved sequence.", "paper_title": "Linear complexity profile and correlation measure of interleaved sequences", "paper_id": "WOS:000364960300009"}