{"auto_keywords": [{"score": 0.02668867276892981, "phrase": "karma"}, {"score": 0.00481495049065317, "phrase": "latest_generation"}, {"score": 0.004776669953449352, "phrase": "www_tools"}, {"score": 0.004701015188740582, "phrase": "web_users"}, {"score": 0.004553265070135597, "phrase": "multiple_sources"}, {"score": 0.004463278123628969, "phrase": "web_application"}, {"score": 0.004153739859461064, "phrase": "widget_paradigm"}, {"score": 0.003912189642066724, "phrase": "desired_application"}, {"score": 0.003684634192576662, "phrase": "programming_concepts"}, {"score": 0.00288736193515505, "phrase": "integration_task"}, {"score": 0.002752075650871066, "phrase": "web_sources"}, {"score": 0.002686821995335494, "phrase": "extracted_data"}, {"score": 0.0021049977753042253, "phrase": "widget-based_approach"}], "paper_keywords": ["Algorithms", " Design", " Human Factors", " Performance", " Mashups", " information integration", " programming by demonstration"], "paper_abstract": "The latest generation of WWW tools and services enables Web users to generate applications that combine content from multiple sources. This type of Web application is referred to as a mashup. Many of the tools for constructing mashups rely on a widget paradigm, where users must select, customize, and connect widgets to build the desired application. While this approach does not require programming, the users must still understand programming concepts to successfully create a mashup. As a result, they are put off by the time, effort, and expertise needed to build a mashup. In this article, we describe our programming-by-demonstration approach to building mashup by example. Instead of requiring a user to select and customize a set of widgets, the user simply demonstrates the integration task by example. Our approach addresses the problems of extracting data from Web sources, cleaning and modeling the extracted data, and integrating the data across sources. We implemented these ideas in a system called Karma, and evaluated Karma on a set of 23 users. The results show that, compared to other mashup construction tools, Karma allows more of the users to successfully build mashups and makes it possible to build these mashups significantly faster compared to using a widget-based approach.", "paper_title": "Building Mashups by Demonstration", "paper_id": "WOS:000293676500005"}