{"auto_keywords": [{"score": 0.046966801547094525, "phrase": "consortia_acquisitions"}, {"score": 0.030192043472300128, "phrase": "member_libraries"}, {"score": 0.0047747348769918, "phrase": "purpose_-_the_purpose"}, {"score": 0.004617187934074393, "phrase": "current_situation"}, {"score": 0.004559451202070545, "phrase": "social_and_economic_benefits"}, {"score": 0.00446481608187988, "phrase": "electronic_resources"}, {"score": 0.0038227112550093863, "phrase": "ebsco"}, {"score": 0.003790751492305239, "phrase": "lexisnexis"}, {"score": 0.0037591618700883425, "phrase": "springer"}, {"score": 0.003650195070580192, "phrase": "electronic_resource_acquisitions"}, {"score": 0.003574364535717202, "phrase": "remarkable_social_and_economic_benefits"}, {"score": 0.0035001037990786727, "phrase": "electronic_collections"}, {"score": 0.0029837589912490026, "phrase": "total_usage"}, {"score": 0.0029463874016490976, "phrase": "south_china_consortia"}, {"score": 0.002743262400544954, "phrase": "big_gaps"}, {"score": 0.002500987934534128, "phrase": "south_china_region_consortia"}, {"score": 0.0024284701569889113, "phrase": "national_consortia"}, {"score": 0.002214070700734403, "phrase": "china"}, {"score": 0.0021049977753042253, "phrase": "electronic_resource_consortia_acquisitions"}], "paper_keywords": ["China", " Purchasing groups", " Academic libraries", " Electronic media", " Benefit-cost ratio"], "paper_abstract": "Purpose - The purpose of this paper is to analyse the current situation and the social and economic benefits from the consortia acquisitions of electronic resources by the China Academic Library and Information System (CALIS) South China Regional Centre and to recommend improvements for consortia acquisitions. Design/methodology/approach - Analyses of price and usage made within the CALIS South China region of databases from a range of suppliers including EBSCO, LexisNexis and Springer are presented. Findings - The electronic resource acquisitions by the CALIS South China Regional Centre have yielded remarkable social and economic benefits as the range of electronic collections has been expanded and enriched, benefits have accrued, money has been saved and it has proved to be of benefit to users; however, there is room for improvement. During the last three years, the total usage of the South China Consortia has increased but the usage of the member libraries in the consortia is unbalanced and there are big gaps among the member libraries. The single download/search cost of the e-resources has been gradually decreasing but the cost of thee-resources purchased by the South China region consortia is higher than that of the national consortia; hence, there is a need for further reductions. Originality/value - The study is the first of its kind ever conducted in China. The findings of this paper will be helpful in improving electronic resource consortia acquisitions in the South China region.", "paper_title": "Regional consortia for e-resources: a case study of deals in the South China Region", "paper_id": "WOS:000285659600004"}