{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_participation"}, {"score": 0.006706275542905535, "phrase": "information_systems_development"}, {"score": 0.005264794434617334, "phrase": "productivity_outcomes"}, {"score": 0.0045726187330434025, "phrase": "research_findings"}, {"score": 0.004290969772225093, "phrase": "classification_scheme"}, {"score": 0.0039005639366468917, "phrase": "isd"}, {"score": 0.003360099446239057, "phrase": "isd_projects"}, {"score": 0.0032355864829403413, "phrase": "broader_management_context"}, {"score": 0.003097043800165555, "phrase": "attitudinal_outcomes"}, {"score": 0.002917604283241353, "phrase": "current_status"}, {"score": 0.0028601252251285, "phrase": "broad_area"}, {"score": 0.0025180781216911246, "phrase": "significantly_improved_isd_outcomes"}, {"score": 0.002478297391121455, "phrase": "different_strategies"}, {"score": 0.0024101837218440834, "phrase": "specific_goals"}, {"score": 0.0023626775529531486, "phrase": "system_acceptance"}, {"score": 0.0023346234464901978, "phrase": "ultimate_goal"}, {"score": 0.0022434880661725493, "phrase": "potential_users"}, {"score": 0.0022168460543913787, "phrase": "productivity_benefits"}, {"score": 0.0021049977753042253, "phrase": "needed_domain_knowledge"}], "paper_keywords": ["information systems development", " meta-analysis", " user participation"], "paper_abstract": "This study synthesizes the research findings of 82 empirical studies on user participation in information systems development (ISD). Various ISD outcomes are addressed using a classification scheme involving two broad categories-attitudinal/ behavioral outcomes and productivity outcomes. The results demonstrate that user participation is minimally-to-moderately beneficial to ISD; its effects are comparatively stronger on attitudinal/behavioral outcomes than on productivity outcomes. This attitudinal/behavioral impact may largely be the result of the emphasis that has been placed on user participation by academics and consultants. The results of this analysis are compared to those of a meta-analysis in the broader management context of participation. The results are similar in terms of attitudinal outcomes, but different, and lesser, in terms of productivity outcomes. Since the current status of research in the broad area of participation is that the effects of participation are considered to be problematic, that status and the results of this study suggest that user participation alone may not be sufficient to achieve significantly improved ISD outcomes, and that different strategies should be employed based on the specific goals of ISD projects. If system acceptance is the ultimate goal, user participation should be designed to induce more psychological involvement among potential users. If productivity benefits are the focus, user participation should be designed to provide developers the needed domain knowledge. In sum, user participation should be treated as one of a number of means for ISD projects to be more successful.", "paper_title": "The Role of User Participation in Information Systems Development: Implications from a Meta-Analysis", "paper_id": "WOS:000258283300012"}