{"auto_keywords": [{"score": 0.042273040832412095, "phrase": "five_institutions"}, {"score": 0.013578288699233606, "phrase": "gwas"}, {"score": 0.013289910648467063, "phrase": "routine_clinical_care"}, {"score": 0.011191210129674512, "phrase": "clinician_review"}, {"score": 0.00481495049065317, "phrase": "diverse_electronic_medical_record_systems"}, {"score": 0.004661116930794176, "phrase": "genome-wide_association_study"}, {"score": 0.0046276016230633495, "phrase": "objective_genome-wide"}, {"score": 0.004512175937946914, "phrase": "high_specificity"}, {"score": 0.004479726755921316, "phrase": "large_numbers"}, {"score": 0.004399616575575586, "phrase": "genotype-phenotype_correlations"}, {"score": 0.004005476499933792, "phrase": "different_electronic_medical_record"}, {"score": 0.0036202697222281373, "phrase": "laboratory_results"}, {"score": 0.0034541965053691307, "phrase": "five_participating_institutions"}, {"score": 0.002760836859397696, "phrase": "subsequent_gwas"}, {"score": 0.0025962638592454974, "phrase": "stringent_criteria"}, {"score": 0.002577557228072987, "phrase": "emr_data"}, {"score": 0.002423882939663573, "phrase": "known_genetic_variant"}, {"score": 0.0023804491500749106, "phrase": "standard_terminologies"}, {"score": 0.002354762471810519, "phrase": "data_elements"}, {"score": 0.0022876085523721324, "phrase": "five_different_institutions"}, {"score": 0.0022547515816852266, "phrase": "robust_numbers"}, {"score": 0.002230418233881411, "phrase": "gwas._conclusions"}, {"score": 0.002198380879018061, "phrase": "commonly_available_data"}, {"score": 0.0021825348057711628, "phrase": "five_different_emr"}, {"score": 0.0021202820950055193, "phrase": "genetic_study"}, {"score": 0.0021049977753042253, "phrase": "multiple_institutions"}], "paper_keywords": [""], "paper_abstract": "Objective Genome-wide association studies (GWAS) require high specificity and large numbers of subjects to identify genotype-phenotype correlations accurately. The aim of this study was to identify type 2 diabetes (T2D) cases and controls for a GWAS, using data captured through routine clinical care across five institutions using different electronic medical record (EMR) systems. Materials and Methods An algorithm was developed to identify T2D cases and controls based on a combination of diagnoses, medications, and laboratory results. The performance of the algorithm was validated at three of the five participating institutions compared against clinician review. A GWAS was subsequently performed using cases and controls identified by the algorithm, with samples pooled across all five institutions. Results The algorithm achieved 98% and 100% positive predictive values for the identification of diabetic cases and controls, respectively, as compared against clinician review. By standardizing and applying the algorithm across institutions, 3353 cases and 3352 controls were identified. Subsequent GWAS using data from five institutions replicated the TCF7L2 gene variant (rs7903146) previously associated with T2D. Discussion By applying stringent criteria to EMR data collected through routine clinical care, cases and controls for a GWAS were identified that subsequently replicated a known genetic variant. The use of standard terminologies to define data elements enabled pooling of subjects and data across five different institutions to achieve the robust numbers required for GWAS. Conclusions An algorithm using commonly available data from five different EMR can accurately identify T2D cases and controls for genetic study across multiple institutions.", "paper_title": "Use of diverse electronic medical record systems to identify genetic risk for type 2 diabetes within a genome-wide association study", "paper_id": "WOS:000300768100014"}