{"auto_keywords": [{"score": 0.04780597585803098, "phrase": "human_patient_simulators"}, {"score": 0.00481495049065317, "phrase": "interactive_case_studies"}, {"score": 0.004737579882204798, "phrase": "learning_outcomes"}, {"score": 0.004512814529823301, "phrase": "innovative_teaching_method"}, {"score": 0.004464326432401002, "phrase": "nursing_students"}, {"score": 0.003158776195052182, "phrase": "custom-designed_health_education_systems"}, {"score": 0.0028195727965553367, "phrase": "human_patient_simulation_group"}, {"score": 0.002685558057339722, "phrase": "interactive_case_study_group"}, {"score": 0.0026423134393535265, "phrase": "posttest_health_education_systems"}, {"score": 0.002613870237087035, "phrase": "inc_examination"}, {"score": 0.0025578967205807843, "phrase": "significant_difference"}, {"score": 0.0025031188149336257, "phrase": "student_scores"}, {"score": 0.002436289099444074, "phrase": "nursing_programs"}, {"score": 0.0021049977753042253, "phrase": "teaching_method"}], "paper_keywords": ["Case studies", " HESI", " Human patient simulators", " Quantitative research"], "paper_abstract": "Although human patient simulators provide an innovative teaching method for nursing students, they are quite expensive. To investigate the value of this expenditure, a quantitative, quasi-experimental, two-group pretest and posttest design was used to compare two educational interventions: human patient simulators and interactive case studies. The sample (N = 49) consisted of students from baccalaureate, accelerated baccalaureate, and diploma nursing programs. Custom-designed Health Education Systems, Inc examinations were used to measure knowledge before and after the implementation of the two educational interventions. Students in the human patient simulation group scored significantly higher than did those in the interactive case study group on the posttest Health Education Systems, Inc examination, and no significant difference was found in student scores among the three types of nursing programs that participated in the study. Data obtained from a questionnaire administered to participants indicated that students responded favorably to the use of human patient simulators as a teaching method.", "paper_title": "Human Patient Simulators and Interactive Case Studies A Comparative Analysis of Learning Outcomes and Student Perceptions", "paper_id": "WOS:000272471100006"}