{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_preferences"}, {"score": 0.010517031201008697, "phrase": "extra-user_interfaces"}, {"score": 0.004377077848734575, "phrase": "meta-user_interfaces"}, {"score": 0.00429828390000229, "phrase": "special_user_interfaces"}, {"score": 0.0041074234667687875, "phrase": "application's_user_interface"}, {"score": 0.004015182362035361, "phrase": "\"extra-user_interfaces"}, {"score": 0.002778385486855157, "phrase": "comparative_analysis"}, {"score": 0.0023694065215394593, "phrase": "comparative_evaluation"}, {"score": 0.0022537212268979507, "phrase": "research_outcomes"}, {"score": 0.002203016940021265, "phrase": "significant_differences"}, {"score": 0.0021632743048552536, "phrase": "interaction_styles"}, {"score": 0.002124247104243502, "phrase": "experience_level"}, {"score": 0.0021049977753042253, "phrase": "primitive_type"}], "paper_keywords": [""], "paper_abstract": "This article aims to investigate user preferences for extra-user interfaces (extra-UI), formerly known as meta-user interfaces. These are special user interfaces that allow the user to control or personalize the application's user interface. They are named \"extra-user interfaces\" because the application does not need it to work. Their main goal is the support of systems with several contexts, displays, devices, or platforms. The purposes and features offered by all the Extra-UI vary from one application to another. To create coherence between them, we defined a catalogue of 14 distribution primitives that are typically provided and classified into 4 categories: simple primitives, basic primitives, advanced primitives, and management operations. Based on this catalogue, a comparative analysis of the state of the art was conducted to identify which interaction styles have been properly used and to discuss the rationale behind these usages. From this analysis, we set up and conducted a comparative evaluation of user preferences by 14 participants testing 6 selected distribution primitives in 4 different interaction styles. The research outcomes exemplified that there were significant differences on user preferences between interaction styles with regards to experience level and primitive type.", "paper_title": "A Comparative Evaluation of User Preferences for Extra-User Interfaces", "paper_id": "WOS:000309706400009"}