{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dbscan"}, {"score": 0.015005667608029545, "phrase": "normalized_density_list"}, {"score": 0.008702180521305456, "phrase": "single_density"}, {"score": 0.007841906824363845, "phrase": "varying_densities"}, {"score": 0.00663347407359062, "phrase": "density_parameters"}, {"score": 0.0061102046756644456, "phrase": "clustering_results"}, {"score": 0.004664920223650814, "phrase": "spatial_datasets"}, {"score": 0.004577145044601205, "phrase": "existing_literature"}, {"score": 0.004242183179689357, "phrase": "maximum_radius"}, {"score": 0.004122964978180509, "phrase": "minimum_number"}, {"score": 0.004083971741538933, "phrase": "data_points"}, {"score": 0.0033768559933238665, "phrase": "systematic_way"}, {"score": 0.0032922964156452696, "phrase": "novel_parameter_free_clustering_algorithm"}, {"score": 0.0031593653672862924, "phrase": "local_densities"}, {"score": 0.003022186855664124, "phrase": "first_pair"}, {"score": 0.002909342017421165, "phrase": "input_parameters"}, {"score": 0.0026875632003075804, "phrase": "different_clustering_results"}, {"score": 0.0026705669656375197, "phrase": "varying_density_parameters"}, {"score": 0.002578985917923144, "phrase": "updated_rule"}, {"score": 0.0024984517279573906, "phrase": "different_input_parameters"}, {"score": 0.002435834440131485, "phrase": "final_result"}, {"score": 0.002412758703672514, "phrase": "proposed_apscan"}, {"score": 0.0021797840569206697, "phrase": "nonlinear_data_structure"}, {"score": 0.0021522871388240444, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Clustering algorithm", " DBSCAN", " Affinity propagation algorithm"], "paper_abstract": "DBSCAN is a density based clustering algorithm and its effectiveness for spatial datasets has been demonstrated in the existing literature. However, there are two distinct drawbacks for DBSCAN: (i) the performances of clustering depend on two specified parameters. One is the maximum radius of a neighborhood and the other is the minimum number of the data points contained in such neighborhood. In fact these two specified parameters define a single density. Nevertheless, without enough prior knowledge, these two parameters are difficult to be determined; (ii) with these two parameters for a single density, DBSCAN does not perform well to datasets with varying densities. The above two issues bring some difficulties in applications. To address these two problems in a systematic way, in this paper we propose a novel parameter free clustering algorithm named as APSCAN. Firstly, we utilize the Affinity Propagation (AP) algorithm to detect local densities for a dataset and generate a normalized density list. Secondly, we combine the first pair of density parameters with any other pair of density parameters in the normalized density list as input parameters for a proposed DDBSCAN (Double-Density-Based SCAN) to produce a set of clustering results. In this way, we can obtain different clustering results with varying density parameters derived from the normalized density list. Thirdly, we develop an updated rule for the results obtained by implementing the DDBSCAN with different input parameters and then synthesize these clustering results into a final result. The proposed APSCAN has two advantages: first it does not need to predefine the two parameters as required in DBSCAN and second, it not only can cluster datasets with varying densities but also preserve the nonlinear data structure for such datasets. Crown Copyright (C) 2011 Published by Elsevier B.V. All rights reserved.", "paper_title": "APSCAN: A parameter free algorithm for clustering", "paper_id": "WOS:000290076800010"}