{"auto_keywords": [{"score": 0.024292880021268094, "phrase": "round-robin"}, {"score": 0.00481495049065317, "phrase": "round-robin_policy"}, {"score": 0.004446677711302801, "phrase": "multipath_routing_system"}, {"score": 0.00405646687267772, "phrase": "state_information"}, {"score": 0.003545024951402818, "phrase": "additional_resequencing_delay"}, {"score": 0.003375429082739004, "phrase": "end-to-end_delay"}, {"score": 0.003253560798692431, "phrase": "resequencing_buffer"}, {"score": 0.0031747618267940155, "phrase": "arriving_customers"}, {"score": 0.0029677378488677983, "phrase": "round-robin_routing_assignment"}, {"score": 0.002860546817196148, "phrase": "namely_heavy_and_light_traffic"}, {"score": 0.0027403605798830984, "phrase": "round-robin_customer_assignment"}, {"score": 0.002453934333239467, "phrase": "light_traffic"}, {"score": 0.0023798115577749225, "phrase": "special_case"}, {"score": 0.0023507916951658455, "phrase": "poisson_arrivals"}], "paper_keywords": ["heavy and light traffic", " Multipath routing", " Round-Robin policy", " parallel queues", " resequencing"], "paper_abstract": "We consider a model of a multipath routing system where arriving customers are routed to a set of identical, parallel, single server queues according to balancing policies operating without state information. After completion of service, customers are required to leave the system in their order of arrival, thus incurring an additional resequencing delay. We are interested in minimizing the end-to-end delay (including time at the resequencing buffer) experienced by arriving customers. To that end we establish the optimality of the Round-Robin routing assignment in two asymptotic regimes, namely heavy and light traffic: In heavy traffic, the Round-Robin customer assignment is shown to achieve the smallest (in the increasing convex stochastic ordering) end-to-end delay amongst all routing policies operating without queue state information. In light traffic, and for the special case of Poisson arrivals, we show that Round-Robin is again an optimal (in the strong stochastic ordering) routing policy. We illustrate the stochastic comparison results by several simulation examples.", "paper_title": "Asymptotic optimality of the Round-Robin policy in multipath routing with resequencing", "paper_id": "WOS:000236829100004"}