{"auto_keywords": [{"score": 0.04101004342397492, "phrase": "lyapunov"}, {"score": 0.00481495049065317, "phrase": "observer_design_of_discrete-time_t-s_fuzzy_systems_via_multi-instant_homogenous_matrix_polynomials"}, {"score": 0.00443000995237127, "phrase": "discrete-time_nonlinear_systems"}, {"score": 0.004161553532799662, "phrase": "multi-instant_homogenous_matrix_polynomials"}, {"score": 0.003107935254560724, "phrase": "algebraic_properties"}, {"score": 0.0027806165169981622, "phrase": "discrete-time_t-s_fuzzy_systems"}, {"score": 0.0026118503041971976, "phrase": "existing_fuzzy_lyapunov_functions"}, {"score": 0.0025225467103906314, "phrase": "special_cases"}, {"score": 0.0024704333220467393, "phrase": "lyapunov_function"}, {"score": 0.002419393934835993, "phrase": "fuzzy_observer"}, {"score": 0.002241087008892355, "phrase": "numerical_example"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Discrete-time system", " homogenous matrix polynomials", " multi-instant", " observer design", " Takagi-Sugeno (T-S) fuzzy model"], "paper_abstract": "This paper is concerned with the design of observer for discrete-time nonlinear systems in the Takagi-Sugeno (T-S) fuzzy form. Under the framework of multi-instant homogenous matrix polynomials, a novel fuzzy observer and a new Lyapunov function, which are homogenous polynomially parameter-dependent on both the current-time normalized fuzzy weighting functions and the m-steps past-time normalized fuzzy weighting functions, are proposed for conceiving less conservative observer design conditions. Since the algebraic properties of both the current-time normalized fuzzy weighting functions and them-steps past-time normalized fuzzy weighting functions are fully considered, the relaxation quality of the fuzzy observer design of discrete-time T-S fuzzy systems is significantly improved. In particular, some existing fuzzy Lyapunov functions and fuzzy observers are special cases of the Lyapunov function and the fuzzy observer given in this paper, respectively. Finally, a numerical example is provided to illustrate the effectiveness of the proposed approach.", "paper_title": "Observer Design of Discrete-Time T-S Fuzzy Systems Via Multi-Instant Homogenous Matrix Polynomials", "paper_id": "WOS:000345857000026"}