{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "image_restoration"}, {"score": 0.049750469707859776, "phrase": "whole-sample_symmetric_boundary_conditions"}, {"score": 0.0479822574122594, "phrase": "array_values"}, {"score": 0.03755359252962418, "phrase": "half-sample_symmetric_bcs"}, {"score": 0.036081868869661735, "phrase": "whole-sample_symmetric_bcs"}, {"score": 0.004556901872357751, "phrase": "viewable_region"}, {"score": 0.003809628721278519, "phrase": "image_processing"}, {"score": 0.003667925754747227, "phrase": "fast_algorithms"}, {"score": 0.0032176163279340206, "phrase": "blurring_matrices"}, {"score": 0.003173545808843704, "phrase": "point_spread_functions"}, {"score": 0.0030872017736888113, "phrase": "block_toeplitz-plus-pseudohankel_with_toeplitz-plus-pseudohankel_blocks_structures"}, {"score": 0.0030240571342286296, "phrase": "kronecker"}, {"score": 0.0029114187110123105, "phrase": "zero_bcs"}, {"score": 0.0028715299874549245, "phrase": "anti-reflexive_bcs"}, {"score": 0.002736162634990377, "phrase": "resulting_matrices"}, {"score": 0.00271735110571002, "phrase": "similar_structures"}, {"score": 0.0025981810951165836, "phrase": "true_psf"}, {"score": 0.0025537472239953807, "phrase": "computational_complexity"}, {"score": 0.002492810341589618, "phrase": "kronecker_product_approximation"}, {"score": 0.002467140591777737, "phrase": "resulting_matrix"}, {"score": 0.00226322835801988, "phrase": "upper_left_corner"}, {"score": 0.0022322004700942267, "phrase": "big_matrices"}, {"score": 0.0021639307835832136, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Image restoration", " Whole-sample symmetric BCs", " Kronecker product approximation", " TSVD", " GCV"], "paper_abstract": "Reflexive boundary conditions (BCs) assume that the array values outside the viewable region are given by a symmetry of the array values inside. The reflection guarantees the continuity of the image. In fact, there are usually two choices for the symmetry: symmetry around the meshpoint and symmetry around the midpoint. The first is called whole-sample symmetry in signal and image processing, the second is half-sample. Many researchers have developed some fast algorithms for the problems of image restoration with the half-sample symmetric BCs over the years. However, little attention has been given to the whole-sample symmetric BCs. In this paper, we consider the use of the whole-sample symmetric boundary conditions in image restoration. The blurring matrices constructed from the point spread functions (PSFs) for the BCs have block Toeplitz-plus-PseudoHankel with Toeplitz-plus-PseudoHankel blocks structures. Recently, regardless of symmetric properties of the PSFs, a technique of Kronecker product approximations was successfully applied to restore images with the zero BCs, half-sample symmetric BCs and anti-reflexive BCs, respectively. All these results extend quite naturally to the whole-sample symmetric BCs, since the resulting matrices have similar structures. It is interesting to note that when the size of the true PSF is small, the computational complexity of the algorithm obtained for the Kronecker product approximation of the resulting matrix in this paper is very small. It is clear that in this case all calculations in the algorithm are implemented only at the upper left corner submatrices of the big matrices. Finally, detailed experimental results reporting the performance of the proposed algorithm are presented. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Kronecker product approximations for image restoration with whole-sample symmetric boundary conditions", "paper_id": "WOS:000298460300010"}