{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "new_problem"}, {"score": 0.012546920743138781, "phrase": "starting_point"}, {"score": 0.004404658750724105, "phrase": "embedded_sets_representation_theorem"}, {"score": 0.0035954555250614197, "phrase": "set_theoretic_operations"}, {"score": 0.0035249212996297332, "phrase": "uncertainty_measures"}, {"score": 0.003455765987713262, "phrase": "inference_engine_computations"}, {"score": 0.0034047882921717913, "phrase": "fuzzy_logic_systems"}, {"score": 0.0029784342137867776, "phrase": "structural_solution"}, {"score": 0.0029055323737809825, "phrase": "practical_computational_solution"}, {"score": 0.0026839922027139967, "phrase": "author's_recommendation"}], "paper_keywords": ["Interval type-2 fuzzy sets", " Representation Theorem", " Embedded sets", " Centroid", " Uncertainty measures", " Similarity", " Fuzzy logic system", " Linguistic weighted average", " Fuzzistics"], "paper_abstract": "This paper, which is tutorial in nature, demonstrates how the Embedded Sets Representation Theorem (RT) for a general type-2 fuzzy set (T2 FS), when specialized to an interval (I)T-2 FS, can be used as the starting point to solve many diverse problems that involve IT2 FSs. The problems considered are: set theoretic operations, centroid, uncertainty measures, similarity, inference engine computations for Mamdani IT2 fuzzy logic systems, linguistic weighted average, person membership function approach to type-2 fuzzistics, and Interval Approach to type-2 fuzzistics. Each solution obtained from the RT is a structural solution but is not a practical computational solution, however, the latter are always found from the former. It is this author's recommendation that one should use the RT as a starting point whenever solving a new problem involving IT2 FSs because it has had such great success in solving so many such problems in the past, and it answers the question \"Where do I start in order to solve a new problem involving IT2 FSs?\" (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "On answering the question \"Where do I start in order to solve a new problem involving interval type-2 fuzzy sets?\"", "paper_id": "WOS:000269116700017"}