{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "self-interested_agents"}, {"score": 0.0047155367844327, "phrase": "cooperation_enhancers"}, {"score": 0.0045607070754363245, "phrase": "autonomous_agents"}, {"score": 0.0038271712887391015, "phrase": "associated_costs"}, {"score": 0.003279039724748895, "phrase": "joint_search_problem"}, {"score": 0.0027167830773160203, "phrase": "fully_cooperative_agents'_search"}, {"score": 0.0026384167183586015, "phrase": "search_horizon"}, {"score": 0.0025623050508233078, "phrase": "cooperating_agents"}, {"score": 0.002509284173541882, "phrase": "individual_and_overall_expected_utility"}, {"score": 0.002477998427152547, "phrase": "self-interested_case"}, {"score": 0.0023864566654035924, "phrase": "joint_search_theories"}, {"score": 0.002346861891137455, "phrase": "important_insights"}, {"score": 0.002327310963701377, "phrase": "system_designers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Multi-agent economic search", " Cooperation", " Self-interested agents"], "paper_abstract": "This paper considers the problem of autonomous agents that need to pick one of several options, all plausible however differ in their value, which is a priori uncertain and can be revealed for a cost. The agents thus need to weigh the benefits of revealing further values against the associated costs. The paper addresses the problem in its multi-agent joint form, such that not a single but rather a group of agents may benefit from the fruits of the search. The paper formally introduces and analyzes the joint search problem, when carried out fully distributedly, and determines the strategies to be used by the agents both when fully cooperative and when self-interested. The analysis is used to demonstrate that elements that can easily be proved to be beneficial with fully cooperative agents' search (e.g., extension of the search horizon, increase in the number of cooperating agents) can actually degrade individual and overall expected utility in the self-interested case. The analysis contributes to the advancement of joint search theories, and offers important insights for system designers, enabling them to determine the mechanisms that should be included in the markets and systems they design. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Joint search with self-interested agents and the failure of cooperation enhancers", "paper_id": "WOS:000339130100003"}