{"auto_keywords": [{"score": 0.04568107674629595, "phrase": "coverage_requirement"}, {"score": 0.04342169149056448, "phrase": "exact_algorithms"}, {"score": 0.042824247178514574, "phrase": "set_multi-covering_problem"}, {"score": 0.004011366422179016, "phrase": "inclusion-exclusion_principle"}, {"score": 0.0035060903664150115, "phrase": "maximum_value"}, {"score": 0.0029062860108533374, "phrase": "present_paper"}, {"score": 0.002864628676257225, "phrase": "first_one"}, {"score": 0.0025398521156505425, "phrase": "exact_algorithm"}, {"score": 0.0023857603808363527, "phrase": "m._koivisto"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Set multi-covering", " Inclusion-exclusion", " Algorithm", " Complexity"], "paper_abstract": "Set multi-covering is a generalization of the set covering problem where each element may need to be covered more than once and thus some subset in the given family of subsets may be picked several times for minimizing the number of sets to satisfy the coverage requirement. In this paper, we propose a family of exact algorithms for the set multi-covering problem based on the inclusion-exclusion principle. The presented ESMC (Exact Set Multi-Covering) algorithm takes O*((2t)(n)) time and O*((t + 1)(n)) space where t is the maximum value in the coverage requirement set (The O*(f (n)) notation omits a poly log(f (n)) factor). We also propose the other three exact algorithms through different tradeoffs of the time and space complexities. To the best of our knowledge, this present paper is the first one to give exact algorithms for the set multi-covering problem with nontrivial time and space complexities. This paper can also be regarded as a generalization of the exact algorithm for the set covering problem given in (A. Bjorklund, T. Husfeldt, M. Koivisto, Set partitioning via inclusion-exclusion, SIAM journal on Computing, in: FOCS 2006 (in press, special issue)]. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Set multi-covering via inclusion-exclusion", "paper_id": "WOS:000269683400028"}