{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_chargers"}, {"score": 0.03952394743635685, "phrase": "minimum_number"}, {"score": 0.004752873752686246, "phrase": "large-scale_wrsns"}, {"score": 0.004671342094877447, "phrase": "wireless_rechargeable_sensor_networks"}, {"score": 0.004415857432588371, "phrase": "sensor_nodes"}, {"score": 0.004340081802944066, "phrase": "wide_attention"}, {"score": 0.004247180402119585, "phrase": "proper_charging_schedules"}, {"score": 0.0034816486982671437, "phrase": "np"}, {"score": 0.00319141242685261, "phrase": "gcha_greedily"}, {"score": 0.0031502008922533894, "phrase": "tour_construction_problem"}, {"score": 0.002802373595203129, "phrase": "decision_condition"}, {"score": 0.002754208576828914, "phrase": "greedy_charging_scheme"}, {"score": 0.0026603411931700556, "phrase": "gcha"}, {"score": 0.0026146109167103655, "phrase": "tour_assignment_problem"}, {"score": 0.0023562342764987254, "phrase": "simulation_results"}, {"score": 0.0022174469839432013, "phrase": "gcha_scheme"}, {"score": 0.0021049977753042253, "phrase": "related_work"}], "paper_keywords": [""], "paper_abstract": "Wireless Rechargeable Sensor Networks, in which mobile chargers (MCs) are employed to recharge the sensor nodes, have attracted wide attention in recent years. Under proper charging schedules, the MCs could keep all the sensor nodes working perpetually. Since MCs can be very expensive, this paper tackles the problem of deciding the minimum number of MCs and their charging schedules to keep every sensor node working continuously. This problem is NP-hard; we divide it into two subproblems and propose a GCHA (Greedily Construct, Heuristically Assign) scheme to solve them. First, the GCHA greedily addresses a Tour Construction Problem to construct a set of tours to 1-cover the WRSN. Energy of the sensor nodes in each of these tours can be timely replenished by one MC according to the decision condition derived from a Greedy Charging Scheme (GCS). Second, the GCHA heuristically solves a Tour Assignment Problem to assign these tours to minimum number of MCs. Then each of the MCs can apply the GCS to charge along its assigned tours. Simulation results show that, on average, the number of MCs obtained by the GCHA scheme is less than 1.1 over a derived lower bound and less than 0.5 over related work.", "paper_title": "Minimizing the Number of Mobile Chargers to Keep Large-Scale WRSNs Working Perpetually", "paper_id": "WOS:000358210900001"}