{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "perishable_products"}, {"score": 0.004397230847865867, "phrase": "perishable_raw_material"}, {"score": 0.004272969980602508, "phrase": "different_types"}, {"score": 0.004054169947971483, "phrase": "manufacturing_process"}, {"score": 0.003809932244103758, "phrase": "deadline_constraint"}, {"score": 0.0037556843869894566, "phrase": "raw_material_limit"}, {"score": 0.0033166379485150507, "phrase": "machine_time"}, {"score": 0.003222814590544802, "phrase": "product_type"}, {"score": 0.002661474607275484, "phrase": "analytical_rules"}, {"score": 0.002524982927936405, "phrase": "efficient_algorithm"}, {"score": 0.002488985155689794, "phrase": "optimal_policy"}, {"score": 0.0022617389804167943, "phrase": "stochastic_scheduling"}, {"score": 0.0022401855403251653, "phrase": "stochastic_knapsack"}], "paper_keywords": ["production planning", " product selection", " stochastic scheduling", " deadline", " machine time allocation", " perishable product"], "paper_abstract": "We are concerned about the following problem: a manufacturer owns a certain amount of perishable raw material which can be produced into different types of products. He must, however, finish the manufacturing process before a deadline (which represents, e.g., a fixed flight schedule). Due to the deadline constraint and the raw material limit, it is imperative for the manufacturer to determine three decisions: (i) the product types to be produced; (ii) the machine time to be allocated for each product type; and (iii) the sequence to process the products selected. We develop, in this paper, a model to formulate this problem. We show that (i) and (iii) can be determined by analytical rules, and (ii) can be computed by an efficient algorithm. The optimal policy with the three decisions for the problem is therefore completely constructed. We also show the relationships of our model to stochastic scheduling and stochastic knapsack, and discuss the contributions of our work to the two areas. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Product selection, machine time allocation, and scheduling decisions for manufacturing perishable products subject to a deadline", "paper_id": "WOS:000251126000022"}