{"auto_keywords": [{"score": 0.04974351188371698, "phrase": "organizational_objectives"}, {"score": 0.028887109221877653, "phrase": "health_care_organizations"}, {"score": 0.015719716506582538, "phrase": "information_systems"}, {"score": 0.015395121155499292, "phrase": "health_care"}, {"score": 0.013676656111526327, "phrase": "new_information_systems"}, {"score": 0.004378854464130883, "phrase": "health_care_industry"}, {"score": 0.003672500644750565, "phrase": "health_care_information_systems_planners"}, {"score": 0.0031455000569352454, "phrase": "managerial_actions"}, {"score": 0.0031234247639701134, "phrase": "organizational_characteristics"}, {"score": 0.0030153435879168634, "phrase": "specific_objectives"}, {"score": 0.002941913249957503, "phrase": "new_systems"}, {"score": 0.002761176640988626, "phrase": "generalized_process"}, {"score": 0.002600661525224505, "phrase": "significant_issue"}, {"score": 0.002528379400564723, "phrase": "deliberate_efforts"}, {"score": 0.0023315400785212785, "phrase": "cur-rent_and_future_alignment_efforts"}, {"score": 0.0022747238867190417, "phrase": "broad_support"}, {"score": 0.0021959459702913654, "phrase": "future_study"}, {"score": 0.0021805201234139475, "phrase": "alignment's_predictors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Health care information systems", " Alignment", " Strategy", " Qualitative research"], "paper_abstract": "Purpose: The alignment of information systems with organizational objectives and strategies is a key, contemporary challenge to organizations in general and the health care industry in particular. Researchers and managers alike believe that the selection of new information systems to support objectives and strategies focuses the organization on accomplishing its objectives and realizing the value of the investments in the systems. The purpose of this study was to help understand alignment in health care so that health care information systems planners can better achieve it. Methods: Structured interviews with 15 top information systems managers in health care organizations of various sizes and types inquired about organizational objectives and strategies, the process for choosing new information systems to support those objectives and strategies, and the concomitant facilitating and hindering managerial actions and organizational characteristics. Results: In addition to identifying and elucidating specific objectives, strategies, processes for choosing new systems, and facilitating and hindering actions and characteristics, the study used the data to characterize a generalized process of alignment in health care organizations. Conclusions: The study contributes by confirming that alignment is a significant issue in health care organizations, and that such organizations make deliberate efforts to achieve it. The study further contributes by providing tables of actions and characteristics that managers might use as checklists in cur-rent and future alignment efforts as well as in generally cultivating broad support for alignment. Finally, it contributes by suggesting future study of alignment's predictors and effects in health care organizations. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The alignment of information systems with organizational objectives and strategies in health care", "paper_id": "WOS:000267233300002"}