{"auto_keywords": [{"score": 0.04975026431744431, "phrase": "cwt"}, {"score": 0.03818682952852444, "phrase": "svm"}, {"score": 0.015509159987152249, "phrase": "dct"}, {"score": 0.015353257276780068, "phrase": "ecg_arrhythmias_classification"}, {"score": 0.01048796880385366, "phrase": "training_performance"}, {"score": 0.0102426809662327, "phrase": "training_time"}, {"score": 0.007919216135152134, "phrase": "mlp"}, {"score": 0.004814979809209434, "phrase": "dwt"}, {"score": 0.004483120978156604, "phrase": "continues_wavelet_transform"}, {"score": 0.004289215825521407, "phrase": "discrete_cosine_transform"}, {"score": 0.003926105480202798, "phrase": "multi-layered_perceptron"}, {"score": 0.0035815339281037627, "phrase": "bp"}, {"score": 0.003545024951402818, "phrase": "kernel-adatron"}, {"score": 0.003520971639466546, "phrase": "k-a"}, {"score": 0.0034497831301482144, "phrase": "ecg_signals"}, {"score": 0.003414728597255129, "phrase": "mit-bih_arrhythmia_database"}, {"score": 0.0033229756875116597, "phrase": "normal_ecg."}, {"score": 0.0031467766123827717, "phrase": "generalization_ability"}, {"score": 0.003062201383165999, "phrase": "svm_training"}, {"score": 0.0027459678326877744, "phrase": "testing_datasets"}, {"score": 0.0025914395870574787, "phrase": "best_feature_extraction_method"}, {"score": 0.002547663224855668, "phrase": "substantial_value"}, {"score": 0.0022766712610014484, "phrase": "testing_performance"}, {"score": 0.002185428109917791, "phrase": "single_lead"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["MLP", " SVM", " ECG", " DWT", " CWT", " DCT"], "paper_abstract": "In this study we have proposed and compared use of CWT (Continues Wavelet Transform) with two powerful data transformation techniques DWT (Discrete Wavelet Transform), and DCT (Discrete Cosine Transform) which have already been in use, in order to improve the capability of two pattern classifiers in ECG arrhythmias classification. The classifiers under examination are MLP (Multi-Layered Perceptron, a conventional neural network) and SVM (Support Vector Machine). The training or learning algorithms used in MLP and SVM are BackPropagation (BP) and Kernel-Adatron (K-A), respectively. The ECG signals taken from MIT-BIH arrhythmia database are used to classify four different arrhythmias together with normal ECG. The output of MLP and SVM classifiers in terms of training performance, testing performance or generalization ability and training time are compared. MLP and SVM training and testing stages have been carried out twice. At first, only one lead (II) is used, and then a second ECG lead (V1) has been added to the training and testing datasets. Three feature extraction techniques are applied separately to datasets before classification. The results show that selection of the best feature extraction method will depend on the substantial value considered for training time, training and testing performance. This is stated because when applying MLP or SVM, addition of CWT and DCT will show the advantage only when training performance and testing performance are important, respectively. Generally speaking only testing performance with single lead for MLP shows superiority over SVM. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A comparative study of DWT, CWT and DCT transformations in ECG arrhythmias classification", "paper_id": "WOS:000278376100027"}