{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "recurring_fixations"}, {"score": 0.045480707557878274, "phrase": "visual_scene"}, {"score": 0.03671180433268793, "phrase": "scene_unit"}, {"score": 0.004656082803151484, "phrase": "mathematical_model"}, {"score": 0.004408976280483648, "phrase": "spatial_unit"}, {"score": 0.004210114198411514, "phrase": "previous_fixations"}, {"score": 0.004174929128880472, "phrase": "eye_movement_scanpath"}, {"score": 0.004020185355794902, "phrase": "discrete_units"}, {"score": 0.0033141428467975795, "phrase": "sigmoid_or_exponential_growth_function"}, {"score": 0.0030343239259424497, "phrase": "available_information"}, {"score": 0.0028015105858516702, "phrase": "complete_information"}, {"score": 0.0027317585060414253, "phrase": "entire_scene"}, {"score": 0.002358050109031317, "phrase": "favored_units"}, {"score": 0.0023284972218506157, "phrase": "resulting_dynamics"}, {"score": 0.002299313860419974, "phrase": "local_available_information_measure"}, {"score": 0.002177011650568437, "phrase": "corresponding_visual_unit"}, {"score": 0.0021049977753042253, "phrase": "change_blindness"}], "paper_keywords": ["Fixations", " Information", " Model", " Memory", " Eye movement scanpath", " Change detection"], "paper_abstract": "We construct a mathematical model indicating the information available to the observer regarding each item in a spatial unit in the visual scene, at any given moment, dependant on previous fixations and eye movement scanpath. Dividing the items in the visual scene into discrete units, two processes affect the amount of information available about each unit at each time: an incremental component and a memory decay component. We assume that extracted information is incremented for a scene unit each time the fixation falls on it and increases as a sigmoid or exponential growth function with subsequent fixations and that information decays exponentially between recurring fixations on a unit. Results show that the amount of available information grows and fluctuates stochastically, varying from unit to unit and from time to time, so that complete information is never reached for the entire scene. Simulations show that the larger the scene, the less information is available, on average, for each scene unit, though more may be available in total, as well as more for favored units. The resulting dynamics of this local available information measure might predict the probability of perceiving a change in stimulation at a corresponding visual unit or its complementary, the probability of change blindness.", "paper_title": "Gathering and Retaining Visual Information Over Recurring Fixations: A Model", "paper_id": "WOS:000292777700011"}