{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_management"}, {"score": 0.04178514569843149, "phrase": "lotka's_square_law"}, {"score": 0.004758457292840376, "phrase": "intellectual_capital_academic_discipline"}, {"score": 0.004565876339189493, "phrase": "first_documented_attempt"}, {"score": 0.004105569717085019, "phrase": "yule"}, {"score": 0.00387011040370557, "phrase": "publication_data"}, {"score": 0.0030374213037172803, "phrase": "small_group"}, {"score": 0.0030017207229983385, "phrase": "highly_productive_researchers"}, {"score": 0.002914288956035066, "phrase": "positive_sign"}, {"score": 0.002763261749602258, "phrase": "right_direction"}, {"score": 0.0023003498123420237, "phrase": "yule-simon_model"}, {"score": 0.002233301265743633, "phrase": "different_distributions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Superstar effect", " Matthew effect", " Yule-Simon model", " Lotka's square law", " Editor bias"], "paper_abstract": "This paper reports on the first documented attempt to investigate the presence of the superstar (or Matthew) effect in the knowledge management and intellectual capital (KM/IC) scholarly discipline. The Yule-Simon model and Lotka's square law were applied to the publication data obtained from 2175 articles from 11 KM/IC journals. Based on the findings, it was concluded that the KM/IC discipline represents a very young, attractive academic field that welcomes contributions from a variety of academics and practitioners. In their paper acceptance decisions, KM/IC journal editors are not biased towards a small group of highly productive researchers, which is a positive sign that the field has been progressing in the right direction. The discipline is driven more by academics than by practitioners, and the distribution of articles is more concentrated among a few academic but not practitioner institutions. It was also observed that the Yule-Simon model and Lotka's square law may produce different distributions with respect to institutions. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "The superstar phenomenon in the knowledge management and intellectual capital academic discipline", "paper_id": "WOS:000291032500002"}