{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multihop_cognitive_radio_networks"}, {"score": 0.03151036962346514, "phrase": "cognitive_radios"}, {"score": 0.0046038458731764926, "phrase": "route."}, {"score": 0.0044873778175404475, "phrase": "fundamental_issue"}, {"score": 0.0037262941538784094, "phrase": "multihop_cognitive_radio_environments"}, {"score": 0.0036788184374592706, "phrase": "general_routing_solution"}, {"score": 0.0035399770257915466, "phrase": "cognitive_environments"}, {"score": 0.00334144503360907, "phrase": "specific_routing_solutions"}, {"score": 0.003015508235745547, "phrase": "licensed_bands"}, {"score": 0.0028100102841877835, "phrase": "relatively_static_primary_band"}, {"score": 0.0027564303939865476, "phrase": "primary_nodes"}, {"score": 0.0026865721000905235, "phrase": "cognitive_users"}, {"score": 0.0026184796288543878, "phrase": "static_mesh_routing_solutions"}, {"score": 0.0021049977753042253, "phrase": "highly_active_and_rarely_available_primary_bands"}], "paper_keywords": [""], "paper_abstract": "Routing is a fundamental issue to consider when dealing with multihop cognitive radio networks. We investigate in this work, the potential routing approaches that can be employed in such adaptive wireless networks. We argue that in multihop cognitive radio environments no general routing solution can be proposed, but cognitive environments can be classified into three separate categories, each requiring specific routing solutions. Basically, this classification is imposed by the activity of the users on the licensed bands that cognitive radios try to access. First, over a relatively static primary band, where primary nodes idleness largely exceeds cognitive users communication durations, static mesh routing solutions can be reused, whereas second, over dynamically available spectrum bands new specific routing solutions have to be proposed, we give some guidelines and insights about designing such solutions. Third, if cognitive radios try to access over highly active and rarely available primary bands, opportunistic forwarding without preestablished routing is to be explored.", "paper_title": "Multihop Cognitive Radio Networks: To Route or Not to Route", "paper_id": "WOS:000268597800004"}