{"auto_keywords": [{"score": 0.04777281030275485, "phrase": "rigid_transformations"}, {"score": 0.03370616167151699, "phrase": "nonrigid_deformations"}, {"score": 0.015719716506582538, "phrase": "local_image_features"}, {"score": 0.011819727403286729, "phrase": "global_spatial_configuration"}, {"score": 0.004545675105321216, "phrase": "illumination_deformations"}, {"score": 0.004256243266481051, "phrase": "high_degree"}, {"score": 0.004018087343963485, "phrase": "reliable_matching"}, {"score": 0.0039362878637371574, "phrase": "relatively_high_number"}, {"score": 0.0037776319581225046, "phrase": "data_association_procedure"}, {"score": 0.0036855132234738736, "phrase": "geometric_filters"}, {"score": 0.0030247625535682987, "phrase": "semilocal_spatial_configuration"}, {"score": 0.002999955539996569, "phrase": "local_features"}, {"score": 0.0026953359825383646, "phrase": "hough_transform"}, {"score": 0.0026403934420630155, "phrase": "efficient_and_effective_mismatch_rejection_step"}, {"score": 0.002333421318779658, "phrase": "comparable_time_complexity_figures"}, {"score": 0.002202617924488607, "phrase": "probabilistic_recognition_system"}, {"score": 0.002166607745253829, "phrase": "final_verification_step"}], "paper_keywords": ["local image feature", " feature clustering", " visual object recognition", " wide baseline matching", " long-range matching"], "paper_abstract": "Local image features have been designed to be informative and repeatable under rigid transformations and illumination deformations. Even though current state-of-the- art local image features present a high degree of repeatability, their local appearance alone usually does not bring enough discriminative power to support a reliable matching, resulting in a relatively high number of mismatches in the correspondence set formed during the data association procedure. As a result, geometric filters, commonly based on global spatial configuration, have been used to reduce this number of mismatches. However, this approach presents a trade- off between the effectiveness to reject mismatches and the robustness to nonrigid deformations. In this paper, we propose two geometric filters, based on a semilocal spatial configuration of local features, that are designed to be robust to nonrigid deformations and to rigid transformations, without compromising its efficacy to reject mismatches. We compare our methods to the Hough transform, which is an efficient and effective mismatch rejection step based on the global spatial configuration of features. In these comparisons, our methods are shown to be more effective in the task of rejecting mismatches for rigid transformations and nonrigid deformations at comparable time complexity figures. Finally, we demonstrate how we can integrate these methods in a probabilistic recognition system such that the final verification step uses not only the similarity between features but also their semilocal configuration.", "paper_title": "Flexible spatial configuration of local image features", "paper_id": "WOS:000250087900003"}