{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "root_causes"}, {"score": 0.027508799789384367, "phrase": "hybrid_learning_algorithm"}, {"score": 0.015485059406581729, "phrase": "machining_processes"}, {"score": 0.00760281187965003, "phrase": "machining_process"}, {"score": 0.006055090572104806, "phrase": "engineering-driven_rules"}, {"score": 0.004647105813224402, "phrase": "engineering_knowledge"}, {"score": 0.004553822674247401, "phrase": "product_quality"}, {"score": 0.004490640384953283, "phrase": "developed_approach"}, {"score": 0.004156590395333602, "phrase": "ramp-up_and_production_time"}, {"score": 0.00409382470158851, "phrase": "multivariate_statistical_process_monitoring_techniques"}, {"score": 0.003462705707563328, "phrase": "rci"}, {"score": 0.0031926001871260524, "phrase": "off-line_pattern_match"}, {"score": 0.003144345057121367, "phrase": "fixture_fault_patterns"}, {"score": 0.0028697077879305064, "phrase": "unknown_root_cause"}, {"score": 0.0026057256900479026, "phrase": "real-world_cylinder_head"}, {"score": 0.0021049977753042253, "phrase": "identification_systems"}], "paper_keywords": ["Root causes identification", " Hybrid learning algorithm", " Engineering-driven rules"], "paper_abstract": "To improve product quality and productivity, one of the most critical factors for most manufacturers lies in quickly identifying root causes in machining process during ramp-up and production time. Though multivariate statistical process monitoring techniques using control charts have been successfully used to detect anomalies in machining processes, they cannot provide guidelines to identify and isolate root causes. One novel robust approach for root causes identification (RCI) in machining process using hybrid learning algorithm and engineering-driven rules is developed in this study. Firstly, off-line pattern match relationships between fixture fault patterns and part variation motion patterns are derived. Then, a hybrid learning algorithm is explored for identifying the part variation motion patterns. An unknown root cause is identified and isolated using the output of hybrid learning algorithm and engineering-driven rules. Finally, the data from the real-world cylinder head of engine machining processes are collected to validate the developed approach. The results indicate that the developed approach can perform effectively for identifying root causes of fixture in machining processes. All of the analysis from this study provides guidelines in developing root causes identification systems based on hybrid learning algorithm and engineering knowledge.", "paper_title": "A robust approach for root causes identification in machining processes using hybrid learning algorithm and engineering knowledge", "paper_id": "WOS:000308820200028"}