{"auto_keywords": [{"score": 0.04885877600670675, "phrase": "email_spam"}, {"score": 0.03466574457254795, "phrase": "spamming_botnets"}, {"score": 0.00481495049065317, "phrase": "comprehensive_study_of_email_spam_botnet_detection"}, {"score": 0.0039772848945723435, "phrase": "complexity_intensification"}, {"score": 0.003936389070602614, "phrase": "email_spamming_techniques"}, {"score": 0.0035681790580031998, "phrase": "email_spam_messages"}, {"score": 0.003234299589505403, "phrase": "massive_amount"}, {"score": 0.0031193028729331667, "phrase": "detailed_chronicles"}, {"score": 0.002931569771634119, "phrase": "notable_occurrences"}, {"score": 0.0027126684113045756, "phrase": "comprehensive_analysis"}, {"score": 0.002643386043540555, "phrase": "botnet_detection_techniques"}, {"score": 0.0022168460543913787, "phrase": "qualitative_analysis"}, {"score": 0.0021049977753042253, "phrase": "future_trends"}], "paper_keywords": ["Email", " botnet", " spam email", " email spam botnet detection"], "paper_abstract": "The problem of email spam has grown significantly over the past few years. It is not just a nuisance for users but also it is damaging for those who fall for scams and other attacks. This is due to the complexity intensification of email spamming techniques which are advancing from traditional spamming (direct spamming) techniques to a more scalable, elusive and indirect approach of botnets for distributing email spam messages. In this paper, we first discuss the sources and architectures used by the spamming botnets for sending massive amount of email spam. Then we present detailed chronicles of spamming botnets which systematically describes the timeline of events and notable occurrences in the advancement of these spamming botnets. This paper also aims to represent a comprehensive analysis of particular email spamming botnet detection techniques proposed in the literature. We attempt to categorize them according to both their nature of defense and method of detection, also revealing and comparing their advantages and disadvantages extensively. We also present a qualitative analysis of these techniques. Finally, we summarize the future trends and challenges in detecting email spamming botnets.", "paper_title": "A Comprehensive Study of Email Spam Botnet Detection", "paper_id": "WOS:000365233100018"}