{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "arden_syntax"}, {"score": 0.043807793150899624, "phrase": "style_sheet"}, {"score": 0.038143211264035526, "phrase": "original_text_version"}, {"score": 0.034764853828021365, "phrase": "xml_documents"}, {"score": 0.03280182630528363, "phrase": "ardenml"}, {"score": 0.004776669953449352, "phrase": "medical_decisions"}, {"score": 0.004701015188740582, "phrase": "new_model"}, {"score": 0.004608121749000898, "phrase": "extensible_markup_language"}, {"score": 0.004039221742250308, "phrase": "arden_syntax_markup_language"}, {"score": 0.0038043055953253047, "phrase": "html_formats"}, {"score": 0.0034981163169818803, "phrase": "transformed_mlm"}, {"score": 0.003255295296893174, "phrase": "original_mlms"}, {"score": 0.0032037548801418497, "phrase": "xml"}, {"score": 0.0031528393611136704, "phrase": "proposed_xml_schema"}, {"score": 0.0031277316566463978, "phrase": "reverse-parsed_mlms"}, {"score": 0.0030414140732789186, "phrase": "public_domain_arden_syntax_checker"}, {"score": 0.002571171956724731, "phrase": "statement_structure"}, {"score": 0.002530359917257626, "phrase": "xml_version"}, {"score": 0.002326464619238653, "phrase": "xsl_style_sheet"}, {"score": 0.002147540520631409, "phrase": "style_sheets"}], "paper_keywords": ["clinical decision support systems", " Arden Syntax", " XML", " XSLT", " XSL style sheet", " compiler"], "paper_abstract": "Purpose: A new model expressing Arden Syntax with the eXtensible Markup Language (XML) was developed to increase its portability. Methods: Every example was manually parsed and reviewed until the schema and the style sheet were considered to be optimized. When the first schema was finished, several MLMs in Arden Syntax Markup Language (ArdenML) were validated against the schema. They were then transformed to HTML formats with the style sheet, during which they were compared to the original text version of their own MLM. When faults were found in the transformed MLM, the schema and/or style sheet was fixed. This cycle continued until all the examples were encoded into XML documents. The original MLMs were encoded in XML according to the proposed XML schema and reverse-parsed MLMs in ArdenML were checked using a public domain Arden Syntax checker. Results: Two hundred seventy seven examples of MLMs were successfully transformed into XML documents using the model, and the reverse-parse yielded the original text version of MLMs. TWO hundred sixty five of the 277 MLMs showed the same error patterns before and after transformation, and all 11 errors related to statement structure were resolved in XML version. The model uses two syntax checking mechanisms, first an XML validation process, and second, a syntax check using an XSL style sheet. Conclusion: Now that we have a schema for ArdenML, we can also begin the development of style sheets for transformation ArdenML into other languages. (c) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Modeling the Arden Syntax for medical decisions in XML", "paper_id": "WOS:000259357000002"}