{"auto_keywords": [{"score": 0.011170141046166196, "phrase": "key_tasks"}, {"score": 0.008713768692145006, "phrase": "real-time_intelligent_order_processing_system"}, {"score": 0.006035156448905209, "phrase": "real-time_intelligent_order_processing"}, {"score": 0.005140850691729498, "phrase": "three-layer_hierarchical_structure"}, {"score": 0.004724878518219719, "phrase": "today's_challenging_issues"}, {"score": 0.004506968388996092, "phrase": "customers'_orders"}, {"score": 0.004258644418211771, "phrase": "goods_quantity"}, {"score": 0.003766369160795001, "phrase": "agent_technologies"}, {"score": 0.0035587046945919788, "phrase": "e-commerce_environment"}, {"score": 0.0031920445513574907, "phrase": "manual_order_processing"}, {"score": 0.003015950477134494, "phrase": "artificial_intelligence"}, {"score": 0.0027050595279115015, "phrase": "multi-agent_systematic_structure"}, {"score": 0.002580061425699194, "phrase": "agent_structure"}, {"score": 0.0025436978068459565, "phrase": "corresponding_key_task"}, {"score": 0.0022070310530794097, "phrase": "application_results"}, {"score": 0.0021049977753042253, "phrase": "intelligence_and_real-time_performance"}], "paper_keywords": ["E-Commerce", " Order processing", " Real-time", " Agent", " Artificial Intelligence"], "paper_abstract": "The development of a real-time intelligent order processing system is one of today's challenging issues in B2C e-Commerce. This kind of systems can process customers' orders intelligently and real-timely based on their requirements, such as goods quantity and expected delivery time. However, this kind of systems applicable in B2C e-Commerce is scarce. Hence, we aim to develop such a system by agent technologies in B2C e-Commerce. The system is a robust one applicable in e-Commerce environment. In the paper, we analyze the key tasks and the flow of real-time intelligent order processing in e-Commerce through making reference to manual order processing. The principles of these key tasks with theories and technologies of Artificial Intelligence are investigated. Based on the analysis of the key tasks, a three-layer hierarchical structure of the real-time intelligent order processing in B2C e-Commerce is presented and a multi-agent systematic structure of the processing is designed, in which each agent structure for the corresponding key task is designed according to the three-layer hierarchical structure. Finally, we develop the real-time intelligent order processing system for an online urban bookstore to demonstrate the feasibility of the system in B2C e-Commerce. The application results show that the research is beneficial to improving the intelligence and real-time performance of e-Commerce order processing.", "paper_title": "A REAL-TIME INTELLIGENT SYSTEM FOR ORDER PROCESSING IN B2C E-COMMERCE", "paper_id": "WOS:000271918900008"}