{"auto_keywords": [{"score": 0.048358025806347196, "phrase": "general_sparse_graphs"}, {"score": 0.04607207878691074, "phrase": "edge_modifications"}, {"score": 0.03447356329610455, "phrase": "fischer"}, {"score": 0.034287434471945516, "phrase": "newman"}, {"score": 0.02925771137236527, "phrase": "query_complexity"}, {"score": 0.00481495049065317, "phrase": "sparse_graphs"}, {"score": 0.0045903243893123105, "phrase": "predetermined_graph_property"}, {"score": 0.004577440795549049, "phrase": "p._that"}, {"score": 0.004488257921051031, "phrase": "sublinear_algorithms"}, {"score": 0.004090577229368418, "phrase": "upper_bound_m"}, {"score": 0.003899612025233852, "phrase": "n_vertices"}, {"score": 0.0034166271604770576, "phrase": "parnas_et_al"}, {"score": 0.00319348234663792, "phrase": "dense_graphs_model"}, {"score": 0.0028373742057129126, "phrase": "graph_property"}, {"score": 0.002805597755796506, "phrase": "testing_algorithm"}, {"score": 0.00266693888510356, "phrase": "distance_approximation_algorithm"}, {"score": 0.002443970765041351, "phrase": "efficient_testing_algorithms"}, {"score": 0.002430268054788192, "phrase": "goldreich"}, {"score": 0.0023560952790080943, "phrase": "k-edge_connectivity"}, {"score": 0.0023166075278110237, "phrase": "constant-size_subgraphs"}, {"score": 0.0022842059306412304, "phrase": "eulerian_graph"}, {"score": 0.0021896891011033105, "phrase": "minimum_vertex_cover"}, {"score": 0.0021590588269751816, "phrase": "sublinear_time"}, {"score": 0.0021168934012668755, "phrase": "recent_result"}, {"score": 0.002104998088791, "phrase": "parnas"}], "paper_keywords": ["Sublinear approximation algorithms", " property testing", " distance approximation", " graph properties"], "paper_abstract": "We address the problem of approximating the distance of bounded-degree and general sparse graphs from having some predetermined graph property P. That is, we are interested in sublinear algorithms for estimating the fraction of edge modifications (additions or deletions) that must be performed on a graph so that it obtains P. This fraction is taken with respect to a given upper bound m on the number of edges. In particular, for graphs with degree bound d over n vertices, m = dn. To perform such an approximation the algorithm may ask for the degree of any vertex of its choice, and may ask for the neighbors of any vertex. The problem of estimating the distance to having a property was first explicitly addressed by Parnas et al. [2006]. In the context of graphs this problem was studied by Fischer and Newman [2007] in the dense graphs model. In this model the fraction of edge modifications is taken with respect to n(2), and the algorithm may ask for the existence of an edge between any pair of vertices of its choice. Fischer and Newman showed that every graph property that has a testing algorithm in this model, with query complexity independent of the size of the graph, also has a distance approximation algorithm with query complexity that is independent of the size of graph. In this work we focus on bounded-degree and general sparse graphs, and give algorithms for all properties shown to have efficient testing algorithms by Goldreich and Ron [2002]. Specifically, these properties are k-edge connectivity, subgraph freeness (for constant-size subgraphs), being an Eulerian graph, and cycle freeness. A variant of our subgraph-freeness algorithm approximates the size of a minimum vertex cover of a graph in sublinear time. This approximation improves on a recent result of Parnas and Ron [2007].", "paper_title": "Approximating the Distance to Properties in Bounded-Degree and General Sparse Graphs", "paper_id": "WOS:000265882400008"}