{"auto_keywords": [{"score": 0.03317679677856877, "phrase": "virtual_anesthesiologist"}, {"score": 0.014858029475795361, "phrase": "virtual_teammates"}, {"score": 0.010465010325789422, "phrase": "virtual_surgeon"}, {"score": 0.010115213120635565, "phrase": "human_confederate"}, {"score": 0.00481495049065317, "phrase": "virtual_humans"}, {"score": 0.004247560712327667, "phrase": "physical_presence"}, {"score": 0.0036207206487324506, "phrase": "simulated_health_care_team"}, {"score": 0.0034004869983267085, "phrase": "participants'_teammates"}, {"score": 0.0027218799769229596, "phrase": "human_confederates"}, {"score": 0.0024005409468262203, "phrase": "interaction_effect"}, {"score": 0.0023463203637929466, "phrase": "behavioral_realism"}, {"score": 0.002153653728048424, "phrase": "participants'_expectations"}, {"score": 0.0021049977753042253, "phrase": "human_surgeon"}], "paper_keywords": ["Virtual/digital characters", " mixed reality", " training", " user studies"], "paper_abstract": "In this paper we present a study exploring whether the physical presence of another human changes how people perceive and behave with virtual teammates. We conducted a study (n = 69) in which nurses worked with a simulated health care team to prepare a patient for surgery. The agency of participants' teammates was varied between conditions; participants either worked with a virtual surgeon and a virtual anesthesiologist, a human confederate playing a surgeon and a virtual anesthesiologist, or a virtual surgeon and a human confederate playing an anesthesiologist. While participants perceived the human confederates to have more social presence (p < 0.01), participants did not preferentially agree with their human team members. We also observed an interaction effect between agency and behavioral realism. Participants experienced less social presence from the virtual anesthesiologist, whose behavior was less in line with participants' expectations, when a human surgeon was present.", "paper_title": "Teaming Up With Virtual Humans: How Other People Change Our Perceptions of and Behavior with Virtual Teammates", "paper_id": "WOS:000351757000011"}