{"auto_keywords": [{"score": 0.0444227308407221, "phrase": "decision_support"}, {"score": 0.015719716506582538, "phrase": "textile_and_apparel_supply_chain"}, {"score": 0.015146429264657528, "phrase": "research_articles"}, {"score": 0.013716422713538321, "phrase": "intelligent_systems"}, {"score": 0.004466519142879166, "phrase": "comprehensive_review"}, {"score": 0.004117329555194574, "phrase": "textile_and_apparel_supply_chains"}, {"score": 0.0031056437850836326, "phrase": "categorized_journal_articles"}, {"score": 0.002953711377604328, "phrase": "relevant_references"}, {"score": 0.0025569530630374995, "phrase": "developed_classification_framework"}, {"score": 0.0023566987138026285, "phrase": "artificial_intelligent_systems"}, {"score": 0.0022696277881969896, "phrase": "potential_and_applicable_research_areas"}, {"score": 0.0021857667493036786, "phrase": "subject_area"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Decision support and intelligent systems", " Textile and apparel supply chain", " Literature review"], "paper_abstract": "This article provides a comprehensive review of research articles related to the application of decision support and intelligent systems in the textile and apparel supply chains. Data were obtained from 77 articles published from 1994 to 2009 in 35 journals. The articles were categorized according to their applicability into three basic sectors - textile production, apparel manufacture, and distribution/sales. They were further categorized into 16 subsectors based on their operational and management/control processes. A comprehensive list of categorized journal articles identified in this study provides insights and relevant references for both researchers and practitioners on the application of decision support and intelligent systems to various stages of a textile and apparel supply chain. In light of the developed classification framework, we identify gaps in extending the use of the decision support and artificial intelligent systems in the industry and suggest potential and applicable research areas for further consideration in this subject area. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Decision support and intelligent systems in the textile and apparel supply chain: An academic review of research articles", "paper_id": "WOS:000326214800009"}