{"auto_keywords": [{"score": 0.04478688365692728, "phrase": "decision_makers"}, {"score": 0.013141522873234777, "phrase": "positive_attributes"}, {"score": 0.007054842343680893, "phrase": "value_function"}, {"score": 0.005877490339683503, "phrase": "negative_attributes"}, {"score": 0.00481495049065317, "phrase": "decision-making_process"}, {"score": 0.004769616966550469, "phrase": "decision-making_goals"}, {"score": 0.004743692946591871, "phrase": "agents_opinions"}, {"score": 0.004724708238414131, "phrase": "feasible_alternatives"}, {"score": 0.0046069985410261746, "phrase": "determination_steps"}, {"score": 0.004578030096508602, "phrase": "evaluation_step"}, {"score": 0.004164644263639545, "phrase": "rather_a_classic_one"}, {"score": 0.004099455381916337, "phrase": "evaluation_model_construction"}, {"score": 0.0038853212888610234, "phrase": "human_beings"}, {"score": 0.003545439507880801, "phrase": "evaluation_model"}, {"score": 0.0031544754107802413, "phrase": "decision_problem"}, {"score": 0.002719212119462965, "phrase": "first_ones"}, {"score": 0.002676587673012276, "phrase": "later_ones"}, {"score": 0.002426795311298483, "phrase": "problem_specification"}, {"score": 0.0022709326810964386, "phrase": "attributes_values"}, {"score": 0.002228263890334039, "phrase": "selectability_measure"}, {"score": 0.0022142194702079866, "phrase": "negative_ones"}, {"score": 0.0021657559361692494, "phrase": "rejectability_measure"}, {"score": 0.0021049977753042253, "phrase": "game_theory"}], "paper_keywords": ["Evaluation model", " multiattributes-multiagents decision making", " satisficing game theory", " value function"], "paper_abstract": "This paper considers the evaluation step in a decision-making process that follows decision-making goals setting, feasible alternatives and attributes or criteria that characterize them determination steps. Evaluation step must establish a model or algorithm to evaluate alternatives taking into account their performances with regard to criteria as well as decision makers or stakeholders preferences. Though this problem is rather a classic one, researches related to evaluation model construction continue to be active to find models that cope with more realities or that fit well how human beings behave in group and proceed when facing the problem of choosing, ranking or sorting alternatives or options. The purpose of this paper is to construct an evaluation model that integrate the performances of alternatives with regard to attributes or criteria and decision makers or agents opinions with regard to the importance to assign to each criterion in order to obtain a value function. As any decision problem is almost always a matter of trade-off, among attributes characterizing alternatives there will be those acting toward the achievement of decision makers goal (benefit) and those that decision makers would like to reduce as much as possible (cost); we will designate the first ones as positive attributes and the later ones as negative attributes. The process of dividing attributes into positive attributes and negative attributes is beyond the scope of this paper and this partition will be considered as a part of the problem specification. The model is constructed in two steps: firstly, satisfiability (selectability and rejectability) measures or functions are obtained for each alternative using attributes values (positive attributes will contribute to selectability measure whereas negative ones are used in the derivation of rejectability measure) and agents opinions in the framework of satisficing game theory and secondly a value function is built on that measures. Agents opinions with regard to attributes will be expressed locally by weighting them by category (positive/negative).", "paper_title": "EVALUATION MODEL FOR MULTIATTRIBUTES-MULTIAGENTS DECISION MAKING: SATISFICING GAME APPROACH", "paper_id": "WOS:000265208600005"}