{"auto_keywords": [{"score": 0.0482650857509263, "phrase": "undrained_conditions"}, {"score": 0.008893480035436914, "phrase": "hydraulic_and_mechanical_behaviour"}, {"score": 0.0077433164800404, "phrase": "stress-strain_behaviour"}, {"score": 0.00481495049065317, "phrase": "hydro-mechanical_behaviour"}, {"score": 0.00445712058827745, "phrase": "hydro-mechanical_elastoplastic_constitutive_models"}, {"score": 0.0032972747743006603, "phrase": "soil-water_characteristic_response"}, {"score": 0.0026143990748127253, "phrase": "soil-water_characteristic_responses"}, {"score": 0.002476546030310661, "phrase": "constant_gravimetric_water_contents"}, {"score": 0.0023099082804523044, "phrase": "unsaturated_soil_model"}, {"score": 0.0021544587602892466, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "undrained_isotropic_compression_and_triaxial_compression_tests"}], "paper_keywords": ["Unsaturated soil", " Undrained soil behaviour", " Elastoplastic model", " Soil-water characteristic behaviour"], "paper_abstract": "A number of hydro-mechanical elastoplastic constitutive models for unsaturated soils have recently been proposed. These models couple the hydraulic and mechanical behaviour of unsaturated soils. and take into account the effects of the degree of saturation on the stress-strain behaviour and the effects of deformation on the soil-water characteristic response. In addition, the influence of the suction on the stress-strain behaviour is considered. However, until now, there is no model that predicts the stress-strain and soil-water characteristic responses of unsaturated soils under undrained conditions or constant gravimetric water contents. This paper presents the predictions of an unsaturated soil model for undrained conditions. and compares these predictions with experimental results obtained from undrained isotropic compression and triaxial compression tests on an unsaturated compacted soil. It is shown that the model predicts the hydraulic and mechanical behaviour of unsaturated soil accurately under undrained conditions. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Elastoplastic prediction of hydro-mechanical behaviour of unsaturated soils under undrained conditions", "paper_id": "WOS:000261365800005"}