{"auto_keywords": [{"score": 0.03312776849762023, "phrase": "haplotype_assembly_problem"}, {"score": 0.00481495049065317, "phrase": "haplotype_assembly"}, {"score": 0.0047846807459660376, "phrase": "whole-genome_sequence_data"}, {"score": 0.004724708238414131, "phrase": "haplotype_inference"}, {"score": 0.004680220363692397, "phrase": "important_step"}, {"score": 0.004592491583367684, "phrase": "genetic_variation"}, {"score": 0.004549242970806199, "phrase": "human_genome"}, {"score": 0.00452063603944825, "phrase": "traditional_approaches"}, {"score": 0.004435885269134359, "phrase": "genotype_information"}, {"score": 0.004298134888203576, "phrase": "haplotype_inference_algorithm"}, {"score": 0.0042308653646339405, "phrase": "high-throughput_sequencing_technologies"}, {"score": 0.004177805391358892, "phrase": "alternative_strategy"}, {"score": 0.004099455381916337, "phrase": "sequence_fragments"}, {"score": 0.004035282762331904, "phrase": "'haplotype_assembly"}, {"score": 0.0035678974387440914, "phrase": "reference_genome"}, {"score": 0.003340353010317943, "phrase": "np"}, {"score": 0.003235193484261443, "phrase": "existing_greedy_and_stochastic_algorithms"}, {"score": 0.0031644543425642544, "phrase": "optimal_solutions"}, {"score": 0.003027568488234868, "phrase": "dynamic_programming_algorithm"}, {"score": 0.002933422608537915, "phrase": "time_complexity"}, {"score": 0.002676587673012276, "phrase": "total_number"}, {"score": 0.002560751416355291, "phrase": "maximum_satisfiability_problem"}, {"score": 0.00238120499061399, "phrase": "simulation_experiments"}, {"score": 0.0022781229833499753, "phrase": "current_sequencing_technologies"}, {"score": 0.0021589195238286233, "phrase": "traditional_haplotype_phasing_approaches"}], "paper_keywords": [""], "paper_abstract": "Motivation: Haplotype inference is an important step for many types of analyses of genetic variation in the human genome. Traditional approaches for obtaining haplotypes involve collecting genotype information from a population of individuals and then applying a haplotype inference algorithm. The development of high-throughput sequencing technologies allows for an alternative strategy to obtain haplotypes by combining sequence fragments. The problem of 'haplotype assembly' is the problem of assembling the two haplotypes for a chromosome given the collection of such fragments, or reads, and their locations in the haplotypes, which are pre-determined by mapping the reads to a reference genome. Errors in reads significantly increase the difficulty of the problem and it has been shown that the problem is NP-hard even for reads of length 2. Existing greedy and stochastic algorithms are not guaranteed to find the optimal solutions for the haplotype assembly problem. Results: In this article, we proposed a dynamic programming algorithm that is able to assemble the haplotypes optimally with time complexity O(m x 2(k) x n), where m is the number of reads, k is the length of the longest read and n is the total number of SNPs in the haplotypes. We also reduce the haplotype assembly problem into the maximum satisfiability problem that can often be solved optimally even when k is large. Taking advantage of the efficiency of our algorithm, we perform simulation experiments demonstrating that the assembly of haplotypes using reads of length typical of the current sequencing technologies is not practical. However, we demonstrate that the combination of this approach and the traditional haplotype phasing approaches allow us to practically construct haplotypes containing both common and rare variants.", "paper_title": "Optimal algorithms for haplotype assembly from whole-genome sequence data", "paper_id": "WOS:000278689000023"}