{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clinical_data"}, {"score": 0.004312622975366672, "phrase": "electronic_health_record"}, {"score": 0.0037921662574137535, "phrase": "redundant_data_capture"}, {"score": 0.0037459885494311217, "phrase": "cumbersome_documentation_processes"}, {"score": 0.003375429082739004, "phrase": "ideal_future_state"}, {"score": 0.002985988377995789, "phrase": "technology-enabled_healthcare_environment"}, {"score": 0.002791239714439304, "phrase": "patient_care"}, {"score": 0.0027572166867780275, "phrase": "improved_outcomes"}, {"score": 0.002499508839669243, "phrase": "care_delivery"}, {"score": 0.002424012799998538, "phrase": "meeting_deliberations"}, {"score": 0.0023652572260178637, "phrase": "policy_recommendations"}, {"score": 0.002336414425972225, "phrase": "research_priorities"}, {"score": 0.002224510044064184, "phrase": "national_strategy"}, {"score": 0.002157302200451323, "phrase": "public_policies"}, {"score": 0.0021049977753042253, "phrase": "technology-enabled_data_capture"}], "paper_keywords": [""], "paper_abstract": "Much of what is currently documented in the electronic health record is in response toincreasingly complex and prescriptive medicolegal, reimbursement, and regulatory requirements. These requirements often result in redundant data capture and cumbersome documentation processes. AMIA's 2011 Health Policy Meeting examined key issues in this arena and envisioned changes to help move toward an ideal future state of clinical data capture and documentation. The consensus of the meeting was that, in the move to a technology-enabled healthcare environment, the main purpose of documentation should be to support patient care and improved outcomes for individuals and populations and that documentation for other purposes should be generated as a byproduct of care delivery. This paper summarizes meeting deliberations, and highlights policy recommendations and research priorities. The authors recommend development of a national strategy to review and amend public policies to better support technology-enabled data capture and documentation practices.", "paper_title": "The future state of clinical data capture and documentation: a report from AMIA's 2011 Policy Meeting", "paper_id": "WOS:000313512900022"}