{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nested_canalyzing_functions"}, {"score": 0.015107390904184727, "phrase": "singleton_attractor"}, {"score": 0.014852211227339733, "phrase": "boolean_network"}, {"score": 0.0077979573989410255, "phrase": "positive_self-loops"}, {"score": 0.004268437506733815, "phrase": "boolean"}, {"score": 0.004007083686875716, "phrase": "boolean_functions"}, {"score": 0.003006654007926993, "phrase": "time_algorithm"}, {"score": 0.0026955672787561742, "phrase": "n_nested_canalyzing_functions"}, {"score": 0.0025596276616952516, "phrase": "previous_study"}, {"score": 0.0023079225317714815, "phrase": "improved_satisfiability_algorithm"}, {"score": 0.0021049977753042253, "phrase": "general_case"}], "paper_keywords": ["SAT", " Boolean network", " singleton attractor", " nested canalyzing function"], "paper_abstract": "We study the problem of finding a 0-1 assignment to Boolean variables satisfying a given set of nested canalyzing functions, a class of Boolean functions that is known to be of interest in biology. For this problem, an extension of the satisfiability problem for a conjunctive normal form formula, an O(min(2(k), 2((k+m)/2))poly(m)) time algorithm has been known, where m and k are the number of nested canalyzing functions and variables, respectively. Here we present an improved O(min(2(k), 1.325(k+m), 2(m))poly(m)) time algorithm for this problem. We also study the problem of finding a singleton attractor of a Boolean network consisting of n nested canalyzing functions. Although an O(1.799(n)) time algorithm was proposed in a previous study, it was implicitly assumed that the network does not contain any positive self-loops. By utilizing the improved satisfiability algorithm for nested canalyzing functions, while allowing for the presence of positive self-loops, we show that the general case can be solved in O(1.871(n)) time.", "paper_title": "An Improved Satisfiability Algorithm for Nested Canalyzing Functions and its Application to Determining a Singleton Attractor of a Boolean Network", "paper_id": "WOS:000327218500002"}