{"auto_keywords": [{"score": 0.040355626803123, "phrase": "total_cost"}, {"score": 0.008713768692145006, "phrase": "set_cover_games"}, {"score": 0.00723782310201251, "phrase": "cost_allocation_method"}, {"score": 0.004635507578627093, "phrase": "selfish_agents"}, {"score": 0.004336115760817672, "phrase": "cost_sharing"}, {"score": 0.0042859292226559535, "phrase": "single_set_cover_game"}, {"score": 0.004171065188039856, "phrase": "budget-balanced_mechanism"}, {"score": 0.0033429545815200825, "phrase": "maximum_size"}, {"score": 0.003228101865545105, "phrase": "cost_allocation_scheme"}, {"score": 0.0031906984691667246, "phrase": "induced_subgames"}, {"score": 0.0031050953733360825, "phrase": "cost_sharing_scheme"}, {"score": 0.002884111441153185, "phrase": "efficient_cost_sharing_scheme"}, {"score": 0.002536926192232391, "phrase": "privately_known_valuations"}, {"score": 0.00238392747425758, "phrase": "simple_sets"}, {"score": 0.002310915790114425, "phrase": "set_cover"}, {"score": 0.0022141537427057363, "phrase": "optimal_solution"}, {"score": 0.0021463304704817873, "phrase": "privately_known_costs"}, {"score": 0.0021049977753042253, "phrase": "strategyproof_payment_mechanism"}], "paper_keywords": ["Set cover", " Selfish agent", " Mechanism design", " Pricing"], "paper_abstract": "We develop for set cover games several general cost-sharing methods that are approximately budget-balanced, in the core, and/or group-strategyproof. We first study the cost sharing for a single set cover game, which does not have a budget-balanced mechanism in the core. We show that there is no cost allocation method that can always recover more than 1/lnn of the total cost and in the core. Here n is the number of all players to be served. We give a cost allocation method that always recovers 1/lnd(max) of the total cost, where d(max) is the maximum size of all sets. We then study the cost allocation scheme for all induced subgames. It is known that no cost sharing scheme can always recover more than 1/n of the total cost for every subset of players. We give an efficient cost sharing scheme that always recovers at least 1/2n of the total cost for every subset of players and furthermore, our scheme is cross-monotone. When the elements to be covered are selfish agents with privately known valuations, we present a strategyproof charging mechanism, under the assumption that all sets are simple sets; further, the total cost of the set cover is no more than lnd(max) times that of an optimal solution. When the sets are selfish agents with privately known costs, we present a strategyproof payment mechanism to them. We also show how to fairly share the payments to all sets among the elements.", "paper_title": "Cost sharing and strategyproof mechanisms for set cover games", "paper_id": "WOS:000282050100004"}