{"auto_keywords": [{"score": 0.04971245563968758, "phrase": "social_clouds"}, {"score": 0.0297900748542925, "phrase": "cometcloud"}, {"score": 0.00481495049065317, "phrase": "resource_sharing"}, {"score": 0.004545240514015278, "phrase": "social_networkleveraging"}, {"score": 0.003957735532719663, "phrase": "significant_potential"}, {"score": 0.003912335018240945, "phrase": "resource_utilization"}, {"score": 0.0038674532861321864, "phrase": "available_additional_capacity"}, {"score": 0.0037215192436590772, "phrase": "important_hurdle"}, {"score": 0.0035536228914319354, "phrase": "socioeconomic_model"}, {"score": 0.003512841739654183, "phrase": "silvio_gesell"}, {"score": 0.003445906915464945, "phrase": "virtual_currency"}, {"score": 0.0029428772818833166, "phrase": "successfully_completed_transactions"}, {"score": 0.0027564303939865476, "phrase": "autonomic_computing_engine"}, {"score": 0.002735284807307981, "phrase": "cloud_and_grid_environments"}, {"score": 0.0026218430041123164, "phrase": "autonomic_cloudbursts"}, {"score": 0.0022648637058989463, "phrase": "extended_version"}, {"score": 0.0022302306304023602, "phrase": "intermediary_relay_nodes"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["social clouds", " resource sharing", " trading markets"], "paper_abstract": "Social Clouds provide the capability to share resources among participants within a social networkleveraging on the trust relationships already existing between such participants. In such a system, users are able to trade resources between each other rather than make use of capability offered at a (centralized) data center. Although such an environment has significant potential for improving resource utilization and making available additional capacity that remains dormant, incentives for sharing remain an important hurdle limiting its effective. In this paper, we utilize the socioeconomic model proposed by Silvio Gesell to demonstrate how a virtual currency' can be used to incentivise sharing of resources within a community'. We subsequently demonstrate, through simulations, the benefit provided to participants within such a community using a variety of economic (such as overall credits gained) and technical (number of successfully completed transactions) metrics. Further, we describe our implementation of such a Social Cloud using CometCloud. CometCloud is an autonomic computing engine for cloud and grid environments. It supports highly heterogeneous and dynamic federated cloud/Grid infrastructures, integration of public/private clouds and autonomic cloudbursts. We demonstrate the implementation of two designs on the basis of the master/worker approach: (i) one tuple space per cluster and (ii) one coordination tuple space and multiple transient spacesone per each cluster. Finally, we discuss an extended version of our Social Cloud model where intermediary relay nodes take on more active roles as traders in a transaction. Copyright (c) 2013 John Wiley & Sons, Ltd.", "paper_title": "Incentivising resource sharing in social clouds", "paper_id": "WOS:000351683600008"}