{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "audience_response_system"}, {"score": 0.045502886409635256, "phrase": "sistema_de_respuesta"}, {"score": 0.015487882988172833, "phrase": "emergency_situations"}, {"score": 0.004602773636967002, "phrase": "empirical_study"}, {"score": 0.004205940624913343, "phrase": "nursing_course"}, {"score": 0.0034940519373446335, "phrase": "innovative_aspect"}, {"score": 0.003036333273800443, "phrase": "students'_response_time"}, {"score": 0.0029909851863915283, "phrase": "critical_situations"}, {"score": 0.002946312377831317, "phrase": "nursing_resources"}, {"score": 0.002902304851882577, "phrase": "positive_impact"}, {"score": 0.002858952758523772, "phrase": "students'_performance"}, {"score": 0.0026516890043911836, "phrase": "student_participation"}, {"score": 0.0023040642263522505, "phrase": "additional_lectures"}, {"score": 0.0021912600076114033, "phrase": "sistema_de_respuesta_inmediata_dela_audiencia"}], "paper_keywords": ["Audience response system", " Computer-assisted instruction", " Education", " Evaluation", " Nursing"], "paper_abstract": "This article presents an empirical study on the effectiveness of the use of an audience response system called SIstema De Respuesta inmediata de la Audiencia on a nursing course. A total of 130 students of mixed gender, age, and computer experience and educational background on a third-year course in nursing administration and management participated in the study. The benefits of an audience response system as regards learning how to confront emergency situations were studied. The innovative aspect of the proposal is twofold: (1) the use of a smartphone to respond to the questions and (2) the analysis of the students' response time when confronting critical situations while managing nursing resources. A positive impact on the students' performance was revealed in their final assessments. Our findings show that SIstema De Respuesta inmediata de la Audiencia increases student participation and aids in identifying and correcting misconceptions. The students found SIstema De Respuesta inmediata de la Audiencia to be very motivating and wanted it to be used in additional lectures. Further research is required to study the effectiveness of SIstema De Respuesta inmediata dela Audiencia for it to be widely used in other disciplines.", "paper_title": "Examining the Benefits of Learning Based on an Audience Response System When Confronting Emergency Situations", "paper_id": "WOS:000338986400002"}