{"auto_keywords": [{"score": 0.04930231023249969, "phrase": "facility_f"}, {"score": 0.04853750751694913, "phrase": "user_u"}, {"score": 0.047659468421911697, "phrase": "k_closest_facilities"}, {"score": 0.04594846582703762, "phrase": "influence_set"}, {"score": 0.03350563390008004, "phrase": "query_logs"}, {"score": 0.004822868165826663, "phrase": "impact"}, {"score": 0.004775726266706856, "phrase": "computing_influence_using_query_logs"}, {"score": 0.004534586620266173, "phrase": "user_u."}, {"score": 0.004166900000605202, "phrase": "extensive_research_attention"}, {"score": 0.003956379470617348, "phrase": "i._e."}, {"score": 0.003797690272118125, "phrase": "real-world_scenarios"}, {"score": 0.003736004578001584, "phrase": "different_values"}, {"score": 0.003451644130735693, "phrase": "constant_value"}, {"score": 0.0031370304755352486, "phrase": "k-nearest_neighbors_queries"}, {"score": 0.003060859331898502, "phrase": "preferred_value"}, {"score": 0.002507414655298049, "phrase": "existing_techniques"}, {"score": 0.0022849068677290836, "phrase": "proposed_algorithm"}, {"score": 0.002266246304762945, "phrase": "novel_access_order"}, {"score": 0.002199115809008107, "phrase": "extensive_experimental_study"}, {"score": 0.002187125185712438, "phrase": "real_and_synthetic_data_sets"}, {"score": 0.0021456694236935783, "phrase": "existing_algorithms"}, {"score": 0.002116539101048156, "phrase": "cpu_cost"}], "paper_keywords": ["spatial queries", " impact set", " influence computation", " RkNN queries", " query logs"], "paper_abstract": "A facility f is said to influence a user u if f is one of the k closest facilities of the user u. This is because users usually prefer to visit/use nearby facilities. The influence set of a facility f is the set of users influenced by f. The computation of the influence set has gained extensive research attention in the past decade. Note that the definition of influence set assumes that each user behaves the same, i. e. each user prefers the k closest facilities where k is a constant. However, in real-world scenarios, different users may prefer different values of k depending on, for example, the density of facilities around them, the mode of transport available to them etc. Therefore, assuming a constant value of k for each usermay not be able to capture the essence of influence effectively. In this paper, we compute the influence of a facility f using the query logs that contain the k-nearest neighbors queries issued in the past and essentially represent the preferred value of k for each user. Specifically, a facility f has an impact on a user u if f is one of the facilities in the answer set of the query issued by the user. The set of such users is called impact set to avoid ambiguity with influence set. To the best of our knowledge, we are the first to study the problem of impact set computation using query logs. Although existing techniques can be extended to compute the impact set, these techniques suffer from several serious limitations. We carefully analyze these limitations and propose an algorithm to answer impact set queries for 2D location data. The proposed algorithm uses a novel access order and several non-trivial observations to address these limitations. We conduct an extensive experimental study on real and synthetic data sets and demonstrate that our algorithm significantly outperforms existing algorithms in terms of both CPU cost and I/O cost.", "paper_title": "Impact Set: Computing Influence Using Query Logs", "paper_id": "WOS:000365157000011"}