{"auto_keywords": [{"score": 0.04038597581803138, "phrase": "reasoning_activities"}, {"score": 0.012851004707248783, "phrase": "visual_syntactic_elements"}, {"score": 0.00481495049065317, "phrase": "whiteboard_sketches"}, {"score": 0.004755353864362941, "phrase": "crucial_role"}, {"score": 0.004716031208088975, "phrase": "software_development"}, {"score": 0.004486800020569973, "phrase": "software_design_problem"}, {"score": 0.0036756196381448015, "phrase": "design_activity"}, {"score": 0.003615016816532732, "phrase": "professional_software_designers"}, {"score": 0.0032044314332538154, "phrase": "rich_medium"}, {"score": 0.0031647054743284947, "phrase": "design_conversations"}, {"score": 0.0030995835539697893, "phrase": "general-purpose_notations"}, {"score": 0.003048449231088915, "phrase": "new_syntactic_elements"}, {"score": 0.0030231983220281836, "phrase": "record_aspects"}, {"score": 0.002948689937518561, "phrase": "re-purpose_sketches"}, {"score": 0.0027133032795773697, "phrase": "complementary_information"}, {"score": 0.0026354246446771324, "phrase": "important_role"}, {"score": 0.0021853532419450887, "phrase": "software_design"}, {"score": 0.0021049977753042253, "phrase": "new_electronic_software_design_sketching_tools"}], "paper_keywords": ["Interaction styles", " systems analysis and design", " user-centered design"], "paper_abstract": "Whiteboard sketches play a crucial role in software development, helping to support groups of designers in reasoning about a software design problem at hand. However, little is known about these sketches and how they support design 'in the moment', particularly in terms of the relationships among sketches, visual syntactic elements within sketches, and reasoning activities. To address this gap, we analyzed 14 hours of design activity by eight pairs of professional software designers, manually coding over 4000 events capturing the introduction of visual syntactic elements into sketches, focus transitions between sketches, and reasoning activities. Our findings indicate that sketches serve as a rich medium for supporting design conversations. Designers often use general-purpose notations. Designers introduce new syntactic elements to record aspects of the design, or re-purpose sketches as the design develops. Designers constantly shift focus between sketches, using groups of sketches together that contain complementary information. Finally, sketches play an important role in supporting several types of reasoning activities (mental simulation, review of progress, consideration of alternatives). But these activities often leave no trace and rarely lead to sketch creation. We discuss the implications of these and other findings for the practice of software design at the whiteboard and for the creation of new electronic software design sketching tools.", "paper_title": "How Software Designers Interact with Sketches at the Whiteboard", "paper_id": "WOS:000351460400002"}