{"auto_keywords": [{"score": 0.035534141969812486, "phrase": "lower_bound"}, {"score": 0.015719716506582538, "phrase": "rejection_penalties"}, {"score": 0.013044807621322645, "phrase": "total_size"}, {"score": 0.011925614224732952, "phrase": "rejected_items"}, {"score": 0.011176831731751052, "phrase": "absolute_competitive_ratio"}, {"score": 0.010241790171982715, "phrase": "absolute_worst-case_ratio"}, {"score": 0.0046021431217333824, "phrase": "n_items"}, {"score": 0.0044767303410855825, "phrase": "unit-capacity_bins"}, {"score": 0.003726439383466603, "phrase": "total_number"}, {"score": 0.003707751244896586, "phrase": "used_bins"}, {"score": 0.003679893968861111, "phrase": "total_penalty"}, {"score": 0.0035082436540296406, "phrase": "bpr."}, {"score": 0.003481880090562682, "phrase": "on-line_bpr_problem"}, {"score": 0.0032944860410108723, "phrase": "asymptotic_competitive_ratio"}, {"score": 0.0031885139865794627, "phrase": "off-line_bpr_problem"}, {"score": 0.0030168610393007905, "phrase": "asymptotic_worst-case_ratio"}, {"score": 0.002956752799223351, "phrase": "closely_related_bin"}, {"score": 0.0025424177449894928, "phrase": "covered_bins"}, {"score": 0.0025232937404892366, "phrase": "total_profit"}, {"score": 0.0024729949917381656, "phrase": "problem_bin"}, {"score": 0.0024115257691697954, "phrase": "on-line_bcr_problem"}, {"score": 0.002224883434245903, "phrase": "off-line_bcr_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["bin packing", " bin covering", " approximation algorithm", " on-line", " off-line"], "paper_abstract": "In this paper we consider the following problems: we are given a set or n items {u(1),., u(n)} and a number of unit-capacity bins. Each item u(i) has a size w(i) is an element of (0,1] and a penalty p(i)>= 0. An item can be either rejected, in which case we pay its penalty, or put into one bin under the constraint that the total size of the items in the bin is no greater than 1. No item can be spread into more than one bin. The objective is to minimize the total number of used bins plus the total penalty paid for the rejected items. We call the problem bin packing with rejection penalties, and denote it as BPR. For the on-line BPR problem, we present an algorithm with an absolute competitive ratio of 2.618 while the lower bound is 2.343, and an algorithm with an asymptotic competitive ratio arbitrarily close to 1.75 while the lower bound is 1.540. For the off-line BPR problem, we present an algorithm with an absolute worst-case ratio of 2 while the lower bound is 1.5, and an algorithm with an asymptotic worst-case ratio of 1.5. We also study a closely related bin covering version of the problem. In this case pi means some amount of profit. If an item is rejected, we get its profit, or it can be put into a bin in such a way that the total size of the items in the bin is no smaller than 1. The objective is to maximize the number of covered bins plus the total profit of all rejected items. We call this problem bin covering with rejection (BCR). For the on-line BCR problem, we show that no algorithm can have absolute competitive ratio greater than 0, and present an algorithm with asymptotic competitive ratio 1/2, which is the best possible. For the off-line BCR problem, we also present an algorithm with an absolute worst-case ratio of 1/2 which matches the lower bound. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Bin packing problems with rejection penalties and their dual problems", "paper_id": "WOS:000237898400006"}