{"auto_keywords": [{"score": 0.03957953181191268, "phrase": "quadai"}, {"score": 0.03577039134305887, "phrase": "improvement_strategy"}, {"score": 0.00481495049065317, "phrase": "model-driven_software_architecture_evaluation"}, {"score": 0.0045694710501318235, "phrase": "early_stages"}, {"score": 0.0045443671106012405, "phrase": "software_development"}, {"score": 0.004457579615095599, "phrase": "non-functional_requirements"}, {"score": 0.004241914481080374, "phrase": "software_product_line"}, {"score": 0.004218628789430552, "phrase": "spl"}, {"score": 0.0040366412779632085, "phrase": "particular_product"}, {"score": 0.003959511669449491, "phrase": "variation_mechanisms"}, {"score": 0.003916098498242888, "phrase": "product_line_architecture"}, {"score": 0.0038838500580958744, "phrase": "additional_transformations"}, {"score": 0.003645243249045028, "phrase": "software_architectures"}, {"score": 0.0036251983768532925, "phrase": "model-driven_spl_development"}, {"score": 0.003300761155206029, "phrase": "computer_science_master's"}, {"score": 0.003255707600131717, "phrase": "spain"}, {"score": 0.003237900345865809, "phrase": "italy"}, {"score": 0.0028596699752849682, "phrase": "main_result"}, {"score": 0.0027211030647461324, "phrase": "better_values"}, {"score": 0.0024434201175883674, "phrase": "individual_experiments"}, {"score": 0.0023314031342800013, "phrase": "better_results"}, {"score": 0.0023185730456834583, "phrase": "atam"}, {"score": 0.002243011652519744, "phrase": "promising_approach"}, {"score": 0.0022122603123901114, "phrase": "architectural_evaluations"}, {"score": 0.002181929646379379, "phrase": "product_architecture_derivation"}, {"score": 0.002169913882675254, "phrase": "model-driven_spl_development_processes"}, {"score": 0.0021401625519713577, "phrase": "novice_software_evaluators"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software architectures", " Software architecture evaluation methods", " Quality attributes", " ATAM", " Family of experiments", " Meta-analysis"], "paper_abstract": "Context: Software architectures should be evaluated during the early stages of software development in order to verify whether the non-functional requirements (NFRs) of the product can be fulfilled. This activity is even more crucial in software product line (SPL) development, since it is also necessary to identify whether the NFRs of a particular product can be achieved by exercising the variation mechanisms provided by the product line architecture or whether additional transformations are required. These issues have motivated us to propose QuaDAI, a method for the derivation, evaluation and improvement of software architectures in model-driven SPL development. Objective: We present in this paper the results of a family of four experiments carried out to empirically validate the evaluation and improvement strategy of QuaDAI. Method: The family of experiments was carried out by 92 participants: Computer Science Master's and undergraduate students from Spain and Italy. The goal was to compare the effectiveness, efficiency, perceived ease of use, perceived usefulness and intention to use with regard to participants using the evaluation and improvement strategy of QuaDAI as opposed to the Architecture Tradeoff Analysis Method (ATAM). Results: The main result was that the participants produced their best results when applying QuaDAI, signifying that the participants obtained architectures with better values for the NFRs faster, and that they found the method easier to use, more useful and more likely to be used. The results of the meta-analysis carried out to aggregate the results obtained in the individual experiments also confirmed these results. Conclusions: The results support the hypothesis that QuaDAI would achieve better results than ATAM in the experiments and that QuaDAI can be considered as a promising approach with which to perform architectural evaluations that occur after the product architecture derivation in model-driven SPL development processes when carried out by novice software evaluators. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Validating a model-driven software architecture evaluation and improvement method: A family of experiments", "paper_id": "WOS:000345947500024"}