{"auto_keywords": [{"score": 0.04484681558552234, "phrase": "ubiquito"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_adaptation_techniques"}, {"score": 0.004723322467153553, "phrase": "flexible_and_usable_mobile_tourist_guide"}, {"score": 0.004589124394375718, "phrase": "key_issue"}, {"score": 0.004480196733208298, "phrase": "flexible_support_systems"}, {"score": 0.004437349839203418, "phrase": "mobile_users"}, {"score": 0.004148631410346188, "phrase": "different_forms"}, {"score": 0.0038231123050164267, "phrase": "pda"}, {"score": 0.003246380517062771, "phrase": "user_location"}, {"score": 0.0026395715432958665, "phrase": "better_performance"}, {"score": 0.0025644240336018045, "phrase": "user_behavior"}, {"score": 0.0021356322417874106, "phrase": "preliminary_evaluation"}, {"score": 0.0021049977753042253, "phrase": "system_behavior"}], "paper_keywords": ["adaptive systems", " user modeling", " context modeling", " ubiquitous information access"], "paper_abstract": "Intelligent adaptation is a key issue for the design of flexible support systems for mobile users. In this paper we present UbiquiTO, a tourist guide which integrates different forms of adaptation: (i) to the device used (web access via Laptop, PDA, smartphone), (ii) to the user and her features and preferences (personalized interaction), (iii) to the context of interaction, and in particular to the user location, besides some other features such as the time of the day. UbiquiTO adapts the content of the service being provided (recommendation and amount/type of information/features associated with each recommendation) and the presentation (interface). In order to achieve better performance it keeps track of the user behavior, updating and refining the user model during the interaction. In the paper we introduce the architecture of the system and the choices we made as regards user, device and context modeling and adaptation strategies. We also present the results of a preliminary evaluation of the system behavior.", "paper_title": "Integrating heterogeneous adaptation techniques to build a flexible and usable mobile tourist guide", "paper_id": "WOS:000243083200004"}