{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "composite_dilations"}, {"score": 0.0043144799365586375, "phrase": "multiscale_image_representations"}, {"score": 0.00409723267214392, "phrase": "directional_and_other_geometric_features"}, {"score": 0.003916098498242888, "phrase": "flexible_and_especially_effective_framework"}, {"score": 0.0037188360359702182, "phrase": "traditional_wavelets"}, {"score": 0.0030239842475439814, "phrase": "well-known_shearlet_representation"}, {"score": 0.0026743419827100225, "phrase": "novel_multiscale_image_decomposition_algorithm"}, {"score": 0.002622947550220266, "phrase": "efficient_digital_implementation"}, {"score": 0.00244278788608393, "phrase": "geometric_features"}, {"score": 0.0021049977753042253, "phrase": "image_denoising_and_image_enhancement_demonstrations"}], "paper_keywords": ["Wavelets", " Directional filter banks", " Wavelets with composite dilations", " Contourlets", " Shearlets", " Curvelets"], "paper_abstract": "It is widely recognized that the performance of many image processing algorithms can be significantly improved by applying multiscale image representations with the ability to handle very efficiently directional and other geometric features. Wavelets with composite dilations offer a flexible and especially effective framework for the construction of such representations. Unlike traditional wavelets, this approach enables the construction of waveforms ranging not only over various scales and locations but also over various orientations and other orthogonal transformations. Several useful constructions are derived from this approach, including the well-known shearlet representation and new ones, introduced in this paper. In this work, we introduce and apply a novel multiscale image decomposition algorithm for the efficient digital implementation of wavelets with composite dilations. Due to its ability to handle geometric features efficiently, our new image processing algorithms provide consistent improvements upon competing state-of-the-art methods, as illustrated on a number of image denoising and image enhancement demonstrations.", "paper_title": "Directional Multiscale Processing of Images Using Wavelets with Composite Dilations", "paper_id": "WOS:000329234700002"}