{"auto_keywords": [{"score": 0.040301904488830594, "phrase": "irony_detection"}, {"score": 0.01073310606137257, "phrase": "ironic_communication"}, {"score": 0.00481495049065317, "phrase": "fundamental_rhetorical_device"}, {"score": 0.004724980378009193, "phrase": "uniquely_human_mode"}, {"score": 0.004365022891478405, "phrase": "computationally_detecting_irony"}, {"score": 0.0040323765107766335, "phrase": "current_machine_learning_methods"}, {"score": 0.0038683363637006902, "phrase": "ironic_intent"}, {"score": 0.0037959868107895053, "phrase": "interesting_machine"}, {"score": 0.003325921766364862, "phrase": "large_body"}, {"score": 0.0031190369809104097, "phrase": "nlp"}, {"score": 0.0030955280068382, "phrase": "ml."}, {"score": 0.0028810424107858436, "phrase": "major_conceptual_problem"}, {"score": 0.0028485585670146025, "phrase": "existing_computational_models"}, {"score": 0.0027741761880779535, "phrase": "explicit_model"}, {"score": 0.002476721068743341, "phrase": "key_role"}, {"score": 0.0024211628058125067, "phrase": "possible_means"}, {"score": 0.0023758152068732025, "phrase": "computational_approaches"}, {"score": 0.002279011030331704, "phrase": "pragmatic_context_model"}, {"score": 0.0022278779300543548, "phrase": "computationally_existing_theories"}], "paper_keywords": ["Irony", " Representation", " Machine learning"], "paper_abstract": "Irony is a fundamental rhetorical device. It is a uniquely human mode of communication, curious in that the speaker says something other than what he or she intends. Recently, computationally detecting irony has attracted attention from the natural language processing (NLP) and machine learning (ML) communities. While some progress has been made toward this end, I argue that current machine learning methods rely too heavily on shallow, unstructured, syntactic modeling of text to consistently discern ironic intent. Irony detection is an interesting machine learning problem because, in contrast to most text classification tasks, it requires a semantics that cannot be inferred directly from word counts over documents alone. To support this position, I survey the large body of existing philosophical/literary work investigating ironic communication. I then survey more recent computational efforts to operationalize irony detection in the fields of NLP and ML. I identify the disparities of the latter with respect to the former. Specifically, I highlight a major conceptual problem in all existing computational models of irony: none maintain an explicit model of the speaker/environment. I argue that without such an internal model of the speaker, irony detection is hopeless, as this model is necessary to represent expectations, which play a key role in ironic communication. I sketch possible means of embedding such models into computational approaches to irony detection. In particular, I introduce the pragmatic context model, which looks to operationalize computationally existing theories of irony. This work is a step toward unifying work on irony from literary, empirical and philosophical perspectives with modern computational models.", "paper_title": "Computational irony: A survey and new perspectives", "paper_id": "WOS:000351112300001"}