{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-platform_data"}, {"score": 0.04551489409451018, "phrase": "gene_set_analysis"}, {"score": 0.03530867228130293, "phrase": "existing_methods"}, {"score": 0.0045804107341714, "phrase": "large-scale_genomic_studies"}, {"score": 0.004457309741979921, "phrase": "common_biological_features"}, {"score": 0.00429828390000229, "phrase": "better_power"}, {"score": 0.00385431710959668, "phrase": "genomic_data"}, {"score": 0.0038194503801108324, "phrase": "multiple_platforms"}, {"score": 0.0036497740708342093, "phrase": "existing_integrative_gene_set_methods"}, {"score": 0.0035194572615570977, "phrase": "comparative_simulation_analysis"}, {"score": 0.0034560481756572632, "phrase": "breast_cancer_dataset"}, {"score": 0.0032135959043774085, "phrase": "sample_heterogeneity"}, {"score": 0.0030429511467945525, "phrase": "multi-platform_genomic_data"}, {"score": 0.0028682681452301176, "phrase": "mann-whitney"}, {"score": 0.002491015208328868, "phrase": "proposed_multi-platform_mann-whitney_statistics_method"}, {"score": 0.002401972657236928, "phrase": "comparable_performance"}, {"score": 0.0023802126605244438, "phrase": "homogeneous_samples"}, {"score": 0.002203016940021265, "phrase": "proposed_methods"}, {"score": 0.002153450937601075, "phrase": "novel_pathways"}], "paper_keywords": [""], "paper_abstract": "Motivation: Gene set analysis is a popular method for large-scale genomic studies. Because genes that have common biological features are analyzed jointly, gene set analysis often achieves better power and generates more biologically informative results. With the advancement of technologies, genomic studies with multi-platform data have become increasingly common. Several strategies have been proposed that integrate genomic data from multiple platforms to perform gene set analysis. To evaluate the performances of existing integrative gene set methods under various scenarios, we conduct a comparative simulation analysis based on The Cancer Genome Atlas breast cancer dataset. Results: We find that existing methods for gene set analysis are less effective when sample heterogeneity exists. To address this issue, we develop three methods for multi-platform genomic data with heterogeneity: two non-parametric methods, multi-platform Mann-Whitney statistics and multi-platform outlier robust T-statistics, and a parametric method, multi-platform likelihood ratio statistics. Using simulations, we show that the proposed multi-platform Mann-Whitney statistics method has higher power for heterogeneous samples and comparable performance for homogeneous samples when compared with the existing methods. Our real data applications to two datasets of The Cancer Genome Atlas also suggest that the proposed methods are able to identify novel pathways that are missed by other strategies.", "paper_title": "Integrative gene set analysis of multi-platform data with sample heterogeneity", "paper_id": "WOS:000337040200002"}