{"auto_keywords": [{"score": 0.039044723702949105, "phrase": "ccs"}, {"score": 0.018579624644732694, "phrase": "phillips"}, {"score": 0.009158730884177284, "phrase": "lms"}, {"score": 0.00481495049065317, "phrase": "frequently_used_feature"}, {"score": 0.004440277230269978, "phrase": "different_priority_mechanisms"}, {"score": 0.004008074901216851, "phrase": "fap"}, {"score": 0.004007083686875716, "phrase": "asynchronous_ccs"}, {"score": 0.003964007795174772, "phrase": "global_priority"}, {"score": 0.003675120438902734, "phrase": "local_priority"}, {"score": 0.003074495313651187, "phrase": "leader-election-based_separation_results"}, {"score": 0.0026710653215026685, "phrase": "distributed_computing"}, {"score": 0.0022101055924375725, "phrase": "parallel-preserving_encoding"}, {"score": 0.0021745003291048356, "phrase": "prioritised_calculi"}, {"score": 0.0021394674440767124, "phrase": "non-prioritised_calculi"}], "paper_keywords": [""], "paper_abstract": "Priority is a frequently used feature of many computational systems. In this paper we study the expressiveness of two process algebras enriched with different priority mechanisms. In particular, we consider I finite (that is, recursion-free) fragment of asynchronous CCS with global priority (FAP, for short) and Phillips' CPG (CCS with local priority), and contrast their expressive power with that of two non-prioritised calculi, namely the pi-calculus and its broadcast-based version, called b pi. We prove, by means of leader-election-based separation results, that, under certain conditions, there exists no encoding of FAP in pi-Calculus or CPG. Moreover, we single Out another problem in distributed Computing, which we call the last man standing problem (LMS for short), that better reveals the gap between the two prioritised calculi above and the two non-prioritised ones, by proving that there exists no parallel-preserving encoding of the prioritised calculi in the non-prioritised calculi retaining any sincere (complete but partially correct, that is, admitting divergence or premature termination) semantics.", "paper_title": "An expressiveness study of priority in process calculi", "paper_id": "WOS:000273315500006"}