{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_services_security"}, {"score": 0.04137808138172336, "phrase": "ws_security_standards"}, {"score": 0.004425072111844721, "phrase": "major_organizations"}, {"score": 0.00399367108161192, "phrase": "huge_number"}, {"score": 0.0035181731203867456, "phrase": "learning_curve"}, {"score": 0.002899861600151726, "phrase": "specific_security_stages"}, {"score": 0.0028477727736832283, "phrase": "traditional_phases"}, {"score": 0.002813566267090177, "phrase": "ws-based_systems_development"}, {"score": 0.002779769492357829, "phrase": "pwssec"}, {"score": 0.0026326249204932733, "phrase": "web_services_security_architecture"}, {"score": 0.002419025278429845, "phrase": "ws-specific_security_requirements"}, {"score": 0.0023328599525181707, "phrase": "ws-based_security_architecture"}, {"score": 0.002209319719984651, "phrase": "security_architecture"}, {"score": 0.0021049977753042253, "phrase": "security_services"}], "paper_keywords": [""], "paper_abstract": "Web Services (WS) security has undergone an enormous development, as carried out by the major organizations and consortiums of the industry over the last few years. This has brought about the appearance of a huge number of WS security standards. Such a fact has made organizations remain reticent about adopting technologies based on this paradigm, due to the learning curve which is inevitable in the integration of security into their practical deployments. In this paper we present PWSSec (Process for Web Services Security), which enables the integration of a set of specific security stages into the traditional phases of WS-based systems development. PWSSec defines three stages, WSSecReq (Web Services Security Requirements), WSSecArch (Web Services Security Architecture) and WSSecTech (Web Services Security Technologies). These facilitate, respectively, the definition of WS-specific security requirements, the development of a WS-based security architecture and the identification of the WS security standards that the security architecture must articulate in order to implement the security services.", "paper_title": "Towards a Process for Web Services Security", "paper_id": "WOS:000235394700006"}