{"auto_keywords": [{"score": 0.044284615571228876, "phrase": "extension_problem"}, {"score": 0.00481495049065317, "phrase": "continuous_maps"}, {"score": 0.004652845998457721, "phrase": "algebraic_topology"}, {"score": 0.004476963405985556, "phrase": "higher_homotopy_groups"}, {"score": 0.004289291421348352, "phrase": "computational_complexity"}, {"score": 0.004127094600862448, "phrase": "topological_spaces"}, {"score": 0.003629291866667764, "phrase": "continuous_map"}, {"score": 0.003522027550662857, "phrase": "finite_simplicial_complexes"}, {"score": 0.003388745581055085, "phrase": "recent_positive_algorithmic_results"}, {"score": 0.003288567185099276, "phrase": "companion_papers"}, {"score": 0.0028916124463906983, "phrase": "polynomial_time"}, {"score": 0.002254630193632307, "phrase": "anick"}], "paper_keywords": [""], "paper_abstract": "We consider two basic problems of algebraic topology: the extension problem and the computation of higher homotopy groups, from the point of view of computability and computational complexity. The extension problem is the following: Given topological spaces X and Y, a subspace AaS dagger X, and a (continuous) map f:A -> Y, decide whether f can be extended to a continuous map . All spaces are given as finite simplicial complexes, and the map f is simplicial. Recent positive algorithmic results, proved in a series of companion papers, show that for (k-1)-connected Y, ka parts per thousand yen2, the extension problem is algorithmically solvable if the dimension of X is at most 2k-1, and even in polynomial time when k is fixed. Here we show that the condition cannot be relaxed: for , the extension problem with (k-1)-connected Y becomes undecidable. Moreover, either the target space Y or the pair (X,A) can be fixed in such a way that the problem remains undecidable. Our second result, a strengthening of a result of Anick, says that the computation of pi (k) (Y) of a 1-connected simplicial complex Y is #P-hard when k is considered as a part of the input.", "paper_title": "Extendability of Continuous Maps Is Undecidable", "paper_id": "WOS:000329619100002"}