{"auto_keywords": [{"score": 0.04905481275957967, "phrase": "asymptotic_behaviour"}, {"score": 0.00481495049065317, "phrase": "one-try_attacks"}, {"score": 0.004492950096237056, "phrase": "noisy_channels"}, {"score": 0.004284100953217494, "phrase": "single_guess"}, {"score": 0.004210576688291019, "phrase": "independent_executions"}, {"score": 0.0040672766251859975, "phrase": "secret_information"}, {"score": 0.003665874747419775, "phrase": "simple_way"}, {"score": 0.003618558599449415, "phrase": "channel_matrix"}, {"score": 0.0033182992967343916, "phrase": "feasible_methods"}, {"score": 0.0029519664912853938, "phrase": "maximum-likelihood_case"}, {"score": 0.002802373595203129, "phrase": "bayesian_case"}, {"score": 0.0025697702661492705, "phrase": "smith"}, {"score": 0.0025364615261136655, "phrase": "additive_form"}, {"score": 0.0024928553725344933, "phrase": "braun_et_al"}, {"score": 0.0021049977753042253, "phrase": "hidden_markov_models"}], "paper_keywords": [""], "paper_abstract": "We study the asymptotic behaviour of (a) information leakage and (b) adversary's error probability in information hiding systems modelled as noisy channels. Specifically, we assume the attacker can make a single guess after observing n independent executions of the system, throughout which the secret information is kept fixed. We show that the asymptotic behaviour of quantities (a) and (b) can be determined in a simple way from the channel matrix. Moreover, simple and tight bounds on them as functions of n show that the convergence is exponential. We also discuss feasible methods to evaluate the rate of convergence. Our results cover both the Bayesian case, where an a priori probability distribution on the secrets is assumed known to the attacker, and the maximum-likelihood case, where the attacker does not know such distribution. In the Bayesian case, we identify the distributions that maximize leakage. We consider both the min-entropy setting studied by Smith and the additive form recently proposed by Braun et al. and show the two forms do agree asymptotically. Next, we extend these results to a more sophisticated eavesdropping scenario, where the attacker can perform a (noisy) observation at each state of the computation and the systems are modelled as hidden Markov models.", "paper_title": "Asymptotic information leakage under one-try attacks", "paper_id": "WOS:000347805000004"}