{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "argumentation_systems"}, {"score": 0.007492935967856046, "phrase": "argumentation_framework"}, {"score": 0.006791622992863097, "phrase": "unaffected_sub-framework"}, {"score": 0.004576253356889219, "phrase": "intrinsic_property"}, {"score": 0.003953639783762917, "phrase": "argumentation_semantics"}, {"score": 0.003928572641266562, "phrase": "proof_theories"}, {"score": 0.00365143309008563, "phrase": "general_theory"}, {"score": 0.003459191419478298, "phrase": "new_concept"}, {"score": 0.002988101395789399, "phrase": "affected_arguments"}, {"score": 0.0029409171055888804, "phrase": "special_argumentation_framework"}, {"score": 0.002785978280998868, "phrase": "affected_part"}, {"score": 0.0027594936602962075, "phrase": "conditioning_part"}, {"score": 0.0026560424475094396, "phrase": "directionality_criterion"}, {"score": 0.0025160740422447837, "phrase": "updated_framework"}, {"score": 0.0023309080951251335, "phrase": "assigned_cafs"}, {"score": 0.00227225841515826, "phrase": "division-based_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Dynamics of argumentation", " Semantics of argumentation", " Computational complexity", " Abstract argumentation frameworks"], "paper_abstract": "The changing of arguments and their attack relation is an intrinsic property of a variety of argumentation systems. So, it is very important to efficiently figure out how the status of arguments in a system evolves when the system is updated. However, unlike other areas of argumentation that have been deeply explored, such as argumentation semantics, proof theories, and algorithms, etc., dynamics of argumentation systems has been comparatively neglected. In this paper, we formulate a general theory (called a division-based method) to cope with this problem based on a new concept: the division of an argumentation framework. When an argumentation framework is updated, it is divided into three parts: an unaffected, an affected, and a conditioning part. The status of arguments in the unaffected sub-framework remains unchanged, while the status of the affected arguments is computed in a special argumentation framework (called a conditioned argumentation framework, or briefly CAF) that is composed of an affected part and a conditioning part. We have proved that under a certain semantics that satisfies the directionality criterion (complete, preferred, ideal, or grounded semantics), the extensions of the updated framework are equal to the result of a combination of the extensions of an unaffected sub-framework and sets of the extensions of a set of assigned CAFs. Due to the efficiency of the division-based method, it is expected to be very useful in various kinds of argumentation systems where arguments and attacks are dynamics. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Dynamics of argumentation systems: A division-based method", "paper_id": "WOS:000292435000002"}