{"auto_keywords": [{"score": 0.03456055506244699, "phrase": "clock_frequency"}, {"score": 0.00481495049065317, "phrase": "dsp_applications"}, {"score": 0.004704495156558224, "phrase": "-programmable_gate_arrays"}, {"score": 0.004575272950516775, "phrase": "promising_technology"}, {"score": 0.004247696749118451, "phrase": "relatively_immature_state"}, {"score": 0.004208427318712072, "phrase": "fpga_tools"}, {"score": 0.004073809704022463, "phrase": "widespread_adoption"}, {"score": 0.003712362078915926, "phrase": "previous_works"}, {"score": 0.003610293286526576, "phrase": "dte"}, {"score": 0.0034624082435775676, "phrase": "accurate_model-based_prediction"}, {"score": 0.0030683379242416892, "phrase": "fpga"}, {"score": 0.0030117065110966414, "phrase": "abstract_level"}, {"score": 0.002956209594959227, "phrase": "accurate_predictions"}, {"score": 0.00269365253474335, "phrase": "cmd's_prediction_methods"}, {"score": 0.0025592969422491476, "phrase": "average_clock-frequency_prediction_error"}, {"score": 0.002488851299416018, "phrase": "worst-case_error"}, {"score": 0.0023867931451842087, "phrase": "existing_high-level_prediction_methods"}, {"score": 0.002236272403824371, "phrase": "accurate_design-space_exploration"}, {"score": 0.0021848422732893926, "phrase": "hardware-description_language"}, {"score": 0.0021049977753042253, "phrase": "total_design_time"}], "paper_keywords": [""], "paper_abstract": "Field-programmable gate arrays (FPGAs) provide a promising technology that can improve performance of many high-performance computing and embedded applications. However, unlike software design tools, the relatively immature state of FPGA tools significantly limits productivity and consequently prevents widespread adoption of the technology. For example, the lengthy design-translate-execute (DTE) process often must be iterated to meet the application requirements. Previous works have enabled model-based, design-space exploration to reduce DTE iterations but are limited by a lack of accurate model-based prediction of key design parameters, the most important of which is clock frequency. In this paper, we present a core-level modeling and design (CMD) methodology that enables modeling of FPGA applications at an abstract level and yet produces accurate predictions of parameters such as clock frequency, resource utilization (i.e., area), and latency. We evaluate CMD's prediction methods using several high-performance DSP applications on various families of FPGAs and show an average clock-frequency prediction error of 3.6%, with a worst-case error of 20.4%, compared to the best of existing high-level prediction methods, 13.9% average error with 48.2% worst-case error. We also demonstrate how such prediction enables accurate design-space exploration without coding in a hardware-description language (HDL), significantly reducing the total design time.", "paper_title": "Core-Level Modeling and Frequency Prediction for DSP Applications on FPGAs", "paper_id": "WOS:000362018400001"}