{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "constraining_participation"}, {"score": 0.004764220976404241, "phrase": "participatory_arts"}, {"score": 0.004714023408114857, "phrase": "hci._social_practice_art"}, {"score": 0.004639712384096822, "phrase": "new_understandings"}, {"score": 0.004330941610682453, "phrase": "straightforward_way"}, {"score": 0.004173244935967375, "phrase": "major_arts_festival"}, {"score": 0.003957833102043277, "phrase": "environmental_issues"}, {"score": 0.003916098498242888, "phrase": "community_engagement"}, {"score": 0.003322540556404882, "phrase": "disciplinary_context"}, {"score": 0.002508073621696602, "phrase": "sustainability_spectacle_computing"}, {"score": 0.002481588370380518, "phrase": "heirloom_computing"}, {"score": 0.0023408288327263316, "phrase": "similar_strategies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Participatory art practices", " Social practice art", " Sustainable HCI", " Spectacle", " Heirloom computing", " Citizen science", " Participation"], "paper_abstract": "Social practice art may suggest new understandings of and strategies for participation in HCI-but not in a straightforward way. Based on participant-observation at a major arts festival, we describe how a set of artists, concerned with environmental issues and community engagement, frame and enact participation, and describe how the nature of this participation deviated from both artists' and our ideas of what participation would be. We delineate how the disciplinary context of art both enables and limits the kinds of participation that can be achieved. We characterize 3 strategies these artists use to achieve participation: participation in spectacle, participation in making, and participation in inquiry. We develop the implications of this work to inform HCI through three case studies related to sustainability spectacle computing, heirloom computing, and citizen science - to demonstrate the potential for similar strategies for participation and to call attention to how HCI, too, implicitly constructs, enables, and constrains participation. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Constructing and constraining participation in participatory arts and HCI", "paper_id": "WOS:000347765000009"}