{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "additional_machines"}, {"score": 0.004567596860086148, "phrase": "total_weighted_tardiness"}, {"score": 0.004371160978838441, "phrase": "hybrid_flowshops"}, {"score": 0.0040385352882334235, "phrase": "real_problem"}, {"score": 0.0038989120088094185, "phrase": "considerable_flexibility"}, {"score": 0.00376409764683147, "phrase": "innovative_methodology"}, {"score": 0.003492840830999027, "phrase": "manufacturing_company"}, {"score": 0.0033868916699805224, "phrase": "different_capabilities"}, {"score": 0.0033572130837348623, "phrase": "different_stages"}, {"score": 0.00304737045343781, "phrase": "current_flow_line_configuration"}, {"score": 0.0028526276660691525, "phrase": "meta-heuristic_search_algorithm"}, {"score": 0.0025892330566358503, "phrase": "carefully_planned_nested_split-plot_design"}, {"score": 0.002499590390751339, "phrase": "different_factors"}, {"score": 0.0024130437638400404, "phrase": "different_algorithms"}, {"score": 0.0022095328812245852, "phrase": "industry-guided_problem"}, {"score": 0.0021613897794439227, "phrase": "future_developments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Total weighted tardiness", " Tabu search", " Nested split-plot design", " Additional machines"], "paper_abstract": "The problem of scheduling jobs to minimize total weighted tardiness in flowshops, with the possibility of evolving into hybrid flowshops in the future, is investigated in this paper. As this research is guided by a real problem in industry, the flowshop considered has considerable flexibility, which stimulated the development of an innovative methodology for this research. Each stage of the flowshop currently has one or several identical machines. However, the manufacturing company is planning to introduce additional machines with different capabilities in different stages in the near future. Thus, the algorithm proposed and developed for the problem is not only capable of solving the current flow line configuration but also the potential new configurations that may result in the future. A meta-heuristic search algorithm based on tabu search is developed to solve this NP-hard, industry-guided problem. Six different initial solution finding mechanisms are proposed. A carefully planned nested split-plot design is performed to test the significance of different factors and their impact on the performance of the different algorithms. To the best of our knowledge, this research is the first of its kind that attempts to solve an industry-guided problem with the concern for future developments. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Scheduling jobs in flowshops with the introduction of additional machines in the future", "paper_id": "WOS:000305863300092"}