{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "crowded_scenes"}, {"score": 0.03377021264206653, "phrase": "feet_regions"}, {"score": 0.004757366891541805, "phrase": "planar_homography_constraint"}, {"score": 0.004607139608615063, "phrase": "dense_crowded_scenes"}, {"score": 0.0044795698035664695, "phrase": "individual_people"}, {"score": 0.004251912075877877, "phrase": "single_camera_systems"}, {"score": 0.004167451906343558, "phrase": "multi-view_approach"}, {"score": 0.0038305869305614504, "phrase": "multiple_views"}, {"score": 0.0035208552733545463, "phrase": "novel_planar_homography_constraint"}, {"score": 0.0033822643082593285, "phrase": "ground_plane"}, {"score": 0.0030591147406390986, "phrase": "space_time_volume"}, {"score": 0.0029504765287722465, "phrase": "spatio-temporal_regions"}, {"score": 0.002857143106182505, "phrase": "segmentation_approach"}, {"score": 0.002636489396049042, "phrase": "tracked_location"}, {"score": 0.002615381301695394, "phrase": "experimental_results"}, {"score": 0.002553063001454623, "phrase": "dense_crowds"}, {"score": 0.0025326211341475903, "phrase": "severe_occlusions"}, {"score": 0.0023653276631862958, "phrase": "correct_correspondences"}, {"score": 0.0021049977753042253, "phrase": "different_people"}], "paper_keywords": [""], "paper_abstract": "Occlusion and lack of visibility in dense crowded scenes make it very difficult to track individual people correctly and consistently. This problem is particularly hard to tackle in single camera systems. We present a multi-view approach to tracking people in crowded scenes where people may be partially or completely occluding each other. Our approach is to use multiple views in synergy so that information from all views is combined to detect objects. To achieve this we present a novel planar homography constraint to resolve occlusions and robustly determine locations on the ground plane corresponding to the feet of the people. To find tracks we obtain feet regions over a window of frames and stack them creating a space time volume. Feet regions belonging to the same person form contiguous spatio-temporal regions that are clustered using a graph cuts segmentation approach. Each cluster is the track of a person and a slice in time of this cluster gives the tracked location. Experimental results are shown in scenes of dense crowds where severe occlusions are quite common. The algorithm is able to accurately track people in all views maintaining correct correspondences across views. Our algorithm is ideally suited for conditions when occlusions between people would seriously hamper tracking performance or if there simply are not enough features to distinguish between different people.", "paper_title": "A multiview approach to tracking people in crowded scenes using a planar homography constraint", "paper_id": "WOS:000237557400011"}