{"auto_keywords": [{"score": 0.027158116879323232, "phrase": "android"}, {"score": 0.00481495049065317, "phrase": "distance-based_services"}, {"score": 0.004776297980616768, "phrase": "revocable_anonymity"}, {"score": 0.0040485975929323, "phrase": "progressive_introduction"}, {"score": 0.0038885527668812807, "phrase": "electronic_tickets"}, {"score": 0.0035296940954990964, "phrase": "possible_fraud"}, {"score": 0.0034452601929727752, "phrase": "users'_privacy"}, {"score": 0.003335804608791029, "phrase": "security_requirements"}, {"score": 0.0032956583072431423, "phrase": "time-based_and_distance-based_systems"}, {"score": 0.0030895394261534776, "phrase": "strong_privacy"}, {"score": 0.0030646951765987414, "phrase": "honest_users"}, {"score": 0.00301560261110296, "phrase": "service_provider"}, {"score": 0.002347628167175859, "phrase": "afc_system"}, {"score": 0.002319346861878611, "phrase": "medium_class_mobile_device"}, {"score": 0.002272964710550345, "phrase": "better_experience"}, {"score": 0.00224558083320154, "phrase": "high-class_smartphone"}, {"score": 0.0021479597698614373, "phrase": "better_usability"}], "paper_keywords": ["security", " privacy", " mobile applications", " E-commerce", " applied cryptography"], "paper_abstract": "Automatic fare collection (AFC) systems calculate the fare that the users must pay depending on the time of service (time-based) or the points of entrance and exit of the system (distance-based). The progressive introduction of Information and Communication Technologies allows the use of electronic tickets, which helps us to reduce costs and improve the control of the infrastructures. Nevertheless, these systems must be secure against possible fraud and they must also preserve users' privacy. Therefore, we have studied the security requirements for the time-based and distance-based systems and we have proposed a protocol for each of the AFC systems.(1) The protocols offer strong privacy for honest users, i.e. the service provider is not able to disclose the identity of its users and, moreover, different journeys of the same user are not linkable between them. However, anonymity for users could be revoked if they misbehave. The protocols have been implemented in Android and its performance has been evaluated in two Android smartphones. The results remark that protocols are suitable to be used on an AFC system with a medium class mobile device although they offer a better experience with a high-class smartphone. The appearance in the market of more powerful mobile devices suggests a better usability of our proposal in a near future.", "paper_title": "A Secure Automatic Fare Collection System for Time-Based or Distance-Based Services with Revocable Anonymity for Users", "paper_id": "WOS:000325489800006"}