{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "geospatial_objects"}, {"score": 0.004765482708043842, "phrase": "different_geographic_servers."}, {"score": 0.0041666157975446564, "phrase": "semantic_repository"}, {"score": 0.004039423410198574, "phrase": "inclusion_mechanisms"}, {"score": 0.003997891221012094, "phrase": "distributed_data"}, {"score": 0.003623949225126944, "phrase": "similarity_measure"}, {"score": 0.003531474887552889, "phrase": "conceptual_distance"}, {"score": 0.002755104031926742, "phrase": "different_servers"}, {"score": 0.00257586859792573, "phrase": "case_study"}, {"score": 0.0025361866386341774, "phrase": "web-mapping_application"}, {"score": 0.0025100713447593773, "phrase": "semgsearch"}, {"score": 0.0023467391904246834, "phrase": "semantic_retrieval"}, {"score": 0.0022168460543913787, "phrase": "weighting_list"}, {"score": 0.0021049977753042253, "phrase": "custom_query"}], "paper_keywords": ["Semantic retrieval", " metadata", " application ontology", " document ranking"], "paper_abstract": "In this paper, we propose an approach to semantically retrieve geospatial objects within an Intranet by means of their metadata. It consists of structuring a semantic repository in order to provide the inclusion mechanisms of distributed data to be retrieved, as well as the extraction of those geospatial objects with respect to their conceptual similarity. The similarity measure is based on a conceptual distance (DIS-C algorithm), which consists of determining the levels of similarity among the objects for aiding in the construction of an engine of inclusion and extraction of them. This approach provides a mechanism to handle the knowledge of the geospatial objects distributed on different servers in order to unify the process by means of their semantics. As case study, a web-mapping application called SemGsearch has been designed. It provides to the user an engine of semantic retrieval and integration, The result is focused on obtaining a weighting list (ranking) of geospatial objects semantically retrieved by a custom query.", "paper_title": "SEMGSEARCH: AN APPROACH TO SEMANTICALLY RETRIEVE GEOSPATIAL OBJECTS FROM DIFFERENT GEOGRAPHIC SERVERS", "paper_id": "WOS:000324004200004"}