{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "personal_health_records"}, {"score": 0.004650896226390719, "phrase": "international_business_travel"}, {"score": 0.004597457370802855, "phrase": "health_risks"}, {"score": 0.004415189385015778, "phrase": "host_societies"}, {"score": 0.004364446928620496, "phrase": "home_countries"}, {"score": 0.004240116703465252, "phrase": "health-related_risks"}, {"score": 0.004048483412089098, "phrase": "relevant_caregivers"}, {"score": 0.0038654774211631564, "phrase": "health_advice"}, {"score": 0.0036482665232275583, "phrase": "up-to-date_health_information"}, {"score": 0.0032122679403131537, "phrase": "right_place"}, {"score": 0.002877769867854964, "phrase": "mobile_phones"}, {"score": 0.0028446460307503343, "phrase": "health_management"}, {"score": 0.0028119023819663472, "phrase": "promising_tools"}, {"score": 0.0027159094186967247, "phrase": "healthcare_services"}, {"score": 0.0026384167183586015, "phrase": "personal_health"}, {"score": 0.0025044454602720597, "phrase": "international_informaticians"}, {"score": 0.0023228223366301226, "phrase": "international_standard"}], "paper_keywords": [""], "paper_abstract": "Tourism as well as international business travel creates health risks for individuals and populations both in host societies and home countries. One strategy to reduce health-related risks to travelers is to provide travelers and relevant caregivers timely, ongoing access to their own health information. Many websites offer health advice for travelers. For example, the WHO and US Department of State offer up-to-date health information about countries relevant to travel. However, little has been done to assure travelers that their medical information is available at the right place and time when the need might arise. Applications of Information and Communication Technology (ICT) utilizing mobile phones for health management are promising tools both for the delivery of healthcare services and the promotion of personal health. This paper describes the project developed by international informaticians under the umbrella of the International Medical Informatics Association. A template capable of becoming an international standard is proposed. This application is available free to anyone who is interested. Furthermore, its source code is made open.", "paper_title": "A global travelers' electronic health record template standard for personal health records", "paper_id": "WOS:000298848100020"}