{"auto_keywords": [{"score": 0.01560984472994894, "phrase": "parkinson's_disease"}, {"score": 0.014757662281520301, "phrase": "human_disease"}, {"score": 0.01186743972877588, "phrase": "novel_approach"}, {"score": 0.011218067713054398, "phrase": "pd"}, {"score": 0.008165207613241356, "phrase": "significant_accumulation"}, {"score": 0.00481495049065317, "phrase": "genomic_candidate_regions"}, {"score": 0.004598027492787762, "phrase": "high-throughput_technologies"}, {"score": 0.004222795179790998, "phrase": "comprehensive_picture"}, {"score": 0.004192937957960497, "phrase": "molecular_events"}, {"score": 0.003989742144066683, "phrase": "methodological_obstacle"}, {"score": 0.003947492797744999, "phrase": "integration_process"}, {"score": 0.0038234000205958547, "phrase": "optimal_unified_denominator"}, {"score": 0.003511159930253876, "phrase": "genetic_alterations"}, {"score": 0.0034739608505535017, "phrase": "human_diseases"}, {"score": 0.0030032443093632125, "phrase": "online_repositories"}, {"score": 0.002950374774004939, "phrase": "available_research_papers"}, {"score": 0.0029087480993530796, "phrase": "human_genome_assembly"}, {"score": 0.002837305633114947, "phrase": "significant_signals"}, {"score": 0.0028172167834968477, "phrase": "aforementioned_studies"}, {"score": 0.0026900523406547827, "phrase": "rank_product_values"}, {"score": 0.00265208877121581, "phrase": "significance_values"}, {"score": 0.0025961429982767257, "phrase": "original_dataset"}, {"score": 0.0023754296478100865, "phrase": "identified_regions"}, {"score": 0.0023088369807852333, "phrase": "pd."}, {"score": 0.002220296517089146, "phrase": "candidate_regions"}, {"score": 0.0021503823972534096, "phrase": "positional_integration"}, {"score": 0.0021049977753042253, "phrase": "omic_studies"}], "paper_keywords": [""], "paper_abstract": "Motivation: Recent abundance of data from studies employing high-throughput technologies to reveal alterations in human disease on genomic, transcriptomic, proteomic and other levels, offer the possibility to integrate this information into a comprehensive picture of molecular events occurring in human disease. Diversity of data originating from these studies presents a methodological obstacle in the integration process, also due to difficulties in choosing the optimal unified denominator that would allow inclusion of variables from various types of studies. We present a novel approach for integration of such multi-origin data based on positions of genetic alterations occurring in human diseases. Parkinson's disease (PD) was chosen as a model for evaluation of our methodology. Methods: Datasets from various types of studies in PD (linkage, genome-wide association, transcriptomic and proteomic studies) were obtained from online repositories or were extracted from available research papers. Subsequently, human genome assembly was subdivided into 10 kb regions, and significant signals from aforementioned studies were arranged into their corresponding regions according to their genomic position. For each region, rank product values were calculated and significance values were estimated by permuting the original dataset. Results: Altogether, 179 regions (representing 33 contiguous genomic regions) had significant accumulation of signals when P-value cut-off was set at 0.0001. Identified regions with significant accumulation of signals contained 29 plausible candidate genes for PD. In conclusion, we present a novel approach for identification of candidate regions and genes for various human disorders, based on the positional integration of data across various types of omic studies.", "paper_title": "Positional integratomic approach in identification of genomic candidate regions for Parkinson's disease", "paper_id": "WOS:000292554900014"}