{"auto_keywords": [{"score": 0.04920822493417558, "phrase": "website_keyobjects"}, {"score": 0.029420333683948783, "phrase": "eye-tracking_technology"}, {"score": 0.00481495049065317, "phrase": "eye-tracking_technologies"}, {"score": 0.0047797212183363835, "phrase": "web_usage_mining"}, {"score": 0.004624337472244542, "phrase": "novel_approach"}, {"score": 0.004556901872357751, "phrase": "processing_data"}, {"score": 0.004506968388996092, "phrase": "web_user"}, {"score": 0.0044904452331803, "phrase": "ocular_movements"}, {"score": 0.004441236717408874, "phrase": "web_page"}, {"score": 0.004312622975366676, "phrase": "eye-tracking_tool"}, {"score": 0.0042031320273645065, "phrase": "exact_web_user's_eye_position"}, {"score": 0.003992385826251404, "phrase": "web_page_visits"}, {"score": 0.0039341294012600085, "phrase": "web_log"}, {"score": 0.0039053194919285725, "phrase": "significant_insights"}, {"score": 0.003615217162972726, "phrase": "current_methodology"}, {"score": 0.0035233696341819437, "phrase": "web_user's_point"}, {"score": 0.0033589207694997413, "phrase": "website's_logs"}, {"score": 0.003190367939051776, "phrase": "web_objects"}, {"score": 0.002910080228097109, "phrase": "web_mining_algorithms"}, {"score": 0.0021520139248317333, "phrase": "eye_tracker"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Web mining", " Eye tracking", " Website Keyobjects"], "paper_abstract": "This paper introduces a novel approach for collecting and processing data originated by web user ocular movements on a web page, which are captured by using an eye-tracking tool. These data allow knowing the exact web user's eye position on a computer screen, and by combining them with the sequence of web page visits registered in the web log, significant insights about his/her behavior within a website can be extracted. With this approach, we can improve the effectiveness of the current methodology for identifying the most important web objects from the web user's point of view, also called Website Keyobjects. It takes as input the website's logs, the pages that compose it and the interest of users in the web objects of each page, which is quantified by means of a survey. Subsequently, the data are transformed and preprocessed before finally applying web mining algorithms that allow the extraction of the Website Keyobjects. With the utilization of the eye-tracking technology, we can eliminate the survey by using a more precise and objective tool to achieve an improvement in the classification of the Website Keyobjects. It was concluded that eye-tracking technology is useful and accurate when it comes to knowing what a user looks at and therefore, what attracts their attention the most. Finally, it was established that there is an improvement between 15% and 20% when using the information generated by the eye tracker. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Combining eye-tracking technologies with web usage mining for identifying Website Keyobjects", "paper_id": "WOS:000319241300004"}