{"auto_keywords": [{"score": 0.04969089536874819, "phrase": "wireless_sensor"}, {"score": 0.04723979222146499, "phrase": "new_way"}, {"score": 0.03151327197365604, "phrase": "operating_system"}, {"score": 0.00481495049065317, "phrase": "dynamic_adaptation"}, {"score": 0.004737201825299411, "phrase": "actor_networks"}, {"score": 0.004493045859210086, "phrase": "distributed_computing"}, {"score": 0.004331393784852601, "phrase": "wide_variety"}, {"score": 0.0032434583977423996, "phrase": "sensor_nodes"}, {"score": 0.0029291801502381513, "phrase": "high_energy_consumption"}, {"score": 0.002613103872300205, "phrase": "neural_networks"}, {"score": 0.0025499307228648883, "phrase": "existing_approaches"}, {"score": 0.0024480094603893175, "phrase": "small_pieces"}, {"score": 0.0023694065215394593, "phrase": "low_energy_consumption"}, {"score": 0.002265422518417866, "phrase": "case_studies"}, {"score": 0.0021571717917276724, "phrase": "practical_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Wireless Sensor and Actor Networks", " Dynamic adaptation", " Neural networks", " Reprogramming"], "paper_abstract": "Wireless Sensor and Actor Networks (WSANs) constitute a new way of distributed computing and are steadily gaining importance due to the wide variety of applications that can be implemented with them. As a result they are increasingly present everywhere (industry, farm use, buildings, etc.). However, there are still many important areas in which the WSANs can be improved. One of the most important aspects is to give the sensor networks the capability of being wirelessly reprogrammed so that developers do not have to physically interact with the sensor nodes. Many proposals that deal with this issue have been proposed, but most of them are hardly dependent on the operating system and demand a high energy consumption, even if only a small change has been made in the code. In this work, we propose a new way of wirelessly reprogramming based on the concept of neural networks. Unlike most of the existing approaches, our proposal is independent of the operating system and allows small pieces of code to be reprogrammed with a low energy consumption. The architecture developed to achieve that is described and case studies are presented that show the use of our proposal by means of practical examples. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "NeuralSens: A neural network based framework to allow dynamic adaptation in wireless sensor and actor networks", "paper_id": "WOS:000298338600032"}