{"auto_keywords": [{"score": 0.04556230169092199, "phrase": "rnn_query"}, {"score": 0.014447016520580972, "phrase": "query_object"}, {"score": 0.00481495049065317, "phrase": "nearest_neighbor_queries"}, {"score": 0.00477190623242136, "phrase": "uncertain_data"}, {"score": 0.004005083535629333, "phrase": "measurement_devices"}, {"score": 0.003969250376327401, "phrase": "environmental_disturbance"}, {"score": 0.0036443694410100507, "phrase": "real_world"}, {"score": 0.003499864176875713, "phrase": "previous_approaches"}, {"score": 0.0032716011062067286, "phrase": "uncertain_scenario"}, {"score": 0.003044455555031339, "phrase": "uncertain_databases"}, {"score": 0.0027950561494657633, "phrase": "user-specified_threshold"}, {"score": 0.002708399936381754, "phrase": "prnn_query"}, {"score": 0.0025089420019955232, "phrase": "effective_pruning_method"}, {"score": 0.0024421652070184315, "phrase": "gp"}, {"score": 0.002366361492754389, "phrase": "prnn_search_space"}, {"score": 0.002313701040445819, "phrase": "false_dismissals"}, {"score": 0.0022419349154472806, "phrase": "efficient_prnn_query_procedure"}, {"score": 0.0021821915946356168, "phrase": "extensive_experiments"}], "paper_keywords": ["Probablistic reverse nearest neighbor", " Uncertain databases", " Geometric pruning"], "paper_abstract": "Reverse nearest neighbor (RNN) search is very crucial in many real applications. In particular, given a database and a query object, an RNN query retrieves all the data objects in the database that have the query object as their nearest neighbors. Often, due to limitation of measurement devices, environmental disturbance, or characteristics of applications (for example, monitoring moving objects), data obtained from the real world are uncertain (imprecise). Therefore, previous approaches proposed for answering an RNN query over exact (precise) database cannot be directly applied to the uncertain scenario. In this paper, we re-define the RNN query in the context of uncertain databases, namely probabilistic reverse nearest neighbor (PRNN) query, which obtains data objects with probabilities of being RNNs greater than or equal to a user-specified threshold. Since the retrieval of a PRNN query requires accessing all the objects in the database, which is quite costly, we also propose an effective pruning method, called geometric pruning (GP), that significantly reduces the PRNN search space yet without introducing any false dismissals. Furthermore, we present an efficient PRNN query procedure that seamlessly integrates our pruning method. Extensive experiments have demonstrated the efficiency and effectiveness of our proposed GP-based PRNN query processing approach, under various experimental settings.", "paper_title": "Efficient processing of probabilistic reverse nearest neighbor queries over uncertain data", "paper_id": "WOS:000266459600010"}