{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sparse_image_reconstruction"}, {"score": 0.02214484468094057, "phrase": "new_sampling_theorem"}, {"score": 0.003775803846431323, "phrase": "information_content"}, {"score": 0.0037075456471849892, "phrase": "band-limited_signal_acts"}, {"score": 0.003223494720348768, "phrase": "simple_inpainting_problem"}, {"score": 0.0028715299874549245, "phrase": "total_variation"}, {"score": 0.002751751956416832, "phrase": "fast_methods"}, {"score": 0.002685558057339722, "phrase": "inpainting_problem"}, {"score": 0.0026209522797963447, "phrase": "high_resolution"}, {"score": 0.002421499421848063, "phrase": "required_number"}, {"score": 0.0022923586577645143, "phrase": "equiangular_sampling_schemes"}, {"score": 0.0022508572821818124, "phrase": "numerical_simulations"}, {"score": 0.00218334762335187, "phrase": "enhanced_fidelity"}], "paper_keywords": ["Compressive sensing", " harmonic analysis", " sampling methods", " spheres"], "paper_abstract": "We study the impact of sampling theorems on the fidelity of sparse image reconstruction on the sphere. We discuss how a reduction in the number of samples required to represent all information content of a band-limited signal acts to improve the fidelity of sparse image reconstruction, through both the dimensionality and sparsity of signals. To demonstrate this result, we consider a simple inpainting problem on the sphere and consider images sparse in the magnitude of their gradient. We develop a framework for total variation inpainting on the sphere, including fast methods to render the inpainting problem computationally feasible at high resolution. Recently a new sampling theorem on the sphere was developed, reducing the required number of samples by a factor of two for equiangular sampling schemes. Through numerical simulations, we verify the enhanced fidelity of sparse image reconstruction due to the more efficient sampling of the sphere provided by the new sampling theorem.", "paper_title": "Sparse Image Reconstruction on the Sphere: Implications of a New Sampling Theorem", "paper_id": "WOS:000318477500014"}