{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "triangular_operators"}, {"score": 0.046982045621569636, "phrase": "real_time_images"}, {"score": 0.034466371082712124, "phrase": "hamacher"}, {"score": 0.034188412736981345, "phrase": "dombi_t-norms"}, {"score": 0.03101723228037332, "phrase": "gradient_images"}, {"score": 0.004618166136069052, "phrase": "fuzzy_morphological_approach"}, {"score": 0.004374267836149339, "phrase": "edge_detection"}, {"score": 0.004230595706156783, "phrase": "difficult_task"}, {"score": 0.0035648266669315943, "phrase": "non_membership_degrees"}, {"score": 0.0035204268675160257, "phrase": "intuitionistic_fuzzy_image"}, {"score": 0.0034620831765465425, "phrase": "sugeno_type_intuitionistic_fuzzy_generator"}, {"score": 0.0031317126905234145, "phrase": "morphological_dilation"}, {"score": 0.0030414140732789186, "phrase": "almost_all_the_edges"}, {"score": 0.002426717832834137, "phrase": "lukasiewicz_t-norms"}, {"score": 0.0022133711375320244, "phrase": "gradient_image"}, {"score": 0.002194929830604162, "phrase": "fuzzy_morphology"}, {"score": 0.0021766418372878835, "phrase": "hamacher_t-norm"}, {"score": 0.0021049977753042253, "phrase": "noisy_environment"}], "paper_keywords": ["Atanassov's's intuitionistic fuzzy set", " sugeno type generator", " hamacher t-norm and t-conorm", " product t-norm and t-conorm", " interval valued fuzzy relation", " fuzzy morphology", " gradient image"], "paper_abstract": "This paper presents a fuzzy morphological approach to detect the edges of real time images in order to preserve their features. Edge detection on these kinds of images is a difficult task where the edges/regions are vaguely visible. Especially, when these images are mixed with noise, detection becomes much more difficult. In this method, real time images are considered to be intuitionistic as the structures are not clear. Non membership degrees of an intuitionistic fuzzy image are computed using Sugeno type intuitionistic fuzzy generator. Then it uses triangular operators (product t-norms and conorms, Hamacher and Dombi t-norms and t-conorms) for computing morphological dilation and erosion. The method highlights almost all the edges of both normal (without noise) images and noisy images and the gradient images almost do not contain noise. Experiments have been performed qualitatively and quantitatively on several medical and human face images using triangular operators (product t-norms and conorms, Hamacher and Dombi t-norms and t-conorms) and the results are compared with gradient images using i) fuzzy morphology with Lukasiewicz t-norms and t-conorms, ii) fuzzy morphology with product t-norms and t-conorms, iii) median filter based edge detection method, and iii) interval valued fuzzy relation based edge detection method. It is observed that the gradient image using fuzzy morphology with Hamacher t-norm and t-conorm performs better in noisy environment.", "paper_title": "Fuzzy mathematical morphology using triangular operators and its application to images", "paper_id": "WOS:000357312800029"}