{"auto_keywords": [{"score": 0.04628842803331336, "phrase": "finite_element_method"}, {"score": 0.01050871383955956, "phrase": "mixed_boundary_conditions"}, {"score": 0.010440155729050668, "phrase": "quasi-static_electromagnetic_problems"}, {"score": 0.008979987364318764, "phrase": "estimated_error_maps"}, {"score": 0.008032582022233867, "phrase": "magnetodynamic_harmonic_formulations"}, {"score": 0.006998123072165647, "phrase": "electromagnetic_structures"}, {"score": 0.00481495049065317, "phrase": "posteriori_residual_error"}, {"score": 0.004705278218845159, "phrase": "purpose_-_the_purpose"}, {"score": 0.004305055407631358, "phrase": "classical_magnetodynamic_a-phi"}, {"score": 0.004206948146882303, "phrase": "harmonic_case"}, {"score": 0.004030618026002216, "phrase": "electromagnetic_system"}, {"score": 0.003925786139948254, "phrase": "remeshing_process"}, {"score": 0.0036997388927095935, "phrase": "numerical_rees"}, {"score": 0.003407141079879243, "phrase": "error_estimators"}, {"score": 0.0032858160838749196, "phrase": "studied_application"}, {"score": 0.003221463787552773, "phrase": "residual_error_estimators"}, {"score": 0.003045874333486276, "phrase": "obtained_solution"}, {"score": 0.002879827926178628, "phrase": "interesting_results"}, {"score": 0.0027680831622262027, "phrase": "classical_formulations"}, {"score": 0.002634463767377738, "phrase": "proposed_formulations"}, {"score": 0.0024099543488850946, "phrase": "electromagnetic_structure"}, {"score": 0.002362715032126801, "phrase": "proposed_method"}, {"score": 0.0023317365065820554, "phrase": "good_solution"}, {"score": 0.0023011632163055166, "phrase": "optimal_mesh"}, {"score": 0.002182817892930808, "phrase": "numerical_analysis"}, {"score": 0.0021049977753042253, "phrase": "good_meshes"}], "paper_keywords": ["3D FEM", " Applied electromagnetics", " Electromagnetic fields", " Numerical modelling"], "paper_abstract": "Purpose - The purpose of this paper is to propose some a posteriori residual error estimators (REEs) to evaluate the accuracy of the finite element method for quasi-static electromagnetic problems with mixed boundary conditions. Both classical magnetodynamic A-phi and T-Omega formulations in harmonic case are analysed. As an example of application the estimated error maps of an electromagnetic system are studied. At last, a remeshing process is done according to the estimated error maps. Design/methodology/approach - The paper proposes to analyze the efficiency of numerical REEs in the case of magnetodynamic harmonic formulations. The deal is to determine the areas where it is necessary to improve the mesh. Moreover the error estimators are applied for structures with mixed boundary conditions. Findings - The studied application shows the possibilities of the residual error estimators in the case of electromagnetic structures. The comparison of the remeshed show the improvement of the obtained solution when the authors compare with a reference one. Research limitations/implications - The paper provides some interesting results in the case of magnetodynamic harmonic formulations in terms of potentials. Both classical formulations are studied. Practical implications - The paper provides some informations to develop the proposed formulations in the software using finite element method. Social implications - The paper deals with the possibility to improve the determination of the meshes in the analysis of electromagnetic structure with the finite element method. The proposed method can be a good solution to obtain an optimal mesh for a given numerical error. Originality/value - The paper proposes some elements of solution for the numerical analysis of electromagnetic structures. More particularly the results can be used to determine the good meshes of the finite element method.", "paper_title": "A posteriori residual error estimators with mixed boundary conditions for quasi-static electromagnetic problems", "paper_id": "WOS:000356434800010"}