{"auto_keywords": [{"score": 0.04697189954855944, "phrase": "subtree_hypergraph"}, {"score": 0.01250758874076259, "phrase": "minimum_size"}, {"score": 0.009982073333767449, "phrase": "source_location_problem"}, {"score": 0.00481495049065317, "phrase": "subtree_hypergraphs"}, {"score": 0.004195418010131832, "phrase": "t._since"}, {"score": 0.0034954725617970294, "phrase": "vertices_w_subset"}, {"score": 0.0033177813460815346, "phrase": "vertical_bar_v_vertical_bar"}, {"score": 0.0031963987773420068, "phrase": "minimum_size_transversal"}, {"score": 0.0030794433253250476, "phrase": "polynomial_algorithm"}, {"score": 0.002836942411239067, "phrase": "subset_s"}, {"score": 0.0026826140171754675, "phrase": "k_arc-disjoint_paths"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["source location", " subtree hypergraph", " hypertree", " transversal", " polynomial algorithm"], "paper_abstract": "A hypergraph H = (V, E) is a subtree hypergraph if there is a tree T on V such that each hyperedge of E induces a subtree of T. Since the number of edges of a subtree hypergraph can be exponential in n = vertical bar V vertical bar, one can not always expect to be able to find a minimum size transversal in time polynomial in n. In this paper, we show that if it is possible to decide if a set of vertices W subset of V is a transversal in time S(n) (where n = vertical bar V vertical bar), then it is possible to find a minimum size transversal in O(n(3)S(n)). This result provides a polynomial algorithm for the Source Location Problem: a set of (k, l)-sources for a digraph D = (V, A) is a subset S of V such that for any V is an element of V there are k arc-disjoint paths that each join a vertex of S to It and I arc-disjoint paths that each join v to S. The Source Location Problem is to find a minimum size set of (k, l)-sources. We show that this is a case of finding a transversal of a subtree hypergraph, and that in this case S(n) is polynomial. (c) 2007 Wiley Periodicals, Inc.", "paper_title": "Transversals of subtree hypergraphs and the source location problem in digraphs", "paper_id": "WOS:000253703800004"}