{"auto_keywords": [{"score": 0.004482873744893272, "phrase": "increased_efficiency"}, {"score": 0.004081385289516914, "phrase": "robust_network_topologies"}, {"score": 0.0037658881407605445, "phrase": "network_topologies"}, {"score": 0.0037157201349604222, "phrase": "economic_viewpoint"}, {"score": 0.003666217992454448, "phrase": "security_metrics"}, {"score": 0.0033376244286643176, "phrase": "potential_loss"}, {"score": 0.0032059442984238664, "phrase": "strategic_adversary"}, {"score": 0.003149094460617212, "phrase": "vulnerability_metrics"}, {"score": 0.002957919048133256, "phrase": "network_topology_vulnerability"}, {"score": 0.002931569771634119, "phrase": "adversarial_environments"}, {"score": 0.0028539179130824786, "phrase": "network_operator"}, {"score": 0.0028032928749970026, "phrase": "economic_goals"}, {"score": 0.0026686444508167875, "phrase": "previous_models"}, {"score": 0.0026330549554033876, "phrase": "usage_costs"}, {"score": 0.0026095920086044145, "phrase": "budget_constraints"}, {"score": 0.0023437863565921053, "phrase": "proposed_metrics"}, {"score": 0.0023021895404322767, "phrase": "game-theoretic_models"}, {"score": 0.0021430393104977788, "phrase": "thorough_complexity_analysis"}, {"score": 0.0021049977753042253, "phrase": "proposed_games"}], "paper_keywords": [""], "paper_abstract": "Technological networks (e.g., telephone and sensor networks, Internet) have provided modern society with increased efficiency, but have also exposed us to the risks posed by their vulnerability to attacks. Mitigating these risks involves designing robust network topologies in situations where resources are economically constrained. In this study, we consider the vulnerability of network topologies from an economic viewpoint and propose security metrics, which are necessary for assessing the efficiency of our solutions. We define the vulnerability of a network as the potential loss in connectivity due to the actions of a strategic adversary. To derive vulnerability metrics, we revisit our recently introduced network blocking game models, which provide a framework for quantifying network topology vulnerability in adversarial environments. We assume that the network operator takes both security and economic goals into consideration. To model these goals, we generalize previous models by introducing usage costs and budget constraints for the operator. We study two natural constraint formulations, the maximum and the expected cost constraints, and derive the feasible vulnerability/cost region. Because the proposed metrics are based on game-theoretic models, computing them can be challenging. To elucidate these challenges, we provide a thorough complexity analysis for solving the proposed games.", "paper_title": "NETWORK TOPOLOGY VULNERABILITY/COST TRADE-OFF: MODEL, APPLICATION, AND COMPUTATIONAL COMPLEXITY", "paper_id": "WOS:000362949500005"}