{"auto_keywords": [{"score": 0.04725332734585432, "phrase": "pore-scale_simulation"}, {"score": 0.04492795963065823, "phrase": "complex_geometries"}, {"score": 0.004815744689983885, "phrase": "boltzmann"}, {"score": 0.004737579882204798, "phrase": "pore-scale_flow"}, {"score": 0.0046238380150870435, "phrase": "lattice_boltzmann_method"}, {"score": 0.004567990533989851, "phrase": "popular_tool"}, {"score": 0.004246729915110547, "phrase": "porous_media"}, {"score": 0.004061584718427419, "phrase": "multiple_relaxation_times"}, {"score": 0.00386876598761639, "phrase": "physical_fidelity"}, {"score": 0.00374531366198605, "phrase": "lattice_bolzmann_method"}, {"score": 0.0036111152143285838, "phrase": "explicit_nature"}, {"score": 0.0034817084307034955, "phrase": "local_work"}, {"score": 0.003329804436286295, "phrase": "software_framework"}, {"score": 0.0031459887611258765, "phrase": "large_clusters"}, {"score": 0.0029965060407413898, "phrase": "taxila_lbm"}, {"score": 0.0028890603352364273, "phrase": "lattice_boltzmann_simulations"}, {"score": 0.0023298892270500983, "phrase": "real_problems"}, {"score": 0.0021569129153653777, "phrase": "berea_sandstone"}, {"score": 0.0021221627745801478, "phrase": "multifluid_flow"}, {"score": 0.0021049977753042253, "phrase": "heterogenous_micromodels"}], "paper_keywords": ["Pore-scale simulation", " Lattice Boltzmann method", " Software framework"], "paper_abstract": "The lattice Boltzmann method is a popular tool for pore-scale simulation of flow. This is likely due to the ease of including complex geometries such as porous media and representing multiphase and multifluid flows. Many advancements, including multiple relaxation times, increased isotropy, and others have improved the accuracy and physical fidelity of the method. Additionally, the lattice Bolzmann method is computationally very efficient, thanks to the explicit nature of the algorithm and relatively large amount of local work. The combination of many algorithmic options and efficiency means that a software framework enabling the usage and comparison of these advancements on computers from laptops to large clusters has much to offer. In this paper, we introduce Taxila LBM, an open-source software framework for lattice Boltzmann simulations. We discuss the design of the framework and lay out the features available, including both methods in the literature and a few new enhancements which generalize methods to complex geometries. We discuss the trade-off of accuracy and performance in various methods, noting how the Taxila LBM makes it easy to perform these comparisons for real problems. And finally, we demonstrate a few common applications in pore-scale simulation, including the characterization of permeability of a Berea sandstone and analysis of multifluid flow in heterogenous micromodels.", "paper_title": "Taxila LBM: a parallel, modular lattice Boltzmann framework for simulating pore-scale flow in porous media", "paper_id": "WOS:000330990100003"}