{"auto_keywords": [{"score": 0.030159965914792215, "phrase": "partial_connections"}, {"score": 0.010612387000973441, "phrase": "connective_segmentation"}, {"score": 0.0047691848970490645, "phrase": "serra"}, {"score": 0.004723847090183984, "phrase": "j._math"}, {"score": 0.00349577373145384, "phrase": "connective_segmentations"}, {"score": 0.003146652729098066, "phrase": "morphological_operations"}, {"score": 0.003043031131345537, "phrase": "wider_framework"}, {"score": 0.002928765962664163, "phrase": "mutually_disjoint_non-void_subsets"}, {"score": 0.0028053237950173508, "phrase": "connected_components"}, {"score": 0.002372649454733249, "phrase": "partial_partitions"}, {"score": 0.002327648608736437, "phrase": "serra's_characterization"}, {"score": 0.0021049977753042253, "phrase": "improved_segmentation_algorithms"}], "paper_keywords": ["mathematical morphology", " connective segmentation", " connections", " partitions", " complete lattice"], "paper_abstract": "In connective segmentation (Serra in J. Math. Imaging Vis. 24(1):83-130, [2006]), each image determines subsets of the space on which it is \"homogeneous\", in such a way that this family of subsets always constitutes a connection (connectivity class); then the segmentation of the image is the partition of space into its connected components according to that connection. Several concrete examples of connective segmentations or of connections on sets, indicate that the space covering requirement of the partition should be relaxed. Furthermore, morphological operations on partitions require the consideration of wider framework. We study thus partial partitions (families of mutually disjoint non-void subsets of the space) and partial connections (where connected components of a set are mutually disjoint but do not necessarily cover the set). We describe some methods for generating partial connections. We investigate the links between the two lattices of partial connections and of partial partitions. We generalize Serra's characterization of connective segmentation and discuss its relevance. Finally we give some ideas on how the theory of partial connections could lead to improved segmentation algorithms.", "paper_title": "Partial partitions, partial connections and connective segmentation", "paper_id": "WOS:000258539200001"}