{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "instant_messaging"}, {"score": 0.049798208892916335, "phrase": "peer-to-peer_systems"}, {"score": 0.028451975144124477, "phrase": "data_streams"}, {"score": 0.004593677275091001, "phrase": "considerable_bandwidth"}, {"score": 0.0045667395804097136, "phrase": "computing_resources"}, {"score": 0.004293215616253398, "phrase": "security_loopholes"}, {"score": 0.004024150214304478, "phrase": "access_control"}, {"score": 0.00400053884985293, "phrase": "weak_authentication"}, {"score": 0.003977065469905712, "phrase": "shared_resources"}, {"score": 0.003850392835818635, "phrase": "production_environments"}, {"score": 0.0038053333794618002, "phrase": "conventional_applications"}, {"score": 0.003749747076821239, "phrase": "enterprise_data"}, {"score": 0.0034328142696903345, "phrase": "advanced_techniques"}, {"score": 0.0033826510524766758, "phrase": "multiple_channels"}, {"score": 0.0031891990067601295, "phrase": "extensible_framework"}, {"score": 0.0028181073938390684, "phrase": "multiple_techniques"}, {"score": 0.0027524673604095787, "phrase": "fine-tuned_splay_and_interval_trees"}, {"score": 0.002649038691536882, "phrase": "stateful_inspection"}, {"score": 0.0026334743451638365, "phrase": "traffic_re-assembly"}, {"score": 0.0026180012065887175, "phrase": "data_stream_correlation"}, {"score": 0.002594961351159294, "phrase": "application_layer_analysis"}, {"score": 0.0025494865958495807, "phrase": "framework's_identification_precision"}, {"score": 0.002446446287270777, "phrase": "\"_protocol_analyzers"}, {"score": 0.0022131734411174977, "phrase": "forensic_analysis"}, {"score": 0.002200164358389725, "phrase": "threat_evaluation"}, {"score": 0.0021236966590184475, "phrase": "excellent_overall_performance"}, {"score": 0.0021049977753042253, "phrase": "controlled_and_real-world_environments"}], "paper_keywords": ["instant messaging", " peer-to-peer overlay networks", " analyzer-based session identification", " traffic arbitration", " classification accuracy"], "paper_abstract": "Sessions generated by Instant Messaging and Peer-to-Peer systems (IM/P2Ps) not only consume considerable bandwidth and computing resources but also dramatically change the characteristics of data flows affecting both the operation and performance of networks. Most IM/P2Ps have known security loopholes and vulnerabilities making them an ideal platform for the dissemination of viruses, worms, and other malware. The lack of access control and weak authentication on shared resources further exacerbates the situation. Should IM/P2Ps be deployed in production environments, performance of conventional applications may significantly deteriorate and enterprise data may be contaminated. It is therefore imperative to identify, monitor and finally manage IM/P2P traffic. Unfortunately, this task cannot be easily attained as IM/P2Ps resort to advanced techniques to hide their traces including multiple channels to deliver services, port hopping, message encapsulation and encryption. In this paper, we propose an extensible framework that not only helps to identify and classify IM/P2P-generated sessions in real time but also assists in the manipulation of such traffic. Consisting of four modules namely, session manager, traffic assembler, IM/P2P dissector, and traffic arbitrator, our proposed framework uses multiple techniques to improve its traffic classification accuracy and performance. Through fine-tuned splay and interval trees that help organize IM/P2P sessions and packets in data streams, we accomplish stateful inspection, traffic re-assembly, data stream correlation, and application layer analysis that combined will boost the framework's identification precision. More importantly, we introduce IM/P2Ps \"plug-and-play\" protocol analyzers that inspect data streams according to their syntax and semantics; these analyzers render our framework easily extensible. Identified IM/P2P sessions can be shaped, blocked, or disconnected, and corresponding traffic can be stored for forensic analysis and threat evaluation. Experiments with our prototype show high IM/P2Ps detection accuracy rates under diverse settings and excellent overall performance in both controlled and real-world environments.", "paper_title": "Identification and management of sessions generated by instant messaging and peer-to-peer systems", "paper_id": "WOS:000256593000001"}