{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "steer_clustering_results"}, {"score": 0.00476697427418509, "phrase": "significant_effort"}, {"score": 0.004377921202912336, "phrase": "prior_domain_knowledge"}, {"score": 0.004040688646993605, "phrase": "clustering_outcomes"}, {"score": 0.00392100783796804, "phrase": "diverse_application_scientists"}, {"score": 0.0038048583022763796, "phrase": "interaction_style"}, {"score": 0.0036553070575015344, "phrase": "clustering_results"}, {"score": 0.003407549468745519, "phrase": "dual_primitives"}, {"score": 0.0032900200522703923, "phrase": "current_segmentation"}, {"score": 0.002946312377831317, "phrase": "single_step"}, {"score": 0.0027464781499539296, "phrase": "nonlinear_optimization_framework"}, {"score": 0.0026120705848349055, "phrase": "user-supplied_constraints"}, {"score": 0.0024842242921857705, "phrase": "visual_analytic_application"}, {"score": 0.002447101794397243, "phrase": "baffle_shapes"}, {"score": 0.0024105326885334962, "phrase": "bat_biosonar"}, {"score": 0.0022810491620483737, "phrase": "domain_experts"}, {"score": 0.0021049977753042253, "phrase": "numerous_instance-level_constraints"}], "paper_keywords": ["Scatter/gather clustering", " alternative clustering", " constrained clustering"], "paper_abstract": "Significant effort has been devoted to designing clustering algorithms that are responsive to user feedback or that incorporate prior domain knowledge in the form of constraints. However, users desire more expressive forms of interaction to influence clustering outcomes. In our experiences working with diverse application scientists, we have identified an interaction style scatter/gather clustering that helps users iteratively restructure clustering results to meet their expectations. As the names indicate, scatter and gather are dual primitives that describe whether clusters in a current segmentation should be broken up further or, alternatively, brought back together. By combining scatter and gather operations in a single step, we support very expressive dynamic restructurings of data. Scatter/gather clustering is implemented using a nonlinear optimization framework that achieves both locality of clusters and satisfaction of user-supplied constraints. We illustrate the use of our scatter/gather clustering approach in a visual analytic application to study baffle shapes in the bat biosonar (ears and nose) system. We demonstrate how domain experts are adept at supplying scatter/gather constraints, and how our framework incorporates these constraints effectively without requiring numerous instance-level constraints.", "paper_title": "Scatter/Gather Clustering: Flexibly Incorporating User Feedback to Steer Clustering Results", "paper_id": "WOS:000310143100088"}