{"auto_keywords": [{"score": 0.04242092921688311, "phrase": "topic_models"}, {"score": 0.012421384716028864, "phrase": "task_performance"}, {"score": 0.004767546015485477, "phrase": "probabilistic_topic_models"}, {"score": 0.004697308822154191, "phrase": "empirical_study"}, {"score": 0.004651057147690674, "phrase": "plsa_and_lda._probabilistic_topic_models"}, {"score": 0.004109770306454165, "phrase": "promising_performance"}, {"score": 0.003685604033479918, "phrase": "critical_questions"}, {"score": 0.0033379819706003885, "phrase": "competing_models"}, {"score": 0.0032724821705972357, "phrase": "local_maxima"}, {"score": 0.0029199689963238726, "phrase": "systematic_investigation"}, {"score": 0.0025668646315794947, "phrase": "text_categorization"}, {"score": 0.0025289662786567896, "phrase": "ad-hoc_retrieval"}, {"score": 0.002442693254693416, "phrase": "deeper_understanding"}, {"score": 0.0022675820982741347, "phrase": "typical_tasks"}, {"score": 0.002234092591045251, "phrase": "task-based_evaluation_framework"}, {"score": 0.0021259852291601396, "phrase": "plsa"}, {"score": 0.00210500109827911, "phrase": "lda."}], "paper_keywords": ["Evaluation", " Topic models", " LDA", " PLSA", " Experimentation", " Performance"], "paper_abstract": "Probabilistic topic models have recently attracted much attention because of their successful applications in many text mining tasks such as retrieval, summarization, categorization, and clustering. Although many existing studies have reported promising performance of these topic models, none of the work has systematically investigated the task performance of topic models; as a result, some critical questions that may affect the performance of all applications of topic models are mostly unanswered, particularly how to choose between competing models, how multiple local maxima affect task performance, and how to set parameters in topic models. In this paper, we address these questions by conducting a systematic investigation of two representative probabilistic topic models, probabilistic latent semantic analysis (PLSA) and Latent Dirichlet Allocation (LDA), using three representative text mining tasks, including document clustering, text categorization, and ad-hoc retrieval. The analysis of our experimental results provides deeper understanding of topic models and many useful insights about how to optimize the performance of topic models for these typical tasks. The task-based evaluation framework is generalizable to other topic models in the family of either PLSA or LDA.", "paper_title": "Investigating task performance of probabilistic topic models: an empirical study of PLSA and LDA", "paper_id": "WOS:000288905300004"}