{"auto_keywords": [{"score": 0.03827394525154412, "phrase": "cds"}, {"score": 0.00481495049065317, "phrase": "load-balanced_virtual_backbone_construction"}, {"score": 0.004626255242038005, "phrase": "backbone_concept"}, {"score": 0.004585332915477379, "phrase": "wired_networks"}, {"score": 0.004308791766002289, "phrase": "wireless_sensor_networks"}, {"score": 0.004066898031169739, "phrase": "existing_methods"}, {"score": 0.003838531755488468, "phrase": "minimum-sized_cds"}, {"score": 0.0035908627899097407, "phrase": "minimum_routing_cost_cds"}, {"score": 0.003404244237372396, "phrase": "load-balance_factor"}, {"score": 0.0032561349010603734, "phrase": "load-balance_factors"}, {"score": 0.002427372728532664, "phrase": "comprehensive_theoretical_analysis"}, {"score": 0.0023951660734372877, "phrase": "approximation_factors"}, {"score": 0.0023010815714140467, "phrase": "simulation_results"}, {"score": 0.0022604585778195152, "phrase": "proposed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Wireless sensor networks", " Load-balanced virtual backbone", " Connected dominating set"], "paper_abstract": "Inspired by the backbone concept in wired networks, a Virtual Backbone (VB) is expected to benefit routing in Wireless Sensor Networks (WSNs). A Connected Dominating Set (CDS) based VB is a competitive approach among the existing methods used to establish VBs in WSNs. Most existing works focus on constructing a Minimum-sized CDS (MCDS), a k-connected m-dominating CDS, a minimum routing cost CDS or a bounded-diameter CDS. However, few works consider the load-balance factor. In this work, the size and the load-balance factors are both taken into account when constructing a VB in WSNs. Specifically, three NP-hard problems are investigated in the paper, namely, the MinMax Degree Maximal Independent Set (MDMIS) problem, the Load-Balanced Virtual Backbone (LBVB) problem, and the MinMax Valid-degree non-Backbone node Allocation (MVBA) problem. Furthermore, their approximation algorithms and comprehensive theoretical analysis of the approximation factors are presented. Finally, our theoretical analysis and the simulation results indicate that the proposed algorithms outperform the existing state-of-the-art approaches. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Approximation algorithms for load-balanced virtual backbone construction in wireless sensor networks", "paper_id": "WOS:000326061800002"}