{"auto_keywords": [{"score": 0.04022673782342741, "phrase": "ppi_network"}, {"score": 0.00481495049065317, "phrase": "identifying_potential_drug_targets"}, {"score": 0.004728499903204582, "phrase": "effective_schemes"}, {"score": 0.00456020621016909, "phrase": "\"one_drug_and_one_drug_target"}, {"score": 0.004413846562278824, "phrase": "novel_strategies"}, {"score": 0.004366106816225457, "phrase": "potential_multiple-drug_targets"}, {"score": 0.0043345662747335065, "phrase": "pathogenic_protein-protein_interaction"}, {"score": 0.0041200448395938526, "phrase": "set_s"}, {"score": 0.003987755561492638, "phrase": "minimum_number"}, {"score": 0.0039019217388438134, "phrase": "human_orthologs"}, {"score": 0.0037357362372975327, "phrase": "even_the_best_approximation_algorithms"}, {"score": 0.003486913922294352, "phrase": "optimal_tradeoff"}, {"score": 0.003350480663660326, "phrase": "protein_targets"}, {"score": 0.0033021988455635403, "phrase": "\"sparsest_cut''_problem"}, {"score": 0.0032310733124059567, "phrase": "respective_approximation_factors"}, {"score": 0.00320770578058916, "phrase": "vertical_bar_s_vertical_bar"}, {"score": 0.003037736332283186, "phrase": "escherichia_coli_ppi_network"}, {"score": 0.0024430651605100214, "phrase": "smallest_set"}, {"score": 0.0021670777282518424, "phrase": "e._coli_ppi_network"}, {"score": 0.0021049977753042253, "phrase": "relative_sizes"}], "paper_keywords": ["algorithms", " biochemical networks", " computational molecular biology"], "paper_abstract": "As pathogens evolve effective schemes to overcome the effect of antibiotics, the prevalent \"one drug and one drug target\" approach is falling behind. We propose novel strategies for identifying potential multiple-drug targets in pathogenic protein-protein interaction (PPI) networks with the goal of disrupting known pathways/complexes. Given a set S of pathogenic pathways/complexes, we first consider computing the minimum number of proteins (with no human orthologs) whose removal from the PPI network disrupts all pathways/complexes. Unfortunately, even the best approximation algorithms for this (NP-hard) problem return too many targets to be practical. Thus, we focus on computing the optimal tradeoff (i.e., maximum ratio) between the number of disrupted essential pathways/complexes and the protein targets. For this \"sparsest cut'' problem, we describe two polynomial time algorithms with respective approximation factors of vertical bar S vertical bar and O(root n) (n: number of nodes). On the Escherichia coli PPI network with nine essential (signaling) paths from the KEGG database, our algorithms show how to disrupt three of them by targeting only three proteins (two of them essential proteins). We also consider the case where there are no available essential pathways/complexes to guide us. In order to maximize the number of disrupted \"potential'' pathways/complexes, we show how to compute the smallest set of proteins whose removal partitions the PPI network into two almost-equal sized subnetworks so as to maximize the number of potential pathways/complexes disrupted. This approach yields 28 potential targets (four of them known drug targets) on the E. coli PPI network whose removal partitions it to two subnetworks with relative sizes of 1-5.", "paper_title": "Protein-Protein Interaction Network Evaluation for Identifying Potential Drug Targets", "paper_id": "WOS:000279272400002"}