{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "smartphone_addiction_symptoms"}, {"score": 0.048398179269243544, "phrase": "social_capital"}, {"score": 0.004383852039913171, "phrase": "psychological_attributes"}, {"score": 0.004211069233133584, "phrase": "smartphone_usage_patterns"}, {"score": 0.003920476803132283, "phrase": "online_survey"}, {"score": 0.0038855864345030563, "phrase": "mainland_china"}, {"score": 0.0038167308978417306, "phrase": "exploratory_factor_analysis"}, {"score": 0.0037827603118271757, "phrase": "five_smartphone_addiction_symptoms"}, {"score": 0.0037157201349604222, "phrase": "harmful_consequences"}, {"score": 0.003569176320452192, "phrase": "productivity_loss"}, {"score": 0.002815864555488112, "phrase": "clear_evidence"}, {"score": 0.002729029534060092, "phrase": "different_purposes"}, {"score": 0.0025404470150468387, "phrase": "different_addiction_symptoms"}, {"score": 0.002418393046947528, "phrase": "significantly_impacted_social_capital_building"}, {"score": 0.002354302193867031, "phrase": "smartphone_addiction"}, {"score": 0.002251227801482381, "phrase": "clear_implications"}, {"score": 0.0021430393104977788, "phrase": "policy_makers"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["loneliness", " Mainland China", " shyness", " social capital", " smartphone addiction"], "paper_abstract": "The purpose of this study is to explore the roles of psychological attributes (such as shyness and loneliness) and smartphone usage patterns in predicting smartphone addiction symptoms and social capital. Data were gathered from a sample of 414 university students using online survey in Mainland China. Results from exploratory factor analysis identified five smartphone addiction symptoms: disregard of harmful consequences, preoccupation, inability to control craving, productivity loss, and feeling anxious and lost, which formed the Smartphone Addiction Scale. Results show that the higher one scored in loneliness and shyness, the higher the likelihood one would be addicted to smartphone. Furthermore, this study shows the most powerful predictor inversely affecting both bonding and bridging social capital was loneliness. Moreover, this study presents clear evidence that the use of smartphones for different purposes (especially for information seeking, sociability, and utility) and the exhibition of different addiction symptoms (such as preoccupation and feeling anxious and lost) significantly impacted social capital building. The significant links between smartphone addiction and smartphone usage, loneliness, and shyness have clear implications for treatment and intervention for parents, educators, and policy makers. Suggestions for future research are discussed.", "paper_title": "Linking Loneliness, Shyness, Smartphone Addiction Symptoms, and Patterns of Smartphone Use to Social Capital", "paper_id": "WOS:000348103000004"}