{"auto_keywords": [{"score": 0.02894806132051853, "phrase": "individual_values"}, {"score": 0.00481495049065317, "phrase": "presence_streams"}, {"score": 0.004783105609960904, "phrase": "collaboration_technologies"}, {"score": 0.0047357308775561255, "phrase": "information_sharing"}, {"score": 0.004344232223147987, "phrase": "explicit_action"}, {"score": 0.0041195049121633956, "phrase": "presence_systems"}, {"score": 0.004078675940346967, "phrase": "emerging_class"}, {"score": 0.0039323878878973284, "phrase": "pervasive_sensors"}, {"score": 0.0038676325043529524, "phrase": "user_location"}, {"score": 0.003803939387792038, "phrase": "available_communication_channels"}, {"score": 0.003691913669486176, "phrase": "wide-spread_adoption"}, {"score": 0.0034431390653713173, "phrase": "privacy-preserving_aggregation"}, {"score": 0.0033639840192975835, "phrase": "privacy_concerns"}, {"score": 0.003319569552937513, "phrase": "presence_data"}, {"score": 0.0031372369299648203, "phrase": "full_access"}, {"score": 0.003054922297665861, "phrase": "third_party"}, {"score": 0.0029452441730331617, "phrase": "data_values"}, {"score": 0.002820675782452964, "phrase": "statistical_information"}, {"score": 0.0023028105026714533, "phrase": "collapse_security"}, {"score": 0.0022348937352254343, "phrase": "collapse_protocols"}, {"score": 0.002183454435945014, "phrase": "efficiency_tradeoffs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Privacy", " Presence systems", " Awareness", " Access control", " Cloud computing", " Homomorphic encryption"], "paper_abstract": "Collaboration technologies must support information sharing between collaborators, but must also take care not to share too much information or share information too widely. Systems that share information without requiring an explicit action by a user to initiate the sharing must be particularly cautious in this respect. Presence systems are an emerging class of applications that support collaboration. Through the use of pervasive sensors, these systems estimate user location, activities, and available communication channels. Because such presence data are sensitive, to achieve wide-spread adoption, sharing models must reflect the privacy and sharing preferences of their users. This paper looks at the role that privacy-preserving aggregation can play in addressing certain user sharing and privacy concerns with respect to presence data. We define conditions to achieve CollaPSE (Collaboration Presence Sharing Encryption) security, in which (i) an individual has full access to her own data, (ii) a third party performs computation on the data without learning anything about the data values, and (iii) people with special privileges called \"analysts\" can learn statistical information about groups of individuals, but nothing about the individual values contributing to the statistic other than what can be deduced from the statistic. More specifically, analysts can decrypt aggregates without being able to decrypt the individual values contributing to the aggregate. Based in part on studies we carried out that illustrate the need for the conditions encapsulated by CollaPSE security, we designed and implemented a family of CollaPSE protocols. We analyze their security, discuss efficiency tradeoffs, describe extensions, and review more recent privacy-preserving aggregation work. Published by Elsevier B.V.", "paper_title": "Private aggregation for presence streams", "paper_id": "WOS:000329683200015"}