{"auto_keywords": [{"score": 0.03873396617744639, "phrase": "anfsga_control_system"}, {"score": 0.003513133979793917, "phrase": "rov"}, {"score": 0.0034304883989739804, "phrase": "high_precision_position_control"}, {"score": 0.003045440856986832, "phrase": "direction-based_genetic_algorithm"}, {"score": 0.003009746642843291, "phrase": "ga"}, {"score": 0.002801849371896573, "phrase": "on-line_learning_ability"}, {"score": 0.0026874405408023956, "phrase": "parametric_uncertainty"}, {"score": 0.002593091742792519, "phrase": "anfs_inference_parameters"}, {"score": 0.002532035301903554, "phrase": "proposed_controller"}, {"score": 0.0025020469669826497, "phrase": "ga_control_system"}, {"score": 0.002414191082427217, "phrase": "major_controller"}, {"score": 0.002234252028553481, "phrase": "mode_control_system"}, {"score": 0.0022077827041801193, "phrase": "strict_constraints"}, {"score": 0.002181626277903721, "phrase": "detailed_system_knowledge"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["ROV", " Sliding mode", " GA", " Anfis", " On-line"], "paper_abstract": "This study presents an adaptive neuro-fuzzy sliding-mode-based genetic algorithm (ANFSGA) control system for a remotely operated vehicle (ROV) with four degrees of freedom (DOF)s. In many applications, ROVs will need to be capable of maneuvering to any given point, following object, and to be controllable from the surface. Therefore, an ANFSGA control system is introduced for tracking control of the ROV to achieve a high precision position control. Since the dynamic of ROVs are highly nonlinear and time varying, an ANFSGA control system is investigated according to direction-based genetic algorithm (GA) with the spirit of sliding mode control and adaptive neuro-fuzzy sliding mode (ANFS) based evolutionary procedure. In this way, on-line learning ability is employed to deal with the parametric uncertainty and disturbance by adjusting the ANFS inference parameters. In this proposed controller a GA control system is utilized to be the major controller, and stability can be indirectly insured by the concept of sliding mode control system without strict constraints and detailed system knowledge. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "An adaptive neuro-fuzzy sliding mode based genetic algorithm control system for under water remotely operated vehicle", "paper_id": "WOS:000271571000072"}