{"auto_keywords": [{"score": 0.037702637270507856, "phrase": "whole_supply_chain"}, {"score": 0.031238330630895195, "phrase": "decision_support_tool"}, {"score": 0.00481495049065317, "phrase": "two-level_supply_chains"}, {"score": 0.004661868629458321, "phrase": "disparate_but_inter-dependent_members"}, {"score": 0.004231089088705995, "phrase": "conflicting_objectives"}, {"score": 0.0034210342328868017, "phrase": "entire_supply_chain"}, {"score": 0.003312121699003206, "phrase": "supply_chain_contracts"}, {"score": 0.0030336118627011786, "phrase": "two-phase_framework"}, {"score": 0.0027784560880013886, "phrase": "two-level_supply_chain"}, {"score": 0.002702415623060517, "phrase": "analytical_model"}, {"score": 0.0026284507395498897, "phrase": "classical_newsboy_problem"}, {"score": 0.002363150587804677, "phrase": "graph-theoretic_model"}, {"score": 0.002174303033371869, "phrase": "supply_chain_members"}, {"score": 0.0021049977753042253, "phrase": "supply_chain_performance"}], "paper_keywords": ["Supply chain contracts", " Coordination", " Buy back", " Revenue sharing", " Quantity flexibility", " Graph-theoretic approach"], "paper_abstract": "A supply chain consists of disparate but inter-dependent members who are dependent on each other to manage various resources (such as inventory, money and information). The conflicting objectives and lack of coordination between these members may often cause uncertainties in supply and demand. Coordination may help in managing inter-dependencies and reducing uncertainties. Typically, a mechanism is required to streamline the whole supply chain and motivate all the members to be a part of the entire supply chain for sharing risks and rewards through supply chain contracts. The objective of this paper is to explore the applicability and benefits of the contracts. A two-phase framework is proposed consisting of a decision support tool and a graph-theoretic model for evaluation of coordination in a two-level supply chain. In Phase 1, an analytical model is proposed based on the classical newsboy problem. Various contract mechanisms have been explored through a decision support tool based on the simulation. The effectiveness of these contracts is evaluated through a graph-theoretic model in Phase II. It is expected that by designing the contracts as per the requirements of the supply chain members as well as the whole supply chain, supply chain performance may be improved. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A framework for evaluation of coordination by contracts: A case of two-level supply chains", "paper_id": "WOS:000266754900002"}