{"auto_keywords": [{"score": 0.04980966034777181, "phrase": "gene_regulatory_networks"}, {"score": 0.030602350542879745, "phrase": "domain_expert"}, {"score": 0.00481495049065317, "phrase": "effective_control"}, {"score": 0.004487181594905386, "phrase": "different_diseases"}, {"score": 0.0042891660310426976, "phrase": "different_conditions"}, {"score": 0.004169849868036158, "phrase": "gene_regulatory_network"}, {"score": 0.004146396729786534, "phrase": "grn"}, {"score": 0.0038422029563265326, "phrase": "scalable_technique"}, {"score": 0.0033934090791564856, "phrase": "control_policy"}, {"score": 0.0033269940500921832, "phrase": "novel_method"}, {"score": 0.0032989285553141913, "phrase": "gene_relevancy"}, {"score": 0.003117761489610736, "phrase": "reduced_model"}, {"score": 0.0030138579483664917, "phrase": "latter_genes"}, {"score": 0.0029632081217391866, "phrase": "threshold_value"}, {"score": 0.002792525151151103, "phrase": "appropriate_threshold_value"}, {"score": 0.0026842192753268705, "phrase": "budding_yeast"}, {"score": 0.0026316476955518175, "phrase": "reported_test_results"}, {"score": 0.002551102421211472, "phrase": "investigated_grns"}, {"score": 0.0024730166037314734, "phrase": "mcmi"}, {"score": 0.0023973144298770517, "phrase": "computation_cost"}, {"score": 0.0023305026804332947, "phrase": "proposed_approach"}, {"score": 0.0022913106863415456, "phrase": "proposed_reduction_strategy_results"}, {"score": 0.0022655487067269717, "phrase": "optimal_solutions"}, {"score": 0.0021776365628787065, "phrase": "huge_state_space"}, {"score": 0.0021531499016013704, "phrase": "large_number"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Gene regulatory networks", " Control policy", " Scalability technique", " Feature reduction", " Probabilistic Boolean networks", " Markov decision problems"], "paper_abstract": "Objective: Interactions between genes are realized as gene regulatory networks (GRNs). The control of such networks is essential for investigating issues like different diseases. Control is the process of studying the states and behavior of a given system under different conditions. The system considered in this study is a gene regulatory network (GRN), and one of the most important aspects in the control of GRNs is scalability. Consequently, the objective of this study is to develop a scalable technique that facilitates the control of GRNs. Method: As the approach described in this paper concentrates on the control of GRNs, we argue that it is possible to improve scalability by reducing the number of genes to be considered by the control policy. Consequently, we propose a novel method that considers gene relevancy to estimate genes that are less important for control. This way, it is possible to get a reduced model after identifying genes that can be ignored in model-building. The latter genes are located based on a threshold value which is expected to be provided by a domain expert. Some guidelines are listed to help the domain expert in setting appropriate threshold value. Results: We run experiments using both synthetic and real data, including metastatic melanoma and budding yeast (Saccharomyces cerevisiae). The reported test results identified genes that could be eliminated from each of the investigated GRNs. For instance, test results on budding yeast identified the two genes SWI5 and MCMI as candidates to be eliminated. This considerably reduces the computation cost and hence demonstrate the applicability and effectiveness of the proposed approach. Conclusion: Employing the proposed reduction strategy results in close to optimal solutions to the control of GRNs, which are otherwise intractable due to the huge state space implied by the large number of genes. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Scalable approach for effective control of gene regulatory networks", "paper_id": "WOS:000274527700005"}