{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "complex_adaptive_systems"}, {"score": 0.00475413908468027, "phrase": "situated_multi-agents"}, {"score": 0.004664352260912174, "phrase": "complex_system"}, {"score": 0.004404994123834589, "phrase": "retroactive_way"}, {"score": 0.004321772629297024, "phrase": "system_dynamics"}, {"score": 0.004186534737631288, "phrase": "retroactive_interactions"}, {"score": 0.003829877278269543, "phrase": "global_system"}, {"score": 0.0036167509502276294, "phrase": "individual_behaviour"}, {"score": 0.0034154440860550564, "phrase": "complex_systems"}, {"score": 0.003026391655379905, "phrase": "multi-agent_paradigm"}, {"score": 0.0028037753646260937, "phrase": "mas_litterature"}, {"score": 0.0026815368507715, "phrase": "multiagent_paradigm"}, {"score": 0.002564613964408878, "phrase": "existing_works"}, {"score": 0.0022578275190855124, "phrase": "intuitive_guidelines"}, {"score": 0.002215081186105616, "phrase": "self-organising_systems"}], "paper_keywords": [""], "paper_abstract": "A complex system is a set of entities interrelated in a retroactive way. The system dynamics is held by the retroactive interactions occuring between its components, making the behaviour, structure or organisation of the global system emergent and non predictable from/non reducible to the individual behaviour or structure of its components. This characteristic of complex systems, makes them more considered from their organisational point of view rather than from the structural/ behavioural aspects of their components. The multi-agent paradigm provides a very suitable tool for modeling/engineering such systems. Many examples exist in the MAS litterature, showing the use of the multiagent paradigm to develop such systems. However, existing works propose ad hoc approaches/mechanisms. In this paper we discuss some of these works and present a set of intuitive guidelines for engineering self-organising systems, through their positionning at the heart of 3 domains: Complex Adaptive Systems, Non Linear Dynamic Systems and Situated Multi-Agents.", "paper_title": "Engineering complex adaptive systems using situated multi-agents", "paper_id": "WOS:000238506800008"}