{"auto_keywords": [{"score": 0.03871222963635967, "phrase": "ski-rental_problem"}, {"score": 0.009933412312209433, "phrase": "multiple_services"}, {"score": 0.00481495049065317, "phrase": "statistical_information"}, {"score": 0.004658426838467567, "phrase": "cloud_service_providers"}, {"score": 0.0045736684402340275, "phrase": "scale_resources"}, {"score": 0.004457579615095599, "phrase": "cloud_applications"}, {"score": 0.004265354774450696, "phrase": "crucial_tradeoffs"}, {"score": 0.004066416005586085, "phrase": "web_application"}, {"score": 0.003820144626025562, "phrase": "cache_storage"}, {"score": 0.0037231102027070724, "phrase": "future_compute_costs"}, {"score": 0.003536346954940087, "phrase": "to-rent-or-to-buy_tradeoff"}, {"score": 0.0031437775259091794, "phrase": "multislope_version"}, {"score": 0.002825681384008326, "phrase": "classical_ski-rental_problem"}, {"score": 0.0026446021865907197, "phrase": "ski_days"}, {"score": 0.002558450494671067, "phrase": "classical_multislope_ski-rental_problem"}, {"score": 0.0023421547766273036, "phrase": "best_worst-case"}, {"score": 0.00226583335721762, "phrase": "new_class"}, {"score": 0.0022492129111567824, "phrase": "randomized_algorithms"}, {"score": 0.002224510044064184, "phrase": "arrivals-distribution-free_performance_guarantees"}, {"score": 0.002159951198924152, "phrase": "robust_average-cost_performance"}, {"score": 0.0021049977753042253, "phrase": "well-known_deterministic_and_randomized_schemes"}], "paper_keywords": ["Cloud cost optimization", " game theory", " randomized algorithms", " ski-rental problem"], "paper_abstract": "Cloud service providers enable tenants to elastically scale resources to meet their demands. While running cloud applications, a tenant aiming to minimize cost is often challenged with crucial tradeoffs. For instance, upon each arrival of a query, a Web application can either choose to pay for CPU to compute the response fresh, or pay for cache storage to store the response to reduce future compute costs. The Ski-Rental problem abstracts such scenarios where a tenant is faced with a to-rent-or-to-buy tradeoff; in its basic form, a skier should choose between renting or buying a set of skis without knowing the number of days she will be skiing. In the multislope version of the Ski-Rental problem, the skier can choose among multiple services that differ in their buying and renting prices. In this paper, we introduce a variant of the classical Ski-Rental problem in which we assume that the skier knows the first (or second) moment of the distribution of the number of ski days in a season. We also extend the classical multislope Ski-Rental problem, where the skier can choose among multiple services, to this setting. We demonstrate that utilizing this information leads to achieving the best worst-case expected competitive ratio performance. Our method yields a new class of randomized algorithms that provide arrivals-distribution-free performance guarantees. Simulations illustrate that our scheme exhibits robust average-cost performance that combines the best of the well-known deterministic and randomized schemes previously proposed to tackle the Ski-Rental problem.", "paper_title": "To Rent or to Buy in the Presence of Statistical Information: The Constrained Ski-Rental Problem", "paper_id": "WOS:000360067600004"}