{"auto_keywords": [{"score": 0.004762665113390216, "phrase": "compact_representation"}, {"score": 0.004625983640628956, "phrase": "shape_signatures"}, {"score": 0.004526041191525413, "phrase": "fast_indexing_mechanism"}, {"score": 0.004493207015584002, "phrase": "shape_retrieval"}, {"score": 0.004460609967916904, "phrase": "effective_shape_signatures"}, {"score": 0.004412155302768363, "phrase": "global_geometric_properties"}, {"score": 0.004285489630701221, "phrase": "rotation_invariant"}, {"score": 0.0041473140210277724, "phrase": "effective_shape_signature"}, {"score": 0.0037588493723080757, "phrase": "skeletal_articulations"}, {"score": 0.003704467870496114, "phrase": "topology-based_matching_methods"}, {"score": 0.003481957226813911, "phrase": "signature_indexing"}, {"score": 0.0034066464009965425, "phrase": "topology-based_methods"}, {"score": 0.0033696019683761274, "phrase": "new_signature"}, {"score": 0.003296713221268488, "phrase": "topology_change"}, {"score": 0.0031903162513050804, "phrase": "similar_shapes"}, {"score": 0.0031671412657333364, "phrase": "different_genus"}, {"score": 0.00296597499768551, "phrase": "boundary_surface"}, {"score": 0.002838993542880416, "phrase": "novel_function"}, {"score": 0.0025447584328314754, "phrase": "informative_measure"}, {"score": 0.0024092539025697014, "phrase": "centricity_function"}, {"score": 0.002374351263279043, "phrase": "average_geodesic_distance"}], "paper_keywords": ["shape-signature", " shape-matching", " pose-oblivious"], "paper_abstract": "A 3D shape signature is a compact representation for some essence of a shape. Shape signatures are commonly utilized as a fast indexing mechanism for shape retrieval. Effective shape signatures capture some global geometric properties which are scale, translation, and rotation invariant. In this paper, we introduce an effective shape signature which is also pose-oblivious. This means that the signature is also insensitive to transformations which change the pose of a 3D shape such as skeletal articulations. Although some topology-based matching methods can be considered pose-oblivious as well, our new signature retains the simplicity and speed of signature indexing. Moreover, contrary to topology-based methods, the new signature is also insensitive to the topology change of the shape, allowing us to match similar shapes with different genus. Our shape signature is a 2D histogram which is a combination of the distribution of two scalar functions defined on the boundary surface of the 3D shape. The first is a definition of a novel function called the local-diameter function. This function measures the diameter of the 3D shape in the neighborhood of each vertex. The histogram of this function is an informative measure of the shape which is insensitive to pose changes. The second is the centricity function that measures the average geodesic distance from one vertex to all other vertices on the mesh. We evaluate and compare a number of methods for measuring the similarity between two signatures, and demonstrate the effectiveness of our pose-oblivious shape signature within a 3D search engine application for different databases containing hundreds of models.", "paper_title": "Pose-oblivious shape signature", "paper_id": "WOS:000243389100006"}