{"auto_keywords": [{"score": 0.030926517488363503, "phrase": "protector_resources"}, {"score": 0.00481495049065317, "phrase": "enterprise_network_security"}, {"score": 0.004723322467153553, "phrase": "formal_model"}, {"score": 0.0046632033374901715, "phrase": "security_risk_assessment"}, {"score": 0.004574449773348889, "phrase": "enterprise_information_security"}, {"score": 0.004076157223660074, "phrase": "enterprise_it_infrastructure"}, {"score": 0.003631945391344252, "phrase": "enterprise_network"}, {"score": 0.0027212777001495176, "phrase": "protected_resources"}, {"score": 0.002535779689260244, "phrase": "security_risk"}, {"score": 0.0023934306706217797, "phrase": "optimization_method"}, {"score": 0.002273605493468005, "phrase": "graph_model"}, {"score": 0.0022159566043745724, "phrase": "enterprise_decision_makers"}, {"score": 0.0021049977753042253, "phrase": "expected_risks"}], "paper_keywords": [""], "paper_abstract": "A formal model of security risk assessment for an enterprise information security is developed. The model, called the Graph Model, is constructed based on the mapping of an enterprise IT infrastructure and networks/systems onto a graph. Components of the model include the nodes which represent hosts in enterprise network and their weights of importance and security, the connections of the nodes, and the safeguards used with their costs and effectiveness. The model can assist to identify inappropriate, insufficient or waste protector resources like safeguards that are relative to the needs of the protected resources, and then reallocates the funds or protector resources to minimize security risk. An example is provided to represent the optimization method and process. The goal of using Graph Model is to help enterprise decision makers decide whether their security investment is consistent with the expected risks and how to allocate the funds or protector resources.", "paper_title": "A risk assessment model for enterprise network security", "paper_id": "WOS:000241471800028"}