{"auto_keywords": [{"score": 0.04568859165801613, "phrase": "muskmelon_epidermis"}, {"score": 0.013517321540613208, "phrase": "classical_measures"}, {"score": 0.010878168268155698, "phrase": "multifractal_analysis"}, {"score": 0.010825129489949088, "phrase": "lacunarity_analysis"}, {"score": 0.00481495049065317, "phrase": "automated_assessment"}, {"score": 0.004767827160373674, "phrase": "cucumis"}, {"score": 0.004721162131188487, "phrase": "epidermis_netting"}, {"score": 0.004652016085325825, "phrase": "plant_phenotype"}, {"score": 0.00462919213721188, "phrase": "image_analysis"}, {"score": 0.004406994912939125, "phrase": "phenotypic_and_genotypic_data"}, {"score": 0.00424734451992536, "phrase": "fruit's_growth_condition"}, {"score": 0.004185108816866677, "phrase": "commercial_value"}, {"score": 0.0041136473765874815, "phrase": "muskmelon_netting"}, {"score": 0.004073359218158693, "phrase": "coverage_rate"}, {"score": 0.003584025547693836, "phrase": "netting_distribution"}, {"score": 0.003557653536102669, "phrase": "last_two_methods"}, {"score": 0.003522791397340303, "phrase": "subjective_evaluations"}, {"score": 0.0032398798149196432, "phrase": "luhoutian"}, {"score": 0.0031223774204093713, "phrase": "classical_texture_features"}, {"score": 0.003069034225709555, "phrase": "gabor"}, {"score": 0.003009123680803601, "phrase": "supervised_classification_processes"}, {"score": 0.002899965889623787, "phrase": "growth_monitoring_system"}, {"score": 0.002822434555587263, "phrase": "watershed_transformation"}, {"score": 0.0027200305495826797, "phrase": "fractal_properties"}, {"score": 0.00266693888510356, "phrase": "extracted_generalized_dimensions"}, {"score": 0.0025828604252720465, "phrase": "generalized_dimensions"}, {"score": 0.002470791491547134, "phrase": "different_growth_stages"}, {"score": 0.0024106407122474046, "phrase": "automated_extraction_tool"}, {"score": 0.0023519508354777215, "phrase": "multifractal_dimension"}, {"score": 0.0023288759982072003, "phrase": "valuable_additions"}, {"score": 0.0022168460543913787, "phrase": "classical_features"}, {"score": 0.0021789194955896124, "phrase": "gabor_filters"}, {"score": 0.00216286410656986, "phrase": "wavelet_transform"}, {"score": 0.0021416404045850224, "phrase": "fruit_epidermis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Image analysis", " Cucumis melo L.", " Epidermis netting", " Multifractal analysis", " Lacunarity analysis"], "paper_abstract": "The quantification of the plant phenotype via image analysis has the potential to objectively evaluate its growth and quality, and is compatible with databases which aim to combine phenotypic and genotypic data. The muskmelon epidermis netting is one of the most important phenotype traits, because it directly reflects fruit's growth condition and directly relates to the commercial value of the product. Classical measures of muskmelon netting, including netting coverage rate, netting (non-netted, sparsely netted, partially netted and completely netted), and wrinkled skin or not, are employed study in breeding and cultivation. These measurements were proven to be sufficient for some studies. However, they are less well suited for quantifying changes in the netting distribution and the last two methods are mainly through subjective evaluations by eyes. This study focuses on the benefits of multifractal and lacunarity analysis in quantifying the muskmelon epidermis netting. We applied the multifractal analysis and lacunarity analysis on three cultivars (Wanglu, Feicui and Luhoutian) and four different growth stages. Their efficiencies were proved by comparison to the classical texture features (co-occurrence matrices, Gabor filters and the wavelet transform) in supervised classification processes (AdaBoost and support vector machine classifiers). Based on the images from growth monitoring system, some image processing-mathematical morphology operations, the watershed transformation and overlap were used before analysis. We found that the epidermis netting showed fractal properties. Comparisons among cultivars showed that the extracted generalized dimensions of netting were significantly different while their coverage rate is less different. The generalized dimensions D-0, D-1, D-2 and the lacunarity parameter b could be used to discriminate netting from different growth stages. Using multifractal analysis and lacunarity analysis, we present an automated extraction tool of the muskmelon epidermis netting. These results demonstrate that multifractal dimension and lacunarity are valuable additions to classical measures of epidermis netting. Features obtained by combining fractal, lacunarity, multifractal features contributed to new texture characterization and complementary for classical features (co-occurrence matrices, Gabor filters and the wavelet transform) used in fruit epidermis netting. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Multifractal analysis and lacunarity analysis: A promising method for the automated assessment of muskmelon (Cucumis melo L.) epidermis netting", "paper_id": "WOS:000309303800008"}