{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "detailed_understanding"}, {"score": 0.004552255360140208, "phrase": "real-world_examples"}, {"score": 0.004347972379250724, "phrase": "theoretical_understanding"}, {"score": 0.0042819270655224916, "phrase": "slippery_phenomenon"}, {"score": 0.003966388754366831, "phrase": "memorable_examples"}, {"score": 0.003788296551609616, "phrase": "everyday_life"}, {"score": 0.0037307208089736835, "phrase": "data_collection"}, {"score": 0.0036928221419965253, "phrase": "analysis_process"}, {"score": 0.0035997452281985465, "phrase": "core_principles"}, {"score": 0.003563172322934695, "phrase": "grounded_theory_methodology"}, {"score": 0.003351381374975645, "phrase": "common_elements"}, {"score": 0.0029798924689472014, "phrase": "empirically_grounded_process_model"}, {"score": 0.0028459677232555176, "phrase": "new_connection"}, {"score": 0.0025826247025542213, "phrase": "valuable_outcome"}, {"score": 0.0024918548761791435, "phrase": "potential_value"}, {"score": 0.0021595094738887767, "phrase": "structured_means"}, {"score": 0.0021049977753042253, "phrase": "serendipitous_experiences"}], "paper_keywords": ["Serendipity", " Serendipitous", " Chance", " Information discovery", " Encountering", " Modelling", " Research"], "paper_abstract": "Purpose - This research seeks to gain a detailed understanding of how researchers come across information serendipitously, grounded in real-world examples. This research was undertaken to enrich the theoretical understanding of this slippery phenomenon. Design/methodology/approach - Semi-structured critical incident interviews were conducted with 28 interdisciplinary researchers. Interviewees were asked to discuss memorable examples of coming across information serendipitously from their research or everyday life. The data collection and analysis process followed many of the core principles of grounded theory methodology. Findings - The examples provided were varied, but shared common elements (they involved a mix of unexpectedness and insight and led to a valuable, unanticipated outcome). These elements form part of an empirically grounded process model of serendipity. In this model, a new connection is made that involves a mix of unexpectedness and insight and has the potential to lead to a valuable outcome. Projections are made on the potential value of the outcome and actions are taken to exploit the connection, leading to an (unanticipated) valuable outcome. Originality/value - The model provides researchers across disciplines with a structured means of understanding and describing serendipitous experiences.", "paper_title": "Coming across information serendipitously - Part 1 A process model", "paper_id": "WOS:000309295600006"}