{"auto_keywords": [{"score": 0.04978789345170098, "phrase": "viral_marketing"}, {"score": 0.02704657246000091, "phrase": "social_network"}, {"score": 0.00481495049065317, "phrase": "dedicated_customers"}, {"score": 0.004742113322179817, "phrase": "considerable_concerns"}, {"score": 0.004612737130011709, "phrase": "new_paradigm"}, {"score": 0.00442093689661089, "phrase": "limited_number"}, {"score": 0.004223237458569843, "phrase": "targeted_users"}, {"score": 0.0039975862967816765, "phrase": "extensive_studies"}, {"score": 0.0036814304184738774, "phrase": "common_scenario"}, {"score": 0.0034109556126786693, "phrase": "new_problem"}, {"score": 0.003055896595255606, "phrase": "approximate_algorithm"}, {"score": 0.003018793951710705, "phrase": "error_guarantees"}, {"score": 0.0029369469007332963, "phrase": "existing_studies"}, {"score": 0.0027293449981640105, "phrase": "potential_consumers"}, {"score": 0.002393317277328894, "phrase": "specific_product"}, {"score": 0.0022860825534337255, "phrase": "influence_maximization_problem"}, {"score": 0.002244543215797895, "phrase": "provable_error_guarantees"}, {"score": 0.002224056824144391, "phrase": "new_problems"}, {"score": 0.0021970315630373493, "phrase": "extensive_experiments"}, {"score": 0.00218364206035443, "phrase": "real_social_networks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Viral marketing", " Interest-Specified", " Dedicated customers"], "paper_abstract": "Viral marketing has attracted considerable concerns in recent years due to its novel idea of leveraging the social network to propagate the awareness of products. Specifically, viral marketing first targets a limited number of users (seeds) in the social network by providing incentives, and these targeted users would then initiate the process of awareness spread by propagating the information to their friends via their social relationships. Extensive studies have been conducted for maximizing the awareness spread given the number of seeds (the Influence Maximization problem). However, all of them fail to consider the common scenario of viral marketing where companies hope to use as few seeds as possible yet influencing at least a certain number of users. In this paper, we propose a new problem, called J-MIN-Seed, whose objective is to minimize the number of seeds while at least J users are influenced. J-MIN-Seed, unfortunately, is NP-hard. Therefore, we develop an approximate algorithm which can provide error guarantees for J-MIN-Seed. We also observe that all existing studies on viral marketing assume that all users in the social network are of interest for the product being promoted (i.e., all users are potential consumers of the product), which, however, is not always true. Motivated by this phenomenon, we propose a new paradigm of viral marketing where the company can specify which types of users in the social network are of interest when promoting a specific product. Under this new paradigm, we re-define our J-MIN-Seed problem as well as the Influence Maximization problem and design some algorithms with provable error guarantees for the new problems. We conducted extensive experiments on real social networks which verified the effectiveness of our algorithms. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Viral marketing for dedicated customers", "paper_id": "WOS:000340318800001"}