{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "two-dimensional_cross_sections"}, {"score": 0.006388832232682225, "phrase": "cross_section"}, {"score": 0.004463958296056236, "phrase": "section_view"}, {"score": 0.004325339932975582, "phrase": "geologic_cross_sections"}, {"score": 0.004099455381916337, "phrase": "single_straight_line"}, {"score": 0.0038730779753083787, "phrase": "individual_lines"}, {"score": 0.0037409118365761894, "phrase": "\"_the_cross_section"}, {"score": 0.003545439507880801, "phrase": "printed_folios"}, {"score": 0.0034136194753440745, "phrase": "gis_data_model"}, {"score": 0.0032763212574036748, "phrase": "data_model"}, {"score": 0.0031644543425642544, "phrase": "esri's_arcgis_software"}, {"score": 0.002887450071878095, "phrase": "arc_hydro_groundwater_data_model"}, {"score": 0.0027712559151232843, "phrase": "hydrogeologic_domain"}, {"score": 0.002719212119462965, "phrase": "xyz_coordinates"}, {"score": 0.002702081704660048, "phrase": "real_world_space"}, {"score": 0.002568856989650259, "phrase": "standard_gis_data"}, {"score": 0.002544616720630384, "phrase": "geologic_interpretations"}, {"score": 0.002473256335879102, "phrase": "real_world"}, {"score": 0.0024421847638964947, "phrase": "three-dimensional_features"}, {"score": 0.002419136901298873, "phrase": "fence_diagrams"}, {"score": 0.0023963138053302553, "phrase": "gis"}, {"score": 0.0023438664524018634, "phrase": "subsurface_environment"}, {"score": 0.0023071120479647325, "phrase": "integrated_views"}, {"score": 0.0022494973475924024, "phrase": "case_study"}, {"score": 0.0022212405935146578, "phrase": "california"}, {"score": 0.0021453112313233554, "phrase": "regional_groundwater_management_plan"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Geographic information systems", " Cross sections", " Subsurface characterization", " Geologic modeling"], "paper_abstract": "While modern Geographic Information Systems (GIS) software is robust in handling maps and data in plan view, the software generally falls short when representing features in section view. Further complicating the issue is the fact that geologic cross sections are often drawn by connecting a series of wells together that do not fall along a single straight line. In this case, the x-axis of the cross section represents the distance along the set of individual lines connecting the series of wells, effectively \"flattening out\" the cross section along this path to create a view of the subsurface with which geologists often work in printed folios. Even 3D-enabled GIS cannot handle this type of cross section. A GIS data model and tools for creating and working with two-dimensional cross sections are presented. The data model and tools create a framework that can be applied using ESRI's ArcGIS software, enabling users to create, edit, manage, and print two-dimensional cross sections from within one of the most well-known GIS software packages. The data model is a component of the arc hydro groundwater data model, which means all two-dimensional cross sections are inherently linked to other features in the hydrogeologic domain, including those represented by xyz coordinates in real world space. Thus, the creation of two-dimensional cross sections can be guided by or completely driven from standard GIS data, and geologic interpretations established on two-dimensional cross sections can be translated back to real world coordinates to create three-dimensional features such as fence diagrams, giving GIS users the capacity to characterize the subsurface environment in a variety of integrated views that was not possible before. A case study for the Sacramento Regional Model in California demonstrates the application of the methodology in support of a regional groundwater management plan. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "GIS-based data model and tools for creating and managing two-dimensional cross sections", "paper_id": "WOS:000300751400005"}