{"auto_keywords": [{"score": 0.03547376413310744, "phrase": "conventional_method"}, {"score": 0.007044331949187935, "phrase": "proposed_method"}, {"score": 0.006420546864589148, "phrase": "sparse_receivers"}, {"score": 0.00481495049065317, "phrase": "ultrasonic_communication"}, {"score": 0.004720043307726269, "phrase": "new_ultrasonic-based_localization_method"}, {"score": 0.0039323878878973284, "phrase": "robot_tracking_system"}, {"score": 0.003803939387792038, "phrase": "moving_robot"}, {"score": 0.003667468902144262, "phrase": "conventional_toa_method"}, {"score": 0.0035831752332801674, "phrase": "different_density"}, {"score": 0.0032757395605609923, "phrase": "position_error"}, {"score": 0.0029452441730331617, "phrase": "total_attempts"}, {"score": 0.002595698433525986, "phrase": "wider_area"}, {"score": 0.0025024660249697408, "phrase": "dynamic_tracking_experiments"}, {"score": 0.002453027723284009, "phrase": "localization_experiments"}, {"score": 0.002310482790486003, "phrase": "localization_accuracy"}, {"score": 0.0022799458141165587, "phrase": "dynamic_tracking"}, {"score": 0.0021617722702730407, "phrase": "systematic_error"}, {"score": 0.0021049977753042253, "phrase": "geometric_relationship"}], "paper_keywords": ["location-aware computing", " localization system", " ultrasound", " robot tracking"], "paper_abstract": "We have introduced a new ultrasonic-based localization method that requires only one ultrasonic receiver to locate transmitters. In our previous reports [1], [2], we conducted several fundamental experiments, and proved the feasibility and accuracy of our system. However the performance in a more realistic environment has not yet been evaluated. In this paper, we have extended our localization system into a robot tracking system, and conducted experiments where the system tracked a moving robot. Localization was executed both by our proposed method and by the conventional TOA method. The experiment was repeated with different density of receivers. Thus we were able to compare the accuracy and the scalability between our proposed method and the conventional method. As a result 90-percentile of the position error was from 6.2 cm to 14.6 cm for the proposed method, from 4.0 cm to 6.1 cm for the conventional method. However our proposed method succeeded in calculating the position of the transmitter in 95% out of total attempts of localization with sparse receivers (4 receivers in about 5 m x 5 m area), whereas the success rate was only 31% for the conventional method. From the result we concluded that although the proposed method is less accurate it can cover a wider area with sparse receivers than the conventional method. In addition to the dynamic tracking experiments, we also conducted some localization experiments where the robot stood still. This was because we wanted to investigate the reason why the localization accuracy degraded in the dynamic tracking. According to the result, the degradation of accuracy might be due to the systematic error in localization which is dependent on the geometric relationship between the transmitter and the receiver.", "paper_title": "A Scalable Tracking System Using Ultrasonic Communication", "paper_id": "WOS:000267640300002"}