{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "database_systems"}, {"score": 0.004358368398332723, "phrase": "decision_making"}, {"score": 0.0038534477978822133, "phrase": "soft_criteria"}, {"score": 0.003698442219929622, "phrase": "whole_fresh_perspective"}, {"score": 0.0034068225125064586, "phrase": "representational_perspective"}, {"score": 0.0033473779327638322, "phrase": "central_question"}, {"score": 0.003119760592916715, "phrase": "database_querying"}, {"score": 0.00304737045343781, "phrase": "computational_perspective"}, {"score": 0.0027741761880779535, "phrase": "database_queries"}, {"score": 0.002646880721119838, "phrase": "systematic_study"}, {"score": 0.0023674192513753996, "phrase": "existing_works"}, {"score": 0.002298902547676131, "phrase": "critical_open_challenges"}], "paper_keywords": ["Algorithms", " Design", " Languages", " Preference modeling", " preference queries"], "paper_abstract": "Preferences have been traditionally studied in philosophy, psychology, and economics and applied to decision making problems. Recently, they have attracted the attention of researchers in other fields, such as databases where they capture soft criteria for queries. Databases bring a whole fresh perspective to the study of preferences, both computational and representational. From a representational perspective, the central question is how we can effectively represent preferences and incorporate them in database querying. From a computational perspective, we can look at how we can efficiently process preferences in the context of database queries. Several approaches have been proposed but a systematic study of these works is missing. The purpose of this survey is to provide a framework for placing existing works in perspective and highlight critical open challenges to serve as a springboard for researchers in database systems. We organize our study around three axes: preference representation, preference composition, and preference query processing.", "paper_title": "A Survey on Representation, Composition and Application of Preferences in Database Systems", "paper_id": "WOS:000294158100005"}