{"auto_keywords": [{"score": 0.032454865078664505, "phrase": "d-mg_tradeoff"}, {"score": 0.00481495049065317, "phrase": "diversity-multiplexing_gain_tradeoff"}, {"score": 0.004709591996429841, "phrase": "zheng"}, {"score": 0.004674971828158548, "phrase": "tse"}, {"score": 0.0045895181082906715, "phrase": "quasi-static_channel"}, {"score": 0.004505638402009237, "phrase": "fundamental_tradeoff"}, {"score": 0.004406994912939125, "phrase": "diversity-multiplexing_gain"}, {"score": 0.00424734451992536, "phrase": "spatial_multiplexing_gain"}, {"score": 0.004200582085706493, "phrase": "diversity_gain"}, {"score": 0.0035184576341236317, "phrase": "time_slots"}, {"score": 0.0029467742734417255, "phrase": "complete_solution"}, {"score": 0.0028715299874549245, "phrase": "d-mg_optimal_st_codes"}, {"score": 0.0027368368719283298, "phrase": "receive_antennas"}, {"score": 0.0026375303198093764, "phrase": "square_minimum-delay_case"}, {"score": 0.002431525473795068, "phrase": "restricted_values"}, {"score": 0.002176235362654451, "phrase": "d-mg-optimal_rectangular_st_codes"}], "paper_keywords": ["cyclic division algebra", " diversity-multiplexing gain tradeoff", " explicit construction", " space-time codes"], "paper_abstract": "A recent result of Zheng and Tse states that over a quasi-static channel, there exists a fundamental tradeoff, referred to as the diversity-multiplexing gain (D-MG) tradeoff, between the spatial multiplexing gain and the diversity gain that can be simultaneously achieved by a space-time (ST) code. This tradeoff is precisely known in the case of independent and identically distributed (i.i.d.) Rayleigh fading, for T >= n(t) + n(r) - 1 where T is the number of time slots over which coding takes place and n(t), n(r) are the number of transmit and receive antennas, respectively. For T < n(t) + n(r) - 1, only upper and lower bounds on the D-MG tradeoff are available. In this paper, we present a complete solution to the problem of explicitly constructing D-MG optimal ST codes, i.e., codes that achieve the D-MG tradeoff for any number of receive antennas. We do this by showing that for the square minimum-delay case when T = n(t) - n, cyclic-division-algebra (CDA)-based ST codes having the nonvanishing determinant property are D-MG optimal. While constructions of such codes were previously known for restricted values of n, we provide here a construction for such codes that is valid for all n. For the rectangular, T > n(t) case, we present two general techniques for building D-MG-optimal rectangular ST codes from their square counterparts. A byproduct of our results establishes that the D-MG tradeoff for all T >= n(t) is the same as that previously known to hold for T >= n(t) + n(r) - 1.", "paper_title": "Explicit space-time codes achieving the diversity-multiplexing gain tradeoff", "paper_id": "WOS:000240076700001"}