{"auto_keywords": [{"score": 0.033272259795436326, "phrase": "custom_goods"}, {"score": 0.010696220174551668, "phrase": "electronic_procurement"}, {"score": 0.00481495049065317, "phrase": "information_technology_shape_supply-chain_structure"}, {"score": 0.00447937340641839, "phrase": "manufacturer's_use"}, {"score": 0.004439097815805505, "phrase": "information_technology"}, {"score": 0.004074016501033133, "phrase": "manufacturer_use"}, {"score": 0.003983016985197904, "phrase": "increasing_use"}, {"score": 0.0037052054802048707, "phrase": "direct_relationship"}, {"score": 0.003557509959237602, "phrase": "aggregate_level"}, {"score": 0.002915701586760994, "phrase": "commodity_goods"}, {"score": 0.0028764048059439205, "phrase": "efficiently_functioning_transparent_market"}, {"score": 0.002675571068567923, "phrase": "opportunistic_vendor_holdup"}, {"score": 0.0025456716198597627, "phrase": "positive_relationship"}, {"score": 0.002400241288973103, "phrase": "deeper_buyer-supplier_system_integration"}, {"score": 0.0021049977753042253, "phrase": "extant_literature"}], "paper_keywords": ["electronic procurement", " information technology", " interfirm coordination", " number of suppliers", " supply-chain structure", " systems integration", " transaction costs economics"], "paper_abstract": "This research investigates the relationship between a manufacturer's use of information technology (IT) (particularly electronic procurement) and the number of suppliers in its supply chain. Will a manufacturer use more or fewer suppliers due to the increasing use of IT? Based on data from a sample of 150 U.S. manufacturers, we find no direct relationship between e-procurement and number of suppliers at the aggregate level. However, when we distinguish the type of goods purchased, we find that the use of electronic procurement is associated with buying from more suppliers for custom goods but from fewer suppliers for standard (or commodity) goods. It is possible that for commodity goods, an efficiently functioning transparent market ensures that a few suppliers are sufficient, whereas for custom goods the need for protection from opportunistic vendor holdup leads to the use of more suppliers. Further, the positive relationship between number of suppliers and electronic procurement for custom goods is negatively moderated by deeper buyer-supplier system integration. This implies that such integration can help buyers obtain better \"fit\" for their customized requirements, an alternative to increasing fit by employing more suppliers as proposed in the extant literature.", "paper_title": "How does information technology shape supply-chain structure? Evidence on the number of suppliers", "paper_id": "WOS:000259784700004"}