{"auto_keywords": [{"score": 0.04855659570735456, "phrase": "cell-centered_lagrangian_scheme"}, {"score": 0.031098289909574556, "phrase": "weak_entropy_condition"}, {"score": 0.004815755408379575, "phrase": "riemann"}, {"score": 0.004555499634179394, "phrase": "new_and_more_general_formula"}, {"score": 0.004329917469944828, "phrase": "maire"}, {"score": 0.004172874316207784, "phrase": "general_one_dimensional_riemann_solvers"}, {"score": 0.0037696519417841287, "phrase": "maire_et_al"}, {"score": 0.0035994372026264478, "phrase": "entropy_discussion"}, {"score": 0.003468796799802612, "phrase": "nodal_solvers"}, {"score": 0.0034052594710793664, "phrase": "old_formula"}, {"score": 0.003118942369691329, "phrase": "numerically_less_dissipative_schemes"}, {"score": 0.003061793572858598, "phrase": "so-called_weak_entropy_condition"}, {"score": 0.002640636493247601, "phrase": "strong_condition"}, {"score": 0.0023198180380964305, "phrase": "smooth_region"}, {"score": 0.0022772782536385717, "phrase": "rarefaction_waves"}, {"score": 0.0021945194903838132, "phrase": "small_velocity_oscillations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Cell-centered Lagrangian scheme", " Nodal Riemann solver", " Strong entropy condition", " Weak entropy condition"], "paper_abstract": "We develop a new and more general formula for the construction of two dimensional nodal Riemann solver for a cell-centered Lagrangian scheme developed by Maire and his co-workers which allows us to use general one dimensional Riemann solvers that have intermediate velocity and pressure in the construction. The old formula for the scheme used in the papers of Maire et al. is only a special case of our new formula. We present an entropy discussion, which indicates that the schemes with nodal solvers constructed following the old formula, which can only use the 1D Riemann solvers satisfying our strong entropy condition, are usually numerically very dissipative. To develop numerically less dissipative schemes we introduce a so-called weak entropy condition, and present a one dimensional Riemann solver that satisfies the weak entropy condition but not the strong entropy condition. Analysis shows that the scheme using this 1D solver is numerically less dissipative than the schemes using solvers satisfying the strong condition. Finally, several numerical examples are presented to show that our new formula works well and the scheme using the one dimensional solver satisfying the weak entropy condition improves the accuracy in smooth region, resolution around rarefaction waves and two dimensional symmetry; however it sometimes produces small velocity oscillations and mesh distortions. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "A two dimensional nodal Riemann solver based on one dimensional Riemann solver for a cell-centered Lagrangian scheme", "paper_id": "WOS:000348756700028"}