{"auto_keywords": [{"score": 0.04911477212520222, "phrase": "electronic_government"}, {"score": 0.00481495049065317, "phrase": "comprehensive_research_work"}, {"score": 0.004420472010542188, "phrase": "systematic_literature_review"}, {"score": 0.0038803710796509227, "phrase": "e-government_initiatives"}, {"score": 0.003680212979775528, "phrase": "comprehensive_analysis"}, {"score": 0.0036503460615862574, "phrase": "relevant_literature"}, {"score": 0.003562186600028245, "phrase": "systematic_review"}, {"score": 0.0034761488481944657, "phrase": "scopus_online_database"}, {"score": 0.003448087140088143, "phrase": "google"}, {"score": 0.003378385493203297, "phrase": "manual_review"}, {"score": 0.00335095982979018, "phrase": "relevant_papers"}, {"score": 0.0032833625797814474, "phrase": "electronic_government_research"}, {"score": 0.003126623133221065, "phrase": "international_journal_of_electronic_government_research"}, {"score": 0.0031012349116334606, "phrase": "ijegr"}, {"score": 0.0030635374056374016, "phrase": "transforming_government"}, {"score": 0.0029053904956617043, "phrase": "overall_review"}, {"score": 0.0028467558213723697, "phrase": "large_number"}, {"score": 0.002529213370528279, "phrase": "empirical_studies"}, {"score": 0.0021483873642607738, "phrase": "e-government_systems"}, {"score": 0.0021049977753042253, "phrase": "implementation_perspective"}], "paper_keywords": ["Costs", " Opportunities", " Benefits", " Risks", " COBRA", " e-government"], "paper_abstract": "After more than a decade of comprehensive research work in the area of electronic government (e-government), no attempt has yet been made to undertake a systematic literature review on the costs, opportunities, benefits and risks that influence the implementation of e-government. This is particularly significant given the various related challenges that governments have faced over the years when implementing e-government initiatives. Hence, the aim of this paper is to undertake a comprehensive analysis of relevant literature addressing these issues using a systematic review of 132 studies identified from the Scopus online database and Google Scholar together with a manual review of relevant papers from journals dedicated to electronic government research such as Electronic Government, an International Journal (EGIJ), International Journal of Electronic Government Research (IJEGR) and Transforming Government: People, Process, and Policy (TGPPP). The overall review indicated that although a large number of papers discuss costs, opportunities, benefits and risks, treatment of these issues have tended to be superficial. Moreover, there is a lack of empirical studies which can statistically evaluate the performance of these constructs in relation to the various e-government systems. Therefore, this research would help governments to better analyse the impact of costs, opportunities, benefits and risks on the success of e-government systems and its pre-adoption from an implementation perspective.", "paper_title": "E-government implementation: A bird's eye view of issues relating to costs, opportunities, benefits and risks", "paper_id": "WOS:000358664600013"}