{"auto_keywords": [{"score": 0.049668773491620556, "phrase": "poly-dispersed_particles"}, {"score": 0.012866172678412224, "phrase": "effective_viscosity"}, {"score": 0.005204929300280473, "phrase": "mono-dispersed_particles"}, {"score": 0.00481495049065317, "phrase": "isotropic_turbulence"}, {"score": 0.004712463245074863, "phrase": "direct_numerical_simulation_technique"}, {"score": 0.004652016085325825, "phrase": "two-way_coupling"}, {"score": 0.004494570360108983, "phrase": "decaying_isotropic_turbulent_flow"}, {"score": 0.0042501163546912815, "phrase": "stokes"}, {"score": 0.003767203575060969, "phrase": "velocity_field"}, {"score": 0.003592859432554987, "phrase": "stokes_number"}, {"score": 0.002822434555587263, "phrase": "poly-dispersed_particle"}, {"score": 0.0027150087516999047, "phrase": "temporal_evolution"}, {"score": 0.0026916956768363158, "phrase": "turbulence_energy"}, {"score": 0.0025449518236394103, "phrase": "energy_spectrum_plot"}, {"score": 0.0024061887405214186, "phrase": "intermediate_scales"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["effective viscosity", " poly-dispersed particles", " multiphase flow", " turbulence modulation", " isotropic turbulence", " DNS"], "paper_abstract": "A direct numerical simulation technique based on two-way coupling is presented to study a particle-laden, decaying isotropic turbulent flow. Physical characteristics of turbulence modulation because of the mono-dispersed (i.e., particles with single Stokes number) and poly-dispersed particles (i.e., particles with more than one Stokes number) were investigated. A scale dependent effective viscosity that summarizes the aspects of the interaction between the velocity field and particles is defined in the study. Particles of Stokes number (St) 3.2,6.4 and 12.8 were used in performing the simulations. Poly-dispersed particles were acquired by mixing particles of two different Stokes numbers at a time. As a whole, decay of turbulence because of the poly-dispersed particles is observed to be larger than that of the decay of turbulence because of the mono-dispersed particles. Simulations of poly-dispersed particle indicate nonlinear characteristics in the modification of the temporal evolution of turbulence energy and dissipation. The scale dependent effective viscosity, which correlates with the energy spectrum plot, indicates that the decay of turbulence is mostly observed at the intermediate scales of turbulence. The effective viscosity for the simulations of the poly-dispersed particles was calculated to be higher than that of the simulations of the mono-dispersed particles. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Direct numerical simulation of modulation of isotropic turbulence by poly-dispersed particles", "paper_id": "WOS:000304800100004"}