{"auto_keywords": [{"score": 0.04982311069638978, "phrase": "healthcare_centers"}, {"score": 0.0432759535595438, "phrase": "minnesota"}, {"score": 0.04047412889904331, "phrase": "mayo_clinic"}, {"score": 0.03447825642244807, "phrase": "positive_predictive_values"}, {"score": 0.03429983812676449, "phrase": "false-negative_rates"}, {"score": 0.00481495049065317, "phrase": "data_fragmentation"}, {"score": 0.0047130539259566465, "phrase": "high-throughput_clinical_phenotyping_algorithm"}, {"score": 0.004189809878977535, "phrase": "population-based_study"}, {"score": 0.004156317513592256, "phrase": "olmsted_county"}, {"score": 0.00405743174437322, "phrase": "provider-linked_electronic_medical_record_data"}, {"score": 0.003918719228049752, "phrase": "county_residents"}, {"score": 0.003876996400581697, "phrase": "olmsted_medical_center"}, {"score": 0.003835717798582518, "phrase": "rochester"}, {"score": 0.0036357909244344486, "phrase": "dm-relevant_data"}, {"score": 0.0035970695725014218, "phrase": "laboratory_results"}, {"score": 0.00319732428387928, "phrase": "mcnemar_test"}, {"score": 0.003071429173571846, "phrase": "gold_standard"}, {"score": 0.0030063184802762775, "phrase": "true-positive_and_false-negative_subjects"}, {"score": 0.0028879224619717714, "phrase": "medical_centers"}, {"score": 0.0027667539384678814, "phrase": "single-center_data"}, {"score": 0.0023558375480288297, "phrase": "non-dm_subjects"}, {"score": 0.002330715875181641, "phrase": "sex_distribution"}, {"score": 0.002250901645363754, "phrase": "htcp"}, {"score": 0.0021049977753042253, "phrase": "htcp_algorithms"}], "paper_keywords": [""], "paper_abstract": "Objective To evaluate data fragmentation across healthcare centers with regard to the accuracy of a high-throughput clinical phenotyping (HTCP) algorithm developed to differentiate (1) patients with type 2 diabetes mellitus (T2DM) and (2) patients with no diabetes. Materials and methods This population-based study identified all Olmsted County, Minnesota residents in 2007. We used provider-linked electronic medical record data from the two healthcare centers that provide >95% of all care to County residents (ie, Olmsted Medical Center and Mayo Clinic in Rochester, Minnesota, USA). Subjects were limited to residents with one or more encounter January 1, 2006 through December 31, 2007 at both healthcare centers. DM-relevant data on diagnoses, laboratory results, and medication from both centers were obtained during this period. The algorithm was first executed using data from both centers (ie, the gold standard) and then from Mayo Clinic alone. Positive predictive values and false-negative rates were calculated, and the McNemar test was used to compare categorization when data from the Mayo Clinic alone were used with the gold standard. Age and sex were compared between true-positive and false-negative subjects with T2DM. Statistical significance was accepted as p < 0.05. Results With data from both medical centers, 765 subjects with T2DM (4256 non-DM subjects) were identified. When single-center data were used, 252 T2DM subjects (1573 non-DM subjects) were missed; an additional false-positive 27 T2DM subjects (215 non-DM subjects) were identified. The positive predictive values and false-negative rates were 95.0% (513/540) and 32.9% (252/765), respectively, for T2DM subjects and 92.6% (2683/2898) and 37.0% (1573/4256), respectively, for non-DM subjects. Age and sex distribution differed between true-positive (mean age 62.1; 45% female) and false-negative (mean age 65.0; 56.0% female) T2DM subjects. Conclusion The findings show that application of an HTCP algorithm using data from a single medical center contributes to misclassification. These findings should be considered carefully by researchers when developing and executing HTCP algorithms.", "paper_title": "Impact of data fragmentation across healthcare centers on the accuracy of a high-throughput clinical phenotyping algorithm for specifying subjects with type 2 diabetes mellitus", "paper_id": "WOS:000300768100015"}