{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "india"}, {"score": 0.013346511832385971, "phrase": "vendor_organizations"}, {"score": 0.004473982381245469, "phrase": "information_technology"}, {"score": 0.0037690117137411743, "phrase": "western"}, {"score": 0.003501846136829077, "phrase": "longstanding_imbalances"}, {"score": 0.003334438963962734, "phrase": "west"}, {"score": 0.0032736728077735508, "phrase": "east"}, {"score": 0.0030601162942933665, "phrase": "empirical_work"}, {"score": 0.0029677378488677983, "phrase": "information_systems"}, {"score": 0.002791239714439304, "phrase": "postcolonial_theory"}, {"score": 0.0024389277933858054, "phrase": "western_client_organizations"}, {"score": 0.0023507916951658455, "phrase": "postcolonial_reading"}, {"score": 0.0022519745140925475, "phrase": "important_new_dimension"}], "paper_keywords": ["critical research", " IT offshoring", " postcolonial theory", " India", " ethnography"], "paper_abstract": "In recent years India has become the information technology (IT) offshoring destination of choice for many Western organizations. From the perspective of vendor organizations in India, however, the IT offshoring phenomenon is more than just a business relationship with Western firms. It is also embedded within the context of the longstanding imbalances of power in the relationship between the West and the East, the implications of which have been largely ignored in empirical work on offshoring within the information systems (IS) discipline. Drawing on concepts from postcolonial theory and using data from our ethnographic fieldwork, we explore the experiences and responses of one Indian vendor organization to asymmetries of power in its relationship with Western client organizations. Our analysis demonstrates how a postcolonial reading and interpretation of IT offshoring adds an important new dimension to previous IS research and also helps to develop a more comprehensive understanding of the strategies deployed by vendor organizations.", "paper_title": "Information technology offshoring in India: a postcolonial perspective", "paper_id": "WOS:000320108300002"}