{"auto_keywords": [{"score": 0.04958720442967608, "phrase": "sparse_modeling"}, {"score": 0.02835312775425899, "phrase": "regularization_parameter"}, {"score": 0.00481495049065317, "phrase": "optimal_sparse_regularization"}, {"score": 0.004620093797504386, "phrase": "outlier_type_noise"}, {"score": 0.004525629293824217, "phrase": "sparse_recovery_theory"}, {"score": 0.0038959121068990517, "phrase": "under-determined_problems"}, {"score": 0.003680587852807675, "phrase": "added_sparsity_assumption"}, {"score": 0.0029620573986902416, "phrase": "overdetermined_signal_recovery_problems"}, {"score": 0.0028567126120064546, "phrase": "convex_variational_formulation"}, {"score": 0.002755104031926742, "phrase": "general_random_matrices"}, {"score": 0.002445950676329976, "phrase": "multi-image_processing"}, {"score": 0.0022053994402287925, "phrase": "sparsity_assumption"}, {"score": 0.0021049977753042253, "phrase": "signal_jumps"}], "paper_keywords": ["Multi-image processing", " Super-resolution", " Outliers", " Sparse signal", " Regularization parameter"], "paper_abstract": "Sparse modeling can be used to characterize outlier type noise. Thanks to sparse recovery theory, it was shown that 1-norm super-resolution is robust to outliers if enough images are captured. Moreover, sparse modeling of signals is a way to overcome ill-posedness of under-determined problems. This naturally leads to this question: does an added sparsity assumption on the signal improve the robustness to outliers of the 1-norm super-resolution, and if yes, how strong should this assumption be? In this article, we review and extend results of the literature to the robustness to outliers of overdetermined signal recovery problems under sparse regularization, with a convex variational formulation. We then apply them to general random matrices, and show how the regularization parameter acts on the robustness to outliers. Finally, we show that in the case of multi-image processing, the structure of the support of signal and noise must be studied precisely. We show that the sparsity assumption improves robustness if outliers do not overlap with signal jumps, and determine how the regularization parameter can be chosen.", "paper_title": "Robust Multi-image Processing with Optimal Sparse Regularization", "paper_id": "WOS:000351540200006"}