{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sentient_multimedia_systems"}, {"score": 0.008470493236797284, "phrase": "maieuta_designer"}, {"score": 0.004775918707955445, "phrase": "user_diversity"}, {"score": 0.004331393784852601, "phrase": "end-user_development"}, {"score": 0.0039280803011236395, "phrase": "software_professionals"}, {"score": 0.0034060348526709634, "phrase": "multiple_sensors"}, {"score": 0.003378385493203297, "phrase": "multiple_human_actors"}, {"score": 0.0027441711627551064, "phrase": "eud_features"}, {"score": 0.002539550974361945, "phrase": "\"social_counter-part"}, {"score": 0.0022196745041124888, "phrase": "proper_ways"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["End-user development", " Cultures of participation", " Co-evolution", " Metadesigner", " Maieuta designer"], "paper_abstract": "User diversity and co-evolution of users and systems are two important phenomena usually observed in the design and use of IT artifacts. In recent years, End-User Development (EUD) has been proposed to take into account these phenomena, by providing mechanisms that support people, who are not software professionals, to modify, adapt, and even create IT artifacts according to their specific evolving needs. This is particularly true in the case of sentient multimedia systems, in which the system is called on to interact with multiple sensors and multiple human actors. However, to motivate and sustain these people, a culture of participation is necessary, as well as proper metadesign activities that may promote and maintain it. To this aim, this article first proposes a model for describing interaction and co-evolution in sentient multimedia systems enhanced by EUD features. Then it presents four main roles involved in interaction and co-evolution, including that of maieuta designer, as the \"social counter-part\" of the metadesigner. Finally, it describes how the maieuta designer is in charge of carrying out all those activities that are necessary to cultivate a culture of participation, by means of proper ways that are briefly introduced in the article. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Fostering participation and co-evolution in sentient multimedia systems", "paper_id": "WOS:000346818000008"}