{"auto_keywords": [{"score": 0.04922082634695279, "phrase": "incomplete_decision_table"}, {"score": 0.02819827616624647, "phrase": "decision_performance"}, {"score": 0.006184645181326565, "phrase": "incomplete_decision_tables"}, {"score": 0.004588158931776543, "phrase": "approximation_accuracy"}, {"score": 0.004533142516832776, "phrase": "consistency_degree"}, {"score": 0.0038054151244558123, "phrase": "elaborate_depictions"}, {"score": 0.002796616969627065, "phrase": "condition_granulation"}, {"score": 0.0027630232270330402, "phrase": "decision_granulation"}, {"score": 0.002616762777413686, "phrase": "experimental_analyses"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["incomplete decision tables", " decision rules", " information granulation", " decision evaluation"], "paper_abstract": "As two classical measures, approximation accuracy and consistency degree can be extended for evaluating the decision performance of an incomplete decision table. However, when the values of these two measures are equal to zero, they cannot give elaborate depictions of the certainty and consistency of an incomplete decision table. To overcome this shortcoming, we first classify incomplete decision tables into three types according to their consistency and introduce four new measures for evaluating the decision performance of a decision-rule set extracted from an incomplete decision table. We then analyze how each of these four measures depends on the condition granulation and decision granulation of each of the three types of incomplete decision tables. Experimental analyses on three practical data sets show that the four new measures appear to be well suited for evaluating the decision performance of a decision-rule set extracted from an incomplete decision table and are much better than the two extended measures. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "On the evaluation of the decision performance of an incomplete decision table", "paper_id": "WOS:000256216000001"}