{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "general_topology"}, {"score": 0.0039449104968131655, "phrase": "symmetric_eigenmatrix"}, {"score": 0.0038534477978822133, "phrase": "orthogonal_eigenparameter"}, {"score": 0.0036553070575015344, "phrase": "left_eigenvector"}, {"score": 0.003591542373891629, "phrase": "coupling_matrix"}, {"score": 0.003138124398958758, "phrase": "underlying_swarm"}, {"score": 0.00270978310478061, "phrase": "finite_time"}, {"score": 0.002646880721119838, "phrase": "open_space"}, {"score": 0.002409503258044183, "phrase": "swarm_boundary"}, {"score": 0.002381365139274329, "phrase": "convergence_rate"}, {"score": 0.002206290313627494, "phrase": "quantitative_relationship"}, {"score": 0.0021677478798910565, "phrase": "swarming_behavior"}, {"score": 0.0021049977753042253, "phrase": "coupling_topology"}], "paper_keywords": ["eigenstructure", " multi-agent", " stability", " swarm boundary"], "paper_abstract": "This paper investigates the stability and boundary of a swarm with a general directed and weighted topology. The stability of a swarm is generally considered as cohesiveness. We construct a symmetric eigenmatrix and define an orthogonal eigenparameter which reflects the degree of orthogonality between the left eigenvector of the coupling matrix corresponding to its zero eigenvalue and the eigenvectors of the eigenmatrix corresponding to its nonzero eigenvalues. We prove that, if the topology of the underlying swarm is strongly connected, the swarm is then stable in the sense that all agents will globally and exponentially converge to a hyperellipsoid in finite time, both in open space and profiles, whether the center of the hyperellipsoid is moving or not. The swarm boundary and convergence rate are characterized by the eigenparameters of the swarm, which reveals the quantitative relationship between the swarming behavior and characteristics of the coupling topology.", "paper_title": "Stability analysis of swarms with general topology", "paper_id": "WOS:000258183100026"}