{"auto_keywords": [{"score": 0.03567773696476283, "phrase": "interface_signs"}, {"score": 0.011604777550963024, "phrase": "side_framework"}, {"score": 0.00481495049065317, "phrase": "semiotic_framework"}, {"score": 0.004732215871738028, "phrase": "user-intuitive_web_interface_signs"}, {"score": 0.004191377834552202, "phrase": "user-intuitive_interface_signs"}, {"score": 0.004048483412089098, "phrase": "small_images"}, {"score": 0.0036694287631595995, "phrase": "web_uis"}, {"score": 0.0028944757265206332, "phrase": "problem-solving_assignments"}, {"score": 0.0025336179740814905, "phrase": "acceptable_score"}, {"score": 0.0025044454602720597, "phrase": "quality_metrics"}, {"score": 0.0021049977753042253, "phrase": "intuitive_nature"}], "paper_keywords": ["Human-computer interaction", " User interface design", " Usability evaluation", " Ontology and semiotics"], "paper_abstract": "A semiotic framework [Semiotic Interface sign Design and Evaluation (SIDE)] was developed to help designers to deal with user-intuitive interface signs. Examples of signs are small images, navigational links, buttons and thumbnails, which users make use of when interacting with Web UIs. This paper assesses the SIDE framework on the quality of the evaluation of interface signs, and the contributions of the framework as perceived by evaluators. Two empirical user studies were carried out, involving 23 participants. Data were collected via interviews, problem-solving assignments and feedback questionnaires, and analyzed quantitatively and qualitatively. The study shows that the evaluation of using the SIDE framework leads to acceptable score on quality metrics; and the subjects evaluate the framework's ease-of-use, contribution, and usage in practice positively. The SIDE framework is applicable to design and evaluate interface signs and contributes to the improvement in understanding the intuitive nature of interface signs.", "paper_title": "An assessment of a semiotic framework for evaluating user-intuitive Web interface signs", "paper_id": "WOS:000361003800008"}