{"auto_keywords": [{"score": 0.03614320372694827, "phrase": "proposed_model"}, {"score": 0.008562518225880632, "phrase": "historical_data"}, {"score": 0.0081419870687508, "phrase": "ann"}, {"score": 0.00481495049065317, "phrase": "increasing_population"}, {"score": 0.004777569299319633, "phrase": "growing_technological_activities"}, {"score": 0.004612896435506914, "phrase": "main_energy_providers"}, {"score": 0.0043509032299218955, "phrase": "efficient_utilization"}, {"score": 0.004317109072311102, "phrase": "renewable_energy_sources"}, {"score": 0.0037516215763875225, "phrase": "wind_power_generation"}, {"score": 0.0034029588672379926, "phrase": "weather_events"}, {"score": 0.003234615195382533, "phrase": "power_forecasts"}, {"score": 0.00300339527261653, "phrase": "wind_power_monitoring_and_forecast_system"}, {"score": 0.0029800493998413382, "phrase": "turkey"}, {"score": 0.002821516317503421, "phrase": "well-known_statistical_models"}, {"score": 0.0026299995767138304, "phrase": "lesser_amount"}, {"score": 0.0025690867646665835, "phrase": "mathematical_model"}, {"score": 0.002499798127196099, "phrase": "artificial_neural_networks"}, {"score": 0.0024514505056251316, "phrase": "support_vector_machine"}, {"score": 0.002376027109070317, "phrase": "reliable_forecast"}, {"score": 0.002339261379634781, "phrase": "svm"}, {"score": 0.0022407927161620855, "phrase": "proposed_shwip_method's_results"}, {"score": 0.002154930852763048, "phrase": "important_feature"}, {"score": 0.0021049977753042253, "phrase": "newly_established_wind_power_plants"}], "paper_keywords": ["Data Mining", " dynamic clustering", " K-means", " numerical weather prediction", " wind power forecasting"], "paper_abstract": "As the result of increasing population and growing technological activities, nonrenewable energy sources, which are the main energy providers, are diminishing day by day. Due to this factor, efforts on efficient utilization of renewable energy sources have increased all over the world. Wind is one of the most significant alternative energy resources. However, in comparison with other renewable energy sources, it is so variable that there is a need for estimating and planning of wind power generation. In this paper, a new statistical short-term (up to 48 h) wind power forecast model, namely statistical hybrid wind power forecast technique (SHWIP), is presented. In the proposed model, weather events are clustered with respect to the most important weather forecast parameters. It also combines the power forecasts obtained from three different numerical weather prediction (NWP) sources and produces a hybridized final forecast. The proposed model has been in operation at the Wind Power Monitoring and Forecast System for Turkey (RITM), and the results of the newmodel are compared with well-known statistical models and physical models in the literature. The most important characteristics of the proposed model is the need for a lesser amount of historical data while constructing the mathematical model compared with the other statistical models such as artificial neural networks (ANN) and support vector machine (SVM). To produce a reliable forecast, ANN and SVM need at least 1 year of historical data; on the other hand, the proposed SHWIP method's results are applicable even under 1 month of training data, and this is an important feature for the forecast of the newly established wind power plants (WPPs).", "paper_title": "A Novel Wind Power Forecast Model: Statistical Hybrid Wind Power Forecast Technique (SHWIP)", "paper_id": "WOS:000352290400008"}