{"auto_keywords": [{"score": 0.004712988631183401, "phrase": "biochemical_pathway"}, {"score": 0.0045543011700929096, "phrase": "chemical_reactions"}, {"score": 0.004074397977869244, "phrase": "computational_methods"}, {"score": 0.00385368199735867, "phrase": "biochemical_process"}, {"score": 0.0034919649825540396, "phrase": "simple_strategy"}, {"score": 0.003218823621926739, "phrase": "metal_ions"}, {"score": 0.00319134078848996, "phrase": "metal-binding_cofactors"}, {"score": 0.0030705342386533083, "phrase": "bioinformatics_package"}, {"score": 0.003044313656896057, "phrase": "retrieval_of_domains"}, {"score": 0.0028302635493019867, "phrase": "rdgb"}, {"score": 0.0026882700311968025, "phrase": "aforementioned_strategy"}, {"score": 0.002665305036900055, "phrase": "minimal_intervention"}, {"score": 0.002575385171755899, "phrase": "ordered_manner"}, {"score": 0.0025315664299815537, "phrase": "tabular_summary"}, {"score": 0.002264321283759897, "phrase": "organic_compounds"}], "paper_keywords": [""], "paper_abstract": "A biochemical pathway can be viewed as a series of chemical reactions occurring within a cell, each of which is :)' carried out by one or more biological macromolecules (protein, RNA, or complexes thereof). Computational methods can be applied to assess whether one organism is able to perform a biochemical process of interest by checking whether its genome encodes all the components that are known to be necessary for the task. Here we present a simple strategy for collecting the above data that is based on, but not limited to, our experience on processes involving metal ions and metal-binding cofactors. The strategy is fully implemented in a bioinformatics package, Retrieval of Domains and Genome Browsing (RDGB), which is available from http://www.cerm.unifi.it/home/research/genomebrowsing.html. The use of RDGB allows users to perform all the operations that are needed to implement the aforementioned strategy with minimal intervention and to gather all results in an ordered manner, with a tabular summary. This minimizes the (bio)informatics needed, thus facilitating its use by nonexperts. As examples, we analyzed the pathways for the degradation of organic compounds containing one or two aromatic rings as well as the distribution of some proteins involved in Cu(A) assembly in more than a thousand prokaryotes.", "paper_title": "A Simple Protocol for the Comparative Analysis of the Structure and Occurrence of Biochemical Pathways Across Superkingdoms", "paper_id": "WOS:000288738000019"}