{"auto_keywords": [{"score": 0.0305135299280402, "phrase": "svg"}, {"score": 0.013954663906276065, "phrase": "proprietary_systems"}, {"score": 0.011437249542827353, "phrase": "gi_data"}, {"score": 0.00481495049065317, "phrase": "open_architecture"}, {"score": 0.004681653551412616, "phrase": "open_source_software_tools"}, {"score": 0.004217925382695912, "phrase": "open_architectures"}, {"score": 0.004101088357088207, "phrase": "web-oriented_systems"}, {"score": 0.003955593694633168, "phrase": "ogc"}, {"score": 0.0038614646772981848, "phrase": "open_gis_architecture"}, {"score": 0.0036504182609411852, "phrase": "open_source_components"}, {"score": 0.003368707839819003, "phrase": "monolithic_systems"}, {"score": 0.0032621876512517398, "phrase": "loose_coupling"}, {"score": 0.003171740347925348, "phrase": "data_stores"}, {"score": 0.0029034358982402346, "phrase": "scalable_vector_graphics"}, {"score": 0.002668470532683947, "phrase": "effective_means"}, {"score": 0.0024822279007111255, "phrase": "gis-specific_client_tools"}, {"score": 0.0024036710362692042, "phrase": "web_browser"}, {"score": 0.0023653276631862958, "phrase": "svg_pages"}, {"score": 0.002182573128803447, "phrase": "powerful_solution"}, {"score": 0.002156402793481102, "phrase": "enormous_future_potential"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["open architecture", " SVG", " web GIS", " JavaScript", " web interface"], "paper_abstract": "A range of open source software tools are now available to the Geographical Information Systems (GIs) analyst. However these tools are not necessarily interoperable and rarely significantly interoperable with proprietary systems. The open architectures, which have been developed for web-oriented systems, together with those proposed by the Open Geospatial Consortium (OGC), suggest that an open GIs architecture could be developed as an alternative to proprietary systems. The architecture would use open source components to store, translate, analyse, render and visualise GI data and would escape many of the problems of monolithic systems. Particularly what is proposed permits the loose coupling of any number of components and data stores in a manner that is both open and flexible. This paper proposes such an architecture and focuses on determining the suitability of Scalable Vector Graphics (SVG), an open vector-oriented eXtensible Markup Language (XML) grammar, as a significant component of such architecture. SVG is shown as an effective means of rendering GI data, not least because of its compatibility with the WC3 Document Object Model (DOM), permitting GIS-specific client tools to be written and transmitted to the web browser along with the SVG pages. While realising that the technology is in its infancy, the conclusion reached is that SVG currently provides a powerful solution and has enormous future potential. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Towards an open architecture for vector GIS", "paper_id": "WOS:000240857800016"}