{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "structural_layering"}, {"score": 0.041562269310917936, "phrase": "small_set"}, {"score": 0.0047761092701293474, "phrase": "highly_detailed_natural_scenes"}, {"score": 0.004549524321051407, "phrase": "repeated_parts"}, {"score": 0.00436890075128947, "phrase": "noticeable_repeated_elements"}, {"score": 0.004012500850311087, "phrase": "additional_similar_instances"}, {"score": 0.003884479830773329, "phrase": "small_number"}, {"score": 0.00374531366198605, "phrase": "detailed_structural_texture"}, {"score": 0.003640516896245813, "phrase": "statistical_methods"}, {"score": 0.003289534854212415, "phrase": "rich_variation"}, {"score": 0.0032629585038738856, "phrase": "highly_detailed_realistic_leaves"}, {"score": 0.0029965060407413898, "phrase": "single_training_leaf_exemplar"}, {"score": 0.002936331371903168, "phrase": "structural_layers"}, {"score": 0.0024963543716522087, "phrase": "novel_leaf_structural_texture"}, {"score": 0.002406799309495983, "phrase": "slightly_modified_layers"}, {"score": 0.0023016843709107297, "phrase": "large_set"}, {"score": 0.0022830706430588482, "phrase": "differently_looking_leaves"}, {"score": 0.002246292543825748, "phrase": "numerous_results"}, {"score": 0.0022281257694320433, "phrase": "realistically_looking_leaves"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Generating variations", " Texture synthesis", " Image generation"], "paper_abstract": "Highly detailed natural scenes and objects tend to be perceived as being realistic, while repeated parts and patterns decrease their realism. To avoid scenes with noticeable repeated elements, we introduce the notion of 'more of the same', which focuses on the task of generating additional similar instances from a small set of exemplars. The small number of exemplars, as well as their diversity and detailed structural texture, makes it difficult to apply statistical methods, or other machine learning tools, and thus more specialized tools need to be used. In this paper, we focus on generating a rich variation of highly detailed realistic leaves from just a handful set of examples. The method that we present does use only minimal domain specific knowledge and requires only minimal user assistance applied on a single training leaf exemplar to extract and separate structural layers. The knowledge from one leaf is then transferred to the other exemplars by a novel color/spatial layer inducing algorithm. The premise of structural layering is that each set of layers is simple enough to be synthesized separately and then composed into a novel leaf structural texture. This composition also allows the synthesis of slightly modified layers from the set of examples, which can generate a large set of differently looking leaves. We demonstrate numerous results of realistically looking leaves produced by our method from a small set of leaves. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "More of the same: Synthesizing a variety by structural layering", "paper_id": "WOS:000303695300006"}