{"auto_keywords": [{"score": 0.0465604823844301, "phrase": "basis_matrices"}, {"score": 0.007399266758345959, "phrase": "thousand_yen"}, {"score": 0.005890197034565627, "phrase": "k_matrices"}, {"score": 0.00440976345264104, "phrase": "visual_secret_sharing_schemes"}, {"score": 0.0038989120088094185, "phrase": "arbitrary_integers"}, {"score": 0.003698442219929622, "phrase": "bounded_semilattice"}, {"score": 0.0034068225125064586, "phrase": "n_shares"}, {"score": 0.0033473779327638322, "phrase": "secret_image"}, {"score": 0.0033083236588614174, "phrase": "k_colors"}, {"score": 0.0028069426877159642, "phrase": "homogeneous_polynomial"}, {"score": 0.0027741761880779535, "phrase": "degree_n."}, {"score": 0.002570296816631395, "phrase": "homogeneous_polynomials"}, {"score": 0.0024379730432321656, "phrase": "algebraic_scheme"}, {"score": 0.002206290313627494, "phrase": "k_basis_matrices"}, {"score": 0.0021049977753042253, "phrase": "simple_algebraic_operations"}], "paper_keywords": ["Visual cryptography", " Visual secret sharing", " Threshold scheme", " Contrast"], "paper_abstract": "This paper is concerned with the construction of basis matrices of visual secret sharing schemes for color images under the (t, n)-threshold access structure, where n a parts per thousand yen t a parts per thousand yen 2 are arbitrary integers. We treat colors as elements of a bounded semilattice and regard stacking two colors as the join of the two corresponding elements. We generate n shares from a secret image with K colors by using K matrices called basis matrices. The basis matrices considered in this paper belong to a class of matrices each element of which is represented by a homogeneous polynomial of degree n. We first clarify a condition such that the K matrices corresponding to K homogeneous polynomials become basis matrices. Next, we give an algebraic scheme for the construction of basis matrices. It is shown that under the (t, n)-threshold access structure we can obtain K basis matrices from appropriately chosen K - 1 homogeneous polynomials of degree n by using simple algebraic operations. In particular, we give basis matrices that are unknown so far for the cases of t = 2, 3 and n - 1.", "paper_title": "A general method for construction of (t, n)-threshold visual secret sharing schemes for color images", "paper_id": "WOS:000294071700008"}