{"auto_keywords": [{"score": 0.004748371393578422, "phrase": "geospatial_information"}, {"score": 0.00428733103049275, "phrase": "content-specific_metadata"}, {"score": 0.0036271080216837286, "phrase": "different_types"}, {"score": 0.0035273744062641636, "phrase": "street_maps"}, {"score": 0.0034947408949397127, "phrase": "contour_maps"}, {"score": 0.003259929077035673, "phrase": "pdf"}, {"score": 0.0031113369425402287, "phrase": "automatic_method"}, {"score": 0.003068242064611088, "phrase": "high-quality_maps"}, {"score": 0.0025121156016001886, "phrase": "defining_characteristics"}, {"score": 0.002236272403824371, "phrase": "highly_scalable_and_accurate_way"}], "paper_keywords": ["Map identification", " K-nearest neighbor classifier", " Water-filling features", " Content-Based Image Retrieval (CBIR)", " PDF documents"], "paper_abstract": "Maps are one of the most valuable documents for gathering geospatial information about a region. Yet, finding a collection of diverse, high-quality maps is a significant challenge because there is a dearth of content-specific metadata available to identify them from among other images on the Web. For this reason, it is desirous to analyze the content of each image. The problem is further complicated by the variations between different types of maps, such as street maps and contour maps, and also by the fact that many high-quality maps are embedded within other documents such as PDF reports. In this paper, we present an automatic method to find high-quality maps for a given geographic region. Not only does our method find documents that are maps, but also those that are embedded within other documents. We have developed a Content-Based Image Retrieval (CBIR) approach that uses a new set of features for classification in order to capture the defining characteristics of a map. This approach is able to identify all types of maps irrespective of their subject, scale, and color in a highly scalable and accurate way. Our classifier achieves an F1-measure of 74%, which is an 18% improvement over the previous work in the area.", "paper_title": "Harvesting maps on the web", "paper_id": "WOS:000297247700004"}