{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wu-mendel_uncertainty_bounds"}, {"score": 0.004664352260912174, "phrase": "viable_inference_engine"}, {"score": 0.004278807087784626, "phrase": "complex_structure"}, {"score": 0.004015182362035361, "phrase": "wm_ub"}, {"score": 0.0035194572615570977, "phrase": "simplified_version"}, {"score": 0.0032282396745967504, "phrase": "rigorous_analyses"}, {"score": 0.0030429511467945525, "phrase": "great_promise"}, {"score": 0.0025137856138000014, "phrase": "wm_ub."}, {"score": 0.0024129269611844794, "phrase": "design_parameters"}, {"score": 0.002153450937601075, "phrase": "wider_applications"}, {"score": 0.0021049977753042253, "phrase": "simplified_m"}], "paper_keywords": ["Interval type-2 fuzzy control", " interval type-2 fuzzy logic systems", " m-n interval type-2 fuzzy logic system", " simplified interval type-2 fuzzy logic system", " Wu-Mendel uncertainty bounds"], "paper_abstract": "Wu-Mendel Uncertainty Bounds (WM UB) is a viable inference engine for interval type-2 fuzzy logic systems (IT2 FLS). This engine; however, has a complex structure and hence performing analysis using this mechanism is difficult. Moreover, when WM UB is used for control, one cannot guarantee stability. As such, a new IT2 FLS, called an m-n IT2 FLS, that is a simplified version of the WM UB IT2 FLS, has been recently introduced in the literature. The m-n IT2 FLS has enabled rigorous analyses of IT2 fuzzy controllers, has recently been used in several applications and has shown great promise to be used as a viable IT2 FLS that is not limited just to control. In this paper, we mathematically analyze the structure of the m-n IT2 FLS and through bounds approach find the conditions upon which the m-n IT2 FLS gets close to the WM UB. These conditions will also provide guidelines for the design parameters of the m-n IT2 FLS that will ultimately help designers to choose these parameters for their applications. The results presented in this paper should lead to wider applications of the novel and simplified m-n IT2 FLS.", "paper_title": "On the justification to use a novel simplified interval type-2 fuzzy logic system", "paper_id": "WOS:000349834500008"}