{"auto_keywords": [{"score": 0.04832242519222614, "phrase": "physical_network"}, {"score": 0.042881944239451034, "phrase": "intra-neighbor_relationships"}, {"score": 0.00481495049065317, "phrase": "challenging_problems"}, {"score": 0.004524220016675624, "phrase": "overlay_structure"}, {"score": 0.004233347974930148, "phrase": "inflexible_overlay_structures"}, {"score": 0.004010785080336424, "phrase": "logical_identifiers"}, {"score": 0.0038157022294338454, "phrase": "physical_proximity"}, {"score": 0.0029981559422442693, "phrase": "physical_intra-neighbor_relationship"}, {"score": 0.002816814445002924, "phrase": "proposed_protocol"}, {"score": 0.0027473784878300133, "phrase": "distributed_algorithm"}, {"score": 0.002657445352746803, "phrase": "consecutive_logical_identifier"}, {"score": 0.0024759682272230735, "phrase": "destination_peer"}, {"score": 0.0023948981440134478, "phrase": "simulation_results"}, {"score": 0.002259346051668556, "phrase": "average_file-discovery_delay"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["P2P overlays", " Distributed Hash Tables", " MANETs", " Distributed systems", " 3D", " Content sharing"], "paper_abstract": "We study the challenging problems of the mismatch between the overlay and the physical network and the resilience of the overlay structure in peer-to-peer (P2P) protocols over a mobile ad hoc network (MANET). Existing P2P protocols have used inflexible overlay structures to arrange peers and do not consider intra-neighbor relationships of peers when assigning logical identifiers. The intra-neighbor relationships of peers are crucial to exactly interpret the physical proximity of peers in an overlay and to avoid the mismatch between the overlay and the physical network that causes extensive routing overhead, larger average file discovery delay, increased false-negative ratio, and high average path-stretch. In this paper, we present a novel P2P overlay over MANETs that exploits a 3-dimensional overlay and 3D space that takes into account the physical intra-neighbor relationship of a peer and exploits a 3D-overlay to interpret that relationship. In the proposed protocol, each peer runs a distributed algorithm that exploits a 3D-overlay to calculate a consecutive logical identifier to a peer. Moreover, the protocol utilizes the 3D-overlay to maintain multi-paths to a destination peer that provides resilience against a node/link failure. Simulation results show that the proposed 3D-overlay outperforms the existing P2P overlay protocol in terms of routing overhead, average file-discovery delay, false-negative ratio, and average path-stretch. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "3D P2P overlay over MANETs", "paper_id": "WOS:000335610700007"}