{"auto_keywords": [{"score": 0.04384051001297618, "phrase": "intuitionistic_fuzzy_ideal_point"}, {"score": 0.04322873010093233, "phrase": "interval-valued_intuitionistic_fuzzy_ideal_point"}, {"score": 0.014835798366928568, "phrase": "intuitionistic_fuzzy_numbers"}, {"score": 0.014622579801221471, "phrase": "interval-valued_intuitionistic_fuzzy_numbers"}, {"score": 0.011936406685166007, "phrase": "included_angle"}, {"score": 0.011679258228743787, "phrase": "attribute_value_vectors"}, {"score": 0.00481495049065317, "phrase": "intuitionistic_fuzzy_multiple_attribute_decision-making_problems"}, {"score": 0.00284275228258112, "phrase": "similarity_degrees"}, {"score": 0.0021518035978153878, "phrase": "developed_projection_models"}, {"score": 0.0021049977753042253, "phrase": "numerical_example"}], "paper_keywords": ["Intuitionistic fuzzy multiple attribute decision making", " intuitionistic fuzzy ideal point", " interval-valued intuitionistic fuzzy ideal point", " projection model", " included angle"], "paper_abstract": "The aim of this paper is to investigate the intuitionistic fuzzy multiple attribute decision-making problems where the attribute values are expressed in intuitionistic fuzzy numbers or interval-valued intuitionistic fuzzy numbers. We introduce some notions, such as intuitionistic fuzzy ideal point, interval-valued intuitionistic fuzzy ideal point, the modules of intuitionistic fuzzy numbers, and interval-valued intuitionistic fuzzy numbers. We also introduce the cosine of the included angle between the attribute value vectors of each alternative and the intuitionistic fuzzy ideal point, and the cosine of the included angle between the attribute value vectors of each alternative and the interval-valued intuitionistic fuzzy ideal point. Then we establish two projection models to measure the similarity degrees between each alternative and the intuitionistic fuzzy ideal point, and between each alternative and the interval-valued intuitionistic fuzzy ideal point. Based on the projection models, we can rank the given alternatives and then select the most desirable one. Finally, we illustrate the developed projection models with a numerical example.", "paper_title": "PROJECTION MODELS FOR INTUITIONISTIC FUZZY MULTIPLE ATTRIBUTE DECISION MAKING", "paper_id": "WOS:000277689200005"}