{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "game-based_student_response_system"}, {"score": 0.013038312175299261, "phrase": "students_motivation"}, {"score": 0.01265166958693467, "phrase": "new_learning_technology"}, {"score": 0.00886805388887621, "phrase": "classroom_dynamics"}, {"score": 0.004623990904432388, "phrase": "technical_infrastructures"}, {"score": 0.0045160988337296605, "phrase": "new_ways"}, {"score": 0.00430777589162606, "phrase": "students_smartphones"}, {"score": 0.0037765536386719775, "phrase": "immediate_enthusiasm"}, {"score": 0.0036022217019257598, "phrase": "immediate_positive_effects"}, {"score": 0.003073545175760353, "phrase": "kahoo"}, {"score": 0.003032295420569351, "phrase": "first_time"}, {"score": 0.0030017207229983385, "phrase": "single_motivational_lecture"}, {"score": 0.002971453391894977, "phrase": "kahoot"}, {"score": 0.002805597755796506, "phrase": "students'_perception"}, {"score": 0.0026579417954765137, "phrase": "perceived_learning"}, {"score": 0.0026045914281028473, "phrase": "slight_reduction"}, {"score": 0.0022522565004588113, "phrase": "core_factor"}, {"score": 0.002199582070223336, "phrase": "heavy_repeated_usage"}, {"score": 0.002155412043665635, "phrase": "competitive_nature"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Game-based learning", " Interactive learning environments", " Student-response systems", " Evaluation"], "paper_abstract": "The Bring Your Own Device (BYOD) wave and advancement in technical infrastructures and in learning technology opens for new ways of teaching in the classroom. The teachers' laptops connected to a video projector, access to wireless network and the students smartphones, tablets or laptops can be utilized to enhance the interaction between the teacher and students, as well as boost the students motivation, engagement and learning. The introduction of new learning technology in the classroom normally results in immediate enthusiasm and excitement both from the teacher and the students. However, the immediate positive effects might fade when the new learning technology has become familiar to the teacher and the students. This paper shows the results from investigating the wear off effect of using the game-based student response system Kahoot! in classroom teaching. More specifically, it compares the results from students using Kahoo! for the first time in a single motivational lecture vs. using Kahoot! in every lecture in a class for five months. The quasi-experiment focused on how the students' perception changed in relation to user-friendliness, engagement, motivation, classroom dynamics, concentration, and perceived learning. The results show a slight reduction in the students motivation and engagement, but the only statistically significant wear out effect found was related to classroom dynamics. At large, the game-based student response system managed to boost students engagement, motivation and learning after using it repeatedly for five months. The core factor to keep the students attention after heavy repeated usage was found to be the competitive nature of Kahoot!. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "The wear out effect of a game-based student response system", "paper_id": "WOS:000349723200018"}