{"auto_keywords": [{"score": 0.04842950119492682, "phrase": "multi-objective_optimization"}, {"score": 0.014885988331749166, "phrase": "environmental_problems"}, {"score": 0.00481496407807574, "phrase": "milp"}, {"score": 0.004377921202912336, "phrase": "useful_technique"}, {"score": 0.004334280585565239, "phrase": "sustainability_analysis"}, {"score": 0.004122490120202936, "phrase": "optimal_trade-off_solutions"}, {"score": 0.003980400251874277, "phrase": "main_limitation"}, {"score": 0.0036553070575015344, "phrase": "computational_barrier"}, {"score": 0.0035827424231607784, "phrase": "environmental_applications"}, {"score": 0.0031765314093444956, "phrase": "systematic_method"}, {"score": 0.002873331232538783, "phrase": "novel_mixed-integer_linear_programming_formulation"}, {"score": 0.0026120705848349055, "phrase": "different_nature"}, {"score": 0.0024842242921857705, "phrase": "life_cycle_assessment_impacts"}, {"score": 0.0023390219342052623, "phrase": "non-conflicting_manner"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Environmental engineering", " Life cycle assessment", " Multi-objective optimization", " Objective reduction"], "paper_abstract": "Multi-objective optimization has recently emerged as a useful technique in sustainability analysis, as it can assist in the study of optimal trade-off solutions that balance several criteria. The main limitation of multi-objective optimization is that its computational burden grows in size with the number of objectives. This computational barrier is critical in environmental applications in which decision-makers seek to minimize simultaneously several environmental indicators of concern. With the aim to overcome this limitation, this paper introduces a systematic method for reducing the number of objectives in multi-objective optimization with emphasis on environmental problems. The approach presented relies on a novel mixed-integer linear programming formulation that minimizes the error of omitting objectives. We test the capabilities of this technique through two environmental problems of different nature in which we attempt to minimize a set of life cycle assessment impacts. Numerical examples demonstrate that certain environmental metrics tend to behave in a non-conflicting manner, which makes it possible to reduce the dimension of the problem without losing information. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A novel MILP-based objective reduction method for multi-objective optimization: Application to environmental problems", "paper_id": "WOS:000293724900010"}