{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cerebral_palsy"}, {"score": 0.00475382761232911, "phrase": "new_multisensory_system"}, {"score": 0.004112812699639956, "phrase": "playful_and_fun_activities"}, {"score": 0.0039244530915794025, "phrase": "interactive_systems"}, {"score": 0.00387459052649752, "phrase": "computer_vision"}, {"score": 0.003760685138103153, "phrase": "real_time"}, {"score": 0.003468053168607071, "phrase": "significant_degree"}, {"score": 0.0033517342967390065, "phrase": "presented_system"}, {"score": 0.003267054216881229, "phrase": "cerebral_palsy_centre"}, {"score": 0.003239304090565123, "phrase": "tarragona"}, {"score": 0.0032119389238418174, "phrase": "spain"}, {"score": 0.003130633384437765, "phrase": "low_rate"}, {"score": 0.0029744042270542655, "phrase": "special_software_applications"}, {"score": 0.0026394405584281443, "phrase": "interaction_mechanisms"}, {"score": 0.002561752783323717, "phrase": "highly_interactive_activity"}, {"score": 0.0023123057299992587, "phrase": "cognitive_impairments"}, {"score": 0.0022731540640627307, "phrase": "impaired_users"}, {"score": 0.0021049977753042253, "phrase": "experimental_methodology"}], "paper_keywords": [""], "paper_abstract": "A new multisensory system that aims at fostering the interaction of people with cerebral palsy is presented. This article describes the strategies and technologies used to provide people who have moderate to severe cerebral palsy with playful and fun activities designed according to their abilities. These activities are based on interactive systems that use computer vision and generate graphics and sounds in real time. The well-being that is achieved through the use of these activities is the result of gaining a significant degree of autonomy by the users. The presented system was first developed in the Cerebral Palsy Centre of Tarragona, Spain. Its motivation came from the low rate of users able to interact with computers. Although several assistive technology gadgets and special software applications (e. g., cause-effect and educational activities, simple navigation environments, etc.) were used, most users simply did not understand the interaction mechanisms. It was thought that a highly interactive activity (reinforced with sounds and images closely related with gestures) would be more accessible to most users in spite of their sensory, motor, and cognitive impairments. Tests with impaired users show that the proposal promotes participation, engagement, and play. In this article, the experimental methodology, the used and developed tools, and the results that were obtained are explained.", "paper_title": "A Nonformal Interactive Therapeutic Multisensory Environment for People With Cerebral Palsy", "paper_id": "WOS:000301841200005"}