{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "biometric_performance_change"}, {"score": 0.004468415400599571, "phrase": "biometric_performance"}, {"score": 0.00436530211426514, "phrase": "subject-dependent_basis"}, {"score": 0.003920674807745575, "phrase": "linear_regression"}, {"score": 0.0036553070575015344, "phrase": "speech_identity_verification_modalities"}, {"score": 0.0033603864623013733, "phrase": "mobio_database_show"}, {"score": 0.002893434697072309, "phrase": "similar_proportion"}, {"score": 0.0027483472371835865, "phrase": "latter_finding"}, {"score": 0.002538263784314365, "phrase": "biometric_performance_degradation"}, {"score": 0.002300734266971646, "phrase": "improved_biometric_performance"}, {"score": 0.0022058510091498666, "phrase": "adaptive_biometric_systems"}, {"score": 0.0021049977753042253, "phrase": "biometric_templates"}], "paper_keywords": [""], "paper_abstract": "The authors present an algorithm that models the rate of change of biometric performance over time on a subject-dependent basis. It is called 'homomorphic users grouping algorithm'. Although the model is based on very simplistic assumptions that are inherent in linear regression, it has been applied successfully to estimate the performance of talking face and speech identity verification modalities, as well as their fusion, over a period of more than 600 days. Their experiments carried out on the MOBIO database show that subjects exhibit very different performance trends. Although the performance of some users degrades over time, which is consistent with the literature, they also found that for a similar proportion of users, their performance actually improves with use. The latter finding has never been reported in the literature. Hence, their findings suggest that the problem of biometric performance degradation may be not as serious as previously thought, and so far, the community has ignored the possibility of improved biometric performance over time. The findings also suggest that adaptive biometric systems, that is, systems that attempt to update biometric templates, should be subject-dependent.", "paper_title": "Algorithm to estimate biometric performance change over time", "paper_id": "WOS:000365645700008"}