{"auto_keywords": [{"score": 0.04793507329029245, "phrase": "research_units"}, {"score": 0.037831090346143896, "phrase": "cultural_impact"}, {"score": 0.03020359644689766, "phrase": "australia"}, {"score": 0.00481495049065317, "phrase": "comparative_assessment"}, {"score": 0.004781215097314411, "phrase": "book_publications"}, {"score": 0.004648609688625397, "phrase": "bibliometric_measures"}, {"score": 0.004551563730037998, "phrase": "book-oriented_humanities"}, {"score": 0.004378854464130883, "phrase": "journal-oriented_science"}, {"score": 0.004257360656055417, "phrase": "new_measure"}, {"score": 0.0042126709243529275, "phrase": "book-oriented_fields"}, {"score": 0.003885216927966404, "phrase": "national_or_international_union_catalog"}, {"score": 0.0033868916699805224, "phrase": "book_world"}, {"score": 0.0032013710938940424, "phrase": "libcitation_counts"}, {"score": 0.0029109914689364465, "phrase": "political_science"}, {"score": 0.002732149335827768, "phrase": "highest_libcitation_counts"}, {"score": 0.0027034263575471352, "phrase": "libraries_australia_union_catalog"}, {"score": 0.0026190518142076608, "phrase": "book's_raw_libcitation_count"}, {"score": 0.00247548600804924, "phrase": "item-oriented_field"}, {"score": 0.0024236964502593254, "phrase": "evaluative_bibliometrics"}, {"score": 0.0024066745849759706, "phrase": "summary_statistics"}, {"score": 0.002119890482815468, "phrase": "data_mining"}, {"score": 0.0021049977753042253, "phrase": "oclc's_worldcat"}], "paper_keywords": [""], "paper_abstract": "Bibliometric measures for evaluating research units in the book-oriented humanities and social sciences are underdeveloped relative to those available for journal-oriented science and technology. We therefore present a new measure designed for book-oriented fields: the \"libcitation count.\" This is a count of the libraries holding a given book, as reported in a national or international union catalog. As librarians decide what to acquire for the audiences they serve, they jointly constitute an instrument for gauging the cultural impact of books. Their decisions are informed by knowledge not only of audiences but also of the book world (e.g., the reputations of authors and the prestige of publishers). From libcitation counts, measures can be derived for comparing research units. Here, we imagine a match-up between the departments of history, philosophy, and political science at the University of New South Wales and the University of Sydney in Australia. We chose the 12 books from each department that had the highest libcitation counts in the Libraries Australia union catalog during 2000 to 2006. We present each book's raw libcitation count, its rank within its Library of Congress (LC) class, and its LC-class normalized libcitation score. The latter is patterned on the item-oriented field normalized citation score used in evaluative bibliometrics. Summary statistics based on these measures allow the departments to be compared for cultural impact. Our work has implications for programs such as Excellence in Research for Australia and the Research Assessment Exercise in the United Kingdom. It also has implications for data mining in OCLC's WorldCat.", "paper_title": "Libcitations: A Measure for Comparative Assessment of Book Publications in the Humanities and Social Sciences", "paper_id": "WOS:000266303800001"}