{"auto_keywords": [{"score": 0.03932882555440502, "phrase": "dacos"}, {"score": 0.010612387000973441, "phrase": "cooperative_optimization_systems"}, {"score": 0.004762550320451225, "phrase": "optimization_problems"}, {"score": 0.0039322149318145845, "phrase": "complex_tasks"}, {"score": 0.003784328428527216, "phrase": "integrated_system"}, {"score": 0.003175792987190496, "phrase": "software_modeling"}, {"score": 0.0026942333853202556, "phrase": "eclipse_developing_framework"}, {"score": 0.002508867228980776, "phrase": "source_code"}, {"score": 0.0024410093024417527, "phrase": "practical_case"}, {"score": 0.002223696715077018, "phrase": "cooperative_strategy"}, {"score": 0.002187402374176248, "phrase": "location_problem"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["software modeling", " cooperative optimization system", " eclipse modeling framework"], "paper_abstract": "Optimization problems are ubiquitous in our daily lives and one way to cope with them is using cooperative optimization systems that allow to obtain good enough, fast enough, and cheap enough solutions. From a practical point of view, the design and the analysis of such systems are complex tasks. In this work, an integrated system (DACOS) for helpings in the design and analysis of cooperative, centralized optimization systems is presented. Also, the methodology used for the creation of DACOS (mainly, the use of software modeling.) is described in detail. This may also be useful for researchers who want to build up their own system for their particular needs. DACOS has been developed using the Eclipse developing framework, which, among other advantages, is also able to automatically generate source code. Finally, a practical case of use is presented: the application of DACOS to the configuration and analysis of a cooperative strategy on a location problem. Copyright (C) 2010 John Wiley & Sons, Ltd.", "paper_title": "A software modeling approach for the design and analysis of cooperative optimization systems", "paper_id": "WOS:000280687400004"}