{"auto_keywords": [{"score": 0.04887993029454375, "phrase": "feature_selection"}, {"score": 0.005869051836709315, "phrase": "fuzzy_random_forest_ensemble"}, {"score": 0.00481495049065317, "phrase": "filter-wrapper"}, {"score": 0.004762893197005439, "phrase": "low_quality_data"}, {"score": 0.004643594260262632, "phrase": "active_research"}, {"score": 0.004610058444728656, "phrase": "machine_learning"}, {"score": 0.00456020621016909, "phrase": "main_idea"}, {"score": 0.004413846562278824, "phrase": "available_features"}, {"score": 0.004241299366498948, "phrase": "redundant_features"}, {"score": 0.0039019217388438134, "phrase": "crisp_data"}, {"score": 0.0036953036453370087, "phrase": "crisp_and_low_quality"}, {"score": 0.0034995881411519925, "phrase": "new_method"}, {"score": 0.0034118234596993836, "phrase": "crisp_and_low_quality_data"}, {"score": 0.0033021988455635403, "phrase": "fuzzy_random_forest"}, {"score": 0.0032310733124059536, "phrase": "wrapper_methods"}, {"score": 0.003196085261684218, "phrase": "sequential_search_procedure"}, {"score": 0.003172969962401266, "phrase": "improved_classification_accuracy"}, {"score": 0.0028249975318149468, "phrase": "discretization_process"}, {"score": 0.002704554429386671, "phrase": "feature_pre-selection"}, {"score": 0.002347378595930709, "phrase": "good_performance"}, {"score": 0.0021592189144729775, "phrase": "high_dimensional_datasets"}, {"score": 0.0021049977753042253, "phrase": "low_quality_datasets"}], "paper_keywords": ["Feature selection", " Low quality data", " Fuzzy Random Forest", " Fuzzy Decision Tree"], "paper_abstract": "Today, feature selection is an active research in machine learning. The main idea of feature selection is to choose a subset of available features, by eliminating features with little or no predictive information, as well as redundant features that are strongly correlated. There are a lot of approaches for feature selection, but most of them can only work with crisp data. Until now there have not been many different approaches which can directly work with both crisp and low quality (imprecise and uncertain) data. That is why, we propose a new method of feature selection which can handle both crisp and low quality data. The proposed approach is based on a Fuzzy Random Forest and it integrates filter and wrapper methods into a sequential search procedure with improved classification accuracy of the features selected. This approach consists of the following main steps: (1) scaling and discretization process of the feature set; and feature pre-selection using the discretization process (filter); (2) ranking process of the feature pre-selection using the Fuzzy Decision Trees of a Fuzzy Random Forest ensemble; and (3) wrapper feature selection using a Fuzzy Random Forest ensemble based on cross-validation. The efficiency and effectiveness of this approach is proved through several experiments using both high dimensional and low quality datasets. The approach shows a good performance (not only classification accuracy, but also with respect to the number of features selected) and good behavior both with high dimensional datasets (microarray datasets) and with low quality datasets. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Feature subset selection Filter-Wrapper based on low quality data", "paper_id": "WOS:000322857200003"}