{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_cartoonish_sea_waves"}, {"score": 0.004603244077348199, "phrase": "nonanthropomorphic_approach"}, {"score": 0.004278807087784626, "phrase": "arousal_dimensions"}, {"score": 0.003802135020791801, "phrase": "simple_bezier_curves"}, {"score": 0.0036759314172445934, "phrase": "valence_value"}, {"score": 0.0032115093493071366, "phrase": "arousal_value"}, {"score": 0.00305285084207725, "phrase": "hocking_algorithm"}, {"score": 0.0029020077365708966, "phrase": "user_study"}, {"score": 0.0024097920845706795, "phrase": "particular_emotions"}, {"score": 0.0021049977753042253, "phrase": "slight_side_effect"}], "paper_keywords": ["Arousal", " digital emotions", " movement", " sharpness", " valence"], "paper_abstract": "This paper proposes and explores a nonanthropomorphic approach to express emotions. Emotions are represented in terms of valence and arousal dimensions, and they are visually expressed through the shape and movement of a series of digital cartoonish sea waves which are modeled as simple Bezier curves. In particular, the valence value is expressed through the sharpness of the curves (the more negative the valence, the sharper the curves), while the arousal value is expressed through their movement (controlled by a Hocking algorithm). Furthermore, this paper describes a user study which investigated whether the valence and arousal expressed by our model are appropriately perceived by the users or not. The results suggest that combinations of sharpness and movement are perceived correctly as particular emotions and that sharpness and movement are perceived as valence and arousal, respectively. We also found that valence in our model has a slight side effect in the perception of arousal. The more negative the valence, the higher the arousal is perceived.", "paper_title": "Emotional Sea: Showing Valence and Arousal Through the Sharpness and Movement of Digital Cartoonish Sea Waves", "paper_id": "WOS:000323496700012"}