{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "academic_productivity"}, {"score": 0.009551917390153422, "phrase": "external_relationships"}, {"score": 0.008982501542610483, "phrase": "first_type"}, {"score": 0.008723302623637404, "phrase": "second_type"}, {"score": 0.007965990841332283, "phrase": "sample_survey"}, {"score": 0.004703018868854905, "phrase": "first_attempts"}, {"score": 0.004661715471100588, "phrase": "empirical_analysis"}, {"score": 0.004620773128779254, "phrase": "academic_productivity_complex"}, {"score": 0.004473689992665426, "phrase": "multidimensional_combination"}, {"score": 0.00440838389264585, "phrase": "academic_researchers"}, {"score": 0.004107888274412499, "phrase": "scientific_productivity"}, {"score": 0.0037830010278885437, "phrase": "external_advice"}, {"score": 0.003535375475035123, "phrase": "italian_researchers"}, {"score": 0.0035042905855674875, "phrase": "pir_research_project"}, {"score": 0.003236502732219314, "phrase": "working_reality"}, {"score": 0.0032174978938185736, "phrase": "italian_academics"}, {"score": 0.0030784630179366353, "phrase": "primary_aims"}, {"score": 0.0029109184943351503, "phrase": "iper_productivity"}, {"score": 0.002885308262488126, "phrase": "hyper_productivity"}, {"score": 0.002851510437722781, "phrase": "overall_productivity"}, {"score": 0.0024320693637722335, "phrase": "literature_search"}, {"score": 0.0024106618562440563, "phrase": "primary_techniques"}, {"score": 0.0022726706036523465, "phrase": "technical_aspects"}, {"score": 0.0022460329080075648, "phrase": "italian_system"}, {"score": 0.002174374647551399, "phrase": "additional_variables"}], "paper_keywords": ["Academic productivity complex", " Scientific productivity", " Assignments and awards", " Patents and service productivity", " Didactics productivity"], "paper_abstract": "This study represents one of the first attempts to use empirical analysis to estimate academic productivity complex and proves the thesis that academic productivity is a function of multidimensional combination of the work of academic researchers: the scientific work, education, and external relationships. Given the complexity of academic productivity, it is necessary to clarify that it is divided into scientific productivity of the first type (scientific publications); scientific productivity of the second type (awards and academic positions); productivity in terms of external relationships (or external advice); and educational productivity. This objective of this paper is achieved through a sample survey (2,738 academics responded) conducted by Italian researchers from the PIR research project. The results obtained, however (as a case of estimates obtained using the results of a sample survey), are the result of a working reality that Italian academics are flooded by a myriad of activities that are not always consistent with the primary aims of the work of a researcher with an organisational and environmental well-being at the limit of iper productivity (or hyper productivity). The overall productivity (academic productivity) is significantly correlated with the four dimensions: average annual scientific productivity of the first type, average annual scientific productivity of the second type, the productivity external advice and, lastly, teaching productivity. The estimate of the sizes for the four indicators of productivity are the result of a literature search of the primary techniques used to assess productivity in academia. By comparing the most significant indicators, we managed to select all of the technical aspects missing in the Italian system of evaluation. This process allowed for us to add additional variables characterising the various aspects of productivity and prove the validity of our theory about the multidimensionality of academic productivity.", "paper_title": "A multidimensional approach to academic productivity", "paper_id": "WOS:000335905000008"}