{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "near-perfect_phylogenies"}, {"score": 0.004773904938276846, "phrase": "multiple_homoplasy_events"}, {"score": 0.0045348429403481464, "phrase": "bi-allelic_haplotypes"}, {"score": 0.004419819325202464, "phrase": "perfect_phylogeny"}, {"score": 0.004326188427877999, "phrase": "homoplasy_events"}, {"score": 0.004252707756312684, "phrase": "polynomial-time_algorithms"}, {"score": 0.003954030683259778, "phrase": "genotype_data"}, {"score": 0.0037078961288626185, "phrase": "npph"}, {"score": 0.003598317040926701, "phrase": "near-optimal_algorithm"}, {"score": 0.003316884515934182, "phrase": "single_homoplasy_event"}, {"score": 0.002954287204671032, "phrase": "snp_sites"}, {"score": 0.0028916124463906983, "phrase": "significant_improvement"}, {"score": 0.002746549549029177, "phrase": "generalized_versions"}, {"score": 0.0025099367332615794, "phrase": "q_homoplasy_events"}, {"score": 0.0024252458095689847, "phrase": "single_site"}, {"score": 0.002235356010935877, "phrase": "simulated_data"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": [""], "paper_abstract": "Motivation: We explore the problem of constructing near-perfect phylogenies on bi-allelic haplotypes, where the deviation from perfect phylogeny is entirely due to homoplasy events. We present polynomial-time algorithms for restricted versions of the problem. We show that these algorithms can be extended to genotype data, in which case the problem is called the near-perfect phylogeny haplotyping ( NPPH) problem. We present a near-optimal algorithm for the H1-NPPH problem, which is to determine if a given set of genotypes admit a phylogeny with a single homoplasy event. The time-complexity of our algorithm for the H1-NPPH problem is O(m(2)(n + m)), where n is the number of genotypes and m is the number of SNP sites. This is a significant improvement over the earlier O( n 4) algorithm. We also introduce generalized versions of the problem. The H(1, q)-NPPH problem is to determine if a given set of genotypes admit a phylogeny with q homoplasy events, so that all the homoplasy events occur in a single site. We present an O(m(q+1)(n + m)) algorithm for the H(1, q)-NPPH problem. Results: We present results on simulated data, which demonstrate that the accuracyof our algorithm for theH1-NPPHproblemiscomparableto that of the existing methods, while being orders of magnitude faster. Availability: The implementation of our algorithm for the H1-NPPH problem is available upon request.", "paper_title": "Constructing Near-Perfect Phylogenies with multiple homoplasy events", "paper_id": "WOS:000250005000063"}