{"auto_keywords": [{"score": 0.01392735698847496, "phrase": "power_law_distribution"}, {"score": 0.007242772267301584, "phrase": "preferential_attachment_rule"}, {"score": 0.005085555840307446, "phrase": "preferential_attachment_equation"}, {"score": 0.004067635935640407, "phrase": "programmableweb"}, {"score": 0.0037543106253910313, "phrase": "open_api"}, {"score": 0.003568932067237836, "phrase": "mashup_service"}, {"score": 0.0031979796189858206, "phrase": "preferential_attachment"}, {"score": 0.002939007076062123, "phrase": "scale-free_network"}, {"score": 0.002723862897844177, "phrase": "social_network_analysis"}, {"score": 0.002689564715486338, "phrase": "service_network"}, {"score": 0.002600194073758015, "phrase": "evolution_mechanism"}, {"score": 0.002524428047147766, "phrase": "similar_areas"}, {"score": 0.002482126086922683, "phrase": "world_wide_web"}, {"score": 0.002461253719139288, "phrase": "www"}, {"score": 0.002242758902593467, "phrase": "degree_centralities"}, {"score": 0.0021049977753042253, "phrase": "low_values"}], "paper_keywords": ["Worldwide web", " Internet", " Social networks", " Computer communications software"], "paper_abstract": "Purpose - The purpose of this research is to empirically analyse the structure of the Web 2.0 service network and the mechanism behind its evolution over time. Design/methodology/approach - Based on the list of Web 2.0 services and their mashups that is provided on Programmableweb, a network of Web 2.0 services was constructed. Within this network a node represents a Web 2.0 service with an open API, and a link between two nodes represents the existence of a mashup service that uses the two nodes. Findings - The findings suggest that the evolution of the Web 2.0 service network; follows the preferential attachment rule although the exponent of the preferential attachment is lower than for other networks following a preferential attachment rule. Additionally the results indicate that the Web 2.0 service network evolves to a scale-free network but the exponent of the power law distribution is lower than for other networks. Originality/value - The research applied social network analysis to the Web 2.0 service network. It showed that its network structure and the evolution mechanism are different from those found in similar areas, e.g. the world wide web (WWW). The findings imply that there are factors which lower the exponent of the preferential attachment equation and the power law distribution of the degree centralities. Research limitation/implications - This paper did not investigate the factors responsible for the low values of the exponent of the preferential attachment equation and the exponent of the power law distribution. However, it is suggested that it could be correlated with the fact that the interconnection between nodes depends on the property of the nodes.", "paper_title": "The structural evolution of the Web 2.0 service network", "paper_id": "WOS:000273759300002"}