{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "sketch-based_modeling"}, {"score": 0.003897742942358768, "phrase": "semantic_understanding"}, {"score": 0.0038431888954930083, "phrase": "shape's_geometry"}, {"score": 0.0034657012607680173, "phrase": "semantic_tasks"}, {"score": 0.0029260602766930065, "phrase": "specific_geometric_primitives"}, {"score": 0.0028850668183221947, "phrase": "relevant_parts"}, {"score": 0.0026384167183586015, "phrase": "sketch_lines"}, {"score": 0.0025171669791790438, "phrase": "geosemantic_constraints"}, {"score": 0.002470237978694949, "phrase": "different_parts"}, {"score": 0.0022378101636842296, "phrase": "good_starting_configuration"}, {"score": 0.0022064376000055764, "phrase": "non-convex_optimization_problem"}, {"score": 0.0021049977753042253, "phrase": "user_study"}], "paper_keywords": [""], "paper_abstract": "Modeling 3D objects from sketches is a process that requires several challenging problems including segmentation, recognition and reconstruction. Some of these tasks are harder for humans and some are harder for the machine. At the core of the problem lies the need for semantic understanding of the shape's geometry from the sketch. In this paper we propose a method to model 3D objects from sketches by utilizing humans specifically for semantic tasks that are very simple for humans and extremely difficult for the machine, while utilizing the machine for tasks that are harder for humans. The user assists recognition and segmentation by choosing and placing specific geometric primitives on the relevant parts of the sketch. The machine first snaps the primitive to the sketch by fitting its projection to the sketch lines, and then improves the model globally by inferring geosemantic constraints that link the different parts. The fitting occurs in real-time, allowing the user to be only as precise as needed to have a good starting configuration for this non-convex optimization problem. We evaluate the accessibility of our approach with a user study.", "paper_title": "Geosemantic Snapping for Sketch-Based Modeling", "paper_id": "WOS:000318545900012"}