{"auto_keywords": [{"score": 0.04831370608356702, "phrase": "cap"}, {"score": 0.00481495049065317, "phrase": "multi-unit_nondiscriminatory_combinatorial_auction"}, {"score": 0.0038431888954930083, "phrase": "defined_classes"}, {"score": 0.003615443704375908, "phrase": "different_brands"}, {"score": 0.002752513434446804, "phrase": "different_items"}, {"score": 0.0025409639091476363, "phrase": "munca"}, {"score": 0.0024818877663889813, "phrase": "integer_programming_formulation"}, {"score": 0.0023571794258320164, "phrase": "np"}, {"score": 0.0022168460543913787, "phrase": "quite_good_solutions"}, {"score": 0.0021652891317252994, "phrase": "optimal_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Combinatorial auctions", " Multi-unit auctions", " Combinatorial bidding", " Winner determination", " Integer programming", " Optimization"], "paper_abstract": "Single unit combinatorial auction problem (CAP) and its multi-unit extension have received a lot of attention recently. This paper introduces yet another variant of CAP which generalizes the multi-unit CAP further to allow bids on collections of items that can come from bidder defined classes of items. A bidder may be indifferent to some items with different brands, specifications or qualities and consider them as substitutable. In this case, these items can be put in a class and hence the bids can be made by referring to the items in such classes. This model enables the bidder to express his requests by using less number of bids in case he does not discriminate between different items. Because of this, we call this problem multi-unit nondiscriminatory combinatorial auction (MUNCA) problem. An integer programming formulation is given for this problem. Since this problem is NP-hard, two fast heuristic algorithms have also been designed. The heuristics give quite good solutions when compared to the optimal solution. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A model and heuristic algorithms for multi-unit nondiscriminatory combinatorial auction", "paper_id": "WOS:000260204300015"}