{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_web"}, {"score": 0.013326068161195895, "phrase": "semantic_retrieval"}, {"score": 0.008792679620693387, "phrase": "ontology_caching"}, {"score": 0.004701556483912018, "phrase": "current_web"}, {"score": 0.004285289574869884, "phrase": "semantic_information_retrieval"}, {"score": 0.004053362743156545, "phrase": "ontology_based_retrieval"}, {"score": 0.004000010693331517, "phrase": "search_engine"}, {"score": 0.003978866233891427, "phrase": "web_mining"}, {"score": 0.003916098498242888, "phrase": "great_number"}, {"score": 0.0038339398365449507, "phrase": "ontology_servers"}, {"score": 0.0036167509502276294, "phrase": "ontology_server"}, {"score": 0.003578600071301459, "phrase": "existing_caching_methods"}, {"score": 0.003559675269411366, "phrase": "database_community"}, {"score": 0.003503497128638102, "phrase": "ontology_cache"}, {"score": 0.0032441788252223313, "phrase": "recently_less_frequently_accessed_data"}, {"score": 0.0031259287291997154, "phrase": "ontology_base"}, {"score": 0.002841217570096031, "phrase": "similar_object"}, {"score": 0.002555103050945904, "phrase": "specific_semantic_web_application"}, {"score": 0.0025014259919355453, "phrase": "machine_learning_methods"}, {"score": 0.002365815362517737, "phrase": "classification_model"}, {"score": 0.002249451762415544, "phrase": "classification_models"}, {"score": 0.002225691463551672, "phrase": "experimental_results"}, {"score": 0.0022021815838179247, "phrase": "proposed_methods"}, {"score": 0.0021731423856364003, "phrase": "baseline_methods"}, {"score": 0.0021387992835532367, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "research_project"}], "paper_keywords": [""], "paper_abstract": "This paper addresses the issue of ontology caching on semantic web. ne Semantic Web is an extension of the current web in which information is given well-defined meaning, better enabling computers and people to work in cooperation. Ontology serves as the metadata for defining the information on semantic web. Ontology based semantic information retrieval (semantic retrieval) is becoming more and more important. Many research and industrial works have been made so far on semantic retrieval. Ontology based retrieval improves the performance of search engine and web mining. In semantic retrieval, a great number of accesses to ontologies usually lead the ontology servers to be very low efficient. To address this problem, it is indeed necessary to cache concepts and instances when ontology server is running. Existing caching methods from database community can be used in the ontology cache. However, they are not sufficient for dealing with the problem. In the task of caching in database, usually the most frequently accessed data are cached and the recently less frequently accessed data in the cache are removed from it. Different from that, in ontology base, data are organized as objects and relations between objects. User may request one object, and then request another object according to a relation of that object. He may also possibly request a similar object that has not any relations to the object. Ontology caching should consider more factors and is more difficult. In this paper, ontology caching is formalized as a problem of classification. In this way, ontology caching becomes independent from any specific semantic web application. An approach is proposed by using machine learning methods. When an object (e.g. concept or instance) is requested, we view its similar objects as candidates. A classification model is then used to predict whether each of these candidates should be cached or not. Features in classification models are defined. Experimental results indicate that the proposed methods can significantly outperform the baseline methods for ontology caching. The proposed method has been applied to a research project that is called SWARMS.", "paper_title": "Semantic similarity based ontology cache", "paper_id": "WOS:000235658000023"}