{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "deformable_shapes"}, {"score": 0.003999089046152065, "phrase": "object_category"}, {"score": 0.0038348235692738783, "phrase": "object_deformation"}, {"score": 0.0037216229812089686, "phrase": "body_shapes"}, {"score": 0.0032229262928681304, "phrase": "articulation_variation"}, {"score": 0.002945669860541221, "phrase": "existing_search_techniques"}, {"score": 0.002841545331522694, "phrase": "slow_search_times"}, {"score": 0.00247529638625566, "phrase": "flexible_shape_templates"}, {"score": 0.00240213106042981, "phrase": "salient_object_features"}, {"score": 0.002373472641477602, "phrase": "user-defined_heuristics"}, {"score": 0.0023033100935570755, "phrase": "computation_time"}, {"score": 0.0022085455097790537, "phrase": "salient_features"}, {"score": 0.0021049977753042253, "phrase": "truer_positive_matches"}], "paper_keywords": ["Shape detection", " Deformable templates", " Object recognition"], "paper_abstract": "An object can often be uniquely identified by its shape, which is usually fairly invariant. However, when the search is for a type of object or an object category, there can be variations in object deformation (i.e. variations in body shapes) and articulation (i.e. joint movement by limbs) that complicate their detection. We present a system that can account for this articulation variation to improve the robustness of its object detection by using deformable shapes as its main search criteria. However, existing search techniques based on deformable shapes suffer from slow search times and poor best matches when images are cluttered and the search is not initialised. To overcome these drawbacks, our object detection system uses flexible shape templates that are augmented by salient object features and user-defined heuristics. Our approach reduces computation time by prioritising the search around these salient features and uses the template heuristics to find truer positive matches.", "paper_title": "A robust object category detection system using deformable shapes", "paper_id": "WOS:000262550600005"}