{"auto_keywords": [{"score": 0.044370244020442304, "phrase": "multimodal_virtual_environments"}, {"score": 0.034915179178448524, "phrase": "haptic_feedback"}, {"score": 0.030074948199064692, "phrase": "added_feedback"}, {"score": 0.00481495049065317, "phrase": "enhancing_realism"}, {"score": 0.00441909542037375, "phrase": "plantar_vibrotactile_feedback"}, {"score": 0.004019171295196278, "phrase": "noninteractive_multimodal_feedback_system"}, {"score": 0.0038764861784138117, "phrase": "interactive_system_subjects"}, {"score": 0.0037219886365287085, "phrase": "noninteractive_system"}, {"score": 0.003400274964240732, "phrase": "audio-visual_stimuli"}, {"score": 0.0031917146566068245, "phrase": "clear_preference"}, {"score": 0.0030505976034245234, "phrase": "haptic_channel"}, {"score": 0.002955533639862811, "phrase": "interactive_and_noninteractive_configurations"}, {"score": 0.0025456716198597627, "phrase": "haptic_simulation"}, {"score": 0.0024440836179156593, "phrase": "different_individual_desire"}, {"score": 0.0022733662000757318, "phrase": "physical_navigation"}, {"score": 0.0021826210858934933, "phrase": "user_experience"}, {"score": 0.0021049977753042253, "phrase": "video_game"}], "paper_keywords": ["Haptic feedback", " realism", " virtual environments", " physics-based models"], "paper_abstract": "In this paper, we describe several experiments whose goal is to evaluate the role of plantar vibrotactile feedback in enhancing the realism of walking experiences in multimodal virtual environments. To achieve this goal we built an interactive and a noninteractive multimodal feedback system. While during the use of the interactive system subjects physically walked, during the use of the noninteractive system the locomotion was simulated while subjects were sitting on a chair. In both the configurations subjects were exposed to auditory and audio-visual stimuli presented with and without the haptic feedback. Results of the experiments provide a clear preference toward the simulations enhanced with haptic feedback showing that the haptic channel can lead to more realistic experiences in both interactive and noninteractive configurations. The majority of subjects clearly appreciated the added feedback. However, some subjects found the added feedback unpleasant. This might be due, on one hand, to the limits of the haptic simulation and, on the other hand, to the different individual desire to be involved in the simulations. Our findings can be applied to the context of physical navigation in multimodal virtual environments as well as to enhance the user experience of watching a movie or playing a video game.", "paper_title": "Haptic Feedback for Enhancing Realism of Walking Simulations", "paper_id": "WOS:000316499100005"}