{"auto_keywords": [{"score": 0.03724335196977444, "phrase": "epistemic_probabilities"}, {"score": 0.015719716506582538, "phrase": "objective_probability"}, {"score": 0.014465537240568743, "phrase": "random_experiment"}, {"score": 0.004725886853744007, "phrase": "subjective_probability"}, {"score": 0.004638462976078815, "phrase": "machine_learning"}, {"score": 0.0039024014688338964, "phrase": "unknown_parameters"}, {"score": 0.0026974065918918275, "phrase": "learning_capabilities"}, {"score": 0.0026598200370569433, "phrase": "vacuous_representation"}, {"score": 0.002538263784314365, "phrase": "different_concepts"}, {"score": 0.002344201345813952, "phrase": "reasonable_learning_capabilities"}, {"score": 0.0021649437083408425, "phrase": "imprecise_dirichlet_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Imprecise probability", " Conditioning", " Learning", " Ignorance", " Chance", " Degree of belief"], "paper_abstract": "This paper distinguishes between objective probability or chance and subjective probability. Most statistical methods in machine learning are based on the hypothesis that there is a random experiment from which we get a set of observations. This random experiment could be identified with a chance or objective probability, but these probabilities depend on some unknown parameters. Our knowledge of these parameters is not objective and in order to learn about them, we must assess some epistemic probabilities about their values. In some cases, our objective knowledge about these parameters is vacuous, so the question is: What epistemic probabilities should be assumed? In this paper we argue for the assumption of non-vacuous (a proper subset of [0, 1]) interval probabilities. There are several reasons for this; some are based on the betting interpretation of epistemic probabilities while others are based on the learning capabilities under the vacuous representation. The implications of the selection of epistemic probabilities in different concepts as conditioning and learning are studied. It is shown that in order to maintain some reasonable learning capabilities we have to assume more informative prior models than those frequently used in the literature, such as the imprecise Dirichlet model. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Imprecise probabilities for representing ignorance about a parameter", "paper_id": "WOS:000302980500007"}