{"auto_keywords": [{"score": 0.02963887196699118, "phrase": "exact_location"}, {"score": 0.00481495049065317, "phrase": "online_clustering"}, {"score": 0.004783730450730986, "phrase": "variable_sized_clusters"}, {"score": 0.0047527118741586055, "phrase": "online_clustering_problems"}, {"score": 0.004482400730101345, "phrase": "online_fashion"}, {"score": 0.004410068751933955, "phrase": "arbitrary_locations"}, {"score": 0.004065474891313382, "phrase": "existing_cluster"}, {"score": 0.004025968624066142, "phrase": "new_cluster"}, {"score": 0.0038717306726380233, "phrase": "one-dimensional_variant"}, {"score": 0.0037599278182081056, "phrase": "closed_interval"}, {"score": 0.003477264432055326, "phrase": "fixed_set-up_cost"}, {"score": 0.002850551552945005, "phrase": "strict_variant"}, {"score": 0.002670667021775741, "phrase": "flexible_variant"}, {"score": 0.0024616504443079512, "phrase": "intermediate_model"}, {"score": 0.0023213398100616132, "phrase": "tight_bounds"}, {"score": 0.002298743062291417, "phrase": "competitive_ratio"}, {"score": 0.0022763657774198184, "phrase": "online_algorithm"}, {"score": 0.002153605290802688, "phrase": "semi-online_case"}], "paper_keywords": [""], "paper_abstract": "Online clustering problems are problems where the classification of points into sets (called clusters) is performed in an online fashion. Points arrive at arbitrary locations, one by one, to be assigned to clusters at the time of arrival. A point can be either assigned to an existing cluster or a new cluster can be opened for it. Here, we study a one-dimensional variant on a line. Each cluster is a closed interval, and there is no restriction on the length of a cluster. The cost of a cluster is the sum of a fixed set-up cost and its diameter (or length). The goal is to minimize the sum of costs of the clusters used by the algorithm. We study several variants, each having the two essential properties that a point which has been assigned to a given cluster must remain assigned to that cluster and no pair of clusters can be merged. In the strict variant, the diameter and the exact location of the cluster must be fixed when it is initialized. In the flexible variant, the algorithm can shift the cluster or expand it, as long as it contains all points assigned to it. In an intermediate model, the diameter is fixed in advance but the exact location can be modified. Here we give tight bounds on the competitive ratio of any online algorithm in each of these variants. In addition, for each model we also consider the semi-online case where points are presented ordered by their location.", "paper_title": "Online Clustering with Variable Sized Clusters", "paper_id": "WOS:000313649000001"}