{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "antioxidant_activity"}, {"score": 0.0322082065344101, "phrase": "best_two-descriptor_model"}, {"score": 0.004764542405129454, "phrase": "new_coumarin_derivatives"}, {"score": 0.004544127927346964, "phrase": "structural_modification"}, {"score": 0.004402854153653114, "phrase": "main_ferric-reducing_antioxidant_power"}, {"score": 0.004004745018355536, "phrase": "qsar"}, {"score": 0.00388016972840459, "phrase": "coumarin_derivatives"}, {"score": 0.0032609360162842767, "phrase": "predictive_power"}, {"score": 0.0031428202743657057, "phrase": "internal_and_external_validations"}, {"score": 0.0024144659350277954, "phrase": "h-bond_donor"}, {"score": 0.0023516185395256505, "phrase": "important_parameters"}], "paper_keywords": ["QSAR", " in silico modelling", " multiple linear regression", " coumarin derivatives", " FRAP assay"], "paper_abstract": "This study presents 37 new antioxidant coumarin derivatives and strategies for structural modification to improve their antioxidant activities, the main ferric-reducing antioxidant power (FRAP) assay used to evaluate their antioxidant properties and the generation of validated quantitative structure-activity (antioxidant activity) relationship (QSAR) models. In an attempt to generate QSAR models, structures of all coumarin derivatives in the data set were fully optimized by semi-empirical PM6 method using SPARTAN 10 software. Descriptors were calculated by DRAGON 6.0 software. Multiple linear regression (MLR) models were developed with different training/test set combinations using QSARINS 2.2.1 software. Robustness, reliability and predictive power of the models were tested by internal and external validations. Applicability domain of the best two-descriptor model (n(TR) = 30; r(2) = 0.924; RMSETR = 0.213; n(TEST) = 7; r(ext)(2) = 0.887; RMSEext = 0.255; CCCext = 0.939) was determined. Descriptors appeared in the model revealed that complexity, H-bond donor and lipophilic character are important parameters in describing the antioxidant activity. Apart from the compounds in the data set, we also designed 31 new antioxidant coumarin derivatives and predicted their antioxidant activity using the best two-descriptor model. Most of these compounds are promising antioxidants", "paper_title": "QSAR models for antioxidant activity of new coumarin derivatives", "paper_id": "WOS:000364276000001"}