{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ranking_problem"}, {"score": 0.031901763874956926, "phrase": "proposed_technique"}, {"score": 0.004317109072311102, "phrase": "multiple_attributes"}, {"score": 0.004272456401437226, "phrase": "multiple_data_types"}, {"score": 0.004206338218873218, "phrase": "different_orders"}, {"score": 0.0040771431404398855, "phrase": "diverse_practical_applications"}, {"score": 0.0038304902197108643, "phrase": "machine_learning"}, {"score": 0.003143341238802547, "phrase": "fast_clustering-based_algorithmic_ranking_technique"}, {"score": 0.0027886573969044042, "phrase": "crossing_minimization_paradigm"}, {"score": 0.0027169974137406148, "phrase": "vlsi_chip_design"}, {"score": 0.002674885993329912, "phrase": "laboratory_ranking_results"}, {"score": 0.0025657442830956017, "phrase": "algorithmic_ranking"}, {"score": 0.002206045784326466, "phrase": "better_rankings"}, {"score": 0.0021605514226546497, "phrase": "traditional_ranking_techniques"}, {"score": 0.0021049977753042253, "phrase": "laboratory_results"}], "paper_keywords": [""], "paper_abstract": "The ranking problem consists of comparing a collection of observations and deciding which one is \"better.\" An observation can consist of multiple attributes, multiple data types, and different orders of preference. Due to diverse practical applications, the ranking problem has been receiving attention in the domain of machine learning and statistics, some of those applications being webpage ranking, gene ranking, pesticide risk assessment, credit-risk screening, etc. In this article, we will present and discuss a novel and fast clustering-based algorithmic ranking technique and provide necessary theoretical working. The proposed technique utilizes the interrelationships among the observations to perform ranking and is based on the crossing minimization paradigm from the domain of VLSI chip design. Using laboratory ranking results as a reference, we compare the algorithmic ranking of the proposed technique and two traditional ranking techniques: the Hasse Diagram Technique (HDT) and the Hierarchical Clustering (HC) technique. The results demonstrate that our technique generates better rankings compared to the traditional ranking techniques and closely matches the laboratory results that took days of work.", "paper_title": "A Novel Crossing Minimization Ranking Method", "paper_id": "WOS:000348574900004"}