{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "query_q"}, {"score": 0.004674952036988355, "phrase": "set_v"}, {"score": 0.004450568197899267, "phrase": "information-theoretic_terms"}, {"score": 0.004073359218158693, "phrase": "q._next"}, {"score": 0.00376488621224566, "phrase": "specific_language"}, {"score": 0.003479692058963528, "phrase": "rewriting_language_r"}, {"score": 0.0034118234596993836, "phrase": "v-to-q_rewritings"}, {"score": 0.0027741761880779535, "phrase": "specific_languages"}, {"score": 0.0026933542552712033, "phrase": "information-theoretic_notion"}, {"score": 0.002551231163230566, "phrase": "rewriting_language"}, {"score": 0.0021049977753042253, "phrase": "complete_rewriting_languages"}], "paper_keywords": ["Algorithms", " Design", " Security", " Theory", " Verification", " Queries", " views", " rewritingg"], "paper_abstract": "We investigate the question of whether a query Q can be answered using a set V of views. We first define the problem in information-theoretic terms: we say that V determines Q if V provides enough information to uniquely determine the answer to Q. Next, we look at the problem of rewriting Q in terms of V using a specific language. Given a view language V and query language Q, we say that a rewriting language R is complete for V-to-Q rewritings if every Q is an element of Q can be rewritten in terms of V is an element of V using a query in R, whenever V determines Q. While query rewriting using views has been extensively investigated for some specific languages, the connection to the information-theoretic notion of determinacy, and the question of completeness of a rewriting language have received little attention. In this article we investigate systematically the notion of determinacy and its connection to rewriting. The results concern decidability of determinacy for various view and query languages, as well as the power required of complete rewriting languages. We consider languages ranging from first-order to conjunctive queries.", "paper_title": "Views and Queries: Determinacy and Rewriting", "paper_id": "WOS:000280544600006"}