{"auto_keywords": [{"score": 0.041769232686806455, "phrase": "mac_contention"}, {"score": 0.00481495049065317, "phrase": "transport_protocols"}, {"score": 0.0047707093928203, "phrase": "wireless_mesh_networks"}, {"score": 0.004513631630494221, "phrase": "static_multihop_wireless_network"}, {"score": 0.004390312150344245, "phrase": "backhaul_network"}, {"score": 0.004329916183121203, "phrase": "two-tier_wireless_mesh_network"}, {"score": 0.004290128440743909, "phrase": "wmn"}, {"score": 0.0036328561748082138, "phrase": "loss_rate_increases"}, {"score": 0.0029642838574678526, "phrase": "higher_layer_protocols"}, {"score": 0.0027913353347879507, "phrase": "network_path"}, {"score": 0.00274017282519193, "phrase": "additional_overhead"}, {"score": 0.0026284507395498897, "phrase": "packet_transmissions"}, {"score": 0.0025922289692173997, "phrase": "mac_contentions"}, {"score": 0.00249805321224923, "phrase": "llap_scheme"}, {"score": 0.0022458849724980904, "phrase": "different_network_scenarios"}, {"score": 0.002164264600379492, "phrase": "significant_improvement"}, {"score": 0.0021049977753042253, "phrase": "udp_and_tcp_traffic"}], "paper_keywords": ["wireless mesh networks", " medium access control", " IEEE 802.11 standard", " TCP and UDP traffic", " congestion and contention"], "paper_abstract": "In this paper, we study the performance of a static multihop wireless network, specifically that of the backhaul network of a two-tier Wireless Mesh Network (WMN) operating on IEEE 802.11 Medium Access Control (MAC) protocol. The performance of an IEEE 802.11 based backhaul network is greatly affected by the MAC contention and congestion in the network. If the sources pump data into the network than can be supported, loss rate increases due to MAC contention and congestion in the network. This also leads to the problem of unfairness among flows. In this paper, we propose a Link Layer Adaptive Pacing (LLAP) scheme that adaptively controls the offered load into the network. This improves the performance of higher layer protocols without any modifications to them. Our LLAP scheme estimates the four hop transmission delay in the network path without incurring any additional overhead (Control packets) and accordingly paces the packet transmissions to reduce MAC contentions in the network. We implement the LLAP scheme in ns-2.29 network simulator and extensively study its performance for both User Datagram. Protocol (UDP) and Transmission Control Protocol (TCP) traffic in different network scenarios. In all the cases, our scheme shows a significant improvement in the performance of both UDP and TCP traffic. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A link layer adaptive pacing scheme for improving throughput of transport protocols in wireless mesh networks", "paper_id": "WOS:000256133200004"}