{"auto_keywords": [{"score": 0.046254449751873136, "phrase": "software_system"}, {"score": 0.02104244264407225, "phrase": "regional_competitiveness"}, {"score": 0.006431020431155486, "phrase": "delphi_method"}, {"score": 0.00481495049065317, "phrase": "gis-based_regional_competitiveness_evaluating_system"}, {"score": 0.003954837422946628, "phrase": "evaluating_methodologies"}, {"score": 0.0035918768194006735, "phrase": "deep_insight"}, {"score": 0.003408091901859624, "phrase": "system_theory"}, {"score": 0.0033636292024305406, "phrase": "thorough_investigation"}, {"score": 0.0031498398446368056, "phrase": "software_designing_demands"}, {"score": 0.002749980017065414, "phrase": "primary_experimental_study"}, {"score": 0.0025977683486111554, "phrase": "gis"}, {"score": 0.0025750928944698673, "phrase": "database_techniques"}, {"score": 0.002443206010337041, "phrase": "system_performance"}, {"score": 0.002328238264850759, "phrase": "corresponding_data"}, {"score": 0.002297831085501592, "phrase": "main_limitations"}], "paper_keywords": ["Cybernetics", " Systems theory", " China", " Regional development", " Research work", " Computer software"], "paper_abstract": "Purpose - The purpose of this paper is to propose a GIS-based regional competitiveness evaluating software system. With a regional competitiveness evaluating software system, researchers can compare their studies with each other, so that more generally accepted concepts, models, and evaluating methodologies can be obtained. Furthermore, such a system can facilitate researchers to conduct studies more efficiently and effectively, so that a deep insight into regional competitiveness can be achieved. Design/methodology/approach - Based on the system theory, a thorough investigation into the nature of a region and its competitiveness are conducted, so that the software designing demands are identified and a client/server and browser/server architecture is proposed for the system. In addition, the Delphi method is employed to improve the performance of the software system, while a primary experimental study is conducted to verify its effectiveness. Findings - Developing such a software system, the GIS and database techniques should be harnessed, while Delphi method should be employed to improve system performance. Research limitations/implications - Identifying evaluating index set and obtaining corresponding data are the main limitations of the system working. Practical implications - The ideology of designing a regional competitiveness evaluating software system is proposed. Originality/value - An efficient and generic methodology of evaluating regional competitiveness is devised.", "paper_title": "Designing a GIS-based regional competitiveness evaluating system", "paper_id": "WOS:000280732800019"}