{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "analyze_neural_correlates_of"}, {"score": 0.00474946741204285, "phrase": "virtual_reality_experiences"}, {"score": 0.004621148492564008, "phrase": "virtual_reality"}, {"score": 0.004237138632255772, "phrase": "virtual_world"}, {"score": 0.004066498558415824, "phrase": "functional_magnetic_resonance_imaging"}, {"score": 0.003849579089885659, "phrase": "automatic_navigation"}, {"score": 0.0037971749182744334, "phrase": "virtual_environment"}, {"score": 0.0037284065559949064, "phrase": "present_work"}, {"score": 0.0034813964296826973, "phrase": "vr-free_navigation_task"}, {"score": 0.0031917943932454314, "phrase": "main_goal"}, {"score": 0.002493333098814506, "phrase": "free_virtual_navigation"}, {"score": 0.0024147474002390763, "phrase": "dorsolateral_prefrontal_cortex"}, {"score": 0.0022649119108225564, "phrase": "postcentral_parietal_cortex"}, {"score": 0.0022136780933978612, "phrase": "parametric_increased_activation"}, {"score": 0.0021735249249471614, "phrase": "condition-related_sense"}, {"score": 0.0021049977753042253, "phrase": "stimulus_attention"}], "paper_keywords": ["presence", " virtual reality", " human computer interaction (HCI)"], "paper_abstract": "In the field of virtual reality (VR), many efforts have been made to analyze presence, the sense of being in the virtual world. However, it is only recently that functional magnetic resonance imaging (fMRI) has been used to study presence during an automatic navigation through a virtual environment. In the present work, our aim was to use fMRI to study the sense of presence during a VR-free navigation task, in comparison with visualization of photographs and videos (automatic navigations through the same environment). The main goal was to analyze the usefulness of fMRI for this purpose, evaluating whether, in this context, the interaction between the subject and the environment is performed naturally, hiding the role of technology in the experience. We monitored 14 right-handed healthy females aged between 19 and 25 years. Frontal, parietal and occipital regions showed their involvement during free virtual navigation. Moreover, activation in the dorsolateral prefrontal cortex was also shown to be negatively correlated to sense of presence and the postcentral parietal cortex and insula showed a parametric increased activation according to the condition-related sense of presence, which suggests that stimulus attention and self-awareness processes related to the insula may be linked to the sense of presence.", "paper_title": "An fMRI Study to Analyze Neural Correlates of Presence during Virtual Reality Experiences", "paper_id": "WOS:000334363300006"}