{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "lexical_semantic_relatedness"}, {"score": 0.004614643339546038, "phrase": "important_task"}, {"score": 0.004571269461883144, "phrase": "natural_language_processing"}, {"score": 0.004258644418211771, "phrase": "extensive_amount"}, {"score": 0.003948613642680196, "phrase": "up-to-date_survey"}, {"score": 0.003459191419478298, "phrase": "background_information_resources"}, {"score": 0.00314708280192844, "phrase": "recent_methods"}, {"score": 0.0030590445140753187, "phrase": "previous_surveys"}, {"score": 0.0029039692582303904, "phrase": "biomedical_domain"}, {"score": 0.0028766278519176355, "phrase": "novel_methods"}, {"score": 0.0027567336518542858, "phrase": "domain_boundaries"}, {"score": 0.002641823250595624, "phrase": "lexical_semantic_relatedness_methods"}, {"score": 0.002580061425699194, "phrase": "useful_lessons"}, {"score": 0.0023139986108451967, "phrase": "future_research_directions"}, {"score": 0.002196609505859369, "phrase": "valuable_reference"}, {"score": 0.0021049977753042253, "phrase": "research_activities"}], "paper_keywords": [""], "paper_abstract": "Measuring lexical semantic relatedness is an important task in Natural Language Processing (NLP). It is often a prerequisite to many complex NLP tasks. Despite an extensive amount of work dedicated to this area of research, there is a lack of an up-to-date survey in the field. This paper aims to address this issue with a study that is focused on four perspectives: (i) a comparative analysis of background information resources that are essential for measuring lexical semantic relatedness; (ii) a review of the literature with a focus on recent methods that are not covered in previous surveys; (iii) discussion of the studies in the biomedical domain where novel methods have been introduced but inadequately communicated across the domain boundaries; and (iv) an evaluation of lexical semantic relatedness methods and a discussion of useful lessons for the development and application of such methods. In addition, we discuss a number of issues in this field and suggest future research directions. It is believed that this work will be a valuable reference to researchers of lexical semantic relatedness and substantially support the research activities in this field.", "paper_title": "Recent advances in methods of lexical semantic relatedness - a survey", "paper_id": "WOS:000323844500001"}