{"auto_keywords": [{"score": 0.03884976197665516, "phrase": "modified_fuzzy_art"}, {"score": 0.004720419202969916, "phrase": "modified_fuzzy_adaptive_resonance_theory"}, {"score": 0.00462773520532301, "phrase": "vast_and_miscellaneous_contents"}, {"score": 0.00424659225577246, "phrase": "relevant_subset"}, {"score": 0.004054479957160662, "phrase": "incremental_clustering_capability"}, {"score": 0.00400119808662365, "phrase": "fuzzy_adaptive_resonance_theory"}, {"score": 0.0029903851294825023, "phrase": "small-world_network_structure"}, {"score": 0.0028739078688746374, "phrase": "modified_fuzzy_art_net"}, {"score": 0.0026194209399161184, "phrase": "reverse_selection_mechanism"}, {"score": 0.00250073564820402, "phrase": "semantic_long-range_edges"}, {"score": 0.002234358539133758, "phrase": "small_diameter"}, {"score": 0.002175913488493802, "phrase": "information_retrieval_performance"}, {"score": 0.0021049977753042253, "phrase": "random_topology"}], "paper_keywords": [""], "paper_abstract": "Considering vast and miscellaneous contents in P2P system, intelligent P2P network topology is required to route queries to a relevant subset of peers. Based on the incremental clustering capability of Fuzzy Adaptive Resonance Theory (Fuzzy ART), this paper made use of the modified fuzzy ART to provide small-world P2P construction mechanism, which was not only to categorize peers so that all the peers in a cluster were semantically similar, but, more important, to construct the P2P topology into small-world network structure. In detail, the modified fuzzy ART net was used to cluster peer into one or more appropriate categories according to its data interest, and the reverse selection mechanism in modified fuzzy ART was provided to construct semantic long-range edges among clusters. Simulations demonstrated that P2P small-world network emerged, i. e., highly clustered networks with small diameter, and the information retrieval performance was significantly higher than random topology.", "paper_title": "On studying P2P topology based on modified fuzzy adaptive resonance theory", "paper_id": "WOS:000240083300050"}