{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adverse_effects"}, {"score": 0.004784909348794283, "phrase": "diverse_classes"}, {"score": 0.004608539830653038, "phrase": "late-phase_failure"}, {"score": 0.004536976344964643, "phrase": "marketed_drugs"}, {"score": 0.0043560464825349275, "phrase": "cardiac_arrhythmia"}, {"score": 0.004169226023596022, "phrase": "potential_drugs"}, {"score": 0.003990385737207714, "phrase": "computational_approaches"}, {"score": 0.003891644355886145, "phrase": "tdp"}, {"score": 0.0037246656582642272, "phrase": "organized_databases"}, {"score": 0.003666776809252461, "phrase": "newer_computational_approaches"}, {"score": 0.003531474887552889, "phrase": "prediction_method"}, {"score": 0.003487489029588045, "phrase": "support_machine_vector_algorithm"}, {"score": 0.003234806486611361, "phrase": "drug_molecule"}, {"score": 0.0030097975788892896, "phrase": "novel_pattern-recognition_method"}, {"score": 0.0028625406368744995, "phrase": "hybrid_approach"}, {"score": 0.0027054473441439422, "phrase": "prediction_accuracy"}, {"score": 0.002477998427152547, "phrase": "generic_nature"}, {"score": 0.002371531125700046, "phrase": "prediction_accuracies"}, {"score": 0.0023200213317312577, "phrase": "best_receiver_operating_characteristics"}, {"score": 0.002248366278757655, "phrase": "best_roc_value"}, {"score": 0.0021182494144182805, "phrase": "wide_applicability"}, {"score": 0.0021049977753042253, "phrase": "toxicity_prediction"}], "paper_keywords": [""], "paper_abstract": "Unforeseen adverse effects exhibited by drugs contribute heavily to late-phase failure and even withdrawal of marketed drugs. Torsade de pointes (TdP) is one such important adverse effect, which causes cardiac arrhythmia and, in some cases, sudden death, making it crucial for potential drugs to be screened for torsadogenicity. The need to tap the power of computational approaches for the prediction of adverse effects such as TdP is increasingly becoming evident. The availability of screening data including those in organized databases greatly facilitates exploration of newer computational approaches. In this paper, we report the development of a prediction method based on a support machine vector algorithm. The method uses a combination of descriptors, encoding both the type of toxicophore as well as the position of the toxicophore in the drug molecule, thus considering both the pharmacophore and the three-dimensional shape information of the molecule. For delineating toxicophores, a novel pattern-recognition method that utilizes substructures within a molecule has been developed. The results obtained using the hybrid approach have been compared with those available in the literature for the same data set. An improvement in prediction accuracy is clearly seen, with the accuracy reaching up to 97% in predicting compounds that can cause TdP and 90% for predicting compounds that do not cause TdP. The generic nature of the method has been demonstrated with four data sets available for carcinogenicity, where prediction accuracies were significantly higher, with a best receiver operating characteristics (ROC) value of 0.81 as against a best ROC value of 0.7 reported in the literature for the same data set. Thus, the method holds promise for wide applicability in toxicity prediction.", "paper_title": "Substructure-based support vector machine classifiers for prediction of adverse effects in diverse classes of drugs", "paper_id": "WOS:000242298100026"}