{"auto_keywords": [{"score": 0.0283519704158407, "phrase": "consolidated_model"}, {"score": 0.00481495049065317, "phrase": "important_quality_factor"}, {"score": 0.004782848614014638, "phrase": "interactive_software_systems"}, {"score": 0.00473509474652851, "phrase": "traditional_guis-style_applications"}, {"score": 0.004579316323166273, "phrase": "mobile_and_pda_interactive_services"}, {"score": 0.004458375125223899, "phrase": "single_largest_reasons"}, {"score": 0.004413846562278824, "phrase": "interactive_systems_-_computers"}, {"score": 0.004326113419290302, "phrase": "actual_use"}, {"score": 0.003992207640169795, "phrase": "easy_task"}, {"score": 0.0037713445867641393, "phrase": "single_conceptual_framework"}, {"score": 0.0035986297631077566, "phrase": "hci."}, {"score": 0.0034341191048285822, "phrase": "iso"}, {"score": 0.003243726030199957, "phrase": "usability_standards"}, {"score": 0.002953261517737546, "phrase": "existing_usability_standards"}, {"score": 0.002539802613867161, "phrase": "quim_model"}, {"score": 0.0024643161985886085, "phrase": "specific_facet"}, {"score": 0.0023990982005125763, "phrase": "existing_standard"}, {"score": 0.0021549993521153663, "phrase": "quim"}, {"score": 0.0021049977753042253, "phrase": "usability_measurement_theory"}], "paper_keywords": ["usability", " measurement", " metrics", " effectiveness", " efficiency", " user satisfaction", " software engineering quality models"], "paper_abstract": "Usability is increasingly recognized as an important quality factor for interactive software systems, including traditional GUIs-style applications, Web sites, and the large variety of mobile and PDA interactive services. Unusable user interfaces are probably the single largest reasons why encompassing interactive systems - computers plus people, fail in actual use. The design of this diversity of applications so that they actually achieve their intended purposes in term of ease of use is not an easy task. Although there are many individual methods for evaluating usability; they are not well integrated into a single conceptual framework that facilitate their usage by developers who are not trained in the filed of HCI. This is true in part because there are now several different standards (e.g., ISO 9241, ISO/IEC 9126, IEEE Std.610.12) or conceptual models (e.g., Metrics for Usability Standards in Computing [MUSiC]) for usability, and not all of these standards or models describe the same operational definitions and measures. This paper first reviews existing usability standards and models while highlighted the limitations and complementarities of the various standards. It then explains how these various models can be unified into a single consolidated, hierarchical model of usability measurement. This consolidated model is called Quality in Use Integrated Measurement (QUIM). Included in the QUIM model are 10 factors each of which corresponds to a specific facet of usability that is identified in an existing standard or model. These 10 factors are decomposed into a total of 26 sub-factors or measurable criteria that are furtherdecomposed into 127 specific metrics. The paper explains also how a consolidated model, such as QUIM, can help in developing a usability measurement theory.", "paper_title": "Usability measurement and metrics: A consolidated model", "paper_id": "WOS:000237510200006"}