{"auto_keywords": [{"score": 0.037027986132972215, "phrase": "structured_form"}, {"score": 0.015631983754052146, "phrase": "structured_abstracts"}, {"score": 0.012387009794094168, "phrase": "inexperienced_authors"}, {"score": 0.00481495049065317, "phrase": "computing_projects"}, {"score": 0.004720526055343478, "phrase": "previous_work"}, {"score": 0.004575854901681043, "phrase": "greater_completeness"}, {"score": 0.0043362886339595366, "phrase": "academic_year"}, {"score": 0.004299621153829837, "phrase": "durham_university's_computer_science_department"}, {"score": 0.004227209809791869, "phrase": "project_report"}, {"score": 0.004086010164600727, "phrase": "'traditional_dissertation"}, {"score": 0.003882970272082245, "phrase": "structured_abstract"}, {"score": 0.0036380913496453994, "phrase": "good_abstracts"}, {"score": 0.0034768766116014672, "phrase": "conventional_form"}, {"score": 0.0034279721355412285, "phrase": "controlled_quasi-experiment"}, {"score": 0.003157547760145984, "phrase": "final_year_students"}, {"score": 0.002916650173868229, "phrase": "previous_experimental_studies"}, {"score": 0.0025383451160985488, "phrase": "mean_score"}, {"score": 0.002474380950654509, "phrase": "minimum_goal"}, {"score": 0.0021965026903942486, "phrase": "technical_abstracts"}], "paper_keywords": ["Evidence-based", " Systematic literature review", " Structured abstract"], "paper_abstract": "Previous work has demonstrated that the use of structured abstracts can lead to greater completeness and clarity of information, making it easier for researchers to extract information about a study. In academic year 2007/08, Durham University's Computer Science Department revised the format of the project report that final year students were required to write, from a 'traditional dissertation' format, using a conventional abstract, to that of a 20-page technical paper, together with a structured abstract. This study set out to determine whether inexperienced authors (students writing their final project reports for computing topics) find it easier to produce good abstracts, in terms of completeness and clarity, when using a structured form rather than a conventional form. We performed a controlled quasi-experiment in which a set of 'judges' each assessed one conventional and one structured abstract for its completeness and clarity. These abstracts were drawn from those produced by four cohorts of final year students: two preceding the change, and the two following. The assessments were performed using a form of checklist that is similar to those used for previous experimental studies. We used 40 abstracts (10 per cohort) and 20 student 'judges' to perform the evaluation. Scored on a scale of 0.1-1.0, the mean for completeness increased from 0.37 to 0.61 when using a structured form. For clarity, using a scale of 1-10, the mean score increased from 5.1 to 7.2. For a minimum goal of scoring 50% for both completeness and clarity, only 3 from 19 conventional abstracts achieved this level, while only 3 from 20 structured abstracts failed to reach it. We conclude that the use of a structured form for organising the material of an abstract can assist inexperienced authors with writing technical abstracts that are clearer and more complete than those produced without the framework provided by such a mechanism.", "paper_title": "Reporting computing projects through structured abstracts: a quasi-experiment", "paper_id": "WOS:000288217800003"}