{"auto_keywords": [{"score": 0.04479584149294062, "phrase": "user's_activity"}, {"score": 0.00481495049065317, "phrase": "mobile_user"}, {"score": 0.004728122501822142, "phrase": "mobile_devices"}, {"score": 0.004332559296185432, "phrase": "mobile_device"}, {"score": 0.0038279459368975965, "phrase": "user's_degree"}, {"score": 0.003664196785572724, "phrase": "search_system"}, {"score": 0.0034946693480479712, "phrase": "current_activity"}, {"score": 0.003381905288924267, "phrase": "current_context"}, {"score": 0.003213660268958121, "phrase": "content_search_system"}, {"score": 0.0031671412657333364, "phrase": "mobile_user's_activity"}, {"score": 0.0030537595549694134, "phrase": "user's_operation_load"}, {"score": 0.002987682397171167, "phrase": "proposed_system_switches"}, {"score": 0.0029444248503861167, "phrase": "content_search_systems"}, {"score": 0.0028702214190712036, "phrase": "location-based_content_search_system"}, {"score": 0.0026878636586288363, "phrase": "menu-based_content_search_system"}, {"score": 0.0024987660207458555, "phrase": "user_context"}, {"score": 0.0024715695446993107, "phrase": "location-based_system"}, {"score": 0.002374351263279043, "phrase": "location-based_categories"}, {"score": 0.0023485057246680854, "phrase": "menu-based_system"}, {"score": 0.002247900207250435, "phrase": "user_experiments"}, {"score": 0.0021049977753042253, "phrase": "commercial_search_system"}], "paper_keywords": ["Mobile device", " Context awareness", " Mobile information access", " Content search"], "paper_abstract": "People routinely carry mobile devices in their daily lives and obtain a variety of information from the Internet in many different situations. In searching for information (content) with a mobile device, a user's activity (e.g., moving or stationary) and context (e.g., commuting in the morning or going downtown in the evening) often change, and such changes can affect the user's degree of concentration on his or her mobile device's display and information needs. Therefore, a search system should provide the user with an amount of information suitable for the current activity and a type of information suitable for the current context. In this study, we present the design and implementation of a content search system that considers a mobile user's activity and context, with the goal of reducing the user's operation load for content search. The proposed system switches between two kinds of content search systems according to the user's activity: the location-based content search system is activated when the user is stationary (e.g., standing and sitting), while a menu-based content search system is activated when the user is moving (e.g., walking). Both systems present information according to user context. The location-based system presents detailed information via menus and a map according to location-based categories. The menu-based system presents only a few options to enable users to get content easily. Through user experiments, we confirmed that participants could get desired information more easily with this system than with a commercial search system.", "paper_title": "A content search system considering the activity and context of a mobile user", "paper_id": "WOS:000323520500025"}