{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "liver_motion"}, {"score": 0.0044688500725247726, "phrase": "rapid_method"}, {"score": 0.004417848254181138, "phrase": "intraoperative_recovery"}, {"score": 0.0037188360359702182, "phrase": "additional_several_sequences"}, {"score": 0.0035722806911457545, "phrase": "respiration_cycles"}, {"score": 0.003277327351139926, "phrase": "laparoscopic_ultrasound_probe"}, {"score": 0.00290473242917264, "phrase": "liver_surface"}, {"score": 0.002444544487772349, "phrase": "image_planes"}, {"score": 0.0022041312401435346, "phrase": "proposed_method"}, {"score": 0.0021416404045850224, "phrase": "vivo_experiments"}, {"score": 0.0021049977753042253, "phrase": "pig_liver"}], "paper_keywords": [""], "paper_abstract": "This paper describes a rapid method for intraoperative recovery of liver motion and deformation due to respiration by using a laparoscopic freehand 3D ultrasound (US) system. Using the proposed method, 3D US images of the liver can be extended to 4D US images by acquiring additional several sequences of 2D US images during a couple of respiration cycles. Time-varying 2D US images are acquired on several sagittal image planes and their 3D positions and orientations are measured using a laparoscopic ultrasound probe to which a miniature magnetic 3D position sensor is attached. During the acquisition, the probe is assumed to move together with the liver surface. In-plane 2D deformation fields and respiratory phase are estimated from the time-varying 2D US images, and then the time-varying 3D deformation fields on the sagittal image planes are obtained by combining 3D positions and orientations of the image planes. The time-varying 3D deformation field of the volume is obtained by interpolating the 3D deformation fields estimated on several planes. The proposed method was evaluated by in vivo experiments using a pig liver.", "paper_title": "Recovery of liver motion and deformation due to respiration using laparoscopic freehand 3D ultrasound system", "paper_id": "WOS:000241556700046"}