{"auto_keywords": [{"score": 0.004560568143816105, "phrase": "similarity_measures"}, {"score": 0.0035824802350703376, "phrase": "common_subsequences"}, {"score": 0.003155784719225786, "phrase": "new_combinatorial_results"}, {"score": 0.003080449000295983, "phrase": "distinct_and_common_subsequences"}, {"score": 0.0030251262102203385, "phrase": "theoretical_results"}, {"score": 0.00291743479583421, "phrase": "effective_dynamic_programming_approach"}, {"score": 0.0026970382454914437, "phrase": "approximate_method"}, {"score": 0.002616762777413686, "phrase": "computation_process"}, {"score": 0.0025853238923610076, "phrase": "long_sequences"}, {"score": 0.002209319719984651, "phrase": "competitive_scores"}, {"score": 0.0021049977753042253, "phrase": "large_scale_sequential_data_analysis"}], "paper_keywords": [""], "paper_abstract": "Computing the similarity between sequences is a very important challenge for many different data mining tasks. There is a plethora of similarity measures for sequences in the literature, most of them being designed for sequences of items. In this work, we study the problem of measuring the similarity between sequences of itemsets. We focus on the notion of common subsequences as a way to measure similarity between a pair of sequences composed of a list of itemsets. We present new combinatorial results for efficiently counting distinct and common subsequences. These theoretical results are the cornerstone of an effective dynamic programming approach to deal with this problem. In addition, we propose an approximate method to speed up the computation process for long sequences. We have applied our method to various data sets: healthcare trajectories, online handwritten characters and synthetic data. Our results confirm that our measure of similarity produces competitive scores and indicate that our method is relevant for large scale sequential data analysis.", "paper_title": "On measuring similarity for sequences of itemsets", "paper_id": "WOS:000352642800005"}