{"auto_keywords": [{"score": 0.03559939432078799, "phrase": "total_data"}, {"score": 0.00481495049065317, "phrase": "data-collection_maturity_model"}, {"score": 0.00469159356595623, "phrase": "data_mining_methods"}, {"score": 0.004551647527068771, "phrase": "production_data"}, {"score": 0.004415857432588371, "phrase": "production_samples"}, {"score": 0.004247180402119585, "phrase": "statistical_view"}, {"score": 0.00403221710768334, "phrase": "production_system"}, {"score": 0.003911862375084159, "phrase": "manufacturing_environment"}, {"score": 0.003450213580299164, "phrase": "whole_course"}, {"score": 0.0034204548167213545, "phrase": "data_collection"}, {"score": 0.0030428787018636147, "phrase": "early_phase"}, {"score": 0.0028267701593809877, "phrase": "mature_phase"}, {"score": 0.0027422968723193057, "phrase": "sufficient_and_stable_knowledge"}, {"score": 0.0026488343783448273, "phrase": "oversized_phase"}, {"score": 0.0022562464662197867, "phrase": "neural_network_technologies"}, {"score": 0.0022174469839432013, "phrase": "manufacturing_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data mining", " Classification", " Data-collection maturity model", " Sample size", " Machine learning"], "paper_abstract": "Data mining methods have been successfully used for analyzing production data in manufacturing, and generally the production samples are considered derived from a population from the statistical view. However, the assumption is often challenged, because a production system is normally highly interrelated with a manufacturing environment that is time-dependent. Therefore, instead of treating data as elements from a population following a certain distribution, this research considers that, in the whole course of data collection, a total data set might reasonably be divided into three phases as a more accurate production profile: early phase, mature phase, and oversized phase. In the early phase, the data set is usually small and the information extracted is fragile; in the mature phase, the data collected can provide sufficient and stable knowledge to the management; and in the oversized phase, since the system has substantially changed, many old data are no longer current so that their representability has declined. Based on this concept, the two critical points that segment the total data set into three parts are systematically determined here using neural network technologies; and the manufacturing model can be reformed for advancing its predictive capability. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Estimation of a data-collection maturity model to detect manufacturing change", "paper_id": "WOS:000302032600044"}