{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "functional_classification"}, {"score": 0.004425616928975799, "phrase": "genome_analysis"}, {"score": 0.004207230913063179, "phrase": "popular_methods"}, {"score": 0.0036966717141736355, "phrase": "high-resolution_gene_functional_annotations"}, {"score": 0.0035141291835319682, "phrase": "genomic_neighborhood_information"}, {"score": 0.0033405704229694656, "phrase": "prokaryotic_genes"}, {"score": 0.003087419032091453, "phrase": "genomic_neighborhoods"}, {"score": 0.002984867789900281, "phrase": "prokaryotic_genomes"}, {"score": 0.00257831812581194, "phrase": "existing_popular_schemes"}, {"score": 0.0023827927890399357, "phrase": "higher_resolution"}, {"score": 0.0023296961971785357, "phrase": "functional_assignments"}, {"score": 0.0021049977753042253, "phrase": "different_genomes"}], "paper_keywords": ["functional classification of genes", " prokaryotes", " genomic neighborhood"], "paper_abstract": "Functional classification of genes represents one of the most basic problems in genome analysis and annotation. Our analysis of some of the popular methods for functional classification of genes shows that these methods are not always consistent with each other and may not be specific enough for high-resolution gene functional annotations. We have developed a method to integrate genomic neighborhood information of genes with their sequence similarity information for the functional classification of prokaryotic genes. The application of our method to 93 proteobacterial genomes has shown that (i) the genomic neighborhoods are much more conserved across prokaryotic genomes than expected by chance, and such conservation can be utilized to improve functional classification of genes; (ii) while our method is consistent with the existing popular schemes as much as they are among themselves, it does provide functional classification at higher resolution and hence allows functional assignments of (new) genes at a more specific level; and (iii) our method is fairly stable when being applied to different genomes. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "On application of directons to functional classification of genes in prokaryotes", "paper_id": "WOS:000256736500005"}