{"auto_keywords": [{"score": 0.03449254112778733, "phrase": "free_riders"}, {"score": 0.011563235440146268, "phrase": "malicious_file"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_file-sharing_networks"}, {"score": 0.004484908028307205, "phrase": "-sharing_applications"}, {"score": 0.0040708542958968605, "phrase": "ulterior_motive"}, {"score": 0.003916098498242888, "phrase": "malicious_files"}, {"score": 0.003623949225126944, "phrase": "malicious_peers"}, {"score": 0.0033971539563683174, "phrase": "reputation_systems"}, {"score": 0.002622947550220266, "phrase": "free-rider_aware_reputation_system"}, {"score": 0.0022897425998475362, "phrase": "easy_way"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Reputation system", " Free-riding", " Resource-sharing", " Peer-to-peer network", " Contribution-oriented"], "paper_abstract": "Recently, Peer-to-Peer (P2P) networks have widely been used to file-sharing applications due to their decentralized architecture and reliability. The popularization of P2P networks also provides peers with ulterior motive an ideal environment to spread malicious files. In the past, many reputation systems have been proposed to differentiate malicious peers and to stop malicious file spreading. However, these reputation systems do not concern with reducing free riders in P2P networks. Free riders are peers who just download files but do not share anything to other peers. They significantly destroy the philosophy of P2P file-sharing networks. In this paper, we propose a free-rider aware reputation system for P2P file-sharing networks. Indeed, our reputation system can degrade the willing of free riders. Compared to most existing reputation systems, our reputation system provides an easy way to reduce malicious file spreading and free riding. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A free-rider aware reputation system for peer-to-peer file-sharing networks", "paper_id": "WOS:000284863200125"}