{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "effective_focal_length"}, {"score": 0.008631261966459141, "phrase": "central_catadioptric_cameras"}, {"score": 0.006738110058775903, "phrase": "paracatadioptric_cameras"}, {"score": 0.004656647251517823, "phrase": "camera_calibration"}, {"score": 0.004612376827433774, "phrase": "focal_length"}, {"score": 0.004313996835376177, "phrase": "prior_information"}, {"score": 0.004034841146538891, "phrase": "polynomial_constraint"}, {"score": 0.003791763445590174, "phrase": "polynomial_degree"}, {"score": 0.0031921317979928406, "phrase": "polynomial_one"}, {"score": 0.002859533151305368, "phrase": "simple_method"}, {"score": 0.0026361219160332626, "phrase": "proposed_method"}, {"score": 0.002598543802992702, "phrase": "conic_fitting"}, {"score": 0.0025737890313763407, "phrase": "line_images"}, {"score": 0.0024417832296664698, "phrase": "calibration_accuracy"}, {"score": 0.00220823903315848, "phrase": "simulated_and_real_data"}], "paper_keywords": ["Camera calibration", " Central catadioptric camera", " Focal length estimation"], "paper_abstract": "In camera calibration, focal length is the most important parameter to be estimated, while other parameters can be obtained by prior information about scene or system configuration. In this paper, we present a polynomial constraint on the effective focal length with the condition that all the other parameters are known. The polynomial degree is 4 for paracatadioptric cameras and 16 for other catadioptric cameras. However, if the skew is 0 or the ratio between the skew and effective focal length is known, the constraint becomes a linear one or a polynomial one with degree 4 on the effective focal length square for paracatadioptric cameras and other catadioptric cameras, respectively. Based on this constraint, we propose a simple method for estimation of the effective focal length of central catadioptric cameras. Unlike many approaches using lines in literature, the proposed method needs no conic fitting of line images, which is error-prone and highly affects the calibration accuracy. It is easy to implement, and only a single view of one space line is enough with no other space information needed. Experiments on simulated and real data show this method is robust and effective. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Calibrating effective focal length for central catadioptric cameras using one space line", "paper_id": "WOS:000301212400019"}