{"auto_keywords": [{"score": 0.03585763428068606, "phrase": "moore"}, {"score": 0.004757643419056999, "phrase": "individual_adoption"}, {"score": 0.004562362497952548, "phrase": "critical_concern"}, {"score": 0.004322967486451877, "phrase": "widespread_integration"}, {"score": 0.004043985765074428, "phrase": "pci"}, {"score": 0.003611751858608048, "phrase": "perceived_characteristics"}, {"score": 0.003361069456060196, "phrase": "benbasat"}, {"score": 0.003109031770476385, "phrase": "additional_empirical_research"}, {"score": 0.002893140560765452, "phrase": "pci_constructs"}, {"score": 0.002724696729311532, "phrase": "users'_behavior"}, {"score": 0.002597012212823168, "phrase": "greater_theoretical_clarity"}, {"score": 0.00240213106042981, "phrase": "extended_theoretical_model"}, {"score": 0.0022085455097790537, "phrase": "complex_web"}], "paper_keywords": [""], "paper_abstract": "Individual adoption and use of technology remains a critical concern for both managers and professionals. Despite the widespread integration of technology into work and organizations, there remain many opportunities for individuals to either extend or limit their use of IT at work. This paper extends work on the Perceived Characteristics of Innovating (PCI), as defined by Moore and Benbasat in 1991. Building on studies over the past ten years as well as on additional empirical research, we provide two contributions - a reconceptualization and refinement of the PCI constructs, and an extended theoretical model of their influence on users' behavior. The construct refinements aim to provide greater theoretical clarity and to address challenges in the measurement of the constructs. The extended theoretical model provides a more complete picture of the influence of the PCIs, by considering the complex web of relationships among them in addition to their potential direct effects on usage.", "paper_title": "From prediction to explanation: Reconceptualizing and extending the Perceived Characteristics of Innovating", "paper_id": "WOS:000251611100001"}