{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "zombie_pcs"}, {"score": 0.010495767591800056, "phrase": "email_spam_analysis"}, {"score": 0.009786074707641703, "phrase": "email_spam"}, {"score": 0.004372712391262538, "phrase": "spam_filtering_systems"}, {"score": 0.003970930401776528, "phrase": "spamming_activities"}, {"score": 0.0037560869590718966, "phrase": "ip_blocking"}, {"score": 0.003500499265190562, "phrase": "multiple_purposes"}, {"score": 0.0031904205547902695, "phrase": "\"group_pollution_level"}, {"score": 0.0031668306413359794, "phrase": "-_the_degree"}, {"score": 0.0030514638431036714, "phrase": "botnet_-_and_\"ip_pollution_level"}, {"score": 0.002929394386754424, "phrase": "spam_group"}, {"score": 0.0028648759706752162, "phrase": "zombie_pc."}, {"score": 0.0027299058905736456, "phrase": "spam_mails"}, {"score": 0.002689666606553487, "phrase": "url_links"}, {"score": 0.0026012779346272848, "phrase": "pollution_level"}, {"score": 0.002543967677678384, "phrase": "ip_address"}, {"score": 0.0025157865918985704, "phrase": "empirical_testing"}, {"score": 0.0024786956187352327, "phrase": "email_spam_data"}, {"score": 0.0024421501497321027, "phrase": "\"email_spam_trap_system"}, {"score": 0.0024240794798626674, "phrase": "korea's_national_spam_collection_system"}, {"score": 0.0021049977753042253, "phrase": "dramatic_reduction"}], "paper_keywords": ["Bot-net", " internet worm", " malware", " email spam", " zombie PC"], "paper_abstract": "While botnets are used for various malicious activities, it is well known that they are widely used for email spam. Though the spam filtering systems currently in use block IPs that send email spam, simply blocking the IPs of zombie PCs participating in a botnet is not enough to prevent the spamming activities of the botnet because these IPs can easily be changed or manipulated. This IP blocking is also insufficient to prevent crimes other than spamming, as the botnet can be simultaneously used for multiple purposes. For this reason, we propose a system that detects botnets and zombie PCs based on email spam analysis. This study introduces the concept of \"group pollution level\" - the degree to which a certain spam group is suspected of being a botnet - and \"IP pollution level\" - the degree to which a certain IP in the spam group is suspected of being a zombie PC. Such concepts are applied in our system that detects botnets and zombie PCs by grouping spam mails based on the URL links or attachments contained, and by assessing the pollution level of each group and each IP address. For empirical testing, we used email spam data collected in an \"email spam trap system\" Korea's national spam collection system. Our proposed system detected 203 botnets and 18,283 zombie PCs in a day and these zombie PCs sent about 70% of all the spam messages in our analysis. This shows the effectiveness of detecting zombie PCs by email spam analysis, and the possibility of a dramatic reduction in email spam by taking countermeasure against these botnets and zombie PCs.", "paper_title": "Detection of Zombie PCs Based on Email Spam Analysis", "paper_id": "WOS:000305237200011"}