{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "information_retrieval"}, {"score": 0.004774530554776604, "phrase": "standard_approach"}, {"score": 0.004219076936280787, "phrase": "meaningful_statistical_or_linguistic_relation"}, {"score": 0.004160177106153782, "phrase": "graph_theoretic_computations"}, {"score": 0.0038128448094757145, "phrase": "principled_graph-theoretic_approach"}, {"score": 0.0037595947142663997, "phrase": "computing_term_weights"}, {"score": 0.0036966717141736355, "phrase": "discourse_aspects"}, {"score": 0.0036347979916389467, "phrase": "text_graph"}, {"score": 0.0035439168845104586, "phrase": "grammatical_modification"}, {"score": 0.00350425549695367, "phrase": "graph_ranking_computations"}, {"score": 0.003474799999519295, "phrase": "pagerank_page_et_al"}, {"score": 0.0034359094594153304, "phrase": "pagerank_citation_ranking"}, {"score": 0.0033311827561285194, "phrase": "stanford_digital_library_technologies_project"}, {"score": 0.0030101827310631915, "phrase": "document_length"}, {"score": 0.002984867789900281, "phrase": "existing_term_weights"}, {"score": 0.002861441830192181, "phrase": "existing_ir_ranking_functions"}, {"score": 0.002766375783665791, "phrase": "tuned_ranking_baseline"}, {"score": 0.002689564715486338, "phrase": "nist_special_publication"}, {"score": 0.0025710670135348198, "phrase": "ranking_graph_properties"}, {"score": 0.002535115422089855, "phrase": "average_path_length"}, {"score": 0.0024786330057813225, "phrase": "different_aspects"}, {"score": 0.0022777800735119405, "phrase": "discourse_coherence"}], "paper_keywords": ["Information retrieval", " Graph theory", " Natural language processing"], "paper_abstract": "A standard approach to Information Retrieval (IR) is to model text as a bag of words. Alternatively, text can be modelled as a graph, whose vertices represent words, and whose edges represent relations between the words, defined on the basis of any meaningful statistical or linguistic relation. Given such a text graph, graph theoretic computations can be applied to measure various properties of the graph, and hence of the text. This work explores the usefulness of such graph-based text representations for IR. Specifically, we propose a principled graph-theoretic approach of (1) computing term weights and (2) integrating discourse aspects into retrieval. Given a text graph, whose vertices denote terms linked by co-occurrence and grammatical modification, we use graph ranking computations (e.g. PageRank Page et al. in The pagerank citation ranking: Bringing order to the Web. Technical report, Stanford Digital Library Technologies Project, 1998) to derive weights for each vertex, i.e. term weights, which we use to rank documents against queries. We reason that our graph-based term weights do not necessarily need to be normalised by document length (unlike existing term weights) because they are already scaled by their graph-ranking computation. This is a departure from existing IR ranking functions, and we experimentally show that it performs comparably to a tuned ranking baseline, such as BM25 (Robertson et al. in NIST Special Publication 500-236: TREC-4, 1995). In addition, we integrate into ranking graph properties, such as the average path length, or clustering coefficient, which represent different aspects of the topology of the graph, and by extension of the document represented as a graph. Integrating such properties into ranking allows us to consider issues such as discourse coherence, flow and density during retrieval. We experimentally show that this type of ranking performs comparably to BM25, and can even outperform it, across different TREC (Voorhees and Harman in TREC: Experiment and evaluation in information retrieval, MIT Press, 2005) datasets and evaluation measures.", "paper_title": "Graph-based term weighting for information retrieval", "paper_id": "WOS:000299920200003"}