{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "fish_species_richness"}, {"score": 0.004460309246062286, "phrase": "generalized_linear_models"}, {"score": 0.003769006950727621, "phrase": "fish_species"}, {"score": 0.0034556603183020407, "phrase": "predictive_performance"}, {"score": 0.0033685408148574876, "phrase": "relative_influence"}, {"score": 0.002964706925144123, "phrase": "total_model_deviance"}, {"score": 0.002889928791032578, "phrase": "single_variable"}, {"score": 0.0028026735035370206, "phrase": "larger_amount"}, {"score": 0.0027459678326877744, "phrase": "relative_deviance"}, {"score": 0.0024289743270061157, "phrase": "modelling_technique"}, {"score": 0.002392008392892289, "phrase": "tree-based_models"}, {"score": 0.002367689104782196, "phrase": "cart"}, {"score": 0.0023435948529924294, "phrase": "brt"}, {"score": 0.0023079225317714815, "phrase": "lower_prediction_errors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Predictive modelling", " Species richness", " Estuaries", " GLM", " GAM", " CART", " BRT"], "paper_abstract": "Four different modelling techniques were compared and evaluated: generalized linear models (GLM), generalized additive models (GAM), classification and regression trees (CART) and boosted regression trees (BRT). Each method was used to model fish species richness variation throughout several Portuguese estuarine systems. Model comparisons were based on goodness-of-fit and predictive performance via cross-validation. The relative influence of the most important predictors according to each of the four models was also examined. Fitted BRT, CART, GAM and GLM models accounted for 70.6%, 57.0%, 34.6% and 23.7% of total model deviance, respectively. No single variable was consistently responsible for the larger amount of percentage of relative deviance explained by the models, but several variables were selected by the four models. Nevertheless, their relative importance was highly variable, according to each modelling technique. The tree-based models (CART and BRT) presented lower prediction errors after cross-validation. The limitations and usefulness of each technique are discussed. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Predicting fish species richness in estuaries: Which modelling technique to use?", "paper_id": "WOS:000349876500003"}