{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-attribute_group_decision"}, {"score": 0.0367698002611785, "phrase": "intuitionistic_trapezoid_fuzzy_linguistic_power"}, {"score": 0.027818117377314964, "phrase": "proposed_operators"}, {"score": 0.0047057084749407485, "phrase": "intuitionistic_trapezoid_fuzzy_linguistic_power_aggregation_operators"}, {"score": 0.004417848254181138, "phrase": "attribute_values"}, {"score": 0.004317576641196539, "phrase": "decision_makers"}, {"score": 0.0039841418890102925, "phrase": "input_arguments"}, {"score": 0.003916098498242888, "phrase": "new_power_aggregation_operators"}, {"score": 0.0038713805573219297, "phrase": "intuitionistic_trapezoid_fuzzy_linguistic_power_average"}, {"score": 0.0023079225317714815, "phrase": "magdm_problems"}, {"score": 0.0022815262950738814, "phrase": "intuitionistic_trapezoid_fuzzy_linguistic_information"}, {"score": 0.0022168460543913787, "phrase": "numerical_example"}, {"score": 0.0021049977753042253, "phrase": "proposed_approaches"}], "paper_keywords": ["Multi-attribute group decision making", " intuitionistic trapezoid fuzzy linguistic variable", " intuitionistic trapezoid fuzzy linguistic power average (ITrFLPA) operator", " intuitionistic trapezoid fuzzy linguistic power geometric (ITrFLPG) operator"], "paper_abstract": "We investigate the multi-attribute group decision making (MAGDM) problems in which the attribute values provided by the decision makers take the form of intuitionistic trapezoid fuzzy linguistic (ITrFL) information considering the uncertainty and inaccuracy of input arguments. Some new power aggregation operators called intuitionistic trapezoid fuzzy linguistic power average (ITrFLPA) operator, intuitionistic trapezoid fuzzy linguistic power weighted average (ITrFLPWA) operator, intuitionistic trapezoid fuzzy linguistic power ordered weighted average (ITrFLPOWA) operator, intuitionistic trapezoid fuzzy linguistic power hybrid weighted average (ITrFLPHWA) operator, intuitionistic trapezoid fuzzy linguistic power geometric (ITrFLPG) operator, intuitionistic trapezoid fuzzy linguistic power weighted geometric (ITrFLPWG) operator, intuitionistic trapezoid fuzzy linguistic power ordered weighted geometric (ITrFLPOWG) operator and intuitionistic trapezoid fuzzy linguistic power hybrid weighted geometric (ITrFLPHWG) operator are proposed. Then, we study some desirable properties of the proposed operators, such as idempotency, commutativity and boundedness. In addition, two novel approaches based on the proposed operators are developed to solve MAGDM problems with intuitionistic trapezoid fuzzy linguistic information. Finally, a numerical example is provided to verify the feasibility of the proposed approaches.", "paper_title": "Approaches for multi-attribute group decision making based on intuitionistic trapezoid fuzzy linguistic power aggregation operators", "paper_id": "WOS:000341191800039"}