{"auto_keywords": [{"score": 0.046030203640501983, "phrase": "empirical_study"}, {"score": 0.004831017836668847, "phrase": "algorithm"}, {"score": 0.004675565200598801, "phrase": "purpose_-_this_paper"}, {"score": 0.004360412703519539, "phrase": "consulting_firm"}, {"score": 0.00432859434761081, "phrase": "brazil"}, {"score": 0.004265354774450696, "phrase": "case_study"}, {"score": 0.0038342108263454628, "phrase": "sustainable_business"}, {"score": 0.0037643920253363776, "phrase": "good_knowledge"}, {"score": 0.003536346954940087, "phrase": "first_step"}, {"score": 0.003484721713676736, "phrase": "stakeholder_theory"}, {"score": 0.003132236287543072, "phrase": "fuzzy_logic_algorithm"}, {"score": 0.0027437235598539904, "phrase": "decision_making"}, {"score": 0.002713604305939145, "phrase": "qualitative_data"}, {"score": 0.0026155681847364483, "phrase": "particular_topic"}, {"score": 0.0024933837962398267, "phrase": "different_stakeholders"}, {"score": 0.0022575078732617678, "phrase": "paper's_main_contribution"}, {"score": 0.002159951198924152, "phrase": "sustainability_criteria"}, {"score": 0.0021049977753042253, "phrase": "useful_model"}], "paper_keywords": ["Fuzzy logic", " Sustainability", " Identification of stakeholders", " Stakeholder theory", " Theory of clans"], "paper_abstract": "Purpose - This paper aims to focus the research on the identification of stakeholders through an analysis of an empirical study by a consulting firm in Brazil. In this case study, the company needs to identify the stakeholders that can exert some influence in its sphere of activity. Design/methodology/approach - The paper considers the question: to do sustainable business, companies must have good knowledge of all actors with influence in their sphere of activity. This identification of stakeholders is the first step. Based on stakeholder theory, the authors discuss the importance of management with stakeholders in the pursuit of sustainability in business. To achieve this objective, the consultant hired has used fuzzy logic algorithm, applying the theory of clans. Findings - In applying the model through an empirical study, it has been possible to provide a tool based on the use of grouping algorithm that can facilitate decision making by obtaining qualitative data from a dialogue with managers or specialists on a particular topic. The model also serves to establish the level of relationship between different stakeholders and obtain affinities. Originality/value - The paper provides an innovative and a useful tool to be used in the process of identifying stakeholders. The paper's main contribution is the application of algorithms in the identification of stakeholders considering sustainability criteria in enterprises, and providing a useful model in making decisions.", "paper_title": "Algorithm applied in the identification of stakeholders", "paper_id": "WOS:000324449300004"}