{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cost-minimal_paths"}, {"score": 0.049759738849303216, "phrase": "goal-directed_navigation"}, {"score": 0.049442871815077706, "phrase": "partially_known_terrains"}, {"score": 0.03885478211962643, "phrase": "previous_searches"}, {"score": 0.0376189385107843, "phrase": "incremental_heuristic_search_algorithms"}, {"score": 0.03209030973473581, "phrase": "path-adaptive_a"}, {"score": 0.013543221681686942, "phrase": "freespace_assumption"}, {"score": 0.011320898134962003, "phrase": "current_search"}, {"score": 0.011097405231198374, "phrase": "adaptive_a"}, {"score": 0.009365730963086492, "phrase": "goal_state"}, {"score": 0.008390775287666774, "phrase": "tree-adaptive_a"}, {"score": 0.0047192824773697, "phrase": "situated_agents"}, {"score": 0.004641005983799053, "phrase": "search_problems"}, {"score": 0.004458375125223899, "phrase": "search_graphs"}, {"score": 0.004282900153232246, "phrase": "new_information"}, {"score": 0.003952316497572257, "phrase": "incremental_heuristic_search"}, {"score": 0.003860774424566198, "phrase": "resulting_sequences"}, {"score": 0.0038350096441245153, "phrase": "similar_search_problems"}, {"score": 0.0037713445867641393, "phrase": "classical_heuristic_search"}, {"score": 0.002743355746391485, "phrase": "provably_cost-minimal_path"}, {"score": 0.0026618355977665745, "phrase": "single_cost-minimal_path"}, {"score": 0.002213596068643924, "phrase": "first_incremental_heuristic_search_algorithm"}], "paper_keywords": ["Situated-agent", " Planning", " Path-planning", " Incremental-heuristic-search"], "paper_abstract": "Situated agents frequently need to solve search problems in partially known terrains in which the costs of the arcs of the search graphs can increase (but not decrease) when the agents observe new information. An example of such search problems is goal-directed navigation with the freespace assumption in partially known terrains, where agents repeatedly follow cost-minimal paths from their current locations to given goal locations. Incremental heuristic search is an approach for solving the resulting sequences of similar search problems potentially faster than with classical heuristic search, by reusing information from previous searches to speed up its current search. There are two classes of incremental heuristic search algorithms, namely those that make the -values of the current search more informed (such as Adaptive A*) and those that reuse parts of the A* search trees of previous searches during the current search (such as D* Lite). In this article, we introduce Path-Adaptive A* and its generalization Tree-Adaptive A*. Both incremental heuristic search algorithms terminate their searches before they expand the goal state, namely when they expand a state that is on a provably cost-minimal path to the goal. Path-Adaptive A* stores a single cost-minimal path to the goal state (the reusable path), while Tree-Adaptive A* stores a set of cost-minimal paths to the goal state (the reusable tree), and is thus potentially more efficient than Path-Adaptive A* since it uses information from all previous searches and not just the last one. Tree-Adaptive A* is the first incremental heuristic search algorithm that combines the principles of both classes of incremental heuristic search algorithms. We demonstrate experimentally that both Path-Adaptive A* and Tree-Adaptive A* can be faster than Adaptive A* and D* Lite, two state-of-the-art incremental heuristic search algorithms for goal-directed navigation with the freespace assumption.", "paper_title": "Reusing cost-minimal paths for goal-directed navigation in partially known terrains", "paper_id": "WOS:000357652000005"}