{"auto_keywords": [{"score": 0.04887471080843015, "phrase": "cognitive_load"}, {"score": 0.007913200260039336, "phrase": "lecture_capture"}, {"score": 0.007855987847272117, "phrase": "picture-in-picture_types"}, {"score": 0.00481495049065317, "phrase": "different_video_lecture_types"}, {"score": 0.004575740812937594, "phrase": "online_courseware"}, {"score": 0.004526041191525413, "phrase": "multimedia_materials"}, {"score": 0.004493207015584002, "phrase": "exactly_how_different_video_lecture_types_impact_student_performance"}, {"score": 0.004238929161010395, "phrase": "sustained_attention"}, {"score": 0.0040135756033094225, "phrase": "autonomous_online_learning_scenario"}, {"score": 0.003955523458325766, "phrase": "two-factor_experimental_design"}, {"score": 0.0038841330270679097, "phrase": "emotion-sensing_equipment"}, {"score": 0.0038559375376635047, "phrase": "cognitive_load_scale"}, {"score": 0.003800156761779008, "phrase": "performance_test_sheet"}, {"score": 0.0037725685596495355, "phrase": "analysis_results"}, {"score": 0.0030873424635143045, "phrase": "picture-in-picture_type"}, {"score": 0.002838993542880416, "phrase": "positive_and_negative_emotions"}, {"score": 0.0026296828616623994, "phrase": "voice-over_type"}, {"score": 0.0022315557620621205, "phrase": "video_lectures"}, {"score": 0.0021912115487610286, "phrase": "valuable_reference"}, {"score": 0.002167355210897559, "phrase": "video_lecture_types"}, {"score": 0.0021515951441422082, "phrase": "online_learning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Media in education", " Evaluation methodologies", " Distance education and telelearning", " Interactive learning environments"], "paper_abstract": "Although online courseware often includes multimedia materials, exactly how different video lecture types impact student performance has seldom been studied. Therefore, this study explores how three commonly used video lectures styles affect the sustained attention, emotion, cognitive load, and learning performance of verbalizers and visualizers in an autonomous online learning scenario by using a two-factor experimental design, brainwave detection, emotion-sensing equipment, cognitive load scale, and learning performance test sheet. Analysis results indicate that, while the three video lecture types enhance learning performance, learning performance with lecture capture and picture-in-picture types is superior to that associated with the voice-over type. Verbalizers and visualizers achieve the same learning performance with the three video types. Additionally, sustained attention induced by the voice-over type is markedly higher than that with the picture-in-picture type. Sustained attention of verbalizers is also significantly higher than that of visualizers when learning with the three video lectures. Moreover, the positive and negative emotions induced by the three video lectures do not appear to significantly differ from each other. Also, cognitive load related to the voice-over type is significantly higher than that with by the lecture capture and picture-in-picture types. Furthermore, the cognitive load for visualizers markedly exceeds that of verbalizers who are presented with the voice-over type. Results of this study significantly contribute to efforts to design of video lectures and also provide a valuable reference when selecting video lecture types for online learning. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Effects of different video lecture types on sustained attention, emotion, cognitive load, and learning performance", "paper_id": "WOS:000343844000011"}