{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "risk_management"}, {"score": 0.015566631018521397, "phrase": "virtual_enterprise"}, {"score": 0.013307855331821552, "phrase": "ve."}, {"score": 0.004515004397496303, "phrase": "important_issue"}, {"score": 0.004130165601475531, "phrase": "risk_management_model"}, {"score": 0.00393066798511457, "phrase": "distributed_decision_making"}, {"score": 0.0038919490570383662, "phrase": "ddm"}, {"score": 0.003421697038352743, "phrase": "decision_processes"}, {"score": 0.0028768722873689432, "phrase": "symmetry_information"}, {"score": 0.0027513507830537165, "phrase": "particle_swarm"}, {"score": 0.0026443691099806003, "phrase": "resulting_optimization_problem"}, {"score": 0.0025541693207036167, "phrase": "proposed_algorithm"}, {"score": 0.0024916260764216752, "phrase": "two-level_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Risk management", " Virtual Enterprise", " Distributed Decision Making", " Two-level model", " Particle Swarm Optimization"], "paper_abstract": "Risk management in a Virtual Enterprise (VE) is an important issue due to its agility and diversity of its members and its distributed characteristics. In this paper, we develop a risk management model for the VE. More specifically, we introduce a Distributed Decision Making (DDM) model for risk management of the VE. The model has two levels, namely, the top model and the base model, which describe the decision processes of the owner and the partners of the VE, respectively. It can be regarded as a combination of both the top-down and bottom-up approaches for risk management of the VE. Here we focus on the case of symmetry information between the owner and the partners. A Particle Swarm Optimization (PSO) algorithm is then designed to solve the resulting optimization problem. The result shows that the proposed algorithm is effective and the two-level model can help improve the description of the relationship between the owner and the partners, which is helpful to reduce the risk of the VE. Crown Copyright (C) 2011 Published by Elsevier Ltd. All rights reserved.", "paper_title": "A distributed decision making model for risk management of virtual enterprise", "paper_id": "WOS:000292169500132"}