{"auto_keywords": [{"score": 0.049435104149514145, "phrase": "pitch_accent_detection"}, {"score": 0.017206338297592563, "phrase": "posterior_probabilities"}, {"score": 0.010612387000973441, "phrase": "articulatory_features"}, {"score": 0.00414830454375092, "phrase": "accented_phonemes"}, {"score": 0.0037984549828326106, "phrase": "actual_articulatory_features"}, {"score": 0.0037219886365287085, "phrase": "direct_measurement"}, {"score": 0.0034780071331554003, "phrase": "multi-layer_perceptrons"}, {"score": 0.0032061793819537633, "phrase": "frame-level_acoustic_features"}, {"score": 0.0027804579695873827, "phrase": "articulatory_attributes"}, {"score": 0.002494361792853833, "phrase": "syllable-level_articulatory_features"}], "paper_keywords": ["Articulatory features", " Pitch accent detection", " Prosody", " Computer-aided language learning (CALL)", " Multi-layer perceptron (MLP)"], "paper_abstract": "Articulatory features describe how articulators are involved in making sounds. Speakers often use a more exaggerated way to pronounce accented phonemes, so articulatory features can be helpful in pitch accent detection. Instead of using the actual articulatory features obtained by direct measurement of articulators, we use the posterior probabilities produced by multi-layer perceptrons (MLPs) as articulatory features. The inputs of MLPs are frame-level acoustic features pre-processed using the split temporal context-2 (STC-2) approach. The outputs are the posterior probabilities of a set of articulatory attributes. These posterior probabilities are averaged piecewise within the range of syllables and eventually act as syllable-level articulatory features. This work is the first to introduce articulatory features into pitch accent detection. Using the articulatory features extracted in this way, together with other traditional acoustic features, can improve the accuracy of pitch accent detection by about 2%.", "paper_title": "Exploiting articulatory features for pitch accent detection", "paper_id": "WOS:000326925700003"}