{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "educational_agents"}, {"score": 0.01186818380831737, "phrase": "students'_motivation"}, {"score": 0.004760017604908536, "phrase": "surrogate_competition"}, {"score": 0.004652016085325825, "phrase": "competitive_educational_agents"}, {"score": 0.004342430078306461, "phrase": "researchers'_attention"}, {"score": 0.004219571240696568, "phrase": "major_reasons"}, {"score": 0.0037372949345155343, "phrase": "learning_performance"}, {"score": 0.0036553070575015344, "phrase": "higher_education"}, {"score": 0.003277327351139926, "phrase": "significant_element"}, {"score": 0.0029214769181390653, "phrase": "competitive_environments"}, {"score": 0.0028880836335117297, "phrase": "positive_effects"}, {"score": 0.0028550709503536494, "phrase": "students'_perception"}, {"score": 0.002574387911697005, "phrase": "integrative_agent"}, {"score": 0.002530359917257626, "phrase": "educational_and_competitive_elements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Interactive learning environments", " Multimedia/hypermedia systems"], "paper_abstract": "The design of educational agents increasingly attracts researchers' attention recently. One of major reasons is that educational agents could enhance student learning in various aspects. Although research in this area has mushroomed, such research mainly emphasizes on students in higher education. It is still unclear how educational agents influence young student learning. In addition, competition is a significant element, but fewer studies take competition into account while designing educational agents. Although some studies have indicated that educational agents in competitive environments has positive effects on students' perception and attribution, its impacts on students' motivation and performance are unclear. Thus, the study develops an integrative agent that combines educational and competitive elements for young students, and further examines its influences, in terms of motivation and learning performance. The results revealed that such competitive educational agents could enhance students' motivation and learning performance. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "When educational agents meet surrogate competition: Impacts of competitive educational agents on students' motivation and performance", "paper_id": "WOS:000335618000023"}