{"auto_keywords": [{"score": 0.0431832578060008, "phrase": "existing_kernels"}, {"score": 0.02988869905879018, "phrase": "wmd_kernels"}, {"score": 0.015380903828635006, "phrase": "svm"}, {"score": 0.01045835467838048, "phrase": "data_structure"}, {"score": 0.00481495049065317, "phrase": "support_vector_machines"}, {"score": 0.0047515546458205046, "phrase": "support_vector_machine"}, {"score": 0.004330450801016359, "phrase": "data_distribution_information"}, {"score": 0.004217110862974562, "phrase": "decision_hyperplane"}, {"score": 0.004070573090297285, "phrase": "nonlinear_svms_measure"}, {"score": 0.003946519058822334, "phrase": "pattern_images"}, {"score": 0.003877329308854808, "phrase": "euclidean_inner_product"}, {"score": 0.003826231150275071, "phrase": "euclidean_distance"}, {"score": 0.0037925389501636975, "phrase": "corresponding_input_patterns"}, {"score": 0.0037260386566859197, "phrase": "data_distribution_tendency"}, {"score": 0.003306559295382181, "phrase": "data_specific_knowledge"}, {"score": 0.0030942116765996426, "phrase": "input_space"}, {"score": 0.003066945490483524, "phrase": "agglomerative_hierarchical_clustering"}, {"score": 0.0029471818883482688, "phrase": "weighted_mahalanobis_distance"}, {"score": 0.0028572658971252616, "phrase": "detected_data_distribution_information"}, {"score": 0.0026736945502820303, "phrase": "mahalanobis_distance"}], "paper_keywords": ["indefinite kernels", " pattern recognition", " support vector machines (SVMs)"], "paper_abstract": "The support vector machine (SVM) has been demonstrated to be a very effective classifier in many applications, but its performance is still limited as the data distribution information is underutilized in determining the decision hyperplane. Most of the existing kernels employed in nonlinear SVMs measure the similarity between a pair of pattern images based on the Euclidean inner product or the Euclidean distance of corresponding input patterns, which ignores data distribution tendency and makes the SVM essentially a \"local\" classifier. In this paper, we provide a step toward a paradigm of kernels by incorporating data specific knowledge into existing kernels. We first find the data structure for each class adaptively in the input space via agglomerative hierarchical clustering (AHC), and then construct the weighted Mahalanobis distance (WMD) kernels using the detected data distribution information. In WMD kernels, the similarity between two pattern images is determined not only by the Mahalanobis distance (MD) between their corresponding input patterns but also by the sizes of the clusters they reside in. Although WMD kernels are not guaranteed to be positive definite (pd) or conditionally positive definite (cpd), satisfactory classification results can still be achieved because regularizers in SVMs with WMD kernels are empirically positive in pseudo-Euclidean (pE) spaces. Experimental results on both synthetic and real-world data sets show the effectiveness of \"plugging\" data structure into existing kernels.", "paper_title": "Weighted mahalanobis distance kernels for support vector machines", "paper_id": "WOS:000249279400015"}