{"auto_keywords": [{"score": 0.03699607636337113, "phrase": "n-dimensional_bijective_connection_network"}, {"score": 0.015719716506582538, "phrase": "bijective_connection_networks"}, {"score": 0.00474946741204285, "phrase": "restricted_faulty_node_set"}, {"score": 0.004621148492564008, "phrase": "important_criteria"}, {"score": 0.004537525607322823, "phrase": "fault-tolerant_performance"}, {"score": 0.00419861271409079, "phrase": "arbitrary_faulty_nodes"}, {"score": 0.003849579089885659, "phrase": "restricted_connectivity"}, {"score": 0.0035945701438887282, "phrase": "arbitrary_node"}, {"score": 0.00325069754015951, "phrase": "constructive_proof"}, {"score": 0.0026704265616705023, "phrase": "reliable_path"}, {"score": 0.0023386327847292805, "phrase": "bc_networks"}, {"score": 0.0022649119108225564, "phrase": "mobius_cubes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Connectivity", " Set of restricted faulty nodes", " Unicast", " Fault-free path", " Bijective connection network"], "paper_abstract": "The connectivity is an important criteria to measure the fault-tolerant performance of a graph. However, the connectivity based on the condition of the set of arbitrary faulty nodes is generally lower. In this paper, in order to heighten this measure, we introduce the restricted connectivity into bijective connection networks. First, we prove that the probability that all the neighbors of an arbitrary node becomes faulty in any n-dimensional bijective connection network X(n) is very low when n becomes sufficient large. Then, we give a constructive proof that under the condition that each node of an n-dimensional bijective connection network X(n) has at least one fault-free neighbor, its restricted connectivity is 2n - 2, about half of the connectivity of X(n). Finally, by our constructive proof, we give an O(n) algorithm to get a reliable path of length at most n + 3[log(2)vertical bar F vertical bar] + 1 between any two fault-free nodes in an n-dimensional bijective connection network. In particular, since the family of BC networks contains hypercubes, crossed cubes, Mobius cubes, etc., our algorithm is appropriate for these cubes. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Efficient unicast in bijective connection networks with the restricted faulty node set", "paper_id": "WOS:000292622100018"}