{"auto_keywords": [{"score": 0.04812129806508108, "phrase": "equivalence_class"}, {"score": 0.01299829469422023, "phrase": "attribute_disclosure"}, {"score": 0.00481495049065317, "phrase": "data_publishing"}, {"score": 0.004755054742217193, "phrase": "k-anonymity_privacy_requirement"}, {"score": 0.003092690568543981, "phrase": "new_notion"}, {"score": 0.002941389980674657, "phrase": "base_model_t-closeness"}, {"score": 0.0028327783069076883, "phrase": "sensitive_attribute"}, {"score": 0.002671722386856879, "phrase": "overall_table"}, {"score": 0.002509284173541882, "phrase": "threshold_t"}, {"score": 0.0023566987138026285, "phrase": "higher_utility"}, {"score": 0.00227914162528171, "phrase": "distance_measure"}, {"score": 0.0021315842986705485, "phrase": "privacy_measure"}], "paper_keywords": ["Privacy preservation", " data anonymization", " data publishing", " data security"], "paper_abstract": "The k-anonymity privacy requirement for publishing microdata requires that each equivalence class (i.e., a set of records that are indistinguishable from each other with respect to certain \"identifying\" attributes) contains at least k records. Recently, several authors have recognized that k-anonymity cannot prevent attribute disclosure. The notion of l-diversity has been proposed to address this; l-diversity requires that each equivalence class has at least l well-represented ( in Section 2) values for each sensitive attribute. In this paper, we show that l-diversity has a number of limitations. In particular, it is neither necessary nor sufficient to prevent attribute disclosure. Motivated by these limitations, we propose a new notion of privacy called \"closeness.\" We first present the base model t-closeness, which requires that the distribution of a sensitive attribute in any equivalence class is close to the distribution of the attribute in the overall table (i.e., the distance between the two distributions should be no more than a threshold t). We then propose a more flexible privacy model called (n, t)-closeness that offers higher utility. We describe our desiderata for designing a distance measure between two probability distributions and present two distance measures. We discuss the rationale for using closeness as a privacy measure and illustrate its advantages through examples and experiments.", "paper_title": "Closeness: A New Privacy Measure for Data Publishing", "paper_id": "WOS:000277717500003"}