{"auto_keywords": [{"score": 0.049725544371589304, "phrase": "resource-limited_primary_care_settings"}, {"score": 0.015719716506582538, "phrase": "electronic_health_records"}, {"score": 0.013624402101908796, "phrase": "partnership_model"}, {"score": 0.004605565335682916, "phrase": "partnership-based_and_community-oriented_approach"}, {"score": 0.00403026082093352, "phrase": "research_team's_previous_work"}, {"score": 0.003985680946956402, "phrase": "health_information_technology"}, {"score": 0.003436169600453596, "phrase": "meaningful_use_criteria"}, {"score": 0.003385555209074879, "phrase": "strong_focus"}, {"score": 0.003323330859027428, "phrase": "continuous_quality_improvement"}, {"score": 0.00328654473734697, "phrase": "eventual_implementation_success"}, {"score": 0.0031668306413359794, "phrase": "initial_stages"}, {"score": 0.0029185415814209055, "phrase": "provider_anxiety"}, {"score": 0.0028542615085879975, "phrase": "complex_changes"}, {"score": 0.002822652835367827, "phrase": "ehr_uptake"}, {"score": 0.002719790133195399, "phrase": "useful_insights"}, {"score": 0.00265987582861194, "phrase": "hit_regional_extension_centers"}, {"score": 0.002620666087191234, "phrase": "resource-limited_communities"}, {"score": 0.002582032847722892, "phrase": "ehr_adoption_barriers"}, {"score": 0.002562929776267296, "phrase": "conclusion_nmhc"}, {"score": 0.00241509422805775, "phrase": "necessary_expertise"}, {"score": 0.0022757699292460833, "phrase": "ehr"}, {"score": 0.0022338938462817867, "phrase": "meaningful_use"}, {"score": 0.0021444597601392146, "phrase": "partnership_efforts"}, {"score": 0.0021049977753042253, "phrase": "initial_software_deployment_stage"}], "paper_keywords": [""], "paper_abstract": "Objective To present a partnership-based and community-oriented approach designed to ease provider anxiety and facilitate the implementation of electronic health records (EHR) in resource-limited primary care settings. Materials and Methods The approach, referred to as partnership model, was developed and iteratively refined through the research team's previous work on implementing health information technology (HIT) in over 30 safety net practices. This paper uses two case studies to illustrate how the model was applied to help two nurse-managed health centers (NMHC), a particularly vulnerable primary care setting, implement EHR and get prepared to meet the meaningful use criteria. Results The strong focus of the model on continuous quality improvement led to eventual implementation success at both sites, despite difficulties encountered during the initial stages of the project. Discussion There has been a lack of research, particularly in resource-limited primary care settings, on strategies for abating provider anxiety and preparing them to manage complex changes associated with EHR uptake. The partnership model described in this paper may provide useful insights into the work shepherded by HIT regional extension centers dedicated to supporting resource-limited communities disproportionally affected by EHR adoption barriers. Conclusion NMHC, similar to other primary care settings, are often poorly resourced, understaffed, and lack the necessary expertise to deploy EHR and integrate its use into their day-to-day practice. This study demonstrates that implementation of EHR, a prerequisite to meaningful use, can be successfully achieved in this setting, and partnership efforts extending far beyond the initial software deployment stage may be the key.", "paper_title": "A partnership model for implementing electronic health records in resource-limited primary care settings: experiences from two nurse-managed health centers", "paper_id": "WOS:000296491600015"}