{"auto_keywords": [{"score": 0.04826865552057888, "phrase": "web-based_solutions"}, {"score": 0.033153017845945695, "phrase": "mwp"}, {"score": 0.025060334894249768, "phrase": "user_front"}, {"score": 0.00481495049065317, "phrase": "new_distributed_platform_for_client-side_fusion"}, {"score": 0.004652845998457721, "phrase": "web_platform."}, {"score": 0.004326188427877999, "phrase": "natural_and_cognitive_information_processing"}, {"score": 0.004162602203448056, "phrase": "human-controlled_multimodal_systems"}, {"score": 0.0036762529165489644, "phrase": "effective_solution"}, {"score": 0.003522027550662857, "phrase": "web_content"}, {"score": 0.003388745581055085, "phrase": "novel_multimodal_web_platform"}, {"score": 0.0033026956021014204, "phrase": "flexible_migration"}, {"score": 0.003274499008699115, "phrase": "traditionally_closed_and_purpose-oriented_multimodal_systems"}, {"score": 0.003177687211289478, "phrase": "web_applications"}, {"score": 0.0028181504086563967, "phrase": "multiservice_networks"}, {"score": 0.0027347937102326285, "phrase": "general_web-based_user_interfaces"}, {"score": 0.0024461474613359994, "phrase": "generic_network-based_architecture"}, {"score": 0.0023233800372985686, "phrase": "new_modalities"}, {"score": 0.002235356010935877, "phrase": "web_application"}, {"score": 0.0021049977753042253, "phrase": "web-application_code"}], "paper_keywords": [""], "paper_abstract": "Web-based solutions and interfaces should be easy, more intuitive, and should also adapt to the natural and cognitive information processing and presentation capabilities of humans. Today, human-controlled multimodal systems with multimodal interfaces are possible. They allow for a more natural and more advanced exchange of information between man and machine. The fusion of web-based solutions with natural modalities is therefore an effective solution for users who would like to access services and web content in a more natural way. This article presents a novel multimodal web platform (MWP) that enables flexible migration from traditionally closed and purpose-oriented multimodal systems to the wider scope offered by web applications. The MWP helps to overcome problems of interoperability, compatibility, and integration that usually accompany migrations from standard (task-oriented) applications to web-based solutions and multiservice networks, thus enabling the enrichment of general web-based user interfaces with several advanced natural modalities in order to communicate and exchange information. The MWP is a system in which all modules are embedded within generic network-based architecture. When using it, the fusion of user front ends with new modalities requires as little intervention to the code of the web application as possible. The fusion is implemented within user front ends and retains the web-application code and its functionalities intact.", "paper_title": "A NEW DISTRIBUTED PLATFORM FOR CLIENT-SIDE FUSION OF WEB APPLICATIONS AND NATURAL MODALITIESA MULTIMODAL WEB PLATFORM", "paper_id": "WOS:000323028100001"}