{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "inventory_scheduling_model"}, {"score": 0.04439952284800597, "phrase": "supply_chain_system"}, {"score": 0.011477608284517257, "phrase": "inventory_scheduling"}, {"score": 0.008407508077192519, "phrase": "petri"}, {"score": 0.004562362497952548, "phrase": "supply_chain"}, {"score": 0.004508048086020253, "phrase": "purpose_-_the_purpose"}, {"score": 0.0036553070575015344, "phrase": "aopn"}, {"score": 0.0027575842698911173, "phrase": "aopn_model"}, {"score": 0.0025202582748972122, "phrase": "reasonable_basic_function_design"}, {"score": 0.002445767214680791, "phrase": "main_limitations"}, {"score": 0.0021049977753042253, "phrase": "new_modeling_method"}], "paper_keywords": ["Inventory management", " Supply chain management", " Production scheduling", " Modelling", " Cybernetics"], "paper_abstract": "Purpose - The purpose of this paper is to create the inventory scheduling model for supply chain system. Design/methodology/approach - Aiming at the problems of analysis and modeling of multi-agent system, an agent-oriented Petri net (AOPN) model is proposed by introducing the characteristics of agent based on Petri net, and formalization definition of AOPN is presented. Combined with the inventory scheduling in supply chain system, inventory scheduling model based on AOPN is constructed. On the basis of the inventory scheduling model, its program model is designed. Then the reachability of the inventory scheduling model is analyzed and its soundness is verified. Findings - The AOPN model and inventory scheduling model based on AOPN in supply chain system are found. Research limitations/implications - The reasonable basic function design of various agents are main limitations. Practical implications - A very useful tool of analysis for the modeling of inventory scheduling in supply chain system. Originality/value - The paper presents a new modeling method of inventory scheduling in supply chain system. This paper is aimed at researchers and engineers.", "paper_title": "Research on the inventory scheduling model based on agent-oriented Petri net in supply chain", "paper_id": "WOS:000261315700005"}