{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "olap_sessions"}, {"score": 0.04962913836247387, "phrase": "olap_queries"}, {"score": 0.0044435836051448475, "phrase": "olap"}, {"score": 0.0041987222897385676, "phrase": "different_applications"}, {"score": 0.004120130206000757, "phrase": "query_recommendation"}, {"score": 0.003930000775297499, "phrase": "olap_session_similarity"}, {"score": 0.003475582268210954, "phrase": "similarity_criteria"}, {"score": 0.003410479630045025, "phrase": "user_study"}, {"score": 0.0033150974333333214, "phrase": "olap_practitioners"}, {"score": 0.002531696967910679, "phrase": "levenshtein"}, {"score": 0.002358220404529728, "phrase": "smith-waterman"}, {"score": 0.0022070310530794097, "phrase": "smith-waterman_extension"}, {"score": 0.002125020720324262, "phrase": "users'_criteria"}, {"score": 0.0021049977753042253, "phrase": "session_similarity"}], "paper_keywords": ["OLAP", " Similarity measures", " Query comparison", " Sequence comparison"], "paper_abstract": "OLAP queries are not normally formulated in isolation, but in the form of sequences called OLAP sessions. Recognizing that two OLAP sessions are similar would be useful for different applications, such as query recommendation and personalization; however, the problem of measuring OLAP session similarity has not been studied so far. In this paper, we aim at filling this gap. First, we propose a set of similarity criteria derived from a user study conducted with a set of OLAP practitioners and researchers. Then, we propose a function for estimating the similarity between OLAP queries based on three components: the query group-by set, its selection predicate, and the measures required in output. To assess the similarity of OLAP sessions, we investigate the feasibility of extending four popular methods for measuring similarity, namely the Levenshtein distance, the Dice coefficient, the tf-idf weight, and the Smith-Waterman algorithm. Finally, we experimentally compare these four extensions to show that the Smith-Waterman extension is the one that best captures the users' criteria for session similarity.", "paper_title": "Similarity measures for OLAP sessions", "paper_id": "WOS:000334271300010"}