{"auto_keywords": [{"score": 0.048636009815037955, "phrase": "breathing_region"}, {"score": 0.022251395208747245, "phrase": "nasal_cavity"}, {"score": 0.009113960390796661, "phrase": "facial_features"}, {"score": 0.007172058849853151, "phrase": "particle_deposition_patterns"}, {"score": 0.00481495049065317, "phrase": "human_nasal_cavity"}, {"score": 0.004731492618963217, "phrase": "breathing_zone"}, {"score": 0.004095692768056685, "phrase": "realistic_boundary_conditions"}, {"score": 0.003920384090110374, "phrase": "new_nasal_cavity_model"}, {"score": 0.003802135020791801, "phrase": "ambient_environment"}, {"score": 0.003687439449869248, "phrase": "inhaled_air"}, {"score": 0.0032054891061528896, "phrase": "planar_geometry"}, {"score": 0.0030951536886513567, "phrase": "micron_particles"}, {"score": 0.0027985846558073457, "phrase": "'nasal-only'_case"}, {"score": 0.0027140798043053986, "phrase": "particle_trajectories"}, {"score": 0.0025977542995083624, "phrase": "external_nose"}, {"score": 0.0024325244760735566, "phrase": "flow_patterns"}, {"score": 0.0021610874773389096, "phrase": "posterior_nasal_regions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Nasal cavity", " Micro-particle", " Breathing zone", " CFD"], "paper_abstract": "The breathing region connects the nasal cavity with the outside environmental air where flow is accelerated through the nostrils. Particles introduced into the nasal cavity without considering the breathing region neglect the influence of facial features and realistic boundary conditions at the nostrils. In this study, a new nasal cavity model is reconstructed combining facial features and an ambient environment focusing on the breathing region. The inhaled air from outside the nose is investigated and compared with a model that consists of the nasal cavity alone. An improved 2D surface mapping technique is applied to the 3D nasal cavity to visualize the particle deposition patterns onto a planar geometry. Using this technique, deposition of micron particles from 0.4 mu m to 30 mu m were investigated, and trajectories of 2.5 mu m, 10 mu m and 20 mu m were compared with the 'nasal-only' case. Particle deposition efficiency curves and particle trajectories are plotted to show that the inclusion of the external nose and breathing region causes: (i) a change in the fluid flow within the anterior nasal cavity half but the flow patterns regulate in the posterior half; (ii) minimal difference for 2.5 mu m particle deposition patterns; (iii) significant differences in 10 and 20 mu m particle deposition patterns where more particles are deposited in the posterior nasal regions. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Detailed micro-particle deposition patterns in the human nasal cavity influenced by the breathing zone", "paper_id": "WOS:000354141400013"}