{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electronic_health_records"}, {"score": 0.04399312620580201, "phrase": "clinical_notes"}, {"score": 0.04208729377636017, "phrase": "outpatient_clinical_notes"}, {"score": 0.03464034545023033, "phrase": "qnote"}, {"score": 0.004787309936374976, "phrase": "clinical_note_quality"}, {"score": 0.004705332186103205, "phrase": "clinical_note"}, {"score": 0.0046648687677450455, "phrase": "clinician's_information_collection"}, {"score": 0.00459819794710047, "phrase": "clinical_management"}, {"score": 0.004519443838868363, "phrase": "administrative_purposes"}, {"score": 0.004391159805197013, "phrase": "clinical_practices"}, {"score": 0.003010389418340144, "phrase": "sixteen_primary_care_physicians"}, {"score": 0.002362579221912841, "phrase": "quality_scores"}, {"score": 0.0022755900116918923, "phrase": "overall_quality"}, {"score": 0.002255973756526505, "phrase": "outpatient_clinical_note"}, {"score": 0.0021854800233595444, "phrase": "non-core_elements"}, {"score": 0.0021355964048830533, "phrase": "first_study"}, {"score": 0.0021050037316719577, "phrase": "ehr"}], "paper_keywords": ["QNOTE", " electronic health record", " clinical quality", " clinical note", " note quality"], "paper_abstract": "Background and objective The clinical note documents the clinician's information collection, problem assessment, clinical management, and its used for administrative purposes. Electronic health records (EHRs) are being implemented in clinical practices throughout the USA yet it is not known whether they improve the quality of clinical notes. The goal in this study was to determine if EHRs improve the quality of outpatient clinical notes. Materials and methods A five and a half year longitudinal retrospective multicenter quantitative study comparing the quality of handwritten and electronic outpatient clinical visit notes for 100 patients with type 2 diabetes at three time points: 6 months prior to the introduction of the EHR (before-EHR), 6 months after the introduction of the EHR (after-EHR), and 5 years after the introduction of the EHR (5-year-EHR). QNOTE, a validated quantitative instrument, was used to assess the quality of outpatient clinical notes. Its scores can range from a low of 0 to a high of 100. Sixteen primary care physicians with active practices used QNOTE to determine the quality of the 300 patient notes. Results The before-EHR, after-EHR, and 5-year-EHR grand mean scores (SD) were 52.0 (18.4), 61.2 (16.3), and 80.4 (8.9), respectively, and the change in scores for before-EHR to after-EHR and before-EHR to 5-year-EHR were 18% (p<0.0001) and 55% (p<0.0001), respectively. All the element and grand mean quality scores significantly improved over the 5-year time interval. Conclusions The EHR significantly improved the overall quality of the outpatient clinical note and the quality of all its elements, including the core and non-core elements. To our knowledge, this is the first study to demonstrate that the EHR significantly improves the quality of clinical notes.", "paper_title": "Electronic health records improve clinical note quality", "paper_id": "WOS:000352771100021"}