{"auto_keywords": [{"score": 0.04418518864132593, "phrase": "linguistic_approach"}, {"score": 0.00481495049065317, "phrase": "linguistic_and_dynamic_context"}, {"score": 0.004510184935928004, "phrase": "new_model"}, {"score": 0.004456872931482395, "phrase": "decision_support_system"}, {"score": 0.004174677062711731, "phrase": "dynamic_sets"}, {"score": 0.0038640303886081444, "phrase": "dynamic_decision_situations"}, {"score": 0.0033299015941662302, "phrase": "decision_making_process"}, {"score": 0.0031750418391373035, "phrase": "mobile_and_dynamic_context"}, {"score": 0.003118838635447237, "phrase": "experts'_preferences"}, {"score": 0.0025020469669826497, "phrase": "mobile_devices"}, {"score": 0.0022476051902301187, "phrase": "new_linguistic_group_decision_making_framework"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Group decision making", " Mobile internet", " Decision support system", " Linguistic approach"], "paper_abstract": "The aim of this paper is to present a new model of decision support system for group decision making problems based on a linguistic approach and dynamic sets of alternatives. The model incorporates a mechanism that allows to manage dynamic decision situations in which some information about the problem is not constant in time. We assume that the set of alternatives can change during the decision making process. The model is presented in a mobile and dynamic context where the experts' preferences can be incomplete. The linguistic approach is used to represent both the experts' preferences about the alternatives and the agreement degrees to manage the change of some alternatives. A prototype of such mobile decision support system in which the experts use mobile devices to provide their linguistic preferences at anytime and anywhere has been implemented. In such a way, we provide a new linguistic group decision making framework that is mobile and dynamic. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Group decision making problems in a linguistic and dynamic context", "paper_id": "WOS:000284863200044"}