{"auto_keywords": [{"score": 0.03910220818011611, "phrase": "granular_prototypes"}, {"score": 0.015719716506582538, "phrase": "information_granularity"}, {"score": 0.009387831166867595, "phrase": "coverage_criterion"}, {"score": 0.004717485406306594, "phrase": "data_structures"}, {"score": 0.004659951478263083, "phrase": "granular_fuzzy_clustering"}, {"score": 0.004224130367280183, "phrase": "information_granules"}, {"score": 0.003988901168289797, "phrase": "partition_matrices"}, {"score": 0.0036602993802452863, "phrase": "numeric_representation"}, {"score": 0.0034422330919613294, "phrase": "data_structure"}, {"score": 0.003372460634140967, "phrase": "granulation-degranulation_scheme"}, {"score": 0.0031845067058084583, "phrase": "higher_extent"}, {"score": 0.0029460197288680864, "phrase": "optimization_problem"}, {"score": 0.0026920404458807444, "phrase": "original_data"}, {"score": 0.0025628355581338563, "phrase": "important_design_asset"}, {"score": 0.0024903420152789135, "phrase": "individual_prototypes"}, {"score": 0.0023322317017275803, "phrase": "optimal_allocation"}, {"score": 0.002266246304762945, "phrase": "interval-valued_prototypes"}, {"score": 0.002220257443705344, "phrase": "already_produced_numeric_representatives"}, {"score": 0.0021049977753042253, "phrase": "interval_format"}], "paper_keywords": ["Clustering", " fuzzy clustering", " granular prototypes", " granulation-degranulation scheme", " information granularity", " optimal granularity allocation"], "paper_abstract": "Clustering forms one of the most visible conceptual and algorithmic framework of developing information granules. In spite of the algorithm being used, the representation of information granules-clusters is predominantly numeric (coming in the form of prototypes, partition matrices, dendrograms, etc.). In this paper, we consider a concept of granular prototypes that generalizes the numeric representation of the clusters and, in this way, helps capture more details about the data structure. By invoking the granulation-degranulation scheme, we design granular prototypes being reflective of the structure of data to a higher extent than the representation that is provided by their numeric counterparts (prototypes). The design is formulated as an optimization problem, which is guided by the coverage criterion, meaning that we maximize the number of data for which their granular realization includes the original data. The granularity of the prototypes themselves is treated as an important design asset; hence, its allocation to the individual prototypes is optimized so that the coverage criterion becomes maximized. With this regard, several schemes of optimal allocation of information granularity are investigated, where interval-valued prototypes are formed around the already produced numeric representatives. Experimental studies are provided in which the design of granular prototypes of interval format is discussed and characterized.", "paper_title": "An Optimization of Allocation of Information Granularity in the Interpretation of Data Structures: Toward Granular Fuzzy Clustering", "paper_id": "WOS:000304163200001"}