{"auto_keywords": [{"score": 0.005105507113233143, "phrase": "fast_development"}, {"score": 0.0046221918332842995, "phrase": "deep_insights"}, {"score": 0.0041074234667687875, "phrase": "first-ever_study"}, {"score": 0.003978866233891427, "phrase": "configuration_snapshots"}, {"score": 0.0036998728605395384, "phrase": "configuration_commands"}, {"score": 0.003424771860049617, "phrase": "configuration_command_lines"}, {"score": 0.0032429499567088113, "phrase": "smaller_network_scale"}, {"score": 0.002988101395789399, "phrase": "referential_dependence"}, {"score": 0.0029209233709517634, "phrase": "higher_growth_rate"}, {"score": 0.00266693888510356, "phrase": "network_configuration_recommendation"}, {"score": 0.0026427848602443267, "phrase": "fncr"}, {"score": 0.0025951294037626174, "phrase": "studied_networks"}, {"score": 0.0022743274702883456, "phrase": "next_generation_networks"}, {"score": 0.0022333012657436307, "phrase": "configuration_characteristics"}, {"score": 0.002203016940021265, "phrase": "configuration_management"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Network management", " IPv6", " Configuration analysis", " Configuration recommendation"], "paper_abstract": "Unraveling the characteristics of configurations can offer deep insights into networks. There are many analyses of IPv4 configurations, while few works are focusing on configurations of IPv6. In this paper, we conduct a first-ever study on IPv6 configurations based on the configuration snapshots of a pure IPv6 network - CERNET2 and a dual-stack network - Internet2. We find that configuration commands of IPv6 are a bit more complicated than IPv4 because of the complexity of IPv6 addresses. Configuration command lines of IPv6 are less abundant than IPv4, attributing to the smaller network scale of IPv6 compared with IPv4. Configurations of IPv6 are less complicated than IPv4 in views of referential dependence, but present a higher growth rate than IPv4, which is caused by fast development of IPv6. More importantly, we propose a framework for network configuration recommendation (FNCR) for the studied networks according to our analysis methods and results. Overall, although IPv6 is smaller in scale and less mature than IPv4 currently, it has been experiencing fast development as the next generation networks. Hence understanding configuration characteristics and enhancing configuration management are essential for IPv6 networks. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Configuration analysis and recommendation: Case studies in IPv6 networks", "paper_id": "WOS:000344437900004"}