{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "hardware_design"}, {"score": 0.015278609516865587, "phrase": "higher_order_functions"}, {"score": 0.012463548466778867, "phrase": "functional_programming"}, {"score": 0.00481495049065317, "phrase": "functional_programming_and_hardware_design"}, {"score": 0.004621043537046209, "phrase": "elegant_way"}, {"score": 0.004186799638538032, "phrase": "new_algorithms"}, {"score": 0.0029147175927233546, "phrase": "parallel_programming"}, {"score": 0.0027514186391258263, "phrase": "blelloch's_wonderful_invited_talk"}, {"score": 0.0025547994452342266, "phrase": "central_question"}, {"score": 0.002492425259337031, "phrase": "parallel_machines"}, {"score": 0.002202617924488607, "phrase": "great_contributions"}], "paper_keywords": ["Hardware design", " parallel algorithms", " functional programming", " higher order functions", " parallel programming"], "paper_abstract": "Higher order functions provide an elegant way to express algorithms designed for implementation in hardware [1, 6-9]. By showing examples of both classic and new algorithms, I will explain why higher order functions deserve to be studied. Next, I will consider the extent to which ideas from functional programming, and associated formal verification methods, have influenced hardware design in practice [3-5, 10]. What can we learn from looking back? You might ask \"Why are methods of hardware design still important to our community?\". Maybe we should just give up? One reason for not giving up is that hardware design is really a form of parallel programming. And here there is still a lot to do! Inspired by Blelloch's wonderful invited talk at ICFP 2010 [2], I still believe that functional programming has much to offer in the central question of how to program the parallel machines of today, and, more particularly, of the future. I will briefly present some of the areas where I think that we are poised to make great contributions. But maybe we need to work harder on getting our act together?", "paper_title": "Functional Programming and Hardware Design: Still Interesting after All These Years", "paper_id": "WOS:000367255800015"}