{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "project_complexity"}, {"score": 0.008597944457096008, "phrase": "project_management"}, {"score": 0.00698613651724895, "phrase": "project_complexity_framework"}, {"score": 0.0065331775136361035, "phrase": "project_complexity_model"}, {"score": 0.004223708778943785, "phrase": "better_complexity-induced_risks"}, {"score": 0.004139401327448803, "phrase": "extensive_literature_review"}, {"score": 0.003975781274672803, "phrase": "broad_view"}, {"score": 0.003935892934907777, "phrase": "critical_analysis"}, {"score": 0.0038964032225585117, "phrase": "underlying_concepts"}, {"score": 0.003522579870903474, "phrase": "systems_analysis"}, {"score": 0.003452218803245602, "phrase": "standard_project_complexity_framework"}, {"score": 0.003282383509542342, "phrase": "project_uncertainty"}, {"score": 0.0031419449938286663, "phrase": "industrial_application"}, {"score": 0.0030688220103201836, "phrase": "literature_review"}, {"score": 0.0028982239829450198, "phrase": "final_version"}, {"score": 0.0026914126067254444, "phrase": "complex_project"}, {"score": 0.0026554236621262515, "phrase": "project_team_members"}, {"score": 0.0025761937402886954, "phrase": "information_sharing"}, {"score": 0.0023923066544220277, "phrase": "original_framework"}, {"score": 0.0023287359930308864, "phrase": "complexity_model"}, {"score": 0.0021049977753042253, "phrase": "traditional_project_management_models"}], "paper_keywords": ["Project management", " Complexity theory", " Uncertainty management", " Modelling", " Systems analysis", " Risk management"], "paper_abstract": "Purpose - The purpose of this paper is to better identify, define and model complexity within the field of project management in order to manage better under conditions of complexity (and manage better complexity-induced risks). Design/methodology/approach - An extensive literature review enlightens the lack of consensus on project complexity and thus provides a broad view and a critical analysis of the underlying concepts. A project complexity framework and definition are then proposed. After underlining the stakes of project complexity in accordance with these proposals, a project complexity model is then built notably due to systems analysis. Findings - Proposal of standard project complexity framework and definition. Proposal of a synthesis of the relationships between the concepts of project uncertainty and project complexity. Proposal of a project complexity model (and validation due to industrial application). Research limitations/implications - The literature review and project complexity framework tries to be exhaustive even though it is likely to be completed. The final version of the model is still to be computed and tested. Practical implications - Avoiding confusion when defining and managing a complex project, particularly between project team members (and as a consequence improving communication and information sharing), improves the assessment of the propagation of a change within the project. Originality/value - The paper proposes an original framework and a definition of project complexity. The complexity model permits the navigation from any element of the project to any other (when detail is needed) and is, as a consequence, original and complementary with traditional project management models and tools.", "paper_title": "Understanding project complexity: implications on project management", "paper_id": "WOS:000260044400003"}