{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wiberg_algorithm"}, {"score": 0.007541130449052821, "phrase": "missing_components"}, {"score": 0.004779085953614184, "phrase": "matrix_factorization"}, {"score": 0.004320156581220516, "phrase": "principal_component_analysis"}, {"score": 0.004287961675700099, "phrase": "missing_data"}, {"score": 0.004146015717402716, "phrase": "numerical_algorithm"}, {"score": 0.004008749730113699, "phrase": "applied_mathematics"}, {"score": 0.0038041680562514064, "phrase": "computer_vision_community"}, {"score": 0.003569681826459428, "phrase": "wiberg_study"}, {"score": 0.00286213454317036, "phrase": "experimental_results"}, {"score": 0.002788066194685293, "phrase": "considerably_good_performance"}, {"score": 0.0027261023678401696, "phrase": "conventional_view"}, {"score": 0.002665511985052972, "phrase": "minimization-based_algorithms"}, {"score": 0.0025868090345615197, "phrase": "global_minimum"}, {"score": 0.00244543519230361, "phrase": "random_initial_values"}, {"score": 0.002373214852820709, "phrase": "correct_solution"}, {"score": 0.0021448202319775634, "phrase": "standard_algorithm"}, {"score": 0.0021049977753042253, "phrase": "computer_vision"}], "paper_keywords": ["matrix factorization", " singular value decomposition", " principal component analysis with missing data (PCAMD)", " structure from motion", " numerical algorithm"], "paper_abstract": "This paper considers the problem of factorizing a matrix with missing components into a product of two smaller matrices, also known as principal component analysis with missing data (PCAMD). The Wiberg algorithm is a numerical algorithm developed for the problem in the community of applied mathematics. We argue that the algorithm has not been correctly understood in the computer vision community. Although there are many studies in our community, almost every one of which refers to the Wiberg study, as far as we know, there is no literature in which the performance of the Wiberg algorithm is investigated or the detail of the algorithm is presented. In this paper, we present derivation of the algorithm along with a problem in its implementation that needs to be carefully considered, and then examine its performance. The experimental results demonstrate that the Wiberg algorithm shows a considerably good performance, which should contradict the conventional view in our community, namely that minimization-based algorithms tend to fail to converge to a global minimum relatively frequently. The performance of the Wiberg algorithm is such that even starting with random initial values, it converges in most cases to a correct solution, even when the matrix has many missing components and the data are contaminated with very strong noise. Our conclusion is that the Wiberg algorithm can also be used as a standard algorithm for the problems of computer vision.", "paper_title": "On the Wiberg algorithm for matrix factorization in the presence of missing components", "paper_id": "WOS:000244018000006"}