{"auto_keywords": [{"score": 0.04093550459685708, "phrase": "phr_systems"}, {"score": 0.034598794981461234, "phrase": "personal_health_record_systems"}, {"score": 0.00481495049065317, "phrase": "remarkable_upsurge"}, {"score": 0.004576763709613412, "phrase": "personal_health_record"}, {"score": 0.004225950334493496, "phrase": "biomedical_literature"}, {"score": 0.004016782710006123, "phrase": "potential_capabilities"}, {"score": 0.0036553070575015344, "phrase": "proven_business_case"}, {"score": 0.0036026484429137998, "phrase": "widespread_deployment"}, {"score": 0.0035507457285983268, "phrase": "phr_adoption"}, {"score": 0.003161474881435185, "phrase": "phr-promoting_activities"}, {"score": 0.0029830992938695033, "phrase": "patient_data"}, {"score": 0.0026366753045215558, "phrase": "active_participants"}, {"score": 0.002469830206270585, "phrase": "electronic_health_record_systems"}, {"score": 0.0023990982005125763, "phrase": "greater_benefits"}, {"score": 0.002135812692862058, "phrase": "system_characteristics"}, {"score": 0.0021049977753042253, "phrase": "technical_architectures"}], "paper_keywords": [""], "paper_abstract": "Recently there has been a remarkable upsurge in activity surrounding the adoption of personal health record (PHR) systems for patients and consumers. The biomedical literature does not vet adequately describe the potential capabilities and utility of PHR systems. In addition, the lack of a proven business case for widespread deployment hinders PHR adoption. In a 2005 working symposium, the American Medical Informatics Association's College of Medical Informatics discussed the issues surrounding personal health record systems and developed recommendations for PHR-promoting activities. Personal health record systems are more than just static repositories for patient data; they combine data, knowledge, and software tools, which help patients to become active participants in their own care. When PHRs are integrated with electronic health record systems, they provide greater benefits than would stand-alone systems for consumers. This paper summarizes the College Symposium discussions on PHR systems and provides definitions, system characteristics, technical architectures, benefits, barriers to adoption, and strategies for increasing adoption.", "paper_title": "Personal health records: Definitions, benefits, and strategies for overcoming barriers to adoption", "paper_id": "WOS:000236118000001"}