{"auto_keywords": [{"score": 0.035712999120767676, "phrase": "s-d_distribution"}, {"score": 0.015719716506582538, "phrase": "heterogeneous_cognitive_radio_networks"}, {"score": 0.011387474085216877, "phrase": "primary_network_throughput"}, {"score": 0.011177967422221782, "phrase": "different_heterogeneous_extents"}, {"score": 0.007676002746658249, "phrase": "primary_networks"}, {"score": 0.004434746085229201, "phrase": "hcrn"}, {"score": 0.004352592156102578, "phrase": "data_source"}, {"score": 0.004130535674260502, "phrase": "rank_based_model"}, {"score": 0.0040997480534580065, "phrase": "secondary_users"}, {"score": 0.004023775199194536, "phrase": "relay_service"}, {"score": 0.00399378014373321, "phrase": "primary_users"}, {"score": 0.0033370841436001597, "phrase": "flexible_assistance"}, {"score": 0.003238616481108356, "phrase": "secondary_networks"}, {"score": 0.0031430451507177388, "phrase": "s-d_heterogeneity_exponent_alpha"}, {"score": 0.0029381648092259064, "phrase": "primary_and_secondary_networks"}, {"score": 0.0026357223464279983, "phrase": "s-d_heterogeneity"}, {"score": 0.002235095576913577, "phrase": "heterogeneous_extent"}, {"score": 0.002105017367777164, "phrase": "sus"}], "paper_keywords": ["Throughput", " delay", " cognitive radio networks (CRN)", " heterogeneous S-D distribution", " cooperation", " economical deployment", " modified uniform mobility (MUM) model"], "paper_abstract": "In this paper, (1) we investigate the throughput and delay in heterogeneous cognitive radio networks (HCRN), where the data source and the destination (S-D) is heterogeneously distributed following a rank based model and secondary users (SUs) provide relay service for primary users (PUs). We consider two scenarios: 1) PUs and SUs are both static; and 2) PUs are static and SUs are mobile. For scenario 1, we show that the primary network throughput is the same for different heterogeneous extents of S-D distribution owing to the flexible assistance of SUs, while the throughput of secondary networks is proven to be changing with the S-D heterogeneity exponent alpha, which depicts the variation of different heterogeneous extents of S-D distribution. In addition, the delay of both primary and secondary networks are shown to be altering with alpha. Further, we reveal that the number of SUs required to assist PUs can be dramatically reduced when considering the S-D heterogeneity, while achieving the same primary network throughput. For scenario 2, we utilize a modified uniform mobility (MUM) model to depict the motion of SUs and mainly focus on the analysis of throughput and delay for primary networks. It shows that the primary network throughput is also free of the heterogeneous extent of S-D distribution, while the delay changes with alpha. Due to the mobility of SUs, a better delay-throughput tradeoff of primary networks is achieved compared with that in scenario 1.", "paper_title": "Throughput and Delay in Heterogeneous Cognitive Radio Networks with Cooperative Secondary Users", "paper_id": "WOS:000361640800018"}