{"auto_keywords": [{"score": 0.003978866233891427, "phrase": "high_dimensionality"}, {"score": 0.003928572641266562, "phrase": "small_number"}, {"score": 0.003805591825381666, "phrase": "classification_modeling"}, {"score": 0.00337224813954299, "phrase": "human-understandable_rules"}, {"score": 0.003204841443605308, "phrase": "effective_hiv_inhibitors"}, {"score": 0.0030071857666598193, "phrase": "account_complexity"}, {"score": 0.0026986685585382347, "phrase": "feature-selective_methods"}, {"score": 0.0024372021710656585, "phrase": "extensively_various_machine_learning_methods"}, {"score": 0.002286781334850213, "phrase": "neural_networks"}, {"score": 0.0022578275190855124, "phrase": "decompositional_approach"}, {"score": 0.0021731423856364003, "phrase": "effective_rules"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": ["HIV-1 cleavage site prediction rule discovery"], "paper_abstract": "Several machine learning algorithms have recently been applied to modeling the specificity of HIV-1 protease. The problem is challenging because of the three issues as follows: (1) datasets with high dimensionality and small number of samples could misguide classification modeling and its interpretation; (2) symbolic interpretation is desirable because it provides us insight to the specificity in the form of human-understandable rules, and thus helps us to design effective HIV inhibitors; (3) the interpretation should take into account complexity or dependency between positions in sequences. Therefore, it is neccessary to investigate multivariate and feature-selective methods to model the specificity and to extract rules from the model. We have tested extensively various machine learning methods, and we have found that the combination of neural networks and decompositional approach can generate a set of effective rules. By validation to experimental results for the HIV-1 protease, the specificity rules outperform the ones generated by frequency-based, univariate or black-box methods. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Specificity rule discovery in HIV-1 protease cleavage site analysis", "paper_id": "WOS:000253028600010"}