{"auto_keywords": [{"score": 0.03784144720028534, "phrase": "test_points"}, {"score": 0.007740489563401459, "phrase": "test-point_allocation"}, {"score": 0.006604805989557204, "phrase": "diagnosability_problem"}, {"score": 0.00610067419451943, "phrase": "business_processes"}, {"score": 0.00470975295439431, "phrase": "business_process_models"}, {"score": 0.0046683172874085015, "phrase": "diagnosability_analysis"}, {"score": 0.0032919615578986816, "phrase": "sufficient_observable_data"}, {"score": 0.003121719509312159, "phrase": "later_diagnosis_process"}, {"score": 0.0027700855441353165, "phrase": "business_process"}, {"score": 0.002733539375462443, "phrase": "fixed_number"}, {"score": 0.0024579623598183355, "phrase": "test-point_allocator_tool"}, {"score": 0.0023307492812556204, "phrase": "business_process_model_life_cycle"}, {"score": 0.002161695357601592, "phrase": "acceptable_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Business process improvement", " Diagnosability", " Test points"], "paper_abstract": "Diagnosability analysis aims to determine whether observations available during the execution of a system are sufficient to precisely locate the source of a problem. Previous work deals with the diagnosability problem in contexts such as circuits and systems, but no with the adaptation of the diagnosability problem to business processes. In order to improve the diagnosability, a set of test points needs to be allocated. Therefore, the aim of this contribution is to determine a test-point allocation to obtain sufficient observable data in the dataflow to allow the discrimination of faults for a later diagnosis process. The allocation of test points depends on the strategies of the companies, for this reason we defined two possibilities: to improve the diagnosability of a business process for a fixed number of test points and the minimization of the number of test points for a given level of diagnosability. Both strategies have been implemented in the Test-Point Allocator tool in order to facilitate the integration of the test points in the business process model life cycle. Experimental results indicate that diagnosability of business processes can be improved by allocating test points in an acceptable time. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Minimizing test-point allocation to improve diagnosability in business process models", "paper_id": "WOS:000324898300002"}