{"auto_keywords": [{"score": 0.048718786750838974, "phrase": "congested_areas"}, {"score": 0.015719716506582538, "phrase": "schematic_network_maps"}, {"score": 0.01181411958667626, "phrase": "desirable_scale"}, {"score": 0.00813807653127883, "phrase": "new_method"}, {"score": 0.0047689174754929195, "phrase": "automated_detection"}, {"score": 0.004394910907549057, "phrase": "schematic_map"}, {"score": 0.0042495320879288615, "phrase": "transport_network_maps"}, {"score": 0.0032777653153451265, "phrase": "existing_methods"}, {"score": 0.003169222811082848, "phrase": "automated_enlargement"}, {"score": 0.0029062860108533374, "phrase": "new_automated_method"}, {"score": 0.0025521085778978042, "phrase": "deformed_network_maps"}, {"score": 0.0025155150482635688, "phrase": "stroke-based_approach"}, {"score": 0.0023972750359328235, "phrase": "i.e._the_london_tube_and_hong_kong_metro_data_sets"}, {"score": 0.0023066880707738736, "phrase": "experimental_studies"}, {"score": 0.002125371638869951, "phrase": "schematic_maps"}, {"score": 0.0021049977753042253, "phrase": "improved_clarity"}], "paper_keywords": ["schematization", " network maps", " congested areas", " enlargement"], "paper_abstract": "Nowadays, the design of the London Tube map (as a kind of schematic map) has been popularly adopted for transport network maps worldwide because of its great clarity of representation. In such types of map, the shape of the network is simplified and the topology between lines is preserved while the congested areas are enlarged to a desirable scale. Efforts have also been made to automate the production of such maps. However, to our best knowledge, no existing methods have explicitly taken into consideration the automated enlargement of congested areas. As such an enlargement is vital to the improvement of clarity, this paper proposes a new automated method to generate schematic network maps, consisting of (a) automated detection of congested areas, (b) automated enlargement of congested areas to a desirable scale and (c) automated generation of the schematic representation of the deformed network maps using a stroke-based approach. The new method has been tested with two real-life network data sets, i.e. the London Tube and Hong Kong metro data sets, and evaluated by fractal analysis and experimental studies. The results of the evaluation indicate that the new method is able to automatically generate the schematic maps with improved clarity and aesthetics.", "paper_title": "Generation of schematic network maps with automated detection and enlargement of congested areas", "paper_id": "WOS:000337185000005"}