{"auto_keywords": [{"score": 0.05007838762916156, "phrase": "quantified_boolean_formulas"}, {"score": 0.043317061259090496, "phrase": "new_clauses"}, {"score": 0.029832341099134376, "phrase": "dll"}, {"score": 0.00459809245936039, "phrase": "automated_reasoning"}, {"score": 0.0044933373574179624, "phrase": "input_formula"}, {"score": 0.004405440436639404, "phrase": "equisatisfiable_formula"}, {"score": 0.004376523540676604, "phrase": "conjunctive_normal_form"}, {"score": 0.00401736307274363, "phrase": "empty_clause"}, {"score": 0.003329456059106911, "phrase": "cnf"}, {"score": 0.003015893651662638, "phrase": "disjunctive_normal_form"}, {"score": 0.00289888453546698, "phrase": "available_procedures"}, {"score": 0.002832731124016696, "phrase": "davis-logemann-loveland_procedure"}, {"score": 0.002634463767377738, "phrase": "theoretical_bases"}, {"score": 0.0025489778320184255, "phrase": "q-resolution_formulas"}, {"score": 0.002378357925871225, "phrase": "based_procedures"}, {"score": 0.002354932118789557, "phrase": "present_solutions"}, {"score": 0.0022486192232506388, "phrase": "propositional_satisfiability"}], "paper_keywords": [""], "paper_abstract": "Resolution is the rule of inference at the basis of most procedures for automated reasoning. In these procedures, the input formula is first translated into an equisatisfiable formula in conjunctive normal form (CNF) and then represented as a set of clauses. Deduction starts by inferring new clauses by resolution, and goes on until the empty clause is generated or satisfiability of the set of clauses is proven, e.g., because no new clauses can be generated. In this paper, we restrict our attention to the problem of evaluating Quantified Boolean Formulas (QBFs). In this setting, the above outlined deduction process is known to be sound and complete if given a formula in CNF and if a form of resolution, called \"Q-resolution\", is used. We introduce Q-resolution on terms, to be used for formulas in disjunctive normal form. We show that the computation performed by most of the available procedures for QBFs-based on the Davis-Logemann-Loveland procedure (DLL) for propositional satisfiability-corresponds to a tree in which Q-resolution on terms and clauses alternate. This poses the theoretical bases for the introduction of learning, corresponding to recording Q-resolution formulas associated with the nodes of the tree. We discuss the problems related to the introduction of learning in DLL based procedures, and present solutions extending state-of-the-art proposals coming from the literature on propositional satisfiability. Finally, we show that our DLL based solver extended with learning, performs significantly better on benchmarks used in the 2003 QBF solvers comparative evaluation.", "paper_title": "Clause/term resolution and learning in the evaluation of Quantified Boolean Formulas", "paper_id": "WOS:000240024500001"}