{"auto_keywords": [{"score": 0.04825016108360528, "phrase": "foam_flooding"}, {"score": 0.04785254869208752, "phrase": "enhanced_oil_recovery"}, {"score": 0.003945879572348638, "phrase": "sweep_efficiency"}, {"score": 0.0033762956164519286, "phrase": "foam_injection_time"}, {"score": 0.003332704619499476, "phrase": "water_injection_time"}, {"score": 0.0032191849045822415, "phrase": "large_savings"}, {"score": 0.002790254164160135, "phrase": "stochastic_optimization_algorithms"}, {"score": 0.0027068691342344545, "phrase": "sensitivity_studies"}, {"score": 0.0026146109167103655, "phrase": "different_parameters"}, {"score": 0.002227083991228041, "phrase": "significant_effects"}], "paper_keywords": ["CO2 foam flooding", " Stochastic optimization", " CMA-ES", " DE", " Well placement optimization"], "paper_abstract": "The use of CO (2) foam flooding for enhanced oil recovery is increasingly becoming common. In this type of enhanced oil recovery, the surfactant is dissolved into CO (2) to form foam and the CO (2) foam is injected alternately with water to improve the sweep efficiency of the flood. However, many parameters affect the effectiveness of this CO (2) flood. Some of these parameters are the concentration of surfactant dissolved in the CO (2), the ratio of the foam injection time to the water injection time (cycle ratio), etc. Large savings in cost can be realized if these parameters are carefully selected. In this work, we optimized CO (2) foam flooding by estimating the parameters that affect the flooding using stochastic optimization algorithms. First, we performed some sensitivity studies to determine the extent of influence of different parameters of the CO (2) foam flood. From the sensitivity studies, we were able to reduce the number of parameters to be optimized to three (cycle ratio, surfactant concentration, and well locations) that have significant effects on the flood. Subsequently, we adopted two optimization algorithms to estimate the three parameters.", "paper_title": "Sensitivity studies and stochastic optimization of CO2 foam flooding", "paper_id": "WOS:000353787600003"}