{"auto_keywords": [{"score": 0.049006033953936275, "phrase": "new_version"}, {"score": 0.045638438023137474, "phrase": "coulomb_potential"}, {"score": 0.03721548550806809, "phrase": "distributed_program"}, {"score": 0.037041256543133456, "phrase": "test_data"}, {"score": 0.035398167732909734, "phrase": "amd"}, {"score": 0.033244050992107095, "phrase": "previous_version"}, {"score": 0.026873309081544214, "phrase": "tensor_terms"}, {"score": 0.004557393168941309, "phrase": "earlier_version"}, {"score": 0.004491542746115223, "phrase": "numerical_accuracy"}, {"score": 0.004398094237005956, "phrase": "new_solver"}, {"score": 0.004095938193599111, "phrase": "large_variety"}, {"score": 0.004082706150165702, "phrase": "skyrme_energy_density_functionals"}, {"score": 0.003946314168776204, "phrase": "mean-field_equations"}, {"score": 0.0037593049833772895, "phrase": "well-controlled_accuracy"}, {"score": 0.003737142044253279, "phrase": "program"}, {"score": 0.003645459595790823, "phrase": "cpc_program_library"}, {"score": 0.0036336775263459712, "phrase": "queen's_university"}, {"score": 0.0036219339365257896, "phrase": "belfast"}, {"score": 0.003610227089295424, "phrase": "n._ireland"}, {"score": 0.0035869274480340727, "phrase": "standard_cpc"}, {"score": 0.0033893426032054366, "phrase": "tar.gz_programming_language"}, {"score": 0.0033349089512525456, "phrase": "amd_opteron"}, {"score": 0.0032655196079410882, "phrase": "linux"}, {"score": 0.003065591141480985, "phrase": "new_version_supersedethe_previous_version"}, {"score": 0.002934420215325608, "phrase": "skyrme-type_energy_density_functionals"}, {"score": 0.002882598440434809, "phrase": "binding_energy"}, {"score": 0.0028732748163934896, "phrase": "even-even_atomic_nuclei"}, {"score": 0.0027861865937118583, "phrase": "single-particle_wave-functions"}, {"score": 0.0027503100455259864, "phrase": "nonlinear_meanfield_equations"}, {"score": 0.002728121532063893, "phrase": "imaginary_time_step_method"}, {"score": 0.002714894206804619, "phrase": "quadratic_constraint"}, {"score": 0.0025902821122771925, "phrase": "main_changes"}, {"score": 0.002499568845686951, "phrase": "final_result"}, {"score": 0.0024673738215365104, "phrase": "new_algorithm"}, {"score": 0.0024277111390190727, "phrase": "code_more_user"}, {"score": 0.0023732496602252976, "phrase": "energy_functionals"}, {"score": 0.002305014991156598, "phrase": "coulomb_problem"}, {"score": 0.0022496504348918827, "phrase": "time-reversal_invariance"}, {"score": 0.002202742267484358, "phrase": "bcs_level"}, {"score": 0.0021498289243008116, "phrase": "rather_heavy_nuclei"}, {"score": 0.0021428703139996104, "phrase": "modest_boxes"}, {"score": 0.0021324745176245882, "phrase": "initial_guess"}, {"score": 0.0021255719607652128, "phrase": "nilsson_wavefunctions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Self-consistent mean field", " Hartree-Fock", " Hartree-Fock plus BCS", " Skyrme interaction", " Quadrupole deformation"], "paper_abstract": "We describe a new version of the Ev8 code that solves the nuclear Skyrme-Hartree-Fock+BCS problem using a 3-dimensional cartesian mesh. Several new features have been implemented with respect to the earlier version published in 2005. In particular, the numerical accuracy has been improved for a given mesh size by (i) implementing a new solver to determine the Coulomb potential for protons, and (ii) implementing a more precise method to calculate the derivatives on a mesh that had already been implemented earlier in our beyond-mean-field codes. The code has been made very flexible to enable the use of a large variety of Skyrme energy density functionals that have been introduced in the last years. Finally, the treatment of the constraints that can be introduced in the mean-field equations has been improved. The code Ev8 is today the tool of choice to study the variation of the energy of a nucleus from its ground state to very elongated or triaxial deformations with a well-controlled accuracy. Program summary Program title: Ev8 Catalogue identifier: ADWA_v2_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/ADWA_v2_0.html Program obtainable from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.html No. of lines in distributed program, including test data, etc.: 29956 No. of bytes in distributed program, including test data, etc.: 235072 Distribution format: tar.gz Programming language: FORTRAN-90. Computer: AMD Opteron 6274, AMD Opteron 6134, AMD Opteron 2378, Intel Core i7-4700HQ. Operating system: Unix, Linux, OS X. RAM: On the order of 64 megabytes for the examples provided. Classification: 17.22. Catalogue identifier of previous version: ADWA_v1_0 Journal reference of previous version: Comput. Phys. Comm. 171(2005)49 Does the new version supersedethe previous version?: Yes, but when used in the same conditions both codes give the same result. Nature of problem: By means of the Hartree-Fock+BCS method for Skyrme-type energy density functionals, Ev8 allows the study of the evolution of the binding energy of even-even atomic nuclei for various shapes determined by the most general quadrupole and monopole constraints. Solution method: The program expands the single-particle wave-functions on a 3D Cartesian mesh. The nonlinear meanfield equations are solved by the imaginary time step method. A quadratic constraint is used to obtain states corresponding to given values of the monopole and quadrupole operators. Reasons for new version: The code has been generalized in several directions. The main changes concern the energy density functional that is more general than previously (including now tensor terms) and the accuracy of the final result that has been significantly improved by a new algorithm to determine the Coulomb potential. Several other changes should make the code more user friendly than it was before. Summary of revisions: 1. Skyrme energy functionals with tensor terms; 2. Improved accuracy for calculating derivatives; 3. Improved accuracy for solving Coulomb problem; 4. Improvement of the numerics of constraints; Restrictions: Ev8 assumes time-reversal invariance and nuclear shapes exhibiting three plane-reflection symmetries. Pairing correlations are treated at the BCS level of approximation. Running time: A few minutes for the examples provided, which concern rather heavy nuclei in modest boxes with an initial guess of Nilsson wavefunctions. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Solution of the Skyrme-HF plus BCS equation on a 3D mesh, II: A new version of the Ev8 code", "paper_id": "WOS:000346954200020"}