{"auto_keywords": [{"score": 0.04932160836507746, "phrase": "embedded_systems"}, {"score": 0.044865976779112575, "phrase": "xip"}, {"score": 0.043512303377877634, "phrase": "memory_usage"}, {"score": 0.00481495049065317, "phrase": "quasistatic_shared_libraries"}, {"score": 0.004784331242964228, "phrase": "xip_for_memory_footprint_reduction"}, {"score": 0.004678681971460014, "phrase": "rapid_decrease"}, {"score": 0.0046046429665581555, "phrase": "solid_state_memory_devices"}, {"score": 0.004403480614319231, "phrase": "shared_libraries"}, {"score": 0.004065785082284677, "phrase": "mmu"}, {"score": 0.003826492478418294, "phrase": "novel_shared_library_technique"}, {"score": 0.003476914643052379, "phrase": "actual_physical_addresses"}, {"score": 0.0034327752490106818, "phrase": "loading_time"}, {"score": 0.0034000375671935953, "phrase": "conventional_shared_libraries"}, {"score": 0.0033354927389810207, "phrase": "symbol_tables"}, {"score": 0.003293142761521425, "phrase": "valuable_memory_space"}, {"score": 0.003220315882881027, "phrase": "expedited_address_translation"}, {"score": 0.0030892986597489485, "phrase": "data_section"}, {"score": 0.0029635959701543313, "phrase": "mmu's_memory_mapping_feature"}, {"score": 0.002935319576795509, "phrase": "data_section_base_register"}, {"score": 0.002916618252808186, "phrase": "dsbr"}, {"score": 0.0028795712616923462, "phrase": "data_section_base_table"}, {"score": 0.002797922160172791, "phrase": "proposed_techniques"}, {"score": 0.0023999058090187985, "phrase": "flash_memory_usage"}, {"score": 0.002339293926434437, "phrase": "ram_usage"}, {"score": 0.0023095631438900728, "phrase": "shared_library"}, {"score": 0.0021595521075096808, "phrase": "uclinux-based_embedded_systems"}, {"score": 0.0021049977753042253, "phrase": "mmu-less_real-time_operating_system"}], "paper_keywords": ["Embedded systems", " memory footprint reduction", " MMU-less", " quasi-static linking", " shared library", " XIP"], "paper_abstract": "Despite a rapid decrease in the price of solid state memory devices, system memory is still a very precious resource in embedded systems. The use of shared libraries and execution-in-place (XIP) is known to be effective in significantly reducing memory usage. Unfortunately, many resource-constrained embedded systems lack an MMU, making it extremely difficult to support these techniques. To address this problem, we propose a novel shared library technique called a quasi-static shared library and an XIP, both based on our enhanced position independent code technique. In our quasistatic shared libraries, global symbols are bound to pseudoaddresses at linking time and actual physical addresses are bound at loading time. Unlike conventional shared libraries, they do not require symbol tables that take up valuable memory space and, therefore, allow for expedited address translation at runtime. Our XIP technique is facilitated by our enhanced position independent code where a data section can be arbitrarily located. Both the shared library and XIP techniques are made possible by emulating an MMU's memory mapping feature with a data section base register (DSBR) and a data section base table (DSBT). We have implemented these proposed techniques in a commercial ADSL ( Asymmetric Digital Subscriber Line) home network gateway equipped with an MMU-less ARM7TDMI processor core, 2MB flash memory, and 16MB RAM. We measured its memory usage and evaluated its performance overhead by conducting a series of experiments. These experiments clearly demonstrate the effectiveness of our techniques in reducing memory usage. The results are impressive: 35% reduction in flash memory usage when using only the shared library and 30% reduction in RAM usage when using the shared library and XIP together. These results were achieved with only a negligible performance penalty of less than 4%. Even though these techniques were applied to uClinux-based embedded systems, they can be used for any MMU-less real-time operating system.", "paper_title": "Quasistatic Shared Libraries and XIP for Memory Footprint Reduction in MMU-less Embedded Systems", "paper_id": "WOS:000262130700006"}