{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service_differentiation"}, {"score": 0.04991492492941136, "phrase": "based_resource-provision_incentive_mechanisms"}, {"score": 0.028231206913971938, "phrase": "punishment-based_scheme"}, {"score": 0.027119078070990572, "phrase": "reward-based_scheme"}, {"score": 0.003852791434660505, "phrase": "independent_and_rational_peers"}, {"score": 0.0037742798298349145, "phrase": "service_differentiation_based_incentive_mechanisms"}, {"score": 0.0035849042994947366, "phrase": "defect_behavior"}, {"score": 0.003463944293093155, "phrase": "cooperative_behavior"}, {"score": 0.0033470519476222304, "phrase": "naturally_resulted_question"}, {"score": 0.003061206247127742, "phrase": "traditional_service_differentiation"}, {"score": 0.003050712095258931, "phrase": "based_incentive_schemes"}, {"score": 0.0029376169407844314, "phrase": "whole_system"}, {"score": 0.0028975361811534265, "phrase": "punishment-based_and_reward-based_schemes"}, {"score": 0.002771001596749451, "phrase": "small_entry_fee"}, {"score": 0.002622806755354039, "phrase": "high-level_service_plus_punishment"}, {"score": 0.0025168721570288295, "phrase": "low-level_service"}, {"score": 0.002440231768165477, "phrase": "existing_result"}, {"score": 0.002398664348595521, "phrase": "persistent_users'_identities"}, {"score": 0.002325615071949044, "phrase": "punisher's_average_payoff"}, {"score": 0.002247049536955401, "phrase": "unfeasible_case"}, {"score": 0.002163682878218085, "phrase": "reward_cost"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Peer-to-Peer (P2P)", " Incentive mechanisms", " Public goods game", " Service differentiation"], "paper_abstract": "Intrinsically, P2P (Peer-to-Peer) networks are anonymous, dynamic and autonomous, which has the following implications: users can change their identities with near zero cost (cheap pseudonyms): most interactions should be one-time (that is, each peer has no idea about other peers' behavior history, except their current behaviors): and all behaviors and actions are all endogenous, voluntarily chosen and determined by independent and rational peers. On the other hand, service differentiation based incentive mechanisms are proposed in P2P networks, which basically could be provided with two ways: punish defect behavior (punishment-based scheme), or reward cooperative behavior (reward-based scheme). Then the naturally resulted question is that: under the above P2P networking environment, how to effectively design service differentiation based resource-provision incentive mechanisms? Our contributions are threefold. First, we found that the traditional service differentiation based incentive schemes cannot successfully encourage peers to contribute resource to the whole system, irrespective of punishment-based and reward-based schemes. Then, if peers can voluntarily join the system, and small entry fee is set for participation, we obtained that the performance of punishment-based scheme (first providing high-level service plus punishment) is always better than that of reward-based scheme (first providing low-level service plus reward). Finally, unlike the existing result that was based on persistent users' identities and truly repeated interactions, we illustrate that punisher's average payoff in punishment-based scheme is almost same as the ideal but unfeasible case of reward-based scheme: rewarder could selectively reward other rewarders, and reward cost is zero. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "On the effectiveness of service differentiation based resource-provision incentive mechanisms in dynamic and autonomous P2P networks", "paper_id": "WOS:000296302300001"}