{"auto_keywords": [{"score": 0.041151091516397675, "phrase": "standardised_nursing_wound_care_record"}, {"score": 0.013749589751948938, "phrase": "district_nurses'_experiences"}, {"score": 0.01237747228410281, "phrase": "intervention_group"}, {"score": 0.00481495049065317, "phrase": "nursing_documentation-an_intervention_study"}, {"score": 0.004475436844227947, "phrase": "standardised_nursing_record"}, {"score": 0.004394350285140955, "phrase": "leg_ulcer"}, {"score": 0.004236539316738291, "phrase": "nursing_record"}, {"score": 0.0038240605592708083, "phrase": "electronic_patient_record"}, {"score": 0.0036866541358511005, "phrase": "pre-_and_post-intervention_audits"}, {"score": 0.0031497178007011666, "phrase": "district_nurses'_opinions"}, {"score": 0.0030925761790620027, "phrase": "district_nurses'_self-reported_knowledge"}, {"score": 0.0028220038404484196, "phrase": "nursing_relevance"}, {"score": 0.002613056713968863, "phrase": "standardised_nursing_wound_care_record_improved_nursing_documentation_meeting_legal_demands"}, {"score": 0.002265095354846931, "phrase": "nursing_records"}, {"score": 0.0022158306933307685, "phrase": "clinical_reasoning"}, {"score": 0.0021996478802839316, "phrase": "nursing_care"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Nursing records", " Community health nursing", " Primary health care", " Medical records computerized", " Wound care"], "paper_abstract": "Aim: The aim was to implement and evaluate a standardised nursing record, using patients with leg ulcer as an example, regarding the content of the nursing record and district nurses' experiences of documentation. Method: This was a prospective, stratified and randomised intervention study, with one intervention group and one control group. A standardised nursing wound care record was designed and implemented in the electronic patient record in the intervention group for a period of 3 months. Pre- and post-intervention audits of nursing records [n = 102 and n = 92, respectively] were carried out and 126 district nurses answered questionnaires pre-intervention and 83 post-intervention. Result: The standardised nursing wound care record led to more informative, comprehensive and knowledge-intensive documentation according to the audit and district nurses' opinions. Furthermore, the district nurses' self-reported knowledge of nursing documentation increased in the intervention group. When the standardised nursing wound care record was not used, the documentation was mostly incomplete with a lack of nursing relevance. There were no differences in the district nurses' experiences of documentation in general between the two groups. Conclusion: Using the standardised nursing wound care record improved nursing documentation meeting legal demands, which should increase the safety of patient. There was however a discrepancy between the nurses stated knowledge and how they carried out the documentation. Regular in-service training together with use of evidence based standardised nursing records, as a link to clinical reasoning about nursing care, could be ways effecting change. (C) 2009 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Advancing nursing documentation-An intervention study using patients with leg ulcer as an example", "paper_id": "WOS:000269116400004"}