{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "online_presence"}, {"score": 0.0044967055264893184, "phrase": "nanotechnology_industry"}, {"score": 0.0043703658695579085, "phrase": "wider_social_debate"}, {"score": 0.004058180509184539, "phrase": "important_topic"}, {"score": 0.0039216854691927865, "phrase": "nascent_nature"}, {"score": 0.0036622637391432143, "phrase": "backlash_biotech_companies"}, {"score": 0.0034789831290103967, "phrase": "crawling_tool"}, {"score": 0.0032860401904845522, "phrase": "key_nanotechnology_companies"}, {"score": 0.002881793492919646, "phrase": "social_and_technical_issues"}, {"score": 0.0027689017918347755, "phrase": "home_pages"}, {"score": 0.002442025065383455, "phrase": "scientific_community"}, {"score": 0.0023064582783867645, "phrase": "social_aspects"}, {"score": 0.002254357921422124, "phrase": "commercial_developers"}], "paper_keywords": ["nanotechnology", " social risk", " science communication", " online networks", " hyperlink analysis", " cybermapping"], "paper_abstract": "This article examines whether the nanotechnology industry is engaging in the wider social debate surrounding it, through an analysis of its online communication practices. This is an important topic to study, given the nascent nature of the technology and the concerns among proponents to avoid the backlash biotech companies faced over genetically modified (GM) crops. Applying a new web crawling tool, the study captures and codes the hyperlinks of key nanotechnology companies according to their social and technical orientation, and status as producers, disseminators, and commercializers. The links are mapped and the prominence of social and technical issues is assessed. Finally, the home pages of sites are content analyzed to contextualize the presentation of the debate. The results show that although parts of the scientific community may have accepted the case for more engagement with the social aspects of nanotech, commercial developers are more reluctant to do so, at least based on their online presence.", "paper_title": "Engaging With the Public? Assessing the Online Presence and Communication Practices of the Nanotechnology Industry", "paper_id": "WOS:000282317300003"}