{"auto_keywords": [{"score": 0.04666258258786453, "phrase": "sisp"}, {"score": 0.036020292220817644, "phrase": "strategic_awareness"}, {"score": 0.03509456208045118, "phrase": "strategy_conception"}, {"score": 0.00481495049065317, "phrase": "strategic_information_systems_planning"}, {"score": 0.0043533862892678864, "phrase": "uncertain_environment"}, {"score": 0.004295269532032448, "phrase": "greater_planning_success"}, {"score": 0.0037549546301384336, "phrase": "sisp_phases"}, {"score": 0.0033718991936259038, "phrase": "situation_analysis"}, {"score": 0.003282383509542342, "phrase": "strategy_formulation"}, {"score": 0.0030482430937467013, "phrase": "environmental_uncertainty"}, {"score": 0.0027929100418926725, "phrase": "sisp_success"}, {"score": 0.0024247382451294255, "phrase": "postal_survey"}, {"score": 0.002344468886431959, "phrase": "successful_planning"}], "paper_keywords": ["strategic information systems planning", " environmental uncertainty", " planning success"], "paper_abstract": "Researchers have suggested that more extensive strategic information systems planning (SISP) in an uncertain environment produces greater planning success. Managers must decide whether, and if so when, to perform such SISP. Our study tested the effect of SISP phases on planning success in more and less uncertain environments. A questionnaire assessed SISP in terms of strategic awareness, situation analysis, strategy conception, strategy formulation, and strategy implementation planning phases. It inquired about environmental uncertainty as dynamism, heterogeneity, and hostility. Finally, it measured SISP success as a composite of alignment, analysis, cooperation, and capabilities. One hundred and sixty-one IS executives provided data in a postal survey. More extensive strategy formulation uniformly predicted successful planning in more uncertain environments, whereas strategic awareness generally predicted it in less uncertain ones. Strategy conception predicted it in neither more nor less uncertain environments. More extensive planning is thus not uniformly successful in either environment but depends on the nature of the uncertainty. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "The effectiveness of strategic information systems planning under environmental uncertainty", "paper_id": "WOS:000238000100007"}