{"auto_keywords": [{"score": 0.04241095885258918, "phrase": "general_hybrid"}, {"score": 0.036588740387536144, "phrase": "type_ii"}, {"score": 0.004303830426772906, "phrase": "termination_time"}, {"score": 0.003926105480202798, "phrase": "censoring_scheme"}, {"score": 0.0038862297330905836, "phrase": "type_i_or_type_ii_bounds"}, {"score": 0.0033685408148574846, "phrase": "generalized_type"}, {"score": 0.002718045523483502, "phrase": "balakrishnan_et_al"}, {"score": 0.0025958582759972315, "phrase": "unified_hybrid"}, {"score": 0.002530359917257626, "phrase": "exponential_distribution"}, {"score": 0.0025046245057922557, "phrase": "j._statist"}, {"score": 0.002272794656458419, "phrase": "special_case"}, {"score": 0.0021049977753042253, "phrase": "fisher_information"}], "paper_keywords": ["censored data", " hazard function", " order statistics", " addition rule"], "paper_abstract": "Various hybrid censoring schemes, which are mixtures of Type I and Type II censoring schemes, have been suggested for flexibility in termination time and efficiency level. In this paper, we propose a general hybrid censoring scheme to be a censoring scheme with Type I or Type II bounds which provides more flexible termination time and efficiency level. The Type I hybrid censoring scheme can be interpreted as a Type I censoring scheme with a Type II upper bound, while the generalized Type I hybrid censoring can be interpreted as a Type I censoring scheme with Type II lower and upper bounds. The bounds involved in the termination can also be a hybrid. We then show that the unified hybrid censoring scheme of Balakrishnan et al. [Exact likelihood inference based on an unified hybrid censored sample from the exponential distribution, J. Statist. Comput. Simul. 78 (2008), pp. 475-488] is a special case of the general hybrid censoring scheme. Finally, we discuss several new hybrid censoring schemes and evaluate the Fisher information contained in them.", "paper_title": "A very flexible hybrid censoring scheme and its Fisher information", "paper_id": "WOS:000302056500003"}