{"auto_keywords": [{"score": 0.03698235821218503, "phrase": "sensor_networks"}, {"score": 0.00481495049065317, "phrase": "topology-transparent_scheduling"}, {"score": 0.004217537792708984, "phrase": "stronger_form"}, {"score": 0.004009894739765119, "phrase": "frame_boundaries"}, {"score": 0.003909923690310641, "phrase": "slot_boundaries"}, {"score": 0.0036707250689857348, "phrase": "global_time"}, {"score": 0.003276321257403678, "phrase": "bounded_delay"}, {"score": 0.0028692628457408025, "phrase": "node_schedules"}, {"score": 0.0025285834281312705, "phrase": "unique_identifiers"}, {"score": 0.002481085648977413, "phrase": "costly_neighbour_discovery"}, {"score": 0.0023587312574818208, "phrase": "combinatorial_design_problem_oil_cyclic_superimposed_codes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["topology-transparent scheduling", " synchronization", " superimposed codes"], "paper_abstract": "We propose a slot synchronized topology-transparent medium access control (MAC) protocol for sensor networks. Most of the earlier scheduled approaches require a stronger form of synchronization where nodes are synchronized on frame boundaries. Synchronizing on slot boundaries is simpler to achieve since it does not require global time, making the protocol practical for sensor networks. The benefit of topology-transparency is that it ensures a bounded delay to each neighbour as long as the number of actively transmitting nodes in a neighbourhood is at most D-max. The node schedules are independent of which nodes are active. Such a topology-transparent solution is particularly suitable for sensor networks, where nodes may not have unique identifiers, eliminating costly neighbour discovery. We formulate the problem as a combinatorial design problem oil cyclic superimposed codes and give a constructive proof of existence along with a delay bound. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Slot synchronized topology-transparent scheduling for sensor networks", "paper_id": "WOS:000235827000003"}