{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "buyers'_uncertainty"}, {"score": 0.015585084079454931, "phrase": "taste-related_product_attributes"}, {"score": 0.010526031427238987, "phrase": "consumer_reviews"}, {"score": 0.004010960493946656, "phrase": "analytical_model"}, {"score": 0.0037087324991876727, "phrase": "larger_share"}, {"score": 0.003660614912817745, "phrase": "overall_market"}, {"score": 0.003535320700255283, "phrase": "practical_ways"}, {"score": 0.003129509028432954, "phrase": "paper's_main_contribution"}, {"score": 0.0030888830649190282, "phrase": "extant_literature"}, {"score": 0.002868404184756449, "phrase": "buyer_reviews"}, {"score": 0.0027461155463816772, "phrase": "consumer_uncertainty"}, {"score": 0.002722288966917744, "phrase": "taste-related_attributes"}, {"score": 0.002686935113435742, "phrase": "papers's_findings"}, {"score": 0.0024842242921857705, "phrase": "previous_literature"}, {"score": 0.0023886641270884973, "phrase": "key_indicator"}, {"score": 0.002151388538895855, "phrase": "product_quality"}, {"score": 0.0021049977753042253, "phrase": "previous_buyers"}], "paper_keywords": ["consumer uncertainty reduction", " information dissemination", " product ratings", " product review variance"], "paper_abstract": "It is becoming increasingly important for firms to know when to take steps to reduce buyers' uncertainty about products and services. This paper focuses on investments that firms can make to reduce buyers' uncertainty about taste-related product attributes. Using an analytical model, we show that firms should disclose more taste-related information when the customer segment they directly target represents a larger share of the overall market. We further show that there are practical ways by which managers can decide if such disclosure investments are financially beneficial to their firms. Specifically, we show that the variance of consumer reviews can guide such decisions. The paper's main contribution to the extant literature is to show that firms must consider the variance, but not the mean, of buyer reviews, to determine the need to invest in reducing consumer uncertainty about taste-related attributes. The papers's findings are managerially important due to the ubiquity of consumer reviews. They are novel because most of the previous literature views the mean of the review as the key indicator. Finally, they are general in their applicability since they are independent of any assumptions about heuristics that buyers may use to ascertain product quality from the reviews of previous buyers.", "paper_title": "Reducing Buyers' Uncertainty About Taste-Related Product Attributes", "paper_id": "WOS:000328259900011"}