{"auto_keywords": [{"score": 0.03591401802576073, "phrase": "active_site"}, {"score": 0.01798264570371676, "phrase": "effector_substrate"}, {"score": 0.01573820284807923, "phrase": "active_substrate"}, {"score": 0.010440155729050668, "phrase": "molecular_dynamics_simulations"}, {"score": 0.010372040198483, "phrase": "free_energy_calculations"}, {"score": 0.009218534591936129, "phrase": "negative_cooperativity"}, {"score": 0.007798847601711471, "phrase": "active_site_residues"}, {"score": 0.005764699332071913, "phrase": "active_and_effector_sites"}, {"score": 0.00481495049065317, "phrase": "negative_cooperativity_mechanism"}, {"score": 0.00446384610114756, "phrase": "hallmark_peculiar_feature"}, {"score": 0.00433350214927936, "phrase": "pronounced_negative_cooperativity"}, {"score": 0.003951736710391294, "phrase": "structural_differences"}, {"score": 0.0036392821787269727, "phrase": "active_site_cavity"}, {"score": 0.0031067299689394065, "phrase": "crucial_role"}, {"score": 0.003025854378927907, "phrase": "short-range_effects"}, {"score": 0.002966578246443101, "phrase": "key_factor"}, {"score": 0.0028893405654376826, "phrase": "proton_delivery"}, {"score": 0.0028141081648971754, "phrase": "long-range_effect"}, {"score": 0.0026871217010784143, "phrase": "key_role"}, {"score": 0.002490789449396715, "phrase": "significant_role"}, {"score": 0.002441969502075509, "phrase": "ligand_positioning"}, {"score": 0.002386218074955624, "phrase": "negative_cooperative_binding"}, {"score": 0.002270989884755432, "phrase": "pi-pi_stacking"}, {"score": 0.0022338277339064155, "phrase": "hydroxylation_activity"}, {"score": 0.00215419297939962, "phrase": "previous_experimental_observations"}, {"score": 0.002125942645854997, "phrase": "detailed_atomistic_insight"}, {"score": 0.0021049977753042253, "phrase": "poorly_understood_mechanism"}], "paper_keywords": [""], "paper_abstract": "Human cytochrome P450 2E1 (CYP2E1) participates in the metabolism of over 2% of all the oral drugs. A hallmark peculiar feature of this enzyme is that it exhibits a pronounced negative cooperativity in substrate binding. However the mechanism by which the negative cooperativity occurs is unclear. Here, we performed molecular dynamics simulations and free energy calculations on human CYP2E1 to examine the structural differences between the substrate-free and the enzymes with one and two aniline molecules bound. Our results indicate that although the effector substrate does not bind in the active site cavity, it still can directly interact with the active site residues of human CYP2E1. The interaction of the effector substrate with the active site leads to a reorientation of active site residues, which thereby weakens the interactions of the active substrate with this site. We also identify a conserved residue T303 that plays a crucial role in the negative cooperative binding on the short-range effects. This residue is a key factor in the positioning of substrates and in proton delivery to the active site. Additionally, a long-range effect of the effector substrate is identified in which F478 is proposed to play a key role. As located in the interface between the active and effector sites, this residue structurally links the active and effector sites and is found to play a significant role in affecting substrate access and ligand positioning within the active site. In the negative cooperative binding, this residue can decrease the interactions of the active substrate with the active site by pi-pi stacking which then lowers the hydroxylation activity for the active substrate. These findings are in agreement with previous experimental observations and thus provide detailed atomistic insight into the poorly understood mechanism of the negative cooperativity in human CYP2E1.", "paper_title": "A Negative Cooperativity Mechanism of Human CYP2E1 Inferred from Molecular Dynamics Simulations and Free Energy Calculations", "paper_id": "WOS:000298315900019"}