{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "aspe"}, {"score": 0.007392094844361746, "phrase": "vehicular_ad_hoc_networks"}, {"score": 0.00495643547383548, "phrase": "encryption_keys"}, {"score": 0.004855750359759005, "phrase": "transmitted_data"}, {"score": 0.004300830853119242, "phrase": "high_speeds"}, {"score": 0.0034841647157189985, "phrase": "attribute_based_encryption"}, {"score": 0.003361069456060196, "phrase": "attribute_based_security_policy_enforcement"}, {"score": 0.002793260314529583, "phrase": "vanet_situations"}, {"score": 0.00266693888510356, "phrase": "data_access_control_policies"}, {"score": 0.002559444836360178, "phrase": "integrated_solution"}, {"score": 0.0025202582748972122, "phrase": "data_access_control"}, {"score": 0.0024062532032402533, "phrase": "highly_dynamic_vehicular_communication_environments"}, {"score": 0.0022390533383717715, "phrase": "large_amount"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Security", " Vehicular networks", " Secure group communications", " Key management", " Attribute based encryption"], "paper_abstract": "Vehicular ad hoc networks (VANETs) are usually operated among vehicles moving at high speeds, and thus their communication relations can be changed frequently. in such a highly dynamic environment, establishing trust among vehicles is difficult. To solve this problem, we propose a flexible, secure and decentralized attribute based secure key management framework for VANETs. Our solution is based on attribute based encryption (ABE) to construct an attribute based security policy enforcement (ASPE) framework. ASPE considers various road situations as attributes. These attributes are used as encryption keys to secure the transmitted data. ASPE is flexible in that it can dynamically change encryption keys depending on the VANET situations. At the same time, ASPE naturally incorporates data access control policies on the transmitted data. ASPE provides an integrated solution to involve data access control, key management, security policy enforcement, and secure group formation in highly dynamic vehicular communication environments. Our performance evaluations show that ASPE is efficient and it can handle large amount of data encryption/decryption flows in VANETs. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "ASPE: attribute-based secure policy enforcement in vehicular ad hoc networks", "paper_id": "WOS:000268919600009"}