{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "anonymous_users"}, {"score": 0.01484705544239351, "phrase": "service_providers"}, {"score": 0.004274396662662802, "phrase": "selective_deanonymization"}, {"score": 0.004078439401031372, "phrase": "trusted_third_party"}, {"score": 0.0039480480866752165, "phrase": "ttp"}, {"score": 0.003891430578662587, "phrase": "user's_privacy"}, {"score": 0.003343691804204423, "phrase": "\"double_spending"}, {"score": 0.0033076455392068095, "phrase": "electronic_cash"}, {"score": 0.0028936710552719806, "phrase": "web_site"}, {"score": 0.0028521342925204554, "phrase": "blac"}, {"score": 0.002624577999455744, "phrase": "revoked_users"}, {"score": 0.00251313643823856, "phrase": "arbitrary_deanonymization"}, {"score": 0.0024326641072463157, "phrase": "d-strikes-out_revocation_policy"}, {"score": 0.002230418233881411, "phrase": "first_time"}], "paper_keywords": ["Algorithms", " Security", " Privacy", " anonymous authentication", " user misbehavior", " anonymous blacklisting", " privacy-enhanced revocation"], "paper_abstract": "Several credential systems have been proposed in which users can authenticate to service providers anonymously. Since anonymity can give users the license to misbehave, some variants allow the selective deanonymization (or linking) of misbehaving users upon a complaint to a Trusted Third Party (TTP). The ability of the TTP to revoke a user's privacy at any time, however, is too strong a punishment for misbehavior. To limit the scope of deanonymization, some systems have been proposed in which users can be deanonymized only if they authenticate \"too many times,\" such as \"double spending\" with electronic cash. While useful in some applications, such techniques cannot be generalized to more subjective definitions of misbehavior, for example, using such schemes it is not possible to block anonymous users who \"deface too many Web pages\" on a Web site. We present BLAC, the first anonymous credential system in which service providers can revoke the credentials of misbehaving users without relying on a TTP. Since revoked users remain anonymous, misbehaviors can be judged subjectively without users fearing arbitrary deanonymization by a TTP. Additionally, our construction supports a d-strikes-out revocation policy, whereby users who have been subjectively judged to have repeatedly misbehaved at least d times are revoked from the system. Thus, for the first time, it is indeed possible to block anonymous users who have \"defaced too many Web pages\" using our scheme.", "paper_title": "BLAC: Revoking Repeatedly Misbehaving Anonymous Users without Relying on TTPs", "paper_id": "WOS:000285713900011"}