{"auto_keywords": [{"score": 0.03739946659561868, "phrase": "extreme_absence"}, {"score": 0.007565794693861945, "phrase": "minimal_degree"}, {"score": 0.006333358412119721, "phrase": "insufficient_creativity"}, {"score": 0.00481495049065317, "phrase": "feist"}, {"score": 0.004605147081797856, "phrase": "feist_publications"}, {"score": 0.00453113241842654, "phrase": "rural_tel"}, {"score": 0.004494570360108983, "phrase": "service_co."}, {"score": 0.004404445045826858, "phrase": "constitutional_requirement"}, {"score": 0.004281284532043714, "phrase": "specific_sense"}, {"score": 0.0041112665381266315, "phrase": "independent_creation"}, {"score": 0.00374531366198605, "phrase": "major_constituent"}, {"score": 0.0037150687722055727, "phrase": "different_levels"}, {"score": 0.00342568771304873, "phrase": "gestalt_effect"}, {"score": 0.0029244418026475832, "phrase": "automatic_mechanical_procedure"}, {"score": 0.002865710140187219, "phrase": "historical_resonance"}, {"score": 0.002547535564922075, "phrase": "computational_process"}, {"score": 0.0021049977753042253, "phrase": "real-world_conditions"}], "paper_keywords": [""], "paper_abstract": "The decision of the U.S. Supreme Court in 1991 in Feist Publications, Inc. v. Rural Tel. Service Co. affirmed originality as a constitutional requirement for copyright. Originality has a specific sense and is constituted by a minimal degree of creativity and independent creation. The not original is the more developed concept within the decision. It includes the absence of a minimal degree of creativity as a major constituent. Different levels of absence of creativity also are distinguished, from the extreme absence of creativity to insufficient creativity. There is a gestalt effect of analogy between the delineation of the not original and the concept of computability. More specific correlations can be found within the extreme absence of creativity. \"[S]o mechanical\" in the decision can be correlated with an automatic mechanical procedure and clauses with a historical resonance with understandings of computability as what would naturally be regarded as computable. The routine within the extreme absence of creativity can be regarded as the product of a computational process. The concern of this article is with rigorously establishing an understanding of the extreme absence of creativity, primarily through the correlations with aspects of computability. The understanding established is consistent with the other elements of the not original. It also revealed as testable under real-world conditions. The possibilities for understanding insufficient creativity, a minimal degree of creativity, and originality, from the understanding developed of the extreme absence of creativity, are indicated.", "paper_title": "The Absence of Creativity in Feist and the Computational Process", "paper_id": "WOS:000283565500013"}