{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "maximal_hyperclique_pattern"}, {"score": 0.004558977045730675, "phrase": "hyperclique_pattern"}, {"score": 0.004466519142879166, "phrase": "new_type"}, {"score": 0.004405919996432158, "phrase": "association_pattern"}, {"score": 0.0032616462517547477, "phrase": "maximal_hyperclique_patterns"}, {"score": 0.0031091858573262265, "phrase": "hyperclique_patterns"}, {"score": 0.0029235593748707495, "phrase": "pattern-based_clustering"}, {"score": 0.002825251837733693, "phrase": "key_advantages"}, {"score": 0.002602555367635598, "phrase": "equivalence_pruning_method"}, {"score": 0.002463906556781983, "phrase": "dfs_strategy"}, {"score": 0.0023486473525617816, "phrase": "bfs_strategy"}, {"score": 0.0021049977753042253, "phrase": "standard_maximal_frequent_pattern_mining_algorithms"}], "paper_keywords": ["data mining", " association rules", " hyperclique patterns"], "paper_abstract": "A hyperclique pattern is a new type of association pattern that contains items which are highly affiliated with each other. Specifically, the presence of an item in one transaction strongly implies the presence of every other item that belongs to the same hyperclique pattern. In this paper, we present an algorithm for mining maximal hyperclique patterns, which specifies a more compact representation of hyperclique patterns and are desirable for many applications, such as pattern-based clustering. Our algorithm exploits key advantages of both the Depth First Search (DFS) strategy and the Breadth First Search (BFS) strategy. Indeed, we adapt the equivalence pruning method, one of the most efficient pruning methods of the DFS strategy, into the process of the BFS strategy. Our experimental results show that the performance of our algorithm can be orders of magnitude faster than standard maximal frequent pattern mining algorithms, particularly at low levels of support. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Mining maximal hyperclique pattern: A hybrid search strategy", "paper_id": "WOS:000242985400003"}