{"auto_keywords": [{"score": 0.043616210216916355, "phrase": "information_systems"}, {"score": 0.00481495049065317, "phrase": "information_systems_research"}, {"score": 0.004392565073466714, "phrase": "philosophical_works"}, {"score": 0.004354315061804687, "phrase": "jacque_derrida"}, {"score": 0.004042295865725559, "phrase": "qualitative_approach"}, {"score": 0.00398959232769596, "phrase": "organizational_texts"}, {"score": 0.0036553070575015344, "phrase": "social_and_technical_past"}, {"score": 0.003305243635051068, "phrase": "language-based_approaches"}, {"score": 0.0030547611342112693, "phrase": "linguistic_turn"}, {"score": 0.0030281251520610604, "phrase": "social_science_research"}, {"score": 0.0029110999689379497, "phrase": "management_research"}, {"score": 0.0028480459059007468, "phrase": "research_publications"}, {"score": 0.0021516366862117707, "phrase": "qualitative_research_papers"}, {"score": 0.0021049977753042253, "phrase": "european_journal"}], "paper_keywords": ["deconstruction", " post-structuralism", " discourse analysis", " information systems practice", " qualitative methods"], "paper_abstract": "Deconstruction, a post-structuralist approach to examining language in texts, is most often associated with the philosophical works of Jacque Derrida. After a flurry of interest among management and information systems (IS) scholars, this qualitative approach to exploring organizational texts has received little attention in the IS literature. We suggest deconstruction could help our field explore how IS texts describe the social and technical past and also prescribe and circumscribe the future of IS practice. Thus, we suggest the IS field reconsider how deconstruction might contribute to language-based approaches in IS research and practice. In this paper, we discuss deconstruction in light of the linguistic turn in social science research and the support and criticism for its use in management research. We consider IS research publications that have employed deconstruction explicitly, examine a well-known IS publication as an example of the deconstruction of IS texts, and suggest ways in which deconstruction might be applied to various genres of IS texts to inspire insights and creativity. To conclude, we highlight considerations for researchers who might adopt this approach and for the editors and reviewers who would evaluate qualitative research papers that employ deconstruction. European Journal of Information Systems (2012) 21, 192-206. doi:10.1057/ejis.2011.55; published online 15 November 2011", "paper_title": "Reconsidering deconstruction in information systems research", "paper_id": "WOS:000301619100007"}