{"auto_keywords": [{"score": 0.03357054561083677, "phrase": "user_experience"}, {"score": 0.00481495049065317, "phrase": "recombinant_computing"}, {"score": 0.0047547526023100665, "phrase": "ad_hoc_interoperability"}, {"score": 0.00471503739362446, "phrase": "evolving_digital_networks"}, {"score": 0.004483585361583022, "phrase": "interoperable_systems"}, {"score": 0.0043721365634105565, "phrase": "specific_forms"}, {"score": 0.00403709306806495, "phrase": "new_behaviors"}, {"score": 0.003838791650587681, "phrase": "communication_specifics"}, {"score": 0.003759057920801288, "phrase": "development_time"}, {"score": 0.003398714712611042, "phrase": "system-imposed_constraints"}, {"score": 0.0033141428467975795, "phrase": "hoc_use"}, {"score": 0.002873038567884343, "phrase": "detailed_semantic_knowledge"}, {"score": 0.0027548146060608902, "phrase": "tight_semantic_integration"}, {"score": 0.0023879771786116228, "phrase": "semantic_arbitration"}], "paper_keywords": [""], "paper_abstract": "This article describes an infrastructure that supports the creation of interoperable systems while requiring only limited prior agreements about the specific forms of communication between these systems. Conceptually, our approach uses a set of \"meta-interfaces\"-agreements on how to exchange new behaviors necessary to achieve compatibility at runtime, rather than requiring that communication specifics be built in at development time-to allow devices on the network to interact with one another. While this approach to interoperability can remove many of the system-imposed constraints that prevent fluid, ad hoc use of devices now, it imposes its own limitations on the user experience of systems that use it. Most importantly, since devices may be expected to work with peers about which they have no detailed semantic knowledge, it is impossible to achieve the sort of tight semantic integration that can be obtained using other approaches today, despite the fact that these other approaches limit interoperability. Instead, under our model, users must be tasked with performing the sense-making and semantic arbitration necessary to determine how any set of devices will be used together. This article describes the motivation and details of our infrastructure, its implications on the user experience, and our experience in creating, deploying, and using applications built with it over a period of several years.", "paper_title": "Experiences with Recombinant Computing: Exploring Ad Hoc Interoperability in Evolving Digital Networks", "paper_id": "WOS:000265889400003"}