{"auto_keywords": [{"score": 0.04818186976728298, "phrase": "peer_assessment"}, {"score": 0.004401342842183475, "phrase": "collective_h-index"}, {"score": 0.004265640413326508, "phrase": "library"}, {"score": 0.0038636556112977226, "phrase": "g_scores"}, {"score": 0.0031702173541386888, "phrase": "g_index_scores"}, {"score": 0.003058179790439378, "phrase": "strong_correlation"}, {"score": 0.0030307927228223883, "phrase": "pharmacy_departments"}, {"score": 0.0030036501770192865, "phrase": "index_scores"}, {"score": 0.002923668065402269, "phrase": "information_management"}, {"score": 0.0028715299874549245, "phrase": "negative_and_non-significant_results"}, {"score": 0.002464388730364717, "phrase": "gpa"}, {"score": 0.0024421008630165046, "phrase": "successive_versions"}, {"score": 0.002262209824105154, "phrase": "detailed_cited_reference_searches"}, {"score": 0.0022019274077124795, "phrase": "citation_counts"}, {"score": 0.002143247921132179, "phrase": "charles_oppenheim"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Research Assessment Exercise", " h-Index", " g-Index", " Anthropology", " Library and Information Management", " Pharmacy"], "paper_abstract": "Research was undertaken that examined what, if any, correlation there was between the h-index and rankings by peer assessment, and what correlation there was between the 2008 UK RAE rankings and the collective h-index of submitting departments. About 100 international scholars in Library and Information Science were ranked by their peers on the quality of their work. These rankings were correlated with the h and g scores the scholars had achieved. The results showed that there was a correlation between their median rankings and the indexes. The 2008 RAE grade point averages (GPA) achieved by departments from three UoAs - Anthropology, Library and Information Management and Pharmacy were compared with each of their collective h and g index scores. Results were mixed, with a strong correlation between pharmacy departments and index scores, followed by library and information management to anthropology where negative and non-significant results were found. Taken together, the findings from the research indicate that individual ranking by peer assessment and their h-index or variants was generally good. Results for the RAE 2008 gave correlations between GPA and successive versions of the h-index which varied in strength, except for anthropology where, it is suggested detailed cited reference searches must be undertaken to maximise citation counts. (C) 2009 Charles Oppenheim. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Peer review and the h-index: Two studies", "paper_id": "WOS:000278543600002"}