{"auto_keywords": [{"score": 0.036353046729738436, "phrase": "static_pictures"}, {"score": 0.015719716506582538, "phrase": "cognitive_style"}, {"score": 0.007176939122536039, "phrase": "cognitive_load"}, {"score": 0.004773476989344654, "phrase": "dynamic_and_non-dynamic_representations"}, {"score": 0.0045124316982387315, "phrase": "different_versions"}, {"score": 0.004454237726525018, "phrase": "computer-based_learning_environment"}, {"score": 0.004049709080817396, "phrase": "direct_impact"}, {"score": 0.003997458586709491, "phrase": "learning_outcome"}, {"score": 0.003928834302530914, "phrase": "significant_interaction_effects"}, {"score": 0.003109519872758431, "phrase": "visual_cognitive_style"}, {"score": 0.002913837945508097, "phrase": "verbal_style"}, {"score": 0.002888692115811987, "phrase": "learning_outcomes"}, {"score": 0.002335889180060105, "phrase": "individual_learning_differences"}, {"score": 0.0022562464662197867, "phrase": "computer-based_learning_environments"}, {"score": 0.0021604924928015283, "phrase": "multimedia_learning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Self-pacing", " Cognitive style", " Instructional animation", " Interactive learning environments", " Cognitive load"], "paper_abstract": "The effects of self-pacing versus system-pacing were examined in different versions of a computer-based learning environment (static pictures/animations). The role of cognitive style was also considered. While the variables investigated did not have a direct impact on either learning outcome or cognitive load, significant interaction effects were found. Concerning the difference between self- and system-pacing, results suggested that for animations, self-pacing was - as expected - effective, while for static pictures, the opposite was true. With respect to the difference between animations and static pictures, analyses showed that learners tending toward a visual cognitive style learned significantly better with animations than with static pictures. For learners tending toward a verbal style, learning outcomes were descriptively better with static pictures, although in that case the difference between animations and static pictures did not reach significance. The results indicate that self-pacing as a feature of learning environments is not universally advantageous, and highlight the importance of considering the role of individual learning differences such as cognitive style when choosing or developing computer-based learning environments. The findings are discussed considering contemporary theories of cognitive load and multimedia learning. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Effects of pacing and cognitive style across dynamic and non-dynamic representations", "paper_id": "WOS:000292437400023"}