{"auto_keywords": [{"score": 0.044753672605157, "phrase": "supply_chain"}, {"score": 0.006648192266965287, "phrase": "food_manufacturing_company"}, {"score": 0.00481495049065317, "phrase": "rfid_traceability_systems"}, {"score": 0.0047761092701293474, "phrase": "verifiable_quality"}, {"score": 0.004549524321051407, "phrase": "efficient_tool"}, {"score": 0.004494570360108983, "phrase": "traceability_data_entry"}, {"score": 0.0041112665381266315, "phrase": "secure_traceability_system"}, {"score": 0.004061584718427419, "phrase": "cryptographic_operator"}, {"score": 0.0038375280115736958, "phrase": "supply_chains"}, {"score": 0.003524322230452833, "phrase": "initial_production_chain"}, {"score": 0.0033029038236817372, "phrase": "faked_goods"}, {"score": 0.0031974502006267163, "phrase": "cheap_and_scalable_system"}, {"score": 0.003057910095857785, "phrase": "manufacturing_point"}, {"score": 0.002436289099444074, "phrase": "manufactured_products"}, {"score": 0.0022738201751000865, "phrase": "potential_counterfeits"}, {"score": 0.0022101055924375725, "phrase": "security_management"}, {"score": 0.002183347623351868, "phrase": "important_difference"}, {"score": 0.0021049977753042253, "phrase": "third_party"}], "paper_keywords": ["Counterfeiting", " Radio frequency identification", " Tracking", " Traceability", " Supply chain management", " Food manufacturing processes", " Cryptography", " Spanish cured ham"], "paper_abstract": "Purpose The purpose of this paper is to develop an efficient tool to ensure traceability data entry based on RFID and improve the detection of fakes inside the supply chain. Design/methodology/approach First, the authors put forward a secure traceability system with a cryptographic operator that improves efficiency, saves costs and is adaptable to all types of supply chains. Second, the authors implement the system in a food manufacturing company, show the compatibility of the system with the initial production chain and demonstrate its improvement. Findings The authors have economically and technologically improved the detection of faked goods in the supply chain by means of a cheap and scalable system based on RFID. Research limitations/implications The system has been tested in a manufacturing point of the supply chain, not in the supply chain as a whole. As traceability is additive in character, the results can be generalized and applied to each part of the supply chain. Practical implications A prototype has been built and implemented for a food manufacturing company. It meets all the specifications required for detection of fakes in manufactured products. Originality/value Unlike other existing products used to detect fakes through traceability, this system identifies fakes and potential counterfeits, significantly reducing the cost of security management. Another important difference is that verification can be performed by a third party not involved in the system, without loss of security.", "paper_title": "Improving RFID traceability systems with verifiable quality", "paper_id": "WOS:000305369400001"}