{"auto_keywords": [{"score": 0.04494706146937881, "phrase": "node_a"}, {"score": 0.015719716506582538, "phrase": "numerical_study"}, {"score": 0.01451341103421732, "phrase": "and-or_graph"}, {"score": 0.01091478143298362, "phrase": "object_parsing"}, {"score": 0.004737879690862494, "phrase": "top-down_inference"}, {"score": 0.004692227830462433, "phrase": "and-or_graphs"}, {"score": 0.004528551999851654, "phrase": "top-down_inference_processes"}, {"score": 0.0042591158963728665, "phrase": "recursively_defined_and-or_graph"}, {"score": 0.004218057615518714, "phrase": "stochastic_context_sensitive_image_grammar"}, {"score": 0.0040708542958968605, "phrase": "image_features"}, {"score": 0.0036829668399442914, "phrase": "complementary_ways"}, {"score": 0.003267925215811654, "phrase": "bayesian_framework"}, {"score": 0.00306334226516593, "phrase": "information_contributions"}, {"score": 0.0028438099634371886, "phrase": "robust_inference"}, {"score": 0.0027801631944598206, "phrase": "greedy_pursuit_algorithm"}, {"score": 0.002597620940221604, "phrase": "middle-level_vision"}, {"score": 0.002555950807368337, "phrase": "human_faces"}, {"score": 0.0025394700487126414, "phrase": "high-level_vision"}, {"score": 0.0023650305205893353, "phrase": "scale_and_occlusion_conditions"}, {"score": 0.0022897425998475362, "phrase": "facial_components"}, {"score": 0.0021049977753042253, "phrase": "roc_comparisons"}], "paper_keywords": ["Bottom-up/Top-down inference", " a-beta-gamma process", " Information contribution", " Hierarchical model", " And-Or graph", " Object parsing"], "paper_abstract": "This paper presents a numerical study of the bottom-up and top-down inference processes in hierarchical models using the And-Or graph as an example. Three inference processes are identified for each node A in a recursively defined And-Or graph in which stochastic context sensitive image grammar is embedded: the alpha(A) process detects node A directly based on image features, the beta(A) process computes node A by binding its child node(s) bottom-up and the gamma(A) process predicts node A top-down from its parent node(s). All the three processes contribute to computing node A from images in complementary ways. The objective of our numerical study is to explore how much information each process contributes and how these processes should be integrated to improve performance. We study them in the task of object parsing using And-Or graph formulated under the Bayesian framework. Firstly, we isolate and train the alpha(A), beta(A) and gamma(A) processes separately by blocking the other two processes. Then, information contributions of each process are evaluated individually based on their discriminative power, compared with their respective human performance. Secondly, we integrate the three processes explicitly for robust inference to improve performance and propose a greedy pursuit algorithm for object parsing. In experiments, we choose two hierarchical case studies: one is junctions and rectangles in low-to-middle-level vision and the other is human faces in high-level vision. We observe that (i) the effectiveness of the alpha(A), beta(A) and gamma(A) processes depends on the scale and occlusion conditions, (ii) the alpha(face) process is stronger than the alpha processes of facial components, while beta(junctions) and beta(rectangle) work much better than their alpha processes, and (iii) the integration of the three processes improves performance in ROC comparisons.", "paper_title": "A Numerical Study of the Bottom-Up and Top-Down Inference Processes in And-Or Graphs", "paper_id": "WOS:000288806000007"}