{"auto_keywords": [{"score": 0.02950106742641773, "phrase": "computing_grid"}, {"score": 0.00481495049065317, "phrase": "scientific_computing"}, {"score": 0.004635701867952543, "phrase": "world_wide_web"}, {"score": 0.004500891637057374, "phrase": "research_environments"}, {"score": 0.004084829853870028, "phrase": "remote_computer_systems"}, {"score": 0.003850566273995209, "phrase": "extendable_integrated_web-accessible_simulation_environment"}, {"score": 0.003738502710504415, "phrase": "computational_science_and_engineering_online"}, {"score": 0.003568932067237836, "phrase": "cse-online"}, {"score": 0.0034944094552943, "phrase": "unique_client-server_software_architecture"}, {"score": 0.0030399874838260886, "phrase": "network_instability"}, {"score": 0.0029764767329116875, "phrase": "new_software_architecture"}, {"score": 0.002735392281320413, "phrase": "full_capability"}, {"score": 0.0027009493171069763, "phrase": "web-services_collaborative_environment"}, {"score": 0.00257831812581194, "phrase": "web_browser"}, {"score": 0.002461241017147324, "phrase": "different_modes"}, {"score": 0.0024097920845706795, "phrase": "different_working_environments"}, {"score": 0.002233301265743633, "phrase": "remote_data"}, {"score": 0.0021049977753042253, "phrase": "computational_science"}], "paper_keywords": [""], "paper_abstract": "With the expansion of the Internet and World Wide Web ( or the Web), research environments have changed dramatically. As a result, the need to be able to efficiently and securely access information and resources from remote computer systems is becoming even more critical. This paper describes the development of an extendable integrated Web-accessible simulation environment for computational science and engineering called Computational Science and Engineering Online (CSE-Online;http://cse-online. net). CSE-Online is based on a unique client-server software architecture that can distribute the workload between the client and server computers in such a way as to minimize the communication between the client and server, thus making the environment less-sensitive to network instability. Furthermore, the new software architecture allows the user to access data and resources on one or more remote servers as well as on the computing grid while having the full capability of the Web-services collaborative environment. It can be accessed anytime and anywhere from a Web browser connected to the network by either a wired or wireless connection. It has different modes of operations to support different working environments and styles. CSE-Online is evolving into middleware that can provide a framework for accessing and managing remote data and resources including the computing grid for any domain, not necessarily just within computational science and engineering.", "paper_title": "Computational Science and Engineering Online (CSE-Online): A cyber-infrastructure for scientific computing", "paper_id": "WOS:000237658400006"}