{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "strong_error_bounds"}, {"score": 0.004724708238414131, "phrase": "heavy_hitters"}, {"score": 0.00452063603944825, "phrase": "data_stream_analysis"}, {"score": 0.004284596323560538, "phrase": "real_data"}, {"score": 0.0041515244239033145, "phrase": "stronger_bounds"}, {"score": 0.003934681262271618, "phrase": "counter-based_algorithms"}, {"score": 0.0038853212888610234, "phrase": "popular_and_very_space-efficient_frequent"}, {"score": 0.0038608730929994696, "phrase": "spacesaving"}, {"score": 0.003636125247342626, "phrase": "individual_elements"}, {"score": 0.0034352452951903305, "phrase": "remaining_tail"}, {"score": 0.0033814348757887232, "phrase": "counter-based_methods"}, {"score": 0.003194580334752371, "phrase": "strong_error"}, {"score": 0.0031544754107802413, "phrase": "tail_guarantee"}, {"score": 0.0030854957471873785, "phrase": "sparse_recovery_problem"}, {"score": 0.002989553951264878, "phrase": "faithful_representation"}, {"score": 0.002411502601063179, "phrase": "previously_best_known_space"}, {"score": 0.0023290951071300433, "phrase": "element_deletions"}, {"score": 0.0022423971916457662, "phrase": "stream_elements"}, {"score": 0.002186395051086251, "phrase": "tail_guarantees"}, {"score": 0.0021049977753042253, "phrase": "multiple_summarized_streams"}], "paper_keywords": ["Algorithms", " Theory", " Frequency estimation", " heavy hitters", " streaming algorithms"], "paper_abstract": "The problem of finding heavy hitters and approximating the frequencies of items is at the heart of many problems in data stream analysis. It has been observed that several proposed solutions to this problem can outperform their worst-case guarantees on real data. This leads to the question of whether some stronger bounds can be guaranteed. We answer this in the positive by showing that a class of counter-based algorithms (including the popular and very space-efficient FREQUENT and SPACESAVING algorithms) provides much stronger approximation guarantees than previously known. Specifically, we show that errors in the approximation of individual elements do not depend on the frequencies of the most frequent elements, but only on the frequency of the remaining tail. This shows that counter-based methods are the most space-efficient (in fact, space-optimal) algorithms having this strong error bound. This tail guarantee allows these algorithms to solve the sparse recovery problem. Here, the goal is to recover a faithful representation of the vector of frequencies, f. We prove that using space O(k), the algorithms construct an approximation f* to the frequency vector f so that the L-1 error parallel to f - f*parallel to(1) is close to the best possible error min f' parallel to f' - f parallel to(1), where f' ranges over all vectors with at most k non-zero entries. This improves the previously best known space bound of about O(k log n) for streams without element deletions (where n is the size of the domain from which stream elements are drawn). Other consequences of the tail guarantees are results for skewed (Zipfian) data, and guarantees for accuracy of merging multiple summarized streams.", "paper_title": "Space-Optimal Heavy Hitters with Strong Error Bounds", "paper_id": "WOS:000285294300004"}