{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "multi-path_transmission"}, {"score": 0.009846178798521751, "phrase": "path_handover_problem"}, {"score": 0.009535312419428453, "phrase": "path_handover"}, {"score": 0.004776297980616768, "phrase": "stream_control_transmission_protocol"}, {"score": 0.00464343008299973, "phrase": "rapid_advance"}, {"score": 0.004606148097788071, "phrase": "wireless_networking_technologies"}, {"score": 0.0045691640746165045, "phrase": "end-host_networking_devices"}, {"score": 0.004318422955036175, "phrase": "wireless_mobile_host"}, {"score": 0.00418134346679498, "phrase": "multiple_network_interfaces"}, {"score": 0.0039677715255034595, "phrase": "mobility_issues"}, {"score": 0.003935892934907777, "phrase": "sctp_multi-path_transmission"}, {"score": 0.0035439655241057207, "phrase": "wireless_mobile_networks"}, {"score": 0.003515479934694842, "phrase": "relevant_mobility_issues"}, {"score": 0.0032559935867182035, "phrase": "multi-path_data_transmission"}, {"score": 0.0027260525536580912, "phrase": "old_path"}, {"score": 0.0021566565951738658, "phrase": "locating_issue"}], "paper_keywords": ["multi-path transmission", " multi-path handover", " Stream Control Transmission Protocol (SCTP)", " multihoming", " mobility"], "paper_abstract": "With the rapid advance of wireless networking technologies, end-host networking devices have been equipped with various network interfaces. Thus, it becomes possible for a wireless mobile host to improve its transmission efficiency by transmitting data through multiple network interfaces at the same time. In this paper, we focus on the mobility issues of SCTP multi-path transmission. M-2-SCTP (Mobile Multipath - Stream Control Transmission Protocol) is proposed to allow a host to perform (multi-)path handover when multi-path transmission is adopted in wireless mobile networks. Relevant mobility issues of M-2-SCTP are also investigated. We define three conditions under which the M-2-SCTP host can select the paths for multi-path data transmission. Since the paths used in M-2-SCTP may differ at each time paths are re-selected, the path handover problem must be tackled. Three concerns related to path handover that are addressed and resolved in this paper include (1) spurious retransmissions due to failed SACK (Selective Acknowledgement) transmission at the old path, (2) retransmissions of data lost before path handover and unnecessary CWND (Congestion Window) reductions, and (3) the reordering problem due to path handover. Based on the mechanisms devised to solve the path handover problem, the M,2 SCTP multi-path handover mechanism is also devised. Finally, a scheme that adopts the DDNS (Dynamic DNS) technique is proposed to resolve the locating issue of an M2-SCTP host. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "The handover control mechanism for multi-path transmission using Stream Control Transmission Protocol (SCTP)", "paper_id": "WOS:000251483000004"}