{"auto_keywords": [{"score": 0.02677736276865567, "phrase": "ising"}, {"score": 0.00481495049065317, "phrase": "parent_selection"}, {"score": 0.0047057084749407485, "phrase": "building-block_assembly"}, {"score": 0.004641351004344458, "phrase": "crossover_operator"}, {"score": 0.004494570360108983, "phrase": "building_blocks"}, {"score": 0.0037060428445111694, "phrase": "high_rank"}, {"score": 0.0036721416244816455, "phrase": "low_rank_individuals"}, {"score": 0.0035395987202335223, "phrase": "new_idea"}, {"score": 0.0034751259234824913, "phrase": "worst_individuals"}, {"score": 0.0034118234596993836, "phrase": "valuable_building_blocks"}, {"score": 0.0032287289440915187, "phrase": "best_individuals"}, {"score": 0.002748775748298028, "phrase": "sibling_rivalry"}, {"score": 0.0026252106881752067, "phrase": "well-known_test_functions"}, {"score": 0.0021049977753042253, "phrase": "wide_class"}], "paper_keywords": [""], "paper_abstract": "Any crossover operator has both beneficial and detrimental effects: it can bring building blocks together or it can tear them apart. In this paper, we provide evidence that the recombination can be biased towards its more beneficial aspects by modifying both the parent selection process and the number of children created by each pair of parents. We exclude both high rank and low rank individuals from being selected as parents. The new idea is that the worst individuals do not have valuable building blocks to contribute, and it is too risky to subject the best individuals to crossover and have their building blocks separated. In a further refinement, we allow the number of children per family to be correlated to the diversity of their parents, and thus increase the pressure of sibling rivalry ( competition). These ideas are tested on well-known test functions such as the hierarchical if-and-only-if, royal road, concatenated trap functions and the one dimensional Ising spin model. Four different parent selection schemes are compared and simulations are shown for both two children ( fixed) and many children (variable) families. The results indicate that these changes are beneficial for a wide class of problems.", "paper_title": "Effect of parent selection and sibling rivalry on building-block assembly", "paper_id": "WOS:000276907500016"}