{"auto_keywords": [{"score": 0.04682862797456552, "phrase": "calgary"}, {"score": 0.00481495049065317, "phrase": "trans-scientific_frameworks"}, {"score": 0.004678681971460014, "phrase": "conference_paper"}, {"score": 0.004431673309295777, "phrase": "purpose_-_the_purpose"}, {"score": 0.004389451298343287, "phrase": "theoretical_research_paper"}, {"score": 0.004184274042752558, "phrase": "transdisciplinary_frameworks"}, {"score": 0.004052823656906696, "phrase": "interdisciplinary_fashion"}, {"score": 0.003925486550801027, "phrase": "scientific_and_scholarly_research"}, {"score": 0.003875674688691641, "phrase": "non-reductionistic_and_transdisciplinary_view"}, {"score": 0.0037658881407605445, "phrase": "growing_development"}, {"score": 0.0037419150096899127, "phrase": "interdisciplinary_practices"}, {"score": 0.003544186382527181, "phrase": "scientific_and_phenomenological_approaches"}, {"score": 0.003465827053421054, "phrase": "broader_framework"}, {"score": 0.003303679745153929, "phrase": "coherent_theories"}, {"score": 0.003251328737784481, "phrase": "subject_area"}, {"score": 0.0031290354217563938, "phrase": "information_science"}, {"score": 0.0027535633837592597, "phrase": "practical_examples"}, {"score": 0.0024542249391904256, "phrase": "common_map"}, {"score": 0.002438581238635582, "phrase": "interdisciplinary_work"}, {"score": 0.0021595521075096808, "phrase": "political_ideology"}, {"score": 0.0021049977753042253, "phrase": "visual_structural_models"}], "paper_keywords": ["scientific management", " cybernetics", " information science"], "paper_abstract": "Purpose - The purpose of this theoretical research paper in philosophy and theory of science is to argue for the necessity of developing transdisciplinary frameworks in order to be able to interact in an interdisciplinary fashion, Design/methodology/approach - Reflects on interdisciplinarity and the prerequisites of doing scientific and scholarly research and develops a non-reductionistic and transdisciplinary view on human knowing in the light of the growing development of interdisciplinary practices and sciences. Findings - It is argued that there is at present an incompatibility between scientific and phenomenological approaches to cognition and communication. A broader framework is, therefore, needed to encompass both, if one wants to make coherent theories and models in this subject area. The work, therefore, focuses on the relation between information science and semiotics and creates a framework for the analysis of both meaning and truth. Research limitations/implications - The framework is very abstract here in the description. It has to be developed in detail and its effect demonstrated in practical examples. Practical implications - They have to be judged both on how well their descriptions fit better than others with what actually goes on in the sciences and humanities and on their usefulness to function as a common map coordinating interdisciplinary work. Originality/value - A trans-scientific framework, which is suggested as a basis for the sciences and humanities to understand themselves in relation to other kinds of knowledge such as philosophy, art, religion, political ideology, etc. New also are the visual structural models.", "paper_title": "The necessity of trans-scientific frameworks for doing interdisciplinary research - Developed from a conference paper for paradigms lost and paradigms gained: negotiating interdisciplinarity in the twenty-first century, Calgary, May 2001", "paper_id": "WOS:000238081100011"}