{"auto_keywords": [{"score": 0.049558064870310475, "phrase": "neighbourhood_sequences"}, {"score": 0.015719716506582538, "phrase": "euclidean_circles"}, {"score": 0.01530002231669058, "phrase": "hexagonal_grid"}, {"score": 0.0037226570791514184, "phrase": "symmetric_way"}, {"score": 0.003682100144121148, "phrase": "digital_circles"}, {"score": 0.0035826234811610316, "phrase": "digital_distances"}, {"score": 0.0030229485340586473, "phrase": "digital_disk"}, {"score": 0.002738914205394527, "phrase": "neighbourhood_sequence"}, {"score": 0.002664850766529523, "phrase": "non-compactness_ratio"}, {"score": 0.0024679299547216956, "phrase": "best_approximating_neighbourhood_sequence"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Digital geometry", " Neighbourhood sequences", " Approximation", " Digital circles", " Formal systems", " Finite automata"], "paper_abstract": "In this paper the nodes of the hexagonal grid are used as points. There are three types of neighbours on this grid, therefore neighbourhood sequences contain values 1, 2, 3. The grid is coordinatized by three coordinates in a symmetric way. Digital circles are classified based on digital distances using neighbourhood sequences. They can be triangle, hexagon, enneagon and dodecagon. Their corners and side-lengths are computed, such as their perimeters and areas. The radius of a digital disk is usually not well-defined, i.e., the same disk can have various radii according to the neighbourhood sequence used. Therefore the non-compactness ratio is used to measure the quality of approximation of the Euclidean circles. The best approximating neighbourhood sequence is presented. It is shown that the approximation can be improved using two neighbourhood sequences in parallel. Comparisons to other approximations are also shown. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Approximating Euclidean circles by neighbourhood sequences in a hexagonal grid", "paper_id": "WOS:000288420900007"}