{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "serial_transmission"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_real-time_streaming"}, {"score": 0.004660634721704355, "phrase": "overlay_distribution_algorithm"}, {"score": 0.004511242245115447, "phrase": "forest-based_topologies"}, {"score": 0.004251728624599691, "phrase": "store-and-forward_way"}, {"score": 0.003776462258204936, "phrase": "different_chunks"}, {"score": 0.0035066948004186076, "phrase": "source_node"}, {"score": 0.0033641042076609645, "phrase": "peer_node"}, {"score": 0.0032561349010603734, "phrase": "basic_idea"}, {"score": 0.003005539334280134, "phrase": "trivial_problem"}, {"score": 0.002952516738708181, "phrase": "parallel_transmission"}, {"score": 0.002891834702686575, "phrase": "analytical_model"}, {"score": 0.002857719256931572, "phrase": "system_performance"}, {"score": 0.0027989800906333805, "phrase": "theoretical_bound"}, {"score": 0.0024418251230319435, "phrase": "general_simulation_package"}, {"score": 0.0022604585778195152, "phrase": "theoretical_properties"}, {"score": 0.0022470772167953123, "phrase": "performance_understanding"}, {"score": 0.0022271532243556373, "phrase": "proposed_distribution_algorithm"}, {"score": 0.0021748801206355416, "phrase": "real_system"}, {"score": 0.0021175348478776846, "phrase": "practical_workable_implementation"}], "paper_keywords": ["Distributed systems", " distributed applications", " performance of systems", " performance attributes"], "paper_abstract": "In this paper, we propose and evaluate an overlay distribution algorithm for P2P, chunk-based, streaming systems over forest-based topologies. In such systems, the stream is divided in chunks; chunks are delivered by each node in a store-and-forward way. A relaying node starts distributing a chunk only when it has completed its reception from another node. Peers are logically organized in a forest of trees, where each tree includes all peers. The source periodically distributes different chunks to each tree for their delivery. Our key idea consists in employing serial transmission: for each tree, and thus, for each chunk, the source node sends the chunk to its children in series; the same holds for each peer node of the tree, excluding the leaves. Besides this basic idea, the contributions of this paper are: 1) we demonstrate the feasibility of serial transmission over a forest of trees, which is not a trivial problem, unlike the case of parallel transmission; 2) we derive an analytical model to evaluate the system performance; 3) we derive a theoretical bound for the number of nodes reachable in a given time interval or equivalently for the time required to reach a given number of nodes; 4) we prove the optimality of our approach in terms of its capability to reach such bound; and 5) we develop a general simulation package for P2P streaming systems and use it to compare our solution to literature results. Finally, we stress that this paper is focused on the theoretical properties and performance understanding of the proposed distribution algorithm, rather than on its practical implementation in a real system. However, we also briefly describe a practical workable implementation of our algorithm.", "paper_title": "Streamline: An Optimal Distribution Algorithm for Peer-to-Peer Real-Time Streaming", "paper_id": "WOS:000276899800010"}