{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "flow_mal-distribution"}, {"score": 0.049438579755394715, "phrase": "heat_exchanger"}, {"score": 0.011257899798082912, "phrase": "actual_tube_inlet"}, {"score": 0.010576105792562551, "phrase": "present_study"}, {"score": 0.00958637041707468, "phrase": "pressure_drop"}, {"score": 0.004708056866527125, "phrase": "header_tube_arrangements"}, {"score": 0.004582897918101983, "phrase": "heat_exchangers"}, {"score": 0.004226949670141375, "phrase": "required_heat_exchange"}, {"score": 0.0037104876694493815, "phrase": "header_tube_arrangement"}, {"score": 0.0034841647157189985, "phrase": "first_approach"}, {"score": 0.003141830113006653, "phrase": "orifice_approach"}, {"score": 0.0027206133859493725, "phrase": "second_approach"}, {"score": 0.002453116398642071, "phrase": "nozzle_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Flow maldistribution", " Heat exchanger", " Header tube arrangement", " Orifices", " Nozzles"], "paper_abstract": "Header tube arrangements are commonly used in the heat exchangers. This arrangement is used to distribute the flow from the header into several tubes to achieve the required heat exchange. The flow mal-distribution within the tubes occurs due to the development of vena-contracta at the inlet to the tubes. In order to reduce the flow mal-distribution in the header tube arrangement, two approaches are presented in this study and solved numerically. In the first approach, the actual tube inlet is reduced by the introduction of an orifice. The results of the present study indicate that, by using orifice approach, flow mal-distribution can be reduced by approximately 12 times the original. However, the pressure drop from the heat exchanger increases by 7.8% compared to the case without orifices. In the second approach, the actual tube inlet is increased by the introduction of a nozzle. The results of the present study indicate that, by using nozzle approach, flow mal-distribution can be reduced by approximately 7.5 times the original. However, the pressure drop from the heat exchanger decreases by 9.8% compared to the case without nozzles. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Reducing the flow mal-distribution in a heat exchanger", "paper_id": "WOS:000348746400001"}