{"auto_keywords": [{"score": 0.038529986680897355, "phrase": "quantitative_context-free_languages"}, {"score": 0.00481495049065317, "phrase": "quantitative_context-free_languages._weighted_automata_model_quantitative_aspects"}, {"score": 0.004154332348800334, "phrase": "algebraic_structure"}, {"score": 0.003974349782102708, "phrase": "recently_also_other_weight_computations"}, {"score": 0.003479692058963528, "phrase": "average_computations"}, {"score": 0.0032319109979344184, "phrase": "chomsky-sch_\"utzenberger_theorem"}, {"score": 0.0028715299874549245, "phrase": "dyck_language"}, {"score": 0.0028085616610192456, "phrase": "recognizable_language"}, {"score": 0.0027469703311742647, "phrase": "suitable_morphism"}, {"score": 0.0024586427394152196, "phrase": "weighted_pushdown_automata"}], "paper_keywords": ["Weighted context-free grammars", " weighted pushdown automata", " valuation monoids", " context-free step functions"], "paper_abstract": "Weighted automata model quantitative aspects of systems like the consumption of resources during executions. Traditionally, the weights are assumed to form the algebraic structure of a semiring, but recently also other weight computations like average have been considered. Here, we investigate quantitative context-free languages over very general weight structures incorporating all semirings, average computations, lattices. In our main result, we derive the Chomsky-Sch \"utzenberger Theorem for such quantitative context-free languages, showing that each arises as the image of the intersection of a Dyck language and a recognizable language under a suitable morphism. Moreover, we show that quantitative context-free languages are expressively equivalent to a model of weighted pushdown automata. This generalizes results previously known only for semirings. We also investigate under which conditions quantitative context-free languages assume only finitely many values.", "paper_title": "THE CHOMSKY-SCHUTZENBERGER THEOREM FOR QUANTITATIVE CONTEXT-FREE LANGUAGES", "paper_id": "WOS:000350333300003"}