{"auto_keywords": [{"score": 0.04062691623728583, "phrase": "aggressive_interactions"}, {"score": 0.013530505811433582, "phrase": "aggressive_behaviour"}, {"score": 0.012958015392274522, "phrase": "severe_forms"}, {"score": 0.00481495049065317, "phrase": "aggressive_behaviours"}, {"score": 0.0047709540557306284, "phrase": "automatic_video_recordings"}, {"score": 0.0047057084749407485, "phrase": "today's_production_systems_results"}, {"score": 0.004494570360108983, "phrase": "precision_livestock_farming_technology"}, {"score": 0.004243862930012258, "phrase": "initial_part"}, {"score": 0.004214729542986473, "phrase": "larger_study"}, {"score": 0.004157058883925715, "phrase": "continuous_automatic_monitoring"}, {"score": 0.0040720230686501786, "phrase": "behavioural_patterns"}, {"score": 0.004053362743156545, "phrase": "pig's_aggressive_behaviour"}, {"score": 0.003889206369317587, "phrase": "later_phases"}, {"score": 0.0037921662574137535, "phrase": "commercial_farm"}, {"score": 0.003555902292752528, "phrase": "video_recording"}, {"score": 0.0035152829179318596, "phrase": "top_view_camera"}, {"score": 0.003499164928510775, "phrase": "later_analysis"}, {"score": 0.003483120583663528, "phrase": "animal_behaviour"}, {"score": 0.0034118234596993836, "phrase": "video_recordings"}, {"score": 0.003296212583539166, "phrase": "identified_interactions"}, {"score": 0.0029114187110123105, "phrase": "average_duration"}, {"score": 0.0026555726158364497, "phrase": "next_phase"}, {"score": 0.002643386043540555, "phrase": "aggressive_interactions_-_medium_phase"}, {"score": 0.002260626346970099, "phrase": "early_phase"}, {"score": 0.0022092084106039834, "phrase": "early_signs"}, {"score": 0.002194011800331242, "phrase": "management_support_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Pigs", " Aggression", " Behaviour", " Phases"], "paper_abstract": "Aggression among pigs in today's production systems results in negative impact on health and. welfare of animals as well as on productivity of the systems. Precision Livestock Farming technology might potentially offer a possibility to monitor and reduce the level of aggression and hence its negative impact. This paper reports about the initial part of a larger study investigating the possibilities of applying continuous automatic monitoring of aggressive behaviour among pigs. It investigates how behavioural patterns in pig's aggressive behaviour can be identified and utilized in order to predict severe forms of aggression (biting) expressed in later phases of aggressive interactions. An experiment was carried out at a commercial farm on a group of 11 male pigs weighing on average 23 kg and kept in a pen of 4 m x 2.5 m. During the first 3 days after mixing in total 8 h of video recording were registered with a top view camera for later analysis of animal behaviour. As a result of labelling of the video recordings, 157 aggressive interactions were identified with 12 behaviour types expressed for 860 times within the interactions. The identified interactions were divided into interactions that led to biting and those that did not lead to biting behaviour. The interactions that led to biting behaviour accounted for 36.3% (57) of all aggressive interactions while interactions that did not lead to biting behaviour were 63.7% (100) of the interactions. The average duration of initiating (nosing) phase of aggressive interactions (3.32 s) lasted longer (P < 0.05) in interactions that led to biting behaviour than in interactions that did not lead to biting behaviour (1.94 s). The next phase of aggressive interactions - medium phase - similarly to initiating phase, lasted on average longer (18.21 s) (P< 0.01) in interactions that led to biting behaviour than in interactions that did not lead to biting behaviour (16.15 s). With the differences found between interactions that led and did not lead to biting behaviour it seems to be possible to discriminate between both types of interactions in an early phase of aggression. The differences found might serve as early signs in a management support system that aims to prevent severe forms of aggressive behaviour (biting) among pigs. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Analysis of aggressive behaviours of pigs by automatic video recordings", "paper_id": "WOS:000327919700026"}