{"auto_keywords": [{"score": 0.04971747610320425, "phrase": "cloud_computing"}, {"score": 0.0413042754885902, "phrase": "small-to-medium_scale_scientific_communities"}, {"score": 0.034516326855160186, "phrase": "lightweight_service_management_layers"}, {"score": 0.033762975396334716, "phrase": "common_management_service_framework"}, {"score": 0.00481495049065317, "phrase": "basic_idea"}, {"score": 0.004724571550328985, "phrase": "resource_providers"}, {"score": 0.004688894532233354, "phrase": "elastic_resources"}, {"score": 0.004232702713825967, "phrase": "scale_scientific_communities"}, {"score": 0.0039684322717435045, "phrase": "innovative_public_cloud_usage_model"}, {"score": 0.0038352452380298464, "phrase": "public_cloud_site"}, {"score": 0.003371066990851953, "phrase": "innovative_system-dawningcloud"}, {"score": 0.0028309318332306703, "phrase": "real_experiments"}, {"score": 0.002643888053328987, "phrase": "many-task_computing"}, {"score": 0.0025941555449907356, "phrase": "dawningcloud"}, {"score": 0.002564763827975352, "phrase": "resource_consumption"}, {"score": 0.002497477241529867, "phrase": "htc"}, {"score": 0.0024785689583828796, "phrase": "mtc_service_providers"}, {"score": 0.002413531395475291, "phrase": "total_resource_consumption"}, {"score": 0.0023591417077156555, "phrase": "resource_provider"}, {"score": 0.002314752262613559, "phrase": "previous_two_public_cloud_solutions"}, {"score": 0.002153540857619362, "phrase": "public_clouds"}, {"score": 0.0021049977753042253, "phrase": "enabling_system"}], "paper_keywords": ["Cloud", " scientific communities", " economies of scale", " many-task computing", " and high-throughput computing"], "paper_abstract": "The basic idea behind cloud computing is that resource providers offer elastic resources to end users. In this paper, we intend to answer one key question to the success of cloud computing: in cloud, can small-to-medium scale scientific communities benefit from the economies of scale? Our research contributions are threefold: first, we propose an innovative public cloud usage model for small-to-medium scale scientific communities to utilize elastic resources on a public cloud site while maintaining their flexible system controls, i.e., create, activate, suspend, resume, deactivate, and destroy their high-level management entities-service management layers without knowing the details of management. Second, we design and implement an innovative system-DawningCloud, at the core of which are lightweight service management layers running on top of a common management service framework. The common management service framework of DawningCloud not only facilitates building lightweight service management layers for heterogeneous workloads, but also makes their management tasks simple. Third, we evaluate the systems comprehensively using both emulation and real experiments. We found that for four traces of two typical scientific workloads: High-Throughput Computing (HTC) and Many-Task Computing (MTC), DawningCloud saves the resource consumption maximally by 59.5 and 72.6 percent for HTC and MTC service providers, respectively, and saves the total resource consumption maximally by 54 percent for the resource provider with respect to the previous two public cloud solutions. To this end, we conclude that small-to-medium scale scientific communities indeed can benefit from the economies of scale of public clouds with the support of the enabling system.", "paper_title": "In Cloud, Can Scientific Communities Benefit from the Economies of Scale?", "paper_id": "WOS:000298381100012"}