{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "new_electrical_model"}, {"score": 0.015513888289257458, "phrase": "ferromagnetic_planar_inductor"}, {"score": 0.009595125624761967, "phrase": "yue"}, {"score": 0.009139642403435943, "phrase": "parasitic_effects"}, {"score": 0.008182618221991872, "phrase": "yamaguchi"}, {"score": 0.004289686492089571, "phrase": "monolithic_integration"}, {"score": 0.0038556354709511818, "phrase": "highest_inductance_value"}, {"score": 0.0036715973701254823, "phrase": "electromagnetic_effects"}, {"score": 0.003527550673371394, "phrase": "ferromagnetic_core"}, {"score": 0.0032706520949775065, "phrase": "better_electromagnetic_compatibility"}, {"score": 0.003114449258490062, "phrase": "geometrical_parameters"}, {"score": 0.002900432005902049, "phrase": "yong"}, {"score": 0.0026182085765020548, "phrase": "technological_parameters"}, {"score": 0.002200861826643147, "phrase": "dimensioned_inductor"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["DC-DC power converter", " Integration", " Ferromagnetic inductor", " Geometrical parameters", " Technological parameters", " New electrical model"], "paper_abstract": "This paper presents a new electrical model of a ferromagnetic planar inductor with opposite entry and exit. Our aim is the monolithic integration of this type of inductor in a buck micro-converter. Initially we choose the geometry of the planar spiral inductor which gives the highest inductance value; and by using the software FEMLAB3.1 we also simulate the electromagnetic effects in two types of inductors, one with a ferromagnetic core, and the other without, in order to choose the type of inductor which has better electromagnetic compatibility with the components of vicinity. A dimensioning of the geometrical parameters is carried out following a predimensioning. By inspiring on the model of Yue and Yong, we design the new electrical model which highlights all parasitic effects generated by the core and the substrate, and allows calculation of the technological parameters. This model is much simpler than the model of Yamaguchi and takes into account some parasitic effects which were neglected by Yue and Yamaguchi. To validate the results of dimensioning as well as the operation of the dimensioned inductor, we use PSIM6.0 software. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Design of a new electrical model of a ferromagnetic planar inductor for its integration in a micro-converter", "paper_id": "WOS:000308805600019"}