{"auto_keywords": [{"score": 0.010554368767280773, "phrase": "mas"}, {"score": 0.00481495049065317, "phrase": "agent_influence"}, {"score": 0.00476167303775568, "phrase": "complex_social_networks"}, {"score": 0.0047221003380992525, "phrase": "complex_open_multi-agent_systems"}, {"score": 0.004605335502605577, "phrase": "centralised_control"}, {"score": 0.004554366826205084, "phrase": "equal_authority"}, {"score": 0.004516509161825942, "phrase": "cooperative_and_coordinated_behaviour"}, {"score": 0.004417079972725732, "phrase": "useful_means"}, {"score": 0.004343940916975968, "phrase": "emergent_decentralised_manner"}, {"score": 0.004260134699483774, "phrase": "effective_norms"}, {"score": 0.0041895834447883374, "phrase": "identifying_influential_individuals"}, {"score": 0.004154745345684458, "phrase": "targeted_seeding"}, {"score": 0.0041316803676012155, "phrase": "desirable_norms"}, {"score": 0.004040688646993609, "phrase": "establishment_time"}, {"score": 0.00398483516910881, "phrase": "existing_research"}, {"score": 0.0038431888954930083, "phrase": "influential_agents"}, {"score": 0.0035847385924978603, "phrase": "different_network_structures"}, {"score": 0.0033999644330478243, "phrase": "network_value"}, {"score": 0.0031186510842824626, "phrase": "network_structure"}, {"score": 0.0028685304140180137, "phrase": "salazar_et_al"}, {"score": 0.0025730425700096365, "phrase": "heterogeneous_agent_learning_mechanisms"}, {"score": 0.0025233151233862734, "phrase": "synthetic_and_real-world_networks"}, {"score": 0.002399802463509121, "phrase": "influential_network_locations"}, {"score": 0.0023014955985720844, "phrase": "typical_networks"}, {"score": 0.002207206921611084, "phrase": "network_structures"}], "paper_keywords": ["Conventions", " Norms", " Influence", " Learning", " Social networks"], "paper_abstract": "In complex open multi-agent systems (MAS), where there is no centralised control and individuals have equal authority, ensuring cooperative and coordinated behaviour is challenging. Norms and conventions are useful means of supporting cooperation in an emergent decentralised manner, however it takes time for effective norms and conventions to emerge. Identifying influential individuals enables the targeted seeding of desirable norms and conventions, which can reduce the establishment time and increase efficacy. Existing research is limited with respect to considering (i) how to identify influential agents, (ii) the extent to which network location imbues influence on an agent, and (iii) the extent to which different network structures affect influence. In this paper, we propose a methodology for learning a model for predicting the network value of an agent, in terms of the extent to which it can influence the rest of the population. Applying our methodology, we show that exploiting knowledge of the network structure can significantly increase the ability of individuals to influence which convention emerges. We evaluate our methodology in the context of two agent-interaction models, namely, the language coordination domain used by Salazar et al. (AI Communications 23(4): 357-372, 2010) and a coordination game of the form used by Sen and Airiau (in: Proceedings of the 20th International Joint Conference on Artificial Intelligence, 2007) with heterogeneous agent learning mechanisms, and on a variety of synthetic and real-world networks. We further show that (i) the models resulting from our methodology are effective in predicting influential network locations, (ii) there are very few locations that can be classified as influential in typical networks, (iii) four single metrics are robustly indicative of influence across a range of network structures, and (iv) our methodology learns which single metric or combined measure is the best predictor of influence in a given network.", "paper_title": "Learning agent influence in MAS with complex social networks", "paper_id": "WOS:000336440400005"}