{"auto_keywords": [{"score": 0.046345717877726705, "phrase": "tap_positions"}, {"score": 0.014901909607196884, "phrase": "nonlinear_filter_generators"}, {"score": 0.009969762971430216, "phrase": "new_attack"}, {"score": 0.009297095483291398, "phrase": "classical_algebraic_attacks"}, {"score": 0.009148364139313764, "phrase": "fsga."}, {"score": 0.00481495049065317, "phrase": "filter_generators-revisited"}, {"score": 0.0034817084307034955, "phrase": "filter_state_guessing_attack"}, {"score": 0.003210446135114967, "phrase": "input_preimage_space"}, {"score": 0.0029763124376934813, "phrase": "simple_generalization"}, {"score": 0.002928399649340438, "phrase": "fsga"}, {"score": 0.002613870237087035, "phrase": "filter_generators"}, {"score": 0.0025578967205807843, "phrase": "vectorial_maiorana-mcfarland"}, {"score": 0.002333044307949414, "phrase": "stream_cipher"}, {"score": 0.0021049977753042253, "phrase": "babbage_et_al"}], "paper_keywords": ["Algebraic attacks", " filter generator", " guess and determine", " SOBER", " stream ciphers"], "paper_abstract": "Although there are many different approaches used in cryptanalysis of nonlinear filter generators, the selection of tap positions has not received enough attention yet. In this paper we examine the security of nonlinear filter generators that output several bits at the time against a variant of a guess and determine attack that takes into account the tap positions of the generator. In difference to the filter state guessing attack (FSGA) introduced by Pasalic (2009), our approach further reduces the input preimage space by using a given placement of the tap positions. The new attack, though a simple generalization of the FSGA, in many cases outperforms both classical algebraic attacks and the FSGA. In particular, the new attack is much more efficiently applied against filter generators that use a vectorial Maiorana-McFarland than classical algebraic attacks or the FSGA. As a proof of the concept we apply our attack to the stream cipher SOBER-t32 without stuttering and show that our attack performs slightly better than a guess and determine attack proposed by Babbage et al.", "paper_title": "Guess and Determine Attacks on Filter Generators-Revisited", "paper_id": "WOS:000302079800039"}