{"auto_keywords": [{"score": 0.03632324186720603, "phrase": "fdr"}, {"score": 0.004684157900507474, "phrase": "field-programmable_gate_arrays"}, {"score": 0.004467837409902976, "phrase": "nature"}, {"score": 0.003997891221012094, "phrase": "on-chip_communications"}, {"score": 0.003916098498242888, "phrase": "full_advantage"}, {"score": 0.003889206369317587, "phrase": "localized_communications"}, {"score": 0.0033883824438527316, "phrase": "long-distance_and_global_wires"}, {"score": 0.0033304797419738182, "phrase": "large_amount"}, {"score": 0.0032848684681050745, "phrase": "conventional_fpgas"}, {"score": 0.0032287289440915187, "phrase": "areadelay_product"}, {"score": 0.003140888248194296, "phrase": "conventional_architectures"}, {"score": 0.002881450787481037, "phrase": "arithmetic_operations"}, {"score": 0.002793380001054064, "phrase": "local_communication"}, {"score": 0.0027456170444204895, "phrase": "coarse-grain_blocks"}, {"score": 0.00271735110571002, "phrase": "embedded_memories"}, {"score": 0.0026986685585382347, "phrase": "digital_signal_processing"}, {"score": 0.0026071599759743833, "phrase": "fast_data-intensive_computations"}, {"score": 0.002544951823639408, "phrase": "coarse-grain_design"}, {"score": 0.002518746501941657, "phrase": "circuit_performance"}, {"score": 0.002467140591777737, "phrase": "fine-grain_fdr_architecture"}, {"score": 0.002424942315592064, "phrase": "dsp_blocks"}, {"score": 0.002358917661465133, "phrase": "power-delay_tradeoffs"}, {"score": 0.002286781334850213, "phrase": "smaller_area"}, {"score": 0.0022710523337245337, "phrase": "power_consumption"}, {"score": 0.002119579989996593, "phrase": "finfets"}, {"score": 0.0021049977753042253, "phrase": "power_management_techniques"}], "paper_keywords": ["Dynamic reconfiguration", " field-programmable gate arrays", " integrated circuits", " logic folding"], "paper_abstract": "Large area/delay/power overheads are required to support the reconfigurability of field-programmable gate arrays (FPGAs). We proposed a hybrid CMOS/nanotechnology dynamically reconfigurable architecture, called NATURE, earlier to address this challenge. It uses the concept of temporal logic folding and fine-grain (i.e., cycle-level) dynamic reconfiguration to increase logic density and save area. Because logic folding reduces area significantly, most of the on-chip communications become localized. To take full advantage of localized communications, we then presented a new CMOS-based fine-grain dynamically reconfigurable (FDR) architecture. It consists of an array of homogeneous logic elements (LEs), which can be configured into logic or interconnect or a combination of both. FDR eliminates most of the long-distance and global wires, which occupy a large amount of area in conventional FPGAs. FDR improves the areadelay product by an order of magnitude relative to conventional architectures. In this paper, we present an augmented FDR 2.0 architecture, where: 1) the LE is augmented with dedicated carry logic to facilitate arithmetic operations; 2) diagonal direct links are incorporated to improve the flexibility of local communication; and 3) coarse-grain blocks, including embedded memories and digital signal processing (DSP) blocks, are added to support fast data-intensive computations. Experimental results show that the coarse-grain design can improve circuit performance by 3.6x compared with the fine-grain FDR architecture. Incorporation of the DSP blocks in FDR 2.0 also enables more effective areadelay and power-delay tradeoffs, allowing the users to trade performance for smaller area or power consumption. We have implemented the design in the 22-nm FinFET technology, which enables more flexible and effective power management. Finally, different types of FinFETs and power management techniques have been explored in FDR 2.0 to optimize power.", "paper_title": "FDR 2.0: A Low-Power Dynamically Reconfigurable Architecture and Its FinFET Implementation", "paper_id": "WOS:000364208500002"}