{"auto_keywords": [{"score": 0.03781977122883892, "phrase": "early_warning"}, {"score": 0.00481495049065317, "phrase": "warning_effectiveness"}, {"score": 0.004703075081891693, "phrase": "introductory_article"}, {"score": 0.0045324756541157574, "phrase": "early_warning_systems"}, {"score": 0.0035702793079311896, "phrase": "information_use"}, {"score": 0.003406091279580424, "phrase": "true_indicators"}, {"score": 0.003216804708106142, "phrase": "policy_makers"}, {"score": 0.0031845067058084583, "phrase": "difficult_decision"}, {"score": 0.002830757050018908, "phrase": "false_warning"}, {"score": 0.002783527398566117, "phrase": "sociocognitive_theories"}, {"score": 0.0024576084154573396, "phrase": "cognitive_continuum_theory"}, {"score": 0.00241658945942583, "phrase": "detection_accuracy"}, {"score": 0.0023603078194781965, "phrase": "information_needs_profile"}, {"score": 0.0023131084326717755, "phrase": "information_use_environment"}, {"score": 0.0022898630573629144, "phrase": "warning_system"}, {"score": 0.0022668507535947976, "phrase": "signal_detection_theory"}, {"score": 0.0022290085428279846, "phrase": "decision_sensitivity"}, {"score": 0.0021335427588412077, "phrase": "false_alarms"}, {"score": 0.0021049977753042253, "phrase": "early_warning_decision_making"}], "paper_keywords": [""], "paper_abstract": "This introductory article explores how the use of information affects the effectiveness of early warning systems. By effectiveness, we refer to the capacity of the system to detect and decide on the existence of a threat. There are two aspects to effectiveness: (a) being able to see the evidence that is indicative of a threat and (b) making the decision, based on the weight of the evidence, to warn that the threat exists. In early warning, information use is encumbered by cues that are fallible and equivocal. Cues that are true indicators of a threat are obscured in a cloud of events generated by chance. Moreover, policy makers face the difficult decision of whether to issue a warning based on the information received. Because the information is rarely complete or conclusive, such decisions have to consider the consequences of failing to warn or giving a false warning. We draw on sociocognitive theories of perception and judgment to analyze these two aspects of early warning: detection accuracy (How well does perception correspond to reality?) and decision sensitivity (How much evidence is needed to activate warning?) Using cognitive continuum theory, we examine how detection accuracy depends on the fit between the information needs profile of the threat and the information use environment of the warning system. Applying signal detection theory, we investigate how decision sensitivity depends on the assessment and balancing of the risks of misses and false alarms inherent in all early warning decision making.", "paper_title": "Information Use and Early Warning Effectiveness: Perspectives and Prospects", "paper_id": "WOS:000265420700015"}