{"auto_keywords": [{"score": 0.03230240020404549, "phrase": "eer"}, {"score": 0.010612378643600213, "phrase": "advanced_channel_compensation_techniques"}, {"score": 0.004598933498016774, "phrase": "i-vector_speaker_verification_performance"}, {"score": 0.004503959683578956, "phrase": "high_intersession_variability"}, {"score": 0.004040688646993605, "phrase": "source-normalized_wmmc"}, {"score": 0.0037953354972014167, "phrase": "wlda"}, {"score": 0.003404703106153948, "phrase": "discriminatory_information"}, {"score": 0.003265365666305185, "phrase": "source_variation_information"}, {"score": 0.0032112354575523317, "phrase": "i-vector_space"}, {"score": 0.0028685304140180137, "phrase": "sn-lda_based_css_i-vector_system"}, {"score": 0.0028209599545587745, "phrase": "score-level_fusion_techniques"}, {"score": 0.0027510752634224726, "phrase": "best_channel_compensation_approaches"}, {"score": 0.002682923582928128, "phrase": "dcf"}, {"score": 0.0026494723416072316, "phrase": "best_single_approach"}, {"score": 0.002627407106087633, "phrase": "sn-wlda"}, {"score": 0.002396487353261119, "phrase": "css"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Speaker verification", " I-vector", " GPLDA", " LDA", " SN-LDA", " WLDA", " SN-WLDA"], "paper_abstract": "This paper investigates advanced channel compensation techniques for the purpose of improving i-vector speaker verification performance in the presence of high intersession variability using the NIST 2008 and 2010 SRE corpora. The performance of four channel compensation techniques: (a) weighted maximum margin criterion (WMMC), (b) source-normalized WMMC (SN-WMMC), (c) weighted linear discriminant analysis (WLDA) and (d) source-normalized WLDA (SN-WLDA) have been investigated. We show that, by extracting the discriminatory information between pairs of speakers as well as capturing the source variation information in the development i-vector space, the SN-WLDA based cosine similarity scoring (CSS) i-vector system is shown to provide over 20% improvement in EER for NIST 2008 interview and microphone verification and over 10% improvement in EER for NIST 2008 telephone verification, when compared to SN-LDA based CSS i-vector system. Further, score-level fusion techniques are analyzed to combine the best channel compensation approaches, to provide over 8% improvement in DCF over the best single approach, SN-WLDA, for NIST 2008 interview/telephone enrolment-verification condition. Finally, we demonstrate that the improvements found in the context of CSS also generalize to state-of-the-art GPLDA with up to 14% relative improvement in EER for NIST SRE 2010 interview and microphone verification and over 7% relative improvement in EER for NIST SRE 2010 telephone verification. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "I-vector based speaker recognition using advanced channel compensation techniques", "paper_id": "WOS:000326257500009"}