{"auto_keywords": [{"score": 0.04806360678457014, "phrase": "covariance_matrix"}, {"score": 0.007070768895332261, "phrase": "shape_correspondence"}, {"score": 0.005899146314450799, "phrase": "sampled_points"}, {"score": 0.005161324108698363, "phrase": "continuous_formulations"}, {"score": 0.00481495049065317, "phrase": "shape_population"}, {"score": 0.0047013405841819025, "phrase": "spline_setting"}, {"score": 0.004334657104697421, "phrase": "shape_variation"}, {"score": 0.004192078165260057, "phrase": "statistical_shape_models"}, {"score": 0.00401560412621627, "phrase": "discrete_set"}, {"score": 0.0033969001271637934, "phrase": "point_sampling"}, {"score": 0.00326939082861424, "phrase": "accurate_and_efficient_methods"}, {"score": 0.003043031131345537, "phrase": "shape_representation"}, {"score": 0.0027259252868643926, "phrase": "analytical_and_efficient_numerical_methods"}, {"score": 0.002549269480908849, "phrase": "corresponding_numerical_approximation"}, {"score": 0.0022401855403251653, "phrase": "description_length"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["B-splines", " Covariance matrix", " Shape statistics"], "paper_abstract": "Computing the covariance matrix of a population of shapes is essential for establishing shape correspondence, identifying shape variation across the population, and building statistical shape models. The covariance matrix is usually computed from a discrete set of points (a.k.a. landmarks) sampled on each shape. The distribution and density of the sampled points thus greatly influence the covariance matrix and its spectral decomposition. To understand and overcome this dependency on point sampling, in this paper, we develop accurate and efficient methods for directly computing continuous formulations of the covariance matrix. We adopt B-splines both as a shape representation and as a form of reparameterization. We apply B-splines into two continuous formulations for computing the covariance matrix of shapes. We develop both analytical and efficient numerical methods for computing such matrices. In both formulations, the covariance matrix from the corresponding numerical approximation converges to the matrix from the continuous formulations when the number of sampled points in each shape becomes sufficiently large. Their applications in optimizing shape correspondence by minimizing the description length of a set of shapes are presented. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Covariance matrix of a shape population: A tale on spline setting", "paper_id": "WOS:000351785600009"}