{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "palliative_care"}, {"score": 0.01557276120808942, "phrase": "general_practices"}, {"score": 0.004635477242873163, "phrase": "uk_study"}, {"score": 0.004420509445084217, "phrase": "uk"}, {"score": 0.004077508669922702, "phrase": "recent_national_uk_survey"}, {"score": 0.0037610536973798113, "phrase": "better_clinical_care"}, {"score": 0.00370780481244907, "phrase": "perceived_quality"}, {"score": 0.003569451476205552, "phrase": "secondary_analyses"}, {"score": 0.0032922964156452696, "phrase": "relatively_high_levels"}, {"score": 0.003261133560558666, "phrase": "information_provision"}, {"score": 0.003051073364818384, "phrase": "unified_records"}, {"score": 0.003022186855664124, "phrase": "palliative_care_patients"}, {"score": 0.0028006988338192375, "phrase": "larger_practices"}, {"score": 0.002696101728474703, "phrase": "unified_record_keeping"}, {"score": 0.0024281181691350085, "phrase": "mostly_or_fully_operational_palliative_care_register"}], "paper_keywords": ["general practice", " information management", " palliative care", " quality of care"], "paper_abstract": "Palliative care seeks to improve quality of life for patients with terminal, chronic or life-long, illnesses. In the UK, most palliative care occurs in primary care, for example, through general practices. A recent national UK survey of palliative care within general practices concluded that practices that utilized recognized initiatives to promote palliative care demonstrated better clinical care and higher perceived quality of palliative care. This paper reports on secondary analyses from that survey to investigate the management of information related to palliative care within practices. Relatively high levels of information provision to families and carers were reported, over two-thirds of practices reported having unified records for palliative care patients and over 90% of practices reported having a cancer/palliative care register that was fully or mostly operational. Larger practices, those using the Gold Standards Framework and practices using unified record keeping for palliative care, were independently more likely to give information to families and carers and were more likely to have a mostly or fully operational palliative care register. When testing for the relationship between measures of the structures and processes of information management and the perceived quality of care, as an outcome, within the practices, practices with a fully operational palliative care register and practices that had higher scores on the record-keeping scale were more likely to rate the quality of their palliative care as very good.", "paper_title": "Information management and quality of palliative care in general practices: Secondary analysis of a UK study", "paper_id": "WOS:000314207200012"}