{"auto_keywords": [{"score": 0.04168987011518509, "phrase": "one-sided_error"}, {"score": 0.04111439906631511, "phrase": "query_complexity"}, {"score": 0.03875241992745126, "phrase": "property_testing"}, {"score": 0.03334561079518117, "phrase": "testable_graph_properties"}, {"score": 0.00481495049065317, "phrase": "monotone_graph"}, {"score": 0.004728874038094706, "phrase": "graph_property"}, {"score": 0.0042898529847155255, "phrase": "abstract_family"}, {"score": 0.0042436501739199495, "phrase": "monotone_graph_properties"}, {"score": 0.004049096735491828, "phrase": "monotone_graph_property"}, {"score": 0.0035942114996235803, "phrase": "well-studied_graph_properties"}, {"score": 0.0033076455392068095, "phrase": "szemeredi's_regularity_lemma"}, {"score": 0.003271986590873581, "phrase": "main_ideas"}, {"score": 0.0030993584115563146, "phrase": "graph_property_testing"}, {"score": 0.0029893477597041493, "phrase": "additional_results"}, {"score": 0.00296781730323553, "phrase": "graph_theory"}, {"score": 0.0028936710552719806, "phrase": "independent_interest"}, {"score": 0.002634084319025334, "phrase": "previous_results"}, {"score": 0.0026151058979100596, "phrase": "extremal_graph_theory"}, {"score": 0.002558985036330194, "phrase": "monotone_graph_property_p"}], "paper_keywords": ["property testing", " monotone properties", " regularity lemma", " graphs"], "paper_abstract": "graph property is called monotone if it is closed under removal of edges and vertices. Many monotone graph properties are some of the most well-studied properties in graph theory, and the abstract family of all monotone graph properties was also extensively studied. Our main result in this paper is that any monotone graph property can be tested with one-sided error, and with query complexity depending only on is an element of. This result unifies several previous results in the area of property testing and also implies the testability of well-studied graph properties that were previously not known to be testable. At the heart of the proof is an application of a variant of Szemeredi's regularity lemma. The main ideas behind this application may be useful in characterizing all testable graph properties and in generally studying graph property testing. As a byproduct of our techniques we also obtain additional results in graph theory and property testing, which are of independent interest. One of these results is that the query complexity of testing testable graph properties with one-sided error may be arbitrarily large. Another result, which significantly extends previous results in extremal graph theory, is that for any monotone graph property P, any graph that is is an element of-far from satisfying P contains a subgraph of size depending on is an element of only, which does not satisfy P. Finally, we prove the following compactness statement: If a graph G is is an element of-far from satisfying a (possibly infinite) set of monotone graph properties P, then it is at least delta(P)(is an element of)-far from satisfying one of the properties.", "paper_title": "Every monotone graph property is testable", "paper_id": "WOS:000256452700004"}