{"auto_keywords": [{"score": 0.013672962677760914, "phrase": "biomedical_literature"}, {"score": 0.00481495049065317, "phrase": "potential_new_data_source"}, {"score": 0.004430248457624686, "phrase": "postpublication_peer_review_service"}, {"score": 0.0043738432231020885, "phrase": "biological_and_medical_research"}, {"score": 0.004263168852219819, "phrase": "important_publications"}, {"score": 0.003922378980031565, "phrase": "interesting_tool"}, {"score": 0.003872414709826833, "phrase": "research_evaluation"}, {"score": 0.003750260412839128, "phrase": "complete_database"}, {"score": 0.003631945391344252, "phrase": "bibliographic_database"}, {"score": 0.003450329424861292, "phrase": "comprehensive_comparison"}, {"score": 0.003054450075234415, "phrase": "recommended_publications"}, {"score": 0.002568542343945288, "phrase": "clear_correlation"}, {"score": 0.002244596395352896, "phrase": "journal_impact"}, {"score": 0.0021049977753042253, "phrase": "main_reasons"}], "paper_keywords": [""], "paper_abstract": "F1000 is a postpublication peer review service for biological and medical research. F1000 recommends important publications in the biomedical literature, and from this perspective F1000 could be an interesting tool for research evaluation. By linking the complete database of F1000 recommendations to the Web of Science bibliographic database, we are able to make a comprehensive comparison between F1000 recommendations and citations. We find that about 2% of the publications in the biomedical literature receive at least one F1000 recommendation. Recommended publications on average receive 1.30 recommendations, and more than 90% of the recommendations are given within half a year after a publication has appeared. There turns out to be a clear correlation between F1000 recommendations and citations. However, the correlation is relatively weak, at least weaker than the correlation between journal impact and citations. More research is needed to identify the main reasons for differences between recommendations and citations in assessing the impact of publications.", "paper_title": "F1000 Recommendations as a Potential New Data Source for Research Evaluation: A Comparison With Citations", "paper_id": "WOS:000335582300018"}