{"auto_keywords": [{"score": 0.009880465617021602, "phrase": "mutual_authentication"}, {"score": 0.00481495049065317, "phrase": "multi-server_environment"}, {"score": 0.00462291551375938, "phrase": "registration_center"}, {"score": 0.0038962096720793443, "phrase": "yoonyoo"}, {"score": 0.0038332390893263844, "phrase": "multi-server_authentication_scheme"}, {"score": 0.0032040376301815544, "phrase": "gengzhang's_protocol"}, {"score": 0.003051073364818384, "phrase": "server's_secrecy"}, {"score": 0.002941147710077221, "phrase": "two-pass_multi-server_authentication_scheme"}, {"score": 0.00266693888510356, "phrase": "smart-card-lost_attack"}, {"score": 0.002350152413458658, "phrase": "low-energy_mobile_computing_device"}, {"score": 0.0021659920594094407, "phrase": "mobile_device"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["multi-server", " password authentication protocol", " smart card", " impersonation attack", " server-spoofing attack"], "paper_abstract": "In a multi-server environment, a user only needs to register at the registration center once instead of repeatedly registering in each server. After registration, the user can access the resources of any of the servers in the system. Many protocols have been proposed for the same. Recently, GengZhang, Zhu et al., and YoonYoo each proposed a multi-server authentication scheme. They claimed that their schemes are secure and can withstand various attacks. However, after analyses, we found that their schemes are deficient. In this paper, we first demonstrate the deficiencies of these three protocols in turn and then show our improvement on GengZhang's protocol. Our improvement makes use of both the user's and the server's secrecy to achieve mutual authentication. This results in a two-pass multi-server authentication scheme. We have analyzed its security with respect to several factors such as mutual authentication, perfect forward and backward secrecy, and prevention of smart-card-lost attack. Moreover, almost all of the parameters required for a user to log on to a server can be pre-computed. This is very important for a low-energy mobile computing device. That is, our improvement is not only one of the most efficient and secure schemes in this area but also suitable for mobile device. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Improved multi-server authentication protocol", "paper_id": "WOS:000300710800013"}