{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "semantic_merging_operators"}, {"score": 0.004758457292840376, "phrase": "binary_decision_diagrams"}, {"score": 0.004620093797504386, "phrase": "well-recognised_need"}, {"score": 0.003916098498242888, "phrase": "merging_operator"}, {"score": 0.0036697319652557363, "phrase": "valuable_range"}, {"score": 0.003626626504149897, "phrase": "model-based_operators"}, {"score": 0.003479692058963528, "phrase": "interesting_and_intuitive_properties"}, {"score": 0.003165739628969694, "phrase": "considerable_computational_complexity"}, {"score": 0.00266693888510356, "phrase": "data_structure"}, {"score": 0.0021682027434117095, "phrase": "modest_size"}, {"score": 0.0021049977753042253, "phrase": "commodity_hardware_and_short_computation_times"}], "paper_keywords": ["knowledge merging", " knowledge representation", " automated reasoning"], "paper_abstract": "There is a well-recognised need in diverse applications for reasoning with multiple, potentially inconsistent sources of information. One approach is to represent each source of information by a set of formulae and then use a merging operator to produce a set of formulae as output. A valuable range of model-based operators have been proposed that conform to interesting and intuitive properties. However, the implementation of such operators has remained unaddressed, partly due to the considerable computational complexity of the proposals. To address this, we propose a methodology for implementing model-based merging operators using the notion of dilation and a type of data structure called a binary decision diagram. We apply this method by implementing four merging operators from the literature and experimentally evaluating their average-case performance. The results indicate that while the complexity is indeed significant, problems of modest size can be treated using commodity hardware and short computation times. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Implementing semantic merging operators using binary decision diagrams", "paper_id": "WOS:000259436000018"}