{"auto_keywords": [{"score": 0.04837706497448948, "phrase": "chain_graphs"}, {"score": 0.014721029418780129, "phrase": "bayesian_networks"}, {"score": 0.012304271259534075, "phrase": "qualitative_abstractions"}, {"score": 0.012157861349687066, "phrase": "probabilistic_interactions"}, {"score": 0.004216566615939546, "phrase": "natural_direction"}, {"score": 0.003312009953245191, "phrase": "numerical_detail"}, {"score": 0.0027630232270330402, "phrase": "qualitative_probabilistic_networks"}, {"score": 0.0025542617599268323, "phrase": "practical_aim"}, {"score": 0.0025083651612064144, "phrase": "qualitative_knowledge"}, {"score": 0.002404447017429959, "phrase": "probability_distributions"}, {"score": 0.0023328599525181707, "phrase": "qualitative_chain_graphs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Probabilistic chain graphs", " Qualitative reasoning", " Inference"], "paper_abstract": "For many problem domains, such as medicine, chain graphs are more attractive than Bayesian networks as they support representing interactions between variables that have no natural direction. In particular, interactions between variables that result from certain feedback mechanisms can be represented by chain graphs. Using qualitative abstractions of probabilistic interactions is also of interest, as these allow focusing on patterns in the interactions rather than on the numerical detail. Such patterns are often known by experts and sufficient for making decisions. So far, qualitative abstractions of probabilistic interactions have only been developed for Bayesian networks in the form of qualitative probabilistic networks. In this paper, such qualitative abstractions are developed for chain graphs with the practical aim of using qualitative knowledge as constraints on the hyperspace of probability distributions. The usefulness of qualitative chain graphs is explored for modelling and reasoning about the interactions between diseases. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Qualitative chain graphs and their application", "paper_id": "WOS:000334087400004"}