{"auto_keywords": [{"score": 0.007289814995593679, "phrase": "division_operations"}, {"score": 0.00481495049065317, "phrase": "five-dimensional_homogeneous_processing"}, {"score": 0.004119049028319832, "phrase": "geometric_operations"}, {"score": 0.0039522429946090174, "phrase": "proposed_scheme"}, {"score": 0.0035233696341819437, "phrase": "interference_problems"}, {"score": 0.00338060449446278, "phrase": "geometric_characteristics"}, {"score": 0.002985988377995789, "phrase": "unified_geometric_operations"}, {"score": 0.0026011706232569316, "phrase": "proposed_algorithms"}, {"score": 0.002518746501941657, "phrase": "user_interface"}, {"score": 0.0024956789310376635, "phrase": "feature_detection"}, {"score": 0.0024389277933858054, "phrase": "collision_detection"}, {"score": 0.002329258721870127, "phrase": "theoretical_framework"}, {"score": 0.002124461969404541, "phrase": "performance_improvement"}], "paper_keywords": ["4-D geometric element definitions", " 4-D geometric element interferences", " 4-D Euclidean space", " 5-D homogeneous processing"], "paper_abstract": "We have systematized various studies on 4-D visualization and interaction thus far, and we proposed 4-D geometric algorithms via 5-D homogeneous processing. Our framework uses 5 x 5 matrices and 5 x 5 determinants to express various types of transformations, and it simplifies geometric operations without the use of division operations. Using the proposed scheme, we developed an interactive 4-D space display system. The simplicity, generality, and duality of 5-D homogeneous processing are effective not only for 4-D geometric operations but also for interference problems among various 4-D objects. However, the processing regarding geometric characteristics of 4-D objects was not considered in our previous works. In this paper, we describe 4-D geometric elements, in general, and we discuss 4-D computational geometry via 5-D homogeneous processing. Unified geometric operations without the use of division operations constitute the most important part of 5-D homogeneous processing. We systematize the methods for 4-D geometric element definitions and interferences via 5-D homogeneous processing. In the field of 4-D visualization, the proposed algorithms can be potentially used in a user interface for feature detection of a 4-D object and collision detection of several 4-D objects. We comprehensively develop and advance the theoretical framework in the field of 4-D graphics. It is expected that this method of processing will be useful for the performance improvement of 4-D graphics systems.", "paper_title": "Four-dimensional geometric element definitions and interferences via five-dimensional homogeneous processing", "paper_id": "WOS:000290686900006"}