{"auto_keywords": [{"score": 0.04362466714994538, "phrase": "ietf"}, {"score": 0.00467424463996457, "phrase": "network_technologies"}, {"score": 0.004615202066192795, "phrase": "wireless_lan"}, {"score": 0.0044237033788643715, "phrase": "internet_connectivity"}, {"score": 0.00422218060227958, "phrase": "user_experience"}, {"score": 0.004046923261950549, "phrase": "mobile_nodes"}, {"score": 0.0037178503842258087, "phrase": "undesired_connection_disruption"}, {"score": 0.0036864465771943933, "phrase": "substantial_packet_loss"}, {"score": 0.003578600071301459, "phrase": "real-time_media_streams"}, {"score": 0.0034738975998176323, "phrase": "handover_latency"}, {"score": 0.0033295966773779174, "phrase": "previous_analysis"}, {"score": 0.0030091960395508812, "phrase": "vlc."}, {"score": 0.002994449398035894, "phrase": "lost_packets"}, {"score": 0.002931569771634119, "phrase": "previous_works"}, {"score": 0.002870006736445581, "phrase": "theoretical_studies"}, {"score": 0.0026363807171515255, "phrase": "thorough_experimental_evaluation"}, {"score": 0.0025919830205975215, "phrase": "wireless_lans"}, {"score": 0.0021870332034407817, "phrase": "unmodified_versions"}, {"score": 0.0021593396036472777, "phrase": "popular_conferencing"}, {"score": 0.0021319959284827896, "phrase": "streaming_applications"}, {"score": 0.0021229583685841405, "phrase": "gnomemeeting"}], "paper_keywords": [""], "paper_abstract": "The development of network technologies such as wireless LAN have made it possible for users to benefit from Internet connectivity almost anywhere and at anytime. In order to improve user experience, the IETF has defined the Mobile IPv6 protocol which allows mobile nodes to maintain their communication uninterrupted while roaming across various IPv6 subnets. However, the mechanisms this protocol defines may cause undesired connection disruption and/or substantial packet loss which may degrade the quality of real-time media streams. To address the problems of handover latency, the Mipshop IETF working group has adopted and developed the FMIPv6 protocol. Previous analysis, including some of our own, has shown that the protocol is particularly efficient in reducing both the duration of handovers and the number of lost packets. However, these previous works are often based on theoretical studies and simulations, or do not analyze all FMIPv6 operations and features. We therefore present in this article a thorough experimental evaluation of FMIPv6 over wireless LANs. This article extends our previous work by evaluating all aspects of FMIPv6: predictive handovers, reactive handovers, and network-initiated handovers. We also evaluate the benefits of FMIPv6 on layer 2 only handovers. All experiments are conducted with unmodified versions of the popular conferencing and video streaming applications Gnomemeeting and VLC.", "paper_title": "Thorough empirical analysis of the IETF FMIPv6 protocol over IEEE 802.11 networks", "paper_id": "WOS:000258033500009"}