{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_community"}, {"score": 0.01727275046043234, "phrase": "emotional_ties"}, {"score": 0.009448879106754559, "phrase": "individual_and_structural_dynamics"}, {"score": 0.00804376098992842, "phrase": "collaborative_tools"}, {"score": 0.007521379294992765, "phrase": "active_member's_intention"}, {"score": 0.0064010423829000745, "phrase": "membership_size"}, {"score": 0.004708056866527125, "phrase": "structural_dynamics"}, {"score": 0.004582897918101983, "phrase": "virtual_communities"}, {"score": 0.004541918674719973, "phrase": "active_members"}, {"score": 0.004114527599108729, "phrase": "multilevel_research_model"}, {"score": 0.004041238873048836, "phrase": "structural_factors"}, {"score": 0.00384633057714983, "phrase": "community_level"}, {"score": 0.0037948184359488284, "phrase": "individual_factors"}, {"score": 0.0033011569787033297, "phrase": "proposed_cross-level_hypotheses"}, {"score": 0.002963390095037466, "phrase": "virtual_communities'_sustainability"}, {"score": 0.0027206133859493725, "phrase": "indirect_effect"}, {"score": 0.0026720866990543744, "phrase": "positive_relationship"}, {"score": 0.0025660347613972573, "phrase": "shared_information_resources"}, {"score": 0.0021049977753042253, "phrase": "large_clique_size"}], "paper_keywords": ["Virtual Community", " Sustainability", " Communicative Ecology Theory", " Multi-level Modeling"], "paper_abstract": "This study investigates how virtual communities retain active members and maintain sustainability as they grow in size. By integrating the individual and structural dynamics of a virtual community, this study develops a multilevel research model that explores how structural factors (i.e., membership and clique sizes) at the community level interact with individual factors (i.e., the extent of use of collaborative tools, the strength of emotional ties, and shared information resources) to predict an active member's intention to stay. We tested the proposed cross-level hypotheses using survey data collected from 164 participants and 15 virtual communities. The results of this study emphasize the need to consider individual and structural dynamics simultaneously to understand virtual communities' sustainability. Results indicate that membership size does not directly influence an active member's intention to stay but that it exerts an indirect effect by strengthening the positive relationship between the extent of use of collaborative tools and shared information resources. This study supports the notion that, because members form cliques, the strength of emotional ties among individuals in a virtual community does not decrease despite an increase in membership size. Notably, the results suggest that, in a virtual community, a large clique size may weaken the relationship between the strength of emotional ties and the intention to stay.", "paper_title": "Sustainability of a Virtual Community: Integrating Individual and Structural Dynamics", "paper_id": "WOS:000357682300001"}