{"auto_keywords": [{"score": 0.015608896766831045, "phrase": "upstream_value_chain"}, {"score": 0.01293696589560445, "phrase": "supplier_selection"}, {"score": 0.00481495049065317, "phrase": "supplier_selection_criterion"}, {"score": 0.004695900553353526, "phrase": "exploratory_research"}, {"score": 0.00449859196755507, "phrase": "suppliers_selection_process"}, {"score": 0.004340488340181084, "phrase": "superior_supply_chain_performance"}, {"score": 0.00398325070540449, "phrase": "previous_literature"}, {"score": 0.0038431888954930083, "phrase": "structured_questionnaire"}, {"score": 0.0034271313706984658, "phrase": "significant_supplier_selection_criterion"}, {"score": 0.0034026714408341868, "phrase": "supply_chain_context"}, {"score": 0.0033542722986970265, "phrase": "rapid_proliferation"}, {"score": 0.0033303306367699816, "phrase": "information_sharing"}, {"score": 0.003306559295382181, "phrase": "upstream_chains"}, {"score": 0.00323625520042892, "phrase": "empirical_investigation"}, {"score": 0.0031788080316930687, "phrase": "french_companies"}, {"score": 0.0030779528295407925, "phrase": "similar_western_countries"}, {"score": 0.003055977395076106, "phrase": "different_countries"}, {"score": 0.002896071795090179, "phrase": "decision_makers"}, {"score": 0.002455889980202819, "phrase": "supplier_relationship_development"}, {"score": 0.0023864566654035924, "phrase": "relative_importance"}, {"score": 0.0023440589015485077, "phrase": "supplier_selection_process"}, {"score": 0.0021049977753042253, "phrase": "upstream_relationships"}], "paper_keywords": ["Supplier selection", " IS/IT criterion", " Upstream supply chain", " Empirical research", " France", " Supply chain management"], "paper_abstract": "Purpose - This exploratory research aims to examine and evaluate the importance of IS/IT criterion in the suppliers selection process. The paper attempts to assess if there is superior supply chain performance arising from the integration of this criterion and to determine difficulties companies face resulting from this deployment. Design/methodology/approach - A review of previous literature on supplier selection is presented and the authors designed a structured questionnaire for their data collection. Data were collected from 90 French companies and subsequently analyzed to understand the IS/IT criterion used for supplier selection along the upstream value chain. Findings - The results suggest that IT/IS is a significant supplier selection criterion within supply chain context because of the rapid proliferation of information sharing across upstream chains. Research limitations/implications - Since this empirical investigation has been limited to French companies, further studies can be done for comparison with similar western countries or different countries (on economic, environmental, social, political dimensions). Practical implications - This research has several implications for the decision makers in the management of their suppliers. It informs them on the necessity to integrate IS/IT in their suppliers selection. Meaning while, it indicates which IS/IT must be emphasized and which difficulties will be faced by integrating this criterion. It also gives some insights concerning the supplier relationship development. Originality/value - The paper identifies the relative importance of IS/IT criterion in the supplier selection process. IT/IS has a role to play as it has helped improve the dynamics of both externalization and internationalization, notably by solving problems and by encouraging development of upstream relationships.", "paper_title": "IS/IT as supplier selection criterion for upstream value chain", "paper_id": "WOS:000317440200007"}