{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "elsevier"}, {"score": 0.00481495049065317, "phrase": "model-to-model_transformation_languages"}, {"score": 0.004706699397060569, "phrase": "crucial_activity"}, {"score": 0.004671156704912419, "phrase": "model_driven_engineering"}, {"score": 0.004497410940849537, "phrase": "omg_qvt_standard"}, {"score": 0.0044634416051962545, "phrase": "model_transformation_languages"}, {"score": 0.004297388539539564, "phrase": "model_transformations"}, {"score": 0.004153207234462926, "phrase": "qvt_standard"}, {"score": 0.004075198669927074, "phrase": "model_transformation_problems"}, {"score": 0.003983512316698646, "phrase": "qvt_activity"}, {"score": 0.003720600007408015, "phrase": "software_developers"}, {"score": 0.0035281264325950556, "phrase": "particular_problem"}, {"score": 0.00330770035909988, "phrase": "existing_model_transformation"}, {"score": 0.0032087739900195232, "phrase": "major_language_components"}, {"score": 0.0029741713977710495, "phrase": "major_goal"}, {"score": 0.002896167001212006, "phrase": "language_interoperability"}, {"score": 0.0023952639120005193, "phrase": "large_degree"}, {"score": 0.002314752262613559, "phrase": "incompatible_features"}], "paper_keywords": ["model engineering", " model transformations", " transformation languages", " interoperability"], "paper_abstract": "Transforming models is a crucial activity in Model Driven Engineering (MDE). With the adoption of the OMG QVT standard for model transformation languages, it is anticipated that the experience in applying model transformations in various domains will increase. However, the QVT standard is just one possible approach for solving model transformation problems. In parallel with the QVT activity, many research groups and companies have been working on their own model transformation approaches and languages. It is important for software developers to be able to compare and select the most suitable languages and tools for a particular problem. This paper compares several model-to-model transformation languages as a step in the direction of gathering knowledge about the existing model transformation approaches. The focus is on the major language components (sublanguages and their features, execution tools, etc.) and how they are related. The major goal is to motivate the need for language interoperability and to explore options and obstacles for such interoperability. We propose a set of heuristics to reason about the problems that must be addressed when translators between languages have to be developed. These heuristics are applied on several examples. The experience from these examples shows that achieving a large degree of interoperability is difficult since some languages expose incompatible features. We managed to identify, however, cases where the interoperability between languages is feasible and brings certain benefits. (c) 2007 Elsevier B.V All rights reserved.", "paper_title": "On the interoperability of model-to-model transformation languages", "paper_id": "WOS:000251771200002"}