{"auto_keywords": [{"score": 0.04916387935172277, "phrase": "first_use"}, {"score": 0.015719716506582538, "phrase": "fun_problems"}, {"score": 0.0086138197306625, "phrase": "computer_game"}, {"score": 0.004388796812234033, "phrase": "detected_problems"}, {"score": 0.004141742095830515, "phrase": "young_children"}, {"score": 0.003923671536980019, "phrase": "different_types"}, {"score": 0.0038934666267504596, "phrase": "identified_problems"}, {"score": 0.0034140224493254935, "phrase": "merit_change"}, {"score": 0.0032341432727280707, "phrase": "usability_problems"}, {"score": 0.002993439939273828, "phrase": "too-high_challenge_level"}, {"score": 0.002554406040896888, "phrase": "impact_severity"}, {"score": 0.0023278569001363263, "phrase": "experienced_problems"}, {"score": 0.0023099082804523044, "phrase": "commonly_used_measures_efficiency"}], "paper_keywords": [""], "paper_abstract": "This paper describes an experiment to discover the change in the types of detected problems and the attitude of children towards a game when user testing a computer game for young children during first use and after they have practiced with a game. Both the numbers of different types of identified problems and the severity of the problems are investigated. Based on this knowledge, practitioners could adapt the set up of their user tests to effectively find as many aspects of the game as possible that merit change, according to the aims of the developers. The study shows that usability problems caused by a lack of knowledge were more often identified during first use. Furthermore, fun problems related to a too-high challenge level may disappear after some practice, whereas fun problems caused by the game taking over control for too long while the user wants to proceed playing the game were identified more often after some practice. The study shows that the impact severity of problems detected during first use was higher than when children had more practice with a game. As a result of these changes in experienced problems the commonly used measures efficiency, effectiveness and satisfaction increased when children had practiced with the game. Finally, the study also shows that the set of most severe problems identified during first use may be radically different from the set of most severe problems identified after some practice. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Identifying usability and fun problems in a computer game during first use and after some practice", "paper_id": "WOS:000239224700005"}