{"auto_keywords": [{"score": 0.04152691671834334, "phrase": "anticollision_protocol"}, {"score": 0.00481495049065317, "phrase": "capture-recapture_approach"}, {"score": 0.004672444473700524, "phrase": "missing_rfid_tags"}, {"score": 0.004334331464691797, "phrase": "rfid"}, {"score": 0.004164007198843467, "phrase": "multiple_tags"}, {"score": 0.0038239757564863057, "phrase": "wireless_link"}, {"score": 0.0031765314093444956, "phrase": "statistical_relationship"}, {"score": 0.002719055901632759, "phrase": "multiple_reader_sessions"}, {"score": 0.002534596206835737, "phrase": "subsequent_reader_sessions"}, {"score": 0.002496722870659199, "phrase": "estimation_procedure"}, {"score": 0.0024348510123716424, "phrase": "actual_tree-based_anticollision_protocol"}, {"score": 0.0023390219342052623, "phrase": "reliable_tag_resolution_algorithm"}, {"score": 0.0022810491620483737, "phrase": "protocol_execution"}, {"score": 0.0021049977753042253, "phrase": "missing_tags"}], "paper_keywords": ["RFID", " reliable arbitration process", " anticollision protocols"], "paper_abstract": "The technology of Radio Frequency IDentification (RFID) enables many applications that rely on passive, battery-less wireless devices. If a RFID reader needs to gather the ID from multiple tags in its range, then it needs to run an anticollision protocol. Due to errors on the wireless link, a single reader session, which contains one full execution of the anticollision protocol, may not be sufficient to retrieve the ID of all tags. This problem can be mitigated by running multiple, redundant reader sessions and use the statistical relationship between these sessions. On the other hand, each session is time consuming and therefore the number of sessions should be kept minimal. We optimize the process of running multiple reader sessions, by allowing only some of the tags already discovered to reply in subsequent reader sessions. The estimation procedure is integrated with an actual tree-based anticollision protocol, and numerical results show that the reliable tag resolution algorithm attain high speed of protocol execution, while not sacrificing the reliability of the estimators used to assess the probability of missing tags.", "paper_title": "Fast Capture-Recapture Approach for Mitigating the Problem of Missing RFID Tags", "paper_id": "WOS:000299294400014"}