{"auto_keywords": [{"score": 0.046866659551594476, "phrase": "feature_construction"}, {"score": 0.00481495049065317, "phrase": "genetic_iterative_rule_learning_algorithm"}, {"score": 0.004415189385015778, "phrase": "fuzzy_rule"}, {"score": 0.004001938457469328, "phrase": "new_learning_strategy"}, {"score": 0.0036694287631595995, "phrase": "fuzzy_rules"}, {"score": 0.0036063061558261546, "phrase": "second_one"}, {"score": 0.0031026497891826726, "phrase": "learning_strategy"}, {"score": 0.00265373679629359, "phrase": "initial_variables"}, {"score": 0.002608040688794517, "phrase": "experimental_results"}, {"score": 0.002548331088496964, "phrase": "proposed_method"}, {"score": 0.0025044454602720597, "phrase": "good_trade-off"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Genetic fuzzy systems", " Feature construction", " Iterative learning approach", " Classification"], "paper_abstract": "This paper presents a proposal that introduces the use of feature construction in a fuzzy rule learning algorithm. This is done by means of the combination of two different approaches together with a new learning strategy. The first of these two approaches consists of using relations in the antecedent of fuzzy rules while the second one employs functions in the antecedent of that rules. Thus, the method we propose tries to integrate these two models so that, using a learning strategy that allows us to start learning more general rules and finish the process learning more specific ones, we are able to increase the amount of information extracted from the initial variables. The experimental results show that the proposed method obtains a good trade-off among accuracy, interpretability and time needed to get the model in relation to the rest of algorithms using feature construction involved in the comparison. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A feature construction approach for genetic iterative rule learning algorithm", "paper_id": "WOS:000325386500009"}