{"auto_keywords": [{"score": 0.04778951318323816, "phrase": "ethical_leadership"}, {"score": 0.02109679823385937, "phrase": "work_engagement"}, {"score": 0.00922569760658629, "phrase": "voice_behavior"}, {"score": 0.006566271183706136, "phrase": "mediating_role"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004529093447865156, "phrase": "regulatory_focus_theory_perspectives"}, {"score": 0.004031699976413366, "phrase": "moderating_effect"}, {"score": 0.0034804536625952596, "phrase": "large_economic_research_institution"}, {"score": 0.0034170596490204308, "phrase": "taiwan"}, {"score": 0.002825681384008326, "phrase": "positive_relationship"}, {"score": 0.0026576091519087065, "phrase": "subordinate's_self-regulatory_focus"}, {"score": 0.002409188797323273, "phrase": "ethical_leadership_theory"}, {"score": 0.0022938068444116827, "phrase": "cognitive_motivational_underpinning"}, {"score": 0.0021049977753042253, "phrase": "new_and_deeper_insights"}], "paper_keywords": ["Work engagement", " Ethical leadership", " Promotion focus", " Voice behaviour"], "paper_abstract": "Purpose - The purpose of this paper is to draw on ethical leadership and regulatory focus theory perspectives to examine the mediating role of work engagement in the relationship between ethical leadership and voice behavior, and it addresses the moderating effect of promotion focus on the relationship between ethical leadership and work engagement. Design/methodology/approach - The paper uses a sample of 239 supervisor-subordinate dyads collected from a large economic research institution in northern Taiwan to test all hypotheses. Findings - The paper finds that ethical leadership facilitates subordinates to engage in their work and encourages subordinates to speak up. This study also reveals a positive relationship between ethical leadership and work engagement that is moderated by the subordinate's self-regulatory focus, which is driven by a focus on promotion. Originality/value - The paper extends ethical leadership theory by considering that work engagement serves as a cognitive motivational underpinning in support of the link between ethical leadership and voice behavior. The results provide new and deeper insights in explaining the impact of ethical leadership on voice behavior by strengthening the mediating role of work engagement.", "paper_title": "Ethical leadership, work engagement, and voice behavior", "paper_id": "WOS:000341781300008"}