{"auto_keywords": [{"score": 0.03490200455595744, "phrase": "roundup"}, {"score": 0.013460655490676862, "phrase": "gnutella"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_file_sharing_networks"}, {"score": 0.004077520487887304, "phrase": "bittorrent"}, {"score": 0.00398177607914381, "phrase": "legal_issues"}, {"score": 0.0036553070575015344, "phrase": "particular_interest"}, {"score": 0.0032302647179383915, "phrase": "gnutella_investigations"}, {"score": 0.0030802351224657673, "phrase": "networking_investigations"}, {"score": 0.0030078460113945136, "phrase": "rapid_acceptance"}, {"score": 0.002657890175649468, "phrase": "central_database"}, {"score": 0.0024747842618794255, "phrase": "law_enforcement_sharing"}, {"score": 0.0021454671611847507, "phrase": "digital_forensic_research_work_shop"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The investigation of peer-to-peer (p2p) file sharing networks is now of critical interest to law enforcement. P2P networks are extensively used for sharing and distribution of contraband. We detail the functionality of two p2p protocols, Gnutella and BitTorrent, and describe the legal issues pertaining to investigating such networks. We present an analysis of the protocols focused on the items of particular interest to investigators, such as the value of evidence given its provenance on the network. We also report our development of RoundUp, a tool for Gnutella investigations that follows the principles and techniques we detail for networking investigations. RoundUp has experienced rapid acceptance and deployment: it is currently used by 52 Internet Crimes Against Children (ICAC) Task Forces, who each share data from investigations in a central database. Using RoundUp, since October 2009, over 300,000 unique installations of Gnutella have been observed by law enforcement sharing known contraband in the the U. S. Using leads and evidence from RoundUp, a total of 558 search warrants have been issued and executed during that time. (C) 2010 Digital Forensic Research Work Shop. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Forensic investigation of peer-to-peer file sharing networks", "paper_id": "WOS:000281010700012"}