{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interactive_petri_nets"}, {"score": 0.004720606036240263, "phrase": "web_services"}, {"score": 0.0046741260449047976, "phrase": "work-flow_systems"}, {"score": 0.00419195822011581, "phrase": "message_channels"}, {"score": 0.003911253966141701, "phrase": "petri_nets"}, {"score": 0.0035424245257172234, "phrase": "potential_problems"}, {"score": 0.003371220210416809, "phrase": "important_concept"}, {"score": 0.0033214855341753544, "phrase": "composed_system"}, {"score": 0.0030988889679192965, "phrase": "different_cooperative_abilities"}, {"score": 0.0030081030319492343, "phrase": "weak_compatibility"}, {"score": 0.0021049977753042253, "phrase": "polynomial_time"}], "paper_keywords": ["Compatibility", " co-NP-hardness", " interactive Petri nets (IPNs)", " liveness", " Web service"], "paper_abstract": "Such concurrent systems as Web services and work-flow systems can be viewed as a composition of a set of subsystems. Subsystems interact with each other through a set of message channels in order to perform a task. This work defines a class of Petri nets called interactive Petri nets (IPNs) to model these systems. IPNs can be used to analyze their behavior, find potential problems, and then improve their designs. Compatibility is an important concept for a composed system and reflects the possibility of correct/proper interaction among its subsystems. In order to characterize different cooperative abilities in practice, compatibility and weak compatibility are defined for IPNs. Some relationships among (weak) compatibility, liveness, reversibility, and boundedness are revealed. Based on them, this work proves that the (weak) compatibility problem is co-NP-hard. A taxonomy is also presented for IPNs in order to explore whether some subclasses can be analyzed efficiently. Based on it, we can identify several IPN subclasses, some of which can be analyzed in polynomial time.", "paper_title": "Interactive Petri Nets", "paper_id": "WOS:000317614400005"}