{"auto_keywords": [{"score": 0.03814741522567494, "phrase": "elm"}, {"score": 0.01571957623049779, "phrase": "fuzzy_logic_systems"}, {"score": 0.015615069201429858, "phrase": "extreme_learning_machines"}, {"score": 0.012441670313244202, "phrase": "hybrid_system"}, {"score": 0.004734448316824488, "phrase": "permeability_prediction"}, {"score": 0.004592905436175987, "phrase": "learning_tool"}, {"score": 0.00438105507792004, "phrase": "generalisation_capability"}, {"score": 0.003919404114585274, "phrase": "elm_prediction"}, {"score": 0.003529984775927307, "phrase": "model_permeability"}, {"score": 0.0035062280202127136, "phrase": "carbonate_reservoir"}, {"score": 0.0030839447259626215, "phrase": "reservoir_data"}, {"score": 0.0029414903557512663, "phrase": "final_prediction"}, {"score": 0.002892219926795975, "phrase": "unseen_testing_dataset"}, {"score": 0.002872742947035998, "phrase": "comparative_studies"}, {"score": 0.0027033166774651104, "phrase": "svm"}, {"score": 0.0023935561037315375, "phrase": "elm_performance"}, {"score": 0.002306189434657134, "phrase": "closer_performance"}, {"score": 0.0021773853011112882, "phrase": "proposed_hybrid"}, {"score": 0.002155412043665635, "phrase": "ann_and_svm_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Type-2 fuzzy logic systems", " Extreme learning machines (ELM)", " Feed forward neural networks", " Permeability", " Well logs", " Hybrid intelligent systems"], "paper_abstract": "Extreme learning machines (ELM), as a learning tool, have gained popularity due to its unique characteristics and performance. However, the generalisation capability of ELM often depends on the nature of the dataset, particularly on whether uncertainty is present in the dataset or not. In order to reduce the effects of uncertainties in ELM prediction and improve its generalisation ability, this paper proposes a hybrid system through a combination of type-2 fuzzy logic systems (type-2 FLS) and ELM; thereafter the hybrid system was applied to model permeability of carbonate reservoir. Type-2 FLS has been chosen to be a precursor to ELM in order to better handle uncertainties existing in datasets beyond the capability of type-1 fuzzy logic systems. The type-2 FLS is used to first handle uncertainties in reservoir data so that its final output is then passed to the ELM for training and then final prediction is done using the unseen testing dataset. Comparative studies have been carried out to compare the performance of the proposed T2-ELM hybrid system with each of the constituent type-2 FLS and ELM, and also artificial neural network (ANN) and support Vector machines (SVM) using five different industrial reservoir data. Empirical results show that the proposed T2-ELM hybrid system outperformed each of type-2 FLS and ELM, as the two constituent models, in all cases, with the improvement made to the ELM performance far higher against that of type-2 FLS that had a closer performance to the hybrid since it is already noted for being able to model uncertainties. The proposed hybrid also outperformed ANN and SVM models considered. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "A hybrid model through the fusion of type-2 fuzzy logic systems and extreme learning machines for modelling permeability prediction", "paper_id": "WOS:000327830300005"}