{"auto_keywords": [{"score": 0.04274518365190484, "phrase": "information_inequality"}, {"score": 0.03542208904419642, "phrase": "information_poor"}, {"score": 0.025395105502451724, "phrase": "information_inequality_studies"}, {"score": 0.00481495049065317, "phrase": "empirical_study"}, {"score": 0.0047797212183363835, "phrase": "daily_and_regular_information_practices"}, {"score": 0.004523552067565685, "phrase": "multifaceted_information_disadvantages"}, {"score": 0.0043764594918057915, "phrase": "today's_society"}, {"score": 0.0042031320273645065, "phrase": "empirical_evidence"}, {"score": 0.004172360444377281, "phrase": "individuals'_daily_and_regular_information_practices"}, {"score": 0.0036822794196763506, "phrase": "interview_transcripts"}, {"score": 0.0036285315458900284, "phrase": "different_social_statuses"}, {"score": 0.003471933181807712, "phrase": "meaningful_constructs"}, {"score": 0.003261547125192671, "phrase": "information_practices"}, {"score": 0.00322576184471691, "phrase": "information_assets"}, {"score": 0.003030247482854539, "phrase": "limited_freedom"}, {"score": 0.0029100802280971065, "phrase": "information_resources"}, {"score": 0.00275383721396097, "phrase": "information_utilities"}, {"score": 0.0026641365405034355, "phrase": "impoverished_information_assets"}, {"score": 0.0026155681847364483, "phrase": "normal_and_problematic_situations"}, {"score": 0.002175913488493802, "phrase": "information_science_understanding"}, {"score": 0.0021049977753042253, "phrase": "information_deficiency_thesis"}], "paper_keywords": ["Information services", " Information management", " Disadvantaged groups", " China"], "paper_abstract": "Purpose - The purpose of this paper is to examine the multifaceted information disadvantages facing the so-called information poor in today's society. It has two specific objectives: to identify, from the empirical evidence of individuals' daily and regular information practices, meaningful constructs for defining information inequality; and to investigate how the \"information poor\" characterise on these constructs in comparison with others. Design/methodology/approach - The study developed its findings in relation to the above objectives inductively from the interview transcripts of 73 people of different social statuses and occupations regarding their daily and regular information practices. Findings - Three concepts emerged as meaningful constructs to define information inequality, hence to describe the information poor: individuals' information resource bases, information practices, and information assets. The information poor are found to be disadvantaged in all these aspects. They are first disadvantaged by limited freedom and/or opportunities in claiming society's vast and rapidly increasing information resources into their own information resource bases; then by the constraint of their information practices in developing their information resource bases and obtaining information utilities from these resources; and further more by impoverished information assets to empower themselves in normal and problematic situations. Practical implications - Understanding of the information poor as sketched above will likely demand further research into a number of issues/areas hitherto ignored by information inequality studies. Originality/value - This paper is one of the first to address empirically one of the most fundamental questions in information inequality studies; it extends library and information science understanding of the information poor hitherto dominated by the information deficiency thesis.", "paper_title": "How poor informationally are the information poor? Evidence from an empirical study of daily and regular information practices of individuals", "paper_id": "WOS:000285565500007"}