{"auto_keywords": [{"score": 0.029307666281507855, "phrase": "pubchem"}, {"score": 0.004539015022937838, "phrase": "pubmed"}, {"score": 0.004278807087784626, "phrase": "elaborate_task"}, {"score": 0.0038246602895705643, "phrase": "rarely_investigated_compounds"}, {"score": 0.0036697319652557363, "phrase": "available_literature"}, {"score": 0.003459191419478298, "phrase": "literature_mining"}, {"score": 0.0033190180867511605, "phrase": "selected_texts"}, {"score": 0.0032223742018434856, "phrase": "time-consuming_process"}, {"score": 0.002984027623988469, "phrase": "web_interface"}, {"score": 0.0028293966058473476, "phrase": "similar_structures"}, {"score": 0.0026045914281028473, "phrase": "pubmed_service"}, {"score": 0.002573965014439041, "phrase": "cil's_pre-calculated_database"}, {"score": 0.0023415390666563177, "phrase": "concise_'heat_map'-like_overview"}, {"score": 0.0021049984022940794, "phrase": "uniprot"}], "paper_keywords": [""], "paper_abstract": "Searching for certain compounds in literature can be an elaborate task, with many compounds having several different synonyms. Often, only the structure is known but not its name. Furthermore, rarely investigated compounds may not be described in the available literature at all. In such cases, preceding searches for described similar compounds facilitate literature mining. Highlighted names of proteins in selected texts may further accelerate the time-consuming process of literary research. Compounds In Literature (CIL) provides a web interface to automatically find names, structures, and similar structures in over 28 million compounds of PubChem and more than 18 million citations provided by the PubMed service. CIL's pre-calculated database contains more than 56 million parent compound-abstract relations. Found compounds, relatives and abstracts are related to proteins in a concise 'heat map'-like overview. Compounds and proteins are highlighted in their respective abstracts, and are provided with links to PubChem and UniProt.", "paper_title": "Compounds In Literature (CIL): screening for compounds and relatives in PubMed", "paper_id": "WOS:000290331600031"}