{"auto_keywords": [{"score": 0.0496525673569277, "phrase": "unified_approach"}, {"score": 0.04316405896230461, "phrase": "exclusive_perpetual_clearing"}, {"score": 0.00481495049065317, "phrase": "oblivious_robots"}, {"score": 0.00474367934322016, "phrase": "different_tasks"}, {"score": 0.004673458200854065, "phrase": "autonomous_robots"}, {"score": 0.004549657384420166, "phrase": "common_task"}, {"score": 0.004160092647083038, "phrase": "exclusive_perpetual_exploration"}, {"score": 0.0040740829470571425, "phrase": "gathering_problems"}, {"score": 0.004025732081831055, "phrase": "first_problem"}, {"score": 0.003691869399440961, "phrase": "graph_searching"}, {"score": 0.0035725770197245392, "phrase": "whole_ring"}, {"score": 0.003305661550005516, "phrase": "gathering_problem"}, {"score": 0.0031513836446128264, "phrase": "look-compute-move_model"}, {"score": 0.002968591879288644, "phrase": "visibility_sensors"}, {"score": 0.002950904524853741, "phrase": "motion_actuators"}, {"score": 0.0028984704276511786, "phrase": "asynchronous_cycles"}, {"score": 0.0027880284928874463, "phrase": "current_global_configuration"}, {"score": 0.0027059374439494075, "phrase": "perceived_configuration"}, {"score": 0.002533723901680123, "phrase": "latter_case"}, {"score": 0.0022616217096561274, "phrase": "common_sense"}, {"score": 0.0021049977753042253, "phrase": "anonymous_ring-topologies"}], "paper_keywords": ["Distributed computing", " Exploration", " Searching", " Gathering", " Oblivious anonymous robots", " Asynchronous anonymous networks", " Look-Compute-Move"], "paper_abstract": "A set of autonomous robots have to collaborate in order to accomplish a common task in a ring-topology where neither nodes nor edges are labeled (that is, the ring is anonymous). We present a unified approach to solve three important problems: the exclusive perpetual exploration, the exclusive perpetual clearing, and the gathering problems. In the first problem, each robot aims at visiting each node infinitely often while avoiding that two robots occupy a same node (exclusivity property); in exclusive perpetual clearing (also known as graph searching), the team of robots aims at clearing the whole ring infinitely often (an edge is cleared if it is traversed by a robot or if both its endpoints are occupied); and in the gathering problem, all robots must eventually occupy the same node. We investigate these tasks in the Look-Compute-Move model where the robots cannot communicate but can perceive the positions of other robots. Each robot is equipped with visibility sensors and motion actuators, and it operates in asynchronous cycles. In each cycle, a robot takes a snapshot of the current global configuration (Look), then, based on the perceived configuration, takes a decision to stay idle or to move to one of its adjacent nodes (Compute), and in the latter case it eventually moves to this neighbor (Move). Moreover, robots are endowed with very weak capabilities. Namely, they are anonymous, asynchronous, oblivious, uniform (execute the same algorithm) and have no common sense of orientation. In this setting, we devise algorithms that, starting from an exclusive and rigid (i.e. aperiodic and asymmetric) configuration, solve the three above problems in anonymous ring-topologies.", "paper_title": "Computing on Rings by Oblivious Robots: A Unified Approach for Different Tasks", "paper_id": "WOS:000356461400008"}