{"auto_keywords": [{"score": 0.04794413353086133, "phrase": "intelligent_agents"}, {"score": 0.00481495049065317, "phrase": "collaborative_systems"}, {"score": 0.004548253531664032, "phrase": "new_specific_collaboration_models"}, {"score": 0.004345525254560329, "phrase": "effective_collaboration_processes"}, {"score": 0.004223415145617665, "phrase": "dynamic_environments"}, {"score": 0.004081385289516914, "phrase": "distributive_systems"}, {"score": 0.0039216854691927865, "phrase": "negotiation_mechanism"}, {"score": 0.0031215289677725693, "phrase": "global_collaborative_system"}, {"score": 0.0030164423559955896, "phrase": "multi-agent_based_simulation_tool"}, {"score": 0.002784755056588371, "phrase": "collaborative_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Distributed system", " Collaboration", " Awareness", " Multi-agent system"], "paper_abstract": "New specific collaboration models for distributive systems are needed for enabling effective collaboration processes between users of these dynamic environments. However, collaboration in distributive systems depends on several elements such as a negotiation mechanism, a load-balancing strategy, a mutual exclusion mechanism, and a learning strategy. Each of these elements should be analyzed separately in terms of efficiency and effectiveness in order to improve these two features in the global collaborative system. This paper presents a multi-agent based simulation tool and a simulation methodology used to evaluate the efficiency and effectiveness of a collaborative system by analyzing both the global system of each of the strategies or mechanisms involved in the system. Intelligent agents used in the simulation make use of the concept of awareness of interaction for quantifying the degree, nature and quality of the interaction between the agents. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Simulating collaborative systems by means of awareness of interaction among intelligent agents", "paper_id": "WOS:000284987900003"}