{"auto_keywords": [{"score": 0.03969212510823958, "phrase": "multiplicity_constraints_problem"}, {"score": 0.01573911082351467, "phrase": "msmc"}, {"score": 0.008029484120231101, "phrase": "smc"}, {"score": 0.005302633983096167, "phrase": "first_known_exact_algorithm"}, {"score": 0.005139112186781455, "phrase": "dynamic_programming"}, {"score": 0.00481495049065317, "phrase": "multicover_and_multiset_multicover_problems"}, {"score": 0.004247560712327667, "phrase": "minimum_number"}, {"score": 0.0036001255166809793, "phrase": "polynomial_space"}, {"score": 0.0035390378585554547, "phrase": "maximum_coverage_requirement"}, {"score": 0.0035189057079817285, "phrase": "vertical_bar"}, {"score": 0.0035088824684910962, "phrase": "f_vertical_bar"}, {"score": 0.0034789831290103967, "phrase": "total_number"}, {"score": 0.003166384930533443, "phrase": "inclusion-exclusion_principle"}, {"score": 0.0029483516334882862, "phrase": "y._wang"}, {"score": 0.002931569771634119, "phrase": "d._yu"}, {"score": 0.0029148831519944358, "phrase": "f.c.m._lau"}, {"score": 0.0028409576481842457, "phrase": "theoretical_computer_science"}, {"score": 0.002690975370565776, "phrase": "hard_problems"}, {"score": 0.0026528362797828306, "phrase": "utrecht_university"}, {"score": 0.0025561788724870974, "phrase": "fastest_exact_algorithm"}, {"score": 0.0021721876496534837, "phrase": "constructive_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Set multicover", " Multiset multicover", " Inclusion-exclusion", " Dynamic programming", " Algorithm"], "paper_abstract": "Given a universe N containing is elements and a collection of multisets or sets over N, the multiset multicover (MSMC) problem or the set multicover (SMC) problem is to cover all elements at least a number of times as specified in their coverage requirements with the minimum number of multisets or sets. In this paper, we give various exact algorithms for these two problems with or without constraints on the number of times a multiset or set may be chosen. First, we show that the MSMC without multiplicity constraints problem can be solved in O* ((b +1)(n)vertical bar F vertical bar) time and polynomial space, where b is the maximum coverage requirement and vertical bar F vertical bar denotes the total number of given multisets over N. (The O* notation suppresses a factor polynomial in n.) To our knowledge, this is the first known exact algorithm for the MSMC without multiplicity constraints problem. Second, by combining dynamic programming and the inclusion-exclusion principle, we can exactly solve the SMC without multiplicity constraints problem in O((b + 2)(n)) time. Compared with two recent results, in [Q.-S. Hua, Y. Wang, D. Yu, F.C.M. Lau, Set multi-covering via inclusion-exclusion, Theoretical Computer Science, 410 (38-40) (2009) 3882-3892] and [J. Nederlof. Inclusion exclusion for hard problems, Master Thesis, Utrecht University, The Netherlands, 2008], respectively, ours is the fastest exact algorithm for the SMC without multiplicity constraints problem. Finally, by directly using dynamic programming, we give the first known exact algorithm for the MSMC or the SMC with multiplicity constraints problem in O((b + 1)(n)vertical bar F vertical bar) time and O* ((b + 1)(n)) space. This algorithm can also be easily adapted as a constructive algorithm for the MSMC without multiplicity constraints problem. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Dynamic programming based algorithms for set multicover and multiset multicover problems", "paper_id": "WOS:000278564600005"}