{"auto_keywords": [{"score": 0.049675053299362504, "phrase": "ill-structured_problem"}, {"score": 0.00481495049065317, "phrase": "college_students'_knowledge_acquisition"}, {"score": 0.0043863636475983845, "phrase": "procedure_question"}, {"score": 0.004349337717774093, "phrase": "differentially_affected_students'_knowledge_acquisition"}, {"score": 0.0038624981944755813, "phrase": "social_science_context"}, {"score": 0.003829877278269543, "phrase": "eighty-four_undergraduate_pre-service_teachers"}, {"score": 0.003548368289666932, "phrase": "integration_prompts"}, {"score": 0.0034299649219748513, "phrase": "procedure_prompts"}, {"score": 0.0028822153400215973, "phrase": "knowledge_acquisition"}, {"score": 0.002857849698346116, "phrase": "problem_representation"}, {"score": 0.0026929458952693465, "phrase": "cognitive_schema"}, {"score": 0.0026252106881752067, "phrase": "direct_students'_attention"}, {"score": 0.002391067964886602, "phrase": "integration_prompt"}, {"score": 0.0023210293050850276, "phrase": "successful_ill-structured_problem"}, {"score": 0.002281930100792185, "phrase": "procedure_prompt"}, {"score": 0.0021501863832966966, "phrase": "web-based_learning_environments"}, {"score": 0.0021049977753042253, "phrase": "integrative_knowledge"}], "paper_keywords": ["Adult learning", " Architectures for educational technology", " system", " Interactive learning environments", " Pedagogical issues", " Teaching/learning strategies"], "paper_abstract": "This study examined how web-based integration and procedure question prompts differentially affected students' knowledge acquisition and ill-structured problem solving skills, particularly in representing problem(s), developing solutions, and monitoring and evaluating a plan of action within the social science context. Eighty-four undergraduate pre-service teachers were recruited and randomly assigned to one of the four conditions. (1) an IP condition that required students to complete integration prompts, (2) a PP condition that required students to complete procedure prompts, (3) an IPP condition that required students to complete both integration and procedure prompts, or (4) a control condition that did not provide access to any prompts The findings show that students who received integration prompts outperformed those who did not receive any in knowledge acquisition and problem representation for solving an ill-structured problem Integration prompts also helped the development and integration of cognitive schema, whereas procedure prompts helped direct students' attention to specific features of the problem in order to arrive at the solution(s) In fact, the presence of an integration prompt alone is not sufficient to support successful ill-structured problem solving unless a procedure prompt is provided Based on these findings, this study offers implications for designing Web-based learning environments, engineered to promote integrative knowledge and ill-structured problem solving skills. (C) 2010 Elsevier Ltd All rights reserved", "paper_title": "Promoting college students' knowledge acquisition and ill-structured problem solving: Web-based integration and procedure prompts", "paper_id": "WOS:000277110400030"}