{"auto_keywords": [{"score": 0.03583574966327729, "phrase": "first_scenario"}, {"score": 0.03265882712288986, "phrase": "second_scenario"}, {"score": 0.00481495049065317, "phrase": "n-node_tree"}, {"score": 0.004690952711665194, "phrase": "k_mobile_agents"}, {"score": 0.003941746077126688, "phrase": "optimal_collective_exploration"}, {"score": 0.003581797255879607, "phrase": "unknown_trees"}, {"score": 0.00326881479036966, "phrase": "currently_visited_node"}, {"score": 0.0032546105164772995, "phrase": "previously_acquired_information"}, {"score": 0.0027341763737751467, "phrase": "communication_capability"}, {"score": 0.002675252546913683, "phrase": "collective_exploration"}, {"score": 0.0025723630851105304, "phrase": "exploration_algorithm"}, {"score": 0.0024306740161601625, "phrase": "optimal_exploration_time"}, {"score": 0.0024095777415804346, "phrase": "full_knowledge"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["algorithm", " collective graph exploration", " mobile agent", " robot", " tree"], "paper_abstract": "An n-node tree has to be explored by k mobile agents (robots), starting at its root. Every edge of the tree must be traversed by at least one robot, and exploration must be completed as fast as possible. Even when the tree is known in advance, scheduling optimal collective exploration turns out to be NP-hard. We investigate the problem of how communication among robots influences the time for exploring unknown trees. To this end, we consider two scenarios. In the first scenario, robots can communicate by writing at the currently visited node previously acquired information, and reading information available at this node. In the second scenario robots are oblivious of one another, and each of them knows only the part of the tree previously explored by itself. We show that this difference of communication capability significantly influences time of collective exploration. Under the first scenario, we construct an exploration algorithm whose running time for any tree is only O(k/log k) larger than the optimal exploration time with full knowledge of the tree, while under the second scenario we prove that every algorithm works in time Omega(k) larger than optimal, for some trees. (C) 2006 Wiley Periodicals, Inc.", "paper_title": "Collective tree exploration", "paper_id": "WOS:000240776900006"}