{"auto_keywords": [{"score": 0.048564928403357514, "phrase": "collaborative_tools"}, {"score": 0.00481495049065317, "phrase": "software_companies"}, {"score": 0.004556901872357751, "phrase": "work_place"}, {"score": 0.0038802832668554457, "phrase": "industry_needs"}, {"score": 0.0038447943243941685, "phrase": "curricula_recommendations"}, {"score": 0.0037060428445111694, "phrase": "collaborative_knowledge"}, {"score": 0.0034751259234824913, "phrase": "labor_market"}, {"score": 0.0032585499655442404, "phrase": "software_projects"}, {"score": 0.0029181203386806683, "phrase": "marketing_strategy"}, {"score": 0.002878140062594849, "phrase": "recruitment_process"}, {"score": 0.0025892330566358503, "phrase": "statistical_techniques"}, {"score": 0.002224510044064184, "phrase": "collaborative_skills"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["collaborative environments", " computer supported collaborative work", " collaborative tools", " computer science education"], "paper_abstract": "Software companies encourage and further the use of collaborative tools and skills at the work place in pursuit of the benefits of their use: they improve communication, productivity and efficiency, and competitiveness. Besides, undergraduate and graduate software engineering computing curricula recommend subjects related to effective cooperative working and group learning. In order to align industry needs and curricula recommendations, universities should provide graduates with the collaborative knowledge and skills that will be required when they finish their degrees and join the labor market. In this scenario, we asked three questions: Are collaborative tools beneficial to software projects? Is it easier for graduates with knowledge and skills of collaborative tools to find a job? Do enterprises use collaborative tools as a marketing strategy for the recruitment process or are they really empowering their employees to use collaborative tools? We devised a survey which was administered to 86 recent computer science graduates. We applied statistical techniques to analyze the responses. We conclude that graduates skilled in the use of collaborative tools do find it easier to get jobs, and companies are not only looking for people with collaborative skills but also regularly use collaborative tools in their work processes. Copyright (c) 2015 John Wiley & Sons, Ltd.", "paper_title": "Collaborative tools: computer science students' skills versus software industry needs", "paper_id": "WOS:000352093300004"}