{"auto_keywords": [{"score": 0.03657146662888917, "phrase": "quality_evaluation_method"}, {"score": 0.03471106580504896, "phrase": "conceptual_model"}, {"score": 0.02632647964669402, "phrase": "cognitive_engagement"}, {"score": 0.01329962802970191, "phrase": "conceptual_model_quality_evaluation_work"}, {"score": 0.00481495049065317, "phrase": "conceptual_model_quality_evaluation"}, {"score": 0.004661775069083667, "phrase": "information_systems"}, {"score": 0.004562362497952548, "phrase": "users'_work_domains"}, {"score": 0.003853251284913932, "phrase": "material_impact"}, {"score": 0.0036509280916606937, "phrase": "conceptual_models"}, {"score": 0.0031845067058084583, "phrase": "forty-eight_expert_data"}, {"score": 0.0029210388852074208, "phrase": "greater_ontological_clarity"}, {"score": 0.0025660347613972573, "phrase": "participants'_protocols"}, {"score": 0.002493184318829227, "phrase": "higher_levels"}, {"score": 0.0021509807762081145, "phrase": "important_factor"}, {"score": 0.0021049977753042253, "phrase": "conceptual_model_evaluation_work"}], "paper_keywords": ["Conceptual Model", " Conceptual Model Quality Evaluation", " Ontological Clarity", " Cognitive Engagement"], "paper_abstract": "When analysts build information systems, they document their understanding of users' work domains via conceptual models. Once a model has been developed, analysts should then check it has no defects. The literature provides little guidance about approaches to improve the effectiveness of conceptual model quality evaluation work. In this light, we propose a theory in which two factors have a material impact on the effectiveness of conceptual model quality evaluation work: (a) the ontological clarity of the conceptual models prepared, and (b) the extent to which analysts use a quality evaluation method designed to cognitively engage stakeholders with the semantics of the domain represented by a conceptual model. We tested our theory using an experiment involving forty-eight expert data modeling practitioners. Their task was to find as many defects as possible in a conceptual model. Our results showed that participants who received the conceptual model with greater ontological clarity on average detected more defects. However, participants who were given a quality evaluation method designed to cognitively engage them more with the semantics of the domain did not detect more defects. Nonetheless, during our analysis of participants' protocols, we found that those who manifested higher levels of cognitive engagement with the model detected more defects. Thus, we believe that our treatment for the level of cognitive engagement evoked by the quality evaluation method did not take effect. Based on our protocol analyses, we argue that cognitive engagement appears to be an important factor that affects the quality of conceptual model evaluation work.", "paper_title": "Ontological Clarity, Cognitive Engagement, and Conceptual Model Quality Evaluation: An Experimental Investigation", "paper_id": "WOS:000309813500001"}