{"auto_keywords": [{"score": 0.03935512626074735, "phrase": "ibp_ss_controller"}, {"score": 0.009306905669884699, "phrase": "barge_platform"}, {"score": 0.008518449617129815, "phrase": "onshore_wind_turbine"}, {"score": 0.00481495049065317, "phrase": "individual_blade_pitch_control"}, {"score": 0.004764859786310636, "phrase": "offshore_wind_turbines"}, {"score": 0.004314127287770832, "phrase": "wind_speed_perturbations"}, {"score": 0.004115697805448384, "phrase": "barge_and_tension_leg_floating_platforms"}, {"score": 0.00396767023935381, "phrase": "wind_speed_region"}, {"score": 0.0036873373225096624, "phrase": "wind_speed_disturbance_rejection_component"}, {"score": 0.0034992667091713813, "phrase": "floating_platforms"}, {"score": 0.0029284999172756103, "phrase": "large_tower_load_reductions"}, {"score": 0.002337684811187166, "phrase": "tension_leg_platform"}, {"score": 0.002218299213266519, "phrase": "onshore_system"}, {"score": 0.0021951623041245897, "phrase": "power_and_rotor_speed_regulation"}, {"score": 0.0021496083700137305, "phrase": "tower_side-side_load"}], "paper_keywords": ["Offshore", " Floating wind turbine", " Load control", " Individual blade pitching"], "paper_abstract": "Individual blade pitch state space (IBP SS) control and disturbance accommodating control (DAC) that reject wind speed perturbations are applied on a 5 MW wind turbine mounted on the barge and tension leg floating platforms for performance comparison in above rated wind speed region. The DAC used in this study is simply an IBP SS controller with a wind speed disturbance rejection component. For each controller implemented onshore and on the floating platforms, 60 10-min simulations with a variety of wind and wave conditions, where applicable, are carried out in accordance with the IEC-61400-3 standard design load case 1.2 for fatigue load testing. Results show that even with large tower load reductions by the IBP SS controller on the barge platform, these loads are still at least two and up to five times more than that for an onshore wind turbine. DAC on the barge platform has little impact on further improving the performance of the IBP SS controller. DAC on the tension leg platform manages to achieve loads comparable to that of the onshore system. Power and rotor speed regulation are improved and tower side-side load is reduced. Only the tower fore-aft load is 24% higher than the onshore wind turbine. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Performance analysis of individual blade pitch control of offshore wind turbines on two floating platforms", "paper_id": "WOS:000291834300007"}