{"auto_keywords": [{"score": 0.046633245390760206, "phrase": "mram"}, {"score": 0.008713759023732653, "phrase": "magnetic_random_access_memory"}, {"score": 0.004278807087784626, "phrase": "promising_memory_technology"}, {"score": 0.004071249707923223, "phrase": "fast_access"}, {"score": 0.00402094658848301, "phrase": "zero_standby_leakage"}, {"score": 0.003971262520692664, "phrase": "high_density"}, {"score": 0.003617616153730564, "phrase": "hybrid_magnetic-cmos_fabrication_process"}, {"score": 0.003336614511719501, "phrase": "cmos_logic"}, {"score": 0.0029830992938695007, "phrase": "mram_properties"}, {"score": 0.0029097582786754444, "phrase": "mram_cache_model"}, {"score": 0.0025691622090542304, "phrase": "mram_caches"}, {"score": 0.0025373711401047772, "phrase": "microprocessor_cores"}, {"score": 0.002131383155056741, "phrase": "large_reduction"}, {"score": 0.0021049977753042253, "phrase": "power_consumption"}], "paper_keywords": [""], "paper_abstract": "Magnetic random access memory (MRAM) has been considered as a promising memory technology because of its attractive properties such as non-volatility, fast access, zero standby leakage and high density. Although integrating MRAM with complementary metal-oxide-semiconductor (CMOS) logic may incur extra manufacturing cost because of the hybrid magnetic-CMOS fabrication process, it is feasible and cost-effective to fabricate MRAM and CMOS logic separately and then integrate them using 3D stacking. In this work, we first studied the MRAM properties and built an MRAM cache model in terms of performance, energy and area. Using this model, we evaluated the impact of stacking MRAM caches atop microprocessor cores and compared MRAM against its static random access memory (SRAM) and dynamic random access memory (DRAM) counterparts. Our simulation result shows that MRAM stacking can provide competitive instruction-per-cycle (IPC) performance with a large reduction in power consumption.", "paper_title": "Stacking magnetic random access memory atop microprocessors: an architecture-level evaluation", "paper_id": "WOS:000290783100008"}