{"auto_keywords": [{"score": 0.04260188975253477, "phrase": "disruption_management"}, {"score": 0.016531991216207517, "phrase": "problem_characteristics"}, {"score": 0.010530856385300479, "phrase": "proactive_planning"}, {"score": 0.006396329137831855, "phrase": "classification_scheme"}, {"score": 0.00481495049065317, "phrase": "disruption_risk"}, {"score": 0.004796311402425422, "phrase": "express_logistics"}, {"score": 0.00464976086880886, "phrase": "comprehensive_review"}, {"score": 0.004631758267671427, "phrase": "state-of-the-art_works"}, {"score": 0.004464156619275582, "phrase": "new_research_directions"}, {"score": 0.004421063493736839, "phrase": "logistics_practitioners"}, {"score": 0.004236321075918639, "phrase": "search_process"}, {"score": 0.004138813595009761, "phrase": "horizontal_dimension"}, {"score": 0.004012271808564447, "phrase": "vertical_dimension"}, {"score": 0.003859500298805362, "phrase": "full_text_query"}, {"score": 0.0038222215952300282, "phrase": "\"airline_operations\""}, {"score": 0.0037414662674652805, "phrase": "database_overlap"}, {"score": 0.0036909638501532818, "phrase": "academic_journals"}, {"score": 0.003634163479885637, "phrase": "english"}, {"score": 0.003329994649432498, "phrase": "nine_sub-categories"}, {"score": 0.003228101865545105, "phrase": "new_categories"}, {"score": 0.003209345853409, "phrase": "air-transportation_recovery"}, {"score": 0.0031476068430779367, "phrase": "robust_planning"}, {"score": 0.003051277763904487, "phrase": "recovery_problems"}, {"score": 0.002975178815784779, "phrase": "air-transportation_express_logistics"}, {"score": 0.002923606320521538, "phrase": "comprehensive_and_feasible_taxonomy"}, {"score": 0.0029122673630513464, "phrase": "disruption_risk_management"}, {"score": 0.0028506823968539206, "phrase": "application_scenarios"}, {"score": 0.002763415176377921, "phrase": "in-depth_classification"}, {"score": 0.0025867180355950816, "phrase": "problem's_nature"}, {"score": 0.0025617014518131845, "phrase": "future_directions"}, {"score": 0.002527083139627522, "phrase": "future_research_directions"}, {"score": 0.0025026418478076066, "phrase": "critical_research_gaps"}, {"score": 0.0023746766301040974, "phrase": "express_logistics_practitioners"}, {"score": 0.0023608674697998115, "phrase": "logistics_network_reliability"}, {"score": 0.0022841153001549193, "phrase": "different_algorithms"}, {"score": 0.0022271066624030785, "phrase": "distinct_characteristics"}, {"score": 0.0022141537427057363, "phrase": "problem_elements"}, {"score": 0.0021715177915174375, "phrase": "previous_efforts"}, {"score": 0.002154693685426657, "phrase": "disruption_management_classification_scheme"}, {"score": 0.0021049977753042253, "phrase": "problem_nature"}], "paper_keywords": ["Air transport", " Express logistics", " Disruption management", " Proactive planning"], "paper_abstract": "Purpose - The purpose of this paper is to carry out a comprehensive review for state-of-the-art works in disruption risk management of express logistics mainly supported by air-transportation. The authors aim to suggest some new research directions and insights for express logistics practitioners to develop more robust planning in air-transportation. Design/methodology/approach - The authors mainly confined the research to papers published over the last two decades. The search process was conducted in two dimensions: horizontal and vertical. In the horizontal dimension, attention was paid to the evolution of disruption management across the timeline. In the vertical dimension, different foci and strategies of disruption management are employed to distinguish each article. Three keywords were used in the full text query: \"Disruption management\", \"Air transportation\", and \"Airline Operations\" in all database searches listed above. Duplications due to database overlap, articles other than those from academic journals, and papers in languages other than English were discarded. Findings - A total of 98 articles were studied. The authors categorized the papers into two broad categories: Reactive Recovery, and Proactive Planning. In addition, based on the problem characteristics and their application scenarios, a total of 11 sub-categories in reactive recovery and nine sub-categories in proactive planning were further identified. From the analysis, the authors identified some new categories in the air-transportation recovery. In addition, by analyzing the papers in robust planning, according to the problem characteristics and the state-of-the-art research in recovery problems, the authors proposed four new research directions to enhance the reliability and robustness of air-transportation express logistics. Research limitations/implications - This study provided a comprehensive and feasible taxonomy of disruption risk management. The classification scheme was based on the problem characteristics and the application scenarios, rather than the algorithms. One advantage of this scheme is that it enables an in-depth classification of the problem, that is, sub-categories of each class can be revealed, which provides a much wider and clearer horizon to the scientific progress in this area. This helps researchers to reveal the problem's nature and to identify the future directions more systematically. The suggestions for future research directions also point out some critical research gaps and opportunities. Practical implications - This study summarized various reasons which account for the disruption in air-transportation. In addition, the authors suggested various considerations for express logistics practitioners to enhance logistics network reliability and efficiency. Originality/value - There are various classification schemes in the literature to categorize disruption management. Using different algorithms (e.g. exact algorithm, heuristics, meta-heuristics) and distinct characteristics of the problem elements (e.g. aircraft, crew, passengers, etc.) are the most common schemes in previous efforts to produce a disruption management classification scheme. However, the authors herein attempted to focus on the problem nature and the application perspective of disruption management. The classification scheme is hence novel and significant.", "paper_title": "Managing disruption risk in express logistics via proactive planning", "paper_id": "WOS:000369166000006"}