{"auto_keywords": [{"score": 0.0497584468847577, "phrase": "medication_management_process"}, {"score": 0.04706452874709233, "phrase": "second-generation_erx_technologies"}, {"score": 0.015546619435200457, "phrase": "primary_care"}, {"score": 0.010517032832691675, "phrase": "push_model"}, {"score": 0.00481495049065317, "phrase": "second-generation_electronic_prescriptions"}, {"score": 0.004655924035639928, "phrase": "second-generation_electronic_prescription"}, {"score": 0.0043533862892678864, "phrase": "key_words"}, {"score": 0.004276069461529461, "phrase": "relevant_databases"}, {"score": 0.004218980493361923, "phrase": "manual_search"}, {"score": 0.0040978781692373005, "phrase": "prior_systematic_reviews"}, {"score": 0.004016072233242585, "phrase": "major_periodicals"}, {"score": 0.0038833278847237858, "phrase": "erx_technologies"}, {"score": 0.0038573081851680656, "phrase": "electronic_circulation"}, {"score": 0.0038228852079830867, "phrase": "prescription_sites"}, {"score": 0.003805788648230075, "phrase": "dispensing_sites"}, {"score": 0.0037297918570822876, "phrase": "structured_form"}, {"score": 0.0036553070575015344, "phrase": "studies'_impacts"}, {"score": 0.003425235961015483, "phrase": "nineteen_observational_studies"}, {"score": 0.0033119557473068784, "phrase": "users'_perceptions"}, {"score": 0.0031313934668702305, "phrase": "specific_pharmacy"}, {"score": 0.00310342843791748, "phrase": "pull_model"}, {"score": 0.0030688220103201836, "phrase": "authorized_pharmacy"}, {"score": 0.002869115451202179, "phrase": "communications_standards"}, {"score": 0.002730949750233485, "phrase": "pharmacological_profile"}, {"score": 0.0026346521749954503, "phrase": "stakeholders'_perceptions"}, {"score": 0.002605259425201507, "phrase": "considerable_differences"}, {"score": 0.0025021277555259715, "phrase": "electronic_transmission"}, {"score": 0.0024742098091226203, "phrase": "new_way"}, {"score": 0.0024576084154573396, "phrase": "patient_compliance"}, {"score": 0.0023656111509970604, "phrase": "highly_promoted_model"}, {"score": 0.0023497367135689837, "phrase": "primary_care_quality"}, {"score": 0.002282166507956957, "phrase": "second-generation_technologies"}, {"score": 0.0022315116296688893, "phrase": "actual_use"}, {"score": 0.0022215160785078797, "phrase": "future_studies"}, {"score": 0.0021819786261885955, "phrase": "full_descriptions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Electronic prescription", " Medication management", " Primary care", " Systematic review", " Electronically transmitted prescription"], "paper_abstract": "Objective: To describe second-generation electronic prescription (eRx) technologies and identify their impacts on the medication management process in primary care. Second-generation eRx technologies have focused on networking various stakeholders so that they can communicate electronically. Method: Using key words, a search was conducted of the relevant databases up to January 2011. A manual search was conducted of the bibliographies of the studies as well as the prior systematic reviews found. The tables of contents of the major periodicals in the field were also searched. This included studies of the impacts of eRx technologies that allow electronic circulation of information between prescription sites and dispensing sites, independent of the methodology used. A structured form was used to extract the data. The studies' impacts were classified by stage in the medication management process (prescription, transmission of the prescription, execution of the prescription and use of the medication). Results: Nineteen observational studies were included in this review. Most of them (10/19) have evaluated users' perceptions using interviews, focus groups or questionnaires. Two technology models stand out: the push model, under which the prescriber directs the prescription toward a specific pharmacy, and the pull model, under which any authorized pharmacy can download a given prescription into its system. The push model is the most widely used, particularly in the United States. Communication between prescribers and dispensers is usually unidirectional, and communications standards have to be refined. The only demonstrated impacts of second-generation eRx technologies were found at two levels: positive impacts on the quality of the pharmacological profile available to professionals, and negative impacts on the execution of prescriptions in pharmacies. Stakeholders' perceptions were mixed and reflected considerable differences according to context, the type of technology used, the intensity of its use and its maturity. Electronic transmission of prescriptions provides a new way to monitor patient compliance. Conclusion: There is little empirical data demonstrating benefits to second-generation eRx technologies, even if it is a highly promoted model for improving primary care quality. More research is required, with studies that measure the impacts of second-generation technologies using empirical data and conducted in the context of actual use. Future studies should also employ the same terminology and provide full descriptions of context, type of technology and intensity of use. (c) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Impacts of second-generation electronic prescriptions on the medication management process in primary care: A systematic review", "paper_id": "WOS:000318998700001"}