{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "population_mcmc"}, {"score": 0.008242847864014151, "phrase": "response_surfaces"}, {"score": 0.004390312150344245, "phrase": "history-matched_models"}, {"score": 0.004096493540086106, "phrase": "computational_biology"}, {"score": 0.003947884118204803, "phrase": "reservoir_modelling"}, {"score": 0.0038577428353448596, "phrase": "multiple_markov_chains"}, {"score": 0.0032968474833776906, "phrase": "varying_power"}, {"score": 0.002936997013291548, "phrase": "large_steps"}, {"score": 0.0028698706191651155, "phrase": "high_probability"}, {"score": 0.0027528751037412128, "phrase": "ic_fault_model"}, {"score": 0.0025802660239538353, "phrase": "highly_irregular_misfit_surface"}, {"score": 0.002341384304635523, "phrase": "multi-modal_posterior_probability_distribution"}, {"score": 0.0021344259291927914, "phrase": "high_posterior_probability"}, {"score": 0.0021049977753042253, "phrase": "algorithm_settings"}], "paper_keywords": ["History matching", " Uncertainty quantification", " MCMC methods", " Population MCMC"], "paper_abstract": "This paper presents the application of a population Markov Chain Monte Carlo (MCMC) technique to generate history-matched models. The technique has been developed and successfully adopted in challenging domains such as computational biology but has not yet seen application in reservoir modelling. In population MCMC, multiple Markov chains are run on a set of response surfaces that form a bridge from the prior to posterior. These response surfaces are formed from the product of the prior with the likelihood raised to a varying power less than one. The chains exchange positions, with the probability of a swap being governed by a standard Metropolis accept/reject step, which allows for large steps to be taken with high probability. We show results of Population MCMC on the IC Fault Model-a simple three-parameter model that is known to have a highly irregular misfit surface and hence be difficult to match. Our results show that population MCMC is able to generate samples from the complex, multi-modal posterior probability distribution of the IC Fault model very effectively. By comparison, previous results from stochastic sampling algorithms often focus on only part of the region of high posterior probability depending on algorithm settings and starting points.", "paper_title": "Population MCMC methods for history matching and uncertainty quantification", "paper_id": "WOS:000303583500014"}