{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "controllability_problems"}, {"score": 0.010514349881698404, "phrase": "fewest_channels"}, {"score": 0.007316610483923018, "phrase": "minimum_number"}, {"score": 0.005583808049995221, "phrase": "test_sequence"}, {"score": 0.0040133278382101885, "phrase": "additional_controllability_problems"}, {"score": 0.003812299519486331, "phrase": "external_coordination_messages"}, {"score": 0.0036213041338584756, "phrase": "external_network"}, {"score": 0.0032827577713351336, "phrase": "coordination_channels"}, {"score": 0.003206916619690171, "phrase": "distributed_testing"}, {"score": 0.0030604342671868836, "phrase": "first_problem"}, {"score": 0.0027100527874262446, "phrase": "second_problem"}, {"score": 0.0026598200370569433, "phrase": "minimal_set"}, {"score": 0.0023551955270737215, "phrase": "last_problem"}, {"score": 0.0022580713471027996, "phrase": "particular_test_objective"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Distributed test architecture", " Controllability problem", " Minimizing channels", " Test execution"], "paper_abstract": "When testing a system that has multiple physically distributed ports/interfaces it is normal to place a tester at each port. Each tester observes only the events at its port and it is known that this can lead to additional controllability problems. While such controllability problems can be overcome by the exchange of external coordination messages between the testers, this requires the deployment of an external network and may thus increase the costs of testing. The problem studied in this paper is finding a minimum number of coordination channels to overcome controllability problems in distributed testing. Three instances of this problem are considered. The first problem is to find a minimum number of channels between testers in order to overcome the controllability problems in a given test sequence to be applied in testing. The second problem is finding a minimal set of channels that allow us to overcome controllability problems in any test sequence that may be selected from the specification of the system under test. The last problem is to find a test sequence that achieves a particular test objective and in doing so allows fewest channels to be used. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Overcoming controllability problems with fewest channels between testers", "paper_id": "WOS:000264703300008"}