{"auto_keywords": [{"score": 0.018360681612758167, "phrase": "video_data_units"}, {"score": 0.00481495049065317, "phrase": "sharing_model"}, {"score": 0.004586531354697466, "phrase": "proxy-subscriber-subscriber_approach"}, {"score": 0.003453584878128719, "phrase": "vod_request"}, {"score": 0.003107935254560724, "phrase": "remote_server"}, {"score": 0.003070340620983981, "phrase": "csa_architecture"}, {"score": 0.0028890603352364273, "phrase": "lowest_layer"}, {"score": 0.002264607102799332, "phrase": "video_data_unit"}, {"score": 0.0021221627745801478, "phrase": "different_scenarios"}, {"score": 0.0021049977753042253, "phrase": "vod_services"}], "paper_keywords": ["video-on-demand", " video delivery", " content delivery network", " set-top box", " time-weighted video popularity", " user interest", " load balancing"], "paper_abstract": "This paper outlines a proxy-subscriber-subscriber approach, named cohort-surrogate-associate (CSA) architecture, to address three main concerns inherent in a video-on-demand (VoD) service: delivery performance, video traffic, and playout delay. The model coerced coordination among subscribers, whereby every subscriber has a list of video data units stored in their set-top-box (STB) as well those that are stored in other subscriber's STB within the same network edge. This way, a VoD request can be systematically offloaded to other subscriber(s) cached with the same video data units, within the same network edge, instead of requesting the video data units from a proxy or remote server. The CSA architecture may be conceptualized as a composition of three 'layer', the associate being the lowest layer, followed by the surrogate and the cohort. The cohort is responsible for grouping associate(s) with same viewing interest together i.e. watching the same quasi-genre video. The surrogate is responsible for coordinating the delivery of video data units among associate(s) at the same network edge, when needed. All associate(s) in the same network edge can be the contributors of the video data unit. This paper formally defines the role of cohort, surrogate, and associate under different scenarios for VoD services.", "paper_title": "COHORT-SURROGATE-ASSOCIATE: A SERVER-SUBSCRIBER LOAD SHARING MODEL FOR VIDEO-ON-DEMAND SERVICES", "paper_id": "WOS:000290405700001"}