{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fairest_revenue-sharing_coefficient"}, {"score": 0.022343010087931423, "phrase": "functional_logistics_service_provider"}, {"score": 0.008650541107529332, "phrase": "logistics_service_supply_chain"}, {"score": 0.008556551490876944, "phrase": "stochastic_demand_condition"}, {"score": 0.008341161355084873, "phrase": "revenue-sharing_contract"}, {"score": 0.006951418028642992, "phrase": "logistics_service_integrator"}, {"score": 0.005134092150376659, "phrase": "three-echelon_logistics_service_supply_chain"}, {"score": 0.004475436844227947, "phrase": "rational_revenue-sharing_coefficient"}, {"score": 0.0043464021636703066, "phrase": "supply_chain"}, {"score": 0.004236539316738291, "phrase": "existing_system"}, {"score": 0.004099340908974491, "phrase": "current_revenue-sharing_coefficient_study"}, {"score": 0.0039665679106594106, "phrase": "specific_value"}, {"score": 0.003659768899837118, "phrase": "two-echelon_logistics_service_supply_chain"}, {"score": 0.0034642599795044445, "phrase": "non-storage_property"}, {"score": 0.00336428077531883, "phrase": "stackelberg_game_model"}, {"score": 0.0032196786163178107, "phrase": "revenue-sharing_coefficient"}, {"score": 0.0031728680535262083, "phrase": "revenue-sharing_contract_mechanism"}, {"score": 0.0030925761790620027, "phrase": "profit_distribution_equity"}, {"score": 0.0030587884803931964, "phrase": "fair_entropy_function"}, {"score": 0.0030032915123993837, "phrase": "non-linear_programming_model"}, {"score": 0.002622647280008795, "phrase": "logistics_subcontractor"}, {"score": 0.002575042977852052, "phrase": "logistics_capacity"}, {"score": 0.0023496433751182162, "phrase": "proposed_method"}, {"score": 0.0021518035978153878, "phrase": "revenue-sharing_contract_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Logistics service supply chain", " Revenue-sharing contract", " Revenue-sharing coefficient", " Stochastic demand"], "paper_abstract": "In the design of the revenue-sharing contract, it is critical to determine a rational revenue-sharing coefficient which affects the coordination and stability of supply chain. In order to improve the existing system, one should take into account that the current revenue-sharing coefficient study only figures out its range rather than the specific value. This paper investigates the fairest revenue-sharing coefficient when the logistics service integrator and the functional logistics service provider implement revenue-sharing contract under stochastic demand condition; by focusing on a two-echelon logistics service supply chain composed of a logistics service integrator and a functional logistics service provider. Taken into consideration the non-storage property of logistics service supply chain, this paper establishes a Stackelberg game model by giving priority to the logistics service integrator. The interval of the revenue-sharing coefficient is obtained by revenue-sharing contract mechanism. Based on the principle of profit distribution equity, a fair entropy function is introduced and a non-linear programming model for solving the fairest revenue-sharing coefficient is established. Furthermore, this method is extended to a three-echelon logistics service supply chain composed of a logistics service integrator, a functional logistics service provider, and a logistics subcontractor. It is assumed that the logistics subcontractor fully commits to the logistics capacity of the functional logistics service provider and consequently a non-linear programming model is constructed to solve the fairest revenue-sharing coefficient of a three-echelon logistics service supply chain under stochastic demand condition. The results exemplifies that the proposed method can find out the fairest revenue-sharing coefficient in a two-echelon and a three-echelon logistics service supply chain, which provides an approach to revenue-sharing contract study. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Deterministic approach to the fairest revenue-sharing coefficient in logistics service supply chain under the stochastic demand condition", "paper_id": "WOS:000324084300004"}