{"auto_keywords": [{"score": 0.025520615928208566, "phrase": "plfs"}, {"score": 0.00481495049065317, "phrase": "parallel_file_system_analysis"}, {"score": 0.004594326191526569, "phrase": "significant_proportion"}, {"score": 0.004512175937946914, "phrase": "parallel_scientific_computing_applications"}, {"score": 0.004383766516923386, "phrase": "file_format_libraries"}, {"score": 0.004228359613476549, "phrase": "growing_divergence"}, {"score": 0.004137761530535196, "phrase": "parallel_file_systems"}, {"score": 0.004093190049699647, "phrase": "compute_clusters"}, {"score": 0.0036729522133392175, "phrase": "sandia_national_laboratories"}, {"score": 0.003416963042033614, "phrase": "mid-sized_commodity_cluster"}, {"score": 0.003355796512884795, "phrase": "riot"}, {"score": 0.0030328769643087066, "phrase": "ibm's_general_parallel_file_system"}, {"score": 0.0029464414592923196, "phrase": "total_write_time"}, {"score": 0.0029146651796243704, "phrase": "flash-io_benchmark"}, {"score": 0.002682133505994396, "phrase": "suboptimal_message"}, {"score": 0.0026628098176168682, "phrase": "interface_hints"}, {"score": 0.002549749054599413, "phrase": "parallel_log-structured_file_system"}, {"score": 0.002486021541116251, "phrase": "emc_corporation"}, {"score": 0.0023125643872311994, "phrase": "varied_improvements"}], "paper_keywords": ["high performance computing", " input/output", " MPI", " checkpointing", " file systems"], "paper_abstract": "Input/Output (I/O) operations can represent a significant proportion of the run-time of parallel scientific computing applications. Although there have been several advances in file format libraries, file system design and I/O hardware, a growing divergence exists between the performance of parallel file systems and the compute clusters that they support. In this paper, we document the design and application of the RIOT I/O toolkit (RIOT) being developed at the University of Warwick with our industrial partners at the Atomic Weapons Establishment and Sandia National Laboratories. We use the toolkit to assess the performance of three industry-standard I/O benchmarks on three contrasting supercomputers, ranging from a mid-sized commodity cluster to a large-scale proprietary IBM BlueGene/P system. RIOT provides a powerful framework in which to analyse I/O and parallel file system behaviour-we demonstrate, for example, the large file locking overhead of IBM's General Parallel File System, which can consume nearly 30% of the total write time in the FLASH-IO benchmark. Through I/O trace analysis, we also assess the performance of HDF-5 in its default configuration, identifying a bottleneck created by the use of suboptimal Message Passing Interface hints. Furthermore, we investigate the performance gains attributed to the Parallel Log-structured File System (PLFS) being developed by EMC Corporation and the Los Alamos National Laboratory. Our evaluation of PLFS involves two high-performance computing systems with contrasting I/O backplanes and illustrates the varied improvements to I/O that result from the deployment of PLFS (ranging from up to 25x speed-up in I/O performance on a large I/O installation to 2x speed-up on the much smaller installation at the University of Warwick).", "paper_title": "Parallel File System Analysis Through Application I/O Tracing", "paper_id": "WOS:000314892500002"}