{"auto_keywords": [{"score": 0.0475596004207704, "phrase": "data_fusion_methods"}, {"score": 0.046345717877726705, "phrase": "virtual_screening"}, {"score": 0.03372726835247677, "phrase": "unique_molecules"}, {"score": 0.00481495049065317, "phrase": "similarity-based_virtual_screening"}, {"score": 0.004712065638657606, "phrase": "search_overlap"}, {"score": 0.004321952227344232, "phrase": "implicit_assumption"}, {"score": 0.004094639048362357, "phrase": "multiple_similarity_searches"}, {"score": 0.0032278559855285945, "phrase": "large_numbers"}, {"score": 0.0028502479839354637, "phrase": "rapid_decrease"}, {"score": 0.0027741761880779535, "phrase": "rapid_increase"}, {"score": 0.002685558057339722, "phrase": "retrieved_molecules"}, {"score": 0.0025717770066591076, "phrase": "approximately_log-log_relationship"}, {"score": 0.0025031188149336257, "phrase": "different_molecules"}, {"score": 0.0023079225317714815, "phrase": "power-law_behaviour"}, {"score": 0.002222102813520549, "phrase": "multiple_searches"}, {"score": 0.0021863046959469863, "phrase": "simple_way"}, {"score": 0.0021049977753042253, "phrase": "similarity_search"}], "paper_keywords": [""], "paper_abstract": "Background: Data fusion methods are widely used in virtual screening, and make the implicit assumption that the more often a molecule is retrieved in multiple similarity searches, the more likely it is to be active. This paper tests the correctness of this assumption. Results: Sets of 25 searches using either the same reference structure and 25 different similarity measures (similarity fusion) or 25 different reference structures and the same similarity measure (group fusion) show that large numbers of unique molecules are retrieved by just a single search, but that the numbers of unique molecules decrease very rapidly as more searches are considered. This rapid decrease is accompanied by a rapid increase in the fraction of those retrieved molecules that are active. There is an approximately log-log relationship between the numbers of different molecules retrieved and the number of searches carried out, and a rationale for this power-law behaviour is provided. Conclusions: Using multiple searches provides a simple way of increasing the precision of a similarity search, and thus provides a justification for the use of data fusion methods in virtual screening.", "paper_title": "Multiple search methods for similarity-based virtual screening: analysis of search overlap and precision", "paper_id": "WOS:000300228200001"}