{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "olap"}, {"score": 0.01557102837524214, "phrase": "information_networks"}, {"score": 0.009599305634789368, "phrase": "bibliographic_data"}, {"score": 0.004723322467153553, "phrase": "bibliographic_data_analysis"}, {"score": 0.0037683358267785435, "phrase": "data_warehousing_systems"}, {"score": 0.0035914198812657897, "phrase": "multiple_dimensions"}, {"score": 0.0035570425396761122, "phrase": "multiple_hierarchical_levels"}, {"score": 0.003497305019567684, "phrase": "bibliographic_networks"}, {"score": 0.003123808471618783, "phrase": "bibliographic_databases"}, {"score": 0.0029914213495838998, "phrase": "structured_data"}, {"score": 0.002690886043654469, "phrase": "new_way"}, {"score": 0.0022845800828325577, "phrase": "survey_paper"}, {"score": 0.0022409963215568565, "phrase": "previous_work"}, {"score": 0.002219516542316085, "phrase": "olap_and_information_networks"}, {"score": 0.0021049977753042253, "phrase": "traditional_olap"}], "paper_keywords": ["OLAP", " Information networks", " Bibliographic data"], "paper_abstract": "In the context of scientometrics and bibliometrics, several research fields are dealing with bibliographic data. In this paper, we will explore how the combination of online analytical processing (OLAP) analysis and information networks could be an interesting issue. In Business Intelligence, OLAP is a technology supported by data warehousing systems. It provides tools for analyzing data according to multiple dimensions and multiple hierarchical levels. At the same time, several information networks (co-authors network, citations network, institutions network, etc.) can be built based on bibliographic databases. Originally, OLAP was introduced to analyze structured data. However, in this paper, we wonder if, by combining OLAP and information networks, we can provide a new way of analyzing bibliographic data. OLAP should be able to handle information networks and be also useful for monitoring, browsing and analyzing the content and the structure of bibliographic networks. The goal of this survey paper is to review previous work on OLAP and information networks dealing with bibliographic data. We also propose a comparison between traditional OLAP and OLAP on information networks and discuss the challenges OLAP faces regarding bibliographic networks.", "paper_title": "Combining OLAP and information networks for bibliographic data analysis: a survey", "paper_id": "WOS:000352995000008"}