{"auto_keywords": [{"score": 0.024834530880696384, "phrase": "source_code"}, {"score": 0.00481495049065317, "phrase": "user_goals"}, {"score": 0.004542158659382197, "phrase": "effective_way"}, {"score": 0.004390192910013225, "phrase": "stakeholder_requirements"}, {"score": 0.004161553532799662, "phrase": "software-intensive_system"}, {"score": 0.003983334573043943, "phrase": "identified_goals"}, {"score": 0.003527181559366122, "phrase": "goal_models"}, {"score": 0.0031845067058084583, "phrase": "resulting_source_code"}, {"score": 0.003107935254560724, "phrase": "stakeholder_intentions"}, {"score": 0.002861062731782219, "phrase": "web-based_systems"}, {"score": 0.002685558057339722, "phrase": "requirements_representation_tool"}, {"score": 0.002400944221804575, "phrase": "intentional_categories"}, {"score": 0.002366110899738696, "phrase": "different_parts"}, {"score": 0.0022536005664642294, "phrase": "interesting_characterisations"}, {"score": 0.0021049977753042253, "phrase": "goal-oriented_web_engineering_frameworks"}], "paper_keywords": [""], "paper_abstract": "Goal models have been found to be an effective way to represent, communicate and analyse stakeholder requirements. Once such models reach some degree of completeness, a software-intensive system is developed to support the achievement of the identified goals. A question that naturally arises in this process, though, is whether and how the way by which requirements are represented in goal models influences the structure of the design of the system to be built. Does the content and organisation of the resulting source code disclose anything about the stakeholder intentions that have led to its production, and how? In this study the authors focus on web-based systems and describe the experiences in developing two small, layered web applications using goal models as a requirements representation tool and without introducing any goal-model specific methodological, design or platform restrictions. The authors study the artefacts of this process in an effort to identify intentional categories to which different parts of the source code belongs. The results indeed suggest interesting characterisations of goals, source code and relationships thereof that could be useful in developing goal-oriented web engineering frameworks and methodologies.", "paper_title": "From intentions to code: exploring the life of user goals in two web-based systems", "paper_id": "WOS:000303930400003"}