{"auto_keywords": [{"score": 0.043400370094307784, "phrase": "directly_modulated_lasers"}, {"score": 0.03141649175509514, "phrase": "original_extinction_ratio"}, {"score": 0.00481495049065317, "phrase": "wdm_access_networks"}, {"score": 0.004648609688625397, "phrase": "fp_etalon"}, {"score": 0.004487989502479992, "phrase": "waveform_reshaping_schemes"}, {"score": 0.004332894955218135, "phrase": "transmission_distance"}, {"score": 0.004257360656055417, "phrase": "fiber_links"}, {"score": 0.0033572130837348623, "phrase": "directly_modulated_laser"}, {"score": 0.0031289290660162145, "phrase": "time-resolved_chirp_measurement"}, {"score": 0.002890557197908352, "phrase": "adiabatic_chirp"}, {"score": 0.0028151944356239952, "phrase": "spectral_reshaping"}, {"score": 0.002670296619878048, "phrase": "optimal_operation_conditions"}, {"score": 0.002488604965680912, "phrase": "single-cavity_fp_etalon_filter"}, {"score": 0.0021049977753042253, "phrase": "limited_filtering_capability"}], "paper_keywords": [""], "paper_abstract": "Spectral and waveform reshaping schemes can enhance the transmission distance of fiber links that use directly modulated lasers as transmitters. We prove the feasibility of using a simple Fabry-Perot (FP) etalon as the spectral reshaper for applications in wavelength division multiplexing (WDM) access networks. The transient chirp and adiabatic chirp of a directly modulated laser are analyzed in detail by using the time-resolved chirp measurement. The effects of the original extinction ratio and the adiabatic chirp on the spectral reshaping are clarified to obtain the optimal operation conditions. It is shown that placing a single-cavity FP etalon filter after multiple 10 Gbits/s directly modulated lasers can extend their transmission distances from <10 to <50 km in the 1.55 mu m wavelength window. Due to the limited filtering capability of the etalon, the choice of the original extinction ratio and finesse of the etalon is discussed in detail from the experiments and simulation. (C) 2009 Optical Society of America", "paper_title": "Spectral filtering of multiple directly modulated channels for WDM access networks by using an FP etalon", "paper_id": "WOS:000264083000006"}