{"auto_keywords": [{"score": 0.04933866662045337, "phrase": "central_authority"}, {"score": 0.015719716506582538, "phrase": "threshold_multi_authority"}, {"score": 0.004796223652568968, "phrase": "attribute_based_encryption"}, {"score": 0.004685375117376838, "phrase": "attribute_based_encryption_scheme"}, {"score": 0.004649014875584406, "phrase": "abe"}, {"score": 0.004056012943302293, "phrase": "chase"}, {"score": 0.004008820473628357, "phrase": "first_multi_authority_abe_scheme"}, {"score": 0.003946766004066276, "phrase": "fully_trusted_central_authority"}, {"score": 0.0036791522245326514, "phrase": "whole_system"}, {"score": 0.0029916929549256297, "phrase": "honest_authorities"}, {"score": 0.0029110398328258194, "phrase": "proposed_scheme"}, {"score": 0.0028436364707396613, "phrase": "stronger_adversary_model"}, {"score": 0.00277778944472107, "phrase": "corrupted_authorities"}, {"score": 0.0027240799841720957, "phrase": "incorrect_secret_keys"}, {"score": 0.0026609940110902666, "phrase": "security_proof"}, {"score": 0.002579140290642792, "phrase": "underlying_distributed_key_generation_protocol"}, {"score": 0.002559072326933071, "phrase": "joint_zero_secret_sharing_protocol"}, {"score": 0.0025292620341476283, "phrase": "standard_decisional_bilinear_diffie-hellman_assumption"}, {"score": 0.0022495644368875686, "phrase": "ma-abe_schemes"}, {"score": 0.0021049977753042253, "phrase": "proactive_large_universe_ma-abe_scheme"}], "paper_keywords": ["Threshold multi authority ABE", " Without a central authority"], "paper_abstract": "An attribute based encryption scheme (ABE) is a cryptographic primitive in which every user is identified by a set of attributes, and some function of these attributes is used to determine the ability to decrypt each ciphertext. Chase proposed the first multi authority ABE scheme which requires a fully trusted central authority who has the ability to decrypt each ciphertext in the system. This central authority would endanger the whole system if it is corrupted. This paper provides a threshold multi authority fuzzy identity based encryption (MA-FIBE) scheme without a central authority for the first time. An encrypter can encrypt a message such that a user could only decrypt if he has at least d(k) of the given attributes about the message for at least t + 1, t <= n/2 honest authorities of all the n attribute authorities in the proposed scheme. This paper considers a stronger adversary model in the sense that the corrupted authorities are allowed to distribute incorrect secret keys to the users. The security proof is based on the secrecy of the underlying distributed key generation protocol and joint zero secret sharing protocol and the standard decisional bilinear Diffie-Hellman assumption. The proposed MA-FIBE could be extended to the threshold multi authority attribute based encryption (MA-ABE) scheme, and both key policy based and ciphertext policy based MA-ABE schemes without a central authority are presented in this paper. Moreover, several other extensions, such as a proactive large universe MA-ABE scheme, are also provided in this paper. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Secure threshold multi authority attribute based encryption without a central authority", "paper_id": "WOS:000277850100010"}