{"auto_keywords": [{"score": 0.04924496525218248, "phrase": "viterbi_algorithm"}, {"score": 0.03550532871137409, "phrase": "conventional_qrm-mld"}, {"score": 0.00481495049065317, "phrase": "trellis-structure"}, {"score": 0.004648609688625397, "phrase": "maximum_likelihood_detection"}, {"score": 0.004594443767709888, "phrase": "qr_decomposition"}, {"score": 0.003968112038249246, "phrase": "optimum_maximum_likelihood"}, {"score": 0.003742084495435749, "phrase": "reduced_complexity"}, {"score": 0.0034268702387746106, "phrase": "decoding_structure"}, {"score": 0.0031381421399207464, "phrase": "vlsi"}, {"score": 0.0027905114793984084, "phrase": "high_operational_parallelism"}, {"score": 0.0025254115243261875, "phrase": "vlsi_implementation"}, {"score": 0.0021677478798910565, "phrase": "qrm-mld"}, {"score": 0.002129877319760485, "phrase": "performance_degradation"}], "paper_keywords": ["Maximum likelihood detection (MLD)", " maximum likelihood detection with QR decomposition and M-algorithm (QRM-MLD)", " multiple input multiple output (MIMO)", " QR decomposition", " very large scale integration (VLSI)"], "paper_abstract": "The maximum likelihood detection with QR decomposition and M-algorithm (QRM-MLD) has been presented as a suboptimum multiple-input multiple-output (MIMO) detection scheme which can provide almost the same performance as the optimum maximum likelihood (ML) MIMO detection scheme but with the reduced complexity. However, due to the lack of parallelism and the regularity in the decoding structure, the conventional QRM-MLD which uses the tree-structure still has very high complexity for the very large scale integration (VLSI) implementation. In this paper, we modify the tree-structure of conventional QRM-MLD into trellis-structure in order to obtain high operational parallelism and regularity and then apply the Viterbi algorithm to the QRM-MLD to ease the burden of the VLSI implementation. We show from our selected numerical examples that, by using the QRM-MLD with our proposed trellis-structure, we can reduce the complexity significantly compared to the tree-structure based QRM-MLD while the performance degradation of our proposed scheme is negligible.", "paper_title": "Implementation-Friendly QRM-MLD Using Trellis-Structure Based on Viterbi Algorithm", "paper_id": "WOS:000264268200003"}