{"auto_keywords": [{"score": 0.033864574295411655, "phrase": "proposed_simulation_framework"}, {"score": 0.015719716506582538, "phrase": "process_planning"}, {"score": 0.015507073226038715, "phrase": "offshore_structures"}, {"score": 0.009947028407941712, "phrase": "basic_simulation_component"}, {"score": 0.009879132202388325, "phrase": "application-specific_simulation_component"}, {"score": 0.0044483793824152944, "phrase": "shipbuilding_industry"}, {"score": 0.004268293864953256, "phrase": "house_simulation_systems"}, {"score": 0.004224418476742716, "phrase": "commercial_systems"}, {"score": 0.004166804312732136, "phrase": "quest"}, {"score": 0.004138010495069077, "phrase": "dassault_system"}, {"score": 0.003731673223879279, "phrase": "new_in-house_simulation_system"}, {"score": 0.0036052633308076933, "phrase": "previously_developed_systems"}, {"score": 0.003296212583539166, "phrase": "integrated_simulation_framework"}, {"score": 0.0031193028729331667, "phrase": "shipbuilding_process_planning"}, {"score": 0.0030554300179552415, "phrase": "simulation_kernel"}, {"score": 0.00294169782786913, "phrase": "devs"}, {"score": 0.0028616434595236675, "phrase": "dtss"}, {"score": 0.00271735110571002, "phrase": "commonly_used_simulation_models"}, {"score": 0.0026161698049580804, "phrase": "simulation_system"}, {"score": 0.002518746501941657, "phrase": "collision_detection"}, {"score": 0.0025014259919355453, "phrase": "realistic_three-dimensional_visualization"}, {"score": 0.0023834640793589435, "phrase": "block_erection_process"}, {"score": 0.0022399174232611853, "phrase": "existing_studies"}, {"score": 0.0022168460543913787, "phrase": "commercial_simulation_systems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Modeling", " Simulation", " Simulation framework", " Process planning", " Shipbuilding", " Block erection"], "paper_abstract": "Recently, requests for accurate process planning using simulation have been increasing in many engineering fields, including the shipbuilding industry. To date, designers of shipyards have developed in-house simulation systems or used commercial systems such as the QUEST by Dassault system when requests for the simulation of process planning have occurred. However, these methods have some limitations. First, it requires a lot of time to develop a new in-house simulation system. In addition, it is hard to reuse previously developed systems when developing a new one and it is also hard for these to satisfy the various needs of shipyards effectively. To solve these limitations, an integrated simulation framework is proposed in this study. The proposed simulation framework provides an environment for developing various simulation systems for shipbuilding process planning. It consists of a simulation kernel, basic simulation component and application-specific simulation component. The simulation kernel manages both DEVS (discrete event system specification) and DTSS (discrete time system specification) to deal with various simulation requests. The basic simulation component provides commonly used simulation models and modeling strategies, which are used to make a simulation system more efficient. The application-specific simulation component implements the dynamics analysis, collision detection and realistic three-dimensional visualization. To evaluate its efficiency and applicability, the proposed simulation framework is applied to the block erection process of ships and offshore structures. The results show that the proposed simulation framework, as compared with those of existing studies and of commercial simulation systems, can provide a consistent, integrated development environment for a simulation system. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Integrated simulation framework for the process planning of ships and offshore structures", "paper_id": "WOS:000279307600004"}