{"auto_keywords": [{"score": 0.03859868948574288, "phrase": "cpda_detector"}, {"score": 0.00481495049065317, "phrase": "corner_detection"}, {"score": 0.004722613498487908, "phrase": "essential_operation"}, {"score": 0.004543193737836748, "phrase": "contour-based_corner_detectors"}, {"score": 0.004044645056447888, "phrase": "robust_corners"}, {"score": 0.003967021436047945, "phrase": "lowest_localization_error"}, {"score": 0.0035087260813209593, "phrase": "true_corners"}, {"score": 0.0033971539563683174, "phrase": "multiple_corners"}, {"score": 0.002380381895973937, "phrase": "distance_calculation"}, {"score": 0.0022749751129305606, "phrase": "cpda"}, {"score": 0.0022457226013538343, "phrase": "nine_other_existing_corner_detectors"}, {"score": 0.0021049977753042253, "phrase": "relatively_low_or_comparable_localization_error"}], "paper_keywords": ["Corner detector", " Contour", " Curvature"], "paper_abstract": "Corner detection is an essential operation in many computer vision applications. Among the contour-based corner detectors in the literature, the Chord-to-Point Distance Accumulation (CPDA) detector is reported to have one of the highest repeatability in detecting robust corners and the lowest localization error. However, based on our analysis, we found that the CPDA detector often fails to accurately detect the true corners when a curve has multiple corners but the sharpness of one or a few of them is much more prominent than the rest. This detector also might not perform well when the corners are closely located. Furthermore, the CPDA detector is also computationally very expensive. To overcome these weaknesses, we propose two effective and efficient corner detectors using simple triangular theory and distance calculation. Our experimental results show that our proposed detectors outperform CPDA and nine other existing corner detectors in terms of repeatability. Our proposed detectors also have a relatively low or comparable localization error and are computationally more efficient. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Effective and efficient contour-based corner detectors", "paper_id": "WOS:000352333300006"}