{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "direction_framework"}, {"score": 0.042778994744534476, "phrase": "ree_problems"}, {"score": 0.01277231638568098, "phrase": "malaysia"}, {"score": 0.01261703346020136, "phrase": "pakistan"}, {"score": 0.00471700544744796, "phrase": "requirements_engineering_education._requirements"}, {"score": 0.004545675105321216, "phrase": "software_development"}, {"score": 0.003808845109556467, "phrase": "investigation_study"}, {"score": 0.003700709435644458, "phrase": "appropriate_pedagogical_approaches"}, {"score": 0.0034935290662899488, "phrase": "strategic_recommendations"}, {"score": 0.0033115124244647736, "phrase": "effectual_re_course_execution"}, {"score": 0.0032174507570710835, "phrase": "undergraduate_software_engineering_students"}, {"score": 0.002762774046280398, "phrase": "important_course"}, {"score": 0.0025972447844047515, "phrase": "future_ree_research"}, {"score": 0.002333421318779658, "phrase": "integrated_view"}, {"score": 0.002276439636865258, "phrase": "ree_pedagogical_approaches"}], "paper_keywords": ["Requirements Engineering", " Requirements Engineering education", " Integrated View"], "paper_abstract": "Requirements Engineering (RE) is the most difficult stage of software development for students to learn and for lecturers to teach. Requirements Engineering Education (REE) problems are reported in several studies. The aim of this paper is to verify that REE problems presented in the literature really exist in practice especially in Malaysia and in Pakistan through an investigation study, and to provide suggestions on appropriate pedagogical approaches to be used in RE courses. Furthermore, we provided a list of strategic recommendations for RE course implementation and offered a direction framework that can assist in planning for effectual RE course execution. An investigation was performed on undergraduate software engineering students from the universities of Malaysia and Pakistan using a questionnaire. Results showed that many problems reported by students are quite similar to those presented by researchers in the literature. The students perceive RE as an important course and the problems reported by students that are less investigated must be explored in future REE research, and their interest in RE needs to be developed so that they become motivated to choose this as a profession. The REE problems presented in integrated view are then mapped with the REE pedagogical approaches suggested by researchers. Finally, the paper closes with a direction framework that can help to effectively deliver RE course and address REE problems.", "paper_title": "A DIRECTION FRAMEWORK TO ADDRESS PROBLEMS IN REQUIREMENTS ENGINEERING EDUCATION", "paper_id": "WOS:000329169000004"}