{"auto_keywords": [{"score": 0.04876550172705975, "phrase": "supply_chain"}, {"score": 0.00481495049065317, "phrase": "supply_chain_product_visibility"}, {"score": 0.004592540351971182, "phrase": "product's_lifecycle"}, {"score": 0.004441731079213471, "phrase": "end_customer"}, {"score": 0.004236487143672267, "phrase": "life_activities"}, {"score": 0.004085932261574055, "phrase": "product's_materials"}, {"score": 0.0034572649187813655, "phrase": "customer_experience"}, {"score": 0.0032067651867042466, "phrase": "forward_direction"}, {"score": 0.0031536033289228252, "phrase": "end_user"}, {"score": 0.0030584113653132168, "phrase": "product's_path"}, {"score": 0.002957829935033334, "phrase": "recent_times"}, {"score": 0.002900687590961084, "phrase": "academic_and_commercial_interest"}, {"score": 0.0028209599545587745, "phrase": "numerous_architectures"}, {"score": 0.0027741761880779535, "phrase": "product_visibility"}, {"score": 0.0026384167183586015, "phrase": "extensive_content_analysis"}, {"score": 0.0026237474270482345, "phrase": "academic_and_trade_literature"}, {"score": 0.002453934333239467, "phrase": "design_choices"}, {"score": 0.002413222714874815, "phrase": "current_and_potential_future_impacts"}, {"score": 0.0023798115577749225, "phrase": "recent_developments"}, {"score": 0.0022950865214535843, "phrase": "user_requirements"}, {"score": 0.0022133711375320244, "phrase": "future_research_directions"}, {"score": 0.0022010598350982458, "phrase": "end-to-end_visibility"}, {"score": 0.002158505888557746, "phrase": "supply_chains"}, {"score": 0.002146499103321978, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["RFID", " Tracking and tracing", " Sensor networks", " Architecture design"], "paper_abstract": "Supply chain product visibility may be defined to mean the capacity of the supply chain to have a view of a product's lifecycle, from its conception, manufacturing, distribution, delivery to the end customer, customer's experience of the product, and the product's end-of-life activities and processes. This implies developing and keeping a record of the product's materials and components, its physical state throughout the supply chain, the product's forward movement to the user-customer, customer's experience of the product, and the reverse logistics and reuse or termination of the product. The aim of visibility is to foster planning, control and agility of operations associated with the product and to improve customer experience of the product. \"Tracking\" is the term often used to describe the determination of the identity and state of a product in the forward direction (from manufacturing to the end user), while \"tracing\" is used to infer the product's path and history from downstream to upstream of the supply chain. In recent times there has been an upsurge of academic and commercial interest in product visibility. This interest has translated into numerous architectures, technologies and software for product visibility, both at the atomic (item) and composite (or aggregate) levels. Based on an extensive content analysis of academic and trade literature, including websites and documents of vendors and users of the technologies, this paper captures, analyses, compares and contrasts the design choices, essence, results and current and potential future impacts of some of the recent developments. The study also used survey by questionnaire across industries to assess user requirements of tracking and tracing systems and structures. The paper also charts future research directions for end-to-end visibility of product classes and their instances in supply chains. Crown Copyright (C) 2013 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Supply chain product visibility: Methods, systems and impacts", "paper_id": "WOS:000326214800016"}