{"auto_keywords": [{"score": 0.04142272022039974, "phrase": "rna-seq"}, {"score": 0.00481495049065317, "phrase": "benchmark_analysis"}, {"score": 0.004537401559396022, "phrase": "rna-seq_data"}, {"score": 0.004339744430169516, "phrase": "rna_sequencing"}, {"score": 0.004089475312474684, "phrase": "widespread_popularity"}, {"score": 0.0040491842732233154, "phrase": "highly_parallel_gene_expression_analysis"}, {"score": 0.0037967593942595233, "phrase": "accurate_identification"}, {"score": 0.0037222908218253054, "phrase": "full-length_splice_forms"}, {"score": 0.0036312482387007815, "phrase": "informatics_packages"}, {"score": 0.0027787638791664663, "phrase": "independent_and_unbiased_benchmarking_studies"}, {"score": 0.002467038647952607, "phrase": "idealized_data"}, {"score": 0.0023130151703068444, "phrase": "intron_signal"}, {"score": 0.0022901862321082407, "phrase": "sequencing_errors"}, {"score": 0.0022675820982741347, "phrase": "alignment_errors"}, {"score": 0.0022452005651385095, "phrase": "annotation_errors"}, {"score": 0.0021259846592569386, "phrase": "pressing_need"}], "paper_keywords": [""], "paper_abstract": "Motivation: Because of the advantages of RNA sequencing (RNA-Seq) over microarrays, it is gaining widespread popularity for highly parallel gene expression analysis. For example, RNA-Seq is expected to be able to provide accurate identification and quantification of full-length splice forms. A number of informatics packages have been developed for this purpose, but short reads make it a difficult problem in principle. Sequencing error and polymorphisms add further complications. It has become necessary to perform studies to determine which algorithms perform best and which if any algorithms perform adequately. However, there is a dearth of independent and unbiased benchmarking studies. Here we take an approach using both simulated and experimental benchmark data to evaluate their accuracy. Results: We conclude that most methods are inaccurate even using idealized data, and that no method is highly accurate once multiple splice forms, polymorphisms, intron signal, sequencing errors, alignment errors, annotation errors and other complicating factors are present. These results point to the pressing need for further algorithm development.", "paper_title": "Benchmark analysis of algorithms for determining and quantifying full-length mRNA splice forms from RNA-seq data", "paper_id": "WOS:000366630400008"}