{"auto_keywords": [{"score": 0.036577753058251616, "phrase": "gsrh"}, {"score": 0.013666694518743285, "phrase": "gulf_war_illness"}, {"score": 0.010321943085066926, "phrase": "physical_function"}, {"score": 0.004754828422696271, "phrase": "gulf_war_veterans"}, {"score": 0.004680725471654037, "phrase": "randomized_double-blind_study"}, {"score": 0.004493393608763752, "phrase": "chronic_multisymptom_problems"}, {"score": 0.004246272886768394, "phrase": "kansas"}, {"score": 0.004219663341808313, "phrase": "centers_for_disease_control"}, {"score": 0.003791901285142797, "phrase": "general_self-rated_health"}, {"score": 0.00366297866938793, "phrase": "randomization_arms"}, {"score": 0.003571968614903263, "phrase": "gsrh_change"}, {"score": 0.003549570370358334, "phrase": "compelling_adjustment"}, {"score": 0.0034941851527001146, "phrase": "prompting_sex-stratified_analysis"}, {"score": 0.00343966114729942, "phrase": "significant_benefit"}, {"score": 0.0034073545850838, "phrase": "combined-sex_sample"}, {"score": 0.003090882675316039, "phrase": "sps"}, {"score": 0.002865886996201355, "phrase": "sps_improvement"}, {"score": 0.0027596607038845923, "phrase": "enrolled_veterans"}, {"score": 0.0026241089938360634, "phrase": "sleep_problems"}, {"score": 0.002456224752333807, "phrase": "small_sample"}, {"score": 0.002440805709023898, "phrase": "large_effect_sizes"}, {"score": 0.002410256695500994, "phrase": "apparent_relation"}, {"score": 0.0023951255255435272, "phrase": "key_outcomes"}, {"score": 0.0022068324655021396, "phrase": "larger_sample"}, {"score": 0.0021049977753042253, "phrase": "larger_trial"}], "paper_keywords": [""], "paper_abstract": "We sought to assess whether coenzyme Q10 (CoQ10) benefits the chronic multisymptom problems that affect one-quarter to one-third of 1990-1 Gulf War veterans, using a randomized, double-blind, placebo-controlled study. Participants were 46 veterans meeting Kansas and Centers for Disease Control criteria for Gulf War illness. Intervention was Pharmallord (Denmark) C0Q10 100 mg per day (Q100), 300 mg per day (Q300), or an identical-appearing placebo for 3.5 +/- 0.5 months. General self-rated health (GSRH), the primary outcome, differed across randomization arms at baseline, and sex significantly predicted GSRH change, compelling adjustment for baseline GSRH and prompting sex-stratified analysis. GSRH showed no significant benefit in the combined-sex sample. Among males (85% of participants), Q100 significantly benefited GSRH versus placebo and versus Q300, providing emphasis on Q100. Physical function (summary performance score, SPS) improved on Q100 versus placebo. A rise in CoQ10 approached significance as a predictor of improvement in GSRH and significantly predicted SPS improvement. Among 20 symptoms each present in half or more of the enrolled veterans, direction-of-difference on Q100 versus placebo was favorable for all except sleep problems; sign test 19:1, p = 0.00004) with several symptoms individually significant. Significance for these symptoms despite the small sample underscores large effect sizes, and an apparent relation of key outcomes to CoQ10 change increases prospects for causality. In conclusion, Q100 conferred benefit to physical function and symptoms in veterans with Gulf War illness. Examination in a larger sample is warranted, and findings from this study can inform the conduct of a larger trial.", "paper_title": "Coenzyme Q10 Benefits Symptoms in Gulf War Veterans: Results of a Randomized Double-Blind Study", "paper_id": "WOS:000343186700010"}