{"auto_keywords": [{"score": 0.046699359449376907, "phrase": "web_applications"}, {"score": 0.04595091693053787, "phrase": "penetration_testing"}, {"score": 0.04353775624016997, "phrase": "target_web_application"}, {"score": 0.03428743447194553, "phrase": "web_application"}, {"score": 0.027244860483140693, "phrase": "proposed_approach"}, {"score": 0.00481495049065317, "phrase": "static_and_dynamic_analysis"}, {"score": 0.003932654396285872, "phrase": "automated_techniques"}, {"score": 0.0038668462001710314, "phrase": "input_vector_information"}, {"score": 0.003717528595128948, "phrase": "application's_responses"}, {"score": 0.003070086433952691, "phrase": "new_approach"}, {"score": 0.00293487292076612, "phrase": "current_techniques"}, {"score": 0.002805597755796506, "phrase": "input_vector_identification"}, {"score": 0.0024370965602952496, "phrase": "known_and_unknown_vulnerabilities"}, {"score": 0.0023962545023307937, "phrase": "evaluation_results"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["penetration testing", " web applications", " test input generation"], "paper_abstract": "Penetration testing is widely used to help ensure the security of web applications. Using penetration testing, testers discover vulnerabilities by simulating attacks on a target web application. To do this efficiently, testers rely on automated techniques that gather input vector information about the target web application and analyze the application's responses to determine whether an attack was successful. Techniques for performing these steps are often incomplete, which can leave parts of the web application untested and vulnerabilities undiscovered. This paper proposes a new approach to penetration testing that addresses the limitations of current techniques. The approach incorporates two recently developed analysis techniques to improve input vector identification and detect when attacks have been successful against a web application. This paper compares the proposed approach against two popular penetration testing tools for a suite of web applications with known and unknown vulnerabilities. The evaluation results show that the proposed approach performs a more thorough penetration testing and leads to the discovery of more vulnerabilities than both the tools. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Improving penetration testing through static and dynamic analysis", "paper_id": "WOS:000294381000003"}