{"auto_keywords": [{"score": 0.04789176190830039, "phrase": "qm"}, {"score": 0.017309589153680912, "phrase": "general_managers"}, {"score": 0.006645283946159105, "phrase": "quality_managers"}, {"score": 0.006302222918482321, "phrase": "quality_manager"}, {"score": 0.00600217582508324, "phrase": "financial_results"}, {"score": 0.00481495049065317, "phrase": "quality_leadership"}, {"score": 0.00461469935280547, "phrase": "quality_management"}, {"score": 0.004302250116053874, "phrase": "multigroup_analysis"}, {"score": 0.004284005760581134, "phrase": "lisrel"}, {"score": 0.0039516363164961085, "phrase": "general_manager"}, {"score": 0.0036064134042302076, "phrase": "quality_directors"}, {"score": 0.0033835216367399563, "phrase": "qm_systems"}, {"score": 0.003362001992204203, "phrase": "first_step"}, {"score": 0.0033193710712981802, "phrase": "study_sample"}, {"score": 0.003154168076675274, "phrase": "additional_explanatory_variables"}, {"score": 0.0031075463518466548, "phrase": "functional_experience"}, {"score": 0.003068132051252538, "phrase": "strategic_focus"}, {"score": 0.0029844357985391204, "phrase": "general_manager's_commitment"}, {"score": 0.002959143994491578, "phrase": "greater_credibility"}, {"score": 0.0028845436549813134, "phrase": "greater_implementation"}, {"score": 0.0027702431694913146, "phrase": "strategic_priorities"}, {"score": 0.0025387522322442954, "phrase": "positive_effect"}, {"score": 0.002506534044488778, "phrase": "indisputable_consensus"}, {"score": 0.002453740863994528, "phrase": "top_management"}, {"score": 0.0023816887629315897, "phrase": "specific_knowledge"}, {"score": 0.002150303787972576, "phrase": "manager's_strategic_priorities_condition"}, {"score": 0.002132065775858398, "phrase": "qm_implementation"}, {"score": 0.0021049977753042253, "phrase": "financial_performance"}], "paper_keywords": ["Quality management", " Management commitment", " Leadership", " Strategic orientation", " Financial performance"], "paper_abstract": "Purpose - The purpose of this paper is to clarify whether there are differences in the implementation of quality management (QM) and the results achieved, based on the position of the person responsible for QM and his/her strategic priorities. Design/methodology/approach - Data from 256 firms that have implemented QM are collected. A multigroup analysis with LISREL is employed to contrast the hypotheses using a sample of general managers on the one hand and of quality managers on the other. Findings - This study shows that QM is stronger implemented when it is headed by the general manager than by the quality manager. The authors also find that in both samples of general managers and quality managers, only one of the three strategic priorities analyzed, cost orientation, shows a positive effect on financial results. When the influence of QM on financial results is considered, the relationship is significant just in the case of the sample of quality directors. Research limitations/implications - The limitations of the analysis performed suggest lines of research that can substantially enrich the analysis of the role of management in the implementation of QM systems. A first step would be to expand the study sample, since the subsample for general managers was not very large. Gathering more recent data could contribute to strengthening the results obtained and to identifying additional explanatory variables. For example, information on functional experience or training could clarify the strategic focus adopted by managers. Practical implications - This study highlights that the general manager's commitment to quality confers greater credibility in the rest of the organization. Although the general managers impose greater implementation of QM, they do not perceive that this influences the financial results achieved directly. The incorporation of strategic priorities in this study also shows that the perception of differentiation in marketing in firms that have implemented QM is similar both for quality managers and for general managers. However, the former (quality managers) also show that differentiation in innovation has a positive effect on QM. Originality/value - Literature has shown an indisputable consensus on the relevance of leadership and the commitment of top management to the success of QM, but few studies provide more in-depth specific knowledge of the characteristics and actions developed by the person who leads the commitment to quality. This study tackles the role of the manager responsible for QM in the firm, based on his or her functional position, whether general manager or quality manager. It contributes by investigating how a manager's strategic priorities condition the level of QM implementation, as well as the financial performance achieved.", "paper_title": "Quality management, strategic priorities and performance: the role of quality leadership", "paper_id": "WOS:000296823100002"}