{"auto_keywords": [{"score": 0.04866188206860211, "phrase": "turing"}, {"score": 0.00481495049065317, "phrase": "spoken_dialog_systems"}, {"score": 0.004743164872278112, "phrase": "holy_grail"}, {"score": 0.004707672504464783, "phrase": "computer_science"}, {"score": 0.00450020161335541, "phrase": "science_fiction"}, {"score": 0.004253618550301311, "phrase": "interactive_voice_response"}, {"score": 0.004112175423546628, "phrase": "voice_command_systems"}, {"score": 0.004020492138367616, "phrase": "furby_toy"}, {"score": 0.0032817813775647756, "phrase": "machine_learning"}, {"score": 0.003220643255032943, "phrase": "statistical_modeling"}, {"score": 0.0030097975788892896, "phrase": "human_action"}, {"score": 0.0028021527740710508, "phrase": "language_production_process"}, {"score": 0.0027706987570488084, "phrase": "sera_project"}, {"score": 0.00266837303806956, "phrase": "language_use"}, {"score": 0.002493592357827492, "phrase": "engineering_challenge"}, {"score": 0.002365587018070219, "phrase": "narrative_approach"}, {"score": 0.0023390219342052623, "phrase": "vygotsky's_view"}, {"score": 0.002295406551990453, "phrase": "\"the_big_picture"}, {"score": 0.0021209097150420896, "phrase": "existing_scripting_environments"}, {"score": 0.0021049977753042253, "phrase": "conversational_agents"}], "paper_keywords": [""], "paper_abstract": "Spoken dialog systems have been a holy grail of computer science since Turing devised his test for intelligence, and an icon of science fiction from well before that. Although there are machines you can talk to - interactive voice response (IVR) systems which answer phones, voice command systems in cars, and the Furby toy come to mind - holding a conversation with a machine, spoken or typed, is still highly problematic. It seems there is something fundamental we don't understand about the way humans use language. One popular approach is to ignore our ignorance and assume that machines can figure it out for themselves using machine learning or some form of statistical modeling of a corpus of text. Corpus analysis, however, like archeology, attempts to understand human action by looking at what we leave behind. Instead we take a software agents approach and model the language production process. The SERA project is our latest effort looking at what other disciplines can tell us about language use in context. We find that, naturally, published work focuses on the interesting while the engineering challenge is to capture the essential but often mundane. This paper proposes a narrative approach based on Vygotsky's view of psychology that captures \"the big picture\". The paper finishes with an outline for a tool that merges the functionality of more conventional annotation tools with that of existing scripting environments for conversational agents.", "paper_title": "FROM DATA TO DESIGN", "paper_id": "WOS:000292640300005"}