{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "collaborative_learning"}, {"score": 0.015584374765208468, "phrase": "social_network_sites"}, {"score": 0.009545435272952898, "phrase": "comparative_study"}, {"score": 0.004529093447865156, "phrase": "widespread_use"}, {"score": 0.004278807087784626, "phrase": "unprecedented_levels"}, {"score": 0.004042295865725559, "phrase": "social_relations"}, {"score": 0.003903269701018361, "phrase": "new_uses"}, {"score": 0.0037198532511087566, "phrase": "new_medium"}, {"score": 0.0035605741849764187, "phrase": "new_instruments"}, {"score": 0.0034835017385881385, "phrase": "fundamental_role"}, {"score": 0.003219553875143356, "phrase": "document_sharing_systems"}, {"score": 0.003191485583025302, "phrase": "classical_snss"}, {"score": 0.003149906614156819, "phrase": "facebook"}, {"score": 0.0030281251520610604, "phrase": "educational_snss"}, {"score": 0.0028857130140890787, "phrase": "different_snss"}, {"score": 0.0026321198895843173, "phrase": "learning_experience"}, {"score": 0.0025638362414466278, "phrase": "important_features"}, {"score": 0.0021049977753042253, "phrase": "social_sites"}], "paper_keywords": [""], "paper_abstract": "Over the past years, the Internet witnessed the widespread use of social network sites (SNSs) that saw their number of subscribers soar to unprecedented levels. Yet, until recently, such sites remained primarily focused on maintaining social relations. As such sites became more mainstream, new uses transpired. In education, SNSs are seen as a new medium for helping students collaborate. They are regarded as new instruments that should play a fundamental role in fostering learning. Lately, many SNSs claim that they support collaborative learning, and they varied from document sharing systems to classical SNSs such as Facebook. These systems are pioneering the evolution towards educational SNSs (ESNSs). This paper presents a comparative study between different SNSs and ESNSs that support learning. We identify the criteria that an E/SNS must implement to positively contribute to the learning experience of students and outline the important features that should be considered when designing such systems to promote collaboration. We also present ELSE, our developed educational SNS designed based on the findings of the comparative study, as well as the result of our field study that was conducted to show the impact of implementing such features in social sites for collaborative learning.", "paper_title": "Analysis of collaborative learning in social network sites used in education", "paper_id": "WOS:000366196300040"}