{"auto_keywords": [{"score": 0.040108824253493075, "phrase": "output_transient"}, {"score": 0.00481495049065317, "phrase": "transient_extensions"}, {"score": 0.004762202897268383, "phrase": "boolean_functions._transient_algebra"}, {"score": 0.004684157900507474, "phrase": "multi-valued_algebra"}, {"score": 0.004556901872357751, "phrase": "gate_circuits"}, {"score": 0.004195418010131832, "phrase": "signal_values"}, {"score": 0.003992385826251404, "phrase": "boolean_functions"}, {"score": 0.0036958398682001015, "phrase": "input_transients"}, {"score": 0.0032916702592724217, "phrase": "even_the_problem"}, {"score": 0.0030482550776074046, "phrase": "np"}, {"score": 0.002851790448644913, "phrase": "general_boolean_functions"}], "paper_keywords": ["Algebra", " Boolean function", " circuit", " complexity", " evaluation", " gate", " hazard", " multi-valued", " transient", " transient extension"], "paper_abstract": "Transient algebra is a multi-valued algebra for hazard detection in gate circuits. Sequences of alternating 0's and 1's, called transients, represent signal values, and gates are modeled by extensions of boolean functions to transients. Formulas for computing the output transient of a gate from the input transients are known for NOT, AND, OR and XOR gates and their complements, but, in general, even the problem of deciding whether the length of the output transient exceeds a given bound is NP-complete. We propose a method of evaluating extensions of general boolean functions. We study a class of functions for which, instead of evaluating the extensions on a given set of transients, it is possible to get the same values by using transients derived from the given ones, but having length at most 3. We prove that all functions of three variables, as well as certain other functions, have this property, and can be efficiently evaluated.", "paper_title": "ON THE COMPLEXITY OF THE EVALUATION OF TRANSIENT EXTENSIONS OF BOOLEAN FUNCTIONS", "paper_id": "WOS:000300443600003"}