{"auto_keywords": [{"score": 0.031187520876840926, "phrase": "ordinal_relationships"}, {"score": 0.015719716506582538, "phrase": "customer_preferences"}, {"score": 0.015473436227329574, "phrase": "navigation_behavior"}, {"score": 0.009099312787110053, "phrase": "multiple_aspects"}, {"score": 0.004626553103375699, "phrase": "multicriteria_decision_approach_with_implicit_feedback"}, {"score": 0.004517055580214742, "phrase": "customer_loyalty"}, {"score": 0.004481132747216135, "phrase": "electronic_commerce"}, {"score": 0.004392565073466714, "phrase": "one-to-one_marketing"}, {"score": 0.004357627943575288, "phrase": "personalized_services"}, {"score": 0.0041703614123283165, "phrase": "individual_customer_preferences"}, {"score": 0.0036553070575015344, "phrase": "customer's_real-time_web_usage_behavior"}, {"score": 0.0035403060198952244, "phrase": "basket_placement"}, {"score": 0.0030171910207671205, "phrase": "web_usage_behavior"}, {"score": 0.002581477142020187, "phrase": "multiple-criteria_decision-making_approach"}, {"score": 0.0024214281919523973, "phrase": "multiple_criteria"}, {"score": 0.0023925401023682717, "phrase": "multidimensional_preference_space"}, {"score": 0.0022987068521717765, "phrase": "derived_weights"}, {"score": 0.0021134385064731937, "phrase": "time_pressure"}], "paper_keywords": ["Electronic commerce", " fuzzy linguistic quantifier", " implicit feedback", " multicriteria decision making (MCDM)", " personalized recommendations"], "paper_abstract": "The goal of raising customer loyalty in electronic commerce requires an emphasis on one-to-one marketing and personalized services. To this end, it is essential to understand individual customer preferences for products. In this paper, we present a method for identifying customer preferences and recommending the most appropriate product. The identification and recommendation of such products are all based on the use of customer's real-time web usage behavior, including activities such as viewing, basket placement, and purchasing of products. Therefore, in this approach, we do not force a customer to explicitly express his or her preference information for particular products but rather capture his or her preferences from data that result from such activities. Information on the web usage behavior for the products determines the ordinal relationships among the products, which express that certain product is preferred to other products across the multiple aspects. The ordinal relationships among the products and the multiple aspects of products lead to the consideration of a multiple-criteria decision-making approach. Thus, the problem eventually results in the identification of weights attached to the multiple criteria in the multidimensional preference space constructed by the ordinal relationships among the products. The derived weights are then used for the prioritization of products that are not included in the navigation behavior due to factors such as time pressure, cognitive burden, and the like.", "paper_title": "Eliciting Customer Preferences for Products From Navigation Behavior on the Web: A Multicriteria Decision Approach With Implicit Feedback", "paper_id": "WOS:000267434100015"}