{"auto_keywords": [{"score": 0.045939026495003775, "phrase": "grid"}, {"score": 0.009250960466679673, "phrase": "gridiff"}, {"score": 0.008893174119312858, "phrase": "qos"}, {"score": 0.00481495049065317, "phrase": "monitoring_and_differentiation_techniques"}, {"score": 0.004336556638639097, "phrase": "recurrent_topic"}, {"score": 0.004063741692442559, "phrase": "specific_application_needs"}, {"score": 0.003726398477619122, "phrase": "grid_services"}, {"score": 0.0036072171658966348, "phrase": "best-effort_service"}, {"score": 0.0035426543993952184, "phrase": "quality_of_service"}, {"score": 0.003367939885018247, "phrase": "execution_time"}, {"score": 0.0032601856292942106, "phrase": "qualitative_attributes"}, {"score": 0.0030328769643087066, "phrase": "final_performance"}, {"score": 0.00296781730323553, "phrase": "user_satisfaction"}, {"score": 0.0029041492019217033, "phrase": "grid_infrastructures"}, {"score": 0.0027409477035216195, "phrase": "necessary_steps"}, {"score": 0.002354762471810519, "phrase": "failure_rates"}, {"score": 0.002271322203626574, "phrase": "scalability"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Grid computing", " Quality of service", " Resource allocation", " Service differentiation", " Monitoring"], "paper_abstract": "The study of meta-scheduling of jobs in the Grid has been a recurrent topic on the literature. Many tools have been developed for allocating the jobs to the most appropriate resources according to specific application needs while balancing the workload among resources. However, few of them focus on evaluating the level of service attained by providers of Grid services. On the contrary, Grid generally offers best-effort service to all the applications. Without Quality of Service (QoS), the jobs are executed without any guarantee on the execution time or throughput. Also, the support for qualitative attributes, such as security, is limited to the information provided by the resources. The uncertainty on the final performance is an issue that affects user satisfaction, reducing the interest of Grid infrastructures. In this paper, we present GRIDIFF, a software architecture that covers all necessary steps to integrate QoS into the process of allocating resources for the execution of jobs in the Grid. GRIDIFF has been used in practice to differentiate the resources according to the fulfillment of the 100% of the QoS considering three groups with failure rates of 9.1%, 13.3% and 64.1%, respectively. Scalability has been evaluated through simulation in up to 7000 nodes that can handle up to 250 monitoring agents per node. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Service monitoring and differentiation techniques for resource allocation in the grid, on the basis of the level of service", "paper_id": "WOS:000294521200015"}