{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bresenham's_algorithm"}, {"score": 0.022980773789996002, "phrase": "voronoi_diagram"}, {"score": 0.008229639073535576, "phrase": "unit_interval"}, {"score": 0.006378429036631338, "phrase": "three-dimensional_extension"}, {"score": 0.005879683076261695, "phrase": "grid_points"}, {"score": 0.004610058444728656, "phrase": "two-dimensional_line_segment"}, {"score": 0.004413846562278824, "phrase": "mid-point_comparison"}, {"score": 0.0036288825833675127, "phrase": "nearest_neighbours"}, {"score": 0.003290237137651949, "phrase": "unit_square"}, {"score": 0.0028096544129939277, "phrase": "main_idea"}, {"score": 0.0027491084541806823, "phrase": "minimum_distance"}, {"score": 0.0023602032679095955, "phrase": "integer_arithmetic"}, {"score": 0.002210814150677161, "phrase": "computation_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Voronoi diagram", " Bresenham Algorithm", " Integer arithmetic", " Symmetry"], "paper_abstract": "Bresenham's Algorithm for plotting a two-dimensional line segment is elegant and efficient in its deployment of mid-point comparison and integer arithmetic. It is natural to investigate its three-dimensional extensions. In so doing, this paper uncovers the reason for little prior work. The concept of the mid-point in a unit interval generalizes to that of nearest neighbours involving a Voronoi diagram. Algorithmically, there are challenges. While a unit interval in two-dimension becomes a unit square in three-dimension, \"squaring\" the number of choices in Bresenham's Algorithm is shown to have difficulties. In this paper, the three-dimensional extension is based on the main idea of Bresenham's Algorithm of minimum distance between the line and the grid points. The structure of the Voronoi diagram is presented for grid points to which the line may be approximated. The deployment of integer arithmetic and symmetry for the three-dimensional extension of the algorithm to raise the computation efficiency are also investigated. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Three dimensional extension of Bresenham's Algorithm with Voronoi diagram", "paper_id": "WOS:000289017900008"}