{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "tri-subject_kinship"}, {"score": 0.004590820632326585, "phrase": "computer_vision"}, {"score": 0.004447201233380302, "phrase": "individual_objects"}, {"score": 0.003994714109598034, "phrase": "child-parents_relationship"}, {"score": 0.003947358102140903, "phrase": "core_role"}, {"score": 0.00385431710959668, "phrase": "understanding_such_kin_relationship"}, {"score": 0.0037935066882208235, "phrase": "fundamental_impact"}, {"score": 0.0037040785566765954, "phrase": "artificial_intelligent_agent"}, {"score": 0.0036456298076415652, "phrase": "human_world"}, {"score": 0.0032099453192629976, "phrase": "novel_relative_symmetric_bilinear_model"}, {"score": 0.002964415652865295, "phrase": "prior_knowledge"}, {"score": 0.0027485326424697095, "phrase": "feature_selection"}, {"score": 0.0026518169452004465, "phrase": "child-parents_pair"}, {"score": 0.0026099289298770023, "phrase": "local_spatial_information"}, {"score": 0.0022614266476954467, "phrase": "proposed_method"}, {"score": 0.0022168460543913787, "phrase": "art_methods"}, {"score": 0.0021049977753042253, "phrase": "one-versus-one_kinship_verification"}], "paper_keywords": ["Feature selection", " kinship verification", " tri-subject relationship"], "paper_abstract": "One major challenge in computer vision is to go beyond the modeling of individual objects and to investigate the bi-(one-versus-one) or tri-(one-versus-two) relationship among multiple visual entities, answering such questions as whether a child in a photo belongs to the given parents. The child-parents relationship plays a core role in a family, and understanding such kin relationship would have a fundamental impact on the behavior of an artificial intelligent agent working in the human world. In this work, we tackle the problem of one-versus-two (tri-subject) kinship verification and our contributions are threefold: 1) a novel relative symmetric bilinear model (RSBM) is introduced to model the similarity between the child and the parents, by incorporating the prior knowledge that a child may resemble one particular parent more than the other; 2) a spatially voted method for feature selection, which jointly selects the most discriminative features for the child-parents pair, while taking local spatial information into account; and 3) a large-scale tri-subject kinship database characterized by over 1,000 child-parents families. Extensive experiments on KinFaceW, Family101, and our newly released kinship database show that the proposed method outperforms several previous state of the art methods, while could also be used to significantly boost the performance of one-versus-one kinship verification when the information about both parents are available.", "paper_title": "Tri-Subject Kinship Verification: Understanding the Core of A Family", "paper_id": "WOS:000361685400014"}