{"auto_keywords": [{"score": 0.04810417603515557, "phrase": "data_gathering"}, {"score": 0.04550984591034793, "phrase": "wireless_devices"}, {"score": 0.04326745271244781, "phrase": "base_station"}, {"score": 0.00481495049065317, "phrase": "ad_hoc_networks"}, {"score": 0.004568108391981922, "phrase": "multi-hop_wireless_ad_hoc_networks"}, {"score": 0.0042212686864468805, "phrase": "report_messages"}, {"score": 0.003962779958955344, "phrase": "multi-hop_fashion"}, {"score": 0.0030935140058168885, "phrase": "well_studied_problem"}, {"score": 0.0028432828877281388, "phrase": "larger_load"}, {"score": 0.002813457986293993, "phrase": "forward_requests"}, {"score": 0.0024144659350277954, "phrase": "network_lifetime"}, {"score": 0.0023891283748647416, "phrase": "efficient_balancing"}, {"score": 0.0023516185395256505, "phrase": "consumed_transmission_energy"}, {"score": 0.002255359859478826, "phrase": "np"}, {"score": 0.0021049977753042253, "phrase": "extensive_simulations"}], "paper_keywords": ["Data gathering", " Optimization", " Network lifetime"], "paper_abstract": "This paper studies the problem of data gathering in multi-hop wireless ad hoc networks. In this scenario, a set of wireless devices constantly sample their surroundings and initiate report messages addressed to the base station. The messages are forwarded in a multi-hop fashion, where the wireless devices act both as senders and relays. We consider data gathering without aggregation, i.e. the nodes are required to forward all the messages initiated by other nodes (in addition to their own) to the base station. This is in contrast to the well studied problem of data gathering with aggregation, which is significantly simpler. As some nodes experience a larger load of forward requests, these nodes will have their battery charges depleted much faster than the other nodes-which can rapidly break the connectivity of the network. We focus on maximizing the network lifetime through efficient balancing of the consumed transmission energy. We show that the problem is NP-hard for two network types and develop various approximation schemes. Our results are validated through extensive simulations.", "paper_title": "Cooperative data collection in ad hoc networks", "paper_id": "WOS:000316010900002"}