{"auto_keywords": [{"score": 0.03267875483465419, "phrase": "membership_functions"}, {"score": 0.015587848514431341, "phrase": "multivariate_modeling"}, {"score": 0.00481495049065317, "phrase": "fuzzy_sets"}, {"score": 0.004673530058379246, "phrase": "space_x"}, {"score": 0.004459605573798577, "phrase": "multivariate_feature_space"}, {"score": 0.004255431326383001, "phrase": "fuzzy_allocation"}, {"score": 0.004219321533320583, "phrase": "feature_values"}, {"score": 0.0037928847801943404, "phrase": "class_definition"}, {"score": 0.0033804443117334535, "phrase": "classification_task"}, {"score": 0.0031440159350875057, "phrase": "feature_space"}, {"score": 0.0029998918671747168, "phrase": "new_perspective"}, {"score": 0.0029491456590011434, "phrase": "john"}, {"score": 0.002825949329865926, "phrase": "realizable_forms"}, {"score": 0.0027662954811372154, "phrase": "averaging_operators"}, {"score": 0.0023024551893939403, "phrase": "additional_tool"}, {"score": 0.0022731540640627307, "phrase": "standard_operations"}, {"score": 0.0021968238865548812, "phrase": "concept_fusion"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Type-2 fuzzy sets", " Fuzzy modeling", " Fuzzy subsethood", " Fuzzy centroid", " Representation theorem", " Computing with words"], "paper_abstract": "This paper explores the link between type-2 fuzzy sets and multivariate modeling. Elements of a space X are treated as observations fuzzily associated with values in a multivariate feature space. A category or class is likewise treated as a fuzzy allocation of feature values (possibly dependent on values in X). We observe that a type-2 fuzzy set on X generated by these two fuzzy allocations captures imprecision in the class definition and imprecision in the observations. In practice many type-2 fuzzy sets are in fact generated in this way and can therefore be interpreted as the output of a classification task. We then show that an arbitrary type-2 fuzzy set can be so constructed, by taking as a feature space a set of membership functions on X. This construction presents a new perspective on the Representation Theorem of Mendel and John. The multivariate modeling underpinning the type-2 fuzzy sets can also constrain realizable forms of membership functions. Because averaging operators such as centroid and subsethood on type-2 fuzzy sets involve a search for optima over membership functions, constraining this search can make computation easier and tighten the results. We demonstrate how the construction can be used to combine representations of concepts and how it therefore provides an additional tool, alongside standard operations such as intersection and subsethood, for concept fusion and computing with words. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Multivariate modeling and type-2 fuzzy sets", "paper_id": "WOS:000285131300005"}