{"auto_keywords": [{"score": 0.03532965543589866, "phrase": "tchebycheff_decomposition_approach"}, {"score": 0.015719716506582538, "phrase": "uniform_decomposition_measurement"}, {"score": 0.015611692820932528, "phrase": "many-objective_problems"}, {"score": 0.010309569901164961, "phrase": "modified_tchebycheff_decomposition_approach"}, {"score": 0.004553725265085244, "phrase": "classical_pareto-dominance"}, {"score": 0.003785115566529808, "phrase": "constructed_weight_vectors"}, {"score": 0.0037066895459425824, "phrase": "weight_vectors"}, {"score": 0.0036046342610557497, "phrase": "weight_space"}, {"score": 0.003456777366713296, "phrase": "optimal_solution"}, {"score": 0.00292339061443511, "phrase": "uniform_weight_vectors"}, {"score": 0.002832928222306059, "phrase": "great_merits"}, {"score": 0.002614228362365338, "phrase": "weight_vector"}, {"score": 0.002362320344521919, "phrase": "experimental_results"}, {"score": 0.002202847728425357, "phrase": "inverted_generational_distance_metrics"}, {"score": 0.002127186380459509, "phrase": "uniform_weight_vector_initializing_method"}, {"score": 0.0021049977753042253, "phrase": "modified_tchebycheff_decomposition"}], "paper_keywords": ["Many-objective optimization", " Evolutionary algorithm", " Decomposition", " Uniform design", " Uniform decomposition measurement"], "paper_abstract": "Many-objective problems (MAPs) have put forward a number of challenges to classical Pareto-dominance based multi-objective evolutionary algorithms (MOEAs) for the past few years. Recently, researchers have suggested that MOEA/D (multi-objective evolutionary algorithm based on decomposition) can work for MAPs. However, there exist two difficulties in applying MOEA/Dto solve MAPs directly. One is that the number of constructed weight vectors is not arbitrary and the weight vectors are mainly distributed on the boundary of weight space for MAPs. The other is that the relationship between the optimal solution of subproblem and its weight vector is nonlinear for the Tchebycheff decomposition approach used by MOEA/D. To deal with these two difficulties, we propose an improved MOEA/D with uniform decomposition measurement and the modified Tchebycheff decomposition approach (MOEA/D-UDM) in this paper. Firstly, a novel weight vectors initialization method based on the uniform decomposition measurement is introduced to obtain uniform weight vectors in any amount, which is one of great merits to use our proposed algorithm. The modified Tchebycheff decomposition approach, instead of the Tchebycheff decomposition approach, is used in MOEA/D-UDM to alleviate the inconsistency between the weight vector of subproblem and the direction of its optimal solution in the Tchebycheff decomposition approach. The proposed MOEA/D-UDM is compared with two state-of-the-art MOEAs, namely MOEA/D and UMOEA/D on a number of MAPs. Experimental results suggest that the proposed MOEA/D-UDM outperforms or performs similarly to the other compared algorithms in terms of hypervolume and inverted generational distance metrics on different types of problems. The effects of uniform weight vector initializing method and the modified Tchebycheff decomposition are also studied separately.", "paper_title": "MOEA/D with uniform decomposition measurement for many-objective problems", "paper_id": "WOS:000345097100016"}