{"auto_keywords": [{"score": 0.04901626150275962, "phrase": "multiple-view_visualisations"}, {"score": 0.044018256322395054, "phrase": "working_memory"}, {"score": 0.008649671303125918, "phrase": "sequential_view"}, {"score": 0.00481495049065317, "phrase": "cognitive_costs"}, {"score": 0.00450130420152996, "phrase": "different_perspectives"}, {"score": 0.004322967486451877, "phrase": "also_associated_cognitive_costs"}, {"score": 0.0038119123317396954, "phrase": "multiple_views"}, {"score": 0.003693846909452865, "phrase": "task_performance"}, {"score": 0.003611751858608048, "phrase": "visual_attention"}, {"score": 0.0034685354330506605, "phrase": "different_tasks"}, {"score": 0.002963390095037466, "phrase": "real-time_monitoring_task"}, {"score": 0.0028715299874549245, "phrase": "divided_attention_problem"}, {"score": 0.0027950561494657633, "phrase": "view_types"}, {"score": 0.0027575842698911173, "phrase": "design_issues"}, {"score": 0.002708399936381754, "phrase": "simultaneous_view"}, {"score": 0.0024311346712789553, "phrase": "different_object_sets"}, {"score": 0.002366361492754389, "phrase": "previous_work"}, {"score": 0.0023241387549221408, "phrase": "memory-based_comparisons"}, {"score": 0.0023033100935570755, "phrase": "i.e._the_simultaneous_view"}], "paper_keywords": ["visualisation", " usability", " multiple-view visualisation", " attention", " memory"], "paper_abstract": "Multiple-view visualisations offer several advantages, such as providing different perspectives on the data. However, there are also associated cognitive costs, including the load on working memory and the effort required for comparison. Furthermore, little perception-based research has been conducted, with few answers to questions such as what tasks multiple views are best used for. Since task performance can be limited by visual attention and working memory, this article investigates how different tasks and their respective loads on attention and working memory affect the usability of two different multiple-view visualisations, namely sequential and simultaneous views. In Study 1, the effects when attention was loaded were studied, where users performed a real-time monitoring task. The results suggest that the divided attention problem was an issue with both view types, but design issues apparent with the simultaneous view were not issues with the sequential view. In Study 2, the effects when working memory was loaded were studied, where users made comparisons of different object sets. The results support the previous work on visual- and memory-based comparisons, i.e. the simultaneous view was more useful than the sequential view. The outcomes from both studies illustrate the importance of understanding how different tasks and their impact on attention and working memory can influence the usability of multiple-view visualisations.", "paper_title": "Exploring the cognitive costs and benefits of using multiple-view visualisations", "paper_id": "WOS:000324361500007"}