{"auto_keywords": [{"score": 0.026653699480159356, "phrase": "gpu."}, {"score": 0.00481495049065317, "phrase": "vector_fields"}, {"score": 0.004513957235071457, "phrase": "evenly_spaced_streamlines"}, {"score": 0.004286708921931472, "phrase": "general_surface-based_vector_field"}, {"score": 0.0036710872046569532, "phrase": "sparse_and_dense_representations"}, {"score": 0.003353521531649663, "phrase": "visible_portions"}, {"score": 0.0031435968684569112, "phrase": "image-based_approach"}, {"score": 0.0029467742734417255, "phrase": "triangular_mesh"}, {"score": 0.002427035025924384, "phrase": "algorithm's_speed"}, {"score": 0.0021049977753042253, "phrase": "object-space_streamline_visualizations"}], "paper_keywords": ["flow visualization", " vector field visualization", " streamline seeding", " surfaces"], "paper_abstract": "We introduce a novel, automatic streamline seeding algorithm for vector fields defined on surfaces in 3D space. The algorithm generates evenly spaced streamlines fast, simply and efficiently for any general surface-based vector field. It is general because it handles large, complex, unstructured, adaptive resolution grids with holes and discontinuities, does not require a parametrization, and can generate both sparse and dense representations of the flow. It is efficient because streamlines are only integrated for visible portions of the surface. It is simple because the image-based approach removes the need to perform streamline tracing on a triangular mesh, a process which is complicated at best. And it is fast because it makes effective, balanced use of both the CPU and the GPU. The key to the algorithm's speed, simplicity and efficiency is its image-based seeding strategy. We demonstrate our algorithm on complex, real-world simulation data sets from computational fluid dynamics and compare it with object-space streamline visualizations.", "paper_title": "Evenly Spaced Streamlines for Surfaces: An Image-Based Approach", "paper_id": "WOS:000269902100006"}