{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "prior_knowledge"}, {"score": 0.013895323155781325, "phrase": "existing_biological_knowledge"}, {"score": 0.0047268728636719725, "phrase": "penalized_classifiers"}, {"score": 0.0046834372388970405, "phrase": "multiple_penalty_terms"}, {"score": 0.004290112502811656, "phrase": "almost_all_the_methods"}, {"score": 0.0038935506745975835, "phrase": "previous_studies"}, {"score": 0.003839962121679795, "phrase": "biological_functions"}, {"score": 0.0032968474833776906, "phrase": "resulting_model"}, {"score": 0.0031918759137610523, "phrase": "simple_and_general_framework"}, {"score": 0.00309023627455429, "phrase": "penalized_classifier"}, {"score": 0.0027913353347879507, "phrase": "partial_least_squares"}, {"score": 0.0026163210719740847, "phrase": "penalized_methods"}, {"score": 0.002418453525649304, "phrase": "group-specific_penalty_terms"}, {"score": 0.002363150587804677, "phrase": "simulated_and_real_data_examples"}, {"score": 0.0021443262599352996, "phrase": "higher_predictive_accuracy"}], "paper_keywords": [""], "paper_abstract": "Motivation: In the context of sample (e.g. tumor) classifications with microarray gene expression data, many methods have been proposed. However, almost all the methods ignore existing biological knowledge and treat all the genes equally a priori. On the other hand, because some genes have been identified by previous studies to have biological functions or to be involved in pathways related to the outcome (e.g. cancer), incorporating this type of prior knowledge into a classifier can potentially improve both the predictive performance and interpretability of the resulting model. Results: We propose a simple and general framework to incorporate such prior knowledge into building a penalized classifier. As two concrete examples, we apply the idea to two penalized classifiers, nearest shrunken centroids (also called PAM) and penalized partial least squares (PPLS) Instead of treating all the genes equally a priori as in standard penalized methods, we group the genes according to their functional associations based on existing biological knowledge or data, and adopt group-specific penalty terms and penalization parameters. Simulated and real data examples demonstrate that, if prior knowledge on gene grouping is indeed informative, our new methods perform better than the two standard penalized methods. yielding higher predictive accuracy and screening out more irrelevant genes.", "paper_title": "Incorporating prior knowledge of predictors into penalized classifiers with multiple penalty terms", "paper_id": "WOS:000249248300009"}