{"auto_keywords": [{"score": 0.0287488528811353, "phrase": "information_seekers"}, {"score": 0.02590693250627469, "phrase": "social_library_systems"}, {"score": 0.00481495049065317, "phrase": "social_library_system_users'_information"}, {"score": 0.004753194996637899, "phrase": "purpose_-_social_library_systems"}, {"score": 0.004662036750452837, "phrase": "interesting_books"}, {"score": 0.0038409323908446297, "phrase": "online_survey"}, {"score": 0.003706841132853073, "phrase": "regular_users"}, {"score": 0.0036829679352098784, "phrase": "douban"}, {"score": 0.003623949764016325, "phrase": "chine"}, {"score": 0.0035087260813209593, "phrase": "\"friend-of-a-friend\"_recruitment_technique"}, {"score": 0.003299765620885585, "phrase": "descriptive_and_inferential_statistics"}, {"score": 0.003278504512223807, "phrase": "findings_-_searching"}, {"score": 0.0031233388358844188, "phrase": "social_library_system_users"}, {"score": 0.002956316987429418, "phrase": "dominating_one"}, {"score": 0.0026916956768363158, "phrase": "different_information_seekers"}, {"score": 0.0026570998719084153, "phrase": "significantly_different_characteristics"}, {"score": 0.0023880948210628933, "phrase": "previous_studies"}, {"score": 0.002297162511308007, "phrase": "research_findings"}, {"score": 0.002253000188119187, "phrase": "diverse_and_dynamic_information"}, {"score": 0.0021883400011393564, "phrase": "useful_implications"}, {"score": 0.0021049977753042253, "phrase": "special_types"}], "paper_keywords": ["Social library system", " Information seeking", " Mode", " Douban", " Library systems", " Libraries", " Consumer behaviour"], "paper_abstract": "Purpose - Social library systems are Web 2.0 sites where users discover interesting books, movies, and music, etc., collect these resources to their personal libraries, and share their collections with others. The purpose of this study is to identify the information seeking modes adopted by users in this context as well as to reveal the characteristics of the users who are dominated by each mode. Design/methodology/approach - An online survey was conducted to capture the background and behavior data of regular users from Douban, the most influential Chine,se-language social library system. The \"friend-of-a-friend\" recruitment technique resulted in a total of 129 responses, 112 of which were valid and analyzed to generate both descriptive and inferential statistics. Findings - Searching, browsing, encountering, and monitoring are the four major information seeking modes adopted by social library system users. The majority of the users tend to combine two or more modes, but each user has a dominating one that helps define him/her as a searcher, browser, encounterer, or monitor. While searching is the most widely adopted mode, browsers are the most prevalent type of information seekers. Different information seekers do not demonstrate significantly different characteristics by and large, however with some exceptions. Originality/value - This study is one of the first to investigate how users look for resources in social library systems, a problem neglected by previous studies mostly focusing on how users organize and tag resources. The research findings enrich our understanding of social library systems as diverse and dynamic information seeking environments. This in turn will provide useful implications for their interface design to more effectively address the needs and expectations of special types of information seekers.", "paper_title": "An exploratory study on social library system users' information seeking modes", "paper_id": "WOS:000315314600002"}