{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "table_constraints"}, {"score": 0.046007263478270076, "phrase": "propagation_queue"}, {"score": 0.0044535760439663235, "phrase": "constraint-based_approaches"}, {"score": 0.004192937957960497, "phrase": "value-based_approaches"}, {"score": 0.004061160863655662, "phrase": "removed_values"}, {"score": 0.003989742144066683, "phrase": "five_efficient_value-based_algorithms"}, {"score": 0.0037163618245226755, "phrase": "optimal_time_complexity"}, {"score": 0.0035867530188337933, "phrase": "substantial_experimental_results"}, {"score": 0.0035236476185949565, "phrase": "empirical_analysis"}, {"score": 0.0029819840849398234, "phrase": "binary_constraints"}, {"score": 0.0026146595609362715, "phrase": "small_arity_tables"}, {"score": 0.0023586032632567796, "phrase": "best_propagator"}, {"score": 0.0022924784914292026, "phrase": "large_arity_tables"}, {"score": 0.002120018771276572, "phrase": "winning_strategy"}], "paper_keywords": ["Propagation", " Consistency", " Filtering algorithms", " Table constraints"], "paper_abstract": "Filtering algorithms for table constraints can be classified in two categories: constraint-based and value-based. In the constraint-based approaches, the propagation queue only contains information on the constraints that must be reconsidered. For the value-based approaches, the propagation queue also contains information on the removed values. This paper proposes five efficient value-based algorithms for table constraints. Two of them (AC5TCOpt-Tr and AC5TCOpt-Sparse) are proved to have an optimal time complexity of O(r center dot t+r center dot d) per table constraint. Substantial experimental results are presented. An empirical analysis is conducted on the effect of the arity of the tables. The experiments show that our propagators are the best when the arity of the table is 3 or 4. Indeed, on instances containing only binary constraints, our algorithms are outperformed by classical AC algorithm AC3rm. AC3rm is dedicated to binary constraints. However, all our algorithms outperform existing state-of-the-art constraint based STR2+ and MDD (c) and the optimal value-based STR3 algorithms on those instances. On instances with small arity tables (up to arity 4), all our algorithms are generally faster than STR2+, MDD (c) and than STR3. AC5TCOpt-Sparse is globally the best propagator on those benchmarks. On benchmarks containing large arity tables (arity 5 or more), each of the three existing state-of-the-art algorithms is the winning strategy on one different benchmark.", "paper_title": "Optimal and efficient filtering algorithms for table constraints", "paper_id": "WOS:000329319300004"}