{"auto_keywords": [{"score": 0.04543044910850528, "phrase": "compromised_nodes"}, {"score": 0.007624241815318089, "phrase": "proposed_schemes"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks"}, {"score": 0.004740126725341152, "phrase": "sensor_network"}, {"score": 0.004648222388468414, "phrase": "hostile_environment"}, {"score": 0.004417487764326481, "phrase": "sensor_nodes"}, {"score": 0.003943047070755799, "phrase": "symmetric_group_key-based_schemes"}, {"score": 0.0037915057447460133, "phrase": "large_number"}, {"score": 0.003547084456662448, "phrase": "filtering_schemes"}, {"score": 0.0030680392468327147, "phrase": "noncompromised_nodes"}, {"score": 0.0030321497870310077, "phrase": "false_data"}, {"score": 0.002926973459215349, "phrase": "simple_while_controversial_idea_-_preload_future_group_keys"}, {"score": 0.0028033523242224833, "phrase": "preloaded_keys"}, {"score": 0.0026954938318408464, "phrase": "novel_technique"}, {"score": 0.0026639507068734907, "phrase": "neighboring_nodes"}, {"score": 0.0026019646284747024, "phrase": "future_group_keys"}, {"score": 0.0024920359789965783, "phrase": "first_set"}, {"score": 0.002472552537325604, "phrase": "distributed_group_rekeying_schemes"}, {"score": 0.0024150092189446424, "phrase": "online_key_servers"}, {"score": 0.0023961265476627166, "phrase": "extensive_analysis"}, {"score": 0.0022152149658434916, "phrase": "good_level"}, {"score": 0.0021049977753042253, "phrase": "false_data_filtering"}], "paper_keywords": ["Wireless sensor networks", " Security", " Group key management", " False message filtering"], "paper_abstract": "When a sensor network is deployed in a hostile environment, an adversary may launch such attacks as eavesdropping the Communications and compromising sensor nodes. Using the compromised nodes, lie may inject false sensing reports or modify the reports sent by other nodes. To defend against these attacks, researchers have proposed symmetric group key-based schemes. In these schemes, however, if a large number of nodes are compromised, many (sub)group keys will be revealed. This greatly endangers the filtering schemes, making them very ineffective or even useless. To address this problem, we propose a family of predistribution and local collaboration-based group rekeying (PCGR) schemes, which update the compromised group keys to prevent the compromised nodes from understanding the communications between noncompromised nodes or injecting false data. These schemes are designed based on a simple while controversial idea - preload future group keys into sensor nodes before their deployment. To protect the preloaded keys from being disclosed by compromised nodes, we propose a novel technique that requires neighboring nodes to collaborate to derive the future group keys. To the best of our knowledge, our schemes are the first set of distributed group rekeying schemes for sensor networks without involving online key servers. Extensive analysis and simulations are conducted to evaluate the proposed schemes, and the results show that the proposed schemes can achieve a good level of security, outperform several previous group rekeying schemes, and significantly improve the effectiveness of false data filtering. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Predistribution and local collaboration-based group rekeying for wireless sensor networks", "paper_id": "WOS:000265858400015"}