{"auto_keywords": [{"score": 0.04762225647372066, "phrase": "proteus"}, {"score": 0.015556914778306891, "phrase": "heterogeneous_services"}, {"score": 0.00481495049065317, "phrase": "unified_discovery"}, {"score": 0.0039006600544599537, "phrase": "service_discovery"}, {"score": 0.0037397086147485897, "phrase": "technology-independent_formulation"}, {"score": 0.0035853745478488254, "phrase": "query_responses"}, {"score": 0.0034738037330064885, "phrase": "generic_elements"}, {"score": 0.0031761255583359726, "phrase": "existing_similarity_metrics"}, {"score": 0.002711506442590442, "phrase": "existing_service_infrastructure"}, {"score": 0.002518525107994039, "phrase": "traditional_web_services"}, {"score": 0.002492098272172066, "phrase": "service-oriented_grids"}, {"score": 0.0024659480471085405, "phrase": "peer-to-peer_networks"}, {"score": 0.0022783523466965187, "phrase": "existing_query_models"}, {"score": 0.002242577809454225, "phrase": "standard_service_discovery_technologies"}, {"score": 0.0021049977753042253, "phrase": "improved_performance"}], "paper_keywords": ["Services discovery process and methodology", " web services interoperability", " metadata of services interfaces"], "paper_abstract": "In this paper, we propose Proteus, a generic query model for the discovery of operations offered by heterogeneous services. We demonstrate the need for such a model, and show how it unifies the task of service discovery through abstractions, which allow for the technology-independent formulation of service advertisements, queries, and query responses. On top of these generic elements, we build an intuitive, fuzzy-based query evaluation mechanism that supports the service matchmaking process by employing and appropriately combining existing similarity metrics. Thanks to the generality of Proteus, it is possible to seamlessly accommodate the discovery of operations provided by various types of services without the need of changing the existing service infrastructure. Thus, our approach is applicable to a variety of settings ranging from traditional web services to service-oriented grids, peer-to-peer networks, geospatial information systems, and so on. Overall, compared to the existing query models supported by standard service discovery technologies, our approach is marked by openness, flexibility, and improved performance in terms of precision and recall. The feasibility and efficiency of Proteus are verified by a series of experiments.", "paper_title": "A Generic Query Model for the Unified Discovery of Heterogeneous Services", "paper_id": "WOS:000324253200007"}