{"auto_keywords": [{"score": 0.0437107789799431, "phrase": "soft_processors"}, {"score": 0.00481495049065317, "phrase": "fpga-based_soft_processors"}, {"score": 0.004722613498487908, "phrase": "embedded_systems_designers"}, {"score": 0.004632039024076267, "phrase": "field-programmable_gate_arrays"}, {"score": 0.004456044928556639, "phrase": "single-chip_designs"}, {"score": 0.004044645056447888, "phrase": "fpga_programmable_logic"}, {"score": 0.003353521531649663, "phrase": "specific_applications"}, {"score": 0.0032051601987130207, "phrase": "soft-processor_implementations"}, {"score": 0.003004494701922268, "phrase": "altera's_nios_ii_variations"}, {"score": 0.0028715299874549245, "phrase": "soft-processor_microarchitecture"}, {"score": 0.0021049977753042253, "phrase": "specific_application"}], "paper_keywords": ["customization", " design space exploration", " field-programmable gate array (FPGA)-based soft-core processors", " processor generator"], "paper_abstract": "As embedded systems designers increasingly use field-programmable gate arrays (FPGAs) while pursuing single-chip designs, they are motivated to have their designs also include soft processors, processors built using FPGA programmable logic. In this paper, we provide: 1) an exploration of the microarchitectural tradeoffs; for soft processors and 2) a set of customization techniques that capitalizes on these tradeoffs to improve the efficiency of soft processors for specific applications. Using our infrastructure for automatically generating soft-processor implementations (which span a large area/speed design space while remaining competitive with Altera's Nios II variations), we quantify tradeoffs within soft-processor microarchitecture and explore the impact of tuning the microarchitecture to the application. In addition, we apply a technique of subsetting the instruction set to use only the portion utilized by the application. Through these two techniques, we can improve the performance-per-area of a soft processor for a specific application by an average of 25 %.", "paper_title": "Exploration and customization of FPGA-based soft processors", "paper_id": "WOS:000243953000007"}