{"auto_keywords": [{"score": 0.04430670955456611, "phrase": "producible_chains"}, {"score": 0.028863485027032156, "phrase": "random_chain"}, {"score": 0.026616413656799728, "phrase": "random_configuration"}, {"score": 0.00481495049065317, "phrase": "producible_polygonal_protein_chains"}, {"score": 0.004781777766309739, "phrase": "fixed-angle_polygonal_chains"}, {"score": 0.004667454318370122, "phrase": "interesting_model"}, {"score": 0.0046352930395962685, "phrase": "protein_backbones"}, {"score": 0.003290986600659723, "phrase": "producible_configurations"}, {"score": 0.003190024306903021, "phrase": "canonical_configuration"}, {"score": 0.0030180996912267683, "phrase": "\"nonacute_chain"}, {"score": 0.002401286805515306, "phrase": "dihedral_angles"}, {"score": 0.0023764543399388658, "phrase": "regular_distribution"}, {"score": 0.0023034836169432233, "phrase": "locked_configuration"}, {"score": 0.002271773887265199, "phrase": "nontrivial_class"}, {"score": 0.0022327484973125936, "phrase": "locked_configurations"}, {"score": 0.0021343846011837204, "phrase": "producible_approaches"}], "paper_keywords": ["polygonal chains", " locked chains", " fixed-angle chains", " flattenable chains", " protein folding", " protein backbone"], "paper_abstract": "Fixed-angle polygonal chains in three dimensions serve as an interesting model of protein backbones. Here we consider such chains produced inside a \"machine\" modeled crudely as a cone, and examine the constraints this model places on the producible chains. We call this notion producible, and prove as our main result that a chain whose maximum turn angle is alpha is producible in a cone of half-angle >= alpha if and only if the chain is flattenable, that is, the chain can be reconfigured without self-intersection to lie flat in a plane. This result establishes that two seemingly disparate classes of chains are in fact identical. Along the way, we discover that all producible configurations of a chain can be moved to a canonical configuration resembling a helix. One consequence is an algorithm that reconfigures between any two flat states of a \"nonacute chain\" in O(n) \"moves,\" improving the O(n(2))-move algorithm in [ADD+]. Finally, we prove that the producible chains are rare in the following technical sense. A random chain of n links is defined by drawing the lengths and angles from any \"regular\" (e.g., uniform) distribution on any subset of the possible values. A random configuration of a chain embeds into R-3 by in addition drawing the dihedral angles from any regular distribution. If a class of chains has a locked configuration (and no nontrivial class is known to avoid locked configurations), then the probability that a random configuration of a random chain is producible approaches zero geometrically as n -> infinity.", "paper_title": "Geometric restrictions on producible polygonal protein chains", "paper_id": "WOS:000234602100006"}