{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quadrilateral_network"}, {"score": 0.04925795561529137, "phrase": "triangular_meshes"}, {"score": 0.04295910053753944, "phrase": "automatic_surface_reconstruction"}, {"score": 0.042426215462423846, "phrase": "proposed_method"}, {"score": 0.041552086294390715, "phrase": "mesh_simplification"}, {"score": 0.004340081802944066, "phrase": "huge_number"}, {"score": 0.004247180402119585, "phrase": "curve_net"}, {"score": 0.0038781372962808894, "phrase": "net_generation"}, {"score": 0.003634262647873338, "phrase": "quadratic_error_metric"}, {"score": 0.0035564156572789473, "phrase": "additional_post-processing_criteria"}, {"score": 0.003405671497507337, "phrase": "reduced_meshes"}, {"score": 0.0029776614744264724, "phrase": "new_front"}, {"score": 0.002766171878646582, "phrase": "curve_net_generation"}, {"score": 0.0025036862991477437, "phrase": "constrained_curve"}, {"score": 0.0023664730217196252, "phrase": "b-spline_curves"}, {"score": 0.002335889180060105, "phrase": "appropriate_continuity_conditions"}, {"score": 0.002315719347244451, "phrase": "adjacent_curves"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mesh simplification", " Quadrangulation", " Curve net", " Surface reconstruction"], "paper_abstract": "The aim of this study is to propose a method for building quadrilateral network of curves automatically from a huge number of triangular meshes. The curve net can be served as the framework of automatic surface reconstruction. The proposed method mainly includes three stages: mesh simplification, quadrangulation and curve net generation. Mesh simplification is employed to reduce the number of meshes in accordance with a quadratic error metric for each vertex. Additional post-processing criteria are also employed to improve the shape of the reduced meshes. For quadrangulation. a front composed of a sequence of edges is introduced. An algorithm is proposed to combine each pair of triangles along the front. A new front is then formed and quadrangulation is continued until all triangles are combined or converted. For curve net generation, each edge of quadrilateral meshes is projected onto the triangular meshes to acquire a set of slicing points first. A constrained curve fitting is then employed to convert all sets of slicing points into B-spline curves, with appropriate continuity conditions across adjacent curves. Several examples have been presented to demonstrate the feasibility of the proposed method and its application in automatic surface reconstruction. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic construction of quadrilateral network of curves from triangular meshes", "paper_id": "WOS:000272858700033"}