{"auto_keywords": [{"score": 0.03899661662596745, "phrase": "reachability_probabilities"}, {"score": 0.01332555116841334, "phrase": "timing_parameters"}, {"score": 0.00481495049065317, "phrase": "inverse_method"}, {"score": 0.004698928175923764, "phrase": "probabilistic"}, {"score": 0.004313793774439379, "phrase": "automata_models"}, {"score": 0.004175533280178052, "phrase": "single_reference_valuation_pi"}, {"score": 0.0034620119220744347, "phrase": "reference_valuation"}, {"score": 0.003378385493203297, "phrase": "parametric_analysis"}, {"score": 0.0033373303217961803, "phrase": "non-probabilistic_version"}, {"score": 0.0032700071110068323, "phrase": "automata_model"}, {"score": 0.0032302647179383915, "phrase": "\"inverse_method"}, {"score": 0.0029895074299598275, "phrase": "dense_domain"}, {"score": 0.0024281181691350085, "phrase": "probabilistic_analysis"}, {"score": 0.0022287497627555895, "phrase": "randomized_protocols"}, {"score": 0.0021049977753042253, "phrase": "\"probabilistic_cartography"}], "paper_keywords": ["Probabilistic model checking", " Parametric timed automata"], "paper_abstract": "Probabilistic timed automata can be used to model systems in which probabilistic and timing behaviour coexist. Verification of probabilistic timed automata models is generally performed with regard to a single reference valuation pi (0) of the timing parameters. Given such a parameter valuation, we present a method for obtaining automatically a constraint K (0) on timing parameters for which the reachability probabilities (1) remain invariant and (2) are equal to the reachability probabilities for the reference valuation. The method relies on parametric analysis of a non-probabilistic version of the probabilistic timed automata model using the \"inverse method\". The method presents the following advantages. First, since K (0) corresponds to a dense domain around pi (0) on which the system behaves uniformly, it gives us a measure of robustness of the system. Second, it allows us to obtain a valuation satisfying K (0) which is as small as possible while preserving reachability probabilities, thus making the probabilistic analysis of the system easier and faster in practice. We provide examples of the application of our technique to models of randomized protocols, and introduce an extension of the method allowing the generation of a \"probabilistic cartography\" of a system.", "paper_title": "An extension of the inverse method to probabilistic timed automata", "paper_id": "WOS:000316677500001"}