{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_behavior"}, {"score": 0.04978895903400396, "phrase": "professional_translators"}, {"score": 0.036745787063818064, "phrase": "wide_range"}, {"score": 0.00453113241842654, "phrase": "professional_translators'_information_needs"}, {"score": 0.0042252744467257885, "phrase": "focus_group_sessions"}, {"score": 0.004061584718427419, "phrase": "task_characteristics"}, {"score": 0.0038923605771735838, "phrase": "bystrom's_findings"}, {"score": 0.003764341156823266, "phrase": "new_hypotheses"}, {"score": 0.003353521531649663, "phrase": "personal_contacts"}, {"score": 0.0033129660760880383, "phrase": "native_speakers"}, {"score": 0.0032828706086018133, "phrase": "domain_experts"}, {"score": 0.0032039415997394817, "phrase": "different_types"}, {"score": 0.0031364320619313765, "phrase": "translator_problems"}, {"score": 0.0028890603352364273, "phrase": "relative_importance"}, {"score": 0.0027854565462509095, "phrase": "literary_translation"}, {"score": 0.0025039656549083497, "phrase": "broad_range"}, {"score": 0.0024511688853030168, "phrase": "dictionary_use"}, {"score": 0.002414138203828421, "phrase": "information_problems"}, {"score": 0.0023776656246300063, "phrase": "normal_task_activities"}, {"score": 0.0022168460543913787, "phrase": "style_expertise"}, {"score": 0.002124397597702259, "phrase": "supports"}], "paper_keywords": ["interpreters", " qualitative research", " information retrieval", " individual behaviour", " semantics"], "paper_abstract": "Purpose - This paper characterizes translation as a task and aims to identify how it influences professional translators' information needs and use of resources to meet those needs. Design/methodology/approach - This research is exploratory and qualitative. Data are based on focus group sessions with 19 professional translators. Where appropriate, findings are related to several theories relating task characteristics and information behavior (IB). Findings - The findings support some of Bystrom's findings about relationship between task and information use but also suggest new hypotheses or relationships among task, information need. and information use, including the notion of a zone of familiarity. Translators use a wide range of resources. both formal and informal, localized sources, including personal contacts with other translators. native speakers, and domain experts, to supplement their basic resources. which are different types of dictionaries. The study addresses translator problems created by the need to translate materials in less commonly taught languages. Research limitations/implications - Focus group sessions allow only for identifying concepts, relationships, and hypotheses, not for indicating the relative importance of variables or distribution across individuals. Translation does not cover literary translation. Practical implications - The paper suggests content and features of workstations offering access to wide range of resources for professional translators. Originality/value - Unlike other information behavior studies of professional translators, this article focuses on a broad range of resources, not just on dictionary use. It also identifies information problems associated not only with normal task activities, but also with translators' moving out of their zone of familiarity, i.e. their range of domain, language, and style expertise. The model of translator IB is potentially generalizable to other groups and both Supports and expands other task-related research.", "paper_title": "Beyond dictionaries - Understanding information behavior of professional translators", "paper_id": "WOS:000259459300007"}