{"auto_keywords": [{"score": 0.024122183668603647, "phrase": "information_science"}, {"score": 0.00481495049065317, "phrase": "paul_otlet's_ontology"}, {"score": 0.004267757384195032, "phrase": "paul_otlet"}, {"score": 0.003969640975997097, "phrase": "\"information_science"}, {"score": 0.0038054151244558123, "phrase": "complete_\"image"}, {"score": 0.003496994062890991, "phrase": "scientific_discipline"}, {"score": 0.0031941384895530426, "phrase": "otlet"}, {"score": 0.003155784719225786, "phrase": "human_knowledge"}, {"score": 0.00306189690236109, "phrase": "systematic_and_unified_way"}, {"score": 0.0029887957779347394, "phrase": "otlet's_primary_works"}, {"score": 0.0026970382454914437, "phrase": "otlet's_views"}, {"score": 0.0021049977753042253, "phrase": "ongoing_debate"}], "paper_keywords": ["Information science", " History", " Knowledge sharing", " Document management", " Encyclopaedias", " Entrepreneurialism"], "paper_abstract": "Purpose - The purpose of this paper is to document how Paul Otlet, founding-father of what is termed at present as \"information science\", attempted to provide a complete \"image of the world\" (and reality in general) by establishing the scientific discipline he dubbed \"documentation\". The paper also aims to focus on how Otlet represented human knowledge and reality in a systematic and unified way. Design/methodology/approach - A close reading of Otlet's primary works and some of his personal archives was undertaken. Findings - Most importantly, it is shown that Otlet's views on documentation were immersed in a cosmological, objectivist, humanitarian and ontological framework that is alien to contemporary information science. Correspondingly, his alleged affinity with positivism is reassessed. Originality/value - The philosophical foundations of the origins of information science are highlighted. Indirectly, this paper is relevant to the ongoing debate on realism and anti-realism in information science.", "paper_title": "To treat of the world Paul Otlet's ontology and epistemology and the circle of knowledge", "paper_id": "WOS:000264951500004"}