{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "arboricity"}, {"score": 0.04583697714099703, "phrase": "dynamic_algorithms"}, {"score": 0.03765626930873783, "phrase": "data_structure"}, {"score": 0.036851768144639294, "phrase": "chiba"}, {"score": 0.03662478100472953, "phrase": "nishizeki"}, {"score": 0.030888340182972308, "phrase": "diamond-free_graphs"}, {"score": 0.028048783842587594, "phrase": "new_static_algorithms"}, {"score": 0.004619356874848538, "phrase": "new_data_structure"}, {"score": 0.004065781456356258, "phrase": "overall_size"}, {"score": 0.003912974119795913, "phrase": "n_vertices"}, {"score": 0.0037900142749506425, "phrase": "basic_operations"}, {"score": 0.003753882510162702, "phrase": "dynamic_applications"}, {"score": 0.0036127549845584, "phrase": "adjacency_queries"}, {"score": 0.0030794433253250476, "phrase": "proposed_data_structure"}, {"score": 0.0024699687468983686, "phrase": "cop-win_graphs"}, {"score": 0.0024463906152005772, "phrase": "strongly_chordal_graphs"}, {"score": 0.0023846075213405284, "phrase": "proposed_static_algorithms"}, {"score": 0.0022948394240866555, "phrase": "low_arboricity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Arboricity", " Cop-win graphs", " Data structures", " Diamond-free graphs", " Dynamic algorithms", " h-index", " Strongly chordal graphs"], "paper_abstract": "We propose a new data structure for manipulating graphs, called h-graph, which is particularly suited for designing dynamic algorithms. The structure itself is simple, consisting basically of a triple of elements, for each vertex of the graph. The overall size of all triples is O(n + m), for a graph with n vertices and m edges. We describe algorithms for performing the basic operations related to dynamic applications, as insertions and deletions of vertices or edges, and adjacency queries. The data structure employs a technique first described by Chiba and Nishizeki [Chiba, Nishizeki, Arboricity and subgraph listing algorithms, SIAM J. Comput. 14 (1) (1985) 210-223], and relies on the arboricity of graphs. Using the proposed data structure, we describe several dynamic algorithms for solving problems as listing the cliques of a given size, recognizing diamond-free graphs, and finding simple, simplicial and dominated vertices. These algorithms are the first of their kind to be proposed in the literature. In fact, the dynamic algorithms for the above problems lead directly to new static algorithms, and using the data structure we also design new static algorithms for the problems of counting subgraphs of size 4, recognizing cop-win graphs and recognizing strongly chordal graphs. The complexities of all of the proposed static algorithms improve over the complexities of the so far existing algorithms, for graphs of low arboricity. In addition, for the problems of counting subgraphs of size 4 and recognizing diamond-free graphs, the improvement is general. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Arboricity, h-index, and dynamic algorithms", "paper_id": "WOS:000302425600007"}