{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "extended_influence_diagrams"}, {"score": 0.02663663570600684, "phrase": "influence_diagrams"}, {"score": 0.004672953146379813, "phrase": "enterprise_architecture"}, {"score": 0.004348936976349555, "phrase": "enterprise-wide_information_system_issues"}, {"score": 0.00414545383888272, "phrase": "enterprise_architecture_models"}, {"score": 0.0039043835848369215, "phrase": "e.g._the_level"}, {"score": 0.003857871979942733, "phrase": "enterprise_information_security"}, {"score": 0.0036553070575015344, "phrase": "formal_language"}, {"score": 0.0034016119212097826, "phrase": "causal_relations"}, {"score": 0.0029991500396912923, "phrase": "decision_making"}, {"score": 0.0027741761880779535, "phrase": "decision_alternatives"}], "paper_keywords": ["enterprise architecture models", " formal language", " influence diagrams"], "paper_abstract": "The discipline of enterprise architecture advocates the use of models to support decision-making on enterprise-wide information system issues. In order to provide such support, enterprise architecture models should be amenable to analyses of various properties, as e.g. the level of enterprise information security. This paper proposes the use of a formal language to support such analysis. Such a language needs to be able to represent causal relations between, and definitions of, various concepts as well as uncertainty with respect to both concepts and relations. To support decision making properly, the language must also allow the representation of goals and decision alternatives. This paper evaluates a number of languages with respect to these requirements, and selects influence diagrams for further consideration. The influence diagrams are then extended to fully satisfy the requirements. The syntax and semantics of the extended influence diagrams are detailed in the paper, and their use is demonstrated in an example.", "paper_title": "Enterprise architecture analysis with extended influence diagrams", "paper_id": "WOS:000247193400004"}