{"auto_keywords": [{"score": 0.04693660269842158, "phrase": "itss"}, {"score": 0.04425611715601115, "phrase": "reading_strategy"}, {"score": 0.0335336684156561, "phrase": "off-task_responses"}, {"score": 0.00481495049065317, "phrase": "web-based_reading_comprehension_tutor"}, {"score": 0.004602233424629559, "phrase": "intelligent_tutoring"}, {"score": 0.004356472679444647, "phrase": "online_instruction"}, {"score": 0.004163925706345031, "phrase": "disengaged_responses"}, {"score": 0.003331915219811852, "phrase": "computer_feedback"}, {"score": 0.002985130390111069, "phrase": "good_main_ideas"}, {"score": 0.002899519426587381, "phrase": "low_scores"}, {"score": 0.002880829737447174, "phrase": "work_mastery_goals"}, {"score": 0.0028530201960995896, "phrase": "highest_producers"}, {"score": 0.0026743419827100225, "phrase": "low_motivation"}, {"score": 0.0025892330566358503, "phrase": "recall_tasks"}, {"score": 0.0025725382476862305, "phrase": "itss."}, {"score": 0.002555950807368337, "phrase": "logistic_regression"}, {"score": 0.0024586427394152196, "phrase": "motivational_scales"}, {"score": 0.0023958326775913165, "phrase": "on-line_performance_measures"}, {"score": 0.002357391911165024, "phrase": "flag_students"}, {"score": 0.0023421884529240882, "phrase": "early_intervention"}, {"score": 0.0023120743774800176, "phrase": "active_off-task_responses"}, {"score": 0.0022749744354271816, "phrase": "line_learning"}, {"score": 0.0021601997088758957, "phrase": "different_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Human-computer interface", " Intelligent tutoring systems", " Pedagogical issues", " Teaching/learning strategies"], "paper_abstract": "Research shows the students improve their reading comprehension with Intelligent Tutoring of the Structure Strategy (ITSS). One problem for ITSS is that some students are producing responses in the online instruction that are unrelated to learning and practicing the reading strategy. These types of disengaged responses can be referred to as system active off-task responses (\"off-task\"). In this study we characterize who produces off-task responses and why. Classification and Regression Trees (C&RT) and logistic regression analyses were used to answer the why question. Variables predicted to relate to gaming included reading strategy and skill variables, motivation, attitude, self-efficacy, and goal orientation variables, demographic variables, and type of computer feedback (simple versus elaborated). C&RT analysis could explain 66% of the variance in off-task responses. Students without off-task responses were higher in motivation to read and worked in ITSS to produce good main ideas. Students with higher off-task responses had low scores on work mastery goals. The highest producers of off-task responses in Grades 5 and 7 (averaging 24 off-task responses over 7 lessons) had low motivation to read and scored over 2 SD below average on recall tasks in ITSS. The logistic regression could explain 42% of the variance in off-task responses. Use of motivational scales prior to starting instruction as well as on-line performance measures could be used to flag students for early intervention to prevent system active off-task responses and increase on-line learning. The C&RT approach may be particularly helpful to designers in making software more appropriate for different types of students. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Why fifth- and seventh-graders submit off-task responses to a web-based reading comprehension tutor rather than expected learning responses", "paper_id": "WOS:000335618000020"}