{"auto_keywords": [{"score": 0.04346461346451007, "phrase": "hit_problems"}, {"score": 0.015131105896116808, "phrase": "emerging_classification"}, {"score": 0.014152859562328863, "phrase": "maude"}, {"score": 0.00481495049065317, "phrase": "fda_reports"}, {"score": 0.004722969348897542, "phrase": "health_information_technology_safety_problems"}, {"score": 0.004573537724320323, "phrase": "health_information_technology"}, {"score": 0.004544243946456182, "phrase": "hit"}, {"score": 0.0042611497796259026, "phrase": "standardized_search_strategy"}, {"score": 0.0040866404150657005, "phrase": "relevant_events"}, {"score": 0.004008516312861836, "phrase": "new_categories"}, {"score": 0.0039192497049015135, "phrase": "remaining_events"}, {"score": 0.003869132124880576, "phrase": "free-text_descriptions"}, {"score": 0.0036749658368075027, "phrase": "reported_problems"}, {"score": 0.0035130521069092493, "phrase": "kappa_statistic"}, {"score": 0.003479292061332723, "phrase": "major_categories"}, {"score": 0.003304624380309877, "phrase": "hit."}, {"score": 0.0032518541963473405, "phrase": "unrelated_reports"}, {"score": 0.003098530474496842, "phrase": "software_functionality"}, {"score": 0.003078639412163634, "phrase": "system_configuration"}, {"score": 0.003010017873923648, "phrase": "network_configuration"}, {"score": 0.0026632593674563855, "phrase": "human-computer_interface"}, {"score": 0.002570531747243578, "phrase": "hazardous_circumstances"}, {"score": 0.00248903151226017, "phrase": "patient_harm"}, {"score": 0.0022163995544178215, "phrase": "useful_new_source"}, {"score": 0.0021669551936989886, "phrase": "software_problems"}, {"score": 0.0021049977753042253, "phrase": "safe_design"}], "paper_keywords": [""], "paper_abstract": "Objective To expand an emerging classification for problems with health information technology (HIT) using reports submitted to the US Food and Drug Administration Manufacturer and User Facility Device Experience (MAUDE) database. Design HIT events submitted to MAUDE were retrieved using a standardized search strategy. Using an emerging classification with 32 categories of HIT problems, a subset of relevant events were iteratively analyzed to identify new categories. Two coders then independently classified the remaining events into one or more categories. Free-text descriptions were analyzed to identify the consequences of events. Measurements Descriptive statistics by number of reported problems per category and by consequence; inter-rater reliability analysis using the kappa statistic for the major categories and consequences. Results A search of 899 768 reports from January 2008 to July 2010 yielded 1100 reports about HIT. After removing duplicate and unrelated reports, 678 reports describing 436 events remained. The authors identified four new categories to describe problems with software functionality, system configuration, interface with devices, and network configuration; the authors' classification with 32 categories of HIT problems was expanded by the addition of these four categories. Examination of the 436 events revealed 712 problems, 96% were machine-related, and 4% were problems at the human-computer interface. Almost half (46%) of the events related to hazardous circumstances. Of the 46 events (11%) associated with patient harm, four deaths were linked to HIT problems (0.9% of 436 events). Conclusions Only 0.1% of the MAUDE reports searched were related to HIT. Nevertheless, Food and Drug Administration reports did prove to be a useful new source of information about the nature of software problems and their safety implications with potential to inform strategies for safe design and implementation.", "paper_title": "Using FDA reports to inform a classification for health information technology safety problems", "paper_id": "WOS:000298848100007"}