{"auto_keywords": [{"score": 0.040736570883682544, "phrase": "intrapreneurship_culture"}, {"score": 0.022149649160583804, "phrase": "technological_it"}, {"score": 0.021999060686912025, "phrase": "managerial_it_resources"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.0046184900568047565, "phrase": "information_technology"}, {"score": 0.004147123642915346, "phrase": "it-enabled_organizational_capabilities"}, {"score": 0.004104132253183181, "phrase": "proposed_research_model"}, {"score": 0.0040194764936614565, "phrase": "cross-sectional_survey_data"}, {"score": 0.003922907208353323, "phrase": "findings_-_data_analysis"}, {"score": 0.0038419751490849133, "phrase": "valuable_key_capability"}, {"score": 0.003802135020791801, "phrase": "firm_market_performance"}, {"score": 0.003697895355947004, "phrase": "positive_effect"}, {"score": 0.0034615969985956866, "phrase": "firm_performance"}, {"score": 0.003065017584859704, "phrase": "spanish"}, {"score": 0.002991300390411948, "phrase": "research_findings"}, {"score": 0.0029705677977833857, "phrase": "important_implications"}, {"score": 0.0029499784768149146, "phrase": "practising_managers"}, {"score": 0.0028097829999199596, "phrase": "firms'_ability"}, {"score": 0.0027709616040210686, "phrase": "innovation-supportive_culture"}, {"score": 0.002704306866425829, "phrase": "important_intermediate_organizational_capability"}, {"score": 0.002584733102974067, "phrase": "performance_effects"}, {"score": 0.0025578967205807843, "phrase": "corporate_level"}, {"score": 0.0023611760395203106, "phrase": "key_role"}, {"score": 0.002344800544183559, "phrase": "it-based_resources"}, {"score": 0.002280423827531483, "phrase": "organizational_culture"}, {"score": 0.002171979107594173, "phrase": "business_value"}, {"score": 0.0021569129153653777, "phrase": "it-enabled_intrapreneurship_culture"}], "paper_keywords": ["Communication technologies", " Innovation", " Business performance", " Entrepreneurialism"], "paper_abstract": "Purpose - The purpose of this paper is to analyze the relationships among two types of information technology (IT) resources (technological IT and managerial IT resources), the intrapreneurship culture and firm performance. Design/methodology/approach - The paper is consistent with the perspective on IT-enabled organizational capabilities. A proposed research model and hypotheses are tested using cross-sectional survey data from a sample of 203 leading Spanish firms. Findings - Data analysis shows that intrapreneurship culture is a valuable key capability that predicts firm market performance; both technological IT and managerial IT resources have a positive effect on the development of an intrapreneurship culture in the firm, and investment in both technological IT and managerial IT resources influences firm performance positively by means of the capability of intrapreneurship culture. Research limitations/implications - Among other limitations, the paper uses data provided by only one key informant per firm, and the results can be generalized to only 25 business sectors among Spanish firms. Practical implications - The research findings have important implications for practising managers. First, our results suggest that the deployment of technological IT and managerial IT resources increases firms' ability to develop an innovation-supportive culture. Second, intrapreneurship culture is an important intermediate organizational capability through which the benefits of both technological IT and managerial IT resources are converted into performance effects at the corporate level. Originality/value - First, this paper reveals how firms can develop an intrapreneurship culture. Specifically, the findings of the paper show the key role of IT-based resources in the development of this type of organizational culture. Second, this paper shows theoretically and empirically how firms can generate business value from IT-enabled intrapreneurship culture, a topic that has received little attention to date.", "paper_title": "Information technology-enabled intrapreneurship culture and firm performance", "paper_id": "WOS:000278279300013"}