{"auto_keywords": [{"score": 0.04208347954551837, "phrase": "protein-coding_genes"}, {"score": 0.039356982695209576, "phrase": "tissue-specific_expressions"}, {"score": 0.00481495049065317, "phrase": "tissue-enriched_loci"}, {"score": 0.0036459007842756983, "phrase": "expressed_tissue"}, {"score": 0.0035761182400032487, "phrase": "biological_experiments"}, {"score": 0.0033877275374263314, "phrase": "next-generation_techniques"}, {"score": 0.003348679079076544, "phrase": "rna-seq"}, {"score": 0.003284550970221379, "phrase": "high-throughput_data"}, {"score": 0.0028798723050615788, "phrase": "published_datasets"}, {"score": 0.0027813397260607487, "phrase": "new_knowledge_database"}, {"score": 0.0026043035241045394, "phrase": "tissue-specific_transcripts"}, {"score": 0.0022744242010653997, "phrase": "positional_conservation"}, {"score": 0.002205079358459154, "phrase": "-conserved_loci"}, {"score": 0.0021213575697367148, "phrase": "starting_point"}], "paper_keywords": [""], "paper_abstract": "Motivation: Increasing evidences suggest that most of the genome is transcribed into RNAs, but many of them are not translated into proteins. All those RNAs that do not become proteins are called 'non-coding RNAs (ncRNAs)', which outnumbers protein-coding genes. Interestingly, these ncRNAs are shown to be more tissue specifically expressed than protein-coding genes. Given that tissue-specific expressions of transcripts suggest their importance in the expressed tissue, researchers are conducting biological experiments to elucidate the function of such ncRNAs. Owing greatly to the advancement of next-generation techniques, especially RNA-seq, the amount of high-throughput data are increasing rapidly. However, due to the complexity of the data as well as its high volume, it is not easy to re-analyze such data to extract tissue-specific expressions of ncRNAs from published datasets. Results: Here, we introduce a new knowledge database called 'C-It-Loci', which allows a user to screen for tissue-specific transcripts across three organisms: human, mouse and zebrafish. C-It-Loci is intuitive and easy to use to identify not only protein-coding genes but also ncRNAs from various tissues. C-It-Loci defines homology through sequence and positional conservation to allow for the extraction of species-conserved loci. C-It-Loci can be used as a starting point for further biological experiments.", "paper_title": "C-It-Loci: a knowledge database for tissue-enriched loci", "paper_id": "WOS:000365134400019"}