{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mechanical_impacts"}, {"score": 0.004351595642056769, "phrase": "custom-made_sensor"}, {"score": 0.004016485454498076, "phrase": "commercial_blueberry_mechanical_harvesters"}, {"score": 0.003770185129638344, "phrase": "blueberry_bushes"}, {"score": 0.003660452313567116, "phrase": "standard_operating_conditions"}, {"score": 0.0035091888798162176, "phrase": "impact_forces"}, {"score": 0.0034359094594153304, "phrase": "mechanical_harvesting_process"}, {"score": 0.0032800186243040663, "phrase": "slapper_and_sway_harvesters"}, {"score": 0.0030017207229983385, "phrase": "different_agitating_mechanisms"}, {"score": 0.0029639342245188203, "phrase": "surface_materials"}, {"score": 0.0023996317685956213, "phrase": "corresponding_measures"}, {"score": 0.002349467661235186, "phrase": "potential_bruise_damage"}, {"score": 0.002195866991284673, "phrase": "least_impacts"}, {"score": 0.0021590588269751816, "phrase": "current_mechanical_harvester_designs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bruise", " Accelerometer", " Instrumented sphere", " Sensing", " Highbush blueberry"], "paper_abstract": "Blueberry mechanical harvesters cause bruise damage to the fruit. The goal of this study was to test a custom-made sensor (berry impact recording device) to measure the quality and magnitude of mechanical impacts created by three major types of commercial blueberry mechanical harvesters (rotary, slapper, and sway). The sensor was mounted on blueberry bushes (cultivated) and harvested at standard operating conditions such that the sensor was detached and experienced the impact forces typically found during a mechanical harvesting process. The data collected by the sensor revealed that the slapper and sway harvesters generated not only larger number but also higher magnitude impacts than the rotary. Our analyses suggest that these disparities were mostly caused by different agitating mechanisms, contacting surface materials, and designs between the three harvesters. Results indicated that most impacts lasted 5-7 ms in all three harvesters. The distribution of the impacts showed that 90% of impacts from the rotary were less than 190 g and 90% of impacts from the slapper and sway were less than 250g. Corresponding measures were identified to reduce potential bruise damage in the harvesters. The information could be useful to select harvesters that create the least impacts and to improve current mechanical harvester designs. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Measurement of mechanical impacts created by rotary, slapper, and sway blueberry mechanical harvesters", "paper_id": "WOS:000331686000011"}