{"auto_keywords": [{"score": 0.042530037163362074, "phrase": "watson-crick"}, {"score": 0.00481495049065317, "phrase": "watson-crick_bordered_words"}, {"score": 0.004588891098290524, "phrase": "finite_strings"}, {"score": 0.004278807087784626, "phrase": "dna_computing"}, {"score": 0.003378385493203297, "phrase": "affected_dna_string"}, {"score": 0.003334309053314909, "phrase": "future_interactions"}, {"score": 0.0031775430407770026, "phrase": "dna_single_string"}, {"score": 0.0029755458462182565, "phrase": "hairpin-like_structure"}, {"score": 0.002898378776839434, "phrase": "mathematical_formalization"}, {"score": 0.002860546817196148, "phrase": "particular_case"}, {"score": 0.002737960968372391, "phrase": "watson-crick_bordered_word"}, {"score": 0.0024864020775253767, "phrase": "algebraic_properties"}, {"score": 0.002453934333239467, "phrase": "bordered_and_unbordered_words"}, {"score": 0.0023902621773166963, "phrase": "complete_characterization"}, {"score": 0.002359046870732839, "phrase": "syntactic_monoid"}, {"score": 0.0021516366862117707, "phrase": "watson-crick_complement_function"}, {"score": 0.0021049977753042253, "phrase": "arbitrary_antimorphic_involution"}], "paper_keywords": [""], "paper_abstract": "DNA strands that, mathematically speaking, are finite strings over the alphabet {A, G, C, T} are used in DNA computing to encode information. Due to the fact that A is Watson-Crick complementary to T and G to C, DNA single strands that are Watson-Crick complementary can bind to each other or to themselves in either intended or unintended ways. One of the structures that is usually undesirable for biocomputation, since it makes the affected DNA string unavailable for future interactions, is the hairpin: If some subsequences of a DNA single string are complementary to each other, the string will bind to itself forming a hairpin-like structure. This paper studies a mathematical formalization of a particular case of hairpins, the Watson-Crick bordered words. A Watson-Crick bordered word is a word with the property that it has a prefix that is Watson-Crick complementary to its suffix. We namely study algebraic properties of Watson-Crick bordered and unbordered words. We also give a complete characterization of the syntactic monoid of the language consisting of all Watson-Crick bordered words over a given alphabet. Our results hold for the more general case where the Watson-Crick complement function is replaced by an arbitrary antimorphic involution.", "paper_title": "WATSON-CRICK BORDERED WORDS AND THEIR SYNTACTIC MONOID", "paper_id": "WOS:000260806500007"}