{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "partially_known_constraints"}, {"score": 0.004763895422211728, "phrase": "distributed_constraint_satisfaction_problems"}, {"score": 0.004444921827311577, "phrase": "standard_model"}, {"score": 0.00439777299939725, "phrase": "discsp_search_algorithms"}, {"score": 0.003910879154656061, "phrase": "binary_constraint"}, {"score": 0.0035908627899097407, "phrase": "new_discsp_model"}, {"score": 0.003261934055562238, "phrase": "value_assignments"}, {"score": 0.0029630461161780203, "phrase": "new_asynchronous_backtracking_algorithm"}, {"score": 0.0027495914857929584, "phrase": "two-phase_asynchronous_backtracking_algorithm"}, {"score": 0.0026345758986796703, "phrase": "new_algorithm"}, {"score": 0.0023424328921363585, "phrase": "quantitative_measure"}, {"score": 0.0022806798371116698, "phrase": "extensive_experimental_evaluation"}, {"score": 0.0021049977753042253, "phrase": "different_algorithms"}], "paper_keywords": ["Distributed CSPs", " Asynchronous search", " Privacy", " Entropy"], "paper_abstract": "Distributed constraint satisfaction problems (DisCSPs) are composed of agents connected by constraints. The standard model for DisCSP search algorithms uses messages containing assignments of agents. It assumes that constraints are checked by one of the two agents involved in a binary constraint, hence the constraint is fully known to both agents. This paper presents a new DisCSP model in which constraints are kept private and are only partially known to agents. In addition, value assignments can also be kept private to agents and not be circulated in messages. Two versions of a new asynchronous backtracking algorithm that work with partially known constraints (PKC) are presented. One is a two-phase asynchronous backtracking algorithm and the other uses only a single phase. Another new algorithm preserves the privacy of assignments by performing distributed forward-checking (DisFC). We propose to use entropy as quantitative measure for privacy. An extensive experimental evaluation demonstrates a trade-off between preserving privacy and the efficiency of search, among the different algorithms.", "paper_title": "Distributed constraint satisfaction with partially known constraints", "paper_id": "WOS:000264319700003"}