{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "total_weighted_completion_time"}, {"score": 0.043736880688080224, "phrase": "product_type"}, {"score": 0.004688989566904871, "phrase": "flexible_environment"}, {"score": 0.0046477357199085035, "phrase": "uniform_machines"}, {"score": 0.004235793609579307, "phrase": "k_different_product_types"}, {"score": 0.0034714553759044664, "phrase": "different_machines"}, {"score": 0.0032919615578986816, "phrase": "positive_weight"}, {"score": 0.003191560305761507, "phrase": "completion_time"}, {"score": 0.0031079352545607267, "phrase": "finish_time"}, {"score": 0.002697474061842142, "phrase": "preemptive_case"}, {"score": 0.002661883310629088, "phrase": "worst_case_bounds"}, {"score": 0.002382936364692606, "phrase": "worst-case_bounds"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["analysis of algorithms", " order scheduling", " flexible machines", " uniform machines", " heuristics"], "paper_abstract": "We consider the scheduling of orders in an environment with m uniform machines in parallel. Each order requests certain amounts of k different product types. Each product type can be produced by any one of the m machines. No setup is required if a machine switches over from one product type to another. Different product types intended for the same order can be produced at the same time (concurrently) on different machines. Each order is released at time zero and has a positive weight. Preemptions are allowed. The completion time of an order is the finish time of the product type that is completed last for that order. The objective is to minimize the total weighted completion time. We propose heuristics for the non-preemptive as well as the preemptive case and obtain worst case bounds that are a function of the number of machines as well as the differences in the speeds of the machines. Even though the worst-case bounds we showed for the two heuristics are not very tight, our experimental results show that they yield solutions that are very close to optimal. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Minimizing total weighted completion time when scheduling orders in a flexible environment with uniform machines", "paper_id": "WOS:000247286600007"}