{"auto_keywords": [{"score": 0.04762987004578423, "phrase": "second_life"}, {"score": 0.040691162217611467, "phrase": "virtual_worlds"}, {"score": 0.00481495049065317, "phrase": "virtual_world"}, {"score": 0.003468287913322258, "phrase": "ongoing_project"}, {"score": 0.003356331073566731, "phrase": "ibm"}, {"score": 0.0031845067058084583, "phrase": "iowa_state_university"}, {"score": 0.0031223774204093713, "phrase": "wright_state_university"}, {"score": 0.00290473242917264, "phrase": "creative_design_project"}, {"score": 0.0027200305495826797, "phrase": "mba_students"}, {"score": 0.002464709648714996, "phrase": "ibm_power_systems"}, {"score": 0.0023850311572318496, "phrase": "ibm_servers"}, {"score": 0.0021049977753042253, "phrase": "future_research_directions"}], "paper_keywords": ["Co-Creation", " Collaboration", " Education", " IBM Power Systems", " Second Life", " Virtual Worlds"], "paper_abstract": "One of the most successful and useful implementations of 3D virtual worlds is in the area of education and training. This paper discusses the use of virtual worlds in education and describes an innovative 3D visualization design project using one of the most popular virtual worlds, Second Life. This ongoing project is a partnership between IBM and three universities in the United States: the University of Nebraska-Lincoln, Iowa State University, and Wright State University. More than 400 MBA students have participated in this project by completing a creative design project that involves co-creation and collaboration in Second Life. The MBA students from the three universities worked in pairs to create designs to represent concepts related to IBM Power Systems, a family of IBM servers. The paper discusses observations and reflections on the 3D visualization design project. The paper concludes with a discussion of future research directions in applying virtual worlds in education.", "paper_title": "Co-Creation and Collaboration in a Virtual World: A 3D Visualization Design Project in Second Life", "paper_id": "WOS:000283996000001"}