{"auto_keywords": [{"score": 0.04180180938967789, "phrase": "strategic_alignment"}, {"score": 0.005606024314559128, "phrase": "organizational_performance"}, {"score": 0.00481495049065317, "phrase": "information_technology_governance_mechanisms"}, {"score": 0.004626796109657584, "phrase": "matched_survey"}, {"score": 0.004543708337879809, "phrase": "managers._previous_research"}, {"score": 0.004494570360108983, "phrase": "different_types"}, {"score": 0.004445961412092278, "phrase": "contingency_factors"}, {"score": 0.004413846562278824, "phrase": "information_technology_governance"}, {"score": 0.004287680323820891, "phrase": "valuable_work"}, {"score": 0.004060718465754644, "phrase": "detailed_argument"}, {"score": 0.0038737214010638745, "phrase": "top_priority"}, {"score": 0.00376293585033711, "phrase": "theory-based_empirical_research"}, {"score": 0.0034491650585057754, "phrase": "nomological_model"}, {"score": 0.0034118234596993836, "phrase": "organizational_value"}, {"score": 0.003290237137651949, "phrase": "resource-based_view"}, {"score": 0.002993947751499058, "phrase": "knowledge_bases"}, {"score": 0.0029082496141037764, "phrase": "dyadic_data"}, {"score": 0.002814759530655965, "phrase": "archival_data"}, {"score": 0.0022884433286785165, "phrase": "theory_base"}, {"score": 0.0021049977753042253, "phrase": "organizational_goals"}], "paper_keywords": ["IT governance mechanisms", " strategic alignment", " organizational performance", " degree-symmetric measures"], "paper_abstract": "Previous research has proposed different types for and contingency factors affecting information technology governance. Yet, in spite of this valuable work, it is still unclear through what mechanisms IT governance affects organizational performance. We make a detailed argument for the mediation of strategic alignment in this process. Strategic alignment remains a top priority for business and IT executives, but theory-based empirical research on the relative importance of the factors affecting strategic alignment is still lagging. By consolidating strategic alignment and IT governance models, this research proposes a nomological model showing how organizational value is created through IT governance mechanisms. Our research model draws upon the resource-based view of the firm and provides guidance on how strategic alignment can mediate the effectiveness of IT governance on organizational performance. As such, it contributes to the knowledge bases of both alignment and IT governance literatures. Using dyadic data collected from 131 Taiwanese companies (cross-validated with archival data from 72 firms), we uncover a positive, significant, and impactful linkage between IT governance mechanisms and strategic alignment and, further, between strategic alignment and organizational performance. We also show that the effect of IT governance mechanisms on organizational performance is fully mediated by strategic alignment. Besides making contributions to construct and measure items in this domain, this research contributes to the theory base by integrating and extending the literature on IT governance and strategic alignment, both of which have long been recognized as critical for achieving organizational goals.", "paper_title": "HOW INFORMATION TECHNOLOGY GOVERNANCE MECHANISMS AND STRATEGIC ALIGNMENT INFLUENCE ORGANIZATIONAL PERFORMANCE: INSIGHTS FROM A MATCHED SURVEY OF BUSINESS AND IT MANAGERS", "paper_id": "WOS:000361601700011"}