{"auto_keywords": [{"score": 0.04274513479815325, "phrase": "data_exchange"}, {"score": 0.0359899463838299, "phrase": "incomplete_information"}, {"score": 0.03203672531011221, "phrase": "cwa"}, {"score": 0.02805752257804135, "phrase": "universal_solutions"}, {"score": 0.00481495049065317, "phrase": "translating_data"}, {"score": 0.004752954376588157, "phrase": "source_format"}, {"score": 0.004661446705304497, "phrase": "target_format"}, {"score": 0.004440277230269978, "phrase": "possibly_constraints"}, {"score": 0.004354763128496983, "phrase": "answering_queries"}, {"score": 0.004107935669507044, "phrase": "theoretical_foundations"}, {"score": 0.0038499929374478125, "phrase": "counterintuitive_or_anomalous_answers"}, {"score": 0.0038003739322536156, "phrase": "present_article"}, {"score": 0.0036081880905161606, "phrase": "invented_information"}, {"score": 0.0035043714971173252, "phrase": "source_instance"}, {"score": 0.003392507399258166, "phrase": "target_instances"}, {"score": 0.0031690434364310435, "phrase": "closed_and_open_world_semantics"}, {"score": 0.002941100683384888, "phrase": "closed_world_assumption"}, {"score": 0.0029126002350975634, "phrase": "data_exchange_settings"}, {"score": 0.002366110899738696, "phrase": "minimal_cwa-solution"}, {"score": 0.002312925203110055, "phrase": "uniquemaximal_cwa-solution"}, {"score": 0.0021394674440767124, "phrase": "well-known_anomalies"}, {"score": 0.0021049977753042253, "phrase": "new_semantics"}], "paper_keywords": ["Theory", " Closed world assumption", " null values", " certain answers", " maybe answers", " canonical universal solution", " core", " the chase", " databases"], "paper_abstract": "Data exchange deals with translating data structured in some source format into data structured in some target format, given a specification of the relationship between the source and the target and possibly constraints on the target; and answering queries over the target in a way that is semantically consistent with the information in the source. Theoretical foundations of data exchange have been actively explored recently. It was also noticed that the standard semantics for query answering in data exchange may lead to counterintuitive or anomalous answers. In the present article, we explain that this behavior is due to the fact that solutions can contain invented information (information that is not related to the source instance), and that the presence of incomplete information in target instances has been ignored. In particular, proper query evaluation techniques for databases with nulls have not been used, and the distinction between closed and open world semantics has not been made. We present a concept of solutions, called CWA-solutions, that is based on the closed world assumption. For data exchange settings without constraints on the target, the space of CWA-solutions has two extreme points: the canonical universal solution (the maximal CWA-solution) and the core of the universal solutions (the minimal CWA-solution), both of them well studied in data exchange. In the presence of constraints on the target, the core of the universal solutions is still the minimal CWA-solution, but there may be no uniquemaximal CWA-solution. We show how to define the semantics of query-answering taking into account incomplete information, and show that some of the well-known anomalies go away with the new semantics. The article also contains results on the complexity of query-answering, upper approximations to queries (maybe-answers), and various extensions.", "paper_title": "Closed World Data Exchange", "paper_id": "WOS:000291244300007"}