{"auto_keywords": [{"score": 0.049781331549484456, "phrase": "digital_literacy"}, {"score": 0.01983840000286919, "phrase": "ec"}, {"score": 0.00671125979901558, "phrase": "online_learning"}, {"score": 0.00481495049065317, "phrase": "critical_components"}, {"score": 0.004681724410889531, "phrase": "growing_prominence"}, {"score": 0.004552167735445606, "phrase": "educational_tools"}, {"score": 0.004495738533629062, "phrase": "learners'_digital_literacy"}, {"score": 0.003956012816350168, "phrase": "information_sources"}, {"score": 0.0034162643819889054, "phrase": "additional_empirical_research"}, {"score": 0.0032803844011304283, "phrase": "digital_environments"}, {"score": 0.002814913791165247, "phrase": "alternative_techniques"}, {"score": 0.002461044825190643, "phrase": "data-driven_approach"}, {"score": 0.0022975271236026014, "phrase": "future_research"}, {"score": 0.0022268288922192704, "phrase": "relative_contribution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Self-regulated learning", " Epistemic cognition", " Think-aloud protocols", " Digital literacy"], "paper_abstract": "The growing prominence of the Internet, and other digital environments, as educational tools requires research regarding learners' digital literacy. We argue that two critical aspects of digital literacy are the ability to effectively plan and monitor the efficacy of strategies used to search and manage the wealth of information available online, and the knowledge to appropriately vet and integrate those information sources. Therefore, digital literacy requires effective self-regulated learning (SRL) skills, and availing epistemic cognition (EC). Although numerous researchers and scholars have examined the role of SRL in online learning (e.g., Efklides, 2011; Lee & Tsai, 2010; Williams & Hellman, 2004; Winters, Greene, & Costich, 2008), there is a need for additional empirical research on how SRL and EC interact, and relate to learning in digital environments. In this study, we used a powerful, but little-used data collection methodology, think-aloud protocol (TAP) analysis, to investigate the relations among SRL, EC, and learning gains with 20 college students who studied vitamins on the Internet. We also contributed to the literature by exploring alternative techniques for preparing, analyzing, and representing these data, accounting for the strengths and challenges of TAPs. We found that, on average, participants did increase their understanding as a result of learning with the Internet, and that a data-driven approach to understanding relations among SRL, EC, and learning yielded the most powerful representation of these phenomena. Our study has implications for future research on digital literacy using TAPs, as well as the relative contribution of SRL and EC, as aspects of digital literacy, to online learning. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Measuring critical components of digital literacy and their relationships with learning", "paper_id": "WOS:000336820700005"}