{"auto_keywords": [{"score": 0.036248663740954805, "phrase": "expected_profiles"}, {"score": 0.013183805771698306, "phrase": "fill-up_level"}, {"score": 0.010150619297186091, "phrase": "external_profiles"}, {"score": 0.004642896759431986, "phrase": "diverse_contexts"}, {"score": 0.004127094600862448, "phrase": "trie_parameters"}, {"score": 0.0036683842424190378, "phrase": "unusually_intriguing_and_interesting_behavior"}, {"score": 0.003629291866667764, "phrase": "detailed_study"}, {"score": 0.003537155405923517, "phrase": "random_strings"}, {"score": 0.00350696416714684, "phrase": "memoryless_source"}, {"score": 0.003388745581055085, "phrase": "possible_ranges"}, {"score": 0.0032956238475359534, "phrase": "tries_exhibit"}, {"score": 0.0030573959252626695, "phrase": "exponential_rate"}, {"score": 0.002812113238327984, "phrase": "asymmetric_tries"}, {"score": 0.0027406653437581875, "phrase": "symmetric_tries"}, {"score": 0.0026882700311968025, "phrase": "random_tries"}, {"score": 0.002608744950946475, "phrase": "central_limit_theorem"}, {"score": 0.002564360070426064, "phrase": "also_the_widest_levels"}, {"score": 0.0025315664299815537, "phrase": "linear_number"}, {"score": 0.002368680408758455, "phrase": "central_limit_theorems"}, {"score": 0.002288744855588159, "phrase": "poisson_laws"}, {"score": 0.002240157754686313, "phrase": "typical_behaviors"}, {"score": 0.002216251512062482, "phrase": "shortest_path"}, {"score": 0.0021460493723247905, "phrase": "analytic_algorithmics"}, {"score": 0.0021186275824349723, "phrase": "mellin"}, {"score": 0.002104999499520222, "phrase": "poissonization"}], "paper_keywords": ["digital trees", " tries", " profile", " depth", " height", " shortest path", " fill-up level", " analytic Poissonization", " Mellin transform", " saddle-point method", " singularity analysis"], "paper_abstract": "Tries (from retrieval) are one of the most popular data structures on words. They are pertinent to the (internal) structure of stored words and several splitting procedures used in diverse contexts. The profile of a trie is a parameter that represents the number of nodes (either internal or external) with the same distance from the root. It is a function of the number of strings stored in a trie and the distance from the root. Several, if not all, trie parameters such as height, size, depth, shortest path, and fill-up level can be uniformly analyzed through the (external and internal) profiles. Although profiles represent one of the most fundamental parameters of tries, they have hardly been studied in the past. The analysis of profiles is surprisingly arduous, but once it is carried out it reveals unusually intriguing and interesting behavior. We present a detailed study of the distribution of the profiles in a trie built over random strings generated by a memoryless source. We first derive recurrences satisfied by the expected profiles and solve them asymptotically for all possible ranges of the distance from the root. It appears that profiles of tries exhibit several fascinating phenomena. When moving from the root to the leaves of a trie, the growth of the expected profiles varies. Near the root, the external profiles tend to zero at an exponential rate, and then the rate gradually rises to being logarithmic; the external profiles then abruptly tend to infinity, first logarithmically and then polynomially; they then tend polynomially to zero again. Furthermore, the expected profiles of asymmetric tries are oscillating in a range where profiles grow polynomially, while symmetric tries are nonoscillating, in contrast to most shape parameters of random tries studied previously. Such a periodic behavior for asymmetric tries implies that the depth satisfies a central limit theorem but not a local limit theorem of the usual form. Also the widest levels in symmetric tries contain a linear number of nodes, differing from the order n/root log n for asymmetric tries, n being the size of the trees. Finally, it is observed that profiles satisfy central limit theorems when the variance goes unbounded, while near the height they are distributed according to Poisson laws. As a consequence of these results we find typical behaviors of the height, shortest path, fill-up level, and depth. These results are derived here by methods of analytic algorithmics such as generating functions, Mellin transform, Poissonization and de-Poissonization, the saddle-point method, singularity analysis, and uniform asymptotic analysis.", "paper_title": "PROFILES OF TRIES", "paper_id": "WOS:000208048500003"}