{"auto_keywords": [{"score": 0.03795799212966325, "phrase": "static_animations"}, {"score": 0.036870908187154466, "phrase": "floating_animations"}, {"score": 0.03478590189110075, "phrase": "performance_time"}, {"score": 0.015487882988172833, "phrase": "visual_search"}, {"score": 0.01265013058252135, "phrase": "visual_search_performance"}, {"score": 0.012133277828184536, "phrase": "german"}, {"score": 0.010576620826519277, "phrase": "animation_recognition"}, {"score": 0.009815361468861855, "phrase": "significant_differences"}, {"score": 0.009612105607093982, "phrase": "chinese_participants"}, {"score": 0.007889476399340893, "phrase": "randomly_floating_animations"}, {"score": 0.00481495049065317, "phrase": "rich_web_portal_design"}, {"score": 0.004630517016920072, "phrase": "chinese_web_portals"}, {"score": 0.004561468495520688, "phrase": "huge_amount"}, {"score": 0.004506968388996092, "phrase": "excessive_visual_stimuli"}, {"score": 0.004155670607078649, "phrase": "chinese_users"}, {"score": 0.004130760425485278, "phrase": "german_users"}, {"score": 0.003948613642680196, "phrase": "web_portal_design"}, {"score": 0.0037293858120998526, "phrase": "chinese"}, {"score": 0.0035328029694928296, "phrase": "large_squares"}, {"score": 0.003407549468745519, "phrase": "random_movement"}, {"score": 0.003356675879109443, "phrase": "web_portals"}, {"score": 0.003326515807982512, "phrase": "dependent_variables"}, {"score": 0.0031511440119092447, "phrase": "simple_web_portals"}, {"score": 0.003021141590548526, "phrase": "rich_web_portals"}, {"score": 0.0029139757013408926, "phrase": "german_participants"}, {"score": 0.0027686143852727156, "phrase": "simple_and_rich_web_portal_designs"}, {"score": 0.0025219085140220773, "phrase": "animation_movements"}, {"score": 0.002367368688024317, "phrase": "significantly_more_time"}, {"score": 0.0023390219342052623, "phrase": "searching_pages"}, {"score": 0.002290227534601535, "phrase": "users'_satisfaction"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": [""], "paper_abstract": "Unlike most Web portals in the world, Chinese Web portals are characterized by a huge amount of information, excessive visual stimuli, and very long Web pages. The objective of this study is to investigate the effect of such rich Web portal designs and floating animations on visual search, emphasizing a comparison between Chinese users and German users. Two experiments were conducted to test 2 proposed hypotheses. Experiment 1 studied the effect of Web portal design (rich and simple) on visual search performance (performance time, errors, and satisfaction) with both Chinese and German participants. Experiment 2 studied the effects of static animations (leaderboards, couplets, and large squares) and floating animations (moving down, moving up/down, and random movement) on visual search performance on Web portals. The dependent variables were the performance time, error, satisfaction, and animation recognition. The results indicated that participants using simple Web portals searched faster, made fewer errors, and were more satisfied than participants using rich Web portals. No significant differences were found between the performance time of Chinese participants and German participants. However, satisfaction of Chinese participants was found to be less influenced by the differences between simple and rich Web portal designs, compared with German participants. No significant differences were found in performance time and animation recognition between static animations and floating animations, which indicated that users are able to detect the pattern of animation movements and were able to avoid floating animations as well as static animations. People searching pages with randomly floating animations were found to use significantly more time compared with those searching pages with no animations. Furthermore, users' satisfaction for pages with randomly floating animations, moving down animations, and moving up/down animations was significantly lower than for pages with no animations. Implications for designers and for future research are discussed.", "paper_title": "The effect of rich web portal design and floating animations on visual search", "paper_id": "WOS:000247537100001"}