{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "ict_literacy"}, {"score": 0.02893348957990966, "phrase": "ict_literacy_curriculum"}, {"score": 0.014794261741296331, "phrase": "revised_ict_literacy_curriculum"}, {"score": 0.010723707948381421, "phrase": "isst"}, {"score": 0.008011929803070849, "phrase": "service_training_program"}, {"score": 0.0071458301161058625, "phrase": "korean_government"}, {"score": 0.004770627232703404, "phrase": "service_training"}, {"score": 0.004712173884809397, "phrase": "korea"}, {"score": 0.004640079189342692, "phrase": "ict_literacy_education"}, {"score": 0.004541005415688015, "phrase": "information_society"}, {"score": 0.0039281997063335735, "phrase": "application_programs"}, {"score": 0.0034400245101881936, "phrase": "computer_science"}, {"score": 0.0034188520484925546, "phrase": "problem-solving_methods"}, {"score": 0.003284361433827464, "phrase": "ict_literacy_inservice_training_curriculum"}, {"score": 0.0027036751290702406, "phrase": "service_training_curriculum"}, {"score": 0.0024643470263733674, "phrase": "'information_processing'_section"}, {"score": 0.002295277579105179, "phrase": "different_views"}, {"score": 0.0022531089868518235, "phrase": "ici'_literacy"}, {"score": 0.0021845387990972543, "phrase": "effective_teaching_strategies"}, {"score": 0.0021710766932077994, "phrase": "evaluation_methods"}, {"score": 0.0021049977753042253, "phrase": "training_curriculum"}], "paper_keywords": ["Country-specific development", " Pedagogical issues"], "paper_abstract": "The importance of ICT literacy education for students and teachers in the information society cannot be overemphasized. The Korean government had developed an ICT literacy curriculum for students and teachers since 2000. It announced the ICT literacy curriculum for students in 2000 and the ISST for teachers in 2002. Most contents of the ICT literacy curriculum and ISST focused on teaching the use of application programs. However, as the IT environment changes rapidly, the parties concerned thought that the revision of the ICT literacy curriculum and ISST is indispensable. Therefore, the Korean government announced the revised ICT literacy curriculum for students in 2005. The revised ICT literacy curriculum emphasized the principles of computer science and problem-solving methods. However, although the ICT literacy curriculum was revised, there was no ICT literacy inservice training curriculum to reflect the revised ICT literacy curriculum. In this research, we designed the contents of the ICT literacy in-service training program based on the revised ICT literacy curriculum. The contents of the ICT literacy in-service training program consist of four sections: the Information society, information devices, Information processing, and Information handling. The contents in each section of the ICT literacy in-service training curriculum are divided into two groups: mandatory and optional. There were several findings made in this study. After analyzing the opinions and requirements of experts and teachers, the 'Information processing' section was found to be the most important part of the ICT literacy in-service training program. It was found that the experts and teachers have different views on the contents of the ICI' literacy in-service training program. Also, we found that effective teaching strategies and evaluation methods should be provided for the ICT literacy in-service training curriculum to be effective. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Design of contents for ICT literacy in-service training of teachers in Korea", "paper_id": "WOS:000259945200021"}