{"auto_keywords": [{"score": 0.004684157900507474, "phrase": "power_unbalanced_polarization_division_multiplexing"}, {"score": 0.004138010495069077, "phrase": "standard_single_mode_fiber_and_erbium_doped_fiber_amplifiers"}, {"score": 0.004081385289516914, "phrase": "pupdm"}, {"score": 0.003997891221012094, "phrase": "quaternary_communication_scheme"}, {"score": 0.003459191419478298, "phrase": "binary_receivers"}, {"score": 0.003140888248194296, "phrase": "metropolitan_networks"}, {"score": 0.0030344301563232944, "phrase": "degrading_effect"}, {"score": 0.0029928611380840757, "phrase": "polarization_mode_dispersion"}, {"score": 0.0027741761880779535, "phrase": "effective_data_rate"}, {"score": 0.002680114113899346, "phrase": "fiber_nonlinearity"}, {"score": 0.0021789194955896102, "phrase": "transmission_distance"}, {"score": 0.0021490449563443025, "phrase": "single_mode_fiber"}], "paper_keywords": [""], "paper_abstract": "The feasibility of a 40 Gbit/s wavelength division multiplexed system using a power unbalanced polarization division multiplexing (PUPDM) scheme has been explored for metropolitan distances using the standard single mode fiber and erbium doped fiber amplifiers. PUPDM is a quaternary communication scheme in which two subchannels, each carrying 20 Gbit/s information data, are combined on the same wavelength to effectively communicate 40 Gbits/s using only binary transmitters and binary receivers. PUPDM not only reduces the cost of the optics and electronics in metropolitan networks but also reduces the degrading effect of polarization mode dispersion (PMD) by actually transmitting at half of the effective data rate. The effects of fiber nonlinearity and PMD are extensively analyzed for each of two 20Gbit/s subchannels for an aggregate 40 Gbit/s capacity per wavelength channel. The analysis suggests that a 40 Gbit/s PUPDM system with 50 GHz channel spacing is feasible for up to 600 km of transmission distance on single mode fiber, using 7% Reed - Solomon forward error correction and 20 Gbit/s electronics. (C) 2006 Optical Society of America.", "paper_title": "40 Gbit/s Metropolitan networks using power unbalanced polarization division multiplexing", "paper_id": "WOS:000237415900002"}