{"auto_keywords": [{"score": 0.004589763483242731, "phrase": "orlikowski"}, {"score": 0.004553265746584226, "phrase": "iacono"}, {"score": 0.0044101380740283825, "phrase": "information_technology"}, {"score": 0.004322967486451877, "phrase": "information_systems_research"}, {"score": 0.003729065012001506, "phrase": "rich_conceptualizations"}, {"score": 0.003640730820018083, "phrase": "iacono_paper"}, {"score": 0.0035973486787314883, "phrase": "strong_anchor_point"}, {"score": 0.003294566092612857, "phrase": "contemporary_is_research"}, {"score": 0.0030781126453776723, "phrase": "similar_analysis"}, {"score": 0.0027852927366010406, "phrase": "misq"}, {"score": 0.0027631038845413393, "phrase": "jais"}, {"score": 0.0027301771063065056, "phrase": "european"}, {"score": 0.0026654155072292707, "phrase": "ejis"}, {"score": 0.002560907803820395, "phrase": "drastic_advance"}, {"score": 0.0025202582748972122, "phrase": "deeper_engagement"}, {"score": 0.0022895278869126848, "phrase": "ensemble_view"}, {"score": 0.002199725773957207, "phrase": "north_american_and_european_journals"}], "paper_keywords": ["IT artifact", " technology conceptualization", " evolution of the IS disciplines"], "paper_abstract": "More than 10 years ago, Orlikowski and Iacono (2001) examined the conceptualization of Information Technology (IT) in Information Systems Research (ISR) articles published in the 1990s. Their main conclusion was that the majority of these articles did not properly conceptualize the IT artifact. They recommended that IS researchers start to theorize about the IT artifact and employ rich conceptualizations of IT. The Orlikowski and Iacono paper provides a strong anchor point from which to analyze the evolution of the IS discipline. In order to obtain an up-to-date image of contemporary IS research, and to assess how the IS field has evolved since the 1990s, we carried out a similar analysis on a more recent and broader set of articles, that is, the full set (N = 644) of papers published between 2006 and 2009 by six top North American (ISR, MISQ, JAIS) and European (JIT, ISJ, EJIS) journals. The statistics in our results reveal no drastic advance in terms of deeper engagement with the IT artifact; more than 39% of the articles in our set are virtually mute about the artifact, and less than 16% employ an ensemble view of IT. Moreover, we note differences among the North American and European journals. Implications of the findings for two perspectives central to the IS research legitimacy debate are discussed.", "paper_title": "The ongoing quest for the IT artifact: Looking back, moving forward", "paper_id": "WOS:000319666600006"}