{"auto_keywords": [{"score": 0.04444816239028331, "phrase": "nrc"}, {"score": 0.00481495049065317, "phrase": "healthcare_information_technology_outside_of"}, {"score": 0.00450933377534525, "phrase": "healthcare_research"}, {"score": 0.004363846362238565, "phrase": "national_resource_center"}, {"score": 0.004306968571854912, "phrase": "health_information_technology"}, {"score": 0.0036793800647811365, "phrase": "core_functions"}, {"score": 0.00329080576226637, "phrase": "common_challenges"}, {"score": 0.0032266093099550955, "phrase": "health_it_project_teams"}, {"score": 0.0031019373572233706, "phrase": "inappropriately_scoped_and_resourced_evaluation_efforts"}, {"score": 0.00290473242917264, "phrase": "data_collection"}, {"score": 0.002737960968372391, "phrase": "qualitative_methodologies"}, {"score": 0.0022480304016499605, "phrase": "current_and_future_implementers"}], "paper_keywords": [""], "paper_abstract": "The National Resource Center for Health Information Technology (NRC) was formed in the fall of 2004 as part of the Agency for Healthcare Research and Quality (AHRQ) health IT portfolio to support its grantees. One of the core functions of the NRC was to assist grantees in their evaluation efforts of Health IT. This manuscript highlights some common challenges experienced by health IT project teams at nonacademic institutions, including inappropriately scoped and resourced evaluation efforts, inappropriate choice of metrics, inadequate planning for data collection and analysis, and lack of consideration of qualitative methodologies. Many of these challenges can be avoided or overcome. The strategies adopted by various AHRQ grantees and the lessons learned from their projects should become part of the toolset for current and future implementers of health IT as the nation moves rapidly towards its widespread adoption.", "paper_title": "Evaluating Healthcare Information Technology Outside of Academia: Observations from the National Resource Center for Healthcare Information Technology at the Agency for Healthcare Research and Quality", "paper_id": "WOS:000269755500004"}