{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "generalized_recombination"}, {"score": 0.004757917303420435, "phrase": "exact_microscopic_model"}, {"score": 0.004609094651134046, "phrase": "netic_algorithm"}, {"score": 0.004447201233380302, "phrase": "new_model"}, {"score": 0.00435971969507033, "phrase": "genetic_material"}, {"score": 0.004206548500039536, "phrase": "standard_operators"}, {"score": 0.004010624853427534, "phrase": "particular_gene"}, {"score": 0.003885085477351673, "phrase": "parental_gene"}, {"score": 0.0034345152879289025, "phrase": "schema_dynamics"}, {"score": 0.0032355864829403413, "phrase": "corresponding_exact_schema_theorem"}, {"score": 0.0031718628581265266, "phrase": "qualitatively_new_phenomena"}, {"score": 0.0028715299874549245, "phrase": "two-locus_model"}, {"score": 0.002792638947473095, "phrase": "dynamical_behavior"}, {"score": 0.002558495760339272, "phrase": "gene_duplication"}, {"score": 0.0024981087707313656, "phrase": "homogeneous_and_heterogeneous_strings"}, {"score": 0.0022977342663599042, "phrase": "two-locus_results"}, {"score": 0.0022345720876241044, "phrase": "recombinative_genetic_algorithm"}, {"score": 0.0021218313648947926, "phrase": "exact_dynamical_equations"}], "paper_keywords": ["adaptive systems", " genetic algorithms (GAs)", " search methods"], "paper_abstract": "An exact microscopic model for the dynamics of a ge-, netic algorithm with generalized recombination is presented. Generalized recombination is a new model for the exchange of genetic material from parents to offspring that generalizes and subsumes standard operators, such as homologous crossover, inversion and duplication, and in which a particular gene in the offspring may originate from any parental gene. It is shown that the dynamics naturally coarse grains, the appropriate effective degrees of freedom being schemata that act as building blocks. It is shown that the Schema dynamics has the same. functional form as that of strings and we derive a corresponding exact Schema theorem. To exhibit the qualitatively new phenomena that can occur in the presence of generalized recombination, and to understand the biases of the operator, we derive a complete, exact solution for a two-locus model without selection, showing how the dynamical behavior is radically different to that of homologous crossover. Inversion is shown to potentially introduce oscillations in the dynamics, while gene duplication leads to an asymmetry between homogeneous and heterogeneous strings. All nonhomologous, operators lead to allele \"diffusion\" along the chromosome. We discuss how inferences from the two-locus results extend to the case of a recombinative genetic algorithm with selection and more than two loci providing evidence from an integration of the exact dynamical equations for more than two loci.", "paper_title": "Coarse-grained dynamics for generalized recombination", "paper_id": "WOS:000248579300008"}