{"auto_keywords": [{"score": 0.045336759182084824, "phrase": "buying_process"}, {"score": 0.02905624642465652, "phrase": "collaborative_conversational_recommender"}, {"score": 0.0046340196745259694, "phrase": "e-commerce_websites"}, {"score": 0.003997343989408636, "phrase": "users'_preferences"}, {"score": 0.0038893838564184107, "phrase": "valuable_instruments"}, {"score": 0.003602302241898501, "phrase": "alternative_interface"}, {"score": 0.0033363396054797044, "phrase": "richer_visualisation"}, {"score": 0.003264010423431402, "phrase": "interaction_possibilities"}, {"score": 0.002989991779830814, "phrase": "novel_framework"}, {"score": 0.002925149105307855, "phrase": "interactive_recommendation_systems"}, {"score": 0.0027090686152198133, "phrase": "ccr"}, {"score": 0.0021049977753042253, "phrase": "perceived_efficiency"}], "paper_keywords": ["Collaborative Conversational Recommenders", " Intelligent Collaborative 3D Interface", " 3D Virtual Worlds"], "paper_abstract": "Nowadays e-commerce websites offer users such a huge amount of products, which far from facilitating the buying process, actually make it more difficult. Hence, recommenders, which learn from users' preferences, are consolidating as valuable instruments to enhance the buying process in the 2D Web. Indeed, 3D virtual environments are an alternative interface for recommenders. They provide the user with an immersive 3D social experience, enabling a richer visualisation and increasing the interaction possibilities with other users and with the recommender. In this paper, we focus on a novel framework to tightly integrate interactive recommendation systems in a 3D virtual environment. Specifically, we propose to integrate a Collaborative Conversational Recommender (CCR) in a 3D social virtual world. Our CCR Framework defines three layers: the user interaction layer (3D Collaborative Space Client), the communication layer (3D Collaborative Space Server), and the recommendation layer (Collaborative Conversational Recommender). Additionally, we evaluate the framework based on several usability criteria such as learnability, perceived efficiency and effectiveness. Results demonstrate that users positively valued the experience.", "paper_title": "A 3D Visual Interface for Critiquing-based Recommenders: Architecture and Interaction", "paper_id": "WOS:000362593800002"}