{"auto_keywords": [{"score": 0.049509300669177574, "phrase": "unstructured_peer-to-peer_networks"}, {"score": 0.0396420808818245, "phrase": "matching_resource"}, {"score": 0.03544401896528498, "phrase": "route_learning"}, {"score": 0.00481495049065317, "phrase": "unstructured_peer-to-peer_network"}, {"score": 0.004682294845981234, "phrase": "gnutella"}, {"score": 0.004608121749000898, "phrase": "query_messages"}, {"score": 0.004553265070135597, "phrase": "resource_holders"}, {"score": 0.004305740330804528, "phrase": "costly_operation"}, {"score": 0.0038655854071187115, "phrase": "query_message"}, {"score": 0.003294566092612857, "phrase": "query_traffic"}, {"score": 0.0030414140732789186, "phrase": "submitted_queries"}, {"score": 0.002530359917257626, "phrase": "user_submitted_queries"}, {"score": 0.002262209824105154, "phrase": "simulation_results"}, {"score": 0.0022085455097790537, "phrase": "pure_flooding"}, {"score": 0.0021049977753042253, "phrase": "user_satisfaction"}], "paper_keywords": ["P2P query routing", " Parzen Windows estimation", " Unstructured", " P2P networks", " Query caching"], "paper_abstract": "In unstructured peer-to-peer networks, such as Gnutella, peers propagate query messages towards the resource holders by flooding them through the network. This is, however, a costly operation since it consumes node and link resources excessively and often unnecessarily. There is no reason, for example, for a peer to receive a query message if the peer has no matching resource or is not on the path to a peer holding a matching resource. In this paper, we present a solution to this problem, which we call Route Learning, aiming to reduce query traffic in unstructured peer-to-peer networks. In Route Learning, peers try to identify the most likely neighbors through which replies can be obtained to submitted queries. in this way, a query is forwarded only to a subset of the neighbors of a peer, or it is dropped if no neighbor, likely to reply, is found. The scheme also has mechanisms to cope with variations in user submitted queries, like changes in the keywords. The scheme can also evaluate the route for a query for which it is not trained. We show through simulation results that when compared to a pure flooding based querying approach, our scheme reduces bandwidth overhead significantly without sacrificing user satisfaction. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Reducing query overhead through route learning in unstructured peer-to-peer network", "paper_id": "WOS:000266947800005"}