{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uml"}, {"score": 0.004485735417293941, "phrase": "expert_opinion"}, {"score": 0.0043194180167921165, "phrase": "'standard'_object-oriented_modelling_notation"}, {"score": 0.0036095259108028105, "phrase": "mapping_study"}, {"score": 0.0035085965086415474, "phrase": "relevant_empirical_studies"}, {"score": 0.003176986603753607, "phrase": "systematic_literature_review"}, {"score": 0.003132236287543072, "phrase": "empirical_studies"}, {"score": 0.0029594318330247614, "phrase": "main_categories"}, {"score": 0.002822712709335093, "phrase": "aggregated_results"}, {"score": 0.00266693888510356, "phrase": "model_quality"}, {"score": 0.002460825108719896, "phrase": "uml_models"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["UML", " systematic literature review"], "paper_abstract": "The Unified Modeling Language (UML) was created on the basis of expert opinion and has now become accepted as the 'standard' object-oriented modelling notation. Our objectives were to determine how widely the notations of the UML, and their usefulness, have been studied empirically, and to identify which aspects of it have been studied in most detail. We undertook a mapping study of the literature to identify relevant empirical studies and to classify them in terms of the aspects of the UML that they studied. We then conducted a systematic literature review, covering empirical studies published up to the end of 2008, based on the main categories identified. We identified 49 relevant publications, and report the aggregated results for those categories for which we had enough papers-metrics, comprehension, model quality, methods and tools and adoption. Despite indications that a number of problems exist with UML models, researchers tend to use the UML as a 'given' and seem reluctant to ask questions that might help to make it more effective. Copyright (C) 2010 John Wiley & Sons, Ltd.", "paper_title": "Empirical evidence about the UML: a systematic literature review", "paper_id": "WOS:000288080800002"}