{"auto_keywords": [{"score": 0.03897276857281093, "phrase": "cannabinoid_receptors"}, {"score": 0.028143527725570737, "phrase": "molecular_dynamics_simulations"}, {"score": 0.026784166591840207, "phrase": "binding_site"}, {"score": 0.00481495049065317, "phrase": "g_protein"}, {"score": 0.004796223652568968, "phrase": "coupled_receptors"}, {"score": 0.004233762728640565, "phrase": "centrally_located_rotamer_toggle_switch"}, {"score": 0.003781005930058317, "phrase": "central_part"}, {"score": 0.00373701482510911, "phrase": "membranous_domain"}, {"score": 0.003389704997952315, "phrase": "docking_procedure"}, {"score": 0.00331125524068286, "phrase": "ligand-receptor_conformations"}, {"score": 0.0032472646337850042, "phrase": "lowest_ligand-receptor_intermolecular_energy"}, {"score": 0.0031597433845085092, "phrase": "ligand_type"}, {"score": 0.0030865992688177005, "phrase": "rotamer_toggle_switch"}, {"score": 0.0030269369940823902, "phrase": "inactive_state"}, {"score": 0.0026095369186867707, "phrase": "different_binding_modes"}, {"score": 0.0022320551224679526, "phrase": "hydrophobic_nature"}], "paper_keywords": ["Cannabinoid receptors", " Docking", " Fenoterol", " GPCRs", " Molecular dynamics", " Molecular switches"], "paper_abstract": "Cannabinoid and adrenergic receptors belong to the class A (similar to rhodopsin) G protein coupled receptors. Docking of agonists and antagonists to CB1 and CB2 cannabinoid receptors revealed the importance of a centrally located rotamer toggle switch and its possible participation in the mechanism of agonist/antagonist recognition. The switch is composed of two residues, F3.36 and W6.48, located on opposite transmembrane helices TM3 and TM6 in the central part of the membranous domain of cannabinoid receptors. The CB1 and CB2 receptor models were constructed based on the adenosine A(2A) receptor template. The two best scored conformations of each receptor were used for the docking procedure. In all poses (ligand-receptor conformations) characterized by the lowest ligand-receptor intermolecular energy and free energy of binding the ligand type matched the state of the rotamer toggle switch: antagonists maintained an inactive state of the switch, whereas agonists changed it. In case of agonists of beta(2)AR, the (R,R) and (S,S) stereoisomers of fenoterol, the molecular dynamics simulations provided evidence of different binding modes while preserving the same average position of ligands in the binding site. The (S,S) isomer was much more labile in the binding site and only one stable hydrogen bond was created. Such dynamical binding modes may also be valid for ligands of cannabinoid receptors because of the hydrophobic nature of their ligand-receptor interactions. However, only very long molecular dynamics simulations could verify the validity of such binding modes and how they affect the process of activation.", "paper_title": "Modeling of ligand binding to G protein coupled receptors: cannabinoid CB1, CB2 and adrenergic beta(2)AR", "paper_id": "WOS:000294735900025"}