{"auto_keywords": [{"score": 0.048875919335697134, "phrase": "ta"}, {"score": 0.010614077959929026, "phrase": "bayesian"}, {"score": 0.010550373812972271, "phrase": "clinical_domains"}, {"score": 0.010286732535713954, "phrase": "clinical_data"}, {"score": 0.007456849468832835, "phrase": "clinical_systems"}, {"score": 0.00459393336391459, "phrase": "meaningful_higher-level_interval_concepts"}, {"score": 0.004469700997700534, "phrase": "temporal_bayesian_networks"}, {"score": 0.004426147608903962, "phrase": "temporal_extensions"}, {"score": 0.0044002186469797476, "phrase": "known_probabilistic_graphical_models"}, {"score": 0.004331811712726697, "phrase": "temporal_relationships"}, {"score": 0.003927625349474979, "phrase": "main_objective"}, {"score": 0.00385141330111392, "phrase": "key_aspects"}, {"score": 0.003776674472150248, "phrase": "important_benefits"}, {"score": 0.0037545358619312445, "phrase": "potential_integration"}, {"score": 0.0037106457585648345, "phrase": "medical_domains"}, {"score": 0.003589046900483573, "phrase": "high_level_views"}, {"score": 0.0035332058983966424, "phrase": "knowledge_representation"}, {"score": 0.00351938145050947, "phrase": "reasoning_tool"}, {"score": 0.0034578354532492483, "phrase": "clinical_tasks"}, {"score": 0.003337942783158393, "phrase": "latest_two_decades"}, {"score": 0.0032924448113309797, "phrase": "ta_techniques"}, {"score": 0.0032095822171392687, "phrase": "ta_concepts"}, {"score": 0.0031658283119347396, "phrase": "complex_temporal_abstractions"}, {"score": 0.0028701222153940283, "phrase": "extensive_comparative_analysis"}, {"score": 0.002847691227421257, "phrase": "separate_merits"}, {"score": 0.0027705505273051007, "phrase": "potential_gains"}, {"score": 0.0027060907634889734, "phrase": "unified_methodology"}, {"score": 0.0026796759817259985, "phrase": "surveyed_contributions"}, {"score": 0.0026483174683806137, "phrase": "respective_key_features"}, {"score": 0.0026019646284747024, "phrase": "tbn_methods"}, {"score": 0.0025866942081941516, "phrase": "unifying_clinical_domain"}, {"score": 0.0025364354691535117, "phrase": "main_conclusion"}, {"score": 0.002372730200261853, "phrase": "medical_decision-support_systems"}, {"score": 0.0023588019302482367, "phrase": "anticipated_key_benefits"}, {"score": 0.0023449552290156018, "phrase": "perceived_integration"}, {"score": 0.0022724642558935616, "phrase": "different_levels"}, {"score": 0.002223927963267319, "phrase": "complex_entities"}, {"score": 0.002180702259644951, "phrase": "model_building"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Temporal abstraction", " Temporal reasoning", " Bayesian networks", " Temporal Bayesian networks", " Medical knowledge-based systems"], "paper_abstract": "Objectives: Temporal abstraction (TA) of clinical data aims to abstract and interpret clinical data into meaningful higher-level interval concepts. Abstracted concepts are used for diagnostic, prediction and therapy planning purposes. On the other hand, temporal Bayesian networks (TBNs) are temporal extensions of the known probabilistic graphical models, Bayesian networks. TBNs can represent temporal relationships between events and their state changes, or the evolution of a process, through time. This paper offers a survey on techniques/methods from these two areas that were used independently in many clinical domains (e.g. diabetes, hepatitis, cancer) for various clinical tasks (e.g. diagnosis, prognosis). A main objective of this survey, in addition to presenting the key aspects of TA and TBNs, is to point out important benefits from a potential integration of TA and TBNs in medical domains and tasks. The motivation for integrating these two areas is their complementary function: TA provides clinicians with high level views of data while TBNs serve as a knowledge representation and reasoning tool under uncertainty, which is inherent in all clinical tasks. Methods: Key publications from these two areas of relevance to clinical systems, mainly circumscribed to the latest two decades, are reviewed and classified. TA techniques are compared on the basis of: (a) knowledge acquisition and representation for deriving TA concepts and (b) methodology for deriving basic and complex temporal abstractions. TBNs are compared on the basis of: (a) representation of time, (b) knowledge representation and acquisition, (c) inference methods and the computatidnal demands of the network, and (d) their applications in medicine. Results: The survey performs an extensive comparative analysis to illustrate the separate merits and limitations of various TA and TBN techniques used in clinical systems with the purpose of anticipating potential gains through an integration of the two techniques, thus leading to a unified methodology for clinical systems. The surveyed contributions are evaluated using frameworks of respective key features. In addition, for the evaluation of TBN methods, a unifying clinical domain (diabetes) is used. Conclusion: The main conclusion transpiring from this review is that techniques/methods from these two areas, that so far are being largely used independently of each other in clinical domains, could be effectively integrated in the context of medical decision-support systems. The anticipated key benefits of the perceived integration are: (a) during problem solving, the reasoning can be directed at different levels of temporal and/or conceptual abstractions since the nodes of the TBNs can be complex entities, temporally and structurally and (b) during model building, knowledge generated in the form of basic and/or complex abstractions, can be deployed in a TBN. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Temporal abstraction and temporal Bayesian networks in clinical domains: A survey", "paper_id": "WOS:000335109400001"}