{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "e-collaboration_capabilities"}, {"score": 0.006814605810553745, "phrase": "firm_performance"}, {"score": 0.0044101380740283825, "phrase": "e-business_strategic_alignment"}, {"score": 0.004153739859461064, "phrase": "time-lag_effect"}, {"score": 0.003959353513286997, "phrase": "research_hypotheses"}, {"score": 0.003912189642066724, "phrase": "field_survey"}, {"score": 0.0038348235692738783, "phrase": "research_model"}, {"score": 0.003640730820018083, "phrase": "oriana_database"}, {"score": 0.0034841647157189985, "phrase": "positive_and_significant_link"}, {"score": 0.0030292784088033838, "phrase": "one-year_time-lag_effect"}, {"score": 0.00255068452076921, "phrase": "e-business_strategies"}, {"score": 0.0024117603727471654, "phrase": "downstream_process"}, {"score": 0.002382987346529592, "phrase": "direct_sources"}, {"score": 0.002363995836370621, "phrase": "business_value"}, {"score": 0.0022895278869126848, "phrase": "e-selling_process"}, {"score": 0.002262209824105154, "phrase": "critical_business_strategy"}, {"score": 0.002199725773957207, "phrase": "intermediate_factors"}, {"score": 0.0021821915946356168, "phrase": "time-lag_effects"}, {"score": 0.0021389638834794136, "phrase": "significant_implications"}, {"score": 0.0021049977753042253, "phrase": "e-collaboration_literature"}], "paper_keywords": ["e-Alignment", " e-Collaboration capabilities", " Mediators", " Time-lag"], "paper_abstract": "Purpose - Based on the literature of IT strategic alignment and e-collaboration, the purpose of this paper is to specify how e-business strategic alignment (e-alignment) influences e-collaboration capabilities and improves firm performance, and whether the time-lag effect existed in this relationship. Design/methodology/approach - The authors tested the research hypotheses using a field survey of 145 Chinese corporations. The research model was validated using SmartPLS 2.0 with both subjective and objective data collected from the survey and Oriana database. Findings - The results support the notion of a positive and significant link between e-alignment and e-collaboration capabilities and between e-collaboration capabilities and firm performance. The authors also show that the effect of e-alignment on performance is fully mediated by e-collaboration capabilities and that e-collaboration with suppliers has a one-year time-lag effect on firm performance. Research limitations/implications - This research extends and integrates the literature on IT strategic alignment and e-collaboration, and explains why and how e-alignment generates firm performance. Practical implications - This paper includes two implications for managers. First, when formulating e-business strategies, managers should focus on establishing e-collaboration capabilities with partners. Second, the downstream process is the direct sources of business value. Managers should take the establishment of e-selling process as a critical business strategy. Originality/value - By focussed on intermediate factors and time-lag effects, this study provides significant implications for IT strategic alignment and e-collaboration literature.", "paper_title": "Mediation and time-lag analyses of e-alignment and e-collaboration capabilities", "paper_id": "WOS:000359055200007"}