{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "substructure_profiles"}, {"score": 0.02287677503051577, "phrase": "compound_libraries"}, {"score": 0.009978201688310376, "phrase": "specific_protein_target"}, {"score": 0.004410248125081398, "phrase": "signature_profile"}, {"score": 0.004364919932563366, "phrase": "common_substructures"}, {"score": 0.0036427316134070007, "phrase": "known_potency"}, {"score": 0.0036052633308076933, "phrase": "six_selected_kinases"}, {"score": 0.003405948098114941, "phrase": "binary_molecular_fingerprints"}, {"score": 0.003353521531649663, "phrase": "fingerprint_key"}, {"score": 0.0029467742734417255, "phrase": "frequent_pattern_mining_technique"}, {"score": 0.0027126684113045756, "phrase": "known_potent_inhibitors"}, {"score": 0.0026297428083782875, "phrase": "known_inactive_compounds"}, {"score": 0.0026026666736474404, "phrase": "vice_versa"}, {"score": 0.0025100713447593773, "phrase": "potent_inhibitors"}, {"score": 0.002298649369775623, "phrase": "significant_enrichment"}, {"score": 0.0022749744354271816, "phrase": "highly_potent_compounds"}, {"score": 0.0021601997088758957, "phrase": "conventional_methods"}], "paper_keywords": ["Correlation rules", " Substructure profiling", " Kinase", " Co-occurrence"], "paper_abstract": "Compounds known to be potent against a specific protein target may potentially contain a signature profile of common substructures that is highly correlated to their potency. These substructure profiles may be useful in enriching compound libraries or for prioritizing compounds against a specific protein target. With this objective in mind, a set of compounds with known potency against six selected kinases (2 each from 3 kinase families) was used to generate binary molecular fingerprints. Each fingerprint key represents a substructure that is found within a compound and the frequency with which the fingerprint occurs was then tabulated. Thereafter, a frequent pattern mining technique was applied with the aim of uncovering substructures that are not only well represented among known potent inhibitors but are also unrepresented among known inactive compounds and vice versa. Substructure profiles that are representative of potent inhibitors against each of the 3 kinase families were thus extracted. Based on our validation results, these substructure profiles demonstrated significant enrichment for highly potent compounds against their respective kinase targets. The advantages of using our approach over conventional methods in analyzing such datasets and its application in the mining of substructures for enriching compound libraries are presented.", "paper_title": "Extraction and validation of substructure profiles for enriching compound libraries", "paper_id": "WOS:000310464300003"}