{"auto_keywords": [{"score": 0.049534773865808054, "phrase": "plm"}, {"score": 0.015719687064822678, "phrase": "ubiquitous_technology"}, {"score": 0.01563104628672353, "phrase": "product_life_cycle_management"}, {"score": 0.015411590796457727, "phrase": "ubiquitous_computing"}, {"score": 0.004547356716604537, "phrase": "information_and_communication_services"}, {"score": 0.004209441837971891, "phrase": "manufacturing_sector"}, {"score": 0.004125993684094709, "phrase": "radio_frequency_identification"}, {"score": 0.00409073644076669, "phrase": "shop-floor_level"}, {"score": 0.003952682761005542, "phrase": "manufacturing_companies"}, {"score": 0.003690344014465526, "phrase": "environmental_considerations"}, {"score": 0.00362751627847987, "phrase": "important_topic"}, {"score": 0.00346513764367632, "phrase": "manufacturing_paradigm"}, {"score": 0.003396394281733363, "phrase": "product_life_cycle"}, {"score": 0.0033577243441658302, "phrase": "extended_scope"}, {"score": 0.0031437375178303625, "phrase": "existing_plm."}, {"score": 0.0028036279110177334, "phrase": "contents"}, {"score": 0.0027636009987260816, "phrase": "conditional_elements"}, {"score": 0.0025948026124758394, "phrase": "characteristic_elements"}, {"score": 0.0024432800937734898, "phrase": "conceptual_architecture"}, {"score": 0.002394760204469008, "phrase": "case_study"}, {"score": 0.0023742613449123217, "phrase": "proposed_concept"}, {"score": 0.0023337872991817154, "phrase": "automotive_press"}, {"score": 0.0022484395042896284, "phrase": "u-plm_environment"}, {"score": 0.0021600062298105776, "phrase": "distributed_environment"}, {"score": 0.0021049977753042253, "phrase": "related_knowledge"}], "paper_keywords": ["ubiquitous", " PLM (product life cycle management)", " u-PLM", " TMS (tryout management system)"], "paper_abstract": "Ubiquitous computing refers to an environment that enables people to use a variety of information and communication services by networking anywhere, anytime without any interruption. It has been already applied in various industries and in our daily lives. However, studies related to the manufacturing sector have been restricted to production using radio frequency identification at the shop-floor level. On the other hand, the scope of products, which manufacturing companies should manage, has been extending from just design and production to maintenance, repair and disposal, as production in the light of environmental considerations has been emerging as an important topic all over the world these days. That is, product life cycle management (PLM) as a manufacturing paradigm for managing all information during the product life cycle should cover that extended scope as well. To do this, in this article, the concept of ubiquitous technology (UT) is applied to the existing PLM. It is called u-PLM, which is an abbreviation for ubiquitous PLM. First, we define the concepts and characteristics of PLM and ubiquitous computing. Then, an approach for the implementation of u-PLM is explained with 5C (Computing, Communication, Connectivity, Contents and Calm) as conditional elements and 5Any (Any-time, Any-where, Any-network, Any-device and Any-service) as characteristic elements based on the points of view of existing 5C and 5Any, which are the aim of UT. Finally, a conceptual architecture is suggested for u-PLM. As a case study, the proposed concept is practically applied to an automotive press die shop. Based on the results, the basis of a u-PLM environment for manufacturing industries is established to seamlessly and accurately exchange information in a distributed environment and to collaborate and accumulate or use the related knowledge.", "paper_title": "Ubiquitous product life cycle management (u-PLM): a real-time and integrated engineering environment using ubiquitous technology in product life cycle management (PLM)", "paper_id": "WOS:000296271500003"}