{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "structure_maps"}, {"score": 0.015281404841477565, "phrase": "text_use"}, {"score": 0.013722900716781618, "phrase": "on-line_texts"}, {"score": 0.012532863847312206, "phrase": "multiple_texts"}, {"score": 0.004787500676821839, "phrase": "multiple_on-line_texts"}, {"score": 0.004586531354697466, "phrase": "mental_representation"}, {"score": 0.00409073644076669, "phrase": "specific_pieces"}, {"score": 0.0040096320322921715, "phrase": "search_performance"}, {"score": 0.0030549925653548826, "phrase": "simple_effect"}, {"score": 0.002918166770275602, "phrase": "greater_familiarity"}, {"score": 0.0028932006069319386, "phrase": "general_topic"}, {"score": 0.0028357713679488983, "phrase": "incidental_effects"}, {"score": 0.0025578967205807843, "phrase": "single_column"}, {"score": 0.0024999332729520084, "phrase": "oil_pages"}, {"score": 0.002401632317461758, "phrase": "multiple_electronic_texts"}, {"score": 0.0022940016281840564, "phrase": "vital_role"}, {"score": 0.002216448989443201, "phrase": "knowledge_updating"}, {"score": 0.0021724238169888456, "phrase": "important_consideration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "We propose that in many contexts of text use, people need to consult a mental representation of the mapping between the content or documents and their structure. We report three experiments that investigate the construction and use of such 'structure maps.' In each experiment people read multiple on-line texts oil the same topic, and then searched for specific pieces of information in those texts. Search performance was compared with people who had not read the texts. People who had read multiple texts were. to some extent, able to recall where information was ill the texts as shown by the locations in which they first searched (Experiments 1 and 2) or the number of pages opened during a search (Experiment 3). We also found that readers of multiple texts were able to find facts ill those texts faster than were people who had not read the texts, and that this speedup was not a simple effect of faster reading while scanning for facts (Experiments 1 and 2) or of greater familiarity with the general topic (Experiment 3). These incidental effects of reading occurred whether or not participants were warned before reading that they would have Subsequently to search the texts and were not compromised by transformations in the appearance of text (double column to single column) that disrupted the positions of facts oil pages (Experiment 2). We Conclude that readers spontaneously construct structure maps of multiple electronic texts, even when their reading goal stresses abstraction of meaning across sources. Structure maps likely play a vital role in many aspects Of text use, Such as re-reading and knowledge updating, so that their Support is all important consideration ill the design of on-line texts. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Constructing structure maps of multiple on-line texts", "paper_id": "WOS:000236475900005"}