{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mixed-attribute_data"}, {"score": 0.03920747363058631, "phrase": "ranked_list"}, {"score": 0.0273901230181267, "phrase": "proposed_approach"}, {"score": 0.004710306419574744, "phrase": "mixed-attribute_space"}, {"score": 0.004648609688625397, "phrase": "challenging_problem"}, {"score": 0.004220086640742953, "phrase": "automatic_mechanism"}, {"score": 0.003985602342418578, "phrase": "common_approach"}, {"score": 0.00395069818358908, "phrase": "outlier_identification"}, {"score": 0.0038647641000798135, "phrase": "outlier_score"}, {"score": 0.00355485940716082, "phrase": "major_problem"}, {"score": 0.0031151864044353245, "phrase": "user-specified_thresholds"}, {"score": 0.0030206579994328975, "phrase": "ad-hoc_threshold_values"}, {"score": 0.002717750004930131, "phrase": "principled_approach"}, {"score": 0.002670296619878048, "phrase": "bivariate_beta_mixture_model"}, {"score": 0.0024024377855956136, "phrase": "mixed-type_attribute"}, {"score": 0.0022787359717772976, "phrase": "feature_transformation"}, {"score": 0.0021613897794439227, "phrase": "mainstream_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data mining", " Outlier detection", " Mixed-attribute data", " Mixture model", " Bivariate beta"], "paper_abstract": "Outlier detection in mixed-attribute space is a challenging problem for which only a few approaches have been proposed. However, such existing methods suffer from the fact that there is a lack of an automatic mechanism to formally discriminate between outliers and inliers. In fact, a common approach to outlier identification is to estimate an outlier score for each object and then provide a ranked list of points, expecting outliers to come first. A major problem of such an approach is where to stop reading the ranked list? How many points should be chosen as outliers? Other methods, instead of outlier ranking, implement various strategies that depend on user-specified thresholds to discriminate outliers from inliers. Ad-hoc threshold values are often used. With such an unprincipled approach it is impossible to be objective or consistent. To alleviate these problems, we propose a principled approach based on the bivariate beta mixture model to identify outliers in mixed-attribute data. The proposed approach is able to automatically discriminate outliers from inliers and it can be applied to both mixed-type attribute and single-type (numerical or categorical) attribute data without any feature transformation. Our experimental study demonstrates the suitability of the proposed approach in comparison to mainstream methods. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "A practical outlier detection approach for mixed-attribute data", "paper_id": "WOS:000361923100023"}