{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "managerial_flexibility"}, {"score": 0.005389846525288342, "phrase": "different_approaches"}, {"score": 0.00475413908468027, "phrase": "performance_implications"}, {"score": 0.004724020632103649, "phrase": "purpose_-_this_paper"}, {"score": 0.004657058927135266, "phrase": "positive_implications"}, {"score": 0.004461359547152617, "phrase": "literature_review"}, {"score": 0.004404994123834589, "phrase": "main_dimensions"}, {"score": 0.0043080553835735825, "phrase": "firm_capability"}, {"score": 0.004186534737631288, "phrase": "business_environment"}, {"score": 0.0040298010803060495, "phrase": "proposed_model"}, {"score": 0.0036052633308076933, "phrase": "financial_flexibility"}, {"score": 0.0032150572968898923, "phrase": "static_perspective"}, {"score": 0.002733260122876447, "phrase": "managerial_practices"}, {"score": 0.002707275301442925, "phrase": "positive_effects"}, {"score": 0.0024527767211457046, "phrase": "financial_resources"}, {"score": 0.002429451930463481, "phrase": "-_three_contributions"}, {"score": 0.002215081186105616, "phrase": "interrelated_concepts"}, {"score": 0.0021049977753042253, "phrase": "firm_performance"}], "paper_keywords": ["management technique", " flexible learning", " performance levels"], "paper_abstract": "Purpose - This paper aims to propose a model to assess managerial flexibility and its determinants. Design/methodology/approach - The authors perform a literature review to identify the main dimensions of managerial flexibility. Flexibility as a firm capability to co-align the firm and the business environment permanently is deeply related to the notion of fit. The proposed model integrates different approaches to fit. Based on an empirical, transnational study, the research proposes a model for managerial flexibility. Findings - Three types of flexibility are measured: managerial flexibility, financial flexibility and metaflexibility. Financial flexibility and metaflexibility determine the degree of managerial flexibility, which in turn has positive implications for performance. Research limitations/implications - The variables included in the model are not exhaustive. The concept of fit implies a static perspective of flexibility. Practical implications - The results are useful both for researchers and for practitioners. Researchers can benefit from a review of managerial flexibility and a methodology that combines different approaches to fit: matching, covariation and profile deviation. Practitioners can learn that managerial flexibility, articulated in some managerial practices, has positive effects on performance when they are in line with the requirements of the environment. In order to activate these practices, firms should maintain a commitment to learning capabilities and financial resources. Originality/value - Three contributions are important for research. First, the paper proposes a model for explaining the nature of managerial flexibility. Second, it shows that flexibility and fit are interrelated concepts and that fit improves the measurability of flexibility. Third, managerial flexibility has positive implications for firm performance.", "paper_title": "Exploring managerial flexibility: determinants and performance implications", "paper_id": "WOS:000254568700005"}