{"auto_keywords": [{"score": 0.044781275067578244, "phrase": "argumentation_theory"}, {"score": 0.04251153857508317, "phrase": "pqcl"}, {"score": 0.039583159069269395, "phrase": "argumentation_framework"}, {"score": 0.015719716506582538, "phrase": "prioritized_qualitative_choice_logic"}, {"score": 0.004574247691703376, "phrase": "preferences_representation"}, {"score": 0.004509537745811511, "phrase": "qualitative_choice_logic"}, {"score": 0.0043953478557600565, "phrase": "best_option"}, {"score": 0.0043703658695579085, "phrase": "decision_making"}, {"score": 0.004116440453049531, "phrase": "preference_formalism"}, {"score": 0.003459191419478298, "phrase": "pqcl_theory"}, {"score": 0.0033811403330431897, "phrase": "major_problem"}, {"score": 0.0032860401904845522, "phrase": "existing_argumentation_frameworks"}, {"score": 0.0032487508969192293, "phrase": "absolute_status"}, {"score": 0.0027141207994340463, "phrase": "corresponding_vaf."}, {"score": 0.0026528362797828306, "phrase": "direct_relationship"}, {"score": 0.0026377320257839933, "phrase": "preferred_extensions"}, {"score": 0.0026152363154073707, "phrase": "corresponding_vaf"}, {"score": 0.0026003455833291124, "phrase": "preferred_models"}, {"score": 0.0025416235470290286, "phrase": "pqcl."}, {"score": 0.002286781334850213, "phrase": "decision_making_purposes"}, {"score": 0.0021413855297794946, "phrase": "preference_elicitation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Value-based argumentation framework", " Preferences", " PQCL formalism"], "paper_abstract": "The notion of preference is crucial in many fields. This justifies the development of many formalisms for preferences representation such as CP-nets, qualitative choice logic and its extensions. Preferences help to choose the best option in decision making, to compare between arguments in argumentation theory, etc. In this paper, we establish a link between a preference formalism, called Prioritized Qualitative Choice Logic (PQCL) and argumentation theory. We show that for any set of preferences expressed using PQCL (called PQCL theory), a Value-based Argumentation Framework (VAF) can be built. However, we point out some problems related to the evaluation of arguments which does not guarantee the correspondence between elements of PQCL theory and those of its associated VAF. We show that the major problem is due to the evaluation of arguments defined in existing argumentation frameworks, where an absolute status is assigned to each argument: objectively (or skeptically) accepted if it belongs to every extension, subjectively (or credulously) accepted if it is in some extensions and not in others and rejected if it does not belong to any extension. To deal with this problem, we propose to revise the evaluation of arguments in the corresponding VAF. As a result, there is a direct relationship between preferred extensions of the corresponding VAF and preferred models of a set of preferences expressed using PQCL. In addition, rank ordering the set of arguments is possible. The relationship between the two formalisms is interesting since on the one hand, it points out that one should be careful in using argumentation theory for decision making purposes or in formalizing a given problem as an argumentation framework and on the other hand, it makes it possible to use an argumentation framework for preference elicitation. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Value-based argumentation framework built from prioritized qualitative choice logic", "paper_id": "WOS:000359175800005"}