{"auto_keywords": [{"score": 0.04492795963065823, "phrase": "cf"}, {"score": 0.029726865079703676, "phrase": "resulting_trajectories"}, {"score": 0.00481495049065317, "phrase": "remd_simulations_reveal"}, {"score": 0.004345363360869553, "phrase": "cftr._cystic_fibrosis"}, {"score": 0.004072573194988867, "phrase": "cftr_chloride_channel"}, {"score": 0.0037554497046697432, "phrase": "first_nucleotide_binding_domain"}, {"score": 0.003519561814102764, "phrase": "thermally_unstable_domain"}, {"score": 0.00342568771304873, "phrase": "nonfunctioning_cftr_replica_exchange_md_simulations"}, {"score": 0.0030911702059432224, "phrase": "known_rescuing"}, {"score": 0.002714779217561487, "phrase": "biochemical_properties"}, {"score": 0.0026280534600940137, "phrase": "local_and_coupled_differences"}, {"score": 0.0025578967205807843, "phrase": "comparative_analysis"}, {"score": 0.0023841092222805253, "phrase": "different_perturbations"}, {"score": 0.0021049977753042253, "phrase": "mechanism-of-action_analysis"}], "paper_keywords": [""], "paper_abstract": "Cystic Fibrosis (CF) is a lethal, genetic disease caused by mutations to the CFTR chloride channel. The most common CF causing mutation is the deletion of F508 from the first Nucleotide Binding Domain (F508del-NBD1). This mutation leads to a thermally unstable domain and a misfolded, nonfunctioning CFTR Replica Exchange MD simulations were used to simulate seven NBD1 constructs including wt and F508del-NBD1 both alone and in the presence of known rescuing mutations as well as F508del-NBD1 in complex with a known small (ligand) stabilizer. Analyzing the resulting trajectories suggests that differences in the biochemical properties of the constructs result from local and coupled differences in their dynamic profiles. A comparative analysis of these profiles as well as of the resulting trajectories reveals how the different perturbations exert their deleterious, rescuing, and stabilizing effects on NBD1. These simulations may therefore be useful for the design and mechanism-of-action analysis of new NBD1 stabilizers.", "paper_title": "REMD Simulations Reveal the Dynamic Profile and Mechanism of Action of Deleterious, Rescuing, and Stabilizing Perturbations to NBD1 from CFTR", "paper_id": "WOS:000365465400006"}