{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "physical_objects"}, {"score": 0.005553716339390636, "phrase": "ubiquitous_memories_system"}, {"score": 0.004600389726895716, "phrase": "object-triggered_human_memory_augmentation_system"}, {"score": 0.004128192012388041, "phrase": "\"touching\"_operation"}, {"score": 0.003899385109646589, "phrase": "sense_organs"}, {"score": 0.0032302647179383915, "phrase": "prototype_system"}, {"score": 0.0031393948330209224, "phrase": "radio_frequency_identification"}, {"score": 0.003103776617907044, "phrase": "rfid"}, {"score": 0.0029483516334882862, "phrase": "rfid_tags"}, {"score": 0.0028328599839713866, "phrase": "first_experiment"}, {"score": 0.0027374647587075935, "phrase": "\"encoding_specificity_principle"}, {"score": 0.0026003455833291124, "phrase": "research_field"}, {"score": 0.0024700776739384977, "phrase": "second_experiment"}, {"score": 0.002373276186210053, "phrase": "system's_characteristics"}, {"score": 0.0021049977753042253, "phrase": "contextual_events"}], "paper_keywords": [""], "paper_abstract": "In this paper we propose an object-triggered human memory augmentation system named \"Ubiquitous Memories\" that enables a user to directly associate his/her experience data with physical objects by using a \"touching\" operation. A user conceptually encloses his/ her experiences gathered through sense organs into physical objects by simply touching an object. The user can also disclose and re-experience for himself/herself the experiences accumulated in an object by the same operation. We implemented a prototype system composed basically of a radio frequency identification (RFID) device. Physical objects are also attached to RFID tags. We conducted two experiments. The first experiment confirms a succession of the \"encoding specificity principle,\" which is well known in the research field of psychology, to the Ubiquitous Memories system. The second experiment aims at a clarification of the system's characteristics by comparing the system with other memory externalization strategies. The results show the Ubiquitous Memories system is effective for supporting memorization and recollection of contextual events.", "paper_title": "Ubiquitous Memories: a memory externalization system using physical objects", "paper_id": "WOS:000246339700007"}