{"auto_keywords": [{"score": 0.036362193903759596, "phrase": "new_method"}, {"score": 0.015719716506582538, "phrase": "modern_omics_research"}, {"score": 0.015360723358744994, "phrase": "multiple_data_sets"}, {"score": 0.01416667935257408, "phrase": "biological_system"}, {"score": 0.011400930126337618, "phrase": "covariance_matrices"}, {"score": 0.004436973156638976, "phrase": "data_tables"}, {"score": 0.004372655124839401, "phrase": "global_information"}, {"score": 0.004246790720119858, "phrase": "data_fusion"}, {"score": 0.0042220541146047825, "phrase": "multi-set_analysis"}, {"score": 0.00416083851254335, "phrase": "lively_research_topic"}, {"score": 0.0039824447174193955, "phrase": "group_means"}, {"score": 0.003959241745942114, "phrase": "treatment_effects"}, {"score": 0.003924689521676555, "phrase": "time_courses"}, {"score": 0.00369109045832434, "phrase": "individual_differences"}, {"score": 0.0033127168183223876, "phrase": "covariance_prototypes"}, {"score": 0.003293402989165798, "phrase": "simultaneous_components"}, {"score": 0.0032266841850427798, "phrase": "covariances_simultaneous_component_analysis"}, {"score": 0.003115428684709861, "phrase": "mathematical_terms"}, {"score": 0.003025642857503457, "phrase": "systems_biology_models"}, {"score": 0.0029992135990155374, "phrase": "differential_equations"}, {"score": 0.002929855464610305, "phrase": "real-life_biological_systems"}, {"score": 0.0028040908178009263, "phrase": "covsca."}, {"score": 0.0026915726427162705, "phrase": "human_and_plant_metabolomics_studies"}, {"score": 0.0026063337716985906, "phrase": "john_wiley"}, {"score": 0.002394299529213776, "phrase": "data_sets"}, {"score": 0.0022981869222589058, "phrase": "data_set"}], "paper_keywords": ["indirect fitting", " derived data", " INDSCAL", " IDIOSCAL", " multiblock data", " metabolomics"], "paper_abstract": "In modern omics research, it is more rule than exception that multiple data sets are collected in a study pertaining to the same biological organism. In such cases, it is worthwhile to analyze all data tables simultaneously to arrive at global information of the biological system. This is the area of data fusion or multi-set analysis, which is a lively research topic in chemometrics, bioinformatics, and biostatistics. Most methods of analyzing such complex data focus on group means, treatment effects, or time courses. There is also information present in the covariances among variables within a group, because this relates directly to individual differences, heterogeneity of responses, and changes of regulation in the biological system.We present a framework for analyzing covariance matrices and a new method that fits nicely in this framework. This new method is based on combining covariance prototypes using simultaneous components and is, therefore, coined Covariances Simultaneous Component Analysis (COVSCA). We present the framework and our new method in mathematical terms, thereby explaining the (dis)similarities of the methods.Systems biology models based on differential equations illustrate the type of variation generated in real-life biological systems and how this type of variation can be modeled within the framework and with COVSCA. The method is subsequently applied to two real-life data sets from human and plant metabolomics studies showing biologically meaningful results. Copyright (c) 2015 John Wiley & Sons, Ltd. In modern omics research, multiple data sets are often collected in a study pertaining to the same biological organism. In such cases, it is worthwhile to analyze all data sets simultaneously. There is information present in the covariances among variables within a data set. We present a framework for analyzing covariance matrices and a new method (Covariances Simultaneous Component Analysis) that fits nicely in this framework. The method is applied to two real-life metabolomics data sets showing biologically meaningful results.", "paper_title": "Covariances Simultaneous Component Analysis: a new method within a framework for modeling covariances", "paper_id": "WOS:000355229400002"}