{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "business_operations"}, {"score": 0.04129099571761686, "phrase": "technology-centric_framework"}, {"score": 0.004773904938276846, "phrase": "purpose_-_this_paper"}, {"score": 0.0045543011700929096, "phrase": "key_component"}, {"score": 0.00445783412174435, "phrase": "industrial_entities"}, {"score": 0.004382127278148236, "phrase": "key_management_theories"}, {"score": 0.004289291421348352, "phrase": "process-centric_views"}, {"score": 0.004252707756312684, "phrase": "industrial_management_research"}, {"score": 0.003692040748097991, "phrase": "case_studies"}, {"score": 0.003598317040926701, "phrase": "multiple_levels"}, {"score": 0.003447349911141396, "phrase": "theoretical_and_managerial_implications"}, {"score": 0.003331134183901191, "phrase": "\"trinity\"_framework"}, {"score": 0.003137074867443131, "phrase": "holistic_concept"}, {"score": 0.0029797347088361056, "phrase": "dynamic_view"}, {"score": 0.0029416448256236057, "phrase": "business_entities"}, {"score": 0.0027940789980683, "phrase": "transformational_resource"}, {"score": 0.002665305036900055, "phrase": "potential_facilitators"}, {"score": 0.0023942269247089277, "phrase": "today's_technology-intensive_environment"}, {"score": 0.0023434058350520763, "phrase": "business_processes"}, {"score": 0.002244969789802093, "phrase": "technological_development"}, {"score": 0.0021049977753042253, "phrase": "technology-organization-process_integration"}], "paper_keywords": ["Management theory", " Information technology"], "paper_abstract": "Purpose - This paper seeks to explore the necessity to incorporate technology as a key component in studying business operations of industrial entities. Design/methodology/approach - Reviews of key management theories that shaped organization-centric and process-centric views in industrial management research are conducted. The paper then identifies the limitations of these two schools of thinking and develops a technology-centric framework that integrates technology, organization, and process in general. A series of case studies that apply the framework at multiple levels of observations are presented. The research concludes with theoretical and managerial implications. Findings - This paper presents a \"trinity\" framework that includes three core constructs that can simultaneously develop into variants. Technology as a holistic concept must be taken into consideration when researchers or practitioners take a dynamic view to study business entities. A multi-dimensional, technology-centric framework acknowledges technology as the transformational resource and helps the practitioners and researchers to examine technology as potential facilitators for organizational, operations. Originality/value - A review of the cases found that technology, organizational structures, and business processes impact one another. Firms' actions are indicative that in today's technology-intensive environment, organizational structures and business processes need to be developed or modified in coordination with technological development. In doing so, organizations will gain the potential to harvest benefits from technology-organization-process integration.", "paper_title": "A technology-centric framework for investigating business operations", "paper_id": "WOS:000291136900010"}