{"auto_keywords": [{"score": 0.048266472457546096, "phrase": "irregular_volume_data"}, {"score": 0.015035136510628036, "phrase": "volume_datasets"}, {"score": 0.013279186950200842, "phrase": "volume_dataset"}, {"score": 0.010620468730230393, "phrase": "iso-surface_extraction"}, {"score": 0.00481495049065317, "phrase": "volume_decompression"}, {"score": 0.004486147558765763, "phrase": "modern_technology_advances"}, {"score": 0.004414593685834931, "phrase": "storage_constraint"}, {"score": 0.004247466494836417, "phrase": "volume_compression"}, {"score": 0.00415290083567118, "phrase": "volume_rendering"}, {"score": 0.00399564102224961, "phrase": "first_place"}, {"score": 0.003746613650522989, "phrase": "compressed_form"}, {"score": 0.003304624380309877, "phrase": "similar_integration"}, {"score": 0.0031085239972726106, "phrase": "dataset_decomposition_process"}, {"score": 0.003049041251374798, "phrase": "coordinate-based_decomposition"}, {"score": 0.003019726786531033, "phrase": "conventional_out-of-core_iso-surface_extraction_algorithms"}, {"score": 0.0028041227333229883, "phrase": "specific_range"}, {"score": 0.002697799358876857, "phrase": "layer_structure"}, {"score": 0.002654693503799094, "phrase": "out-of-core_iso-surface_extraction"}, {"score": 0.0025871484499191758, "phrase": "physical_memory_capacity"}, {"score": 0.0022889932805175406, "phrase": "query_value"}, {"score": 0.002252404639706065, "phrase": "entire_dataset"}, {"score": 0.0021049977753042253, "phrase": "traditional_coordinate-based_approaches"}], "paper_keywords": ["irregular grids", " tetrahedral mesh compression", " iso-surface extraction", " volume rendering", " out-of-core"], "paper_abstract": "Volume datasets tend to grow larger and larger as modern technology advances, thus imposing a storage constraint on most systems. One general solution to alleviate this problem is to apply volume compression on volume datasets. However, as volume rendering is often the most important reason why a volume dataset was generated in the first place, we must take into account how a volume dataset could be efficiently rendered when it is stored in a compressed form. Our previous work [21] has shown that it is possible to perform an on-the-fly direct volume rendering from irregular volume data. In this paper, we further extend that work to demonstrate that a similar integration can also be achieved on iso-surface extraction and volume decompression for irregular volume data. In particular, our work involves a dataset decomposition process, where instead of a coordinate-based decomposition used by conventional out-of-core iso-surface extraction algorithms, we choose to use a layer-based structure. Each such layer contains a collection of tetrahedra whose associated scalar values fall within a specific range, and can be compressed independently to reduce its storage requirement. The layer structure is particularly suitable for out-of-core iso-surface extraction, where the required memory exceeds the physical memory capacity of the machine that the process is running on. Furthermore, with this work, we can perform on-the-fly iso-surface extraction during decompression, and the computation only involves the layer that contains the query value, rather than the entire dataset. Experiments show that our approach can improve the performance up to ten times when compared with the results based on traditional coordinate-based approaches.", "paper_title": "Integration of volume decompression and out-of-core iso-surface extraction from irregular volume data", "paper_id": "WOS:000236753500003"}