{"auto_keywords": [{"score": 0.037138626144422184, "phrase": "redundant_patterns"}, {"score": 0.015576048676418864, "phrase": "noninduced_patterns"}, {"score": 0.012150504475326628, "phrase": "output_quality"}, {"score": 0.00481495049065317, "phrase": "discovery_of_delta_closed_patterns"}, {"score": 0.004617949594931096, "phrase": "sequence_data"}, {"score": 0.004575272950516775, "phrase": "significant_impact"}, {"score": 0.004228016636379321, "phrase": "multiple_strings"}, {"score": 0.00418892838079239, "phrase": "input_sequence_data"}, {"score": 0.004036141321779216, "phrase": "real_world"}, {"score": 0.00399881984083004, "phrase": "usually_a_large_set"}, {"score": 0.003446353878654566, "phrase": "notion_of_delta_tolerance_closed_itemset"}, {"score": 0.0031845067058084583, "phrase": "statistically_induced_patterns"}, {"score": 0.0028218877037665484, "phrase": "nonredundant_patterns"}, {"score": 0.0025474193855847074, "phrase": "innovative_use"}, {"score": 0.002523828967909659, "phrase": "suffix_tree"}, {"score": 0.002375714262344562, "phrase": "excellent_results"}, {"score": 0.0022571810910697013, "phrase": "proposed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "interesting_information"}], "paper_keywords": ["Sequence pattern discovery", " delta closed patterns", " statistically induced patterns", " suffix tree"], "paper_abstract": "Discovering patterns from sequence data has significant impact in many aspects of science and society, especially in genomics and proteomics. Here we consider multiple strings as input sequence data and substrings as patterns. In the real world, usually a large set of patterns could be discovered yet many of them are redundant, thus degrading the output quality. This paper improves the output quality by removing two types of redundant patterns. First, the notion of delta tolerance closed itemset is employed to remove redundant patterns that are not delta closed. Second, the concept of statistically induced patterns is proposed to capture redundant patterns which seem to be statistically significant yet their significance is induced by their strong significant subpatterns. It is computationally intense to mine these nonredundant patterns (delta closed patterns and noninduced patterns). To efficiently discover these patterns in very large sequence data, two efficient algorithms have been developed through innovative use of suffix tree. Three sets of experiments were conducted to evaluate their performance. They render excellent results when applying to genomics. The experiments confirm that the proposed algorithms are efficient and that they produce a relatively small set of patterns which reveal interesting information in the sequences.", "paper_title": "Discovery of Delta Closed Patterns and Noninduced Patterns from Sequences", "paper_id": "WOS:000305900500005"}