{"auto_keywords": [{"score": 0.045926665666285726, "phrase": "visual_variables"}, {"score": 0.026481170017239167, "phrase": "visual_variable"}, {"score": 0.012012550648886679, "phrase": "main_edge"}, {"score": 0.006190121366366647, "phrase": "dimensional_integrality"}, {"score": 0.00481495049065317, "phrase": "graph_edges"}, {"score": 0.004757971766446564, "phrase": "paired_visual_variables"}, {"score": 0.004697113629707498, "phrase": "stronger_negative_impact"}, {"score": 0.004657095930814842, "phrase": "common_approach"}, {"score": 0.004580111085682869, "phrase": "additional_dimension"}, {"score": 0.004284635278525657, "phrase": "user's_perception"}, {"score": 0.004203755099553109, "phrase": "user_study"}, {"score": 0.00415397889402421, "phrase": "graph_edge"}, {"score": 0.00405618051382474, "phrase": "main_edge_attribute"}, {"score": 0.0038674104195993314, "phrase": "graphical_primitives"}, {"score": 0.0033841438302493914, "phrase": "seven_visual_variables"}, {"score": 0.002975245449080336, "phrase": "graph-task_type"}, {"score": 0.002912055380742523, "phrase": "factor_extrinsic"}, {"score": 0.002750014730015977, "phrase": "focus-based_visual_variables"}, {"score": 0.0023492960110523325, "phrase": "color-based_visual_variables"}, {"score": 0.002315892979412876, "phrase": "compound_relationship"}, {"score": 0.0023048642674654875, "phrase": "discriminability_level"}, {"score": 0.002202670240861009, "phrase": "design_considerations"}, {"score": 0.00218695288778402, "phrase": "graph_uncertainty"}, {"score": 0.0021507128934288335, "phrase": "recommended_choices"}, {"score": 0.002125194655431031, "phrase": "relative_importance"}, {"score": 0.0021150721590334843, "phrase": "data_attributes"}, {"score": 0.0021049977753042253, "phrase": "graph_tasks"}], "paper_keywords": ["Visual variable", " perception", " uncertainty visualization", " graph visualization"], "paper_abstract": "When visualizing data with uncertainty, a common approach is to treat uncertainty as an additional dimension and encode it using a visual variable. The effectiveness of this approach depends on how the visual variables chosen for representing uncertainty and other attributes interact to influence the user's perception of each variable. We report a user study on the perception of graph edge attributes when uncertainty associated with each edge and the main edge attribute are visualized simultaneously using two separate visual variables. The study covers four visual variables that are commonly used for visualizing uncertainty on line graphical primitives: lightness, grain, fuzziness, and transparency. We select width, hue, and saturation for visualizing the main edge attribute and hypothesize that we can observe interference between the visual variable chosen to encode the main edge attribute and that to encode uncertainty, as suggested by the concept of dimensional integrality. Grouping the seven visual variables as color-based, focus-based, or geometry-based, we further hypothesize that the degree of interference is affected by the groups to which the two visual variables belong. We consider two further factors in the study: discriminability level for each visual variable as a factor intrinsic to the visual variables and graph-task type (visual search versus comparison) as a factor extrinsic to the visual variables. Our results show that the effectiveness of a visual variable in depicting uncertainty is strongly mediated by all the factors examined here. Focus-based visual variables (fuzziness, grain, and transparency) are robust to the choice of visual variables for encoding the main edge attribute, though fuzziness has stronger negative impact on the perception of width and transparency has stronger negative impact on the perception of hue than the other uncertainty visual variables. We found that interference between hue and lightness is much greater than that between saturation and lightness, though all three are color-based visual variables. We also found a compound relationship between discriminability level and the degree of dimensional integrality. We discuss the generalizability and limitation of the results and conclude with design considerations for visualizing graph uncertainty derived from these results, including recommended choices of visual variables when the relative importance of data attributes and graph tasks is known.", "paper_title": "Representing Uncertainty in Graph Edges: An Evaluation of Paired Visual Variables", "paper_id": "WOS:000360844100008"}