{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "study_on_meme_propagation"}, {"score": 0.004757643419056999, "phrase": "multimemetic_algorithms._multimemetic_algorithms"}, {"score": 0.004535124351828787, "phrase": "memetic_algorithms"}, {"score": 0.003927848423072668, "phrase": "spatial_structure"}, {"score": 0.00374399358035391, "phrase": "idealized_selecto-lamarckian_model"}, {"score": 0.003611751858608048, "phrase": "local_improvement"}, {"score": 0.0033409791799749403, "phrase": "population_models"}, {"score": 0.0033011569787033297, "phrase": "panmictic_and_toroidal_grid_topologies"}, {"score": 0.0031845067058084583, "phrase": "increased_takeover_time"}, {"score": 0.002963390095037466, "phrase": "good_memes"}, {"score": 0.002644179117033107, "phrase": "actual_mma"}, {"score": 0.002387758958649797, "phrase": "spatially_structured_mma"}, {"score": 0.0023033100935570755, "phrase": "panmictic_mma"}], "paper_keywords": ["memetic algorithms", " spatial structure", " meme propagation"], "paper_abstract": "Multimemetic algorithms (MMAs) are a subclass of memetic algorithms in which memes are explicitly attached to genotypes and evolve alongside them. We analyze the propagation of memes in MMAs with a spatial structure. For this purpose we propose an idealized selecto-Lamarckian model that only features selection and local improvement, and study under which conditions good, high-potential memes can proliferate. We compare population models with panmictic and toroidal grid topologies. We show that the increased takeover time induced by the latter is essential for improving the chances for good memes to express themselves in the population by improving their hosts, hence enhancing their survival rates. Experiments realized with an actual MMA on three different complex pseudo-Boolean functions are consistent with these findings, indicating that memes are more successful in a spatially structured MMA, rather than in a panmictic MMA, and that the performance of the former is significantly better than that of its panmictic counterpart.", "paper_title": "A STUDY ON MEME PROPAGATION IN MULTIMEMETIC ALGORITHMS", "paper_id": "WOS:000362229500005"}