{"auto_keywords": [{"score": 0.04571345706034808, "phrase": "use_cases"}, {"score": 0.02435387058136478, "phrase": "system_design"}, {"score": 0.01516499651320525, "phrase": "use-case-driven_system_design"}, {"score": 0.004814961217459683, "phrase": "petri"}, {"score": 0.0034403745992576808, "phrase": "capacity_overflow"}, {"score": 0.0030707512751243214, "phrase": "synthesis_methodology"}, {"score": 0.002855251306715901, "phrase": "labelled_petri_nets"}, {"score": 0.002548331088496964, "phrase": "single_consistent_whole"}, {"score": 0.0024460897937643032, "phrase": "formal_specification"}, {"score": 0.002391067964886602, "phrase": "rigorous_and_systematic_process"}, {"score": 0.002203016940021265, "phrase": "manufacturing_system_design"}, {"score": 0.0021830553825770097, "phrase": "promising_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Petri net", " use case", " system synthesis", " system design", " manufacturing system"], "paper_abstract": "In use-case-driven system design, one need to derive from a set of use cases an integrated system design that meets at least two objectives. First, the system design must be consistent with the use cases in the sense that the functionalities of the use cases are exactly reflected. Second, the system design must be correct in the sense that the system is free from errors such as deadlock and capacity overflow. The latter is especially important for systems involving some concurrent, sequential, asynchronous, competitive and coordinated processes, such as manufacturing systems. In this paper, we propose a synthesis methodology for use-case-driven system design whereby both objectives are satisfied. In our methodology, use cases are specified as labelled Petri nets, in which the conditions, events and their causal relationships are explicitly represented. A system design is then derived by synthesising these nets into a single consistent whole. Our methodology has two distinctive features, namely, a formal specification of use cases and a rigorous and systematic process for deriving a system design whose correctness and consistency can be optimally achieved. We specifically show its application to manufacturing system design. Promising results are obtained. (C) 2005 Elsevier Inc. All rights reserved.", "paper_title": "A Petri-net-based synthesis methodology for use-case-driven system design", "paper_id": "WOS:000238081600003"}