{"auto_keywords": [{"score": 0.048163992431376056, "phrase": "gwas"}, {"score": 0.032815388048854754, "phrase": "gwaspi"}, {"score": 0.00481495049065317, "phrase": "genome-wide_snp_analysis"}, {"score": 0.004669845451682529, "phrase": "genome-wide_association_studies"}, {"score": 0.004260134699483774, "phrase": "human_traits"}, {"score": 0.0040481944502103505, "phrase": "software_packages"}, {"score": 0.003906116922372891, "phrase": "intricate_management_workflows"}, {"score": 0.003711723285313348, "phrase": "steep_learning_curves"}, {"score": 0.0036181717017041387, "phrase": "wide_variety"}, {"score": 0.0028170314398963704, "phrase": "gwas_data"}, {"score": 0.0027600360731762997, "phrase": "novel_approach"}, {"score": 0.002731971103291716, "phrase": "database_technologies"}, {"score": 0.0026359661683151006, "phrase": "commonly_available_desktop_hardware"}, {"score": 0.002479150189700726, "phrase": "gwas_management_application"}, {"score": 0.0024414225109100672, "phrase": "raw_data"}, {"score": 0.0021049977753042253, "phrase": "fundamental_steps"}], "paper_keywords": [""], "paper_abstract": "Motivation: Genome-wide association studies (GWAS) based on single nucleotide polymorphism (SNP) arrays are the most widely used approach to detect loci associated to human traits. Due to the complexity of the methods and software packages available, each with its particular format requiring intricate management workflows, the analysis of GWAS usually confronts scientists with steep learning curves. Indeed, the wide variety of tools makes the parsing and manipulation of data the most time consuming and error prone part of a study. To help resolve these issues, we present GWASpi, a user-friendly, multiplatform, desktop-able application for the management and analysis of GWAS data, with a novel approach on database technologies to leverage the most out of commonly available desktop hardware. GWASpi aims to be a start-to-finish GWAS management application, from raw data to results, containing the most common analysis tools. As a result, GWASpi is easy to use and reduces in up to two orders of magnitude the time needed to perform the fundamental steps of a GWAS.", "paper_title": "Genome-wide association studies pipeline (GWASpi): a desktop application for genome-wide SNP analysis and management", "paper_id": "WOS:000291752600069"}