{"auto_keywords": [{"score": 0.03893536257455493, "phrase": "psychological_contract"}, {"score": 0.004733347359490221, "phrase": "psychological_contract_maintenance"}, {"score": 0.004223415145617665, "phrase": "research_approach"}, {"score": 0.0041517954514423625, "phrase": "grounded_theory"}, {"score": 0.00401216440036853, "phrase": "theoretical_contribution"}, {"score": 0.0035189057079817285, "phrase": "empirical_data"}, {"score": 0.003051073364818384, "phrase": "social_influence_theory"}, {"score": 0.0029148831519944358, "phrase": "intrinsic_motivation"}, {"score": 0.0027374647587075935, "phrase": "revelatory_case_study"}, {"score": 0.0021049977753042253, "phrase": "valuable_employees"}], "paper_keywords": ["Psychological contract", " voluntary contract termination", " IT Consultants"], "paper_abstract": "This research investigates the question why dedicated Information Technology (IT) consultants quit their jobs and voluntarily terminate their employment contracts. A research approach inspired by grounded theory is used and as a theoretical contribution a novel, cyclic process model for the maintenance or neglect of the psychological contract between employees and employers is derived from the empirical data. The model is subsequently substantiated through the integration of various concepts and theories identified in the literature, combining the concept of psychological contract with social influence theory and a theory of the relation between intrinsic motivation and management practices. The research is based on a revelatory case study which provides tales from four IT consultants in an IT consulting firm. The model helps to explain IT consultants' behaviour of voluntarily terminating their employment contracts. Additionally, it should assist managers in IT consulting firms to avoid practices which might lead to their employees' loss of intrinsic motivation and result in the loss of valuable employees for the organization.", "paper_title": "Tales of IT Consultants: Understanding Psychological Contract Maintenance and Employment Termination", "paper_id": "WOS:000366702300001"}