{"auto_keywords": [{"score": 0.045003450186644395, "phrase": "ghostrider"}, {"score": 0.04197162240390934, "phrase": "mto"}, {"score": 0.02562311328601794, "phrase": "mto."}, {"score": 0.00481495049065317, "phrase": "hardware-software_system_for_memory_trace_oblivious_computation"}, {"score": 0.0039380388343479384, "phrase": "even_an_adversary"}, {"score": 0.0036621225944272256, "phrase": "program's_sensitive_inputs"}, {"score": 0.0034437574674180365, "phrase": "oblivious_ram"}, {"score": 0.003220315882881027, "phrase": "single_oram_bank"}, {"score": 0.0030113280682863234, "phrase": "memory_traffic"}, {"score": 0.0029612292670237505, "phrase": "baseline_approach"}, {"score": 0.002847540262784593, "phrase": "ghostrider's_compiler"}, {"score": 0.002800158709933889, "phrase": "program_analysis"}, {"score": 0.0026039034759349168, "phrase": "ram"}, {"score": 0.002574788013427524, "phrase": "eram"}, {"score": 0.0023151088048303705, "phrase": "multiple_oram_banks"}, {"score": 0.0022386642196006567, "phrase": "access_times"}], "paper_keywords": [""], "paper_abstract": "This paper presents a new, co-designed compiler and architecture called GhostRider for supporting privacy preserving computation in the cloud. GhostRider ensures all programs satisfy a property called memory-trace obliviousness (MTO): Even an adversary that observes memory, bus traffic, and access times while the program executes can learn nothing about the program's sensitive inputs and outputs. One way to achieve MTO is to employ Oblivious RAM (ORAM), allocating all code and data in a single ORAM bank, and to also disable caches or fix the rate of memory traffic. This baseline approach can be inefficient, and so GhostRider's compiler uses a program analysis to do better, allocating data to non-oblivious, encrypted RAM (ERAM) and employing a scratchpad when doing so will not compromise MTO. The compiler can also allocate to multiple ORAM banks, which sometimes significantly reduces access times. We have formalized our approach and proved it enjoys MTO. Our FPGA-based hardware prototype and simulation results show that GhostRider significantly outperforms the baseline strategy.", "paper_title": "GhostRider: A Hardware-Software System for Memory Trace Oblivious Computation", "paper_id": "WOS:000370874900007"}