{"auto_keywords": [{"score": 0.03840056312686234, "phrase": "crack_displacement"}, {"score": 0.01188049319004162, "phrase": "high_accuracy"}, {"score": 0.00481495049065317, "phrase": "crack_monitoring"}, {"score": 0.004654993966953098, "phrase": "service_life"}, {"score": 0.004626484449627427, "phrase": "aging_infrastructure"}, {"score": 0.004584045720295891, "phrase": "important_role"}, {"score": 0.003967593052753246, "phrase": "current_conventional_techniques"}, {"score": 0.0037887998222248314, "phrase": "high_cost"}, {"score": 0.0037310040297385346, "phrase": "new_measurement_technique"}, {"score": 0.0035848128208966403, "phrase": "aging_civil_engineering_structures"}, {"score": 0.0034022184461070114, "phrase": "digital_camera_image"}, {"score": 0.003360620035679697, "phrase": "proposed_technique"}, {"score": 0.003340011311961488, "phrase": "reflective_targets"}, {"score": 0.003209090947105003, "phrase": "subsequent_digital_camera_images"}, {"score": 0.003140727213993457, "phrase": "image_processing"}, {"score": 0.0029623991857435183, "phrase": "arbitrary_camera_position"}, {"score": 0.002846238033172098, "phrase": "proposed_method"}, {"score": 0.0027178389866989775, "phrase": "digital_images"}, {"score": 0.0025952171827648665, "phrase": "tensile_displacement"}, {"score": 0.002462903804873404, "phrase": "measurement_results"}, {"score": 0.002337320424202832, "phrase": "actual_tunnel"}, {"score": 0.002301614895279686, "phrase": "simple_measurements"}, {"score": 0.002144252482711611, "phrase": "close_agreement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Photogrammetry", " Image processing", " Perspective projection", " Crack displacement", " Tunnel"], "paper_abstract": "Inspections to evaluate the safety, durability, and service life of aging infrastructure play an important role in determining the countermeasures that need to be taken, such as reinforcement, repair, and reconstruction. In infrastructure containing concrete, such as bridges and tunnels, crack widths and patterns on surfaces are two of the most important signs used to estimate durability. Current conventional techniques used for this purpose suffer from challenges such as tediousness, subjectivity, and high cost. Consequently, a new measurement technique that overcomes these challenges while measuring crack displacement with high accuracy and precision in aging civil engineering structures is needed. In this paper, we proposed a technique for measuring crack displacement using a digital camera image. In the proposed technique, reflective targets are established around both sides of a crack as gauges, and subsequent digital camera images of the targets are subjected to image processing to determine the displacements of the targets. These displacements can be measured using images captured from any arbitrary camera position. The results of experiments conducted to verify the efficacy of the proposed method show that crack displacements of less than 0.10 mm can be measured with high accuracy and precision using digital images captured at a distance of 10.0 m from the target, while less than 0.20 mm changes in the tensile displacement of the crack can be measured from an image captured at 25.0 m from the crack. Measurement results obtained from a tunnel are also presented to show that cracks in the walls of an actual tunnel can be identified through simple measurements. These measurements, taken over a period of one year, indicate that the tendency of crack displacement and slide movements are in close agreement. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Improved digital photogrammetry technique for crack monitoring", "paper_id": "WOS:000366769500010"}