{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_sharing"}, {"score": 0.04221279342590529, "phrase": "social_value_orientation"}, {"score": 0.015144093894551316, "phrase": "knowledge_sharing_behavior"}, {"score": 0.01381775344828686, "phrase": "sharing_outcomes"}, {"score": 0.009182507656465846, "phrase": "social_exchange"}, {"score": 0.00846009628061619, "phrase": "sharing_target"}, {"score": 0.004716924994370903, "phrase": "purpose_-_this_paper"}, {"score": 0.004112303664150895, "phrase": "working_relationships"}, {"score": 0.0040562607160379936, "phrase": "social_exchange_theory"}, {"score": 0.003987275549870311, "phrase": "leader-member_exchange_theory"}, {"score": 0.003919459003028067, "phrase": "behavioral_intentions"}, {"score": 0.003839594092937135, "phrase": "study_population"}, {"score": 0.003761350406092476, "phrase": "large_pension_fund"}, {"score": 0.00373568487720236, "phrase": "canada"}, {"score": 0.003634458561248524, "phrase": "allocation_games"}, {"score": 0.0036095967013657906, "phrase": "situational_vignettes"}, {"score": 0.003335581163845351, "phrase": "personal_preferences"}, {"score": 0.0032563753253986912, "phrase": "individual_perceptions"}, {"score": 0.0031790442889277864, "phrase": "structural_relationship"}, {"score": 0.0031572878619497624, "phrase": "knowledge_recipients"}, {"score": 0.0029376169407844314, "phrase": "perceived_benefit"}, {"score": 0.002686643644493607, "phrase": "perceived_recipient_benefit"}, {"score": 0.002448631085132444, "phrase": "organizational_benefits"}, {"score": 0.0021049977753042253, "phrase": "innovative_methods"}], "paper_keywords": ["Knowledge sharing", " Social dynamics", " Value analysis", " Canada"], "paper_abstract": "Purpose - This paper aims to examine how knowledge sharing behavior is influenced by three sets of dynamics: a rational calculus that weighs the costs and benefits of sharing; a dispositional preference that favors certain patterns of sharing outcomes; and a relational effect based on working relationships. Design/methodology/approach - Concepts from social exchange theory, social value orientation, and leader-member exchange theory are applied to analyze behavioral intentions to share knowledge. The study population consists of employees of a large pension fund in Canada. Participants answered a survey that used allocation games and situational vignettes to measure social value orientation, propensity to share knowledge, and perception of cost and benefit. Findings - The results suggest that personal preferences about the distribution of sharing outcomes, individual perceptions about costs and benefits, and structural relationship with knowledge recipients, all affect knowledge sharing behavior significantly. Notably, it was found that propensity to share knowledge is positively related to perceived benefit to the recipient, thus suggesting that evaluation of cost and benefit in social exchange is not limited to self-interest, but is also influenced by perceived recipient benefit. Moreover, it was found that the relationship with the sharing target (superior or colleague) also influenced sharing. Originality/value - Most studies emphasize the organizational benefits of knowledge sharing. This study examines knowledge sharing from the perspective of the individual who approaches knowledge sharing as a social exchange that involves perceptions of costs and benefits, preferences about sharing outcomes, and relationship with the sharing target. The study also introduces innovative methods to measure social value orientation and propensity to share knowledge.", "paper_title": "The individual and social dynamics of knowledge sharing: an exploratory study", "paper_id": "WOS:000285565500004"}