{"auto_keywords": [{"score": 0.03418689148229019, "phrase": "large-scale_nets"}, {"score": 0.026844802222266897, "phrase": "experimental_results"}, {"score": 0.00481495049065317, "phrase": "rectilinear_obstacle-avoiding_steiner_problem"}, {"score": 0.004714023408114857, "phrase": "important_steps"}, {"score": 0.004532141038197266, "phrase": "macro_cells"}, {"score": 0.004477595431209663, "phrase": "pre-routed_nets"}, {"score": 0.004370457120206237, "phrase": "routing_phase"}, {"score": 0.004214516848083075, "phrase": "oarsmt_algorithms"}, {"score": 0.00418907090251818, "phrase": "multi-terminal_net_routing"}, {"score": 0.004088807948906792, "phrase": "practical_applications"}, {"score": 0.00400304045240329, "phrase": "oarsmt_problem"}, {"score": 0.003930953151925098, "phrase": "full-scale_nets"}, {"score": 0.0037336520904376687, "phrase": "ant_colony"}, {"score": 0.003600351201298387, "phrase": "common_scale_nets"}, {"score": 0.00334780964309978, "phrase": "track_graph"}, {"score": 0.003267615713496102, "phrase": "three-step_heuristic"}, {"score": 0.0029120808249746533, "phrase": "connected_graph"}, {"score": 0.0027159094186967247, "phrase": "complete_steiner_tree"}, {"score": 0.0025560719383290356, "phrase": "different_kinds"}, {"score": 0.002449802505107058, "phrase": "concave_polygon_obstacles"}, {"score": 0.0024349853033241663, "phrase": "short_wire_length"}, {"score": 0.0023983322584501332, "phrase": "optimal_solution"}, {"score": 0.00229164285862567, "phrase": "short_running_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["routing", " rectilinear Steiner minimal tree", " obstacle avoiding", " ant colony optimization", " track graph", " hypergraph", " full Steiner tree", " detour"], "paper_abstract": "Routing is one of the important steps in very/ultra large-scale integration (VLSI/ULSI) physical design. Rectilinear Steiner minimal tree (RSMT) construction is an essential part of routing. Macro cells, IP blocks, and pre-routed nets are often regarded as obstacles in the routing phase. Obstacle-avoiding RSMT (OARSMT) algorithms are useful for practical routing applications. However, OARSMT algorithms for multi-terminal net routing still cannot meet the requirements of practical applications. This paper focuses on the OARSMT problem and gives a solution to full-scale nets based on two algorithms, namely An-OARSMan and FORSTer. (1) Based on ant colony optimization (ACO), An-OARSMan can be used for common scale nets with less than 100 terminals in a circuit. An heuristic, greedy obstacle penalty distance (OP-distance), is used in the algorithm and performed on the track graph. (2) FORSTer is a three-step heuristic used for large-scale nets with more than 100 terminals in a circuit. In Step 1, it first partitions all terminals into some subsets in the presence of obstacles. In Step 2, it then connects terminals in each connected graph with one or more trees, respectively. In Step 3, it finally connects the forest consisting of trees constructed in Step 2 into a complete Steiner tree spanning all terminals while avoiding all obstacles. (3) These two graph-based algorithms have been implemented and tested on different kinds of cases. Experimental results show that An-OARSMan can handle both convex and concave polygon obstacles with short wire length. It achieves the optimal solution in the cases with no more than seven terminals. The experimental results also show that FORSTer has short running time, which is suitable for routing large-scale nets among obstacles, even for routing a net with one thousand terminals in the presence of 100 rectangular obstacles. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A full-scale solution to the rectilinear obstacle-avoiding Steiner problem", "paper_id": "WOS:000256572800008"}