{"auto_keywords": [{"score": 0.049448784877889715, "phrase": "third_list-homomorphism_theorem"}, {"score": 0.00481495049065317, "phrase": "parallelization_theorems"}, {"score": 0.004446823283475876, "phrase": "divide-and-conquer_parallel_implementation"}, {"score": 0.004070573090297285, "phrase": "new_proof"}, {"score": 0.0037925389501636975, "phrase": "divide-and-conquer_parallel_program"}, {"score": 0.0032199307816384577, "phrase": "independent_substructures"}, {"score": 0.0027456676902333304, "phrase": "iterative_programs"}, {"score": 0.002404136142279618, "phrase": "divide-and-conquer_implementation"}, {"score": 0.0022496114364599328, "phrase": "structure-consuming_operations"}, {"score": 0.0021809311689473493, "phrase": "structure-generating_operations"}], "paper_keywords": ["Divide-and-conquer Parallelism", " Shortcut Deforestation", " Third List-homomorphism Theorem"], "paper_abstract": "The third list-homomorphism theorem states that if a function is both foldr and foldl, it has a divide-and-conquer parallel implementation as well. In this paper, we develop a theory for obtaining such parallelization theorems. The key is a new proof of the third list-homomorphism theorem based on shortcut deforestation. The proof implies that there exists a divide-and-conquer parallel program of the form of h (x 'merge' y) = h(1) x circle dot h(2) y, where h is the subject of parallelization, merge is the operation of integrating independent substructures, h1 and h2 are computations applied to substructures, possibly in parallel, and circle dot merges the results calculated for substructures, if (i) h can be specified by two certain forms of iterative programs, and (ii) merge can be implemented by a function of a certain polymorphic type. Therefore, when requirement (ii) is fulfilled, h has a divide-and-conquer implementation if h has two certain forms of implementations. We show that our approach is applicable to structure-consuming operations by catamorphisms (folds), structure-generating operations by anamorphisms (unfolds), and their generalizations called hylomorphisms.", "paper_title": "A Short Cut to Parallelization Theorems", "paper_id": "WOS:000327696700023"}