{"auto_keywords": [{"score": 0.04361989929058287, "phrase": "secret_share"}, {"score": 0.03826733044577614, "phrase": "unconditional_security"}, {"score": 0.015719716506582538, "phrase": "multi-secret_sharing_schemes"}, {"score": 0.011397269551591663, "phrase": "access_structures"}, {"score": 0.008916956015805277, "phrase": "computational_security"}, {"score": 0.008794703032343495, "phrase": "new_msss"}, {"score": 0.004761850836420121, "phrase": "multi-secret_sharing_scheme"}, {"score": 0.004735522424828424, "phrase": "msss"}, {"score": 0.004696295109780416, "phrase": "different_secrets"}, {"score": 0.004504969093304219, "phrase": "access_structure"}, {"score": 0.004467645346982412, "phrase": "trivial_solution"}, {"score": 0.004381749459671914, "phrase": "independent_instances"}, {"score": 0.00434544213389516, "phrase": "standard_secret_sharing_scheme"}, {"score": 0.0038998328617557013, "phrase": "cryptographic_community"}, {"score": 0.0038567860860362745, "phrase": "theoretical_perspective"}, {"score": 0.0038354405231002323, "phrase": "different_models"}, {"score": 0.0034997585767546735, "phrase": "particular_cases"}, {"score": 0.003441949264109265, "phrase": "threshold_case"}, {"score": 0.0033850916068797437, "phrase": "strongest_level"}, {"score": 0.003319939715683536, "phrase": "length_linear"}, {"score": 0.003265090934183249, "phrase": "optimal_solution"}, {"score": 0.0031933617014256676, "phrase": "trivial_one"}, {"score": 0.0026364182801578043, "phrase": "constant_length"}, {"score": 0.0025358343095525275, "phrase": "random_oracle_model"}, {"score": 0.0024594969044952108, "phrase": "first_formal_analysis"}, {"score": 0.002333001929659445, "phrase": "key_ingredient"}, {"score": 0.0021167332851144273, "phrase": "similar_functionalities"}, {"score": 0.0021049977753042253, "phrase": "attribute-based_cryptosystems"}], "paper_keywords": ["Multi-secret sharing schemes", " Multi-policy cryptosystems", " Entropy", " Provable security"], "paper_abstract": "In a multi-secret sharing scheme (MSSS), different secrets are distributed among the players in some set , each one according to an access structure. The trivial solution to this problem is to run independent instances of a standard secret sharing scheme, one for each secret. In this solution, the length of the secret share to be stored by each player grows linearly with (when keeping all other parameters fixed). Multi-secret sharing schemes have been studied by the cryptographic community mostly from a theoretical perspective: different models and definitions have been proposed, for both unconditional (information-theoretic) and computational security. In the case of unconditional security, there are two different definitions. It has been proved that, for some particular cases of access structures that include the threshold case, a MSSS with the strongest level of unconditional security must have shares with length linear in . Therefore, the optimal solution in this case is equivalent to the trivial one. In this work we prove that, even for a more relaxed notion of unconditional security, and for some kinds of access structures (in particular, threshold ones), we have the same efficiency problem: the length of each secret share must grow linearly with . Since we want more efficient solutions, we move to the scenario of MSSSs with computational security. We propose a new MSSS, where each secret share has constant length (just one element), and we formally prove its computational security in the random oracle model. To the best of our knowledge, this is the first formal analysis on the computational security of a MSSS. We show the utility of the new MSSS by using it as a key ingredient in the design of two schemes for two new functionalities: multi-policy signatures and multi-policy decryption. We prove the security of these two new multi-policy cryptosystems in a formal security model. The two new primitives provide similar functionalities as attribute-based cryptosystems, with some advantages and some drawbacks that we discuss at the end of this work.", "paper_title": "New results and applications for multi-secret sharing schemes", "paper_id": "WOS:000340681700009"}