{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "minimal_signed_circuits"}, {"score": 0.004700027722284931, "phrase": "boolean_regulatory_networks"}, {"score": 0.00450000390667755, "phrase": "positive_or_negative_circuits"}, {"score": 0.0043713857434347254, "phrase": "genetic_networks"}, {"score": 0.004225950334493496, "phrase": "significant_dynamical_properties"}, {"score": 0.0037811784409635023, "phrase": "r._thomas"}, {"score": 0.0033667304423940893, "phrase": "rather_simple_information"}, {"score": 0.003070996252787868, "phrase": "nontrivial_converse"}, {"score": 0.0027876387169652717, "phrase": "restricted_form"}, {"score": 0.0027474453262607834, "phrase": "corresponding_dynamical_property"}, {"score": 0.0026175952455594277, "phrase": "crucial_property"}, {"score": 0.002387507583705495, "phrase": "vertebrate_immune_system"}], "paper_keywords": [""], "paper_abstract": "It is acknowledged that the presence of positive or negative circuits in regulatory networks such as genetic networks is linked to the emergence of significant dynamical properties such as multistability (involved in differentiation) and periodic oscillations (involved in homeostasis). Rules proposed by the biologist R. Thomas assert that these circuits are necessary for such dynamical properties. These rules have been studied by several authors. Their obvious interest is that they relate the rather simple information contained in the structure of the network (signed circuits) to its much more complex dynamical behaviour. We prove in this article a nontrivial converse of these rules, namely that certain positive or negative circuits in a regulatory graph are actually sufficient for the observation of a restricted form of the corresponding dynamical property, differentiation or homeostasis. More precisely, the crucial property that we require is that the circuit be globally minimal. We then apply these results to the vertebrate immune system, and show that the two minimal functional positive circuits of the model indeed behave as modules which combine to explain the presence of the three stable states corresponding to the Th0, Th1 and Th2 cells.", "paper_title": "From minimal signed circuits to the dynamics of Boolean regulatory networks", "paper_id": "WOS:000258471500033"}