{"auto_keywords": [{"score": 0.03866522664303149, "phrase": "graduate_students"}, {"score": 0.004684913157080182, "phrase": "taiwan"}, {"score": 0.004642292792558686, "phrase": "purpose_-_university_libraries"}, {"score": 0.004374772264092067, "phrase": "graduate_students'_usage"}, {"score": 0.004237138632255772, "phrase": "national_taiwan_university"}, {"score": 0.003974673997871831, "phrase": "social_sciences"}, {"score": 0.0034814114447308028, "phrase": "monographs"}, {"score": 0.0032358709481309913, "phrase": "reference_tools"}, {"score": 0.0029802289354540507, "phrase": "keyword_search_function"}, {"score": 0.0026220103561723045, "phrase": "corresponding_paper_versions"}, {"score": 0.002493333098814506, "phrase": "university_libraries"}, {"score": 0.002403724423251419, "phrase": "students'_use_behaviour"}, {"score": 0.0022649119108225564, "phrase": "multiple_aspects"}, {"score": 0.002244277924422011, "phrase": "graduate_students'_use"}, {"score": 0.0021049977753042253, "phrase": "e-book_collection_development"}], "paper_keywords": ["E-books", " E-book usage", " Graduate students", " University libraries", " Library users", " User satisfaction", " Taiwan"], "paper_abstract": "Purpose - University libraries are increasing their e-book collections. The purpose of this study is to investigate graduate students' usage of and attitudes towards e-books at National Taiwan University. Design/methodology/approach - A total of 20 graduate students from the fields of humanities, social sciences, science and technology, and medicine were interviewed. Findings - The results indicated that graduate students used e-books mainly for the purposes of study and research. Monographs were the type of e-book that students used most often, followed by textbooks and reference tools. While they appreciated the convenience of using e-books, students mentioned several limitations. They liked the keyword search function of e-books. Most of the time, graduate students browsed a few paragraphs or pages online and then printed out copies for further reading. They also borrowed the corresponding paper versions of the e-books from the library. Students preferred that university libraries supply both the electronic and paper versions. In certain aspects, students' use behaviour was found to vary among disciplines. Originality/value - This study highlights multiple aspects of graduate students' use behaviour with respect to e-books. The findings could be used to enhance e-book collection development in university libraries.", "paper_title": "Graduate students' usage of and attitudes towards e-books: experiences from Taiwan", "paper_id": "WOS:000294980800004"}