{"auto_keywords": [{"score": 0.03964971529740581, "phrase": "specific_person"}, {"score": 0.00481495049065317, "phrase": "random_opinions"}, {"score": 0.0047709540557306284, "phrase": "decentralized_recommendation"}, {"score": 0.004453488286477661, "phrase": "wanted_items"}, {"score": 0.004412780054037622, "phrase": "unwanted_ones"}, {"score": 0.004352411290383643, "phrase": "dominant_task"}, {"score": 0.003555902292752528, "phrase": "similar_users"}, {"score": 0.003427540517249369, "phrase": "decentralized_systems"}, {"score": 0.0033651019362620866, "phrase": "peer-to-peer_networks"}, {"score": 0.003027462227648001, "phrase": "best_set"}, {"score": 0.0026011706232569316, "phrase": "extensive_experimental_evaluation"}, {"score": 0.0025655216052760093, "phrase": "movielens_data"}, {"score": 0.0023944552329463035, "phrase": "random_selection"}, {"score": 0.0023507916951658455, "phrase": "surprisingly_good_recommendations"}, {"score": 0.0022450768409733807, "phrase": "expensive_search_techniques"}, {"score": 0.0021940118003312397, "phrase": "simple_decentralized_recommendation_techniques"}, {"score": 0.0021049977753042253, "phrase": "expensive_solutions"}], "paper_keywords": [""], "paper_abstract": "As the amount of information available to users continues to grow, filtering wanted items from unwanted ones becomes a dominant task. To this end, various collaborative-filtering techniques have been developed in which the ratings of items by other users form the basis for recommending items that could be of interest for a specific person. These techniques are based on the assumption that having ratings from similar users improves the quality of recommendation. For decentralized systems, such as peer-to-peer networks, it is generally impossible to get ratings from all users. For this reason, research has focused on finding the best set of peers for recommending items for a specific person. In this paper, we analyze to what extent the selection of such a set influences the quality of recommendation. Our findings are based on an extensive experimental evaluation of the MovieLens data set applied to recommending movies. We find that, in general, a random selection of peers gives surprisingly good recommendations in comparison to very similar peers that must be discovered using expensive search techniques. Our study suggests that simple decentralized recommendation techniques can do sufficiently well in comparison to these expensive solutions.", "paper_title": "On the value of random opinions in decentralized recommendation", "paper_id": "WOS:000239059700007"}