{"auto_keywords": [{"score": 0.03952973699700799, "phrase": "awalbp"}, {"score": 0.037903879741232924, "phrase": "stationary_stages"}, {"score": 0.011908066113298005, "phrase": "forward_steps"}, {"score": 0.00481495049065317, "phrase": "accessibility_windows_assembly_line_problem_level"}, {"score": 0.004587835274176236, "phrase": "assembly_lines"}, {"score": 0.003911367220315185, "phrase": "assembly_line_balancing_problem"}, {"score": 0.0035507457285983268, "phrase": "workpieces_advance"}, {"score": 0.0033021988455635403, "phrase": "stationary_stage"}, {"score": 0.0031922210879462513, "phrase": "different_parts"}, {"score": 0.003056169480391946, "phrase": "first_level"}, {"score": 0.002263639474937039, "phrase": "simulated_annealing_procedures"}, {"score": 0.002230984431056064, "phrase": "extensive_computational_experiment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Assembly line balancing", " Accessibility windows"], "paper_abstract": "In some assembly lines, the workpieces are larger than the workstations. This implies that at a given instant the workstations have access to only a portion of the workpieces. In this context, the accessibility windows assembly line balancing problem (AWALBP) arises. In the AWALBP, the cycle is split into forward steps and stationary stages. The workpieces advance during the forward steps and the tasks are processed during the stationary stages. In each stationary stage, the workstations have access to different parts of the workpieces. This work solves the first level of AWALBP (AWALBP-L1), which consists in assigning the tasks among the workstations and stationary stages. Specifically, it is considered the AWALBP-L1 case in which the tasks can be processed in several workstations and their processing times depend on the workstation in which the tasks are processed. To solve the problem, we propose several heuristics and simulated annealing procedures. An extensive computational experiment is carried out to evaluate their performance. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Heuristics and simulated annealing procedures for the accessibility windows assembly line problem level 1 (AWALBP-L1)", "paper_id": "WOS:000357224000001"}