{"auto_keywords": [{"score": 0.03181659180605447, "phrase": "item_pricing_problem"}, {"score": 0.025616675622400636, "phrase": "line_highway_problem"}, {"score": 0.024445838422986383, "phrase": "cycle_highway_problem"}, {"score": 0.004780583596118536, "phrase": "coupon_model"}, {"score": 0.003996458454723708, "phrase": "set_v"}, {"score": 0.003920780681351006, "phrase": "set_e"}, {"score": 0.0030285084113651035, "phrase": "maximization_problem"}, {"score": 0.0029640065729342547, "phrase": "previous_works"}, {"score": 0.002791938993097381, "phrase": "balcan"}, {"score": 0.002725933401139499, "phrase": "wine"}, {"score": 0.0026047695117821634, "phrase": "seller_call"}, {"score": 0.0022672375681757058, "phrase": "customer"}, {"score": 0.0021819644700616543, "phrase": "approximation_algorithms"}, {"score": 0.0021303475072432664, "phrase": "smallest_valuation"}, {"score": 0.0021049977753042253, "phrase": "largest_valuation"}], "paper_keywords": ["line highway problem", " cycle highway problem", " multi-valuations", " single-valuation"], "paper_abstract": "When a store sells items to customers, the store wishes to decide the prices of items to maximize its profit. Intuitively, if the store sells the items with low (resp. high) prices, the customers buy more (resp. less) items. which provides less profit to the store. So it would be hard for the store to decide the prices of items. Assume that the store has a set V of n items and there is a set E of in customers who wish to buy the items, and also assume that each item i is an element of V has the production cost d(i) and each customer e(j) is an element of E has the valuation v(j) on the bundle e(j) is an element of V of items. When the store sells an item i is an element of V at the price r(i), the profit for the item i is p(i) = r(i) - d(i). The goal of the store is to decide the price of each item to maximize its total profit. We refer to this maximization problem as the item pricing problem. In most of the previous works, the item pricing problem was considered under the assumption that p(i) >= 0 for each i is an element of V, however, Balcan, et al. [In Proc. of WINE, LNCS 4858, 2007] introduced the notion of \"loss-leader,\" and showed that the seller call get more total profit in the case that p(i) < 0 is allowed than in the case that p(i) < 0 is not allowed. In this paper, we consider the line highway problem (in which each customer is interested in an interval on the line of the items) and the cycle highway problem (in which each Customer is interested in an interval on the cycle of the items), and show approximation algorithms for the line highway problem and the cycle highway problem in which the smallest valuation is s and the largest valuation is l (this is called all [s, l]-valuation setting) or all valuations are identical (this is called a single valuation setting).", "paper_title": "Approximation Algorithms for the Highway Problem under the Coupon Model", "paper_id": "WOS:000269648400006"}