{"auto_keywords": [{"score": 0.04972395969484309, "phrase": "nobel_prize_achievements"}, {"score": 0.022890361822527194, "phrase": "conventional_bibliometric_indicators"}, {"score": 0.006210845347289941, "phrase": "nobel_prize_awards"}, {"score": 0.00481495049065317, "phrase": "research_excellence_number"}, {"score": 0.00470862827326028, "phrase": "purpose_-_several_bibliometric_indicators"}, {"score": 0.004587535692463736, "phrase": "research_performance"}, {"score": 0.0044695432851061525, "phrase": "external_criterion"}, {"score": 0.004218206480183269, "phrase": "research_excellence"}, {"score": 0.003923398381490749, "phrase": "sporadic_events"}, {"score": 0.00383668723824441, "phrase": "scientific_activity"}, {"score": 0.003696390664266446, "phrase": "research_evaluation"}, {"score": 0.003149094460617212, "phrase": "similar_research_abilities"}, {"score": 0.003125714496527833, "phrase": "contrarily"}, {"score": 0.002722930209707764, "phrase": "national_articles"}, {"score": 0.0027039444883195517, "phrase": "nature"}, {"score": 0.002682849377131117, "phrase": "science"}, {"score": 0.0025461386232786356, "phrase": "-_science_administrators"}, {"score": 0.0025272158996086378, "phrase": "research_evaluations"}, {"score": 0.002508433454626386, "phrase": "research_incentives"}, {"score": 0.0022428442879034614, "phrase": "singular_events"}, {"score": 0.0021049977753042253, "phrase": "bibliometric_indicators"}], "paper_keywords": ["Bibliometric indicators", " Research performance", " Nobel prizes", " Research results", " Research"], "paper_abstract": "Purpose - Several bibliometric indicators that are extensively used to estimate research performance have not been validated against an external criterion of excellence. This paper aims to investigate whether this validation is possible using the number of Nobel Prize awards. Design/methodology/approach - This study uses several analytical treatments of the data to investigate: whether Nobel Prize awards are sporadic events or they depend on the scientific activity of countries or institutions and can be used in research evaluation; and the association between the number of Nobel Prize achievements and conventional bibliometric indicators across countries and institutions. Findings - This study finds that conventional bibliometric indicators, numbers of publications, citations, and top 1 per cent most cited publications, correlate with the number of Nobel Prize achievements in several advanced countries with similar research abilities. Contrarily, in countries and institutions with more variable research characteristics, there is no association between conventional bibliometric indicators and the number of Nobel Prize achievements, and their use as indicators of research excellence is not valid. In contrast, the number of national articles in Nature and Science correlates with the number of Nobel Prize achievements across countries and institutions. Practical implications - Science administrators implementing research evaluations and research incentives based on conventional bibliometric indicators should consider that increasing the scores of these indicators does not imply an improvement in research excellence. Originality/value - The study demonstrates that Nobel Prize achievements are not singular events that occur by chance. Therefore, the number of Nobel Prize achievements can be used to validate bibliometric indicators.", "paper_title": "Measuring research excellence Number of Nobel Prize achievements versus conventional bibliometric indicators", "paper_id": "WOS:000294831600002"}