{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "heliophysics"}, {"score": 0.0076662843289946655, "phrase": "sun"}, {"score": 0.004597244847332915, "phrase": "working_practices"}, {"score": 0.004389339243427964, "phrase": "namely_the_heliophysics_community"}, {"score": 0.004054479957160662, "phrase": "solar_events"}, {"score": 0.0039748192550806815, "phrase": "solar_system"}, {"score": 0.003896717568943166, "phrase": "workflow_technology"}, {"score": 0.003820144626025562, "phrase": "systems_science"}, {"score": 0.0036958398682001015, "phrase": "reliable_data_models"}, {"score": 0.0035402494307399733, "phrase": "major_challenges"}, {"score": 0.00290259605431505, "phrase": "heliophysics_workflows"}, {"score": 0.002845502417672334, "phrase": "taverna_workflow_system"}, {"score": 0.00280806350681826, "phrase": "myexperiment_site"}, {"score": 0.002663156413861478, "phrase": "existing_practices"}, {"score": 0.00257640185288362, "phrase": "web_portal"}, {"score": 0.0025340874787959195, "phrase": "technical_details"}, {"score": 0.002256677005409071, "phrase": "eu_framework"}, {"score": 0.002234359038208202, "phrase": "helio"}, {"score": 0.002175913488493802, "phrase": "worldwide_heliophysics_community"}, {"score": 0.0021049977753042253, "phrase": "global_scale"}], "paper_keywords": ["Workflow", " Taverna", " myExperiment", " Taverna Server", " Portal integration", " Heliophysics"], "paper_abstract": "In this paper we describe how we have introduced workflows into the working practices of a community for whom the concept of workflows is very new, namely the heliophysics community. Heliophysics is a branch of astrophysics which studies the Sun and the interactions between the Sun and the planets, by tracking solar events as they travel throughout the Solar system. Heliophysics produces two major challenges for workflow technology. Firstly it is a systems science where research is currently developed by many different communities who need reliable data models and metadata to be able to work together. Thus it has major challenges in the semantics of workflows. Secondly, the problem of time is critical in heliophysics; the workflows must take account of the propagation of events outwards from the sun. They have to address the four dimensional nature of space and time in terms of the indexing of data. We discuss how we have built an environment for Heliophysics workflows building on and extending the Taverna workflow system and utilising the myExperiment site for sharing workflows. We also describe how we have integrated the workflows into the existing practices of the communities involved in Heliophysics by developing a web portal which can hide the technical details from the users, who can concentrate on the data from their scientific point of view rather than on the methods used to integrate and process the data. This work has been developed in the EU Framework 7 project HELIO, and is being disseminated to the worldwide Heliophysics community, since Heliophysics requires integration of effort on a global scale.", "paper_title": "Workflows for Heliophysics", "paper_id": "WOS:000323669800008"}