{"auto_keywords": [{"score": 0.03927822773271868, "phrase": "sd_sites"}, {"score": 0.03681065734000902, "phrase": "mrna_movement"}, {"score": 0.035544412132803634, "phrase": "ribosome_footprints"}, {"score": 0.0328058024765297, "phrase": "internal_sd_sequences"}, {"score": 0.004620093797504386, "phrase": "mrna-protected_fragments"}, {"score": 0.0045726187330434025, "phrase": "ribosome_profiling_experiments"}, {"score": 0.004479120557712926, "phrase": "ribosome_profiling"}, {"score": 0.004410248125081398, "phrase": "new_technique"}, {"score": 0.004145143433523008, "phrase": "whole_transcriptome_level"}, {"score": 0.004081385289516914, "phrase": "recent_ribosome_profiling_study"}, {"score": 0.0038758293658651237, "phrase": "translation_rates"}, {"score": 0.0030554300179552415, "phrase": "caterpillar-like_movement"}, {"score": 0.002977419551510206, "phrase": "ribosome_cavity"}, {"score": 0.0029164434911787187, "phrase": "sd_site"}, {"score": 0.0026026666736474404, "phrase": "progressive_elongation"}, {"score": 0.0021049977753042253, "phrase": "ribosome_profiling_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: Ribosome profiling is a new technique that allows monitoring locations of translating ribosomes on mRNA at a whole transcriptome level. A recent ribosome profiling study demonstrated that internal Shine-Dalgarno (SD) sequences have a major global effect on translation rates in bacteria: ribosomes pause at SD sites in mRNA. Therefore, it is important to understand how SD sites effect mRNA movement through the ribosome and generation of ribosome footprints. Results: Here, we provide evidence that in addition to pausing effect, internal SD sequences induce a caterpillar-like movement of mRNA through the ribosome cavity. Once an SD site binds to the ribosome, it remains attached to it while the ribosome decodes a few subsequent codons. This leads to asymmetric progressive elongation of ribosome footprints at the 3'-end. It is likely that internal SD sequences induce a pause not on a single, but on several adjacent codons. This finding is important for our understanding of mRNA movement through the ribosome and also should facilitate interpretation of ribosome profiling data.", "paper_title": "rRNA:mRNA pairing alters the length and the symmetry of mRNA-protected fragments in ribosome profiling experiments", "paper_id": "WOS:000320065400002"}