{"auto_keywords": [{"score": 0.03217160122346607, "phrase": "key_frames"}, {"score": 0.023037818987105635, "phrase": "video_summarization"}, {"score": 0.008515874038515333, "phrase": "video_sequence"}, {"score": 0.00641700320981055, "phrase": "curvature_points"}, {"score": 0.00481495049065317, "phrase": "key_frame_extraction"}, {"score": 0.00421297029755273, "phrase": "essential_task"}, {"score": 0.00417793854311445, "phrase": "video_analysis"}, {"score": 0.004143196873246147, "phrase": "indexing_applications"}, {"score": 0.004057596233938867, "phrase": "innovative_approach"}, {"score": 0.0034332736827447654, "phrase": "visual_content"}, {"score": 0.0033905067962602515, "phrase": "different_frame_descriptors"}, {"score": 0.0032517484445814334, "phrase": "existing_methods"}, {"score": 0.0031579997262619758, "phrase": "clustering_or_optimization_strategies"}, {"score": 0.003066945490483524, "phrase": "variable_number"}, {"score": 0.0028327783069076883, "phrase": "cumulative_frame_differences"}, {"score": 0.0025838249689625775, "phrase": "frame_differences"}, {"score": 0.00246765655376112, "phrase": "second_high_curvature_point"}, {"score": 0.00215870824288082, "phrase": "fidelity"}], "paper_keywords": ["Video summarization", " Visual summary evaluation", " Dynamic key frames extraction", " Frame content description"], "paper_abstract": "Video summarization, aimed at reducing the amount of data that must be examined in order to retrieve the information desired from information in a video, is an essential task in video analysis and indexing applications. We propose an innovative approach for the selection of representative (key) frames of a video sequence for video summarization. By analyzing the differences between two consecutive frames of a video sequence, the algorithm determines the complexity of the sequence in terms of changes in the visual content expressed by different frame descriptors. The algorithm, which escapes the complexity of existing methods based, for example, on clustering or optimization strategies, dynamically and rapidly selects a variable number of key frames within each sequence. The key frames are extracted by detecting curvature points within the curve of the cumulative frame differences. Another advantage is that it can extract the key frames on the fly: curvature points can be determined while computing the frame differences and the key frames can be extracted as soon as a second high curvature point has been detected. We compare the performance of this algorithm with that of other key frame extraction algorithms based on different approaches. The summaries obtained have been objectively evaluated by three quality measures: the Fidelity measure, the Shot Reconstruction Degree measure and the Compression Ratio measure.", "paper_title": "An innovative algorithm for key frame extraction in video summarization", "paper_id": "WOS:000208118400011"}