{"auto_keywords": [{"score": 0.027664820318259856, "phrase": "arpc"}, {"score": 0.02581856372436002, "phrase": "ad_hoc_networks"}, {"score": 0.011647055380702176, "phrase": "cell_id_management_system"}, {"score": 0.010345243640321175, "phrase": "inter-cell_routing_protocol"}, {"score": 0.005821288730087051, "phrase": "location-based_clustering_protocol"}, {"score": 0.005033742476785277, "phrase": "different_cells"}, {"score": 0.00481495049065317, "phrase": "routing_protocol_for_mobile_ad_hoc_networks_with_cell_id_management_system"}, {"score": 0.004609352548073816, "phrase": "access_points"}, {"score": 0.004582608049002167, "phrase": "base_stations"}, {"score": 0.004425354103924516, "phrase": "geographical_or_time_constraints"}, {"score": 0.004336115760817672, "phrase": "military_and_disaster_situations"}, {"score": 0.0042859292226559535, "phrase": "commercial_uses"}, {"score": 0.0042610532651691305, "phrase": "sensor_networks"}, {"score": 0.00398510860837973, "phrase": "ad_hoc_network"}, {"score": 0.0038482788186350297, "phrase": "efficient_routing_protocol"}, {"score": 0.0036838048761094933, "phrase": "scalable_routing_protocol"}, {"score": 0.00357806560856829, "phrase": "anchor-based_routing_protocol"}, {"score": 0.003365755538047523, "phrase": "table-based_routing_strategy"}, {"score": 0.003336468343971626, "phrase": "geographic_routing_strategy"}, {"score": 0.0031845067058084583, "phrase": "intra-cell_routing_protocol"}, {"score": 0.002995478860085004, "phrase": "cell_id"}, {"score": 0.002909439481721751, "phrase": "intra-cell_routing"}, {"score": 0.0028094389072212352, "phrase": "route_packets"}, {"score": 0.0027287285441182133, "phrase": "cell_ids"}, {"score": 0.0026349227856780175, "phrase": "inter-cell_routing"}, {"score": 0.0022841153001549193, "phrase": "simulation_results"}, {"score": 0.0022184630090454132, "phrase": "large_networks"}, {"score": 0.0021736300003214267, "phrase": "multi-path_routing_strategy"}, {"score": 0.0021049977753042253, "phrase": "burden-gps_support"}], "paper_keywords": ["Mobile ad hoc networks", " routing", " cell", " scalability", " performance"], "paper_abstract": "Ad hoc networks. which do not rely on any infrastructure such as access Points or base stations, can be deployed rapidly and inexpensively even in situations With geographical or time constraints. Ad hoc networks are attractive in both military and disaster situations and also in commercial uses like sensor networks or conferencing. In ad hoc networks, each node acts both as a router and as a host. The topology of an ad hoc network may change dynamically, which makes it difficult to design an efficient routing protocol. As more and more wireless devices connect to the network, it is important to design a scalable routing protocol for ad hoc networks. In this paper, we propose Anchor-based Routing Protocol with Cell ID Management System (ARPC), a scalable routing protocol for ad hoc networks. It is,I hybrid routing protocol, which combines the table-based routing strategy with the geographic routing strategy. However, GPS (Global Positioning System) [1] support is not needed. ARPC consists of a location-based clustering protocol, an intra-cell routing protocol, an inter-cell routing protocol and a Cell ID Management System. The location-based clustering protocol divides the network region into various Cells. Each node knows the cell ID of the cell it is present in. The intra-cell routing Protocol routes packets within one cell. The inter-cell routing protocol is Used to route packets between nodes in different cells. The Cell ID Management System manages the cell IDs of all the nodes in the network. The combination of intra-cell and inter-cell routing, protocols makes ARPC highly scalable, since each node needs to only maintain routes within the cell it is present in. The inter-cell routing protocol establishes multiple routes between different cells, which makes ARPC reliable and efficient. We evaluate the performance of ARPC using the ns2 simulator. Simulation results show that ARPC is efficient and scales well to large networks. ARPC combines the advantages of multi-path routing strategy and geographic routing strategy-efficiency and scalability, and avoids the burden-GPS support.", "paper_title": "ARPC: Anchor-based Routing Protocol for Mobile Ad Hoc Networks With Cell ID Management System", "paper_id": "WOS:000205769800005"}