{"auto_keywords": [{"score": 0.045748880881297346, "phrase": "previous_works"}, {"score": 0.038136354061204386, "phrase": "different_subspace_cardinalities"}, {"score": 0.008885080844583145, "phrase": "dense_regions"}, {"score": 0.008086583336151209, "phrase": "region_densities"}, {"score": 0.005884554602531469, "phrase": "different_density_thresholds"}, {"score": 0.00481495049065317, "phrase": "density_conscious_subspace_clustering"}, {"score": 0.00480377690197615, "phrase": "dencos"}, {"score": 0.004781357546476652, "phrase": "high-dimensional_data"}, {"score": 0.004649302313891199, "phrase": "full_feature_space"}, {"score": 0.004616859702338596, "phrase": "subspace_clustering"}, {"score": 0.004568617813032014, "phrase": "emergent_task"}, {"score": 0.004304574865291508, "phrase": "density-based_approaches"}, {"score": 0.004170996594527844, "phrase": "high-density_region"}, {"score": 0.003929843413153981, "phrase": "critical_problem"}, {"score": 0.0035006643351909246, "phrase": "density_threshold"}, {"score": 0.0033564619316337634, "phrase": "serious_loss"}, {"score": 0.0032294837250130327, "phrase": "resulting_clusters"}, {"score": 0.00314015410819199, "phrase": "density_divergence_problem"}, {"score": 0.003042599375218838, "phrase": "novel_subspace_clustering_model"}, {"score": 0.002958423758207526, "phrase": "relative_region_densities"}, {"score": 0.0025087506382067536, "phrase": "previous_techniques"}, {"score": 0.0024824815904738685, "phrase": "novel_clustering_model"}, {"score": 0.0024307637980373552, "phrase": "innovative_algorithm"}, {"score": 0.0021049977753042253, "phrase": "high_quality"}], "paper_keywords": ["Data mining", " data clustering", " subspace clustering"], "paper_abstract": "Instead of finding clusters in the full feature space, subspace clustering is an emergent task which aims at detecting clusters embedded in subspaces. Most of previous works in the literature are density-based approaches, where a cluster is regarded as a high-density region in a subspace. However, the identification of dense regions in previous works lacks of considering a critical problem, called \"the density divergence problem\" in this paper, which refers to the phenomenon that the region densities vary in different subspace cardinalities. Without considering this problem, previous works utilize a density threshold to discover the dense regions in all subspaces, which incurs the serious loss of clustering accuracy (either recall or precision of the resulting clusters) in different subspace cardinalities. To tackle the density divergence problem, in this paper, we devise a novel subspace clustering model to discover the clusters based on the relative region densities in the subspaces, where the clusters are regarded as regions whose densities are relatively high as compared to the region densities in a subspace. Based on this idea, different density thresholds are adaptively determined to discover the clusters in different subspace cardinalities. Due to the infeasibility of applying previous techniques in this novel clustering model, we also devise an innovative algorithm, referred to as DENCOS (DENsity COnscious Subspace clustering), to adopt a divide-and-conquer scheme to efficiently discover clusters satisfying different density thresholds in different subspace cardinalities. As validated by our extensive experiments on various data sets, DENCOS can discover the clusters in all subspaces with high quality, and the efficiency of DENCOS outperformes previous works.", "paper_title": "Density Conscious Subspace Clustering for High-Dimensional Data", "paper_id": "WOS:000271852200003"}