{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientometric_indicators"}, {"score": 0.010432328426602518, "phrase": "research_project_proposals"}, {"score": 0.004773692073488661, "phrase": "peer-review_selection"}, {"score": 0.00467207889925365, "phrase": "ex_post_facto_evaluation"}, {"score": 0.004513961258859055, "phrase": "slovenia"}, {"score": 0.004417848254181138, "phrase": "peer_review_system"}, {"score": 0.004106063237069123, "phrase": "sound_international_peer-review_system"}, {"score": 0.003949974260471287, "phrase": "limited_number"}, {"score": 0.0037348894128879082, "phrase": "sound_international_peer_review"}, {"score": 0.0036553070575015344, "phrase": "interest_influence"}, {"score": 0.003353521531649663, "phrase": "making_systems"}, {"score": 0.0031166151196841308, "phrase": "high_percentage"}, {"score": 0.002680114113899346, "phrase": "significantly_smaller_percentage"}, {"score": 0.002294686545883412, "phrase": "peer-review_system"}, {"score": 0.0022651818270925704, "phrase": "ultimate_decision-making"}, {"score": 0.0021049977753042253, "phrase": "peer-review_scores"}], "paper_keywords": ["Scientometric indicators", " Research project proposals", " Ex post evaluation", " Peer review systems", " Conflict of interests"], "paper_abstract": "The paper discusses the role of scientometric indicators in peer-review selection of research project proposals. An ex post facto evaluation was made of three calls for research project proposals in Slovenia: 2003 with a peer review system designed in a way that conflict of interest was not avoided effectively, 2005 with a sound international peer-review system with minimized conflict of interest influence but a limited number of reviewers, and 2008 with a combination of scientometric indicators and a sound international peer review with minimized conflict of interest influence. The hypothesis was that the three different peer review systems would have different correlations with the same set of scientometric indicators. In the last two decision-making systems (2005 and 2008) where conflict of interest was effectively avoided, we have a high percentage (65%) of projects that would have been selected in the call irrespective of the method (peer review or bibliometrics solely). In contrast, in the 2003 call there is a significantly smaller percentage (49%) of projects that would have been selected in the call irrespective of the method (peer review or bibliometrics solely). It was shown that while scientometric indicators can hardly replace the peer-review system as the ultimate decision-making and support system, they can reveal its weaknesses on one hand and on the other can verify peer-review scores and minimize conflict of interest if necessary.", "paper_title": "Scientometric indicators: peer-review, bibliometric methods and conflict of interests", "paper_id": "WOS:000282048200004"}