{"auto_keywords": [{"score": 0.049695210111549475, "phrase": "saline_aquifers"}, {"score": 0.04523828542897123, "phrase": "gcs"}, {"score": 0.004739773204474094, "phrase": "vertical_and_horizontal_well_injection"}, {"score": 0.004363846362238565, "phrase": "safe_and_economical_geological_carbon_sequestration"}, {"score": 0.004081385289516914, "phrase": "u.s._and_other_parts"}, {"score": 0.004001828274595483, "phrase": "long-term_sequestration"}, {"score": 0.003908396188878932, "phrase": "storage_efficiency"}, {"score": 0.00384731849108269, "phrase": "leakage_risks"}, {"score": 0.003817137134650275, "phrase": "major_areas"}, {"score": 0.003584025547693836, "phrase": "carbon_sequestration"}, {"score": 0.003541923233726252, "phrase": "genetic_algorithm-based_optimizer"}, {"score": 0.0031845067058084583, "phrase": "optimal_injection_strategies"}, {"score": 0.0031223774204093713, "phrase": "vertical_injection"}, {"score": 0.003073545175760353, "phrase": "horizontal_injection"}, {"score": 0.0027961342030212353, "phrase": "carbon_sequestration_researchers"}, {"score": 0.002752390133272192, "phrase": "validated_code"}, {"score": 0.0026774738852854427, "phrase": "proposed_water-alternating-gas_injection_scheme"}, {"score": 0.002494039334114861, "phrase": "potential_benefits"}, {"score": 0.002426137929553722, "phrase": "optimization_capability"}, {"score": 0.0023976048394496446, "phrase": "hybrid_code"}, {"score": 0.0023694065215394593, "phrase": "great_promise"}, {"score": 0.002233301265743633, "phrase": "capillary_trapping"}], "paper_keywords": ["Geological CO2 sequestration", " Computational fluid dynamics", " Genetic algorithm", " Water-alternating-gas (WAG) injection", " Injection well orientation"], "paper_abstract": "With heightened concerns on CO2 emissions from pulverized-coal (PC) power plants, there has been major emphasis in recent years on the development of safe and economical geological carbon sequestration (GCS) technology. Saline aquifers are considered very attractive for GCS because of their large storage capacity in U.S. and other parts of the world for long-term sequestration. However, uncertainties about storage efficiency as well as leakage risks remain major areas of concern that need to be addressed before the saline aquifers can be fully exploited for carbon sequestration. A genetic algorithm-based optimizer has been developed and coupled with the well-known multiphase numerical solver TOUGH2 to optimally examine various injection strategies for increasing the CO2 storage efficiency as well as for reducing its plume migration. The optimal injection strategies for CO2 injection employing a vertical injection well and a horizontal injection well are considered. To ensure the accuracy of the results, the combined hybrid numerical solver/optimizer code was validated by conducting simulations of three widely used benchmark problems employed by carbon sequestration researchers worldwide. The validated code is then employed to optimize the proposed water-alternating-gas injection scheme for CO2 sequestration using both the vertical and the horizontal injection wells. The results suggest the potential benefits of CO2 migration control and dissolution. The optimization capability of the hybrid code holds a great promise in studying a host of other problems in GCS, namely how to optimally enhance capillary trapping, accelerate the dissolution of CO2 in water or brine, and immobilize the CO2 plume.", "paper_title": "Numerical simulation and optimization of CO2 sequestration in saline aquifers for vertical and horizontal well injection", "paper_id": "WOS:000308816800003"}