{"auto_keywords": [{"score": 0.047785680182713744, "phrase": "match-making_system"}, {"score": 0.00481495049065317, "phrase": "graph_mining_techniques"}, {"score": 0.004283423748543866, "phrase": "common_need"}, {"score": 0.0042351951710402425, "phrase": "real-world_examples"}, {"score": 0.0040783049361415614, "phrase": "job_search_networks"}, {"score": 0.003956971099850658, "phrase": "university_social_networks"}, {"score": 0.0036830211726031946, "phrase": "online_dating_network"}, {"score": 0.003325921766364862, "phrase": "efficient_match-making_system"}, {"score": 0.003263683763829895, "phrase": "existing_studies"}, {"score": 0.0030606302942851027, "phrase": "recommender_systems"}, {"score": 0.0026511422582578027, "phrase": "small_world_phenomenon"}, {"score": 0.002631172352670227, "phrase": "centrality_analysis"}, {"score": 0.0026113524778702602, "phrase": "density_analysis"}, {"score": 0.00243033541656411, "phrase": "new_type"}, {"score": 0.002287646331988365, "phrase": "proposed_type"}, {"score": 0.0022447938263410005, "phrase": "efficient_hybrid_recommender_system"}, {"score": 0.0021861425611350857, "phrase": "new_users"}, {"score": 0.0021049977753042253, "phrase": "baseline_methods"}], "paper_keywords": ["Online dating", " Match-making systems", " Graph", " Bipartite graph", " Social network", " Recommendation systems"], "paper_abstract": "A people-to-people matching system (or a match-making system) refers to a system in which users join with the objective of meeting other users with the common need. Some real-world examples of these systems are employer-employee (in job search networks), mentor-student (in university social networks), consume-to-consumer (in marketplaces) and male-female (in an online dating network). The network underlying in these systems consists of two groups of users, and the relationships between users need to be captured for developing an efficient match-making system. Most of the existing studies utilize information either about each of the users in isolation or their interaction separately, and develop recommender systems using the one form of information only. It is imperative to understand the linkages among the users in the network and use them in developing a match-making system. This study utilizes several social network analysis methods such as graph theory, small world phenomenon, centrality analysis, density analysis to gain insight into the entities and their relationships present in this network. This paper also proposes a new type of graph called \"attributed bipartite graph\". By using these analyses and the proposed type of graph, an efficient hybrid recommender system is developed which generates recommendation for new users as well as shows improvement in accuracy over the baseline methods.", "paper_title": "A people-to-people matching system using graph mining techniques", "paper_id": "WOS:000331971100002"}