{"auto_keywords": [{"score": 0.04971911912939944, "phrase": "wrong-patient_medication_errors"}, {"score": 0.008665056313075487, "phrase": "problem_list"}, {"score": 0.006129554727029778, "phrase": "intercepted_errors"}, {"score": 0.00481495049065317, "phrase": "indication-based_prescribing"}, {"score": 0.00474283953918251, "phrase": "computerized_provider_order_entry"}, {"score": 0.004332199142914195, "phrase": "academic_medical_center"}, {"score": 0.004156012879026324, "phrase": "clinical_decision_support_system"}, {"score": 0.003971938976270902, "phrase": "appropriately_coded_indication"}, {"score": 0.0037390789999636764, "phrase": "medication_order"}, {"score": 0.0036005006349430586, "phrase": "fixed_time_interval"}, {"score": 0.003440945901489461, "phrase": "different_patient"}, {"score": 0.0028058141911641225, "phrase": "interception_rate"}, {"score": 0.002591681512611419, "phrase": "patients'_charts"}, {"score": 0.002552781867125423, "phrase": "first_order"}, {"score": 0.0023938516706864775, "phrase": "problem_list_completion"}, {"score": 0.00227040825063645, "phrase": "indication-based_alerts"}, {"score": 0.0022447938263410023, "phrase": "wrong-patient_medication_error_interception_rate"}], "paper_keywords": [""], "paper_abstract": "Objective To determine whether indication-based computer order entry alerts intercept wrong-patient medication errors. Materials and methods At an academic medical center serving inpatients and outpatients, we developed and implemented a clinical decision support system to prompt clinicians for indications when certain medications were ordered without an appropriately coded indication on the problem list. Among all the alerts that fired, we identified every instance when a medication order was started but not completed and, within a fixed time interval, the same prescriber placed an order for the same medication for a different patient. We closely reviewed each of these instances to determine whether they were likely to have been intercepted errors. Results Over a 6-year period 127 320 alerts fired, which resulted in 32 intercepted wrong-patient errors, an interception rate of 0.25 per 1000 alerts. Neither the location of the prescriber nor the type of prescriber affected the interception rate. No intercepted errors were for patients with the same last name, but in 59% of the intercepted errors the prescriber had both patients' charts open when the first order was initiated. Discussion Indication alerts linked to the problem list have previously been shown to improve problem list completion. This analysis demonstrates another benefit, the interception of wrong-patient medication errors. Conclusions Indication-based alerts yielded a wrong-patient medication error interception rate of 0.25 per 1000 alerts. These alerts could be implemented independently or in combination with other strategies to decrease wrong-patient medication errors.", "paper_title": "Indication-based prescribing prevents wrong-patient medication errors in computerized provider order entry (CPOE)", "paper_id": "WOS:000317477500012"}