{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "irrationally_allocated_resources"}, {"score": 0.02794092139385494, "phrase": "business_process"}, {"score": 0.02693413145586967, "phrase": "resource_allocation"}, {"score": 0.0085124026852815, "phrase": "network_centrality_analysis"}, {"score": 0.008085493670801051, "phrase": "manufacturing_enterprise"}, {"score": 0.00743226129743087, "phrase": "original_resource_allocation"}, {"score": 0.004529881123652277, "phrase": "important_target"}, {"score": 0.004424768776701965, "phrase": "continuous_business_process_improvement"}, {"score": 0.00432208488976429, "phrase": "suitable_method"}, {"score": 0.0035648266669315943, "phrase": "main_emphasis"}, {"score": 0.0029816229984366374, "phrase": "business_tasks"}, {"score": 0.002939853413763817, "phrase": "dependent_network"}, {"score": 0.0028312983170567948, "phrase": "event_logs"}, {"score": 0.002726740692380339, "phrase": "eigenvector_centrality-based_algorithm"}, {"score": 0.0025171669791790438, "phrase": "resources'_influence"}, {"score": 0.002301896758256575, "phrase": "grubbs'_criterion"}, {"score": 0.002196077907454079, "phrase": "quality_control_process"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["business process", " resources allocation", " resources-dependent network", " eigenvector centrality analysis"], "paper_abstract": "The optimisation of resource allocation is an important target of the manufacturing enterprise in continuous business process improvement. It is a suitable method that helps enterprise to discover irrationally allocated resources through analysis of the original resource allocation, and then optimise the resource allocation of the business process gradually. To identify the irrationally allocated resources, a method to analyse the original resource allocation in business process based on network centrality analysis is introduced. The main emphasis of this article is focused on the relationships among the resources. And the influence of resources is used to reflect the result of resource allocation. First, on the basis of the relationships by handover of business tasks, the dependent network among the resources is established using the event logs of the business process. Then, the eigenvector centrality-based algorithm is provided to calculate the influence of resources. In addition, the balance of the resources' influence is defined as the index of the optimisation of resource allocation. And the irrationally allocated resources are found out by Grubbs' criterion. Finally, an example to identify irrationally allocated resources of quality control process in a manufacturing enterprise is reported to verify the proposed approach.", "paper_title": "The identification of irrationally allocated resources in business process based on network centrality analysis", "paper_id": "WOS:000296271800005"}