{"auto_keywords": [{"score": 0.04839945497190438, "phrase": "elastic_earth_models"}, {"score": 0.04586846484671967, "phrase": "refined_crustal_structure"}, {"score": 0.04454153022265076, "phrase": "green's_functions"}, {"score": 0.00481495049065317, "phrase": "load_love"}, {"score": 0.0047428142821406135, "phrase": "green"}, {"score": 0.004303830426772906, "phrase": "load_love_numbers"}, {"score": 0.0035997473694089964, "phrase": "prem"}, {"score": 0.0034556603183020407, "phrase": "crustal_structure"}, {"score": 0.0033685408148574846, "phrase": "love_numbers"}, {"score": 0.0028459677232555176, "phrase": "loading_processes"}, {"score": 0.0027180637278063254, "phrase": "grace"}, {"score": 0.0024918548761791435, "phrase": "different_models"}, {"score": 0.0023798115577749225, "phrase": "loading_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Loading Love numbers", " Green's function", " PREM", " iasp91 and ak135", " Crust 2.0"], "paper_abstract": "Load Love numbers and Green's functions are computed for elastic Earth models PREM, iasp91 and ak135, and their modified models with refined crustal structure from Crust 2.0. It is found that the differences of results between iasp91 or ak135 and PREM, and the effects of refinement of crustal structure are significant for the Love numbers of degrees from around 200 to very high numbers, and for the Green's functions in the near-field. The results of the models given in this paper are applicable to the studies related to loading processes (present surface mass transport as measured by GRACE and GPS, ocean tide loading, etc.), making it possible to use different models or assess the uncertainties of solutions of the loading problems under investigation. In order to ensure the stability of the solutions for degrees larger than 360 (or when the resolution is less than 55 km), a variable transformation on the solution vector is used in this paper and proved to work effectively. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Load Love numbers and Green's functions for elastic Earth models PREM, iasp91, ak135, and modified models with refined crustal structure from Crust 2.0", "paper_id": "WOS:000311656300021"}