{"auto_keywords": [{"score": 0.04711611682857166, "phrase": "architectural_decisions"}, {"score": 0.005773852932985987, "phrase": "systematic_overview"}, {"score": 0.00481495049065317, "phrase": "software_architectural_decisions"}, {"score": 0.004670896353428476, "phrase": "software_architecture"}, {"score": 0.004422325007817267, "phrase": "software_engineering"}, {"score": 0.004382196270563035, "phrase": "significant_attention"}, {"score": 0.003857022173615399, "phrase": "previous_research"}, {"score": 0.003822003373331997, "phrase": "future_research"}, {"score": 0.003651603914126771, "phrase": "research_results"}, {"score": 0.003520751317164754, "phrase": "systematic_mapping_study"}, {"score": 0.00342568771304873, "phrase": "six_research_questions"}, {"score": 0.003384262486955773, "phrase": "six_reference_databases"}, {"score": 0.0033433365160336842, "phrase": "initial_result_set"}, {"score": 0.003253047640423623, "phrase": "filtering_process"}, {"score": 0.003117405395602633, "phrase": "research_question"}, {"score": 0.003070340620983981, "phrase": "current_research"}, {"score": 0.0029066973917258655, "phrase": "potential_future_research_topics"}, {"score": 0.0027854565462509095, "phrase": "specific_quality_attributes"}, {"score": 0.002669259222649505, "phrase": "group_architectural_decisions"}, {"score": 0.002644995764097807, "phrase": "empirical_evaluations"}, {"score": 0.0024887661666249876, "phrase": "case_studies"}, {"score": 0.002370437342182877, "phrase": "increasing_interest"}, {"score": 0.0021900066569764862, "phrase": "promising_future_research_directions"}, {"score": 0.0021503542912161243, "phrase": "existing_papers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software architecture", " Architectural decisions", " Systematic mapping study"], "paper_abstract": "Context: The software architecture of a system is the result of a set of architectural decisions. The topic of architectural decisions in software engineering has received significant attention in recent years. However, no systematic overview exists on the state of research on architectural decisions. Objective: The goal of this study is to provide a systematic overview of the state of research on architectural decisions. Such an overview helps researchers reflect on previous research and plan future research. Furthermore, such an overview helps practitioners understand the state of research, and how research results can help practitioners in their architectural decision-making. Method: We conducted a systematic mapping study, covering studies published between January 2002 and January 2012. We defined six research questions. We queried six reference databases and obtained an initial result set of 28,895 papers. We followed a search and filtering process that resulted in 144 relevant papers. Results: After classifying the 144 relevant papers for each research question, we found that current research focuses on documenting architectural decisions. We found that only several studies describe architectural decisions from the industry. We identified potential future research topics: domain-specific architectural decisions (such as mobile), achieving specific quality attributes (such as reliability or scalability), uncertainty in decision-making, and group architectural decisions. Regarding empirical evaluations of the papers, around half of the papers use systematic empirical evaluation approaches (such as surveys, or case studies). Still, few papers on architectural decisions use experiments. Conclusion: Our study confirms the increasing interest in the topic of architectural decisions. This study helps the community reflect on the past ten years of research on architectural decisions. Researchers are offered a number of promising future research directions, while practitioners learn what existing papers offer. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Past and future of software architectural decisions - A systematic mapping study", "paper_id": "WOS:000337261800003"}