{"auto_keywords": [{"score": 0.04752792565240918, "phrase": "mas"}, {"score": 0.007740352871852143, "phrase": "academic_search_engine"}, {"score": 0.007630063844567392, "phrase": "microsoft_academic_search"}, {"score": 0.004718897469501381, "phrase": "purpose_-_the_purpose"}, {"score": 0.0046114557978424245, "phrase": "obsolescence_process"}, {"score": 0.004573673810024604, "phrase": "unnoticed_obsolescence"}, {"score": 0.004193404476461011, "phrase": "total_number"}, {"score": 0.003694136180797615, "phrase": "automated_querying_process"}, {"score": 0.0036412884223690576, "phrase": "academic_publications"}, {"score": 0.0035788645387235395, "phrase": "findings_-_mas"}, {"score": 0.003301363873919944, "phrase": "new_records"}, {"score": 0.003226092536458597, "phrase": "minimum_rate"}, {"score": 0.00317991916931357, "phrase": "apparent_pattern"}, {"score": 0.003107408147235875, "phrase": "retrospective_records"}, {"score": 0.002690118949960196, "phrase": "scientific_information"}, {"score": 0.0026211746739675927, "phrase": "quantitative_purposes"}, {"score": 0.002553992825810561, "phrase": "google_scholar"}, {"score": 0.0024957189346354507, "phrase": "academic_search_engines_market"}, {"score": 0.00243877141503813, "phrase": "open_construction_model"}, {"score": 0.0023969131085585602, "phrase": "closed_model"}, {"score": 0.0022690324237501927, "phrase": "first_time"}, {"score": 0.0022300809511147305, "phrase": "public_explanation"}, {"score": 0.002217245958060308, "phrase": "disclaimer_note"}, {"score": 0.0021791815390109744, "phrase": "responsible_company"}, {"score": 0.0021049977753042253, "phrase": "bibliometric_data"}], "paper_keywords": ["Universities", " Google Scholar", " Academic journals", " Academic search engines", " Microsoft Academic Search", " Scientific fields"], "paper_abstract": "Purpose - The purpose of this paper is to describe the obsolescence process of Microsoft Academic Search (MAS) as well as the effects of this decline in the coverage of disciplines and journals, and their influence in the representativeness of organizations. Design/methodology/approach - The total number of records and those belonging to the most reputable journals (1,762) and organizations (346) according to the Field Rating indicator in each of the 15 fields and 204 sub-fields of MAS, have been collected and statistically analysed in March 2014, by means of an automated querying process via http, covering academic publications from 1700 to present. Findings - MAS has no longer been updated since 2013, although this phenomenon began to be glimpsed in 2011, when its coverage plummeted. Throughout 2014, indexing of new records is still ongoing, but at a minimum rate, without following any apparent pattern. Research limitations/implications - There are also retrospective records being indexed at present. In this sense, this research provides a picture of what MAS offered during March 2014 being queried directly via http. Practical implications - The unnoticed obsolescence of MAS affects to the quality of the service offered to its users (both those who engage in scientific information seeking and also those who use it for quantitative purposes). Social implications - The predominance of Google Scholar (GS) as monopoly in the academic search engines market as well as the prevalence of an open construction model (GS) vs a closed model (MAS). Originality/value - A complete longitudinal analysis of disciplines, journals and organizations on MAS has been performed for the first time identifying an unnoticed obsolescence. Any public explanation or disclaimer note has been announced from the responsible company, something incomprehensible given its implications for the reliability and validity of bibliometric data provided on disciplines, journals, authors and congress as well as their fair representation on the academic search engine.", "paper_title": "The silent fading of an academic search engine: the case of Microsoft Academic Search", "paper_id": "WOS:000348443200006"}