{"auto_keywords": [{"score": 0.04449434168162259, "phrase": "dc"}, {"score": 0.009717255015446295, "phrase": "induced_voltage"}, {"score": 0.007293440209649707, "phrase": "short-circuit_current"}, {"score": 0.006586294158805168, "phrase": "magnetic_flux"}, {"score": 0.00481495049065317, "phrase": "superconducting_fault"}, {"score": 0.004733625412289433, "phrase": "purpose_-_saturated_core_type_superconducting_fault"}, {"score": 0.0043842558719324526, "phrase": "high_induced_voltage"}, {"score": 0.003958049372486465, "phrase": "increasing_short-circuit_current"}, {"score": 0.0033517342967390065, "phrase": "electric_circuit"}, {"score": 0.003239304090565123, "phrase": "ac_windings"}, {"score": 0.003104038398386081, "phrase": "three-dimensional_finite_element_method"}, {"score": 0.002754516260621121, "phrase": "dc_core_column"}, {"score": 0.0025947642929906407, "phrase": "induced_voltage_reduction"}, {"score": 0.0025076619172878945, "phrase": "coupled_energy"}, {"score": 0.0024863459251358217, "phrase": "dc_winding"}, {"score": 0.0022731540640627307, "phrase": "low_resistance"}, {"score": 0.0022442249871042026, "phrase": "-_the_different_methods"}, {"score": 0.0021049977753042253, "phrase": "decreased_induced_voltage"}], "paper_keywords": ["Induced voltage", " Short-circuit", " Superconducting fault current limiter"], "paper_abstract": "Purpose - Saturated core type superconducting fault current limiter (SFCL) can effectively limit the short-circuit current in power system. However, the high induced voltage will occur between the terminals of DC superconducting bias winding caused by the variation of magnetic flux linked by DC winding due to the increasing short-circuit current. The DC source may be damaged. Thus, the induced voltage should be considered in DC winding design. The paper aims to discuss these issues. Design/methodology/approach - Three-dimensional finite element method coupled with electric circuit. Findings - The short-circuit current flowing through AC windings and induced voltage of DC winding are analyzed by using three-dimensional finite element method coupled with electric circuit for a 220-kV three-phase SFCL. Several circuit elements, such as a capacitor connected with DC winding in parallel, an additional short-circuit winding wound around DC core column and an energy-released piezoresistor, are, respectively, used for induced voltage reduction. These methods aim to save magnetic coupled energy in DC winding, or oppose the variation of magnetic flux, or limit the voltage of DC winding by using a resistor with low resistance. Originality/value - The different methods for reduction of induced voltage of superconducting DC winding are studied and discussed. The decreased induced voltage may benefit the safety of superconducting DC winding and the source.", "paper_title": "Induced voltage analysis of superconducting fault current limiter", "paper_id": "WOS:000332135500004"}