{"auto_keywords": [{"score": 0.049100450513748305, "phrase": "bingo_voting"}, {"score": 0.04814050608144561, "phrase": "cryptographic_voting_schemes"}, {"score": 0.04682648206734893, "phrase": "ballot_secrecy"}, {"score": 0.00481495049065317, "phrase": "enhancing_electronic_voting_machines"}, {"score": 0.004658426838467567, "phrase": "main_purpose"}, {"score": 0.004396600680348434, "phrase": "fast_tally"}, {"score": 0.0039323225960857956, "phrase": "corrupted_voting_machine"}, {"score": 0.00371115485111022, "phrase": "novel_approach"}, {"score": 0.0036653985479652854, "phrase": "encapsulated_design"}, {"score": 0.003502382624110703, "phrase": "second_issue"}, {"score": 0.002907405102646616, "phrase": "voting_schemes"}, {"score": 0.002789528662623221, "phrase": "last_issue"}, {"score": 0.0021049977753042253, "phrase": "secure_election"}], "paper_keywords": ["Ballot secrecy", " contesting election results", " election protocols", " electronic voting", " receipt stealing"], "paper_abstract": "The main purpose of cryptographic voting schemes is to provide transparency while protecting ballot secrecy and to enable a fast tally. In this paper, we address three major issues of cryptographic voting schemes. First we discuss the problem of secrecy and coercion resistance in the situation of a corrupted voting machine. While hard to obtain in general, we propose and analyze a novel approach that uses encapsulated design and minimizes the information that can compromise ballot secrecy. The second issue we address is the assumption that an adversary does not know which receipts are checked and the problem of receipt stealing. Many voting schemes with receipts share this vulnerability. We provide a solution that increases protection of each vote and which can be generalized for voting schemes that use computers to form the receipt. The last issue discussed in this paper is the question of how an election can be contested. For this, an error or a manipulation must not only be detected but also proven. While the problems and solutions are described for Bingo Voting, we argue that the problems are shared by many cryptographic voting schemes and that the solutions presented in this work give insight in the prerequisites needed for a secure election.", "paper_title": "Enhancing Electronic Voting Machines on the Example of Bingo Voting", "paper_id": "WOS:000271968100014"}