{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "burrows-wheeler_transform"}, {"score": 0.014899298413201083, "phrase": "text_t"}, {"score": 0.008544191428505052, "phrase": "suffix_array"}, {"score": 0.004707479285061122, "phrase": "four-stage_algorithm"}, {"score": 0.00391167729353583, "phrase": "new_text"}, {"score": 0.0037219886365287085, "phrase": "recent_advances"}, {"score": 0.0036553070575015344, "phrase": "structure_new_applications"}, {"score": 0.0036060781902674207, "phrase": "major_bottleneck"}, {"score": 0.0032794890195334513, "phrase": "standard_edit_operations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Burrows-Wheeler transform", " Compression", " Dynamic", " Suffix array", " Edit operations", " Algorithm design", " Self-index data structures"], "paper_abstract": "We present a four-stage algorithm that updates the Burrows-Wheeler Transform of a text T, when this text is modified. The Burrows-Wheeler Transform is used by many text compression applications and some self-index data structures. It operates by reordering the letters of a text T to obtain a new text bwt(T) which can be better compressed. Even though recent advances are offering this structure new applications, a major bottleneck still exists: bwt(T) has to be entirely reconstructed from scratch whenever T is modified. We study how standard edit operations (insertion, deletion, substitution of a letter or a factor) that transform a text T into T' impact bwt(T). Then we present an algorithm that directly converts bwt(T) into bwt(T'). Based on this algorithm, we also sketch a method for converting the suffix array of T into the suffix array of T'. We finally show, based on the experiments we conducted, that this algorithm, whose worst-case time complexity is O(vertical bar T vertical bar log vertical bar T vertical bar(1 + log sigma/log log vertical bar T vertical bar)), performs really well in practice and replaces advantageously the traditional approach. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "A four-stage algorithm for updating a Burrows-Wheeler transform", "paper_id": "WOS:000270627100007"}