{"auto_keywords": [{"score": 0.04908283602542125, "phrase": "internet_use"}, {"score": 0.04880181803815785, "phrase": "parental_mediation"}, {"score": 0.008061319597819925, "phrase": "television_viewing"}, {"score": 0.006267121820635722, "phrase": "significant_differences"}, {"score": 0.00481495049065317, "phrase": "research_project"}, {"score": 0.004644451060812007, "phrase": "cross-cultural_sample_group"}, {"score": 0.004413148455148519, "phrase": "sample_group"}, {"score": 0.004282483226549419, "phrase": "eight_different_cultural_contexts"}, {"score": 0.004244040105917499, "phrase": "television_viewing_habits_questionnaire"}, {"score": 0.003751834457361072, "phrase": "online_platform"}, {"score": 0.0036516442918817214, "phrase": "moderate_use"}, {"score": 0.003597139600764093, "phrase": "context-based_variations"}, {"score": 0.0035541200911490614, "phrase": "communicative_function"}, {"score": 0.0035010659378711816, "phrase": "cultural_contexts"}, {"score": 0.003407549468745519, "phrase": "different_contexts"}, {"score": 0.003122824878906245, "phrase": "exploratory_factorial_analysis"}, {"score": 0.0030577296589049704, "phrase": "restrictive_mediation"}, {"score": 0.0029139757013408926, "phrase": "cluster_analysis"}, {"score": 0.0028532214778379597, "phrase": "young_people"}, {"score": 0.0027272537812174365, "phrase": "inhibited_profile"}, {"score": 0.002311013816721592, "phrase": "instructive_mediation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Internet use", " Adolescents", " Parental mediation in Internet use", " Cross-cultural study"], "paper_abstract": "The aim of this research project was to analyze the relationship between Internet use and parental mediation in a cross-cultural sample group. It also aimed to explore the relationship between parental mediation in Internet use and television viewing. The sample group comprised 1238 adolescents aged between 14 and 19, from eight different cultural contexts. The television viewing habits questionnaire (CH-TV.02) was used to analyze the following indicators: reason for use and hours spent on the Internet, parental mediation in Internet use and parental mediation in television viewing. The data were collected both by means of an online platform and in person. The results show a moderate use of the Internet with context-based variations, although the communicative function was predominant in all cultural contexts studied. Although significant differences were found between the different contexts, they were moderate in nature and should be interpreted with caution, given the size of the sample. In relation to parental mediation in Internet use, an exploratory factorial analysis found three types of mediation, with restrictive mediation and co-viewing being particularly relevant. As regards the profiles found, a Cluster analysis identified four profiles in the group of young people studied: instructive, inhibited, co-viewing and restrictive, with the inhibited profile being the one most frequently perceived by adolescents, followed by co-viewing, with significant differences being observed between cultures. Differences were observed in parental mediation in Internet use and television viewing in accordance with the medium in question and the context, a finding which may indicate that parents find it harder to engage in instructive mediation and co-viewing in relation to the Internet, since it is a medium that is less ergonomic and user-friendly than television. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Internet use and parental mediation: A cross-cultural study", "paper_id": "WOS:000326554100020"}