{"auto_keywords": [{"score": 0.049651030276363105, "phrase": "previous_trust_models"}, {"score": 0.047975388252729304, "phrase": "explicit_trust_ratings"}, {"score": 0.046553380744206535, "phrase": "user-generated_content"}, {"score": 0.00481495049065317, "phrase": "electronic_community"}, {"score": 0.0046659637258752535, "phrase": "reputational_mechanism"}, {"score": 0.00450130420152996, "phrase": "large_amount"}, {"score": 0.0035156341294017685, "phrase": "trust_scales"}, {"score": 0.0031277316566463978, "phrase": "trust_matrix"}, {"score": 0.0027328817607818207, "phrase": "trust-related_information"}, {"score": 0.0026126405272417783, "phrase": "reputation-based_trust_models"}, {"score": 0.0025660347613972573, "phrase": "role-based_and_behavior-based_reasoning_functionalities"}, {"score": 0.0024864612830452254, "phrase": "category-specific_trust_relationships"}, {"score": 0.0022520496048464406, "phrase": "experimental_results"}, {"score": 0.0022019274077124795, "phrase": "pure_user_similarity_method"}, {"score": 0.0021821915946356168, "phrase": "linear_decay_trust-aware_technique"}, {"score": 0.0021049977753042253, "phrase": "recommender_system"}], "paper_keywords": ["content-based", " context-based", " reputation-based", " trust model", " web of trust"], "paper_abstract": "Previous trust models are mainly focused on reputational mechanism based on explicit trust ratings. However, the large amount of user-generated content and community context published on Web is often ignored. Without enough information, there are several problems with previous trust models: first, they cannot determine in which field one user trusts in another, so many models assume that trust exists in all fields. Second some models are not able to delineate the variation of trust scales, therefore they regard each user trusts all his friends to the same extent. Third, since these models only focus on explicit trust ratings, so the trust matrix is very sparse. To solve these problems, we present RCCtrust - a trust model which combines Reputation-, Content- and Context-based mechanisms to provide more accurate, fine-grained and efficient trust management for the electronic community. We extract trust-related information from user-generated content and community context from Web to extend reputation-based trust models. We introduce role-based and behavior-based reasoning functionalities to infer user's interests and category-specific trust relationships. Following the study in sociology, RCCtrust exploits similarities between pairs of users to depict differentiated trust scales. The experimental results show that RCCtrust outperforms pure user similarity method and linear decay trust-aware technique in both accuracy and coverage for a Recommender System.", "paper_title": "RCCtrust: A Combined Trust Model for Electronic Community", "paper_id": "WOS:000270282900008"}