{"auto_keywords": [{"score": 0.046081391722127725, "phrase": "health_consumers"}, {"score": 0.015197298169516184, "phrase": "personal_health_task"}, {"score": 0.011203281044380746, "phrase": "research_study"}, {"score": 0.00601201412343241, "phrase": "search_assisting"}, {"score": 0.00481495049065317, "phrase": "preliminary_study"}, {"score": 0.004624401316503576, "phrase": "purpose_-_current_research_topics_in_relation_to_health_information_searching_focus"}, {"score": 0.004448711499857491, "phrase": "medlineplus"}, {"score": 0.004441359373498799, "phrase": "health_search"}, {"score": 0.004278807087784626, "phrase": "health_task"}, {"score": 0.004239103253656808, "phrase": "limited_medical_knowledge"}, {"score": 0.004160792819919432, "phrase": "health_domains"}, {"score": 0.004058615475230867, "phrase": "search_session"}, {"score": 0.0039221899471111, "phrase": "preliminary_exploratory_research_study"}, {"score": 0.003452742572806342, "phrase": "search_domain"}, {"score": 0.003336614511719501, "phrase": "first_time_users"}, {"score": 0.0032647501331200023, "phrase": "first_time"}, {"score": 0.003254610516477302, "phrase": "medical_searchers"}, {"score": 0.002777055546998579, "phrase": "key_contributions"}, {"score": 0.0023328069356960204, "phrase": "health_domain"}, {"score": 0.0023183255207530193, "phrase": "human_computer_designers"}, {"score": 0.0022683432490549064, "phrase": "specialized_search"}, {"score": 0.0021987994275190314, "phrase": "theoretical_contributions"}, {"score": 0.0021851480717840484, "phrase": "health_searchers"}], "paper_keywords": ["Medical domain", " Personal health task", " Search assisting features", " Search behaviour", " User study"], "paper_abstract": "Purpose - Current research topics in relation to health information searching focus on challenges faced by health consumers and domains used to perform the health search. Health consumers may not be capable of successfully searching for a health task due to limited medical knowledge. As such search assisting features provided on health domains are important in assisting health consumers during a search session. The purpose of this paper is to perform a preliminary exploratory research study to understand if search assisting features are visible to searchers and the usage of search assisting features when searching on a personal health task. Design/methodology/approach - A convenience sampling method in a university setting and an observational type study was used. MedlinePlus is used as the search domain for this research study. While participants of this research study were first time users of MedlinePlus, they were not first time medical searchers. Findings - Results of this research study indicate health consumers do not utilize search assisting features when searching for a personal health task. This is because health consumers are comfortable with their search skills. In other cases health consumers found the search assisting features irrelevant or had no confidence in the search assisting features presented. Key contributions of this research study indicate health consumers do not utilize search assisting features when searching for a personal health task. This is because health consumers are comfortable with their search skills. In other cases health consumers found the search assisting features irrelevant or had no confidence in the search assisting features presented. Research limitations/implications - Results of this research study has implications for health domain and human computer designers in relation to the development of specialized search assisting features and the placement of these features. Theoretical contributions indicate health searchers use search assisting features minimally when searching on a personal health task. Originality/value - Results of this research study indicate health consumers do not utilize search assisting features when searching for a personal health task. This is because health consumers are comfortable with their search skills. In other cases health consumers found the search assisting features irrelevant or had no confidence in the search assisting features presented.", "paper_title": "A preliminary study on the usage of search assisting features when searching for a personal health task", "paper_id": "WOS:000352709900003"}