{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "interoperable_supply_chains"}, {"score": 0.0047707093928203, "phrase": "performance_measurement"}, {"score": 0.004513631630494221, "phrase": "increasingly_competitive_context"}, {"score": 0.0042506731642425275, "phrase": "supply_chain"}, {"score": 0.0034052594710793664, "phrase": "first_part"}, {"score": 0.0031045562469735307, "phrase": "weak_alien_problem_resolution"}, {"score": 0.0030056887638095883, "phrase": "second_part"}, {"score": 0.002883172383460653, "phrase": "business_processes"}, {"score": 0.002714943351733626, "phrase": "organisation_heterogeneity"}, {"score": 0.0026775328564629577, "phrase": "third_part"}, {"score": 0.0026042472337367015, "phrase": "performance_measurement_system"}, {"score": 0.0023198180380964305, "phrase": "last_part"}, {"score": 0.0022563011263787847, "phrase": "ecograi_method"}, {"score": 0.002204697943520258, "phrase": "software_tool"}, {"score": 0.0021344259291927914, "phrase": "manufacturing_and_maintenance_companies"}], "paper_keywords": ["interoperability", " enterprise modelling", " performance measurement system", " ECOGRAI method", " PBview software tool"], "paper_abstract": "Today, the enterprise must cooperate to survive in an increasingly competitive context. This co-operation is carried out by organisations in networks through the supply chain (SC). In order to do so, enterprises must be interoperable. In order to reach interoperability, the system must eradicate heterogeneity. This paper aims at presenting the problems of heterogeneity from two different points of view: semantic and organisational. In the first part, the paper exposes the problems of heterogeneity from the two points of view. This part insists on the weak alien problem resolution for the semantics. In the second part, the synchronisation and standardisation of practices of business processes are presented in order to solve a part of the problem of organisation heterogeneity. The third part presents the use of the performance measurement system to manage the evolution of the enterprises towards interoperability, i.e. the implementation and exploitation of the principles exposed previously. Then, the last part presents an application of the ECOGRAI method and implementation using a software tool in the frame of interoperability between manufacturing and maintenance companies. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Evolution management towards interoperable supply chains using performance measurement", "paper_id": "WOS:000248881000012"}