{"auto_keywords": [{"score": 0.046406428866983235, "phrase": "image_pixels"}, {"score": 0.008713768692145006, "phrase": "local_image_structure"}, {"score": 0.008627799835523507, "phrase": "normalized_cut"}, {"score": 0.007004776446489136, "phrase": "early_human_vision"}, {"score": 0.004272724011826495, "phrase": "normalized_cut_based_graph"}, {"score": 0.0041469500929423595, "phrase": "popular_ones"}, {"score": 0.0040048667115255, "phrase": "credible_allegiance"}, {"score": 0.003945467978172845, "phrase": "perceptual_grouping"}, {"score": 0.0026745503978347143, "phrase": "local_image_structure_utilization"}, {"score": 0.002595698433525986, "phrase": "appropriate_incorporation"}, {"score": 0.00239657981537094, "phrase": "fuzzy_set"}, {"score": 0.0022913497040895586, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Perceptual grouping", " Early human vision", " Image pixel grouping", " Local image structure", " Graph partitioning", " Normalized cut"], "paper_abstract": "Graph partitioning for grouping of image pixels has been explored a lot, with normalized cut based graph partitioning being one of the popular ones. In order to have a credible allegiance to the perceptual grouping taking place in early human vision, we propose and study in this paper the incorporation of local image structure/context in normalized cut based graph partitioning for grouping of image pixels. Similarity and proximity, which have been studied earlier for grouping of image pixels, are only two among many perceptual cues that act during grouping in early human vision. In addition to the said two cues, we study three other such cues, namely, common fate, common region and continuity, and find indications of local image structure utilization during grouping of image pixels. Appropriate incorporation of local image structure/context is achieved by representing it using neighborhood in the form of histogram and fuzzy set. We demonstrate both qualitatively and quantitatively through experimental results that the incorporation of local image structure improves performance of grouping of image pixels. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Incorporating local image structure in normalized cut based graph partitioning for grouping of pixels", "paper_id": "WOS:000324350000013"}