{"auto_keywords": [{"score": 0.03575675959195482, "phrase": "legal_contracts"}, {"score": 0.00481495049065317, "phrase": "web_interactions"}, {"score": 0.0047026237903774895, "phrase": "personal_and_confidential_information"}, {"score": 0.004539005582217305, "phrase": "business_transactions"}, {"score": 0.004398331355940011, "phrase": "key_issue"}, {"score": 0.003908396188878932, "phrase": "traditional_world"}, {"score": 0.003802135020791801, "phrase": "contractual_agreements"}, {"score": 0.003541923233726252, "phrase": "trust_issue"}, {"score": 0.003459191419478298, "phrase": "major_gap"}, {"score": 0.002897109710213723, "phrase": "underlying_it_infrastructure"}, {"score": 0.002573965014439041, "phrase": "electronic_data"}, {"score": 0.0023976048394496446, "phrase": "involved_challenges"}, {"score": 0.002259883463607508, "phrase": "cloud_scenario"}, {"score": 0.0022157533515146503, "phrase": "rich_set"}, {"score": 0.0021983430142660373, "phrase": "use_cases"}, {"score": 0.002163930783583212, "phrase": "information_sharing"}, {"score": 0.002146926767291475, "phrase": "multiple_stakeholders"}, {"score": 0.0021049977753042253, "phrase": "service_providers"}], "paper_keywords": ["Data-centric information sharing", " Data sharing agreements", " Policy authoring", " Policy analysis", " Policy deployment", " Policy enforcement", " Cloud security"], "paper_abstract": "Web interactions usually require the exchange of personal and confidential information for a variety of purposes, including enabling business transactions and the provisioning of services. A key issue affecting these interactions is the lack of trust and control on how data are going to be used and processed by the entities that receive it. In the traditional world, this problem is addressed using contractual agreements, those are signed by the involved parties, and law enforcement. This could be done electronically as well but, in addition to the trust issue, there is currently a major gap between the definition of legal contracts regulating the sharing of data, and the software infrastructure required to support and enforce them. How to enable organisations to provide more automation in this process? How to ensure that legal contracts can be actually enforced by the underlying IT infrastructure? How to enable end-users to express their preferences and constraints within these contracts? This article describes our R&D work to make progress towards addressing this gap via the usage of electronic Data Sharing Agreements (e-DSA). The aim is to share our vision, discuss the involved challenges and stimulate further research and development in this space. We specifically focus on a cloud scenario because it provides a rich set of use cases involving interactions and information sharing among multiple stakeholders, including users and service providers.", "paper_title": "Towards safer information sharing in the cloud", "paper_id": "WOS:000358193000003"}