{"auto_keywords": [{"score": 0.038915505278648656, "phrase": "bis"}, {"score": 0.008713753786780007, "phrase": "bottleneck_identification"}, {"score": 0.008525843806987392, "phrase": "multithreaded_applications"}, {"score": 0.0040192915527630995, "phrase": "valuable_execution_cycles"}, {"score": 0.0031411751440831165, "phrase": "cycles_threads"}, {"score": 0.002877438939246423, "phrase": "asymmetric_chip_multi-processor"}, {"score": 0.0027843339377323878, "phrase": "previous_work"}, {"score": 0.0027389142053945246, "phrase": "specific_bottlenecks"}, {"score": 0.0021399277552314067, "phrase": "fast_cores"}, {"score": 0.0021049977753042253, "phrase": "system_increase"}], "paper_keywords": ["Design", " Performance", " Critical sections", " barriers", " pipeline parallelism", " multicore", " asymmetric CMPs", " heterogeneous CMPs"], "paper_abstract": "Performance of multithreaded applications is limited by a variety of bottlenecks, e.g. critical sections, barriers and slow pipeline stages. These bottlenecks serialize execution, waste valuable execution cycles, and limit scalability of applications. This paper proposes Bottleneck Identification and Scheduling (BIS), a cooperative software-hardware mechanism to identify and accelerate the most critical bottlenecks. BIS identifies which bottlenecks are likely to reduce performance by measuring the number of cycles threads have to wait for each bottleneck, and accelerates those bottlenecks using one or more fast cores on an Asymmetric Chip Multi-Processor (ACMP). Unlike previous work that targets specific bottlenecks, BIS can identify and accelerate bottlenecks regardless of their type. We compare BIS to four previous approaches and show that it outperforms the best of them by 15% on average. BIS' performance improvement increases as the number of cores and the number of fast cores in the system increase.", "paper_title": "Bottleneck Identification and Scheduling in Multithreaded Applications", "paper_id": "WOS:000209339300019"}