{"auto_keywords": [{"score": 0.04858132305104682, "phrase": "video_materials"}, {"score": 0.020408199677704447, "phrase": "proposed_method"}, {"score": 0.007152368807539886, "phrase": "novel_video_retrieval_method"}, {"score": 0.007055851959391432, "phrase": "web_community_extraction"}, {"score": 0.004497973025639345, "phrase": "audio_and_visual_features"}, {"score": 0.004362665681330474, "phrase": "web_communities"}, {"score": 0.0041827333568982055, "phrase": "canonical_correlation_analysis"}, {"score": 0.0037506567448470163, "phrase": "transformed_variates"}, {"score": 0.0032282396745967504, "phrase": "obtained_similarities"}, {"score": 0.0031556799865964974, "phrase": "link_relationship"}, {"score": 0.0030429511467945525, "phrase": "link_analysis"}, {"score": 0.0030017207229983385, "phrase": "obtained_weighted_link_relationship"}, {"score": 0.0029076695661972114, "phrase": "similar_topics"}, {"score": 0.002765776659294382, "phrase": "web_community"}, {"score": 0.00245724480030654, "phrase": "desired_ones"}, {"score": 0.0022951216874671516, "phrase": "obtained_web_communities"}, {"score": 0.0022333012657436307, "phrase": "effective_video_retrieval"}, {"score": 0.002203016940021265, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "actual_web_pages"}], "paper_keywords": ["video retrieval", " canonical correlation analysis", " link analysis", " Web community extraction"], "paper_abstract": "A novel video retrieval method based on Web community extraction using audio and visual features and textual features of video materials is proposed in this paper. In this proposed method, canonical correlation analysis is applied to these three features calculated from video materials and their Web pages, and transformation of each feature into the same variate space is possible. The transformed variates are based on the relationships between visual, audio and textual features of video materials, and the similarity between video materials in the same feature space for each feature can be calculated. Next, the proposed method introduces the obtained similarities of video materials into the link relationship between their Web pages. Furthermore, by performing link analysis of the obtained weighted link relationship, this approach extracts Web communities including similar topics and provides the degree of attribution of video materials in each Web community for each feature. Therefore, by calculating similarities of the degrees of attribution between the Web communities extracted from the three kinds of features, the desired ones are automatically selected. Consequently, by monitoring the degrees of attribution of the obtained Web communities, the proposed method can perform effective video retrieval. Some experimental results obtained by applying the proposed method to video materials obtained from actual Web pages are shown to verify the effectiveness of the proposed method.", "paper_title": "A Novel Video Retrieval Method Based on Web Community Extraction Using Features of Video Materials", "paper_id": "WOS:000269648400027"}