{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "large_smart_environments"}, {"score": 0.003754140294151593, "phrase": "different_interfaces"}, {"score": 0.003527550673371394, "phrase": "message_ordering"}, {"score": 0.003389136094439662, "phrase": "semantic_interoperability"}, {"score": 0.0032852337992126564, "phrase": "conversation_incompatibilities"}, {"score": 0.0032272929113113203, "phrase": "conversation_adapters"}, {"score": 0.002952516738708181, "phrase": "conversation_customization"}, {"score": 0.0029263562233195423, "phrase": "existing_approaches"}, {"score": 0.002900426826591769, "phrase": "automatic_adapter_generation"}, {"score": 0.002761856557698856, "phrase": "interface_level"}, {"score": 0.002641621667026613, "phrase": "novel_ontology-based_context-sensitive_approach"}, {"score": 0.0025266078302900036, "phrase": "aggregate_conditional_substitution_semantics"}, {"score": 0.0025042115651986332, "phrase": "application-domain_concepts"}, {"score": 0.002470987929071079, "phrase": "context-based_manner"}, {"score": 0.002352886041381761, "phrase": "different_conversation_messages"}, {"score": 0.0023010815714140467, "phrase": "corresponding_conversion_functions"}, {"score": 0.0022705467477443417, "phrase": "proposed_approach"}, {"score": 0.002250415129116109, "phrase": "service_semantic_interoperability"}, {"score": 0.0021910825909008946, "phrase": "service_reuse"}, {"score": 0.0021049977753042253, "phrase": "smart_environment"}], "paper_keywords": [""], "paper_abstract": "Services in large smart environments, as defined in this paper, are \"aware\" of their users' contexts and goals and are able to automatically interact with one another in order to achieve these goals. Unfortunately, interactions between services (i.e., service conversations) are not necessarily compatible, as services could have different interfaces (i.e., signature incompatibilities), as well as different logic for message ordering (i.e., protocol incompatibilities). Such conversation incompatibilities create obstacles for achieving semantic interoperability of services. One approach for handling conversation incompatibilities is to use conversation adapters, which should be created automatically by the middleware in order to be able to support on-demand conversation customization. Existing approaches for automatic adapter generation are strictly limited as they require no changes at the interface level. To overcome such a limitation, this paper proposes a novel ontology-based context-sensitive approach for automatic adapter generation. This approach captures the aggregate conditional substitution semantics of application-domain concepts in a context-based manner and uses these semantics to determine the mappings between the different conversation messages and to generate the corresponding conversion functions. The proposed approach ensures service semantic interoperability and increases the chances for service reuse, which consequently improves the efficiency of the smart environment.", "paper_title": "On-demand conversation customization for services in large smart environments", "paper_id": "WOS:000301498300017"}