{"auto_keywords": [{"score": 0.04004331634725488, "phrase": "contact_angles"}, {"score": 0.012283989990123548, "phrase": "static_droplets"}, {"score": 0.004764220976404241, "phrase": "static_and_dynamic_hydrophobicity"}, {"score": 0.004494570360108983, "phrase": "nano-scale_influence"}, {"score": 0.004353948887538618, "phrase": "molecular_dynamics_simulations"}, {"score": 0.004085713541752114, "phrase": "equilibrium_states"}, {"score": 0.004042635935882651, "phrase": "water_droplets"}, {"score": 0.003957833102043277, "phrase": "different_ridge_heights"}, {"score": 0.003916098498242888, "phrase": "groove_widths"}, {"score": 0.0035408501923902477, "phrase": "dynamic_hydrophobicity"}, {"score": 0.0030847461428168614, "phrase": "surfaces'_hydrophobicity"}, {"score": 0.0023038418282549274, "phrase": "ridge_surface_fraction"}, {"score": 0.0022674379203603224, "phrase": "ridge_height"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hydrophobicity", " Ridge", " Groove", " Molecular dynamics", " Textured surface"], "paper_abstract": "Static and dynamic hydrophobicity is of importance to many industries. Since structures at the nano-scale influence wetting at the macro-scale, molecular dynamics simulations were conducted to investigate the hydrophobicity of a groove/ridge textured surface. The equilibrium states of water droplets on surfaces with different ridge heights and groove widths were obtained. The contact angles of these static droplets were evaluated and then three different forces were used to evaluate the dynamic hydrophobicity of each surface. Forces were applied to each droplet in the direction parallel to the ridges and also perpendicular to the ridges. The surfaces' hydrophobicity was evaluated quantitatively using the differences in the advancing and receding contact angles. It was found that although the contact angles of the static droplets were larger in the direction perpendicular to the ridges, the droplets were dynamically more hydrophobic in the direction parallel to the ridges. It was also shown that as the ridge surface fraction increased the ridge height had less of an effect on the hydrophobicity. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Static and dynamic hydrophobicity on a nano-sized groove/ridge surface", "paper_id": "WOS:000354141400007"}