{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_availability"}, {"score": 0.004771672073078768, "phrase": "urban_search_and_rescue_activities"}, {"score": 0.00468627326602559, "phrase": "natural_disaster"}, {"score": 0.004623224002010226, "phrase": "urban_area"}, {"score": 0.004300951511110487, "phrase": "finding_survivors"}, {"score": 0.00418595288276353, "phrase": "search_and_rescue_activities"}, {"score": 0.0038242899532391914, "phrase": "first_responders"}, {"score": 0.003671865026158296, "phrase": "information_support"}, {"score": 0.00298238929037041, "phrase": "human-centric_wireless_sensor_network"}, {"score": 0.0028248293967214947, "phrase": "shared_information"}, {"score": 0.002568812627436125, "phrase": "emergency_response_process"}, {"score": 0.0023571835517819124, "phrase": "simulated_scenario"}, {"score": 0.0022427071130840647, "phrase": "urban_search"}, {"score": 0.0021925226977381244, "phrase": "obtained_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Human-centric wireless sensor networks", " Information availability", " Human-based sensors", " Opportunistic networks", " Information fusion"], "paper_abstract": "When a natural disaster hits an urban area, the first 72 h after are the most critical. After that period the probability of finding survivors falls dramatically, therefore the search and rescue activities in that area must be conducted as quickly and effectively as possible. These activities are often improvised by first responders, stemming from the lack of communication and information support needed for making decisions in the field. Unfortunately, improvisations reduce the effectiveness and efficiency of the activities, in turn, affecting the number of people that can be rescued. To address this challenge, this article introduces the concept of a human-centric wireless sensor network, as an infrastructure that supports the capture and delivery of shared information in the field. These networks help increase the information availability, and therefore, the efficiency and effectiveness of the emergency response process. The use of these networks, which is complimentary to the currently used VHF/UHF radio systems, was evaluated using a simulated scenario and also through the feedback provided by an expert in urban search and rescue. The obtained results are highly encouraging. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Human-centric wireless sensor networks to improve information availability during urban search and rescue activities", "paper_id": "WOS:000343619300007"}