{"auto_keywords": [{"score": 0.04422898331236466, "phrase": "information_technology"}, {"score": 0.004558977045730675, "phrase": "organizational_boundary"}, {"score": 0.004316552692395911, "phrase": "external_and_internal_boundaries"}, {"score": 0.0038960785110831162, "phrase": "governance_costs"}, {"score": 0.003284026247389735, "phrase": "business_strategies"}, {"score": 0.0025848074189353397, "phrase": "boundary_objects"}, {"score": 0.002497862210672172, "phrase": "organizational_boundaries"}, {"score": 0.002463906556781983, "phrase": "boundary_management"}, {"score": 0.002332626862738603, "phrase": "existing_research"}, {"score": 0.0021049977753042253, "phrase": "improved_it_alignment"}], "paper_keywords": ["IT alignment", " IT outsourcing", " boundaries", " boundary management", " enterprise architecture", " IT governance"], "paper_abstract": "This study applies the concept of organizational boundary to examine how outsourcing and the management of external and internal boundaries of the information technology (IT) function impact IT alignment. The article argues that by decreasing the governance costs for the less strategic IT transactions, IT outsourcing enables the IT function, and IT management particularly, to focus more on aligning the IT activities and plans with business strategies and priorities, and thereby improve IT alignment. This article also suggests that organizations may improve IT alignment by effectively transmitting knowledge and supporting collaboration between IT and business functions through boundary spanning activities and with boundary objects. The concept of organizational boundaries and boundary management has not been explicitly addressed by the existing research on IT alignment. This study also contributes to the IT outsourcing literature by linking outsourcing to improved IT alignment. Journal of Information Technology (2011) 26, 46-59. doi:10.1057/jit.2010.28; Published online 12 October 2010", "paper_title": "IT alignment and the boundaries of the IT function", "paper_id": "WOS:000287652700004"}