{"auto_keywords": [{"score": 0.03644451033122438, "phrase": "queried_person"}, {"score": 0.027683862705826835, "phrase": "proposed_method"}, {"score": 0.00443308765153716, "phrase": "large_news_photograph"}, {"score": 0.004394688617163029, "phrase": "video_collections"}, {"score": 0.004318881178805575, "phrase": "multi-modal_nature"}, {"score": 0.004262881313926916, "phrase": "data_sets"}, {"score": 0.004099183062034004, "phrase": "supervisory_input"}, {"score": 0.0038906171474520756, "phrase": "initial_set"}, {"score": 0.0030223381739019894, "phrase": "highly_connected_sub-graph"}, {"score": 0.0027822459052173113, "phrase": "novel_technique"}, {"score": 0.002675252546913683, "phrase": "interest_points"}, {"score": 0.0025389513338018414, "phrase": "new_faces"}, {"score": 0.002347378595930709, "phrase": "news_photographs"}, {"score": 0.0023270035715132866, "phrase": "yahoo_news"}, {"score": 0.0021797112385590913, "phrase": "significant_improvements"}, {"score": 0.0021607883988873492, "phrase": "text-based_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": ["Face finding", " Graph representation", " Densest component", " Interest points", " News photos and videos"], "paper_abstract": "In this study, we propose a method for finding people in large news photograph and video collections Our method exploits the multi-modal nature of these data sets to recognize people and does not require any supervisory input It first uses the name of the person to populate an initial set of candidate faces From this set, which is likely to include the faces of other people, it selects the group of most similar faces corresponding to the queried person in a variety of conditions Our main contribution is to transform the problem of recognizing the faces of the queried person in a set of candidate faces to the problem of finding the highly connected sub-graph (the densest component) in a graph representing the similarities of faces. We also propose a novel technique for finding the similarities of faces by matching interest points extracted from the faces The proposed method further allows the classification of new faces without needing to re-build the graph The experiments are performed on two data sets, thousands of news photographs from Yahoo news and over 200 news videos from TRECVid2004 The results show that the proposed method provides significant Improvements over text-based methods. (C) 2009 Elsevier Ltd All rights reserved.", "paper_title": "Interesting faces: A graph-based approach for finding people in news", "paper_id": "WOS:000275615800001"}