{"auto_keywords": [{"score": 0.04905244844005563, "phrase": "prnet"}, {"score": 0.009735513336548002, "phrase": "wired_infrastructure"}, {"score": 0.00653552306621489, "phrase": "vehicular_applications"}, {"score": 0.00481495049065317, "phrase": "mobile_internet"}, {"score": 0.004780284090487408, "phrase": "first_darpa_experiment"}, {"score": 0.004757311265490284, "phrase": "wireless_mobile_internet"}, {"score": 0.004555438321613565, "phrase": "darpa_military_goals"}, {"score": 0.004468476226790802, "phrase": "tactical_operations"}, {"score": 0.004351595642056769, "phrase": "main_challenge"}, {"score": 0.004309852548685809, "phrase": "radio_portability"}, {"score": 0.00416686685639682, "phrase": "arpanet_quest"}, {"score": 0.004057843220539914, "phrase": "closest_civilian_descendents"}, {"score": 0.004009230728025144, "phrase": "vehicular_networks"}, {"score": 0.003961198291258668, "phrase": "personal_area_networks"}, {"score": 0.0038389795739979713, "phrase": "major_role"}, {"score": 0.003802135020791801, "phrase": "spectrum_scarcity"}, {"score": 0.0036937016919398637, "phrase": "wired_internet"}, {"score": 0.0034111377664032437, "phrase": "vehicular_network"}, {"score": 0.003097367136394196, "phrase": "urban_internet_infrastructure_role"}, {"score": 0.003060225680668562, "phrase": "emerging_vehicular_applications"}, {"score": 0.0030308324671688524, "phrase": "core_internet_services"}, {"score": 0.002987269563706879, "phrase": "vehicle_grid"}, {"score": 0.0028950130802141293, "phrase": "emergency_operations"}, {"score": 0.002874129812146924, "phrase": "terrorist_attack"}, {"score": 0.002751947301005254, "phrase": "short_list"}, {"score": 0.0026285925237455807, "phrase": "mobility_management"}, {"score": 0.002504699155363353, "phrase": "tolerant_operations"}, {"score": 0.0022851253854915448, "phrase": "internet_history_perspective"}, {"score": 0.0022522565004588113, "phrase": "mobile_wireless_network_field"}, {"score": 0.0022252263986820542, "phrase": "early_arpanet"}, {"score": 0.002135722202374785, "phrase": "wireless_internet"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Vehicular network", " VANET", " Mobile Internet", " Wireless network architecture"], "paper_abstract": "The first DARPA experiment with wireless mobile Internet - the Packet Radio Network or PRNET - was completely independent of the infrastructure. This model was consistent with DARPA military goals as the PRNET was designed to support tactical operations far away from any wired infrastructure. Beside autonomy, the main challenge was mobility and radio portability. Scarcity of spectrum was not an issue, in contrast with the ARPANET quest to utilize those 50 kbps Telpak trunks more efficiently. Today, the closest civilian descendents of the PRNET are vehicular networks and smart phone based Personal Area Networks. In either case, the wired infrastructure turns out to play a major role. Moreover, spectrum scarcity has now become the most important challenge (while, ironically, the wired Internet has plenty of bandwidth). In this paper we examine this interplay between wired and wireless and extract a message for the design of a more efficient Future Wireless Internet. We focus on the vehicular network since this field is better established and commercially more viable than that of personal, P2P communications among Smartphones. We are confident however that many of our observations will transfer also to smart phone/infrastructure synergy. Specifically, in this paper we identify the urban Internet infrastructure role in the support of emerging vehicular applications and identify the Core Internet services matching the services in the vehicle grid. As the vehicular applications range from e-mail and voice over IP to emergency operations (natural disaster, terrorist attack, etc.), the type of assistance requested from the infrastructure will vary. A short list includes: (a) addressing (e.g. geo-addressing): (b) directory service, service discovery, mobility management; (c) resource and congestion management; (d) path redundancy; (e) delay tolerant operations; (f) mobile sensor data access and search from the internet, and; (g) anonymity, privacy and incentives. After the review of vehicular applications and properties, we will offer an Internet history perspective to help understand how the mobile wireless network field has evolved from the early ARPANET and PRNET days. This will reveal trends that can help predict the future of the wireless Internet. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Vehicular networks and the future of the mobile internet", "paper_id": "WOS:000287781300008"}