{"auto_keywords": [{"score": 0.03540894775235875, "phrase": "self-adaptive_systems"}, {"score": 0.025997450280042793, "phrase": "effective_application"}, {"score": 0.00481495049065317, "phrase": "current_approaches"}, {"score": 0.004777392826700429, "phrase": "research_challenges"}, {"score": 0.004703149944841539, "phrase": "self-adaptive_software"}, {"score": 0.004214637810698362, "phrase": "better_functionality"}, {"score": 0.004052701031142039, "phrase": "system_adaptivity"}, {"score": 0.003732526540522333, "phrase": "greater_importance"}, {"score": 0.0036031440110534853, "phrase": "common_element"}, {"score": 0.0034646205853140558, "phrase": "systematic_software_engineering_approaches"}, {"score": 0.0032667240408191015, "phrase": "multiple_domains"}, {"score": 0.003228517923065361, "phrase": "main_goal"}, {"score": 0.003141093559655865, "phrase": "recent_progress"}, {"score": 0.003056029284235528, "phrase": "computer_sciences"}, {"score": 0.0027167292419065514, "phrase": "software_engineering_foundations"}, {"score": 0.002472552537325604, "phrase": "main_bottlenecks"}, {"score": 0.002424506147893058, "phrase": "self-adaptive_technology"}, {"score": 0.002349561762300369, "phrase": "key_research_issues"}, {"score": 0.002232675154416128, "phrase": "current_constraints"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Self-adaptive software", " Decision-making", " Feedback loops", " Software reflection", " Model-driven development", " Goal-based model"], "paper_abstract": "Self-adaptive software is capable of evaluating and changing its own behavior, whenever the evaluation shows that the software is not accomplishing what it was intended to do, or when better functionality or performance may be possible. The topic of system adaptivity has been widely studied since the mid-60s and, over the past decade, several application areas and technologies relating to self-adaptivity have assumed greater importance. In all these initiatives, software has become the common element that introduces self-adaptability. Thus, the investigation of systematic software engineering approaches is necessary, in order to develop self-adaptive systems that may ideally be applied across multiple domains. The main goal of this study is to review recent progress on self-adaptivity from the standpoint of computer sciences and cybernetics, based on the analysis of state-of-the-art approaches reported in the literature. This review provides an over-arching, integrated view of computer science and software engineering foundations. Moreover, various methods and techniques currently applied in the design of self-adaptive systems are analyzed, as well as some European research initiatives and projects. Finally, the main bottlenecks for the effective application of self-adaptive technology, as well as a set of key research issues on this topic, are precisely identified, in order to overcome current constraints on the effective application of self-adaptivity in its emerging areas of application. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Self-adaptive systems: A survey of current approaches, research challenges and applications", "paper_id": "WOS:000324663000012"}