{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "imbalanced_data"}, {"score": 0.04203400118778606, "phrase": "roughly_balanced_bagging"}, {"score": 0.004716031208088975, "phrase": "bagging_ensembles"}, {"score": 0.004677032188041644, "phrase": "class_imbalanced_data"}, {"score": 0.004524220016675624, "phrase": "known_extensions"}, {"score": 0.004412881870378388, "phrase": "comprehensive_experimental_study"}, {"score": 0.003831591603702392, "phrase": "complex_and_difficult_distribution"}, {"score": 0.003784120134537663, "phrase": "minority_class"}, {"score": 0.0034106416719768035, "phrase": "minority_class_distribution"}, {"score": 0.003231191164622055, "phrase": "data_difficulty_factors"}, {"score": 0.003177892611195514, "phrase": "new_generalizations"}, {"score": 0.0030611534228319717, "phrase": "neighbourhood_balanced_bagging"}, {"score": 0.0029121251930855664, "phrase": "class_distribution"}, {"score": 0.002735972929840289, "phrase": "larger_size"}, {"score": 0.0027133032795773697, "phrase": "bootstrap_samples"}, {"score": 0.002591927716261631, "phrase": "stronger_under-sampling"}, {"score": 0.002528021281333922, "phrase": "first_version"}, {"score": 0.0024759682272230735, "phrase": "existing_over-sampling_bagging_extensions"}, {"score": 0.002297274552621268, "phrase": "minority_examples"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Class imbalance", " Ensemble classifiers", " Bagging"], "paper_abstract": "Various approaches to extend bagging ensembles for class imbalanced data are considered. First, we review known extensions and compare them in a comprehensive experimental study. The results show that integrating bagging with under-sampling is more powerful than over-sampling. They also allow to distinguish Roughly Balanced Bagging as the most accurate extension. Then, we point out that complex and difficult distribution of the minority class can be handled by analyzing the content of a neighbourhood of examples. In our study we show that taking into account such local characteristics of the minority class distribution can be useful both for analyzing performance of ensembles with respect to data difficulty factors and for proposing new generalizations of bagging. We demonstrate it by proposing Neighbourhood Balanced Bagging, where sampling probabilities of examples are modified according to the class distribution in their neighbourhood. Two of its versions are considered: the first one keeping a larger size of bootstrap samples by hybrid over-sampling and the other reducing this size with stronger under-sampling. Experiments prove that the first version is significantly better than existing over-sampling bagging extensions while the other version is competitive to Roughly Balanced Bagging. Finally, we demonstrate that detecting types of minority examples depending on their neighbourhood may help explain why some ensembles work better for imbalanced data than others. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Neighbourhood sampling in bagging for imbalanced data", "paper_id": "WOS:000346952300019"}