{"auto_keywords": [{"score": 0.05007756412061741, "phrase": "health_information_technologies"}, {"score": 0.024120400746613428, "phrase": "hit"}, {"score": 0.004781915513030716, "phrase": "biomedical_informatics"}, {"score": 0.004268293864953256, "phrase": "biomedical_informatics_field"}, {"score": 0.0041666157975446564, "phrase": "systematic_literature_review"}, {"score": 0.004109600767747015, "phrase": "pubmed_searches"}, {"score": 0.003997891221012094, "phrase": "individual_journals"}, {"score": 0.0036808477642875878, "phrase": "english"}, {"score": 0.0033883824438527316, "phrase": "technology_type"}, {"score": 0.0033304797419738182, "phrase": "study_location"}, {"score": 0.0029722900280316216, "phrase": "common_ground"}, {"score": 0.0028715299874549245, "phrase": "qualitative_methods"}, {"score": 0.00276462370914216, "phrase": "\"collaboration_space_model"}, {"score": 0.0025361866386341796, "phrase": "future_research_directions"}, {"score": 0.0024333239726872604, "phrase": "biomedical_informatics_community"}, {"score": 0.0023999697562763433, "phrase": "healthcare_delivery"}, {"score": 0.0021049977753042253, "phrase": "collaborative_issues"}], "paper_keywords": ["Collaboration", " Health information technology", " Systematic review"], "paper_abstract": "Purpose: Our objective was to identify and examine studies of collaboration in relation to the use of health information technologies (HIT) in the biomedical informatics field. Methods: We conducted a systematic literature review of articles through PubMed searches as well as reviewing a variety of individual journals and proceedings. Our search period was from 1990-2015. We identified 98 articles that met our inclusion criteria. We excluded articles that were not published in English, did not deal with technology, and did not focus primarily on individuals collaborating. Results: We categorized the studies by technology type, user groups, study location, methodology, processes related to collaboration, and desired outcomes. We identified three major processes: workflow, communication, and information exchange-and two outcomes: maintaining awareness and establishing common ground. Researchers most frequently studied collaboration within hospitals using qualitative methods. Discussion: Based on our findings, we present the \"collaboration space model\", which is a model to help researchers study collaboration and technology in healthcare. We also discuss issues related to collaboration and future research directions. Conclusion: While collaboration is being increasingly recognized in the biomedical informatics community as essential to healthcare delivery, collaboration is often implicitly discussed or intertwined with other similar concepts. In order to evaluate how HIT affects collaboration and how we can build HIT to effectively support collaboration, we need more studies that explicitly focus on collaborative issues. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Examining the role of collaboration in studies of health information technologies in biomedical informatics: A systematic review of 25 years of research", "paper_id": "WOS:000363437500023"}