{"auto_keywords": [{"score": 0.027072043697711868, "phrase": "semantic_technologies"}, {"score": 0.004701825207431857, "phrase": "computing_environment"}, {"score": 0.004510184935928004, "phrase": "adapted_control_devices"}, {"score": 0.004352123742308589, "phrase": "users'_homes"}, {"score": 0.004224627834741731, "phrase": "standard_television_set"}, {"score": 0.004149922666541166, "phrase": "presentation_device"}, {"score": 0.004100851549096203, "phrase": "dependent_individuals"}, {"score": 0.0038870860864224656, "phrase": "new_technological_advances"}, {"score": 0.003795677450778112, "phrase": "information_management"}, {"score": 0.0033898953358387075, "phrase": "educational_and_training_services"}, {"score": 0.0030819219279832224, "phrase": "smart_job_advisor"}, {"score": 0.0028354207806133153, "phrase": "job_offers"}, {"score": 0.0026714812866037584, "phrase": "particular_individual"}, {"score": 0.0024431289979171505, "phrase": "perceived_accessibility"}, {"score": 0.0021049977753042253, "phrase": "presentation_devices"}], "paper_keywords": [""], "paper_abstract": "This article discusses a modular, accessible platform that provides a computing environment for people with disabilities accessible through adapted control devices and the television set at users' homes. Relying on a standard television set as the presentation device allows dependent individuals, especially people with disabilities, to introduce new technological advances in communication and information management in their everyday lives. As a proof-of-concept, the solution presented offers a collection of educational and training services related to teleworking and the search of employment targeted to people with disabilities. A smart job advisor included among these services, which was designed to help our target users to locate job offers that best suit the abilities and disabilities of a particular individual, is also discussed to illustrate how semantic technologies can be applied to increase the perceived accessibility and inclusion by reducing the dependence from other persons. The platform developed, the introduction of semantic technologies, and the way adapted interfacing and presentation devices were integrated may also serve as inspiration to provide services to people with disabilities.", "paper_title": "An Accessible Platform for People With Disabilities", "paper_id": "WOS:000334908800005"}