{"auto_keywords": [{"score": 0.033057242091515615, "phrase": "application_purpose"}, {"score": 0.010089214957117504, "phrase": "stockholders'_equities"}, {"score": 0.010009423924564805, "phrase": "corporate_credit"}, {"score": 0.008713768692145006, "phrase": "stock_repurchase_declaration"}, {"score": 0.008644760447045789, "phrase": "stock_price"}, {"score": 0.006041483212918896, "phrase": "considerably_bigger_average_car"}, {"score": 0.005759265332011149, "phrase": "stock_repurchase"}, {"score": 0.004203803478570494, "phrase": "listed_companies"}, {"score": 0.0041703614123283165, "phrase": "taiwan's_stock_market"}, {"score": 0.004137184278868391, "phrase": "event_study_method"}, {"score": 0.00405538690701843, "phrase": "stock_price_fluctuations"}, {"score": 0.004023128078548267, "phrase": "garch"}, {"score": 0.003729065012001506, "phrase": "first_stock_repurchase"}, {"score": 0.003268333444704392, "phrase": "electrics_industry"}, {"score": 0.0026547761341670505, "phrase": "abnormal_return_response"}, {"score": 0.0023079225317714815, "phrase": "relatively_higher_average_car_response"}, {"score": 0.0022803854904010347, "phrase": "empirical_study_results"}, {"score": 0.0022085455097790537, "phrase": "listed_company_management"}, {"score": 0.0021821915946356168, "phrase": "related_academic_studies"}, {"score": 0.0021647968783414504, "phrase": "crown_copyright"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Stock repurchase", " Treasury stock", " Event study method", " Garch Model", " Market model", " Average CAR"], "paper_abstract": "This study is to discuss the impact of stock repurchase declaration and purpose of repurchase on the stock price in the backdrop of listed companies on Taiwan's stock market. Event Study Method is employed to discuss stock price fluctuations while GARCH (Generalized Autoregressive Conditional Heteroscedasticity) is applied to estimate the Market Model regressive coefficients. The samples consisted of companies declaring first stock repurchase are selected from August 9, 2000 to December 31, 2005 with a precondition that all the companies shall be listed ones 150 days prior to declaration. The study results reveal that companies from other industries have considerably bigger average CAR than companies of the electrics industry before and after the declaration of stock repurchase. Companies with application purpose of \"maintain stockholders' equities and corporate credit\" have considerably bigger average CAR than companies with application purpose of \"transferring stocks to employees\". In industries other than electrics, companies with application purpose of \"maintain stockholders' equities and corporate credit\" have bigger accumulated abnormal return response than companies with application purpose of \"transferring stocks to employees\". In case of \"maintain stockholders' equities and corporate credit\" as the application purpose of stock repurchase. companies from industries other than electrics have relatively higher average CAR response. The empirical study results can serve as a reference for the listed company management and to related academic studies. Crown Copyright (C) 2009 Published by Elsevier Ltd. All rights reserved.", "paper_title": "Does stock repurchase declaration affect stock price? Differences between. the electrics industry and other industries", "paper_id": "WOS:000271571000071"}