{"auto_keywords": [{"score": 0.040650574499495426, "phrase": "isi."}, {"score": 0.004590052784169268, "phrase": "large_databases"}, {"score": 0.004530552828603269, "phrase": "users'_needs"}, {"score": 0.004318881178805575, "phrase": "document_search_problem"}, {"score": 0.00420760449108585, "phrase": "database_query_approach"}, {"score": 0.004153041453795458, "phrase": "text-based_search_approach"}, {"score": 0.003644714340300824, "phrase": "scientific_research_document"}, {"score": 0.003311799410921826, "phrase": "normal_text"}, {"score": 0.0029830992938695007, "phrase": "similarity_value"}, {"score": 0.002831158147480665, "phrase": "final_value"}, {"score": 0.002686935113435742, "phrase": "weighted_sum"}, {"score": 0.0026062133750675894, "phrase": "simple_weighting_method"}, {"score": 0.0024950747439601863, "phrase": "appropriate_weights"}, {"score": 0.0024201029474586007, "phrase": "back_propagation_neural_network"}, {"score": 0.002347378595930709, "phrase": "extensive_experiments"}, {"score": 0.002286781334850213, "phrase": "real_documents"}, {"score": 0.002257070536352418, "phrase": "tkde_journal"}, {"score": 0.0021049977753042253, "phrase": "traditional_text-based_search_approach"}], "paper_keywords": ["information retrieval", " similarity", " neural network"], "paper_abstract": "As more and more documents become electronically available, finding documents in large databases that fit users' needs is becoming increasingly important. In the past, the document search problem was dealt with using the database query approach or the text-based search approach. In this paper, we investigate this problem, focusing on the SCI/SSCI databases from ISI. Specifically, we design our search methodology based on the four fields commonly seen in a scientific research document: abstract, title, keywords, and reference list. Of these four, only the abstract field can be viewed as a normal text, while the other three have their own characteristics to differentiate them from texts. Therefore, we first develop a method to compute the similarity value for each field. Our next problem is combining the four similarity values into a final value. One approach is to assign weights to each and compute the weighted sum. We have not adopted this simple weighting method, however, because it is difficult to determine appropriate weights. Instead, we use the back propagation neural network to combine them. Finally, extensive experiments have been carried out using real documents drawn from TKDE journal, and the results indicate that in all situations our method has a much higher accuracy than the traditional text-based search approach.", "paper_title": "A similarity-based method for retrieving documents from the SCI/SSCI database", "paper_id": "WOS:000242090100005"}