{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "capacity_design_rule"}, {"score": 0.014952383337679898, "phrase": "beam-column_joints"}, {"score": 0.004761132425263795, "phrase": "reinforced_concrete_beam-column_joints"}, {"score": 0.004254814649568355, "phrase": "plastic_hinges"}, {"score": 0.0038668462001710314, "phrase": "design_moments"}, {"score": 0.0036966717141736355, "phrase": "equilibrium_conditions"}, {"score": 0.003474799999519295, "phrase": "adjacent_beams"}, {"score": 0.002951444412262927, "phrase": "capacity_design"}, {"score": 0.0026971491199975083, "phrase": "present_study"}, {"score": 0.002464709648714996, "phrase": "basic_variables"}, {"score": 0.0024370965602952496, "phrase": "random_variables"}, {"score": 0.0021049977753042253, "phrase": "safety_level"}], "paper_keywords": ["reliability", " capacity design", " partial safety factors", " concrete structures"], "paper_abstract": "The capacity design rule for beam-column joints, as adopted by the EC8, forces the formation of the plastic hinges to be developed in beams rather than in columns. This is achieved by deriving the design moments of the columns of a joint from equilibrium conditions, assuming that plastic hinges with their possible overstrengths have been developed in the adjacent beams of the joint. In this equilibrium the parameters (dimensions, material properties, axial forces etc) are, in general, random variables. Hence, the capacity design is associated with a probability of non-compliance (probability of failure). In the present study the probability of non-compliance of the capacity design rule of joints is being calculated by assuming the basic variables as random variables. Parameters affecting this probability are examined and a modification of the capacity design rule for beam-column joints is proposed, in order to achieve uniformity of the safety level.", "paper_title": "Reliability based calibration of the capacity design rule of reinforced concrete beam-column joints", "paper_id": "WOS:000297883800002"}