{"auto_keywords": [{"score": 0.031153611005641978, "phrase": "existing_medical_terminologies"}, {"score": 0.02651421920507834, "phrase": "proposed_taxonomy"}, {"score": 0.00481495049065317, "phrase": "avian_influenza_outbreaks"}, {"score": 0.0045736684402340275, "phrase": "local_bird_populations"}, {"score": 0.00454019648854141, "phrase": "poultry_economies"}, {"score": 0.004312622975366676, "phrase": "possible_threats"}, {"score": 0.0037921662574137535, "phrase": "standard_fashion"}, {"score": 0.003562444653947001, "phrase": "stakeholder_community"}, {"score": 0.0034212450542713607, "phrase": "ai_outbreak"}, {"score": 0.0033589207694997413, "phrase": "consistent_and_common_perspective"}, {"score": 0.0031669873302916, "phrase": "ai_characterization"}, {"score": 0.003097865379563127, "phrase": "selected_journal_articles"}, {"score": 0.0030751605843937673, "phrase": "reporting_and_laboratory_forms"}, {"score": 0.0030414140732789186, "phrase": "public_health_websites"}, {"score": 0.00300803677566719, "phrase": "ai_case_reporting"}, {"score": 0.002857041057269513, "phrase": "metamap_program"}, {"score": 0.0026252106881752067, "phrase": "specific_terminologies"}, {"score": 0.0025678829712650437, "phrase": "semantic_type-relationship_matching"}, {"score": 0.00244792069601419, "phrase": "existing_terminologies"}, {"score": 0.002368160970983679, "phrase": "core_knowledge"}, {"score": 0.00226583335721762, "phrase": "ai_outbreaks"}, {"score": 0.0022081920438290193, "phrase": "different_domains"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Avian influenza", " Disease notification", " Classification", " Zoonoses", " Disease attributes", " Concept formation"], "paper_abstract": "Purpose: The speed and high potential impact of avian influenza's (AI) on local bird populations, poultry economies and human health make timely and coordinated characterization, assessment and response to possible threats essential. To collaborate effectively, stakeholders (public health, medical, veterinary, and agricultural professionals) must be able to communicate and record findings, assessments, and actions in a standard fashion. We seek to discern a taxonomy of concepts and relationships that are important to the stakeholder community when sharing information about the characterization and assessment of an AI outbreak, according to a consistent and common perspective, interpretation, and level of detail. Methods: To derive concepts relevant to AI characterization and assessment, we reviewed selected journal articles, reporting and laboratory forms, and public health websites associated with AI case reporting. We mapped concepts to existing medical terminologies within the Unified Medical Language System when possible, using the National Library of Medicine's MetaMap program. Results: From 54 distinct information sources, we extracted 1113 concepts, of which 533 mapped to 15 medical terminologies; 580 did not map to specific terminologies. Using a combination of semantic type-relationship matching and expert consensus, we constructed the proposed taxonomy, with linkages to existing terminologies where pragmatic. Conclusion: The proposed taxonomy describes core knowledge, data and communication needs for the characterization and assessment of AI outbreaks in the context of existing medical terminologies across different domains. We also describe areas for further work. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "A proposed taxonomy for characterization and assessment of avian influenza outbreaks", "paper_id": "WOS:000264089400004"}