{"auto_keywords": [{"score": 0.042627702443465865, "phrase": "intrusion_detection"}, {"score": 0.00481495049065317, "phrase": "multi-agent_system"}, {"score": 0.004596192494271827, "phrase": "wireless_sensor_networks"}, {"score": 0.004563427013973105, "phrase": "mobile_ad-hoc_networks"}, {"score": 0.004482526999029664, "phrase": "emergency_services"}, {"score": 0.00441883624011048, "phrase": "health_monitoring"}, {"score": 0.004187917910692495, "phrase": "networks'_openness"}, {"score": 0.003940706575253453, "phrase": "abnormal_behavior"}, {"score": 0.0037480753312398754, "phrase": "multi-agent_system_technologies"}, {"score": 0.0036292245355184576, "phrase": "diverse_soft_computing_and_machine_learning_techniques"}, {"score": 0.003464150192089816, "phrase": "prevention_systems"}, {"score": 0.0031448288291084, "phrase": "wireless_environment_intrusion_recognition_issues"}, {"score": 0.0030779528295407925, "phrase": "cloud_computing"}, {"score": 0.0030450484042676023, "phrase": "principal_contribution"}, {"score": 0.002937879003671346, "phrase": "existing_idps_schemes"}, {"score": 0.002896071795090179, "phrase": "traditional_artificial_computational_intelligence"}, {"score": 0.0028651061556017304, "phrase": "multi-agent_support"}, {"score": 0.0025364205320199703, "phrase": "idps"}, {"score": 0.0023864566654035924, "phrase": "far_superior_technological_platform"}, {"score": 0.0021662599012740127, "phrase": "computational_intelligence"}, {"score": 0.0021507795710951384, "phrase": "co-widpss"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computational intelligence", " Multi-agent systems", " Wireless sensor networks", " Intrusion detection and", " prevention systems (IDPS)", " Collaborative IDPS", " Cloud computing"], "paper_abstract": "The deployment of wireless sensor networks and mobile ad-hoc networks in applications such as emergency services, warfare and health monitoring poses the threat of various cyber hazards, intrusions and attacks as a consequence of these networks' openness. Among the most significant research difficulties in such networks safety is intrusion detection, whose target is to distinguish between misuse and abnormal behavior so as to ensure secure, reliable network operations and services. Intrusion detection is best delivered by multi-agent system technologies and advanced computing techniques. To date, diverse soft computing and machine learning techniques in terms of computational intelligence have been utilized to create Intrusion Detection and Prevention Systems (IDPS), yet the literature does not report any state-of-the-art reviews investigating the performance and consequences of such techniques solving wireless environment intrusion recognition issues as they gain entry into cloud computing. The principal contribution of this paper is a review and categorization of existing IDPS schemes in terms of traditional artificial computational intelligence with a multi-agent support. The significance of the techniques and methodologies and their performance and limitations are additionally analyzed in this study, and the limitations are addressed as challenges to obtain a set of requirements for IDPS in establishing a collaborative-based wireless IDPS (Co-WIDPS) architectural design. It amalgamates a fuzzy reinforcement learning knowledge management by creating a far superior technological platform that is far more accurate in detecting attacks. In conclusion, we elaborate on several key future research topics with the potential to accelerate the progress and deployment of computational intelligence based Co-WIDPSs. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "An appraisal and design of a multi-agent system based cooperative wireless intrusion detection computational intelligence technique", "paper_id": "WOS:000325237800010"}