{"auto_keywords": [{"score": 0.035935416587620665, "phrase": "offer_document"}, {"score": 0.00481495049065317, "phrase": "personnel_issues"}, {"score": 0.004771435352180973, "phrase": "software_development_projects"}, {"score": 0.0045804107341714, "phrase": "document_similarity_measures"}, {"score": 0.004397000006837371, "phrase": "software_development"}, {"score": 0.0042209023469249205, "phrase": "people_metrics"}, {"score": 0.0041827333568982055, "phrase": "similar_projects"}, {"score": 0.003978866233891427, "phrase": "service_provision_offer"}, {"score": 0.00385431710959668, "phrase": "new_proposed_project"}, {"score": 0.0036497740708342093, "phrase": "unstructured_texts"}, {"score": 0.003170060683860338, "phrase": "initial_indication"}, {"score": 0.0031271133933467575, "phrase": "similar_previous_projects"}, {"score": 0.0024129269611844794, "phrase": "comparable_parameters"}, {"score": 0.0022537212268979507, "phrase": "new_project"}], "paper_keywords": ["Ontologies", " Software Metrics", " Semantics", " GATE", " Natural Language Processing"], "paper_abstract": "This paper presents an architecture which applies document similarity measures to the documentation produced during the phases of software development in order to generate recommendations of process and people metrics for similar projects. The application makes a judgment of similarity of the Service Provision Offer (SPO) document of a new proposed project to a collection of Project History Documents (PHD), stored in a repository of unstructured texts. The process is carried out in three stages: firstly, clustering of the Offer document with the set of PHDs which are most similar to it; this provides the initial indication of whether similar previous projects exist, and signifies similarity. Secondly, determination of which PHD in the set is most comparable with the Offer document, based on various parameters: project effort, project duration (time), project resources (members/size of team), costs, and sector(s) involved, indicating comparability of projects. The comparable parameters are extracted using the GATE Natural Language Processing architecture. Lastly, a recommendation of metrics for the new project is made, which is based on the transferability of the metrics of the most similar and comparable PHD extracted, here referred to as recommendation.", "paper_title": "BMR: Benchmarking Metrics Recommender for Personnel issues in Software Development Projects", "paper_id": "WOS:000272257300007"}