{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "computational_complexity"}, {"score": 0.041692141960465806, "phrase": "identity_matrix"}, {"score": 0.004783852487938866, "phrase": "matrix_semigroup_problems"}, {"score": 0.004722254884093624, "phrase": "matrix_semigroups"}, {"score": 0.004340671055146398, "phrase": "two-dimensional_matrix_semigroups"}, {"score": 0.003925633992809873, "phrase": "matrix_semigroup"}, {"score": 0.0038127186374325582, "phrase": "finite_set"}, {"score": 0.003691048155818806, "phrase": "well-known_challenging_problem"}, {"score": 0.0031806400608033014, "phrase": "np"}, {"score": 0.003097865379563127, "phrase": "subset_sum_problem"}, {"score": 0.003048001809453513, "phrase": "upper_bound"}, {"score": 0.003018468582368033, "phrase": "nontrivial_decidability_result"}, {"score": 0.002998938434207771, "phrase": "c._choffrut"}, {"score": 0.0029795342727066696, "phrase": "j._karhumaki"}, {"score": 0.0028564228386290615, "phrase": "minimum_length_solution"}, {"score": 0.002828740624702789, "phrase": "identity_problem"}, {"score": 0.0028013259314454407, "phrase": "constructible_set"}, {"score": 0.0025331002386232014, "phrase": "np_algorithm"}, {"score": 0.0024761702541879213, "phrase": "shortest_sequence"}, {"score": 0.0021534125023440895, "phrase": "vector_reachability"}, {"score": 0.0021394674440767124, "phrase": "scalar_reachability"}, {"score": 0.0021049977753042253, "phrase": "right_upper_corner_problems"}], "paper_keywords": [""], "paper_abstract": "Most computational problems for matrix semigroups and groups are inherently difficult to solve and even undecidable starting from dimension three. The questions about the decidability and complexity of problems for two-dimensional matrix semigroups remain open and are directly linked with other challenging problems in the field. In this paper we study the computational complexity of the problem of determining whether the identity matrix belongs to a matrix semigroup (the Identity Problem) generated by a finite set of 2 x 2 integral unimodular matrices. The Identity Problem for matrix semigroups is a well-known challenging problem, which has remained open in any dimension until recently. It is currently known that the problem is decidable in dimension two and undecidable starting from dimension four. In particular, we show that the Identity Problem for 2 x 2 integral unimodular matrices is NP-hard by a reduction of the Subset Sum Problem and several new encoding techniques. An upper bound for the nontrivial decidability result by C. Choffrut and J. Karhumaki is unknown. However, we derive a lower bound on the minimum length solution to the Identity Problem for a constructible set of instances, which is exponential in the number of matrices of the generator set and the maximal element of the matrices. This shows that the most obvious candidate for an NP algorithm, which is to guess the shortest sequence of matrices which multiply to give the identity matrix, does not work correctly since the certificate would have a length which is exponential in the size of the instance. Both results lead to a number of corollaries confirming the same bounds for vector reachability, scalar reachability and zero in the right upper corner problems.", "paper_title": "On the Computational Complexity of Matrix Semigroup Problems", "paper_id": "WOS:000304190900002"}