{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large-scale_continuous_optimization"}, {"score": 0.004566308708871429, "phrase": "variable_interaction"}, {"score": 0.004311352359122141, "phrase": "rapid_growth"}, {"score": 0.004106725110985659, "phrase": "large-scale_complex_problems"}, {"score": 0.003775803846431323, "phrase": "large-scale_optimization_benchmark_suites"}, {"score": 0.003628460216207393, "phrase": "real-world_problems"}, {"score": 0.0035806300393050926, "phrase": "-uniform_subcomponent_sizes"}, {"score": 0.0032774280543222843, "phrase": "overlapping_subcomponents"}, {"score": 0.0031774686451753477, "phrase": "proposed_features"}, {"score": 0.0029602552900111407, "phrase": "evolutionary_techniques"}, {"score": 0.0029212075318449616, "phrase": "large-scale_continuous_optimization_problems"}, {"score": 0.002685558057339722, "phrase": "different_needs"}, {"score": 0.0026501241093379786, "phrase": "large-scale_global_optimization_benchmark_suite"}, {"score": 0.002512990657100351, "phrase": "brief_discussion"}, {"score": 0.002341094670523097, "phrase": "preliminary_comparative_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Benchmark", " Large-scale optimization", " Evolutionary computation"], "paper_abstract": "Three major sources of complexity in many real-world problems are size, variable interaction, and interdependence of the subcomponents of a problem. With the rapid growth in the size of businesses, the demand for solving large-scale complex problems will continue to grow. In this paper, we propose several major design features that need to be incorporated into large-scale optimization benchmark suites in order to better resemble the features of real-world problems. Non-uniform subcomponent sizes, imbalance between the contribution of various subcomponents of a problem, and the interaction between subcomponents by means of overlapping subcomponents are among these features. The proposed features are designed with the aim of closing the gap between the theory and practice of evolutionary techniques for solving large-scale continuous optimization problems. The general guidelines proposed in this paper can be used to design and construct various benchmark suites to meet different needs. The IEEE CEC'2013 large-scale global optimization benchmark suite [29] is one such implementation. The paper also contains a brief discussion on how the CEC'2013 benchmarks can be extended or modified for various purposes. Finally, a preliminary comparative study is conducted to showcase the performance of several state-of-the-art algorithms on the CEC'2013 large-scale benchmark problems. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Designing benchmark problems for large-scale continuous optimization", "paper_id": "WOS:000356732600024"}