{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "educational_course"}, {"score": 0.032327203716458655, "phrase": "control_group"}, {"score": 0.015376319150867715, "phrase": "gaming_addiction"}, {"score": 0.00477924690801092, "phrase": "language_expression"}, {"score": 0.004673709383305897, "phrase": "massive_multiplayer_online_role-playing_game"}, {"score": 0.004536592536813498, "phrase": "massive_multiple_online_role-playing_games"}, {"score": 0.004387117409226736, "phrase": "serious_problem"}, {"score": 0.00435460312598348, "phrase": "korea"}, {"score": 0.0040571383470418085, "phrase": "so-called_narrative"}, {"score": 0.0037518852820756323, "phrase": "narrative_characteristics"}, {"score": 0.003587842947046177, "phrase": "\"_influenced_language_expression"}, {"score": 0.003418186564522323, "phrase": "online_gaming"}, {"score": 0.00295571428544335, "phrase": "general_course"}, {"score": 0.002613487968156893, "phrase": "follow-up_examination"}, {"score": 0.0025556529150386168, "phrase": "experimental_group"}, {"score": 0.0025178072071268534, "phrase": "speaking_ability"}, {"score": 0.002398627220761345, "phrase": "pilot_erp_study"}, {"score": 0.0023021895404322767, "phrase": "gaming_activity"}, {"score": 0.002217880187104576, "phrase": "fronto-central_areas"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Massive multiplayer online role-playing game", " Language", " Education", " Addiction", " Event-related potential", " P300"], "paper_abstract": "Addiction to Massive Multiple Online Role-Playing Games (MMORPGs) among juveniles has become a serious problem in Korea and has led to legislation prohibiting juveniles from playing games after midnight. One key factor in gaming addiction is the so-called narrative, or story, garners create for themselves while playing. This study investigated how a course in writing and speaking using narrative characteristics and content borrowed from the MMORPG \"Dungeon & Fighter (DF)\" influenced language expression and gaming addiction. A total of 59 male high school students who were addicted to online gaming voluntarily participated in an experiment involving an educational course aimed at improving their writing and speaking. Participants were randomly divided into two groups, an experimental group of 27 students and a control group of 32 students (the control group participated in a general course addressing topics and various social issues unrelated to gaming). The experiment consisted of a total of 21 sessions lasting 2 h per day over a period of 2 months. The results of a follow-up examination revealed that participants in the experimental group improved their writing and speaking ability far more than those in the control group. In addition, a pilot ERP study suggested that the educational course in the experiment may reflect how gaming activity is processed in the brain, especially in the fronto-central areas, and thereby influence the course of addiction. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "The influence of an educational course on language expression and treatment of gaming addiction for massive multiplayer online role-playing game (MMORPG) players", "paper_id": "WOS:000317369900019"}