{"auto_keywords": [{"score": 0.042234660233635535, "phrase": "decay_function"}, {"score": 0.030353144436730508, "phrase": "basic_model"}, {"score": 0.00481495049065317, "phrase": "offenders'_spatial_behaviour."}, {"score": 0.004188702178897384, "phrase": "empirical_data"}, {"score": 0.003916098498242888, "phrase": "probability_density_function"}, {"score": 0.0037683358267785435, "phrase": "generative_models"}, {"score": 0.0035914198812657897, "phrase": "known_offenders"}, {"score": 0.0034892684482068347, "phrase": "police_data_archive"}, {"score": 0.0026268961477241026, "phrase": "also_preferred_direction"}, {"score": 0.0023743009016047424, "phrase": "generative_decay_model"}, {"score": 0.0021049977753042253, "phrase": "suspect_likelihood"}], "paper_keywords": ["Criminology", " offender behaviour modelling", " spacial data", " generative model"], "paper_abstract": "The relationship between distance travelled to an offence and frequency of offending has traditionally been expressed as a (downward-sloping) decay function and such a curve is typically used to fit empirical data. It is proposed here that a decay function should be viewed as a probability density function. It is then possible to construct generative models to assign probabilities to suspects from a set of known offenders whose past crimes are stored in a police data archive. Probabilities can then be used to prioritise suspects in an investigation and calculate the probability of being the culprit. Two functional forms of the decay function are considered: negative exponential and power. These are shown empirically to outperform a basic model which simply ranks suspects by distance from the crime. The model is then extended to include also preferred direction of travel which varies between offenders. If direction of travel is incorporated then predictions become more accurate. The generative decay model has two advantages over a basic model. Firstly it can incorporate other information such as past frequency of offending. Secondly, it provides an estimate of suspect likelihood indicating the trustworthiness of any inference by the model.", "paper_title": "A GENERATIVE MODEL OF OFFENDERS' SPATIAL BEHAVIOUR", "paper_id": "WOS:000295333500005"}