{"auto_keywords": [{"score": 0.04949022042340676, "phrase": "cpoe"}, {"score": 0.03279038472400806, "phrase": "cpoe_systems"}, {"score": 0.00481495049065317, "phrase": "computerized_provider_order_entry_systems"}, {"score": 0.0047852458513833315, "phrase": "computerized_physician_order_entry"}, {"score": 0.004596561972944185, "phrase": "physician_orders"}, {"score": 0.004484148947356818, "phrase": "outpatient_setting"}, {"score": 0.004374473000977313, "phrase": "u.s._hospitals"}, {"score": 0.004293972451176702, "phrase": "ambulatory_clinics"}, {"score": 0.004214947028602297, "phrase": "clinical_decision_support"}, {"score": 0.0037820003983334476, "phrase": "medication_safety"}, {"score": 0.0034893313013551704, "phrase": "cpoe_exemplar_sites"}, {"score": 0.003467776242953087, "phrase": "homegrown_clinical_information_systems"}, {"score": 0.0034250633972597254, "phrase": "increasing_implementation"}, {"score": 0.0034039039924579437, "phrase": "commercial_cpoe_systems"}, {"score": 0.0033000452351286077, "phrase": "implementation_approaches"}, {"score": 0.0032593915869553714, "phrase": "previously_published_results"}, {"score": 0.003209275810748739, "phrase": "new_errors"}, {"score": 0.0031894452350840147, "phrase": "even_harm"}, {"score": 0.0031306834002600547, "phrase": "new_initiatives"}, {"score": 0.002942495422585405, "phrase": "cpoe_vendor_capabilities"}, {"score": 0.0029243084850457757, "phrase": "effective_approaches"}, {"score": 0.0028438444033180303, "phrase": "published_studies"}, {"score": 0.0027146141712666694, "phrase": "cchit"}, {"score": 0.0025199184718145604, "phrase": "public_and_private_health_insurance_programs"}, {"score": 0.0024354002939660597, "phrase": "flight_simulation_tools"}, {"score": 0.0022747539135765204, "phrase": "performance_programs"}, {"score": 0.002253682813700968, "phrase": "increasing_role"}, {"score": 0.0022258906408344973, "phrase": "health_care"}, {"score": 0.0021512129013162846, "phrase": "actual_practice"}], "paper_keywords": [""], "paper_abstract": "Computerized physician order entry (CPOE) is an application that is used to electronically write physician orders either in the hospital or in the outpatient setting. It is used in about 15% of U.S. Hospitals and a smaller percentage of ambulatory clinics. It is linked with clinical decision support, which provides much of the value of implementing it. A number of studies have assessed the impact of CPOE with respect to a variety of parameters, including costs of care, medication safety, use of guidelines or protocols, and other measures of the effectiveness or quality of care. Most of these studies have been undertaken at CPOE exemplar sites with homegrown clinical information systems. With the increasing implementation of commercial CPOE systems in various settings of care has come evidence that some implementation approaches may not achieve previously published results or may actually cause new errors or even harm. This has lead to new initiatives to evaluate CPOE systems, which have been undertaken by both vendors and other groups who evaluate vendors, focused on CPOE vendor capabilities and effective approaches to implementation that can achieve benefits seen in published studies. In addition, an electronic health record (EHR) vendor certification process is ongoing under the province of the Certification Commission for Health Information Technology (CCHIT) (which includes CPOE) that will affect the purchase and use of these applications by hospitals and clinics and their participation in public and private health insurance programs. Large employers have also joined this focus by developing flight simulation tools to evaluate the capabilities of these CPOE systems once implemented, potentially linking the results of such programs to reimbursement through pay for performance programs. The increasing role of CPOE systems in health care has invited much more scrutiny about the effectiveness of these systems in actual practice which has the potential to improve their ultimate performance.", "paper_title": "Evaluation and certification of computerized provider order entry systems", "paper_id": "WOS:000243571400008"}