{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "all-speed_implicit_non-dissipative_dns_algorithm"}, {"score": 0.00442457549952546, "phrase": "dns_algorithm"}, {"score": 0.0040971095888461045, "phrase": "low_mach_numbers"}, {"score": 0.003957735532719663, "phrase": "application_area"}, {"score": 0.003445906915464945, "phrase": "relaxing_procedure"}, {"score": 0.003290403747743492, "phrase": "base_algorithm"}, {"score": 0.0031298260299218684, "phrase": "wide_range"}, {"score": 0.0031058249097051555, "phrase": "spatial_and_temporal_scales"}, {"score": 0.0030583717270715556, "phrase": "hydrodynamic_instabilities"}, {"score": 0.002977061391551628, "phrase": "varying_mach_number_regimes"}, {"score": 0.002853620962601042, "phrase": "taylor-green_vortex"}, {"score": 0.0027458373015999916, "phrase": "turbulent_shear_layer"}, {"score": 0.002631959004685823, "phrase": "rayleigh-taylor_instability"}, {"score": 0.0025130941721410558, "phrase": "previous_experimental_and_numerical_studies"}, {"score": 0.002381169982803105, "phrase": "complex_physical_mechanisms"}, {"score": 0.002273605493468005, "phrase": "-speed_algorithms"}, {"score": 0.002154226045704907, "phrase": "fluid_dynamics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["DNS", " Hydrodynamic instabilities", " All-speed", " Implicit", " PETSc"], "paper_abstract": "Context: An all-speed, implicit, non-dissipative and discrete kinetic energy conserving DNS algorithm is applied to three hydrodynamic instabilities which show many aspects of flow modeling such as transition to turbulence and turbulent mixing at low Mach numbers. Objective: Our aim is to extend the application area of these kinds of methods and also to perform their further assessments and improvements. Method: For this purpose, an in-house, fully implicit, fully parallel DNS solver was developed based on the algorithm using PETSc. A relaxing procedure to pressure in time was also adopted and implemented into the base algorithm to improve its convergence properties. The solver was applied to the problems including wide range of spatial and temporal scales simultaneously such as hydrodynamic instabilities where laminar, transitional and turbulent regimes are found together with varying Mach number regimes. Results: Numerical results for transition to turbulence in Taylor-Green Vortex (TGV), velocity-induced mixing in Turbulent Shear Layer (TSL), and gravity-induced mixing in Rayleigh-Taylor Instability (RTI) were presented in detail and successfully compared to previous experimental and numerical studies. Conclusions: It is confirmed that the algorithm is able to produce complex physical mechanisms behind these flows correctly. This study also shows that all-speed algorithms can be considered as very promising and attractive options for challenging problems in fluid dynamics. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Application of an all-speed implicit non-dissipative DNS algorithm to hydrodynamic instabilities", "paper_id": "WOS:000339775500022"}