{"auto_keywords": [{"score": 0.04530965963940632, "phrase": "impact"}, {"score": 0.00481495049065317, "phrase": "social_and_personality_psychology"}, {"score": 0.004690694501758065, "phrase": "citation_impact"}, {"score": 0.004641890423057823, "phrase": "social-personality_psychology"}, {"score": 0.004522080178250592, "phrase": "bibliometric_study"}, {"score": 0.004382364826200616, "phrase": "field's_three_major_journals"}, {"score": 0.003926359151817743, "phrase": "multiple_databases"}, {"score": 0.0038854765143440965, "phrase": "trained_coders"}, {"score": 0.0038049789989278463, "phrase": "author_characteristics"}, {"score": 0.003251920460276645, "phrase": "article_organization"}, {"score": 0.002721388234661538, "phrase": "multivariate_analyses"}, {"score": 0.0026233771102489394, "phrase": "first_author_eminence"}, {"score": 0.002241679436497569, "phrase": "university_prestige"}, {"score": 0.002218299213266519, "phrase": "grant_support"}, {"score": 0.002195162304124588, "phrase": "title_catchiness"}, {"score": 0.0021049977753042253, "phrase": "correlational_methodology"}], "paper_keywords": [""], "paper_abstract": "Factors contributing to citation impact in social-personality psychology were examined in a bibliometric study of articles published in the field's three major journals. Impact was operationalized as citations accrued over 10 years by 308 articles published in 1996, and predictors were assessed using multiple databases and trained coders. Predictors included author characteristics (i.e., number, gender, nationality, eminence), institutional factors (i.e., university prestige, journal prestige, grant support), features of article organization (i.e., title characteristics, number of studies, figures and tables, number and recency of references), and research approach (i.e., topic area, methodology). Multivariate analyses demonstrated several strong predictors of impact, including first author eminence, having a more senior later author, journal prestige, article length, and number and recency of references. Many other variables - e.g., author gender and nationality, collaboration, university prestige, grant support, title catchiness, number of studies, experimental vs. correlational methodology, topic area - did not predict impact.", "paper_title": "What makes an article influential? Predicting impact in social and personality psychology", "paper_id": "WOS:000256779500010"}