{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "switching_activity"}, {"score": 0.044340662163821175, "phrase": "test_application"}, {"score": 0.004323886831151445, "phrase": "multipattern_tests"}, {"score": 0.004178351419209898, "phrase": "single-pattern_or_two-pattern_tests"}, {"score": 0.0037519679864796906, "phrase": "lower_switching_activity"}, {"score": 0.0034355662264234864, "phrase": "static_test_compaction_procedure"}, {"score": 0.0031767199435197243, "phrase": "clock_cycles"}, {"score": 0.0028944757265206332, "phrase": "test_pair"}, {"score": 0.002742648551009682, "phrase": "single_test"}, {"score": 0.002598764579760562, "phrase": "high_switching_activity"}, {"score": 0.002523481637809674, "phrase": "merged_test"}, {"score": 0.0024264776194357993, "phrase": "proposed_procedure"}, {"score": 0.002391067964886602, "phrase": "test_merging_procedure"}, {"score": 0.0021049977753042253, "phrase": "test_merging"}], "paper_keywords": ["Multicycle tests", " static test compaction", " switching activity", " transition faults"], "paper_abstract": "Multicycle (multipattern) scan-based tests contain multiple clock cycles between scan operations. Each such clock cycle defines a pattern of the test. Multipattern tests require fewer clock cycles for test application compared with single-pattern or two-pattern tests for the same target faults. In addition, this paper demonstrates that patterns appearing later in a test typically have lower switching activity than patterns appearing earlier in the test. Based on these observations, the paper presents a static test compaction procedure for multipattern tests that targets a reduction in switching activity while reducing the number of clock cycles required for test application. The procedure is based on an operation called test merging. Merging of a test pair causes the patterns from both tests to appear in a single test. By placing the patterns from a test with a high switching activity at the end of a merged test, their switching activity can be reduced. The proposed procedure combines the test merging procedure with a procedure that modifies a test set so as to reduce its switching activity. Through this procedure it takes advantage of the opportunities created by test merging to reduce the switching activity of patterns that appear later in a test.", "paper_title": "On the Switching Activity and Static Test Compaction of Multicycle Scan-Based Tests", "paper_id": "WOS:000305706700011"}