{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mail_handlers"}, {"score": 0.004561950666122737, "phrase": "dual-purpose_simulation_model"}, {"score": 0.004250969091124481, "phrase": "first_system"}, {"score": 0.004146327465630697, "phrase": "daily_equipment_schedules"}, {"score": 0.0039446780026489905, "phrase": "permanent_workforce"}, {"score": 0.0039120325834029355, "phrase": "large-scale_integer_programs"}, {"score": 0.003690927840780375, "phrase": "time_granularity"}, {"score": 0.003570218982072853, "phrase": "independent_means"}, {"score": 0.003439117493141663, "phrase": "first_purpose"}, {"score": 0.0032717489668326275, "phrase": "labor_requirements"}, {"score": 0.0030867203659106727, "phrase": "one-to-one_relationship"}, {"score": 0.003010651173285521, "phrase": "equipment_schedule"}, {"score": 0.002960979624379786, "phrase": "mail_arrival_profiles"}, {"score": 0.0027703320456201074, "phrase": "productivity_measures"}, {"score": 0.0027473784878300133, "phrase": "formal_work_rules"}, {"score": 0.002549146857303602, "phrase": "mail_handler_requirements"}, {"score": 0.0024759682272230735, "phrase": "weekly_schedules"}, {"score": 0.0024350966556966757, "phrase": "staff_optimizer"}, {"score": 0.0023750478314945303, "phrase": "facility's_service_standards"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["simulation", " shift scheduling", " Labor requirements", " optimization validation"], "paper_abstract": "In this research, we introduce a dual-purpose simulation model that integrates two decision support systems used by the US Postal Service to configure and staff their mail processing and distribution centers (P&DCs). The first system is designed to optimize the daily equipment schedules and the second to optimize the size and composition of the permanent workforce. Large-scale integer programs are solved in both cases. Because some compromise is needed in the time granularity, it is important to have an independent means of validating the results. This is the first purpose of our simulation model. The second involves the generation and validation of labor requirements for a category of workers known as mail handlers. While there is a one-to-one relationship between machine operators and the equipment schedule derived from the mail arrival profiles, no such relationship exists for those responsible for moving the mail between workstations. Neither productivity measures nor formal work rules exist. To resolve this shortcoming, we use simulation again, but this time to estimate mail handler requirements and then to determine whether the weekly schedules derived from the staff optimizer are adequate to meet the facility's service standards. Holistically speaking, the simulation serves as a bridge between the two optimization systems. The procedure is demonstrated with data provided by the Dallas P&DC. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Generating labor requirements and rosters for mail handlers using simulation and optimization", "paper_id": "WOS:000236161200011"}