{"auto_keywords": [{"score": 0.04726673405217005, "phrase": "access_links"}, {"score": 0.04569647441539398, "phrase": "mobile_station"}, {"score": 0.04525702858275573, "phrase": "relay_station"}, {"score": 0.03672998173300791, "phrase": "isolation_band"}, {"score": 0.03250599422606808, "phrase": "access_link"}, {"score": 0.004601508848655033, "phrase": "throughput_performance"}, {"score": 0.003876806615011266, "phrase": "spectrum_efficiency"}, {"score": 0.003266165586518764, "phrase": "rs"}, {"score": 0.002982307044758515, "phrase": "frequency_reuse"}, {"score": 0.002907992115184249, "phrase": "base_station"}, {"score": 0.0023762535034673017, "phrase": "interference_measurement"}, {"score": 0.0023523750536537102, "phrase": "comprehensive_simulation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Frequency reuse", " Relay network", " Isolation band"], "paper_abstract": "In this paper, throughput performance of the access links (i.e., base station to mobile station and relay station to mobile station) is analyzed for the two-hop IEEE 802.16j wireless relay networks with asymmetrical topology. In specific, three frequency reuse schemes are proposed to improve the spectrum efficiency of the access links: (1) an isolation band based frequency reuse scheme (IBFRS) which introduces an isolation band surrounding each relay station (RS) cluster (Le, a separate RS or several adjacent RSs) so that the throughput of the access link can be improved by allowing frequency reuse between RSs and the base station (BS): (2) the dynamic frequency power partition (DFPP) scheme for reusing the frequency among RSs; (3) the selective reuse (SR) scheme for the RSs to further selectively reuse the frequency in the isolation band according to the interference measurement. Comprehensive simulation shows that by applying the proposed IBFRS+DFPP+SR, the throughput of the access link can be significantly improved. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Multiple frequency reuse schemes in the two-hop IEEE 802.16j wireless relay networks with asymmetrical topology", "paper_id": "WOS:000268417300006"}