{"auto_keywords": [{"score": 0.04373932371398143, "phrase": "arithmetical_hierarchy"}, {"score": 0.042241510933875154, "phrase": "analytic_hierarchy"}, {"score": 0.031461310706329015, "phrase": "open_terms"}, {"score": 0.004780183091824403, "phrase": "first-order_term"}, {"score": 0.004626796109657584, "phrase": "undecidable_property"}, {"score": 0.004287680323820891, "phrase": "distinct_levels"}, {"score": 0.0041200448395938526, "phrase": "first_order_arithmetical_formulas"}, {"score": 0.003958937342925219, "phrase": "function_variables"}, {"score": 0.00376293585033711, "phrase": "main_properties"}, {"score": 0.0037357362372975327, "phrase": "first_order_term_rewriting_systems"}, {"score": 0.0031272381208680613, "phrase": "single_term_version"}, {"score": 0.0030933709720820605, "phrase": "uniform_version"}, {"score": 0.002897710777957041, "phrase": "particular_problem"}, {"score": 0.002876747208161839, "phrase": "local_confluence"}, {"score": 0.0028045585284215044, "phrase": "ground_terms"}, {"score": 0.002579847272930948, "phrase": "minimality_flag"}, {"score": 0.002255431275670053, "phrase": "folklore_constructions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": [""], "paper_abstract": "Undecidability of various properties of first-order term rewriting systems is well-known. An undecidable property can be classified by the complexity of the formula defining it. This classification gives rise to a hierarchy of distinct levels of undecidability, starting from the arithmetical hierarchy classifying properties using first order arithmetical formulas, and continuing into the analytic hierarchy, where quantification over function variables is allowed. In this paper we give an overview of how the main properties of first order term rewriting systems are classified in these hierarchies. We consider properties related to normalization (strong normalization, weak normalization and dependency problems) and properties related to confluence (confluence, local confluence and the unique normal form property). For all of these we distinguish between the single term version and the uniform version. Where appropriate, we also distinguish between ground and open terms. Most uniform properties are Pi(0)(2)-complete. The particular problem of local confluence turns out to be Pi(0)(2)-complete for ground terms, but only Sigma(0)(1)-complete (and thereby recursively enumerable) for open terms. The most surprising result concerns dependency pair problems without minimality flag: we prove this problem to be Pi(1)(1)-complete, hence not in the arithmetical hierarchy, but properly in the analytic hierarchy. Some of our results are new or have appeared in our earlier publications. Others are based on folklore constructions, and are included for completeness as their precise classifications have hardly been noticed previously. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Levels of undecidability in rewriting", "paper_id": "WOS:000286479900009"}