{"auto_keywords": [{"score": 0.04747135426005355, "phrase": "kth-ranked_element"}, {"score": 0.004773692073488661, "phrase": "specified_ranks"}, {"score": 0.004088421020408183, "phrase": "median_salary"}, {"score": 0.003933000051147382, "phrase": "exact_salaries"}, {"score": 0.003441352119167824, "phrase": "two-party_and_multi-party_protocols"}, {"score": 0.0029467742734417255, "phrase": "computation_cost"}, {"score": 0.002726740692380339, "phrase": "input_data"}, {"score": 0.002680114113899346, "phrase": "multi-party_setting"}, {"score": 0.0023548511815224098, "phrase": "multi-party_protocol"}, {"score": 0.002294686545883412, "phrase": "two-party_case"}, {"score": 0.002197801146305747, "phrase": "communication_complexity"}, {"score": 0.0021232402128269906, "phrase": "malicious_adversary"}, {"score": 0.0021049977753042253, "phrase": "simple_consistency_checks"}], "paper_keywords": ["Secure function evaluation", " Secure multi-party computation", " kth-ranked element", " Median", " Semi-honest adversary", " Malicious adversary"], "paper_abstract": "We consider the problem of securely computing the kth-ranked element of the union of two or more large, confidential data sets. This is a fundamental question motivated by many practical contexts. For example, two competitive companies may wish to compute the median salary of their combined employee populations without revealing to each other the exact salaries of their employees. While protocols do exist for computing the kth-ranked element, they require time that is at least linear in the sum of the sizes of their combined inputs. This paper investigates two-party and multi-party protocols for both the semi-honest and malicious cases. In the two-party setting, we prove that the problem can be solved in a number of rounds that is logarithmic in k, where each round requires communication and computation cost that is linear in b, the number of bits needed to describe each element of the input data. In the multi-party setting, we prove that the number of rounds is linear in b, where each round has overhead proportional to b multiplied by the number of parties. The multi-party protocol can be used in the two-party case. The overhead introduced by our protocols closely match the communication complexity lower bound. Our protocols can handle a malicious adversary via simple consistency checks.", "paper_title": "Secure Computation of the Median (and Other Elements of Specified Ranks)", "paper_id": "WOS:000277178400001"}