{"auto_keywords": [{"score": 0.049450454172374335, "phrase": "hot_spots"}, {"score": 0.049242760099794294, "phrase": "sm_proteins"}, {"score": 0.005957873817986479, "phrase": "non-hot_spot_residues"}, {"score": 0.005677944597489896, "phrase": "bid_set"}, {"score": 0.005615796286567056, "phrase": "charged_residues"}, {"score": 0.005505629082313557, "phrase": "knowledge-based_pair_potentials"}, {"score": 0.00481495049065317, "phrase": "protein_subunit"}, {"score": 0.00477270620699354, "phrase": "statistical_analysis"}, {"score": 0.004699664386595411, "phrase": "distinguishing_property"}, {"score": 0.004679000396329253, "phrase": "sm_protein_associations"}, {"score": 0.004477270137801732, "phrase": "sm_protein_interfaces"}, {"score": 0.004428205359005308, "phrase": "test_set"}, {"score": 0.004312622975366676, "phrase": "main_differences"}, {"score": 0.0038117295927320525, "phrase": "bid_test"}, {"score": 0.0037854822492500557, "phrase": "coordination_numbers"}, {"score": 0.003670387594262638, "phrase": "non-hot_spots"}, {"score": 0.0034898502600578495, "phrase": "small_fraction"}, {"score": 0.0034061829188663717, "phrase": "binding_energy"}, {"score": 0.0033539839843409348, "phrase": "protein-protein_interactions"}, {"score": 0.003273732708344637, "phrase": "sm"}, {"score": 0.0032224422341379797, "phrase": "average_conservation_score"}, {"score": 0.0030571162526568164, "phrase": "mean_values"}, {"score": 0.003043652309382266, "phrase": "hot_spot"}, {"score": 0.0029575661759451044, "phrase": "pair_potentials"}, {"score": 0.002912222095383313, "phrase": "sm_and_bid_data_sets"}, {"score": 0.0028549396580672417, "phrase": "amino_acids"}, {"score": 0.0026426566254574343, "phrase": "average_coordination_number"}, {"score": 0.0026252106881752067, "phrase": "hot_spot_residues"}, {"score": 0.002522921193900982, "phrase": "calculated_average_conservation_score"}, {"score": 0.0022442505380273854, "phrase": "conservation_scores"}, {"score": 0.002200077887697072, "phrase": "significant_distinction"}, {"score": 0.0021903801614787423, "phrase": "hot_and_non-hot_spots"}, {"score": 0.002161542155696987, "phrase": "hot_and_non-hot_spot_residues"}, {"score": 0.0021049977753042253, "phrase": "structurally_conserved_residues"}], "paper_keywords": ["Protein interface", " Sm proteins", " Hot spots", " Statistical analysis"], "paper_abstract": "The distinguishing property of Sm protein associations is very high stability. In order to understand this property, we analyzed the interfaces and compared the properties of Sm protein interfaces with those of a test set, the Binding Interface Database (BID). The comparison revealed that the main differences between the interfaces of Sm proteins and those of the BID set are the content of charged residues, the coordination numbers of the residues, knowledge-based pair potentials, and the conservation scores of hot spots. In Sm proteins, the interfaces have more hydrophobic and fewer charged residues than the surfaces, which is also the case for the BID test set and other proteins. However, in the interfaces, the content of charged residues in Sm proteins (26%) is substantially larger than that in the BID set (22%). Hot spots are residues that make up a small fraction of the interfaces, but they contribute most of the binding energy. These residues are critical to protein-protein interactions. Analyses of knowledge-based pair potentials of hot spot and non-hot spot residues in Sm proteins show that they are significantly different; their mean values are 31.5 and 11.3, respectively. In the BID set, this difference is smaller; in this case, the mean values for hot spot and non-hot spot residues are 20.7 and 12.4, respectively. Hence, the pair potentials of hot spots differ significantly for the Sm and BID data sets. In the interfaces of Sm proteins, the amino acids are tightly packed, and the coordination numbers are larger in Sm proteins than in the BID set for both hot spots and non-hot spots. At the same time, the coordination numbers are higher for hot spots; the average coordination number of the hot spot residues in Sm proteins is 7.7, while it is 6.1 for the non-hot spot residues. The difference in the calculated average conservation score for hot spots and non-hot spots in Sm proteins is significantly larger than it is in the BID set. In Sm proteins, the average conservation score for the hot spots is 7.4. Hot spots are surrounded by residues that are moderately conserved (5.9). The average conservation score for the other interface residues is 5.6. The conservation scores in the BID set do not show a significant distinction between hot and non-hot spots: the mean values for hot and non-hot spot residues are 5.5 and 5.2, respectively. These data show that structurally conserved residues and hot spots are significantly correlated in Sm proteins.", "paper_title": "Protein subunit interfaces: a statistical analysis of hot spots in Sm proteins", "paper_id": "WOS:000282515400009"}