{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "book_chapter"}, {"score": 0.039047499795672735, "phrase": "interdisciplinary_field"}, {"score": 0.004449772140968921, "phrase": "first_part"}, {"score": 0.004399905285945236, "phrase": "brief_overview"}, {"score": 0.004366970206156021, "phrase": "state-of-the-art_nanofabrication_technologies"}, {"score": 0.004205940624913343, "phrase": "top-down_methods"}, {"score": 0.004158794879468156, "phrase": "replication-based_methods"}, {"score": 0.004112175423546628, "phrase": "working_principles"}, {"score": 0.003901407184706592, "phrase": "commonly-used_nanomaterials"}, {"score": 0.0038576618286586387, "phrase": "nanofabrication_technologies"}, {"score": 0.003757480190200645, "phrase": "increasingly_rapid_growth"}, {"score": 0.0036188435232325337, "phrase": "future_direction"}, {"score": 0.0035514484574435574, "phrase": "second_part"}, {"score": 0.0034203874753429113, "phrase": "typical_biomedical_research_fields"}, {"score": 0.0033315236647127734, "phrase": "drug_delivery"}, {"score": 0.0030901063954739375, "phrase": "unique_characteristics"}, {"score": 0.0026087958216676676, "phrase": "subject_biological_entities"}, {"score": 0.002502995662011305, "phrase": "scientific_literatures"}, {"score": 0.002286781334850213, "phrase": "big_picture"}, {"score": 0.0022696277881969896, "phrase": "current_development"}, {"score": 0.002252602622785975, "phrase": "potential_perspective"}, {"score": 0.0021049977753042253, "phrase": "different_research_disciplines"}], "paper_keywords": [""], "paper_abstract": "This book chapter concentrates on applications of nanotechnologies in the field of biological/medical research. The chapter is presented in two parts. In the first part, a brief overview of state-of-the-art nanofabrication technologies is provided, including bottom-up methods, top-down methods, and replication-based methods. The working principles, advantages and limitations of each technology are presented and discussed. The commonly-used nanomaterials for these nanofabrication technologies are also reviewed. Considering the increasingly rapid growth of this interdisciplinary field, several representative emerging nanofabrication technologies are demonstrated and the future direction is commented. The second part of the chapter focuses on applications of nanotechnologies in typical biomedical research fields, including biosensing, bioactuating, drug delivery and therapeutics. Since the nanodevices and nanosystems are similarly in size with many biological entities and possess a number of unique characteristics different from their micro/meso/macroscale counterparts, they can be used to address many unsolved problems in the biological/medical field. Several successful nanoengineered devices and systems are elucidated. The fabrication, characterization and measurement of the nanosystems are demonstrated, with an emphasis of the interaction between these nanosystems and the subject biological entities. These nanosystems are drawn from the technologies reported in scientific literatures, which are being used in research or under the way of commercialization. These examples are expected to provide the readers a big picture of current development and potential perspective of nanobiotechnology. Meanwhile, we would convey via this book chapter the importance of technologies fusion among different research disciplines upon development of the interdisciplinary field.", "paper_title": "Nanobiotechnology: An engineer's foray into biology", "paper_id": "WOS:000248300600002"}