{"auto_keywords": [{"score": 0.029194775311635456, "phrase": "temporal_consistency"}, {"score": 0.015070814165808232, "phrase": "epidemiological_data"}, {"score": 0.013851147354614117, "phrase": "medical_evidence"}, {"score": 0.010797647463486076, "phrase": "temporal_imprecision"}, {"score": 0.009804187238762552, "phrase": "real_case"}, {"score": 0.00481495049065317, "phrase": "human_transmission_case"}, {"score": 0.004691186518512389, "phrase": "temporal_reasoning_techniques"}, {"score": 0.004495457341039889, "phrase": "avian_influenza_virus"}, {"score": 0.0043695094086599155, "phrase": "documented_real_case"}, {"score": 0.004338575266640439, "phrase": "possible_infection"}, {"score": 0.003974517925101667, "phrase": "temporal_distribution"}, {"score": 0.0036930382298437678, "phrase": "generic_temporal_reasoner"}, {"score": 0.0035220708047207084, "phrase": "quantitative_and_qualitative_ones"}, {"score": 0.00348883571059402, "phrase": "specifically_designed_language"}, {"score": 0.0032570481253401807, "phrase": "complex_domains"}, {"score": 0.00323396412235935, "phrase": "medical_one"}, {"score": 0.003143247488707568, "phrase": "easy_integration"}, {"score": 0.002934352120961826, "phrase": "temporal_information"}, {"score": 0.0026435428214880694, "phrase": "generic_clinical_symptoms"}, {"score": 0.0026185759407265047, "phrase": "avian_influenza"}, {"score": 0.0025330295341397333, "phrase": "temporal_possibility"}, {"score": 0.002438670603354641, "phrase": "temporal_reasoning"}, {"score": 0.0023702098733815674, "phrase": "ftcn_formalism"}, {"score": 0.0023533964075338016, "phrase": "proposed_language"}, {"score": 0.00232012560670907, "phrase": "qualitative_and_quantitative_temporal_relations"}, {"score": 0.0022231026365146815, "phrase": "temporal_reasoner_permits"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy temporal reasoning", " Temporal constraints", " Evidence-based medicine", " Avian influenza"], "paper_abstract": "The aim of this paper is to demonstrate how temporal reasoning techniques can assist in the analysis of epidemiological data to determine the possibility of contagion among humans of the avian influenza virus (H5N1). To do so, we use a documented real case of a possible infection of H5N1 between humans, and formally substantiate the medical evidence. The need to represent and manage time is implicit in many reasoning processes. This is particularly evident in the field of medicine, in which the temporal distribution of symptoms is crucial for understanding the evolution of diseases. Many models have been proposed for time representation and management. In this paper we propose the use of a generic temporal reasoner, FuzzyTIME, which is able to represent both points and intervals, as well as relations, including quantitative and qualitative ones, through a specifically designed language. Moreover, being based on FTCN (fuzzy temporal constraint networks), the proposed model also allows us to capture both temporal imprecision and uncertainty present in complex domains as the medical one. Nevertheless, the reasoner has been design to have an easy integration with any knowledge based system that need this kind of representation and reasoning. To perform the analysis of the real case selected, we first clearly identified the temporal information in each of the timelines of the subjects under study. Subsequently, this information was formalized in the language provided by FuzzyTIME. After verifying the temporal consistency of such information in every subject, we proceeded to check the temporal consistency of such information with the generic clinical symptoms of evolution of avian influenza. Finally, the queries which were modeled allowed us to determine the temporal possibility of infection between human of the H5N1 virus. First, we demonstrate the usefulness of temporal reasoning in the modeling and analysis of epidemiological data, showing how the FTCN formalism and the proposed language is sufficiently expressive to represent qualitative and quantitative temporal relations as well as the temporal imprecision implicit in certain expressions extracted from the real case selected. Moreover, the temporal reasoner permits efficient determination of the temporal consistency of the medical evidence concerning the possibility of infection of H5N1 between humans. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Avian influenza: Temporal modeling of a human to human transmission case", "paper_id": "WOS:000289047700105"}