{"auto_keywords": [{"score": 0.04895692824063783, "phrase": "network_coding"}, {"score": 0.00481495049065317, "phrase": "live_peer-to-peer_streaming"}, {"score": 0.004610058444728656, "phrase": "promising_information_theoretic_approach"}, {"score": 0.0042426974826585695, "phrase": "network_throughput"}, {"score": 0.004209269012699911, "phrase": "multicast_sessions"}, {"score": 0.004176102823067887, "phrase": "directed_acyclic_graphs"}, {"score": 0.003753022329975749, "phrase": "last_missing_blocks"}, {"score": 0.0035931556794840027, "phrase": "reality_check"}, {"score": 0.003153140905312787, "phrase": "decoding_process"}, {"score": 0.003128270147867462, "phrase": "gauss-jordan_elimination"}, {"score": 0.0030187498405804315, "phrase": "coded_blocks"}, {"score": 0.002913052619634697, "phrase": "realistic_testbed"}, {"score": 0.0028446460307503343, "phrase": "actual_network_traffic"}, {"score": 0.0026384167183586015, "phrase": "architectural_design_challenges"}, {"score": 0.0023242388639441607, "phrase": "finer_granularity"}, {"score": 0.0022606512324475584, "phrase": "bandwidth_usage"}, {"score": 0.002138636271204459, "phrase": "bandwidth_supply"}, {"score": 0.0021049977753042253, "phrase": "streaming_demand"}], "paper_keywords": ["multimedia streaming", " network coding", " peer-to-peer networks"], "paper_abstract": "In recent literature, network coding has emerged as a promising information theoretic approach to improve the performance of both peer-to-peer (P2P) and wireless networks. It has been widely accepted and acknowledged that network coding can theoretically improve network throughput of multicast sessions in directed acyclic graphs, achieving their cut-set capacity bounds. Recent studies have also supported the claim that network coding is beneficial for large-scale P2P content distribution, as it solves the problem of locating the last missing blocks to complete the download. We seek to perform a reality check of using network coding for P2P live multimedia streaming. We start with the following critical question: How helpful is network coding in P2P streaming? To address this question, we first implement the decoding process using Gauss-Jordan elimination, such that it can be performed while coded blocks are progressively received. We then implement a realistic testbed, called Lava, with actual network traffic to meticulously evaluate the benefits and tradeoffs involved in using network coding in P2P streaming. We present the architectural design challenges in implementing network coding for the purpose of streaming, along with a pull-based P2P live streaming protocol in our comparison studies. Our experimental results show that network coding makes it possible to perform streaming with a finer granularity, which reduces the redundancy of bandwidth usage, improves resilience to network dynamics, and is most instrumental when the bandwidth supply barely meets the streaming demand.", "paper_title": "Network coding in live peer-to-peer streaming", "paper_id": "WOS:000251109900003"}