{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "well_designed_website"}, {"score": 0.004707913053935566, "phrase": "five_indicators"}, {"score": 0.004044822781630218, "phrase": "single_construct"}, {"score": 0.003999578057088828, "phrase": "rasch's_model"}, {"score": 0.0036553070575015344, "phrase": "fictitious_clothes_company"}, {"score": 0.002853396755102163, "phrase": "five_subsamples"}, {"score": 0.002506715532901322, "phrase": "five_websites"}, {"score": 0.0023827927890399357, "phrase": "perceptual_map"}, {"score": 0.0023428586429492713, "phrase": "dyane_software"}, {"score": 0.0021896891011033105, "phrase": "best_effect"}], "paper_keywords": ["Mass media communications", " Consumer attitudes & behaviour", " Marketing & advertising", " Rasch models", " Web effects", " Perceptual map"], "paper_abstract": "We analysed the effect of a well designed website in terms of five indicators: purchase intention, positive attitudes, trust, satisfaction and perceived risk. These effects (measured by 21 items) were successfully combined into a single construct using Rasch's Model. The construct was then tested by building a website designed by experts for a fictitious clothes company. It was compared with four less-well-designed websites created by modifying the well designed website by removing one of the four major constructs [web security; customer service; amount and quality of information provided; and usability]. These websites were surfed by 350 consumers (in five subsamples); the experts were then asked to express their perceptions and attitudes of the sites a posteriori. The association between the five websites and the 21 items was displayed visually through a perceptual map built with DYANE software. This showed that a well designed website does not always have the best effect on all 21 items measured. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Consumer feelings and behaviours towards well designed websites", "paper_id": "WOS:000292660500005"}