{"auto_keywords": [{"score": 0.0046069985410261746, "phrase": "central_role"}, {"score": 0.0044922081848067135, "phrase": "innovation_process"}, {"score": 0.0043527164193299574, "phrase": "almost_every_industry"}, {"score": 0.004009894739765119, "phrase": "digital_technologies"}, {"score": 0.0036476222647061243, "phrase": "poor_relationship"}, {"score": 0.0030563953060027175, "phrase": "posture_it_divisions"}, {"score": 0.0027278178983579085, "phrase": "fertile_ground"}, {"score": 0.0026935568995690947, "phrase": "it-driven_innovation"}, {"score": 0.0023587312574818208, "phrase": "consulting_work"}, {"score": 0.002285335999629823, "phrase": "five_key_lessons"}, {"score": 0.0022002633747977593, "phrase": "innovation_leaders"}, {"score": 0.0021453112313233554, "phrase": "collaboration_shortcomings"}, {"score": 0.0021049977753042253, "phrase": "real_it-driven_innovations"}], "paper_keywords": ["Innovation", " Network Analysis", " IT Capabilities", " CIO"], "paper_abstract": "With its increasing power and sophistication, IT plays a central role in accelerating the innovation process. As such, almost every industry today is spending billions of dollars in the race to unleash the potential of digital technologies. Yet, many companies are failing to harness their IT capabilities for innovation because of the poor relationship often existing between their IT division and other business units. To aid in overcoming this problem, we present the innovation and IT posture framework. The framework identifies the four different levels of posture IT divisions typically adopt in enterprises and the various stages of maturity in each posture. Our key message is that fertile ground for IT-driven innovation will only emerge when the IT posture aligns with what the rest of the enterprise expects. Based on our research and consulting work, we also offer five key lessons that will enable CIOs and innovation leaders to overcome these collaboration shortcomings and deliver real IT-driven innovations.", "paper_title": "How IT and the Rest of the Business Can Innovate Together", "paper_id": "WOS:000381274600014"}