{"auto_keywords": [{"score": 0.04774398175413618, "phrase": "knowledge_management_processes"}, {"score": 0.0079820442368989, "phrase": "firm_performance"}, {"score": 0.005186920471723543, "phrase": "market_performance"}, {"score": 0.00481495049065317, "phrase": "purpose_-_the_purpose"}, {"score": 0.004633429997452688, "phrase": "information_technology"}, {"score": 0.00442457549952546, "phrase": "performance_outcomes"}, {"score": 0.004307099985737249, "phrase": "survey_data"}, {"score": 0.0038526069752138196, "phrase": "critical_role"}, {"score": 0.0035399770257915466, "phrase": "financial_performance"}, {"score": 0.0034725269588525534, "phrase": "direct_relation"}, {"score": 0.0031298260299218684, "phrase": "cause-effect_relations"}, {"score": 0.002853620962601042, "phrase": "sufficient_resources"}, {"score": 0.002788454815865172, "phrase": "better_performance"}, {"score": 0.0025619562094446884, "phrase": "knowledge_management_research"}, {"score": 0.002522791642460087, "phrase": "key_antecedent"}, {"score": 0.0021625417261202603, "phrase": "competitive_advantage"}, {"score": 0.0021294699637639564, "phrase": "complementary_strategic_capabilities"}, {"score": 0.0021049977753042253, "phrase": "knowledge_management"}], "paper_keywords": ["Information technology", " Knowledge management processes", " Performance", " Surveys"], "paper_abstract": "Purpose - The purpose of this paper is to analyze the impact of information technology (IT) competency on knowledge management processes and the relations among IT competency, knowledge management processes and performance outcomes. Design/methodology/approach - The study uses survey data from 162 managers and structural equation modeling to assess the links between IT competency, knowledge management processes and firm performance. Findings - First, this study finds that IT competency plays a critical role in knowledge management processes. Second, knowledge management processes are directly related to market performance, which, in turn, is directly related to financial performance. Third, no direct relation exists between IT competency and firm performance. Knowledge management processes mediate the relation between IT competency and market performance. Research limitations/implications - The research is cross-sectional, so cause-effect relations cannot be definitively inferred from the results. Practical implications - The findings indicate that managers should not only focus on allocating sufficient resources for IT investments. To achieve better performance, these technologies need to be used to support the development of the knowledge management processes. Originality/value - This study contributes to knowledge management research, identifying a key antecedent of knowledge management processes IT competency and analyzing the link between knowledge management processes and performance. Moreover, this study is relevant to IT literature because it shows that IT competency, on its own, is insufficient to generate and maintain a competitive advantage. Firms need complementary strategic capabilities such as knowledge management to strengthen the effect of IT competency on firm performance.", "paper_title": "Information technology competency, knowledge processes and firm performance", "paper_id": "WOS:000305369400015"}