{"auto_keywords": [{"score": 0.04727185666950063, "phrase": "missing_attribute_values"}, {"score": 0.027441523458800784, "phrase": "attribute_values"}, {"score": 0.00610089370126391, "phrase": "specified_values"}, {"score": 0.00481495049065317, "phrase": "improved_comparison"}, {"score": 0.004596561972944185, "phrase": "previous_paper"}, {"score": 0.004408456735066782, "phrase": "-concept_values"}, {"score": 0.00418892838079239, "phrase": "six_data_sets"}, {"score": 0.00413096972023037, "phrase": "previous_experimental_results"}, {"score": 0.004054931951058077, "phrase": "large_variances"}, {"score": 0.003943481134959376, "phrase": "different_versions"}, {"score": 0.003817306032290766, "phrase": "new_experiments"}, {"score": 0.0032593915869553714, "phrase": "entire_rows"}, {"score": 0.00321425262806329, "phrase": "data_sets"}, {"score": 0.0027062100658653485, "phrase": "previous_increment"}, {"score": 0.002523828967909659, "phrase": "best_approach"}, {"score": 0.0024429654627197393, "phrase": "lost_values"}, {"score": 0.0024091057723923857, "phrase": "small_difference"}, {"score": 0.002331909406363425, "phrase": "worst_approach"}], "paper_keywords": ["incomplete data sets", " missing attribute values", " approximations for incomplete data", " LERS data mining system", " MLEM2 algorithm"], "paper_abstract": "In a previous paper three types of missing attribute values: lost values, attribute-concept values and \"do not care\" conditions were compared using six data sets. Since previous experimental results were affected by large variances due to conducting experiments on different versions of a given data set, we conducted new experiments, using the same pattern of missing attribute values for all three types of missing attribute values and for both certain and possible rules. Additionally, in our new experiments, the process of incremental replacing specified values by missing attribute values was terminated when entire rows of the data sets were full of missing attribute values. Finally, we created new, incomplete data sets by replacing the specified values starting from 5% of all attribute values, instead of 10% as in the previous experiments, with an increment of 5% instead of the previous increment of 10%. As a result, it is becoming more clear that the best approach to missing attribute values is based on lost values, with small difference between certain and possible rules, and that the worst approach is based on \"do not care\" conditions, certain rules. With our improved experimental setup it is also more clear that for a given data set the type of the missing attribute values should be selected individually.", "paper_title": "An improved comparison of three rough set approaches to missing attribute values", "paper_id": "WOS:000295511200010"}