{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-label_recurrent-item_associative-classification_rule_generation"}, {"score": 0.046800023565389516, "phrase": "association-rule_mining"}, {"score": 0.04202320413133348, "phrase": "association_rules"}, {"score": 0.003916098498242888, "phrase": "relatively_small_amount"}, {"score": 0.0037133478610481994, "phrase": "multi-label_data"}, {"score": 0.0031285355811105945, "phrase": "computational_cost"}, {"score": 0.0027961342030212353, "phrase": "different_frequent_pattern_mining_methods"}, {"score": 0.002651213849567608, "phrase": "new_method"}, {"score": 0.0025587867729949037, "phrase": "state-of-the-art_tree-projection-based_frequent_pattern_mining_algorithm"}, {"score": 0.0021940118003312397, "phrase": "priori-based_associative-classification_rule_generator"}], "paper_keywords": ["association rules", " associative classification", " tree projection", " multi-label rules", " recurrent-item rules"], "paper_abstract": "Associative-classification is a promising classification method based on association-rule mining. Significant amount of work has already been dedicated to the process of building a classifier based on association rules. However, relatively small amount of research has been performed in association-rule mining from multi-label data. In such data each example can belong, and thus should be classified, to more than one class. This paper aims at the most demanding, with respect to computational cost, part in associative-classification, which is efficient generation of association rules. This task can be achieved using different frequent pattern mining methods. In this paper, we propose a new method that is based on the state-of-the-art tree-projection-based frequent pattern mining algorithm. This algorithm is modified to improve its efficiency and extended to accommodate the multi-label recurrent-item associative-classification rule generation. The proposed algorithm is tested and compared with A priori-based associative-classification rule generator on two large datasets. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A tree-projection-based algorithm for multi-label recurrent-item associative-classification rule generation", "paper_id": "WOS:000251639400010"}