{"auto_keywords": [{"score": 0.04916104605092017, "phrase": "semantic_relations"}, {"score": 0.013745698902620547, "phrase": "mobile_user"}, {"score": 0.00481495049065317, "phrase": "app_store"}, {"score": 0.004398872331144531, "phrase": "personalized_recommendation_system"}, {"score": 0.004342430078306461, "phrase": "mobile_application_software"}, {"score": 0.0036710872046569532, "phrase": "specific_member"}, {"score": 0.0035775302942994565, "phrase": "ontology"}, {"score": 0.003289117944111902, "phrase": "reasoning_process"}, {"score": 0.0031032109441552287, "phrase": "common_attributes"}, {"score": 0.002985130390111069, "phrase": "target_member"}, {"score": 0.00244278788608393, "phrase": "ontology-based_semantic_relations"}, {"score": 0.0021049977753042253, "phrase": "real_field"}], "paper_keywords": ["App", " Attributes", " Mobile", " Ontology", " Recommendation", " Semantic relation", " Social members"], "paper_abstract": "In this paper, we propose a personalized recommendation system for mobile application software (app) to mobile user using semantic relations of apps consumed by users. To do that, we define semantic relations between apps consumed by a specific member and his/her social members using Ontology. Based on the relations, we identify the most similar social members from the reasoning process. The reasoning is explored from measuring the common attributes between apps consumed by the target member and his/her social members. The more attributes shared by them, the more similar is their preference for consuming apps. We also develop a prototype of our system using OWL (Ontology Web Language) by defining ontology-based semantic relations among 50 mobile apps. Using the prototype, we showed the feasibility of our algorithm that our recommendation algorithm can be practical in the real field and useful to analyze the preference of mobile user.", "paper_title": "Recommendation algorithm of the app store by using semantic relations between apps", "paper_id": "WOS:000319942000003"}