{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "journal-article_components"}, {"score": 0.0046432244185370605, "phrase": "research_practice"}, {"score": 0.004357245559948974, "phrase": "discrete_journal-article_components"}, {"score": 0.004201774694043468, "phrase": "published_scientific_journal_articles"}, {"score": 0.004015182362035361, "phrase": "sixty_participants"}, {"score": 0.0038194503801108324, "phrase": "journal-article_component_prototype"}, {"score": 0.003600351201298387, "phrase": "search_results"}, {"score": 0.0035515951985356374, "phrase": "multiple_methods"}, {"score": 0.003424771860049617, "phrase": "structured_diaries"}, {"score": 0.0031845067058084583, "phrase": "previous_studies"}, {"score": 0.0031129269142224194, "phrase": "scientific_journal_articles"}, {"score": 0.003015401937358271, "phrase": "scientists'_use"}, {"score": 0.002988101395789399, "phrase": "specific_journal-article_components"}, {"score": 0.0027035833504191233, "phrase": "new_forms"}, {"score": 0.0023694065215394593, "phrase": "prototype's_index"}, {"score": 0.0022743274702883456, "phrase": "particular_tasks"}, {"score": 0.0021242471042435037, "phrase": "established_teaching"}, {"score": 0.0021049977753042253, "phrase": "research_practices"}], "paper_keywords": [""], "paper_abstract": "This article reports the results of a study into the use of discrete journal-article components, particularly tables and figures extracted from published scientific journal articles, and their application to teaching and research. Sixty participants were introduced to and asked to perform searches in a journal-article component prototype that presents individual tables and figures as the items returned in the search results set. Multiple methods, including questionnaires, observations, and structured diaries, were used to collect data. The results are analyzed in the context of previous studies on the use of scientific journal articles and in terms of research on scientists' use of specific journal-article components to find information, assess its relevance, read, interpret, and disaggregate the information found, and reaggregate components into new forms of information. Results indicate that scientists believe searching for journal-article components has value in terms of (a) higher precision result sets, (b) better match between the granularity of the prototype's index and the granularity of the information sought for particular tasks, and (c) fit between journal-article component searching and the established teaching and research practices of scientists.", "paper_title": "Finding and using journal-article components: Impacts of disaggregation on teaching and research practice", "paper_id": "WOS:000254363800009"}