{"auto_keywords": [{"score": 0.04554041399878638, "phrase": "proposed_method"}, {"score": 0.015719716506582538, "phrase": "importance_degrees"}, {"score": 0.0066841582295914, "phrase": "accuracy_rate"}, {"score": 0.006520593411618028, "phrase": "time_rate"}, {"score": 0.005272230863561286, "phrase": "learning_achievement_indices"}, {"score": 0.004598027492787762, "phrase": "new_method"}, {"score": 0.004565529359523792, "phrase": "students'_learning_achievement_evaluation"}, {"score": 0.003989742144066683, "phrase": "students'_learning_achievement"}, {"score": 0.002777463594061196, "phrase": "new_ranking_order"}, {"score": 0.0025686131021181134, "phrase": "chen's_method"}, {"score": 0.0024439412207268355, "phrase": "simple_arithmetic_calculations"}, {"score": 0.0024094425220967273, "phrase": "complicated_fuzzy_reasoning_method"}, {"score": 0.002383891066134129, "phrase": "bai"}, {"score": 0.002367049193665218, "phrase": "chen"}, {"score": 0.002317055705600351, "phrase": "time_complexity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fuzzy sets", " Learning achievement index", " Membership functions", " Students' learning achievement evaluation"], "paper_abstract": "In this paper, we present a new method for students' learning achievement evaluation by automatically generating the importance degrees of the attributes of questions. The proposed method considers the \"accuracy rate\", the \"time rate\", the \"importance\" and the \"complexity\" for evaluating students' learning achievement. First, the proposed method transforms the attributes \"accuracy rate\" and \"time rate\" into the \"effect of accuracy rate\" and the \"effect of time rate\", respectively. Then, it generates the weights of the attributes \"effect of accuracy rate\", \"effect of time rate\", \"importance\" and \"complexity\", respectively. Then, it generates the importance degrees of the attributes of questions based on the weights of the attributes. Then, it calculates the learning achievement indices of the students having the same total score. Finally, it determines the new ranking order of the students having the same original total score based on the learning achievement indices of the students. The proposed method is simpler than Bai and Chen's method (2008c) due to the fact that the proposed method is based on simple arithmetic calculations rather than the complicated fuzzy reasoning method presented in Bai and Chen (2008c). The time complexity of the proposed method is O(mn), where m denotes the number of questions and n denotes the number of students. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Evaluating students' learning achievement by automatically generating the importance degrees of attributes of questions", "paper_id": "WOS:000290237500178"}