{"auto_keywords": [{"score": 0.048661882068602086, "phrase": "uncertain_data_streams"}, {"score": 0.031042443925142046, "phrase": "history_chunks"}, {"score": 0.015719716506582538, "phrase": "one-class_learning"}, {"score": 0.011105231593886468, "phrase": "uncertain_one-class_classifier"}, {"score": 0.010204190181420195, "phrase": "support_vectors"}, {"score": 0.004534136929881113, "phrase": "novel_framework"}, {"score": 0.004020492138367616, "phrase": "uncertain_one-class_learning"}, {"score": 0.003785836059995376, "phrase": "local_kernel-density-based_method"}, {"score": 0.0034940519373446335, "phrase": "corresponding_instance"}, {"score": 0.00327356326590461, "phrase": "generated_bound_score"}, {"score": 0.0032246835734680377, "phrase": "one-class_svm-based_learning_phase"}, {"score": 0.002873331232538783, "phrase": "chunk_data"}, {"score": 0.002678433668156676, "phrase": "k-mean_clustering_method"}, {"score": 0.002315658491366464, "phrase": "uncertain_one-class_data_streams"}, {"score": 0.0021049977753042253, "phrase": "evolving_interests"}], "paper_keywords": ["Data streams", " data of uncertainty"], "paper_abstract": "This paper presents a novel framework to uncertain one-class learning and concept summarization learning on uncertain data streams. Our proposed framework consists of two parts. First, we put forward uncertain one-class learning to cope with data of uncertainty. We first propose a local kernel-density-based method to generate a bound score for each instance, which refines the location of the corresponding instance, and then construct an uncertain one-class classifier (UOCC) by incorporating the generated bound score into a one-class SVM-based learning phase. Second, we propose a support vectors (SVs)-based clustering technique to summarize the concept of the user from the history chunks by representing the chunk data using support vectors of the uncertain one-class classifier developed on each chunk, and then extend k-mean clustering method to cluster history chunks into clusters so that we can summarize concept from the history chunks. Our proposed framework explicitly addresses the problem of one-class learning and concept summarization learning on uncertain one-class data streams. Extensive experiments on uncertain data streams demonstrate that our proposed uncertain one-class learning method performs better than others, and our concept summarization method can summarize the evolving interests of the user from the history chunks.", "paper_title": "Uncertain One-Class Learning and Concept Summarization Learning on Uncertain Data Streams", "paper_id": "WOS:000329051000015"}