{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "single_image_super-resolution"}, {"score": 0.03171525019468471, "phrase": "coarse_reconstructions"}, {"score": 0.004762202897268383, "phrase": "example-learning-based_algorithms"}, {"score": 0.0046073860169839305, "phrase": "sparse_coding"}, {"score": 0.004556901872357751, "phrase": "neighbor_embedding"}, {"score": 0.004172360444377281, "phrase": "training_data"}, {"score": 0.004126623209579942, "phrase": "example_representation"}, {"score": 0.0036958398682001015, "phrase": "major_tasks"}, {"score": 0.003309877074892399, "phrase": "clear_reconstruction"}, {"score": 0.002931569771634119, "phrase": "different_artifacts"}, {"score": 0.002789528662623221, "phrase": "global_structure_information"}, {"score": 0.002713604305939145, "phrase": "image_structure-based_low_rank_regularization_method"}, {"score": 0.002497976173193543, "phrase": "gross_artifacts"}, {"score": 0.0023900527169254744, "phrase": "large_artifacts"}, {"score": 0.0022741894748181243, "phrase": "experimental_results"}, {"score": 0.002224510044064184, "phrase": "proposed_method"}, {"score": 0.0021049977753042253, "phrase": "competitive_results"}], "paper_keywords": ["Super-resolution", " Low rank", " Fusion", " Regularization"], "paper_abstract": "Example-learning-based algorithms such as those based on sparse coding or neighbor embedding have been popular for single image super-resolution in recent years. However, affected by several critical factors on the training data and example representation, their reconstructions are usually plagued by kinds of artifacts. The removing of these artifacts is one of the major tasks for these methods. Unlike most existing methods that employ more complicated training methods, in this paper we would like to recover a clear reconstruction by fusing several \"dirty\" coarse reconstructions which are outputs of one or several simple training methods with small training set. One underlying key observation is that although coarse reconstructions are corrupted by different artifacts, they refer to the same high-resolution image. This global structure information is captured by an image structure-based low rank regularization method. The advantage of our method is that it can remove not only small noises but also gross artifacts. Except sparsity and randomness of the large artifacts, no other knowledge about them is required. Experimental results show that the proposed method can not only dramatically improve coarse reconstructions but also achieve competitive results.", "paper_title": "A structural low rank regularization method for single image super-resolution", "paper_id": "WOS:000362576500010"}