{"auto_keywords": [{"score": 0.04939815249833027, "phrase": "cohort_studies"}, {"score": 0.00481495049065317, "phrase": "joint_trajectories"}, {"score": 0.004439445472040688, "phrase": "classic_way"}, {"score": 0.004112711391952791, "phrase": "homogeneous_patterns"}, {"score": 0.003939565240409143, "phrase": "large_number"}, {"score": 0.0037377733149169573, "phrase": "joint_evolution"}, {"score": 0.0029996699429582835, "phrase": "possible_co-evolution"}, {"score": 0.00290087451159631, "phrase": "r_package"}, {"score": 0.002648768009464535, "phrase": "missing_values"}, {"score": 0.002500927169609655, "phrase": "best_partition"}, {"score": 0.0023954743066925714, "phrase": "joint-variable_trajectories"}, {"score": 0.002350041573006264, "phrase": "restricted_case"}, {"score": 0.0021771064566328702, "phrase": "pdf"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Longitudinal data", " k-means", " Cluster analysis", " Non-parametric algorithm", " Joint trajectories"], "paper_abstract": "In cohort studies, variables are measured repeatedly and can be considered as trajectories. A classic way to work with trajectories is to cluster them in order to detect the existence of homogeneous patterns of evolution. Since cohort studies usually measure a large number of variables, it might be interesting to study the joint evolution of several variables (also called joint-variable trajectories). To date, the only way to cluster joint-trajectories is to cluster each trajectory independently, then to cross the partitions obtained. This approach is unsatisfactory because it does not take into account a possible co-evolution of variable-trajectories. KmL3D is an R package that implements a version of k-means dedicated to clustering joint-trajectories. It provides facilities for the management of missing values, offers several quality criteria and its graphic interface helps the user to select the best partition. KmL3D can work with any number of joint-variable trajectories. In the restricted case of two joint trajectories, it proposes 3D tools to visualize the partitioning and then export 3D dynamic rotating-graphs to PDF format. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "KmL3D: A non-parametric algorithm for clustering joint trajectories", "paper_id": "WOS:000312473300011"}