{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "polygonal-fem_technique"}, {"score": 0.03799635259867219, "phrase": "contact_surface"}, {"score": 0.012893145152017841, "phrase": "new_technique"}, {"score": 0.012697757868810841, "phrase": "arbitrary_interfaces"}, {"score": 0.012441781708170981, "phrase": "non-linear_contact_problems"}, {"score": 0.011704038615139606, "phrase": "uniform_non-conformal_meshes"}, {"score": 0.004741395005218184, "phrase": "large_sliding_contact"}, {"score": 0.004597622380240611, "phrase": "polygonal_shape_functions"}, {"score": 0.004278807087784626, "phrase": "large_deformation_-_large_sliding_contact"}, {"score": 0.0032423089921154503, "phrase": "regular_fe_mesh"}, {"score": 0.003160049822855747, "phrase": "extra_degrees"}, {"score": 0.002971016979295967, "phrase": "contact_constraints"}, {"score": 0.002910545717767559, "phrase": "polygonal_elements"}, {"score": 0.0028076592725295646, "phrase": "node-to-surface_contact_algorithm"}, {"score": 0.0026261108615242557, "phrase": "convergence_rate"}, {"score": 0.002546315584783112, "phrase": "wachspress_interpolation_functions"}, {"score": 0.002250601866422547, "phrase": "numerical_examples"}, {"score": 0.002159852420283463, "phrase": "proposed_technique"}, {"score": 0.0021267708018655493, "phrase": "contact_problems"}, {"score": 0.0021049977753042253, "phrase": "large_deformations"}], "paper_keywords": ["Contact problem", " Non-conformal mesh", " Polygonal-FEM"], "paper_abstract": "Purpose - In this paper, the polygonal-FEM technique is presented in modeling large deformation - large sliding contact on non-conformal meshes. The purpose of this paper is to present a new technique in modeling arbitrary interfaces and discontinuities for non-linear contact problems by capturing discontinuous deformations in elements cut by the contact surface in uniform non-conformal meshes. Design/methodology/approach - The geometry of contact surface is used to produce various polygonal elements at the intersection of the interface with the regular FE mesh, in which the extra degrees-of-freedom are defined along the interface. The contact constraints are imposed between polygonal elements produced along the contact surface through the node-to-surface contact algorithm. Findings - Numerical convergence analysis is carried out to study the convergence rate for various polygonal interpolation functions, including the Wachspress interpolation functions, the metric shape functions, the natural neighbor-based shape functions, and the mean value shape functions. Finally, numerical examples are solved to demonstrate the efficiency of proposed technique in modeling contact problems in large deformations. Originality/value - A new technique is presented based on the polygonal-FEM technique in modeling arbitrary interfaces and discontinuities for non-linear contact problems by capturing discontinuous deformations in elements cut by the contact surface in uniform non-conformal meshes.", "paper_title": "A polygonal-FEM technique in modeling large sliding contact on non-conformal meshes A study on polygonal shape functions", "paper_id": "WOS:000359048000010"}