{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "neurois_research_methodology"}, {"score": 0.012229446740999758, "phrase": "neurois_field"}, {"score": 0.004603657443058869, "phrase": "neuro-information_systems"}, {"score": 0.004436600597150948, "phrase": "considerable_number"}, {"score": 0.004366865376588095, "phrase": "related_disciplines"}, {"score": 0.004164140506290362, "phrase": "human_cognition"}, {"score": 0.00403422512824534, "phrase": "neuro-adaptive_information_systems"}, {"score": 0.003949865567771052, "phrase": "physiological_state"}, {"score": 0.003687645670891423, "phrase": "nascent_stage"}, {"score": 0.0034155829721994545, "phrase": "increased_importance"}, {"score": 0.0033975748841512036, "phrase": "methodological_discussions"}, {"score": 0.0033002085989689875, "phrase": "information_systems"}, {"score": 0.003274140225959625, "phrase": "special_issue_call"}, {"score": 0.0031719031740165644, "phrase": "neurois_research"}, {"score": 0.003024484031345221, "phrase": "stringent_review_process"}, {"score": 0.0029768783231803072, "phrase": "special_issue"}, {"score": 0.002793810991378096, "phrase": "current_paper"}, {"score": 0.0027425627058001133, "phrase": "review_process"}, {"score": 0.0026358800880512357, "phrase": "scientific_discourse"}, {"score": 0.002533336762815037, "phrase": "six_factors"}, {"score": 0.002473730894309209, "phrase": "future_discussions"}, {"score": 0.0024347729296556844, "phrase": "rigorous_neurois_research_methodology"}, {"score": 0.0023215332766056526, "phrase": "measurement_instrument"}, {"score": 0.0021217773701268706, "phrase": "future_contributions"}, {"score": 0.0021049977753042253, "phrase": "growing_understanding"}], "paper_keywords": ["Brain", " Diagnosticity", " Intrusiveness", " Methodology", " Methods", " NeuroIS", " Neuroscience", " Nervous System", " Objectivity", " Psychophysiology", " Reliability", " Sensitivity", " Validity"], "paper_abstract": "The genesis of the Neuro-Information Systems (NeuroIS) field took place in 2007. Since then, a considerable number of IS scholars and academics from related disciplines have started to use theories, methods, and tools from neuroscience and psychophysiology to better understand human cognition, emotion, and behavior in IS contexts, and to develop neuro-adaptive information systems (i.e., systems that recognize the physiological state of the user and that adapt, based on that information, in real-time). However, because the NeuroIS field is still in a nascent stage, IS scholars need to become familiar with the methods, tools, and measurements that are used in neuroscience and psychophysiology. Against the background of the increased importance of methodological discussions in the NeuroIS field, the Journal of the Association for Information Systems published a special issue call for papers entitled \"Methods, tools, and measurement in NeuroIS research\" in 2012. We, the special issue's guest editors, accepted three papers after a stringent review process, which appear in this special issue. In addition to these three papers, we hope to intensify the discussion on NeuroIS research methodology, and to this end we present the current paper. Importantly, our observations during the review process (particularly with respect to methodology) and our own reading of the literature and the scientific discourse during conferences served as input for this paper. Specifically, we argue that six factors, among others that will become evident in future discussions, are critical for a rigorous NeuroIS research methodology; namely, reliability, validity, sensitivity, diagnosticity, objectivity, and intrusiveness of a measurement instrument. NeuroIS researchers-independent from whether their role is editor, reviewer, or author-should carefully give thought to these factors. We hope that the discussion in this paper instigates future contributions to a growing understanding towards a NeuroIS research methodology.", "paper_title": "Towards a NeuroIS Research Methodology: Intensifying the Discussion on Methods, Tools, and Measurement", "paper_id": "WOS:000345064000001"}