{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "secure_personal_networking"}, {"score": 0.004569293780076254, "phrase": "major_concepts"}, {"score": 0.004490212943845175, "phrase": "next-generation_personal_network"}, {"score": 0.003726967166630926, "phrase": "users'professional_and_private_activities"}, {"score": 0.0032978134802348433, "phrase": "existing_networks"}, {"score": 0.0031660031870090434, "phrase": "ad_hoc"}, {"score": 0.003129317057177867, "phrase": "self-organized_manner_pns"}, {"score": 0.002566685388128598, "phrase": "specific_aspects"}, {"score": 0.0024496978447849835, "phrase": "peer-to-peer_networking"}, {"score": 0.0023932142697579506, "phrase": "infrastructure-based_networks"}, {"score": 0.0021049977753042253, "phrase": "lucent_technologies_inc."}], "paper_keywords": [""], "paper_abstract": "The paper presents the major concepts for a next-generation personal network as defined, developed, and tested by the project My Personal Adaptive Global NET (MAGNET), including the growing personal area network (PAN) style networking. The MAGNET vision is that personal networks (PNs) will support users'professional and private activities without being obtrusive and while safeguarding their privacy and security. A PN can operate on top of any number of existing networks or may be composed in an ad hoc, self-organized manner PNs are dynamic and diverse in composition, configuration, and connectivity depending on time, place, preference, and context as well as resources available and required, and they function in cooperation with all necessary/required and preferred partners. This paper focuses on specific aspects related to PNs such as advances in peer-to-peer networking and interworking with infrastructure-based networks (e.g., dynamic personal virtual private networks) and security requirements and solutions for secure personal networking. (c) 2006 Lucent Technologies Inc.", "paper_title": "MAGNET: An approach for secure personal networking in beyond 3G wireless networks", "paper_id": "WOS:000237876500006"}