{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "graphical_models"}, {"score": 0.04979721041705589, "phrase": "selectivity_estimation"}, {"score": 0.043726272486193665, "phrase": "statistical_model"}, {"score": 0.03344674855066638, "phrase": "independence_assumption"}, {"score": 0.0047026237903774895, "phrase": "statistical_models"}, {"score": 0.004633747992595526, "phrase": "underlying_data"}, {"score": 0.004539005582217309, "phrase": "cardinality_estimates"}, {"score": 0.0045122922461952805, "phrase": "intermediate_relations"}, {"score": 0.004368142221528535, "phrase": "best_query_execution_plan"}, {"score": 0.0042914569949699015, "phrase": "resulting_plan"}, {"score": 0.004045391554481355, "phrase": "small_errors"}, {"score": 0.003835972725191194, "phrase": "highly_sub-optimal_query_execution_plan"}, {"score": 0.0037463983616303786, "phrase": "attribute_value_independence_assumption"}, {"score": 0.0035106702438029913, "phrase": "one-dimensional_synopses"}, {"score": 0.003299460925313939, "phrase": "predicate_conjunction"}, {"score": 0.0032128654564385494, "phrase": "constituent_predicates"}, {"score": 0.0029489527539649737, "phrase": "modern_query_optimizers"}, {"score": 0.0028800314406625996, "phrase": "principled_and_practical_approach"}, {"score": 0.0028546020769742177, "phrase": "cardinality_estimation"}, {"score": 0.0026748362506324543, "phrase": "joint_probability_distribution"}, {"score": 0.002566364701535499, "phrase": "estimation_accuracy"}, {"score": 0.0023764249306830196, "phrase": "highly_efficient_manner"}, {"score": 0.0023277282036119106, "phrase": "postgresql_dbms._experimental_results"}, {"score": 0.002307164141953476, "phrase": "estimation_errors"}, {"score": 0.0022005118194652704, "phrase": "optimization_time"}, {"score": 0.0021049977753042253, "phrase": "industrial-strength_query_optimizers"}], "paper_keywords": ["Graphical models", " Selectivity estimation", " Query optimization"], "paper_abstract": "Query optimizers rely on statistical models that succinctly describe the underlying data. Models are used to derive cardinality estimates for intermediate relations, which in turn guide the optimizer to choose the best query execution plan. The quality of the resulting plan is highly dependent on the accuracy of the statistical model that represents the data. It is well known that small errors in the model estimates propagate exponentially through joins, and may result in the choice of a highly sub-optimal query execution plan. Most commercial query optimizers make the attribute value independence assumption: all attributes are assumed to be statistically independent. This reduces the statistical model of the data to a collection of one-dimensional synopses (typically in the form of histograms), and it permits the optimizer to estimate the selectivity of a predicate conjunction as the product of the selectivities of the constituent predicates. However, this independence assumption is more often than not wrong, and is considered to be the most common cause of sub-optimal query execution plans chosen by modern query optimizers. We take a step towards a principled and practical approach to performing cardinality estimation without making the independence assumption. By carefully using concepts from the field of graphical models, we are able to factor the joint probability distribution over all the attributes in the database into small, usually two-dimensional distributions, without a significant loss in estimation accuracy. We show how to efficiently construct such a graphical model from the database using only two-way join queries, and we show how to perform selectivity estimation in a highly efficient manner. We integrate our algorithms into the PostgreSQL DBMS. Experimental results indicate that estimation errors can be greatly reduced, leading to orders of magnitude more efficient query execution plans in many cases. Optimization time is kept in the range of tens of milliseconds, making this a practical approach for industrial-strength query optimizers.", "paper_title": "Efficiently adapting graphical models for selectivity estimation", "paper_id": "WOS:000313816100002"}