{"auto_keywords": [{"score": 0.03462035314734896, "phrase": "nuisance_parameters"}, {"score": 0.0247264818613767, "phrase": "large_sample_sizes"}, {"score": 0.00474827840031692, "phrase": "unequal_over-dispersion_parameters"}, {"score": 0.004698878021540436, "phrase": "behrens-fisher"}, {"score": 0.004101366149219787, "phrase": "traditional_behrens-fisher_problem"}, {"score": 0.0036046342610557497, "phrase": "corresponding_problem"}, {"score": 0.0035795609511543023, "phrase": "over-dispersed_count_data"}, {"score": 0.0035299344877334385, "phrase": "six_test_procedures"}, {"score": 0.0034328178151268184, "phrase": "lr"}, {"score": 0.003314965171168532, "phrase": "corrected_maximum_likelihood_estimates"}, {"score": 0.002862767868795934, "phrase": "population_variances"}, {"score": 0.0027645030021576926, "phrase": "freedom_correction"}, {"score": 0.0026696020591118344, "phrase": "asymptotic_normal_distribution"}, {"score": 0.0024807547991927137, "phrase": "best_overall_performance"}, {"score": 0.002249527353528286, "phrase": "six_statistics"}, {"score": 0.0021049977753042253, "phrase": "statistic_t-n"}], "paper_keywords": ["bias-corrected maximum likelihood estimator", " dispersion parameter", " negative binomial model"], "paper_abstract": "Two samples count data with unequal over-dispersions arise in many applied statistics problems (biostatistics, epidemiology, etc.). In this situation, it is of interest to test the equality of the means. The traditional Behrens-Fisher problem is to test the equality of the means mu(1) and mu(2) of two normal populations where the variances sigma(2)(1) and sigma(2)(2) are unknown. The purpose of this paper is to deal with the corresponding problem for over-dispersed count data. We develop six test procedures, namely, a likelihood ratio test LR, a likelihood ratio test based on the bias corrected maximum likelihood estimates of the nuisance parameters LR(bc), a score test T-2, a score test based on the bias corrected estimates of the nuisance parameters T-2 (bc), a C(alpha) test based on the method of moments estimates of the nuisance parameters T-1 with Welch's [The significance of the difference between two means when the population variances are unequal. Biometrika. 1937;29:350-362] degree of freedom correction, and a test T-N using the asymptotic normal distribution of T-1. These procedures are then compared in terms of size and power using simulations. Simulations show the best overall performance of the statistic T-1 in terms of size and power and it is easy to calculate. For large sample sizes, for example, for n(1)=n(2)=50, all six statistics do well in terms of level and their power performances are also similar. So, for large sample sizes, the statistic T-N should be used as it is very easy to use in practice.", "paper_title": "Testing equality of two negative binomial means in presence of unequal over-dispersion parameters: a Behrens-Fisher problem analog", "paper_id": "WOS:000357936100011"}