{"auto_keywords": [{"score": 0.04430576069817978, "phrase": "accuracy_dimension"}, {"score": 0.015719716506582538, "phrase": "multiple-source_environment"}, {"score": 0.010574582987844545, "phrase": "large_scale_data_sources"}, {"score": 0.004540734419151103, "phrase": "key_issue"}, {"score": 0.004492573860101133, "phrase": "data_management"}, {"score": 0.00439777299939725, "phrase": "current_studies"}, {"score": 0.004081385289516914, "phrase": "experts'_knowledge"}, {"score": 0.003767517649628532, "phrase": "jensen-shannon_divergence"}, {"score": 0.0029789104204803137, "phrase": "multiple_levels"}, {"score": 0.0026914710445743693, "phrase": "objective_accuracy_score"}, {"score": 0.00260657976055413, "phrase": "context_member"}, {"score": 0.0025243592424524764, "phrase": "human's_laborious_interaction"}, {"score": 0.002470987929071079, "phrase": "automatic_accuracy_assessment_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data quality", " Accuracy", " Jensen-Shannon divergence (JSD)", " Locality-sensitive hashing (LSH)", " Context", " Automatic assessment"], "paper_abstract": "Accuracy is a most important data quality dimension and its assessment is a key issue in data management. Most of current studies focus on how to qualitatively analyze accuracy dimension and the analysis depends heavily on experts' knowledge. Seldom work is given on how to automatically quantify accuracy dimension. Based on Jensen-Shannon divergence (JSD) measure, we propose accuracy of data can be automatically quantified by comparing data with its entity's most approximation in available context. To quickly identify most approximation in large scale data sources, locality-sensitive hashing (LSH) is employed to extract most approximation at multiple levels, namely column, record and field level. Our approach can not only give each data source an objective accuracy score very quickly as long as context member is available but also avoid human's laborious interaction. As an automatic accuracy assessment solution in multiple-source environment, our approach is distinguished, especially for large scale data sources. Theory and experiment show our approach performs well in achieving metadata on accuracy dimension. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic accuracy assessment via hashing in multiple-source environment", "paper_id": "WOS:000272846500089"}