{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "lower_secondary_schools"}, {"score": 0.004642616869339574, "phrase": "slovenia"}, {"score": 0.004263972370406983, "phrase": "traditional_one"}, {"score": 0.003531474887552889, "phrase": "teaching_process"}, {"score": 0.0034570879043633114, "phrase": "proposed_system"}, {"score": 0.003292872031718798, "phrase": "individual's_level"}, {"score": 0.003223494720348768, "phrase": "subject_matter"}, {"score": 0.0031459887611258765, "phrase": "real_learning_environment"}, {"score": 0.0031269043024513567, "phrase": "evaluation_sample"}, {"score": 0.003051713660488494, "phrase": "five_schools"}, {"score": 0.0029874020705125356, "phrase": "qualitative_and_quantitative_data"}, {"score": 0.0028715299874549245, "phrase": "assembled_data"}, {"score": 0.0028110048684383167, "phrase": "descriptive_analysis"}, {"score": 0.002726740692380339, "phrase": "national_assessments"}, {"score": 0.002669259222649505, "phrase": "entire_student_population"}, {"score": 0.002406799309495983, "phrase": "traditional_teaching"}, {"score": 0.002320449502337321, "phrase": "collected_metadata"}, {"score": 0.0021438155673297377, "phrase": "traditional_classroom_education"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Adaptive system", " Intelligent e-learning", " Intelligent tutoring system", " Lower secondary school"], "paper_abstract": "E-materials and various e-learning systems have become regular features in lower secondary schools in Slovenia and around the world. Many different systems and materials have been created for students, but only a few offer the same amount of individualisation that is present in traditional one to one teaching (one teacher to one student). The purpose of this research is to demonstrate the design and evaluation of an adaptive, intelligent and, most important, an individualised intelligent tutoring system (ITS) based on the cognitive characteristics of the individual learner. The TECH8 model presented is designed modularly, based on a system for collecting a range of metadata and variables that are vital for the teaching process. Prepared in such a way, the proposed system supports individualization and differentiation; because of this, it can be adapted to each individual's level of knowledge and understanding of the subject matter. This TECH8 system was evaluated in a real learning environment The evaluation sample of the study consists of 117 students from five schools (suburban and urban). Qualitative and quantitative data was gathered with a system for collecting metadata and variables. The assembled data was analysed and statistically processed using descriptive analysis. This data was also compared to data from national assessments of knowledge, which encompassed the entire student population (approx. 5000) in the years 2008, 2010 and 2013. The study and the comparisons indicated that appropriately created TECH8 e-learning material, yields results that are better than those from traditional teaching but not better than one to one teaching. With the help of the collected metadata, optimisation, evaluation and an upgrade of the TECH8 itself will be carried out. In addition, such individualized e-learning systems can reinforce knowledge gained through traditional classroom education. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "TECH8 intelligent and adaptive e-learning system: Integration into Technology and Science classrooms in lower secondary schools", "paper_id": "WOS:000349723200029"}