{"auto_keywords": [{"score": 0.04890933270671448, "phrase": "mechanical_resistance"}, {"score": 0.010612387000973441, "phrase": "multi-directional_forced_unfolding"}, {"score": 0.008888976827524814, "phrase": "force_direction"}, {"score": 0.004582528208024817, "phrase": "external_force"}, {"score": 0.00442651096522781, "phrase": "amino_acid_sequence"}, {"score": 0.00395017798595193, "phrase": "molecular_dynamics"}, {"score": 0.003853583126988071, "phrase": "partial_unfolding"}, {"score": 0.003455765987713262, "phrase": "amino_acid"}, {"score": 0.0033050703534275717, "phrase": "amino_acids"}, {"score": 0.003114283314285167, "phrase": "unfolding_intermediate"}, {"score": 0.002862648127577722, "phrase": "maximum_leverage"}, {"score": 0.00263129148531588, "phrase": "least_leverage"}, {"score": 0.0023476849595393872, "phrase": "beta-strand_topology"}, {"score": 0.0021793698531006197, "phrase": "strand_topology"}, {"score": 0.0021049977753042253, "phrase": "applied_force"}], "paper_keywords": ["titin I27", " molecular dynamics", " protein unfolding", " dynamic force spectroscopy", " atomic force microscope"], "paper_abstract": "Mechanical resistance of a protein under external force is known to depend on the amino acid sequence, unfolding rate constant, topology and the direction of force applied. To assess the affect of force direction on mechanical resistance, molecular dynamics (MID) simulations of the partial unfolding of titin 127 have been carried out by applying a ramp of force between the N-terminus and the alpha-carbon of each amino acid, respectively. The results arbitrarily place the amino acids in a hierarchy in terms of the time at which an unfolding intermediate is formed. The onset of unfolding is indeed affected by force direction; directions that give maximum leverage (for the A strand to detach) unfold to the intermediate quicker than directions that give least leverage. Moreover, the change in the time taken to reach the intermediate, hence the change in mechanical resistance, can be attributed to beta-strand topology. The simulations indicate that experimentally multi-directional forced unfolding could be used to reveal and study strand topology, and suggests that direction of applied force, topology and mechanical resistance are all closely related. (c) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Simulations of multi-directional forced unfolding of titin I27", "paper_id": "WOS:000236452600009"}