{"auto_keywords": [{"score": 0.04966663655587133, "phrase": "prosodic_accommodation"}, {"score": 0.048852464629815344, "phrase": "social_interaction"}, {"score": 0.014616484926513813, "phrase": "human_communication"}, {"score": 0.014368193834520522, "phrase": "interactive_systems"}, {"score": 0.011396776569154101, "phrase": "automatic_system"}, {"score": 0.00481495049065317, "phrase": "automatic_measurements"}, {"score": 0.004651177631663439, "phrase": "spoken_dialogue_systems"}, {"score": 0.0043213410601860985, "phrase": "linguistic_aspects"}, {"score": 0.004102639724186862, "phrase": "complex_dynamics"}, {"score": 0.003571850980647625, "phrase": "machines_more_socially-competent_interactants"}, {"score": 0.003332704619499476, "phrase": "clear_measures"}, {"score": 0.0031365819432206004, "phrase": "monotonically_manifest_property"}, {"score": 0.003003579442221871, "phrase": "functional_social_aspects"}, {"score": 0.0022562464662197867, "phrase": "conversation_flow"}, {"score": 0.002227083991228041, "phrase": "speakers'_degree"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Prosodic accommodation", " Dynamics", " Interactional conversation", " Information exchange", " Speakers' involvement and affinity"], "paper_abstract": "Spoken dialogue systems are increasingly being used to facilitate and enhance human communication. While these interactive systems can process the linguistic aspects of human communication, they are not yet capable of processing the complex dynamics involved in social interaction, such as the adaptation on the part of interlocutors. Providing interactive systems with the capacity to process and exhibit this accommodation could however improve their efficiency and make machines more socially-competent interactants. At present, no automatic system is available to process prosodic accommodation, nor do any clear measures exist that quantify its dynamic manifestation. While it can be observed to be a monotonically manifest property, it is our hypotheses that it evolves dynamically with functional social aspects. In this paper, we propose an automatic system for its measurement and the capture of its dynamic manifestation. We investigate the evolution of prosodic accommodation in 41 Japanese dyadic telephone conversations and discuss its manifestation in relation to its functions in social interaction. Overall, our study shows that prosodic accommodation changes dynamically over the course of a conversation and across conversations, and that these dynamics inform about the naturalness of the conversation flow, the speakers' degree of involvement and their affinity in the conversation. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Investigating automatic measurements of prosodic accommodation and its dynamics in social interaction", "paper_id": "WOS:000329956000002"}