{"auto_keywords": [{"score": 0.049084030038618824, "phrase": "egocentric_direction"}, {"score": 0.008171667899645314, "phrase": "empty_ground_display"}, {"score": 0.005506223483093389, "phrase": "optic_flow"}, {"score": 0.004141877689172017, "phrase": "ground_plane"}, {"score": 0.003999292102785413, "phrase": "participant's_simulated_heading"}, {"score": 0.0037812559272269613, "phrase": "textured_ground_display"}, {"score": 0.003741712498615481, "phrase": "dense_global_optic_flow"}, {"score": 0.003663857375787215, "phrase": "nearly_no_flow"}, {"score": 0.003151184191185831, "phrase": "target_drift"}, {"score": 0.003042599375218838, "phrase": "similar_heading_error_profiles"}, {"score": 0.002767696345005216, "phrase": "target_movement"}, {"score": 0.0026443135597866924, "phrase": "final_heading_errors"}, {"score": 0.0024651215047303593, "phrase": "control_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Egocentric direction", " Locomotion control", " Optic flow", " Heading", " Virtual environment"], "paper_abstract": "We have shown that people steer toward a target by aligning their heading with the target when target egocentric direction is not available for steering [24]. Here we examined what visual strategies people use to steer toward a target when target egocentric direction is available for steering. The display simulated a participant walking over a ground plane with a target placed off to one side. The participant's simulated heading in the display was displaced 10 degrees away from the participant's straight ahead. A textured ground display that provided dense global optic flow and an empty ground display that provided nearly no flow were tested. Participants were instructed to use a joystick to control their simulated self-motion in the display to (a) steer toward the target, (b) center the target at their straight ahead, or (c) minimize the target drift on the screen. We found that participants produced similar heading error profiles when they were instructed to steer toward the target or to center the target straight ahead, but not when they were instructed to minimize the target movement on the screen. Furthermore, regardless of the instructions received, final heading errors were about 5 smaller with the textured than with the empty ground display, indicating the effect of optic flow on the control performance. We conclude that when target egocentric direction is available for steering, people do not steer toward the target by canceling its optical drift. Optic flow contributes to steering toward a target even when control could be based on egocentric direction alone. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Visual strategies for the control of steering toward a goal", "paper_id": "WOS:000320349900005"}