{"auto_keywords": [{"score": 0.04096982442153626, "phrase": "sink_movements"}, {"score": 0.011663816401775376, "phrase": "network_lifetime"}, {"score": 0.00481495049065317, "phrase": "wireless_sensor_networks_lifetime"}, {"score": 0.004658426838467567, "phrase": "controlled_mobility"}, {"score": 0.004624337472244542, "phrase": "wireless_sensor_networks"}, {"score": 0.004187718090913465, "phrase": "large_number"}, {"score": 0.004157058883925715, "phrase": "statically_placed_sensor_nodes"}, {"score": 0.004081385289516914, "phrase": "collection_point"}, {"score": 0.0038483286199081, "phrase": "remarkable_lifetime_improvements"}, {"score": 0.003459191419478298, "phrase": "first_heuristics"}, {"score": 0.003433847524648519, "phrase": "controlled_sink_movements"}, {"score": 0.0031553611552558986, "phrase": "new_site"}, {"score": 0.003030247482854539, "phrase": "highest_residual_energy"}, {"score": 0.0029641011108505785, "phrase": "simple_distributed_mobility_scheme"}, {"score": 0.0027437235598539904, "phrase": "different_mobility_schemes"}, {"score": 0.0026641365405034355, "phrase": "different_nodes"}, {"score": 0.002521064923851732, "phrase": "considered_scenarios"}, {"score": 0.0022909940601580675, "phrase": "remarkable_improvements"}, {"score": 0.0021049977753042253, "phrase": "uncontrolled_mobility"}], "paper_keywords": ["Wireless sensor networks", " Controlled mobility", " Mobile sensor networks"], "paper_abstract": "This paper demonstrates the advantages of using controlled mobility in wireless sensor networks (WSNs) for increasing their lifetime, i.e., the period of time the network is able to provide its intended functionalities. More specifically, for WSNs that comprise a large number of statically placed sensor nodes transmitting data to a collection point (the sink), we show that by controlling the sink movements we can obtain remarkable lifetime improvements. In order to determine sink movements, we first define a Mixed Integer Linear Programming (MILP) analytical model whose solution determines those sink routes that maximize network lifetime. Our contribution expands further by defining the first heuristics for controlled sink movements that are fully distributed and localized. Our Greedy Maximum Residual Energy (GMRE) heuristic moves the sink from its current location to a new site as if drawn toward the area where nodes have the highest residual energy. We also introduce a simple distributed mobility scheme (Random Movement or RM) according to which the sink moves uncontrolled and randomly throughout the network. The different mobility schemes are compared through extensive ns2-based simulations in networks with different nodes deployment, data routing protocols, and constraints on the sink movements. In all considered scenarios, we observe that moving the sink always increases network lifetime. In particular, our experiments show that controlling the mobility of the sink leads to remarkable improvements, which are as high as sixfold compared to having the sink statically (and optimally) placed, and as high as twofold compared to uncontrolled mobility.", "paper_title": "Controlled sink mobility for prolonging wireless sensor networks lifetime", "paper_id": "WOS:000260250700008"}