{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "channel_reuse_efficiency"}, {"score": 0.013761597285463941, "phrase": "channel_assignment_schemes"}, {"score": 0.012591891290264456, "phrase": "mobile_host"}, {"score": 0.011463637694141023, "phrase": "channel_reuse_pattern"}, {"score": 0.009736673864916705, "phrase": "control_packets"}, {"score": 0.004767261858417823, "phrase": "multi-channel_ad_hoc_wireless_networks"}, {"score": 0.004490842671590769, "phrase": "wireless_cellular_networks"}, {"score": 0.004294052530714228, "phrase": "ad_hoc_wireless_networks"}, {"score": 0.003984968827278219, "phrase": "channel_reuse"}, {"score": 0.0030906666356950887, "phrase": "novel_channel_assignment_scheme"}, {"score": 0.0029403531729828574, "phrase": "one-hop_neighbors"}, {"score": 0.0028253682745674608, "phrase": "channel_condition"}, {"score": 0.0027557911038816256, "phrase": "two-hop_hosts"}, {"score": 0.002634830238219976, "phrase": "better_reuse_pattern"}, {"score": 0.0024693979425773993, "phrase": "backoff_counter_adjustment_scheme"}, {"score": 0.002136747803494932, "phrase": "simulation_results"}], "paper_keywords": ["channel reuse", " channel management", " communication protocol", " medium access control (MAC)", " ad hoc wireless networks", " wireless networks"], "paper_abstract": "How to increase channel reuse efficiency is one of the most important issues in wireless cellular networks. Recently, many multi-channel MAC protocols have been proposed for ad hoc wireless networks. However the channel assignment schemes used in these protocols do not consider the issue of channel reuse. The channel assignment schemes only let a mobile host select a channel from the channels which are not currently being used by its one-hop neighbors. To form a channel reuse pattern, the mobile host should consider its two-hop channel usage and select a channel which is been used by its two-hop neighbors. In this paper, we propose a novel channel assignment scheme for improving the channel reuse efficiency. By overhearing control packets of one-hop neighbors, a host can easily know the channel condition within the range of two-hop hosts and then select a suitable transmitting/receiving data channel to form the better reuse pattern. To enhance the probability of forming channel reuse pattern, we propose a backoff counter adjustment scheme such that a host with more channel information can transmit control packets early than with less channel information. We verify the performance of our protocol via simulations and give some comments on the simulation results. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A novel channel assignment scheme for improving channel reuse efficiency in multi-channel ad hoc wireless networks", "paper_id": "WOS:000251483000018"}