{"auto_keywords": [{"score": 0.03767407563899196, "phrase": "different_networks"}, {"score": 0.00481495049065317, "phrase": "internet-scale_content-based_search"}, {"score": 0.004250302819248558, "phrase": "internet-_scale_systems"}, {"score": 0.003900853871728297, "phrase": "distributed_nature"}, {"score": 0.003389704997952315, "phrase": "efficient_retrieval"}, {"score": 0.0030625949549620475, "phrase": "topologically_aware_overlay_construction_techniques"}, {"score": 0.002766963729586353, "phrase": "heterogeneous_information"}, {"score": 0.0022939396079753463, "phrase": "pfusion_middleware_architecture"}, {"score": 0.0022583704173318123, "phrase": "data_sets"}, {"score": 0.002223351523626989, "phrase": "akamai's_internet_mapping_infrastructure"}, {"score": 0.0021049977753042253, "phrase": "nlanr"}], "paper_keywords": ["information retrieval", " peer-to-peer", " overlay construction algorithms"], "paper_abstract": "The emerging Peer-to-Peer (P2P) model has become a very powerful and attractive paradigm for developing Internet- scale systems for sharing resources, including files and documents. The distributed nature of these systems, where nodes are typically located across different networks and domains, inherently hinders the efficient retrieval of information. In this paper, we consider the effects of topologically aware overlay construction techniques on efficient P2P keyword search algorithms. We present the Peer Fusion ( pFusion) architecture that aims to efficiently integrate heterogeneous information that is geographically scattered on peers of different networks. Our approach builds on work in unstructured P2P systems and uses only local knowledge. Our empirical results, using the pFusion middleware architecture and data sets from Akamai's Internet mapping infrastructure ( AKAMAI), the Active Measurement Project ( NLANR), and the Text REtrieval Conference (TREC) show that the architecture we propose is both efficient and practical.", "paper_title": "pFusion: A P2P architecture for Internet-scale content-based search and retrieval", "paper_id": "WOS:000245901100007"}