{"auto_keywords": [{"score": 0.039959787485121356, "phrase": "dc_coefficients"}, {"score": 0.00481495049065317, "phrase": "bit_stream"}, {"score": 0.004398457709182882, "phrase": "unchanged_bitstream_size"}, {"score": 0.004345706062641742, "phrase": "real_time"}, {"score": 0.004091248980678087, "phrase": "dc-based_embedding_strategy"}, {"score": 0.003626000977962191, "phrase": "ac-based_one"}, {"score": 0.00306189690236109, "phrase": "watermark_embedding"}, {"score": 0.0028477727736832283, "phrase": "video_quality"}, {"score": 0.002796616969627065, "phrase": "error_propagation"}, {"score": 0.0027133856739937133, "phrase": "compensation_algorithm"}, {"score": 0.0025388705701873075, "phrase": "watermarked_video"}, {"score": 0.0024336917123957387, "phrase": "simple_control_scheme"}, {"score": 0.0022633993976138387, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "real-time_processing"}], "paper_keywords": [""], "paper_abstract": "Some requirements for MPEG-2 video watermarking, such as invisibility, robustness, unchanged bitstream size and real time processing, are desirable. We firstly apply a DC-based embedding strategy to MPEG-2 compressed domain and embed the watermark by modifying the DC coefficients. The strategy has three advantages over the AC-based one. Then a MPEG-2 bitstrearn video watermarking scheme is proposed. The watermark is embedded in DC coefficients in I frames. Because these DC coefficients are differentially coded, error caused by watermark embedding will be propagated. In order to decrease the distortion to video quality caused by error propagation, we develop a compensation algorithm worked in bit-stream, which improves the quality of the watermarked video effectively. We also give a simple control scheme to ensure that the MPEG-2 bitstrearn keeps its original size after watermarking. The experimental results show that the watermark is robust while guaranteeing the invisibility and real-time processing.", "paper_title": "A MPEG-2 video watermarking algorithm with compensation in bit stream", "paper_id": "WOS:000239421000010"}