{"auto_keywords": [{"score": 0.03502138116720421, "phrase": "search_engines"}, {"score": 0.030497563229029488, "phrase": "presentation_order"}, {"score": 0.00481495049065317, "phrase": "search_engine_results"}, {"score": 0.00453772385360173, "phrase": "search_results"}, {"score": 0.004413846562278824, "phrase": "sixty-seven_students"}, {"score": 0.003935689822023147, "phrase": "google"}, {"score": 0.003904495523681369, "phrase": "msn_search"}, {"score": 0.003858462922256373, "phrase": "yahoo"}, {"score": 0.0037234376132464493, "phrase": "accompanying_snippets"}, {"score": 0.003664963414801933, "phrase": "random_order"}, {"score": 0.003536720212056521, "phrase": "specific_url"}, {"score": 0.003066945490483524, "phrase": "users'_choices"}, {"score": 0.002788865808981643, "phrase": "thinking_styles"}, {"score": 0.0025866699249916508, "phrase": "\"average_user"}, {"score": 0.0022967713922705, "phrase": "first_large-scale_experiment"}, {"score": 0.0021987994275190314, "phrase": "identical_queries"}, {"score": 0.0021471293746360026, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "personalized_search"}], "paper_keywords": [""], "paper_abstract": "In this study, we investigate the similarities and differences between rankings of search results by users and search engines. Sixty-seven students took part in a 3-week-long experiment, during which they were asked to identify and rank the top 10 documents from the set of URLs that were retrieved by three major search engines (Google, MSN Search, and Yahoo!) for 12 selected queries. The URLs and accompanying snippets were displayed in random order, without disclosing which search engine(s) retrieved any specific URL for the query. We computed the similarity of the rankings of the users and search engines using four nonparametric correlation measures in [0,1] that complement each other. The findings show that the similarities between the users' choices and the rankings of the search engines are low. We examined the effects of the presentation order of the results, and of the thinking styles of the participants. Presentation order influences the rankings, but overall the results indicate that there is no \"average user,\" and even if the users have the same basic knowledge of a topic, they evaluate information in their own context, which is influenced by cognitive, affective, and physical factors. This is the first large-scale experiment in which users were asked to rank the results of identical queries. The analysis of the experimental results demonstrates the potential for personalized search.", "paper_title": "User rankings of search engine results", "paper_id": "WOS:000247578600003"}