{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dna_methylation"}, {"score": 0.04955461236891121, "phrase": "gene_expression"}, {"score": 0.0045318666714939905, "phrase": "biological_research"}, {"score": 0.003778253716938922, "phrase": "human_disease"}, {"score": 0.0036958398682001015, "phrase": "statistical_methods"}, {"score": 0.003516898780234098, "phrase": "potential_interactions"}, {"score": 0.003478321590910367, "phrase": "aberrant_dna_methylation"}, {"score": 0.0032198357970567595, "phrase": "therapeutic_target"}, {"score": 0.002915437843874821, "phrase": "network-sparse_reduced-rank_regression"}, {"score": 0.0027286224888843956, "phrase": "prior_biological_knowledge"}, {"score": 0.0026838147966444783, "phrase": "gene_interaction_networks"}, {"score": 0.002337848196418384, "phrase": "variable_selection_accuracy"}, {"score": 0.002312174113289583, "phrase": "alternative_models"}, {"score": 0.0022492129111567824, "phrase": "prior_network_information"}, {"score": 0.0021049977753042253, "phrase": "primary_ovarian_tumours"}], "paper_keywords": [""], "paper_abstract": "Motivation: High-throughput profiling in biological research has resulted in the availability of a wealth of data cataloguing the genetic, epigenetic and transcriptional states of cells. These data could yield discoveries that may lead to breakthroughs in the diagnosis and treatment of human disease, but require statistical methods designed to find the most relevant patterns from millions of potential interactions. Aberrant DNA methylation is often a feature of cancer, and has been proposed as a therapeutic target. However, the relationship between DNA methylation and gene expression remains poorly understood. Results: We propose Network-sparse Reduced-Rank Regression (NsRRR), a multivariate regression framework capable of using prior biological knowledge expressed as gene interaction networks to guide the search for associations between gene expression and DNA methylation signatures. We use simulations to show the advantage of our proposed model in terms of variable selection accuracy over alternative models that do not use prior network information. We discuss an application of NsRRR to The Cancer Genome Atlas datasets on primary ovarian tumours.", "paper_title": "Network-guided regression for detecting associations between DNA methylation and gene expression", "paper_id": "WOS:000343082900001"}