{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dynamic_xml_trees."}, {"score": 0.004750527930368202, "phrase": "online_algorithms"}, {"score": 0.004603525341738782, "phrase": "xml_tree"}, {"score": 0.003406713877432236, "phrase": "xml_databases"}, {"score": 0.0029767499830258754, "phrase": "assigned_labels"}, {"score": 0.0029236680654022664, "phrase": "lower_bounds"}, {"score": 0.00277001889871322, "phrase": "labeling_algorithms"}, {"score": 0.0026600905156986317, "phrase": "constant_factor"}, {"score": 0.0024864612830452254, "phrase": "possible_future_insertions"}, {"score": 0.0024311346712789553, "phrase": "newly_inserted_nodes"}, {"score": 0.0023033100935570755, "phrase": "similar_xml_trees"}, {"score": 0.0021920373388760314, "phrase": "shorter_labels"}], "paper_keywords": ["XML", " labeling schemes", " ancestor queries", " updates"], "paper_abstract": "We consider online algorithms to label the nodes of an XML tree which is subject to insertions and deletions of nodes. The labeling is done such that (1) each node is assigned a label immediately when it is inserted and this label remains unchanged, and (2) from a pair of labels alone, one can decide whether one node is an ancestor of the other. This problem arises in the context of XML databases that support queries on the structure of the documents as well as on the changes made to the documents over time. We consider here the length of the assigned labels. We prove lower bounds on the length of labels which satisfy these requirements and provide labeling algorithms that match these bounds (up to a constant factor). We also consider the same problem when \"clues\" that provide guarantees on possible future insertions are given together with newly inserted nodes. Such clues can be derived from the DTD/XML Schema or from statistics on similar XML trees. We present algorithms that use the clues to assign shorter labels. We also prove that the length of our labels is close to the minimum possible.", "paper_title": "LABELING DYNAMIC XML TREES", "paper_id": "WOS:000277584700014"}