{"auto_keywords": [{"score": 0.037215072668367835, "phrase": "user_effort"}, {"score": 0.010450698841728178, "phrase": "handwritten_text"}, {"score": 0.00481495049065317, "phrase": "limited_user_effort"}, {"score": 0.004544016163767266, "phrase": "post-editing_automatic_recognition"}, {"score": 0.00406250784433007, "phrase": "interactive_approach"}, {"score": 0.0037170399498025215, "phrase": "transcription_task"}, {"score": 0.0034538466642399976, "phrase": "limited_and_fully_supervision"}, {"score": 0.0034140224493254935, "phrase": "system_output"}, {"score": 0.003246672441842787, "phrase": "novel_interactive_approach"}, {"score": 0.0030166837276747816, "phrase": "limited_amount"}, {"score": 0.002947486683884831, "phrase": "recognised_words"}, {"score": 0.0025942468561537682, "phrase": "initial_transcription"}, {"score": 0.0024957862318504753, "phrase": "user_supervisions"}, {"score": 0.0024385083712241988, "phrase": "incorrect_words"}, {"score": 0.002419708657850547, "phrase": "unsupervised_parts"}, {"score": 0.002364172626241202, "phrase": "user_supervision"}, {"score": 0.00230098581403254, "phrase": "underlying_system_models"}, {"score": 0.0022481685132781626, "phrase": "partially_supervised_transcriptions"}, {"score": 0.002171202123281881, "phrase": "empirical_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Handwriting recognition", " Computer-assisted text transcription", " Active learning", " Semi-supervised learning", " Confidence measures", " Constrained Viterbi search"], "paper_abstract": "Transcription of handwritten text in (old) documents is an important, time-consuming task for digital libraries. Although post-editing automatic recognition of handwritten text is feasible, it is not clearly better than simply ignoring it and transcribing the document from scratch. A more effective approach is to follow an interactive approach in which both the system is guided by the user, and the user is assisted by the system to complete the transcription task as efficiently as possible. Nevertheless, in some applications, the user effort available to transcribe documents is limited and fully supervision of the system output is not realistic. To circumvent these problems, we propose a novel interactive approach which efficiently employs user effort to transcribe a document by improving three different aspects. Firstly, the system employs a limited amount of effort to solely supervise recognised words that are likely to be incorrect. Thus, user effort is efficiently focused on the supervision of words for which the system is not confident enough. Secondly, it refines the initial transcription provided to the user by recomputing it constrained to user supervisions. In this way, incorrect words in unsupervised parts can be automatically amended without user supervision. Finally, it improves the underlying system models by retraining the system from partially supervised transcriptions. In order to prove these statements, empirical results are presented on two real databases showing that the proposed approach can notably reduce user effort in the transcription of handwritten text in (old) documents.", "paper_title": "Interactive handwriting recognition with limited user effort", "paper_id": "WOS:000331655000004"}