{"auto_keywords": [{"score": 0.04942981937458459, "phrase": "spectral_clustering"}, {"score": 0.010612387000973441, "phrase": "markov_random_walk"}, {"score": 0.0083659459466876, "phrase": "existing_methods"}, {"score": 0.004436116555817464, "phrase": "similarity_graph"}, {"score": 0.00417160036938041, "phrase": "key_factors"}, {"score": 0.0038695436922618876, "phrase": "similarity_graphs"}, {"score": 0.003688773272422118, "phrase": "unreliable_edges"}, {"score": 0.0035892794633115227, "phrase": "reliable_similarity_graph"}, {"score": 0.0031091858573262265, "phrase": "proposed_method"}, {"score": 0.0030460403366412126, "phrase": "mrw_model"}, {"score": 0.0029436264166293317, "phrase": "raw_k"}, {"score": 0.0026204249881508234, "phrase": "mrw."}, {"score": 0.002567180189640976, "phrase": "high_order_transition_probabilities"}, {"score": 0.0021049977753042253, "phrase": "synthetic_and_real-world_datasets"}], "paper_keywords": ["k-NN graph", " Markov random walk", " spectral clustering"], "paper_abstract": "Spectral clustering has become one of the most popular clustering approaches in recent years. Similarity graph constructed on the data is one of the key factors that influence the performance of spectral clustering. However, the similarity graphs constructed by existing methods usually contain some unreliable edges. To construct reliable similarity graph for spectral clustering, an efficient method based on Markov random walk (MRW) is proposed in this paper. In the proposed method, the MRW model is defined on the raw k-NN graph and the neighbors of each sample are determined by the probability of the MRW. Since the high order transition probabilities carry complex relationships among data, the neighbors in the graph determined by our proposed method are more reliable than those of the existing methods. Experiments are performed on the synthetic and real-world datasets for performance evaluation and comparison. The results show that the graph obtained by our proposed method reflects the structure of the data better than those of the state-of-the-art methods and can effectively improve the performance of spectral clustering.", "paper_title": "Spectral Clustering with Sparse Graph Construction Based on Markov Random Walk", "paper_id": "WOS:000358997000013"}