{"auto_keywords": [{"score": 0.04864284861254969, "phrase": "precipitation_samples"}, {"score": 0.04569879800147235, "phrase": "austria"}, {"score": 0.00481495049065317, "phrase": "meteorological_and_geographical_features"}, {"score": 0.00457013354092966, "phrase": "geographical_and_meteorological_features"}, {"score": 0.0045108906244892165, "phrase": "sampling_stations"}, {"score": 0.004244375827831527, "phrase": "isotope_ratio_mass_spectrometry"}, {"score": 0.0035507457285983268, "phrase": "monthly_means"}, {"score": 0.0034291991359158827, "phrase": "long_term_averages"}, {"score": 0.003384695931421288, "phrase": "time_period"}, {"score": 0.003311799410921826, "phrase": "basic_feature_set"}, {"score": 0.0031984060035955292, "phrase": "original_features"}, {"score": 0.002931569771634119, "phrase": "different_methods"}, {"score": 0.002906138793910919, "phrase": "feature_selection"}, {"score": 0.0025723630851105304, "phrase": "pls_models"}, {"score": 0.002516917671182532, "phrase": "test_sets"}, {"score": 0.0024842242921857705, "phrase": "final_best_model"}, {"score": 0.0024095777415804346, "phrase": "ten_features"}, {"score": 0.0023679315987170857, "phrase": "genetic_algorithm"}, {"score": 0.002151388538895855, "phrase": "experimental_values"}], "paper_keywords": ["stable isotopes", " PLS", " feature selection", " estimation of prediction errors"], "paper_abstract": "Concentrations of the stable isotope oxygen-18 in precipitation samples have been modeled by geographical and meteorological features of the sampling stations. Precipitation samples are from 30 locations in Austria; oxygen-18 concentrations have been determined by isotope ratio mass spectrometry; each location has been characterized by three geographical features (longitude, latitude and elevation), and five meteorological features (relative humidity, fresh snow, wind speed, precipitation, and air temperature). All data are monthly means for the summer period April to September computed as long term averages for a time period of typically 20 years. The basic feature set has been augmented by 49 nonlinear transformations of the original features giving a data set with 57 features. The number of objects was 180 corresponding to the 30 sampling stations times six months. Different methods of feature selection (correlation coefficient, backward elimination, all subsets regression, and genetic algorithm) have been applied, and for the 20 best feature subsets the prediction errors of PLS models have been estimated from test sets. The final best model for a prediction of oxygen-18 concentrations contains ten features selected by a genetic algorithm. This model has been applied to the computation of a geographical oxygen-18 distribution map from Austria based on computed oxygen-18 values for 200 locations, and experimental values of 30 locations. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Multivariate models for the concentration of oxygen-18 in precipitation based on meteorological and geographical features", "paper_id": "WOS:000250284100001"}