{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "on-line_signature_verification_system"}, {"score": 0.004610058444728656, "phrase": "one-class_classifier"}, {"score": 0.004157561334726201, "phrase": "time_functions"}, {"score": 0.003512308265830794, "phrase": "approximation_coefficients_vector"}, {"score": 0.003399466007862412, "phrase": "feature_vector"}, {"score": 0.003201890266327127, "phrase": "dct_coefficients"}, {"score": 0.0025611773887867255, "phrase": "remarkable_performance_improvement"}, {"score": 0.00251966141432339, "phrase": "random_and_skilled_forgeries"}, {"score": 0.002386062690026682, "phrase": "equal_error_rate"}, {"score": 0.0023219374444738723, "phrase": "skilled_forgeries"}, {"score": 0.0022472527731744974, "phrase": "lowest_equal_error_rate"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["on-line signature", " local information", " 1-D wavelet transform", " one-class classifier", " biometric fusion"], "paper_abstract": "In this work, an on-line signature verification system based on local information and on a one-class classifier, the Linear Programming Descriptor classifier (LPD), is presented. The information is extracted as time functions of various dynamic properties of the signatures, then the discrete 1-D wavelet transform (WT) is performed on these features. The Discrete Cosine Transform (DCT) is used to reduce the approximation coefficients vector obtained by WT to a feature vector of a given dimension. The Linear Programming Descriptor classifier is trained using the DCT coefficients. Finally, we have studied the fusion among the approach here proposed and the state-of-the-art of the regional, the local and the global approaches. The fusion Outperforms all the stand-alone approaches. Results using all the 5000 signatures from the 100 subjects of the SUBCORPUS-100 MCYT Bimodal Biometric Database are presented, yielding remarkable performance improvement both with Random and Skilled Forgeries. We want to stress that our best fusion approach obtains an Equal Error Rate of 5.2% in the Skilled Forgeries, this value is the lowest Equal Error Rate reported in the literature for the SUBCORPUS-100 MCYT. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A novel local on-line signature verification system", "paper_id": "WOS:000254374500001"}