{"auto_keywords": [{"score": 0.04472882712454685, "phrase": "data_streams"}, {"score": 0.006142831452813064, "phrase": "frequent_itemsets"}, {"score": 0.004894661535468462, "phrase": "non-frequent_itemsets"}, {"score": 0.00481495049065317, "phrase": "novel_hash-based_approach"}, {"score": 0.004568871736067739, "phrase": "recent_times"}, {"score": 0.004392565073466714, "phrase": "continuous_data_streams"}, {"score": 0.00407781620412982, "phrase": "substantial_benefits"}, {"score": 0.002949598537993663, "phrase": "memory_utilization"}, {"score": 0.0026786469998321084, "phrase": "fixed_size"}, {"score": 0.0026436755508085223, "phrase": "hash-based_technique"}, {"score": 0.0026091594819333654, "phrase": "hash-based_approach"}, {"score": 0.002530359917257626, "phrase": "whole_data_stream"}, {"score": 0.0024864020775253767, "phrase": "hash_table"}, {"score": 0.002443206010337041, "phrase": "novel_technique"}, {"score": 0.0024007585788965655, "phrase": "support_counts"}, {"score": 0.0022777800735119405, "phrase": "mining_process"}, {"score": 0.0022089663761854657, "phrase": "optimizing_memory_space_utilization"}, {"score": 0.0021516366862117707, "phrase": "correctness_guarantee"}, {"score": 0.0021328586481696157, "phrase": "error_analysis"}, {"score": 0.0021049977753042253, "phrase": "parameter_setting"}], "paper_keywords": ["Data stream", " Data mining", " Frequent itemset", " Hash-based approach", " False positive"], "paper_abstract": "In recent times, data are generated as a form of continuous data streams in many applications. Since handling data streams is necessary and discovering knowledge behind data streams can often yield substantial benefits, mining over data streams has become one of the most important issues. Many approaches for mining frequent itemsets over data streams have been proposed. These approaches often consist of two procedures including continuously maintaining synopses for data streams and finding frequent itemsets from the synopses. However, most of the approaches assume that the synopses of data streams can be saved in memory and ignore the fact that the information of the non-frequent itemsets kept in the synopses may cause memory utilization to be significantly degraded. In this paper, we consider compressing the information of all the itemsets into a structure with a fixed size using a hash-based technique. This hash-based approach skillfully summarizes the information of the whole data stream by using a hash table, provides a novel technique to estimate the support counts of the non-frequent itemsets, and keeps only the frequent itemsets for speeding up the mining process. Therefore, the goal of optimizing memory space utilization can be achieved. The correctness guarantee, error analysis, and parameter setting of this approach are presented and a series of experiments is performed to show the effectiveness and the efficiency of this approach.", "paper_title": "A novel hash-based approach for mining frequent itemsets over data streams requiring less memory space", "paper_id": "WOS:000266266600005"}