{"auto_keywords": [{"score": 0.04483630460069358, "phrase": "mobile_payment"}, {"score": 0.012374048060085581, "phrase": "authentication_mechanism"}, {"score": 0.007057287991083525, "phrase": "mobile_device"}, {"score": 0.006133095265491253, "phrase": "wireless_network"}, {"score": 0.005659150236571628, "phrase": "encryption_mechanism"}, {"score": 0.004834679932343127, "phrase": "two-way_authentication"}, {"score": 0.004319677360634253, "phrase": "rapid_development"}, {"score": 0.004055730085399621, "phrase": "security_issues"}, {"score": 0.003162252895465901, "phrase": "center_system"}, {"score": 0.0029274600162609654, "phrase": "active_communication"}, {"score": 0.002896819408461957, "phrase": "mobile_subscriber"}, {"score": 0.002544207840990836, "phrase": "mobile_subscriber's_legitimate_identity"}, {"score": 0.002456486927713543, "phrase": "foreign_place"}, {"score": 0.0024307637980373552, "phrase": "roaming_authentication"}, {"score": 0.0022580713471027996, "phrase": "existed_schemes"}, {"score": 0.0021049977753042253, "phrase": "integrate_security_framework"}], "paper_keywords": ["Authentication", " mobile payment", " M2M", " security issues", " wireless network"], "paper_abstract": "As one of the four basic technologies of IOT (Internet of Things), M2M technology whose advance could influence on the technology of Internet of Things has a rapid development. Mobile Payment is one of the most widespread applications in M2M. Due to applying wireless network in Mobile Payment, the security issues based on wireless network have to be solved. The technologies applied in solutions generally include two sorts, encryption mechanism and authentication mechanism, the focus in this paper is the authentication mechanism of Mobile Payment. In this paper, we consider that there are four vital things in the authentication mechanism of Mobile Payment: two-way authentication, re-authentication, roaming authentication and inside authentication. Two-way authentication is to make the mobile device and the center system trust each other, and two-way authentication is the foundation of the other three. Re-authentication is to re-establish the active communication after the mobile subscriber changes his point of attachment to the network. Inside authentication is to prevent the attacker from obtaining the privacy via attacking the mobile device if the attacker captures the mobile device. Roaming authentication is to prove the mobile subscriber's legitimate identity to the foreign agency when he roams into a foreign place, and roaming authentication can be regarded as the integration of the above three. After making a simulation of our proposed authentication mechanism and analyzing the existed schemes, we summarize that the authentication mechanism based on the mentioned above in this paper and the encryption mechanism establish the integrate security framework of Mobile Payment together. This makes the parties of Mobile Payment apply the services which Mobile Payment provides credibly.", "paper_title": "The Classic Security Application in M2M: the Authentication Scheme of Mobile Payment", "paper_id": "WOS:000300519400008"}