{"auto_keywords": [{"score": 0.047524308711391836, "phrase": "virtual_network"}, {"score": 0.045890772216300044, "phrase": "optical_paths"}, {"score": 0.02291717740183702, "phrase": "traffic_changes"}, {"score": 0.005906601018946107, "phrase": "large_number"}, {"score": 0.00481495049065317, "phrase": "virtual_network_reconfiguration_with"}, {"score": 0.004663533386096864, "phrase": "accommodating_time-varying_traffic"}, {"score": 0.004496280772084575, "phrase": "optical_backbone_network"}, {"score": 0.004066498558415824, "phrase": "current_traffic"}, {"score": 0.0037971749182744334, "phrase": "large_traffic_changes"}, {"score": 0.0036776458116294986, "phrase": "large_overhead"}, {"score": 0.0028470123663391126, "phrase": "new_index"}, {"score": 0.0025744696954056404, "phrase": "significant_environmental_changes"}, {"score": 0.0024481198073210567, "phrase": "high_firm"}, {"score": 0.002370955769074803, "phrase": "small_number"}, {"score": 0.0022442866685153723, "phrase": "firm"}, {"score": 0.0021049977753042253, "phrase": "significant_traffic_changes"}], "paper_keywords": ["Optical network", " Reconfiguration traffic change", " Topology", " Traffic engineering"], "paper_abstract": "One approach to accommodating time-varying traffic is to construct a virtual network over an optical backbone network by connecting nodes with optical paths. The virtual network is dynamically reconfigured by adding or deleting optical paths so as to suit the current traffic. However, a large number of optical paths have to be added when there are large traffic changes, and this may entail a large overhead. To avoid adding a large number of optical paths, we should construct a virtual network that is adaptive to traffic changes, wherein congestion caused by traffic changes can be mitigated by adding only a small number of optical paths. In this paper, we propose a method to control a virtual network that adapts to traffic changes. We propose a new index, called flow inclusive relation modularity (FIRM), inspired by a model of lifeforms that survive and evolve under significant environmental changes. Through simulation, we clarify that the virtual network with high FIRM can handle traffic changes by adding a small number of optical paths. Moreover, we find that a virtual network embodying FIRM reduces the number of optical paths that have to be added when there are significant traffic changes compared with a virtual network configured only on the basis of the utilization of optical paths.", "paper_title": "Virtual Network Reconfiguration With Adaptability to Traffic Changes", "paper_id": "WOS:000337502400001"}