{"auto_keywords": [{"score": 0.04138579382509756, "phrase": "absorptive_capacity"}, {"score": 0.004815750952025665, "phrase": "review"}, {"score": 0.004772891986698849, "phrase": "synthesis"}, {"score": 0.004627244470096107, "phrase": "firm's_ability"}, {"score": 0.004446823283475876, "phrase": "valuable_external_knowledge"}, {"score": 0.004311352359122141, "phrase": "business_success"}, {"score": 0.0042734067085669885, "phrase": "modern_information_technologies"}, {"score": 0.0042171108629745655, "phrase": "critical_role"}, {"score": 0.004070573090297285, "phrase": "firm's_absorptive_capacity"}, {"score": 0.003894512634265439, "phrase": "information_systems_literature"}, {"score": 0.003709595902020469, "phrase": "diverse_and_often_contradictory_ways"}, {"score": 0.002934166052954463, "phrase": "broader_organizational_literature"}, {"score": 0.00289546142998427, "phrase": "special_attention"}, {"score": 0.00278237555651743, "phrase": "organizational_learning"}, {"score": 0.0021809311689473493, "phrase": "rich_aspects"}, {"score": 0.0021049977753042253, "phrase": "information_technology"}], "paper_keywords": ["Absorptive capacity", " information systems", " IT capability", " knowledge", " organizational learning"], "paper_abstract": "Absorptive capacity is a firm's ability to identify assimilate, transform, and apply valuable external knowledge. iris considered an imperative for business success. Modern information technologies perform a critical role in the development and maintenance of a firm's absorptive capacity. We provide an assessment of absorptive capacity in the information systems literature. IS scholars have used the absorptive capacity construct in diverse and often contradictory ways. Confusion surrounds how absorptive capacity should be conceptualized, its appropriate level of analysis, and how it can be measured. Our aim in reviewing this construct is to reduce such confusion by improving our understanding of absorptive capacity and guiding its effective use in IS research. We trace the evolution of the absorptive capacity construct in the broader organizational literature and pay special attention to its conceptualization, assumptions, and relationship to organizational learning. Following this, we investigate how absorptive capacity has been conceptualized, measured, and used in IS research. We also examine how absorptive capacity fits into distinct IS themes and facilitates understanding of various IS phenomena. Based on our analysis, we provide a framework through which IS researchers can more fully leverage the rich aspects of absorptive capacity when investigating the role of information technology in organizations.", "paper_title": "ABSORPTIVE CAPACITY AND INFORMATION SYSTEMS RESEARCH: REVIEW, SYNTHESIS, AND DIRECTIONS FOR FUTURE RESEARCH", "paper_id": "WOS:000304296400014"}