{"auto_keywords": [{"score": 0.040691162217611467, "phrase": "test_cases"}, {"score": 0.027773607799187222, "phrase": "test_case"}, {"score": 0.00481495049065317, "phrase": "context-sensitive_middleware-based_applications"}, {"score": 0.004583878086896926, "phrase": "context-sensitive_middleware-based_software"}, {"score": 0.004450568197899267, "phrase": "current_situation"}, {"score": 0.004363846362238565, "phrase": "appropriate_functions"}, {"score": 0.003566422652043389, "phrase": "subsequent_correct_outcomes"}, {"score": 0.0032800186243040663, "phrase": "special_kind"}, {"score": 0.0026538282523433684, "phrase": "different_execution_sequences"}, {"score": 0.002157538586313944, "phrase": "rfid-based_location-sensing_application"}, {"score": 0.0021049977753042253, "phrase": "context-sensitive_middleware"}], "paper_keywords": ["context-aware application", " integration testing", " metamorphic testing", " RFID testing"], "paper_abstract": "During the testing of context-sensitive middleware-based software, the middleware checks the current situation to invoke the appropriate functions of the applications. Since the middleware remains active and the situation may continue to evolve, however, the conclusion of some test cases may not easily be identified. Moreover, failures appearing in one situation may be superseded by subsequent correct outcomes and, therefore, be hidden. We alleviate the above problems by making use of a special kind of situation, which we call checkpoints, such that the middleware will not activate the functions under test. We recommend testers to generate test cases that start at a checkpoint and end at another. Testers may identify relations that associate different execution sequences of a test case. They then check the results of each test case to detect any contravention of such relations. We illustrate our technique with an example that shows how hidden failures can be detected. We also report the experimentation carried out on an RFID-based location-sensing application on top of a context-sensitive middleware.", "paper_title": "Integration testing of context-sensitive middleware-based applications: A metamorphic approach", "paper_id": "WOS:000241963600003"}