{"auto_keywords": [{"score": 0.049558064870310475, "phrase": "embedded_multi-core_platforms"}, {"score": 0.04904273003005848, "phrase": "automated_design-time_exploration"}, {"score": 0.00481495049065317, "phrase": "run-time_resource_management"}, {"score": 0.004558564684763264, "phrase": "unpredictable_changes"}, {"score": 0.004435514622798228, "phrase": "workload_variation"}, {"score": 0.004339459955098738, "phrase": "multiple_applications"}, {"score": 0.004041359131062721, "phrase": "lightweight_run-time_manager"}, {"score": 0.003826007045267751, "phrase": "host_processor"}, {"score": 0.003485824905231454, "phrase": "available_platform_resources"}, {"score": 0.0027843339377323878, "phrase": "design-time_design_space_explorer"}, {"score": 0.0024815011359381692, "phrase": "run-time_manager"}, {"score": 0.0024410093024417527, "phrase": "near-optimal_application_configurations"}, {"score": 0.0023107372754933887, "phrase": "run-time_selection"}, {"score": 0.002273025527678093, "phrase": "proposed_flow"}, {"score": 0.002175436093794315, "phrase": "clock_frequencies"}, {"score": 0.0021049977753042253, "phrase": "automotive_cognitive_safety_applications"}], "paper_keywords": [""], "paper_abstract": "Nowadays, owing to unpredictable changes of the environment and workload variation, optimally running multiple applications in terms of quality, performance and power consumption on embedded multi-core platforms is a huge challenge. A lightweight run-time manager, linked with an automated design-time exploration and incorporated in the host processor of the platform, is required to dynamically and efficiently configure the applications according to the available platform resources (e. g. processing elements, memories, communication bandwidth), for minimising the cost (e. g. power consumption), while satisfying the constraints (e. g. deadlines). This study presents a flow linking a design-time design space explorer, coupled with platform simulators at two abstraction levels, with a fast and lightweight priority-based heuristic integrated in the run-time manager to select near-optimal application configurations. To illustrate its feasibility and the very low complexity of the run-time selection, the proposed flow is used to manage the processors and clock frequencies of a multiple-stream MPEG4 encoder chip dedicated to automotive cognitive safety applications.", "paper_title": "Linking run-time resource management of embedded multi-core platforms with automated design-time exploration", "paper_id": "WOS:000287964500006"}