{"auto_keywords": [{"score": 0.03118082090347253, "phrase": "punishment_severity_increase"}, {"score": 0.015719716506582538, "phrase": "violation_rate"}, {"score": 0.011579643250007435, "phrase": "optimal_enforcement_expenditure"}, {"score": 0.004688321299229397, "phrase": "expected_payoff"}, {"score": 0.0037161794591176033, "phrase": "smaller_expenditure"}, {"score": 0.003404244237372396, "phrase": "constrained_optimal_control_problem"}, {"score": 0.0030829367866722825, "phrase": "low_violation_state"}, {"score": 0.003047865053078826, "phrase": "smaller_enforcement_expenditure"}, {"score": 0.0030017207229983385, "phrase": "high_probability"}, {"score": 0.0027495914857929584, "phrase": "optimal_expenditure"}, {"score": 0.002718301574682098, "phrase": "harsher_punishment"}, {"score": 0.002324620886282579, "phrase": "optimal_level"}, {"score": 0.0021702728407945976, "phrase": "harsher_penalties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Mathematical modeling", " Optimal control", " Violation deterrence"], "paper_abstract": "A model of rule-breaking is proposed. The violation rate is assumed to respond to the expected payoff of violating, which is composed of the probability and the severity of punishment as well as the gain associated with violating. The probability of punishment is itself a function of the number of violators: for a given enforcement expenditure, the probability of punishment will decrease as the number of violators increases, simply because there would be a smaller expenditure allocated to ensuring punishment per violation. The problem of determining the optimal enforcement expenditure as a function of time is treated as a constrained optimal control problem. The results show that a crackdown (very high enforcement expenditure in the beginning) is optimal and can shift the system to a low violation state requiring a smaller enforcement expenditure to maintain a high probability of punishment. A punishment severity increase is also explored. In all cases considered, a punishment severity increase coincides with a jump up in optimal expenditure when the harsher punishment is implemented which can subsequently be reduced as the violation rate is driven down. Only when the cost of imposing the punishment is not too high can the optimal enforcement expenditure be reduced down the line to a level lower than the optimal level in the case of no punishment severity increase. This study highlights the importance of punishment costs when considering harsher penalties for violations. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Optimal enforcement expenditure for a model of rule-breaking when sanctions are costly to impose", "paper_id": "WOS:000318915800034"}