{"auto_keywords": [{"score": 0.03937019131877225, "phrase": "phrase_tables"}, {"score": 0.010612387000973441, "phrase": "statistical_machine_translation"}, {"score": 0.010088596017003565, "phrase": "parallel_corpora"}, {"score": 0.004777392826700429, "phrase": "adapting_translation_models"}, {"score": 0.004703149944841539, "phrase": "translation_models"}, {"score": 0.004452228677941085, "phrase": "common_assumption"}, {"score": 0.0044002186469797476, "phrase": "parallel_texts"}, {"score": 0.004100620365805411, "phrase": "translation_studies"}, {"score": 0.004005339423663657, "phrase": "translation_matters"}, {"score": 0.0036031440110534853, "phrase": "translation_task"}, {"score": 0.0031907572162427978, "phrase": "wrong_direction"}, {"score": 0.0029616217177058602, "phrase": "translation_model"}, {"score": 0.002926973459215349, "phrase": "special_properties"}, {"score": 0.0027814417101979317, "phrase": "mixture_model"}, {"score": 0.0026431267487109543, "phrase": "wrong_directions"}, {"score": 0.002472552537325606, "phrase": "entropy-based_measures"}, {"score": 0.0024150092189446424, "phrase": "target-language_phrases"}, {"score": 0.002312960805824996, "phrase": "parallel_corpus"}, {"score": 0.0021215910859085146, "phrase": "statistical_machine_translation_systems_results"}], "paper_keywords": [""], "paper_abstract": "Translation models used for statistical machine translation are compiled from parallel corpora that are manually translated. The common assumption is that parallel texts are symmetrical: The direction of translation is deemed irrelevant and is consequently ignored. Much research in Translation Studies indicates that the direction of translation matters, however, as translated language (translationese) has many unique properties. It has already been shown that phrase tables constructed from parallel corpora translated in the same direction as the translation task outperform those constructed from corpora translated in the opposite direction.We reconfirm that this is indeed the case, but emphasize the importance of also using texts translated in the wrong direction. We take advantage of information pertaining to the direction of translation in constructing phrase tables by adapting the translation model to the special properties of translationese. We explore two adaptation techniques: First, we create a mixture model by interpolating phrase tables trained on texts translated in the right and the wrong directions. The weights for the interpolation are determined by minimizing perplexity. Second, we define entropy-based measures that estimate the correspondence of target-language phrases to translationese, thereby eliminating the need to annotate the parallel corpus with information pertaining to the direction of translation. We show that incorporating these measures as features in the phrase tables of statistical machine translation systems results in consistent, statistically significant improvement in the quality of the translation.", "paper_title": "Improving Statistical Machine Translation by Adapting Translation Models to Translationese", "paper_id": "WOS:000327124700006"}