{"auto_keywords": [{"score": 0.04236022982813548, "phrase": "nursing_support_staff"}, {"score": 0.012453633739302502, "phrase": "minimum_computer_competencies"}, {"score": 0.00481495049065317, "phrase": "urban_university_hospital_-_technology"}, {"score": 0.004563028873351776, "phrase": "patient_safety"}, {"score": 0.004502126088469323, "phrase": "care_quality"}, {"score": 0.0043533862892678864, "phrase": "computerized_information_systems"}, {"score": 0.004266501496765747, "phrase": "clinical_staff"}, {"score": 0.003510754567808717, "phrase": "current_nursing_workforce"}, {"score": 0.003260377175139591, "phrase": "self-assessment_survey"}, {"score": 0.0030688220103201836, "phrase": "computer_skills"}, {"score": 0.0028498718992429825, "phrase": "basic_and_work-related_computer_skills"}, {"score": 0.0026823700218343506, "phrase": "fair_or_poor_proficiency"}], "paper_keywords": ["computers", " computer literacy", " informatics", " nursing", " nursing education"], "paper_abstract": "The linkage of patient safety and care quality to the implementation of computerized information systems assumes that clinical staff are skilled with computers. Nurses and nursing support staff increasingly require computers to carry out their work. Minimum computer competencies for nurses have been identified. The determination of whether the current nursing workforce has acquired these competencies remains uncertain. We administered a self-assessment survey to nurses and nursing support staff to determine proficiency with computer skills they might perform at work. Respondents reported inadequacies in basic and work-related computer skills. More than 28% scored themselves as having fair or poor proficiency on all skills, and more than 50% as fair or poor on five of 11 skills. Respondents over age 50 and those graduating before 1984 tended to score proficiency lower. Our study suggests that many nurses and nursing support staff may not have the minimum computer competencies to effectively and efficiently perform their work.", "paper_title": "Computer use in an urban university hospital - Technology ahead of literacy", "paper_id": "WOS:000235139600006"}