{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "specialized_ad_hoc_networks"}, {"score": 0.004744748477093856, "phrase": "opportunistic_resource_utilization_networks"}, {"score": 0.004658426838467567, "phrase": "novel_paradigm"}, {"score": 0.004392565073466714, "phrase": "natural_basis"}, {"score": 0.0042031320273645065, "phrase": "general-purpose_ad_hoc_networks"}, {"score": 0.004066416005586085, "phrase": "ad_hoc_networks"}, {"score": 0.0040366412779632085, "phrase": "diverse_systems"}, {"score": 0.003615217162972726, "phrase": "significant_potential"}, {"score": 0.003471933181807712, "phrase": "new_application_niches"}, {"score": 0.0034212450542713607, "phrase": "opportunistic_networks"}, {"score": 0.0031786562062819327, "phrase": "opportunistically_all_kinds"}, {"score": 0.0028360962841331634, "phrase": "oppnet_virtual_machine"}, {"score": 0.0027946649584841754, "phrase": "standard_implementation_framework"}, {"score": 0.0027741761880779535, "phrase": "oppnet_applications"}, {"score": 0.002673957615079041, "phrase": "example_application_scenario"}, {"score": 0.0026446021865907197, "phrase": "ovm_primitives"}, {"score": 0.002530359917257626, "phrase": "small-scale_oppnet"}, {"score": 0.002502576987281976, "phrase": "microoppnet"}, {"score": 0.0022994427535192514, "phrase": "pilot_implementations"}, {"score": 0.0022825763382627443, "phrase": "oppnet_architectures"}, {"score": 0.0021679176844660074, "phrase": "open_issues"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Ad hoc networks", " Oppnets", " Opportunistic networks", " Specialized ad hoc networks"], "paper_abstract": "We present opportunistic resource utilization networks or oppnets, a novel paradigm of specialized ad hoc networks. We believe that applications can benefit from using specialized ad hoc networks that provide a natural basis for them, the basis more efficient and effective than what general-purpose ad hoc networks can offer. Oppnets constitute the subcategory of ad hoc networks where diverse systems, not employed originally as nodes of an oppnet, join it dynamically in order to perform certain tasks they have been called to participate in. Oppnets have a significant potential to improve a variety of applications, and to create new application niches. We categorize opportunistic networks currently known in the literature as class 1 opportunistic networks that use opportunistically only communication resources, and class 2 opportunistic networks or oppnets that use opportunistically all kinds of resources, including not only Communication but also computation, sensing, actuation, storage, etc. After describing the oppnets and the basics of their operation, we discuss the Oppnet Virtual Machine (OVM)-a proposed standard implementation framework for oppnet applications. It is followed by a discussion of an example application scenario using the OVM primitives. Next, we discuss the design and operations of a small-scale oppnet, named MicroOppnet, originally developed as a proof of concept. MicroOppnet is now being extended to serve as a testbed for experimentation and pilot implementations of oppnet architectures and their components. We conclude with a summary and a list of some open issues for oppnets. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Opportunistic resource utilization networks-A new paradigm for specialized ad hoc networks", "paper_id": "WOS:000275799300008"}