{"auto_keywords": [{"score": 0.04956594643422059, "phrase": "optimized_structural_features"}, {"score": 0.023275006514868444, "phrase": "protein_families"}, {"score": 0.00481495049065317, "phrase": "fold_recognition"}, {"score": 0.004307459965946991, "phrase": "homology-based_predictions"}, {"score": 0.0042004472903194616, "phrase": "sequence_profiles"}, {"score": 0.004140490129683107, "phrase": "local_structural_features"}, {"score": 0.004037608759610068, "phrase": "latter_terms"}, {"score": 0.003965684670332574, "phrase": "existing_methods"}, {"score": 0.0038671299350540554, "phrase": "distant_relations"}, {"score": 0.0037845987749316632, "phrase": "best_methods"}, {"score": 0.003598786417573615, "phrase": "recent_improvements"}, {"score": 0.0035346515636097533, "phrase": "function_assignment_system"}, {"score": 0.003509317669345521, "phrase": "ffas"}, {"score": 0.0031730701021262155, "phrase": "neural_network"}, {"score": 0.0031390053628808706, "phrase": "alignment_accuracy"}, {"score": 0.0028792911886505526, "phrase": "high_success_rate"}, {"score": 0.00284837132359445, "phrase": "structural_classification"}, {"score": 0.00245753647863636, "phrase": "predicted_features"}, {"score": 0.0022298571016688335, "phrase": "protein_data_bank"}, {"score": 0.002143247921132179, "phrase": "orthologous_groups"}, {"score": 0.0021049977753042253, "phrase": "functional_annotations"}], "paper_keywords": [""], "paper_abstract": "Motivation: Homology detection enables grouping proteins into families and prediction of their structure and function. The range of application of homology-based predictions can be significantly extended by using sequence profiles and incorporation of local structural features. However, incorporation of the latter terms varies a lot between existing methods, and together with many examples of distant relations not recognized even by the best methods, suggests that further improvements are still possible. Results: Here we describe recent improvements to the fold and function assignment system (FFAS) method, including adding optimized structural features (experimental or predicted), 'symmetrical' Z-score calculation and re-ranking the templates with a neural network. The alignment accuracy in the new FFAS-3D is now 11% higher than the original and comparable with the most accurate template-based structure prediction algorithms. At the same time, FFAS-3D has high success rate at the Structural Classification of Proteins (SCOP) family, superfamily and fold levels. Importantly, FFAS-3D results are not highly correlated with other programs suggesting that it may significantly improve meta-predictions. FFAS-3D does not require 3D structures of the templates, as using predicted features instead of structure-derived does not lead to the decrease of accuracy. Because of that, FFAS-3D can be used for databases other than Protein Data Bank (PDB) such as Protein families database or Clusters of orthologous groups thus extending its applications to functional annotations of genomes and protein families.", "paper_title": "FFAS-3D: improving fold recognition by including optimized structural features and template re-ranking", "paper_id": "WOS:000332259300010"}