{"auto_keywords": [{"score": 0.03644451033122438, "phrase": "evolutionary_process"}, {"score": 0.004817625833947645, "phrase": "survey"}, {"score": 0.0043678116213858, "phrase": "data_mining"}, {"score": 0.004258128672571261, "phrase": "new_research_angles"}, {"score": 0.0039620308501590795, "phrase": "research_angles"}, {"score": 0.003670843919846253, "phrase": "key_purpose"}, {"score": 0.003578600071301459, "phrase": "correlative_technologies"}, {"score": 0.003315499339103866, "phrase": "correlation_techniques"}, {"score": 0.0032321559007422087, "phrase": "current_literature"}, {"score": 0.0030457198309616694, "phrase": "existing_technologies"}, {"score": 0.0027159094186967247, "phrase": "particular_focus"}, {"score": 0.0026929458952693465, "phrase": "different_stages"}, {"score": 0.0025810006125483835, "phrase": "current_phase"}, {"score": 0.002505412457777352, "phrase": "future_challenges"}, {"score": 0.0022626276288355432, "phrase": "panoramic_view"}, {"score": 0.0022339789476489877, "phrase": "iot_field"}, {"score": 0.0021593396036472777, "phrase": "existing_literature"}, {"score": 0.0021049977753042253, "phrase": "existing_iot_survey_papers"}], "paper_keywords": [""], "paper_abstract": "The title of this paper may suggest such topics as routing, networking, and data mining, but we focus on new research angles regarding the Internet of Things (IoT) as the theme of this paper. These research angles come from other disciplines and are in the process of being adopted by the IoT. Our paper serves a key purpose: from the perspective of correlative technologies based on time, to review the evolutionary process of the IoT and depict the relations between the correlation techniques which are largely missing in current literature in which the focus has been more on the introduction and comparison of existing technologies and less on issues describing evolutionary process of the IoT. We consider that the latter is crucial to understanding the evolution of the IoT. Through generalizations of particular focus in different stages of each technology, we can better understand the current phase of the IoT and therefore predict future challenges. This paper aims to bridge this gap by providing guidance in terms of the evolutionary process of the IoT and gives readers a panoramic view of the IoT field without repeating what is already available in existing literature so as to complement the existing IoT survey papers which have not covered the evolutionary process of the IoT.", "paper_title": "A Survey from the Perspective of Evolutionary Process in the Internet of Things", "paper_id": "WOS:000353520100001"}