{"auto_keywords": [{"score": 0.04463678775116184, "phrase": "online_security_performances"}, {"score": 0.007455994913556103, "phrase": "information_security"}, {"score": 0.00481495049065317, "phrase": "voluntary_disclosures"}, {"score": 0.004707672504464783, "phrase": "annual_reports"}, {"score": 0.0038721890530859578, "phrase": "financial_institutions"}, {"score": 0.003459191419478298, "phrase": "different_markets"}, {"score": 0.0033315236647127734, "phrase": "positive_relation"}, {"score": 0.003232779373179631, "phrase": "information_security_disclosures"}, {"score": 0.0023040642263522505, "phrase": "significant_and_positive_effects"}, {"score": 0.0021049977753042253, "phrase": "two-factor_authentication"}], "paper_keywords": ["Online security", " authentication", " Technology-Organization-Environment framework", " voluntary disclosures", " information security"], "paper_abstract": "This study tests whether the voluntary disclosures in the annual reports concerning information security are credible. It also develops a scale to measure online security performances and identifies influencing factors. Our findings provide insights into the online security performances of financial institutions. Specifically, they manifest the similarity of online security performances within the same business sector and across different markets. Through finding a positive relation between online security performances and information security disclosures, our results confirm the credibility of the latter. Our study also extends the Technology-Organization-Environment framework for explaining online security performances. While the results show all three variables: (I) importance of information security as measured by its disclosures, (2) existence of government regulation, and (3) firm size, have significant and positive effects on online security performances, only the first two variables have such effects on the adoption of two-factor authentication.", "paper_title": "ONLINE SECURITY PERFORMANCES AND INFORMATION SECURITY DISCLOSURES", "paper_id": "WOS:000347761800003"}