{"auto_keywords": [{"score": 0.049474472243262034, "phrase": "supplier_selection"}, {"score": 0.005260615836924654, "phrase": "comparative_analysis"}, {"score": 0.00481495049065317, "phrase": "fuzzy_ahp"}, {"score": 0.004784448637292493, "phrase": "fuzzy_topsis_methods"}, {"score": 0.004662363635474297, "phrase": "group_decision_making"}, {"score": 0.0045888632122307055, "phrase": "alternative_suppliers"}, {"score": 0.004561732093492262, "phrase": "supply_chains"}, {"score": 0.004294381488413906, "phrase": "order_of_preference"}, {"score": 0.004240116703465252, "phrase": "ideal_solution"}, {"score": 0.004055511503825102, "phrase": "supplier_selection_decision_process"}, {"score": 0.003966233032752466, "phrase": "comparative_studies"}, {"score": 0.00365143309008563, "phrase": "supplier_selection_decision_making"}, {"score": 0.003404593678001724, "phrase": "decision_process"}, {"score": 0.0031542454984159634, "phrase": "illustrative_example"}, {"score": 0.002997628439369723, "phrase": "automotive_production_chain"}, {"score": 0.0029502941554043964, "phrase": "computational_tests"}, {"score": 0.002597491690813945, "phrase": "fuzzy_topsis_method"}, {"score": 0.0023683286031958538, "phrase": "comparative_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Supplier selection", " Fuzzy TOPSIS", " Fuzzy AHP", " Multicriteria decision making"], "paper_abstract": "Supplier selection has become a very critical activity to the performance of organizations and supply chains. Studies presented in the literature propose the use of the methods Fuzzy TOPSIS (Fuzzy Technique for Order of Preference by Similarity to Ideal Solution) and Fuzzy AHP (Fuzzy Analytic Hierarchy Process) to aid the supplier selection decision process. However, there are no comparative studies of these two methods when applied to the problem of supplier selection. Thus, this paper presents a comparative analysis of these two methods in the context of supplier selection decision making. The comparison was made based on the factors: adequacy to changes of alternatives or criteria; agility in the decision process; computational complexity; adequacy to support group decision making; the number of alternative suppliers and criteria; and modeling of uncertainty. As an illustrative example, both methods were applied to the selection of suppliers of a company in the automotive production chain. In addition, computational tests were performed considering several scenarios of supplier selection. The results have shown that both methods are suitable for the problem of supplier selection, particularly to supporting group decision making and modeling of uncertainty. However, the comparative analysis has shown that the Fuzzy TOPSIS method is better suited to the problem of supplier selection in regard to changes of alternatives and criteria, agility and number of criteria and alternative suppliers. Thus, this comparative study contributes to helping researchers and practitioners to choose more effective approaches for supplier selection. Suggestions of further work are also proposed so as to make these methods more adequate to the problem of supplier selection. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A comparison between Fuzzy AHP and Fuzzy TOPSIS methods to supplier selection", "paper_id": "WOS:000336411500016"}