{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "exploring_area"}, {"score": 0.0046159158660556985, "phrase": "-programmable_gate_arrays"}, {"score": 0.004438439373358016, "phrase": "differing_cost"}, {"score": 0.004385210330180571, "phrase": "power_consumption_requirements"}, {"score": 0.004229306699561554, "phrase": "single_fpga_family"}, {"score": 0.00399367108161192, "phrase": "fpga_vendors"}, {"score": 0.003922011960904278, "phrase": "diverse_set"}, {"score": 0.0038516336597530614, "phrase": "different_points"}, {"score": 0.00381691770211996, "phrase": "area-speed-power_design_space"}, {"score": 0.0037034335789757514, "phrase": "architectural_design_attributes"}, {"score": 0.003507567662772987, "phrase": "possible_tradeoffs"}, {"score": 0.003362393461932223, "phrase": "device_families"}, {"score": 0.0031653299069848463, "phrase": "broad_range"}, {"score": 0.0031273209718167072, "phrase": "circuit_designs"}, {"score": 0.002813566267090177, "phrase": "vastly_less_effort"}, {"score": 0.002256567862969091, "phrase": "single_architecture"}, {"score": 0.002169607777109063, "phrase": "transistor_size"}, {"score": 0.0021370591426091833, "phrase": "lut_size"}], "paper_keywords": ["Architecture", " area delay tradeoffs", " field-programmable gate array (FPGAs)", " transistor sizing"], "paper_abstract": "Field-programmable gate arrays (FPGAs) are used in a variety of markets that have differing cost, performance and power consumption requirements. While it would be ideal to serve all these markets with a single FPGA family, the diversity in the needs of these markets means that generally more than one family is appropriate. Consequently, FPGA vendors have moved to provide a diverse set of families that sit at different points in the area-speed-power design space. This paper aims to understand the circuit and architectural design attributes of FPGAs that enable tradeoffs between area and speed, and to determine the magnitude of the possible tradeoffs. This will be useful for architects seeking to determine the number of device families in a suite of offerings, as well as the changes to make between families. We explore a broad range of architectures and circuit designs and developed a transistor sizing tool that automatically optimizes each design. In this paper, we describe this tool and demonstrate that it achieves results that are comparable to past work but with vastly less effort. We then use the designs produced by the tool to explore the range of tradeoffs possible. We find that through architecture and transistor sizing changes it is possible to usefully vary the area of an FPGA by a factor of 2.0 and the performance of an FPGA by a factor of 2.1. We also observe that the range of area and delay tradeoffs possible by varying only the transistor sizing of a single architecture is larger than the ranges observed in past architectural experiments. In addition to transistor size, we note that LUT size is one of the most useful parameters for trading off area and delay.", "paper_title": "Exploring Area and Delay Tradeoffs in FPGAs With Architecture and Automated Transistor Design", "paper_id": "WOS:000285844200008"}