{"auto_keywords": [{"score": 0.046081391722127746, "phrase": "conserved_patterns"}, {"score": 0.00481495049065317, "phrase": "serine_proteases"}, {"score": 0.004762893197005439, "phrase": "hydrophobic_patch_centroids"}, {"score": 0.004660453113061494, "phrase": "protein-protein_interfaces"}, {"score": 0.004535481695403089, "phrase": "molecular_recognition"}, {"score": 0.004090274535243564, "phrase": "molecular_binding"}, {"score": 0.003937459891461576, "phrase": "different_enzymes"}, {"score": 0.00349324530379071, "phrase": "difficult_task"}, {"score": 0.0034366728236876016, "phrase": "traditional_methods"}, {"score": 0.002855934865505357, "phrase": "atomic_apolar_interactions"}, {"score": 0.0028249975318149468, "phrase": "hydrophobic_patches"}, {"score": 0.002704610782770994, "phrase": "hp"}, {"score": 0.0024386325347607674, "phrase": "appropriate_level"}, {"score": 0.0023730978395564116, "phrase": "invariant_properties"}, {"score": 0.0021396960731214225, "phrase": "studied_inhibitors"}, {"score": 0.0021049977753042253, "phrase": "brenda_database"}], "paper_keywords": [""], "paper_abstract": "Motivation: Protein-protein interfaces contain important information about molecular recognition. The discovery of conserved patterns is essential for understanding how substrates and inhibitors are bound and for predicting molecular binding. When an inhibitor binds to different enzymes (e.g. dissimilar sequences, structures or mechanisms what we call cross-inhibition), identification of invariants is a difficult task for which traditional methods may fail. Results: To clarify how cross-inhibition happens, we model the problem, propose and evaluate a methodology called HydroPaCe to detect conserved patterns. Interfaces are modeled as graphs of atomic apolar interactions and hydrophobic patches are computed and summarized by centroids (HP-centroids), and their conservation is detected. Despite sequence and structure dissimilarity, our method achieves an appropriate level of abstraction to obtain invariant properties in cross-inhibition. We show examples in which HP-centroids successfully predicted enzymes that could be inhibited by the studied inhibitors according to BRENDA database. Availability: www.dcc.ufmg.br/similar to raquelcm/hydropace", "paper_title": "HydroPaCe: understanding and predicting cross-inhibition in serine proteases through hydrophobic patch centroids", "paper_id": "WOS:000300043200007"}