{"auto_keywords": [{"score": 0.03306548366767723, "phrase": "unauthenticated_network"}, {"score": 0.031763843900136826, "phrase": "authenticated_network"}, {"score": 0.0048149519209288215, "phrase": "bellare"}, {"score": 0.0047584608267731724, "phrase": "canetti"}, {"score": 0.004702631474219888, "phrase": "krawczyk"}, {"score": 0.004620093797504386, "phrase": "security_model"}, {"score": 0.00438105507792004, "phrase": "key_exchange_protocols"}, {"score": 0.00405735420159564, "phrase": "practical_attackers"}, {"score": 0.003939296259436904, "phrase": "modular_approach"}, {"score": 0.0038246602895705643, "phrase": "secure_key_exchange_protocols"}, {"score": 0.0035210572541244664, "phrase": "message_transmission_protocol"}, {"score": 0.003459191419478298, "phrase": "ideally_authenticated_network"}, {"score": 0.0033984088755183287, "phrase": "equivalent_protocol"}, {"score": 0.0027796495180095657, "phrase": "encryption-based_mt-authenticator"}, {"score": 0.002286781334850213, "phrase": "corresponding_message_transmission_protocol"}], "paper_keywords": ["MT-authenticator", " BCK-model", " CK-model", " verifiable encryption"], "paper_abstract": "Bellare, Canetti and Krawczyk proposed a security model (BCK-model) for authentication and key exchange protocols in 1998. The model not only reasonably captures the power of practical attackers but also provides a modular approach to the design of secure key exchange protocols. One important element in this approach is the MT-authenticator. An MT-authenticator transforms a message transmission protocol for an ideally authenticated network to an equivalent protocol for a real, unauthenticated network such that all attacks that can be launched in the unauthenticated network can also be launched in the authenticated network. In this paper, we show that the proof of the encryption-based MT-authenticator proposed in their paper is flawed, which leads to their encryption-based MT-authenticator insecure. An attack called session corruption attack can be launched successfully against the MT-authenticator in the unauthenticated network but not against the corresponding message transmission protocol in the authenticated network. To thwart this attack, we propose several improved techniques and two new encryption-based MT-authenticators.", "paper_title": "Session corruption attack and improvements on encryption based MT-authenticators", "paper_id": "WOS:000236884700003"}