{"auto_keywords": [{"score": 0.02991048950725451, "phrase": "high_probability"}, {"score": 0.00481495049065317, "phrase": "large-scale_random_wireless_sensor_networks"}, {"score": 0.004489810932879285, "phrase": "greedy_routing"}, {"score": 0.0037336520904376687, "phrase": "recent_results"}, {"score": 0.003525861581971337, "phrase": "deterministic_localized_routing_algorithm"}, {"score": 0.0026140878612307536, "phrase": "asymptotic_critical_transmission_radius"}, {"score": 0.0025160740422447837, "phrase": "packet_delivery"}, {"score": 0.0022292394795878643, "phrase": "extensive_simulations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Greedy routing", " Localized routing", " Delivery guarantee", " Energy-efficiency", " 3D wireless sensor networks"], "paper_abstract": "In this paper, we investigate how to design greedy routing to achieve sustainable and scalable in a large-scale three-dimensional (3D) sensor network. Several 3D position-based routing protocols were proposed to seek either delivery guarantee or energy-efficiency in 3D wireless networks. However, recent results [1,2] showed that there is no deterministic localized routing algorithm that guarantees either delivery of packets or energy-efficiency of its routes in 3D networks. In this paper, we focus on design of 3D greedy routing protocols which can guarantee delivery of packets and/or energy-efficiency of their paths with high probability in a randomly deployed 3D sensor network. In particular, we first study the asymptotic critical transmission radius for 3D greedy routing to ensure the packet delivery in large-scale random 3D sensor networks, then propose a refined 3D greedy routing protocol to achieve energy-efficiency of its paths with high probability. We also conduct extensive simulations to confirm our theoretical results. (c) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Three-dimensional greedy routing in large-scale random wireless sensor networks", "paper_id": "WOS:000319895400007"}