{"auto_keywords": [{"score": 0.04262684978582361, "phrase": "conflicting_information"}, {"score": 0.011263740727661814, "phrase": "true_facts"}, {"score": 0.009901187418897034, "phrase": "truthfinder"}, {"score": 0.00481495049065317, "phrase": "multiple_conflicting_information_providers"}, {"score": 0.0041287394089001405, "phrase": "different_websites"}, {"score": 0.003934970057482768, "phrase": "different_specifications"}, {"score": 0.003714368305523811, "phrase": "new_problem"}, {"score": 0.0036611833507914095, "phrase": "veracity"}, {"score": 0.0033900126423990823, "phrase": "large_amount"}, {"score": 0.003169222811082848, "phrase": "general_framework"}, {"score": 0.003123808471618783, "phrase": "veracity_problem"}, {"score": 0.002716915166374506, "phrase": "true_information"}, {"score": 0.002467536552997677, "phrase": "iterative_method"}, {"score": 0.002145942273032774, "phrase": "trustworthy_websites"}, {"score": 0.0021049977753042253, "phrase": "popular_search_engines"}], "paper_keywords": ["data quality", " Web mining", " link analysis"], "paper_abstract": "The World Wide Web has become the most important information source for most of us. Unfortunately, there is no guarantee for the correctness of information on the Web. Moreover, different websites often provide conflicting information on a subject, such as different specifications for the same product. In this paper, we propose a new problem, called Veracity, i.e., conformity to truth, which studies how to find true facts from a large amount of conflicting information on many subjects that is provided by various websites. We design a general framework for the Veracity problem and invent an algorithm, called TRUTHFINDER, which utilizes the relationships between websites and their information, i.e., a website is trustworthy if it provides many pieces of true information, and a piece of information is likely to be true if it is provided by many trustworthy websites. An iterative method is used to infer the trustworthiness of websites and the correctness of information from each other. Our experiments show that TRUTHFINDER successfully finds true facts among conflicting information and identifies trustworthy websites better than the popular search engines.", "paper_title": "Truth discovery with multiple conflicting information providers on the Web", "paper_id": "WOS:000254976900006"}