{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cell_tracking_algorithms"}, {"score": 0.0045726187330434025, "phrase": "multidimensional_time-lapse_fluorescence_microscopy"}, {"score": 0.004342430078306461, "phrase": "novel_framework"}, {"score": 0.0042928648367867835, "phrase": "objective_evaluation"}, {"score": 0.004030157055463817, "phrase": "ieee_international_symposium"}, {"score": 0.0039841418890102925, "phrase": "biomedical_imaging"}, {"score": 0.003372844338742438, "phrase": "future_uses"}, {"score": 0.003221316290858497, "phrase": "main_contributions"}, {"score": 0.003058944053868522, "phrase": "comprehensive_video_dataset_repository"}, {"score": 0.0029722900280316216, "phrase": "objective_measures"}, {"score": 0.002758273619951683, "phrase": "six_algorithms"}, {"score": 0.002294686545883412, "phrase": "single_winner"}, {"score": 0.0021049977753042253, "phrase": "individual_dataset"}], "paper_keywords": [""], "paper_abstract": "Motivation: Automatic tracking of cells in multidimensional time-lapse fluorescence microscopy is an important task in many biomedical applications. A novel framework for objective evaluation of cell tracking algorithms has been established under the auspices of the IEEE International Symposium on Biomedical Imaging 2013 Cell Tracking Challenge. In this article, we present the logistics, datasets, methods and results of the challenge and lay down the principles for future uses of this benchmark. Results: The main contributions of the challenge include the creation of a comprehensive video dataset repository and the definition of objective measures for comparison and ranking of the algorithms. With this benchmark, six algorithms covering a variety of segmentation and tracking paradigms have been compared and ranked based on their performance on both synthetic and real datasets. Given the diversity of the datasets, we do not declare a single winner of the challenge. Instead, we present and discuss the results for each individual dataset separately.", "paper_title": "A benchmark for comparison of cell tracking algorithms", "paper_id": "WOS:000337040200016"}