{"auto_keywords": [{"score": 0.04832675252243853, "phrase": "facebook"}, {"score": 0.015719223001355722, "phrase": "moderating_effect"}, {"score": 0.015527244874746087, "phrase": "big_five_personality_traits"}, {"score": 0.00469678464293492, "phrase": "individuals'_self-disclosure"}, {"score": 0.003378385493203297, "phrase": "east_asia"}, {"score": 0.0033159224502739247, "phrase": "partial_least_square_structural_equation_modeling_data_analysis_technique"}, {"score": 0.003039311963787733, "phrase": "particular_big_five_personality_traits"}, {"score": 0.0024595996811420566, "phrase": "new_experience"}, {"score": 0.0021580985506699105, "phrase": "personality_variables"}, {"score": 0.0021049977753042253, "phrase": "self-disclosure_phenomenon"}], "paper_keywords": [""], "paper_abstract": "The purpose of this study is to explore the moderating effect of Big Five personality traits on the relationship between the predictors (need for affiliation, need for popularity, and self-esteem) and self-disclosure on Facebook. The sample of this study is 354 Facebook users from 5 different cultures in East Asia. A partial least square structural equation modeling data analysis technique was performed to analyze the moderator research framework. This study demonstrates that particular Big Five personality traits moderate each relationship. Specifically, Conscientiousness and Emotional Stability negatively moderate the relationship between need for affiliation and self-disclosure. Agreeableness negatively moderates the relationship between self-esteem and self-disclosure. Openness to New Experience negatively moderates the relationship between need for popularity and self-disclosure. The study suggests the importance of the interaction of personality variables to better understand self-disclosure phenomenon on Facebook. The findings and implications of this study are discussed in the article.", "paper_title": "Need for Affiliation, Need for Popularity, Self-Esteem, and the Moderating Effect of Big Five Personality Traits Affecting Individuals' Self-Disclosure on Facebook", "paper_id": "WOS:000366280200008"}