{"auto_keywords": [{"score": 0.0406130609151156, "phrase": "restoration_probability"}, {"score": 0.00481495049065317, "phrase": "active_restoration-based_optical_networks"}, {"score": 0.0046938292389998824, "phrase": "active_restoration"}, {"score": 0.004592427776766215, "phrase": "novel_lightpath_restoration_scheme"}, {"score": 0.004428248351415723, "phrase": "wavelength-_division"}, {"score": 0.004348363291608004, "phrase": "optical_networks"}, {"score": 0.00430112267051817, "phrase": "reasonable_trade-"}, {"score": 0.004254393078576148, "phrase": "capacity_requirement"}, {"score": 0.004223521213460728, "phrase": "restoration_time"}, {"score": 0.0040873354289955605, "phrase": "comprehensive_performance_analysis"}, {"score": 0.004057671475485457, "phrase": "ar-"}, {"score": 0.004042919099733537, "phrase": "based_optical_networks"}, {"score": 0.0039268117782861696, "phrase": "novel_analytical_framework"}, {"score": 0.0035719191251314918, "phrase": "possible_correlation"}, {"score": 0.003296713221268488, "phrase": "backup_routes"}, {"score": 0.0031903162513050804, "phrase": "n_nodes"}, {"score": 0.003144134096095217, "phrase": "high_computation_complexity"}, {"score": 0.002737327060030586, "phrase": "simulated_restoration_probability"}, {"score": 0.0026586145364395544, "phrase": "extensive_simulation_results"}, {"score": 0.0025540577465264294, "phrase": "proposed_framework"}, {"score": 0.0024987660207458555, "phrase": "inherent_relationship"}, {"score": 0.0022072611570187334, "phrase": "related_areas"}, {"score": 0.002183230464873613, "phrase": "network_designers"}, {"score": 0.002159460831267798, "phrase": "quantitative_tool"}], "paper_keywords": ["network survivability", " restoration probability", " active restoration", " optical networks", " path correlation"], "paper_abstract": "Active restoration ( AR) is a novel lightpath restoration scheme proposed recently to guarantee a certain degree of survivability in wavelength- division multiplexing ( WDM) optical networks with a reasonable trade- off between capacity requirement and restoration time. In this paper, we conduct a comprehensive performance analysis for AR- based optical networks. In particular, we propose a novel analytical framework for modeling the restoration probability of a connection ( the probability that the connection can be successfully restored in case of a failure) when the possible correlation among its multiple backup routes is incorporated. Although theoretically, we need to consider all the possible correlations between as many as ((N)(2)) pairs of backup routes to analyze the restoration probability in a network with N nodes, and this high computation complexity may obscure the practicality of an approach, considering all the possible correlations among backup routes, our analysis in this paper indicates that by considering at most the possible correlations among any three successive backup routes of a connection, we can achieve a very good approximation to the simulated restoration probability of the connection, as verified by extensive simulation results upon two typical network topologies under various workloads. We find that the proposed framework can deeply investigate into the inherent relationship among restoration probability, wavelength channel utilization ratio, number of wavelengths per fiber, routes hop length, and wavelength conversion capability. As a result, the framework significantly contributes to the related areas by providing network designers with a quantitative tool to evaluate the restoration probability and, thus, the survivability of AR- based optical networks.", "paper_title": "Restoration probability modeling for active restoration-based optical networks with correlation among backup routes", "paper_id": "WOS:000249702800009"}