{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "crafty's_analysis"}, {"score": 0.004666228956744244, "phrase": "guid"}, {"score": 0.0046176782475198085, "phrase": "bratko"}, {"score": 0.004498490110526062, "phrase": "computer_analysis"}, {"score": 0.004382364826200616, "phrase": "world_chess_champions"}, {"score": 0.0040942189695983185, "phrase": "playing_strength"}, {"score": 0.004051595625804513, "phrase": "chess_players"}, {"score": 0.0040094142308666975, "phrase": "different_times"}, {"score": 0.003946960862020283, "phrase": "chess_program"}, {"score": 0.003926359151817743, "phrase": "crafty"}, {"score": 0.0037456980766939836, "phrase": "crafty's_official_chess_rating"}, {"score": 0.0025960262223338293, "phrase": "stronger_chess_program"}, {"score": 0.0022653055209664284, "phrase": "experimental_results"}, {"score": 0.002241679436497569, "phrase": "theoretical_explanations"}, {"score": 0.0021049977753042253, "phrase": "sensible_ranking"}], "paper_keywords": [""], "paper_abstract": "In 2006, Guid and Bratko, carried out a computer analysis of games played by World Chess Champions in all attempt to assess as objective as possible one aspect of the playing strength of chess players of different times. The chess program CRAFTY was used in the analysis. Given that CRAFTY'S Official chess rating is lower than the rating of many of the players analysed, the question arises to what degree that analysis Could he trusted. In this paper, we investigate this question and other aspects of the trustworthiness of those results. Our study shows that, at least for pairs of the players whose scores differ significantly, it is not very likely that their relative rankings would change if (1) a stronger chess program was used, or (2) if the program would search more deeply, or (3) larger sets of positions were available for the analysis. Experimental results and theoretical explanations are provided to show that, in order to obtain a sensible ranking of the players according to the criterion considered, it is not necessary to use a computer that is stronger than the players themselves.", "paper_title": "HOW TRUSTWORTHY IS CRAFTY'S ANALYSIS OF WORLD CHESS CHAMPIONS?", "paper_id": "WOS:000263788400001"}