{"auto_keywords": [{"score": 0.04734457699310803, "phrase": "xpath_queries"}, {"score": 0.008432563565628902, "phrase": "sql_queries"}, {"score": 0.00795316650048783, "phrase": "extended_xpath_expressions"}, {"score": 0.006692743390821087, "phrase": "xml_data"}, {"score": 0.005170109367370789, "phrase": "lfp_operator"}, {"score": 0.004814953827925868, "phrase": "xpath"}, {"score": 0.00468476935399643, "phrase": "recursive_dtds"}, {"score": 0.004365881789903319, "phrase": "schema-based_shredding"}, {"score": 0.0038969619124903884, "phrase": "new_approach"}, {"score": 0.003732526540522333, "phrase": "extended_xp_ath_expressions"}, {"score": 0.003688892770976908, "phrase": "simple_least_fixpoint"}, {"score": 0.003561017335579207, "phrase": "mild_extension"}, {"score": 0.0034375594065869032, "phrase": "single_input_relation"}, {"score": 0.0032158817866929563, "phrase": "dtd_recursion"}, {"score": 0.0031534367609709264, "phrase": "uniform_framework"}, {"score": 0.0030321497870310077, "phrase": "equivalent_sequence"}, {"score": 0.0026954938318408464, "phrase": "optimization_techniques"}, {"score": 0.0025715131759585052, "phrase": "large_class"}, {"score": 0.002349561762300369, "phrase": "existing_relational_query_optimization_techniques"}, {"score": 0.0022948742034852917, "phrase": "translation_algorithms"}, {"score": 0.0021807022596449527, "phrase": "xml_views"}], "paper_keywords": ["XML database", " XPath", " SQL", " Recursive DTD", " Query translation"], "paper_abstract": "We study the problem of evaluating xpath queries over xml data that is stored in an rdbms via schema-based shredding. The interaction between recursion (descendants-axis) in xpath queries and recursion in dtds makes it challenging to answer xpath queries using rdbms. We present a new approach to translating xpath queries into sql queries based on a notion of extended XP ath expressions and a simple least fixpoint (lfp) operator. Extended xpath expressions are a mild extension of xpath, and the lfp operator takes a single input relation and is already supported by most commercial rdbms. We show that extended xpath expressions are capable of capturing both dtd recursion and xpath queries in a uniform framework. Furthermore, they can be translated into an equivalent sequence of sql queries with the lfp operator. We present algorithms for rewriting xpath queries over a (possibly recursive) dtd into extended xpath expressions and for translating extended xpath expressions to sql queries, as well as optimization techniques. The novelty of our approach consists in its capability to answer a large class of xpath queries by means of only low-end rdbms features already available in most rdbms, as well as its flexibility to accommodate existing relational query optimization techniques. In addition, these translation algorithms provide a solution to query answering for certain (possibly recursive) xml views of xml data. Our experimental results verify the effectiveness of our techniques.", "paper_title": "Query translation from XPath to SQL in the presence of recursive DTDs", "paper_id": "WOS:000268548800002"}