{"auto_keywords": [{"score": 0.02484990241982236, "phrase": "topological_changes"}, {"score": 0.00481495049065317, "phrase": "large-scale_dynamic_networks"}, {"score": 0.004146716743362567, "phrase": "circulating_tokens"}, {"score": 0.003976007772514762, "phrase": "random_walk_traversal_scheme"}, {"score": 0.003587616378156851, "phrase": "cluster_expansion"}, {"score": 0.002989714021608139, "phrase": "obtained_clustering"}, {"score": 0.0027483472371835865, "phrase": "largest_possible_number"}, {"score": 0.002479579797152119, "phrase": "decentralized_control_algorithm"}, {"score": 0.002456486927713543, "phrase": "large_scale_networks"}, {"score": 0.0021049977753042253, "phrase": "adjacent_clusters"}], "paper_keywords": ["Distributed computing", " Distributed algorithms", " Clustering", " Random walks"], "paper_abstract": "We propose an algorithm that builds and maintains clusters over a network subject to mobility. This algorithm is fully decentralized and makes all the different clusters grow concurrently. The algorithm uses circulating tokens that collect data and move according to a random walk traversal scheme. Their task consists in (i) creating a cluster with the nodes it discovers and (ii) managing the cluster expansion; all decisions affecting the cluster are taken only by a node that owns the token. The size of each cluster is maintained higher than m nodes (m is a parameter of the algorithm). The obtained clustering is locally optimal in the sense that, with only a local view of each clusters, it computes the largest possible number of clusters (i.e. the sizes of the clusters are as close to m as possible). This algorithm is designed as a decentralized control algorithm for large scale networks and is mobility-adaptive: after a series of topological changes, the algorithm converges to a clustering. This recomputation only affects nodes in clusters where topological changes happened, and in adjacent clusters.", "paper_title": "A distributed clustering algorithm for large-scale dynamic networks", "paper_id": "WOS:000311507200002"}