{"auto_keywords": [{"score": 0.04549657143943836, "phrase": "object-based_attention_theory"}, {"score": 0.03130329552630277, "phrase": "object_saliency"}, {"score": 0.00481495049065317, "phrase": "novel_approach"}, {"score": 0.0047013405841819025, "phrase": "salient_object_detection"}, {"score": 0.00459039896577789, "phrase": "previous_salient_object_detectors"}, {"score": 0.004460703838987562, "phrase": "spotlight_attention_theory"}, {"score": 0.003809932244103758, "phrase": "connected_image_region"}, {"score": 0.0036845490951857617, "phrase": "plausible_object"}, {"score": 0.0033166379485150507, "phrase": "complex_image"}, {"score": 0.003043031131345537, "phrase": "salient_object"}, {"score": 0.002537097217899195, "phrase": "rare_or_outstanding_details"}, {"score": 0.0024652715040303416, "phrase": "integrated_saliency"}, {"score": 0.002350041573006264, "phrase": "complementary_characteristics"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Salient object detection", " Object-based visual attention theory", " Proto-objects"], "paper_abstract": "In this paper we propose a novel approach to the task of salient object detection. In contrast to previous salient object detectors that are based on a spotlight attention theory, we follow an object-based attention theory and incorporate the notion of an object directly into our saliency measurements. Particularly, we consider proto-objects as units of the analysis, where a proto-object is a connected image region that can be converted into a plausible object or object-part, once a focus of attention reaches it. As the object-based attention theory suggests, we start with segmenting a complex image into proto-objects and then assess saliency for each proto-object. The most salient proto-object is considered as being a salient object. We distinguish two types of object saliency. Firstly, an object is salient if it differs from its surrounding, which we call center-surround saliency. Secondly, an object is salient if it contains rare or outstanding details, which we measure by integrated saliency. We demonstrate that these two types of object saliency have complementary characteristics; moreover, the combination of the two performs at the level of state-of-the-art in salient object detection. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Salient object detection: From pixels to segments", "paper_id": "WOS:000314557100003"}