{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "attack_graph-based_security_metrics"}, {"score": 0.04417596194338471, "phrase": "security_policy"}, {"score": 0.00464811139983244, "phrase": "attack_graph"}, {"score": 0.0038964032225585117, "phrase": "security-relevant_aspects"}, {"score": 0.003558294449586273, "phrase": "path_lengths_metric"}, {"score": 0.003452218803245602, "phrase": "security-relevant_information"}, {"score": 0.0033832583769880576, "phrase": "one's_usage"}, {"score": 0.0032658649336454923, "phrase": "misleading_results"}, {"score": 0.002750934994181092, "phrase": "attack_effort"}, {"score": 0.0026959452932289797, "phrase": "attack_paths"}, {"score": 0.002563219920877287, "phrase": "complimentary_suite"}, {"score": 0.002524688179363081, "phrase": "graph-based_security_metrics"}, {"score": 0.0023405257495466352, "phrase": "simulated_results"}], "paper_keywords": ["Network-level security and protection", " measurement", " measurement techniques"], "paper_abstract": "The attack graph is an abstraction that reveals the ways an attacker can leverage vulnerabilities in a network to violate a security policy. When used with attack graph-based security metrics, the attack graph may be used to quantitatively assess security-relevant aspects of a network. The Shortest Path metric, the Number of Paths metric, and the Mean of Path Lengths metric are three attack graph-based security metrics that can extract security-relevant information. However, one's usage of these metrics can lead to misleading results. The Shortest Path metric and the Mean of Path Lengths metric fail to adequately account for the number of ways an attacker may violate a security policy. The Number of Paths metric fails to adequately account for the attack effort associated with the attack paths. To overcome these shortcomings, we propose a complimentary suite of attack graph-based security metrics and specify an algorithm for combining the usage of these metrics. We present simulated results that suggest that our approach reaches a conclusion about which of two attack graphs correspond to a network that is most secure in many instances.", "paper_title": "Extending Attack Graph-Based Security Metrics and Aggregating Their Application", "paper_id": "WOS:000297068400007"}