{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "information_stored"}, {"score": 0.004785356349906913, "phrase": "audio_documents"}, {"score": 0.004736434518535051, "phrase": "hypertextual_structures"}, {"score": 0.004678384952779725, "phrase": "humanities_electronic_critical_editions"}, {"score": 0.004362564831572539, "phrase": "linking_mechanisms"}, {"score": 0.004256243266481051, "phrase": "encoding_models"}, {"score": 0.004238775572746022, "phrase": "lack_separation"}, {"score": 0.0038482230717028425, "phrase": "charming_hypermedia"}, {"score": 0.003824547895167011, "phrase": "music_audio_documents"}, {"score": 0.00370833093475637, "phrase": "audio_memories"}, {"score": 0.0036402965997795536, "phrase": "cooperation_activities"}, {"score": 0.003625347557965931, "phrase": "different_classes"}, {"score": 0.0035661605757956096, "phrase": "new_virtual_hyperdocuments"}, {"score": 0.0035515148917169173, "phrase": "dynamic_views"}, {"score": 0.003479180627368156, "phrase": "electro-acoustic_music"}, {"score": 0.0034435659355507584, "phrase": "ethno_music_events"}, {"score": 0.0034083145672246067, "phrase": "vannevar_bush's_point"}, {"score": 0.003332022369746407, "phrase": "preconceived_limitations"}, {"score": 0.0032979090806670493, "phrase": "different_media"}, {"score": 0.003230723298995081, "phrase": "room_programs"}, {"score": 0.0032174507570710835, "phrase": "critical_reviews"}, {"score": 0.003204232566468624, "phrase": "setting_photos"}, {"score": 0.0031910685060552485, "phrase": "sound_recordings"}, {"score": 0.003177958355586418, "phrase": "video_shootings"}, {"score": 0.0030686679245324837, "phrase": "million_volumes"}, {"score": 0.002523420125608051, "phrase": "new_path"}, {"score": 0.002507874930057507, "phrase": "human_mind"}, {"score": 0.0023286189802213604, "phrase": "intricate_web"}, {"score": 0.002239225269052105, "phrase": "mental_process"}, {"score": 0.0021049977753042253, "phrase": "vannevar_bush"}], "paper_keywords": [""], "paper_abstract": "The use of hypertextual structures has become very popular in humanities electronic critical editions. It provides a way of making connections between pieces of information, thus modelling what many humanities scholars actually do. Because hypertext has been popularized by the World Wide Web more than anything else, the linking mechanisms are fairly weak. Actually, there are two main open issues: the encoding models used lack separation between structure and content; and in recent years a strong request to handle various media (text, images, audio and video) has emerged. Thus, it is now time to take one step further: in this paper, we describe PSYCHO-MAD, a Powerful SYstem with Charming Hypermedia Objects for Music Audio Documents, a not-hierarchical hypermedia model for handling the information stored in the audio memories based on an extension of zz-structures. The cooperation activities of different classes of actors allow the user to create new virtual hyperdocuments and dynamic views (useful, for example, in performance of electro-acoustic music open work or in ethno music events). By adopting Vannevar Bush's point of view, the model herein elaborated connects, without preconceived limitations, documents stored in different media: annotations made by the author, scores, room programs, critical reviews, setting photos, sound recordings and video shootings. The Encyclopedia Britannica could be reduced to the volume of a matchbox. A library of a million volumes could be compressed into one end of a desk. [...] Mere compression, of course, is not enough; one needs not only to make and store a record but also to be able to consult it. [...] Our ineptitude in getting at the record is largely caused by the artificiality of systems of indexing. [...] One has to have rules as to which path will locate it, and the rules are cumbersome. Having found one item, moreover, one has to emerge from the system and re-enter on a new path. The human mind does not work that way. It operates by association. With one item in its grasp, it snaps instantly to the next that is suggested by the association of thoughts, in accordance with some intricate web of trails carried by the cells of the brain. Man cannot hope fully to duplicate this mental process artificially, but he certainly ought to be able to learn from it. Selection by association, rather than by indexing, may yet be mechanized. (Vannevar Bush, 1945, p.3).", "paper_title": "The Past Through the Future: A Hypermedia Model for Handling the Information Stored in the Audio Documents", "paper_id": "WOS:000274674900004"}