{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "global_illumination"}, {"score": 0.006929622300769184, "phrase": "novice_users"}, {"score": 0.006349830415922439, "phrase": "large_area_lights"}, {"score": 0.00471071771178029, "phrase": "lighting_design_tasks"}, {"score": 0.004459857205489101, "phrase": "computer-generated_imagery"}, {"score": 0.004199247711875386, "phrase": "digital_lighting_artists"}, {"score": 0.003910740988145338, "phrase": "lighting_design_workflows"}, {"score": 0.003661987063211563, "phrase": "user_study"}, {"score": 0.0034478392374444177, "phrase": "non-physical_fill_lights"}, {"score": 0.0031411751440831165, "phrase": "collected_data"}, {"score": 0.002522662955545598, "phrase": "lighting_setups"}, {"score": 0.0023749823753904204, "phrase": "fill_lights"}, {"score": 0.002128220632893247, "phrase": "lighting_design_tools"}, {"score": 0.0021049977753042253, "phrase": "non-expert_users"}], "paper_keywords": ["Global illumination", " lighting design", " user study"], "paper_abstract": "Thanks to its ability to improve the realism of computer-generated imagery, the use of global illumination has recently become widespread among digital lighting artists. It remains unclear, though, what impact it has on the lighting design workflows, especially for novice users. In this paper we present a user study which investigates the use of global illumination, large area lights, and non-physical fill lights in lighting design tasks, where 26 novice subjects design lighting with these tools. The collected data suggest that global illumination is not significantly harder to control for novice users that direct illumination, and when given the possibility, most users opt to use it in their designs. The use of global illumination together with large area lights leads to simpler lighting setups with fewer non-physical fill lights. Interestingly, global illumination does not supersede fill lights: users still include them into their globally illuminated lighting setups. We believe that our results will find use in the development of lighting design tools for non-expert users.", "paper_title": "Toward Evaluating the Usefulness of Global Illumination for Novices in Lighting Design Tasks", "paper_id": "WOS:000338121300012"}