{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "uncontrollable_variables"}, {"score": 0.00449859196755507, "phrase": "soft_constraints"}, {"score": 0.004387329529902255, "phrase": "quantitative_preferences"}, {"score": 0.003829455440282146, "phrase": "possibility_distribution"}, {"score": 0.0036947814248579243, "phrase": "imprecise_probabilities"}, {"score": 0.003306559295382181, "phrase": "high_preference"}, {"score": 0.0031902155632863236, "phrase": "uncontrollable_part"}, {"score": 0.0030889995517870525, "phrase": "existing_approach"}, {"score": 0.0030450484042676023, "phrase": "uncertain_part"}, {"score": 0.002937879003671346, "phrase": "remaining_part"}, {"score": 0.002875391177926809, "phrase": "resulting_problem"}, {"score": 0.002804161833785297, "phrase": "specific_methods"}, {"score": 0.0026573974912563014, "phrase": "problem's_solutions"}, {"score": 0.0025455220351023465, "phrase": "specific_method"}, {"score": 0.0024036292057373803, "phrase": "different_attitudes"}, {"score": 0.0023189818169615135, "phrase": "desirable_properties"}, {"score": 0.0022615046141708987, "phrase": "considered_semantics"}, {"score": 0.0021201492891323587, "phrase": "experimental_results"}], "paper_keywords": ["constraint programming", " preferences", " uncertainty", " possibility theory"], "paper_abstract": "Preferences and uncertainty are common in many real-life problems. In this article, we consider preferences modelled via soft constraints that allow for the representation of quantitative preferences. Moreover, we consider uncertainty modelled via uncontrollable variables, that is, variables whose value cannot be decided by us. We also assume that some information is provided for such variables in the form of a possibility distribution over their domains. Possibilities provide a way to model imprecise probabilities, and give us a way to know which values are more possible than others for the uncontrollable variables. For such problems, the aim is to find a solution with a high preference which is also very robust with respect to the uncontrollable part. To tackle such problems, we adopt an existing approach that eliminates the uncertain part of the problem while adding some constraints in the remaining part, and then solves the resulting problem. However, contrarily to the specific methods present in the literature, we formulate several desirable properties, on the robustness of the problem's solutions and its relationship with their preferences, that should be satisfied by any specific method based on this approach. We also define several semantics to order the solutions according to different attitudes to risk, and we discuss which of the desirable properties are satisfied by each of the considered semantics. Finally, we present a solver for this kind of problems, and we show some experimental results of its application over the classes of such problems.", "paper_title": "Soft constraint problems with uncontrollable variables", "paper_id": "WOS:000283880900001"}