{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_commitments"}, {"score": 0.010549411880674882, "phrase": "multi-agent_systems"}, {"score": 0.007465456514186716, "phrase": "new_logic"}, {"score": 0.004672953146379813, "phrase": "considerable_attention"}, {"score": 0.004548723130053278, "phrase": "multi-agent_communication"}, {"score": 0.00396330930564811, "phrase": "ctlk_logic"}, {"score": 0.0039043835848369215, "phrase": "ctl_logic"}, {"score": 0.003800507899554071, "phrase": "ctlc_logic"}, {"score": 0.003744005641287831, "phrase": "ctl"}, {"score": 0.0035901685646972585, "phrase": "logical_relationship"}, {"score": 0.0034841647157189985, "phrase": "ctlkc."}, {"score": 0.0029901699209266435, "phrase": "current_versions"}, {"score": 0.002910545717767559, "phrase": "logical_language"}, {"score": 0.0028758391869611374, "phrase": "fundamental_intuitions"}, {"score": 0.0027575842698911173, "phrase": "identified_paradoxes"}, {"score": 0.0026521229155782654, "phrase": "consistent_manner"}, {"score": 0.0024604876113911173, "phrase": "generalized_version"}, {"score": 0.002445767214680791, "phrase": "ctlau"}, {"score": 0.0024311346712789553, "phrase": "action_formulae"}, {"score": 0.0023592715993204796, "phrase": "cwb-nc"}, {"score": 0.0022352169832099153, "phrase": "computational_complexity"}, {"score": 0.0021887745177678066, "phrase": "pspace"}, {"score": 0.00216263228969761, "phrase": "concurrent_programs"}, {"score": 0.002117671634080862, "phrase": "ctlk"}, {"score": 0.0021049977753042253, "phrase": "ctlc"}], "paper_keywords": ["Multi-agent systems", " Social commitments", " Agent communication", " Knowledge"], "paper_abstract": "Both knowledge and social commitments have received considerable attention in Multi-Agent Systems (MASs), specially for multi-agent communication. Plenty of work has been carried out to define their semantics. However, the relationship between social commitments and knowledge has not been investigated yet. In this paper, we aim to explore such a relationship from the semantics and model checking perspectives with respect to CTLK logic (an extension of CTL logic with modality for reasoning about knowledge) and CTLC logic (an extension of CTL with modalities for reasoning about commitments and their fulfillments). To analyze this logical relationship, we simply combine the two logics in one new logic named CTLKC. The purpose of such a combination is not to advocate a new logic, but only to express and figure out some reasoning postulates merging both knowledge and commitments as they are currently defined in the literature. By so doing, we identify some paradoxes in the new logic showing that simply combining current versions of commitment and knowledge logics results in a logical language that violates some fundamental intuitions. Consequently, we propose CTLKC+, a new logic that fixes the identified paradoxes and allows us to reason about social commitments and knowledge simultaneously in a consistent manner. Furthermore, we address the problem of model checking CTLKC+ by reducing it to the problem of model checking GCTL(au), a generalized version of CTLau with action formulae. By doing so, we directly benefit from CWB-NC, the model checker of GCTL(au). Using this reduction, we also prove that the computational complexity of model checking CTLKC+ is still PSPACE-complete for concurrent programs as the complexity of model checking CTLK and CTLC separately.", "paper_title": "On the interaction between knowledge and social commitments in multi-agent systems", "paper_id": "WOS:000338214100016"}