{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "housing_growth"}, {"score": 0.008644089871301898, "phrase": "census_boundaries"}, {"score": 0.006446149420533387, "phrase": "housing_density"}, {"score": 0.005228570684095449, "phrase": "dasymetric_approach"}, {"score": 0.0046621835537196754, "phrase": "primary_source"}, {"score": 0.004624751696958501, "phrase": "spatially_explicit_social_data"}, {"score": 0.0045691640746165045, "phrase": "changing_block_boundaries"}, {"score": 0.0043358695338488445, "phrase": "housing_density_data"}, {"score": 0.004301046274139699, "phrase": "census_block_boundaries"}, {"score": 0.004164516065972361, "phrase": "analytical_methods"}, {"score": 0.004064960481993859, "phrase": "oregon"}, {"score": 0.003417565253539315, "phrase": "housing_structures"}, {"score": 0.003308986613384597, "phrase": "aggregated_boundaries"}, {"score": 0.0030646951765987414, "phrase": "housing_density_change_map"}, {"score": 0.0025866199378466754, "phrase": "conservative_change_estimates"}, {"score": 0.0025554669315362424, "phrase": "fine_resolution"}, {"score": 0.0022546720211200893, "phrase": "novel_approach"}, {"score": 0.0021049977753042253, "phrase": "uniquely_persistent_nature"}], "paper_keywords": ["US Census", " Housing density", " Interpolation", " MAUP", " Census boundary", " Land use", " land cover change"], "paper_abstract": "The US Census provides the primary source of spatially explicit social data, but changing block boundaries complicate analyses of housing growth over time. We compared procedures for reconciling housing density data between 1990 and 2000 census block boundaries in order to assess the sensitivity of analytical methods to estimates of housing growth in Oregon. Estimates of housing growth varied substantially and were sensitive to the method of interpolation. With no processing and areal-weighted interpolation, more than 35% of the landscape changed; 75-80% of this change was due to decline in housing density. This decline was implausible, however, because housing structures generally persist over time. Based on aggregated boundaries, 11% of the landscape changed, but only 4% experienced a decline in housing density. Nevertheless, the housing density change map was almost twice as coarse spatially as the 2000 housing density data. We also applied a dasymetric approach to redistribute 1990 housing data into 2000 census boundaries under the assumption that the distribution of housing in 2000 reflected the same distribution as in 1990. The dasymetric approach resulted in conservative change estimates at a fine resolution. All methods involved some type of trade-off (e.g. analytical difficulty, data resolution, magnitude or bias in direction of change). However, our dasymetric procedure is a novel approach for assessing housing growth over changing census boundaries that may be particularly useful because it accounts for the uniquely persistent nature of housing over time.", "paper_title": "Assessing housing growth when census boundaries change", "paper_id": "WOS:000268937500003"}