{"auto_keywords": [{"score": 0.048450141536466075, "phrase": "signal_recording"}, {"score": 0.00481662464032084, "phrase": "silicon"}, {"score": 0.004284107956158868, "phrase": "mea"}, {"score": 0.00374610869916551, "phrase": "accessing_modes"}, {"score": 0.0035564156572789473, "phrase": "total_mea"}, {"score": 0.003332704619499476, "phrase": "silicon-based_semiconductor_process"}, {"score": 0.003205268682789165, "phrase": "specially_designed_printed-circuit-board"}, {"score": 0.0030960762496815768, "phrase": "culture_chamber"}, {"score": 0.0030560920414081645, "phrase": "impedance_measurement"}, {"score": 0.0029647862293448895, "phrase": "electrical_characteristics"}, {"score": 0.0026603411931700556, "phrase": "extracellular_signal_recording_experiment"}, {"score": 0.0024078737745407614, "phrase": "extracellular_action"}, {"score": 0.0023974563359295043, "phrase": "potential_recording"}, {"score": 0.0023767561522363367, "phrase": "extracellular_electrical_stimulation"}, {"score": 0.0023562342764987254, "phrase": "recording_experiments"}, {"score": 0.002207851585508636, "phrase": "extracellular_stimulation"}, {"score": 0.002169882514603539, "phrase": "simultaneous_stimulation"}], "paper_keywords": ["microelectrode arrays (MEAs)", " extracellular recording", " stimulation and recording", " neurons network", " in vitro"], "paper_abstract": "Microelectrode arrays (MEAs) for stimulation and signal recording of in vitro cultured neurons are presented. Each MEA is composed of 60 independent electrodes with 59 working ones and one reference one. These electrodes are divided into 30 pairs. Through each pair of electrodes, four independent states can be realized to define the accessing modes of neurons cultured on the surface of the electrodes. A total MEA covers an area of 10 mm x 10 mm. MEAs are fabricated in a silicon-based semiconductor process. An implemented MEA is bonded on a specially designed printed-circuit-board (PCB) and surrounded by a culture chamber. An impedance measurement has been made to verify the electrical characteristics of MEAs. The surface was modified to enhance the biocompatibility. A series of PC12 cells culture experiments validates the effectiveness of the modification. An extracellular signal recording experiment with acetylcholine (Ach) as a stimulant has been carried out, and the results show the feasibility of MEAs for extracellular action potential recording. Extracellular electrical stimulation and recording experiments have been carried out too. They indicate that MEAs can be used for extracellular stimulation, recording, simultaneous stimulation and recording, and isolation of PC12 cells network cultured in vitro.", "paper_title": "Silicon-based microelectrode arrays for stimulation and signal recording of in vitro cultured neurons", "paper_id": "WOS:000297023300019"}