{"auto_keywords": [{"score": 0.04620806161387104, "phrase": "lorenz-mie_theory"}, {"score": 0.00789722846327663, "phrase": "spherical_particles"}, {"score": 0.00481495049065317, "phrase": "physically-based_model"}, {"score": 0.004697308822154191, "phrase": "previous_techniques"}, {"score": 0.004150661689086371, "phrase": "optical_effects"}, {"score": 0.0034386894664467003, "phrase": "real_raindrops"}, {"score": 0.0033214855341753544, "phrase": "larger_raindrops"}, {"score": 0.0032402142645120958, "phrase": "first_comprehensive_technique"}, {"score": 0.003053159610975692, "phrase": "physically-based_water_drop_shape"}, {"score": 0.002605329434787829, "phrase": "accurate_simulation"}, {"score": 0.002579622880371082, "phrase": "nonspherical_particles"}, {"score": 0.002454835845644037, "phrase": "supernumerary_bows"}, {"score": 0.0022010965931147735, "phrase": "rare_twinned_rainbow"}, {"score": 0.0021049977753042253, "phrase": "nonspherical_water_drops"}], "paper_keywords": ["Design", " Theory", " Verification", " Rainbows", " Lorenz-Mie theory", " optical properties", " phase function", " appearance modeling", " realistic rendering"], "paper_abstract": "In this article, we derive a physically-based model for simulating rainbows. Previous techniques for simulating rainbows have used either geometric optics (ray tracing) or Lorenz-Mie theory. Lorenz-Mie theory is by far the most accurate technique as it takes into account optical effects such as dispersion, polarization, interference, and diffraction. These effects are critical for simulating rainbows accurately. However, as Lorenz-Mie theory is restricted to scattering by spherical particles, it cannot be applied to real raindrops which are nonspherical, especially for larger raindrops. We present the first comprehensive technique for simulating the interaction of a wavefront of light with a physically-based water drop shape. Our technique is based on ray tracing extended to account for dispersion, polarization, interference, and diffraction. Our model matches Lorenz-Mie theory for spherical particles, but it also enables the accurate simulation of nonspherical particles. It can simulate many different rainbow phenomena including double rainbows and supernumerary bows. We show how the nonspherical raindrops influence the shape of the rainbows, and we provide a simulation of the rare twinned rainbow, which is believed to be caused by nonspherical water drops.", "paper_title": "Physically-Based Simulation of Rainbows", "paper_id": "WOS:000300622500003"}