{"auto_keywords": [{"score": 0.04539190749928413, "phrase": "competitive_environment"}, {"score": 0.03121217513999791, "phrase": "processor_owner"}, {"score": 0.025308577446368247, "phrase": "truthful_mechanisms"}, {"score": 0.00481495049065317, "phrase": "single_processor"}, {"score": 0.004770211811866158, "phrase": "sporadic_tasks"}, {"score": 0.004725886853744007, "phrase": "competitive_real-time_environments"}, {"score": 0.004185632403886255, "phrase": "shared_single_processor"}, {"score": 0.0038301525703886585, "phrase": "feasible_subset"}, {"score": 0.0036382660173943393, "phrase": "selected_tasks"}, {"score": 0.0035542408902458677, "phrase": "dynamic-priority_and_static-priority_scheduling_algorithms"}, {"score": 0.0033919477901198716, "phrase": "non-competitive_settings"}, {"score": 0.0032370412139943808, "phrase": "economic_setting"}, {"score": 0.0031036643805367487, "phrase": "selfish_agent"}, {"score": 0.002300734266971646, "phrase": "agents'_best_interest"}, {"score": 0.0022580713471027996, "phrase": "true_characteristics"}], "paper_keywords": ["Earliest-deadline first", " rate-monotonic", " sporadic task systems", " competitive environments", " mechanism design", " frugality"], "paper_abstract": "In a non-competitive environment, sporadic real-time task scheduling on a single processor is well understood. In this paper, we consider a competitive environment comprising several real-time tasks vying for execution upon a shared single processor. Each task obtains a value if the processor successfully schedules all its jobs. Our objective is to select a feasible subset of these tasks to maximize the sum of values of selected tasks. We consider both dynamic-priority and static-priority scheduling algorithms. There are algorithms for solving these problems in non-competitive settings. However, we consider these problems in an economic setting in which each task is owned by a selfish agent. Each agent reports the characteristics of her own task to the processor owner. The processor owner uses a mechanism to allocate the processor to a subset of agents and to determine the payment of each agent. Since agents are selfish, they may try to manipulate the mechanism to obtain the processor. We are interested in truthful mechanisms in which it is always in agents' best interest to report the true characteristics of their tasks. We design exact and approximate truthful mechanisms for this competitive environment and study their performance.", "paper_title": "Truthful Mechanisms for Allocating a Single Processor to Sporadic Tasks in Competitive Real-Time Environments", "paper_id": "WOS:000341523800019"}