{"auto_keywords": [{"score": 0.04119907429533016, "phrase": "better_use"}, {"score": 0.04095863380675144, "phrase": "short_contacts"}, {"score": 0.00481495049065317, "phrase": "large_multimedia_contents"}, {"score": 0.00478579024367007, "phrase": "opportunistic_networks"}, {"score": 0.004742379087286591, "phrase": "common_assumption"}, {"score": 0.004558748120167778, "phrase": "required_amount"}, {"score": 0.004435782384431224, "phrase": "analytical_purposes"}, {"score": 0.0038805454197432337, "phrase": "progressive_dissemination"}, {"score": 0.003857022173615399, "phrase": "large_contents_data_pieces"}, {"score": 0.003822003373331997, "phrase": "main_question"}, {"score": 0.0037529131348732715, "phrase": "best_strategy"}, {"score": 0.0035855828944304506, "phrase": "small_pieces"}, {"score": 0.0031459887611258765, "phrase": "global_goodput"}, {"score": 0.0030239842475439814, "phrase": "shortest_contact"}, {"score": 0.0029066973917258655, "phrase": "real-world_traces"}, {"score": 0.0028628046285909276, "phrase": "reasonable_header_size"}, {"score": 0.0028367868542874763, "phrase": "piece_size"}, {"score": 0.0027769919995947676, "phrase": "large_range"}, {"score": 0.002392188222609101, "phrase": "intermittently-connected_networks"}, {"score": 0.0023560464785206095, "phrase": "sequential_and_randomized_solutions"}, {"score": 0.0022371907579775796, "phrase": "full_dissemination"}, {"score": 0.0022101055924375725, "phrase": "effective_contacts"}, {"score": 0.002183592060832816, "phrase": "pacs"}, {"score": 0.0021700901058417602, "phrase": "performance_levels"}, {"score": 0.002124318196932935, "phrase": "centralized_oracle-based_solution"}], "paper_keywords": ["Intermittently-connected mobile networks", " Multimedia content dissemination", " Peer-to-peer"], "paper_abstract": "A common assumption in intermittently-connected (or opportunistic) mobile networks is that any contact has enough capacity to transfer the required amount of data. Although such an assumption is reasonable for analytical purposes and when contents are small, it does not hold anymore when users produce contents that are larger than the capacity of a contact. In such a case, users must slice data and send fragments separately, which allows better use of short contacts and progressive dissemination of large contents data pieces. The main question here is to design the best strategy for deciding which piece(s) to transmit whenever nodes meet. In addition, although small pieces imply a better use of short contacts, they generate more overhead due to the headers required at each piece. In this paper, we investigate these two issues: piece size selection and piece selection strategy. First, we theoretically define the global goodput of the system that defines the tradeoff between the size of the shortest contact that can be considered as useful and piece overhead. Results from real-world traces show that, for reasonable header size, the piece size can be selected out of a large range of values without significantly impacting the results. Second, we present the design and evaluation of PACS (Prevalence-Aware Content Spreading), a completely distributed algorithm that selects pieces to transfer based on their popularity. We evaluate the performance of PACS using both synthetic and real traces from intermittently-connected networks. When compared with sequential and randomized solutions, we show that PACS significantly outperforms these approaches both in terms of latency to achieve full dissemination and ratio of effective contacts. Moreover, PACS achieves performance levels that are extremely close to a centralized oracle-based solution. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Part-whole dissemination of large multimedia contents in opportunistic networks", "paper_id": "WOS:000309697000003"}