{"auto_keywords": [{"score": 0.04878556281654673, "phrase": "hierarchical_neighbor_graphs"}, {"score": 0.010612387000973441, "phrase": "data_collection"}, {"score": 0.009958964609799253, "phrase": "wireless_sensor_networks"}, {"score": 0.007581342677837011, "phrase": "battery_power"}, {"score": 0.004771196027464407, "phrase": "heterogeneous_wireless_sensor_networks"}, {"score": 0.0043947942344037105, "phrase": "randomized_one"}, {"score": 0.004315249628884236, "phrase": "single_parameter"}, {"score": 0.0036275736378775757, "phrase": "minimal_computation"}, {"score": 0.003177235604998673, "phrase": "heavily_utilized_nodes"}, {"score": 0.003105428650735113, "phrase": "global_coordination"}, {"score": 0.0028731719610706214, "phrase": "analytical_characterizations"}, {"score": 0.0027573101010593863, "phrase": "extensive_simulations"}, {"score": 0.0025981315738078793, "phrase": "parameter_p"}, {"score": 0.0025162511343171, "phrase": "application-specific_data_aggregation_policies"}, {"score": 0.002275299774554847, "phrase": "better_lifetime_values"}, {"score": 0.002163600705898299, "phrase": "heterogeneous_distributions"}, {"score": 0.0021438877099090262, "phrase": "initial_battery_power"}, {"score": 0.0021049977753042253, "phrase": "previous_proposals"}], "paper_keywords": [""], "paper_abstract": "We introduce hierarchical neighbor graphs, a new topology control mechanism for wireless sensor networks. This mechanism is a randomized one that takes a single parameter, 0 < p < 1, and uses it to build a structure that is fully distributed in the sense that it requires only local knowledge at each node to be formed and repaired, and moreover requires minimal computation in this process. Hierarchical neighbor graphs naturally account for differences in the battery power of nodes and are able to use energy efficiently by reorganizing dynamically when the battery power of heavily utilized nodes decreases, without any global coordination or communication. In this paper we study the lifetime and delay of hierarchical neighbor graphs, giving analytical characterizations of both. We present the results of extensive simulations that demonstrate how the lifetime and delay vary with various network parameters and the parameter p, also studying the effects of application-specific data aggregation policies. Through this simulation study we compare hierarchical neighbor graphs against other leading proposals for data collection in wireless sensor networks and demonstrate that in general our structure provides better lifetime values, and, importantly, is able to deal with heterogeneous distributions of initial battery power much better than previous proposals.", "paper_title": "Hierarchical Neighbor Graphs: A Topology Control Mechanism for Data Collection in Heterogeneous Wireless Sensor Networks", "paper_id": "WOS:000353362200008"}