{"auto_keywords": [{"score": 0.03801964087844912, "phrase": "perceptual_judgments"}, {"score": 0.025675923378322106, "phrase": "measurement_correlations"}, {"score": 0.025191786369706204, "phrase": "strong_impact"}, {"score": 0.00481495049065317, "phrase": "visual_decisions"}, {"score": 0.004454691230204595, "phrase": "noisy_sensory_input"}, {"score": 0.0038876302202924644, "phrase": "differing_complexity"}, {"score": 0.003775803846431323, "phrase": "statistical_structure"}, {"score": 0.0036671822784770463, "phrase": "perceptual_measurement_noise"}, {"score": 0.0033433365160336842, "phrase": "stimulusstimulus_correlationstogether"}, {"score": 0.003278878522165815, "phrase": "sensory_noise"}, {"score": 0.00323134923196813, "phrase": "decision_making"}, {"score": 0.0029892206557359836, "phrase": "single_or_multiple_targets"}, {"score": 0.0028471655497661528, "phrase": "observer's_measurements"}, {"score": 0.0026986685585382347, "phrase": "optimal_observer"}, {"score": 0.0023091721866305426, "phrase": "distractor_correlations"}, {"score": 0.002125612498781805, "phrase": "neural_responses"}, {"score": 0.0021049977753042253, "phrase": "structured_stimuli"}], "paper_keywords": [""], "paper_abstract": "Humans and other animals base their decisions on noisy sensory input. Much work has been devoted to understanding the computations that underlie such decisions. The problem has been studied in a variety of tasks and with stimuli of differing complexity. However, how the statistical structure of stimuli, along with perceptual measurement noise, affects perceptual judgments is not well understood. Here we examine how correlations between the components of a stimulusstimulus correlationstogether with correlations in sensory noise, affect decision making. As an example, we consider the task of detecting the presence of a single or multiple targets among distractors. We assume that both the distractors and the observer's measurements of the stimuli are correlated. The computations of an optimal observer in this task are nontrivial yet can be analyzed and understood intuitively. We find that when distractors are strongly correlated, measurement correlations can have a strong impact on performance. When distractor correlations are weak, measurement correlations have little impact unless the number of stimuli is large. Correlations in neural responses to structured stimuli can therefore have a strong impact on perceptual judgments.", "paper_title": "Visual Decisions in the Presence of Measurement and Stimulus Correlations", "paper_id": "WOS:000364397200002"}