{"auto_keywords": [{"score": 0.042719936267923087, "phrase": "shortest_path"}, {"score": 0.015719716506582538, "phrase": "smooth_surface_s"}, {"score": 0.004756161254039343, "phrase": "nearby_triangulations"}, {"score": 0.0038950888505884687, "phrase": "curve_c"}, {"score": 0.0038004655673708016, "phrase": "limit_curve_c"}, {"score": 0.002811418334221172, "phrase": "planar_curve"}, {"score": 0.0026517384677659027, "phrase": "second_step"}, {"score": 0.0026112423766508543, "phrase": "positive_result"}, {"score": 0.0025555820461269, "phrase": "additional_assumptions"}, {"score": 0.0023517568875393345, "phrase": "different_subdivision_surfaces"}, {"score": 0.002301614895279686, "phrase": "bezier_surfaces"}, {"score": 0.0022804533290324944, "phrase": "catmull-clark_schemes"}, {"score": 0.0022456145616178346, "phrase": "extraordinary_vertices"}, {"score": 0.002177522137110944, "phrase": "existing_algorithm"}, {"score": 0.002144252482711611, "phrase": "subdivision_surfaces"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Subdivision surfaces", " Triangulations", " PL-surfaces", " Geodesics", " Shortest paths", " Convergence"], "paper_abstract": "Is it possible to approximate a geodesic on a smooth surface S by geodesics on nearby triangulations (i.e. on piecewise linear Surfaces)? In other words, given a sequence (T(n))(n is an element of N) of triangulations whose points and normals converge to those of a smooth surface S, if C(n) is a geodesic of T(n) (i.e. it is locally a shortest path) and if (C(n))(n is an element of N) converges to a Curve C, we want to know if the limit curve C is a geodesic of S. It is already known that if C(n) is a shortest path, then C is also a shortest path. The result does not hold anymore for geodesics that are not (global) shortest paths. In this paper, we first provide a counter-example for geodesics: we build a sequence (T(n))(n is an element of N) of triangulations whose points and normals converge to those of a plane. On each T(n), we build a geodesic C(n), such that (C(n))(n is an element of N) converges to a planar curve which is not a line-segment (and thus not a geodesic of the plane). In a second step. we give a positive result of convergence for geodesics that needs additional assumptions concerning the rate of convergence of the normals and of the lengths of the edges of the triangulations. Finally, we apply this result to different subdivision surfaces (following schemes for B-splines, Bezier surfaces, or Catmull-Clark schemes assuming that geodesics avoid extraordinary vertices). In particular, these results validate an existing algorithm that builds geodesics on subdivision surfaces. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Convergence of geodesics on triangulations", "paper_id": "WOS:000265813300005"}