{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "industrial_relevance"}, {"score": 0.023041556420136243, "phrase": "technology_evaluations"}, {"score": 0.01006586385092368, "phrase": "software_engineering"}, {"score": 0.00467905143301368, "phrase": "main_goals"}, {"score": 0.004621984064678252, "phrase": "applied_research_field"}, {"score": 0.00447316895126645, "phrase": "widespread_use"}, {"score": 0.004436716583179764, "phrase": "research_results"}, {"score": 0.004224130367280183, "phrase": "tangible_evidence"}, {"score": 0.004021689117050817, "phrase": "trough_step-wise_validation"}, {"score": 0.003782174375003052, "phrase": "real_settings"}, {"score": 0.003751331782523201, "phrase": "real_users"}, {"score": 0.0036008372531664726, "phrase": "detailed_information"}, {"score": 0.00347054319869429, "phrase": "rich_decision_support_material"}, {"score": 0.003372460634140967, "phrase": "new_technologies"}, {"score": 0.003290591812800382, "phrase": "empirical_basis"}, {"score": 0.003223883109446599, "phrase": "new_or_refined_technologies"}, {"score": 0.0029100272315053253, "phrase": "comprehensive_systematic_literature_review"}, {"score": 0.0028510114763213596, "phrase": "engineering_technologies"}, {"score": 0.0028161764476743257, "phrase": "software_engineering_journals"}, {"score": 0.0023610946923597405, "phrase": "requirements_engineering"}, {"score": 0.0021049977753042253, "phrase": "research_field"}], "paper_keywords": ["Systematic review", " Requirements engineering", " Technology evaluation"], "paper_abstract": "One of the main goals of an applied research field such as software engineering is the transfer and widespread use of research results in industry. To impact industry, researchers developing technologies in academia need to provide tangible evidence of the advantages of using them. This can be done trough step-wise validation, enabling researchers to gradually test and evaluate technologies to finally try them in real settings with real users and applications. The evidence obtained, together with detailed information on how the validation was conducted, offers rich decision support material for industry practitioners seeking to adopt new technologies and researchers looking for an empirical basis on which to build new or refined technologies. This paper presents model for evaluating the rigor and industrial relevance of technology evaluations in software engineering. The model is applied and validated in a comprehensive systematic literature review of evaluations of requirements engineering technologies published in software engineering journals. The aim is to show the applicability of the model and to characterize how evaluations are carried out and reported to evaluate the state-of-research. The review shows that the model can be applied to characterize evaluations in requirements engineering. The findings from applying the model also show that the majority of technology evaluations in requirements engineering lack both industrial relevance and rigor. In addition, the research field does not show any improvements in terms of industrial relevance over time.", "paper_title": "A method for evaluating rigor and industrial relevance of technology evaluations", "paper_id": "WOS:000289254600003"}