{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "distributed_strategic_projects"}, {"score": 0.0044219992735047954, "phrase": "socializing_processes"}, {"score": 0.0043560464825349275, "phrase": "globally_distributed_collaboration"}, {"score": 0.0036553070575015344, "phrase": "globally_distributed_settings"}, {"score": 0.003529282467486661, "phrase": "sap"}, {"score": 0.00349405245698573, "phrase": "lecroy"}, {"score": 0.00327356326590461, "phrase": "remote_counterparts"}, {"score": 0.002902304851882577, "phrase": "re-socializing_remote_counterparts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["strategic software development projects", " face-to-face meetings", " socialization", " globally distributed teams"], "paper_abstract": "Socialization is one means through which globally distributed teams (GDTs) can improve collaboration. However, harnessing socializing processes to support globally distributed collaboration is not easy. In particular, infrequent and limited face-to-face (F2F) contact between remote counterparts might result in difficulties in sharing norms, attitudes and behaviours. In this paper we seek to understand how dispersed teams create socialization in globally distributed settings. Based on data collected at SAP, LeCroy and Baan we conclude that, while F2F meetings are important in socializing remote Counterparts, other activities and processes employed before and after F2F meetings are no less important. In particular, the paper highlights the importance of re-socializing remote counterparts throughout a project lifecycle. Re-socializing means supporting the re-acquisition of behaviours, norms and attitudes that are necessary for participation in an organization. We offer a framework in which three phases of creating, maintaining and renewing socialization in GDTs are discussed. The paper concludes by offering managers some guidelines concerning socialization in GDTs. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Global software development: Exploring socialization and face-to-face meetings in distributed strategic projects", "paper_id": "WOS:000246376600003"}