{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "recent_full_reference_image_quality_assessment_algorithms"}, {"score": 0.004650330504968421, "phrase": "fundamental_importance"}, {"score": 0.004610058444728656, "phrase": "numerous_image"}, {"score": 0.00457013354092966, "phrase": "video_processing_applications"}, {"score": 0.0044524122425287005, "phrase": "quality_assessment"}, {"score": 0.0041170581247889654, "phrase": "human_quality_judgments"}, {"score": 0.003976203286249396, "phrase": "different_approaches"}, {"score": 0.0038568987435766014, "phrase": "significant_research"}, {"score": 0.003459191419478298, "phrase": "comparative_setting"}, {"score": 0.003170667618004276, "phrase": "extensive_subjective_quality_assessment_study"}, {"score": 0.0029961221584602405, "phrase": "\"ground_truth\"_image_quality_data"}, {"score": 0.002722288966917744, "phrase": "video_quality_studies"}, {"score": 0.0025723630851105304, "phrase": "largest_subjective_image_quality_study"}, {"score": 0.0024519545383399773, "phrase": "distortion_types"}, {"score": 0.0023990982005125763, "phrase": "human_judgments"}, {"score": 0.002218054404179068, "phrase": "research_community"}, {"score": 0.0021049977753042253, "phrase": "comparative_results"}], "paper_keywords": ["image quality assessment performance", " image quality study", " subjective quality assessment"], "paper_abstract": "Measurement of visual quality is of fundamental importance for numerous image and video processing applications, where the goal of quality assessment (QA) algorithms is to automatically assess the quality of images or videos in agreement with human quality judgments. Over the years, many researchers have taken different approaches to the problem and have contributed significant research in this area and claim to have made progress in their respective domains. It is important to evaluate the performance of these algorithms in a comparative setting and analyze the strengths and weaknesses of these methods. In this paper, we present results of an extensive subjective quality assessment study in which a total of 779 distorted images were evaluated by about two dozen human subjects. The \"ground truth\" image quality data obtained from about 25 000 individual human quality judgments is used to evaluate the performance of several prominent full-reference image quality assessment algorithms. To the best of our knowledge, apart from video quality studies conducted by the Video Quality Experts Group, the study presented in this paper is the largest subjective image quality study in the literature in terms of number of images, distortion types, and number of human judgments per image. Moreover, we have made the data from the study freely available to the research community [1]. This would allow other researchers to easily report comparative results in the future.", "paper_title": "A statistical evaluation of recent full reference image quality assessment algorithms", "paper_id": "WOS:000241391100017"}