{"auto_keywords": [{"score": 0.045945050752891244, "phrase": "wcag"}, {"score": 0.00481495049065317, "phrase": "accessible_digital_information"}, {"score": 0.00452252857066346, "phrase": "web_content_accessibility_guidelines"}, {"score": 0.004068611852912931, "phrase": "diachronic_analysis"}, {"score": 0.0039122637074546895, "phrase": "known_authors"}, {"score": 0.003776674565735888, "phrase": "wai"}, {"score": 0.003561017335579207, "phrase": "third-party_analyses"}, {"score": 0.0034782306784111494, "phrase": "main_changes"}, {"score": 0.0033444934455768597, "phrase": "personal_experience"}, {"score": 0.0033183674218329904, "phrase": "wai_guidelines"}, {"score": 0.003228517923065361, "phrase": "new_guidelines"}, {"score": 0.0031534367609709233, "phrase": "best_practice_online_services"}, {"score": 0.0030440661915657175, "phrase": "wai_documentation"}, {"score": 0.0026327757304477665, "phrase": "new_priorities"}, {"score": 0.002612194827110595, "phrase": "new_elements"}, {"score": 0.002453221048083196, "phrase": "useful_tool"}, {"score": 0.0023038997972591193, "phrase": "user-centred_design"}, {"score": 0.0021551702945512494, "phrase": "short_guide"}, {"score": 0.002129936623155594, "phrase": "web_sites"}, {"score": 0.0021049977753042253, "phrase": "new_regulations"}], "paper_keywords": ["Worldwide web", " Internet", " Information media"], "paper_abstract": "Purpose - The purpose of this paper is to explain the changes in the Web Content Accessibility Guidelines (WCAG) 2.0 compared with WCAG 1.0 within the context of its historical development. Design/methodology/approach - In order to compare WCAG 2.0 with WCAG 1.0 a diachronic analysis of the evolution of these standards is done. Known authors and publications in the field, the Web Accessibility Initiative (WAI) web pages, WebAIM and the blogosphere were also monitored for comments and third-party analyses. The analysis of the main changes from WCAG 1.0 to WCAG 2.0 was based on personal experience with WAI guidelines, experimentation with some of the new guidelines, and a selection of best practice online services in the application of the WCAG, including WAI documentation. Findings - WCAG 2.0 is more educational and is applied to more technologies than WCAG 1.0. The limitations of WCAG 1.0 are mostly due to its origin. In changing from one to the other, new priorities and new elements must be taken into account. The paper concludes that though these guidelines are a useful tool for governments, they are only the first step towards accessibility, which can only be achieved through user-centred design. Originality/value - This paper explains the significance and limitations of the WCAG and gives a short guide to adapting web sites to the new regulations.", "paper_title": "Web Content Accessibility Guidelines 2.0 A further step towards accessible digital information", "paper_id": "WOS:000272517200003"}