{"auto_keywords": [{"score": 0.04974064540897104, "phrase": "gene_expression"}, {"score": 0.00481495049065317, "phrase": "metabolic_fluxes"}, {"score": 0.004680283709974884, "phrase": "standard_approach"}, {"score": 0.004630755876583033, "phrase": "intracellular_fluxes"}, {"score": 0.0045817497454044565, "phrase": "genome-wide_scale"}, {"score": 0.004549366134876482, "phrase": "flux-balance_analysis"}, {"score": 0.004422094335127632, "phrase": "objective_function"}, {"score": 0.004222795179790998, "phrase": "fba_models"}, {"score": 0.004104621766670225, "phrase": "formulated_objective_function"}, {"score": 0.004018158280364063, "phrase": "defined_constraints"}, {"score": 0.003989742144066683, "phrase": "previous_studies"}, {"score": 0.003947492797744999, "phrase": "fba_predictions"}, {"score": 0.003511159930253876, "phrase": "gene_expression_data"}, {"score": 0.003486316700608598, "phrase": "fba_optimization"}, {"score": 0.0029608739165086257, "phrase": "posttranscriptional_control"}, {"score": 0.002728557856380231, "phrase": "promising_predictions"}, {"score": 0.0026146595609362715, "phrase": "proposed_method"}, {"score": 0.0024877583128884457, "phrase": "nine_different_cultivation_conditions"}, {"score": 0.002260112998123604, "phrase": "flux_distributions"}, {"score": 0.0022124176057373365, "phrase": "transcriptomics_data"}, {"score": 0.0021967433763351884, "phrase": "previous_methods"}, {"score": 0.0021503823972534096, "phrase": "tfba_and_fba_predictions"}], "paper_keywords": ["Gene expression data", " mixed-integer linear programming", " optimization function", " FBA"], "paper_abstract": "A standard approach to estimate intracellular fluxes on a genome-wide scale is flux-balance analysis (FBA), which optimizes an objective function subject to constraints on (relations between) fluxes. The performance of FBA models heavily depends on the relevance of the formulated objective function and the completeness of the defined constraints. Previous studies indicated that FBA predictions can be improved by adding regulatory on/off constraints. These constraints were imposed based on either absolute [21], [3] or relative [20] gene expression values. We provide a new algorithm that directly uses regulatory up/down constraints based on gene expression data in FBA optimization (tFBA). Our assumption is that if the activity of a gene drastically changes from one condition to the other, the flux through the reaction controlled by that gene will change accordingly. We allow these constraints to be violated, to account for posttranscriptional control and noise in the data. These up/down constraints are less stringent than the on/off constraints as previously proposed. Nevertheless, we obtain promising predictions, since many up/down constraints can be enforced. The potential of the proposed method, tFBA, is demonstrated through the analysis of fluxes in yeast under nine different cultivation conditions, between which approximately 5,000 regulatory up/down constraints can be defined. We show that changes in gene expression are predictive for changes in fluxes. Additionally, we illustrate that flux distributions obtained with tFBA better fit transcriptomics data than previous methods. Finally, we compare tFBA and FBA predictions to show that our approach yields more biologically relevant results.", "paper_title": "Predicting Metabolic Fluxes Using Gene Expression Differences As Constraints", "paper_id": "WOS:000283926400018"}