{"auto_keywords": [{"score": 0.04940203756018457, "phrase": "alphanumeric_passwords"}, {"score": 0.037913037646689164, "phrase": "personal_meaning"}, {"score": 0.00481495049065317, "phrase": "alternative_password_systems."}, {"score": 0.004569905085027681, "phrase": "computer_networks"}, {"score": 0.00398177607914381, "phrase": "new_forms"}, {"score": 0.003944112858235306, "phrase": "memorable_passwords"}, {"score": 0.0038698476651328898, "phrase": "memory_research"}, {"score": 0.0033395980635636644, "phrase": "computer_users"}, {"score": 0.0032766780632972363, "phrase": "four-string_variable_passwords"}, {"score": 0.002965229277927781, "phrase": "four-character_alphanumeric_password"}, {"score": 0.0024281181691350085, "phrase": "mediating_effect"}, {"score": 0.0022608057001451414, "phrase": "meaningful_symbol-based_passwords"}, {"score": 0.0021763278640166707, "phrase": "password_types"}, {"score": 0.0021049977753042253, "phrase": "viable_overall_alternative"}], "paper_keywords": ["Password generation", " meaning and memory", " pictogram and alphanumeric string recognition", " recall and precision"], "paper_abstract": "Randomly generated alphanumeric passwords are widely used to restrict access to computer networks but are readily forgotten, resulting in costs to both organizations and users. In order to address this, there is a need to develop and evaluate new forms of memorable passwords. Drawing on memory research and the importance of meaning, the efficacy of three alternative \"password\" systems having varying degrees of personal meaning were compared with the more traditional but personally meaningless randomly generated alphanumeric passwords. Twenty experienced computer users self-generated four-string variable passwords based on alphanumerics, symbols of personal meaning and faces. Additionally, participants were assigned a meaningless, randomly generated four-character alphanumeric password. Password memorability was measured in terms of acquisition (number of trials/time to criterion), retention ( from forgetting functions) and retrieval (time to recall/recognize the passwords). Meaning was found to assist memorability and a mediating effect of familiarity was also observed. Contrary to expectation, self-generated, meaningful symbol-based passwords were not the best remembered of the password types studied but may still be a viable overall alternative.", "paper_title": "MEMORABILITY OF ALTERNATIVE PASSWORD SYSTEMS", "paper_id": "WOS:000269143500008"}