{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "long-term_exposure"}, {"score": 0.004704233721587435, "phrase": "comfort"}, {"score": 0.00464976086880886, "phrase": "stereoscopic_displays"}, {"score": 0.004162978902905446, "phrase": "health_effects"}, {"score": 0.004114787982556699, "phrase": "habitual_viewing"}, {"score": 0.0034956560177000656, "phrase": "stereoscopic_sensitivity"}, {"score": 0.0032596049901888724, "phrase": "negative_symptoms"}, {"score": 0.0023654615987859402, "phrase": "depth_discrimination_task"}, {"score": 0.0022184630090454132, "phrase": "task-specific_training"}, {"score": 0.0021049977753042253, "phrase": "positive_or_negative_consequences"}], "paper_keywords": ["Experimentation", " Human Factors", " Stereoscopic 3D", " S3D", " stereopsis", " stereo displays", " depth discrimination"], "paper_abstract": "Stereoscopic 3Dmedia has recently increased in appreciation and availability. This popularity has led to concerns over the health effects of habitual viewing of stereoscopic 3D content; concerns that are largely hypothetical. Here we examine the effects of repeated, long-term exposure to stereoscopic 3D in the workplace on several measures of stereoscopic sensitivity (discrimination, depthmatching, and fusion limits) along with reported negative symptoms associated with viewing stereoscopic 3D. We recruited a group of adult stereoscopic 3D industry experts and compared their performance with observers who were (i) inexperienced with stereoscopic 3D, (ii) researchers who study stereopsis, and (iii) vision researchers with little or no experimental stereoscopic experience. Unexpectedly, we found very little difference between the four groups on all but the depth discrimination task, and the differences that did occur appear to reflect task-specific training or experience. Thus, we found no positive or negative consequences of repeated and extended exposure to stereoscopic 3D in these populations.", "paper_title": "Effects of Long-Term Exposure on Sensitivity and Comfort with Stereoscopic Displays", "paper_id": "WOS:000335574900002"}