{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "genetic_algorithms"}, {"score": 0.04927872927155838, "phrase": "multi_depot_vehicle"}, {"score": 0.003999578057088828, "phrase": "different_genetic_approaches"}, {"score": 0.003802135020791801, "phrase": "practical_applications"}, {"score": 0.0035141291835319682, "phrase": "up-to-date_overview"}, {"score": 0.003284637361174143, "phrase": "thorough_experiment"}, {"score": 0.003087419032091453, "phrase": "different_existing_genetic_methods"}, {"score": 0.00305285084207725, "phrase": "standard_benchmark_problems"}, {"score": 0.002805597755796506, "phrase": "specific_methods"}, {"score": 0.0024786330057813225, "phrase": "similar_type"}, {"score": 0.0023560952790080943, "phrase": "genetic_algorithm"}, {"score": 0.0023428586429492713, "phrase": "based_solutions"}], "paper_keywords": ["Genetic algorithms", " Vehicle routing problem", " Evolutionary algorithms", " Transport optimization"], "paper_abstract": "This article presents a survey of genetic algorithms that are designed for solving multi depot vehicle routing problem. In this context, most of the articles focus on different genetic approaches, methods and operators, commonly used in practical applications to solve this well-known and researched problem. Besides providing an up-to-date overview of the research in the field, the results of a thorough experiment are presented and discussed, which evaluated the efficiency of different existing genetic methods on standard benchmark problems in detail. In this manner, the insights into strengths and weaknesses of specific methods, operators and settings are presented, which should help researchers and practitioners to optimize their solutions in further studies done with the similar type of the problem in mind. Finally, genetic algorithm based solutions are compared with other existing approaches, both exact and heuristic, for solving this same problem. (C) 2014 Elsevier B. V. All rights reserved.", "paper_title": "A survey of genetic algorithms for solving multi depot vehicle routing problem", "paper_id": "WOS:000346856600044"}