{"auto_keywords": [{"score": 0.03399119619311201, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "end-to-end_throughput"}, {"score": 0.004121015016128205, "phrase": "unit_time"}, {"score": 0.0039055990919333082, "phrase": "network_limit"}, {"score": 0.0038226070564362697, "phrase": "important_value"}, {"score": 0.003781772207256374, "phrase": "network_design"}, {"score": 0.003526735797659508, "phrase": "multihop_wireless_networks"}, {"score": 0.0031504667809625344, "phrase": "general_and_various_approaches"}, {"score": 0.003050508020268648, "phrase": "approximate_solutions"}, {"score": 0.002681315076008658, "phrase": "general_solution_framework"}, {"score": 0.0025409639091476363, "phrase": "arbitrary_set"}, {"score": 0.0025137856138000014, "phrase": "link_sets"}, {"score": 0.0021049977753042253, "phrase": "clique_and_congestion_based_upperbounds"}], "paper_keywords": [""], "paper_abstract": "End-to-end throughput theta(sd) is the maximum amount of data that can be successfully delivered from source s to sink d across a given network in unit time. Determining theta(sd) is essential to understanding the network limit and is of important value to network design and evaluation. In the past few years, the problem Of Computing theta(sd) in multihop wireless networks has been extensively studied in the literature. It has been shown that this problem is NP-hard in general and various approaches have been proposed to compute approximate solutions. In this paper, we study one side of the problem, computing the upperbound Of theta(sd). We present a general solution framework based on linear program LP(F), where F is an arbitrary set of link sets. We show each choice of F corresponds to an upperbound Of theta(sd) and identify several good choice of F based on the notions of clique and congestion. The tightness of these clique and congestion based upperbounds are evaluated by simulation.", "paper_title": "Upperbounding end-to-end throughput of multihop wireless networks", "paper_id": "WOS:000240084000063"}