{"auto_keywords": [{"score": 0.04243918585673838, "phrase": "clusterviz"}, {"score": 0.012421384716028864, "phrase": "cluster_analysis"}, {"score": 0.012080882713267167, "phrase": "biological_networks"}, {"score": 0.004770211811866158, "phrase": "biological_network"}, {"score": 0.004510336430422002, "phrase": "functional_modules"}, {"score": 0.004447600571127578, "phrase": "protein_functions"}, {"score": 0.004324723240308028, "phrase": "clustering_results"}, {"score": 0.0033919477901198716, "phrase": "open_services_gateway_initiative"}, {"score": 0.0028799352389969443, "phrase": "different_algorithms"}, {"score": 0.002735522834514124, "phrase": "fag-ec"}, {"score": 0.002710056982285733, "phrase": "eagle"}, {"score": 0.002684819329643819, "phrase": "mcode"}, {"score": 0.0026105159490849364, "phrase": "current_version"}, {"score": 0.002538263784314365, "phrase": "abstract_interface"}, {"score": 0.002456486927713543, "phrase": "clustering_algorithms"}, {"score": 0.0023662411481713704, "phrase": "future_use"}, {"score": 0.002237036807966899, "phrase": "detailed_steps"}, {"score": 0.0022058510091498666, "phrase": "important_scientific_articles"}], "paper_keywords": ["Cluster", " cytoscape", " biological networks", " FAG-EC", " EAGLE", " MCODE", " visualization"], "paper_abstract": "Cluster analysis of biological networks is one of the most important approaches for identifying functional modules and predicting protein functions. Furthermore, visualization of clustering results is crucial to uncover the structure of biological networks. In this paper, ClusterViz, an APP of Cytoscape 3 for cluster analysis and visualization, has been developed. In order to reduce complexity and enable extendibility for ClusterViz, we designed the architecture of ClusterViz based on the framework of Open Services Gateway Initiative. According to the architecture, the implementation of ClusterViz is partitioned into three modules including interface of ClusterViz, clustering algorithms and visualization and export. ClusterViz fascinates the comparison of the results of different algorithms to do further related analysis. Three commonly used clustering algorithms, FAG-EC, EAGLE and MCODE, are included in the current version. Due to adopting the abstract interface of algorithms in module of the clustering algorithms, more clustering algorithms can be included for the future use. To illustrate usability of ClusterViz, we provided three examples with detailed steps from the important scientific articles, which show that our tool has helped several research teams do their research work on the mechanism of the biological networks.", "paper_title": "ClusterViz: A Cytoscape APP for Cluster Analysis of Biological Network", "paper_id": "WOS:000359264900014"}