{"auto_keywords": [{"score": 0.027123305326435244, "phrase": "mac_summary"}, {"score": 0.01418555549982941, "phrase": "similar_type"}, {"score": 0.00481495049065317, "phrase": "content_summaries"}, {"score": 0.0047415081747150065, "phrase": "rapid_development"}, {"score": 0.004615656893404919, "phrase": "increasing_number"}, {"score": 0.004441616106463486, "phrase": "large_number"}, {"score": 0.004241370886886689, "phrase": "users_information"}, {"score": 0.0042250952759280225, "phrase": "searching_effort"}, {"score": 0.004192730391924712, "phrase": "data_integration_systems"}, {"score": 0.003837817436476726, "phrase": "uniform_query_interface"}, {"score": 0.0037937873032347, "phrase": "conventional_approach"}, {"score": 0.003290403747743492, "phrase": "relevant_answers"}, {"score": 0.0031906408161077792, "phrase": "wasted_resources"}, {"score": 0.0029656229252935417, "phrase": "catalog_content_summary"}, {"score": 0.0028867712833776046, "phrase": "relevant_e-catalogs"}, {"score": 0.0021049977753042253, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "With the rapid development of e-services on the Web, increasing number of e-catalogs are becoming accessible to users. A large number of e-catalogs provide information about similar type of products/services. To simplify users information searching effort, data integration systems have being developed to integrate e-catalogs providing similar type of information such that users can query those e-catalogs with a mediator through an uniform query interface. The conventional approach to answer a query received by a mediator is to select e-catalogs purely based on their query capabilities, i.e., query interface specifications. However, an e-catalog having the capability to answer a query does not mean it has relevant answers to the query. To remedy the wasted resources of querying catalogs that do not generate an answer, in this paper, we propose to use catalog content summary as a filter and select the relevant e-catalogs to answer a given query based not only on their query capabilities but also on their content relevance to the query. A multi-attribute content (MAC) summary is proposed to describe an e-atalog with respect to its content. With MAC summary, an e-catalog is selected to answer a query only if the e-catalog is likely having answers to the query. MAC summary can be constructed and updated using answers returned from e-catalogs and therefore the e-catalogs need not be cooperative. We evaluated MAC summary on 50 e-catalogs, and the experimental results were promising.", "paper_title": "Querying e-catalogs using content summaries", "paper_id": "WOS:000243131600008"}