{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "inspection_and_test_processes"}, {"score": 0.004733625412289433, "phrase": "specific_assumptions"}, {"score": 0.003841699919521703, "phrase": "early_defect_detection_data"}, {"score": 0.0037287578312533596, "phrase": "higher_defect_detection_rates"}, {"score": 0.003697100573612401, "phrase": "reduced_quality_assurance_effort"}, {"score": 0.003557924423642353, "phrase": "prior_information"}, {"score": 0.003512702405367876, "phrase": "system's_quality"}, {"score": 0.0033374705499418377, "phrase": "systematic_integration"}, {"score": 0.003239304090565123, "phrase": "context-specific_knowledge"}, {"score": 0.0028992294924613327, "phrase": "context-specific_assumptions"}, {"score": 0.002825949329865926, "phrase": "starting_point"}, {"score": 0.0027078974645805736, "phrase": "integrated_inspection"}, {"score": 0.0026058621464926826, "phrase": "inspection_data"}, {"score": 0.0023024551893939403, "phrase": "analytical_or_empirical_manner"}, {"score": 0.0021968238865548812, "phrase": "related_work"}, {"score": 0.0021688641066186817, "phrase": "future_research_directions"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["inspection", " testing", " integration", " test focus", " assumptions"], "paper_abstract": "Inspections and testing are two of the most commonly performed software quality assurance processes today. Typically, these processes are applied in isolation, which, however, fails to exploit the benefits of systematically combining and integrating them. In consequence, tests are not focused on the basis of early defect detection data. Expected benefits of such process integration include higher defect detection rates or reduced quality assurance effort. Moreover, when conducting testing without any prior information regarding the system's quality, it is often unclear how to focus testing. A systematic integration of inspection and testing processes requires context-specific knowledge about the relationships between inspections and testing. This knowledge is typically not available and needs to be empirically identified and validated. Often, context-specific assumptions can be seen as a starting point for generating such knowledge. On the basis of the integrated inspection and testing approach, In(2)Test, which uses inspection data to focus testing, we present in this article how knowledge about the relationship between inspections and testing can be gained, documented, and evolved in an analytical or empirical manner. In addition, this article gives an overview of related work and highlights future research directions. Copyright (c) 2012 John Wiley & Sons, Ltd.", "paper_title": "uIntegrating inspection and test processes based on context- specific assumptions", "paper_id": "WOS:000334503900002"}