{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "on-line_english_ink_notes"}, {"score": 0.004553510708976456, "phrase": "digital_ink"}, {"score": 0.00389427992231721, "phrase": "handwriting_recognition"}, {"score": 0.003703282519292336, "phrase": "first_paper"}, {"score": 0.0036214184763804034, "phrase": "ink_cleanup_problem"}, {"score": 0.0031845067058084583, "phrase": "handwriting_recognition_rate"}, {"score": 0.00269263690712392, "phrase": "single_stroke"}, {"score": 0.0025178072071268534, "phrase": "wrong_writing_order"}, {"score": 0.0024897902536499005, "phrase": "experimental_results"}, {"score": 0.0023675132064088803, "phrase": "ink_note"}, {"score": 0.002276566401216226, "phrase": "recognition_rate"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["document analysis", " document and text editing", " handwriting analysis", " handwriting recognition"], "paper_abstract": "Recently, many pen-based devices have enabled people to input digital ink naturally. Often, there is smear and correction when writing. This not only makes the document dirty and look unpleasant, but also affects the handwriting recognition when recognition is called for. As the first paper to address the ink cleanup problem, we present our ink cleanup system that removes the smear and correction, so that the document becomes cleaner and more legible and the handwriting recognition rate could also be improved. The algorithms are rule-based and are capable of dealing with the most common cases that may happen during writing, including self-overtracing of a single stroke, inter-overtracing between strokes, correction, touch-up, insertion and wrong writing order. Experimental results show that our system is effective in cleaning the ink note and is promising in increasing the recognition rate as well. (c) 2005 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Rule-based cleanup of on-line English ink notes", "paper_id": "WOS:000236696400007"}