{"auto_keywords": [{"score": 0.028329958442619006, "phrase": "clot_extraction"}, {"score": 0.00481495049065317, "phrase": "new_mechanical_thrombectomy_device"}, {"score": 0.00458412183693466, "phrase": "blood_clots"}, {"score": 0.004523103062368843, "phrase": "middle_cerebral_artery"}, {"score": 0.0044231966846655394, "phrase": "thrombectomy_devices"}, {"score": 0.00419229472352669, "phrase": "clot_removal"}, {"score": 0.003991331720789092, "phrase": "uk"}, {"score": 0.0034283921404628975, "phrase": "relatively_early_stage"}, {"score": 0.003052014818816411, "phrase": "bond_graph_technique"}, {"score": 0.002957919048133256, "phrase": "highly_effective_method"}, {"score": 0.002741269087816162, "phrase": "gptad"}, {"score": 0.00259793885118959, "phrase": "simulation_model"}, {"score": 0.0025404470150468387, "phrase": "minimum_pressure"}, {"score": 0.0022816681646340518, "phrase": "clinical_situations"}, {"score": 0.0022112700457629494, "phrase": "experimentally_obtained_data"}], "paper_keywords": ["biomedical engineering", " bond graph methodology", " thrombectomy device"], "paper_abstract": "A number of thrombectomy devices using a variety of methods have now been developed to facilitate clot removal. We present research involving one such experimental device recently developed in the UK, called a 'GP' Thrombus Aspiration Device (GPTAD). This device has the potential to bring about the extraction of a thrombus. Although the device is at a relatively early stage of development, the results look encouraging. In this work, we present an analysis and modeling of the GPTAD by means of the bond graph technique; it seems to be a highly effective method of simulating the device under a variety of conditions. Such modeling is useful in optimizing the GPTAD and predicting the result of clot extraction. The aim of this simulation model is to obtain the minimum pressure necessary to extract the clot and to verify that both the pressure and the time required to complete the clot extraction are realistic for use in clinical situations, and are consistent with any experimentally obtained data. We therefore consider aspects of rheology and mechanics in our modeling.", "paper_title": "An investigation into the performance of a new mechanical thrombectomy device using bond graph modeling: application to the extraction of blood clots in the middle cerebral artery", "paper_id": "WOS:000318280300010"}