{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "analytical_structure"}, {"score": 0.004320866778446174, "phrase": "pd"}, {"score": 0.0042184293531065285, "phrase": "pi"}, {"score": 0.004134137523409649, "phrase": "symmetrical_rule_base"}, {"score": 0.004101088357088207, "phrase": "symmetrical_consequent_sets"}, {"score": 0.003955593400628455, "phrase": "zadeh_and_operator"}, {"score": 0.003876996400581697, "phrase": "t-norm_operator"}, {"score": 0.0035778632599436024, "phrase": "input_conditions"}, {"score": 0.0035208552733545463, "phrase": "km_algorithm"}, {"score": 0.003478694092089197, "phrase": "new_switch_point"}, {"score": 0.0033822643082593285, "phrase": "type-reduced_set"}, {"score": 0.003108669771132255, "phrase": "potential_performance_improvement"}, {"score": 0.0028115863316685937, "phrase": "unique_relationship"}, {"score": 0.0027556576784848207, "phrase": "output_signals"}, {"score": 0.0026900059414552823, "phrase": "relatively_large_number"}, {"score": 0.002668470532683947, "phrase": "local_regions"}, {"score": 0.002512342528545883, "phrase": "better_performance"}, {"score": 0.002384422461262006, "phrase": "potential_advantages"}, {"score": 0.0021391300942881, "phrase": "conflicting_aims"}, {"score": 0.0021219954544970878, "phrase": "fast_rise_time"}, {"score": 0.0021049977753042253, "phrase": "small_overshoot"}], "paper_keywords": ["Analytical structure", " fuzzy proportional derivative (PD) and proportional integral (PI) controllers", " interval type-2 (IT2) fuzzy logic system"], "paper_abstract": "This paper presents the analytical structure of a class of interval type-2 (IT2) fuzzy proportional derivative (PD) and proportional integral (PI) controllers that have symmetrical rule base and symmetrical consequent sets. Two assumptions are made: 1) The Zadeh AND operator is employed as the t-norm operator; 2) type-reduction is performed by the Karnik-Mendel (KM) type-reduction method. The main contributions are the methodology that identifies the input conditions, where the KM algorithm uses a new switch point to compute the bounds of the type-reduced set, the closed-form expressions that relate the inputs and output of an IT2 fuzzy controller, and insights into the potential performance improvement because of the inclusion of the footprint of uncertainty (FOU). Compared with its T1 counterpart, two additional FOU parameters generate 31 extra local regions, each providing a unique relationship between the inputs and output signals. The generation of a relatively large number of local regions at the cost of two extra design parameters indicates that an IT2 fuzzy controller may be able to provide better performance. Furthermore, by comparing the analytical structure with the corresponding T1 counterpart, the potential advantages to use the IT2 over the T1 fuzzy controller are studied. Four interesting characteristics are identified, and they provide insights into why the IT2 fuzzy controller may better balance the conflicting aims of fast rise time and small overshoot.", "paper_title": "Analytical Structure and Characteristics of Symmetric Karnik-Mendel Type-Reduced Interval Type-2 Fuzzy PI and PD Controllers", "paper_id": "WOS:000304905500002"}