{"auto_keywords": [{"score": 0.04698982363916361, "phrase": "wiretap_channel"}, {"score": 0.03992659287798476, "phrase": "bec"}, {"score": 0.034166467628017755, "phrase": "main_channel"}, {"score": 0.00481495049065317, "phrase": "performance_analysis_and_design"}, {"score": 0.004401794742140806, "phrase": "wiretapper's_channel"}, {"score": 0.004360412703519539, "phrase": "binary_erasure_channels"}, {"score": 0.004238576355081601, "phrase": "code_construction_method"}, {"score": 0.0040049806975968145, "phrase": "coset_encoding_scheme"}, {"score": 0.003930000775297499, "phrase": "single_edge-type_ldpc_ensemble"}, {"score": 0.0033465923623290034, "phrase": "degree_one_variable_nodes"}, {"score": 0.0031619994642255846, "phrase": "zero_threshold"}, {"score": 0.00297346171320082, "phrase": "degree_distribution"}, {"score": 0.0028093921138602606, "phrase": "resulting_ensembles"}, {"score": 0.00266693888510356, "phrase": "rate-equivocation_region"}, {"score": 0.002519739850807611, "phrase": "ensemble_average_equivocation"}, {"score": 0.002426137929553722, "phrase": "recently_published_approach"}, {"score": 0.002358220053411644, "phrase": "single_edge-type_ensembles"}, {"score": 0.002125020720324262, "phrase": "relatively_simple_constructions"}], "paper_keywords": [""], "paper_abstract": "We consider transmission over a wiretap channel where both the main channel and the wiretapper's channel are binary erasure channels (BEC). A code construction method is proposed using two edge-type low-density parity-check (LDPC) codes based on the coset encoding scheme. Using a single edge-type LDPC ensemble with a given threshold over the BEC, we give a construction for a two edge-type LDPC ensemble with the same threshold. If the given single edge-type LDPC ensemble has degree two variable nodes, our construction gives rise to degree one variable nodes in the code used over the main channel. This results in zero threshold over the main channel. In order to circumvent this problem, the degree distribution of the two edge-type LDPC ensemble is numerically optimized. We find that the resulting ensembles are able to perform close to the boundary of the rate-equivocation region of the wiretap channel. Further, a method to compute the ensemble average equivocation of two edge-type LDPC ensembles is provided by generalizing a recently published approach to measure the equivocation of single edge-type ensembles for transmission over the BEC in the point-to-point setting. From this analysis, we find that relatively simple constructions give very good secrecy performance.", "paper_title": "Performance Analysis and Design of Two Edge-Type LDPC Codes for the BEC Wiretap Channel", "paper_id": "WOS:000313728800024"}