{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "strong_equivalence"}, {"score": 0.015576847689475237, "phrase": "argumentation_frameworks"}, {"score": 0.011676416208225947, "phrase": "standard_notion"}, {"score": 0.004640398886726948, "phrase": "inherently_dynamic_process"}, {"score": 0.004534517530868195, "phrase": "great_importance"}, {"score": 0.004390312150344245, "phrase": "new_information"}, {"score": 0.0030759821501544224, "phrase": "h._due"}, {"score": 0.0030056887638095883, "phrase": "argumentation_semantics"}, {"score": 0.0025565050791036973, "phrase": "abstract_argumentation_frameworks"}, {"score": 0.0022149235007885826, "phrase": "augmentations_h"}, {"score": 0.0021843879253500894, "phrase": "new_arguments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Abstract argumentation", " Semantics", " Equivalence"], "paper_abstract": "Since argumentation is an inherently dynamic process, it is of great importance to understand the effect of incorporating new information into given argumentation frameworks. In this work, we address this issue by analyzing equivalence between argumentation frameworks under the assumption that the frameworks in question are incomplete, i.e. further information might be added later to both frameworks simultaneously. In other words, instead of the standard notion of equivalence (which holds between two frameworks, if they possess the same extensions), we require here that frameworks F and G are also equivalent when conjoined with any further framework H. Due to the nonmonotonicity of argumentation semantics, this concept is different to (but obviously implies) the standard notion of equivalence. We thus call our new notion strong equivalence and study how strong equivalence can be decided with respect to the most important semantics for abstract argumentation frameworks. We also consider variants of strong equivalence in which we define equivalence with respect to the sets of arguments credulously (or skeptically) accepted, and restrict strong equivalence to augmentations H where no new arguments are raised. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Characterizing strong equivalence for argumentation frameworks", "paper_id": "WOS:000295445400001"}