{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "andalusian_parliament's_digital_library"}, {"score": 0.004762893197005439, "phrase": "purpose_-_the_purpose"}, {"score": 0.004318881178805575, "phrase": "electronic_representation"}, {"score": 0.004090274535243564, "phrase": "document's_internal_organisation"}, {"score": 0.003958937342925219, "phrase": "parliamentary_sessions"}, {"score": 0.0031845067058084583, "phrase": "developed_integrated_information_system"}, {"score": 0.002779217021776702, "phrase": "internal_structure"}, {"score": 0.0027341763737751467, "phrase": "parliament's_official_documents"}, {"score": 0.0023219374444738723, "phrase": "information_retrieval_system"}, {"score": 0.0022967713922705, "phrase": "structured_documents"}, {"score": 0.0022595316565074326, "phrase": "real_framework"}, {"score": 0.0021987994275190314, "phrase": "multimedia_sources"}, {"score": 0.0021049977753042253, "phrase": "retrieval_purposes"}], "paper_keywords": ["Digital libraries", " Information retrieval", " Extensible Markup Language", " Video", " Parliament", " Spain"], "paper_abstract": "Purpose - The purpose of this paper is to present an overview of the reorganisation of the Andalusian Parliament's digital library to improve the electronic representation and access of its official corpus by taking advantage of a document's internal organisation. Video recordings of the parliamentary sessions have also been integrated with their corresponding textual transcriptions. Design/methodology/approach - After analysing the state of the Andalusian Parliament's digital library and determining the aspects that could be improved both in the repository and access mechanisms, this paper describes each component of the developed integrated information system. Findings - A methodology has been developed to tackle the problem and this could be applied to other similar institutions and organisations. Exploiting the internal structure of the parliament's official documents has also proved to be extremely interesting for users as they are directed towards the most relevant parts of the documents. Originality/value - The paper presents an application of an information retrieval system for structured documents to a real framework and the integration of multimedia sources (e.g. text and video) for retrieval purposes.", "paper_title": "An integrated system for managing the Andalusian Parliament's digital library", "paper_id": "WOS:000266525300003"}