{"auto_keywords": [{"score": 0.04690177586959502, "phrase": "test_cases"}, {"score": 0.015719716506582538, "phrase": "test_suite_augmentation_techniques"}, {"score": 0.012822842451239746, "phrase": "target_code_elements"}, {"score": 0.00955704764534058, "phrase": "substantial_effect"}, {"score": 0.004745965928357563, "phrase": "regression_testing"}, {"score": 0.004694873827535293, "phrase": "code_elements"}, {"score": 0.004644329185633612, "phrase": "modified_program"}, {"score": 0.004383766516923386, "phrase": "defining_feature"}, {"score": 0.004258995791471342, "phrase": "existing_regression_test_suites"}, {"score": 0.004078439401031372, "phrase": "augmentation_techniques"}, {"score": 0.003766991006640731, "phrase": "existing_regression_test_cases"}, {"score": 0.0037398806676032068, "phrase": "newly_generated_test_cases"}, {"score": 0.0032250366795039715, "phrase": "primary_factor"}, {"score": 0.0031331419276289306, "phrase": "test_case_generation_algorithm"}, {"score": 0.0029785631356166594, "phrase": "existing_and_newly_generated_test_cases"}, {"score": 0.002682133505994396, "phrase": "relatively_few_effects"}, {"score": 0.0026532001044943096, "phrase": "concolic_test_case_generation"}, {"score": 0.0025682543875086934, "phrase": "genetic_test_case_generation"}, {"score": 0.002468107263634476, "phrase": "large_number"}, {"score": 0.0024503217593801587, "phrase": "test_suites"}, {"score": 0.002354762471810519, "phrase": "multiple_versions"}, {"score": 0.0022876085523721324, "phrase": "potential_opportunity"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["regression testing", " test case augmentation", " concolic testing", " genetic algorithms"], "paper_abstract": "Test suite augmentation techniques are used in regression testing to identify code elements in a modified program that are not adequately tested and to generate test cases to cover those elements. A defining feature of test suite augmentation techniques is the potential for reusing existing regression test suites. Our preliminary work suggests that several factors influence the efficiency and effectiveness of augmentation techniques that perform such reuse. These include the order in which target code elements are considered while generating test cases, the manner in which existing regression test cases and newly generated test cases are used, and the algorithm used to generate test cases. In this work, we present the results of two empirical studies examining these factors, considering two test case generation algorithms (concolic and genetic). The results of our studies show that the primary factor affecting augmentation using these approaches is the test case generation algorithm utilized; this affects both cost and effectiveness. The manner in which existing and newly generated test cases are utilized also has a substantial effect on efficiency and in some cases a substantial effect on effectiveness. The order in which target code elements are considered turns out to have relatively few effects when using concolic test case generation but in some cases influences the efficiency of genetic test case generation. The results of our first study, on four relatively small programs using a large number of test suites, are supported by our second study of a much larger program available in multiple versions. Together, the studies reveal a potential opportunity for creating a more cost-effective hybrid augmentation approach leveraging both concolic and genetic test case generation techniques, while appropriately utilizing our understanding of the factors that affect them. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Directed test suite augmentation: an empirical investigation", "paper_id": "WOS:000350307100002"}