{"auto_keywords": [{"score": 0.04952134781811598, "phrase": "mac"}, {"score": 0.04868964342802686, "phrase": "wireless_sensor_networks"}, {"score": 0.00481495049065317, "phrase": "beacon-enabled_ieee"}, {"score": 0.0046216996484107885, "phrase": "ieee"}, {"score": 0.0041586840496756474, "phrase": "phy_layer"}, {"score": 0.0041102032028337366, "phrase": "mac_sub-layer"}, {"score": 0.003968112038249246, "phrase": "mac_protocol"}, {"score": 0.0038534477978822133, "phrase": "sensor_nodes"}, {"score": 0.00376409764683147, "phrase": "wireless_communication_medium"}, {"score": 0.003119760592916715, "phrase": "practical_perspective"}, {"score": 0.00249592321829865, "phrase": "improved_ieee"}], "paper_keywords": ["Wireless Sensor Networks", " Beacon-Enabled IEEE 802.15.4", " Medium Access Control", " Binary Exponent Backoff", " Fairness", " Power Consumption", " Reliability", " Throughput"], "paper_abstract": "IEEE 802.15.4 is the de facto standard for Wireless Sensor Networks (WSNs) that outlines the specifications of the PHY layer and MAC sub-layer in these networks. The MAC protocol is needed to orchestrate sensor nodes access to the wireless communication medium. Although distinguished by a set of strengths that contributed to its popularity in various WSNs, IEEE 802.15.4 MAC suffers from several limitations that play a role in deteriorating its performance. Also, from a practical perspective, 80.15.4-based networks are usually deployed in the vicinity of other wireless networks that operate in the same ISM band. This means that 802.15.4 MAC should be ready to cope with interference from other networks. These facts have motivated efforts to devise improved IEEE 802.15.4 MAC protocols for WSNs. In this paper we provide a survey for these protocols and highlight the methodologies they follow to enhance the performance of the IEEE 802.15.4 MAC protocol.", "paper_title": "A Survey of Beacon-Enabled IEEE 802.15.4 MAC Protocols in Wireless Sensor Networks", "paper_id": "WOS:000339727700014"}