{"auto_keywords": [{"score": 0.014731503347801678, "phrase": "mutational_changes"}, {"score": 0.010606998956850541, "phrase": "structural_segments"}, {"score": 0.00481495049065317, "phrase": "computational_study"}, {"score": 0.004235252881661159, "phrase": "viral_apparatus"}, {"score": 0.004172526471885961, "phrase": "numerical_characterization_studies"}, {"score": 0.0038151298350627065, "phrase": "identical_sequences"}, {"score": 0.0037698405700547608, "phrase": "significant_distances"}, {"score": 0.003648037996175166, "phrase": "deeper_understanding"}, {"score": 0.003540714632602521, "phrase": "structural_sections"}, {"score": 0.003385600553283614, "phrase": "human_and_avian_hosts"}, {"score": 0.0033654369798577378, "phrase": "influenza's_flexibility"}, {"score": 0.0033453930912354796, "phrase": "host_selection"}, {"score": 0.003276171848389645, "phrase": "biased_nature"}, {"score": 0.003256657868307919, "phrase": "mutational_accumulation"}, {"score": 0.00301327406964098, "phrase": "transmembrane_and_stalk_regions"}, {"score": 0.002924570313075411, "phrase": "parallel_study"}, {"score": 0.0028984704276511786, "phrase": "equivalent_section"}, {"score": 0.0028726027956447885, "phrase": "c-terminal_region"}, {"score": 0.002722160504975204, "phrase": "highly_conserved_nature"}, {"score": 0.00266580039440334, "phrase": "active_site_related_bases"}, {"score": 0.002626257128137605, "phrase": "highly_conserved_characteristic"}, {"score": 0.002533723901680123, "phrase": "rather_large_mutational_changes"}, {"score": 0.0024961348944169616, "phrase": "high_level"}, {"score": 0.0024664646023470813, "phrase": "major_part"}, {"score": 0.0023938189911418373, "phrase": "strong_conservation"}, {"score": 0.0023302648796456452, "phrase": "rapid_mutations"}, {"score": 0.002282000081594605, "phrase": "avian_flu"}, {"score": 0.0022015695920570167, "phrase": "long_duration_dormancy"}, {"score": 0.0021688975382614366, "phrase": "viral_strains"}, {"score": 0.0021367093107378847, "phrase": "highly_conserved_segments"}, {"score": 0.0021176256386583555, "phrase": "potential_regions"}, {"score": 0.0021049977753042253, "phrase": "inhibitor_designs"}], "paper_keywords": [""], "paper_abstract": "Study of mutational changes in neuraminidase (NA) gene sequences is important to track the effectiveness of the inhibitors to the H5N1 avian flu virus that targets this component of the viral apparatus. Our analysis based on numerical characterization studies of 682 complete neuraminidase gene and protein sequences available in the database, updated to March 2009, and which extends our previous work based on a sample of 173 sequences has revealed several interesting features. We have noticed that identical sequences have appeared over significant distances in space and time, raising the need for a deeper understanding of the longevity of such viral strains in the environment. Structural sections like transmembrane, stalk, body, and C-terminal tail regions have shown independent recombinations between strains from various species including human and avian hosts highlighting influenza's flexibility in host selection and recombination. Our analysis confirmed a biased nature in mutational accumulation in structural segments: a highly conserved 50-base C-terminal tail section identified in our earlier paper seems to accumulate mutational changes at a rate of about a fifth to an eighth of transmembrane and stalk regions, although the length is about half of these. Parallel study of the equivalent section to the C-terminal region in protein sequences reveals only 13 separate varieties, and all the other 669 sequences are duplicates to three of these varieties showing the highly conserved nature of this segment. Our analysis of active site related bases and amino acids showed highly conserved characteristic of those constructs, whereas the rest of the segments demonstrated rather large mutational changes. These kinds of high level of mutation in major part of the H5N1 NA sequences and recombinations within structural segments coupled with strong conservation of a few select segments show that the potential of rapid mutations to more virulent forms of this variety of avian flu continue to remain of concern, especially with the possibility of long duration dormancy of some of these viral strains, whereas islands of highly conserved segments Could signify potential regions for inhibitor designs.", "paper_title": "Computational Study of Dispersion and Extent of Mutated and Duplicated Sequences of the H5N1 Influenza Neuraminidase over the Period 1997-2008", "paper_id": "WOS:000271936300019"}