{"auto_keywords": [{"score": 0.041772357680559515, "phrase": "previous_paper"}, {"score": 0.040450255982993406, "phrase": "distinguishing_attack"}, {"score": 0.004541712637353326, "phrase": "new_stream_cipher"}, {"score": 0.004380358468291855, "phrase": "design_specifications"}, {"score": 0.0041316803676012155, "phrase": "first_distinguishing_attack"}, {"score": 0.0034572649187813655, "phrase": "pad_parameter"}, {"score": 0.003428495381847161, "phrase": "constant_odd_value"}, {"score": 0.002941389980674657, "phrase": "maximum_resistance"}, {"score": 0.0028525853764850497, "phrase": "original_cipher"}, {"score": 0.0027129992463542497, "phrase": "second_output_byte"}, {"score": 0.0026310718762875707, "phrase": "generalized_way"}, {"score": 0.002587429107459106, "phrase": "m-th_output_byte"}, {"score": 0.002474546341064081, "phrase": "hamming_weight"}, {"score": 0.0024402882329924934, "phrase": "n._finally"}, {"score": 0.002406503256754213, "phrase": "differential_fault_attack"}, {"score": 0.0022886952510350416, "phrase": "computational_complexity"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["distinguishing attacks", " RC4", " RC4+", " stream ciphers"], "paper_abstract": "The RC4+ stream cipher was proposed as an alternative to the well known RC4 stream cipher. It was claimed by the authors that this new stream cipher was designed to overcome all the weaknesses reported against the alleged RC4 stream cipher. In the design specifications of RC4+, the authors make use of an 8-bit design parameter called pad that is fixed to the value 0xAA. The first distinguishing attack on RC4+ based on the bias of its first output byte was shown in a previous paper. In this paper, it was also mentioned that the distinguishing attack would still hold if the pad used in RC4+ is fixed to any even 8-bit constant other than 0xAA. Therefore, the question that naturally arises is whether the design of RC4+ can be protected by fixing the pad parameter to some constant odd value. In this paper, we try to answer this very question. We show that the design is still vulnerable by mounting a distinguishing attack even if the pad is fixed to some constant 8-bit odd value. Surprisingly, we find that if the value of the pad is made equal to 0x03, the design provides maximum resistance to distinguishing attacks. Lastly, we return to the original cipher, that is, in which pad is set to 0xAA and unearth another bias in the second output byte of the cipher. Thereafter, we will present a generalized way of finding biases in every M-th output byte 1(M >= 3) of RC4+, that is, Z(M), based on the Hamming weight of m = M mod N. Finally, we improve the differential fault attack on RC4+ proposed in a previous paper, both in terms of number of faults required and the computational complexity. In fact, we reduce the number of faults by around 11 264 on average, and our algorithm is around 2(6) times faster. Copyright (C) 2015 John Wiley & Sons, Ltd.", "paper_title": "Some security results of the RC4+stream cipher", "paper_id": "WOS:000367922500061"}