{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_team"}, {"score": 0.007260496246482274, "phrase": "trust_estimation"}, {"score": 0.006323092454933004, "phrase": "trust_level"}, {"score": 0.004582528208024817, "phrase": "important_role"}, {"score": 0.00442651096522781, "phrase": "virtual_teams"}, {"score": 0.0037967593942595233, "phrase": "member_and_cooperation_situations"}, {"score": 0.0035600143547053287, "phrase": "decision_support_method"}, {"score": 0.0034386894664467003, "phrase": "trust_estimation_framework"}, {"score": 0.002516457934208144, "phrase": "web-based_trust_estimation_system"}, {"score": 0.002168586864007222, "phrase": "proposed_decision_support_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Decision support", " Trust estimation", " Virtual team", " Multiattribute decision analysis (MADA)", " 2-Tuple fuzzy linguistic representation model"], "paper_abstract": "Trust plays an important role in the operation and management of virtual teams. It is also a foundation of the cooperation between members. In the operation of a virtual team, trust estimation is a very significant issue to know about the trustworthiness of each member and cooperation situations between members. The purpose of this paper is to propose a decision support method for estimating the trust level. A trust estimation framework with two dimensions of reputation and collaboration is developed. From this, a fuzzy multiattribute decision analysis (MADA) approach based on the 2-tuple fuzzy linguistic representation model is proposed to measure the performances on reputation and collaboration. By the measurements of the performances, the trust level of each member and the virtual team can be identified so as to improve the management of the virtual team. Furthermore, a Web-based trust estimation system (WTES) is designed and developed to support the activities of trust estimation in a virtual team. Finally, an application is provided to illustrate the applicability of the proposed decision support method. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Trust estimation in a virtual team: A decision support method", "paper_id": "WOS:000290237500136"}