{"auto_keywords": [{"score": 0.04453527007923276, "phrase": "system_reliability_estimate"}, {"score": 0.00481495049065317, "phrase": "system_reliability_optimization"}, {"score": 0.004610058444728656, "phrase": "series-parallel_systems"}, {"score": 0.004573748810476845, "phrase": "system_reliability_optimization_models"}, {"score": 0.004448892453489832, "phrase": "new_algorithms"}, {"score": 0.0037978390554858766, "phrase": "slightly_lower_estimated_reliability"}, {"score": 0.0036794956254952126, "phrase": "redundancy_allocation_problem"}, {"score": 0.0035507457285983268, "phrase": "system_configuration"}, {"score": 0.0033328427701162368, "phrase": "system_related_constraints"}, {"score": 0.003054825135908205, "phrase": "minimum_system_reliability_constraint"}, {"score": 0.0028786467218197245, "phrase": "component_mixing"}, {"score": 0.0028110458014332187, "phrase": "optimal_algorithm"}, {"score": 0.0027559226203857316, "phrase": "linear_integer_programming"}, {"score": 0.002648889316519512, "phrase": "heuristic_approach"}, {"score": 0.0025866699249916508, "phrase": "combined_neighborhood_search"}, {"score": 0.0022606512324475584, "phrase": "better_prospective_solutions"}, {"score": 0.0022162970216404927, "phrase": "mixing_components"}, {"score": 0.002155656133617155, "phrase": "linear_integer_programming_problem"}, {"score": 0.0021049977753042253, "phrase": "recommended_solution"}], "paper_keywords": ["Estimation uncertainty", " redundancy allocation problem", " system reliability"], "paper_abstract": "System reliability optimization models considering uncertainty are described, and new algorithms are proposed to minimize the coefficient of variation of the system reliability estimate. This is a realistic, important formulation because the reliability of most components is not known with certainty, and decision-makers are often risk averse, preferring a system with a slightly lower estimated reliability if it is a more certain measure. The redundancy allocation problem can be defined as the selection of the system configuration and the type of the components to optimize some objective function(s) while satisfying some system related constraints. In this paper, we propose algorithms to minimize the coefficient of variation of the system reliability estimate with respect to a minimum system reliability constraint, and some other system related constraints. Two algorithms are presented. For problems where component mixing is not allowed, an optimal algorithm is presented based on linear integer programming. For problems where mixing is allowed, a heuristic approach is presented based on a combined neighborhood search, and a linear integer programming approach. The heuristic starts with the solution of those problems where mixing components is not allowed, and searches the neighborhood of this solution to find better prospective solutions for the problems where mixing components is allowed. Then, a linear integer programming problem is solved to identify the recommended solution to the problem.", "paper_title": "System Reliability Optimization Considering Uncertainty: Minimization of the Coefficient of Variation for Series-Parallel Systems", "paper_id": "WOS:000294543800015"}