{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "computationally-expensive_black-box_functions"}, {"score": 0.028027257201936957, "phrase": "heb_problems"}, {"score": 0.00481495049065317, "phrase": "modeling_and_optimization_strategies"}, {"score": 0.004757087682427765, "phrase": "high-dimensional_design_problems"}, {"score": 0.004514241562580097, "phrase": "profound_impact"}, {"score": 0.00445997627516653, "phrase": "product_design"}, {"score": 0.0043358695338488445, "phrase": "multiple_challenges"}, {"score": 0.003780286517897356, "phrase": "related_modeling_and_optimization_strategies"}, {"score": 0.0033628392198449134, "phrase": "multiple_historical_reviews"}, {"score": 0.003335804608791029, "phrase": "relevant_subjects"}, {"score": 0.003040050100579337, "phrase": "model_approximation_techniques"}, {"score": 0.003003452468800793, "phrase": "direct_optimization_strategies"}, {"score": 0.0029197572138773237, "phrase": "non-gradient_optimization_algorithms"}, {"score": 0.0027704444816096484, "phrase": "organized_manner"}, {"score": 0.0027041233221381756, "phrase": "direct_modeling"}, {"score": 0.0024149629835339926, "phrase": "current_modeling_research"}, {"score": 0.0023666732429695908, "phrase": "sampling_and_modeling_techniques"}, {"score": 0.00224558083320154, "phrase": "underlying_expensive_functions"}, {"score": 0.0022006705963260433, "phrase": "survey_results"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["High dimensional", " Computationally-expensive", " Black-box function", " Approximation", " Design optimization", " Large-scale", " Metamodeling", " Surrogate"], "paper_abstract": "The integration of optimization methodologies with computational analyses/simulations has a profound impact on the product design. Such integration, however, faces multiple challenges. The most eminent challenges arise from high-dimensionality of problems, computationally-expensive analysis/simulation, and unknown function properties (i.e., black-box functions). The merger of these three challenges severely aggravates the difficulty and becomes a major hurdle for design optimization. This paper provides a survey on related modeling and optimization strategies that may help to solve High-dimensional, Expensive (computationally), Black-box (HEB) problems. The survey screens out 207 references including multiple historical reviews on relevant subjects from more than 1,000 papers in a variety of disciplines. This survey has been performed in three areas: strategies tackling high-dimensionality of problems, model approximation techniques, and direct optimization strategies for computationally-expensive black-box functions and promising ideas behind non-gradient optimization algorithms. Major contributions in each area are discussed and presented in an organized manner. The survey exposes that direct modeling and optimization strategies to address HEB problems are scarce and sporadic, partially due to the difficulty of the problem itself. Moreover, it is revealed that current modeling research tends to focus on sampling and modeling techniques themselves and neglect studying and taking the advantages of characteristics of the underlying expensive functions. Based on the survey results, two promising approaches are identified to solve HEB problems. Directions for future research are also discussed.", "paper_title": "Survey of modeling and optimization strategies to solve high-dimensional design problems with computationally-expensive black-box functions", "paper_id": "WOS:000274043200005"}