{"auto_keywords": [{"score": 0.04250104279694159, "phrase": "joint_model"}, {"score": 0.015604420328276313, "phrase": "dual_decomposition"}, {"score": 0.013920248153934965, "phrase": "word_segmentation"}, {"score": 0.008585514698422617, "phrase": "chinese_discharge_summaries"}, {"score": 0.007652997812757312, "phrase": "named_entity_recognition"}, {"score": 0.00481495049065317, "phrase": "entity_recognition"}, {"score": 0.004403480614319231, "phrase": "standard_corpus"}, {"score": 0.003779943062894615, "phrase": "conditional_random_field_models"}, {"score": 0.003696390664266446, "phrase": "natural_language_processing"}, {"score": 0.003614678418617691, "phrase": "single_model"}, {"score": 0.003392804886610623, "phrase": "combined_techniques"}, {"score": 0.0028903278985330117, "phrase": "independent_models"}, {"score": 0.0028688545415450407, "phrase": "incremental_models"}, {"score": 0.0028053842615436706, "phrase": "combined_labels"}, {"score": 0.002784540221128404, "phrase": "measurements_micro-"}, {"score": 0.0025366596616434793, "phrase": "gold_standard_corpus"}, {"score": 0.0021049977753042253, "phrase": "encouraging_results"}], "paper_keywords": [""], "paper_abstract": "Objective In this paper, we focus on three aspects: (1) to annotate a set of standard corpus in Chinese discharge summaries; (2) to perform word segmentation and named entity recognition in the above corpus; (3) to build a joint model that performs word segmentation and named entity recognition. Design Two independent systems of word segmentation and named entity recognition were built based on conditional random field models. In the field of natural language processing, while most approaches use a single model to predict outputs, many works have proved that performance of many tasks can be improved by exploiting combined techniques. Therefore, in this paper, we proposed a joint model using dual decomposition to perform both the two tasks in order to exploit correlations between the two tasks. Three sets of features were designed to demonstrate the advantage of the joint model we proposed, compared with independent models, incremental models and a joint model trained on combined labels. Measurements Micro-averaged precision (P), recall (R), and F-measure (F) were used to evaluate results. Results The gold standard corpus is created using 336 Chinese discharge summaries of 71 355 words. The framework using dual decomposition achieved 0.2% improvement for segmentation and 1% improvement for recognition, compared with each of the two tasks alone. Conclusions The joint model is efficient and effective in both segmentation and recognition compared with the two individual tasks. The model achieved encouraging results, demonstrating the feasibility of the two tasks.", "paper_title": "Joint segmentation and named entity recognition using dual decomposition in Chinese discharge summaries", "paper_id": "WOS:000337672800014"}