{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pairwise_interactions"}, {"score": 0.048201896565263386, "phrase": "distributed_systems"}, {"score": 0.03437198070337076, "phrase": "global_state"}, {"score": 0.004709193603747991, "phrase": "global_state_observation"}, {"score": 0.00450456611645112, "phrase": "data_streams"}, {"score": 0.004270665568018583, "phrase": "building_block"}, {"score": 0.004066898031169742, "phrase": "causality-based_pairwise_interactions"}, {"score": 0.0027989800906333784, "phrase": "interaction_type"}, {"score": 0.0027495914857929584, "phrase": "process_pair"}, {"score": 0.0026534064006291853, "phrase": "specific_conditions"}, {"score": 0.0026182085765020548, "phrase": "communication_structures"}, {"score": 0.002438203996977464, "phrase": "stipulated_interaction_type"}], "paper_keywords": ["causality", " data streams", " data fusion", " distributed system", " global state", " interactions", " intervals", " snapshot", " state observation"], "paper_abstract": "The problem of global state observation is fundamental to distributed systems and to the analysis of data streams. Many interactions in distributed systems can be analyzed in terms of the building block formed by the pairwise interactions of intervals at two processes. Considering causality-based pairwise interactions by which two processes may interact with each other, there are 40 orthogonal interaction types. For each pair of processes (P-i, P-j), let interaction type r(i,j) be of interest. This paper examines the problem: \"if a global state of interest to an application is specified in terms of such pairwise interaction types, one per pair of processes, how can Such a global state be detected?\" A solution identifies a global state in which the interaction type specified for each process pair is satisfied. This paper formulates the specific conditions on the communication structures to determine which of the intervals being examined at any time may never satisfy the stipulated interaction type for that pair of processes, and therefore that interval(s) need no longer be considered as forming a part of any solution. Based on this theory, the paper proposes two on-line distributed algorithms to solve the problem. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "Data-stream-based global event monitoring using pairwise interactions", "paper_id": "WOS:000256804600002"}