{"auto_keywords": [{"score": 0.037157834655044436, "phrase": "post-web_stage"}, {"score": 0.020947240476482467, "phrase": "research_collaboration"}, {"score": 0.010455076017776854, "phrase": "pre-web_and_post-web_stages"}, {"score": 0.00763675407846095, "phrase": "pre-web_stage"}, {"score": 0.00481495049065317, "phrase": "study_of_research_collaboration"}, {"score": 0.004672444473700524, "phrase": "coauthorship_analysis"}, {"score": 0.004511485198940203, "phrase": "possible_facilitative_role"}, {"score": 0.003306559295382181, "phrase": "research_impact"}, {"score": 0.003097865379563127, "phrase": "positive_relationship"}, {"score": 0.0027602925235474317, "phrase": "information_systems"}, {"score": 0.002719055901632759, "phrase": "time_periods"}, {"score": 0.0025989960809479104, "phrase": "empirical_results"}, {"score": 0.0023507916951658455, "phrase": "information_systems_articles"}, {"score": 0.002315658491366464, "phrase": "positive_effects"}, {"score": 0.0022925278792429553, "phrase": "interdisciplinary_collaborations"}, {"score": 0.002246955931290095, "phrase": "multiple_authors"}, {"score": 0.0021049977753042253, "phrase": "international_collaboration"}], "paper_keywords": ["collaboration", " authorship", " bibliometrics"], "paper_abstract": "To explore the possible facilitative role of the Internet in the process of research collaboration, this study endeavored to systematically compare the phenomenon of co-authorship and the impacts of co-authorship between pre-web and post-web stages in the field of information systems. Three hypotheses were proposed in this study. First, research collaboration increases in the post-web stage relative to the pre-web stage. Second, research collaboration is positively related to research impact, operationally defined as the number of citations. Lastly, the positive relationship between research collaboration and research impact is stronger in the post-web stage than that in the pre-web stage. Articles published in the field of information systems in both time periods were collected to test the hypotheses. The empirical results strongly support H1 and H2, showing that co-authorship increases in the post-web stage, and positively correlates with citations received by information systems articles. The positive effects of interdisciplinary collaborations and collaborations among multiple authors are enhanced in the post-web stage, but such enhancement is not found for international collaboration. H3 is partially supported.", "paper_title": "A Study of Research Collaboration in the Pre-Web and Post-Web Stages: A Coauthorship Analysis of the Information Systems Discipline", "paper_id": "WOS:000351395800009"}