{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "approximate_linear_programming_approach"}, {"score": 0.04405997637441545, "phrase": "linear_program"}, {"score": 0.040190189083244496, "phrase": "constraint_generation"}, {"score": 0.015571915698046524, "phrase": "network_revenue_management_problems"}, {"score": 0.013133924591148668, "phrase": "flight_legs"}, {"score": 0.009467025523672658, "phrase": "minimum-cost_network_flow_problems"}, {"score": 0.007826627731109478, "phrase": "reduced_linear_program"}, {"score": 0.004634459424542272, "phrase": "high-quality_bid_prices"}, {"score": 0.004439445472040688, "phrase": "dynamic_programming_formulation"}, {"score": 0.003958439439112026, "phrase": "airline_network"}, {"score": 0.003632080001489739, "phrase": "separate_integer_program"}, {"score": 0.003529364798514874, "phrase": "integer_programs"}, {"score": 0.0034790978593553794, "phrase": "slow_convergence_behavior"}, {"score": 0.002316532084420729, "phrase": "separate_problems"}, {"score": 0.00220823903315848, "phrase": "practically_appealing_interpretation"}, {"score": 0.002187194307878705, "phrase": "computational_experiments"}, {"score": 0.0021049977753042253, "phrase": "computation_time"}], "paper_keywords": ["dynamic programming optimal control", " applications", " transportation", " air", " revenue management", " approximate dynamic programming"], "paper_abstract": "One method to obtain high-quality bid prices for network revenue management problems involves using the approximate linear programming approach on the dynamic programming formulation of the problem. This approach ends up with a linear program whose number of constraints increases exponentially with the number of flight legs in the airline network. The linear program is solved using constraint generation, where each constraint can be generated by solving a separate integer program. The necessity to solve integer programs and the slow convergence behavior of constraint generation are generally recognized as drawbacks of this approach. In this paper, we show how to effectively eliminate these drawbacks. In particular, we establish that constraint generation can actually be carried out by solving minimum-cost network flow problems with natural integer solutions. Furthermore, using the structure of minimum-cost network flow problems, we a priori reduce the number of constraints in the linear program from exponential to linear in the number of flight legs. It turns out that the reduced linear program can be solved without using separate problems to generate constraints. The reduced linear program also provides a practically appealing interpretation. Computational experiments indicate that our results can speed up the computation time for the approximate linear programming approach by a factor ranging between 13 and 135.", "paper_title": "On the Approximate Linear Programming Approach for Network Revenue Management Problems", "paper_id": "WOS:000331086100009"}