{"auto_keywords": [{"score": 0.03227735483741963, "phrase": "tripartite_trench_termination"}, {"score": 0.013771581997452296, "phrase": "reverse_leakage_current"}, {"score": 0.013203158379177243, "phrase": "simplified_step-etching_process"}, {"score": 0.008971789371546015, "phrase": "step-etching_process"}, {"score": 0.008651947255293828, "phrase": "first_time"}, {"score": 0.00481495049065317, "phrase": "research_of_tripartite_trench_termination_for_power_buried-gate_sit._purpose_-_the_purpose"}, {"score": 0.00453113241842654, "phrase": "high_power_buried-gate_static_induction_transistor"}, {"score": 0.003775803846431323, "phrase": "power_buried-gate_sit"}, {"score": 0.0031459887611258765, "phrase": "traditional_technical_processing"}, {"score": 0.0028541057064952876, "phrase": "gate-source_breakdown"}, {"score": 0.0027854565462509095, "phrase": "blocking_voltage"}, {"score": 0.0024963543716522087, "phrase": "traditional_processes"}, {"score": 0.0023063614119692476, "phrase": "optimum_etched_depth"}, {"score": 0.0021050104714494386, "phrase": "sit"}], "paper_keywords": ["Static loading", " Induction", " Transistors", " Electric current"], "paper_abstract": "Purpose - The purpose of this paper is to introduce trench termination for high power buried-gate static induction transistor (SIT) comprising three parts, which can inhibit the reverse leakage current substantially and paradisaical current. The simplified step-etching process will also be discussed in detail. Design/methodology/approach - For power buried-gate SIT, the trench termination comprises three grooves, gate electrode etching, mesa-groove etching and the separated groove, respectively. The simplified step-etching process is proposed to optimize the traditional technical processing. Findings - The tripartite trench termination of power SIT can inhibit the reverse leakage current, improve the gate-source breakdown and increase the blocking voltage. The step-etching process which is proposed for the first time, realizes the tripartite trench termination simultaneously which simplifies the traditional processes and is beneficial by protecting the surface of the die. The optimum etched depth of termination is also presented with experimentations. Originality/value - The tripartite trench termination of power SIT is novel and the step-etching process is also proposed for the first time.", "paper_title": "Research of tripartite trench termination for power buried-gate SIT", "paper_id": "WOS:000277371500015"}