{"auto_keywords": [{"score": 0.03469246557285302, "phrase": "club_members"}, {"score": 0.02663903524290925, "phrase": "screening_norms"}, {"score": 0.00481495049065317, "phrase": "successful_university_color_guard_club_members"}, {"score": 0.0044237033788643715, "phrase": "training_time"}, {"score": 0.004312622975366676, "phrase": "club_performance"}, {"score": 0.004081385289516914, "phrase": "color_guard_club"}, {"score": 0.004046923261950549, "phrase": "chienkuo_technology_university"}, {"score": 0.00378145978325955, "phrase": "color_guard_member"}, {"score": 0.003150900886669123, "phrase": "regression_analysis"}, {"score": 0.002870006736445581, "phrase": "regression_model"}, {"score": 0.0027978304423349246, "phrase": "logistic_regression_analysis"}, {"score": 0.0027274643070540733, "phrase": "test_data"}, {"score": 0.0026929458952693465, "phrase": "initial_color_guard_club_members"}, {"score": 0.0024527767211457046, "phrase": "factor_analysis"}, {"score": 0.002391067964886602, "phrase": "latent_factors"}, {"score": 0.0022339789476489877, "phrase": "future_selection"}, {"score": 0.002215081186105616, "phrase": "color_guard_members"}], "paper_keywords": ["Color guard club", " Member selection", " Screening norms", " Discriminant analysis", " Factor analysis"], "paper_abstract": "The purpose of this paper is to determine how to place students in the most appropriate club, to save training time and expenses, and maximize club performance. To this end, this research utilizes the example of the color guard club at Chienkuo Technology University (CTU). First, the authors researched the characteristics needed to be a color guard member. Second, a series of tests for measuring these characteristics was designed. Third, the authors administered the tests to all the club members and recorded the results. Fourth, after the club members had received one year of training, the authors ran regression analysis by using data from the tests of those who successfully passed the training. From this, the authors obtained a regression model. The authors then ran logistic regression analysis and discriminant analysis oil the test data of all initial color guard club members, including those who eventually passed the training and those who eventually withdrew, to establish screening norms. Last, using factor analysis, the authors found the latent factors. These factors, along with the screening norms, call serve as a foundation for future selection of color guard members. This process of selecting club members scientifically may be adopted by other clubs in order to match students and clubs most effectively. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A factor analysis based selection process for predicting successful university color guard club members", "paper_id": "WOS:000262178100016"}