{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.029251789737065388, "phrase": "sensor_networks"}, {"score": 0.004466519142879166, "phrase": "security_issues"}, {"score": 0.004330571125759726, "phrase": "wsn"}, {"score": 0.0040886093072615, "phrase": "existing_technology_mechanisms"}, {"score": 0.0032919615578986816, "phrase": "front-end_proxy"}, {"score": 0.0032485526269852606, "phrase": "sensor_network"}, {"score": 0.0030264946886983833, "phrase": "sensor_nodes"}, {"score": 0.0029602552900111433, "phrase": "internet_infrastructure"}, {"score": 0.00289546142998427, "phrase": "interesting_advances"}, {"score": 0.002661883310629088, "phrase": "open_issue"}, {"score": 0.0025806490053534316, "phrase": "current_state"}, {"score": 0.0024579623598183355, "phrase": "secure_sensor_network"}, {"score": 0.0023935128386292966, "phrase": "internet_hosts"}, {"score": 0.0021049977753042253, "phrase": "research_challenges"}], "paper_keywords": ["Computer networks", " Wireless", " Data security", " Integration", " Internet"], "paper_abstract": "Purpose - This paper aims to analyze the security issues that arise when integrating wireless sensor networks (WSN) and the internet. Also, it seeks to review whether existing technology mechanisms are suitable and can be applied in this context. Design/methodology/approach - The paper considers the possible approaches that can be used to connect a WSN with the internet, and analyzes the security of their interactions. Findings - By providing the services of the network through a front-end proxy, a sensor network and the internet can interact securely. There are other challenges to be solved if the sensor nodes are integrated into the internet infrastructure, although there exists interesting advances on his matter. Research limitations/implications - The complete integration of sensor networks and the internet still remains as an open issue. Practical implications - With the current state of the art, it is possible to develop a secure sensor network that can provide its services to internet hosts with certain security properties. Originality/value - The paper studies the interactions between sensor networks and the internet from the point of view of security. It identifies both solutions and research challenges.", "paper_title": "Integrating wireless sensor networks and the internet: a security analysis", "paper_id": "WOS:000265859500008"}