{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hidden_additivity"}, {"score": 0.004759635663291431, "phrase": "two-factor_unreplicated_experiments"}, {"score": 0.004597457370802855, "phrase": "unreplicated_two-factor_experiments"}, {"score": 0.004389745162172933, "phrase": "considerable_attention"}, {"score": 0.0035648266669315943, "phrase": "ungrouped_factor"}, {"score": 0.0033450437338616596, "phrase": "group_membership"}, {"score": 0.0032309093154028663, "phrase": "plausible_groupings"}, {"score": 0.0030492472433481764, "phrase": "possible_configurations"}, {"score": 0.0024756080101497086, "phrase": "recent_study"}, {"score": 0.002447101794397243, "phrase": "copy_number_variation"}, {"score": 0.002363532907211947, "phrase": "simulation_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Interaction effects", " Latent variables", " Non-additivity"], "paper_abstract": "Assessment of interaction in unreplicated two-factor experiments is a challenging problem that has received considerable attention in the literature. A model is proposed in which the levels of one factor belong in two or more groups. Within each group the effects of the two factors are additive but the groups may interact with the ungrouped factor. This structure is called \"hidden additivity\" if group membership is latent. To identify plausible groupings a search is performed over the space of all possible configurations, or placement of units into two or more groups. A multiplicity-adjusted all-configurations maximum interaction F (ACMIF) test to detect hidden additivity is developed. The method is illustrated using two data sets taken from the literature and a third taken from a recent study of copy number variation due to lymphoma. A simulation study demonstrates the power of the test for hidden additivity and compares it with other well-known tests from the literature. Published by Elsevier B.V.", "paper_title": "A method for detecting hidden additivity in two-factor unreplicated experiments", "paper_id": "WOS:000323297000007"}