{"auto_keywords": [{"score": 0.048010005733846825, "phrase": "metric_learning"}, {"score": 0.04743405832670911, "phrase": "multi-view_data"}, {"score": 0.00481495049065317, "phrase": "multiple_views"}, {"score": 0.004191007935893067, "phrase": "single_view_circumstances"}, {"score": 0.0037646032729006214, "phrase": "co-training_framework"}, {"score": 0.0036476222647061243, "phrase": "algorithm-independent_framework"}, {"score": 0.0034461093496505127, "phrase": "mahalanobis_metrics"}, {"score": 0.0034028574973016933, "phrase": "multi-view_settings"}, {"score": 0.0032763212574036748, "phrase": "off-the-shelf_single-view_metric_learning_algorithm"}, {"score": 0.002905752244360772, "phrase": "unlabeled_set"}, {"score": 0.0027451110240633144, "phrase": "next_loop"}, {"score": 0.002186395051086251, "phrase": "semi-supervised_circumstances"}], "paper_keywords": ["multi-view learning", " metric learning", " algorithm-independent framework"], "paper_abstract": "We address the problem of metric learning for multi-view data. Many metric learning algorithms have been proposed, most of them focus just on single view circumstances, and only a few deal with multi-view data. In this paper, motivated by the co-training framework, we propose an algorithm-independent framework, named co-metric, to learn Mahalanobis metrics in multi-view settings. In its implementation, an off-the-shelf single-view metric learning algorithm is used to learn metrics in individual views of a few labeled examples. Then the most confidently-labeled examples chosen from the unlabeled set are used to guide the metric learning in the next loop. This procedure is repeated until some stop criteria are met. The framework can accommodate most existing metric learning algorithms whether types-of-side-information or example-labels are used. In addition it can naturally deal with semi-supervised circumstances under more than two views. Our comparative experiments demonstrate its competiveness and effectiveness.", "paper_title": "Co-metric: a metric learning algorithm for data with multiple views", "paper_id": "WOS:000320775200005"}