{"auto_keywords": [{"score": 0.03786464427422485, "phrase": "hh_neuron"}, {"score": 0.032146637220768326, "phrase": "brief_current_pulse"}, {"score": 0.00481495049065317, "phrase": "hodgkin-huxley_neuron"}, {"score": 0.0046118021635786315, "phrase": "nonlinear_system"}, {"score": 0.0039942998891989955, "phrase": "perturbation_method"}, {"score": 0.003853251284913932, "phrase": "spike_annihilation"}, {"score": 0.0037038224217016817, "phrase": "spike_generation"}, {"score": 0.0034097787109430384, "phrase": "quiescent_state"}, {"score": 0.003373181367365139, "phrase": "spiking_state"}, {"score": 0.0033490008882413103, "phrase": "vice_versa"}, {"score": 0.003253994336864267, "phrase": "general_system"}, {"score": 0.0026889720516076205, "phrase": "numerical_simulations"}, {"score": 0.0021049977753042253, "phrase": "inverse_problem"}], "paper_keywords": ["Hodgkin-Huxley neuron", " spikes", " annihilation"], "paper_abstract": "The Hodgkin-Huxley (HH) neuron is a nonlinear system with two stable states: A fixed point and a limit cycle. Both of them co-exist. The behavior of this neuron can be switched between these two equilibria, namely spiking and resting respectively, by using a perturbation method. The change from spiking to resting is named Spike Annihilation, and the transition from resting to spiking is named Spike Generation. Our intention is to determine if the HH neuron in 2D is controllable (i.e., if it can be driven from a quiescent state to a spiking state and vice versa). It turns out that the general system is unsolvable.(1) In this paper, first of all,(2) we analytically prove the existence of a brief current pulse, which, when delivered to the HH neuron during its repetitively firing state, annihilates its spikes. We also formally derive the characteristics of this brief current pulse. We then proceed to explore experimentally, by using numerical simulations, the properties of this pulse, namely the range of time when it can be inserted (the minimum phase and the maximum phase), its magnitude, and its duration. In addition, we study the solution of annihilating the spikes by using two successive stimuli, when the first is, of its own, unable to annihilate the neuron. Finally, we investigate the inverse problem of annihilation, namely the spike generation problem, when the neuron switches from resting to firing.", "paper_title": "Spikes annihilation in the Hodgkin-Huxley neuron", "paper_id": "WOS:000253623800005"}