{"auto_keywords": [{"score": 0.043386623096297906, "phrase": "temperature_parameter"}, {"score": 0.015719716506582538, "phrase": "confidence_level"}, {"score": 0.015480692676838532, "phrase": "agent's_experience"}, {"score": 0.015245246995800028, "phrase": "internal_model"}, {"score": 0.004410248125081398, "phrase": "sugarscape_model"}, {"score": 0.004275650416511604, "phrase": "multi_agent_systems"}, {"score": 0.004209893377338457, "phrase": "conventional_research"}, {"score": 0.0026161698049580804, "phrase": "state_transition"}, {"score": 0.002251542790734307, "phrase": "numerical_examples"}, {"score": 0.0021826828321952615, "phrase": "learning_speed"}, {"score": 0.0021049977753042253, "phrase": "conventional_method"}], "paper_keywords": ["multi-agent system", " Sugarscape model", " confidence level", " temperature parameter of internal model"], "paper_abstract": "In this paper, we focus attention on a Sugarscape model which is one of the multi agent systems. In conventional research, the temperature parameter used in a case where an agent determines action through learning, is assumed to be the same value for all agents. However, this is effective when all agents experience all states equally. Since the environment which surrounds an agent differs for every agent, it is necessary to set up a temperature parameter of an internal model suitable for an agent's experience. So, we propose confidence level of temperature parameter which can gain automatically based on its confidence level. Here, the degree of comprehension of the agent about state transition is called confidence level. Thereby, an improvement of learning speed is expected, because each agent can gain the temperature suitable for his experience automatically. From numerical examples, we show that the learning speed in our proposal method is quicker than the conventional method.", "paper_title": "Application of confidence level based on agent's experience to improve internal model", "paper_id": "WOS:000255957800016"}