{"auto_keywords": [{"score": 0.049584128839210984, "phrase": "updtool"}, {"score": 0.008947838638219121, "phrase": "upd"}, {"score": 0.00481495049065317, "phrase": "snp_microarrays"}, {"score": 0.004691465925553365, "phrase": "computational_tool"}, {"score": 0.004272456401437226, "phrase": "homologous_chromosomal_segments"}, {"score": 0.003972504904621217, "phrase": "major_clinical_relevance"}, {"score": 0.003911010373894104, "phrase": "high-throughput_molecular_screening_techniques"}, {"score": 0.0037321585095070483, "phrase": "especially_the_subclassification"}, {"score": 0.0034881202694874405, "phrase": "snp"}, {"score": 0.0032769720645483102, "phrase": "five_positive_controls"}, {"score": 0.003143341238802547, "phrase": "hapmap_project"}, {"score": 0.0031107911390188055, "phrase": "negative_controls"}, {"score": 0.0028921584725218642, "phrase": "non-mosaic_upd"}, {"score": 0.002633425544817301, "phrase": "chromosomal_breakage_points"}, {"score": 0.0025259712348798323, "phrase": "microsatellite_analysis"}, {"score": 0.002385326947545194, "phrase": "snptrio"}, {"score": 0.002311933249234786, "phrase": "upd_detection"}], "paper_keywords": [""], "paper_abstract": "UPDtool is a computational tool for detection and classification of uniparental disomy (UPD) in trio SNP-microarray experiments. UPDs are rare events of chromosomal malsegregation and describe the condition of two homologous chromosomes or homologous chromosomal segments that were inherited from one parent. The occurrence of UPD can be of major clinical relevance. Though high-throughput molecular screening techniques are widely used, detection of UPDs and especially the subclassification remains complex. We developed UPDtool to detect and classify UPDs from SNP microarray data of parent-child trios. The algorithm was tested using five positive controls including both iso- and heterodisomic segmental UPDs and 30 trios from the HapMap project as negative controls. With UPDtool, we were able to correctly identify all occurrences of non-mosaic UPD within our positive controls, whereas no occurrence of UPD was found within our negative controls. In addition, the chromosomal breakage points could be determined more precisely than by microsatellite analysis. Our results were compared with both the gold standard, microsatellite analysis and SNPtrio, another program available for UPD detection. UPDtool is platform independent, light weight and flexible. Because of its simple input format, UPDtool may also be used with other high-throughput technologies (e.g. next-generation sequencing).", "paper_title": "UPDtool: a tool for detection of iso- and heterodisomy in parent-child trios using SNP microarrays", "paper_id": "WOS:000320065400012"}