{"auto_keywords": [{"score": 0.048239757080509704, "phrase": "vehicular_communications"}, {"score": 0.033831337253526786, "phrase": "varon"}, {"score": 0.00481495049065317, "phrase": "networking_protocol"}, {"score": 0.004434824354230475, "phrase": "initial_studies"}, {"score": 0.004214637810698362, "phrase": "real_field_operational_tests"}, {"score": 0.0038363485899400285, "phrase": "necessary_equipment"}, {"score": 0.0037471850931318942, "phrase": "simulation_tools"}, {"score": 0.0036600862989330106, "phrase": "highly_dynamic_and_complex_characteristics"}, {"score": 0.00351938145050947, "phrase": "practical_research"}, {"score": 0.0031658283119347396, "phrase": "multi-hop_wireless_vehicular_communication_protocol"}, {"score": 0.003092200512475624, "phrase": "extensive_simulations"}, {"score": 0.002915514089373717, "phrase": "lab-based_environment"}, {"score": 0.002847691227421257, "phrase": "real-life_testbed"}, {"score": 0.0028143720888311537, "phrase": "long_and_exhausting_process"}, {"score": 0.0027597018725736165, "phrase": "common_assumptions"}, {"score": 0.002674423963978094, "phrase": "real_situations"}, {"score": 0.0025215486544004134, "phrase": "real_vehicles"}, {"score": 0.0021551702945512494, "phrase": "real_scenario"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["VANET", " Network mobility", " Route optimization", " Experimentation", " Lessons learned", " Prototyping"], "paper_abstract": "Research on vehicular communications has been quite extensive over the past few decades. Most of the initial studies were theoretical and research has just recently moved to more experimental works. Conducting real field operational tests is extremely challenging due to the number of vehicles required, the lack of control over the environment and the cost of the necessary equipment and personnel. However, simulation tools may not reflect properly the highly dynamic and complex characteristics of the vehicular scenario. This article explores why practical research in the field of vehicular communications is so demanding, by reporting on our experience in prototyping and experimentally evaluating VARON. Published in 2008, VARON is a multi-hop wireless vehicular communication protocol which was already validated via extensive simulations. In this work, we have fully implemented it, first on a lab-based environment, and then in a real-life testbed. This long and exhausting process has shown that some common assumptions do not necessarily hold when evaluated under real situations, as well as taught us valuable lessons on how to design and conduct experiments with real vehicles. We believe that the experience and lessons learned during this process do not only apply to VARON, but also to other multi-hop wireless vehicular communication solutions, and that therefore these lessons are helpful for other researchers willing to validate their protocols in a real scenario. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On the implementation, deployment and evaluation of a networking protocol for VANETs: The VARON case", "paper_id": "WOS:000337660200002"}