{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "scientific_collaborators"}, {"score": 0.004386887374401584, "phrase": "research_community"}, {"score": 0.003726967166630923, "phrase": "valuable_tools"}, {"score": 0.003662410853488772, "phrase": "researchers'_outputs"}, {"score": 0.0034551632687788857, "phrase": "proportional_collaboration"}, {"score": 0.002917931350071647, "phrase": "dependence_degree"}, {"score": 0.002720785798036066, "phrase": "web_application"}, {"score": 0.002566685388128598, "phrase": "visualization_tools"}, {"score": 0.002492931483018372, "phrase": "scientific_dependences"}, {"score": 0.002421291757425244, "phrase": "dblp_bibliographic_database"}, {"score": 0.002324433454350404, "phrase": "web_environment"}, {"score": 0.0021049977753042253, "phrase": "proposed_evaluation_measure"}], "paper_keywords": ["Evaluation metrics", " Social networks", " Research evaluation", " Collaboration analysis", " Data visualization"], "paper_abstract": "The evaluation of the work of a researcher and its impact on the research community has been deeply studied in literature through the definition of several measures, first among all the h-index and its variations. Although these measures represent valuable tools for analyzing researchers' outputs, they usually assume the co-authorship to be a proportional collaboration between the parts, missing out their relationships and the relative scientific influences. In this work, we propose the d-index, a novel measure that estimates the dependence degree between authors on their research environment along their entire scientific publication history. We also present a web application that implements these ideas and provides a number of visualization tools for analyzing and comparing scientific dependences among all the scientists in the DBLP bibliographic database. Finally, relying on this web environment, we present case and user studies that highlight both the validity and the reliability of the proposed evaluation measure.", "paper_title": "The d-index: Discovering dependences among scientific collaborators from their bibliographic data records", "paper_id": "WOS:000310964500002"}