{"auto_keywords": [{"score": 0.04911477212520224, "phrase": "graphical_models"}, {"score": 0.04008364158880181, "phrase": "graphical_model"}, {"score": 0.015719716506582538, "phrase": "multi-valued_decision_diagrams"}, {"score": 0.012746892047166015, "phrase": "aomdd"}, {"score": 0.008470493236797284, "phrase": "worst_case"}, {"score": 0.00462291551375938, "phrase": "recently_introduced_framework"}, {"score": 0.004244102948402086, "phrase": "function_decomposition_structure"}, {"score": 0.004158563941891469, "phrase": "compiled_data_structures"}, {"score": 0.004124831019063503, "phrase": "general_weighted_graphical_models"}, {"score": 0.003771282384646587, "phrase": "canonical_form"}, {"score": 0.0031012349116334606, "phrase": "reduction_rules"}, {"score": 0.0028935680100446583, "phrase": "bucket_elimination_schedule"}, {"score": 0.0028121429464519733, "phrase": "input_functions"}, {"score": 0.002699769374493867, "phrase": "compilation_time"}, {"score": 0.0024083881142747954, "phrase": "ordered_binary_decision_diagrams"}, {"score": 0.0023121112251855667, "phrase": "semantic_treewidth"}, {"score": 0.0022196745041124888, "phrase": "decision_diagram"}, {"score": 0.0021049977753042253, "phrase": "experimental_evaluation"}], "paper_keywords": [""], "paper_abstract": "Inspired by the recently introduced framework of AND/OR search spaces for graphical models, we propose to augment Multi-Valued Decision Diagrams (MDD) with AND nodes, in order to capture function decomposition structure and to extend these compiled data structures to general weighted graphical models (e. g., probabilistic models). We present the AND/OR Multi-Valued Decision Diagram (AOMDD) which compiles a graphical model into a canonical form that supports polynomial (e. g., solution counting, belief updating) or constant time (e. g. equivalence of graphical models) queries. We provide two algorithms for compiling the AOMDD of a graphical model. The first is search-based, and works by applying reduction rules to the trace of the memory intensive AND/OR search algorithm. The second is inference-based and uses a Bucket Elimination schedule to combine the AOMDDs of the input functions via the the APPLY operator. For both algorithms, the compilation time and the size of the AOMDD are, in the worst case, exponential in the treewidth of the graphical model, rather than pathwidth as is known for ordered binary decision diagrams (OBDDs). We introduce the concept of semantic treewidth, which helps explain why the size of a decision diagram is often much smaller than the worst case bound. We provide an experimental evaluation that demonstrates the potential of AOMDDs.", "paper_title": "AND/OR Multi-Valued Decision Diagrams (AOMDDs) for Graphical Models", "paper_id": "WOS:000262181000001"}