{"auto_keywords": [{"score": 0.024196682588943436, "phrase": "privacy_policies"}, {"score": 0.023675347540328275, "phrase": "popular_websites"}, {"score": 0.00481495049065317, "phrase": "computer-readable_privacy_policies"}, {"score": 0.004688321299229397, "phrase": "privacy_preferences"}, {"score": 0.00378767277402891, "phrase": "typical_searches"}, {"score": 0.003574929398913029, "phrase": "e-commerce_searches"}, {"score": 0.0032416819339366712, "phrase": "time_period"}, {"score": 0.002900426826591769, "phrase": "high_rates"}, {"score": 0.002874726518572154, "phrase": "syntax_errors"}, {"score": 0.002761856557698856, "phrase": "critical_errors"}, {"score": 0.002352886041381761, "phrase": "completely_different_meanings"}], "paper_keywords": ["P3P", " privacy policies", " search engines", " e-commerce"], "paper_abstract": "We studied the deployment of computer-readable privacy policies encoded using the standard W3C platform for privacy preferences (P3P) format to inform questions about P3P's usefulness to end users and researchers. We found that P3P adoption is increasing overall and that P3P adoption rates greatly vary across industries. We found that P3P had been deployed on 10% of the sites returned in the top-20 results of typical searches, and on 21% of the sites returned in the top-20 results of e-commerce searches. We examined a set of over 5000 websites in both 2003 and 2006 and found that P3P deployment among these sites increased over that time period, although we observed decreases in some sectors. In the Fall of 2007 we observed 470 new P3P policies created over a 2-month period. We found high rates of syntax errors among P3P policies, but much lower rates of critical errors that prevent a P3P user agent from interpreting them. We also found that most P3P policies have discrepancies with their natural language counterparts. Some of these discrepancies can be attributed to ambiguities, while others cause the two policies to have completely different meanings. Finally, we show that the privacy policies of P3P-enabled popular websites are similar to the privacy policies of popular websites that do not use P3P. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "P3P deployment on websites", "paper_id": "WOS:000259326900004"}