{"auto_keywords": [{"score": 0.03840661734139333, "phrase": "lifting"}, {"score": 0.008713625302921638, "phrase": "gossip-based_content_dissemination_systems"}, {"score": 0.004668059458774745, "phrase": "high-bandwidth_content"}, {"score": 0.004632039024076267, "phrase": "video_streams"}, {"score": 0.004596295252559861, "phrase": "peer-to-peer_fashion"}, {"score": 0.004331228453220757, "phrase": "scarce_resource"}, {"score": 0.003865826699096508, "phrase": "dynamic_nature"}, {"score": 0.003835972725191194, "phrase": "inherent_randomness"}, {"score": 0.003816197777388722, "phrase": "gossip_protocols"}, {"score": 0.0037769520261285872, "phrase": "high_scalability_requirements"}, {"score": 0.003757480190200645, "phrase": "video_streaming_systems"}, {"score": 0.0036996627006622975, "phrase": "difficult_challenge"}, {"score": 0.0032848684681050745, "phrase": "content_dissemination"}, {"score": 0.0031927521355659115, "phrase": "abnormal_behavior"}, {"score": 0.002841971477743441, "phrase": "theoretical_analysis"}, {"score": 0.002643386043540555, "phrase": "utility_function"}, {"score": 0.002358917661465133, "phrase": "maximum_overhead"}, {"score": 0.002328588996633081, "phrase": "good_detection_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["High-bandwidth content dissemination", " Peer-to-Peer (P2P)", " Free riding", " Distributed verifications"], "paper_abstract": "Gossip-based protocols have proven very efficient for disseminating high-bandwidth content such as video streams in a peer-to-peer fashion. However, for the protocols to work, nodes are required to collaborate by devoting a fraction of their upload bandwidth, a scarce resource for some of them, to forward the content they receive to other nodes. Consequently, such protocols suffer from freeriding, a common phenomenon on the Internet, which consists in selfishly benefiting from the system without contributing its fair share. Due to the dynamic nature and the inherent randomness of gossip protocols and to the high scalability requirements of video streaming systems, detecting freeriders is a difficult challenge. This paper presents LiFTinG, the first protocol for detecting freeriders, including colluding ones, in gossip-based content dissemination systems with asymmetric data exchanges. In addition, LiFTinG is still able to detect freeriders when network coding, a widely used technique to improve the efficiency of content dissemination, is used. LiFTinG relies on nodes to track abnormal behavior by cross-checking the history of their previous interactions and exploits the fact that nodes pick neighbors at random to prevent colluding nodes from mutually covering up their bad actions. We present a methodology for setting the parameters of LiFTinG to their optimal value, based on a theoretical analysis and we quantify theoretically the performance of LiFTinG. We derive, based on simulations, the optimal strategy of freeriders by taking into account, through a utility function, the benefit of freeriding and the probability of being detected. In addition to these simulations, we report on the deployment of LiFTinG on PlanetLab. In a 300-node system, where a stream of 674 kbps is broadcasted, LiFTinG incurs a maximum overhead of only 8% and provides good detection results: For instance, with 10% of freeriders decreasing their contribution by up to 30%, LiFTinG detects 86% of the freeriders after only 30 s and wrongfully expels only a few honest nodes (most of them actually being buggy). (c) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Tracking freeriders in gossip-based content dissemination systems", "paper_id": "WOS:000335610700021"}