{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "elastic_local_reconstruction"}, {"score": 0.04399037714588096, "phrase": "face_manifold_structure"}, {"score": 0.004725886853744007, "phrase": "single_face_image"}, {"score": 0.00453144352814823, "phrase": "new_face_recognition_algorithm"}, {"score": 0.004447600571127578, "phrase": "single_frontal-view_image"}, {"score": 0.0039024014688338964, "phrase": "local_image_blocks"}, {"score": 0.003812299519486331, "phrase": "image_blocks"}, {"score": 0.0036553070575015344, "phrase": "corresponding_local_image_block"}, {"score": 0.003329117824699891, "phrase": "image_block_pairs"}, {"score": 0.0027612315954598085, "phrase": "face_manifold"}, {"score": 0.0026105159490849364, "phrase": "different_databases"}, {"score": 0.00237733844863506, "phrase": "consistent_and_promising_experimental_results"}, {"score": 0.0022475295254231714, "phrase": "recognition_rates"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["face recognition", " elastic local reconstruction (ELR)", " illumination variations", " expression variations", " face manifold structure"], "paper_abstract": "In this paper, we propose a new face recognition algorithm based on a single frontal-view image for each face subject, which considers the effect of the face manifold structure. To compare two near-frontal face images, each face is considered a combination of a sequence of local image blocks. Each of the image blocks of one image can be reconstructed according to the corresponding local image block of the other face image. Then an elastic local reconstruction (ELR) method is proposed to measure the similarities between the image block pairs in order to measure the difference between the two face images. Our algorithm not only benefits from the face manifold structure, in terms of being robust to various image variations, but also is computationally simple because there is no need to build the face manifold. We evaluate the performance of our proposed face recognition algorithm with the use of different databases, which are produced under various conditions, e.g. lightings, expressions, perspectives, with/without glasses and occlusions. Consistent and promising experimental results were obtained, which show that our algorithm can greatly improve the recognition rates under all the different conditions. (C) 2007 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Face recognition using elastic local reconstruction based on a single face image", "paper_id": "WOS:000250028700031"}