{"auto_keywords": [{"score": 0.017898921245757232, "phrase": "monotone_sources"}, {"score": 0.011503774874497573, "phrase": "average_redundancy"}, {"score": 0.010251577798837432, "phrase": "huffman_code"}, {"score": 0.007666273152987699, "phrase": "almost_all_monotone_sources"}, {"score": 0.00481495049065317, "phrase": "minimum_average_redundancy_code"}, {"score": 0.004677372885331908, "phrase": "source_coding_problem"}, {"score": 0.004587835274176236, "phrase": "optimal_code"}, {"score": 0.003911367220315185, "phrase": "average_distribution"}, {"score": 0.0032546105164772995, "phrase": "large_n"}, {"score": 0.003146212656743413, "phrase": "fixed_code"}, {"score": 0.002997572637726648, "phrase": "symbol_probabilities"}, {"score": 0.002579847272930948, "phrase": "near-optimal_code"}, {"score": 0.0021049977753042253, "phrase": "maximum_redundancy"}], "paper_keywords": ["average redundancy", " monotone source", " huffman code", " minimum average redundancy code"], "paper_abstract": "Consider the source coding problem of finding the optimal code, in the sense of average redundancy, for the class of monotone sources with n symbols. The solution of this problem, known as the M code, is the Huffman code for the average distribution of the monotone sources. In this paper, we evaluate the average redundancy of the M code (on the class of monotone sources), and compare it with that of the Huffman code. It is demonstrated that for large n, although the M code is a fixed code (i.e., the codewords are independent of the symbol probabilities) for all monotone sources, its average redundancy is very close to that of the Huffman code. Moreover, it is shown that when n is large, the M code is a near-optimal code not only in the sense of average redundancy, but also the redundancy of almost all monotone sources. In particular, the redundancy of the M code converges in probability to its average value (similar or equal to 0.029). As a result, the maximum redundancy of the M code, which can be as large as log n log In n, rarely occurs.", "paper_title": "Near-Optimality of the Minimum Average Redundancy Code for Almost All Monotone Sources", "paper_id": "WOS:000296673300004"}