{"auto_keywords": [{"score": 0.022455229798814216, "phrase": "strategic_alignment"}, {"score": 0.0045599093158915326, "phrase": "recent_rise"}, {"score": 0.004515004397496303, "phrase": "environmental_uncertainty"}, {"score": 0.004130165601475531, "phrase": "dynamic_business_threats"}, {"score": 0.0036312482387007815, "phrase": "business_executive"}, {"score": 0.003023047748772801, "phrase": "contingency_theory"}, {"score": 0.0029637093924781825, "phrase": "research_model"}, {"score": 0.0029199689963238726, "phrase": "causal_relationships"}, {"score": 0.002834409847642238, "phrase": "matched_survey"}, {"score": 0.0027787638791664663, "phrase": "business_executives"}, {"score": 0.0026839922027139967, "phrase": "perceived_it_importance"}, {"score": 0.0026443691099806003, "phrase": "management_sophistication"}, {"score": 0.00240662380079115, "phrase": "planning_aspect"}], "paper_keywords": ["Contingency Theory", " Perceived IT Importance", " IT Management Sophistication", " Strategic Alignment"], "paper_abstract": "Yet with a recent rise in environmental uncertainty, firms are asking how their IT management can be more sophisticated in identifying and responding to changing and dynamic business threats and opportunities. Whether how firms perceive IT importance to the organization helps IT management sophistication and therefore strategic alignment is still not clear. This research investigates how business executive perceives IT importance for strategic alignment may be contingent upon IT management sophistication. IT management sophistication represents the extent to which IT management practices have evolved and formalized in planning, control, organization, and integration of IT activities. We use contingency theory to construct a research model to test causal relationships. Using data from a matched survey of IT and business executives in 109 firms, we show that perceived IT importance predicts IT management sophistication. particularly the control aspect, which is the most important aspect for strategic alignment; we also. show that planning aspect can be too formal and thereby offset strategic alignment. We further show that IT management sophistication mediates effective IT/business relationships; in which it can incentivise the building of a more comprehensive, agile and strategy-oriented system for collecting and analyzing market information. Implications of the findings are discussed.", "paper_title": "THE IMPACT OF IT MANAGEMENT SOPHISTICATION ON PERCEIVED IT IMPORTANCE IN STRATEGIC ALIGNMENT", "paper_id": "WOS:000208869000006"}