{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "data_extraction"}, {"score": 0.004143196873246147, "phrase": "raw_data"}, {"score": 0.003910441483033426, "phrase": "general_framework"}, {"score": 0.0038210283935447473, "phrase": "relevant_data"}, {"score": 0.003777088546146369, "phrase": "semi-structured_documents"}, {"score": 0.003268516165008941, "phrase": "hierarchical_organization"}, {"score": 0.003066945490483524, "phrase": "inductive_synthesis_algorithm"}, {"score": 0.0029967610945411593, "phrase": "intended_program"}, {"score": 0.002911278281894321, "phrase": "underlying_domain-specific_language"}, {"score": 0.0022565201625076876, "phrase": "flashextract"}, {"score": 0.0021921063460682293, "phrase": "intended_data"}], "paper_keywords": ["Languages", " Algorithms", " Human Factors", " Program Synthesis", " End-user Programming", " Programming by Examples"], "paper_abstract": "Various document types that combine model and view (e. g., text files, webpages, spreadsheets) make it easy to organize (possibly hierarchical) data, but make it difficult to extract raw data for any further manipulation or querying. We present a general framework FlashExtract to extract relevant data from semi-structured documents using examples. It includes: (a) an interaction model that allows end-users to give examples to extract various fields and to relate them in a hierarchical organization using structure and sequence constructs. (b) an inductive synthesis algorithm to synthesize the intended program from few examples in any underlying domain-specific language for data extraction that has been built using our specified algebra of few core operators (map, filter, merge, and pair). We describe instantiation of our framework to three different domains: text files, webpages, and spreadsheets. On our benchmark comprising 75 documents, FlashExtract is able to extract intended data using an average of 2.36 examples in 0.84 seconds per field.", "paper_title": "FlashExtract: A Framework for Data Extraction by Examples", "paper_id": "WOS:000344455800055"}