{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.003951453722517865, "phrase": "new_aggregation_operator"}, {"score": 0.003857871979942733, "phrase": "ifowa_operator"}, {"score": 0.003677280504320636, "phrase": "induced_ifowa_operators"}, {"score": 0.0034016119212097826, "phrase": "intuitionistic_fuzzy_information"}, {"score": 0.0032814236411444022, "phrase": "i-ifowa_operator"}, {"score": 0.0032423089921154503, "phrase": "gifowa"}, {"score": 0.002628362641980801, "phrase": "interval-valued_intuitionistic_fuzzy_sets"}, {"score": 0.00240213106042981, "phrase": "decision_making_problems"}, {"score": 0.002373472641477602, "phrase": "intuitionistic_fuzzy_or_interval-valued_intuitionistic_fuzzy_information"}, {"score": 0.0021821915946356168, "phrase": "developed_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Intuitionistic fuzzy numbers", " Interval-valued intuitionistic fuzzy numbers", " Induced generalized intuitionistic fuzzy ordered weighted averaging (I-GIFOWA) operator", " Induced generalized interval-valued intuitionistic fuzzy ordered weighted averaging (I-GIIFOWA) operator"], "paper_abstract": "In this paper, we present the induced generalized intuitionistic fuzzy ordered weighted averaging (I-GIFOWA) operator. It is a new aggregation operator that generalized the IFOWA operator, including all the characteristics of both the generalized IFOWA and the induced IFOWA operators. It provides a very general formulation that includes as special cases a wide range of aggregation operators for intuitionistic fuzzy information, including all the particular cases of the I-IFOWA operator, GIFOWA operator and the induced intuitionistic fuzzy ordered geometric (I-IFOWG) operator. We also present the induced generalized interval-valued intuitionistic fuzzy ordered weighted averaging (I-GIIFOWA) operator to accommodate the environment in which the given arguments are interval-valued intuitionistic fuzzy sets. Further, we develop procedures to apply them to solve group multiple attribute decision making problems with intuitionistic fuzzy or interval-valued intuitionistic fuzzy information. Finally, we present their application to show the effectiveness of the developed methods. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "The induced generalized aggregation operators for intuitionistic fuzzy sets and their application in group decision making", "paper_id": "WOS:000299324200017"}