{"auto_keywords": [{"score": 0.04204086971446234, "phrase": "stochastic_gradients"}, {"score": 0.03252889548941494, "phrase": "bp"}, {"score": 0.00481495049065317, "phrase": "loopy_belief_propagation"}, {"score": 0.004788416208637939, "phrase": "relational_training"}, {"score": 0.004722715450671519, "phrase": "increasing_impact"}, {"score": 0.004657911938553288, "phrase": "large-scale_data_analysis"}, {"score": 0.004556062353747973, "phrase": "substantial_growth"}, {"score": 0.004493535274957768, "phrase": "machine_learning_applications"}, {"score": 0.00445642983394405, "phrase": "big_data"}, {"score": 0.004383131582126381, "phrase": "exciting_new_opportunity"}, {"score": 0.0041703614123283165, "phrase": "graphical_models"}, {"score": 0.004147364535298904, "phrase": "typical_ways"}, {"score": 0.004101748957038113, "phrase": "scaling_issue"}, {"score": 0.003978960855935886, "phrase": "mapreduce"}, {"score": 0.0037751895787179173, "phrase": "graph_structure"}, {"score": 0.00374399358035391, "phrase": "prominent_example"}, {"score": 0.00372333905856154, "phrase": "relational_models"}, {"score": 0.0031190870482768283, "phrase": "identical_messages"}, {"score": 0.003042349591036764, "phrase": "lifted_graph"}, {"score": 0.002975720170796222, "phrase": "original_one"}, {"score": 0.002776737611968975, "phrase": "mapreduceable"}, {"score": 0.0026126405272417783, "phrase": "appealing_idea"}, {"score": 0.00255539789092972, "phrase": "local_models"}, {"score": 0.002527247425576091, "phrase": "long-range_dependencies"}, {"score": 0.0024582171957247385, "phrase": "local_training_tasks"}, {"score": 0.0023844545208113886, "phrase": "first_scalable"}, {"score": 0.0023712823280330696, "phrase": "training_approaches"}, {"score": 0.0023001222556899327, "phrase": "mapreduced_fashion"}, {"score": 0.002262209824105154, "phrase": "online_training"}, {"score": 0.0021049977753042253, "phrase": "entire_mega-example"}], "paper_keywords": ["Statistical relational learning", " Lifted inference", " Lifted online training", " MapReduce"], "paper_abstract": "Judging by the increasing impact of machine learning on large-scale data analysis in the last decade, one can anticipate a substantial growth in diversity of the machine learning applications for \"big data\" over the next decade. This exciting new opportunity, however, also raises many challenges. One of them is scaling inference within and training of graphical models. Typical ways to address this scaling issue are inference by approximate message passing, stochastic gradients, and MapReduce, among others. Often, we encounter inference and training problems with symmetries and redundancies in the graph structure. A prominent example are relational models that capture complexity. Exploiting these symmetries, however, has not been considered for scaling yet. In this paper, we show that inference and training can indeed benefit from exploiting symmetries. Specifically, we show that (loopy) belief propagation (BP) can be lifted. That is, a model is compressed by grouping nodes together that send and receive identical messages so that a modified BP running on the lifted graph yields the same marginals as BP on the original one, but often in a fraction of time. By establishing a link between lifting and radix sort, we show that lifting is MapReduceable. Still, in many if not most situations training relational models will not benefit from this (scalable) lifting: symmetries within models easily break since variables become correlated by virtue of depending asymmetrically on evidence. An appealing idea for such situations is to train and recombine local models. This breaks long-range dependencies and allows to exploit lifting within and across the local training tasks. Moreover, it naturally paves the way for the first scalable lifted training approaches based on stochastic gradients, both in an online and a MapReduced fashion. On several datasets, the online training, for instance, converges to the same quality solution over an order of magnitude faster, simply because it starts optimizing long before having seen the entire mega-example even once.", "paper_title": "Exploiting symmetries for scaling loopy belief propagation and relational training", "paper_id": "WOS:000321273100005"}