{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_retrieval"}, {"score": 0.031763843900136826, "phrase": "information_science"}, {"score": 0.004297560964892607, "phrase": "start_state"}, {"score": 0.004149792080414689, "phrase": "information_search"}, {"score": 0.004095692768056685, "phrase": "ir_system"}, {"score": 0.0038862297330905836, "phrase": "computer_science_perspective"}, {"score": 0.003687439449869248, "phrase": "well-defined_question"}, {"score": 0.003408091901859624, "phrase": "information_science's_best_known_model"}, {"score": 0.0030281251520610604, "phrase": "information_system"}, {"score": 0.0029110999689379497, "phrase": "eight_adjacent_or_surrogate_concepts"}, {"score": 0.002508284945907166, "phrase": "six_testable_propositions"}, {"score": 0.0024113009621042677, "phrase": "central_assumption"}, {"score": 0.0023384629381463054, "phrase": "computer_science"}, {"score": 0.002287783663138828, "phrase": "information-or_answer-finding_system"}, {"score": 0.0021610874773389096, "phrase": "user-oriented_theory"}], "paper_keywords": [""], "paper_abstract": "This article proposes a theory of information need for information retrieval (IR). Information need traditionally denotes the start state for someone seeking information, which includes information search using an IR system. There are two perspectives on information need. The dominant, computer science perspective is that the user needs to find an answer to a well-defined question which is easy for the user to formulate into a query to the system. Ironically, information science's best known model of information need (Taylor, 1968) deems it to be a \"black box\"-unknowable and nonspecifiable by the user in a query to the information system. Information science has instead devoted itself to studying eight adjacent or surrogate concepts (information seeking, search and use; problem, problematic situation and task; sense making and evolutionary adaptation/information foraging). Based on an analysis of these eight adjacent/surrogate concepts, we create six testable propositions for a theory of information need. The central assumption of the theory is that while computer science sees IR as an information-or answer-finding system, focused on the user finding an answer, an information science or user-oriented theory of information need envisages a knowledge formulation/acquisition system.", "paper_title": "A Theory of Information Need for Information Retrieval That Connects Information to Knowledge", "paper_id": "WOS:000291953800002"}