{"auto_keywords": [{"score": 0.04933866662045337, "phrase": "statistical_and_rule-based_techniques"}, {"score": 0.02987089440189968, "phrase": "statistical_machine_translation_system"}, {"score": 0.00481495049065317, "phrase": "short_texts"}, {"score": 0.004547438494330851, "phrase": "small_number"}, {"score": 0.0039519004610213595, "phrase": "specific_category"}, {"score": 0.003850464100878052, "phrase": "high_proportion"}, {"score": 0.0036743708250589484, "phrase": "analysis_procedures"}, {"score": 0.003598705020845104, "phrase": "machine_learning_applications"}, {"score": 0.0035614563596982306, "phrase": "text_normalization_techniques"}, {"score": 0.00331125524068286, "phrase": "processing_and_analysis_purposes"}, {"score": 0.0029224275921964724, "phrase": "sms_messages"}, {"score": 0.002759769970554556, "phrase": "noisy_data"}, {"score": 0.0026061419474030633, "phrase": "small_manually_annotated_set"}, {"score": 0.0023361440016375972, "phrase": "proposed_methodology"}, {"score": 0.0022524959504997303, "phrase": "sms_haitian-cr"}], "paper_keywords": ["Normalization of short texts", " Statistical machine translation", " Automatic extraction of rules", " Perplexity"], "paper_abstract": "Short texts are typically composed of small number of words, most of which are abbreviations, typos and other kinds of noise. This makes the noise to signal ratio relatively high for this specific category of text. A high proportion of noise in the data is undesirable for analysis procedures as well as machine learning applications. Text normalization techniques are used to reduce the noise and improve the quality of text for processing and analysis purposes. In this work, we propose a combination of statistical and rule-based techniques to normalize short texts. More specifically, we focus our attention on SMS messages. We base our normalization approach on a statistical machine translation system which translates from noisy data to clean data. This system is trained on a small manually annotated set. Then, we study several automatic methods to extract more general rules from the normalizations generated with the statistical machine translation system. We illustrate the proposed methodology by conducting some experiments with a SMS Haitian-Cr,ole data collection. In order to evaluate the performance of our methodology we use several Haitian-Cr,ole dictionaries, the well-known perplexity criteria and the achieved reduction of vocabulary.", "paper_title": "Automatic normalization of short texts by combining statistical and rule-based techniques", "paper_id": "WOS:000316004500009"}