{"auto_keywords": [{"score": 0.04974351188371698, "phrase": "radio_networks"}, {"score": 0.04698044801656796, "phrase": "radio_transmissions"}, {"score": 0.015719716506582538, "phrase": "bandwidth_allocation"}, {"score": 0.014510845579221278, "phrase": "interference_constraints"}, {"score": 0.011979250241040424, "phrase": "traffic_demands"}, {"score": 0.004664983066310498, "phrase": "optimization_problem"}, {"score": 0.004378854464130883, "phrase": "physical_space"}, {"score": 0.004332894955218135, "phrase": "common_resource"}, {"score": 0.004168448339217754, "phrase": "concurrent_transmissions"}, {"score": 0.004081385289516914, "phrase": "bandwidth_allocation_problem"}, {"score": 0.0035330290755534234, "phrase": "multicommodity_flow_problem"}, {"score": 0.003483631502938922, "phrase": "capacity_constraints"}, {"score": 0.0033988361874354306, "phrase": "non-interfering_transmissions"}, {"score": 0.0033395304916220086, "phrase": "formal_specification"}, {"score": 0.0031455000569352454, "phrase": "independent_sets"}, {"score": 0.002983652306921617, "phrase": "maximum_weight_independent_set"}, {"score": 0.002646880721119838, "phrase": "radio_network"}, {"score": 0.0023315400785212785, "phrase": "euclidean_space"}, {"score": 0.0022192891418394514, "phrase": "unique_node"}, {"score": 0.002134888329742086, "phrase": "single_commodity_flow"}], "paper_keywords": ["Bandwidth allocation", " Radio networks", " Approximation algorithms", " Steady state traffic", " Maximum concurrent flow"], "paper_abstract": "We define and study an optimization problem that is motivated by bandwidth allocation in radio networks. Because radio transmissions are subject to interference constraints in radio networks, physical space is a common resource that the nodes have to share in such a way, that concurrent transmissions do not interfere. The bandwidth allocation problem we study under these constraints is the following. Given bandwidth (traffic) demands between the nodes of the network, the objective is to schedule the radio transmissions in such a way that the traffic demands are satisfied. The problem is similar to a multicommodity flow problem, where the capacity constraints are replaced by the more complex notion of non-interfering transmissions. We provide a formal specification of the problem that we call round weighting. By modeling non-interfering radio transmissions as independent sets, we relate the complexity of round weighting to the complexity of various independent set problems (e.g. maximum weight independent set, vertex coloring, fractional coloring). From this relation, we deduce that in general, round weighting is hard to approximate within n(1-epsilon) (n being the size of the radio network). We also provide polynomial (exact or approximation) algorithms e.g. in the following two cases: (a) when the interference constraints are specific (for instance for a network whose vertices belong to the Euclidean space), or (b) when the traffic demands are directed towards a unique node in the network (also called gathering, analogous to single commodity flow). (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "On the complexity of bandwidth allocation in radio networks", "paper_id": "WOS:000260644600006"}