{"auto_keywords": [{"score": 0.01541440945237541, "phrase": "heterogeneous_networks"}, {"score": 0.00481495049065317, "phrase": "drug-target_interaction_prediction"}, {"score": 0.004643055780443262, "phrase": "novel_drug-target_associations"}, {"score": 0.004536862734384202, "phrase": "new_drugs"}, {"score": 0.004447766706144458, "phrase": "biological_knowledge"}, {"score": 0.004122077038067119, "phrase": "computational_approaches"}, {"score": 0.004067910470129423, "phrase": "indispensible_part"}, {"score": 0.00404109360612109, "phrase": "drug_target_association_discovery"}, {"score": 0.003820144626025562, "phrase": "heterogeneous_network"}, {"score": 0.003732702104052828, "phrase": "drugbank_database"}, {"score": 0.003623199939953831, "phrase": "parameter_variation"}, {"score": 0.0035755653799043, "phrase": "chemical_fingerprint_methods"}, {"score": 0.0034706569037527774, "phrase": "chemical_fingerprint"}, {"score": 0.0033025823350563087, "phrase": "optimal_values"}, {"score": 0.002271679416337276, "phrase": "top_ten_targets"}, {"score": 0.0021330830123432614, "phrase": "chemical_features"}, {"score": 0.0021049977753042253, "phrase": "novel_drug_target_interactions"}], "paper_keywords": ["Random walk with restart", " Prediction", " Drug", " Targets", " Chemical fingerprints"], "paper_abstract": "Background: Predicting novel drug-target associations is important not only for developing new drugs, but also for furthering biological knowledge by understanding how drugs work and their modes of action. As more data about drugs, targets, and their interactions becomes available, computational approaches have become an indispensible part of drug target association discovery. In this paper we apply random walk with restart (RWR) method to a heterogeneous network of drugs and targets compiled from DrugBank database and investigate the performance of the method under parameter variation and choice of chemical fingerprint methods. Results: We show that choice of chemical fingerprint does not affect the performance of the method when the parameters are tuned to optimal values. We use a subset of the ChEMBL15 dataset that contains 2,763 associations between 544 drugs and 467 target proteins to evaluate our method, and we extracted datasets of bioactivity <= 1 and <= 10 mu M activity cutoff. For 1 mu M bioactivity cutoff, we find that our method can correctly predict nearly 47, 55, 60% of the given drug-target interactions in the test dataset having more than 0, 1, 2 drug target relations for ChEMBL 1 mu M dataset in top 50 rank positions. For 10 mu M bioactivity cutoff, we find that our method can correctly predict nearly 32.4, 34.8, 35.3% of the given drug-target interactions in the test dataset having more than 0, 1, 2 drug target relations for ChEMBL 1 mu M dataset in top 50 rank positions. We further examine the associations between 110 popular top selling drugs in 2012 and 3,519 targets and find the top ten targets for each drug. Conclusions: We demonstrate the effectiveness and promise of the approach-RWR on heterogeneous networks using chemical features-for identifying novel drug target interactions and investigate the performance.", "paper_title": "Optimizing drug-target interaction prediction based on random walk on heterogeneous networks", "paper_id": "WOS:000359690400002"}