{"auto_keywords": [{"score": 0.04925367071541481, "phrase": "creative_genres"}, {"score": 0.014610885098352356, "phrase": "popular_culture"}, {"score": 0.012673965359570407, "phrase": "online_technology"}, {"score": 0.010435409021063343, "phrase": "creative_values"}, {"score": 0.00811841633526059, "phrase": "conceptual_framework"}, {"score": 0.00443308765153716, "phrase": "marketplace_pressures"}, {"score": 0.0037411604449359794, "phrase": "previous_studies"}, {"score": 0.0037087324991876727, "phrase": "genre_change"}, {"score": 0.0035199624440843892, "phrase": "human_actors"}, {"score": 0.0034742854447532678, "phrase": "information_technology"}, {"score": 0.003384695931421288, "phrase": "social_structures"}, {"score": 0.0032546105164772995, "phrase": "generic_artifacts"}, {"score": 0.00303553181618577, "phrase": "small_literary_magazines"}, {"score": 0.002918826667294298, "phrase": "ideal_subjects"}, {"score": 0.002818850283787242, "phrase": "important_role"}, {"score": 0.0023782753249846794, "phrase": "online_technologies"}], "paper_keywords": [""], "paper_abstract": "Producers in creative genres are frequently motivated by goals that put those producers in opposition to popular culture and marketplace pressures. Questions about whether those goals reflect values that belong specifically to print culture, or whether those values will continue to motivate producers in creative genres after the introduction of online technology, have not been answered empirically. Previous studies of genre change have been among those that have focused on the ability of human actors to use information technology to alter those genres as social structures. However, these studies have focused on generic artifacts rather than on the creative values that motivated the creation of those artifacts. Editors of small literary magazines (generally referred to as little magazines) make ideal subjects for this study. Creative values play an important role in their decisions, and they frequently publish poetry, fiction, and other work that stand in opposition to popular culture and literature. This study proposed and evaluated a conceptual framework for anticipating whether editors of little magazines will use online technologies to reinforce or alter the values characteristic of their genre. The study found that the values posited in the conceptual framework fit the goals expressed by little magazine editors. Not all editors held those values equally, however. These findings suggest that producers in creative genres can use online technology in ways that actually reflect an intensification of those values. The concept of intensifying use of technology (IUT) was posited to explain the differences.", "paper_title": "Technology, genres, and value change: The case of little magazines", "paper_id": "WOS:000237125400003"}