{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "publishing_behavior"}, {"score": 0.004671932143798307, "phrase": "bloggers'_topical_coverages"}, {"score": 0.004451846834142146, "phrase": "publishing_styles"}, {"score": 0.0038749521906474593, "phrase": "blog_website"}, {"score": 0.003232956879952914, "phrase": "different_topical_coverages"}, {"score": 0.003155784719225786, "phrase": "different_ways"}, {"score": 0.002813566267090177, "phrase": "business_hours"}, {"score": 0.0025853238923610076, "phrase": "different_publishing_behaviors"}, {"score": 0.0024932498388507084, "phrase": "large_\"buzz"}, {"score": 0.002419025278429845, "phrase": "voluminous_output"}, {"score": 0.0022771244331421586, "phrase": "extensive_analysis"}, {"score": 0.0021049977753042253, "phrase": "value_chain"}], "paper_keywords": ["blogosphere", " topical profile", " specialist", " generalist", " publishing behavior", " blogger clustering"], "paper_abstract": "Are bloggers' topical coverages related to their contributions, impacts, and publishing styles in the blogosphere? We investigated this question by grouping bloggers on the basis of their topical coverages and comparing their publishing behaviors. From a blog website with more than 370,000 posts, we first identified two types of bloggers: specialists and generalists. Then we studied and compared their respective publishing behaviors in the blogosphere. Our analysis suggested that bloggers with different topical coverages do behave in different ways. Specialists generally make more contributions than generalists. Specialists also tend to publish more on weekdays, during business hours, and on a more regular basis. We also revealed that specialists also have different publishing behaviors, with only a small fraction creating a large \"buzz\" or producing a voluminous output. As blogs start to gain more business value, an extensive analysis like ours can help various stakeholders in the blogosphere maximize their share of the value chain.", "paper_title": "Who blogs what: understanding the publishing behavior of bloggers", "paper_id": "WOS:000325432800005"}