{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "axiomatic_fuzzy_set_theory"}, {"score": 0.004767826806287385, "phrase": "support_vector_machines"}, {"score": 0.00462919213721188, "phrase": "classification_method"}, {"score": 0.004516733575701128, "phrase": "easily_interpretable_fuzzy_rules"}, {"score": 0.004216112320418982, "phrase": "training_data"}, {"score": 0.003858697684681798, "phrase": "learning_process"}, {"score": 0.0037834649508375544, "phrase": "fuzzy_set"}, {"score": 0.0037463983616303786, "phrase": "sound_linguistic_interpretation"}, {"score": 0.0030614565460256897, "phrase": "proposed_method"}, {"score": 0.0028715299874549245, "phrase": "proposed_algorithm"}, {"score": 0.0027741761880779535, "phrase": "linguistic_terms"}, {"score": 0.0025892330566358503, "phrase": "proposed_classification_method"}, {"score": 0.0025262061502713683, "phrase": "previously_published_fuzzy_rule-based_classifiers"}, {"score": 0.0023811153883132536, "phrase": "fuzzy_rule-based_classifier"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Interpretability", " AFS algebras", " Support vector machines", " Outliers", " Fuzzy descriptions"], "paper_abstract": "This paper proposes a classification method that is based on easily interpretable fuzzy rules and fully capitalizes on the two key technologies, namely pruning the outliers in the training data by SVMs (support vector machines), i.e., eliminating the influence of outliers on the learning process; finding a fuzzy set with sound linguistic interpretation to describe each class based on AFS (axiomatic fuzzy set) theory. Compared with other fuzzy rule-based methods, the proposed models are usually more compact and easily understandable for the users since each class is described by much fewer rules. The proposed method also comes with two other advantages, namely, each rule obtained from the proposed algorithm is simply a conjunction of some linguistic terms, there are no parameters that are required to be tuned. The proposed classification method is compared with the previously published fuzzy rule-based classifiers by testing them on 16 UCI data sets. The results show that the fuzzy rule-based classifier presented in this paper, offers a compact, understandable and accurate classification scheme. A balance is achieved between the interpretability and the accuracy. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A parsimony fuzzy rule-based classifier using axiomatic fuzzy set theory and support vector machines", "paper_id": "WOS:000295760600005"}