{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "mobile_environments"}, {"score": 0.004498994325265174, "phrase": "effective_means"}, {"score": 0.004446191638595989, "phrase": "revenue_enhancing_services"}, {"score": 0.004368142221528535, "phrase": "relevant_advertisement"}, {"score": 0.0042914569949699015, "phrase": "event_notification"}, {"score": 0.004253618550301311, "phrase": "beckham"}, {"score": 0.0040334640350288, "phrase": "real-time_search"}, {"score": 0.0038246602895705643, "phrase": "next_event"}, {"score": 0.0037797419108291227, "phrase": "appropriate_information"}, {"score": 0.003479692058963528, "phrase": "potentially_needed_information"}, {"score": 0.0034388111429203222, "phrase": "user_location"}, {"score": 0.003348570667660301, "phrase": "relevant_information"}, {"score": 0.00330922510644499, "phrase": "actual_event"}, {"score": 0.0031751093457955686, "phrase": "real-time_information_delivery_system"}, {"score": 0.0031377955308198634, "phrase": "event's_context"}, {"score": 0.003091767402370757, "phrase": "key_features"}, {"score": 0.0029928611380840757, "phrase": "event-based_scenarios"}, {"score": 0.002914288956035066, "phrase": "novel_combination"}, {"score": 0.002897109710213723, "phrase": "history_information"}, {"score": 0.0025361866386341796, "phrase": "notified_events"}, {"score": 0.0025137856138000014, "phrase": "specific_case"}, {"score": 0.002426137929553724, "phrase": "experimental_setup"}, {"score": 0.0023415390666563177, "phrase": "context-unaware_approach"}, {"score": 0.0022665781920241245, "phrase": "superior_performance"}, {"score": 0.0021049977753042253, "phrase": "mobile_devices"}], "paper_keywords": ["mobility", " caching", " context-awareness", " performance"], "paper_abstract": "In mobile environments, transmitting information relevant to an event along with notification of the event has been proven to be an effective means of, providing revenue enhancing services. For example, a relevant advertisement can be displayed just before event notification; for instance, a product promotion by Beckham can be shown just before the notification of a goal scored by him. Challenges in achieving real-time search and delivery of information relevant to events as they occur include: (i) predicting the next event so that the appropriate information can be kept ready; (ii) finding information relevant to the context and content of the event; (iii) searching for and bringing the potentially needed information closer to the user location; and (iv) disseminating and displaying relevant information just before the actual event is notified to the user. In this paper, we propose a real-time information delivery system based on an event's context and content. The key features of our system are: (i) representing domains with event-based scenarios using state-charts; (ii) using a novel combination of history information and state transitions to predict events; and (iii) real-time delivery of information relevant to an event by prefetching and caching information based on the events predicted to occur in the near future. To illustrate our approach, we focus on the delivery of advertisements relevant to notified events as a specific case of delivery of information relevant to the events. Using an experimental setup, we measured the effectiveness of our approach as compared to a context-unaware approach to event prediction. Experiments demonstrate that our approach has a superior performance, resulting in: (i) better prediction accuracy; (ii) the delivery of the most relevant information most of the time; and (iii) an effective cache management in mobile devices.", "paper_title": "Context-aware timely information delivery in mobile environments", "paper_id": "WOS:000248374800009"}