{"auto_keywords": [{"score": 0.03838420087529657, "phrase": "uspto"}, {"score": 0.03278823709767237, "phrase": "north_america"}, {"score": 0.015719702651563923, "phrase": "scientific_publications"}, {"score": 0.0045877173513910055, "phrase": "shanghai_jiao_tong_university's"}, {"score": 0.004567596860086148, "phrase": "academic_ranking_of_world_universities"}, {"score": 0.0043519860930099795, "phrase": "world_university_ranking"}, {"score": 0.004201571673071299, "phrase": "possible_link"}, {"score": 0.003198554193075258, "phrase": "patenting_growth"}, {"score": 0.002941913249957503, "phrase": "patenting_output"}, {"score": 0.002705808393126695, "phrase": "significant_regional_variations"}, {"score": 0.002298902547676131, "phrase": "patenting_performance"}, {"score": 0.0022787359717772976, "phrase": "north_american_universities"}, {"score": 0.0021709339252206825, "phrase": "plausible_explanations"}, {"score": 0.002142426911242168, "phrase": "empirical_observations"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["University patenting", " Publication quantity & quality", " Technology commercialization"], "paper_abstract": "Integrating data from three independent data sources--USPTO patenting data, Shanghai Jiao Tong University's Academic Ranking of World Universities (ARWU) and the Times Higher Education Supplement's World University Ranking (WUR), we examine the possible link between patenting output and the quantity and quality of scientific publications among 281 leading universities world-wide. We found that patenting by these universities, as measured by patents granted by the USPTO, has grown consistently faster than overall US patenting over 1977-2000, although it has grown more slowly over the last 5 years (2000-2005). Moreover, since the mid-1990s, patenting growth has been faster among universities outside North America than among those within North America. We also found that the patenting output of the universities over 2003-2005 is significantly correlated with the quantity and quality of their scientific publications. However, significant regional variations are found: for universities in North America, both the quantity and quality of scientific publications matter, but for European and Australian/NZ universities, only the quantity of publications matter, while for other universities outside North America and Europe/Australia/NZ, only quality of publications matter. We found similar findings when using EPO patenting data instead of USPTO data. Additionally, for USPTO data only, the degree of internationalization of faculty members is found to reduce patenting performance among North American universities, but to increase that of universities outside North America. Plausible explanations for these empirical observations and implications for future research are discussed.", "paper_title": "University patenting activities and their link to the quantity and quality of scientific publications", "paper_id": "WOS:000275417400017"}