{"auto_keywords": [{"score": 0.04810827982024645, "phrase": "social_cues"}, {"score": 0.006590595354926167, "phrase": "social_role"}, {"score": 0.00481495049065317, "phrase": "computing_technology"}, {"score": 0.00445412965068967, "phrase": "personality_traits"}, {"score": 0.00379452936798156, "phrase": "user_personality"}, {"score": 0.0033919477901198716, "phrase": "responsibility_users"}, {"score": 0.002948066398723126, "phrase": "direct_effects"}, {"score": 0.0028068030356445894, "phrase": "moderating_role"}, {"score": 0.0025801648787263662, "phrase": "recent_findings"}, {"score": 0.0022739766507258105, "phrase": "theorized_relations"}, {"score": 0.0021801944769738618, "phrase": "controlled_laboratory_experiment"}], "paper_keywords": ["Attributions", " Computer as a Social Actor", " Computer Self-Efficacy", " Core Self-Evaluations", " Locus of Control"], "paper_abstract": "This study critiques and extends the work of Johnson, Marakas and Palmer (2006), who investigated the relations between social cues in an interface, user personality, user beliefs about the social role and capabilities of computers, and the attributions of responsibility users made for their interactions and outcomes with a computer. In this study, rather than examining the simple, direct effects investigated previously, we examine the moderating role of social cues in the interface. In addition, building upon recent findings from psychology, the authors assess personality traits individually, rather than aggregating them. To evaluate the theorized relations, 152 individuals participated in a controlled laboratory experiment, where social cues in two computer interfaces were manipulated. Results indicate that social cues moderate the relations between personality, beliefs about the social role of computing, and the attributions made. In addition, the results suggest that disaggregating personality traits is theoretically and practically richer than aggregating them.", "paper_title": "Beliefs and Attributions toward Computing Technology: The Moderating Role of Social Cues in Interfaces", "paper_id": "WOS:000353300300002"}