{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "deduction_graphs"}, {"score": 0.04962396550254858, "phrase": "proof_nets"}, {"score": 0.007885082568563436, "phrase": "natural_deduction"}, {"score": 0.004612376827433774, "phrase": "graphical_presentation"}, {"score": 0.004172094622123562, "phrase": "acyclic_directed_graphs"}, {"score": 0.003920780681351006, "phrase": "local_assumptions"}, {"score": 0.0038465304237380125, "phrase": "multiplicative_exponential_linear_logic"}, {"score": 0.003632080676606117, "phrase": "mell"}, {"score": 0.0034790978593553794, "phrase": "modal_operator"}, {"score": 0.003348513474852869, "phrase": "apparent_correspondences"}, {"score": 0.002873247913129334, "phrase": "minimal_proposition_logic"}, {"score": 0.0028053237950173508, "phrase": "direct_one"}, {"score": 0.0027259252868643926, "phrase": "so-called_context_nets"}, {"score": 0.0022294857939412073, "phrase": "context_nets"}], "paper_keywords": [""], "paper_abstract": "Deduction graphs [3] provide a formalism for natural deduction, where the deductions have the structure of acyclic directed graphs with boxes. The boxes are used to restrict the scope of local assumptions. Proof nets for multiplicative exponential linear logic (MELL) are also graphs with boxes, but in MELL the boxes have the purpose of controlling the modal operator !. In this paper we study the apparent correspondences between deduction graphs and proof nets, both by looking at the structure of the proofs themselves and at the process of cute-limination defined on them. We give two translations from deduction graphs for minimal proposition logic to proof nets: a direct one, and a mapping via so-called context nets. Context nets are closer to natural deduction than proof nets, as they have both premises (on top of the net) and conclusions (at the bottom). Although the two translations give basically the same results, the translation via context nets provides a more abstract view and has the advantage that it follows the same inductive construction as the deduction graphs. The translations behave nicely with respect to cut-elimination.", "paper_title": "From deduction graphs to proof nets: Boxes and sharing in the graphical presentation of deductions", "paper_id": "WOS:000240271700004"}