{"auto_keywords": [{"score": 0.03149278777849825, "phrase": "different_solutions"}, {"score": 0.00481495049065317, "phrase": "ogc_web_services"}, {"score": 0.004697655699119423, "phrase": "pragmatic_use"}, {"score": 0.004416713079266374, "phrase": "geospatial_domain"}, {"score": 0.003952513974962462, "phrase": "great_deal"}, {"score": 0.003693103542455806, "phrase": "reliable_way"}, {"score": 0.0032641439000713306, "phrase": "appropriate_software_metrics"}, {"score": 0.0031260524791486347, "phrase": "different_properties"}, {"score": 0.002471973283582411, "phrase": "ogc_implementation_specifications"}, {"score": 0.0023967582707115354, "phrase": "comprehensive_set"}, {"score": 0.00230950802983053, "phrase": "multidimensional_view"}, {"score": 0.0021049977753042253, "phrase": "design_decisions"}], "paper_keywords": ["XML schema", " OGC web services", " complexity analysis", " software metrics", " standards"], "paper_abstract": "The use of standards in the geospatial domain, such as those defined by the Open Geospatial Consortium (OGC), for exchanging data has brought a great deal of interoperability upon which systems can be built in a reliable way. Unfortunately, these standards are becoming increasingly complex, making their implementation an arduous task. The use of appropriate software metrics can be very useful to quantify different properties of the standards that ultimately may suggest different solutions to deal with problems related to their complexity. In this regard, we present in this article an attempt to measure the complexity of the schemas associated with the OGC implementation specifications. We use a comprehensive set of metrics to provide a multidimensional view of this complexity. These metrics can be used to evaluate the impact of design decisions, study the evolution of schemas, and so on. We also present and evaluate different solutions that could be applied to overcome some of the problems associated with the complexity of the schemas.", "paper_title": "Measuring complexity in OGC web services XML schemas: pragmatic use and solutions", "paper_id": "WOS:000304674700008"}