{"auto_keywords": [{"score": 0.04007839710766617, "phrase": "separating_curve"}, {"score": 0.014317284122442283, "phrase": "surface_model"}, {"score": 0.014150886571173178, "phrase": "extraction_algorithm"}, {"score": 0.00481495049065317, "phrase": "automatic_extraction"}, {"score": 0.004539005582217305, "phrase": "new_algorithm"}, {"score": 0.004485735417293941, "phrase": "free-form_surface_features"}, {"score": 0.0042452552248398445, "phrase": "modified_taxonomy"}, {"score": 0.004065348865695599, "phrase": "new_classification_scheme"}, {"score": 0.0030614565460256897, "phrase": "free-form_surface"}, {"score": 0.0030254743224136273, "phrase": "different_types"}, {"score": 0.0030017207229983385, "phrase": "free-form_surfaces"}, {"score": 0.0027741761880779535, "phrase": "underlying_surface"}, {"score": 0.0025137856138000014, "phrase": "pre-defined_templates"}, {"score": 0.0023694065215394593, "phrase": "proposed_classification"}, {"score": 0.002259883463607508, "phrase": "semantic_equivalences"}, {"score": 0.002155412043665635, "phrase": "plm_applications"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Free-form surface feature (FFSF)", " FFSF taxonomy", " Influence region", " Separating curve", " Semantic interoperability", " Surface model"], "paper_abstract": "This paper presents a new algorithm for extracting Free-Form Surface Features (FFSFs) from a surface model. The extraction algorithm is based on a modified taxonomy of FFSFs from that proposed in the literature. A new classification scheme has been proposed for FFSFs to enable their representation and extraction. The paper proposes a separating curve as a signature of FFSFs in a surface model. FFSFs are classified based on the characteristics of the separating curve (number and type) and the influence region (the region enclosed by the separating curve). A method to extract these entities is presented. The algorithm has been implemented and tested for various free-form surface features on different types of free-form surfaces (base surfaces) and is found to correctly identify and represent the features irrespective of the type of underlying surface. The representation and extraction algorithm are both based on topology and geometry. The algorithm is data-driven and does not use any pre-defined templates. The definition presented for a feature is unambiguous and application independent. The proposed classification of FFSFs can be used to develop an ontology to determine semantic equivalences for the feature to be exchanged, mapped and used across PLM applications. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Automatic extraction of free-form surface features (FFSFs)", "paper_id": "WOS:000298723300002"}