{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "efficient_radio_frequency_identification_authentication_protocol"}, {"score": 0.0045370785151713396, "phrase": "yanfei_liu"}, {"score": 0.004352123742308589, "phrase": "rfid_tags"}, {"score": 0.004149922666541166, "phrase": "time_complexity"}, {"score": 0.003957078581524691, "phrase": "rfid_tag"}, {"score": 0.0038640303886081444, "phrase": "total_number"}, {"score": 0.0032130703855586685, "phrase": "desynchronization_attack"}, {"score": 0.0029561107046138136, "phrase": "low-cost_devices"}, {"score": 0.0026714812866037584, "phrase": "resulting_attacks"}, {"score": 0.002329412930430366, "phrase": "stateful_variant"}, {"score": 0.0022476051902301187, "phrase": "proposed_model"}, {"score": 0.0021946656099592608, "phrase": "server-side_computation"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["authentication protocol", " privacy", " RFID security"], "paper_abstract": "In 2008, a scalable radio frequency identification (RFID) authentication protocol was proposed by Yanfei Liu to provide security and privacy for RFID tags. This protocol only needs O(1) time complexity to find out the identifier of the RFID tag irrespective of the total number of the tags in the system. Based on our analysis, however, a security flaw, which has gone unnoticed in the design of the protocol, makes the scheme vulnerable to tracking attack, tag impersonation attack, and desynchronization attack, if the attacker has the possibility to tamper with only one RFID tag. Because low-cost devices are not tamper-resistant, such an attack could be feasible, and we can apply the resulting attacks on authentication, untraceability, and desynchronization resistance of the protocol. To counteract such flaws, we revise the scheme with a stateful variant and also show that the proposed model requires less tag and server-side computation. Copyright (c) 2011 John Wiley & Sons, Ltd.", "paper_title": "Practical attacks and improvements to an efficient radio frequency identification authentication protocol", "paper_id": "WOS:000309602600008"}