{"auto_keywords": [{"score": 0.04068367224498145, "phrase": "muscle_activity"}, {"score": 0.008272711510481687, "phrase": "electronic_games"}, {"score": 0.007791249751209459, "phrase": "traditional_electronic_games"}, {"score": 0.00481495049065317, "phrase": "electronic_game"}, {"score": 0.0046256566852302256, "phrase": "affluent_countries"}, {"score": 0.004390607370861926, "phrase": "health_impact"}, {"score": 0.0034508665218929745, "phrase": "handheld_computer"}, {"score": 0.002857143106182505, "phrase": "cervical_erector_spinae"}, {"score": 0.00254282157860369, "phrase": "upper_limb_movement"}, {"score": 0.0023369711258107244, "phrase": "active-input_device"}, {"score": 0.0022812715029149216, "phrase": "substantial_movement"}, {"score": 0.002130545585846588, "phrase": "sedentary_activity"}, {"score": 0.0021049977753042253, "phrase": "new_active-input_technologies"}], "paper_keywords": [""], "paper_abstract": "The majority of children in affluent countries now play electronic games, and this has lead to concerns about the health impact of this activity. Traditional electronic games have used gamepad, keyboard, and mouse input, but newer game interfaces that require more movement are now available. However the movement and muscle activity demands of electronic games have not been described. This study compared the amount of movement and muscle activity while 20 children aged 9 to 12 years watched a DVD and played games using handheld computer, gamepad, keyboard, steering wheel and, active-input (Webcam motion analysis-Sony EyeToy (R)) devices. Movement of the head, sacrum, foot, shoulder, wrist, and thumb was measured along with activity in cervical erector spinae, lumbar erector spinae, rectus femoris, upper trapezius, anterior deltoid, and wrist extensor muscles. Use of the wheel resulted in some increase in upper limb movement and muscle activity, but the other traditional input devices were usually as sedentary as watching a DVD. In contrast, use of the active-input device (EyeToy) resulted in substantial movement and muscle activity in limbs and torso. These results suggest that playing traditional electronic games is indeed a sedentary activity but that new active-input technologies may be useful in encouraging more movement and muscle activity in children.", "paper_title": "Active-Input Provides More Movement and Muscle Activity During Electronic Game Playing by Children", "paper_id": "WOS:000272798500001"}