{"auto_keywords": [{"score": 0.04841586458101805, "phrase": "markov_logic_network"}, {"score": 0.03949131510361901, "phrase": "system_performance"}, {"score": 0.03313753860192929, "phrase": "gn_task"}, {"score": 0.00481495049065317, "phrase": "gene_normalization_stages"}, {"score": 0.0043496334756644535, "phrase": "textual_gene_mention"}, {"score": 0.004292337783332826, "phrase": "unique_gene_database"}, {"score": 0.004198510172614725, "phrase": "gn_systems"}, {"score": 0.003999217176949845, "phrase": "normalization_process"}, {"score": 0.003911771812701971, "phrase": "false_positives"}, {"score": 0.003826231150275071, "phrase": "ambiguous_gene_mention"}, {"score": 0.003350740737336966, "phrase": "novel_approach"}, {"score": 0.003262961901561799, "phrase": "mln"}, {"score": 0.00278237555651743, "phrase": "co-reference_resolution-discourse_salience"}, {"score": 0.002685558057339722, "phrase": "gn_models"}, {"score": 0.0025465957200502404, "phrase": "information_extraction_applications"}, {"score": 0.002404136142279618, "phrase": "article-wide_prf"}, {"score": 0.0023307492812556204, "phrase": "experimental_results"}], "paper_keywords": [""], "paper_abstract": "Motivation: Gene normalization (GN) is the task of normalizing a textual gene mention to a unique gene database ID. Traditional top performing GN systems usually need to consider several constraints to make decisions in the normalization process, including filtering out false positives, or disambiguating an ambiguous gene mention, to improve system performance. However, these constraints are usually executed in several separate stages and cannot use each other's input/output interactively. In this article, we propose a novel approach that employs a Markov logic network (MLN) to model the constraints used in the GN task. Firstly, we show how various constraints can be formulated and combined in an MLN. Secondly, we are the first to apply the two main concepts of co-reference resolution-discourse salience in centering theory and transitivity-to GN models. Furthermore, to make our results more relevant to developers of information extraction applications, we adopt the instance-based precision/recall/F-measure (PRF) in addition to the article-wide PRF to assess system performance. Results: Experimental results show that our system outperforms baseline and state-of-the-art systems under two evaluation schemes. Through further analysis, we have found several unexplored challenges in the GN task.", "paper_title": "Integration of gene normalization stages and co-reference resolution using a Markov logic network", "paper_id": "WOS:000294755400015"}