{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "large_web_datasets"}, {"score": 0.0043208252177835815, "phrase": "general_web"}, {"score": 0.003877211065759289, "phrase": "search_engines"}, {"score": 0.003746779951069909, "phrase": "unwanted_payload"}, {"score": 0.003193606324727067, "phrase": "simple_content-based_classifier"}, {"score": 0.0028490783932465288, "phrase": "standard_personal_computer"}, {"score": 0.002706383680762465, "phrase": "significant_and_substantive_improvements"}, {"score": 0.0026604207233593973, "phrase": "fixed-cutoff_precision"}, {"score": 0.0025561788724870974, "phrase": "rank_measures"}, {"score": 0.0024005409468262203, "phrase": "nearly_all_submitted_runs"}, {"score": 0.0022933216359142736, "phrase": "\"honeypot\"_queries"}, {"score": 0.00224151735457093, "phrase": "training_data"}, {"score": 0.0021659920594094407, "phrase": "entirely_automatic_process"}, {"score": 0.0021049977753042253, "phrase": "classical_information_retrieval_methods"}], "paper_keywords": ["Web search", " Spam", " Web spam", " Evaluation", " TREC"], "paper_abstract": "The TREC 2009 web ad hoc and relevance feedback tasks used a new document collection, the ClueWeb09 dataset, which was crawled from the general web in early 2009. This dataset contains 1 billion web pages, a substantial fraction of which are spam-pages designed to deceive search engines so as to deliver an unwanted payload. We examine the effect of spam on the results of the TREC 2009 web ad hoc and relevance feedback tasks, which used the ClueWeb09 dataset. We show that a simple content-based classifier with minimal training is efficient enough to rank the \"spamminess\" of every page in the dataset using a standard personal computer in 48 hours, and effective enough to yield significant and substantive improvements in the fixed-cutoff precision (estP10) as well as rank measures (estR-Precision, StatMAP, MAP) of nearly all submitted runs. Moreover, using a set of \"honeypot\" queries the labeling of training data may be reduced to an entirely automatic process. The results of classical information retrieval methods are particularly enhanced by filtering-from among the worst to among the best.", "paper_title": "Efficient and effective spam filtering and re-ranking for large web datasets", "paper_id": "WOS:000294960300001"}