{"auto_keywords": [{"score": 0.04896848785083955, "phrase": "security_domain"}, {"score": 0.015574423535694304, "phrase": "situational_awareness"}, {"score": 0.005935419967632704, "phrase": "ar_system"}, {"score": 0.005108147404333398, "phrase": "second_evaluation"}, {"score": 0.00481495049065317, "phrase": "augmented_reality"}, {"score": 0.004637478829869904, "phrase": "operational_units"}, {"score": 0.004261617028111862, "phrase": "context-related_information"}, {"score": 0.004201991568145053, "phrase": "well-working_collaboration"}, {"score": 0.004047020753789236, "phrase": "oral_communication"}, {"score": 0.003934540154108188, "phrase": "different_scenarios"}, {"score": 0.003581620064675766, "phrase": "user_centred_design_approach"}, {"score": 0.003110515172439764, "phrase": "first_round"}, {"score": 0.002995677265350124, "phrase": "ar_support"}, {"score": 0.0028986672783671147, "phrase": "different_operational_units"}, {"score": 0.002626034130205569, "phrase": "expert_teams"}, {"score": 0.0023127544795063263, "phrase": "information_exchange"}, {"score": 0.0021049977753042253, "phrase": "remote_colleagues"}], "paper_keywords": ["Augmented reality", " Information exchange", " Situational awareness", " Collaboration quality", " Usability"], "paper_abstract": "For operational units in the security domain that work together in teams, it is important to quickly and adequately exchange context-related information to ensure well-working collaboration. Currently, most information exchange is based on oral communication. This paper reports on different scenarios from the security domain in which augmented reality (AR) techniques are used to support such information exchange. The scenarios have been designed with a User Centred Design approach, in order to make the scenarios as realistic as possible. To support these scenarios, an AR system has been developed and evaluated in two rounds. In the first round, the usability and feasibility of the AR support has been evaluated with experts from different operational units in the security domain. The second evaluation round then focussed on the effect of AR on collaboration and situational awareness within the expert teams. With regard to the usability and feasibility of AR, the evaluation shows that the scenarios are well defined and the AR system can successfully support information exchange in teams operating in the security domain. The second evaluation round showed that AR can especially improve the situational awareness of remote colleagues not physically present at a scene.", "paper_title": "Providing Information on the Spot: Using Augmented Reality for Situational Awareness in the Security Domain", "paper_id": "WOS:000367331400005"}