{"auto_keywords": [{"score": 0.049298477109555164, "phrase": "financial_instruments"}, {"score": 0.014432642102065525, "phrase": "financial_instrument_markets"}, {"score": 0.00481495049065317, "phrase": "causal_relationships"}, {"score": 0.0041696157492057, "phrase": "financial_domain"}, {"score": 0.004034649282040889, "phrase": "different_types"}, {"score": 0.004001593118269276, "phrase": "news_oil_trade_activities"}, {"score": 0.00388800655625083, "phrase": "trade_price"}, {"score": 0.003394314924677555, "phrase": "first_part"}, {"score": 0.003352658916650986, "phrase": "hierarchy_framework"}, {"score": 0.0033115124244647736, "phrase": "domain_knowledge"}, {"score": 0.003177958355586418, "phrase": "financial_instrument_markets_participants"}, {"score": 0.0030876784650745973, "phrase": "primary_relations"}, {"score": 0.002999955539996569, "phrase": "second_part"}, {"score": 0.0029631248341951064, "phrase": "causal_map"}, {"score": 0.0023819914954155905, "phrase": "trading_models"}, {"score": 0.002202617924488607, "phrase": "stock_price"}, {"score": 0.0021311850321045767, "phrase": "financial_market_participants"}, {"score": 0.0021049977753042253, "phrase": "relevant_news"}], "paper_keywords": ["ontology", " causal map", " causal relationships", " news", " financial instrument"], "paper_abstract": "In recent years, people have begun to pay more and more attention to the effect of news on financial instrument markets (i.e., the markets for trading financial instruments). Researchers in the financial domain have conducted many studies demonstrating the effect of different types of news oil trade activities in financial instrument markets such as volatility in trade price, trade volume, trading frequency, and so on. In this paper, an ontology for knowledge about news regarding financial instruments is provided. The ontology contains two parts: the first part presents a hierarchy framework for the domain knowledge that primarily includes classes of news, classes of financial instrument markets participants, classes of financial instruments, and primary relations between these classes. In the second part, a causal map is used to demonstrate how classes of news are causally related with classes of financial instruments. Finally, a case concerning the ''9/11 American terror attack\" is analyzed. On the basis of the ontology, it is first comprehensive to understand the knowledge about news in financial instrument markets; second, it helps building trading models based on news in the financial instrument markets third, systems (e.g., systems for prediction of stock price based on news, systems for supporting financial market participants to search relevant news) design and development in this domain are facilitated and supported by this ontology. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "An ontology for causal relationships between news and financial instruments", "paper_id": "WOS:000257993700002"}