{"auto_keywords": [{"score": 0.015490979380884982, "phrase": "conic_sections"}, {"score": 0.00481495049065317, "phrase": "arbitrary_view_planes"}, {"score": 0.004674333455266527, "phrase": "view_planes"}, {"score": 0.004622662375029505, "phrase": "new_and_efficient_approach"}, {"score": 0.0043889488321824785, "phrase": "input_projections"}, {"score": 0.004244955499652296, "phrase": "regular_and_complete_auxiliary_views"}, {"score": 0.003912469968653304, "phrase": "input_views"}, {"score": 0.0038263829059336564, "phrase": "auxiliary_views"}, {"score": 0.0037981086150309885, "phrase": "curved_edges"}, {"score": 0.00370077772049505, "phrase": "new_technique"}, {"score": 0.003474624627033273, "phrase": "current_art"}, {"score": 0.0032622464094096463, "phrase": "common_line"}, {"score": 0.0030514638431036714, "phrase": "tangential_vertices"}, {"score": 0.0029185415814209055, "phrase": "complete_edges"}, {"score": 0.0024240794798626674, "phrase": "viewing_directions"}, {"score": 0.002284234786840546, "phrase": "construction_algorithm"}, {"score": 0.0021684903968454267, "phrase": "typical_drawings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Wire-frame", " Reconstruction", " Orthographic views", " Conic sections", " Auxiliary views"], "paper_abstract": "A new and efficient approach to construct a 3D wire-frame of an object from its orthographic projections is described. The input projections can be two or more and can include regular and complete auxiliary views. Each view may contain linear, circular and other conic sections. The output is a 3D wire-frame that is consistent with the input views. The approach can handle auxiliary views containing curved edges. This generality derives from a new technique to construct 3D vertices from the input 2D vertices (as opposed to matching coordinates that is prevalent in current art). 3D vertices are constructed by projecting the 2D vertices in a pair of views on the common line of the two views. The construction of 3D edges also does not require the addition of silhouette and tangential vertices and subsequently splitting edges in the views. The concepts of complete edges and n-tuples are introduced to obviate this need. Entities corresponding to the 3D edge in each view are first identified and the 3D edges are then constructed from the information available with the matching 2D edges. This allows the algorithm to handle conic sections that are not parallel to any of the viewing directions. The localization of effort in constructing 3D edges is the source of efficiency of the construction algorithm as it does not process all potential 3D edges. Working of the algorithm on typical drawings is illustrated. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Constructing a wire-frame from views on arbitrary view planes for objects with conic sections inclined to all view planes", "paper_id": "WOS:000299134900010"}