{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "nurses'_knowledge"}, {"score": 0.015179574740567045, "phrase": "clinical_management_system"}, {"score": 0.004254558771304349, "phrase": "hong_kong"}, {"score": 0.004070573090297285, "phrase": "self-reported_questionnaire"}, {"score": 0.003911771812701971, "phrase": "two-step_cluster_analysis"}, {"score": 0.0032485526269852606, "phrase": "\"positive_attitudes"}, {"score": 0.003066945490483524, "phrase": "positive_correlation"}, {"score": 0.0028195727965553367, "phrase": "nurses'_skills"}, {"score": 0.0026267609106294817, "phrase": "senior_and_more_highly_educated_nurses"}, {"score": 0.002447101794397243, "phrase": "well_educated_nurses"}, {"score": 0.0022595974985992664, "phrase": "actual_problems"}, {"score": 0.0022396694076443446, "phrase": "computer_training"}, {"score": 0.0021521410307795657, "phrase": "nurses'_computer_knowledge"}], "paper_keywords": [""], "paper_abstract": "Nurses' knowledge, attitudes, and skills regarding the Clinical Management System are explored by identifying profiles of nurses working in Hong Kong. A total of 282 nurses from four hospitals completed a self-reported questionnaire during the period from December 2004 to May 2005. Two-step cluster analysis yielded two clusters. The first cluster (n = 159, 56.4%) was labeled \"negative attitudes, less skillful, and average knowledge\" group. The second cluster (n = 123, 43.6%) was labeled \"positive attitudes, good knowledge, but less skillful.\" There was a positive correlation in cluster 1 for nurses' knowledge and attitudes (r(s) = 0.28) and in cluster 2 for nurses' skills and attitudes (r(s) = 0.25) toward computerization. The study showed that senior and more highly educated nurses generally held more positive attitudes to computerization, whereas the attitudes among younger and less well educated nurses generally were more negative. Such findings should be used to formulate strategies to encourage nurses to resolve actual problems following computer training and to increase the depth and breadth of nurses' computer knowledge and skills and improve their attitudes toward computerization.", "paper_title": "A cluster analysis to investigating nurses' knowledge, attitudes, and skills regarding the clinical management system", "paper_id": "WOS:000245667000009"}