{"auto_keywords": [{"score": 0.04288651689101515, "phrase": "manets"}, {"score": 0.022949070877251843, "phrase": "wireless_networks"}, {"score": 0.010612286023456223, "phrase": "traditional_wired_networks"}, {"score": 0.0044844784352041835, "phrase": "mobile_ad-hoc_network"}, {"score": 0.00442985720252504, "phrase": "manet"}, {"score": 0.004375839387349825, "phrase": "infrastructureless_network"}, {"score": 0.004322506523364162, "phrase": "self-configuring_mobile_nodes"}, {"score": 0.004166360284269931, "phrase": "fixed_network_infrastructure"}, {"score": 0.0038612347035351696, "phrase": "communication_range"}, {"score": 0.0037034667501733383, "phrase": "communication_ranges"}, {"score": 0.003658298673260806, "phrase": "proposed_manet_protocols"}, {"score": 0.00352606130954801, "phrase": "security_issues"}, {"score": 0.0034830493337930195, "phrase": "open_environment"}, {"score": 0.003457493527619119, "phrase": "rapidly_changing_topology"}, {"score": 0.0033243188834747575, "phrase": "passive_and_active_attacks"}, {"score": 0.003267674489136425, "phrase": "encryption_and_authentication_mechanisms"}, {"score": 0.003211992170696907, "phrase": "first_line"}, {"score": 0.0031034490909341243, "phrase": "intrusion_detection_systems"}, {"score": 0.0030281644993051023, "phrase": "second_line"}, {"score": 0.00294745285636098, "phrase": "traditional_wired_idss"}, {"score": 0.0029114783016701484, "phrase": "wired_networks"}, {"score": 0.0028338679316173374, "phrase": "different_features"}, {"score": 0.0026520048812910054, "phrase": "watchdog_mechanism"}, {"score": 0.002562336846691632, "phrase": "adaptive_three_acknowledgements"}, {"score": 0.0024696172716958897, "phrase": "watchdog_technique"}, {"score": 0.0021049977753042253, "phrase": "existing_idss_techniques"}], "paper_keywords": ["Mobile Ad-hoc Network (MANETs)", " Intrusion Detection System (IDS)", " Adaptive", " Acknowledgement (AACK)", " DSR"], "paper_abstract": "In the past, traditional wired networks have been migrated to wireless networks. In addition, the mobility and scalability in wireless networks made them suitable for many applications. One of the most important applications of wireless networks is Mobile Ad-hoc Network (MANET). MANET is defined as an infrastructureless network, which is a self-configuring mobile nodes connected by wireless links. That means nodes in MANETs don't need a fixed network infrastructure. Therefore, every node in MANETs works as transceiver and can communicate with other nodes directly or indirectly. They communicate with each other only if both are within the communication range. However, they rely on each other and forward packets when they are out of communication ranges. Most of the proposed MANET protocols assume that all nodes in the network are cooperative, and do not address security issues in MANETs. In open environment, the rapidly changing topology and the decentralization of nodes in MANETs, make it vulnerable for all types of passive and active attacks. On the other hand, the encryption and authentication mechanisms, which are considered as the first line of defense, are no longer sufficient to protect MANETs. Thus, Intrusion Detection Systems (IDSs) are needed to act as a second line of defense to protect the network from such security threats. The traditional wired IDSs that are designed for wired networks cannot be used in MANETs, because MANETs have different features and architecture as compared to traditional wired networks. As a result, there are many IDSs designed especially for MANETs and most of them based on the Watchdog mechanism. In this research, we propose and implement a novel IDS named Adaptive Three Acknowledgements (A3ACKs) designed specifically for MANETs. We study the behavior of the Watchdog technique, and propose a solution for its three significant problems, namely: receiver collision, limited transmission power and collaborative attacks (collusion attack), especially when there are two consecutive collaborative malicious nodes in a path. To demonstrate the feasibility of our proposed system, it is implemented and tested under various scenarios using NS2 simulator. To validate the results achieved, we compared our results with the results of some existing IDSs techniques.", "paper_title": "A3ACKs: adaptive three acknowledgments intrusion detection system for MANETs", "paper_id": "WOS:000351240600012"}