{"auto_keywords": [{"score": 0.04759132288543124, "phrase": "communication_requests"}, {"score": 0.04545357036670984, "phrase": "physical_network"}, {"score": 0.0376869002076119, "phrase": "request_edges"}, {"score": 0.004818463433338927, "phrase": "vertex"}, {"score": 0.004739291466405629, "phrase": "tori"}, {"score": 0.004626255242038005, "phrase": "survivable_wdm_network"}, {"score": 0.004136171721829075, "phrase": "communication_scheme"}, {"score": 0.004048860957751714, "phrase": "total_exchange"}, {"score": 0.003869373085652601, "phrase": "logical_graph"}, {"score": 0.0038385317554884713, "phrase": "complete_graph"}, {"score": 0.003629392214109574, "phrase": "cycle_partition"}, {"score": 0.0033412376456096915, "phrase": "vertex_disjoint_paths"}, {"score": 0.0032706520949775065, "phrase": "request_cycle"}, {"score": 0.003244567402785763, "phrase": "elementary_cycle"}, {"score": 0.0031255543155487234, "phrase": "wdm_network"}, {"score": 0.002947266048104005, "phrase": "total_load"}, {"score": 0.0026275488733903426, "phrase": "request_edge"}, {"score": 0.002592693161475495, "phrase": "shortest_path"}, {"score": 0.002299033231026043, "phrase": "associated_optimal_or_quasi_optimal_routing"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["WDM networks", " fault tolerance", " protection by cycles", " torus", " cycle covering"], "paper_abstract": "We study the problem of designing a survivable WDM network based on covering the communication requests with subnetworks that are protected independently from each other. We consider here the case when the physical network is T(n), a torus of size n by n, the subnetworks are cycles and the communication scheme is all-to-all or total exchange (where all pairs of vertices communicate). We will represent the communication requests by a logical graph: a complete graph for the scheme of all-to-all. This problem can be modeled as follows: find a cycle partition or covering of the request edges of K-n2, such that for each cycle in the partition, its request edges can be routed in the physical network T(n) by a set of vertex disjoint paths (equivalently, the routings with the request cycle form an elementary cycle in T(n)). Let the load of an edge of the WDM network be the number of paths associated with the requests using the edge. The cost of the network depends on the total load (the cost of transmission) and the maximum load (the cost of equipment). To minimize these costs, we will search for an optimal (or quasi optimal) routing satisfying the following two conditions: (a) each request edge is routed by a shortest path over T(n), and (b) the load of each physical edge resulting from the routing of all cycles of S is uniform or quasi uniform. In this article, we find a covering or partition of the request edges of K-n2 into cycles with an associated optimal or quasi optimal routing such that either (1) the number of cycles of the covering is minimum, or (2) the cycles have size 3 or 4. (c) 2007 Wiley Periodicals, Inc.", "paper_title": "Vertex disjoint routings of cycles over Tori", "paper_id": "WOS:000245635200005"}