{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_rule-based_classification_systems"}, {"score": 0.004470823343432748, "phrase": "low_quality_data"}, {"score": 0.004400329132129292, "phrase": "good_results"}, {"score": 0.004151188559520802, "phrase": "missing_data"}, {"score": 0.004042635935882651, "phrase": "real-life_data"}, {"score": 0.0038953958723049287, "phrase": "data_mining"}, {"score": 0.0034118234596993836, "phrase": "data_mining_tasks"}, {"score": 0.0029253546782349875, "phrase": "missing_attribute_values_treatment"}, {"score": 0.00267301171407926, "phrase": "mamdani_and_tsk_models"}, {"score": 0.0026168641536413978, "phrase": "obtained_results"}, {"score": 0.0025348408238837655, "phrase": "imputation_methods"}, {"score": 0.002481588370380518, "phrase": "missing_values"}, {"score": 0.002279508335630797, "phrase": "determined_missing_values_imputation_methods"}, {"score": 0.0021049977753042253, "phrase": "particular_imputation_methods"}], "paper_keywords": ["Classification", " Missing values", " Fuzzy rule-based classification systems", " Imputation"], "paper_abstract": "Fuzzy rule-based classification systems (FRBCSs) are known due to their ability to treat with low quality data and obtain good results in these scenarios. However, their application in problems with missing data are uncommon while in real-life data, information is frequently incomplete in data mining, caused by the presence of missing values in attributes. Several schemes have been studied to overcome the drawbacks produced by missing values in data mining tasks; one of the most well known is based on preprocessing, formerly known as imputation. In this work, we focus on FRBCSs considering 14 different approaches to missing attribute values treatment that are presented and analyzed. The analysis involves three different methods, in which we distinguish between Mamdani and TSK models. From the obtained results, the convenience of using imputation methods for FRBCSs with missing values is stated. The analysis suggests that each type behaves differently while the use of determined missing values imputation methods could improve the accuracy obtained for these methods. Thus, the use of particular imputation methods conditioned to the type of FRBCSs is required.", "paper_title": "Missing data imputation for fuzzy rule-based classification systems", "paper_id": "WOS:000302414800011"}