{"auto_keywords": [{"score": 0.04769371124478992, "phrase": "xprob"}, {"score": 0.006674548978902914, "phrase": "aprob_channel"}, {"score": 0.00481495049065317, "phrase": "high-performance_computing"}, {"score": 0.004617949594931096, "phrase": "revised_model"}, {"score": 0.0044495843279816075, "phrase": "pool-based_anonymous_communication_systems"}, {"score": 0.00428733103049275, "phrase": "high_performance_computing_environments"}, {"score": 0.004054931951058077, "phrase": "global_delaying_adversary"}, {"score": 0.003852939975815287, "phrase": "pool_mix"}, {"score": 0.003712362078915926, "phrase": "global_active_adversary"}, {"score": 0.0031113369425402287, "phrase": "experimental_evaluations"}, {"score": 0.002997735656669146, "phrase": "greater_anonymity"}, {"score": 0.00290173234777844, "phrase": "user_behaviors"}, {"score": 0.002656327554326748, "phrase": "high_probability"}, {"score": 0.0021049977753042253, "phrase": "high-performance_computing_environments"}], "paper_keywords": ["Anonymity system", " XPROB", " Pool-based anonymous communication framework", " Probabilistic real-time", " Global active adversary"], "paper_abstract": "We propose and analyze in details the revised model of XPROB, an infinite family of pool-based anonymous communication systems that can be used in various applications including high performance computing environments. XPROB overcomes the limitations of APROB Channel that only resists a global delaying adversary (GDA). Each instance of XPROB uses a pool mix as its core component to provide resistance against a global active adversary (GAA), a stronger yet more practical opponent than a GDA. For XPROB, a GAA can drop messages from users but cannot break the anonymity of the senders of messages. Analysis and experimental evaluations show that each instance of XPROB provides greater anonymity than APROB Channel for the same traffic load and user behaviors (rate and number of messages sent). In XPROB, any message can be delivered with high probability within a few rounds after its arrival into the system; thus, an opponent cannot be certain when a message will be delivered. Furthermore, users can choose their own preference balance between anonymity and delay. Through the evaluation, we prove that XPROB can provide anonymity for users in high-performance computing environments.", "paper_title": "Pool-based anonymous communication framework for high-performance computing", "paper_id": "WOS:000286682500008"}