{"auto_keywords": [{"score": 0.046903356830179446, "phrase": "twitter"}, {"score": 0.00481495049065317, "phrase": "social_capital"}, {"score": 0.004718965446479166, "phrase": "news"}, {"score": 0.004681012408089219, "phrase": "online_social_networks"}, {"score": 0.004424160689087029, "phrase": "major_force"}, {"score": 0.004388631450145507, "phrase": "modern_societies"}, {"score": 0.004016072233242585, "phrase": "small_scale"}, {"score": 0.0034452744110282114, "phrase": "netherlands"}, {"score": 0.003390092184270794, "phrase": "social_network_data"}, {"score": 0.003229815147800001, "phrase": "social_network"}, {"score": 0.002759279370360986, "phrase": "gatekeeping_positions"}, {"score": 0.002639385610609024, "phrase": "specific_relations"}, {"score": 0.0025658094607383646, "phrase": "eight_tightly_knit_network_communities"}, {"score": 0.002385872451981323, "phrase": "networking_service"}, {"score": 0.002272964710550345, "phrase": "possible_consequences"}, {"score": 0.00224558083320154, "phrase": "tightly_knit_communities"}, {"score": 0.0021479597698614373, "phrase": "pack_journalism"}, {"score": 0.0021306709646058295, "phrase": "echo_chambers"}, {"score": 0.0021049977753042253, "phrase": "information_cascades"}], "paper_keywords": ["journalism", " social network analysis", " social media", " online communities", " gatekeeping"], "paper_abstract": "In a very short time span, Twitter has become a major force in modern societies and also in the production of news by journalists. How journalists use Twitter is studied extensively, particularly on a small scale (i.e., qualitative research, specific events, mostly descriptive). However, studies on how Twitter has impacted journalism as a whole are relatively scarce. This study focuses on the adoption of Twitter and its emerging community network structure in the Netherlands. Using the social network data of 2,152 journalists as retrieved from Twitter, analysis shows that the social network among journalists is well connected. The journalists who are extremely popular are also able to influence the flow of information through the network more than others (cf. gatekeeper role). Still, even though gatekeeping positions in the network are present due to the absence of specific relations, and the network consists of eight tightly knit network communities, the entire network is very well connected. The adoption of Twitter as a microblogging and networking service over time indicated that adoption increased particularly in early 2009. The possible consequences of these tightly knit communities for the production of news are discussed in terms of pack journalism, echo chambers, and information cascades.", "paper_title": "Peers and Sources as Social Capital in the Production of News: Online Social Networks as Communities of Journalists", "paper_id": "WOS:000354306600002"}