{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "grs_codes"}, {"score": 0.00481495049065317, "phrase": "reed-solomon_codes"}, {"score": 0.004731754442072492, "phrase": "prime_fields"}, {"score": 0.004698878021540436, "phrase": "deletion_correction_codes"}, {"score": 0.0046176782475198085, "phrase": "transmission_synchronization"}, {"score": 0.00450633982324153, "phrase": "pirated_media"}, {"score": 0.00386519448487341, "phrase": "efficient_decoding_algorithm"}, {"score": 0.0037719307016238998, "phrase": "error_correction"}, {"score": 0.003069867656852932, "phrase": "equivalent_codes"}, {"score": 0.0030167329549240078, "phrase": "exhaustive_and_selective_computer_searches"}, {"score": 0.0029438813080245544, "phrase": "highest_deletion"}, {"score": 0.0025156683465194967, "phrase": "l_transmitted_symbols"}, {"score": 0.002329530057661417, "phrase": "\"nice\"_codes"}, {"score": 0.002281194103324554, "phrase": "smallest_field"}, {"score": 0.0021646872269755067, "phrase": "identified_codes"}, {"score": 0.0021049977753042253, "phrase": "defined_equivalence"}], "paper_keywords": ["codes", " deletion correction", " Reed-Solomon"], "paper_abstract": "Deletion correction codes have been used for transmission synchronization and, more recently, tracing pirated media. A Generalized Reed-Solomon (GRS) code, denoted by GRS(k) (l, q, a, v), is a code of length l over GF(q) with q(k) codewords. These codes have an efficient decoding algorithm and have been widely used for error correction and detection. It was recently demonstrated that GRS codes are also capable of correcting deletions. We consider a subclass of GRS codes with dimension k = 2 and q prime, and study them with respect to deletion correcting capability. We give transformations that either preserve the code or maintain its deletion correction capability. We use this to define equivalent codes; and then use exhaustive and selective computer searches to find inequivalent codes with the highest deletion correcting capabilities. We show that, for the class under consideration, up to l - 3 deletions may be corrected. We also show that for l <= 36 there exist codes with q(2) codewords such that receiving only 3 out of l transmitted symbols of a codeword is enough to recover the codeword, thus meeting the bound specified above. We also specify some \"nice\" codes which are associated with the smallest field possible for codes of a given length and deletion correcting capability. Some of the identified codes are unique, with respect to the defined equivalence.", "paper_title": "Classification of the deletion correcting capabilities of Reed-Solomon codes of dimension 2 over prime fields", "paper_id": "WOS:000246862300025"}