{"auto_keywords": [{"score": 0.030302048840764602, "phrase": "visual_representation"}, {"score": 0.00481495049065317, "phrase": "visual_representations"}, {"score": 0.004775335634705251, "phrase": "problem_solving"}, {"score": 0.0045820747375409435, "phrase": "\"computational_thinking"}, {"score": 0.004525629293824217, "phrase": "computational_thinking"}, {"score": 0.004014452814186653, "phrase": "computer_systems"}, {"score": 0.0038838500580958744, "phrase": "visual_thinking"}, {"score": 0.003820144626025562, "phrase": "broader_effort"}, {"score": 0.003560807940070886, "phrase": "different_\"systems"}, {"score": 0.0028010985923790036, "phrase": "right_answer"}, {"score": 0.0026543514413663893, "phrase": "better_approaches"}, {"score": 0.002515272856011004, "phrase": "appropriate_tool"}, {"score": 0.002258546887303777, "phrase": "multiple_systems"}, {"score": 0.002184943946549964, "phrase": "best_examples"}], "paper_keywords": [""], "paper_abstract": "Many prominent computer scientists have proposed that every student should learn \"computational thinking.\" Computational thinking involves learning how to use computers to solve problems. It involves learning how to choose and design algorithms tailored to the problem, and how to build computer systems that implement these algorithms. How does visual thinking fit into this broader effort? In this talk I will argue that both computational and visual thinking are examples of different \"systems of thought.\" A system of thought is a set of ideas and representations that help us efficiently structure our thinking. Others examples of systems of thought include logic, mathematics, and language. Each of these systems of thought has strengths and weaknesses. There are problems where a visual representation immediately leads to the right answer. Unfortunately, many proponents of visualization advocate its use even though there are better approaches to solving the same problem. Furthermore, even if visualization is the appropriate tool, the most important first step is deciding how to depict the information. There are many subtle trade-offs in the choice of visual representation. Finally, experts often use multiple systems of thought synergistically. Many of the best examples of visualization occur when it is coupled with other ways of thinking.", "paper_title": "Systems of Thought: When to Use Visual Representations in Problem Solving", "paper_id": "WOS:000268217500002"}