{"auto_keywords": [{"score": 0.03992659287798476, "phrase": "smart_grid"}, {"score": 0.0120995832777597, "phrase": "multi-index_self-approximate-optimal_operation"}, {"score": 0.00481495049065317, "phrase": "smart_electrical_power_grid"}, {"score": 0.004183638135671596, "phrase": "new_challenges"}, {"score": 0.00413684709497912, "phrase": "modern_power_systems"}, {"score": 0.00345530020388352, "phrase": "traditional_power_grid"}, {"score": 0.003416628939053168, "phrase": "multi-index"}, {"score": 0.0032115093493071366, "phrase": "key_indices"}, {"score": 0.0031577303835881964, "phrase": "grid_operating_chain"}, {"score": 0.002727700630869639, "phrase": "electricity_grid"}, {"score": 0.00266693888510356, "phrase": "satisfactory_operation_point"}, {"score": 0.0026222551419772867, "phrase": "unsatisfactory_point"}, {"score": 0.002464709648714996, "phrase": "general_architecture_and_solution_algorithm"}, {"score": 0.0023036626988948133, "phrase": "china"}, {"score": 0.0021049977753042253, "phrase": "proposed_multi-index_self-approximate-optimal_operation"}], "paper_keywords": [""], "paper_abstract": "An instrumented, intelligent electrical power grid, or smart grid, is under research and is being preliminarily constructed in many parts of the world to deal with new challenges to modern power systems brought on by pressures on environment and resources. In this paper, a smart grid with the ability of multi-index self-approximate-optimal operation is considered the most distinctive difference between a smart grid and a traditional power grid. Multi-index is the index set that consists of a series of key indices for the grid operating chain, including generation, transmission, distribution, consumption, and dispatching. Self-approximate-optimal refers to the process by which the electricity grid arrives at a satisfactory operation point from an unsatisfactory point by its automated closed-loop control and regulation. In this paper, the general architecture and solution algorithm of multi-index self-approximate-optimal operation are proposed and developed. Furthermore, two realistic and promising practices in China are described to illustrate how a smart grid can be achieved under the guidance of the proposed multi-index self-approximate-optimal operation.", "paper_title": "Multi-index and self-approximate-optimal operation for a smart electrical power grid", "paper_id": "WOS:000208259500003"}