{"auto_keywords": [{"score": 0.043618802978160134, "phrase": "different_hosts"}, {"score": 0.028250826287237456, "phrase": "distribution_layout"}, {"score": 0.00481495049065317, "phrase": "multi-agent_applications"}, {"score": 0.004758987153057194, "phrase": "multiagent_application"}, {"score": 0.004283576270012874, "phrase": "multiagent_system"}, {"score": 0.004135859558144883, "phrase": "i.e._more_than_one_execution_platform"}, {"score": 0.003900853871728297, "phrase": "distributed_layout"}, {"score": 0.003580032420161922, "phrase": "distributed_system"}, {"score": 0.003443031148055198, "phrase": "distributed_environment"}, {"score": 0.0034029588672379926, "phrase": "mobile_agents"}, {"score": 0.003298357357267836, "phrase": "distributed_nature"}, {"score": 0.0029224275921964724, "phrase": "external_events"}, {"score": 0.002490053106007765, "phrase": "specific_application"}, {"score": 0.0024610448251906453, "phrase": "distributed_constraint_satisfaction_problems"}, {"score": 0.0022407927161620855, "phrase": "multiagent_application_design"}], "paper_keywords": [""], "paper_abstract": "A multiagent application consists of an environment and a number of agents. The environment contains information that the agents use and manipulate to do their work. When a multiagent system is decentralized over a number of different hosts (i.e. more than one execution platform is used), the environment has to be decentralized as well. The distributed layout of the environment can influence the performance of agents and of the system. In this paper we discuss when a distributed system can dynamically change its distribution layout. Our focus is on a distributed environment in which mobile agents move around and are aware of the distributed nature of the system. Changes to the layout of the distribution are not only triggered by the agents (like other, application-specific actions), but they can also be triggered by external events and the environment itself. A layer of meta-agents monitors those triggers. It has the ability to pro-actively change the distribution layout over the different hosts when this improves the behavior and efficiency of the application. Using a specific application (solving distributed constraint satisfaction problems) as an example, we indicate the usefulness of changes to the distribution layout and how they can be incorporated easily into a multiagent application design. It turns out that for some problems, the improvement in efficiency can be more than 30%.", "paper_title": "An adaptive distributed layout for multi-agent applications", "paper_id": "WOS:000238283600003"}