{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "vertex_sets"}, {"score": 0.004776669953449352, "phrase": "distributed_graph"}, {"score": 0.0044101380740283825, "phrase": "great_interest"}, {"score": 0.004137184278868391, "phrase": "high_prominence"}, {"score": 0.00407161650109722, "phrase": "topological_structure"}, {"score": 0.003912189642066724, "phrase": "vertex_set_bonding_query"}, {"score": 0.003850176174321088, "phrase": "vsb"}, {"score": 0.003758981686762617, "phrase": "minimum_set"}, {"score": 0.003684634192576662, "phrase": "maximum_importance"}, {"score": 0.003512123587588346, "phrase": "input_vertices"}, {"score": 0.002922207118572208, "phrase": "single_server"}, {"score": 0.0028758391869611374, "phrase": "vsb_query_evaluation"}, {"score": 0.0028313590954823194, "phrase": "np"}, {"score": 0.002741091312632307, "phrase": "scalability_issue"}, {"score": 0.0026760974046034854, "phrase": "almost_real_time"}, {"score": 0.002623111480310373, "phrase": "generic_solution_framework"}, {"score": 0.0025918235228843444, "phrase": "shared_nothing_distributed_environment"}, {"score": 0.0025001755089445092, "phrase": "graph_exploration"}, {"score": 0.0023171750718791713, "phrase": "bounded_space_cost"}, {"score": 0.0022352169832099153, "phrase": "extensive_experiments"}, {"score": 0.0021909411820497707, "phrase": "google's_cloud_platform"}], "paper_keywords": [""], "paper_abstract": "Given two sets of vertices in a graph, it is often of a great interest to find out how these vertices are connected, especially to identify the vertices of high prominence defined on the topological structure. In this work, we formally define a Vertex Set Bonding query (shorted as VSB), which returns a minimum set of vertices with the maximum importance w.r.t total betweenness and shortest path reachability in connecting two sets of input vertices. We find that such a kind of query is representative and could be widely applied in many real world scenarios, e.g., logistic planning, social community bonding and etc. Challenges are that many of such applications are constructed on graphs that are too large to fit in single server, and the VSB query evaluation turns to be NP-hard. To cope with the scalability issue and return the near optimal result in almost real time, we propose a generic solution framework on a shared nothing distributed environment. With the development of two novel techniques, guided graph exploration and betweenness ranking on exploration, we are able to efficiently evaluate queries for error bounded results with bounded space cost. We demonstrate the effectiveness of our solution with extensive experiments over both real and synthetic large graphs on the Google's Cloud platform. Comparing to the exploration only baseline method, our method achieves several times of speedup.", "paper_title": "Bonding Vertex Sets Over Distributed Graph: A Betweenness Aware Approach", "paper_id": "WOS:000386424800008"}