{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "idiomatic_expressions"}, {"score": 0.00624490577853423, "phrase": "statistical_measures"}, {"score": 0.004681971826924847, "phrase": "everyday_language"}, {"score": 0.004205226397573506, "phrase": "special_interest"}, {"score": 0.003920674807745575, "phrase": "semantic_idiosyncrasies"}, {"score": 0.0037768417338850274, "phrase": "great_deal"}, {"score": 0.003604421041893448, "phrase": "linguistics_literature"}, {"score": 0.0031770714776989282, "phrase": "computational_linguistics"}, {"score": 0.0029618842673339173, "phrase": "identified_linguistic_properties"}, {"score": 0.0027612315954598085, "phrase": "specific_property"}, {"score": 0.002562123444678208, "phrase": "type-based_classification_task"}, {"score": 0.0024336086025284836, "phrase": "possible_idiomatic_interpretation"}, {"score": 0.0023996890513009743, "phrase": "similar-on-the-surface_literal_phrases"}, {"score": 0.0021649437083408425, "phrase": "token_identification_task"}, {"score": 0.0021247934141234988, "phrase": "idiomatic_and_literal_usages"}, {"score": 0.0021049977753042253, "phrase": "potentially_idiomatic_expressions"}], "paper_keywords": [""], "paper_abstract": "Idiomatic expressions are plentiful in everyday language, yet they remain mysterious, as it is not clear exactly how people learn and understand them. They are of special interest to linguists, psycholinguists, and lexicographers, mainly because of their syntactic and semantic idiosyncrasies as well as their unclear lexical status. Despite a great deal of research on the properties of idioms in the linguistics literature, there is not much agreement on which properties are characteristic of these expressions. Because of their peculiarities, idiomatic expressions have mostly been overlooked by researchers in computational linguistics. In this article, we look into the usefulness of some of the identified linguistic properties of idioms for their automatic recognition. Specifically, we develop statistical measures that each model a specific property of idiomatic expressions by looking at their actual usage patterns in text. We use these statistical measures in a type-based classification task where we automatically separate idiomatic expressions (expressions with a possible idiomatic interpretation) from similar-on-the-surface literal phrases (for which no idiomatic interpretation is possible). In addition, we use some of the measures in a token identification task where we distinguish idiomatic and literal usages of potentially idiomatic expressions in context.", "paper_title": "Unsupervised Type and Token Identification of Idiomatic Expressions", "paper_id": "WOS:000272350600005"}