{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "evolutionary_fuzzy_systems"}, {"score": 0.00668687445702496, "phrase": "fuzzy_systems"}, {"score": 0.004539005582217309, "phrase": "successful_hybridization"}, {"score": 0.004463096299091981, "phrase": "evolutionary_algorithms"}, {"score": 0.0043150485532080065, "phrase": "inherent_interpretability"}, {"score": 0.004278807087784626, "phrase": "fuzzy_rule_based_systems"}, {"score": 0.004171891198117439, "phrase": "adaptation_capabilities"}, {"score": 0.00413684709497912, "phrase": "evolutionary_optimization"}, {"score": 0.0037701851296383405, "phrase": "fuzzy_rule_base_systems'_elements"}, {"score": 0.0036914757355166966, "phrase": "new_approaches"}, {"score": 0.0036450381529042103, "phrase": "evolutionary_components"}, {"score": 0.0034504423179340738, "phrase": "data_mining"}, {"score": 0.0032938942910948096, "phrase": "wide_number"}, {"score": 0.00305285084207725, "phrase": "new_advances"}, {"score": 0.0030017207229983385, "phrase": "novel_problems"}, {"score": 0.0027937732927852646, "phrase": "new_ways"}, {"score": 0.0022051664509486206, "phrase": "latest_trends"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Evolutionary Fuzzy Systems", " Multi-Objective Evolutionary Fuzzy Systems", " Fuzzy Rule Based Systems", " Taxonomy", " New trends", " Data Mining", " Scalability", " Big Data"], "paper_abstract": "Evolutionary Fuzzy Systems are a successful hybridization between fuzzy systems and Evolutionary Algorithms. They integrate both the management of imprecision/uncertainty and inherent interpretability of Fuzzy Rule Based Systems, with the learning and adaptation capabilities of evolutionary optimization. Over the years, many different approaches in Evolutionary Fuzzy Systems have been developed for improving the behavior of fuzzy systems, either acting on the Fuzzy Rule Base Systems' elements, or by defining new approaches for the evolutionary components. All these efforts have enabled Evolutionary Fuzzy Systems to be successfully applied in several areas of Data Mining and engineering. In accordance with the former, a wide number of applications have been also taken advantage of these types of systems. However, with the new advances in computation, novel problems and challenges are raised every day. All these issues motivate researchers to make an effort in releasing new ways of addressing them with Evolutionary Fuzzy Systems. In this paper, we will review the progression of Evolutionary Fuzzy Systems by analyzing their taxonomy and components. We will also stress those problems and applications already tackled by this type of approach. We will present a discussion on the most recent and difficult Data Mining tasks to be addressed, and which are the latest trends in the development of Evolutionary Fuzzy Systems. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Revisiting Evolutionary Fuzzy Systems: Taxonomy, applications, new trends and challenges", "paper_id": "WOS:000353853200011"}