{"auto_keywords": [{"score": 0.029942905947973716, "phrase": "mca"}, {"score": 0.004880731660338565, "phrase": "mca-ls"}, {"score": 0.00481495049065317, "phrase": "geospatial_abduction_problems"}, {"score": 0.004459190343665408, "phrase": "serial_killer"}, {"score": 0.0040010534672646775, "phrase": "weapons_caches"}, {"score": 0.0038852542808619334, "phrase": "strong_adversarial_component"}, {"score": 0.0037135876125125164, "phrase": "two-player_game"}, {"score": 0.00357362651129581, "phrase": "probabilistic_model"}, {"score": 0.0031062822219953524, "phrase": "reward_functions"}, {"score": 0.0027808359028506572, "phrase": "np"}, {"score": 0.002675571068567923, "phrase": "fully_polynomial_approximation_scheme"}, {"score": 0.002639502113350897, "phrase": "approximation_guarantees"}, {"score": 0.002598034157587518, "phrase": "reward_function"}, {"score": 0.0025000115574335693, "phrase": "mixed_integer_linear_programming_algorithm"}, {"score": 0.002483101428960361, "phrase": "oas"}, {"score": 0.0024111277643627154, "phrase": "different_approximation_guarantees"}, {"score": 0.0023840034492087336, "phrase": "monotonic_reward_function"}, {"score": 0.0023625233416109917, "phrase": "real_data"}, {"score": 0.002351855802526913, "phrase": "ied_attacks"}, {"score": 0.0023253968366218603, "phrase": "baghdad"}, {"score": 0.002252880693912436, "phrase": "mca-greedy-mono"}, {"score": 0.0021434588322608653, "phrase": "expected_benefit"}, {"score": 0.0021049977753042253, "phrase": "acceptable_time_period"}], "paper_keywords": ["Abduction", " spatial reasoning", " Algorithms", " Experimentation", " Theory"], "paper_abstract": "Geospatial Abduction Problems (GAPs) involve the inference of a set of locations that \"best explain\" a given set of locations of observations. For example, the observations might include locations where a serial killer committed murders or where insurgents carried out Improvised Explosive Device (IED) attacks. In both these cases, we would like to infer a set of locations that explain the observations, for example, the set of locations where the serial killer lives/works, and the set of locations where insurgents locate weapons caches. However, unlike all past work on abduction, there is a strong adversarial component to this; an adversary actively attempts to prevent us from discovering such locations. We formalize such abduction problems as a two-player game where both players (an \"agent\" and an \"adversary\") use a probabilistic model of their opponent (i.e., a mixed strategy). There is asymmetry as the adversary can choose both the locations of the observations and the locations of the explanation, while the agent (i.e., us) tries to discover these. In this article, we study the problem from the point of view of both players. We define reward functions axiomatically to capture the similarity between two sets of explanations (one corresponding to the locations chosen by the adversary, one guessed by the agent). Many different reward functions can satisfy our axioms. We then formalize the Optimal Adversary Strategy (OAS) problem and the Maximal Counter-Adversary strategy (MCA) and show that both are NP-hard, that their associated counting complexity problems are #P-hard, and that MCA has no fully polynomial approximation scheme unless P=NP. We show that approximation guarantees are possible for MCA when the reward function satisfies two simple properties (zero-starting and monotonicity) which many natural reward functions satisfy. We develop a mixed integer linear programming algorithm to solve OAS and two algorithms to (approximately) compute MCA; the algorithms yield different approximation guarantees and one algorithm assumes a monotonic reward function. Our experiments use real data about IED attacks over a 21-month period in Baghdad. We are able to show that both the MCA algorithms work well in practice; while MCA-GREEDY-MONO is both highly accurate and slightly faster than MCA-LS, MCA-LS (to our surprise) always completely and correctly maximized the expected benefit to the agent while running in an acceptable time period.", "paper_title": "Adversarial Geospatial Abduction Problems", "paper_id": "WOS:000313763300016"}