{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bit_complexity"}, {"score": 0.04655921366631187, "phrase": "ring_graphs"}, {"score": 0.0318524882381123, "phrase": "lower_bounds"}, {"score": 0.004497576466646301, "phrase": "vertex_colouring_algorithm"}, {"score": 0.0030591147406390986, "phrase": "mellin_transform"}, {"score": 0.002857143106182505, "phrase": "distributed_randomised_anonymous_ring_colouring_problem"}, {"score": 0.002733598121537801, "phrase": "negligible_additive_function"}, {"score": 0.0025326211341475903, "phrase": "unique_identities"}, {"score": 0.0022358683283304533, "phrase": "upper_bound"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bit complexity", " Colouring", " Mellin transform", " Probabilistic analysis", " Randomised distributed graph algorithm", " Ring", " Time complexity"], "paper_abstract": "We present and analyse a very simple randomised distributed vertex colouring algorithm for ring graphs. Its time complexity is log(2) n + o(log n) on average and 2 log(2) n + o(log n) with probability 1 - o(n(-1)). Since each message contains one bit, we deduce the same values for its bit complexity. Then we combine this algorithm with another and we obtain a 3-colouring algorithm for ring graphs. Thanks to an overlapping, we obtain once more the same values for the time complexities on average and with probability 1-o(n(-1)). The same results hold for the bit complexity. These results are obtained using the Mellin transform. We establish lower bounds (on average and with probability 1 - o(n(-1))) for the distributed randomised anonymous ring colouring problem. We prove that our algorithms match these lower bounds modulo a negligible additive function (negligible with respect to log(2) n). We assume that the ring is anonymous: unique identities are not available to distinguish the processes; we only assume that each vertex distinguishes between its neighbours. Furthermore, we do not assume that the size (or an upper bound on the size) of the ring is known. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "On the time and the bit complexity of distributed randomised anonymous ring colouring", "paper_id": "WOS:000325599700007"}