{"auto_keywords": [{"score": 0.04442578189394114, "phrase": "reference_values"}, {"score": 0.015610001149308939, "phrase": "analytical_liquid_dilution_system"}, {"score": 0.015002370901578995, "phrase": "pectin_carbohydrate_backbone"}, {"score": 0.013472589728326404, "phrase": "carrier_stream"}, {"score": 0.009170876138587757, "phrase": "mcr-als"}, {"score": 0.00481495049065317, "phrase": "industrial_pectin"}, {"score": 0.004658426838467567, "phrase": "intra-molecular_distribution"}, {"score": 0.004506968388996092, "phrase": "remethylated_pectin"}, {"score": 0.004412201199864308, "phrase": "different_known_ester_distributions"}, {"score": 0.0040910373671637305, "phrase": "fixed_concentration"}, {"score": 0.003820144626025562, "phrase": "continuously_stirred_tank_reactor"}, {"score": 0.003722132819035708, "phrase": "uv-vis_spectra"}, {"score": 0.003678414118674967, "phrase": "reactor_outlet"}, {"score": 0.003500313767208306, "phrase": "triplicate_runs"}, {"score": 0.003426640459083931, "phrase": "acquired_landscapes"}, {"score": 0.003378385493203297, "phrase": "multivariate_curve_resolution"}, {"score": 0.00336245322835168, "phrase": "mcr"}, {"score": 0.0032376465741070274, "phrase": "common_spectral_profiles"}, {"score": 0.0029805015010906013, "phrase": "dependent_variables"}, {"score": 0.0028428117812424837, "phrase": "conventional_pls."}, {"score": 0.0027437235598539904, "phrase": "independent_variables"}, {"score": 0.0027307840472437137, "phrase": "pls"}, {"score": 0.0027050595279115015, "phrase": "whole_landscape"}, {"score": 0.002673254913887336, "phrase": "spectral_information"}, {"score": 0.002598437206050684, "phrase": "mentioned_individual_concentration_profiles"}, {"score": 0.0025257081555100556, "phrase": "sample_run"}, {"score": 0.0024960069794216977, "phrase": "identified_score_values"}, {"score": 0.002449208093757498, "phrase": "new_independent_variables"}, {"score": 0.0023470862747075228, "phrase": "induced_degree"}, {"score": 0.0023194807260455007, "phrase": "error_level"}, {"score": 0.002170769957548685, "phrase": "full_set"}, {"score": 0.002155412043665635, "phrase": "best_calibration_models"}, {"score": 0.002130056082139311, "phrase": "unfolded_landscapes"}, {"score": 0.002119997236600981, "phrase": "unfolded_concentration_profiles"}], "paper_keywords": ["PARAFAC2", " Multivariate Curve Resolution", " pectin", " blockiness", " intramolecular distribution of esterification", " analytical liquid dilution system"], "paper_abstract": "Measurements from an analytical liquid dilution system are used to quantify the intra-molecular distribution of ester groups on the pectin carbohydrate backbone. Thirty-one pectins have been produced from remethylated pectin by enzymatically deesterifying them in steps to give different known ester distributions. The amount of deesterification is measured in each step by titration to provide the reference values. The system works by injecting a solution of pectin into a carrier stream containing a fixed concentration of dye. The dye binds site-specifically to the poly-alpha-(1 -> 4)-D-galacturonic acids constituting the non-esterified parts of the pectin carbohydrate backbone. The carrier stream is led to a Continuously Stirred Tank Reactor (CSTR). The pectin is slowly diluted while UV-VIS spectra are recorded at the reactor outlet providing a landscape of wavelength-by-time for every sample. All pectins are measured this way in triplicate runs. In an article preceding this, the acquired landscapes have been analysed qualitatively using Multivariate Curve Resolution (MCR) and PARAFAC2, both Alternating Least Squares (ALS) regression algorithms. It is concluded that the landscapes can be described by common spectral profiles for all pectins and individual concentration/time profiles for each sample run. In this article, calibration to the reference values are done by multi-way Partial Least Squares (PLS) regression to correlate the acquired landscapes as independent variables directly to the reference values as dependent variables. Also, calibration is done by unfolding the landscapes for each sample run to a vector and use conventional PLS. The concentration/time profiles previously identified by MCR-ALS or PARAFAC2 are unfolded and used as independent variables in PLS rather than the whole landscape. Finally, the spectral information can be reduced even further by summing up or integrating the mentioned individual concentration profiles to just one number per profile identified by MCR-ALS or PARAFAC2 in the sample run, or using the identified score values for each profile from the PARAFAC2 model as new independent variables. The most successful calibration models based on a calibration set built from one of the triplicates can predict the induced degree of deesterification to an error level of less than 3% in absolute values-corresponding to a 6% relative error to the calibration full range-when tested onto a set consisting of the two remaining sample runs from the full set. The best calibration models are based either on unfolded landscapes or unfolded concentration profiles resolved by MCR-ALS. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Multi-way analysis for investigation of industrial pectin using an analytical liquid dilution system", "paper_id": "WOS:000242768200003"}