{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "service_quality"}, {"score": 0.0495648351427175, "phrase": "relationship_quality"}, {"score": 0.007454170030697204, "phrase": "client_orientation"}, {"score": 0.0072953042932520475, "phrase": "project_management_effectiveness"}, {"score": 0.005055806192677566, "phrase": "conceptual_model"}, {"score": 0.004921159585548599, "phrase": "positive_causal_effect"}, {"score": 0.004440277230269978, "phrase": "task-technology-structure_fit"}, {"score": 0.004206767038617782, "phrase": "outsourcing_relationships"}, {"score": 0.0037150687722055727, "phrase": "significant_impact"}, {"score": 0.003675120438902734, "phrase": "user_satisfaction"}, {"score": 0.003519561814102764, "phrase": "causal_effects"}, {"score": 0.0032278559855285975, "phrase": "post-analysis_theory_building"}, {"score": 0.0028502479839354637, "phrase": "promotion_effectiveness"}, {"score": 0.002127915423138391, "phrase": "internet_technologies"}, {"score": 0.0021049977753042253, "phrase": "collaboration_tools"}], "paper_keywords": ["service quality", " relationship quality", " outsourcing", " Internet"], "paper_abstract": "A national survey of firms that participated in outsourcing relationships was conducted, and service quality and relationship quality were found to be significantly and positively related to each other and both had a significant impact on user satisfaction. However, the intricacies of the causal effects between the two autonomous constructs, service quality and relationship quality, are a source of interest. In post-analysis theory building, we give a conceptual model that proposes that the positive causal effect of service quality on relationship quality would be positively moderated by the client orientation and promotion effectiveness of the vendor, while the positive causal effect of relationship quality on service quality would be mediated by the project management effectiveness. Hence, this paper comprises of two related parts: first an empirical study, and secondly developing a theory and conceptual model that delve into the causalities involved in service quality, relationship quality, and the role of Internet technologies and collaboration tools.", "paper_title": "Understanding service quality and relationship quality in is outsourcing: Client orientation & promotion, project management effectiveness, and the task-technology-structure fit", "paper_id": "WOS:000252820800001"}