{"auto_keywords": [{"score": 0.045939026495003796, "phrase": "efrp"}, {"score": 0.010454142569532593, "phrase": "cognitive_processing"}, {"score": 0.00966053891715153, "phrase": "efrp_method"}, {"score": 0.00839761629736605, "phrase": "email_pop-up_notification"}, {"score": 0.004816948774064294, "phrase": "precision"}, {"score": 0.0046276016230633495, "phrase": "eye_fixation-related_potentials"}, {"score": 0.004594326191526569, "phrase": "information_systems_research"}, {"score": 0.004137761530535196, "phrase": "users'_neural_activity"}, {"score": 0.004093190049699647, "phrase": "exact_time"}, {"score": 0.0036862417490612673, "phrase": "traditional_event"}, {"score": 0.0033196177202591843, "phrase": "method_conjecture"}, {"score": 0.002862462250995423, "phrase": "use_context"}, {"score": 0.0027708353425467927, "phrase": "industry_report"}, {"score": 0.002750874355974879, "phrase": "email_pop-up_notifications"}, {"score": 0.002577557228072987, "phrase": "attentional_reaction"}, {"score": 0.002198380879018061, "phrase": "natural_is_use_contexts"}, {"score": 0.0021049977753042253, "phrase": "research_questions"}], "paper_keywords": ["Eye Fixation-Related Potential", " EFRP", " Event Related Potential", " ERP", " Electroencephalography", " Eye-tracking", " NeuroIS", " IT Use", " IT impact", " IS Methods"], "paper_abstract": "This paper introduces the eye-fixation related potential (EFRP) method to IS research. The EFRP method allows one to synchronize eye tracking with electroencephalographic (EEG) recording to precisely capture users' neural activity at the exact time at which they start to cognitively process a stimulus (e.g., event on the screen). This complements and overcomes some of the shortcomings of the traditional event related potential (ERP) method, which can only stamp the time at which a stimulus is presented to a user. Thus, we propose a method conjecture of the superiority of EFRP over ERP for capturing the cognitive processing of a stimulus when such cognitive processing is not necessarily synchronized with the time at which the stimulus appears. We illustrate the EFRP method with an experiment in a natural IS use context in which we asked users to read an industry report while email pop-up notifications arrived on their screen. The results support our proposed hypotheses and show three distinct neural processes associated with 1) the attentional reaction to email pop-up notification, 2) the cognitive processing of the email pop-up notification, and 3) the motor planning activity involved in opening or not the email. Furthermore, further analyses of the data gathered in the experiment serve to validate our method conjecture about the superiority of the EFRP method over the ERP in natural IS use contexts. In addition to the experiment, our study discusses important IS research questions that could be pursued with the aid of EFRP, and describes a set of guidelines to help IS researchers use this method.", "paper_title": "Precision is in the Eye of the Beholder: Application of Eye Fixation-Related Potentials to Information Systems Research", "paper_id": "WOS:000345064000002"}