{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conjunctive_queries"}, {"score": 0.049146612112995945, "phrase": "functional_dependencies"}, {"score": 0.014900487383154404, "phrase": "frequent_queries"}, {"score": 0.004767826806287385, "phrase": "relational_tables"}, {"score": 0.004494570360108983, "phrase": "relational_table"}, {"score": 0.004073359218158693, "phrase": "conjunctive_projection-selection_queries"}, {"score": 0.0035141291835319682, "phrase": "support_measure"}, {"score": 0.0032800186243040663, "phrase": "equivalence_relation"}, {"score": 0.0028016507334576216, "phrase": "basic_properties"}, {"score": 0.0026277995163948263, "phrase": "optimized_computation"}, {"score": 0.0021049977753042253, "phrase": "basic_computational_implications"}], "paper_keywords": ["Functional dependencies", " data mining", " level-wise algorithms", " frequent queries", " equivalent queries"], "paper_abstract": "The problem of mining all frequent queries on a relational table is a problem known to be intractable even for conjunctive queries. In this article, we restrict our attention to conjunctive projection-selection queries and we assume that the table to be mined satisfies a set of functional dependencies. Under these assumptions, we define and characterize two pre-orderings with respect to which the support measure is shown to be anti-monotonic. Each of these pre-orderings induces an equivalence relation for which all queries of the same equivalence class have the same support. The goal of this article is not to provide algorithms for the computation of frequent queries, but rather to provide basic properties of pre-orderings and their associated equivalence relations showing that functional dependencies can be used for an optimized computation of supports of conjunctive queries. In particular, we show that one of the two pre-orderings characterizes anti-monotonicity of the support, while the other one refines the former, but allows to characterize anti-monotonicity with respect to a given table, only. Basic computational implications of these properties are discussed in the article.", "paper_title": "Computing Supports of Conjunctive Queries on Relational Tables with Functional Dependencies", "paper_id": "WOS:000279637900002"}