{"auto_keywords": [{"score": 0.03444175794330926, "phrase": "road_networks"}, {"score": 0.024569834132651368, "phrase": "euclidean_distance"}, {"score": 0.004642604455537883, "phrase": "historical_trajectories"}, {"score": 0.004476399615305783, "phrase": "numerous_size"}, {"score": 0.004422325007817267, "phrase": "accumulated_data"}, {"score": 0.0041112665381266315, "phrase": "euclidean_spaces"}, {"score": 0.003845313870879042, "phrase": "transportation_networks"}, {"score": 0.0034676182423067307, "phrase": "previous_work"}, {"score": 0.003089080923888397, "phrase": "indexing_method"}, {"score": 0.002735052488172277, "phrase": "spatial_networks"}, {"score": 0.0026209522797963447, "phrase": "network-based_spatiotemporal_range_query_processing"}, {"score": 0.002526938673434697, "phrase": "multiple_r-trees"}, {"score": 0.002421499421848063, "phrase": "network-based_spatiotemporal_range_query"}, {"score": 0.0021438155673297377, "phrase": "node_accesses"}, {"score": 0.0021049977753042253, "phrase": "network-based_range_query_processing"}], "paper_keywords": [""], "paper_abstract": "Recently many researchers have focused on management of historical trajectories of moving objects due to numerous size of accumulated data over time. However, most of them are concentrated in Euclidean spaces with (x, y, t). In real world, moving objects like vehicles on transportation networks have constraints on their movements, and some of applications need to manage and query them. Previous work based on Euclidean is inefficient to process trajectories on road networks. In this paper, we propose a indexing method for trajectories of moving objects on road networks. While some work has been done for indexing the trajectory in spatial networks, little indexing method support the network-based spatiotemporal range query processing. Our method consists of multiple R-trees and graph structures to process the network-based spatiotemporal range query defined by the network distance instead of Euclidean distance. Consequently, we show that our method takes about 30% less in node accesses for the network-based range query processing than other methods based on the Euclidean distance by experiments.", "paper_title": "A network-based indexing method for trajectories of moving objects", "paper_id": "WOS:000241754200036"}