{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "problematic_internet_use"}, {"score": 0.04596583295354634, "phrase": "college_students"}, {"score": 0.026010656447810827, "phrase": "heavy_users"}, {"score": 0.02246846748295755, "phrase": "piu"}, {"score": 0.004767261858417823, "phrase": "chinese_college_students"}, {"score": 0.004337028108577593, "phrase": "possible_factors"}, {"score": 0.004024863549087511, "phrase": "eight_different_universities"}, {"score": 0.0039849717890694065, "phrase": "wuhan"}, {"score": 0.003945708998277485, "phrase": "china"}, {"score": 0.0038676325043529524, "phrase": "young's_diagnostic_questionnaire"}, {"score": 0.0037724857647796813, "phrase": "ydq"}, {"score": 0.0036980501827538455, "phrase": "zung_self-rating"}, {"score": 0.00367967106192446, "phrase": "depression_scale"}, {"score": 0.0034317185678527672, "phrase": "chi-squared_testing"}, {"score": 0.003075296862372287, "phrase": "piu._factors"}, {"score": 0.003029643234751066, "phrase": "heavy_internet_use_habits"}, {"score": 0.00299958349498286, "phrase": "poor_academic_achievement"}, {"score": 0.0026217213613095322, "phrase": "light_internet_users"}], "paper_keywords": ["problematic internet use", " college students", " risk factor", " depression"], "paper_abstract": "This study was set to investigate the prevalence of problematic internet use (PIU) among college students and the possible factors related to this disorder. About 4400 college students, ranging from freshmen to juniors, from eight different universities in Wuhan, China were surveyed. Young's Diagnostic Questionnaire for Internet Addiction (YDQ) and the Zung Self-rating Depression Scale were used to define PIU and depression accordingly. Data was analysed with chi-squared testing and logistic regression. Out of the 3496 participants, 9.58% (male 13.54%, female 4.88%) met the criteria of PIU. Factors such as heavy internet use habits, poor academic achievement, lack of love from the family, etc. were found to be significantly associated with PIU. About 48.51% (1696) of the students were light internet users, who use the internet 55 h/week, while 16.36% (572) were heavy users who use it more than 15 h/week, though heavy users were more likely to develop PIU. Also, 25.53% of the students with depression developed PIU, in comparison with 8.91% of PIU among those without depression (p 5 0.001). Being male, frequent internet use, poor academic achievement, poor family atmosphere and lack of love from parents were predictors of PIU among college students. The habit and purpose of using the internet is diverse, which influences the susceptibility of PIU as well. There was a correlation between depression and the development of PIU as well.", "paper_title": "Features and predictors of problematic internet use in Chinese college students", "paper_id": "WOS:000269266300008"}