{"auto_keywords": [{"score": 0.049558064870310475, "phrase": "time_constraints"}, {"score": 0.02322730111336098, "phrase": "sequential_patterns"}, {"score": 0.004199247711875386, "phrase": "gsp_algorithm"}, {"score": 0.0040192915527630995, "phrase": "temporal_relationships"}, {"score": 0.0036419834462626125, "phrase": "individual_behavior"}, {"score": 0.003602302241898501, "phrase": "generalized_sequential_patterns"}, {"score": 0.0035049738376240567, "phrase": "end_user"}, {"score": 0.0032107911131811057, "phrase": "new_efficient_algorithm"}, {"score": 0.0028460640294160383, "phrase": "earlier_stage"}, {"score": 0.0027996401456881806, "phrase": "data_mining_process"}, {"score": 0.0024410093024417527, "phrase": "traditional_levelwise_approaches"}, {"score": 0.002285527382381719, "phrase": "counting_step"}, {"score": 0.0022482261385133617, "phrase": "data_sequence"}, {"score": 0.002175436093794315, "phrase": "proposed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_sequence_mining_algorithm"}], "paper_keywords": ["Time constraints", " Sequential patterns", " Levelwise algorithms"], "paper_abstract": "In this paper we consider the problem of discovering sequential patterns by handling time constraints as defined in the Gsp algorithm. While sequential patterns could be seen as temporal relationships between facts embedded in the database where considered facts are merely characteristics of individuals or observations of individual behavior, generalized sequential patterns aim to provide the end user with a more flexible handling of the transactions embedded in the database. We thus propose a new efficient algorithm, called GTC (Graph for Time Constraints) for mining such patterns in very large databases. It is based oil the idea that handling time constraints in the earlier stage of the data mining process can be highly beneficial. One of the most significant new feature of our approach is that handling of time constraints can be easily taken into account in traditional levelwise approaches since it is carried out prior to and separately from the Counting step of a data sequence. Our test shows that the proposed algorithm performs significantly faster than a state-of-the-art sequence mining algorithm. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Efficient mining of sequential patterns with time constraints: Reducing the combinations", "paper_id": "WOS:000262178100012"}