{"auto_keywords": [{"score": 0.0489853873227799, "phrase": "customer_involvement"}, {"score": 0.015719716506582538, "phrase": "suppliers'_trust"}, {"score": 0.007123000122277129, "phrase": "social_exchange_theory"}, {"score": 0.004650896226390719, "phrase": "purpose_-_the_purpose"}, {"score": 0.004289419884432487, "phrase": "transaction-specific_investment"}, {"score": 0.004001938457469328, "phrase": "relational_governance_mechanism"}, {"score": 0.003777088546146369, "phrase": "survey_data"}, {"score": 0.0036482665232275583, "phrase": "structural_equation_model"}, {"score": 0.0035648266669315943, "phrase": "conceptual_model"}, {"score": 0.003120657021758196, "phrase": "switching_costs"}, {"score": 0.0028446460307503343, "phrase": "suppliers'_commitment"}, {"score": 0.0024049552650867935, "phrase": "relational_norms"}, {"score": 0.0022305310659333864, "phrase": "new_directions"}, {"score": 0.0021049977753042253, "phrase": "relational_governance"}], "paper_keywords": ["Commitment", " Trust", " Customer involvement", " Relational governance"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the relationships among suppliers' trust and commitment, transaction-specific investment, switching cost, and customer involvement within the context of relational governance mechanism and the social exchange theory. Design/methodology/approach - The authors use survey data from 214 Chinese manufacturing firms and employ the structural equation model to verify the conceptual model. Findings - Relational governance benefits customer involvement. Transaction-specific investment mediates the relationship between trust and commitment of suppliers. Switching costs negatively moderate the relationship between suppliers' trust and customer involvement, but positively moderate the relationship between suppliers' commitment and customer involvement. Research limitations/implications - The authors focus on two key elements of relationship, namely, trust and commitment of suppliers, but neglect other relational factors, such as relational norms and interdependence. Originality/value - These findings broaden the understanding and present new directions for the implementation of customer involvement from the perspective of relational governance and social exchange theory.", "paper_title": "Effects of suppliers' trust and commitment on customer involvement", "paper_id": "WOS:000359055200004"}