{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_web"}, {"score": 0.005055806192677566, "phrase": "reputation_mechanism"}, {"score": 0.004538259399464747, "phrase": "semtrust"}, {"score": 0.004537254814246843, "phrase": "steady_pace"}, {"score": 0.00355782527287734, "phrase": "information_source"}, {"score": 0.003057910095857785, "phrase": "viable_solution"}, {"score": 0.0030086877092638945, "phrase": "trustworthy_behavior"}, {"score": 0.0028502479839354637, "phrase": "reputation_multi-agent_system"}, {"score": 0.0026710653215026685, "phrase": "semantic_similarity"}, {"score": 0.002320449502337321, "phrase": "existing_malicious_agents"}, {"score": 0.0021049977753042253, "phrase": "reputation-based_multi-agent_technology"}], "paper_keywords": [""], "paper_abstract": "Though research on the Semantic Web has progressed at a steady pace, its promise has yet to be realized. One major difficulty is that, by its very nature, the Semantic Web is a large, uncensored system to which anyone may contribute, especially when using a P2P-based multi-agent infrastructure for knowledge sharing. This raises the question of how much credence to give each information source. We cannot expect each user to know the trustworthiness of each source. We tackle this problem by employing a reputation mechanism, which offer a viable solution to encouraging trustworthy behavior in Semantic Web. In addition, we introduce a reputation multi-agent system, SemTrust, which enable Semantic Web to utilize reputation mechanism based on semantic similarity between agents. Our experiments show that the system with SemTrust outperforms the system without it and our approach is more robust with security under conditions where existing malicious agents. We hope that these methods will help move the Semantic Web closer to fulfilling its promise by using reputation-based multi-agent technology.", "paper_title": "A reputation multi-agent system in Semantic Web", "paper_id": "WOS:000239626100022"}