{"auto_keywords": [{"score": 0.048665502544113524, "phrase": "control_messages"}, {"score": 0.00481495049065317, "phrase": "large-scale_distributed_systems"}, {"score": 0.0045348429403481464, "phrase": "global_snapshot"}, {"score": 0.004326188427877999, "phrase": "underlying_logical_overlay_topology"}, {"score": 0.004109454074072009, "phrase": "whole_processes"}, {"score": 0.0038868464660354626, "phrase": "higher_possibility"}, {"score": 0.00385368199735867, "phrase": "network_congestion"}, {"score": 0.0036605323485683983, "phrase": "large-scale_distributed_system"}, {"score": 0.003598317040926701, "phrase": "huge_number"}, {"score": 0.0032604908177429493, "phrase": "higher_response_time"}, {"score": 0.003123652729688503, "phrase": "efficient_global-snapshot_algorithm"}, {"score": 0.002842428606954139, "phrase": "response_time"}, {"score": 0.0028060889647071787, "phrase": "message_complexity"}, {"score": 0.0026767629720554397, "phrase": "identical_steps"}, {"score": 0.0025099367332615794, "phrase": "better_workload_balance"}, {"score": 0.002353483216544667, "phrase": "minimum_number"}, {"score": 0.0022936610196951962, "phrase": "symmetrical_global-snapshot_algorithm"}, {"score": 0.0021049977753042253, "phrase": "non-fifo_channels"}], "paper_keywords": ["Distributed systems", " global snapshots", " process symmetry", " message passing", " checkpointing"], "paper_abstract": "Most existing global-snapshot algorithms in distributed systems use control messages to coordinate the construction of a global snapshot among all processes. Since these algorithms typically assume the underlying logical overlay topology is fully connected, the number of control messages exchanged among the whole processes is proportional to the square of number of processes, resulting in higher possibility of network congestion. Hence, such algorithms are neither efficient nor scalable for a large-scale distributed system composed of a huge number of processes. Recently, some efforts have been presented to significantly reduce the number of control messages, but doing so incurs higher response time instead. In this paper, we propose an efficient global-snapshot algorithm able to let every process finish its local snapshot in a given number of rounds. Particularly, such an algorithm allows a tradeoff between the response time and the message complexity. Moreover, our global-snapshot algorithm is symmetrical in the sense that identical steps are executed by every process. This means that our algorithm is able to achieve better workload balance and less network congestion. Most importantly, based on our framework, we demonstrate that the minimum number of control messages required by a symmetrical global-snapshot algorithm is Omega(N log N), where N is the number of processes. Finally, we also assume non-FIFO channels.", "paper_title": "Flexible Symmetrical Global-Snapshot Algorithms for Large-Scale Distributed Systems", "paper_id": "WOS:000313816300007"}