{"auto_keywords": [{"score": 0.03746482718075358, "phrase": "virtual_environments"}, {"score": 0.009675724626541767, "phrase": "physical_world"}, {"score": 0.00481495049065317, "phrase": "hmd-based_virtual_environments"}, {"score": 0.004657809474368475, "phrase": "ledge"}, {"score": 0.003667468902144262, "phrase": "people's_judgments"}, {"score": 0.003524150055503105, "phrase": "head-mounted_displays"}, {"score": 0.003254041350487688, "phrase": "real_world"}, {"score": 0.0030447855364295015, "phrase": "virtual_environment_technologies"}, {"score": 0.0030246125031350903, "phrase": "precise_control"}, {"score": 0.002994602527726632, "phrase": "myriad_perceptual_cues"}, {"score": 0.002587081502365341, "phrase": "virtual_environment"}, {"score": 0.0025528981558942372, "phrase": "central_factor"}, {"score": 0.002527556628744957, "phrase": "important_factor"}, {"score": 0.0022648286660146314, "phrase": "animated_self-avatars"}, {"score": 0.0021049977753042253, "phrase": "people's_affordance_judgments"}], "paper_keywords": ["Experimentation", " Human Factors", " Performance", " Virtual reality", " head-mounted displays", " affordances", " height perception"], "paper_abstract": "People judge what they can and cannot do all the time when acting in the physical world. Can I step over that fence or do I need to duck under it? Can I step off of that ledge or do I need to climb off of it? These qualities of the environment that people perceive that allow them to act are called affordances. This article compares people's judgments of affordances on two tasks in both the real world and in virtual environments presented with head-mounted displays. The two tasks were stepping over or ducking under a pole, and stepping straight off of a ledge. Comparisons between the real world and virtual environments are important because they allow us to evaluate the fidelity of virtual environments. Another reason is that virtual environment technologies enable precise control of the myriad perceptual cues at work in the physical world and deepen our understanding of how people use vision to decide how to act. In the experiments presented here, the presence or absence of a self-avatar-an animated graphical representation of a person embedded in the virtual environment-was a central factor. Another important factor was the presence or absence of action, that is, whether people performed the task or reported that they could or could not perform the task. The results show that animated self-avatars provide critical information for people deciding what they can and cannot do in virtual environments, and that action is significant in people's affordance judgments.", "paper_title": "Affordance Judgments in HMD-Based Virtual Environments: Stepping over a Pole and Stepping off a Ledge", "paper_id": "WOS:000354047900002"}