{"auto_keywords": [{"score": 0.049571431541439746, "phrase": "situational_simulations"}, {"score": 0.011570889556747338, "phrase": "simulation_events"}, {"score": 0.00481495049065317, "phrase": "construction_management_events"}, {"score": 0.00458940888106061, "phrase": "educational_computer_simulations"}, {"score": 0.004492573860101133, "phrase": "user_experiences"}, {"score": 0.004327981760540394, "phrase": "dynamic_system"}, {"score": 0.004081385289516914, "phrase": "complex_environment"}, {"score": 0.0038900709793274484, "phrase": "michigan_technological_university"}, {"score": 0.003687960013746783, "phrase": "construction_management_education"}, {"score": 0.0034963129868796033, "phrase": "simulation_variables"}, {"score": 0.0030595112110658675, "phrase": "project_outcome"}, {"score": 0.003010893527930816, "phrase": "simulation_event"}, {"score": 0.0029630461161780203, "phrase": "player's_experience"}, {"score": 0.0021620042653528846, "phrase": "social_dynamics"}, {"score": 0.0021390191069313945, "phrase": "project_management"}, {"score": 0.0021049977753042253, "phrase": "simulation_environment"}], "paper_keywords": [""], "paper_abstract": "The challenge and promise of educational computer simulations are to provide user experiences that allow for immersion into a dynamic system in which participants discover the ramifications of their decisions in a complex environment. Researchers at the University of Washington, in collaboration with Michigan Technological University, are developing situational simulations to meet the needs of construction management education. This article explores the development of simulation events where simulation variables are changed due to an event, and then the player is challenged to interact with the simulation by making decisions that impact the project outcome. A simulation event includes the player's experience, variables altered by the event, and variables changed by the player. This article defines the concept of simulation events within the context of situational simulations; explains how events are triggered, represented, and handled within the simulation and database; describes how players engage with the simulation; and identifies the challenges of incorporating the social dynamics of project management into the simulation environment.", "paper_title": "Developing Construction Management Events in Situational Simulations", "paper_id": "WOS:000274453400004"}