{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "danish"}, {"score": 0.004861900254800791, "phrase": "praat"}, {"score": 0.004448471107649881, "phrase": "non-scripted_monologues"}, {"score": 0.0038919354605673104, "phrase": "one-way_communication"}, {"score": 0.003834548373258131, "phrase": "unseen_partner"}, {"score": 0.0033545600622020464, "phrase": "virtual_city_map"}, {"score": 0.0030081030319492343, "phrase": "hcrc_map_tasks"}, {"score": 0.0028768722873689432, "phrase": "sound_files"}, {"score": 0.0028203950416405563, "phrase": "prosodic_phrases"}, {"score": 0.0026443691099806003, "phrase": "separate_interval_tiers"}, {"score": 0.0025924443774713473, "phrase": "orthographical_representation"}, {"score": 0.0025668646315794947, "phrase": "detailed_part-of-speech_tags"}, {"score": 0.0022563636435096457, "phrase": "pitch_relation"}, {"score": 0.0021049977753042253, "phrase": "phrasal_intonation"}], "paper_keywords": ["Monologue", " Dialogue", " Spontaneous speech", " Corpus", " Phonetic notation", " Prosodic labeling"], "paper_abstract": "A corpus is described consisting of non-scripted monologues and dialogues, recorded by 27 speakers, comprising a total of 73,227 running words, corresponding to 9 h and 46 min of speech. The monologues were recorded as one-way communication with an unseen partner where the speaker performed three different tasks: (s)he described a network consisting of various geometrical shapes in various colours, (s)he guided the listener through four different routes in a virtual city map, and (s)he instructed the listener how to build a house from its individual pieces. The dialogues are replicas of the HCRC map tasks. Annotation is performed in Praat. The sound files are segmented into prosodic phrases, words, and syllables. The files are supplied, in separate interval tiers, with an orthographical representation, detailed part-of-speech tags, simplified part-of-speech tags, a phonemic notation, a semi-narrow phonetic notation, a symbolic representation of the pitch relation between each stressed and post-tonic syllable, and a symbolic representation of the phrasal intonation. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "A Danish phonetically annotated spontaneous speech corpus (DanPASS)", "paper_id": "WOS:000267572800005"}