{"auto_keywords": [{"score": 0.04172294002873907, "phrase": "adsorption_energy"}, {"score": 0.04132712815039597, "phrase": "hcn"}, {"score": 0.011787511676857269, "phrase": "different_relative_orientations"}, {"score": 0.007717631459526514, "phrase": "hcn_adsorption"}, {"score": 0.00481495049065317, "phrase": "potential_hydrogen_cyanide_sensor"}, {"score": 0.004466519142879166, "phrase": "polypyrrole_model"}, {"score": 0.004164488042071313, "phrase": "dft"}, {"score": 0.002873331232538783, "phrase": "frontier_molecular_orbitals"}, {"score": 0.0026120705848349055, "phrase": "appropriate_relative_orientations"}, {"score": 0.0024348510123716424, "phrase": "homo-lumo_energy_gap"}, {"score": 0.0021049977753042253, "phrase": "hcn_sensor"}], "paper_keywords": ["Terpyrrole", " Polypyrrole", " HCN", " DFT", " Density of states", " HOMO", " LUMO"], "paper_abstract": "The sensitivity of terpyrrole (TPy; used as a polypyrrole model) to toxic hydrogen cyanide (HCN) adsorption was studied by using DFT to perform geometry optimization and to calculate the adsorption energy of HCN on TPy as well as orbital properties. The interaction of terpyrrole with HCN was studied for different relative orientations of the molecules. The adsorption energy, charge analysis, and the density of states were used to evaluate the ability of TPy to sense HCN in these different relative orientations. The adsorption energy was calculated to be -3.9 and -3.1 kcal mol(-1) for two possible relative orientations. Frontier molecular orbitals and energies indicated that some hybridization occurs during the adsorption of HCN on TPy when the molecules have appropriate relative orientations, resulting in an increase in conductivity. Considering the changes in the HOMO-LUMO energy gap that were calculated to occur during HCN adsorption, it is clear that TPy is sensitive to HCN adsorption, suggesting that TPy has the potential to act as an HCN sensor.", "paper_title": "First-principles study of terpyrrole as a potential hydrogen cyanide sensor: DFT calculations", "paper_id": "WOS:000362411800024"}