{"auto_keywords": [{"score": 0.014192306395463924, "phrase": "antimitotic_and_antiproliferative_activities"}, {"score": 0.013993446578372058, "phrase": "ridge_regression"}, {"score": 0.01346063765393457, "phrase": "topological_indices"}, {"score": 0.012279538066557955, "phrase": "qsar_models"}, {"score": 0.009024341466542678, "phrase": "generated_model"}, {"score": 0.00892884853252023, "phrase": "bcut_descriptors"}, {"score": 0.008771914034252318, "phrase": "modified_partial_equalization"}, {"score": 0.008709908481619776, "phrase": "orbital_electronegativity"}, {"score": 0.008556788875419637, "phrase": "autocorrelation_descriptors"}, {"score": 0.008496290932156838, "phrase": "information_content_descriptor"}, {"score": 0.008436217080003828, "phrase": "homo_descriptor"}, {"score": 0.004814953708764168, "phrase": "qsar"}, {"score": 0.004499910169464113, "phrase": "cell_cycle_inhibition"}, {"score": 0.004436247158342735, "phrase": "multiple_linear_regression_method"}, {"score": 0.004175533280178052, "phrase": "rr_model"}, {"score": 0.004058180509184539, "phrase": "significant_influence"}, {"score": 0.004015025120733852, "phrase": "pharmacological_responses"}, {"score": 0.0033356305227059072, "phrase": "satisfactory_results"}, {"score": 0.003265012781840765, "phrase": "model_quality"}, {"score": 0.0025073851194697397, "phrase": "highly_active_chalcone_compounds"}, {"score": 0.0024895500851796603, "phrase": "quantitative_structure-activity_relationships_modeling"}, {"score": 0.002445514186654732, "phrase": "synthesized_chalcone_derivatives"}, {"score": 0.0023513512089705303, "phrase": "multiple_linear_regression_methodologies"}, {"score": 0.002120083747913758, "phrase": "mitotic_spindle_inhibition"}, {"score": 0.0021049977753042253, "phrase": "chalcone_compounds"}], "paper_keywords": ["QSAR", " chalcone compounds", " antimitotic and antiproliferatives", " theoretical molecular descriptors", " Ridge regression", " anticancer drug design"], "paper_abstract": "The paper is an attempt for QSAR modeling based on topological, electrostatic, quantum chemical, constitutional, geometrical and physicochemical indices computed from the structures of 59 set of synthesized chalcone derivatives tested for the cell cycle inhibition of mitotic G2/M phase using multiple linear regression method. Impact of such computed structural descriptors towards antimitotic and antiproliferative activities was analysed by ridge regression (RR) studies. The RR model explained that the topological indices alone can produce significant influence upon the pharmacological responses while combination of topological, electrostatic and quantum chemical descriptors can enhance the degree of impact towards antimitotic and antiproliferative activities of these compounds. Furthermore, QSAR models were formulated utilizing only topological and the combination of topological, electrostatic and quantum chemical descriptors respectively by multiple linear regression method and the validation of the model was performed by searching the predictability of the QSAR models. Satisfactory results were obtained in terms of model quality expressed as R-2 = 0.826, Q(Loo)(2) = 0.710, R-pred(2) = 0.771 respectively for the topological indices. Combination of topological, electrostatic and quantum chemical descriptors resulted in an increase of R-2 = 0.965, Q(Loo)(2) = 0.891, R-pred(2) = 0.849. The generated model predicted that BCUT descriptors (Charge) using modified partial equalization of orbital electronegativity (MPEOE), autocorrelation descriptors, information content descriptor and HOMO descriptor are very much crucial for modeling highly active chalcone compounds. Quantitative structure-activity relationships modeling of 59 set of synthesized chalcone derivatives were tested for the inhibition of mitotic G2/M phase using ridge regression and multiple linear regression methodologies. The generated model predicted that BCUT descriptors (Charge) using modified partial equalization of orbital electronegativity (MPEOE), autocorrelation descriptors, information content descriptor and HOMO descriptor are very much crucial for producing mitotic spindle inhibition of chalcone compounds.", "paper_title": "QSAR of Chalcones Utilizing Theoretical Molecular Descriptors", "paper_id": "WOS:000365622000009"}