{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "chase_termination"}, {"score": 0.00803619649916689, "phrase": "sigma"}, {"score": 0.004774324145784758, "phrase": "cyclicity_analysis"}, {"score": 0.004294381488413906, "phrase": "well-known_stratification_criterion"}, {"score": 0.00422218060227958, "phrase": "new_criterion"}, {"score": 0.004046923261950549, "phrase": "stratification-based_criteria"}, {"score": 0.0037336520904376687, "phrase": "rewriting_algorithm"}, {"score": 0.0036864465771943933, "phrase": "original_set"}, {"score": 0.0035183910023550246, "phrase": "structural_properties"}, {"score": 0.003301461490509176, "phrase": "larger_classes"}, {"score": 0.002870006736445581, "phrase": "significant_classes"}, {"score": 0.0026363807171515255, "phrase": "equivalent_set"}, {"score": 0.0025810006125483835, "phrase": "boolean_value"}, {"score": 0.002421726275597666, "phrase": "new_rewriting_technique"}, {"score": 0.00229164285862567, "phrase": "acyclic_constraints"}, {"score": 0.0022530375696567136, "phrase": "local_stratification"}, {"score": 0.002205692205167157, "phrase": "chase_sequences"}, {"score": 0.0021593396036472777, "phrase": "length_polynomial"}, {"score": 0.0021049977753042253, "phrase": "input_database"}], "paper_keywords": ["Data exchange", " data integration", " chase algorithm", " chase termination"], "paper_abstract": "The aim of this paper is to present more general criteria and techniques for chase termination. We first present extensions of the well-known stratification criterion and introduce a new criterion, called local stratification, which generalizes both super-weak acyclicity and stratification-based criteria (including the class of constraints which are inductively restricted). Next, the paper presents a rewriting algorithm transforming the original set of constraints Sigma into an \"equivalent\" set Sigma(alpha) and verifying the structural properties for chase termination on Sigma(alpha). The rewriting of constraints allows us to recognize larger classes of constraints for which chase termination is guaranteed. In particular, we show that if Sigma satisfies chase termination conditions T, then the rewritten set Sigma(alpha) satisfies T as well, but the vice versa is not true, that is there are significant classes of constraints for which Sigma(alpha) satisfies T and Sigma does not. A more general rewriting algorithm producing as output an equivalent set of dependencies and a Boolean value stating whether a sort of cyclicity has been detected is also proposed. The new rewriting technique and the checking of acyclicity allow us to introduce the class of acyclic constraints, which generalizes local stratification and guarantees that all chase sequences are finite with a length polynomial in the size of the input database.", "paper_title": "Checking Chase Termination: Cyclicity Analysis and Rewriting Techniques", "paper_id": "WOS:000349621800003"}