{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "spatial_variability"}, {"score": 0.00886933557422839, "phrase": "carbonation_depth"}, {"score": 0.008043423650147938, "phrase": "concrete_cover"}, {"score": 0.004765482708043842, "phrase": "concrete_carbonation_depth"}, {"score": 0.004410248125081398, "phrase": "mesoscopic_structure"}, {"score": 0.0038758293658651237, "phrase": "random_aggregate_structure"}, {"score": 0.003835975983973309, "phrase": "ras"}, {"score": 0.003757480190200645, "phrase": "polygonal_particles"}, {"score": 0.0036996627006622975, "phrase": "simplified_numerical_model"}, {"score": 0.0036427316134070007, "phrase": "concrete_carbonation"}, {"score": 0.0033190180867511605, "phrase": "aggregate_properties"}, {"score": 0.0029620573986902416, "phrase": "larger_degree"}, {"score": 0.002726740692380339, "phrase": "larger_aspect_ratio"}, {"score": 0.0024586427394152196, "phrase": "proper_sample_size"}, {"score": 0.0022749744354271816, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "proper_thickness"}], "paper_keywords": ["concrete structures", " carbonation", " spatial variability", " meso-scale"], "paper_abstract": "This paper discusses the spatial variability of the carbonation depth caused by the mesoscopic structure of the concrete and the influence of the spatial variability on the thickness of the concrete cover. To conduct the research, a method to generate the random aggregate structure (RAS) based on polygonal particles and a simplified numerical model of the concrete carbonation at meso-scale are firstly developed. Based on the method and model, the effect of the aggregate properties including shape, content and gradation on the spatial variability of the carbonation depth is comprehensively studied. The results show that a larger degree of the spatial variability will be obtained by using (1) the aggregates with a larger aspect ratio; (2) a larger aggregate content; (3) the gradation which has more large particles. The proper sample size and model size used in the analysis are also studied. Finally, a case study is conducted to demonstrate the influence of the spatial variability of the carbonation depth on the proper thickness of the concrete cover. The research in this paper not only provides suggestions on how to decrease the spatial variability, but also proposes the method to consider the effect of the spatial variability in designing the thickness of the concrete cover.", "paper_title": "A 2-D numerical research on spatial variability of concrete carbonation depth at meso-scale", "paper_id": "WOS:000352211000006"}