{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "college_students"}, {"score": 0.04522885915367598, "phrase": "media_multitasking"}, {"score": 0.003971111060168551, "phrase": "increasing_levels"}, {"score": 0.0039310261964323545, "phrase": "potential_intrusiveness"}, {"score": 0.0033588449972778004, "phrase": "assessment_impacted_multitasking_behaviors"}, {"score": 0.0027554538693034163, "phrase": "aggregated_mean_duration"}, {"score": 0.0027000395818027366, "phrase": "higher_homework_task_motivation"}, {"score": 0.0024516267507109753, "phrase": "longer_duration_multitasking_behaviors"}, {"score": 0.00217017119491777, "phrase": "solitary_studying"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Media in education", " Post-secondary education", " Learning strategies"], "paper_abstract": "We investigated the frequency and duration of distractions and media multitasking among college students engaged in a 3-h solitary study/homework session. Participant distractions were assessed with three different kinds of apparatus with increasing levels of potential intrusiveness: remote surveillance cameras, a head-mounted point-of-view video camera, and a mobile eyetracker. No evidence was obtained to indicate that method of assessment impacted multitasking behaviors. On average, students spent 73 min of the session listening to music while studying. In addition, students engaged with an average of 35 distractions of 6 s or longer over the course of 3 h, with an aggregated mean duration of 25 min. Higher homework task motivation and self-efficacy to concentrate on homework were associated with less frequent and shorter duration multitasking behaviors, while greater negative affect was linked to longer duration multitasking behaviors during the session. We discuss the implications of these data for assessment and for understanding the nature of distractions and media multitasking during solitary studying. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "What else do college students \"do\" while studying? An investigation of multitasking", "paper_id": "WOS:000335618000002"}