{"auto_keywords": [{"score": 0.043486858340036, "phrase": "dimensionality_reduction"}, {"score": 0.00481495049065317, "phrase": "interactive_dimensionality_reduction_through_user"}, {"score": 0.00478968045369969, "phrase": "-defined_combinations_of_quality_metrics"}, {"score": 0.0047395356621991935, "phrase": "multivariate_data_sets"}, {"score": 0.004243552607799184, "phrase": "common_approach"}, {"score": 0.003529149828147388, "phrase": "high_significance"}, {"score": 0.0030449789178940787, "phrase": "user-defined_quality_metrics"}, {"score": 0.002828331235643921, "phrase": "effective_visualization"}, {"score": 0.002740253546178098, "phrase": "large_multivariate_data_sets"}, {"score": 0.0026689487424251907, "phrase": "diverse_structures"}, {"score": 0.0025858215477025117, "phrase": "automatic_variable_orderings"}, {"score": 0.0025052769325080255, "phrase": "quality-guided_reduction"}, {"score": 0.002440071551819324, "phrase": "interactive_display"}, {"score": 0.0021049977753042253, "phrase": "case_scenario"}], "paper_keywords": ["Dimensionality reduction", " interactivity", " quality metrics", " variable ordering"], "paper_abstract": "Multivariate data sets including hundreds of variables are increasingly common in many application areas. Most multivariate visualization techniques are unable to display such data effectively, and a common approach is to employ dimensionality reduction prior to visualization. Most existing dimensionality reduction systems focus on preserving on,e or a few significant structures in data. For many analysis tasks, however, several types of structures can be of high significance and the importance of a certain structure compared to the importance of another is often task-dependent. This paper introduces a system for dimensionality reduction by combining user-defined quality metrics using weight functions to preserve as many important structures as possible. The system aims at effective visualization and exploration of structures within large multivariate data sets and provides enhancement of diverse structures by supplying a range of automatic variable orderings. Furthermore it enables a quality-guided reduction of variables through an interactive display facilitating investigation of trade-offs between loss of structure and the number of variables to keep. The generality and interactivity of the system is demonstrated through a case scenario.", "paper_title": "Interactive Dimensionality Reduction Through User-defined Combinations of Quality Metrics", "paper_id": "WOS:000270778900020"}