{"auto_keywords": [{"score": 0.049568154654955725, "phrase": "multineuronal_spike_trains"}, {"score": 0.00481495049065317, "phrase": "sequential_patterns"}, {"score": 0.004563427013973105, "phrase": "statistically_significant_sequential_patterns"}, {"score": 0.0043482604833437735, "phrase": "ordered_sequences"}, {"score": 0.004255902303152008, "phrase": "different_neurons"}, {"score": 0.004210458358142504, "phrase": "specific_delays"}, {"score": 0.004011867299107537, "phrase": "data-mining_scheme"}, {"score": 0.0035648266669315943, "phrase": "statistical_significance"}, {"score": 0.003167441161387607, "phrase": "independent_neurons"}, {"score": 0.003050508020268648, "phrase": "weak_dependencies"}, {"score": 0.0027102997281261733, "phrase": "upper_bound"}, {"score": 0.0025962029048520324, "phrase": "probabilistic_model"}, {"score": 0.0025409639091476363, "phrase": "counting_process"}, {"score": 0.002209406458446019, "phrase": "different_significant_patterns"}, {"score": 0.0021049977753042253, "phrase": "spike_trains"}], "paper_keywords": [""], "paper_abstract": "We consider the problem of detecting statistically significant sequential patterns in multineuronal spike trains. These patterns are characterized by ordered sequences of spikes from different neurons with specific delays between spikes. We have previously proposed a data-mining scheme to efficiently discover such patterns, which occur often enough in the data. Here we propose a method to determine the statistical significance of such repeating patterns. The novelty of our approach is that we use a compound null hypothesis that not only includes models of independent neurons but also models where neurons have weak dependencies. The strength of interaction among the neurons is represented in terms of certain pair-wise conditional probabilities. We specify our null hypothesis by putting an upper bound on all such conditional probabilities. We construct a probabilistic model that captures the counting process and use this to derive a test of significance for rejecting such a compound null hypothesis. The structure of our null hypothesis also allows us to rank-order different significant patterns. We illustrate the effectiveness of our approach using spike trains generated with a simulator.", "paper_title": "Conditional Probability-Based Significance Tests for Sequential Patterns in Multineuronal Spike Trains", "paper_id": "WOS:000275367000007"}