{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multimedia_data"}, {"score": 0.009438071446547815, "phrase": "emotional_tags"}, {"score": 0.009154924082634816, "phrase": "bayesian_network"}, {"score": 0.00461302961851157, "phrase": "digital_multimedia"}, {"score": 0.004446677711302801, "phrase": "human_emotions"}, {"score": 0.004208282550386197, "phrase": "single_emotion"}, {"score": 0.00405646687267772, "phrase": "multi-emotion_coexistence"}, {"score": 0.0038154673253945003, "phrase": "novel_multi-emotion_tagging_approach"}, {"score": 0.0031747618267940155, "phrase": "binary_relevance"}, {"score": 0.0031360786664165093, "phrase": "nearest_neighbours"}, {"score": 0.003097865379563127, "phrase": "multi-label_k_nearest_neighbours"}, {"score": 0.002469032978674379, "phrase": "data's_multi-emotion_tags"}, {"score": 0.0023507916951658455, "phrase": "traditional_methods"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["Multiple emotional tagging", " Multimedia", " Bayesian network", " Multi-label classification"], "paper_abstract": "Digital multimedia may elicit a mixture of human emotions. Most current emotional tagging research typically tags the multimedia data with a single emotion, ignoring the phenomenon of multi-emotion coexistence. To address this problem, we propose a novel multi-emotion tagging approach by explicitly modeling the dependencies among emotions. First, several audio or visual features are extracted from the multimedia data. Second, four traditional multi-label learning methods: Binary Relevance, Random k label sets, Binary Relevance k Nearest Neighbours and Multi-Label k Nearest Neighbours, are used as the classifiers to obtain the measurements of emotional tags. Then, a Bayesian network is automatically constructed to capture the relationships among emotional tags. Finally, the Bayesian network is used to infer the data's multi-emotion tags by combining the measurements obtained from those traditional methods with the dependencies among emotions. Experiments on two multi-label media data sets demonstrate the superiority of our approach to the existing methods.", "paper_title": "Multiple emotional tagging of multimedia data by exploiting dependencies among emotions", "paper_id": "WOS:000351394500008"}