{"auto_keywords": [{"score": 0.03443543979511926, "phrase": "optimality_ratio"}, {"score": 0.027833894182954382, "phrase": "complex_search_queries"}, {"score": 0.014425786129844465, "phrase": "ranked_list"}, {"score": 0.013796765819780362, "phrase": "join_result"}, {"score": 0.008654188363927636, "phrase": "new_semantics"}, {"score": 0.00481495049065317, "phrase": "joined_search_results"}, {"score": 0.004768739216860887, "phrase": "complex_search_tasks"}, {"score": 0.0040866404150657005, "phrase": "frequently_the_entire_join"}, {"score": 0.0038941106036522216, "phrase": "small_subset"}, {"score": 0.0035815545681927665, "phrase": "result_sets"}, {"score": 0.002905252212547442, "phrase": "complex_search"}, {"score": 0.0026891227034884536, "phrase": "measures_coverage"}, {"score": 0.002578826749477773, "phrase": "high_coverage"}, {"score": 0.002562263358004784, "phrase": "high_optimality_ratio"}, {"score": 0.0024571577953004546, "phrase": "novel_semantics"}, {"score": 0.0022816284181888646, "phrase": "experimental_study"}, {"score": 0.002259686487838334, "phrase": "yahoo"}, {"score": 0.0022451572368358476, "phrase": "local_search_web_services"}, {"score": 0.0021049977753042253, "phrase": "proposed_semantics"}], "paper_keywords": ["Data integration", " Search", " Top-k", " Join", " Diversity"], "paper_abstract": "In complex search tasks, it is often required to pose several basic search queries, join the answers to these queries, where each answer is given as a ranked list of items, and return a ranked list of combinations. However, the join result may include too many repetitions of items, and hence, frequently the entire join is too large to be useful. This can be solved by choosing a small subset of the join result. The focus of this paper is on how to choose this subset. We propose two measures for estimating the quality of result sets, namely, coverage and optimality ratio. Intuitively, maximizing the coverage aims at including in the result as many as possible appearances of items in their optimal combination, and maximizing the optimality ratio means striving to have each item appearing only in its optimal combination, i.e., only in the most highly ranked combination that contains it. One of the difficulties, when choosing the subset of the join in a complex search, is that there is a conflict between maximizing the coverage and maximizing the optimality ratio. In this paper, we introduce the measures coverage and optimality ratio. We present new semantics for complex search queries, aiming at providing high coverage and high optimality ratio. We examine the quality of the results of existing and the novel semantics, according to these two measures, and we provide algorithms for answering complex search queries under the new semantics. Finally, we present an experimental study, using Yahoo! Local Search Web Services, of the efficiency and the scalability of our algorithms, showing that complex search queries can be evaluated effectively under the proposed semantics.", "paper_title": "On optimality-ratio and coverage in ranking of joined search results", "paper_id": "WOS:000305520200003"}