{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cad-integrated_analysis"}, {"score": 0.0047026237903774895, "phrase": "high_aspect_ratio_structural_members"}, {"score": 0.004129873531628877, "phrase": "computer_simulations"}, {"score": 0.004033483220049885, "phrase": "fea"}, {"score": 0.003541923233726252, "phrase": "thin_structures"}, {"score": 0.0034388111429203222, "phrase": "common_strategy"}, {"score": 0.0029489527539649737, "phrase": "alternate_\"algebraic_reduction\"_method"}, {"score": 0.002620040660435039, "phrase": "dual-representation_framework"}, {"score": 0.002286781334850213, "phrase": "proposed_method"}, {"score": 0.002181069180139225, "phrase": "numerical_experiments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Beams", " Finite element analysis", " CAD-integrated analysis", " Dimensional reduction"], "paper_abstract": "Beams are high aspect ratio structural members that are used extensively in civil, automotive, aerospace, and MEMS applications. In all such applications, one must typically analyze and optimize the beams through computer simulations. Standard 3D finite element analysis (FEA) of beams can be used in such simulations: it is however prone to errors, and is computationally expensive for thin structures. Therefore, a common strategy is to carry out a dimensionally reduced 1D beam analysis. Unfortunately, 1D beam analysis is hard to automate and integrate with 3D CAD. In this paper, we propose an alternate \"algebraic reduction\" method that combines the generality of 3D FEA, and the computational efficiency of 1D beam analysis. This is achieved via a dual-representation framework where the geometry of the beam is captured via a 3D finite element mesh, while the physics is captured via a 1D beam model. The proposed method is formally established, and supported through numerical experiments. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Algebraic reduction of beams for CAD-integrated analysis", "paper_id": "WOS:000280508100006"}