{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "coordination-oriented_functionalities"}, {"score": 0.004568871736067739, "phrase": "woad"}, {"score": 0.004140726362519362, "phrase": "major_teaching_hospital"}, {"score": 0.004007083686875716, "phrase": "woad_framework"}, {"score": 0.003631390978147703, "phrase": "lwoad"}, {"score": 0.0034911335714333507, "phrase": "electronic_document_system"}, {"score": 0.003269266730193333, "phrase": "event-based_mechanisms"}, {"score": 0.0032054891061528896, "phrase": "coordinative_requirements"}, {"score": 0.00308163068747474, "phrase": "relevant_conditions"}, {"score": 0.002416589459425828, "phrase": "coordination-oriented_and_context-aware_functionalities"}, {"score": 0.0022480304016499605, "phrase": "lwoad_mechanisms"}, {"score": 0.0021896891011033105, "phrase": "case_study"}, {"score": 0.0021049977753042253, "phrase": "eud_perspective"}], "paper_keywords": ["Business Rules", " Computer Architecture", " Digital Document", " Requirements Definition", " User Requirements"], "paper_abstract": "In this article, we present WOAD, a framework that was inspired and partly validated within a 2-year observational case study at a major teaching hospital. We present the WOAD framework by stating its main and motivating rationales, outlining its high-level architecture and then introducing its denotational language, LWOAD. We propose LWOAD to support users of an electronic document system in declaratively expressing, specifying and implementing content- and event-based mechanisms that fulfill coordinative requirements and make users aware of relevant conditions. Our focus addresses (a) the user-friendly and yet formal expression of local coordinative practices based on the work context; (b) the promotion of awareness of both these conventions and the context to enable actors to quickly respond; (c) the full deployment of coordination-oriented and context-aware functionalities into legacy electronic document systems. We give examples of LWOAD mechanisms taken from the case study and discuss their impact from the EUD perspective.", "paper_title": "WOAD: A Framework to Enable the End-User Development of Coordination-Oriented Functionalities", "paper_id": "WOS:000288139900001"}