{"auto_keywords": [{"score": 0.031217122597097954, "phrase": "finite_sensor_networks"}, {"score": 0.00481495049065317, "phrase": "finite_wireless_sensor_networks"}, {"score": 0.004458722048888919, "phrase": "wireless_networks"}, {"score": 0.0037683358267785435, "phrase": "small_or_moderate_values"}, {"score": 0.003262035294895737, "phrase": "poor_approximations"}, {"score": 0.0030642636185693054, "phrase": "large-scale_analysis"}, {"score": 0.002716915166374506, "phrase": "random_node_deployment"}, {"score": 0.00266510562382701, "phrase": "easily_computable_expressions"}, {"score": 0.0024088451312725924, "phrase": "derived_analytic_expressions"}, {"score": 0.0022626835039082746, "phrase": "small-scale_networks"}, {"score": 0.002125371638869951, "phrase": "new_framework"}], "paper_keywords": ["Theory", " Design", " Wireless sensor networks", " finite networks", " unreliable grids", " random geometric graphs", " connectivity", " coverage", " data communications"], "paper_abstract": "Many analytic results for the connectivity, coverage, and capacity of wireless networks have been reported for the case where the number of nodes, n, tends to infinity (large-scale networks). The majority of these results have not been extended for small or moderate values of n; whereas in many practical networks, n is not very large. In this article, we consider finite (small-scale) wireless sensor networks. We first show that previous asymptotic results provide poor approximations for such networks. We provide a set of differences between small-scale and large-scale analysis and propose a methodology for analysis of finite sensor networks. Furthermore, we consider two models for such networks: unreliable sensor grids and sensor networks with random node deployment. We provide easily computable expressions for bounds on the coverage and connectivity of these networks. With validation from simulations, we show that the derived analytic expressions give very good estimates of such quantities for finite sensor networks. Our investigation confirms the fact that small-scale networks possess unique characteristics different from their large-scale counterparts, necessitating the development of a new framework for their analysis and design.", "paper_title": "Results on Finite Wireless Sensor Networks: Connectivity and Coverage", "paper_id": "WOS:000322740200015"}