{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "weighted_graphs"}, {"score": 0.004762550320451225, "phrase": "purpose_-_medians"}, {"score": 0.004533685795068016, "phrase": "optimal_locations"}, {"score": 0.004484332781147261, "phrase": "facility_centers"}, {"score": 0.004339459955098738, "phrase": "domain_decomposition"}, {"score": 0.004292212137716459, "phrase": "parallel_computation"}, {"score": 0.003485824905231454, "phrase": "weighted_graph"}, {"score": 0.003429001377800258, "phrase": "facility_location_problem"}, {"score": 0.0027843339377323878, "phrase": "graph_nodes"}, {"score": 0.0026357877401570764, "phrase": "local_search"}, {"score": 0.002522662955545598, "phrase": "location_finding"}, {"score": 0.0024679299547216956, "phrase": "novel_application"}, {"score": 0.0024276590297034064, "phrase": "ant_colony_system"}, {"score": 0.002349073225500705, "phrase": "main_contribution"}, {"score": 0.0021049977753042253, "phrase": "efficient_and_accurate_method"}], "paper_keywords": ["optimization techniques", " programming and algorithm theory"], "paper_abstract": "Purpose - Medians of a graph have many applications in engineering. Optimal locations for facility centers, distribution of centers and domain decomposition for parallel computation are a few examples of such applications. In this paper, a new ant system (AS) algorithm based on the idea of using two sets of ants, named active and passive ants is proposed for the problem of finding k-medians of a weighted graph or the facility location problem on a network. Design/methodology/approach - The structure of the algorithm is derived from two known heuristics; namely, rank-based AS and max-min ant system with some adjustments in pheromone updating and locating the ants on the graph nodes. The algorithms are designed with and without a local search. Findings - An efficient algorithm for location finding, and the novel application of an ant colony system can be considered as the main contribution of this paper. Originality/value - Combining two different tools; namely, graph theory and AS algorithm results in an efficient and accurate method for location finding. The results are compared to those of another algorithm based on the theory of graphs.", "paper_title": "Ant colony optimization for finding medians of weighted graphs", "paper_id": "WOS:000254562300006"}