{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fault_localization"}, {"score": 0.006844147506136511, "phrase": "tarantula"}, {"score": 0.004771435352180973, "phrase": "automated_program_debugging"}, {"score": 0.003996983218174335, "phrase": "potential_fixes"}, {"score": 0.003942877273973905, "phrase": "faulty_program"}, {"score": 0.0038895008852940323, "phrase": "proposed_strategy"}, {"score": 0.0037336520904376687, "phrase": "multiple_faulty_versions"}, {"score": 0.003535489842686145, "phrase": "selected_mutant_operators"}, {"score": 0.0032135959043774085, "phrase": "overall_fault-fixing_process"}, {"score": 0.003070753102640473, "phrase": "ochiai"}, {"score": 0.002525248554951453, "phrase": "mutant_examination_process"}, {"score": 0.002468450551616404, "phrase": "significant_fraction"}, {"score": 0.0023586493263143553, "phrase": "small_percentage"}, {"score": 0.002326669201839705, "phrase": "program_code"}, {"score": 0.0022537212268979507, "phrase": "relative_fault-fixing_capabilities"}, {"score": 0.0021632743048552536, "phrase": "future_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Program debugging", " Mutation", " Fault localization", " Fault-fixing", " Software testing"], "paper_abstract": "This paper proposes a strategy for automatically fixing faults in a program by combining the ideas of mutation and fault localization. Statements ranked in order of their likelihood of containing faults are mutated in the same order to produce potential fixes for the faulty program. The proposed strategy is evaluated using 8 mutant operators against 19 programs each with multiple faulty versions. Our results indicate that 20.70% of the faults are fixed using selected mutant operators, suggesting that the strategy holds merit for automatically fixing faults. The impact of fault localization on efficiency of the overall fault-fixing process is investigated by experimenting with two different techniques, Tarantula and Ochiai, the latter of which has been reported to be better at fault localization than Tarantula, and also proves to be better in the context of fault-fixing using our proposed strategy. Further experiments are also presented to evaluate stopping criteria with respect to the mutant examination process and reveal that a significant fraction of the (fixable) faults can be fixed by examining a small percentage of the program code. We also report on the relative fault-fixing capabilities of mutant operators used and present discussions on future work. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Combining mutation and fault localization for automated program debugging", "paper_id": "WOS:000333490400005"}