{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bovine_weight_trajectories"}, {"score": 0.0047784273577245505, "phrase": "support_vector_machine_classification"}, {"score": 0.004688321299229397, "phrase": "livestock_breeders"}, {"score": 0.0040720661634333424, "phrase": "geometrical_relationships"}, {"score": 0.003673930454794753, "phrase": "parallel_functions"}, {"score": 0.002956272941199248, "phrase": "constant_values"}, {"score": 0.0028893844749296863, "phrase": "key_point"}, {"score": 0.0027495914857929584, "phrase": "ordering_constraints"}, {"score": 0.002687366778212309, "phrase": "preference_functions"}, {"score": 0.00266693888510356, "phrase": "ordinal_regressors"}, {"score": 0.002387560868354908, "phrase": "real_world_data_sets"}, {"score": 0.002351389889948836, "phrase": "different_breeds"}, {"score": 0.0022547140008848912, "phrase": "separate_regression"}, {"score": 0.0021537671245615286, "phrase": "medium_or_long_term_predictions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Support Vector Machines (SVM)", " Weight prediction", " Growth curves", " Beef cattle"], "paper_abstract": "The benefits of livestock breeders are usually closely related to the weight of their animals. In this paper we present a method to anticipate the weight of each animal provided we know the past evolution of the herd. Our approach exploits the geometrical relationships of the trajectories of weights along the time. Starting from a collection of data from a set of animals, we learn a family of parallel functions that fits the whole data set, instead of having one regression function for each individual. In this way, our method enables animals with only one or a few weights to have an accurate estimation of their future evolution. Thus, we learn a function F defined on the space of weights and time that separates the trajectories in such a way that F has constant values on each trajectory. The key point is that the specification of F can be done in terms of ordering constraints, in the same way as preference functions or ordinal regressors. Therefore, F can be obtained from a classification SVM (Support Vector Machines). To evaluate the method, we have used a collection of real world data sets of bovines of different breeds and ages. We will show that our method outperforms the separate regression of each animal when there are only a few weights available and we need medium or long term predictions. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Improved estimation of bovine weight trajectories using Support Vector Machine Classification", "paper_id": "WOS:000349881000005"}