{"auto_keywords": [{"score": 0.04196603091947218, "phrase": "information_retrieval_tasks"}, {"score": 0.036420426151982134, "phrase": "vcm_interface"}, {"score": 0.00839445486110216, "phrase": "vcm"}, {"score": 0.00675098394823005, "phrase": "relevant_resource"}, {"score": 0.0064585271925830965, "phrase": "sus"}, {"score": 0.00481495049065317, "phrase": "iconic_user_interface"}, {"score": 0.004765889452740394, "phrase": "information_retrieval"}, {"score": 0.004733458808453602, "phrase": "medical_guidelines"}, {"score": 0.004558977045730675, "phrase": "semantic_search_engine"}, {"score": 0.004229036241628801, "phrase": "french"}, {"score": 0.0040591367766929344, "phrase": "iconic_language"}, {"score": 0.003701401653850141, "phrase": "search_engine"}, {"score": 0.003626272370749206, "phrase": "methods_focus_groups"}, {"score": 0.003375087185182269, "phrase": "ergonomic_evaluation_approach"}, {"score": 0.00325051332556486, "phrase": "non-vcm_one"}, {"score": 0.002984173420996039, "phrase": "usability_analysis"}, {"score": 0.002730240935688002, "phrase": "focus_group_recommendations"}, {"score": 0.002702363975375762, "phrase": "ergonomic_issues"}, {"score": 0.002447101794397243, "phrase": "significantly_more_time"}, {"score": 0.0022774088820755366, "phrase": "average_score"}, {"score": 0.002246443296542436, "phrase": "conclusions_vcm"}, {"score": 0.002208429521986227, "phrase": "dc"}, {"score": 0.002148677187261496, "phrase": "success_rate"}, {"score": 0.0021049977753042253, "phrase": "slightly_more_time"}], "paper_keywords": [""], "paper_abstract": "Background and objective Doc'CISMeF (DC) is a semantic search engine used to find resources in CISMeF-BP, a quality controlled health gateway, which gathers guidelines available on the internet in French. Visualization of Concepts in Medicine (VCM) is an iconic language that may ease information retrieval tasks. This study aimed to describe the creation and evaluation of an interface integrating VCM in DC in order to make this search engine much easier to use. Methods Focus groups were organized to suggest ways to enhance information retrieval tasks using VCM in DC. A VCM interface was created and improved using the ergonomic evaluation approach. 20 physicians were recruited to compare the VCM interface with the non-VCM one. Each evaluator answered two different clinical scenarios in each interface. The ability and time taken to select a relevant resource were recorded and compared. A usability analysis was performed using the System Usability Scale (SUS). Results The VCM interface contains a filter based on icons, and icons describing each resource according to focus group recommendations. Some ergonomic issues were resolved before evaluation. Use of VCM significantly increased the success of information retrieval tasks (OR=11; 95% CI 1.4 to 507). Nonetheless, it took significantly more time to find a relevant resource with VCM interface (101 vs 65 s; p=0.02). SUS revealed ` good' usability with an average score of 74/100. Conclusions VCM was successfully implemented in DC as an option. It increased the success rate of information retrieval tasks, despite requiring slightly more time, and was well accepted by end-users.", "paper_title": "Design and usability study of an iconic user interface to ease information retrieval of medical guidelines", "paper_id": "WOS:000341858100014"}