{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "create_share"}, {"score": 0.004719664411221952, "phrase": "new_digital_tool"}, {"score": 0.004688321299229397, "phrase": "interactive_reading"}, {"score": 0.004580243025274209, "phrase": "digital_format"}, {"score": 0.004400705158735729, "phrase": "print_format"}, {"score": 0.004356926418550194, "phrase": "digital_functionality"}, {"score": 0.004048860957751714, "phrase": "paradigm_shift"}, {"score": 0.003995226376780718, "phrase": "digital_fanfiction"}, {"score": 0.003725042075410585, "phrase": "reading_and_writing_skills"}, {"score": 0.003359119985242403, "phrase": "digital_tools"}, {"score": 0.0032815823097599316, "phrase": "literary_interactivity"}, {"score": 0.002842920225545139, "phrase": "tablet-based_tool"}, {"score": 0.0028145947051539354, "phrase": "third_graders'_incipient_literacy"}, {"score": 0.002777264648691937, "phrase": "reading-to-writing_model"}, {"score": 0.0027404283412788997, "phrase": "multimodal_co-construction"}, {"score": 0.002686085475479125, "phrase": "gaming_mechanism"}, {"score": 0.0026504553106526016, "phrase": "users'_engagement"}, {"score": 0.0025978919678702793, "phrase": "design-based_approach"}, {"score": 0.002421975107313603, "phrase": "gaming_mechanisms"}, {"score": 0.002381872778203302, "phrase": "narrative_construction"}, {"score": 0.0023502683992739845, "phrase": "multimodal_narrative_construction"}, {"score": 0.002213147136067999, "phrase": "elementary_schoolers'_reading"}, {"score": 0.0021476098263617954, "phrase": "fictional_storytelling"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-mediated communication", " Elementary education", " Interactive learning environments"], "paper_abstract": "Most books available in digital format today are very similar in structure to books that exist in print format because the digital functionality they offer is very similar to the features of interactive, multi-modal print books that have existed for over a century. The one digital model that represents a paradigm shift is that of digital fanfiction, in which readers create \"spinoffs\" of their favorite books with different media online. Given the need for improvement in reading and writing skills among elementary schoolers, and the research supporting the objective of strengthening the link between reading and writing, the aim of this study is to propose and examine how digital tools may build on the concept of literary interactivity, in particular that of fanfiction, to provide a canvas for co-construction, so that readers may be more directly engaged with the texts they read and, as such, the narratives they build. To this end, we built a tablet-based tool for supporting third graders' incipient literacy learning through a reading-to-writing model that facilitated the multimodal co-construction of a narrative via a gaming mechanism, and maintained users' engagement during a 45-min activity. A design-based approach was used to test and hone the tool in two independent studies, involving a total of 237 third-graders. We learned that gaming mechanisms show promise for supporting narrative construction and for fostering multimodal narrative construction. In a more general sense we learned that interactive, co-constructive tools in a technological format can serve as bridges between elementary schoolers' reading and writing. Our tool in particular additionally fostered fictional storytelling. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Read Create Share (RCS): A new digital tool for interactive reading and writing", "paper_id": "WOS:000349723200039"}