{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "hybrid_grasp_heuristic"}, {"score": 0.004756233569671719, "phrase": "effective_drawings"}, {"score": 0.004717485406306594, "phrase": "proportional_symbol_maps"}, {"score": 0.00467905143301368, "phrase": "proportional_symbol_map"}, {"score": 0.004621984064678252, "phrase": "cartographic_tool"}, {"score": 0.0044549056501745074, "phrase": "specific_locations"}, {"score": 0.004138575034269399, "phrase": "numerical_data"}, {"score": 0.003908091457759849, "phrase": "opaque_disks"}, {"score": 0.003400198866111204, "phrase": "visual_quality"}, {"score": 0.002827740707723551, "phrase": "max-total_problem"}, {"score": 0.0027477745788313163, "phrase": "total_visible_boundary"}, {"score": 0.002659142621852998, "phrase": "sophisticated_heuristic"}, {"score": 0.0025628355581338563, "phrase": "advanced_techniques"}, {"score": 0.002370794661629904, "phrase": "optimal_solutions"}, {"score": 0.0023418133729330303, "phrase": "high_quality"}, {"score": 0.002220257443705344, "phrase": "first_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Metaheuristics", " GRASP", " Cartography", " Proportional symbol maps", " Computational geometry"], "paper_abstract": "Proportional symbol map is a cartographic tool that employs symbols to represent data associated with specific locations. Each symbol is drawn at the location of an event and its size is proportional to the numerical data collected at that point on the map. The symbols considered here are opaque disks. When two or more disks overlap, part of their boundaries may not be visible and it might be difficult to gauge their size. Therefore, the order in which the disks are drawn affects the visual quality of a map. In this work, we focus on stacking drawings, i.e., a drawing that corresponds to the disks being stacked up, in sequence, starting from the one at the bottom of the stack. We address the Max-Total problem, which consists in maximizing the total visible boundary of all disks. We propose a sophisticated heuristic based on GRASP that includes most of the advanced techniques described in the literature for this procedure. We tested both sequential and parallel implementations on benchmark instances and the comparison against optimal solutions confirms the high quality of our heuristic. To the best of our knowledge, this is the first time a metaheuristic is applied to this problem. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A hybrid GRASP heuristic to construct effective drawings of proportional symbol maps", "paper_id": "WOS:000317165200026"}