{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "pedigree_information"}, {"score": 0.014008025817823285, "phrase": "low_coverage_regions"}, {"score": 0.009480712794441194, "phrase": "heterozygous_positions"}, {"score": 0.009276863464987158, "phrase": "homozygous_positions"}, {"score": 0.004575740812937594, "phrase": "genome-wide_sequencing_data"}, {"score": 0.004460609967916904, "phrase": "disease-causing_mutations"}, {"score": 0.004396120480895021, "phrase": "disease_mechanisms"}, {"score": 0.0041473140210277724, "phrase": "mapping_errors"}, {"score": 0.00407247625105503, "phrase": "calling_approaches"}, {"score": 0.003998983496539902, "phrase": "low_coverage_data"}, {"score": 0.003870009704443373, "phrase": "new_variant"}, {"score": 0.0033942533792009687, "phrase": "phase_informative_reads"}, {"score": 0.003284718806701356, "phrase": "low_evidence"}, {"score": 0.0030873424635143045, "phrase": "synergistic_way"}, {"score": 0.0026105697442146357, "phrase": "latent_variables"}, {"score": 0.0024715695446993107, "phrase": "performance_evaluation"}, {"score": 0.002444668348634501, "phrase": "parent-offspring_trio_sequencing_data"}, {"score": 0.0024004805502253427, "phrase": "existing_approaches"}, {"score": 0.002339953069296797, "phrase": "single_nucleotide_polymorphism_array"}, {"score": 0.002289285767792039, "phrase": "performance_analysis_considering_distance"}, {"score": 0.0021049977753042253, "phrase": "longer_sequencing_data"}], "paper_keywords": [""], "paper_abstract": "Motivation: Variant calling from genome-wide sequencing data is essential for the analysis of disease-causing mutations and elucidation of disease mechanisms. However, variant calling in low coverage regions is difficult due to sequence read errors and mapping errors. Hence, variant calling approaches that are robust to low coverage data are demanded. Results: We propose a new variant calling approach that considers pedigree information and haplotyping based on sequence reads spanning two or more heterozygous positions termed phase informative reads. In our approach, genotyping and haplotyping by the assignment of each read to a haplotype based on phase informative reads are simultaneously performed. Therefore, positions with low evidence for heterozygosity are rescued by phase informative reads, and such rescued positions contribute to haplotyping in a synergistic way. In addition, pedigree information supports more accurate haplotyping as well as genotyping, especially in low coverage regions. Although heterozygous positions are useful for haplotyping, homozygous positions are not informative and weaken the information from heterozygous positions, as majority of positions are homozygous. Thus, we introduce latent variables that determine zygosity at each position to filter out homozygous positions for haplotyping. In performance evaluation with a parent-offspring trio sequencing data, our approach outperforms existing approaches in accuracy on the agreement with single nucleotide polymorphism array genotyping results. Also, performance analysis considering distance between variants showed that the use of phase informative reads is effective for accurate variant calling, and further performance improvement is expected with longer sequencing data.", "paper_title": "A statistical variant calling approach from pedigree information and local haplotyping with phase informative reads", "paper_id": "WOS:000326643600004"}