{"auto_keywords": [{"score": 0.04639215358795362, "phrase": "mobile_devices"}, {"score": 0.03104244392514206, "phrase": "message-signature_pair"}, {"score": 0.027400749744357324, "phrase": "server-aided_verification_signatures"}, {"score": 0.00481495049065317, "phrase": "mobile_computing"}, {"score": 0.004663396040465122, "phrase": "wireless_technology"}, {"score": 0.00439777299939725, "phrase": "wireless_connection"}, {"score": 0.004147216579100177, "phrase": "resource-poor_relative"}, {"score": 0.003952828685048176, "phrase": "absolute_ability"}, {"score": 0.003767517649628532, "phrase": "expensive_computational_tasks"}, {"score": 0.003687960013746783, "phrase": "constrained_computational_resources"}, {"score": 0.0035527409334589317, "phrase": "server-aided_computing"}, {"score": 0.003422462630994095, "phrase": "power-constrained_mobile_devices"}, {"score": 0.00335016692413066, "phrase": "expensive_computation"}, {"score": 0.003261934055562238, "phrase": "powerful_resources"}, {"score": 0.0030923570058383355, "phrase": "existing_server-aided_verification_signature_schemes"}, {"score": 0.002720376476146181, "phrase": "secret_information"}, {"score": 0.002256435842862802, "phrase": "collusion_attacks"}, {"score": 0.0021276181317652163, "phrase": "existing_signatures"}], "paper_keywords": [""], "paper_abstract": "With the development of wireless technology, much data communication and processing has been conducted in mobile devices with wireless connection. As we know that the mobile devices will always be resource-poor relative to static ones though they will improve in absolute ability, therefore, they cannot process some expensive computational tasks due to the constrained computational resources. According to this problem, server-aided computing has been studied in which the power-constrained mobile devices can outsource some expensive computation to a server with powerful resources in order to reduce their computational load. However, in existing server-aided verification signature schemes, the server can learn some information about the message-signature pair to be verified, which is undesirable especially when the message includes some secret information. In this paper, we mainly study the server-aided verification signatures with privacy in which the message-signature pair to be verified can be protected from the server. Two definitions of privacy for server-aided verification signatures are presented under collusion attacks between the server and the signer. Then based on existing signatures, two concrete server-aided verification signature schemes with privacy are proposed which are both proved secure.", "paper_title": "Server-Aided Verification Signature with Privacy for Mobile Computing", "paper_id": "WOS:000351601400001"}