{"auto_keywords": [{"score": 0.04695826760907647, "phrase": "candidate_genes"}, {"score": 0.010416990126534126, "phrase": "information_flow"}, {"score": 0.010301465129513177, "phrase": "phenome-interactome_network"}, {"score": 0.005285531365888058, "phrase": "driver_genes"}, {"score": 0.0048149533511924365, "phrase": "uncover"}, {"score": 0.00453537012358554, "phrase": "human_inherited_diseases"}, {"score": 0.004468037801239238, "phrase": "susceptibility_genetic_regions"}, {"score": 0.004418192459607072, "phrase": "primary_step"}, {"score": 0.004130535674260505, "phrase": "phenotype_similarities"}, {"score": 0.0040997480534580065, "phrase": "protein-protein_interactions"}, {"score": 0.004053994613859937, "phrase": "combinatorial_approaches"}, {"score": 0.003861534816807933, "phrase": "first_combinatorial_approach"}, {"score": 0.00342568771304873, "phrase": "computational_method"}, {"score": 0.0034001358540125303, "phrase": "maxif"}, {"score": 0.0030502854924662837, "phrase": "cross-validation_experiments"}, {"score": 0.00286213454317036, "phrase": "query_gene"}, {"score": 0.0027776422068966867, "phrase": "competitive_performance"}, {"score": 0.0024546155360991567, "phrase": "example_application"}, {"score": 0.00216907363015155, "phrase": "new_biological_insights"}, {"score": 0.0021208374456760447, "phrase": "modular_property"}, {"score": 0.0021049977753042253, "phrase": "transcriptional_regulation"}], "paper_keywords": [""], "paper_abstract": "Motivation: Pinpointing genes that underlie human inherited diseases among candidate genes in susceptibility genetic regions is the primary step towards the understanding of pathogenesis of diseases. Although several probabilistic models have been proposed to prioritize candidate genes using phenotype similarities and protein-protein interactions, no combinatorial approaches have been proposed in the literature. Results: We propose the first combinatorial approach for prioritizing candidate genes. We first construct a phenome-interactome network by integrating the given phenotype similarity profile, protein-protein interaction network and associations between diseases and genes. Then, we introduce a computational method called MAXIF to maximize the information flow in this network for uncovering genes that underlie diseases. We demonstrate the effectiveness of this method in prioritizing candidate genes through a series of cross-validation experiments, and we show the possibility of using this method to identify diseases with which a query gene may be associated. We demonstrate the competitive performance of our method through a comparison with two existing state-of-the-art methods, and we analyze the robustness of our method with respect to the parameters involved. As an example application, we apply our method to predict driver genes in 50 copy number aberration regions of melanoma. Our method is not only able to identify several driver genes that have been reported in the literature, it also shed some new biological insights on the understanding of the modular property and transcriptional regulation scheme of these driver genes.", "paper_title": "Uncover disease genes by maximizing information flow in the phenome-interactome network", "paper_id": "WOS:000291752600021"}