{"auto_keywords": [{"score": 0.026897811453592893, "phrase": "statistically_significant_positive_effect"}, {"score": 0.00481495049065317, "phrase": "autonomic_signals_on_perception"}, {"score": 0.00471003041684707, "phrase": "specific_patterns"}, {"score": 0.004675565200598801, "phrase": "autonomic_activity"}, {"score": 0.004523552067565685, "phrase": "typical_autonomic_signals"}, {"score": 0.0040366412779632085, "phrase": "embodied_agents"}, {"score": 0.0039053194919285725, "phrase": "specific_autonomic_signal_patterns"}, {"score": 0.00373682045166829, "phrase": "real-time_model"}, {"score": 0.0025868521085189843, "phrase": "typical_respiration_patterns"}, {"score": 0.002558450494671067, "phrase": "first_study"}, {"score": 0.00238565827614317, "phrase": "second_study"}, {"score": 0.0021205548157547495, "phrase": "artificial_intelligence"}, {"score": 0.0021049977753042253, "phrase": "intelligent_virtual_agents"}], "paper_keywords": [""], "paper_abstract": "Specific patterns of autonomic activity have been reported when people experience emotions. Typical autonomic signals that change with emotion are wrinkles, blushing, sweating, tearing, and respiration. This article explores whether these signals can also influence the perception of emotion in embodied agents. The article first reviews the literature on specific autonomic signal patterns associated with certain affective states. Next, it proceeds to describe a real-time model for wrinkles, blushing, sweating, tearing, and respiration that is capable of implementing those patterns. Two studies are then described. In the first, subjects compare surprise, sadness, anger, shame, pride, and fear expressed in an agent with or without blushing, wrinkles, sweating, or tears. In the second, subjects compare excitement, relaxation, focus, pain, relief, boredom, anger, fear, panic, disgust, surprise, startle, sadness, and joy expressed in an agent with or without typical respiration patterns. The first study shows a statistically significant positive effect on perception of surprise, sadness, anger, shame, and fear. The second study shows a statistically significant positive effect on perception of excitement, pain, relief, boredom, anger, fear, panic, disgust, and startle. The relevance of these results to artificial intelligence and intelligent virtual agents is discussed.", "paper_title": "INFLUENCE OF AUTONOMIC SIGNALS ON PERCEPTION OF EMOTIONS IN EMBODIED AGENTS", "paper_id": "WOS:000279635100002"}