{"auto_keywords": [{"score": 0.043113908496203925, "phrase": "mobile_videophones"}, {"score": 0.010969793966488495, "phrase": "subjective_norm"}, {"score": 0.01026306887064034, "phrase": "privacy_concern"}, {"score": 0.00481495049065317, "phrase": "consumers'_expanded_use"}, {"score": 0.004502943680955863, "phrase": "flow_theory"}, {"score": 0.004378958522416482, "phrase": "planned_behaviour"}, {"score": 0.004049590638590415, "phrase": "research_model"}, {"score": 0.0039380388343479384, "phrase": "partial_least_square_graph_software"}, {"score": 0.003601235776892337, "phrase": "online_questionnaires"}, {"score": 0.0032383707002544755, "phrase": "expanded_intention"}, {"score": 0.0028635111041882956, "phrase": "media_characteristics"}, {"score": 0.0027382040767844093, "phrase": "significant_influences"}], "paper_keywords": ["expanded use intention", " mobile services", " flow theory", " privacy"], "paper_abstract": "The research proposes a framework incorporating the flow theory and the theory of planned behaviour to understand the intention of subscribers to expand their use of mobile videophones. The research model was tested with the partial least square graph software based on its structural equation modelling approach. The data used in this research were collected from online questionnaires done by 151 respondents. The findings show that the flow and the subjective norm are positively related to the expanded intention to use mobile videophones and the privacy concern is negatively related to that intention. The results also reveal that the effects of media characteristics such as interactivity and telepresence may have significant influences on the flow. Moreover, the effects of the flow, the subjective norm and the privacy concern are moderated by self-monitoring. Regardless of personality, people are likely to expand the intention to use mobile videophones when they immerse themselves in the flow. Several implications for research and practice are derived from these findings.", "paper_title": "Understanding what determines consumers' expanded use of mobile videophones", "paper_id": "WOS:000308863100003"}