{"auto_keywords": [{"score": 0.03954448475067728, "phrase": "knowledge_base"}, {"score": 0.03554836480513085, "phrase": "syntactic_form"}, {"score": 0.00481495049065317, "phrase": "belief_update_operators"}, {"score": 0.0043764594918057915, "phrase": "update_operator"}, {"score": 0.004187718090913465, "phrase": "recursive_decomposition"}, {"score": 0.0041418132064539185, "phrase": "update_sentence's_structure"}, {"score": 0.003668768542734106, "phrase": "core_group"}, {"score": 0.0036285315458900284, "phrase": "benchmark_katsuno-mendelzon_update"}, {"score": 0.0030526216870671325, "phrase": "update_operators"}, {"score": 0.003030247482854539, "phrase": "winslett's_standard_semantics"}, {"score": 0.0028360962841331634, "phrase": "general_case"}, {"score": 0.0027437235598539904, "phrase": "not-unreasonable_assumptions"}, {"score": 0.00257735013358606, "phrase": "resulting_approach"}, {"score": 0.0023944552329463035, "phrase": "dual_operator"}, {"score": 0.0023249757987087055, "phrase": "forget_operator"}, {"score": 0.002200077887697072, "phrase": "compositional_revision_operator"}, {"score": 0.0021049977753042253, "phrase": "satoh_revision_operator"}], "paper_keywords": [""], "paper_abstract": "In this paper we explore a class of belief update operators, in which the definition of the operator is compositional with respect to the sentence to be added. The goal is to provide an update operator that is intuitive, in that its definition is based on a recursive decomposition of the update sentence's structure, and that may be reasonably implemented. In addressing update, we first provide a definition phrased in terms of the models of a knowledge base. While this operator satisfies a core group of the benchmark Katsuno-Mendelzon update postulates, not all of the postulates are satisfied. Other Katsuno-Mendelzon postulates can be obtained by suitably restricting the syntactic form of the sentence for update, as we show. In restricting the syntactic form of the sentence for update, we also obtain a hierarchy of update operators with Winslett's standard semantics as the most basic interesting approach captured. We subsequently give an algorithm which captures this approach; in the general case the algorithm is exponential, but with some not-unreasonable assumptions we obtain an algorithm that is linear in the size of the knowledge base. Hence the resulting approach has much better complexity characteristics than other operators in some situations. We also explore other compositional belief change operators: erasure is developed as a dual operator to update; we show that a forget operator is definable in terms of update; and we give a definition of the compositional revision operator. We obtain that compositional revision, under the most natural definition, yields the Satoh revision operator.", "paper_title": "Compositional belief update", "paper_id": "WOS:000258475100001"}