{"auto_keywords": [{"score": 0.038358742865910095, "phrase": "exponential_index"}, {"score": 0.010612387000973441, "phrase": "wireless_data_broadcast"}, {"score": 0.0075487921908340356, "phrase": "tuning_time"}, {"score": 0.004753194996637899, "phrase": "access_efficiency"}, {"score": 0.004692227830462433, "phrase": "energy_conservation"}, {"score": 0.004543193737836748, "phrase": "wireless_data_broadcast_system"}, {"score": 0.0043144799365586375, "phrase": "novel_parameterized_index"}, {"score": 0.003486123304074186, "phrase": "access_latency"}, {"score": 0.0031845067058084583, "phrase": "client_access_algorithm"}, {"score": 0.0030832123624449028, "phrase": "unreliable_broadcast"}, {"score": 0.002985130390111069, "phrase": "performance_analysis"}, {"score": 0.0021883400011393564, "phrase": "index_caching"}], "paper_keywords": ["index structure", " data broadcast", " energy conservation", " mobile computing"], "paper_abstract": "Access efficiency and energy conservation are two critical performance concerns in a wireless data broadcast system. We propose in this paper a novel parameterized index called the exponential index that has a linear yet distributed structure for wireless data broadcast. Based on two tuning knobs, index base and chunk size, the exponential index can be tuned to optimize the access latency with the tuning time bounded by a given limit, and vice versa. The client access algorithm for the exponential index under unreliable broadcast is described. A performance analysis of the exponential index is provided. Extensive ns-2-based simulation experiments are conducted to evaluate the performance under various link error probabilities. Simulation results show that the exponential index substantially outperforms the state-of-the-art indexes. In particular, it is more resilient to link errors and achieves more performance advantages from index caching. The results also demonstrate its great flexibility in trading access latency with tuning time.", "paper_title": "An error-resilient and tunable distributed indexing scheme for wireless data broadcast", "paper_id": "WOS:000234675800008"}