{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "logic_programs"}, {"score": 0.004269630481719451, "phrase": "logic_programming"}, {"score": 0.004060986196931943, "phrase": "arbitrary_interpreted_second_order"}, {"score": 0.003673675864705682, "phrase": "aggregate_programs"}, {"score": 0.00347657813672945, "phrase": "three-valued_immediate_consequence_operator"}, {"score": 0.0033231814056233103, "phrase": "standard_two-valued_immediate_consequence_operator"}, {"score": 0.0031925019616678217, "phrase": "unique_kripke-kleene_model"}, {"score": 0.0031448288291084, "phrase": "unique_well-founded_model"}, {"score": 0.003066945490483524, "phrase": "stable_models"}, {"score": 0.0030060256866508606, "phrase": "different_ways"}, {"score": 0.002816246391862638, "phrase": "different_trade-offs"}, {"score": 0.002224510044064184, "phrase": "immediate_consequence_operators"}, {"score": 0.0021476967767071233, "phrase": "precision_hierarchy"}, {"score": 0.0021049977753042253, "phrase": "optimal_precision"}], "paper_keywords": ["logic programming", " aggregates"], "paper_abstract": "In this paper, we present a framework for the semantics and the computation of aggregates in the context of logic programming. In our study, an aggregate can be an arbitrary interpreted second order predicate or function. We define extensions of the Kripke-Kleene, the well-founded and the stable semantics for aggregate programs. The semantics is based on the concept of a three-valued immediate consequence operator of an aggregate program. Such an operator approximates the standard two-valued immediate consequence operator of the program, and induces a unique Kripke-Kleene model, a unique well-founded model and a collection of stable models. We study different ways of defining such operators and thus obtain a framework of semantics, offering different trade-offs between precision and tractability. In particular, we investigate conditions on the operator that guarantee that the computation of the three types of semantics remains on the same level as for logic programs without aggregates. Other results show that, in practice, even efficient three-valued immediate consequence operators which are very low in the precision hierarchy, still provide optimal precision.", "paper_title": "Well-founded and stable semantics of logic programs with aggregates", "paper_id": "WOS:000245783300002"}