{"auto_keywords": [{"score": 0.04953663923501098, "phrase": "knowledge_management"}, {"score": 0.048734215142491676, "phrase": "work_processes"}, {"score": 0.00481495049065317, "phrase": "context-based_model"}, {"score": 0.004522406417999492, "phrase": "prominent_subject"}, {"score": 0.0043953478557600565, "phrase": "often_the_information"}, {"score": 0.004271843728776305, "phrase": "well-defined_design_work_process"}, {"score": 0.0038332390893263844, "phrase": "fundamental_information_resource"}, {"score": 0.003419943984098415, "phrase": "organizational_learning"}, {"score": 0.0027218799769229596, "phrase": "formal_ontology-based_representation"}, {"score": 0.0022034318550547866, "phrase": "contextual_information"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Context", " Design work process", " Knowledge Management"], "paper_abstract": "Knowledge Management has become a prominent subject for organizations, but often the information that flows in a well-defined design work process is not characterized and treated in such a way as to promote its reuse. We argue that context is a fundamental information resource for improving how activities and interactions are understood and carried on. Our premise is that it is important for organizational learning that decisions, solutions, discussions and actions executed in work processes should be retrievable. We describe an environment that supports the cycle of creating and dealing with information about activities and interactions, focusing on their context. A formal ontology-based representation of context is presented to support the use of this environment. Two case studies are described and their results analyzed. The goal of this paper is to discuss and specify mechanisms that can be used to collect contextual information within such an environment. (C) 2609 Elsevier Inc. All rights reserved.", "paper_title": "A context-based model for Knowledge Management embodied in work processes", "paper_id": "WOS:000267086700004"}