{"auto_keywords": [{"score": 0.04134078290793054, "phrase": "building_blocks"}, {"score": 0.015719716506582538, "phrase": "bayesian_artificial_immune_system"}, {"score": 0.009808933221912439, "phrase": "probabilistic_model"}, {"score": 0.004760765880314089, "phrase": "effective_handling"}, {"score": 0.004671803485255806, "phrase": "significant_progress"}, {"score": 0.0045158206186680224, "phrase": "artificial_immune_systems"}, {"score": 0.004414723336530117, "phrase": "hard_problems"}, {"score": 0.003363830908814182, "phrase": "high-quality_partial_solutions"}, {"score": 0.0032884384364324395, "phrase": "novel_ais"}, {"score": 0.0031665087019813244, "phrase": "optimization_problems"}, {"score": 0.003049086085585051, "phrase": "new_individuals"}, {"score": 0.002958281631770322, "phrase": "joint_probability_distribution"}, {"score": 0.0029249294679606656, "phrase": "promising_solutions"}, {"score": 0.0028164399450837465, "phrase": "new_solutions"}, {"score": 0.0027428939498108746, "phrase": "bayesian_network"}, {"score": 0.002495521662819317, "phrase": "significant_attempt"}, {"score": 0.0024395426929046415, "phrase": "immune-inspired_algorithms"}, {"score": 0.002340147988348115, "phrase": "hard_optimization_problems"}, {"score": 0.0023225152126545067, "phrase": "complex_interactions"}, {"score": 0.0022533001054182125, "phrase": "bais"}, {"score": 0.0021049977753042253, "phrase": "distribution_algorithms"}], "paper_keywords": ["Artificial Immune System", " Bayesian networks", " Building blocks", " Combinatorial optimization"], "paper_abstract": "Significant progress has been made in theory and design of Artificial Immune Systems (AISs) for solving hard problems accurately. However, an aspect not yet widely addressed by the research reported in the literature is the lack of ability of the AlSs to deal effectively with building blocks (partial high-quality solutions coded in the antibody). The available AlSs present mechanisms for evolving the population that do not take into account the relationship among the variables of the problem, potentially causing the disruption of high-quality partial solutions. This paper proposes a novel AIS with abilities to identify and properly manipulate building blocks in optimization problems. Instead of using cloning and mutation to generate new individuals, our algorithm builds a probabilistic model representing the joint probability distribution of the promising solutions and, subsequently, uses this model for sampling new solutions. The probabilistic model used is a Bayesian network due to its capability of properly capturing the most relevant interactions among the variables. Therefore, our algorithm, called Bayesian Artificial Immune System (BAIS), represents a significant attempt to improve the performance of immune-inspired algorithms when dealing with building blocks, and hence to solve efficiently hard optimization problems with complex interactions among the variables. The performance of BAIS compares favorably with that produced by contenders such as state-of-the-art Estimation of Distribution Algorithms. (c) 2008 Elsevier Inc. All rights reserved.", "paper_title": "BAIS: A Bayesian Artificial Immune System for the effective handling of building blocks", "paper_id": "WOS:000265079600005"}