{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "adaptive_behaviour"}, {"score": 0.004646258518859209, "phrase": "reinforcement_learning_framework"}, {"score": 0.004510184935928004, "phrase": "learned_state_utility"}, {"score": 0.003576416581189716, "phrase": "error_signal"}, {"score": 0.0034922880300145283, "phrase": "agent-based_simulation_experiments"}, {"score": 0.0033497809969621267, "phrase": "psychological_and_behavioural_dynamics"}, {"score": 0.0030454408569868347, "phrase": "adaptive_agent_framework"}, {"score": 0.002639845784408318, "phrase": "complex_feedback_signal"}, {"score": 0.0022610379771517966, "phrase": "human-robot_interaction"}, {"score": 0.0021946656099592608, "phrase": "emotional_signals"}, {"score": 0.0021049977753042253, "phrase": "adaptive_agents"}], "paper_keywords": ["reinforcement learning", " emotion dynamics", " affective computing", " emotion"], "paper_abstract": "In this paper we computationally study the relation between adaptive behaviour and emotion. Using the reinforcement learning framework, we propose that learned state utility, models fear (negative) and hope (positive) based on the fact that both signals are about anticipation of loss or gain. Further, we propose that joy/distress is a signal similar to the error signal. We present agent-based simulation experiments that show that this model replicates psychological and behavioural dynamics of emotion. This work distinguishes itself by assessing the dynamics of emotion in an adaptive agent framework - coupling it to the literature on habituation, development, extinction and hope theory. Our results support the idea that the function of emotion is to provide a complex feedback signal for an organism to adapt its behaviour. Our work is relevant for understanding the relation between emotion and adaptation in animals, as well as for human-robot interaction, in particular how emotional signals can be used to communicate between adaptive agents and humans.", "paper_title": "A reinforcement learning model of joy, distress, hope and fear", "paper_id": "WOS:000362088200002"}