{"auto_keywords": [{"score": 0.045744145789340156, "phrase": "amp"}, {"score": 0.021547163601972633, "phrase": "meth"}, {"score": 0.010535810026117908, "phrase": "free_energy_calculation"}, {"score": 0.007913157562002695, "phrase": "binding_pocket"}, {"score": 0.007742749520251186, "phrase": "binding_free_energy"}, {"score": 0.006994441377074982, "phrase": "celikel_et_al"}, {"score": 0.00481495049065317, "phrase": "molecular_dynamics_simulation"}, {"score": 0.004745362527093198, "phrase": "molecular_dynamics_simulations"}, {"score": 0.004575740812937594, "phrase": "single-chain_variable_fragment"}, {"score": 0.003984444229875069, "phrase": "key_atoms"}, {"score": 0.003941141575848601, "phrase": "selected_residues"}, {"score": 0.0038559375376635047, "phrase": "averaged_structures"}, {"score": 0.003624361893008392, "phrase": "significant_changes"}, {"score": 0.0034315678891900184, "phrase": "extra_water"}, {"score": 0.0031903162513050804, "phrase": "experimental_work"}, {"score": 0.0028702214190712036, "phrase": "methyl_group"}, {"score": 0.002526261001496249, "phrase": "binding_energy"}, {"score": 0.00250789768689397, "phrase": "ligand-residue_pair_interactions"}, {"score": 0.0024092539025697014, "phrase": "nearly-zero_interactions"}, {"score": 0.0021049977753042253, "phrase": "meth_abuse"}], "paper_keywords": ["Binding free energy", " MM-GBSA", " Molecular dynamics simulation", " ScFv"], "paper_abstract": "Molecular dynamics simulations and free energy calculation have been performed to study how the single-chain variable fragment (scFv) binds methamphetamine (METH) and amphetamine (AMP). The structures of the scFv:METH and the scFv:AMP complexes are analyzed by examining the time-dependence of their RMSDs, by analyzing the distance between some key atoms of the selected residues, and by comparing the averaged structures with their corresponding crystallographic structures. It is observed that binding an AMP to the scFv does not cause significant changes to the binding pocket of the scFv:ligand complex. The binding free energy of scFv:AMP without introducing an extra water into the binding pocket is much stronger than scFv:METH. This is against the first of the two scenarios postulated in the experimental work of Celikel et al. (Protein Science 18, 2336 (2009)). However, adding a water to the AMP (at the position of the methyl group of METH), the binding free energy of the scFv:AMP-H2O complex, is found to be significantly weaker than scFv:METH. This is consistent with the second of the two scenarios given by Celikel et al. Decomposition of the binding energy into ligand-residue pair interactions shows that two residues (Tyr175 and Tyr177) have nearly-zero interactions with AMP in the scFv:AMP-H2O complex, whereas their interactions with METH in the scFv:METH complex are as large as -0.8 and -0.74 kcal mol(-1). The insights gained from this study may be helpful in designing more potent antibodies in treating METH abuse.", "paper_title": "Insights into scFv:drug binding using the molecular dynamics simulation and free energy calculation", "paper_id": "WOS:000293137800010"}