{"auto_keywords": [{"score": 0.04472882712454684, "phrase": "randomized_encoding"}, {"score": 0.00481495049065317, "phrase": "private_randomizing_polynomials"}, {"score": 0.004737201825299411, "phrase": "randomizing_polynomials"}, {"score": 0.004585433265422727, "phrase": "low-degree_randomized_mapping"}, {"score": 0.004331393784852601, "phrase": "input_x"}, {"score": 0.00332375606483146, "phrase": "relaxed_notion"}, {"score": 0.0032967724149749853, "phrase": "computationally_private_randomizing_polynomials"}, {"score": 0.0027441711627551064, "phrase": "acryptographic_pseudorandom_generator"}, {"score": 0.002688781336915723, "phrase": "uniform_circle"}, {"score": 0.002623783458189614, "phrase": "latter_assumption"}, {"score": 0.0024281181691350085, "phrase": "yao's_garbled_circuit_technique"}, {"score": 0.0024083881142747954, "phrase": "previous_\"information-theoretic\"_constructions"}, {"score": 0.002321563536990284, "phrase": "computationally_private_randomizing_polynomials_incryptography"}, {"score": 0.00224701149477484, "phrase": "sufficient_assumptions"}, {"score": 0.0022287497627555895, "phrase": "parallel_constructions"}, {"score": 0.00221063611719246, "phrase": "cryptographic_primitives"}, {"score": 0.0021837406983565098, "phrase": "new_parallel_reductions"}, {"score": 0.0021049977753042253, "phrase": "constant-round_protocols"}], "paper_keywords": ["cryptography", " constant depth circuits", " NC0", " parallel construction", " randomizing polynomials", " garbled circuit"], "paper_abstract": "Randomizing polynomials allow representing a function f(x) by a low-degree randomized mapping (f) over cap (x, r) whose output distribution on an input x is a randomized encoding of f(x). It is known that any function f in uniform. circle plus L/poly (and in particular in NC1) can be efficiently represented by degree-3 randomizing polynomials. Such a degree-3 representation gives rise to an NC40 representation, in which every bit of the output depends on only four bits of the input. In this paper, we study the relaxed notion of computationally private randomizing polynomials, where the output distribution of (f) over cap (x, r) should only be computationally indistinguishable from a randomized encoding of f(x). We construct degree-3 randomizing polynomials of this type for every polynomial-time computable function, assuming the existence of acryptographic pseudorandom generator (PRG) in uniform circle plus L/poly. (The latter assumption is implied by most standard intractability assumptions used in cryptography.) This result is obtained by combining a variant of Yao's garbled circuit technique with previous \"information-theoretic\" constructions of randomizing polynomials. We present several applications of computationally private randomizing polynomials incryptography. In particular, we relax the sufficient assumptions for parallel constructions of cryptographic primitives, obtain new parallel reductions between primitives, and simplify the design of constant-round protocols for multiparty computation.", "paper_title": "Computationally private randomizing polynomials and their applications", "paper_id": "WOS:000238453500003"}