{"auto_keywords": [{"score": 0.040040394279143694, "phrase": "chemspider"}, {"score": 0.019241850272629545, "phrase": "chemlist_dictionary"}, {"score": 0.008637276274551966, "phrase": "multi-source_chemical_dictionary"}, {"score": 0.008240421360728202, "phrase": "chemlist"}, {"score": 0.007746872402509793, "phrase": "annotated_corpus"}, {"score": 0.007134152352569924, "phrase": "extensive_manual_curation"}, {"score": 0.005521133925535848, "phrase": "chemspider_dictionary"}, {"score": 0.00481495049065317, "phrase": "manual_curation"}, {"score": 0.0047026237903774895, "phrase": "text_mining"}, {"score": 0.004579371037534175, "phrase": "combined_dictionary"}, {"score": 0.004485735417293941, "phrase": "small_molecules"}, {"score": 0.004355267258397068, "phrase": "publicly_available_databases"}, {"score": 0.004216112320418982, "phrase": "acceptable_recall"}, {"score": 0.004117697953535388, "phrase": "automatic_and_semi-automatic_processing_steps"}, {"score": 0.003858697684681798, "phrase": "chemical_term_identification"}, {"score": 0.0037797419108291227, "phrase": "chemical_database"}, {"score": 0.0036914757355166966, "phrase": "valid_chemical_name-to-structure_relationships"}, {"score": 0.003531474887552889, "phrase": "rule-based_term_filtering"}, {"score": 0.0035106702438029913, "phrase": "semi-automatic_manual_curation"}, {"score": 0.0024189730566375215, "phrase": "best_precision"}, {"score": 0.0023764249306830196, "phrase": "higher_recall"}, {"score": 0.0023554316787703137, "phrase": "best_f-score"}, {"score": 0.002286781334850213, "phrase": "high_precision"}, {"score": 0.002233301265743633, "phrase": "manually_curated_dictionary"}, {"score": 0.002187530939295254, "phrase": "web_service"}, {"score": 0.0021174899403023965, "phrase": "xml_file"}, {"score": 0.0021049977753042253, "phrase": "simple_knowledge_organization_system_format"}], "paper_keywords": [""], "paper_abstract": "Background: Previously, we developed a combined dictionary dubbed Chemlist for the identification of small molecules and drugs in text based on a number of publicly available databases and tested it on an annotated corpus. To achieve an acceptable recall and precision we used a number of automatic and semi-automatic processing steps together with disambiguation rules. However, it remained to be investigated which impact an extensive manual curation of a multi-source chemical dictionary would have on chemical term identification in text. ChemSpider is a chemical database that has undergone extensive manual curation aimed at establishing valid chemical name-to-structure relationships. Results: We acquired the component of ChemSpider containing only manually curated names and synonyms. Rule-based term filtering, semi-automatic manual curation, and disambiguation rules were applied. We tested the dictionary from ChemSpider on an annotated corpus and compared the results with those for the Chemlist dictionary. The ChemSpider dictionary of ca. 80 k names was only a 1/3 to a 1/4 the size of Chemlist at around 300 k. The ChemSpider dictionary had a precision of 0.43 and a recall of 0.19 before the application of filtering and disambiguation and a precision of 0.87 and a recall of 0.19 after filtering and disambiguation. The Chemlist dictionary had a precision of 0.20 and a recall of 0.47 before the application of filtering and disambiguation and a precision of 0.67 and a recall of 0.40 after filtering and disambiguation. Conclusions: We conclude the following: (1) The ChemSpider dictionary achieved the best precision but the Chemlist dictionary had a higher recall and the best F-score; (2) Rule-based filtering and disambiguation is necessary to achieve a high precision for both the automatically generated and the manually curated dictionary. ChemSpider is available as a web service at http://www.chemspider.com/ and the Chemlist dictionary is freely available as an XML file in Simple Knowledge Organization System format on the web at http://www.biosemantics.org/chemlist.", "paper_title": "Automatic vs. manual curation of a multi-source chemical dictionary: the impact on text mining", "paper_id": "WOS:000208222200003"}