{"auto_keywords": [{"score": 0.01517304663017915, "phrase": "irp"}, {"score": 0.011240909163324117, "phrase": "nonvehicle_index_formulations"}, {"score": 0.00481495049065317, "phrase": "multivehicle_production"}, {"score": 0.004395742407834023, "phrase": "integrated_supply_chains"}, {"score": 0.004065474891313382, "phrase": "single-vehicle_problems"}, {"score": 0.004025968624066142, "phrase": "multivehicle_aspect"}, {"score": 0.00389702203873437, "phrase": "multivehicle_prp_and_irp_formulations"}, {"score": 0.0038216374069880038, "phrase": "vehicle_index"}, {"score": 0.003311458758488674, "phrase": "adaptive_large_neighborhood_search_technique"}, {"score": 0.003247364431057555, "phrase": "initial_solutions"}, {"score": 0.0032157824854214313, "phrase": "branch-and-cut_algorithms"}, {"score": 0.0031535341431377837, "phrase": "different_formulations"}, {"score": 0.003082427650896418, "phrase": "vehicle_index_formulations"}, {"score": 0.0030326180561817497, "phrase": "optimal_solutions"}, {"score": 0.002935393439834135, "phrase": "good_lower_bounds"}, {"score": 0.0029163246959273605, "phrase": "larger_instances"}, {"score": 0.0028973794653974327, "phrase": "irp_and_prp_instances"}, {"score": 0.0027323009127771525, "phrase": "ml_policy"}, {"score": 0.0026969099161088398, "phrase": "parallel_computing"}, {"score": 0.0025021080708987824, "phrase": "prp"}, {"score": 0.0024061070225431525, "phrase": "ou_policy"}, {"score": 0.0022615684627308283, "phrase": "single_core_machine"}, {"score": 0.0021049977753042253, "phrase": "multicore_machine"}], "paper_keywords": ["integrated supply chain planning", " inventory routing", " production routing", " multivehicle", " symmetry breaking", " branch-and-cut"], "paper_abstract": "The inventory routing problem (IRP) and the production routing problem (PRP) are two difficult problems arising in the planning of integrated supply chains. These problems are solved in an attempt to jointly optimize production, inventory, distribution, and routing decisions. Although several studies have proposed exact algorithms to solve the single-vehicle problems, the multivehicle aspect is often neglected because of its complexity. We introduce multivehicle PRP and IRP formulations, with and without a vehicle index, to solve the problems under both the maximum level (ML) and order-up-to level (OU) inventory replenishment policies. The vehicle index formulations are further improved using symmetry breaking constraints; the nonvehicle index formulations are strengthened by several cuts. A heuristic based on an adaptive large neighborhood search technique is also developed to determine initial solutions, and branch-and-cut algorithms are proposed to solve the different formulations. The results show that the vehicle index formulations are superior in finding optimal solutions, whereas the nonvehicle index formulations are generally better at providing good lower bounds on larger instances. IRP and PRP instances with up to 35 customers, three periods, and three vehicles can be solved to optimality within two hours for the ML policy. By using parallel computing, the algorithms could solve the instances for the same policy with up to 45 and 50 customers, three periods, and three vehicles for the IRP and PRP, respectively. For the more difficult IRP (PRP) under the OU policy, the algorithms could handle instances with up to 30 customers, three (six) periods, and three vehicles on a single core machine, and up to 45 (35) customers, three (six) periods, and three vehicles on a multicore machine.", "paper_title": "Formulations and Branch-and-Cut Algorithms for Multivehicle Production and Inventory Routing Problems", "paper_id": "WOS:000331086100008"}