{"auto_keywords": [{"score": 0.049483572884790016, "phrase": "influence_theories"}, {"score": 0.015624076987239341, "phrase": "twitter"}, {"score": 0.00481495049065317, "phrase": "local_influence_theories"}, {"score": 0.004725385523804256, "phrase": "formal_models"}, {"score": 0.004452558960552103, "phrase": "large_body"}, {"score": 0.004315324272986853, "phrase": "important_applications"}, {"score": 0.004288386935585756, "phrase": "viral_marketing"}, {"score": 0.004078829832634839, "phrase": "manual_process"}, {"score": 0.0037834649508375544, "phrase": "formalized_framework"}, {"score": 0.0037363522297378777, "phrase": "topic-specific_influence_theories"}, {"score": 0.003598492288058048, "phrase": "five_conjunctive_conditions"}, {"score": 0.003542557455905503, "phrase": "real_influence_exertion"}, {"score": 0.0032551474344211582, "phrase": "novel_metric"}, {"score": 0.0032145922365231093, "phrase": "aggregate_sentiment"}, {"score": 0.0030097975788892896, "phrase": "entire_community"}, {"score": 0.0029260602766930065, "phrase": "large-scale_test-bed"}, {"score": 0.002613709503583786, "phrase": "five_established_topic-specific_theories"}, {"score": 0.0025171669791790438, "phrase": "significant_differences"}, {"score": 0.002431797888365548, "phrase": "novel_methodology"}, {"score": 0.0023939545398857518, "phrase": "internal_dynamics"}, {"score": 0.002262518422441041, "phrase": "selected_theories"}, {"score": 0.002220326414611295, "phrase": "resulting_evidence"}, {"score": 0.0021857667493036786, "phrase": "novel_partition"}, {"score": 0.0021450029487459403, "phrase": "divergent_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Evaluation framework", " Social influence", " Topic communities"], "paper_abstract": "Influence theories constitute formal models that identify those individuals that are able to affect and guide their peers through their activity. There is a large body of work on developing such theories, as they have important applications in viral marketing, recommendations, as well as information retrieval. Influence theories are typically evaluated through a manual process that cannot scale to data voluminous enough to draw safe, representative conclusions. To overcome this issue, we introduce in this paper a formalized framework for large-scale, automatic evaluation of topic-specific influence theories that are specialized in Twitter. Basically, it consists of five conjunctive conditions that are indicative of real influence exertion: the first three determine which influence theories are compatible with our framework, while the other two estimate their relative effectiveness. At the core of these two conditions lies a novel metric that assesses the aggregate sentiment of a group of users and allows for estimating how close the behavior of influencers is to that of the entire community. We put our framework into practice using a large-scale test-bed with real data from 75 Twitter communities. In order to select the theories that can be employed in our analysis, we introduce a generic, two-dimensional taxonomy that elucidates their functionality. With its help, we ended up with five established topic-specific theories that are applicable to our settings. The outcomes of our analysis reveal significant differences in their performance. To explain them, we introduce a novel methodology for delving into the internal dynamics of the groups of influencers they define. We use it to analyze the implications of the selected theories and, based on the resulting evidence, we propose a novel partition of influence theories in three major categories with divergent performance. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Large-scale evaluation framework for local influence theories in Twitter", "paper_id": "WOS:000345491900013"}