{"auto_keywords": [{"score": 0.03056279068001877, "phrase": "proposed_methodology"}, {"score": 0.004713379149462482, "phrase": "energy_storage_alternatives"}, {"score": 0.00451659023910662, "phrase": "excess_energy"}, {"score": 0.003931798194574009, "phrase": "multi_criteria"}, {"score": 0.0036488111139918135, "phrase": "best_energy_storage_alternative"}, {"score": 0.0034963129868796033, "phrase": "mcdm_methodology"}, {"score": 0.0034407781868385423, "phrase": "good_approach"}, {"score": 0.003244567402785763, "phrase": "hybrid_mcdm_methodology"}, {"score": 0.0031760175583084274, "phrase": "analytic_hierarchy_process"}, {"score": 0.0031422967073199888, "phrase": "ahp"}, {"score": 0.003092362986927247, "phrase": "topsis"}, {"score": 0.0022928991183989115, "phrase": "hierarchical_structure"}, {"score": 0.002150481043278758, "phrase": "best_electrical_energy_storage_alternative"}, {"score": 0.0021049977753042253, "phrase": "compressed_air_energy_storage"}], "paper_keywords": ["Electrical energy storage", " type-2 fuzzy sets", " AHP", " TOPSIS", " MCDM"], "paper_abstract": "Energy storage alternatives that help storing excess energy and then using it when the system needs it has become more important in recent years. Determination of the most suitable energy storage alternative can be analyzed by using multi criteria decision making (MCDM) techniques. There are many criteria that affect the best energy storage alternative and the aims are contrasting so, MCDM methodology is a good approach to solve these problems. In this paper, a hybrid MCDM methodology that consists of analytic hierarchy process (AHP) and TOPSIS based on type-2 fuzzy sets is proposed. To obtain more flexible evaluation and more precise results the proposed methodology combines type-2 fuzzy AHP that used to determine the weights of criteria and type-2 fuzzy TOP SIS methodology that analyzes the alternatives with respect to criteria and weights. The proposed methodology has been used to determine the most suitable energy storage alternatives. For this aim, 6 electrical energy storage alternatives are considered with a hierarchical structure of 4 main and 18 sub-criteria. According to results obtained the best electrical energy storage alternative is determined as compressed air energy storage.", "paper_title": "A Hybrid Multicriteria Decision Making Methodology Based on Type-2 Fuzzy Sets For Selection Among Energy Storage Alternatives", "paper_id": "WOS:000367878800006"}