{"auto_keywords": [{"score": 0.004569630374630379, "phrase": "novel_non-overlapping_concept"}, {"score": 0.004428453092970309, "phrase": "hpls"}, {"score": 0.003905864553426306, "phrase": "reseeding_algorithm"}, {"score": 0.003554661425339528, "phrase": "newly_seeded_particles"}, {"score": 0.003069867656852932, "phrase": "non-overlapping_concept"}, {"score": 0.0029905104479072482, "phrase": "potential_new_particles"}, {"score": 0.002867771524071872, "phrase": "particle_representation"}, {"score": 0.0026096659285441384, "phrase": "distance_restriction"}, {"score": 0.0025156683465194967, "phrase": "hpls_method"}, {"score": 0.0024894376091589244, "phrase": "multi-phase_flows"}, {"score": 0.002289180040240783, "phrase": "challenging_test_cases"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Level set method", " Particle correction", " New reseeding algorithm", " Non-overlapping concept", " Multi-phase flow"], "paper_abstract": "A novel non-overlapping concept is augmented to the Hybrid Particle Level Set (HPLS) method to improve its accuracy and suitability for the modelling of multi-phase fluid flows. The concept addresses shortcomings in the reseeding algorithm, which maintains resolution of the surface at runtime. These shortcomings result in the misplacement of newly seeded particles in the opposite signed domain and necessitate a restriction on the distance that a particle can escape without deletion, which reduces the effectiveness of the method. The non-overlapping concept judges the suitability of potential new particles based on information already contained within the particle representation of the surface. By preventing the misplacement of particles it is possible to significantly relax the distance restriction thereby increasing the accuracy of the HPLS method in multi-phase flows. To demonstrate its robustness and efficiency, the concept is examined with a number of challenging test cases, including both level-set-only simulations and two-phase fluid flows. (C) 2014 Elsevier Inc. Allrights reserved.", "paper_title": "A new non-overlapping concept to improve the Hybrid Particle Level Set method in multi-phase fluid flows", "paper_id": "WOS:000346430700020"}