{"auto_keywords": [{"score": 0.02864039936811681, "phrase": "sweden"}, {"score": 0.004778923541463994, "phrase": "systems_software_development"}, {"score": 0.004654928974748418, "phrase": "high_complexity"}, {"score": 0.004318027255281003, "phrase": "managerial_independence"}, {"score": 0.0039456466422100045, "phrase": "different_systems"}, {"score": 0.003687512797620773, "phrase": "project_level"}, {"score": 0.0036324746826127997, "phrase": "kanban_boards"}, {"score": 0.0036052633308076933, "phrase": "burndown_charts"}, {"score": 0.0034722233102219466, "phrase": "increased_complexity"}, {"score": 0.0031606404966938568, "phrase": "early_identification"}, {"score": 0.003136952589428254, "phrase": "proactive_removal"}, {"score": 0.0029648446274266765, "phrase": "bottleneck_resolution"}, {"score": 0.0028661330049356186, "phrase": "industry_evaluation"}, {"score": 0.0028021527740710508, "phrase": "case_study"}, {"score": 0.002719055901632759, "phrase": "ericsson_ab"}, {"score": 0.0024748913336907923, "phrase": "quantitative_analysis"}, {"score": 0.0022696277881969896, "phrase": "qualitative_and_quantitative_data"}, {"score": 0.0021775526153883355, "phrase": "bottleneck_identification"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["system of systems", " bottleneck identification", " software process"], "paper_abstract": "System of systems are of high complexity, and for each system, many different requirements are implemented in parallel. Systems are developed with some degree of managerial independence but later on have to work together. In this situation, many requirements are written, implemented, and tested in parallel for different systems that are to be integrated. This makes identifying bottlenecks challenging, and visualizations often used on project level (such as Kanban boards or burndown charts) have to be extended/complemented to cope with the increased complexity. In response to these challenges, the contributions of this study are to propose the following: (i) a visualization for early identification and proactive removal of bottlenecks; (ii) a visualization to check on the success of bottleneck resolution; and (iii) to provide an industry evaluation of the visualizations in a case study of a system of systems developed at Ericsson AB in Sweden. The feedback by the practitioners showed that the visualizations were perceived as useful in improving throughput and lead time. The quantitative analysis showed that the visualizations were able in identifying bottlenecks and showing improvements or the lack thereof. On the basis of the qualitative and quantitative data collected, we conclude that the visualizations are useful in bottleneck identification and resolution. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Early identification of bottlenecks in very large scale system of systems software development", "paper_id": "WOS:000346649500005"}