{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "yahoo"}, {"score": 0.013301267021608165, "phrase": "question_types"}, {"score": 0.013187665404101443, "phrase": "answerer_reputation"}, {"score": 0.012103029565278369, "phrase": "five_question_types"}, {"score": 0.004247180402119585, "phrase": "largest_community_question"}, {"score": 0.003997458586709491, "phrase": "effective_answers"}, {"score": 0.003525744120930142, "phrase": "complex_interactive_and_opinion"}, {"score": 0.002939202022371694, "phrase": "factorial_analysis"}, {"score": 0.002754208576828914, "phrase": "high_quality"}, {"score": 0.0027068691342344545, "phrase": "readable_answers"}, {"score": 0.0026718978608934077, "phrase": "reputed_answerers"}, {"score": 0.0026033013834547507, "phrase": "detailed_and_high-quality_answers"}, {"score": 0.0022957232752482196, "phrase": "answer_effectiveness"}, {"score": 0.002266051712795851, "phrase": "twin_focus"}, {"score": 0.0021511430180912164, "phrase": "cqa_research"}, {"score": 0.0021049977753042253, "phrase": "limited_attention"}], "paper_keywords": ["Answer effectiveness", " Answerer reputation", " Community question answering", " Question types"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the ways in which effectiveness of answers in Yahoo! Answers, one of the largest community question answering sites (CQAs), is related to question types and answerer reputation. Effective answers are defined as those that are detailed, readable, superior in quality and contributed promptly. Five question types that were studied include factoid, list, definition, complex interactive and opinion. Answerer reputation refers to the past track record of answerers in the community. Design/methodology/approach - The data set comprises 1,459 answers posted in Yahoo! Answers in response to 464 questions that were distributed across the five question types. The analysis was done using factorial analysis of variance. Findings - The results indicate that factoid, definition and opinion questions are comparable in attracting high quality as well as readable answers. Although reputed answerers generally fared better in offering detailed and high-quality answers, novices were found to submit more readable responses. Moreover, novices were more prompt in answering factoid, list and definition questions. Originality/value - By analysing variations in answer effectiveness with a twin focus on question types and answerer reputation, this study explores a strand of CQA research that has hitherto received limited attention. The findings offer insights to users and designers of CQAs.", "paper_title": "Measuring the effectiveness of answers in Yahoo! Answers", "paper_id": "WOS:000350588600007"}