{"auto_keywords": [{"score": 0.029220451970045414, "phrase": "broader_narrative"}, {"score": 0.00481495049065317, "phrase": "aurangzeb_project"}, {"score": 0.004656082803151484, "phrase": "succession_war"}, {"score": 0.004483585361583022, "phrase": "formal_representation"}, {"score": 0.00444612502361583, "phrase": "legal_or_other_narratives"}, {"score": 0.003920209964956682, "phrase": "particular_historical_episode"}, {"score": 0.003887438245620965, "phrase": "cognitive_states"}, {"score": 0.003559387846675818, "phrase": "would-be_ally"}, {"score": 0.003370287778450475, "phrase": "present_part"}, {"score": 0.0032181231788427655, "phrase": "narrative_representation"}, {"score": 0.0031645050772280033, "phrase": "artificial_intelligence"}, {"score": 0.00299632091372281, "phrase": "data_structure"}, {"score": 0.0028609920171902186, "phrase": "computational_work"}, {"score": 0.002318728604587962, "phrase": "special_operators"}, {"score": 0.0021049977753042253, "phrase": "wigmorean_representation"}], "paper_keywords": [""], "paper_abstract": "In this sequence of two articles, a formal representation for legal or other narratives as previously introduced by myself [152,154-158,165] is augmented and integrated with a representation for arguments, and applied to the setting into formulae of a particular historical episode. Cognitive states are of interest, because one of the contenders in a war of succession is captured by deception by a would-be ally; they both had authority on other characters obeying their orders. In the present Part 1, we survey the state of the art of narrative representation and processing in artificial intelligence. As in this article we augment our method of representation with a data structure based on the structure of arguments, we shortly survey computational work on argumentation as well. We introduce the broader narrative, and the particular episode which we set in formulae in Part 11. Formulae representing notions from the broader narrative, and in particular the circumstances which led to the war of succession, are presented in Part 1. Special operators are defined, which arguably are relevant for a very large, pervasive array of narrative situations. Moreover, in Part I we introduce a Wigmorean representation.", "paper_title": "Goals, arguments, and deception: A formal representation from the Aurangzeb project. I: An episode from the succession war", "paper_id": "WOS:000248524400007"}