{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cognitive_vision_systems"}, {"score": 0.04953138363683525, "phrase": "cognitive_systems"}, {"score": 0.025380865255092373, "phrase": "concept_spaces"}, {"score": 0.004598345457673231, "phrase": "direct_physical_action"}, {"score": 0.004381343262060196, "phrase": "internal_models"}, {"score": 0.00433119729113785, "phrase": "interpreted_context"}, {"score": 0.004203476156144781, "phrase": "subsequent_step"}, {"score": 0.003913844170628935, "phrase": "fundamental_property"}, {"score": 0.0036778330583593357, "phrase": "distributed_organization"}, {"score": 0.0035693096802112945, "phrase": "later_acquired_information"}, {"score": 0.003479978436386994, "phrase": "semantic_character"}, {"score": 0.0032775896346744536, "phrase": "organization_aspects"}, {"score": 0.0029820135906847367, "phrase": "central_mechanism"}, {"score": 0.002961459921170416, "phrase": "perception-action_feedback_cycle"}, {"score": 0.0029342745825574374, "phrase": "learning_phase"}, {"score": 0.002860791110589271, "phrase": "causal_direction"}, {"score": 0.0028410705918400047, "phrase": "action_space"}, {"score": 0.0028020352969191477, "phrase": "percept_space"}, {"score": 0.002688109427473364, "phrase": "state_change"}, {"score": 0.002525824669184941, "phrase": "symbolic_representations"}, {"score": 0.0024853705769928174, "phrase": "system_states"}, {"score": 0.0024739314314119235, "phrase": "action_states"}, {"score": 0.002456871112529203, "phrase": "active_exploration"}, {"score": 0.0024175187171173703, "phrase": "perception-action_learning"}, {"score": 0.0022403050457111802, "phrase": "passive_observation"}, {"score": 0.002159109661276094, "phrase": "object_properties"}, {"score": 0.0021491689260929917, "phrase": "view_parameters"}, {"score": 0.002134343389089625, "phrase": "fairly_unrestricted_setting"}, {"score": 0.0021049977753042253, "phrase": "subsequent_recognition_purposes"}], "paper_keywords": [""], "paper_abstract": "The purpose of cognitive systems is to produce a response to appropriate percepts. The response may be a direct physical action which may change the state of the system. It may be delayed in the form of a reconfiguration of internal models in relation to the interpreted context of the system. Or it may be to generate in a subsequent step a generalized symbolic representation which will allow its intentions of actions to be communicated to some other system. As important as the percepts, is the dependence upon context. A fundamental property of cognitive vision systems is that they shall be extendable. This requires that systems both acquire and store information about the environment autonomously on their own terms. The distributed organization foreseen for processing and for memory to allow learning, implies that later acquired information has to be stored in relation to earlier. The semantic character of the information which this requires, implies a storage with respect to similarity, and the availability of a metric. The paper discusses organization aspects of such systems, and proposes an architecture for cognitive systems. In this architecture, which consists of two major parts, the first part of the system, step by step performs a mapping from percepts onto actions or states. The central mechanism is the perception-action feedback cycle. In a learning phase, action precedes perception. The reason for this reversed causal direction is that action space is much less complex than percept space. It is easy to distinguish which percepts change as a function of an action or a state change. Percepts shall be mapped directly onto states or responses or functions involving these. The second part of the architecture deals with more invariant representations, or symbolic representations, which are derived mainly from system states and action states. Through active exploration of the environment, i.e. using perception-action learning, a system builds up concept spaces, defining the phenomena it can deal with. Information can subsequently be acquired by the system within these concept spaces without interaction, by extrapolation using passive observation or communication such as language. This structure has been implemented for the learning of object properties and view parameters in a fairly unrestricted setting, to be used for subsequent recognition purposes.", "paper_title": "Organization of architectures for cognitive vision systems", "paper_id": "WOS:000239148600004"}