{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "patient-centered_outcomes_research_institute"}, {"score": 0.004626255242038005, "phrase": "pcornet"}, {"score": 0.004186105377259855, "phrase": "electronic_health_data"}, {"score": 0.004130660282810338, "phrase": "comparative_effectiveness_research"}, {"score": 0.003813017794036879, "phrase": "pcori's_board"}, {"score": 0.0032489004068215407, "phrase": "electronic_health_records"}, {"score": 0.0030799988391729464, "phrase": "integrated_or_networked_delivery_systems"}, {"score": 0.002900426826591769, "phrase": "motivated_patients"}, {"score": 0.0026593184154220123, "phrase": "clinical_research"}, {"score": 0.002470987929071079, "phrase": "interventional_trials"}, {"score": 0.002295964130868963, "phrase": "new_national_resource"}, {"score": 0.0022057677637040396, "phrase": "patient-centered_cer"}], "paper_keywords": [""], "paper_abstract": "The Patient-Centered Outcomes Research Institute (PCORI) has launched PCORnet, a major initiative to support an effective, sustainable national research infrastructure that will advance the use of electronic health data in comparative effectiveness research (CER) and other types of research. In December 2013, PCORI's board of governors funded 11 clinical data research networks (CDRNs) and 18 patient-powered research networks (PPRNs) for a period of 18 months. CDRNs are based on the electronic health records and other electronic sources of very large populations receiving healthcare within integrated or networked delivery systems. PPRNs are built primarily by communities of motivated patients, forming partnerships with researchers. These patients intend to participate in clinical research, by generating questions, sharing data, volunteering for interventional trials, and interpreting and disseminating results. Rapidly building a new national resource to facilitate a large-scale, patient-centered CER is associated with a number of technical, regulatory, and organizational challenges, which are described here.", "paper_title": "Launching PCORnet, a national patient-centered clinical research network", "paper_id": "WOS:000337660600003"}