{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_solutions"}, {"score": 0.004457995891964028, "phrase": "tiny_components"}, {"score": 0.004395984840790689, "phrase": "arranged_set"}, {"score": 0.0040133278382101885, "phrase": "single_nano-machines"}, {"score": 0.0038751504050385183, "phrase": "traditional_communication_technologies"}, {"score": 0.003715579364728729, "phrase": "power_consumption"}, {"score": 0.003525291235622844, "phrase": "electromagnetic_or_acoustic_waves"}, {"score": 0.0034038593017883295, "phrase": "new_communication_paradigm"}, {"score": 0.0033682492486884364, "phrase": "novel_solutions"}, {"score": 0.0033330104902937413, "phrase": "molecular_transceivers"}, {"score": 0.00330972235893118, "phrase": "channel_models"}, {"score": 0.003042599375218838, "phrase": "better_understanding"}, {"score": 0.003021334228842501, "phrase": "nanonetwork_scenarios"}, {"score": 0.0029792474431139067, "phrase": "nanonetworks_features"}, {"score": 0.002896819408461957, "phrase": "traditional_communication_networks"}, {"score": 0.0028564621282167685, "phrase": "interesting_and_important_applications"}, {"score": 0.00268168157806506, "phrase": "short-range_communication"}, {"score": 0.0025711283781017424, "phrase": "long-range_communication"}, {"score": 0.002473786357109046, "phrase": "open_research_challenges"}, {"score": 0.0024137645015872952, "phrase": "network_components"}, {"score": 0.0023968838023247533, "phrase": "molecular_communication_theory"}, {"score": 0.0023469450817019, "phrase": "new_architectures"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["nanonetworks", " nanocommunication", " molecular communication"], "paper_abstract": "Nanotechnologies promise new solutions for several applications in biomedical, industrial and military fields. At nano-scale, a nano-machine can be considered as the most basic functional unit. Nano-machines are tiny components consisting of an arranged set of molecules, which are able to perform very simple tasks. NanonetWOFks. i.e., the interconnection of nano-machines are expected to expand the capabilities of single nano-machines by allowing them to cooperate and share information. Traditional communication technologies are not suitable for nanonetworks mainly due to the size and power consumption of transceivers, receivers and other components. The use of molecules, instead of electromagnetic or acoustic waves, to encode and transmit the information represents a new communication paradigm that demands novel solutions such as molecular transceivers, channel models or protocols for nanonetworks. In this paper, first the state-of-the-art in nano-machines, including architectural aspects, expected features of future nano-machines, and current developments are presented for a better understanding of nanonetwork scenarios. Moreover, nanonetworks features and components are explained and compared with traditional communication networks. Also some interesting and important applications for nanonetworks are highlighted to motivate the communication needs between the nano-machines. Furthermore, nanonetworks for short-range communication based on calcium signaling and molecular motors as well as for long-range communication based on pheromones are explained in detail. Finally, open research challenges, such as the development of network components, molecular communication theory, and the development of new architectures and protocols, are presented which need to be solved in order to pave the way for the development and deployment of narionetworks within the next couple of decades. (c) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Nanonetworks: A new communication paradigm", "paper_id": "WOS:000258436600002"}