{"auto_keywords": [{"score": 0.03514453998593996, "phrase": "mixed_strategies"}, {"score": 0.028312317972293805, "phrase": "proposed_global_router"}, {"score": 0.027183301840015005, "phrase": "box_router"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_vlsi_global_routing_problem"}, {"score": 0.004683073921949839, "phrase": "game_theory"}, {"score": 0.0040194764936614565, "phrase": "initial_routing"}, {"score": 0.0037627064621795514, "phrase": "main_task"}, {"score": 0.003217896008931311, "phrase": "particular_pure_strategy"}, {"score": 0.002909273771807531, "phrase": "gt"}, {"score": 0.0023943738132548797, "phrase": "mt"}, {"score": 0.0023694065215394593, "phrase": "shorter_runtime"}, {"score": 0.0023285383529595416, "phrase": "valid_solution"}, {"score": 0.0021947755130109696, "phrase": "experimental_results"}, {"score": 0.002149418970824546, "phrase": "valuable_technique"}, {"score": 0.0021049977753042253, "phrase": "global_routers"}], "paper_keywords": ["Global routing", " game theory", " rip-up and rerouting", " VLSI physical design"], "paper_abstract": "In this work we propose a game theory (GT)-based global router. It works in two steps: (i) Initial routing of all nets using maze routing with framing (MRF) and (ii) GT-based rip-up and reroute (R&R) process. In initial routing, the nets are divided into several small subsets which are routed concurrently using multithreading (MT). The main task of the GT-based R&R process is to eliminate congestion. Nets are considered as players and each player employs two pure strategies: (attempt to improve its spanning tree, and, do not attempt to improve its spanning tree). The nets also have mixed strategies whose values act as probabilities for them to select any particular pure strategy. The nets which select their first strategy will go through the R&R operation. We also propose an algorithm which computes the mixed strategies of nets. The advantage of using GT to select nets is that it reduces the number of nets and the number of iterations in the R&R process. The performance of the proposed global router was evaluated on ISPD'98 benchmarks and compared with two recent global routers, namely, Box Router 2.0 (configured for speed) and Side-winder. The results show that the proposed global router with MT has a shorter runtime to converge to a valid solution than that of Box Router 2.0. It also outperforms Side-winder in terms of routability. The experimental results demonstrated that GT is a valuable technique in reducing the runtime of global routers.", "paper_title": "A Game Theory-Based Heuristic for the Two-Dimensional VLSI Global Routing Problem", "paper_id": "WOS:000355330900006"}