{"auto_keywords": [{"score": 0.040801524583702814, "phrase": "shortest_path_routing"}, {"score": 0.00481495049065317, "phrase": "today's_ever-growing_networks"}, {"score": 0.004655285779819366, "phrase": "sound_theoretical_scalability_guarantees"}, {"score": 0.004475659507646842, "phrase": "routing_scheme"}, {"score": 0.004067635935640407, "phrase": "network_size"}, {"score": 0.00397714507836836, "phrase": "theoretical_scalability_characterizations"}, {"score": 0.003802135020791801, "phrase": "general_policy_routing"}, {"score": 0.0037595947142663997, "phrase": "current_and_future_networks"}, {"score": 0.003303177222901723, "phrase": "general_framework"}, {"score": 0.003266201217790818, "phrase": "policy_routing"}, {"score": 0.0031577303835881964, "phrase": "theoretical_scaling_properties"}, {"score": 0.0025928815987676535, "phrase": "compact_routing_tables"}, {"score": 0.002264982416465872, "phrase": "policy_violations"}, {"score": 0.0021049977753042253, "phrase": "relaxed_model"}], "paper_keywords": ["Compact routing", " policy routing", " routing algebras", " routing scalability"], "paper_abstract": "Today's ever-growing networks call for routing schemes with sound theoretical scalability guarantees. In this context, a routing scheme is scalable if the amount of memory needed to implement it grows significantly slower than the network size. Unfortunately, theoretical scalability characterizations only exist for shortest path routing, but for general policy routing that current and future networks increasingly rely on, very little understanding is available. In this paper, we attempt to fill this gap. We define a general framework for policy routing, and we study the theoretical scaling properties of three fundamental policy models within this framework. Our most important contributions are the finding that, contrary to shortest path routing, there exist policies that inherently scale well, and a separation between the class of policies that admit compact routing tables and those that do not. Finally, we ask to what extent memory size can be decreased by allowing paths to contain a certain bounded number of policy violations and, surprisingly, we conclude that most unscalable policies remain unscalable under the relaxed model as well.", "paper_title": "On the Scalability of Routing With Policies", "paper_id": "WOS:000363254100018"}