{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "adaptive_sustainable_enterprises"}, {"score": 0.004613940521007727, "phrase": "today's_dynamic_markets"}, {"score": 0.00439777299939725, "phrase": "ever-increasing_rates"}, {"score": 0.0032793933580835574, "phrase": "sustainability_objectives"}, {"score": 0.003244567402785763, "phrase": "adaptive_approaches"}, {"score": 0.003108911488613549, "phrase": "overarching_objective"}, {"score": 0.002220551141101661, "phrase": "context_aware_adaptive_and_sustainable_concepts"}, {"score": 0.0021049977753042253, "phrase": "prototypical_implementation"}], "paper_keywords": ["Enterprise", " Adaptive", " Sustainable", " Strategy", " Organization", " Process", " Information", " Transformation", " Framework", " Architecture", " Lifecycle", " Deliberate", " Emergent", " Context-aware"], "paper_abstract": "Enterprises that want to compete in today's dynamic markets need to be able to respond to the ever-increasing rates of change. At the same time enterprises strive to be ever more sustainable in terms of economic, environmental, societal, and cultural concerns. Enterprises are being challenged at all levels to meet the demands for sustainability and in a manner that can handle the complexity that is present. In this paper we suggest that enterprises need to integrate sustainability objectives with adaptive approaches to manage complexity and uncertainty. The overarching objective of the research is to explore how an enterprise can become both adaptive and sustainable by interweaving the deliberate and emergent in the context of strategy, organization, process, and information. This research seeks to model and develop several artefacts that assist with responses to complexity and uncertainty while also supporting goals of sustainability. In particular, we propose context aware adaptive and sustainable concepts, framework, lifecycle, architecture, and a prototypical implementation.", "paper_title": "Adaptive Sustainable Enterprises", "paper_id": "WOS:000343131900004"}