{"auto_keywords": [{"score": 0.04829495327940818, "phrase": "vr"}, {"score": 0.025399742676837155, "phrase": "longest_path"}, {"score": 0.009214609375493647, "phrase": "good_st-orientation"}, {"score": 0.004687645903373103, "phrase": "classical_representation"}, {"score": 0.004666756595735701, "phrase": "plane_graphs"}, {"score": 0.004502943680955863, "phrase": "main_focus"}, {"score": 0.004315835518772158, "phrase": "plane_graph_g"}, {"score": 0.004081385289516914, "phrase": "upper_bounds"}, {"score": 0.004018042673843149, "phrase": "plane_graph"}, {"score": 0.003757480190200645, "phrase": "open_problem"}, {"score": 0.0036335821512795026, "phrase": "trivial_upper_bounds"}, {"score": 0.003420735116653331, "phrase": "first_vr_construction"}, {"score": 0.003397866151093552, "phrase": "non-trivial_graph_class"}, {"score": 0.0030451958332949735, "phrase": "special_properties"}, {"score": 0.002911961514073769, "phrase": "previous_results"}, {"score": 0.002892484028902088, "phrase": "graph_class"}, {"score": 0.0025121787711016746, "phrase": "independent_interest"}, {"score": 0.002282133615508424, "phrase": "np"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Plane graph", " Plane triangulation", " Visibility representation", " st-orientation"], "paper_abstract": "The visibility representation (VR for short) is a classical representation of plane graphs. The VR has various applications and has been extensively studied in the literature. A main focus of the study is to minimize the size of the VR. It is known that there exists a plane graph G with n vertices where any VR of G requires a size at least left perpendicular2n/3right perpendicular x (left perpendicular4n/3right perpendicular - 3). For upper bounds, it is known that every plane graph has a VR with size at most left perpendicular2/3nright perpendicular x (2n - 5), and a VR with size at most (n - 1) x left perpendicular4/3nright perpendicular. It has been an open problem to find a VR with both height and width simultaneously bounded away from the trivial upper bounds (namely of size c(h)n x c(w)n with c(h) < 1 and c(w) < 2). In this paper, we provide the first VR construction for a non-trivial graph class that simultaneously bounds both the height and the width. We prove that every 4-connected plane graph has a VR with height <= 3n/4 + 2 inverted right perpendicular root ninverted left perpendicular + 4 and width <= inverted right perpendicular3n/2inverted left perpendicular. Our VR algorithm is based on an st-orientation of 4-connected plane graphs with special properties. The area of the VR presented in this paper is larger than the area of some of the previous results for this graph class. However, bounding one dimension of the VR only requires finding a good st-orientation or a good dual s*t*-orientation of G. On the other hand, bounding both dimensions of the VR requires finding a good st-orientation and a good dual s*t*-orientation of G at the same time, and hence is far more challenging. Since the st-orientation is a very useful concept in other applications, this result may be of independent interest. Reducing the height (the width, respectively) of the VR is the same as reducing the length of the longest path in an st-orientation of G (dual st-orientation, respectively). We show that it's NP-complete to find an st-orientation of a 2-connected plane graph that minimizes the sum of the length of the longest path in the orientation and the length of the longest path in its dual orientation. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Compact visibility representation of 4-connected plane graphs", "paper_id": "WOS:000306726600008"}