{"auto_keywords": [{"score": 0.02998999927405984, "phrase": "trust_network"}, {"score": 0.00481495049065317, "phrase": "autonomy-oriented_partner_finding"}, {"score": 0.004539005582217309, "phrase": "specific_entities"}, {"score": 0.004084829853870028, "phrase": "file_sharing"}, {"score": 0.004050514095922329, "phrase": "task_allocation"}, {"score": 0.003982741546775355, "phrase": "previous_studies"}, {"score": 0.0032524418285459324, "phrase": "partner-finding_problem"}, {"score": 0.0027123819773059127, "phrase": "trust_relationships"}, {"score": 0.0026112013707473938, "phrase": "autonomy-oriented_computing"}, {"score": 0.0025137856138000014, "phrase": "behavior-based_trust_relationship_updates"}, {"score": 0.002280990744438186, "phrase": "detailed_formulations"}, {"score": 0.00214995338990007, "phrase": "proposed_trust_relationship_update_mechanism"}, {"score": 0.0021049977753042253, "phrase": "partner_finding"}], "paper_keywords": ["Dynamics", " Partner finding", " Trust relationships", " Autonomy-Oriented Computing (AOC)"], "paper_abstract": "The problem of finding partners is concerned with how to identify some specific entities (agents) from a group that will be able to provide certain requested services. This problem can readily be found in applications such as file sharing and task allocation in open and/or distributed environments. Previous studies have shown that entities can effectively select their partners by means of evaluating their mutual trust relationships. Here a trust relationship between two entities refers to the establishment of one entity's belief that another entity will be able to accomplish a service of interest. In this work, we aim to study how the partner-finding problem can be more effectively and efficiently solved by allowing entities to autonomously update their beliefs and hence trust relationships based on their past experiences. In doing so, we introduce the notion of a trust network in which nodes correspond to entities and links represent trust relationships between entities. We apply the methodology of Autonomy-Oriented Computing (AOC) to model and simulate the behavior-based trust relationship updates of entities over time, as well as the structural characteristics of the trust network as being established by entities. Besides providing detailed formulations, we perform a series of experiments to evaluate the impacts of the proposed trust relationship update mechanism on the performance of partner finding.", "paper_title": "A dynamic trust network for autonomy-oriented partner finding", "paper_id": "WOS:000292000700005"}