{"auto_keywords": [{"score": 0.040099978096092045, "phrase": "current_re_tools"}, {"score": 0.00481495049065317, "phrase": "significant_number"}, {"score": 0.004692647062494403, "phrase": "different_features"}, {"score": 0.0046128342233041405, "phrase": "existing_re_tool_lists"}, {"score": 0.0045603777806863775, "phrase": "detailed_information"}, {"score": 0.00430687080979172, "phrase": "tool_developers"}, {"score": 0.0037435277798679722, "phrase": "concrete_capabilities"}, {"score": 0.00346513764367632, "phrase": "international_guideline"}, {"score": 0.00342568771304873, "phrase": "major_tool_vendors"}, {"score": 0.003386685386000115, "phrase": "descriptive_statistical_study"}, {"score": 0.0032911048705713307, "phrase": "bivariate_correlation_tests"}, {"score": 0.0032073835392641627, "phrase": "different_variables"}, {"score": 0.0031168475330441894, "phrase": "neutral_assessment"}, {"score": 0.0030901868389687534, "phrase": "interrater_reliability_analysis"}, {"score": 0.002884925971272727, "phrase": "proprietary_license"}, {"score": 0.0027715286135219933, "phrase": "web_access"}, {"score": 0.00273995357773402, "phrase": "requirements_elicitation"}, {"score": 0.0027165079504297726, "phrase": "best_supported_category"}, {"score": 0.002254892677810906, "phrase": "useful_ideas"}, {"score": 0.0021786592967334506, "phrase": "appropriate_re_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Requirements engineering tools", " Survey", " ISO/IEC TR 24766:2009"], "paper_abstract": "Context: There is a significant number of requirements engineering (RE) tools with different features and prices. However, existing RE tool lists do not provide detailed information about the features of the tools that they catalogue. It would therefore be interesting for both practitioners and tool developers to be aware of the state-of-the-art as regards RE tools. Objective: This paper presents the results of a survey answered by RE tool vendors. The purpose of the survey was to gain an insight into how current RE tools support the RE process by means of concrete capabilities, and to what degree. Method: The ISO/IEC TR 24766:2009 is a framework for assessing RE tools' capabilities. A 146-item questionnaire based principally on the features covered by this international guideline was sent to major tool vendors worldwide. A descriptive statistical study was then carried out to provide comparability, and bivariate correlation tests were also applied to measure the association between different variables. A sample of the tools was subjected to neutral assessment and an interrater reliability analysis was performed to ensure the reliability of the results. Results: The 38 participants sent back their answers. Most tools are delivered under a proprietary license, and their licenses are not free. A growing number of them facilitate Web access. Moreover, requirements elicitation exemplifies the best supported category of features in this study, whereas requirements modeling and management are the most badly supported categories. Conclusion: The RE process seems to be well covered by current RE tools, but there is still a certain margin for amelioration, principally with regard to requirements modeling, open data model and data integration features. These subjects represent areas for improvement for RE tool developers. Practitioners might also obtain useful ideas from the study to be taken into account when selecting an appropriate RE tool to be successfully applied to their work. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Requirements engineering tools: Capabilities, survey and assessment", "paper_id": "WOS:000307133600007"}