{"auto_keywords": [{"score": 0.04159267344622788, "phrase": "uaq_problem"}, {"score": 0.0060501437542475655, "phrase": "computational_complexity"}, {"score": 0.00481495049065317, "phrase": "complexity_analysis"}, {"score": 0.004773692073488661, "phrase": "user_authorization_query_problem"}, {"score": 0.004692230966925177, "phrase": "rbac"}, {"score": 0.004533427352547707, "phrase": "optimum_set"}, {"score": 0.004361163586439822, "phrase": "particular_set"}, {"score": 0.004159446063902181, "phrase": "key_issue"}, {"score": 0.0040708542958968605, "phrase": "users'_access_requests"}, {"score": 0.0037348894128879082, "phrase": "optimization_objective"}, {"score": 0.0032398798149196432, "phrase": "optimization_objectives"}, {"score": 0.0028963961037320805, "phrase": "permission-cardinality_constraints"}, {"score": 0.002437525632451029, "phrase": "additional_constraints"}, {"score": 0.0023145690608400425, "phrase": "intractable_cases"}, {"score": 0.002255431275670053, "phrase": "proposed_approach"}, {"score": 0.002236055625099805, "phrase": "static_pruning"}, {"score": 0.0022168460543913787, "phrase": "preprocessing_and_the_depth-first_search_based_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Access control", " RBAC", " User Authorization Query", " Computational complexity", " Role-cardinality constraint", " Permission-cardinality constraint"], "paper_abstract": "The User Authorization Query (UAQ) problem for RBAC is to determine whether there exists an optimum set of roles to be activated to provide a particular set of permissions requested by a user. It is a key issue related to efficiently handling users' access requests. Previous definitions of the UAQ problem have considered only the optimization objective for the number of permissions whereas the optimization objective for the number of roles, which is also equally important, has been largely ignored. Moreover, little attention has been given to the computational complexity of the UAQ problem that considers the optimization objectives for both the numbers of permissions and roles. In this paper, we propose a more comprehensive definition of the UAQ problem, which includes irreducibility, role-cardinality and permission-cardinality constraints, and consider both these optimization objectives together. In particular, we study the computational complexity of the UAQ problem by dividing it into three subcases: exact match, safe match and available match, and show that many instances in each subcase with additional constraints are intractable. We also propose an approach for solving the intractable cases of the UAQ problem; the proposed approach incorporates static pruning, preprocessing and the depth-first search based algorithm to significantly reduce the running time. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Towards complexity analysis of User Authorization Query problem in RBAC", "paper_id": "WOS:000347763300007"}