{"auto_keywords": [{"score": 0.04179789452876998, "phrase": "ttrp"}, {"score": 0.037155418648029216, "phrase": "single_truck"}, {"score": 0.00481495049065317, "phrase": "simulated_annealing_heuristic"}, {"score": 0.004504969093304219, "phrase": "simulated_annealing"}, {"score": 0.004357511171877593, "phrase": "truck_and_trailer_routing_problem"}, {"score": 0.004145287175409325, "phrase": "vehicle_routing_problem"}, {"score": 0.00321114539085481, "phrase": "widespread_applications"}, {"score": 0.0031059056048637727, "phrase": "vrp."}, {"score": 0.0028895324165046166, "phrase": "ttrp."}, {"score": 0.0027031706928674092, "phrase": "tabu_search"}, {"score": 0.0023656467839555458, "phrase": "computational_time"}, {"score": 0.0023136311468961125, "phrase": "proposed_sa_heuristic"}, {"score": 0.0022253345930383257, "phrase": "prior_studies"}, {"score": 0.0021050673656505346, "phrase": "ts"}], "paper_keywords": ["Vehicle routing problem", " Truck and trailer routing problem", " Simulated annealing", " Heuristic"], "paper_abstract": "In this study, we consider the application of a simulated annealing (SA) heuristic to the truck and trailer routing problem (TTRP), a variant or the vehicle routing problem (VRP). In the TTRP, some customers can be serviced by either a complete vehicle (that is, a truck pulling a trailer) or a single truck. while others can only be serviced by a single truck for various reasons. SA has seen widespread applications to various combinatorial optimization problems, including the VRP. However, to our best knowledge, it has not been applied to the TTRP. So far. all the best known results for benchmark TTRP instances were obtained using tabu search (TS). We applied SA to the TTRP and obtained 17 best solutions to the 21 benchmark TTRP benchmark problems, including 11 new best solutions. Moreover, the computational time required by the proposed SA heuristic is less than those reported in prior studies. The results suggest that SA is competitive with TS on solving the TTRP. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Solving the truck and trailer routing problem based on a simulated annealing heuristic", "paper_id": "WOS:000262882500029"}