{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "continuous-time_analog_filters"}, {"score": 0.032296702618043426, "phrase": "plateau_search"}, {"score": 0.004535124351828787, "phrase": "novel_algorithm"}, {"score": 0.0039911102918360995, "phrase": "present_exploration-based_analog-synthesis_methods"}, {"score": 0.0038043055953253047, "phrase": "diverse_constraint-satisfying_designs"}, {"score": 0.0036993855514735746, "phrase": "three-step_refinement_process"}, {"score": 0.003640730820018083, "phrase": "poor-quality_solution-space_regions"}, {"score": 0.003456427643307904, "phrase": "parameter-domain_pruning"}, {"score": 0.0034016119212097826, "phrase": "parameter_subdomains"}, {"score": 0.003229374325577207, "phrase": "interval_arithmetic"}, {"score": 0.003190878119415192, "phrase": "proposed_simplified_affine_transformation_operators"}, {"score": 0.0031402604946939743, "phrase": "second_step"}, {"score": 0.0031028232755683674, "phrase": "variable_subdomains"}, {"score": 0.0028529310661977577, "phrase": "solution-space_regions"}, {"score": 0.00255068452076921, "phrase": "descendant-gradient-based_search"}, {"score": 0.0023079225317714815, "phrase": "adaptive-sampling_step_length"}], "paper_keywords": ["algorithms", " analog filters", " optimization", " synthesis"], "paper_abstract": "This paper presents a novel algorithm for synthesis of continuous-time analog filters. The goal is to find as many \"very good\" design points as possible without requiring feasible designs as starting points or any other additional designer knowledge as input. This problem is challenging for present exploration-based analog-synthesis methods, including existing commercial tools, which have difficulties in locating diverse constraint-satisfying designs. The proposed algorithm conducts a three-step refinement process, in which poor-quality solution-space regions are eliminated through different strategies. It starts with the step of parameter-domain pruning, which identifies parameter subdomains that are more likely to produce many feasible solution points. Domains are found using interval arithmetic and the proposed simplified affine transformation operators. In the second step, selected variable subdomains are searched using plateau search, a novel exploration technique described in this paper. The algorithm addresses the three main types of solution-space regions: 1) convex, quasi-convex, and delta-convex regions; 2) rifts; and 3) plateau. The technique expands descendant-gradient-based search with a systematic way of sampling plateau. Finally, promising regions that remained after step 2 are further refined during the step of search with adaptive-sampling step length. Using four filter examples, experiments observed the quality of results and convergence of synthesis. Plateau search was also experimented for synthesis of two Delta Sigma modulators.", "paper_title": "Refinement-based synthesis of continuous-time analog filters through successive domain pruning, plateau search, and adaptive sampling", "paper_id": "WOS:000239367700001"}