{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "achievable_rates"}, {"score": 0.011142455699295029, "phrase": "relay_nodes"}, {"score": 0.007527685087463013, "phrase": "scaling_law"}, {"score": 0.005939629815836143, "phrase": "low_snr_regime"}, {"score": 0.00566999822265631, "phrase": "network_training"}, {"score": 0.004959046436759457, "phrase": "fading_block"}, {"score": 0.00474953919834177, "phrase": "power-constrained_wireless_sensory_relay_networks"}, {"score": 0.004583579470330216, "phrase": "multiple_intermediate_relay_nodes"}, {"score": 0.004435514622798228, "phrase": "scaling_laws"}, {"score": 0.00441130431691048, "phrase": "power-constrained_wireless_relay_networks"}, {"score": 0.0042571127331582975, "phrase": "channel-state_information"}, {"score": 0.004153520149706423, "phrase": "forward_channels"}, {"score": 0.004063547375196532, "phrase": "joint_asymptotic_regime"}, {"score": 0.003836713494343402, "phrase": "snr"}, {"score": 0.0036419834462626125, "phrase": "relaying_scheme"}, {"score": 0.0034762895694105404, "phrase": "source_node"}, {"score": 0.0034478392374444177, "phrase": "destination_node_broadcast_training_symbols"}, {"score": 0.003382354267177914, "phrase": "channel_estimation"}, {"score": 0.003264010423431402, "phrase": "equivalent_source-to-destination_channel_model"}, {"score": 0.00314979417863877, "phrase": "rho_l"}, {"score": 0.0031069334778456633, "phrase": "transmission_energy"}, {"score": 0.0030229485340586473, "phrase": "achievable_rate"}, {"score": 0.0029736479837154843, "phrase": "coherent_relaying"}, {"score": 0.0028853364056356584, "phrase": "relay_networks"}, {"score": 0.0027996401456881806, "phrase": "power-constrained_wideband_relay_networks"}, {"score": 0.002776712155766836, "phrase": "frequency-selective_fading"}, {"score": 0.0026576090447523247, "phrase": "af"}, {"score": 0.002564505790176378, "phrase": "scaling_behavior"}, {"score": 0.002304408912077443, "phrase": "wideband_relay_networks"}, {"score": 0.002266800209906779, "phrase": "power_allocation_policies"}], "paper_keywords": ["cooperative relaying", " network training", " scaling law", " wideband regime", " wireless sensory relay network."], "paper_abstract": "A wireless sensory relay network consists of one source node, one destination node and multiple intermediate relay nodes. In this paper, we study the achievable rates and the scaling laws of power-constrained wireless relay networks in the wideband regime, assuming that relay nodes have no a priori knowledge of channel-state information (CSI) for both the backward channels and the forward channels. We examine the achievable rates in the joint asymptotic regime of the number of relay nodes n, the channel coherence interval L, and the bandwidth W (or the SNR per link rho). We first study narrowband relay networks in the low SNR regime. We investigate a relaying scheme, namely amplify-and-forward (AF) with network training, in which the source node and the destination node broadcast training symbols and each relay node carries out channel estimation and then applies AF relaying to relay information. We provide an equivalent source-to-destination channel model, and characterize the corresponding achievable rate. Our findings show that when rho L, proportional to the transmission energy in each fading block, is bounded below, the achievable rate has the same scaling order as in coherent relaying, thus enabling us to characterize the scaling law of the relay networks in the low SNR regime. We then generalize the study to power-constrained wideband relay networks, where frequency-selective fading is taken into account. Again, the focus is on the achievable rates by using AF with network training for information relaying. In particular, we examine the scaling behavior of the achievable rates corresponding to two power allocation policies across the frequency subbands at relay nodes, namely, a simple equal power allocation policy and the optimal power allocation policy. We identify the conditions under which the scaling law of the wideband relay networks can be achieved by both power allocation policies. Somewhat surprising, our findings indicate that these two power allocation policies result in achievable rates of the same scaling order, and the scaling law can be characterized under the condition that L/W, proportional to the energy per fading block per subband, is bounded below, and that W is sublinear in n.", "paper_title": "Achievable rates and scaling laws of power-constrained wireless sensory relay networks", "paper_id": "WOS:000240076700014"}