{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hausdorff_distance"}, {"score": 0.007253725039844252, "phrase": "b._we"}, {"score": 0.004715702140552199, "phrase": "first_part"}, {"score": 0.004308630865024719, "phrase": "translation_t"}, {"score": 0.003559199464487982, "phrase": "nearest_ball"}, {"score": 0.003413800638453572, "phrase": "standard_setting"}, {"score": 0.0030971473486283664, "phrase": "standard_approach"}, {"score": 0.0028392545452904762, "phrase": "second_part"}, {"score": 0.0025051107939496704, "phrase": "hausdorff"}, {"score": 0.002461852774571558, "phrase": "efficient_approximation_algorithms"}, {"score": 0.002427826856342292, "phrase": "minimum_rms"}, {"score": 0.0023859534478427313, "phrase": "hausdorff_distances"}, {"score": 0.002272501735900584, "phrase": "fast_algorithm"}, {"score": 0.002248899833549883, "phrase": "summed_hausdorff_distance"}, {"score": 0.0022101055924375725, "phrase": "deterministic_efficient_dynamic_data_structure"}, {"score": 0.0021050098440934767, "phrase": "rd"}], "paper_keywords": [""], "paper_abstract": "We study the shape matching problem under the Hausdorff distance and its variants. In the first part of the article, we consider two sets A, B of balls in R-d, d = 2, 3, and wish to find a translation t that minimizes the Hausdorff distance between A + t, the set of all balls in A shifted by t, and B. We consider several variants of this problem. First, we extend the notion of Hausdorff distance from sets of points to sets of balls, so that each ball has to be matched with the nearest ball in the other set. We also consider the problem in the standard setting, by computing the Hausdorff distance between the unions of the two sets (as point sets). Second, we consider either all possible translations t (as is the standard approach), or consider only translations that keep the balls of A t disjoint from those of B. We propose several exact and approximation algorithms for these problems. In the second part of the article, we note that the Hausdorff distance is sensitive to outliers, and thus consider two variants that are more robust: the root-mean-square (rms) and the summed Hausdorff distance. We propose efficient approximation algorithms for computing the minimum rms and the minimum summed Hausdorff distances under translation, between two point sets in R-d. In order to obtain a fast algorithm for the summed Hausdorff distance, we propose a deterministic efficient dynamic data structure for maintaining an E-approximation of the 1-median of a set of points in Rd, under insertions and deletions.", "paper_title": "Hausdorff Distance under Translation for Points and Balls", "paper_id": "WOS:000284382400015"}