{"auto_keywords": [{"score": 0.04088899068598468, "phrase": "control_strategy"}, {"score": 0.00481495049065317, "phrase": "constrained_movement"}, {"score": 0.0047689174754929195, "phrase": "rehabilitation_exercises"}, {"score": 0.004655742198075387, "phrase": "mechanical_interaction"}, {"score": 0.00433200902751133, "phrase": "intentional_interaction"}, {"score": 0.004069631519385246, "phrase": "desirable_forces"}, {"score": 0.003953932197201054, "phrase": "external_forces"}, {"score": 0.003750260412839128, "phrase": "feasible_one"}, {"score": 0.003714368305523811, "phrase": "natural_systems"}, {"score": 0.00334144503360907, "phrase": "cranking_mechanism"}, {"score": 0.0029343925814926787, "phrase": "two-link_thigh"}, {"score": 0.0026395715432958665, "phrase": "rotating_passive_load"}, {"score": 0.0022626835039082746, "phrase": "piecewise_linear_inputs"}, {"score": 0.0021049977753042253, "phrase": "natural_disorders"}], "paper_keywords": [""], "paper_abstract": "Most human activities involve the mechanical interaction of the body with the environment, or objects in the environment. The intentional interaction usually involves making contact, breaking contact, maintaining contact and applying desirable forces, or passively responding to external forces. A control strategy is explored here that may be a feasible one in natural systems. Philosophically, this control strategy is similar to the ones in puppets and marionettes. The method is applied to a cranking mechanism similar to pedaling a bicycle. Two applications are presented in pedaling and the ability to provide exercises in rehabilitation. The dynamics and control of a two-link thigh and leg model that is in contact with a pedal is formulated. The pedal, in turn, activates a rotating passive load, made of inertial, viscous and elastic components. At the contact between the foot and the pedal, forces of contact, as well as the trajectory of the pedal, are controlled. Piecewise linear inputs are adequate for maintaining the exercise. The performance of the system in some natural disorders is analyzed by simulation.", "paper_title": "Simulation of control and synthesis of a constrained movement towards rehabilitation exercises", "paper_id": "WOS:000309510300004"}