{"auto_keywords": [{"score": 0.03872770284886719, "phrase": "exponential_crossover_operator"}, {"score": 0.03829477508328847, "phrase": "superior_performance"}, {"score": 0.03003862697505332, "phrase": "current_exponential_crossover_operator"}, {"score": 0.00481495049065317, "phrase": "exponential_crossover"}, {"score": 0.00475924837336259, "phrase": "differential_evolutions"}, {"score": 0.004542780650208743, "phrase": "differential_evolution"}, {"score": 0.00357806560856829, "phrase": "binomial_operator"}, {"score": 0.003516079377293321, "phrase": "complex_high_dimensional_problems"}, {"score": 0.0033952989364738353, "phrase": "commonly_used_definition"}, {"score": 0.002658068304632523, "phrase": "linearly_scalable_exponential_crossover_operator"}, {"score": 0.00249293148301837, "phrase": "consecutive_dimensions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Differential evolution (DE)", " Exponential crossover", " Large scale optimization", " Linearly scalable exponential crossover operator (LS-EXP)", " Numerical optimization"], "paper_abstract": "Since the introduction in 1995, Differential evolution (DE) has drawn the attention of many researchers all over the world. Even though binomial (uniform) and exponential (modular two-point) crossover operators have been proposed simultaneously, binomial crossover has been more frequently used. Recently, the exponential crossover operator demonstrated superior performance over the binomial operator when solving complex high dimensional problems. We observe that the commonly used definition of exponential crossover operator does not scale impractically with the dimensionality of the problem being solved. Motivated by these observations, in this research, we investigate the performance of the current exponential crossover operator (EXP) and demonstrate its deficiencies. Consequently, a linearly scalable exponential crossover operator (LS-EXP) based on a number of consecutive dimensions to crossover is defined. Our numerical results on the most recent benchmark problems with dimensions ranging from 50 to 1000 show superior performance of the LS-EXP over the current exponential crossover operator, EXP. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Empirical investigations into the exponential crossover of differential evolutions", "paper_id": "WOS:000209361000003"}