{"auto_keywords": [{"score": 0.041562269310917936, "phrase": "dmis"}, {"score": 0.004815133171225198, "phrase": "distributed"}, {"score": 0.004567990533989851, "phrase": "emerging_web-based_applications"}, {"score": 0.003884479830773329, "phrase": "broad_range"}, {"score": 0.003853115465608543, "phrase": "technological_solutions"}, {"score": 0.0037301606780397456, "phrase": "multimedia_information"}, {"score": 0.0034676182423067307, "phrase": "new_research"}, {"score": 0.003384262486955773, "phrase": "basic_research"}, {"score": 0.003356923403930231, "phrase": "applied_technology"}, {"score": 0.0031974502006267163, "phrase": "single_monolithic_end-to-end_architecture"}, {"score": 0.0028425481299483254, "phrase": "integrated_end-to-end_qop"}, {"score": 0.002696479050724968, "phrase": "real_world_constraints"}, {"score": 0.002674681176379472, "phrase": "system-wide_performance_requirements"}, {"score": 0.0026103363762901423, "phrase": "implementation_challenges"}, {"score": 0.002506507889886399, "phrase": "ultimate_objective"}, {"score": 0.002466139325703204, "phrase": "comprehensive_end-to-end_qop_management"}, {"score": 0.00233936726307301, "phrase": "dmis_sub-system_components"}, {"score": 0.002148172508419683, "phrase": "high_level_distributed_architecture"}, {"score": 0.0021049977753042253, "phrase": "critical_functionality"}], "paper_keywords": ["multimedia documents", " semantic web", " resource allocations", " QoS management", " distributed systems", " information security", " broadband networking"], "paper_abstract": "Emerging Web-based applications require distributed multimedia information system (DMIS) infrastructures. Examples of such applications abound in the domains of medicine, entertainment, manufacturing, e-commerce, as well as military and critical national infrastructures. Development of DMIS for such applications need a broad range of technological solutions for organizing, storing, and delivering multimedia information in an integrated, secure and timely manner with guaranteed end-to-end (E2E) quality of presentation (QoP). DMIS are viewed as catalysts for new research in many areas, ranging from basic research to applied technology. This view is a result of the fact that no single monolithic end-to-end architecture for DMIS can meet the wide spectrum of characteristics and requirements of various Web-based multimedia applications. One size does not fit all in this medium of communication. Management of integrated end-to-end QoP and ensuring information security in DMIS, when viewed in conjunction with real world constraints and system-wide performance requirements, present formidable research and implementation challenges. These challenges encompass all the sub-system components of a DMIS. The ultimate objective of achieving a comprehensive end-to-end QoP management relies on the performance and allocation of resources of each of the DMIS sub-system components including networks, databases, and end-systems. In this paper, we elaborate on these challenges and present a high level distributed architecture aimed at providing the critical functionality for a DMIS.", "paper_title": "Distributed multimedia information systems: an end-to-end perspective", "paper_id": "WOS:000245133800004"}