{"auto_keywords": [{"score": 0.004293336465549723, "phrase": "novel_compound"}, {"score": 0.004046020290832207, "phrase": "different_substituents"}, {"score": 0.0038737214010638745, "phrase": "density_functional_theory_method"}, {"score": 0.0037679023889496885, "phrase": "magnetic_criterion"}, {"score": 0.003650488388949457, "phrase": "z_direction"}, {"score": 0.003399466007862412, "phrase": "topological_properties"}, {"score": 0.003319675107116333, "phrase": "molecules_theory"}, {"score": 0.0032161835102640372, "phrase": "ch_groups"}, {"score": 0.0031782087629067686, "phrase": "nitrogen_atoms"}, {"score": 0.003140680985599885, "phrase": "tricyclic_core"}, {"score": 0.002947868524740683, "phrase": "maximum_number"}, {"score": 0.0029246121262946384, "phrase": "n_atoms"}, {"score": 0.0028222016727557087, "phrase": "largest_aromaticity"}, {"score": 0.002788865808981643, "phrase": "best_stability"}, {"score": 0.002408623172021922, "phrase": "energetic_performance"}, {"score": 0.0023058910418682676, "phrase": "estimated_specific_impulse"}, {"score": 0.0021049990292831837, "phrase": "hmx"}], "paper_keywords": ["Analogues", " Aromaticity", " Derivatives", " S-heptazine", " Stability"], "paper_abstract": "s-heptazine is one of the most attractive polycyclic C-N precursors for graphitic carbon nitride materials (CNx). In this paper in order to find the relationships between the structure, aromaticity, and stability for this novel compound, its analogues with three conjoint six-membered rings (I similar to V) and derivatives with different substituents (VI-1 similar to VI-5) were investigated using the density functional theory method. Aromaticity was predicted using the magnetic criterion iso-chemical shielding surface in the Z direction (ICSSzz) obtained with the gauge-independent atomic orbital (GIAO) method. Stability was estimated by the band gap and the topological properties obtained from the atoms in molecules theory. Results show that replacement of the CH groups with the nitrogen atoms in the tricyclic core enhances both the aromaticity and the stability. s-heptazine (VI) that has the maximum number of N atoms among analogues I similar to VI possesses the largest aromaticity and the best stability. Substitutions of -NH2, -NHNH2, and -N-3 groups increase not only the aromaticity but also the stability; -NO2 increases the aromaticity while decreases the stability; -CN decreases both the aromaticity and the stability. Furthermore, the energetic performance of VI-1 similar to VI-5 was evaluated according to the estimated specific impulse (Is). The obtained Is has the order of VI-5>VI-4>VI-3>VI>VI-1>VI-2. The Is of VI-5 is higher than that of HMX (1, 3, 5, 7-tetranitro-1, 3, 5, 7-tetraazacyclooctane).", "paper_title": "Structure, aromaticity, stability, and energetic performance of the analogues and derivatives of s-heptazine", "paper_id": "WOS:000340869400020"}