{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "school-wide_computational_thinking"}, {"score": 0.0043161190928529755, "phrase": "elementary_school_teachers"}, {"score": 0.004263972370406983, "phrase": "limited_computer_science_experience"}, {"score": 0.004186926251483987, "phrase": "high-need_school"}, {"score": 0.003916098498242888, "phrase": "cross-case_analysis"}, {"score": 0.00386876598761639, "phrase": "different_instructional_contexts"}, {"score": 0.0035530197642369464, "phrase": "multiple_observations"}, {"score": 0.00342568771304873, "phrase": "major_themes"}, {"score": 0.0029066973917258655, "phrase": "computing_education"}, {"score": 0.00218334762335187, "phrase": "peer_collaboration"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computational thinking", " Computing", " Struggling learners", " Diverse learners", " Content integration"], "paper_abstract": "The purpose of this study was to investigate how elementary school teachers with limited computer science experience in a high-need school integrated computational thinking into their instruction. The researchers conducted a cross-case analysis across different instructional contexts (e.g., general education classrooms, library, art) that included multiple observations and interviews over four months. Major themes included: (a) a wide range of implementation models emerged depending on teaching contexts, (b) ongoing professional development and embedded coaching resulted in increasing participation in computing education, (c) teachers and administrators viewed barriers to implementing computing from a problem solving framework, and (d) struggling learners, including students with disabilities and those living in poverty, benefitted from computing education that included scaffolding, modeling, and peer collaboration. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Supporting all learners in school-wide computational thinking: A cross-case qualitative analysis", "paper_id": "WOS:000349723200022"}