{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "software_tools"}, {"score": 0.0497491013599731, "phrase": "analogical_design"}, {"score": 0.004716113134313215, "phrase": "creative_design"}, {"score": 0.00455585162011571, "phrase": "design_domain"}, {"score": 0.003912712778141845, "phrase": "source_domain_stimuli"}, {"score": 0.0036764506727132253, "phrase": "design_process"}, {"score": 0.0036510928952124522, "phrase": "negative_ways"}, {"score": 0.003551392586900308, "phrase": "information_and_interaction_needs"}, {"score": 0.0034544053534458093, "phrase": "user_requirements"}, {"score": 0.0031680109156103334, "phrase": "different_domains"}, {"score": 0.0030390745780621503, "phrase": "creativity_support_tools"}, {"score": 0.0030076664326204013, "phrase": "human-computer_interaction"}, {"score": 0.002835703398546821, "phrase": "information_content"}, {"score": 0.0026276369627747896, "phrase": "interaction_qualities"}, {"score": 0.0026004698404274483, "phrase": "tools_support"}, {"score": 0.002451730979693715, "phrase": "tool_developers"}, {"score": 0.002401286805515306, "phrase": "key_requirements"}, {"score": 0.0021867999937268084, "phrase": "analogical_design_support_tools"}, {"score": 0.002119640369431708, "phrase": "source_information"}], "paper_keywords": ["Analogical Thinking", " Creativity Support Tools", " Design by Analogy", " Design Support Tools", " User Requirements"], "paper_abstract": "One mode of creative design is for designers to draw analogies that connect the design domain (e.g., a mechanical device) to some other domain from which inspiration is drawn (e.g., a biological system). The identification and application of analogies can be supported by software tools that store, structure, present, or propose source domain stimuli from which such analogies might be constructed. For these tools to be effective and not impact the design process in negative ways, they must fit well with the information and interaction needs of their users. However, the user requirements for these tools are seldom explicitly discussed. Furthermore, the literature that supports the identification of such requirements is distributed across a number of different domains, including those that address analogical design (especially biomimetics), creativity support tools, and human-computer interaction. The requirements that these literatures propose can be divided into those that relate to the information content that the tools provide (e.g., level of abstraction or mode of representation) and those that relate to the interaction qualities that the tools support (e.g., accessibility or shareability). Examining the relationships between these requirements suggests that tool developers should focus on satisfying the key requirements of open-endedness and accessibility while managing the conflicts between the other requirements. Attention to these requirements and the relationships between them promises to yield analogical design support tools that better permit designers to identify and apply source information in their creative work.", "paper_title": "Information and interaction requirements for software tools supporting analogical design", "paper_id": "WOS:000354032400007"}