{"auto_keywords": [{"score": 0.045654224554975205, "phrase": "data_points"}, {"score": 0.00481495049065317, "phrase": "directly_manipulating_spatializations"}, {"score": 0.004751889650408546, "phrase": "high-dimensional_data"}, {"score": 0.0045877173513910055, "phrase": "parametric_projection_algorithms"}, {"score": 0.004220086640742953, "phrase": "alternative_structures"}, {"score": 0.0038309141193444015, "phrase": "guessing_game"}, {"score": 0.003747575730190958, "phrase": "decisive_interactions"}, {"score": 0.003698442219929622, "phrase": "user_interactions"}, {"score": 0.0036660436272785476, "phrase": "algorithmic_input"}, {"score": 0.0036179751816682454, "phrase": "key_component"}, {"score": 0.00355485940716082, "phrase": "parametric_interaction"}, {"score": 0.0031845067058084613, "phrase": "underlying_statistical_model"}, {"score": 0.0024130437638400404, "phrase": "moved_points"}, {"score": 0.0023604768913655463, "phrase": "richer_set"}, {"score": 0.0021236300589450143, "phrase": "unmoved_data_points"}], "paper_keywords": ["Visual to parametric interaction", " visual analytics", " statistical models"], "paper_abstract": "When high-dimensional data is visualized in a 2D plane by using parametric projection algorithms, users may wish to manipulate the layout of the data points to better reflect their domain knowledge or to explore alternative structures. However, few users are well-versed in the algorithms behind the visualizations, making parameter tweaking more of a guessing game than a series of decisive interactions. Translating user interactions into algorithmic input is a key component of Visual to Parametric Interaction (V2PI) [13]. Instead of adjusting parameters, users directly move data points on the screen, which then updates the underlying statistical model. However, we have found that some data points that are not moved by the user are just as important in the interactions as the data points that are moved. Users frequently move some data points with respect to some other \"unmoved\" data points that they consider as spatially contextual. However, in current V2PI interactions, these points are not explicitly identified when directly manipulating the moved points. We design a richer set of interactions that makes this context more explicit, and a new algorithm and sophisticated weighting scheme that incorporates the importance of these unmoved data points into V2PI.", "paper_title": "Semantics of Directly Manipulating Spatializations", "paper_id": "WOS:000325991600011"}