{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "trustworthy_systems"}, {"score": 0.040912173508603204, "phrase": "trustworthiness_properties"}, {"score": 0.004694700982410345, "phrase": "new_process"}, {"score": 0.004635701867952543, "phrase": "rigorous_component-centered_development"}, {"score": 0.004260800171269249, "phrase": "conventional_software_engineering_development_process"}, {"score": 0.0041194351307673556, "phrase": "component-based_systems"}, {"score": 0.004084829853870028, "phrase": "component-based_development_methods"}, {"score": 0.003932654396285872, "phrase": "explicit_specification"}, {"score": 0.0037861265016041813, "phrase": "rigorous_principles"}, {"score": 0.0035389348527719404, "phrase": "composite_nonfunctional_property"}, {"score": 0.0030787405733989615, "phrase": "direct_evidence"}, {"score": 0.0028775998963807324, "phrase": "development_process"}, {"score": 0.002633355582628613, "phrase": "system_lifecycle"}, {"score": 0.002419995316129757, "phrase": "system_development"}, {"score": 0.002389514188569084, "phrase": "proposed_process"}, {"score": 0.00231987280116332, "phrase": "component_assessment"}, {"score": 0.002280990744438186, "phrase": "component-based_system_development"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["component-based software engineering", " trustworthiness", " development process"], "paper_abstract": "This paper introduces a new process for a rigorous component-centered development of trustworthy systems. The rationale for our perspective of the process is two-fold. The activities prescribed in a conventional software engineering development process are neither suitable nor sufficient for developing component-based systems. Component-based development methods that are currently practised do not support the explicit specification of trustworthiness properties, and are not based on rigorous principles. Hence they are not suitable for developing trustworthy systems. Trustworthiness is regarded as a composite nonfunctional property comprising the four attributes safety, security, availability, and reliability. They must be rigorously defined for components and systems composed from them. It is essential that the process enforces a direct evidence of trustworthiness in the systems that are developed following the process. Consequently, the development process, in addition to being reuse-oriented, component-oriented, and rigorous in all phases of the system lifecycle, should maintain the chain of evidence that the trustworthiness properties are preserved in every activity of every phase of system development. The proposed process includes several parallel interrelated tracks including component development, component assessment, component reuse, and component-based system development and prescribes specific activities and tools for ensuring trustworthiness in all activities. Copyright (C) 2010 John Wiley & Sons, Ltd.", "paper_title": "A component-based development process for trustworthy systems", "paper_id": "WOS:000309908900007"}