{"auto_keywords": [{"score": 0.034752967939072406, "phrase": "input_data"}, {"score": 0.015719716506582538, "phrase": "data_evolvement_analysis"}, {"score": 0.014044303063544693, "phrase": "different_time_phases"}, {"score": 0.0119076624444343, "phrase": "clustering_results"}, {"score": 0.009550865932585285, "phrase": "tsac"}, {"score": 0.004772966298144304, "phrase": "topology_self-adaptive_clustering_algorithm"}, {"score": 0.004703800746950553, "phrase": "fast_advance"}, {"score": 0.004676414661927138, "phrase": "internet_technique"}, {"score": 0.004649187277140919, "phrase": "internet_users"}, {"score": 0.004581807162841004, "phrase": "tremendous_data"}, {"score": 0.00375747359900676, "phrase": "clustering"}, {"score": 0.0037235938085914836, "phrase": "good_solution"}, {"score": 0.0034410377627900274, "phrase": "aforementioned_plan"}, {"score": 0.0033418994267186202, "phrase": "clustering_algorithm"}, {"score": 0.0031891658214537794, "phrase": "dynamic_clustering_algorithm"}, {"score": 0.0030612433926714196, "phrase": "existent_cluster_partition"}, {"score": 0.002947043609853674, "phrase": "novel_topology_self-adaptive_clustering_algorithm"}, {"score": 0.0028123050344492553, "phrase": "self_organizing_mapping_algorithm"}, {"score": 0.00266805370779555, "phrase": "neuron_topology"}, {"score": 0.0025017309746010233, "phrase": "minimum_spanning_tree"}, {"score": 0.0024224895576190194, "phrase": "traditional_som_based_algorithms"}, {"score": 0.00231167794364843, "phrase": "data_space"}, {"score": 0.002205923961799702, "phrase": "experiment_results"}, {"score": 0.0021049977753042253, "phrase": "grid_structure"}], "paper_keywords": ["topology adaptation", " competitive learning", " data evolvement analysis", " minimum spanning tree", " self-organizing-mapping"], "paper_abstract": "Along with the fast advance of internet technique, internet users have to deal with tremendous data every day. One of the most useful knowledge exploited from web is about the transfer of the information expressed by two data sets collected in different time phases. With this kind of knowledge, we can further apprehend what information newly appears, what information is antiquated, and what information maintains unchanged along with time passing. The task aiming at acquiring this kind of knowledge is formally entitled as data evolvement analysis. Clustering is a good solution to this task. By comparing the clustering results respectively formed in different time phases, it is easy to acquire the transfer of the information. Unfortunately, aforementioned plan is time- consuming, since it needs to perform clustering algorithm once again, once input data are updated. Therefore, we need to design a dynamic clustering algorithm. Once input data are updated, it can form clustering results by adjusting the existent cluster partition instead of performing clustering algorithm again. For this reason, a novel Topology Self-Adaptive Clustering algorithm (abbreviated as TSAC) is proposed in this paper. This algorithm comes from Self Organizing Mapping algorithm (abbreviated as SOM), whereas, it doesn't need to make any assumption about neuron topology beforehand. Besides, when input data are updated, its topology remodels meanwhile. For further enhancing its performance, it imports minimum spanning tree to preserve its topology order, which is never performed by any traditional SOM based algorithms. For clearly measuring the magnitude of the transfer of the information, it partitions data space into several grids, and calculates the density of each grid to quantify the transfer. Experiment results demonstrate that TSAC can automatically tune its topology. By this algorithm and in addition to grid structure, the transfer of the information can be legibly visualized.", "paper_title": "Data Evolvement Analysis Based on Topology Self-Adaptive Clustering Algorithm", "paper_id": "WOS:000305933000007"}