{"auto_keywords": [{"score": 0.04854911147289717, "phrase": "current_conceptualizations"}, {"score": 0.00481495049065317, "phrase": "information_systems_design_science"}, {"score": 0.0045612889352793584, "phrase": "emerging_literature"}, {"score": 0.004528488165249491, "phrase": "design_science"}, {"score": 0.004447509888681154, "phrase": "information_systems"}, {"score": 0.004019964326034457, "phrase": "acceptable_ds_research"}, {"score": 0.003849502288990788, "phrase": "revised_view"}, {"score": 0.003808024029417427, "phrase": "current_perspectives"}, {"score": 0.003699579190650754, "phrase": "broader_conceptualizations"}, {"score": 0.0034792431564692997, "phrase": "critical_component"}, {"score": 0.0032250366795039715, "phrase": "fairly_common_conceptualizations"}, {"score": 0.0027409477035216195, "phrase": "current_conceptualization"}, {"score": 0.002682133505994396, "phrase": "design_knowledge"}, {"score": 0.0025040655195012465, "phrase": "broader_and_more_integrated_view"}, {"score": 0.0022876085523721324, "phrase": "design-oriented_research"}, {"score": 0.0022063469115990715, "phrase": "human-centered_perspective"}, {"score": 0.00213567715613494, "phrase": "design_research"}, {"score": 0.0021202820950055193, "phrase": "is._journal"}, {"score": 0.0021049977753042253, "phrase": "information_technology"}], "paper_keywords": ["design", " design science", " IT artifact", " IS artifact", " human centered design science"], "paper_abstract": "This paper arose from concerns regarding the current conceptualizations of 'design' in the emerging literature on design science (DS) in information systems (IS). In this paper, we argue that current conceptualizations of design in IS are overly narrow, which necessarily limits what is viewed as acceptable DS research. In response we advance a more encompassing view of design. The revised view extends the current perspectives of design in the IS literature to embrace broader conceptualizations of design, which are evident in many intellectual communities outside IS where design is viewed as a critical component of both research and practice - such as management, engineering, architecture and others. In addition to the fairly common conceptualizations of design as product and design as process or action, design is also conceived as: intention; planning - including modeling and representation; communication; user experience; value; professional practice; and as service. Further, whereas the current conceptualization of design in IS views IS design knowledge as split across two paradigms, namely DS and behavioral science, in this paper we argue for a broader and more integrated view of design: one that emphasizes both the construction-centered and human-centered aspects of design in IS. Building from our broader view, we discuss some of the implications for design-oriented research in IS, and consider ways in which this human-centered perspective might impact on the context and content of design research in IS. Journal of Information Technology (2012) 27, 125-139. doi: 10.1057/jit.2012.5", "paper_title": "The design construct in information systems design science", "paper_id": "WOS:000304441100010"}