{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "structure-activity_relationship-informative_compounds"}, {"score": 0.004704699244406775, "phrase": "physicochemical_property"}, {"score": 0.004491678520807451, "phrase": "active_compounds"}, {"score": 0.004422827355213055, "phrase": "chemical_optimization_efforts"}, {"score": 0.004222515162635615, "phrase": "multiple_properties"}, {"score": 0.004125773078637226, "phrase": "potency_herein"}, {"score": 0.004031238480458909, "phrase": "multiobjective_particle_swarm_optimization_approach"}, {"score": 0.0038485929962942776, "phrase": "large_data_sets"}, {"score": 0.0024385083712241988, "phrase": "global_sar_phenotypes"}, {"score": 0.0023278569001363263, "phrase": "data_sets"}, {"score": 0.0021544587602892466, "phrase": "discontinuous_local_sars"}, {"score": 0.0021049977753042253, "phrase": "desirable_property_distributions"}], "paper_keywords": [""], "paper_abstract": "The selection of active compounds for chemical optimization efforts typically requires the consideration of multiple properties beyond-potency Herein we introduce multiobjective particle swarm optimization approach to automatically extract :compound subsets from large data sets, hat reveal structure-activity relationship(SAR) information and display physicochemical property distribution that are indicative of favorable absorption, distribution, Metabolism, and :excretion (ADME) characteristics. The approach is based on Pareto optimization of Multiple. objectives and does not require. subjective intervention. It is automated and can be easily modified. We have :applied the method to screen 10 compound data sets of different composition and global SAR phenotypes. In five of these data sets, between one and more than hundred compound subsets were identified that represented discontinuous local SARs and had desirable property distributions.", "paper_title": "Multiobjective Particle Swarm Optimization: Automated Identification of Structure-Activity Relationship-Informative Compounds with Favorable Physicochemical Property Distributions", "paper_id": "WOS:000311461400006"}