{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "agent-based_social_impact_theory_model"}, {"score": 0.004598933498016774, "phrase": "widespread_phenomenon"}, {"score": 0.0039571974661570695, "phrase": "important_issue"}, {"score": 0.003670608022642996, "phrase": "media_outlets"}, {"score": 0.00347657813672945, "phrase": "previously_ignored_problem"}, {"score": 0.0032246835734680377, "phrase": "simulation_model"}, {"score": 0.0031712256091350316, "phrase": "social_impact_theory"}, {"score": 0.0031186510842824626, "phrase": "changing_roles"}, {"score": 0.0030160945545795468, "phrase": "semester_long_period"}, {"score": 0.0027054473441439422, "phrase": "new_criterion"}, {"score": 0.002551612225562499, "phrase": "underlying_dynamics"}, {"score": 0.002509284173541882, "phrase": "experimental_design"}, {"score": 0.0024883835349005863, "phrase": "regression_results"}, {"score": 0.0023079225317714793, "phrase": "parental_and_persuasiveness_constants"}, {"score": 0.0021766418372878835, "phrase": "intensive_counseling"}], "paper_keywords": ["Agent-based modeling", " simulation", " bullying", " experimental design", " social impact theory"], "paper_abstract": "Bullying is a widespread phenomenon, occurring in many countries; however, until recently, knowledge of it was limited due to the lack of access to information. Also, most parents of K-12 students failed to see it as an important issue. Now, it is widely agreed upon that bullying is common and detrimental. Use of media outlets to disseminate this message is helping to gradually chip away at this previously ignored problem. Hence, bullying behavior is difficult to detect immediately and prevent. This study uses a simulation model based on the social impact theory to study the changing roles of a class of 40 students during a semester long period. The students in the class were divided into three roles: the bullies, the victims and the bystanders. The model also defines a new criterion, the \"bullying index,'' designed to shed light on the underlying dynamics of bullying through experimental design. Regression results show that the percentage of students bullied in school lessened significantly when the environment changed. The parental and persuasiveness constants were significant, while the impact of counseling was not, even after intensive counseling. This means that we should separate bullies', bystanders' and victims' education to prevent bullying behaviors.", "paper_title": "Applying the agent-based social impact theory model to the bullying phenomenon in K-12 classrooms", "paper_id": "WOS:000337572200004"}