{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "regular_grid"}, {"score": 0.015012247011208547, "phrase": "image_signals"}, {"score": 0.008613353177281137, "phrase": "non-regular_subset"}, {"score": 0.00844853701350706, "phrase": "frequency_selective_reconstruction"}, {"score": 0.00437343635111235, "phrase": "proposed_algorithm"}, {"score": 0.0042035670399069485, "phrase": "image_signal"}, {"score": 0.0037125240439927114, "phrase": "almost_all_algorithms"}, {"score": 0.0033690254452595865, "phrase": "great_importance"}, {"score": 0.002895341091441627, "phrase": "challenging_task"}, {"score": 0.0027741761880779535, "phrase": "small_areas"}, {"score": 0.0026788122684116224, "phrase": "fourier_domain"}, {"score": 0.002617059777997427, "phrase": "basic_properties"}, {"score": 0.0025867180355950816, "phrase": "optical_transfer_function"}, {"score": 0.002566685388128598, "phrase": "imaging_systems"}, {"score": 0.002536926192232391, "phrase": "sparse_model"}, {"score": 0.002310915790114425, "phrase": "peak_signal-to-noise_ratio"}, {"score": 0.0022930226978636332, "phrase": "psnr"}, {"score": 0.0022664208122072657, "phrase": "structural_similarity_measure"}, {"score": 0.002205560249972527, "phrase": "visual_quality"}, {"score": 0.0021799789348982534, "phrase": "simulation_results"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_reconstruction_algorithms"}], "paper_keywords": ["Image reconstruction", " non-regular sampling", " interpolation"], "paper_abstract": "Even though image signals are typically defined on a regular 2D grid, there also exist many scenarios where this is not the case and the amplitude of the image signal only is available for a non-regular subset of pixel positions. In such a case, a resampling of the image to a regular grid has to be carried out. This is necessary since almost all algorithms and technologies for processing, transmitting or displaying image signals rely on the samples being available on a regular grid. Thus, it is of great importance to reconstruct the image on this regular grid, so that the reconstruction comes closest to the case that the signal has been originally acquired on the regular grid. In this paper, Frequency Selective Reconstruction is introduced for solving this challenging task. This algorithm reconstructs image signals by exploiting the property that small areas of images can be represented sparsely in the Fourier domain. By further considering the basic properties of the optical transfer function of imaging systems, a sparse model of the signal is iteratively generated. In doing so, the proposed algorithm is able to achieve a very high reconstruction quality, in terms of peak signal-to-noise ratio (PSNR) and structural similarity measure as well as in terms of visual quality. The simulation results show that the proposed algorithm is able to outperform state-of-the-art reconstruction algorithms and gains of more than 1 dB PSNR are possible.", "paper_title": "Resampling Images to a Regular Grid From a Non-Regular Subset of Pixel Positions Using Frequency Selective Reconstruction", "paper_id": "WOS:000360814100005"}