{"auto_keywords": [{"score": 0.04960770684597511, "phrase": "keyword_frequency"}, {"score": 0.009246250777859113, "phrase": "searching_criteria"}, {"score": 0.00481495049065317, "phrase": "streaming_data_based"}, {"score": 0.004448471107649881, "phrase": "public_server"}, {"score": 0.00393066798511457, "phrase": "abelian_group_homomorphic_encryption"}, {"score": 0.0036133077234252633, "phrase": "recent_breakthrough"}, {"score": 0.003577691211998842, "phrase": "fully_homomorphic_encryption"}, {"score": 0.003472927015404464, "phrase": "arbitrary_searching_criteria"}, {"score": 0.0033050703534275717, "phrase": "new_private_query"}, {"score": 0.0025668646315794947, "phrase": "fully_homomorphic_encryption_techniques"}, {"score": 0.002418587525752333, "phrase": "private_threshold_queries"}, {"score": 0.002336071138145897, "phrase": "basic_constructions"}, {"score": 0.0022675820982741347, "phrase": "generic_construction"}, {"score": 0.0022452005651385095, "phrase": "arbitrary_private_threshold_queries"}, {"score": 0.0021049977753042253, "phrase": "underlying_fully_homomorphic_encryption_scheme"}], "paper_keywords": ["Private searching on streaming data", " fully homomorphic encryption", " binary linear code"], "paper_abstract": "Private searching on streaming data is a process to dispatch to a public server a program, which searches streaming sources of data without revealing searching criteria and then sends back a buffer containing the findings. From an Abelian group homomorphic encryption, the searching criteria can be constructed by only simple combinations of keywords, for example, disjunction of keywords. The recent breakthrough in fully homomorphic encryption has allowed us to construct arbitrary searching criteria theoretically. In this paper, we consider a new private query, which searches for documents from streaming data on the basis of keyword frequency, such that the frequency of a keyword is required to be higher or lower than a given threshold. This form of query can help us in finding more relevant documents. Based on the state of the art fully homomorphic encryption techniques, we give disjunctive, conjunctive, and complement constructions for private threshold queries based on keyword frequency. Combining the basic constructions, we further present a generic construction for arbitrary private threshold queries based on keyword frequency. Our protocols are semantically secure as long as the underlying fully homomorphic encryption scheme is semantically secure.", "paper_title": "Private Searching on Streaming Data Based on Keyword Frequency", "paper_id": "WOS:000334668500006"}