{"auto_keywords": [{"score": 0.04060963584645686, "phrase": "classical_planning_problem"}, {"score": 0.012462815320599788, "phrase": "original_problem"}, {"score": 0.00481495049065317, "phrase": "partial_information"}, {"score": 0.004189863767755212, "phrase": "new_planner"}, {"score": 0.00415671614808766, "phrase": "sdr"}, {"score": 0.0040911305898956, "phrase": "determinize"}, {"score": 0.003916098498242888, "phrase": "solution_plan"}, {"score": 0.003313741359811683, "phrase": "translation-based_approach"}, {"score": 0.003235587204929494, "phrase": "palacios"}, {"score": 0.003209946274310626, "phrase": "geffner"}, {"score": 0.0030481444896915504, "phrase": "belief_state"}, {"score": 0.0028601252251285025, "phrase": "planning_problems"}, {"score": 0.0027815466400771768, "phrase": "non-deterministic_planning_problem"}, {"score": 0.0026518169452004465, "phrase": "state_sampling_techniques"}, {"score": 0.002419798694301991, "phrase": "agent's_belief_state"}, {"score": 0.0023532890136269986, "phrase": "comprehensive_experimental_evaluation"}, {"score": 0.0022434880661725493, "phrase": "state-of-the-art_clg_planner"}, {"score": 0.002147333949483224, "phrase": "new_domains"}], "paper_keywords": [""], "paper_abstract": "Replanning via determinization is a recent, popular approach for online planning in MDPs. In this paper we adapt this idea to classical, non-stochastic domains with partial information and sensing actions, presenting a new planner: SDR (Sample, Determinize, Replan). At each step we generate a solution plan to a classical planning problem induced by the original problem. We execute this plan as long as it is safe to do so. When this is no longer the case, we replan. The classical planning problem we generate is based on the translation-based approach for conformant planning introduced by Palacios and Geffner. The state of the classical planning problem generated in this approach captures the belief state of the agent in the original problem. Unfortunately, when this method is applied to planning problems with sensing, it yields a non-deterministic planning problem that is typically very large. Our main contribution is the introduction of state sampling techniques for overcoming these two problems. In addition, we introduce a novel, lazy, regression-based method for querying the agent's belief state during run-time. We provide a comprehensive experimental evaluation of the planner, showing that it scales better than the state-of-the-art CLG planner on existing benchmark problems, but also highlighting its weaknesses with new domains. We also discuss its theoretical guarantees.", "paper_title": "Replanning in Domains with Partial Information and Sensing Actions", "paper_id": "WOS:000312766700001"}