{"auto_keywords": [{"score": 0.04639655778224996, "phrase": "nursing_staff"}, {"score": 0.028198276166246455, "phrase": "electronic_nursing_documentation_system"}, {"score": 0.006183122413561857, "phrase": "electronic_system"}, {"score": 0.00477079124890959, "phrase": "nursing_home_reduce_time"}, {"score": 0.004528062940497773, "phrase": "nursing_home"}, {"score": 0.004091432545219401, "phrase": "observational_work_sampling_study"}, {"score": 0.0037424924896976093, "phrase": "work_classification_tool"}, {"score": 0.0037081324077511482, "phrase": "documentation_activities"}, {"score": 0.003573806659381238, "phrase": "particular_times"}, {"score": 0.0031992346303888397, "phrase": "significant_difference"}, {"score": 0.0028287747612440912, "phrase": "original_levels"}, {"score": 0.002777023418761879, "phrase": "paper-based_system"}, {"score": 0.002635465406070238, "phrase": "paper_documentation_tasks"}, {"score": 0.0023735785441690097, "phrase": "information_items"}, {"score": 0.0022734427000632483, "phrase": "paper_documentation"}, {"score": 0.0022387107945750044, "phrase": "paper-free_documentation_environment"}, {"score": 0.0021977306528383153, "phrase": "in-depth_understanding"}, {"score": 0.0021842376228111537, "phrase": "nursing_staff's_information"}, {"score": 0.0021574990404104213, "phrase": "documentation_workflow"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Documentation", " Efficiency", " Electronic nursing documentation", " Electronic health record", " Long-term care", " Nursing home", " Nurse", " Observation", " Longitudinal study"], "paper_abstract": "Purpose: To determine whether the introduction of an electronic nursing documentation system in a nursing home reduces the proportion of time nursing staff spend on documentation, and to use this information in evaluating the usefulness of the system in improving the work of nursing staff. Methods: An observational work sampling study was conducted in 2009 and 2010, 2 months before, and 3, 6 and 12 months after the introduction of an electronic nursing documentation system. An observer (ENM) used a work classification tool to record documentation activities being performed using paper and with a computer by nursing staff at particular times for periods of 5 days. Results: Three hundred and eighty three (383) activities were recorded before implementation of the electronic system, 472 activities at 3 months, 502 at 6 months, and 338 at 12 months after implementation. There was no significant difference between the proportion of time nursing staff spent on documentation 2 months before and 3 months after the implementation of the electronic system. Six months after implementation, the proportion of time on documentation increased significantly and after 12 months, settled back to original levels that were recorded in the paper-based system. Over half of the proportion of time on documentation at 6 and 12 months after implementation was spent on paper documentation tasks. Conclusion: Introduction of an electronic nursing documentation system did not reduce the proportion of time nursing staff spent on documentation. This may in part have been a result of the practice of documenting some information items on paper and others on a computer. To reduce the use of paper documentation or to achieve a paper-free documentation environment in this setting, an in-depth understanding of nursing staff's information needs, and documentation workflow is necessary. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Does the introduction of an electronic nursing documentation system in a nursing home reduce time on documentation for the nursing staff?", "paper_id": "WOS:000296493000005"}