{"auto_keywords": [{"score": 0.04871093899700793, "phrase": "stochastic_context-free_grammars"}, {"score": 0.02626973013346844, "phrase": "trace_semantics"}, {"score": 0.00481495049065317, "phrase": "stochastic_rna_family_models"}, {"score": 0.004780183091824403, "phrase": "stochastic_models"}, {"score": 0.0047113960612140335, "phrase": "hidden_markov_models"}, {"score": 0.004445961412092278, "phrase": "semantic_ambiguity"}, {"score": 0.004210656614914171, "phrase": "different_guises"}, {"score": 0.004135010810625326, "phrase": "difficult_problem"}, {"score": 0.0037766095501754952, "phrase": "equivalent_solutions"}, {"score": 0.003683423481347615, "phrase": "np"}, {"score": 0.00358980086919268, "phrase": "rna"}, {"score": 0.0031500213134140953, "phrase": "query_sequence"}, {"score": 0.003115908199991072, "phrase": "implicit_consensus_structure"}, {"score": 0.0030821633718368206, "phrase": "rna_family"}, {"score": 0.0027641218567092665, "phrase": "rfam_models"}, {"score": 0.0027242666160349938, "phrase": "alignment_semantics"}, {"score": 0.002347378595930709, "phrase": "automated_pipeline"}, {"score": 0.0023219374444738723, "phrase": "post_factum"}, {"score": 0.0022801453935251503, "phrase": "generated_models"}, {"score": 0.0021049977753042253, "phrase": "remotely_related_family_members"}], "paper_keywords": ["RNA secondary structure", " RNA family models", " covariance models", " semantic ambiguity"], "paper_abstract": "Stochastic models, such as hidden Markov models or stochastic context-free grammars (SCFGs) can fail to return the correct, maximum likelihood solution in the case of semantic ambiguity. This problem arises when the algorithm implementing the model inspects the same solution in different guises. It is a difficult problem in the sense that proving semantic nonambiguity has been shown to be algorithmically undecidable, while compensating for it (by coalescing scores of equivalent solutions) has been shown to be NP-hard. For stochastic context-free grammars modeling RNA secondary structure, it has been shown that the distortion of results can be quite severe. Much less is known about the case when stochastic context-free grammars model the matching of a query sequence to an implicit consensus structure for an RNA family. We find that three different, meaningful semantics can be associated with the matching of a query against the model-a structural, an alignment, and a trace semantics. Rfam models correctly implement the alignment semantics, and are ambiguous with respect to the other two semantics, which are more abstract. We show how provably correct models can be generated for the trace semantics. For approaches, where such a proof is not possible, we present an automated pipeline to check post factum for ambiguity of the generated models. We propose that both the structure and the trace semantics are worth-while concepts for further study, possibly better suited to capture remotely related family members.", "paper_title": "Semantics and Ambiguity of Stochastic RNA Family Models", "paper_id": "WOS:000286146600020"}