{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dynamic_optimization_problems"}, {"score": 0.035366979368155665, "phrase": "dynamic_environments"}, {"score": 0.029668259727588457, "phrase": "multipopulation_methods"}, {"score": 0.004753194996637899, "phrase": "multipopulation_method"}, {"score": 0.0044369056710423065, "phrase": "multiple_populations"}, {"score": 0.004398872331144531, "phrase": "different_peaks"}, {"score": 0.004305203085016233, "phrase": "multiple_changing_optima"}, {"score": 0.0036710872046569532, "phrase": "population_diversity"}, {"score": 0.0029467742734417255, "phrase": "challenging_issues"}, {"score": 0.002668582249630492, "phrase": "adaptive_multi-swarm_algorithm"}, {"score": 0.0025230952890994236, "phrase": "change_detection"}, {"score": 0.0024906610581090223, "phrase": "experimental_study"}, {"score": 0.002427035025924384, "phrase": "moving_peaks_problem"}, {"score": 0.0023548511815224098, "phrase": "proposed_method"}, {"score": 0.002294686545883412, "phrase": "proposed_algorithm"}, {"score": 0.002150900082318562, "phrase": "different_research_areas"}, {"score": 0.0021049977753042253, "phrase": "evolutionary_computation"}], "paper_keywords": ["Multipopulation adaptation", " dynamic optimization problems", " particle swarm optimization"], "paper_abstract": "The multipopulation method has been widely used to solve dynamic optimization problems (DOPs) with the aim of maintaining multiple populations on different peaks to locate and track multiple changing optima simultaneously. However, to make this approach effective for solving DOPs, two challenging issues need to be addressed. They are how to adapt the number of populations to changes and how to adaptively maintain the population diversity in a situation where changes are complicated or hard to detect or predict. Tracking the changing global optimum in dynamic environments is difficult because we cannot know when and where changes occur and what the characteristics of changes would be. Therefore, it is necessary to take these challenging issues into account in designing such adaptive algorithms. To address the issues when multipopulation methods are applied for solving DOPs, this paper proposes an adaptive multi-swarm algorithm, where the populations are enabled to be adaptive in dynamic environments without change detection. An experimental study is conducted based on the moving peaks problem to investigate the behavior of the proposed method. The performance of the proposed algorithm is also compared with a set of algorithms that are based on multipopulation methods from different research areas in the literature of evolutionary computation.", "paper_title": "An Adaptive Multi-Swarm Optimizer for Dynamic Optimization Problems", "paper_id": "WOS:000345964200002"}