{"auto_keywords": [{"score": 0.04916809664432026, "phrase": "omni-directional_walker"}, {"score": 0.044027087409931595, "phrase": "walking_training_programs"}, {"score": 0.03703663101573627, "phrase": "center-of-gravity_shifts"}, {"score": 0.00481495049065317, "phrase": "path-tracking_control"}, {"score": 0.0038230844545071303, "phrase": "physical_therapist"}, {"score": 0.0035856674209019234, "phrase": "predefined_path"}, {"score": 0.002958021635132416, "phrase": "user_safety"}, {"score": 0.0028100102841877835, "phrase": "path-tracking_control_method"}, {"score": 0.002471499653433169, "phrase": "omni-directional_walker_motion"}, {"score": 0.00236289633510808, "phrase": "adaptive_control_strategy"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": ["Omni-directional walker", " Adaptive control", " Load change", " Center-of-gravity shift", " Path tracking"], "paper_abstract": "In previous studies, an omni-directional walker was developed for walking rehabilitation. Walking training programs are stored in the walker so that rehabilitation can be carried out without a physical therapist. However, the walker sometimes strays from the predefined path because of center-of-gravity shifts and load changes. It is necessary for the walker to precisely follow the paths defined in the walking training programs to guarantee the effectiveness of rehabilitation and user safety. Therefore, this paper describes a path-tracking control method for the omni-directional walker to compensate for center-of-gravity shifts and load changes. First, the kinematics and kinetics of the omni-directional walker motion are presented. Second, an adaptive control strategy is proposed. Finally, simulations show that the walker can be controlled accurately by using the proposed method.", "paper_title": "ADAPTIVE CONTROL METHOD FOR PATH-TRACKING CONTROL OF AN OMNI-DIRECTIONAL WALKER COMPENSATING FOR CENTER-OF-GRAVITY SHIFTS AND LOAD CHANGES", "paper_id": "WOS:000292626900025"}