{"auto_keywords": [{"score": 0.04677143577133059, "phrase": "individual_classifiers"}, {"score": 0.015719716506582538, "phrase": "classifier_fusion"}, {"score": 0.015512782943645874, "phrase": "upper_integral"}, {"score": 0.011789778841063097, "phrase": "upper_integrals"}, {"score": 0.010412265925985317, "phrase": "classification_efficiency"}, {"score": 0.009569482678634974, "phrase": "different_individual_classifiers"}, {"score": 0.004063186599879217, "phrase": "effective_tool"}, {"score": 0.003902992784453769, "phrase": "best_use"}, {"score": 0.0036826452656927877, "phrase": "new_scheme"}, {"score": 0.0034283921404628975, "phrase": "fusion_operator"}, {"score": 0.003278447235176858, "phrase": "finite_resources"}, {"score": 0.0031071175640144943, "phrase": "optimization_problem"}, {"score": 0.0028032928749970026, "phrase": "new_examples"}, {"score": 0.002621297299343551, "phrase": "specific_examples"}, {"score": 0.0024842242921857705, "phrase": "upper_integral_guarantees"}, {"score": 0.0023861329619604666, "phrase": "fused_classifier"}, {"score": 0.0023021895404322767, "phrase": "individual_classifier"}, {"score": 0.002251227801482381, "phrase": "numerical_simulations"}], "paper_keywords": ["Efficiency measure", " fuzzy integral", " interaction", " multiple classifier fusion", " nonadditive set function", " upper integral"], "paper_abstract": "Fusing a number of classifiers can generally improve the performance of individual classifiers, and the fuzzy integral, which can clearly express the interaction among the individual classifiers, has been acknowledged as an effective tool of fusion. In order to make the best use of the individual classifiers and their combinations, we propose in this paper a new scheme of classifier fusion based on upper integrals, which differs from all the existing models. Instead of being a fusion operator, the upper integral is used to reasonably arrange the finite resources, and thus to maximize the classification efficiency. By solving an optimization problem of upper integrals, we obtain a scheme for assigning proportions of examples to different individual classifiers and their combinations. According to these proportions, new examples could be classified by different individual classifiers and their combinations, and the combination of classifiers that specific examples should be submitted to depends on their performance. The definition of upper integral guarantees such a conclusion that the classification efficiency of the fused classifier is not less than that of any individual classifier theoretically. Furthermore, numerical simulations demonstrate that most existing fusion methodologies, such as bagging and boosting, can be improved by our upper integral model.", "paper_title": "A New Approach to Classifier Fusion Based on Upper Integral", "paper_id": "WOS:000334739900005"}