{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cheater_identification"}, {"score": 0.004384504920139083, "phrase": "big_data"}, {"score": 0.00433645229352341, "phrase": "cloud_computing"}, {"score": 0.004241914481080374, "phrase": "thorny_problem"}, {"score": 0.003948613642680196, "phrase": "mutually_trusted_dealer"}, {"score": 0.0033837135367113004, "phrase": "dishonest_shareholders"}, {"score": 0.00327356326590461, "phrase": "fake_shares"}, {"score": 0.0032198357970567595, "phrase": "secret_reconstruction_phase"}, {"score": 0.002996992362027833, "phrase": "fair_secret_reconstruction"}, {"score": 0.0027286224888843956, "phrase": "secret_sharing_scheme"}, {"score": 0.002698670968558269, "phrase": "diss"}, {"score": 0.0026252106881752067, "phrase": "symmetric_bivariate_polynomial"}, {"score": 0.002224510044064184, "phrase": "detection_and_identification_abilities"}], "paper_keywords": ["Secret sharing", " cheating detection", " cheater identification", " voting"], "paper_abstract": "Secret sharing technology is being again on the agenda when the security of big data and cloud computing is becoming a thorny problem. In a (t, n) secret sharing scheme, a secret data is distributed by a mutually trusted dealer to n shareholders by this means that the secret could not be obtained and reconstructed by less than t shareholders unless the number is no less than t. However, dishonest shareholders can fool other honest shareholders by presenting fake shares in the secret reconstruction phase. Therefore, cheating detection and cheater identification are very important to achieving fair secret reconstruction. In this paper, we propose a (t, n) detecting and identifying secret sharing scheme (DISS) based on the symmetric bivariate polynomial. In our (t, n) DISS, we use the property of symmetry to detect cheating, and use voting to identify cheaters. Furthermore, detection and identification abilities, and the thresholds in voting are discussed under three types of attack.", "paper_title": "Cheating detection and cheater identification in (t, n) secret sharing scheme", "paper_id": "WOS:000333232900008"}