{"auto_keywords": [{"score": 0.046400324443240264, "phrase": "textual_information"}, {"score": 0.04490388164168672, "phrase": "graphical_information"}, {"score": 0.015719716506582538, "phrase": "textual_and_graphical_information"}, {"score": 0.015456171186625827, "phrase": "web_page_widgets"}, {"score": 0.015111532340446914, "phrase": "web_navigation"}, {"score": 0.012331725458587305, "phrase": "web_pages"}, {"score": 0.008340973741042715, "phrase": "graphical_widgets"}, {"score": 0.0046797114400479135, "phrase": "current_models"}, {"score": 0.004175533280178052, "phrase": "differential_role"}, {"score": 0.00332375606483146, "phrase": "displayed_web_page"}, {"score": 0.0031393948330209255, "phrase": "task-completion_time"}, {"score": 0.0024984517279573906, "phrase": "-graphics_conditions"}, {"score": 0.0021049977753042253, "phrase": "cognitive_models"}], "paper_keywords": ["semantics", " graphics", " information scent", " web-navigation"], "paper_abstract": "Current models of web navigation focus only on the influence of textual information and ignore the role of graphical information. We studied the differential role of text and graphics in identifying web page widgets classified into two kinds: textual and graphical. Four different versions of web pages were created by systematically removing textual and graphical information from each page. The task of the participants was to locate either textual or graphical widgets on the displayed web page. Results show that for any widget, the task-completion time and the number of clicks were significantly less in web pages with graphics than in those with no graphics. This demonstrates the importance of graphical information. However, textual information is also important because performance in locating graphical widgets under no-graphics conditions was better when text was present than with no text. Since, for identifying graphical widgets, text and graphics interact and complement each other, we conclude that cognitive models on web navigation should include the role of graphical information next to textual information.", "paper_title": "Interaction of textual and graphical information in locating web page widgets", "paper_id": "WOS:000318279400008"}