{"auto_keywords": [{"score": 0.04794619122830636, "phrase": "irrelevant_features"}, {"score": 0.03538091944960296, "phrase": "regularization_term"}, {"score": 0.00481495049065317, "phrase": "norm_regularization"}, {"score": 0.004630626571109149, "phrase": "large_number"}, {"score": 0.0045559136361908795, "phrase": "important_problem"}, {"score": 0.004526365546684684, "phrase": "high-dimensional_tasks"}, {"score": 0.004227398267369744, "phrase": "compressed_sensing"}, {"score": 0.0037233796053514918, "phrase": "nonconvex_problem"}, {"score": 0.003488607816047529, "phrase": "potential_advantages"}, {"score": 0.003443454339200118, "phrase": "nonconvex_regularization"}, {"score": 0.0033878306639271963, "phrase": "logistic_regression"}, {"score": 0.0033006894756949776, "phrase": "lq_semi-norms"}, {"score": 0.003133052778244851, "phrase": "high_dimensions"}, {"score": 0.0030425153622841822, "phrase": "sparse_estimation"}, {"score": 0.0028228178454284825, "phrase": "generalization_error"}, {"score": 0.002804478352027886, "phrase": "lq-regularized_logistic_regression"}, {"score": 0.0022912596877648723, "phrase": "optimal_choice"}, {"score": 0.0022468671200629024, "phrase": "relative_fraction"}, {"score": 0.002160640052461594, "phrase": "small_exponent"}, {"score": 0.0021049977753042253, "phrase": "relevant_features"}], "paper_keywords": ["Distance concentration", " fractional norm", " high dimensionality", " PAC-Bayes analysis", " sparse classification"], "paper_abstract": "Learning in the presence of a large number of irrelevant features is an important problem in high-dimensional tasks. Previous studies have shown that L1-norm regularization can be effective in such cases while L2-norm regularization is not. Furthermore, work in compressed sensing suggests that regularization by nonconvex (e. g., fractional) semi-norms may outperform L1-regularization. However, for classification it is largely unclear when this may or may not be the case. In addition, the nonconvex problem is harder to solve than the convex L1 problem. In this paper, we provide a more in-depth analysis to elucidate the potential advantages and pitfalls of nonconvex regularization in the context of logistic regression where the regularization term employs the family of Lq semi-norms. First, using results from the phenomenon of concentration of norms and distances in high dimensions, we gain intuition about the working of sparse estimation when the dimensionality is very high. Second, using the probably approximately correct (PAC)-Bayes methodology, we give a data-dependent bound on the generalization error of Lq-regularized logistic regression, which is applicable to any algorithm that implements this model, and may be used to predict its generalization behavior from the training set alone. Third, we demonstrate the usefulness of our approach by experiments and applications, where the PAC-Bayes bound is used to guide the choice of semi-norm in the regularization term. The results support the conclusion that the optimal choice of regularization depends on the relative fraction of relevant versus irrelevant features, and a fractional norm with a small exponent is most suitable when the fraction of relevant features is very small.", "paper_title": "Fractional Norm Regularization: Learning With Very Few Relevant Features", "paper_id": "WOS:000317786000009"}