{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "particle_filter"}, {"score": 0.018749674798639843, "phrase": "mc"}, {"score": 0.009572286496127293, "phrase": "ensemble_modeling"}, {"score": 0.004781777766309739, "phrase": "nuclear_decision_support"}, {"score": 0.004667454318370122, "phrase": "nuclear_accident"}, {"score": 0.004477765573115626, "phrase": "contamination_thresholds"}, {"score": 0.0043106348117582915, "phrase": "forecasting_threshold_exceedance"}, {"score": 0.004236733825313407, "phrase": "probability_density_functions"}, {"score": 0.003912712778141845, "phrase": "monte_carlo"}, {"score": 0.0034544053534458093, "phrase": "deterministic_model_run"}, {"score": 0.003418719577853084, "phrase": "false_sense"}, {"score": 0.00327961310338175, "phrase": "threshold_exceedance"}, {"score": 0.003201088113538101, "phrase": "grid_cell"}, {"score": 0.002986907667028281, "phrase": "grid_cells"}, {"score": 0.0027486699590262343, "phrase": "large_changes"}, {"score": 0.002701474449898187, "phrase": "small_prediction_interval"}, {"score": 0.0023034836169432233, "phrase": "decision_makers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Particle filter", " Data assimilation", " Monte Carlo", " Spatial aggregation", " Threshold exceedance", " Nuclear accidents"], "paper_abstract": "In the case of a nuclear accident, forecasting the spread of contamination is important for determining whether contamination thresholds are exceeded. In this study we explore ensemble modeling for forecasting threshold exceedance. This involves defining probability density functions for the most import model drivers and parameters and creating an ensemble of models by drawing from them. We test two ensemble modeling techniques, a simple Monte Carlo simulation (MC) and the particle filter. The particle filter extends on MC by assimilating observations into the model as they become available in real-time. In this paper we show that using a deterministic model run provides a false sense of accuracy. Using ensemble modeling we can visualize the uncertainty in threshold exceedance by classifying the 95% prediction interval at each grid cell relative to the threshold into either higher, lower or not distinguishable. In addition, we classify the grid cells relative to 4 multiples of the threshold (0.5, 1, 2 and 4), showing the sensitivity of the classification. Large changes between multiples indicate a small prediction interval. By comparing MC to the particle filter we observe a reduction by a factor of up to 10.6 in uncertainty in the PDF of the spread of contamination. We also aggregate the results to the level of a municipality, which might prove more informative to decision makers. Finally, we demonstrate that errors in the PDFs of the most important model settings can degrade the performance of the particle filter. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Using the particle filter for nuclear decision support", "paper_id": "WOS:000306041500008"}