{"auto_keywords": [{"score": 0.033700634117951773, "phrase": "third_algorithm"}, {"score": 0.009132997882565825, "phrase": "diffuse_reflection_path"}, {"score": 0.00481495049065317, "phrase": "diffuse_reflection_paths"}, {"score": 0.004671803485255806, "phrase": "point_source"}, {"score": 0.004584495834677719, "phrase": "polygon_p"}, {"score": 0.0039869632444468036, "phrase": "minimum_number"}, {"score": 0.003480161521018509, "phrase": "suboptimal_paths"}, {"score": 0.0033893426032054366, "phrase": "first_algorithm"}, {"score": 0.0033511469200347907, "phrase": "greedy_method"}, {"score": 0.003313380246267812, "phrase": "second_algorithm"}, {"score": 0.003239114833599948, "phrase": "minimum_link_path"}, {"score": 0.003154566400499823, "phrase": "edge-edge_visibility_graph"}, {"score": 0.0031072444973406586, "phrase": "first_two_algorithms"}, {"score": 0.0028164399450837465, "phrase": "constructed_path"}, {"score": 0.0024120247307686084, "phrase": "optimal_diffuse_reflection_path"}, {"score": 0.0023758152068732025, "phrase": "combinatorial_approach"}, {"score": 0.0021049977753042253, "phrase": "local_geometric_information"}], "paper_keywords": ["Diffuse reflection", " Specular reflection", " Visibility polygon", " Visibility graph", " Shortest path", " Minimum link path", " Greedy path"], "paper_abstract": "Let s be a point source of light inside a polygon P of n vertices. A polygonal path from s to some point t inside P is called a diffuse reflection path if the turning points of the path lie on edges of P. A diffuse reflection path is said to be optimal if it has the minimum number of reflections on the path. The problem of computing a diffuse reflection path from s to t inside P has not been considered explicitly in the past. We present three different algorithms for this problem which produce suboptimal paths. For constructing such a path, the first algorithm uses a greedy method, the second algorithm uses a transformation of a minimum link path, and the third algorithm uses the edge-edge visibility graph of P. The first two algorithms are for polygons without holes, and they run in O(n + k logn) time, where k denotes the number of reflections in the constructed path. The third algorithm is for polygons with or without holes, and it runs in O(n(2)) time. The number of reflections in the path produced by this third algorithm can be at most three times that of an optimal diffuse reflection path. Though the combinatorial approach used in the third algorithm gives a better bound on the number of reflections on the path, the first and the second algorithms stand on the merit of their elegant geometric approaches based on local geometric information.", "paper_title": "Algorithms for computing diffuse reflection paths in polygons", "paper_id": "WOS:000310538700007"}