{"auto_keywords": [{"score": 0.023194700486746715, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "frequency_assignment"}, {"score": 0.0047761092701293474, "phrase": "linear_cellular_networks"}, {"score": 0.0046993598473345395, "phrase": "frequency_assignment_problem"}, {"score": 0.004549524321051407, "phrase": "wireless_network"}, {"score": 0.0032497506915502876, "phrase": "special_case"}, {"score": 0.003171615440419782, "phrase": "underlying_graph"}, {"score": 0.003133252930886608, "phrase": "linear_network"}, {"score": 0.0027741761880779535, "phrase": "incremental_online_case"}, {"score": 0.0024963543716522087, "phrase": "general_online_case"}, {"score": 0.0022190974300886467, "phrase": "offline_version"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Frequency assignment", " Cellular networks", " Online algorithms", " Competitive analysis", " NP-completeness"], "paper_abstract": "In the frequency assignment problem we are given a graph representing a wireless network and a sequence of requests, where each request is associated with a vertex. Each request has two more attributes: its arrival and departure times, and it is considered active from the time of arrival to the time of departure. We want to assign frequencies to all requests so that at each time step any two active requests associated with the same or adjacent vertices use different frequencies. The objective is to minimize the number of frequencies used. We focus exclusively on the special case of the problem when the underlying graph is a linear network (path). For this case, we consider both the offline and online versions of the problem, and we present three results. First, in the incremental online case, where the requests arrive over time, but never depart, we give an algorithm with an optimal (asymptotic) competitive ratio 4/3. Second, in the general online case, where the requests arrive and depart over time, we improve the current lower bound on the (asymptotic) competitive ratio to 11/7. Third, we prove that the offline version of this problem is NP-complete. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Three results on frequency assignment in linear cellular networks", "paper_id": "WOS:000272123800009"}