{"auto_keywords": [{"score": 0.049596205816074275, "phrase": "quasi-stationary_distributions"}, {"score": 0.048880968765446134, "phrase": "markovian_bulk-arrival"}, {"score": 0.046341304515173494, "phrase": "invariant_measures"}, {"score": 0.0216634931982892, "phrase": "decay_parameter"}, {"score": 0.010612387000973441, "phrase": "decay_properties"}, {"score": 0.004647105813224402, "phrase": "bulk-service_queues"}, {"score": 0.004285010985001827, "phrase": "bulk-service_queue"}, {"score": 0.004177724522109952, "phrase": "waiting_line"}, {"score": 0.00395101799538683, "phrase": "busy_period"}, {"score": 0.0038131738052230254, "phrase": "bulk-service_queuing_processes"}, {"score": 0.0036614948691735105, "phrase": "parameter_lambda"}, {"score": 0.002840708910768261, "phrase": "mild_conditions"}, {"score": 0.0026057256900479026, "phrase": "generating_functions"}, {"score": 0.002390133671838151, "phrase": "bulk-service_queueing_model"}, {"score": 0.0021923400552366756, "phrase": "clear_geometric_interpretation"}], "paper_keywords": ["Stopped Markovian bulk-arrival and bulk-service queues", " Decay parameter", " Invariant measures", " Quasi-stationary distributions"], "paper_abstract": "We consider decay properties including the decay parameter, invariant measures and quasi-stationary distributions for a Markovian bulk-arrival and bulk-service queue which stops when the waiting line is empty. Investigating such a model is crucial for understanding the busy period and other related properties of the Markovian bulk-arrival and bulk-service queuing processes. The exact value of the decay parameter lambda (C) is first obtained. We show that the decay parameter can be easily expressed explicitly. The invariant measures and quasi-distributions are then revealed. We show that there exists a family of invariant measures indexed by lambda a[0,lambda (C) ]. We then show that under some mild conditions there exists a family of quasi-stationary distributions also indexed by lambda a[0,lambda (C) ]. The generating functions of these invariant measures and quasi-stationary distributions are presented. We further show that this stopped Markovian bulk-arrival and bulk-service queueing model is always lambda (C) -transient. Some deep properties regarding lambda (C) -transience are examined and revealed. The clear geometric interpretation of the decay parameter is explained. A few examples are then provided to illustrate the results obtained in this paper.", "paper_title": "Decay properties and quasi-stationary distributions for stopped Markovian bulk-arrival and bulk-service queues", "paper_id": "WOS:000283558600003"}