{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "gravitational_forces"}, {"score": 0.022840809908480256, "phrase": "scoliotic_spine"}, {"score": 0.008363198767904178, "phrase": "scoliotic_trunk"}, {"score": 0.005929425858798444, "phrase": "vertebral_positions"}, {"score": 0.00526127541020563, "phrase": "scoliotic_curves"}, {"score": 0.0047739754059430055, "phrase": "finite_element_model"}, {"score": 0.004296264970612285, "phrase": "existing_finite_element_models"}, {"score": 0.003932883240257402, "phrase": "deformed_spine"}, {"score": 0.00388828234270598, "phrase": "actual_one"}, {"score": 0.0038551626276406175, "phrase": "new_method"}, {"score": 0.0034789831290103967, "phrase": "patients'_trunk"}, {"score": 0.0034004869983267085, "phrase": "simulation_process"}, {"score": 0.003267342521938321, "phrase": "vertebra_level"}, {"score": 0.0032302647179383915, "phrase": "\"zero-gravity\"_geometry"}, {"score": 0.0031845067058084583, "phrase": "adequate_upwards_forces"}, {"score": 0.0031573626285069157, "phrase": "initial_geometry"}, {"score": 0.0030597928729005704, "phrase": "gravity_forces"}, {"score": 0.002931569771634119, "phrase": "optimization_process"}, {"score": 0.002881793492919646, "phrase": "appropriate_zero-gravity"}, {"score": 0.0028328599839713866, "phrase": "design_variables"}, {"score": 0.0027452904886195993, "phrase": "zero-gravity_geometry"}, {"score": 0.0025416235470290286, "phrase": "compressive_stresses"}, {"score": 0.0024630345285372958, "phrase": "asymmetrical_load"}, {"score": 0.002442025065383455, "phrase": "coronal_plane"}, {"score": 0.0023530305476484807, "phrase": "mean_compressive_stresses"}, {"score": 0.002254357921422124, "phrase": "realistic_way"}, {"score": 0.0021170579470073305, "phrase": "valuable_improvement"}], "paper_keywords": ["Scoliosis", " Finite element model", " Spine", " Gravity", " Stresses"], "paper_abstract": "The distribution of stresses in the scoliotic spine is still not well known despite its biomechanical importance in the pathomechanisms and treatment of scoliosis. Gravitational forces are one of the sources of these stresses. Existing finite element models (FEMs), when considering gravity, applied these forces on a geometry acquired from radiographs while the patient was already subjected to gravity, which resulted in a deformed spine different from the actual one. A new method to include gravitational forces on a scoliotic trunk FEM and compute the stresses in the spine was consequently developed. The 3D geometry of three scoliotic patients was acquired using a multi-view X-ray 3D reconstruction technique and surface topography. The FEM of the patients' trunk was created using this geometry. A simulation process was developed to apply the gravitational forces at the centers of gravity of each vertebra level. First the \"zero-gravity\" geometry was determined by applying adequate upwards forces on the initial geometry. The stresses were reset to zero and then the gravity forces were applied to compute the geometry of the spine subjected to gravity. An optimization process was necessary to find the appropriate zero-gravity and gravity geometries. The design variables were the forces applied on the model to find the zero-gravity geometry. After optimization the difference between the vertebral positions acquired from radiographs and the vertebral positions simulated with the model was inferior to 3 mm. The forces and compressive stresses in the scoliotic spine were then computed. There was an asymmetrical load in the coronal plane, particularly, at the apices of the scoliotic curves. Difference of mean compressive stresses between concavity and convexity of the scoliotic curves ranged between 0.1 and 0.2 MPa. In conclusion, a realistic way of integrating gravity in a scoliotic trunk FEM was developed and stresses due to gravity were explicitly computed. This is a valuable improvement for further biomechanical modeling studies of scoliosis.", "paper_title": "A new method to include the gravitational forces in a finite element model of the scoliotic spine", "paper_id": "WOS:000292937700013"}