{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "interactive_flashlights"}, {"score": 0.004376131419366239, "phrase": "early_age"}, {"score": 0.0034359094594153304, "phrase": "dark_places"}, {"score": 0.0028695095228791724, "phrase": "flashlight_projections"}, {"score": 0.0027898428590137515, "phrase": "image_sequence"}, {"score": 0.002727700630869639, "phrase": "fixed_camera_monitoring"}, {"score": 0.0026971491199975083, "phrase": "target_surface"}, {"score": 0.0025494354909453847, "phrase": "individual_flashlights"}, {"score": 0.0024926348205500715, "phrase": "multi-user_interface_technology"}, {"score": 0.0023962545023307937, "phrase": "users'_actions"}, {"score": 0.0021288561076024844, "phrase": "seven_interactive_exhibits"}, {"score": 0.0021049977753042253, "phrase": "varying_complexity"}], "paper_keywords": ["Vision-based interaction", " Exploration", " Museums", " Visitor attractions"], "paper_abstract": "Flashlights are cheap, robust and fun. Most people from adults to children of an early age are familiar with flashlights and can use them to search for, select and illuminate objects and features of interest. Flashlights are available in many shapes, sizes, weights and mountings. Flashlights are particularly appropriate to situations where visitors explore dark places such as the caves, tunnels, cellars and dungeons that can be found in museums, theme parks and other visitor attractions. We describe techniques by which descriptions of flashlight projections are recovered from the image sequence supplied by a fixed camera monitoring a target surface. These representations are used to locate and recognise individual flashlights and support a multi-user interface technology triggering audiovisual events in response to users' actions and explorations. The technology has been developed in the context of, and deployed within, a set of seven interactive exhibits of varying complexity.", "paper_title": "Exploring attractions and exhibits with interactive flashlights", "paper_id": "WOS:000329238400021"}