{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "climategate_hype"}, {"score": 0.004664920223650814, "phrase": "purpose_-_research"}, {"score": 0.004215397034321004, "phrase": "methodological_approach"}, {"score": 0.004162328961227939, "phrase": "emerging_hype"}, {"score": 0.004136044939878838, "phrase": "online_communications"}, {"score": 0.00369022262431101, "phrase": "mutual_influences"}, {"score": 0.0036553070575015344, "phrase": "heterogeneous_set"}, {"score": 0.0036092644587974953, "phrase": "blog_data"}, {"score": 0.0035751121405295026, "phrase": "subject_scope"}, {"score": 0.003419943984098415, "phrase": "online_publication"}, {"score": 0.0033661687998511737, "phrase": "hacked_e-mails"}, {"score": 0.003334309053314909, "phrase": "climate_researchers"}, {"score": 0.00330274985014172, "phrase": "east_anglia_university"}, {"score": 0.0032302647179383915, "phrase": "main_findings"}, {"score": 0.0028006988338192375, "phrase": "theoretical_insights"}, {"score": 0.0027305272327742642, "phrase": "hype_generation"}, {"score": 0.002713260031399583, "phrase": "methodological_insights"}, {"score": 0.002696101728474703, "phrase": "internet_researchers"}, {"score": 0.00267905164093555, "phrase": "emergent_online_hypes"}, {"score": 0.0022500718322135747, "phrase": "arima"}, {"score": 0.0021454671611847507, "phrase": "media_origins"}, {"score": 0.0021049977753042253, "phrase": "especially_the_interaction"}], "paper_keywords": ["Hype", " ARIMA modelling", " Blog analysis", " Climategate", " Newspaper analysis", " Semantic co-word networks"], "paper_abstract": "Purpose - Research into the emergence of a hype requires a mixed methods approach that takes into account both the evolution over time and mutual influences across different types of media. The purpose of this paper is to present a methodological approach to detect an emerging hype in online communications. Design/methodology/approach - The paper combines Auto Regressive Integrated Moving Average (ARIMA) time series modelling and semantic co-word networks, and this combination of methods provides a view on the emergence and development of a hype at the level of mutual influences across a heterogeneous set of newspaper and blog data. The subject scope of the paper is the climategate hype. The climategate hype was triggered by the online publication of a set of hacked e-mails belonging to climate researchers at the East Anglia University in November 2009. Findings - The main findings show that the climategate hype was initiated in the blogs, and the newspapers were reacting to the blogs. At the level of semantics, the blogs and the newspapers framed the issue from opposite perspectives. Research limitations/implications - The combination of methods contributes theoretical insights to how blogs interact with more traditional media on hype generation and methodological insights to internet researchers investigating emergent online hypes. The method calls for further validation. Practical implications - Investigating the emergence and evolution of a hype, and the interaction of the two media is relevant for journalists in becoming more reflexive in their practices and the cues from the outside world. Originality/value - The paper is novel in its combination of the two specific methods, ARIMA time series modelling and co-word networks and its attempt to identify the media origins of a hype, and especially the interaction between blogs and newspapers.", "paper_title": "The creation of the climategate hype in blogs and newspapers: mixed methods approach", "paper_id": "WOS:000359055600005"}