{"auto_keywords": [{"score": 0.026444436012864905, "phrase": "artificial_intelligence"}, {"score": 0.00481495049065317, "phrase": "next_association"}, {"score": 0.004518442937844318, "phrase": "mining_bibliographic_data"}, {"score": 0.004240116703465252, "phrase": "important_task"}, {"score": 0.004198839649063847, "phrase": "decision_makers"}, {"score": 0.0038827100184187805, "phrase": "key_role"}, {"score": 0.0034020946201397057, "phrase": "evaluating_process"}, {"score": 0.0030696773722514105, "phrase": "proposed_method"}, {"score": 0.002769650208851401, "phrase": "unified_prediction"}, {"score": 0.002742648551009682, "phrase": "improved_accuracy"}, {"score": 0.0026372419109713923, "phrase": "model's_ability"}, {"score": 0.002276717177453959, "phrase": "next_aaai_fellowship_winners"}, {"score": 0.002157223877108711, "phrase": "previous_measurement_methods"}, {"score": 0.0021049977753042253, "phrase": "precision_rate"}], "paper_keywords": [""], "paper_abstract": "Accurately evaluating a researcher and the quality of his or her work is an important task when decision makers have to decide on such matters as promotions and awards. Publications and citations play a key role in this task, and many previous studies have proposed using measurements based on them for evaluating researchers. Machine learning techniques as a way of enhancing the evaluating process have been relatively unexplored. We propose using a machine learning approach for evaluating researchers. In particular, the proposed method combines the outputs of three learning techniques (logistics regression, decision trees, and artificial neural networks) to obtain a unified prediction with improved accuracy. We conducted several experiments to evaluate the model's ability to: (a) classify researchers in the field of artificial intelligence as Association for the Advancement of Artificial Intelligence (AAAI) fellows and (b) predict the next AAAI fellowship winners. We show that both our classification and prediction methods are more accurate than are previous measurement methods, and reach a precision rate of 96% and a recall of 92%.", "paper_title": "Who Is Going to Win the Next Association for the Advancement of Artificial Intelligence Fellowship Award? Evaluating Researchers by Mining Bibliographic Data", "paper_id": "WOS:000297303100014"}