{"auto_keywords": [{"score": 0.045733453901238535, "phrase": "process_instances"}, {"score": 0.009818450201472196, "phrase": "event_log"}, {"score": 0.00481495049065317, "phrase": "logical_decision_trees"}, {"score": 0.004702092660370367, "phrase": "process_delays"}, {"score": 0.0046650615456476155, "phrase": "event_logs"}, {"score": 0.004225950334493496, "phrase": "process_mining_techniques"}, {"score": 0.004046020290832207, "phrase": "large_number"}, {"score": 0.0038431888954930083, "phrase": "actual_cause"}, {"score": 0.0037679023889496885, "phrase": "different_problem"}, {"score": 0.003115908199991072, "phrase": "possible_causes"}, {"score": 0.002867268370615848, "phrase": "logical_representation"}, {"score": 0.0028110458014332187, "phrase": "decision_tree_induction"}, {"score": 0.0024960634897058394, "phrase": "average_duration"}, {"score": 0.002324238863944163, "phrase": "real-world_event_logs"}, {"score": 0.0022606512324475584, "phrase": "meaningful_causes"}, {"score": 0.002155656133617155, "phrase": "domain_experts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Process mining", " Performance analysis", " Logical decision trees", " Regression trees", " Root cause analysis"], "paper_abstract": "In real-world business processes it is often difficult to explain why some process instances take longer than usual to complete. With process mining techniques, it is possible to do an a posteriori analysis of a large number of process instances and detect the occurrence of delays, but discovering the actual cause of such delays is a different problem. For example, it may be the case that when a certain activity is performed or a certain user (or combination of users) participates in the process, the process suffers a delay. In this work, we show that it is possible to retrieve possible causes of delay based on the information recorded in an event log. The approach consists in translating the event log into a logical representation, and then applying decision tree induction to classify process instances according to duration. Besides splitting those instances into several subsets, each path in the tree yields a rule that explains why a given subset has an average duration that is higher or lower than other subsets of instances. The approach is applied in two case studies involving real-world event logs, where it succeeds in discovering meaningful causes of delay, some of which having been pointed out by domain experts. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Using logical decision trees to discover the cause of process delays from event logs", "paper_id": "WOS:000354583400016"}