{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "object-oriented_frameworks"}, {"score": 0.015535971669675044, "phrase": "aspect-oriented_programming"}, {"score": 0.004591345494188032, "phrase": "common_and_useful_technology"}, {"score": 0.004430452655732319, "phrase": "software_system_families"}, {"score": 0.004100851549096203, "phrase": "object-oriented_mechanisms"}, {"score": 0.003576416581189713, "phrase": "crosscutting_nature"}, {"score": 0.0033898953358387075, "phrase": "main_causes"}, {"score": 0.002801849371896573, "phrase": "extension_join_points"}, {"score": 0.0026241684260044414, "phrase": "existing_crosscutting_extension_points"}, {"score": 0.0025623821393275146, "phrase": "framework_extensibility"}, {"score": 0.0025169965861573185, "phrase": "superior_composability"}, {"score": 0.002472412920623605, "phrase": "framework_core_functionality"}, {"score": 0.002329412930430366, "phrase": "diverse_domains"}], "paper_keywords": [""], "paper_abstract": "Object-oriented frameworks are nowadays a common and useful technology used in the implementation of software system families. Despite their benefits, over the last years many researchers have described the inadequacy of object-oriented mechanisms to address the modularization and composition of many framework features, thus reducing the extent to which a framework can be extended. The crosscutting nature of many framework features is identified as one of the main causes of these problems. In this paper, we analyze how aspect-oriented programming can help to improve the design, implementation, and extension of object-oriented frameworks. We propose the concept of Extension Join Points (EJPs) as a way of designing and documenting existing crosscutting extension points. EJPs improve framework extensibility, including superior composability of the framework core functionality with other modules or frameworks. Four case studies of frameworks from diverse domains are presented to illustrate our proposal. This paper also discusses lessons learned on the application of our approach to the development and extension of these frameworks.", "paper_title": "Improving extensibility of object-oriented frameworks with aspect-oriented programming", "paper_id": "WOS:000238575400017"}