{"auto_keywords": [{"score": 0.04008364158880181, "phrase": "social_network"}, {"score": 0.00481495049065317, "phrase": "web-based_social_network"}, {"score": 0.004737201825299411, "phrase": "dynamic_websites"}, {"score": 0.004585433265422727, "phrase": "content_management_systems"}, {"score": 0.004456611869693865, "phrase": "chronologically_ordered_stories"}, {"score": 0.0039280803011236395, "phrase": "new_types"}, {"score": 0.0038962096720793443, "phrase": "social_relations"}, {"score": 0.003635503288514593, "phrase": "emerging_social_structures"}, {"score": 0.003419943984098415, "phrase": "self-organizing_maps"}, {"score": 0.0027108021939930014, "phrase": "proposed_procedure"}, {"score": 0.0024781515864648242, "phrase": "blogalia"}, {"score": 0.002350152413458658, "phrase": "complete_set"}, {"score": 0.002283984048569816, "phrase": "som_projections"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Weblogs", " Blogs", " Neural networks", " Self-organizing maps", " Application of Kohonen maps", " Web-based communities", " Social networks", " Social network evolution", " Social network Visualization"], "paper_abstract": "Weblogs are dynamic websites updated via easy-to-use content management systems and organized as a set of chronologically ordered stories, frequently built around a link or including links to other weblogs. Since they are managed by individuals, their links tend to mirror or, in some cases, establish new types of social relations, thereby creating a social network. Studying the evolution of this network allows the discovery of emerging social structures and their growth trends. In this paper, we demonstrate the advantages of using the self-organizing maps (SOM) to visualize the evolution of a social network formed by a set of blogs, from their beginning to their current state. By observing the position a weblog is mapped to, it is easy to see what communities it belongs to nowadays, and how and when it became a part of those communities. The proposed procedure gives some insight on how communities are formed and have evolved. In this study, we apply this method to Blogalia, a blog-hosting site from which we have obtained a complete set of data and, by using SOM projections., we have drawn some conclusions on what drives the evolution of its implicit social network. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Visualizing the evolution of a web-based social network", "paper_id": "WOS:000262946600017"}