{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sds"}, {"score": 0.01185978456157637, "phrase": "fixed-outline_floorplanning"}, {"score": 0.010021458718794436, "phrase": "layout_height"}, {"score": 0.0063726368302032925, "phrase": "layout_width"}, {"score": 0.006108664378105673, "phrase": "soft_blocks"}, {"score": 0.0052452431682190395, "phrase": "previous_work"}, {"score": 0.004276216827737399, "phrase": "proposed_algorithm"}, {"score": 0.003301461490509176, "phrase": "simple_heuristic"}, {"score": 0.0030586736004285216, "phrase": "global_total_amount"}, {"score": 0.003032820755030689, "phrase": "available_slack"}, {"score": 0.0030071857666598193, "phrase": "individual_block"}, {"score": 0.0029565620771207003, "phrase": "whole_shaping_process"}, {"score": 0.002821685815956478, "phrase": "optimal_solution"}, {"score": 0.0026929458952693465, "phrase": "shaping_solution"}, {"score": 0.0022530375696567136, "phrase": "comprehensive_experiments"}, {"score": 0.002215081186105616, "phrase": "mcnc_and_hb_benchmarks"}, {"score": 0.0021319959284827896, "phrase": "best_experimental_result"}, {"score": 0.0021049977753042253, "phrase": "significantly_faster_runtime"}], "paper_keywords": ["Block shaping", " fixed-outline floorplanning", " very large scale integration physical design"], "paper_abstract": "This paper presents an efficient, scalable, and optimal slack-driven shaping algorithm for soft blocks in non-slicing floorplan. The proposed algorithm is called SDS. SDS is specifically formulated for fixed-outline floorplanning. Given a fixed upper bound on the layout width, SDS minimizes the layout height by only shaping the soft blocks in the design. Iteratively, SDS shapes some soft blocks to minimize the layout height with the guarantee that the layout width would not exceed the given upper bound. Rather than using some simple heuristic as in previous work, the amount of change on each block is determined by systematically distributing the global total amount of available slack to individual block. During the whole shaping process, the layout height monotonically reduces and eventually converges to an optimal solution. Two optimality conditions are presented to check the optimality of a shaping solution for fixed-outline floorplanning. In practice, to terminate the process of convergence early, we propose two different stopping criteria. We also extend SDS to handle other floorplanning problems, e. g., classical floorplanning. To validate the efficiency and effectiveness of SDS, comprehensive experiments are conducted on MCNC and HB benchmarks. Compared with previous work, SDS achieves the best experimental result with a significantly faster runtime.", "paper_title": "SDS: An Optimal Slack-Driven Block Shaping Algorithm for Fixed-Outline Floorplanning", "paper_id": "WOS:000314677400002"}