{"auto_keywords": [{"score": 0.048658242994016845, "phrase": "iptv"}, {"score": 0.004533427352547707, "phrase": "internet_access"}, {"score": 0.004494570360108983, "phrase": "backbone_isps"}, {"score": 0.004456044928556639, "phrase": "massive_amounts"}, {"score": 0.004417848254181138, "phrase": "new_traffic"}, {"score": 0.004286708921931472, "phrase": "iptv_video_distribution"}, {"score": 0.003751011827704279, "phrase": "in-depth_measurement_study"}, {"score": 0.0035162927451540065, "phrase": "dedicated_pplive_crawler"}, {"score": 0.0033971539563683174, "phrase": "global_characteristics"}, {"score": 0.003353521531649663, "phrase": "mesh-pull_pplive_system"}, {"score": 0.003267925215811654, "phrase": "extensive_packet"}, {"score": 0.003170811465728631, "phrase": "campus_access_networks"}, {"score": 0.0031435968684569112, "phrase": "residential_access_networks"}, {"score": 0.0031032109441552287, "phrase": "measurement_results"}, {"score": 0.0030239842475439814, "phrase": "important_insights"}, {"score": 0.002822434555587263, "phrase": "similar_viewing_behaviors"}, {"score": 0.0027982016314450717, "phrase": "regular_tv_users"}, {"score": 0.002566997205079849, "phrase": "video_proxy"}, {"score": 0.002375253757224999, "phrase": "long_start-up_delays"}], "paper_keywords": ["IPTV", " measurement", " peer-to-peer streaming"], "paper_abstract": "An emerging Internet application, IPTV, has the potential to flood Internet access and backbone ISPs with massive amounts of new traffic. Although many architectures are possible for IPTV video distribution, several mesh-pull P2P architectures have been successfully deployed on the Internet. In order to gain insights into mesh-pull P2P IPTV systems and the traffic loads they place on ISPs, we have undertaken an in-depth measurement study of one of the most popular IPTV systems, namely, PPLive. We have developed a dedicated PPLive crawler, which enables us to study the global characteristics of the mesh-pull PPLive system. We have also collected extensive packet traces for various different measurement scenarios, including both campus access networks and residential access networks. The measurement results obtained through these platforms bring important insights into P2P IPTV systems. Specifically, our results show the following. 1) P2P IPTV users have the similar viewing behaviors as regular TV users. 2) During its session, a peer exchanges video data dynamically with a large number of peers. 3) A small set of super peers act as video proxy and contribute significantly to video data uploading. 4) Users in the measured P2P IPTV system still suffer from long start-up delays and playback lags, ranging from several seconds to a couple of minutes. Insights obtained in this study will be valuable for the development and deployment of future P2P IPTV systems.", "paper_title": "A measurement study of a large-scale P2P IPTV system", "paper_id": "WOS:000251109900012"}