{"auto_keywords": [{"score": 0.04425618028201676, "phrase": "end-user_training"}, {"score": 0.00481495049065317, "phrase": "e-bank"}, {"score": 0.004644014990871423, "phrase": "information_systems"}, {"score": 0.004479120557712926, "phrase": "human_behaviors"}, {"score": 0.0028864239961184364, "phrase": "qualitative_case_study"}, {"score": 0.0025892330566358503, "phrase": "training_model"}, {"score": 0.0025625730386900237, "phrase": "simonsen"}, {"score": 0.0023958326775913165, "phrase": "systems_development_cycle"}, {"score": 0.0022283519468680475, "phrase": "systems_development"}, {"score": 0.0022053994402287925, "phrase": "organizational_implementation"}, {"score": 0.0021049977753042253, "phrase": "practical_suggestions"}], "paper_keywords": ["Elderly Users", " Electronic Banking", " End-User Training", " Organizational Implementation", " Qualitative Research", " Systems Design", " User Involvement"], "paper_abstract": "Introducing information systems into organizations initiates a change in human behaviors, which is often perceived as obtrusive and distracting. End-user training may help manage this challenge by getting the users familiar with the system and its functionality. However, end-user training is not easy, nor self-evident, as shown in this paper This is problematic, particularly when organization-wide standards for how to provide training are missing or when the group of end-users is two-layered, that is, both the customers and the staff must be trained. In this paper the authors describe a qualitative case study of how the end-user training on an e-Bank was organized, and how the training was delivered to its elderly customers. The training model by Simonsen and Sein (2004) is utilized and extended to cover the systems development cycle. The authors argue that an approach that integrates the end-user training with the systems development improves organizational implementation. As a result, this paper makes practical suggestions about the issues related to organizing end-user training.", "paper_title": "Organizing End-User Training: A Case Study of an E-Bank and its Elderly Customers", "paper_id": "WOS:000288140100005"}