{"auto_keywords": [{"score": 0.04547624598453918, "phrase": "fuzzy_metric_space"}, {"score": 0.010612387000973441, "phrase": "fuzzy_metric_spaces"}, {"score": 0.009894504210406389, "phrase": "lipschitz"}, {"score": 0.007621425240760573, "phrase": "minimal_slope"}, {"score": 0.004202472962684885, "phrase": "continuity_properties"}, {"score": 0.003975781274672803, "phrase": "fuzzy_lipschitz_distance"}, {"score": 0.0027370861653820263, "phrase": "george"}, {"score": 0.0027095894846759765, "phrase": "veeramani"}, {"score": 0.0024993218789131437, "phrase": "fixed_point"}, {"score": 0.0023405257495466352, "phrase": "kramosil"}, {"score": 0.0023170058312511383, "phrase": "michalek"}, {"score": 0.002214048743052355, "phrase": "grabiec"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Cauchy sequence", " Contractive mappings", " Fixed point", " Fuzzy metric space", " Lipschitz map"], "paper_abstract": "In this paper, we introduce the notion of dilation and fuzzy Lipschitz of a map from a fuzzy metric space into a fuzzy metric space and we prove continuity properties for such maps. We also define the notion of the fuzzy Lipschitz distance between two fuzzy metric spaces and show that two compact fuzzy metric spaces whose Lipschitz distance is zero is fuzzy isometric to each other. On the other hand, we introduce the concept of minimal slope of a map between fuzzy metric spaces, which is defined by the ratio of two fuzzy metrics and derive some properties on it and relations with the dilation. In particular, we show that if the dilation of a map from a fuzzy metric space which is complete in George and Veeramani sense into itself is less than the minimal slope, then the map must have a fixed point. In case that a fuzzy metric space is considered in the sense of Kramosil and Michalek and that the completeness in the sense of Grabiec, the same result holds. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Fuzzy Lipschitz maps and fixed point theorems in fuzzy metric spaces", "paper_id": "WOS:000276139800006"}