{"auto_keywords": [{"score": 0.02799186975526375, "phrase": "numa"}, {"score": 0.00481495049065317, "phrase": "high_quality"}, {"score": 0.004552255360140208, "phrase": "finite_element_simulations"}, {"score": 0.004347972379250724, "phrase": "parallel_image"}, {"score": 0.00411064950774695, "phrase": "quality_and_fidelity_guarantees"}, {"score": 0.0040481944502103505, "phrase": "dynamic_point_insertions"}, {"score": 0.003581412258960711, "phrase": "good_shape"}, {"score": 0.003120099687922751, "phrase": "single-threaded_efficiency"}, {"score": 0.002718045523483502, "phrase": "blacklight"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Parallel Delaunay mesh refinement", " Scalability", " Quality", " Fidelity", " Shared-memory"], "paper_abstract": "In this paper, we present a parallel Image-to-Mesh Conversion (I2M) algorithm with quality and fidelity guarantees achieved by dynamic point insertions and removals. Starting directly from an image, its implementation is capable of recovering the isosurface and meshing the volume with tetrahedra of good shape. Our tightly-coupled shared-memory parallel speculative execution paradigm employs carefully designed contention managers, load balancing, synchronization and optimizations schemes. These techniques are shown to boost not only the parallel but also the single-threaded efficiency of our code. Specifically, our single-threaded performance is faster than both CGAL and TetGen, the state of the art sequential open source meshing tools we are aware of. The effectiveness of our method is demonstrated on Blacklight, the Pittsburgh Supercomputing Center's cache-coherent NUMA machine. We observe a more than 82% strong scaling efficiency for up to 64 cores, and a more than 82% weak scaling efficiency for up to 144 cores, reaching a rate of more than 14.3 million elements per second. This is the fastest 3D Delaunay mesh generation and refinement algorithm, to the best of our knowledge. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "High quality real-time Image-to-Mesh conversion for finite element simulations", "paper_id": "WOS:000329952000009"}