{"auto_keywords": [{"score": 0.040855906235626405, "phrase": "gps."}, {"score": 0.00481495049065317, "phrase": "user_places"}, {"score": 0.004561019117546361, "phrase": "mobile_devices"}, {"score": 0.00441909542037375, "phrase": "user_situations"}, {"score": 0.003929391999210588, "phrase": "wi-fi_fingerprints"}, {"score": 0.0037052054802048707, "phrase": "meaningful_stay_regions"}, {"score": 0.0033544692489307676, "phrase": "real_traces"}, {"score": 0.0033242742850902295, "phrase": "six_different_users"}, {"score": 0.0031629800646754505, "phrase": "stay_mode"}, {"score": 0.002915701586760994, "phrase": "novel_approach"}, {"score": 0.002724428781940696, "phrase": "tested_aggregation_schemes"}, {"score": 0.002687702958515561, "phrase": "fingerprint_similarity_approach"}, {"score": 0.0025804616931593897, "phrase": "determined_stay_regions"}, {"score": 0.0021049977753042253, "phrase": "context_awareness"}], "paper_keywords": [""], "paper_abstract": "With the analysis of various sensor data from the mobile devices, it is possible to extract user situations, so-called user context. This is needed for the development of modern, user-friendly services. Therefore, we developed a simple, nonintrusive, and automatic method based on the Wi-Fi fingerprints and GPS. The method finds user stay points, aggregates them into meaningful stay regions, and assigns them four general user contexts: home, work, transit, and free time. We evaluated its performance on the real traces of six different users who annotated their contexts over eight days. The method determined the stay mode of the users with accuracy, precision, and recall of above 96%. In combination with the novel approach for aggregation, all regions relevant to the users were determined. Among the tested aggregation schemes, the fingerprint similarity approach worked the best. The context of the determined stay regions was on average accurately inferred in 98% of the time. For the contexts home, work, and free time, the precision and recall exceeded 86%. The results indicate that the method is robust and can be deployed in various fields where context awareness is desired.", "paper_title": "An Automatic Wi-Fi-Based Approach for Extraction of User Places and Their Context", "paper_id": "WOS:000354298500001"}