{"auto_keywords": [{"score": 0.025946863966317176, "phrase": "minimum_loss"}, {"score": 0.00481495049065317, "phrase": "dimensionality_reduction_algorithms"}, {"score": 0.004685224205630963, "phrase": "dimensionality_reduction"}, {"score": 0.004466519142879166, "phrase": "increasing_need"}, {"score": 0.0044209926093642235, "phrase": "huge_amounts"}, {"score": 0.004346139434813299, "phrase": "dr_methods"}, {"score": 0.0042725481832853315, "phrase": "initial_features"}, {"score": 0.0040591367766929344, "phrase": "original_properties"}, {"score": 0.00388278852285898, "phrase": "inherent_loss"}, {"score": 0.003663645143713398, "phrase": "data_analysis"}, {"score": 0.003516417950483685, "phrase": "dr_method"}, {"score": 0.003284026247389735, "phrase": "different_dr_methods"}, {"score": 0.002364777610365689, "phrase": "interesting_relationships"}, {"score": 0.002340623433237658, "phrase": "quality_assessment_criteria"}, {"score": 0.0022774088820755366, "phrase": "appropriate_choice"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Manifold learning", " Nonlinear dimensionality reduction", " Linear dimensionality reduction", " Loss of quality", " Quality assessment criteria"], "paper_abstract": "Dimensionality Reduction (DR) is attracting more attention these days as a result of the increasing need to handle huge amounts of data effectively. DR methods allow the number of initial features to be reduced considerably until a set of them is found that allows the original properties of the data to be kept. However, their use entails an inherent loss of quality that is likely to affect the understanding of the data, in terms of data analysis. This loss of quality could be determinant when selecting a DR method, because of the nature of each method. In this paper, we propose a methodology that allows different DR methods to be analyzed and compared as regards the loss of quality produced by them. This methodology makes use of the concept of preservation of geometry (quality assessment criteria) to assess the loss of quality. Experiments have been carried out by using the most well-known DR algorithms and quality assessment criteria, based on the literature. These experiments have been applied on 12 real-world datasets. Results obtained so far show that it is possible to establish a method to select the most appropriate DR method, in terms of minimum loss of quality. Experiments have also highlighted some interesting relationships between the quality assessment criteria. Finally, the methodology allows the appropriate choice of dimensionality for reducing data to be established, whilst giving rise to a minimum loss of quality. (c) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A methodology to compare Dimensionality Reduction algorithms in terms of loss of quality", "paper_id": "WOS:000335635600001"}