{"auto_keywords": [{"score": 0.04677390566575793, "phrase": "respiratory_effort"}, {"score": 0.03071530983234886, "phrase": "dw-based_features"}, {"score": 0.015719716506582538, "phrase": "dynamic_warping"}, {"score": 0.00457553517865013, "phrase": "automatic_sleep"}, {"score": 0.004544521651302002, "phrase": "wake_classification"}, {"score": 0.004452810425447774, "phrase": "dw"}, {"score": 0.004347972379250724, "phrase": "optimal_nonlinear_alignment"}, {"score": 0.0037562016088622447, "phrase": "respiratory_effort_recording"}, {"score": 0.0036677697040669957, "phrase": "optimally_aligned_epoch"}, {"score": 0.0032117325375830407, "phrase": "entire-night_recording"}, {"score": 0.003062201383165999, "phrase": "-subject_variations"}, {"score": 0.002850819170139645, "phrase": "linear_discriminant_classifier"}, {"score": 0.0027088011534576856, "phrase": "cohen's_kappa_coefficient"}, {"score": 0.0026002844796442818, "phrase": "existing_respiratory-based_features"}, {"score": 0.002339601774631419, "phrase": "earlier_actigraphy-"}, {"score": 0.002323708293955822, "phrase": "respiratory-based_feature_set"}, {"score": 0.0021928902836049384, "phrase": "actigraphy-_and_cardiorespiratory-based_feature"}, {"score": 0.002155831935645973, "phrase": "important_advantage"}, {"score": 0.0021049977753042253, "phrase": "ecg_signal"}], "paper_keywords": ["Dynamic warping (DW)", " feature extraction", " respiratory effort", " sleep and wake classification", " unobtrusive monitoring"], "paper_abstract": "This paper proposes the use of dynamic warping (DW) methods for improving automatic sleep and wake classification using actigraphy and respiratory effort. DW is an algorithm that finds an optimal nonlinear alignment between two series allowing scaling and shifting. It is widely used to quantify (dis)similarity between two series. To compare the respiratory effort between sleep and wake states by means of (dis)similarity, we constructed two novel features based on DW. For a given epoch of a respiratory effort recording, the features search for the optimally aligned epoch within the same recording in time and frequency domain. This is expected to yield a high (or low) similarity score when this epoch is sleep (or wake). Since the comparison occurs throughout the entire-night recording of a subject, it may reduce the effects of within- and between-subject variations of the respiratory effort, and thus help discriminate between sleep and wake states. The DW-based features were evaluated using a linear discriminant classifier on a dataset of 15 healthy subjects. Results show that the DW-based features can provide a Cohen's Kappa coefficient of agreement kappa = 0.59 which is significantly higher than the existing respiratory-based features and is comparable to actigraphy. After combining the actigraphy and the DW-based features, the classifier achieved a kappa of 0.66 and an overall accuracy of 95.7%, outperforming an earlier actigraphy- and respiratory-based feature set (kappa = 0.62). The results are also comparable with those obtained using an actigraphy- and cardiorespiratory-based feature set but have the important advantage that they do not require an ECG signal to be recorded.", "paper_title": "Sleep and Wake Classification With Actigraphy and Respiratory Effort Using Dynamic Warping", "paper_id": "WOS:000340119000019"}