{"auto_keywords": [{"score": 0.04954517773618335, "phrase": "limited_visibility"}, {"score": 0.04546829290131096, "phrase": "gathering_problem"}, {"score": 0.01566170316278695, "phrase": "mobile_robots"}, {"score": 0.01109523586137649, "phrase": "asynchronous_model"}, {"score": 0.009526663753080852, "phrase": "semi-synchronous_model"}, {"score": 0.00481495049065317, "phrase": "gather_memory-less"}, {"score": 0.004501578643090429, "phrase": "distributed_robotic_systems"}, {"score": 0.003964007795174772, "phrase": "global_coordinate_system"}, {"score": 0.0037336520904376687, "phrase": "inherent_difficulty"}, {"score": 0.003543059748318891, "phrase": "previous_works"}, {"score": 0.0025198477493173187, "phrase": "oblivious_mobile_robots"}, {"score": 0.0023466842270226888, "phrase": "finite_time"}, {"score": 0.002260367486652148, "phrase": "arbitrary_long_periods"}], "paper_keywords": ["Algorithms", " Theory", " Autonomous Mobile Robots", " Self-Organizing Robots", " Cooperation and Control", " Point Formation", " Unreliable Compasses", " Self-Stabilization"], "paper_abstract": "Reaching agreement among a set of mobile robots is one of the most fundamental issues in distributed robotic systems. This problem is often illustrated by the gathering problem, where the robots must self-organize and meet at some location not determined in advance, and without the help of some global coordinate system. While very simple to express, this problem has the advantage of retaining the inherent difficulty of agreement, namely the question of breaking symmetry between robots. In previous works, it has been proved that the gathering problem is solvable in asynchronous model with oblivious (i.e., memory-less) robots and limited visibility, as long as the robots share the knowledge of some direction, as provided by a compass. However, the problem has no solution in the semi-synchronous model when robots do not share a compass, or when they cannot detect multiplicity. In this article, we define a model in which compasses may be unreliable, and study the solvability of gathering oblivious mobile robots with limited visibility in the semi-synchronous model. In particular, we give an algorithm that solves the problem in finite time in a system where compasses are unstable for some arbitrary long periods, provided that they stabilize eventually. In addition, we show that our algorithm solves the gathering problem for at most three robots in the asynchronous model. Our algorithm is intrinsically self-stabilizing.", "paper_title": "Using Eventually Consistent Compasses to Gather Memory-Less Mobile Robots with Limited Visibility", "paper_id": "WOS:000265879600009"}