{"auto_keywords": [{"score": 0.03914099322299746, "phrase": "isdt"}, {"score": 0.02322730111336098, "phrase": "theory_development"}, {"score": 0.023067551920634637, "phrase": "design_science_research"}, {"score": 0.01981272415205513, "phrase": "dsris"}, {"score": 0.0164284996151193, "phrase": "drept"}, {"score": 0.005627528209645743, "phrase": "dsris."}, {"score": 0.004551563730037998, "phrase": "information_systems"}, {"score": 0.004394281902031765, "phrase": "directive_design_theory"}, {"score": 0.004227515355865597, "phrase": "dsris_project"}, {"score": 0.0037773674108196376, "phrase": "multiple_perspectives"}, {"score": 0.003737697279708501, "phrase": "framework_positions"}, {"score": 0.003223995503078124, "phrase": "design_realm"}, {"score": 0.0031344430376015033, "phrase": "knowledge_representation_perspective"}, {"score": 0.0030906010704382374, "phrase": "typological_and_epistemological_perspectives"}, {"score": 0.002983652306921617, "phrase": "directive-prescriptive_theory"}, {"score": 0.002931569771634119, "phrase": "explanatory-predictive_theory"}, {"score": 0.0026375718041787, "phrase": "mid-range_theory"}, {"score": 0.0025642664420937327, "phrase": "specific_context"}, {"score": 0.0023646398663605493, "phrase": "design_theory_semantics"}, {"score": 0.002339771435910601, "phrase": "epistemological_view"}, {"score": 0.0022667208478315323, "phrase": "idealized_design_science_research_cycle"}], "paper_keywords": ["Design Science Research", " Theory Development", " Mid-Range Theory", " Framework"], "paper_abstract": "One point of convergence in the many recent discussions on design science research in information systems (DSRIS) has been the desirability of a directive design theory (ISDT) as one of the outputs from a DSRIS project. However, the literature on theory development in DSRIS is very sparse. In this paper, we develop a framework to support theory development in DSRIS and explore its potential from multiple perspectives. The framework positions ISDT in a hierarchy of theories in IS design that includes a type of theory for describing how and why the design functions: Design-relevant explanatory/predictive theory (DREPT). DREPT formally captures the translation of general theory constructs from outside IS to the design realm. We introduce the framework from a knowledge representation perspective and then provide typological and epistemological perspectives. We begin by motivating the desirability of both directive-prescriptive theory (ISDT) and explanatory-predictive theory (DREPT) for IS design science research and practice. Since ISDT and DREPT are both, by definition, mid-range theories, we examine the notion of mid-range theory in other fields and then in the specific context of DSRIS. We position both types of theory in Gregor's (2006) taxonomy of IS theory in our typological view of the framework. We then discuss design theory semantics from an epistemological view of the framework, relating it to an idealized design science research cycle. To demonstrate the potential of the framework for DSRIS, we use it to derive ISDT and DREPT from two published examples of DSRIS.", "paper_title": "A Framework for Theory Development in Design Science Research: Multiple Perspectives", "paper_id": "WOS:000307847300001"}