{"auto_keywords": [{"score": 0.042824247178514574, "phrase": "eta-ne_region"}, {"score": 0.00987979203606845, "phrase": "ic"}, {"score": 0.00481495049065317, "phrase": "two-user_decentralized_interference_channel"}, {"score": 0.00456826120534987, "phrase": "gaussian"}, {"score": 0.004416079619543104, "phrase": "perfect_output_feedback"}, {"score": 0.003934970057482768, "phrase": "rate_pairs"}, {"score": 0.0037322713756404295, "phrase": "transmitter-receiver_pairs"}, {"score": 0.0036261282565554507, "phrase": "eta-optimal_individual_transmission_rate"}, {"score": 0.0035399770257915466, "phrase": "rate_tuple"}, {"score": 0.002690886043654469, "phrase": "rate_pair"}, {"score": 0.002420501440149043, "phrase": "pareto"}, {"score": 0.0023178219772486868, "phrase": "eta-ne_transmit-receive_configuration"}, {"score": 0.0021049977753042253, "phrase": "capacity_region"}], "paper_keywords": ["Interference channels", " feedback communications", " Gaussian channels", " wireless networks", " distributed information systems"], "paper_abstract": "In this paper, the eta-Nash equilibrium (eta-NE) region of the two-user Gaussian interference channel (IC) with perfect output feedback is approximated to within 1 bit/s/Hz and eta arbitrarily close to 1 bit/s/Hz. The relevance of the eta-NE region is that it provides the set of rate pairs that are achievable and stable in the IC when both transmitter-receiver pairs autonomously tune their own transmit-receive configurations seeking an eta-optimal individual transmission rate. Therefore, any rate tuple outside the eta-NE region is not stable as there always exists one link able to increase by at least eta bits/s/Hz its own transmission rate by updating its own transmit-receive configuration. The main insights that arise from this paper are as follows. First, the eta-NE region achieved with feedback is larger than or equal to the eta-NE region without feedback. More importantly, for each rate pair achievable at an eta-NE without feedback, there exists at least one rate pair achievable at an eta-NE with feedback that is weakly Pareto superior. Second, there always exists an eta-NE transmit-receive configuration that achieves a rate pair that is at most 1 bit/s/Hz per user away from the outer bound of the capacity region.", "paper_title": "Perfect Output Feedback in the Two-User Decentralized Interference Channel", "paper_id": "WOS:000361486800016"}