{"auto_keywords": [{"score": 0.04902896582647278, "phrase": "automated_trust_negotiation"}, {"score": 0.00481495049065317, "phrase": "peer_framework"}, {"score": 0.004761850836420121, "phrase": "accelerating_trust_establishment"}, {"score": 0.004504969093304219, "phrase": "mutual_trust"}, {"score": 0.004145287175409325, "phrase": "digitally_signed_credentials"}, {"score": 0.0033384259516301223, "phrase": "involved_resources"}, {"score": 0.0031405975280029913, "phrase": "trust_negotiation_framework"}, {"score": 0.0025570607111118793, "phrase": "disclosure_sequences"}, {"score": 0.0025287979714720423, "phrase": "locally_trusted_peers"}, {"score": 0.0024594969044952108, "phrase": "declaration_tickets"}, {"score": 0.0023394947463129642, "phrase": "exchanged_credentials"}, {"score": 0.0023136311468961125, "phrase": "credential_validations"}, {"score": 0.0022377394845878268, "phrase": "experimental_results"}], "paper_keywords": ["Trust negotiation", " Framework", " Trust sequence generation", " Credential validation"], "paper_abstract": "Automated trust negotiation is an approach that establishes mutual trust between strangers wishing to share resources or conduct business by gradually requesting and disclosing digitally signed credentials. Sometimes negotiators do not have very strict security requirements or the efficiency is the most crucial need. In such cases, it is preferable to adopt schemes that speed up negotiations, even if they do not maximize the protection of the involved resources. Therefore, in this paper, we present a trust negotiation framework that speeds up negotiations from two aspects whenever possible, disclosure sequence generation and credential validation, which are computationally expensive during negotiations. The framework we propose presents several innovative features, such as the support for predicting disclosure sequences by locally trusted peers, the use of declaration tickets and proving tickets to reduce the number of exchanged credentials and credential validations. Further, we report experimental results based on our implementation of this framework, which show that our framework can greatly speed up negotiations whenever possible.", "paper_title": "A Peer-to-Peer Framework for Accelerating Trust Establishment in Automated Trust Negotiation", "paper_id": "WOS:000282622100008"}