{"auto_keywords": [{"score": 0.04594615624724187, "phrase": "influence_diagrams"}, {"score": 0.03633255640815653, "phrase": "decision-maker's_characteristics"}, {"score": 0.03261638306028882, "phrase": "decision_problem"}, {"score": 0.00481495049065317, "phrase": "multi-criteria_decision-making."}, {"score": 0.004615202066192795, "phrase": "multi-criteria_decision-making"}, {"score": 0.004085713541752114, "phrase": "different_decision_variables"}, {"score": 0.0038339398365449507, "phrase": "particular_structure"}, {"score": 0.003773449694108617, "phrase": "proposed_model"}, {"score": 0.0028944757265206332, "phrase": "expert_knowledge"}, {"score": 0.0026307897899760383, "phrase": "different_instances"}, {"score": 0.0025618967766999922, "phrase": "infact"}, {"score": 0.0024553821147953463, "phrase": "basic_information"}, {"score": 0.002365815362517737, "phrase": "internal_or_external_factors"}, {"score": 0.0021049977753042253, "phrase": "decision_maker"}], "paper_keywords": ["Influence diagram", " decision", " multi-criteria decision making", " probabilistic graphical model"], "paper_abstract": "In this paper, we focus on multi-criteria decision-making problems. We propose a model based on influence diagrams; this model is able to handle uncertainty, represent interdependencies among the different decision variables and facilitate communication between the decision-maker and the analyst. The particular structure of the proposed model makes it possible to take into account the alternatives described by an attribute set, the decision-maker's characteristics and preferences, and other information (e.g., internal or external factors) that influence the decision. Modeling the decision problem in terms of influence diagrams requires a lot of work to gather expert knowledge. However, once the model is built, it can be easily and efficiently used for different instances of the decision problem. Infact, using our model simply requires entering some basic information, such as the values of internal or external factors and the decision-maker's characteristics. Our model also defines the importance of each criterion in terms of what is known about the decision maker, the quality index and the utility of each alternative.", "paper_title": "A MODEL BASED ON INFLUENCE DIAGRAMS FOR MULTI-CRITERIA DECISION-MAKING", "paper_id": "WOS:000308105000010"}