{"auto_keywords": [{"score": 0.03387648860751041, "phrase": "human_users"}, {"score": 0.010261403078535528, "phrase": "computer_programs"}, {"score": 0.010212230205111398, "phrase": "captcha"}, {"score": 0.007362132294112172, "phrase": "hip_systems"}, {"score": 0.00481495049065317, "phrase": "human_interactive_proof_systems."}, {"score": 0.004722791767189843, "phrase": "great_amount"}, {"score": 0.004392565073466714, "phrase": "special_group"}, {"score": 0.004205570965859848, "phrase": "unauthorized_access"}, {"score": 0.003744780941673966, "phrase": "important_task"}, {"score": 0.0036730297909962142, "phrase": "internet_websites"}, {"score": 0.0034995881411519925, "phrase": "fake_registration"}, {"score": 0.0033830587647810132, "phrase": "web_sties"}, {"score": 0.002855934865505357, "phrase": "important_branches"}, {"score": 0.0028284184438992282, "phrase": "hip_systems_winch"}, {"score": 0.0023303871145705954, "phrase": "current_computer_programs"}, {"score": 0.0021254913611527455, "phrase": "available_hip_systems"}], "paper_keywords": ["CAPTCHA (Completely automated public turing test to tell computers and human apart)", " HIP (Human interactive proof)", " OCR (Optical character recognition)"], "paper_abstract": "Nowadays, a great amount of information is circulated through the Internet Some of them exclusively belong to a special group of users and require protection and safeguarding against unauthorized access To this end, a category of systems called HIP (Human Interactive Proof) are designed to distinguish between various groups of users An important task on. the Internet websites is registration, Some hackers wrote programs to make fake registration that waste the resources of the web sties or even stop them from. providing services Therefore, human users should be distinguished from computer programs CAPTCHA (Completely Automatic Public Turing Test to Tell Computer and Human Apart) methods are one of the important branches of HIP systems winch. am used to distinguish between human users and computer programs automatically. These methods are based oft Artificial Intelligence (AI) topics The goat. of these systems is to ask questions which human users can. easily answer but current computer programs cannot. In this paper, HIP systems (mainly CAPTCHA methods) are surveyed In addition to available HIP systems, various applications of HIP systems and attacks conduct on them. am, studied", "paper_title": "A SURVEY OF HUMAN INTERACTIVE PROOF SYSTEMS", "paper_id": "WOS:000275767800004"}