{"auto_keywords": [{"score": 0.04913322770523618, "phrase": "curvature_lines"}, {"score": 0.01499221520704078, "phrase": "concept_sketches"}, {"score": 0.012597599586090266, "phrase": "regularized_curvature_lines"}, {"score": 0.00481495049065317, "phrase": "rough_concept_sketches"}, {"score": 0.004626553103375699, "phrase": "smooth_surfaces"}, {"score": 0.004392565073466714, "phrase": "rough_concept_sketch"}, {"score": 0.003729065012001506, "phrase": "curved_surfaces"}, {"score": 0.0035973486787314883, "phrase": "flat_or_umbilical_regions"}, {"score": 0.003456427643307907, "phrase": "orthogonal_cross_field"}, {"score": 0.0032164910932827168, "phrase": "cross_field"}, {"score": 0.0029931603112397084, "phrase": "scattered_interpolation"}, {"score": 0.0028302049070944944, "phrase": "sketchy_lines"}, {"score": 0.0027741761880779535, "phrase": "design_sketches"}, {"score": 0.002708399936381754, "phrase": "novel_smoothness_energy"}, {"score": 0.0025918235228843444, "phrase": "energy_subject"}, {"score": 0.002560907803820395, "phrase": "stroke_constraints"}, {"score": 0.0023357913211723884, "phrase": "existing_cross_field_algorithms"}, {"score": 0.0023079225317714815, "phrase": "nonorthogonal_case"}, {"score": 0.0021304214257321, "phrase": "existing_work"}, {"score": 0.0021049977753042253, "phrase": "clean_vector_drawings"}], "paper_keywords": ["Algorithms", " Design", " Human Factors", " Cross field", " nonorthogonal cross field", " regularized curvature line", " sketch-based modeling", " sketch editing", " line drawing interpretation"], "paper_abstract": "Designers frequently draw curvature lines to convey bending of smooth surfaces in concept sketches. We present a method to extrapolate curvature lines in a rough concept sketch, recovering the intended 3D curvature field and surface normal at each pixel of the sketch. This 3D information allows to enrich the sketch with 3D-looking shading and texturing. We first introduce the concept of regularized curvature lines that model the lines designers draw over curved surfaces, encompassing curvature lines and their extension as geodesics over flat or umbilical regions. We build on this concept to define the orthogonal cross field that assigns two regularized curvature lines to each point of a 3D surface. Our algorithm first estimates the projection of this cross field in the drawing, which is nonorthogonal due to foreshortening. We formulate this estimation as a scattered interpolation of the strokes drawn in the sketch, which makes our method robust to sketchy lines that are typical for design sketches. Our interpolation relies on a novel smoothness energy that we derive from our definition of regularized curvature lines. Optimizing this energy subject to the stroke constraints produces a dense nonorthogonal 2D cross field which we then lift to 3D by imposing orthogonality. Thus, one central concept of our approach is the generalization of existing cross field algorithms to the nonorthogonal case. We demonstrate our algorithm on a variety of concept sketches with various levels of sketchiness. We also compare our approach with existing work that takes clean vector drawings as input.", "paper_title": "BendFields: Regularized Curvature Fields from Rough Concept Sketches", "paper_id": "WOS:000354800700001"}