{"auto_keywords": [{"score": 0.04962913836247387, "phrase": "statistical_modelling"}, {"score": 0.02322730111336097, "phrase": "machine_learning"}, {"score": 0.004422632150619634, "phrase": "basic_idea"}, {"score": 0.004258644418211771, "phrase": "weak_classifying_tool"}, {"score": 0.004081385289516914, "phrase": "general_concept"}, {"score": 0.0036958398682001015, "phrase": "predictor_effects"}, {"score": 0.0036610702290043387, "phrase": "statistical_regression_models"}, {"score": 0.0035755653799043, "phrase": "review_article"}, {"score": 0.00326840809777013, "phrase": "adaboost_algorithm"}, {"score": 0.0029454679553901613, "phrase": "methodological_background"}, {"score": 0.0024842242921857705, "phrase": "initial_machine_learning_algorithms"}, {"score": 0.00240328454980006, "phrase": "black-box_prediction_schemes"}, {"score": 0.0023470862747075228, "phrase": "statistical_models"}, {"score": 0.0023139986108451946, "phrase": "straight-forward_interpretation"}, {"score": 0.0022706045233150795, "phrase": "statistical_boosting_algorithms"}, {"score": 0.0022385926290967263, "phrase": "substantial_interest"}, {"score": 0.002125020720324262, "phrase": "important_research_questions"}, {"score": 0.0021049977753042253, "phrase": "modern_biomedicine"}], "paper_keywords": ["Statistical computing", " statistical models", " algorithms", " classification", " machine learning"], "paper_abstract": "Background: The concept of boosting emerged from the field of machine learning. The basic idea is to boost the accuracy of a weak classifying tool by combining various instances into a more accurate prediction. This general concept was later adapted to the field of statistical modelling. Nowadays, boosting algorithms are often applied to estimate and select predictor effects in statistical regression models. Objectives: This review article attempts to highlight the evolution of boosting algorithms from machine learning to statistical modelling. Methods: We describe the AdaBoost algorithm for classification as well as the two most prominent statistical boosting approaches, gradient boosting and likelihood-based boosting for statistical modelling. We highlight the methodological background and present the most common software implementations. Results: Although gradient boosting and likelihood-based boosting are typically treated separately in the literature, they share the same methodological roots and follow the same fundamental concepts. Compared to the initial machine learning algorithms, which must be seen as black-box prediction schemes, they result in statistical models with a straight-forward interpretation. Conclusions: Statistical boosting algorithms have gained substantial interest during the last decade and offer a variety of options to address important research questions in modern biomedicine.", "paper_title": "The Evolution of Boosting Algorithms From Machine Learning to Statistical Modelling", "paper_id": "WOS:000346393200002"}