{"auto_keywords": [{"score": 0.04958720442967608, "phrase": "serial_chest_radiographs"}, {"score": 0.04885877600670675, "phrase": "population-based_and_patient-specific_shape_statistics"}, {"score": 0.015719716506582538, "phrase": "lung_fields"}, {"score": 0.010928793132005319, "phrase": "deformable_contour"}, {"score": 0.004102528738941734, "phrase": "proposed_deformable_model"}, {"score": 0.003997891221012094, "phrase": "modified_scale_invariant_feature_transform"}, {"score": 0.0037381083634085424, "phrase": "general_intensity"}, {"score": 0.0029620573986902416, "phrase": "initial_time-point_images"}, {"score": 0.0029164434911787187, "phrase": "population-based_shape_statistics"}, {"score": 0.0026297428083782875, "phrase": "previous_segmentation_results"}, {"score": 0.0025230952890994236, "phrase": "patient-specific_shape_statistics"}, {"score": 0.0024333239726872604, "phrase": "new_segmentation_result"}, {"score": 0.002286781334850213, "phrase": "segmentation_results"}, {"score": 0.0021826828321952615, "phrase": "proposed_method"}], "paper_keywords": ["deformable model", " scale invariant feature transform (SIFT) local descriptor", " segmentation", " serial chest radiographs", " shape statistics"], "paper_abstract": "This paper presents a new deformable model using both population-based and patient-specific shape statistics to segment lung fields from serial chest radiographs. There are two novelties in the proposed deformable model. First, a modified scale invariant feature transform (SIFT) local descriptor, which is more distinctive than the general intensity and gradient features, is used to characterize the image features in the vicinity of each pixel. Second, the deformable contour is constrained by both population-based and patient-specific shape statistics, and it yields more robust and accurate segmentation of lung fields for serial chest radiographs. In particular, for segmenting the initial time-point images, the population-based shape statistics is used to constrain the deformable contour; as more subsequent images of the same patient are acquired, the patient-specific shape statistics online collected from the previous segmentation results gradually takes more roles. Thus, this patient-specific shape statistics is updated each time when a new segmentation result is obtained, and it is further used to refine the segmentation results of all the available timepoint images. Experimental results show that the proposed method is more robust and accurate than other active shape models in segmenting the lung fields from serial chest radiographs.", "paper_title": "Segmenting lung fields in serial chest radiographs using both population-based and patient-specific shape statistics", "paper_id": "WOS:000254812600005"}