{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "australia"}, {"score": 0.04317918531473724, "phrase": "health_information"}, {"score": 0.004660702714929615, "phrase": "personally_controlled_electronic_health_record"}, {"score": 0.004420472010542188, "phrase": "distributed_model"}, {"score": 0.004366808573435364, "phrase": "key_component"}, {"score": 0.004261419841494814, "phrase": "pcehr"}, {"score": 0.003755949722774176, "phrase": "consumer-facing_part"}, {"score": 0.003680212979775528, "phrase": "method_design"}, {"score": 0.0035913348026306306, "phrase": "stakeholder_consultation"}, {"score": 0.0035189057079817285, "phrase": "detailed_requirements"}, {"score": 0.0034620119220744347, "phrase": "clinical_design_assurance"}, {"score": 0.003433909720151841, "phrase": "results_patients"}, {"score": 0.00335095982979018, "phrase": "posted_information"}, {"score": 0.003310236836421397, "phrase": "web-accessible_'consumer_portal"}, {"score": 0.0031650944584992726, "phrase": "access_controls"}, {"score": 0.002699769374493867, "phrase": "emerging_partnership_model"}, {"score": 0.0025189177411152645, "phrase": "closed_walls"}, {"score": 0.002388817995161952, "phrase": "language_clinicians"}, {"score": 0.0023026973099101876, "phrase": "changed_roles"}, {"score": 0.0021049977753042253, "phrase": "system-wide_activity"}], "paper_keywords": [""], "paper_abstract": "Objective On July 1, 2012 Australia launched a personally controlled electronic health record (PCEHR) designed around the needs of consumers. Using a distributed model and leveraging key component national eHealth infrastructure, the PCEHR is designed to enable sharing of any health information about a patient with them and any other health practitioner involved in their care to whom the patient allows access. This paper discusses the consumer-facing part of the program. Method Design of the system was through stakeholder consultation and the development of detailed requirements, followed by clinical design assurance. Results Patients are able to access any posted information through a web-accessible 'consumer portal.' Within the portal they are able to assert access controls on all or part of their record. The portal includes areas for consumers to record their own personal information. Discussion The PCEHR has the potential to transform the ability of patients to actively engage in their own healthcare, and to enable the emerging partnership model of health and healthcare in medicine. The ability to access health information traditionally kept within the closed walls of institutions also raises challenges for the profession, both in the language clinicians choose and the ethical issues raised by the changed roles and responsibilities. Conclusions The PCEHR is aimed at connecting all participants and their interventions, and is intended to become a system-wide activity.", "paper_title": "A personally controlled electronic health record for Australia", "paper_id": "WOS:000337660600025"}