{"auto_keywords": [{"score": 0.049643973872019624, "phrase": "concept_generation"}, {"score": 0.04166987106365019, "phrase": "design_process"}, {"score": 0.00481495049065317, "phrase": "related_stimuli"}, {"score": 0.004558289038745564, "phrase": "specifically_verbs"}, {"score": 0.0042178318724732005, "phrase": "reasoning_process"}, {"score": 0.004085115444878828, "phrase": "specific_reasoning_processes"}, {"score": 0.0037971749182744334, "phrase": "conceptual_design"}, {"score": 0.003660879039645457, "phrase": "different_stages"}, {"score": 0.0032358709481309913, "phrase": "related_hierarchical_lexical_relationships"}, {"score": 0.0030771609361092164, "phrase": "hierarchical_relationships"}, {"score": 0.0029128614098881253, "phrase": "related_verb_stimuli"}, {"score": 0.00274472767672686, "phrase": "stimuli_sets"}, {"score": 0.002682669289913153, "phrase": "verb_hierarchies"}, {"score": 0.0026461080202599694, "phrase": "functional_words"}, {"score": 0.002610043728801011, "phrase": "problem_statements"}, {"score": 0.0024819522818492284, "phrase": "lower_level"}, {"score": 0.002244277924422011, "phrase": "lower_level_verbs"}, {"score": 0.0021834945657804193, "phrase": "intransitive_verbs"}, {"score": 0.0021049977753042253, "phrase": "direct_object"}], "paper_keywords": ["conceptual design", " design stimuli", " verb-based concept generation"], "paper_abstract": "This paper examines the use of language, specifically verbs, as stimuli for concept generation. Because language has been shown to be important to the reasoning process in general as well as to specific reasoning processes that are central to the design process, we are investigating the relationship between language and conceptual design. The use of language to facilitate different stages of the design process has been investigated in the past. Our previous work, and the work of others, showed that ideas produced can be expressed through related hierarchical lexical relationships, so we investigated the use of verbs within these hierarchical relationships as stimuli for ideas. Participants were provided with four problems and related verb stimuli, and asked to develop concepts using the stimuli provided. The stimuli sets were generated by exploring verb hierarchies based on functional words from the problem statements. We found that participants were most successful when using lower level (more specific) verbs as stimuli, and often higher level general verbs were only used successfully in conjunction with lower level verbs. We also observed that intransitive verbs (verbs that cannot take a direct object) were less likely to be used successfully in the development of concepts. Overall, we found that the verb chosen as stimulus by the participant directly affects the success and the type of concept developed.", "paper_title": "Using language as related stimuli for concept generation", "paper_id": "WOS:000245344900002"}