{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cahn-hilliard_equation"}, {"score": 0.004676895436217523, "phrase": "related_energy-based_models"}, {"score": 0.004438250823243621, "phrase": "numerical_methods"}, {"score": 0.003996727479807572, "phrase": "main_properties"}, {"score": 0.003557283483525861, "phrase": "crucial_aspects"}, {"score": 0.0032031180198375283, "phrase": "time_accuracy_order"}, {"score": 0.003129317057177867, "phrase": "unique_solvability"}, {"score": 0.0029867619862229853, "phrase": "resulting_systems"}, {"score": 0.0028341130433482565, "phrase": "iterative_methods"}, {"score": 0.002752695791351096, "phrase": "nonlinear_schemes"}, {"score": 0.0026119782818898193, "phrase": "physical_and_computational_parameters"}, {"score": 0.002231441081806766, "phrase": "efficient_numerical_schemes"}, {"score": 0.0021049977753042253, "phrase": "natural_way"}], "paper_keywords": [""], "paper_abstract": "In this paper, we review some numerical methods presented in the literature in the last years to approximate the Cahn-Hilliard equation. Our aim is to compare the main properties of each one of the approaches to try to determine which one we should choose depending on which are the crucial aspects when we approximate the equations. Among the properties that we consider desirable to control are the time accuracy order, energy-stability, unique solvability and the linearity or nonlinearity of the resulting systems. In particular, we concern about the iterative methods used to approximate the nonlinear schemes and the constraints that may arise on the physical and computational parameters. Furthermore, we present the connections of the Cahn-Hilliard equation with other physically motivated systems (not only phase field models) and we state how the ideas of efficient numerical schemes in one topic could be extended to other frameworks in a natural way.", "paper_title": "Numerical Methods for Solving the Cahn-Hilliard Equation and Its Applicability to Related Energy-Based Models", "paper_id": "WOS:000351767800004"}