{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "beijing_subway_system"}, {"score": 0.04493195088559337, "phrase": "subway_system"}, {"score": 0.029375216410904997, "phrase": "passenger_flow"}, {"score": 0.004081385289516914, "phrase": "great_number"}, {"score": 0.004043003243656031, "phrase": "prediction_methods"}, {"score": 0.0037486121194392564, "phrase": "station_oriented_approach"}, {"score": 0.0034920505103165403, "phrase": "novel_metro-net_oriented_method"}, {"score": 0.0032376465741070274, "phrase": "historic_origin-destination"}, {"score": 0.0030590445140753187, "phrase": "appearance_probabilities"}, {"score": 0.002987557906013826, "phrase": "od_pair"}, {"score": 0.002931569771634119, "phrase": "real-time_origin_datum"}, {"score": 0.0025436978068459565, "phrase": "historical_data"}, {"score": 0.002519739850807611, "phrase": "beijing_subway"}, {"score": 0.002449208093757498, "phrase": "proposed_method"}, {"score": 0.002426137929553722, "phrase": "lower_performance"}, {"score": 0.00240328454980006, "phrase": "existing_prediction_approaches"}, {"score": 0.0021050272428506794, "phrase": "beijing"}], "paper_keywords": ["passenger flow", " prediction tree model", " origin-destination information"], "paper_abstract": "In order to provide citizens with safe, convenient and comfortable services and infrastructure in a metropolis, the prediction of passenger flows in the metro-net of subway system has become more important than ever before. Although a great number of prediction methods have been presented in the field of transportation, all of them belong to the station oriented approach, which is not well suited to the Beijing subway system. This paper proposes a novel metro-net oriented method, called the probability tree based passenger flow model, which is also based on historic origin-destination (OD) information. First it learns and obtains the appearance probabilities for each kind of OD pair. For the real-time origin datum, the destination datum is calculated, and then several kinds of passenger flow in the metro-net can be predicted by gathering all the contributions. The results of experiments, using the historical data of Beijing subway, show that although the proposed method has lower performance than existing prediction approaches for forecasting exit passenger flows, it is able to predict several additional kinds of passenger flow in stations and throughout the subway system; and it is a more feasible, suitable, and advanced passenger flow prediction model for Beijing subway system.", "paper_title": "Probability tree based passenger flow prediction and its application to the Beijing subway system", "paper_id": "WOS:000317303800005"}