{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "machine_learning_techniques"}, {"score": 0.004642220710209137, "phrase": "software_project"}, {"score": 0.004551781491498328, "phrase": "erroneous_requirements"}, {"score": 0.004388450908826472, "phrase": "substantial_additional_costs"}, {"score": 0.0043150485532080065, "phrase": "expected_objectives"}, {"score": 0.004266794077108026, "phrase": "delivery_dates"}, {"score": 0.004195418010131832, "phrase": "great_effort"}, {"score": 0.00413684709497912, "phrase": "requirements_engineering"}, {"score": 0.004079090520520216, "phrase": "project's_requirements_results"}, {"score": 0.004044822781630218, "phrase": "high_quality"}, {"score": 0.003921609402733751, "phrase": "automatic_processing"}, {"score": 0.0037595947142663997, "phrase": "complex_task"}, {"score": 0.003312486229143855, "phrase": "quality_expert"}, {"score": 0.0032205608521157477, "phrase": "proposed_methodology"}, {"score": 0.003131178497790961, "phrase": "standard_metrics"}, {"score": 0.0030017207229983385, "phrase": "good_or_bad_quality"}, {"score": 0.0027977092483619896, "phrase": "newly_provided_requirements"}, {"score": 0.0026445028886931837, "phrase": "requirement_corpus"}, {"score": 0.002607527117561699, "phrase": "different_results"}, {"score": 0.0024302416436559867, "phrase": "case_study"}, {"score": 0.002376090250921861, "phrase": "incose_organization"}, {"score": 0.0022842059306412304, "phrase": "natural_language"}, {"score": 0.0021896891011033105, "phrase": "new_requirements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Software engineering", " Requirements engineering", " Requirements quality", " Machine learning"], "paper_abstract": "Context: One of the most important factors in the development of a software project is the quality of their requirements. Erroneous requirements, if not detected early, may cause many serious problems, such as substantial additional costs, failure to meet the expected objectives and delays in delivery dates. For these reasons, great effort must be devoted in requirements engineering to ensure that the project's requirements results are of high quality. One of the aims of this discipline is the automatic processing of requirements for assessing their quality; this aim, however, results in a complex task because the quality of requirements depends mostly on the interpretation of experts and the necessities and demands of the project at hand. Objective: The objective of this paper is to assess the quality of requirements automatically, emulating the assessment that a quality expert of a project would assess. Method: The proposed methodology is based on the idea of learning based on standard metrics that represent the characteristics that an expert takes into consideration when deciding on the good or bad quality of requirements. Using machine learning techniques, a classifier is trained with requirements earlier classified by the expert, which then is used for classifying newly provided requirements. Results: We present two approaches to represent the methodology with two situations of the problem in function of the requirement corpus learning balancing, obtaining different results in the accuracy and the efficiency in order to evaluate both representations. The paper demonstrates the reliability of the methodology by presenting a case study with requirements provided by the Requirements Working Group of the INCOSE organization. Conclusions: A methodology that evaluates the quality of requirements written in natural language is presented in order to emulate the quality that the expert would provide for new requirements, with 86.1 of average in the accuracy. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A methodology for the classification of quality of requirements using machine learning techniques", "paper_id": "WOS:000362604600010"}