{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "delivery_times"}, {"score": 0.01852883825853168, "phrase": "open_question"}, {"score": 0.01053449915958766, "phrase": "packet_networks"}, {"score": 0.007530294878686185, "phrase": "finite_upper"}, {"score": 0.004744123493964429, "phrase": "adversarial_traffic"}, {"score": 0.004571559854487074, "phrase": "\"adversarial_queuing_theory\"_model"}, {"score": 0.0041515831652973794, "phrase": "upper_bound"}, {"score": 0.003941592232278979, "phrase": "adversarial_queuing_theory"}, {"score": 0.0036734281414482735, "phrase": "queuing_policy"}, {"score": 0.0036327808996444904, "phrase": "bounded_delivery_time"}, {"score": 0.0032501644753165555, "phrase": "additional_conditions"}, {"score": 0.0032022811145186974, "phrase": "negative_side"}, {"score": 0.002833150927979512, "phrase": "gamarnik"}, {"score": 0.0025157865918985704, "phrase": "offline_scheduler"}, {"score": 0.002267329954548889, "phrase": "online_protocol"}, {"score": 0.0021049977753042253, "phrase": "borodin_et_al"}], "paper_keywords": [""], "paper_abstract": "We consider packet networks and make use of the \"adversarial queuing theory\" model [10]. We are interested in the question of guaranteeing that all packets are actually delivered to destination, and of having an upper bound on the delivery times of all packets. Whether this is possible against all adversarial queuing theory rate-1 adversaries was previously posed as an open question [13],[10]. Among other things, we give a queuing policy that guarantees bounded delivery time whenever the rate-1 adversary injects a sequence of packets for which there exists a schedule with a finite upper bound on the delivery times of all packets, and adheres to certain additional conditions. On the negative side we show that there exist rate-1 sequences of packets for which there is no schedule with a finite upper bound on the delivery times of all packets. We thus answer an open question posed by Gamarnik [13]. We further show that delivering all packets while maintaining stability (we coin the term \"reliability\" for this property) can be done by an offline scheduler whenever the injection of packets is done at rate of at most 1. However, on the other hand, we also show that there is no online protocol (even centralized) that can achieve that property against all rate-1 adversaries. We thus answer an open question of Borodin et al. [10].", "paper_title": "On delivery times in packet networks under adversarial traffic", "paper_id": "WOS:000242614200003"}