{"auto_keywords": [{"score": 0.04734772704996388, "phrase": "health_information"}, {"score": 0.008713768692145006, "phrase": "critical_demographics"}, {"score": 0.004585212379675535, "phrase": "dramatic_rise"}, {"score": 0.004097389262726735, "phrase": "current_study"}, {"score": 0.0034020946201397057, "phrase": "telephone_survey"}, {"score": 0.003368948014436942, "phrase": "american_adults"}, {"score": 0.0031612033120065747, "phrase": "health_information_seekers"}, {"score": 0.0028106505443369545, "phrase": "fruit_and_vegetable_consumption"}, {"score": 0.002769650208851401, "phrase": "television_health_information"}, {"score": 0.0027026375053777543, "phrase": "sweetened_soft_drink_consumption"}, {"score": 0.0025608471909800076, "phrase": "unhealthy_snack_consumption"}, {"score": 0.002535876002754739, "phrase": "internet_health_information_seeking"}, {"score": 0.002498873893632726, "phrase": "significant_effects"}, {"score": 0.002356173823922118, "phrase": "television_media"}, {"score": 0.0023104373174118458, "phrase": "recommended_levels"}, {"score": 0.002287902310873394, "phrase": "lifestyle_behaviors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Health information seeking", " Physical activity", " Diet", " Obesity", " Health disparities"], "paper_abstract": "Purpose: Research over the past decade has conveyed a dramatic rise in health information seeking via the Internet and articulated various profiles and outcomes of health information seeking. In building upon this research, the current study is innovative in considering predictors of health information seeking by medium, as well as outcomes of health information seeking by medium and by critical demographics. Methods: OLS regression and logistic regression are conducted on data from a telephone survey of American adults in 2007 (N = 700). Results: Profiles of health information seekers vary dramatically by medium (Internet versus newspapers versus television). In terms of outcomes, newspaper health information seeking is associated with fruit and vegetable consumption, while television health information seeking is associated with sweetened soft drink consumption. There are four significant interaction terms between these two health information seeking variables and unhealthy snack consumption. Internet health information seeking has no significant effects. Conclusions: In comparison to the Internet, newspaper and television media have more favorable associations with recommended levels of lifestyle behaviors that may be critical in efforts to decrease obesity in the United States. (C) 2011 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Health information seeking, diet and physical activity: An empirical assessment by medium and critical demographics", "paper_id": "WOS:000292509100019"}