{"auto_keywords": [{"score": 0.034022209837492504, "phrase": "alternative_wires"}, {"score": 0.0048149912526977475, "phrase": "rewiring"}, {"score": 0.004638462976078815, "phrase": "logic_restructuring_technique"}, {"score": 0.004166129325245761, "phrase": "interconnect-based_circuit_synthesis_processes"}, {"score": 0.00379452936798156, "phrase": "target_wire"}, {"score": 0.0035542408902458677, "phrase": "new_error-cancellation-based_rewiring_scheme"}, {"score": 0.0034238045290210534, "phrase": "non-rar-based_rewiring_operations"}, {"score": 0.003329117824699891, "phrase": "ecr_scheme"}, {"score": 0.0030747771905143273, "phrase": "error_cancellation"}, {"score": 0.00297576670831646, "phrase": "rewiring_problem"}, {"score": 0.0027741761880779535, "phrase": "existing_schemes"}, {"score": 0.0026974065918918275, "phrase": "low_runtime_complexity"}, {"score": 0.002622755848331379, "phrase": "irra"}, {"score": 0.002410942838102255, "phrase": "cpu_time"}, {"score": 0.0022687641727660835, "phrase": "abc"}, {"score": 0.0021750990136123367, "phrase": "ecr_engine"}, {"score": 0.0021049977753042253, "phrase": "fpga_technology_mapping"}], "paper_keywords": ["Algorithms", " Rewiring", " error cancellation", " ATPG"], "paper_abstract": "Rewiring is known to be a class of logic restructuring technique that is at least equally powerful in flexibility compared to other logic transformation techniques. Especially it is wiring sensitive and is particularly useful for interconnect-based circuit synthesis processes. One of the most well-studied rewiring techniques is the ATPG-based Redundancy Addition and Removal (RAR) technique which adds a redundant alternative wire to make an originally irredundant target wire become redundant and thus removable. In this article, we propose a new Error-Cancellation-based Rewiring scheme (ECR) which can also identify non-RAR-based rewiring operations with high efficiency. In ECR scheme, it is not necessary for alternative wires to be redundant. Based on the notion of error cancellation, we analyze and reformulate the rewiring problem, and a more generalized rewiring scheme is developed to detect more rewiring cases which are not obtainable by existing schemes while it still maintains a low runtime complexity. Comparing with the most recent non-RAR rewiring tool IRRA, the total number of alternative wires found by our approach is about doubled (202%) while the CPU time used is just slightly more (8%) upon benchmarks preoptimized by ABC's rewriting. Our experimental results also suggest that the ECR engine is more powerful than IRRA in FPGA technology mapping.", "paper_title": "ECR: A Powerful and Low-Complexity Error Cancellation Rewiring Scheme", "paper_id": "WOS:000310163000015"}