{"auto_keywords": [{"score": 0.04948948915272368, "phrase": "debris_flows"}, {"score": 0.015719716506582538, "phrase": "ground_vibration_signal"}, {"score": 0.014906290897332955, "phrase": "ground_vibration_sensors"}, {"score": 0.004014452814186653, "phrase": "debris_flow_warning_systems"}, {"score": 0.0036052633308076933, "phrase": "reduced_storing_capabilities"}, {"score": 0.003560807940070886, "phrase": "limited_power_supply"}, {"score": 0.0034879261743468574, "phrase": "solar_panels"}, {"score": 0.0034165310204389682, "phrase": "high_mountain_environment"}, {"score": 0.003360464999544279, "phrase": "different_methods"}, {"score": 0.0029194625087935345, "phrase": "data_processing"}, {"score": 0.0026107601878587816, "phrase": "ground_vibration_raw_data"}, {"score": 0.0025678829712650437, "phrase": "debris_flow"}, {"score": 0.0025257254505341915, "phrase": "spanish"}, {"score": 0.0022399174232611853, "phrase": "debris_flow_monitoring_installation"}, {"score": 0.0022122603123901114, "phrase": "debris_flow_warning_equipment"}, {"score": 0.0021579641460002523, "phrase": "ground_vibration_detectors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Debris flow", " Ground vibration signal", " Monitoring", " Geophones", " Amplitude", " Impulses"], "paper_abstract": "Ground vibration sensors have been increasingly used and tested, during the last few years, as devices to monitor debris flows and they have also been proposed as one of the more reliable devices for the design of debris flow warning systems. The need to process the output of ground vibration sensors, to diminish the amount of data to be recorded, is usually due to the reduced storing capabilities and the limited power supply, normally provided by solar panels, available in the high mountain environment. There are different methods that can be found in literature to process the ground vibration signal produced by debris flows. In this paper we will discuss the two most commonly employed: the method of impulses and the method of amplitude. These two methods of data processing are analyzed describing their origin and their use, presenting examples of applications and their main advantages and shortcomings. The two methods are then applied to process the ground vibration raw data produced by a debris flow occurred in the Rebaixader Torrent (Spanish Pyrenees) in 2012. The results of this work will provide means for decision to researchers and technicians who find themselves facing the task of designing a debris flow monitoring installation or a debris flow warning equipment based on the use of ground vibration detectors. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Processing the ground vibration signal produced by debris flows: the methods of amplitude and impulses compared", "paper_id": "WOS:000345729600003"}