{"auto_keywords": [{"score": 0.042228121919603616, "phrase": "ranking_images"}, {"score": 0.033833183214614, "phrase": "tagged_image"}, {"score": 0.00481495049065317, "phrase": "social_image_retrieval"}, {"score": 0.004646654984830476, "phrase": "social_images"}, {"score": 0.004610058444728656, "phrase": "valuable_information_source"}, {"score": 0.004573748810476845, "phrase": "superior_image_search_and_retrieval_experiences"}, {"score": 0.004413846562278824, "phrase": "tag-based_search"}, {"score": 0.00425951071471662, "phrase": "general_framework"}, {"score": 0.003650488388949457, "phrase": "first_step"}, {"score": 0.0034674164050273568, "phrase": "systematic_and_comprehensive_empirical_evaluation"}, {"score": 0.0032934951320964276, "phrase": "five_orthogonal_dimensions"}, {"score": 0.003241750934419473, "phrase": "matching_score"}, {"score": 0.00316565009987584, "phrase": "tag_query"}, {"score": 0.003128270147867462, "phrase": "five_dimensions"}, {"score": 0.002607246047604476, "phrase": "image_tag"}, {"score": 0.002576442680766742, "phrase": "query_tag"}, {"score": 0.002370748155770563, "phrase": "nus-wide_dataset"}, {"score": 0.002260680517813243, "phrase": "flickr"}, {"score": 0.00212175050242788, "phrase": "standard_metrics"}, {"score": 0.0021067501160296873, "phrase": "precision"}], "paper_keywords": [""], "paper_abstract": "Tags associated with social images are valuable information source for superior image search and retrieval experiences. Although various heuristics are valuable to boost tag-based search for images, there is a lack of general framework to study the impact of these heuristics. Specifically, the task of ranking images matching a given tag query based on their associated tags in descending order of relevance has not been well studied. In this article, we take the first step to propose a generic, flexible, and extensible framework for this task and exploit it for a systematic and comprehensive empirical evaluation of various methods for ranking images. To this end, we identified five orthogonal dimensions to quantify the matching score between a tagged image and a tag query. These five dimensions are: (i) tag relatedness to measure the degree of effectiveness of a tag describing the tagged image; (ii) tag discrimination to quantify the degree of discrimination of a tag with respect to the entire tagged image collection; (iii) tag length normalization analogous to document length normalization in web search; (iv) tag-query matching model for the matching score computation between an image tag and a query tag; and (v) query model for tag query rewriting. For each dimension, we identify a few implementations and evaluate their impact on NUS-WIDE dataset, the largest human-annotated dataset consisting of more than 269K tagged images from Flickr. We evaluated 81 single-tag queries and 443 multi-tag queries over 288 search methods and systematically compare their performances using standard metrics including Precision at top-K, Mean Average Precision (MAP), Recall, and Normalized Discounted Cumulative Gain (NDCG).", "paper_title": "Tag-Based Social Image Retrieval: An Empirical Evaluation", "paper_id": "WOS:000297303100006"}