{"auto_keywords": [{"score": 0.043942378694938056, "phrase": "process_analytical_chemistry"}, {"score": 0.009951496171487325, "phrase": "bruce_r._kowalski"}, {"score": 0.008939389905881733, "phrase": "bruce"}, {"score": 0.00881238250747048, "phrase": "significant_contributions"}, {"score": 0.006203283833175287, "phrase": "bruce's_work"}, {"score": 0.0060711990273622455, "phrase": "dow_chemical_company"}, {"score": 0.005773772166920702, "phrase": "bruce's_legacy"}, {"score": 0.00481495049065317, "phrase": "bruce_kowalski's"}, {"score": 0.003459191419478298, "phrase": "new_and_innovative_chemometrics_technology"}, {"score": 0.0031277316566463978, "phrase": "significant_impact"}, {"score": 0.0030171910207671205, "phrase": "industrial_analytical_chemistry"}, {"score": 0.002575291525724941, "phrase": "dow"}, {"score": 0.0024842242921857705, "phrase": "dow's_involvement"}, {"score": 0.0023451553255837317, "phrase": "ongoing_research"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["Kowalski", " Dow Chemical", " chemometrics", " multivariate calibration"], "paper_abstract": "With the passing of Bruce R. Kowalski in 2012, a true visionary for chemometrics and process analytical chemistry has been lost. Bruce made significant contributions in the area of chemometrics and process analytical chemistry when he was a professor of chemistry at the University of Washington. He developed new and innovative chemometrics technology and founded the Center for Process Analytical Chemistry. He inspired many students and visiting scholars and had a significant impact on the practice of industrial analytical chemistry. One of the companies that benefitted greatly from Bruce's work was The Dow Chemical Company. This publication attempts to summarize Bruce's legacy at Dow through a discussion of Dow's involvement in the beginnings of the Center for Process Analytical Chemistry and the ongoing research and applications of chemometrics by his former graduate students at The Dow Chemical Company. Copyright (c) 2013 John Wiley & Sons, Ltd. With the passing of Bruce R. Kowalski in 2012, a true visionary for chemometrics and process analytical chemistry has been lost. Bruce made significant contributions in the area of chemometrics and process analytical chemistry when he was a professor of chemistry at the University of Washington. One of the companies that benefitted greatly from Bruce's work was The Dow Chemical Company. This publication attempts to summarize Bruce's legacy at The Dow Chemical Company.", "paper_title": "Process analytical chemistry and chemometrics, Bruce Kowalski's legacy at The Dow Chemical Company", "paper_id": "WOS:000335520900002"}