{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "prior_knowledge"}, {"score": 0.008647928610239688, "phrase": "support_vector_machines"}, {"score": 0.005848088932607813, "phrase": "input_space"}, {"score": 0.004654273441083272, "phrase": "optimization_methods"}, {"score": 0.004150377643719188, "phrase": "key_element"}, {"score": 0.0038900709793274484, "phrase": "current_state"}, {"score": 0.003659954070354848, "phrase": "particular_forms"}, {"score": 0.0031784407245606704, "phrase": "second_one"}, {"score": 0.003130325700934738, "phrase": "unlabeled_data"}, {"score": 0.002687366778212309, "phrase": "training_data"}, {"score": 0.002499438189264537, "phrase": "problem_formulation"}, {"score": 0.002470987929071079, "phrase": "recent_method"}, {"score": 0.0024335561337016174, "phrase": "support_vector_regression"}, {"score": 0.002387560868354908, "phrase": "arbitrary_regions"}, {"score": 0.0022719915771356354, "phrase": "classification_case"}, {"score": 0.0021537671245615286, "phrase": "regularization_framework"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["pattern recognition", " classification", " support vector machine (SVM)", " prior knowledge", " invariance"], "paper_abstract": "For classification, support vector machines (SVMs) have recently been introduced and quickly became the state of the art. Now, the incorporation of prior knowledge into SVMs is the key element that allows to increase the performance in many applications. This paper gives a review of the current state of research regarding the incorporation of two general types of prior knowledge into SVMs for classification. The particular forms of prior knowledge considered here are presented in two main groups: class-invariance and knowledge on the data. The first one includes invariances to transformations, to permutations and in domains of input space, whereas the second one contains knowledge on unlabeled data, the imbalance of the training set or the quality of the data. The methods are then described and classified into the three categories that have been used in literature: sample methods based on the modification of the training data. kernel methods based on the modification of the kernel and optimization methods based on the modification of the problem formulation. A recent method, developed for support vector regression, considers prior knowledge on arbitrary regions of the input space. It is exposed here when applied to the classification case. A discussion is then conducted to regroup sample and optimization methods under a regularization framework. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Incorporating prior knowledge in support vector machines for classification: A review", "paper_id": "WOS:000255239200041"}