{"auto_keywords": [{"score": 0.04849105041601803, "phrase": "europe"}, {"score": 0.020726288995769195, "phrase": "australia"}, {"score": 0.00793708056457705, "phrase": "africa"}, {"score": 0.007585069098971649, "phrase": "asia"}, {"score": 0.004734448316824488, "phrase": "different_geographic_regions"}, {"score": 0.004686791459644141, "phrase": "north_america"}, {"score": 0.0045160988337296605, "phrase": "latin_america"}, {"score": 0.004425616928975799, "phrase": "global_similarities"}, {"score": 0.0043663006236597975, "phrase": "technology_trends"}, {"score": 0.003999578057088828, "phrase": "non-it_executives"}, {"score": 0.0037765536386719775, "phrase": "organization's_long-term_plans"}, {"score": 0.003626626504149897, "phrase": "top_five_management_concerns"}, {"score": 0.0033218213825698417, "phrase": "five_most_influential_technologies"}, {"score": 0.002805597755796506, "phrase": "business_expenses"}, {"score": 0.002662426573114821, "phrase": "cio"}, {"score": 0.0024016604071771556, "phrase": "important_implications"}, {"score": 0.0023694065215394593, "phrase": "benchmark_considerations"}, {"score": 0.0021847592782091923, "phrase": "important_it_trends"}, {"score": 0.002162711766975021, "phrase": "thoughtful_decisions"}, {"score": 0.0021049977753042253, "phrase": "current_business_challenges"}], "paper_keywords": ["IT trends", " management concerns", " top applications and technologies", " IT budget", " IT organization structure", " alignment"], "paper_abstract": "This paper is based on data collected as part of an 11-year authors' survey research on IT trends in different geographic regions, including North America, Europe, Asia, Australia, Africa, and Latin America. This study focuses on global similarities and differences in technology trends (e.g., management concerns, influential technologies, budgets/spending, organizational considerations) among geographies to gain insight into the challenges that IT and non-IT executives face today as well as provide an understanding of the impact these technologies have on the organization's long-term plans and investments. The results for the 11-year period show that the top five management concerns are: (i) IT-business alignment; (ii) business agility; (iii) business cost reduction/controls; (iv) business productivity; and (v) security/privacy. The five most influential technologies are: (i) analytics/business intelligence; (ii) cloud computing; (iii) ERP systems; (iv) CRM systems; and (v) security technologies. Taken together, these findings suggest that the alignment of IT and the business and leveraging IT to reduce business expenses and generate revenue are and will remain essential. The results also suggest that the role of the CIO is evolving and offshore outsourcing is on the rise. Budgets, hiring, and salaries are also increasing, albeit cautiously. This research provides important implications for IT managers to benchmark considerations such as organizational, sourcing, spending, issues/concerns, and technologies across geographies, and sheds light on a perspective on leveraging important IT trends to make thoughtful decisions about them over the coming years, and address current business challenges.", "paper_title": "Influential IT management trends: an international study", "paper_id": "WOS:000360313200008"}