{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "organizational_crises"}, {"score": 0.021778214502639347, "phrase": "knowledge_transfer_channels"}, {"score": 0.013440433112763573, "phrase": "critical_knowledge"}, {"score": 0.004429191773525288, "phrase": "business_environments"}, {"score": 0.004332894955218135, "phrase": "today's_uncertain_economic_conditions"}, {"score": 0.00355485940716082, "phrase": "in-depth_case_study"}, {"score": 0.003447035529485425, "phrase": "motorcycle_manufacturer"}, {"score": 0.003284145698220425, "phrase": "organizational_crisis"}, {"score": 0.003142732162296465, "phrase": "corresponding_results"}, {"score": 0.00308788133472785, "phrase": "research_findings"}, {"score": 0.00304737045343781, "phrase": "multiple_knowledge_transfer_channels"}, {"score": 0.002941913249957503, "phrase": "significantly_positive_influence"}, {"score": 0.0029161225023394363, "phrase": "organizational_performance"}, {"score": 0.0027417911324611917, "phrase": "crisis_characteristics"}, {"score": 0.002693919110230191, "phrase": "six_theoretical_propositions"}, {"score": 0.0024451427672857458, "phrase": "effective_methods"}, {"score": 0.002288797099841088, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Knowledge transfer channel", " Crisis characteristics", " Organizational crisis"], "paper_abstract": "The impact of organizational crises is getting stronger as the risk and uncertainty in business environments are increasing due to today's uncertain economic conditions. The threat of organizational crises to organizations can be lessened if critical knowledge is transferred to the individuals who will need it during such events. Nevertheless, there have been very few studies specifically investigating the use of knowledge transfer channels during organizational crises. Consequently, we conducted an in-depth case study of a product recall at a motorcycle manufacturer in order to explore what knowledge transfer channels were applied during the organizational crisis in order to transfer critical knowledge, and what the corresponding results were. The research findings indicate that multiple knowledge transfer channels were used and that they had a significantly positive influence on organizational performance when dealing with the crisis. The relationships between the knowledge transfer channels used and crisis characteristics are depicted in six theoretical propositions. The findings of this study can help organizations examine their abilities to circulate critical knowledge, and, in turn, develop effective methods to transfer it to where it is truly needed when dealing with crises. Future research that specifically examines the interrelationships between the knowledge transfer channels used during organizational crises are encouraged. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Knowledge transfer in response to organizational crises: An exploratory study", "paper_id": "WOS:000274594300047"}