{"auto_keywords": [{"score": 0.03675883934633625, "phrase": "complex_network"}, {"score": 0.00481495049065317, "phrase": "core_subnet"}, {"score": 0.004761850836420121, "phrase": "weighted_networks_based"}, {"score": 0.004709333998298903, "phrase": "link_strengths"}, {"score": 0.004333406378146173, "phrase": "elementary_units"}, {"score": 0.0042148594491580324, "phrase": "interesting_social_or_physical_connections"}, {"score": 0.0037721073763702486, "phrase": "explicit_focus"}, {"score": 0.0034324073240680213, "phrase": "small_and_concise_subnetwork"}, {"score": 0.003105905142768581, "phrase": "paper_cocitation_network"}, {"score": 0.002779318608820933, "phrase": "water_resources"}, {"score": 0.002614534850703364, "phrase": "useful_choice"}, {"score": 0.002262780216061148, "phrase": "hirsch"}, {"score": 0.0021049977753042253, "phrase": "collaboration_networks"}], "paper_keywords": [""], "paper_abstract": "Most measures of networks are based on the nodes, although links are also elementary units in networks and represent interesting social or physical connections. In this work we suggest an option for exploring networks, called the h-strength, with explicit focus on links and their strengths. The h-strength and its extensions can naturally simplify a complex network to a small and concise subnetwork (h-subnet) but retains the most important links with its core structure. Its applications in 2 typical information networks, the paper cocitation network of a topic (the h-index) and 5 scientific collaboration networks in the field of \"water resources,\" suggest that h-strength and its extensions could be a useful choice for abstracting, simplifying, and visualizing a complex network. Moreover, we observe that the 2 informetric models, the Glanzel-Schubert model and the Hirsch model, roughly hold in the context of the h-strength for the collaboration networks.", "paper_title": "Abstracting the Core Subnet of Weighted Networks Based on Link Strengths", "paper_id": "WOS:000335583800008"}