{"auto_keywords": [{"score": 0.0429841867448742, "phrase": "executable_mappings"}, {"score": 0.02322730111336098, "phrase": "linked_data_applications"}, {"score": 0.004700027722284931, "phrase": "data_exchange"}, {"score": 0.004587835274176236, "phrase": "data_model"}, {"score": 0.004521803560561489, "phrase": "target_application"}, {"score": 0.004246428036409373, "phrase": "data_exchange_building"}, {"score": 0.0036201167891046046, "phrase": "semantic-web_ontologies"}, {"score": 0.0033182152378613767, "phrase": "relational_or_nested-relational_data_models"}, {"score": 0.0030267296900520217, "phrase": "important_drawbacks"}, {"score": 0.002801166393333128, "phrase": "target_data_model"}, {"score": 0.0023759728305710365, "phrase": "mostode"}, {"score": 0.002285674008055581, "phrase": "sparql_executable_mappings"}, {"score": 0.0021049977753042253, "phrase": "previous_drawbacks"}], "paper_keywords": ["Knowledge and data engineering", " Data exchange", " Linked Data", " Executable mappings", " SPARQL"], "paper_abstract": "The goal of data exchange is to populate the data model of a target application using data that come from one or more source applications. It is common to address data exchange building on correspondences that are transformed into executable mappings. The problem that we address in this article is how to generate executable mappings in the context of Linked Data applications, that is, applications whose data models are semantic-web ontologies. In the literature, there are many proposals to generate executable mappings. Most of them focus on relational or nested-relational data models, which cannot be applied to our context; unfortunately, the few proposals that focus on ontologies have important drawbacks, namely: they solely work on a subset of taxonomies, they require the target data model to be pre-populated or they interpret correspondences in isolation, not to mention the proposals that actually require the user to handcraft the executable mappings. In this article, we present MostoDE, a new automated proposal to generate SPARQL executable mappings in the context of Linked Data applications. Its salient features are that it does not have any of the previous drawbacks, it is computationally tractable and it has been validated using a series of experiments that prove that it is very efficient and effective in practice.", "paper_title": "Exchanging Data amongst Linked Data applications", "paper_id": "WOS:000326936100008"}