{"auto_keywords": [{"score": 0.02437378870858202, "phrase": "daqing_city"}, {"score": 0.00481495049065317, "phrase": "earthquake_disaster_assessment"}, {"score": 0.004720043307726269, "phrase": "intelligent_simulation_system"}, {"score": 0.004673290248999786, "phrase": "earthquake_disaster_assessment_system"}, {"score": 0.004611669085594069, "phrase": "development_platform"}, {"score": 0.004565984572487962, "phrase": "geographic_information_system"}, {"score": 0.004272724011826495, "phrase": "infrastructure_system"}, {"score": 0.004244449986839909, "phrase": "pre-earthquake_conditions"}, {"score": 0.004188459638572375, "phrase": "earthquake_damage"}, {"score": 0.004133204817078675, "phrase": "intelligent_emergency_response"}, {"score": 0.004092240621596351, "phrase": "public_and_government"}, {"score": 0.0037662262006579023, "phrase": "emergency_response"}, {"score": 0.0036553070575015344, "phrase": "design_criteria"}, {"score": 0.0035831752332801674, "phrase": "test_results"}, {"score": 0.003034682308336483, "phrase": "information_database_and_analytical_modules"}, {"score": 0.002974760986688745, "phrase": "seismic_disaster_mitigation_strategies"}, {"score": 0.002710358243468008, "phrase": "entire_city"}, {"score": 0.0025024660249697408, "phrase": "scenario_earthquake_event"}, {"score": 0.002453027723284009, "phrase": "related_results"}, {"score": 0.002272513745370706, "phrase": "china"}, {"score": 0.002154592730528917, "phrase": "seismic_disaster_mitigation"}, {"score": 0.0021403049512708494, "phrase": "post-earthquake_emergency_response"}, {"score": 0.0021049977753042253, "phrase": "optimizing_aseismic_retrofitting_plan"}], "paper_keywords": ["Geographic Information System", " Artificial Intelligence", " Seismic hazard", " Earthquake risk analysis", " Seismic emergency response"], "paper_abstract": "This paper presents an intelligent simulation system for an earthquake disaster assessment system based on a development platform of a Geographic Information System (GIS) and Artificial Intelligence (AI). This system is designed to identify the weakness of the structure and infrastructure system in pre-earthquake conditions, quickly assess earthquake damage and make an intelligent emergency response for the public and government during the earthquake and post-earthquake. The system includes the following functions: intelligent seismic hazard assessment, earthquake damage and loss evaluation, optimizing emergency response and post-earthquake recovering plan. The principle. design criteria, structure, functions and test results of this system are described in this paper. Based on its functional characteristics, this system is composed of four parts: an information database, analytical modules, an intelligent decision-making sub-system and a friendly user interface. There are 132 coverages and 78 analytical modules included in the information database and analytical modules. With this system, seismic disaster mitigation strategies can be verified during a pre-earthquake, and be executed at the time of an earthquake and post-earthquake; the earthquake resisting capacities for an entire city and all of its communities can be greatly enhanced. To check its reliability and its efficiency, this system has been tested based on a scenario earthquake event in one city, and the related results have also been given in this paper. At the present, this system has been installed and used in Daqing City, China. After running for almost 10 years, this system has Successfully been used in rehearsing of seismic disaster mitigation and post-earthquake emergency response. Simultaneously, an optimizing aseismic retrofitting plan in Daqing City has been executed based on results from this system. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "An intelligent simulation system for earthquake disaster assessment", "paper_id": "WOS:000266672300002"}