{"auto_keywords": [{"score": 0.04896848785083952, "phrase": "non-stationary_signals"}, {"score": 0.00481495049065317, "phrase": "time-frequency_feature_extraction"}, {"score": 0.00461575768501871, "phrase": "newborn_eeg_abnormality_detection"}, {"score": 0.004487541157100498, "phrase": "general_problem"}, {"score": 0.004047020753789236, "phrase": "quadratic_time-frequency_distributions"}, {"score": 0.0032602525602322832, "phrase": "representative_subset"}, {"score": 0.0031695693589575916, "phrase": "observed_non-stationary_signal"}, {"score": 0.0028047899594686003, "phrase": "abnormal_brain_activity"}, {"score": 0.0025409639091476363, "phrase": "pre-processing_stage"}, {"score": 0.0024818877663889813, "phrase": "eeg_signals"}, {"score": 0.0024586427394152196, "phrase": "signal_enhancement"}, {"score": 0.0022168460543913787, "phrase": "improved_performance"}, {"score": 0.0021450029487459403, "phrase": "newborn_eeg_signals"}, {"score": 0.0021049977753042253, "phrase": "time-only_or_frequency-only_features"}], "paper_keywords": ["Time-frequency feature extraction", " Abnormality detection", " Seizure", " Newborn EEG artifacts", " ROC analysis"], "paper_abstract": "This paper considers the general problem of detecting change in non-stationary signals using features observed in the time-frequency (4) domain, obtained using a class of quadratic time-frequency distributions (QTFDs). The focus of this study is to propose a methodology to define new (tf) features by extending time-only and frequency-only features to the joint (tf) domain for detecting changes in non-stationary signals. The (4) features are used as a representative subset characterizing the status of the observed non-stationary signal. Change in the signal is then reflected as a change in the (tf) features. This (tf) approach is applied to the problem of detecting abnormal brain activity in newborns (e.g. seizure) using measurements of the EEG for diagnosis and prognosis. In addition, a pre-processing stage for detecting artifacts in EEG signals for signal enhancement is studied and implemented separately. Overall results indicate that, in general, the (tf) approach results in an improved performance in detecting artifacts and seizures in newborn EEG signals as compared to time-only or frequency-only features. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Principles of time-frequency feature extraction for change detection in non-stationary signals: Applications to newborn EEG abnormality detection", "paper_id": "WOS:000347747000002"}