{"auto_keywords": [{"score": 0.045438661259377296, "phrase": "decision_rationale"}, {"score": 0.00481495049065317, "phrase": "evidence_from_decision_tree_induction."}, {"score": 0.004777942576658614, "phrase": "portfolio_prioritization"}, {"score": 0.0046683172874085015, "phrase": "information_systems"}, {"score": 0.004506171772318298, "phrase": "existing_research"}, {"score": 0.003964007795174772, "phrase": "critical_component"}, {"score": 0.003306559295382181, "phrase": "firm's_is_strategy"}, {"score": 0.0032485526269852606, "phrase": "prior_theoretical_work"}, {"score": 0.003163439005885435, "phrase": "theoretical_profiles"}, {"score": 0.00289546142998427, "phrase": "risk_appropriateness"}, {"score": 0.0026736945502820303, "phrase": "decision_makers"}, {"score": 0.0026036031415940563, "phrase": "decision_tree_induction_methodology"}, {"score": 0.0025578967205807843, "phrase": "tacit_decision_rationale"}, {"score": 0.002479827946513971, "phrase": "portfolio_prioritization_decisions"}, {"score": 0.0021906130276146325, "phrase": "systematically_different_profiles"}], "paper_keywords": ["IS strategy", " IS portfolio prioritization", " IT portfolio management", " IS governance", " IT governance", " decision making", " decision tree induction"], "paper_abstract": "Questions pertaining to the locus of information systems (IS) governance have been extensively examined in existing research. However, questions pertaining to the decision rationale applied for IS portfolio prioritization (why are certain initiatives approved, and why are certain others rejected), noted to be a critical component of IS governance, need further investigation. We submit that the IS strategy of a firm is likely to explain the decision rationale it applies to IS portfolio prioritization and maintain that it is critical to ensure this decision rationale is in congruence with the firm's IS strategy. By extending prior theoretical work on IS strategy types, we develop theoretical profiles of the decision rationale applied to IS portfolio prioritization using three attributes: communicability of decision rationale, consistency in applying decision rationale, and risk appropriateness of decision rationale. Since the decision rationale applied for IS portfolio prioritization is often tacit, unknown even to the decision makers themselves, we employ the decision tree induction methodology to discover this tacit decision rationale. We analyze over 150 IS portfolio prioritization decisions on a multimillion dollar IS portfolio of a multibusiness, Fortune 50 firm and our findings, which support our propositions, indicate that firms that adopt different IS strategies rely on systematically different profiles of decision rationale for IS portfolio prioritization. Implications for IS governance practices are developed.", "paper_title": "PATTERNS IN INFORMATION SYSTEMS PORTFOLIO PRIORITIZATION: EVIDENCE FROM DECISION TREE INDUCTION", "paper_id": "WOS:000361601700008"}