{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "modern_mixed-size_designs"}, {"score": 0.04631644833296801, "phrase": "macro_placements"}, {"score": 0.03411283592297468, "phrase": "standard-cell_placement"}, {"score": 0.004611224230543916, "phrase": "new_multipacking-tree"}, {"score": 0.004270003565426343, "phrase": "high_chip_utilization_rates"}, {"score": 0.004188702178897384, "phrase": "binary_trees"}, {"score": 0.0038047474331318974, "phrase": "global_placement"}, {"score": 0.0036261282565554507, "phrase": "standard_cells"}, {"score": 0.0033900126423990823, "phrase": "initial_macro_positions"}, {"score": 0.003262035294895737, "phrase": "chip_center"}, {"score": 0.003049555059533735, "phrase": "placement_contest_benchmarks"}, {"score": 0.0030203487665054806, "phrase": "faraday_benchmarks"}, {"score": 0.0027431953780099826, "phrase": "state-of-the-art_academic_mixed-size_placers"}, {"score": 0.002467536552997677, "phrase": "high_utilization_rates"}, {"score": 0.0023857603808363527, "phrase": "average_lialf-perimeter_wirelength"}], "paper_keywords": ["floorplanning", " layout", " physical design", " placement"], "paper_abstract": "In this paper, we present a new multipacking-tree (MP-tree) representation for macro placements to handle modern mixed-size designs with large macros and high chip utilization rates. Based on binary trees, the NIP-tree is very efficient, effective, and flexible for handling macro placements with various constraints. Given a global placement that already considers the areas and the interconnections among standard cells and macros, our MP-tree-based macro placer optimizes macro positions, minimizes the macro displacement from the initial macro positions, and maximizes the area of the chip center for standard-cell placement and routing. Experiments based on the Proceedings of the 2006 International Symposium on Physical Design placement contest benchmarks and Faraday benchmarks show that our macro placer combined with APlace 2.0, Capo 10.2, mPL6, or NTUplace3 for a standard-cell placement outperforms these state-of-the-art academic mixed-size placers alone by large margins in robustness and quality. In addition to wirelength, experiments on four real industrial designs with large macros and high utilization rates show that our method significantly reduces the average lialf-perimeter wirelength by 35%, the average routed wirelength by 55%, and the routing overflows by 13 times compared with Capo 10.2, implying that our macro placer leads to much higher routability.", "paper_title": "MP-trees: A packing-based macro placement algorithm for modern mixed-size designs", "paper_id": "WOS:000258819800010"}