{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "list_significance"}, {"score": 0.004621984064678252, "phrase": "high-throughput_technologies"}, {"score": 0.0044005599565517875, "phrase": "current_research_laboratories"}, {"score": 0.003813269577615793, "phrase": "individual_or_multiple_genes"}, {"score": 0.0036453427552753533, "phrase": "exponential_growth"}, {"score": 0.003145609726536791, "phrase": "clear_and_handful_overview"}, {"score": 0.0030441844088874366, "phrase": "user_input"}, {"score": 0.002898127432512101, "phrase": "entrezgene"}, {"score": 0.0026700637696697414, "phrase": "genevalorization"}, {"score": 0.002541910967437926, "phrase": "gene_names"}, {"score": 0.0024298350266697905, "phrase": "relative_importance"}, {"score": 0.002131054594847684, "phrase": "gene_list"}, {"score": 0.0021049977753042253, "phrase": "oncotypedx_prognostic_marker_test"}], "paper_keywords": [""], "paper_abstract": "Motivation: High-throughput technologies provide fundamental informations concerning thousands of genes. Many of the current research laboratories daily use one or more of these technologies and end-up with lists of genes. Assessing the originality of the results obtained includes being aware of the number of publications available concerning individual or multiple genes and accessing information about these publications. Faced with the exponential growth of publications avaliable and number of genes involved in a study, this task is becoming particularly difficult to achieve. Results: We introduce GeneValorization, a web-based tool that gives a clear and handful overview of the bibliography available corresponding to the user input formed by (i) a gene list (expressed by gene names or ids from EntrezGene) and (ii) a context of study (expressed by keywords). From this input, GeneValorization provides a matrix containing the number of publications with co-occurrences of gene names and keywords. Graphics are automatically generated to assess the relative importance of genes within various contexts. Links to publications and other databases offering information on genes and keywords are also available. To illustrate how helpful GeneValorization is, we will consider the gene list of the OncotypeDX prognostic marker test.", "paper_title": "Gene List significance at-a-glance with GeneValorization", "paper_id": "WOS:000289301600032"}