{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "unstructured_tagging"}, {"score": 0.004677372885331908, "phrase": "purpose_-_this_paper"}, {"score": 0.004521803560561489, "phrase": "tagging_experiment"}, {"score": 0.004413846562278824, "phrase": "israeli_and_jewish_cultural_heritage"}, {"score": 0.004205570965859848, "phrase": "freely_assigned_tags"}, {"score": 0.004026505114417176, "phrase": "predefined_metadata_elements"}, {"score": 0.00376293585033711, "phrase": "first_group"}, {"score": 0.003637669525737665, "phrase": "descriptive_tags"}, {"score": 0.0034159525504642656, "phrase": "second_group"}, {"score": 0.003334309053314909, "phrase": "free-text_values"}, {"score": 0.00328625950643742, "phrase": "metadata_elements"}, {"score": 0.002968695624366393, "phrase": "different_interpretations"}, {"score": 0.002828418443899226, "phrase": "tagging_quality"}, {"score": 0.002655894070657161, "phrase": "wider_range"}], "paper_keywords": ["National cultures", " Inter-computer links", " Internet", " Document image processing", " Identification", " Israel"], "paper_abstract": "Purpose - This paper seeks to describe and discuss a tagging experiment involving images related to Israeli and Jewish cultural heritage. The aim of this experiment was to compare freely assigned tags with values (free text) assigned to predefined metadata elements. Design/methodology/approach - Two groups of participants were asked to provide tag for 12 images. The first group of participants was asked to assign descriptive tags to the images without guidance (unstructured tagging), while the second group was asked to provide free-text values to predefined metadata elements (structures tagging) Findings - The results show that on the one hand structured tagging provides guidance to the users, but on the other hand different interpretations of the meaning of the elements may worsen the tagging quality instead of improving it. In addition. unstructured tagging allows for a wider range of tags. Research limitations/implications - The recommendation is to experiment with a system where the users provide both the tags and the context of these tags. Originality/value - Unstructured tagging has become highly popular on the web, thus it is important to evaluate its merits and shortcomings, compared to more conventional methods.", "paper_title": "Structured versus unstructured tagging: a case study", "paper_id": "WOS:000261439400007"}