{"auto_keywords": [{"score": 0.0496463517482477, "phrase": "structural_differences"}, {"score": 0.04921771032829598, "phrase": "contrast_groups"}, {"score": 0.015719716506582538, "phrase": "confidence_intervals"}, {"score": 0.010341626804953567, "phrase": "missing_values"}, {"score": 0.004685575787741084, "phrase": "missing_data"}, {"score": 0.0046432244185370605, "phrase": "difference_detection"}, {"score": 0.004457309741979921, "phrase": "new_medicine"}, {"score": 0.004377077848734575, "phrase": "specified_disease"}, {"score": 0.004278807087784626, "phrase": "old_medicine_a"}, {"score": 0.0037336520904376687, "phrase": "main_differences"}, {"score": 0.0033326252993345685, "phrase": "limited_applications"}, {"score": 0.0028682668647074397, "phrase": "statistically_sound_approach"}, {"score": 0.0023479408542211875, "phrase": "lici_datasets"}, {"score": 0.0022847009758393405, "phrase": "new_data_mining_technique"}, {"score": 0.002193013499219711, "phrase": "non-spam_emails"}, {"score": 0.0021049977753042253, "phrase": "malign_one"}], "paper_keywords": ["Difference detection", " Confidence interval", " Missing data imputation"], "paper_abstract": "Difference detection is actual and extremely useful for evaluating a new medicine B against a specified disease by comparing to an old medicine A, which has been used to treat the disease for many years. The datasets generated by applying A and B to the disease are called contrast groups and, main differences between the groups are the mean and distribution differences, referred to structural differences in this paper. However, contrast groups are only two samples obtained by limited applications or tests on A and B, and may be with missing values. Therefore, the differences derived from the groups are inevitably uncertain. In this paper, we propose a statistically sound approach for measuring this uncertainty by identifying the confidence intervals of structural differences between contrast groups. This method is designed significantly against most of those applications whose exact data distributions are unknown a priori, and the data may also be with missing values. We apply our approach to LICI datasets to illustrate its power as a new data mining technique for, such as, distinguishing spam from non-spam emails; and the benign breast cancer from the malign one. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Estimating confidence intervals for structural differences between contrast groups with missing data", "paper_id": "WOS:000263817100083"}