{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adverse_interactions"}, {"score": 0.03819287679979974, "phrase": "logical_models"}, {"score": 0.03710582202849763, "phrase": "mitigation_algorithm"}, {"score": 0.015413195163808452, "phrase": "constraint_logic_programming"}, {"score": 0.013250831378713865, "phrase": "concurrent_application"}, {"score": 0.009624808862261056, "phrase": "feasible_therapy"}, {"score": 0.004751470337792407, "phrase": "clinical_practice_guidelines"}, {"score": 0.004642377903273107, "phrase": "new_method"}, {"score": 0.004286931271697226, "phrase": "comorbid_diseases"}, {"score": 0.003958591403140206, "phrase": "clinical_practice"}, {"score": 0.003829290275367182, "phrase": "grand_challenges"}, {"score": 0.003803939387792038, "phrase": "clinical_decision_support"}, {"score": 0.0037662262006579023, "phrase": "proposed_method"}, {"score": 0.003386412845243943, "phrase": "domain_knowledge"}, {"score": 0.0033306180744375616, "phrase": "revision_operators"}, {"score": 0.0030650999992348185, "phrase": "clp"}, {"score": 0.0026130182682465096, "phrase": "identified_interactions"}, {"score": 0.002436765760924074, "phrase": "alerting_tool"}, {"score": 0.002287542098172185, "phrase": "clinical_decision_support_system"}, {"score": 0.002183454435945014, "phrase": "duodenal_ulcer"}, {"score": 0.0021403049512708494, "phrase": "transient_ischemic_attack"}], "paper_keywords": ["Clinical practice guideline", " Comorbid diseases", " Constraint logic programming", " Domain knowledge", " Clinical decision support"], "paper_abstract": "We propose a new method to mitigate (identify and address) adverse interactions (drug-drug or drug-disease) that occur when a patient with comorbid diseases is managed according to two concurrently applied clinical practice guidelines (CPGs). A lack of methods to facilitate the concurrent application of CPGs severely limits their use in clinical practice and the development of such methods is one of the grand challenges for clinical decision support. The proposed method responds to this challenge. We introduce and formally define logical models of CPGs and other related concepts, and develop the mitigation algorithm that operates on these concepts. In the algorithm we combine domain knowledge encoded as interaction and revision operators using the constraint logic programming (CLP) paradigm. The operators characterize adverse interactions and describe revisions to logical models required to address these interactions, while CLP allows us to efficiently solve the logical models - a solution represents a feasible therapy that may be safely applied to a patient. The mitigation algorithm accepts two CPGs and available (likely incomplete) patient information. It reports whether mitigation has been successful or not, and on success it gives a feasible therapy and points at identified interactions (if any) together with the revisions that address them. Thus, we consider the mitigation algorithm as an alerting tool to support a physician in the concurrent application of CPGs that can be implemented as a component of a clinical decision support system. We illustrate our method in the context of two clinical scenarios involving a patient with duodenal ulcer who experiences an episode of transient ischemic attack. (c) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Mitigation of adverse interactions in pairs of clinical practice guidelines using constraint logic programming", "paper_id": "WOS:000317322500014"}