{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "file-drawer_problem"}, {"score": 0.004462308985053246, "phrase": "statistically_significant_results"}, {"score": 0.004008624230034271, "phrase": "quantitative_way"}, {"score": 0.0037406248553059386, "phrase": "cab"}, {"score": 0.003701989967050319, "phrase": "medline"}, {"score": 0.0036259093827331725, "phrase": "file_drawer_problem"}, {"score": 0.0032233306034106127, "phrase": "significant_differences"}, {"score": 0.0031461489526079236, "phrase": "particular_natural_science_topics"}, {"score": 0.002986907667028281, "phrase": "keywords_biodiversity"}, {"score": 0.0028161281608563267, "phrase": "worsening_file-drawer_problem"}, {"score": 0.0024432508011008563, "phrase": "selective_publication"}, {"score": 0.0023275553629639395, "phrase": "enhanced_bias"}, {"score": 0.002271773887265199, "phrase": "distorted_picture"}, {"score": 0.0021943920257952174, "phrase": "long-term_monitoring"}, {"score": 0.0021269997368140066, "phrase": "sustainable_and_reliable_production"}], "paper_keywords": ["History of science", " Meta-analysis", " Publication explosion", " Scientific knowledge", " Significant differences", " STM publishing"], "paper_abstract": "The file-drawer problem is the tendency of journals to preferentially publish studies with statistically significant results. The problem is an old one and has been documented in various fields, but to my best knowledge there has not been attention to how the issue is developing in a quantitative way through time. In the abstracts of various major scholarly databases (Science and Social Science Citation Index (1991-2008), CAB Abstracts and Medline (1970s-2008), the file drawer problem is gradually getting worse, in spite of an increase in (1) the total number of publications and (2) the proportion of publications reporting both the presence and the absence of significant differences. The trend is confirmed for particular natural science topics such as biology, energy and environment but not for papers retrieved with the keywords biodiversity, chemistry, computer, engineering, genetics, psychology and quantum (physics). A worsening file-drawer problem can be detected in various medical fields (infection, immunology, malaria, obesity, oncology and pharmacology), but not for papers indexed with strings such as AIDS/HIV, epidemiology, health and neurology. An increase in the selective publication of some results against some others is worrying because it can lead to enhanced bias in meta-analysis and hence to a distorted picture of the evidence for or against a certain hypothesis. Long-term monitoring of the file-drawer problem is needed to ensure a sustainable and reliable production of (peer-reviewed) scientific knowledge.", "paper_title": "Worsening file-drawer problem in the abstracts of natural, medical and social science databases", "paper_id": "WOS:000280947400015"}