{"auto_keywords": [{"score": 0.03720021037359001, "phrase": "in-air_signature"}, {"score": 0.00481495049065317, "phrase": "pattern_recognition_techniques"}, {"score": 0.004772593750252861, "phrase": "in-air_signature_biometrics"}, {"score": 0.004606843145343611, "phrase": "mobile_technology"}, {"score": 0.004566308708871429, "phrase": "new_services"}, {"score": 0.004070573090297285, "phrase": "private_user_information"}, {"score": 0.0034868462688262864, "phrase": "biometric_feature"}, {"score": 0.003350740737336966, "phrase": "hidden_markov_models"}, {"score": 0.0033214067823851075, "phrase": "bayes"}, {"score": 0.0027700855441353165, "phrase": "six_impostors"}, {"score": 0.002661883310629088, "phrase": "best_results"}, {"score": 0.002512990657100351, "phrase": "dynamic_time"}, {"score": 0.002382936364692606, "phrase": "average_template"}, {"score": 0.0022999859758286423, "phrase": "permanence_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Biometrics", " Signature", " Accelerometer", " Hidden Markov models", " Bayes", " Dynamic time warping"], "paper_abstract": "As a result of advances in mobile technology, new services which benefit from the ubiquity of these devices are appearing. Some of these services require the identification of the subject since they may access private user information. In this paper, we propose to identify each user by drawing his/her handwritten signature in the air (in-air signature). In order to assess the feasibility of an in-air signature as a biometric feature, we have analysed the performance of several well-known pattern recognition techniques Hidden Markov Models, Bayes classifiers and dynamic time warping to cope with this problem. Each technique has been tested in the identification of the signatures of 96 individuals. Furthermore, the robustness of each method against spoofing attacks has also been analysed using six impostors who attempted to emulate every signature. The best results in both experiments have been reached by using a technique based on dynamic time warping which carries out the recognition by calculating distances to an average template extracted from several training instances. Finally, a permanence analysis has been carried out in order to assess the stability of in-air signature over time. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis of pattern recognition techniques for in-air signature biometrics", "paper_id": "WOS:000292849000023"}