{"auto_keywords": [{"score": 0.010127401218098618, "phrase": "wide_range"}, {"score": 0.0064684816182463255, "phrase": "large-scale_systems"}, {"score": 0.00481495049065317, "phrase": "centralized_systems"}, {"score": 0.004634380652505945, "phrase": "highly_scalable_implementations"}, {"score": 0.0045667395804097136, "phrase": "distributed_services"}, {"score": 0.004473689992665426, "phrase": "symmetric_roles"}, {"score": 0.004230532852280929, "phrase": "central_component"}, {"score": 0.004181043455992058, "phrase": "global_knowledge"}, {"score": 0.004059827743016726, "phrase": "individual_decisions"}, {"score": 0.004012327233842635, "phrase": "local_knowledge"}, {"score": 0.003749747076821239, "phrase": "distributed_applications"}, {"score": 0.003556251226438769, "phrase": "highly_visible_successes"}, {"score": 0.0035353781038448486, "phrase": "skype"}, {"score": 0.0035146326373055614, "phrase": "bitcoin"}, {"score": 0.003236502732219314, "phrase": "cloud-based_systems"}, {"score": 0.0030966491684507646, "phrase": "increasing_number"}, {"score": 0.00303346212256215, "phrase": "growing_volumes"}, {"score": 0.0028768215428376185, "phrase": "efficient_services"}, {"score": 0.0028015524797771066, "phrase": "local_nature"}, {"score": 0.0026725573963372533, "phrase": "single_multi-core_machine"}, {"score": 0.0026334743451638365, "phrase": "data_center"}, {"score": 0.002587326429221013, "phrase": "multiple_autonomous_hosts"}, {"score": 0.0023064113959127288, "phrase": "future_large-scale_systems"}, {"score": 0.0022726706036523465, "phrase": "fully_decentralized_strategies"}, {"score": 0.0021872315757161644, "phrase": "cloud_computing"}, {"score": 0.002174374647551399, "phrase": "big_data"}, {"score": 0.0021488865854453073, "phrase": "general_guidelines"}], "paper_keywords": ["Cloud computing", " Peer-to-peer", " Decentralized distributed systems"], "paper_abstract": "Peer-to-peer (P2P) systems have been widely researched over the past decade, leading to highly scalable implementations for a wide range of distributed services and applications. A P2P system assigns symmetric roles to machines, which can act both as client and server. This alleviates the need for any central component to maintain a global knowledge of the system. Instead, each peer takes individual decisions based on a local knowledge of the rest of the system, providing scalability by design. While P2P systems have been successfully applied to a wide range of distributed applications (multicast, routing, storage, pub-sub, video streaming), with some highly visible successes (Skype, Bitcoin), they tend to have fallen out of fashion in favor of a much more cloud-centric vision of the current Internet. We think this is paradoxical, as cloud-based systems are themselves large-scale, highly distributed infrastructures. They reside within massive, densely interconnected datacenters, and must execute efficiently on an increasing number of machines, while dealing with growing volumes of data. Today even more than a decade ago, large-scale systems require scalable designs to deliver efficient services. In this paper we argue that the local nature of P2P systems is key for scalability regardless whether a system is eventually deployed on a single multi-core machine, distributed within a data center, or fully decentralized across multiple autonomous hosts. Our claim is backed by the observation that some of the most scalable services in use today have been heavily influenced by abstractions and rationales introduced in the context of P2P systems. Looking to the future, we argue that future large-scale systems could greatly benefit from fully decentralized strategies inspired from P2P systems. We illustrate the P2P legacy through several examples related to Cloud Computing and Big Data, and provide general guidelines to design large-scale systems according to a P2P philosophy.", "paper_title": "Want to scale in centralized systems? Think P2P", "paper_id": "WOS:000366797400001"}