{"auto_keywords": [{"score": 0.03393139807622968, "phrase": "concurrency_theory"}, {"score": 0.031114378706776625, "phrase": "event_structures"}, {"score": 0.00481495049065317, "phrase": "event-based_reputation_systems"}, {"score": 0.004701825207431857, "phrase": "global_computing_scenario"}, {"score": 0.004646258518859209, "phrase": "trust-based_systems"}, {"score": 0.004378078970574258, "phrase": "traditional_security_mechanisms"}, {"score": 0.004224627834741731, "phrase": "research_concerns"}, {"score": 0.0037731618765688584, "phrase": "computing_agent"}, {"score": 0.0035977623578676496, "phrase": "future_behaviour"}, {"score": 0.0031374619658664843, "phrase": "fundamental_challenges"}, {"score": 0.0022745508619577927, "phrase": "generic_results"}, {"score": 0.0022476051902301187, "phrase": "formal_properties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "In the Global Computing scenario, trust-based systems have been proposed and studied as an alternative to traditional security mechanisms. A promising line of research concerns the so-called reputation-based computational trust. The approach here is that trust in a computing agent is defined in terms of evidence of future behaviour based on interactions in the past with its environment. We have previously argued how concepts and models from concurrency theory can answer some fundamental challenges in the representation of such interaction behaviour over time, using event structures as our choice of model from concurrency theory. In this paper, we continue this line of research, addressing the problem on how to transfer trust from one behavioural context to another. Our proposed frameworks build on morphisms between event structures, and we prove some generic results guaranteeing formal properties of transfers in the frameworks. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Transfer of trust in event-based reputation systems", "paper_id": "WOS:000302822300026"}