{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "workflow_authorization_systems"}, {"score": 0.011452371780751706, "phrase": "workflow_satisfiability_problem"}, {"score": 0.004642292792558686, "phrase": "-relation-based_access_control"}, {"score": 0.004335000368745273, "phrase": "user's_role_memberships"}, {"score": 0.004276016541197123, "phrase": "user's_relationships"}, {"score": 0.003545625043276134, "phrase": "computational_complexity"}, {"score": 0.003177235604998673, "phrase": "parameterized_complexity_theory"}, {"score": 0.0028995712226514746, "phrase": "sat_solvers"}, {"score": 0.0027197343489967322, "phrase": "reasonable_size"}, {"score": 0.002493333098814506, "phrase": "normal_situations"}, {"score": 0.00243694486220507, "phrase": "resiliency_problem"}, {"score": 0.0021340985236583034, "phrase": "workflow_systems"}, {"score": 0.0021049977753042253, "phrase": "computational_problems"}], "paper_keywords": ["Security", " Theory", " Access control", " fault tolerant", " policy design"], "paper_abstract": "We propose the role-and-relation-based access control (R(2)BAC) model for workflow authorization systems. In R(2)BAC, in addition to a user's role memberships, the user's relationships with other users help determine whether the user is allowed to perform a certain step in a workflow. For example, a constraint may require that two steps must not be performed by users who have conflicts of interests. We study computational complexity of the workflow satisfiability problem, which asks whether a set of users can complete a workflow. In particular, we apply tools from parameterized complexity theory to better understand the complexities of this problem. Furthermore, we reduce the workflow satisfiability problem to SAT and apply SAT solvers to address the problem. Experiments show that our algorithm can solve instances of reasonable size efficiently. Finally, it is sometimes not enough to ensure that a workflow can be completed in normal situations. We study the resiliency problem in workflow authorization systems, which asks whether a workflow can be completed even if a number of users may be absent. We formally define three levels of resiliency in workflow systems and study computational problems related to these notions of resiliency.", "paper_title": "Satisfiability and Resiliency in Workflow Authorization Systems", "paper_id": "WOS:000285713900012"}