{"auto_keywords": [{"score": 0.046185630960691164, "phrase": "vestibular_information"}, {"score": 0.04237837559550074, "phrase": "load_transfer"}, {"score": 0.00481495049065317, "phrase": "lateral_acceleration"}, {"score": 0.004767261858417823, "phrase": "steering_assistance"}, {"score": 0.004251500979153001, "phrase": "modern_cars"}, {"score": 0.0036070601923916196, "phrase": "road_departure"}, {"score": 0.003347259612209552, "phrase": "tilt_movement"}, {"score": 0.002769568481822277, "phrase": "visual_information"}, {"score": 0.002444883254621769, "phrase": "informed_participants"}, {"score": 0.002223770196464436, "phrase": "steering_task"}, {"score": 0.0021798257311714665, "phrase": "explicit_processing"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["visual and kinaesthetic information", " steering assistance", " perception of lateral acceleration"], "paper_abstract": "This work examines whether it is possible to compensate for the loss of vestibular information that is usually felt by drivers of modern cars when negotiating bends and which is associated with the load transfer of the car. Indeed, the absence of this information causes drivers to underestimate their speed and consequently increases the risk of road departure. This study tries to visually compensate for this loss of vestibular information through a tilt movement of the frame of reference of the driver. This tilt is the same as that perceived in a bend because of the load transfer of the car. The results indicate that most participants are influenced by this visual information and modify their speed accordingly whilst taking a bend. Nevertheless, only those participants uninformed about the presence of this assistance did slow down, whereas informed participants accelerated. This effect has been interpreted as a consequence of the level of processing implicated in the steering task (implicit versus explicit processing). (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A visual sign of lateral acceleration for steering assistance", "paper_id": "WOS:000254064700003"}