{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "inverse_procedural_modeling"}, {"score": 0.04526401993236224, "phrase": "l-system_rules"}, {"score": 0.04461328156994422, "phrase": "regular_structures"}, {"score": 0.0047787596516662, "phrase": "automatic_generation_of_l-"}, {"score": 0.004671803485255806, "phrase": "important_step"}, {"score": 0.004481868017991508, "phrase": "parametric_context-free_l-systems"}, {"score": 0.004124754315882517, "phrase": "structure_transformations"}, {"score": 0.003927203683176278, "phrase": "atomic_elements"}, {"score": 0.003810348067898898, "phrase": "similar_elements"}, {"score": 0.0037390789999636764, "phrase": "terminal_symbols"}, {"score": 0.0036969566358089644, "phrase": "l-system_alphabet"}, {"score": 0.0036553070575015344, "phrase": "terminal_symbols'_position"}, {"score": 0.00340217066797559, "phrase": "careful_analysis"}, {"score": 0.003325921766364862, "phrase": "transformation_spaces"}, {"score": 0.003154566400499823, "phrase": "coded_elements"}, {"score": 0.0029360049890445944, "phrase": "code_groups"}, {"score": 0.0027741761880779535, "phrase": "single_group"}, {"score": 0.0026915366885986586, "phrase": "l-system_axiom"}, {"score": 0.0024395426929046415, "phrase": "input_image"}, {"score": 0.0023137485947956732, "phrase": "l-system_parameters"}, {"score": 0.0021049977753042253, "phrase": "non-terminal_symbols"}], "paper_keywords": [""], "paper_abstract": "We present an important step towards the solution of the problem of inverse procedural modeling by generating parametric context-free L-systems that represent an input 2D model. The L-system rules efficiently code the regular structures and the parameters represent the properties of the structure transformations. The algorithm takes as input a 2D vector image that is composed of atomic elements, such as curves and poly-lines. Similar elements are recognized and assigned terminal symbols of an L-system alphabet. The terminal symbols' position and orientation are pair-wise compared and the transformations are stored as points in multiple 4D transformation spaces. By careful analysis of the clusters in the transformation spaces, we detect sequences of elements and code them as L-system rules. The coded elements are then removed from the clusters, the clusters are updated, and then the analysis attempts to code groups of elements in (hierarchies) the same way. The analysis ends with a single group of elements that is coded as an L-system axiom. We recognize and code branching sequences of linearly translated, scaled, and rotated elements and their hierarchies. The L-system not only represents the input image, but it can also be used for various editing operations. By changing the L-system parameters, the image can be randomized, symmetrized, and groups of elements and regular structures can be edited. By changing the terminal and non-terminal symbols, elements or groups of elements can be replaced.", "paper_title": "Inverse Procedural Modeling by Automatic Generation of L-systems", "paper_id": "WOS:000278182500043"}