{"auto_keywords": [{"score": 0.048846087603041044, "phrase": "network_revenue"}, {"score": 0.036598248434623164, "phrase": "price_anticipation_mechanism"}, {"score": 0.022351700391217373, "phrase": "wcdma_networks"}, {"score": 0.019914073813334637, "phrase": "price_acceptation_mechanism"}, {"score": 0.00481495049065317, "phrase": "rational_user_behavior"}, {"score": 0.0047732596509542135, "phrase": "wcdma_network"}, {"score": 0.0038401488612789963, "phrase": "self-interest_behaviours"}, {"score": 0.0037411604449359794, "phrase": "technical_architecture"}, {"score": 0.0037087324991876727, "phrase": "network_engineering"}, {"score": 0.003340768341189764, "phrase": "price_anticipators"}, {"score": 0.0032974089700312423, "phrase": "price_anticipator"}, {"score": 0.0031431690368229443, "phrase": "network_resource_allocation"}, {"score": 0.0030223381739019894, "phrase": "view_point"}, {"score": 0.0029961221584602405, "phrase": "game_theory"}, {"score": 0.0029443683459283955, "phrase": "equilibrium_properties"}, {"score": 0.0021049977753042253, "phrase": "individual_user"}], "paper_keywords": ["WCDMA networks", " price acceptation mechanism", " price anticipation mechanism", " game theory", " Nash equilibrium"], "paper_abstract": "In WCDMA networks, most economic-based resource management algorithms only assumed that network users were obedient, that is, users only accepted the price declared by network, which is called as price acceptation mechanism. Many research issues argued that it is necessary to accommodate, if possible, to use self-interest behaviours of users to strengthen the technical architecture of network engineering. Thus, this paper explicitly considered the selfishness of users, investigated the price anticipation mechanism in WCDMA networks, in which users acted as price anticipators. By price anticipator it meant users anticipated the effect of their behaviours on the network resource allocation, and adopted strategy correspondingly. From the view point of game theory, we investigated equilibrium properties of the price anticipation mechanism in WCDMA networks, and, through two scenarios, illustrated the relationship between price anticipation mechanism and price acceptation mechanism from the viewpoint of network revenue. Finally, we drew the conclusion that, the network revenue generated in price anticipation mechanism was less than revenue generated in price acceptation mechanism, (the difference between those two mechanisms is called as \"price as anarchy\"), and the network revenue generated in those two mechanisms tends to be consistent, when the effect of individual user is negligible.", "paper_title": "Studying rational user behavior in WCDMA network and its effect on network revenue", "paper_id": "WOS:000240084000065"}