{"auto_keywords": [{"score": 0.046081391722127746, "phrase": "verb_classifications"}, {"score": 0.029899346603175007, "phrase": "verb_classes"}, {"score": 0.00481495049065317, "phrase": "formal_concept_analysis"}, {"score": 0.004610058444728656, "phrase": "semantic_role_sets"}, {"score": 0.004553128404612054, "phrase": "french_verbs"}, {"score": 0.004469042910390712, "phrase": "natural_language_processing"}, {"score": 0.004096635798793164, "phrase": "syntactic_and_semantic_generalisations"}, {"score": 0.003802135020791801, "phrase": "supervised_learning"}, {"score": 0.0037551444630619015, "phrase": "shallow_semantic_parsers"}, {"score": 0.0032953582866530966, "phrase": "novel_approach"}, {"score": 0.003115927670011538, "phrase": "fca"}, {"score": 0.0026835920552084514, "phrase": "established_benchmark"}, {"score": 0.002585206414738808, "phrase": "previous_approaches"}, {"score": 0.0021049977753042253, "phrase": "syntactic_and_semantic_characterisation"}], "paper_keywords": ["Natural Language Processing", " Verb classification", " Concept selection indexes"], "paper_abstract": "In Natural Language Processing, verb classifications have been shown to be useful both theoretically (to capture syntactic and semantic generalisations about verbs) and practically (to support factorisation and the supervised learning of shallow semantic parsers). Acquiring such classifications manually is both costly and errror prone however. In this paper, we present a novel approach for automatically acquiring verb classifications. The approach uses FCA to build a concept lattice from existing linguistic resources; and stability and separation indices to extract from this lattice those concepts that most closely capture verb classes. The approach is evaluated on an established benchmark and shown to differ from previous approaches and in particular, from clustering approaches, in two main ways. First, it supports polysemy (because a verb may belong to several classes). Second, it naturally provides a syntactic and semantic characterisation of the verb classes produced (by creating concepts which systematically associate verbs with their syntactic and semantic attributes).", "paper_title": "Combining formal concept analysis and translation to assign frames and semantic role sets to French verbs", "paper_id": "WOS:000334510500007"}