{"auto_keywords": [{"score": 0.04216569347463039, "phrase": "italy"}, {"score": 0.011226561880684343, "phrase": "spain"}, {"score": 0.004676345706416371, "phrase": "contradictory_information"}, {"score": 0.004598933498016774, "phrase": "contradictory_consequences"}, {"score": 0.004466519142879166, "phrase": "theoretical_study"}, {"score": 0.00421297029755273, "phrase": "intuitionistic_fuzzy_sets"}, {"score": 0.0041878681418000925, "phrase": "perugia"}, {"score": 0.003875424718379985, "phrase": "contradictory_and_n-contradictory_atanassov_intuitionistic_sets"}, {"score": 0.003265365666305185, "phrase": "n._the_purpose"}, {"score": 0.0032225610858994764, "phrase": "madrid"}, {"score": 0.003028727936200845, "phrase": "fixed_negation"}, {"score": 0.002953711377604328, "phrase": "e.e._castineira"}, {"score": 0.002909668278975106, "phrase": "aifs"}, {"score": 0.0025623050508233078, "phrase": "mathematical_model"}, {"score": 0.0024573577356299765, "phrase": "intuitionistic_negation"}, {"score": 0.002376495929405298, "phrase": "minimum_axioms"}, {"score": 0.00212268510072928, "phrase": "early_examples"}, {"score": 0.0021049977753042253, "phrase": "valid_functions"}], "paper_keywords": ["Atanassov's intuitionistic fuzzy sets", " N-contradiction measures", " Continuity from below and from above"], "paper_abstract": "The importance of dealing with contradictory information or of deriving contradictory consequences in inference processes justifies undertaking a theoretical study on the subject of contradiction In [S Cubillo. E. Castineira, Contradiction in intuitionistic fuzzy sets. in. Proceedings of the Conference IPMU'2004, Perugia, Italy, 2004, pp 2180-2186] we defined contradictory and N-contradictory Atanassov intuitionistic sets, where we established that two sets A and B are N-contradictory, with respect to a given intuitionistic negation N, if A implies N(B), and are contradictory if they are N-contradictory for some negation N. The purpose of this article is to thoroughly examine the model for measuring contradiction between two Atanassov intuitionistic fuzzy sets irrespective of a fixed negation, proposed in [C Torres-Blanc, E.E. Castineira, S Cubillo. Measuring contradiction between two AIFS, in: Proceedings of the Eighth International FLINS Conference, Madrid, Spain, 2008, pp 253-258], and also to introduce a mathematical model to measure N-contradiction between sets, where is an intuitionistic negation First, we justify and determine the minimum axioms that a function must satisfy to be able to be used as a measure of contradiction or a measure of N-contradiction Also, we introduce some early examples of valid functions that conform to the model Then, we establish the conditions for these measures to be continuous from below or continuous from above. Finally, we build families of contradiction and N-contradiction measures, establishing how they are relate to each other, and we look at how they behave with respect to continuity. (C) 2009 Elsevier Inc All rights reserved.", "paper_title": "An axiomatic model for measuring contradiction and N-contradiction between two AIFSs", "paper_id": "WOS:000274351300005"}