{"auto_keywords": [{"score": 0.04973021453803807, "phrase": "user_authentication"}, {"score": 0.00481495049065317, "phrase": "representative_users"}, {"score": 0.004591466267316524, "phrase": "access_control"}, {"score": 0.004508286991825192, "phrase": "access_restriction"}, {"score": 0.0044104497301196794, "phrase": "stolen_usernames"}, {"score": 0.004283280680222718, "phrase": "legitimate_users"}, {"score": 0.004205660924155212, "phrase": "malicious_activity"}, {"score": 0.004175006647851034, "phrase": "biometric_authentication"}, {"score": 0.0041445748748895365, "phrase": "additional_user_characteristics"}, {"score": 0.00385214804128572, "phrase": "novel_approach"}, {"score": 0.0037684961730030235, "phrase": "keystroke_dynamics"}, {"score": 0.0037273513742154237, "phrase": "password_entry"}, {"score": 0.003351987298847214, "phrase": "small_subset"}, {"score": 0.003161271802988128, "phrase": "password_entry_keystroke_dynamics"}, {"score": 0.0031267359296488118, "phrase": "examined_user"}, {"score": 0.0028847066125323893, "phrase": "high_volume"}, {"score": 0.0025939803934423486, "phrase": "second_strategy"}, {"score": 0.0022568093356079414, "phrase": "higher_number"}, {"score": 0.0021597049163247476, "phrase": "extensive_evaluation"}], "paper_keywords": ["Behavioral biometric", " computer security", " keystrokes biometric", " user authentication"], "paper_abstract": "User authentication based on username and password is the most common means to enforce access control. This form of access restriction is prone to hacking since stolen usernames and passwords can be exploited to impersonate legitimate users in order to commit malicious activity. Biometric authentication incorporates additional user characteristics such as the manner by which the keyboard is used in order to identify users. We introduce a novel approach for user authentication based on the keystroke dynamics of the password entry. A classifier is tailored to each user and the novelty lies in the manner by which the training set is constructed. Specifically, only the keystroke dynamics of a small subset of users, which we refer to as representatives, is used along with the password entry keystroke dynamics of the examined user. The contribution of this approach is twofold: it reduces the possibility of overfitting, while allowing scalability to a high volume of users. We propose two strategies to construct the subset for each user. The first selects the users whose keystroke profiles govern the profiles of all the users, while the second strategy chooses the users whose profiles are the most similar to the profile of the user for whom the classifier is constructed. Results are promising reaching in some cases 90% area under the curve. In many cases, a higher number of representatives deteriorate the accuracy which may imply overfitting. An extensive evaluation was performed using a dataset containing over 780 users.", "paper_title": "User Authentication Based on Representative Users", "paper_id": "WOS:000312885400045"}