{"auto_keywords": [{"score": 0.04959024199151092, "phrase": "digital_video"}, {"score": 0.015325765905754992, "phrase": "vcr-like_control_set"}, {"score": 0.00481495049065317, "phrase": "user_navigation"}, {"score": 0.004550669123303854, "phrase": "almost_explosive_growth"}, {"score": 0.0038810583785936505, "phrase": "media_players"}, {"score": 0.0037632749713937637, "phrase": "windows_media_player"}, {"score": 0.0030640804704319255, "phrase": "digital_video_navigation_system"}, {"score": 0.002895620643297197, "phrase": "large_sample"}, {"score": 0.0026532596852754525, "phrase": "goal-directed_navigational_tasks"}, {"score": 0.0026126405272417783, "phrase": "user's_navigational_activity"}, {"score": 0.002443671484766342, "phrase": "navigational_data"}, {"score": 0.0023331227492950422, "phrase": "vcr-like_control"}, {"score": 0.002250601866422547, "phrase": "user's_ability"}, {"score": 0.0021049977753042253, "phrase": "browsing_strategies"}], "paper_keywords": ["digital video", " user navigation", " browsing", " searching", " VCR", " media players", " multimedia", " empirical study"], "paper_abstract": "There has been an almost explosive growth in digital video in recent years. The convention for enabling users to navigate digital video is the Video Cassette Recorder-like (VCR-like) control set, which is dictated by the proliferation of media players that embody it, including Windows Media Player and QuickTime. However, there is a dearth of research seeking to understand how users relate to this control set and how useful it actually is in practice. This paper details our empirical investigation of the issue. A digital video navigation system with a VCR-like control set was developed and subsequently used by a large sample of users (n = 200), who were required to complete a number of goal-directed navigational tasks. Each user's navigational activity was tracked and recorded automatically by the system. Analysis of the navigational data revealed a range of results concerning how the VCR-like control set both enhanced and limited the user's ability to locate sequences of interest, including a number of searching and browsing strategies that were exploited by the users. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "An empirical investigation into user navigation of digital video using the VCR-like control set", "paper_id": "WOS:000236077900004"}