{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "main_aim"}, {"score": 0.004717325943509345, "phrase": "promising_directions"}, {"score": 0.004642759865520657, "phrase": "temporal_representation"}, {"score": 0.004538267573249093, "phrase": "recent_scientific_literature"}, {"score": 0.004486902681562801, "phrase": "current_interest"}, {"score": 0.004436116555817464, "phrase": "different_research_perspectives"}, {"score": 0.0042579795015449005, "phrase": "well-known_field"}, {"score": 0.004209773542630883, "phrase": "medical_as_well_as_computer_science_community"}, {"score": 0.004096285059629847, "phrase": "temporal_clinical_databases"}, {"score": 0.0040591367766929344, "phrase": "temporal_clinical_data"}, {"score": 0.004040688646993605, "phrase": "therapeutic_assessments"}, {"score": 0.003985843791021747, "phrase": "clinical_knowledge"}, {"score": 0.003860738817566581, "phrase": "intensive_care_patients"}, {"score": 0.0038170129089059013, "phrase": "chronic_patients"}, {"score": 0.0037480753312398754, "phrase": "clinical_routine_activities"}, {"score": 0.0037310356300777206, "phrase": "complex_healthcare_organizations"}, {"score": 0.003663645143713398, "phrase": "significant_research_areas"}, {"score": 0.003613899384402803, "phrase": "temporal_representation_and_reasoning_issues"}, {"score": 0.003548617093221667, "phrase": "promising_topics"}, {"score": 0.0035324809645410167, "phrase": "future_activity"}, {"score": 0.003413767948533902, "phrase": "entire_team"}, {"score": 0.0033674036081286006, "phrase": "future_fields"}, {"score": 0.0027932207498610516, "phrase": "main_goals"}, {"score": 0.0027615518064255623, "phrase": "interesting_and_promising_directions"}, {"score": 0.0027116246112603875, "phrase": "recent_literature"}, {"score": 0.0026504796864060924, "phrase": "considered_research_areas"}, {"score": 0.002590709948069868, "phrase": "common_theoretical_and_methodological_features"}, {"score": 0.0025554953661561467, "phrase": "imminent_interest"}, {"score": 0.0024526906395360253, "phrase": "promising_subjects"}, {"score": 0.0024415256531602316, "phrase": "future_research"}, {"score": 0.0024083339830054096, "phrase": "software_systems"}, {"score": 0.0023755924672044793, "phrase": "multifaceted_temporal_aspects"}, {"score": 0.002264455133925284, "phrase": "different_perspectives"}, {"score": 0.0021683794516163474, "phrase": "multidisciplinary_work"}, {"score": 0.0021535859428954145, "phrase": "described_fields"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["temporal representation", " temporal reasoning", " fuzzy sets and logic", " health information systems", " temporal clinical databases", " medicine"], "paper_abstract": "Objective: The main aim of this paper is to propose and discuss promising directions of research in the field of temporal representation and reasoning in medicine, taking into account the recent scientific literature and challenging issues of current interest as viewed from the different research perspectives of the authors of the paper. Background: Temporal representation and reasoning in medicine is a well-known field of research in the medical as well as computer science community. It encompasses several topics, such as summarizing data from temporal clinical databases, reasoning on temporal clinical data for therapeutic assessments, and modeling uncertainty in clinical knowledge and data. It is also related to several medical tasks, such as monitoring intensive care patients, providing treatments for chronic patients, as well as planning and scheduling clinical routine activities within complex healthcare organizations. Methodology: The authors jointly identified significant research areas based on their importance as for temporal representation and reasoning issues; the subjects were considered to be promising topics of future activity. Every subject was addressed in detail by one or two authors and then discussed with the entire team to achieve a consensus about future fields of research. Results: We identified and focused on four research areas, namely (i) fuzzy logic, time, and medicine, (ii) temporal reasoning and data mining, (iii) health information systems, business processes, and time, and (iv) temporal clinical databases. For every area, we first highlighted a few basic notions that would permit any reader - including those who are unfamiliar with the topic-to understand the main goals. We then discuss interesting and promising directions of research, taking into account the recent literature and underlining the yet unresolved medical/clinical issues that deserve further scientific investigation. The considered research areas are by no means disjointed, because they share common theoretical and methodological features. Moreover, subjects of imminent interest in medicine are represented in many of the fields considered. Conclusions: We propose and discuss promising subjects of future research that deserve investigation to develop software systems that will property manage the multifaceted temporal aspects of information and knowledge encountered by physicians during their clinical work. As the subjects of research have resulted from merging the different perspectives of the authors involved in this study, we hope the paper will succeed in stimulating discussion and multidisciplinary work in the described fields of research. (C) 2006 Published by Elsevier B.V.", "paper_title": "Temporal representation and reasoning in medicine: Research directions and challenges", "paper_id": "WOS:000242492100002"}