{"auto_keywords": [{"score": 0.004720717782144015, "phrase": "automatic_text_segmentation_task"}, {"score": 0.004448892453489832, "phrase": "homogeneous_passages"}, {"score": 0.004413846562278824, "phrase": "text_segmentation"}, {"score": 0.004344577216137524, "phrase": "large_amount"}, {"score": 0.004192653260742387, "phrase": "statistical_approaches"}, {"score": 0.0035507457285983268, "phrase": "global_way"}, {"score": 0.0034811680446852054, "phrase": "granularity_degree"}, {"score": 0.0033860360186761533, "phrase": "different_topics"}, {"score": 0.0031782087629067686, "phrase": "global_views"}, {"score": 0.003128270147867462, "phrase": "classstruggle"}, {"score": 0.003066945490483524, "phrase": "initial_clustering"}, {"score": 0.002607246047604476, "phrase": "seggen"}, {"score": 0.002566255769251419, "phrase": "potential_segmentations"}, {"score": 0.0025359354516609795, "phrase": "whole_text"}, {"score": 0.0024960634897058394, "phrase": "genetic_algorithm"}, {"score": 0.0023334673218688437, "phrase": "internal_cohesion"}, {"score": 0.0022339335462778437, "phrase": "adjacent_ones"}, {"score": 0.0021987994275190314, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": [""], "paper_abstract": "The automatic text segmentation task consists of identifying the most important thematic breaks in a document in order to cut it into homogeneous passages. Text segmentation has motivated a large amount Of research. We focus here on the statistical approaches that rely on an analysis of the distribution of the words in the text. Usually, the segmentation of texts is realized sequentially on the basis of very local clues. However such an approach prevents the consideration of the text. in a global way, particularly concerning the granularity degree adopted for the expression of the different topics it addresses. We thus propose here two new segmentation algorithms-ClassStruggle and SegGen-which use criteria rendering global views of texts. ClassStruggle is based on an initial clustering of the sentences of the text, thus allowing the consideration of similarities within a group rather than individually. It relies on the distribution of the occurrences of the members of each class I to segment the texts. SegGen proposes to evaluate potential segmentations Of the whole text thanks to a genetic algorithm. It attempts to find a solution of segmentation optimizing two criteria, the maximization of the internal cohesion of the segments and the minimization Of the similarity between adjacent ones. According to experimental results, both approaches appear to be very competitive compared to existing methods.", "paper_title": "Toward a more global and coherent segmentation of texts", "paper_id": "WOS:000254579900003"}