{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bus-based_embedded_socs"}, {"score": 0.004191690483929023, "phrase": "jpeg_encoders"}, {"score": 0.004081385289516914, "phrase": "aes_encoders"}, {"score": 0.0038487848937121204, "phrase": "system-level_tradeoffs"}, {"score": 0.003332332086930163, "phrase": "computing_performance"}, {"score": 0.0031422859551159506, "phrase": "higher_bandwidth"}, {"score": 0.0028089634624677957, "phrase": "design_flow"}, {"score": 0.0027643161113894018, "phrase": "accelerator_parallelization"}, {"score": 0.0026486862281576086, "phrase": "huge_optimization_space"}, {"score": 0.002578880352208335, "phrase": "effective_algorithm"}, {"score": 0.002497531381123025, "phrase": "total_soc_latency"}, {"score": 0.002431699464104896, "phrase": "soc_area"}, {"score": 0.002317533977770783, "phrase": "performance_difference"}, {"score": 0.002256435842862802, "phrase": "optimal_results"}, {"score": 0.0021620042653528846, "phrase": "running_time"}], "paper_keywords": ["accelerator parallelization", " point-to-point interconnect insertion", " bus-based embedded system-on-chips"], "paper_abstract": "As performance requirements for bus-based embedded System-on-Chips (SoCs) increase, more and more on-chip application-specific hardware accelerators (e.g., filters, FFTs, JPEG encoders, GSMs, and AES encoders) are being integrated into their designs. These accelerators require system-level tradeoffs among performance, area, and scalability. Accelerator parallelization and Point-to-Point (P2P) interconnect insertion are two effective system-level adjustments. The former helps to boost the computing performance at the cost of area, while the latter provides higher bandwidth at the cost of routability. What's more, they interact with each other. This paper proposes a design flow to optimize accelerator parallelization and P2P interconnect insertion simultaneously. To explore the huge optimization space, we develop an effective algorithm, whose goal is to reduce total SoC latency under the constraints of SoC area and total P2P wire length. Experimental results show that the performance difference between our proposed algorithm and the optimal results is only 2.33% on average, while the running time of the algorithm is less than 17 s.", "paper_title": "Simultaneous Accelerator Parallelization and Point-to-Point Interconnect Insertion for Bus-Based Embedded SoCs", "paper_id": "WOS:000368923700012"}