{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "malaysia"}, {"score": 0.004721162131188487, "phrase": "information_and_communication_technologies"}, {"score": 0.0041625173012740544, "phrase": "virtual_media"}, {"score": 0.0040176151419992956, "phrase": "relentless_pressure"}, {"score": 0.003877737556673229, "phrase": "greater_understanding"}, {"score": 0.00348655247465418, "phrase": "main_determinants"}, {"score": 0.003432044343307207, "phrase": "organisational_culture"}, {"score": 0.00327356326590461, "phrase": "cultural_barriers"}, {"score": 0.003134705849154561, "phrase": "e-government_initiatives"}, {"score": 0.003073545175760353, "phrase": "anthropological_framework"}, {"score": 0.0030254743224136273, "phrase": "grid_and_group_cultural_theory"}, {"score": 0.0030017207229983385, "phrase": "mary_douglas"}, {"score": 0.0027307746993761035, "phrase": "cultural_cosmologies"}, {"score": 0.0026252106881752067, "phrase": "cultural_pluralism"}, {"score": 0.002594342451017824, "phrase": "enabling_forms"}, {"score": 0.0024842242921857705, "phrase": "successful_implementation"}, {"score": 0.002445347925313158, "phrase": "e-government_services"}, {"score": 0.002323142666222693, "phrase": "constraining_characteristics"}, {"score": 0.002146926767291475, "phrase": "cross_comparison"}, {"score": 0.0021049977753042253, "phrase": "cultural_issues"}], "paper_keywords": ["E-Government", " organisational culture", " cultural theory", " ICT and government", " technological change"], "paper_abstract": "In recent years, information and communication technologies (ICTs), particularly web-based technologies, have created a more complex and challenging information technology (IT) environment for governments throughout the world. As more and more activities are migrating from physical to virtual media, users and employees have been faced with relentless pressure to use technology. This calls for a greater understanding of the human, social and cultural issues involved in the acceptance of IT systems by all stakeholders of the organisation. Indeed increasingly it has been acknowledged that one of the main determinants of IT success is organisational culture, and consequently the purpose of this research is to examine cultural barriers and enablers which have impeded or facilitated the implementation of E-Government initiatives in Malaysia. An anthropological framework based on the Grid and Group Cultural Theory of Mary Douglas is used to study this issue in more depth. This framework identifies four cultural cosmologies-hierarchism, egalitarianism, individualism and fatalism. We argue that cultural cosmologies can have both enabling and constraining characteristics and that cultural pluralism in the enabling forms of hierarchism, egalitarianism and individualism is essential for the successful implementation and operation of E-Government services. We illustrate these points through two case studies in Malaysia-one displaying constraining characteristics, which impeded IT implementation/use and the other displaying enabling characteristics, which facilitated IT implementation/use. Finally, a cross comparison of the two case studies on cultural issues is also provided.", "paper_title": "Cultural issues in developing E-Government in Malaysia", "paper_id": "WOS:000278664600010"}