{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "pattern_formation"}, {"score": 0.02771827748688238, "phrase": "oblivious_asynchronous_robots"}, {"score": 0.026989064799052012, "phrase": "nonoblivious_fully_synchronous_robots"}, {"score": 0.004594951819987416, "phrase": "mobile_robots"}, {"score": 0.004453874101119545, "phrase": "agreement_problem"}, {"score": 0.0044192837023190445, "phrase": "distributed_computing"}, {"score": 0.004317109072311102, "phrase": "anonymous_mobile_robots"}, {"score": 0.004135859558144883, "phrase": "\"look-compute-move\"_cycle"}, {"score": 0.003900853871728297, "phrase": "next_position"}, {"score": 0.00337650257503995, "phrase": "ith_look"}, {"score": 0.0033502976185921, "phrase": "compute"}, {"score": 0.002854761308379149, "phrase": "execution_history"}, {"score": 0.002766963729586353, "phrase": "robots'_positions"}, {"score": 0.0027240799841720957, "phrase": "immediately_preceding_look"}, {"score": 0.0026402908398883832, "phrase": "geometric_patterns"}, {"score": 0.0025892330566358503, "phrase": "exactly_the_set"}, {"score": 0.0021049977753042253, "phrase": "geometric_pattern"}], "paper_keywords": ["agreement problem", " memory", " mobile robot", " pattern formation", " self-organization", " synchrony"], "paper_abstract": "We investigate pattern formation, i.e., self-organization, by a swarm of mobile robots, which is closely related with the agreement problem in distributed computing. Consider a system of anonymous mobile robots in a 2-dimensional Euclidean space in which each robot repeatedly executes a \"Look-Compute-Move\" cycle, to observe the positions of all the robots, to compute a route to the next position using an algorithm, and then to trace the route, where the algorithm is common to all robots. The robots are said to be fully synchronous if their Look-Compute-Move cycles are completely synchronized, and the ith Look, Compute, and Move of all robots start and end simultaneously. They are said to be asynchronous if no assumptions are made on their synchrony. The robots are said to be oblivious if they have no memory to memorize the execution history and hence behave based only on the robots' positions observed during the immediately preceding Look. We show that the set of geometric patterns formable by oblivious asynchronous robots is exactly the set of those formable by nonoblivious fully synchronous robots, except for a point of multiplicity 2, i.e., gathering for two robots. In short, contrary to our intuition, synchrony and memory do not help in pattern formation, except for gathering. Specifically, we propose an algorithm for oblivious asynchronous robots that, given a geometric pattern as input, forms it, as long as it is formable by nonoblivious fully synchronous robots except for a point of multiplicity 2.", "paper_title": "PATTERN FORMATION BY OBLIVIOUS ASYNCHRONOUS MOBILE ROBOTS", "paper_id": "WOS:000357414100006"}