{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "negative_results"}, {"score": 0.004550669123303854, "phrase": "growing_competition"}, {"score": 0.004085579055228594, "phrase": "hypothesized_problems"}, {"score": 0.0038810583785936505, "phrase": "positive-outcome_bias"}, {"score": 0.0036678472439508484, "phrase": "scientific_literature"}, {"score": 0.0035382855372646164, "phrase": "high-risk_projects"}, {"score": 0.002895620643297197, "phrase": "positive_support"}, {"score": 0.0028221322455573624, "phrase": "overall_frequency"}, {"score": 0.002793260314529583, "phrase": "positive_supports"}, {"score": 0.0026806884201358515, "phrase": "significant_differences"}, {"score": 0.0023331349077974697, "phrase": "asian"}, {"score": 0.0022740427181174114, "phrase": "japan"}, {"score": 0.0022161977084763757, "phrase": "european"}, {"score": 0.0021377414429251647, "phrase": "united_kingdom"}, {"score": 0.0021049977753042253, "phrase": "methodological_artefacts"}], "paper_keywords": ["Bias", " Misconduct", " Research evaluation", " Publication", " Publish or perish", " Competition"], "paper_abstract": "Concerns that the growing competition for funding and citations might distort science are frequently discussed, but have not been verified directly. Of the hypothesized problems, perhaps the most worrying is a worsening of positive-outcome bias. A system that disfavours negative results not only distorts the scientific literature directly, but might also discourage high-risk projects and pressure scientists to fabricate and falsify their data. This study analysed over 4,600 papers published in all disciplines between 1990 and 2007, measuring the frequency of papers that, having declared to have \"tested\" a hypothesis, reported a positive support for it. The overall frequency of positive supports has grown by over 22% between 1990 and 2007, with significant differences between disciplines and countries. The increase was stronger in the social and some biomedical disciplines. The United States had published, over the years, significantly fewer positive results than Asian countries (and particularly Japan) but more than European countries (and in particular the United Kingdom). Methodological artefacts cannot explain away these patterns, which support the hypotheses that research is becoming less pioneering and/or that the objectivity with which results are produced and published is decreasing.", "paper_title": "Negative results are disappearing from most disciplines and countries", "paper_id": "WOS:000300325800009"}