{"auto_keywords": [{"score": 0.04772996706791511, "phrase": "mcl"}, {"score": 0.018883435434443832, "phrase": "robot's_motion"}, {"score": 0.0106123744649551, "phrase": "monte_carlo_localization"}, {"score": 0.010318211917154116, "phrase": "robot's_location"}, {"score": 0.004409468620826287, "phrase": "partially_observable_markov_decision_process"}, {"score": 0.004354387464909719, "phrase": "robot's_state"}, {"score": 0.004259638825837131, "phrase": "static_map"}, {"score": 0.0035384237846107793, "phrase": "motion_model"}, {"score": 0.0034722729543863267, "phrase": "robot's_actual_motion"}, {"score": 0.0034288585177917066, "phrase": "reported_motion"}, {"score": 0.0033018343529712876, "phrase": "exhaustive_tests"}, {"score": 0.003260543967539824, "phrase": "single_model"}, {"score": 0.0030713353414700295, "phrase": "generalized_model"}, {"score": 0.0030044208366869205, "phrase": "possible_situations"}, {"score": 0.0029482236540308952, "phrase": "localization_algorithm"}, {"score": 0.0028479036246421875, "phrase": "predicted_motions"}, {"score": 0.002708029282786675, "phrase": "correct_location"}, {"score": 0.0025831266474492308, "phrase": "revised_motion_parameters"}, {"score": 0.002471740959383183, "phrase": "different_locations"}, {"score": 0.0024026792279374784, "phrase": "surface_changes"}, {"score": 0.002320879380255764, "phrase": "dynamic_technique"}, {"score": 0.0022702776603245036, "phrase": "minimal_work"}, {"score": 0.002138410677608455, "phrase": "changing_conditions"}, {"score": 0.0021049977753042253, "phrase": "even_more_complex_situations"}], "paper_keywords": [""], "paper_abstract": "Localization is the problem of determining a robot's location in an environment. Monte Carlo Localization (MCL) is a method of solving this problem by using a partially observable Markov decision process to find the robot's state based on its sensor readings, given a static map of the environment. MCL requires a model of each sensor in order to work properly. One of the most important sensors involved is the estimation of the robot's motion, based on its encoders that report what motion the robot has performed. Since these encoders are inaccurate, MCL involves using other sensors to correct the robot's location. Usually, a motion model is created that predicts the robot's actual motion, given a reported motion. The parameters of this model must be determined manually using exhaustive tests, but a single model cannot optimally represent a robot's motion in all cases. Thus, it is necessary to have a generalized model with enough error to compensate for all possible situations. However, if the localization algorithm is working properly, the result is a series of predicted motions, together with the corrections determined by the algorithm that alter the motions to the correct location. We demonstrate a technique to process these motions and corrections and dynamically determine revised motion parameters that more accurately reflect the robot's motion. We also link these parameters to different locations so that area dependent conditions, such as surface changes, can be taken into account. Finally, the dynamic technique allows various different motion models to be used with minimal work. By using the fact that MCL is working, we have improved the algorithm to adapt to changing conditions so as to handle even more complex situations.", "paper_title": "Dynamic motion models in Monte Carlo Localization", "paper_id": "WOS:000248283800004"}