{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "semantic_information"}, {"score": 0.045850447235973486, "phrase": "graphical_elements"}, {"score": 0.026822469433683115, "phrase": "information_scent"}, {"score": 0.004744437370338926, "phrase": "comprehension-based_linked_model"}, {"score": 0.004555781299332848, "phrase": "cognitive_model"}, {"score": 0.004263046902817659, "phrase": "information_scent_value"}, {"score": 0.0040334640350288, "phrase": "two-phase_processing_cycle"}, {"score": 0.003441352119167824, "phrase": "available_actions"}, {"score": 0.0034034331737042363, "phrase": "focused_region"}, {"score": 0.003353521531649663, "phrase": "particular_action"}, {"score": 0.003069006373093756, "phrase": "semantic_meaning"}, {"score": 0.0029576827451501956, "phrase": "hyperlink_labels"}, {"score": 0.002914288956035066, "phrase": "first_part"}, {"score": 0.0028293966058473476, "phrase": "theoretical_explanation"}, {"score": 0.0026768142335374156, "phrase": "second_part"}, {"score": 0.002598821419664902, "phrase": "mock-up_website"}, {"score": 0.0024136132575631273, "phrase": "simulation_results"}, {"score": 0.002343271162668978, "phrase": "highly_relevant_pictures"}, {"score": 0.0022834017104377525, "phrase": "task-relevant_hyperlinks"}, {"score": 0.0021682027434117095, "phrase": "colides"}, {"score": 0.0021049977753042253, "phrase": "lowly_relevant_pictures"}], "paper_keywords": ["information scent", " graphics", " pictures", " semantics", " web-navigation", " modelling"], "paper_abstract": "Comprehension-based linked model of deliberate search (CoLiDeS) + Pic is a cognitive model of web-navigation that takes into account the semantic information from graphical elements present on a web-page to compute the information scent value of the hyperlinks. The model is based on CoLiDeS, which has a two-phase processing cycle: (a) attention phase, which first parses the web-page and focuses attention on the region of the web-page that is semantically most similar to the goal, and (b) action-selection phase, which evaluates the available actions in the focused region and selects a particular action such as clicking a link. The graphical elements are important both for attracting attention to a region of the web-page and for communicating semantic meaning that may alter or enhance the meaning of the hyperlink labels. In the first part of this article, we give a theoretical explanation of the CoLiDeS + Pic model and describe the methodology followed to implement it. In the second part, we run a simulation on a mock-up website and evaluate the effect of pictures on information scent of hyperlinks by means of the CoLiDeS + Pic model on basis of the simulation results. It was found that CoLiDeS + Pic with highly relevant pictures increases the values of information scent of task-relevant hyperlinks, and therefore it increases the probability of selecting those hyperlinks compared to CoLiDeS (without pictures) or CoLiDeS + Pic with lowly relevant pictures. These results confirm the importance of including information from pictures into the modelling of web-navigation.", "paper_title": "CoLiDeS plus Pic: a cognitive model of web-navigation based on semantic information from pictures", "paper_id": "WOS:000297204400003"}