{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "anaesthesia_record"}, {"score": 0.01012113834117584, "phrase": "full-scale_anaesthesia_simulator"}, {"score": 0.0096089039682355, "phrase": "vocal_interface"}, {"score": 0.009522478012947883, "phrase": "traditional_touch-screen"}, {"score": 0.009394280612219731, "phrase": "electronic_anaesthesia_record"}, {"score": 0.007647130998070048, "phrase": "speech_input_interface"}, {"score": 0.004793143777319357, "phrase": "crisis_scenarios"}, {"score": 0.004674952036988355, "phrase": "prototype_speech-input_interface"}, {"score": 0.0046432244185370605, "phrase": "anaesthesia_patient_record"}, {"score": 0.004570024332569239, "phrase": "six_doctor-nurse_anaesthetist_teams"}, {"score": 0.004406994912939125, "phrase": "potential_advantages"}, {"score": 0.004240116703465252, "phrase": "crisis_situations"}, {"score": 0.004144908086646161, "phrase": "realistic_work_environment"}, {"score": 0.0041167628526081424, "phrase": "speech_input_strategies"}, {"score": 0.003969838436551289, "phrase": "free_text_modes"}, {"score": 0.0038194503801108324, "phrase": "speech_input_modality"}, {"score": 0.0037848978618663684, "phrase": "six_anaesthesia_teams"}, {"score": 0.0034482025128821548, "phrase": "audio-video_recordings"}, {"score": 0.003386072841722016, "phrase": "additional_subjective_data"}, {"score": 0.002934237411711622, "phrase": "steadily_increasing_mental_workload"}, {"score": 0.002660879816208789, "phrase": "tested_speech_input_strategies"}, {"score": 0.0026188490199688013, "phrase": "ambient_noise"}, {"score": 0.002536763634539386, "phrase": "speech_recognition_rates"}, {"score": 0.0024797072773840704, "phrase": "shorter_time"}, {"score": 0.002429451930463481, "phrase": "actual_registration"}, {"score": 0.0023479408542211875, "phrase": "greater_accuracy"}, {"score": 0.002305589818994465, "phrase": "mental_workload"}, {"score": 0.002238388884010998, "phrase": "constrained_situations"}, {"score": 0.002208035721125305, "phrase": "current_speech_recognition_technology"}, {"score": 0.0021830553825770097, "phrase": "user_training"}, {"score": 0.0021731423856364003, "phrase": "user_dedication"}, {"score": 0.0021583570446663818, "phrase": "speech_interface"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["anaesthesia record", " quality", " vocal interface", " speech recognition", " workload", " secondary task"], "paper_abstract": "Introduction: This article describes the evaluation of a prototype speech-input interface to an anaesthesia patient record, conducted in a full-scale anaesthesia simulator involving six doctor-nurse anaesthetist teams. Objective: The aims of the experiment were, first, to assess the potential advantages and disadvantages of a vocal interface compared to the traditional touch-screen and keyboard interface to an electronic anaesthesia record during crisis situations; second, to assess the usability in a realistic work environment of some speech input strategies (hands-free vocal interface activated by a keyword; combination of command and free text modes); finally, to quantify some of the gains that could be provided by the speech input modality. Methods: Six anaesthesia teams composed of one doctor and one nurse were each confronted with two crisis scenarios in a full-scale anaesthesia simulator. Each team would fill in the anaesthesia record, in one session using only the traditional touch-screen and keyboard interface while in the other session they could also use the speech input interface. Audio-video recordings of the sessions were subsequently analysed and additional subjective data were gathered from a questionnaire. Analysis of data was made by a method inspired by queuing theory in order to compare the delays associated to the two interfaces and to quantify the workload inherent to the memorisation of items to be entered into the anaesthesia record. Results: The experiment showed on the one hand that the traditional touch-screen and keyboard interface imposes a steadily increasing mental workload in terms of items to keep in memory until there is time to update the anaesthesia record, and on the other hand that the speech input interface will allow anaesthetists to enter medications and observations almost simultaneously when they are given or made. The tested speech input strategies were successful, even with the ambient noise. Speaking to the system while working appeared feasible, although improvements in speech recognition rates are needed. Conclusion: A vocal interface leads to shorter time between the events to be registered and the actual registration in the electronic anaesthesia record; therefore, this type of interface would likely lead to greater accuracy of items recorded and a reduction of mental workload associated with memorisation of events to be registered, especially during time constrained situations. At the same time, current speech recognition technology and speech interfaces require user training and user dedication if a speech interface is to be used successfully. (C) 2007 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Speech recognition for the anaesthesia record during crisis scenarios", "paper_id": "WOS:000257000800003"}