{"auto_keywords": [{"score": 0.04692598988147936, "phrase": "virtual_reality"}, {"score": 0.010612387000973441, "phrase": "subjective_realism"}, {"score": 0.009504657017054581, "phrase": "objective_realism"}, {"score": 0.00708590201661776, "phrase": "control_condition"}, {"score": 0.004683371330233808, "phrase": "neuroanatomical_correlates"}, {"score": 0.00454390917314786, "phrase": "important_concept"}, {"score": 0.004408581547122343, "phrase": "realism_factors"}, {"score": 0.004223708778943785, "phrase": "numerous_technological_characteristics"}, {"score": 0.004191894957742565, "phrase": "pictorial_quality"}, {"score": 0.003460936765246947, "phrase": "experimental_manipulation"}, {"score": 0.003417565253539315, "phrase": "experimental_condition"}, {"score": 0.0033156708990372047, "phrase": "real_time"}, {"score": 0.0032906739990650087, "phrase": "\"real\"_room"}, {"score": 0.0032658649336454923, "phrase": "\"real\"_mouse"}, {"score": 0.003113013222438078, "phrase": "nearby_room"}, {"score": 0.0030431198971423937, "phrase": "exact_same_virtual_environment"}, {"score": 0.003004968563441701, "phrase": "manipulation_check"}, {"score": 0.002628747284714371, "phrase": "simultaneous_functional_magnetic_resonance_imaging"}, {"score": 0.0025761937402886954, "phrase": "brain_areas"}, {"score": 0.0024993218789131437, "phrase": "five_participants"}, {"score": 0.0024308678177632657, "phrase": "experimental_immersion"}, {"score": 0.002388283252319309, "phrase": "control_immersion"}, {"score": 0.0023346234464901978, "phrase": "statistically_significant_difference"}, {"score": 0.00232286335198363, "phrase": "left_and_right_parahippocampus_areas"}, {"score": 0.002153391175758982, "phrase": "core_presence"}, {"score": 0.0021049977753042253, "phrase": "british_informatics_society_limited"}], "paper_keywords": ["Feeling of presence", " Virtual reality", " Subjective realism", " fMRI", " Parahippocampus"], "paper_abstract": "The feeling of presence has been shown to be an important concept in several clinical applications of virtual reality. Among the factors influencing presence, realism factors have been examined extensively from the angle of objective realism. Objective realism has been manipulated by altering numerous technological characteristics such as pictorial quality, texture and shading, or by adding more sensory information (i.e., smell, touch). Much less studied is the subjective (or perceived) realism, the focus of the two pilot studies reported in this article. In Study 1, subjective realism was manipulated in order to assess the impact on the feeling of presence. Method: Presence was measured in 31 adults after two immersions in virtual reality. Participants were immersed in a neutral/irrelevant virtual environment and subsequently subjected to the experimental manipulation. Participants in the experimental condition were falsely led to believe that they were immersed live in real time in a \"real\" room with a \"real\" mouse in a cage. In the control condition, participants believed they were immersed in a replica of the nearby room. All participants were actually immersed in the exact same virtual environment. Results: A manipulation check revealed that 80% of the participants believed in the deception. A 2 Times by 2 Conditions repeated measure ANOVA revealed that leading people to believe they were seeing a real environment digitized live in virtual reality increased their feeling of presence compared to the control condition. In Study 2, the same experimental design was used but with simultaneous functional magnetic resonance imaging (fMRI) in order to assess brain areas potentially related to the feeling of presence. fMRI data from five participants were subjected to a within subject fixed effect analysis to verify differences between the experimental immersion (higher presence) and the control immersion (lower presence). Results revealed a statistically significant difference in left and right parahippocampus areas. Conclusion: Results are discussed according to layers of presence and consciousness and the meaning given to experiences occurring in virtual reality. Some suggestions are formulated to target core presence and extended presence. (C) 2012 British Informatics Society Limited. All rights reserved.", "paper_title": "Manipulating subjective realism and its impact on presence: Preliminary results on feasibility and neuroanatomical correlates", "paper_id": "WOS:000309847600008"}