{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud_computing"}, {"score": 0.00462919213721188, "phrase": "major_advances"}, {"score": 0.004174824849669107, "phrase": "clear_understanding"}, {"score": 0.003479692058963528, "phrase": "equally_urgent_need"}, {"score": 0.0034118234596993836, "phrase": "business-related_issues"}, {"score": 0.00307657476125683, "phrase": "cloud_computing_industry"}, {"score": 0.002914288956035066, "phrase": "different_stakeholders"}, {"score": 0.002538687900036229, "phrase": "different_areas"}, {"score": 0.0021896891011033105, "phrase": "key_issues"}, {"score": 0.0021682027434117095, "phrase": "governmental_agencies"}, {"score": 0.0021049977753042253, "phrase": "unique_nature"}], "paper_keywords": ["Cloud computing", " Virtualization", " Software as a service", " Platform as a service", " Infrastructure as a service", " On-demand computing", " Cloud computing regulation"], "paper_abstract": "The evolution of cloud computing over the past few years is potentially one of the major advances in the history of computing. However, if cloud computing is to achieve its potential, there needs to be a clear understanding of the various issues involved, both from the perspectives of the providers and the consumers of the technology. While a lot of research is currently taking place in the technology itself, there is an equally urgent need for understanding the business-related issues surrounding cloud computing. In this article, we identify the strengths, weaknesses, opportunities and threats for the cloud computing industry. We then identify the various issues that will affect the different stakeholders of cloud computing. We also issue a set of recommendations for the practitioners who will provide and manage this technology. For IS researchers, we outline the different areas of research that need attention so that we are in a position to advice the industry in the years to come. Finally, we outline some of the key issues facing governmental agencies who, due to the unique nature of the technology, will have to become intimately involved in the regulation of cloud computing. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Cloud computing - The business perspective", "paper_id": "WOS:000288519200017"}