{"auto_keywords": [{"score": 0.04007428702805096, "phrase": "supnet"}, {"score": 0.004173603566828364, "phrase": "network_topology"}, {"score": 0.003474694300991964, "phrase": "dynamical_behavior"}, {"score": 0.0034437574674180365, "phrase": "already-existing_networks"}, {"score": 0.0033376244286643176, "phrase": "local_stochastic_dynamics"}, {"score": 0.003278447235176858, "phrase": "engineered_global_system"}, {"score": 0.0032347516831068715, "phrase": "predictable_structures"}, {"score": 0.003177392642813126, "phrase": "resulting_protocol"}, {"score": 0.0030248298759040695, "phrase": "content_search"}, {"score": 0.002984504445973107, "phrase": "network_management_sub-protocol"}, {"score": 0.0028284924551705516, "phrase": "heterogeneous_distribution"}, {"score": 0.0028032928749970026, "phrase": "network_resources"}, {"score": 0.0026095920086044145, "phrase": "search_sub-protocol"}, {"score": 0.0024842242921857705, "phrase": "single_copy"}, {"score": 0.002322895056238477, "phrase": "provably_sub-linear"}, {"score": 0.002291905937251069, "phrase": "network_size"}, {"score": 0.0022013916728990564, "phrase": "popular_items"}], "paper_keywords": ["Unstructured P2P", " Scalability", " Percolation search", " Complex network", " Search traffic", " Power-law", " Self-organized", " Compensation algorithm"], "paper_abstract": "Despite many improvements on original unstructured P2P networks, these systems still suffer from several problems, the most important of which are, (a) lack of guarantees on the integrity of the network topology in the face of churns, (b) excessive traffic cost and (c) poor quality of search results. This paper introduces an end-to-end scalable unstructured P2P networking solution called SUPNET to address many of these issues. SUPNET is based on our pragmatic, design oriented approach to engineering complex networks. Rather than modeling dynamical behavior in already-existing networks, we actively design and implement local stochastic dynamics so that an engineered global system, with predictable structures emerges. The resulting protocol, SUPNET, consists of two sub-protocols for network management and content search. The network management sub-protocol is scalable and highly robust and is capable of utilizing the heterogeneous distribution of network resources. Its high stability is the result of implementation of a novel distributed feedback mechanism. The search sub-protocol is capable of locating every item, even if a single copy of that item exists in the network, while producing a traffic that scales provably sub-linear with the network size. It also contains mechanisms for very efficient location of popular items as well as distributed parameter tuning algorithms. These, along with inherently self-organized and de-centralized operation, relative ease of implementation and solid analytical foundation, make SUPNET a compelling solution for unstructured P2P networking.", "paper_title": "SUPNET: An end-to-end solution to scalable unstructured P2P networking", "paper_id": "WOS:000207728000004"}