{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "bandwidth_allocation"}, {"score": 0.004419538941706716, "phrase": "efficient_and_accurate_approximation_method"}, {"score": 0.003982617095636925, "phrase": "point-to-point_multiprotocol_label_switching_connection"}, {"score": 0.0038624981944755813, "phrase": "end-to-end_delay_d"}, {"score": 0.003417054482155433, "phrase": "infinite_capacity_queues"}, {"score": 0.0033548062793973144, "phrase": "arrival_process"}, {"score": 0.002985988377995789, "phrase": "two-stage_markov-modulated_poisson_process"}, {"score": 0.002931569771634119, "phrase": "service_times"}, {"score": 0.002825681384008326, "phrase": "proposed_method"}, {"score": 0.0023652572260178637, "phrase": "extensive_comparisons"}, {"score": 0.002224510044064184, "phrase": "average_relative_error"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "We describe an efficient and accurate approximation method for calculating the bandwidth that should be allocated on each link along the path of a point-to-point Multiprotocol Label Switching connection, so that the end-to-end delay D is less than or equal to a given value T with a probability gamma, that is, P(D <= T)=gamma. We model a connection by a tandem queuing network of infinite capacity queues. The arrival process of packets to the connection is assumed to be bursty and correlated and it is depicted by a two-stage Markov-Modulated Poisson Process. The service times are exponentially distributed. The proposed method uses only the first queue of the tandem queuing network to construct an upper and lower bound of the required bandwidth so that P(D <= T) =gamma. Subsequently, we estimate the required bandwidth using a simple interpolation function between the two bounds. Extensive comparisons with simulation showed that the results obtained have an average relative error of 1.25%. Copyright (C) 2011 John Wiley & Sons, Ltd.", "paper_title": "Bandwidth allocation under end-to-end percentile delay bounds", "paper_id": "WOS:000298086300005"}