{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ontology_structure"}, {"score": 0.004614660477535166, "phrase": "thesauri"}, {"score": 0.004528301408585875, "phrase": "controlled_vocabularies"}, {"score": 0.004218602458288531, "phrase": "life_sciences"}, {"score": 0.003378385493203297, "phrase": "different_perceptions"}, {"score": 0.0030446120560494155, "phrase": "structural_differences"}, {"score": 0.0028766308484840927, "phrase": "owl."}, {"score": 0.0027567336518542858, "phrase": "conceptual_comparison"}, {"score": 0.002580061425699194, "phrase": "specific_thesaurus"}, {"score": 0.0025436978068459565, "phrase": "specific_ontology"}, {"score": 0.0023139986108451967, "phrase": "superficially_similar_structures"}, {"score": 0.0022385926290967263, "phrase": "good_thesaurus"}, {"score": 0.0021049977753042253, "phrase": "significant_structural_and_other_content_changes"}], "paper_keywords": ["classification", " knowledge engineering"], "paper_abstract": "Thesauri and other types of controlled vocabularies are increasingly re-engineered into ontologies described using the Web Ontology Language (OWL), particularly in the life sciences. This has led to the perception by some that thesauri are ontologies once they are described by using the syntax of OWL while others have emphasized the need to re-engineer a vocabulary to use it as ontology. This confusion is rooted in different perceptions of what ontologies are and how they differ from other types of vocabularies. In this article, we rigorously examine the structural differences and similarities between thesauri and meaning-defining ontologies described in OWL. Specifically, we conduct (a) a conceptual comparison of thesauri and ontologies, and (b) a comparison of a specific thesaurus and a specific ontology in the same subject field. Our results show that thesauri and ontologies need to be treated as 2 orthogonal kinds of models with superficially similar structures. An ontology is not a good thesaurus, nor is a thesaurus a good ontology. A thesaurus requires significant structural and other content changes to become an ontology, and vice versa.", "paper_title": "Thesaurus and ontology structure: Formal and pragmatic differences and similarities", "paper_id": "WOS:000355858200004"}