{"auto_keywords": [{"score": 0.046739995905907314, "phrase": "hop_counts"}, {"score": 0.015719716506582538, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.014741383864703205, "phrase": "distance_estimates"}, {"score": 0.011271723921650354, "phrase": "positive_effect"}, {"score": 0.004711843410316589, "phrase": "hop_count_based_distance_estimation"}, {"score": 0.004661116930794176, "phrase": "important_element"}, {"score": 0.004320932773749168, "phrase": "low_density"}, {"score": 0.004137761530535196, "phrase": "hop_count"}, {"score": 0.004122850924351265, "phrase": "based_distance_estimation"}, {"score": 0.0038218004095195183, "phrase": "mobile_ad_hoc_network"}, {"score": 0.003794297119656863, "phrase": "different_movement_patterns"}, {"score": 0.0035942114996235803, "phrase": "estimated_distances"}, {"score": 0.0032957163929772716, "phrase": "asynchronous_computation"}, {"score": 0.003077038060542514, "phrase": "negative_one"}, {"score": 0.0030548779592763824, "phrase": "increasing_mobility"}, {"score": 0.0027310567737368033, "phrase": "investigated_mobility_patterns"}, {"score": 0.002522240133079871, "phrase": "induced_error"}, {"score": 0.0023718560142554634, "phrase": "modified_algorithm"}, {"score": 0.002151183757599893, "phrase": "decentralized_way"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MANET", " Mobility", " Hop count", " Localization", " Distance estimation"], "paper_abstract": "Hop Count based distance estimation is an important element for localization of devices in mobile ad hoc networks. Deriving distance estimates from hop counts is prone to error, especially in networks with low density. This paper shows that mobility can affect the accuracy of hop count based distance estimation. Two types of error are defined to describe and analyze the source of underestimation and overestimation of distances in a mobile ad hoc network. Different movement patterns are examined to get an insight of their impact on the hop counts and the estimated distances accordingly. Our experiments and analysis indicate that mobility can have a positive effect on the accuracy of distance estimates which results from a combination of asynchronous computation of hop counts and mobility of the nodes. At the same time, this positive effect can turn into a negative one with increasing mobility. Therefore, we determine characteristics, such as direction, speed, and similarity in movements of neighbors which are responsible for the disparity in the influences of the investigated mobility patterns. A study of these properties is presented and their individual effect is explained in detail. The difference between mobility and density induced error is discussed and their individual adverse effect is weighted against each other. In addition, we introduce a modified algorithm to determine hop counts which is designed to mitigate the effect of mobility. Two indicators are presented to identify and characterize the mobility of devices in a decentralized way. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Hop count based distance estimation in mobile ad hoc networks - Challenges and consequences", "paper_id": "WOS:000332813900005"}