{"auto_keywords": [{"score": 0.03073592655044515, "phrase": "threshold_odds"}, {"score": 0.029664970002437303, "phrase": "scale_scores"}, {"score": 0.00481495049065317, "phrase": "decisional_viewpoint"}, {"score": 0.004332559296185432, "phrase": "decision-making_standpoint"}, {"score": 0.003941141575848601, "phrase": "rational_agent"}, {"score": 0.003800156761779008, "phrase": "rational_agent's_preferences"}, {"score": 0.0037315599283579593, "phrase": "scale_score_assignments"}, {"score": 0.0029985954225814895, "phrase": "simple_expected_utility_condition"}, {"score": 0.00296597499768551, "phrase": "adjacent_alternatives"}, {"score": 0.0027674397462322435, "phrase": "simple_distance_model"}, {"score": 0.0026878636586288363, "phrase": "relative_concern"}, {"score": 0.0026683288015968243, "phrase": "decisional_consequences"}, {"score": 0.0021049977753042253, "phrase": "human_decision-making"}], "paper_keywords": ["measurement", " expected utility", " scale construction", " granularity", " decision", " uncertainty"], "paper_abstract": "Many quantitative scales are constructed using cutoffs on a continuum with scores assigned to the cutoffs. This paper develops a framework for using or constructing such scales from a decision-making standpoint. It addresses questions such as: How many distinct thresholds or cutoffs on a scale (i.e., what levels of granularity) are useful for a rational agent? Where should these thresholds be placed given a rational agent's preferences and risk-orientation? Do scale score assignments have any bearing on decision-making and if so, how should scores be assigned? Given two possible states of nature {A, similar to A}, an ordered collection of alternatives {R-0, R-1,..., R-K} from which one is to be selected depending on the probability that A is the case, a simple expected utility condition stipulates when adjacent alternatives are distinguishable and determines the threshold odds separating them. Threshold odds and utilities are mapped onto scale scores via a simple distance model. The placement of the thresholds reflects relative concern over decisional consequences given A versus consequences given similar to A. Likewise, it is shown that scale scores reflect risk-aversion or risk-seeking not only with respect to A versus similar to A but also with respect to the rank of the R-j. Connections are drawn between this framework and rank-dependent expected utility (RDEU) theory. Implications are adumbrated for both machine and human decision-making.", "paper_title": "Scale construction from a decisional viewpoint", "paper_id": "WOS:000242148900008"}