{"auto_keywords": [{"score": 0.04731443162421141, "phrase": "free_riders"}, {"score": 0.00481495049065317, "phrase": "peer-to-peer_networks"}, {"score": 0.004586531354697466, "phrase": "considerable_proportion"}, {"score": 0.003921393143378986, "phrase": "utility-based_auction_cooperation_incentive_mechanism"}, {"score": 0.003675120438902734, "phrase": "destination_peer"}, {"score": 0.0036159990127332315, "phrase": "source_peer_first_demands_peers"}, {"score": 0.00342568771304873, "phrase": "maximum_utility"}, {"score": 0.0025167026017217926, "phrase": "experiment_results"}, {"score": 0.0024628046987344846, "phrase": "incentive_mechanism"}, {"score": 0.00235843888868088, "phrase": "different_kinds"}, {"score": 0.0021394674440767124, "phrase": "whole_performance"}], "paper_keywords": ["P2P", " free riders", " BitTorrent", " auction", " incentive mechanism"], "paper_abstract": "In P2P network, there are a considerable proportion of free riders, which contribute nothing or little to the P2P system but obtain resources from the system. In order to address this problem, we present a utility-based auction cooperation incentive mechanism in the P2P network. Our approach is that before communicating with destination peer, the source peer first demands peers to auction their utilities, and then select the maximum utility as its destination peer, and gives some benefit to it, at the same time, gives some punishment to the liars. By using this mechanism, the more the peers contribute to the system, the more utility the peers can obtain, and therefore, the more benefits the peers can gain from the system. The experiment results show that the incentive mechanism assures the justice of gaining benefits for different kinds of peers in the system, and hence, controls the free riders effectively, and improves the whole performance of the P2P network.", "paper_title": "A utility-based auction cooperation incentive mechanism in peer-to-peer networks", "paper_id": "WOS:000240081000002"}