{"auto_keywords": [{"score": 0.0406224671469103, "phrase": "external_quality"}, {"score": 0.017664506350232038, "phrase": "tdd_skills'_set"}, {"score": 0.00481495049065317, "phrase": "test-driven_development_skills"}, {"score": 0.0046472613070408795, "phrase": "empirical_studies"}, {"score": 0.004621984064678252, "phrase": "test-driven_development"}, {"score": 0.00441257945244739, "phrase": "traditional_approach"}, {"score": 0.004270477662507625, "phrase": "necessary_skills"}, {"score": 0.0039348451962364, "phrase": "tdd."}, {"score": 0.0036753171449945654, "phrase": "different_clusters"}, {"score": 0.0034048439594299715, "phrase": "priori_experience"}, {"score": 0.003304097742490624, "phrase": "tdd_conformance"}, {"score": 0.0032326991175307424, "phrase": "k-means_clustering"}, {"score": 0.00318886519556175, "phrase": "anova"}, {"score": 0.0030692309090066166, "phrase": "post-hoc_pairwise_analysis"}, {"score": 0.002994701080666466, "phrase": "statistically_significant_difference"}, {"score": 0.0029460197288680864, "phrase": "external_software_quality"}, {"score": 0.002684694915895104, "phrase": "effect_sizes"}, {"score": 0.002380534385718454, "phrase": "software_developers"}, {"score": 0.0022232941867716223, "phrase": "statistical_power"}, {"score": 0.0021811543597119116, "phrase": "practical_insights"}, {"score": 0.002169261457850553, "phrase": "future_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Test-driven development", " Process conformance", " Software quality", " Developers' productivity"], "paper_abstract": "Context: The majority of the empirical studies on Test-driven development (TDD) are concerned with verifying or refuting the effectiveness of the technique over a traditional approach, and they tend to neglect whether the subjects possess the necessary skills to apply TDD, though they argue such skills are necessary. Objective: We evaluate a set of minimal, a priori and in process skills necessary to apply TDD. We determine whether variations in external quality (i.e., number of defects) and productivity (i.e., number of features implemented) can be associated with different clusters of the TDD skills' set. Method: We executed a quasi-experiment involving 30 practitioners from industry. We first grouped the participants according to their TDD skills' set (consisting of a priori experience on programming and testing as well as in-process TDD conformance) into three levels (Low-Medium-High) using k-means clustering. We then applied ANOVA to compare the clusters in terms of external quality and productivity, and conducted post-hoc pairwise analysis. Results: We did not observe a statistically significant difference between the clusters either for external software quality (F(2, 27 = 1.44, p = .260), or productivity (F(2, 27) = 3.02, p = .065). However, the analysis of the effect sizes and their confidence intervals shows that the TDD skills' set is a factor that could account for up to 28% of the external quality, and 38% for productivity. Conclusion: We have reason to conclude that focusing on the improvement of TDD skills' set investigated in this study could benefit software developers in improving their baseline productivity and the external quality of the code they produce. However, replications are needed to overcome the issues related with the statistical power of this study. We suggest practical insights for future work to investigate the phenomenon further. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Towards an operationalization of test-driven development skills: An industrial empirical study", "paper_id": "WOS:000363076200006"}