{"auto_keywords": [{"score": 0.04941714403605282, "phrase": "gtr_model"}, {"score": 0.01108042710953359, "phrase": "negative_eigenvalues"}, {"score": 0.00481495049065317, "phrase": "instantaneous_substitution_rate_matrices"}, {"score": 0.00428733103049275, "phrase": "mathematical_tractability"}, {"score": 0.004247696749118451, "phrase": "biological_reality"}, {"score": 0.004054931951058077, "phrase": "evolutionary_distances"}, {"score": 0.004017437417375057, "phrase": "instantaneous_rate_matrices"}, {"score": 0.0031113369425402287, "phrase": "mathematical_conditions"}, {"score": 0.002523828967909659, "phrase": "possible_re-formulation"}, {"score": 0.002431626477893495, "phrase": "non-linear_optimization_problem"}, {"score": 0.0023103100997344072, "phrase": "estimated_evolutionary_distances"}, {"score": 0.0022889103976458437, "phrase": "transition_probability_matrix"}, {"score": 0.0021049977753042253, "phrase": "numerical_example"}], "paper_keywords": [""], "paper_abstract": "Motivation: The general-time-reversible (GTR) model is one of the most popular models of nucleotide substitution because it constitutes a good trade-off between mathematical tractability and biological reality. However, when it is applied for inferring evolutionary distances and/or instantaneous rate matrices, the GTR model seems more prone to inapplicability than more restrictive time-reversible models. Although it has been previously noted that the causes for intractability are caused by the impossibility of computing the logarithm of a matrix characterised by negative eigenvalues, the issue has not been investigated further. Results: Here, we formally characterize the mathematical conditions, and discuss their biological interpretation, which lead to the inapplicability of the GTR model. We investigate the relations between, on one hand, the occurrence of negative eigenvalues and, on the other hand, both sequence length and sequence divergence. We then propose a possible re-formulation of previous procedures in terms of a non-linear optimization problem. We analytically investigate the effect of our approach on the estimated evolutionary distances and transition probability matrix. Finally, we provide an analysis on the goodness of the solution we propose. A numerical example is discussed.", "paper_title": "A non-linear optimization procedure to estimate distances and instantaneous substitution rate matrices under the GTR model", "paper_id": "WOS:000236111600011"}