{"auto_keywords": [{"score": 0.03827394525154412, "phrase": "signed_graphs"}, {"score": 0.035271938397409476, "phrase": "ranking_algorithms"}, {"score": 0.0230256462946627, "phrase": "signed_social_networks"}, {"score": 0.007158451759739222, "phrase": "sign_prediction_problem"}, {"score": 0.00481495049065317, "phrase": "link_prediction"}, {"score": 0.003977505904363489, "phrase": "edge_sign_prediction"}, {"score": 0.0034807976670686628, "phrase": "link_prediction_problem"}, {"score": 0.003114449258490062, "phrase": "community_detection_approach"}, {"score": 0.002992195343569767, "phrase": "community_detection"}, {"score": 0.0029394074636168435, "phrase": "active_area"}, {"score": 0.0028875481626754696, "phrase": "social_networks"}, {"score": 0.0027865506182608263, "phrase": "community_detection_algorithms"}, {"score": 0.0026534064006291853, "phrase": "common_properties"}, {"score": 0.0022806810823043757, "phrase": "slashdot"}, {"score": 0.0022504461784649036, "phrase": "wikipedia"}, {"score": 0.002123831297790248, "phrase": "previous_works"}], "paper_keywords": [""], "paper_abstract": "In signed social networks, relationships among nodes are of the types positive (friendship) and negative (hostility). One absorbing issue in signed social networks is predicting sign of edges among people who are members of these networks. Other than edge sign prediction, one can define importance of people or nodes in networks via ranking algorithms. There exist few ranking algorithms for signed graphs; also few studies have shown role of ranking in link prediction problem. Hence, we were motivated to investigate ranking algorithms availed for signed graphs and their effect on sign prediction problem. This paper makes the contribution of using community detection approach for ranking algorithms in signed graphs. Therefore, community detection which is another active area of research in social networks is also investigated in this paper. Community detection algorithms try to find groups of nodes in which they share common properties like similarity. We were able to devise three community-based ranking algorithms which are suitable for signed graphs, and also we evaluated these ranking algorithms via sign prediction problem. These ranking algorithms were tested on three large-scale datasets: Epinions, Slashdot, and Wikipedia. We indicated that, in some cases, these ranking algorithms outperform previous works because their prediction accuracies are better.", "paper_title": "A Community-Based Approach for Link Prediction in Signed Social Networks", "paper_id": "WOS:000357219500001"}