{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "molecular_basis"}, {"score": 0.015615208559724942, "phrase": "enzyme_stability"}, {"score": 0.009676831524408173, "phrase": "ethanol_molecules"}, {"score": 0.004718509350356246, "phrase": "molecular_dynamics_simulations"}, {"score": 0.004608422081389008, "phrase": "nonaqueous_enzymology"}, {"score": 0.004425616928975799, "phrase": "organic_solvents"}, {"score": 0.004193059395895776, "phrase": "nonaqueous_media"}, {"score": 0.004109023004472115, "phrase": "full_advantage"}, {"score": 0.004040275465056206, "phrase": "nonaqueous_solvents"}, {"score": 0.004013098289856805, "phrase": "enzyme_catalysis"}, {"score": 0.003738502710504415, "phrase": "mu_s-long_molecular_dynamics_simulations"}, {"score": 0.003541923233726252, "phrase": "considerably_different_stabilities"}, {"score": 0.003266201217790818, "phrase": "disulfide_bridge"}, {"score": 0.003136471009987959, "phrase": "former_enzyme"}, {"score": 0.0029915976131073825, "phrase": "higher_tendency"}, {"score": 0.0029118285733827406, "phrase": "van_der_waals_contacts"}, {"score": 0.0027961342030212353, "phrase": "intraprotein_hydrophobic_interactions"}, {"score": 0.002640038329840458, "phrase": "larger_conformational_changes"}, {"score": 0.0024926348205500715, "phrase": "hydrophobic_interactions"}, {"score": 0.002385479082527538, "phrase": "good_agreement"}, {"score": 0.0022370795358896784, "phrase": "molecular_determinants"}, {"score": 0.0021336600569395693, "phrase": "rational_development"}, {"score": 0.0021049977753042253, "phrase": "increased_stability"}], "paper_keywords": [""], "paper_abstract": "One of the drawbacks of nonaqueous enzymology is the fact that enzymes tend to be less stable in organic solvents than in water. There are, however, some enzymes that display very high stabilities in nonaqueous media. In order to take full advantage of the use of nonaqueous solvents in enzyme catalysis, it is essential to elucidate the molecular basis of enzyme stability in these media. Toward this end, we performed mu s-long molecular dynamics simulations using two homologous proteases, pseudolysin, and thermolysin, which are known to have considerably different stabilities in Solutions containing ethanol. The analysis of the simulations indicates that pseudolysin is more stable than thermolysin in ethanol/water mixtures and that the disulfide bridge between C30 and C58 is important for the stability of the former enzyme, which is consistent with previous experimental observations.(1,2) Our results indicate that thermolysin has a higher tendency to interact with ethanol molecules (especially through van der Waals contacts) than pseudolysin, which can lead to the disruption of intraprotein hydrophobic interactions and ultimately result in protein unfolding. In the absence of the C30-C58 disulfide bridge, pseudolysin undergoes larger conformational changes, becoming more open and more permeable to ethanol molecules which accumulate in its interior and form hydrophobic interactions with the enzyme, destroying its structure. Our observations are not only in good agreement with several previous experimental findings on the stability of the enzymes studied in ethanol/water mixtures but also give an insight on the molecular determinants of this stability. Our findings may, therefore, be useful in the rational development of enzymes with increased stability in these media.", "paper_title": "Analyzing the Molecular Basis of Enzyme Stability in Ethanol/Water Mixtures Using Molecular Dynamics Simulations", "paper_id": "WOS:000300650400021"}