{"auto_keywords": [{"score": 0.020166331823184527, "phrase": "log_files"}, {"score": 0.01396789847604331, "phrase": "goldminer"}, {"score": 0.00579827182112843, "phrase": "radtf"}, {"score": 0.005365357280439577, "phrase": "normal_cases"}, {"score": 0.00481495049065317, "phrase": "image_search_behaviour"}, {"score": 0.004791142503589482, "phrase": "arrs_goldminer_search_engine"}, {"score": 0.0046738485441681485, "phrase": "information_access"}, {"score": 0.004635389192797836, "phrase": "frequent_activity"}, {"score": 0.004604848638941936, "phrase": "internet_search_engines"}, {"score": 0.004574508378688303, "phrase": "mobile_devices"}, {"score": 0.004559412951638996, "phrase": "medical_information_search"}, {"score": 0.004382089746728755, "phrase": "medical_image_search"}, {"score": 0.004303127794432684, "phrase": "different_characteristics"}, {"score": 0.004274766964161756, "phrase": "text_documents"}, {"score": 0.004253618550301311, "phrase": "web_search_log_files"}, {"score": 0.004190796368475121, "phrase": "user_behaviour"}, {"score": 0.004156295274516584, "phrase": "hospital_internal_systems"}, {"score": 0.003968251656888037, "phrase": "web_system"}, {"score": 0.0039290724293673815, "phrase": "biomedical_literature"}, {"score": 0.003826468043483428, "phrase": "search_behaviour"}, {"score": 0.003751270349089057, "phrase": "existing_systems"}, {"score": 0.003732702104052828, "phrase": "new_search_engines"}, {"score": 0.003701958290837042, "phrase": "arrs_goldminer_medical_image_search_engine"}, {"score": 0.0035343973247752565, "phrase": "query_terms"}, {"score": 0.0034706569037527774, "phrase": "radiology_terms"}, {"score": 0.003419358663401825, "phrase": "semantic_content"}, {"score": 0.0032971217978075666, "phrase": "radlex"}, {"score": 0.003253760219100462, "phrase": "radiology_reports"}, {"score": 0.0032322930543942714, "phrase": "structured_reporting"}, {"score": 0.003205657519784272, "phrase": "educational_material"}, {"score": 0.0031950646670695546, "phrase": "lanlotz"}, {"score": 0.0031478269662990957, "phrase": "standard_medical_vocabularies"}, {"score": 0.0031064226956732497, "phrase": "specific_terms"}, {"score": 0.0030352673814588206, "phrase": "best_option"}, {"score": 0.0029903851294825023, "phrase": "surprising_similarity"}, {"score": 0.0029755719070953374, "phrase": "usage_behaviour"}, {"score": 0.002912222095383313, "phrase": "average_number"}, {"score": 0.00277570763621149, "phrase": "almost_the_same_distribution"}, {"score": 0.0027301288585331127, "phrase": "anatomical_entity"}, {"score": 0.002694203841904863, "phrase": "radlex_axes"}, {"score": 0.0026455755027979533, "phrase": "longer_length"}, {"score": 0.0025551572989555207, "phrase": "strong_differences"}, {"score": 0.002451527111936163, "phrase": "intuitive_sense"}, {"score": 0.00240328454980006, "phrase": "clinical_work"}, {"score": 0.0023716501597131024, "phrase": "first_step"}, {"score": 0.0023598946586288333, "phrase": "general_similarity"}, {"score": 0.002282996490531526, "phrase": "standard_web_search_engines"}, {"score": 0.0022232820315478217, "phrase": "standard_web_search"}, {"score": 0.0021867545207237315, "phrase": "specialized_log_files"}, {"score": 0.002147265537489893, "phrase": "detailed_strategies"}, {"score": 0.0021260268415459805, "phrase": "right_content"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Medical image search", " Log file analysis", " User behaviour", " Information retrieval"], "paper_abstract": "Information search has changed the way we manage knowledge and the ubiquity of information access has made search a frequent activity, whether via Internet search engines or increasingly via mobile devices. Medical information search is in this respect no different and much research has been devoted to analyzing the way in which physicians aim to access information. Medical image search is a much smaller domain but has gained much attention as it has different characteristics than search for text documents. While web search log files have been analysed many times to better understand user behaviour, the log files of hospital internal systems for search in a PACS/RIS (Picture Archival and Communication System, Radiology Information System) have rarely been analysed. Such a comparison between a hospital PACS/RIS search and a web system for searching images of the biomedical literature is the goal of this paper. Objectives are to identify similarities and differences in search behaviour of the two systems, which could then be used to optimize existing systems and build new search engines. Log files of the ARRS GoldMiner medical image search engine (freely accessible on the Internet) containing 222,005 queries, and log files of Stanford's internal PACS/RIS search called radTF containing 18,068 queries were analysed. Each query was preprocessed and all query terms were mapped to the RadLex (Radiology Lexicon) terminology, a comprehensive lexicon of radiology terms created and maintained by the Radiological Society of North America, so the semantic content in the queries and the links between terms could be analysed, and synonyms for the same concept could be detected. RadLex was mainly created for the use in radiology reports, to aid structured reporting and the preparation of educational material (Lanlotz, 2006) [1]. In standard medical vocabularies such as MeSH (Medical Subject Headings) and UMLS (Unified Medical Language System) specific terms of radiology are often underrepresented, therefore RadLex was considered to be the best option for this task. The results show a surprising similarity between the usage behaviour in the two systems, but several subtle differences can also be noted. The average number of terms per query is 2.21 for GoldMiner and 2.07 for radTF, the used axes of RadLex (anatomy, pathology, findings,...) have almost the same distribution with clinical findings being the most frequent and the anatomical entity the second; also, combinations of RadLex axes are extremely similar between the two systems. Differences include a longer length of the sessions in radTF than in GoldMiner (3.4 and 1.9 queries per session on average). Several frequent search terms overlap but some strong differences exist in the details. In radTF the term \"normal\" is frequent, whereas in GoldMiner it is not. This makes intuitive sense, as in the literature normal cases are rarely described whereas in clinical work the comparison with normal cases is often a first step. The general similarity in many points is likely due to the fact that users of the two systems are influenced by their daily behaviour in using standard web search engines and follow this behaviour in their professional search. This means that many results and insights gained from standard web search can likely be transferred to more specialized search systems. Still, specialized log files can be used to find out more on reformulations and detailed strategies of users to find the right content. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Comparing image search behaviour in the ARRS GoldMiner search engine and a clinical PACS/RIS", "paper_id": "WOS:000359752100005"}