{"auto_keywords": [{"score": 0.04971414456915432, "phrase": "distributed_systems"}, {"score": 0.03988452292836005, "phrase": "unbounded_number"}, {"score": 0.02620255077503377, "phrase": "distributed_nodes"}, {"score": 0.00481495049065317, "phrase": "abstract_configurations"}, {"score": 0.004511799033574768, "phrase": "different_kinds"}, {"score": 0.004068907083697369, "phrase": "static-analysis-based_approach"}, {"score": 0.0031002400518251936, "phrase": "upper_bounds"}, {"score": 0.0030648097361278856, "phrase": "resource_analysis"}, {"score": 0.0029951555610569225, "phrase": "concrete_instances"}, {"score": 0.0027635643494432365, "phrase": "performance_indicators"}, {"score": 0.002255431275670053, "phrase": "input_data_sizes"}, {"score": 0.0021539955106204354, "phrase": "different_distributed_settings"}, {"score": 0.0021049977753042253, "phrase": "optimal_configuration"}], "paper_keywords": ["Static analysis", " Cost analysis", " Distributed systems"], "paper_abstract": "When reasoning about distributed systems, it is essential to have information about the different kinds of nodes that compose the system, how many instances of each kind exist, and how nodes communicate with other nodes. In this paper we present a static-analysis-based approach which is able to provide information about the questions above. In order to cope with an unbounded number of nodes and an unbounded number of calls among them, the analysis performs an abstraction of the system producing a graph whose nodes may represent (infinitely) many concrete nodes and arcs represent any number of (infinitely) many calls among nodes. The crux of our approach is that the abstraction is enriched with upper bounds inferred by resource analysis that limit the number of concrete instances that the nodes and arcs represent and their resource consumption. The information available in our quantified abstract configurations allows us to define performance indicators which measure the quality of the system. In particular, we present several indicators that assess the level of distribution in the system, the amount of communication among distributed nodes that it requires, and how balanced the load of the distributed nodes that compose the system is. Our performance indicators are given as functions on the input data sizes, and they can be used to automate the comparison of different distributed settings and guide towards finding the optimal configuration.", "paper_title": "Quantified abstract configurations of distributed systems", "paper_id": "WOS:000357661400004"}