{"auto_keywords": [{"score": 0.036935658713591404, "phrase": "contemporary_firms"}, {"score": 0.028026285296228158, "phrase": "knowledge_firm"}, {"score": 0.004745362527093198, "phrase": "knowledge_markets"}, {"score": 0.0046938292389998824, "phrase": "open_and_fragmented_nature"}, {"score": 0.004575740812937594, "phrase": "vibrant_debate"}, {"score": 0.004364224683011796, "phrase": "rich_repertoire"}, {"score": 0.004192872425727907, "phrase": "dialectical_spectrum"}, {"score": 0.0040873354289955605, "phrase": "appropriate_boundaries"}, {"score": 0.003704467870496114, "phrase": "resource-based_metaphorical_model"}, {"score": 0.003296713221268488, "phrase": "knowledge_firms"}, {"score": 0.003201967054773186, "phrase": "knowledge_product"}, {"score": 0.0031903162513050804, "phrase": "\"_heterogeneity"}, {"score": 0.0031099353574309606, "phrase": "market_demand"}, {"score": 0.0029444248503861167, "phrase": "boundary_conditions"}, {"score": 0.0027674397462322435, "phrase": "distinct_identity"}, {"score": 0.002272641094287882, "phrase": "inductive_approach"}, {"score": 0.002183230464873613, "phrase": "emical_markets"}], "paper_keywords": ["Identity crisis", " core", " disciplinary identity", " disciplinary legitimacy", " Information Systems", " Resource-based View", " MIS", " IS research", " relevance", " rigor", " metaphor", " firms", " markets"], "paper_abstract": "The open and fragmented nature of IS research has spawned a vibrant debate about sustainability of the IS discipline. Intellectually stimulating and rooted in a rich repertoire of approaches, the debate is frequently polarized along a dialectical spectrum, where advocates take positions on appropriate boundaries and audiences for the discipline. With the objective of reframing this debate, and the hope of moving it forward, this paper develops a resource-based metaphorical model for IS research. We establish that disciplines can be viewed as analogous to contemporary firms, and thus, resource-based concepts for the sustainability of contemporary firms can be extended to examining the sustainability of knowledge firms. Our central proposition is that differences in \"knowledge product\" heterogeneity, when positioned appropriately with the market demand, can affect the sustainability of the IS firm. In resolving the issue of boundary conditions, our analysis suggests that the likelihood of IS outperforming other competing disciplines is feasible regardless of whether a distinct identity is forged. This relation is contingent on the ability of a knowledge firm to secure resources. Distinctness is required however, when a knowledge firm is unable to generate resources. Our analysis also indicates that the debate on audiences maybe misplaced. Beyond addressing the debate, however, we conclude that an inductive approach to research with a focus on addressing problems faced by emical markets is more likely to ensure sustainability when contrasted with other perspectives.", "paper_title": "Resource-Based Framework for IS Research: Knowledge Firms and Sustainability in Knowledge Markets", "paper_id": "WOS:000267037900001"}