{"auto_keywords": [{"score": 0.04970198387475844, "phrase": "convex_regions"}, {"score": 0.004683540676363745, "phrase": "popular_fragment"}, {"score": 0.004628320711601916, "phrase": "region_connection_calculus"}, {"score": 0.0037087324991876727, "phrase": "conceptual_spaces"}, {"score": 0.003636070324571016, "phrase": "highdimensional_euclidean_spaces"}, {"score": 0.0035507457285983268, "phrase": "natural_language_concepts"}, {"score": 0.0029595657769783314, "phrase": "consistent_networks"}, {"score": 0.0025259082947443343, "phrase": "instead_refinements"}, {"score": 0.002155656133617155, "phrase": "n-dimensional_euclidean_space"}, {"score": 0.0021050011192089513, "phrase": "elsevier"}], "paper_keywords": ["Qualitative spatial reasoning", " Region connection calculus", " Convexity", " Conceptual spaces"], "paper_abstract": "RCC8 is a popular fragment of the region connection calculus, in which qualitative spatial, relations between regions, such as adjacency, overlap and parthood, can be expressed. While RCC8 is essentially dimensionless, most current applications are confined to reasoning about two-dimensional or three-dimensional physical space. In this paper, however, we are mainly interested in conceptual spaces, which typically are highdimensional Euclidean spaces in which the meaning of natural language concepts can be represented using convex regions. The aim of this paper is to analyze how the restriction to convex regions constrains the realizability of networks of RCC8 relations. First, we identify all ways in which the set of RCC8 base relations can be restricted to guarantee that consistent networks can be cohvexly realized in respectively 1D, 2D, 3D, and 4D. Most surprisingly, we find that if the relation 'partially overlaps' is disallowed, all consistent atomic RCC8 networks can be convexly realized in 4D. If instead refinements of the relation 'part of' are disallowed, all consistent atomic RCC8 relations can be convexly realized in 3D. We furthermore show, among others, that any consistent RCC8 network with 2n + 1 variables can be realized using convex regions in the n-dimensional Euclidean space. (C) 2014 Elsevier BA/. All rights reserved.", "paper_title": "Realizing RCC8 networks using convex regions", "paper_id": "WOS:000346230800004"}