{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "eye_fixations"}, {"score": 0.020409006643069917, "phrase": "low-level_features"}, {"score": 0.009655109124028135, "phrase": "natural_images"}, {"score": 0.007760215248346845, "phrase": "object-level_features"}, {"score": 0.006326567203089851, "phrase": "state-of-the-art_low-level_models"}, {"score": 0.004779876533667754, "phrase": "higher-level_visual_features"}, {"score": 0.004693300099911199, "phrase": "object_map"}, {"score": 0.004524801966077539, "phrase": "visual_system"}, {"score": 0.00411436400374349, "phrase": "important_factor"}, {"score": 0.004039792863335641, "phrase": "psychophysical_studies"}, {"score": 0.003952082333580496, "phrase": "high-level_objects"}, {"score": 0.0038380787059463075, "phrase": "early_saliency"}, {"score": 0.0037823114064881357, "phrase": "minor_effect"}, {"score": 0.003327534497764259, "phrase": "intermediate_features"}, {"score": 0.0031267359296488118, "phrase": "mid-level_and_object-level_features"}, {"score": 0.002895291306821514, "phrase": "mid-level_model"}, {"score": 0.0026613618933208467, "phrase": "video_fixation_data"}, {"score": 0.0026035011274172753, "phrase": "mid-level_and_object-level_models"}, {"score": 0.002401875938287542, "phrase": "even_higher_performance"}, {"score": 0.0023496433751182162, "phrase": "best_low-level_model_yields"}, {"score": 0.002290135975651888, "phrase": "data_sets"}, {"score": 0.0022158306933307685, "phrase": "higher_level_features"}, {"score": 0.0021049977753042253, "phrase": "free_viewing_condition"}], "paper_keywords": ["Attention", " saliency", " feature", " visual hierarchy"], "paper_abstract": "Saliency map and object map are the two contrasting hypotheses for the mechanisms utilized by the visual system to guide eye fixations when humans are freely viewing natural images. Most computational studies define saliency as outliers of distributions of low-level features, and propose saliency as an important factor for predicting eye fixations. Psychophysical studies, however, suggest that high-level objects predict eye fixations more accurately and the early saliency only has a minor effect. But this view has been challenged by a study which shows opposite results, suggesting that the role of object-level features needs further investigations. In addition, little is known about the role of intermediate features between the low-level and the object-level features. In this paper, we construct two models based on mid-level and object-level features, respectively, and compare their performances against those based on low-level features. Quantitative evaluation on three benchmark natural image fixation data sets demonstrates that the mid-level model outperforms the state-of-the-art low-level models by a significant margin and the object-level model is inferior to most low-level models. Quantitative evaluation on a video fixation data set demonstrates that both the mid-level and object-level models outperform the state-of-the-art low-level models, and the latter performs better under three out of four standard metrics. When combined together the two proposed models achieve even higher performance. However, incorporating the best low-level model yields negligible improvements on all of the data sets. Taken together, these results indicate that higher level features may be more effective than low-level features for predicting eye fixations on natural images in the free viewing condition.", "paper_title": "Predicting Eye Fixations With Higher-Level Visual Features", "paper_id": "WOS:000349774700011"}