{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "wisdom_-_a_collectivist_study"}, {"score": 0.004687742829233727, "phrase": "public_library_knitting_group"}, {"score": 0.004511799033574768, "phrase": "collectivist_theoretical_framework"}, {"score": 0.004426308135681733, "phrase": "human_information_behaviour"}, {"score": 0.0042928648367867835, "phrase": "knitting_group"}, {"score": 0.004053362743156545, "phrase": "naturalistic_and_consisted_of_active_participant_observation_of_five_knitting_group_sessions_and_semi-structured_interviews"}, {"score": 0.0037259623657693794, "phrase": "field_notes"}, {"score": 0.0036274201504044685, "phrase": "findings_-_information_practices"}, {"score": 0.003424916005912503, "phrase": "public_library"}, {"score": 0.0033857878144822906, "phrase": "physical_characteristics"}, {"score": 0.0032710562699144814, "phrase": "social_meanings"}, {"score": 0.0027741761880779535, "phrase": "collectivist_understandings"}, {"score": 0.0027007380550259077, "phrase": "\"information_ground"}, {"score": 0.0026091594819333654, "phrase": "constructivist_perspectives"}, {"score": 0.0025694584194998356, "phrase": "small-scale_naturalistic_study"}, {"score": 0.0023346234464901978, "phrase": "public_libraries"}, {"score": 0.002290291401956985, "phrase": "information_behaviour"}, {"score": 0.0021375377706211686, "phrase": "collectivist_approach"}, {"score": 0.0021049977753042253, "phrase": "everyday-life_information"}], "paper_keywords": ["information transfer", " women", " crafts", " public libraries", " communities", " Canada"], "paper_abstract": "Purpose - The authors aim to apply a collectivist theoretical framework to the study of human information behaviour and the construction of meaning in a knitting group held in a branch of a large Canadian (Ontario) public library. Design/methodology/approach - The research design was naturalistic and consisted of active participant observation of five knitting group sessions and semi-structured interviews with 12 group members. Field notes were taken, and both observations and interviews were audio taped and transcribed. Field notes and transcripts were coded qualitatively. Findings - Information practices and contextual factors are mutually constitutive. The location of the circle in a public library, the physical characteristics of the act of knitting, and the social meanings of the activities taking place within the group, including the significance of gender and caring, are integrally linked to HIB in this setting. Findings are described verbally and illustrated through a model. Research limitations/implications - This study applies collectivist understandings to enrich concepts such as the \"information ground\" that have previously been studied largely from constructivist perspectives. As a small-scale naturalistic study, results are context-specific and must be applied tentatively. Practical implications - This study provides an example of how programs in public libraries can provide opportunities for information behaviour and the construction of meaning for members of the community. Originality/value - This study contributes a collectivist approach to research on everyday-life information seeking and on the library as a place.", "paper_title": "Purls of wisdom - A collectivist study of human information behaviour in a public library knitting group", "paper_id": "WOS:000243809100006"}