{"auto_keywords": [{"score": 0.031405885792058136, "phrase": "fgrc"}, {"score": 0.02322730111336099, "phrase": "large_data_sets"}, {"score": 0.022375597725443723, "phrase": "grc"}, {"score": 0.009170763107114474, "phrase": "adopted_similarity_measure"}, {"score": 0.004762893197005439, "phrase": "minimal_enclosing_ball"}, {"score": 0.004685855684376706, "phrase": "graph-based_relaxed_clustering"}, {"score": 0.004486432283770142, "phrase": "spectral_clustering_algorithms"}, {"score": 0.003048782877550259, "phrase": "novel_algorithm"}, {"score": 0.0027641218567092665, "phrase": "core-set-based_minimal_enclosing_ball_approximation"}, {"score": 0.0025334249463305875, "phrase": "size_n."}, {"score": 0.00230932021677234, "phrase": "proposed_fgrc"}], "paper_keywords": ["Clustering", " large data sets", " minimal enclosing ball (MEB)", " time complexity"], "paper_abstract": "Although graph-based relaxed clustering (GRC) is one of the spectral clustering algorithms with straightforwardness and self-adaptability, it is sensitive to the parameters of the adopted similarity measure and also has high time complexity O(N-3) which severely weakens its usefulness for large data sets. In order to overcome these shortcomings, after introducing certain constraints for GRC, an enhanced version of GRC [constrained GRC (CGRC)] is proposed to increase the robustness of GRC to the parameters of the adopted similarity measure, and accordingly, a novel algorithm called fast GRC (FGRC) based on CGRC is developed in this paper by using the core-set-based minimal enclosing ball approximation. A distinctive advantage of FGRC is that its asymptotic time complexity is linear with the data set size N. At the same time, FGRC also inherits the straightforwardness and self-adaptability from GRC, making the proposed FGRC a fast and effective clustering algorithm for large data sets. The advantages of FGRC are validated by various benchmarking and real data sets.", "paper_title": "Fast Graph-Based Relaxed Clustering for Large Data Sets Using Minimal Enclosing Ball", "paper_id": "WOS:000304163200008"}