{"auto_keywords": [{"score": 0.032306171802491186, "phrase": "user-item_preferences"}, {"score": 0.026144058826810406, "phrase": "regularization_model"}, {"score": 0.00481495049065317, "phrase": "social_media_environment"}, {"score": 0.0047864177420244795, "phrase": "mutual_resource_fusion"}, {"score": 0.004577718478319983, "phrase": "social_relationships"}, {"score": 0.004430452655732319, "phrase": "popular_music-sharing_site"}, {"score": 0.004224627834741731, "phrase": "online_interest_groups"}, {"score": 0.004137600338433322, "phrase": "common_tastes"}, {"score": 0.003945326595078176, "phrase": "item_recommendations"}, {"score": 0.0038297020126219082, "phrase": "friend_suggestions"}, {"score": 0.0037396377535454887, "phrase": "contact_list"}, {"score": 0.003706410380455668, "phrase": "group_recommendations"}, {"score": 0.003513133457324989, "phrase": "unified_framework"}, {"score": 0.0034304883989739804, "phrase": "single_system"}, {"score": 0.0029649248741435512, "phrase": "algorithm_performance"}, {"score": 0.0028608622935131067, "phrase": "matrix_factorization_framework"}, {"score": 0.002810204880249441, "phrase": "ideal_efficiency"}, {"score": 0.002639845784408318, "phrase": "users'_implicit_interaction"}, {"score": 0.0025776913268808124, "phrase": "effective_fusion_mechanism"}, {"score": 0.002472412920623605, "phrase": "respective_merits"}, {"score": 0.0024431289979171505, "phrase": "factorization_model"}, {"score": 0.002378499067102358, "phrase": "bipartite_data"}, {"score": 0.002214370556271579, "phrase": "friendship's_regularization"}, {"score": 0.002188136252410142, "phrase": "similarity_measure"}, {"score": 0.002142970278347126, "phrase": "positive_effect"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Fusion of heterogeneous resource", " Item recommendation", " Group recommendation", " Friend recommendation", " Matrix factorization", " Regularization"], "paper_abstract": "Up to now, more and more online sites have started to allow their users to build the social relationships. Take the Last.fm for example (which is a popular music-sharing site), users can not only add each other as friends, but also join online interest groups where they shall meet people with common tastes. Therefore, in this environment, users might be interested in not only receiving item recommendations (such as music), but also getting friend suggestions so they might put them in the contact list, and group recommendations that they could consider joining. To support such demanding needs, in this paper, we propose a unified framework that provides three different types of recommendation in a single system: recommending items, recommending groups and recommending friends. For each type of recommendation, we in depth investigate the contribution of fusing other two auxiliary information resources (e.g., fusing friendship and membership for recommending items, and fusing user-item preferences and friendship for recommending groups) for boosting the algorithm performance. More notably, the algorithms were developed based on the matrix factorization framework in order to achieve the ideal efficiency as well as accuracy. We performed experiments with two large-scale real-world data sets that contain users' implicit interaction with items. The results revealed the effective fusion mechanism for each type of recommendation in such implicit data condition. Moreover, it demonstrates the respective merits of regularization model and factorization model: the factorization is more suitable for fusing bipartite data (such as membership and user-item preferences), while the regularization model better suits one mode data (like friendship). We further enhanced the friendship's regularization by integrating the similarity measure, which was experimentally proven with positive effect. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "A unified framework for recommending items, groups and friends in social media environment via mutual resource fusion", "paper_id": "WOS:000316522900011"}