{"auto_keywords": [{"score": 0.03390806925101703, "phrase": "enterprise_system"}, {"score": 0.02322730111336099, "phrase": "enterprise_systems"}, {"score": 0.010497559976638949, "phrase": "organizational_resilience"}, {"score": 0.005730030453320507, "phrase": "power_differentials"}, {"score": 0.004558564684763264, "phrase": "seamless_integration"}, {"score": 0.004085856939524333, "phrase": "control_mechanisms"}, {"score": 0.003826007045267751, "phrase": "company's_data"}, {"score": 0.003702323283528696, "phrase": "unauthorized_and_unintended_uses"}, {"score": 0.003524227590204673, "phrase": "total_control"}, {"score": 0.0031584367879334114, "phrase": "unintended_organizational_implications"}, {"score": 0.0030899524399043863, "phrase": "organizational_necessities"}, {"score": 0.002861708609922034, "phrase": "company_case_study"}, {"score": 0.0024011766029754006, "phrase": "increased_rigidity"}, {"score": 0.0023107372754933887, "phrase": "organizational_flexibility"}, {"score": 0.0021049977753042253, "phrase": "unexpected_consequences"}], "paper_keywords": ["enterprise system", " resilience", " power", " control", " drift"], "paper_abstract": "Enterprise systems are used to facilitate the seamless integration and exchange of data between the various departments within an organization. In order to achieve this, rigidly defined control mechanisms must be in place in the system, which safeguard the company's data and protect the company against unauthorized and unintended uses of the system. This is ideal for total control; however, is only achievable to a certain extent. The configuration of controls in the enterprise system may have unintended organizational implications, due to organizational necessities. The purpose of this paper is to present the findings from a company case study, where an enterprise system is being used. We suggest that the introduction of an enterprise system creates power differentials, which serve to increase control in the organization. This results in increased rigidity, and a possible decrease in organizational flexibility and resilience. On the other hand, enterprise systems can also cause drift, resulting from the unexpected consequences of these power differentials, as well as from the role of perceptions of people in solving a problem within the enterprise system. This reduction in control may serve in some circumstances as an enabler to organizational resilience.", "paper_title": "The impact of enterprise systems on organizational resilience", "paper_id": "WOS:000244750300006"}