{"auto_keywords": [{"score": 0.040611423146622846, "phrase": "personalization_systems"}, {"score": 0.01113066310690757, "phrase": "personalization_perspectives"}, {"score": 0.009390613703439514, "phrase": "implementation_classification_scheme"}, {"score": 0.00481495049065317, "phrase": "information_systems"}, {"score": 0.004577145044601205, "phrase": "important_approach_element"}, {"score": 0.004548253531664032, "phrase": "customer_relationships"}, {"score": 0.004519543557571175, "phrase": "web_strategies"}, {"score": 0.004434491600123024, "phrase": "wide_differences"}, {"score": 0.004136044939878838, "phrase": "high-level_framework"}, {"score": 0.004032551494961167, "phrase": "fundamental_assumptions"}, {"score": 0.0035751121405295026, "phrase": "general_level"}, {"score": 0.0031895588542135245, "phrase": "ideal_types"}, {"score": 0.0028095957871860653, "phrase": "implementation_choices"}, {"score": 0.0024281181691350085, "phrase": "particular_concepts"}, {"score": 0.0023899010501421186, "phrase": "general_design_choices"}, {"score": 0.0022287497627555895, "phrase": "common_theoretical_basis"}, {"score": 0.0021049977753042253, "phrase": "future_research_directions"}], "paper_keywords": ["personalization", " multiparadigm review", " classification scheme", " ideal types", " design philosophy", " electronic commerce", " mobile commerce"], "paper_abstract": "In e-commerce and mobile commerce, personalization has been recognized as an important approach element in customer relationships and Web strategies. However, there are wide differences in how this concept is defined, characterized, and implemented in the literature. In this article we present a high-level framework for classifying approaches to personalization that delineates fundamental assumptions about personalization in the literature and relates them to strategies for developing personalization systems. The framework consists of 2 parts: (a) a set of perspectives on personalization that guide the design of personalization systems at a general level and (b) a scheme for classifying how personalization can be implemented. The personalization perspectives represent 4 distinct schools of thought on the nature of personalization distilled from the literature of several fields. These perspectives are ideal types and we discuss them in terms of the motivation they supply for personalization, the goals and means of personalization, and the ways in which they conceptualize and model users. The implementation classification scheme is constructed on 3 dimensions of implementation choices. These 3 dimensions pertain to what to personalize (content, interface, functionality, channel), to whom to personalize (individuals or categories of individuals) as well as who does the personalization (implicit or explicit personalization). The personalization perspectives represent particular concepts of personalization that guide general design choices; these choices are implemented via the options described in the implementation classification scheme. The framework contributes to the development of a common theoretical basis for the study of personalization. We discuss implications of the framework for design of personalization systems and future research directions.", "paper_title": "What is personalization? Perspectives on the design and implementation of personalization in information systems", "paper_id": "WOS:000242470600002"}