{"auto_keywords": [{"score": 0.049090663946911924, "phrase": "dynamic_scene"}, {"score": 0.00481495049065317, "phrase": "unsynchronized_video_sequences"}, {"score": 0.004266067096140677, "phrase": "different_orientation"}, {"score": 0.0034332736827447654, "phrase": "linear_combination"}, {"score": 0.0031712256091350316, "phrase": "articulated_objects"}, {"score": 0.0030160945545795494, "phrase": "first_sequence"}, {"score": 0.0028805474861014722, "phrase": "second_sequence"}, {"score": 0.002627407106087633, "phrase": "correct_permutation"}, {"score": 0.002530359917257626, "phrase": "non-rigid_bodies"}, {"score": 0.002509284173541882, "phrase": "local_rigidity_constraints"}, {"score": 0.00246765655376112, "phrase": "linear_algorithms"}, {"score": 0.002327310963701377, "phrase": "outlier_points"}, {"score": 0.002194929830604162, "phrase": "planar_objects"}, {"score": 0.00216755493625594, "phrase": "unified_framework"}, {"score": 0.0021315842986705485, "phrase": "numerical_problems"}], "paper_keywords": ["structure from motion", " video synchronization", " wide base-line matching"], "paper_abstract": "3D reconstruction of a dynamic scene from features in two cameras usually requires synchronization and correspondences between the cameras. These may be hard to achieve due to occlusions, different orientation, different scales. etc. In this work we present an algorithm for reconstructing a dynamic scene from sequences acquired by two uncalibrated non-synchronized fixed affine cameras. It is assumed that (possibly) different points are tracked in the two sequences. The only constraint relating the two cameras is that every 3D point tracked in one sequence can be described as a linear combination of some of the 3D points tracked in the other sequence. Such constraint is useful, for example, for articulated objects. We may track some points on an arm in the first sequence, and some other points on the same arm in the second sequence. On the other extreme, this model can be used for generally moving points tracked in both sequences without knowing the correct permutation. In between, this model can cover non-rigid bodies with local rigidity constraints. We present linear algorithms for synchronizing the two sequences and reconstructing the 3D points tracked in both views. Outlier points are automatically detected and discarded. The algorithm can handle both 3D objects and planar objects in a unified framework, therefore avoiding numerical problems existing in other methods.", "paper_title": "Wide baseline matching between unsynchronized video sequences", "paper_id": "WOS:000238228900004"}