{"auto_keywords": [{"score": 0.048153996910559355, "phrase": "breast_cancer"}, {"score": 0.015538563141441393, "phrase": "digital_mammograms"}, {"score": 0.00481495049065317, "phrase": "micro_calcifications"}, {"score": 0.00438399094249306, "phrase": "women_mortality"}, {"score": 0.004207734323806386, "phrase": "western_countries"}, {"score": 0.00376409764683147, "phrase": "microcalcification_clusters"}, {"score": 0.0037201996003549246, "phrase": "primary_indicators"}, {"score": 0.003676811616723809, "phrase": "malignant_types"}, {"score": 0.0032697235411641695, "phrase": "small_clusters"}, {"score": 0.003175175896313016, "phrase": "relatively_high_intensity"}, {"score": 0.00249592321829865, "phrase": "dual-threshold_method"}, {"score": 0.0023124457559811087, "phrase": "log_edge_detection_method"}, {"score": 0.0021550502873107654, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_method"}], "paper_keywords": [""], "paper_abstract": "Breast cancer is one of the main leading causes to women mortality in the world especially in the western countries. Since the causes are still unknown, breast cancer cannot be prevented completely even till now. Microcalcification clusters are primary indicators of malignant types of breast cancer, the detection is important to prevent and treat the disease. The microcalcifications appear in the small clusters of a few pixels with relatively high intensity and closed contours compared with their neighboring pixels. However, it is a challenge to detect all the microcalcifications since they appear as spots which are slightly brighter than their backgrounds. This paper presents an approach for detecting microcalcifications in digital mammograms employing a dual-threshold method. These microcalcifications can be located by our new method which is developed from LoG edge detection method. Two thresholds are proposed in our method based on two additional criterions. Experimental results show that the proposed method can locate the microcalcifications exactly in mammogram as well as restrain the contours produced by the noises.", "paper_title": "Detection of micro calcifications in digital mammograms based on dual-threshold", "paper_id": "WOS:000239454900047"}