{"auto_keywords": [{"score": 0.04254082380850069, "phrase": "certificate_revocation"}, {"score": 0.021760251706506393, "phrase": "smart_grid"}, {"score": 0.009650879906626771, "phrase": "pkc"}, {"score": 0.009453548513587703, "phrase": "smart_grid_applications"}, {"score": 0.00481495049065317, "phrase": "public-key_certificate_revocation"}, {"score": 0.004696491408936132, "phrase": "public_key_cryptography"}, {"score": 0.004431246962597134, "phrase": "secure_use"}, {"score": 0.0043401761815767, "phrase": "certificate_revocation_schemes"}, {"score": 0.0038796562792487, "phrase": "different_motivations"}, {"score": 0.00345344412693677, "phrase": "existing_certificate_revocation_schemes"}, {"score": 0.00286407451582299, "phrase": "pseudonymous_public_key_infrastructure"}, {"score": 0.002581165831422692, "phrase": "potential_application"}, {"score": 0.0024554476124885806, "phrase": "large_number"}, {"score": 0.0023849523850778807, "phrase": "efficient_certificate_revocation_scheme"}, {"score": 0.0023651843133643785, "phrase": "ppki"}, {"score": 0.002335838283092986, "phrase": "compressed_certificate_revocation_lists"}, {"score": 0.0021492686054379755, "phrase": "different_schemes"}, {"score": 0.0021049977753042253, "phrase": "different_applications"}], "paper_keywords": ["Certificate revocation schemes", " public key cryptography (PKC)", " smart grid communication security"], "paper_abstract": "The public key cryptography (PKC) is essential for securing many applications in smart grid. For the secure use of the PKC, certificate revocation schemes tailored to smart grid applications should be adopted. However, little work has been done to study certificate revocation in smart grid. In this paper, we first explain different motivations that necessitate revoking certificates in smart grid. We also identify the applications that can be secured by PKC and thus need certificate revocation. Then, we explain existing certificate revocation schemes and define several metrics to assess them. Based on this assessment, we identify the applications that are proper for each scheme and discuss how the schemes can be modified to fully satisfy the requirements of its potential applications. Finally, we study certificate revocation in pseudonymous public key infrastructure (PPKI), where a large number of certified public/private keys are assigned for each node to preserve privacy. We target vehicles-to-grid communications as a potential application. Certificate revocation in this application is a challenge because of the large number of certificates. We discuss an efficient certificate revocation scheme for PPKI, named compressed certificate revocation lists (CRLs). Our analytical results demonstrate that one revocation scheme cannot satisfy the over-head/security requirements of all smart grid applications. Rather, different schemes should be employed for different applications. Moreover, we used simulations to measure the overhead of the schemes.", "paper_title": "Investigating Public-Key Certificate Revocation in Smart Grid", "paper_id": "WOS:000373098800005"}