{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cybernetic_system"}, {"score": 0.004665764181113345, "phrase": "hostile_environment"}, {"score": 0.00438105507792004, "phrase": "varying_temperatures"}, {"score": 0.0042119653427658025, "phrase": "higher_survivability"}, {"score": 0.003970439654470374, "phrase": "night-time_or_early_morning_rather_than_mid-"}, {"score": 0.0035699363258657212, "phrase": "beneficial_influence"}, {"score": 0.003472845095323694, "phrase": "robot_societies"}, {"score": 0.0034185505275141077, "phrase": "cooperating_robots"}, {"score": 0.0032350961776525075, "phrase": "biologically-inspired_form"}, {"score": 0.0031100973266506163, "phrase": "conventional_actor-critic_learning"}, {"score": 0.0030374213037172803, "phrase": "control_strategy"}, {"score": 0.0027200305495826797, "phrase": "individual_behaviours"}, {"score": 0.002688050388891007, "phrase": "sensor_measurements"}, {"score": 0.0026045914281028473, "phrase": "swarm_behavior"}, {"score": 0.002155412043665635, "phrase": "biologically-inspired_approach"}, {"score": 0.0021049977753042253, "phrase": "changing_temperatures"}], "paper_keywords": [""], "paper_abstract": "The problem considered in this article is how a cybernetic system can learn to control its actions in a hostile environment. This article focuses on an approach to solving this problem in an environment with varying temperatures. In effect, machines that operate outdoors have higher survivability if actions are chosen during periods when it is cooler (e. g., night-time or early morning rather than mid- to late afternoon during summer months). The assumption made here is that learning to choose actions that compensate for the influence of temperature has beneficial influence on the functioning of individuals in robot societies (collections of cooperating robots called swarmbots or swarms). In keeping with this idea, a biologically-inspired form of adaptive learning is given in this article. Conventional actor-critic learning provides a framework for the control strategy introduced in this article. It is ethology (study of behavior of organisms) that provides a basis for monitoring the behavior of a swarmbot. Individual behaviours together with sensor measurements are recorded in tables called ethograms. Swarm behavior tends to be episodic. An ethogram is recorded during each episode during the lifespan of a swarm. Each ethogram is a source of measurements that can be used to influence learning during an episode. The contribution of this article is the introduction of a biologically-inspired approach to learning that adapts to changing temperatures.", "paper_title": "Influence of temperature on swarmbots that learn", "paper_id": "WOS:000256797100003"}