{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "agent-based_modeling_framework"}, {"score": 0.004777034835192062, "phrase": "simulating_engineering_team_work"}, {"score": 0.004610058444728656, "phrase": "modern_organizations"}, {"score": 0.00450198136261303, "phrase": "team's_performance_levels"}, {"score": 0.00443133501650381, "phrase": "complex_interactions"}, {"score": 0.0037679023889496885, "phrase": "product_development"}, {"score": 0.003738200814271716, "phrase": "engineering_organizations"}, {"score": 0.003650488388949457, "phrase": "multidisciplinary_integrated_product_teams"}, {"score": 0.003536720212056521, "phrase": "research_methods"}, {"score": 0.0033460624879847667, "phrase": "agent-based_modeling_approach"}, {"score": 0.0032546105164772995, "phrase": "engineering_environment"}, {"score": 0.00303072749758085, "phrase": "individual_level"}, {"score": 0.0027450280220853137, "phrase": "task_level"}, {"score": 0.0026384167183586015, "phrase": "team_performance"}, {"score": 0.002408623172021922, "phrase": "model's_development"}, {"score": 0.0022606512324475584, "phrase": "realistic_team_working_scenarios"}, {"score": 0.002155656133617155, "phrase": "model's_practical_applications"}, {"score": 0.0021049977753042253, "phrase": "organizational_decision"}], "paper_keywords": ["Industrial psychology", " multiagent systems", " simulation", " teamwork"], "paper_abstract": "Team working is becoming increasingly important in modern organizations due to its beneficial outcomes. A team's performance levels are determined by complex interactions between the attributes of its individual members, the communication and dynamics between members, the working environment, and the team's work tasks. As organizations evolve, so too does the nature of team working. During the past two decades, product development in engineering organizations has increasingly been undertaken by multidisciplinary integrated product teams. Such increasing complexity means that the nature of research methods for studying teams must also evolve. Accordingly, this paper proposes an agent-based modeling approach for simulating team working within an engineering environment, informed by research conducted in two engineering organizations. The model includes a number of variables at an individual level (competency, motivation, availability, response rate), team level (communication, shared mental models, trust), and task level (difficulty, workflow), which jointly determine team performance (quality, time to complete the task, time spent working on the task). In addition to describing the model's development, the paper also reports the results of various simulation runs that were conducted in response to realistic team working scenarios, together with its validation. Finally, the paper discusses the model's practical applications as a tool for facilitating organizational decision making with respect to optimizing team working.", "paper_title": "The Development of an Agent-Based Modeling Framework for Simulating Engineering Team Work", "paper_id": "WOS:000310147000010"}