{"auto_keywords": [{"score": 0.04917331388552706, "phrase": "fuzzy_vault"}, {"score": 0.03564427236668897, "phrase": "existing_methods"}, {"score": 0.00481495049065317, "phrase": "vault_scheme"}, {"score": 0.004376273644295806, "phrase": "error-prone_environments"}, {"score": 0.004132411680987228, "phrase": "secret_key"}, {"score": 0.003939565240409143, "phrase": "polynomial_equation"}, {"score": 0.003702206069379459, "phrase": "polynomial_reconstruction_problem"}, {"score": 0.0036494864560524735, "phrase": "vault_performance"}, {"score": 0.003332537728389913, "phrase": "chaff_points"}, {"score": 0.0031466527290980686, "phrase": "new_chaff_point_generation_technique"}, {"score": 0.00290087451159631, "phrase": "complexity_study"}, {"score": 0.002699960312990493, "phrase": "significant_improvement"}, {"score": 0.002661474607275484, "phrase": "existing_algorithm"}, {"score": 0.002500927169609655, "phrase": "proposed_algorithm"}, {"score": 0.002406968743305622, "phrase": "clancy's_and_khalil-hani's_algorithms"}, {"score": 0.0022617389804167943, "phrase": "valid_chaff_points"}, {"score": 0.0021049977753042253, "phrase": "khalil-hani's_algorithm"}], "paper_keywords": [""], "paper_abstract": "Fuzzy vault is the most practical scheme in bio-cryptosystems for the applications in protecting data in the real-world, error-prone environments. The biometric features were used to lock and unlock the secret key, which is encoded in the coefficients of a polynomial equation. The security of the fuzzy vault depends on the infeasibility of the polynomial reconstruction problem. The vault performance can be enhanced by adding more noise (chaff) points to the vault. The existing methods for generating chaff points were time consuming as producing more than 200 chaff points. This paper proposes a new chaff point generation technique for the fuzzy vault in bio-cryptosystems which is less time-consuming for producing more than 200 points. Complexity study shows that our algorithm has a complexity of O(n(2)), which is a significant improvement over the existing algorithm of the complexity of O(n(3)). Our experimental results show that the proposed algorithm achieves 14.84 and 41.86 times faster than Clancy's and Khalil-Hani's algorithms in the case of generating 240 chaff points. To generate the same numbers of valid chaff points, our proposed method needs less candidate points than the existing methods. Our proposed algorithm generates 11% more chaff points compared to the Khalil-Hani's algorithm.", "paper_title": "Improved chaff point generation for vault scheme in bio-cryptosystems", "paper_id": "WOS:000346561700002"}