{"auto_keywords": [{"score": 0.045366511165128576, "phrase": "design_methods"}, {"score": 0.012344474652831207, "phrase": "young_children"}, {"score": 0.006621818123164579, "phrase": "design_method"}, {"score": 0.00481495049065317, "phrase": "early_design_methods"}, {"score": 0.004637478829869904, "phrase": "user_centred_design_methods"}, {"score": 0.004579780586951551, "phrase": "children's_required_level"}, {"score": 0.0038794730876377057, "phrase": "required_design_skills"}, {"score": 0.003795335309109018, "phrase": "proposed_framework"}, {"score": 0.0035204268675160257, "phrase": "specific_school_grade"}, {"score": 0.003487489029588045, "phrase": "initial_examination"}, {"score": 0.0032858981413454802, "phrase": "earlier_work"}, {"score": 0.0031056437850836326, "phrase": "design_problem"}, {"score": 0.0030192479661007303, "phrase": "e.g._brainstorming"}, {"score": 0.0027741761880779535, "phrase": "current_paper"}, {"score": 0.0027310193758440376, "phrase": "significantly_more_options"}, {"score": 0.0027139447110929586, "phrase": "prototyping_sessions"}, {"score": 0.002630155206056179, "phrase": "nominal_group_technique"}, {"score": 0.0022064376000055764, "phrase": "empirical_support"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Design", " Children", " User centered design", " Design space exploration", " Framework", " Design skills"], "paper_abstract": "When designing with young children, designers usually select user centred design methods based on the children's required level of engagement and the inspiration expected to be created according to the designer. User centred design methods should be selected for their suitability for children and for the quality of the output of the design method. To understand the suitability of design methods, a framework was developed to describe design methods in terms of required design skills as identified by the Theory of Multiple Intelligences. The proposed framework could provide the basis for a tool to compare design methods and to generate hypotheses about what design method would work optimally with children in a specific school grade. The initial examination of the viability of the framework is a comparison of design methods by the number of skills involved; earlier work showed that the involvement of more skills (as with, e.g. low-fi prototyping) could result in more options for a design problem than the involvement of fewer skills (as with e.g. brainstorming). Options and Criteria were counted to understand the quality of the method in terms of the amount of design-information. The results of the current paper indicate that 8-to-10-year-old children generate significantly more options in prototyping sessions than when they are involved in sessions applying a Nominal Group Technique. The paper indicates that (a) with the framework we can generate hypotheses to compare design methods with children and (b) that the outcome of various design methods, which might lead to very different representations, can be compared in terms of Options and Criteria. Further usage of the framework is expected to result in empirical support for selecting a design method to be applied with young children. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Development and application of a framework for comparing early design methods for young children", "paper_id": "WOS:000286847400006"}