{"auto_keywords": [{"score": 0.04672583002462711, "phrase": "lipid_droplets"}, {"score": 0.015275339512964491, "phrase": "cahn-hilliard_theory"}, {"score": 0.00481495049065317, "phrase": "phenomenological_model"}, {"score": 0.004722791767189843, "phrase": "maturing_adipocytes"}, {"score": 0.004413846562278824, "phrase": "adipocyte_cell"}, {"score": 0.004308455856718928, "phrase": "adipose_nucleation"}, {"score": 0.0041450181887917135, "phrase": "later_stages"}, {"score": 0.00393032656248792, "phrase": "larger_droplets"}, {"score": 0.0038179283509963695, "phrase": "smaller_droplets"}, {"score": 0.003516558537200823, "phrase": "cahn-hilliard_equation"}, {"score": 0.0033182152378613767, "phrase": "secondary_phases"}, {"score": 0.0032389001343643064, "phrase": "spinodal_decomposition"}, {"score": 0.0030414140732789186, "phrase": "total_area"}, {"score": 0.0021670777282518424, "phrase": "qualitative_point"}, {"score": 0.0021049977753042253, "phrase": "cell_cultures"}], "paper_keywords": ["Adipose", " Adipogenesis", " Spinodal decomposition", " Finite-element method"], "paper_abstract": "We consider the accumulation and formation of lipid droplets in an adipocyte cell. The process incorporates adipose nucleation (adipogenesis) and growth. At later stages, there will be merging of droplets and growth of larger droplets at the expense of the smaller droplets, which will essentially undergo lipolysis. The process is modeled by the use of the Cahn-Hilliard equation, which is mass-conserving and allows the formation of secondary phases in the context of spinodal decomposition. The volume of fluid (VOF) method is used to determine the total area that is occupied by the lipids in a given cross section. Further, we present an algorithm, applicable to all kinds of grids (structured or unstructured) in two spatial dimensions, to count the number of lipid droplets and the portion of the domain of computation that is occupied by the lipid droplets as a function of time during the process. The results are preliminary and are validated from a qualitative point using experiments carried out on cell cultures. It turns out that the Cahn-Hilliard theory can model many of the features during adipogenesis qualitatively.", "paper_title": "A pilot study of a phenomenological model of adipogenesis in maturing adipocytes using Cahn-Hilliard theory", "paper_id": "WOS:000297550600011"}