{"auto_keywords": [{"score": 0.04982189166506881, "phrase": "textual_entailment"}, {"score": 0.014397124688698852, "phrase": "rte"}, {"score": 0.00481495049065317, "phrase": "modular_architecture"}, {"score": 0.004750597411562959, "phrase": "key_challenge"}, {"score": 0.003913462458156738, "phrase": "world_knowledge"}, {"score": 0.003758492534305375, "phrase": "problematic_practical_consequences"}, {"score": 0.003688280527594519, "phrase": "existing_rte_systems"}, {"score": 0.0035231586703704594, "phrase": "systematic_evaluations"}, {"score": 0.0034110573683688154, "phrase": "wide_array"}, {"score": 0.003374485885600879, "phrase": "potential_end_users"}, {"score": 0.0032495360221984045, "phrase": "novel_excitement_architecture"}, {"score": 0.0031039952683032633, "phrase": "textual_entailment_area"}, {"score": 0.0030377722496604427, "phrase": "strongly_typed_interfaces"}, {"score": 0.0029729578703205453, "phrase": "modular_linguistic_analysis_pipeline"}, {"score": 0.0029095223448113196, "phrase": "rte_methods"}, {"score": 0.0028938754782941623, "phrase": "top-level_algorithms"}, {"score": 0.0028244964420118587, "phrase": "knowledge_bases"}, {"score": 0.002809305540570528, "phrase": "alignment_methods"}, {"score": 0.0027052262694643348, "phrase": "major_approaches"}, {"score": 0.0026689945874011807, "phrase": "language_independence"}, {"score": 0.002577041209140337, "phrase": "major_existing_systems"}, {"score": 0.0025356736545188562, "phrase": "practical_implementation"}, {"score": 0.0024949684851017194, "phrase": "excitement_open_platform"}, {"score": 0.0024483022321037714, "phrase": "textual_entailment_algorithms"}, {"score": 0.002376722584437227, "phrase": "linguistic-analysis_pipelines"}, {"score": 0.002344921730426846, "phrase": "english"}, {"score": 0.002332275783524277, "phrase": "german"}, {"score": 0.0023134716878114776, "phrase": "italian"}, {"score": 0.0022640680800238154, "phrase": "linguistic_resources"}, {"score": 0.0021860348299797107, "phrase": "comprehensive_and_flexible_basis"}, {"score": 0.0021221066364072766, "phrase": "open_source_software"}, {"score": 0.0021049977753042253, "phrase": "gnu_general_public_license"}], "paper_keywords": [""], "paper_abstract": "A key challenge at the core of many Natural Language Processing (NLP) tasks is the ability to determine which conclusions can be inferred from a given natural language text. This problem, called the Recognition of Textual Entailment (RTE), has initiated the development of a range of algorithms, methods, and technologies. Unfortunately, research on Textual Entailment (TE), like semantics research more generally, is fragmented into studies focussing on various aspects of semantics such as world knowledge, lexical and syntactic relations, or more specialized kinds of inference. This fragmentation has problematic practical consequences. Notably, interoperability among the existing RTE systems is poor, and reuse of resources and algorithms is mostly infeasible. This also makes systematic evaluations very difficult to carry out. Finally, textual entailment presents a wide array of approaches to potential end users with little guidance on which to pick. Our contribution to this situation is the novel EXCITEMENT architecture, which was developed to enable and encourage the consolidation of methods and resources in the textual entailment area. It decomposes RTE into components with strongly typed interfaces. We specify (a) a modular linguistic analysis pipeline and (b) a decomposition of the 'core' RTE methods into top-level algorithms and subcomponents. We identify four major subcomponent types, including knowledge bases and alignment methods. The architecture was developed with a focus on generality, supporting all major approaches to RTE and encouraging language independence. We illustrate the feasibility of the architecture by constructing mappings of major existing systems onto the architecture. The practical implementation of this architecture forms the EXCITEMENT open platform. It is a suite of textual entailment algorithms and components which contains the three systems named above, including linguistic-analysis pipelines for three languages (English, German, and Italian), and comprises a number of linguistic resources. By addressing the problems outlined above, the platform provides a comprehensive and flexible basis for research and experimentation in textual entailment and is available as open source software under the GNU General Public License.", "paper_title": "Design and realization of a modular architecture for textual entailment", "paper_id": "WOS:000351756500001"}