{"auto_keywords": [{"score": 0.04442850327214474, "phrase": "object-oriented_programming"}, {"score": 0.00481495049065317, "phrase": "object-oriented_programming_system"}, {"score": 0.004625255533545965, "phrase": "ongoing_research_project"}, {"score": 0.003920476803132283, "phrase": "different_courses"}, {"score": 0.0037658881407605445, "phrase": "prototype-based_object_orientation"}, {"score": 0.0036498637283470386, "phrase": "object_orientation"}, {"score": 0.003569176320452192, "phrase": "class-based_model"}, {"score": 0.0032492519841546682, "phrase": "multiple_platforms"}, {"score": 0.0031916366459252992, "phrase": "portable_bytecode"}, {"score": 0.002716844480081738, "phrase": "object-oriented_teaching"}, {"score": 0.002644865209801606, "phrase": "prototype-based_model"}, {"score": 0.002574788013427524, "phrase": "dramatic_decrease"}, {"score": 0.0024842242921857705, "phrase": "direct_support"}, {"score": 0.0023437863565921053, "phrase": "multiplatform_support"}, {"score": 0.002181766829493483, "phrase": "actually_important_issues"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["persistence", " object-oriented programming", " prototype-based model", " container-based model"], "paper_abstract": "in this article, an ongoing research project conducted in the Computer Science department of the University of Vigo is described. Its main objective is to serve as a vehicle for learning object-oriented programming. Although it is still in development, it has been successfully employed in a number of different courses. Its main characteristics are (a) support of prototype-based object orientation, which is a model of object orientation that actually wraps the class-based model; (b) future support for object persistence, which simplifies to the minimum all input/output issues; and (c) support of multiple platforms, through a portable bytecode. We think that the combination of all of these possibilities, the obtained results in its first use, and the further development of this project will lead to an interesting, useful tool which would be recommended for object-oriented teaching. The simplicity of the prototype-based model of object orientation, the dramatic decrease in complexity for programs due to the direct support of persistence, and all facilities naturally provided by the feature of multiplatform support makes it the ideal tool for learning, allowing the educator to stress on the actually important issues of object-oriented programming. (c) 2006 Wiley Periodicals, Inc.", "paper_title": "Towards an object-oriented programming system for education", "paper_id": "WOS:000243370100001"}