{"auto_keywords": [{"score": 0.03461617249114155, "phrase": "video_packets"}, {"score": 0.012625243642939333, "phrase": "video_packet"}, {"score": 0.00481495049065317, "phrase": "aware_packet_management_framework"}, {"score": 0.004767826806287385, "phrase": "real-time_video_transport"}, {"score": 0.00462919213721188, "phrase": "rigid_delay_constraint"}, {"score": 0.00447251540886613, "phrase": "real-time_video_delivery"}, {"score": 0.004342430078306461, "phrase": "expired_video_packets"}, {"score": 0.003496868378204654, "phrase": "real-time_video_applications"}, {"score": 0.002914288956035066, "phrase": "transmission_quality"}, {"score": 0.0027469703311742647, "phrase": "mac_layer"}, {"score": 0.002416589459425828, "phrase": "estimation_value"}, {"score": 0.002357755095722877, "phrase": "simulation_results"}, {"score": 0.0023117182131967523, "phrase": "proposed_scheme"}, {"score": 0.0022443390559699974, "phrase": "packet_losses"}, {"score": 0.0021049977753042253, "phrase": "received_video_quality"}], "paper_keywords": ["Real-time", " Video", " QoS", " 802.11e", " EDCA", " Priority", " Deadline"], "paper_abstract": "The rigid delay constraint is one of the most challenging issues in real-time video delivery over wireless networks. The expired video packets will become useless for the decoding and display even if they are received correctly at the receiver. Because the significance of each video packet is different, the schedulers have to take into account not only the urgency of the packet but also its importance in the real-time video applications. However, the existing QoS-based IEEE 802.11e MAC protocol leaves the urgency and the importance of video packets out of consideration. This paper proposes a Priority and Delay Aware Packet Management Framework (PDA-PMF) to improve the transmission quality of real-time video streaming over IEEE 802.11e WLANs. In the MAC layer, this framework estimates the delay of each video packet. Subsequently, video packets are sent or dropped according to both the significance of the video packets and the estimation value of the delay. Simulation results show that the proposed scheme can not only reduce the packet losses, but also protect the more important video packets, so as to improve the received video quality effectively.", "paper_title": "Priority and delay aware packet management framework for real-time video transport over 802.11e WLANs", "paper_id": "WOS:000333209300004"}