{"auto_keywords": [{"score": 0.04604921412081026, "phrase": "geographical_objects"}, {"score": 0.00481495049065317, "phrase": "conceptual_models"}, {"score": 0.0047707093928203, "phrase": "geographic_objects"}, {"score": 0.004472146692254812, "phrase": "information_humans"}, {"score": 0.0042506731642425275, "phrase": "edinburgh_castle"}, {"score": 0.004211594861013822, "phrase": "bodiam_castle"}, {"score": 0.003966162568548304, "phrase": "specific_information"}, {"score": 0.0038756055612167942, "phrase": "object_type_castle"}, {"score": 0.003389557201018519, "phrase": "online_survey"}, {"score": 0.0031918759137610523, "phrase": "urban_and_rural_objects"}, {"score": 0.0026042472337367015, "phrase": "object_types"}, {"score": 0.0024522530645471065, "phrase": "requested_information"}, {"score": 0.0022563011263787847, "phrase": "object_type"}, {"score": 0.002164264600379492, "phrase": "natural_language_processing_tasks"}, {"score": 0.0021443262599352996, "phrase": "automatic_generation"}, {"score": 0.0021049977753042253, "phrase": "image_descriptions"}], "paper_keywords": ["knowledge modeling", " natural language processing"], "paper_abstract": "In this article, we investigate what sorts of information humans request about geographical objects of the same type. For example, Edinburgh Castle and Bodiam Castle are two objects of the same type: castle. The question is whether specific information is requested for the object type castle and how this information differs for objects of other types (e.g., church, museum, or lake). We aim to answer this question using an online survey. In the survey, we showed 184 participants 200 images pertaining to urban and rural objects and asked them to write questions for which they would like to know the answers when seeing those objects. Our analysis of the 6,169 questions collected in the survey shows that humans have shared ideas of what to ask about geographical objects. When the object types resemble each other (e.g., church and temple), the requested information is similar for the objects of these types. Otherwise, the information is specific to an object type. Our results may be very useful in guiding Natural Language Processing tasks involving automatic generation of templates for image descriptions and their assessment, as well as image indexing and organization.", "paper_title": "Do humans have conceptual models about geographic objects? A user study", "paper_id": "WOS:000323386300004"}