{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "users'_behavior"}, {"score": 0.048529954401590095, "phrase": "online_community"}, {"score": 0.01374438671176532, "phrase": "system_use"}, {"score": 0.011027163208847154, "phrase": "users'_gregariousness"}, {"score": 0.010414106300514332, "phrase": "local_redundancy"}, {"score": 0.004545675105321216, "phrase": "longitudinal_network_data"}, {"score": 0.004362564831572539, "phrase": "social_interaction"}, {"score": 0.004101579688745222, "phrase": "prototypical_example"}, {"score": 0.00405127920820053, "phrase": "complex_evolving_social_network"}, {"score": 0.0038720442355114045, "phrase": "online_messages"}, {"score": 0.003284361433827464, "phrase": "typical_distances"}, {"score": 0.0030247625535682987, "phrase": "\"small_world"}, {"score": 0.002878930338561009, "phrase": "hub-dominated_structure"}, {"score": 0.0026622351303038885, "phrase": "information_flow"}, {"score": 0.002629539710839523, "phrase": "first-mover_advantages"}, {"score": 0.002607965563121546, "phrase": "users'_ability"}, {"score": 0.002565345470805401, "phrase": "system_prominence"}, {"score": 0.002523420125608051, "phrase": "gender_differences"}, {"score": 0.002304754792740636, "phrase": "social_networks"}, {"score": 0.0022117133940361025, "phrase": "information_diffusion"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": [""], "paper_abstract": "This research draws on longitudinal network data from an online community to examine patterns of users' behavior and social interaction, and infer the processes underpinning dynamics of system use. The online community represents a prototypical example of a complex evolving social network in which connections between users are established over time by online messages. We study the evolution of a variety of properties since the inception of the system, including how users create, reciprocate, and deepen relationships with one another, variations in users' gregariousness and popularity, reachability and typical distances among users, and the degree of local redundancy in the system. Results indicate that the system is a \"small world\" characterized by the emergence, in its early stages, of a hub-dominated structure with heterogeneity in users' behavior. We investigate whether hubs are responsible for holding the system together and facilitating information flow, examine first-mover advantages underpinning users' ability to rise to system prominence, and uncover gender differences in users' gregariousness, popularity, and local redundancy. We discuss the implications of the results for research on system use and evolving social networks, and for a host of applications, including information diffusion, communities of practice, and the security and robustness of information systems.", "paper_title": "Patterns and Dynamics of Users' Behavior and Interaction: Network Analysis of an Online Community", "paper_id": "WOS:000265420700004"}