{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "next-generation_sequencing_reads"}, {"score": 0.004323776691055635, "phrase": "template_sequences"}, {"score": 0.004195418010131832, "phrase": "genome_comparison"}, {"score": 0.003751011827704279, "phrase": "theoretical_formulas"}, {"score": 0.003546722347907148, "phrase": "common_motif_model"}, {"score": 0.0031982609080278643, "phrase": "ngs_data"}, {"score": 0.0029467742734417255, "phrase": "sequencing_error"}, {"score": 0.002555950807368337, "phrase": "first_cluster"}, {"score": 0.0025449518236394103, "phrase": "five_mammalian_species"}, {"score": 0.0025230952890994236, "phrase": "known_phylogenetic_relationships"}, {"score": 0.0024061887405214186, "phrase": "ngs_shotgun"}, {"score": 0.0023650305205893353, "phrase": "clustering_results"}, {"score": 0.002294686545883412, "phrase": "biological_knowledge"}, {"score": 0.0021601997088758957, "phrase": "powerful_alignment-free_comparison_tool"}, {"score": 0.0021049977753042253, "phrase": "different_organisms"}], "paper_keywords": ["HMM", " NGS", " normal approximation", " statistical power", " word count statistics"], "paper_abstract": "Next-generation sequencing (NGS) technologies have generated enormous amounts of shotgun read data, and assembly of the reads can be challenging, especially for organisms without template sequences. We study the power of genome comparison based on shotgun read data without assembly using three alignment-free sequence comparison statistics, D-2, D-2*, and D-2(S), both theoretically and by simulations. Theoretical formulas for the power of detecting the relationship between two sequences related through a common motif model are derived. It is shown that both D-2* and D-2(S) outperform D2 for detecting the relationship between two sequences based on NGS data. We then study the effects of length of the tuple, read length, coverage, and sequencing error on the power of D-2* and D-2(S). Finally, variations of these statistics, d(2), d(2)* and d(2)(S), respectively, are used to first cluster five mammalian species with known phylogenetic relationships, and then cluster 13 tree species whose complete genome sequences are not available using NGS shotgun reads. The clustering results using d(2)(S) are consistent with biological knowledge for the 5 mammalian and 13 tree species, respectively. Thus, the statistic d(2)(S) provides a powerful alignment-free comparison tool to study the relationships among different organisms based on NGS read data without assembly.", "paper_title": "Alignment-Free Sequence Comparison Based on Next-Generation Sequencing Reads", "paper_id": "WOS:000314775400002"}