{"auto_keywords": [{"score": 0.03812749046621616, "phrase": "mav"}, {"score": 0.009750747235251265, "phrase": "non-stationary_environments"}, {"score": 0.00481495049065317, "phrase": "optic_flow_regulation"}, {"score": 0.0047846807459660376, "phrase": "unsteady_environments"}, {"score": 0.004739630859016419, "phrase": "tethered_mav"}, {"score": 0.0046069985410261746, "phrase": "moving_platform"}, {"score": 0.004563613939245774, "phrase": "present_study"}, {"score": 0.004506399797123487, "phrase": "risky_and_daunting_tasks"}, {"score": 0.00433900667918111, "phrase": "tethered_micro-air_vehicle"}, {"score": 0.003764603272900618, "phrase": "rotating_platform"}, {"score": 0.0035678974387440914, "phrase": "ground_height"}, {"score": 0.003500945350055404, "phrase": "moving_ground"}, {"score": 0.002788823648033457, "phrase": "\"optic_flow_regulation"}, {"score": 0.0027625134766418266, "phrase": "altitude_control"}, {"score": 0.002719212119462965, "phrase": "former_approach"}, {"score": 0.0026597250663309385, "phrase": "robot's_landing_target"}, {"score": 0.002634629612115397, "phrase": "target's_elevation_angle"}, {"score": 0.002585144987720461, "phrase": "second_feedback_loop"}, {"score": 0.002544616720630384, "phrase": "robot's_pitch"}, {"score": 0.0024889396846235, "phrase": "smooth_landing"}, {"score": 0.002321744299010337, "phrase": "unpredictable_changes"}, {"score": 0.0022637650216685906, "phrase": "explicit_knowledge"}], "paper_keywords": ["Biomimetics", " Optic flow", " Unsteady environments", " Unmanned aerial systems", " Decking", " Honeybees", " MAV", " Aerial Robot"], "paper_abstract": "The present study deals with the risky and daunting tasks of flying and landing in non-stationary environments. Using a two Degree-Of-Freedom (DOF) tethered micro-air vehicle (MAV), we show the benefits of an autopilot dealing with a variable - the optic flow - which depends directly on two relative variables, the groundspeed and the groundheight. The micro-helicopter was shown to follow the ups and downs of a rotating platform that was also oscillated vertically. At no time did the MAV know in terms of ground height whether it was approaching the moving ground or whether the ground itself was rising to it dangerously. Nor did it know whether its current groundspeed was caused only by its forward thrust or whether it was partly due to the ground moving backwards or forwards. Furthermore, the MAV was shown to land safely on a platform set into motion along two directions, vertical and horizontal. This paper extends to non-stationary environments a former approach that introduced the principle of \"optic flow regulation\" for altitude control. Whereas in the former approach no requirement was set on the robot's landing target, the target's elevation angle was used here in a second feedback loop that gradually altered the robot's pitch and therefore its airspeed, leading to smooth landing in the vicinity of the target. Whether dealing with terrain following or landing, the MAV followed followed appropriately the unpredictable changes in the environment although it had no explicit knowledge of groundheight and groundspeed. The MAV did not make use of any rangefinders or velocimeters and was simply equipped with a 2-gram vision-based autopilot.", "paper_title": "Optic Flow Regulation in Unsteady Environments: A Tethered MAV Achieves Terrain Following and Targeted Landing Over a Moving Platform", "paper_id": "WOS:000356816000008"}