{"auto_keywords": [{"score": 0.04877129670463601, "phrase": "maiorana-mcfarland_functions"}, {"score": 0.015719716506582538, "phrase": "time-memory-data_trade-off_attack"}, {"score": 0.012449924643536545, "phrase": "toyocrypt"}, {"score": 0.011516960944791333, "phrase": "lfsr"}, {"score": 0.010507489578808505, "phrase": "stream_ciphers"}, {"score": 0.009071478383026358, "phrase": "filter_functions"}, {"score": 0.004451603663063258, "phrase": "tmd"}, {"score": 0.0038756055612167942, "phrase": "mihaljevic"}, {"score": 0.0038399661178692306, "phrase": "imai"}, {"score": 0.003683565150278339, "phrase": "filter_function"}, {"score": 0.0034368818187904744, "phrase": "maiorana-mcfarland"}, {"score": 0.0030617935728586006, "phrase": "different_maiorana-mcfarland_functions"}, {"score": 0.002652878591019016, "phrase": "filter-combiner_stream_ciphers"}, {"score": 0.0024522530645471065, "phrase": "vector_output"}, {"score": 0.002164264600379492, "phrase": "extra_speed"}, {"score": 0.0021049977753042253, "phrase": "additional_weaknesses"}], "paper_keywords": ["time-memory-data trade-off attack", " Maiorana-McFarland functions"], "paper_abstract": "In this paper, we present the time-memory-data (TMD) trade-off attack on stream ciphers filter function generators and filter cominers based on Maiorana-McFarland functions. This can be considered as a generalization of the time-memory-data trade-off attack of Mihaljevic and Imai on Toyocrypt. First, we substitute the filter function in Toyocrypt (which has the same size as the LFSR) with it general Maiorana-McFarland function. This allows us to apply the attack to it wider class of stream ciphers. Second, we highlight how the choice of different Maiorana-McFarland functions can affect the effectiveness of our attack. Third, we show, that the attack can be modified to apply on filter functions which are smaller than the LFSR and on filter-combiner stream ciphers. This allows us to cryptanalyze other configurations commonly found in practice. Finally, filter functions with vector output are sometimes used in stream ciphers to improve the throughput. Therefore the case when the Maiorana-McFarland functions have vector output is investigated. We found that the extra speed comes at the price of additional weaknesses which make the attacks easier.", "paper_title": "Time-Memory-Data Trade-Off Attack on Stream Ciphers Based on Maiorana-McFarland Functions", "paper_id": "WOS:000263078800003"}