{"auto_keywords": [{"score": 0.049465088868450476, "phrase": "semantic_similarity"}, {"score": 0.006453863325849241, "phrase": "concept_space"}, {"score": 0.00481495049065317, "phrase": "compute_term_similarity"}, {"score": 0.0045726187330434025, "phrase": "text_analytics"}, {"score": 0.004533427352547707, "phrase": "understanding_applications"}, {"score": 0.004106063237069123, "phrase": "existing_approaches"}, {"score": 0.0036395944934310524, "phrase": "existing_techniques"}, {"score": 0.0035620354052144656, "phrase": "efficient_and_effective_approach"}, {"score": 0.003471135453226184, "phrase": "large_scale_semantic_network"}, {"score": 0.003426556090707852, "phrase": "semantic_network"}, {"score": 0.003324743991757282, "phrase": "web_documents"}, {"score": 0.0031166151196841308, "phrase": "semantic_relationships"}, {"score": 0.0027741761880779535, "phrase": "clustering_approach"}, {"score": 0.002622947550220266, "phrase": "similarity_measure"}, {"score": 0.002555950807368337, "phrase": "extensive_studies"}, {"score": 0.0023145690608400425, "phrase": "pearson_correlation_coefficient"}, {"score": 0.0022073031056287886, "phrase": "competing_algorithms"}, {"score": 0.0021049977753042253, "phrase": "large_scale"}], "paper_keywords": ["Term similarity", " multi-word expression", " clustering", " semantic network"], "paper_abstract": "Measuring semantic similarity between two terms is essential for a variety of text analytics and understanding applications. Currently, there are two main approaches for this task, namely the knowledge based and the corpus based approaches. However, existing approaches are more suitable for semantic similarity between words rather than the more general multi-word expressions (MWEs), and they do not scale very well. Contrary to these existing techniques, we propose an efficient and effective approach for semantic similarity using a large scale semantic network. This semantic network is automatically acquired from billions of web documents. It consists of millions of concepts, which explicitly model the context of semantic relationships. In this paper, we first show how to map two terms into the concept space, and compare their similarity there. Then, we introduce a clustering approach to orthogonalize the concept space in order to improve the accuracy of the similarity measure. Finally, we conduct extensive studies to demonstrate that our approach can accurately compute the semantic similarity between terms of MWEs and with ambiguity, and significantly outperforms 12 competing methods under Pearson Correlation Coefficient. Meanwhile, our approach is much more efficient than all competing algorithms, and can be used to compute semantic similarity in a large scale.", "paper_title": "A Large Probabilistic Semantic Network Based Approach to Compute Term Similarity", "paper_id": "WOS:000361245300002"}