{"auto_keywords": [{"score": 0.03648530308667908, "phrase": "risk_factors"}, {"score": 0.008273867578704073, "phrase": "risk_factor_identification"}, {"score": 0.004759635663291431, "phrase": "interdependent_information"}, {"score": 0.003755307753574745, "phrase": "existing_studies"}, {"score": 0.003031650815900696, "phrase": "literature_review"}, {"score": 0.00282822695516646, "phrase": "relative_analysis"}, {"score": 0.0022828113789751694, "phrase": "proposed_method"}, {"score": 0.0022176487309947266, "phrase": "illustrative_example"}, {"score": 0.0021794454466797382, "phrase": "chinese_resource_company"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Risk factor identification", " IT outsourcing", " Interrelationship", " Decision Making Trial and Evaluation Laboratory (DEMATEL)", " 2-Tuple"], "paper_abstract": "Risk factor identification of IT outsourcing is significant to capture the source of IT outsourcing risk. Risk factors of IT outsourcing are often interdependent, and consequently the interrelationships among factors affect risk factor identification, whereas this fact is neglected in the existing studies. The purpose of this paper is to investigate a method for identifying risk factors of IT outsourcing, in which the interrelationships among risk factors are considered. Firstly, the risk factors of IT outsourcing are figured out through literature review and expert interview. Then, the interrelationships among risk factors and relative analysis are given. Furthermore, based on the 2-tuple fuzzy linguistic representation model and the classical Decision Making Trial and Evaluation Laboratory (DEMATEL) method, an extended DEMATEL method is developed to identify the importance together with the classification of risk factors. Finally, the potential of the proposed method is shown through an illustrative example of a Chinese resource company. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Identifying risk factors of IT outsourcing using interdependent information: An extended DEMATEL method", "paper_id": "WOS:000297823300167"}