{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "heat_transfer"}, {"score": 0.04970198387475844, "phrase": "fluid_flow"}, {"score": 0.015415373978335607, "phrase": "obstructed_channel"}, {"score": 0.015295267497080496, "phrase": "lattice_boltzmann_method"}, {"score": 0.008725146906924223, "phrase": "nearest_walls"}, {"score": 0.004646654984830476, "phrase": "purpose_-_the_purpose"}, {"score": 0.00450198136261303, "phrase": "laminar_flow"}, {"score": 0.004396426822203258, "phrase": "two-dimensional_horizontal_channel"}, {"score": 0.004176102823067887, "phrase": "numerical_scheme"}, {"score": 0.004014135205423942, "phrase": "finite_difference_method"}, {"score": 0.003738200814271716, "phrase": "temperature_fields"}, {"score": 0.003664963414801933, "phrase": "complex_structure"}, {"score": 0.0034811680446852054, "phrase": "unsteady_flow"}, {"score": 0.0030791137853734152, "phrase": "van_karman"}, {"score": 0.0030427525339358935, "phrase": "complex_binary_vortex_street"}, {"score": 0.002627985415362773, "phrase": "great_influence"}, {"score": 0.0022250978492127163, "phrase": "natural_convection"}, {"score": 0.0021049977753042253, "phrase": "mrt_lattice_boltzmann_equation_model"}], "paper_keywords": ["Laminar flow", " Heat transfer", " Velocity", " Temperature"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the laminar flow and heat transfer characteristics in a two-dimensional horizontal channel with two square blocks placed side-by-side using a numerical scheme based on a coupling between the lattice Boltzmann method and the finite difference method. Design/methodology/approach - The multiple-relaxation-time (MRT) lattice Boltzmann equation model coupled with the finite difference method are used to predict numerically the velocity and the temperature fields. Findings - A complex structure of the fluid flow was observed for various dimensionless block separation distance (G). An unsteady flow was found when the two blocks are placed side by side (G = 0). For G < 1.5, the presence of each block develops the street of Van Karman which generates complex binary vortex street. In the opposite case (G > 1.5), the effect of this parameter (G) on the fluid is reduced, whereas, the distance between the blocks and the nearest walls have a great influence on the fluid flow and the heat transfer. When the obstacles are posed on the walls (G = 3), an important heat exchange between the blocks and the nearest walls is noted. Originality/value - This study offers more knowledge on natural convection in an obstructed channel. Furthermore, this work shows the effectiveness of the MRT lattice Boltzmann equation model for this kind of geometry.", "paper_title": "Computation of heat transfer and fluid flow in an obstructed channel using lattice Boltzmann method", "paper_id": "WOS:000277296900005"}