{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_science"}, {"score": 0.041963568229680705, "phrase": "human_processes"}, {"score": 0.035876207211546295, "phrase": "hierarchy_theory"}, {"score": 0.003974349782102708, "phrase": "semantic_and_social_innovation"}, {"score": 0.003858697684681798, "phrase": "biological_interpretence"}, {"score": 0.003441352119167824, "phrase": "complex_achievement"}, {"score": 0.0032800186243040663, "phrase": "everyday_definition"}, {"score": 0.0031727643282003976, "phrase": "different_levels"}, {"score": 0.002343271162668978, "phrase": "human_reality"}, {"score": 0.0022749744354271816, "phrase": "dynamical_processes"}, {"score": 0.0022498783454674254, "phrase": "symbiotic_relationship"}], "paper_keywords": ["Hierarchy theory", " Complexity theory", " Process philosophy", " Natural philosophy", " Hierarchies of action", " Complex systems", " Libraries", " Information science"], "paper_abstract": "Purpose - The purpose of this paper is to bring the concept of a \"hierarchy of action\", as it is currently being used in other fields, into library and information science (LIS). Design/methodology/approach - Hierarchy theory is adopted to describe three hierarchies of action, which include the human processes of semantic and social innovation, as well as a system of biological interpretence, from which human processes are thought to have evolved as a development of biosemiosis in nature. By way of example, it is argued that a text is a complex achievement, and hierarchy theory shows how to account for this complexity; the everyday definition of \"text\" is augmented with accounts from different levels of observation. Findings - The concept of a hierarchy of action enables a person to account for a text as a meaning/symbolic product; include in that account the processes whereby texts are produced and used; and say why these processes are important to the health of the biosphere that is called home. Originality/value - \"Hierarchy of action\" has been developed as a concept in biology and ecology; it belongs to a way of thinking whereby human reality, like nature, is construed as dynamical processes operating in symbiotic relationship with each other; it has not yet been adopted in US with reference to hierarchy theory and its potential is yet to be explored.", "paper_title": "Hierarchies of action: a concept for library and information science", "paper_id": "WOS:000294831600007"}