{"auto_keywords": [{"score": 0.049692788583269344, "phrase": "frequent_patterns"}, {"score": 0.028198276166246455, "phrase": "interactive_mining"}, {"score": 0.014508864719127783, "phrase": "minimum_support_threshold"}, {"score": 0.008917680110635883, "phrase": "mining_process"}, {"score": 0.00784580208559772, "phrase": "appropriate_value"}, {"score": 0.004988306806596756, "phrase": "mining_model"}, {"score": 0.004661446705304497, "phrase": "increasing_number"}, {"score": 0.0046238380150870435, "phrase": "efficient_algorithms"}, {"score": 0.00386876598761639, "phrase": "real-time_applications"}, {"score": 0.003822003373331997, "phrase": "web_mining"}, {"score": 0.00374531366198605, "phrase": "new_correlations"}, {"score": 0.003567455727660992, "phrase": "mining_algorithms"}, {"score": 0.003107935254560724, "phrase": "transaction_database"}, {"score": 0.00303319936111073, "phrase": "database_rescanning"}, {"score": 0.0029244418026475832, "phrase": "new_method"}, {"score": 0.0028890603352364273, "phrase": "prime_number"}, {"score": 0.002466139325703204, "phrase": "mining_algorithm"}, {"score": 0.00241658945942583, "phrase": "candidate_patterns"}, {"score": 0.00235843888868088, "phrase": "new_candidate"}, {"score": 0.0022371907579775796, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data mining", " Frequent pattern mining", " Interactive mining", " Prime number"], "paper_abstract": "Over the past decade, an increasing number of efficient algorithms have been proposed to mine frequent patterns by satisfying the minimum support threshold. Generally, determining an appropriate value for minimum support threshold is extremely difficult. This is because the appropriate value depends on the type of application and expectation of the user. Moreover, in some real-time applications such as web mining and e-business, finding new correlations between patterns by changing the minimum support threshold is needed. Since rerunning mining algorithms from scratch is very costly and time-consuming, researchers have introduced interactive mining of frequent patterns. Recently, a few efficient interactive mining algorithms have been proposed, which are able to capture the content of transaction database to eliminate possibility of the database rescanning. In this paper, we propose a new method based on prime number and its characteristics mainly for interactive mining of frequent patterns. Our method isolates the mining model from the mining process such that once the mining model is constructed; it can be frequently used by mining process with various minimum support thresholds. During the mining process, the mining algorithm reduces the number of candidate patterns and comparisons by using a new candidate set called candidate head set and several efficient pruning techniques. The experimental results verify the efficiency of our method for interactive mining of frequent patterns. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Efficient prime-based method for interactive mining of frequent patterns", "paper_id": "WOS:000292169500072"}