{"auto_keywords": [{"score": 0.03423057083405171, "phrase": "proposed_action"}, {"score": 0.029765824610901187, "phrase": "critical_questions"}, {"score": 0.00481495049065317, "phrase": "argument-based_model"}, {"score": 0.004597622380240611, "phrase": "heterogeneous_agents"}, {"score": 0.004481132747216135, "phrase": "critical_actions"}, {"score": 0.004278807087784626, "phrase": "mediator_agent"}, {"score": 0.004085579055228594, "phrase": "participating_agents"}, {"score": 0.00374399358035391, "phrase": "submitted_arguments"}, {"score": 0.003413284742632989, "phrase": "accepted_arguments"}, {"score": 0.0030957429853133147, "phrase": "main_focus"}, {"score": 0.0029255474957478474, "phrase": "reasoning_patterns"}, {"score": 0.002836679611901583, "phrase": "argument_schemes"}, {"score": 0.0023694065215394593, "phrase": "highly_focused_deliberation"}, {"score": 0.002193447487477984, "phrase": "previous_similar_deliberations"}, {"score": 0.0021049977753042253, "phrase": "evidential_basis"}], "paper_keywords": ["Argumentation", " Argument schemes", " Deliberation", " Multi-agent systems"], "paper_abstract": "In this paper we present the argument-based model proCLAIM, intended to provide a setting for heterogeneous agents to deliberate over safety critical actions. To achieve this purpose proCLAIM features a Mediator Agent with three main tasks: (1) guiding the participating agents in what their valid dialectical moves are at each stage of the dialogue; (2) deciding whether submitted arguments should be accepted on the basis of their relevance; and finally, (3) evaluating the accepted arguments in order to provide an assessment of whether the proposed action should or should not be undertaken. The main focus in this paper is the proposal of a set of reasoning patterns, represented in terms of argument schemes and critical questions, intended to automatise deliberations on whether a proposed action can safely be performed. We aim to motivate the importance of these schemes and critical questions for: (a) the Mediator Agent's guiding task that allows for a highly focused deliberation; (b) the effective participation of heterogeneous agents; and (c) enabling the reuse of previous similar deliberations in order to evaluate arguments on an evidential basis.", "paper_title": "Deliberation dialogues for reasoning about safety critical actions", "paper_id": "WOS:000302475800001"}