{"auto_keywords": [{"score": 0.03137897248280789, "phrase": "virtual_screening"}, {"score": 0.00481495049065317, "phrase": "different_templates"}, {"score": 0.0047268728636719725, "phrase": "antagonist_discovery"}, {"score": 0.004555499634179394, "phrase": "unusual_g-protein"}, {"score": 0.003966162568548304, "phrase": "tethered_ligand"}, {"score": 0.003787108326100196, "phrase": "multiple_downstream_signaling_pathways"}, {"score": 0.0035828427627676075, "phrase": "moderate_potency"}, {"score": 0.0034210342328868017, "phrase": "sequence_homology"}, {"score": 0.003389557201018519, "phrase": "known_crystal_structures"}, {"score": 0.003358368814209542, "phrase": "bovine_rhodopsin"}, {"score": 0.0030196181347744372, "phrase": "potential_interactions"}, {"score": 0.002896535621940078, "phrase": "chembridge_database"}, {"score": 0.0023198180380964305, "phrase": "multiple_homology_models"}, {"score": 0.0022563011263787847, "phrase": "structurally_diverse_antagonists"}, {"score": 0.0021049977753042253, "phrase": "target_protein"}], "paper_keywords": [""], "paper_abstract": "Protease activated receptor 2 (PAR2) is an unusual G-protein coupled receptor (GPCR) involved in inflammation and metabolism. It is activated through cleavage of its N-terminus by proteases. The new N-terminus functions as a tethered ligand that folds back and intramolecularly activates PAR2, initiating multiple downstream signaling pathways. The only compounds reported to date to inhibit PAR2 activation are of moderate potency. Three structural models for PAR2 have been constructed based on sequence homology with known crystal structures for bovine rhodopsin, human ORL-1 (also called nociceptin/orphanin FQ receptor), and human PAR1 The three PAR2 model structures were compared and used to predict potential interactions with ligands. Virtual screening for ligands using the Chembridge database, and either ORL-1 or PAR1 derived PAR2 models led to identification of eight new small molecule PAR2 antagonists (IC50 10-100 mu M). Notably, the most potent compound 1 (IC50 11 mu M) was derived from the less homologous template protein, human ORL-1. The results suggest that virtual screening against multiple homology models of the same GPCR can produce structurally diverse antagonists and that this may be desirable even when some models have less sequence homology with the target protein.", "paper_title": "Three Homology Models of PAR2 Derived from Different Templates: Application to Antagonist Discovery", "paper_id": "WOS:000356903200011"}