{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_media"}, {"score": 0.02089732097380989, "phrase": "structured_analytics"}, {"score": 0.0045726187330434025, "phrase": "online_community"}, {"score": 0.004035946043145475, "phrase": "social_media_use"}, {"score": 0.003267925215811654, "phrase": "social_media_content"}, {"score": 0.002985130390111069, "phrase": "analytics_algorithms"}, {"score": 0.002934098412396701, "phrase": "explicit_link-based_relationships"}, {"score": 0.0029089095588612007, "phrase": "implicit_behavior-based_relationships"}, {"score": 0.0027150087516999047, "phrase": "social_interactions"}, {"score": 0.0026116610153271943, "phrase": "data_mining_and_database_perspectives"}, {"score": 0.0025449518236394103, "phrase": "general_overview"}, {"score": 0.0022749744354271816, "phrase": "mining_task"}, {"score": 0.002236055625099805, "phrase": "algorithmic_solutions"}, {"score": 0.0021883400011393564, "phrase": "real_datasets"}, {"score": 0.0021416404045850224, "phrase": "open_problems"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": [""], "paper_abstract": "The rise of social media has turned the Web into an online community where people connect, communicate, and collaborate with each other. Structured analytics in social media is the process of discovering the structure of the relationships emerging from this social media use. It focuses on identifying the users involved, the activities they undertake, the actions they perform, and the items (e.g., movies, restaurants, blogs, etc.) they create and interact with. There are two key challenges facing these tasks: how to organize and model social media content, which is often unstructured in its raw form, in order to employ structured analytics on it; and how to employ analytics algorithms to capture both explicit link-based relationships and implicit behavior-based relationships. In this tutorial, we systemize and summarize the research so far in analyzing social interactions between users and items in the Web from data mining and database perspectives. We start with a general overview of the topic, including discourse to various exciting and practical applications. Then, we discuss the state-of-art for modeling the data, formalizing the mining task, developing the algorithmic solutions, and evaluating on real datasets. We also emphasize open problems and challenges for future research in the area of structured analytics and social media.", "paper_title": "Structured Analytics in Social Media", "paper_id": "WOS:000386424800099"}