{"auto_keywords": [{"score": 0.043069853910456694, "phrase": "energy_savings"}, {"score": 0.014074412951864002, "phrase": "eeom"}, {"score": 0.00875687434851322, "phrase": "optical_back-end"}, {"score": 0.008242192219324514, "phrase": "fiwi"}, {"score": 0.006559853122370323, "phrase": "woes_scheme"}, {"score": 0.00503579715599135, "phrase": "energy_consumption"}, {"score": 0.00462919213721188, "phrase": "significant_technical_issue"}, {"score": 0.004596192494271827, "phrase": "academic_and_industrial_community"}, {"score": 0.00441883624011048, "phrase": "total_energy_consumption"}, {"score": 0.004324985524216987, "phrase": "promising_access_technique"}, {"score": 0.004217998654053147, "phrase": "cost-effective_broadband_access"}, {"score": 0.004084307764140389, "phrase": "previous_works"}, {"score": 0.003802135020791801, "phrase": "passive_optical_network"}, {"score": 0.0036684182697540382, "phrase": "wireless_rerouting"}, {"score": 0.0031788080316930687, "phrase": "energy_waste"}, {"score": 0.0029169007179202164, "phrase": "energy-efficient_onu_management"}, {"score": 0.00266693888510356, "phrase": "low-load_onus"}, {"score": 0.002455889980202819, "phrase": "onus_states"}, {"score": 0.0024296194239886676, "phrase": "eatc"}, {"score": 0.0023950275815082297, "phrase": "wireless_topology"}, {"score": 0.0023609270767241215, "phrase": "idle_radio_interfaces"}, {"score": 0.0023189818169615135, "phrase": "standby_state"}, {"score": 0.002253410447951689, "phrase": "wireless_front-end"}, {"score": 0.0021049977753042253, "phrase": "end-to-end_delay"}], "paper_keywords": ["Fiber-Wireless (FiWi) network", " energy savings", " ONU sleep", " radio interface standby"], "paper_abstract": "Energy savings in Internet have been regarded as a significant technical issue for academic and industrial community. Particularly, access network accounts for more than 70% of the total energy consumption of Internet. As a promising access technique, Fiber-Wireless (FiWi) network not only enables the cost-effective broadband access, but also provides more opportunities for energy savings. Previous works mostly focused on the energy savings in the optical back-end of FiWi. Generally, they extended the Optical Network Unit (ONU) sleep mechanisms initially designed for Passive Optical Network (PON) to FiWi by combining with the wireless rerouting. However, most of these works left the energy savings in the wireless front-end untouched. In fact, when one or more ONUs in the network is/are sleeping, many wireless components remain idle or underutilized which cause a lot of energy waste. Motivated by this, we propose a new integrated Wireless-Optical Energy Savings (WOES) scheme for the comprehensive energy savings in FiWi. The WOES scheme consists of two interactive modules, Energy-Efficient ONU Management (EEOM) and Energy-Aware Topology Configuration (EATC). EEOM aims at the energy savings in the optical back-end by putting the low-load ONUs into sleep state. A pair of thresholds is introduced into EEOM to maintain the states of ONUs. As soon as ONUs states change, EATC will reconfigure the wireless topology by putting the idle Radio Interfaces (RIs) into standby state, thus minimizing the energy consumption of the wireless front-end. Simulation results show that the WOES scheme can reduce the energy consumption significantly with just a little performance degradation in network throughput and end-to-end delay.", "paper_title": "A new integrated energy-saving scheme in green Fiber-Wireless (FiWi) access network", "paper_id": "WOS:000339228800007"}