{"auto_keywords": [{"score": 0.048342791832576656, "phrase": "interaction_effect"}, {"score": 0.04791786215360241, "phrase": "organizational_learning_strategies"}, {"score": 0.04707862248234479, "phrase": "organizational_performance"}, {"score": 0.004555499634179394, "phrase": "environmental_characteristics"}, {"score": 0.004231089088705995, "phrase": "learning_strategies"}, {"score": 0.004077616905584829, "phrase": "computational_model"}, {"score": 0.0038935506745975835, "phrase": "theoretical_propositions"}, {"score": 0.0037696519417841287, "phrase": "population_ecology_perspective"}, {"score": 0.0035663245542174224, "phrase": "different_environmental_conditions"}, {"score": 0.003389557201018519, "phrase": "simulation_model"}, {"score": 0.002843450389745497, "phrase": "simulation_results"}, {"score": 0.0027913353347879507, "phrase": "five_propositions"}, {"score": 0.002714943351733626, "phrase": "different_learning_strategies"}, {"score": 0.0024522530645471065, "phrase": "population_level"}, {"score": 0.002407290605654707, "phrase": "environmental_turbulence"}, {"score": 0.002341384304635523, "phrase": "exploitative_adaptation"}, {"score": 0.0022458849724980904, "phrase": "different_consequences"}, {"score": 0.002225196379204285, "phrase": "competing_organizations"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Ambidexterity", " Environmental turbulence", " Exploitation", " Exploration", " Population density"], "paper_abstract": "There has been increasing interest in the interaction effect between organizational learning strategies and environmental characteristics on organizational performance. However, the interaction effect as well as the effect of competition among learning strategies has rarely been investigated comprehensively through a computational model. The purpose of this paper is to develop theoretical propositions that incorporate both the organizational learning perspective and the population ecology perspective with regard to whether the effect of organizational learning strategies is contingent on different environmental conditions under which they compete with one another. In the simulation model, we considered four competing learning strategies: pure exploitation, pure exploration, and structural and temporal ambidexterity. We also considered two environmental characteristics: population density and turbulence, where turbulence was defined in two ways. Based on the simulation results, we developed five propositions. The discussion suggests that different learning strategies may be related to different within-group variance of performance, indicating the importance of considering organizational performance at both organization and population level. Also, environmental turbulence that affects the efficacy of exploitative adaptation and the shape of a niche may have different consequences on competing organizations. We concluded by discussing the limitations of this study and future research.", "paper_title": "Environmental turbulence, density, and learning strategies: when does organizational adaptation matter?", "paper_id": "WOS:000363967000005"}