{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "characteristic_curve"}, {"score": 0.004423061344624088, "phrase": "widely_used_measure"}, {"score": 0.004299621153829837, "phrase": "classification_rules"}, {"score": 0.003971938976270902, "phrase": "individual_objects"}, {"score": 0.0038392331564122387, "phrase": "area_under_the_receiver_operating_characteristic_curve"}, {"score": 0.003332210257373994, "phrase": "earlier_work"}, {"score": 0.0031131208154718867, "phrase": "cost-based_interpretation"}, {"score": 0.0029920129598858545, "phrase": "fundamental_property"}, {"score": 0.0027480831196871093, "phrase": "additional_information"}, {"score": 0.002671263324230699, "phrase": "class_assignments"}, {"score": 0.0023713273141757326, "phrase": "coherent_measure"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Area under the curve", " Classification", " Gini coefficient", " ROC curve", " Screening"], "paper_abstract": "The area under the receiver operating characteristic curve is a widely used measure of the performance of classification rules. This paper shows that when classifications are based solely on data describing individual objects to be classified, the area under the receiver operating characteristic curve is an incoherent measure of performance, in the sense that the measure itself depends on the classifier being measured. It significantly extends earlier work by showing that this incoherence is not a consequence of a cost-based interpretation of misclassifications, but is a fundamental property of the area under the curve itself. The paper also shows that if additional information, such as the class assignments of other objects, is taken into account when making a classification, then the area under the curve is a coherent measure, although in those circumstances it makes an assumption which is seldom if ever appropriate. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "When is the area under the receiver operating characteristic curve an appropriate measure of classifier performance?", "paper_id": "WOS:000316425800007"}