{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "ordered_flow"}, {"score": 0.004774115617883476, "phrase": "work_and_technologies"}, {"score": 0.0047135086583390585, "phrase": "knowledge_management"}, {"score": 0.004594582559945568, "phrase": "observational_studies"}, {"score": 0.004516962628112147, "phrase": "participatory_prototype_design"}, {"score": 0.004402973626416765, "phrase": "hospital_domain"}, {"score": 0.004255431326383001, "phrase": "unified_view"}, {"score": 0.004201381218977942, "phrase": "high-level_functionalities"}, {"score": 0.0031440159350875057, "phrase": "dynamic_relationships"}, {"score": 0.003038532168038562, "phrase": "artifact's_affordances"}, {"score": 0.0027078974645805736, "phrase": "\"positive\"_reaction"}, {"score": 0.0026282000779095987, "phrase": "augmented_artifacts"}, {"score": 0.002583713580625699, "phrase": "knowledgeable_behaviors"}, {"score": 0.0024547103576350233, "phrase": "prototypical_technology"}, {"score": 0.002215663255682209, "phrase": "unusual_interpretation"}, {"score": 0.0021049977753042253, "phrase": "computer-based_technology"}], "paper_keywords": ["affording mechanism", " Hospital work", " Affordance", " dynamic affordance", " coordination mechanism", " Knowledge artifact", " ProDoc"], "paper_abstract": "In this paper we question the separation between technologies that support information and handle the ordered flow of work and technologies that support knowledge management. On the basis of observational studies and initiatives of participatory prototype design that we performed in the hospital domain and other cooperative work settings, the paper proposes a unified view of these high-level functionalities through the notion of Affording Mechanism. In order to clarify the implications for design, the paper discusses the relationships between knowledge and representations; the role of artifacts that are used in activities where knowledge is allegedly \"produced, shared and consumed\"; and finally the notion of affordance and its dynamics. In very general terms, an AM consists of an artifact and of dynamic relationships between the context of use and the artifact's affordances, expressed in terms of simple if-then constructs. The affordances conveyed through and by the artifact are modulated in order to evoke a \"positive\" reaction in the actors who use these augmented artifacts and to support knowledgeable behaviors apt to the situation. Moreover, the paper illustrates a prototypical technology through examples derived from the studies mentioned above, and discusses the kind of support this application provides in the light of an unusual interpretation of what it might mean to \"manage\" knowledge through computer-based technology.", "paper_title": "Affording Mechanisms: An Integrated View of Coordination and Knowledge Management", "paper_id": "WOS:000301786300004"}