{"auto_keywords": [{"score": 0.038495110929304084, "phrase": "hiss"}, {"score": 0.015578409047312749, "phrase": "group_communication"}, {"score": 0.009336654807375108, "phrase": "customary_platforms"}, {"score": 0.00481495049065317, "phrase": "group_rekeying"}, {"score": 0.004706305193222972, "phrase": "suitable_and_effective_communication_model"}, {"score": 0.004663533386096864, "phrase": "large-scale_distributed_systems"}, {"score": 0.004237138632255772, "phrase": "group_key"}, {"score": 0.003265591844292821, "phrase": "rekeying_cost"}, {"score": 0.003148316319108045, "phrase": "group_size"}, {"score": 0.002926212333939311, "phrase": "memory_occupancy"}, {"score": 0.0028995712226514746, "phrase": "computational_overhead"}, {"score": 0.0027322025124213566, "phrase": "first-class_attack"}, {"score": 0.0025744696954056404, "phrase": "total_group_recovery"}, {"score": 0.002527788827701828, "phrase": "collusion_recovery"}, {"score": 0.0024706232839499546, "phrase": "attack_severity"}, {"score": 0.0021049977753042253, "phrase": "collusion_attacks"}], "paper_keywords": ["security", " key management", " group communication"], "paper_abstract": "Group communication is a suitable and effective communication model for large-scale distributed systems. To be fully exploitable, group communication must be protected. This is normally achieved by providing members with a group key which is revoked and redistributed upon every member's joining (backward security) or leaving (forward security). Such a rekeying process must be efficient and highly scalable. In this paper, we present HISS, a highly scalable group rekeying scheme that efficiently rekeys the group into two broadcast rekeying messages. HISS features two novel contributions. First, it exhibits a rekeying cost which is constant and independent of the group size, thus being highly scalable with the number of users. At the same time, memory occupancy and computational overhead are affordable on customary platforms. Second, HISS considers collusion as a first-class attack and recovers the group in such a way that it does not require a total group recovery. Efficiency of collusion recovery gracefully decreases with the attack severity. We prove the correctness of HISS, analytically evaluate its performance and argue that it is deployable on customary platforms. Finally, we show that it is possible to practically contrast or even prevent collusion attacks by properly allocating users to subgroups.", "paper_title": "HISS: A HIghly Scalable Scheme for Group Rekeying", "paper_id": "WOS:000316958200007"}