{"auto_keywords": [{"score": 0.05007844442530217, "phrase": "multiagent_reinforcement_learning"}, {"score": 0.036726151122533655, "phrase": "marl"}, {"score": 0.004772593750252861, "phrase": "multiagent_systems"}, {"score": 0.004070573090297285, "phrase": "preprogrammed_agent_behaviors"}, {"score": 0.0036445446531633368, "phrase": "multiagent_learning_concerns_reinforcement_learning_techniques"}, {"score": 0.00354909279546064, "phrase": "comprehensive_survey"}, {"score": 0.00342568771304873, "phrase": "central_issue"}, {"score": 0.003335948601271999, "phrase": "formal_statement"}, {"score": 0.0032919615578986816, "phrase": "multiagent_learning_goal"}, {"score": 0.0032629585038738856, "phrase": "different_viewpoints"}, {"score": 0.0029471818883482688, "phrase": "changing_behavior"}, {"score": 0.0028699415886017468, "phrase": "marl_algorithms"}, {"score": 0.0028195727965553367, "phrase": "literature_aim"}, {"score": 0.002361923085067681, "phrase": "specific_issues"}, {"score": 0.0021049977753042253, "phrase": "marl_techniques"}], "paper_keywords": ["distributed control", " game theory", " multiagent systems", " reinforcement learning"], "paper_abstract": "Multiagent systems are rapidly finding applications in a variety of domains, including robotics, distributed control, telecommunications, and economics. The complexity of many tasks arising in these domains makes them difficult to solve with preprogrammed agent behaviors. The agents must, instead, discover a solution on their own, using learning. A significant part of the research on multiagent learning concerns reinforcement learning techniques. This paper provides a comprehensive survey of multiagent reinforcement learning (MARL). A central issue in the field is the formal statement of the multiagent learning goal. Different viewpoints on this issue have led to the proposal of many different goals, among which two focal points can be distinguished: stability of the agents' learning dynamics, and adaptation to the changing behavior of the other agents. The MARL algorithms described in the literature aim-either explicitly or implicitly-at one of these two goals or at a combination of both, in a fully cooperative, fully competitive, or more general setting. A representative selection of these algorithms is discussed in detail in this paper, together with the specific issues that arise in each category. Additionally, the benefits and challenges of MARL are described along with some of the problem domains where the MARL techniques have been applied. Finally, an outlook for the field is provided.", "paper_title": "A comprehensive survey of multiagent reinforcement learning", "paper_id": "WOS:000253471800002"}