{"auto_keywords": [{"score": 0.04510893710314954, "phrase": "hks"}, {"score": 0.006716179976022525, "phrase": "heat_kernel"}, {"score": 0.00481495049065317, "phrase": "heat_diffusion"}, {"score": 0.004701985831087475, "phrase": "novel_point_signature"}, {"score": 0.004548253531664032, "phrase": "heat_diffusion_process"}, {"score": 0.004155742403177802, "phrase": "well-known_heat_kernel"}, {"score": 0.0036207206487324506, "phrase": "shape_tip"}, {"score": 0.003436242862104006, "phrase": "temporal_domain"}, {"score": 0.003007846011394511, "phrase": "intrinsic_geometry"}, {"score": 0.002683304054823427, "phrase": "stable_tinder_perturbations"}, {"score": 0.002570817338292482, "phrase": "natural_and_efficiently_computable_multi-scale_way"}, {"score": 0.002326304140277375, "phrase": "practical_relevance"}, {"score": 0.0022393843660697484, "phrase": "non-rigid_multi-scale_matching"}, {"score": 0.0021352776064254195, "phrase": "repeated_structure"}], "paper_keywords": [""], "paper_abstract": "We propose a novel point signature based on the properties of the heat diffusion process on a shape. Our signature, called the Heat Kernel Signature (or HKS), is obtained by restricting the well-known heat kernel to the temporal domain. Remarkably we show that tinder certain mild assumptions, HKS captures all of the information contained in the heat kernel, and characterizes the shape tip to isometry. This means that the restriction to the temporal domain, on the one hand, makes HKS much more concise and easily commensurable, while on the other hand, it preserves all of the information about the intrinsic geometry of the shape. In addition, HKS inherits many useful properties from the heat kernel, which means, in particular, that it is stable tinder perturbations of the shape. Our signature also provides a natural and efficiently computable multi-scale way to capture information about neighborhoods of a given point, which can be extremely useful in many applications. To demonstrate the practical relevance of our signature, we present several methods for non-rigid multi-scale matching based on the HKS and use it to detect repeated structure within the same shape and across a collection of shapes.", "paper_title": "A Concise and Provably Informative Multi-Scale Signature Based on Heat Diffusion", "paper_id": "WOS:000268597500014"}