{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "irrelevant_components"}, {"score": 0.012994806299539786, "phrase": "icm"}, {"score": 0.009845253134307739, "phrase": "ifc"}, {"score": 0.008535778938065054, "phrase": "traditional_cms"}, {"score": 0.007799315047996124, "phrase": "faulty_components"}, {"score": 0.004498812433096501, "phrase": "imperfect_fault_coverage"}, {"score": 0.004398094237005956, "phrase": "fault-tolerant_systems"}, {"score": 0.004348580182733617, "phrase": "single_not-covered_component_fault"}, {"score": 0.004283423748543866, "phrase": "automatic_recovery_mechanisms"}, {"score": 0.004156012879026324, "phrase": "subsystem_failure"}, {"score": 0.003956971099850658, "phrase": "coverage_models"}, {"score": 0.0037959868107895053, "phrase": "functional_dependency"}, {"score": 0.0036691380448651443, "phrase": "different_assumptions"}, {"score": 0.0034279721355412285, "phrase": "operational_but_irrelevant_component"}, {"score": 0.0029471223246724204, "phrase": "initial_system_state"}, {"score": 0.0028271058251633815, "phrase": "initially_relevant_component"}, {"score": 0.0026915366885986586, "phrase": "irrelevancy_coverage_model"}, {"score": 0.0023938516706864775, "phrase": "even_it"}, {"score": 0.002153316680437517, "phrase": "new_cost-effective_approach"}, {"score": 0.0021049977753042253, "phrase": "additional_redundancy"}], "paper_keywords": ["Imperfect fault coverage", " fault tree", " irrelevancy", " irrelevancy trigger", " coherent systems"], "paper_abstract": "This paper addresses the coverage (including identification and isolation) of irrelevant components in systems with imperfect fault coverage (IFC). In fault-tolerant systems, a single not-covered component fault may thwart the automatic recovery mechanisms, and lead to a system or subsystem failure. The models that consider the effects of IFC are known as coverage models (CMs). In traditional CMs, except those considering functional dependency (a similar concept to relevancy but with different assumptions and semantics), coverage is typically limited to faulty components regardless of their relevancies. Consequently, an operational but irrelevant component will not be isolated, and may threaten the system by its future uncovered (not-covered) failures. Although the system is generally assumed to be coherent, which implies the relevancy of each component in the initial system state, the traditional CMs do not consider the fact that an initially relevant component could become irrelevant after the failures of other components. We propose the irrelevancy coverage model (ICM) to cover the irrelevant components in addition to the faulty components. In the ICM, a component will be isolated from the system whenever it becomes irrelevant (even it is not failed), such that its future not-covered failures will not affect the system anymore. By incorporating the coverage of irrelevant components, the ICM opens up a new cost-effective approach to improve system reliability without additional redundancy.", "paper_title": "An Imperfect Fault Coverage Model With Coverage of Irrelevant Components", "paper_id": "WOS:000350865900026"}