{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "technological_performance"}, {"score": 0.010158114045004657, "phrase": "life_cycle"}, {"score": 0.008443081279734838, "phrase": "technology_life_cycle"}, {"score": 0.004387793971765289, "phrase": "science-industry_interactions"}, {"score": 0.004240116703465252, "phrase": "technology_development"}, {"score": 0.0038827100184187805, "phrase": "different_stages"}, {"score": 0.003368948014436942, "phrase": "science-industry_collaboration"}, {"score": 0.0032079813320482304, "phrase": "emerging_phases"}, {"score": 0.002951739421935396, "phrase": "industrial_partners"}, {"score": 0.0028106505443369545, "phrase": "first_phase"}, {"score": 0.002729246328390722, "phrase": "later_phases"}, {"score": 0.0024624103660827695, "phrase": "local_collaboration"}, {"score": 0.002344655708000408, "phrase": "international_dimension"}, {"score": 0.0021049977753042253, "phrase": "life_cycle_dynamics"}], "paper_keywords": [""], "paper_abstract": "Increasingly, collaboration between firms as well as science-industry interactions are being considered as important for technology development. Yet, few attempts have been made to analyze the contribution of collaboration, taking into account different stages of the technology life cycle. Our analysis, based on a panel of 197 regions in the EU-15 and Switzerland (time period 1978-2001), provides evidence that, in the field of biotechnology, science-industry collaboration contributes to better technological performance of regions both during the emerging phases (1978-1990) and the growth stages (1991-1999) of the life cycle. Collaboration between industrial partners also contributes to the technological performance of regions during the first phase but is less pronounced during later phases of the technology life cycle. Moreover, the analysis reveals that, as technologies develop over time, the impact of local collaboration is mitigated in favor of collaboration that has an international dimension. This holds true for both science-industry interactions and for collaboration between firms. In consequence, our findings underscore the relevance of incorporating life cycle dynamics (of technologies) when studying the nature and impact of collaboration on the technological performance of regions.", "paper_title": "The impact of collaboration on the technological performance of regions: time invariant or driven by life cycle dynamics?", "paper_id": "WOS:000268881700020"}