{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "marshall-olkin_bivariate_weibull_distribution"}, {"score": 0.006682762230766701, "phrase": "maximum_likelihood_estimators"}, {"score": 0.006527147634755085, "phrase": "unknown_parameters"}, {"score": 0.004739918900616927, "phrase": "em"}, {"score": 0.00404937519538515, "phrase": "univariate_weibull_distributions"}, {"score": 0.003802135020791801, "phrase": "marshall-olkin_bivariate_exponential_distribution"}, {"score": 0.003405109584265324, "phrase": "absolute_continuous_distribution_function"}, {"score": 0.0033255627814855163, "phrase": "singular_distribution_function"}, {"score": 0.00281826552772148, "phrase": "explicit_forms"}, {"score": 0.002464709648714996, "phrase": "p_em_algorithm"}, {"score": 0.002242127152093798, "phrase": "em_algorithm"}, {"score": 0.0021049977753042253, "phrase": "illustrative_purpose"}], "paper_keywords": [""], "paper_abstract": "in this paper we consider the Marshall-Olkin bivariate Weibull distribution. The Marshall-Olkin bivariate Weibull distribution is a singular distribution, whose both the marginals are univariate Weibull distributions. This is a generalization of the Marshall-Olkin bivariate exponential distribution. The cumulative joint distribution of the Marshall-Olkin bivariate Weibull distribution is a mixture of an absolute continuous distribution function and a singular distribution function. This distribution has four unknown parameters and it is observed that the maximum likelihood estimators of the unknown parameters cannot be obtained in explicit forms. In this paper we discuss about the computation of the maximum likelihood estimators of the unknown parameters using P EM algorithm. We perform some simulations to see the performances of the EM algorithm and re-analyze one data set for illustrative purpose. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Estimating the parameters of the Marshall-Olkin bivariate Weibull distribution by EM algorithm", "paper_id": "WOS:000263626700013"}