{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ict-tpck"}, {"score": 0.020411039552438823, "phrase": "tpck"}, {"score": 0.010492423738686734, "phrase": "technological_pedagogical_content_knowledge"}, {"score": 0.005783817608525517, "phrase": "proposed_models"}, {"score": 0.0043192062457764226, "phrase": "integrative_views"}, {"score": 0.004114207773386539, "phrase": "transformative_view"}, {"score": 0.00402111957601744, "phrase": "unique_body"}, {"score": 0.0038743048063966208, "phrase": "knowledge_bases"}, {"score": 0.0036797979398289584, "phrase": "ways_knowledge"}, {"score": 0.0030462566137964267, "phrase": "technology_mapping"}, {"score": 0.003002949021343299, "phrase": "situative_methodology"}, {"score": 0.002811508144760071, "phrase": "teachers'_competencies"}, {"score": 0.0027165079504297726, "phrase": "empirical_findings"}, {"score": 0.0026022472788688462, "phrase": "student_learning"}, {"score": 0.002543281384021076, "phrase": "pre-service_primary_teacher_education_course"}, {"score": 0.0024999332729520084, "phrase": "subject_effects"}, {"score": 0.002443280093773492, "phrase": "ict-tpck_competency"}, {"score": 0.0023138091498428855, "phrase": "theoretical_models"}, {"score": 0.002254892677810906, "phrase": "ict-tpck."}, {"score": 0.002197473090354134, "phrase": "baseline_data"}, {"score": 0.0021849126349043654, "phrase": "future_studies"}, {"score": 0.0021049977753042253, "phrase": "different_contexts"}], "paper_keywords": ["Evaluation methodologies", " Improving classroom teaching", " Pedagogical issues", " Teaching/learning strategies"], "paper_abstract": "In this paper, several issues regarding the epistemology of technological pedagogical content knowledge (TPCK) are first raised for the purpose of clarifying the construct. Specifically, the transformative and integrative views are juxtaposed for exploring the epistemology of TPCK, and, at the end, the transformative view is adopted concluding that TPCK is a unique body of knowledge that is constructed from the interaction of its individual contributing knowledge bases. Then, ICT-TPCK is introduced as a strand of TPCK, and is described as the ways knowledge about tools and their affordances, pedagogy, content, learners, and context are synthesized into an understanding of how particular topics that are difficult to be understood by learners or difficult to be represented by teachers can be transformed and taught more effectively with technology in ways that signify its added value. One model for the development and another for the assessment of ICT-TPCK are then discussed. Technology Mapping is proposed as a situative methodology for the development of ICT-TPCK, and three forms of assessment, namely, expert assessment, peer assessment, and self-assessment are proposed for assessing teachers' competencies to teach with technology. The paper also reports on the empirical findings of a study that was undertaken to investigate the impact of the proposed models on student learning within the context of two design tasks in a pre-service primary teacher education course. Repeated measures within-subject effects were tested and the results indicated that ICT-TPCK competency significantly improved over the course of a semester. The results of this study clearly show that the theoretical models proposed herein can positively impact the development of ICT-TPCK. Lastly, these results can be used as baseline data in future studies that may be conducted to further validate or improve the proposed models in different contexts. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Epistemological and methodological issues for the conceptualization, development, and assessment of ICT-TPCK: Advances in technological pedagogical content knowledge (TPCK)", "paper_id": "WOS:000263701900016"}