{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "video_dataset"}, {"score": 0.02409266939234132, "phrase": "face_tracks"}, {"score": 0.006082511537539129, "phrase": "different_videos"}, {"score": 0.004722408916485981, "phrase": "video_shots"}, {"score": 0.004670325028652672, "phrase": "particular_people"}, {"score": 0.004567866351326822, "phrase": "large_variations"}, {"score": 0.004471961042537045, "phrase": "six_types"}, {"score": 0.004273723657275637, "phrase": "face_recognition"}, {"score": 0.0042148594491580324, "phrase": "name_labeling"}, {"score": 0.00404306734103577, "phrase": "conventional_methods"}, {"score": 0.003588291565092195, "phrase": "single_video"}, {"score": 0.0034039393854836965, "phrase": "search_quality"}, {"score": 0.0033757067564871494, "phrase": "query_process"}, {"score": 0.003166870075748103, "phrase": "proposed_method"}, {"score": 0.0029380909574836587, "phrase": "scene_information"}, {"score": 0.002913710827597771, "phrase": "time_constriction"}, {"score": 0.002833891290347501, "phrase": "proposed_hierarchical_clustering_method"}, {"score": 0.0027716085369148434, "phrase": "organizational_structure"}, {"score": 0.0026807346783271095, "phrase": "upper_layer"}, {"score": 0.0026658806077361078, "phrase": "affinity_propagation"}, {"score": 0.0025287979714720423, "phrase": "retrieval_accuracy"}, {"score": 0.0021344590753878314, "phrase": "proposed_approach"}, {"score": 0.0021226254999878826, "phrase": "high_search_quality"}, {"score": 0.0021049977753042253, "phrase": "short_search_time"}], "paper_keywords": ["face retrieval", " face track", " video dataset", " scene clustering"], "paper_abstract": "We are interested in retrieving video shots or videos containing particular people from a video dataset. Owing to the large variations in pose, illumination conditions, occlusions, hairstyles and facial expressions, face tracks have recently been researched in the fields of face recognition, face retrieval and name labeling from videos. However, when the number of face tracks is very large, conventional methods, which match all or some pairs of faces in face tracks, will not be effective. Therefore, in this paper, an efficient method for finding a given person from a video dataset is presented. In our study, in according to performing research on face tracks in a single video, we also consider how to organize all the faces in videos in a dataset and how to improve the search quality in the query process. Different videos may include the same person; thus, the management of individuals in different videos will be useful for their retrieval. The proposed method includes the following three points. (i) Face tracks of the same person appearing for a period in each video are first connected on the basis of scene information with a time constriction, then all the people in one video are organized by a proposed hierarchical clustering method. (ii) After obtaining the organizational structure of all the people in one video, the people are organized into an upper layer by affinity propagation. (iii) Finally, in the process of querying, a remeasuring method based on the index structure of videos is performed to improve the retrieval accuracy. We also build a video dataset that contains six types of videos: films, TV shows, educational videos, interviews, press conferences and domestic activities. The formation of face tracks in the six types of videos is first researched, then experiments are performed on this video dataset containing more than 1 million faces and 218,786 face tracks. The results show that the proposed approach has high search quality and a short search time.", "paper_title": "Efficiently Finding Individuals from Video Dataset", "paper_id": "WOS:000304573100012"}