{"auto_keywords": [{"score": 0.04213965057573146, "phrase": "data_sources"}, {"score": 0.015447610491653763, "phrase": "semantic_queries"}, {"score": 0.01496945462275658, "phrase": "heterogeneous_data_sources"}, {"score": 0.01283382861671995, "phrase": "static_data_sources"}, {"score": 0.00481495049065317, "phrase": "mashup_web_data_sources"}, {"score": 0.004518442937844318, "phrase": "multi-data_source"}, {"score": 0.004502513902377422, "phrase": "fusion_approach"}, {"score": 0.004240131826179916, "phrase": "mfa"}, {"score": 0.0041074234667687875, "phrase": "dynamic_contexts"}, {"score": 0.0036942726653704213, "phrase": "active_sources"}, {"score": 0.003334309053314909, "phrase": "mashing_process"}, {"score": 0.003310813458610484, "phrase": "easy_and_fast_integration"}, {"score": 0.0029253546782349875, "phrase": "web_mashing_process"}, {"score": 0.002853808773854451, "phrase": "information_extraction"}, {"score": 0.002530359917257626, "phrase": "semantic_reconciliation"}, {"score": 0.0024423826953133844, "phrase": "conflicts_data_source"}, {"score": 0.0021501863832966966, "phrase": "real-life_application"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MashUp", " Multi-data sources", " Information extraction", " Conflicts detection", " Semantic queries"], "paper_abstract": "This paper describes a process for mashing heterogeneous data sources based on the Multi-data source Fusion Approach (MFA) (Nachouki and Quafafou, 2008 [521). The aim of MFA is to facilitate the fusion of heterogeneous data sources in dynamic contexts such as the Web. Data sources are either static or active: static data sources can be structured or semi-structured (e.g. XML documents or databases), whereas active sources are services (e.g. Web services). Our main objective is to combine (Web) data sources with a minimal effort required from the user. This objective is crucial because the mashing process implies easy and fast integration of data sources. We suppose that the user is not expert in this field but he/she understands the meaning of data being integrated. In this paper, we consider two important aspects of the Web mashing process. The first one concerns the information extraction from the Web. The results of this process are the static data sources that are used later together with services in order to create a new result/application. The second one concerns the problem of semantic reconciliation of data sources. This step consists to generate the Conflicts data source in order to improve the problem of rewriting semantic queries into sub-queries (not addressed in this paper) over data sources. We give the design of our system MDSManager. We show this process through a real-life application. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "MashUp web data sources and services based on semantic queries", "paper_id": "WOS:000285366700004"}