{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "codon_positions"}, {"score": 0.03905693992741741, "phrase": "multiple_transcripts"}, {"score": 0.004736045157669388, "phrase": "deleterious_variants"}, {"score": 0.004684157900507474, "phrase": "human_exomes"}, {"score": 0.004556901872357751, "phrase": "codon_position"}, {"score": 0.004482206282876944, "phrase": "different_or_multiple_roles"}, {"score": 0.004195418010131832, "phrase": "non-synonymous_position"}, {"score": 0.0040366412779632085, "phrase": "synonymous_site"}, {"score": 0.003555902292752528, "phrase": "codon_position_plurality"}, {"score": 0.003459191419478298, "phrase": "deleterious_single-nucleotide_variations"}, {"score": 0.0031495640320537252, "phrase": "deleterious_snvs"}, {"score": 0.0024569466759289055, "phrase": "positive_relationship"}, {"score": 0.0023900527169254744, "phrase": "deleterious_non-synonymous_snvs"}, {"score": 0.0021049977753042253, "phrase": "important_attribute"}], "paper_keywords": [""], "paper_abstract": "Motivation: A codon position could perform different or multiple roles in alternative transcripts of a gene. For instance, a non-synonymous position in one transcript could be a synonymous site in another. Alternatively, a position could remain as non-synonymous in multiple transcripts. Here we examined the impact of codon position plurality on the frequency of deleterious single-nucleotide variations (SNVs) using data from 6500 human exomes. Results: Our results showed that the proportion of deleterious SNVs was more than 2-fold higher in positions that remain non-synonymous in multiple transcripts compared with that observed in positions that are non-synonymous in one or some transcript(s) and synonymous or intronic in other(s). Furthermore, we observed a positive relationship between the fraction of deleterious non-synonymous SNVs and the number of proteins (alternative splice variants) affected. These results demonstrate that the plurality of codon positions is an important attribute, which could be useful in identifying mutations associated with diseases.", "paper_title": "Using the plurality of codon positions to identify deleterious variants in human exomes", "paper_id": "WOS:000350058800001"}