{"auto_keywords": [{"score": 0.03711366874776075, "phrase": "benefits_realization_capability"}, {"score": 0.004744018246633455, "phrase": "benefits_realization_capability_model"}, {"score": 0.004515004397496303, "phrase": "information_systems"}, {"score": 0.00419195822011581, "phrase": "planned_benefits"}, {"score": 0.003685604033479918, "phrase": "resource-based_view"}, {"score": 0.003577691211998842, "phrase": "conceptual_model"}, {"score": 0.0030988889679192965, "phrase": "socially_defined_practices"}, {"score": 0.0029637093924781825, "phrase": "thorough_review"}, {"score": 0.002834409847642238, "phrase": "specific_practices"}, {"score": 0.002710735995572145, "phrase": "effective_achievement"}, {"score": 0.0025415366388578465, "phrase": "empirical_examination"}, {"score": 0.00240662380079115, "phrase": "realization_practices"}, {"score": 0.0022675820982741347, "phrase": "ongoing_commitment"}, {"score": 0.0021049977753042253, "phrase": "system's_development"}], "paper_keywords": ["IT benefits realization", " organizational change", " resource-based view", " practices", " systems development"], "paper_abstract": "The return that organizations derive from investments in information systems and technology continues to disappoint. While there are many theoretical prescriptions as to how the planned benefits from an information technology ( IT) project might best be realized, there is very little empirical evidence, as to whether such advice is being heeded in practice. Drawing on the resource-based view of the firm, a conceptual model of a benefits realization capability is presented and developed. In this model, the benefits realization capability is operationalized through four distinct competences, each of which is underpinned by a variety of socially defined practices. The model was populated by using a thorough review of the literature to identify and categorize those specific practices that have the potential to contribute to the effective achievement of benefits from IT investment projects. These practices are then studied in an empirical examination of 25 IT projects. The analysis finds no evidence of benefits realization practices being adopted in any consistent, comprehensive or coherent manner. Effective benefits realization requires an ongoing commitment to, and focus upon, the benefits, rather than the technology, throughout a system's development, implementation and operation.", "paper_title": "Improving the impact of IT development projects: the benefits realization capability model", "paper_id": "WOS:000260470100006"}