{"auto_keywords": [{"score": 0.04140693296811694, "phrase": "increased_portability"}, {"score": 0.00481495049065317, "phrase": "environmentally_conscious_behavior"}, {"score": 0.0040366412779632085, "phrase": "better_portability"}, {"score": 0.0039053194919285725, "phrase": "reusable_products"}, {"score": 0.00379914165379475, "phrase": "shopping_bags"}, {"score": 0.00280496585980086, "phrase": "often-used_or_worn_items"}, {"score": 0.0024434201175883674, "phrase": "reuse_strategies"}, {"score": 0.002363806685815014, "phrase": "transformable_products"}, {"score": 0.002104999656271301, "phrase": "ecb"}], "paper_keywords": ["Environmentally Conscious/Significant Behavior", " Proenvironmental Behavior", " Transformation Principles"], "paper_abstract": "The aim of this work is to explore the relationship between products that mechanically transform and individual environmentally conscious behavior (ECB). Our qualitative study led to observations on how each of the three transformation principles, expand/collapse, expose/cover, and fuse/divide, specifically supports ECBs. As expected, expand/collapse enables better portability of products. Increased portability of reusable products (e.g., travel mugs and shopping bags) reduces reliance on their disposable counterparts. A less expected observation is that increased portability also increases the spontaneity by which ECBs could be carried out. While there are fewer ECB supporting products that incorporate the expose/cover principle, we believe that it enables one to include, yet hide potentially unaesthetic, features that support ECB in often-used or worn items. Finally, we found fuse/divide to enable portability beyond what is possible with expand/collapse alone. Fuse/divide may also make possible other product transport and reuse strategies. We conclude that mechanically transformable products support and enable ECBs, especially when existing infrastructure presents obstacles. Such products may increase the rate of participation in ECB, which then justifies improvements to the shortfalls in infrastructure for which they compensate.", "paper_title": "The mechanical transformation and environmentally conscious behavior", "paper_id": "WOS:000336262300007"}