{"auto_keywords": [{"score": 0.037056259384191395, "phrase": "kemeny_score"}, {"score": 0.015719716506582538, "phrase": "kemeny_rankings"}, {"score": 0.0134258382086325, "phrase": "np"}, {"score": 0.012063024689480577, "phrase": "kemeny"}, {"score": 0.004612294931699583, "phrase": "rank_aggregation"}, {"score": 0.0043374295116776675, "phrase": "\"consensus_permutation"}, {"score": 0.004016674413640846, "phrase": "broad_study"}, {"score": 0.003979807104455635, "phrase": "parameterized_complexity"}, {"score": 0.003943276844539606, "phrase": "optimal_kemeny_rankings"}, {"score": 0.003340011311961488, "phrase": "average_pairwise_distance"}, {"score": 0.0030927871361281925, "phrase": "kendall-tau"}, {"score": 0.0030083247178199434, "phrase": "fixed-parameter_algorithm"}, {"score": 0.002684585839646811, "phrase": "input_votes"}, {"score": 0.002455333662233046, "phrase": "average_range"}, {"score": 0.0024103977660677677, "phrase": "fixed-parameter_tractability"}, {"score": 0.002224966726830651, "phrase": "incomplete_votes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computational social choice", " Voting systems", " Winner determination", " Rank aggregation", " Consensus finding", " Fixed-parameter tractability"], "paper_abstract": "The computation of Kemeny rankings is central to many applications in the context of rank aggregation. Given a set of permutations (votes) over a set of candidates, one searches for a \"consensus permutation\" that is \"closest\" to the given set of permutations. Unfortunately, the problem is NP-hard. We provide a broad study of the parameterized complexity for computing optimal Kemeny rankings. Besides the three obvious parameters \"number of votes\", \"number of candidates\", and solution size (called Kemeny score), we consider further structural parameterizations. More specifically, we show that the Kemeny score (and a corresponding Kemeny ranking) of an election can be computed efficiently whenever the average pairwise distance between two input votes is not too large. In other words, KEMENY SCORE is fixed-parameter tractable with respect to the parameter \"average pairwise Kendall-Tau distance d(a)\". We describe a fixed-parameter algorithm with running time 16(inverted right perpendiculardainverted left perpendicular). poly. Moreover, we extend our studies to the parameters \"maximum range\" and \"average range\" of positions a candidate takes in the input votes. Whereas KEMENY SCORE remains fixed-parameter tractable with respect to the parameter \"maximum range\", it becomes NP-complete in the case of an average range of two. This excludes fixed-parameter tractability with respect to the parameter \"average range\" unless P = NP. Finally, we extend some of our results to votes with ties and incomplete votes, where in both cases one no longer has permutations as input. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Fixed-parameter algorithms for Kemeny rankings", "paper_id": "WOS:000271332200004"}