{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ambient_intelligence"}, {"score": 0.04966229511350135, "phrase": "smart_workplaces"}, {"score": 0.031227936348435306, "phrase": "fuzzy_numbers"}, {"score": 0.00462919213721188, "phrase": "potentially_attractive_exploitation"}, {"score": 0.003769006950727621, "phrase": "logical_relationship"}, {"score": 0.003529543381704363, "phrase": "performance_measures"}, {"score": 0.003191485583025302, "phrase": "ill-defined_relationships"}, {"score": 0.0031360786664165093, "phrase": "generalized_conceptual_model"}, {"score": 0.0027741761880779535, "phrase": "subjective_nature"}, {"score": 0.002737960968372391, "phrase": "ami_features"}, {"score": 0.0027140798043053986, "phrase": "technology_impacts"}, {"score": 0.0026321198895843173, "phrase": "workplace_performance_measures"}, {"score": 0.002519306940054943, "phrase": "ahp"}, {"score": 0.002443206010337041, "phrase": "fuzzy-ahp_model"}, {"score": 0.0023902621773166963, "phrase": "example_applications"}, {"score": 0.002359046870732839, "phrase": "manufacturing_system"}, {"score": 0.002287783663138828, "phrase": "ami_technologies-performance_measure_assessment"}, {"score": 0.0021422271362195734, "phrase": "valuable_insight"}], "paper_keywords": ["Smart environment/workplaces", " Ambient Intelligence (AmI)", " Multi-criteria Decision Analysis (MCDA)", " manufacturing systems", " Fuzzy Analytical Hierarchical Process (Fuzzy-AHP)"], "paper_abstract": "The potentially attractive exploitation of Ambient Intelligence (AmI) seeks improving performance and quality of life of people inside workplaces (e.g., offices, manufacturing work centers, homes). To succeed at making the implementation of AmI fruitful it is important to understand and objectively quantify the logical relationship among the following relevant elements: AmI key enabling technologies, AmI features, basic workplace functions or tasks, and performance measures of the activities of the workplace. Such relationships are fully characterized by ill-structuredness, subjectivity and vagueness. In this article we structure these ill-defined relationships and offer a generalized conceptual model as a foundation for understanding and objectively quantifying such relationships. We then propose fuzzy numbers as an adequate means for expressing the vagueness that is inherent with the subjective nature of the AmI features, technology impacts and characteristics, and relationships with workplace performance measures. The fuzzy numbers are adequately employed through the Analytical Hierarchically Process (AHP) in the form of a Fuzzy-AHP model. We give some example applications from a manufacturing system workplace. The results of the AmI technologies-performance measure assessment frameworks-can be used as a guide in designing smart workplaces and as a valuable insight in adopting the most significant AmI technologies.", "paper_title": "A generalized model for quantifying the impact of Ambient Intelligence on smart workplaces: Applications in manufacturing", "paper_id": "WOS:000345860800005"}