{"auto_keywords": [{"score": 0.041197327123663696, "phrase": "arrival_ratio"}, {"score": 0.015719716506582538, "phrase": "dynamic_rerouting_networks"}, {"score": 0.015596097945024362, "phrase": "destination_tag"}, {"score": 0.014641000077659207, "phrase": "disjoint_paths"}, {"score": 0.008337314316831976, "phrase": "rerouting_hops"}, {"score": 0.004589763483242731, "phrase": "fault-tolerant_multistage_interconnection_design"}, {"score": 0.004237512575106522, "phrase": "collision-free_path"}, {"score": 0.004203803478570494, "phrase": "disjoint_paths_networks"}, {"score": 0.003640730820018083, "phrase": "collision_ratio"}, {"score": 0.0035544816252832375, "phrase": "dynamic_rerouting_method"}, {"score": 0.003512123587588346, "phrase": "alternative_path"}, {"score": 0.002957471572421436, "phrase": "dynamic_rerouting_network"}, {"score": 0.0028758391869611374, "phrase": "hardware_cost"}, {"score": 0.0026336242881032645, "phrase": "faulty_element"}, {"score": 0.0024117603727471675, "phrase": "related_dynamic_rerouting_networks"}, {"score": 0.0023079225317714815, "phrase": "fault_tolerant_capability"}, {"score": 0.0021304214257321, "phrase": "applicable_dynamic_rerouting_network"}, {"score": 0.0021049977753042253, "phrase": "cost-efficient_considerations"}], "paper_keywords": ["parallel computing", " multistage interconnection network (MIN)", " dynamic rerouting", " fault tolerance", " collision", " performance", " destination tag routing"], "paper_abstract": "In fault-tolerant multistage interconnection design, the method of providing disjoint paths can tolerate faults, but it is complicated and hard to choose a collision-free path in disjoint paths networks. A network with disjoint paths can concurrently send more identical packets from the source node to increase the arrival ratio or backtrack a packet to the source and take the other disjoint path, but these two methods might increase the collision ratio. In contrast, a dynamic rerouting method finds an alternative path that tolerates faults or prevents collisions. In this paper, we present methods of designing dynamic rerouting networks. This paper presents (1) three design schemes of dynamic rerouting networks to tolerate faults and prevent collisions; (2) design schemes that enable a dynamic rerouting network to use destination tag routing to save hardware cost in switches for computing rerouting tags; (3) a method to prevent a packet from re-encountering the faulty element again after rerouting to reduce the number of rerouting hops and improve the arrival ratio; and (4) simulation results of related dynamic rerouting networks to realize the factors which influence the arrival ratio including the fault tolerant capability and the number of rerouting hops. According to our proposed design schemes and according to our analysis and simulation results, a designer can choose an applicable dynamic rerouting network by using cost-efficient considerations.", "paper_title": "Design schemes of dynamic rerouting networks with destination tag routing for tolerating faults and preventing collisions", "paper_id": "WOS:000241111000005"}