{"auto_keywords": [{"score": 0.04820929802388964, "phrase": "objectrank"}, {"score": 0.01584409938988337, "phrase": "binrank"}, {"score": 0.00481495049065317, "phrase": "scaling_dynamic_authority-based_search_using_materialized_subgraphs"}, {"score": 0.004258563634666145, "phrase": "query-time_pagerank-style_iterative_computation"}, {"score": 0.004092240621596351, "phrase": "large_graphs"}, {"score": 0.004011521305179232, "phrase": "query_time"}, {"score": 0.003906357144047631, "phrase": "precomputed_results"}, {"score": 0.003691913669486176, "phrase": "objectrank_results"}, {"score": 0.003643185395780667, "phrase": "hybrid_approach"}, {"score": 0.0036070601923916196, "phrase": "materialized_views"}, {"score": 0.0035831752332801674, "phrase": "traditional_query_processing"}, {"score": 0.003500812175550438, "phrase": "relatively_small_subsets"}, {"score": 0.0034660938095219846, "phrase": "data_graph"}, {"score": 0.003408990700300338, "phrase": "keyword_query"}, {"score": 0.002984665318717504, "phrase": "random_walk_starting_points"}, {"score": 0.0029160193808720016, "phrase": "non-negligible_scores"}, {"score": 0.0027375275272639933, "phrase": "related_terms"}, {"score": 0.002544422946205545, "phrase": "subsecond_query_execution_time"}, {"score": 0.0025191653363555214, "phrase": "english_wikipedia_data"}, {"score": 0.002364907617070299, "phrase": "original_graph"}, {"score": 0.00234142781099973, "phrase": "wikipedia_link_graph"}, {"score": 0.0022274718912558343, "phrase": "prior_state"}, {"score": 0.0022053535889915914, "phrase": "art_dynamic_authority-based_search_systems"}, {"score": 0.0021190503591688834, "phrase": "query_execution_time"}], "paper_keywords": ["Online keyword search", " ObjectRank", " scalability", " approximation algorithms"], "paper_abstract": "Dynamic authority-based keyword search algorithms, such as ObjectRank and personalized PageRank, leverage semantic link information to provide high quality, high recall search in databases, and the Web. Conceptually, these algorithms require a query-time PageRank-style iterative computation over the full graph. This computation is too expensive for large graphs, and not feasible at query time. Alternatively, building an index of precomputed results for some or all keywords involves very expensive preprocessing. We introduce BinRank, a system that approximates ObjectRank results by utilizing a hybrid approach inspired by materialized views in traditional query processing. We materialize a number of relatively small subsets of the data graph in such a way that any keyword query can be answered by running ObjectRank on only one of the subgraphs. BinRank generates the subgraphs by partitioning all the terms in the corpus based on their co-occurrence, executing ObjectRank for each partition using the terms to generate a set of random walk starting points, and keeping only those objects that receive non-negligible scores. The intuition is that a subgraph that contains all objects and links relevant to a set of related terms should have all the information needed to rank objects with respect to one of these terms. We demonstrate that BinRank can achieve subsecond query execution time on the English Wikipedia data set, while producing high-quality search results that closely approximate the results of ObjectRank on the original graph. The Wikipedia link graph contains about 10(8) edges, which is at least two orders of magnitude larger than what prior state of the art dynamic authority-based search systems have been able to demonstrate. Our experimental evaluation investigates the trade-off between query execution time, quality of the results, and storage requirements of BinRank.", "paper_title": "BinRank: Scaling Dynamic Authority-Based Search Using Materialized Subgraphs", "paper_id": "WOS:000279060600009"}