{"auto_keywords": [{"score": 0.038501360101105234, "phrase": "user_interaction"}, {"score": 0.00481495049065317, "phrase": "information_retrieval_systems"}, {"score": 0.004766388573192505, "phrase": "user_queries"}, {"score": 0.004198965651975536, "phrase": "information_retrieval"}, {"score": 0.00349803055484394, "phrase": "original_query"}, {"score": 0.0034277338119963886, "phrase": "good_candidate"}, {"score": 0.0031926001871260524, "phrase": "mean_average_precision"}, {"score": 0.0031125795874844438, "phrase": "long_and_short_queries"}, {"score": 0.0029735479904284675, "phrase": "simple_user_interaction"}, {"score": 0.002271725588755076, "phrase": "ir_systems"}, {"score": 0.002159170788765385, "phrase": "unpromising_queries"}, {"score": 0.002126502291103601, "phrase": "significant_drop"}, {"score": 0.0021049977753042253, "phrase": "overall_performance"}], "paper_keywords": ["Adaptive information retrieval", " Query reformulation", " Long queries"], "paper_abstract": "Users enter queries that are short as well as long. The aim of this work is to evaluate techniques that can enable information retrieval (IR) systems to automatically adapt to perform better on such queries. By adaptation we refer to (1) modifications to the queries via user interaction, and (2) detecting that the original query is not a good candidate for modification. We show that the former has the potential to improve mean average precision (MAP) of long and short queries by 40% and 30% respectively, and that simple user interaction can help towards this goal. We observed that after inspecting the options presented to them, users frequently did not select any. We present techniques in this paper to determine beforehand the utility of user interaction to avoid this waste of time and effort. We show that our techniques can provide IR systems with the ability to detect and avoid interaction for unpromising queries without a significant drop in overall performance. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Adapting information retrieval systems to user queries", "paper_id": "WOS:000261114400003"}