{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "stigmergy"}, {"score": 0.0047776860292876025, "phrase": "biological_term"}, {"score": 0.0046918480568236415, "phrase": "insect_swarm-behaviour"}, {"score": 0.004655531868142323, "phrase": "apparent_organisation"}, {"score": 0.004560050780357455, "phrase": "communication_mechanism"}, {"score": 0.004524750101015184, "phrase": "environment-mediated_signals"}, {"score": 0.004285147221054048, "phrase": "pheromone_trails"}, {"score": 0.0041863678337190225, "phrase": "environment-mediated_communication"}, {"score": 0.0040792703149363976, "phrase": "highly_organised_societies"}, {"score": 0.004026749237490887, "phrase": "apparent_management_structure"}, {"score": 0.003954349313204245, "phrase": "human_environments"}, {"score": 0.0037838736571889683, "phrase": "virtual_environment"}, {"score": 0.0037643052781898066, "phrase": "coordinative_contributions"}, {"score": 0.003725470458263889, "phrase": "varying_disciplines"}, {"score": 0.003213550103405005, "phrase": "collaborative_function"}, {"score": 0.003188639687888399, "phrase": "web_site"}, {"score": 0.0030352831308463643, "phrase": "standardised_and_abstract_model"}, {"score": 0.0029194246334886334, "phrase": "formal_specifications"}, {"score": 0.0027934404090474456, "phrase": "holistic_and_macro-level_view"}, {"score": 0.002707788791687262, "phrase": "content_analysis"}, {"score": 0.00269377035953549, "phrase": "influential_literature"}, {"score": 0.0026728783066296813, "phrase": "numerous_theoretical_and_experimental_papers"}, {"score": 0.0025575061994743127, "phrase": "insect_world"}, {"score": 0.002491974663720033, "phrase": "human_world"}, {"score": 0.0024407575255999806, "phrase": "abstract_model"}, {"score": 0.0023172622617843018, "phrase": "useful_road-map"}, {"score": 0.0021659920594094407, "phrase": "special_theory_of_stigmergy"}, {"score": 0.0021491844713925476, "phrase": "design_pattern"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Stigmergy", " Pheromones", " Swarm intelligence", " Multi-agent systems", " Complex-adaptive systems", " Emergence", " Self-organisation"], "paper_abstract": "Stigmergy is a biological term used when discussing a sub-set of insect swarm-behaviour describing the apparent organisation seen during their activities. Stigmergy describes a communication mechanism based on environment-mediated signals which trigger responses among the insects. This phenomenon is demonstrated in the behaviour of ants and their food gathering process when following pheromone trails, where the pheromones are a form of environment-mediated communication. What is interesting with this phenomenon is that highly organised societies are achieved without an apparent management structure. Stigmergy is also observed in human environments, both natural and engineered. It is implicit in the Web where sites provide a virtual environment supporting coordinative contributions. Researchers in varying disciplines appreciate the power of this phenomenon and have studied how to exploit it. As stigmergy becomes more widely researched we see its definition mutate as papers citing original work become referenced themselves. Each paper interprets these works in ways very specific to the research being conducted. Our own research aims to better understand what improves the collaborative function of a Web site when exploiting the phenomenon. However when researching stigmergy to develop our understanding we discover a lack of a standardised and abstract model for the phenomenon. Papers frequently cited the same generic descriptions before becoming intimately focused on formal specifications of an algorithm, or esoteric discussions regarding sub-facets of the topic. None provide a holistic and macro-level view to model and standardise the nomenclature. This paper provides a content analysis of influential literature documenting the numerous theoretical and experimental papers that have focused on stigmergy. We establish that stigmergy is a phenomenon that transcends the insect world and is more than just a metaphor when applied to the human world. We present from our own research our general theory and abstract model of semantics of stigma in stigmergy. We hope our model will clarify the nuances of the phenomenon into a useful road-map, and standardise vocabulary that we witness becoming confused and divergent. Furthermore, this paper documents the analysis on which we base our next paper: Special Theory of Stigmergy: A Design Pattern for Web 2.0 Collaboration. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "General theory of stigmergy: Modelling stigma semantics", "paper_id": "WOS:000341679500004"}