{"auto_keywords": [{"score": 0.014011514097090975, "phrase": "capacity_region"}, {"score": 0.009227823101327085, "phrase": "compression_indices"}, {"score": 0.00590008017014344, "phrase": "optimal_ways"}, {"score": 0.005187096054842343, "phrase": "state_compression"}, {"score": 0.00481495049065317, "phrase": "capacity_region_of_cooperative_multiple-access_channel_with_states"}, {"score": 0.00476435003854229, "phrase": "two-user_state-dependent_multiaccess_channel"}, {"score": 0.004490613962345772, "phrase": "common_message"}, {"score": 0.0043504694214427, "phrase": "individual_message"}, {"score": 0.004313838696307631, "phrase": "explicit_characterizations"}, {"score": 0.004259467629613667, "phrase": "communication_model"}, {"score": 0.0042325385261852855, "phrase": "discrete_memoryless_and_memoryless_gaussian_cases"}, {"score": 0.004179187855398245, "phrase": "capacity_region_analysis"}, {"score": 0.003947277838139306, "phrase": "discrete_memoryless_setting"}, {"score": 0.003807883350517614, "phrase": "gaussian_setting"}, {"score": 0.0035361474550865937, "phrase": "special_case"}, {"score": 0.0032976660507117103, "phrase": "discrete_memoryless_and_memoryless_gaussian_settings"}, {"score": 0.003049292377287271, "phrase": "lossy_version"}, {"score": 0.0029854265985517635, "phrase": "information_messages"}, {"score": 0.002966528209833711, "phrase": "generalized_gel'fand-pinsker_binning"}, {"score": 0.002679877670528218, "phrase": "appropriately_tuned_encoding_and_decoding_processes"}, {"score": 0.0026572756992691957, "phrase": "a-la_noisy_network_coding"}, {"score": 0.0026460461085305374, "phrase": "lim_et_al"}, {"score": 0.0025796555911178037, "phrase": "avestimeher_et_al"}, {"score": 0.002514926642010556, "phrase": "wyner-ziv_binning"}, {"score": 0.002472676627823966, "phrase": "wyner-ziv_binning_shares_elements"}, {"score": 0.0024623097753262895, "phrase": "cover"}, {"score": 0.002451817884986852, "phrase": "el_gamal"}, {"score": 0.0023751489488091143, "phrase": "backward_decoding"}, {"score": 0.0023501278920397372, "phrase": "forward_decoding"}, {"score": 0.0021184194106771146, "phrase": "larger_alphabets_sizes"}, {"score": 0.0021049977753042253, "phrase": "auxiliary_random_variables"}], "paper_keywords": ["Capacity", " channel state information", " multiaccess channels", " noisy network coding", " Wyner-Ziv binning"], "paper_abstract": "We consider a two-user state-dependent multiaccess channel in which the states of the channel are known noncausally to one of the encoders and only strictly causally to the other encoder. Both encoders transmit a common message and, in addition, the encoder that knows the states noncausally transmits an individual message. We find explicit characterizations of the capacity region of this communication model in both discrete memoryless and memoryless Gaussian cases. In particular, the capacity region analysis demonstrates the utility of the knowledge of the states only strictly causally at the encoder that sends only the common message in general. More specifically, in the discrete memoryless setting, we show that such a knowledge is beneficial and increases the capacity region in general. In the Gaussian setting, we show that such a knowledge does not help, and the capacity is same as if the states were completely unknown at the encoder that sends only the common message. Furthermore, we also study the special case in which the two encoders transmit only the common message and show that the knowledge of the states only strictly causally at the encoder that sends only the common message is not beneficial in this case, in both discrete memoryless and memoryless Gaussian settings. The analysis also reveals optimal ways of exploiting the knowledge of the state only strictly causally at the encoder that sends only the common message when such a knowledge is beneficial. The encoders collaborate to convey to the decoder a lossy version of the state, in addition to transmitting the information messages through a generalized Gel'fand-Pinsker binning. Particularly important in this problem are the questions of 1) optimal ways of performing the state compression and 2) whether or not the compression indices should be decoded uniquely. By developing two optimal coding schemes that perform this state compression differently, we show that when used as parts of appropriately tuned encoding and decoding processes, both compression a-la noisy network coding by Lim et al. or the quantize-map-and-forward by Avestimeher et al., i.e., with no binning, and compression using Wyner-Ziv binning are optimal. The scheme that uses Wyner-Ziv binning shares elements with Cover and El Gamal original compress-and-forward, but differs from it mainly in that backward decoding is employed instead of forward decoding and the compression indices are not decoded uniquely. Finally, by exploring the properties of our outer bound, we show that, although not required in general, the compression indices can in fact be decoded uniquely essentially without altering the capacity region, but at the expense of larger alphabets sizes for the auxiliary random variables.", "paper_title": "Capacity Region of Cooperative Multiple-Access Channel With States", "paper_id": "WOS:000324573500001"}