{"auto_keywords": [{"score": 0.049613254104042076, "phrase": "decision_trees"}, {"score": 0.00481495049065317, "phrase": "expected_utility"}, {"score": 0.004037694641919865, "phrase": "evaluation_procedures"}, {"score": 0.003959447096055027, "phrase": "second-order_representation"}, {"score": 0.0038261310307416475, "phrase": "decision-maker's_understanding"}, {"score": 0.003661275004971829, "phrase": "imprecise_representations"}, {"score": 0.003503497128638102, "phrase": "influence_diagrams"}, {"score": 0.0030696773722514105, "phrase": "expected_utilities"}, {"score": 0.003024909947609294, "phrase": "gamma-maximin_decision_rule"}, {"score": 0.0028244513779243107, "phrase": "interval_boundaries"}, {"score": 0.0026115277372906805, "phrase": "generalized_expected_utility"}, {"score": 0.0023677483882740317, "phrase": "second-order_information"}, {"score": 0.002321787726770895, "phrase": "standard_decision_trees"}, {"score": 0.002299142268368128, "phrase": "probabilistic_networks"}, {"score": 0.002232519579957705, "phrase": "upper_and_lower_bounds"}, {"score": 0.0021049977753042253, "phrase": "multi-criteria_weight_trees"}], "paper_keywords": ["decision analysis", " second-order probabilities", " utility theory", " decision evaluation"], "paper_abstract": "Evaluation of decision trees in which imprecise information prevails is complicated. Especially when the tree has some depth, i.e. consists of more than one level, the effects of the choice of representation and evaluation procedures are significant. Second-order representation and evaluation may significantly increase a decision-maker's understanding of a decision situation when handling aggregations of imprecise representations, as is the case in decision trees or influence diagrams, while the use of only first-order results gives an incomplete picture. Furthermore, due to the effects on the distribution of belief over the intervals of expected utilities, the Gamma-maximin decision rule seems to be unnecessarily pessimistic as the belief in neighbourhoods of points near interval boundaries is usually lower than in neighbourhoods near the centre. Due to this, a generalized expected utility is proposed. The results in this paper apply also to approaches, which do not explicitly deal with second-order information, such as standard decision trees or probabilistic networks using only first-order concepts, for example upper and lower bounds. Furthermore, the results also apply to other, non-probabilistic weighted trees such as multi-criteria weight trees. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Distribution of expected utility in decision trees", "paper_id": "WOS:000250898800009"}