{"auto_keywords": [{"score": 0.03888768054778179, "phrase": "random_initial_endmembers"}, {"score": 0.00481495049065317, "phrase": "random_n-finder"}, {"score": 0.004644329185633612, "phrase": "hyperspectral_imagery"}, {"score": 0.004610934029355486, "phrase": "n-finder_algorithm"}, {"score": 0.0044314880575692175, "phrase": "endmember_extraction"}, {"score": 0.004093190049699647, "phrase": "n-findr"}, {"score": 0.003948043391567917, "phrase": "exhaustive_search"}, {"score": 0.0039055075176836263, "phrase": "third_one"}, {"score": 0.003849502288990788, "phrase": "dimensionality_reduction"}, {"score": 0.003646516176920946, "phrase": "inconsistent_final_endmember_selection"}, {"score": 0.003271986590873581, "phrase": "last_issue"}, {"score": 0.0031218401638802053, "phrase": "random_algorithm"}, {"score": 0.0029571101238632783, "phrase": "single_run"}, {"score": 0.002811191663575046, "phrase": "endmember_present"}, {"score": 0.002672454243212711, "phrase": "random_set"}, {"score": 0.0026532001044943096, "phrase": "initial_endmembers"}, {"score": 0.002222365485177405, "phrase": "proposed_rn-findr_custom-designed_synthetic_image_experiments"}, {"score": 0.002151183757599893, "phrase": "real_image_experiments"}], "paper_keywords": ["Endmember extraction", " N-FINDR", " iterative N-FINDR (IN-FINDR)", " random N-FINDR (RN-FINDR)", " random IN-FINDR (RIN-FINDR)", " random SC N-FINDR (RSC N-FINDR)", " SuCcessive N-FINDR (SC N-FINDR)"], "paper_abstract": "N-finder algorithm (N-FINDR) has been widely used in endmember extraction. When it comes to implementation several issues need to be addressed. One is determination of endmembers, p required for N-FINDR to generate. Another is its computational complexity resulting from an exhaustive search. A third one is its requirement of dimensionality reduction. A fourth and probably the most critical issue is its use of random initial endmembers which results in inconsistent final endmember selection and results are not reproducible. This paper re-invents the wheel by re-designing the N-FINDR in such a way that all the above-mentioned issues can be resolved while making the last issue an advantage. The idea is to implement the N-FINDR as a random algorithm, called random N-FINDR (RN-FINDR) so that a single run using one set of random initial endmembers is considered as one realization. If there is an endmember present in the data, it should appear in any realization regardless of what random set of initial endmembers is used. In this case, the N-FINDR is terminated when the intersection of all realizations produced by two consecutive runs of RN-FINDR remains the same in which case the p is then automatically determined by the intersection set without appealing for any criterion. In order to substantiate the proposed RN-FINDR custom-designed synthetic image experiments with complete knowledge are conducted for validation and real image experiments are also performed to demonstrate its utility in applications.", "paper_title": "Random N-Finder (N-FINDR) Endmember Extraction Algorithms for Hyperspectral Imagery", "paper_id": "WOS:000287400700004"}