{"auto_keywords": [{"score": 0.04777760737094776, "phrase": "monadic_second_order_theory"}, {"score": 0.015539749984147005, "phrase": "decidable_monadic_second_order_theory"}, {"score": 0.01385354375639755, "phrase": "net_system"}, {"score": 0.010247826106508113, "phrase": "rabin's_theorem"}, {"score": 0.009162531005194685, "phrase": "finite_state_transition_system"}, {"score": 0.008134025243303769, "phrase": "net_systems"}, {"score": 0.004814959548930643, "phrase": "rabin"}, {"score": 0.0047310525657970615, "phrase": "concurrency_setting"}, {"score": 0.0045355866228818514, "phrase": "infinite_binary_tree"}, {"score": 0.004394281902031765, "phrase": "far_reaching_influence"}, {"score": 0.004302522426263979, "phrase": "time_temporal_logics"}, {"score": 0.004257360656055417, "phrase": "simple_consequence"}, {"score": 0.004024351756560517, "phrase": "concurrency_theory"}, {"score": 0.0038715697646612766, "phrase": "natural_generalization"}, {"score": 0.00376409764683147, "phrase": "labelled_event_structures"}, {"score": 0.0036467403626789666, "phrase": "proper_counterparts"}, {"score": 0.003608437115371213, "phrase": "computation_trees"}, {"score": 0.0033395304916220086, "phrase": "sequential_case"}, {"score": 0.002298902547676131, "phrase": "free_choice_net_systems"}, {"score": 0.002234988641498543, "phrase": "positive_resolution"}, {"score": 0.0021499920551456956, "phrase": "distributed_controller_synthesis_problems"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Rabin's theorem", " Monadic second order logic", " Event structure", " Petri net", " Grid-free"], "paper_abstract": "Rabin's theorem says that the monadic second order theory of the infinite binary tree is decidable. This result has had a far reaching influence in the theory of branching time temporal logics. A simple consequence of Rabin's theorem is that for every finite state transition system, the monadic second order theory of its computation tree is decidable. Concurrency theory strongly suggests that finite 1-safe Petri nets (or simply, net systems) are a natural generalization of the notion of a finite state transition system while labelled event structures arising as the unfoldings of net systems are the proper counterparts to the computation trees obtained by unwinding finite (sequential) transition systems. It is easy to define the monadic second order theory of such event structures. It turns out that unlike the sequential case, not every net system (i.e. its event structure unfolding) has a decidable monadic second order theory. This gives rise to the question: Which net systems admit a decidable monadic second order theory? Here we present a conjecture based on a property called grid-freeness. Our conjecture is that a net system has a decidable monadic second order theory iff its event structure unfolding is grid-free. We show that it is decidable whether a net system has this property. We also prove that the monadic second order theory of a net system is undecidable if its event structure unfolding is not grid-free. In addition we show that our conjecture can be effectively reduced to the sub-class of free choice net systems. Finally we point out how the positive resolution of our conjecture will settle the decidability of a range of distributed controller synthesis problems. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Rabin's theorem in the concurrency setting: A conjecture", "paper_id": "WOS:000340691500018"}