{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hybrid_systems"}, {"score": 0.014593739423908547, "phrase": "interchange_format"}, {"score": 0.004291073117901643, "phrase": "design_tools"}, {"score": 0.004101886428528311, "phrase": "main_challenge"}, {"score": 0.0038819041309353024, "phrase": "particular_formal_semantics"}, {"score": 0.0036007478932719417, "phrase": "existing_tools"}, {"score": 0.003459191419478298, "phrase": "formal_definition"}, {"score": 0.0033231814056233103, "phrase": "proposed_interchange_format"}, {"score": 0.003113441660343867, "phrase": "hybrid_system"}, {"score": 0.002447101794397243, "phrase": "existing_languages"}, {"score": 0.002224510044064184, "phrase": "essential_information"}, {"score": 0.0022022878843247257, "phrase": "different_modeling_approaches"}, {"score": 0.0021049977753042253, "phrase": "translation_process"}], "paper_keywords": [""], "paper_abstract": "In [1] we advocated the need for an interchange format for hybrid systems that enables the integration of design tools coming from many different research communities. In deriving such interchange format the main challenge is to define a language that, while presenting a particular formal semantics, remains general enough to accommodate the translation across the various modeling approaches used in the existing tools. In this paper we give a formal definition of the syntax and semantics for the proposed interchange format. In doing so, we clearly separate the structure of a hybrid system from the semantics attached to it. The semantics can be considered an \"abstract semantics\" in the sense that it can be refined to yield the model of computation, or \"concrete semantics\", which, in turn, is associated to the existing languages that are used to specify hybrid systems. We show how the interchange format can be used to capture the essential information across different modeling approaches and how such information can be used in the translation process.", "paper_title": "Interchange format for hybrid systems: Abstract semantics", "paper_id": "WOS:000237082600034"}