{"auto_keywords": [{"score": 0.027836464983431244, "phrase": "scs"}, {"score": 0.00481495049065317, "phrase": "ica_mixture_models"}, {"score": 0.004454691230204595, "phrase": "similar_patterns"}, {"score": 0.004390192910013225, "phrase": "data_set"}, {"score": 0.00386876598761639, "phrase": "segmentation_tasks"}, {"score": 0.0038127186374325582, "phrase": "first_important_contribution"}, {"score": 0.003631671435460452, "phrase": "self-organizing_method"}, {"score": 0.003527181559366122, "phrase": "enhanced_independent_component_analysis_mixture"}, {"score": 0.003278878522165818, "phrase": "independent_component_analysis_mixture_model"}, {"score": 0.0030778231027679434, "phrase": "model_limitations"}, {"score": 0.002778682854371595, "phrase": "pre-processing_methodology"}, {"score": 0.0025829353063908256, "phrase": "image_denoising"}, {"score": 0.002545468362709126, "phrase": "sobel_edge_detector"}, {"score": 0.002424450174817922, "phrase": "eicamm"}, {"score": 0.0022536005664642294, "phrase": "satisfactory_and_competitive_image_segmentation_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["clustering", " self-organization", " computer vision", " image segmentation", " image smoothing", " pixel classification", " artificial neural networks"], "paper_abstract": "Today several different unsupervised classification algorithms are commonly used to cluster similar patterns in a data set based only on its statistical properties. Specially in image data applications, self-organizing methods for unsupervised classification have been successfully applied for clustering pixels or group of pixels in order to perform segmentation tasks. The first important contribution of this paper refers to the development of a self-organizing method for data classification, named Enhanced Independent Component Analysis Mixture Model (EICAMM), which was built by proposing some modifications in the Independent Component Analysis Mixture Model (ICAMM). Such improvements were proposed by considering some of the model limitations as well as by analyzing how it should be improved in order to become more efficient. Moreover, a pre-processing methodology was also proposed, which is based on combining the Sparse Code Shrinkage (SCS) for image denoising and the Sobel edge detector. In the experiments of this work, the EICAMM and other self-organizing models were applied for segmenting images in their original and pre-processed versions. A comparative analysis showed satisfactory and competitive image segmentation results obtained by the proposals presented herein. (C) 2008 Published by Elsevier B.V.", "paper_title": "Improvements on ICA mixture models for image pre-processing and segmentation", "paper_id": "WOS:000257413300039"}