{"auto_keywords": [{"score": 0.049604883316905664, "phrase": "serial_manipulators"}, {"score": 0.04913548507380238, "phrase": "non-unilateral_constraints"}, {"score": 0.0308325490796238, "phrase": "singular_surfaces"}, {"score": 0.00481495049065317, "phrase": "workspace_boundary_determination"}, {"score": 0.004650086856905758, "phrase": "applicable_analytical_algorithms"}, {"score": 0.004358676214574977, "phrase": "jacobian_row-rank_deficiency_method"}, {"score": 0.0040449598280454645, "phrase": "singularity_sets"}, {"score": 0.003926239804947305, "phrase": "jacobian"}, {"score": 0.003553540530701019, "phrase": "time_interval"}, {"score": 0.0033306180744375616, "phrase": "relative_singular_jacobian"}, {"score": 0.003264872488939969, "phrase": "null_space"}, {"score": 0.0027834145465170292, "phrase": "workspace_envelope"}, {"score": 0.0027557911038816256, "phrase": "intersecting_singular_surfaces"}, {"score": 0.0027284410545226306, "phrase": "singular_curves"}, {"score": 0.0026086775334428617, "phrase": "perturbation_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["non-unilateral", " Jacobian row-rank deficiency", " hypersurfaces", " workspace envelope", " perturbation method"], "paper_abstract": "Broadly applicable analytical algorithms for workspace of serial manipulators with non-unilateral constraints are developed and illustrated. The Jacobian row-rank deficiency method is employed to determine the singularities of these manipulators. There are four types of singularity sets: Type I: position Jacobian singularities; Type II: instantaneous singularities that are due to a generalized joint that is reaching its apex; Type III: domain boundary singularities, which are associated with the initial and final values of the time interval; Type IV: coupled singularities, which are associated with a relative singular Jacobian, where the null space is reduced in one submatrix due to either of two occurrences: a Type II or a Type III singularity. All of the singular surfaces are hypersurfaces that extend internally and externally the workspace envelope. Intersecting singular surfaces identifies singular curves that partition singular surfaces into subsurfaces, and a perturbation method is used to identify regions (curve segments/surface patches) of the hypersurfaces that are on the boundary. The formulation is illustrated by implementing it to a spatial 3-degree of freedom (DOF) and a spatial 4-DOF manipulator. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "On the workspace boundary determination of serial manipulators with non-unilateral constraints", "paper_id": "WOS:000250930200006"}