{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "link-state_routing"}, {"score": 0.020423553354392426, "phrase": "link-delay_information"}, {"score": 0.007355498292026518, "phrase": "link-delay_estimates"}, {"score": 0.004756233569671719, "phrase": "future_link-delay-information_estimation"}, {"score": 0.004436716583179764, "phrase": "current_delays"}, {"score": 0.004138575034269399, "phrase": "data_packet"}, {"score": 0.00357146811369898, "phrase": "new_routing_software"}, {"score": 0.0034422330919613294, "phrase": "future_link_delays"}, {"score": 0.003400198866111204, "phrase": "data_packets"}, {"score": 0.002573362191631126, "phrase": "temporal_change"}, {"score": 0.002322689143237591, "phrase": "simulation_studies"}, {"score": 0.0022477377970612847, "phrase": "significant_reductions"}, {"score": 0.002202123699556382, "phrase": "noticeable_improvements"}, {"score": 0.002157433262687853, "phrase": "high-load_conditions"}, {"score": 0.0021049977753042253, "phrase": "information-dynamics-conscious_development"}], "paper_keywords": ["information-dynamics-conscious software design", " routing software", " link-state routing", " link-delay-information", " estimation", " stochastic processes"], "paper_abstract": "In link-state routing, routes are determined based on the estimates of the current delays on the links, i.e. without considering the dynamics of the link-delay information. Ideally, a data packet should be routed based on the delays it will encounter at each link of the path at the time the packet gets to the link. To address this issue, we have designed a new routing software that improves link-state routing by estimating and using the future link delays encountered by data packets. In link-state routing, link-delay estimates are periodically flooded throughout the network. This flooding of link-delay estimates is done without considering the relevance of these estimates to routing quality, i.e. without taking into account the usefulness of the link-delay information. Our routing-software design also improves link-state routing by broadcasting these estimates only to the extent that they are relevant. In the design of routing software, we consider the temporal change of the link-delay information and its usefulness given the information at a time; we call this an information-dynamics-conscious approach. Simulation studies suggest that this design can lead to significant reductions in routing traffic with noticeable improvements of routing quality in high-load conditions, demonstrating the effectiveness of information-dynamics-conscious development of routing software.", "paper_title": "Information-dynamics-conscious development of routing software: A case of routing software that improves link-state routing based on future link-delay-information estimation", "paper_id": "WOS:000253746600001"}