{"auto_keywords": [{"score": 0.04789568572973002, "phrase": "facial_features"}, {"score": 0.015719716506582538, "phrase": "facial_expressions"}, {"score": 0.013731525318703397, "phrase": "emotion_recognition_problem"}, {"score": 0.01133592450378914, "phrase": "fuzzy_face_space"}, {"score": 0.010400899660176736, "phrase": "primary_membership_functions"}, {"score": 0.008989313277818104, "phrase": "optimization_problem"}, {"score": 0.007564103969657953, "phrase": "classification_accuracy"}, {"score": 0.004735414083933722, "phrase": "similar_emotion"}, {"score": 0.00450456611645112, "phrase": "different_instances"}, {"score": 0.00443013401197632, "phrase": "wide_variations"}, {"score": 0.004089556946377719, "phrase": "main_source"}, {"score": 0.0037750632698768704, "phrase": "background_knowledge"}, {"score": 0.003725042075410585, "phrase": "different_subjects"}, {"score": 0.003700279655380723, "phrase": "different_emotions"}, {"score": 0.0036028592508983402, "phrase": "unknown_facial_expression"}, {"score": 0.0034963129868796033, "phrase": "measured_facial_features"}, {"score": 0.0032272929113113203, "phrase": "fuzzy_set"}, {"score": 0.0028715299874549245, "phrase": "secondary_memberships"}, {"score": 0.00285242509099472, "phrase": "individual_primary_membership_curve"}, {"score": 0.0026152965305133373, "phrase": "first_one"}, {"score": 0.0025634286580668427, "phrase": "average_primary_membership_functions"}, {"score": 0.0024958641143547856, "phrase": "second_one"}, {"score": 0.0024545413637350765, "phrase": "defuzzified_signal"}, {"score": 0.002366017944545902, "phrase": "uncertainty_management_policy"}, {"score": 0.002213147136067999, "phrase": "small_improvement"}, {"score": 0.0021261972801049573, "phrase": "pre-processing_measurements"}, {"score": 0.0021049977753042253, "phrase": "well-known_interval_approach"}], "paper_keywords": ["Emotion recognition", " facial feature extraction", " fuzzy face space", " interval and general type-2 fuzzy sets", " interval approach (IA)"], "paper_abstract": "Facial expressions of a person representing similar emotion are not always unique. Naturally, the facial features of a subject taken from different instances of the same emotion have wide variations. In the presence of two or more facial features, the variation of the attributes together makes the emotion recognition problem more complicated. This variation is the main source of uncertainty in the emotion recognition problem, which has been addressed here in two steps using type-2 fuzzy sets. First a type-2 fuzzy face space is constructed with the background knowledge of facial features of different subjects for different emotions. Second, the emotion of an unknown facial expression is determined based on the consensus of the measured facial features with the fuzzy face space. Both interval and general type-2 fuzzy sets (GT2FS) have been used separately to model the fuzzy face space. The interval type-2 fuzzy set (IT2FS) involves primary membership functions for m facial features obtained from n-subjects, each having l-instances of facial expressions for a given emotion. The GT2FS in addition to employing the primary membership functions mentioned above also involves the secondary memberships for individual primary membership curve, which has been obtained here by formulating and solving an optimization problem. The optimization problem here attempts to minimize the difference between two decoded signals: the first one being the type-1 defuzzification of the average primary membership functions obtained from the n-subjects, while the second one refers to the type-2 defuzzified signal for a given primary membership function with secondary memberships as unknown. The uncertainty management policy adopted using GT2FS has resulted in a classification accuracy of 98.333% in comparison to 91.667% obtained by its interval type-2 counterpart. A small improvement (approximately 2.5%) in classification accuracy by IT2FS has been attained by pre-processing measurements using the well-known interval approach.", "paper_title": "General and Interval Type-2 Fuzzy Face-Space Approach to Emotion Recognition", "paper_id": "WOS:000323495900009"}