{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "aggregate_range_queries"}, {"score": 0.04858132305104682, "phrase": "multi-dimensional_data"}, {"score": 0.047446295972823384, "phrase": "aggregate_data"}, {"score": 0.029218408740257874, "phrase": "random_variable"}, {"score": 0.004392565073466714, "phrase": "overlapping_ranges"}, {"score": 0.003773449694108617, "phrase": "reasonable_limits"}, {"score": 0.0037073529462522403, "phrase": "major_requirement"}, {"score": 0.0036424097335610492, "phrase": "practical_impact"}, {"score": 0.003275879115801376, "phrase": "query_estimates"}, {"score": 0.0031286936417685178, "phrase": "probabilistic_framework"}, {"score": 0.0030306762103395842, "phrase": "approximate_answers"}, {"score": 0.002988101395789399, "phrase": "aggregate_queries"}, {"score": 0.002863921785266393, "phrase": "data_set"}, {"score": 0.0028037753646260937, "phrase": "aggregate_range_query"}, {"score": 0.0025573643582417573, "phrase": "mean_value"}, {"score": 0.0024510413243251906, "phrase": "actual_answer"}, {"score": 0.0024251568696803177, "phrase": "corresponding_query"}, {"score": 0.002391067964886602, "phrase": "error_rate"}, {"score": 0.0023491282852109757, "phrase": "proposed_framework"}, {"score": 0.00232431758517087, "phrase": "different_kinds"}, {"score": 0.002180848602315088, "phrase": "integrity_constraints"}, {"score": 0.0021501863832966966, "phrase": "original_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Multidimensional data", " Compression", " Histogram", " Range query"], "paper_abstract": "A histogram over a multi-dimensional data set is a synopsis consisting of aggregate data summarizing the values of the points inside non-overlapping ranges of the domain. Owing to their effectiveness in supporting a fast (though approximate) estimation of the answers of aggregate range queries, histograms are widely used in several contexts dealing with multi-dimensional data, especially those where the precision of the answers (within reasonable limits) is not the major requirement. However, the practical impact of histograms has been limited by the fact that, so far, no mechanism has been defined which provides a reliable (non-trivial) quantification of the degree of approximation of the query estimates. In this paper, this problem is addressed by introducing a probabilistic framework which allows for estimating the accuracy of the approximate answers resulting from evaluating aggregate queries over a histogram. Specifically, given a histogram over a data set, the answer of an aggregate range query is modeled as a random variable, whose probability distribution depends on the type and the values of the aggregate data stored in the histogram. Therein, the mean value and the variance of this random variable represent an estimate of the actual answer of the corresponding query and of the error rate, respectively. The proposed framework can exploit different kinds of aggregates (namely, sum and count) stored in the histogram, as well as integrity constraints defined over the original data. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "A probabilistic framework for estimating the accuracy of aggregate range queries evaluated over histograms", "paper_id": "WOS:000300201700007"}