{"auto_keywords": [{"score": 0.046273829908275756, "phrase": "fundamental_problem"}, {"score": 0.00481495049065317, "phrase": "simple_conceptual_graphs"}, {"score": 0.004724020632103649, "phrase": "basic_conceptual_graphs"}, {"score": 0.004504104287114781, "phrase": "existential_conjunctive_positive_fragment"}, {"score": 0.004475562733344479, "phrase": "first-order_logic"}, {"score": 0.004321772629297024, "phrase": "graph_homomorphism"}, {"score": 0.004173244935967375, "phrase": "sg_q"}, {"score": 0.004133627071344356, "phrase": "sg_g"}, {"score": 0.003942365459138558, "phrase": "g."}, {"score": 0.0038665952212144214, "phrase": "knowledge_base"}, {"score": 0.003245900020944865, "phrase": "query_answering_problem"}, {"score": 0.0031242709509664837, "phrase": "atomic_negation"}, {"score": 0.0029597010149863016, "phrase": "real_world_applications"}, {"score": 0.002821685815956478, "phrase": "incomplete_knowledge"}, {"score": 0.0028037753646260937, "phrase": "classical_negation"}, {"score": 0.0026224255640133758, "phrase": "intuitionistic_deduction"}, {"score": 0.0025240999184904366, "phrase": "projection_checking"}, {"score": 0.0022650315005334916, "phrase": "conjunctive_queries"}, {"score": 0.0021049977753042253, "phrase": "semantic_web_databases"}], "paper_keywords": ["conceptual graphs", " atomic negation", " deduction", " query answering"], "paper_abstract": "We consider basic conceptual graphs, namely simple conceptual graphs (SGs), which are equivalent to the existential conjunctive positive fragment of first-order logic. The fundamental problem, deduction, is performed by a graph homomorphism called projection. The existence of a projection from a SG Q to a SG G means that the knowledge represented by Q is deducible from the knowledge represented by G. In this framework, a knowledge base is composed of SGs representing facts and a query is itself a SG. We focus on the issue of querying SGs, which highlights another fundamental problem, namely query answering. Each projection from a query to a fact defines an answer to the query, with an answer being itself a SG. The query answering problem asks for all answers to a query. This paper introduces atomic negation into this framework. Several understandings of negation are explored, which are all of interest in real world applications. In particular, we focus on situations where, in the context of incomplete knowledge, classical negation is not satisfactory because deduction can be proven but there is no answer to the query. We show that intuitionistic deduction captures the notion of an answer and can be solved by projection checking. Algorithms are provided for all studied problems. They are all based on projection. They can thus be combined to deal with several kinds of negation simultaneously. Relationships with problems on conjunctive queries in databases are recalled and extended. Finally, we point out that this discussion can be put in the context of semantic web databases. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "On querying simple conceptual graphs with negation", "paper_id": "WOS:000244937900003"}