{"auto_keywords": [{"score": 0.03377281650584252, "phrase": "ibm"}, {"score": 0.015015086974092828, "phrase": "lbm"}, {"score": 0.012062730800011436, "phrase": "particulate_suspensions"}, {"score": 0.011965173569530911, "phrase": "discretized_boltzmann_equation"}, {"score": 0.009400462216641703, "phrase": "force_density_function"}, {"score": 0.00481495049065317, "phrase": "-slip_boundary_condition"}, {"score": 0.004736820055728928, "phrase": "lattice-boltzmann_simulation"}, {"score": 0.004621984064678252, "phrase": "lattice-boltzmann_method"}, {"score": 0.004460985154171165, "phrase": "direct-numerical_simulation"}, {"score": 0.004021689117050817, "phrase": "no-slip_boundary_condition"}, {"score": 0.003988901168289797, "phrase": "particle-fluid_interface"}, {"score": 0.0039348451962364, "phrase": "updating_scheme"}, {"score": 0.0039027624925133935, "phrase": "particle_velocity"}, {"score": 0.0038393766931273223, "phrase": "solid_boundaries"}, {"score": 0.003797690272118125, "phrase": "so-called_\"bounce-back\"_method"}, {"score": 0.003635405516451343, "phrase": "i._theoretical"}, {"score": 0.003277140908834426, "phrase": "particle_shape"}, {"score": 0.003215091066260523, "phrase": "immersed_boundary_method"}, {"score": 0.0030860426028530646, "phrase": "solid_region"}, {"score": 0.0030028922572442806, "phrase": "particle_shapes"}, {"score": 0.0028902212010471127, "phrase": "solid_particles"}, {"score": 0.0028046593475268174, "phrase": "simplest_way"}, {"score": 0.0027365364488693656, "phrase": "direct-forcing_scheme"}, {"score": 0.0026700637696697414, "phrase": "complete_study"}, {"score": 0.002555841674475421, "phrase": "forcing_points"}, {"score": 0.0024464938759497907, "phrase": "simulation_results"}, {"score": 0.0023546505782867967, "phrase": "bbm."}, {"score": 0.0023100262993452853, "phrase": "commonly_used_velocity_updating_schemes"}, {"score": 0.0021751997984619585, "phrase": "simple_and_very_effective_velocity_updating_scheme"}, {"score": 0.002133969592219807, "phrase": "numerical_solutions"}, {"score": 0.0021049977753042253, "phrase": "fluid_density_ratios"}], "paper_keywords": [""], "paper_abstract": "In the past decade, the lattice-Boltzmann method (LBM) has emerged as a very useful tool in studies for the direct-numerical simulation of particulate flows. The accuracy and robustness of the LBM have been demonstrated by many researchers; however, there are several numerical problems that have not been completely resolved. One of these is the treatment of the no-slip boundary condition on the particle-fluid interface and another is the updating scheme for the particle velocity. The most common used treatment for the solid boundaries largely employs the so-called \"bounce-back\" method (BBM). [Ladd AJC. Numerical simulations of particulate suspensions via a discretized Boltzmann equation Part I. Theoretical foundation. J Fluid Mech (1994):271:285: Ladd AJC. Numerical simulations of particulate Suspensions via a discretized Boltzmann equation Part II. Numerical results. J Fluid Mech (1994):271:311.] This often causes distortions and fluctuations of the particle shape from one time step to another. The immersed boundary method (IBM), which assigns and follows a series of points in the solid region, may be used to ensure the uniformity of particle shapes throughout the computations. To ensure that the IBM points move with the solid particles, a force density function is applied to these points. The simplest way to calculate the force density function is to use a direct-forcing scheme. In this paper, we conduct a complete study on issues related to this scheme and examine the following Parameters: the generation of the forcing points; the choice of the number of forcing points and sensitivity of this choice to simulation results: and, the advantages and disadvantages associated with the IBM over the BBM. It was also observed that the commonly used velocity updating schemes cause instabilities when the densities of the fluid and the particles are close. In this paper, we present a simple and very effective velocity updating scheme that does not only facilitate the numerical solutions when the particle to fluid density ratios are close to one, but also works well for particle that are lighter than the fluid. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Robust treatment of no-slip boundary condition and velocity updating for the lattice-Boltzmann simulation of particulate flows", "paper_id": "WOS:000263281800018"}