{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "query_reformulation"}, {"score": 0.015542316130590986, "phrase": "web_searching"}, {"score": 0.0046253989970108985, "phrase": "key_user_behavior"}, {"score": 0.0045726187330434025, "phrase": "web_search"}, {"score": 0.004417848254181138, "phrase": "predictive_models"}, {"score": 0.003961330917648707, "phrase": "query-reformulation_patterns"}, {"score": 0.0037188360359702182, "phrase": "next_query_reformulation"}, {"score": 0.003613556291453534, "phrase": "n-gram_modeling_approach"}, {"score": 0.003130077012135034, "phrase": "fourth-order_models"}, {"score": 0.002806256131739047, "phrase": "possible_pattern"}, {"score": 0.0026955672787561716, "phrase": "reformulation_and_assistance"}, {"score": 0.0026041635822373265, "phrase": "query_reformulations"}, {"score": 0.002472822097373027, "phrase": "first-_and_second-order_models"}, {"score": 0.0021789194955896102, "phrase": "n-gram_approach"}, {"score": 0.0021049977753042253, "phrase": "searching_systems"}], "paper_keywords": [""], "paper_abstract": "Query reformulation is a key user behavior during Web search. Our research goal is to develop predictive models of query reformulation during Web searching. This article reports results from a study in which we automatically classified the query-reformulation patterns for 964,780 Web searching sessions, composed of 1,523,072 queries, to predict the next query reformulation. We employed an n-gram modeling approach to describe the probability of users transitioning from one query-reformulation state to another to predict their next state. We developed first-, second-, third-, and fourth-order models and evaluated each model for accuracy of prediction, coverage of the dataset, and complexity of the possible pattern set. The results show that Reformulation and Assistance account for approximately 45% of all query reformulations; furthermore, the results demonstrate that the first- and second-order models provide the best predictability, between 28 and 40% overall and higher than 70% for some patterns. Implications are that the n-gram approach can be used for improving searching systems and searching assistance.", "paper_title": "Patterns of Query Reformulation During Web Searching", "paper_id": "WOS:000266892700006"}