{"auto_keywords": [{"score": 0.049522654987196275, "phrase": "domain_specific_language"}, {"score": 0.02637889886048238, "phrase": "midgar"}, {"score": 0.00481495049065317, "phrase": "heterogeneous_objects_interconnecting_applications"}, {"score": 0.004667149874736771, "phrase": "things_scenarios"}, {"score": 0.004630910803911567, "phrase": "smart_objects"}, {"score": 0.003916098498242888, "phrase": "data_traffic"}, {"score": 0.0029800360974218836, "phrase": "inexperienced_people"}, {"score": 0.002766963729586353, "phrase": "application_generation_problem"}, {"score": 0.0025292620341476283, "phrase": "different_objects"}, {"score": 0.002385326947545194, "phrase": "ubiquitous_and_heterogeneous_objects"}, {"score": 0.002357535807803925, "phrase": "graphic_editor"}, {"score": 0.002284997292969484, "phrase": "dsl."}, {"score": 0.002154930852763048, "phrase": "graphical_editor"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Internet of Things", " Ubiquitous computing", " Sensor network", " Model Driven Engineering", " Domain Specific Language", " Smart Objects"], "paper_abstract": "Smart Objects and Internet of Things are two ideas that describe the future. The interconnection of objects can make them intelligent or expand their intelligence. This is achieved by a network that connects all the objects in the world. A network where most of the data traffic comes from objects instead of people. Cities, houses, cars or any other objects that come to life, respond, work and make their owner's life easier. This is part of that future. But first, there are many basic problems that must be solved. In this paper we propose solutions for many of these problems: the interconnection of ubiquitous, heterogeneous objects and the generation of applications allow inexperienced people to interconnect them. For that purpose, we present three possible solutions: a Domain Specific Language capable of abstracting the application generation problem; a graphic editor that simplifies the creation of that DSL: and an loT platform (Midgar) able to interconnect different objects between them. Through Midgar, you can register objects and create interconnection between ubiquitous and heterogeneous objects through a graphic editor that generates a model defined by the DSL. From this model, Midgar generates the interconnection defined by the user with the graphical editor. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Midgar: Generation of heterogeneous objects interconnecting applications. A Domain Specific Language proposal for Internet of Things scenarios", "paper_id": "WOS:000335610700010"}