{"auto_keywords": [{"score": 0.034669398656551116, "phrase": "electronic_structure"}, {"score": 0.03422415646346582, "phrase": "bchl"}, {"score": 0.004386063799793622, "phrase": "single_molecule"}, {"score": 0.003995226376780718, "phrase": "uv_absorbance"}, {"score": 0.003959863717046575, "phrase": "red_spectrum"}, {"score": 0.00378767277402891, "phrase": "protein_chain"}, {"score": 0.0035590664550919854, "phrase": "peripheral_hydrogen_bonds"}, {"score": 0.003404244237372396, "phrase": "hydrogen_bonding"}, {"score": 0.003073154478201771, "phrase": "theoretic_studies"}, {"score": 0.0029394074636168435, "phrase": "theoretical_molecular_modeling_study_case"}, {"score": 0.002874726518572154, "phrase": "experimental_mutations"}, {"score": 0.0026534064006291853, "phrase": "experimental_results"}, {"score": 0.00258347644721642, "phrase": "likely_place"}, {"score": 0.0025492038831408715, "phrase": "nearby_arginine"}, {"score": 0.00241658945942583, "phrase": "x-ray_crystallographic_structure"}, {"score": 0.002200861826643147, "phrase": "acetyl_group"}, {"score": 0.0021049977753042253, "phrase": "bchl_molecule"}], "paper_keywords": ["Acidophila", " Bacteriochlorophyll", " B800", " LHC", " Light harvesting center", " Molecular dynamics", " PM6"], "paper_abstract": "Bacterial light-harvesting II (LH-II) centers contain two types of Bacteriochlorophylls (Bchl). One is named B800 and found as a single molecule within one monomer of the complex while the other named B850 is found as a dimer. Their names indicate their peak of UV absorbance around red spectrum. Both types of molecules are attached to the protein chain via ligation of their central Magnesium atom to an either Histidine or Deoxymethionine amino acid. They are also coordinated by peripheral hydrogen bonds that they accept with their carboxyl side group. Both the ligation and the hydrogen bonding are thought to have an effect on electronic structure of the Bchl hence its UV absorbance and energy transfer rate. Experiments and theoretic studies performed on this subject support the above idea. This theoretical molecular modeling study case aims to mimic the experimental mutations performed on certain amino acids in silico and study its effects on the electronic structure of Bchl. By comparison with experimental results it was observed that the likely place for the nearby Arginine is not below the plane of the Bchl as in the X-ray crystallographic structure but above the plane defined by the four nitrogen atoms and their rings. It was also seen that the coordination of the acetyl group is very sensitive to changes in ligation of the Bchl molecule.", "paper_title": "A PM6 study of Rhodopseudomonas Acidophila light harvesting center II B800 bacteriochlorophylls in representative protein environment", "paper_id": "WOS:000291041800006"}