{"auto_keywords": [{"score": 0.04860000689752459, "phrase": "minimization_problem"}, {"score": 0.04811643643051334, "phrase": "fuzzy_automata"}, {"score": 0.03164862791969669, "phrase": "fuzzy_polynomial_equations"}, {"score": 0.004382364826200616, "phrase": "minimal_state_fuzzy_automaton"}, {"score": 0.004224786847720058, "phrase": "decision_version"}, {"score": 0.0040094142308666975, "phrase": "fuzzy_automaton_a"}, {"score": 0.003946960862020283, "phrase": "natural_number_k"}, {"score": 0.0036680857629458785, "phrase": "k-state_fuzzy_automaton"}, {"score": 0.002374735066990346, "phrase": "minimization_algorithms"}, {"score": 0.002241679436497571, "phrase": "state_minimization"}, {"score": 0.0021049977753042253, "phrase": "minimal_fuzzy_automaton"}], "paper_keywords": ["Equivalence", " fuzzy automata", " minimization"], "paper_abstract": "This paper investigates the minimization problem of fuzzy automata, aiming to obtain a procedure for finding a minimal state fuzzy automaton equivalent to a given one. The decision version of the minimization problem is as follows: Given a fuzzy automaton A and a natural number k, i.e., a pair < A, k >, is there a k-state fuzzy automaton equivalent to A? We prove that the above problem is decidable for fuzzy automata over totally ordered lattices and then obtain a procedure for minimizing a given fuzzy automaton. To this end, we introduce the concept of systems of fuzzy polynomial equations, present a procedure for finding solutions of these systems and, finally, reduce the above decision problem to finding a solution of a system of fuzzy polynomial equations. It is worth pointing out that although some algorithms in the literature were claimed to be minimization algorithms, the term \"minimization\" there did not mean state minimization in our sense, since these algorithms did not aim at a minimal fuzzy automaton but found \"reasonably\" small fuzzy automata.", "paper_title": "On the State Minimization of Fuzzy Automata", "paper_id": "WOS:000352279600014"}