{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "structural_functions"}, {"score": 0.043233070917384396, "phrase": "new_definitions"}, {"score": 0.004633747992595526, "phrase": "article_system_linkage"}, {"score": 0.003986103192038901, "phrase": "new_results"}, {"score": 0.00387011040370557, "phrase": "structural_input-output_function"}, {"score": 0.003541923233726252, "phrase": "graph_theory"}, {"score": 0.0034185505275141077, "phrase": "specific_set_theory_concepts"}, {"score": 0.0033584796908285894, "phrase": "continuous_function_properties"}, {"score": 0.002914288956035066, "phrase": "continuous_point"}, {"score": 0.00285460207697422, "phrase": "discrete_approach"}, {"score": 0.0027878797103973313, "phrase": "new_developments"}, {"score": 0.0023415390666563177, "phrase": "latter_set"}, {"score": 0.0023139986108451946, "phrase": "direct_influences"}, {"score": 0.0022800270693436155, "phrase": "former_set"}, {"score": 0.0022201273900989416, "phrase": "invariant_set_concept"}, {"score": 0.0021049977753042253, "phrase": "possible_relationships"}], "paper_keywords": ["structural function", " coverage between sets", " invariant sets", " binary relations"], "paper_abstract": "Based on some of the results and definitions provided in the article System linkage: Structural functions and hierarchies (Lloret et al. \"System linkage: structural functions and hierarchies\", Cybern. Syst. Int. J., 29, pp. 35-46, 1998) and adding new definitions that are in keeping with the spirit of the same article, new results have been obtained that explore the utility of the structural input-output function (also transferable to the other structural functions) and that expand on studies conducted to date on variables (cells). Our approach is based principally on the application of graph theory to the study of relationships between variables (cells) using specific set theory concepts, introducing new definitions and adapting continuous function properties to our discrete environment. More specifically, we present two new concepts-coverage between sets and the invariant set-analysing their inter-relatedness from the perspective of structural functions, i.e. from the point of view of influences in the system. To date these concepts have been handled from a continuous point of view, and so the discrete approach described here will lay the foundations for new developments in this direction. Although the development of the concepts may, a priori, appear to very theoretical, they are, in fact, much more practical than would appear to be the case. A result such as the fact that A covers B, for example, can be interpreted in terms of the latter set being formed of direct influences from elements in the former set in relation to one or more than one relationships. Analogously, the invariant set concept may be interpreted as the set maintaining its structure and status, remaining constant with respect to any possible relationships.", "paper_title": "Coverage and invariability by structural functions", "paper_id": "WOS:000241819200006"}