{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "new_type"}, {"score": 0.004683292152590589, "phrase": "aghdaii_et_al"}, {"score": 0.004122351497440992, "phrase": "edge_collapse"}, {"score": 0.004076858589744185, "phrase": "surface_subdivision"}, {"score": 0.0036892809673917592, "phrase": "surface_topology"}, {"score": 0.0036485497734171294, "phrase": "surface_feature_preservation"}, {"score": 0.0028417741269408194, "phrase": "feature_edges"}, {"score": 0.002614534850703364, "phrase": "remeshed_models"}, {"score": 0.0025287979714720423, "phrase": "original_surface"}, {"score": 0.002225334593038328, "phrase": "mesh_regularization"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Remeshing", " Connectivity regularization", " Feature edges", " Triangular mesh", " 2-manifold", " Closed mesh"], "paper_abstract": "567-meshes are a new type of closed and 2-manifold triangular meshes introduced by Aghdaii et al. in 2012 [1]. Vertices with valence less than 5 or greater than 7 are problematic for many mesh processing tasks such as edge collapse or surface subdivision. However, vertices with valence equal to 6 everywhere is most often impossible due to either surface topology or surface feature preservation, that is why 567-meshes are particularly of interest. This paper proposes a 567-remeshing algorithm that locally retriangulates the mesh considering vertex valence, vertex budget and mesh fidelity as a whole. This algorithm also offers the possibility to preserve a set of feature edges during remeshing. This results in a framework capable of low budget 567-remeshing where remeshed models have a much higher fidelity to the original surface compared to the state of the art. As applications of this work, we demonstrate that our remeshing improves the performances of mesh regularization and mesh connectivity compression. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Low budget and high fidelity relaxed 567-remeshing", "paper_id": "WOS:000351785600002"}