{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "social_interactions"}, {"score": 0.0047761092701293474, "phrase": "probabilistic_latent_space_models"}, {"score": 0.0046803650677267146, "phrase": "pervasive_concept"}, {"score": 0.004605147081797856, "phrase": "important_role"}, {"score": 0.004549524321051407, "phrase": "people's_behavior"}, {"score": 0.0041115567397326976, "phrase": "english"}, {"score": 0.003947973513495612, "phrase": "larger_structural_level"}, {"score": 0.003916098498242888, "phrase": "reciprocity_model"}, {"score": 0.003775803846431323, "phrase": "interpersonal_verbs"}, {"score": 0.003453584878128719, "phrase": "simple_yet_effective_pronoun_templates"}, {"score": 0.003236596168242036, "phrase": "broad-coverage_resource"}, {"score": 0.003210446135114967, "phrase": "unsupervised_clustering_procedures"}, {"score": 0.0031459887611258765, "phrase": "meaningful_semantic_clusters"}, {"score": 0.003120568497402472, "phrase": "reciprocal_instances"}, {"score": 0.0028195727965553367, "phrase": "gender_differences"}, {"score": 0.002751751956416832, "phrase": "textual_context"}, {"score": 0.0026103363762901423, "phrase": "pattern_discovery_procedure"}, {"score": 0.0025167026017217926, "phrase": "clustering_procedures"}, {"score": 0.0024862418814045723, "phrase": "pairwise_membership"}, {"score": 0.0023016843709107297, "phrase": "unknown_verb's_affective_value"}, {"score": 0.002148172508419683, "phrase": "positive_and_negative_values"}, {"score": 0.0021049977753042253, "phrase": "presupposition_discovery_procedure"}], "paper_keywords": [""], "paper_abstract": "Reciprocity is a pervasive concept that plays an important role in governing people's behavior, judgments, and thus their social interactions. In this paper we present an analysis of the concept of reciprocity as expressed in English and a way to model it. At a larger structural level the reciprocity model will induce representations and clusters of relations between interpersonal verbs. In particular, we introduce an algorithm that semi-automatically discovers patterns encoding reciprocity based on a set of simple yet effective pronoun templates. Using the most frequently occurring patterns we queried the web and extracted 13,443 reciprocal instances, which represent a broad-coverage resource. Unsupervised clustering procedures are performed to generate meaningful semantic clusters of reciprocal instances. We also present several extensions (along with observations) to these models that incorporate meta-attributes like the verbs' affective value, identify gender differences between participants, consider the textual context of the instances, and automatically discover verbs with certain presuppositions. The pattern discovery procedure yields an accuracy of 97 per cent, while the clustering procedures clustering with pairwise membership and clustering with transitions indicate accuracies of 91 per cent and 64 per cent, respectively. Our affective value clustering can predict an unknown verb's affective value (positive, negative, or neutral) with 51 per cent accuracy, while it can discriminate between positive and negative values with 68 per cent accuracy. The presupposition discovery procedure yields an accuracy of 97 per cent.", "paper_title": "Modeling reciprocity in social interactions with probabilistic latent space models", "paper_id": "WOS:000286996800001"}