{"auto_keywords": [{"score": 0.04581164345377756, "phrase": "sequence_length"}, {"score": 0.040734651226246886, "phrase": "mutation-selection_model"}, {"score": 0.03539191817705608, "phrase": "crossing_times"}, {"score": 0.024199651172537112, "phrase": "asymmetric_parameter"}, {"score": 0.014090430279721879, "phrase": "finite_population"}, {"score": 0.009791836071774725, "phrase": "critical_sequence_length"}, {"score": 0.009081759428588571, "phrase": "stochastic_region"}, {"score": 0.00481495049065317, "phrase": "asymmetric_multiplicative_or_additive_landscape"}, {"score": 0.004236321075918639, "phrase": "asymmetric_multiplicative"}, {"score": 0.004043541331944951, "phrase": "positive_asymmetric_parameter"}, {"score": 0.003973523379376352, "phrase": "fixed_extension_parameter"}, {"score": 0.003039445153076014, "phrase": "infinite_population"}, {"score": 0.0025816953009851072, "phrase": "exponentially_increasing_rates"}], "paper_keywords": ["Crossing time", " asymmetric multiplicative landscape", " additive landscape", " finite population", " mutation-selection model"], "paper_abstract": "This study examines the dependence of crossing time on sequence length for a finite population in an asymmetric multiplicative, or additive, landscape with a positive asymmetric parameter and a fixed extension parameter in three types of mutation-selection model: the coupled discrete-time model, the coupled continuous-time model, and the decoupled continuous-time model. The crossing times for a finite population in the three types of mutation-selection model began to deviate from the crossing times for an infinite population at a critical sequence length. It then increased exponentially as a function of sequence length in the stochastic region where the sequence length was much longer than the critical sequence length. The exponentially increasing rates of the crossing times in the three types of mutation-selection model were similar to each other. These rates were decreased by increasing the asymmetric parameter. Once the asymmetric parameter reached a certain limit the crossing times for the three models in the stochastic region could not be decreased further by increasing the asymmetric parameter past this limit.", "paper_title": "CROSSING TIME THROUGH THE FITNESS BARRIER IN AN ASYMMETRIC MULTIPLICATIVE OR ADDITIVE LANDSCAPE IN THE MUTATION-SELECTION MODEL", "paper_id": "WOS:000298930600008"}