{"auto_keywords": [{"score": 0.04958720442967608, "phrase": "class_size"}, {"score": 0.03166181073351053, "phrase": "potentially_confounding_effect"}, {"score": 0.007091644366108574, "phrase": "fault_prediction_context"}, {"score": 0.006266564398514403, "phrase": "fault-proneness_prediction_models"}, {"score": 0.005862316836988119, "phrase": "confounding_effect"}, {"score": 0.005681632969351685, "phrase": "object-oriented_metrics"}, {"score": 0.004716520738331953, "phrase": "fault_prediction"}, {"score": 0.00448071734021664, "phrase": "prediction_performance"}, {"score": 0.0037188360359702182, "phrase": "in-depth_understanding"}, {"score": 0.0035681790580031998, "phrase": "true_associations"}, {"score": 0.0033895917080039337, "phrase": "fault_prediction_models"}, {"score": 0.003370907075333389, "phrase": "statistical_methods"}, {"score": 0.0030396665931462, "phrase": "linear_regression-based_method"}, {"score": 0.002670884656785558, "phrase": "open-source_software_systems"}, {"score": 0.0023958326775913165, "phrase": "general_exists"}, {"score": 0.0023225701080913388, "phrase": "proposed_linear_regression-based_method"}], "paper_keywords": ["Measurement", " Theory", " Metrics", " class size", " confounding effect", " fault", " prediction"], "paper_abstract": "Background. The extent of the potentially confounding effect of class size in the fault prediction context is not clear, nor is the method to remove the potentially confounding effect, or the influence of this removal on the performance of fault-proneness prediction models. Objective. We aim to provide an in-depth understanding of the effect of class size on the true associations between object-oriented metrics and fault-proneness. Method. We first employ statistical methods to examine the extent of the potentially confounding effect of class size in the fault prediction context. After that, we propose a linear regression-based method to remove the potentially confounding effect. Finally, we empirically investigate whether this removal could improve the prediction performance of fault-proneness prediction models. Results. Based on open-source software systems, we found: (a) the confounding effect of class size on the associations between object-oriented metrics and fault-proneness in general exists; (b) the proposed linear regression-based method can effectively remove the confounding effect; and (c) after removing the confounding effect, the prediction performance of fault prediction models with respect to both ranking and classification can in general be significantly improved. Conclusion. We should remove the confounding effect of class size when building fault prediction models.", "paper_title": "An In-Depth Study of the Potentially Confounding Effect of Class Size in Fault Prediction", "paper_id": "WOS:000331615400010"}