{"auto_keywords": [{"score": 0.0486868426803837, "phrase": "green"}, {"score": 0.00481495049065317, "phrase": "hierarchical_identity-based_encryption"}, {"score": 0.004722689607998171, "phrase": "ateniese"}, {"score": 0.004577440795549049, "phrase": "id-based_proxy"}, {"score": 0.0034944094552943, "phrase": "chosen_ciphertext_attack"}, {"score": 0.003027178161479457, "phrase": "multi-use_unidirectional_ibpre_scheme"}, {"score": 0.00284137141260141, "phrase": "collusion_attack"}, {"score": 0.0027819985260847577, "phrase": "important_security_requirement"}, {"score": 0.002758597251689795, "phrase": "unidirectional_proxy"}, {"score": 0.0025674490885184173, "phrase": "non-anonymous_hierarchical_identity-based_encryption"}, {"score": 0.0024974092029312616, "phrase": "waters"}, {"score": 0.0023395610923736595, "phrase": "nahibe_scheme"}, {"score": 0.002195866991284673, "phrase": "collusion-resistant_muibpre_scheme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["ID-based proxy re-encryption", " Multi-usability", " Unidirectionality", " Chosen ciphertext security", " Collusion resistance"], "paper_abstract": "At ACNS 2007, Ateniese and Green proposed the concept of ID-based proxy re-encryption (IBPRE), where a semi-trusted proxy with some information (a.k.a. re-encryption key), can transform a ciphertext under an identity to another ciphertext under another identity with the same plaintext. However, the proxy cannot obtain the plaintext. Recently. Wang et al. revisited this primitive by allowing the chosen ciphertext attack when the ciphertext could be transformed several times. They also proposed a concrete multi-use unidirectional ID-based proxy re-encryption (MUIBPRE) scheme, which is proven secure in the random oracle. Nonetheless, they left the problem of constructing a multi-use unidirectional IBPRE scheme in the standard model. What is worse, their scheme cannot resist the collusion attack, which is an important security requirement for unidirectional proxy re-encryption. To solve this problem, in this paper we present a conversion from non-anonymous hierarchical identity-based encryption (NaHIBE) with strongly CPA security to CCA-secure and collusion-resistant MUIBPRE. Furthermore, based on the NaHIBE scheme proposed by Waters at Crypto'09, we give the first CCA-secure and collusion-resistant MUIBPRE scheme in the standard model. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Multi-use unidirectional identity-based proxy re-encryption from hierarchical identity-based encryption", "paper_id": "WOS:000305664500006"}