{"auto_keywords": [{"score": 0.04954033184026155, "phrase": "directional_antennas"}, {"score": 0.02322730111336099, "phrase": "wireless_networks"}, {"score": 0.004524348699657099, "phrase": "new_unexplored_problem"}, {"score": 0.004398094237005956, "phrase": "optimal_patterns"}, {"score": 0.004324031677173549, "phrase": "connected_coverage"}, {"score": 0.0037532257703888315, "phrase": "larger_communication_distance"}, {"score": 0.0035666632046674153, "phrase": "proper_scheduling_mechanisms"}, {"score": 0.003447451122274614, "phrase": "networking_performance"}, {"score": 0.0032026066791743866, "phrase": "deployment_patterns"}, {"score": 0.003148612096891635, "phrase": "full_coverage"}, {"score": 0.0026113524778702624, "phrase": "detailed_analysis"}, {"score": 0.0023579143175099324, "phrase": "strong_interference"}, {"score": 0.002279011030331704, "phrase": "communication_range"}, {"score": 0.0021049977753042253, "phrase": "unstable_and_fickle_physical_environments"}], "paper_keywords": ["Theory", " Directional antenna", " wireless networks", " optimal deployment pattern", " connected coverage"], "paper_abstract": "In this article, we address a new unexplored problem: what are the optimal patterns to achieve connected coverage in wireless networks with directional antennas. As their name implies, directional antennas can focus their transmission energy in a certain direction. This feature leads to lower cross-interference and larger communication distance. It has been shown that, with proper scheduling mechanisms, directional antennas may substantially improve networking performance in wireless networks. In this article, we propose a set of deployment patterns to achieve full coverage and up to 2-connectivity under two different antenna models, namely the sector model and the knob model. These patterns are optimal under most combinations of communication and sensing ranges. We also introduce with detailed analysis several fundamental theorems and conjectures. Finally, we examine a more realistic physical model, where there might be strong interference and both the sensing range and the communication range might be irregular. The results show that our designed patterns work well even in unstable and fickle physical environments.", "paper_title": "Connected Coverage in Wireless Networks with Directional Antennas", "paper_id": "WOS:000337804100014"}