{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "smartphone_personalisation"}, {"score": 0.004618893461411858, "phrase": "present_report"}, {"score": 0.004547438494330851, "phrase": "empirical_analysis"}, {"score": 0.0040771431404398855, "phrase": "physical_appearance"}, {"score": 0.003972504904621217, "phrase": "user-driven_personalisation"}, {"score": 0.003870541730075597, "phrase": "simple_heuristic_approach"}, {"score": 0.0033633514001658086, "phrase": "gender_differences"}, {"score": 0.0032940691998512963, "phrase": "device_usage"}, {"score": 0.002633425544817301, "phrase": "greater_periods"}, {"score": 0.0025657442830956017, "phrase": "broader_range"}, {"score": 0.00239778324260337, "phrase": "greater_degree"}, {"score": 0.0021381565332182773, "phrase": "possible_factors"}, {"score": 0.0021049977753042253, "phrase": "large_user_diversity"}], "paper_keywords": ["personalisation", " customisation", " adaptability", " smartphones", " iPhone", " usability"], "paper_abstract": "The present report is an empirical analysis of smartphone personalisation. We collected data from two groups of users to measure how they adapt the content, interface and physical appearance of their devices. This user-driven personalisation is measured with a simple heuristic approach to quantify the behaviour. Using these scores, we explore how users differ from each other in how they personalise their smartphones with a focus on gender differences, usability and device usage in the wild. Among our findings are that not all users personalise their smartphones, females and males personalise their iPhones differently, and those who personalised their phones more tended to rate it as more usable. The users who personalised more also used their device for greater periods of time on a broader range of applications. For instance, individuals who adapted their iPhones to a greater degree also accessed the Web more often and spent more time browsing once it was accessed. We conclude with a discussion of possible factors underlying the large user diversity of smartphone personalisation found in this research.", "paper_title": "An empirical analysis of smartphone personalisation: measurement and user variability", "paper_id": "WOS:000308863100006"}