{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "land-use_patterns"}, {"score": 0.010464002736181506, "phrase": "geographic_information"}, {"score": 0.004680473391946691, "phrase": "large_number"}, {"score": 0.004506968388996092, "phrase": "geo-located_information"}, {"score": 0.004081385289516914, "phrase": "remote-sensing_techniques"}, {"score": 0.004023947242621452, "phrase": "official_data"}, {"score": 0.003820156931332476, "phrase": "vienna"}, {"score": 0.003784218811484741, "phrase": "austria"}, {"score": 0.0037133478610481994, "phrase": "spatial_pattern"}, {"score": 0.003410479630045025, "phrase": "hierarchical_gis-based_decision_tree_approach"}, {"score": 0.002987557906013826, "phrase": "resulting_land-use_patterns"}, {"score": 0.002931569771634119, "phrase": "texture-variability_analysis"}, {"score": 0.0028093921138602606, "phrase": "land_segment"}, {"score": 0.0027437235598539904, "phrase": "achieved_land-use_map"}, {"score": 0.0025316905609748135, "phrase": "gmesua_data"}, {"score": 0.00218623706110975, "phrase": "promising_avenue"}, {"score": 0.002155412043665635, "phrase": "freely_available_vgi"}, {"score": 0.0021049977753042253, "phrase": "environmental_planning_purposes"}], "paper_keywords": ["OpenStreetMap", " land use", " Global Monitoring for Environment and Security Urban Atlas", " hierarchical GIS-based decision tree approach", " Vienna"], "paper_abstract": "A large number of applications have been launched to gather geo-located information from the public. This article introduces an approach toward generating land-use patterns from volunteered geographic information (VGI) without applying remote-sensing techniques and/or engaging official data. Hence, collaboratively collected OpenStreetMap (OSM) data sets are employed to map land-use patterns in Vienna, Austria. Initially the spatial pattern of the landscape was delineated and thereafter the most relevant land type was assigned to each land parcel through a hierarchical GIS-based decision tree approach. To evaluate the proposed approach, the results are compared with the Global Monitoring for Environment and Security Urban Atlas (GMESUA) data. The results are compared in two ways: first, the texture of the resulting land-use patterns is analyzed using texture-variability analysis. Second, the attributes assigned to each land segment are evaluated. The achieved land-use map shows kappa indices of 91, 79, and 76% agreement for location in comparison with the GMESUA data set at three levels of classification. Furthermore, the attributes of the two data sets match at 81, 67, and 65%. The results demonstrate that this approach opens a promising avenue to integrate freely available VGI to map land-use patterns for environmental planning purposes.", "paper_title": "Toward mapping land-use patterns from volunteered geographic information", "paper_id": "WOS:000326350400002"}