{"auto_keywords": [{"score": 0.03611123578733921, "phrase": "total_weight"}, {"score": 0.007475913846248241, "phrase": "satisfied_equations"}, {"score": 0.00625996407127786, "phrase": "parameterized_problem"}, {"score": 0.00481495049065317, "phrase": "parameterized_complexity"}, {"score": 0.003998286635727259, "phrase": "positive_integral_weight_w"}, {"score": 0.003812896124654341, "phrase": "broken_vertical_bar"}, {"score": 0.0032419780984892033, "phrase": "s."}, {"score": 0.002901538668877986, "phrase": "nonnegative_parameter"}, {"score": 0.002723367507064405, "phrase": "exactly_three_variables"}, {"score": 0.0026594033724490172, "phrase": "exactly_three_equations"}, {"score": 0.0021049977753042253, "phrase": "polynomial_time"}], "paper_keywords": ["Parameterized complexity", " Linear equations", " Finite field"], "paper_abstract": "The problem MaxLin2 can be stated as follows. We are given a system S of m equations in variables x (1),aEuro broken vertical bar,x (n) , where each equation is assigned a positive integral weight w (j) and , I (j) aS dagger{1,2,aEuro broken vertical bar,n} for j=1,aEuro broken vertical bar,m. We are required to find an assignment of values in to the variables in order to maximize the total weight of the satisfied equations. Let W be the total weight of all equations in S. We consider the following parameterized version of MaxLin2: decide whether there is an assignment satisfying equations of total weight at least W-k, where k is a nonnegative parameter. We prove that this parameterized problem is W[1]-hard even if each equation of S has exactly three variables and every variable appears in exactly three equations and, moreover, each weight w (j) equals 1 and no two equations have the same left-hand side. We show the tightness of this result by proving that if each equation has at most two variables then the parameterized problem is fixed-parameter tractable. We also prove that if no variable appears in more than two equations then we can maximize the total weight of satisfied equations in polynomial time.", "paper_title": "Parameterized Complexity of Satisfying Almost All Linear Equations over F-2", "paper_id": "WOS:000317611100006"}