{"auto_keywords": [{"score": 0.04367269561371385, "phrase": "twitter_data"}, {"score": 0.010612387000973441, "phrase": "twitter_research"}, {"score": 0.007948972862368139, "phrase": "ethical_considerations"}, {"score": 0.007402793428220448, "phrase": "twitter"}, {"score": 0.005614720748571636, "phrase": "twitter-based_research"}, {"score": 0.004383852039913171, "phrase": "systematic_analysis"}, {"score": 0.004344855841195913, "phrase": "academic_research"}, {"score": 0.003293142761521425, "phrase": "data_collection"}, {"score": 0.0030932495918679285, "phrase": "noteworthy_trends"}, {"score": 0.0030113280682863234, "phrase": "twitter-based_research_overall"}, {"score": 0.002644865209801606, "phrase": "benchmark_analysis"}, {"score": 0.0025632898741546556, "phrase": "continued_growth"}, {"score": 0.002451088210833819, "phrase": "first_full-text_systematic_analysis"}, {"score": 0.0024292428060702803, "phrase": "twitter-based_research_projects"}, {"score": 0.0022112700457629494, "phrase": "broader_research_community"}, {"score": 0.0021720199689914464, "phrase": "social_media-based_research"}, {"score": 0.0021239335561699106, "phrase": "reflexive_evaluation"}], "paper_keywords": ["Social media", " Privacy", " Twitter", " Research ethics", " Internet research ethics", " Twitter analytics"], "paper_abstract": "Purpose - The purpose of this paper is to engage in a systematic analysis of academic research that relies on the collection and use of Twitter data, creating topology of Twitter research that details the disciplines and methods of analysis, amount of tweets and users under analysis, the methods used to collect Twitter data, and accounts of ethical considerations related to these projects. Design/methodology/approach - Content analysis of 382 academic publications from 2006 to 2012 that used Twitter as their primary platform for data collection and analysis. Findings - The analysis of over 380 scholarly publications utilizing Twitter data reveals noteworthy trends related to the growth of Twitter-based research overall, the disciplines engaged in such research, the methods of acquiring Twitter data for analysis, and emerging ethical considerations of such research. Research limitations/implications - The findings provide a benchmark analysis that must be updated with the continued growth of Twitter-based research. Originality/value - The research is the first full-text systematic analysis of Twitter-based research projects, focussing on the growth in discipline and methods as well as its ethical implications. It is of value for the broader research community currently engaged in social media-based research, and will prompt reflexive evaluation of what research is occurring, how it is occurring, what is being done with Twitter data, and how researchers are addressing the ethics of Twitter-based research.", "paper_title": "A topology of Twitter research: disciplines, methods, and ethics", "paper_id": "WOS:000341648500001"}