{"auto_keywords": [{"score": 0.042078324571925334, "phrase": "tag_search"}, {"score": 0.041530217665155626, "phrase": "search_box"}, {"score": 0.00481495049065317, "phrase": "different_interfaces"}, {"score": 0.004685575787741084, "phrase": "purpose_-_the_purpose"}, {"score": 0.004317848984770719, "phrase": "tagged_images"}, {"score": 0.0037506567448470163, "phrase": "tag_cloud"}, {"score": 0.0031845067058084583, "phrase": "highest_recall"}, {"score": 0.003056819704624705, "phrase": "ontology_interface"}, {"score": 0.0029610472910087176, "phrase": "ten_tasks"}, {"score": 0.0028293966058473476, "phrase": "textbox-based_search"}, {"score": 0.0024460897937643032, "phrase": "widespread_use"}, {"score": 0.0022847009758393405, "phrase": "resource_discovery"}, {"score": 0.002153450937601075, "phrase": "retrieval_interface"}, {"score": 0.002124247104243502, "phrase": "user_satisfaction"}, {"score": 0.0021049977753042253, "phrase": "retrieval_success"}], "paper_keywords": ["Ontology", " Tag cloud", " Retrieval effectiveness", " Scenarios", " User satisfaction", " Information retrieval", " User interfaces"], "paper_abstract": "Purpose - The purpose of this study was to compare the ease of use and the effectiveness of several interfaces for retrieving tagged images. Design/methodology/approach - A number of participants were randomly assigned to one of four retrieval interfaces: tag search in a search box; faceted tag search in a search box; selecting terms from the tag cloud of all the tags in the database; and selecting concepts from an ontology created from the tags assigned to the images. Each interface was tested by 21 users. Findings - The results show that the highest recall on average was achieved by users of the ontology interface, for seven out of the ten tasks, however, users were more satisfied with the textbox-based search than the cloud or the ontology. Research limitations/implications - The experiment was rather specific, and more studies are needed in order to generalize the findings. Originality/value - With the widespread use of tagging on the web it is of importance to examine whether tagging enables resource discovery. This study shows that in addition to the tags, the retrieval interface also influences user satisfaction and retrieval success.", "paper_title": "Tag-based retrieval of images through different interfaces: a user study", "paper_id": "WOS:000310124100008"}