{"auto_keywords": [{"score": 0.04524114703359911, "phrase": "original_protocol"}, {"score": 0.033413566842277836, "phrase": "secret_parameters"}, {"score": 0.004619027561771169, "phrase": "short_term"}, {"score": 0.004431041346291019, "phrase": "rfid_passive_tags"}, {"score": 0.003550168303072723, "phrase": "lo"}, {"score": 0.003517234832009835, "phrase": "yeh"}, {"score": 0.0034052594710793664, "phrase": "designers'_claim"}, {"score": 0.0033428820402140683, "phrase": "optimal_security"}, {"score": 0.0032364494905485677, "phrase": "passive_attack"}, {"score": 0.00274017282519193, "phrase": "active_adversary"}, {"score": 0.0024750474634399797, "phrase": "prng-function_evaluation"}, {"score": 0.0024409345168575833, "phrase": "success_probability"}, {"score": 0.002266765479420981, "phrase": "enhanced_epc-compliant_protocol"}, {"score": 0.0022458849724980904, "phrase": "yaya"}, {"score": 0.0021945194903838132, "phrase": "minor_modifications"}, {"score": 0.0021049977753042253, "phrase": "claimed_security_properties"}], "paper_keywords": ["RFID", " EPC-C1 G2", " Mutual authentication", " Secret disclosure"], "paper_abstract": "EPC class 1 Generation-2 (or in short term EPC-C1 G2) is one of the most important standards for RFID passive tags. However, the original protocol is known to be insecure. To improve the security of this standard, several protocols have been proposed which are compliant to this standard. In this paper, we analyze the security of a protocol which has been recently proposed by Lo and Yeh (2010). Despite the designers' claim, which is optimal security, however, we present a passive attack which can retrieve all secret parameters of the tag efficiently. The cost of this attack is eavesdropping only one session of protocol between the tag and a legitimate reader and 2(16) PRNG-function evaluations in off-line. In addition, we show that an active adversary can retrieve secret parameters more efficiently, that is, with the complexity of two consequence sessions of protocol and without the need for PRNG-function evaluation. The success probability of the given attacks are \"1\". To counteract such flaws, we propose an enhanced EPC-compliant protocol entitled YAYA, by applying some minor modifications to the original protocol so that it provides the claimed security properties.", "paper_title": "Cryptanalysis of a new EPC class-1 generation-2 standard compliant RFID protocol", "paper_id": "WOS:000331638400030"}