{"auto_keywords": [{"score": 0.04915747964534472, "phrase": "information_security"}, {"score": 0.005577918035414455, "phrase": "security_machine"}, {"score": 0.004041879818641576, "phrase": "gilles_deleuze"}, {"score": 0.0040027552011993005, "phrase": "felix_guattari's_philosophical_concepts"}, {"score": 0.003409057326528229, "phrase": "technical_devices"}, {"score": 0.003376037544631762, "phrase": "physical_barriers"}, {"score": 0.0031690434364310435, "phrase": "security_machine's_protective_tasks"}, {"score": 0.0029747028229638625, "phrase": "chaotic_forces"}, {"score": 0.0028195727965553367, "phrase": "fragile_order"}, {"score": 0.0021049977753042253, "phrase": "protected_system"}], "paper_keywords": ["Information Security", " Spatiality", " Territory", " Information Security Threat", " Socio-Technical Security"], "paper_abstract": "Traditionally, information security has been approached in terms of how to achieve the confidentiality, integrity, and availability of information. In this paper, we seek to ontologically examine information security by using Gilles Deleuze and Felix Guattari's philosophical concepts of machine, coupling, interruption, and territory. Through these concepts, we conceptualize information security as an order-seeking, connection-based, territorial security machine that attempts to subject and harness other actors - from technical devices and physical barriers to employees and various combinations of these actors - to carry out the security machine's protective tasks. The goal of the security machine is to block or interrupt the chaotic forces of the outside and, thus, to maintain the fragile order of information. However, the process of interrupting the outside requires interruption of the inside as well: users and organizations are interrupted daily by the security machine and its practices. Yet this aspect of information security has remained largely unexamined. We argue that the question of what information security does to its subjects - what its effects are - in the protected system should be examined more thoroughly.", "paper_title": "The Order Machine - The Ontology of Information Security", "paper_id": "WOS:000309813500002"}