{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "comprehensive_formal_verification"}, {"score": 0.004625255533545965, "phrase": "in-depth_coverage"}, {"score": 0.004563691742821759, "phrase": "comprehensive_machine-checked_formal_verification"}, {"score": 0.004267896572751978, "phrase": "kernel_design"}, {"score": 0.004045068727683462, "phrase": "functional_correctness_proof"}, {"score": 0.003991196463806465, "phrase": "kernel's_c_implementation"}, {"score": 0.0035532533960012298, "phrase": "binary_code"}, {"score": 0.0034437574674180365, "phrase": "c_semantics"}, {"score": 0.003367611042980526, "phrase": "correct_access-control_enforcement"}, {"score": 0.003293142761521425, "phrase": "information-flow_noninterference"}, {"score": 0.0030248298759040695, "phrase": "user-level_systems"}, {"score": 0.002984504445973107, "phrase": "kernel-level_access-control_enforcement"}, {"score": 0.002741269087816162, "phrase": "coherent_overall_analysis"}, {"score": 0.002418393046947528, "phrase": "formal_proof"}, {"score": 0.0021049977753042253, "phrase": "evolving_formally_verified_code_base"}], "paper_keywords": ["Verification", " Security", " Reliability", " seL4", " Isabelle/HOL", " operating systems", " microkernel", " L4"], "paper_abstract": "We present an in-depth coverage of the comprehensive machine-checked formal verification of seL4, a general-purpose operating system microkernel. We discuss the kernel design we used to make its verification tractable. We then describe the functional correctness proof of the kernel's C implementation and we cover further steps that transform this result into a comprehensive formal verification of the kernel: a formally verified IPC fastpath, a proof that the binary code of the kernel correctly implements the C semantics, a proof of correct access-control enforcement, a proof of information-flow noninterference, a sound worst-case execution time analysis of the binary, and an automatic initialiser for user-level systems that connects kernel-level access-control enforcement with reasoning about system behaviour. We summarise these results and show how they integrate to form a coherent overall analysis, backed by machine-checked, end-to-end theorems. The seL4 microkernel is currently not just the only general-purpose operating system kernel that is fully formally verified to this degree. It is also the only example of formal proof of this scale that is kept current as the requirements, design and implementation of the system evolve over almost a decade. We report on our experience in maintaining this evolving formally verified code base.", "paper_title": "Comprehensive Formal Verification of an OS Microkernel", "paper_id": "WOS:000332125400002"}