{"auto_keywords": [{"score": 0.04159267344622788, "phrase": "hmpso"}, {"score": 0.010612387000973441, "phrase": "hybrid_multi-swarm_particle_swarm_optimization"}, {"score": 0.004632039024076267, "phrase": "real-world_applications"}, {"score": 0.004513957235071457, "phrase": "different_types"}, {"score": 0.004342430078306461, "phrase": "constrained_optimization_problems"}, {"score": 0.004123781267600542, "phrase": "optimization_field"}, {"score": 0.003751011827704279, "phrase": "parallel_search_operator"}, {"score": 0.003686935223424015, "phrase": "current_swarm"}, {"score": 0.003592859432554987, "phrase": "particle_swarm_optimization"}, {"score": 0.003471135453226184, "phrase": "search_engine"}, {"score": 0.003267925215811654, "phrase": "search_space"}, {"score": 0.0032398798149196432, "phrase": "differential_evolution"}, {"score": 0.0027982016314450717, "phrase": "simulation_results"}, {"score": 0.0022457226013538343, "phrase": "evolutionary_computation"}, {"score": 0.0021883400011393564, "phrase": "experimental_results"}], "paper_keywords": ["constrained optimization problems", " constraint-handling technique", " particle swarm optimization", " differential evolution"], "paper_abstract": "In the real-world applications, most optimization problems are subject to different types of constraints. These problems are known as constrained optimization problems (COPs). Solving COPs is a very important area in the optimization field. In this paper, a hybrid multi-swarm particle swarm optimization (HMPSO) is proposed to deal with COPs. This method adopts a parallel search operator in which the current swarm is partitioned into several sub-swarms and particle swarm optimization (PSO) is severed as the search engine for each sub-swarm. Moreover, in order to explore more promising regions of the search space, differential evolution (DE) is incorporated to improve the personal best of each particle. First, the method is tested on 13 benchmark test functions and compared with three state-of-the-art approaches. The simulation results indicate that the proposed HMPSO is highly competitive in solving the 13 benchmark test functions. Afterward, the effectiveness of some mechanisms proposed in this paper and the effect of the parameter setting were validated by various experiments. Finally, HMPSO is further applied to solve 24 benchmark test functions collected in the 2006 IEEE Congress on Evolutionary Computation (CEC2006) and the experimental results indicate that HMPSO is able to deal with 22 test functions.", "paper_title": "A hybrid multi-swarm particle swarm optimization to solve constrained optimization problems", "paper_id": "WOS:000207970900005"}