{"auto_keywords": [{"score": 0.040643563268944034, "phrase": "coalition_formation"}, {"score": 0.03448187694539981, "phrase": "coalitions_structures"}, {"score": 0.027167364274584674, "phrase": "proof_theory"}, {"score": 0.00481495049065317, "phrase": "coalition_structures"}, {"score": 0.0047823219739028325, "phrase": "autonomous_agents"}, {"score": 0.004733791336312872, "phrase": "multi-agent_environments"}, {"score": 0.004034444399739595, "phrase": "desired_tasks"}, {"score": 0.003993472712847928, "phrase": "different_algorithms"}, {"score": 0.003899476621346112, "phrase": "task_allocation"}, {"score": 0.003680274684654909, "phrase": "different_solutions"}, {"score": 0.003426373820419672, "phrase": "best_ones"}, {"score": 0.0033116807159861766, "phrase": "unified_formal_framework"}, {"score": 0.002889928791032578, "phrase": "preference_relation"}, {"score": 0.0027088011534576856, "phrase": "unique_coalition_structure"}, {"score": 0.002690406375639144, "phrase": "stable_semantics"}, {"score": 0.0026721361773711315, "phrase": "preferred_semantics"}, {"score": 0.002530359917257626, "phrase": "basic_semantics"}, {"score": 0.0023000698178350415, "phrase": "whole_structure"}, {"score": 0.002200377880796801, "phrase": "different_propositions"}], "paper_keywords": [""], "paper_abstract": "Autonomous agents working in multi-agent environments need to cooperate in order to fulfill tasks. Generally, an agent cannot perform a task alone and needs help from the other agents. One of the solutions to this problem is to look for groups of agents which are able to perform the desired tasks better. Different algorithms have then been proposed for the task allocation via coalition formation. This last is generally seen as a two steps process: i) constructing the different solutions (called coalitions structures), then ii) discussing these solutions between the agents in order to select the best ones which will be adopted. This paper provides a unified formal framework for constructing the coalitions structures. In fact, we will show that the problem of coalition formation can be defined in terms only of a set of coalitions whose structures are abstract, a conflict relationship between the coalitions and a preference relation between the coalitions. Three semantics for coalitions structures will be proposed: a basic semantics which will return a unique coalition structure, stable semantics and preferred semantics. These two last may return several coalitions structures at the same time. A proof theory of the basic semantics will also be proposed. The aim of this proof theory is to test whether a given coalition will be acceptable for the agent or not without computing the whole structure. We will show that this framework is general enough to capture different propositions made in the literature. An instantiation of our framework is given and its properties are studied.", "paper_title": "An argumentation-based model for reasoning about coalition structures", "paper_id": "WOS:000239626900014"}