{"auto_keywords": [{"score": 0.026566810399653005, "phrase": "validation_criteria"}, {"score": 0.0073092308800279835, "phrase": "metrics_validation_criteria"}, {"score": 0.00481495049065317, "phrase": "software_metrics"}, {"score": 0.004756521061849989, "phrase": "spectrum_of_philosophies._context"}, {"score": 0.004660702714929615, "phrase": "new_metric"}, {"score": 0.0044747919503484055, "phrase": "research_community"}, {"score": 0.003695237613399466, "phrase": "valid_metric_centers"}, {"score": 0.0036652492107503956, "phrase": "software_metrics_validation_criteria"}, {"score": 0.0034761488481944657, "phrase": "sound_contributions"}, {"score": 0.0034060348526709634, "phrase": "software_engineering_metrics"}, {"score": 0.00335095982979018, "phrase": "practical_summary"}, {"score": 0.0032567057896906314, "phrase": "academic_literature"}, {"score": 0.0031650944584992726, "phrase": "systematic_literature_review"}, {"score": 0.0029053904956617043, "phrase": "comparative_analysis"}, {"score": 0.0027441711627551064, "phrase": "diverse_view"}, {"score": 0.002688781336915723, "phrase": "valid_metric"}, {"score": 0.00260246764210499, "phrase": "criteria's_categorization"}, {"score": 0.002560352786969071, "phrase": "common_themes"}, {"score": 0.002529213370528279, "phrase": "philosophical_motivations"}, {"score": 0.00220163445285539, "phrase": "new_metrics"}], "paper_keywords": ["Measurement", " Theory", " Software metrics", " validation criterion", " systematic literature review"], "paper_abstract": "Context. Researchers proposing a new metric have the burden of proof to demonstrate to the research community that the metric is acceptable in its intended use. This burden of proof is provided through the multi-faceted, scientific, and objective process of software metrics validation. Over the last 40 years, however, researchers have debated what constitutes a \"valid\" metric. Aim. The debate over what constitutes a valid metric centers on software metrics validation criteria. The objective of this article is to guide researchers in making sound contributions to the field of software engineering metrics by providing a practical summary of the metrics validation criteria found in the academic literature. Method. We conducted a systematic literature review that began with 2,288 papers and ultimately focused on 20 papers. After extracting 47 unique validation criteria from these 20 papers, we performed a comparative analysis to explore the relationships amongst the criteria. Results. Our 47 validation criteria represent a diverse view of what constitutes a valid metric. We present an analysis of the criteria's categorization, conflicts, common themes, and philosophical motivations behind the validation criteria. Conclusions. Although the 47 validation criteria are not conflict-free, the diversity of motivations and philosophies behind the validation criteria indicates that metrics validation is complex. Researchers proposing new metrics should consider the applicability of the validation criteria in terms of our categorization and analysis. Rather than arbitrarily choosing validation criteria for each metric, researchers should choose criteria that can confirm that the metric is appropriate for its intended. use. We conclude that metrics validation criteria provide answers to questions that researchers have about the merits and limitations of a metric.", "paper_title": "Validating Software Metrics: A Spectrum of Philosophies", "paper_id": "WOS:000312826100005"}