{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_sharing"}, {"score": 0.010311914799846536, "phrase": "firm_performance"}, {"score": 0.008529500000558658, "phrase": "business_process_improvement"}, {"score": 0.00819262768097984, "phrase": "organizational_performance"}, {"score": 0.003777088546146369, "phrase": "service_offerings"}, {"score": 0.0034233569308012982, "phrase": "wholesale_or_retailing_operations"}, {"score": 0.0032496585171039797, "phrase": "statistical_technique"}, {"score": 0.0031937337757356526, "phrase": "knowledge_sharing_and_learning_behaviors"}, {"score": 0.0029622717081190667, "phrase": "business_process_improvement_and_product_and_service_offerings"}, {"score": 0.0024899850926034567, "phrase": "knowledge_management"}, {"score": 0.002461313735611462, "phrase": "organizational_learning_activities"}, {"score": 0.002377260665147444, "phrase": "proper_considerations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["knowledge sharing", " learning organization", " business process improvement", " product and services offerings", " organizational performance"], "paper_abstract": "Knowledge sharing and learning behaviors in the workplace are believed to be very important to the success of firms. In this study, the relationships between knowledge sharing and learning behaviors, business process improvement, product and service offerings, and organizational performance are examined based on a sample of 134 firms engaged in manufacturing, and wholesale or retailing operations. Data analyses using the partial least squares statistical technique revealed that knowledge sharing and learning behaviors are positively associated with business process improvement, and product and service offerings. Business process improvement and product and service offerings are positively associated, and they in turn are positively related to organizational performance. The findings reinforce the importance of knowledge sharing and learning to companies. Executives should encourage knowledge management and organizational learning activities within their firms, and give proper considerations to the strategies and implementation of programs supporting these activities in order to enhance firm performance. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "An empirical study of the effects of knowledge sharing and learning behaviors on firm performance", "paper_id": "WOS:000253521900012"}