{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "information_overload"}, {"score": 0.047302204764271674, "phrase": "internet_experience"}, {"score": 0.02453393992301254, "phrase": "information_disorganisation"}, {"score": 0.010246622577385603, "phrase": "customer_purchase_intention"}, {"score": 0.008286314440290418, "phrase": "perceived_risk"}, {"score": 0.007492815883084638, "phrase": "customers'_perceived_risk"}, {"score": 0.0072565163578002575, "phrase": "single_integrative_model"}, {"score": 0.004494570360108983, "phrase": "purpose_-_the_purpose"}, {"score": 0.004332471656145115, "phrase": "research_model"}, {"score": 0.003689053436223376, "phrase": "paper's_objectives"}, {"score": 0.0035722806911457545, "phrase": "ten_most_visited_e-commerce_web_sites"}, {"score": 0.003539640036513676, "phrase": "spain"}, {"score": 0.0033961782274326948, "phrase": "structural_equation"}, {"score": 0.003334309053314909, "phrase": "data_set"}, {"score": 0.0031845067058084583, "phrase": "positive_relationship"}, {"score": 0.0030414140732789186, "phrase": "positive_effect"}, {"score": 0.00226583335721762, "phrase": "e-commerce_environment"}, {"score": 0.002214297250267208, "phrase": "moderating_effect"}, {"score": 0.0021049977753042253, "phrase": "main_conclusions"}], "paper_keywords": ["e-commerce", " Purchase intention", " Information overload", " Perceived risk", " Information disorganization"], "paper_abstract": "Purpose - The purpose of this paper is to develop a research model that examines the effect of information overload and information disorganisation upon customers' perceived risk and purchase intention online in a single integrative model. In addition the paper investigates whether internet experience moderates these relationships. Design/methodology/approach - To achieve the paper's objectives an experiment that involved visiting the ten most visited e-commerce web sites in Spain was conducted. Hypotheses were tested by using structural equation modelling on a data set of 1,396 online shopping customers. Findings - The results suggest a positive relationship between information overload and customer purchase intention and that internet experience reinforces this positive effect. Moreover the results confirm that the relationship between information disorganisation and customer purchase intention is not significant and that internet experience does not moderate the relationship. The findings also indicate that perceived risk mediates the relationship between information overload and information disorganisation on customer purchase intention. Originality/value - This work contributes to the literature by exploring the phenomenon of information overload and information disorganisation upon customers' perceived risk and purchase intention in the e-commerce environment as well as the moderating effect of internet experience on these relationships in a single integrative model. The main conclusions of this investigation can be valuable to organisations that implement or intend to implement e-commerce.", "paper_title": "The effect of information overload and disorganisation on intention to purchase online The role of perceived risk and internet experience", "paper_id": "WOS:000342001700006"}