{"auto_keywords": [{"score": 0.03448187694539981, "phrase": "coupling_band"}, {"score": 0.015719716506582538, "phrase": "enhanced_details"}, {"score": 0.015561929573070624, "phrase": "large-scale_fluid"}, {"score": 0.010922563515440072, "phrase": "sph_particles"}, {"score": 0.008220247870559132, "phrase": "two-way_coupling"}, {"score": 0.004591120854640081, "phrase": "difficult_task"}, {"score": 0.004529093447865156, "phrase": "rapid_advancements"}, {"score": 0.004498393285602365, "phrase": "computer_graphics"}, {"score": 0.004437613070853689, "phrase": "grid-based_methods"}, {"score": 0.004216880725292, "phrase": "sub-grid_surface_details"}, {"score": 0.0041316803676012155, "phrase": "multi-level_grid_refinement"}, {"score": 0.003979907786856535, "phrase": "model_details"}, {"score": 0.003873027670786261, "phrase": "increasing_particle_densities"}, {"score": 0.0037947482487057076, "phrase": "hybrid_particle-grid_coupling_method"}, {"score": 0.0037307208089736835, "phrase": "finer_details"}, {"score": 0.0036428866026996707, "phrase": "fluid_grids"}, {"score": 0.003569241993567677, "phrase": "\"coupling_band"}, {"score": 0.003532977898022071, "phrase": "multiple_particle_level_sets"}, {"score": 0.002929573369977573, "phrase": "large-scale_simulation"}, {"score": 0.002812237329893584, "phrase": "diffuse_particles"}, {"score": 0.002681255756642227, "phrase": "distance_function"}, {"score": 0.002530359917257626, "phrase": "coupling_weights"}, {"score": 0.0023079225317714815, "phrase": "fluid_volume"}, {"score": 0.0021484955960643167, "phrase": "existing_works"}], "paper_keywords": ["Hybrid particle-grid simulation", " Fluid animation", " Two-way interaction", " Enhanced details"], "paper_abstract": "Simulating large-scale fluid while retaining and rendering details still remains to be a difficult task in spite of rapid advancements of computer graphics during the last two decades. Grid-based methods can be easily extended to handle large-scale fluid, yet they are unable to preserve sub-grid surface details like spray and foam without multi-level grid refinement. On the other hand, the particle-based methods model details naturally, but at the expense of increasing particle densities. This paper proposes a hybrid particle-grid coupling method to simulate fluid with finer details. The interaction between particles and fluid grids occurs in the vicinity of \"coupling band\" where multiple particle level sets are introduced simultaneously. First, fluids free of interaction could be modeled by grids and SPH particles independently after initialization. A coupling band inside and near the interface is then identified where the grids interact with the particles. Second, the grids inside and far away from the interface are adaptively sampled for large-scale simulation. Third, the SPH particles outside the coupling band are enhanced by diffuse particles which render little computational cost to simulate spray, foam, and bubbles. A distance function is continuously updated to adaptively coarsen or refine the grids near the coupling band and provides the coupling weights for the two-way coupling between grids and particles. One characteristic of our hybrid approach is that the two-way coupling between these particles of spray and foam and the grids of fluid volume can retain details with little extra computational cost. Our rendering results realistically exhibit fluids with enhanced details like spray, foam, and bubbles. We make comprehensive comparisons with existing works to demonstrate the effectiveness of our new method.", "paper_title": "Hybrid particle-grid fluid animation with enhanced details", "paper_id": "WOS:000322018100009"}