{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "oblique_photogrammetry"}, {"score": 0.015386993309409408, "phrase": "kilen"}, {"score": 0.004651177631663439, "phrase": "north_greenland"}, {"score": 0.00403221710768334, "phrase": "eastern_north_greenland"}, {"score": 0.00374610869916551, "phrase": "digital_camera"}, {"score": 0.0035410467987580484, "phrase": "geological_features"}, {"score": 0.003163878786694538, "phrase": "large_number"}, {"score": 0.0031365819432206004, "phrase": "structural_information"}, {"score": 0.0028762004595878714, "phrase": "digital_elevation_model"}, {"score": 0.0026259694526633037, "phrase": "structural_hypotheses"}, {"score": 0.0024183363693242943, "phrase": "structural_knowledge"}, {"score": 0.002387083859537412, "phrase": "remote_area"}, {"score": 0.002356239012561514, "phrase": "arctic"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Oblique photogrammetry", " Structural geology", " 3D modeling", " Field mapping"], "paper_abstract": "We present a workflow for building 3D geological models from oblique photogrammetry of outcrops. The workflow is used to build a 3D model of Kilen, a structurally complex and remotely located pseudonunatak in eastern North Greenland. The area was visited during two brief field seasons during which 1300 oblique photographs were taken by a hand held digital camera from a helicopter. The photos were triangulated and georeferenced and visible geological features as bedding and faults were mapped as 3D polylines. The polylines were used to calculate strike and dip of bedding and faults, generating a large number of structural information. These were imported into a 3D modeling software along with the 3D polylines, an unpublished digitized field map, a Digital Elevation Model, an orthophoto and georeferenced field observations. The 3D modeling software allows us to produce 2D cross-sections and 3D surfaces so that structural hypotheses could be tested through restoration and extrapolation of the data. This workflow proved effective in improving the structural knowledge of a remote area in the Arctic, showing that it is possible to produce quality 3D data from oblique photogrammetry and that those data can be used for 3D modeling. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "From oblique photogrammetry to a 3D model - Structural modeling of Kilen, eastern North Greenland", "paper_id": "WOS:000361400900013"}