{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "gene-expression_data"}, {"score": 0.009648931596423504, "phrase": "original_clustering_genetic_algorithm"}, {"score": 0.007757610810691194, "phrase": "eac"}, {"score": 0.004580314008293946, "phrase": "successful_applications"}, {"score": 0.004545240514015278, "phrase": "clustering_techniques"}, {"score": 0.00427410962921379, "phrase": "gene-expression_analysis_community"}, {"score": 0.003957735532719663, "phrase": "bioinformatics_datasets"}, {"score": 0.003882356585452982, "phrase": "number_k"}, {"score": 0.0032777653153451265, "phrase": "clustering_genetic_algorithm"}, {"score": 0.003178384350932103, "phrase": "optimal_number"}, {"score": 0.003093893243443715, "phrase": "numeric_criteria"}, {"score": 0.0030583717270715556, "phrase": "proposed_improvements"}, {"score": 0.002683125911877974, "phrase": "six_gene-expression_datasets"}, {"score": 0.0026421139329830755, "phrase": "right_clusters"}, {"score": 0.002474674704809152, "phrase": "statistical_comparisons"}, {"score": 0.002427473263013356, "phrase": "computational_efficiency"}, {"score": 0.0023178219772486868, "phrase": "statistical_evidence"}, {"score": 0.0022302306304023602, "phrase": "traditional_method"}, {"score": 0.0022046030435199796, "phrase": "multiple_runs"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["clustering", " evolutionary computation", " bioinformatics", " gene-expression data"], "paper_abstract": "Clustering is a useful. exploratory tool for gene-expression data. Although successful applications of clustering techniques have been reported in the literature, there is no method of choice in the gene-expression analysis community. Moreover, there are only a few works that deal with the problem of automatically estimating the number of clusters in bioinformatics datasets. Most clustering methods require the number k of clusters to be either specified in advance or selected a posteriori from a set of clustering solutions over a range of k. In both cases, the user has to select the number of clusters. This paper proposes improvements to a clustering genetic algorithm that is capable of automatically discovering an optimal number of clusters and its corresponding optimal partition based upon numeric criteria. The proposed improvements are mainly designed to enhance the efficiency of the original clustering genetic algorithm, resulting in two new clustering genetic algorithms and an evolutionary algorithm for clustering (EAC). The original clustering genetic algorithm and its modified versions are evaluated in several runs using six gene-expression datasets in which the right clusters are known a priori. The results illustrate that all the proposed algorithms perform well in gene-expression data, although statistical comparisons in terms of the computational efficiency of each algorithm point out that EAC outperforms the others. Statistical evidence also shows that EAC is able to outperform a traditional method based on multiple runs of k-means over a range of k. (C) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Evolving clusters in gene-expression data", "paper_id": "WOS:000237857700005"}