{"auto_keywords": [{"score": 0.048734215142491676, "phrase": "problem-based_learning"}, {"score": 0.04181790450128155, "phrase": "mediating_skills"}, {"score": 0.036344122484304256, "phrase": "different_internet_information"}, {"score": 0.026864531709185853, "phrase": "well-structured_problems"}, {"score": 0.02463954282161311, "phrase": "ill-structured_problems"}, {"score": 0.00481495049065317, "phrase": "information_search_strategies"}, {"score": 0.004653130437747768, "phrase": "pbl"}, {"score": 0.004600389726895716, "phrase": "instructional_approach"}, {"score": 0.004357928587878973, "phrase": "jonassen"}, {"score": 0.003736110068915636, "phrase": "information_search_literacy"}, {"score": 0.0035898717643894303, "phrase": "informational_repository"}, {"score": 0.00332375606483146, "phrase": "conceptual_framework"}, {"score": 0.0032027318619522916, "phrase": "well_and_ill-structured_problems"}, {"score": 0.003130449195105333, "phrase": "research_site"}, {"score": 0.0030685573113317394, "phrase": "singapore"}, {"score": 0.0029907265264530816, "phrase": "sample_population"}, {"score": 0.002898291237210567, "phrase": "research_findings"}, {"score": 0.0028006988338192375, "phrase": "important_role"}, {"score": 0.002414290278501595, "phrase": "fundamental_information"}, {"score": 0.0021598141021966894, "phrase": "searching_skills"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Problem-based learning", " Problem solving", " Information search skills"], "paper_abstract": "Problem-based learning (PBL) is an instructional approach that is organized around the investigation and resolution of problems. Problems are neither uniform nor similar. Jonassen (1997, 2000) in his design theory of problem solving has categorized problems into two broad types well-structured and ill-structured. He has also described a host of mediating skills that impact problem solving outcomes. The thrust of this paper rests in the argument that the basis of these mediating skills is information search literacy and particularly, in view of the utility of the Internet as an informational repository, effective information searching skills. This study was an investigation of how different Internet information seeking strategies can be used to engage in problem solving. A conceptual framework that explains how different Internet information searching strategies can be employed in successfully solving well and ill-structured problems was devised and empirically tested. The research site was a newly established polytechnic in Singapore that employs problem-based learning to support its curricular implementation. The sample population of students came from a class of 25 first-year students. The research findings of this study inform that information searching skills indeed play an important role in problem solving. The findings affirm the need for students to be systematically instructed in the skills of information searching to be able to accomplish problem solving. The information searching necessary for solving well-structured problems is constrained and readily manageable. Thus, students only have to be acquainted with fundamental information searching skills to solve well-structured problems. On the other hand, the information needs of ill-structured problems are usually complex, multi-disciplinary and expansive. Hence, students have to be trained to apply a more advanced set of information searching skills in resolving ill-structured problems. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A conceptual framework mapping the application of information search strategies to well and ill-structured problem solving", "paper_id": "WOS:000279137800008"}