{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "random_walks"}, {"score": 0.021778582624856994, "phrase": "wireless_networks"}, {"score": 0.008353909014756113, "phrase": "undirected_graphs"}, {"score": 0.00477304262213917, "phrase": "green's"}, {"score": 0.004608997772926119, "phrase": "estimating_wireless_transmission_costs"}, {"score": 0.004392565073466714, "phrase": "query_processing"}, {"score": 0.0035141291835319682, "phrase": "asymmetric_links"}, {"score": 0.003408091901859624, "phrase": "directed_graphs"}, {"score": 0.003305243635051068, "phrase": "random_walk"}, {"score": 0.0030547611342112693, "phrase": "random_walk_theory"}, {"score": 0.0030148941188459987, "phrase": "spectral_graph_theory"}, {"score": 0.0027140798043053986, "phrase": "hitting_times"}, {"score": 0.002530359917257626, "phrase": "unified_theoretical_framework"}, {"score": 0.0024007585788965655, "phrase": "random_walk_query_processing_strategy"}, {"score": 0.0023079225317714815, "phrase": "stateless_routing"}, {"score": 0.0022678201262721323, "phrase": "nearly_all_existing_routing_protocols"}, {"score": 0.0021896891011033105, "phrase": "proposed_digraph-based_analytical_model"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": ["Digraph", " random walk", " spectral graph theory", " transmission cost", " wireless networks"], "paper_abstract": "Various applications in wireless networks, such as routing and query processing, can be formulated as random walks on graphs. Many results have been obtained for such applications by utilizing the theory of random walks (or spectral graph theory), which is mostly developed for undirected graphs. However, this formalism neglects the fact that the underlying (wireless) networks in practice contain asymmetric links, which are best characterized by directed graphs (digraphs). Therefore, random walk on digraphs is a more appropriate model to consider for such networks. In this paper, by generalizing the random walk theory (or spectral graph theory) that has been primarily developed for undirected graphs to digraphs, we show how various transmission costs in wireless networks can be formulated in terms of hitting times and cover times of random walks on digraphs. Using these results, we develop a unified theoretical framework for estimating various transmission costs in wireless networks. Our framework can be applied to random walk query processing strategy and the three routing paradigms-best path routing, opportunistic routing, and stateless routing-to which nearly all existing routing protocols belong. Extensive simulations demonstrate that the proposed digraph-based analytical model can achieve more accurate transmission cost estimation over existing methods.", "paper_title": "Random Walks and Green's Function on Digraphs: A Framework for Estimating Wireless Transmission Costs", "paper_id": "WOS:000315353500011"}