{"auto_keywords": [{"score": 0.049440303515783074, "phrase": "fff"}, {"score": 0.004782718554230406, "phrase": "fused_filament_fabrication"}, {"score": 0.004624751696958501, "phrase": "melted_plastic_filament"}, {"score": 0.00407042677958844, "phrase": "existing_surface"}, {"score": 0.003975781274672803, "phrase": "disposable_support_structure"}, {"score": 0.003767599364361092, "phrase": "empty_space"}, {"score": 0.0037423521744765075, "phrase": "existing_techniques"}, {"score": 0.003717273538121102, "phrase": "support_generation"}, {"score": 0.003487222504700868, "phrase": "dense_structure"}, {"score": 0.003417565253539315, "phrase": "increased_material_usage"}, {"score": 0.0033268412940032103, "phrase": "thin_hierarchical_structures"}, {"score": 0.0032494292163722065, "phrase": "sparse_number"}, {"score": 0.002927626967420519, "phrase": "bottom_surface_quality"}, {"score": 0.002783527398566117, "phrase": "new_object"}, {"score": 0.002700485592691974, "phrase": "fff_printers"}, {"score": 0.002482552408222559, "phrase": "hierarchical_tree_structures"}, {"score": 0.0023523750536537102, "phrase": "entire_print_process"}, {"score": 0.002297585503415527, "phrase": "printable_scaffolding"}, {"score": 0.002259231376607264, "phrase": "vertical_pillars"}, {"score": 0.0021844290159501313, "phrase": "automated_support_generation_technique"}, {"score": 0.0021407391538313786, "phrase": "fine_surface_quality"}, {"score": 0.0021049977753042253, "phrase": "printing_process"}], "paper_keywords": ["FDM", " FFF", " 3D Printing", " Scaffoldings", " Supports"], "paper_abstract": "Fused Filament Fabrication (FFF) is the process of 3D printing objects from melted plastic filament. The hot plastic exits a nozzle and fuses with the part just below, adding a layer of material to the object being formed. However, filament can only be deposited on top of an existing surface. Therefore, overhangs require a disposable support structure to be printed, temporarily supporting the threads of plastic that would otherwise hang in empty space. Existing techniques for support generation fall into two categories: The first allow for very reliable prints by enclosing the bottom of the object in a dense structure, at the expense of increased material usage and build times. The second generate thin hierarchical structures connecting to the surface in a sparse number of points. This uses less material, at the expense of reliability: the part might become unstable, the structure itself may become difficult to print, the bottom surface quality degrades. The user therefore has to correct the structure and its parameters for each new object. We propose to exploit the ability of FFF printers to print bridges across gaps. Since bridges are always supported by pillars at their extremities, they are both stronger and more stable than hierarchical tree structures. Our technique first selects the points to support based on overhang and part stability during the entire print process. It then optimizes for a printable scaffolding composed of bridges and vertical pillars, supporting all points. The result is an automated support generation technique using little material while ensuring fine surface quality and stability during the printing process.", "paper_title": "Bridging the Gap: Automated Steady Scaffoldings for 3D Printing", "paper_id": "WOS:000340000100065"}