{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "case_study"}, {"score": 0.004486432283770142, "phrase": "modern_computer_systems"}, {"score": 0.004318881178805575, "phrase": "parallel_programs"}, {"score": 0.004135010810625326, "phrase": "still-prevailing_sequential_applications"}, {"score": 0.0036288825833675127, "phrase": "contemporary_software"}, {"score": 0.003589602322126282, "phrase": "hardware_tools"}, {"score": 0.00349324530379071, "phrase": "sequential_applications"}, {"score": 0.0033262524445013303, "phrase": "typical_code_patterns"}, {"score": 0.003219368413618912, "phrase": "second_part"}, {"score": 0.003115936477683574, "phrase": "spec"}, {"score": 0.0029830992938695007, "phrase": "representative_collection"}, {"score": 0.00295078850927459, "phrase": "typical_sequential_applications"}, {"score": 0.0027641218567092665, "phrase": "automatic_parallelization"}, {"score": 0.0024519545383399773, "phrase": "manual_parallelization"}, {"score": 0.0023730978395564116, "phrase": "previously_identified_patterns"}, {"score": 0.0023219374444738723, "phrase": "source-to-source_code_modifications"}, {"score": 0.0021049977753042253, "phrase": "presented_results"}], "paper_keywords": [""], "paper_abstract": "Being multiprocessors (both on-chip and/or off-chip), modern computer systems can automatically exploit the benefits of parallel programs, but their resources remain underutilized in executing still-Prevailing sequential applications. An obvious solution is in the parallelization of such applications. The first part overviews he broad issues in parallelization. Various parallelization approaches and contemporary software and hardware tools for extracting parallelism from sequential applications are studied. It also attempts to identify typical code patterns amenable for parallelization. The second part represents a case study where the SPEC CPU2006 suite-is considered as a representative collection of typical sequential applications. Following that, it discusses the possibilities and potentials of automatic parallelization and vectorization of the sequential C++ applications from the CPU2006 suite. Since these potentials are generally limited, it explores the issues in manual parallelization of these applications. After previously identified patterns are applied by source-to-source code modifications, the effects of paralllelization are evaluated by profiling and executing on two representative parallel machines. Finally, the presented results are carefully discussed.", "paper_title": "Manual Parallelization Versus State-of-the-Art Parallelization Techniques: The SPEC CPU2006 as a Case Study", "paper_id": "WOS:000331017000005"}