{"auto_keywords": [{"score": 0.04145933533719876, "phrase": "edcs"}, {"score": 0.019293590207748023, "phrase": "rs"}, {"score": 0.005872706894364195, "phrase": "defined_interfaces"}, {"score": 0.00481495049065317, "phrase": "electronic_data_capture"}, {"score": 0.00478867907727921, "phrase": "randomization_systems_principles"}, {"score": 0.0046978475261364215, "phrase": "openclinica"}, {"score": 0.004484332781147261, "phrase": "clinical_benefit"}, {"score": 0.00441130431691048, "phrase": "electronic_data_capture_systems"}, {"score": 0.004292212137716459, "phrase": "better_data_management"}, {"score": 0.004268780663872836, "phrase": "higher_data_quality"}, {"score": 0.004245476558619167, "phrase": "clinical_practice"}, {"score": 0.004210757716316828, "phrase": "electronic_systems"}, {"score": 0.004052540908034752, "phrase": "objectives"}, {"score": 0.0040083028097631975, "phrase": "mentioned_randomization_system"}, {"score": 0.00390004786026993, "phrase": "identical_data"}, {"score": 0.0038155447176837, "phrase": "stratified_randomization"}, {"score": 0.0037739796405555975, "phrase": "data_storage"}, {"score": 0.0037328656607036447, "phrase": "data_inconsistency"}, {"score": 0.003702323283528696, "phrase": "general_data_samples"}, {"score": 0.0035630520143290984, "phrase": "edcs."}, {"score": 0.0031411751440831165, "phrase": "existing_standards"}, {"score": 0.003098431361922705, "phrase": "example_realization"}, {"score": 0.0030395624703152212, "phrase": "open-source_applications"}, {"score": 0.0030229485340586473, "phrase": "state-of-the-art_software_development_procedures"}, {"score": 0.002522662955545598, "phrase": "open_source_tools"}, {"score": 0.002447711877257318, "phrase": "flexible_independent_development"}, {"score": 0.0022298039221908712, "phrase": "electronic_data"}, {"score": 0.002122391060295923, "phrase": "training_costs"}, {"score": 0.0021049977753042253, "phrase": "error-prone_duplicated_data_entry"}], "paper_keywords": ["Random allocation", " software design", " electronic data capture", " randomized controlled trial", " open source"], "paper_abstract": "Background: Clinical trials (CT) are in a, wider sense experiments to prove and establish clinical benefit of treatments. Nowadays; electronic data capture systems (EDCS) are used more often bringing a better data management and higher data quality into clinical practice. Also electronic systems for the randomization are used to assign the patients to the treatments. Objectives: If the mentioned randomization system (RS) and EDCS are used, possibly identical data are collected in both, especially by stratified randomization. This separated data storage may lead to data inconsistency and in general data samples have to be aligned. The article discusses solutions to combine RS and EDCS. In detail one approach is realized and introduced. Methods: Different possible settings of combination of EDCS and RS are determined and the pros and cons for each solution are worked out. For the combination of two in-dependent applications the necessary interfaces for the communication are defined. Thereby, existing standards are considered. An example realization is implemented with the help of open-source applications and state-of-the-art software development procedures. Results:Three possibilities of separate usage or combination of EDCS and RS are presented and assessed: i) the complete independent usage of both systems; ii) realization of one system with both functions; and iii) two separate systems, which communicate via defined interfaces. In addition a realization of our preferred approach, the combination of both systems, is introduced using the open source tools RANDI2 and OpenClinica. Conclusion: The advantage of a flexible independent development of EDCS and RS is shown based on the fact that these tool are very different featured. In our opinion the combination of both systems via defined interfaces fulfills the requirements of randomization and electronic data capture and is feasible in practice. In addition, the use of such a setting can reduce the training costs and the error-prone duplicated data entry.", "paper_title": "Possible Combinations of Electronic Data Capture and Randomization Systems Principles and the Realization with RANDI2 and OpenClinica", "paper_id": "WOS:000336353400008"}