{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "cryptographic_theory_meets_practice"}, {"score": 0.004688321299229397, "phrase": "public_transport"}, {"score": 0.0046194096969523315, "phrase": "new_lightweight_cryptographic_payment_scheme"}, {"score": 0.004327981760540394, "phrase": "low-cost_user_devices"}, {"score": 0.004164455874158225, "phrase": "one-show_credentials"}, {"score": 0.0040309035566691645, "phrase": "arbitrary_ride"}, {"score": 0.003959863717046575, "phrase": "trip_fare"}, {"score": 0.003666159244841419, "phrase": "refund_values"}, {"score": 0.0035802326864717644, "phrase": "single_token"}, {"score": 0.0034550911223507064, "phrase": "brands's_e-cash_scheme"}, {"score": 0.0032755054812060444, "phrase": "brands-only_solution"}, {"score": 0.0032561349010603734, "phrase": "transportation_payment_systems"}, {"score": 0.003032405563826263, "phrase": "expensive_withdrawal_transactions"}, {"score": 0.0029877604856619806, "phrase": "storage_requirements"}, {"score": 0.00296128862361938, "phrase": "fairly_large_coins"}, {"score": 0.0029090444046528563, "phrase": "flexible_pricing"}, {"score": 0.0028662103095187293, "phrase": "exact_payments"}, {"score": 0.0028492532869274743, "phrase": "arbitrary_amounts"}, {"score": 0.0026220963356862153, "phrase": "contemporary_security_parameters"}, {"score": 0.0025681878215171976, "phrase": "prototyping_payment_device"}, {"score": 0.002530359917257626, "phrase": "future_transit_payment_systems"}, {"score": 0.0024130056662967293, "phrase": "payment_and_refund_transactions"}, {"score": 0.0023424328921363585, "phrase": "malicious_users"}, {"score": 0.0022404162042797262, "phrase": "overall_deposit"}, {"score": 0.002220551141101661, "phrase": "overall_fare"}, {"score": 0.0021813467128927347, "phrase": "double-spending_checks"}, {"score": 0.0021049977753042253, "phrase": "honest_users"}], "paper_keywords": ["Algorithms", " Security", " Theory", " E-cash", " lightweight payments", " privacy", " refunds", " transportation systems"], "paper_abstract": "We propose a new lightweight cryptographic payment scheme for transit systems, called P4R (Privacy-Preserving Pre-Payments with Refunds), which is suitable for low-cost user devices with limited capabilities. Using P4R, users deposit money to obtain one-show credentials, where each credential allows the user to make an arbitrary ride on the system. The trip fare is determined on-the-fly at the end of the trip. If the deposit for the credential exceeds this fare, the user obtains a refund. Refund values collected over several trips are aggregated in a single token, thereby saving memory and increasing privacy. Our solution builds on Brands's e-cash scheme to realize the prepayment system and on Boneh-Lynn-Shacham (BLS) signatures to implement the refund capabilities. Compared to a Brands-only solution for transportation payment systems, P4R allows us to minimize the number of coins a user needs to pay for his rides and thus minimizes the number of expensive withdrawal transactions, as well as storage requirements for the fairly large coins. Moreover, P4R enables flexible pricing because it allows for exact payments of arbitrary amounts (within a certain range) using a single fast paying (and refund) transaction. Fortunately, the mechanisms enabling these features require very little computational overhead. Choosing contemporary security parameters, we implemented P4R on a prototyping payment device and show its suitability for future transit payment systems. Estimation results demonstrate that the data required for 20 rides consume less than 10KB of memory, and the payment and refund transactions during a ride take less than half a second. We show that malicious users are not able to cheat the system by receiving a refund that exceeds the overall deposit minus the overall fare and can be identified during double-spending checks. At the same time, the system protects the privacy of honest users in that transactions are anonymous (except for deposits) and trips are unlinkable.", "paper_title": "Cryptographic Theory Meets Practice: Efficient and Privacy-Preserving Payments for Public Transport", "paper_id": "WOS:000353253800002"}