{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "engine_analysis"}, {"score": 0.0046739596755881185, "phrase": "online_games"}, {"score": 0.004646258518859209, "phrase": "important_economic_consequences"}, {"score": 0.004404188306112211, "phrase": "high_likelihood"}, {"score": 0.0034612507694547013, "phrase": "widespread_availability"}, {"score": 0.003369778677878286, "phrase": "otb_games"}, {"score": 0.0032612451286025555, "phrase": "recent_changes"}, {"score": 0.0031561961485589633, "phrase": "players'_privacy"}, {"score": 0.003009390313137981, "phrase": "covert_use"}, {"score": 0.002991524908432975, "phrase": "chess-playing_programs"}, {"score": 0.0028354207806133153, "phrase": "large_collection"}, {"score": 0.002600826330254548, "phrase": "serious_risk"}, {"score": 0.0025776913268808124, "phrase": "numerous_\"false_positives"}, {"score": 0.0024577274522206436, "phrase": "single_game"}, {"score": 0.0024431289979171505, "phrase": "prima_fade_evidence"}, {"score": 0.0023503248644593908, "phrase": "definitive_values"}, {"score": 0.0022543116010603293, "phrase": "particular_game"}, {"score": 0.0022077827041801193, "phrase": "different_depths"}, {"score": 0.0021751356291518716, "phrase": "identical_conditions"}, {"score": 0.002155779067056877, "phrase": "multi-threading_evaluation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Chess", " Cheating", " Online games", " Privacy", " Machine assistance", " False positives"], "paper_abstract": "The integrity of online games has important economic consequences for both the gaming industry and players of all levels, from professionals to amateurs. Where there is a high likelihood of cheating, there is a loss of trust and players will be reluctant to participate particularly if this is likely to cost them money. Chess is a game that has been established online for around 25 years and is played over the Internet commercially. In that environment, where players are not physically present \"over the board\" (OTB), chess is one of the most easily exploitable games by those who wish to cheat, because of the widespread availability of very strong chess-playing programs. Allegations of cheating even in OTB games have increased significantly in recent years, and even led to recent changes in the laws of the game that potentially impinge upon players' privacy. In this work, we examine some of the difficulties inherent in identifying the covert use of chess-playing programs purely from an analysis of the moves of a game. Our approach is to deeply examine a large collection of games where there is confidence that cheating has not taken place, and analyse those that could be easily misclassified. We conclude that there is a serious risk of finding numerous \"false positives\" and that, in general, it is unsafe to use just the moves of a single game as prima fade evidence of cheating. We also demonstrate that it is impossible to compute definitive values of the figures currently employed to measure similarity to a chess-engine for a particular game, as values inevitably vary at different depths and, even under identical conditions, when multi-threading evaluation is used. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "On the limits of engine analysis for cheating detection in chess", "paper_id": "WOS:000347763300004"}