{"auto_keywords": [{"score": 0.04340746694588784, "phrase": "continuous_attributes"}, {"score": 0.015719716506582538, "phrase": "naive_bayesian_classifiers"}, {"score": 0.005486062772264132, "phrase": "nonparametric_measure"}, {"score": 0.0049315562319251684, "phrase": "hybrid_method"}, {"score": 0.004613940521007727, "phrase": "discrete_attributes"}, {"score": 0.004421284843189731, "phrase": "continuous_ones"}, {"score": 0.004259293347851015, "phrase": "previous_studies"}, {"score": 0.003973971215091993, "phrase": "different_approaches"}, {"score": 0.003931798194574009, "phrase": "different_information"}, {"score": 0.0034777028461723198, "phrase": "different_methods"}, {"score": 0.0031760175583084274, "phrase": "nave_bayesian_classifiers"}, {"score": 0.0029630461161780203, "phrase": "dependence_level"}, {"score": 0.0029159568444629053, "phrase": "continuous_attribute"}, {"score": 0.0025653164578747587, "phrase": "bayesian"}, {"score": 0.0021735890994119757, "phrase": "higher_prediction_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hybrid discretization", " Naive Bayesian classifier", " Nonparametric measure"], "paper_abstract": "Since naive Bayesian classifiers are suitable for processing discrete attributes, many methods have been proposed for discretizing continuous ones. However, none of the previous studies apply more than one discretization method to the continuous attributes in a data set for naive Bayesian classifiers. Different approaches employ different information embedded in continuous attributes to determine the boundaries for discretization. It is likely that discretizing the continuous attributes in a data set using different methods can utilize the information embedded in the attributes more thoroughly and thus improve the performance of nave Bayesian classifiers. In this study, we propose a nonparametric measure to evaluate the dependence level between a continuous attribute and the class. The nonparametric measure is then used to develop a hybrid method for discretizing continuous attributes so that the accuracy of the nave Bayesian classifier can be enhanced. This hybrid method is tested on 20 data sets, and the results demonstrate that discretizing the continuous attributes in a data set by various methods can generally have a higher prediction accuracy. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A hybrid discretization method for naive Bayesian classifiers", "paper_id": "WOS:000301758400026"}