{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "planning_graphs"}, {"score": 0.005623907894323029, "phrase": "state_agnostic_relaxed_plan"}, {"score": 0.00470983237900705, "phrase": "rich_source"}, {"score": 0.004680220363692397, "phrase": "heuristic_information"}, {"score": 0.0044922081848067135, "phrase": "planning_graph"}, {"score": 0.004325339932975582, "phrase": "naive_technique"}, {"score": 0.004164644263639545, "phrase": "multiple-source_shortest_path_problem"}, {"score": 0.004112411350177274, "phrase": "single-source_algorithm"}, {"score": 0.0038608730929994696, "phrase": "multiple-source_problem"}, {"score": 0.003194580334752371, "phrase": "conditional_planning"}, {"score": 0.0031346115554600003, "phrase": "belief_state_space"}, {"score": 0.0030854957471873785, "phrase": "search_node"}, {"score": 0.002980124909321296, "phrase": "state_overlap"}, {"score": 0.0028511898481970595, "phrase": "single_set"}, {"score": 0.002788823648033457, "phrase": "conformant_probabilistic_planning"}, {"score": 0.002753798541636975, "phrase": "graph_samples"}, {"score": 0.0027364508381415866, "phrase": "probabilistic_action_outcomes"}, {"score": 0.002719212119462965, "phrase": "search_nodes"}, {"score": 0.002626317051411829, "phrase": "probabilistic_actions"}, {"score": 0.0025047222344966678, "phrase": "relaxed_planning_problem"}, {"score": 0.002434477906829832, "phrase": "state_agnostic_planning_graph"}, {"score": 0.0024038923350585962, "phrase": "heuristic_evaluation"}, {"score": 0.002373690110881497, "phrase": "relevant_actions"}, {"score": 0.002299830460180699, "phrase": "classical_and_non-deterministic_conformant_tracks"}, {"score": 0.002256619934086924, "phrase": "performance_boosts"}, {"score": 0.0022212306049833397, "phrase": "heuristic_belief_state_space_progression_planning"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Planning", " Heuristics"], "paper_abstract": "Planning graphs have been shown to be a rich source of heuristic information for many kinds of planners. In many cases, planners must compute a planning graph for each element of a set of states, and the naive technique enumerates the graphs individually. This is equivalent to solving a multiple-source shortest path problem by iterating a single-source algorithm over each source. We introduce a data-structure, the state agnostic planning graph, that directly solves the multiple-source problem for the relaxation introduced by planning graphs. The technique can also be characterized as exploiting the overlap present in sets of planning graphs. For the purpose of exposition, we first present the technique in deterministic (classical) planning to capture a set of planning graphs used in forward chaining search. A more prominent application of this technique is in conformant and conditional planning (i.e., search in belief state space), where each search node utilizes a set of planning graphs; an optimization to exploit state overlap between belief states collapses the set of sets of planning graphs to a single set. We describe another extension in conformant probabilistic planning that reuses planning graph samples of probabilistic action outcomes across search nodes to otherwise curb the inherent prediction cost associated with handling probabilistic actions. Finally, we show how to extract a state agnostic relaxed plan that implicitly solves the relaxed planning problem in each of the planning graphs represented by the state agnostic planning graph and reduces each heuristic evaluation to counting the relevant actions in the state agnostic relaxed plan. Our experimental evaluation (using many existing International Planning Competition problems from classical and non-deterministic conformant tracks) quantifies each of these performance boosts, and demonstrates that heuristic belief state space progression planning using our technique is competitive with the state of the art. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "State agnostic planning graphs: deterministic, non-deterministic, and probabilistic planning", "paper_id": "WOS:000287615500003"}