{"auto_keywords": [{"score": 0.03715063539969209, "phrase": "chemical_structures"}, {"score": 0.004689321062844586, "phrase": "mia-qsar._multivariate_image_analysis_applied"}, {"score": 0.00462773520532301, "phrase": "quantitative_structure-activity_relationships"}, {"score": 0.0041357305373417455, "phrase": "biological_activities"}, {"score": 0.004081385289516914, "phrase": "drug-like_compounds"}, {"score": 0.0036472537997966938, "phrase": "specific_packages"}, {"score": 0.0035993041437026225, "phrase": "chemical_drawing"}, {"score": 0.0034363735647539267, "phrase": "corresponding_bioactivities"}, {"score": 0.0031115683920520773, "phrase": "variable_moiety"}, {"score": 0.0028739078688746374, "phrase": "bioactivities_column_vector"}, {"score": 0.0024842242921857705, "phrase": "chemical_groups"}, {"score": 0.0021049977753042253, "phrase": "case_study"}], "paper_keywords": ["Anti-HIV-1 compounds", " 2-D image", " Image format", " MIA-QSAR", " PLS regression"], "paper_abstract": "Multivariate Image Analysis Applied to Quantitative Structure-Activity Relationships (MIA-QSAR) has been recently implemented as a method to model and predict biological activities of drug-like compounds. This method is based on the treatment of 2-D chemical structures, which can be built using specific packages for chemical drawing. These chemical structures correlate with the corresponding bioactivities through descriptors, which are pixels (binaries) of the 2-D images; the variable moiety of chemical structures (substituent groups) explains the variance in the bioactivities column vector of a series of compounds. Thus, the way in which chemical structures are drawn (font type and size, representation of chemical groups, format in which images are saved) should influence the results of prediction. This work reports the statistics of prediction for a case study, a series of anti-HIV compounds, and reveals that the results of prediction is independent of the way in which molecules are drawn.", "paper_title": "Influence of Changes in 2-D Chemical Structure Drawings and Image Formats on the Prediction of Biological Properties Using MIA-QSAR", "paper_id": "WOS:000265462900007"}