{"auto_keywords": [{"score": 0.04128881285829009, "phrase": "evolvability_measure"}, {"score": 0.029572664766983583, "phrase": "symbiotic_evolution"}, {"score": 0.00481495049065317, "phrase": "evolutionary_mechanisms"}, {"score": 0.004714023408114857, "phrase": "water_clusters_potential_model_design"}, {"score": 0.004566567411073082, "phrase": "theoretic_model"}, {"score": 0.0044237033788643715, "phrase": "productive_search_profiles"}, {"score": 0.0038748022659578865, "phrase": "symbiotic_search_profiles"}, {"score": 0.0036942726653704213, "phrase": "statistical_learning"}, {"score": 0.0036553070575015344, "phrase": "distinct_sample_vectors"}, {"score": 0.0029409171055888804, "phrase": "empirical_studies"}, {"score": 0.0029098743621130004, "phrase": "representative_problems"}, {"score": 0.0025214217930287003, "phrase": "autonomic_search"}, {"score": 0.0024423826953133844, "phrase": "computationally_cheap_advanced_empirical_water_models"}, {"score": 0.002378408229095287, "phrase": "enigmatic_properties"}, {"score": 0.002316105585203396, "phrase": "important_and_unsolved_problem"}, {"score": 0.0021049977753042253, "phrase": "potential_model"}], "paper_keywords": [""], "paper_abstract": "This article presents a theoretic model for facilitating the emergence of productive search profiles transpiring from the symbiosis of gene (stochastic variation) and meme (lifetime learning) working in synergy. The evolvability measure of the symbiotic search profiles for each individual is quantified by means of statistical learning on distinct sample vectors encountered along the search. The most productive search profile inferred for an individual, as defined by evolvability measure, is subsequently used to work on it, leading to the self-configuration of solvers that acclimatizes to suit the given problem of interest. Empirical studies on representative problems are presented to reflect the characteristics of symbiotic evolution. Assessment made against several recent state-of-the-art evolutionary and adaptive search algorithms highlighted the efficacy of the theoretic formalism of evolutionary mechanisms in symbiosis for autonomic search. As the design of computationally cheap advanced empirical water models for the understanding of enigmatic properties of water remains an important and unsolved problem, the article presents an illustration of symbiotic evolution for the design of (H2O)(n) or water clusters potential model.", "paper_title": "A Unified Framework for Symbiosis of Evolutionary Mechanisms with Application to Water Clusters Potential Model Design", "paper_id": "WOS:000304879400002"}