{"auto_keywords": [{"score": 0.049124089120586564, "phrase": "additive_error"}, {"score": 0.00481495049065317, "phrase": "polynomial-time_decay"}, {"score": 0.0045324756541157574, "phrase": "polynomial_and_exponential_decay_aggregates"}, {"score": 0.004160319763461951, "phrase": "time_elapses"}, {"score": 0.003975868726564327, "phrase": "cohen"}, {"score": 0.003935900540995856, "phrase": "strauss"}, {"score": 0.003540392285585644, "phrase": "data_decreases"}, {"score": 0.003366233863411861, "phrase": "recent_work"}, {"score": 0.0033156708990372047, "phrase": "efficient_algorithms"}, {"score": 0.0032494292163722065, "phrase": "time-decaying_aggregations"}, {"score": 0.0029374939071038146, "phrase": "multiplicative_approximations"}, {"score": 0.002682370021834353, "phrase": "multiplicative_approximation"}, {"score": 0.0024742098091226203, "phrase": "lower_bounds"}, {"score": 0.0023523750536537102, "phrase": "multiplicative_error"}], "paper_keywords": ["streaming", " sliding window", " stream statistic", " decay functions"], "paper_abstract": "We consider the problem of maintaining polynomial and exponential decay aggregates of a data stream, where the weight of values seen from the stream diminishes as time elapses. These types of aggregation were discussed by Cohen and Strauss (J. Algorithms 1(59), 2006), and can be used in many applications in which the relative value of streaming data decreases since the time the data was seen. Some recent work and space efficient algorithms were developed for time-decaying aggregations, and in particular polynomial and exponential decaying aggregations. All of the work done so far has maintained multiplicative approximations for the aggregates. In this paper we present the first O(log N) space algorithm for the polynomial decay under a multiplicative approximation, matching a lower bound. In addition, we explore and develop algorithms and lower bounds for approximations allowing an additive error in addition to the multiplicative error. We show that in some cases, allowing an additive error can decrease the amount of space required, while in other cases we cannot do any better than a solution without additive error.", "paper_title": "Improved algorithms for polynomial-time decay and time-decay with additive error", "paper_id": "WOS:000252946400004"}