{"auto_keywords": [{"score": 0.030532362001903058, "phrase": "tobin's_q"}, {"score": 0.012421384716028864, "phrase": "tobin's_q."}, {"score": 0.004468684611798047, "phrase": "panel_threshold_regression_model"}, {"score": 0.004059673618719782, "phrase": "single_threshold_effect"}, {"score": 0.00378767277402891, "phrase": "single_threshold_value"}, {"score": 0.003314591878914152, "phrase": "thousand_broken_vertical_bar"}, {"score": 0.002720376476146181, "phrase": "positive_effect"}, {"score": 0.0023802825369325354, "phrase": "threshold_value"}, {"score": 0.0023051837161137674, "phrase": "positive_relationship"}, {"score": 0.0021049977753042253, "phrase": "first_regime"}], "paper_keywords": ["Patent analysis", " Patent citation", " Patent count", " Tobin's q", " Panel threshold regression model"], "paper_abstract": "Since the relationship between patents and Tobin's q is confusing, this paper utilizes panel threshold regression model to re-examine the relationship between patent counts/sales and Tobin's q. This study finds out patent citations/sales has a single threshold effect on the relationship between patent counts/sales and Tobin's q in the US pharmaceutical industry. The single threshold value of patent citations/sales is 328.81, and it divides the value of patent citations/sales into two regimes: the first regime (patent citations/sale a parts per thousand broken vertical bar 328.81) and the second regime (patent citations/sale > 328.81). The results indicate that patent counts/sales positively affect Tobin's q in the two regimes. In addition, this study demonstrates that the extent of the positive effect of patent counts/sales on Tobin's q is different. This study verifies that patent citations/sales moderates the relationship between patent counts/sales and Tobin's q. Once patent citations/sales is below the threshold value, the extent of the positive relationship between patent counts/sales and Tobin's q is the most. Therefore, this study finds out that the first regime is optimal.", "paper_title": "Re-examine the relationship between patents and Tobin's q", "paper_id": "WOS:000296474400004"}