{"auto_keywords": [{"score": 0.049755831283374276, "phrase": "aggregate_programs"}, {"score": 0.012388150140522091, "phrase": "weight_constraint_programs"}, {"score": 0.007152368807539886, "phrase": "weight_constraint"}, {"score": 0.005979333538962921, "phrase": "logic_programs"}, {"score": 0.005065845714095552, "phrase": "stable_model_semantics"}, {"score": 0.004219174171937721, "phrase": "answer_set_semantics"}, {"score": 0.004176509019758331, "phrase": "conditional_satisfaction"}, {"score": 0.0034545033623115634, "phrase": "stable_model"}, {"score": 0.0031845067058084583, "phrase": "weight_constraint_program"}, {"score": 0.0031522712014385845, "phrase": "strongly_satisfiable_one"}, {"score": 0.003109795964425612, "phrase": "circular_models"}, {"score": 0.00304715054446383, "phrase": "current_implementation"}, {"score": 0.002955533639862811, "phrase": "close_relationship"}, {"score": 0.0028280256704977746, "phrase": "nested_expressions"}, {"score": 0.0026514708899935333, "phrase": "methodological_issue"}, {"score": 0.0025892330566358503, "phrase": "compact_representation"}, {"score": 0.002511349409241358, "phrase": "almost_all_standard_aggregates"}, {"score": 0.0024690950486552653, "phrase": "weight_constraints"}, {"score": 0.0023867021254922755, "phrase": "answer_sets"}, {"score": 0.0023465400668244386, "phrase": "answer_set_programming"}, {"score": 0.002162951519368368, "phrase": "weight_constraint_encoding"}, {"score": 0.002126546582044807, "phrase": "competitive_approach"}, {"score": 0.0021049977753042253, "phrase": "set_computation"}], "paper_keywords": ["stable model", " weight constraint", " aggregates", " logic programs with constraints"], "paper_abstract": "Weight constraint and aggregate programs are among the most widely used logic programs with constraints. In this paper, we relate the semantics of these two classes of programs, namely, the stable model semantics for weight constraint programs and the answer set semantics based on conditional satisfaction for aggregate programs. Both classes of programs are instances of logic programs with constraints, and in particular, the answer set semantics for aggregate programs can be applied to weight constraint programs. We show that the two semantics are closely related. First, we show that for a broad class of weight constraint programs, called strongly satisfiable programs, the two semantics coincide. When they disagree, a stable model admitted by the stable model semantics may be circularly justified. We show that the gap between the two semantics can be closed by transforming a weight constraint program to a strongly satisfiable one so that no circular models may be generated under the current implementation of the stable model semantics. We further demonstrate the close relationship between the two semantics by formulating a transformation from weight constraint programs to logic programs with nested expressions, which preserves the answer set semantics. Our study on the semantics leads to an investigation of a methodological issue, namely, the possibility of compact representation of aggregate programs by weight constraint programs. We show that almost all standard aggregates can be encoded by weight constraints compactly. This makes it possible to compute the answer sets of aggregate programs using the answer set programming solvers for weight constraint programs. This approach is compared experimentally with the ones where aggregates are handled more explicitly, which show that the weight constraint encoding of aggregates enables a competitive approach to answer set computation for aggregate programs.", "paper_title": "Relating weight constraint and aggregate programs: Semantics and representation", "paper_id": "WOS:000313293200001"}