{"auto_keywords": [{"score": 0.040623321336068115, "phrase": "proposed_ranking_functions"}, {"score": 0.015719716506582538, "phrase": "interval-valued_intuitionistic_fuzzy_sets"}, {"score": 0.012916790127856693, "phrase": "dominance_concept"}, {"score": 0.004360412703519539, "phrase": "interval_values"}, {"score": 0.0041084684278314305, "phrase": "ranking_functions"}, {"score": 0.0036958398682001015, "phrase": "ivifs"}, {"score": 0.003413705707789296, "phrase": "bivariate_framework"}, {"score": 0.0028930017387859804, "phrase": "dominance-based_ranking_functions"}, {"score": 0.002387415084371473, "phrase": "dual_couple"}, {"score": 0.002175913488493802, "phrase": "full_ranking"}], "paper_keywords": ["Decision making", " fuzzy sets", " interval-valued intuitionistic fuzzy sets (IvIFSs)", " ranking function", " uncertain systems"], "paper_abstract": "The ranking of interval-valued intuitionistic fuzzy sets (IvIFSs) is difficult since they include the interval values of membership and nonmembership. This paper proposes ranking functions for IvIFSs based on the dominance concept. The proposed ranking functions consider the degree to which an IvIFS dominates and is not dominated by other IvIFSs. Based on the bivariate framework and the dominance concept, the functions incorporate not only the boundary values of membership and nonmembership, but also the relative relations among IvIFSs in comparisons. The dominance-based ranking functions include bipolar evaluations with a parameter that allows the decision-maker to reflect his actual attitude in allocating the various kinds of dominance. The relationship for two IvIFSs that satisfy the dual couple is defined based on four proposed ranking functions. Importantly, the proposed ranking functions can achieve a full ranking for all IvIFSs. Two examples are used to demonstrate the applicability and distinctiveness of the proposed ranking functions.", "paper_title": "Dominance-Based Ranking Functions for Interval-Valued Intuitionistic Fuzzy Sets", "paper_id": "WOS:000342226900003"}