{"auto_keywords": [{"score": 0.03982946883901786, "phrase": "twitter"}, {"score": 0.004815016989864229, "phrase": "tweets"}, {"score": 0.004627244470096107, "phrase": "social_media_platforms"}, {"score": 0.004526129302830441, "phrase": "new_sources"}, {"score": 0.0043496334756644535, "phrase": "scholarly_research"}, {"score": 0.004217110862974562, "phrase": "traditional_citation_analysis"}, {"score": 0.004124920849728372, "phrase": "social_media_activities"}, {"score": 0.004016938499717623, "phrase": "broad_types"}, {"score": 0.0038602215057106917, "phrase": "systematic_evidence"}, {"score": 0.003676926952533304, "phrase": "journal_articles"}, {"score": 0.003628460216207393, "phrase": "biomedical_sciences"}, {"score": 0.003456135780492263, "phrase": "pubmed"}, {"score": 0.0028195727965553367, "phrase": "citation_impact"}, {"score": 0.0027456676902333304, "phrase": "pubmed_articles"}, {"score": 0.002436289099444074, "phrase": "impact_metrics"}, {"score": 0.002200337772403983, "phrase": "twitter_mentions"}, {"score": 0.0021049977753042253, "phrase": "novel_social-media-based_metrics"}], "paper_keywords": [""], "paper_abstract": "Data collected by social media platforms have been introduced as new sources for indicators to help measure the impact of scholarly research in ways that are complementary to traditional citation analysis. Data generated from social media activities can be used to reflect broad types of impact. This article aims to provide systematic evidence about how often Twitter is used to disseminate information about journal articles in the biomedical sciences. The analysis is based on 1.4 million documents covered by both PubMed and Web of Science and published between 2010 and 2012. The number of tweets containing links to these documents was analyzed and compared to citations to evaluate the degree to which certain journals, disciplines, and specialties were represented on Twitter and how far tweets correlate with citation impact. With less than 10% of PubMed articles mentioned on Twitter, its uptake is low in general but differs between journals and specialties. Correlations between tweets and citations are low, implying that impact metrics based on tweets are different from those based on citations. A framework using the coverage of articles and the correlation between Twitter mentions and citations is proposed to facilitate the evaluation of novel social-media-based metrics.", "paper_title": "Tweeting Biomedicine: An Analysis of Tweets and Citations in the Biomedical Literature", "paper_id": "WOS:000335583300002"}