{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "particle_swarm_optimization"}, {"score": 0.00476697427418509, "phrase": "velocity_modulation"}, {"score": 0.004625881588444304, "phrase": "large_scale_continuous_optimization_problems"}, {"score": 0.004511485198940203, "phrase": "current_benchmarks"}, {"score": 0.004377921202912336, "phrase": "real-world_problems"}, {"score": 0.003980400251874277, "phrase": "available_optimization_algorithms"}, {"score": 0.0038239757564863057, "phrase": "search_space_increases"}, {"score": 0.003459191419478298, "phrase": "unsuccessful_performance"}, {"score": 0.003424677513304057, "phrase": "large_dimension_problems"}, {"score": 0.003066945490483524, "phrase": "velocity_modulation_method"}, {"score": 0.0027464781499539296, "phrase": "restarting_mechanism"}, {"score": 0.0027054473441439422, "phrase": "early_convergence"}, {"score": 0.0026252106881752067, "phrase": "promising_areas"}, {"score": 0.0025859868507329634, "phrase": "search_space"}, {"score": 0.002447101794397243, "phrase": "special_issue"}], "paper_keywords": ["Continuous optimization", " Scalability", " Particle swarm optimization", " Large scale benchmarking"], "paper_abstract": "Large scale continuous optimization problems are more relevant in current benchmarks since they are more representative of real-world problems (bioinformatics, data mining, etc.). Unfortunately, the performance of most of the available optimization algorithms deteriorates rapidly as the dimensionality of the search space increases. In particular, particle swarm optimization is a very simple and effective method for continuous optimization. Nevertheless, this algorithm usually suffers from unsuccessful performance on large dimension problems. In this work, we incorporate two new mechanisms into the particle swarm optimization with the aim of enhancing its scalability. First, a velocity modulation method is applied in the movement of particles in order to guide them within the region of interest. Second, a restarting mechanism avoids the early convergence and redirects the particles to promising areas in the search space. Experiments are carried out within the scope of this Special Issue to test scalability. The results obtained show that our proposal is scalable in all functions of the benchmark used, as well as numerically very competitive with regards to other compared optimizers.", "paper_title": "Restart particle swarm optimization with velocity modulation: a scalability test", "paper_id": "WOS:000297127200010"}