{"auto_keywords": [{"score": 0.04964156968469263, "phrase": "molecular_characteristics"}, {"score": 0.015436823223834596, "phrase": "individual_proteins"}, {"score": 0.00481495049065317, "phrase": "protein_networks"}, {"score": 0.004577869668211548, "phrase": "biological_systems"}, {"score": 0.004214729542986473, "phrase": "network_topology"}, {"score": 0.003988719758707836, "phrase": "molecular_data"}, {"score": 0.0037060428445111664, "phrase": "biological_pathways"}, {"score": 0.0035233696341819437, "phrase": "novel_platform"}, {"score": 0.0034911335714333507, "phrase": "data_integration"}, {"score": 0.0033961782274326948, "phrase": "macro_system-level"}, {"score": 0.0032436052954996097, "phrase": "micro_level"}, {"score": 0.002945081009084692, "phrase": "subcellular_localization"}, {"score": 0.0025892330566358503, "phrase": "cellular_context"}, {"score": 0.002461472107682778, "phrase": "novel_way"}, {"score": 0.002297327670408112, "phrase": "alzheimers_disease"}, {"score": 0.0022450768409733807, "phrase": "integrated_view"}, {"score": 0.002224510044064184, "phrase": "previous_observations"}, {"score": 0.0021342613107011624, "phrase": "new_hypotheses"}, {"score": 0.0021049977753042253, "phrase": "molecular_underpinnings"}], "paper_keywords": [""], "paper_abstract": "Motivation: The study of biological systems, pathways and processes relies increasingly on analyses of networks. Most often, such analyses focus on network topology, thereby treating all proteins or genes as identical, featureless nodes. Integrating molecular data and insights about the qualities of individual proteins into the analysis may enhance our ability to decipher biological pathways and processes. Results: Here, we introduce a novel platform for data integration that generates networks on the macro system-level, analyzes the molecular characteristics of each protein on the micro level, and then combines the two levels by using the molecular characteristics to assess networks. It also annotates the function and subcellular localization of each protein and displays the process on an image of a cell, rendering each protein in its respective cellular compartment. By thus visualizing the network in a cellular context we are able to analyze pathways and processes in a novel way. As an example, we use the system to analyze proteins implicated with Alzheimers disease and show how the integrated view corroborates previous observations and how it helps in the formulation of new hypotheses regarding the molecular underpinnings of the disease.", "paper_title": "Create and assess protein networks through molecular characteristics of individual proteins", "paper_id": "WOS:000250005000049"}