{"auto_keywords": [{"score": 0.028990455721158975, "phrase": "levin"}, {"score": 0.00481495049065317, "phrase": "channel_allocation_problems"}, {"score": 0.0047787596516662, "phrase": "broadcast_networks"}, {"score": 0.004584495834677719, "phrase": "dissemination-based_information_systems"}, {"score": 0.00443141503046841, "phrase": "distributed_approximation_algorithms"}, {"score": 0.003956971099850658, "phrase": "individual_objects"}, {"score": 0.003897659323896113, "phrase": "channel_allocation_problem"}, {"score": 0.0036969566358089644, "phrase": "fixed_number"}, {"score": 0.0036005006349430586, "phrase": "arbitrary_number"}, {"score": 0.0033271981957785166, "phrase": "goldschmidt"}, {"score": 0.0031190082119319272, "phrase": "maximum_load"}, {"score": 0.0030375852871252934, "phrase": "approximation_algorithms"}, {"score": 0.002859345731792013, "phrase": "second_problem"}, {"score": 0.002855245560266992, "phrase": "hochbaum"}, {"score": 0.002486103638234488, "phrase": "total_load"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["channel allocation problem", " edge partitioning problem", " distributed approximation algorithm"], "paper_abstract": "We study two packing problems that arise in the area of dissemination-based information systems; a second theme is the study of distributed approximation algorithms. The problems considered have the property that the space occupied by a collection of objects together could be significantly less than the sum of the sizes of the individual objects. In the Channel Allocation Problem, there are requests that are subsets of topics. There are a fixed number of channels that can carry an arbitrary number of topics. All the topics of each request must be broadcast on some channel. The load on any channel is the number of topics that are broadcast on that channel; the objective is to minimize the maximum load on any channel. We present approximation algorithms for this problem, and also show that the problem is MAX-SNP hard. The second problem is the Edge Partitioning Problem addressed by Goldschmidt, Hochbaum, Levin, and Olinick (Networks, 41:13-23, 2003). Each channel here can deliver topics for at most k requests, and we aim to minimize the total load on all channels. We present an O(n(1/3))-approximation algorithm, and also show that the algorithm can be made fully distributed with the same approximation guarantee; we also generalize the (nondistributed) Edge Partitioning Problem of graphs to the case of hypergraphs. (C) 2006 Wiley Periodicals, Inc.", "paper_title": "Approximation algorithms for channel allocation problems in broadcast networks", "paper_id": "WOS:000238373400005"}