{"auto_keywords": [{"score": 0.04546648155091686, "phrase": "permanent_magnets"}, {"score": 0.02677736276865568, "phrase": "proposed_magnetic-geared_motor"}, {"score": 0.015719716506582538, "phrase": "high_transmission_torque_density"}, {"score": 0.009438071446547815, "phrase": "stator_slots"}, {"score": 0.00865311074897095, "phrase": "maximum_transmission_torque"}, {"score": 0.0047709540557306284, "phrase": "purpose_-_early_magnetic-geared_motors"}, {"score": 0.004234129588974058, "phrase": "large_magnetic_resistance"}, {"score": 0.0038981499110532307, "phrase": "magnetic-geared_motors"}, {"score": 0.0036218682585355895, "phrase": "proposed_magnetic-geared_motors"}, {"score": 0.003427540517249369, "phrase": "finite_element_analysis"}, {"score": 0.0032886455096627324, "phrase": "stator_slot"}, {"score": 0.002799810685137358, "phrase": "outward_direction"}, {"score": 0.002748775748298028, "phrase": "stator_teeth"}, {"score": 0.002673957615079041, "phrase": "inward_direction"}, {"score": 0.0024842242921857705, "phrase": "slightly_smaller_maximum_transmission_torque"}, {"score": 0.0024501740852758505, "phrase": "early_magnetic-geared_motors"}, {"score": 0.0023079225317714815, "phrase": "practical_uses"}], "paper_keywords": ["Rotating machines", " Magnetic devices"], "paper_abstract": "Purpose - Early magnetic-geared motors have a high transmission torque density. However, the torque due to the coil is low because the permanent magnets in the stator become a large magnetic resistance when the current is applied to the coil. The purpose of this paper is to propose magnetic-geared motors which have a high transmission torque density and torque due to the coil. In addition, the proposed magnetic-geared motors are compared with past magnetic-geared motors and the effectiveness is verified by using finite element analysis. Design/methodology/approach - A new magnetic-geared motor which has permanent magnets in the stator slot are proposed. The torque due to the coil increases by removing permanent magnets at the tip of the stator of past magnetic-geared motors. The permanent magnets placed in the stator slots are all magnetized to the outward direction and then the stator teeth are all magnetized to the inward direction. The maximum transmission torque and torque constant are compared. Findings - The proposed magnetic-geared motor has a slightly smaller maximum transmission torque than the early magnetic-geared motors. However, the maximum transmission torque of the proposed magnetic-geared motor is high enough for practical uses. The torque due to the coils is higher than the early magnetic-geared motors. Originality/value - The proposed magnetic-geared motor has originalities in its structure, especially in the permanent magnets in the stator slots.", "paper_title": "Magnetic-geared motors with high transmission torque density", "paper_id": "WOS:000354645900003"}