{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "massively_multiplayer_online_role-playing_games"}, {"score": 0.004360412703519539, "phrase": "software_publishers"}, {"score": 0.004299064805926241, "phrase": "considerable_efforts"}, {"score": 0.004218602458288531, "phrase": "technological_quality"}, {"score": 0.003784209997115174, "phrase": "successful_and_continued_use"}, {"score": 0.0036958398682001015, "phrase": "primary_goal"}, {"score": 0.0035085965086415474, "phrase": "player_commitment"}, {"score": 0.003015950477134494, "phrase": "online_social_identity"}, {"score": 0.0027437235598539904, "phrase": "psychological_ownership_theory"}, {"score": 0.00247249708860822, "phrase": "mmorpg_players"}, {"score": 0.002437645786158106, "phrase": "structural_equation_model"}, {"score": 0.002336004938424957, "phrase": "proposed_strategies"}, {"score": 0.0022385926290967263, "phrase": "players'_e"}, {"score": 0.002125020720324262, "phrase": "business_implications"}, {"score": 0.0021049977753042253, "phrase": "software_developers"}], "paper_keywords": ["E-loyalty", " MMORPG", " online role-playing games", " psychological ownership", " social identity", " socialization"], "paper_abstract": "The massively multiplayer online role-playing game (MMORPG) phenomenon has generated significant interest on the part of consumers and software publishers. Despite considerable efforts to improve the technological quality (e.g., graphics, networking) of the games, little effort has been directed toward understanding the motivation that leads to successful and continued use of MMORPGs. The primary goal of this study is to identify the factors that influence player commitment to MMORPGs. We hypothesize that the key to obtaining loyalty is to motivate players to embrace ownership of the game by enhancing their ability to control their game character and to develop an online social identity. To achieve loyalty, two different strategies were proposed: (1) an ownership-enhancing strategy based on psychological ownership theory and (2) a socialization-enhancing strategy based on social identity theory. This study empirically examines the effectiveness of these two strategies in producing loyalty in MMORPG players. A structural equation model, developed to test the viability of the proposed strategies, found that both strategies contribute to establishing players' e-loyalty to the MMORPGs, and this finding has business implications for software developers and publishers.", "paper_title": "Player Commitment to Massively Multiplayer Online Role-Playing Games (MMORPGs): An Integrated Model", "paper_id": "WOS:000320121000002"}