{"auto_keywords": [{"score": 0.03293601710642665, "phrase": "lie"}, {"score": 0.00456020621016909, "phrase": "lie_point_symmetries"}, {"score": 0.004342430078306461, "phrase": "cylindrical_polar_coordinates"}, {"score": 0.003980531478122155, "phrase": "direct_approach"}, {"score": 0.003167217223469026, "phrase": "computer_programs"}, {"score": 0.0027641218567092665, "phrase": "fluid_flow_behavior"}, {"score": 0.002631892325004253, "phrase": "exact_solution"}, {"score": 0.0026033756286033285, "phrase": "basic_transformations"}, {"score": 0.0024923577071656014, "phrase": "similarity_reduction"}, {"score": 0.0022718774783143203, "phrase": "navier-stokes_equations"}], "paper_keywords": ["differential equations", " flow"], "paper_abstract": "Purpose - Providing a much easier (direct) approach to calculate the Lie point symmetries of (3 + 1) unsteady Navier-Stokes equations for viscous, incompressible flow in cylindrical polar coordinates. Design/methodology/approach - Lie group theory, is applied to the equations of motion. Symmetries obtained through a direct approach are then used to reduce (3 + 1) Navier-Stokes system to a system of ordinary differential equations. Findings - We observed that the approach applied here to calculate the symmetries of the group is entirely straightforward and involves less calculation as compared to the computer programs such as LIE, Symmgrp.max (MACSYMA) or other symbolic manipulation systems. Further, results obtained here will be practical and useful in comprehending the fluid flow behavior. Research limitations/implications - We only obtained the exact solution through basic transformations (translation and scaling). The similarity reduction through other subalgebras (finite and infinite dimensions) can be used to explore more facts about the Navier-Stokes equations. Originality/value - Direct approach provided in this paper can be utilized to achieve symmetries of other physically important PDEs.", "paper_title": "Similarity reduction of a (3+1) Navier-Stokes system", "paper_id": "WOS:000240150900010"}