{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "aveiro_discretization_method"}, {"score": 0.013606756916570652, "phrase": "aveiro"}, {"score": 0.004737579882204798, "phrase": "castro_et_al"}, {"score": 0.004512814529823301, "phrase": "pure_mathematics"}, {"score": 0.00446438811432197, "phrase": "springer"}, {"score": 0.00441635700580562, "phrase": "new_york"}, {"score": 0.0037352048741373816, "phrase": "finite_data"}, {"score": 0.003107935254560724, "phrase": "noise-corrupted_data_case"}, {"score": 0.0025717770066591076, "phrase": "svr-based_aveiro_discretization_method"}, {"score": 0.0023970487263732737, "phrase": "ls-svr-aveiro"}, {"score": 0.002333044307949414, "phrase": "proposed_approach"}, {"score": 0.002258485755625332, "phrase": "linear-svr-aveiro_discretization_algorithm"}, {"score": 0.0021049977753042253, "phrase": "promising_results"}], "paper_keywords": ["Support vector regression", " Least square support vector regression", " Smooth functions", " Reproducing kernel Hilbert space", " Sobolev space"], "paper_abstract": "In Castro et al. (Mathematics without boundaries: surveys in pure mathematics. Springer, New York, 2014), authors proposed a method, called Aveiro discretization method, in their paper to determine whether a given function belongs to a certain reproducing kernel Hilbert space or not, depending on finite data of the given function. The method is effective for many cases where the data are noise free. However, it will loose efficacy if the data are noise corrupted. To deal with noise-corrupted data case, we combine two support vector regression (SVR) algorithms and Averio discretization method, respectively, to determine a given function whether belongs to a certain reproducing kernel Hilbert space. In the text, our approach is phrased as the SVR-based Aveiro discretization method which includes two algorithms, the SVR-Aveiro discretization algorithm and LS-SVR-Aveiro discretization algorithm. The proposed approach is compared with Aveiro discretization method and Linear-SVR-Aveiro discretization algorithm which is combined of linear-SVR and Aveiro discretization method; our approach shows promising results.", "paper_title": "Applications of SVR to the Aveiro discretization method", "paper_id": "WOS:000355934500013"}