{"auto_keywords": [{"score": 0.004114787982556699, "phrase": "moment_convergence_theorem"}, {"score": 0.004067249363658015, "phrase": "mct"}, {"score": 0.003973523379376352, "phrase": "free_probability_theory"}, {"score": 0.003859500298805362, "phrase": "random_matrices"}, {"score": 0.003662410853488772, "phrase": "sample_covariance_matrix"}, {"score": 0.0035989687070420977, "phrase": "arbitrary_hermitian_matrix"}, {"score": 0.003516079377293321, "phrase": "second_part"}, {"score": 0.0034551632687788857, "phrase": "theoretical_results"}, {"score": 0.003375574760845742, "phrase": "first_part"}, {"score": 0.00280126189041041, "phrase": "finite_constant"}, {"score": 0.002435453488008121, "phrase": "asymptotic_spectral_distribution"}, {"score": 0.0023654615987859402, "phrase": "cross-correlation_matrix"}, {"score": 0.0023380300046435187, "phrase": "asymptotic_spectral_efficiency"}], "paper_keywords": ["Asymptotic eigenvalue moments (AEM)", " asymptotic spectral distribution (ASD)", " asynchronous transmission", " code-division multiple access (CDMA)", " noncrossing partition", " random matrix theory"], "paper_abstract": "This paper consists of two parts. In the first part, asymptotic theorems about the product of certain structured random matrices are developed by means of the moment convergence theorem (MCT) and the free probability theory. This product of random matrices is a generalization of the product of a sample covariance matrix and an arbitrary Hermitian matrix. In the second part, the theoretical results obtained in the first part are applied to analyze a randomly spread asynchronous direct sequence-code-division multiple-access (DS-CDMA) system with both the number of users K and the number of chips per symbol N approaching infinity but the ratio K/N, kept as a finite constant. Two levels of asynchronism are considered; one is symbol-asynchronous but chip-synchronous, and the other is chip-asynchronous. Asymptotic spectral distribution (ASD) of cross-correlation matrix and asymptotic spectral efficiency are investigated. Conditions under which CDMA systems with various synchronism levels (synchronous and two levels of asynchronism) have the same performance are also established.", "paper_title": "Asymptotic Theorems for the Product of Certain Structured Random Matrices and Their Application to Analysis of Asynchronous CDMA", "paper_id": "WOS:000268107200021"}