{"auto_keywords": [{"score": 0.042649152947461744, "phrase": "more-able_students"}, {"score": 0.04201419729599904, "phrase": "less-able_students"}, {"score": 0.0388263744242103, "phrase": "perceived_performance"}, {"score": 0.00481495049065317, "phrase": "competition_games"}, {"score": 0.004453874101119545, "phrase": "individual_abilities"}, {"score": 0.0035940277928341265, "phrase": "lower_perceived_performance"}, {"score": 0.0031597433845085092, "phrase": "computerized_mechanism"}, {"score": 0.00300339527261653, "phrase": "more-able_and_less-able_students"}, {"score": 0.002865929543375884, "phrase": "competitive_learning_game"}, {"score": 0.0027240799841720957, "phrase": "similar_ability"}, {"score": 0.0025095811903520274, "phrase": "equal_opportunity_tactic"}, {"score": 0.0024514505056251316, "phrase": "individual_ability_difference"}, {"score": 0.0022495644368875686, "phrase": "similar_opportunity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Elementary education", " Evaluation of CAL systems", " Pedagogical issues"], "paper_abstract": "Competition, despite its potential drawbacks, is an easily adopted and frequently used motivator in classrooms. Individual abilities, in the years of schooling, are inevitably different, and performance in competition is heavily ability dependent, resulting that more-able students always win while less-able students always lose. Students easily perceive how well they perform through the result of competition, which is termed as perceived performance in this paper. Consistently demonstrating lower perceived performance than their peers, the less-able students feel discouraged and frustrated, hardly having the same opportunity for owning the sense of achievement as the more-able students. In this study, the authors designed a computerized mechanism, equal opportunity tactic, to lessen the difference in perceived performance between more-able and less-able students. Equal opportunity tactic is incorporated into a version of a competitive learning game called AnswerMatching, in which every student is assigned an opponent with similar ability. An experiment was also conducted to preliminarily investigate the effectiveness and effects of the tactic. Results showed that equal opportunity tactic could reduce the effect of individual ability difference on the perceived performance as well as the belief about how well students could achieve. In other words, less-able students could have similar opportunity of success and build confidence similar to more-able students in a competition. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Equal opportunity tactic: Redesigning and applying competition games in classrooms", "paper_id": "WOS:000269069200030"}