{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "remote_ultrasound_imaging"}, {"score": 0.04576021885069074, "phrase": "ultrasound_imaging"}, {"score": 0.004580550308652044, "phrase": "novel_hand-controller"}, {"score": 0.004238307626560739, "phrase": "remote_site"}, {"score": 0.003668859054928118, "phrase": "mechanical_point"}, {"score": 0.0034707339811048403, "phrase": "standard_clinical_motions"}, {"score": 0.0033384259516301223, "phrase": "four-degree-of-freedom_device"}, {"score": 0.003175676186323053, "phrase": "lightweight_moving_parts"}, {"score": 0.003088702479841264, "phrase": "fixed_center"}, {"score": 0.0028895324165046166, "phrase": "required_ultrasound_motions"}, {"score": 0.002794802975530612, "phrase": "large_and_singularity-free_spherical_workspace"}, {"score": 0.0025713100093065645, "phrase": "independent_drive_systems"}, {"score": 0.002418829014435841, "phrase": "reflecting_actuators"}], "paper_keywords": ["Mechanism design", " Hand-controller", " Ultrasound diagnosis", " Robotic devices", " Parallel mechanisms"], "paper_abstract": "This paper presents the development of a novel hand-controller, designed to help physicians to perform ultrasound imaging on patients located at a remote site. Specifically, this paper reports detailed design, kinematics analysis, prototype device, and application tests of the proposed hand-controller. The hand-controller has certain characteristics which make it novel from mechanical point of view and with respect to its suitability for providing standard clinical motions of ultrasound imaging. It is a four-degree-of-freedom device and uses parallel mechanisms in its configuration with lightweight moving parts. It has a fixed center-of-motion, which allows operators to generate the required ultrasound motions. The mechanism provides a large and singularity-free spherical workspace. All degrees of freedom are kinematically decoupled, i.e., the hand-controller has independent drive systems for each degree of freedom. Additionally, all force reflecting actuators are located on the ground and their mechanical transmissions are back-driveable. A prototype of the hand-controller has been constructed and was evaluated using two case studies, one of which applies directly to remote ultrasound imaging of kidney. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "A novel hand-controller for remote ultrasound imaging", "paper_id": "WOS:000261626200006"}