{"auto_keywords": [{"score": 0.03251942252482322, "phrase": "mixing_matrix"}, {"score": 0.013966704940392309, "phrase": "time_point"}, {"score": 0.00481495049065317, "phrase": "over-complete_blind_source_separation"}, {"score": 0.004230382915464495, "phrase": "linear_superposition"}, {"score": 0.004024863549087511, "phrase": "blind_source_separation"}, {"score": 0.0037412912454999046, "phrase": "x_m"}, {"score": 0.003477628306017313, "phrase": "complete_separation"}, {"score": 0.0029648894235196886, "phrase": "null_space_representation"}, {"score": 0.00293547027122617, "phrase": "over-complete_blind_source_separation_problem"}, {"score": 0.00286795254228461, "phrase": "solution_space"}, {"score": 0.0027834145465170292, "phrase": "null_space"}, {"score": 0.0027375275272639933, "phrase": "singular_value_decomposition"}, {"score": 0.002604343990620731, "phrase": "bayesian_latent_variable_model"}, {"score": 0.002436765760924074, "phrase": "null_space_algorithm"}, {"score": 0.002420611343093316, "phrase": "markov_chain_monte_carlo_posterior_sampling"}, {"score": 0.0023259039577313294, "phrase": "independent_source"}, {"score": 0.0022951636331743066, "phrase": "blind_source_separation_problem"}, {"score": 0.002249811525923913, "phrase": "independent_component_analysis_problem"}, {"score": 0.002183454435945014, "phrase": "over-complete_independent_component_analysis"}, {"score": 0.0021474369836979048, "phrase": "high-dimensional_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Bayesian latent variable model", " givens rotation", " independent component analysis", " langevin-euler equation", " Markov chain Monte Carlo", " singular value decomposition"], "paper_abstract": "In blind source separation, there are M sources that produce sounds independently and continuously over time. These sounds are then recorded by in receivers. The sound recorded by each receiver at each time point is a linear superposition of the sounds produced by the M sources at the same time point. The problem of blind source separation is to recover the sounds of the sources from the sounds recorded by the receivers, without knowledge of the in x M mixing matrix that transforms the sounds of the sources to the sounds of the receivers at each time point. Over-complete separation refers to the situation where the number of sources M is greater than the number of receivers in, so that the source sounds cannot be uniquely solved from the receiver sounds even if the mixing matrix is known. In this paper, we propose a null space representation for the over-complete blind source separation problem. This representation explicitly identifies the solution space of the source sounds in terms of the null space of the mixing matrix using singular value decomposition. Under this representation, the problem can be posed in the framework of Bayesian latent variable model, where the mixing matrix and the source sounds can be inferred based on their posterior distributions. We then propose a null space algorithm for Markov chain Monte Carlo posterior sampling. We illustrate the algorithm using several examples under two different statistical assumptions about the independent source sounds. The blind source separation problem is mathematically equivalent to the independent component analysis problem. So our method can be equally applied to over-complete independent component analysis for unsupervised learning of high-dimensional data. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "A null space method for over-complete blind source separation", "paper_id": "WOS:000249316000007"}