{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bandwidth_puzzle"}, {"score": 0.004515004397496303, "phrase": "peer-to-peer_networks"}, {"score": 0.004339744430169516, "phrase": "actual_work"}, {"score": 0.004089475312474684, "phrase": "free_credits"}, {"score": 0.003685604033479918, "phrase": "substantial_bandwidth"}, {"score": 0.0028911669203979156, "phrase": "average_number"}, {"score": 0.0023710856920150574, "phrase": "small_factor"}, {"score": 0.0023476849595393872, "phrase": "practical_puzzle_parameters"}, {"score": 0.0023130151703068444, "phrase": "new_bound"}, {"score": 0.0022901862321082407, "phrase": "better_security_guarantees"}, {"score": 0.0021259846592569386, "phrase": "puzzle_parameters"}, {"score": 0.0021049977753042253, "phrase": "practical_systems"}], "paper_keywords": ["Communication system security"], "paper_abstract": "A bandwidth puzzle was recently proposed to defend against colluding adversaries in peer-to-peer networks. The colluding adversaries do not do actual work but claim to have uploaded content for each other to gain free credits from the system. The bandwidth puzzle guarantees that if the adversaries can solve the puzzles, they must have spent substantial bandwidth, the size of which is comparable to the size of the content they claim to have uploaded for each other. Therefore, the puzzle discourages the collusion. In this paper, we study the performance of the bandwidth puzzle and give a lower bound on the average number of bits the adversaries must receive to be able to solve the puzzles with a certain probability. We show that our bound is tight in the sense that there exists a strategy to approach this lower bound asymptotically within a small factor with practical puzzle parameters. The new bound gives better security guarantees than the existing bound, and can be used to guide the choices of puzzle parameters for practical systems.", "paper_title": "A New Bound on the Performance of the Bandwidth Puzzle", "paper_id": "WOS:000301506500032"}