{"auto_keywords": [{"score": 0.04722010676933425, "phrase": "yahoo"}, {"score": 0.04370239099501144, "phrase": "collective_intelligence"}, {"score": 0.03617361881974394, "phrase": "knowledge_base"}, {"score": 0.003957735532719663, "phrase": "online_social_network"}, {"score": 0.0037792227071149985, "phrase": "large_amount"}, {"score": 0.0036788184374592706, "phrase": "osn's_structural_properties"}, {"score": 0.003622642432563435, "phrase": "strikingly_distinct_properties"}, {"score": 0.0035810720634458933, "phrase": "low_link_symmetry"}, {"score": 0.0035536228914319354, "phrase": "weak_correlation"}, {"score": 0.003290403747743492, "phrase": "small_number"}, {"score": 0.003265175268104804, "phrase": "top_contributors"}, {"score": 0.0031058249097051555, "phrase": "top_contributor"}, {"score": 0.002977061391551628, "phrase": "knowledge_categories"}, {"score": 0.0028100102841877835, "phrase": "user's_social_network"}, {"score": 0.0027143009946473937, "phrase": "user's_social_network_share"}, {"score": 0.002522791642460087, "phrase": "spammer_detection_algorithms"}], "paper_keywords": ["Yahoo! Answers", " question and answer platforms", " online social networks", " collective intelligence", " user behavior"], "paper_abstract": "Question and Answer (Q&A) websites such as Yahoo! Answers provide a platform where users can post questions and receive answers. These systems take advantage of the collective intelligence of users to find information. In this paper, we analyze the online social network (OSN) in Yahoo! Answers. Based on a large amount of our collected data, we studied the OSN's structural properties, which reveals strikingly distinct properties such as low link symmetry and weak correlation between indegree and outdegree. After studying the knowledge base and behaviors of the users, we find that a small number of top contributors answer most of the questions in the system. Also, each top contributor focuses only on a few knowledge categories. In addition, the knowledge categories of the users are highly clustered. We also study the knowledge base in a user's social network, which reveals that the members in a user's social network share only a few knowledge categories. Based on the findings, we provide guidance in the design of spammer detection algorithms and distributed Q&A systems. We also propose a friendship-knowledge oriented Q&A framework that synergistically combines current OSN-based Q&A and web Q&A. We believe that the results presented in this paper are crucial in understanding the collective intelligence in the web Q&A OSNs and lay a cornerstone for the evolution of next-generation Q&A systems.", "paper_title": "Knowledge Sharing in the Online Social Network of Yahoo! Answers and Its Implications", "paper_id": "WOS:000354414500017"}