{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "powell's_method"}, {"score": 0.0047517225918491226, "phrase": "artificial_bee_colony"}, {"score": 0.00462773520532301, "phrase": "relatively_new_optimization_technique"}, {"score": 0.004081567866081797, "phrase": "abc"}, {"score": 0.0035052810710060893, "phrase": "modified_search_equation"}, {"score": 0.0033465923623290034, "phrase": "candidate_solution"}, {"score": 0.0031739835218110015, "phrase": "search_ability"}, {"score": 0.002951045605925464, "phrase": "local_search_tool"}, {"score": 0.002761954897932813, "phrase": "new_algorithm"}, {"score": 0.0023249757987087055, "phrase": "highest_solution_quality"}, {"score": 0.002294369814584028, "phrase": "fastest_global_convergence"}, {"score": 0.002175913488493802, "phrase": "almost_all_test_functions"}], "paper_keywords": ["Evolutionary algorithms", " Artificial bee colony algorithm", " Search equation", " Powell's method"], "paper_abstract": "Artificial bee colony (ABC) algorithm is a relatively new optimization technique which has been shown to be competitive to other population-based algorithms. However, there is still an insufficiency in ABC regarding its solution search equation, which is good at exploration but poor at exploitation. To address this concerning issue, we first propose a modified search equation which is applied to generate a candidate solution in the onlookers phase to improve the search ability of ABC. Further, we use the Powell's method as a local search tool to enhance the exploitation of the algorithm. The new algorithm is tested on 22 unconstrained benchmark functions and 13 constrained benchmark functions, and are compared with some other ABCs and several state-of-the-art algorithms. The comparisons show that the proposed algorithm offers the highest solution quality, fastest global convergence, and strongest robustness among all the contenders on almost all test functions. (C) 2013 Elsevier B. V. All rights reserved.", "paper_title": "A novel artificial bee colony algorithm with Powell's method", "paper_id": "WOS:000324030600001"}