{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "neural_networks"}, {"score": 0.04693443770971551, "phrase": "asymptotic_behaviour"}, {"score": 0.04194133676529324, "phrase": "fixed_boundary_conditions"}, {"score": 0.004583205112737672, "phrase": "new_simulation_results"}, {"score": 0.004444037594955185, "phrase": "theoretical_neural_networks"}, {"score": 0.004230068512904886, "phrase": "extended_hopfield_law"}, {"score": 0.0037621210719690594, "phrase": "theoretical_results"}, {"score": 0.0036703791815812328, "phrase": "attractive_networks"}, {"score": 0.0034083145672246067, "phrase": "two-dimensional_neural_networks"}, {"score": 0.003204232566468624, "phrase": "nearest_neighbours_ising_model"}, {"score": 0.0031260524791486347, "phrase": "translation-invariant_local_isotropic_interactions"}, {"score": 0.00230950802983053, "phrase": "significant_impacts"}, {"score": 0.0021180510180905296, "phrase": "phase_transitions"}], "paper_keywords": ["Stochastic neural networks", " Hopfield model extension", " Phase transitions", " Simulations"], "paper_abstract": "This paper gives new simulation results on the asymptotic behaviour of theoretical neural networks on Z and Z(2) following an extended Hopfield law. It specifically focuses on the influence of fixed boundary conditions on such networks. First, we will generalise the theoretical results already obtained for attractive networks in one dimension to more complicated neural networks. Then, we will focus on two-dimensional neural networks. Theoretical results have already been found for the nearest neighbours Ising model in 2D with translation-invariant local isotropic interactions. We will detail what happens for this kind of interaction in neural networks and we will also focus on more complicated interactions, i.e., interactions that are not local, neither isotropic, nor translation-invariant. For all these kinds of interactions, we will show that fixed boundary conditions have significant impacts on the asymptotic behaviour of such networks. These impacts result in the emergence of phase transitions whose geometric shape will be numerically characterised. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Boundary conditions and phase transitions in neural networks. Simulation results", "paper_id": "WOS:000260550300009"}