{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "d-region_fault_tolerance"}, {"score": 0.015468621765144932, "phrase": "wireless_network"}, {"score": 0.004641770842098217, "phrase": "natural_disasters"}, {"score": 0.004604136423327813, "phrase": "human_intervention"}, {"score": 0.004548253531664032, "phrase": "network_partitioning"}, {"score": 0.004141663280057689, "phrase": "fault_tolerance"}, {"score": 0.003817655499320344, "phrase": "wireless_network_node_failures"}, {"score": 0.003680212979775528, "phrase": "military_applications"}, {"score": 0.003378385493203297, "phrase": "spatial_relativity"}, {"score": 0.0032833625797814474, "phrase": "fault_tolerance_requirements"}, {"score": 0.0032434583977423996, "phrase": "wireless_network_design"}, {"score": 0.0031522185379771056, "phrase": "new_metric"}, {"score": 0.0029652292779277782, "phrase": "wireless_network_fault_tolerance"}, {"score": 0.0029291801502381513, "phrase": "d-region_fault_tolerant_network"}, {"score": 0.0028121429464519733, "phrase": "circular_region"}, {"score": 0.0027893011631269873, "phrase": "diameter_d"}, {"score": 0.0021571717917276724, "phrase": "grft_and_lrft_algorithms"}, {"score": 0.0021309254505358253, "phrase": "lower_transmission_radius"}, {"score": 0.0021049977753042253, "phrase": "logical_degree"}], "paper_keywords": ["fault tolerance", " connectivity", " spatial relativity", " topology control"], "paper_abstract": "In a wireless network, node failure due to either natural disasters or human intervention can cause network partitioning and other communication problems. For this reason, a wireless network should be fault tolerant. At present, most researchers use k-connectivity to measure fault tolerance, which requires the network to be connected after the failure of any up to k-1 nodes. However, wireless network node failures are usually spatially related, and particularly in military applications, nodes from the same limited area can fail together. As a metric of fault-tolerance, k-connectivity fails to capture the spatial relativity of faults and hardly satisfies the fault tolerance requirements of a wireless network design. In this paper, a new metric of fault-tolerance, termed D-region fault tolerance, is introduced to measure wireless network fault tolerance. A D-region fault tolerant network means that even after all the nodes have failed in a circular region with diameter D, it still remains connected. Based on D-region fault tolerance, we propose two fault-tolerant topology control algorithms-the global region fault tolerance algorithm (GRFT) and the localized region fault tolerance algorithm (LRFT). It is theoretically proven that both algorithms are able to generate a network with D-region fault tolerance. Simulation results indicate that with the same fault tolerance capabilities, networks based on both GRFT and LRFT algorithms have a lower transmission radius and lower logical degree.", "paper_title": "A topology control algorithm based on D-region fault tolerance", "paper_id": "WOS:000323202000002"}