{"auto_keywords": [{"score": 0.045161348664357094, "phrase": "previous_papers"}, {"score": 0.00481495049065317, "phrase": "fuzzy_divergence_measures"}, {"score": 0.004440277230269978, "phrase": "real_number"}, {"score": 0.003900257249255497, "phrase": "precise_number"}, {"score": 0.0037352048741373816, "phrase": "essential_information"}, {"score": 0.0033163269450817716, "phrase": "low_or_high_membership_degrees"}, {"score": 0.0030250067691601967, "phrase": "fuzzy_valued_function"}, {"score": 0.0028043588777213533, "phrase": "natural_axioms"}, {"score": 0.0026710653215026685, "phrase": "additional_properties"}, {"score": 0.0024628046987344846, "phrase": "crisp_divergence_measuers"}, {"score": 0.002246292543825748, "phrase": "crisp_and_fuzzy_divergence_measures"}, {"score": 0.0021049977753042253, "phrase": "fuzzy_divergence_measure"}], "paper_keywords": ["fuzzy set", " fuzzy-valued mapping", " crisp divergence measure", " fuzzy divergence measure"], "paper_abstract": "The representation of the degree of difference between two fuzzy subsets by means of a real number has been proposed in previous papers, and it seems to be useful in some situations. However, the requirement of assigning a precise number may leads us to the loss of essential information about this difference. Thus, (crisp) divergence measures studied in previous papers may not distinguish whether the differences between two fuzzy subsets are in low or high membership degrees. In this paper we propose a way of measuring these differences by means of a fuzzy valued function which we will call fuzzy divergence measure. We formulate a list of natural axioms that these measures should satisfy. We derive additional properties from these axioms, some of them are related to the properties required to crisp divergence measuers. We finish the paper by establishing a one-to-one correspondence between families of crisp and fuzzy divergence measures. This result provides us with a method to build a fuzzy divergence measure froma a crisp valued one.", "paper_title": "An axiomatic definition of fuzzy divergence measures", "paper_id": "WOS:000253123700001"}