{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data-path_functionality"}, {"score": 0.015448758509906459, "phrase": "future_internet"}, {"score": 0.004675930527604869, "phrase": "modern_networks"}, {"score": 0.004358368398332723, "phrase": "processing_operations"}, {"score": 0.0037862398004482253, "phrase": "correct_operations"}, {"score": 0.003591542373891629, "phrase": "different_entities"}, {"score": 0.0033868916699805224, "phrase": "explicit_support"}, {"score": 0.0032697235411641695, "phrase": "packet_processing_services"}, {"score": 0.002890557197908352, "phrase": "novel_system"}, {"score": 0.002570296816631395, "phrase": "theoretical_foundations"}, {"score": 0.002452333524620638, "phrase": "prototype_implementation"}, {"score": 0.002272053079580848, "phrase": "effective_solution"}, {"score": 0.002117401083432857, "phrase": "index_terms"}], "paper_keywords": [""], "paper_abstract": "Modern networks not only forward traffic, but also perform a variety of processing operations on packets (e. g., content inspection, transcoding, QoS scheduling). Such data-path functionality needs to be composed suitably to ensure correct operations and adherence to policies put in place by different entities in the Internet. Currently, there exists no explicit support for describing the semantics of packet processing services, for composing these services, and for ensuring that policies are considered. In our work, we propose a novel system for representing data-path functionality and policies in such a way that per-connection configurations can be composed automatically. We present the theoretical foundations of this approach as well as a prototype implementation based on our network service architecture. Our results show that this approach is an effective solution toward scalable and autonomic handling of data-path functionality in the future Internet. Index Terms next-generation Internet, network service, packet processing semantics, automated planning, data-path policies.", "paper_title": "Automated Composition of Data-Path Functionality in the Future Internet", "paper_id": "WOS:000297585900003"}