{"auto_keywords": [{"score": 0.04862717445897776, "phrase": "instance_selection"}, {"score": 0.040523767794461374, "phrase": "data-complexity_measures"}, {"score": 0.00481495049065317, "phrase": "complexity_measures"}, {"score": 0.004717131485168168, "phrase": "meta-learning"}, {"score": 0.004435363840720883, "phrase": "instance_selection_problem"}, {"score": 0.004367581653370531, "phrase": "meta-learning_perspective"}, {"score": 0.0037057255600764475, "phrase": "best_performing_method"}, {"score": 0.0036490529923833884, "phrase": "data_set"}, {"score": 0.002708399936381754, "phrase": "previous_work"}, {"score": 0.002443671484766342, "phrase": "experimental_study"}], "paper_keywords": ["Complexity measures", " instance selection", " meta-learning", " data mining", " machine learning"], "paper_abstract": "In recent years, some authors have approached the instance selection problem from a meta-learning perspective. In their work, they try to find relationships between the performance of some methods from this field and the values of some data-complexity measures, with the aim of determining the best performing method given a data set, using only the values of the measures computed on this data. Nevertheless, most of the data-complexity measures existing in the literature were not conceived for this purpose and the feasibility of their use in this field is yet to be determined. In this paper, we revise the definition of some measures that we presented in a previous work, that were designed for meta-learning based instance selection. Also, we assess them in an experimental study involving three sets of measures, 59 databases, 16 instance selection methods, two classifiers, and eight regression learners used as meta-learners. The results suggest that our measures are more efficient and effective than those traditionally used by researchers that have addressed the instance selection from a perspective based on meta-learning.", "paper_title": "A Set of Complexity Measures Designed for Applying Meta-Learning to Instance Selection", "paper_id": "WOS:000346982900004"}