{"auto_keywords": [{"score": 0.03585984673974763, "phrase": "su"}, {"score": 0.00481495049065317, "phrase": "downlink_cognitive_radio_networks_with_opportunistic_sub-channel"}, {"score": 0.0038647641000798135, "phrase": "high_priority"}, {"score": 0.0036499505265403377, "phrase": "minimum_rate_constraint"}, {"score": 0.003447035529485425, "phrase": "low_priority"}, {"score": 0.003212663446866794, "phrase": "power_allocation"}, {"score": 0.003007389443770562, "phrase": "total_available_transmit_power"}, {"score": 0.002753891109273246, "phrase": "optimal_values"}, {"score": 0.002381365139274329, "phrase": "sum_rate"}, {"score": 0.0022687189700002254, "phrase": "pu_minimum_rate_constraint"}, {"score": 0.0021901485584955487, "phrase": "extensive_simulation_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_schemes"}], "paper_keywords": ["Cognitive radio", " power allocation", " opportunistic subchannel access", " minimum rate constraint"], "paper_abstract": "This paper considers a downlink cognitive radio (CR) network where one secondary user (SU) and one primary user (PU) share the same base station (BS). The spectrum of interest is divided into a set of independent, orthogonal subchannels. The communication of the PU is of high priority and the quality of service (QoS) is guaranteed by the minimum rate constraint. On the other hand, the communication of the SU is of low priority and the SU opportunistically accesses the subchannels that were previously discarded by the PU during power allocation. The BS assigns fractions (alpha) and (1-alpha) of the total available transmit power to the PU and the SU respectively. Two power allocation schemes with opportunistic subchannel access are proposed, in which the optimal values of (alpha)'s are also obtained. The objective of one scheme is to maximize the rate of the SU, and the objective of the other scheme is to maximize the sum rate of the SU and the PU, both under the PU minimum rate constraint and the total transmit power constraint. Extensive simulation results are obtained to verify the effectiveness of the proposed schemes.", "paper_title": "Power Allocation Schemes For Downlink Cognitive Radio Networks With Opportunistic Sub-channel Access", "paper_id": "WOS:000310979500003"}