{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "time_domain_parameters"}, {"score": 0.010294375648462526, "phrase": "eeg-based_brain-computer_interfaces"}, {"score": 0.0038389110156920926, "phrase": "time_domain_parameter"}, {"score": 0.0036329805216306576, "phrase": "hjorth_parameters"}, {"score": 0.003438058620195309, "phrase": "first_setting"}, {"score": 0.002913650880082273, "phrase": "spatial_filters"}, {"score": 0.0028430608076324727, "phrase": "second_setting"}, {"score": 0.00257735013358606, "phrase": "frequency_content"}, {"score": 0.0023798115577749225, "phrase": "logarithmic_band_power"}, {"score": 0.0023507916951658455, "phrase": "subject-specific_bands"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd"}], "paper_keywords": ["Brain-Computer Interface", " Hjorth parameters", " Band power estimates", " Time Domain Parameters", " Derivative operator"], "paper_abstract": "Several feature types have been used with EEG-based Brain-Computer Interfaces Among the most popular are logarithmic band power estimates with more or less subject-specific optimization of file frequency bands. In this paper we introduce a feature called Time Domain Parameter that is defined by the generalization of the Hjorth parameters. Time Domain Parameters are Studied Under two different conditions. The first setting is defined when no data from a Subject is available. In this condition our results show that Time Domain Parameters outperform all band power features tested with all spatial filters applied. The second setting is the transition from calibration (no feedback) to feedback, in which the frequency content of the signals can change for some subjects We compare Time Domain Parameters with logarithmic band power in subject-specific bands and show that these features are advantageous in this situation as well. (C) 2009 Elsevier Ltd All rights reserved.", "paper_title": "Time Domain Parameters as a feature for EEG-based Brain-Computer Interfaces", "paper_id": "WOS:000272073800013"}