{"auto_keywords": [{"score": 0.044001542978848354, "phrase": "telemedicine_literature"}, {"score": 0.00481495049065317, "phrase": "medical_services"}, {"score": 0.004715908063787721, "phrase": "communication_technologies_advance"}, {"score": 0.004141238989360548, "phrase": "important_task"}, {"score": 0.004055998173160551, "phrase": "future_directions"}, {"score": 0.004014035333627087, "phrase": "telemedicine_research"}, {"score": 0.003598705020845104, "phrase": "total_growth"}, {"score": 0.0034162643819889054, "phrase": "publication_activity"}, {"score": 0.0031270239691197515, "phrase": "cumulative_number"}, {"score": 0.0030946423142739813, "phrase": "telemedicine_publications"}, {"score": 0.0030626127258991625, "phrase": "norway"}, {"score": 0.0025657442830956017, "phrase": "neuroscience_neurology"}, {"score": 0.0024103044278902916, "phrase": "considerable_growth"}, {"score": 0.0022291501521610737, "phrase": "research_activity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Telemedicine", " Telecare", " Telehealth", " E-health", " Bibliometrics"], "paper_abstract": "Over the past two decades, the use of telemedicine as a way to provide medical services has grown as communication technologies advance and patients seek more convenient ways to receive care. Because developments within this field are still rapidly evolving, identifying trends within telemedicine literature is an important task to help delineate future directions of telemedicine research. In this study, we analyzed 7960 telemedicine-related publication records found in the Science Citations Index-Expanded database between 1993 and 2012. Bibliometric analyses revealed that while the total growth in telemedicine literature has been significant in the last twenty years, the publication activity per country and over time has been variable. While the United States led the world in the cumulative number of telemedicine publications, Norway ranked highest when we ordered countries by publications per capita. We also saw that the growth in the number of publications per year has been inconsistent over the past two decades. Our results identified that neuroscience neurology and nursing as two fields of research in telemedicine that have seen considerable growth in interest in this field, and are poised to be the focus of research activity in the near future. (C) 2015 Published by Elsevier Ireland Ltd.", "paper_title": "Trends in the growth of literature of telemedicine: A bibliometric analysis", "paper_id": "WOS:000364991800016"}