{"auto_keywords": [{"score": 0.04705125463422358, "phrase": "academic_self-efficacy"}, {"score": 0.028198276166246455, "phrase": "internet_information"}, {"score": 0.027752752770706213, "phrase": "academic_performance"}, {"score": 0.0042489946866108895, "phrase": "good_source"}, {"score": 0.0037697665240643066, "phrase": "school_related_information"}, {"score": 0.0037087324991876727, "phrase": "academic_performances"}, {"score": 0.0035507457285983268, "phrase": "vocational_high_school_students'_information"}, {"score": 0.003032228032253871, "phrase": "survey_data"}, {"score": 0.002966906780368467, "phrase": "taiwan"}, {"score": 0.0028715299874549245, "phrase": "positive_effect"}, {"score": 0.0027943943921568456, "phrase": "students'_academic_performance"}, {"score": 0.0024386325347607674, "phrase": "low_academic_self-efficacy_benefit"}, {"score": 0.0021987994275190314, "phrase": "future_directions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Academic self-efficacy", " Information seeking", " Internet", " Academic performance"], "paper_abstract": "Although researchers tend to agree that Internet is a good source for learning and research, little empirical data has substantiated this claim by specifically linking time and effort spent on the Internet for school related information seeking to academic performances. This research investigates the relationship between vocational high school students' information seeking activities on the Internet, academic self-efficacy, and academic performance. We propose that academic self-efficacy both mediates and moderates the relationship between Internet information seeking and academic performance. Using survey data from 295 vocational high school students in Taiwan, we found that the positive effect of Internet information seeking to students' academic performance is mediated through academic self-efficacy. Academic self-efficacy, at the same time, moderates the relationship between Internet information seeking to academic performance such that students' with low academic self-efficacy benefit more from Internet information seeking in regard to their academic performance. We discussed the implications of our findings and provided future directions for research. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "How does Internet information seeking help academic performance? - The moderating and mediating roles of academic self-efficacy", "paper_id": "WOS:000295860100026"}