{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "polyhedral_objects"}, {"score": 0.004764220976404241, "phrase": "single_parallel_projections"}, {"score": 0.004714023408114857, "phrase": "cubic_corner"}, {"score": 0.004566567411073082, "phrase": "direct_method"}, {"score": 0.0043080553835735825, "phrase": "single_parallel_projection"}, {"score": 0.0033402088717816446, "phrase": "whole_polyhedron"}, {"score": 0.0032355864829403413, "phrase": "topological_structure"}, {"score": 0.0027015344365793016, "phrase": "cubic_corners"}, {"score": 0.0025348408238837655, "phrase": "accurate_line_drawings"}, {"score": 0.0024553821147953463, "phrase": "simple_extension"}, {"score": 0.0023532890136269986, "phrase": "inaccurate_drawings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["3D reconstruction", " Computer-aided conceptual design", " Cubic corner", " Line drawing", " Parallel projection"], "paper_abstract": "This paper presents a direct method to recover the geometry of the 30 polyhedron depicted in a single parallel projection. It uses two sets of information, the list of faces in the object, obtained automatically from the drawing, and a user-identified cubic corner, to compute for the coordinates of the vertices in the drawing and thus establish the 3D geometry of the whole polyhedron. The algorithm exploits the topological structure of the polyhedron, implicit in the connectivities between the faces, resulting in a complexity that is linear in the number of faces. The method is extended to objects with no cubic corners as well. The algorithm works well for recovering objects from accurate line drawings, producing accurate 3D objects. A simple extension to the algorithm allows it to handle inaccurate drawings such as sketches, and produce 3D objects that are consistent with our human perception of the drawings. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "3D reconstruction of polyhedral objects from single parallel projections using cubic corner", "paper_id": "WOS:000293113800019"}