{"auto_keywords": [{"score": 0.049038638823551965, "phrase": "autonomic_nervous_system_responses"}, {"score": 0.015719716506582524, "phrase": "data_fusion"}, {"score": 0.008340514938770348, "phrase": "physiological_computing"}, {"score": 0.006355737293005852, "phrase": "psychological_states"}, {"score": 0.004507760907425495, "phrase": "human-computer_interaction"}, {"score": 0.004294962474996283, "phrase": "user's_psychophysiological_activity"}, {"score": 0.0038309141193444015, "phrase": "vast_body"}, {"score": 0.003633927813203731, "phrase": "universally_accepted_set"}, {"score": 0.003539252646181146, "phrase": "physiological_data"}, {"score": 0.0031565959573536194, "phrase": "five_prerequisites"}, {"score": 0.00307431840409833, "phrase": "psychological_model_selection"}, {"score": 0.0028652153774536967, "phrase": "different_methods"}, {"score": 0.0027417911324611917, "phrase": "extracted_features"}, {"score": 0.002623669616798891, "phrase": "system_adaptation"}, {"score": 0.0024451427672857458, "phrase": "cognitive_or_affective_information"}, {"score": 0.0023090525096074264, "phrase": "computer_scientists"}, {"score": 0.0021613897794439227, "phrase": "subject's_psychological_state"}, {"score": 0.0021049977753042253, "phrase": "british_informatics_society_limited"}], "paper_keywords": ["Affective computing", " Physiological computing", " Psychophysiology", " Data fusion", " Autonomic nervous system"], "paper_abstract": "Physiological computing represents a mode of human-computer interaction where the computer monitors, analyzes and responds to the user's psychophysiological activity in real-time. Within the field, autonomic nervous system responses have been studied extensively since they can be measured quickly and unobtrusively. However, despite a vast body of literature available on the subject, there is still no universally accepted set of rules that would translate physiological data to psychological states. This paper surveys the work performed on data fusion and system adaptation using autonomic nervous system responses in psychophysiology and physiological computing during the last ten years. First, five prerequisites for data fusion are examined: psychological model selection, training set preparation, feature extraction, normalization and dimension reduction. Then, different methods for either classification or estimation of psychological states from the extracted features are presented and compared. Finally, implementations of system adaptation are reviewed: changing the system that the user is interacting with in response to cognitive or affective information inferred from autonomic nervous system responses. The paper is aimed primarily at psychologists and computer scientists who have already recorded autonomic nervous system responses and now need to create algorithms to determine the subject's psychological state. (C) 2012 British Informatics Society Limited. All rights reserved.", "paper_title": "A survey of methods for data fusion and system adaptation using autonomic nervous system responses in physiological computing", "paper_id": "WOS:000306351000005"}