{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "negative_online_information"}, {"score": 0.04258655412884402, "phrase": "brand_evaluation"}, {"score": 0.030636364976101154, "phrase": "brand_attachment"}, {"score": 0.027102023901355774, "phrase": "perceived_negative_change"}, {"score": 0.026594687525968153, "phrase": "perceived_brand_risk"}, {"score": 0.010964632261695393, "phrase": "online_source_credibility"}, {"score": 0.004768649568826951, "phrase": "consumers'_brand_evaluation"}, {"score": 0.004610058444728656, "phrase": "source_credibility"}, {"score": 0.0024224481033945943, "phrase": "main_effects"}, {"score": 0.002387507583705495, "phrase": "proposed_research_model"}, {"score": 0.0023303871145705954, "phrase": "first_study"}, {"score": 0.002285674008055581, "phrase": "moderating_effects"}, {"score": 0.0021566056345478373, "phrase": "negative_change"}, {"score": 0.0021049977753042253, "phrase": "brand_risk"}], "paper_keywords": ["Source credibility", " Brand evaluation", " Brand attachment", " Negative online information", " Online information severity", " Perceived brand risk"], "paper_abstract": "Purpose - The goal of this study is to investigate the relationships among brand attachment, online source credibility, and severity of negative online information on perceived negative change in brand evaluation and perceived brand risk. Design/methodology/approach - A2x2x2 experiment was conducted to explore the effects of brand attachment (low or high), online source credibility (low or high), and online information severity (low or high) on perceived negative change in brand evaluation and perceived brand risk. Findings - The results showed that the severity of negative online information affects perceived negative change in brand evaluation and perceived brand risk significantly. However brand attachment can reduce the effects of negative online information on perceived negative change in brand evaluation and perceived brand risk significantly. The results also showed that the effect of the severity of negative online information on perceived negative change in brand evaluation and perceived brand risk is moderated by online source credibility. Originality/value - In addition to the main effects in the proposed research model, it is the first study to explore the moderating effects of brand attachment and online source credibility on the relationship between negative online information and perceived negative change in brand evaluation and perceived brand risk.", "paper_title": "How negative online information affects consumers' brand evaluation The moderating effects of brand attachment and source credibility", "paper_id": "WOS:000327803300006"}