{"auto_keywords": [{"score": 0.03401932891645662, "phrase": "dassa"}, {"score": 0.010395427269810575, "phrase": "location_information"}, {"score": 0.008713768692145006, "phrase": "wireless_sensor_networks"}, {"score": 0.008647009132216384, "phrase": "partial_coverage"}, {"score": 0.008193679451524761, "phrase": "energy_consumption"}, {"score": 0.007105946038443658, "phrase": "network_lifetime"}, {"score": 0.0043718794256931435, "phrase": "harsh_conditions"}, {"score": 0.004125773078637226, "phrase": "sleep_scheduling_mechanism"}, {"score": 0.003804234575698981, "phrase": "network_field"}, {"score": 0.0036459007842756983, "phrase": "full_coverage"}, {"score": 0.0033228699494959172, "phrase": "distributed_adaptive_sleep_scheduling_algorithm"}, {"score": 0.0030637124954859657, "phrase": "user_defined_coverage_target"}, {"score": 0.00297037471252423, "phrase": "residual_energy_levels"}, {"score": 0.00282470997972535, "phrase": "feedback_mechanism"}, {"score": 0.002554406040896888, "phrase": "cssa"}, {"score": 0.0022568866348667547, "phrase": "decentralized_dgt_algorithm"}, {"score": 0.0022222152430170254, "phrase": "network_lifetimes"}, {"score": 0.002171202123281881, "phrase": "centralized_solution"}, {"score": 0.0021378442381693847, "phrase": "significantly_longer_lifetimes"}, {"score": 0.0021049977753042253, "phrase": "dgt_algorithm"}], "paper_keywords": ["Wireless sensor networks", " Energy efficiency", " Sleep/activity scheduling", " Partial coverage"], "paper_abstract": "One of the most important design objectives in wireless sensor networks (WSN) is minimizing the energy consumption since these networks are expected to operate in harsh conditions where the recharging, of batteries is impractical, if not impossible. The sleep scheduling mechanism allows sensors to sleep Intermittently In order to reduce energy consumption and extend network lifetime. In applications where 100% coverage of the network field is not crucial. allowing the coverage to drop below full coverage while keeping above I predetermined threshold, i.e., partial coverage, call further increase the network lifetime. In this paper, we develop the distributed adaptive sleep scheduling algorithm (DASSA) for WSNs with partial coverage DASSA does not require location Information of sensors while maintaining connectivity and satisfying a User defined coverage target. In DASSA, nodes use the residual energy levels and feedback from the sink for scheduling the activity of their neighbors This feedback mechanism reduces the randomness in scheduling that would otherwise occur due to the absence of location Information. The performance of DASSA is compared with ail integer linear programming (H-P) based centralized sleep scheduling algorithm (CSSA), which is devised to find the maximum number of rounds the network call survive assuming that the location information of all sensors is available DASSA is also compared with the decentralized DGT algorithm. DASSA attains network lifetimes LIP to 92% of the centralized solution and it achieves significantly longer lifetimes compared with the DGT algorithm", "paper_title": "A distributed activity scheduling algorithm for wireless sensor networks with partial coverage", "paper_id": "WOS:000274214700016"}