{"auto_keywords": [{"score": 0.0464485993141056, "phrase": "new_network"}, {"score": 0.015119649415531204, "phrase": "mobile_user"}, {"score": 0.013556912413556336, "phrase": "new_location"}, {"score": 0.010394667185560187, "phrase": "new_path"}, {"score": 0.009612105607093973, "phrase": "probing_process"}, {"score": 0.00481495049065317, "phrase": "flow_adaptation"}, {"score": 0.0047026237903774895, "phrase": "heterogeneous_mobile_networking_environment"}, {"score": 0.00409748471133883, "phrase": "transmission_rate"}, {"score": 0.003787191644093659, "phrase": "common_practices"}, {"score": 0.003640938643675543, "phrase": "fresh_new_slow-start"}, {"score": 0.0033518704336033905, "phrase": "appropriate_rate"}, {"score": 0.003134705849154561, "phrase": "old_rate"}, {"score": 0.0028293966058473476, "phrase": "cross_traffic"}, {"score": 0.002594342451017822, "phrase": "mobility_agent"}, {"score": 0.0025436978068459565, "phrase": "packet_leaking_issue"}, {"score": 0.0023415390666563177, "phrase": "introduced_intelligence"}, {"score": 0.0022070310530794097, "phrase": "data_throughput"}, {"score": 0.002130056082139311, "phrase": "simulation_results"}], "paper_keywords": ["Rate control", " Slow-start", " Handover", " Mobility"], "paper_abstract": "In a heterogeneous mobile networking environment, when a mobile user needs to perform a handover and switch to a new network, besides all the mobility management procedures to keep its connections alive and divert its on-going flows to the new location, the transmission rate of these flows should also be correctly adapted to match the conditions of the new network. One of the common practices is to let the flows to go through a fresh new Slow-start (or its variants) phase to probe along the path between the new location of the mobile user and its correspondent for the appropriate rate. Unfortunately, in many situations packets from these flows will be leaked into the new path at the old rate already before the Slow-start probing is performed, which not only interferes with the probing process but also disturbs the new network and affects the cross traffic along the new path. In this paper we propose to introduce some intelligence into the network, more specifically onto the mobility agent, so that this packet leaking issue is well taken care of before and during the Slow-start probing. On the other hand, with the introduced intelligence the probing process can also be improved in the sense of promptness, speed and data throughput, and these improvements are clearly demonstrated by simulation results. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "Improving Slow-start based probing mechanisms for flow adaptation after handovers", "paper_id": "WOS:000299855200024"}