{"auto_keywords": [{"score": 0.046273829908275756, "phrase": "behavioral_intention"}, {"score": 0.025697209702463166, "phrase": "youtube"}, {"score": 0.015719716506582538, "phrase": "procedural_learning"}, {"score": 0.009000054634664955, "phrase": "perceived_usefulness"}, {"score": 0.00634514940301796, "phrase": "youtube_self-efficacy"}, {"score": 0.004658426838467567, "phrase": "present_study"}, {"score": 0.004544372511597777, "phrase": "tam"}, {"score": 0.0039813976794342, "phrase": "procedural_learning_tasks"}, {"score": 0.003804381587788162, "phrase": "tam_-_perceived_usefulness"}, {"score": 0.0035755653799043, "phrase": "content_richness"}, {"score": 0.0032376465741070274, "phrase": "theoretical_structure"}, {"score": 0.0032109670662222416, "phrase": "sample_data"}, {"score": 0.0029805015010906013, "phrase": "lab_setting"}, {"score": 0.002883439044844259, "phrase": "structural_equation_model"}, {"score": 0.0027211030647461324, "phrase": "user_satisfaction"}, {"score": 0.002676418520290942, "phrase": "task-technology_fit"}, {"score": 0.00255727386763536, "phrase": "significant_predictors"}, {"score": 0.002494531100339247, "phrase": "perceived_ease"}, {"score": 0.0022773309395419427, "phrase": "overall_findings"}, {"score": 0.0021940118003312397, "phrase": "common_channel"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Procedural learning", " The Technology Acceptance Model", " You Tube"], "paper_abstract": "The present study was framed using the Technology Acceptance Model (TAM) to identify determinants affecting behavioral intention to use YouTube. Most importantly, this research emphasizes the motives for using YouTube, which is notable given its extrinsic task goal of being used for procedural learning tasks. Our conceptual framework included two proximal antecedents of behavioral intention as proposed by the TAM - perceived usefulness and perceived ease of use. Additionally, the four first-order constructs of user satisfaction, content richness, vividness, and YouTube self-efficacy, as well as one second-order construct of content richness, were additionally incorporated into the framework by elaborating the theoretical structure. Sample data was collected from 432 respondents who were given the opportunity to engage in procedural learning through YouTube in a lab setting. The results derived from fitting the structural equation model on the sample indicated that behavioral intention was significantly influenced by both perceived usefulness and user satisfaction. Moreover, task-technology fit, content richness, vividness, and YouTube self-efficacy emerged as significant predictors of perceived usefulness. However, perceived ease of use was not significantly predictive of either perceived usefulness or behavioral intention. Our proposed model explained 43.8% of the variance in behavioral intention. Overall findings suggest that YouTube may augment its function as a common channel for procedural learning and instruction. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "User acceptance of You Tube for procedural learning: An extension of the Technology Acceptance Model", "paper_id": "WOS:000312517900017"}