{"auto_keywords": [{"score": 0.03213722452878967, "phrase": "qualitative_interpretation"}, {"score": 0.031676601262660434, "phrase": "quality_measures"}, {"score": 0.028078826730535668, "phrase": "quality_component_measures"}, {"score": 0.00481495049065317, "phrase": "pooled_comparative_information"}, {"score": 0.0046741260449047976, "phrase": "quality_assessment"}, {"score": 0.004212759658511567, "phrase": "decision_support_tools"}, {"score": 0.0040491842732233154, "phrase": "data_impacts"}, {"score": 0.0037593414153801394, "phrase": "pooled_information"}, {"score": 0.0033379819706003885, "phrase": "resident_physicians"}, {"score": 0.0032724821705972357, "phrase": "varying_types"}, {"score": 0.003192406091820197, "phrase": "pooled_patient_datasets"}, {"score": 0.00308357048262018, "phrase": "individual_and_group_level"}, {"score": 0.0029637093924781825, "phrase": "percentile_rank"}, {"score": 0.0029055323737809825, "phrase": "aggregate_composite_quality_score"}, {"score": 0.0021049977753042253, "phrase": "composite_quality_score"}], "paper_keywords": ["Decision support", " judgment analysis (JA)", " quality assessment", " quality improvement"], "paper_abstract": "Quality assessment is the focus of many healthcare initiatives. Yet, it is not well understood how the type of information used in decision support tools to enable judgments of quality based on data impacts the accuracy, consistency, and reliability of judgments made by physicians. Comparative pooled information could allow physicians to judge the quality of their practice by making comparisons with other practices or other specific populations of patients. In this study, resident physicians were provided with varying types of information derived from pooled patient datasets: quality component measures at the individual and group level, a qualitative interpretation of the quality measures using percentile rank, and an aggregate composite quality score. Thirty-two participants viewed 30 quality profiles consisting of information applicable to the practice of 30 deidentified resident physicians. Those provided with quality component measures and a qualitative interpretation of the quality measures (rankings) judged quality of care more similarly to experts and were more internally consistent compared with participants who were provided with quality component measures alone. Reliability between participants was significantly less for those who were provided with a composite quality score compared with those who were not.", "paper_title": "Effect of Pooled Comparative Information on Judgments of Quality", "paper_id": "WOS:000366893700011"}