{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "dna_sequence_design"}, {"score": 0.004762550320451225, "phrase": "dna_computation"}, {"score": 0.004685012337701536, "phrase": "binary_particle_swarm_optimization._deoxyribonucleic_acid"}, {"score": 0.0036419834462626125, "phrase": "dna-based_nanotechnology"}, {"score": 0.003602302241898501, "phrase": "polymerase_chain_reaction"}, {"score": 0.0033916328188225843, "phrase": "dna_templates"}, {"score": 0.0031584367879334114, "phrase": "dna_sequences"}, {"score": 0.0027691111795848183, "phrase": "objective_functions"}, {"score": 0.002592784882557155, "phrase": "binary_particle_swarm_optimization"}, {"score": 0.0021994343316143125, "phrase": "good_dna_sequences"}, {"score": 0.0021516991383785985, "phrase": "basic_pso_algorithm"}, {"score": 0.0021049977753042253, "phrase": "aggregated_fitness_value"}], "paper_keywords": ["Particle swarm optimization", " Binary PSO", " DNA sequence design", " Optimization"], "paper_abstract": "Deoxyribonucleic Acid (DNA) has certain unique properties such as self-assembly and self-complementary in hybridization, which are important in many DNA-based technologies. DNA computing, for example, uses these properties to realize a computation in vitro, which consists of several chemical reactions. Other DNA-based technologies such as DNA-based nanotechnology and polymerase chain reaction also depend on hybridization to assemble nanostructure and to amplify DNA templates, respectively. Hybridization of DNA can be controlled by properly designing DNA sequences. In this paper, sequences are designed such that each sequence uniquely hybridizes to its complementary sequence, but not to any other sequences. Objective functions involved are similarity, H-measure, continuity, and hairpin. Binary particle swarm optimization (BinPSO) is employed to minimize those objectives subjected to two constraints: melting temperature and GC(content). It is found that BinPSO can provide a set of good DNA sequences, better than basic PSO algorithm in terms of aggregated fitness value.", "paper_title": "DNA SEQUENCE DESIGN FOR DNA COMPUTATION BASED ON BINARY PARTICLE SWARM OPTIMIZATION", "paper_id": "WOS:000305169200001"}