{"auto_keywords": [{"score": 0.0452514208810669, "phrase": "expected_value"}, {"score": 0.014839240142940933, "phrase": "stochastic_networks"}, {"score": 0.01287885093880505, "phrase": "expected_capacity"}, {"score": 0.00481495049065317, "phrase": "stochastic_maximum_flow_problems"}, {"score": 0.004590820632326585, "phrase": "maximum_flow_problem"}, {"score": 0.004494570360108983, "phrase": "random_arc_failures"}, {"score": 0.0036359780843400625, "phrase": "polynomial_time"}, {"score": 0.0031342307827666675, "phrase": "relative_increase"}, {"score": 0.0030521898646210413, "phrase": "maximum_flow"}, {"score": 0.002561892963059385, "phrase": "simulation-based_approach"}, {"score": 0.002429451930463481, "phrase": "computational_results"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Network flows", " Stochastic networks", " Value of information", " Statistical simulation"], "paper_abstract": "In this paper, we study the maximum flow problem in stochastic networks with random arc failures. We present the concept of expected value of a given flow and seek a flow whose expected value is maximum. We also introduce the concept of expected capacity of a given cut. While the expected capacity of a cut can be computed in polynomial time, we show that it is NP-hard to compute the expected value of a flow. We define the value of information in stochastic networks as the relative increase in the expected value of maximum flow if we are permitted to determine a flow after the realization of the failures in the network, rather than determining a flow before the uncertainty is revealed. We use a simulation-based approach to compute the value of information and provide some computational results to demonstrate the ability of this method. Our results show that the value of information can be around 61% on some instances. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "The value of information in stochastic maximum flow problems", "paper_id": "WOS:000318131900009"}