{"auto_keywords": [{"score": 0.04068494061522274, "phrase": "rendezvous_problem"}, {"score": 0.036468026600695556, "phrase": "lower_bound"}, {"score": 0.00481495049065317, "phrase": "exponential_memory_gap"}, {"score": 0.004474645041899596, "phrase": "unknown_anonymous_connected_graph"}, {"score": 0.004103212598803194, "phrase": "exploration_problem"}, {"score": 0.004075946554498088, "phrase": "compact_automata"}, {"score": 0.003955465362027017, "phrase": "mobile_agents"}, {"score": 0.003700279655380723, "phrase": "synchronous_rounds"}, {"score": 0.0035669891404642015, "phrase": "starting_times"}, {"score": 0.0031845067058084583, "phrase": "previously_known_upper_bound"}, {"score": 0.0030902938839530883, "phrase": "arbitrary_graphs"}, {"score": 0.002900426826591769, "phrase": "simultaneous_start"}, {"score": 0.00285242509099472, "phrase": "number_l"}, {"score": 0.002381872778203302, "phrase": "polylogarithmically_many_leaves"}, {"score": 0.0023424328921363585, "phrase": "exponential_gap"}, {"score": 0.0023268399760599336, "phrase": "minimum_memory_size"}, {"score": 0.002265497060260791, "phrase": "arbitrary_delay"}], "paper_keywords": ["Rendezvous", " exploration", " compact data structure"], "paper_abstract": "The aim of rendezvous in a graph is meeting of two mobile agents at some node of an unknown anonymous connected graph. In this article, we focus on rendezvous in trees, and, analogously to the efforts that have been made for solving the exploration problem with compact automata, we study the size of memory of mobile agents that permits to solve the rendezvous problem deterministically. We assume that the agents are identical, and move in synchronous rounds. We first show that if the delay between the starting times of the agents is arbitrary, then the lower bound on memory required for rendezvous is Omega (log n) bits, even for the line of length n. This lower bound meets a previously known upper bound of O(log n) bits for rendezvous in arbitrary graphs of size at most n. Our main result is a proof that the amount of memory needed for rendezvous with simultaneous start depends essentially on the number l of leaves of the tree, and is exponentially less impacted by the number n of nodes. Indeed, we present two identical agents with O(log l + log log n) bits of memory that solve the rendezvous problem in all trees with at most n nodes and at most l leaves. Hence, for the class of trees with polylogarithmically many leaves, there is an exponential gap in minimum memory size needed for rendezvous between the scenario with arbitrary delay and the scenario with delay zero. Moreover, we show that our upper bound is optimal by proving that Omega (log l + log log n) bits of memory are required for rendezvous, even in the class of trees with degrees bounded by 3.", "paper_title": "Delays Induce an Exponential Memory Gap for Rendezvous in Trees", "paper_id": "WOS:000316414900004"}