{"auto_keywords": [{"score": 0.041656217336660355, "phrase": "digital_game_use"}, {"score": 0.03423580446888981, "phrase": "digital_games"}, {"score": 0.00481495049065317, "phrase": "digital_games_aid_post-work"}, {"score": 0.004728499903204582, "phrase": "necessary_factor"}, {"score": 0.004677372885331908, "phrase": "work-related_strain"}, {"score": 0.004318881178805575, "phrase": "psychological_detachment"}, {"score": 0.004225950334493496, "phrase": "mastery_experiences"}, {"score": 0.0035636532531133514, "phrase": "whi"}, {"score": 0.003104619199351347, "phrase": "present_research"}, {"score": 0.0030267296900520217, "phrase": "total_number"}, {"score": 0.002897710777957041, "phrase": "overall_recovery"}, {"score": 0.0027842669893795766, "phrase": "game_characteristics"}, {"score": 0.0027341763737751467, "phrase": "first_person_shooters"}, {"score": 0.0027143926774929957, "phrase": "action_games"}, {"score": 0.0025334249463305875, "phrase": "-home_interference"}, {"score": 0.00241658945942583, "phrase": "online_relationships"}, {"score": 0.0023990982005125763, "phrase": "online_social_support"}, {"score": 0.002190825828942124, "phrase": "work-related_stress"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Recovery from work", " Digital games", " Wellbeing", " Work-related stress"], "paper_abstract": "Recovery is a necessary factor in avoiding work-related strain and in feeling prepared for the next day of work. In order for recovery to be successful, an individual must experience psychological detachment from work, relaxation, mastery experiences and a sense of control, all of which have been argued to be assisted by digital game use. However, it is unclear whether these associations will be greater for certain digital game genres, or whether this would extend to other recovery-related outcomes, for instance work home interference (WHI), where the stress from work interferes with home-life. These factors may be vital in determining whether interventions aimed at improving recovery using digital games would be effective, and what form these should take. The present research surveyed 491 participants and found that the total number of hours spent playing digital games per week was positively correlated with overall recovery. Correlations varied with genre, highlighting the importance of game characteristics in this relationship: first person shooters and action games were most highly correlated with recovery. Moreover, digital game use was not related to a reduction in work-home interference. When restricting the analysis to garners who report to have developed online relationships, online social support mediated the relationship between digital game use and recovery. Results are discussed in terms of how digital games may be utilised to improve recovery and reduce work-related stress. (C) 2014 The Authors. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Switch on to games: Can digital games aid post-work recovery?", "paper_id": "WOS:000339149500004"}