{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multiple_attribute"}, {"score": 0.004790306679000464, "phrase": "group_decision_making"}, {"score": 0.004367581653370531, "phrase": "input_arguments"}, {"score": 0.003343841875107018, "phrase": "uncertain_environment"}, {"score": 0.002895620643297197, "phrase": "aggregation_values"}, {"score": 0.0026806884201358537, "phrase": "desired_properties"}, {"score": 0.00263965046277432, "phrase": "developed_operators"}, {"score": 0.002393907896783117, "phrase": "multiple_attribute_group_decision"}, {"score": 0.0022161333611134806, "phrase": "practical_example"}, {"score": 0.0021267708018655493, "phrase": "new_operators"}, {"score": 0.0021049977753042253, "phrase": "multiple_attribute_group_decision_making_process"}], "paper_keywords": ["Group decision making", " 2-tuple linguistic information", " PA operator", " 2-tuple linguistic generalized power average operator (2TLGPA)", " interval 2-tuple linguistic generalized power average (I2TLGPA) operator"], "paper_abstract": "The power-average (PA) operator and the power ordered weighted average (POWA) operator are the two nonlinear weighted-average aggregation tools whose weighting vectors depend on the input arguments. The purpose of this paper is to develop the 2-tuple linguistic generalized power average (2TLGPA) operator and the interval 2-tuple linguistic generalized power average (I2TLGPA) operator. We first propose the 2TLGPA operator and the 2-tuple linguistic generalized power ordered weighted average (2TLGPOWA) operator. Then, we extend these operators to uncertain environment and obtain the interval 2-tuple linguistic generalized power average (I2TLGPA) operator and the interval 2-tuple linguistic generalized power ordered weighted average (I2TLGPOWA) operator. They can reflect the relationship among the aggregation values by considering the support for each value from others. We further investigate some desired properties of the developed operators, such as idempotency, boundedness, etc. We also present two kinds of approaches to deal with multiple attribute group decision making problems under 2-tuple linguistic and interval 2-tuple linguistic environment by using the proposed aggregation operators. Finally, a practical example is given to illustrate the application of new operators to multiple attribute group decision making process.", "paper_title": "Some 2-tuple linguistic generalized power aggregation operators and their applications to multiple attribute group decision making", "paper_id": "WOS:000362627000037"}