{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "classical_and_operant_conditioning"}, {"score": 0.004781915513030716, "phrase": "adaptive_real-world_behavior"}, {"score": 0.004749106104067268, "phrase": "dac-x._animals"}, {"score": 0.004684157900507474, "phrase": "new_environments"}, {"score": 0.003956784357357341, "phrase": "behavioral_aspects"}, {"score": 0.0037188360359702182, "phrase": "complex_behaviors"}, {"score": 0.0033883824438527316, "phrase": "core_functional_subsystems"}, {"score": 0.003353521531649663, "phrase": "layered_architecture"}, {"score": 0.003173545808843704, "phrase": "theoretical_principles"}, {"score": 0.003130077012135034, "phrase": "biologically_constrained_computational_models"}, {"score": 0.0030659842174709656, "phrase": "mammalian_brain"}, {"score": 0.0030239842475439814, "phrase": "complex_foraging_strategies"}, {"score": 0.0029928611380840757, "phrase": "progressive_acquisition"}, {"score": 0.002931569771634119, "phrase": "task-dependent_information"}, {"score": 0.0028321862184182913, "phrase": "goal-oriented_deliberation"}, {"score": 0.00276462370914216, "phrase": "robot-based_hoarding_task"}, {"score": 0.0027361626349903744, "phrase": "main_perceptual_and_cognitive_aspects"}, {"score": 0.0026616868981501006, "phrase": "efficient_goal-oriented_behavior_results"}, {"score": 0.0026161698049580804, "phrase": "parallel_learning_mechanisms"}, {"score": 0.0025892330566358503, "phrase": "motor_adaptation"}, {"score": 0.002571429085596686, "phrase": "spatial_encoding"}, {"score": 0.002441734529530325, "phrase": "dac-x_building"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Goal-oriented behavior", " Cognitive architecture", " Robot", " Foraging", " Distributed Adaptive Control"], "paper_abstract": "Animals successfully forage within new environments by learning, simulating and adapting to their surroundings. The functions behind such goal-oriented behavior can be decomposed into 5 top-level objectives: 'how', 'why', 'what', 'where', 'when' (H4W). The paradigms of classical and operant conditioning describe some of the behavioral aspects found in foraging. However, it remains unclear how the organization of their underlying neural principles account for these complex behaviors. We address this problem from the perspective of the Distributed Adaptive Control theory of mind and brain (DAC) that interprets these two paradigms as expressing properties of core functional subsystems of a layered architecture. In particular, we propose DAC-X, a novel cognitive architecture that unifies the theoretical principles of DAC with biologically constrained computational models of several areas of the mammalian brain. DAC-X supports complex foraging strategies through the progressive acquisition, retention and expression of task-dependent information and associated shaping of action, from exploration to goal-oriented deliberation. We benchmark DAC-X using a robot-based hoarding task including the main perceptual and cognitive aspects of animal foraging. We show that efficient goal-oriented behavior results from the interaction of parallel learning mechanisms accounting for motor adaptation, spatial encoding and decision-making. Together, our results suggest that the H4W problem can be solved by DAC-X building on the insights from the study of classical and operant conditioning. Finally, we discuss the advantages and limitations of the proposed biologically constrained and embodied approach towards the study of cognition and the relation of DAC-X to other cognitive architectures. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "An embodied biologically constrained model of foraging: from classical and operant conditioning to adaptive real-world behavior in DAC-X", "paper_id": "WOS:000366701700008"}