{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "novel_representation"}, {"score": 0.004613175917207636, "phrase": "efficient_inference"}, {"score": 0.004270960586542813, "phrase": "correspondence_real-valued_functions"}, {"score": 0.004074397977869244, "phrase": "multi-scale_basis"}, {"score": 0.0040223714916651845, "phrase": "function_space"}, {"score": 0.0035676056286816915, "phrase": "global_inference"}, {"score": 0.003374250301861101, "phrase": "descriptor_preservation"}, {"score": 0.0033454448643854525, "phrase": "landmark_correspondences"}, {"score": 0.0030573959252626695, "phrase": "map_sum"}, {"score": 0.002842428606954139, "phrase": "annotation_transfer"}, {"score": 0.0028060889647071787, "phrase": "point-to-point_correspondences"}, {"score": 0.0026998264237910884, "phrase": "efficient_shape"}, {"score": 0.002575385171755899, "phrase": "single_linear_solve"}, {"score": 0.0025424508991051483, "phrase": "new_method"}, {"score": 0.0024252458095689847, "phrase": "isometric_shape"}, {"score": 0.002216251512062482, "phrase": "existing_shape"}, {"score": 0.0021414489155042885, "phrase": "segmentation_transfer"}, {"score": 0.0021231452870210965, "phrase": "joint_analysis"}, {"score": 0.0021049977753042253, "phrase": "shape_collections"}], "paper_keywords": ["shape matching", " representation", " correspondence"], "paper_abstract": "We present a novel representation of maps between pairs of shapes that allows for efficient inference and manipulation. Key to our approach is a generalization of the notion of map that puts in correspondence real-valued functions rather than points on the shapes. By choosing a multi-scale basis for the function space on each shape, such as the eigenfunctions of its Laplace-Beltrami operator, we obtain a representation of a map that is very compact, yet fully suitable for global inference. Perhaps more remarkably, most natural constraints on a map, such as descriptor preservation, landmark correspondences, part preservation and operator commutativity become linear in this formulation. Moreover, the representation naturally supports certain algebraic operations such as map sum, difference and composition, and enables a number of applications, such as function or annotation transfer without establishing point-to-point correspondences. We exploit these properties to devise an efficient shape matching method, at the core of which is a single linear solve. The new method achieves state-of-the-art results on an isometric shape matching benchmark. We also show how this representation can be used to improve the quality of maps produced by existing shape matching methods, and illustrate its usefulness in segmentation transfer and joint analysis of shape collections.", "paper_title": "Functional Maps: A Flexible Representation of Maps Between Shapes", "paper_id": "WOS:000308250300006"}