{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "cloud_computing_environment"}, {"score": 0.009423818164076968, "phrase": "faulty_processors"}, {"score": 0.0047555023078686386, "phrase": "cloud_computing"}, {"score": 0.0044968982227349625, "phrase": "internet_services"}, {"score": 0.004350288865140501, "phrase": "fca"}, {"score": 0.004122179528285764, "phrase": "large_number"}, {"score": 0.0037318666008429014, "phrase": "crucial_challenge"}, {"score": 0.003617616153730564, "phrase": "important_issues"}, {"score": 0.003378385493203297, "phrase": "healthy_processors"}, {"score": 0.003039311963787733, "phrase": "traditional_ba_protocol"}, {"score": 0.0022402661832994094, "phrase": "minimum_number"}, {"score": 0.0021049977753042253, "phrase": "maximum_number"}], "paper_keywords": ["Cloud computing", " Byzantine agreement", " Fault diagnosis agreement", " Fault-tolerance", " Reliability"], "paper_abstract": "Cloud computing is attractive for users having more demands on the Internet services because it can provide a variety of services. It can provide a large number of applications on the Internet. However, the fault-tolerance of a cloud computing environment is a crucial challenge. One of the important issues surrounding fault-tolerance is the Byzantine Agreement (BA) problem. It requires a set of healthy processors to reach an agreement, even if some components are faulty. In general, the traditional BA protocol needs aOES(n - 1)/3aOE < + 2 rounds to reach an agreement and detect faulty processors. This is unreasonable and inefficient in a cloud computing environment. Therefore, the FCA (Fast Cloud Agreement) protocol is proposed to enhance the reliability of the cloud computing environment in this paper. The FCA can reach an agreement and detect faulty processors by using a minimum number of messages simultaneously and efficiently. Besides, the maximum number of faulty processors can be detected by the FCA in a cloud computing environment.", "paper_title": "Efficient Diagnosis Protocol to Enhance the Reliability of a Cloud Computing Environment", "paper_id": "WOS:000309340700007"}