{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "basic_synchronization"}, {"score": 0.004698000536608171, "phrase": "dual_cell-based_blades"}, {"score": 0.004583878086896926, "phrase": "cell_broadband_engine"}, {"score": 0.004195418010131832, "phrase": "multimedia_applications"}, {"score": 0.0036194914688460656, "phrase": "efficient_applications"}, {"score": 0.003445591238183763, "phrase": "dual_cell-based_blade_platforms"}, {"score": 0.003247868216333148, "phrase": "dedicated_high-speed_interface"}, {"score": 0.0030614565460256897, "phrase": "main_synchronization"}, {"score": 0.0030314419455512013, "phrase": "communication_primitives"}, {"score": 0.002899965889623787, "phrase": "dual_cell-based_blade"}, {"score": 0.002706659627293686, "phrase": "dma_transfer_mechanism"}, {"score": 0.0025262061502713683, "phrase": "atomic_operations"}, {"score": 0.0024405312482831646, "phrase": "thread_creation"}], "paper_keywords": ["Cell Broadband Engine", " CellStats", " Synchronization primitives", " Communication operations"], "paper_abstract": "The Cell Broadband Engine (Cell BE) is a heterogeneous chip-multiprocessor (CMP) architecture to offer very high performance, especially on game and multimedia applications. The singularity of its architecture, nine cores of two different types, along with the variety of synchronization and communication primitives offered to programmers, make the task of developing efficient applications very challenging. This situation gets even worse when dual Cell-based blade platforms are considered, where two separate Cells can be linked together through a dedicated high-speed interface. In this work, we present a characterization of the main synchronization and communication primitives provided to programmers in the context of a dual Cell-based blade under varying workloads through our CellStats tool. In particular, we focus on the DMA transfer mechanism, the mailboxes, the signals, the read-modify-write atomic operations, and the time taken by thread creation. Our performance results expose the bottlenecks and asymmetries of these platforms, which must be taken into account by programmers for choosing the most adequate primitives to improve the efficiency of their applications.", "paper_title": "Characterizing the basic synchronization and communication operations in Dual Cell-based Blades through CellStats", "paper_id": "WOS:000279843800001"}