{"auto_keywords": [{"score": 0.04875227329545032, "phrase": "canada"}, {"score": 0.043067147871201264, "phrase": "oss_adoption_decisions"}, {"score": 0.03184912265048545, "phrase": "oss"}, {"score": 0.02941845886708639, "phrase": "public_discourse"}, {"score": 0.00481495049065317, "phrase": "open_source_software_adoption"}, {"score": 0.004787966206092959, "phrase": "health_care_organizations"}, {"score": 0.004475659507646842, "phrase": "developed_countries"}, {"score": 0.004339379163693652, "phrase": "possible_role"}, {"score": 0.0042908537749279056, "phrase": "information_technology"}, {"score": 0.004183638135671596, "phrase": "research_model"}, {"score": 0.004010841760769459, "phrase": "conceptual_framework"}, {"score": 0.0037070855410818986, "phrase": "social_services"}, {"score": 0.0035639149949775856, "phrase": "qualitative_data_analysis"}, {"score": 0.003484590981697944, "phrase": "major_antecedents"}, {"score": 0.003247868216333148, "phrase": "classical_diffusion"}, {"score": 0.003131178497790961, "phrase": "institutional_theory"}, {"score": 0.0029348825283571924, "phrase": "hco"}, {"score": 0.0028214413724451442, "phrase": "external_environment"}, {"score": 0.0027898428590137515, "phrase": "institutional_pressures"}, {"score": 0.0027585984833526445, "phrase": "oss."}, {"score": 0.0026148807877309417, "phrase": "health_care_community"}, {"score": 0.0023100907305651872, "phrase": "different_factors"}, {"score": 0.0022842059306412304, "phrase": "hco's_decision"}, {"score": 0.002271372252250557, "phrase": "oss_adoption"}, {"score": 0.0022145052062614514, "phrase": "better_understanding"}, {"score": 0.0022020622730208514, "phrase": "hcos'_rationale"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Open source software", " Medical software adoption", " Administrative software adoption", " Qualitative survey"], "paper_abstract": "Purpose: Open source software (OSS) adoption and use in health care organizations (HCOs) is relatively low in developed countries, but several contextual factors have recently encouraged the consideration of the possible role of OSS in information technology (IT) application portfolios. This article aims at developing a research model for investigating the antecedents of OSS adoption decisions in HCOs. Methods: Based on a conceptual framework derived from a synthesis of the literature on IT adoption in organizations, we conducted 18 semi-structured interviews with IT experts from all levels of the Province of Quebec's health and social services sector in Canada. We also interviewed 10 IT suppliers in the province. A qualitative data analysis of the interviews was performed to identify major antecedents of OSS adoption decisions in HCOs. Results: Eight factors associated with three distinct theoretical perspectives influence OSS adoption. More specifically, they are associated with the classical diffusion of innovations theory, the theory of resources, as well as institutional theory and its spin-off, the organizing vision theory. The factors fall under three categories: the characteristics of OSS as an innovation, the characteristics of the HCO with respect to its ability to absorb OSS, and the characteristics of the external environment with respect to institutional pressures and public discourse surrounding OSS. We shed light on two novel factors that closely interact with each other: (1) interest of the health care community in the public discourse surrounding OSS, and (2) clarity, consistency and richness of this discourse, whether found in magazines or other media. Conclusions: OSS still raises many questions and presents several challenges for HCOs. It is crucial that the different factors that explain an HCO's decision on OSS adoption be considered simultaneously. Doing so allows a better understanding of HCOs' rationale when deciding to adopt, or not to adopt, OSS. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Antecedents of open source software adoption in health care organizations: A qualitative survey of experts in Canada", "paper_id": "WOS:000321499700010"}