{"auto_keywords": [{"score": 0.04132317545427676, "phrase": "k-word_distributions"}, {"score": 0.0409227600835861, "phrase": "markov"}, {"score": 0.015553712689424569, "phrase": "sequence_comparison"}, {"score": 0.010515442899435032, "phrase": "functionally_related_regulatory_sequences"}, {"score": 0.00481495049065317, "phrase": "novel_statistical_measures"}, {"score": 0.0046164478775379105, "phrase": "statistical_measures"}, {"score": 0.004520272777451894, "phrase": "biological_sequences"}, {"score": 0.00433386573276633, "phrase": "evolutionary_information"}, {"score": 0.0033480035183418642, "phrase": "proposed_measures"}, {"score": 0.003278167066287366, "phrase": "similarity_search"}, {"score": 0.0030772505522663612, "phrase": "systematic_and_quantitative_experimental_assessment"}, {"score": 0.002518525107994039, "phrase": "intrinsic_ability"}, {"score": 0.002440071551819324, "phrase": "similar_sequences"}, {"score": 0.0022904032758108775, "phrase": "second_one"}, {"score": 0.002172701452347454, "phrase": "phylogenetic_analysis"}, {"score": 0.0021385822825864425, "phrase": "experimental_assessment"}], "paper_keywords": [""], "paper_abstract": "Motivation: Many proposed statistical measures can efficiently compare biological sequences to further infer their structures, functions and evolutionary information. They are related in spirit because all the ideas for sequence comparison try to use the information on the k-word distributions, Markov model or both. Motivated by adding k-word distributions to Markov model directly, we investigated two novel statistical measures for sequence comparison, called wre.k.r and S2.k.r.. Results: The proposed measures were tested by similarity search, evaluation on functionally related regulatory sequences and phylogenetic analysis. This offers the systematic and quantitative experimental assessment of our measures. Moreover, we compared our achievements with these based on alignment or alignment-free. We grouped our experiments into two sets. The first one, performed via ROC (receiver operating curve) analysis, aims at assessing the intrinsic ability of our statistical measures to search for similar sequences from a database and discriminate functionally related regulatory sequences from unrelated sequences. The second one aims at assessing how well our statistical measure is used for phylogenetic analysis. The experimental assessment demonstrates that our similarity measures intending to incorporate k-word distributions into Markov model are more efficient.", "paper_title": "Markov model plus k-word distributions: a synergy that produces novel statistical measures for sequence comparison", "paper_id": "WOS:000259973500004"}