{"auto_keywords": [{"score": 0.04954397446159369, "phrase": "fuzzy_information"}, {"score": 0.00481495049065317, "phrase": "database_schemas"}, {"score": 0.004577440795549049, "phrase": "ontology_system"}, {"score": 0.004425616928975799, "phrase": "knowledge_structure"}, {"score": 0.004254814649568355, "phrase": "fuzzy_databases"}, {"score": 0.003999578057088828, "phrase": "metadata_definition_process"}, {"score": 0.003823584649521733, "phrase": "imprecise_and_classic_information"}, {"score": 0.003140004304719746, "phrase": "domain_information"}, {"score": 0.0030017207229983385, "phrase": "fuzzy_and_classic_database_schemas"}, {"score": 0.0029348729207661225, "phrase": "online_public_databases"}, {"score": 0.0025208755851561368, "phrase": "fuzzy_data_values"}, {"score": 0.0023827927890399357, "phrase": "fuzzy_data_types"}, {"score": 0.0022396019251440724, "phrase": "schema_tables"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "In this paper, an ontology system is proposed to represent the knowledge structure enabling fuzzy information to be stored in fuzzy databases. This proposal allows users or applications to simplify the metadata definition process that is necessary for representing and managing imprecise and classic information in these databases. This ontology then acts as an interface that formalizes the representation of such structures and allows access to them. The instances obtained from this ontology represent the schemas that describe domain information in a database. The description of fuzzy and classic database schemas allows access to online public databases for which no other semantic description is associated. This paper also presents another ontology to represent these schemas as instances. Not only does this ontology allow fuzzy data values to be stored (because of the definition of fuzzy data types as classes of the ontology) but it also enables schema tables and attributes to be defined. (C) 2008 Wiley Periodicals, Inc.", "paper_title": "The use of ontologies for representing database schemas of fuzzy information", "paper_id": "WOS:000254221300002"}