{"auto_keywords": [{"score": 0.040315713044931326, "phrase": "term_informetrics"}, {"score": 0.004726579360618152, "phrase": "enormous_speed"}, {"score": 0.004622662375029505, "phrase": "indispensable_source"}, {"score": 0.00452101969521343, "phrase": "new_pages"}, {"score": 0.0043889488321824785, "phrase": "additional_processes"}, {"score": 0.0040904740665330805, "phrase": "eight_year_long_project"}, {"score": 0.004000486064911652, "phrase": "multiple_search_engines"}, {"score": 0.0038122196479548425, "phrase": "data_collection"}, {"score": 0.0035528259557800683, "phrase": "search_engines"}, {"score": 0.0035135084960705816, "phrase": "previously_identified_pages"}, {"score": 0.0031904205547902695, "phrase": "obvious_growth"}, {"score": 0.002650018880406324, "phrase": "search_term"}, {"score": 0.0024330980793680337, "phrase": "whole_period"}, {"score": 0.0023972232771581753, "phrase": "e-print_servers"}, {"score": 0.002379484250348599, "phrase": "publishers'_sites"}, {"score": 0.002344398099179438, "phrase": "large_number"}, {"score": 0.002284234786840546, "phrase": "longitudinal_studies"}, {"score": 0.0021049977753042253, "phrase": "underlying_web_processes"}], "paper_keywords": [""], "paper_abstract": "The World Wide Web is growing at an enormous speed, and has become an indispensable source for information and research. New pages are constantly added, but there are additional processes as well: pages are moved or removed and/or their content changes. We report here the results of an eight year long project started in 1998, when multiple search engines were used to identify a set of pages containing the term informetrics. Data collection was repeated once a year for the last eight years (with the exception of 2000 and 2001) using both search engines and revisiting previously identified pages. The results show that the number of pages grew from 866 in 1998 to 28,914 in 2006 - a 33-fold growth. Besides the obvious growth of the topic on the Web, we observed both decay (pages disappearing from the Web) and modification. Even though most of the pages from 1998 either disappeared or ceased to contain the term informetrics, 165 pages (19.1%) still exist in 2006 and contain the search term. We followed the \"fate\" of these 165 pages: characterized the publishers, the contents and the changes that occurred the whole period. In recent years e-print servers and publishers' sites became sources of large number of pages related to informetrics. Longitudinal studies following the evolution of a topic on the Web are very important, since they provide insights about content and the underlying Web processes.", "paper_title": "The lifespan of \"informetrics\" on the Web: An eight year study (1998-2006)", "paper_id": "WOS:000264487900001"}