{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "concern_metrics"}, {"score": 0.03997332300879891, "phrase": "crosscutting_concerns"}, {"score": 0.013065516459530161, "phrase": "software_maintainability"}, {"score": 0.010824042338107983, "phrase": "crosscutting_properties"}, {"score": 0.004614867204809923, "phrase": "software_quality"}, {"score": 0.004575854901681043, "phrase": "software_maintenance"}, {"score": 0.004299621153829837, "phrase": "major_consideration"}, {"score": 0.004251210982670317, "phrase": "design_stages"}, {"score": 0.0042152598699753165, "phrase": "software_maintenance_costs"}, {"score": 0.004097595199141165, "phrase": "software_life_cycle"}, {"score": 0.003927203683176278, "phrase": "upfront_consideration"}, {"score": 0.0039050245929822354, "phrase": "proper_modularity_choices"}, {"score": 0.003721470218011247, "phrase": "negative_effects"}, {"score": 0.0035165002796966895, "phrase": "early_artefacts"}, {"score": 0.0033511469200347907, "phrase": "empirical_analysis"}, {"score": 0.00290016162105678, "phrase": "crosscutting_concern"}, {"score": 0.002656158309155626, "phrase": "non-syntactic_dependencies"}, {"score": 0.0025026085288350004, "phrase": "subtle_dependencies"}, {"score": 0.0022919762167777427, "phrase": "whole_analysis"}, {"score": 0.0022597003243250294, "phrase": "target_cases"}, {"score": 0.002234206434819338, "phrase": "maintainability_properties"}, {"score": 0.002215274527909304, "phrase": "upmost_importance"}, {"score": 0.002190280748985751, "phrase": "individual_products"}, {"score": 0.0021594338450797485, "phrase": "core_architecture"}, {"score": 0.002141134176057931, "phrase": "product_line"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Requirements engineering", " Product lines", " Crosscutting", " Concern metrics", " Maintainability", " Stability"], "paper_abstract": "Context: Maintainability has become one of the most essential attributes of software quality, as software maintenance has shown to be one of the most costly and time-consuming tasks of software development. Many studies reveal that maintainability is not often a major consideration in requirements and design stages, and software maintenance costs may be reduced by a more controlled design early in the software life cycle. Several problem factors have been identified as harmful for software maintainability, such as lack of upfront consideration of proper modularity choices. In that sense, the presence of crosscutting concerns is one of such modularity anomalies that possibly exert negative effects on software maintainability. However, to the date there is little or no knowledge about how characteristics of crosscutting concerns, observable in early artefacts, are correlated with maintainability. Objective: In this setting, this paper introduces an empirical analysis where the correlation between crosscutting properties and two ISO/IEC 9126 maintainability attributes, namely changeability and stability, is presented. Method: This correlation is based on the utilization of a set of concern metrics that allows the quantification of crosscutting, scattering and tangling. Results: Our study confirms that a change in a crosscutting concern is more difficult to be accomplished and that artefacts addressing crosscutting concerns are found to be less stable later as the system evolves. Moreover, our empirical analysis reveals that crosscutting properties introduce non-syntactic dependencies between software artefacts, thereby decreasing the quality of software in terms of changeability and stability as well. These subtle dependencies cannot be easily detected without the use of concern metrics. Conclusion: The correlation provides evidence that the presence of certain crosscutting properties negatively affects to changeability and stability. The whole analysis is performed using as target cases three software product lines, where maintainability properties are of upmost importance not only for individual products but also for the core architecture of the product line. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "On the relationship of concern metrics and requirements maintainability", "paper_id": "WOS:000298220400006"}