{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "intelligent_tutoring_system"}, {"score": 0.04571918918532089, "phrase": "resolution_paths"}, {"score": 0.03292456540668156, "phrase": "algebraic_way"}, {"score": 0.004717723626157272, "phrase": "arithmetical_and_algebraic_way"}, {"score": 0.004669845451682529, "phrase": "word_problems"}, {"score": 0.004606759374526927, "phrase": "interactive_learning_environments"}, {"score": 0.004529093447865156, "phrase": "word_problem"}, {"score": 0.003939487754302632, "phrase": "user's_actions"}, {"score": 0.003899476621346112, "phrase": "adequate_supervision"}, {"score": 0.00356924199356768, "phrase": "meta-cognitive_learning"}, {"score": 0.003520971639466546, "phrase": "appropriate_definition"}, {"score": 0.0028703075616629634, "phrase": "new_problems"}, {"score": 0.0027273213556458214, "phrase": "design_foundations"}, {"score": 0.002479150189700726, "phrase": "domain_specific_notation"}, {"score": 0.002420710733288495, "phrase": "current_state"}, {"score": 0.0023960878466674795, "phrase": "resolution_process"}, {"score": 0.0023158019935841235, "phrase": "adequate_way"}, {"score": 0.002222994077182071, "phrase": "extensive_experimental_evaluation"}, {"score": 0.0021484955960643167, "phrase": "learning_tool"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Intelligent tutoring systems", " Interactive learning environments", " Architectures for educational technology system", " Elementary education", " Secondary education"], "paper_abstract": "Designers of interactive learning environments with a focus on word problem solving usually have to compromise between the amount of resolution paths that a user is allowed to follow and the quality of the feedback provided. We have built an intelligent tutoring system (ITS) that is able to both track the user's actions and provide adequate supervision during the resolution. This is done without imposing any restriction on the resolution paths that are allowed. Instead, the system attempts to enforce meta-cognitive learning by requiring an appropriate definition of quantities before they are used. The program (a) supports both the arithmetical and algebraic way of solving problems; (b) allows the recurrence to one or more equations when solving a problem in an algebraic way; (c) determines the validity of the expressions when they are introduced; and (d) admits the incorporation of new problems without the need of being reprogrammed. In this paper, we explain the design foundations, which are mainly based on (a) a reflection of the steps that a student should follow to solve a problem in an algebraic way, and (b) the use of a domain specific notation to represent both the problem structure and the current state of the resolution process. In particular, hypergraphs are introduced as an adequate way to support tracking in both the arithmetical and algebraic case. Moreover, we offer an extensive experimental evaluation which highlights the potential of the ITS as a learning tool. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Fundamentals of the design and the operation of an intelligent tutoring system for the learning of the arithmetical and algebraic way of solving word problems", "paper_id": "WOS:000317369900012"}