{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "free-energy_simulation_estimates"}, {"score": 0.004761850836420121, "phrase": "protein_ligand_binding_affinities"}, {"score": 0.004606023493393774, "phrase": "large-scale_test"}, {"score": 0.004555217356295278, "phrase": "alchemical_perturbation_calculations"}, {"score": 0.0044800522651664695, "phrase": "bennett_acceptance-ratio"}, {"score": 0.004309434349688514, "phrase": "relative_affinities"}, {"score": 0.00370981613076245, "phrase": "studied_relative_affinities"}, {"score": 0.0033945024593626675, "phrase": "acceptable_errors"}, {"score": 0.0031405975280029913, "phrase": "nine_intermediate_states"}, {"score": 0.0030208364972341096, "phrase": "entire_protein"}, {"score": 0.0029380909574836587, "phrase": "periodic_boundary_conditions"}, {"score": 0.0028260302580927856, "phrase": "calculated_affinities"}, {"score": 0.0024054226746197706, "phrase": "target_protein"}, {"score": 0.0023394947463129642, "phrase": "poor_results"}, {"score": 0.002262756631083292, "phrase": "molecular-mechanics_force_field"}, {"score": 0.002164331818029166, "phrase": "reasonable_simulation_time"}], "paper_keywords": [""], "paper_abstract": "We have performed a large-scale test of alchemical perturbation calculations with the Bennett acceptance-ratio (BAR) approach to estimate relative affinities for the binding of 107 ligands to 10 different proteins. Employing 20-angstrom truncated spherical systems and only one intermediate state in the perturbations, we obtain an error of less than 4 kJ/mol for 54% of the studied relative affinities and a precision of 0.5 kJ/mol on average. However, only four of the proteins gave acceptable errors, correlations, and rankings. The results could be improved by using nine intermediate states in the simulations or including the entire protein in the simulations using periodic boundary conditions. However, 27 of the calculated affinities still gave errors of more than 4 kJ/mol, and for three of the proteins the results were not satisfactory. This shows that the performance of BAR calculations depends on the target protein and that several transformations gave poor results owing to limitations in the molecular-mechanics force field or the restricted sampling possible within a reasonable simulation time. Still, the BAR results are better than docking calculations for most of the proteins", "paper_title": "A Large-Scale Test of Free-Energy Simulation Estimates of Protein Ligand Binding Affinities", "paper_id": "WOS:000343849600016"}