{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "basic_issues"}, {"score": 0.004663716126870148, "phrase": "algorithmic_and_combinatorial_aspects"}, {"score": 0.0045332598718792515, "phrase": "theoretical_and_practical_points"}, {"score": 0.004437807397753662, "phrase": "highly_practical_points"}, {"score": 0.004133852714087407, "phrase": "repetitive_structure"}, {"score": 0.004061160863655662, "phrase": "higher_compression_rates"}, {"score": 0.003975609222669783, "phrase": "compression_techniques"}, {"score": 0.0038918527536981897, "phrase": "fast_algorithms"}, {"score": 0.003650984439966844, "phrase": "maximal_repetitions"}, {"score": 0.0033408932140621948, "phrase": "positioned_factors"}, {"score": 0.0031901665168365357, "phrase": "open_problems"}, {"score": 0.0030462191741660346, "phrase": "primitively-rooted_squares"}, {"score": 0.002992595374066178, "phrase": "length_n"}, {"score": 0.0026333078412549807, "phrase": "exact_bound"}, {"score": 0.0025869338215971536, "phrase": "almost_everything"}, {"score": 0.0025413743933379185, "phrase": "sturmian_words"}, {"score": 0.0023838876943453515, "phrase": "main_motivations"}, {"score": 0.0022924784914292026, "phrase": "new_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Repetitions", " Squares", " Cubes", " Runs", " Consecutive repeats", " Tandem repeats", " Compression", " Factorisation", " Algorithms"], "paper_abstract": "The article is an overview of basic issues related to repetitions in strings, concentrating on algorithmic and combinatorial aspects. This area is important both from theoretical and practical points of view. Repetitions are highly practical points periodic factors (substrings) in strings and are related to periodicities, regularities, and compression. The repetitive structure of strings leads to higher compression rates, and conversely, some compression techniques are at the core of fast algorithms for detecting repetitions. There are several types of repetitions in strings: squares, cubes, and maximal repetitions also called runs. For these repetitions, we distinguish between the factors (sometimes qualified as distinct) and their occurrences (also called positioned factors). The combinatorics of repetitions is a very intricate area, full of open problems. For example we know that the number of (distinct) primitively-rooted squares in a string of length n is no more than 2n - Theta(log n), conjecture to be n, and that their number of occurrences can be Theta(n log n). Similarly we know that there are at most 1.029 n and at least 0.944 n maximal repetitions and the conjecture is again that the exact bound is n. We know almost everything about the repetitions in Sturmian words, but despite the simplicity of these words, the results are nontrivial. One of the main motivations for writing this text is the development during the last couple of years of new techniques and results about repetitions. We report both the progress which has been achieved and which we expect to happen. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Repetitions in strings: Algorithms and combinatorics", "paper_id": "WOS:000271555200004"}