{"auto_keywords": [{"score": 0.04960106550769509, "phrase": "shortest_path_problem"}, {"score": 0.04505821306918688, "phrase": "weighted_graph_problems"}, {"score": 0.00481495049065317, "phrase": "numerical_optimization"}, {"score": 0.00473509474652851, "phrase": "dna_computing"}, {"score": 0.004548778268252678, "phrase": "initial_candidate_answers"}, {"score": 0.00447331713604276, "phrase": "polymerase_chain_reaction"}, {"score": 0.004384407114103125, "phrase": "main_idea"}, {"score": 0.004355163162038354, "phrase": "dna_computing_approaches"}, {"score": 0.0038737214010638745, "phrase": "vitro_computation"}, {"score": 0.0036107002958650344, "phrase": "weighted_graph_problem"}, {"score": 0.003503497128638099, "phrase": "hybrid_approach"}, {"score": 0.0030234900247386285, "phrase": "dna."}, {"score": 0.0027710786693798534, "phrase": "proportional_way"}, {"score": 0.002706821633267487, "phrase": "hybridization_control"}, {"score": 0.0024396547357855777, "phrase": "initial_pool_generation"}, {"score": 0.002407155340052809, "phrase": "polyacrylamide_gel_electrophoresis"}, {"score": 0.0023277839538663834, "phrase": "survived_dsdnas"}, {"score": 0.0022359775196858765, "phrase": "proposed_approach"}, {"score": 0.00222103160420506, "phrase": "significant_improvement"}, {"score": 0.0021477840826122853, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "proposed_ccdplb-dnac"}], "paper_keywords": [""], "paper_abstract": "DNA computing often makes use of hybridization, whether for vastly generating the initial candidate answers or amplification by using polymerase chain reaction (PCR). The main idea behind DNA computing approaches for solving weighted graph problems is that if the degree of hybridization can be controlled, then it is able to generate more double stranded DNAs (dsDNAs), which represent the answer of the problem during in vitro computation. Previously, length, concentration, and melting temperature, have been exploited for encoding of weights of a weighted graph problem. In this paper, we present a hybrid approach, which is called concentration-controlled direct-proportional length-based DNA computing (CCDPLB-DNAC), that combines two characteristics: length and concentration, for encoding and at the same time, effectively control the degree of hybridization of DNA. The encoding by length is realized whereby the cost of each path is encoded by the length of the oligonucleotides (oligos) in a proportional way. On the other hand, the hybridization control by concentration is done by varying the amount of oligos, as the input of computation, before the computation begins. The advantage is such that, after an initial pool generation and amplification, polyacrylamide gel electrophoresis (PAGE) can be performed to separate the survived dsDNAs according to their length, which directly decodes the results. The proposed approach shows significant improvement in term of materials used and scalability. The experimental results show the effectiveness of the proposed CCDPLB-DNAC for solving weighted graph problems, such as the shortest path problem.", "paper_title": "Hybrid concentration-controlled direct-proportional length-based DNA computing for numerical optimization of the shortest path problem", "paper_id": "WOS:000235807500018"}