{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "projective_automorphisms"}, {"score": 0.00419861271409079, "phrase": "algebraic_variety"}, {"score": 0.004160435626849478, "phrase": "arbitrary_dimension"}, {"score": 0.004103817210338686, "phrase": "field_extension"}, {"score": 0.003956558420993431, "phrase": "one-dimensional_case"}, {"score": 0.003561865840737996, "phrase": "first_time"}, {"score": 0.003465521267039616, "phrase": "higher_dimensional_ultraquadrics"}, {"score": 0.0031917943932454314, "phrase": "common_denominator"}, {"score": 0.0028731719610706214, "phrase": "polynomial_automorphisms"}, {"score": 0.0026220103561723045, "phrase": "segre_embedding"}, {"score": 0.002551022760887132, "phrase": "projective_space"}, {"score": 0.0024593458703463474, "phrase": "general_case"}, {"score": 0.0023927516438886445, "phrase": "toric_variety"}, {"score": 0.0021049977753042253, "phrase": "ruled_surfaces"}], "paper_keywords": ["Ultraquadrics", " Field automorphisms", " Rational parametrization", " Optimal reparameterization"], "paper_abstract": "The concept of ultraquadric has been introduced by the authors as a tool to algorithmically solve the problem of simplifying the coefficients of a given rational parametrization in of an algebraic variety of arbitrary dimension over a field extension . In this context, previous work in the one-dimensional case has shown the importance of mastering the geometry of 1-dimensional ultraquadrics (hypercircles). In this paper we study, for the first time, the properties of some higher dimensional ultraquadrics, namely, those associated to automorphisms in the field , defined by linear rational (with common denominator) or by polynomial (with inverse also polynomial) coordinates. We conclude, among many other observations, that ultraquadrics related to polynomial automorphisms can be characterized as varieties -isomorphic to linear varieties, while ultraquadrics arising from projective automorphisms are isomorphic to the Segre embedding of a blowup of the projective space along an ideal and, in some general case, linearly isomorphic to a toric variety. We conclude with some further details about the real-complex, 2-dimensional case, showing, for instance, that this family of ultraquadrics can be presented as a collection of ruled surfaces described by pairs of hypercircles.", "paper_title": "Ultraquadrics associated to affine and projective automorphisms", "paper_id": "WOS:000345397600003"}