{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_descendents"}, {"score": 0.009064052875096951, "phrase": "offspring_selection_mechanism"}, {"score": 0.0046781613377273774, "phrase": "crossover_operators"}, {"score": 0.00433200902751133, "phrase": "alternative_method"}, {"score": 0.004270003565426343, "phrase": "common_practice"}, {"score": 0.003696550794743764, "phrase": "increasing_interest"}, {"score": 0.0036261282565554507, "phrase": "crossover_scheme"}, {"score": 0.0035914198812657897, "phrase": "real-coded_genetic_algorithm_models"}, {"score": 0.0034392837410790293, "phrase": "reliable_and_accurate_solutions"}, {"score": 0.003262035294895737, "phrase": "extensive_empirical_study"}, {"score": 0.003215295260684715, "phrase": "main_factors"}, {"score": 0.0031238084716187805, "phrase": "real-parameter_crossover_operator"}, {"score": 0.0029062860108533374, "phrase": "blx-alpha"}, {"score": 0.0028235667474151714, "phrase": "pnx."}, {"score": 0.002467536552997677, "phrase": "important_finding"}, {"score": 0.0024088451312725924, "phrase": "real-coded_genetic_algorithms"}, {"score": 0.0022956075241520064, "phrase": "standard_real-coded_genetic_algorithms"}, {"score": 0.002198242191529977, "phrase": "higher_quality"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": [""], "paper_abstract": "Crossover operators with multiple descendents produce more than two offspring for each pair of parents. They were suggested as an alternative method to the common practice of generating only two offspring per couple. An offspring selection mechanism is responsible for choosing the two offspring that become the children contributed by the mating. Recently, there has been an increasing interest in incorporating this crossover scheme into real-coded genetic algorithm models because its operation was particularly suitable to attain reliable and accurate solutions for many continuous optimization problems. In this paper, we undertake an extensive empirical study of the main factors that affect the performance of real-parameter crossover operator with multiple descendents. To do this, we focus our attention on three well-known neighborhood-based real-parameter crossover operators, BLX-alpha, fuzzy recombination, and PNX. The experimental results obtained confirm that the generation of multiple descendents along with the offspring selection mechanism that chooses the two best offspring may enhance the operation of these three crossover operators. Another important finding from our experiments is that real-coded genetic algorithms with crossover operators with multiple descendents are more efficient than standard real-coded genetic algorithms, that is, they offer solutions with higher quality, requiring fewer fitness function evaluations. (c) 2008 Wiley Periodicals, Inc.", "paper_title": "Real-parameter crossover operators with multiple descendents: An experimental study", "paper_id": "WOS:000252618100008"}