{"auto_keywords": [{"score": 0.04500049499742902, "phrase": "analytical_method"}, {"score": 0.015719716506582538, "phrase": "analytical_methods"}, {"score": 0.015558967493238443, "phrase": "total_error_concept"}, {"score": 0.007851155387351205, "phrase": "routine_use"}, {"score": 0.004618893461411858, "phrase": "validation_phases"}, {"score": 0.00396218934254591, "phrase": "statistical_challenge"}, {"score": 0.003870541730075597, "phrase": "good_business_practices"}, {"score": 0.0037321585095070483, "phrase": "\"pre-study\"_validation"}, {"score": 0.0036648265911110164, "phrase": "appropriate_set"}, {"score": 0.0036458121607783004, "phrase": "designed_experiments"}, {"score": 0.0034162643819889054, "phrase": "qc_samples"}, {"score": 0.00339853518227171, "phrase": "routine_runs"}, {"score": 0.003268456693603525, "phrase": "total_error_approach"}, {"score": 0.0032011229656422596, "phrase": "sufficient_proportion"}, {"score": 0.0031845067058084583, "phrase": "analytical_results"}, {"score": 0.0029607085477485135, "phrase": "measurement_method"}, {"score": 0.0029376803941247084, "phrase": "pre-study_level"}, {"score": 0.002884640164372298, "phrase": "tolerance_interval"}, {"score": 0.00286966196130402, "phrase": "hypothetical_future_measurements"}, {"score": 0.002654075026802161, "phrase": "\"in-study\"_validation"}, {"score": 0.002592606058287124, "phrase": "s-n-lambda_rule"}, {"score": 0.0025657448560008293, "phrase": "fda."}, {"score": 0.00253916011199984, "phrase": "respective_advantages"}, {"score": 0.002473895542219933, "phrase": "crucial_point"}, {"score": 0.0024103044278902916, "phrase": "pre-study_stage"}, {"score": 0.0021605514226546497, "phrase": "compatible_validation_parameters"}, {"score": 0.0021381565332182773, "phrase": "in-study_levels"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "In industries that involve either chemistry or biology, analytical methods are necessary to keep an eye on all the material produced. If the quality of an analytical method is doubtful, then the whole set of decisions based on those measures is questionable. For this reason, being able to assess the quality of an analytical method is far more than a statistical challenge; it is a matter of ethics and good business practices. The validity of an analytical method must be assessed at two levels. The \"pre-study\" validation aims to show, by an appropriate set of designed experiments, that the method is able to achieve its objectives. The \"in-study\" validation is intended to verify, by inserting QC samples in routine runs, that the method remains valid over time. At these two levels, the total error approach considers a method as valid if a sufficient proportion of analytical results are expected to lie in a given interval around the (unknown) nominal value. This paper discusses two methods, based on this total error concept, of checking the validity of a measurement method at the pre-study level. The first checks whether a tolerance interval for hypothetical future measurements lies within given acceptance limits; the second calculates the probability of a result lying within these limits and computes, whether it is greater than a given acceptance level. For the \"in-study\" validation, the paper assesses the properties of the s-n-lambda rule recommended by the FDA. The properties and respective advantages and limitations of these methods are investigated. A crucial point is to ensure that the decisions taken at the pre-study stage and in routine use are coherent. More precisely, a laboratory should not see its method rejected in routine use when it has been proved to be valid and remains so. This paper shows how this goal may be achieved by choosing compatible validation parameters at both pre- and in-study levels. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Risk management for analytical methods based on the total error concept: Conciliating the objectives of the pre-study and in-study validation phases", "paper_id": "WOS:000246335300009"}