{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "linguistic_values"}, {"score": 0.04970198387475842, "phrase": "qualitative_characteristics"}, {"score": 0.004276390289178831, "phrase": "bilateral_exchange_model"}, {"score": 0.0042426974826585695, "phrase": "decision_makers"}, {"score": 0.00395111389294443, "phrase": "common_language"}, {"score": 0.003664963414801933, "phrase": "exchange_process"}, {"score": 0.0027559226203857316, "phrase": "direct_consequence"}, {"score": 0.0023613726075968986, "phrase": "real_values"}, {"score": 0.002324238863944163, "phrase": "normalized_interval"}, {"score": 0.002155656133617155, "phrase": "corresponding_linguistic_values"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Decision analysis", " Subjective perception", " Shared language", " Linguistic variable", " Triangular fuzzy number", " Information transmission"], "paper_abstract": "You can't always get what you want but (with a bit of luck) you may get what you expect. We study a bilateral exchange model where decision makers (DMs) perceive subjectively the characteristics of the products they initially own. They use a common language to communicate with each other while four requirements are imposed to prevent them from purposely trying to manipulate the exchange process. We illustrate how, even if these requirements are satisfied, the product that each DM receives from the exchange is possibly quite different from the one (or ones) that each had envisioned based on the reports provided by the other DM. In particular, the products received may deliver a utility higher or lower than that of the product originally owned by each DM which may be a direct consequence of the DMs using linguistic values to describe the qualitative characteristics of their products. However, we show that DMs may agree to exchange and turn out to be worse off even when they are asked to express their qualitative evaluations using real values belonging to a normalized interval. Paradoxically enough, we will argue that quantifying the linguistic values of qualitative characteristics creates more misunderstanding than using the corresponding linguistic values. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A bilateral exchange model: The paradox of quantifying the linguistic values of qualitative characteristics", "paper_id": "WOS:000347363500014"}