{"auto_keywords": [{"score": 0.0494208158242398, "phrase": "replica_node_attacks"}, {"score": 0.04898689815940368, "phrase": "group_deployment_knowledge"}, {"score": 0.04855659570735456, "phrase": "wireless_sensor_networks"}, {"score": 0.004815315858763141, "phrase": "distributed"}, {"score": 0.004309968592440261, "phrase": "vulnerable_nodes"}, {"score": 0.003468796799802612, "phrase": "large_number"}, {"score": 0.0031625006830124512, "phrase": "single_node"}, {"score": 0.003118942369691329, "phrase": "widespread_effects"}, {"score": 0.002936997013291548, "phrase": "distributed_detection_schemes"}, {"score": 0.0025212722607043546, "phrase": "proposed_schemes"}, {"score": 0.002498053212249228, "phrase": "replica_detection"}, {"score": 0.0023198180380964305, "phrase": "effective_and_robust_replica_detection_capability"}, {"score": 0.0021945194903838132, "phrase": "prior_work"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Replica node detection", " Security in wireless sensor networks"], "paper_abstract": "Several protocols have been proposed to mitigate the threat against wireless sensor networks due to an attacker finding vulnerable nodes, compromising them, and using these nodes to eavesdrop or undermine the operation of the network. A more dangerous threat that has received less attention, however, is that of replica node attacks, in which the attacker compromises a node, extracts its keying materials, and produces a large number of replicas to be spread throughout the network. Such attack enables the attacker to leverage the compromise of a single node to create widespread effects on the network. To defend against these attacks, we propose distributed detection schemes to identify and revoke replicas. Our schemes are based on the assumption that nodes are deployed in groups, which is realistic for many deployment scenarios. By taking advantage of group deployment knowledge, the proposed schemes perform replica detection in a distributed, efficient, and secure manner. Through analysis and simulation experiments, we show that our schemes achieve effective and robust replica detection capability with substantially lower communication, computational, and storage overheads than prior work in the literature. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Distributed detection of replica node attacks with group deployment knowledge in wireless sensor networks", "paper_id": "WOS:000268919600005"}