{"auto_keywords": [{"score": 0.04940203756018457, "phrase": "citation_practices"}, {"score": 0.013809513883143732, "phrase": "fractional_case"}, {"score": 0.010612387000973441, "phrase": "citation_inequality"}, {"score": 0.0042962651834233265, "phrase": "crespo"}, {"score": 0.004266056549665893, "phrase": "li"}, {"score": 0.0037387746981660717, "phrase": "crespo_et_al"}, {"score": 0.003607834976869384, "phrase": "main_results"}, {"score": 0.003493900927782043, "phrase": "classification_system"}, {"score": 0.0032418062548293745, "phrase": "field_level"}, {"score": 0.0031845067058084613, "phrase": "subfield_level"}, {"score": 0.003083899825125453, "phrase": "exchange_rates"}, {"score": 0.002912803994461996, "phrase": "equivalent_counts"}, {"score": 0.002881793492919646, "phrase": "all-sciences_case"}, {"score": 0.002454258761940649, "phrase": "raw_data"}, {"score": 0.0024022553322977165, "phrase": "subfield_mean_citations"}, {"score": 0.0023766673143502384, "phrase": "normalization_factors"}, {"score": 0.0022287497627555895, "phrase": "overall_citation_inequality"}, {"score": 0.0021049977753042253, "phrase": "multiplicative_approach"}], "paper_keywords": [""], "paper_abstract": "This article studies the impact of differences in citation practices at the subfield, or Web of Science subject category level, using the model introduced in Crespo, Li, and Ruiz-Castillo (2013a), according to which the number of citations received by an article depends on its underlying scientific influence and the field to which it belongs. We use the same Thomson Reuters data set of about 4.4 million articles used in Crespo et al. (2013a) to analyze 22 broad fields. The main results are the following: First, when the classification system goes from 22 fields to 219 subfields the effect on citation inequality of differences in citation practices increases from similar to 14% at the field level to 18% at the subfield level. Second, we estimate a set of exchange rates (ERs) over a wide [660, 978] citation quantile interval to express the citation counts of articles into the equivalent counts in the all-sciences case. In the fractional case, for example, we find that in 187 of 219 subfields the ERs are reliable in the sense that the coefficient of variation is smaller than or equal to 0.10. Third, in the fractional case the normalization of the raw data using the ERs (or subfield mean citations) as normalization factors reduces the importance of the differences in citation practices from 18% to 3.8% (3.4%) of overall citation inequality. Fourth, the results in the fractional case are essentially replicated when we adopt a multiplicative approach.", "paper_title": "The Effect on Citation Inequality of Differences in Citation Practices at the Web of Science Subject Category Level", "paper_id": "WOS:000335583900012"}