{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "complex_schema_matching"}, {"score": 0.004712726613162057, "phrase": "matching_problem"}, {"score": 0.004490552331642995, "phrase": "semantic_relationships"}, {"score": 0.0044426140044122545, "phrase": "schema_elements"}, {"score": 0.004371660146981191, "phrase": "different_data_repositories"}, {"score": 0.004233119608341877, "phrase": "elaborated_graphic_tools"}, {"score": 0.003781772207256374, "phrase": "novel_evolutionary_approach"}, {"score": 0.0036227329311981195, "phrase": "complex_matches"}, {"score": 0.0035457302646174148, "phrase": "semantically_related_data_repositories"}, {"score": 0.003342280102112269, "phrase": "first_approach"}, {"score": 0.00323625520042892, "phrase": "complex_schema_matches"}, {"score": 0.0024868972942701582, "phrase": "experimental_evaluation"}, {"score": 0.0024339783012484032, "phrase": "synthetic_datasets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Genetic programming", " Complex schema matchings", " Entity-oriented strategy", " Value-oriented strategy"], "paper_abstract": "The schema matching problem can be defined as the task of finding semantic relationships between schema elements existing in different data repositories. Despite the existence of elaborated graphic tools for helping to find such matches, this task is usually manually done. In this paper, we propose a novel evolutionary approach to addressing the problem of automatically finding complex matches between schemas of semantically related data repositories. To the best of our knowledge, this is the first approach that is capable of discovering complex schema matches using only the data instances. Since we only exploit the data stored in the repositories for this task, we rely on matching strategies that are based on record deduplication (aka, entity-oriented strategy) and information retrieval (aka, value-oriented strategy) techniques to find complex schema matches during the evolutionary process. To demonstrate the effectiveness of our approach, we conducted an experimental evaluation using real-world and synthetic datasets. The results show that our approach is able to find complex matches with high accuracy, similar to that obtained by more elaborated (hybrid) approaches, despite using only evidence based on the data instances. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "An evolutionary approach to complex schema matching", "paper_id": "WOS:000314331000003"}