{"auto_keywords": [{"score": 0.015719716506582538, "phrase": "eeg-based_vigilance_estimation"}, {"score": 0.011653889396688976, "phrase": "ordinary_elm"}, {"score": 0.008702854330457055, "phrase": "hidden_nodes"}, {"score": 0.00797169601260715, "phrase": "lars-en-elm"}, {"score": 0.004390517953424082, "phrase": "work_safety"}, {"score": 0.004210114198411514, "phrase": "vigilance_analysis"}, {"score": 0.004088302755402596, "phrase": "eeg"}, {"score": 0.003920209964956682, "phrase": "extreme_learning_machine"}, {"score": 0.003887461650548867, "phrase": "elm"}, {"score": 0.003619672388007568, "phrase": "system_performance"}, {"score": 0.0033844715014920233, "phrase": "experimental_results"}, {"score": 0.0031248767378106663, "phrase": "training_process"}, {"score": 0.003072807453368781, "phrase": "similar_or_better_vigilance_estimation_accuracy"}, {"score": 0.002921732652917206, "phrase": "experiment_results"}, {"score": 0.0024081389425728104, "phrase": "trop"}, {"score": 0.002158780936704905, "phrase": "better_vigilance_estimation_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Extreme learning machine", " L-2 norm penalty", " L-1 norm penalty", " EEG", " Vigilance estimation"], "paper_abstract": "For many human machine interaction systems, techniques for continuously estimating the vigilance of operators are highly desirable to ensure work safety. Up to now, various signals are studied for vigilance analysis. Among them, electroencephalogram (EEG) is the most commonly used signal. In this paper, extreme learning machine (ELM) and its modifications with L-1 norm and L-2 norm penalties are adopted for EEG-based vigilance estimation. A comparative study on system performance is conducted among ordinary ELM, its modifications, and support vector machines (SVMs). Experimental results show that, compared with SVMs, the ordinary ELM and its modifications can all dramatically speed up the training process while still achieving similar or better vigilance estimation accuracy. In addition, the following three observations have been made from the experiment results: (a) the ordinary ELM and the ELM with L-1 norm penalty (LARS-ELM) are sensitive on the number of hidden nodes; (b) the ELM with L-2 norm penalty (regularized-ELM) and the ELMs with both L-1 norm and L-2 norm penalties (LARS-EN-ELM, TROP-ELM) are stable and insensitive on the number of hidden nodes; and (c) regularized-ELM has a much faster training speed, while LARS-EN-ELM can achieve better vigilance estimation accuracy. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "EEG-based vigilance estimation using extreme learning machines", "paper_id": "WOS:000313761500015"}