{"auto_keywords": [{"score": 0.033547302924267074, "phrase": "blog_interfaces"}, {"score": 0.010233267899119278, "phrase": "causal_relationships"}, {"score": 0.008413442744761353, "phrase": "eight_factors"}, {"score": 0.004734448316824488, "phrase": "decision-_making_trial"}, {"score": 0.004327196832280818, "phrase": "good_user_interface"}, {"score": 0.004230956171850591, "phrase": "blogger's_decision"}, {"score": 0.004022137057452406, "phrase": "reader's_decision"}, {"score": 0.0036553070575015344, "phrase": "greater_understanding"}, {"score": 0.0035339597999254064, "phrase": "user_experience"}, {"score": 0.003266201217790818, "phrase": "critical_factors"}, {"score": 0.0028214413724451442, "phrase": "focus_group"}, {"score": 0.0024926348205500715, "phrase": "blog_interface_quality"}, {"score": 0.0024097920845706795, "phrase": "dematel_analysis"}, {"score": 0.0023694065215394593, "phrase": "key_causal_factors"}, {"score": 0.0023428586429492713, "phrase": "effect_factors"}, {"score": 0.0021896891011033105, "phrase": "impact-relations_map"}], "paper_keywords": ["blog", " Interface design", " quality", " DEMATEL"], "paper_abstract": "Many studies have shown the significance of a good user interface in affecting a blogger's decision to select a platform for their blog and a reader's decision to read one, and so it is vital that both developers and bloggers need a greater understanding of how they can improve user experience through perfecting their blog interfaces. The aim of this research is to explore the critical factors influencing the quality of blog interfaces and the causal relationships between these factors, enabling blog interfaces to be designed more effectively. Using an approach combining a focus group and the Decision-Making Trial and Evaluation Laboratory (DEMATEL), this study defined eight factors in four dimensions that influence blog interface quality. The results of the DEMATEL analysis identify the key causal factors and effect factors, as well as the causal relationships between the eight factors via the impact-relations map. The research also indicates the most critical causal factors that bloggers and developers should focus on, in order to most effectively improve the quality and attractiveness of blog interfaces.", "paper_title": "Exploring the Critical Factors Influencing the Quality of Blog Interfaces Using the Decision- Making Trial and Evaluation Laboratory ( DEMATEL) Method", "paper_id": "WOS:000331863600007"}