{"auto_keywords": [{"score": 0.01919728847026185, "phrase": "broken_tooth"}, {"score": 0.00481495049065317, "phrase": "dental_treatment"}, {"score": 0.004659108142668152, "phrase": "decision_making_system"}, {"score": 0.004591466267316524, "phrase": "fuzzy_inference_mechanism"}, {"score": 0.004524802862396203, "phrase": "mamdani"}, {"score": 0.0041445748748895365, "phrase": "research_work"}, {"score": 0.0038946650372062783, "phrase": "expert_system"}, {"score": 0.00385214804128572, "phrase": "fuzzy_logic"}, {"score": 0.0037684961730030235, "phrase": "inaccurate_and_vague_values"}, {"score": 0.0035802796531956413, "phrase": "knowledge_base"}, {"score": 0.0035153544006182834, "phrase": "mamdani_inference_algorithm"}, {"score": 0.0031497178007011666, "phrase": "dentists'_suggestions"}, {"score": 0.003115307756631991, "phrase": "chi-square_test"}, {"score": 0.0027505663559338825, "phrase": "chi-square_value"}, {"score": 0.0026419338604879404, "phrase": "critical_value"}, {"score": 0.0025190541346053405, "phrase": "null_hypothesis"}, {"score": 0.0023582694348219233, "phrase": "proposed_decision_support_system"}, {"score": 0.002290135975651888, "phrase": "confidence_level"}, {"score": 0.002191600750693037, "phrase": "simple_and_interactive_gui"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Fuzzy logic", " Clinical decision making", " Dental treatment", " Chi-square test"], "paper_abstract": "Background: In this research, a decision making system, based on fuzzy inference mechanism as proposed by Mamdani, is presented. Literature suggests that there is a lack of consistency among dentists in choosing treatment plan(s). So, this research work aims to facilitate the dentist decide the treatment plan(s) of the broken tooth. Methods: An expert system based on fuzzy logic has been designed to accept inaccurate and vague values of dental signs and symptoms associated with the broken tooth. We designed a knowledge base with 60 rules and used Mamdani inference algorithm to decide the possible one or more treatment(s) and suggest the same to the dentist. Results: The results proposed by the system are compared with the dentists' suggestions. The Chi-square test of homogeneity is conducted on 100 randomly generated sample cases with the help of three professional dentists. It is found that the results produced by the system are consistent with the treatment plan(s) proposed by the dentists. Chi-square value of the test is 3.843565 which is less than the critical value which is 12.592. Hence, we are unable to reject the null hypothesis that assumes the two populations are homogeneous with respect to treatments. Conclusions: The accuracy of the proposed decision support system for the treatment of broken tooth enhances the confidence level of the dentists while making decision regarding the treatment plan(s). Simple and interactive GUI makes it easy to use. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Clinical decision support system for dental treatment", "paper_id": "WOS:000327164400003"}