{"auto_keywords": [{"score": 0.028597397794520522, "phrase": "encryption_scheme"}, {"score": 0.00481495049065317, "phrase": "primitive_power_roots_of_unity"}, {"score": 0.004481132747216135, "phrase": "schmidt-samoa-takagi_encryption_scheme"}, {"score": 0.004023120753104693, "phrase": "decisional_composite_residuosity_assumption"}, {"score": 0.003611751858608048, "phrase": "new_algebraic_properties"}, {"score": 0.0030640804704319255, "phrase": "special_homomorphic_property"}, {"score": 0.0030171910207671205, "phrase": "\"pre-image_restriction"}, {"score": 0.002793260314529583, "phrase": "encrypted_message"}, {"score": 0.00266693888510356, "phrase": "primitive_power_roots"}, {"score": 0.002443671484766342, "phrase": "additively_homomorphic_property"}, {"score": 0.0021049977753042253, "phrase": "new_number_theoretic_assumptions"}], "paper_keywords": ["Paillier's encryption scheme", " factoring", " homomorphism", " power roots of unity"], "paper_abstract": "We first consider a variant of the Schmidt-Samoa-Takagi encryption scheme without losing additively homomorphic properties. We show that this variant is secure in the sense of IND-CPA under the decisional composite residuosity assumption, and of OW-CPA under the assumption on the hardness of factoring n = p(2)q. Second, we introduce new algebraic properties \"affine\" and \"pre-image restriction,\" which are closely related to homomorphicity. Intuitively, \"affine\" is a tuple of functions which have a special homomorphic property, and \"pre-image restriction\" is a function which can restrict the receiver to having information on the encrypted message. Then, we propose an encryption scheme with primitive power roots of unity in (Z/n(s+1))(X). We show that our scheme has, in addition to the additively homomorphic property, the above algebraic properties. In addition to the properties, we also show that the encryption scheme is secure in the sense of OW-CPA and IND-CPA under new number theoretic assumptions.", "paper_title": "Primitive Power Roots of Unity and Its Application to Encryption", "paper_id": "WOS:000269648400011"}