{"auto_keywords": [{"score": 0.04259530349179941, "phrase": "performance_characteristics"}, {"score": 0.009379178081400211, "phrase": "copula_function"}, {"score": 0.00481495049065317, "phrase": "wiener_processes"}, {"score": 0.004727837281331949, "phrase": "modern_highly_reliable_products"}, {"score": 0.004663533386096864, "phrase": "complex_structure"}, {"score": 0.004335000368745273, "phrase": "product's_performance_degradation"}, {"score": 0.0036441884295335502, "phrase": "joint_distribution_function"}, {"score": 0.003221111762383486, "phrase": "degradation_paths"}, {"score": 0.003091262582401731, "phrase": "wiener_process"}, {"score": 0.0030491497463386924, "phrase": "time-scale_transformation"}, {"score": 0.002493333098814506, "phrase": "computational_viewpoint"}, {"score": 0.0024147474002390763, "phrase": "chain_monte_carlo_method"}, {"score": 0.0023173287402646577, "phrase": "maximum-likelihood_estimates"}, {"score": 0.0022238315004700607, "phrase": "efficient_manner"}, {"score": 0.0021537217025910356, "phrase": "proposed_model"}, {"score": 0.0021243539405631866, "phrase": "numerical_example"}, {"score": 0.0021049977753042253, "phrase": "fatigue_cracks"}], "paper_keywords": ["bivariate degradation", " performance characteristic", " Wiener process", " Bayesian MCMC method", " copula function"], "paper_abstract": "Modern highly reliable products usually have complex structure and many functions. This means that they may have two or more performance characteristics. All the performance characteristics can reflect the product's performance degradation over time, and they may be independent or dependent. If the performance characteristics are independent, they can be modelled separately. But if they are not independent, it is very important to find the joint distribution function of the performance characteristics for estimating the reliability of the product as accurately as possible. Here, we suppose that a product has two performance characteristics and the degradation paths of these two performance characteristics can be governed by a Wiener process with a time-scale transformation, and that the dependency of the performance characteristics can be described by a copula function. The parameters of the two performance characteristics and the copula function can be estimated jointly. The model in such a situation is very complicated and analytically intractable and becomes cumbersome from a computational viewpoint. For this reason, the Bayesian Markov chain Monte Carlo method is developed for this problem that allows the maximum-likelihood estimates of the parameters to be determined in an efficient manner. For an illustration of the proposed model, a numerical example about fatigue cracks is presented.", "paper_title": "Bivariate degradation analysis of products based on Wiener processes and copulas", "paper_id": "WOS:000321690600009"}