{"auto_keywords": [{"score": 0.025927112683123962, "phrase": "java"}, {"score": 0.00481495049065317, "phrase": "virtual_machine-based_embedded_systems"}, {"score": 0.004705206179790976, "phrase": "new_way"}, {"score": 0.004615656893404919, "phrase": "embedded_virtual_machine"}, {"score": 0.004580314008293946, "phrase": "operating_systems"}, {"score": 0.00442457549952546, "phrase": "restrained_embedded_devices"}, {"score": 0.004340343873304156, "phrase": "read-only_memory"}, {"score": 0.0039729853486821995, "phrase": "current_romization_solutions"}, {"score": 0.0038973170902076707, "phrase": "complete_deployment"}, {"score": 0.0037937873032347, "phrase": "execution_device"}, {"score": 0.003692997523960715, "phrase": "system_components"}, {"score": 0.00334144503360907, "phrase": "good_part"}, {"score": 0.003240139593712436, "phrase": "target_device"}, {"score": 0.003166174817955658, "phrase": "longer_startup_times"}, {"score": 0.002842655426951218, "phrase": "virtual_execution_environment"}, {"score": 0.0025817653186901175, "phrase": "deployed_state"}, {"score": 0.0022911901892022847, "phrase": "evaluated_set"}, {"score": 0.002273605493468005, "phrase": "embedded_applications"}, {"score": 0.002213112756450354, "phrase": "embedded_systems"}, {"score": 0.0021961259795489833, "phrase": "memory_footprint"}], "paper_keywords": ["Design", " Performance", " Embedded operating systems", " Java", " deployment", " software analysis", " program customization"], "paper_abstract": "This article presents a new way to deploy and customize embedded virtual machine based operating systems for very restrained devices. Due to the specificity of restrained embedded devices (large usage of read-only memory, very few writable memory available, ... ), these systems are typically deployed off-board, in a process called romization. However, current romization solutions do not allow a complete deployment to take place outside of the execution device: they are capable of converting system components and applications into their executable form, but are unable to perform any operation that would require the system to be running. This results in a good part of the deployment being performed by the target device, at the cost of longer startup times, bloat with code and data that are only executed once at startup, and suboptimal memory placement of data structures. In this article, we propose a new romization scheme that allows the system to be started within a virtual execution environment, and thus to be fully deployed off-board before being transferred to its real execution support. We then take advantage of all the information provided by the deployed state in order to analyze and customize it, resulting in a very low-footprint, custom-tailored embedded system. The Java platform is used as a support to implement our romization architecture and perform our experiments. For the evaluated set of embedded applications, we were able to obtain embedded systems which memory footprint was lower than their J2ME counterpart, while being based on a full-fledged J2SE environment.", "paper_title": "Efficient Off-Board Deployment and Customization of Virtual Machine-Based Embedded Systems", "paper_id": "WOS:000275540000007"}