{"auto_keywords": [{"score": 0.049722360725641276, "phrase": "online_consumer_behavior"}, {"score": 0.03980335877573019, "phrase": "nomological_network"}, {"score": 0.02913565443328337, "phrase": "truster's_intentions"}, {"score": 0.00481495049065317, "phrase": "consumer_ambivalence"}, {"score": 0.004569414098372132, "phrase": "online_truster-trustee_relationships"}, {"score": 0.004224286804379592, "phrase": "merely_opposite_ends"}, {"score": 0.00366443843576107, "phrase": "online_behavior_literature"}, {"score": 0.0034001358540125303, "phrase": "online_e-commerce_relationships"}, {"score": 0.003275197814021, "phrase": "high_attitudinal_values"}, {"score": 0.003107935254560724, "phrase": "empirical_study"}, {"score": 0.0030162086479223506, "phrase": "strong_empirical_validation"}, {"score": 0.0029053368919259985, "phrase": "situational_abnormalities"}, {"score": 0.002675516297446243, "phrase": "small_positive_effect"}, {"score": 0.0026357223464279983, "phrase": "user's_intentions"}, {"score": 0.002473079487488344, "phrase": "separate_constructs"}, {"score": 0.002185394402074883, "phrase": "future_opportunities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Trust", " Distrust", " Ambivalence", " Online behavior", " e-commerce", " Situational abnormality", " Situational normality", " Suspicion", " Systematic processing", " Discriminative encoding", " Heuristic-systematic dual-processing model (HSM)", " Least-effort principle", " Sufficiency principle"], "paper_abstract": "Trust and distrust are both considered to be crucial in online truster-trustee relationships. Although some research has proposed that trust and distrust are distinct, other research continues to hold that they are merely opposite ends of the same continuum. Given this debate, it is important to consider how distrust is distinguished from trust. To that end, this paper extends the nomological network of distrust and introduces two novel antecedents never introduced in online behavior literature: situational abnormalities and suspicion. For this nomological network, we also propose that trust and distrust coexist in online e-commerce relationships and can result in ambivalence when they both have high attitudinal values (represented in emotions, beliefs, or behaviors). Using an empirical study of online consumer behavior with 521 experienced online consumers, we found strong empirical validation for our newly proposed model. We provide evidence that suspicion and situational abnormalities are separate, important antecedents to distrust. We also examine the effect of ambivalence on the truster's intentions toward the website and find a small positive effect that increases the user's intentions toward the website. Finally, we empirically demonstrate the coexistence of trust and distrust as separate constructs and emphasize that distrust has a much larger impact on the truster's intentions than does trust. We conclude with implications for theory and practice, along with a discussion of the limitations of and future opportunities revealed by this study. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "When trust and distrust collide online: The engenderment and role of consumer ambivalence in online consumer behavior", "paper_id": "WOS:000340574200004"}