{"auto_keywords": [{"score": 0.047160207499589116, "phrase": "digital_contents"}, {"score": 0.006070704814796422, "phrase": "digital_watermark"}, {"score": 0.005869066562623974, "phrase": "digital_content"}, {"score": 0.00481495049065317, "phrase": "efficient_fair_content_exchange"}, {"score": 0.004768649568826951, "phrase": "robust_watermark_ownership."}, {"score": 0.004587835274176236, "phrase": "major_media"}, {"score": 0.004185289462328125, "phrase": "security_problems"}, {"score": 0.004085333687668526, "phrase": "mutual_authentication"}, {"score": 0.003637669525737665, "phrase": "major_problem"}, {"score": 0.00346589179059467, "phrase": "proposed_methods"}, {"score": 0.0034159525504642656, "phrase": "copyright_owner"}, {"score": 0.0030414140732789186, "phrase": "buyer-seller_watermarking_schemes"}, {"score": 0.0026687841359431105, "phrase": "watermarking_protocol"}, {"score": 0.0026175952455594277, "phrase": "desired_digital_content"}, {"score": 0.0023303871145705954, "phrase": "digital_content_exchange_function"}], "paper_keywords": ["Digital content exchange", " Digital watermark", " Fair exchange", " Mutual authentication"], "paper_abstract": "In recent years, the Internet is a major media to convey digital contents. Users can purchase or exchange the digital contents via the Internet. Due to the security problems of the Internet, mutual authentication between users must be ensured before exchanging digital contents. In addition, how to exchange the digital contents fairly via the Internet is another major problem since users may not be honest. In some proposed methods, a copyright owner can use the digital watermark to claim the ownership of her/his digital content by showing her/his personal digital watermark to other users. By using digital watermark, some buyer-seller watermarking schemes have been proposed to protect the ownership of digital content. In these schemes, if a buyer attempts to purchase digital contents, she/he can perform the watermarking protocol to obtain the desired digital content. However, when a user attempts to exchange her/his digital contents with the others, none of them can efficiently and fairly offer the digital content exchange function. In this paper, vie propose our fair content exchange scheme to solve all the above problems. By using our proposed scheme, users can efficiently exchange their digital contents securely and fairly.", "paper_title": "EFFICIENT FAIR CONTENT EXCHANGE WITH ROBUST WATERMARK OWNERSHIP", "paper_id": "WOS:000293817400005"}