{"auto_keywords": [{"score": 0.04876985276069079, "phrase": "obama_geothermal_field"}, {"score": 0.01227662575760156, "phrase": "previous_geochemical_studies"}, {"score": 0.00901596972798841, "phrase": "first_source"}, {"score": 0.008531563527389228, "phrase": "second_source"}, {"score": 0.00481495049065317, "phrase": "obama_hydrothermal-geothermal_system"}, {"score": 0.004761850836420121, "phrase": "southwestern_japan"}, {"score": 0.004504969093304219, "phrase": "kyushu_island"}, {"score": 0.004285594361623147, "phrase": "high-temperature_springs"}, {"score": 0.0038782499819752423, "phrase": "comprehensive_hydrothermal_model"}, {"score": 0.003608266640131664, "phrase": "obama_geothermal_system"}, {"score": 0.003123203316511694, "phrase": "eastern_boundary"}, {"score": 0.003004103583782076, "phrase": "west_unzen_high_temperature_body"}, {"score": 0.002921815042028607, "phrase": "unzen_fumarolic_field"}, {"score": 0.0022377394845878268, "phrase": "low_enthalpy"}, {"score": 0.0021049977753042253, "phrase": "geothermal_fluids"}], "paper_keywords": ["Numerical model", " Obama geothermal field", " Heat source", " Japan"], "paper_abstract": "The Obama geothermal field is one of the most interesting geothermal areas in Kyushu Island, Southwestern Japan, because of its large number of high-temperature springs. A 3D numerical simulation study using the simulator TOUGH2 (module EOS3) was carried out to obtain a comprehensive hydrothermal model of the field. From previous geochemical studies, two main fluid sources were suggested for the Obama geothermal system: cold (sea, surface, and ground) water and deep geothermal fluids. We propose two heat sources, a lateral one at the eastern boundary of the system, near the West Unzen High Temperature Body located west of the Unzen fumarolic field, and a second one beneath the Obama geothermal field. The first source contributes the system by 150A degrees C fluids. The second source contributes by 100A degrees C fluids. Our model indicates that the first source has a temperature of 150A degrees C, which agrees with the results from previous geochemical studies. The low enthalpy of the second source could be explained by the mixing of geothermal fluids with seawater, as the area is near the seashore and is highly faulted. The model that was developed can explain many of the subsurface processes active in the Obama geothermal field.", "paper_title": "3D Numerical model of the Obama hydrothermal-geothermal system, Southwestern Japan", "paper_id": "WOS:000295166900009"}