{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "wireless_sensor_networks"}, {"score": 0.0479527492851673, "phrase": "sensor_nodes"}, {"score": 0.004664352260912174, "phrase": "self-organizing_networks"}, {"score": 0.004559661374976129, "phrase": "limited_resource"}, {"score": 0.004240116703465252, "phrase": "effective_node's_energy_management_methods"}, {"score": 0.003996983218174335, "phrase": "good_technical_solutions"}, {"score": 0.003942877273973905, "phrase": "clustering_technique"}, {"score": 0.003767738552860633, "phrase": "energy_consumption"}, {"score": 0.0035677736570659813, "phrase": "data_duplication"}, {"score": 0.0033175095965171674, "phrase": "cluster_rotation_mechanism"}, {"score": 0.0027407299369891502, "phrase": "irregular_energy_consumption_status"}, {"score": 0.00266693888510356, "phrase": "chs'_overhead_energy_usages"}, {"score": 0.0025716240685409513, "phrase": "wsn_networks"}, {"score": 0.002536763634539386, "phrase": "sensor_node"}, {"score": 0.002193013499219711, "phrase": "energy_balanced_ch_selection_mechanism"}, {"score": 0.0021436720821474973, "phrase": "sensor_node's_energy_consumption"}, {"score": 0.0021049977753042253, "phrase": "equal_and_stable_energy_management"}], "paper_keywords": [""], "paper_abstract": "Wireless sensor networks (WSNs) are self-organizing networks in which sensor nodes with limited resource are scattered in an area of interest to gather information. WSNs need to have effective node's energy management methods for stable and seamless communication. As one of a number of good technical solutions, a clustering technique has been issued and proposed among researchers for reducing energy consumption in WSNs. Also, it can prevent the problem of data duplication by the sensor nodes. Generally, to reduce WSNs' energy consumption as much, cluster heads (CHs) are selected dynamically based on cluster rotation mechanism. However, the CH that is already previously selected could not be selected again unless the round process is over even though the node has more energy than others. Following this fact, in WSNs, there is a kind of irregular energy consumption status among sensor nodes because of CHs' overhead energy usages. To solve this problem, in WSN networks, any sensor node should be a candidate to be CH without any exception even if the node is already chosen before. Therefore, in this paper, we will establish and propose an energy balanced CH selection mechanism and the distribution of sensor node's energy consumption in WSNs for equal and stable energy management.", "paper_title": "The Cluster-Heads Selection Method considering Energy Balancing for Wireless Sensor Networks", "paper_id": "WOS:000328055500001"}