{"auto_keywords": [{"score": 0.04757556213629672, "phrase": "lsi"}, {"score": 0.015719617792398985, "phrase": "latent_semantic_indexing"}, {"score": 0.013912163759600171, "phrase": "information_retrieval"}, {"score": 0.010379908275078642, "phrase": "vsm"}, {"score": 0.009180618306127701, "phrase": "topological_structure"}, {"score": 0.008843664787166009, "phrase": "experimental_results"}, {"score": 0.004738078275822989, "phrase": "topological_structure_analysis_using_q-analysis"}, {"score": 0.004301834610818624, "phrase": "polysemy_problems"}, {"score": 0.0033965836912510385, "phrase": "mathematical_structure"}, {"score": 0.0032536902910768957, "phrase": "term-document_matrix"}, {"score": 0.0032016639006812826, "phrase": "vector_space_model"}, {"score": 0.0030178961017306646, "phrase": "r.h._atkin"}, {"score": 0.002306543826130521, "phrase": "topological_analysis"}, {"score": 0.0022453451864218477, "phrase": "new_method"}, {"score": 0.0021975548867457606, "phrase": "semantic_information"}], "paper_keywords": [""], "paper_abstract": "The method of latent semantic indexing (LSI) is well-known for tackling the synonymy and polysemy problems in information retrieval; however, its performance can be very different for various datasets, and the questions of what characteristics of a dataset and why these characteristics contribute to this difference have not been fully understood. In this article, we propose that the mathematical structure of simplexes can be attached to a term-document matrix in the vector space model (VSM) for information retrieval. The Q-analysis devised by R.H. Atkin (1974) may then be applied to effect an analysis of the topological structure of the simplexes and their corresponding dataset. Experimental results of this analysis reveal that there is a correlation between the effectiveness of LSI and the topological structure of the dataset. By using the information obtained from the topological analysis, we develop a new method to explore the semantic information in a dataset. Experimental results show that our method can enhance the performance of VSM for datasets over which LSI is not effective.", "paper_title": "Understanding Latent Semantic Indexing: A Topological Structure Analysis Using Q-Analysis", "paper_id": "WOS:000274926000012"}