{"auto_keywords": [{"score": 0.04962396550254858, "phrase": "functional_roles"}, {"score": 0.015280405476861242, "phrase": "learning_performance"}, {"score": 0.01252629009992656, "phrase": "group_performance"}, {"score": 0.012060238274682172, "phrase": "group_members"}, {"score": 0.00481495049065317, "phrase": "learning_community"}, {"score": 0.004546755482549647, "phrase": "functional_role"}, {"score": 0.004355415885815204, "phrase": "computer-supported_collaborative_learning_environments"}, {"score": 0.003977403701783668, "phrase": "web-based_learning_group"}, {"score": 0.0037556843869894566, "phrase": "web_learning_system"}, {"score": 0.003580355398511932, "phrase": "large_corpus"}, {"score": 0.003222814590544802, "phrase": "best_intervention_strategy"}, {"score": 0.003176899769744057, "phrase": "group_learning"}, {"score": 0.002845883666777154, "phrase": "regression_prediction_strategy"}, {"score": 0.002739001004969201, "phrase": "identified_functional_roles"}, {"score": 0.0027129118211250336, "phrase": "experimental_results"}, {"score": 0.0022944576894161485, "phrase": "collaborative_learning"}, {"score": 0.0022188370388602813, "phrase": "functional_role-distribution"}, {"score": 0.0021049977753042253, "phrase": "group_members'_participation"}], "paper_keywords": ["collaborative learning", " functional role", " learning communities", " teaching", " learning strategies"], "paper_abstract": "Functional roles may explain the learning performance of groups. Detecting a functional role is critical for promoting group learning performance in computer-supported collaborative learning environments. However, it is not easy for teachers to identify the functional roles played by students in a web-based learning group, or the relationship between roles and group performance. In a web learning system, interactions among group members can be recorded as a large corpus for further analysis. Tools can then be developed to assist teachers to recognise the roles played by group members and determine the best intervention strategy to support group learning. This study designed a method to identify automatically the role played by students, through an analysis of their online collaborative learning interactions. A regression prediction strategy was proposed to predict group performance according to identified functional roles. Experimental results from a study of 82 students showed that the accuracy of detecting functional roles was acceptable, and the prediction of learning performance is useful for most functional roles except opinion-giver and harmoniser. Finally, three grouping strategies for collaborative learning are proposed from the perspective of functional role-distribution. Teachers can, therefore, recognise the status of group members' participation by identifying roles and reorganising the group to increase learning performance.", "paper_title": "Statistical model for predicting roles and effects in learning community", "paper_id": "WOS:000287026000009"}