{"auto_keywords": [{"score": 0.044815155566597174, "phrase": "different_categories"}, {"score": 0.042457032177558765, "phrase": "association_rule"}, {"score": 0.00481495049065317, "phrase": "ncrna-ncrna_patterns"}, {"score": 0.004764435715755502, "phrase": "bridging_rules"}, {"score": 0.004681413843223496, "phrase": "important_role"}, {"score": 0.004599831967997116, "phrase": "gene_expression"}, {"score": 0.0043481611772332495, "phrase": "complicated_relationships"}, {"score": 0.004153810449519519, "phrase": "ncrnas'_functions"}, {"score": 0.003804046908915231, "phrase": "ncrna's_function"}, {"score": 0.0035579889785989738, "phrase": "entropy_theory"}, {"score": 0.0030906010704382374, "phrase": "rnadb"}, {"score": 0.0029212625534156063, "phrase": "biological_significance"}, {"score": 0.002693919110230191, "phrase": "novel_cross-genomes_patterns"}, {"score": 0.002398208426903865, "phrase": "known_function"}, {"score": 0.0021049977753042253, "phrase": "ncrna_datasets"}], "paper_keywords": ["ncRNAs", " Bridging rules", " Entropy", " miRNA", " Joint entropy", " Mutual information"], "paper_abstract": "ncRNAs play an important role in the regulation of gene expression. However, many of their functions have not yet been fully discovered. There are complicated relationships between ncRNAs in different categories. Finding these relationships can contribute to identify ncRNAs' functions and properties. We extend the association rule to represent the relationship between two ncRNAs. Based on this rule, we can speculate the ncRNA's function when it interacts with other ncRNAs. We propose two measures to explore the relationships between ncRNAs in different categories. Entropy theory is to calculate how close two ncRNAs are. Association rule is to represent the interactions between ncRNAs. We use three datasets from miRBase and RNAdb. Two from miRBase are designed for finding relationships between miRNAs; the other from RNAdb is designed for relationships among miRNA, snoRNA and piRNA. We evaluate our measures from both biological significance and performance perspectives. All the cross-species patterns regarding miRNA that we found are proven correct using miRNAMap 2.0. In addition, we find novel cross-genomes patterns such as (hsa-mir-190b -> hsa-mir-153-2). According to the patterns we find, we can (1) explore one ncRNA's function from another with known function and (2) speculate the functions of both of them based on the relationship even we do no understand either of them. Our methods' merits also include: (1) they are suitable for any ncRNA datasets and (2) they are not sensitive to the parameters. (C) 2010 Elsevier Inc. All rights reserved.", "paper_title": "Exploring the ncRNA-ncRNA patterns based on bridging rules", "paper_id": "WOS:000280025300009"}