{"auto_keywords": [{"score": 0.036621596446778835, "phrase": "chain"}, {"score": 0.00481495049065317, "phrase": "patient_agents"}, {"score": 0.004522796947899013, "phrase": "general_framework"}, {"score": 0.004383406949799696, "phrase": "truthful_auctions"}, {"score": 0.0037480753312398754, "phrase": "multiple_buyers"}, {"score": 0.0033905067962602515, "phrase": "first_framework"}, {"score": 0.003306559295382181, "phrase": "truthful_dynamic_double_auction"}, {"score": 0.0028625406368744995, "phrase": "dynamic-auction_rules"}, {"score": 0.002688532127821979, "phrase": "allocative_efficiency"}, {"score": 0.002525074485615743, "phrase": "canonical_mcafee_double-auction_rule"}, {"score": 0.0024014759148123736, "phrase": "non-truthful_double_auctions"}, {"score": 0.0023566987138026285, "phrase": "\"zero-intelligence_plus\"-style_learning_agents"}, {"score": 0.0021450029487459403, "phrase": "arrival_intensity"}, {"score": 0.0021049977753042253, "phrase": "agent_valuations"}], "paper_keywords": [""], "paper_abstract": "In this paper we present and evaluate a general framework for the design of truthful auctions for matching agents in a dynamic, two-sided market. A single commodity, such as a resource or a task, is bought and sold by multiple buyers and sellers that arrive and depart over time. Our algorithm, Chain, provides the first framework that allows a truthful dynamic double auction (DA) to be constructed from a truthful, single-period (i.e. static) double-auction rule. The pricing and matching method of the Chain construction is unique amongst dynamic-auction rules that adopt the same building block. We examine experimentally the allocative efficiency of Chain when instantiated on various single-period rules, including the canonical McAfee double-auction rule. For a baseline we also consider non-truthful double auctions populated with \"zero-intelligence plus\"-style learning agents. Chain-based auctions perform well in comparison with other schemes, especially as arrival intensity falls and agent valuations become more volatile.", "paper_title": "Chain: A dynamic double auction framework for matching patient agents", "paper_id": "WOS:000250051500002"}