{"auto_keywords": [{"score": 0.04610372906407672, "phrase": "chromatogram_peaks"}, {"score": 0.015719716506582538, "phrase": "high-performance_liquid_chromatography"}, {"score": 0.015375002624952786, "phrase": "multi-target_intermittent_particle_swarm_optimization"}, {"score": 0.014069041620219824, "phrase": "separation_method"}, {"score": 0.013803751836455281, "phrase": "generalized_gaussian_reference_curve_measurement"}, {"score": 0.013716422713538321, "phrase": "ggrcm"}, {"score": 0.013372521787019961, "phrase": "mipso"}, {"score": 0.012750479133010983, "phrase": "reference_curve"}, {"score": 0.012549546784013868, "phrase": "chromatogram_peak"}, {"score": 0.010535560055371063, "phrase": "optimal_parameters"}, {"score": 0.009216093747337928, "phrase": "ggrcm-mipso_method"}, {"score": 0.0047842129415024475, "phrase": "diode_array_detector_separation"}, {"score": 0.00376230106601654, "phrase": "ggrcm_model"}, {"score": 0.0035513449460436177, "phrase": "hplc-dad_data"}, {"score": 0.00334144503360907, "phrase": "higher_the_possibility"}, {"score": 0.00276528909544761, "phrase": "simulation_data"}, {"score": 0.0026438102161263567, "phrase": "severe_overlap"}, {"score": 0.0026268961477241026, "phrase": "white_noise"}, {"score": 0.0025195550121331367, "phrase": "real_hplc-dad_data"}, {"score": 0.0024556852466581527, "phrase": "john_wiley"}, {"score": 0.0023029886389559122, "phrase": "intermittent_particle_swarm_optimization_algorithm"}, {"score": 0.0021876814398268775, "phrase": "generalized_gaussian_reference_curve_measurement_model"}, {"score": 0.0021049977753042253, "phrase": "multi-target_intermittent_particle_swarm_optimization_algorithm"}], "paper_keywords": ["HPLC-DAD data set separation", " generalized Gaussian reference curve measurement model", " multi-target intermittent particle swarm optimization"], "paper_abstract": "In order to separate a high-performance liquid chromatography with diode array detector (HPLC-DAD) data set to chromatogram peaks and spectra for all compounds, a separation method based on the model of generalized Gaussian reference curve measurement (GGRCM) and the algorithm of multi-target intermittent particle swarm optimization (MIPSO) is proposed in this paper. A parameter is constructed to generate a reference curve r() for a chromatogram peak based on its physical principle. The GGRCM model is proposed to calculate the fitness epsilon() for every , which indicates the possibility for the HPLC-DAD data set to contain a chromatogram peak similar to the r(). The smaller the fitness is, the higher the possibility. The algorithm of MIPSO is then introduced to calculate the optimal parameters by minimizing the fitness mentioned earlier. Finally, chromatogram peaks are constructed based on these optimal parameters, and the spectra are calculated by an estimator. Through the simulations and experiments, the following conclusions are drawn: (i) the GGRCM-MIPSO method can extract chromatogram peaks from simulation data set without knowing the number of the compounds in advance even when a severe overlap and white noise exist and (ii) the GGRCM-MIPSO method can be applied to the real HPLC-DAD data set. Copyright (c) 2014 John Wiley & Sons, Ltd. In this paper, a separation method based on generalized Gaussian reference curve measurement (GGRCM) model and multi-target intermittent particle swarm optimization algorithm is proposed. A parameter is constructed to generate a reference curve r(). The generalized Gaussian reference curve measurement model is proposed to calculate the fitness for every parameter . The multi-target intermittent particle swarm optimization algorithm is adopted to calculate the optimal parameter by minimizing the fitness mentioned earlier.", "paper_title": "Generalized Gaussian reference curve measurement model for high-performance liquid chromatography with diode array detector separation and its solution by multi-target intermittent particle swarm optimization", "paper_id": "WOS:000351534900002"}