{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "prefetching_techniques"}, {"score": 0.004424768776701965, "phrase": "interconnection_network"}, {"score": 0.004362870617347183, "phrase": "multiprocessor_chip"}, {"score": 0.004261617028111862, "phrase": "microarchitectural_effects"}, {"score": 0.0034984340449789745, "phrase": "open-source_simulator"}, {"score": 0.003229741076887151, "phrase": "prefetching_module"}, {"score": 0.003066945490483524, "phrase": "ruby_memory_system"}, {"score": 0.002778529097886437, "phrase": "network_effect"}, {"score": 0.002752513434446804, "phrase": "prefetching-related_studies"}, {"score": 0.0026633568650501873, "phrase": "accurate_results"}, {"score": 0.0025290375256888883, "phrase": "mistaken_conclusions"}, {"score": 0.0024014759148123736, "phrase": "detailed_analysis"}, {"score": 0.0022378101636842296, "phrase": "miss_rate"}, {"score": 0.002196077907454079, "phrase": "specific_network"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Prefetching", " Multicore", " Gem5", " Network-on-chip", " Simulation infrastructure", " Cache coherence protocol"], "paper_abstract": "This study focuses on the importance of quantifying the effect of prefetching on the interconnection network of a multiprocessor chip. This kind of microarchitectural effects are often quantified using simulators. However, if prefetching traffic in a CMP (Chip Multiprocessor) system is to be accurately evaluated, simulators should simulate not only the memory hierarchy module and the multicore system, but also the network-on-chip. Unfortunately, no open-source simulator is able to evaluate all these elements at the same time. This paper describes how to develop a prefetching module for the gem5 CMP simulator and how to integrate this into the Ruby memory system. Moreover, by using the infrastructure developed in this study, this paper shows the importance of taking the network effect in prefetching-related studies into account, in order for accurate results to be obtained: not doing so may lead to mistaken conclusions. For this purpose, we have carried out a detailed analysis of the behavior of three different prefetching engines, providing not only the typical statistics for instructions per cycle and the miss rate, but also specific network and prefetching statistics. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Network aware performance evaluation of prefetching techniques in CMPs", "paper_id": "WOS:000337999600001"}