{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "fuzzy_numbers"}, {"score": 0.007450142740987222, "phrase": "liou"}, {"score": 0.006432126182394504, "phrase": "integral_values"}, {"score": 0.005497669887442366, "phrase": "wang"}, {"score": 0.005378347093553914, "phrase": "fuzzy_number"}, {"score": 0.004541377162789232, "phrase": "last_few_decades"}, {"score": 0.004475436844227947, "phrase": "large_number"}, {"score": 0.003952082333580496, "phrase": "convex_combination"}, {"score": 0.003866268750750096, "phrase": "left_integral_values"}, {"score": 0.003646399625591736, "phrase": "wang's_approach"}, {"score": 0.0035578073720093197, "phrase": "ranking_approach"}, {"score": 0.0035153544006182834, "phrase": "normal_and_non-normal_fuzzy_numbers"}, {"score": 0.0029813748433158032, "phrase": "right_integral_value"}, {"score": 0.0027405092973494293, "phrase": "revised_ranking_approach"}, {"score": 0.002613056713968863, "phrase": "proposed_ranking_approach"}, {"score": 0.002455266773537278, "phrase": "median_value"}, {"score": 0.002265095354846931, "phrase": "market_segment_evaluation"}, {"score": 0.0021676351850669017, "phrase": "proposed_ranking_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Ranking fuzzy numbers", " Integral value", " Index of optimism"], "paper_abstract": "Ranking fuzzy numbers is a very important decision-making procedure in decision analysis and applications. The last few decades have seen a large number of approaches investigated for ranking fuzzy numbers, yet some of these approaches are non-intuitive and inconsistent. In 1992, Liou and Wang proposed an approach to rank fuzzy number based a convex combination of the right and the left integral values through an index of optimism. Despite its merits, some shortcomings associated with Liou and Wang's approach include: (i) it cannot differentiate normal and non-normal fuzzy numbers, (ii) it cannot rank effectively the fuzzy numbers that have a compensation of areas, (iii) when the left or right integral values of the fuzzy numbers are zero, the index of optimism has no effect in either the left integral value or the right integral value of the fuzzy number, and (iv) it cannot rank consistently the fuzzy numbers and their images. This paper proposes a revised ranking approach to overcome the shortcomings of Liou and Wang's ranking approach. The proposed ranking approach presents the novel left, right, and total integral values of the fuzzy numbers. The median value ranking approach is further applied to differentiate fuzzy numbers that have the compensation of areas. Finally, several comparative examples and an application for market segment evaluation are given herein to demonstrate the usages and advantages of the proposed ranking method for fuzzy numbers. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "An improved ranking method for fuzzy numbers with integral values", "paper_id": "WOS:000327529200025"}