{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-agent_plan"}, {"score": 0.0045284072672385975, "phrase": "new_information_gathering_techniques"}, {"score": 0.004491506786670695, "phrase": "artificial_intelligence_techniques"}, {"score": 0.004138575034269399, "phrase": "web_data"}, {"score": 0.003876226041373242, "phrase": "information_sources"}, {"score": 0.0036008372531664726, "phrase": "heterogeneous_sources"}, {"score": 0.003223883109446599, "phrase": "single_plan"}, {"score": 0.0031327496009959464, "phrase": "multi-agent_framework"}, {"score": 0.0028744731986533076, "phrase": "tourism_domain"}, {"score": 0.002573362191631126, "phrase": "travel_web_sources"}, {"score": 0.0024903420152789135, "phrase": "planning_agent"}, {"score": 0.002459902948098627, "phrase": "complete_travel_solutions"}, {"score": 0.0024398167078355224, "phrase": "experimental_results"}, {"score": 0.0022849068677290836, "phrase": "single_information_sources"}, {"score": 0.0021751997984619585, "phrase": "new_types"}, {"score": 0.0021049977753042253, "phrase": "heterogeneous_web_sources"}], "paper_keywords": ["information gathering", " multi-agent systems", " planning", " Web agents"], "paper_abstract": "The evolution of the Web has encouraged the development of new Information Gathering techniques. Artificial Intelligence techniques, such as Planning, have also been used for Information Gathering in order to go beyond merely retrieving Web data. Planning has been used traditionally to generate a sequence of actions that specify how information sources should be accessed. In this paper, planning is used mainly for integrating information found in heterogeneous sources. For instance, two different Web sources about flight and train travels, can be represented by two different planning operators, which will be subsequently combined and integrated by a single plan. We have found that a Multi-Agent framework is very appropriate to implement our technique. In order to evaluate our approach empirically, it has been applied to a tourism domain (MAPWEB-ETOURISM), whose purpose is to help a customer to plan his/her trips. In this domain, several specialized Web agents have been used to query travel Web sources, whose results are subsequently integrated by a planning agent to build complete travel solutions. Experimental results show that, by means of integration, more solutions can be found than by using single information sources or even travel meta-searchers. Also, (MAPWEB-ETOURISM) can find new types of solutions by integrating information gathered from heterogeneous Web sources (i.e. flights and trains).", "paper_title": "Multi-agent plan based information gathering", "paper_id": "WOS:000238739100004"}