{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "information_granules"}, {"score": 0.004716113134313215, "phrase": "fuzzy_sets"}, {"score": 0.004667454318370122, "phrase": "essential_knowledge"}, {"score": 0.004587464246981363, "phrase": "key_dependencies"}, {"score": 0.004266141613620429, "phrase": "fuzzy_clustering"}, {"score": 0.004092695445765521, "phrase": "fuzzy_partition_matrices"}, {"score": 0.003899199029692063, "phrase": "multifaceted_view"}, {"score": 0.0038323244983352587, "phrase": "different_partition_matrices"}, {"score": 0.0037665925842197967, "phrase": "higher-order_granular_knowledge"}, {"score": 0.0032121901685844803, "phrase": "resulting_constructs"}, {"score": 0.0031680109156103334, "phrase": "plain_data_thernselves"}, {"score": 0.0030708096989903945, "phrase": "partition_matrices"}, {"score": 0.0025735828740162223, "phrase": "individual_partition_matrices"}, {"score": 0.002392980687386204, "phrase": "unified_optimization_perspective"}, {"score": 0.002368233914089849, "phrase": "fuzzy_proximity_matrices"}, {"score": 0.002319503690965857, "phrase": "corresponding_partition_matrices"}, {"score": 0.0022020103573658035, "phrase": "proximity_matrices"}, {"score": 0.002164180792169302, "phrase": "detailed_algorithm"}, {"score": 0.0021049977753042253, "phrase": "numeric_experiments"}], "paper_keywords": ["networks of knowledge", " information granules", " consensus optimization", " learning", " fuzzy clustering"], "paper_abstract": "Information granules, such as e.g., fuzzy sets, capture essential knowledge about data and the key dependencies between them. Quite commonly, we may envision that information granules (fuzzy sets) have become a result of fuzzy clustering and therefore could be succinctly represented in the form of some fuzzy partition matrices. Interestingly, the same data set could be represented from various standpoints and this multifaceted view yields a collection of different partition matrices being reflective of the higher-order granular knowledge about the data: The levels of specificity of the clusters the data are organized into could be quite different-the larger the number of clusters, the more detailed insight into the structure of data becomes available. Given the granularity of the resulting constructs (rather than plain data thernselves), one could view a collection of partition matrices as a certain type of a network of knowledge. Considering a variety of sources of knowledge encountered across the network, we are interested in forming consensus between them. In a nutshell, this leads to the construction of certain fuzzy partition matrices which \"reconcile\" the knowledge captured by the individual partition matrices. Given that the granularity of the sources of knowledge under consideration could vary quite substantially, we develop a unified optimization perspective by introducing fuzzy proximity matrices that are induced by the corresponding partition matrices. In the sequel, the optimization is realized on a basis of these proximity matrices. We offer a detailed algorithm and illustrate its performance using a series of numeric experiments. (c) 2006 Elsevier Ltd. All rights reserved.", "paper_title": "Forming consensus in the networks of knowledge", "paper_id": "WOS:000247826200011"}