{"auto_keywords": [{"score": 0.049450454172374286, "phrase": "media_access_control_layer"}, {"score": 0.028000794185067245, "phrase": "backoff_values"}, {"score": 0.00481495049065317, "phrase": "cluster-based_countermeasure"}, {"score": 0.004506968388996092, "phrase": "ad_hoc_networks"}, {"score": 0.004218602458288531, "phrase": "dynamic_topology"}, {"score": 0.0041357305373417455, "phrase": "shared_wireless_medium"}, {"score": 0.004054479957160662, "phrase": "resource-constrained_environment"}, {"score": 0.003459191419478298, "phrase": "new_way"}, {"score": 0.003091036449708673, "phrase": "clustering_algorithm"}, {"score": 0.003010250522930773, "phrase": "powerful_analytic_hierarchy_process_methodology"}, {"score": 0.002279217896185919, "phrase": "media_access_control_layer_misbehavior_detection_mechanism"}], "paper_keywords": ["MAC", " ad hoc network", " AHP", " clusterhead", " backoff"], "paper_abstract": "The characteristics of ad hoc networks, such as the absence of infrastructure, a dynamic topology, a shared wireless medium and a resource-constrained environment pose various security challenges. Most previous studies focused on the detection of misbehavior after it had occurred. However, in this paper we propose a new way of thinking to evade the occurrence of misbehavior. In our scheme, we firstly present a clustering algorithm that employs a powerful analytic hierarchy process methodology to elect a clusterhead for each cluster. The clusterhead in each cluster is then allowed to assign the backoff values to its members, i.e., originators, rather than permitting the originators to choose the backoff values by themselves. Through this media access control layer misbehavior detection mechanism, the misuse of the backoff in the media access control layer in the 802.11 distributed coordination function can be detected.", "paper_title": "A Cluster-based Countermeasure against Media Access Control Layer Attacks in IEEE 802.11 Ad Hoc Networks", "paper_id": "WOS:000310978600005"}