{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "context_inconsistency"}, {"score": 0.027877393254354243, "phrase": "pervasive_computing_environments"}, {"score": 0.009478522058952738, "phrase": "dcci"}, {"score": 0.00440976345264104, "phrase": "limited_processing_capabilities"}, {"score": 0.004358368398332723, "phrase": "imperfect_measurement_techniques"}, {"score": 0.0038309141193444015, "phrase": "central_control"}, {"score": 0.0032505921489759224, "phrase": "centralized_node"}, {"score": 0.00304737045343781, "phrase": "dcci-a"}, {"score": 0.002994178996584381, "phrase": "decentralized_checking"}, {"score": 0.0024236964502593254, "phrase": "preference-based_shortcut_structure"}, {"score": 0.0023124457559811087, "phrase": "shortcut_structure"}, {"score": 0.0022854384756395116, "phrase": "extensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "node_churns"}], "paper_keywords": ["Context awareness", " Context inconsistency", " Pervasive computing"], "paper_abstract": "Contexts are often inconsistent in pervasive computing environments, owing to many heterogeneous devices with limited processing capabilities, imperfect measurement techniques, and user movement. A variety of schemes have been proposed to check context inconsistency. However, they implicitly require central control. This requirement inhibits their effectiveness in some pervasive computing environments (e.g., transport systems) where all nodes are resource-constrained and cannot act as a centralized node. To this end, we propose in this paper DCCI-a scheme of Decentralized Checking of Context Inconsistency in pervasive computing environments. DCCI exploits a simple, yet efficient, preference-based locality that denotes nodes requiring that the same context can check the inconsistency on this type of contexts. According to this locality, DCCI constructs a preference-based shortcut structure such that it checks context inconsistency within the shortcut structure. Extensive experiments show that DCCI can accurately and efficiently check context inconsistency in the presence of node churns and heterogeneity.", "paper_title": "Decentralized checking of context inconsistency in pervasive computing environments", "paper_id": "WOS:000317662700002"}