{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "engineering_design_communication"}, {"score": 0.04489082319832532, "phrase": "engineering_work"}, {"score": 0.034955040547302, "phrase": "previous_work"}, {"score": 0.034510927288868586, "phrase": "social_media_framework"}, {"score": 0.004751889650408546, "phrase": "custom-built_social_media_tool_-_part_book"}, {"score": 0.004201571673071299, "phrase": "significant_portion"}, {"score": 0.00395069818358908, "phrase": "formal_documentation"}, {"score": 0.003007389443770562, "phrase": "custom-built_social_media_tool_hereto"}, {"score": 0.0028526276660691525, "phrase": "race_car_design_project"}, {"score": 0.002339771435910601, "phrase": "user_activity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Engineering design communication", " Social media", " Formula student", " Social network analysis", " Knowledge sharing"], "paper_abstract": "Engineering Design Communication is the main tributary for the sharing of information, knowledge & insights, and is fundamental to engineering work. Engineers spend a significant portion of their day communicating as they 'fill in the gaps' left by formal documentation and processes. Therefore, it comes as no surprise that there is much extant literature on this subject. The majority has been descriptive with little prescriptive research involving the introduction of either a tool or process. To begin to address this, previous work reports a Social Media framework to support Engineering Design Communication and this paper builds upon this previous work through the instantiation of the framework within a custom-built Social Media tool hereto referred to as PartBook. This has been prescribed within an eleven week race car design project. The study addresses the validation of the requirements that underpin the Social Media framework as well as investigating the impact the tool has/may have on engineering work, engineering artefacts and engineering project management. In order to do so, data has been captured through user activity, system usability, questionnaire, semi-structured interview and informal feedback. (C) 2015 The Authors. Published by Elsevier Ltd.", "paper_title": "Supporting engineering design communication using a custom-built social media tool - Part Book", "paper_id": "WOS:000361253200021"}