{"auto_keywords": [{"score": 0.04955461236891121, "phrase": "peer-to-peer_virtual_communities"}, {"score": 0.04140693296811696, "phrase": "simitrust"}, {"score": 0.00481495049065317, "phrase": "global_trust_model"}, {"score": 0.004058951880810154, "phrase": "prior_knowledge"}, {"score": 0.003992385826251404, "phrase": "other's_reputation"}, {"score": 0.003675517796014622, "phrase": "unique_global_trust_value"}, {"score": 0.0035755653799043, "phrase": "similarity-weighted_recommendations"}, {"score": 0.0029641011108505785, "phrase": "previous_global-trust_based_schemes"}, {"score": 0.002851790448644913, "phrase": "pre-trusted_peers"}, {"score": 0.00280496585980086, "phrase": "algorithm_convergence"}, {"score": 0.002669042572650594, "phrase": "high_trust_value"}, {"score": 0.0026107601878587816, "phrase": "honest_recommendation"}, {"score": 0.0025820967615278073, "phrase": "theoretical_analyses"}, {"score": 0.00240328454980006, "phrase": "malicious_peers"}, {"score": 0.002163930783583212, "phrase": "inauthentic_files"}, {"score": 0.0021049977753042253, "phrase": "previous_schemes"}], "paper_keywords": [""], "paper_abstract": "Peer-to-peer virtual communities are often established dynamically with peers that are unrelated and unknown to each other. Peers have to manage the risk involved with the transactions without prior knowledge about each other's reputation. SimiTrust, a reputation management scheme, is proposed for P2P virtual communities. A unique global trust value, computed by aggregating similarity-weighted recommendations of the peers who have interacted with him and reflecting the degree that the community as a whole trusts a peer, is assigned to each peer in the community. Different from previous global-trust based schemes, SimiTrust does not need any pre-trusted peers to ensure algorithm convergence and invalidates the assumption that the peers with high trust value will give the honest recommendation. Theoretical analyses and experiments show that the scheme is still robust under more general conditions where malicious peers cooperate in an attempt to deliberately subvert the system, converges more quickly and decreases the number of inauthentic files downloaded more effectively than previous schemes.", "paper_title": "A reputation management scheme based on global trust model for peer-to-peer virtual communities", "paper_id": "WOS:000239658700018"}