{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "optimal_anonymity"}, {"score": 0.015464885555400265, "phrase": "standard_model"}, {"score": 0.004684157900507474, "phrase": "transferable_conditional_electronic-cash"}, {"score": 0.004195418010131832, "phrase": "later_payment_transaction"}, {"score": 0.004126623209579942, "phrase": "third_person"}, {"score": 0.003778253716938922, "phrase": "transferable_conditional_e-cash"}, {"score": 0.0032916702592724217, "phrase": "conditional_e-cash"}, {"score": 0.0031150035760241705, "phrase": "transferable_conditional_e-cash_scheme"}, {"score": 0.002883439044844259, "phrase": "transferable_e-cash"}, {"score": 0.00280496585980086, "phrase": "groth-sahai_proofs_systems"}, {"score": 0.002539689093411356, "phrase": "extended_security_model"}, {"score": 0.0022741894748181243, "phrase": "new_scheme's_security"}, {"score": 0.002175913488493802, "phrase": "existing_transferable_conditional_e-cash"}, {"score": 0.0021049977753042253, "phrase": "new_scheme"}], "paper_keywords": [""], "paper_abstract": "Transferable conditional electronic-cash (e-cash) allows the recipient of a coin in a transaction to transfer it in a later payment transaction to the third person based on the outcome not known in advance. Anonymity is a very important property for a transferable conditional e-cash. However, none of the existed transferable conditional e-cash achieve the optimal anonymity because of its special structure, that is, introducing transferability in the conditional e-cash. In this study, they novelly present a transferable conditional e-cash scheme using a totally different structure, that is, adding condition into the transferable e-cash. Thanks to employing Groth-Sahai proofs systems and commuting signatures, the new transferable conditional e-cash satisfies optimal anonymity. Accordingly, they present an extended security model by introducing a publisher who is responsible for publishing two outcomes of a condition. Then, they prove the new scheme's security in the standard model. Compared with the existing transferable conditional e-cash, the efficiency of the new scheme is also improved since the size of the computation and communication is constant.", "paper_title": "Transferable conditional e-cash with optimal anonymity in the standard model", "paper_id": "WOS:000346251500007"}