{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "border_noise"}, {"score": 0.009710828736954658, "phrase": "projection_methods"}, {"score": 0.004703878334423852, "phrase": "projection-based_page_segmentation_methods"}, {"score": 0.004468415400599571, "phrase": "bitonal_document_images"}, {"score": 0.004426882270402403, "phrase": "different_tasks"}, {"score": 0.00436530211426514, "phrase": "page_segmentation"}, {"score": 0.003994624397219346, "phrase": "document_images"}, {"score": 0.0038661089070527424, "phrase": "page_border"}, {"score": 0.0034398445347109396, "phrase": "widespread_use"}, {"score": 0.0031036643805367487, "phrase": "existing_border_noise_removal_algorithms"}, {"score": 0.0029206231857112305, "phrase": "competitive_performance"}, {"score": 0.002735522834514124, "phrase": "docstrum"}, {"score": 0.0027100722480127458, "phrase": "voronoi"}, {"score": 0.002550165781755603, "phrase": "extensive_experiments"}, {"score": 0.0024912073108138613, "phrase": "six_border_noise_removal_methods"}, {"score": 0.002237036807966899, "phrase": "cleaned_document_images"}, {"score": 0.0022161977759646693, "phrase": "existing_border_noise_removal_techniques"}, {"score": 0.0021049977753042253, "phrase": "scanning_conditions"}], "paper_keywords": ["Document page segmentation", " OCR", " performance evaluation", " border noise removal", " document cleanup"], "paper_abstract": "Projection methods have been used in the analysis of bitonal document images for different tasks such as page segmentation and skew correction for more than two decades. However, these algorithms are sensitive to the presence of border noise in document images. Border noise can appear along the page border due to scanning or photocopying. Over the years, several page segmentation algorithms have been proposed in the literature. Some of these algorithms have come into widespread use due to their high accuracy and robustness with respect to border noise. This paper addresses two important questions in this context: 1) Can existing border noise removal algorithms clean up document images to a degree required by projection methods to achieve competitive performance? 2) Can projection methods reach the performance of other state-of-the-art page segmentation algorithms (e.g., Docstrum or Voronoi) for documents where border noise has successfully been removed? We perform extensive experiments on the University of Washington (UW-III) data set with six border noise removal methods. Our results show that although projection methods can achieve the accuracy of other state-of-the-art algorithms on the cleaned document images, existing border noise removal techniques cannot clean up documents captured under a variety of scanning conditions to the degree required to achieve that accuracy.", "paper_title": "The Effect of Border Noise on the Performance of Projection-Based Page Segmentation Methods", "paper_id": "WOS:000287370400015"}