{"auto_keywords": [{"score": 0.0486682057807098, "phrase": "text_categorization"}, {"score": 0.014490972873788584, "phrase": "training_documents"}, {"score": 0.01340656409576134, "phrase": "external_knowledge"}, {"score": 0.004569414098372132, "phrase": "induction_algorithms"}, {"score": 0.003905124669323623, "phrase": "basic_features"}, {"score": 0.0038327445210488355, "phrase": "semi-supervised_learning"}, {"score": 0.00366443843576107, "phrase": "new_framework"}, {"score": 0.003637112258469488, "phrase": "automatic_acquisition"}, {"score": 0.003609989117581185, "phrase": "world_knowledge"}, {"score": 0.003503497128638099, "phrase": "text_categorization_process"}, {"score": 0.0034514309280805106, "phrase": "machine_learning_algorithms"}, {"score": 0.003387431241133385, "phrase": "domain-specific_and_common-sense_knowledge"}, {"score": 0.003178550413662537, "phrase": "controlled_web_crawling"}, {"score": 0.0030963190575539574, "phrase": "feature_generator"}, {"score": 0.0030049342542235466, "phrase": "appropriate_ontology_concepts"}, {"score": 0.00286213454317036, "phrase": "feature_generation"}, {"score": 0.0028195727965553367, "phrase": "contextual_analysis"}, {"score": 0.0027985291920293127, "phrase": "document_text"}, {"score": 0.0027466028572379455, "phrase": "word_sense"}, {"score": 0.0025578967205807843, "phrase": "natural_language_processing-synonymy"}, {"score": 0.002463830258460528, "phrase": "knowledge-based_features"}, {"score": 0.00216907363015155, "phrase": "data_sets"}, {"score": 0.002152874480615438, "phrase": "improved_performance"}, {"score": 0.0021049977753042253, "phrase": "words_document_representation"}], "paper_keywords": ["feature generation", " text classification", " background knowledge"], "paper_abstract": "Most existing methods for text categorization employ induction algorithms that use the words appearing in the training documents as features. While they perform well in many categorization tasks, these methods are inherently limited when faced with more complicated tasks where external knowledge is essential. Recently, there have been efforts to augment these basic features with external knowledge, including semi-supervised learning and transfer learning. In this work, we present a new framework for automatic acquisition of world knowledge and methods for incorporating it into the text categorization process. Our approach enhances machine learning algorithms with features generated from domain-specific and common-sense knowledge. This knowledge is represented by ontologies that contain hundreds of thousands of concepts, further enriched through controlled Web crawling. Prior to text categorization, a feature generator analyzes the documents and maps them onto appropriate ontology concepts that augment the bag of words used in simple supervised learning. Feature generation is accomplished through contextual analysis of document text, thus implicitly performing word sense disambiguation. Coupled with the ability to generalize concepts using the ontology, this approach addresses two significant problems in natural language processing-synonymy and polysemy. Categorizing documents with the aid of knowledge-based features leverages information that cannot be deduced from the training documents alone. We applied our methodology using the Open Directory Project, the largest existing Web directory built by over 70,000 human editors. Experimental results over a range of data sets confirm improved performance compared to the bag of words document representation.", "paper_title": "Harnessing the expertise of 70,000 human editors: Knowledge-based feature generation for text categorization", "paper_id": "WOS:000252744800004"}