{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "web_spambots"}, {"score": 0.004775918707955445, "phrase": "self_organising_maps"}, {"score": 0.004313793774439379, "phrase": "search_engine_results"}, {"score": 0.004108066884382925, "phrase": "spam_content"}, {"score": 0.004008897491380646, "phrase": "current_anti-spam_filtering_solutions"}, {"score": 0.0037866774001097596, "phrase": "open_area"}, {"score": 0.0036503460615862574, "phrase": "research_gap"}, {"score": 0.003504595508262064, "phrase": "characterise_web_spambots"}, {"score": 0.003447932289587852, "phrase": "web_usage_data"}, {"score": 0.003419943984098415, "phrase": "profile_web_spambots"}, {"score": 0.0031780228058373235, "phrase": "important_characteristics"}, {"score": 0.0030635374056374016, "phrase": "specific_and_limited_actions"}, {"score": 0.0029652292779277782, "phrase": "multiple_user_accounts"}, {"score": 0.0027441711627551064, "phrase": "submission_forms"}, {"score": 0.0026560841114619147, "phrase": "web_server"}, {"score": 0.002274684393868218, "phrase": "different_action"}], "paper_keywords": ["web spambots", " spam 2.0", " spam detection", " behaviour analysis", " web usage mining"], "paper_abstract": "The growth of spam in Web 2.0 environments not only reduces the quality and trust of the content but it also degrades the quality of search engine results. By means of web spambots, spammers are able to distribute spam content more efficiently to more targeted websites. Current anti-spam filtering solutions have not studied web spambots thoroughly and the characterisation of spambots remains an open area of research. In order to fill this research gap, this paper utilises Kohonen's Self:Organising Map (SOM) to characterise web spambots. We analyse web usage data to profile web spambots based on three novel set of features i.e. action set, action frequency and action time. Our experimental results uncovered important characteristics of web spambots that 1) they focus on specific and limited actions compared with humans 2) they use multiple user accounts to spread span: content, hide their identity and bypass restrictions, 3) they bypass filling in submission forms and directly submit the content to the Web server in order to efficiently spread spurn, 4) they can be categorise into 4 different categories based on their actions content submitters, profile editors, content viewers and mixed behaviour, 5) they change their IP address based on different action to hide their tracks. Our results are promising and they suggest that our technique is capable of identifying spam in Web 2.0 applications.", "paper_title": "Characterisation of Web Spambots using Self Organising Maps", "paper_id": "WOS:000293548200002"}