{"auto_keywords": [{"score": 0.04931971121682219, "phrase": "complex_actions"}, {"score": 0.012220811472263844, "phrase": "iaca"}, {"score": 0.007884173469618077, "phrase": "web_services"}, {"score": 0.004816274994647212, "phrase": "interface"}, {"score": 0.004613940521007727, "phrase": "interface_automata"}, {"score": 0.004468684611798047, "phrase": "model_concurrency"}, {"score": 0.004016594765266821, "phrase": "component-based_system"}, {"score": 0.0034777028461723198, "phrase": "xml_messages"}, {"score": 0.003422462630994095, "phrase": "multiple_simple_parts"}, {"score": 0.0029789104204803137, "phrase": "de_alfaro"}, {"score": 0.002947266048104005, "phrase": "henzinger's_interface_automata"}, {"score": 0.0028543298631502107, "phrase": "complex_action"}, {"score": 0.00260657976055413, "phrase": "composition_operation"}, {"score": 0.002578880352208335, "phrase": "refinement_relation"}, {"score": 0.0024712106898618796, "phrase": "ia"}], "paper_keywords": [""], "paper_abstract": "Many formalisms use interleaving to model concurrency. To describe some system behaviours appropriately, we need to limit interleaving. For example, in a component-based system, we might wish to limit interleaving to force the inputs to a method to arrive together in order. In Web services, the arrival of XML messages consisting of multiple simple parts should not be interleaved with the behaviour of another component. We introduce interface automata with complex actions ( IACA), which adds complex actions to de Alfaro and Henzinger's interface automata ( IA). A complex action is a sequence of actions that may not be interleaved with actions from other components. The composition operation and refinement relation are more involved in IACA compared to IA, and we must sacrifice associativity of composition. However, we argue that the advantages of having complex actions make it a useful formalism. We provide proofs of various properties of IACA and discuss the use of IACA for modelling Web services.", "paper_title": "Interface automata with complex actions: Limiting interleaving in interface automata", "paper_id": "WOS:000255428000006"}