{"auto_keywords": [{"score": 0.04359910369825113, "phrase": "service_providers"}, {"score": 0.01406296474602544, "phrase": "service_selection"}, {"score": 0.012538536280153488, "phrase": "rating-based_approaches"}, {"score": 0.00481495049065317, "phrase": "right_parties"}, {"score": 0.004722969348897542, "phrase": "fundamental_problem"}, {"score": 0.004692699265201631, "phrase": "open_and-dynamic_environments"}, {"score": 0.00454422099327167, "phrase": "interacting_parties"}, {"score": 0.004457388497044933, "phrase": "parties'_reasons"}, {"score": 0.0042611497796259026, "phrase": "e-commerce_setting"}, {"score": 0.004047390637093383, "phrase": "previous_approaches"}, {"score": 0.0036986954643952203, "phrase": "particular_context"}, {"score": 0.0033582480189327008, "phrase": "satisfaction_criteria"}, {"score": 0.002952414496287241, "phrase": "classical_rating-based_approach"}, {"score": 0.002822245166926626, "phrase": "selected_service_providers"}, {"score": 0.0026207039474589, "phrase": "detailed_experiences"}, {"score": 0.0024970641749396784, "phrase": "requested_service"}, {"score": 0.0024730434312323296, "phrase": "received_service"}, {"score": 0.00242569125010088, "phrase": "service_consumer"}, {"score": 0.002371589020876307, "phrase": "second_service_consumer"}, {"score": 0.0023487724551034227, "phrase": "receiving_consumer"}, {"score": 0.0022307321581833918, "phrase": "service_consumers"}], "paper_keywords": ["multiagent systems", " ontology design", " electronic commerce"], "paper_abstract": "Selecting the right parties to interact with is a fundamental problem in open and-dynamic environments. The problem is amplified when the number of interacting parties is high, and the parties' reasons for selecting others vary. We examine the problem of service selection in an e-commerce setting where consumer agents cooperate to identify service providers that would satisfy their service needs the most. Previous approaches to service selection are usually based on capturing and exchanging the ratings of consumers to providers. Rating-based approaches have two major weaknesses. 1) ratings are given in a particular context. Even though the context is crucial for interpreting the ratings correctly, the rating-based approaches do not provide the means to represent the context explicitly. 2) The satisfaction criteria of the rater is unknown. Without knowing the expectation of the rater, it is almost impossible to make sense of a rating. We deal-with these two weaknesses in two steps. First, we extend a classical rating-based approach by adding a representation of context. This addition improves the accuracy of selected service providers only when, two consumers with the same service request are assumed to be satisfied with the same service. Next, we replace ratings with detailed experiences of consumers. The experiences are represented with an ontology that can capture the requested service and the received service in detail. When a service consumer decides to share her experiences with a second service consumer, the receiving consumer evaluates the experience by using her own context and satisfaction criteria. By sharing experiences rather than ratings, the service consumers can model service providers more accurately arid, thus, can select service providers that are better suited for their needs.", "paper_title": "Ontology-based service representation and selection", "paper_id": "WOS:000248223300008"}