{"auto_keywords": [{"score": 0.03702857894174594, "phrase": "service-based_architecture"}, {"score": 0.00481495049065317, "phrase": "service-based_approaches"}, {"score": 0.004521803560561489, "phrase": "distributed_application_development"}, {"score": 0.004308455856718928, "phrase": "service-oriented_view"}, {"score": 0.004267004541988167, "phrase": "hardware_and_software_resources"}, {"score": 0.004125027493339274, "phrase": "database_management_systems"}, {"score": 0.00376293585033711, "phrase": "service-based_computing"}, {"score": 0.0035679633126097115, "phrase": "query_processing_technology"}, {"score": 0.0034491650585057754, "phrase": "grid_environment"}, {"score": 0.0031922210879462513, "phrase": "service-based_distributed_query_processor"}, {"score": 0.0029117710453690827, "phrase": "analysis_resources"}, {"score": 0.0026049517737353365, "phrase": "distributed_query_plans"}, {"score": 0.0025673856614952854, "phrase": "resulting_system"}, {"score": 0.0025181367444581993, "phrase": "declarative_approach"}, {"score": 0.00249386680748172, "phrase": "service_orchestration"}, {"score": 0.0024342079318127423, "phrase": "query_processing"}, {"score": 0.0021987994275190314, "phrase": "usage_scenarios"}, {"score": 0.002135812692862058, "phrase": "bioinformatics_application"}, {"score": 0.0021049977753042253, "phrase": "performance_results"}], "paper_keywords": ["Web service", " Data integration", " Data grid"], "paper_abstract": "Service-based approaches are rising to prominence because of their potential to meet the requirements for distributed application development in e-business and e-science. The emergence of a service-oriented view of hardware and software resources raises the question as to how database management systems and technologies can best be deployed or adapted for use in such an environment. This paper explores one aspect of service-based computing and data management, viz., how to integrate query processing technology with a service-based architecture suitable for a Grid environment. The paper addresses this by describing in detail the design and implementation of a service-based distributed query processor. The query processor is service-based in two orthogonal senses: firstly, it supports querying over data storage and analysis resources that are made available as services, and, secondly, its internal architecture factors out as services the functionalities related to the construction and execution of distributed query plans. The resulting system both provides a declarative approach to service orchestration, and demonstrates how query processing can benefit from a service-based architecture. As well as describing and motivating the architecture used, the paper also describes usage scenarios, and, using a bioinformatics application, presents performance results that benchmark the system and illustrate the benefits provided by the service-based architecture. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "The design and implementation of OGSA-DQP: A service-based distributed query processor", "paper_id": "WOS:000262278200003"}