{"auto_keywords": [{"score": 0.03843852139269273, "phrase": "dolecek"}, {"score": 0.03806155594747826, "phrase": "anantharam"}, {"score": 0.00481495049065317, "phrase": "run-length_limited_sequences"}, {"score": 0.004460309246062286, "phrase": "run-length_limited_sequence"}, {"score": 0.003711723285313348, "phrase": "number-theoretic_code"}, {"score": 0.0035269696779744266, "phrase": "multiple_repetition_errors"}, {"score": 0.003438058620195309, "phrase": "multiple_insertions"}, {"score": 0.002718045523483502, "phrase": "systematic_encoding_method"}, {"score": 0.0025174594088331853, "phrase": "proposed_construction"}, {"score": 0.002479150189700726, "phrase": "higher_rate"}, {"score": 0.0024289743270061157, "phrase": "helberg_code"}, {"score": 0.002249672943553135, "phrase": "additional_run-length_constraints"}, {"score": 0.0021928902836049384, "phrase": "run-length_limited_codes"}, {"score": 0.0021049977753042253, "phrase": "bit-patterned_media"}], "paper_keywords": ["Helberg code", " insertion/deletion error", " magnetic recording media", " run-length limited sequence"], "paper_abstract": "A code construction is proposed to add a multiple insertion/deletion error correcting capability to a run-length limited sequence. The codewords of this code are themselves run-length limited. The insertion/deletion correcting capability is achieved by requiring several weighted sums of run-lengths in the codewords to satisfy certain congruences modulo primes. The construction is similar to the number-theoretic code proposed by Dolecek and Anantharam, which can correct multiple repetition errors or, equivalently, multiple insertions of zeros. It is shown that if the codewords in this code are run-length limited, then the code is capable of correcting both insertions and deletions of zeros and ones. An algorithm is proposed for decoding over a multiple insertion/deletion channel. Following the work of Dolecek and Anantharam, a systematic encoding method is also proposed for the codes. Furthermore, it is shown that the proposed construction has a higher rate asymptotically than the Helberg code, which is unconstrained in terms of run-lengths, even though our construction has the additional run-length constraints. The need for run-length limited codes that can correct insertion/deletion errors is motivated by bit-patterned media for magnetic recording.", "paper_title": "A Multiple Insertion/Deletion Correcting Code for Run-Length Limited Sequences", "paper_id": "WOS:000300845900033"}