{"auto_keywords": [{"score": 0.04900031007413473, "phrase": "sendmail"}, {"score": 0.04465897487317221, "phrase": "simple_mail_transfer_protocol"}, {"score": 0.00481495049065317, "phrase": "dos_prevention_system"}, {"score": 0.004760394308239882, "phrase": "spt-based_sync_flooding_protection"}, {"score": 0.004320830996369296, "phrase": "smtp"}, {"score": 0.003267342521938321, "phrase": "mail_systems"}, {"score": 0.0032302651984757336, "phrase": "smtp."}, {"score": 0.0031393948330209255, "phrase": "service_denial_attacks"}, {"score": 0.00308610073274614, "phrase": "mass_spam_mail"}, {"score": 0.0029483516334882862, "phrase": "external_service_attacks"}, {"score": 0.0023463203637929466, "phrase": "security_architecture"}, {"score": 0.002178400923036365, "phrase": "network_architecture"}, {"score": 0.0021049977753042253, "phrase": "external_malicious_attacks"}], "paper_keywords": ["IPS", " IDS", " SPAM", " DOS Attack", " SMTP", " SPT", " MQSPT"], "paper_abstract": "Sendmail, an open-source-based software, is the most typical mail system that uses SMTP (Simple Mail Transfer Protocol). SMTP (Simple Mail Transfer Protocol), a protocol to deliver various types of files and messages, is being utilized not only in E-MAIL, but also in MMS (Multimedia Message Service) data transfer in mobile environment. Sendmail, an open source based software, is the most typical in mail systems using SMTP. It is exposed to service denial attacks such as mass spam mail because of its process structure that is vulnerable to external service attacks. In this paper, we discuss our design of a security architecture that can respond efficiently to mass mail and Sync Flooding attacks from the internet. Also, to apply our proposed service denial attack security architecture, we used SPT (Safe Proper Time) technology, which ensures the reliability of TCP/IP communication. By analyzing the pros and cons of the security architecture in accordance with each phase of the network, we propose a network architecture that can most efficiently fight external malicious attacks.", "paper_title": "A Study on the Dos Prevention System for SPT-based Sync Flooding Protection", "paper_id": "WOS:000376568100007"}