{"auto_keywords": [{"score": 0.03843856552198327, "phrase": "hybrid_method"}, {"score": 0.015719716506582538, "phrase": "fast_evaluation"}, {"score": 0.004745665541429529, "phrase": "elastic_constants"}, {"score": 0.004677372885331908, "phrase": "many-body_potentials"}, {"score": 0.003958937342925219, "phrase": "inherent_connection"}, {"score": 0.0038737214010638745, "phrase": "latter_two_methods"}, {"score": 0.0036026484429137998, "phrase": "group_perturbation"}, {"score": 0.0034491650585057754, "phrase": "six_homogeneous_deformations"}, {"score": 0.0033262524445013303, "phrase": "born_term"}, {"score": 0.0032546105164772995, "phrase": "stress_fluctuation_method"}, {"score": 0.002416589459425828, "phrase": "complicated_many-body_potentials"}, {"score": 0.002347378595930709, "phrase": "analytical_second_derivative"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Elastic constants", " Fluctuation method", " Many-body potentials", " Group perturbation"], "paper_abstract": "A universal, fast deformation-fluctuation hybrid approach with the merits of both the direct and fluctuation methods for evaluation of elastic constants is proposed. Deformation is shown to provide an inherent connection between the latter two methods. Based on this finding, the hybrid method utilizes group perturbation of atoms by means of six homogeneous deformations for fast evaluation of the Born term in the stress fluctuation method. The hybrid method is tested with three typical and widely used many-body potentials, i.e., for crystalline silicon with a Stillinger-Weber potential, for crystalline copper with second nearest-neighbor modified embedded-atom method and for diamond with a second-generation reactive empirical bond order potential. The calculated elastic constants agree well with either the theoretical or experimental results for all three cases. The hybrid method is especially valuable for complicated many-body potentials for which the analytical second derivative of the energy is challenging or impractical to obtain. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A deformation-fluctuation hybrid method for fast evaluation of elastic constants with many-body potentials", "paper_id": "WOS:000298531400005"}