{"auto_keywords": [{"score": 0.049651030276363146, "phrase": "hybrid_attribute_information_system"}, {"score": 0.01650190770784486, "phrase": "hybrid_indiscernibility_relation"}, {"score": 0.012421384716028864, "phrase": "fuzzy_concept"}, {"score": 0.011028907276965002, "phrase": "rough_approximation"}, {"score": 0.009588954591850458, "phrase": "fuzzy_set"}, {"score": 0.008261165014920227, "phrase": "cut_set"}, {"score": 0.0060227627812436775, "phrase": "lower_and_upper_approximations"}, {"score": 0.005424240318506779, "phrase": "fuzzy_rough_set"}, {"score": 0.004494570360108983, "phrase": "rough_set_models"}, {"score": 0.004451964405258156, "phrase": "fuzzy_rough_approximation_operators"}, {"score": 0.004441059405327222, "phrase": "hybrid_attribute_sets"}, {"score": 0.004233284262727897, "phrase": "crisp_concept"}, {"score": 0.003939633463129123, "phrase": "fuzzy_indiscernibility"}, {"score": 0.0038694478796567353, "phrase": "numerical_attributes"}, {"score": 0.0038348235692738783, "phrase": "equivalence_relation"}, {"score": 0.0038119123317396954, "phrase": "symbolic_attributes"}, {"score": 0.003686316993210687, "phrase": "information_systems"}, {"score": 0.0035051129798529, "phrase": "interesting_properties"}, {"score": 0.003473737415587531, "phrase": "hybrid_fuzzy_rough_approximation_operators"}, {"score": 0.0033409791799749403, "phrase": "existing_rough_set_model"}, {"score": 0.0029722900280316216, "phrase": "attribute_approximation_space"}, {"score": 0.0028500803748621175, "phrase": "hybrid_attribute_approximation_space"}, {"score": 0.0027002880298916104, "phrase": "characterization_theorems"}, {"score": 0.0025583481578439894, "phrase": "information_system"}, {"score": 0.0024901940672239784, "phrase": "uncertainty_measure"}, {"score": 0.00242385118139873, "phrase": "knowledge_granulation"}, {"score": 0.00240213106042981, "phrase": "main_contribution"}, {"score": 0.0023171750718791713, "phrase": "existing_rough_set_approach"}, {"score": 0.002269008698686152, "phrase": "fuzzy_environment"}, {"score": 0.0022218413146898887, "phrase": "new_way"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Rough set", " Fuzzy rough set", " Hybrid indiscernibility relation", " Hybrid attribute information system", " Knowledge granulation"], "paper_abstract": "One important and valuable topic in rough set theory is the concept of approximation over various generalized information systems. Although rough set models and approaches over hybrid attribute sets have been studied by many researchers recently, the studies focus on the rough approximation of a crisp concept over a hybrid attribute information system. This paper considers the rough approximation of a fuzzy concept over a hybrid attribute information system. We define a hybrid indiscernibility relation by compounding the fuzzy indiscernibility (similarity) relation over numerical attributes with the equivalence relation over symbolic attributes. Then we present the lower and upper approximations of a fuzzy set based on the hybrid indiscernibility relation, i.e., the fuzzy rough set over a hybrid attribute information system. Also, some interesting properties of the hybrid fuzzy rough approximation operators are presented in detail and the relationship between the fuzzy rough set and the existing rough set model over a hybrid attribute information system is established. Meanwhile, based on the definition of the cut set of a fuzzy set of the universe of discourse, the representations of the lower and upper approximations of a fuzzy set are given with respect to hybrid attribute approximation space. Furthermore, the concept of the cut set of the hybrid indiscernibility relation of the hybrid attribute approximation space is defined, then the characterizations of the hybrid fuzzy rough approximation operators are established as well. Two different types of characterization theorems of the hybrid fuzzy rough approximation operators are presented based on the cut set of the hybrid indiscernibility relation over the hybrid attribute information system. At the same time, we study the uncertainty measure of the fuzzy rough set over a hybrid attribute information system by using knowledge granulation. The main contribution of this paper is twofold. One is to extend the existing rough set approach over hybrid attribute information systems to a fuzzy environment. Another is to present a new way to define the rough approximation of a fuzzy concept as well the uncertainty measure over hybrid attribute information systems. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "Rough approximation of a fuzzy concept on a hybrid attribute information system and its uncertainty measure", "paper_id": "WOS:000341677100005"}