{"auto_keywords": [{"score": 0.03192280240290009, "phrase": "integration_problems"}, {"score": 0.004765788394931875, "phrase": "integration_systems"}, {"score": 0.004367581653370531, "phrase": "synthetic_scenarios"}, {"score": 0.003961613484271729, "phrase": "cumbersome_task"}, {"score": 0.003782655283668953, "phrase": "specific_feature"}, {"score": 0.003574830654211291, "phrase": "integration_solutions"}, {"score": 0.003413284742632989, "phrase": "different_application_scenarios"}, {"score": 0.003160049822855747, "phrase": "integration_benchmarks"}, {"score": 0.0030640804704319255, "phrase": "major_abstractions"}, {"score": 0.0028659990472580154, "phrase": "robust_empirical_methods"}, {"score": 0.002793260314529583, "phrase": "schema_evolution"}, {"score": 0.0027505037762786087, "phrase": "data_exchange"}, {"score": 0.0025202582748972122, "phrase": "schema_mappings"}, {"score": 0.00248167018931442, "phrase": "main_abstraction"}, {"score": 0.0023694065215394593, "phrase": "metadata_generator"}, {"score": 0.0022161333611134806, "phrase": "data_integration_systems"}], "paper_keywords": [""], "paper_abstract": "Integration systems are typically evaluated using a few real world scenarios (e.g., bibliographical or biological datasets) or using synthetic scenarios (e.g., based on star-schemas or other patterns for schemas and constraints). Reusing such evaluations is a cumbersome task because their focus is usually limited to showcasing a specific feature of an approach. This makes it difficult to compare integration solutions, understand their generality, and understand their performance for different application scenarios. Based on this observation, we demonstrate some of the requirements for developing integration benchmarks. We argue that the major abstractions used for integration problems have converged in the last decade which enables the application of robust empirical methods to integration problems (from schema evolution, to data exchange, to answering queries using views and many more). Specifically, we demonstrate that schema mappings are the main abstraction that now drives most integration solutions and show how a metadata generator can be used to create more credible evaluations of the performance and scalability of data integration systems. We will use the demonstration to evangelize for more robust, shared empirical evaluations of data integration systems.", "paper_title": "Gain Control over your Integration Evaluations", "paper_id": "WOS:000386424800076"}