{"auto_keywords": [{"score": 0.049390246951185, "phrase": "tone_correctness"}, {"score": 0.019482869187159236, "phrase": "speech_data"}, {"score": 0.007362169183014305, "phrase": "tonal_context"}, {"score": 0.006463598268734797, "phrase": "synthetic_speech"}, {"score": 0.004700027722284931, "phrase": "average-voice-based_speech_synthesis"}, {"score": 0.004456717971917794, "phrase": "speech_synthesis"}, {"score": 0.004392565073466714, "phrase": "tonal_language"}, {"score": 0.004308455856718928, "phrase": "average-voice_model"}, {"score": 0.004185289462328125, "phrase": "nonprofessional_speakers'_speech"}, {"score": 0.0040656296649390486, "phrase": "tone_disagreements"}, {"score": 0.0039685202936462815, "phrase": "nonprofessional_speakers"}, {"score": 0.0036908381347418805, "phrase": "inconsistent_tonal_labeling"}, {"score": 0.0032232653428491435, "phrase": "original_speech"}, {"score": 0.002469830206270585, "phrase": "experimental_results"}, {"score": 0.002387507583705495, "phrase": "proposed_technique"}, {"score": 0.002230984431056064, "phrase": "small_amount"}, {"score": 0.0021881743793875767, "phrase": "nonprofessional_target_speakers"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["HMM-based speech synthesis", " Average voice model", " F0 modeling", " F0 quantization"], "paper_abstract": "This paper proposes a technique of improving tone correctness in speech synthesis of a tonal language based on an average-voice model trained with a corpus from nonprofessional speakers' speech. We focused on reducing tone disagreements in speech data acquired from nonprofessional speakers without manually modifying the labels. To reduce the distortion in tone caused by inconsistent tonal labeling, quantized F0 symbols were utilized as the context for F0 to obtain an appropriate F0 model. With this technique, the tonal context could be directly extracted from the original speech and this prevented inconsistency between speech data and F0 labels generated from transcriptions, which affect naturalness and the tone correctness in synthetic speech. We examined two types of labeling for the tonal context using phone-based and sub-phone-based quantized F0 symbols. Subjective and objective evaluations of the synthetic voice were carried out in terms of the intelligibility of tone and its naturalness. The experimental results from both the objective and subjective tests revealed that the proposed technique could improve not only naturalness but also the tone correctness of synthetic speech under conditions where a small amount of speech data from nonprofessional target speakers was used. (C) 2011 Elsevier B.V. All rights reserved.", "paper_title": "A tone-modeling technique using a quantized F0 context to improve tone correctness in average-voice-based speech synthesis", "paper_id": "WOS:000297444600008"}