{"auto_keywords": [{"score": 0.03370968316969064, "phrase": "desktop-based_interface"}, {"score": 0.00481495049065317, "phrase": "exploration_robotics"}, {"score": 0.004631099806015235, "phrase": "mobile_robots"}, {"score": 0.00457138247462329, "phrase": "high-risk_tasks"}, {"score": 0.004192392802008709, "phrase": "completely_autonomous_robots"}, {"score": 0.004102639724186862, "phrase": "remote_operators"}, {"score": 0.003962998498942108, "phrase": "desired_missions"}, {"score": 0.0037138072936226, "phrase": "robot's_surroundings"}, {"score": 0.0032331613500559764, "phrase": "hand-held-based_interface"}, {"score": 0.002814545518256278, "phrase": "operator's_intra-scenario_mobility"}, {"score": 0.002766171878646582, "phrase": "hand-held_device"}, {"score": 0.0022758994740331258, "phrase": "control_policy"}, {"score": 0.0021604924928015283, "phrase": "hand-held_devices"}, {"score": 0.0021049977753042253, "phrase": "desktop-based_computers"}], "paper_keywords": ["Interfaces", " Human-robot-interaction", " Robot interfaces", " Search and rescue robots", " Experimental evaluation"], "paper_abstract": "Mobile robots can accomplish high-risk tasks without exposing humans to danger: robots go where humans fear to tread. Until the time in which completely autonomous robots are fully deployed, remote operators will be required in order to fulfill desired missions. Remotely controlling a robot requires that the operator receives the information about the robot's surroundings, as well as its location in the scenario. Based on a set of experiments conducted with users, we evaluate the performance of operators when they are provided with a hand-held-based interface or a desktop-based interface. Results show how performance depends on the task asked of the operator and the scenario in which the robot is moving. The conclusions prove that the operator's intra-scenario mobility when carrying a hand-held device can counterbalance the limitations of the device. By contrast, the experiments show that if the operator cannot move inside of the scenario, his performance is significantly better when using a desktop-based interface. These results set the basis for a transfer of control policy in missions involving a team of operators, some equipped with hand-held devices and others working remotely with desktop-based computers.", "paper_title": "Operator Performance in Exploration Robotics A Comparison Between Stationary and Mobile Operators", "paper_id": "WOS:000297365600005"}