{"auto_keywords": [{"score": 0.049347793578485864, "phrase": "low_interference_regime"}, {"score": 0.015719716506582538, "phrase": "mimo_interference_channels"}, {"score": 0.015248150049921824, "phrase": "gaussian_inputs"}, {"score": 0.00839911635228257, "phrase": "direct_and_cross_channel"}, {"score": 0.004322967486451877, "phrase": "sum_capacity"}, {"score": 0.0035382855372646164, "phrase": "gain_matrices"}, {"score": 0.003192700856094016, "phrase": "special_cases"}, {"score": 0.003143849342926373, "phrase": "symmetric_multiple-input_single-output"}, {"score": 0.003111721573470106, "phrase": "miso"}, {"score": 0.0027646829399573434, "phrase": "interference_levels"}, {"score": 0.0023211517663846346, "phrase": "low_interference_threshold"}, {"score": 0.0021049977753042253, "phrase": "miso_and_simo_cases"}], "paper_keywords": ["Capacity", " genie", " interference channel", " multiple-input multiple-output (MIMO)", " outer bound", " treating interference as noise"], "paper_abstract": "Using Gaussian inputs and treating interference as noise at the receivers has recently been shown to be sum capacity achieving for the two-user single-input single-output (SISO) Gaussian interference channel in a low interference regime, where the interference levels are below certain thresholds. In this paper, such a low interference regime is characterized for multiple-input multiple-output (MIMO) Gaussian interference channels. Conditions are provided on the direct and cross channel gain matrices under which using Gaussian inputs and treating interference as noise at the receivers is sum capacity achieving. For the special cases of the symmetric multiple-input single-output (MISO) and single-input multiple-output (SIMO) Gaussian interference channels, more explicit expressions for the low interference regime are derived. In particular, the threshold on the interference levels that characterize low interference regime is related to the input SNR and the angle between the direct and cross channel gain vectors. It is shown that the low interference regime can be quite significant for MIMO interference channels, with the low interference threshold being at least as large as the sine of the angle between the direct and cross channel gain vectors for the MISO and SIMO cases.", "paper_title": "Sum Capacity of MIMO Interference Channels in the Low Interference Regime", "paper_id": "WOS:000289836300003"}