{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "trust_models"}, {"score": 0.015539831657690243, "phrase": "different_e-marketplace_environments"}, {"score": 0.011120806047705377, "phrase": "suitable_trust_models"}, {"score": 0.010435409021063343, "phrase": "trust_model"}, {"score": 0.008182089919388007, "phrase": "unknown_environment"}, {"score": 0.004067152645111547, "phrase": "suitable_trust_model"}, {"score": 0.003904713104101532, "phrase": "ground_truth"}, {"score": 0.0034551632687788857, "phrase": "case-based_reasoning_framework"}, {"score": 0.0033559647822437298, "phrase": "unknown_environments"}, {"score": 0.0029694040368299624, "phrase": "similar_environment"}, {"score": 0.0028506823968539206, "phrase": "case_base"}, {"score": 0.0027687904688616983, "phrase": "simulated_environments"}, {"score": 0.002720785798036066, "phrase": "known_ground_truth"}, {"score": 0.0024640253074497114, "phrase": "case-based_retrieval_algorithms"}, {"score": 0.0021672995161145276, "phrase": "evaluation_results"}], "paper_keywords": [""], "paper_abstract": "The performance of trust models highly depend on the characteristics of the environments where they are applied. Thus, it becomes challenging to choose a suitable trust model for a given e-marketplace environment, especially when ground truth about the agent (buyer and seller) behavior is unknown (called unknown environment). We propose a case-based reasoning framework to choose suitable trust models for unknown environments, based on the intuition that if a trust model performs well in one environment, it will do so in another similar environment. Firstly, we build a case base with a number of simulated environments (with known ground truth) along with the trust models most suitable for each of them. Given an unknown environment, case-based retrieval algorithms retrieve the most similar case(s), and the trust model of the most similar case(s) is chosen as the most suitable model for the unknown environment. Evaluation results confirm the effectiveness of our framework in choosing suitable trust models for different e-marketplace environments.", "paper_title": "A Case-Based Reasoning Framework to Choose Trust Models for Different E-Marketplace Environments", "paper_id": "WOS:000354603700001"}