{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "qualitative_analysis"}, {"score": 0.004749106104067268, "phrase": "system's_dependencies"}, {"score": 0.004494570360108983, "phrase": "link_system"}, {"score": 0.004081385289516914, "phrase": "dependency_chains"}, {"score": 0.004025531820226182, "phrase": "discrete_system"}, {"score": 0.0039341294012600085, "phrase": "systemic_analysis"}, {"score": 0.0037060428445111694, "phrase": "previously_developed_theoretical_concepts"}, {"score": 0.0035887342563437935, "phrase": "aforementioned_objects"}, {"score": 0.003555902292752528, "phrase": "findings_-_a_tool"}, {"score": 0.0032886455096627324, "phrase": "fast_and_economical_manner"}, {"score": 0.00290473242917264, "phrase": "structural_function"}, {"score": 0.002518746501941657, "phrase": "invariant_group"}, {"score": 0.002224510044064184, "phrase": "direct_transfer"}, {"score": 0.002194011800331242, "phrase": "theoretical_results"}, {"score": 0.002163930783583212, "phrase": "recent_publications"}, {"score": 0.0021049977753042253, "phrase": "different_treatment"}], "paper_keywords": ["Cybernetics", " Programming and algorithm theory", " Systems theory"], "paper_abstract": "Purpose - Based on knowledge of the variables of a link system and their interrelation, the purpose of this paper is to show how it is possible to specify all the objects relating to dependency chains of a discrete system which are essential in systemic analysis of any system. Design/methodology/approach - An algorithm is designed based on previously developed theoretical concepts which enables the discovery of the aforementioned objects. Findings - A tool has been developed which is able to analyse any system with given variables and dependencies in a fast and economical manner. Practical implications - These results can be applied to a number of cases. For example, in the case of an ecosystem, the structural function associated with each species of the ecosystem can be determined, it could be ascertained whether a group of species covered another group of species, whether there is an invariant group of species can be determined, and the orbit of each species analysed. Originality/value - The algorithm presented in this paper is innovative in that it is a direct transfer of the theoretical results presented in recent publications, and therefore presupposes a different treatment of the qualitative analysis of the system.", "paper_title": "Algorithm for qualitative analysis of a system's dependencies", "paper_id": "WOS:000272687400011"}