{"auto_keywords": [{"score": 0.042317767066510185, "phrase": "oasis"}, {"score": 0.00843619273606724, "phrase": "students'_argumentation_skills"}, {"score": 0.00481495049065317, "phrase": "intact_class"}, {"score": 0.004441517985511521, "phrase": "online_tools"}, {"score": 0.004357927940322685, "phrase": "argumentation_skills"}, {"score": 0.004255639740735269, "phrase": "liberal_study"}, {"score": 0.003906804492585634, "phrase": "online_reading"}, {"score": 0.0036727235025069828, "phrase": "learning_objectives"}, {"score": 0.003199687131875466, "phrase": "entire_school_year"}, {"score": 0.0027218799769229596, "phrase": "text_passages"}, {"score": 0.0022287497627555895, "phrase": "task_design"}, {"score": 0.0021659920594094407, "phrase": "collaborative_peer_evaluation_tasks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Argumentation skills", " Argumentation tools", " Liberal study", " Critical reading", " Argument structure"], "paper_abstract": "This paper reports on the use of a set of online tools to scaffold the argumentation skills of students enrolled in Liberal Study (LS). The tools, collectively known as OASIS, were designed to support the online reading, writing, and evaluating activifies of students engaged in fulfilling the learning objectives of the course. OASIS was designed to be integrated into the teaching and learning activities of the course. Two classes of students used the tools over an entire school year. We examined how the students used the tools to read and write arguments and how this affected their argumentation skills. The data collected included the number and types of tags students assigned to text passages and the quality of the arguments they produced in their written essays. Students' argumentation skills were found to be related to the number of tags they defined. OASIS was found to be effective in scaffolding students' argumentation skills. However, limitations were identified during task design, especially the design of collaborative peer evaluation tasks. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Scaffolding argumentation in intact class: Integrating technology and pedagogy", "paper_id": "WOS:000325600400017"}