{"auto_keywords": [{"score": 0.04898689815940368, "phrase": "older_people"}, {"score": 0.015505893263073004, "phrase": "everyday_interactions"}, {"score": 0.008086441453127922, "phrase": "age-related_changes"}, {"score": 0.00481495049065317, "phrase": "accessibility_barriers"}, {"score": 0.003929689573550262, "phrase": "ethnographical_study"}, {"score": 0.0034528025626422154, "phrase": "visual_information"}, {"score": 0.0034210342328868017, "phrase": "understanding_icons"}, {"score": 0.00309023627455429, "phrase": "real-life_web_use"}, {"score": 0.0028566300478906916, "phrase": "ict_accessibility"}, {"score": 0.0026163210719740847, "phrase": "social_relationships"}, {"score": 0.0025922289692173997, "phrase": "life_experiences"}, {"score": 0.002363150587804677, "phrase": "current_focus"}, {"score": 0.0021049977753042253, "phrase": "real-life_use"}], "paper_keywords": ["Ethnography", " Web accessibility", " Older people"], "paper_abstract": "Older people experience many barriers when they access to the web. However, little is known about which barriers limit more (or less) their daily interactions. This paper presents some findings based on an ethnographical study of the everyday interactions of nearly 400 older people with the web over 3 years. Difficulties remembering steps, understanding terms and using the mouse are more severe than problems perceiving visual information, understanding icons and using the keyboard. This is largely explained by inclusion, independence and socialization, which are the three key components of real-life web use. This paper also shows that these aspects should be considered in other areas of web and ICT accessibility, as technophobia is not the only experience in the interactions of older people with the web, and both social relationships and life experiences beyond technologies need to be taken into account apart from age-related changes in abilities. These findings suggest that the current focus on compensating for age-related changes in functional abilities needs to be widened. Working towards making the web more accessible should not be divorced from real-life use. This paper discusses implications for web (and ICT) design, training and support.", "paper_title": "An ethnographical study of the accessibility barriers in the everyday interactions of older people with the web", "paper_id": "WOS:000300161700002"}