{"auto_keywords": [{"score": 0.004751889650408546, "phrase": "corresponding_indoor_geometry"}, {"score": 0.004689650818647484, "phrase": "international_standard"}, {"score": 0.00466908606516246, "phrase": "citygml"}, {"score": 0.004628223381645729, "phrase": "five_levels"}, {"score": 0.004220086640742953, "phrase": "indoor_geometry"}, {"score": 0.0040385352882334235, "phrase": "correspondingly_high_detail"}, {"score": 0.00395069818358908, "phrase": "high_cost"}, {"score": 0.003477505397536663, "phrase": "great_variety"}, {"score": 0.0034168317227203206, "phrase": "similarly_simple_models"}, {"score": 0.002994178996584381, "phrase": "indoor_building_geometries"}, {"score": 0.002967931416941965, "phrase": "comparable_complexity"}, {"score": 0.0024024377855956136, "phrase": "google_street_view"}, {"score": 0.002258745901862197, "phrase": "net_internal_area"}, {"score": 0.0021049977753042253, "phrase": "official_government_data_sets"}], "paper_keywords": ["CityGML", " 3D city model", " indoor", " LOD2+", " net internal area"], "paper_abstract": "The international standard CityGML defines five levels of detail (LODs) for 3D city models, but only the highest of these (LOD4) supports modelling the indoor geometry of a building, which must be acquired in correspondingly high detail and therefore at a high cost. Whereas simple 3D city models of the exterior of buildings (e.g. CityGML LOD2) can be generated largely automatically, and are thus now widely available and have a great variety of applications, similarly simple models containing their indoor geometries are rare.In this paper we present two contributions: (i) the definition of a level of detail LOD2+, which extends the CityGML LOD2 specification with indoor building geometries of comparable complexity to their exterior geometries in LOD2; and more importantly (ii) a method for automatically generating such indoor geometries based on existing CityGML LOD2 exterior geometries. We validate our method by generating LOD2+ models for a subset of the Rotterdam 3D data set and visually comparing these models to their real counterparts in building blueprints and imagery from Google Street View and Bing Maps. Furthermore, we use the LOD2+ models to compute the net internal area of each dwelling and validate our results by comparing these values to the ones registered in official government data sets.", "paper_title": "Automatically enhancing CityGML LOD2 models with a corresponding indoor geometry", "paper_id": "WOS:000361533100010"}