{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "robot_swarm"}, {"score": 0.004257000695796238, "phrase": "positive_and_negative_effects"}, {"score": 0.0041074234667687875, "phrase": "physical_interference"}, {"score": 0.0037485269508155516, "phrase": "coordination_requirements"}, {"score": 0.0034895911869254146, "phrase": "case-by-case_basis"}, {"score": 0.0031718628581265266, "phrase": "unpartitioned_task"}, {"score": 0.002814956065949522, "phrase": "multi-armed_bandit_problem"}, {"score": 0.002694375425481759, "phrase": "reinforcement_learning_literature"}, {"score": 0.0025892330566358503, "phrase": "explicit_communication"}, {"score": 0.0025180781216911246, "phrase": "studied_task"}, {"score": 0.0024488738006005133, "phrase": "foraging_scenario"}, {"score": 0.002381566880282456, "phrase": "simulation-based_experiments"}, {"score": 0.0022614266476954467, "phrase": "existing_multi-armed_bandit_algorithms"}, {"score": 0.0021049977753042253, "phrase": "better_performance"}], "paper_keywords": ["Task partitioning", " Foraging", " Swarm robotics", " Self-organization", " Social learning"], "paper_abstract": "Task partitioning consists in dividing a task into sub-tasks that can be tackled separately. Partitioning a task might have both positive and negative effects: On the one hand, partitioning might reduce physical interference between workers, enhance exploitation of specialization, and increase efficiency. On the other hand, partitioning may introduce overheads due to coordination requirements. As a result, whether partitioning is advantageous or not has to be evaluated on a case-by-case basis. In this paper we consider the case in which a swarm of robots must decide whether to complete a given task as an unpartitioned task, or utilize task partitioning and tackle it as a sequence of two sub-tasks. We show that the problem of selecting between the two options can be formulated as a multi-armed bandit problem and tackled with algorithms that have been proposed in the reinforcement learning literature. Additionally, we study the implications of using explicit communication between the robots to tackle the studied task partitioning problem. We consider a foraging scenario as a testbed and we perform simulation-based experiments to evaluate the behavior of the system. The results confirm that existing multi-armed bandit algorithms can be employed in the context of task partitioning. The use of communication can result in better performance, but in may also hinder the flexibility of the system.", "paper_title": "Task partitioning in a robot swarm: a study on the effect of communication", "paper_id": "WOS:000322157300005"}