{"auto_keywords": [{"score": 0.04356127827965969, "phrase": "thrust_wedge"}, {"score": 0.021750528348447963, "phrase": "active_thrust"}, {"score": 0.006129554727029778, "phrase": "analytical_solution"}, {"score": 0.00481495049065317, "phrase": "narrow_backfill_width"}, {"score": 0.004684157900507474, "phrase": "retaining_wall"}, {"score": 0.004592905436175987, "phrase": "analytical_methods"}, {"score": 0.004381793121560086, "phrase": "coulomb"}, {"score": 0.004312625111536856, "phrase": "rankine"}, {"score": 0.003832198214757852, "phrase": "analytical_method"}, {"score": 0.0036553070575015344, "phrase": "narrow_width"}, {"score": 0.003541923233726252, "phrase": "limit_equilibrium_method"}, {"score": 0.0035141291835319682, "phrase": "planar_slip_surfaces"}, {"score": 0.0032350961776525075, "phrase": "single_block"}, {"score": 0.0026252106881752067, "phrase": "cubic_equation"}, {"score": 0.0025038930574283174, "phrase": "quartic_equation"}, {"score": 0.00238816839721704, "phrase": "higher_degrees"}, {"score": 0.002259883463607508, "phrase": "semi-analytical_solution"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Active earth force", " Cantilever walls", " Lateral pressure", " Active condition"], "paper_abstract": "When the backfill behind a retaining wall is narrow, the analytical methods commonly used for evaluating active thrust, such as the method of Coulomb or that of Rankine, are inappropriate. This is because the thrust wedge cannot develop in the shape and size predicted by these methods. To address, this paper presents an analytical method to obtain a solution for the active thrust exerted by backfill of narrow width on gravity retaining walls, using the limit equilibrium method with planar slip surfaces. Three different failure mechanisms of the thrust wedge are examined, called, respectively, Mechanism 1 (with the thrust wedge formed by a single block), Mechanism 2 (where the thrust wedge is composed of two rigid blocks, one slipping with respect to the other) and Mechanism 3 (which considers three blocks). The paper discusses when the problem has an analytical solution in terms of roots, showing that Mechanism 2 is governed by a cubic equation and Mechanism 3 by a system of a cubic and a quartic equation. More complex mechanisms with four or more blocks are described by systems with equations of higher degrees which do not have an analytical solution in the form of roots. A semi-analytical solution is also given for locating the point of application of the active thrust. (c) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Active thrust on retaining walls of narrow backfill width", "paper_id": "WOS:000317943000007"}