{"auto_keywords": [{"score": 0.04260675614564952, "phrase": "rounding_errors"}, {"score": 0.03581521662404144, "phrase": "compensated_summation_algorithms"}, {"score": 0.00481495049065317, "phrase": "matrix_multiplications"}, {"score": 0.004351595642056769, "phrase": "scientific_computing"}, {"score": 0.004090577229368418, "phrase": "floating_point"}, {"score": 0.003999578057088828, "phrase": "numerical_computation"}, {"score": 0.00378080526397273, "phrase": "matrix_multiplication"}, {"score": 0.0034359094594153304, "phrase": "extra_precision"}, {"score": 0.003035711716881469, "phrase": "original_algorithm"}, {"score": 0.0030017207229983385, "phrase": "graphics_cards"}, {"score": 0.002853396755102163, "phrase": "double_precision"}, {"score": 0.0023560952790080943, "phrase": "whole_digit"}, {"score": 0.0023035922232490106, "phrase": "current_generation_graphics_cards"}, {"score": 0.0021896891011033105, "phrase": "newly_released_\"fermi\"_architecture"}], "paper_keywords": ["GPGPU", " matrix multiplication", " floating point", " compensated summation"], "paper_abstract": "Reproducibility of an experiment is a commonly used metric to determine its validity. Within scientific computing, this can become difficult due to the accumulation of floating point rounding errors in the numerical computation, greatly reducing the accuracy of the computation. Matrix multiplication is particularly susceptible to these rounding errors which is why there exist so many solutions, ranging from simulating extra precision to compensated summation algorithms. These solutions however all suffer from the same problem, abysmal performance when compared against the performance of the original algorithm. Graphics cards are particularly susceptible due to a lack of double precision on all but the most recent generation graphics cards, therefore increasing the accuracy of the precision that is offered becomes paramount. By using our method of selectively applying compensated summation algorithms, we are able to return a whole digit of accuracy on current generation graphics cards and potentially two digits of accuracy on the newly released \"fermi\" architecture. This is all possible with only a 2% drop in performance.", "paper_title": "Improving accuracy for matrix multiplications on GPUs", "paper_id": "WOS:000288322000002"}