{"auto_keywords": [{"score": 0.046737172310030196, "phrase": "minimum_bid_increment"}, {"score": 0.009962443710714461, "phrase": "ebay_proxy_bidding_system"}, {"score": 0.007778829111993926, "phrase": "potential_bidders"}, {"score": 0.00481495049065317, "phrase": "proxy_bidding"}, {"score": 0.0047872135686404275, "phrase": "minimum_bid_increments"}, {"score": 0.004759635663291431, "phrase": "ebay_auctions"}, {"score": 0.004691380685111258, "phrase": "mathematical_model"}, {"score": 0.004650896226390719, "phrase": "ebay_auction_protocol"}, {"score": 0.004597457370802855, "phrase": "detailed_analysis"}, {"score": 0.004427966503146096, "phrase": "auction_properties"}, {"score": 0.004191377834552202, "phrase": "independent_private_valuations"}, {"score": 0.0041074234667687875, "phrase": "optimal_value"}, {"score": 0.00402514392911723, "phrase": "auctioneer's_revenue"}, {"score": 0.003933118499284644, "phrase": "sequential_way"}, {"score": 0.0037121208432871118, "phrase": "bidders'_valuation_distribution"}, {"score": 0.0036377310474678547, "phrase": "visible_bids"}, {"score": 0.003287482882222731, "phrase": "auction_bid_history"}, {"score": 0.0028119023819663472, "phrase": "current_bid"}, {"score": 0.0027395968397212053, "phrase": "highest_valuation"}, {"score": 0.0026384167183586015, "phrase": "appropriate_strategies"}, {"score": 0.002608040688794517, "phrase": "real_world_ebay_auctions"}, {"score": 0.0025117070259621376, "phrase": "effective_strategy"}, {"score": 0.0024756080101497086, "phrase": "incremental_bidding"}, {"score": 0.002432971714608409, "phrase": "common_values"}, {"score": 0.002349884235026956, "phrase": "delayed_bids"}, {"score": 0.0022434880661725493, "phrase": "last-minute_bids"}, {"score": 0.0021049977753042253, "phrase": "first_sniper"}], "paper_keywords": ["Design", " Economics", " Theory", " Online auctions", " electronic commerce", " sniping", " proxy bidding", " bid increment"], "paper_abstract": "We present a mathematical model of the eBay auction protocol and perform a detailed analysis of the effects that the eBay proxy bidding system and the minimum bid increment have on the auction properties. We first consider the revenue of the auction, and we show analytically that when two bidders with independent private valuations use the eBay proxy bidding system there exists an optimal value for the minimum bid increment at which the auctioneer's revenue is maximized. We then consider the sequential way in which bids are placed within the auction, and we show analytically that independent of assumptions regarding the bidders' valuation distribution or bidding strategy the number of visible bids placed is related to the logarithm of the number of potential bidders. Thus, in many cases, it is only a minority of the potential bidders that are able to submit bids and are visible in the auction bid history (despite the fact that the other hidden bidders are still effectively competing for the item). Furthermore, we show through simulation that the minimum bid increment also introduces an inefficiency to the auction, whereby a bidder who enters the auction late may find that its valuation is insufficient to allow them to advance the current bid by the minimum bid increment despite them actually having the highest valuation for the item. Finally, we use these results to consider appropriate strategies for bidders within real world eBay auctions. We show that while last-minute bidding (sniping) is an effective strategy against bidders engaging in incremental bidding (and against those with common values), in general, delaying bidding is disadvantageous even if delayed bids are sure to be received before the auction closes. Thus, when several bidders submit last-minute bids, we show that rather than seeking to bid as late as possible, a bidder should try to be the first sniper to bid (i. e., it should \"snipe before the snipers\").", "paper_title": "The Effects of Proxy Bidding and Minimum Bid Increments within eBay Auctions", "paper_id": "WOS:000207047200003"}