{"auto_keywords": [{"score": 0.03961426292317318, "phrase": "broad_automated_search"}, {"score": 0.00481495049065317, "phrase": "software_engineering_-_a_tertiary_study"}, {"score": 0.0046987973264610685, "phrase": "previous_study"}, {"score": 0.004585433265422727, "phrase": "systematic_literature_review"}, {"score": 0.0044385053213394175, "phrase": "manual_search"}, {"score": 0.004091370602573054, "phrase": "on-going_research"}, {"score": 0.004008897491380646, "phrase": "annotated_catalogue"}, {"score": 0.0039280803011236395, "phrase": "software_engineering_researchers"}, {"score": 0.003562186600028245, "phrase": "time_period"}, {"score": 0.0032700071110068323, "phrase": "original_study"}, {"score": 0.0030017207229983385, "phrase": "undergraduate_educational_curriculum"}, {"score": 0.002941147710077221, "phrase": "possible_interest"}, {"score": 0.0026452734009203764, "phrase": "slr_guidelines"}, {"score": 0.002283984048569816, "phrase": "wide_range"}, {"score": 0.0021571717917276724, "phrase": "primary_study_quality"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Systematic literature review", " Mapping study", " Software engineering", " Tertiary study"], "paper_abstract": "Context: In a previous study, we reported on a systematic literature review (SLR), based on a manual search of 13 journals and conferences undertaken in the period 1st January 2004 to 30th June 2007. Objective: The aim of this on-going research is to provide an annotated catalogue of SLRs available to software engineering researchers and practitioners. This study updates our previous study using a broad automated search. Method: We performed a broad automated search to find SLRs published in the time period 1st January 2004 to 30th June 2008. We contrast the number, quality and source of these SLRs with SLRs found in the original study. Results: Our broad search found an additional 35 SLRs corresponding to 33 unique studies. Of these papers, 17 appeared relevant to the undergraduate educational curriculum and 12 appeared of possible interest to practitioners. The number of SLRs being published is increasing. The quality of papers in conferences and workshops has improved as more researchers use SLR guidelines. Conclusion: SLRs appear to have gone past the stage of being used solely by innovators but cannot yet be considered a main stream software engineering research methodology. They are addressing a wide range of topics but still have limitations, such as often failing to assess primary study quality. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Systematic literature reviews in software engineering - A tertiary study", "paper_id": "WOS:000279035100002"}