{"auto_keywords": [{"score": 0.03892175371495866, "phrase": "cortical_activity"}, {"score": 0.00481495049065317, "phrase": "brain_response"}, {"score": 0.004793023571659453, "phrase": "marketing_stimuli"}, {"score": 0.004717059009507907, "phrase": "eye_tracking"}, {"score": 0.004674189928611835, "phrase": "neuroscience_methods"}, {"score": 0.004621148492564008, "phrase": "human_behavior"}, {"score": 0.004568706193489286, "phrase": "marketing_exchange"}, {"score": 0.0045271792244216645, "phrase": "research_attention"}, {"score": 0.004496280772084575, "phrase": "basic_aim"}, {"score": 0.004305407883549061, "phrase": "consumer_preferences"}, {"score": 0.004256533389293113, "phrase": "physiological_decision_processes"}, {"score": 0.004208211367779452, "phrase": "choice_task"}, {"score": 0.0036776458116294986, "phrase": "different_brain_regions"}, {"score": 0.0033794886824919626, "phrase": "different_cracker"}, {"score": 0.0033334624191202335, "phrase": "product_design"}, {"score": 0.003310684108128973, "phrase": "mutual_information"}, {"score": 0.003273064484342856, "phrase": "commercial_emotiv_epoc_wireless_eeg_headset"}, {"score": 0.003228482948532787, "phrase": "eeg_signals"}, {"score": 0.003169981053307169, "phrase": "tobii-studio_eye_tracker_system"}, {"score": 0.003141127590472328, "phrase": "eeg_data"}, {"score": 0.003119659433566212, "phrase": "specific_choice_options"}, {"score": 0.0029329106584494685, "phrase": "five_principal_frequency_bands"}, {"score": 0.002920685517354072, "phrase": "delta"}, {"score": 0.0028933619595984785, "phrase": "theta"}, {"score": 0.0027197343489967322, "phrase": "clear_phase_synchronization"}, {"score": 0.002701138416482172, "phrase": "left_and_right_frontal"}, {"score": 0.0026704265616705023, "phrase": "interhemispheric_communications"}, {"score": 0.0026521668700162683, "phrase": "chosen_task"}, {"score": 0.0025862736445290088, "phrase": "clear_and_significant_change"}, {"score": 0.002539379289856756, "phrase": "eeg_power_spectral_activities"}, {"score": 0.002163600705898299, "phrase": "buying_decision"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Choice modeling", " Electroencephalogram (EEG)", " Neuromarketing"], "paper_abstract": "Application of neuroscience methods to analyze and understand human behavior related to markets and marketing exchange has recently gained research attention. The basic aim is to guide design and presentation of products to optimize them to be as compatible as possible with consumer preferences. This paper investigates physiological decision processes while participants undertook a choice task designed to elicit preferences for a product. The task required participants to choose their preferred crackers described by shape (square, triangle, round), flavor (wheat, dark rye, plain) and topping (salt, poppy, no topping). The two main research objectives were (1) to observe and evaluate the cortical activity of the different brain regions and the interdependencies among the Electroencephalogram (EEG) signals from these regions; and (2) unlike most research in this area that has focused mainly on liking/disliking certain products, we provide a way to quantify the importance of different cracker features that contribute to the product design based on mutual information. We used the commercial Emotiv EPOC wireless EEG headset with 14 channels to collect EEG signals from participants. We also used a Tobii-Studio eye tracker system to relate the EEG data to the specific choice options (crackers). Subjects were shown 57 choice sets; each choice set described three choice options (crackers). The patterns of cortical activity were obtained in the five principal frequency bands, Delta (0-4 Hz), Theta (3-7 Hz), Alpha (8-12 Hz), Beta (13-30 Hz), and Gamma (30-40 Hz). There was a clear phase synchronization between the left and right frontal and occipital regions indicating interhemispheric communications during the chosen task for the 18 participants. Results also indicated that there was a clear and significant change (p < 0.01) in the EEG power spectral activities taking a place mainly in the frontal (delta, alpha and beta across F3, F4, FC5 and FC6), temporal (alpha, beta, gamma across T7), and occipital (theta, alpha, and beta across 01) regions when participants indicated their preferences for their preferred crackers. Additionally, our mutual information analysis indicated that the various cracker flavors and toppings of the crackers were more important factors affecting the buying decision than the shapes of the crackers. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "Consumer neuroscience: Assessing the brain response to marketing stimuli using electroencephalogram (EEG) and eye tracking", "paper_id": "WOS:000316581300044"}