{"auto_keywords": [{"score": 0.04541556134709071, "phrase": "loinc_codes"}, {"score": 0.029633438850769477, "phrase": "local_codes"}, {"score": 0.005992510048901921, "phrase": "local_institution"}, {"score": 0.005850365269600122, "phrase": "common_characteristics"}, {"score": 0.005815355964384179, "phrase": "unmapped_local_codes"}, {"score": 0.00481495049065317, "phrase": "local_loinc_mapping"}, {"score": 0.004786107405332454, "phrase": "laboratory_tests"}, {"score": 0.004630517016920072, "phrase": "laboratory_loinc"}, {"score": 0.004244040105917499, "phrase": "additional_mappings"}, {"score": 0.004193316635088688, "phrase": "expert_manual_review"}, {"score": 0.0036958398682001015, "phrase": "institutional_review_board"}, {"score": 0.0036188435232325337, "phrase": "deidentified_data"}, {"score": 0.003459191419478298, "phrase": "loinc"}, {"score": 0.0032571885279065126, "phrase": "additional_loinc_mappings"}, {"score": 0.002984990015496695, "phrase": "instance_data"}, {"score": 0.0028532214778379597, "phrase": "arup"}, {"score": 0.0028360962841331634, "phrase": "intermountain"}, {"score": 0.0028106004823927723, "phrase": "regenstrief"}, {"score": 0.0027686143852727156, "phrase": "additional_expert_manual_mapping"}, {"score": 0.0027272537812174365, "phrase": "mapping_rates"}, {"score": 0.002575626245702045, "phrase": "inter-institutional_data_exchange"}, {"score": 0.002353152728035836, "phrase": "token_coverage"}, {"score": 0.002311013816721592, "phrase": "third_institution"}, {"score": 0.002124106476971252, "phrase": "public_discussions"}], "paper_keywords": ["Controlled vocabulary", " LOINC", " evaluation research", " clinical laboratory information systems"], "paper_abstract": "Objectives: We characterized the use of laboratory LOINC (R) codes in three large institutions, focused on the following questions: 1) How many local codes had been voluntarily mapped to LOINC codes by each institution? 2) Could additional mappings be found by expert manual review for any local codes that were not initially mapped to LOINC codes by the local institution? and 3) Are there any common characteristics of unmapped local codes that might explain why some local codes were not mapped to LOINC codes by the local institution? Methods: With Institutional Review Board (IRB) approval, we obtained deidentified data from three large institutions. We calculated the percentage of local codes that have been mapped to LOINC by personnel at each of the institutions. We also analyzed a sample of unmapped local codes to determine whether any additional LOINC mappings could be made and identify common characteristics that might explain why some local codes did not have mappings. Results: Concept type coverage and concept token coverage (volume of instance data covered) of local codes mapped to LOINC codes were 0.44/0.59, 0.78/0.78 and 0.79/0.88 for ARUP, Intermountain, and Regenstrief, respectively. After additional expert manual mapping, the results showed mapping rates of 0.63/0.72, 0.83/0.80 and, 0.88/0.90, respectively. After excluding local codes which were not useful for inter-institutional data exchange, the mapping rates became 0.73/0.79, 0.90/0.99 and 0.93/0.997, respectively. Conclusions: Local codes for two institutions could be mapped to LOINC codes with 99% or better concept token coverage, but mapping for a third institution (a reference laboratory) only achieved 79% concept token coverage. Our research supports the conclusions of others that not all local codes should be assigned LOINC codes. There should also be public discussions to develop more precise rules for when LOINC codes should be assigned", "paper_title": "A Characterization of Local LOINC Mapping for Laboratory Tests in Three Large Institutions", "paper_id": "WOS:000289011300002"}