{"auto_keywords": [{"score": 0.04676225036470504, "phrase": "hashin-shtrikman_bounds"}, {"score": 0.00481495049065317, "phrase": "random_polycrystals"}, {"score": 0.004596779715291598, "phrase": "recent_advances"}, {"score": 0.004189523950071494, "phrase": "randomly_oriented_crystals"}, {"score": 0.003802135020791801, "phrase": "significantly_tighter_constraints"}, {"score": 0.0037543106253910313, "phrase": "average_polycrystal_behavior"}, {"score": 0.0036914757355166966, "phrase": "traditional_voigt_and_reuss_bounds"}, {"score": 0.003660452313567116, "phrase": "self-consistent_estimates"}, {"score": 0.003378385493203297, "phrase": "voigt-reuss-hill_estimates"}, {"score": 0.0032938942910948096, "phrase": "hs_bounds"}, {"score": 0.0030657684627749364, "phrase": "voigt-reuss-hill_estimators"}, {"score": 0.002989073492729061, "phrase": "hashin-shtrikman"}, {"score": 0.00266693888510356, "phrase": "percentage_discrepancies"}, {"score": 0.002556625752785268, "phrase": "effective_shear_modulus"}, {"score": 0.0025137856138000036, "phrase": "bulk_modulus"}, {"score": 0.0023794391656001466, "phrase": "five_distinct_shear-like_modes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Hashin-Shtrikman bounds", " Self-sonsistent estimates", " Elastic constants of random polycrystals"], "paper_abstract": "Recent advances in methods for computing both Hashin-Shtrikman bounds and related self-consistent (i.e., coherent potential approximation, or CPA) estimates of the geomechanical constants for polycrystals composed of randomly oriented crystals have been successfully applied to orthotropic MgSiO3-perovskite, post-perovskite, and some related CaIrO3 analogs. In particular, Hashin-Shtrikman bounds provide significantly tighter constraints on the average polycrystal behavior than do the traditional Voigt and Reuss bounds. Self-consistent estimates of effective bulk and shear moduli always lie inside the Hashin-Shtrikman (HS) bounds, unlike the Voigt-Reuss-Hill estimates which might lie inside the HS bounds for some examples, but more typically lie outside these same HashinShtrikman bounds. The discrepancies observed between Voigt-Reuss-Hill estimators and the self-consistent, geometric mean, or Hashin-Shtrikman estimates are nevertheless often small in the examples treated here, being on the order of about 1 percent or less - for both the effective bulk and shear moduli. Percentage discrepancies are also observed to be typically less for the effective shear modulus than for the bulk modulus. This result presumably follows from the method's implicit averaging over five distinct shear-like modes, including three true shear modes (due to twisting excitations) and two quasi-shear modes related to shearing action of uniaxially applied stress or strain. (C) 2013 Published by Elsevier Inc.", "paper_title": "Computing elastic constants for random polycrystals of orthotropic MgSiO3, related polymorphs, and CaIrO3 analogs", "paper_id": "WOS:000336618800020"}