{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "sas"}, {"score": 0.03435599521257018, "phrase": "derived_variables"}, {"score": 0.03320173622342565, "phrase": "new_program"}, {"score": 0.0047851345246117455, "phrase": "behavioral_analysis"}, {"score": 0.0047653593662286345, "phrase": "electrical_penetration_graph_data"}, {"score": 0.004658040980831187, "phrase": "plant_tissue"}, {"score": 0.004553128404612054, "phrase": "electronic_circuit"}, {"score": 0.0044968982227349625, "phrase": "electrical_penetration_graph"}, {"score": 0.0043955990201697305, "phrase": "voltage_signals"}, {"score": 0.004323356859317444, "phrase": "resulting_waveforms"}, {"score": 0.004261115430873005, "phrase": "specific_stylet_activities"}, {"score": 0.0041478818670853115, "phrase": "different_behaviors"}, {"score": 0.003770743342438053, "phrase": "related_species"}, {"score": 0.0037396098711831795, "phrase": "large_quantity"}, {"score": 0.003587742437283239, "phrase": "oldest_program"}, {"score": 0.003506851152129303, "phrase": "sas-based_statistical_analysis"}, {"score": 0.003434891903231278, "phrase": "recorded_variables"}, {"score": 0.003350480663660326, "phrase": "epg_calc"}, {"score": 0.003161474881435185, "phrase": "statistical_analyses"}, {"score": 0.003128867012433561, "phrase": "ebert"}, {"score": 0.0030646331611910815, "phrase": "diverse_suite"}, {"score": 0.003007953583749394, "phrase": "statistical_analysis"}, {"score": 0.002995500738719643, "phrase": "powerful_mixed-model_anova"}, {"score": 0.0029769177805771124, "phrase": "single_software_platform"}, {"score": 0.0029462012558267863, "phrase": "backus_program"}, {"score": 0.002915800744374658, "phrase": "open_source"}, {"score": 0.0028382152567141784, "phrase": "behavioral_idiosyncrasies"}, {"score": 0.0028206052780047424, "phrase": "particular_study_insect"}, {"score": 0.0027684263985790526, "phrase": "large_experiments"}, {"score": 0.0026394123269500034, "phrase": "new_classification_system"}, {"score": 0.0026284812100712575, "phrase": "five_levels"}, {"score": 0.0025853533975746888, "phrase": "waveform"}, {"score": 0.002335229263627412, "phrase": "analysis_technique"}, {"score": 0.0022825131641434964, "phrase": "supplemental_material"}, {"score": 0.0022125358787611457, "phrase": "epg_methods"}, {"score": 0.0021942395465354503, "phrase": "complex_task"}, {"score": 0.0021670777282518424, "phrase": "vast_quantity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["EPG", " Software", " Electropenetography"], "paper_abstract": "Monitoring feeding behaviors of insects whose piercing-sucking mouthparts are inserted into plant tissue is often done by making the insect part of an electronic circuit, using a technique called Electrical Penetration Graph, or electropenetrography (both abbreviated EPG). Fluctuating voltage signals in the circuit are graphed, and resulting waveforms are interpreted by a researcher as specific stylet activities. After measurement of waveforms, data consist of a list of different behaviors and associated durations. These data are further processed to yield hundreds of variables that are compiled and statistically analyzed prior to publication. The goal of this study was to develop a program to make this process more efficient for studies of aphids and related species, given the large quantity of data expected to be generated. Herein, the three major existing programs that perform this function are reviewed. The oldest program (Backus 1.0) both compiles data and calculates a SAS-based statistical analysis; however it only works with the original, recorded variables and is not tailored to aphid studies. The other programs (EPG Calc and the Sarria Excel (R) workbook) compile a more diverse suite of derived variables suitable for aphids than does Backus 1.0; however, they do not include statistical analyses. A new program (Ebert 1.0) introduced herein uses SAS to calculate the diverse suite of derived variables for aphids, and also provides statistical analysis via powerful mixed-model ANOVA using a single software platform, similar to the Backus program. The code is open source, so that any researcher can adapt this program to deal with behavioral idiosyncrasies of a particular study insect. The new program will be especially valuable for large experiments with many insect subjects. The Backus 1.0 system for classifying variables required some modification in. order to deal with all the derived variables for aphids. The new classification system has five levels: Cohort, Insect, Probe, Waveform, and Event. Within each of these levels, variables can be sequential or non-sequential, and these are further subdivided into conditional and non-conditional. These changes will facilitate design of more complex experiments in the future, and the ultimate adaptation of this analysis technique designed around aphids for use with other organisms. There is supplemental material included with the manuscript to assist with understanding the nature of data generated using EPG methods, and the complex task of extracting knowledge from a vast quantity of data generated by these experiments. (C) 2015 Published by Elsevier B.V.", "paper_title": "A new SAS program for behavioral analysis of electrical penetration graph data", "paper_id": "WOS:000359887500009"}