{"auto_keywords": [{"score": 0.034238075909053485, "phrase": "li_ion"}, {"score": 0.015722606285233476, "phrase": "ic"}, {"score": 0.011017348977105776, "phrase": "fc"}, {"score": 0.004765173195920904, "phrase": "nested_hysteretic_control"}, {"score": 0.004618893461411858, "phrase": "microscale_dimensions"}, {"score": 0.004141238989360548, "phrase": "fuel_cells"}, {"score": 0.003993216345115755, "phrase": "li_ions"}, {"score": 0.0029072537537959374, "phrase": "excess_power"}, {"score": 0.0028325548627901004, "phrase": "light_loads"}, {"score": 0.002674885993329912, "phrase": "fabricated_prototype"}, {"score": 0.0021493248730171132, "phrase": "lossy_sense_resistors"}, {"score": 0.0021049977753042253, "phrase": "sense_fets"}], "paper_keywords": ["Single inductor", " Hybrid source", " Switching converter IC", " Fuel cell", " Hysteretic control"], "paper_abstract": "Microsystems must conform to microscale dimensions, store sufficient energy to last extended periods, and supply enough power to sustain, among others, wireless and sensor functions. Because batteries source moderate power with low energy densities, miniaturized devices benefit from deriving energy from fuel cells (FCs) and power from Li ions, rather than relying on one source and over-sizing it to offset its deficiency. This article presents a single-inductor, dual-input, dual-output (SIDIDO) charger-supply 0.5-mu m CMOS IC with a nested hysteretic-control scheme that draws energy from a FC and conditions power to charge a Li ion and supply a 1-V, 1-mA load. The IC dynamically adjusts to the load, charging the Li ion with excess power from the FC during light loads and supplying power from both the FC and Li ion otherwise. The fabricated prototype regulated its output to 1 V within 2.5% and responded to rising and falling 0.1-1-mA load dumps within 30 mu s and 50 mV. The efficiency peaked at 32% because the load was low and the converter operated in continuous (rather than in discontinuous) conduction and sensed its inductor current via lossy sense resistors (instead of sense FETs) to manage risk and validate functionality.", "paper_title": "Single-inductor fuel cell-Li ion charger-supply IC with nested hysteretic control", "paper_id": "WOS:000298604100003"}