{"auto_keywords": [{"score": 0.04978573858550203, "phrase": "large_rna_molecules"}, {"score": 0.0046407174174471644, "phrase": "rna_secondary_structure"}, {"score": 0.004431725879033857, "phrase": "rna_function_analysis"}, {"score": 0.004245130986749751, "phrase": "cycle_decomposition"}, {"score": 0.004219121035447185, "phrase": "fragment_assembly"}, {"score": 0.004193269776221305, "phrase": "molecular_dynamics_simulations"}, {"score": 0.004066360459825868, "phrase": "small_rnas"}, {"score": 0.0037195507046380036, "phrase": "energetic_contribution"}, {"score": 0.00369674903275185, "phrase": "secondary_structure_interactions"}, {"score": 0.0035848128208966403, "phrase": "non-canonical_interactions"}, {"score": 0.0035301176972299627, "phrase": "tertiary_structure"}, {"score": 0.003412697981624197, "phrase": "complete_rna_tertiary_structure_energy_model"}, {"score": 0.00328903890761552, "phrase": "non-canonical_base_pairings"}, {"score": 0.003121462741365354, "phrase": "robust_rna_tertiary_structure_predictors"}, {"score": 0.002890367960684987, "phrase": "rna_secondary_structure_prediction"}, {"score": 0.0028200832328369816, "phrase": "novel_local_motif_information"}, {"score": 0.002759983642011259, "phrase": "integer_programming_framework"}, {"score": 0.0027178389866989775, "phrase": "secondary_structures"}, {"score": 0.002684585839646811, "phrase": "incorrect_canonical_base_pairs"}, {"score": 0.002224966726830651, "phrase": "canonical_base_pair_predictions"}, {"score": 0.002177522137110944, "phrase": "best_secondary_structures"}, {"score": 0.002144252482711611, "phrase": "suboptimal_structures"}], "paper_keywords": [""], "paper_abstract": "Motivation: The prediction of RNA 3D structures from its sequence only is a milestone to RNA function analysis and prediction. In recent years, many methods addressed this challenge, ranging from cycle decomposition and fragment assembly to molecular dynamics simulations. However, their predictions remain fragile and limited to small RNAs. To expand the range and accuracy of these techniques, we need to develop algorithms that will enable to use all the structural information available. In particular, the energetic contribution of secondary structure interactions is now well documented, but the quantification of non-canonical interactions-those shaping the tertiary structure-is poorly understood. Nonetheless, even if a complete RNA tertiary structure energy model is currently unavailable, we now have catalogues of local 3D structural motifs including non-canonical base pairings. A practical objective is thus to develop techniques enabling us to use this knowledge for robust RNA tertiary structure predictors. Results: In this work, we introduce , a program that benefits from the progresses made over the last 30 years in the field of RNA secondary structure prediction and expands these methods to incorporate the novel local motif information available in databases. Using an integer programming framework, our method refines predicted secondary structures (i.e. removes incorrect canonical base pairs) to accommodate the insertion of RNA 3D motifs (i.e. hairpins, internal loops and k-way junctions). Then, we use predictions as templates to generate complete 3D structures with the program. We benchmarked on a set of 9 RNAs with sizes varying from 53 to 128 nucleotides. We show that our approach (i) improves the accuracy of canonical base pair predictions; (ii) identifies the best secondary structures in a pool of suboptimal structures; and (iii) predicts accurate 3D structures of large RNA molecules.", "paper_title": "Towards 3D structure prediction of large RNA molecules: an integer programming framework to insert local 3D motifs in RNA secondary structure", "paper_id": "WOS:000305419800026"}