{"auto_keywords": [{"score": 0.045965832953546316, "phrase": "collaborative_knowledge_construction"}, {"score": 0.012591891290264445, "phrase": "written_products"}, {"score": 0.00481495049065317, "phrase": "collaborative_writing"}, {"score": 0.004720043307726269, "phrase": "knowledge_construction"}, {"score": 0.004673290248999786, "phrase": "cscl_environments"}, {"score": 0.003984968827278219, "phrase": "six_small_groups"}, {"score": 0.003945467978172845, "phrase": "university_students"}, {"score": 0.0037913267098534887, "phrase": "cscl_environment"}, {"score": 0.0036250779580069455, "phrase": "identified_writing_strategies"}, {"score": 0.0032324864013225166, "phrase": "learning_results"}, {"score": 0.003075296862372287, "phrase": "multiple-case_study"}, {"score": 0.00256993314099902, "phrase": "five_types"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Computer-mediated communication", " Cooperative/collaborative learning", " Pedagogical issues", " Post-secondary education", " Teaching/learning strategies"], "paper_abstract": "Within the framework of research that describes the processes of collaborative knowledge construction in computer-supported collaborative learning (CSCL) environments, the present work has three objectives: (i) the identification of the strategies of six small groups of university students for the elaboration of written products in a CSCL environment: (ii) seek relations between the identified writing strategies and the processes and phases of collaborative knowledge construction in the groups; and (iii) relate these strategies and phases with the learning results obtained by the groups. We carried out a multiple-case study, with the analysis of four different didactic sequences, in two different virtual learning and teaching settings. In each setting, three student groups were studied, where each had to collaboratively develop between four and eight written products. For all the studied groups, the analysis enabled the identification of five types of strategies in the preparation of the elaboration of written products, and four types of phases of collaborative knowledge construction, which are interrelated and also connected with the grades that the groups obtained in each case. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Strategies for collaborative writing and phases of knowledge construction in CSCL environments", "paper_id": "WOS:000271297200024"}