{"auto_keywords": [{"score": 0.006493809914933491, "phrase": "authenticated_channel"}, {"score": 0.00481495049065317, "phrase": "interactive-collision_resistant_hash_functions"}, {"score": 0.004706305193222972, "phrase": "interactive_message_authentication_protocol"}, {"score": 0.004663534771602591, "phrase": "imap"}, {"score": 0.004537525607322823, "phrase": "insecure_broadband_channel"}, {"score": 0.004475798524102238, "phrase": "authenticated_narrow-band_channel"}, {"score": 0.004276016541197123, "phrase": "ad_hoc_networks"}, {"score": 0.003956558420993431, "phrase": "public-key_infrastructure"}, {"score": 0.003711409222544974, "phrase": "interactive-collision_resistant"}, {"score": 0.0035294580355761506, "phrase": "hash_function_security"}, {"score": 0.003418327319110734, "phrase": "computational_assumption"}, {"score": 0.0033872210664940817, "phrase": "icr_hash_functions"}, {"score": 0.0032805541677236325, "phrase": "message_authentication_protocols"}, {"score": 0.0032064196784562017, "phrase": "computational_assumptions"}, {"score": 0.002493333098814506, "phrase": "existing_protocols"}, {"score": 0.0023818288346547692, "phrase": "simple_structure"}, {"score": 0.0021049977753042253, "phrase": "real_world_ad_hoc_network_scenarios"}], "paper_keywords": ["Two-channel cryptography", " Authenticated channel", " Message authentication", " Hash functions"], "paper_abstract": "We propose an Interactive Message Authentication Protocol (IMAP) using two channels; an insecure broadband channel and an authenticated narrow-band channel. We consider the problem in the context of ad hoc networks, where it is assumed that there is neither a secret key shared among the two parties, nor a public-key infrastructure in place. The security of our IMAP is based on the existence of Interactive-Collision Resistant (ICR) hash functions, a new notion of hash function security. Our IMAP is based on the computational assumption that ICR hash functions exist. It performs better than message authentication protocols that are based on computational assumptions. That is, while achieving the same level of security, the amount of information sent over the authenticated channel in our IMAP is smaller than the most secure IMAP and Non-interactive Message Authentication Protocol (NIMAP) in the literature. In other words, if we send the same amount of information over the authenticated channel, we can allow much stronger adversaries compared to the existing protocols in the literature. Moreover, our IMAP benefits from a simple structure and works under fewer security assumptions compared to other IMAPs in the literature. The efficient and easy-to-use structure of our IMAP makes it very practical in real world ad hoc network scenarios.", "paper_title": "Interactive two-channel message authentication based on Interactive-Collision Resistant hash functions", "paper_id": "WOS:000262672400005"}