{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "mechanical_properties"}, {"score": 0.015564784465999947, "phrase": "galvanized_steel_coils"}, {"score": 0.015183999529757911, "phrase": "steel_coils"}, {"score": 0.0076796450859353636, "phrase": "steel_grade"}, {"score": 0.004488946121663966, "phrase": "galvanizing_process"}, {"score": 0.004184921610672245, "phrase": "customer's_purpose"}, {"score": 0.003901407184706592, "phrase": "unfriendly_effects"}, {"score": 0.0036370297611938796, "phrase": "comparative_assessment"}, {"score": 0.0035827424231607784, "phrase": "different_techniques"}, {"score": 0.0033231814056233103, "phrase": "hot_dip"}, {"score": 0.0027327327233891865, "phrase": "valuable_information"}, {"score": 0.0022696277881969896, "phrase": "models'_predictions"}], "paper_keywords": ["Mechanical properties of steel coils", " Neuronal networks", " Artificial intelligence", " Tensile strength", " Yield strength", " Elongation"], "paper_abstract": "The mechanical properties of steel coils can be predicted prior to the galvanizing process, thereby preventing the production of galvanized steel coils that are not suitable for the customer's purpose. At the same time, this will reduce the waste of zinc and unfriendly effects on the environment. The purpose of this paper is to present a comparative assessment of the different techniques currently being used to estimate the mechanical properties of steel coils before being processed on the hot dip galvanizing line (HDGL). The authors have evaluated the models established by linear and non-linear, bagging and other more aggregated construction techniques. Using a total of 30 models, predictions were made for each parameter in order to obtain valuable information about the capabilities of these models and techniques. Each model was tested against each data set ten times. Also, models were constructed to determine the relevance of steel grade to the accuracy of the models' predictions by excluding from the models any consideration of steel grade. As a result of our tests of these models, it is possible to recommend the model to choose for each parameter.", "paper_title": "Comparison of models created for the prediction of the mechanical properties of galvanized steel coils", "paper_id": "WOS:000279714600006"}