{"auto_keywords": [{"score": 0.04571987602961178, "phrase": "usability_measures"}, {"score": 0.00481495049065317, "phrase": "usability_studies"}, {"score": 0.00463507149599759, "phrase": "important_question"}, {"score": 0.00459990650330792, "phrase": "hci_research_and_user_interface_evaluation"}, {"score": 0.004295136518467118, "phrase": "core_hci_journals"}, {"score": 0.0034697573205392887, "phrase": "valid_and_reliable_account"}, {"score": 0.003327253821888569, "phrase": "user_interface"}, {"score": 0.00293380698353469, "phrase": "subjective_and_objective_measures"}, {"score": 0.002739121808942775, "phrase": "long-term_use"}, {"score": 0.002636587060621144, "phrase": "post-use_questionnaires"}, {"score": 0.002547583216040341, "phrase": "subjective_satisfaction_questionnaires"}, {"score": 0.0023784664152543696, "phrase": "micro_and_macro_tasks"}, {"score": 0.0021537671245615286, "phrase": "usability_research"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["usability", " user-centered design", " Usability Engineering"], "paper_abstract": "How to measure usability is an important question in HCI research and user interface evaluation. We review current practice in measuring usability by categorizing and discussing usability measures from 180 studies published in core HCI journals and proceedings. The discussion distinguish several problems with the measures, including whether they actually measure usability, if they cover usability broadly, how they are reasoned about, and if they meet recommendations on how to measure usability. In many studies, the choice of and reasoning about usability measures fall short of a valid and reliable account of usability as quality-in-use of the user interface being studied. Based on the review, we discuss challenges for studies of usability and for research into how to measure usability. The challenges are to distinguish and empirically compare subjective and objective measures of usability; to focus on developing and employing measures of learning and retention; to study long-term use and usability; to extend measures of satisfaction beyond post-use questionnaires; to validate and standardize the host of subjective satisfaction questionnaires used; to study correlations between usability measures as a means for validation; and to use both micro and macro tasks and corresponding measures of usability. In conclusion, we argue that increased attention to the problems identified and challenges discussed may strengthen studies of usability and usability research. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Current practice in measuring usability: Challenges to usability studies and research", "paper_id": "WOS:000234658400002"}