{"auto_keywords": [{"score": 0.028063554153571906, "phrase": "udonc"}, {"score": 0.015547084727554788, "phrase": "protein_domains"}, {"score": 0.01498501425917591, "phrase": "essential_proteins"}, {"score": 0.00481495049065317, "phrase": "identifying_essential_proteins"}, {"score": 0.004486212539464774, "phrase": "organism's_survival"}, {"score": 0.004419904580451831, "phrase": "disease_analysis"}, {"score": 0.004387117409226736, "phrase": "drug_design"}, {"score": 0.004258372598568333, "phrase": "cellular_life"}, {"score": 0.004179824713643488, "phrase": "prediction_methods"}, {"score": 0.00399714680711765, "phrase": "network_topology"}, {"score": 0.0038224221344037236, "phrase": "available_protein-protein_interaction"}, {"score": 0.003696390664266446, "phrase": "network_accuracy"}, {"score": 0.003587842947046177, "phrase": "computational_methods"}, {"score": 0.002815864555488112, "phrase": "new_prediction_method"}, {"score": 0.0027331033178323145, "phrase": "domain_features"}, {"score": 0.0026726283357752585, "phrase": "ppi_network"}, {"score": 0.002398627220761343, "phrase": "edge_clustering_coefficient"}, {"score": 0.0023719332915829268, "phrase": "experimental_results"}, {"score": 0.002354302193867031, "phrase": "s._cerevisiae_data"}, {"score": 0.0021049977753042253, "phrase": "e._coli"}], "paper_keywords": ["Essential proteins", " protein domain", " protein-protein interaction networks"], "paper_abstract": "Prediction of essential proteins which are crucial to an organism's survival is important for disease analysis and drug design, as well as the understanding of cellular life. The majority of prediction methods infer the possibility of proteins to be essential by using the network topology. However, these methods are limited to the completeness of available protein-protein interaction (PPI) data and depend on the network accuracy. To overcome these limitations, some computational methods have been proposed. However, seldom of them solve this problem by taking consideration of protein domains. In this work, we first analyze the correlation between the essentiality of proteins and their domain features based on data of 13 species. We find that the proteins containing more protein domain types which rarely occur in other proteins tend to be essential. Accordingly, we propose a new prediction method, named UDoNC, by combining the domain features of proteins with their topological properties in PPI network. In UDoNC, the essentiality of proteins is decided by the number and the frequency of their protein domain types, as well as the essentiality of their adjacent edges measured by edge clustering coefficient. The experimental results on S. cerevisiae data show that UDoNC outperforms other existing methods in terms of area under the curve (AUC). Additionally, UDoNC can also perform well in predicting essential proteins on data of E. coli.", "paper_title": "UDoNC: An Algorithm for Identifying Essential Proteins Based on Protein Domains and Protein-Protein Interaction Networks", "paper_id": "WOS:000352788300004"}