{"auto_keywords": [{"score": 0.04453308932307293, "phrase": "system-level_assertion_language"}, {"score": 0.04340746694588784, "phrase": "system-level_assertions"}, {"score": 0.00481495049065317, "phrase": "system-level_design"}, {"score": 0.00458940888106061, "phrase": "assertion-based_verification_methodology"}, {"score": 0.003995226376780718, "phrase": "current_state"}, {"score": 0.0034963129868796033, "phrase": "system-level_synthesis_process"}, {"score": 0.003261934055562238, "phrase": "synthesized_assertions"}, {"score": 0.002869613770219469, "phrase": "system_manufacturing"}, {"score": 0.0026205405415623525, "phrase": "run-time_verification"}, {"score": 0.002393034183276193, "phrase": "corresponding_synthesis_method"}, {"score": 0.0022444104439449737, "phrase": "system-level_design_methodology"}, {"score": 0.002196944917134202, "phrase": "assertion_types"}, {"score": 0.0021735890994119757, "phrase": "synthesis_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["assertion-based verification", " system-level assertion", " system-level verification", " system-level design"], "paper_abstract": "In this paper, we integrate an assertion-based verification methodology with our object-oriented system-level synthesis methodology to address the problem of HW/SW co-verification. In this direction a system-level assertion language is defined. The system-level assertions can be used to monitor the current state of system or flow of transactions. These assertions are automatically converted to \"monitor hardware\" or \"monitor software\" during the system-level synthesis process depending on their type and also synthesis style of their corresponding functions. The synthesized assertions are functionally equivalent to their original system-level assertions, and hence, can be reused to verify the system after HW/SW synthesis and also at run-time after system manufacturing. This way, not only system-level assertions are reused in lower-levels of abstraction, but also run-time verification of system is provided. In this paper, we describe the system-level assertion language and explain the corresponding synthesis method in our object-oriented system-level synthesis methodology; however the concept can be applied to any system-level design methodology with modifications to assertion types and synthesis method. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "An assertion-based verification methodology for system-level design", "paper_id": "WOS:000247525200004"}