{"auto_keywords": [{"score": 0.033276203505694456, "phrase": "shortcut_actions"}, {"score": 0.008224066200524374, "phrase": "input_device"}, {"score": 0.0051270993808719585, "phrase": "context_sensitive_stylus"}, {"score": 0.00481495049065317, "phrase": "hand_motions"}, {"score": 0.004462892860919036, "phrase": "creative_activities"}, {"score": 0.003902992784453769, "phrase": "system_usability"}, {"score": 0.0030932495918679285, "phrase": "interaction_techniques"}, {"score": 0.0029447150254434842, "phrase": "user's_hand_motions"}, {"score": 0.002621297299343551, "phrase": "conventional_stylus"}, {"score": 0.0025632898741546556, "phrase": "application_programs"}, {"score": 0.0021049977753042253, "phrase": "conventional_menu_operations"}], "paper_keywords": ["human-computer interaction", " pen-based interface", " menu presentation", " hand motions"], "paper_abstract": "A system which employs a stylus as an input device is suitable for creative activities like writing and painting. However, such a system does not always provide the user with a GUI that is easy to operate using the stylus. In addition, system usability is diminished because the stylus is not always integrated into the system in a way that takes into consideration the features of a pen. The purpose of our research is to improve the usability of a system which uses a stylus as an input device. We propose shortcut actions, which are interaction techniques for operation with a stylus that are controlled through a user's hand motions made in the air. We developed the Context Sensitive Stylus as a device to implement the shortcut actions. The Context Sensitive Stylus consists of an accelerometer and a conventional stylus. We also developed application programs to which we applied the shortcut actions; e.g., a drawing tool, a scroll supporting tool, and so on. Results from our evaluation of the shortcut actions indicate that users can concentrate better on their work when using the shortcut actions than when using conventional menu operations.", "paper_title": "Pen-Based Interface Using Hand Motions in the Air", "paper_id": "WOS:000261359100013"}