{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "area-proportional_euler_diagrams"}, {"score": 0.00443308765153716, "phrase": "medical_experiments"}, {"score": 0.004392565073466714, "phrase": "business_data"}, {"score": 0.004253618550301311, "phrase": "statistical_results"}, {"score": 0.004157058883925715, "phrase": "interlinking_curves"}, {"score": 0.0039341294012600085, "phrase": "exact_area-proportional_diagrams"}, {"score": 0.0038271712887391015, "phrase": "limited_success"}, {"score": 0.0037402558657576124, "phrase": "diagram_accuracy"}, {"score": 0.0036218682585355895, "phrase": "small_number"}, {"score": 0.0033190180867511605, "phrase": "euler_diagrams"}, {"score": 0.003027462227648001, "phrase": "zero_value"}, {"score": 0.002825681384008326, "phrase": "area-proportional_manner"}, {"score": 0.002673957615079041, "phrase": "convex_polygons"}, {"score": 0.0023400004981080818, "phrase": "nonconvex_curves"}, {"score": 0.002265833357217618, "phrase": "appropriate_diagram"}, {"score": 0.0022450768409733807, "phrase": "nonconvex_polygons"}], "paper_keywords": ["Information visualization", " Venn diagrams", " Euler diagrams"], "paper_abstract": "Area-proportional Euler diagrams representing three sets are commonly used to visualize the results of medical experiments, business data, and information from other applications where statistical results are best shown using interlinking curves. Currently, there is no tool that will reliably visualize exact area-proportional diagrams for up to three sets. Limited success, in terms of diagram accuracy, has been achieved for a small number of cases, such as Venn-2 and Venn-3 where all intersections between the sets must be represented. Euler diagrams do not have to include all intersections and so permit the visualization of cases where some intersections have a zero value. This paper describes a general, implemented, method for visualizing all 40 Euler-3 diagrams in an area-proportional manner. We provide techniques for generating the curves with circles and convex polygons, analyze the drawability of data with these shapes, and give a mechanism for deciding whether such data can be drawn with circles. For the cases where nonconvex curves are necessary, our method draws an appropriate diagram using nonconvex polygons. Thus, we are now always able to automatically visualize data for up to three sets.", "paper_title": "Drawing Area-Proportional Euler Diagrams Representing Up To Three Sets", "paper_id": "WOS:000327960700007"}