{"auto_keywords": [{"score": 0.03596079974445423, "phrase": "proposed_methods"}, {"score": 0.0297929811154668, "phrase": "aes"}, {"score": 0.029419541077142855, "phrase": "ctr_mode"}, {"score": 0.00481495049065317, "phrase": "ultra-high_throughput"}, {"score": 0.004692227830462433, "phrase": "aes_algorithm"}, {"score": 0.004652016085325825, "phrase": "fpga._aes"}, {"score": 0.004612147352416241, "phrase": "advanced_encryption_standard"}, {"score": 0.004305203085016233, "phrase": "main_block"}, {"score": 0.004268298304952917, "phrase": "aes."}, {"score": 0.003899269293218826, "phrase": "efficient_methods"}, {"score": 0.003767203575060969, "phrase": "area-delay_efficient_multipliers"}, {"score": 0.003267925215811654, "phrase": "optimal_placements"}, {"score": 0.00306334226516593, "phrase": "previous_works"}, {"score": 0.0028591794224116225, "phrase": "ecb"}, {"score": 0.002703327151461985, "phrase": "ecb_mode"}, {"score": 0.00253400005142168, "phrase": "maximum_operational_frequencies"}, {"score": 0.002427035025924384, "phrase": "best_previous_works"}, {"score": 0.002375253757224999, "phrase": "data_throughput"}, {"score": 0.0021789194955896124, "phrase": "maximum_operational_frequency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Advanced encryption standard", " Loop-unrolling", " Pipelining", " Finite field", " High throughput", " FPGA"], "paper_abstract": "AES (Advanced Encryption Standard) is one of the most popular symmetric key encryption algorithms. S-box (Substitution block) is main block in AES. In contrast to many previous works which have employed only one of memory or non-memory based approaches to implement S-box, we propose efficient methods by combining these approaches. We perform area-delay efficient multipliers and multiplicative inverters in GF(2(8)). We employ loop-unrolling, fully pipelining, and sub-pipelining techniques in all proposed methods. Moreover, we insert registers of pipelining in optimal placements. These reasons demonstrate that proposed methods not only try to keep the advantages of previous works but also try to decrease their disadvantages. By using above techniques, we propose three high-throughput AES implementations in ECB mode and one ultra-high throughput AES implementation in CTR mode. Our AES implementations in ECB mode using Xilinx Virtex-5 (XC5VLX85-FF676-3) and Virtex-6 (XC6VLX240T-FF784-3) FPGAs achieve high throughputs of 82.4 Gbps and 102.9 Gbps and maximum operational frequencies of 644.33 MHz and 803.98 MHz respectively. Compared to the best previous works, these implementations improve data throughput by 11.85% and 71.7%. Our AES implementation in CTR mode on Xilinx Virtex-6 (XC6VLX240T-FF784-3) FPGA achieves a high throughput of 260.15 Gbps and maximum operational frequency of 508.104 MHz. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "An ultra-high throughput and fully pipelined implementation of AES algorithm on FPGA", "paper_id": "WOS:000361924000005"}