{"auto_keywords": [{"score": 0.050078515420922065, "phrase": "nonparallel_plane_support_vector_machine_classification"}, {"score": 0.047486381766786614, "phrase": "input_features"}, {"score": 0.04317178311678341, "phrase": "twsvm"}, {"score": 0.036472550633710576, "phrase": "lstsvm"}, {"score": 0.03403035236816381, "phrase": "strong_feature_suppression"}, {"score": 0.004429843269641979, "phrase": "svm"}, {"score": 0.004325208730208653, "phrase": "primal_problem"}, {"score": 0.004290969772225093, "phrase": "nonparallel_plane"}, {"score": 0.004240116703465252, "phrase": "generalized_proximal_support_vector_machine"}, {"score": 0.004074901471704325, "phrase": "least_squares_twin_support_vector_machine"}, {"score": 0.0034895911869254146, "phrase": "feature_selection_method"}, {"score": 0.0031592690527974285, "phrase": "tikhonov_regularization_term"}, {"score": 0.0027815466400771768, "phrase": "twsvm._flstsvm"}, {"score": 0.002599560451267203, "phrase": "linear_case"}, {"score": 0.002558495760339272, "phrase": "nonlinear_classifier"}, {"score": 0.002279508335630797, "phrase": "newton_method_for_linear_programming_svm"}, {"score": 0.0022614266476954467, "phrase": "nlpsvm"}, {"score": 0.0022345720876241044, "phrase": "lpnewton"}, {"score": 0.0021559025985688255, "phrase": "public_data_sets"}], "paper_keywords": ["LSTSVM", " FLSTSVM", " regularization term", " feature selection", " kernel functions"], "paper_abstract": "Over the past decades, 1-norm techniques based on algorithms are widely used to suppress input features. Quite different from traditional 1-norm support vector machine (SVM), direct 1-norm optimization based on the primal problem of nonparallel plane classifiers like generalized proximal support vector machine, twin support vector machine (TWSVM) and least squares twin support vector machine (LSTSVM) are not capable of generating very sparse solutions that are vital for classification and can make them easier to store and faster to compute. To address the issue, in this paper, we develop a feature selection method for LSTSVM, called a feature selection method for nonparallel plane support vector machine classification (FLSTSVM), which is specially designed for strong feature suppression. We incorporate a Tikhonov regularization term to the objective of LSTSVM, and then minimize its 1-norm measure. Solution of FLSTSVM can follow directly from solving two smaller quadratic programming problems (QPPs) arising from two primal QPPs as opposed to two dual ones in TWSVM. FLSTSVM is capable of generating very sparse solutions. This means that FLSTSVM can reduce input features, for the linear case. When a nonlinear classifier is used, few kernel functions determine the classifier. In addition to having strong feature suppression, the edge of our method still lies in its faster computing time compared to that of TWSVM, Newton Method for Linear Programming SVM (NLPSVM) and LPNewton. Lastly, this algorithm is compared on public data sets, as well as an Exclusive Or (XOR) example.", "paper_title": "A feature selection method for nonparallel plane support vector machine classification", "paper_id": "WOS:000305294600003"}