{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multi-modal_documents"}, {"score": 0.011414951397740318, "phrase": "different_modalities"}, {"score": 0.004608730887154718, "phrase": "true_order"}, {"score": 0.004533685795068016, "phrase": "initial_search_results"}, {"score": 0.004484332781147261, "phrase": "traditional_reranking_approaches"}, {"score": 0.00441130431691048, "phrase": "great_success"}, {"score": 0.004363277689798392, "phrase": "uni-modal_document_retrieval"}, {"score": 0.0037636590459094762, "phrase": "multiple_modalities"}, {"score": 0.0035435867326548665, "phrase": "diverse_features"}, {"score": 0.0030064251340251196, "phrase": "pairwise_relations"}, {"score": 0.0028460640294160383, "phrase": "information_loss"}, {"score": 0.002709045632654716, "phrase": "adaptive_multi-modal_multi-view"}, {"score": 0.0024011766029754006, "phrase": "feature_views"}, {"score": 0.002285527382381719, "phrase": "complex_relations"}], "paper_keywords": ["Information reranking", " Adaptive ranking", " Multi-modal multi-view search"], "paper_abstract": "Information reranking aims to recover the true order of the initial search results. Traditional reranking approaches have achieved great success in uni-modal document retrieval. They, however, suffer from the following limitations when reranking multi-modal documents: (1) they are unable to capture and model the relations among multiple modalities within the same document; (2) they usually concatenate diverse features extracted from different modalities into one single vector, rather than adaptively fusing them by considering their discriminative capabilities with respect to the given query; and (3) most of them consider the pairwise relations among documents but discard their higher-order grouping relations, which leads to information loss. Towards this end, we propose an adaptive multi-modal multi-view (aMM) reranking model. This model is able to jointly regularize the relatedness among modalities, the effects of feature views extracted from different modalities, as well as the complex relations among multi-modal documents. Extensive experiments on three datasets well validated the effectiveness and robustness of our proposed model.", "paper_title": "aMM: Towards adaptive ranking of multi-modal documents", "paper_id": "WOS:000363896500001"}