{"auto_keywords": [{"score": 0.04616293897139308, "phrase": "dialogue_games"}, {"score": 0.010612387000973441, "phrase": "agents'_uncertainty"}, {"score": 0.007264768847156863, "phrase": "dialogue_step"}, {"score": 0.006395653651361019, "phrase": "uncertainty_index"}, {"score": 0.006332027505113916, "phrase": "right_move"}, {"score": 0.0062221915395414985, "phrase": "shannon_entropy"}, {"score": 0.004790902617513584, "phrase": "argumentation-based_negotiation_dialogue_games"}, {"score": 0.004684157900507474, "phrase": "widely_used_technology"}, {"score": 0.004660760200881184, "phrase": "everyday_life"}, {"score": 0.004477718654553423, "phrase": "joint_activity"}, {"score": 0.004345149964724958, "phrase": "communication_rules"}, {"score": 0.004184921610672245, "phrase": "important_problem"}, {"score": 0.003940706575253453, "phrase": "particular_type"}, {"score": 0.003901407184706592, "phrase": "namely_argumentation-based_negotiation"}, {"score": 0.0033735490732324713, "phrase": "exchanged_arguments"}, {"score": 0.003240895431893266, "phrase": "better_decisions"}, {"score": 0.00312125905377088, "phrase": "new_set"}, {"score": 0.0031056437850836326, "phrase": "uncertainty_measures"}, {"score": 0.0030901063954739375, "phrase": "negotiation_dialogue_games"}, {"score": 0.003066945490483524, "phrase": "external_agent's_point"}, {"score": 0.0026055251533586804, "phrase": "participating_agents"}, {"score": 0.0025665946848367695, "phrase": "whole_dialogue"}, {"score": 0.0023864566654035924, "phrase": "possible_dialogues"}, {"score": 0.002362620540317279, "phrase": "general_formula"}, {"score": 0.0023390219342052623, "phrase": "type_ills"}, {"score": 0.0023214774334744713, "phrase": "uncertainty_degree"}, {"score": 0.0022022878843247257, "phrase": "new_classification"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Dialogue games", " Argumentation-based negotiation", " Uncertainty"], "paper_abstract": "Nowadays, multiagent systems have become a widely used technology in everyday life, and many authors have adopted the view of communication or interaction between agents as a joint activity regulated by means of dialogue games. Dialogue games are a set of communication rules that agents can combine in their complex interactions. In these games, uncertainty is an important problem that each agent faces when making decisions, especially in the absence of enough information. This paper focuses on the uncertainty in a particular type of dialogue games, namely argumentation-based negotiation. There exist several proposals on this type of dialogue games in the literature, and most of them are concerned with proposing protocols to show how agents can communicate with each other, and how arguments and offers can be generated, evaluated and exchanged. Nevertheless, none of them is directly targeting the agents' uncertainty about the exchanged arguments and how this uncertainty could be measured at each dialogue step to assist those agents make better decisions. The aim of this paper is to tackle this problem by defining a new set of uncertainty measures in negotiation dialogue games from an external agent's point of view. In particular, we introduce two types of uncertainty: Type I and Type II. Type I is about the uncertainty index of playing the right move. For this, we use Shannon entropy to measure: (i) the uncertainty index of the agent that he is selecting the right move at each dialogue step; and (ii) the uncertainty index of participating agents in the negotiation about the whole dialogue. This is done in two different ways; the first is by taking the average of the uncertainty index of all moves, and the second is by determining all possible dialogues and applying the general formula of Shannon entropy. Type Ills about the uncertainty degree of the agent that the move will be accepted by the addressee. In this context, we introduce a new classification for the arguments based on their certainty to be accepted by the addressee. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Measuring and analyzing agents' uncertainty in argumentation-based negotiation dialogue games", "paper_id": "WOS:000327279900008"}