{"auto_keywords": [{"score": 0.03241813604178918, "phrase": "unfair_testimonies"}, {"score": 0.00481495049065317, "phrase": "unfair_third-party_testimonies"}, {"score": 0.00456020621016909, "phrase": "multiagent_systems"}, {"score": 0.0045108906244892165, "phrase": "different_stakeholders"}, {"score": 0.003668591097652231, "phrase": "computational_trust_models"}, {"score": 0.003344407169522133, "phrase": "third-party_recommendations"}, {"score": 0.0026898636962522505, "phrase": "additional_information"}, {"score": 0.0026033756286033285, "phrase": "realistic_settings"}, {"score": 0.0024519545383399773, "phrase": "specific_trust_models"}, {"score": 0.0023602032679095955, "phrase": "general_credibility_model"}, {"score": 0.0022718774783143203, "phrase": "empirical_studies"}, {"score": 0.002210814150677161, "phrase": "proposed_credibility_model"}, {"score": 0.002151388538895855, "phrase": "related_work"}, {"score": 0.0021049977753042253, "phrase": "adverse_influence"}], "paper_keywords": ["Agent", " trust", " credibility", " unfair testimonies"], "paper_abstract": "Usually, agents within multiagent systems represent different stakeholders that have their own distinct and sometimes conflicting interests and objectives. They would behave in such a way so as to achieve their own objectives, even at the cost of others. Therefore, there are risks in interacting with other agents. A number of computational trust models have been proposed to manage such risk. However, the performance of most computational trust models that rely on third-party recommendations as part of the mechanism to derive trust is easily deteriorated by the presence of unfair testimonies. There have been several attempts to combat the influence of unfair testimonies. Nevertheless, they are either not readily applicable since they require additional information which is not available in realistic settings, or ad hoc as they are tightly coupled with specific trust models. Against this background, a general credibility model is proposed in this paper. Empirical studies have shown that the proposed credibility model is more effective than related work in mitigating the adverse influence of unfair testimonies.", "paper_title": "Credibility: How Agents Can Handle Unfair Third-Party Testimonies in Computational Trust Models", "paper_id": "WOS:000280134800008"}