{"auto_keywords": [{"score": 0.004558748120167778, "phrase": "increasing_number"}, {"score": 0.004395532072377065, "phrase": "structure-based_modeling_tools"}, {"score": 0.003640516896245813, "phrase": "binding_orientations"}, {"score": 0.003384262486955773, "phrase": "virtual_screen"}, {"score": 0.0032828706086018133, "phrase": "enrichment_rates"}, {"score": 0.0031459887611258765, "phrase": "individual_compounds"}, {"score": 0.0025578967205807843, "phrase": "different_scoring_functions"}, {"score": 0.002466139325703204, "phrase": "well-characterized_water_molecule"}, {"score": 0.002264607102799332, "phrase": "experimental_data"}, {"score": 0.0022371907579775796, "phrase": "earlier_classification_data"}, {"score": 0.0022101055924375725, "phrase": "machine_learning_methods"}, {"score": 0.0021049977753042253, "phrase": "structure-based_drug_design_tools"}], "paper_keywords": [""], "paper_abstract": "With the availability of an increasing number of high resolution 3D structures of human cytochrome P450 enzymes, structure-based modeling tools are more readily used. In this study we explore the possibilities of using docking and scoring experiments on cytochrome P450 1A2. Three different questions have been addressed: 1. Binding orientations and conformations were successfully predicted for various substrates. 2. A virtual screen was performed with satisfying enrichment rates. 3. A classification of individual compounds into active and inactive was performed. It was found that while docking can be used successfully to address the first two questions, it seems to be more difficult to perform the classification. Different scoring functions were included, and the well-characterized water molecule in the active site was included in various ways. Results are compared to experimental data and earlier classification data using machine learning methods. The possibilities and limitations of using structure-based drug design tools for cytochrome P450 1A2 come to light and are discussed.", "paper_title": "Virtual Screening and Prediction of Site of Metabolism for Cytochrome P450 1A2 Ligands", "paper_id": "WOS:000262818500007"}