{"auto_keywords": [{"score": 0.04820929802388966, "phrase": "ssta"}, {"score": 0.013559458815103594, "phrase": "traditional_zero_clock_skew_circuits"}, {"score": 0.00481495049065317, "phrase": "statistical_timing_analysis_of_the_clock"}, {"score": 0.0047910471257663805, "phrase": "period_improvement_through_clock_skew"}, {"score": 0.0040048667115255, "phrase": "synchronizing_clock_signal"}, {"score": 0.0035712919163869176, "phrase": "different_registers"}, {"score": 0.0034660938095219846, "phrase": "minimum_clock_period"}, {"score": 0.0034146585649631692, "phrase": "entire_circuit"}, {"score": 0.003380791705551809, "phrase": "clock_skew_scheduling"}, {"score": 0.002984665318717504, "phrase": "nonzero_clock"}, {"score": 0.00286795254228461, "phrase": "accuracy_improvement"}, {"score": 0.002687922713487696, "phrase": "skew_scheduling"}, {"score": 0.002349228457383314, "phrase": "timing_margin"}, {"score": 0.0021049977753042253, "phrase": "zero_skew_circuits"}], "paper_keywords": ["Statistical timing analysis", " process variation", " clock skew scheduling"], "paper_abstract": "Statistical static timing analysis (SSTA) methods, which model process variations statistically as probability distribution function rather than deterministically, have been thoroughly performed on traditional zero clock skew circuits. In the traditional zero clock skew circuits, the synchronizing clock signal is designed to arrive in phase with respect to each register. However, designers will often schedule the clock skew to different registers in order to decrease the minimum clock period of the entire circuit. Clock skew scheduling imparts very different timing constraints that are based, in part, on the topology of the circuit. In this paper, SSTA is applied to nonzero clock skew circuits in order to determine the accuracy improvement relative to their zero skew counterparts, and also to assess how the results of skew scheduling might be impacted with more accurate statistical modeling. For 99.7% timing yield (3 sigma variation), SSTA is observed to improve the accuracy, and therefore increase the timing margin, of nonzero clock skew circuits by up to 2.5x, and on average by 1.3x, the amount seen by zero skew circuits.", "paper_title": "STATISTICAL TIMING ANALYSIS OF THE CLOCK PERIOD IMPROVEMENT THROUGH CLOCK SKEW SCHEDULING", "paper_id": "WOS:000293032700006"}