{"auto_keywords": [{"score": 0.02513032388875313, "phrase": "robust_tracking"}, {"score": 0.00481495049065317, "phrase": "distributed_camera_network"}, {"score": 0.0045850648862091085, "phrase": "hierarchical_smart_resource_coordination"}, {"score": 0.004462105963334103, "phrase": "distributed_systems"}, {"score": 0.004342430078306461, "phrase": "coordination_problem"}, {"score": 0.004112582094962078, "phrase": "fundamental_unit"}, {"score": 0.003980531478122155, "phrase": "fault_containment_unit"}, {"score": 0.0038527044625533574, "phrase": "run-time_fault"}, {"score": 0.0037087324991876727, "phrase": "best_alternative_course"}, {"score": 0.0033262524445013303, "phrase": "lower_levels"}, {"score": 0.0025334249463305875, "phrase": "current_run-time_context"}, {"score": 0.0023990982005125763, "phrase": "camera_pairs"}, {"score": 0.0021049977753042253, "phrase": "camera_network_configuration"}], "paper_keywords": ["Distributed sensor networks", " Multi-camera tracking", " Context-aware control"], "paper_abstract": "In this paper, we present a hierarchical smart resource coordination and reconfiguration framework for distributed systems. We view the coordination problem as one of context aware resource reconfiguration. The fundamental unit in this hierarchy is a Fault Containment Unit (FCU) that provides run-time fault-tolerance by deciding on the best alternative course of action when a failure occurs. FCUs are composed hierarchically and are responsible for dynamically reconfiguring failing FCUs at lower levels. When such a reconfiguration is not possible, FCUs propagate the failure upward for resolution. We evaluate the effectiveness of our framework in a people tracking application using a network of cameras. The task for our multi-camera network is to allocate pairs of cameras that localize a subject optimally given the current run-time context. The system automatically derives policies for switching between camera pairs that enable robust tracking while being attentive to certain performance measures. Our approach is unique in that we model the dynamics in the scene and the camera network configuration steers the policies to provide robust tracking.", "paper_title": "Automatic resource allocation in a distributed camera network", "paper_id": "WOS:000277415700008"}