{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "blood_vessels"}, {"score": 0.030873606291133553, "phrase": "public_databases"}, {"score": 0.015632873521717713, "phrase": "red-free_and_fluorescein_retinal_images"}, {"score": 0.015375167742456118, "phrase": "retinal_blood_vessels"}, {"score": 0.0046558180142346264, "phrase": "important_indicator"}, {"score": 0.004280520151174946, "phrase": "diagnostic_value"}, {"score": 0.004127394241838696, "phrase": "multiscale_feature_extraction"}, {"score": 0.003924339690313074, "phrase": "first_and_second_spatial_derivatives"}, {"score": 0.0038265753098624877, "phrase": "vessel_topology"}, {"score": 0.0037103745996558686, "phrase": "different_widths"}, {"score": 0.0036382660173943393, "phrase": "local_maxima"}, {"score": 0.0035277634006184756, "phrase": "maximum_principal_curvature"}, {"score": 0.003498211093849399, "phrase": "hessian_tensor"}, {"score": 0.0034495044604576385, "phrase": "multiple_pass_region"}, {"score": 0.0033447157263095223, "phrase": "feature_information"}, {"score": 0.0033166917181573397, "phrase": "spatial_information"}, {"score": 0.003171135756494228, "phrase": "public_database"}, {"score": 0.0029981136735805197, "phrase": "second_database_values"}, {"score": 0.0027100527874262446, "phrase": "vessel_geometry_detection"}, {"score": 0.002664801237762847, "phrase": "new_approach"}, {"score": 0.002627667819639917, "phrase": "vessel_diameters"}, {"score": 0.002583788342438538, "phrase": "validation_criterion"}, {"score": 0.002477260798809435, "phrase": "hand_segmented_images"}, {"score": 0.0024427343146442284, "phrase": "large_inter-subject_variability"}, {"score": 0.002401935608502315, "phrase": "last_evaluation"}, {"score": 0.0023751148426586154, "phrase": "vessel_geometric_values"}, {"score": 0.002342008661341529, "phrase": "red-free_and_fluorescein_paired_images"}, {"score": 0.0023028883978637557, "phrase": "\"ground_truth"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["blood vessel segmentation", " multiscale feature extraction", " region growing", " retinal imaging"], "paper_abstract": "The morphology of the retinal blood vessels can be an important indicator for diseases like diabetes, hypertension and retinopathy of prematurity (ROP). Thus, the measurement of changes in morphology of arterioles and venules can be of diagnostic value. Here we present a method to automatically segment retinal blood vessels based upon multiscale feature extraction. This method overcomes the problem of variations in contrast inherent in these images by using the first and second spatial derivatives of the intensity image that gives information about vessel topology. This approach also enables the detection of blood vessels of different widths, lengths and orientations. The local maxima over scales of the magnitude of the gradient and the maximum principal curvature of the Hessian tensor are used in a multiple pass region growing procedure. The growth progressively segments the blood vessels using feature information together with spatial information. The algorithm is tested on red-free and fluorescein retinal images, taken from two local and two public databases. Comparison with first public database yields values of 75.05% true positive rate (TPR) and 4.38% false positive rate (FPR). Second database values are of 72.46% TPR and 3.45% FPR. Our results on both public databases were comparable in performance with other authors. However, we conclude that these values are not sensitive enough so as to evaluate the performance of vessel geometry detection. Therefore we propose a new approach that uses measurements of vessel diameters and branching angles as a validation criterion to compare our segmented images with those hand segmented from public databases. Comparisons made between both hand segmented images from public databases showed a large inter-subject variability on geometric values. A last evaluation was made comparing vessel geometric values obtained from our segmented images between red-free and fluorescein paired images with the latter as the \"ground truth\". Our results demonstrated that borders found by our method are less biased and follow more consistently the border of the vessel and therefore they yield more confident geometric values. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Segmentation of blood vessels from red-free and fluorescein retinal images", "paper_id": "WOS:000244903300004"}