{"auto_keywords": [{"score": 0.04842456838190479, "phrase": "computer_games"}, {"score": 0.004056334733843591, "phrase": "cognitive_implications"}, {"score": 0.003586278948128509, "phrase": "structural_components"}, {"score": 0.0033277936960179892, "phrase": "minor_variations"}, {"score": 0.003212663446866794, "phrase": "significant_cognitive_implications"}, {"score": 0.002994178996584381, "phrase": "better_understanding"}, {"score": 0.00284009509859163, "phrase": "cognitive_aspect"}, {"score": 0.002753891109273246, "phrase": "exploratory_investigation"}, {"score": 0.0026352496813713292, "phrase": "deep_level"}, {"score": 0.002434396049547248, "phrase": "cognitive_processes"}], "paper_keywords": [""], "paper_abstract": "There is increasing interest in creating computer games for learning, problem solving, and other high-level cognitive activities. When investigating whether gameplay is conducive to such activities, gameplay is often studied as a whole. As a result, cognitive implications can be linked to the game but not to its structural elements. Given that gameplay arises from interaction between the player and the game, it is the structural components of interaction that should be investigated to better understand the design of gameplay. Furthermore, minor variations in the components of interaction can have significant cognitive implications. However, such variation has not been studied yet. Thus, to gain a better understanding of how we can study the effect of interaction on the cognitive aspect of gameplay, we conducted an exploratory investigation of two computer games. These games were isomorphic at a deep level and only had one minor difference in the structure of their interaction. Volunteers played these games and discussed the cognitive processes that emerged. In one game, they primarily engaged in planning, but in the other game they primarily engaged in visualizing. This paper discusses the results of our investigation as well as its implications for the design of computer games.", "paper_title": "Investigating Variations in Gameplay: Cognitive Implications", "paper_id": "WOS:000363738000001"}