{"auto_keywords": [{"score": 0.034362805585615434, "phrase": "market_valuation"}, {"score": 0.033878597756568214, "phrase": "domestic_and_foreign_firms"}, {"score": 0.015438930289080641, "phrase": "india"}, {"score": 0.015052078478730834, "phrase": "market_value"}, {"score": 0.008859624286559984, "phrase": "whole_sample"}, {"score": 0.00481495049065317, "phrase": "weak_intellectual_property_rights_protection"}, {"score": 0.004475436844227947, "phrase": "different_fields"}, {"score": 0.004426607895888934, "phrase": "scant_attention"}, {"score": 0.004298974960001275, "phrase": "weak_protection"}, {"score": 0.004267643450023782, "phrase": "intellectual_property_rights"}, {"score": 0.004010342699414496, "phrase": "ipr_policy"}, {"score": 0.003981106369547929, "phrase": "developing_countries"}, {"score": 0.0037273513742154237, "phrase": "ipr_protection"}, {"score": 0.003315374849824563, "phrase": "significant_differences"}, {"score": 0.0028116863172018593, "phrase": "empirical_analysis"}, {"score": 0.002613056713968863, "phrase": "u.s._or_european_countries"}, {"score": 0.002437339565360659, "phrase": "foreign_firms"}, {"score": 0.0023496433751182162, "phrase": "valuation_coefficient"}, {"score": 0.0023324855762635616, "phrase": "domestic_firms"}, {"score": 0.0022077244919858218, "phrase": "science-based_industries"}, {"score": 0.0021049977753042253, "phrase": "policy_implications"}], "paper_keywords": ["R&D", " Market value", " IPR protection", " India"], "paper_abstract": "The relationship between R&D and market value has attracted the interest of many scholars within different fields, but scant attention has been paid to the countries with weak protection of intellectual property rights (IPR). This is unfortunate, since this problem is potentially highly relevant for IPR policy in developing countries. In particular, several questions arise when the problem of R&D market value is analyzed in a country where IPR protection is weak. First, there are concerns regarding incentives (i.e., private returns) for firms to invest in R&D when IPR is only weakly protected. Second, significant differences could emerge in the market valuation of R&D investments of domestic and foreign firms, above all in those industries where spillovers are more likely. To examine these issues, this paper investigates the market valuation of R&D investments of a panel of 219 R&D-reporting domestic and foreign firms publicly traded in India with an empirical analysis. First, the market valuation of the R&D capital for the whole sample is positive and higher than those obtained in U.S. or European countries from similar analyses. Second, in the sub-samples of the domestic and foreign firms, the market value of R&D investments of foreign firms is not significantly different from zero, while the valuation coefficient of domestic firms is four times higher than that obtained on the whole sample. Third, in science-based industries the difference between domestic and foreign firms is smaller than in the other industries. The policy implications of these findings are discussed.", "paper_title": "R&D market value under weak intellectual property rights protection: the case of India", "paper_id": "WOS:000273950900005"}