{"auto_keywords": [{"score": 0.049378038061471535, "phrase": "noisy_channels"}, {"score": 0.011820181355034563, "phrase": "vq"}, {"score": 0.006893951559668811, "phrase": "conventional_channel-optimized_vector_quantization"}, {"score": 0.006793200757670837, "phrase": "covq"}, {"score": 0.006357617231307924, "phrase": "vector_quantization"}, {"score": 0.005609180420835071, "phrase": "soft_decoding_self-organizing_map"}, {"score": 0.005021942302664332, "phrase": "covq_approach"}, {"score": 0.00481495049065317, "phrase": "vector_quantized_data"}, {"score": 0.004769242774137828, "phrase": "long_training_time"}, {"score": 0.00466490157139399, "phrase": "awgn"}, {"score": 0.004596529964065597, "phrase": "fading_channels"}, {"score": 0.004397474196299794, "phrase": "proposed_approach"}, {"score": 0.004207002237265264, "phrase": "covq._simulation"}, {"score": 0.004024747019147814, "phrase": "fast_and_practical_method"}, {"score": 0.003858697684681798, "phrase": "time_consuming_training_process"}, {"score": 0.0021049977753042253, "phrase": "training_process"}], "paper_keywords": ["vector quantization", " self-organizing map"], "paper_abstract": "The conventional channel-optimized vector quantization (COVQ) is very powerful in the protection of vector quantization (VQ) data over noisy channels. However, it suffers from the time consuming training process. A soft decoding self-organizing map (SOM) approach for VQ over noisy channels is presented. Compared with the COVQ approach, it does not require a long training time. For AWGN and fading channels, the distortion of the proposed approach is comparable to that of COVQ. Simulation confirmed that our proposed approach is a fast and practical method for VQ over noisy channels. The conventional channel-optimized vector quantization (COVQ) is very powerful in the protection of vector quantization (VQ) data over noisy channels. However, it suffers from the time consuming training process. A soft decoding self-organizing map (SOM) approach for VQ over noisy channels is presented. Compared with the COVQ approach, it does not require a long training time. For AWGN and fading channels, the distortion of the proposed approach is comparable to that of COVQ. Simulation confirmed that our proposed approach is a fast and practical method for VQ over noisy channels.", "paper_title": "Improved transmission of vector quantized data over noisy channels", "paper_id": "WOS:000251098200001"}