{"auto_keywords": [{"score": 0.03469747405740796, "phrase": "appropriate_action"}, {"score": 0.022660762419831965, "phrase": "medication_safety"}, {"score": 0.009676023885271267, "phrase": "medication_orders"}, {"score": 0.009583320750477185, "phrase": "warning_message"}, {"score": 0.008669862531098829, "phrase": "cpoe"}, {"score": 0.007888295083851554, "phrase": "participating_units"}, {"score": 0.00481495049065317, "phrase": "long_term_care"}, {"score": 0.004677214102959377, "phrase": "adult_inpatients"}, {"score": 0.004587575682338962, "phrase": "long-term_care"}, {"score": 0.004439097815805505, "phrase": "clinical_setting"}, {"score": 0.0042954047303508875, "phrase": "computerized_clinical_decision_support_system"}, {"score": 0.004204904449336037, "phrase": "prescribers'_actions"}, {"score": 0.0041242802965913965, "phrase": "randomized_controlled_trial"}, {"score": 0.004108341158463974, "phrase": "computerized_clinical_decision_support"}, {"score": 0.004076646688960701, "phrase": "long-stay_units"}, {"score": 0.004006221673049018, "phrase": "computer-based_clinical_decision_support_system"}, {"score": 0.003944639617922883, "phrase": "existing_computerized_physician_order_entry"}, {"score": 0.0038840004863510426, "phrase": "subsequent_one-year_study_period"}, {"score": 0.003629437571120368, "phrase": "drug_orders"}, {"score": 0.0034712755562630294, "phrase": "prescriber_behavior"}, {"score": 0.0034578513280086823, "phrase": "drug_ordering"}, {"score": 0.003262586594464963, "phrase": "relative_risk"}, {"score": 0.0032248729393605166, "phrase": "intervention_units"}, {"score": 0.00319997222996892, "phrase": "control_units"}, {"score": 0.0030075444765503556, "phrase": "cpoe_system"}, {"score": 0.002881986132084385, "phrase": "alert_categories"}, {"score": 0.0028321404649604416, "phrase": "central_nervous_system_side-effects"}, {"score": 0.0027563061175865577, "phrase": "drug-associated_constipation"}, {"score": 0.0024488281356703128, "phrase": "central_nervous_system_side_effects"}, {"score": 0.0023878596337714424, "phrase": "recommended_laboratory_test"}, {"score": 0.0023694065215394593, "phrase": "ordered_drug"}, {"score": 0.0023510956768181372, "phrase": "long-term_care_facilities"}, {"score": 0.0023374552493156463, "phrase": "new_system-level_approaches"}, {"score": 0.0022224972632835416, "phrase": "clinical_decision_support_system"}, {"score": 0.002188273673362524, "phrase": "relatively_low_rate"}, {"score": 0.002113181030916673, "phrase": "medication_errors"}, {"score": 0.0021049977753042253, "phrase": "adverse_drug_events"}], "paper_keywords": [""], "paper_abstract": "Objective: Computerized physician order entry with clinical decision support has been shown to improve medication safety in adult inpatients, but few data are available regarding its usefulness in the long-term care setting. The objective of this study was to examine opportunities for improving medication safety in that clinical setting by determining the proportion of medication orders that would generate a warning message to the prescriber via a computerized clinical decision support system and assessing the extent to which these alerts would affect prescribers' actions. Design: The study was set within a randomized controlled trial of computerized clinical decision support conducted in the long-stay units of a large, academically-affiliated long-term care facility. In March 2002, a computer-based clinical decision support system (CDSS) was added to an existing computerized physician order entry (CPOE) system. Over a subsequent one-year study period, prescribers ordering drugs for residents on three resident-care units of the facility were presented with alerts; these alerts were not displayed to prescribers in the four control units. Measurements: We assessed the frequency of drug orders associated with various categories of alerts across all participating units of the facility. To assess the impact of actually receiving an alert on prescriber behavior during drug ordering, we calculated separately for the intervention and control units the proportion of the alerts, within each category, that were followed by an appropriate action and estimated the relative risk of an appropriate action m the intervention units compared to the control units. Results: During the 12 months of the study, there were 445 residents on the participating units of the facility, contributing 3,726 resident-months of observation time. During this period, 47,997 medication orders were entered through the CPOE system-approximately 9 medication orders per resident per month. 9,414 alerts were triggered (2.5 alerts per resident-month). The alert categories most often triggered were related to risks of central nervous system side-effects such as over-sedation (20%). Alerts for risk of drug-associated constipation (13%) or renal insufficiency/electrolyte imbalance (12%) were also common. Twelve percent of the alerts were related to orders for warfarin. Overall, prescribers who received alerts were only slightly more likely to take an appropriate action (relative risk 1.11, 95% confidence interval 1.00, 1.22). Alerts related to orders for warfarin or central nervous system side effects were most likely to engender an appropriate action, such as ordering a recommended laboratory test or canceling an ordered drug. Conclusion: Long-term care facilities must implement new system-level approaches with the potential to improve medication safety for their residents. The number of medication orders that triggered a warning message in this study suggests that CPOE with a clinical decision support system may represent one such tool. However, the relatively low rate of response to these alerts suggests that further refinements to such systems are required, and that their impact on medication errors and adverse drug events must be carefully assessed.", "paper_title": "Prescribers' responses to alerts during medication ordering in the long term care setting", "paper_id": "WOS:000239072800004"}