{"auto_keywords": [{"score": 0.0495648351427175, "phrase": "online_scores"}, {"score": 0.033550893132319834, "phrase": "overall_score"}, {"score": 0.008713768692145013, "phrase": "interactive_effects"}, {"score": 0.004611369021812453, "phrase": "online_shopping"}, {"score": 0.00441635700580562, "phrase": "online_reviews"}, {"score": 0.004161553532799662, "phrase": "different_results"}, {"score": 0.003695040819303525, "phrase": "different_forms"}, {"score": 0.0035771121569391916, "phrase": "reasonable_explanation"}, {"score": 0.0034629341517018438, "phrase": "research_results"}, {"score": 0.0030250067691601967, "phrase": "weighted_score"}, {"score": 0.0025440911575156755, "phrase": "sub-dimensional_scores"}, {"score": 0.0021745003291048356, "phrase": "online-score-based_operation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Online reviews", " Word of mouth", " Interactive effect", " E-commerce", " Score"], "paper_abstract": "With the popularity of online shopping, more and more consumers are making their decisions according to online reviews. However, studies on the effects of online scores produce different results, even for the same products. This study analyzes the impact of online scores from the perspective of the interaction between the different forms of online scores to provide a reasonable explanation of the inconsistency of the research results in this regard. The results of this study demonstrate that the effect of the overall score is negatively affected by the difference between the weighted score and the overall score itself. Moreover, it is also positively influenced by the difference between the overall score of one product and those of its substitutes. While considering the difference between the sub-dimensional scores and the overall score, its influence on the effect of the overall score is insignificant. This research theoretically validates the interactive effects of online scores and provides the basis for an online-score-based operation. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Research on the interactive effects of online scores", "paper_id": "WOS:000346236500002"}