{"auto_keywords": [{"score": 0.049780208982911994, "phrase": "event_streams"}, {"score": 0.012421384716028864, "phrase": "count_queries"}, {"score": 0.009625377533986686, "phrase": "event_stream"}, {"score": 0.007644481013894716, "phrase": "multiple_time_granularities"}, {"score": 0.007137178084533112, "phrase": "data_streams"}, {"score": 0.004466519142879166, "phrase": "stock_market"}, {"score": 0.004397151276300207, "phrase": "mostly_numeric_data"}, {"score": 0.0042350135188564285, "phrase": "numerical_data"}, {"score": 0.004064979751922815, "phrase": "event_occurrences"}, {"score": 0.003990385737207714, "phrase": "similar_properties"}, {"score": 0.003831169445079928, "phrase": "fixed_order"}, {"score": 0.003795335309109018, "phrase": "continuous_stream"}, {"score": 0.003701401653850141, "phrase": "time_stamps"}, {"score": 0.003487489029588045, "phrase": "frequently_asked_queries"}, {"score": 0.003358780420024205, "phrase": "event_occurrence"}, {"score": 0.0031646057802503526, "phrase": "different_time_granularities"}, {"score": 0.002962986184540317, "phrase": "time_frames"}, {"score": 0.0026467041118198977, "phrase": "whole_stream"}, {"score": 0.002470237978694949, "phrase": "proposed_approximation_method"}, {"score": 0.0024014759148123736, "phrase": "high_accuracy"}, {"score": 0.0023200213317312577, "phrase": "distance_distributions"}, {"score": 0.002283913454238574, "phrase": "proposed_method"}, {"score": 0.0021995257343837547, "phrase": "daily_price_changes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["count queries", " data streams", " event streams", " time granularity", " association rules", " data mining"], "paper_abstract": "Management and analysis of streaming data has become crucial with its applications to web, sensor data, network traffic data, and stock market. Data streams consist of mostly numeric data but what is more interesting are the events derived from the numerical data that need to be monitored. The events obtained from streaming data form event streams. Event streams have similar properties to data streams, i.e., they are seen only once in a fixed order as a continuous stream. Events appearing in the event stream have time stamps associated with them at a certain time granularity, such as second, minute, or hour. One type of frequently asked queries over event streams are count queries, i.e., the frequency of an event occurrence over time. Count queries can be answered over event streams easily, however, users may ask queries over different time granularities as well. For example, a broker may ask how many times a stock increased in the same time frame, where the time frames specified could be an hour, day, or both. Such types of queries are challenging especially in the case of event streams where only a window of an event stream is available at a certain time instead of the whole stream. In this paper, we propose a technique for predicting the frequencies of event occurrences in event streams at multiple time granularities. The proposed approximation method efficiently estimates the count of events with a high accuracy in an event stream at any time granularity by examining the distance distributions of event occurrences. The proposed method has been implemented and tested on different real data sets including daily price changes in two different stock exchange markets. The obtained results show its effectiveness. (C) 2005 Elsevier Inc. All rights reserved.", "paper_title": "Processing count queries over event streams at multiple time granularities", "paper_id": "WOS:000238105200006"}