{"auto_keywords": [{"score": 0.02376440639093324, "phrase": "lbvs"}, {"score": 0.01762718549587698, "phrase": "vs"}, {"score": 0.00481495049065317, "phrase": "human_histone_deacetylases"}, {"score": 0.004710306419574744, "phrase": "histone_deacetylases"}, {"score": 0.0045877173513910055, "phrase": "important_class"}, {"score": 0.004547564208690591, "phrase": "drug_targets"}, {"score": 0.004238682850598745, "phrase": "virtual_screening"}, {"score": 0.004128317208406523, "phrase": "fairly_effective_approaches"}, {"score": 0.004092168350316413, "phrase": "drug_discovery"}, {"score": 0.004020813632357377, "phrase": "highly_selective_histone_deacetylase_inhibitors"}, {"score": 0.0038141000450978746, "phrase": "maximal_unbiased_benchmarking_data_sets"}, {"score": 0.00355485940716082, "phrase": "unbiased_benchmarking_sets"}, {"score": 0.00352371416065881, "phrase": "ligand-based_virtual_screening"}, {"score": 0.0033572130837348623, "phrase": "class_iii"}, {"score": 0.002981026404927824, "phrase": "decoy_sets"}, {"score": 0.0027782510491938315, "phrase": "artificial_enrichment"}, {"score": 0.002753891109273246, "phrase": "analogue_bias"}, {"score": 0.002693919110230191, "phrase": "comparative_studies"}, {"score": 0.0021805201234139475, "phrase": "benchmarking_sets"}, {"score": 0.0021330078238529465, "phrase": "mubd-hdacs"}], "paper_keywords": [""], "paper_abstract": "Histone deacetylases (HDACs) are an important class of drug targets for the treatment of cancers, neurodegenerative diseases, and other types of diseases. Virtual screening (VS) has become fairly effective approaches for drug discovery of novel and highly selective histone deacetylase inhibitors (HDACIs). To facilitate the process, we constructed maximal unbiased benchmarking data sets for HDACs (MUBD-HDACs) using our recently published methods that were originally developed for building unbiased benchmarking sets for ligand-based virtual screening (LBVS). The MUBD-HDACs cover all four classes including Class III (Sirtuins family) and 14 HDAC isoforms, composed of 631 inhibitors and 24 609 unbiased decoys. Its ligand sets have been validated extensively as chemically diverse, while the decoy sets were shown to be property-matching with ligands and maximal unbiased in terms of artificial enrichment and analogue bias. We also conducted comparative studies with DUD-E and DEKOIS 2.0 sets against HDAC2 and HDAC8 targets and demonstrate that our MUBD-HDACs are unique in that they can be applied unbiasedly to both LBVS and SBVS approaches. In addition, we defined a novel metric, i.e. NLBScore, to detect the 2D bias and LBVS favorable effect within the benchmarking sets. In summary, MUBD-HDACs are the only comprehensive and maximal-unbiased benchmark data sets for HDACs (including Sirtuins) that are available so far. MUBD-HDACs are freely available at http://www.xswlab.org/.", "paper_title": "Comparative Modeling and Benchmarking Data Sets for Human Histone Deacetylases and Sirtuin Families", "paper_id": "WOS:000349943100017"}