{"auto_keywords": [{"score": 0.042143904057605895, "phrase": "network_performance"}, {"score": 0.00481495049065317, "phrase": "handover_parameter_optimization_algorithm"}, {"score": 0.004776182975551586, "phrase": "lte"}, {"score": 0.004698229304089357, "phrase": "currently_deployed_cellular_networks"}, {"score": 0.0044005599565517875, "phrase": "radio_resource_management_functions"}, {"score": 0.0043114466990006334, "phrase": "selfoptimization_algorithms"}, {"score": 0.004206879557938045, "phrase": "manual_monitoring"}, {"score": 0.0041725881174377345, "phrase": "offline_analysis"}, {"score": 0.003972607172518598, "phrase": "automated_fashion"}, {"score": 0.003456359260921982, "phrase": "performance_enhancement"}, {"score": 0.002933973181012572, "phrase": "main_ho_control_parameters"}, {"score": 0.0028862761537904206, "phrase": "observed_network_performance"}, {"score": 0.0027477745788313163, "phrase": "stop_condition"}, {"score": 0.0026810296502682916, "phrase": "shadow_fading_or_coverage_holes"}, {"score": 0.002449839292715327, "phrase": "different_control_parameter_settings"}, {"score": 0.00241989408309933, "phrase": "observed_gain"}, {"score": 0.0023610946923597405, "phrase": "possible_instability"}, {"score": 0.002184137736856711, "phrase": "ho_self-optimization_algorithm"}, {"score": 0.0021049977753042253, "phrase": "signalling_load"}], "paper_keywords": ["LTE", " Self-optimization", " Handover", " Signalling"], "paper_abstract": "In currently deployed cellular networks, a lot of time and effort is put by operators into the optimization of radio resource management functions. The use of selfoptimization algorithms will eliminate the need for manual monitoring and offline analysis, as these algorithms constantly strive to improve network performance in an automated fashion. However, expectations have to be kept realistic as in some cases it may not be possible for network performance to be significantly improved. A trade-off has to be made between the performance enhancement that these algorithms can achieve and the resources they need for doing so. This article proposes a mechanism which will minimize signalling determined by the use of a handover (HO) self-optimization algorithm. This algorithm derives the proper values of the main HO control parameters based on the observed network performance, while the signalling minimizing mechanism will be used as a stop condition, as, due to shadow fading or coverage holes, performance can only be improved up to a point. After this point, performance will only slightly vary with different control parameter settings but the observed gain will not compensate for the possible instability and signalling load introduced by these changes. By using the signalling minimizing mechanism in combination with the HO self-optimization algorithm, network performance will be maintained while the signalling load will be significantly diminished.", "paper_title": "Signalling minimizing handover parameter optimization algorithm for LTE networks", "paper_id": "WOS:000303201700005"}