{"auto_keywords": [{"score": 0.04791821709491099, "phrase": "statistical_and_machine-learning_methods"}, {"score": 0.041962759324215476, "phrase": "suspicious_accesses"}, {"score": 0.04041519651739929, "phrase": "privacy_officers"}, {"score": 0.03621816397434532, "phrase": "final_models"}, {"score": 0.03156097979008408, "phrase": "lr"}, {"score": 0.00481495049065317, "phrase": "statistical_and_machine_learning"}, {"score": 0.004730338746443662, "phrase": "suspicious_access"}, {"score": 0.004696909870731282, "phrase": "electronic_health_records"}, {"score": 0.004517210371632577, "phrase": "electronic_health_record"}, {"score": 0.004267978415344142, "phrase": "ehr_access_logs"}, {"score": 0.003975609222669783, "phrase": "selected_events"}, {"score": 0.00376950244909, "phrase": "gold_standard"}, {"score": 0.0037295765964056255, "phrase": "model_evaluation"}, {"score": 0.003400736815046841, "phrase": "external_set"}, {"score": 0.003212906206685004, "phrase": "standard_operating_procedures"}, {"score": 0.0031229055434606003, "phrase": "operating_characteristic_curve"}, {"score": 0.0030570583408091488, "phrase": "whole_data"}, {"score": 0.0029295038465122045, "phrase": "svm."}, {"score": 0.002877912855903293, "phrase": "baseline_model"}, {"score": 0.002559501330352064, "phrase": "baseline_method"}, {"score": 0.0024789326485851666, "phrase": "svm._limitations"}, {"score": 0.0024613749081680474, "phrase": "lr_and_svm_models"}, {"score": 0.0024094425220967273, "phrase": "interinstitutional_differences"}, {"score": 0.002392375784707278, "phrase": "organizational_structures"}, {"score": 0.002268161377269513, "phrase": "statistical_and_machine-learning_techniques"}, {"score": 0.002220296517089146, "phrase": "important_limitation"}, {"score": 0.0021967433763351884, "phrase": "relrtively_small_sample"}], "paper_keywords": [""], "paper_abstract": "Objective To determine whether statistical and machine-learning methods, when applied to electronic health record (EHR) access data, could help identify suspicious (ie, potentially inappropriate) access to EHRs. Methods From EHR access logs and other organizational data collected over a 2-month period, the authors extracted 26 features likely to be useful in detecting suspicious accesses. Selected events were marked as either suspicious or appropriate by privacy officers, and served as the gold standard set for model evaluation. The authors trained logistic regression (LR) and support vector machine (SVM) models on 10-fold cross-validation sets of 1291 LRbeled events. The authors evaluated the sensitivity of final models on an external set of 58 events that were identified as truly inappropriate and investigated independently from this study using standard operating procedures. Results The area under the receiver operating characteristic curve of the models on the whole data set of 1291 events was 0.91 for LR, and 0.95 for SVM. The sensitivity of the baseline model on this set was 0.8. When the final models were evaluated on the set of 58 investigated events, all of which were determined as truly inappropriate, the sensitivity was 0 for the baseline method, 0.76 for LR, and 0.79 for SVM. Limitations The LR and SVM models may not generalize because of interinstitutional differences in organizational structures, applications, and workflows. Nevertheless, our approach for constructing the models using statistical and machine-learning techniques can be generalized. An important limitation is the reLRtively small sample used for the training set due to the effort required for its construction. Conclusion The results suggest that statistical and machine-learning methods can pLRy an important role in helping privacy officers detect suspicious accesses to EHRs.", "paper_title": "Using statistical and machine learning to help institutions detect suspicious access to electronic health records", "paper_id": "WOS:000292061700023"}