{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "multiple_local_color_transfer"}, {"score": 0.013078103573639399, "phrase": "multiple_local_color_transfer_method"}, {"score": 0.004630270043271386, "phrase": "new_approach"}, {"score": 0.004585212379675535, "phrase": "color_transfer"}, {"score": 0.004198839649063847, "phrase": "stroke-based_user_interface"}, {"score": 0.0041174821422410544, "phrase": "direct_indication_mechanism"}, {"score": 0.0030397596289795143, "phrase": "source_and_target_images"}, {"score": 0.002995427206425849, "phrase": "corresponding_regions"}, {"score": 0.0026501935378083663, "phrase": "improved_graph_cuts_algorithm"}, {"score": 0.002414616656410503, "phrase": "source_image"}, {"score": 0.002391067964886602, "phrase": "gradient-guided_pixel-wise_color_transfer_functions"}, {"score": 0.0021784745589727246, "phrase": "good_quality"}, {"score": 0.0021049977753042253, "phrase": "interactive_and_intuitive_stroke-based_user_interface"}], "paper_keywords": [""], "paper_abstract": "This paper investigates a new approach for color transfer. Rather than transferring color from one image to another globally, we propose a system with a stroke-based user interface to provide a direct indication mechanism. We further present a multiple local color transfer method. Through our system the user can easily enhance a defect (source) photo by referring to some other good quality (target) images by simply drawing some strokes. Then, the system will perform the multiple local color transfer automatically. The system consists of two major steps. First, the user draws some strokes on the source and target images to indicate corresponding regions and also the regions he or she wants to preserve. The regions to be preserved which will be masked out based on an improved graph cuts algorithm. Second, a multiple local color transfer method is presented to transfer the color from the target image(s) to the source image through gradient-guided pixel-wise color transfer functions. Finally, the defect (source) image can be enhanced seamlessly by multiple local color transfer based on some good quality (target) examples through an interactive and intuitive stroke-based user interface.", "paper_title": "Example-based Multiple Local Color Transfer by Strokes", "paper_id": "WOS:000262666000007"}