{"auto_keywords": [{"score": 0.04510567529699368, "phrase": "composed_systems"}, {"score": 0.00481495049065317, "phrase": "quantitative_information_flow"}, {"score": 0.004773040022691547, "phrase": "scheduler-dependent_systems"}, {"score": 0.004731492618963217, "phrase": "quantitative_information_flow_analyses"}, {"score": 0.004568871736067739, "phrase": "publicly_observable_outputs"}, {"score": 0.004354315061804687, "phrase": "information_leakage"}, {"score": 0.004167982855788402, "phrase": "disjoint_component_systems"}, {"score": 0.004042295865725559, "phrase": "leakage_compositionally"}, {"score": 0.003903269701018361, "phrase": "component_systems"}, {"score": 0.0035141291835319682, "phrase": "parallel_systems"}, {"score": 0.0030414140732789186, "phrase": "attacker's_capability"}, {"score": 0.0023902621773166963, "phrase": "leaked_information"}, {"score": 0.0023694065215394593, "phrase": "perfect_observers"}, {"score": 0.002297831085501592, "phrase": "secret_information"}, {"score": 0.0022480304016499605, "phrase": "imperfect_observers"}, {"score": 0.0021049977753042253, "phrase": "min-entropy_leakage"}], "paper_keywords": [""], "paper_abstract": "Quantitative information flow analyses measure how much information on secrets is leaked by publicly observable outputs. One area of interest is to quantify and estimate the information leakage of composed systems. Prior work has focused on running disjoint component systems in parallel and reasoning about the leakage compositionally, but has not explored how the component systems are run in parallel or how the leakage of composed systems can be minimised. In this paper we consider the manner in which parallel systems can be combined or scheduled. This considers the effects of scheduling channels where resources may be shared, or whether the outputs may be incrementally observed. We also generalise the attacker's capability, of observing outputs of the system, to consider attackers who may be imperfect in their observations, e.g. when outputs may be confused with one another, or when assessing the time taken for an output to appear. Our main contribution is to present how scheduling and observation effect information leakage properties. In particular, that scheduling can hide some leaked information from perfect observers, while some scheduling may reveal secret information that is hidden to imperfect observers. In addition we present an algorithm to construct a scheduler that minimises the min-entropy leakage and min-capacity in the presence of any observer.", "paper_title": "Quantitative Information Flow for Scheduler-Dependent Systems", "paper_id": "WOS:000367344900005"}