{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "scientific_domains"}, {"score": 0.03843856552198325, "phrase": "scientific_domain"}, {"score": 0.03187066128908579, "phrase": "scientogram_analysis"}, {"score": 0.00450000390667755, "phrase": "current_state"}, {"score": 0.003987755561492638, "phrase": "automatic_comparison"}, {"score": 0.0036026484429137998, "phrase": "face-to-face_comparison"}, {"score": 0.003100865267124765, "phrase": "graph-based_data_mining_tools"}, {"score": 0.002869793011316547, "phrase": "graph_mining_area"}, {"score": 0.002469830206270585, "phrase": "common_research_categories_substructures"}, {"score": 0.0023417010799384524, "phrase": "different_countries"}, {"score": 0.002263639474937039, "phrase": "developed_experiments"}, {"score": 0.0021881743793875767, "phrase": "graph_mining_tools"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Domain analysis", " Social networks", " Scientograms", " Graph-based data mining", " Scientogram mining", " Subdue algorithm"], "paper_abstract": "The creation of some kind of representations depicting the current state of Science (or scientograms) is an established and beaten track for many years now. However, if we are concerned with the automatic comparison, analysis and understanding of a set of scientograms, showing for instance the evolution of a scientific domain or a face-to-face comparison of several countries, the task is titanically complex as the amount of data to analyze becomes huge and complex. In this paper, we aim to show that graph-based data mining tools are useful to deal with scientogram analysis. Subdue, the first algorithm proposed in the graph mining area, has been chosen for this purpose. This algorithm has been customized to deal with three different scientogram analysis tasks regarding the evolution of a scientific domain over time, the extraction of the common research categories substructures in the world, and the comparison of scientific domains between different countries. The outcomes obtained in the developed experiments have clearly demonstrated the potential of graph mining tools in scientogram analysis. (C) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "Graph-based data mining: A new tool for the analysis and comparison of scientific domains represented as scientograms", "paper_id": "WOS:000278543600009"}