{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "black_hole"}, {"score": 0.004765686919942249, "phrase": "anonymous_ring"}, {"score": 0.004605069682942661, "phrase": "mobile_agents"}, {"score": 0.004542341892683877, "phrase": "highly_harmful_item"}, {"score": 0.004404296965915598, "phrase": "ring_network"}, {"score": 0.004314595541370065, "phrase": "stationary_process"}, {"score": 0.004270429323002124, "phrase": "visiting_agents"}, {"score": 0.004183442897207925, "phrase": "observable_trace"}, {"score": 0.0038793218280304825, "phrase": "different_scenarios"}, {"score": 0.0037228262889889402, "phrase": "complexity_questions"}, {"score": 0.002998776886514782, "phrase": "time_complexity"}, {"score": 0.002927545222513142, "phrase": "optimal_bound"}, {"score": 0.0028678338651577056, "phrase": "n_-_i_agents"}, {"score": 0.002622806755354039, "phrase": "different_home_bases"}, {"score": 0.002325725836212701, "phrase": "theta"}, {"score": 0.0021341390503944358, "phrase": "optimal_algorithm"}, {"score": 0.0021049977753042253, "phrase": "oriented_case"}], "paper_keywords": ["mobile agents", " distributed computing", " ring network", " hazardous search"], "paper_abstract": "In this paper we address the problem of mobile agents searching for a highly harmful item (called a black hole) in a ring network. The black hole is a stationary process that destroys visiting agents upon their arrival without leaving any observable trace of such a destruction. The task is to have at least one surviving agent able to unambiguously report the location of the black hole. We consider different scenarios and in each situation we answer some computational as well as complexity questions. We first consider agents that start from the same home base (co-located). We prove that two such agents are necessary and sufficient to locate the black hole; in our algorithm the agents perform O (n log n) moves (where n is the size of the ring) and we show that such a bound is optimal. We also consider time complexity and show how to achieve the optimal bound of 2n - 4 units of time using n - I agents. We generalize our technique to establish a trade-off between time and number of agents. We then consider the case of agents that start from different home bases (dispersed) and we show that if the ring is oriented, two dispersed agents are still necessary and sufficient. Also in this case our algorithm is optimal in terms of number of moves (Theta (n log n)). We finally show that if the ring is unoriented, three agents are necessary and sufficient; an optimal algorithm follows from the oriented case.", "paper_title": "Mobile search for a black hole in an anonymous ring", "paper_id": "WOS:000246152800004"}