{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "udg_radio_networks"}, {"score": 0.00478740563679966, "phrase": "unknown_topology"}, {"score": 0.004692227830462433, "phrase": "radio_networks"}, {"score": 0.004638688538861392, "phrase": "unit_disk_graphs"}, {"score": 0.004533427352547707, "phrase": "wireless_communication"}, {"score": 0.004481691848428778, "phrase": "e._g."}, {"score": 0.004342430078306461, "phrase": "network_stations"}, {"score": 0.004256060942428626, "phrase": "euclidean_plane"}, {"score": 0.0034216381828892696, "phrase": "network_topology"}, {"score": 0.0033439015405773093, "phrase": "conditional_wake_up_model"}, {"score": 0.003139083793966204, "phrase": "first_time"}, {"score": 0.0031032109441552287, "phrase": "spontaneous_wake_up_model"}, {"score": 0.0029298852183574304, "phrase": "broadcasting_time"}, {"score": 0.002879794950644701, "phrase": "udg_network"}, {"score": 0.002734590059580852, "phrase": "minimum_distance"}, {"score": 0.0026724206954249125, "phrase": "deterministic_broadcasting_algorithm"}, {"score": 0.0026041635822373265, "phrase": "conditional_wake"}, {"score": 0.002487083025913648, "phrase": "deterministic_algorithm"}, {"score": 0.002416589459425828, "phrase": "spontaneous_wake"}, {"score": 0.002166421738415464, "phrase": "parameter_values"}], "paper_keywords": ["Radio networks", " Unit disk graphs", " Ad hoc networks", " Broadcasting"], "paper_abstract": "The paper considers broadcasting in radio networks, modeled as unit disk graphs (UDG). Such networks occur in wireless communication between sites (e. g., stations or sensors) situated in a terrain. Network stations are represented by points in the Euclidean plane, where a station is connected to all stations at distance at most 1 from it. A message transmitted by a station reaches all its neighbors, but a station hears a message (receives the message correctly) only if exactly one of its neighbors transmits at a given time step. One station of the network, called the source, has a message which has to be disseminated to all other stations. Stations are unaware of the network topology. Two broadcasting models are considered. In the conditional wake up model, the stations other than the source are initially idle and cannot transmit until they hear a message for the first time. In the spontaneous wake up model, all stations are awake (and may transmit messages) from the beginning. It turns out that broadcasting time depends on two parameters of the UDG network, namely, its diameter D and its granularity g, which is the inverse of the minimum distance between any two stations. We present a deterministic broadcasting algorithm which works in time O(Dg) under the conditional wake up model and prove that broadcasting in this model cannot be accomplished by any deterministic algorithm in time better than Omega(D root g). For the spontaneous wake up model, we design two deterministic broadcasting algorithms: the first works in time O(D + g(2)) and the second in time O(D log g). While neither of these algorithms alone is optimal for all parameter values, we prove that the algorithm obtained by interleaving their steps, and thus working in time O(min {D + g(2), D log g}), turns out to be optimal by establishing a matching lower bound.", "paper_title": "Broadcasting in UDG radio networks with unknown topology", "paper_id": "WOS:000263361200003"}