{"auto_keywords": [{"score": 0.04951738916270167, "phrase": "template-based_structure_prediction"}, {"score": 0.00481495049065317, "phrase": "relative_packing_groups"}, {"score": 0.004620093797504386, "phrase": "true_positive_constraints"}, {"score": 0.0040334640350288, "phrase": "conserved_relative_packing_groups"}, {"score": 0.0036481158025940047, "phrase": "global_topology"}, {"score": 0.003584025547693836, "phrase": "conformational_sampling"}, {"score": 0.003260690513595527, "phrase": "rpg-based_constraints"}, {"score": 0.0030374213037172803, "phrase": "deeper_investigation"}, {"score": 0.0029489527539649737, "phrase": "true_positive_spatial_constraints"}, {"score": 0.002651213849567608, "phrase": "nearer_native_models"}, {"score": 0.0025436978068459565, "phrase": "incorrect_or_false_positive_constraints"}, {"score": 0.0024118292918742967, "phrase": "final_candidate"}, {"score": 0.002130056082139311, "phrase": "weaker_effect"}, {"score": 0.0021049977753042253, "phrase": "false_positive_constraints"}], "paper_keywords": ["backbone conformation distance constraints", " protein structure prediction", " side-chain packing"], "paper_abstract": "Most current template-based structure prediction methods concentrate on finding the correct backbone conformation and then packing sidechains within that backbone. Our packing-based method derives distance constraints from conserved relative packing groups (RPGs). In our refinement approach, the RPGs provide a level of resolution that restrains global topology while allowing conformational sampling. In this study, we test our template-based structure prediction method using 51 prediction units from CASP7 experiments. RPG-based constraints are able to substantially improve approximately two-thirds of starting templates. Upon deeper investigation, we find that true positive spatial constraints, especially those non-local in sequence, derived from the RPGs were important to building nearer native models. Surprisingly, the fraction of incorrect or false positive constraints does not strongly influence the quality of the final candidate. This result indicates that our RPG-based true positive constraints sample the self-consistent, cooperative interactions of the native structure. The lack of such reinforcing cooperativity explains the weaker effect of false positive constraints. Generally, these findings are encouraging indications that RPGs will improve template-based structure prediction.", "paper_title": "Relative Packing Groups in Template-Based Structure Prediction: Cooperative Effects of True Positive Constraints", "paper_id": "WOS:000285965600002"}