{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "processor_design_bugs"}, {"score": 0.0044644734709113985, "phrase": "automatic_rectification"}, {"score": 0.004419703921314433, "phrase": "design_bugs"}, {"score": 0.004288059466938456, "phrase": "golden_sequential_instruction-set_architecture_model"}, {"score": 0.003975781274672803, "phrase": "symbolic_simulation_and_property_checking"}, {"score": 0.0037993970934472243, "phrase": "buggy_location"}, {"score": 0.0036491673002304326, "phrase": "truth-table_model"}, {"score": 0.0028498718992429825, "phrase": "new_variable"}, {"score": 0.0024125253170522816, "phrase": "complex_out-of-order_superscalar_processor"}, {"score": 0.0022937210378944457, "phrase": "model_size"}], "paper_keywords": ["design error diagnosis", " design error correction", " micro architecture debugging", " formal verification", " processors"], "paper_abstract": "This paper presents a method for automatic rectification of design bugs in processors. Given a golden sequential instruction-set architecture model of a processor and its erroneous detailed cycle-accurate model at the micro-architecture level, we perform symbolic simulation and property checking combined with concrete simulation iteratively to detect the buggy location and its corresponding fix. We have used the truth-table model of the function that is required for correction, which is a very general model. Moreover, we do not represent the truth-table explicitly in the design. We use, instead, only the required minterms, which are obtained from the output of our backend formal engine. This way, we avoid adding any new variable for representing the truth-table. Therefore, our correction model is scalable to the number of inputs of the truth-table that could grow exponentially. We have shown the effectiveness of our method on a complex out-of-order superscalar processor supporting atomic execution of instructions. Our method reduces the model size for correction by 6.0x and total correction time by 12.6x, on average, compared to our previous work.", "paper_title": "Automatic Rectification of Processor Design Bugs Using a Scalable and General Correction Model", "paper_id": "WOS:000342784100025"}