{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "social_networks"}, {"score": 0.011921782736199456, "phrase": "proposed_approach"}, {"score": 0.004624337472244542, "phrase": "great_need"}, {"score": 0.003963151292963256, "phrase": "sptf"}, {"score": 0.003778253716938922, "phrase": "ranked_list"}, {"score": 0.0037505809981715024, "phrase": "valuable_accounts"}, {"score": 0.003334309053314909, "phrase": "relevant_accounts"}, {"score": 0.002825681384008326, "phrase": "crowd-sourcing_organization"}, {"score": 0.0027036380093304747, "phrase": "sina_microblog"}, {"score": 0.002673957615079041, "phrase": "empirical_study"}, {"score": 0.002511803988580901, "phrase": "query_logs"}, {"score": 0.0024660058541899647, "phrase": "hot_queries"}, {"score": 0.0023164335087514252, "phrase": "pagerank-like_algorithms"}, {"score": 0.0022825763382627443, "phrase": "occupation-related_queries"}, {"score": 0.002191993482098238, "phrase": "academic-related_queries"}, {"score": 0.002175913488493802, "phrase": "domain-related_headcount_algorithms_work"}, {"score": 0.0021520139248317333, "phrase": "company-related_queries"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Social network mining", " Ranking algorithm", " Tag expansion and prediction", " SPTF"], "paper_abstract": "With the development of social networks, more and more users have a great need to search for people to follow (SPTF) to receive their tweets. According to our experiments, approximately 50% of social networks' lost users leave due to a lack of people to follow. In this paper, we define the problem of SPTF and propose an approach to give users tags and then deliver a ranked list of valuable accounts for them to follow. In the proposed approach, we first seek accounts related to keywords via expanding and predicting tags for users. Second, we propose two algorithms to rank relevant accounts: the first mines the forwarded relationship, and the second incorporates the following relationship into PageRank. Accordingly, we have built a search system(1) that to date, has received more than 1.7 million queries from 0.2 million users. To evaluate the proposed approach, we created a crowd-sourcing organization and crawled 0.25 billion profiles, 15 billion messages and 20 billion links representing following relationships on Sina Microblog. The empirical study validates the effectiveness of our algorithms for expanding and predicting tags compared to the baseline. From query logs, we discover that hot queries include keywords related to academics, occupations and companies. Experiments on those queries show that PageRank-like algorithms perform best for occupation-related queries, forward-relationship-like algorithms work best for academic-related queries and domain-related headcount algorithms work best for company-related queries. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Searching for people to follow in social networks", "paper_id": "WOS:000340689700042"}