{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "hal"}, {"score": 0.048140355629693064, "phrase": "multiple_genome_alignments"}, {"score": 0.028384817620416496, "phrase": "hal_graphs"}, {"score": 0.004536029676655286, "phrase": "large_multiple_genome_alignments"}, {"score": 0.004494570360108983, "phrase": "inferred_ancestral_genomes"}, {"score": 0.004453488286477661, "phrase": "ideal_resources"}, {"score": 0.004412780054037622, "phrase": "comparative_studies"}, {"score": 0.004372442291178139, "phrase": "molecular_evolution"}, {"score": 0.004234129588974058, "phrase": "computing_technology"}, {"score": 0.004007083686875716, "phrase": "rich_understanding"}, {"score": 0.0039522429946090174, "phrase": "genetic_relationships"}, {"score": 0.0037921662574137535, "phrase": "current_formats"}, {"score": 0.0037402558657576124, "phrase": "genomic_alignments"}, {"score": 0.0036721416244816455, "phrase": "xmfa"}, {"score": 0.0036385537134726986, "phrase": "maf"}, {"score": 0.0034911335714333507, "phrase": "single_reference_genome"}, {"score": 0.0026986685585382347, "phrase": "ancestral_reconstructions"}, {"score": 0.0024501740852758505, "phrase": "modular_and_parallel_access"}, {"score": 0.0021049977753042253, "phrase": "basic_operations"}], "paper_keywords": [""], "paper_abstract": "Motivation: Large multiple genome alignments and inferred ancestral genomes are ideal resources for comparative studies of molecular evolution, and advances in sequencing and computing technology are making them increasingly obtainable. These structures can provide a rich understanding of the genetic relationships between all subsets of species they contain. Current formats for storing genomic alignments, such as XMFA and MAF, are all indexed or ordered using a single reference genome, however, which limits the information that can be queried with respect to other species and clades. This loss of information grows with the number of species under comparison, as well as their phylogenetic distance. Results: We present HAL, a compressed, graph-based hierarchical alignment format for storing multiple genome alignments and ancestral reconstructions. HAL graphs are indexed on all genomes they contain. Furthermore, they are organized phylogenetically, which allows for modular and parallel access to arbitrary subclades without fragmentation because of rearrangements that have occurred in other lineages. HAL graphs can be created or read with a comprehensive C++ API. A set of tools is also provided to perform basic operations, such as importing and exporting data, identifying mutations and coordinate mapping (liftover).", "paper_title": "HAL: a hierarchical format for storing and analyzing multiple genome alignments", "paper_id": "WOS:000319428200013"}