{"auto_keywords": [{"score": 0.04763932090938615, "phrase": "health_information"}, {"score": 0.009977391388850485, "phrase": "demographic_characteristics"}, {"score": 0.009912778045035644, "phrase": "inactive_seekers"}, {"score": 0.008904568879845148, "phrase": "active_seekers"}, {"score": 0.00818237981007702, "phrase": "health_condition"}, {"score": 0.00807655271086321, "phrase": "health_media_exposure"}, {"score": 0.00481495049065317, "phrase": "inactive_health_information_seekers"}, {"score": 0.00445195298244008, "phrase": "possible_determinants"}, {"score": 0.004422962383171667, "phrase": "inactive_seeking_behaviors"}, {"score": 0.0039969114480547865, "phrase": "inactive_information_seeker_group"}, {"score": 0.0038557709801774176, "phrase": "potential_determinants"}, {"score": 0.0036832960694422765, "phrase": "health_service_use"}, {"score": 0.0035531906001888204, "phrase": "national_survey_data"}, {"score": 0.0029877254536170017, "phrase": "healthier_people"}, {"score": 0.0026126405272417783, "phrase": "study_data"}, {"score": 0.002587115505155995, "phrase": "statistically_significant_determinants"}, {"score": 0.002495633552236624, "phrase": "strong_indications"}, {"score": 0.002383854204260751, "phrase": "health_literacy"}, {"score": 0.0023682987863242427, "phrase": "behavioral_patterns"}, {"score": 0.0023451553255837317, "phrase": "advanced_study"}, {"score": 0.0022696277881969896, "phrase": "health_context"}, {"score": 0.0022037303797015095, "phrase": "negative_aspects"}, {"score": 0.002160862869106241, "phrase": "information_ignorance"}, {"score": 0.0021467594103960585, "phrase": "information_avoidance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Information seeking behavior", " Health care surveys", " Logistic models", " Cluster analysisa"], "paper_abstract": "Purpose: This study aims to identify people who do not actively seek out health information and the demographic characteristics of Inactive Seekers. The possible determinants of inactive seeking behaviors are also explored. Design and measurements: A total of 14,420 survey respondents were drawn from the 2009 Annenberg National Health Communication Survey (ANHCS) data. K-means clustering wasused to discriminate Inactive Seekers from Active Seekers. The inactive information seeker group was formed based on their experience with health information seeking. The potential determinants that were tested to predict inactive seeking included the following: health condition, health service use, health media exposure, and computer/Internet activities. Results: Within this national survey data, the respondents were more likely to be included in the Inactive Seekers (N = 8312, 58.5%) compared to Active Seekers ( N = 5908, 41.5%). The demographic characteristics indicated that the Inactive Seekers were identified as younger, male, highly educated, White, and high household income people. The binary logistic regression results from the study model indicated that healthier people were less likely to seek out health information than their counterparts. In addition, those who were exposed to various media were almost 1.6 times more likely to seek out health information than those who were not exposed to such media. Within this study data, the statistically significant determinants identified were health condition and health media exposure while computer/Internetactivities did not show strong indications in predicting inactive seeking behavior. Conclusion: The development of more generalizable measures for health literacy or behavioral patterns will bolster advanced study on inactive seeking relating to knowledge of technology and health context. Further study should be directed at estimating the negative aspects of information seeking such as information ignorance or information avoidance. (C) 2014 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "An exploratory study of inactive health information seekers", "paper_id": "WOS:000346422000004"}