{"auto_keywords": [{"score": 0.022048041688511016, "phrase": "medical_data"}, {"score": 0.010375155118747833, "phrase": "healthcare_statistics"}, {"score": 0.008689735676604698, "phrase": "secure_computation"}, {"score": 0.00787706650250683, "phrase": "processing_time"}, {"score": 0.007248641829786658, "phrase": "secret-sharing-based_secure_computation"}, {"score": 0.00649571043617844, "phrase": "conditional_expressions"}, {"score": 0.0055200241209994024, "phrase": "statistical_analysis"}, {"score": 0.00481495049065317, "phrase": "efficient_secure_computation_system"}, {"score": 0.004671156704912419, "phrase": "background_and"}, {"score": 0.004600870784042767, "phrase": "secondary_use"}, {"score": 0.004346547997061901, "phrase": "patient_privacy"}, {"score": 0.004121826934975274, "phrase": "data_concerns"}, {"score": 0.0040290957541568775, "phrase": "rigorous_security_management_measures"}, {"score": 0.003763186299187111, "phrase": "encrypted_medical_records"}, {"score": 0.003371066990851953, "phrase": "statistical_computing_software"}, {"score": 0.0031010029460927864, "phrase": "average_and_unbiased_variance"}, {"score": 0.0030542703032534766, "phrase": "dummy_insurance_claim_data"}, {"score": 0.00265394824073552, "phrase": "medical_records"}, {"score": 0.002459810433812049, "phrase": "high-level_security"}, {"score": 0.0024043803470189455, "phrase": "encrypted_state"}, {"score": 0.0022972306948217548, "phrase": "basic_statistics"}, {"score": 0.002203200914130907, "phrase": "secure_computation_protocols"}, {"score": 0.002169968849836984, "phrase": "significant_amount"}, {"score": 0.0021049977753042253, "phrase": "secure_statistical_analysis_system"}], "paper_keywords": [""], "paper_abstract": "Background and objective While the secondary use of medical data has gained attention, its adoption has been constrained due to protection of patient privacy. Making medical data secure by de-identification can be problematic, especially when the data concerns rare diseases. We require rigorous security management measures. Materials and methods Using secure computation, an approach from cryptography, our system can compute various statistics over encrypted medical records without decrypting them. An issue of secure computation is that the amount of processing time required is immense. We implemented a system that securely computes healthcare statistics from the statistical computing software 'R' by effectively combining secret-sharing-based secure computation with original computation. Results Testing confirmed that our system could correctly complete computation of average and unbiased variance of approximately 50 000 records of dummy insurance claim data in a little over a second. Computation including conditional expressions and/or comparison of values, for example, t test and median, could also be correctly completed in several tens of seconds to a few minutes. Discussion If medical records are simply encrypted, the risk of leaks exists because decryption is usually required during statistical analysis. Our system possesses high-level security because medical records remain in encrypted state even during statistical analysis. Also, our system can securely compute some basic statistics with conditional expressions using 'R' that works interactively while secure computation protocols generally require a significant amount of processing time. Conclusions We propose a secure statistical analysis system using 'R' for medical data that effectively integrates secret-sharing-based secure computation and original computation.", "paper_title": "Implementation and evaluation of an efficient secure computation system using 'R' for healthcare statistics", "paper_id": "WOS:000341858100021"}