{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "linguistic_tool_support"}, {"score": 0.048636009815037955, "phrase": "multiple_sources"}, {"score": 0.03249223992321251, "phrase": "original_study"}, {"score": 0.004622450915803531, "phrase": "large_market-driven_software_companies"}, {"score": 0.004437613070853689, "phrase": "change_requests"}, {"score": 0.003545024951402821, "phrase": "replicated_experiment"}, {"score": 0.0033857878144822906, "phrase": "requirements_consolidation_task"}, {"score": 0.0033173234105492895, "phrase": "replication_study"}, {"score": 0.002934566917795928, "phrase": "requirements_consolidation"}, {"score": 0.0026494723416072316, "phrase": "linguistic_method"}, {"score": 0.002466510117718297, "phrase": "searching_and_filtering_method"}, {"score": 0.002284444272376043, "phrase": "previous_results"}, {"score": 0.002249672943553135, "phrase": "assisted_method"}, {"score": 0.0021049977753042253, "phrase": "manual_method"}], "paper_keywords": ["Requirements engineering", " Experiment", " Linguistic method", " Replication"], "paper_abstract": "Large market-driven software companies continuously receive large numbers of requirements and change requests from multiple sources. The task of analyzing those requests against each other and against already analyzed or implemented functionality then recording similarities between them, also called the requirements consolidation task, may be challenging and time consuming. This paper presents a replicated experiment designed to further investigate the linguistic tool support for the requirements consolidation task. In this replication study, 45 subjects, working in pairs on the same set of requirements as in the original study, were assigned to use two methods for the requirements consolidation: (1) lexical similarity and (2) searching and filtering. The results show that the linguistic method used in this experiment is not more efficient in consolidating requirements than the searching and filtering method, which contradicts the findings of the original study. However, we confirm the previous results that the assisted method (lexical similarity) can deliver more correct links and miss fewer links than the manual method (searching and filtering).", "paper_title": "Replication of an experiment on linguistic tool support for consolidation of requirements from multiple sources", "paper_id": "WOS:000300343800006"}