{"auto_keywords": [{"score": 0.04872654495804916, "phrase": "continuous_phenotypes"}, {"score": 0.00481495049065317, "phrase": "functional_linkages"}, {"score": 0.004723847090183984, "phrase": "phylogenetic_profiles"}, {"score": 0.004525088883501587, "phrase": "non-homology-based_methods"}, {"score": 0.004232331639807526, "phrase": "phenotypic_trait"}, {"score": 0.003902085339580381, "phrase": "binary_strings"}, {"score": 0.003791763445590174, "phrase": "phylogenetic_distribution"}, {"score": 0.00326939082861424, "phrase": "priori_rules"}, {"score": 0.00311669276800628, "phrase": "binary_profiles"}, {"score": 0.00290087451159631, "phrase": "phenotype_values"}, {"score": 0.0028053237950173508, "phrase": "optimal_growth_temperatures"}, {"score": 0.0026235360404084137, "phrase": "thermophilic_growth"}, {"score": 0.002549269480908849, "phrase": "general_approach"}, {"score": 0.002500927169609655, "phrase": "first_time"}, {"score": 0.0024652715040303416, "phrase": "optimal_growth_ph"}, {"score": 0.0024185182010749273, "phrase": "novel_predictions"}, {"score": 0.0021049977753042253, "phrase": "genome_size"}], "paper_keywords": [""], "paper_abstract": "Motivation: A class of non-homology-based methods for protein function prediction relies on the assumption that genes linked to a phenotypic trait are preferentially conserved among organisms that share the trait. These methods typically compare pairs of binary strings, where one string encodes the phylogenetic distribution of a trait and the other of a protein. In this work, we extended the approach to automatically deal with continuous phenotypes. Results: Rather than use a priori rules, which can be very subjective, to construct binary profiles from continuous phenotypes, we propose to systematically explore thresholds which can meaningfully separate the phenotype values. We illustrate our method by analyzing optimal growth temperatures, and demonstrate its usefulness by automatically retrieving genes which have been associated with thermophilic growth. We also apply the general approach, for the first time, to optimal growth pH, and make novel predictions. Finally, we show that our method can also be applied to other properties which may not be classically considered as phenotypes. Specifically, we studied correlations between genome size and the distribution of genes.", "paper_title": "Assigning functional linkages to proteins using phylogenetic profiles and continuous phenotypes", "paper_id": "WOS:000255756500006"}