{"auto_keywords": [{"score": 0.04972867160744286, "phrase": "online_neuroevolution"}, {"score": 0.00481495049065317, "phrase": "open_racing_car_simulator"}, {"score": 0.004590496414177077, "phrase": "nonplayer_characters"}, {"score": 0.004457579615095599, "phrase": "previous_approaches"}, {"score": 0.0043764594918057915, "phrase": "performance_improvements"}, {"score": 0.0042497136254424995, "phrase": "finer_grained_online_learning"}, {"score": 0.0035233696341819437, "phrase": "eight_resulting_configurations"}, {"score": 0.0034212450542713607, "phrase": "driving_behavior"}, {"score": 0.0033837135367113004, "phrase": "specific_track"}, {"score": 0.0033220706785945815, "phrase": "new_track"}, {"score": 0.00327356326590461, "phrase": "generalization_capability"}, {"score": 0.003249574947858394, "phrase": "unknown_tracks"}, {"score": 0.0026838147966444783, "phrase": "difficult_unseen_tracks"}, {"score": 0.002549055233558127, "phrase": "neat"}, {"score": 0.0023507916951658455, "phrase": "typical_offline_neuroevolution"}, {"score": 0.00226583335721762, "phrase": "traditional_offline_approaches"}, {"score": 0.0021049977753042253, "phrase": "initial_step"}], "paper_keywords": ["Machine learning", " neuroevolution", " online learning", " online neuroevolution", " simulated car racing"], "paper_abstract": "In this paper, we applied online neuroevolution to evolve nonplayer characters for The Open Racing Car Simulator (TORCS). While previous approaches allowed online learning with performance improvements during each generation, our approach enables a finer grained online learning with performance improvements within each lap. We tested our approach on three tracks using two methods of online neuroevolution (NEAT and rtNEAT) combined with four evaluation strategies (epsilon-greedy, epsilon-greedy-improved, softmax, and interval-based) taken from the literature. We compared the eight resulting configurations on several driving tasks involving the learning of a driving behavior for a specific track, its adaptation to a new track, and the generalization capability to unknown tracks. The results we present show that, notwithstanding the several challenges that online learning poses, our approach 1) can successfully evolve drivers from scratch, 2) can also be used to transfer evolved knowledge to other tracks, and 3) can generalize effectively producing controllers that can drive on difficult unseen tracks. Our results also suggest that the approach performs better when coupled with online NEAT and also indicate that epsilon-greedy-improved and softmax are generally better than the other evaluation strategies. A comparison with typical offline neuroevolution suggests that online neuroevolution can be competitive and even outperform traditional offline approaches on more difficult tracks while providing all the interesting features of online learning. Overall, we believe that this study may represent an initial step toward the application of online neuroevolution in games.", "paper_title": "Learning to Drive in the Open Racing Car Simulator Using Online Neuroevolution", "paper_id": "WOS:000295471600003"}