{"auto_keywords": [{"score": 0.04961049691122095, "phrase": "cognitive_appraisal_theories"}, {"score": 0.00481495049065317, "phrase": "mind_reasoning"}, {"score": 0.004674952036988355, "phrase": "human_emotional_experience"}, {"score": 0.004363846362238565, "phrase": "model_emotions"}, {"score": 0.004133940019630129, "phrase": "real_emotions"}, {"score": 0.004073359218158693, "phrase": "virtual_characters"}, {"score": 0.003974349782102708, "phrase": "human_user's_emotional_experience"}, {"score": 0.003916098498242888, "phrase": "human-computer_interaction"}, {"score": 0.0037463983616303786, "phrase": "computational_modeling"}, {"score": 0.0036553070575015344, "phrase": "multi-agent_decision-theoretic_framework"}, {"score": 0.003462599815177726, "phrase": "five_key_appraisal_dimensions"}, {"score": 0.0028016507334576216, "phrase": "social_emotions"}, {"score": 0.0024768883044869023, "phrase": "pomdp-based_agents"}, {"score": 0.002404706573379854, "phrase": "tight_relationship"}, {"score": 0.002323142666222693, "phrase": "appraisal_dimensions"}, {"score": 0.0022005118194652704, "phrase": "agent's_decision-making"}, {"score": 0.0021049977753042253, "phrase": "uniform_cognitive_structure"}], "paper_keywords": ["Emotion", " Decision-making", " Appraisal", " Multi-agent system"], "paper_abstract": "Cognitive appraisal theories, which link human emotional experience to their interpretations of events happening in the environment, are leading approaches to model emotions. Cognitive appraisal theories have often been used both for simulating \"real emotions\" in virtual characters and for predicting the human user's emotional experience to facilitate human-computer interaction. In this work, we investigate the computational modeling of appraisal in a multi-agent decision-theoretic framework using Partially Observable Markov Decision Process-based (POMDP) agents. Domain-independent approaches are developed for five key appraisal dimensions ( motivational relevance, motivation congruence, accountability, control and novelty). We also discuss how the modeling of theory of mind ( recursive beliefs about self and others) is realized in the agents and is critical for simulating social emotions. Our model of appraisal is applied to three different scenarios to illustrate its usages. This work not only provides a solution for computationally modeling emotion in POMDP-based agents, but also illustrates the tight relationship between emotion and cognition-the appraisal dimensions are derived from the processes and information required for the agent's decision-making and belief maintenance processes, which suggests a uniform cognitive structure for emotion and cognition.", "paper_title": "Modeling appraisal in theory of mind reasoning", "paper_id": "WOS:000273806500003"}