{"auto_keywords": [{"score": 0.048539652036902976, "phrase": "tie_strength"}, {"score": 0.043208135289251076, "phrase": "social_networks"}, {"score": 0.03164044153479802, "phrase": "location-based_social_networks"}, {"score": 0.00481495049065317, "phrase": "location-based_and_online_social_networks"}, {"score": 0.004573953147933065, "phrase": "typically_only_one_type"}, {"score": 0.004264558080356621, "phrase": "social_relations"}, {"score": 0.004205226397573506, "phrase": "particular_partnership"}, {"score": 0.0034238045290210534, "phrase": "user_pairs"}, {"score": 0.0032827577713351336, "phrase": "significant_differences"}, {"score": 0.0031036643805367487, "phrase": "social_proximity"}, {"score": 0.0030461580449080553, "phrase": "supervised_and_unsupervised_learning_approaches"}, {"score": 0.002853124436286832, "phrase": "partner_relationship"}, {"score": 0.0025264171945423254, "phrase": "online_social_network_data"}, {"score": 0.0024912073108138613, "phrase": "classification_power"}, {"score": 0.0022793032191981404, "phrase": "great_extent"}, {"score": 0.0021049977753042253, "phrase": "social_network_analysis"}], "paper_keywords": ["Online social networks", " Location-based social networks", " Partner detection", " Virtual worlds"], "paper_abstract": "Existing approaches to identify the tie strength between users involve typically only one type of network. To date, no studies exist that investigate the intensity of social relations and in particular partnership between users across social networks. To fill this gap in the literature, we studied over 50 social proximity features to detect the tie strength of users defined as partnership in two different types of networks: location-based and online social networks. We compared user pairs in terms of partners and non-partners and found significant differences between those users. Following these observations, we evaluated the social proximity of users via supervised and unsupervised learning approaches and establish that location-based social networks have a great potential for the identification of a partner relationship. In particular, we established that location-based social networks and correspondingly induced features based on events attended by users could identify partnership with 0.922 AUC, while online social network data had a classification power of 0.892 AUC. When utilizing data from both types of networks, a partnership could be identified to a great extent with 0.946 AUC. This article is relevant for engineers, researchers and teachers who are interested in social network analysis and mining.", "paper_title": "Detecting partnership in location-based and online social networks", "paper_id": "WOS:000366196300017"}