{"auto_keywords": [{"score": 0.048539652036902955, "phrase": "cdc"}, {"score": 0.00481495049065317, "phrase": "roadm_colorless"}, {"score": 0.004573953147933065, "phrase": "optical_network_performance"}, {"score": 0.004385733482617193, "phrase": "dynamic_lightpath_service_provisioning"}, {"score": 0.0037069087922811488, "phrase": "fixed_shortest_path_routing"}, {"score": 0.0036213041338584756, "phrase": "analytical_models"}, {"score": 0.003504756881063581, "phrase": "cdc_features"}, {"score": 0.003407839062159497, "phrase": "adaptive_lightpath_route_selection"}, {"score": 0.003206916619690171, "phrase": "proposed_analytical_models"}, {"score": 0.0030178044717552605, "phrase": "simulation_results"}, {"score": 0.0028799352389969443, "phrase": "colorless_feature"}, {"score": 0.0027612315954598085, "phrase": "lightpath_blocking_performance"}, {"score": 0.0026105159490849364, "phrase": "saturation_phenomenon"}, {"score": 0.002514625755809045, "phrase": "nodal_degree"}, {"score": 0.002456486927713543, "phrase": "performance_improvement"}, {"score": 0.0021049977753042253, "phrase": "wavelength_assignment"}], "paper_keywords": ["Add/drop port allocation", " Analytical model", " Colorless", " Contentionless", " Directionless", " Lightpath routing", " Optical networks"], "paper_abstract": "In the context of dynamic lightpath service provisioning, this paper evaluates the impact of the colorless, directionless, and contentionless (CDC) features of reconfigurable optical add/drop multiplexers on wavelength division multiplexing optical transport networks (OTNs). Under the assumption of fixed shortest path routing, we first develop analytical models for evaluating the impacts of the CDC features. Next, allowing for adaptive lightpath route selection, we propose three lightpath routing and add/drop port selection strategies. Simulation studies indicate that the proposed analytical models can effectively predict the performance of the OTNs under different add/drop port capabilities. The simulation results also show that, among the three features, the colorless feature seems to play the most important role in improving the lightpath blocking performance. In addition, under the colorless add/drop capability, there exists a saturation phenomenon: when the number of add/drop ports per nodal degree reaches a certain threshold level, performance improvement will be marginal even if the number of add/drop ports is further increased. Finally, comparing the three adaptive lightpath routing and add/drop allocation strategies, the results show that the consideration of the add/drop port state information in lightpath routing and wavelength assignment can significantly improve the lightpath blocking performance.", "paper_title": "Impact of ROADM Colorless, Directionless, and Contentionless (CDC) Features on Optical Network Performance [Invited]", "paper_id": "WOS:000311794600009"}