{"auto_keywords": [{"score": 0.040782441538461334, "phrase": "aermod"}, {"score": 0.006586357461149238, "phrase": "air_pollutants"}, {"score": 0.00481495049065317, "phrase": "different_time_scales"}, {"score": 0.004761010795871555, "phrase": "high-density_monitoring_networks"}, {"score": 0.004301834610818624, "phrase": "fairly_recent_and_promising_model"}, {"score": 0.004081385289516914, "phrase": "different_time"}, {"score": 0.0038431888954930083, "phrase": "sulfur_dioxide"}, {"score": 0.0037433823491355945, "phrase": "dallas"}, {"score": 0.0037153426267756452, "phrase": "ellis_counties"}, {"score": 0.003687517549507001, "phrase": "texas"}, {"score": 0.003446208270665051, "phrase": "annual_intervals"}, {"score": 0.003043957650600757, "phrase": "model_inputs"}, {"score": 0.0029984960344766705, "phrase": "point_or_mobile_emission_sources"}, {"score": 0.0028877818105020434, "phrase": "monthly_scale"}, {"score": 0.0027916287357898544, "phrase": "high_end"}, {"score": 0.002688532127821979, "phrase": "study_area"}, {"score": 0.0024287485834314027, "phrase": "useful_information"}, {"score": 0.0022610992177831643, "phrase": "chronic_exposure_assessment"}, {"score": 0.0022441378838655712, "phrase": "epidemiological_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["AERMOD", " Air dispersion modeling", " GIS", " Exposure assessment", " Environmental health"], "paper_abstract": "As high-density monitoring networks observing pollutant concentrations are costly to establish and maintain, researchers often employ various models to estimate concentrations of air pollutants. The AMS/EPA Regulatory Model (AERMOD) is a fairly recent and promising model for estimating concentrations of air pollutants, but the effectiveness of this model at different time scales remains to be verified. This paper evaluates the performance of AERMOD in estimating sulfur dioxide (SO(2)) concentrations in Dallas and Ellis counties in Texas. Results suggest that SO(2) concentrations simulated by AERMOD at the 8 h, daily, monthly, and annual intervals match their respective observed concentrations much better compared with the simulated 1 and 3 h SO(2) concentrations. In addition, AERMOD performs better in simulating SO(2) concentrations when combined point and mobile emission sources are used as model inputs rather than using point or mobile emission sources alone. Results also suggest that, at the monthly scale, AERMOD performs much better in simulating the high end of the spectrum of SO(2) concentrations in the study area compared to results at the 1, 3, 8 h, and daily scales. These results not only help us better understand the performance of AERMOD but also provide useful information to researchers who are interested in applying AERMOD in various applications, such as the utilization of AERMOD in chronic exposure assessment in epidemiological studies where long-term (i.e., monthly and/or annual) air pollution concentration estimations are often used. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Performance of AERMOD at different time scales", "paper_id": "WOS:000276597200011"}