{"auto_keywords": [{"score": 0.047626415189153545, "phrase": "vibrio_fischeri"}, {"score": 0.008713768692145006, "phrase": "molecular_docking"}, {"score": 0.008508951795185193, "phrase": "reactive_chemicals"}, {"score": 0.00734150445748529, "phrase": "freshwater_samples"}, {"score": 0.007100727282622159, "phrase": "sensitive_difference"}, {"score": 0.005980955830151876, "phrase": "target_proteins"}, {"score": 0.0055679068274855775, "phrase": "amino_acid_residues"}, {"score": 0.004612376827433774, "phrase": "marine_luminous_bacteria"}, {"score": 0.004503525064934708, "phrase": "marine_luminous_bacterium"}, {"score": 0.004355415885815204, "phrase": "toxicity_bioassays"}, {"score": 0.004232331639807526, "phrase": "newly_found_freshwater_species"}, {"score": 0.0037556843869894566, "phrase": "chemical_modes"}, {"score": 0.0036669760226536977, "phrase": "tested_species"}, {"score": 0.0035125292519354724, "phrase": "toxicity_changes"}, {"score": 0.0034790978593553794, "phrase": "luminous_bioassays"}, {"score": 0.0028187792953857957, "phrase": "amino_acids"}, {"score": 0.002500927169609655, "phrase": "binding_affinity"}, {"score": 0.002350041573006264, "phrase": "distinct_toxic_effect"}, {"score": 0.0021049977753042253, "phrase": "plentiful_toxicity_data"}], "paper_keywords": ["Amino acid residue", " CDOCKER", " Docking", " Freshwater", " Mutation"], "paper_abstract": "Vibrio fischeri is a marine luminous bacterium that has been widely used in toxicity bioassays, while Vibrio qinghaiensis sp.-Q67 is a newly found freshwater species which is more suitable for the tests on freshwater samples. However, there is a sensitive difference between these two species due to the media, chemical modes of action and the tested species. It remains unclear how these factors induce toxicity changes in luminous bioassays. Therefore, by using molecular docking between reactive chemicals and the target proteins of Vibrio fischeri and Vibrio qinghaiensis sp.-Q67 respectively, the sensitive difference was explored from the angle of amino acid residues that involved in the interactions. Mutation of amino acid residues was performed to investigate the role of these amino acids in the interactions and the most important amino acid residues in toxicity effect were found. The results suggested tat the most important amino acid residues in toxicity effect would affect the binding affinity between chemicals and target proteins of Vibrio fischeri and Vibrio qinghaiensis sp.-Q67, and then induce distinct toxic effect on them. As there are fewer toxicity data for freshwater Vibrio qinghaiensis sp.-Q67 than for Vibrio fischeri, this study helps to take advantage of the plentiful toxicity data of Vibrio fischeri to predict toxicities of freshwater samples.", "paper_title": "Using Molecular Docking to Compare Toxicity of Reactive Chemicals to Freshwater and Marine Luminous Bacteria", "paper_id": "WOS:000312693300005"}