{"auto_keywords": [{"score": 0.028887109221877653, "phrase": "pub"}, {"score": 0.00481495049065317, "phrase": "partial_coverage"}, {"score": 0.0047310525657970615, "phrase": "good_description"}, {"score": 0.004519665344659923, "phrase": "previous_works"}, {"score": 0.004472234553892357, "phrase": "class-description_problem"}, {"score": 0.0035831245825960617, "phrase": "data_analysis_point"}, {"score": 0.0033395304916220086, "phrase": "richer_yet_interpretable_form"}, {"score": 0.003178904945309528, "phrase": "k_attributes"}, {"score": 0.0031124451011241496, "phrase": "specified_constraints"}, {"score": 0.002931569771634119, "phrase": "simple_enhancement"}, {"score": 0.002880393760798211, "phrase": "previous_solutions"}, {"score": 0.002415170557932468, "phrase": "linear_time"}, {"score": 0.0022036996784968793, "phrase": "illustrative_case_study"}, {"score": 0.0021805201234139475, "phrase": "glass_dataset"}, {"score": 0.0021499920551456956, "phrase": "useful_insights"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data mining", " Knowledge management", " Class description", " Classification"], "paper_abstract": "A good description of a class should be (reasonably) accurate and interpretable. Previous works address this class-description problem by either analyzing the correlation of each attribute with the class, or by producing rules as in building a classifier. These solutions suffer from issues in accuracy and interpretability. A sentence is usually defined as a disjunction or conjunction of several terms, each of which specifies a constraint (range/set of values) on an attribute. From the data analysis point of view, a sentence specifies a subspace in the database. In this paper, we create a richer yet interpretable form of a sentence. Here, a sentence describes an object if any k attributes of that object satisfy the specified constraints, or in other words, the object is partially covered by the subspace. Since this simple enhancement subsumes rules used in previous solutions, descriptions based on such sentences are provably better. To that end, we design PUB, an algorithm that produces descriptions with our form of sentences. Theoretically, while constructing a sentence (within the description). PUB finds the optimal range/set of values for each attribute in linear time. Empirically, we show that PUB is efficient, and able to produce more accurate, concise and interpretable descriptions than current approaches on various real datasets. We also perform an illustrative case study on the Glass dataset, providing some useful insights. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Class description using partial coverage of subspaces", "paper_id": "WOS:000292169500005"}