{"auto_keywords": [{"score": 0.025763561249216055, "phrase": "balduzzi"}, {"score": 0.00481495049065317, "phrase": "close_link"}, {"score": 0.004761494044422926, "phrase": "conscious_experience"}, {"score": 0.003367611042980526, "phrase": "key_problems"}, {"score": 0.003311604528903634, "phrase": "current_information_integration_measures"}, {"score": 0.003166751241099304, "phrase": "computer_processing_power"}, {"score": 0.0028795712616923462, "phrase": "current_algorithms"}, {"score": 0.002603758927691463, "phrase": "new_automata-based_algorithm"}, {"score": 0.002531933388815139, "phrase": "information_integration"}, {"score": 0.002475898613632249, "phrase": "different_approaches"}, {"score": 0.0023941575109692336, "phrase": "tononi"}, {"score": 0.0023021895404322767, "phrase": "neural_simulator"}, {"score": 0.0021891056047126166, "phrase": "preliminary_comparisons"}, {"score": 0.002128694000627911, "phrase": "phi_measures"}, {"score": 0.0021049977753042253, "phrase": "simple_four_neuron_networks"}], "paper_keywords": [""], "paper_abstract": "In recent years a number of people have suggested that there is a close link between conscious experience and the differentiation and integration of information in certain areas of the brain. The balance between differentiation and integration is often called information integration, and a number of algorithms for measuring it have been put forward, which can be used to make predictions about consciousness and to understand the relationships between neurons in a network. One of the key problems with the current information integration measures is that they take a lot of computer processing power, which limits their application to networks of around a dozen neurons. There are also more general issues about whether the current algorithms accurately reflect the consciousness associated with a system. This paper addresses these issues by exploring a new automata-based algorithm for the calculation of information integration. To benchmark different approaches we implemented the Balduzzi and Tononi algorithm as a plugin to the Spike Stream neural simulator, and used it to carry out some preliminary comparisons of the liveliness and Phi measures on simple four neuron networks.", "paper_title": "Informational Theories of Consciousness: A Review and Extension", "paper_id": "WOS:000293603200012"}