{"auto_keywords": [{"score": 0.00465944657565638, "phrase": "inevitable_trend"}, {"score": 0.0037636590459094762, "phrase": "carrier-grade_nat"}, {"score": 0.003429001377800258, "phrase": "excluded_port_range"}, {"score": 0.00319324425647735, "phrase": "cgn_solutions"}, {"score": 0.002989991779830814, "phrase": "large-scale_deployments"}, {"score": 0.0028305047329728254, "phrase": "dynamic_port_requirements"}, {"score": 0.0026942333853202556, "phrase": "hybrid_mechanism"}, {"score": 0.002650279521276126, "phrase": "current_solutions"}, {"score": 0.002522662955545598, "phrase": "real_traffic_data"}, {"score": 0.002323446065342625, "phrase": "end_hosts"}, {"score": 0.002260591903283384, "phrase": "enhanced_mechanism"}, {"score": 0.002163535133532765, "phrase": "service_providers"}, {"score": 0.0021399277552314067, "phrase": "address_plans"}], "paper_keywords": ["IPv6 transition", " Carrier-grade NAT (CGN)", " A plus P", " Address sharing", " Dynamic switching"], "paper_abstract": "IPv6 has been an inevitable trend with the depletion of the global IPv4 address space. However, new IPv6 users still need public IPv4 addresses to access global IPv4 users/resources, making it important for providers to share scarce global IPv4 addresses effectively. There are two categories of solutions to the problem, carrier-grade NAT (CGN) and 'A+P' (each customer sharing the same IPv4 address is assigned an excluded port range). However, both of them have limitations. Specifically, CGN solutions are not scalable and can bring much complexity in managing customers in large-scale deployments, while A+P solutions are not flexible enough to meet dynamic port requirements. In this paper, we propose a hybrid mechanism to improve current solutions and have deployed it in the Tsinghua University Campus Network. The real traffic data shows that our mechanism can utilize limited IPv4 addresses efficiently without degrading the performance of applications on end hosts. Based on the enhanced mechanism, we propose a method to help service providers make address plans based on their own traffic patterns and actual requirements.", "paper_title": "A scalable and efficient IPv4 address sharing approach in IPv6 transition scenarios", "paper_id": "WOS:000359399700002"}