{"auto_keywords": [{"score": 0.03441964071092512, "phrase": "optimal_solution"}, {"score": 0.030449280485971855, "phrase": "non-discrete_problem"}, {"score": 0.004602962063744722, "phrase": "wireless_connection"}, {"score": 0.0045207914492316195, "phrase": "mobile_relays"}, {"score": 0.004321697758191366, "phrase": "arbitrary_battery_capacities"}, {"score": 0.004149989918213539, "phrase": "exponential_function"}, {"score": 0.004003073486888899, "phrase": "different_locations"}, {"score": 0.00343432918780668, "phrase": "second_model"}, {"score": 0.003216981610564751, "phrase": "movement_cost"}, {"score": 0.0031594745447420776, "phrase": "discrete_version"}, {"score": 0.0031381745834945024, "phrase": "single_deployment_model"}, {"score": 0.0030751297648682523, "phrase": "grid_points"}, {"score": 0.002946151297704133, "phrase": "potential_lifetimes"}, {"score": 0.0027783510526127467, "phrase": "initial_positions"}, {"score": 0.0027163807310436137, "phrase": "transmission_interval"}, {"score": 0.0026798622090161333, "phrase": "dominant_order"}, {"score": 0.0025674195351333487, "phrase": "discrete_problem"}, {"score": 0.002550126583271685, "phrase": "fptas"}, {"score": 0.0024486081595712175, "phrase": "additional_ideas"}, {"score": 0.0023993831431264405, "phrase": "multiple_deployments_model"}, {"score": 0.002335282094353215, "phrase": "lower_bound"}, {"score": 0.0022883300755991353, "phrase": "upper_bound"}, {"score": 0.002278024870371009, "phrase": "cost-free_movement"}, {"score": 0.0022071733761253407, "phrase": "sensible_starting_locations"}, {"score": 0.002197232844950128, "phrase": "battery_capacities"}, {"score": 0.0021481962761581886, "phrase": "initial_locations"}, {"score": 0.0021336993708209974, "phrase": "single_deployment"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Deployment", " Mobility", " Network lifetime", " Relays", " Sensor networks"], "paper_abstract": "As sensor mobility becomes more and more universal, Wireless Sensor Network (WSN) configurations that utilize such mobility will become the norm. We consider the problem of maximizing the lifetime of a wireless connection between a transmitter and a receiver using mobile relays. Initially, all relays are positioned arbitrarily on the line between the transmitter and the receiver and have arbitrary battery capacities. Energy is consumed in proportion to the distance traveled for mobility and in proportion to an exponential function of the distance over which information is sent for communication. Relays can move to different locations as long as they have the energy to do so. The objective is to find positions (which define transmission ranges) for the nodes that maximize the lifetime of the network. We study two models. The first is more restrictive, and corresponds to the case where relays are allowed to be set once at time zero (single deployment), while the second model corresponds to the case where relays can be adjusted multiple times (multiple deployments). We show how to compute an optimal solution for the case of no movement cost for both models. We consider a discrete version of the single deployment model, in which relays must be deployed on grid points. We provide two algorithms for this case: a dynamic programming algorithm and a binary search algorithm on potential lifetimes. We prove that both algorithms are FPTASs for the non-discrete problem, if batteries are not too small. We then show that if the initial positions of all relays are at either end of the transmission interval, then there exists a dominant order for the relays and the algorithms may be applied with this order to achieve an optimal solution in the discrete problem or an FPTAS for the non-discrete problem, if batteries are not too small. Based on these algorithms and on additional ideas we develop a number of heuristics for the multiple deployments model. We evaluate them using simulations and compare them with the lower bound of relays not moving at all and the upper bound of cost-free movement. Our simulations - across a range of mobility and transmission costs, sensible starting locations and battery capacities - demonstrate the benefit of moving over remaining at initial locations even for single deployment. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Should I stay or should I go? Maximizing lifetime with relays", "paper_id": "WOS:000340693000014"}