{"auto_keywords": [{"score": 0.045171522171843934, "phrase": "everyday_environments"}, {"score": 0.036954893243603605, "phrase": "live_experience"}, {"score": 0.03352183870605411, "phrase": "instrumented_environments"}, {"score": 0.03104244392514206, "phrase": "electronic_whiteboards"}, {"score": 0.02550650899669681, "phrase": "automatic_linking"}, {"score": 0.02462459217486837, "phrase": "different_experiences"}, {"score": 0.02343967328143765, "phrase": "original_results"}, {"score": 0.00481495049065317, "phrase": "live_experiences"}, {"score": 0.00467855218490191, "phrase": "ubiquitous_infrastructure"}], "paper_keywords": ["ubiquitous computing", " capture and access applications", " hypermedia"], "paper_abstract": "Ubiquitous computing aims at providing services to users in everyday environments such as the home. One research theme in this area is that of building capture and access applications which support information to be recorded ( captured) during a live experience toward automatically producing documents for review (accessed). The recording demands instrumented environments with devices such as microphones, cameras, sensors and electronic whiteboards. Since each experience is usually related to many others ( e. g. several meetings of a project), there is a demand for mechanisms supporting the automatic linking among documents relative to different experiences. In this paper we present original results relative to the integration of our previous efforts in the Infrastructure for Capturing, Accessing, Linking, Storing and Presenting information (CALiSP). Ubiquitous computing aims at providing services to users in everyday environments such as the home. One research theme in this area is that of building capture and access applications which support information to be recorded (captured) during a live experience toward automatically producing documents for review (accessed). The recording demands instrumented environments with devices such as microphones, cameras, sensors and electronic whiteboards. Since each experience is usually related to many others (e.g. several meetings of a project), there is a demand for mechanisms supporting the automatic linking among documents relative to different experiences. In this paper we present original results relative to the integration of our previous efforts in the Infrastructure for Capturing, Accessing, Linking, Storing and Presenting information (CALiSP).", "paper_title": "Automatically linking live experiences captured with a ubiquitous infrastructure", "paper_id": "WOS:000253522600001"}