{"auto_keywords": [{"score": 0.04411035743028822, "phrase": "stepstools"}, {"score": 0.015719716506582538, "phrase": "automated_dose-rounding_algorithm"}, {"score": 0.015159882476549348, "phrase": "e-prescribing_systems"}, {"score": 0.012088760193571064, "phrase": "test_sample"}, {"score": 0.008930577762767941, "phrase": "test_cases"}, {"score": 0.004734175871914184, "phrase": "unique_and_complex_process"}, {"score": 0.004512564966999066, "phrase": "central_service_provider"}, {"score": 0.004241036972631408, "phrase": "dose-rounding_algorithm"}, {"score": 0.004169849868036158, "phrase": "expert_consensus"}, {"score": 0.004134703797937116, "phrase": "rounding_process"}, {"score": 0.003952181032417829, "phrase": "electronically-generated_prescriptions"}, {"score": 0.0038748723665440027, "phrase": "web_services"}, {"score": 0.003610865367437772, "phrase": "automatically_calculated_optimal_doses"}, {"score": 0.003510351672687489, "phrase": "discrepant_doses"}, {"score": 0.0033742996685636687, "phrase": "response_rate"}, {"score": 0.003135422638024283, "phrase": "recommended_dose"}, {"score": 0.0031089681395614654, "phrase": "dose_recommendation"}, {"score": 0.0030223831060276728, "phrase": "test_prescription"}, {"score": 0.002872544201947737, "phrase": "stepstools_recommendations"}, {"score": 0.0024870342145510184, "phrase": "extremely_small_dose"}, {"score": 0.0023838009411340237, "phrase": "overall_performance"}, {"score": 0.0023108237893935766, "phrase": "pilot_study"}, {"score": 0.0022913106863415435, "phrase": "automated_dose"}, {"score": 0.0022655487067269717, "phrase": "feasible_mechanism"}, {"score": 0.002171488970077653, "phrase": "decision-support_systems"}, {"score": 0.0021531499016013704, "phrase": "targeted_and_iterative_improvement"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Biomedical informatics", " Electronic prescribing", " Clinical practice", " Computer software", " Prescriptions", " Medical informatics"], "paper_abstract": "Objective: Pediatric dose rounding is a unique and complex process whose complexity is rarely supported by e-prescribing systems, though amenable to automation and deployment from a central service provider. The goal of this project was to validate an automated dose-rounding algorithm for pediatric dose rounding. Methods: We developed a dose-rounding algorithm, STEPSTools, based on expert consensus about the rounding process and knowledge about the therapeutic/toxic window for each medication. We then used a 60% subsample of electronically-generated prescriptions from one academic medical center to further refine the web services. Once all issues were resolved, we used the remaining 40% of the prescriptions as a test sample and assessed the degree of concordance between automatically calculated optimal doses and the doses in the test sample. Cases with discrepant doses were compiled in a survey and assessed by pediatricians from two academic centers. The response rate for the survey was 25%. Results: Seventy-nine test cases were tested for concordance. For 20 cases, STEPSTools was unable to provide a recommended dose. The dose recommendation provided by STEPSTools was identical to that of the test prescription for 31 cases. For 14 out of the 24 discrepant cases included in the survey, respondents significantly preferred STEPSTools recommendations (p < 0.05, binomial test). Overall, when combined with the data from all test cases, STEPSTools either matched or exceeded the performance of the test cases in 45/59 (76%) of the cases. The majority of other cases were challenged by the need to provide an extremely small dose. We estimated that with the addition of two dose-selection rules, STEPSTools would achieve an overall performance of 82% or higher. Conclusions: Results of this pilot study suggest that automated dose rounding is a feasible mechanism for providing guidance to e-prescribing systems. These results also demonstrate the need for validating decision-support systems to support targeted and iterative improvement in performance. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "Assessing the reliability of an automated dose-rounding algorithm", "paper_id": "WOS:000324848600006"}