{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "user_experience"}, {"score": 0.0046328364646343375, "phrase": "automated_recommender_systems"}, {"score": 0.0045318666714939905, "phrase": "marketing_and_delivery_of_commerce_and_content"}, {"score": 0.004265354774450696, "phrase": "large_and_complex_product_offerings"}, {"score": 0.004058951880810154, "phrase": "key_advances"}, {"score": 0.004014452814186653, "phrase": "collaborative_filtering_recommender_systems"}, {"score": 0.0036553070575015344, "phrase": "rich_set"}, {"score": 0.002851790448644913, "phrase": "broader_set"}, {"score": 0.0026838147966444783, "phrase": "additional_measures"}, {"score": 0.002363806685815014, "phrase": "key_challenges"}, {"score": 0.0021049977753042253, "phrase": "real-world_applications"}], "paper_keywords": ["Recommender systems", " User experience", " Collaborative filtering", " Evaluation", " Metrics"], "paper_abstract": "Since their introduction in the early 1990's, automated recommender systems have revolutionized the marketing and delivery of commerce and content by providing personalized recommendations and predictions over a variety of large and complex product offerings. In this article, we review the key advances in collaborative filtering recommender systems, focusing on the evolution from research concentrated purely on algorithms to research concentrated on the rich set of questions around the user experience with the recommender. We show through examples that the embedding of the algorithm in the user experience dramatically affects the value to the user of the recommender. We argue that evaluating the user experience of a recommender requires a broader set of measures than have been commonly used, and suggest additional measures that have proven effective. Based on our analysis of the state of the field, we identify the most important open research problems, and outline key challenges slowing the advance of the state of the art, and in some cases limiting the relevance of research to real-world applications.", "paper_title": "Recommender systems: from algorithms to user experience", "paper_id": "WOS:000302477200005"}