{"auto_keywords": [{"score": 0.031473358330562834, "phrase": "mobile_network_operator"}, {"score": 0.00481495049065317, "phrase": "electronic_signature"}, {"score": 0.0046364836476864325, "phrase": "important_element"}, {"score": 0.004592905436175987, "phrase": "electronic_commerce"}, {"score": 0.004278807087784626, "phrase": "secure_signature_creation_device"}, {"score": 0.004120130206000757, "phrase": "handwritten_signature"}, {"score": 0.004081385289516914, "phrase": "mobile_devices"}, {"score": 0.0038564191670589884, "phrase": "ideal_devices"}, {"score": 0.003426640459083931, "phrase": "m-signature-based_applications"}, {"score": 0.0031920445513574907, "phrase": "current_solutions"}, {"score": 0.0028495431343111897, "phrase": "mobile_handset"}, {"score": 0.00266693888510356, "phrase": "m-signature_service"}, {"score": 0.00240328454980006, "phrase": "easier_way"}, {"score": 0.002281376328251423, "phrase": "new_m-signature_service"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Electronic signature", " Mobile signature", " Smart card", " SIM", " Web services"], "paper_abstract": "Electronic signature (e-signature) is an important element in electronic commerce and government applications because it guarantees non-repudiation of transactions. E-signatures generated in a secure signature creation device can be considered legally equivalent to a handwritten signature. Mobile devices based on SIM/USIM cards, which are broadly extended, are the ideal devices to create these e-signatures (named mobile signatures or m-signatures). Furthermore, thanks to m-signatures the development of m-signature-based applications becomes simpler for mobile application/service providers. There are several solutions to create m-signatures. However, current solutions present some problems: either they require that the solution is developed by every mobile network operator or the components to implement it in the mobile handset are too complex. As a solution to these problems we present an m-signature service that is not linked to a mobile network operator and where the client has more control over the signatures to perform them in an easier way. This paper presents the description and analysis of this new m-signature service as well as the prototype that is being tested in the University of Murcia. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A mobile network operator-independent mobile signature service", "paper_id": "WOS:000285442200027"}