{"auto_keywords": [{"score": 0.04846675549219539, "phrase": "interior_scenes"}, {"score": 0.00481495049065317, "phrase": "interactive_rendering_of_interior_scenes"}, {"score": 0.004773904938276846, "phrase": "dynamic_environment"}, {"score": 0.0046928556063004214, "phrase": "rendering_system"}, {"score": 0.00445783412174435, "phrase": "interior_scene"}, {"score": 0.004382127278148236, "phrase": "small_regions"}, {"score": 0.0038868464660354626, "phrase": "traditional_precomputed_radiance_transfer_approaches"}, {"score": 0.0037719988989298983, "phrase": "bounding_sphere"}, {"score": 0.00319134078848996, "phrase": "environment_light_source"}, {"score": 0.0026998264237910884, "phrase": "dynamic_objects"}, {"score": 0.0025315664299815537, "phrase": "run_time"}, {"score": 0.0024884913795612707, "phrase": "front_transparent_glass"}, {"score": 0.002467228805628948, "phrase": "frosted_glass"}, {"score": 0.002283839204519042, "phrase": "different_times"}, {"score": 0.0021414489155042885, "phrase": "interactive_frame_rates"}, {"score": 0.0021049977753042253, "phrase": "dynamic_viewpoint"}], "paper_keywords": [""], "paper_abstract": "A rendering system for interior scenes is proposed in this paper The light reaches the interior scene, usually through small regions, such as windows or abat-jours, which we call portals. To provide a solution, suitable for rendering interior scenes with portals, we extend the traditional precomputed radiance transfer approaches. In our approach, a bounding sphere, which we call a shell, of the interior centered at each portal, is created and the light transferred from the shell towards the interior through the portal is precomputed. Each shell acts as an environment light source and its intensity distribution is determined by, rendering images of the scene, viewed from the center of the shell. By updating the intensity, distribution of the shell at each frame, we are able to handle dynamic objects outside the shells. The material of the portals can also be modified at run time (e.g. changing front transparent glass to frosted glass). Several applications are shown, including the illumination of a cathedral, lit by skylight at different times of a day, and a car, running in a town, at interactive frame rates, with a dynamic viewpoint.", "paper_title": "Interactive Rendering of Interior Scenes with Dynamic Environment Illumination", "paper_id": "WOS:000270778100023"}