{"auto_keywords": [{"score": 0.049212993617288335, "phrase": "virtual_environments"}, {"score": 0.01160919287122951, "phrase": "likert_scores"}, {"score": 0.00481495049065317, "phrase": "ordinal_scales"}, {"score": 0.004276016541197123, "phrase": "specialized_statistical_tools"}, {"score": 0.004179480763003705, "phrase": "routine_use"}, {"score": 0.004141476915000558, "phrase": "statistical_methods"}, {"score": 0.004085115444878828, "phrase": "continuous_data"}, {"score": 0.003956558420993431, "phrase": "significant_inferential_flaws"}, {"score": 0.0039205741991224525, "phrase": "likert"}, {"score": 0.0036441884295335502, "phrase": "based_statistical_procedures"}, {"score": 0.0033410898465226417, "phrase": "small_number"}, {"score": 0.003310684108128973, "phrase": "fixed_values"}, {"score": 0.0029396242707327986, "phrase": "ad_hoc_method"}, {"score": 0.0027073229284666294, "phrase": "nonparametric_statistics"}, {"score": 0.0024706232839499546, "phrase": "different_sort"}, {"score": 0.0024147474002390763, "phrase": "lumped_variables"}, {"score": 0.002244277924422011, "phrase": "great_caution"}], "paper_keywords": [""], "paper_abstract": "Likert scaled data, which are frequently collected in studies of interaction in virtual environments, demand specialized statistical tools for analysis. The routine use of statistical methods appropriate for continuous data in this context can lead to significant inferential flaws. Likert scaled data are ordinal rather than interval scaled and need to be analyzed using rank based statistical procedures that are widely available. Likert scores are \"lumpy'' in the sense that they cluster around a small number of fixed values. This lumpiness is made worse by the tendency for subjects to cluster towards either the middle or the extremes of the scale. We suggest an ad hoc method to deal with such data which can involve a further lumping of the results followed by the application of nonparametric statistics. Averaging Likert scores over several different survey questions, which is sometimes done in studies of interaction in virtual environments, results in a different sort of lumpiness. The lumped variables which are obtained in this manner can be quite murky and should be used with great caution, if at all, particularly if the number of questions over which such averaging is carried out is small.", "paper_title": "Analyzing ordinal scales in studies of virtual environments: Likert or lump it!", "paper_id": "WOS:000248592600007"}