{"auto_keywords": [{"score": 0.038828840828052116, "phrase": "link_qualities"}, {"score": 0.00481495049065317, "phrase": "slow_fading_wireless_ad-hoc_networks"}, {"score": 0.00474827840031692, "phrase": "wireless_ad-hoc_networks"}, {"score": 0.004306610946695577, "phrase": "multiple_forwarders"}, {"score": 0.00418810762179987, "phrase": "high_throughput"}, {"score": 0.00396075511616602, "phrase": "static_unreliability_regime"}, {"score": 0.0037587915908689497, "phrase": "slow_fading"}, {"score": 0.0036046342610557497, "phrase": "broadcast_periods"}, {"score": 0.0035176353680157367, "phrase": "static_forwarding_scheme"}, {"score": 0.003468864442215017, "phrase": "fixed_probabilistic_model"}, {"score": 0.003373334961160647, "phrase": "instantaneous_channel_conditions"}, {"score": 0.0031348622158167195, "phrase": "high_coverage"}, {"score": 0.0030378759123133644, "phrase": "good_channel_states"}, {"score": 0.002954180291607795, "phrase": "explicit_costly_coordination"}, {"score": 0.00290304212971385, "phrase": "broadcast_problem"}, {"score": 0.0027838831266525773, "phrase": "regret-based_learning_strategy"}, {"score": 0.00256895975568914, "phrase": "global_channel_state"}, {"score": 0.0024377918036784336, "phrase": "broadcast_game's_equilibrium"}, {"score": 0.002378887754874809, "phrase": "channel_states"}, {"score": 0.0022260654608669593, "phrase": "load_distribution"}, {"score": 0.00217987162651941, "phrase": "perfect_throughput"}, {"score": 0.0021496083700137305, "phrase": "dense_crowded_environments"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "Broadcasting in wireless ad-hoc networks is the dissemination of messages from a source node to all nodes in the network Since the nodes may have many common neighbors which can receive the same message from multiple forwarders, many schemes have been proposed to achieve high throughput without much redundancy. The majority of the schemes, however, assume either perfect link reliability or a static unreliability regime. In this paper, we consider the case where broadcasting is performed under slow fading, and thus the link qualities can vary over the course of broadcast periods. In this case, a static forwarding scheme based on a fixed probabilistic model of the link qualities cannot track the instantaneous channel conditions, and is prone to blind re-transmissions. Instead, the nodes have to coordinate in real-time so that high coverage is achieved by involving only a subset of nodes experiencing good channel states. To avoid the need for an explicit costly coordination, we model the broadcast problem as a game in which each node is equipped with a regret-based learning strategy. By repeatedly playing this game, the nodes can learn to reach a consensus (equilibrium) in their forwarding strategies for each global channel state. Also, the nodes proactively adapt their strategies so that their collective forwarding behavior actively tracks the broadcast game's equilibrium as it varies with changes in channel states due to slow fading. Simulation results reveal that our solution excels in terms of both the number of transmissions and load distribution, while also maintaining near perfect throughput, especially in dense crowded environments. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Efficient broadcasting in slow fading wireless ad-hoc networks", "paper_id": "WOS:000347769900010"}