{"auto_keywords": [{"score": 0.04980781719029456, "phrase": "chest_radiographs"}, {"score": 0.00481495049065317, "phrase": "lung_nodules"}, {"score": 0.004706821999798591, "phrase": "public_database"}, {"score": 0.004666899848184808, "phrase": "computer_algorithm"}, {"score": 0.004640472497133447, "phrase": "nodule_detection"}, {"score": 0.0037928847801943404, "phrase": "extra_candidate_segmentation_step"}, {"score": 0.0037287578312533596, "phrase": "candidate_selection_step"}, {"score": 0.0036761446421770564, "phrase": "classification_step"}, {"score": 0.0036449324377347023, "phrase": "small_number"}, {"score": 0.0035227019877145096, "phrase": "nodule_candidates"}, {"score": 0.003423969509052361, "phrase": "multi-scale_techniques"}, {"score": 0.003290360233643709, "phrase": "local_intensity_maxima"}, {"score": 0.003271702219797911, "phrase": "gaussian_scale_space"}, {"score": 0.0032531496610470377, "phrase": "nodule_boundaries"}, {"score": 0.003207225752446834, "phrase": "edge_points"}, {"score": 0.0031799821835592447, "phrase": "large_scales"}, {"score": 0.0031529693013776852, "phrase": "pixel_scale"}, {"score": 0.003038532168038562, "phrase": "multi-scale_gaussian_filterbank"}, {"score": 0.0028219328009498348, "phrase": "large_number"}, {"score": 0.0026734504926268442, "phrase": "confidence_level"}, {"score": 0.0025112322629187787, "phrase": "selection_step"}, {"score": 0.002482810873598809, "phrase": "added_value"}, {"score": 0.0023994575666886485, "phrase": "clear_improvement"}, {"score": 0.00235213013487844, "phrase": "best_performance"}, {"score": 0.002325505218710381, "phrase": "average_two_false_positives"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["computer-aided diagnosis", " multi-scale techniques", " chest radiography", " pulmonary nodules", " lung cancer"], "paper_abstract": "A computer algorithm for nodule detection in chest radiographs is presented. The algorithm consists of four main steps: (i) image preprocessing; (ii) nodule candidate detection; (iii) feature extraction; (iv) candidate classification. Two optional extensions to this scheme are tested: candidate selection and candidate segmentation. The output of step (ii) is a list of circles, which can be transformed into more detailed contours by the extra candidate segmentation step. In addition, the candidate selection step (which is a classification step using a small number of features) can be used to reduce the list of nodule candidates before step (iii). The algorithm uses multi-scale techniques in several stages of the scheme: Candidates are found by looking for local intensity maxima in Gaussian scale space; nodule boundaries are detected by tracing edge points found at large scales down to pixel scale; some of the features used for classification are taken from a multi-scale Gaussian filterbank. Experiments with this scheme (with and without the segmentation and selection steps) are carried out on a previously characterized, publicly available database, that contains a large number of very subtle nodules. For this database, counting as detections only those nodules that were indicated with a confidence level of 50% or more, radiologists previously detected 70% of the nodules. For our algorithm, it turns out that the selection step does have an added value for the system, while segmentation does not lead to a clear improvement. With the scheme with the best performance, accepting on average two false positives per image results in the identification of 51% of all nodules. For four false positives, this increases to 67%. This is close to the previously reported 70% detection rate of the radiologists. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "A computer-aided diagnosis system for detection of lung nodules in chest radiographs with an evaluation on a public database", "paper_id": "WOS:000235682300010"}