{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "context-aware_applications"}, {"score": 0.03471650139501242, "phrase": "different_applications"}, {"score": 0.0044495843279816075, "phrase": "traffic_routing"}, {"score": 0.00413096972023037, "phrase": "physical_world_search"}, {"score": 0.003644001325962353, "phrase": "particular_place"}, {"score": 0.002656327554326748, "phrase": "placecomm_framework"}, {"score": 0.0025355968118803956, "phrase": "key_abstraction"}, {"score": 0.002500456462028735, "phrase": "place_knowledge"}, {"score": 0.002267708463966758, "phrase": "multiagent_architecture"}], "paper_keywords": ["Ontology", " place-based computing", " place-based virtual communities"], "paper_abstract": "There is increasing interest in context-aware applications, ranging from traffic routing, location-based services, friend finding, context-aware messaging, virtual tour guides, to physical world search. We make three observations: (i) many context-aware applications use knowledge about the individuals (and groups of people), places and objects within a particular place, that is, they are place-based, (ii) such knowledge about a place can be shared by different applications and reused, without each application having the same knowledge reengineered (there is at least overlap among such knowledge across different applications), and (iii) applications can not only be consumers of knowledge but also be contributors of knowledge about the place. We propose the PlaceComm framework for building such context-aware applications with \"place\" as a key abstraction, where place knowledge can be collected and shared. The knowledge is structured using an ontology called the Place-Based Virtual Community ontology. Our framework utilizes a multiagent architecture for modularity, separation of concerns and extensibility. We also describe three applications built using our approach: PlaceGuide, PlaceAware and PlaceSense.", "paper_title": "PlaceComm: A framework for context-aware applications in place-based virtual communities", "paper_id": "WOS:000287455800006"}