{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "guard_digits"}, {"score": 0.004770211811866158, "phrase": "finite_precision_redundant_representations"}, {"score": 0.004725886853744007, "phrase": "redundant_number_representations"}, {"score": 0.004595356579614969, "phrase": "constant_time_additions"}, {"score": 0.0040133278382101885, "phrase": "final_value"}, {"score": 0.003812299519486331, "phrase": "leading_guard_digits"}, {"score": 0.0034884152484429207, "phrase": "nonzero_digits"}, {"score": 0.0031770714776989282, "phrase": "normal_redundant_digit_sets"}, {"score": 0.0030604342671868836, "phrase": "single_guard_digit"}, {"score": 0.0027741761880779535, "phrase": "unsigned_carry-save_representation"}, {"score": 0.0022475295254231714, "phrase": "suitable_points"}, {"score": 0.0021447748132703078, "phrase": "single_digit"}, {"score": 0.0021049977753042253, "phrase": "complete_prefix"}], "paper_keywords": ["redundant representations", " leading guard digits", " multioperand additions", " pseudo overflows"], "paper_abstract": "Redundant number representations are generally used to allow constant time additions, based on the fact that only bounded carry-ripples take place. But, carries may ripple out into positions which may not be needed to represent the final value of the result and, thus, a certain amount of leading guard digits are needed to correctly determine the result. Also, when cancellation during subtractions occurs, there may be nonzero digits in positions not needed to represent the result of the calculation. It is shown here that, for normal redundant digit sets with radix greater than two, a single guard digit is sufficient to determine the value of such an arbitrary length prefix of leading nonzero digits. This is also the case for the unsigned carry-save representation, whereas two guard digits are sufficient, and may be necessary, for additions in the binary signed-digit and 2's complement carry-save representations. Thus, only the guard digits need to be retained during sequences of additions and subtractions. At suitable points, the guard digits may then be converted into a single digit, representing the complete prefix.", "paper_title": "Leading guard digits in finite precision redundant representations", "paper_id": "WOS:000236116200005"}