{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "peer_entities"}, {"score": 0.014113742593250303, "phrase": "similar_traces"}, {"score": 0.0034063576796640603, "phrase": "large-scale_events"}, {"score": 0.0029203055813347874, "phrase": "sliding_windows"}, {"score": 0.0027920359090544107, "phrase": "significant_events"}, {"score": 0.002703869368554536, "phrase": "candidate_topic_sequences"}, {"score": 0.002635339648135844, "phrase": "dynamic_programming"}, {"score": 0.0025521085778978042, "phrase": "similar_candidate_topic_sequences"}, {"score": 0.0024399717841513354, "phrase": "efficient_method"}, {"score": 0.0021876814398268775, "phrase": "high_accuracy"}, {"score": 0.0021322065604537617, "phrase": "comprehensive_experiments"}, {"score": 0.0021049977753042253, "phrase": "synthetic_datasets"}], "paper_keywords": ["Significant event", " similar trace", " candidate topic"], "paper_abstract": "Events about entities have been widely collected on Web, allowing us to analyze how peer entities interact and learn the relationships that exist among the entities. In this paper we investigate similar traces that have not been adequately studied so far. Intuitively, peer entities tend to have similar traces. The challenges in mining similar traces are: (1) the occurring time lags of traces are usually unknown and varying; (2) the existence of large-scale events of entities and complexity of the model representing all the events. In this paper we propose a simple, but practical method that addresses all these challenges. Firstly, sliding windows are adopted to filter out the significant events and then find the candidate topic sequences. Secondly, dynamic programming is employed to mine similar candidate topic sequences of entities. Finally, an efficient method is proposed to mine all the similar traces of entities. It is able to mine similar traces of peer entities with high accuracy. We conduct comprehensive experiments on synthetic datasets to demonstrate the efficiency of the method proposed.", "paper_title": "Mining Similar Traces of Entities on Web", "paper_id": "WOS:000367474500020"}