{"auto_keywords": [{"score": 0.049233068058238634, "phrase": "open_shop_scheduling_problem"}, {"score": 0.034723248142321195, "phrase": "hybrid_genetic-based_heuristics"}, {"score": 0.00481495049065317, "phrase": "genetic_algorithm-based_heuristics"}, {"score": 0.004100851549096203, "phrase": "total_job_tardiness"}, {"score": 0.003957078581524691, "phrase": "practical_processing_restrictions"}, {"score": 0.0038640303886081444, "phrase": "independent_setup_and_dependent_removal_times"}, {"score": 0.0036408354779365643, "phrase": "addressed_problem"}, {"score": 0.003118838635447237, "phrase": "acceptable_computation_time"}, {"score": 0.002921114512115261, "phrase": "performance_comparisons"}, {"score": 0.0025020469669826497, "phrase": "experimental_results"}, {"score": 0.002357338450354915, "phrase": "dga."}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Open shop scheduling", " Total job tardiness", " Hybrid genetic-based heuristics", " Simulated annealing", " Tabu search"], "paper_abstract": "This report proposes a solution to the open shop scheduling problem with the objective of minimizing total job tardiness in the system. Some practical processing restrictions, such as independent Setup and dependent removal times, are taken into account as well. The addressed problem is first described as a 0-1 integer programming model, and is then solved optimally. Subsequently, some hybrid genetic-based heuristics are proposed to solve the problem in an acceptable computation time. To demonstrate the adaptability of these heuristics, some performance comparisons are made with Solutions provided by running either a mathematical programming model or certain classic meta-heuristics such as genetic algorithm. simulated annealing. and tabu search in various manufacturing scenarios. The experimental results show that the hybrid genetic-based heuristics perform well, especially the DGA. However, these heuristics require some more additional computations but are still acceptable. (c) 2008 Published by Elsevier Ltd.", "paper_title": "Genetic algorithm-based heuristics for an open shop scheduling problem with setup, processing, and removal times separated", "paper_id": "WOS:000262147700006"}