{"auto_keywords": [{"score": 0.044439418729708045, "phrase": "differential_profiles"}, {"score": 0.015586480634730926, "phrase": "association_rules"}, {"score": 0.004815595081630284, "phrase": "decision"}, {"score": 0.004692227830462433, "phrase": "differential_gene_expression_profiles"}, {"score": 0.004632039024076267, "phrase": "rapid_development"}, {"score": 0.004456044928556639, "phrase": "rna_microarray_experiments"}, {"score": 0.0041773934798743405, "phrase": "experimental_conditions"}, {"score": 0.003751011827704279, "phrase": "observable_differential_profiles"}, {"score": 0.003501175642882274, "phrase": "machine_learning_based_methodology"}, {"score": 0.003382547312072468, "phrase": "microarray_analysis_methods"}, {"score": 0.0029467742734417255, "phrase": "common_profile"}, {"score": 0.0027982016314450717, "phrase": "partial_ordered_subsets"}, {"score": 0.002566997205079849, "phrase": "host_response"}, {"score": 0.0025449518236394103, "phrase": "injury_data"}, {"score": 0.002469269628821745, "phrase": "longitudinal_blood_microarray_profiles"}, {"score": 0.0024061887405214186, "phrase": "intravenous_endotoxin"}, {"score": 0.002294686545883412, "phrase": "cohesive_set"}, {"score": 0.0022749744354271816, "phrase": "differentially_expressed_genes"}, {"score": 0.002255431275670053, "phrase": "novel_members"}, {"score": 0.0021049977753042253, "phrase": "new_microarray_problems"}], "paper_keywords": [""], "paper_abstract": "The rapid development of methods that select over/under expressed genes from RNA microarray experiments have not yet satisfied the need for tools that identify differential profiles that distinguish between experimental conditions such as time, treatment and phenotype. We evaluate several microarray analysis methods and study their performance, finding that none of the methods alone identifies all observable differential profiles, nor subsumes the results obtained by the other methods. Therefore, we propose a machine learning based methodology that identifies and combines the abilities of microarray analysis methods to recognize differential profiles. We encode the results of this methodology in decision making association rules able to decide which method or method-aggregation is optimal to retrieve a set of genes exhibiting a common profile. These solutions are optimal in the sense that they constitute partial ordered subsets of all method-aggregations bounded by the most specific and the most sensitive available solution. This methodology was successfully applied to a study of inflammation and host response to injury data set derived from the analysis of longitudinal blood microarray profiles of human volunteers treated with intravenous endotoxin compared to placebo. Our approach was able to uncover a cohesive set of differentially expressed genes and novel members exhibiting previously studied differential profiles. This guideline serves as a means to support decisions on new microarray problems.", "paper_title": "Decision making association rules for recognition of differential gene expression profiles", "paper_id": "WOS:000241790900135"}