{"auto_keywords": [{"score": 0.042037044315554925, "phrase": "intersection_module"}, {"score": 0.00481495049065317, "phrase": "n-d_systems"}, {"score": 0.004182871028054003, "phrase": "differential_equations"}, {"score": 0.00389270357935381, "phrase": "strongly_autonomous_systems"}, {"score": 0.0037778009042360758, "phrase": "equivalent_first_order_representation"}, {"score": 0.0037104876694493815, "phrase": "real_square_matrices"}, {"score": 0.003611751858608048, "phrase": "first_order_representation"}, {"score": 0.0034841647157189985, "phrase": "state_representation"}, {"score": 0.0034118234596993836, "phrase": "linear_combination"}, {"score": 0.0033812801309408514, "phrase": "companion_matrices"}, {"score": 0.0032229262928681304, "phrase": "strongly_autonomous_system"}, {"score": 0.003053598205821532, "phrase": "general_autonomous_system"}, {"score": 0.0029280552768499056, "phrase": "free_subspace"}, {"score": 0.0027575842698911173, "phrase": "autonomous_system"}, {"score": 0.002708399936381754, "phrase": "algebraic_characterization"}, {"score": 0.002644179117033107, "phrase": "scalar_autonomous_system"}, {"score": 0.0026126405272417783, "phrase": "algebraic_criterion"}, {"score": 0.0025737443998987536, "phrase": "full_geometric_characterization"}, {"score": 0.0023949342544966916, "phrase": "closed_linear_set"}, {"score": 0.002310232205403468, "phrase": "non-free_subspace"}, {"score": 0.002228519136218028, "phrase": "intersection_ideal"}, {"score": 0.00216263228969761, "phrase": "necessary_and_sufficient_condition"}], "paper_keywords": ["n-D systems", " Autonomous systems", " Intersection modules"], "paper_abstract": "In this paper, we look into restrictions of the solution set of a system of PDEs to 1-d subspaces. We bring out its relation with certain intersection modules. We show that the restriction, which may not always be a solution set of differential equations, is always contained in a solution set of ODEs coming from the intersection module. Next, we focus our attention to restrictions of strongly autonomous systems. We first show that such a system always admits an equivalent first order representation given by an n-tuple of real square matrices called companion matrices. We then exploit this first order representation to show that the system corresponding to the intersection module has a state representation given by the restriction of a linear combination of the companion matrices to a certain invariant subspace. Using this result we bring out that the restriction of a strongly autonomous system is equal to the system corresponding to the intersection module. Then we look into restrictions of a general autonomous system, not necessarily strongly autonomous. We first define the notion of a free subspace of the domain-a 1-d subspace where every possible 1-d trajectory can be obtained by restricting the trajectories of the autonomous system. Then we give an algebraic characterization of free-ness of a 1-d subspace for a scalar autonomous system. Using this algebraic criterion we then give a full geometric characterization of free (and non-free) subspaces. As a consequence of this we show that the set of non-free 1-d subspaces is a closed linear set in the projective (n-1)-space. Finally, we show that restriction to a non-free subspace always equals the solution set of the ODEs coming from the intersection ideal. As a corollary to this we give a necessary and sufficient condition for a system to be stable in a given direction.", "paper_title": "On restrictions of n-d systems to 1-d subspaces", "paper_id": "WOS:000329309800008"}