{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_connectivity"}, {"score": 0.004604023526673226, "phrase": "next-generation_optical_access_networks"}, {"score": 0.004402295697276237, "phrase": "improved_quality"}, {"score": 0.004188459638572375, "phrase": "corresponding_experimental_prototype"}, {"score": 0.004105850229681625, "phrase": "optical_access_networks"}, {"score": 0.0040449598280454645, "phrase": "passive_optical_network_architecture"}, {"score": 0.003716525457781286, "phrase": "pon"}, {"score": 0.003661382948704217, "phrase": "higher_data_rates"}, {"score": 0.003448863509392547, "phrase": "fiber_cut"}, {"score": 0.003075296862372287, "phrase": "wireless_mesh"}, {"score": 0.0028253682745674608, "phrase": "network_element_failure"}, {"score": 0.0027834145465170292, "phrase": "alternate_path"}, {"score": 0.0027420820738468577, "phrase": "wireless-wireline_integrated_network"}, {"score": 0.0025827837420330816, "phrase": "reliable_high-capacity_connectivity"}, {"score": 0.0023609780669713288, "phrase": "risk-aware_routing"}, {"score": 0.002136747803494932, "phrase": "experimental_prototype"}], "paper_keywords": [""], "paper_abstract": "This article studies how next-generation optical access networks can exploit the properties of wireless connectivity to provide improved quality of service to users, and reports on a corresponding experimental prototype as well. Optical access networks using the passive optical network architecture are being increasingly deployed worldwide for fiber-to-the-home/business applications. While a PON can support higher data rates, it suffers from its tree architecture since it is vulnerable to a fiber cut on its tree's trunk, which will disrupt service to its users. However, by exploiting the properties of wireless connectivity, such as a wireless mesh in the front-end, the network can be made more robust. In case of a network element failure, an alternate path through the wireless-wireline integrated network may be selected, if it exists. Such a network can provide reliable high-capacity connectivity to untethered wireless devices which may be mobile as well. For such wireless-optical broadband access networks, we study a Risk-Aware Routing (RAR) algorithm to make it fault-tolerant and self-healing in case of failures. We also report on results from an experimental prototype developed in our laboratory.", "paper_title": "Exploiting Wireless Connectivity for Robustness in WOBAN", "paper_id": "WOS:000322831800012"}