{"auto_keywords": [{"score": 0.04982518454987662, "phrase": "clinical_notes"}, {"score": 0.042116174912934366, "phrase": "bodyweight_related_measures"}, {"score": 0.009986775049458883, "phrase": "clinical_care"}, {"score": 0.008544034759766266, "phrase": "structured_data"}, {"score": 0.008082048494588752, "phrase": "regular_expressions"}, {"score": 0.006986235220947238, "phrase": "supervised_learning_algorithm"}, {"score": 0.00481495049065317, "phrase": "bodyweight_values"}, {"score": 0.004639165943923164, "phrase": "bmi"}, {"score": 0.004329466192376432, "phrase": "structured_tables"}, {"score": 0.004306514358476449, "phrase": "electronic_health_records"}, {"score": 0.00406190229765448, "phrase": "learning_algorithm"}, {"score": 0.003955359708920401, "phrase": "va"}, {"score": 0.003841331355067413, "phrase": "clinical_research"}, {"score": 0.00377049204674434, "phrase": "regular_expression_discovery_extractor"}, {"score": 0.00349991477098475, "phrase": "numerical_values"}, {"score": 0.0032486912871662697, "phrase": "annotation_process"}, {"score": 0.003121586251550337, "phrase": "primary_care_notes"}, {"score": 0.003039616037887045, "phrase": "training_set"}, {"score": 0.0030234813328317207, "phrase": "inter-annotator_agreement"}, {"score": 0.0029362547578867487, "phrase": "separate_test"}, {"score": 0.0027914598613605576, "phrase": "unique_individuals"}, {"score": 0.0027399283407250497, "phrase": "related_measures"}, {"score": 0.0026750651386622964, "phrase": "additional_bodyweight_related_measures"}, {"score": 0.002611733442571296, "phrase": "redex's_performance"}, {"score": 0.0021503332345216273, "phrase": "quality_improvement_efforts"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Natural language processing", " Bodyweight", " Text classification"], "paper_abstract": "Background: Bodyweight related measures (weight, height, BMI, abdominal circumference) are extremely important for clinical care, research and quality improvement. These and other vitals signs data are frequently missing from structured tables of electronic health records. However they are often recorded as text within clinical notes. In this project we sought to develop and validate a learning algorithm that would extract bodyweight related measures from clinical notes in the Veterans Administration (VA) Electronic Health Record to complement the structured data used in clinical research. Methods: We developed the Regular Expression Discovery Extractor (REDEx), a supervised learning algorithm that generates regular expressions from a training set. The regular expressions generated by REDEx were then used to extract the numerical values of interest. Methods: To train the algorithm we created a corpus of 268 outpatient primary care notes that were annotated by two annotators. This annotation served to develop the annotation process and identify terms associated with bodyweight related measures for training the supervised learning algorithm. Snippets from an additional 300 outpatient primary care notes were subsequently annotated independently by two reviewers to complete the training set. Inter-annotator agreement was calculated. Methods: REDEx was applied to a separate test set of 3561 notes to generate a dataset of weights extracted from text. We estimated the number of unique individuals who would otherwise not have bodyweight related measures recorded in the CDW and the number of additional bodyweight related measures that would be additionally captured. Results: REDEx's performance was: accuracy = 983%, precision = 98.8%, recall = 98.3%, F = 98.5%. In the dataset of weights from 3561 notes, 7.7% of notes contained bodyweight related measures that were not available as structured data. In addition 2 additional bodyweight related measures were identified per individual per year. Conclusion: Bodyweight related measures are frequently stored as text in clinical notes. A supervised learning algorithm can be used to extract this data. Implications for clinical care, epidemiology, and quality improvement efforts are discussed. (C) 2015 Elsevier Inc. All rights reserved.", "paper_title": "Regular expression-based learning to extract bodyweight values from clinical notes", "paper_id": "WOS:000353932500018"}