{"auto_keywords": [{"score": 0.04893638421315734, "phrase": "conditional_planning"}, {"score": 0.00481495049065317, "phrase": "belief_space_search"}, {"score": 0.004745665541429529, "phrase": "recent_works"}, {"score": 0.004632388761885302, "phrase": "reachability_heuristics"}, {"score": 0.00456571874088313, "phrase": "planner_scalability"}, {"score": 0.004435230698216773, "phrase": "formal_description"}, {"score": 0.004246428036409373, "phrase": "previous_work"}, {"score": 0.0039685202936462815, "phrase": "formal_basis"}, {"score": 0.00393032656248792, "phrase": "distance_estimates"}, {"score": 0.0038924989779389424, "phrase": "belief_states"}, {"score": 0.0036026484429137998, "phrase": "underlying_state_distance_measures"}, {"score": 0.0034826993555190765, "phrase": "state_distances"}, {"score": 0.0031922210879462513, "phrase": "standardized_comparison"}, {"score": 0.002997572637726648, "phrase": "single_planner"}, {"score": 0.002869793011316547, "phrase": "planning_graph_data_structures"}, {"score": 0.0025549840900344596, "phrase": "conformant_regression_planner"}, {"score": 0.0024224481033945943, "phrase": "conditional_progression_planner"}, {"score": 0.0023079225317714815, "phrase": "relative_effectiveness"}, {"score": 0.0021049977753042253, "phrase": "art_approaches"}], "paper_keywords": [""], "paper_abstract": "Some recent works in conditional planning have proposed reachability heuristics to improve planner scalability, but many lack a formal description of the properties of their distance estimates. To place previous work in context and extend work on heuristics for conditional planning, we provide a formal basis for distance estimates between belief states. We give a definition for the distance between belief states that relies on aggregating underlying state distance measures. We give several techniques to aggregate state distances and their associated properties. Many existing heuristics exhibit a subset of the properties, but in order to provide a standardized comparison we present several generalizations of planning graph heuristics that are used in a single planner. We compliment our belief state distance estimate framework by also investigating efficient planning graph data structures that incorporate BDDs to compute the most effective heuristics. We developed two planners to serve as test-beds for our investigation. The first, CAltAlt, is a conformant regression planner that uses A* search. The second, POND, is a conditional progression planner that uses AO* search. We show the relative effectiveness of our heuristic techniques within these planners. We also compare the performance of these planners with several state of the art approaches in conditional planning.", "paper_title": "Planning graph heuristics for belief space search", "paper_id": "WOS:000238115300002"}