{"auto_keywords": [{"score": 0.02010944941096943, "phrase": "chuang"}, {"score": 0.010058049376831113, "phrase": "chen's_scheme"}, {"score": 0.008542379727250322, "phrase": "scalable_platform"}, {"score": 0.006143803547016463, "phrase": "chen"}, {"score": 0.00481495049065317, "phrase": "smart_cards"}, {"score": 0.004760394308239882, "phrase": "communication_technology"}, {"score": 0.0046398818698302835, "phrase": "remote_user"}, {"score": 0.004445739135694758, "phrase": "unique_opportunity"}, {"score": 0.004420472010542188, "phrase": "online_services"}, {"score": 0.004247560712327667, "phrase": "service_center"}, {"score": 0.0041636475197809825, "phrase": "key_agreement_protocols"}, {"score": 0.003977993693395208, "phrase": "authentication_schemes"}, {"score": 0.003899385109646589, "phrase": "single-server_environment"}, {"score": 0.0037042817107563785, "phrase": "multiple_application_servers"}, {"score": 0.0035898717643894303, "phrase": "multi-server_authentication"}, {"score": 0.0034493376812017983, "phrase": "single_registration"}, {"score": 0.0033619033669956317, "phrase": "efficient_multi-server_authenticated_key_agreement_scheme"}, {"score": 0.0029907265264530816, "phrase": "stolen_smart_card_attack"}, {"score": 0.0029567784489935777, "phrase": "user's_impersonation_attack"}, {"score": 0.002753138528582461, "phrase": "efficient_improvement"}, {"score": 0.0027374647587075935, "phrase": "chuang_and_chen's_scheme"}, {"score": 0.0026452734009203764, "phrase": "original_merits"}, {"score": 0.0026003455833291124, "phrase": "rigorous_informal_and_formal_security_analysis"}, {"score": 0.002414290278501595, "phrase": "formal_security_verification"}, {"score": 0.002178400923036365, "phrase": "communication_and_computational_overheads"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Remote user authentication", " Multi-server", " Smart card", " Biometrics", " User anonymity", " Security", " AVISPA"], "paper_abstract": "Advancement in communication technology provides a scalable platform for various services, where a remote user can access the server from anywhere without moving from its place. It provides a unique opportunity for online services such that a user does not need to be physically present at the service center. These services adopt authentication and key agreement protocols in order to ensure authorized and secure access to the resources. Most of the authentication schemes proposed in the literature support a single-server environment, where the user has to register with each server. If a user wishes to access multiple application servers, he/she requires to register with each server. The multi-server authentication introduces a scalable platform such that a user can interact with any server using single registration. Recently, Chuang and Chen proposed an efficient multi-server authenticated key agreement scheme based on a user's password and biometrics (Chuang and Chen, 2014). Their scheme is a lightweight, which requires the computation of only hash functions. In this paper, we first analyze Chuang and Chen's scheme and then identify that their scheme does not resist stolen smart card attack which causes the user's impersonation attack and server spoofing attack. We also show that their scheme fails to protect denial-of-service attack. We aim to propose an efficient improvement on Chuang and Chen's scheme to overcome the weaknesses of their scheme, while also retaining the original merits of their scheme. Through the rigorous informal and formal security analysis, we show that our scheme is secure against various known attacks including the attacks found in Chuang and Chen's scheme. Furthermore, we simulate our scheme for the formal security verification using the widely-accepted AVISPA (Automated Validation of Internet Security Protocols and Applications) tool and show that our scheme is secure against the replay and man-in-the-middle attacks. In addition, our scheme is comparable in terms of the communication and computational overheads with Chuang and Chen's scheme and other related existing schemes. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A secure user anonymity-preserving biometric-based multi-server authenticated key agreement scheme using smart cards", "paper_id": "WOS:000342250300009"}