{"auto_keywords": [{"score": 0.04983293136461093, "phrase": "slovenia"}, {"score": 0.04958853801217849, "phrase": "croatia"}, {"score": 0.049224360002539616, "phrase": "malaysia"}, {"score": 0.015719664550930088, "phrase": "organisational_learning_process"}, {"score": 0.008191378755759439, "phrase": "malaysian_companies"}, {"score": 0.00465650868280802, "phrase": "better_organisational_learning"}, {"score": 0.004632597963417253, "phrase": "higher_organisational_performance"}, {"score": 0.004179242907084957, "phrase": "olimp_questionnaire"}, {"score": 0.004147078767929973, "phrase": "measurement_instrument"}, {"score": 0.0039287294997624065, "phrase": "cleveland"}, {"score": 0.003908544086062361, "phrase": "ohio"}, {"score": 0.0038884550413416036, "phrase": "dimovski"}, {"score": 0.00374105898595391, "phrase": "organisational_learning"}, {"score": 0.0037122546106475676, "phrase": "transitional_economy"}, {"score": 0.0032972747743006572, "phrase": "organisational_learning_construct"}, {"score": 0.0030597656707857706, "phrase": "behavioural_and_cognitive_changes"}, {"score": 0.002989583371652771, "phrase": "modern_business_environment"}, {"score": 0.002621151117307523, "phrase": "slovenian"}, {"score": 0.0026076653503928175, "phrase": "croatian"}, {"score": 0.00257424957319189, "phrase": "internal_sources"}, {"score": 0.0024574537875026634, "phrase": "external_sources"}, {"score": 0.002394867096181764, "phrase": "external_information"}, {"score": 0.0023338706400215362, "phrase": "slovenian_and_croatian_companies"}, {"score": 0.0023099082804523044, "phrase": "personal_contacts"}, {"score": 0.0022980193063209297, "phrase": "informal_team_meetings"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["organisational learning process", " Slovenia", " Croatia", " Malaysia"], "paper_abstract": "Several empirical studies have proved that better organisational learning induces higher organisational performance. However, none of them addressed the issue of organisational learning process simultaneously in several countries. in our contribution, we aim to test differences in the way companies learn in Slovenia, Croatia, and Malaysia. We used the OLIMP questionnaire, a measurement instrument developed and tested by [Dimovski, V. (1994), Organisational learning and competitive advantage. PhD Thesis, Cleveland, Ohio; Dimovski, V., & Skerlavaj, M. (2005). Performance effects of organisational learning in a transitional economy. Problems and Perspectives a? Management 3(4), 56-67]. It employs three measurement variables (information acquisition, information interpretation, and behavioural and cognitive changes) as well as 38 items (presented in the paper) to measure the organisational learning construct. In autumn 2005 data from 203 Slovenian, 202 Croatian and 300 Malaysian companies were gathered. The results indicate that companies in all three countries under scrutiny are closest in terms of behavioural and cognitive changes, meaning that globalisation and other chalenges of the modern business environment demand all of them to change and adapt quickly. However, the ways they are coping with these challenges are different. There are more similarities than dissimilarities between Slovenia and Croatia, while this is not the case when comparing both countries to Malaysia. When acquiring information, Slovenian and Croatian companies rely more on internal sources (own employees, past decisions, etc.), while Malaysian companies tend to rely more on external sources and more often have employees dedicated to searching for external information. When trying to interpret the information acquired, Slovenian and Croatian companies rely more on personal contacts, informal team meetings and believe that information given to subordinates must be simple and concise, while Malaysian companies tend to use more formal collective decision-making and written communication to understand the meaning of information. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "Comparative analysis of the organisational learning process in Slovenia, Croatia, and Malaysia", "paper_id": "WOS:000253521900084"}