{"auto_keywords": [{"score": 0.04910845908100796, "phrase": "la"}, {"score": 0.007740253354973018, "phrase": "guaranteed_value"}, {"score": 0.005159435734567, "phrase": "upper_bound"}, {"score": 0.004621671570727774, "phrase": "distinct_integers"}, {"score": 0.004100952337610039, "phrase": "absolute_value"}, {"score": 0.0038170129089059013, "phrase": "small_cost"}, {"score": 0.0037267877774290374, "phrase": "classical_np-complete_problem"}, {"score": 0.003626272370749206, "phrase": "la_of"}, {"score": 0.0031520064334325934, "phrase": "fernau"}, {"score": 0.002854392852477005, "phrase": "fpt_\"parameterized"}, {"score": 0.002308800317961002, "phrase": "problem_kernel"}, {"score": 0.002293051006249274, "phrase": "linear_size"}, {"score": 0.0022774088820755366, "phrase": "linear_time"}, {"score": 0.002254145085288829, "phrase": "connected_graph"}, {"score": 0.002156044708023015, "phrase": "serna"}, {"score": 0.0021413353623449638, "phrase": "thilikos"}, {"score": 0.0021194680757585798, "phrase": "fpt"}], "paper_keywords": [""], "paper_abstract": "A linear arrangement (LA) is an assignment of distinct integers to the vertices of a graph. The cost of an LA is the sum of lengths of the edges of the graph, where the length of an edge is defined as the absolute value of the difference of the integers assigned to its ends. For many application one hopes to find an LA with small cost. However, it is a classical NP-complete problem to decide whether a given graph G admits an LA of cost bounded by a given integer. Since every edge of G contributes at least one to the cost of any LA, the problem becomes trivially fixed-parameter tractable (FPT) if parameterized by the upper bound of the cost. Fernau asked whether the problem remains FPT if parameterized by the upper bound of the cost minus the number of edges of the given graph; thus whether the problem is FPT \"parameterized above guaranteed value.\" We answer this question positively by deriving an algorithm which decides in time O(m + n + 5.88(k)) whether a given graph with m edges and n vertices admits an LA of cost at most m + k (the algorithm computes such an LA if it exists). Our algorithm is based on a procedure which generates a problem kernel of linear size in linear time for a connected graph G. We also prove that more general parameterized LA problems stated by Serna and Thilikos are not FPT, unless P = NP.", "paper_title": "The linear arrangement problem parameterized above guaranteed value", "paper_id": "WOS:000238119900034"}