{"auto_keywords": [{"score": 0.04569117705973995, "phrase": "neural_progenitors"}, {"score": 0.02322746025252468, "phrase": "notch"}, {"score": 0.016774511828789366, "phrase": "neural_fate_decisions"}, {"score": 0.005769629895312812, "phrase": "neural_differentiation"}, {"score": 0.004704844560325455, "phrase": "developing_nervous_system"}, {"score": 0.00462773520532301, "phrase": "proneural_genes"}, {"score": 0.004218602458288531, "phrase": "post-mitotic_neurons"}, {"score": 0.0041357305373417455, "phrase": "segmentation_clocks"}, {"score": 0.003757480190200645, "phrase": "neighboring_cells"}, {"score": 0.0034024277222012597, "phrase": "extensive_studies"}, {"score": 0.0033355353594739707, "phrase": "operating_mechanisms"}, {"score": 0.003313530464737521, "phrase": "potential_implications"}, {"score": 0.0030808211830129304, "phrase": "computational_model"}, {"score": 0.003030247482854539, "phrase": "intertwined_dynamics"}, {"score": 0.0028644081075973877, "phrase": "experimental_observations"}, {"score": 0.0027256122357680393, "phrase": "critical_roles"}, {"score": 0.0024192592458651204, "phrase": "adjacent_cells"}, {"score": 0.0023795195973873636, "phrase": "asynchronous_oscillations"}, {"score": 0.0022049428043454966, "phrase": "intercellular_notch"}, {"score": 0.0021330830123432614, "phrase": "good_candidate"}, {"score": 0.0021049977753042253, "phrase": "first_qualitative_mechanism"}], "paper_keywords": [""], "paper_abstract": "Motivation: In the developing nervous system, the expression of proneural genes, i.e. Hes1, Neurogenin-2 (Ngn2) and Deltalike-1 (Dll1), oscillates in neural progenitors with a period of 2-3 h, but is persistent in post-mitotic neurons. Unlike the synchronization of segmentation clocks, oscillations in neural progenitors are asynchronous between cells. It is known that Notch signaling, in which Notch in a cell can be activated by Dll1 in neighboring cells (trans-activation) and can also be inhibited by Dll1 within the same cell (cis-inhibition), is important for neural fate decisions. There have been extensive studies of trans-activation, but the operating mechanisms and potential implications of cis-inhibition are less clear and need to be further investigated. Results: In this article, we present a computational model for neural fate decisions based on intertwined dynamics with trans-activation and cis-inhibition involving the Hes1, Notch and Dll1 proteins. In agreement with experimental observations, the model predicts that both trans-activation and cis-inhibition play critical roles in regulating the choice between remaining as a progenitor and embarking on neural differentiation. In particular, trans-activation is essential for generation of oscillations in neural progenitors, and cis-inhibition is important for the asynchrony between adjacent cells, indicating that the asynchronous oscillations in neural progenitors depend on cooperation between trans-activation and cis-inhibition. In contrast, cis-inhibition plays more critical roles in embarking on neural differentiation by inactivating intercellular Notch signaling. The model presented here might be a good candidate for providing the first qualitative mechanism of neural fate decisions mediated by both trans-activation and cis-inhibition.", "paper_title": "Neural fate decisions mediated by trans-activation and cis-inhibition in Notch signaling", "paper_id": "WOS:000296637500012"}