{"auto_keywords": [{"score": 0.04921958265040906, "phrase": "collaborative_learning"}, {"score": 0.01196532176735724, "phrase": "new_technologies"}, {"score": 0.00481495049065317, "phrase": "educational_multiplayer_videogames"}, {"score": 0.00456020621016909, "phrase": "learning_process"}, {"score": 0.0038179283509963695, "phrase": "recreational_educational_techniques"}, {"score": 0.003681923235979914, "phrase": "increasing_presence"}, {"score": 0.0034742854447532678, "phrase": "new_way"}, {"score": 0.0031960852616842207, "phrase": "group_environment"}, {"score": 0.003037736332283186, "phrase": "traditional_education"}, {"score": 0.002918826667294298, "phrase": "collaborative_learning_techniques"}, {"score": 0.002876747208161839, "phrase": "educational_videogames"}, {"score": 0.0027242666160349938, "phrase": "particular_case"}, {"score": 0.00260810691979637, "phrase": "design_guidelines"}, {"score": 0.0024968877430444304, "phrase": "videogame_development_process"}, {"score": 0.002407827985570249, "phrase": "videogame_architecture"}, {"score": 0.0022884433286785165, "phrase": "practical_example"}, {"score": 0.0022228943786652914, "phrase": "educational_videogame"}, {"score": 0.002206801982145622, "phrase": "group_activities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Videogame design", " Educational videogames", " CSCL", " e-Learning", " Collaborative systems", " Adaptive systems"], "paper_abstract": "Videogames and their specific devices can be used to improve learning process since they are very attractive for children. In this way, pupils increase their cognitive skills, the time dedicated to learn. their motivation for learning, their concentration and their attention while they are working/playing. The subject of \"learning by play\" is behind the introduction of recreational educational techniques in the classroom. If we also consider the increasing presence of new technologies in society in general and in classrooms in particular, we encounter a new way of teaching/learning. Moreover, several studies in the area of computer supported collaborative learning (CSCL) have proved that learning in a group environment (both actively and interactively) is much more productive for pupils than traditional education. Our main objective is to reduce the complexity of introducing the collaborative learning techniques into development of educational videogames. So, in this paper we analyze the use of videogames as a particular case of new technologies in the classroom and we present a set of design guidelines to enable us to incorporate the features of collaborative learning in the videogame development process. We also explore how these guidelines affect the videogame architecture and how they can be applied when designing a videogame. As a practical example of using our proposal we have designed an educational videogame with group activities which aim is to learn the vowels. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Design of educational multiplayer videogames: A vision from collaborative learning", "paper_id": "WOS:000269816400006"}