{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "global"}, {"score": 0.004673290248999786, "phrase": "detailed_glossy_illumination"}, {"score": 0.004581162468419365, "phrase": "glossy_materials"}, {"score": 0.0045357787854931894, "phrase": "design_applications"}, {"score": 0.004294052530714228, "phrase": "major_challenge"}, {"score": 0.0035891316580885665, "phrase": "fast_solutions"}, {"score": 0.003347259612209552, "phrase": "underlying_light_transport"}, {"score": 0.003264872488939969, "phrase": "many-light_algorithms"}, {"score": 0.0031845067058084583, "phrase": "fast_approximations"}, {"score": 0.0030906666356950887, "phrase": "light_transport_matrix"}, {"score": 0.002481747081849503, "phrase": "high-rank_component"}, {"score": 0.0024327171018928458, "phrase": "local_light_technique"}, {"score": 0.0023727863021828547, "phrase": "missing_illumination"}, {"score": 0.0023259039577313294, "phrase": "competing_techniques"}, {"score": 0.0022913497040895586, "phrase": "superior_gloss"}, {"score": 0.002158179521369965, "phrase": "industrial_design"}, {"score": 0.0021049977753042253, "phrase": "material_appearance"}], "paper_keywords": ["global illumination", " glossy interreflection", " many lights"], "paper_abstract": "Accurately rendering glossy materials in design applications, where previewing and interactivity are important, remains a major challenge. While many fast global illumination solutions have been proposed, all of them work under limiting assumptions on the materials and lighting in the scene. In the presence of many glossy (directionally scattering) materials, fast solutions either fail or degenerate to inefficient, brute-force simulations of the underlying light transport. In particular, many-light algorithms are able to provide fast approximations by clamping elements of the light transport matrix, but they eliminate the part of the transport that contributes to accurate glossy appearance. In this paper we introduce a solution that separately solves for the global (low-rank, dense) and local (highrank, sparse) illumination components. For the low-rank component we introduce visibility clustering and approximation, while for the high-rank component we introduce a local light technique to correct for the missing illumination. Compared to competing techniques we achieve superior gloss rendering in minutes, making our technique suitable for applications such as industrial design and architecture, where material appearance is critical.", "paper_title": "Combining Global and Local Virtual Lights for Detailed Glossy Illumination", "paper_id": "WOS:000284943000007"}