{"auto_keywords": [{"score": 0.040012451990183516, "phrase": "htm_competency"}, {"score": 0.021847544901504503, "phrase": "conceptual_model"}, {"score": 0.019176420885819778, "phrase": "healthcare_organizations"}, {"score": 0.009745013713516819, "phrase": "htm"}, {"score": 0.007995004986199782, "phrase": "large-scale_survey_data"}, {"score": 0.004814978379706624, "phrase": "healthcare"}, {"score": 0.004667149874736771, "phrase": "it-healthcare_partnerships_development"}, {"score": 0.004453874101119545, "phrase": "healthcare_technology_management"}, {"score": 0.004333973355873714, "phrase": "healthcare_is_professionals"}, {"score": 0.004200874581076468, "phrase": "strategic_advantages"}, {"score": 0.004168240841388958, "phrase": "information_technology"}, {"score": 0.003993216345115755, "phrase": "different_divisions"}, {"score": 0.00331125524068286, "phrase": "empirical_results"}, {"score": 0.0032727116186194584, "phrase": "proposed_structure"}, {"score": 0.002865929543375884, "phrase": "information_system"}, {"score": 0.002745438358145758, "phrase": "healthcare_professionals"}, {"score": 0.002579140290642792, "phrase": "it-healthcare_partnerships"}, {"score": 0.002499798127196099, "phrase": "particular_value"}, {"score": 0.00243237365704391, "phrase": "competency_development"}, {"score": 0.0023391880766516285, "phrase": "htm_profiles"}, {"score": 0.0023209828061385596, "phrase": "individual_is_professionals"}, {"score": 0.002171836484200008, "phrase": "succession-planning_decisions"}, {"score": 0.0021381565332182773, "phrase": "competency_levels"}, {"score": 0.0021215125099937663, "phrase": "development_needs"}], "paper_keywords": ["Healthcare", " IS professional", " Healthcare technology management", " Competency development", " Skills/knowledge", " IT-healthcare partnerships"], "paper_abstract": "Objective: This study presents a conceptual model to investigate the healthcare technology management (HTM) competency required by healthcare IS professionals and the impact of such competency in gaining strategic advantages through information technology (IT) by development of partnerships with people from different divisions of healthcare organizations. Methods: First, a scale to measure HTM competency was developed and validated, then it was used to collect the large-scale survey data. Second, the partial least squares (PLS) method was used to empirically test the conceptual model and hypotheses through the large-scale survey data collected. Results: The empirical results support the proposed structure for HTM competency encompassing the four skills/knowledge domains: healthcare organization overview, external knowledge networking, healthcare technology integration, and management and interpersonal. The findings indicate that HTM competency positively influences the attitudes of information system (IS) professionals towards their willingness to develop partnerships with healthcare professionals. Conclusions: The findings improve our understanding of the concept of HTM competency and its influence on IT-healthcare partnerships. The conceptual model of HTM is of particular value to those concerned with skills/knowledge training and competency development for IS professionals in healthcare organizations. Healthcare organizations can develop HTM profiles for individual IS professionals in accordance with their own organization contexts. Executive management can take advantage of such HTM profiles to assist in making succession-planning decisions by evaluating the competency levels and development needs of their employees. (C) 2008 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Healthcare technology management competency and its impacts on IT-healthcare partnerships development", "paper_id": "WOS:000262768100001"}