{"auto_keywords": [{"score": 0.045789687528475675, "phrase": "spherical_function"}, {"score": 0.007740489563401459, "phrase": "polynomial_approach"}, {"score": 0.007172255962077854, "phrase": "odf"}, {"score": 0.004753194996637899, "phrase": "extrema_of_a_spherical_function_and_its_application_in_diffusion_mri._antipodally_symmetric_spherical_functions"}, {"score": 0.004602233424629559, "phrase": "sub-voxel-resolution_microstructural_information"}, {"score": 0.0035429043440226124, "phrase": "homogeneous_polynomial"}, {"score": 0.0035200968295133655, "phrase": "hp"}, {"score": 0.0033211641484589775, "phrase": "stationary_points"}, {"score": 0.0032468685934998335, "phrase": "traditional_optimization_approaches"}, {"score": 0.003163985877966426, "phrase": "exhaustive_search"}, {"score": 0.0031132586744640573, "phrase": "multiple_extrema"}, {"score": 0.00306334226516593, "phrase": "novel_polynomial_system_solver"}, {"score": 0.0029183300121987422, "phrase": "high_precision"}, {"score": 0.0028438099634371886, "phrase": "orientation_distribution_function"}, {"score": 0.0027891678712374975, "phrase": "diffusion_mri"}, {"score": 0.002709161672473817, "phrase": "state-of-the-art_reconstruction_algorithm"}, {"score": 0.002648520437064087, "phrase": "dominant_fiber_bundles"}, {"score": 0.002514947446797848, "phrase": "fiber_bundle_directions"}, {"score": 0.002450702522633428, "phrase": "proposed_polynomial_approach"}, {"score": 0.0021255315818671963, "phrase": "hp_basis"}], "paper_keywords": ["HARDI", " ODF", " Maxima", " Tensors", " Polynomials"], "paper_abstract": "Antipodally symmetric spherical functions play a pivotal role in diffusion MRI in representing sub-voxel-resolution microstructural information of the underlying tissue. This information is described by the geometry of the spherical function. In this paper we propose a method to automatically compute all the extrema of a spherical function. We then classify the extrema as maxima, minima and saddle-points to identify the maxima. We take advantage of the fact that a spherical function can be described equivalently in the spherical harmonic (SH) basis, in the symmetric tensor (ST) basis constrained to the sphere, and in the homogeneous polynomial (HP) basis constrained to the sphere. We extract the extrema of the spherical function by computing the stationary points of its constrained HP representation. Instead of using traditional optimization approaches, which are inherently local and require exhaustive search or re-initializations to locate multiple extrema, we use a novel polynomial system solver which analytically brackets all the extrema and refines them numerically, thus missing none and achieving high precision. To illustrate our approach we consider the Orientation Distribution Function (ODF). In diffusion MRI the ODF is a spherical function which represents a state-of-the-art reconstruction algorithm whose maxima are aligned with the dominant fiber bundles. It is, therefore, vital to correctly compute these maxima to detect the fiber bundle directions. To demonstrate the potential of the proposed polynomial approach we compute the extrema of the ODF to extract all its maxima. This polynomial approach is, however, not dependent on the ODF and the framework presented in this paper can be applied to any spherical function described in either the SH basis, ST basis or the HP basis. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "A polynomial approach for extracting the extrema of a spherical function and its application in diffusion MRI", "paper_id": "WOS:000320355600001"}