{"auto_keywords": [{"score": 0.004458189822972851, "phrase": "promising_target"}, {"score": 0.004412654209742722, "phrase": "anticancer_therapy"}, {"score": 0.003192700856094016, "phrase": "integrated_interaction_model"}, {"score": 0.0031277316566463978, "phrase": "twenty-five_analogues"}, {"score": 0.002955782731675529, "phrase": "molecular_alignment"}, {"score": 0.002851301751761804, "phrase": "qsar_models"}, {"score": 0.0028076592725295646, "phrase": "scoring_function"}, {"score": 0.0027789349951704177, "phrase": "free_energy"}, {"score": 0.00266693888510356, "phrase": "predictive_power"}, {"score": 0.002546315584783112, "phrase": "challenging_test_set"}, {"score": 0.002494466951433885, "phrase": "comsia"}, {"score": 0.002193447487477984, "phrase": "test_set"}], "paper_keywords": [""], "paper_abstract": "The p110 alpha isoform of the class IA PI3Ks was recently genetically validated as a promising target for anticancer therapy. However, up to now, only one compound (PIK75 = 1) has been reported as a very potent and selective inhibitor of this isoform. The lack of a 3D structure for this enzyme has clearly hindered the discovery of new p110 alpha selective compounds. In View of this, we combined target-based (homology modeling) and ligand-based (3D-QSAR) approaches in an attempt to define an integrated interaction model for p110 alpha inhibition. Twenty-five analogues of I were docked within the putative p110 alpha binding site, and the molecular alignment generated was subsequently used to derive QSAR models based on scoring function, free energy of binding, CoMFA. and CoMSIA. The predictive power of these models was then analyzed using a challenging test set of 5 compounds. CoMSIA, and particularly CoMFA, models were found to outperform the other methods, predicting accurately the potency of 100% of the compounds in the test set, thereby validating our p110 alpha homology model for use in further drug development.", "paper_title": "Phosphoinositide-3-kinases (PI3Ks): Combined comparative Modeling and 3D-QSAR to rationalize the inhibition of p110 alpha", "paper_id": "WOS:000254353500016"}