{"auto_keywords": [{"score": 0.047705039724599045, "phrase": "rips_complex"}, {"score": 0.02795599655765478, "phrase": "ech_complex"}, {"score": 0.004815010196380811, "phrase": "collapses"}, {"score": 0.00470975295439431, "phrase": "nicely_triangulable_shape"}, {"score": 0.004311352359122141, "phrase": "homotopy_type"}, {"score": 0.004179991181159956, "phrase": "mild_sampling_conditions"}, {"score": 0.0039905104128696725, "phrase": "compact_sets"}, {"score": 0.0036044660791188037, "phrase": "dead_end"}, {"score": 0.0035727196464877147, "phrase": "famous_bing's_house"}, {"score": 0.003502305158321511, "phrase": "theoretical_justification"}, {"score": 0.003479142341385732, "phrase": "empirical_observation"}, {"score": 0.003410565849262162, "phrase": "point_cloud"}, {"score": 0.0033805214040814233, "phrase": "well-chosen_scale_parameter"}, {"score": 0.0033212215487678854, "phrase": "simplicial_complex_homeomorphic"}, {"score": 0.0030399188412691914, "phrase": "recent_work"}, {"score": 0.002552239981400316, "phrase": "independent_interest"}], "paper_keywords": ["Cech complex", " Rips complex", " Collapses", " Nerve Lemma", " Triangulable space"], "paper_abstract": "Given a set of points that sample a shape, the Rips complex of the points is often used to provide an approximation of the shape easily-computed. It has been proved that the Rips complex captures the homotopy type of the shape, assuming that the vertices of the complex meet some mild sampling conditions. Unfortunately, the Rips complex is generally high-dimensional. To remedy this problem, it is tempting to simplify it through a sequence of collapses. Ideally, we would like to end up with a triangulation of the shape. Experiments suggest that, as we simplify the complex by iteratively collapsing faces, it should indeed be possible to avoid entering a dead end such as the famous Bing's house with two rooms. This paper provides a theoretical justification for this empirical observation. We demonstrate that the Rips complex of a point cloud (for a well-chosen scale parameter) can always be turned into a simplicial complex homeomorphic to the shape by a sequence of collapses, assuming that the shape is nicely triangulable and well-sampled (two concepts we will explain in the paper). To establish our result, we rely on a recent work which gives conditions under which the Rips complex can be converted into a ech complex by a sequence of collapses. We proceed in two phases. Starting from the ech complex, we first produce a sequence of collapses that arrives to the ech complex, restricted by the shape. We then apply a sequence of collapses that transforms the result into the nerve of some covering of the shape. Along the way, we establish results which are of independent interest. First, we show that the reach of a shape cannot decrease when intersected with a (possibly infinite) collection of balls, assuming the balls are small enough. Under the same hypotheses, we show that the restriction of a shape with respect to an intersection of balls is either empty or contractible. We also provide conditions under which the nerve of a family of compact sets undergoes collapses as the compact sets evolve over time. We believe conditions are general enough to be useful in other contexts as well.", "paper_title": "Geometry-driven Collapses for Converting a ech Complex into a Triangulation of a Nicely Triangulable Shape", "paper_id": "WOS:000363959500003"}