{"auto_keywords": [{"score": 0.04903589335092133, "phrase": "neuro-fuzzy_networks"}, {"score": 0.04320038033945778, "phrase": "global_solution"}, {"score": 0.03492129383115456, "phrase": "partial_solutions"}, {"score": 0.03093166086339985, "phrase": "proposed_evolutionary_algorithm"}, {"score": 0.015719716506582538, "phrase": "self-adaptive_evolutionary_algorithm"}, {"score": 0.012545977528250329, "phrase": "psc"}, {"score": 0.009233346024045191, "phrase": "suitable_searching_space"}, {"score": 0.004590496414177077, "phrase": "popular_research_field"}, {"score": 0.004360412703519539, "phrase": "efficient_and_robustness_evolutionary_algorithm"}, {"score": 0.004265354774450696, "phrase": "evolution_process"}, {"score": 0.003948613642680196, "phrase": "novel_evolutionary_algorithm"}, {"score": 0.0038624981944755813, "phrase": "based_self-adaptive_evolutionary_algorithm"}, {"score": 0.0036958398682001015, "phrase": "proposed_algorithm"}, {"score": 0.003471933181807712, "phrase": "existing_evolution_algorithms"}, {"score": 0.0033465923623290034, "phrase": "complementary_relationships"}, {"score": 0.00327356326590461, "phrase": "complete_solution"}, {"score": 0.003213920601037463, "phrase": "suboptimal_solution"}, {"score": 0.0031324184369681198, "phrase": "sea"}, {"score": 0.0030414140732789186, "phrase": "searching_space"}, {"score": 0.0026252106881752067, "phrase": "better_performance"}, {"score": 0.0026059610060579145, "phrase": "smoother_learning_curves"}, {"score": 0.00226583335721762, "phrase": "evolutionary_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Evolutionary algorithm", " Self adaptive", " Global solution", " Neuro-fuzzy networks"], "paper_abstract": "Evolutionary computation has become a popular research field due to its global searching ability. Therefore, it raises a challenge to develop an efficient and robustness evolutionary algorithm to not only reduce the evolution process but also increase the chances to meet the global solution. To this end, this study aims to provide a novel evolutionary algorithm named the partial solutions consideration based self-adaptive evolutionary algorithm (PSC-SEA) to address this issue; the proposed algorithm is applied to adjust the parameters of the neuro-fuzzy networks. More specifically, different from the existing evolution algorithms, the partial solutions consideration (PSC) tends to consider both the specializations and complementary relationships of the partial solutions from the complete solution to prevent converging to suboptimal solution. Moreover, a self-adaptive evolutionary algorithm (SEA) is proposed to dynamically adjust the searching space according to the performance. By doing so, the proposed evolutionary algorithm can consider the influence of partial solutions and provide a suitable searching space to increase the chances to meet the global solution. As shown in the results, the proposed evolutionary algorithm obtains better performance and smoother learning curves than other existing evolutionary algorithms. In other words, the proposed evolutionary algorithm can efficient tune the parameters of the neuro-fuzzy networks to meet the global solution. Base on the results, a framework is proposed to build a benchmark for developing the evolutionary algorithms that can not only consider the influence of partial solutions but also provide a suitable searching space. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "The partial solutions consideration based self-adaptive evolutionary algorithm: A learning structure of neuro-fuzzy networks", "paper_id": "WOS:000305863300043"}