{"auto_keywords": [{"score": 0.04839945497190438, "phrase": "ldse"}, {"score": 0.015719716506582538, "phrase": "low-dimensional_simplex_evolution"}, {"score": 0.012396901987137941, "phrase": "ldr"}, {"score": 0.004552255360140208, "phrase": "real-coded_evolutionary_algorithm"}, {"score": 0.0034733518170738517, "phrase": "offspring_individuals"}, {"score": 0.0031845067058084583, "phrase": "unlucky_individual_search"}, {"score": 0.0031360786664165093, "phrase": "best_vertex"}, {"score": 0.0029798924689472014, "phrase": "recent_failure"}, {"score": 0.0026359661683151006, "phrase": "convergence_properties"}, {"score": 0.0025694584194998356, "phrase": "finite_markov_chains"}, {"score": 0.0024918548761791435, "phrase": "original_ldse"}, {"score": 0.0022961534630650347, "phrase": "initial_population"}, {"score": 0.0022382002476510573, "phrase": "convergence_speed"}, {"score": 0.0022154296909169826, "phrase": "modified_ldse"}, {"score": 0.0021049977753042253, "phrase": "global_minimum"}], "paper_keywords": ["global optimization", " evolutionary algorithm", " genetic algorithm", " low dimensional", " variable dimension", " Markov chain"], "paper_abstract": "Low-dimensional simplex evolution (LDSE) is a real-coded evolutionary algorithm for global optimization. In this paper, we introduce three techniques to improve its performance: low-dimensional reproduction (LDR), normal struggle (NS) and variable dimension (VD). LDR tries to preserve the elite by keeping some of its (randomly chosen) components. LDR can also help the offspring individuals to escape from the hyperplane determined by their parents. NS tries to enhance its local search capability by allowing unlucky individual search around the best vertex of m-simplex. VD tries to draw lessons from recent failure by making further exploitation on its most promising sub-facet. Numerical results show that these techniques can improve the efficiency and reliability of LDSE considerably. The convergence properties are then analysed by finite Markov chains. It shows that the original LDSE might fail to converge, but modified LDSE with the above three techniques will converge for any initial population. To evaluate the convergence speed of modified LDSE, an estimation of its first passage time (of reaching the global minimum) is provided.", "paper_title": "Some modifications of low-dimensional simplex evolution and their convergence", "paper_id": "WOS:000309708800004"}