{"auto_keywords": [{"score": 0.02791465718403735, "phrase": "orientation_sensor_error"}, {"score": 0.00481495049065317, "phrase": "digital_system_latency"}, {"score": 0.004602773636967002, "phrase": "new_method"}, {"score": 0.004334280585565239, "phrase": "digital_computing_system"}, {"score": 0.004269630481719451, "phrase": "previous_works"}, {"score": 0.004096751549280256, "phrase": "discrete_events"}, {"score": 0.0032571885279065126, "phrase": "orientation_sensor"}, {"score": 0.003066945490483524, "phrase": "cyclical_variation"}, {"score": 0.0029648446274266765, "phrase": "relative_rates"}, {"score": 0.0029095936591723645, "phrase": "actuator_clocks"}, {"score": 0.0022781884538102264, "phrase": "virtual_reality_systems"}, {"score": 0.0021775526153883355, "phrase": "apparent_latency"}, {"score": 0.0021049977753042253, "phrase": "simulator_sickness"}], "paper_keywords": [""], "paper_abstract": "This paper describes a new method for measuring the end-to-end latency between sensing and actuation in a digital computing system. Compared to previous works, which generally measured the latency at 10-33-ms intervals or at discrete events separated by hundreds of ms, our new method measures the latency continuously at 1-ms resolution. This allows for the observation of variations in latency over sub 1-s periods, instead of relying upon averages of measurements. We have applied our method to two systems, the first using a camera for sensing and an LCD monitor for actuation, and the second using an orientation sensor for sensing and a motor for actuation. Our results show two interesting findings. First, a cyclical variation in latency can be seen based upon the relative rates of the sensor and actuator clocks and buffer times; for the components we tested, the variation was in the range of 15-50 Hz with a magnitude of 10-20 ms. Second, orientation sensor error can look like a variation in latency; for the sensor we tested, the variation was in the range of 0.5-1.0 Hz with a magnitude of 20-100 ms. Both of these findings have implications for robotics and virtual reality systems. In particular, it is possible that the variation in apparent latency caused by orientation sensor error may have some relation to simulator sickness.", "paper_title": "Measuring Digital System Latency from Sensing to Actuation at Continuous 1-ms Resolution", "paper_id": "WOS:000318352600002"}