{"auto_keywords": [{"score": 0.04841960597199349, "phrase": "conceptual_latitude"}, {"score": 0.004601508848655033, "phrase": "conceptual_fit"}, {"score": 0.0044870272550540415, "phrase": "growing_interest"}, {"score": 0.004442032546224076, "phrase": "theory_building"}, {"score": 0.004397487039229447, "phrase": "information_systems"}, {"score": 0.004139401327448807, "phrase": "theory_building_perspectives"}, {"score": 0.003975781274672803, "phrase": "researcher's_choice"}, {"score": 0.0032494292163722065, "phrase": "future_research"}, {"score": 0.003012560489169148, "phrase": "different_theoretical_perspectives"}, {"score": 0.002922705896608178, "phrase": "existing_theoretical_model"}, {"score": 0.0026554236621262515, "phrase": "traditional_process-variance_dichotomy"}, {"score": 0.0021049977753042253, "phrase": "knowledge_generation_process"}], "paper_keywords": ["theory", " methodology", " process", " variance", " system", " epistemology"], "paper_abstract": "There has been growing interest in theory building in Information Systems (IS) research. We extend this literature by examining theory building perspectives. We define a perspective as a researcher's choice of the types of concepts and relationships used to construct a theory, and we examine three perspectives process, variance, and systems. We contribute by clarifying these perspectives and explaining how they can be used more flexibly in future research. We illustrate the value of this more flexible approach by showing how researchers can use different theoretical perspectives to critique and extend an existing theoretical model (in our case, the IS Success Model). Overall, we suggest a shift from the traditional process-variance dichotomy to a broader view defined by conceptual latitude (the types of concepts and relationships available) and conceptual fit (the types of concepts and relationships appropriate for a given study). We explain why this shift should help researchers as they engage in the knowledge generation process.", "paper_title": "Theoretical perspectives in IS research: from variance and process to conceptual latitude and conceptual fit", "paper_id": "WOS:000365894900007"}