{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "computer-supported_collaborative_learning_settings"}, {"score": 0.004722898398399427, "phrase": "exploratory_study"}, {"score": 0.00456159659731398, "phrase": "synchronous_collaborative_interaction"}, {"score": 0.004405779372462873, "phrase": "later_construction"}, {"score": 0.0043718794256931435, "phrase": "reflection_reports"}, {"score": 0.004015693806064219, "phrase": "visu_videoconferencing_tool"}, {"score": 0.00398478333092707, "phrase": "synchronous_interaction"}, {"score": 0.0035899674590142653, "phrase": "quantitative_descriptive_analysis"}, {"score": 0.0033357416981328577, "phrase": "reflection_categories"}, {"score": 0.00292477450010107, "phrase": "mainly_positive_markers"}, {"score": 0.0023278569001363263, "phrase": "second_reflection_reports"}, {"score": 0.0022308329460335985, "phrase": "first_reflection_reports"}], "paper_keywords": ["Cooperative/collaborative learning", " Computer-mediated communication", " Distance education and telelearning"], "paper_abstract": "We describe an exploratory study on the use of markers set during a synchronous collaborative interaction (reflection-in-action) for later construction of reflection reports upon the collaboration that occurred (reflection-on-action). During two sessions, pairs of students used the Visu videoconferencing tool for synchronous interaction and marker setting (positive, negative or free) and then individual report building on the interaction (using markers or not). A quantitative descriptive analysis was conducted on the markers put in action, on their use to reflect on action and on the reflection categories of the sentences in these reports. Results show that the students (1) used the markers equally as a note-taking and reflection means during the interaction, (2) used mainly positive markers both to reflect in and on action; (3) paid more attention in identifying what worked in their interaction (conservative direction) rather than in planning on how to improve their group work (progressive direction); (4) used mainly their own markers to reflect on action, with an increase in the use of their partners' markers in the second reflection reports; (5) reflected mainly on their partner in the first reflection reports and more on themselves in the second reports to justify themselves and to express their satisfaction. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Reflection-in-action markers for reflection-on-action in Computer-Supported Collaborative Learning settings", "paper_id": "WOS:000363818800012"}