{"auto_keywords": [{"score": 0.049692788583269344, "phrase": "distributed_environments"}, {"score": 0.00481495049065317, "phrase": "search_strategies"}, {"score": 0.004737579882204798, "phrase": "distributed_systems"}, {"score": 0.004642604455537883, "phrase": "large_number"}, {"score": 0.004605147081797856, "phrase": "heterogeneous_entities"}, {"score": 0.003453584878128719, "phrase": "efficient_way"}, {"score": 0.0033433365160336842, "phrase": "easy_task"}, {"score": 0.0033163269450817716, "phrase": "open_and_dynamic_environments"}, {"score": 0.003223494720348768, "phrase": "available_resources"}, {"score": 0.0031974502006267163, "phrase": "global_information"}, {"score": 0.00303319936111073, "phrase": "comprehensive_vision"}, {"score": 0.0028541057064952876, "phrase": "peer-to-peer_area"}, {"score": 0.0024461989110005447, "phrase": "key_role"}, {"score": 0.00241658945942583, "phrase": "proper_performance"}, {"score": 0.0021922308351126746, "phrase": "underlying_system_structure"}, {"score": 0.0021049977753042253, "phrase": "search_process"}], "paper_keywords": [""], "paper_abstract": "Distributed systems are populated by a large number of heterogeneous entities that join and leave the systems dynamically. These entities act as clients and providers and interact with each other in order to get a resource or to achieve a goal. To facilitate the collaboration between entities, the system should provide mechanisms to manage the information about which entities or resources are available in the system at a certain moment, as well as how to locate them in an efficient way. However, this is not an easy task in open and dynamic environments where there are changes in the available resources and global information is not always available. In this paper, we present a comprehensive vision of search in distributed environments. This review not only considers the approaches of the peer-to-peer area, but also the approaches from three more areas: service-oriented environments, multi-agent systems, and complex networks. In these areas, the search for resources, services, or entities plays a key role for the proper performance of the systems built on them. The aim of this analysis is to compare approaches from these areas taking into account the underlying system structure and the algorithms or strategies that participate in the search process.", "paper_title": "An overview of search strategies in distributed environments", "paper_id": "WOS:000335848200001"}