{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "image_classification"}, {"score": 0.02597349542017115, "phrase": "local-based_representation"}, {"score": 0.019594505840891997, "phrase": "layered_representation"}, {"score": 0.009345512384212076, "phrase": "local_features"}, {"score": 0.007438868089489915, "phrase": "kernel-based_classification_methods"}, {"score": 0.0053521308262556855, "phrase": "global_features"}, {"score": 0.0045108906244892165, "phrase": "kernel_selection"}, {"score": 0.004397875849247165, "phrase": "classification_accuracy"}, {"score": 0.0043345662747335065, "phrase": "local-based_image_representation"}, {"score": 0.004256703909255889, "phrase": "computer_vision"}, {"score": 0.004060718465754644, "phrase": "appropriate_kernels"}, {"score": 0.003642070943285037, "phrase": "unordered_sets"}, {"score": 0.003592186094004324, "phrase": "proposed_method"}, {"score": 0.003563651133299401, "phrase": "spatial_layout"}, {"score": 0.003461702544605219, "phrase": "global_feature"}, {"score": 0.002897710777957041, "phrase": "desirable_accuracy"}, {"score": 0.0027242666160349938, "phrase": "aggregation_features"}, {"score": 0.0026366753045215558, "phrase": "novel_kernel"}, {"score": 0.0024253827365474734, "phrase": "computational_complexity"}, {"score": 0.0023990982005125763, "phrase": "proposed_kernel"}, {"score": 0.0022884433286785165, "phrase": "multi-pyramids_match_kernel"}, {"score": 0.002182881082103045, "phrase": "image_retrieval"}, {"score": 0.0021592189144729775, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "existing_methods"}], "paper_keywords": [""], "paper_abstract": "When realizing image classification by the kernel-based classification methods, the image representation and the kernel selection are two key factors affecting the classification accuracy. Because the local-based image representation is very popular in computer vision, the state-of-the-art work focuses on finding appropriate kernels to improve the results of image classification on the local-based representation. However, the limitations of local-based representation are seldom considered. In the local-based representation, images are usually represented by unordered sets of local features without considering the spatial layout of local features. Moreover, because the global feature of one image is not the combination of its local features, the global features of images including the same local features are different. These images are difficult to discriminate by the local-based representation. The focus of this paper is that how to effectively overcome the deficiencies of the local-based representation to achieve a desirable accuracy of image classification. In this paper, we first propose a layered representation which includes local features, aggregation features and global features. Second, we present a novel kernel named hierarchical kernel by which the kernel-based classification methods can be applied to realize image classification based on the layered representation. To further reduce the computational complexity of the proposed kernel, we present the method of quantization on the layered representation and the multi-pyramids match kernel. Finally, we evaluate the proposed method by experiments of image classification and image retrieval. The experimental results show that the proposed method outperforms the existing methods.", "paper_title": "A hierarchical kernel for image classification based on a layered representation", "paper_id": "WOS:000343784300005"}