{"auto_keywords": [{"score": 0.046070723072915966, "phrase": "hbs"}, {"score": 0.00481495049065317, "phrase": "heartbeat_morphology"}, {"score": 0.004662705558154439, "phrase": "new_feature"}, {"score": 0.004453488286477661, "phrase": "ecg-based_biometrics"}, {"score": 0.004273196830970426, "phrase": "segmented_heartbeats"}, {"score": 0.0037402558657576124, "phrase": "invariant_transformation"}, {"score": 0.0034118234596993836, "phrase": "reasonably_short_period"}, {"score": 0.0031121406603482112, "phrase": "proposed_feature"}, {"score": 0.00290473242917264, "phrase": "second_database"}, {"score": 0.0026494723416072316, "phrase": "high_identification_accuracy"}, {"score": 0.002297327670408112, "phrase": "five_consecutive_heartbeats"}, {"score": 0.002224510044064184, "phrase": "original_ecg_signal"}, {"score": 0.002163930783583212, "phrase": "efficient_communication"}, {"score": 0.0021049977753042253, "phrase": "telecardiology_scenarios"}], "paper_keywords": ["Biomedical signal processing", " biometrics", " electrocardiogram (ECG)", " feature extraction"], "paper_abstract": "In this paper, a new feature named heartbeat shape (HBS) is proposed for ECG-based biometrics. HBS is computed from the morphology of segmented heartbeats. Computation of the feature involves three basic steps: 1) resampling and normalization of a heartbeat; 2) reduction of matching error; and 3) shift invariant transformation. In order to construct both gallery and probe templates, a few consecutive heartbeats which could be captured in a reasonably short period of time are required. Thus, the identification and verification methods become efficient. We have tested the proposed feature independently on two publicly available databases with 76 and 26 subjects, respectively, for identification and verification. The second database contains several subjects having clinically proven cardiac irregularities (atrial premature contraction arrhythmia). Experiments on these two databases yielded high identification accuracy (98% and 99.85%, respectively) and low verification equal error rate (1.88% and 0.38%, respectively). These results were obtained by using templates constructed from five consecutive heartbeats only. This feature compresses the original ECG signal significantly to be useful for efficient communication and access of information in telecardiology scenarios.", "paper_title": "HBS: A Novel Biometric Feature Based on Heartbeat Morphology", "paper_id": "WOS:000303997700017"}