{"auto_keywords": [{"score": 0.04862149539149325, "phrase": "team_structure"}, {"score": 0.02636111726091273, "phrase": "team_formation"}, {"score": 0.00481495049065317, "phrase": "dynamic_team"}, {"score": 0.004787966206092959, "phrase": "goal_formation"}, {"score": 0.004694700982410345, "phrase": "monitoring_goals"}, {"score": 0.004577440795549049, "phrase": "dynamic_systems"}, {"score": 0.004388450908826472, "phrase": "asymmetric_urban_warfare_environment"}, {"score": 0.004351595642056769, "phrase": "uncoordinated_or_loosely_coordinated_units"}, {"score": 0.004278807087784626, "phrase": "important_target"}, {"score": 0.003988345858759183, "phrase": "early_warnings"}, {"score": 0.003148854910240482, "phrase": "state_space"}, {"score": 0.003113601003720005, "phrase": "individual_units'_positions"}, {"score": 0.003070086433952691, "phrase": "team_goals"}, {"score": 0.0029681091946289757, "phrase": "team's_goal"}, {"score": 0.002943147037670826, "phrase": "individual_unit's_movement"}, {"score": 0.0028857130140890787, "phrase": "different_units"}, {"score": 0.0028214413724451442, "phrase": "new_goals"}, {"score": 0.0023694065215394593, "phrase": "individual_units'_behavior"}, {"score": 0.0022777800735119405, "phrase": "twenty_units"}, {"score": 0.0022145052062614514, "phrase": "standard_factored_particle_filtering"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Particle filtering", " Goal detection", " Threat detection", " Multiagent tracking"], "paper_abstract": "We study the problem of monitoring goals, team structure and state of agents, in dynamic systems where teams and goals change over time. The setting for our study is an asymmetric urban warfare environment in which uncoordinated or loosely coordinated units may attempt to attack an important target. The task is to detect a threat Such as an ambush, as early as possible. We attempt to provide decision-makers with early warnings, by simultaneously monitoring the positions of units, the teams to which they belong, and the goals of units. The hope is that we can detect situations in which teams of units simultaneously make movements headed towards a target, and we can detect their goal before they get to the target. By reasoning about teams, we may be able to detect threats sooner than if we reasoned about units individually. We develop a model in which the state space is decomposed into individual units' positions, team assignments and team goals. When a unit belongs to a team it adopts the team's goal. An individual unit's movement depends only on its own goal, but different units interact as they form teams and adopt new goals. We present an algorithm that simultaneously tracks the positions of units, the team structure and team goals. Goals are inferred from two sources: individual units' behavior, which provides information about their goals, and communications by units, which provides evidence about team formation. Our algorithm reasons globally about interactions between units and team formation, and locally about individual units' behavior. We show that our algorithm performs well at the task, scaling to twenty units. It performs significantly better than several alternative algorithms: standard particle filtering, standard factored particle filtering, and an algorithm that performs all reasoning locally within the units. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Factored reasoning for monitoring dynamic team and goal formation", "paper_id": "WOS:000260644500008"}