{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "delay-bounded_data_forwarding"}, {"score": 0.004774115617883476, "phrase": "low-duty-cycle_sensor_networks."}, {"score": 0.004402973626416765, "phrase": "data_forwarding_operations"}, {"score": 0.003941215575554871, "phrase": "designated_time"}, {"score": 0.00387459052649752, "phrase": "energy_harvesting_sensor_networks"}, {"score": 0.003760685138103153, "phrase": "sensor_nodes"}, {"score": 0.0033374705499418377, "phrase": "always-active_networks"}, {"score": 0.003211788912325178, "phrase": "data_forwarding_problems"}, {"score": 0.00317095235382607, "phrase": "energy_harvesting_sensor_network"}, {"score": 0.0029116257477000617, "phrase": "utility-based_delay"}, {"score": 0.0028623555849897632, "phrase": "data_forwarding"}, {"score": 0.0027781249331615813, "phrase": "maxoputility_scheme"}, {"score": 0.00268488398249084, "phrase": "relay_nodes"}, {"score": 0.002433843373780471, "phrase": "end-to-end_delay"}, {"score": 0.0023824468367751365, "phrase": "extensive_simulations"}, {"score": 0.0022634699331607615, "phrase": "optimal_one"}, {"score": 0.0021049977753042253, "phrase": "energy_harvesting_networks"}], "paper_keywords": ["low-duty-cycle sensor networks", " delay bound", " data forwarding"], "paper_abstract": "In many sensor network applications, sink node needs to actively communicate with other sensor nodes in order to perform data forwarding operations. For those applications, there is usually a delay-bounded associated with them and require the messages sent to be received within a designated time bound. In energy harvesting sensor networks, limited energy from environment necessitates sensor nodes to operate at a low-duty-cycle. Sensor nodes work active briefly and stay asleep most of time. Such low-duty-cycle operation leads to communication delays in comparison with the always-active networks. In this paper, we address the data forwarding problems in an energy harvesting sensor network where energy efficiency and data freshness need to be balanced. To solve this problem, we propose a utility-based delay bounded scheme for data forwarding, MaxOpUtility-based scheme. MaxOpUtility scheme offers the ability to increase reliability through relay nodes selection as well as to ensure the timeliness. In addition, we show how nodes in the network can cooperatively bound end-to-end delay with maximum utility. Extensive simulations are conducted to verify the effectiveness of our approach compared with the optimal one. Meanwhile, we demonstrate that our solution is able to effectively provide delay bounded guarantee in energy harvesting networks.", "paper_title": "DELAY-BOUNDED DATA FORWARDING IN LOW-DUTY-CYCLE SENSOR NETWORKS", "paper_id": "WOS:000318578100003"}