{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "planar_objects"}, {"score": 0.04359507472924844, "phrase": "common_grasp"}, {"score": 0.03817717905827684, "phrase": "feature_vectors"}, {"score": 0.03740322310240642, "phrase": "feature_vector"}, {"score": 0.03445564019371514, "phrase": "search_algorithm"}, {"score": 0.029218408740257874, "phrase": "common_vectors"}, {"score": 0.004647911247507267, "phrase": "simple_end-effector_design"}, {"score": 0.003950846696972114, "phrase": "force_closure"}, {"score": 0.003923023699005215, "phrase": "quality_criteria"}, {"score": 0.0038407203087210775, "phrase": "external_wrenches"}, {"score": 0.003681238363808568, "phrase": "mapped_grasps"}, {"score": 0.003591272267478512, "phrase": "high-dimensional_space"}, {"score": 0.0032991276152705934, "phrase": "feature_vector_space"}, {"score": 0.002988101395789399, "phrase": "kd-tree_index_structure"}, {"score": 0.002863921785266393, "phrase": "kd-tree_structure"}, {"score": 0.0026967596578196325, "phrase": "common_vector"}, {"score": 0.0026307897899760383, "phrase": "grasp_configuration"}, {"score": 0.0025393296453558203, "phrase": "future_end-effector_design"}, {"score": 0.00225144317399471, "phrase": "proposed_algorithm"}, {"score": 0.0021731423856364003, "phrase": "end-effector_design"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Algorithm", " Common", " Grasp", " Search", " End-Effector"], "paper_abstract": "This paper addresses the problem of defining a simple End-Effector design for a robotic arm that is able to grasp a given set of planar objects. The OCOG (Objects COmmon Grasp search) algorithm proposed in this paper searches for a common grasp over the set of objects mapping all possible grasps for each object that satisfy force closure and quality criteria by taking into account the external wrenches (forces and torque) applied to the object. The mapped grasps are represented by feature vectors in a high-dimensional space. This feature vector describes the design of the gripper. A database is generated for all possible grasps for each object in the feature vector space. A search algorithm is then used for intersecting all possible grasps over all parts and finding a common grasp suitable for all objects. The search algorithm utilizes the kd-tree index structure for representing the database of the sets of feature vectors. The kd-tree structure enables an efficient and low cost nearest-neighbor search for common vectors between the sets. Each common vector found (feature vector) is the grasp configuration for a group of objects, which implies the future end-effector design. The final step classifies the grasps found to subsets of the objects, according to the common vectors found. Simulations and experiments are presented for four objects to validate the feasibility of the proposed algorithm. The algorithm will be useful for standardization of end-effector design and reducing its engineering time. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "OCOG: A common grasp computation algorithm for a set of planar objects", "paper_id": "WOS:000328721600005"}