{"auto_keywords": [{"score": 0.04893803343163639, "phrase": "side_information"}, {"score": 0.006961318834043467, "phrase": "\"vending_machine"}, {"score": 0.005013299173831713, "phrase": "control_actions"}, {"score": 0.00481501138342223, "phrase": "distributed"}, {"score": 0.004643839937761046, "phrase": "source_coding"}, {"score": 0.004533142516832776, "phrase": "recently_proposed_framework"}, {"score": 0.004478782833067256, "phrase": "statistical_relationship"}, {"score": 0.004254901969197879, "phrase": "classical_wyner-ziv_problem"}, {"score": 0.004183496597221766, "phrase": "rate-distortion-cost_region"}, {"score": 0.004128449719260139, "phrase": "control_action"}, {"score": 0.003922011960904278, "phrase": "conventional_settings"}, {"score": 0.0033460886254320157, "phrase": "last_node"}, {"score": 0.0033220260950896537, "phrase": "previously_studied_point"}, {"score": 0.0032821417644980674, "phrase": "point_setup"}, {"score": 0.003213489259323924, "phrase": "distributed_source_coding_model"}, {"score": 0.0031273209718167072, "phrase": "rate-limited_links"}, {"score": 0.0029086349651683383, "phrase": "source_nodes"}, {"score": 0.0028563889983942215, "phrase": "inner_bounds"}, {"score": 0.0026088674879389826, "phrase": "specific_assumptions"}, {"score": 0.0023258192563656204, "phrase": "cascade_scenario"}, {"score": 0.0022361964497681934, "phrase": "controllable_side_information"}, {"score": 0.002143529653780496, "phrase": "general_distortion_requirements"}, {"score": 0.0021049977753042253, "phrase": "causal_availability"}], "paper_keywords": ["Cascade source coding", " distributed source coding", " observation costs", " rate-distortion theory", " side information", " side information vending machine"], "paper_abstract": "Source coding with a side information \"vending machine\" is a recently proposed framework in which the statistical relationship between the side information and the source, instead of being given and fixed as in the classical Wyner-Ziv problem, can be controlled by the decoder. This control action is selected by the decoder based on the message encoded by the source node. Unlike conventional settings, the message can thus carry not only information about the source to be reproduced at the decoder, but also control information aimed at improving the quality of the side information. In this paper, the analysis of the tradeoffs between rate, distortion, and cost associated with the control actions is extended from the previously studied point-to-point setup to two basic multiterminal models. First, a distributed source coding model is studied, in which two encoders communicate over rate-limited links to a decoder, whose side information can be controlled. The control actions are selected by the decoder based on the messages encoded by both source nodes. For this setup, inner bounds are derived on the rate-distortion-cost region for both cases in which the side information is available causally and noncausally at the decoder. These bounds are shown to be tight under specific assumptions, including the scenario in which the sequence observed by one of the nodes is a function of the source observed by the other and the side information is available causally at the decoder. Then, a cascade scenario in which three nodes are connected in a cascade and the last node has controllable side information is also investigated. For this model, the rate-distortion-cost region is derived for general distortion requirements and under the assumption of causal availability of side information at the last node.", "paper_title": "Distributed and Cascade Lossy Source Coding With a Side Information \"Vending Machine\"", "paper_id": "WOS:000324573500043"}