{"auto_keywords": [{"score": 0.033438166505496705, "phrase": "potential_mr_liquefaction_cycle"}, {"score": 0.015665037227221436, "phrase": "feed_stage"}, {"score": 0.01148008244375408, "phrase": "minimum_amount"}, {"score": 0.00481495049065317, "phrase": "lng_fpso"}, {"score": 0.004739216594208376, "phrase": "offshore_selection_criteria"}, {"score": 0.00471423634868663, "phrase": "optimal_liquefaction_process_system"}, {"score": 0.004656457570013065, "phrase": "future_feed_engineering"}, {"score": 0.004631911514270501, "phrase": "liquefied_natural_gas"}, {"score": 0.004615620098755459, "phrase": "lng"}, {"score": 0.004487316523198692, "phrase": "process_requirements"}, {"score": 0.004440123813300428, "phrase": "traditional_onshore_liquefaction_plants"}, {"score": 0.004416713079266374, "phrase": "thermodynamic_efficiency"}, {"score": 0.004393425234566162, "phrase": "key_technical_process_selection_criterion"}, {"score": 0.0043779679607549886, "phrase": "large_onshore_liquefaction_plants"}, {"score": 0.004354883512446079, "phrase": "high-efficiency_pre-cooled_mixed_refrigerant"}, {"score": 0.004293915764641759, "phrase": "onshore_lng_installations"}, {"score": 0.00424874835255179, "phrase": "diverse_technical_and_safety_needs"}, {"score": 0.004204054047427536, "phrase": "offshore_liquefaction_technology_developers"}, {"score": 0.004167166647892815, "phrase": "process_simplicity"}, {"score": 0.004152502093643003, "phrase": "low_weight"}, {"score": 0.004137888930565237, "phrase": "small_footprint"}, {"score": 0.004094356005501426, "phrase": "key_criteria"}, {"score": 0.004072760888284088, "phrase": "process_selection"}, {"score": 0.004029910374251106, "phrase": "offshore_liquefaction_cycle"}, {"score": 0.003910923640004479, "phrase": "offshore_liquefaction_cycles"}, {"score": 0.0037488765358072323, "phrase": "capital_cost"}, {"score": 0.0035935195469670098, "phrase": "optimal_synthesis"}, {"score": 0.0033429441602425215, "phrase": "mr"}, {"score": 0.003278572293386625, "phrase": "shell_lng_fpso"}, {"score": 0.003255517260803843, "phrase": "onshore_projects"}, {"score": 0.003209890864238192, "phrase": "flex_lng_fpso"}, {"score": 0.003131573153805862, "phrase": "optimal_offshore_liquefaction_cycle"}, {"score": 0.0030390297012464276, "phrase": "optimal_operating_conditions"}, {"score": 0.0028772371549248576, "phrase": "preliminary_equipment_module_layout"}, {"score": 0.0028070129630205494, "phrase": "equipment_module_layout"}, {"score": 0.002753037986071429, "phrase": "topside_equipment"}, {"score": 0.0026622351303038885, "phrase": "deck_area"}, {"score": 0.002629539710839523, "phrase": "main_cryogenic_heat_exchanger"}, {"score": 0.002620271936894895, "phrase": "mche"}, {"score": 0.002480717837045988, "phrase": "deck_penetration"}, {"score": 0.0024676125442763823, "phrase": "long_equipment"}, {"score": 0.002386201288037713, "phrase": "mathematical_model"}, {"score": 0.002340298947450853, "phrase": "preliminary_optimal_equipment_module"}, {"score": 0.002263078481046141, "phrase": "mixed-integer_nonlinear_programming"}, {"score": 0.0022234626561893653, "phrase": "equipment_module_layouts"}, {"score": 0.0021653325897338285, "phrase": "actual_offshore_application"}, {"score": 0.002123669961937024, "phrase": "optimal_liquefaction_cycle"}, {"score": 0.0021161813355129646, "phrase": "lng_fpso."}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Optimal offshore liquefaction cycle", " Offshore application", " Efficiency", " Simplicity", " Equipment module layout", " LNG FPSO"], "paper_abstract": "In this paper, the offshore selection criteria for the optimal liquefaction process system are studied to contribute to the future FEED engineering for the liquefied natural gas (LNG) floating, production, storage, and offloading (LNG FPSO) liquefaction process system. From the foregoing, it is clear that offshore liquefaction plants have process requirements different from those of the traditional onshore liquefaction plants. While thermodynamic efficiency is the key technical process selection criterion for large onshore liquefaction plants, the high-efficiency pre-cooled mixed refrigerant and optimized cascade plants that dominate the onshore LNG installations are unlikely to meet the diverse technical and safety needs of offshore liquefaction facilities. Offshore liquefaction technology developers are rightly focusing on process simplicity, low weight, small footprint, and other criteria. The key criteria that influence process selection and plant optimization for the offshore liquefaction cycle lead to some trade-offs and compromises between efficiency and simplicity. In addition, other criteria for offshore liquefaction cycles should also be considered, such as flexibility, safety, vessel motion, refrigerant storage hazard, proven technology, simplicity of operation, ease of start-up/shutdown, and capital cost. First of all, this paper proposes a generic mixed refrigerant (MR) liquefaction cycle based on four configuration strategies. The 27 feasible MR liquefaction cycles from such generic MR liquefaction cycle are configured for optimal synthesis. From the 27 MR liquefaction cycles, the top 10 are selected based on the minimum amount of power required for the compressors. Then, one MR liquefaction cycle is selected based on simplicity among the 10 MR process cycles, and this is called a \"potential MR liquefaction cycle.\" Second, three additional offshore liquefaction cycles-DMR for SHELL LNG FPSO, C3MR for onshore projects, and the dual N-2 expander for FLEX LNG FPSO-are considered for comparison with the potential MR liquefaction cycle for the selection of the optimal offshore liquefaction cycle. Such four cycles are compared based on simplicity, efficiency, and other criteria. Therefore, the optimal operating conditions for each cycle with four LNG capacities (4.0, 3.0, 2.0, and 1.0 MTPA) are calculated with the minimum amount of power required for the compressors. Then the preliminary equipment module layout for the four cycles are designed as multi-deck instead of single-deck, and this equipment module layout should be optimized to reduce the area occupied by the topside equipment at the FEED stage. In this paper, the connectivity cost, the construction cost proportional to the deck area, and the distance of the main cryogenic heat exchanger (MCHE) and separators from the centerline of the hull are considered objective functions to be minimized. Moreover, the constraints are proposed to ensure the safety and considering the deck penetration of the long equipment across several decks. Considering the above, mathematical models were formulated for them. For example, the potential MR liquefaction cycle has a mathematical model consisting of 257 unknowns, 193 equality constraints, and 330 inequality constraints. The preliminary optimal equipment module layouts with four LNG capacities (4.0, 3.0, 2.0, and 1.0 MTPA) are then obtained using mixed-integer nonlinear programming (MINLP). Based on the above optimal operating conditions and equipment module layouts for the four potential offshore liquefaction cycles, trade-offs between simplicity and efficiency are performed for actual offshore application, and finally, the potential MR liquefaction cycle is selected for the optimal liquefaction cycle for LNG FPSO. Published by Elsevier Ltd.", "paper_title": "Optimal liquefaction process cycle considering simplicity and efficiency for LNG FPSO at FEED stage", "paper_id": "WOS:000333056600001"}