{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "interval_dissimilarities"}, {"score": 0.00476697427418509, "phrase": "multidimensional_scaling"}, {"score": 0.004466519142879166, "phrase": "low-dimensional_space"}, {"score": 0.003901407184706592, "phrase": "data_matrix"}, {"score": 0.003459191419478298, "phrase": "minimum_and_maximum_distance"}, {"score": 0.003066945490483524, "phrase": "new_algorithm"}, {"score": 0.002873331232538783, "phrase": "iterative_majorization"}, {"score": 0.0025473475682739784, "phrase": "rational_start_configuration"}, {"score": 0.0024348510123716424, "phrase": "good_quality_local_minima"}, {"score": 0.0023864566654035924, "phrase": "simulation_study"}, {"score": 0.0021262403223013242, "phrase": "empirical_example"}, {"score": 0.0021049977753042253, "phrase": "dissimilarity_intervals"}], "paper_keywords": ["multidimensional scaling", " interval-type data", " iterative majorization", " I-Scal"], "paper_abstract": "Multidimensional scaling aims at reconstructing dissimilarities between pairs of objects by distances in a low-dimensional space. However, in some cases the dissimilarity itself is unknown, but the range of the dissimilarity is given. Such fuzzy data give rise to a data matrix in which each dissimilarity is an interval of values. These interval dissimilarities are modelled by the ranges of the distances defined as the minimum and maximum distance between two rectangles representing the objects. Previously, two approaches for such data have been proposed and one of them is investigated. A new algorithm called I-Scal is developed. Because I-Scal is based on iterative majorization it has the advantage that each iteration is guaranteed to improve the solution until no improvement is possible. In addition, a rational start configuration is proposed that is helpful in locating a good quality local minima. In a simulation study, the quality of this algorithm is investigated and I-Scal is compared with one previously proposed algorithm. Finally, I-Scal is applied on an empirical example of dissimilarity intervals of sounds. (C) 2006 Elsevier B.V. All rights reserved.", "paper_title": "I-Scal: Multidimensional scaling of interval dissimilarities", "paper_id": "WOS:000242517500021"}