{"auto_keywords": [{"score": 0.05007843022623739, "phrase": "extrinsic_information_transfer"}, {"score": 0.048922919536139184, "phrase": "iterative_decoding_convergence"}, {"score": 0.04846783288125709, "phrase": "fully_parallel_turbo_decoders"}, {"score": 0.040741328511132734, "phrase": "conventional_log-bcjr_turbo_decoders"}, {"score": 0.04016938422382131, "phrase": "fptd"}, {"score": 0.02747511219208397, "phrase": "proposed_technique"}, {"score": 0.004387793971765289, "phrase": "more-than-sixfold_processing_throughput"}, {"score": 0.004057495982111461, "phrase": "time_periods"}, {"score": 0.003770373393393271, "phrase": "decoding_iteration"}, {"score": 0.0033524956061690868, "phrase": "increased_iteration_requirement"}, {"score": 0.0030546824405297233, "phrase": "fptd."}, {"score": 0.0029086869572567072, "phrase": "novel_exit_chart_technique"}, {"score": 0.002852256089630964, "phrase": "iterative_exchange"}, {"score": 0.0026762874092443197, "phrase": "extrinsic_state_metrics"}, {"score": 0.002498873893632726, "phrase": "decoding_iterations"}, {"score": 0.002379379676378223, "phrase": "monte_carlo_simulation"}, {"score": 0.002321787726770895, "phrase": "new_insights"}, {"score": 0.0022107428653358715, "phrase": "improved_designs"}, {"score": 0.0021049977753042253, "phrase": "conventional_exit_charts"}], "paper_keywords": ["Fully-parallel decoding", " turbo code", " EXIT chart"], "paper_abstract": "Fully parallel turbo decoders (FPTCDs) have been shown to offer a more-than-sixfold processing throughput and latency improvement over the conventional logarithmic Bahl-Cocke-Jelinek-Raviv (Log-BCJR) turbo decoders. Rather than requiring hundreds or even thousands of time periods to decode each frame, such as the conventional Log-BCJR turbo decoders, the FPTD completes each decoding iteration using only one or two time periods, although up to six times as many decoding iterations are required to achieve the same error correction performance. Until now, it has not been possible to explain this increased iteration requirement using an extrinsic information transfer (EXIT) chart analysis, since the two component decoders are not alternately operated in the FPTD. Hence, in this paper, we propose a novel EXIT chart technique for characterizing the iterative exchange of not only extrinsic logarithmic likelihood ratios in the FPTD, but also the iterative exchange of extrinsic state metrics. In this way, the proposed technique can accurately predict the number of decoding iterations required for achieving iterative decoding convergence, as confirmed by the Monte Carlo simulation. The proposed technique offers new insights into the operation of FPTDs, which will facilitate improved designs in the future, in the same way as the conventional EXIT charts have enhanced the design and understanding of the conventional Log-BCJR turbo decoders.", "paper_title": "Extrinsic Information Transfer Charts for Characterizing the Iterative Decoding Convergence of Fully Parallel Turbo Decoders", "paper_id": "WOS:000371388200160"}