{"auto_keywords": [{"score": 0.04624649744576373, "phrase": "government_agency"}, {"score": 0.01051526025382789, "phrase": "risk_information_disclosure"}, {"score": 0.010450998217627872, "phrase": "government_agencies"}, {"score": 0.010229126277506523, "phrase": "guardian_agent"}, {"score": 0.007152368807539886, "phrase": "game_theory"}, {"score": 0.004683195250422422, "phrase": "public-the_role"}, {"score": 0.004471584421274654, "phrase": "japan"}, {"score": 0.004152502093643003, "phrase": "risk_information"}, {"score": 0.003971057113936217, "phrase": "pareto"}, {"score": 0.0038561471948364723, "phrase": "sufficient_information"}, {"score": 0.0037914082086552884, "phrase": "information_gap"}, {"score": 0.0035808664384880213, "phrase": "public_payoff_structure"}, {"score": 0.003558830226733501, "phrase": "march_and_simon's_theory"}, {"score": 0.0034613276345111573, "phrase": "payoff_structures"}, {"score": 0.003408315158645728, "phrase": "tversky"}, {"score": 0.0033873366086549735, "phrase": "kahneman's_cumulative_prospect_theory"}, {"score": 0.0030403706811144, "phrase": "nondisclosure_game"}, {"score": 0.0028759679188458532, "phrase": "binding_forces"}, {"score": 0.002728847267539957, "phrase": "information_searching_games"}, {"score": 0.0023893635026860727, "phrase": "risk_information_gap_increases"}, {"score": 0.002157697367447098, "phrase": "related_fields"}, {"score": 0.0021049977753042253, "phrase": "nonprofit_organizations"}], "paper_keywords": ["Cumulative prospect theory", " facilitators", " risk information disclosure", " satisficing decision making"], "paper_abstract": "Risk information disclosure by government agencies has recently been in the news in Japan. A government agency often has an incentive not to disclose such information. Moreover, there generally is a gap between the amount of risk information held by the government agency and the amount held by the public. A method is needed that will help the public to obtain sufficient information for making decisions. We model the interactions between a government agency and the public as games of risk information disclosure using game theory, interpret the public payoff structure using March and Simon's theory of satisticing decision making, and interpret the payoff structures of a government agency using Tversky and Kahneman's cumulative prospect theory. We classify the interactions between a government agency and the public into four games: a voluntary disclosure game, an assurance game, an information searching game, and a nondisclosure game. The nondisclosure game does not have a Pareto optimum in our formulation. However, for discussion, we consider that binding forces imposed by the administration of justice might compel government agencies to disclose. In the assurance and information searching games, the equilibrium is not the Pareto optimum but a second best. We propose using a guardian agent to reduce the information gap between a government agency and the public. We find that, as the power of the guardian agent to reduce the risk information gap increases, the possibility of approaching the Pareto optimum also increases. Therefore, the information gap between a government agency and the public would be greatly reduced with explanations and support from experts in related fields, such as facilitators and experts in nonprofit organizations.", "paper_title": "Using Game Theory to Investigate Risk Information Disclosure by Government Agencies and Satisfying the Public-The Role of the Guardian Agent", "paper_id": "WOS:000263639100004"}