{"auto_keywords": [{"score": 0.013771581997452308, "phrase": "lower_bounds"}, {"score": 0.00450368324850566, "phrase": "quadratic_assignment_problem"}, {"score": 0.004449289453914746, "phrase": "qap"}, {"score": 0.004136333933790974, "phrase": "essentially_new_algorithm"}, {"score": 0.0033637374697995616, "phrase": "nugent_problem"}, {"score": 0.0030147970456037274, "phrase": "optimal_value"}, {"score": 0.0029244418026475832, "phrase": "problem_sizes"}, {"score": 0.0027184540871935284, "phrase": "large_amount"}, {"score": 0.002392188222609101, "phrase": "numerous_problem_symmetries"}, {"score": 0.002306361927090775, "phrase": "qap."}, {"score": 0.0022101055924375725, "phrase": "branch-and-bound_algorithm"}, {"score": 0.0021438155673297377, "phrase": "significant_runtime_improvement"}], "paper_keywords": ["quadratic assignment", " QAP", " reformulation linearization", " RLT", " dual ascent", " exact solution"], "paper_abstract": "We apply the level-3 reformulation-linearization technique (RLT3) to the quadratic assignment problem (QAP). We then present our experience in calculating lower bounds using an essentially new algorithm based on this RLT3 formulation. Our method is not guaranteed to calculate the RLT3 lower bound exactly, but it approximates this lower bound very closely and reaches it in some instances. For Nugent problem instances up to size 24, our RLT3-based lower bound calculation solves these problem instances exactly or serves to verify the optimal value. Calculating lower bounds for problem sizes larger than size 27 still presents a challenge because of the large amount of memory needed to implement the RLT3 formulation. Our presentation emphasizes the steps taken to significantly conserve memory by using the numerous problem symmetries in the RLT3 formulation of the QAP. We implemented this RLT3-based bound calculation in a branch-and-bound algorithm. Experimental results project significant runtime improvement over all other published QAP branch-and-bound solvers.", "paper_title": "A Level-3 Reformulation-Linearization Technique-Based Bound for the Quadratic Assignment Problem", "paper_id": "WOS:000303924600002"}