{"auto_keywords": [{"score": 0.04872267695171359, "phrase": "non-deterministic_automata"}, {"score": 0.010547817102681467, "phrase": "labelled_transition_systems"}, {"score": 0.00481495049065317, "phrase": "final_non-deterministic_automaton"}, {"score": 0.00446506039438222, "phrase": "different_states"}, {"score": 0.004354149483556514, "phrase": "different_branches"}, {"score": 0.004052148727852149, "phrase": "different_decisions"}, {"score": 0.0037038224217016817, "phrase": "possible_future_behaviour"}, {"score": 0.0031164983132321417, "phrase": "deterministic_automata"}, {"score": 0.002931569771634119, "phrase": "non-deterministic_automaton"}, {"score": 0.0027575842698911173, "phrase": "final_object"}, {"score": 0.002197966048531954, "phrase": "natural_objects"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Non-deterministic automaton", " Formal language", " Coalgebra", " Bisimilarity", " Final automaton"], "paper_abstract": "The study of the behaviour of non-deterministic automata has traditionally focused on the languages which can be associated to the different states. Under this interpretation, the different branches that can be taken at every step are ignored. However, we can also take into account the different decisions which can be made at every state, that is, the branches that can be taken, and these decisions might change the possible future behaviour. In this case, the behaviour of the automata can be described with the help of the concept of bisimilarity. This is the kind of description that is usually obtained when the automata are regarded as labelled transition systems or coalgebras. Contrarily to what happens with deterministic automata, it is not possible to describe the behaviour up to bisimilarity of states of a non-deterministic automaton by considering just the languages associated to them. In this paper we present a description of a final object for the category of non-deterministic automata, regarded as labelled transition systems, with the help of some structures defined in terms of languages. As a consequence, we obtain a characterisation of bisimilarity of states of automata in terms of languages and a method to minimise non-deterministic automata with respect to bisimilarity of states. This confirms that languages can be considered as the natural objects to describe the behaviour of automata. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "A description based on languages of the final non-deterministic automaton", "paper_id": "WOS:000336694000001"}