{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "memory_order_parameters"}, {"score": 0.014372410216360878, "phrase": "data_structures"}, {"score": 0.013287306187954212, "phrase": "weak_memory_model"}, {"score": 0.012775470478648587, "phrase": "sc_memory_model"}, {"score": 0.004348580182733617, "phrase": "real-world_systems"}, {"score": 0.004299621153829837, "phrase": "weaker_memory_models"}, {"score": 0.004227209809791869, "phrase": "sufficient_fences"}, {"score": 0.003467040410632942, "phrase": "weak_memory_models"}, {"score": 0.0032026066791743866, "phrase": "porting_data_structures"}, {"score": 0.0030433302702291116, "phrase": "automo"}, {"score": 0.002958281631770322, "phrase": "porting_process"}, {"score": 0.0028271058251633815, "phrase": "initial_settings"}, {"score": 0.0025673005153462707, "phrase": "sc_execution"}], "paper_keywords": ["Relaxed Memory Model", " Sequential Consistency"], "paper_abstract": "Many concurrent data structures are initially designed for the sequential consistency (SC) memory model. Developers often implement these data structures on real-world systems with weaker memory models by adding sufficient fences to ensure that their implementation on the weak memory model exhibits the same executions as on the SC memory model. Recently, the C11 and C++11 standards have added a weak memory model to the C and C++ languages. Developing and debugging code for weak memory models can be extremely challenging. We present AutoMO, a framework to support porting data structures designed for the SC memory model to the C/C++11 memory model. AutoMO provides support across the porting process: (1) it automatically infers initial settings for the memory order parameters, (2) it detects whether a C/C++11 execution is equivalent to some SC execution, and (3) it simplifies traces to make them easier to understand. We have used AutoMO to successfully infer memory order parameters for a range of data structures and to check whether executions of several concurrent data structure implementations are SC.", "paper_title": "AutoMO: Automatic Inference of Memory Order Parameters for C/C++11", "paper_id": "WOS:000367256500013"}