{"auto_keywords": [{"score": 0.035396329010121505, "phrase": "secure_communication_channel"}, {"score": 0.00481495049065317, "phrase": "sealed_bottle"}, {"score": 0.0046848707075530256, "phrase": "mobile_social_networks"}, {"score": 0.004237138632255772, "phrase": "matched_profile"}, {"score": 0.004122604238556912, "phrase": "challenging_task"}, {"score": 0.003920573616298175, "phrase": "participants'_profiles"}, {"score": 0.0037454814403672697, "phrase": "novel_mechanisms"}, {"score": 0.003465521267039616, "phrase": "decentralized_mobile_social_networks"}, {"score": 0.003177235604998673, "phrase": "matching_user"}, {"score": 0.0029666322924554274, "phrase": "based_search"}, {"score": 0.0022857351723674004, "phrase": "extensive_evaluations"}, {"score": 0.0022649119108225564, "phrase": "real_social_network_data"}, {"score": 0.002193509835371438, "phrase": "smart_phones"}, {"score": 0.0021049977753042253, "phrase": "existing_solutions"}], "paper_keywords": ["Privacy preserving profile matching", " secure communication", " decentralized mobile social networks"], "paper_abstract": "Many proximity-based mobile social networks are developed to facilitate connections between any two people, or to help a user to find people with a matched profile within a certain distance. A challenging task in these applications is to protect the privacy of the participants' profiles and communications. In this paper, we design novel mechanisms, when given a preference-profile submitted by a user, that search persons with matching-profile in decentralized mobile social networks. Meanwhile, our mechanisms establish a secure communication channel between the initiator and matching users at the time when a matching user is found. These techniques can also be applied to conduct privacy preserving keywords based search without any secure communication channel. Our analysis shows that our mechanism is privacy-preserving (no participants' profile and the submitted preference-profile are exposed), verifiable (both the initiator and any unmatched user cannot cheat each other to pretend to be matched), and efficient in both communication and computation. Extensive evaluations using real social network data, and actual system implementation on smart phones show that our mechanisms are significantly more efficient than existing solutions.", "paper_title": "Message in a Sealed Bottle: Privacy Preserving Friending in Mobile Social Networks", "paper_id": "WOS:000359264300010"}