{"auto_keywords": [{"score": 0.04841586458101805, "phrase": "trajectory_tracking"}, {"score": 0.03014720888291599, "phrase": "proportional_gain"}, {"score": 0.00481495049065317, "phrase": "low-force_robotic_guidance"}, {"score": 0.004311352359122141, "phrase": "low-force_robotic_manipulator"}, {"score": 0.004235793609579307, "phrase": "human_user's_movements"}, {"score": 0.0040886093072615, "phrase": "user's_hand"}, {"score": 0.004016938499717623, "phrase": "predetermined_position"}, {"score": 0.003911771812701971, "phrase": "predetermined_trajectory"}, {"score": 0.0036124465071873998, "phrase": "human-machine_coordination"}, {"score": 0.0035648266669315943, "phrase": "manufacturing_industry"}, {"score": 0.00342568771304873, "phrase": "position_control"}, {"score": 0.003121719509312159, "phrase": "human_performance"}, {"score": 0.002986575805559931, "phrase": "robot's_position_control"}, {"score": 0.002512990657100351, "phrase": "ordinary_pd_position_control"}, {"score": 0.0024688710065898646, "phrase": "direct_high-gain_velocity_feedback"}, {"score": 0.002341094670523097, "phrase": "mode_control"}], "paper_keywords": ["guidance", " human-machine coordination", " proxy-based sliding mode control (PSMC)", " time constant"], "paper_abstract": "This paper considers the application of a low-force robotic manipulator to guide a human user's movements to place a tool (or the user's hand) at a predetermined position or move it along a predetermined trajectory. This application is potentially useful, e.g., skill training for humans, rehabilitation, and human-machine coordination in the manufacturing industry. A proportional-derivative. (PD)-type position control can be used for this application, but the parameters for the controller should be appropriately chosen for enhancing the human performance of positioning and trajectory tracking. We hypothesize that the robot's position control should be stiff and appropriately slow, i.e., the proportional gain should be high and the time constant (the ratio of the derivative gain to the proportional gain) should be appropriately large. Such characteristic has been difficult to be realized in ordinary PD position control because it requires direct high-gain velocity feedback. However, our recent technique, which is proxy-based sliding mode control (PSMC), is capable of producing such a hypothetically preferred response and allows us to empirically validate the hypothesis. The results of experiments using two distinctly different robotic devices supported the hypothesis, showing that the time constant should be set around 0.1 s rather than 0.01 and 0.5 s.", "paper_title": "A guideline for low-force robotic guidance for enhancing human performance of positioning and trajectory tracking: It should be stiff and appropriately slow", "paper_id": "WOS:000257020200016"}