{"auto_keywords": [{"score": 0.0386839915232402, "phrase": "information_overload"}, {"score": 0.03838966001402311, "phrase": "information_poverty"}, {"score": 0.009039818254968426, "phrase": "healthcare_services_managers"}, {"score": 0.00481495049065317, "phrase": "healthcare_services"}, {"score": 0.004573748810476845, "phrase": "managers'_decision-making_practices"}, {"score": 0.00450198136261303, "phrase": "inappropriate_information_quality"}, {"score": 0.004110549138321181, "phrase": "critical_incident_technique"}, {"score": 0.004046020290832207, "phrase": "structured_interviews"}, {"score": 0.003966776222128288, "phrase": "using_framework_analysis"}, {"score": 0.0037087324991876727, "phrase": "research_literature"}, {"score": 0.0034264854489231148, "phrase": "search_process"}, {"score": 0.003372658906684677, "phrase": "good_enough_decision"}, {"score": 0.003306559295382181, "phrase": "information_gaps"}, {"score": 0.002971309306027602, "phrase": "information_behavior_research"}, {"score": 0.002669959049383929, "phrase": "initial_findings"}, {"score": 0.0025159206854716274, "phrase": "existing_definitions"}, {"score": 0.0023896108055582615, "phrase": "managers'_experiences"}, {"score": 0.0022876877275935757, "phrase": "information_behavior"}, {"score": 0.00212175050242788, "phrase": "new_research_findings"}, {"score": 0.0021049977753042253, "phrase": "existing_frameworks"}], "paper_keywords": ["Health services", " Managers", " Information management"], "paper_abstract": "Purpose The purpose of this paper is to gain insight into managers' decision-making practices when challenged by inappropriate information quality, and to test frameworks developed from research to see whether they apply to these managers. Design/methodology/approach This exploratory, multiple case study used the critical incident technique in 19 semi-structured interviews. Responses were analyzed using framework analysis, a matrix-based content analysis technique. and then considered with respect to the research literature on information overload, information poverty and satisficing. Findings The managers in this study tended to satisfice (terminate the search process and make a good enough decision, while recognizing that information gaps remain). Those challenged by too little information appear to fit descriptions of information poverty, while others described aspects of information overload. Research limitations/implications A shortage of information behavior research on managers makes it difficult to conclude whether these results are typical of managers in general or of healthcare services managers specifically. Further research is needed to confirm initial findings and address questions suggested by this paper. Practical implications This paper suggests that existing definitions for the concepts of information poverty and information overload can be used to describe managers' experiences. Originality/value This paper contributes to what is known about information behavior in managers in general and healthcare services managers specifically. It may serve as an example of how to consider new research findings within existing frameworks.", "paper_title": "Information overload and information poverty: challenges for healthcare services managers?", "paper_id": "WOS:000289019500003"}