{"auto_keywords": [{"score": 0.04653621931999408, "phrase": "design_models"}, {"score": 0.008713768692145006, "phrase": "software_design_models"}, {"score": 0.008313473580428627, "phrase": "uml"}, {"score": 0.004786620949516712, "phrase": "software_development_practice"}, {"score": 0.004744437370338926, "phrase": "empirical_investigation"}, {"score": 0.004142084961822865, "phrase": "de_facto_standard"}, {"score": 0.004021571540928605, "phrase": "profound_and_substantial_effect"}, {"score": 0.0036052633308076933, "phrase": "significant_use"}, {"score": 0.0033684179374769605, "phrase": "simple_question"}, {"score": 0.003165739628969694, "phrase": "total_years"}, {"score": 0.00314708280192844, "phrase": "programming_experience"}, {"score": 0.003010606455208659, "phrase": "programming_language"}, {"score": 0.0026986685585382347, "phrase": "tool_support"}, {"score": 0.0026355830536850698, "phrase": "uml."}, {"score": 0.0025286975935774245, "phrase": "higher_level"}, {"score": 0.0024118292918742967, "phrase": "collaboration_mechanism"}, {"score": 0.0023277282036119106, "phrase": "joint_understanding"}, {"score": 0.002307164141953476, "phrase": "overall_design"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Software design models", " Empirical industrial survey", " Model-driven engineering (MOD, MDE, UML)"], "paper_abstract": "Research into software design models in general, and into the UML in particular, focuses on answering the question how design models are used, completely ignoring the question if they are used. There is an assumption in the literature that the UML is the de facto standard, and that use of design models has had a profound and substantial effect on how software is designed by virtue of models giving the ability to do model-checking, code generation, or automated test generation. However for this assumption to be true, there has to be significant use of design models in practice by developers. This paper presents the results of a survey summarizing the answers of 3785 developers answering the simple question on the extent to which design models are used before coding. We relate their use of models with (i) total years of programming experience, (ii) open or closed development, (iii) educational level, (iv) programming language used, and (v) development type. The answer to our question was that design models are not used very extensively in industry, and where they are used, the use is informal and without tool support, and the notation is often not UML. The use of models decreased with an increase in experience and increased with higher level of qualification. Overall we found that models are used primarily as a communication and collaboration mechanism where there is a need to solve problems and/or get a joint understanding of the overall design in a group. We also conclude that models are seldom updated after initially created and are usually drawn on a whiteboard or on paper. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "On the use of software design models in software development practice: An empirical investigation", "paper_id": "WOS:000341338500012"}