{"auto_keywords": [{"score": 0.042950137079565714, "phrase": "simplicial_map"}, {"score": 0.015506366816188373, "phrase": "mesh_processing"}, {"score": 0.015212457994529993, "phrase": "sufficient_conditions"}, {"score": 0.014842622828013768, "phrase": "necessary_condition"}, {"score": 0.011192417651126288, "phrase": "second_set"}, {"score": 0.010594279032882136, "phrase": "bijective_boundary_map"}, {"score": 0.00949128537293011, "phrase": "boundary_map"}, {"score": 0.004817808704900682, "phrase": "boundary"}, {"score": 0.004619455453039897, "phrase": "bijective_simplicial_mappings"}, {"score": 0.004505971974071316, "phrase": "simplicial_mapping"}, {"score": 0.004023120753104693, "phrase": "additional_simple_conditions"}, {"score": 0.003956921134443817, "phrase": "above-mentioned_necessary_condition"}, {"score": 0.003859650639671721, "phrase": "first_set"}, {"score": 0.0038171874077517274, "phrase": "classical_global_inversion_theorems"}, {"score": 0.003591824245643109, "phrase": "boundary_simplicial_map"}, {"score": 0.00344581822729766, "phrase": "target_domain"}, {"score": 0.003188916332246111, "phrase": "linear_constraints"}, {"score": 0.003145092588898089, "phrase": "resulting_map"}, {"score": 0.0030339402484249635, "phrase": "linear_conditions"}, {"score": 0.0030088510089519367, "phrase": "practical_tool"}, {"score": 0.0028389242954210254, "phrase": "injectivity_property"}, {"score": 0.002746155563830053, "phrase": "boundary_conditions"}, {"score": 0.0026564101996895584, "phrase": "hard_task"}, {"score": 0.0024924939430158426, "phrase": "lower_energy_levels"}, {"score": 0.0024718711048717676, "phrase": "third_set"}, {"score": 0.0023976997077055193, "phrase": "boundary_maps"}, {"score": 0.0023386685733717038, "phrase": "proper_definition"}, {"score": 0.002325748721456355, "phrase": "boundary_map_orientation"}, {"score": 0.0021049977753042253, "phrase": "secondary_goal"}], "paper_keywords": ["meshes", " simplicial maps", " injectivity"], "paper_abstract": "This paper introduces three sets of sufficient conditions for generating bijective simplicial mappings of manifold meshes. A necessary condition for a simplicial mapping of a mesh to be injective is that it either maintains the orientation of all elements or flips all the elements. However, this condition is known to be insufficient for injectivity of a simplicial map. In this paper we provide additional simple conditions that, together with the above-mentioned necessary condition, guarantee injectivity of the simplicial map. The first set of conditions generalizes classical global inversion theorems to the mesh (piecewise-linear) case. That is, it proves that in the case where the boundary simplicial map is bijective and the necessary condition holds, the map is injective and onto the target domain. The second set of conditions is concerned with mapping of a mesh to a polytope. It replaces the (often hard) requirement of a bijective boundary map with a collection of linear constraints and guarantees that the resulting map is injective over the interior of the mesh and onto. These linear conditions provide a practical tool for optimizing a map of the mesh onto a given polytope while allowing the boundary map to adjust freely and keeping the injectivity property in the interior of the mesh. Allowing more freedom in the boundary conditions is useful for two reasons: (a) it circumvents the hard task of providing a bijective boundary map, and (b) it allows one to optimize the boundary map together with the simplicial map to achieve lower energy levels. The third set of conditions adds to the second set the requirement that the boundary maps be orientation preserving as well (with a proper definition of boundary map orientation). This set of conditions guarantees that the map is injective on the boundary of the mesh as well as its interior. Several experiments using the sufficient conditions are shown for mapping triangular meshes. A secondary goal of this paper is to advocate and develop the tool of degree in the context of mesh processing.", "paper_title": "Bijective Mappings of Meshes with Boundary and the Degree in Mesh Processing", "paper_id": "WOS:000338782900023"}