{"auto_keywords": [{"score": 0.04128428319076698, "phrase": "total_number"}, {"score": 0.037246968614279, "phrase": "cost_polynomial"}, {"score": 0.00481495049065317, "phrase": "asynchronously_at_polynomial_cost."}, {"score": 0.004730158389701481, "phrase": "different_nodes"}, {"score": 0.004688321299229397, "phrase": "unknown_network"}, {"score": 0.004431774680887588, "phrase": "different_label"}, {"score": 0.004379572106088617, "phrase": "positive_integer"}, {"score": 0.004201637890307767, "phrase": "asynchronous_way"}, {"score": 0.003971616493886099, "phrase": "rendezvous_algorithm"}, {"score": 0.0039131980069391495, "phrase": "edge_traversals"}, {"score": 0.0036444868761853293, "phrase": "larger_label"}, {"score": 0.0035590664550919854, "phrase": "deterministic_rendezvous_algorithm"}, {"score": 0.003404244237372396, "phrase": "smaller_label"}, {"score": 0.0030685999966886734, "phrase": "unknown_size"}, {"score": 0.0030234236561882443, "phrase": "labeled_agents"}, {"score": 0.0029877604856619806, "phrase": "unknown_networks"}, {"score": 0.0026771333996253783, "phrase": "single_agent"}, {"score": 0.00258347644721642, "phrase": "new_and_different_labels"}, {"score": 0.00213648030003747, "phrase": "smallest_length"}, {"score": 0.0021049977753042253, "phrase": "participating_agents"}], "paper_keywords": ["asynchronous mobile agents", " network", " rendezvous", " deterministic algorithm", " leader election", " renaming", " gossiping"], "paper_abstract": "Two mobile agents starting at different nodes of an unknown network have to meet. This task is known in the literature as rendezvous. Each agent has a different label which is a positive integer known to it but unknown to the other agent. Agents move in an asynchronous way: the speed of agents may vary and is controlled by an adversary. The cost of a rendezvous algorithm is the total number of edge traversals by both agents until their meeting. The only previous deterministic algorithm solving this problem has cost exponential in the size of the graph and in the larger label. In this paper we present a deterministic rendezvous algorithm with cost polynomial in the size of the graph and in the length of the smaller label. Hence, we decrease the cost exponentially in the size of the graph and doubly exponentially in the labels of agents. As an application of our rendezvous algorithm we solve several fundamental problems involving teams of unknown size larger than 1 of labeled agents moving asynchronously in unknown networks. Among them are the following problems: team size, in which every agent has to find the total number of agents; leader election, in which all agents have to output the label of a single agent; perfect renaming, in which all agents have to adopt new and different labels from the set {1, ... , k}, where k is the number of agents; and gossiping, in which each agent has initially a piece of information (value) and all agents have to output all the values. Using our rendezvous algorithm, we solve all of these problems at cost polynomial in the size of the graph and in the smallest length of all labels of participating agents.", "paper_title": "HOW TO MEET ASYNCHRONOUSLY AT POLYNOMIAL COST", "paper_id": "WOS:000357414100009"}