{"auto_keywords": [{"score": 0.04954756810706401, "phrase": "arrangement_design"}, {"score": 0.011622240346077868, "phrase": "experts'_experiences"}, {"score": 0.007740489563401459, "phrase": "arrangement_evaluation_model"}, {"score": 0.0052989626625537575, "phrase": "expert_system"}, {"score": 0.004448722990186068, "phrase": "arrangement_template_model"}, {"score": 0.004098836972354646, "phrase": "proposed_expert_system"}, {"score": 0.004072275820209647, "phrase": "limited_space"}, {"score": 0.003418186564522323, "phrase": "design_rules"}, {"score": 0.0033801845720347118, "phrase": "systematic_structure"}, {"score": 0.0028903278985330117, "phrase": "design_alternatives"}, {"score": 0.0025178072071268534, "phrase": "prototype_program"}, {"score": 0.002480520548392772, "phrase": "arrangement_evaluation_module"}, {"score": 0.002319431279824863, "phrase": "small_submarine"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Arrangement design", " Submarine", " Expert system", " Arrangement evaluation model", " Arrangement template model"], "paper_abstract": "The arrangement design of a submarine depends on the past design data and experts' experiences. Delay in design can occur due to data missing or the absence of experts. In addition, various compartments and equipment are placed on the limited space called pressure hull in the submarine, so that the relation between the compartments and equipment should be considered carefully when designing the arrangement of the submarine. In this sense, there is a need to accumulate data regarding the past design data, experts' experiences, and design rules as a systematic structure. To meet such a demand, an expert system for the arrangement design of a submarine was proposed based on an arrangement evaluation model (AEM) in this study. The expert system can systematically computerize experts' experiences and knowledge, and can evaluate the feasibility of design alternatives for the arrangement design of the submarine. In addition, an arrangement template model (ATM) was proposed to store various information on the arrangement design of the submarine. To evaluate the applicability of the proposed expert system, a prototype program consisting of an arrangement evaluation module and the arrangement template model was developed. Finally, this program was applied to a problem of a small submarine. The results showed that the proposed expert system can be used to evaluate the given design alternatives for the arrangement design of the submarine. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "Expert system based on the arrangement evaluation model for the arrangement design of a submarine", "paper_id": "WOS:000361923100030"}