{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "communication_complexity"}, {"score": 0.006142059847275933, "phrase": "right-hand_side"}, {"score": 0.004632054874749458, "phrase": "combinatorial_property"}, {"score": 0.004510185874034892, "phrase": "mehlhorn"}, {"score": 0.004509781419498712, "phrase": "low_rank"}, {"score": 0.004483502266195668, "phrase": "schmidt"}, {"score": 0.003921926812074958, "phrase": "left-hand_side"}, {"score": 0.0037619540348087493, "phrase": "two-element_field"}, {"score": 0.0037393029173430287, "phrase": "pfr_conjecture"}, {"score": 0.0035551969986263553, "phrase": "\"communication_complexity"}, {"score": 0.0033597650090676032, "phrase": "additional_natural_combinatorial_property-high_discrepancy"}, {"score": 0.0031561961485589633, "phrase": "polynomial_freiman-ruzsa"}, {"score": 0.0031003255054939524, "phrase": "additive_combinatorics"}, {"score": 0.0029124302021905366, "phrase": "matrix_m"}, {"score": 0.0025623833599211212, "phrase": "lovett"}, {"score": 0.0024577274522206436, "phrase": "\"approximate_duality_conjecture"}, {"score": 0.002414191657515897, "phrase": "ben-sasson"}, {"score": 0.0022610379771517966, "phrase": "approximate_duality"}, {"score": 0.0021946656099592608, "phrase": "approximate_duality_conjecture"}, {"score": 0.0021751356291518716, "phrase": "improved_bounds"}, {"score": 0.0021049977753042253, "phrase": "low-rank_matrices"}], "paper_keywords": ["Algorithms", " Communication complexity", " log-rank conjecture", " additive combinatorics", " polynomial Freiman-Ruzsa conjecture", " approximate duality", " low-rank matrices"], "paper_abstract": "Identifying complexity measures that bound the communication complexity of a {0, 1}-valued matrix M is one the most fundamental problems in communication complexity. Mehlhorn and Schmidt [1982] were the first to suggest matrix-rank as one such measure. Among other things, they showed log rank(F)(M) <= CC(M) <= rank(F2) (M), where CC(M) denotes the (deterministic) communication complexity of the function associated with M, and the rank on the left-hand side is over any field F and on the right-hand side it is over the two-element field F-2. For certain matrices M, communication complexity equals the right-hand side, and this completely settles the question of \"communication complexity vs. F-2-rank\". Here we reopen this question by pointing out that, when M has an additional natural combinatorial property-high discrepancy with respect to distributions which are uniform over submatrices-then communication complexity can be sublinear in F-2-rank. Assuming the Polynomial Freiman-Ruzsa (PFR) conjecture in additive combinatorics, we show that CC(M) <= O(rank(F2) (M)/log rank(F2) (M)) for any matrix M which satisfies this combinatorial property. We also observe that if M has low rank over the reals, then it has low rank over F-2 and it additionally satisfies this combinatorial property. As a corollary, our results also give the first (conditional) sublinear bound on communication complexity in terms of rank over the reals, a result improved later by Lovett [2014]. Our proof is based on the study of the \"approximate duality conjecture\" which was suggested by Ben-Sasson and Zewi [2011] and studied there in connection to the PFR conjecture. First, we improve the bounds on approximate duality assuming the PFR conjecture. Then, we use the approximate duality conjecture (with improved bounds) to get our upper bound on the communication complexity of low-rank matrices.", "paper_title": "An Additive Combinatorics Approach Relating Rank to Communication Complexity", "paper_id": "WOS:000340342000003"}