{"auto_keywords": [{"score": 0.036115158017236984, "phrase": "nom_approach"}, {"score": 0.029085960559848103, "phrase": "empr"}, {"score": 0.00481495049065317, "phrase": "extended_multidimensional_pattern_relation"}, {"score": 0.004567596860086148, "phrase": "previously_mining_information"}, {"score": 0.004487989502479992, "phrase": "inserted_block"}, {"score": 0.003633927813203731, "phrase": "appropriate_data_structures"}, {"score": 0.0035705347414368696, "phrase": "efficient_algorithms"}, {"score": 0.003367077034382727, "phrase": "lattice_data_structure"}, {"score": 0.003212663446866794, "phrase": "candidate_itemsets"}, {"score": 0.0025854347094662247, "phrase": "hashing_technique"}, {"score": 0.0021805201234139475, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "improved_nom_approaches"}], "paper_keywords": [""], "paper_abstract": "In the past, we proposed an extended multidimensional pattern relation (EMPR) to structurally and systematically store previously mining information for each inserted block of data, and designed a negative-border online mining (NOM) approach to provide ad-hoc, query-driven and online mining supports. In this paper, we try to use appropriate data structures and design efficient algorithms to improve the performance of the NOM approach. The lattice data structure is utilized to organize and maintain all candidate itemsets such that the candidate itemsets with the same proper subsets can be considered at the same time. The derived lattice-based NOM (LNOM) approach will require only one scan of the itemsets stored in EMPR, thus saving much computation time. In addition, a hashing technique is used to further improve the performance of the NOM approach since many itemsets stored in EMPR may be useless for calculating the counts of candidates. At last, experimental results show the effect of the improved NOM approaches.", "paper_title": "Improved negative-border online mining approaches", "paper_id": "WOS:000237249600056"}