{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "comprehensive_view"}, {"score": 0.031115252691840616, "phrase": "data_mining"}, {"score": 0.004776484866276242, "phrase": "web_mining"}, {"score": 0.0044795698035664695, "phrase": "major_problems"}, {"score": 0.00444377150105556, "phrase": "data_collections"}, {"score": 0.0041842092128678105, "phrase": "web_usage"}, {"score": 0.004035777314816881, "phrase": "social_networking"}, {"score": 0.0038925903520043623, "phrase": "relational_information"}, {"score": 0.003739421738326676, "phrase": "data_mining_community"}, {"score": 0.0034926916198124484, "phrase": "privacy-preserving_data_mining"}, {"score": 0.0031590250068577867, "phrase": "privacy_problems"}, {"score": 0.0029982770062678926, "phrase": "underlying_notions"}, {"score": 0.0025224615049571427, "phrase": "whole_cycle"}, {"score": 0.002502264043067568, "phrase": "knowledge_discovery"}, {"score": 0.0024524733595572084, "phrase": "alternative_view"}, {"score": 0.0023463854193479274, "phrase": "privacy_challenges"}, {"score": 0.002244876254113051, "phrase": "knowledge_discovery_cycle"}], "paper_keywords": ["Web mining", " Privacy", " Knowledge discovery cycle", " Web usage (mining)", " Social network analysis"], "paper_abstract": "Over the last decade, privacy has been widely recognised as one of the major problems of data collections in general and the Web in particular. This concerns specifically data arising from Web usage (such as querying or transacting) and social networking (characterised by rich self-profiling including relational information) and the inferences drawn from them. The data mining community has been very conscious of these issues and has addressed in particular the inference problems through various methods for \"privacy-preserving data mining\" and \"privacy-preserving data publishing\". However, it appears that these approaches by themselves cannot effectively solve the privacy problems posed by mining. We argue that this is due to the underlying notions of privacy and of data mining, both of which are too narrow. Drawing on notions of privacy not only as hiding, but as control and negotiation, as well as on data mining not only as modelling, but as the whole cycle of knowledge discovery, we offer an alternative view. This is intended to be a comprehensive view of the privacy challenges as well as solution approaches along all phases of the knowledge discovery cycle. The paper thus combines a survey with an outline of an agenda for a comprehensive, interdisciplinary view of Web mining and privacy.", "paper_title": "More than modelling and hiding: towards a comprehensive view of Web mining and privacy", "paper_id": "WOS:000302478900008"}