{"auto_keywords": [{"score": 0.03478167905660463, "phrase": "ltsa"}, {"score": 0.00481495049065317, "phrase": "web-based_learning_systems"}, {"score": 0.0044688500725247726, "phrase": "working_people"}, {"score": 0.00436742595270452, "phrase": "learning_systems"}, {"score": 0.004219571240696568, "phrase": "learners'_profiles"}, {"score": 0.003916098498242888, "phrase": "learning_goal"}, {"score": 0.0036553070575015344, "phrase": "e-learning_schema"}, {"score": 0.003094306770612843, "phrase": "proposed_approach"}, {"score": 0.0029722900280316216, "phrase": "electronic_questionnaires"}, {"score": 0.002726740692380339, "phrase": "automatic_analysis"}, {"score": 0.002680114113899346, "phrase": "learners'_responses"}, {"score": 0.002530359917257626, "phrase": "different_learner_profiles"}, {"score": 0.0023889533502525527, "phrase": "learning_material"}, {"score": 0.0022424956516376073, "phrase": "five_european_countries"}, {"score": 0.0022041312401435346, "phrase": "overall_case_study"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["e-learning", " learners' profiles", " e-questionnaire", " personalization", " educational resources adaptation"], "paper_abstract": "Taking advantage of the continuously improving, web-based learning systems plays an important role for self-learning, especially in the case of working people. Nevertheless, learning systems do not generally adapt to learners' profiles. Learners have to spend a lot of time before reaching the learning goal that is compatible with their knowledge background. To overcome such difficulties, an e-learning schema is introduced that adapts to the learners' ICT (Information and Communication Technologies) knowledge level. The IEEE Reference Model (WG 1) defined by the Learning Technology Standards Committee (LTSA) is extended and used for this purpose. The proposed approach is based on the usage of electronic questionnaires (e-questionnaires) designed by a group of experts. Through the automatic analysis of the learners' responses to the questionnaires, all learners are assigned to different learner profiles. According to these profiles they are served with learning material that best matches their educational needs. We have implemented our approach in five European countries and the overall case study illustrates very promising results. (C) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "An intelligent e-learning system based on learner profiling and learning resources adaptation", "paper_id": "WOS:000257103500016"}