{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "neuroanatomy_ontologies"}, {"score": 0.004248869786808024, "phrase": "multiple_levels"}, {"score": 0.004136469845987887, "phrase": "gross_anatomy"}, {"score": 0.00341309513558946, "phrase": "anatomical_structure"}, {"score": 0.003382704886584695, "phrase": "multiple_criteria"}, {"score": 0.0033376244286643176, "phrase": "resulting_classes"}, {"score": 0.0032492519841546682, "phrase": "datasets_recording"}, {"score": 0.002984504445973107, "phrase": "error_checking"}, {"score": 0.002905454531687249, "phrase": "sophisticated_combinatorial_queries"}, {"score": 0.002815864555488112, "phrase": "consistent_and_biologically_meaningful_results"}, {"score": 0.002418393046947528, "phrase": "spatial_and_connectivity_relationships"}, {"score": 0.002364865100579589, "phrase": "brain_regions"}, {"score": 0.0023333173799963795, "phrase": "broad_range"}, {"score": 0.0021049977753042253, "phrase": "virtual_fly_brain_web_resource"}], "paper_keywords": [""], "paper_abstract": "Motivation: Advancing our understanding of how nervous systems work will require the ability to store and annotate 3D anatomical datasets, recording morphology, partonomy and connectivity at multiple levels of granularity from subcellular to gross anatomy. It will also require the ability to integrate this data with other datatypes including functional, genetic and electrophysiological data. The web ontology language OWL2 provides the means to solve many of these problems. Using it, one can rigorously define and relate classes of anatomical structure using multiple criteria. The resulting classes can be used to annotate datasets recording, for example, gene expression or electrophysiology. Reasoning software can be used to automate classification and error checking and to construct and answer sophisticated combinatorial queries. But for such queries to give consistent and biologically meaningful results, it is important that both classes and the terms ( relations) used to relate them are carefully defined. Results: We formally define a set of relations for recording the spatial and connectivity relationships of neuron classes and brain regions in a broad range of species, from vertebrates to arthropods. We illustrate the utility of our approach via its application in the ontology that drives the Virtual Fly Brain web resource.", "paper_title": "A strategy for building neuroanatomy ontologies", "paper_id": "WOS:000303338200010"}