{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "nondeterministic_classifiers"}, {"score": 0.01638777803564297, "phrase": "posterior_probabilities"}, {"score": 0.009968443842870302, "phrase": "input_space"}, {"score": 0.009775258806855279, "phrase": "true_class"}, {"score": 0.003817137134650275, "phrase": "ir_loss_functions"}, {"score": 0.003728000957725218, "phrase": "nondeterministic_learners"}, {"score": 0.003555902292752528, "phrase": "optimal_nondeterministic_hypotheses"}, {"score": 0.003260690513595527, "phrase": "lowest_expected_loss"}, {"score": 0.00320970209394799, "phrase": "general_point"}, {"score": 0.0028293966058473476, "phrase": "tiny_proportion"}, {"score": 0.0027200305495826797, "phrase": "extensive_experimental_study"}, {"score": 0.0026252106881752067, "phrase": "support_vector_machine"}, {"score": 0.002426137929553722, "phrase": "uci_multi-class_learning_tasks"}, {"score": 0.0023787690061742566, "phrase": "different_kinds"}, {"score": 0.002155412043665635, "phrase": "brier_score"}, {"score": 0.0021049977753042253, "phrase": "nondeterministic_predictions"}], "paper_keywords": ["nondeterministic", " multiclassification", " reject option", " multi-label classification", " posterior probabilities"], "paper_abstract": "Nondeterministic classifiers are defined as those allowed to predict more than one class for some entries from an input space. Given that the true class should be included in predictions and the number of classes predicted should be as small as possible, these kind of classifiers can be considered as Information Retrieval (IR) procedures. In this paper, we propose a family of IR loss functions to measure the performance of nondeterministic learners. After discussing such measures, we derive an algorithm for learning optimal nondeterministic hypotheses. Given an entry from the input space, the algorithm requires the posterior probabilities to compute the subset of classes with the lowest expected loss. From a general point of view, nondeterministic classifiers provide an improvement in the proportion of predictions that include the true class compared to their deterministic counterparts; the price to be paid for this increase is usually a tiny proportion of predictions with more than one class. The paper includes an extensive experimental study using three deterministic learners to estimate posterior probabilities: a multiclass Support Vector Machine (SVM), a Logistic Regression, and a Naive Bayes. The data sets considered comprise both UCI multi-class learning tasks and microarray expressions of different kinds of cancer. We successfully compare nondeterministic classifiers with other alternative approaches. Additionally, we shall see how the quality of posterior probabilities (measured by the Brier score) determines the goodness of nondeterministic predictions.", "paper_title": "Learning Nondeterministic Classifiers", "paper_id": "WOS:000272346400004"}