{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "online_social_networking"}, {"score": 0.004668957916795845, "phrase": "increased_interest"}, {"score": 0.004574085781766281, "phrase": "underlying_network_structure"}, {"score": 0.004458189822972851, "phrase": "available_information"}, {"score": 0.004412654209742722, "phrase": "social_peers"}, {"score": 0.003961613484271729, "phrase": "information_collection"}, {"score": 0.003782655283668953, "phrase": "dynamic_social_network"}, {"score": 0.0037057255600764475, "phrase": "sampling-based_algorithms"}, {"score": 0.003611751858608048, "phrase": "user's_social_network"}, {"score": 0.003275807170434343, "phrase": "basic_sampling_scheme"}, {"score": 0.003143849342926373, "phrase": "centralized_and_distributed_social_networks"}, {"score": 0.00263965046277432, "phrase": "real_and_synthetic_data_sets"}, {"score": 0.0021049977753042253, "phrase": "social_graph"}], "paper_keywords": ["Information networks", " search process", " query processing", " performance evaluation of algorithms and systems"], "paper_abstract": "As online social networking emerges, there has been increased interest to utilize the underlying network structure as well as the available information on social peers to improve the information needs of a user. In this paper, we focus on improving the performance of information collection from the neighborhood of a user in a dynamic social network. We introduce sampling-based algorithms to efficiently explore a user's social network respecting its structure and to quickly approximate quantities of interest. We introduce and analyze variants of the basic sampling scheme exploring correlations across our samples. Models of centralized and distributed social networks are considered. We show that our algorithms can be utilized to rank items in the neighborhood of a user, assuming that information for each user in the network is available. Using real and synthetic data sets, we validate the results of our analysis and demonstrate the efficiency of our algorithms in approximating quantities of interest. The methods we describe are general and can probably be easily adopted in a variety of strategies aiming to efficiently collect information from a social graph.", "paper_title": "Sampling Online Social Networks", "paper_id": "WOS:000314934900014"}