{"auto_keywords": [{"score": 0.040398493807671056, "phrase": "yield_sequences"}, {"score": 0.010612387000973441, "phrase": "journal_attractivity_indicators"}, {"score": 0.004468684611798047, "phrase": "yield_period"}, {"score": 0.003727527379253624, "phrase": "dynamic_characteristics"}, {"score": 0.0032969458013463807, "phrase": "nature_and_science"}, {"score": 0.003010893527930816, "phrase": "yield_periods"}, {"score": 0.002824005136794786, "phrase": "dynamic_aspects"}, {"score": 0.002662871928330334, "phrase": "exceptional_circumstances"}, {"score": 0.002578880352208335, "phrase": "laemmli's_paper"}, {"score": 0.002499837700465608, "phrase": "nature"}, {"score": 0.0024578219177450876, "phrase": "clearly_visible"}, {"score": 0.002418742283474052, "phrase": "average_number"}, {"score": 0.00232995025271599, "phrase": "citation_distribution"}, {"score": 0.0021049977753042253, "phrase": "new_dynamic_indicator"}], "paper_keywords": ["reference services", " electronic journals", " user studies", " case studies"], "paper_abstract": "Purpose - The yield period of a journal is defined as the time needed to accumulate the same number of citations as the number of references included during the period of Study. Yield sequences are proposed as journal attractivity indicators describing dynamic characteristics of a journal. This paper aims to investigate their use. Design/methodology/approach - As a case study the yield sequences of the journals Nature and Science from 1955 onward are determined. Similarities and dissimilarities between these sequences are discussed and factors affecting yield periods are determined. Findings - The study finds that yield sequences make dynamic aspects of a journal visible, as reflected through citations. Exceptional circumstances (here the publication of Laemmli's paper in 1970 in the journal Nature) become Clearly Visible. The average number of references per article, the citation distribution and the size of the database used to collect citations are factors influencing yield sequences. Originality/value - A new dynamic indicator for the study of journals is introduced.", "paper_title": "Yield sequences as journal attractivity indicators: \"payback times\" for Science and Nature", "paper_id": "WOS:000258733800005"}