{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "knowledge_flow"}, {"score": 0.04005920689564769, "phrase": "proposed_hybrid_approach"}, {"score": 0.003987474771008829, "phrase": "numerous_contexts"}, {"score": 0.003845994935767022, "phrase": "km._findings_-"}, {"score": 0.003549245218355768, "phrase": "complex_interactions"}, {"score": 0.0035208552733545463, "phrase": "numerous_contents"}, {"score": 0.0034926916198124484, "phrase": "dynamic_contexts"}, {"score": 0.0033283624928018177, "phrase": "multi-directional_and_adaptive_interactions"}, {"score": 0.0031590250068577867, "phrase": "firm's_km_initiatives"}, {"score": 0.0029034358982402346, "phrase": "qualitative_and_quantitative_methods"}, {"score": 0.002722634472231842, "phrase": "future_km_research"}, {"score": 0.0026577673946415583, "phrase": "proposed_approach"}, {"score": 0.0025944417620244924, "phrase": "probable_determinants"}, {"score": 0.002191366809047192, "phrase": "hybrid_approach"}, {"score": 0.002156402793481102, "phrase": "research_issues"}, {"score": 0.0021049977753042253, "phrase": "complex_content"}], "paper_keywords": ["Knowledge management", " Knowledge flow", " Content analysis", " Formal concept analysis (FCA)", " Triangulation", " Determinants"], "paper_abstract": "Purpose - This study attempts to develop an approach with triangulation to explore the determinants of knowledge flows, as well as the relationships among them. Design/methodology/approach - The proposed approach with the use of triangulation is designed to handle the issues that arise in the various interactions and numerous contexts among entities and/or activities that are associated with KM. Findings - The proposed hybrid approach is found to be helpful in dealing with the issue of knowledge flow, especially involving various entities and complex interactions with numerous contents and dynamic contexts. In addition, the findings also show the presence of multi-directional and adaptive interactions among determinants to knowledge flows, and also how these influence a firm's KM initiatives and performance. Research limitations/implications - The proposed hybrid approach can be considered as a way to overcome the limitations both of qualitative and quantitative methods, and the relationships among knowledge flows explored in this study provide some directions for future KM research. Practical implications - The proposed approach focuses on the visualization of probable determinants to knowledge flows within an organization. This visualization can be utilized to evaluate the determinants and their relationships with each other, which may help managers to take actions to achieve more effective and efficient KM. Originality/value - The results show the value of using a hybrid approach for dealing with research issues involving various entities and activities with complex content, such as knowledge flows.", "paper_title": "A hybrid approach to knowledge flow", "paper_id": "WOS:000319640600001"}