{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "wireless_sensor_networks"}, {"score": 0.03223924488101999, "phrase": "routing_protocols"}, {"score": 0.004326624385772596, "phrase": "hot_research_area"}, {"score": 0.004222707054751191, "phrase": "key_technology"}, {"score": 0.0038499929374478125, "phrase": "flat_topology"}, {"score": 0.0034760655218366, "phrase": "hierarchical_topology"}, {"score": 0.0034423989472667756, "phrase": "different_tasks"}, {"score": 0.00323134923196813, "phrase": "specific_requirements"}, {"score": 0.0029892206557359836, "phrase": "active_branch"}, {"score": 0.002608218347502229, "phrase": "diverse_cluster_shapes"}, {"score": 0.002545468362709126, "phrase": "main_advantages"}, {"score": 0.0023091721866305426, "phrase": "typical_clustering_routing_protocols"}, {"score": 0.002242647404307089, "phrase": "different_approaches"}, {"score": 0.0021049977753042253, "phrase": "open_questions"}], "paper_keywords": ["WSN", " clustering routing", " block-based clustering", " grid-based clustering", " chain-based clustering"], "paper_abstract": "Wireless sensor networks (WSNs) are becoming increasingly attractive for a variety of applications and have become a hot research area. Routing is a key technology in WSNs and can be coarsely divided into two categories: flat routing and hierarchical routing. In a flat topology, all nodes perform the same task and have the same functionality in the network. In contrast, nodes in a hierarchical topology perform different tasks in WSNs and are typically organized into lots of clusters according to specific requirements or metrics. Owing to a variety of advantages, clustering routing protocols are becoming an active branch of routing technology in WSNs. In this paper, we present an overview on clustering routing algorithms for WSNs with focus on differentiating them according to diverse cluster shapes. We outline the main advantages of clustering and discuss the classification of clustering routing protocols in WSNs. In particular, we systematically analyze the typical clustering routing protocols in WSNs and compare the different approaches based on various metrics. Finally, we conclude the paper with some open questions.", "paper_title": "Clustering Routing Algorithms In Wireless Sensor Networks: An Overview", "paper_id": "WOS:000310979500001"}