{"auto_keywords": [{"score": 0.026160272577861125, "phrase": "everyday_experience"}, {"score": 0.00481495049065317, "phrase": "mindet.dk"}, {"score": 0.004281372589330329, "phrase": "new_child"}, {"score": 0.004174929128880472, "phrase": "parents'_perspective"}, {"score": 0.004122699822340296, "phrase": "new_future"}, {"score": 0.003427380591229386, "phrase": "particular_child"}, {"score": 0.0033561632967173856, "phrase": "good_things"}, {"score": 0.003138030910104256, "phrase": "danish_website_mindet.dk"}, {"score": 0.002586513876943306, "phrase": "different_aspects"}, {"score": 0.0023879771786116228, "phrase": "religious_realm"}, {"score": 0.002358050109031317, "phrase": "\"the_work"}, {"score": 0.002338306897057454, "phrase": "ritual_horizontal_ellipsis"}, {"score": 0.002270495425498003, "phrase": "complex_interplay"}, {"score": 0.0021049977753042253, "phrase": "re-experiencing_life"}], "paper_keywords": ["Ritualizations", " Online practices", " Stillborns", " Infants", " Grief work", " Parents"], "paper_abstract": "When parents are expecting, the child is usually awaited with hope and plans and reflections on how to share the life and future with this new child. As such the child opens the parents' perspective to a new future, a span of time or potentiality, a certain narrative-that is, being parents, raising a child. When a child is stillborn or dies at a very young age, this event not only turns off all hopes for this particular child, but also all good things envisioned for the child and his or her family, the world itself changes radically. At the Danish website Mindet.dk, parents engage in ritualizations through which they resituate themselves in the world through performing their grief and loss, re-relating themselves to others and renewing their acquaintance with themselves and the world. These ritualizations are carried out through narratives and performances dealing with different aspects of the loss and are not about \"translating\" the everyday experience into, for instance, a religious realm. Rather \"the work of ritual horizontal ellipsis involves developing repertoires that operate in complex interplay with the world of everyday experience\" and, eventually, through time and repetition, lead to re-experiencing life.", "paper_title": "Death ends a life not a relationship: timework and ritualizations at Mindet.dk", "paper_id": "WOS:000354617900005"}