{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "dynamic_assignment"}, {"score": 0.00465634671242413, "phrase": "paper_deals"}, {"score": 0.004528156929805637, "phrase": "information_flow"}, {"score": 0.004306205029641728, "phrase": "bus_access_arbitration_protocol"}, {"score": 0.003829548069657859, "phrase": "different_communication_nodes"}, {"score": 0.0037449033166879874, "phrase": "highest_priority"}, {"score": 0.003501991125315889, "phrase": "real-time_applications"}, {"score": 0.003311604528903634, "phrase": "strict_time_constraints"}, {"score": 0.0031140747752837826, "phrase": "real-time_constraints"}, {"score": 0.00306227185008558, "phrase": "critical_information"}, {"score": 0.0025178072071268534, "phrase": "real-time_requirements"}, {"score": 0.002176887956041267, "phrase": "full_can_communication_stacks"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["CAN", " CAL CiA", " CANOpen", " fieldbus", " real-time", " scheduling"], "paper_abstract": "The paper deals with the scheduling of information flow in a CAN ISO IS-11898 communication system. It mainly features a bus access arbitration protocol based on a priority assigned to each message to be transmitted, if two or more messages are transmitted at the same time by different communication nodes, only the message with the highest priority continues to be transmitted, the other being stopped. In real-time applications, messages contain information which must be transmitted within strict time constraints; according to the CAN ISO IS-I 1898 bus arbitration protocol, respect of real-time constraints of time critical information depends on the priority assigned to the message conveying it. The aim of the paper is to propose a procedure for dynamic assignment of priorities to messages to be transmitted, in such a way the real-time requirements of the information conveyed are fulfilled. Although many other approaches can be found in literature, the proposal is original as It is based on standard full CAN communication stacks. (C) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Proposal and evaluation of dynamic assignment of priorities in CAN", "paper_id": "WOS:000238047100004"}