{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "protoporphyrin_ix"}, {"score": 0.009730718368444824, "phrase": "insertion_process"}, {"score": 0.009598299267633595, "phrase": "ferrous_ion"}, {"score": 0.004662705558154439, "phrase": "bacillus_subtilis"}, {"score": 0.004119049028319832, "phrase": "j._inorg"}, {"score": 0.0036218682585355895, "phrase": "human_enzyme"}, {"score": 0.0031699005399973496, "phrase": "bacillus_subtilis_ferrochelatase"}, {"score": 0.0026986685585382347, "phrase": "overall_process"}, {"score": 0.0024842242921857705, "phrase": "porphyrin_ring"}, {"score": 0.0023725232579531273, "phrase": "optimal_insertion_pathway"}, {"score": 0.002318566141177149, "phrase": "rate-determining_step"}, {"score": 0.002255431275670053, "phrase": "second_proton"}, {"score": 0.0021539955106204354, "phrase": "fourth_fe-n_bond"}, {"score": 0.002124461969404541, "phrase": "energy_barrier"}], "paper_keywords": ["Ferrochelatase", " Metallation", " Protoporphyrin IX", " QM/MM"], "paper_abstract": "We previously reported the insertion process of the ferrous ion into the protoporphyrin IX from the side of the residue His-183 (J. Inorg. Biochem. 103 (2009) 1680-1686). Sellers et al. suggested that the ferrous ion probably approaches the protoporphyrin IX via the opposite side in the human enzyme. In this paper, we simulated the insertion process of Fe2+ into the protoporphyrin IX from the side of the residue Tyr-13 at the opposite site of His-183 by QM/MM method on Bacillus subtilis ferrochelatase. The model was built with Fe2+ ion coordinated by Tyr-13, His-88 and two water molecules. Geometries were optimized at the BP86/6-31G* level and energies were calculated at the B3LYP/6-311+G(2d,2p) level. The overall process involves the displacement of the residues Tyr-13, His-88 and one water molecule and deprotonation of the porphyrin ring. All the local minimum structures and energy barriers were obtained and an optimal insertion pathway was suggested. The rate-determining step is the removing of the second proton from the porphyrin accompanied by the formation of the fourth Fe-N bond with an energy barrier of 138.00 kJ/mol.", "paper_title": "Is it possible for Fe2+ to approach protoporphyrin IX from the side of Tyr-13 in Bacillus subtilis ferrochelatase? An answer from QM/MM study", "paper_id": "WOS:000314051200046"}