{"auto_keywords": [{"score": 0.04283876940761751, "phrase": "valid_share"}, {"score": 0.00481495049065317, "phrase": "oriented_secret_sharing"}, {"score": 0.004600870784042767, "phrase": "n_shares"}, {"score": 0.004531637625717547, "phrase": "n_shareholders"}, {"score": 0.004184825434585617, "phrase": "secret_s."}, {"score": 0.003908678575537341, "phrase": "secret_reconstruction"}, {"score": 0.0036924762294207633, "phrase": "randomized_component"}, {"score": 0.0036647053729970975, "phrase": "rc"}, {"score": 0.003383884759373793, "phrase": "computational_assumption"}, {"score": 0.003124691208650217, "phrase": "rcs"}, {"score": 0.0024227171881502614, "phrase": "user_authentication"}, {"score": 0.0024043803470189455, "phrase": "share_verification"}, {"score": 0.002153540857619362, "phrase": "simple_way"}, {"score": 0.0021049977753042253, "phrase": "group_authentication"}], "paper_keywords": ["Threshold secret sharing", " group oriented secret sharing", " randomized component", " share protection", " asymptotically perfect"], "paper_abstract": "A basic (t,n)-secret sharing (SS) scheme allows a secret s to be divided into n shares and shared among n shareholders. In the scheme, any t or more than t shareholders can recover the secret while fewer than t shareholders cannot obtain the secret s. But an adversary without any valid share may obtain the secret if there are over t participants in the secret reconstruction. To address this type of attack, we first introduce the notion of randomized component (RC), which binds a share with all participants and protects the share from being exposed to outside without any computational assumption; at the same time, RCs can be used to reconstruct the secret. As one of the applications of RCs, a (t,m,n)-group oriented SS scheme is proposed to cope with the attack in basic (t,n)-SSs, in which once m (m >= t) participants form a tightly couple group by generating RCs, the secret can be recovered only if all m RCs are correct, which requires each participant to have a valid share in advance. Moreover, the scheme can secure the secret without any user authentication or share verification. Analyses show the proposed (t,m,n)-group oriented SS is asymptotically perfect and unconditionally secure. RCs can also be applied to build other schemes in a simple way, such as multi-SS, group authentication, and so on.", "paper_title": "Randomized Component and Its Application to (t,m,n)-Group Oriented Secret Sharing", "paper_id": "WOS:000352534300001"}