{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "parent-teenager_communication"}, {"score": 0.03237342927501384, "phrase": "cueb"}, {"score": 0.004764542405129454, "phrase": "interactive_photo_cubes"}, {"score": 0.004199101289890982, "phrase": "literature_review"}, {"score": 0.004133292222875435, "phrase": "diary_study"}, {"score": 0.004025885154716127, "phrase": "teenager-oriented_everyday_activities"}, {"score": 0.003819339842998955, "phrase": "substantial_interest"}, {"score": 0.0031098631445657158, "phrase": "resulting_design"}, {"score": 0.0029657683623403085, "phrase": "interactive_digital_photo_cubes"}, {"score": 0.0028432828877281388, "phrase": "individual_and_shared_experiences"}, {"score": 0.002376559242152662, "phrase": "cueb's_full_functionality"}, {"score": 0.002219040041886641, "phrase": "limited_functionality"}, {"score": 0.0021612684684351974, "phrase": "random_photographs"}], "paper_keywords": ["Parent-teenager communication", " Digital photographs", " Everyday remembering", " Sharing memories", " Design research", " Interaction design"], "paper_abstract": "Because most teenagers strive for freedom and try to live autonomously, communication with their parents could be improved. It appeared from a literature review and a diary study that parent-teenager communication primarily addresses teenager-oriented everyday activities. However, it also showed teenagers have a substantial interest in getting to know their parents and their parents' past. The study described in this paper seeks to address this opportunity by designing a product for parents and teenagers that facilitates communication about the past of the parents. The resulting design, called Cueb, is a set of interactive digital photo cubes with which parents and teenagers can explore individual and shared experiences and are triggered to exchange stories. An evaluation of a prototype of Cueb with four families showed that the participants felt significantly more triggered and supported to share their experiences and tell stories with Cueb's full functionality (connecting cubes, switching, and locking photographs) than with limited functionality (shaking to display random photographs), similar to more traditional photo media.", "paper_title": "Facilitating parent-teenager communication through interactive photo cubes", "paper_id": "WOS:000314089200007"}