{"auto_keywords": [{"score": 0.004145287175409325, "phrase": "discrete_time_markov_chains"}, {"score": 0.00392153537973826, "phrase": "acknowledged_transmissions"}, {"score": 0.0037931018103829427, "phrase": "different_network"}, {"score": 0.003751228706861377, "phrase": "traffic_parameters"}, {"score": 0.003668859054928118, "phrase": "packet_arrival_rate"}, {"score": 0.003628352506247126, "phrase": "packet_size"}, {"score": 0.0033015555065209865, "phrase": "nonsaturation_region"}, {"score": 0.0029544572689681934, "phrase": "network_queues"}, {"score": 0.002841774126940817, "phrase": "downlink_queue"}, {"score": 0.0027031706928674092, "phrase": "network_operation"}, {"score": 0.0024594969044952108, "phrase": "network_operating_point"}, {"score": 0.0023136311468961125, "phrase": "downlink_traffic"}], "paper_keywords": ["IEEE Std 802.15.4", " CSMA-CA", " Medium Access Control (MAC) protocols", " queuing analysis"], "paper_abstract": "The performance of an IEEE 802.15.4 compliant network operating in the beacon enabled mode with both downlink and uplink traffic is analyzed through discrete time Markov chains and the theory of M/G/1 queues. The model considers acknowledged transmissions and includes the impact of different network and traffic parameters such as the packet arrival rate, packet size, inactive period between the beacons, and the number of stations. We investigate the nonsaturation region and outline the conditions under which the network abruptly goes to saturation. The analysis of stability of the network queues shows that the stability of the downlink queue at the coordinator is the most critical for network operation. Due to the abruptness with which the switch from nonsaturation to saturation occurs, the network operating point has to be carefully chosen according to the volume of downlink traffic. Furthermore, our model shows that certain features prescribed by the standard actually limit the performance of 802.15.4 networks.", "paper_title": "Performance of a beacon enabled IEEE 802.15.4 cluster with downlink and uplink traffic", "paper_id": "WOS:000235477500007"}