{"auto_keywords": [{"score": 0.037830802417963445, "phrase": "umi_simulation"}, {"score": 0.031829428344297174, "phrase": "cross-sectional_average_inflow_velocity"}, {"score": 0.00481495049065317, "phrase": "two-dimensional_ultrasonic-measurement-integrated_blood_flow_analysis_system"}, {"score": 0.004404658750724105, "phrase": "subsequent_circulatory_disease"}, {"score": 0.0038919354605673104, "phrase": "carotid_artery"}, {"score": 0.0036673959568781734, "phrase": "ultrasound_color_doppler_imaging"}, {"score": 0.0035600143547053287, "phrase": "blood_flow_field"}, {"score": 0.0032402142645120958, "phrase": "feedback_signals"}, {"score": 0.0031453010852936334, "phrase": "doppler_velocities"}, {"score": 0.0028911669203979156, "phrase": "feedback_gain"}, {"score": 0.0028203950416405563, "phrase": "blood_flow"}, {"score": 0.0027925723953701083, "phrase": "five_carotid_arteries"}, {"score": 0.002504011301105577, "phrase": "carotid_arteries"}, {"score": 0.002454835845644037, "phrase": "target_variables"}, {"score": 0.002394719113232821, "phrase": "present_system"}, {"score": 0.002147180332779021, "phrase": "new_diagnostic_method"}, {"score": 0.0021049977753042253, "phrase": "hemodynamic_information"}], "paper_keywords": ["Hemodynamics", " Ultrasound color Doppler imaging", " Computational fluid dynamics", " Measurement-integrated simulation", " Carotid artery"], "paper_abstract": "Prevention and early detection of atherosclerosis are critical for protection against subsequent circulatory disease. In this study, an automated two-dimensional ultrasonic-measurement-integrated (2D-UMI) blood flow analysis system for clinical diagnosis was developed, and the feasibility of the system for hemodynamic analysis in a carotid artery was revealed. The system automatically generated a 2D computational domain based on ultrasound color Doppler imaging and performed a UMI simulation of blood flow field to visualize hemodynamics in the domain. In the UMI simulation, compensation of errors was applied by adding feedback signals proportional to the differences between Doppler velocities by measurement and computation while automatically estimating the cross-sectional average inflow velocity. The necessity of adjustment of the feedback gain was examined by analyzing blood flow in five carotid arteries: three healthy, one sclerosed, and one stenosed. The same feedback gain was generally applicable for the 2D-UMI simulation in all carotid arteries, depending on target variables. Thus, the present system was shown to be versatile in the sense that the parameter is patient independent. Moreover, the possibility of a new diagnostic method based on the hemodynamic information obtained by the 2D-UMI simulation, such as a waveform of the cross-sectional average inflow velocity and wall shear stress distributions, was suggested.", "paper_title": "Development and feasibility study of a two-dimensional ultrasonic-measurement-integrated blood flow analysis system for hemodynamics in carotid arteries", "paper_id": "WOS:000344074300003"}