{"auto_keywords": [{"score": 0.048408674865636964, "phrase": "metadata_usage"}, {"score": 0.01010581269159786, "phrase": "metadata_structure"}, {"score": 0.00789049171823698, "phrase": "labtrove"}, {"score": 0.004823848403471723, "phrase": "context"}, {"score": 0.004602233424629559, "phrase": "labtrove_eln."}, {"score": 0.00447045328907701, "phrase": "growing_willingness"}, {"score": 0.004231699728933577, "phrase": "research_investment"}, {"score": 0.0040186038781533946, "phrase": "underlying_data"}, {"score": 0.003928767863456321, "phrase": "electronic_laboratory_notebooks"}, {"score": 0.003853359519337239, "phrase": "experiment_data"}, {"score": 0.003816197777388722, "phrase": "essential_ingredient"}, {"score": 0.003706841132853073, "phrase": "web_browser-based_eln"}, {"score": 0.0034974064973871833, "phrase": "user_behavior"}, {"score": 0.0033971539563683174, "phrase": "user_perceptions"}, {"score": 0.003310447652300423, "phrase": "user-testing_activities"}, {"score": 0.002717937009041744, "phrase": "user_community"}, {"score": 0.00250682585023182, "phrase": "minimum_required_approach"}, {"score": 0.002260301305523054, "phrase": "user-defined_metadata"}, {"score": 0.002181270821530302, "phrase": "interface_designs"}, {"score": 0.0021186648667919044, "phrase": "metadata_creation"}], "paper_keywords": [""], "paper_abstract": "The drive toward more transparency in research, the growing willingness to make data openly available, and the reuse of data to maximize the return on research investment all increase the importance of being able to find information and make links to the underlying data. The use of metadata in Electronic Laboratory Notebooks (ELNs) to curate experiment data is an essential ingredient for facilitating discovery. The University of Southampton has developed a Web browser-based ELN that enables users to add their own metadata to notebook entries. A survey of these notebooks was completed to assess user behavior and patterns of metadata usage within ELNs, while user perceptions and expectations were gathered through interviews and user-testing activities within the community. The findings indicate that while some groups are comfortable with metadata and are able to design a metadata structure that works effectively, many users are making little attempts to use it, thereby endangering their ability to recover data in the future. A survey of patterns of metadata use in these notebooks, together with feedback from the user community, indicated that while a few groups are comfortable with metadata and are able to design a metadata structure that works effectively, many users adopt a minimum required approach to metadata. To investigate whether the patterns of metadata use in LabTrove were unusual, a series of surveys were undertaken to investigate metadata usage in a variety of platforms supporting user-defined metadata. These surveys also provided the opportunity to investigate whether interface designs in these other environments might inform strategies for encouraging metadata creation and more effective use of metadata in LabTrove.", "paper_title": "Creating Context for the Experiment Record. User-Defined Metadata: Investigations into Metadata Usage in the LabTrove ELN", "paper_id": "WOS:000347137500002"}