{"auto_keywords": [{"score": 0.04973325992892519, "phrase": "ubiquitous_computing"}, {"score": 0.03340305748453232, "phrase": "realistic_use"}, {"score": 0.00481495049065317, "phrase": "ecological_validity"}, {"score": 0.00456020621016909, "phrase": "considerable_time"}, {"score": 0.004397875849247165, "phrase": "design_approaches"}, {"score": 0.004350308086118336, "phrase": "ecologically_valid_understandings"}, {"score": 0.004318881178805575, "phrase": "ubiquitous_computing_systems"}, {"score": 0.004210656614914171, "phrase": "design_decisions"}, {"score": 0.004060718465754644, "phrase": "actual_experience"}, {"score": 0.003973320429450603, "phrase": "central_question"}, {"score": 0.0036553070575015344, "phrase": "literature_survey"}, {"score": 0.0034995881411519925, "phrase": "scale_cause"}, {"score": 0.003486913922294352, "phrase": "ubicomp_systems"}, {"score": 0.003424225677958491, "phrase": "prototype_creation"}, {"score": 0.00338715316196893, "phrase": "ecologically_valid_evaluation"}, {"score": 0.0030048355421601705, "phrase": "useful_data"}, {"score": 0.002961519813246521, "phrase": "critical_events"}, {"score": 0.0024968877430444304, "phrase": "research_challenges"}, {"score": 0.0023903999901926224, "phrase": "particular_processes"}, {"score": 0.002263639474937039, "phrase": "prototyping_tools"}, {"score": 0.0022472527731744974, "phrase": "evaluation_methods"}, {"score": 0.002206801982145622, "phrase": "realistic_settings"}, {"score": 0.0021049977753042253, "phrase": "particular_developer"}], "paper_keywords": [""], "paper_abstract": "Over the past decade and a half, corporations and academies have invested considerable time and money in the realization of ubiquitous computing. Yet design approaches that yield ecologically valid understandings of ubiquitous computing systems, which can help designers make design decisions based on how systems perform in the context of actual experience, remain rare. The central question underlying this article is, What barriers stand in the way of real-world, ecologically valid design for ubicomp? Using a literature survey and interviews with 28 developers, we illustrate how issues of sensing and scale cause ubicomp systems to resist iteration, prototype creation, and ecologically valid evaluation. In particular, we found that developers have difficulty creating prototypes that are both robust enough for realistic use and able to handle ambiguity and error and that they struggle to gather useful data from evaluations because critical events occur infrequently, because the level of use necessary to evaluate the system is difficult to maintain, or because the evaluation itself interferes with use of the system. We outline pitfalls for developers to avoid as well as practical solutions, and we draw on our results to outline research challenges for the future. Crucially, we do not argue for particular processes, sets of metrics, or intended outcomes, but rather we focus on prototyping tools and evaluation methods that support realistic use in realistic settings that can be selected according to the needs and goals of a particular developer or researcher.", "paper_title": "Exiting the cleanroom: On ecological validity and ubiquitous computing", "paper_id": "WOS:000254486300002"}