{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "vertical_displacements"}, {"score": 0.004379631619412168, "phrase": "roof_panels"}, {"score": 0.004106225442735525, "phrase": "radial_and_circular_beams"}, {"score": 0.004059772950454586, "phrase": "calculation_models"}, {"score": 0.00373474182086791, "phrase": "present_work"}, {"score": 0.0035415392642831616, "phrase": "metal_silo_roof_structure"}, {"score": 0.003320277992107974, "phrase": "vertical_displacement"}, {"score": 0.003245520963944678, "phrase": "full_scale"}, {"score": 0.002896167001212006, "phrase": "roof_structure"}, {"score": 0.0026640466056415298, "phrase": "strain_gauges"}, {"score": 0.002623881637290192, "phrase": "experimental_assays"}, {"score": 0.0025357050267224715, "phrase": "true_rigidity"}, {"score": 0.0024785689583828796, "phrase": "tension_plates"}, {"score": 0.0024504843466435487, "phrase": "radial_beams"}, {"score": 0.002386181960126766, "phrase": "vertical_silo_wall"}, {"score": 0.002279841453843241, "phrase": "measured_results"}, {"score": 0.002203200914130907, "phrase": "conservative_models"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Roof", " Silo", " Stress", " Steel", " Full-scale tests", " Structural design"], "paper_abstract": "The large-diameter, metallic, cylindrical silos used in agroindustry require in many cases some type of structure in their uppermost section so that roof panels can be secured in place. These structures often take the form of a lattice of radial and circular beams. The calculation models used in the design of these lattices assume the existence of certain behaviours that are not usually verified experimentally. In the present work, a 3-D beam model was used to predict the stresses and vertical displacements of a metal silo roof structure measuring 18.34 m in diameter. To check the validity of the model, these stress and vertical displacement values were experimentally verified at full scale. The instrumentation required to obtain these values in such a large structure is complex and costly. In this study, slings were used to apply load at 54 points in the roof structure, monitored by the use of dynamometers. The vertical displacements and strains suffered by the structure were recorded using fleximeters and strain gauges respectively. The experimental assays showed that the 3-D beam model did not contemplate the true rigidity of the joints between the tension plates and the radial beams at their point of contact with the vertical silo wall. The model therefore required adjustment in order to predict the measured results. The results show the need to use conservative models in the design of these structures. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Full-scale tests to measure stresses and vertical displacements in an 18.34 m-diameter agricultural steel silo roof", "paper_id": "WOS:000340141500007"}