{"auto_keywords": [{"score": 0.02246846748295755, "phrase": "elsevier"}, {"score": 0.0047314049780079765, "phrase": "naturalistic_human_interactions"}, {"score": 0.004665608609734034, "phrase": "verbal_and_nonverbal_expressions"}, {"score": 0.0044736342427651185, "phrase": "social_sciences"}, {"score": 0.004319677360634253, "phrase": "social_judgment"}, {"score": 0.004055730085399621, "phrase": "automatic_recognition"}, {"score": 0.003957477564354679, "phrase": "valuable_tool"}, {"score": 0.003861596041315646, "phrase": "negotiation_skills"}, {"score": 0.003663857375787215, "phrase": "mahnob_mimicry_database"}, {"score": 0.0034519236629123903, "phrase": "negotiation_behaviour"}, {"score": 0.00329813918116714, "phrase": "dyadic_interactions"}, {"score": 0.0031733603553977877, "phrase": "socio-political_discussion"}, {"score": 0.0031291625125786293, "phrase": "tenancy_agreement"}, {"score": 0.0030319482153908037, "phrase": "machine_understanding"}, {"score": 0.003010757286626405, "phrase": "mimicry_behaviour"}, {"score": 0.002937745193225725, "phrase": "baseline_experiments"}, {"score": 0.0029069972482610403, "phrase": "visual_data"}, {"score": 0.00275800486983114, "phrase": "binary_classification"}, {"score": 0.002738723329538679, "phrase": "video_sequences"}, {"score": 0.002719576221177709, "phrase": "mimicry_and_non-mimicry_categories"}, {"score": 0.002363474907331799, "phrase": "best_reported_results"}, {"score": 0.0022660100755784057, "phrase": "positive_examples"}, {"score": 0.002149799391146313, "phrase": "reported_baseline_experiments"}], "paper_keywords": ["Behavioural mimicry", " Motor mimicry", " Temporal modelling", " Social signal processing"], "paper_abstract": "People mimic verbal and nonverbal expressions and behaviour of their counterparts in various social interactions. Research in psychology and social sciences has shown that mimicry has the power to influence social judgment and various social behaviours, including negotiation and debating, courtship, empathy and helping behaviour. Hence, automatic recognition of mimicry behaviour would be a valuable tool in various domains, and especially in negotiation skills enhancement and medical help provision training. In this work, we present the MAHNOB mimicry database, a set of fully synchronised, multi-sensory, audiovisual recordings of naturalistic dyadic interactions, suitable for investigation of mimicry and negotiation behaviour. The database contains 11 h of recordings, split over 54 sessions of dyadic interactions between 12 confederates and their 48 counterparts, being engaged either in a socio-political discussion or negotiating a tenancy agreement. To provide a benchmark for efforts in machine understanding of mimicry behaviour, we report a number of baseline experiments based on visual data only. Specifically, we consider face and head movements, and report on binary classification of video sequences into mimicry and non-mimicry categories based on the following widely-used methodologies: two similarity-based methods (cross correlation and time warping), and a state-of-the-art temporal classifier (Long Short Term Memory Recurrent Neural Network). The best reported results are session-dependent, and affected by the sparsity of positive examples in the data. This suggests that there is much room for improvement upon the reported baseline experiments. (C) 2015 Elsevier By. All rights reserved.", "paper_title": "The MAHNOB Mimicry Database: A database of naturalistic human interactions", "paper_id": "WOS:000362271100007"}