{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "quantile_regression"}, {"score": 0.014964413512785808, "phrase": "computer_performance_experiments"}, {"score": 0.009980804108139755, "phrase": "anova"}, {"score": 0.004315487055548749, "phrase": "successful_computer_performance_evaluation"}, {"score": 0.004188459638572375, "phrase": "prior_experiment"}, {"score": 0.0038869467872381957, "phrase": "experimental_space"}, {"score": 0.0037913267098534887, "phrase": "incremental_experiments"}, {"score": 0.0031372369299648203, "phrase": "previous_approach"}, {"score": 0.0029698211157405618, "phrase": "proper_analysis"}, {"score": 0.0027420820738468577, "phrase": "successful_application"}, {"score": 0.002420611343093316, "phrase": "additional_benefit"}, {"score": 0.0021049977753042253, "phrase": "computer_experiments"}], "paper_keywords": ["Scheduling", " Latency", " Performance Evaluation", " ANOVA", " Quantile Regression"], "paper_abstract": "Research has shown that correctly conducting and analysing computer performance experiments is difficult. This paper investigates what is necessary to conduct successful computer performance evaluation by attempting to repeat a prior experiment: the comparison between two Linux schedulers. In our efforts, we found that exploring an experimental space through a series of incremental experiments can be inconclusive, and there may be no indication of how much experimentation will be enough. Analysis of variance (ANOVA), a traditional analysis method, is able to partly solve the problems with the previous approach, but we demonstrate that ANOVA can be insufficient for proper analysis due to the requirements it imposes on the data. Finally, we demonstrate the successful application of quantile regression, a recent development in statistics, to computer performance experiments. Quantile regression can provide more insight into the experiment than ANOVA, with the additional benefit of being applicable to data from any distribution. This property makes it especially useful in our field, since non-normally distributed data is common in computer experiments.", "paper_title": "Why You Should Care About Quantile Regression", "paper_id": "WOS:000321213100017"}