{"auto_keywords": [{"score": 0.04940203756018457, "phrase": "incremental_coordination_method"}, {"score": 0.00481495049065317, "phrase": "multiple_construction_cranes"}, {"score": 0.004701985831087475, "phrase": "computational_method"}, {"score": 0.00452670409375785, "phrase": "multiple_tower_cranes"}, {"score": 0.004483909657713567, "phrase": "relatively_narrow_construction_sites"}, {"score": 0.004255639740735269, "phrase": "geometrical_constraints"}, {"score": 0.0038515000499988673, "phrase": "erection_tasks"}, {"score": 0.0036379729015583975, "phrase": "close_proximity"}, {"score": 0.003355515315708125, "phrase": "crane_activities"}, {"score": 0.0032456625605347417, "phrase": "erection_process"}, {"score": 0.0031393948330209224, "phrase": "computational_methods"}, {"score": 0.0030802351224657673, "phrase": "incremental_coordinate_method"}, {"score": 0.002923214590192792, "phrase": "example_case"}, {"score": 0.002708960273193547, "phrase": "building_project"}, {"score": 0.0026705669656375197, "phrase": "working_areas"}, {"score": 0.0024984517279573906, "phrase": "numerical_test"}, {"score": 0.0021049977753042253, "phrase": "construction_site"}], "paper_keywords": [""], "paper_abstract": "The incremental coordination method a computational method for preplanning and coordinating the use of multiple tower cranes in relatively narrow construction sites is presented. The incremental coordination method considers the kinematics and the geometrical constraints of cranes to plan the motion of two or more cranes, which are being operated in collaboration. By following such planned motions, erection tasks are completed safely, even when the cranes are operated in close proximity of each other. This method allows the use of computers to plan and coordinate the crane activities from start to end of an erection process. This paper also explains the computational methods required by the incremental coordinate method including path-finding and collision detecting methods. An example case shows two construction cranes, each of three degrees-of-freedom, operating together on a building project where the working areas of the cranes intersect, hence possibility colliding with each other. A numerical test was conducted to verify the efficiency and effectiveness of applying the incremental coordination method in planning and synchronizing all motions of the two cranes to avoid any collision between the cranes themselves and collision with obstacles on the construction site.", "paper_title": "Computational methods for coordinating multiple construction cranes", "paper_id": "WOS:000256834800004"}