{"auto_keywords": [{"score": 0.004392565073466714, "phrase": "ambiguous_and_undefined_term"}, {"score": 0.0035269696779744266, "phrase": "formal_and_consistent_framework"}, {"score": 0.0034733518170738517, "phrase": "discrete_and_continuous_levels"}, {"score": 0.0033173234105492895, "phrase": "six_metrics"}, {"score": 0.003104201872147936, "phrase": "resulting_lods"}, {"score": 0.00290473242917264, "phrase": "acquisition-modelling_specification_form"}, {"score": 0.0027459678326877744, "phrase": "existing_paradigms"}, {"score": 0.002622528664187849, "phrase": "finer_specification"}, {"score": 0.0022154296909169826, "phrase": "ogc_standard_citygml"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Level of detail", " 3D city modelling", " Scale", " CityGML", " ADE"], "paper_abstract": "The level of detail in 3D city modelling, despite its usefulness and importance, is still an ambiguous and undefined term. It is used for the communication of how thoroughly real-world features have been acquired and modelled, as we demonstrate in this paper. Its definitions vary greatly between practitioners, standards and institutions. We fundamentally discuss the concept, and we provide a formal and consistent framework to define discrete and continuous levels of detail (LODs), by determining six metrics that constitute it, and by discussing their quantification and their relations. The resulting LODs are discretisations of functions of metrics that can be specified in an acquisition-modelling specification form that we introduce. The advantages of this approach over existing paradigms are formalisation, consistency, continuity, and finer specification of LODs. As an example of the realisation of the framework, we derive a series of 10 discrete LODs. We give a proposal for the integration of the framework within the OGC standard CityGML (through the Application Domain Extension). (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Formalisation of the level of detail in 3D city modelling", "paper_id": "WOS:000342864600001"}