{"auto_keywords": [{"score": 0.030424249019695215, "phrase": "xml_documents"}, {"score": 0.004815094223002128, "phrase": "xml"}, {"score": 0.004692227830462433, "phrase": "defacto_standard"}, {"score": 0.004652016085325825, "phrase": "data_representation"}, {"score": 0.004001335931796133, "phrase": "huge_document_size"}, {"score": 0.003310447652300423, "phrase": "complete_survey"}, {"score": 0.0031032109441552287, "phrase": "extensive_experimental_study"}, {"score": 0.00306334226516593, "phrase": "available_implementations"}, {"score": 0.002934098412396701, "phrase": "nine_xml_compressors"}, {"score": 0.0028963961037320805, "phrase": "large_corpus"}, {"score": 0.002822434555587263, "phrase": "different_natures"}, {"score": 0.002668582249630492, "phrase": "performance_characteristics"}, {"score": 0.0026342827320931937, "phrase": "evaluated_xml_compression_tools"}, {"score": 0.002618795843132653, "phrase": "study"}, {"score": 0.002437525632451029, "phrase": "real_world"}, {"score": 0.002226430168622392, "phrase": "effective_decision"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["XML compression", " Benchmark", " Querying XML data"], "paper_abstract": "XML has been acknowledged as the defacto standard for data representation and exchange over the World Wide Web. Being self describing grants XML its great flexibility and wide acceptance but on the other hand it is the cause of its main drawback that of being huge in size. The huge document size means that the amount of information that has to be transmitted, processed, stored, and queried is often larger than that of other data formats. Several XML compression techniques has been introduced to deal with these problems. In this paper, we provide a complete survey over the state-of-the-art of XML compression techniques. In addition, we present an extensive experimental study of the available implementations of these techniques. We report the behavior of nine XML compressors using a large corpus of XML documents which covers the different natures and scales of XML documents. In addition to assessing and comparing the performance characteristics of the evaluated XML compression tools, the Study also tries to assess the effectiveness and practicality of using these tools in the real world. Finally. we provide some guidelines and recommendations which are useful for helping developers and users for making an effective decision towards selecting the most suitable XML compression tool for their needs. (C) 2009 Elsevier Inc. All rights reserved.", "paper_title": "XML compression techniques: A survey and comparison", "paper_id": "WOS:000266943700003"}