{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "joint_kinematics"}, {"score": 0.0488492843865137, "phrase": "lower_limb_multi-body_model"}, {"score": 0.03900627135593143, "phrase": "skin_markers"}, {"score": 0.013642928310853756, "phrase": "global_sensitivity_analysis"}, {"score": 0.009749970982411189, "phrase": "measured_and_model-determined_skin_marker_positions"}, {"score": 0.004600596158672458, "phrase": "typical_part"}, {"score": 0.004570759604335229, "phrase": "biomechanical_models_evaluation"}, {"score": 0.004526365546684684, "phrase": "lower_limb_multi-body_models"}, {"score": 0.004395742407834023, "phrase": "musculoskeletal_parameters"}, {"score": 0.004268872663579808, "phrase": "joint_models"}, {"score": 0.003569050665799723, "phrase": "hinge_axis"}, {"score": 0.0034210964819485893, "phrase": "statistical_distributions"}, {"score": 0.0033548872248104814, "phrase": "multi-body_optimisation_method"}, {"score": 0.0030924870122337905, "phrase": "objective_function"}, {"score": 0.0030624066849965817, "phrase": "multi-body_optimisation"}, {"score": 0.0029933487820771217, "phrase": "squared_distances"}, {"score": 0.0028228178454284825, "phrase": "fourier-based_algorithm"}, {"score": 0.0027681550491613603, "phrase": "latin_hypercube_sampling"}, {"score": 0.002723409977992608, "phrase": "sensitivity_analysis"}, {"score": 0.0026619761089539595, "phrase": "motor_constraints"}, {"score": 0.002351813899450668, "phrase": "patellofemoral_hinge_axis"}, {"score": 0.0022912596877648723, "phrase": "tibiofemoral_ligaments"}, {"score": 0.002268955084689299, "phrase": "resulting_standard_deviations"}, {"score": 0.0022468671200629024, "phrase": "joint_angles"}, {"score": 0.002111874096328626, "phrase": "lower_limb"}, {"score": 0.0021049977753042253, "phrase": "multi-body_models"}], "paper_keywords": ["Monte Carlo simulation", " Parameters sensitivity", " Latin hypercube sampling", " Kinematic constraints", " Gait", " Joint angles", " Joint displacements"], "paper_abstract": "Sensitivity analysis is a typical part of biomechanical models evaluation. For lower limb multi-body models, sensitivity analyses have been mainly performed on musculoskeletal parameters, more rarely on the parameters of the joint models. This study deals with a global sensitivity analysis achieved on a lower limb multi-body model that introduces anatomical constraints at the ankle, tibiofemoral, and patellofemoral joints. The aim of the study was to take into account the uncertainty of parameters (e.g. 2.5 cm on the positions of the skin markers embedded in the segments, 5A degrees on the orientation of hinge axis, 2.5 mm on the origin and insertion of ligaments) using statistical distributions and propagate it through a multi-body optimisation method used for the computation of joint kinematics from skin markers during gait. This will allow us to identify the most influential parameters on the minimum of the objective function of the multi-body optimisation (i.e. the sum of the squared distances between measured and model-determined skin marker positions) and on the joint angles and displacements. To quantify this influence, a Fourier-based algorithm of global sensitivity analysis coupled with a Latin hypercube sampling is used. This sensitivity analysis shows that some parameters of the motor constraints, that is to say the distances between measured and model-determined skin marker positions, and the kinematic constraints are highly influencing the joint kinematics obtained from the lower limb multi-body model, for example, positions of the skin markers embedded in the shank and pelvis, parameters of the patellofemoral hinge axis, and parameters of the ankle and tibiofemoral ligaments. The resulting standard deviations on the joint angles and displacements reach 36A degrees and 12 mm. Therefore, personalisation, customisation or identification of these most sensitive parameters of the lower limb multi-body models may be considered as essential.", "paper_title": "Global sensitivity analysis of the joint kinematics during gait to the parameters of a lower limb multi-body model", "paper_id": "WOS:000354638900008"}