{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "complexity_theory"}, {"score": 0.04987325282958323, "phrase": "local_distributed_computing"}, {"score": 0.041249335817538986, "phrase": "local_decision"}, {"score": 0.004732785510739708, "phrase": "distributed_network_algorithms_concerns"}, {"score": 0.004612147352416241, "phrase": "considerable_progress"}, {"score": 0.004592340708764929, "phrase": "research_efforts"}, {"score": 0.004494570360108983, "phrase": "solid_basis"}, {"score": 0.0044369056710423065, "phrase": "fundamental_computational_complexity_theory"}, {"score": 0.004379977556546879, "phrase": "sequential_complexity_theory"}, {"score": 0.004305203085016233, "phrase": "distributed_decision_problems"}, {"score": 0.004213519983188574, "phrase": "decision_problem"}, {"score": 0.004053362743156545, "phrase": "specified_language"}, {"score": 0.004009960647367763, "phrase": "standard_local_model"}, {"score": 0.0038825121288253435, "phrase": "decision_problems"}, {"score": 0.0037834649508375544, "phrase": "intriguing_question"}, {"score": 0.003531474887552889, "phrase": "randomized_algorithm"}, {"score": 0.0034786213348289596, "phrase": "correct_instances"}, {"score": 0.0034118234596993836, "phrase": "incorrect_ones"}, {"score": 0.0027562922015667377, "phrase": "hereditary_languages"}, {"score": 0.002668582249630492, "phrase": "function_t"}, {"score": 0.002437525632451029, "phrase": "classical_computational_complexity_theory"}, {"score": 0.0021789194955896124, "phrase": "constant_time"}, {"score": 0.00213702549310143, "phrase": "local_reduction"}, {"score": 0.0021049977753042253, "phrase": "completeness_results"}], "paper_keywords": ["Algorithms", " Theory", " Reliability", " Local distributed algorithms", " local decision", " nondeterminism", " randomized algorithms", " oracle"], "paper_abstract": "A central theme in distributed network algorithms concerns understanding and coping with the issue of locality. Yet despite considerable progress, research efforts in this direction have not yet resulted in a solid basis in the form of a fundamental computational complexity theory for locality. Inspired by sequential complexity theory, we focus on a complexity theory for distributed decision problems. In the context of locality, solving a decision problem requires the processors to independently inspect their local neighborhoods and then collectively decide whether a given global input instance belongs to some specified language. We consider the standard LOCAL model of computation and define LD(t) (for local decision) as the class of decision problems that can be solved in t communication rounds. We first study the intriguing question of whether randomization helps in local distributed computing, and to what extent. Specifically, we define the corresponding randomized class BPLD(t, p, q), containing all languages for which there exists a randomized algorithm that runs in t rounds, accepts correct instances with probability at least p, and rejects incorrect ones with probability at least q. We show that p(2) + q = 1 is a threshold for the containment of LD(t) in BPLD(t, p, q). More precisely, we show that there exists a language that does not belong to LD(t) for any t = o(n) but does belong to BPLD(0, p, q) for any p, q is an element of (0, 1] such that p(2) + q <= 1. On the other hand, we show that, restricted to hereditary languages, BPLD(t, p, q) = LD(O(t)), for any function t, and any p, q is an element of (0, 1] such that p(2) + q > 1. In addition, we investigate the impact of nondeterminism on local decision, and establish several structural results inspired by classical computational complexity theory. Specifically, we show that nondeterminism does help, but that this help is limited, as there exist languages that cannot be decided locally nondeterministically. Perhaps surprisingly, it turns out that it is the combination of randomization with nondeterminism that enables to decide all languages in constant time. Finally, we introduce the notion of local reduction, and establish a couple of completeness results.", "paper_title": "Towards a Complexity Theory for Local Distributed Computing", "paper_id": "WOS:000326321500006"}