{"auto_keywords": [{"score": 0.028663974434608976, "phrase": "idms"}, {"score": 0.011931984363820878, "phrase": "multimedia_services"}, {"score": 0.00481495049065317, "phrase": "media_consumption_model"}, {"score": 0.004734448316824488, "phrase": "passive_and_isolated_activity"}, {"score": 0.004519908617935935, "phrase": "interactive_social_applications"}, {"score": 0.0044630962990919775, "phrase": "synchronous_communications"}, {"score": 0.004171891198117434, "phrase": "dynamic_shared_media_experiences"}, {"score": 0.004102096151528319, "phrase": "new_model"}, {"score": 0.003738502710504415, "phrase": "common_virtual_networked_environment"}, {"score": 0.003479692058963528, "phrase": "simultaneous_media_content_consumption"}, {"score": 0.003117986133774198, "phrase": "inter-destination_multimedia_synchronization"}, {"score": 0.0029764767329116875, "phrase": "increasing_popularity"}, {"score": 0.002951444412262927, "phrase": "social_networking"}, {"score": 0.002889778121878728, "phrase": "multimedia_synchronization"}, {"score": 0.0027819985260847577, "phrase": "social_tv"}, {"score": 0.0022051664509486206, "phrase": "relevant_organizations"}, {"score": 0.0021590588269751816, "phrase": "etsi_tispan"}, {"score": 0.0021408862709571615, "phrase": "ietf_avtcore_group"}, {"score": 0.0021049977753042253, "phrase": "idms_standardization"}], "paper_keywords": ["Multimedia synchronization", " IDMS", " Multipoint synchronization", " RTP/RTCP", " Standardization"], "paper_abstract": "Traditionally, the media consumption model has been a passive and isolated activity. However, the advent of media streaming technologies, interactive social applications, and synchronous communications, as well as the convergence between these three developments, point to an evolution towards dynamic shared media experiences. In this new model, geographically distributed groups of consumers, independently of their location and the nature of their end-devices, can be immersed in a common virtual networked environment in which they can share multimedia services, interact and collaborate in real-time within the context of simultaneous media content consumption. In most of these multimedia services and applications, apart from the well-known intra and inter-stream synchronization techniques that are important inside the consumers' playout devices, also the synchronization of the playout processes between several distributed receivers, known as multipoint, group or Inter-destination multimedia synchronization (IDMS), becomes essential. Due to the increasing popularity of social networking, this type of multimedia synchronization has gained in popularity in recent years. Although Social TV is perhaps the most prominent use case in which IDMS is useful, in this paper we present up to 19 use cases for IDMS, each one having its own synchronization requirements. Different approaches used in the (recent) past by researchers to achieve IDMS are described and compared. As further proof of the significance of IDMS nowadays, relevant organizations' (such as ETSI TISPAN and IETF AVTCORE Group) efforts on IDMS standardization (in which authors have been and are participating actively), defining architectures and protocols, are summarized.", "paper_title": "Inter-destination multimedia synchronization: schemes, use cases and standardization", "paper_id": "WOS:000310323200002"}