{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "minimum_degree"}, {"score": 0.004634459424542272, "phrase": "degree_contractibility_problem"}, {"score": 0.00401560412621627, "phrase": "degree_contractibility"}, {"score": 0.0033166379485150507, "phrase": "input_graph"}, {"score": 0.0031921317979928406, "phrase": "edge_weighting"}, {"score": 0.00305762327908599, "phrase": "weighted_degree_contractibility_problem"}, {"score": 0.0029711052657054463, "phrase": "weighted_graph_g"}, {"score": 0.002887028262617443, "phrase": "weighted_graph"}, {"score": 0.002859533151305368, "phrase": "minimum_weighted_degree"}, {"score": 0.0026625601693401266, "phrase": "np"}, {"score": 0.002327648608736437, "phrase": "minimal_edge-cut"}, {"score": 0.0022188370388602813, "phrase": "parameterized_complexity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "The DEGREE CONTRACTIBILITY problem is to test whether a given graph G can be modified to a graph of minimum degree at least d by using at most k contractions. We prove the following three results. First, DEGREE CONTRACTIBILITY is NP-complete even when d = 14. Second, it is fixed-parameter tractable when parameterized by k and d. Third, it is W[1]-hard when parameterized by k. We also study its variant where the input graph is weighted, i.e., has some edge weighting and the contractions preserve these weights. The WEIGHTED DEGREE CONTRACTIBILITY problem is to test if a weighted graph G can be contracted to a weighted graph of minimum weighted degree at least d by using at most k weighted contractions. We show that this problem is NP-complete and that it is fixed-parameter tractable when parameterized by k. In addition, we pinpoint a relationship with the problem of finding a minimal edge-cut of maximum size in a graph and study the parameterized complexity of this problem and its variants. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Increasing the minimum degree of a graph by contractions", "paper_id": "WOS:000318135200007"}