{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "efficient_fault_characterization"}, {"score": 0.004772593750252861, "phrase": "complex_configuration_spaces"}, {"score": 0.004388252997694986, "phrase": "wide_variety"}, {"score": 0.004311352359122141, "phrase": "usage_scenarios"}, {"score": 0.003410565849262162, "phrase": "high_probability"}, {"score": 0.003365598242636633, "phrase": "specific_configuration_options"}, {"score": 0.0033212215487678854, "phrase": "specific_settings"}, {"score": 0.003080548510001051, "phrase": "configuration_subspaces"}, {"score": 0.0027700855441353165, "phrase": "configuration_space"}, {"score": 0.002697474061842142, "phrase": "mathematical_objects"}, {"score": 0.0024688710065898646, "phrase": "sampling_strategy"}, {"score": 0.002447101794397243, "phrase": "fault_characterization_accuracy"}, {"score": 0.0023724065150232897, "phrase": "covering_arrays"}, {"score": 0.002320449502337321, "phrase": "option-related_failures"}], "paper_keywords": ["software testing", " distributed continuous quality assurance", " fault characterization", " covering arrays"], "paper_abstract": "Many modern software systems are designed to be highly configurable so they can run on and be optimized for a wide variety of platforms and usage scenarios. Testing such systems is difficult because, in effect, you are testing a multitude of systems, not just one. Moreover, bugs can and do appear in some configurations, but not in others. Our research focuses on a subset of these bugs that are \"option-related\"-those that manifest with high probability only when specific configuration options take on specific settings. Our goal is not only to detect these bugs, but also to automatically characterize the configuration subspaces (i.e., the options and their settings) in which they manifest. To improve efficiency, our process tests only a sample of the configuration space, which we obtain from mathematical objects called covering arrays. This paper compares two different kinds of covering arrays for this purpose and assesses the effect of sampling strategy on fault characterization accuracy. Our results strongly suggest that sampling via covering arrays allows us to characterize option-related failures nearly as well as if we had tested exhaustively, but at a much lower cost. We also provide guidelines for using our approach in practice.", "paper_title": "Covering Arrays for efficient fault characterization in complex configuration spaces", "paper_id": "WOS:000234756700002"}