{"auto_keywords": [{"score": 0.0312702430794085, "phrase": "diary_study"}, {"score": 0.029063297113478832, "phrase": "current_research"}, {"score": 0.00481495049065317, "phrase": "social_interaction"}, {"score": 0.004769958800452922, "phrase": "mobile_information"}, {"score": 0.0046593017130868, "phrase": "increasing_importance"}, {"score": 0.00461575768501871, "phrase": "social_media"}, {"score": 0.0045726187330434025, "phrase": "people's_lives"}, {"score": 0.00440403952059725, "phrase": "social_networking_activities"}, {"score": 0.003789395499639015, "phrase": "mobile_applications"}, {"score": 0.003322140088192527, "phrase": "information_seeking"}, {"score": 0.003110515172439764, "phrase": "people's_social_interaction_behavior"}, {"score": 0.0028986672783671147, "phrase": "tourists'_social_interaction"}, {"score": 0.002765490759189057, "phrase": "diary_study_findings"}, {"score": 0.0025290375256888883, "phrase": "information-seeking_process"}, {"score": 0.0024586427394152196, "phrase": "social_collaboration_patterns"}], "paper_keywords": ["information seeking", " user studies", " information infrastructure"], "paper_abstract": "With the increasing importance of social media in people's lives, more mobile applications have incorporated features to support social networking activities. These applications enable communication between people, using features such as chatting and blogging. There is, however, little consideration of the collaboration between people during information seeking. Mobile applications should support the seeking, sharing, confirming, and validating of information systematically to help users complete their tasks and fulfill their information needs. To support information seeking, especially collaboratively as a group, there is a need to understand people's social interaction behavior. Using tourism as a domain, we conducted a diary study to look into tourists' social interaction during information seeking. Further, based on the diary study findings and current research, we describe a set of triggers that lead to collaboration for each step in the information-seeking process. Here we present the social collaboration patterns between tourists and the people around them. Further, based on a diary study and current research, we describe a set of triggers that lead to collaboration for each step in the BIG6 information-seeking process.", "paper_title": "A study of social interaction during mobile information seeking", "paper_id": "WOS:000361184500005"}