{"auto_keywords": [{"score": 0.0376801493962264, "phrase": "enterprise_applications"}, {"score": 0.010366870504631599, "phrase": "hybrid_migration_approach"}, {"score": 0.008103566717577648, "phrase": "security_policies"}, {"score": 0.00481495049065317, "phrase": "beneficial_migration_of_enterprise_applications"}, {"score": 0.004526129302830441, "phrase": "enterprise_services"}, {"score": 0.0044863018460183784, "phrase": "hybrid_cloud-based_deployments"}, {"score": 0.004070573090297285, "phrase": "cloud-based_architectures"}, {"score": 0.003999217176949845, "phrase": "application_performance_requirements"}, {"score": 0.003946519058822334, "phrase": "privacy_restrictions"}, {"score": 0.00342568771304873, "phrase": "application_components"}, {"score": 0.0030942116765996426, "phrase": "account_enterprise-specific_constraints"}, {"score": 0.0027700855441353165, "phrase": "real_enterprise_applications"}, {"score": 0.0027456676902333304, "phrase": "azure-based_cloud_deployments"}, {"score": 0.0024148064819862337, "phrase": "data_centers"}, {"score": 0.0023307492812556204, "phrase": "assurable_reconfiguration"}, {"score": 0.0021049977753042253, "phrase": "realistic_migration_scenarios"}], "paper_keywords": ["Algorithms", " Design", " Experimentation", " Management", " Performance", " Security", " Cloud Computing", " Enterprise Applications", " Security Policies", " Performance Modeling", " Network Configurations"], "paper_abstract": "In this paper, we tackle challenges in migrating enterprise services into hybrid cloud-based deployments, where enterprise operations are partly hosted on-premise and partly in the cloud. Such hybrid architectures enable enterprises to benefit from cloud-based architectures, while honoring application performance requirements, and privacy restrictions on what services may be migrated to the cloud. We make several contributions. First, we highlight the complexity inherent in enterprise applications today in terms of their multi-tiered nature, large number of application components, and interdependencies. Second, we have developed a model to explore the benefits of a hybrid migration approach. Our model takes into account enterprise-specific constraints, cost savings, and increased transaction delays and wide-area communication costs that may result from the migration. Evaluations based on real enterprise applications and Azure-based cloud deployments show the benefits of a hybrid migration approach, and the importance of planning which components to migrate. Third, we shed insight on security policies associated with enterprise applications in data centers. We articulate the importance of ensuring assurable reconfiguration of security policies as enterprise applications are migrated to the cloud. We present algorithms to achieve this goal, and demonstrate their efficacy on realistic migration scenarios.", "paper_title": "Cloudward Bound: Planning for Beneficial Migration of Enterprise Applications to the Cloud", "paper_id": "WOS:000284879800022"}