{"auto_keywords": [{"score": 0.030956458222884953, "phrase": "supply_chain_management"}, {"score": 0.023227301113361, "phrase": "intellectual_structure"}, {"score": 0.005329122556888879, "phrase": "bullwhip_effect"}, {"score": 0.005216522023092498, "phrase": "supply_chain"}, {"score": 0.004389089062127892, "phrase": "supply_chain_management_area"}, {"score": 0.004265760046406154, "phrase": "co-citation_method"}, {"score": 0.0038606630003037864, "phrase": "web_of_science_online_database"}, {"score": 0.003569451476205552, "phrase": "document_co-citation_analysis"}, {"score": 0.0033001333942688778, "phrase": "chain_management_research"}, {"score": 0.002702533295679686, "phrase": "scm"}, {"score": 0.0026452734009203764, "phrase": "research_priorities"}, {"score": 0.002309754152767196, "phrase": "performance_measurement"}, {"score": 0.0021049977753042253, "phrase": "effective_performance_measurements"}], "paper_keywords": ["Supply chain management (SCM)", " Intellectual structure", " Document co-citation", " Classification"], "paper_abstract": "The purpose of this article is to explore the intellectual structure of supply chain management area by employing a co-citation method. Data was collected (4652 articles and 145,242 references) from the Web of Science online database. Author productivity and 41 frequently cited articles were identified through citation and document co-citation analysis. The result of this study identified four core topics to supply chain management research: sustainable supply chain management, strategic competition, value of information, and development of supply chain management. This study illustrates the shift in the intellectual structure of SCM, indicating research priorities, such as sustainability in supply chain management, relationships among organisations, the bullwhip effect within the supply chain, and performance measurement in supply chain management. This study implies that managers should expend effort formulating effective performance measurements in supply chain management and share information within the supply chain to mitigate the bullwhip effect.", "paper_title": "Supply chain management: exploring the intellectual structure", "paper_id": "WOS:000361992800014"}