{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "clinical_text"}, {"score": 0.022622638044511176, "phrase": "ill-formed_sentences"}, {"score": 0.007621425240760573, "phrase": "inter-annotator_agreement_rates"}, {"score": 0.0043533862892678864, "phrase": "new_approach"}, {"score": 0.004195421335499157, "phrase": "treebank"}, {"score": 0.003975781274672803, "phrase": "similar_interest"}, {"score": 0.003922685601503529, "phrase": "random_samples"}, {"score": 0.0038833278847237858, "phrase": "shared_natural_language_processing_challenge_dataset"}, {"score": 0.0037930162319613856, "phrase": "domain-customized_syntactic_parsing_guidelines"}, {"score": 0.0036676174658755683, "phrase": "special_considerations"}, {"score": 0.003110396267535251, "phrase": "clinical_sentences"}, {"score": 0.002957327365538023, "phrase": "f-measure_agreement_rate"}, {"score": 0.002907992115184249, "phrase": "intra-annotator_rate"}, {"score": 0.0028498718992429825, "phrase": "final_independent_set"}, {"score": 0.002783527398566117, "phrase": "progress_notes"}, {"score": 0.0027370835853738626, "phrase": "domain-specific_linguistic_features"}, {"score": 0.00267335773670308, "phrase": "combined_general_english"}, {"score": 0.0024493494346360415, "phrase": "syntactic_annotations"}, {"score": 0.002282166507956957, "phrase": "high_intra-"}, {"score": 0.0021263705039915198, "phrase": "statistical_parser"}, {"score": 0.0021049977753042253, "phrase": "moderate_accuracy"}], "paper_keywords": ["natural language processing", " syntactic parsing", " annotation guidelines", " corpus development"], "paper_abstract": "Objective To develop, evaluate, and share: (1) syntactic parsing guidelines for clinical text, with a new approach to handling ill-formed sentences; and (2) a clinical Treebank annotated according to the guidelines. To document the process and findings for readers with similar interest. Methods Using random samples from a shared natural language processing challenge dataset, we developed a handbook of domain-customized syntactic parsing guidelines based on iterative annotation and adjudication between two institutions. Special considerations were incorporated into the guidelines for handling ill-formed sentences, which are common in clinical text. Intra- and inter-annotator agreement rates were used to evaluate consistency in following the guidelines. Quantitative and qualitative properties of the annotated Treebank, as well as its use to retrain a statistical parser, were reported. Results A supplement to the Penn Treebank II guidelines was developed for annotating clinical sentences. After three iterations of annotation and adjudication on 450 sentences, the annotators reached an F-measure agreement rate of 0.930 (while intra-annotator rate was 0.948) on a final independent set. A total of 1100 sentences from progress notes were annotated that demonstrated domain-specific linguistic features. A statistical parser retrained with combined general English (mainly news text) annotations and our annotations achieved an accuracy of 0.811 (higher than models trained purely with either general or clinical sentences alone). Both the guidelines and syntactic annotations are made available at https://sourceforge.net/projects/medicaltreebank. Conclusions We developed guidelines for parsing clinical text and annotated a corpus accordingly. The high intra- and inter-annotator agreement rates showed decent consistency in following the guidelines. The corpus was shown to be useful in retraining a statistical parser that achieved moderate accuracy.", "paper_title": "Syntactic parsing of clinical text: guideline and corpus development with handling ill-formed sentences", "paper_id": "WOS:000325557600023"}