{"auto_keywords": [{"score": 0.04907561130245922, "phrase": "sensor_networks"}, {"score": 0.014304416139631007, "phrase": "network_lifetime"}, {"score": 0.01016426429810851, "phrase": "uav"}, {"score": 0.00481495049065317, "phrase": "uav_recharging_opportunities"}, {"score": 0.004590820632326585, "phrase": "unmanned_aerial_vehicles"}, {"score": 0.004447201233380302, "phrase": "possible_method"}, {"score": 0.0037935066882208235, "phrase": "field_experiments"}, {"score": 0.0030039966201398966, "phrase": "sensor_node_battery_capacity"}, {"score": 0.0029098743621130004, "phrase": "maximum_benefit"}, {"score": 0.0027741761880779535, "phrase": "lowest_powered_node"}, {"score": 0.002468450551616404, "phrase": "sensor_network"}, {"score": 0.0024037949232582462, "phrase": "sink_selection"}, {"score": 0.002328434471939886, "phrase": "network_size_increases"}, {"score": 0.002279508335630797, "phrase": "static_approach"}, {"score": 0.0021049977753042253, "phrase": "future_use"}], "paper_keywords": [""], "paper_abstract": "Recharging sensor networks using Unmanned Aerial Vehicles (UAVs) provides a possible method for increasing network lifetime. In this paper, we evaluate that approach, determining how much of a benefit it provides and under what conditions. We base our simulations and field experiments on data collected from charging with our UAV-based wireless power transfer system, which has similar transfer ranges and efficiencies as other such systems. We determine that a UAV can increase the network lifetime up to 290% compared to no recharging, that the UAV should recharge 30% of the sensor node battery capacity at one time for the maximum benefit, and that the UAV should recharge the lowest powered node until the network reaches a size of approximately 306 nodes at which point it should recharge the sink. We also examine how the sensor network can aid this through sink selection. The policy varies as network size increases, with a static approach working well until 200 nodes, and then either a perimeter or heuristic approach works best. These results inform future use of UAVs in recharging and working with sensor networks.", "paper_title": "UAV Recharging Opportunities and Policies for Sensor Networks", "paper_id": "WOS:000360171200001"}