{"auto_keywords": [{"score": 0.04737221378279657, "phrase": "distributional_semantic_models"}, {"score": 0.00481495049065317, "phrase": "semantic_models"}, {"score": 0.00446820572467064, "phrase": "existing_resources"}, {"score": 0.004304271837157217, "phrase": "gold_standards"}, {"score": 0.00381570676777605, "phrase": "freud"}, {"score": 0.003721735062704032, "phrase": "low_rating"}, {"score": 0.0032446544415922615, "phrase": "conceptual_association"}, {"score": 0.0031254704616199614, "phrase": "concrete_and_abstract_adjective"}, {"score": 0.0029857124153761187, "phrase": "independent_rating"}, {"score": 0.00284034646798833, "phrase": "fine-grained_analyses"}, {"score": 0.002735972929840289, "phrase": "different_types"}, {"score": 0.002559775585192185, "phrase": "existing_gold_standard_evaluations"}, {"score": 0.002517524071220657, "phrase": "automatic_approaches"}, {"score": 0.0024554476124885806, "phrase": "inter-annotator_agreement_ceiling"}, {"score": 0.0022036216160494925, "phrase": "future_improvements"}, {"score": 0.0021225958499898182, "phrase": "next_generation"}, {"score": 0.0021049977753042253, "phrase": "representation-learning_architectures"}], "paper_keywords": [""], "paper_abstract": "We present SimLex-999, a gold standard resource for evaluating distributional semantic models that improves on existing resources in several important ways. First, in contrast to gold standards such as WordSim-353 and MEN, it explicitly quantifies similarity rather than association or relatedness so that pairs of entities that are associated but not actually similar (Freud, psychology) have a low rating. We show that, via this focus on similarity, SimLex-999 incentivizes the development of models with a different, and arguably wider, range of applications than those which reflect conceptual association. Second, SimLex-999 contains a range of concrete and abstract adjective, noun, and verb pairs, together with an independent rating of concreteness and (free) association strength for each pair. This diversity enables fine-grained analyses of the performance of models on concepts of different types, and consequently greater insight into how architectures can be improved. Further, unlike existing gold standard evaluations, for which automatic approaches have reached or surpassed the inter-annotator agreement ceiling, state-of-the-art models perform well below this ceiling on SimLex-999. There is therefore plenty of scope for SimLex-999 to quantify future improvements to distributional semantic models, guiding the development of the next generation of representation-learning architectures.", "paper_title": "SimLex-999: Evaluating Semantic Models With (Genuine) Similarity Estimation", "paper_id": "WOS:000367813400004"}