{"auto_keywords": [{"score": 0.04523828542897125, "phrase": "original_mc_algorithm"}, {"score": 0.031042443925142032, "phrase": "mc_algorithm"}, {"score": 0.013399231881524738, "phrase": "surface_extraction_process"}, {"score": 0.011196368871388382, "phrase": "vertex_identification_process"}, {"score": 0.004665764181113345, "phrase": "voxel-based_objects"}, {"score": 0.0042452552248398445, "phrase": "vertex_calculations"}, {"score": 0.003757480190200645, "phrase": "mc_vertices"}, {"score": 0.0030017207229983385, "phrase": "vertex_array"}, {"score": 0.002966438503447793, "phrase": "resultant_triangle_data"}, {"score": 0.0028630535573013686, "phrase": "hash_table_mechanism"}, {"score": 0.002594342451017822, "phrase": "interesting_features"}, {"score": 0.0023600807990911145, "phrase": "gmc_algorithm"}, {"score": 0.002259883463607508, "phrase": "hash_table"}, {"score": 0.0022333012657436307, "phrase": "significant_advantage"}, {"score": 0.0022157698485209595, "phrase": "gmc"}, {"score": 0.0021049977753042253, "phrase": "overall_performance"}], "paper_keywords": ["marching cube algorithm", " iso-surface detection", " surface rendering", " speed-up", " interactive applications"], "paper_abstract": "Although the Marching Cube (MC) algorithm is very popular for displaying images of voxel-based objects, its slow surface extraction process is usually considered to be one of its major disadvantages. It was pointed out that for the original MC algorithm, we can limit vertex calculations to once per vertex to speed up the surface extraction process, however, it did not mention how this process could be done efficiently. Neither was the reuse of these MC vertices looked into seriously in the literature. In this paper, we propose a \"Group Marching Cube\" (GMC) algorithm, to reduce the time needed for the vertex identification process, which is part of the surface extraction process. Since most of the triangle-vertices of an iso-surface are shared by many MC triangles, the vertex identification process can avoid the duplication of the vertices in the vertex array of the resultant triangle data. The MC algorithm is usually done through a hash table mechanism proposed in the literature and used by many software systems. Our proposed GMC algorithm considers a group of voxels simultaneously for the application of the MC algorithm to explore interesting features of the original MC algorithm that have not been discussed in the literature. Based on our experiments, for an object with more than 1 million vertices, the GMC algorithm is 3 to more than 10 times faster than the algorithm using a hash table. Another significant advantage of GMC is its compatibility with other algorithms that accelerate the MC algorithm. Together, the overall performance of the original MC algorithm is promoted even further.", "paper_title": "A \"Group Marching Cube\" (GMC) Algorithm for Speeding up the Marching Cube Algorithm", "paper_id": "WOS:000292480800023"}