{"auto_keywords": [{"score": 0.04782041185401739, "phrase": "interaction_techniques"}, {"score": 0.04381652051820687, "phrase": "graphical_properties"}, {"score": 0.00481495049065317, "phrase": "network_visualizations"}, {"score": 0.004637478829869904, "phrase": "extensible_set"}, {"score": 0.00409895142748329, "phrase": "traditional_rectangle"}, {"score": 0.004055176557424983, "phrase": "lasso_selection"}, {"score": 0.0039055990919333082, "phrase": "node's_neighbourhood"}, {"score": 0.0036815763368083197, "phrase": "novel_kind"}, {"score": 0.0036422425344358037, "phrase": "radial_menu"}, {"score": 0.0032888418378433037, "phrase": "layout_patterns"}, {"score": 0.0029221312451219203, "phrase": "novel_ways"}, {"score": 0.0023189818169615135, "phrase": "interactive_graph_visualization"}, {"score": 0.0022453485299093576, "phrase": "navigator"}, {"score": 0.0021392418081444798, "phrase": "biological_networks"}, {"score": 0.0021049977753042253, "phrase": "initial_usability_study"}], "paper_keywords": ["Interactive graph drawing", " network layout", " radial menus", " marking menus", " hotbox", " biological networks"], "paper_abstract": "We present a novel and extensible set of interaction techniques for manipulating visualizations of networks by selecting subgraphs and then applying various commands to modify their layout or graphical properties. Our techniques integrate traditional rectangle and lasso selection, and also support selecting a node's neighbourhood by dragging out its radius (in edges) using a novel kind of radial menu. Commands for translation, rotation, scaling, or modifying graphical properties (such as opacity) and layout patterns can be performed by using a hotbox (a transiently popped-up, semi-transparent set of widgets) that has been extended in novel ways to integrate specification of commands with 1D or 2D arguments. Our techniques require only one mouse button and one keyboard key, and are designed for fast, gestural, in-place interaction. We present the design and integration of these interaction techniques, and illustrate their use in interactive graph visualization. Our techniques are implemented in NAViGaTOR, a software package for visualizing and analyzing biological networks. An initial usability study is also reported.", "paper_title": "Interaction Techniques for Selecting and Manipulating Subgraphs in Network Visualizations", "paper_id": "WOS:000270778900013"}