{"auto_keywords": [{"score": 0.04050972396351146, "phrase": "ovarian_cancer"}, {"score": 0.010177321726040002, "phrase": "human_ovarian_cdna_expression_database"}, {"score": 0.00481495049065317, "phrase": "human_cdna_expressions"}, {"score": 0.004764542405129454, "phrase": "ovarian_carcinoma."}, {"score": 0.004426092397211699, "phrase": "different_pathological_stages"}, {"score": 0.0043797373807446015, "phrase": "ovarian_carcinoma"}, {"score": 0.004068510313497539, "phrase": "normal_ovarian_tumors"}, {"score": 0.0035477930970463432, "phrase": "pathological_sample"}, {"score": 0.003492155652400838, "phrase": "large_number"}, {"score": 0.0032609360162842767, "phrase": "linear_regression"}, {"score": 0.0028432828877281388, "phrase": "support_vector_machine"}, {"score": 0.002697245874076643, "phrase": "pathological_stages"}, {"score": 0.002640947693258573, "phrase": "experimental_results"}, {"score": 0.0025994945418484935, "phrase": "average_accuracy"}, {"score": 0.002518525107994039, "phrase": "cross_validation"}, {"score": 0.0024529757621396717, "phrase": "related_scientific_literatures"}, {"score": 0.002266364679369248, "phrase": "discovered_oncogenes"}, {"score": 0.002207363758847308, "phrase": "different_cancers"}], "paper_keywords": ["Ovarian cancer", " Oncogenes", " Gene expression analysis", " Microarray database", " Support vector machine"], "paper_abstract": "In this paper, the human ovarian cDNA expression database is analyzed for discriminating oncogenes according to different pathological stages of ovarian carcinoma. The human ovarian cDNA expression database of this paper collects 41 patient samples, which includes 13 samples at normal ovarian tumors, 6 samples of borderline of cancers, 7 samples of ovarian cancer at stage I and 15 samples of ovarian cancer at stage III. Due to 9,600 genes of each pathological sample, a large number of genes are analyzed and discovered difficulty. For this reason, linear regression and analysis of variance (ANOVA) are used to discover and detect 21 notable oncogenes. Further more, these 21 notable oncogenes are divided and examined by support vector machine (SVM) with 5 different classifications according to their gene expressions of pathological stages. From the experimental results, the average accuracy of 5 classification experiments is 89% in cross validation. Moreover, the related scientific literatures also indicate these 21 discovered oncogenes are related to ovarian cancer or other cancers. It proves these discovered oncogenes are highly related to different cancers. Finally, this paper also develops a graphical user interface (GUI) bio-statistical system for gene expression analysis to assist doctors and pathologists to analyze and diagnose ovarian cancer.", "paper_title": "STATISTICAL AND SVM-BASED ONCOGENE DETECTION OF HUMAN CDNA EXPRESSIONS FOR OVARIAN CARCINOMA", "paper_id": "WOS:000271036900020"}