{"auto_keywords": [{"score": 0.04175901637800701, "phrase": "geriatric_hospital"}, {"score": 0.04100375147158351, "phrase": "experimental_phase"}, {"score": 0.015141266214579667, "phrase": "elderly_patients"}, {"score": 0.012956662574710143, "phrase": "tertiary_care_hospital"}, {"score": 0.010815667909131738, "phrase": "health_professionals"}, {"score": 0.009806147039635662, "phrase": "project_manager"}, {"score": 0.00481495049065317, "phrase": "professional_practice"}, {"score": 0.004680017254532154, "phrase": "specialty_services"}, {"score": 0.004662312852150651, "phrase": "isolated_patients"}, {"score": 0.004618342952383313, "phrase": "geriatric_hospitals"}, {"score": 0.004480394224548146, "phrase": "clinical_practice"}, {"score": 0.004387941623399719, "phrase": "technical_issues"}, {"score": 0.00437133728403964, "phrase": "qualitative_research"}, {"score": 0.004313713204732449, "phrase": "medical_practice"}, {"score": 0.004153207234462926, "phrase": "qualitative_methods"}, {"score": 0.004106225442735525, "phrase": "professional_work_practices"}, {"score": 0.004059772950454586, "phrase": "initially_experimental_and_then_permanent_teleconsultation_system"}, {"score": 0.003945918751546262, "phrase": "sixty-six_teleconsultations"}, {"score": 0.0038498211283780484, "phrase": "routine_use"}, {"score": 0.003813484415231187, "phrase": "ten_semi-structured_interviews"}, {"score": 0.0036784938661226104, "phrase": "teleconsultation_affected_work_practices"}, {"score": 0.0034881908940439213, "phrase": "face-to-face_setting"}, {"score": 0.0034552556051592595, "phrase": "clinical_examination"}, {"score": 0.0034096661914349577, "phrase": "specific_form"}, {"score": 0.0033265846725035785, "phrase": "new_kinds"}, {"score": 0.002974171397771052, "phrase": "important_work"}, {"score": 0.0028095140358025, "phrase": "geriatrician's_schedule"}, {"score": 0.0027935567950925855, "phrase": "added_presence"}, {"score": 0.002638872231303218, "phrase": "main_advantage"}, {"score": 0.002613935123129054, "phrase": "teleconsultation_system"}, {"score": 0.002540525253747007, "phrase": "improved_care"}, {"score": 0.002497470177389344, "phrase": "required_effort"}, {"score": 0.002418119940592565, "phrase": "coordination_work"}, {"score": 0.0023636270935286047, "phrase": "favourable_context"}, {"score": 0.0021617392821644005, "phrase": "new_forms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Teleconsultation", " The elderly", " Geriatrics", " Specialists", " Clinical practice", " Professional work practices", " Care organisation"], "paper_abstract": "Teleconsultations in medicine are encouraged by authorities and decision-makers to improve access to specialty services for isolated patients. For elderly patients in geriatric hospitals, they thus avoid trips to consult with specialists. However, teleconsultation can modify clinical practice and it may be abandoned for reasons not related to technical issues. Qualitative research on the impact of teleconsultation on medical practice and organisation are thus crucial for an understanding of the changes it can generate. Methods: We used qualitative methods to analyse the impact on professional work practices and care organisation of an initially experimental and then permanent teleconsultation system using a video conference system set up between a geriatric hospital and a tertiary care hospital. Sixty-six teleconsultations (56 during the experimental phase and 10 when the system was in routine use) were observed and ten semi-structured interviews were carried out with the actors in the teleconsultations. Results: Our study shows that the uses of teleconsultation affected work practices of both the consulted specialist and the geriatrician who participated in the consultation alongside the patient. The interactions of specialists with the patient were more difficult than in a face-to-face setting and delegation of the clinical examination of the patient depended on a specific form of cooperation and on trust in the person doing the examination. New kinds of relationships between health professionals contributed to sharing and transmission of knowledge between practitioners. While teleconsultations established alliances between geriatricians and specialists, they none-the-less called for a certain humility on the part of geriatricians. In order for these relationships to become routine and to facilitate interaction among participants, the project manager carried out important work during the experimental phase of the teleconsultations by organising these interactions. Finally, the teleconsultations went through several local reorganisations, especially within the geriatric hospital. These included changes in the geriatrician's schedule and the added presence of an assistant knowledgeable in telemedicine. Conclusions: Specialists found the system used for teleconsultation between a geriatric hospital and a tertiary care hospital to be suitable for their consultations. The main advantage brought about by the teleconsultation system studied resulted from its collaborative nature, which created relationships between health professionals. This resulted in improved care for elderly patients. However, using the system required effort on the part of both the specialists and the geriatricians. Adapting to the system was facilitated by coordination work carried out by the project manager during the experimental phase that created a favourable context for cooperation between actors, allowing diagnoses to be made at a distance. Finally, teleconsultations do not appear suitable for all specialties, by reason of the limits imposed on the delegation of tasks, or to all situations. They require setting up new forms of organisation that must be encouraged by decision-makers. (C) 2013 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Teleconsultation in geriatrics: Impact on professional practice", "paper_id": "WOS:000321499700005"}