{"auto_keywords": [{"score": 0.04926219622874721, "phrase": "government's_payoff"}, {"score": 0.00481495049065317, "phrase": "dynamic_payoff_reallocation"}, {"score": 0.004552981066668676, "phrase": "large_number"}, {"score": 0.004231699728933577, "phrase": "total_payoff"}, {"score": 0.003916098498242888, "phrase": "comprehensive_perspective"}, {"score": 0.0035620354052144656, "phrase": "replicator_dynamics"}, {"score": 0.003170811465728631, "phrase": "desirable_target_state"}, {"score": 0.0030898642396380662, "phrase": "players'_payoffs"}, {"score": 0.0029980260560551982, "phrase": "target_state"}, {"score": 0.00295950473406239, "phrase": "government's_action"}, {"score": 0.002703327151461985, "phrase": "population_state"}, {"score": 0.0025014259919355453, "phrase": "current_population_state"}, {"score": 0.002416589459425828, "phrase": "game_player"}, {"score": 0.002150900082318562, "phrase": "government's_reallocation_strategy"}], "paper_keywords": ["replicator dynamics", " dynamic intervention", " payoff collection", " payoff reallocation"], "paper_abstract": "In a population which consists of a large number of players interacting with each other, the payoff of each player often conflicts with the total payoff of the population which he/she belongs to. In such a situation, a \"government\" which has the comprehensive perspective is needed to govern the population. Recently, to discuss the population with the government, the authors have proposed replicator dynamics with reallocation of payoffs to analyze an effect of the government. In this model, the government is willing to lead the population to a desirable target state by collecting a part of players' payoffs and reallocating them depending on the target state. The government's action is the rate of collecting payoffs from players and the rate is assumed to be constant and independent of the population state. Thus, in this paper, we suppose that the government change their intervention strategy depending on the current population state. We consider the government as a game player and define the government's payoff as a sum of a benefit and a cost of intervention. We propose a model which describes the evolution of the government's reallocation strategy and investigate stability of its equilibrium points.", "paper_title": "Replicator dynamics with dynamic payoff reallocation based on the government's payoff", "paper_id": "WOS:000259767300020"}