{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scalable_bitstreams"}, {"score": 0.014287809958422534, "phrase": "bitstream_parsing_process"}, {"score": 0.004760518730536645, "phrase": "format-agnostic_framework"}, {"score": 0.004635881163634672, "phrase": "maximum_number"}, {"score": 0.004566123591480369, "phrase": "heterogeneous_multimedia_environments"}, {"score": 0.004168986485488861, "phrase": "scalable_extension"}, {"score": 0.004075198669927074, "phrase": "format-independent_framework"}, {"score": 0.0038356043678589393, "phrase": "snr"}, {"score": 0.0037065115435101887, "phrase": "format-independent_adaptation_engine"}, {"score": 0.0034618177773967015, "phrase": "high-level_xml_descriptions"}, {"score": 0.003383884759373793, "phrase": "scalable_bitstream"}, {"score": 0.0031724417545242315, "phrase": "xml_domain"}, {"score": 0.0031127970604842375, "phrase": "current_version"}, {"score": 0.0029741713977710495, "phrase": "large_video_bitstreams"}, {"score": 0.0028851913035322415, "phrase": "increasing_memory_consumption"}, {"score": 0.0028525124381208705, "phrase": "decreasing_description_generation_speed"}, {"score": 0.002488001663771768, "phrase": "additional_extensions"}, {"score": 0.0022625835448873495, "phrase": "xml_document"}, {"score": 0.0021948455916770233, "phrase": "constant_and_low_memory_consumption"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["bitstream syntax descriptions", " content adaptation", " context-related attributes", " H.264/MPEG-4 AVC", " MPEG-21 BSDL", " scalable video coding"], "paper_abstract": "A format-agnostic framework for content adaptation allows reaching a maximum number of users in heterogeneous multimedia environments. Such a framework typically relies on the use of scalable bitstreams. In this paper, we investigate the use of bitstreams compliant with the scalable extension of the H.264/MPEG-4 AVC standard in a format-independent framework for content adaptation. These bitstreams are scalable along the temporal, spatial, and SNR axis. To adapt these bitstreams, a format-independent adaptation engine is employed, driven by the MPEG-21 Bitstream Syntax Description Language (BSDL). MPEG-21 BSDL is a specification that allows generating high-level XML descriptions of the structure of a scalable bitstream. As such, the complexity of the adaptation of scalable bitstreams can be moved to the XML domain. Unfortunately, the current version of MPEG-21 BSDL cannot be used to describe the structure of large video bitstreams because the bitstream parsing process is characterized by an increasing memory consumption and a decreasing description generation speed. Therefore, in this paper, we describe a number of extensions to the MPEG-21 BSDL specification that make it possible to optimize the processing of bitstreams. Moreover, we also introduce a number of additional extensions necessary to describe the structure of scalable H.264/AVC bitstreams. Our performance analysis demonstrates that our extensions enable the bitstream parsing process to translate the structure of the scalable bitstreams into an XML document multiple times faster. Further, a constant and low memory consumption is obtained during the bitstream parsing process. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "An optimized MPEG-21 BSDL framework for the adaptation of scalable bitstreams", "paper_id": "WOS:000247263300003"}