{"auto_keywords": [{"score": 0.036936437663822694, "phrase": "public_channel"}, {"score": 0.00481495049065317, "phrase": "multiple_access_channel"}, {"score": 0.004150661689086371, "phrase": "noisy_channel_outputs"}, {"score": 0.003989487818395848, "phrase": "one-way_public_channel"}, {"score": 0.003685604033479918, "phrase": "secret_key"}, {"score": 0.003560147211590917, "phrase": "mac"}, {"score": 0.0032563083791198534, "phrase": "secret_key_sharing"}, {"score": 0.0028768722873689432, "phrase": "inner_and_outer_bounds"}, {"score": 0.002834409847642238, "phrase": "secret_key_capacity_region"}, {"score": 0.002467038647952607, "phrase": "channel_outputs"}, {"score": 0.0021049977753042253, "phrase": "gaussian_macs"}], "paper_keywords": ["Information theoretic security", " multiple access channel (MAC)", " secret key agreement", " secret key capacity region"], "paper_abstract": "In this paper, a generalized multiple access channel (MAC) model for secret key sharing between three terminals is considered. In this model, there are two transmitters and a receiver where all three terminals receive noisy channel outputs. In addition, there is a one-way public channel from the transmitters to the receiver. Each of the transmitters intends to share a secret key with the receiver by using the MAC and the public channel, where the transmitters are eavesdroppers with respect to each other. Two strategies for secret key sharing are considered, namely, the pre-generated key strategy and the two-stage key strategy. For both of them, inner and outer bounds of the secret key capacity region are derived. Furthermore, the effect of the public channel is discussed and the two strategies are compared. In both strategies, it is assumed that the channel outputs at the transmitters are only used for eavesdropping and not as inputs to the encoders. The effect of this assumption in the presence of the public channel is analyzed for some Gaussian MACs.", "paper_title": "Key Agreement Over Multiple Access Channel", "paper_id": "WOS:000293924000025"}