{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "network_motifs"}, {"score": 0.04406294859026498, "phrase": "collaboration_network"}, {"score": 0.0047761092701293474, "phrase": "scientific_collaborations"}, {"score": 0.004737579882204798, "phrase": "collaboration_networks"}, {"score": 0.0046993598473345395, "phrase": "elegant_representations"}, {"score": 0.00453113241842654, "phrase": "scientific_community"}, {"score": 0.004298666679374568, "phrase": "local_context"}, {"score": 0.003806541299696042, "phrase": "best_representation"}, {"score": 0.003289534854212415, "phrase": "highest_longevity"}, {"score": 0.0030455297429878873, "phrase": "productivity_distribution"}, {"score": 0.0029482691362918423, "phrase": "predictive_model"}, {"score": 0.0028890603352364273, "phrase": "highly_cited_authors"}, {"score": 0.0027741761880779535, "phrase": "characteristic_features"}, {"score": 0.002526938673434697, "phrase": "classification_models"}, {"score": 0.002456148932305311, "phrase": "researcher's_career"}, {"score": 0.0022101055924375725, "phrase": "empirical_study"}, {"score": 0.00218334762335187, "phrase": "foundation_principles"}, {"score": 0.0021569129153653777, "phrase": "recommendation_system"}, {"score": 0.0021049977753042253, "phrase": "lasting_and_productive_a_given_collaboration"}], "paper_keywords": [""], "paper_abstract": "Collaboration networks are elegant representations for studying the dynamical processes that shape the scientific community. In this paper, we are particularly interested in studying the local context of a node in collaboration network that can help explain the behavior of an author as an individual within the group and a member along with the group. The best representation of such local contextual substructures in a collaboration network are \"network motifs\". In particular, we propose two fundamental goodness measures of such a group represented by a motif-productivity and longevity. We observe that while 4-semi clique motif, quite strikingly, shows highest longevity, the productivity of the 4-star and the 4-clique motifs is the largest among all the motifs. Based on the productivity distribution of the motifs, we propose a predictive model that successfully classifies the highly cited authors from the rest. Further, we study the characteristic features of motifs and show how they are related with the two goodness measures. Building on these observations, finally we propose two supervised classification models to predict, early in a researcher's career, how long the group where she belongs to will persist (longevity) and how much the group would be productive. Thus this empirical study sets the foundation principles of a recommendation system that would forecast how long lasting and productive a given collaboration could be in future.", "paper_title": "An author is known by the context she keeps: significance of network motifs in scientific collaborations", "paper_id": "WOS:000355743100016"}