{"auto_keywords": [{"score": 0.049193598318116316, "phrase": "ubiquitous_computing_environments"}, {"score": 0.010084175220804214, "phrase": "rbac"}, {"score": 0.00481495049065317, "phrase": "ca-rbac"}, {"score": 0.004770211811866158, "phrase": "context_aware_rbac_scheme"}, {"score": 0.004510336430422002, "phrase": "access_permissions"}, {"score": 0.00428451995524549, "phrase": "access_control_management"}, {"score": 0.004205226397573506, "phrase": "appropriate_roles"}, {"score": 0.0037069087922811488, "phrase": "proper_access_permissions"}, {"score": 0.003604421041893448, "phrase": "current_context"}, {"score": 0.0035376693476114733, "phrase": "important_issue"}, {"score": 0.0029069972482610403, "phrase": "detailed_context"}, {"score": 0.0025741370320813968, "phrase": "access_control_scheme"}, {"score": 0.002514625755809045, "phrase": "context_awareness"}, {"score": 0.00246800641971897, "phrase": "proper_privilege"}, {"score": 0.0021049977753042253, "phrase": "diverse_situations"}], "paper_keywords": ["role based access control", " context awareness", " ubiquitous computing", " context based access control", " personalized access control"], "paper_abstract": "Role based access control (RBAC) assigns access permissions to a role rather than a user. This simplifies access control management by simply assigning appropriate roles to users and by modifying the permissions of the roles. With the advent of ubiquitous computing, many kinds of services, especially personalized services to give convenience to users, have been introduced. Among them, providing proper access permissions to users based on the current context has become an important issue because their status and access privilege should be dynamically changed. Previously, various access control methods utilizing context awareness have been proposed; however, their constraint description methods, used to assign a role to a user, are quite complex and not enough to express detailed context. Also, they do not fully cover the various situations that can be occur red in ubiquitous computing environments. In this paper, we propose an access control scheme, combining RBAC with context awareness, to give proper privilege to users based on their current context in ubiquitous computing environments. Our scheme defines the constraints for assigning a role and modifying the permissions of each role, enabling more detailed descriptions. We also provide various access control algorithms to support diverse situations which occur in ubiquitous computing environments.", "paper_title": "CA-RBAC: Context Aware RBAC Scheme in Ubiquitous Computing Environments", "paper_id": "WOS:000282396700015"}