{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "directional_wavelets"}, {"score": 0.04904408662148987, "phrase": "separable_wavelets"}, {"score": 0.03731816460421424, "phrase": "image_compression"}, {"score": 0.004649474569983707, "phrase": "smooth_edges"}, {"score": 0.004548939310612501, "phrase": "great_interest"}, {"score": 0.004260134699483774, "phrase": "approximation_power"}, {"score": 0.004186253035932442, "phrase": "near-optimal_approximation_power"}, {"score": 0.0037361664435836845, "phrase": "nearly_optimal_transformations"}, {"score": 0.003378385493203297, "phrase": "elegant_idea"}, {"score": 0.0032054891061528896, "phrase": "state-of-the-art_image_coders"}, {"score": 0.0027620516806198354, "phrase": "edge-like_images"}, {"score": 0.0025863988422430797, "phrase": "diw"}, {"score": 0.0023180581939456686, "phrase": "diw."}, {"score": 0.002228412982799273, "phrase": "new_partitioning_scheme"}, {"score": 0.0021610874773389096, "phrase": "real-world_images"}, {"score": 0.0021049977753042253, "phrase": "proposed_partitioning_algorithm"}], "paper_keywords": ["Directional transform", " image coding", " quadtree", " rate-distortion", " wavelet transform"], "paper_abstract": "The inefficiency of separable wavelets in representing smooth edges has led to a great interest in the study of new 2-D transformations. The most popular criterion for analyzing these transformations is the approximation power. Transformations with near-optimal approximation power are useful in many applications such as denoising and enhancement. However, they are not necessarily good for compression. Therefore, most of the nearly optimal transformations such as curvelets and contourlets have not found any application in image compression yet. One of the most promising schemes for image compression is the elegant idea of directional wavelets (DIWs). While these algorithms outperform the state-of-the-art image coders in practice, our theoretical understanding of them is very limited. In this paper, we adopt the notion of rate-distortion and calculate the performance of the DIW on a class of edge-like images. Our theoretical analysis shows that if the edges are not \"sharp,\" the DIW will compress them more efficiently than the separable wavelets. It also demonstrates the inefficiency of the quadtree partitioning that is often used with the DIW. To solve this issue, we propose a new partitioning scheme called megaquad partitioning. Our simulation results on real-world images confirm the benefits of the proposed partitioning algorithm, promised by our theoretical analysis.", "paper_title": "Rate-Distortion Analysis of Directional Wavelets", "paper_id": "WOS:000300559700014"}