{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_repurchase_intention"}, {"score": 0.018578224997859154, "phrase": "adjusted_expectations"}, {"score": 0.011870676441926692, "phrase": "online_shopping_experience"}, {"score": 0.009211485013704859, "phrase": "customer_satisfaction"}, {"score": 0.006257191287132967, "phrase": "online_shopping"}, {"score": 0.0047784273577245505, "phrase": "purpose_-_the_purpose"}, {"score": 0.0042625453008146895, "phrase": "pls"}, {"score": 0.004087609837102023, "phrase": "structural_models"}, {"score": 0.003659954070354848, "phrase": "shopping_habit"}, {"score": 0.003327253821888569, "phrase": "research_findings"}, {"score": 0.0032519989404960073, "phrase": "vital_driver"}, {"score": 0.002956272941199248, "phrase": "online_shopping_habit"}, {"score": 0.002922637921202474, "phrase": "repurchase_intention"}, {"score": 0.002824005136794786, "phrase": "usage_experience"}, {"score": 0.0028025415122856973, "phrase": "spontaneous_purchases"}, {"score": 0.0027495914857929584, "phrase": "higher_customer_satisfaction"}, {"score": 0.0027286918886186245, "phrase": "customer_expectations"}, {"score": 0.002557322657104706, "phrase": "common_method_bias"}, {"score": 0.002537880772794665, "phrase": "future_studies"}, {"score": 0.002263336340041527, "phrase": "expectancy-disconfirmation_paradigm"}, {"score": 0.0021049977753042253, "phrase": "online_shoppers"}], "paper_keywords": ["Customer satisfaction", " Adjusted expectations", " Online repurchase intention", " Online shopping experience", " Online shopping habit"], "paper_abstract": "Purpose - The purpose of this paper is to investigate the effects of online shopping experience and habit in relation to adjusted expectations for enhancing online repurchase intention. Design/methodology/approach - The authors employed partial least square (PLS) as a technique used to analyze the measurement and structural models. Data for this research were collected from 240 Taiwanese online shoppers who had experienced online shopping at least four times. Findings - The result of this study indicates that online shopping habit acts as a moderator of both customer satisfaction and adjusted expectations, whereas online shopping experience can be considered a key driver for customer satisfaction. Furthermore, the research findings confirm that customer satisfaction is a vital driver of adjusted expectations and online repurchase intention. Adjusted expectations do mediate the impact of online repurchase intention. Research limitations/implications - This paper highlights the effect of online shopping experience and online shopping habit on enhancing repurchase intention. The result implies that the acquisition of usage experience and spontaneous purchases not only leads to higher customer satisfaction and customer expectations, but also strengthens online repurchase intention. The use of self-report scales suggests the possibility of a common method bias. Future studies may further test the robustness of this study in the interplay of experience and habit to shed more light on their relative importance in explaining online repurchase intention. Originality/value - This study extends expectancy-disconfirmation paradigm, especially in the context of online shopping, by emphasizing cognitive, affective, and behavioral change on the attitude-intention behavior of online shoppers.", "paper_title": "Factors affecting online repurchase intention", "paper_id": "WOS:000341781200006"}