{"auto_keywords": [{"score": 0.04962656673317322, "phrase": "compact_representations"}, {"score": 0.00481495049065317, "phrase": "compact_plan_representations"}, {"score": 0.004657542074154025, "phrase": "common_concept"}, {"score": 0.004613516457919661, "phrase": "computer_science"}, {"score": 0.004569905085027681, "phrase": "automated_planning"}, {"score": 0.004316722156877335, "phrase": "planning_instance"}, {"score": 0.004255639740735269, "phrase": "compact_implicit_representation"}, {"score": 0.003725470458263889, "phrase": "planning_instances"}, {"score": 0.0030802351224657673, "phrase": "general_case"}, {"score": 0.002854505078275351, "phrase": "efficient_sequential_or_random_access"}, {"score": 0.002382329940096419, "phrase": "positive_results"}, {"score": 0.0023485549678832628, "phrase": "restricted_cases"}, {"score": 0.0022933216359142736, "phrase": "useful_compact_representations"}, {"score": 0.0022181655497912796, "phrase": "macro_plans"}, {"score": 0.0021971473452127126, "phrase": "favourable_access_properties"}], "paper_keywords": [""], "paper_abstract": "Compact representations of objects is a common concept in computer science. Automated planning can be viewed as a case of this concept: a planning instance is a compact implicit representation of a graph and the problem is to find a path (a plan) in this graph. While the graphs themselves are represented compactly as planning instances, the paths are usually represented explicitly as sequences of actions. Some cases are known where the plans always have compact representations, for example, using macros. We show that these results do not extend to the general case, by proving a number of bounds for compact representations of plans under various criteria, like efficient sequential or random access of actions. In addition to this, we show that our results have consequences for what can be gained from reformulating planning into some other problem. As a contrast to this we also prove a number of positive results, demonstrating restricted cases where plans do have useful compact representations, as well as proving that macro plans have favourable access properties. Our results are finally discussed in relation to other relevant contexts.", "paper_title": "Algorithms and Limits for Compact Plan Representations", "paper_id": "WOS:000304405200001"}