{"auto_keywords": [{"score": 0.0483359539447573, "phrase": "public_value"}, {"score": 0.015719716506582538, "phrase": "electronic_identity_management"}, {"score": 0.013644736445230784, "phrase": "idm"}, {"score": 0.003936910716320182, "phrase": "electronic_idm"}, {"score": 0.003559733494565893, "phrase": "canada"}, {"score": 0.003522124318486352, "phrase": "new_zealand"}, {"score": 0.0033937776228549557, "phrase": "qualitative_analysis"}, {"score": 0.0030039966201398966, "phrase": "grimsley"}, {"score": 0.0029722900280316216, "phrase": "meehan"}, {"score": 0.002468450551616404, "phrase": "relational_risk"}, {"score": 0.0021847119298612264, "phrase": "national_differences"}, {"score": 0.0021274723597955567, "phrase": "european_journal"}, {"score": 0.0021049977753042253, "phrase": "information_systems"}], "paper_keywords": ["identity management", " e-ID", " e-Government", " digital identity", " public service provision"], "paper_abstract": "This paper is concerned with the issues facing stakeholders attempting to develop, implement and maintain electronic identity management (IdM) systems in government. It argues that perceptions of electronic IdM vary, and thus a single conceptualisation of the concept is difficult. Using data collected from stakeholders in 17 European countries, Canada, New Zealand and the U. S. A. from 2003 through 2007, a qualitative analysis identifies 10 dominant stakeholder areas of concern which we term 'themes'. These are then mapped onto a framework of public value due to Grimsley and Meehan which relates services to outcomes and the development of trust. We conclude by questioning the conceptualisation of trust within the context of IdM, and suggesting that considering trust as the mitigation of relational risk is more appropriate. We also consider the usefulness of public value as a notion for informing IdM and highlight the lack of national differences in our diverse data set. European Journal of Information Systems (2010) 19, 93-103. doi:10.1057/ejis.2009.51; published online 2 February 2010", "paper_title": "Expectations and outcomes in electronic identity management: the role of trust and public value", "paper_id": "WOS:000277833700008"}