{"auto_keywords": [{"score": 0.04817552345370084, "phrase": "media_resources"}, {"score": 0.02634067319829822, "phrase": "media_fragments"}, {"score": 0.004814959787407909, "phrase": "uri"}, {"score": 0.004395040468458808, "phrase": "prime_citizen"}, {"score": 0.004135562737140424, "phrase": "digital_media_files"}, {"score": 0.00395101799538683, "phrase": "web_resources"}, {"score": 0.003569763795153386, "phrase": "web_page"}, {"score": 0.0027414948679658816, "phrase": "media_fragment_protocol"}, {"score": 0.0026592094867526803, "phrase": "long-term_growth"}, {"score": 0.0025793874956029795, "phrase": "major_contribution"}, {"score": 0.002271725588755076, "phrase": "http_protocol"}, {"score": 0.0021049977753042253, "phrase": "current_web-enabled_media_formats"}], "paper_keywords": ["Media fragments", " W3C standardisation", " HTML5"], "paper_abstract": "To make media resources a prime citizen on the Web, we have to go beyond simply replicating digital media files. The Web is based on hyperlinks between Web resources, and that includes hyperlinking out of resources (e.g., from a word or an image within a Web page) as well as hyperlinking into resources (e.g., fragment URIs into Web pages). To turn video and audio into hypervideo and hyperaudio, we need to enable hyperlinking into and out of them. The W3C Media Fragments Working Group is taking on the challenge to further embrace W3C's mission to lead the World Wide Web to its full potential by developing a Media Fragment protocol and guidelines that ensure the long-term growth of the Web. The major contribution of this paper is the introduction of Media Fragments as a media-format independent, standard means of addressing media resources using URIs. Moreover, we explain how the HTTP protocol can be used and extended to serve Media Fragments and what the impact is for current Web-enabled media formats.", "paper_title": "A URI-based approach for addressing fragments of media resources on the Web", "paper_id": "WOS:000304134000014"}