{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "electronic_resources"}, {"score": 0.009662655065077418, "phrase": "humanities_graduate_students"}, {"score": 0.006174975223367348, "phrase": "university_library"}, {"score": 0.003628352506247126, "phrase": "paper_versions"}, {"score": 0.0035290250358997904, "phrase": "study's_participants"}, {"score": 0.0032470094613727433, "phrase": "follow-up_interviews"}, {"score": 0.0030208364972341096, "phrase": "considerably_more_print_materials"}, {"score": 0.0026584843838039166, "phrase": "electronic_format"}, {"score": 0.0025008468316682036, "phrase": "availability_ratio"}, {"score": 0.0023656467839555458, "phrase": "students'_acceptance"}, {"score": 0.0021049977753042253, "phrase": "better_understanding"}], "paper_keywords": ["Graduates", " Information research", " University libraries"], "paper_abstract": "Purpose - This study aims to answer the following questions about humanities graduate students: what are the characteristics of the documents cited in their theses? Where and how do they obtain those citations? Do students use and cite electronic resources? Do students favour electronic resources over paper versions? Design/methodology/approach - The study's participants were 20 humanities graduate students. Following an analysis of the citations in their theses, list-checking and follow-up interviews were conducted. Findings - The results showed that these humanities graduate students cited considerably more print materials than electronic resources. Most of the documents cited were supplied by the university library. Only a small proportion of the documents were available in electronic format either from the university library or from the internet. The availability ratio of journals was higher than that of books. Students' acceptance of e-journals was higher than that of e-books. Originality/value - The findings of the study could help researchers and librarians gain a better understanding of how humanities graduate students use electronic resources.", "paper_title": "The impact of electronic resources on humanities graduate student theses", "paper_id": "WOS:000281276100006"}