{"auto_keywords": [{"score": 0.03355629015499835, "phrase": "intracellular_side"}, {"score": 0.03322753151060747, "phrase": "tm_helix_vi"}, {"score": 0.00457696724030363, "phrase": "molecular_dynamics"}, {"score": 0.00441738161338662, "phrase": "membrane-embedded_environment"}, {"score": 0.004285010985001827, "phrase": "homology_model"}, {"score": 0.003551694229680741, "phrase": "interaction_pattern"}, {"score": 0.003462704420080129, "phrase": "binding_site"}, {"score": 0.0033249197885613937, "phrase": "experimental_data"}, {"score": 0.0032746712603464235, "phrase": "gpcr_activation"}, {"score": 0.0030655302236416502, "phrase": "tm_helices_iii"}, {"score": 0.003034605505696848, "phrase": "vii."}, {"score": 0.002672750634553146, "phrase": "md_simulations"}, {"score": 0.00248927752933113, "phrase": "inactive_conformation"}, {"score": 0.002237357942660354, "phrase": "tm_helix_iii._snapshots"}, {"score": 0.002159170788765385, "phrase": "functionally_relevant_models"}], "paper_keywords": [""], "paper_abstract": "Molecular dynamics (MD) simulations in a membrane-embedded environment were carried out on the homology model of the human histamine H4 receptor (hH4R) alone and in complex with its endogenous activator histamine and with the first reported selective hH4R antagonist JNJ7777120. During the simulation of the histamine-hH4R complex, considerable changes occurred in the hH4R structure as well as in the interaction pattern of histamine at the binding site. These changes are in agreement with experimental data published on GPCR activation. In particular, the intracellular side of TM helix VI moved significantly away from TM helices III and VII. Moreover, histamine formed an interaction with Asn147 (4.57) that was previously proved to be important in hH4R activation. Results of the MD simulations of the native hH4R and the JNJ7777120-hH4R complex suggest that these models represent an inactive conformation of hH4R. MD simulation in the presence of JNJ7777120 resulted in the movement of the intracellular side of TM helix VI in the direction of TM helix III. Snapshots of the simulations may serve as functionally relevant models in the development of novel hH4R ligands in the future.", "paper_title": "Activation mechanism of the human histamine H4 receptor - An explicit membrane molecular dynamics simulation study", "paper_id": "WOS:000257026800009"}