{"auto_keywords": [{"score": 0.03751951230806167, "phrase": "business_process_model"}, {"score": 0.019375857941133615, "phrase": "structural_equation_model"}, {"score": 0.010612387000973441, "phrase": "business_process"}, {"score": 0.010398445908021841, "phrase": "redesign_success"}, {"score": 0.007657579198156354, "phrase": "business_process_redesign_success"}, {"score": 0.007579774332511679, "phrase": "communication_flow_orientation"}, {"score": 0.006984934518446809, "phrase": "model's_perceived_quality"}, {"score": 0.004637478829869904, "phrase": "field_study"}, {"score": 0.004605917942709477, "phrase": "business_process_redesign"}, {"score": 0.004185874747231179, "phrase": "research_gap"}, {"score": 0.0041149859710361125, "phrase": "multi-methods_study"}, {"score": 0.0037523473563976246, "phrase": "qualitative_data"}, {"score": 0.00325051332556486, "phrase": "communication_interactions"}, {"score": 0.0026839372202435065, "phrase": "perceived_model_quality"}, {"score": 0.0025236349164549877, "phrase": "business_process_model's_perceived_completeness"}, {"score": 0.002340623433237658, "phrase": "explained_variance"}, {"score": 0.002285216591220303, "phrase": "main_implication"}, {"score": 0.002215897810312801, "phrase": "communication_flows"}, {"score": 0.0022007808283071133, "phrase": "business_processes"}, {"score": 0.0021782980803068505, "phrase": "important_ingredient"}, {"score": 0.0021634370496463793, "phrase": "successful_business_process"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Business process modeling", " Communication flow optimization", " Business process redesign", " Factor analysis", " Structural equation modeling", " Partial least squares", " Data triangulation"], "paper_abstract": "Business process redesign has been intensely studied, particularly since the mid 1990s. One aspect that received little attention, however, is the relationship between business process modeling choices and redesign success. This research gap is addressed through a multi-methods study of 18 business process redesign projects conducted in 18 different organizations. A structural equation model is developed and tested based on data collected from those projects; the results are then triangulated with qualitative data. The structural equation model depicts relationships between the following broad perceptual constructs: communication flow orientation of a business process model, quality of a business process model, and business process redesign success. The communication flow orientation of a business process model is defined as the extent to which a model explicitly shows how communication interactions take place in a process. A model's perceived quality is defined as the degree to which the model presents the following perceptual sub-constructs: ease of generation, ease of understanding, completeness, and accuracy. The results of the study suggest that the degree of communication flow orientation of a business process model is significantly related to the model's perceived quality. Perceived model quality, in turn, is significantly related to perceived business process redesign success. interestingly. a business process model's perceived completeness does not seem to be influenced by a model's communication flow orientation. The structural equation model accounted for 56% of the explained variance in the business process redesign success construct. The main implication of this study is that a focus on communication flows in business processes is an important ingredient in successful business process redesign projects. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Communication flow orientation in business process modeling and its effect on redesign success: Results from a field study", "paper_id": "WOS:000262760000011"}