{"auto_keywords": [{"score": 0.04117729234560256, "phrase": "data_points"}, {"score": 0.010612387000973441, "phrase": "evolving_network"}, {"score": 0.00367967106192446, "phrase": "data_point"}, {"score": 0.0035183010916001664, "phrase": "small_payoffs"}, {"score": 0.003448863509392547, "phrase": "new_edges"}, {"score": 0.003380791705551809, "phrase": "larger_payoffs"}, {"score": 0.0026086775334428617, "phrase": "evolutionarily_stable_strategies"}, {"score": 0.002481747081849501, "phrase": "experimental_results"}, {"score": 0.002168975681697056, "phrase": "proposed_algorithms"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Unsupervised learning", " Data clustering", " Evolutionary game theory", " Evolutionarily stable strategy"], "paper_abstract": "This paper introduces a model based upon games on an evolving network, and develops three clustering algorithms according to it. In the clustering algorithms, data points for clustering are regarded as players who can make decisions in games. On the network describing relationships among data points, an edge-removing-and-rewiring (ERR) function is employed to explore in a neighborhood of a data point, which removes edges connecting to neighbors with small payoffs, and creates new edges to neighbors with larger payoffs. As such, the connections among data points vary over time. During the evolution of network, some strategies are spread in the network. As a consequence, clusters are formed automatically, in which data points with the same evolutionarily stable strategy are collected as a cluster, so the number of evolutionarily stable strategies indicates the number of clusters. Moreover, the experimental results have demonstrated that data points in datasets are clustered reasonably and efficiently, and the comparison with other algorithms also provides an indication of the effectiveness of the proposed algorithms. (c) 2010 Elsevier Ltd. All rights reserved.", "paper_title": "A novel clustering algorithm based upon games on evolving network", "paper_id": "WOS:000278376100011"}