{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hierarchically_organized_data"}, {"score": 0.004700027722284931, "phrase": "novel_visualization_method"}, {"score": 0.004026505114417176, "phrase": "matching_subhierarchies"}, {"score": 0.0035336109352157763, "phrase": "hierarchy_elements"}, {"score": 0.00346589179059467, "phrase": "hierarchical_edge_bundles"}, {"score": 0.003350480663660326, "phrase": "visual_clutter"}, {"score": 0.003270396852243212, "phrase": "aforementioned_splits"}, {"score": 0.003070996252787868, "phrase": "intuitive_way"}, {"score": 0.0027741761880779535, "phrase": "different_versions"}, {"score": 0.002579847272930948, "phrase": "hierarchical_data"}, {"score": 0.0025059724686541263, "phrase": "actual_software_systems"}, {"score": 0.0021461840368981475, "phrase": "comparison_tasks"}, {"score": 0.0021049977753042253, "phrase": "user_interaction"}], "paper_keywords": [""], "paper_abstract": "We provide a novel visualization method for the comparison of hierarchically organized data. Our technique visualizes a pair of hierarchies that are to be compared and simultaneously depicts how these hierarchies are related by explicitly visualizing the relations between matching subhierarchies. Elements that are unique to each hierarchy are shown, as well as the way in which hierarchy elements are relocated, split or joined. The relations between hierarchy elements are visualized using Hierarchical Edge Bundles (HEBs). HEBs reduce visual clutter they visually emphasize the aforementioned splits, joins, and relocations of subhierarchies, and they provide an intuitive way in which users can interact with the relations. The focus throughout this paper is of? the comparison of different versions of hierarchically organized software systems, but the technique is applicable to other kinds of hierarchical data as well. Various data sets of actual software systems are used to show how our technique can be employed to easily spot splits, joins, and relocations of elements, how sorting both, hierarchies with respect to each other facilitates comparison tasks, and how user interaction is supported.", "paper_title": "Visual comparison of hierarchically organized data", "paper_id": "WOS:000257075000007"}