{"auto_keywords": [{"score": 0.03321190456127021, "phrase": "different_modalities"}, {"score": 0.00481495049065317, "phrase": "conceptual_model"}, {"score": 0.00468991337957911, "phrase": "abstract_spatio-temporal_demonstrations"}, {"score": 0.004243552607799184, "phrase": "perceptual_space"}, {"score": 0.004111584914709491, "phrase": "functional_similarity"}, {"score": 0.0035665344993417603, "phrase": "incremental_and_gradual_learning_algorithms"}, {"score": 0.0034555479218891638, "phrase": "hidden_markov_models"}, {"score": 0.0033656930865509547, "phrase": "perceptually_similar_demonstrations"}, {"score": 0.0031098631445657158, "phrase": "multimodal_concept_recognition"}, {"score": 0.003028969851366049, "phrase": "proposed_model"}, {"score": 0.00291923164591297, "phrase": "first_one"}, {"score": 0.0028886123801902517, "phrase": "imitation_learning"}, {"score": 0.0028432828877281388, "phrase": "hand_gestures"}, {"score": 0.0023891283748647416, "phrase": "second_task"}, {"score": 0.002172701452347454, "phrase": "humanoid_robot_show"}, {"score": 0.0021049977753042253, "phrase": "conceptual_imitation_learning"}], "paper_keywords": ["Abstraction", " concept learning", " hidden Markov model", " imitation", " incremental learning"], "paper_abstract": "This paper presents a conceptual model for imitation learning to abstract spatio-temporal demonstrations based on their perceptual and functional characteristics. To this end, the concepts are represented by prototypes irregularly scattered in the perceptual space but sharing the same functionality. Functional similarity between demonstrations is understood by reinforcements of the teacher or recognizing the effects of actions. Abstraction, concept acquisition, and self-organization of prototypes are performed through incremental and gradual learning algorithms. In these algorithms, hidden Markov models are used to prototype perceptually similar demonstrations. In addition, a mechanism is introduced to integrate perceptions of different modalities for multimodal concept recognition. Performance of the proposed model is evaluated in two different tasks. The first one is imitation learning of some hand gestures through interaction with the teachers. In this task, the perceptions from different modalities, including vision, motor, and audition, are used in a variety of experiments. The second task is to learn a set of actions by recognizing their emotional effects. Results of the experiments on a humanoid robot show the efficacy of our model for conceptual imitation learning.", "paper_title": "Conceptual Imitation Learning Based on Perceptual and Functional Characteristics of Action", "paper_id": "WOS:000328703300004"}