{"auto_keywords": [{"score": 0.009468952638053911, "phrase": "isp"}, {"score": 0.004589307360976108, "phrase": "underlying_internet_routing_architecture"}, {"score": 0.004526793300190607, "phrase": "significant_portion"}, {"score": 0.004495854882808791, "phrase": "today's_internet_traffic"}, {"score": 0.00438921882244081, "phrase": "good_source"}, {"score": 0.004314595541370065, "phrase": "internet_service_providers"}, {"score": 0.004169117683086526, "phrase": "significant_traffic_engineering_challenge"}, {"score": 0.003973619384183145, "phrase": "overlay_topology"}, {"score": 0.0037356237848699867, "phrase": "internet_routing"}, {"score": 0.00365949103351756, "phrase": "isp's_traffic_engineering_capabilities"}, {"score": 0.003463944293093158, "phrase": "good_performance"}, {"score": 0.003335581163845351, "phrase": "underlying_network"}, {"score": 0.0032452142903668666, "phrase": "path_performance"}, {"score": 0.0025604827895852646, "phrase": "higher_bandwidth_links"}, {"score": 0.002465516335722086, "phrase": "appropriate_neighbors"}, {"score": 0.002201187194326849, "phrase": "desired_path"}, {"score": 0.0021786074765975006, "phrase": "improved_network_utilization"}, {"score": 0.0021195184368629017, "phrase": "better_service"}], "paper_keywords": ["design", " experimentation", " management", " performance", " P2P", " ISP", " cooperation", " routing", " biased neighbor selection"], "paper_abstract": "Peer-to-peer (P2P) systems, which are realized as overlays on top of the underlying Internet routing architecture, contribute a significant portion of today's Internet traffic. While the P2P users are a good source of revenue for the Internet Service Providers (ISPs), the immense P2P traffic also poses a significant traffic engineering challenge to the ISPs. This is because P2P systems either implement their own routing in the overlay topology or may use a P2P routing underlay [1], both of which are largely independent of the Internet routing. and thus impedes the ISP's traffic engineering capabilities. On the other hand, P2P users are primarily interested in finding their desired content quickly, with good performance. But as the P2P system has no access to the underlying network, it either has to measure the path performance itself or build its overlay topology agnostic of the underlay. This situation is disadvantageous for both the ISPs and the P2P users. To overcome this, we propose and evaluate the feasibility of a solution where the ISP offers an \"oracle\" to the P2P users. When the P2P user supplies the oracle with a list of possible P2P neighbors, the oracle ranks them according to certain criteria, like their proximity to the user or higher bandwidth links. This can be used by the P2P user to choose appropriate neighbors, and therefore improve its performance. The ISP can use this mechanism to better manage the immense P2P traffic, e.g., to keep it inside its network, or to direct it along a desired path. The improved network utilization will also enable the ISP to provide better service to its customers.", "paper_title": "Can ISPs and P2P users cooperate for improved performance?", "paper_id": "WOS:000248454600007"}