{"auto_keywords": [{"score": 0.04396832277767059, "phrase": "singular_points"}, {"score": 0.03417566424036916, "phrase": "arch-type_fingerprints"}, {"score": 0.009371409591970938, "phrase": "proposed_method"}, {"score": 0.006881760813402796, "phrase": "reference_points"}, {"score": 0.00481495049065317, "phrase": "directional_fields"}, {"score": 0.004610058444728656, "phrase": "new_fingerprint_singular_point_detection_method"}, {"score": 0.004046020290832207, "phrase": "local_directional_fields"}, {"score": 0.003980531478122155, "phrase": "fingerprint_image"}, {"score": 0.0038948525410795517, "phrase": "predefined_rules"}, {"score": 0.003167217223469026, "phrase": "singular_point"}, {"score": 0.002855934865505357, "phrase": "new_reference_point_detection_method"}, {"score": 0.0025334249463305875, "phrase": "different_resolutions"}, {"score": 0.0024519545383399773, "phrase": "high_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["singular point", " fingerprint", " reference point", " directional field", " classification", " alignment"], "paper_abstract": "This paper presents a new fingerprint singular point detection method that is type-distinguishable and applicable to various fingerprint images regardless of their resolutions. The proposed method detects singular points by analyzing the shapes of the local directional fields of a fingerprint image. Using the predefined rules, all types of singular points (upper core, lower core, and delta points) can be extracted accurately and delineated in terms of the type of singular points. In case of arch-type fingerprints there exists no singular point, but reference points for arch-type fingerprints are required to be detected for registration. Therefore, we propose a new reference point detection method for arch-type fingerprints as well. The result of the experiments on the two public databases (FVC2000 2a, FVC2002 2a) with different resolutions demonstrates that the proposed method has high accuracy in locating each types of singular points and detecting the reference points of arch-type fingerprints without regard to their image resolutions. (c) 2005 Pattern Recognition Society. Published by Elsevier Ltd. All rights reserved.", "paper_title": "Singular point detection by shape analysis of directional fields in fingerprints", "paper_id": "WOS:000236164800008"}