{"auto_keywords": [{"score": 0.049495288917568735, "phrase": "semantic_web"}, {"score": 0.00481495049065317, "phrase": "enhancing_interaction_design"}, {"score": 0.0045843245695654875, "phrase": "resource_description_framework-based_ontologies"}, {"score": 0.004224130367280183, "phrase": "new_challenge"}, {"score": 0.004189698902282913, "phrase": "knowledge_sharing"}, {"score": 0.0041555469216463855, "phrase": "automatic_processing"}, {"score": 0.0036753171449945654, "phrase": "powerful_but_complex_technology"}, {"score": 0.0033449479263613848, "phrase": "interactive_technologies"}, {"score": 0.002898127432512101, "phrase": "highly_valuable_paradigm"}, {"score": 0.0026920404458807444, "phrase": "semantic_environment"}, {"score": 0.002659142621852998, "phrase": "semantic_interaction"}, {"score": 0.002637433799290365, "phrase": "end_users"}, {"score": 0.0025628355581338563, "phrase": "semantic_information"}, {"score": 0.002480154140902474, "phrase": "demonstration_approach"}, {"score": 0.002400137392434555, "phrase": "html"}, {"score": 0.002266246304762945, "phrase": "underlying_semantic_models"}, {"score": 0.0021049977753042253, "phrase": "proposed_approach"}], "paper_keywords": ["Human-computer interaction (HCI)", " semantic web", " user-centered design", " user interfaces"], "paper_abstract": "The use of resource description framework-based ontologies as knowledge repositories has become increasingly popular over the past few years. The semantic web has rapidly spread, appearing as a new challenge for knowledge sharing and automatic processing. However, the reality is that the power of the semantic web is still barely used. This is mostly because of the fact that the semantic web is a powerful but complex technology that most end users cannot afford to use for their common problem-solving activities. This has probably made the semantic web to stay in the background of interactive technologies, unlike other new end-user-oriented paradigms (e. g., the so-called Web 2.0 and later approaches) that have very much increased along these years. Nevertheless, the semantic web can be considered as a highly valuable paradigm that has not been, conveniently, exploited yet. In this paper, we propose a semantic environment to exploit semantic interaction by end users in order to help them access semantic information easily. We follow a programming by demonstration approach, where the user navigates and modifies HTML presentation of data and the system, automatically, infers changes to the underlying semantic models. Furthermore, we provide an evaluation of the interaction, including the most important results obtained for the proposed approach.", "paper_title": "Enhancing Interaction Design on the Semantic Web: A Case Study", "paper_id": "WOS:000312885400019"}