{"auto_keywords": [{"score": 0.04939619318571274, "phrase": "ensemble_methods"}, {"score": 0.00481495049065317, "phrase": "software_maintainability"}, {"score": 0.0046118021635786315, "phrase": "software_maintenance_effort"}, {"score": 0.004513450434595191, "phrase": "better_management"}, {"score": 0.004385555408850022, "phrase": "software_maintenance"}, {"score": 0.004110831924517065, "phrase": "computational_intelligence_models"}, {"score": 0.004052148727852149, "phrase": "software_maintainability_prediction"}, {"score": 0.00278752137116301, "phrase": "different_homogenous_and_heterogeneous_ensemble_methods"}, {"score": 0.0026505322540093783, "phrase": "change_proneness"}, {"score": 0.0024842242921857705, "phrase": "consideration_different_design"}, {"score": 0.002362105010110277, "phrase": "investigated_ensembles_methods"}, {"score": 0.0022950308685133224, "phrase": "prediction_problems"}, {"score": 0.002166530105679438, "phrase": "overall_empirical_evidence"}], "paper_keywords": ["Computational intelligence", " Ensemble techniques", " Homogenous ensemble", " Heterogeneous ensemble", " Software maintenance", " Prediction", " Empirical studies"], "paper_abstract": "More accurate prediction of software maintenance effort contributes to better management and control of software maintenance. Several research studies have recently investigated the use of computational intelligence models for software maintainability prediction. The performance of these models, however, may vary from dataset to dataset. Consequently, ensemble methods have become increasingly popular as they take advantage of the capabilities of their constituent computational intelligence models toward a dataset to come up with more accurate or at least competitive prediction accuracy compared to individual models. This paper investigates and empirically evaluates different homogenous and heterogeneous ensemble methods in predicting software maintenance effort and change proneness. Three major empirical studies were designed and conducted taken into consideration different design such as the types of the investigated ensembles methods, types of prediction problems, used datasets, and other experimental setup. Overall empirical evidence obtained from the three studies confirms that some ensemble methods provide more accurate or at least competitive prediction accuracy compared to individual models across datasets, and thus they are more reliable.", "paper_title": "Three empirical studies on predicting software maintainability using ensemble methods", "paper_id": "WOS:000361728200010"}