{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "refocusing_delays"}, {"score": 0.004612376827433774, "phrase": "single_sensor"}, {"score": 0.00401560412621627, "phrase": "existing_literature"}, {"score": 0.0034790978593553794, "phrase": "camera_surveillance"}, {"score": 0.003131637033429892, "phrase": "new_geographical_location"}, {"score": 0.002791932344920906, "phrase": "special_case"}, {"score": 0.002687070469080394, "phrase": "euclidian_metric"}, {"score": 0.0025737890313763407, "phrase": "optimal_cost"}, {"score": 0.002537097217899195, "phrase": "scheduling_problem"}, {"score": 0.0024771000236931836, "phrase": "exact_solutions"}, {"score": 0.0024417832296664698, "phrase": "special_cases"}], "paper_keywords": ["Sensor scheduling", " Delay constraints", " Sensor networks", " Sensors", " Surveillance", " Resource allocation", " Algorithms"], "paper_abstract": "We study a problem in which a single sensor is scheduled to observe sites periodically, motivated by applications in which the goal is to maintain up-to-date readings for all the observed sites. In the existing literature, it is typically assumed that the time for a sensor switching from one site to another is negligible. This may not be the case in applications such as camera surveillance of a border, however, in which the camera takes time to pan and tilt to refocus itself to a new geographical location. We formulate a problem with constraints modeling refocusing delays. We prove the problem to be NP-hard and then study a special case in which refocusing is proportional to some Euclidian metric. We give a lower bound on the optimal cost for the scheduling problem, and we derive exact solutions for some special cases of the problem. Finally, we provide and experimentally evaluate several heuristic algorithms, some of which are based on the computed lower bound, for the setting of one sensor and many sites.", "paper_title": "You can't get there from here: sensor scheduling with refocusing delays", "paper_id": "WOS:000356096800019"}