{"auto_keywords": [{"score": 0.035170832591204404, "phrase": "maximum_crease_width"}, {"score": 0.03401578810679208, "phrase": "total_crease_width"}, {"score": 0.0284485727829961, "phrase": "minimization_problem"}, {"score": 0.00481495049065317, "phrase": "stamp_folding_problem"}, {"score": 0.004443276312972159, "phrase": "long_paper_strip"}, {"score": 0.004243862930012258, "phrase": "paper_strip"}, {"score": 0.0041001740903338834, "phrase": "paper_layers"}, {"score": 0.003984141889010296, "phrase": "hinged_paper_segments"}, {"score": 0.0038936755823756226, "phrase": "crease_width"}, {"score": 0.0038271712887391015, "phrase": "crease_point"}, {"score": 0.003166259444961177, "phrase": "optimization_problem"}, {"score": 0.0029722900280316216, "phrase": "counting_problem"}, {"score": 0.002590289229351027, "phrase": "np"}, {"score": 0.002416589459425828, "phrase": "polynomial_time"}], "paper_keywords": ["Linkage", " NP-complete", " Optimization problem", " Pleat folding", " Rigid origami"], "paper_abstract": "There are many folded states consistent with a given mountain valley pattern of equidistant creases on a long paper strip. We would like to fold a paper strip such that the number of paper layers between each pair of hinged paper segments, called the crease width at the crease point, is minimized. This problem is called the stamp folding problem and there are two variants of this problem: minimization of the maximum crease width, and minimization of the total crease width. This optimization problem was recently introduced and investigated from the viewpoint of the counting problem. However, its computational complexity is not known. In this paper, we first show that the minimization problem of the maximum crease width is strongly NP-complete. Hence we cannot solve the problem in polynomial time unless P = NP. We next propose an algorithm that solves the minimization problem. The algorithm itself is a straightforward one, but its analysis is not trivial. We show that this algorithm runs in O ((k + 1)(k)n) time where n is the number of creases and k is the total crease width. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "The complexity of the stamp folding problem", "paper_id": "WOS:000323358200002"}