{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "object_detection"}, {"score": 0.03815547406258526, "phrase": "variability_information"}, {"score": 0.01468445477815343, "phrase": "edge_information"}, {"score": 0.011432197033582893, "phrase": "edge_matching"}, {"score": 0.004778258911940497, "phrase": "dynamic_environment"}, {"score": 0.004652016085325825, "phrase": "reduced_volume"}, {"score": 0.004053362743156545, "phrase": "different_frames"}, {"score": 0.004007083686875716, "phrase": "illumination_change"}, {"score": 0.0035179764329354877, "phrase": "optimal_performance"}, {"score": 0.003438058620195309, "phrase": "traditional_edge_pixel-based_methods"}, {"score": 0.003006654007926993, "phrase": "structural_and_relational_information"}, {"score": 0.002860546817196148, "phrase": "existing_algorithms"}, {"score": 0.002690406375639144, "phrase": "arbitrary_shapes"}, {"score": 0.002599177223533834, "phrase": "knowledge-based_flexible_edge"}, {"score": 0.002482320290902079, "phrase": "environmental_dynamics"}, {"score": 0.0023981301755351607, "phrase": "arbitrary_shape"}, {"score": 0.002370704665003412, "phrase": "geometric_variations"}, {"score": 0.0021956951486095805, "phrase": "proposed_matching_algorithm"}, {"score": 0.0021049977753042253, "phrase": "target_detection"}], "paper_keywords": ["Edge matching", " Motion detection", " Background statistics", " Video surveillance", " Illumination variation"], "paper_abstract": "Considering the robustness, stability and reduced volume of data, researchers have focused on using edge information in various video processing applications including moving object detection, tracking and target recognition. Though the edge information is more robust compared to intensity, it also exhibits variations in different frames due to illumination change and noise. In addition to this, the amount of variation varies from edge to edge. Thus, without making use of this variability information, it is difficult to obtain an optimal performance during edge matching. However, traditional edge pixel-based methods do not keep structural information of edges and thus they are not suitable to extract and hold this variability information. To achieve this, we represent edges as segments that make use of the structural and relational information of edges to allow extraction of this variability information. During edge matching, existing algorithms do not handle the size, positional and rotational variations to deal with edges of arbitrary shapes. In this paper, we propose a knowledge-based flexible edge matching algorithm where knowledge is obtained from the statistics on the environmental dynamics, and flexibility is to deal with the arbitrary shape and the geometric variations of edges by making use of this knowledge. In this paper, we detailed the effectiveness of the proposed matching algorithm in moving object detection and also indicated its suitability in other applications like target detection and tracking.", "paper_title": "A flexible edge matching technique for object detection in dynamic environment", "paper_id": "WOS:000303479800009"}