{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "computing_technology"}, {"score": 0.004616859702338596, "phrase": "social_cues"}, {"score": 0.004505074966056871, "phrase": "user_interface"}, {"score": 0.0038078492247427594, "phrase": "limited_research"}, {"score": 0.0035625556447293804, "phrase": "social_psychology"}, {"score": 0.0035376693476114733, "phrase": "empirical_work"}, {"score": 0.0035129562812850784, "phrase": "social_responses"}, {"score": 0.0033682492486884364, "phrase": "marakas_et_al"}, {"score": 0.003263631515158206, "phrase": "differential_social_attributions"}, {"score": 0.003107294250160403, "phrase": "human_computer_studies"}, {"score": 0.0029069972482610403, "phrase": "social_attributions"}, {"score": 0.0026443135597866924, "phrase": "individual's_core_self-evaluations"}, {"score": 0.0025801648787263662, "phrase": "social_role"}, {"score": 0.0025087506382067536, "phrase": "computer_interface"}, {"score": 0.002363474907331799, "phrase": "independent_agency"}, {"score": 0.002195552442011313, "phrase": "distinctly_social_interface"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["interface design", " anthropomorphism", " core self-evaluations", " computer as social actor", " social responses toward computing technology", " attribution theory"], "paper_abstract": "A debate exists as to whether social cues should be intentionally designed into the user interface. Some have argued that such interfaces will improve comfort with the interface, create a more natural interaction and improve productivity, although others have argued that these interfaces will lead individuals to ascribe characteristics and responsibilities to computing technology that it does not have. Despite the debate, limited research has focused on the impact these interfaces have on how people ascribe responsibility to computing technology. Drawing from social psychology, empirical work regarding social responses toward computing technology, and attribution theory, this research empirically tests a model developed by Marakas et al. [2000. A theoretical model of differential social attributions toward Computing technology: when the metaphor becomes the model. International Journal of Human Computer Studies 52, 719-750] which identifies and explains several of the factors that contribute to differential social attributions toward computing technology. Using data from 240 students and professionals, results from a laboratory Study indicate that attributions toward computing technology Lire influenced by an individual's core self-evaluations, their generalized beliefs about the social role Of Computing technology and the nature of the computer interface used. Specifically, the results provide support for the argument that certain individuals do indeed attribute independent agency to computing technology and respond accordingly, and that this propensity is magnified when exposed to a computer with a distinctly social interface. Implications for both the applied and academic research communities are discussed. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Differential social attributions toward computing technology: An empirical investigation", "paper_id": "WOS:000236475900004"}