{"auto_keywords": [{"score": 0.04952782290107846, "phrase": "international_standards"}, {"score": 0.004722898398399427, "phrase": "geographic_information"}, {"score": 0.00468656988857138, "phrase": "unambiguous_definitions"}, {"score": 0.004650519511749445, "phrase": "geometric_primitives"}, {"score": 0.004439941010250576, "phrase": "geographical_information_system"}, {"score": 0.004405850724910061, "phrase": "gis"}, {"score": 0.003804234575698981, "phrase": "standardized_definition"}, {"score": 0.0035212516951180946, "phrase": "equivalent_definition"}, {"score": 0.0033228699494959172, "phrase": "software_vendors"}, {"score": 0.003051887221639784, "phrase": "two-manifold_objects"}, {"score": 0.002947486683884831, "phrase": "nonmanifold_objects"}, {"score": 0.002891032998395276, "phrase": "data_sets"}, {"score": 0.0024385083712241988, "phrase": "topological_relationships"}, {"score": 0.002410363090950055, "phrase": "different_parts"}, {"score": 0.0021965609224818853, "phrase": "main_engineering_decisions"}, {"score": 0.0021049977753042253, "phrase": "real-world_three-dimensional_data_sets"}], "paper_keywords": [""], "paper_abstract": "The international standards for geographic information provide unambiguous definitions of geometric primitives, with the aim of fostering exchange and interoperability in the geographical information system (GIS) community. In two dimensions, the standards are well accepted and there are algorithms (and implementations of these) to validate primitives, that is given a polygon, they ensure that it respects the standardized definition (and if it does not a reason is given to the user). However, although there exists an equivalent definition in three dimensions (for solids), it is ignored by most researchers and by software vendors. Several different definitions are indeed used, and none is compliant with the standards: for example solids are often defined as two-manifold objects only, although in fact they can be nonmanifold objects. Exchanging and converting data sets from one format/platform to another is thus highly problematic. I present in this article a methodology to validate solids according to the international standards. It is hierarchical and permits us to validate the primitives of all dimensionalities. To understand and study the topological relationships between the different parts of a solid (the shells) the concept of Nef polyhedron is used. The methodology has been implemented in a prototype, and I report on the main engineering decisions that were made and on its use for the validation of real-world three-dimensional data sets.", "paper_title": "On the Validation of Solids Represented with the International Standards for Geographic Information", "paper_id": "WOS:000323825100005"}