{"auto_keywords": [{"score": 0.04916281891691644, "phrase": "ddos_flood_attacks"}, {"score": 0.008416940158810709, "phrase": "abnormal_traffic"}, {"score": 0.00660225153190696, "phrase": "normal_traffic"}, {"score": 0.006321787057012365, "phrase": "protected_site"}, {"score": 0.00481495049065317, "phrase": "averaged_hurst_parameter"}, {"score": 0.004308455856718928, "phrase": "arrival_traffic_pattern"}, {"score": 0.004007083686875716, "phrase": "free_traffic"}, {"score": 0.0038924989779389424, "phrase": "anomaly_detection"}, {"score": 0.00328625950643742, "phrase": "qualitative_descriptions"}, {"score": 0.0031614748814351823, "phrase": "quantitative_descriptions"}, {"score": 0.002925899335792914, "phrase": "hurst_parameter_h"}, {"score": 0.002855934865505357, "phrase": "key_role"}, {"score": 0.002274630121183437, "phrase": "test_data"}, {"score": 0.002241816883550397, "phrase": "mit_lincoln_laboratory"}, {"score": 0.0021670777282518424, "phrase": "fourier_analysis"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Hurst parameter", " traffic", " time series", " distributed denial-of-service flood attacks", " anomaly detection"], "paper_abstract": "Distributed denial-of-service (DDOS) flood attacks remain great threats to the Internet though various approaches and systems have been proposed. Because arrival traffic pattern under DDOS flood attacks varies significantly away from the pattern of normal traffic (i.e., attack free traffic) at the protected site, anomaly detection plays a rote in the detection of DDOS flood attacks. Hence, quantitatively studying statistics of traffic under DDOS flood attacks (abnormal traffic for short) are essential to anomaly detections of DDOS flood attacks. References regarding qualitative descriptions of abnormal traffic are quite rich, but quantitative descriptions of its statistics are seldom seen. Though statistics of normal traffic are affluent, where the Hurst parameter H of traffic plays a key role, how H of traffic varies under DDOS flood attacks is rarely reported. As a supplementary to our early work, this paper shows that averaged H of abnormal traffic usually tends to be significantly smaller than that of normal one at the protected site. This abnormality of abnormal traffic is demonstrated with test data provided by MIT Lincoln Laboratory and explained from a view of Fourier analysis. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Change trend of averaged Hurst parameter of traffic under DDOS flood attacks", "paper_id": "WOS:000238604700020"}