{"auto_keywords": [{"score": 0.04859630752373764, "phrase": "knowledge_transfer"}, {"score": 0.015654649960458036, "phrase": "information_granularity"}, {"score": 0.013537069207417051, "phrase": "new_data"}, {"score": 0.012456583437270343, "phrase": "original_model"}, {"score": 0.012302028664140093, "phrase": "existing_model"}, {"score": 0.00481495049065317, "phrase": "optimal_allocation"}, {"score": 0.004166178710716697, "phrase": "project_cost_estimation"}, {"score": 0.004003348169928476, "phrase": "new_model"}, {"score": 0.003566868358763727, "phrase": "software_engineering"}, {"score": 0.0035370399749397523, "phrase": "existing_similarities"}, {"score": 0.00330025288273863, "phrase": "information_granules"}, {"score": 0.0032795266536072604, "phrase": "numeric_entities"}, {"score": 0.0031578657356734832, "phrase": "numeric_parameters"}, {"score": 0.0030857431184193765, "phrase": "granular_model"}, {"score": 0.0029774977342687764, "phrase": "current_phenomenon"}, {"score": 0.002934034206808122, "phrase": "previous_model"}, {"score": 0.0028251537271620996, "phrase": "important_design_asset"}, {"score": 0.00274903245183621, "phrase": "optimal_information_granularity_allocation_problem"}, {"score": 0.002575665611013556, "phrase": "underlying_concept"}, {"score": 0.0024748440476002978, "phrase": "fuzzy_neural_networks"}, {"score": 0.0023930017325812856, "phrase": "granular_versions"}, {"score": 0.002299313860419974, "phrase": "uniform_distribution"}, {"score": 0.002270495425498003, "phrase": "asymmetric_schemes"}, {"score": 0.002181593281695369, "phrase": "particle_swarm_optimization"}, {"score": 0.0021542471110518107, "phrase": "underlying_optimization_tool"}, {"score": 0.0021407025628134586, "phrase": "optimal_granularity_allocation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Knowledge transfer and knowledge reusability", " Granular model", " Information granularity", " Optimal granularity allocation", " Software cost estimation", " Computational intelligence"], "paper_abstract": "In this study, we introduce and discuss a concept of knowledge transfer in system modeling. In a nutshell, knowledge transfer is about forming ways on how a source of knowledge (namely, an existing model) can be used in presence of new, very limited experimental evidence. In virtue of the nature of the problem at hand (a situation encountered quite commonly, e.g. in project cost estimation), new data could be very limited and this scarcity of data makes it insufficient to construct a new model. At the same time, the new data originate from a similar (but not the same) phenomenon (process) for which the original model has been constructed so the existing model, even though it could applied, has to be treated with a certain level of reservation. Such situations can be encountered, e.g. in software engineering where in spite existing similarities, each project, process, or product exhibits its own unique characteristics. Taking this into consideration, the existing model is generalized (abstracted) by forming its granular counterpart - granular model where its parameters are regarded as information granules rather than numeric entities, viz. their non-numeric (granular) version is formed based on the values of the numeric parameters present in the original model. The results produced by the granular model are also granular and in this manner they become reflective of the differences existing between the current phenomenon and the process for which the previous model has been formed. In the study on knowledge transfer and reusability, information granularity is viewed as an important design asset and as such it is subject to optimization. We formulate an optimal information granularity allocation problem: assuming a certain level of granularity, distribute it optimally among the parameters of the model (making them granular) so that a certain data coverage criterion is maximized. While the underlying concept is general and applicable to a variety of models, in this study, we discuss its use to fuzzy neural networks with intent to clearly visualize the advantages of the approach and emphasize various ways of forming granular versions of the weights (parameters) of the connections of the network. Several granularity allocation protocols (ranging from a uniform distribution of granularity, symmetric and asymmetric schemes of allocation) are discussed and the effectiveness of each of them is quantified. The use of Particle Swarm Optimization (PSO) as the underlying optimization tool to realize optimal granularity allocation is discussed. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Knowledge transfer in system modeling and its realization through an optimal allocation of information granularity", "paper_id": "WOS:000305275800004"}