{"auto_keywords": [{"score": 0.042146579845206075, "phrase": "emo"}, {"score": 0.004103212598803194, "phrase": "complete_pareto-optimal_set"}, {"score": 0.0035908627899097407, "phrase": "pareto-optimal_set"}, {"score": 0.003359119985242403, "phrase": "main_issues"}, {"score": 0.0032706520949775065, "phrase": "classical_and_emo_philosophies"}, {"score": 0.0030189426536422577, "phrase": "long-standing_issue"}, {"score": 0.0029394074636168435, "phrase": "interactive_emo_procedure"}, {"score": 0.0027865506182608263, "phrase": "evolutionary_optimization_process"}, {"score": 0.0026950674053179404, "phrase": "single_solution"}, {"score": 0.002250415129116109, "phrase": "multi-objective_optimization"}, {"score": 0.0022057677637040396, "phrase": "aggregate_task"}], "paper_keywords": ["Multi-objective optimization", " Multiple objective decision making", " Hybrid optimization", " NSGA-II", " Robust optimization"], "paper_abstract": "With the advent of efficient techniques formulti-objective evolutionary optimization (EMO), real-world search and optimization problems are being increasingly solved for multiple conflicting objectives. During the past decade of research and application, most emphasis has been spent on finding the complete Pareto-optimal set, although EMO researchers were always aware of the importance of procedures which would help choose one particular solution from the Pareto-optimal set for implementation. This is also one of the main issues on which the classical and EMO philosophies are divided on. In this paper, we address this long-standing issue and suggest an interactive EMO procedure which will involve a decision-maker in the evolutionary optimization process and help choose a single solution at the end. This study uses many year's of research on EMO and would hopefully encourage both practitioners and researchers to pay more attention in viewing the multi-objective optimization as a aggregate task of optimization and decision-making. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "An interactive evolutionary multi-objective optimization and decision making procedure", "paper_id": "WOS:000272206500016"}