{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_pages"}, {"score": 0.004777744121315302, "phrase": "pseudo-clique_search"}, {"score": 0.004631758267671427, "phrase": "pinpoint_clustering"}, {"score": 0.004490212943845175, "phrase": "useful_clusters"}, {"score": 0.004219912413995784, "phrase": "higher-ranked_pages"}, {"score": 0.004090901264701185, "phrase": "lower-ranked_pages"}, {"score": 0.003859500298805362, "phrase": "high_ranks"}, {"score": 0.0037853015963603682, "phrase": "significant_higher-ranked_pages"}, {"score": 0.0035850198321277418, "phrase": "new_valuable_information"}, {"score": 0.003408512155673968, "phrase": "semantic_correlations"}, {"score": 0.0033429545815200825, "phrase": "singular_value_decomposition"}, {"score": 0.00326594229173048, "phrase": "term-document_matrix"}, {"score": 0.003093054709625219, "phrase": "potential_similarities"}, {"score": 0.002917931350071647, "phrase": "weighted_graph"}, {"score": 0.0025867180355950816, "phrase": "quite_valuable_cluster"}, {"score": 0.0023471384232499016, "phrase": "formal_concept_analysis"}, {"score": 0.002293034048898123, "phrase": "fc"}, {"score": 0.0022141537427057363, "phrase": "clear_meanings"}, {"score": 0.002163089417146551, "phrase": "extended_method"}, {"score": 0.002129701089817251, "phrase": "promising_approach"}, {"score": 0.0021049977753042253, "phrase": "meaningful_clusters"}], "paper_keywords": [""], "paper_abstract": "This paper presents a method for Pinpoint Clustering of web pages. We try to find useful clusters of web pages which are significant in the sense that their contents are similar to ones of higher-ranked pages. Since we are usually careless of lower-ranked pages, they are unconditionally discarded even if their contents are similar to some pages with high ranks. Such hidden pages together with significant higher-ranked pages are extracted as a cluster. As the result, our clusters can provide new valuable information for users. In order to obtain such clusters, we first extract semantic correlations among terms by applying Singular Value Decomposition (SVD) to the term-document matrix generated from a corpus. Based on the correlations, we can evaluate potential similarities among web pages to be clustered. The set of web pages is represented as a weighted graph C based on the similarities and their ranks. Our clusters can be found as pseudo-cliques in G. An algorithm for finding Top-N weighted pseudocliques is presented. Our experimental result shows that a quite valuable cluster can be actually extracted according to our method. We also discuss an idea for improvement on meanings of clusters. With the help of Formal Concept Analysis, our clusters, called FC-based clusters, can be provided with clear meanings. Our preliminary experimentation shows that the extended method would be a promising approach to finding meaningful clusters.", "paper_title": "A method for pinpoint clustering of web pages with pseudo-clique search", "paper_id": "WOS:000236905700004"}