{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "rsvp-te"}, {"score": 0.04818690273690786, "phrase": "processing_cost"}, {"score": 0.004419703921314433, "phrase": "control_plane"}, {"score": 0.003955787027818301, "phrase": "flooding_reduction_mechanisms"}, {"score": 0.0037423521744765075, "phrase": "traffic_engineering"}, {"score": 0.003704797078215222, "phrase": "routing_protocols"}, {"score": 0.0032658649336454923, "phrase": "specific_aspects"}, {"score": 0.003233075944817365, "phrase": "ospf-te"}, {"score": 0.003105168935158648, "phrase": "different_mechanisms"}, {"score": 0.0028933521924166287, "phrase": "dynamic_aspects"}, {"score": 0.002628747284714371, "phrase": "combined_processing_cost"}, {"score": 0.0024993218789131437, "phrase": "possible_bottlenecks"}, {"score": 0.0023405257495466352, "phrase": "discussed_results"}, {"score": 0.0021697677572213086, "phrase": "testbed_implementation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["MPLS traffic engineering", " OSPF-TE", " RSVP-TE"], "paper_abstract": "This paper considers two important aspects related to the control plane of Traffic Engineered IP/MPLS networks: the \"flooding reduction\" mechanisms and the evaluation of processing cost for signaling and routing protocols. The flooding reduction mechanisms are needed to reduce the amount of information exchanged by Traffic Engineering enabled routing protocols. The trade-off between the amount of information exchanged and the network performance (connection blocking probability) is discussed in the light of specific aspects of OSPF-TE routing protocol and RSVP-TE signaling protocol. Different mechanisms are analyzed and a suggestion is given for the best one. The dynamic aspects related to the time needed to distribute the routing and signaling information are considered. Finally, the combined processing cost of routing and signaling is analyzed, and the possible bottlenecks of the architecture are discussed. It is worth mentioning that the discussed results have been derived not only with simulation/analysis but also with measurements coming from a testbed implementation. (c) 2005 Elsevier B.V. All rights reserved.", "paper_title": "Traffic engineering with OSPF-TE and RSVP-TE: Flooding reduction techniques and evaluation of processing cost", "paper_id": "WOS:000239298500015"}