{"auto_keywords": [{"score": 0.03599653595516882, "phrase": "minimum_convex_recoloring_problem"}, {"score": 0.01499221520704078, "phrase": "colored_tree"}, {"score": 0.013907607839232537, "phrase": "weight_function"}, {"score": 0.010456135529800232, "phrase": "minimum_recoloring_distance"}, {"score": 0.00871005772882192, "phrase": "perfect_phylogeny"}, {"score": 0.00481495049065317, "phrase": "tree_t"}, {"score": 0.004757643419056999, "phrase": "coloring_c"}, {"score": 0.004288581530198804, "phrase": "t._given"}, {"score": 0.004120694410890683, "phrase": "recoloring_distance"}, {"score": 0.004023120753104693, "phrase": "total_weight"}, {"score": 0.0039911102918360995, "phrase": "recolored_vertices"}, {"score": 0.0032164910932827168, "phrase": "convex_recoloring"}, {"score": 0.003065830998810144, "phrase": "phylogenetic_trees"}, {"score": 0.0029931603112397084, "phrase": "related_species"}, {"score": 0.002945669860541221, "phrase": "phylogenetic_reconstruction"}, {"score": 0.002560907803820395, "phrase": "next_best_thing"}, {"score": 0.0021049977753042253, "phrase": "np-hard_problem"}], "paper_keywords": [""], "paper_abstract": "A pair (T, C) of a tree T and a coloring C is called a colored tree, Given a colored tree (T, C) any coloring C' of T is called a recoloring of T. Given a weight function on the vertices of the tree the recoloring distance of a recoloring is the total weight of recolored vertices. A coloring of a tree is convex if for any two vertices u and v that are colored by the same color c, every vertex on the path from u to v is also colored by c. In the minimum convex recoloring problem we are given a colored tree and a weight function and our goal is to find a convex recoloring of minimum recoloring distance. The minimum convex recoloring problem naturally arises in the context of phylogenetic trees. Given a set of related species the goal of phylogenetic reconstruction is to construct a tree that would best describe the evolution of this set of species. In this context a convex coloring correspond to perfect phylogeny. Since perfect phylogeny is not always possible the next best thing is to find a tree which is as close to convex as possible, or, in other words, a tree with minimum recoloring distance. We present a (2+epsilon)-approximation algorithm for the minimum convex recoloring problem, whose running time is O(n(2) + n(1/epsilon)(2)4(1/epsilon)). This result improves the previously known 3-approximation algorithm for this NP-hard problem.", "paper_title": "Improved approximation algorithm for convex recoloring of trees", "paper_id": "WOS:000236483500005"}