{"auto_keywords": [{"score": 0.03636719697804021, "phrase": "natural_language"}, {"score": 0.00481495049065317, "phrase": "diagnostic_terms"}, {"score": 0.004608284537368354, "phrase": "medical_records"}, {"score": 0.0041445748748895365, "phrase": "natural_and_non-standard_language"}, {"score": 0.003952082333580496, "phrase": "large-scale_classification_problem"}, {"score": 0.00385214804128572, "phrase": "finite-state_transducers"}, {"score": 0.003700170452390401, "phrase": "allowed_input_dt_string"}, {"score": 0.0035153544006182834, "phrase": "soft-matching_operations"}, {"score": 0.0034264254358037653, "phrase": "standard_terms"}, {"score": 0.0032079118323314424, "phrase": "standard_resources"}, {"score": 0.002981385933674649, "phrase": "mrs"}, {"score": 0.0025562434609873335, "phrase": "provided_results"}, {"score": 0.00253758084385033, "phrase": "real_mrs"}, {"score": 0.002419542935774618, "phrase": "colloquial_and_specific_language"}, {"score": 0.0023756164484983874, "phrase": "classification_process"}, {"score": 0.002290135975651888, "phrase": "large-scale_classification_task"}, {"score": 0.002248553559414903, "phrase": "composition_operation"}, {"score": 0.002175594509651082, "phrase": "new_features"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Classification of Medical Records", " Natural language processing", " Finite-State Transducers", " Applications in medicine"], "paper_abstract": "The goal of this paper is to classify Medical Records (MRs) by their diagnostic terms (DTs) according to the International Classification of Diseases Clinical Modification (ICD-9-CM). The challenge we face is twofold: (i) to treat the natural and non-standard language in which doctors express their diagnostics and (ii) to perform a large-scale classification problem. We propose the use of Finite-State Transducers (FSTs) that, for their underlying topology, constrain the allowed input DT string while synchronously produce the output ICD-9-CM class. It is outstanding their versatility to efficiently implement soft-matching operations between terms expressed in natural language to standard terms and, hence, to the final ICD-9-CM code. The FSTs were built up from a corpora and standard resources such as the ICD-9-CM and SNOMED CT amongst others. Our corpora count on a big-data comprising more than 20,000 DTs from MRs from the Basque Hospital System so as to model natural language in this domain. An F1-measure of 91.2 was achieved on a test-set of 2850 randomly selected DTs, and a random 5-fold cross validation on a training set served to double-check the stability of the provided results. Real MRs were of much help to adapt the system to natural language. Misspellings, colloquial and specific language and abbreviations made the classification process difficult. The FSTs were proven efficient in this large-scale classification task. Moreover, the composition operation for FSTs made it easy the addition of new features to the system. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Computer aided classification of diagnostic terms in spanish", "paper_id": "WOS:000349271500009"}