{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "perfect_codes"}, {"score": 0.04524520771446886, "phrase": "perfect_code"}, {"score": 0.022352990619706897, "phrase": "side_class_structure"}, {"score": 0.004502943680955863, "phrase": "binary_code"}, {"score": 0.004211069233133584, "phrase": "linear_relations"}, {"score": 0.004141093507753515, "phrase": "coset_representatives"}, {"score": 0.004027031316965272, "phrase": "c._two_perfect_codes"}, {"score": 0.0037658881407605445, "phrase": "non-singular_matrix_a"}, {"score": 0.003501991125315889, "phrase": "code_words"}, {"score": 0.0033301696145557123, "phrase": "hessler"}, {"score": 0.0030113280682863234, "phrase": "isomorphic_side_class_structures"}, {"score": 0.0028316582436089064, "phrase": "side_class_structures"}, {"score": 0.0021049977753042253, "phrase": "classification_purposes"}], "paper_keywords": ["perfect codes", " tilings"], "paper_abstract": "The side class structure of a perfect 1-error correcting binary code (hereafter referred to as a perfect code) C describes the linear relations between the coset representatives of the kernel of C. Two perfect codes C and C' are linearly equivalent if there exists a non-singular matrix A such that AC = C' where C and C' are matrices with the code words of C and C' as columns. Hessler proved that the perfect codes C and C' are linearly equivalent if and only if they have isomorphic side class structures. The aim of this paper is to describe all side class structures. It is shown that the transpose of any side class structure is the dual of a subspace of the kernel of some perfect code and vice versa; any dual of a subspace of a kernel of some perfect code is the transpose of the side class structure of some perfect code. The conclusion is that for classification purposes of perfect codes it is sufficient to find the family of all kernels of perfect codes.", "paper_title": "On the classification of perfect codes: side class structures", "paper_id": "WOS:000239889200005"}