{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "artistic_perspective"}, {"score": 0.004640398886726948, "phrase": "vanishing_points"}, {"score": 0.004472146692254812, "phrase": "perspective_images"}, {"score": 0.004134508282135594, "phrase": "image_space_controls"}, {"score": 0.003822263046602146, "phrase": "projective_geometry"}, {"score": 0.003616108223034427, "phrase": "image_space_constraints"}, {"score": 0.0035828427627676075, "phrase": "planar_regions"}, {"score": 0.0035010071030752883, "phrase": "straight_lines"}, {"score": 0.002883172383460653, "phrase": "entire_mapping"}, {"score": 0.002640636493247601, "phrase": "accurate_perspective_projection"}, {"score": 0.00229844995872581, "phrase": "perspective_composition"}, {"score": 0.0022355167967736326, "phrase": "artistic_perspectives"}, {"score": 0.0021049977753042253, "phrase": "different_images"}], "paper_keywords": [""], "paper_abstract": "Painters and illustrators commonly sketch vanishing points and lines to guide the construction of perspective images. We present a tool that gives users the ability to manipulate perspective in photographs using image space controls similar to those used by artists. Our approach computes a 2D warp guided by constraints based on projective geometry. A user annotates an image by marking a number of image space constraints including planar regions of the scene, straight lines, and associated vanishing points. The user can then use the lines, vanishing points, and other point constraints as handles to control the warp. Our system optimizes the warp such that straight lines remain straight, planar regions transform according to a homography, and the entire mapping is as shape-preserving as possible. While the result of this warp is not necessarily an accurate perspective projection of the scene, it is often visually plausible. We demonstrate how this approach can be used to produce a variety of effects, such as changing the perspective composition of a scene, exploring artistic perspectives not realizable with a camera, and matching perspectives of objects from different images so that they appear consistent for compositing.", "paper_title": "Image Warps for Artistic Perspective Manipulation", "paper_id": "WOS:000279806600096"}