{"auto_keywords": [{"score": 0.04142729289375916, "phrase": "supplier_bids"}, {"score": 0.00481495049065317, "phrase": "procurement_bids"}, {"score": 0.004784331242964228, "phrase": "finite_capacity_environments"}, {"score": 0.004502943680955863, "phrase": "broader_range"}, {"score": 0.004333777641701335, "phrase": "web_services_standards"}, {"score": 0.004292484293656852, "phrase": "important_requirement"}, {"score": 0.004144399274022276, "phrase": "unidimensional_price-based_eprocurement_models"}, {"score": 0.0037062400890170064, "phrase": "temporal_and_finite_capacity_constraints"}, {"score": 0.0036475333460338397, "phrase": "service_providers"}, {"score": 0.0034880375790382586, "phrase": "multiple_key_components"}, {"score": 0.0034109154088832376, "phrase": "possible_suppliers"}, {"score": 0.003293142761521425, "phrase": "delivery_date"}, {"score": 0.0026499429068956686, "phrase": "formal_model"}, {"score": 0.002624651276075191, "phrase": "important_class"}, {"score": 0.002485813299166851, "phrase": "resulting_search_space"}, {"score": 0.002324381111188894, "phrase": "efficient_heuristic_search_procedure"}], "paper_keywords": ["Supply chain management", " Procurement", " Bid selection", " Finite capacity scheduling", " Heuristic search"], "paper_abstract": "Pressure to increase agility and reduce costs is pushing enterprises to dynamically select among offers from a broader range of suppliers. This process is facilitated by the adoption of web services standards. An important requirement in this context is the ability to move away from unidimensional price-based eprocurement models and develop richer solutions that are capable of capturing other important attributes in the selection of supplier bids. Research on the evaluation and selection of supplier bids (\"winner determination\") has traditionally ignored the temporal and finite capacity constraints under which manufacturers and service providers often operate. We consider the problem faced by a firm that procures multiple key components or services from a number of possible suppliers. Bids submitted by suppliers include both a price and a delivery date. The firm has to select a combination of supplier bids that will maximize its overall profit. Profit is determined by the revenue generated by the products (or services) sold by the firm, the costs of the components (or services) it acquires as well as late delivery penalties it incurs if it fails to deliver its products/services in time to its own customers. We provide a formal model of this important class of problems, discuss its complexity and introduce rules that can be used to efficiently prune the resulting search space. We proceed to show that our model can be characterized as a pseudo-early/tardy scheduling problem and use this observation to build an efficient heuristic search procedure. Computational results show that our heuristic procedure typically yields solutions that are within a few percent from the optimum. They further indicate that taking into account the manufacturer/service provider's capacity can significantly improve its bottom line. (C) 2008 Elsevier B.V. All rights reserved.", "paper_title": "Coordinated selection of procurement bids in finite capacity environments", "paper_id": "WOS:000272068500003"}