{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multimodal_networks"}, {"score": 0.004642604455537883, "phrase": "considerable_number"}, {"score": 0.004586531354697466, "phrase": "freight_traffic_assignment_models"}, {"score": 0.0037301606780397456, "phrase": "innovative_traffic_assignment_model"}, {"score": 0.003618443379266972, "phrase": "large_networks"}, {"score": 0.0035530197642369464, "phrase": "strategic_level"}, {"score": 0.0034049123167891955, "phrase": "road_and_rail_transport_modes"}, {"score": 0.0027854565462509095, "phrase": "capacity_constraints"}, {"score": 0.002735052488172277, "phrase": "variable_perception"}, {"score": 0.002511600086227215, "phrase": "stochastic_user_equilibrium_model"}, {"score": 0.002466139325703204, "phrase": "simultaneous_consideration"}, {"score": 0.002320449502337321, "phrase": "traditionally_used_traffic_assignment_techniques"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Freight transportation", " Traffic assignment", " Logit"], "paper_abstract": "Although there is a considerable number of freight traffic assignment models available, they still tend to lag behind their passenger counterparts in terms of maturity of their scientific knowledge. In order to contribute to the improvement of this state of affairs, the authors developed an innovative traffic assignment model, intended to model large networks with a strategic level of planning, which considers both road and rail transport modes and is not very demanding in terms of data. The model applies two different assignment techniques for the two types of cargo considered, with its main innovative feature being the fact that it takes into account both capacity constraints and a variable perception of costs by users, while being much simpler and lighter than a stochastic user equilibrium model. The simultaneous consideration of both of those factors distinguishes it from the traditionally used traffic assignment techniques, namely all or nothing, equilibrium or stochastic (multi-flow) techniques, none of which considers those factors simultaneously. (c) 2012 Elsevier B.V. All rights reserved.", "paper_title": "An innovative freight traffic assignment model for multimodal networks", "paper_id": "WOS:000316425400003"}