{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "socially_oriented_roles"}, {"score": 0.00474283953918251, "phrase": "motivational_modelling"}, {"score": 0.004348580182733617, "phrase": "social_needs"}, {"score": 0.003956971099850658, "phrase": "\"being_fun"}, {"score": 0.003810348067898898, "phrase": "systematic_and_repeatable_process"}, {"score": 0.0036553070575015344, "phrase": "social_domain"}, {"score": 0.0035734052458933547, "phrase": "technology_design"}, {"score": 0.0035065523764817143, "phrase": "case_study"}, {"score": 0.0034279721355412285, "phrase": "meaningful_interactions"}, {"score": 0.002837811982066224, "phrase": "goals_models"}, {"score": 0.0028058141911641225, "phrase": "resulting_data"}, {"score": 0.002543148295176345, "phrase": "better_understanding"}, {"score": 0.002514464610980629, "phrase": "complex_social_relationship"}, {"score": 0.002476721068743341, "phrase": "software_systems"}, {"score": 0.0023313149689465386, "phrase": "useful_boundary_objects"}, {"score": 0.0022363199197710385, "phrase": "disparate_stakeholder_communities"}, {"score": 0.0022110892229209407, "phrase": "end_users"}, {"score": 0.0021944267528581094, "phrase": "software_engineers"}, {"score": 0.002169667676959813, "phrase": "field_researchers"}, {"score": 0.0021049977753042253, "phrase": "design_process"}], "paper_keywords": ["Requirements engineering", " Socially oriented requirements", " Ethnography"], "paper_abstract": "Technology has the potential to transform our home life, but only if it addresses the needs of its users. Understanding and modelling social needs is a challenge. For example, how do we understand, model, and then evaluate a system that must support needs such as \"being fun\"? In this paper, we define a systematic and repeatable process and method for understanding the roles and goals within a social domain for the purpose of informing technology design. We use the case study of building technology that supports meaningful interactions between grandparents and grandchildren separated by distance. Rather than attempt to define the roles of grandparents and grandchildren, and their associated goals, we study the roles and goals of activities in which grandparents and grandchildren typically engage, such as storytelling and gifting, and define role and goals models from the resulting data. The data obtained from the study of these activities provides a form of validation of the models. From these, we gain a better understanding of this complex social relationship, and how software systems can be built to support it. The models that emerge during the process are useful boundary objects, allowing knowledge to be shared across and between the disparate stakeholder communities, including end users, software engineers, and field researchers, and serve as inputs to the design process. (C) 2012 Elsevier Inc. All rights reserved.", "paper_title": "Understanding socially oriented roles and goals through motivational modelling", "paper_id": "WOS:000306728500015"}