{"auto_keywords": [{"score": 0.036868325216934277, "phrase": "kpax"}, {"score": 0.00481495049065317, "phrase": "gaussian_overlap_scoring"}, {"score": 0.004767261858417823, "phrase": "backbone_peptide_fragment_similarity"}, {"score": 0.004604023526673226, "phrase": "protein_structures"}, {"score": 0.0036980501827538455, "phrase": "considerable_challenge"}, {"score": 0.003553540530701019, "phrase": "novel_protein_structure_alignment_algorithm"}, {"score": 0.003397683082821229, "phrase": "highly_predictable_covalent_geometry"}, {"score": 0.0032975819773787985, "phrase": "multiple_local_coordinate_frames"}, {"score": 0.0032486392192981944, "phrase": "backbone_peptide_fragments"}, {"score": 0.0031372369299648203, "phrase": "sensitive_gaussian_overlap_scoring_functions"}, {"score": 0.0029403531729828574, "phrase": "dynamic_programming"}, {"score": 0.0029111767710750117, "phrase": "secondary_structure-specific_gap_penalties"}, {"score": 0.0027420820738468577, "phrase": "tighter_secondary_structure"}, {"score": 0.002634830238219976, "phrase": "cath_database"}, {"score": 0.002444883254621769, "phrase": "almost_the_same_high_level"}, {"score": 0.0023846534541336326, "phrase": "tm-align"}, {"score": 0.0021474369836979048, "phrase": "supplementary_data"}, {"score": 0.0021050447939584722, "phrase": "bioinformatics"}], "paper_keywords": [""], "paper_abstract": "Motivation: Aligning and comparing protein structures is important for understanding their evolutionary and functional relationships. With the rapid growth of protein structure databases in recent years, the need to align, superpose and compare protein structures rapidly and accurately has never been greater. Many structural alignment algorithms have been described in the past 20 years. However, achieving an algorithm that is both accurate and fast remains a considerable challenge. Results: We have developed a novel protein structure alignment algorithm called 'Kpax', which exploits the highly predictable covalent geometry of C(a) atoms to define multiple local coordinate frames in which backbone peptide fragments may be oriented and compared using sensitive Gaussian overlap scoring functions. A global alignment and hence a structural superposition may then be found rapidly using dynamic programming with secondary structure-specific gap penalties. When superposing pairs of structures, Kpax tends to give tighter secondary structure overlays than several popular structure alignment algorithms. When searching the CATH database, Kpax is faster and more accurate than the very efficient Yakusa algorithm, and it gives almost the same high level of fold recognition as TM-Align while being more than 100 times faster. Availability and implementation: http://kpax.loria.fr/. Contact: Dave.Ritchie@inria.fr. SUPPLEMENTARY INFORMATION: Supplementary data are available at Bioinformatics online.", "paper_title": "Fast protein structure alignment using Gaussian overlap scoring of backbone peptide fragment similarity", "paper_id": "WOS:000312105300016"}