{"auto_keywords": [{"score": 0.04342542707462748, "phrase": "parameter_values"}, {"score": 0.00481495049065317, "phrase": "bayesian_networks"}, {"score": 0.003961613484271729, "phrase": "appropriate_set"}, {"score": 0.0038413947966606118, "phrase": "easy_task"}, {"score": 0.0034308688638878286, "phrase": "parameter_setting"}, {"score": 0.003192700856094016, "phrase": "fairly_restricted_application_range"}, {"score": 0.0030171910207671205, "phrase": "user_supervision"}, {"score": 0.0028221322455573624, "phrase": "best_parameter_values"}, {"score": 0.00263965046277432, "phrase": "automatic_meta-model"}, {"score": 0.00250732953434891, "phrase": "evaluation_purposes"}, {"score": 0.0022973933270056743, "phrase": "real_geometric_problem"}, {"score": 0.0021709933368474223, "phrase": "proposed_adjustment_model"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["setting parameters", " Bayesian networks", " learning", " genetic algorithms", " constructive geometric constraint solving"], "paper_abstract": "One of the difficulties that the user faces when using a model to solve a problem is that, before running the model, a set of parameter values have to be specified. Deciding on an appropriate set of parameter values is not an easy task. Over the years, several standard optimization methods, as well as various alternative approaches according to the problem at hand, have been proposed for parameter setting. These techniques have their merits and demerits, but usually they have a fairly restricted application range, including a lack of generality or the need of user supervision. This paper proposes a meta-model that generates the recommendations about the best parameter values for the model of interest. Its main characteristic is that it is an automatic meta-model that can be applied to any model. For evaluation purposes and in order to be able to compare our results with results obtained by others, a real geometric problem was selected. The experiments show the validity of the proposed adjustment model. (c) 2007 Elsevier Ltd. All rights reserved.", "paper_title": "A model for parameter setting based on Bayesian networks", "paper_id": "WOS:000253038200002"}