{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "generalised_recombination"}, {"score": 0.00469159356595623, "phrase": "first_part"}, {"score": 0.004631099806015235, "phrase": "two-part_paper"}, {"score": 0.004454237726525018, "phrase": "general_notion"}, {"score": 0.004377806391261418, "phrase": "fixed-length_strings"}, {"score": 0.0043213410601860985, "phrase": "homologous_recombination"}, {"score": 0.0037786899855446, "phrase": "model's_equations"}, {"score": 0.0034953361767153285, "phrase": "microscopic_and_coarse-grained_evolution_equations"}, {"score": 0.003361702510958392, "phrase": "simple_examples"}, {"score": 0.003261295948815592, "phrase": "hierarchical_nature"}, {"score": 0.0032191849045822415, "phrase": "schema_evolution_equations"}, {"score": 0.0030560920414081645, "phrase": "evolutionary_computation"}, {"score": 0.0029012378668247397, "phrase": "fixed_points"}, {"score": 0.0027304365438083874, "phrase": "geiringer's_theorem"}, {"score": 0.0026259694526633037, "phrase": "infinite-population_schema_equations"}, {"score": 0.0022758994740331258, "phrase": "infinite-population-model_predictions"}, {"score": 0.0022174469839432013, "phrase": "real_ga"}, {"score": 0.0021233361369222344, "phrase": "finite_populations"}, {"score": 0.0021049977753042253, "phrase": "different_sizes"}], "paper_keywords": [""], "paper_abstract": "This is the first part of a two-part paper where we propose, model theoretically and study a general notion of recombination for fixed-length strings, where homologous recombination, inversion, gene duplication, gene deletion, diploidy and more are just special cases. The analysis of the model reveals that the notion of schema emerges naturally from the model's equations. In Part 1, after describing and characterising the notion of generalised recombination, we derive both microscopic and coarse-grained evolution equations for strings and schemata and illustrate their features with simple examples. Also, we explain the hierarchical nature of the schema evolution equations and show how the theory presented here generalises past work in evolutionary computation. In Part 11, the study provides a variety of fixed points for evolution in the case where recombination is used alone, which generalise Geiringer's theorem. In addition, we numerically integrate the infinite-population schema equations for some interesting problems, where selection and recombination are used together to illustrate how these operators interact. Finally, to assess by how much genetic drift can make a system deviate from the infinite-population-model predictions we discuss the results of real GA runs for the same model problems with generalised recombination, selection and finite populations of different sizes.", "paper_title": "Understanding the biases of generalised recombination: Part I", "paper_id": "WOS:000242445900002"}