{"auto_keywords": [{"score": 0.033826872309736175, "phrase": "corrupted_data"}, {"score": 0.017612090060421737, "phrase": "critical_infrastructure_cyber-physical_systems"}, {"score": 0.00481495049065317, "phrase": "survey_of_research_on_data_corruption"}, {"score": 0.004760017604908536, "phrase": "cyber-physical_critical_infrastructure_systems"}, {"score": 0.004494570360108983, "phrase": "modern_life"}, {"score": 0.003916098498242888, "phrase": "erroneous_data"}, {"score": 0.0038271712887391015, "phrase": "severe_consequences"}, {"score": 0.0037834649508375544, "phrase": "financial_loss"}, {"score": 0.0033922781038328844, "phrase": "heavily_data"}, {"score": 0.0025596276616952516, "phrase": "comparative_analysis"}, {"score": 0.002321234686549485, "phrase": "negative_effects"}, {"score": 0.002294686545883412, "phrase": "system_execution"}, {"score": 0.0022296340517805125, "phrase": "key_topics"}, {"score": 0.0021416404045850224, "phrase": "corrupted_data_propagates"}, {"score": 0.0021049977753042253, "phrase": "critical_infrastructure_cyber-physical_system"}], "paper_keywords": [""], "paper_abstract": "Computer systems are present in every aspect of modern life. In many of these systems, corruption of data is unavoidable as a result of both intentional and unintentional means. In many systems, this erroneous data can result in severe consequences including financial loss, injury, or death. Critical infrastructure cyber-physical systems utilize intelligent control to improve performance; however, they are heavily data dependent. These systems have the potential to propagate corrupted data, leading to failure. This chapter presents a survey of work related to the propagation of corrupted data within critical infrastructure cyber-physical systems, including the sources of corrupted data and the structure of critical infrastructure cyber-physical systems. In addition, it presents a comparative analysis of various data corruption detection and mitigation techniques. Additionally, we discuss a number of studies on the negative effects of system execution on corrupted data. These key topics are essential to understanding how undetected corrupted data propagates through a critical infrastructure cyber-physical system.", "paper_title": "A Survey of Research on Data Corruption in Cyber-Physical Critical Infrastructure Systems", "paper_id": "WOS:000370521900003"}