{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "data_structures"}, {"score": 0.004466519142879166, "phrase": "adaptive_adversary"}, {"score": 0.004000396172153709, "phrase": "memory_locations"}, {"score": 0.003785836059995376, "phrase": "data_structure"}, {"score": 0.00347657813672945, "phrase": "uncorrupted_values"}, {"score": 0.0033905067962602515, "phrase": "resilient_dictionary"}, {"score": 0.002816246391862638, "phrase": "deterministic_resilient_dictionary"}, {"score": 0.002534596206835737, "phrase": "arbitrary_constant"}, {"score": 0.0024348510123716424, "phrase": "resilient_comparison-based_dictionary"}, {"score": 0.002158505888557746, "phrase": "independent_interest"}], "paper_keywords": ["Memory faults", " memory models", " unreliable information", " software-based fault tolerance", " search trees"], "paper_abstract": "We address the problem of designing data structures in the presence of faults that may arbitrarily corrupt memory locations. More precisely, we assume that an adaptive adversary can arbitrarily overwrite the content of up to delta memory locations, that corrupted locations cannot be detected, and that only O(1) memory locations are safe. In this framework, we call a data structure resilient if it is able to operate correctly (at least) on the set of uncorrupted values. We present a resilient dictionary, implementing search, insert, and delete operations. Our dictionary has O(log n + delta) expected amortized time per operation, and O(n) space complexity, where n denotes the current number of keys in the dictionary. We also describe a deterministic resilient dictionary, with the same amortized cost per operation over a sequence of at least delta(epsilon) operations, where epsilon > 0 is an arbitrary constant. Finally, we show that any resilient comparison-based dictionary must take Omega(log n + delta) expected time per search. Our results are achieved by means of simple, new techniques which might be of independent interest for the design of other resilient algorithms.", "paper_title": "Resilient Dictionaries", "paper_id": "WOS:000273223500001"}