{"auto_keywords": [{"score": 0.04208729377636017, "phrase": "assert"}, {"score": 0.00418134346679498, "phrase": "particular_corpus"}, {"score": 0.003955787027818301, "phrase": "state-of-the_art_srl_system"}, {"score": 0.003576286811853861, "phrase": "different_genre"}, {"score": 0.0035048567587934254, "phrase": "starting_point"}, {"score": 0.0032658649336454923, "phrase": "propbank_corpus"}, {"score": 0.002750934994181092, "phrase": "propbanked_wsj_data"}, {"score": 0.002723301730223192, "phrase": "propbanked_brown_corpus_data"}, {"score": 0.0024993218789131437, "phrase": "new_corpus"}, {"score": 0.0024742098091226203, "phrase": "argument_classification"}, {"score": 0.0021807544600219216, "phrase": "classification_task"}, {"score": 0.0021049977753042253, "phrase": "argument_identification_task"}], "paper_keywords": [""], "paper_abstract": "Most semantic role labeling (SRL) research has been focused on training and evaluating on the same corpus. This strategy, although appropriate for initiating research, can lead to overtraining to the particular corpus. This article describes the operation of ASSERT, a state-of-the art SRL system, and analyzes the robustness of the system when trained on one genre of data and used to label a different genre. As a starting point, results are first presented for training and testing the system on the PropBank corpus, which is annotated Wall Street journal (WSJ) data. Experiments are then presented to evaluate the portability of the system to another source of data. These experiments are based on comparisons of performance using PropBanked WSJ data and PropBanked Brown Corpus data. The results indicate that whereas syntactic parses and argument identification transfer relatively well to a new corpus, argument classification does not. An analysis of the reasons for this is presented and these generally point to the nature of the more lexical/semantic features dominating the classification task where more general structural features are dominant in the argument identification task.", "paper_title": "Towards robust semantic role labeling", "paper_id": "WOS:000257139400006"}