{"auto_keywords": [{"score": 0.046819005802717, "phrase": "customer_emotions"}, {"score": 0.010612387000973441, "phrase": "product_design"}, {"score": 0.004674333455266527, "phrase": "customer_needs"}, {"score": 0.004421601997620278, "phrase": "traditional_cognitive_approaches"}, {"score": 0.0043889488321824785, "phrase": "product_usability"}, {"score": 0.0031786037839399055, "phrase": "product_development"}, {"score": 0.0030856268625708695, "phrase": "subjective_and_objective_methods"}, {"score": 0.003006499028632742, "phrase": "customer_emotion"}, {"score": 0.0028542615085879975, "phrase": "sales_potential"}, {"score": 0.0027097117582440687, "phrase": "indefinite_relationship"}, {"score": 0.0026109540617641593, "phrase": "strong_effect"}, {"score": 0.002335707508067455, "phrase": "designer's_environment"}, {"score": 0.002267329954548889, "phrase": "product_development_life_cycle"}, {"score": 0.0022173607419126817, "phrase": "measured_emotions"}, {"score": 0.0021684903968454267, "phrase": "design_process"}, {"score": 0.0021049977753042253, "phrase": "pleasurable_and_satisfying_product"}], "paper_keywords": ["customer emotions", " affective interfaces", " product design", " human factors"], "paper_abstract": "Most studies on product design have focused on customer needs concerning functionality and utility. Rarely has the issue of customer emotions been investigated. Traditional cognitive approaches to product usability tend to underestimate the importance of customer emotions in design. Not surprisingly, the success of a product in the marketplace may be determined by its aesthetic appeal, the pleasure it creates, and the satisfaction it brings to the customer. Emotions influence how a customer interacts with the product. In the interaction, feelings accompany thinking. This article characterizes customer emotions and issues concerning their measurement. The literature has documented various methods for measuring and evaluating emotions, but only a few are relevant to product development. In this article, we illustrate subjective and objective methods that are commonly used in evaluating customer emotion to an artifact. While evidence suggests that emotion matters in determining the sales potential of products, the measurement of emotions may be difficult because of the indefinite relationship between an emotion and its behavioral expression. Culture has a strong effect on what customers look for in a product and how they interpret the product and its interfaces. We present a framework for analysis of customer emotions in relation to the designer's environment. The framework is part of the product development life cycle, where customer needs and measured emotions are input early in the design process. The goal is to achieve a pleasurable and satisfying product.", "paper_title": "Customer emotional needs in product design", "paper_id": "WOS:000240762900004"}