{"auto_keywords": [{"score": 0.04964156968469261, "phrase": "sybil_attack"}, {"score": 0.007527190628427755, "phrase": "honest_peers"}, {"score": 0.004494573198106828, "phrase": "sybil"}, {"score": 0.004412780054037622, "phrase": "single_malicious_user"}, {"score": 0.004372442291178139, "phrase": "multiple_peer_identities"}, {"score": 0.0038981499110532307, "phrase": "novel_solution"}, {"score": 0.0037060428445111694, "phrase": "high_probability"}, {"score": 0.0034911335714333507, "phrase": "non-sybil_peer"}, {"score": 0.0034433297275344877, "phrase": "symon"}, {"score": 0.00338060449446278, "phrase": "peer's_symon"}, {"score": 0.0031121406603482112, "phrase": "chosen_symon"}, {"score": 0.0021342613107011624, "phrase": "possible_ways"}], "paper_keywords": ["Sybil attack", " P2P networks", " Structured overlay", " Reputation system", " DOS attack"], "paper_abstract": "Sybil attack is one of the most challenging problems that plague current decentralized Peer-to-Peer(P2P) systems. In Sybil attack, a single malicious user creates multiple peer identities known as sybils. These sybils are employed to target honest peers and hence subvert the system. In this paper, we describe a novel solution that enables all honest peers to protect themselves from sybils with high probability in large structured P2P systems. In our proposed sybil defense system, we associate every peer with another non-sybil peer known as SyMon. A given peer's SyMon is chosen dynamically such that the chances of both of them being sybils are very low. The chosen SyMon is entrusted with the responsibility of moderating the transactions involving the given peer and hence makes it almost impossible for sybils to compromise the system. We show the effectiveness of our proposed system in defending against Sybil attack both analytically and experimentally. In addition to this, we explore the feasibility of our proposed solution in two P2P applications: reputation systems for P2P based file sharing applications and P2P applications susceptible to Denial-of-Service(DOS) attack, systems known to be highly vulnerable to Sybil attack. In each of our case studies, we discuss possible ways in which our solution can be employed to defend the system against Sybil attack.", "paper_title": "SyMon: A practical approach to defend large structured P2P systems against Sybil Attack", "paper_id": "WOS:000290276500007"}