{"auto_keywords": [{"score": 0.03500396611823986, "phrase": "feedback_trading"}, {"score": 0.01279135519752746, "phrase": "uninformed_traders"}, {"score": 0.004463958296056236, "phrase": "internet_stock_trading"}, {"score": 0.004380265418103948, "phrase": "relatively_inexperienced_investors"}, {"score": 0.004298134888203576, "phrase": "financial_markets"}, {"score": 0.0038365781437074017, "phrase": "dynamic_equilibrium_framework"}, {"score": 0.0033814348757887232, "phrase": "feedback_strategies"}, {"score": 0.003235193484261443, "phrase": "market_equilibrium"}, {"score": 0.0030757650386969903, "phrase": "informed_trader's_equilibrium_strategy"}, {"score": 0.002373690110881497, "phrase": "higher_risk"}, {"score": 0.0022142194702079866, "phrase": "uninformed_traders'_risks"}], "paper_keywords": ["Financial information", " financial market", " feedback strategy", " market stability", " online trading"], "paper_abstract": "The ease of Internet stock trading has lured relatively inexperienced investors into the financial markets. This paper is a study of the consequences of the influx of these uninformed traders with a dynamic equilibrium framework. The results show that these strategic, uninformed online traders who adopt feedback strategies cannot outperform those who do not follow feedback strategies and that feedback trading cannot affect market equilibrium. The results also show that an informed trader's equilibrium strategy and expected profit remain unchanged with or without feedback trading. The presence of feedback trading in the market does not affect the speed at which information gets incorporated into prices. If uninformed traders aggregately adopt a more aggressive feedback trading strategy, they bear a higher risk. It is therefore important to manage and contain these uninformed traders' risks. The implications for regulating and designing such Internet trading systems are also discussed.", "paper_title": "HOW DOES THE INTERNET AFFECT THE FINANCIAL MARKET? AN EQUILIBRIUM MODEL OF INTERNET-FACILITATED FEEDBACK TRADING", "paper_id": "WOS:000348600600003"}