{"auto_keywords": [{"score": 0.047667240890459914, "phrase": "cultural_differences"}, {"score": 0.008530267102714028, "phrase": "interorganizational_learning"}, {"score": 0.00481495049065317, "phrase": "project_control"}, {"score": 0.004514054236466542, "phrase": "global"}, {"score": 0.003992729692096799, "phrase": "multiple_levels"}, {"score": 0.003916098498242888, "phrase": "control_mechanisms"}, {"score": 0.003163985877966426, "phrase": "exploratory_single-case_study_design"}, {"score": 0.0027982016314450717, "phrase": "information_systems_development_outsourcing_projects"}, {"score": 0.002726740692380339, "phrase": "key_finding"}, {"score": 0.002639968630788011, "phrase": "informal_controls"}, {"score": 0.0025725382476862305, "phrase": "formal_controls"}, {"score": 0.002380381895973937, "phrase": "control_dynamics"}], "paper_keywords": ["Cultural differences", " Formal control", " Informal control", " Interorganizational learning", " IS outsourcing", " Multisourcing", " Global information systems development"], "paper_abstract": "Research into global, multisource, information systems development outsourcing projects has uncovered management challenges, including cultural differences on multiple levels. While control mechanisms and interorganizational learning have been shown to contribute to the mitigation of cultural differences in such projects, a gap persists regarding the effect of the interplay between these mechanisms. This study employs an exploratory single-case study design to analyze how formal and informal control mechanisms and interorganizational learning interact and thus contribute to the mitigation of cultural differences in global, multisource, information systems development outsourcing projects. With the key finding that the influence of informal controls and interorganizational learning on formal controls changes over time, this research helps expand the domain of control dynamics in global IS projects. This study also contributes to literature on ways to handle cultural differences in global, multisource, IS outsourcing projects.", "paper_title": "The Interplay of Project Control and Interorganizational Learning: Mitigating Effects on Cultural Differences in Global, Multisource ISD Outsourcing Projects", "paper_id": "WOS:000306210500002"}