{"auto_keywords": [{"score": 0.04938622488322166, "phrase": "combination_generator"}, {"score": 0.00481495049065317, "phrase": "combination_generators"}, {"score": 0.004676575291629554, "phrase": "popular_stream_cipher_construction"}, {"score": 0.00436890075128947, "phrase": "boolean_function"}, {"score": 0.003775803846431323, "phrase": "particular_cases"}, {"score": 0.0034760655218366, "phrase": "achterbahn"}, {"score": 0.003278878522165815, "phrase": "classical_correlation_attack"}, {"score": 0.002711842889248926, "phrase": "optimal_attack"}, {"score": 0.002672511078070529, "phrase": "particular_generator"}, {"score": 0.0026466064623118105, "phrase": "generic_formulas"}, {"score": 0.002608218347502229, "phrase": "data-time-space_complexities"}, {"score": 0.002331939016161089, "phrase": "boolean"}, {"score": 0.0022536005664642294, "phrase": "considered_improvements"}, {"score": 0.002135995282374723, "phrase": "linear_attacks"}, {"score": 0.0021049977753042253, "phrase": "block_ciphers"}], "paper_keywords": ["Correlation attacks", " Stream cipher", " NLFSR", " Parity-check"], "paper_abstract": "The combination generator is a popular stream cipher construction. It consists of several independent devices working in parallel whose outputs are combined by a Boolean function. The output of this function is the keystream. The security of this generator has been extensively studied in the case where the devices are LFSRs. Some particular cases where the devices are nonlinear have also been studied, most notably the different versions of the eSTREAM proposal named Achterbahn. Several cryptanalysis techniques against these ciphers have been published, extending the classical correlation attack. But each of these attacks has been presented mainly in a very particular scenario. Therefore, this paper aims at generalising these methods to any combination generator in order to be able to compare their respective advantages and to determine the optimal attack for each particular generator. Generic formulas for the data-time-space complexities are then provided, which only depend on the number of devices, their periods and the number of their internal states and of the Boolean combining function. Some of the considered improvements can also be used in a much more general context, which includes linear attacks against some block ciphers.", "paper_title": "Correlation attacks on combination generators", "paper_id": "WOS:000208851200002"}