{"auto_keywords": [{"score": 0.031992588399962184, "phrase": "parallel_filters"}, {"score": 0.015719716506582538, "phrase": "error_correction_codes"}, {"score": 0.01287715979194417, "phrase": "fault_tolerance"}, {"score": 0.004765482708043842, "phrase": "digital_filters"}, {"score": 0.004644014990871423, "phrase": "signal_processing_and_communication_systems"}, {"score": 0.004275650416511604, "phrase": "tolerant_filter_implementations"}, {"score": 0.004039423410198574, "phrase": "filters'_structure"}, {"score": 0.0035866734383189366, "phrase": "complex_systems"}, {"score": 0.003201018846103988, "phrase": "different_input_signals"}, {"score": 0.0031193028729331667, "phrase": "simple_technique"}, {"score": 0.0024586427394152196, "phrase": "traditional_ecc."}, {"score": 0.0024333239726872604, "phrase": "new_scheme"}, {"score": 0.0022283519468680475, "phrase": "case_study"}, {"score": 0.0022053994402287925, "phrase": "parallel_finite_impulse_response_filters"}, {"score": 0.0021049977753042253, "phrase": "implementation_cost"}], "paper_keywords": ["Error correction codes (ECCs)", " filters", " soft errors"], "paper_abstract": "Digital filters are widely used in signal processing and communication systems. In some cases, the reliability of those systems is critical, and fault tolerant filter implementations are needed. Over the years, many techniques that exploit the filters' structure and properties to achieve fault tolerance have been proposed. As technology scales, it enables more complex systems that incorporate many filters. In those complex systems, it is common that some of the filters operate in parallel, for example, by applying the same filter to different input signals. Recently, a simple technique that exploits the presence of parallel filters to achieve fault tolerance has been presented. In this brief, that idea is generalized to show that parallel filters can be protected using error correction codes (ECCs) in which each filter is the equivalent of a bit in a traditional ECC. This new scheme allows more efficient protection when the number of parallel filters is large. The technique is evaluated using a case study of parallel finite impulse response filters showing the effectiveness in terms of protection and implementation cost.", "paper_title": "Fault Tolerant Parallel Filters Based on Error Correction Codes", "paper_id": "WOS:000349420400016"}