{"auto_keywords": [{"score": 0.035358174183843176, "phrase": "soft-state_protocols"}, {"score": 0.013970131674390733, "phrase": "soft-state_control_mechanism"}, {"score": 0.013088516571197214, "phrase": "control_state"}, {"score": 0.012772259931512169, "phrase": "refresh_messages"}, {"score": 0.011072294306924305, "phrase": "resource_utilization"}, {"score": 0.009557218360466377, "phrase": "message_retransmission"}, {"score": 0.00481495049065317, "phrase": "soft-state_signaling_protocols"}, {"score": 0.004775531918452571, "phrase": "gmpls-based_wdm_networks"}, {"score": 0.0035661605757956096, "phrase": "reserved_resource"}, {"score": 0.00327086925741257, "phrase": "hard-state_protocols"}, {"score": 0.0031649018957020337, "phrase": "control_states"}, {"score": 0.002740109776120878, "phrase": "gmpls_rsvp-te"}, {"score": 0.002684257009647205, "phrase": "markov_model"}, {"score": 0.002618730478351454, "phrase": "rsvp-te."}, {"score": 0.002513046206149166, "phrase": "rsvp-te"}, {"score": 0.002431570196486513, "phrase": "hard-state_protocol"}, {"score": 0.0024017007954518065, "phrase": "loss_probability"}, {"score": 0.002193559776999383, "phrase": "poor_resource_utilization"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": [""], "paper_abstract": "Wavelength-routed Generalized Multi-Protocol Label Switching (GMPLS) networks use Resource reSerVation ProtocolTraffic Engineering (RSVP-TE) as signaling protocol to set up and tear down lightpaths. RSVP-TE uses a soft-state control mechanism to manage lightpaths. In the soft-state control mechanism, each node sets a timer for each control state and resets the timer with refresh messages to maintain the state. When the timer expires due to losses of refresh messages, the control state is initialized and a reserved resource managed with the state is released. It has been considered that resource utilization of soft-state protocols is inferior to that of hard-state protocols, since soft-state protocols may reserve resources until control states are deleted due to timeout. Therefore, some extensions to promote the performance of soft-state protocols, such as message retransmission, have been considered. In this paper, we analyze the behavior of GMPLS RSVP-TE and its variants with a Markov model and analyze the performance of RSVP-TE. From the results, we demonstrate that resource utilization of RSVP-TE can be equivalent to that of a hard-state protocol when the loss probability of signaling messages is low. We also investigate the effectiveness of message retransmission and show that using message retransmission leads to poor resource utilization in some cases. Copyright (C) 2012 John Wiley & Sons, Ltd.", "paper_title": "Analyses of soft-state signaling protocols in GMPLS-Based WDM networks", "paper_id": "WOS:000308585800005"}