{"auto_keywords": [{"score": 0.038198640349319024, "phrase": "ea_standards"}, {"score": 0.007049088074778177, "phrase": "information_technology"}, {"score": 0.00481495049065317, "phrase": "enterprise_architecture_standards"}, {"score": 0.004564291332315995, "phrase": "enterprise-wide_capability"}, {"score": 0.004390192910013225, "phrase": "different_business_units"}, {"score": 0.003831310632470526, "phrase": "firm-level_survey"}, {"score": 0.0035100601949451028, "phrase": "different_governance_mechanisms"}, {"score": 0.0029458777184930896, "phrase": "ea_standards_management"}, {"score": 0.0025578967205807843, "phrase": "data_resources"}, {"score": 0.0025331002386232014, "phrase": "business_units"}, {"score": 0.0022756672722130424, "phrase": "detailed_insights"}, {"score": 0.002199363362666037, "phrase": "governance_mechanisms"}, {"score": 0.0021049977753042253, "phrase": "enterprisewide_goals"}], "paper_keywords": ["enterprise architecture", " information system governance", " information technology architecture", " organizational standards"], "paper_abstract": "Organizations increasingly need to build an enterprise-wide capability to leverage technology that is distributed in different business units. Some organizations establish enterprise architecture (EA) standards to enable greater compatibility of information technology (IT) components and integration of applications and data across the enterprise. Through a firm-level survey, we sought to answer two key questions about the use of EA standards: (1) How do different governance mechanisms affect the use of EA standards? and (2) To what extent does the use of EA standards help organizations to improve the sharing and integration of IT resources across the enterprise? We identified four key governance mechanisms for EA standards management and examined how each mechanism affected the use of EA standards. We also examined how the use of EA standards affects the management of IT infrastructure, applications, and data resources across business units. Our empirical results showed that the use of EA standards is effective in helping organizations to better manage their IT resources. Our study also provides detailed insights into how organizations can set up governance mechanisms to facilitate the use of EA standards in achieving enterprisewide goals.", "paper_title": "Using enterprise architecture standards in managing information technology", "paper_id": "WOS:000243480700008"}