{"auto_keywords": [{"score": 0.042875391160717424, "phrase": "user's_secret_keys"}, {"score": 0.03751951230806167, "phrase": "helper_key-exposure"}, {"score": 0.01397857251528385, "phrase": "user's_helper"}, {"score": 0.013232489800110598, "phrase": "time_period"}, {"score": 0.01117816607411733, "phrase": "ibkis_scheme"}, {"score": 0.009818450201472205, "phrase": "frequent_key-updates"}, {"score": 0.00481495049065317, "phrase": "id-based_signatures"}, {"score": 0.004739416327250269, "phrase": "et_al"}, {"score": 0.004628320711601916, "phrase": "id-based_key-insulated_signature"}, {"score": 0.0037978390554858766, "phrase": "secret_keys"}, {"score": 0.0037679023889496885, "phrase": "ibkis_schemes"}, {"score": 0.0033860360186761533, "phrase": "strong_key-insulated_security"}, {"score": 0.0027999339042953076, "phrase": "hanaoka_et_al"}, {"score": 0.0027559226203857316, "phrase": "parallel_key-insulated_mechanism"}, {"score": 0.0027341763737751467, "phrase": "id-based_signature_scenarios"}, {"score": 0.002680556511196791, "phrase": "id-based_parallel_key-insulated_signature"}, {"score": 0.002596937660779953, "phrase": "zhou_et_al"}, {"score": 0.0021049977753042253, "phrase": "user's_helpers"}], "paper_keywords": ["parallel key-insulated", " identity-based signature", " key-exposure", " bilinear pairings"], "paper_abstract": "To minimize the damage caused by key-exposure in ID-based signatures, in ISPEC'06 Zhou et al (2006) proposed an ID-based key-insulated signature (IBKIS) scheme. However, their scheme is not strong key-insulated, i.e, if a user's helper is compromised, the adversary can derive all of this user's secret keys for any time period. Moreover, in practice, to alleviate the damage in case of key-exposure, secret keys in IBKIS schemes have to be updated at very short intervals, which will increase the risk of helper key-exposure. It is important to note that even for an IBKIS scheme with strong key-insulated security, once a user's helper and one of his secret keys are both compromised, the adversary can also derive all of this user's secret keys for any time period. Is it possible to allow frequent key-updates without increasing the risk of helper key-exposure in IBKIS systems? In this paper, we extend Hanaoka et al (2006) parallel key-insulated mechanism to ID-based signature scenarios, and present an ID-based parallel key-insulated signature (IBPKIS) scheme. Compared with Zhou et al (2006) IBKIS scheme, our scheme enjoys three attractive features: (i) it is strong key-insulated; (ii) it can allow frequent key-updates without increasing the risk of helper key-exposure, and over all, enhances the security of the system; (iii) even if one of a user's helpers and some of his secret keys are both exposed, it is impossible for an adversary to derive all of this user's secret keys.", "paper_title": "Identity-based parallel key-insulated signature: Framework and construction", "paper_id": "WOS:000254840600005"}