{"auto_keywords": [{"score": 0.04894388481876895, "phrase": "distributed_decisions"}, {"score": 0.008624960561655352, "phrase": "local_view"}, {"score": 0.005180463285841612, "phrase": "three-user_double_z-channel"}, {"score": 0.00481495049065317, "phrase": "interference_channels"}, {"score": 0.004620885890478087, "phrase": "large_size"}, {"score": 0.004589307360976108, "phrase": "wireless_networks"}, {"score": 0.00438921882244081, "phrase": "complete_network_state"}, {"score": 0.003932929770322298, "phrase": "global_network_performance"}, {"score": 0.0038793218280304825, "phrase": "achievable_sum_rates"}, {"score": 0.0037228262889889402, "phrase": "protocol_abstraction"}, {"score": 0.0035849042994947366, "phrase": "proposed_protocol"}, {"score": 0.00349979888845939, "phrase": "network_state"}, {"score": 0.0034284557556382815, "phrase": "network-state_information"}, {"score": 0.0030612062471277388, "phrase": "natural_metric"}, {"score": 0.002998776886514782, "phrase": "local_information"}, {"score": 0.0027805362553564336, "phrase": "achievable_sum_rate"}, {"score": 0.002761499542632865, "phrase": "partial_message_passing_leading"}, {"score": 0.0024996360740525284, "phrase": "global_information"}, {"score": 0.002465516335722086, "phrase": "actual_channel_gains"}, {"score": 0.002148860300945803, "phrase": "unbounded_losses"}, {"score": 0.002126816206925344, "phrase": "full_information_case"}, {"score": 0.0021049977753042253, "phrase": "channel_gains"}], "paper_keywords": ["Distributed decisions", " double Z-channel", " interference channel", " local view", " message passing", " universally optimal strategy", " Z-channel"], "paper_abstract": "Due to the large size of wireless networks, it is often impractical for nodes to track changes in the complete network state. As a result, nodes have to make distributed decisions about their transmission and reception parameters based on their local view of the network. In this paper, we characterize the impact of distributed decisions on the global network performance in terms of achievable sum rates. We first formalize the concept of local view by proposing a protocol abstraction using the concept of local message passing. In the proposed protocol, nodes forward information about the network state to other neighboring nodes, thereby allowing network-state information to trickle to all the nodes. The protocol proceeds in rounds, where all transmitters send a message followed by a message by all receivers. The number of rounds then provides a natural metric to quantify the extent of local information at each node. We next study two network connectivities, Z-channel, and a three-user double Z-channel. In each case, we characterize achievable sum rate with partial message passing leading to two main results. First, in many cases, nodes can make distributed decisions with only local information about the network and can still achieve the same sum capacity as can be attained with global information irrespective of the actual channel gains. We label such schemes as universally optimal. Second, for the case of three-user double Z-channel, we show that universal optimality is not achievable if the per node information is below a threshold. In fact, distributed decisions can lead to unbounded losses compared to full information case for some channel gains.", "paper_title": "Sum Capacity of Interference Channels With a Local View: Impact of Distributed Decisions", "paper_id": "WOS:000300845900021"}