{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "voice_features"}, {"score": 0.049670185839542434, "phrase": "obstructive_sleep_apnoea"}, {"score": 0.004719555598790209, "phrase": "diagnosis_support"}, {"score": 0.0046128342233041405, "phrase": "highly_prevalent_disease"}, {"score": 0.004534372661692015, "phrase": "adult_male_population"}, {"score": 0.00430687080979172, "phrase": "reference_diagnostic_method"}, {"score": 0.004282306980344864, "phrase": "polysomnography"}, {"score": 0.004257890242243609, "phrase": "psg"}, {"score": 0.0040790508299443804, "phrase": "specialized_equipment"}, {"score": 0.0038965391824276594, "phrase": "polysomnography_diagnosis"}, {"score": 0.0038083571280418623, "phrase": "speech_analysis"}, {"score": 0.003711526585463874, "phrase": "existing_screening_methods"}, {"score": 0.003535267442543166, "phrase": "previous_results"}, {"score": 0.003281695962914803, "phrase": "apnoea_patients"}, {"score": 0.0032629585038738856, "phrase": "healthy_subjects"}, {"score": 0.003081350558135612, "phrase": "severe_apnoea"}, {"score": 0.0028932006069319386, "phrase": "eight_features"}, {"score": 0.002700988793510088, "phrase": "third_and_second_formants"}, {"score": 0.0026778756903447073, "phrase": "specific_vowel"}, {"score": 0.0024856483031965118, "phrase": "separate_database"}, {"score": 0.0023138091498428855, "phrase": "proposed_method"}, {"score": 0.0022420047573094857, "phrase": "patient's_voice"}, {"score": 0.0021353853579834186, "phrase": "osa."}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["OSA screening tools", " Apnoea discrimination", " Voice features", " Feature selection", " Voice pathology"], "paper_abstract": "Obstructive sleep apnoea (OSA) is a highly prevalent disease affecting an estimated 2-4% of the adult male population that is difficult and very costly to diagnose because symptoms can remain unnoticed for years. The reference diagnostic method, Polysomnography (PSG), requires the patient to spend a night at the hospital monitored by specialized equipment. Therefore fast and less costly screening techniques are normally applied for setting priorities to proceed to the polysomnography diagnosis. In this article the use of speech analysis is proposed as an alternative or complement to existing screening methods. A set of voice features that could be related to apnoea are defined, based on previous results from other authors and our own analysis. These features are analyzed first in isolation and then in combination to assess their discriminative power to classify voices as corresponding to apnoea patients and healthy subjects. This analysis is performed in a database containing three repetitions of four carefully designed sentences read by 40 healthy subjects and 42 subjects suffering from severe apnoea. As a result of the analysis, a linear discriminant model (LDA) was defined including a subset of eight features (signal-to-disperiodicity ratio, a nasality measure, harmonic-to-noise ratio, jitter, difference between third and second formants on a specific vowel, duration of two of the sentences and the percentage of silence in one of the sentences). This model was tested on a separate database containing 20 healthy and 20 apnoea subjects yielding a sensitivity of 85% and a specificity of 75%, with a F1-measure of 81%. These results indicate that the proposed method, only requiring a few minutes to record and analyze the patient's voice during the visit to the specialist, could help in the development of a non-intrusive, fast and convenient PSG-complementary screening technique for OSA. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis of voice features related to obstructive sleep apnoea and their application in diagnosis support", "paper_id": "WOS:000329415400006"}