{"auto_keywords": [{"score": 0.04353919016373321, "phrase": "bayesian_network"}, {"score": 0.015719716506582538, "phrase": "structural_restrictions"}, {"score": 0.0045324756541157574, "phrase": "bayesian_networks"}, {"score": 0.0043533862892678864, "phrase": "expert_knowledge"}, {"score": 0.003975781274672803, "phrase": "main_goal"}, {"score": 0.003558294449586273, "phrase": "better_results"}, {"score": 0.003487222504700868, "phrase": "prior_knowledge"}, {"score": 0.0030278017562213265, "phrase": "possible_interactions"}, {"score": 0.002682370021834353, "phrase": "conditional_independence"}, {"score": 0.0024617483174454113, "phrase": "scoring_function"}, {"score": 0.002388283252319309, "phrase": "arc_addition"}, {"score": 0.0023642842046859274, "phrase": "arc_removal"}, {"score": 0.0023405257495466352, "phrase": "arc_reversal"}, {"score": 0.0022937210378944457, "phrase": "pc_algorithm"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Bayesian networks", " learning algorithms", " structural restrictions"], "paper_abstract": "The use of several types of structural restrictions within algorithms for learning Bayesian networks is considered. These restrictions may codify expert knowledge in a given domain, in such a way that a Bayesian network representing this domain should satisfy them. The main goal of this paper is to study whether the algorithms for automatically learning the structure of a Bayesian network from data can obtain better results by using this prior knowledge. Three types of restrictions are formally defined: existence of arcs and/or edges, absence of arcs and/or edges, and ordering restrictions. We analyze the possible interactions between these types of restrictions and also how the restrictions can be managed within Bayesian network learning algorithms based on both the score + search and conditional independence paradigms. Then we particularize our study to two classical learning algorithms: a local search algorithm guided by a scoring function, with the operators of arc addition, arc removal and arc reversal, and the PC algorithm. We also carry out experiments using these two algorithms on several data sets. (C) 2006 Elsevier Inc. All rights reserved.", "paper_title": "Bayesian network learning algorithms using structural restrictions", "paper_id": "WOS:000247920700004"}