{"auto_keywords": [{"score": 0.013520789856589365, "phrase": "typical_features"}, {"score": 0.007952041126156563, "phrase": "lode"}, {"score": 0.00481495049065317, "phrase": "positive_and_negative_observations"}, {"score": 0.0047113960612140335, "phrase": "local_patterns"}, {"score": 0.004654826737377134, "phrase": "class_association_rules"}, {"score": 0.004621210178054312, "phrase": "global_model"}, {"score": 0.004467500439382719, "phrase": "minimal_set"}, {"score": 0.004403193017557233, "phrase": "training_data"}, {"score": 0.004318881178805575, "phrase": "different_point"}, {"score": 0.004016782710006123, "phrase": "frequent_itemsets"}, {"score": 0.003939840532274616, "phrase": "new_representation_space"}, {"score": 0.0038364365168131586, "phrase": "target_class"}, {"score": 0.0038179283509963695, "phrase": "test_examples"}, {"score": 0.0034911335714333507, "phrase": "distance_computation"}, {"score": 0.0034742854447532678, "phrase": "critical_contribution"}, {"score": 0.003350480663660326, "phrase": "class_model"}, {"score": 0.0029903272356041686, "phrase": "wrong_classes"}, {"score": 0.0029615198132465236, "phrase": "correct_ones"}, {"score": 0.002897710777957041, "phrase": "example_vector"}, {"score": 0.002876747208161839, "phrase": "negative_class_vectors"}, {"score": 0.002828418443899226, "phrase": "frequent_features"}, {"score": 0.0026817365934071486, "phrase": "test_example"}, {"score": 0.0026623313229948214, "phrase": "novel_issue"}, {"score": 0.0026366753045215558, "phrase": "existing_learners"}, {"score": 0.002598652897946253, "phrase": "best_local_pattern"}, {"score": 0.0023759728305710365, "phrase": "extensive_empirical_experiments"}, {"score": 0.0023417010799384524, "phrase": "prediction_accuracy"}, {"score": 0.0023135183406982414, "phrase": "consistent_set"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data mining", " Supervised learning", " Concept learning", " Associative classifier"], "paper_abstract": "Current work on assembling a set of local patterns such as rules and class association rules into a global model for the prediction of a target usually focuses on the identification of the minimal set of patterns that cover the training data. In this paper we present a different point of view: the model of a class has been built with the purpose to emphasize the typical features of the examples of the class. Typical features are modeled by frequent itemsets extracted from the examples and constitute a new representation space of the examples of the class. Prediction of the target class of test examples occurs by computation of the distance between the vector representing the example in the space of the itemsets of each class and the vectors representing the classes. It is interesting to observe that in the distance computation the critical contribution to the discrimination between classes is given not only by the itemsets of the class model that match the example but also by itemsets that do not match the example. These absent features constitute some pieces of information on the examples that can be considered for the prediction and should not be disregarded. Second, absent features are more abundant in the wrong classes than in the correct ones and their number increases the distance between the example vector and the negative class vectors. Furthermore, since absent features are frequent features in their respective classes, they make the prediction more robust against over-fitting and noise. The usage of features absent in the test example is a novel issue in classification: existing learners usually tend to select the best local pattern that matches the example and do not consider the abundance of other patterns that do not match it. We demonstrate the validity of our observations and the effectiveness of LODE, our learner, by means of extensive empirical experiments in which we compare the prediction accuracy of LODE with a consistent set of classifiers of the state of the art. In this paper we also report the methodology that we adopted in order to determine automatically the setting of the learner and of its parameters. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "LODE: A distance-based classifier built on ensembles of positive and negative observations", "paper_id": "WOS:000300459000016"}