{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mozambique"}, {"score": 0.04745355400261356, "phrase": "main_barriers"}, {"score": 0.004769958800452922, "phrase": "purpose_-_the_purpose"}, {"score": 0.004487541157100498, "phrase": "mozambican_micro_and_small_enterprises"}, {"score": 0.004281678802569817, "phrase": "support_policies"}, {"score": 0.0038794730876377057, "phrase": "governmental_instruments"}, {"score": 0.003701401653850141, "phrase": "two-step_research"}, {"score": 0.003110515172439764, "phrase": "second_phase"}, {"score": 0.002675914969626753, "phrase": "financial_and_competitive_barriers"}, {"score": 0.0025892330566358503, "phrase": "analyzed_mses"}, {"score": 0.0022378101636842296, "phrase": "smaller_enterprises"}, {"score": 0.0022168615692404743, "phrase": "africa"}, {"score": 0.0021049977753042253, "phrase": "academic_research"}], "paper_keywords": ["Micro and small enterprises (MSEs)", " Barriers", " Policies and governmental support", " Mozambique", " Africa"], "paper_abstract": "Purpose - The purpose of this research is to shed light on the main barriers faced by Mozambican micro and small enterprises (MSEs) and their implications in respect to the support policies available for these enterprises. Design/methodology/approach - A literature review was made on those barriers faced by the MSEs and on the policies and governmental instruments of assistance available for MSEs. Then, a two-step research was conducted. The first phase consisted of collecting data from 21 MSEs in Mozambique, mainly by means of interviews where the main barriers faced by those interviewed were identified and hence, this led to the second phase, which was interviewing governmental/support entities in order to know what they had done to minimize those barriers which had been identified by the entrepreneurs. Findings - The results show that financial and competitive barriers are the main barriers faced by the analyzed MSEs. These barriers vary according to the field of activity of the enterprises. Originality/value - This study serves to enrich the state of the art on the subject of smaller enterprises in Africa and will specially. help to fill the lack of academic research available about Mozambique.", "paper_title": "Barriers faced by MSEs: evidence from Mozambique", "paper_id": "WOS:000294378200011"}