{"auto_keywords": [{"score": 0.04468012994164412, "phrase": "private_message"}, {"score": 0.03848776639301192, "phrase": "wiretap_set"}, {"score": 0.00481495049065317, "phrase": "wiretap_channel_ii."}, {"score": 0.004682917599491709, "phrase": "point_communication_system"}, {"score": 0.004412000844879264, "phrase": "noiseless_channels"}, {"score": 0.00396308097989371, "phrase": "wiretap_sets"}, {"score": 0.003559675269411366, "phrase": "partial_information"}, {"score": 0.003248483521309273, "phrase": "security_strategy"}, {"score": 0.0031467250930224126, "phrase": "random_key"}, {"score": 0.002882980094838904, "phrase": "achievable_rate_tuple"}, {"score": 0.002599560451267203, "phrase": "tight_rate_region"}, {"score": 0.0023626775529531486, "phrase": "general_case"}, {"score": 0.0021731423856364003, "phrase": "stochastic_encoding"}, {"score": 0.0021049977753042253, "phrase": "message_rate"}], "paper_keywords": ["Imperfect secrecy", " secret sharing", " secure network coding", " wiretap channel II"], "paper_abstract": "In a point-to-point communication system, which consists of a sender, a receiver, and a set of noiseless channels, the sender wishes to transmit a private message to the receiver through the channels, which may be eavesdropped by a wiretapper. The set of wiretap sets is arbitrary. The wiretapper can access any one but not more than one wiretap set. From each wiretap set, the wiretapper can obtain some partial information about the private message, which is measured by the equivocation of the message given the symbols obtained by the wiretapper. The security strategy is to encode the message with some random key at the sender. Only the message is required to be recovered at the receiver. Under this setting, we define an achievable rate tuple consisting of the size of the message, the size of the key, and the equivocation for each wiretap set. We first prove a tight rate region when both the message and the key are required to be recovered at the receiver. Then, we extend the result to the general case when only the message is required to be recovered at the receiver. Moreover, we show that even if stochastic encoding is employed at the sender, the message rate cannot be increased.", "paper_title": "Imperfect Secrecy in Wiretap Channel II", "paper_id": "WOS:000346980400038"}