{"auto_keywords": [{"score": 0.039185593130111246, "phrase": "mode_subspace"}, {"score": 0.015719716506582538, "phrase": "statistical_appearance_models"}, {"score": 0.013741072253452176, "phrase": "multi-dimensional_data"}, {"score": 0.011563235440146268, "phrase": "gnd-pca"}, {"score": 0.004762893197005439, "phrase": "medical_volumes"}, {"score": 0.0045108906244892165, "phrase": "n-dimensional_principal_component_analysis"}, {"score": 0.0038527044625533574, "phrase": "higher-order_tensor"}, {"score": 0.003115908199991072, "phrase": "better_performance"}, {"score": 0.002675252546913683, "phrase": "recently_proposed_nd-pca_method"}, {"score": 0.0026033756286033285, "phrase": "proposed_gnd-pca_method"}, {"score": 0.0025472634689904772, "phrase": "appearance_models"}, {"score": 0.0024253827365474734, "phrase": "leave-one-out_experiments"}, {"score": 0.002284290601837099, "phrase": "untrained_data"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Principal component analysis (PCA)", " Statistical appearance models", " Representation of high-dimensional data"], "paper_abstract": "We propose a method called generalized N-dimensional principal component analysis (GND-PCA) for the modeling of a series of multi-dimensional data in this paper. In this method, the data are directly trained as the higher-order tensor and the bases in each mode subspace are calculated to compactly represent the data. Since GND-PCA analyzes the multi-dimensional data directly on each mode subspace rather than the unfolded 1D vector space, it can not only be calculated efficiently but also have better performance on generalization than PCA. Additionally, since GND-PCA can compress the data in each mode subspace, it can represent the data more efficiently, compared to the recently proposed ND-PCA method. We apply the proposed GND-PCA method to construct the appearance models for 18 MR T1-weighted brain volumes and 25 CT lung volumes, respectively. The leave-one-out experiments show that the statistical appearance models built by our method can represent an untrained data well even though the models are trained by fewer samples. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Generalized N-dimensional principal component analysis (GND-PCA) and its application on construction of statistical appearance models for medical volumes with fewer samples", "paper_id": "WOS:000266702300024"}