{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "agent-based_supply-chains"}, {"score": 0.004324985524216987, "phrase": "severe_monetary_losses"}, {"score": 0.004121015016128205, "phrase": "great_practical_value"}, {"score": 0.004077005481951783, "phrase": "traditional_approaches"}, {"score": 0.0032888418378433037, "phrase": "commitment-based_approach"}, {"score": 0.003034158379493625, "phrase": "autonomous_agents"}, {"score": 0.0026242699269026204, "phrase": "first_method"}, {"score": 0.0025137856138000014, "phrase": "small_parts"}, {"score": 0.002473560912156024, "phrase": "second_method"}, {"score": 0.0023950275815082297, "phrase": "new_information"}, {"score": 0.0021049977753042253, "phrase": "supply-chain_scenarios"}], "paper_keywords": [""], "paper_abstract": "Exceptions take place when one or more events take place unexpectedly. Exceptions occur frequently in supply-chains and mostly result in severe monetary losses. Consequently, detecting exceptions timely is of great practical value. Traditional approaches have aimed at detecting exceptions after they have occurred. Whereas this is important, predicting exceptions before they happen is of more importance, since it can ease the handling of exceptions. Accordingly, this paper develops a commitment-based approach for modeling and predicting exceptions. The participants of the supply-chains are represented as autonomous agents. Their communication with other agents yields creation and manipulation of commitments. Violation of commitments leads to exceptions. We develop two methods for detecting such violations. The first method uses an AND/OR tree to analyze situations in small parts. The second method uses an ontology to generate new information about the environment and checks whether this information may cause any violations. When applied together, these methods can predict exceptions in supply-chain scenarios.", "paper_title": "Predicting exceptions in agent-based supply-chains", "paper_id": "WOS:000238506800011"}