{"auto_keywords": [{"score": 0.04206483306533285, "phrase": "denotational_semantics"}, {"score": 0.036337684659211895, "phrase": "type_soundness"}, {"score": 0.00481495049065317, "phrase": "modular_monadic_meta-theory"}, {"score": 0.004635881163634672, "phrase": "modular_mechanized_meta-theory"}, {"score": 0.004429727701202369, "phrase": "semantic_functions"}, {"score": 0.004396267325338022, "phrase": "theorem_statements"}, {"score": 0.004184825434585617, "phrase": "different_languages"}, {"score": 0.004153207234462926, "phrase": "fully_mechanized_meta-theory"}, {"score": 0.004090682761004765, "phrase": "modular_datatypes"}, {"score": 0.00393844255111604, "phrase": "per-feature_basis"}, {"score": 0.0038644521996539466, "phrase": "particular_set"}, {"score": 0.0038062581748678245, "phrase": "language_constructs"}, {"score": 0.0035147642199945387, "phrase": "new_effects"}, {"score": 0.0031604223680801774, "phrase": "long-standing_problem"}, {"score": 0.002929344511491418, "phrase": "semantic_function"}, {"score": 0.002896167001212006, "phrase": "individual_feature"}, {"score": 0.0027048247303526583, "phrase": "fixed_superset"}, {"score": 0.0026040262154057607, "phrase": "particular_language"}, {"score": 0.0022115879730677, "phrase": "case_study"}, {"score": 0.0021617392821644005, "phrase": "fully_mechanized_definitions"}], "paper_keywords": ["Languages", " mechanized meta-theory", " modularity", " monads", " side-effects"], "paper_abstract": "This paper presents 3MT, a framework for modular mechanized meta-theory of languages with effects. Using 3MT, individual language features and their corresponding definitions - semantic functions, theorem statements and proofs - can be built separately and then reused to create different languages with fully mechanized meta-theory. 3MT combines modular datatypes and monads to define denotational semantics with effects on a per-feature basis, without fixing the particular set of effects or language constructs. One well-established problem with type soundness proofs for denotational semantics is that they are notoriously brittle with respect to the addition of new effects. The statement of type soundness for a language depends intimately on the effects it uses, making it particularly challenging to achieve modularity. 3MT solves this long-standing problem by splitting these theorems into two separate and reusable parts: a feature theorem that captures the well-typing of denotations produced by the semantic function of an individual feature with respect to only the effects used, and an effect theorem that adapts well-typings of denotations to a fixed superset of effects. The proof of type soundness for a particular language simply combines these theorems for its features and the combination of their effects. To establish both theorems, 3MT uses two key reasoning techniques: modular induction and algebraic laws about effects. Several effectful language features, including references and errors, illustrate the capabilities of 3MT. A case study reuses these features to build fully mechanized definitions and proofs for 28 languages, including several versions of mini-ML with effects.", "paper_title": "Modular Monadic Meta-Theory", "paper_id": "WOS:000327696700030"}