{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "consistency-based_diagnosis"}, {"score": 0.004644014990871423, "phrase": "dynamic_theorem"}, {"score": 0.004410248125081398, "phrase": "component_set"}, {"score": 0.004320055598195391, "phrase": "model-based_diagnosis"}, {"score": 0.003956784357357341, "phrase": "conjunctive_normal_forms"}, {"score": 0.003623949225126944, "phrase": "related_clauses"}, {"score": 0.0035681790580031998, "phrase": "cnf_files"}, {"score": 0.0034059491112804416, "phrase": "dtp"}, {"score": 0.0031354779851351287, "phrase": "minimal_diagnosis"}, {"score": 0.0030083825666563898, "phrase": "non-minimal_diagnosis"}, {"score": 0.0026026666736474404, "phrase": "corresponding_conflict_sets"}, {"score": 0.0025625729433234623, "phrase": "classical_methods"}, {"score": 0.0024971144603069006, "phrase": "approach's_soundness"}, {"score": 0.0022053994402287925, "phrase": "diagnosis_efficiency"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Satisfiability", " Model-based diagnosis", " Dynamic algorithm", " Conjunctive normal form"], "paper_abstract": "In this paper, a dynamic theorem proving (DTP) algorithm is proposed for dynamically judging whether a component set is consistency-based diagnosis in model-based diagnosis. Firstly, the model of the system to be diagnosed and all the observations are described with conjunctive normal forms (CNF), and the problem of diagnosis is translated into the satisfiability of the related clauses in the CNF files. Next. all the minimal consistency-based diagnostic sets are derived by calling DTP dynamically combining with the CSSE-tree. As the theorem about the number of components in minimal diagnosis is proposed, the majority of the non-minimal diagnosis can never be produced. Moreover, this approach can compute all the consistency-based diagnostic sets directly, without computing all the conflict sets and therefore the hitting sets of the collection of the corresponding conflict sets like the classical methods. Finally, the approach's soundness, completeness and complexity are analyzed and proved, and results show that the program is easy to be implemented, and the diagnosis efficiency is highly improved. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Dynamic theorem proving algorithm for consistency-based diagnosis", "paper_id": "WOS:000288343900125"}