{"auto_keywords": [{"score": 0.04895768616855953, "phrase": "neural_networks"}, {"score": 0.015719716506582538, "phrase": "positive_displacement_pump"}, {"score": 0.015562573049022895, "phrase": "dynamic_pressure"}, {"score": 0.004247858437831649, "phrase": "computational_intelligence_methods"}, {"score": 0.004051074327962139, "phrase": "data_analysis_systems"}, {"score": 0.0036224139706218916, "phrase": "input_signal"}, {"score": 0.003585761649472705, "phrase": "final_result"}, {"score": 0.0034545033623115634, "phrase": "measurement_data"}, {"score": 0.003283922682721794, "phrase": "fourier"}, {"score": 0.003141598480804135, "phrase": "test_sets"}, {"score": 0.003057503388220776, "phrase": "expected_system_answers"}, {"score": 0.0030265495849271617, "phrase": "last_step"}, {"score": 0.002955533639862811, "phrase": "design_data_analysis_systems"}, {"score": 0.0029256091368059446, "phrase": "artificial_neural_networks"}, {"score": 0.0028184476518849015, "phrase": "obtained_results"}, {"score": 0.0026157259734105, "phrase": "displacement_pump"}, {"score": 0.0025804616931593897, "phrase": "design_systems"}, {"score": 0.0024358027662024105, "phrase": "training_time"}, {"score": 0.0023948164534491273, "phrase": "main_contribution"}, {"score": 0.0021703067932421463, "phrase": "diagnosis_consumption"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Computational intelligence methods", " Neural networks", " Signal processing", " Fast Fourier transform", " Positive displacement pump", " Pattern recognition"], "paper_abstract": "This paper describes the algorithms used to estimate the state of consumption of a pump based on dynamic pressure or vibrations. To create algorithms, the author used computational intelligence methods in the form of neural networks. In order to perform the analysis, data analysis systems were designed based on three neural networks: multilayer perceptron neural network (MLP), generalized regression neural network (GRNN) and probabilistic neural network (PNN). Processing of the input signal in the final result of the analysis consisted of several steps. First, the measurement data were preprocessed (delete constant component, normalization, standardization, reduction, fast Fourier trarnsform (FFT), etc.), and training and test sets were prepared using the matrices with the expected system answers. The last step was the analysis, consisting of design data analysis systems based on artificial neural networks and their learning and testing. On the basis of the obtained results the effectiveness of neural networks and the methods of pre-processing of the signals applied to approximate the state of consumption of the displacement pump were evaluated. Design systems were evaluated based on accuracy (generated error) and complexity (number of parameters and training time) criteria. The main contribution of the paper is to design and compare methods for pre-processing the signal, and to design and compare the effectiveness of the three neural networks in the diagnosis consumption of a positive displacement pump. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "An estimation of the state of consumption of a positive displacement pump based on dynamic pressure or vibrations using neural networks", "paper_id": "WOS:000341677800043"}