{"auto_keywords": [{"score": 0.04330550291702473, "phrase": "tolerance_graphs"}, {"score": 0.02264850640034665, "phrase": "perfect_graphs"}, {"score": 0.00481495049065317, "phrase": "multitolerance_graphs"}, {"score": 0.004724813153875936, "phrase": "tolerance"}, {"score": 0.004698985440736935, "phrase": "model_interval_relations"}, {"score": 0.004297068016286485, "phrase": "dna_sequence_analysis"}, {"score": 0.003908143909790778, "phrase": "right_side"}, {"score": 0.003671865026158296, "phrase": "convex_combination"}, {"score": 0.0035930624319243224, "phrase": "dna_sequences"}, {"score": 0.00357362651129581, "phrase": "different_organisms"}, {"score": 0.003544668879158414, "phrase": "natural_interpretation"}, {"score": 0.0033393377529146893, "phrase": "genomic_sequences"}, {"score": 0.003036832649117453, "phrase": "infinite_number"}, {"score": 0.0029716179574996626, "phrase": "multitolerance_model"}, {"score": 0.0028764048059439205, "phrase": "first_non-trivial_intersection_model"}, {"score": 0.0027023336645699897, "phrase": "new_intersection_model"}, {"score": 0.0026659048913727106, "phrase": "powerful_tool"}, {"score": 0.002644283144271972, "phrase": "efficient_algorithms"}, {"score": 0.0026157259734105, "phrase": "multitolerance_graph"}, {"score": 0.0026015629469149384, "phrase": "n_vertices"}, {"score": 0.0025595311522722914, "phrase": "multitolerance_representation"}, {"score": 0.002504540558270083, "phrase": "minimum_coloring"}, {"score": 0.0024842242921857705, "phrase": "maximum_clique"}, {"score": 0.0023023585070519803, "phrase": "maximum_weight"}, {"score": 0.0022406779042098493, "phrase": "complexity_gap"}, {"score": 0.0021049977753042253, "phrase": "resulting_hierarchy"}], "paper_keywords": ["Multitolerance graphs", " Tolerance graphs", " Intersection model", " Minimum coloring", " Maximum clique", " Maximum weight"], "paper_abstract": "Tolerance graphs model interval relations in such a way that intervals can tolerate a certain degree of overlap without being in conflict. This class of graphs has attracted many research efforts, mainly due to its interesting structure and its numerous applications, especially in DNA sequence analysis and resource allocation, among others. In one of the most natural generalizations of tolerance graphs, namely multitolerance graphs, two tolerances are allowed for each interval-one from the left and one from the right side of the interval. Then, in its interior part, every interval tolerates the intersection with others by an amount that is a convex combination of its two border-tolerances. In the comparison of DNA sequences between different organisms, the natural interpretation of this model lies on the fact that, in some applications, we may want to treat several parts of the genomic sequences differently. That is, we may want to be more tolerant at some parts of the sequences than at others. These two tolerances for every interval-together with their convex hull-define an infinite number of the so called tolerance-intervals, which make the multitolerance model inconvenient to cope with. In this article we introduce the first non-trivial intersection model for multitolerance graphs, given by objects in the 3-dimensional space called trapezoepipeds. Apart from being important on its own, this new intersection model proves to be a powerful tool for designing efficient algorithms. Given a multitolerance graph with n vertices and m edges along with a multitolerance representation, we present algorithms that compute a minimum coloring and a maximum clique in optimal O(nlogn) time, and a maximum weight independent set in O(m+nlogn) time. Moreover, our results imply an optimal O(nlogn) time algorithm for the maximum weight independent set problem on tolerance graphs, thus closing the complexity gap for this problem. Additionally, by exploiting more the new 3D-intersection model, we completely classify multitolerance graphs in the hierarchy of perfect graphs. The resulting hierarchy of classes of perfect graphs is complete, i.e. all inclusions are strict.", "paper_title": "An Intersection Model for Multitolerance Graphs: Efficient Algorithms and Hierarchy", "paper_id": "WOS:000335752000004"}