{"auto_keywords": [{"score": 0.048496350165912715, "phrase": "feed_intake"}, {"score": 0.008379975739210793, "phrase": "broiler_chickens"}, {"score": 0.006407188277478371, "phrase": "sound_analysis"}, {"score": 0.0058423131429676135, "phrase": "pecking_sounds"}, {"score": 0.005079403239547316, "phrase": "weighing_system"}, {"score": 0.00481495049065317, "phrase": "feed_intakes"}, {"score": 0.004788057423546704, "phrase": "multiple_broiler_chickens"}, {"score": 0.004695103516280934, "phrase": "existing_research"}, {"score": 0.004578225880995197, "phrase": "advanced_monitoring_system"}, {"score": 0.004464244691043022, "phrase": "group_level"}, {"score": 0.004426882270402403, "phrase": "real-time_sound_processing_technology"}, {"score": 0.004151698856954451, "phrase": "weighing_scale"}, {"score": 0.0038265753098624877, "phrase": "feeding_pen"}, {"score": 0.0037103745996558686, "phrase": "feed_uptake"}, {"score": 0.0036587247965487366, "phrase": "reference_method"}, {"score": 0.003628079411881511, "phrase": "existing_algorithm"}, {"score": 0.003382448497890289, "phrase": "pecking_sound_analysis"}, {"score": 0.0032522091171602557, "phrase": "feed_uptake_values"}, {"score": 0.003040466163186493, "phrase": "strong_relation"}, {"score": 0.0027793709534214214, "phrase": "high_relationship"}, {"score": 0.002657332920167067, "phrase": "proposed_system"}, {"score": 0.002415459080723135, "phrase": "continuous_pecking_sound_detection_system"}, {"score": 0.0023158555051565437, "phrase": "feeding_behaviour"}, {"score": 0.0023028883978637557, "phrase": "multiple_chickens"}, {"score": 0.0021832574703393765, "phrase": "life_span"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Sound analysis", " Pecking detection", " Feeding behaviour", " Feed intake", " Real-time monitoring", " Broilers"], "paper_abstract": "This paper extends existing research on the feed intake of broiler chickens and describes an advanced monitoring system to accurately measure the feed intake of broilers at group level by a real-time sound processing technology. In this research, the pecking sounds of 10 male, 39-day-old, broiler chickens were recorded by a microphone that was attached around the feeder. At the same time, the appearance of chickens around feeder was recorded by a camera that was positioned on the top of the feeding pen. Simultaneously, a weighing system was used to automatically record feed uptake of broilers as a reference method. An existing algorithm was further developed to detect the pecking sounds of 10 broiler chickens while the birds were all eating together. The feed intake of broiler chickens was obtained by pecking sound analysis. The results of the algorithm were compared to the reference of the feed uptake values recorded by the weighing system. The relationship between feed intake obtained from the algorithm and feed intake recorded by a weighing scale was investigated and a strong relation was found between these two variables. The Pearson Product Moment Correlation Coefficient test (PPMCC) was performed to define the correlation between these two variables which resulted in R-2 = 0.994. In addition to this high relationship, 86% of feed intake was correctly monitored using sound analysis. Although the accuracy of the proposed system remained at 86%, the correlation between the feed intake obtained from the algorithm and feed intake recorded by a weighing scale was very high (R-2 = 0.994), the results suggest that this continuous pecking sound detection system has the potential to be used as a tool to assess the feed intake and feeding behaviour of multiple chickens around a feeder. The advantage of this system is that measurements can be made continuously throughout the life span of a flock, in a fully automated, completely non-invasive way. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "A real-time monitoring tool to automatically measure the feed intakes of multiple broiler chickens by sound analysis", "paper_id": "WOS:000357241400001"}