{"auto_keywords": [{"score": 0.038323814569956004, "phrase": "cluster_problems"}, {"score": 0.010514898141415973, "phrase": "minimum_spanning_trees"}, {"score": 0.008231141749623068, "phrase": "proposed_method"}, {"score": 0.007164156479374358, "phrase": "separated_clusters"}, {"score": 0.006808340690814448, "phrase": "first_phase"}, {"score": 0.004388035083357706, "phrase": "different_cluster_sizes"}, {"score": 0.00413096972023037, "phrase": "graph-theoretical_clustering_method"}, {"score": 0.0027698788736535865, "phrase": "second_phase"}, {"score": 0.002397923568994474, "phrase": "varied_cluster_sizes"}, {"score": 0.0022467024793003812, "phrase": "experimental_results"}, {"score": 0.0022258906408344973, "phrase": "synthetic_and_real_datasets"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Graph-based clustering", " Well-separated cluster", " Touching cluster", " Two rounds of MST"], "paper_abstract": "Many clustering approaches have been proposed in the literature, but most of them are vulnerable to the different cluster sizes, shapes and densities. In this paper, we present a graph-theoretical clustering method which is robust to the difference. Based on the graph composed of two rounds of minimum spanning trees (MST), the proposed method (2-MSTClus) classifies cluster problems into two groups, i.e. separated cluster problems and touching cluster problems, and identifies the two groups of cluster problems automatically. it contains two clustering algorithms which deal with separated clusters and touching clusters in two phases, respectively. In the first phase, two round minimum spanning trees are employed to construct a graph and detect separated clusters which cover distance separated and density separated clusters. In the second phase, touching clusters, which are subgroups produced in the first phase, can be partitioned by comparing cuts, respectively, on the two round minimum spanning trees. The proposed method is robust to the varied cluster sizes, shapes and densities, and can discover the number of clusters. Experimental results on synthetic and real datasets demonstrate the performance of the proposed method. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A graph-theoretical clustering method based on two rounds of minimum spanning trees", "paper_id": "WOS:000273094100020"}