{"auto_keywords": [{"score": 0.012540499262082824, "phrase": "knowledge_preservation"}, {"score": 0.007564482658151834, "phrase": "useful_knowledge"}, {"score": 0.007012035742406292, "phrase": "privacy_protection"}, {"score": 0.004135562737140424, "phrase": "anonymized_data"}, {"score": 0.00395101799538683, "phrase": "anonymization_method"}, {"score": 0.003462704420080129, "phrase": "attribute_values"}, {"score": 0.0033759367489122716, "phrase": "data_randomization"}, {"score": 0.003308085469148074, "phrase": "statistical_relations"}, {"score": 0.002928594036918225, "phrase": "statistical_study"}, {"score": 0.0028263192354046245, "phrase": "enhanced_algorithm"}, {"score": 0.002797757576619329, "phrase": "extra_privacy_protection"}, {"score": 0.0027000395818027366, "phrase": "user's_prior_knowledge"}, {"score": 0.002618995204424126, "phrase": "privacy_leakage"}, {"score": 0.0025793874956029795, "phrase": "privacy_levels"}, {"score": 0.0023183698048498797, "phrase": "experiment_results"}, {"score": 0.00217017119491777, "phrase": "existing_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Data mining", " Privacy protection", " Data anonymization", " Knowledge preservation"], "paper_abstract": "In data mining and knowledge discovery, there are two conflicting goals: privacy protection and knowledge preservation. On the one hand, we anonymize data to protect privacy; on the other hand, we allow miners to discover useful knowledge from anonymized data. In this paper, we present an anonymization method which provides both privacy protection and knowledge preservation. Unlike most anonymization methods, where data are generalized or permuted, our method anonymizes data by randomly breaking links among attribute values in records. By data randomization, our method maintains statistical relations among data to preserve knowledge, whereas in most anonymization methods, knowledge is lost. Thus the data anonymized by our method maintains useful knowledge for statistical study. Furthermore, we propose an enhanced algorithm for extra privacy protection to tackle the situation where the user's prior knowledge of original data may cause privacy leakage. The privacy levels and the accuracy of knowledge preservation of our method, along with their relations to the parameters in the method are analyzed. Experiment results demonstrate that our method is effective on both privacy protection and knowledge preservation comparing with existing methods. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "A novel anonymization algorithm: Privacy protection and knowledge preservation", "paper_id": "WOS:000271571000083"}