{"auto_keywords": [{"score": 0.03242427913648681, "phrase": "traffic_variance"}, {"score": 0.016741814622850605, "phrase": "average_traffic_rate"}, {"score": 0.006929510619934946, "phrase": "dimensioning_formula"}, {"score": 0.00481495049065317, "phrase": "dimensioning_network_links"}, {"score": 0.004720792132470776, "phrase": "equivalent_bondwidth"}, {"score": 0.004613254605667248, "phrase": "network_management"}, {"score": 0.004030618026002216, "phrase": "service_level_agreement"}, {"score": 0.003925786139948254, "phrase": "better_predictions"}, {"score": 0.0038236703468417215, "phrase": "major_contribution"}, {"score": 0.003210861212842534, "phrase": "required_performance_level"}, {"score": 0.003116989767430614, "phrase": "accurate_estimates"}, {"score": 0.0029862071871499295, "phrase": "average_rate"}, {"score": 0.0028420886366761094, "phrase": "small_timescales"}, {"score": 0.002777227714581881, "phrase": "easily_implementable_remedy"}, {"score": 0.0026694534457234933, "phrase": "occupancy_statistics"}, {"score": 0.0025574004111658744, "phrase": "resulting_dimensioning_procedure"}, {"score": 0.0022118223311537954, "phrase": "capacity_estimate"}], "paper_keywords": [""], "paper_abstract": "One of the tasks of network management is to dimension the capacity of access and backbone links. Rules of thumb can be used, but they lack rigor and precision, as they fail to reliably predict whether the quality, as agreed on in the service level agreement, is actually provided. To make better predictions, a more sophisticated mathematical setup is needed. The major contribution of this article is that it presents such a setup; in this a pivotal role is played by a simple, yet versatile, formula that gives the minimum amount of capacity needed as a function of the average traffic rate, traffic variance (to be thought of as a measure of \"burstiness\"), as well as the required performance level. In order to apply the dimensioning formula, accurate estimates of the average traffic rate and traffic variance are needed, As opposed to the average rate, the traffic variance is rather hard to estimate; this is because measurements on small timescales are needed. We present an easily implementable remedy for this problem, in which the traffic variance is inferred from occupancy statistics of the buffer within the switch or router, To validate the resulting dimensioning procedure, we collected hundreds of traces at multiple (representative) locations, estimated for each of the traces the average traffic rate and (using the approach described above) traffic variance, and inserted these in the dimensioning formula. It turns out that the capacity estimate obtained by the procedure, is usually just a few percent off from the (empirically determined) minimally required value.", "paper_title": "Dimensioning Network Links: A New Look at Equivalent Bondwidth", "paper_id": "WOS:000264629300002"}