{"auto_keywords": [{"score": 0.03803384992967457, "phrase": "quantitative_model"}, {"score": 0.03585290810389686, "phrase": "qualitative_model"}, {"score": 0.004047020753789236, "phrase": "artificial_intelligence"}, {"score": 0.0035648266669315943, "phrase": "crude_probabilistic_definition"}, {"score": 0.003306559295382181, "phrase": "nonmonotonic_consequence_relations"}, {"score": 0.0032756158688245, "phrase": "different_sufficient_conditions"}, {"score": 0.002778529097886437, "phrase": "typical_cause"}, {"score": 0.0026384167183586015, "phrase": "formal_and_empirical_relations"}, {"score": 0.0026014425686078993, "phrase": "sufficient_conditions"}, {"score": 0.0025409639091476363, "phrase": "underlying_definitions"}, {"score": 0.0025171669791790438, "phrase": "perceived_causation"}, {"score": 0.0023346234464901978, "phrase": "commonsense_causal_reasoning"}], "paper_keywords": ["Causation", " Transitivity", " Conditional independence", " Non-monotonic reasoning", " Behavioral experiments"], "paper_abstract": "If A caused B and B caused C, did A cause C? Although laypersons commonly perceive causality as being transitive, some philosophers have questioned this assumption, and models of causality in artificial intelligence are often agnostic with respect to transitivity. We consider two formal models of causation that differ in the way they represent uncertainty. The quantitative model uses a crude probabilistic definition, arguably the common core of more sophisticated quantitative definitions; the qualitative model uses a definition based on nonmonotonic consequence relations. Different sufficient conditions for the transitivity of causation are laid bare by the two models: The Markov condition on events for the quantitative model, and a so-called saliency condition (A is perceived as a typical cause of B) for the qualitative model. We explore the formal and empirical relations between these sufficient conditions, and between the underlying definitions of perceived causation. These connections shed light on the range of applicability of each model, contrasting commonsense causal reasoning (supposedly qualitative) and scientific causation (more naturally quantitative). These speculations are supported by a series of three behavioral experiments.", "paper_title": "Qualitative and quantitative conditions for the transitivity of perceived causation: Theoretical and experimental results", "paper_id": "WOS:000304153500008"}