{"auto_keywords": [{"score": 0.03868281927175725, "phrase": "critical_transmission_radius"}, {"score": 0.015719716506582538, "phrase": "asymptotic_critical_transmission_radius"}, {"score": 0.014169280651993216, "phrase": "wireless_ad_hoc_network"}, {"score": 0.007881229724205206, "phrase": "critical_neighbor_number"}, {"score": 0.00450933377534525, "phrase": "range_assignment"}, {"score": 0.003752550907120244, "phrase": "other's_transmission_range"}, {"score": 0.0035605741849764187, "phrase": "smallest_r"}, {"score": 0.003378385493203297, "phrase": "transmission_radius_r"}, {"score": 0.003312486229143855, "phrase": "induced_topology"}, {"score": 0.0025807396931129926, "phrase": "precise_asymptotic_distribution"}, {"score": 0.002323142666222693, "phrase": "smallest_integer_r"}], "paper_keywords": ["Asymptotic distribution", " critical neighbor number", " critical transmission radius", " random geometric graph"], "paper_abstract": "A range assignment to the nodes in a wireless ad hoc network induces a topology in which there is an edge between two nodes if and only if both of them are within each other's transmission range. The critical transmission radius for k-connectivity is the smallest r such that if all nodes have the transmission radius r, the induced topology is k-connected. In this paper, we study the asymptotic critical transmission radius for k-connectivity in a wireless ad hoc network whose nodes are uniformly and independently distributed in a unit-area square or disk. We provide a precise asymptotic distribution of the critical transmission radius for k-connectivity. In addition, the critical neighbor number for k-connectivity is the smallest integer r such that if every node sets its transmission radius equal to the distance between itself and its l-th nearest neighbor, the induced (symmetric) topology is k-connected. Applying the critical transmission radius for k-connectivity, we can obtain an asymptotic almost sure upper bound on the critical neighbor number for k-connectivity.", "paper_title": "Asymptotic Critical Transmission Radius for k-Connectivity in Wireless Ad Hoc Networks", "paper_id": "WOS:000277880200027"}