{"auto_keywords": [{"score": 0.04778951318323816, "phrase": "rmdb"}, {"score": 0.00481495049065317, "phrase": "rna_structure_mapping_experiments"}, {"score": 0.004641351004344458, "phrase": "rna_mapping_database"}, {"score": 0.004419538941706716, "phrase": "single-nucleotide-resolution_rna_structure_mapping_experiments"}, {"score": 0.004031699976413366, "phrase": "high-throughput_sequencing_techniques"}, {"score": 0.0038862297330905836, "phrase": "large-scale_mutagenesis"}, {"score": 0.0036107898615445797, "phrase": "mapping_data"}, {"score": 0.003293688299319582, "phrase": "error_estimates"}, {"score": 0.002860546817196148, "phrase": "single-nucleotide-resolution_mapping_data"}, {"score": 0.002723607240517261, "phrase": "colored_secondary_structure_graphics"}, {"score": 0.00259320616168125, "phrase": "secondary_structure_hypotheses"}, {"score": 0.002469032978674379, "phrase": "standardized_and_computer-friendly_files"}, {"score": 0.00240918915601178, "phrase": "rdat"}, {"score": 0.0023798115577749225, "phrase": "community-consensus_snrnasm_formats"}], "paper_keywords": [""], "paper_abstract": "We have established an RNA mapping database (RMDB) to enable structural, thermodynamic and kinetic comparisons across single-nucleotide-resolution RNA structure mapping experiments. The volume of structure mapping data has greatly increased since the development of high-throughput sequencing techniques, accelerated software pipelines and large-scale mutagenesis. For scientists wishing to infer relationships between RNA sequence/structure and these mapping data, there is a need for a database that is curated, tagged with error estimates and interfaced with tools for sharing, visualization, search and meta-analysis. Through its on-line front-end, the RMDB allows users to explore single-nucleotide-resolution mapping data in heat-map, bar-graph and colored secondary structure graphics; to leverage these data to generate secondary structure hypotheses; and to download the data in standardized and computer-friendly files, including the RDAT and community-consensus SNRNASM formats. At the time of writing, the database houses 53 entries, describing more than 2848 experiments of 1098 RNA constructs in several solution conditions and is growing rapidly.", "paper_title": "An RNA Mapping DataBase for curating RNA structure mapping experiments", "paper_id": "WOS:000311303500028"}