{"auto_keywords": [{"score": 0.04442850327214474, "phrase": "tolerable_delays"}, {"score": 0.00856008935638784, "phrase": "search_behavior"}, {"score": 0.00481495049065317, "phrase": "time_delays"}, {"score": 0.004772137871562584, "phrase": "information_presentation"}, {"score": 0.004462892860919036, "phrase": "long_delays"}, {"score": 0.004211069233133584, "phrase": "information_search_behavior"}, {"score": 0.004009074013302036, "phrase": "decreased_information_search"}, {"score": 0.0035374012552316573, "phrase": "tipping_point"}, {"score": 0.0033376244286643176, "phrase": "situation_normality"}, {"score": 0.002418393046947528, "phrase": "new_pages"}, {"score": 0.0023861329619604666, "phrase": "net_impact"}, {"score": 0.0022613292987262177, "phrase": "total_amount"}, {"score": 0.0022013916728990564, "phrase": "first_experiment"}, {"score": 0.0021049977753042253, "phrase": "second_experiment"}], "paper_keywords": ["information processing", " data presentation", " information dissemination"], "paper_abstract": "Delays have become one of the most often cited complaints of web users. Long delays often cause users to abandon their searches, but how do tolerable delays affect information search behavior? Intuitively, we would expect that tolerable delays should induce decreased information search. We conducted two experiments and found that as delay increased, a point occurs at which time within-page information search increases; that is, search behavior remained the same until a tipping point occurs where delay increases the depth of search. We argue that situation normality explains this phenomenon; users have become accustomed to tolerable delays up to a point (our research suggests between 7 and 11s), after which search behavior changes. That is, some delay is expected, but as delay becomes noticeable but not long enough to cause the abandonment of search, an increase occurs in the stickiness of webpages such that users examine more information on each page before moving to new pages. The net impact of tolerable delays was counterintuitive: tolerable delays had no impact on the total amount of data searched in the first experiment, but induced users to examine more data points in the second experiment.", "paper_title": "Situation normality and the shape of search: The effects of time delays and information presentation on search behavior", "paper_id": "WOS:000325930600004"}