{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "scientific_literature"}, {"score": 0.011717728819329176, "phrase": "cited_literature"}, {"score": 0.004745260932479212, "phrase": "exponential_growth"}, {"score": 0.0046993598473345395, "phrase": "steady-state_science"}, {"score": 0.003757480190200645, "phrase": "aging_phenomenon"}, {"score": 0.0034760655218366, "phrase": "scientific_activity"}, {"score": 0.003376037544631762, "phrase": "average_and_median_ages"}, {"score": 0.0031536550157613974, "phrase": "world_war_i"}, {"score": 0.00312310128226407, "phrase": "world_war_ii"}, {"score": 0.002917331114260319, "phrase": "major_finding"}, {"score": 0.002792246704359262, "phrase": "widely_held_belief"}, {"score": 0.0025085435314540837, "phrase": "increasingly_old_body"}, {"score": 0.0023776656246300063, "phrase": "direct_response"}, {"score": 0.0023431692392929353, "phrase": "steady-state_dynamics"}, {"score": 0.0021780349459687622, "phrase": "online_preprint_archives"}, {"score": 0.002146482207293823, "phrase": "arxiv"}], "paper_keywords": [""], "paper_abstract": "Despite a very large number of studies on the aging and obsolescence of scientific literature, no study has yet measured, over a very long time period, the changes in the rates at which scientific literature becomes obsolete. This article studies the evolution of the aging phenomenon and, in particular, how the age of cited literature has changed over more than 100 years of scientific activity. It shows that the average and median ages of cited literature have undergone several changes over the period. Specifically, both World War I and World War II had the effect of significantly increasing the age of the cited literature. The major finding of this article is that contrary to a widely held belief, the age of cited material has risen continuously since the mid-1960s. In other words, during that period, researchers were relying on an increasingly old body of literature. Our data suggest that this phenomenon is a direct response to the steady-state dynamics of modern science that followed its exponential growth; however, we also have observed that online preprint archives such as arXiv have had the opposite effect in some subfields.", "paper_title": "Long-term variations in the aging of scientific literature: From exponential growth to steady-state science (1900-2004)", "paper_id": "WOS:000252161000011"}