{"auto_keywords": [{"score": 0.041848501542744734, "phrase": "contourlet_transform"}, {"score": 0.04155362490823712, "phrase": "chmt_model"}, {"score": 0.03644451033122438, "phrase": "code_part"}, {"score": 0.03492129383115456, "phrase": "contourlet_domain"}, {"score": 0.00481495049065317, "phrase": "contourlet_classified_hidden_markov_tree_model"}, {"score": 0.0043764594918057915, "phrase": "statistical_character"}, {"score": 0.00391969808162005, "phrase": "traditional_set"}, {"score": 0.0031669873302916, "phrase": "spiht_algorithm"}, {"score": 0.003086492169113408, "phrase": "contourlet_coefficients"}, {"score": 0.00300803677566719, "phrase": "decode_part"}, {"score": 0.002953217535105884, "phrase": "decoded_coefficients"}, {"score": 0.002888747754856871, "phrase": "decoded_image"}, {"score": 0.0026348886455716614, "phrase": "compression_rate"}, {"score": 0.0026155681847364483, "phrase": "meanwhile_peak_signal-to-noise_ratio_value"}, {"score": 0.002511803988580901, "phrase": "visual_effect"}, {"score": 0.00238565827614317, "phrase": "traditional_methods"}, {"score": 0.0023164335087514252, "phrase": "image_code"}, {"score": 0.00226583335721762, "phrase": "improved_code_algorithm"}, {"score": 0.0021520139248317333, "phrase": "decoded_images"}], "paper_keywords": ["Markov processes", " Programming and algorithm theory", " Image processing"], "paper_abstract": "Purpose - Because of advantages such as multi-scale and multi-direction, contourlet transform is better at treating a 2-D image than wavelet transform and the Classified Hidden Markov Tree (CHMT) model is able to analyze statistical character of coefficients, which means they can be analyzed more efficiently and effectively. So in this paper, the purpose is to use contourlet transform and CHMT model to redevelop traditional set partitioning in hierarchical trees (SPIHT) code algorithm, and by using these two methods, hope to decrease the distortion and increase the quality. Design/methodology/approach - In this paper, the algorithm is divided into two parts: code part and decode part. As all processes are operated in the contourlet domain, contourlet transform is finished at the beginning of the code part. SPIHT algorithm in the contourlet domain will code these contourlet coefficients. CHMT model will be built in decode part, it will optimize decoded coefficients by calculating their statistical relationship. The decoded image will be reconstructed. Findings - The experiment proves that this algorithm is able to reduce the distortion under the premise of not affect compression rate, meanwhile peak signal-to-noise ratio value is improved compared with traditional methods. Furthermore, the visual effect of the image derived from the algorithm is superior to that derived by traditional methods. Originality/value - CHMT model in contourlet domain used in image code is original. As an improved code algorithm, the method is more powerful; its use could decrease the distortion of decoded images invaluable in the fields of military, medical image analysis, deep space detection and so on.", "paper_title": "A static image coding algorithm, based on contourlet Classified Hidden Markov Tree model", "paper_id": "WOS:000289390600010"}