{"auto_keywords": [{"score": 0.004578030096508602, "phrase": "social_networks"}, {"score": 0.0044079880067019765, "phrase": "consumer_space"}, {"score": 0.00432108274425261, "phrase": "organizational_adoption"}, {"score": 0.004298134888203576, "phrase": "significant_variation"}, {"score": 0.003693973656103879, "phrase": "empirical_research"}, {"score": 0.0035983027084135794, "phrase": "higher_propensity"}, {"score": 0.003464524046880359, "phrase": "industry_knowledge_intensity"}, {"score": 0.003360146665246448, "phrase": "technological-organizational-environmental_theoretical_framework"}, {"score": 0.0026597250663309385, "phrase": "larger_organizations"}, {"score": 0.002228263890334039, "phrase": "open_architectures"}, {"score": 0.0022002633747977593, "phrase": "firm_size"}, {"score": 0.0021317885325570604, "phrase": "pivotal_roles"}], "paper_keywords": ["Web 2.0", " Enterprise 2.0", " social computing", " social media", " IT adoption antecedents"], "paper_abstract": "While Web 2.0 technologies such as blogs, wikis, and social networks have been popular in the consumer space, there is significant variation in adoption of Web 2.0 technologies in business. Yet, little is known about why firms adopt Web 2.0 technologies. There is a paucity of empirical research examining the antecedents of the use of Web 2.0 technologies in organizations. Drawing on the Technological-Organizational-Environmental theoretical framework, our study presents and empirically tests a model of factors associated with organizational adoption of Web 2.0 technologies. We find that importance to open standards is positively associated with the propensity for adoption of Web 2.0 technologies. Further, larger organizations are found to have a higher propensity for adoption. Finally, industry knowledge intensity is found to be positively associated with a higher propensity for adoption. Our results suggest that open architectures, firm size, and industry knowledge intensity play pivotal roles in Web 2.0 technology adoption. The study sheds light on antecedents of organizational adoption of Web 2.0 technologies and can help researchers and practitioners build an understanding of what factors are likely to motivate firms to adopt Web 2.0 technologies.", "paper_title": "ORGANIZATIONAL ADOPTION OF WEB 2.0 TECHNOLOGIES: AN EMPIRICAL ANALYSIS", "paper_id": "WOS:000310605000001"}