{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "flood_attacks"}, {"score": 0.01560937278433192, "phrase": "disruption_tolerant_networks"}, {"score": 0.00456448259718331, "phrase": "opportunistic_contacts"}, {"score": 0.004499910169464113, "phrase": "data_communications"}, {"score": 0.004389089062127892, "phrase": "network_resources"}, {"score": 0.004342430078306461, "phrase": "contact_opportunity"}, {"score": 0.004311598785718415, "phrase": "buffer_space"}, {"score": 0.004116440453049531, "phrase": "packet_replicas"}, {"score": 0.003916098498242888, "phrase": "limited_network_resources"}, {"score": 0.0034567253581991226, "phrase": "time_interval"}, {"score": 0.003218764138744059, "phrase": "distributed_scheme"}, {"score": 0.002881793492919646, "phrase": "communication_infrastructure"}, {"score": 0.0025800088089364737, "phrase": "receiving_nodes"}, {"score": 0.0023936956017015696, "phrase": "claim_structure"}, {"score": 0.0023681985426916366, "phrase": "pigeonhole_principle"}, {"score": 0.0023015232625177755, "phrase": "inconsistent_claims"}, {"score": 0.0022287497627555895, "phrase": "rigorous_analysis"}, {"score": 0.0021049977753042253, "phrase": "extensive_trace-driven_simulations"}], "paper_keywords": ["DTN", " security", " flood attack", " detection"], "paper_abstract": "Disruption Tolerant Networks (DTNs) utilize the mobility of nodes and the opportunistic contacts among nodes for data communications. Due to the limitation in network resources such as contact opportunity and buffer space, DTNs are vulnerable to flood attacks in which attackers send as many packets or packet replicas as possible to the network, in order to deplete or overuse the limited network resources. In this paper, we employ rate limiting to defend against flood attacks in DTNs, such that each node has a limit over the number of packets that it can generate in each time interval and a limit over the number of replicas that it can generate for each packet. We propose a distributed scheme to detect if a node has violated its rate limits. To address the challenge that it is difficult to count all the packets or replicas sent by a node due to lack of communication infrastructure, our detection adopts claim-carry-and-check: each node itself counts the number of packets or replicas that it has sent and claims the count to other nodes; the receiving nodes carry the claims when they move, and cross-check if their carried claims are inconsistent when they contact. The claim structure uses the pigeonhole principle to guarantee that an attacker will make inconsistent claims which may lead to detection. We provide rigorous analysis on the probability of detection, and evaluate the effectiveness and efficiency of our scheme with extensive trace-driven simulations.", "paper_title": "To Lie or to Comply: Defending against Flood Attacks in Disruption Tolerant Networks", "paper_id": "WOS:000318895700004"}