{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "mobile_internet_services"}, {"score": 0.004371660146981191, "phrase": "mobile_internet_services_industry"}, {"score": 0.004278807087784626, "phrase": "marked_increase"}, {"score": 0.004011867299107537, "phrase": "proper_structuring"}, {"score": 0.0038431888954930083, "phrase": "present_methods"}, {"score": 0.003802135020791801, "phrase": "service_provision"}, {"score": 0.0029064676523923886, "phrase": "task-oriented_menu"}, {"score": 0.0028293966058473476, "phrase": "task_ontology_modeling_method"}, {"score": 0.0027543636132088332, "phrase": "user_activities"}, {"score": 0.002695768552609587, "phrase": "task_execution"}, {"score": 0.0025137856138000014, "phrase": "task_ontology-based_modeling_method"}, {"score": 0.002447101794397243, "phrase": "users'_activities"}, {"score": 0.0024209250169088575, "phrase": "related_knowledge"}], "paper_keywords": ["task ontology", " mobile internet services", " modeling services", " semantic web"], "paper_abstract": "Growth in the mobile internet services industry has seen a marked increase in the number of mobile internet services provided, and this has made proper structuring and organization of the services difficult. Present methods of service provision have proven insufficient to guide users efficiently to the services they need. To solve this problem, a task-oriented menu, which enables users to search for services by what they want to do and not by category, has been proposed. Construction of the task-oriented menu is based on a task ontology modeling method which supports descriptions of user activities, such as task execution and defeating obstacles encountered during the task. This paper discusses a task ontology-based modeling method which supports descriptions of users' activities and related knowledge, such as how to solve problems that the users encounter and how to prevent or solve them on the spot. Models described by our method contribute to designing, testing, and improving mobile internet services.", "paper_title": "Obstacles reveal the needs of mobile internet services - OOPS: Ontology-based obstacle, prevention and solution modeling framework", "paper_id": "WOS:000257333900002"}