{"auto_keywords": [{"score": 0.04699212566272055, "phrase": "population-based_probandoriented_pedigree_information_system"}, {"score": 0.04292793064226958, "phrase": "theoretical_family_relationships"}, {"score": 0.00481495049065317, "phrase": "population-based_screening_data"}, {"score": 0.004285594361623147, "phrase": "genetic_epidemiological_studies"}, {"score": 0.004054299982508618, "phrase": "designs_and_measurements_a_population-based_proband-oriented_pedigree_information_system"}, {"score": 0.0038782499819752423, "phrase": "population-based_household_registry_data"}, {"score": 0.0038354405231002323, "phrase": "keelung_community_integrated_screening"}, {"score": 0.0036892809673917592, "phrase": "comprehensive_extended_family_pedigree_structure"}, {"score": 0.0035684266744407485, "phrase": "genetic_studies"}, {"score": 0.0035290250358997904, "phrase": "different_diseases"}, {"score": 0.003088702479841264, "phrase": "relative_relationship_score"}, {"score": 0.002987463078971627, "phrase": "genetic_influence"}, {"score": 0.0025570607111118793, "phrase": "complete_familial_relationships"}, {"score": 0.0024323098907299027, "phrase": "early_onset"}, {"score": 0.0023394947463129642, "phrase": "proband-oriented_relative_relationship_score"}, {"score": 0.0022253345930383257, "phrase": "incomplete_capture"}, {"score": 0.0021763973978248005, "phrase": "population-based_proband-oriented_pedigree_information_system"}], "paper_keywords": [""], "paper_abstract": "Objective To develop a population-based probandoriented pedigree information system that can be easily applied to various diseases in genetic epidemiological studies, making allowance for the capture of theoretical family relationships. Designs and Measurements A population-based proband-oriented pedigree information system with ties of consanguinity based on both population-based household registry data and Keelung Community Integrated Screening data was proposed to build a comprehensive extended family pedigree structure to accommodate a series of genetic studies on different diseases. We also developed an algorithm to efficiently assess how well theoretical family relationships affecting the occurrence of diseases across three generations with respect to the relative relationship score, a quantitative indicator of genetic influence, were captured. Results We applied this population-based probandoriented pedigree information system to estimate the rate of hypertension with various relative relationships given the selection of probands. The degree of capturing complete familial relationships was assessed for three generations. The risk for early onset of hypertension was proportional to the proband-oriented relative relationship score with 2% increased risk and 1% correction for incomplete capture. Conclusions The population-based proband-oriented pedigree information system is powerful and can support various genetic descriptive and analytic epidemiological studies.", "paper_title": "Population-based proband-oriented pedigree information system: application to hypertension with population-based screening data (KCIS No. 25)", "paper_id": "WOS:000298848100015"}