{"auto_keywords": [{"score": 0.00450198136261303, "phrase": "cr_literature"}, {"score": 0.003935513160201076, "phrase": "random_walk"}, {"score": 0.0037679023889496885, "phrase": "invisible_cost"}, {"score": 0.00344007531836105, "phrase": "expected_capture_times"}, {"score": 0.003399466007862412, "phrase": "adversarial_and_drunk_or_variants"}, {"score": 0.0032934951320964276, "phrase": "capture_times"}, {"score": 0.0032161835102640372, "phrase": "game_theory"}, {"score": 0.0031782087629067686, "phrase": "adversarial_case"}, {"score": 0.003153140905312787, "phrase": "partially_observable_markov_decision"}, {"score": 0.003066945490483524, "phrase": "drunk_case"}, {"score": 0.0030187498405804315, "phrase": "exact_asymptotic_values"}, {"score": 0.0029246121262946384, "phrase": "d-regular_trees"}, {"score": 0.0028110458014332187, "phrase": "general_upper_and_lower_bounds"}, {"score": 0.0026911959223982727, "phrase": "infinite_family"}, {"score": 0.002207530926563892, "phrase": "graph_search_game"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": [""], "paper_abstract": "We examine a version of the cops and robbers (CR) game in which the robber is invisible, i.e., the cops do not know his location until they capture him. Apparently this game (CiR) has received little attention in the CR literature. We examine two variants: in the first, the robber is adversarial (he actively tries to avoid capture); in the second, he is drunk (he performs a random walk). Our goal in this paper is to study the invisible cost of drunkenness (iCOD), which is defined as the ratio ct(i)(G)/dct(i)(G), with ct(i)(G) and dct(i)(G) being the expected capture times in the adversarial and drunk OR variants, respectively. We show that these capture times are well defined, using game theory for the adversarial case and partially observable Markov decision processes (POMDPs) for the drunk case. We give exact asymptotic values of the iCOD for several special graph families such as d-regular trees, give some bounds for grids, and provide general upper and lower bounds for general classes of graphs. We also give an infinite family of graphs showing that the iCOD can be arbitrarily close to any value in [2, infinity). Finally, we briefly examine one more CiR variant, in which the robber is invisible and \"infinitely fast\"; we argue that this variant is significantly different from the graph search game, despite several similarities between the two games. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Cops and invisible robbers: The cost of drunkenness", "paper_id": "WOS:000318135200009"}