{"auto_keywords": [{"score": 0.049612338656328456, "phrase": "helmholtz_resonator"}, {"score": 0.02322730111336097, "phrase": "incident_shock_wave"}, {"score": 0.02096070296689137, "phrase": "shock_wave"}, {"score": 0.018549184971904557, "phrase": "wave_phenomena"}, {"score": 0.004540064673326908, "phrase": "acoustical_point"}, {"score": 0.004394159734054881, "phrase": "shock_wave_dynamics"}, {"score": 0.004252923737320014, "phrase": "complicated_wave_phenomena"}, {"score": 0.0039969114480547865, "phrase": "shock-vortex_interactions"}, {"score": 0.003970872207239332, "phrase": "strong_pressure_fluctuations"}, {"score": 0.0038683940969566856, "phrase": "powerful_sound_emission"}, {"score": 0.00374399358035391, "phrase": "detailed_configuration"}, {"score": 0.003518508991483203, "phrase": "resonance_frequency"}, {"score": 0.0034727910226495227, "phrase": "incident_wavelength"}, {"score": 0.0033942044841803105, "phrase": "geometrical_length_scale"}, {"score": 0.003231722251475338, "phrase": "extremely_short_wavelength"}, {"score": 0.003179303164775306, "phrase": "discharge_process"}, {"score": 0.0030369955065974222, "phrase": "impulse_wave_generation"}, {"score": 0.0029779674919563734, "phrase": "serious_noise"}, {"score": 0.002958546790146313, "phrase": "vibration_problems"}, {"score": 0.0028915634293105014, "phrase": "present_study"}, {"score": 0.002708399936381754, "phrase": "computational_fluid_dynamics_method"}, {"score": 0.002681941877978843, "phrase": "incident_shock_mach_number"}, {"score": 0.0025202582748972122, "phrase": "resonator_geometry"}, {"score": 0.002471248834609488, "phrase": "total_variation"}, {"score": 0.002352844633115289, "phrase": "existing_experimental_data"}, {"score": 0.002314647987893668, "phrase": "present_computations"}, {"score": 0.0022696277881969896, "phrase": "resonator_wave_phenomena"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": [""], "paper_abstract": "The behavior of an incident shock wave into a Helmholtz resonator is very important from the acoustical point of view as well as the fundamental researches of shock wave dynamics. When a shock wave propagates into a Helmholtz resonator, complicated wave phenomena are formed both inside and outside the resonator. Shock wave reflections, shock wave focusing phenomena, and shock-vortex interactions cause strong pressure fluctuations inside the resonator, consequently leading to powerful sound emission. The wave phenomena inside the resonator are influenced by detailed configuration of the resonator. It is well known that the gas inside the resonator strongly oscillates at a resonance frequency, as the incident wavelength is larger, compared with the geometrical length scale of the resonator, but there are only a few works regarding a shock wave that has an extremely short wavelength. Meanwhile, the discharge process of the incident shock wave from the resonator is another interest with regard to an impulse wave generation that is a source of serious noise and vibration problems of the resonator. In the present study, the wave phenomena inside and outside the Helmholtz resonator are, in detail, investigated with a help of a computational fluid dynamics method. The incident shock Mach number is varied below 2.0, and many different types of the resonators are explored to investigate the influence of the resonator geometry on the wave phenomena. A total variation diminishing (TVD) scheme is employed to solve two-dimensional, unsteady, compressible Euler equations. The computational results are compared with existing experimental data to ensure that the present computations are valid to predict the resonator wave phenomena. Based upon the results obtained, the shock wave focusing and discharge processes, which are important in determining the resonator flow characteristics, are discussed in detail. (c) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Computational study of an incident shock wave into a Helmholtz resonator", "paper_id": "WOS:000241323900020"}