{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "optical_networks"}, {"score": 0.004228016636379321, "phrase": "optical_network"}, {"score": 0.003907013105134715, "phrase": "lsps-label_switched_path"}, {"score": 0.0034785371344994197, "phrase": "optical_network_resources"}, {"score": 0.0032593915869553714, "phrase": "first_one"}, {"score": 0.0029152570900178956, "phrase": "simple_policies"}, {"score": 0.0028615323526689582, "phrase": "packet-based_lsps"}, {"score": 0.0026440008776012665, "phrase": "optical_network_overhead"}, {"score": 0.0025832180231667853, "phrase": "lp_lsps"}, {"score": 0.0025474193855847074, "phrase": "second_group"}, {"score": 0.0022571810910697013, "phrase": "defined_policies"}, {"score": 0.0022052711621931144, "phrase": "negative_impact"}, {"score": 0.0021246816854197732, "phrase": "optical_transport_network"}], "paper_keywords": ["Traffic grooming", " Policy-based network management and optical network management"], "paper_abstract": "This work presents a discussion about policies and architecture to aggregate Internet Protocol/Multiprotocol Label Switching (IP/MPLS) traffics within lightpaths. The scenario is that of IP/MPLS client networks over an optical network. It is well known that aggregating lower traffic flows (e.g., packet-based LSPs-Label Switched Path) within higher traffic flows (e.g., lambda-based LSPs) is considered an effective way to maximize the use of the optical network resources. In this work, the policies are divided into two groups. The first one, which solely considers the class of the flow (High Priority-HP or Low Priority-LP), consists of simple policies meant to aggregate packet-based LSPs within lightpaths. In this group, the policies we have defined intend to reduce the optical network overhead to remove and reroute LP LSPs. The second group presents more sophisticated policies taking into account the possibility of having to deal with further transport faults. In this case, the grooming is better planned and the defined policies tend to reduce the negative impact when a failure is detected in the optical transport network. Our approach has been implemented to validate the policies and the results for each group are showed and discussed.", "paper_title": "Policy-Based Grooming in Optical Networks", "paper_id": "WOS:000261655300001"}