{"auto_keywords": [{"score": 0.04952003448686007, "phrase": "large-scale_text_collection"}, {"score": 0.007213532080191649, "phrase": "cluster's_representative_vector"}, {"score": 0.00481495049065317, "phrase": "based_clustering_algorithm"}, {"score": 0.004666460260366703, "phrase": "fast_evolvement"}, {"score": 0.004630055463858585, "phrase": "internet_technology"}, {"score": 0.00459393336391459, "phrase": "internet_users"}, {"score": 0.004504850679320975, "phrase": "large_amount"}, {"score": 0.004469700997700534, "phrase": "textual_data"}, {"score": 0.004214637810698362, "phrase": "useful_information"}, {"score": 0.0038817197332605647, "phrase": "traditional_clustering_algorithms"}, {"score": 0.003717925116469845, "phrase": "high-dimensional_vector_space"}, {"score": 0.0034510635632071978, "phrase": "vector_reconstruction"}, {"score": 0.00310435218261112, "phrase": "partial_tuning_sub-process"}, {"score": 0.0030680392468327147, "phrase": "feature's_weight"}, {"score": 0.0029966788947444535, "phrase": "iterative_process"}, {"score": 0.0028701222153940283, "phrase": "clustering_velocity"}, {"score": 0.002511672561475743, "phrase": "different_clusters"}, {"score": 0.002197891020396052, "phrase": "high-quality_performances"}, {"score": 0.0021551702945512494, "phrase": "large-scale_text_collections"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Vector reconstruction", " Large-scale text clustering", " Partial tuning sub-process", " Overall tuning sub-process"], "paper_abstract": "Along with the fast evolvement of internet technology, internet users have to face the large amount of textual data every day. Apparently, organizing texts into categories can help users dig the useful information from large-scale text collection. Clustering is one of the most promising tools for categorizing texts due to its unsupervised characteristic. Unfortunately, most of traditional clustering algorithms lose their high qualities on large-scale text collection, which mainly attributes to the high-dimensional vector space and semantic similarity among texts. To effectively and efficiently cluster large-scale text collection, this paper puts forward a vector reconstruction based clustering algorithm. Only the features that can represent the cluster are preserved in cluster's representative vector. This algorithm alternately repeats two sub-processes until it converges. One process is partial tuning sub-process, where feature's weight is fine-tuned by iterative process similar to self-organizing-mapping (SOM) algorithm. To accelerate clustering velocity, an intersection based similarity measurement and its corresponding neuron adjustment function are proposed and implemented in this sub-process. The other process is overall tuning sub-process, where the features are reallocated among different clusters. In this sub-process, the features useless to represent the cluster are removed from cluster's representative vector. Experimental results on the three text collections (including two small-scale and one large-scale text collections) demonstrate that our algorithm obtains high-quality performances on both small-scale and large-scale text collections. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "A vector reconstruction based clustering algorithm particularly for large-scale text collection", "paper_id": "WOS:000349730800014"}