{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "compound_channel"}, {"score": 0.008522091239161058, "phrase": "variable_length_communication"}, {"score": 0.007582328443399407, "phrase": "maximum_rate"}, {"score": 0.005612061694283951, "phrase": "transmission_rate"}, {"score": 0.003829548069657859, "phrase": "traditional_definition"}, {"score": 0.003601235776892337, "phrase": "opportunistic_definition"}, {"score": 0.003011328068286321, "phrase": "realized_channel"}, {"score": 0.002911961514073769, "phrase": "feedback_communication"}, {"score": 0.002784540221128404, "phrase": "multiterminal_communication"}, {"score": 0.002618366076489732, "phrase": "channel_capacity"}, {"score": 0.0024897902536499005, "phrase": "error_exponent"}], "paper_keywords": ["Burnashev exponent", " error exponent region (EER)", " feedback error exponent", " variable-length coding", " variable-rate coding"], "paper_abstract": "Variable length communication over a compound channel with feedback is considered. Traditionally, capacity of a compound channel without feedback is defined as the maximum rate that is determined before the start of communication such that communication is reliable. This traditional definition is pessimistic. In the presence of feedback, an opportunistic definition is given. Capacity is defined as the maximum rate that is determined at the end of communication such that communication is reliable. Thus, the transmission rate can adapt to the realized channel. Under this definition, feedback communication over a compound channel is conceptually similar to multiterminal communication. Transmission rate is a vector rather than a scalar; channel capacity is a region rather than a scalar; error exponent is a region rather than a scalar. In this paper, variable length communication over a compound channel with feedback is formulated, its opportunistic capacity region is characterized, and lower bounds for its error exponent region are provided.", "paper_title": "Opportunistic Capacity and Error Exponent Region for the Compound Channel With Feedback", "paper_id": "WOS:000305575000018"}