{"auto_keywords": [{"score": 0.04879208106398744, "phrase": "un-weighted_events"}, {"score": 0.008158012087383698, "phrase": "new_version"}, {"score": 0.007559825695357276, "phrase": "b-c_meson"}, {"score": 0.006400808269614847, "phrase": "previous_version"}, {"score": 0.006041296052866197, "phrase": "pythia"}, {"score": 0.005780437892399073, "phrase": "hadronic_production"}, {"score": 0.005749614293074199, "phrase": "bcvegpy"}, {"score": 0.005649872903187077, "phrase": "improved_hit"}, {"score": 0.005495457007719431, "phrase": "distributed_program"}, {"score": 0.005487447133550601, "phrase": "test_data"}, {"score": 0.005246861331759031, "phrase": "von_neumann_method"}, {"score": 0.005198098467208408, "phrase": "vegas_subroutine"}, {"score": 0.005133774398089168, "phrase": "new_hit-and-miss_algorithm"}, {"score": 0.0049210491010763776, "phrase": "new_hit-and-miss_technology"}, {"score": 0.004807927689958803, "phrase": "meson_b-c"}, {"score": 0.00479624566740049, "phrase": "newly_upgraded_version"}, {"score": 0.004788322237073669, "phrase": "new_technology"}, {"score": 0.004742871151848351, "phrase": "previous_one"}, {"score": 0.0047382636059478955, "phrase": "chang"}, {"score": 0.0046446647448237345, "phrase": "new_version_program_summary_title_of"}, {"score": 0.004619868975952203, "phrase": "cpc_program_library"}, {"score": 0.004615374830992223, "phrase": "queen's_university"}, {"score": 0.004610885090312975, "phrase": "belfast"}, {"score": 0.004606399591670326, "phrase": "n._ireland"}, {"score": 0.00459744172533764, "phrase": "standard_cpc"}, {"score": 0.004511014007390236, "phrase": "linux"}, {"score": 0.0044869207290991475, "phrase": "linux_programming_language"}, {"score": 0.00446730971124712, "phrase": "typical_data"}, {"score": 0.004426203927225496, "phrase": "comput"}, {"score": 0.004422486245346078, "phrase": "phys"}, {"score": 0.00439399066145559, "phrase": "old_version"}, {"score": 0.004381176934399598, "phrase": "physical_problem"}, {"score": 0.004323135973443401, "phrase": "xmax_array"}, {"score": 0.004286252473062597, "phrase": "cms_and_lhcb_groups"}, {"score": 0.004257140182099952, "phrase": "relevant_codes"}, {"score": 0.004232343549512823, "phrase": "excited_state_production"}, {"score": 0.0042199992186529416, "phrase": "new_lhc_run"}, {"score": 0.0041831809262814395, "phrase": "full_events"}, {"score": 0.004132574499741931, "phrase": "b-c_meson_ground_state"}, {"score": 0.004027296303537366, "phrase": "weighted_events"}, {"score": 0.003999935781246411, "phrase": "theoretical_purpose"}, {"score": 0.003943847953754667, "phrase": "pythia_inner_hit"}, {"score": 0.0038824918883759107, "phrase": "vegas"}, {"score": 0.003867805187045822, "phrase": "hadronic"}, {"score": 0.003852730472328508, "phrase": "un"}, {"score": 0.0037850348881439053, "phrase": "grid_files"}, {"score": 0.0037618749455859187, "phrase": "main_changes"}, {"score": 0.0037435971799312942, "phrase": "simulated_event"}, {"score": 0.0037425082676185604, "phrase": "mixing_events"}, {"score": 0.003725407888096365, "phrase": "data_analysis"}, {"score": 0.0037036969250223294, "phrase": "monte_carlo_simulations"}, {"score": 0.0036964879865596543, "phrase": "external_process"}, {"score": 0.0036731553441614858, "phrase": "pythia_inner_hit-and-miss_mechanism"}, {"score": 0.0036286965168861487, "phrase": "un-weighted_b-c_events"}, {"score": 0.0035673535019424517, "phrase": "common_weight"}, {"score": 0.003544833070588696, "phrase": "pythia_subroutine_pyevnt"}, {"score": 0.0035207387054911133, "phrase": "random_number"}, {"score": 0.0035118325377862967, "phrase": "importance_sampling_function"}, {"score": 0.0034544757717852527, "phrase": "maximum_event_weight"}, {"score": 0.0034343383062593294, "phrase": "input_events"}, {"score": 0.0034259822618065996, "phrase": "whole_phase-space"}, {"score": 0.003417646478614803, "phrase": "input_events'_weights"}, {"score": 0.0033746251346754006, "phrase": "rejected_events"}, {"score": 0.0033598592278249553, "phrase": "new_method"}, {"score": 0.0033549515820933216, "phrase": "unweighted_events"}, {"score": 0.003345157713366363, "phrase": "new_hit-and-miss_strategy"}, {"score": 0.003332143532820153, "phrase": "bc_meson_un-weight_simulation"}, {"score": 0.0032694419805579878, "phrase": "ref"}, {"score": 0.0032408667175147813, "phrase": "previous_versions"}, {"score": 0.0032141294338347394, "phrase": "combined_way"}, {"score": 0.0032031839760596837, "phrase": "whole_phase_space"}, {"score": 0.0031938317318115747, "phrase": "multidimensional_phase-space_grid"}, {"score": 0.0031721155412941897, "phrase": "adaptive_monte_carlo_multi-dimensional_integration"}, {"score": 0.0031643954818090497, "phrase": "importance-sampling_method"}, {"score": 0.003158232921276607, "phrase": "integration_efficiency"}, {"score": 0.0031444108662650257, "phrase": "different_weight"}, {"score": 0.003132175227565833, "phrase": "maximum_weight"}, {"score": 0.0031169474021833974, "phrase": "importance-sampling_grid_file"}, {"score": 0.0030987719328479427, "phrase": "mint"}, {"score": 0.0030867128061184434, "phrase": "phase-space_grid"}, {"score": 0.0030807010626081465, "phrase": "small_grid_region"}, {"score": 0.003076199916272775, "phrase": "von_neumann_algorithm"}, {"score": 0.0030433912290976457, "phrase": "original_vegas_subroutine"}, {"score": 0.002988997825092953, "phrase": "maximum_weights"}, {"score": 0.0029686702376484804, "phrase": "output_cross-section"}, {"score": 0.0029384370067165183, "phrase": "generated_xmax_array"}, {"score": 0.002915608388677062, "phrase": "initialization_stage"}, {"score": 0.002902845091516618, "phrase": "subroutine_evntinit"}, {"score": 0.0028760830091054852, "phrase": "subroutine_gem"}, {"score": 0.002867684160750118, "phrase": "xmax"}, {"score": 0.0028551289435631345, "phrase": "file_vegas"}, {"score": 0.0028343271075620424, "phrase": "gem_subroutine"}, {"score": 0.0028123050344492553, "phrase": "generation_statistics"}, {"score": 0.0028054581905819554, "phrase": "key_option"}, {"score": 0.0027539625269434698, "phrase": "phase_gen_subroutine"}, {"score": 0.00274859706772108, "phrase": "random_phase-space_point"}, {"score": 0.002719272842590004, "phrase": "upper_bound_value_xmaxup"}, {"score": 0.0027152983329730173, "phrase": "particular_cell"}, {"score": 0.0025684840886757055, "phrase": "previous_generation"}, {"score": 0.00254603795454036, "phrase": "additional_file"}, {"score": 0.0025127350882663247, "phrase": "parameter_values"}, {"score": 0.00249563836267123, "phrase": "normalized_b-c_transverse_momentum"}, {"score": 0.002493245696938561, "phrase": "pt"}, {"score": 0.0024593922558805467, "phrase": "solid_and_dotted_lines"}, {"score": 0.00244265758774488, "phrase": "un-weighted_bc_event_distributions"}, {"score": 0.002433145970197054, "phrase": "weighted_bc_differential_distributions"}, {"score": 0.002411879703928705, "phrase": "proper_normalization"}, {"score": 0.002386139252599391, "phrase": "atlas_collaboration"}, {"score": 0.002379166816616611, "phrase": "excited_state"}, {"score": 0.002376847190962678, "phrase": "bc_meson"}, {"score": 0.002356071827057863, "phrase": "lhc_detectors"}, {"score": 0.002345752181173428, "phrase": "excited_bc_states"}, {"score": 0.0022681186427243264, "phrase": "b-quark_mass"}, {"score": 0.002188773720176492, "phrase": "detailed_technologies"}, {"score": 0.0021845069885729584, "phrase": "production_properties"}, {"score": 0.002156974811133668, "phrase": "mentioned_states"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Event generator", " Hadronic production", " B-c meson", " Un-weighted events"], "paper_abstract": "A newly upgraded version of the BCVEGPY, a generator for hadronic production of the meson Be and its excited states, is available. In comparison with the previous one (Chang et al., 2006), the new version is to apply an improved hit-and-miss technology to generating the un-weighted events much more efficiently under various simulation environments. The codes for production of 2S-wave B-c states are also given here. New version program summary Title of program: BCVEGPY2.2 Catalogue identifier: ADTJ_v2_3 Program obtained from: CPC Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: Standard CPC licence, http://cpc.cs.qub.ac.uk/licence/licence.html No. of lines in distributed program, including test data, etc.: 323731 No. of bytes in distributed program, including test data, etc.: 4498602 Distribution format: tar.gz Computer: Any LINUX based on PC with FORTRAN 77 or FORTRAN 90 and GNU C compiler as well Operating systems: LINUX Programming language used: FORTRAN 77/90 Memory required to execute with typical data: About 2.0 MB Classification: 11.2, 11.5 Catalogue identifier of previous version: ADTJ_v2_2 Journal reference of previous version: Comput. Phys. Commun. 183 (2012) 442 Does the new version supersede the old version?: Yes Nature of physical problem: Hadronic Production of B-c meson and its excited states. Method of solution: To generate un-weighted events of B-c meson and its excited states by using an improved hit-and-miss technology. Reasons for new version: Responding to the feedback from users, such as those from CMS and LHCb groups, we create a new hit-and-miss algorithm for generating the un-weighted events. Furthermore, the relevant codes for generating the 2S-excited state of B-c meson are added, because the excited state production may be sizable in the new LHC run. Typical running time: it depends on which option is chosen to match PYTHIA when generating the full events and also on which state of B-c meson, either its ground state or its excited states, is to be generated. Typically on a 2.27GHz Intel Xeon E5520 processor machine, for producing the B-c meson ground state: I) If setting [IDWTUP=3 and unwght =.true.], it shall adopt the new hit-and-miss technology to generate the un-weighted events, and to generate 10(5) events takes 30 minutes; II) If setting [IDWTUP=3 and unwght =.false.] or [IDWTUP=1 and IGENERATE=0], it shall generate the weighted events, and to generate 105 events takes 2 minutes only (the fastest way, for theoretical purpose only); Ill) As a comparison, if setting [IDWTUP=1 and IGENERATE=1], it shall, as the same as the previous version, adopt the PYTHIA inner hit-and-miss technology to generate the un-weighted events, and to generate 1000 events takes about 22 hours. Thus, the efficiency (and accuracy also) for generating the un-weighted events obviously is greatly increased. Keywords: Event generator; Hadronic production; B-c meson; Un-weighted events Summary of revisions: 1). We improve the approach for generating un-weighted events. 2). Responding to the feedback from users, we adjust part of the codes to make it work more user-friendly. More specifically, we explain main changes in the following : Event generation. If each simulated event comes with a weight, it will make the data analysis much more complicated. Thus the un-weighted events are usually adopted for Monte Carlo simulations. As an external process of PYTHIA, the generator BCVEGPY [1-4] shall call the PYTHIA inner hit-and-miss mechanism to generate the un-weighted events by setting IDWGTUP=1 and IGENERATE=1 [5], i.e. the Von Neumann method is used for generating the un-weighted B-c events. Every events bearing a weight (xwgtup) respectively, when inputting them to PYTHIA, they are suffered from being accepted or rejected, all the fully generated events at the output become to have a common weight. The Von Neumann method states that the event should be accepted by the PYTHIA subroutine PYEVNT with a probability R = xwgtup/xmaxup. This can be achieved by comparing R with a random number that is uniformly distributed within the region of [0, 1]. Namely if R is bigger than such a random number then the event is accepted, otherwise it should be rejected. Here xmaxup stands for the maximum event weight. The von Neumann method works effectively for the cases when all the weights of input events are moderate in the whole phase-space. However if the input events' weights vary greatly, such as varying logarithmically, thee its efficiency shall be greatly depressed, since too much time shall be wasted for calculating xwgtup of the rejected events. Thus it is helpful to find a new method for generating unweighted events. We will adopt the new hit-and-miss strategy suggested by Ref.[6] to do the Bc meson un-weight simulation. Extra switches for calling this new technology are added to BCVEGPY, e.g. the new hit-and-miss technology shall be called by setting IDWTUP=3 and unwght =.true.. Details for this new technology can be found in Ref. [6]. For self-consistency, we repeat its main idea here. To be different from previous versions, BCVEGPY2.2 uses the VEGAS [7] and the MINT [8] as a combined way to generate the un-weighted events. The whole phase space shall be separated to a multidimensional phase-space grid. The main purpose of VEGAS [7] is to perform the adaptive Monte Carlo multi-dimensional integration, which uses the importance-sampling method to improve the integration efficiency. Each event shall generally result in a different weight, recorded by xwgtup, and the maximum weight within each grid shall be simultaneously recorded into the importance-sampling grid file (with the suffix.grid). Then following the idea of MINT, the Von Neumann method is used in each phase-space grid. Within this small grid region, the von Neumann algorithm works effectively, thus the efficiency for generating un-weighted events are greatly increased. To implement the new hit-and-miss algorithm into BCVEGPY2.2, we change the original VEGAS subroutine as vegas (fxn, ndim, ncall, itmx, nprn, xint xmax, imode) Three new variables xint, xmax and imode are added in the VEGAS subroutine. The xmax array is used to record the maximum weights in all cells and mode is a flag. xint stands for the output cross-section when setting imode=0, which shall be used to initialize the xmax array when setting imode=1. For convenience, the generated xmax array will be stored in the same grid file in which the importance sampling function is stored. In the initialization stage, the VEGAS subroutine shall be called by the subroutine evntinit twice by setting imode=0 and imode=1 respectively to generate both the upper bound grid xmax for all cells and the importance sampling function. A subroutine gem (fxn, ndim, Xmax, i mode) is defined in the file vegas. F with the purpose to generate the un-weighted events. Three options for calling gem subroutine are defined: jmode=0 is to initializes the parameter; jmode=3 is to print the generation statistics; jmode=1 is the key option, which is to use the new hit-and-miss technology to generate the un-weighted events. More explicitly, by calling gen (fxn, ndim,mmax, jmode=1), three steps shall be executed: 1. Call the phase_gen subroutine to generate a random phase-space point and to calculate its weight xwgtup. 2. Judge the point locates in which cell and read from the xmax array and get the upper bound value xmaxup for this particular cell. 3. Judge whether such point be kept or not by using the Von Neumann method with the help of the probability xwgtup/xmaxup. To be more flexible, we add one parameter igenmode for generating or using the existed. grid files. When setting igenmode=1, the VEGAS subroutine shall be called to generate the. grid files. When setting igenmode=2, the VEGAS subroutine shall be called to generate more accurate. grid files from the existed. grid files. When setting igenmode=3, one can directly use the existed. grid files to generate events without running VEGAS. Importantly, before using the existed. grid files, one must ensure all the parameters be the same as the previous generation. A script for setting the parameters and a cross-check of the un-weighted events. We put an additional file, bcvegpy_set_par.nam, in the new version for setting the parameters. This way the user does not need to compile the program again if only the parameter values are changed. [GRAPHICS] Fig. 1. Comparison of the normalized B-c transverse momentum (PT) and rapidity (y) distributions derived by setting unwght=.true. (events) and unwght=.false. (differential distributions), which are represented by solid and dotted lines, respectively. As a cross-check of the new technology, we compare the un-weighted Bc event distributions derived by setting unwght=.true. with the weighted Bc differential distributions derived by setting unwght=.false.. The results are shown in Fig. 1. Those two distributions after proper normalization agree well with each other, that shows our present scheme for un-weighted events is correct. Bc(2S) generation. In 2014 the ATLAS collaboration reported an observation about an excited state of Bc meson, which most probably is Bc (2S) state [9]. With more data being collected at LHC detectors, it is hopeful that more observations on the excited Bc states will be issued. Therefore in addition to the production via color-singlet B-c(1S), B-c(1P) and color-octet B-c(1S) states, the B-c(2S) production is involved in BCVEGPY2.2. It is achieved by replacing the 1S-wave bound-state parameters pmb, pmc and fbc with those of the 2S-wave one. Here pmb, pmc and fbc are for b-quark mass, c-quark mass and the radial wave function at the zero (vertical bar R(0)1), respectively. For the 2S-wave case, their default values are set as pmb =5.234 GeV, pmc =1.633 GeV and fbc =0.991 GeV3/2 [10] if the mass of the 2S-wave Bc state is 6.867 GeV. More explicitly, two new values for ibcstate are added: ibcstate =9 is to generate 2(1)S(0) state and ibcstate =10 is to generate 2(3)S(1) state. Detailed technologies for deriving the production properties of all the mentioned ten Bc meson states can be found in Refs.[11-13]. Furthermore, the values for mix_type are rearranged. mix_type=1 is to generate the mixing events for all mentioned states. mix_type=2 is to generate the mixing events for 1(1)S(0) and 1(3)S(1) states. mix_type=3 is to generate the mixing events for the four 1P-wave states and the two color-octet 1(1)S(0) and 1(3)S(1) states. mix_type=4 is to generate the mixing events for 2(1)S(0) and 2(3)S(1) states. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "BCVEGPY2.2: A newly upgraded version for hadronic production of the meson B-c and its excited states", "paper_id": "WOS:000362919500033"}