{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "product_lifecycle_management"}, {"score": 0.004542780650208743, "phrase": "technological_advances"}, {"score": 0.004336115760817672, "phrase": "design_and_engineering_industries"}, {"score": 0.0042610532651691305, "phrase": "global_scale"}, {"score": 0.0035989687070420977, "phrase": "new_skilled_professionals"}, {"score": 0.003336468343971626, "phrase": "increased_need"}, {"score": 0.0025221759076833124, "phrase": "collaborative_practices"}, {"score": 0.00249293148301837, "phrase": "higher_education"}, {"score": 0.00240727738935387, "phrase": "france"}, {"score": 0.0021799789348982516, "phrase": "future_development"}, {"score": 0.002129701089817251, "phrase": "key_skills"}, {"score": 0.0021049977753042253, "phrase": "university_curricula"}], "paper_keywords": ["Product lifecycle management", " design and engineering education", " collaborative product development", " university-industry collaborations", " new product development", " international perspectives"], "paper_abstract": "Technological advances in the last decade have influenced changes in the design and engineering industries on a global scale. Lean and collaborative product development are approaches increasingly adopted by the industry and seen as the core of product lifecycle management. These trends have created the need for new skilled professionals, and universities should adapt their curricula in response. There is an increased need for academia to work with industry in order to meet these challenges. This article reports on the Parametric Technology Corporation Academic Research Symposium held in April 2011. The topics were centred around understanding the essence of product lifecycle management and its impact on design and engineering education. Furthermore, examples of implementing product lifecycle management and collaborative practices in higher education were presented from the United States and France. This article concludes with a discussion of the recommendations made at the symposium for the future development and support of key skills across university curricula.", "paper_title": "Product lifecycle management in design and engineering education: International perspectives", "paper_id": "WOS:000336265000003"}