{"auto_keywords": [{"score": 0.04937387161038603, "phrase": "biometric_technique"}, {"score": 0.00481495049065317, "phrase": "optimization_and_template_updating"}, {"score": 0.004212759658511567, "phrase": "identifying_gesture"}, {"score": 0.004069280130346136, "phrase": "embedded_accelerometer"}, {"score": 0.0037593414153801394, "phrase": "mathematical_method"}, {"score": 0.0037039021744127783, "phrase": "global_sequence_alignment"}, {"score": 0.0035954555250614197, "phrase": "eight_different_scores"}, {"score": 0.0033214855341753544, "phrase": "optimal_eer_result"}, {"score": 0.0032241994368246065, "phrase": "random_set"}, {"score": 0.003053159610975692, "phrase": "real_attempts"}, {"score": 0.0029490571526071016, "phrase": "temporal_study"}, {"score": 0.0025541693207036167, "phrase": "six_updating_schemes"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Mobile authentication", " Template updating", " Gestures", " Biometrics", " Security", " Accelerometers"], "paper_abstract": "This article focuses on the evaluation of a biometric technique based on the performance of an identifying gesture by holding a telephone with an embedded accelerometer in his/her hand. The acceleration signals obtained when users perform gestures are analyzed following a mathematical method based on global sequence alignment. In this article, eight different scores are proposed and evaluated in order to quantify the differences between gestures, obtaining an optimal EER result of 3.42% when analyzing a random set of 40 users of a database made up of 80 users with real attempts of falsification. Moreover, a temporal study of the technique is presented leeding to the need to update the template to adapt the manner in which users modify how they perform their identifying gesture over time. Six updating schemes have been assessed within a database of 22 users repeating their identifying gesture in 20 sessions over 4 months, concluding that the more often the template is updated the better and more stable performance the technique presents. (C) 2011 Elsevier Inc. All rights reserved.", "paper_title": "Score optimization and template updating in a biometric technique for authentication in mobiles based on gestures", "paper_id": "WOS:000295997900015"}