{"auto_keywords": [{"score": 0.03658441415893551, "phrase": "instructional_media"}, {"score": 0.00481495049065317, "phrase": "procedural_tasks"}, {"score": 0.004767546015485477, "phrase": "dynamic_media"}, {"score": 0.004651057147690674, "phrase": "conflicting_accounts"}, {"score": 0.004448471107649881, "phrase": "procedural_motor_learning"}, {"score": 0.0038727120021750973, "phrase": "mirror_neuron_system"}, {"score": 0.0037593414153801394, "phrase": "higher_activation"}, {"score": 0.0037039021744127783, "phrase": "better_performance"}, {"score": 0.003023047748772801, "phrase": "procedural_motor_task"}, {"score": 0.0027925723953701083, "phrase": "static_images"}, {"score": 0.002605329434787829, "phrase": "learners'_own_perspective"}, {"score": 0.0023593563827190626, "phrase": "procedural_motor_tasks"}, {"score": 0.0022675820982741347, "phrase": "appropriate_activation"}, {"score": 0.002234092591045251, "phrase": "perceptual_system"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Animations", " Procedural learning", " Perspective"], "paper_abstract": "There have been conflicting accounts regarding the effectiveness of animations for learning. Procedural motor learning represents one of the few areas in which animations have consistently shown to be facilitative. Some have suggested that this benefit is related to activation of the mirror neuron system (MNS), with higher activation leading to better performance. This study examines this explanation, and observed the effects of instructional media (animation vs. static), as a function of viewing perspective (face-to-face vs. over-the-shoulder) on understanding a procedural motor task (knot tying). Results indicate that performance was significantly improved with animations over static images, however this appeared to be most pronounced in situations which matched the learners' own perspective (i.e., over-the-shoulder). These findings have implications for the design of instructional media for procedural motor tasks and provide confirmation of the assertion that appropriate activation of the perceptual system can be leveraged to increase performance. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Rotational perspective and learning procedural tasks from dynamic media", "paper_id": "WOS:000325600400003"}