{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "highly_cited_articles"}, {"score": 0.00452043800760441, "phrase": "policy_measures"}, {"score": 0.004317576641196539, "phrase": "scientific_research"}, {"score": 0.004147523799581407, "phrase": "intended_purpose"}, {"score": 0.0041001740903338834, "phrase": "national_research_assessment_exercises"}, {"score": 0.0037834649508375544, "phrase": "best_research_products"}, {"score": 0.0036763623220059933, "phrase": "different_approach"}, {"score": 0.0033922781038328844, "phrase": "individual_scientists"}, {"score": 0.002402731767209114, "phrase": "bibliometric_indicators"}, {"score": 0.002268441347979241, "phrase": "italian_universities"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Bibliometrics", " Research evaluation", " Research productivity", " Top scientists", " Highly cited articles", " University"], "paper_abstract": "Ever more frequently, governments have decided to implement policy measures intended to foster and reward excellence in scientific research. This is in fact the intended purpose of national research assessment exercises. These are typically based on the analysis of the quality of the best research products; however, a different approach to analysis and intervention is based on the measure of productivity of the individual scientists, meaning the. overall impact of their entire scientific production over the period under observation. This work analyzes the convergence of the two approaches, asking if and to what measure the most productive scientists achieve highly cited articles; or vice versa, what share of highly cited articles is achieved by scientists that are \"non-top\" for productivity. To do this we use bibliometric indicators, applied to the 2004-2008 publications authored by academics of Italian universities and indexed in the Web of Science. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Are the authors of highly cited articles also the most productive ones?", "paper_id": "WOS:000331771900009"}