{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "data_mining_techniques"}, {"score": 0.0131183113079042, "phrase": "crm."}, {"score": 0.00864199760211532, "phrase": "customer_relationship_management"}, {"score": 0.007696645517845047, "phrase": "classification_scheme"}, {"score": 0.004304271837157217, "phrase": "comprehensive_literature_review"}, {"score": 0.004129138311177554, "phrase": "first_identifiable_academic_literature_review"}, {"score": 0.0039446780026489905, "phrase": "academic_database"}, {"score": 0.003645192746918234, "phrase": "nine_hundred_articles"}, {"score": 0.003482276061796395, "phrase": "crm._eighty-seven_articles"}, {"score": 0.003151572886432253, "phrase": "customer_retention_and_customer_development"}, {"score": 0.0027934768366077397, "phrase": "nine_sub-categories"}, {"score": 0.002735972929840289, "phrase": "different_data_mining_techniques"}, {"score": 0.002690820958068933, "phrase": "major_focus"}, {"score": 0.002624482632439123, "phrase": "review_and_classification_process"}, {"score": 0.002496659907186784, "phrase": "research_area"}, {"score": 0.0024759682272230735, "phrase": "customer_retention"}, {"score": 0.0023651843133643785, "phrase": "one-to-one_marketing"}, {"score": 0.002268769196700254, "phrase": "classification_and_association_models"}, {"score": 0.0021314498639048085, "phrase": "future_research"}, {"score": 0.0021049977753042253, "phrase": "knowledge_accumulation"}], "paper_keywords": ["Data mining", " Customer relationship management", " Literature review", " Classification"], "paper_abstract": "Despite the importance of data mining techniques to customer relationship management (CRM), there is a lack of a comprehensive literature review and a classification scheme for it. This is the first identifiable academic literature review of the application of data mining techniques to CRM. It provides an academic database of literature between the period of 2000-2006 covering 24 journals and proposes a classification scheme to classify the articles. Nine hundred articles were identified and reviewed for their direct relevance to applying data mining techniques to CRM. Eighty-seven articles were subsequently selected, reviewed and classified. Each of the 87 selected papers was categorized on four CRM dimensions (Customer Identification, Customer Attraction, Customer Retention and Customer Development) and seven data mining functions (Association, Classification, Clustering, Forecasting, Regression, Sequence Discovery and Visualization). Papers were further classified into nine sub-categories of CRM elements under different data mining techniques based on the major focus of each paper. The review and classification process was independently verified. Findings of this paper indicate that the research area of customer retention received most research attention. Of these, most are related to one-to-one marketing and loyalty programs respectively. On the other hand, classification and association models are the two commonly used models for data mining in CRM. Our analysis provides a roadmap to guide future research and facilitate knowledge accumulation and creation concerning the application of data mining techniques in CRM. (C) 2008 Elsevier Ltd. All rights reserved.", "paper_title": "Application of data mining techniques in customer relationship management: A literature review and classification", "paper_id": "WOS:000262178100003"}