{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "conflict_distance"}, {"score": 0.030507086791631846, "phrase": "rough_sets"}, {"score": 0.004563691742821759, "phrase": "objective_world"}, {"score": 0.004403480614319231, "phrase": "human_ability"}, {"score": 0.004045068727683462, "phrase": "real-life_problem"}, {"score": 0.0035374012552316573, "phrase": "soft_decision_making"}, {"score": 0.003220315882881027, "phrase": "intuitionistic_fuzzy_set"}, {"score": 0.003191636645925296, "phrase": "rough_set"}, {"score": 0.002905454531687249, "phrase": "information_system"}, {"score": 0.002841176824012961, "phrase": "intuitionistic_fuzzy_information_system"}, {"score": 0.0026806139086152365, "phrase": "intuitionistic_fuzzy_similarity"}, {"score": 0.002322895056238477, "phrase": "novel_tool"}, {"score": 0.0023021895404322767, "phrase": "conflict_analysis"}, {"score": 0.002221192647477371, "phrase": "new_tool"}, {"score": 0.002162316557411786, "phrase": "real-life_conflict_problem"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Intuitionistic fuzzy set", " Fuzzy rough set model", " Theories of uncertainty", " Conflict analysis"], "paper_abstract": "Due to the complexity and uncertainty of the objective world, as well as the limitation of human ability to understand, it is difficult for one to employ only a single type of uncertainty method to deal with the real-life problem of decision-making, especially problems involving conflicts. On the other hand, by incorporating the advantages of various theories of uncertainty, one is expected to develop a more powerful hybrid method for soft decision making and to solve such problems more effectively. In view of this, in this paper the thought and method of intuitionistic fuzzy set and rough set are used to construct a novel intuitionistic fuzzy rough set model. Corresponding to the fact that the decision making information system of rough sets is of intuitionistic fuzzy information system, our method defines the conflict distance by using the idea of measuring intuitionistic fuzzy similarity so that it is introduced into the models of rough sets, leading to the development of our intuitionistic fuzzy rough set model. After that, we investigate the properties of the model, introduce a novel tool for conflict analysis based on our hybrid model, and employ this new tool to describe and resolve a real-life conflict problem. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Intuitionistic fuzzy rough set model based on conflict distance and applications", "paper_id": "WOS:000352955600020"}