{"auto_keywords": [{"score": 0.04823730788074539, "phrase": "corporate_governance_information"}, {"score": 0.010121680521869035, "phrase": "spanish_listed_companies"}, {"score": 0.006210075783685996, "phrase": "supervisory_authorities"}, {"score": 0.00481495049065317, "phrase": "internet-based_corporate_governance_disclosure"}, {"score": 0.0047880792317288486, "phrase": "spanish"}, {"score": 0.004734718930096544, "phrase": "purpose_-_the_purpose"}, {"score": 0.004185632403886255, "phrase": "existing_literature"}, {"score": 0.0040928394196673955, "phrase": "web_sites"}, {"score": 0.0040020953332147785, "phrase": "key_variable"}, {"score": 0.003968585341590009, "phrase": "web_site_quality"}, {"score": 0.0036689971286619767, "phrase": "voluntary_disclosure"}, {"score": 0.003587616378156851, "phrase": "anova._analysis"}, {"score": 0.0035178850936755848, "phrase": "empirical_evidence"}, {"score": 0.0031889761655961345, "phrase": "disclosure_levels"}, {"score": 0.0029646555801624563, "phrase": "communications_and_information_services_industry"}, {"score": 0.002834505099882888, "phrase": "increasing_interest"}, {"score": 0.0027638156862940465, "phrase": "european_and_us_capital_markets"}, {"score": 0.0026129593626748326, "phrase": "regulatory_stock_market_agencies"}, {"score": 0.0022391314340650544, "phrase": "new_approach"}, {"score": 0.0021893963445354507, "phrase": "particularly_the_internet"}, {"score": 0.0021168529640131326, "phrase": "corporate_governance_transparency"}, {"score": 0.0021049977753042253, "phrase": "listed_companies"}], "paper_keywords": ["Corporate governance", " Internet", " Disclosure", " Spain"], "paper_abstract": "Purpose - The purpose of this paper is to analyse the corporate governance information disclosed by Spanish listed companies on the internet, with the objective of assessing the went and the influence of several I corporate characteristics on the level of information voluntarily disclosed. Design/methodology/approach - The study took as its reference the existing literature on the examination of the quality of web sites and the importance of content as a key variable in determining web site quality. To quantify the corporate governance information disclosed by Spanish listed companies, three transparency indexes were designed. To contrast which variables determine the information provided Online, the investigation based itself oil studies about voluntary disclosure in companies, and three lineal regressions models and in ANOVA. analysis were performed. Findings - The empirical evidence obtained reveals that the firms that score highest for transparency are also those that are most likely to use the internet as a channel for the disclosure of corporate governance information. The results show that disclosure levels depend oil the degree to which firms are followed by analysts, their listing age, their \"visibility\" and the fact of belonging to the communications and information services industry. Practical implications - The need for this Study was clear in view of the increasing interest shown by supervisory authorities for the oversight of the European and US capital markets in regulating not only the content but also the manner in which corporate governance information is disclosed over the internet. During the coming years, regulatory stock market agencies will have to strive to take advantage of the opportunities that the internet offers to increase both the relational and informational capacity of company web sites. Originality/value - Corporate governance research has focused mainly on the analysis of the information that firms ought to disclose and the effects of disclosure generally, without considering the media involved. This paper suggests a new approach that examines the relevance of technology, particularly the internet, and orients supervisory authorities in the direction to follow for improving corporate governance transparency in listed companies.", "paper_title": "Determinants of internet-based corporate governance disclosure by Spanish listed companies", "paper_id": "WOS:000262140300008"}