{"auto_keywords": [{"score": 0.04933866662045337, "phrase": "resist_lines"}, {"score": 0.048899735384869365, "phrase": "photolithography_coating_tool"}, {"score": 0.012126868900207054, "phrase": "dispense_system"}, {"score": 0.00481495049065317, "phrase": "empty_resist_bottles"}, {"score": 0.004384960761826366, "phrase": "integrated_circuits"}, {"score": 0.004290262018446916, "phrase": "hard_drives"}, {"score": 0.004210714223341684, "phrase": "reservoir_switching_units"}, {"score": 0.00410693065248228, "phrase": "photolithography_tool"}, {"score": 0.0040686720114175, "phrase": "millipore_pump"}, {"score": 0.003894772585498127, "phrase": "poor_dispenses"}, {"score": 0.003798746478986171, "phrase": "operator_inspection"}, {"score": 0.003625009798162227, "phrase": "increasing_cost"}, {"score": 0.00343766112727297, "phrase": "larger_wafers"}, {"score": 0.00331125524068286, "phrase": "poor_dispense"}, {"score": 0.0031696255948160923, "phrase": "manufacturing_costs"}, {"score": 0.002968424524565369, "phrase": "single_wafer"}, {"score": 0.0029224275921964724, "phrase": "overall_production_costs"}, {"score": 0.0028237205895435733, "phrase": "hard_drive_market"}, {"score": 0.002669320541871186, "phrase": "programmable_logic_controller"}, {"score": 0.0026527085856536837, "phrase": "plc"}, {"score": 0.002595307614796063, "phrase": "relay_dispense_system"}, {"score": 0.00253916011199984, "phrase": "remote_station"}, {"score": 0.0023264294945973623, "phrase": "wafer_yield"}, {"score": 0.002151565516513624, "phrase": "plc_control_system"}], "paper_keywords": ["process control", " programmable logic controllers", " photolithography", " PLC control"], "paper_abstract": "The process of photolithography uses light to imprint an image onto a wafer coated with photoresist in order to create integrated circuits or other technology such as read/write heads for hard drives. During this process, reservoir switching units can fail to detect resist on the photolithography tool or the Millipore pump, thus introducing air into the resist lines and ultimately causing scrap due to poor dispenses. This is difficult to detect via operator inspection. It is important to improve the dispense system of a photolithography coating tool because with the increasing cost of photoresist there is a need for less waste. There are more read/write heads on a wafer and larger wafers are being used; therefore, if the photolithography coating tool has a poor dispense which is not detected and a wafer is scrapped, this will increase manufacturing costs. By reducing the amount of scrap and reworks there will be a reduction in the time to produce a single wafer, thus reducing the overall production costs of making a single read/write head and staying more competitive in the hard drive market. This paper outlines a method for detecting empty resist bottles or air in the resist lines using programmable logic controller (PLC) technology in conjunction with a relay dispense system to monitor the dispense system from a remote station, thereby improving the process and reducing the cost of manufacturing read/write heads. Overall there are less dispense errors and thus less rework and scrap, meaning that the wafer yield has improved and therefore the cost of manufacturing a read/write head has reduced and the time to market has improved. Due to the success of the PLC control system, it will be implemented across other coating tools in the factory.", "paper_title": "The detection of empty resist bottles or air in the resist lines of a photolithography coating tool", "paper_id": "WOS:000354624600007"}