{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "internet_studies"}, {"score": 0.011907046154656917, "phrase": "journal-level_factors"}, {"score": 0.004494570360108983, "phrase": "relative_explanatory_power"}, {"score": 0.004195418010131832, "phrase": "natural_growth_mechanism"}, {"score": 0.0037834649508375544, "phrase": "multilevel_model"}, {"score": 0.003548905904860611, "phrase": "research_strategy"}, {"score": 0.003428665921276366, "phrase": "expected_and_surprising_findings"}, {"score": 0.003378385493203297, "phrase": "primary_determinants"}, {"score": 0.002576503437739865, "phrase": "rhetorical_purposes"}, {"score": 0.0025014259919355453, "phrase": "social_constructivist_approach"}, {"score": 0.002346160830406661, "phrase": "normative_theory"}, {"score": 0.0021789194955896124, "phrase": "growing_citation_gap"}, {"score": 0.0021049977753042253, "phrase": "different_characteristics"}], "paper_keywords": ["Internet", " bibliographic citations", " hierarchical models"], "paper_abstract": "This study explores the factors influencing citations to Internet studies by assessing the relative explanatory power of three perspectives: normative theory, the social constructivist approach, and a natural growth mechanism. Using data on 7,700+ articles of Internet studies published in 100+ Social Sciences Citation Index (SSCI)-listed journals in 20002009, the study adopted a multilevel model to disentangle the impact between article- and journal-level factors on citations. This research strategy resulted in a number of both expected and surprising findings. The primary determinants for citations are found to be journal-level factors, accounting for 14% of the variances in citations of Internet studies. The impact of some, if not all, article-level factors on citations are moderated by journal-level factors. Internet studies, like studies in other areas (e.g., management, demography, and ecology), are cited more for rhetorical purposes, as suggested by the social constructivist approach, rather than as a form of reward, as argued by normative theory. The impact of time on citations varies across journals, which creates a growing citation gap for Internet studies published in journals with different characteristics.", "paper_title": "Where you publish matters most: A multilevel analysis of factors affecting citations of internet studies", "paper_id": "WOS:000307730000007"}