{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "image_similarity_assessment"}, {"score": 0.004723847090183984, "phrase": "image_similarity"}, {"score": 0.004612376827433774, "phrase": "numerous_multimedia_applications"}, {"score": 0.004503525064934708, "phrase": "similarity_assessment"}, {"score": 0.004272969980602508, "phrase": "perceptually_consistent_manner"}, {"score": 0.00409310463335204, "phrase": "image_similarity_assessment_problem"}, {"score": 0.004034841146538891, "phrase": "information_fidelity_problem"}, {"score": 0.0038834787946979863, "phrase": "feature-based_approach"}, {"score": 0.003702206069379459, "phrase": "reference_image"}, {"score": 0.00349577373145384, "phrase": "test_image"}, {"score": 0.00326939082861424, "phrase": "feature_points"}, {"score": 0.0027259252868643926, "phrase": "sparse_representation"}, {"score": 0.002623536040408411, "phrase": "proposed_feature-based_sparse_representation"}, {"score": 0.0022509365210787993, "phrase": "representation_problems"}, {"score": 0.0022294857939412073, "phrase": "promising_results"}, {"score": 0.0021049977753042253, "phrase": "stirmark_benchmark"}], "paper_keywords": ["Feature detection", " image copy detection", " image recognition", " image retrieval", " image similarity assessment", " sparse representation"], "paper_abstract": "Assessment of image similarity is fundamentally important to numerous multimedia applications. The goal of similarity assessment is to automatically assess the similarities among images in a perceptually consistent manner. In this paper, we interpret the image similarity assessment problem as an information fidelity problem. More specifically, we propose a feature-based approach to quantify the information that is present in a reference image and how much of this information can be extracted from a test image to assess the similarity between the two images. Here, we extract the feature points and their descriptors from an image, followed by learning the dictionary/basis for the descriptors in order to interpret the information present in this image. Then, we formulate the problem of the image similarity assessment in terms of sparse representation. To evaluate the applicability of the proposed feature-based sparse representation for image similarity assessment (FSRISA) technique, we apply FSRISA to three popular applications, namely, image copy detection, retrieval, and recognition by properly formulating them to sparse representation problems. Promising results have been obtained through simulations conducted on several public datasets, including the Stirmark benchmark, Corel-1000, COIL-20, COIL-100, and Caltech-101 datasets.", "paper_title": "Feature-Based Sparse Representation for Image Similarity Assessment", "paper_id": "WOS:000295007300015"}