{"auto_keywords": [{"score": 0.015403381611414612, "phrase": "mental_health_service_users"}, {"score": 0.007427069836956516, "phrase": "internet_use"}, {"score": 0.006730924534780398, "phrase": "veterans"}, {"score": 0.006486921216595795, "phrase": "background_characteristics"}, {"score": 0.004736434518535051, "phrase": "veterans_affairs"}, {"score": 0.004602085616330634, "phrase": "objective_the_department_of_veterans_affairs"}, {"score": 0.004564420359851089, "phrase": "va"}, {"score": 0.00445318311339027, "phrase": "largest_nationwide_healthcare_systems"}, {"score": 0.004344662696228875, "phrase": "internet_technology"}, {"score": 0.004238775572746022, "phrase": "online_personal_health_record_system"}, {"score": 0.004186799638538032, "phrase": "healthevet"}, {"score": 0.003952513974962462, "phrase": "online_health_information"}, {"score": 0.003920128102807887, "phrase": "va_patients"}, {"score": 0.00388800655625083, "phrase": "specifically_mental_health_service_users"}, {"score": 0.003824547895167011, "phrase": "nationally_representative_sample"}, {"score": 0.0036553070575015344, "phrase": "logistic_regression"}, {"score": 0.0030623570435946977, "phrase": "higher_incomes"}, {"score": 0.0025972447844047515, "phrase": "va_information"}, {"score": 0.0021049977753042253, "phrase": "health_information_online"}], "paper_keywords": [""], "paper_abstract": "Objective The Department of Veterans Affairs (VA) operates one of the largest nationwide healthcare systems and is increasing use of internet technology, including development of an online personal health record system called My HealtheVet. This study examined internet use among veterans in general and particularly use of online health information among VA patients and specifically mental health service users. Methods A nationally representative sample of 7215 veterans from the 2010 National Survey of Veterans was used. Logistic regression was employed to examine background characteristics associated with internet use and My HealtheVet. Results 71% of veterans reported using the internet and about a fifth reported using My HealtheVet. Veterans who were younger, more educated, white, married, and had higher incomes were more likely to use the internet. There was no association between background characteristics and use of My HealtheVet. Mental health service users were no less likely to use the internet or My HealtheVet than other veterans. Discussion Most veterans are willing to access VA information online, although many VA service users do not use My HealtheVet, suggesting more education and research is needed to reduce barriers to its use. Conclusion Although adoption of My HealtheVet has been slow, the majority of veterans, including mental health service users, use the internet and indicate a willingness to receive and interact with health information online.", "paper_title": "Use of the internet and an online personal health record system by US veterans: comparison of Veterans Affairs mental health service users and other veterans nationally", "paper_id": "WOS:000310408500025"}