{"auto_keywords": [{"score": 0.04853750751694913, "phrase": "teenage_patients"}, {"score": 0.04759733200142656, "phrase": "social_media"}, {"score": 0.005770880386171228, "phrase": "facebook"}, {"score": 0.004698229304089357, "phrase": "qualitative_study"}, {"score": 0.004418601451254075, "phrase": "active_users"}, {"score": 0.004138575034269399, "phrase": "considerable_amount"}, {"score": 0.004104838067758352, "phrase": "personal_information"}, {"score": 0.003924121879214595, "phrase": "personal_health_information"}, {"score": 0.0037055370870874484, "phrase": "social_media_sites"}, {"score": 0.00357146811369898, "phrase": "content_analysis"}, {"score": 0.0035423376631308567, "phrase": "semistructured_interviews"}, {"score": 0.003210704011271791, "phrase": "pervasive_use"}, {"score": 0.0029824560656987855, "phrase": "sick_teenager"}, {"score": 0.002480154140902474, "phrase": "similar_conditions"}, {"score": 0.002380534385718454, "phrase": "health_information"}, {"score": 0.002303720729387236, "phrase": "important_role"}, {"score": 0.002275557501858879, "phrase": "social_life"}, {"score": 0.002220257443705344, "phrase": "young_patients"}, {"score": 0.002148604369150115, "phrase": "teenage_patients'_online_privacy_behavior"}], "paper_keywords": [""], "paper_abstract": "Background The literature describes teenagers as active users of social media, who seem to care about privacy, but who also reveal a considerable amount of personal information. There have been no studies of how they manage personal health information on social media. Objective To understand how chronically ill teenage patients manage their privacy on social media sites. Design A qualitative study based on a content analysis of semistructured interviews with 20 hospital patients (12-18 years). Results Most teenage patients do not disclose their personal health information on social media, even though the study found a pervasive use of Facebook. Facebook is a place to be a \"regular\", rather than a sick teenager. It is a place where teenage patients stay up-to-date about their social life-it is not seen as a place to discuss their diagnosis and treatment. The majority of teenage patients don't use social media to come into contact with others with similar conditions and they don't use the internet to find health information about their diagnosis. Conclusions Social media play an important role in the social life of teenage patients. They enable young patients to be \"regular\" teenagers. Teenage patients' online privacy behavior is an expression of their need for self-definition and self-protection.", "paper_title": "Not all my friends need to know: a qualitative study of teenage patients, privacy, and social media", "paper_id": "WOS:000313512900004"}