{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "online_ecological_colourings"}, {"score": 0.004782587436296574, "phrase": "generalizing_first-fit"}, {"score": 0.004221450123456042, "phrase": "ecological_colouring_c"}, {"score": 0.003879919492075319, "phrase": "current_graph"}, {"score": 0.0035062280202127136, "phrase": "well-known_first-fit_algorithm"}, {"score": 0.003104849179057156, "phrase": "polynomial_time"}, {"score": 0.002951444412262927, "phrase": "c._for_the_case"}, {"score": 0.002767934112798688, "phrase": "simple_characterization"}, {"score": 0.002361410799860054, "phrase": "ecological_h-colourings"}, {"score": 0.0021700361584578633, "phrase": "ecological_h-colouring"}, {"score": 0.002148136905808445, "phrase": "fixed_h"}], "paper_keywords": ["Graph colouring", " Graph homomorphisms", " Online algorithms"], "paper_abstract": "A colouring of a graph is ecological if every pair of vertices that have the same set of colours in their neighbourhood are coloured alike. We consider the following problem: if a graph G and an ecological colouring c of G are given, can further vertices added to G, one at a time, be coloured so that at each stage the current graph is ecologically coloured? If the answer is yes, then we say that the pair (G,c) is ecologically online extendible. By generalizing the well-known First-Fit algorithm, we are able to characterize when (G,c) is ecologically online extendible, and to show that deciding whether (G,c) is ecologically extendible can be done in polynomial time. We also describe when the extension is possible using only colours from a given finite set C. For the case where c is a colouring of G in which each vertex is coloured distinctly, we give a simple characterization of when (G,c) is ecologically online extendible using only the colours of c, and we also show that (G,c) is always online extendible using the colours of c plus one extra colour. We also study (off-line) ecological H-colourings (an H-colouring of G is a homomorphism from G to H). We study the problem of deciding whether G has an ecological H-colouring for some fixed H and give a characterization of its computational complexity in terms of the structure of H.", "paper_title": "Obtaining Online Ecological Colourings by Generalizing First-Fit", "paper_id": "WOS:000330992200005"}