{"auto_keywords": [{"score": 0.041743876102144445, "phrase": "neale"}, {"score": 0.008153442575445712, "phrase": "evolutionary_computation"}, {"score": 0.004960533817383619, "phrase": "constituent_algorithms"}, {"score": 0.00481495049065317, "phrase": "global_numerical_optimization."}, {"score": 0.004717125879761534, "phrase": "evolutionary_algorithm_ensembles"}, {"score": 0.004367581653370531, "phrase": "novel_evolutionary_algorithm_ensemble"}, {"score": 0.004322967486451877, "phrase": "global_numerical_optimization"}, {"score": 0.004256895619944631, "phrase": "neale."}, {"score": 0.004127753467337283, "phrase": "good_tradeoff"}, {"score": 0.0033790939774692545, "phrase": "code"}, {"score": 0.0032423089921154503, "phrase": "overall_quality"}, {"score": 0.0030171910207671205, "phrase": "convergence_speed"}, {"score": 0.002585906251354904, "phrase": "predefined_generation_number"}, {"score": 0.002559444836360178, "phrase": "different_interaction_strategies"}, {"score": 0.0022738775158524793, "phrase": "special_session"}, {"score": 0.002250601866422547, "phrase": "real-parameter_optimization"}], "paper_keywords": ["Evolutionary algorithm ensembles", " global numerical optimization", " composite differential evolution", " covariance matrix adaptation evolution strategy"], "paper_abstract": "In the past few years, evolutionary algorithm ensembles have gradually attracted more and more attention in the community of evolutionary computation. This paper proposes a novel evolutionary algorithm ensemble for global numerical optimization, named NEALE. In order to make a good tradeoff between the exploration and exploitation, NEALE is composed of two constituent algorithms, i.e., the composite differential evolution (CoDE) and the covariance matrix adaptation evolution strategy (CMA-ES). During the evolution, CoDE aims at probing more promising regions and refining the overall quality of the population, while the purposes of CMA-ES are to accelerate the convergence speed and to enhance the accuracy of the solutions. In addition, NEALE encourages the interaction between the constituent algorithms. In NEALE, the interaction is controlled by a predefined generation number and different interaction strategies are designed according to the features of the constituent algorithms. The performance of NEALE has been tested on 25 benchmark test functions developed for the special session on real-parameter optimization of the 2005 IEEE Congress on Evolutionary Computation (IEEE CEC2005). Compared with other state-of-the-art evolutionary algorithms and the individual constituent algorithms, NEALE performs significantly better than them.", "paper_title": "A NOVEL EVOLUTIONARY ALGORITHM ENSEMBLE FOR GLOBAL NUMERICAL OPTIMIZATION", "paper_id": "WOS:000323564900004"}