{"auto_keywords": [{"score": 0.04057895115440658, "phrase": "gis"}, {"score": 0.0178651902639415, "phrase": "earth"}, {"score": 0.01036142556691429, "phrase": "goodchild"}, {"score": 0.007587991590360148, "phrase": "marine_and_coastal_gis"}, {"score": 0.00481495049065317, "phrase": "post-gisystems_world"}, {"score": 0.0047256726869051805, "phrase": "seminal_article"}, {"score": 0.00444377150105556, "phrase": "geographic_information_science"}, {"score": 0.004189809878977535, "phrase": "continuing_issue"}, {"score": 0.0040465901036133975, "phrase": "geographic_information_systems"}, {"score": 0.003918719228049752, "phrase": "brief_perspective"}, {"score": 0.0037948736326503534, "phrase": "substantive'_questions"}, {"score": 0.0033913321452667708, "phrase": "spatial_cyber_infrastructure"}, {"score": 0.0032404220951853238, "phrase": "multidimensional_data"}, {"score": 0.0031632577978662484, "phrase": "underlying_lesson"}, {"score": 0.002804064273451705, "phrase": "'post-gisystems'_world"}, {"score": 0.0027446057983474994, "phrase": "broader_framework"}, {"score": 0.002715349745905368, "phrase": "'the_web"}, {"score": 0.0026364893960490396, "phrase": "new_paradigm"}, {"score": 0.002587499140336252, "phrase": "'fourth_paradigm"}, {"score": 0.0025667822592523267, "phrase": "hey_et_al"}, {"score": 0.002374855916752648, "phrase": "global_observational_science"}, {"score": 0.0021506298189636363, "phrase": "longstanding_fundamentals"}, {"score": 0.0021049977753042253, "phrase": "distance_decay"}], "paper_keywords": ["geographic information science", " domain sciences", " Goodchild", " strategic directions"], "paper_abstract": "This perspectives paper uses the seminal article of Goodchild (1992) as a lens through which to review and reflect upon several longstanding issues that have influenced the field of geographic information science in the past and will continue to be important at least into the next decade. Under the category of theory, the continuing issue of 'tool versus science' now has implications for the defining of geographic information systems (GISs) as a profession. In turn, a brief perspective is offered on how GIS has contributed to 'methodological versus substantive' questions in science, leading to the understanding of how the Earth works versus how the Earth should look. Both understandings of the Earth are particularly germane to the emergence of tools and applications such as marine and coastal GIS, virtual globes, spatial cyber infrastructure, and the ethics of GIS. And in the realm of marine and coastal GIS, the example of multidimensional data structuring and scaling is used to highlight an underlying lesson of Goodchild (1992) in that theory and application are in no way mutually exclusive, and it may often be application that advances theory, rather than vice versa. Indeed, it may be this reversal that is ushering in a 'post-GISystems' world, where GIS is subsumed into a broader framework known simply as 'the web,' divorced from the desktop, but providing a new paradigm for GIS (aligned with the 'fourth paradigm' of Hey et al. 2009). As so much data and information will be collected spatially in a way not possible before (e. g., the 'big data' of global observational science), GIS will need to be both system and science to support the turn toward more place-based research across increasing scientific domains. GIS is needed also by society at large to guide the understanding of the longstanding fundamentals of geolocation, scale, proximity, distance decay, the neighborhood, the region, the territory, and more.", "paper_title": "Theory and application in a post-GISystems world", "paper_id": "WOS:000311481200002"}