{"auto_keywords": [{"score": 0.04119507495012034, "phrase": "optimization_problem"}, {"score": 0.03448025990631415, "phrase": "pso_algorithm"}, {"score": 0.00481495049065317, "phrase": "particle_swarm_algorithm"}, {"score": 0.004703149944841539, "phrase": "three-phase_slurry_catalytic_reactor"}, {"score": 0.004558091785667046, "phrase": "industrial_chemical_process"}, {"score": 0.0044002186469797476, "phrase": "conventional_deterministic_methods"}, {"score": 0.004348813532606792, "phrase": "chemical_process"}, {"score": 0.00385141330111392, "phrase": "input_variables"}, {"score": 0.0035750047462243836, "phrase": "environmental_constraint"}, {"score": 0.0034375594065869032, "phrase": "multivariable_non-linear_rigorous_mathematical_model"}, {"score": 0.0031907572162427978, "phrase": "parameters_values"}, {"score": 0.003116605704463135, "phrase": "pso"}, {"score": 0.0029966788947444535, "phrase": "constrained_optimization_problem"}, {"score": 0.0029040994533437903, "phrase": "pso_parameters"}, {"score": 0.0028365413717574544, "phrase": "rigorous_mathematical_model"}, {"score": 0.002748895580860912, "phrase": "high_computational_burden"}, {"score": 0.002674423963978094, "phrase": "high_rate"}, {"score": 0.002511672561475743, "phrase": "real_time_applications"}, {"score": 0.002340357706078868, "phrase": "optimization_goal"}, {"score": 0.002285883886723896, "phrase": "reduced_number"}, {"score": 0.0022680085357731196, "phrase": "function_evaluations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multiphase reactors", " Optimization", " PSO"], "paper_abstract": "The Particle Swarm Optimization (PSO) method was employed to optimize an industrial chemical process characterized by being difficult to be optimized by conventional deterministic methods. The chemical process is a three phase catalytic slurry reactor (tubular geometry) in which the reaction of the hydrogenation of o-cresol producing 2-methyl-cyclohexanol is carried out. The optimization problem was formulated considering as input variables the operating conditions of the reactor and as objective function the maximization of productivity, subject to the environmental constraint of conversion. The process was represented by a multivariable non-linear rigorous mathematical model and in order to solve the optimization problem, the performance of the PSO algorithm was evaluated considering four sets of parameters values suggested by the literature. PSO demonstrated to be efficient and robust to solve the constrained optimization problem, independently of the values of the PSO parameters. The solution of the rigorous mathematical model of the reactor was associated with a high computational burden, and although the PSO algorithm presented high rate of convergence, the attempt to make possible the optimization in a timeframe suitable to real time applications failed because the algorithm lost robustness (fraction of the number of runs the algorithm reached the optimization goal) when run with a reduced number of function evaluations. Therefore, if this type of application is desired, simplified mathematical models with fast and simple numerical methods must be preferred. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Analysis of the particle swarm algorithm in the optimization of a three-phase slurry catalytic reactor", "paper_id": "WOS:000296871800015"}