{"auto_keywords": [{"score": 0.038703030275359485, "phrase": "goyal's_universal_scheme"}, {"score": 0.03534873591980856, "phrase": "\"tighter\"_security_reduction"}, {"score": 0.031745049141189516, "phrase": "new_scheme"}, {"score": 0.023232749979061322, "phrase": "public_parameters"}, {"score": 0.00481495049065317, "phrase": "dl_assumption"}, {"score": 0.004713517760156573, "phrase": "goyal"}, {"score": 0.004653667500876187, "phrase": "new_and_creative_approach"}, {"score": 0.004112812699639956, "phrase": "private-key_generator"}, {"score": 0.004008981656795115, "phrase": "identity-based_encryption"}, {"score": 0.0038253590626087237, "phrase": "new_universal_a-ibe_scheme"}, {"score": 0.0034828730516958807, "phrase": "time_requirements"}, {"score": 0.0032950412841674026, "phrase": "weaker_hard_problem"}, {"score": 0.00317095235382607, "phrase": "stronger_security_definition"}, {"score": 0.003117307618682836, "phrase": "adaptively_selected_identity"}, {"score": 0.0027078974645805736, "phrase": "new_proposed_scheme"}, {"score": 0.002561752783323717, "phrase": "goyal's_scheme"}, {"score": 0.0024234763342790852, "phrase": "time_requirement"}, {"score": 0.0021049977753042253, "phrase": "compromise_values"}], "paper_keywords": ["identity-based encryption", " accountable authority identity-based encryption", " pairing operation", " discrete logarithm problem"], "paper_abstract": "In 2007, Goyal introduced a new and creative approach, called accountable authority identity-based encryption ( referred to as A-IBE), to reduce the degree of trust that must be placed in the private-key generator (PKG) in an identity-based encryption (IBE) scheme. Based on his work, a new universal A-IBE scheme is proposed in this paper. Compared with Goyal's universal scheme, this new universal A-IBE scheme not only optimizes the time requirements for pairing operations, but also achieves a \"tighter\" security reduction based on a weaker hard problem ( the discrete logarithm problem) under a stronger security definition ( using an adaptively selected identity). Because there are many fewer pairing operations in this new scheme, the performance of the application can be improved to some degree. In addition, because of the \"tighter\" security reduction achieved by this new proposed scheme, a less restrictive security parameter can be chosen while achieving the same security as with Goyal's scheme along with an improvement in performance. In the respect of the time requirement, compared with the Goyal's universal scheme, this new scheme could be more efficient. Regrettably, these improvements will increase the memory needed for the public parameters and the volume of communications required. Compromise values of the public parameters should therefore be chosen to balance the advantages and drawbacks.", "paper_title": "A more efficient accountable authority IBE scheme under the DL assumption", "paper_id": "WOS:000276599800014"}