{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "adaptive_strategy"}, {"score": 0.0497377294589231, "phrase": "multiagent_semi-competitive_environments"}, {"score": 0.03277374817475705, "phrase": "expected_utility"}, {"score": 0.0036422425344358037, "phrase": "existing_models"}, {"score": 0.003378385493203297, "phrase": "trustworthy_senders"}, {"score": 0.0033303306367699816, "phrase": "high_reputation"}, {"score": 0.0032712190037495975, "phrase": "trustworthy_agent"}, {"score": 0.0029909851863915283, "phrase": "high_expected_utilities"}, {"score": 0.002734692147497601, "phrase": "also_agents'_attitudes"}], "paper_keywords": ["trust", " honesty", " adaptation", " rationality", " semi-competitive environment"], "paper_abstract": "In multiagent semi-competitive environments, competitions and cooperations can both exist. As agents compete with each other, they have incentives to lie. Sometimes, agents can increase their utilities by cooperating with each other, then they have incentives to tell the truth. Therefore, being a receiver, an agent needs to decide whether or not to trust the received message(s). To help agents make this decision, some of the existing models make use of trust or reputation only, which means agents choose to believe (or cooperate with) the trustworthy senders or senders with high reputation. However, a trustworthy agent may only bring little benefit. Another way to make the decision is to use expected utility. However, agents who only believe messages with high expected utilities can be cheated easily. To solve the problems, this paper introduces the Trust Model, which makes use of trust, expected utility, and also agents' attitudes towards risk to make decisions. On the other hand, being a sender, an agent needs to decide whether or not to be honest. To help agents make this decision, this paper introduces the Honesty Model, which is symmetric to the Trust Model. In addition, we introduce an adaptive strategy to the Trust/Honesty Model, which enables agents to learn from and adapt to the environment. Simulations show that agents with the Adaptive Trust/Honesty Model perform much better than agents which only use trust or expected utility to make the decision", "paper_title": "A Trust/Honesty Model with adaptive strategy for multiagent semi-competitive environments", "paper_id": "WOS:000236615100002"}