{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "external_links"}, {"score": 0.008291671003062702, "phrase": "youtube"}, {"score": 0.006711982962588035, "phrase": "video_sharing_sites"}, {"score": 0.0066122096006719314, "phrase": "youku"}, {"score": 0.004422094335127632, "phrase": "external_web_sites"}, {"score": 0.00428314621261913, "phrase": "embedded_urls"}, {"score": 0.0041485458333515, "phrase": "url_links"}, {"score": 0.003864326375679274, "phrase": "associated_advertisement"}, {"score": 0.0035995085881892464, "phrase": "comprehensive_measurement_study"}, {"score": 0.003329080106695777, "phrase": "china"}, {"score": 0.003233144995914417, "phrase": "higher_impact"}, {"score": 0.0028172167834968477, "phrase": "comedy_videos"}, {"score": 0.00265208877121581, "phrase": "internal_links"}, {"score": 0.002426630714074822, "phrase": "large_number"}, {"score": 0.0021275693314553143, "phrase": "regional_site"}, {"score": 0.0021049977753042253, "phrase": "worldwide_site"}], "paper_keywords": ["Video sharing", " YouTube", " Youku", " External links"], "paper_abstract": "Recently, many video sharing sites provide external links so that their video or audio contents can be embedded into external web sites. For example, users can copy the embedded URLs of the videos of YouTube and post the URL links on their own blogs. Clearly, the purpose of such function is to increase the distribution of the videos and the associated advertisement. Does this function fulfill its purpose and what is the quantification? In this paper, we provide a comprehensive measurement study and analysis on these external links to answer these two questions. With the traces collected from two major video sharing sites, YouTube and Youku of China, we show that the external links have various impacts on the popularity of the video sharing sites. More specifically, for videos that have been uploaded for eight months in Youku, around 15% of views can come from external links. Some contents are densely linked. For example, comedy videos can attract more than 800 external links on average. We also study the relationship between the external links and the internal links. We show that there are correlations; for example, if a video is popular itself, it is likely to have a large number of external links. Another observation we find is that the external links usually have a higher impact on Youku than that of YouTube. We conjecture that it is more likely that the external links have higher impact for a regional site than a worldwide site.", "paper_title": "Understanding the External Links of Video Sharing Sites: Measurement and Analysis", "paper_id": "WOS:000312646600018"}