{"auto_keywords": [{"score": 0.049584128839210984, "phrase": "optimal_transport_distances"}, {"score": 0.00481495049065317, "phrase": "ground_metric_learning"}, {"score": 0.004594951819987416, "phrase": "machine_learning"}, {"score": 0.003911010373894104, "phrase": "parameterized_distances"}, {"score": 0.00339853518227171, "phrase": "ground_metric_parameter"}, {"score": 0.0032940691998512963, "phrase": "priori_knowledge"}, {"score": 0.0028325548627901004, "phrase": "ground_metric"}, {"score": 0.0027311809666295565, "phrase": "labeled_histograms"}, {"score": 0.00234834406550549, "phrase": "convex_set"}, {"score": 0.002324007171619245, "phrase": "metric_matrices"}, {"score": 0.0022175679453857473, "phrase": "promising_experimental_results"}], "paper_keywords": ["optimal transport distance", " earth mover's distance", " metric learning", " metric nearness"], "paper_abstract": "Optimal transport distances have been used for more than a decade in machine learning to compare histograms of features. They have one parameter: the ground metric, which can be any metric between the features themselves. As is the case for all parameterized distances, optimal transport distances can only prove useful in practice when this parameter is carefully chosen. To date, the only option available to practitioners to set the ground metric parameter was to rely on a priori knowledge of the features, which limited considerably the scope of application of optimal transport distances. We propose to lift this limitation and consider instead algorithms that can learn the ground metric using only a training set of labeled histograms. We call this approach ground metric learning. We formulate the problem of learning the ground metric as the minimization of the difference of two convex polyhedral functions over a convex set of metric matrices. We follow the presentation of our algorithms with promising experimental results which show that this approach is useful both for retrieval and binary/multiclass classification tasks.", "paper_title": "Ground Metric Learning", "paper_id": "WOS:000335457700006"}