{"auto_keywords": [{"score": 0.04795131815886709, "phrase": "electronic_documentation_system"}, {"score": 0.030884052977847028, "phrase": "nursing_documentation"}, {"score": 0.012421384716028864, "phrase": "caregivers'_perceptions"}, {"score": 0.007335110090874403, "phrase": "nursing_home"}, {"score": 0.004446958354683721, "phrase": "nursing_home_caregivers'_perceptions"}, {"score": 0.004310173770196077, "phrase": "paper_and_electronic_formats"}, {"score": 0.0042614794708537235, "phrase": "increased_interest"}, {"score": 0.004201381218977942, "phrase": "information_technology"}, {"score": 0.004177578905812264, "phrase": "nursing_homes"}, {"score": 0.004037558883777281, "phrase": "newer_approaches"}, {"score": 0.0039022135263746737, "phrase": "service_decisions"}, {"score": 0.0038690893441754737, "phrase": "aged_care_sector"}, {"score": 0.0035327299348774342, "phrase": "self-administered_questionnaire_survey"}, {"score": 0.0032997289721682505, "phrase": "informal_discussions"}, {"score": 0.0032255172568437965, "phrase": "questionnaire_responses"}, {"score": 0.002970177327299509, "phrase": "data_entry"}, {"score": 0.0029449414017272656, "phrase": "consequential_managerial_benefits"}, {"score": 0.0027349952762847607, "phrase": "paper-based_documentation_system"}, {"score": 0.002532761069408219, "phrase": "electronic_system"}, {"score": 0.002385839330752606, "phrase": "paper-based_system"}, {"score": 0.002345445530251524, "phrase": "subsequent_benefits"}, {"score": 0.0023188961045301367, "phrase": "aged_care_services"}, {"score": 0.0022731540640627307, "phrase": "additional_benefits"}, {"score": 0.0021719531308160354, "phrase": "similar_perceptions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Benefits", " Electronic documentation", " Evaluation", " Information quality", " Nursing documentation", " Nursing information system", " Nursing home", " Residential aged care", " Long term care"], "paper_abstract": "Purpose: To date few studies have compared nursing home caregivers' perceptions about the quality of information and benefits of nursing documentation in paper and electronic formats. With the increased interest in the use of information technology in nursing homes, it is important to obtain information on the benefits of newer approaches to nursing documentation so as to inform investment, organisational and care service decisions in the aged care sector. This study aims to investigate caregivers' perceptions about the quality of information and benefits of nursing documentation before and after the introduction of an electronic documentation system in a nursing home. Methods: A self-administered questionnaire survey was conducted three months before, and then six, 18 and 31 months after the introduction of an electronic documentation system. Further evidence was obtained through informal discussions with caregivers. Results: Scores for questionnaire responses showed that the benefits of the electronic documentation system were perceived by the caregivers as provision of more accurate, legible and complete information, and reduction of repetition in data entry, with consequential managerial benefits. However, caregivers' perceptions of relevance and reliability of information, and of their communication and decision-making abilities were perceived to be similar either using an electronic or a paper-based documentation system. Improvement in some perceptions about the quality of information and benefits of nursing documentation was evident in the measurement conducted six months after the introduction of the electronic system, but were not maintained 18 or 31 months later. Conclusions: The electronic documentation system was perceived to perform better than the paper-based system in some aspects, with subsequent benefits to management of aged care services. In other areas, perceptions of additional benefits from the electronic documentation system were not maintained. In a number of attributes, there were similar perceptions on the two types of systems. (c) 2010 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "The changes in caregivers' perceptions about the quality of information and benefits of nursing documentation associated with the introduction of an electronic documentation system in a nursing home", "paper_id": "WOS:000286460900011"}