{"auto_keywords": [{"score": 0.04037367688510611, "phrase": "induced_game"}, {"score": 0.01895671624073787, "phrase": "pure_nash_equilibria"}, {"score": 0.014175450293531127, "phrase": "anonymous_jobs"}, {"score": 0.010331896757137518, "phrase": "coordination_mechanism"}, {"score": 0.008796633508734348, "phrase": "approximation_ratio"}, {"score": 0.006287282958210337, "phrase": "potential_game"}, {"score": 0.00481495049065317, "phrase": "efficient_coordination_mechanisms_for_unrelated_machine_scheduling"}, {"score": 0.004739874550843914, "phrase": "n_selfish_jobs"}, {"score": 0.00450130420152996, "phrase": "local_scheduling_policy"}, {"score": 0.004441059405327222, "phrase": "scheduling_policies"}, {"score": 0.0037188360359702182, "phrase": "scheduling_policy"}, {"score": 0.0036443694410100507, "phrase": "uninterrupted_way"}, {"score": 0.0036036430144404208, "phrase": "idle_time"}, {"score": 0.003308589731765616, "phrase": "azar"}, {"score": 0.003293761445175862, "phrase": "jain"}, {"score": 0.0032716024039801594, "phrase": "mirrokni"}, {"score": 0.003198860258228543, "phrase": "global_ordering"}, {"score": 0.003113696267229798, "phrase": "intriguing_scenario"}, {"score": 0.0029969024923853275, "phrase": "coordination_mechanisms"}, {"score": 0.00294346227267869, "phrase": "different_load_characteristics"}, {"score": 0.0027637946105894197, "phrase": "potential_function_arguments"}, {"score": 0.002708399936381754, "phrase": "known_lower_bounds"}, {"score": 0.0026962411675196213, "phrase": "non-preemptive_coordination_mechanisms"}, {"score": 0.002666081878235023, "phrase": "preemptive_scheduling_policies"}, {"score": 0.0026126405272417783, "phrase": "nice_\"cost-revealing\"_potential_function"}, {"score": 0.0021049977753042253, "phrase": "approximation_ratios"}], "paper_keywords": ["Algorithmic game theory", " Price of anarchy", " Coordination mechanisms", " Scheduling", " Unrelated machines"], "paper_abstract": "We present three new coordination mechanisms for scheduling n selfish jobs on m unrelated machines. A coordination mechanism aims to mitigate the impact of selfishness of jobs on the efficiency of schedules by defining a local scheduling policy on each machine. The scheduling policies induce a game among the jobs and each job prefers to be scheduled on a machine so that its completion time is minimum given the assignments of the other jobs. We consider the maximum completion time among all jobs as the measure of the efficiency of schedules. The approximation ratio of a coordination mechanism quantifies the efficiency of pure Nash equilibria (price of anarchy) of the induced game. Our mechanisms are deterministic, local, and preemptive in the sense that the scheduling policy does not necessarily process the jobs in an uninterrupted way and may introduce some idle time. Our first coordination mechanism has approximation ratio I similar to(logm) and always guarantees that the induced game has pure Nash equilibria to which the system converges in at most n rounds. This result improves a bound of O(log(2) m) due to Azar, Jain, and Mirrokni and, similarly to their mechanism, our mechanism uses a global ordering of the jobs according to their distinct IDs. Next we study the intriguing scenario where jobs are anonymous, i.e., they have no IDs. In this case, coordination mechanisms can only distinguish between jobs that have different load characteristics. Our second mechanism handles anonymous jobs and has approximation ratio although the game induced is not a potential game and, hence, the existence of pure Nash equilibria is not guaranteed by potential function arguments. However, it provides evidence that the known lower bounds for non-preemptive coordination mechanisms could be beaten using preemptive scheduling policies. Our third coordination mechanism also handles anonymous jobs and has a nice \"cost-revealing\" potential function. We use this potential function in order, not only to prove the existence of equilibria, but also to upper-bound the price of stability of the induced game by O(logm) and the price of anarchy by O(log(2) m). Our third coordination mechanism is the first that handles anonymous jobs and simultaneously guarantees that the induced game is a potential game and has bounded price of anarchy. In order to obtain the above bounds, our coordination mechanisms use m as a parameter. Slight variations of these mechanisms in which this information is not necessary achieve approximation ratios of O(m (I mu) ), for any constant I mu > 0.", "paper_title": "Efficient Coordination Mechanisms for Unrelated Machine Scheduling", "paper_id": "WOS:000317973900002"}