{"auto_keywords": [{"score": 0.04807918983567194, "phrase": "many-core_processors"}, {"score": 0.00481495049065317, "phrase": "lifetime_reliability"}, {"score": 0.004468684611798047, "phrase": "single-core_processors"}, {"score": 0.0043511221096418475, "phrase": "high_performance"}, {"score": 0.003459191419478298, "phrase": "specific_area_constraint"}, {"score": 0.002900426826591769, "phrase": "first-class_constraints"}, {"score": 0.0027791193706247267, "phrase": "novel_performance_model"}, {"score": 0.0027349450784503273, "phrase": "practical_program_style"}, {"score": 0.0026914710445743693, "phrase": "pipelined_and_parallel_program_styles"}, {"score": 0.0026205405415623525, "phrase": "intercore_communication"}, {"score": 0.0025514745448798385, "phrase": "new_metric_combing_performance"}, {"score": 0.002405853977978678, "phrase": "core_granularity"}, {"score": 0.002196944917134202, "phrase": "optimal_result"}], "paper_keywords": ["Granularity", " lifetime reliability", " many-core system", " metric", " performance", " yield"], "paper_abstract": "Network-on-chip based many-core processors break the limitations faced with single-core processors, and can bring high performance, improved yield, and high reliability. They are widely considered as the most promising platform. One of the most important questions is: what kind of granularity of cores (in other words, the number of cores and the area of each core under specific area constraint of the chip) is the best for many-core processors? Performance is widely used as the most important metric to determine the choice, but recently, reliability and yield are also becoming the first-class constraints in many application domains. This paper presents a novel performance model by considering practical program style, including pipelined and parallel program styles, as well as intercore communication, and proposes a new metric combing performance, reliability, and yield of many-core processors to choose the core granularity. According to our paper, with a given area (300 mm(2)) and certain applications, the optimal result is obtained using 8x8 mesh when all three factors are considered.", "paper_title": "Many-Core Processors Granularity Evaluation by Considering Performance, Yield, and Lifetime Reliability", "paper_id": "WOS:000364208500007"}