{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ultrasound_datasets"}, {"score": 0.041148614087474424, "phrase": "speckle_noises"}, {"score": 0.009830669358729362, "phrase": "min-max_values"}, {"score": 0.004518442937844318, "phrase": "volume_ray_casting_method"}, {"score": 0.004330941610682453, "phrase": "empty_space"}, {"score": 0.004151188559520802, "phrase": "adequate_noise-detection_methods"}, {"score": 0.0037868092509097404, "phrase": "space-leaping_and_noise-filtering_methods"}, {"score": 0.0034543031591181546, "phrase": "preprocessing_time"}, {"score": 0.0033579708256295847, "phrase": "filtered_datasets"}, {"score": 0.003150900886669123, "phrase": "filtering_operation"}, {"score": 0.0030414140732789186, "phrase": "hierarchical_sigma-ctree"}, {"score": 0.002677744558540711, "phrase": "rendering_step"}, {"score": 0.002196342933346204, "phrase": "rendering_time"}], "paper_keywords": [""], "paper_abstract": "There are two important factors to visualize ultrasound datasets using volume ray casting method. Firstly, efficient methods to skip over empty space are required. Secondly, adequate noise-detection methods are necessary because ultrasound datasets contain lots of speckle noises. In general, space-leaping and noise-filtering methods are exploited to solve the problems. However, it increases the preprocessing time to generate the filtered datasets, and interesting (meaningful) objects could be affected by a filtering operation. We propose a hierarchical sigma-ctree containing min-max values and standard deviation for each block, named a hierarchical sigma-octree. In rendering step, our method refers to min-max values of a block. If the block is regarded as nontransparent, it also checks its standard deviation value to detect speckle noises. Our method reduces rendering time compared with the method using only the min-max values because most blocks containing speckle noises are considered as transparent.", "paper_title": "Hierarchical sigma-octree for visualization of ultrasound datasets", "paper_id": "WOS:000241106000129"}