{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "motor_skills"}, {"score": 0.004640079189342692, "phrase": "growing_awareness"}, {"score": 0.0044991925146184025, "phrase": "machine-mediated_neurorehabilitation"}, {"score": 0.004152502093643003, "phrase": "laboratory_demonstrators"}, {"score": 0.0037159680715717056, "phrase": "significant_additional_effort"}, {"score": 0.0033873366086549735, "phrase": "proposed_solution"}, {"score": 0.003145417398038261, "phrase": "validated_clinical_measures"}, {"score": 0.0025972447844047515, "phrase": "good_reason"}, {"score": 0.0025338369486914364, "phrase": "clinical_and_mechanical_assessments"}, {"score": 0.0021049977753042253, "phrase": "assessment_process"}], "paper_keywords": ["Outcome assessment", " Rehabilitation", " Robotics", " Stroke", " Machine mediated neurorehabilitation", " Mechanical impedance"], "paper_abstract": "A growing awareness of the potential for machine-mediated neurorehabilitation has led to several novel concepts for delivering these therapies. To get from laboratory demonstrators and prototypes to the point where the concepts can be used by clinicians in practice still requires significant additional effort, not least in the requirement to assess and measure the impact of any proposed solution. To be widely accepted a study is required to use validated clinical measures but these tend to be subjective, costly to administer and may be insensitive to the effect of the treatment. Although this situation will not change, there is good reason to consider both clinical and mechanical assessments of recovery. This article outlines the problems in measuring the impact of an intervention and explores the concept of providing more mechanical assessment techniques and ultimately the possibility of combining the assessment process with aspects of the intervention.", "paper_title": "Assessing the effectiveness of robot facilitated neurorehabilitation for relearning motor skills following a stroke", "paper_id": "WOS:000296694200002"}