{"auto_keywords": [{"score": 0.036158860725450846, "phrase": "ndm_websites"}, {"score": 0.00930611155076099, "phrase": "importance_ratings"}, {"score": 0.009222839155170618, "phrase": "web_elements"}, {"score": 0.00481495049065317, "phrase": "natural_disaster_management_websites"}, {"score": 0.004499647408293102, "phrase": "severe_natural_disasters"}, {"score": 0.004439097815805505, "phrase": "heavy_losses"}, {"score": 0.004167089160666261, "phrase": "ndm"}, {"score": 0.004074016501033133, "phrase": "important_role"}, {"score": 0.003525493807130663, "phrase": "ontology-based_evaluation_tool"}, {"score": 0.003220709449062307, "phrase": "potential_users"}, {"score": 0.002955533639862811, "phrase": "ndm_web_elements"}, {"score": 0.002915701586760994, "phrase": "delphi_study"}, {"score": 0.002687702958515561, "phrase": "second_major_group"}, {"score": 0.002488724764295623, "phrase": "design_theory"}, {"score": 0.0024111277643627154, "phrase": "utility_theory"}, {"score": 0.0023044434462692483, "phrase": "relative_utility"}, {"score": 0.0022836785412390544, "phrase": "absolute_utility"}, {"score": 0.0022427071130840647, "phrase": "evaluation_tool"}], "paper_keywords": ["Ontology", " utility theory", " natural disaster management", " Delphi method", " website evaluation", " web elements", " analytic hierarchy process"], "paper_abstract": "In recent years, the world has witnessed a number of severe natural disasters, causing heavy losses to families, communities, and even nations. Natural disaster management (NDM) websites play an important role in assisting people through various disaster stages. However, such websites are complex and there is little research on standards and guidelines for their development and evaluation. In this paper, we develop an ontology-based evaluation tool to assess the utility of NDM websites. Two main groups of stakeholders-experts who are in charge of NDM websites and potential users of such websites-contributed to the process. A total of 73 experts validated the ontology developed for NDM web elements through a Delphi study. These experts also provided importance ratings for web elements in the ontology. In a survey of the second major group of stakeholders-potential users-818 participants provided another set of importance ratings for web elements in the ontology. The design theory in this work is based on utility theory. The metrics for the evaluation of websites are relative utility and absolute utility. Using the evaluation tool, we evaluated the NDM websites of the 50 U.S. states from the perspectives of the two groups of stakeholders. The results indicate a lack of readiness in most of these websites.", "paper_title": "ONTOLOGY-BASED EVALUATION OF NATURAL DISASTER MANAGEMENT WEBSITES: A MULTISTAKEHOLDER PERSPECTIVE", "paper_id": "WOS:000348600300004"}