{"auto_keywords": [{"score": 0.04754047218347395, "phrase": "hard_learning_problem"}, {"score": 0.046427635794678755, "phrase": "finite_state_machines"}, {"score": 0.004816293322450458, "phrase": "markov"}, {"score": 0.004515004397496303, "phrase": "typical_techniques"}, {"score": 0.00393066798511457, "phrase": "grammatical_inference_techniques"}, {"score": 0.003507504253087326, "phrase": "first_grammatical_inference_challenge"}, {"score": 0.0030081030319492343, "phrase": "artificial_data"}, {"score": 0.0029784342137867776, "phrase": "real_data"}, {"score": 0.002618278365749875, "phrase": "technical_and_intrinsic_challenges"}, {"score": 0.0024793019587009035, "phrase": "broad_state"}, {"score": 0.0023828731731474306, "phrase": "learning_grammars"}, {"score": 0.0023245146355917626, "phrase": "relevant_literature"}, {"score": 0.0021793698531006197, "phrase": "brief_description"}, {"score": 0.0021259846592569386, "phrase": "different_approaches"}, {"score": 0.0021049977753042253, "phrase": "main_participants"}], "paper_keywords": ["Grammatical inference", " Probabilistic automata", " Hidden Markov models", " Programming competition"], "paper_abstract": "Approximating distributions over strings is a hard learning problem. Typical techniques involve using finite state machines as models and attempting to learn these; these machines can either be hand built and then have their weights estimated, or built by grammatical inference techniques: the structure and the weights are then learned simultaneously. The Probabilistic Automata learning Competition (PAUTOMAC), run in 2012, was the first grammatical inference challenge that allowed the comparison between these methods and algorithms. Its main goal was to provide an overview of the state-of-the-art techniques for this hard learning problem. Both artificial data and real data were presented and contestants were to try to estimate the probabilities of strings. The purpose of this paper is to describe some of the technical and intrinsic challenges such a competition has to face, to give a broad state of the art concerning both the problems dealing with learning grammars and finite state machines and the relevant literature. This paper also provides the results of the competition and a brief description and analysis of the different approaches the main participants used.", "paper_title": "PAUTOMAC: a probabilistic automata and hidden Markov models learning competition", "paper_id": "WOS:000338201200006"}