{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "eduware"}, {"score": 0.009705632288944874, "phrase": "knowledge_services"}, {"score": 0.0047804843375940835, "phrase": "purpose_-_this_paper"}, {"score": 0.004695389394526107, "phrase": "knowledge_outsourcing"}, {"score": 0.0046118021635786315, "phrase": "external_knowledge_providers"}, {"score": 0.004497262692458022, "phrase": "internal_experts"}, {"score": 0.0041703614123283165, "phrase": "knowledge_management"}, {"score": 0.004140494437314318, "phrase": "km"}, {"score": 0.004037629764038173, "phrase": "ko"}, {"score": 0.0038671299350540554, "phrase": "case_study_approach"}, {"score": 0.0036640806940633373, "phrase": "e-learning_courseware"}, {"score": 0.003598786417573615, "phrase": "semi-structured_interviews"}, {"score": 0.0034967186553667715, "phrase": "archival_data"}, {"score": 0.0034220655476652683, "phrase": "triangulation_purposes"}, {"score": 0.003313053707792957, "phrase": "case_data"}, {"score": 0.00326572165784246, "phrase": "ko_relationships"}, {"score": 0.0030941521409613417, "phrase": "product-related_and_process-related_ones"}, {"score": 0.0028792911886505526, "phrase": "in-house_expertise"}, {"score": 0.0028076592725295646, "phrase": "suitable_external_kp"}, {"score": 0.002669683153809812, "phrase": "general_process_model"}, {"score": 0.0023451553255837317, "phrase": "fast-growing_knowledge_services_industry"}, {"score": 0.0021049977753042253, "phrase": "research_gap"}], "paper_keywords": ["Knowledge management", " Outsourcing", " Stakeholder analysis"], "paper_abstract": "Purpose - This paper introduces the notion of knowledge outsourcing (KO) where external knowledge providers (KP), rather than internal experts, are contracted to provide knowledge services. The purpose of this paper is to examine the role of KO in knowledge management (KM) and the circumstances under which KO is most likely to be successful. Design/methodology/approach - Using the case study approach, the fieldwork is done at Eduware, an organization that develops and markets e-learning courseware. Apart from conducting semi-structured interviews with diverse stakeholders in the organization, archival data from Eduware are collected for triangulation purposes. Findings - On the basis of the case data, two distinct types of KO relationships have been identified in Eduware. Furthermore, the risks of KO included both product-related and process-related ones. Three conditions under which KO are most likely to be successful were: first, a lack of in-house expertise; second, the availability of suitable external KP; and finally, a favourable business case. Research limitations/implications - A general process model of KO comprising the following steps is proposed: knowledge needs identification; knowledge sourcing; knowledge services negotiation; knowledge delivery; knowledge services monitoring; and knowledge utilization. Originality/value - The dawning of a fast-growing knowledge services industry raises new opportunities for organizations to support their KM initiatives through KO. Hitherto, there have been few works that examine the role of KO. This paper therefore serves to fill this research gap.", "paper_title": "An analysis of knowledge outsourcing at Eduware", "paper_id": "WOS:000271216200001"}