{"auto_keywords": [{"score": 0.048339607507904336, "phrase": "treatment_fidelity"}, {"score": 0.015719716506582538, "phrase": "weight_loss"}, {"score": 0.008295936005399034, "phrase": "mhealth_interventions"}, {"score": 0.004362564831572539, "phrase": "healthy_behaviors"}, {"score": 0.0035808664384880213, "phrase": "valid_interpretation"}, {"score": 0.0034935290662899488, "phrase": "intervention_studies"}, {"score": 0.0034294219963679857, "phrase": "treatment_fidelity_assessments"}, {"score": 0.0030497740719977835, "phrase": "treatment_fidelity_recommendations"}, {"score": 0.0030123335878664064, "phrase": "mhealth-based_behavioral_interventions"}, {"score": 0.002678734566245688, "phrase": "study_design"}, {"score": 0.0025812459787060097, "phrase": "treatment_delivery"}, {"score": 0.0024416087858984644, "phrase": "treatment_skills"}, {"score": 0.0024116163689723333, "phrase": "pre-planned_strategies"}, {"score": 0.002239225269052105, "phrase": "valid_conclusions"}, {"score": 0.0021049977753042253, "phrase": "robustly_efficacious_mobile_health_programs"}], "paper_keywords": [""], "paper_abstract": "mHealth interventions have shown promise for helping people sustain healthy behaviors such as weight loss. However, few have assessed treatment fidelity, that is, the accurate delivery, receipt, and enactment of the intervention. Treatment fidelity is critical because the valid interpretation and translation of intervention studies depend on treatment fidelity assessments. We describe strategies used to assess treatment fidelity in mobile health (mHealth) interventions aimed at sustaining healthy behaviors in weight loss. We reviewed treatment fidelity recommendations for mHealth-based behavioral interventions and described how these recommendations were applied in three recent weight loss studies. We illustrate how treatment fidelity can be supported during study design, training of providers, treatment delivery, receipt of treatment, and enactment of treatment skills. Pre-planned strategies to ensure the treatment fidelity of mHealth interventions will help counter doubts concerning valid conclusions about their effectiveness and allow investigators and clinicians to implement robustly efficacious mobile health programs.", "paper_title": "mHealth interventions for weight loss: a guide for achieving treatment fidelity", "paper_id": "WOS:000343776700004"}