{"auto_keywords": [{"score": 0.0453665111651286, "phrase": "protocol-handling_layer"}, {"score": 0.0076637419993658374, "phrase": "network_application"}, {"score": 0.005453836235382353, "phrase": "data_structures"}, {"score": 0.005090479845643557, "phrase": "abnf"}, {"score": 0.00481495049065317, "phrase": "network_protocol_message_processing"}, {"score": 0.004440583621077888, "phrase": "zebu"}, {"score": 0.004242291530697285, "phrase": "protocol_messages"}, {"score": 0.004158290806404304, "phrase": "critical_component"}, {"score": 0.003737485125097945, "phrase": "large_number"}, {"score": 0.003438483411236772, "phrase": "development_process"}, {"score": 0.0033256684464109242, "phrase": "high_level"}, {"score": 0.0032380786944838204, "phrase": "protocol_specification"}, {"score": 0.003195149953590668, "phrase": "high-level_formalism"}, {"score": 0.0031422859551159506, "phrase": "low-level_code"}, {"score": 0.003111080641830095, "phrase": "c."}, {"score": 0.0030595112110658675, "phrase": "abstraction_levels"}, {"score": 0.0029689853349030007, "phrase": "new_language-based_approach"}, {"score": 0.0029394074636168435, "phrase": "protocol-handling_layers"}, {"score": 0.002777264648691937, "phrase": "domain-specific_language"}, {"score": 0.0026593184154220123, "phrase": "textual_http-like_application_protocols"}, {"score": 0.0024958641143547856, "phrase": "domain_experts"}, {"score": 0.0024545413637350765, "phrase": "original_abnf_specification"}, {"score": 0.002405853977978678, "phrase": "zebu_user"}, {"score": 0.0023036445575469046, "phrase": "zebu_compiler"}, {"score": 0.0022730758011263318, "phrase": "annotated_specification"}], "paper_keywords": ["Network protocols", " message parsing", " message composing", " domain-specific languages"], "paper_abstract": "A network application communicates with other applications according to a set of rules known as a protocol. This communication is managed by the part of the application known as the protocol-handling layer, which enables the manipulation of protocol messages. The protocol-handling layer is a critical component of a network application since it represents the interface between the application and the outside world. It must thus satisfy two constraints: It must be efficient to be able to treat a large number of messages and it must be robust to face various attacks targeting the application itself or the underlying platform. Despite these constraints, the development process of this layer still remains rudimentary and requires a high level of expertise. It includes translating the protocol specification written in a high-level formalism such as ABNF toward low-level code such as C. The gap between these abstraction levels can entail many errors. This paper proposes a new language-based approach to developing protocol-handling layers, to improve their robustness without compromising their performance. Our approach is based on the use of a domain-specific language, Zebu, to specify the protocol-handling layer of network applications that use textual HTTP-like application protocols. The Zebu syntax is very close to that of ABNF, facilitating the adoption of Zebu by domain experts. By annotating the original ABNF specification of a protocol, the Zebu user can dedicate the protocol-handling layer to the needs of a given application. The Zebu compiler first checks the annotated specification for inconsistencies, and then generates a protocol-handling layer according to the annotations. This protocol-handling layer is made up of a set of data structures that represent a message, a parser that fills in these data structures, and various stub functions to access these data structures or drive the parsing of a message.", "paper_title": "Zebu: A Language-Based Approach for Network Protocol Message Processing", "paper_id": "WOS:000293456000008"}