{"auto_keywords": [{"score": 0.035345829434973365, "phrase": "ic_design_research"}, {"score": 0.00481495049065317, "phrase": "circuit_design_research"}, {"score": 0.0047676399834833275, "phrase": "worldwide_universities"}, {"score": 0.004689815048273592, "phrase": "integrated_circuits"}, {"score": 0.00459809245936039, "phrase": "present_technological_era"}, {"score": 0.004537938301016805, "phrase": "revolutionary_digital_modernization"}, {"score": 0.004276794599014972, "phrase": "practically_all_state-of-the-art_electronic_devices"}, {"score": 0.004057258742593542, "phrase": "ever-flourishing_ic_design_industry"}, {"score": 0.00390000531646629, "phrase": "huge_appetite"}, {"score": 0.0038743931383378558, "phrase": "technically_precocious_talents"}, {"score": 0.0035445922786327575, "phrase": "burgeoning_industry"}, {"score": 0.003521305923598047, "phrase": "higher_educational_institutions"}, {"score": 0.003296665348248805, "phrase": "strenuous_efforts"}, {"score": 0.003264224201388006, "phrase": "holistic_manner"}, {"score": 0.003147972261878234, "phrase": "outstanding_and_top-notch_research"}, {"score": 0.0031278655914259252, "phrase": "ic"}, {"score": 0.003045874333486276, "phrase": "detailed_and_extensive_survey"}, {"score": 0.002927705457700311, "phrase": "ic_design"}, {"score": 0.002704906579783511, "phrase": "large_number"}, {"score": 0.0025405829212597586, "phrase": "particular_field"}, {"score": 0.002175626278359828, "phrase": "top_echelons"}, {"score": 0.002125942645854997, "phrase": "proven_three-pronged_approach"}, {"score": 0.0021049977753042253, "phrase": "outstanding_research_performance"}], "paper_keywords": ["integrated circuit design", " ranking", " universities"], "paper_abstract": "The proliferation of integrated circuits (ICs) in the present technological era has brought forth revolutionary digital modernization that has ultimately transformed the history and lifestyle of humankind. ICs have become the heart of practically all state-of-the-art electronic devices such as computers, cell phones, video game consoles, and cameras. This ever-flourishing IC design industry is knowledge-intensive, which in turn translates into a huge appetite for technically precocious talents. Hence, in an effort to fuel and further foster the industry with more highly skilled manpower and at the same time to vie for a share of the burgeoning industry, higher educational institutions and universities from all around the globe are placing greater than ever emphasis on IC design research. Most importantly, strenuous efforts in a holistic manner are being made by each university in order to elicit outstanding and top-notch research in IC design. The authors have conducted a detailed and extensive survey to rank the various universities of the world in the field of IC design based on their research performance. In fact, assessments in the form of ranking have gained prominence over the recent years captivating the attention of a large number of students and universities. It helps the students in knowing how each university is progressing in a particular field and in turn helps the universities in analyzing their positions globally to remain competitive. Three ranking indicators, namely the Number of Publications, Citation Counts, and Cites per Paper have been chosen. The methodology used in ranking is also reported. The universities occupying the top echelons in IC design research are identified and a proven three-pronged approach for eliciting outstanding research performance is discussed.", "paper_title": "Integrated circuit design research ranking for worldwide universities", "paper_id": "WOS:000257387200010"}