{"auto_keywords": [{"score": 0.03731814047689121, "phrase": "random_oracles"}, {"score": 0.02898452830624613, "phrase": "ecdsa"}, {"score": 0.015483616547390732, "phrase": "random_oracle_model"}, {"score": 0.00481495049065317, "phrase": "roughly_two_decades"}, {"score": 0.0046937237797352515, "phrase": "reductionist_security_arguments"}, {"score": 0.003966388754366831, "phrase": "random_oracle_assumption"}, {"score": 0.003788296551609616, "phrase": "real-world_security_weakness"}, {"score": 0.003403122817578447, "phrase": "security_weaknesses"}, {"score": 0.0032836104153151973, "phrase": "original_ones"}, {"score": 0.002860546817196148, "phrase": "potentially_vulnerable_pseudorandom_bit_generators"}, {"score": 0.0027600360731762997, "phrase": "modified_version"}, {"score": 0.0025958582759972315, "phrase": "better_real-world_security"}, {"score": 0.002466510117718297, "phrase": "modified_schnorr_signature"}, {"score": 0.0023079225317714815, "phrase": "analogous_generic_group_model"}], "paper_keywords": ["Cryptography", " Public key", " Random oracle"], "paper_abstract": "It has been roughly two decades since the random oracle model for reductionist security arguments was introduced and one decade since we first discussed the controversy that had arisen concerning its use. In this retrospective we argue that there is no evidence that the need for the random oracle assumption in a proof indicates the presence of a real-world security weakness in the corresponding protocol. We give several examples of attempts to avoid random oracles that have led to protocols that have security weaknesses that were not present in the original ones whose proofs required random oracles. We also argue that the willingness to use random oracles gives one the flexibility to modify certain protocols so as to reduce dependence on potentially vulnerable pseudorandom bit generators. Finally, we discuss a modified version of ECDSA, which we call ECDSA, that may have better real-world security than standard ECDSA, and compare it with a modified Schnorr signature. If one is willing to use the random oracle model (and the analogous generic group model), then various security arguments are known for these two schemes. If one shuns these models, then no provable security result is known for them.", "paper_title": "The random oracle model: a twenty-year retrospective", "paper_id": "WOS:000361991900019"}