{"auto_keywords": [{"score": 0.041025976343579976, "phrase": "data_sets"}, {"score": 0.004638602678192715, "phrase": "vast_number"}, {"score": 0.00458940888106061, "phrase": "human_single_nucleotide_polymorphisms"}, {"score": 0.004421284843189731, "phrase": "gene_function"}, {"score": 0.00421410521089045, "phrase": "important_problem"}, {"score": 0.0035908627899097407, "phrase": "different_workers"}, {"score": 0.0035338315037521627, "phrase": "different_data_sets"}, {"score": 0.002794001681064862, "phrase": "best_approach"}, {"score": 0.0027643161113894018, "phrase": "future_studies"}, {"score": 0.0024842242921857705, "phrase": "amino_acid_substitutions"}, {"score": 0.002431699464104896, "phrase": "different_ways"}, {"score": 0.0022324489895237504, "phrase": "serious_pitfalls"}, {"score": 0.0021049977753042253, "phrase": "non-synonymous_snp_prediction"}], "paper_keywords": [""], "paper_abstract": "Motivation: To predict which of the vast number of human single nucleotide polymorphisms (SNPs) are deleterious to gene function or likely to be disease associated is an important problem, and many methods have been reported in the literature. All methods require data sets of mutations classified as 'deleterious' or 'neutral' for training and/or validation. While different workers have used different data sets there has been no study of which is best. Here, the three most commonly used data sets are analysed. We examine their contents and relate this to classifiers, with the aims of revealing the strengths and pitfalls of each data set, and recommending a best approach for future studies. Results: The data sets examined are shown to be substantially different in content, particularly with regard to amino acid substitutions, reflecting the different ways in which they are derived. This leads to differences in classifiers and reveals some serious pitfalls of some data sets, making them less than ideal for non-synonymous SNP prediction.", "paper_title": "Deleterious SNP prediction: be mindful of your training data!", "paper_id": "WOS:000245511800002"}