{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "facebook"}, {"score": 0.007616391608024952, "phrase": "facebook_use"}, {"score": 0.0047761092701293474, "phrase": "media_multitasking"}, {"score": 0.004661446705304497, "phrase": "college_and_university-aged_students"}, {"score": 0.0043512358455892, "phrase": "academic_performance"}, {"score": 0.004045157344249484, "phrase": "comprehensive_time-based_logs"}, {"score": 0.004012500850311087, "phrase": "students'_computer-based_tasks"}, {"score": 0.003453584878128719, "phrase": "particular_task"}, {"score": 0.003329804436286295, "phrase": "second_most_common_task"}, {"score": 0.003158776195052182, "phrase": "task_instances"}, {"score": 0.0028890603352364273, "phrase": "multitasking_behaviour"}, {"score": 0.0025578967205807843, "phrase": "facebook_users"}, {"score": 0.0022923586577645143, "phrase": "focused_behaviour"}, {"score": 0.0022101055924375725, "phrase": "key_contributor"}, {"score": 0.0021922308351126746, "phrase": "students'_task"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Post-secondary education", " Media in education", " Multitasking", " Human-computer interface", " Social media"], "paper_abstract": "Media multitasking and Facebook use are commonplace among college and university-aged students. While the two are often linked and each has been independently associated with reductions in academic performance, their relationship to each other is not particularly well understood. This relationship was examined by analysing comprehensive time-based logs of students' computer-based tasks, including Facebook, during unsupervised, self-directed learning sessions. A total of 3372 sessions contributed by 1249 students were analysed. Multitasking was extremely common - around 99% of sessions involved some multitasking (at least three instances of a particular task within a 20 min period). Facebook was the second most common task overall (University was first), accounting for 9.2% of all task instances and being present in 44% of sessions. Sessions containing Facebook typically contained more, shorter duration tasks and were significantly more likely to include multitasking behaviour. The introduction of Facebook within a session was associated with an increase in multitasking and a reduction in focused (no more than two tasks in a 20 min period) behaviour. Facebook users (students who contributed at least five sessions and used Facebook in at least one of these sessions) were also more likely to multitask and less likely to engage in focused behaviour. These results confirm that Facebook use is a key contributor to students' task switching and multitasking behaviours. (C) 2013 Elsevier Ltd. All rights reserved.", "paper_title": "Making sense of multitasking: The role of Facebook", "paper_id": "WOS:000326554100018"}