{"auto_keywords": [{"score": 0.044835251181568475, "phrase": "attribute_weights"}, {"score": 0.02322730111336098, "phrase": "correlation_coefficient"}, {"score": 0.02296534383316015, "phrase": "dual_hesitant_fuzzy_information"}, {"score": 0.009086817006272764, "phrase": "attribute_values"}, {"score": 0.00796011575737686, "phrase": "optimization_model"}, {"score": 0.005632091712552308, "phrase": "positive_ideal_alternative"}, {"score": 0.004518442937844318, "phrase": "multiple_attribute_decision_making_problems"}, {"score": 0.004001938457469328, "phrase": "dual_hesitant_fuzzy_values"}, {"score": 0.003777088546146369, "phrase": "weight_information"}, {"score": 0.003523822585025555, "phrase": "positive_ideal_point"}, {"score": 0.0032496585171039797, "phrase": "special_situations"}, {"score": 0.0028446460307503343, "phrase": "simple_and_exact_formula"}, {"score": 0.0022176487309947266, "phrase": "numerical_example"}, {"score": 0.0021668575137633317, "phrase": "pattern_recognition_problems"}, {"score": 0.0021049977753042253, "phrase": "metal_materials"}], "paper_keywords": ["Multiple attribute decision making", " dual hesitant fuzzy sets", " correlation coefficient", " incomplete weight", " metal materials"], "paper_abstract": "In this paper, we investigate the multiple attribute decision making problems with dual hesitant fuzzy information, in which the information about attribute weights is incompletely known, and the attribute values take the form of dual hesitant fuzzy values. We first introduce some approaches to obtaining the weight information of attributes, and then establish an optimization model based on the positive ideal point of attribute values, by which the attribute weights can be determined. For the special situations where the information about attribute weights is completely unknown, we establish another optimization model. By solving this model, we get a simple and exact formula, which can be used to determine the attribute weights. We compute the correlation coefficient between each alternative and positive ideal alternative, and then rank the alternatives by means of the correlation coefficient between each alternative and positive ideal alternative. Finally, we shall present a numerical example to show the pattern recognition problems about the classification of metal materials with dual hesitant fuzzy information in order to illustrate the method proposed in this paper.", "paper_title": "Approaches to multiple attribute decision making based on the correlation coefficient with dual hesitant fuzzy information", "paper_id": "WOS:000334211500041"}