{"auto_keywords": [{"score": 0.03597562753410283, "phrase": "first_player"}, {"score": 0.014713411124488004, "phrase": "dedicated_player"}, {"score": 0.010813666418150203, "phrase": "sufficient_conditions"}, {"score": 0.004769182299692333, "phrase": "collective_decision"}, {"score": 0.0047013405841819025, "phrase": "complex_systems"}, {"score": 0.004232331639807526, "phrase": "sequential_voting"}, {"score": 0.003902085339580381, "phrase": "control_strategy"}, {"score": 0.0035125292519354724, "phrase": "game-theory_formalization"}, {"score": 0.0032382660477699695, "phrase": "players'_preferences"}, {"score": 0.003131637033429892, "phrase": "required_order"}, {"score": 0.0029996699429582835, "phrase": "voting_procedure"}, {"score": 0.00290087451159631, "phrase": "worst_decision"}, {"score": 0.002739001004969201, "phrase": "last_preferences"}, {"score": 0.00263612191603326, "phrase": "explicit_form"}, {"score": 0.0025861368747446324, "phrase": "control_strategies"}, {"score": 0.0022294857939412073, "phrase": "third_preference"}], "paper_keywords": [""], "paper_abstract": "Collective decision making in complex systems using voting by veto is considered. A dedicated player is assumed to exist in the collective and be able to set sequential voting (the order of moves) for the players. The problem of searching for the control strategy for the order of moves so that to ensure the choice of the alternative of the dedicated player is stated. The game-theory formalization of the problem with the first player as the leader is proposed. Sufficient conditions are obtained for players' preferences for the game to have the required order of moves. These conditions show that the voting procedure involved does not result in the worst decision made for any player or the decision chosen out of the last preferences of the group of participants. The explicit form is found for control strategies for the order of moves for the cases of the sufficient conditions met when the partners of the first player have his alternative at the end of their preference list-it is no higher than the third preference from the end for everybody and may be one place higher for one player. We proved that when controlling the order of moves, the move of the first player is sufficient to be left first and that the order of moves can be formed beforehand, prior to voting. DOI: 10.1134/S1064230713010097", "paper_title": "Controlling the order of moves in voting by veto. I. Conditions for making the given decision", "paper_id": "WOS:000315092000004"}