{"auto_keywords": [{"score": 0.05007852962010534, "phrase": "roughness_measure"}, {"score": 0.007161603795486666, "phrase": "lower_and_upper_approximations"}, {"score": 0.006835123630459653, "phrase": "pawlak"}, {"score": 0.004765173195920904, "phrase": "rough_sets"}, {"score": 0.004691465925553365, "phrase": "pawlak's_rough_set_theory"}, {"score": 0.004362226376603478, "phrase": "numerically_the_roughness"}, {"score": 0.004184526032558792, "phrase": "quantitative_measure"}, {"score": 0.0035245918797629804, "phrase": "standard_ordering"}, {"score": 0.003015143226706584, "phrase": "axiomatic_way"}, {"score": 0.0029072537537959374, "phrase": "partition_measure"}, {"score": 0.0028325548627901004, "phrase": "unified_construction"}, {"score": 0.002512850690695835, "phrase": "improved_roughness-measures"}, {"score": 0.002448260697722081, "phrase": "special_instances"}, {"score": 0.0021049977753042253, "phrase": "relevant_axiomatic_definition"}], "paper_keywords": ["Accuracy measure", " approximation", " partition measure", " roughness measure", " rough set"], "paper_abstract": "In Pawlak's rough set theory, a set is approximated by a pair of lower and upper approximations. To measure numerically the roughness of an approximation, Pawlak introduced a quantitative measure of roughness by using the ratio of the cardinalities of the lower and upper approximations. Although the roughness measure is effective, it has the drawback of not being strictly monotonic with respect to the standard ordering on partitions. Recently, some improvements have been made by taking into account the granularity of partitions. In this paper, we approach the roughness measure in an axiomatic way. After axiomatically defining roughness measure and partition measure, we provide a unified construction of roughness measure, called strong Pawlak roughness measure, and then explore the properties of this measure. We show that the improved roughness-measures in the literature are special instances of our strong Pawlak roughness measure and introduce three more strong Pawlak roughness measures as well. The advantage of our axiomatic approach is that some properties of a roughness measure follow immediately as soon as the measure satisfies the relevant axiomatic definition.", "paper_title": "An Axiomatic Approach to the Roughness Measure of Rough Sets", "paper_id": "WOS:000294674000005"}