{"auto_keywords": [{"score": 0.04652122652620528, "phrase": "dataspace_support_platform"}, {"score": 0.041632877340808075, "phrase": "mediated_schema"}, {"score": 0.03945817458808681, "phrase": "reliable_mediated_schemas"}, {"score": 0.039133422014451316, "phrase": "reliable_semantic_mappings"}, {"score": 0.030376705300755227, "phrase": "semantic_mappings"}, {"score": 0.00481495049065317, "phrase": "mediated_schema_and_semantic_mappings_automatically_in_dataspace_support_platforms."}, {"score": 0.00440093312826378, "phrase": "self-sustained_system"}, {"score": 0.003920295222165263, "phrase": "schema_mappings"}, {"score": 0.0038207994186834015, "phrase": "novel_approach"}, {"score": 0.003692040748097991, "phrase": "dataspace_support_platforms"}, {"score": 0.003582928547553209, "phrase": "system's_endeavor_results"}, {"score": 0.00296698375549856, "phrase": "mediated_schemas"}, {"score": 0.002929056388593134, "phrase": "graph_representations"}, {"score": 0.0026998264237910884, "phrase": "reliability_degrees"}, {"score": 0.002553382046204689, "phrase": "higher_the_reliability_degree"}, {"score": 0.00249919111154604, "phrase": "semantic_mapping"}, {"score": 0.0023636038312749245, "phrase": "existing_systems"}, {"score": 0.0023434058350520763, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "semi-automatic_systems"}], "paper_keywords": ["Schema matching", " mediated schema", " semantic mappings", " reliability degrees", " dataspace"], "paper_abstract": "Contrary to existing heterogeneous data integration systems which need to be fully integrated before using, a Dataspace Support Platform is a self-sustained system which automatically provides for the user its best endeavor results regardless of how integrated its sources are. Therefore, a Dataspace Support Platform needs to support uncertainty in mediated schema and in schema mappings. This paper proposes a novel approach to automatically providing reliable mediated schemas and reliable semantic mappings in Dataspace Support Platforms. Our aim is to increase the system's endeavor results by leading it to considering as much as possible information available in any source connected. In fact, we first extract from the source schemas, their corresponding graph representations. Then, we introduce algorithms which automatically extract a set of mediated schemas from the graph representations and a set of semantic mappings between a source and a target mediated schema. Finally, we assign reliability degrees to the mediated schema generated and to the semantic mappings. Indeed, the higher the reliability degree of a given mediated schema or semantic mapping, the more consistent with the source it is. Compared with existing systems, experimental results show that our system is faster and, although completely automatic, it produces reliable mediated schemas and reliable semantic mappings which are as accurate as those produced by semi-automatic systems.", "paper_title": "MANAGING UNCERTAIN MEDIATED SCHEMA AND SEMANTIC MAPPINGS AUTOMATICALLY IN DATASPACE SUPPORT PLATFORMS", "paper_id": "WOS:000317083900008"}