{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "ddos_attacks"}, {"score": 0.011453710083284867, "phrase": "membership_information"}, {"score": 0.004774115617883476, "phrase": "internet_servers"}, {"score": 0.0037928847801943404, "phrase": "underlying_cause"}, {"score": 0.003760685138103153, "phrase": "attack_amplification"}, {"score": 0.0033517342967390065, "phrase": "innocent_participants"}, {"score": 0.0032950412841674026, "phrase": "validated_information"}, {"score": 0.0031440159350875057, "phrase": "multiple_references"}, {"score": 0.0029871209444889716, "phrase": "active_probing_approach"}, {"score": 0.0028139168128067343, "phrase": "centralized_authorities"}, {"score": 0.002790004829699627, "phrase": "membership_verification"}, {"score": 0.0023824468367751365, "phrase": "widely_deployed_dht-based_file-sharing_system"}, {"score": 0.0023024551893939403, "phrase": "stringent_performance_requirements"}, {"score": 0.002159623311924437, "phrase": "application_performance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["P2P", " DDoS", " Membership validation", " Experimental evaluation"], "paper_abstract": "Recently, there has been a spurt of work [1-7] showing that a variety of extensively deployed P2P systems may be exploited to launch DDoS attacks on web and other Internet servers, external to the P2P system. In this paper, we dissect these attacks and categorize them based on the underlying cause for attack amplification. We show that the attacks stem from a violation of three key principles: (i) membership information must be validated before use; (ii) innocent participants must only propagate validated information; and (iii) the system must protect against multiple references to the victim. We systematically explore the effectiveness of an active probing approach to validating membership information in thwarting such DDoS attacks. The approach does not rely on centralized authorities for membership verification, and is applicable to both structured (DHT-based) and unstructured P2P systems. We believe these considerations are important to ensure the mechanisms can be integrated with a range of existing P2P deployments. We evaluate the techniques in the context of a widely deployed DHT-based file-sharing system, and a video broadcasting system with stringent performance requirements. Our results show the promise of the approach in limiting DDoS attacks while not sacrificing application performance. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "Preventing DDoS attacks on internet servers exploiting P2P systems", "paper_id": "WOS:000283039900012"}