{"auto_keywords": [{"score": 0.049707223091654644, "phrase": "shape_graphs"}, {"score": 0.04138828611141582, "phrase": "nielson"}, {"score": 0.03868045255073682, "phrase": "alias_information"}, {"score": 0.00481495049065317, "phrase": "alias_sets"}, {"score": 0.004703671193348433, "phrase": "shape_analysis_precision"}, {"score": 0.004402088928254543, "phrase": "different_representations"}, {"score": 0.004367898947304223, "phrase": "analysis_results"}, {"score": 0.003885668358145471, "phrase": "hankin"}, {"score": 0.003443031148055198, "phrase": "pointer_expressions"}, {"score": 0.0033372020049592726, "phrase": "programme_point"}, {"score": 0.0030865992688177005, "phrase": "new_algorithm"}, {"score": 0.00300339527261653, "phrase": "'common_tails'_algorithm"}, {"score": 0.002854762582888805, "phrase": "sagiv"}, {"score": 0.0028325548627901004, "phrase": "wilhem"}, {"score": 0.002549096826249, "phrase": "conservative_results"}, {"score": 0.002385326947545194, "phrase": "original_rsw_algorithm"}, {"score": 0.0022939396079753463, "phrase": "analysis_run-time"}, {"score": 0.002223351523626989, "phrase": "nnh"}], "paper_keywords": [""], "paper_abstract": "Various shape analyses have been introduced, but their precision often cannot be compared because they use different representations of analysis results. The aim of the authors work was to compare the precision of two well-known graph-based shape analyses, those presented by Sagiv, Reps and Wilhem (SRW); and by Nielson, Nielson and Hankin (NNH). Rather than comparing the shape graphs directly, their comparison uses alias information extracted from the graphs: for every pair (e(1), e(2)) of pointer expressions in a programme, and for every programme point pt the authors determine the aliasing between e(1) and e(2). In their experiments, they use a new algorithm for extracting this alias information called the 'common tails' algorithm that is strictly more precise than the technique introduced by Reps, Sagiv and Wilhem (RSW). They present two interesting results: (i) they show that using their common tails algorithm, they are able to reduce the number of conservative results (strict may-aliases) by a factor of up to 5 (compared with the original RSW algorithm) while incurring an overhead of no more than 10% of analysis run-time. (ii) They show that NNH is more precise than SRW by a factor of 1.62 on average for their set of benchmarks.", "paper_title": "Computation of alias sets from shape graphs for comparison of shape analysis precision", "paper_id": "WOS:000337942600003"}