{"auto_keywords": [{"score": 0.0448395938122121, "phrase": "low-power_operating_modes"}, {"score": 0.03716412331153162, "phrase": "data_compression"}, {"score": 0.015719716506582538, "phrase": "banked_memories"}, {"score": 0.011641179505380947, "phrase": "data_migration"}, {"score": 0.01143447327012348, "phrase": "data_replication"}, {"score": 0.004780334370089564, "phrase": "main_memories"}, {"score": 0.004711843410316589, "phrase": "significant_portion"}, {"score": 0.004677965073019951, "phrase": "overall_energy"}, {"score": 0.004528488165249491, "phrase": "energy_consumption"}, {"score": 0.004399616575575586, "phrase": "available_memory_space"}, {"score": 0.004367973309172735, "phrase": "multiple_banks"}, {"score": 0.003991040678278726, "phrase": "energy_benefits"}, {"score": 0.003891430578662587, "phrase": "banked_memory_architecture"}, {"score": 0.0038218004095195183, "phrase": "different_techniques"}, {"score": 0.003581252556182843, "phrase": "nonuniform_bank_sizes"}, {"score": 0.0031331419276289306, "phrase": "low-power_modes"}, {"score": 0.003077038060542514, "phrase": "nonuniform_banking"}, {"score": 0.0030328769643087066, "phrase": "bank_sizes"}, {"score": 0.003011033940247791, "phrase": "application-data_access_patterns"}, {"score": 0.0028936710552719806, "phrase": "similar_access_patterns"}, {"score": 0.002634084319025334, "phrase": "memory_banks"}, {"score": 0.002549749054599413, "phrase": "bank_idleness"}, {"score": 0.00232935232323113, "phrase": "commercial_solver"}, {"score": 0.002198380879018061, "phrase": "memory_energy_consumption"}, {"score": 0.0021049977753042253, "phrase": "compiler_writers"}], "paper_keywords": ["experimentation", " management", " design", " performance", " memory banking", " compilers", " low-power operating modes", " data compression", " migration", " replication", " DRAM"], "paper_abstract": "Main memories can consume a significant portion of overall energy in many data-intensive embedded applications. One way of reducing this energy consumption is banking, that is, dividing available memory space into multiple banks and placing unused (idle) memory banks into low-power operating modes. Prior work investigated code-restructuring- and data-layout-reorganization-based approaches for increasing the energy benefits that could be obtained from a banked memory architecture. This article explores different techniques that can potentially coexist within the same optimization framework for maximizing benefits of low-power operating modes. These techniques include employing nonuniform bank sizes, data migration, data compression, and data replication. By using these techniques, we try to increase the chances for utilizing low-power operating modes in a more effective manner, and achieve further energy savings over what could be achieved by exploiting low-power modes alone. Specifically, nonuniform banking tries to match bank sizes with application-data access patterns. The goal of data migration is to cluster data with similar access patterns in the same set of banks. Data compression reduces the size of the data used by an application, and thus helps reduce the number of memory banks occupied by data. Finally, data replication increases bank idleness by duplicating select read-only data blocks across banks. We formulate each of these techniques as an ILP (integer linear programming) problem, and solve them using a commercial solver. Our experimental analysis using several benchmarks indicates that all the techniques presented in this framework are successful in reducing memory energy consumption. Based on our experience with these techniques, we recommend to compiler writers for banked memories to consider data compression, replication, and migration.", "paper_title": "ILP-based energy minimization techniques for banked memories", "paper_id": "WOS:000258205900014"}