{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "re-engineering_non-ontological_resources"}, {"score": 0.039565814199166376, "phrase": "non-ontological_resources"}, {"score": 0.004589763483242731, "phrase": "ontology_development_process"}, {"score": 0.004535124351828787, "phrase": "ontology_developers"}, {"score": 0.0041703614123283165, "phrase": "classification_schemes"}, {"score": 0.003611751858608048, "phrase": "storage_system"}, {"score": 0.0029991500396912923, "phrase": "so-called_re-engineering_patterns"}, {"score": 0.002841545331522694, "phrase": "non-ontological_resource_components"}, {"score": 0.002741128844415593, "phrase": "wordnet"}, {"score": 0.002612640527241776, "phrase": "non-ontological_resource_terms"}, {"score": 0.0021049977753042253, "phrase": "software_library"}], "paper_keywords": ["Non-Ontological Resources", " Ontologies", " Ontology Development", " Patterns", " Re-Engineering"], "paper_abstract": "To speed up the ontology development process, ontology developers are reusing all available ontological and non-ontological resources, such as classification schemes, thesauri, lexicons, and so forth, that have already reached some consensus. Non-ontological resources are highly heterogeneous in their data model and storage system (or implementation). The reuse of these non-ontological resources involves their re-engineering into ontologies. This paper presents a method for re-engineering non-ontological resources into ontologies. The method is based on so-called re-engineering patterns, which define a procedure that transforms the non-ontological resource components into ontology representational primitives using WordNet for making explicit the relations among the non-ontological resource terms. The paper also provides the description of NOR(2)O, a software library that implements the transformations suggested by the patterns. Finally, it depicts an evaluation of the method, patterns, and software library proposed.", "paper_title": "A Pattern-Based Method for Re-Engineering Non-Ontological Resources into Ontologies", "paper_id": "WOS:000286635000002"}