{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "automatic_event_reconstruction_systems"}, {"score": 0.014354522408900176, "phrase": "digital_investigation_process"}, {"score": 0.004661446705304497, "phrase": "computer_events"}, {"score": 0.004537254814246843, "phrase": "particular_event"}, {"score": 0.004464326432401002, "phrase": "essential_part"}, {"score": 0.004116823963855969, "phrase": "essential_step"}, {"score": 0.0038168424095396205, "phrase": "trojan_horse_defense"}, {"score": 0.0035965032173588753, "phrase": "empirical_study"}, {"score": 0.003158776195052182, "phrase": "false_positives"}, {"score": 0.003124790943886441, "phrase": "false_negatives"}, {"score": 0.002992456421856034, "phrase": "computational_burden"}, {"score": 0.0027295084882654917, "phrase": "priori_expectations"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["intrusion analysis", " digital forensics", " event reconstruction", " incident response"], "paper_abstract": "Reconstructing the sequence of computer events that led to a particular event is an essential part of the digital investigation process. The ability to quantify the accuracy of automatic event reconstruction systems is an essential step in standardizing the digital investigation process thereby making it resilient to tactics such as the Trojan horse defense. In this paper, we present findings from an empirical study to measure and compare the accuracy and effectiveness of a suite of such event reconstruction techniques. We quantify (as applicable) the rates of false positives and false negatives, and scalability in terms of both computational burden and memory-usage. Some of our findings are quite surprising in the sense of not matching a priori expectations, and whereas other findings qualitatively match the a priori expectations they were never before quantitatively put to the test to determine the boundaries of their applicability. For example, our results show that automatic event reconstruction systems proposed in literature have very high false-positive rates (up to 96%). (c) 2006 DFRWS. Published by Elsevier Ltd. All rights reserved.", "paper_title": "An empirical study of automatic event reconstruction systems", "paper_id": "WOS:000242355700015"}