{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "lined_reference_monitors"}, {"score": 0.004680624753255133, "phrase": "binary_software"}, {"score": 0.004627944735913613, "phrase": "security_violations"}, {"score": 0.004498812433096501, "phrase": "runtime_security_checks"}, {"score": 0.004132546937996706, "phrase": "in-lining_approach"}, {"score": 0.0026411384812121503, "phrase": "irm_preservation"}, {"score": 0.0026113524778702624, "phrase": "policy-compliant_behaviors"}, {"score": 0.0024257447861185813, "phrase": "transparency-checker_implementation"}, {"score": 0.002398382089724878, "phrase": "adobe_actionscript_bytecode"}, {"score": 0.0022919762167777427, "phrase": "security_policies"}, {"score": 0.0022661190184053628, "phrase": "adobe_flash_web_advertisements"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["In-lined reference monitors", " Verification", " Model-checking", " Symbolic interpretation", " ActionScript"], "paper_abstract": "In-lined Reference Monitors (IRMs) cure binary software of security violations by instrumenting them with runtime security checks. Although over a decade of research has firmly established the power and versatility of the in-lining approach to security, its widespread adoption by industry remains impeded by concerns that in-lining may corrupt or otherwise harm intended, safe behaviors of the software it protects. Practitioners with such concerns are unwilling to adopt the technology despite its security benefits for fear that some software may break in ways that are hard to diagnose. This paper shows how recent approaches for machine-verifying the policy-compliance (soundness) of IRMs can be extended to also formally verify IRM preservation of policy-compliant behaviors (transparency). Feasibility of the approach is demonstrated through a transparency-checker implementation for Adobe ActionScript bytecode. The framework is applied to enforce security policies for Adobe Flash web advertisements and automatically verify that their policy-compliant behaviors are preserved. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Hippocratic binary instrumentation: First do no harm", "paper_id": "WOS:000350618100003"}