{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "spatial_correlation"}, {"score": 0.004701825207431857, "phrase": "random_effects_model"}, {"score": 0.0045370785151713396, "phrase": "holly"}, {"score": 0.004352123742308589, "phrase": "baltagi_et_al"}, {"score": 0.0038640303886081444, "phrase": "joint_lm_test"}, {"score": 0.0031939996970411027, "phrase": "marginal_ones"}, {"score": 0.002903771635043968, "phrase": "monte_carlo"}, {"score": 0.0028185852354729026, "phrase": "lm_and_lr_tests"}, {"score": 0.0027358910467781155, "phrase": "small_n"}, {"score": 0.002414191082427217, "phrase": "misleading_inference"}, {"score": 0.0022610379771517966, "phrase": "lm_tests"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["Panel data", " Heteroskedasticity", " Spatial correlation", " LM tests", " Two way random effects model"], "paper_abstract": "An extension of the Holly and Gardiol (2000) and Baltagi et al. (2009) papers to the two way context, with heteroskedastic and spatially correlated disturbances is considered. One then derives a joint LM test for homoskedasticity and no spatial correlation. In addition, two conditional LM tests are also derived: for no spatial correlation given heteroskedasticity and for homoskedasticity given spatial correlation respectively. These tests are compared with marginal ones that ignore heteroskedasticity in testing for spatial correlation, or spatial correlation in testing for homoskedasticity. Monte Carlo results show that the LM and LR tests perform well even for small N and T whereas their Wald counterparts tend to oversize. An application on the demand for cigarettes is also conducted. The misleading inference can occur when using marginal rather than joint or conditional LM tests when spatial correlation or heteroskedasticity is present. (C) 2013 Elsevier B.V. All rights reserved.", "paper_title": "Testing for heteroskedasticity and spatial correlation in a two way random effects model", "paper_id": "WOS:000328306800012"}