{"auto_keywords": [{"score": 0.042619555492085175, "phrase": "sn_p_systems"}, {"score": 0.00481495049065317, "phrase": "small_universal_spiking_neural_p_system"}, {"score": 0.0047057084749407485, "phrase": "neural_p_systems"}, {"score": 0.004634254474150777, "phrase": "sn_p"}, {"score": 0.004511799033574768, "phrase": "distributed_and_parallel_neural-like_computing_devices"}, {"score": 0.004359078118356132, "phrase": "biological_neurons"}, {"score": 0.004179392391349015, "phrase": "p_systems"}, {"score": 0.004147523799581407, "phrase": "cooperating_rules"}, {"score": 0.0041001740903338834, "phrase": "new_variant"}, {"score": 0.0032585499655442404, "phrase": "terminating_mode"}, {"score": 0.002444544487772349, "phrase": "turing_universal_sn_p_system"}, {"score": 0.0023889533502525527, "phrase": "number_generator"}, {"score": 0.0022991862910382234, "phrase": "turing"}, {"score": 0.002290291401956985, "phrase": "universal_sn_p_system"}, {"score": 0.0022041312401435346, "phrase": "turing_computable_natural_numbers"}, {"score": 0.002129356014992349, "phrase": "open_problem"}], "paper_keywords": ["bio-inspired computing", " membrane computing", " spiking neural P system", " cooperating rule", " Turing universality"], "paper_abstract": "Spiking neural P systems (shortly called SN P systems) are a class of distributed and parallel neural-like computing devices, which are inspired by the way of biological neurons communicating with each other by means of impulses/spikes. SN P systems with cooperating rules are a new variant of SN P systems, where each neuron has the same number of components and some components of a neuron can be empty. In a step of a computation, one component from each neuron is used, with the same label in all neurons; from these components, one rule is applied, in the way usual in SN P systems. In the terminating mode, adopted in this paper, after choosing a component of the neurons, this component is applied until no rule from this component, in any neuron, is enabled (we switch from a component to another one, nondeterministically chosen, when no rule of the component can be used, in any neuron of the system). In this work, we investigate how many neurons are needed to construct a Turing universal SN P system with cooperating rules as a number generator in terminating mode. Specifically, we construct a Turing universal SN P system having 8 neurons, which can generate/compute any set of Turing computable natural numbers. This result gives an answer to an open problem formulated in [V.P. Metta, S. Raghuraman, K. Krithivasan, CMC15, 267-282, 2014].", "paper_title": "A Small Universal Spiking Neural P System with Cooperating Rules", "paper_id": "WOS:000350281600004"}