{"auto_keywords": [{"score": 0.048146825258889296, "phrase": "molecular_surface"}, {"score": 0.012960465200704003, "phrase": "worst_case"}, {"score": 0.012240095161697384, "phrase": "proposed_algorithm"}, {"score": 0.010085356809264572, "phrase": "contact_patch"}, {"score": 0.006121126172000216, "phrase": "blending_patch"}, {"score": 0.005939304367110442, "phrase": "triangular_mesh"}, {"score": 0.0056843789781094905, "phrase": "point_evaluations"}, {"score": 0.00481495049065317, "phrase": "molecular_surfaces"}, {"score": 0.004557735965224235, "phrase": "spherical_probe"}, {"score": 0.004520351823685038, "phrase": "solvent_molecule"}, {"score": 0.0041287394089001405, "phrase": "protein_docking"}, {"score": 0.003875962465099124, "phrase": "combinatorial_information"}, {"score": 0.00368894080968876, "phrase": "concise_representation"}, {"score": 0.003332272992969771, "phrase": "compact_masks"}, {"score": 0.0029934784017784204, "phrase": "atom_type"}, {"score": 0.0024556852466581527, "phrase": "worst_case_time_complexity"}, {"score": 0.002395626697083963, "phrase": "internal_voids"}, {"score": 0.0023499294490179788, "phrase": "produced_triangular_mesh"}, {"score": 0.0022179901564261975, "phrase": "proposed_scheme"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Molecular surface", " Blending surface", " Solvent contact surface", " Triangulation", " Mesh", " Watertightness", " Mask", " beta-shape", " Protein", " Level-of-detail"], "paper_abstract": "Given a molecule, which consists of a set of atoms, a molecular surface is defined for a spherical probe approximating a solvent molecule. Molecular surface is used for both the visualization of the molecule and the computation of various molecular properties such as the area and volume of a protein, which are important for studying problems such as protein docking and folding. In this paper, we present an O(n) time algorithm, in the worst case, for triangulating molecular surface based on the combinatorial information provided by the beta-shape of the molecule with n atoms. The proposed algorithm takes advantage of the concise representation of topology among atoms stored in the beta-shape. A molecular surface consists of two parts: a blending surface consisting of blending patches and a (solvent) contact surface consisting of (solvent) contact patches. For each blending patch, the algorithm uses compact masks for the construction of a triangular mesh in O(c') time in the worst case, where c is the number of point evaluations on the blending patch. For each contact patch, the algorithm uses a template, for each atom type, for the triangulation of the boundary of the atom. Then, the triangular mesh is trimmed off by hyperplanes where each hyperplane corresponds to an arc of the boundary of the contact patch. The triangulation of a contact patch takes O(c '') time in the worst case, where c '' is the number of point evaluations on the boundary of an atom. Since there are at most O(n) patches, the worst case time complexity is O(n). The proposed algorithm also handles internal voids and guarantees the watertightness of the produced triangular mesh of a molecular surface. In addition, the level-of-detail is easily achieved as a by-product of the proposed scheme. The proposed algorithm is fully implemented and statistics from experiments are also collected. (C) 2009 Elsevier Ltd. All rights reserved.", "paper_title": "Triangulation of molecular surfaces", "paper_id": "WOS:000266897800008"}