{"auto_keywords": [{"score": 0.04257746263992029, "phrase": "ad_hoc_networks"}, {"score": 0.03146876012406448, "phrase": "mac_protocols"}, {"score": 0.010612387000973441, "phrase": "ad_hoc_wireless_networks"}, {"score": 0.009755403205903677, "phrase": "protocol_stack"}, {"score": 0.0047590526875526335, "phrase": "highly_constrained_energy_resources"}, {"score": 0.0047175535881504626, "phrase": "available_energy_resources"}, {"score": 0.00412453424255527, "phrase": "limited_power_source"}, {"score": 0.004100506821168323, "phrase": "even_the_energy_aware_protocols"}, {"score": 0.0039824447174193955, "phrase": "underlying_batteries"}, {"score": 0.003867768665068189, "phrase": "available_energy"}, {"score": 0.003430993453999572, "phrase": "network_lifetime"}, {"score": 0.0033127168183223876, "phrase": "reported_work"}, {"score": 0.0030702085848191953, "phrase": "battery_source"}, {"score": 0.002947043609853674, "phrase": "battery_performance"}, {"score": 0.0028873211377922234, "phrase": "energy_efficiency"}, {"score": 0.0028123050344492553, "phrase": "novel_generalized_analytical_model"}, {"score": 0.00263702267973922, "phrase": "tdma"}, {"score": 0.002560980198416571, "phrase": "csma_protocols"}, {"score": 0.0024798667494928795, "phrase": "round-robin_scheduling"}, {"score": 0.0024581931389119913, "phrase": "packet_transmission"}, {"score": 0.0024295886469293962, "phrase": "discrete-time_markov_chain"}, {"score": 0.002359521764031172, "phrase": "ad_hoc_nodes"}, {"score": 0.002231901054023083, "phrase": "analytical_and_simulation_studies"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v._all_rights"}], "paper_keywords": ["ad hoc wireless network", " lifetime", " MAC protocol", " performance evaluation"], "paper_abstract": "Ad hoc wireless networks possess highly constrained energy resources. The available energy resources should thus be used efficiently, in order to satisfy the requirements. Hence, the protocols at all the layers of the protocol stack should be energy aware and energy efficient. However, all the existing protocols are not energy aware and perform poorly in the presence of a limited power source. Even the energy aware protocols proposed for ad hoc networks do not consider all the characteristics of the underlying batteries. Hence, they fail to efficiently utilize the available energy. There also exist a few protocols, which, though battery unaware, unknowingly prove to be energy efficient. Thus, a mechanism is required to measure the efficiency of the protocols of ad hoc networks, in terms of the network lifetime. To the best of our knowledge, there has been no reported work till date for analyzing the lifetime of the ad hoc networks for various protocols. The protocols at all the layers of the protocol stack together decide the discharge of the battery source of a node. However, assuming that only the MAC protocols decide the battery performance, we focus on measuring the energy efficiency of MAC protocols. This paper primarily provides a novel generalized analytical model for estimating lifetime of ad hoc networks, in the presence of the following two kinds of MAC protocols: (i) reservation-based TDMA protocols and (ii) a specific class of CSMA protocols that try to follow a pattern, such as a round-robin scheduling, for packet transmission. Our model uses discrete-time Markov chain with probabilistic recovery to model the batteries of the ad hoc nodes. We found that our analytical model accurately estimates the lifetime of the network for various MAC protocols. We prove through analytical and simulation studies that energy awareness is crucial in deciding the performance of the MAC protocols for both homogeneous and heterogeneous ad hoc wireless networks. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Towards estimating lifetime of ad hoc wireless networks", "paper_id": "WOS:000250708400001"}