{"auto_keywords": [{"score": 0.02987089440189968, "phrase": "on-line_algorithm"}, {"score": 0.02768312305916378, "phrase": "optimal_off-line_algorithm"}, {"score": 0.00481495049065317, "phrase": "dynamic_bin_packing"}, {"score": 0.004477083974172596, "phrase": "dynamic_bin_packing_problem"}, {"score": 0.004206338218873218, "phrase": "bin_packing_problem"}, {"score": 0.003911010373894104, "phrase": "main_result"}, {"score": 0.0037908515763223107, "phrase": "lower_bound"}, {"score": 0.003693533648584145, "phrase": "achievable_competitive_ratio"}, {"score": 0.00339853518227171, "phrase": "restricted_form"}, {"score": 0.0033633514001658086, "phrase": "unit_fractions"}, {"score": 0.0029072537537959374, "phrase": "resource_augmentation_version"}, {"score": 0.0021159932825818065, "phrase": "bin_size"}], "paper_keywords": [""], "paper_abstract": "We study the dynamic bin packing problem introduced by Coffman, Garey and Johnson. This problem is a generalization of the bin packing problem in which items may arrive and depart from the packing dynamically. The main result in this paper is a lower bound of 2.5 on the achievable competitive ratio, improving the best known 2.428 lower bound, and revealing that packing items of restricted form like unit fractions (i.e., of size 1/k for some integer k), for which a 2.4985-competitive algorithm is known, is indeed easier. We also investigate the resource augmentation version of the problem where the on-line algorithm can use bins of size b (> 1) times that of the optimal off-line algorithm. An interesting result is that we prove b=2 is both necessary and sufficient for the on-line algorithm to match the performance of the optimal off-line algorithm, i.e., achieve 1-competitiveness. Further analysis gives a trade-off between the bin size multiplier 1 < ba parts per thousand currency sign2 and the achievable competitive ratio.", "paper_title": "On Dynamic Bin Packing: An Improved Lower Bound and Resource Augmentation Analysis", "paper_id": "WOS:000263351500003"}