{"auto_keywords": [{"score": 0.04289725068536245, "phrase": "set_problem"}, {"score": 0.01130766623324148, "phrase": "annotated_edge"}, {"score": 0.008663947132282562, "phrase": "maximum_degree"}, {"score": 0.00481495049065317, "phrase": "exact_algorithms"}, {"score": 0.0047707093928203, "phrase": "annotated_edge_dominating_set_in_graphs_with_degree"}, {"score": 0.004390312150344245, "phrase": "nonnegative_integer_requirement"}, {"score": 0.004002972723329302, "phrase": "minimum_set_m_subset"}, {"score": 0.003839962121679795, "phrase": "e_-_m"}, {"score": 0.0033739270918502285, "phrase": "natural_extension"}, {"score": 0.0033274664434575136, "phrase": "classical_edge"}, {"score": 0.0030476702431093687, "phrase": "important_graph_problem"}, {"score": 0.0026651772919894534, "phrase": "bipartite_graph"}], "paper_keywords": ["edge dominating sets", " exact algorithms", " cubic graphs"], "paper_abstract": "Given a graph G = (V, E) together with a nonnegative integer requirement on vertices r : V -> Z(+), the annotated edge dominating set problem is to find a minimum set M subset of E such that, each edge in E - M is adjacent to some edge in M, and M contains at least r(v) edges incident on each vertex v is an element of V. The annotated edge dominating set problem is a natural extension of the classical edge dominating set problem, in which the requirement on vertices is zero. The edge dominating set problem is an important graph problem and has been extensively studied. It is well known that the problem is NP-hard, even when the graph is restricted to a planar or bipartite graph with maximum degree 3. In this paper, we show that the annotated edge dominating set problem in graphs with maximum degree 3 can be solved in O*(1.2721(n)) time and polynomial space, where is is the number of vertices in the graph. We also show that there is an O*(2.2306(k))-time polynomial-space algorithm to decide whether a graph with maximum degree 3 has an annotated edge dominating set of size k or not.", "paper_title": "Exact Algorithms for Annotated Edge Dominating Set in Graphs with Degree Bounded by 3", "paper_id": "WOS:000320214300003"}