{"auto_keywords": [{"score": 0.03403808030466324, "phrase": "knowledge_graph_identification"}, {"score": 0.01095191001219428, "phrase": "knowledge_graph"}, {"score": 0.004476399615305783, "phrase": "key_problem"}, {"score": 0.00436890075128947, "phrase": "knowledge_bases"}, {"score": 0.004136333933790974, "phrase": "erroneous_and_incomplete_information"}, {"score": 0.004012500850311087, "phrase": "candidate_extractions"}, {"score": 0.0037075456471849892, "phrase": "ontological_constraints"}, {"score": 0.0036627245728600073, "phrase": "candidate_facts"}, {"score": 0.0034049123167891955, "phrase": "desired_knowledge_base"}, {"score": 0.002751751956416832, "phrase": "scalability_challenge"}, {"score": 0.0026530590435527527, "phrase": "probabilistic_soft_logic"}, {"score": 0.0026209538403271873, "phrase": "psl"}, {"score": 0.002406799309495983, "phrase": "efficient_solution"}, {"score": 0.0022236070278432575, "phrase": "knowledge_graph_construction"}, {"score": 0.0021049977753042253, "phrase": "competing_methods"}], "paper_keywords": [""], "paper_abstract": "Many information-extraction and knowledge base construction systems are addressing the challenge of deriving knowledge from text. A key problem in constructing these knowledge bases from sources like the web is overcoming the erroneous and incomplete information found in millions of candidate extractions. To solve this problem, we turn to semantics - using ontological constraints between candidate facts to eliminate errors. In this article, we represent the desired knowledge base as a knowledge graph and introduce the problem of knowledge graph identification, collectively resolving the entities, and relations present in the knowledge graph. Knowledge graph identification requires reasoning jointly over trillions of extractions simultaneously, posing a scalability challenge to many approaches. We use probabilistic soft logic (PSL), a recently introduced statistical relational learning framework, to implement an efficient solution to knowledge graph identification and present state-of-the-art results for knowledge graph construction while performing an order of magnitude faster than competing methods.", "paper_title": "Using Semantics and Statistics to Turn Data into Knowledge", "paper_id": "WOS:000353079700007"}