{"auto_keywords": [{"score": 0.048935282081903834, "phrase": "security_practices"}, {"score": 0.015719716506582538, "phrase": "information_security"}, {"score": 0.0045876189888390895, "phrase": "perceived_security"}, {"score": 0.0045324756541157574, "phrase": "information_system"}, {"score": 0.004442032546224076, "phrase": "people'_decisions"}, {"score": 0.004232232993872917, "phrase": "effective_ways"}, {"score": 0.00418134346679498, "phrase": "people's_perception"}, {"score": 0.0036454883790271843, "phrase": "e-banking_system"}, {"score": 0.003308986613384597, "phrase": "online_forum"}, {"score": 0.003229815147800001, "phrase": "strong_password"}, {"score": 0.003114584448820957, "phrase": "objective_strength"}, {"score": 0.002967304040499712, "phrase": "anova"}, {"score": 0.002931569771634119, "phrase": "path_models"}, {"score": 0.002884603537502399, "phrase": "path_analysis"}, {"score": 0.0028498718992429825, "phrase": "people's_adoption_intention"}, {"score": 0.002597088221737922, "phrase": "perceived_controllability"}, {"score": 0.002494279207996077, "phrase": "people's_compliance"}, {"score": 0.0024247382451294255, "phrase": "strong_passwords"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Perception", " Information security", " IT adoption", " Security practices", " e-Banking", " Password"], "paper_abstract": "The gap between the perceived security of an information system and its real security level can influence people' decisions and behavior. The objective of this study is to find effective ways to adjust people's perception of information security, in order to enhance, their intention to adopt IT appliances and compliance to security practices. Two separate experiments were conducted. In experiment I, 64 participants were asked to transfer money through an e-banking system. Their intention to adopt e-banking was measured by a questionnaire. In experiment II, 64 participants were asked to register on an online forum. Their subjective intention to create a strong password was measured by a questionnaire, and the objective strength of the passwords they created was calculated. Results of the ANOVA and the path models derived from the path analysis indicated that people's adoption intention, such as their intention to adopt e-banking, can be enhanced by changing their perceived Knowledge, Controllability and Awareness, while changing the perceived Controllability is most effective. The results also indicated that people's compliance to security practices, such as setting strong passwords for IT systems, can be enhanced by changing their perceived Knowledge, Severity and Possibility, while changing their perceived Knowledge and Severity is most effective. Implications for further research and practice were also discussed. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "Factors affecting perception of information security and their impacts on IT adoption and security practices", "paper_id": "WOS:000296123500006"}