{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "concealed_objects"}, {"score": 0.004772137871562584, "phrase": "terahertz_images"}, {"score": 0.004729704116022601, "phrase": "terahertz_imaging"}, {"score": 0.0044231966846655394, "phrase": "radiometric_temperatures"}, {"score": 0.004383852039913171, "phrase": "different_objects"}, {"score": 0.004325487452170154, "phrase": "human_subject"}, {"score": 0.0038510053729959074, "phrase": "inherent_physical_properties"}, {"score": 0.0038167308978417306, "phrase": "passive_terahertz_imaging"}, {"score": 0.0037827603118271757, "phrase": "associated_hardware"}, {"score": 0.0037157201349604222, "phrase": "poor_contrast"}, {"score": 0.0036826452656927877, "phrase": "low_signal"}, {"score": 0.0036498637283470386, "phrase": "noise_ratio"}, {"score": 0.0036173729405604674, "phrase": "standard_segmentation_algorithms"}, {"score": 0.0032347516831068715, "phrase": "anisotropic_diffusion_algorithm"}, {"score": 0.0030113280682863234, "phrase": "gaussian_densities"}, {"score": 0.0023125191783901367, "phrase": "state-of-the-art_supervised_image_segmentation_algorithm"}, {"score": 0.0021049977753042253, "phrase": "dedicated_hardware"}], "paper_keywords": ["Object detection", " segmentation", " terahertz imaging"], "paper_abstract": "Terahertz imaging makes it possible to acquire images of objects concealed underneath clothing by measuring the radiometric temperatures of different objects on a human subject. The goal of this work is to automatically detect and segment concealed objects in broadband 0.1-1 THz images. Due to the inherent physical properties of passive terahertz imaging and associated hardware, images have poor contrast and low signal to noise ratio. Standard segmentation algorithms are unable to segment or detect concealed objects. Our approach relies on two stages. First, we remove the noise from the image using the anisotropic diffusion algorithm. We then detect the boundaries of the concealed objects. We use a mixture of Gaussian densities to model the distribution of the temperature inside the image. We then evolve curves along the isocontours of the image to identify the concealed objects. We have compared our approach with two state-of-the-art segmentation methods. Both methods fail to identify the concealed objects, while our method accurately detected the objects. In addition, our approach was more accurate than a state-of-the-art supervised image segmentation algorithm that required that the concealed objects be already identified. Our approach is completely unsupervised and could work in real-time on dedicated hardware.", "paper_title": "Detection and Segmentation of Concealed Objects in Terahertz Images", "paper_id": "WOS:000261008900018"}