{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "positive_systems"}, {"score": 0.02296350933162585, "phrase": "bounded_time-varying_delays"}, {"score": 0.017848235377296646, "phrase": "l-infinity_gains"}, {"score": 0.009397868298718382, "phrase": "positive_linear_systems"}, {"score": 0.008418212551869307, "phrase": "constant_delays"}, {"score": 0.004211731831120046, "phrase": "interval_time-varying_delays"}, {"score": 0.004020066537823032, "phrase": "state_trajectory"}, {"score": 0.003557283483525861, "phrase": "system_matrices"}, {"score": 0.0034551632687788857, "phrase": "delay_size"}, {"score": 0.0032031180198375283, "phrase": "nominal_systems"}, {"score": 0.0028341130433482565, "phrase": "constant_delay_systems"}, {"score": 0.0024784363584530976, "phrase": "time_delays"}, {"score": 0.0021049977753042253, "phrase": "corresponding_delay-free_systems"}], "paper_keywords": ["time-delay systems", " positive systems", " L-infinity-gain", " l(infinity)-gain"], "paper_abstract": "This paper is devoted to the analysis of the l(infinity) and L-infinity gains for positive linear systems with interval time-varying delays. Through exploiting the monotonicity of the state trajectory, we first prove that for positive systems with constant delays, the l(infinity) and L-infinity gains are fully governed by the system matrices but independent of the delay size. Moreover, for positive systems with bounded time-varying delays, by comparing with the nominal systems with constant delays, it turns out that the l(infinity) and L-infinity gains are exactly the same as that of the constant delay systems. The results in this paper reveal that the l(infinity) and L-infinity gains of positive linear systems are not sensitive to the magnitude of time delays and hence the computation of l(infinity) and L-infinity gains of positive systems with bounded time-varying delays can be reduced to computing the l(infinity) and L-infinity gains of the corresponding delay-free systems. Both continuous-time and discrete-time cases are considered in this paper.", "paper_title": "On l(infinity) and L-infinity gains for positive systems with bounded time-varying delays", "paper_id": "WOS:000353511100005"}