{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sap_reference_models"}, {"score": 0.010422523178541782, "phrase": "state-space_analysis"}, {"score": 0.006630485504210108, "phrase": "human_judgment"}, {"score": 0.004771435352180973, "phrase": "epc_reduction"}, {"score": 0.00460125407969429, "phrase": "reference_model"}, {"score": 0.004539005582217305, "phrase": "generic_conceptual_model"}, {"score": 0.003942877273973905, "phrase": "event-driven_process_chains"}, {"score": 0.0035515951985356374, "phrase": "business_model"}, {"score": 0.003503497128638099, "phrase": "executable_model"}, {"score": 0.0028037753646260937, "phrase": "two-step_approach"}, {"score": 0.002740733472206927, "phrase": "epc"}, {"score": 0.0026913130726432645, "phrase": "universally_accepted_reduction_rules"}, {"score": 0.0026307897899760383, "phrase": "reduced_epc"}, {"score": 0.002193013499219711, "phrase": "added_value"}, {"score": 0.0021632743048552536, "phrase": "verification_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["process mining", " Petri nets", " event-driven process chains", " verification", " SAP R/3 reference models"], "paper_abstract": "A reference model is a generic conceptual model that formalizes recommended practices for a certain domain. Today, the SAP reference models are among the most comprehensive reference models, including over 4000 entity types and covering over 1000 business processes and interorganizational scenarios. The SAP reference models use Event-driven Process Chains (EPCs) to model these processes and scenarios. Like other informal languages, EPCs are intended to support the transition from a business model to an executable model. For this reason, researchers have tried to formalize the semantics of EPCs. However, in their approaches, they fail to acknowledge the fact that in EPCs constructs exist that require human judgment to assess correctness. This paper aims to acknowledge this fact by introducing a two-step approach. First, the EPC is reduced using universally accepted reduction rules. Second, the reduced EPC is analyzed using a mixture of state-space analysis, invariants, and human judgment. This approach has been implemented in a tool, and applying this tool to the SAP reference models showed that these contain errors, which clearly shows the added value of this verification approach. (C) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Verification of the SAP reference models using EPC reduction, state-space analysis, and invariants", "paper_id": "WOS:000248605700008"}