{"auto_keywords": [{"score": 0.0484095912897003, "phrase": "har"}, {"score": 0.00481495049065317, "phrase": "sensor-fusion"}, {"score": 0.004766388573192505, "phrase": "kda-based_svms"}, {"score": 0.00469445816161498, "phrase": "human_activity_recognition"}, {"score": 0.004328689762198895, "phrase": "relatively_new_area"}, {"score": 0.0038520615699124123, "phrase": "large_number"}, {"score": 0.0032088487124106936, "phrase": "optimum_performance_efficient_feature_extraction"}, {"score": 0.0031284221314354095, "phrase": "classification_methods"}, {"score": 0.0030038988468808845, "phrase": "smartphone-based_har_scheme"}, {"score": 0.0028990018343924683, "phrase": "time_domain_features"}, {"score": 0.0027835848648596513, "phrase": "nonlinear_discriminatory_approach"}, {"score": 0.002672750634553146, "phrase": "high_accuracy"}, {"score": 0.0023066199295447686, "phrase": "different_positions"}, {"score": 0.002203509076886664, "phrase": "online_settings"}, {"score": 0.0021373366163721518, "phrase": "proposed_system"}, {"score": 0.0021049977753042253, "phrase": "previous_mobile_phone-based_har_systems"}], "paper_keywords": [""], "paper_abstract": "Although human activity recognition (HAR) has been studied extensively in the past decade, HAR on smartphones is a relatively new area. Smartphones are equipped with a variety of sensors. Fusing the data of these sensors could enable applications to recognize a large number of activities. Realizing this goal is challenging, however. Firstly, these devices are low on resources, which limits the number of sensors that can be utilized. Secondly, to achieve optimum performance efficient feature extraction, feature selection and classification methods are required. This work implements a smartphone-based HAR scheme in accordance with these requirements. Time domain features are extracted from only three smartphone sensors, and a nonlinear discriminatory approach is employed to recognize 15 activities with a high accuracy. This approach not only selects the most relevant features from each sensor for each activity but it also takes into account the differences resulting from carrying a phone at different positions. Evaluations are performed in both offline and online settings. Our comparison results show that the proposed system outperforms some previous mobile phone-based HAR systems.", "paper_title": "Activity Recognition on Smartphones via Sensor-Fusion and KDA-Based SVMs", "paper_id": "WOS:000336165200001"}