{"auto_keywords": [{"score": 0.044465958024233136, "phrase": "traffic_signs"}, {"score": 0.04385831378402909, "phrase": "complex_background"}, {"score": 0.00481495049065317, "phrase": "graph-based_ranking"}, {"score": 0.004634459424542272, "phrase": "existing_traffic_sign_detection_systems"}, {"score": 0.00401560412621627, "phrase": "novel_graph-based_traffic_sign_detection_approach"}, {"score": 0.003828187766572941, "phrase": "graph-based_ranking_stage"}, {"score": 0.0037556843869894566, "phrase": "multithreshold_segmentation_stage"}, {"score": 0.0036845490951857617, "phrase": "graph-based_ranking_algorithm"}, {"score": 0.003146652729098066, "phrase": "shape_rotations"}, {"score": 0.0031018195951638882, "phrase": "scale_changes"}, {"score": 0.003072285184441679, "phrase": "traffic_sign_images"}, {"score": 0.0029996699429582835, "phrase": "proposed_multithreshold_segmentation_algorithm"}, {"score": 0.0029147869733574844, "phrase": "nonzero_ranking_score"}, {"score": 0.002549269480908849, "phrase": "better_performance"}, {"score": 0.0021252533072727707, "phrase": "different_weather"}, {"score": 0.0021049977753042253, "phrase": "illumination_conditions"}], "paper_keywords": ["Graph-based image analysis", " graph-based image segmentation", " traffic sign detection"], "paper_abstract": "The majority of existing traffic sign detection systems utilize color or shape information, but the methods remain limited in regard to detecting and segmenting traffic signs from a complex background. In this paper, we propose a novel graph-based traffic sign detection approach that consists of a saliency measure stage, a graph-based ranking stage, and a multithreshold segmentation stage. Because the graph-based ranking algorithm with specified color and saliency combines the information of color, saliency, spatial, and contextual relationship of nodes, it is more discriminative and robust than the other systems in terms of handling various illumination conditions, shape rotations, and scale changes from traffic sign images. Furthermore, the proposed multithreshold segmentation algorithm focuses on all the nodes with a nonzero ranking score, which can effectively solve problems such as complex background, occlusion, various illumination conditions, and so on. The results for three public traffic sign sets show that our proposed approach leads to better performance than the current state-of-the-art methods. Moreover, the results are satisfactory even for images containing traffic signs that have been rotated or undergone occlusion, as well as for images that were photographed under different weather and illumination conditions.", "paper_title": "Traffic Sign Detection via Graph-Based Ranking and Segmentation Algorithms", "paper_id": "WOS:000366891300004"}