{"auto_keywords": [{"score": 0.04910527144315705, "phrase": "positive_hypothesis_testing"}, {"score": 0.007152368807539886, "phrase": "health_information"}, {"score": 0.004280549932617541, "phrase": "disconfirming_evidence"}, {"score": 0.003824547895167011, "phrase": "tightly_controlled_online_database"}, {"score": 0.0031004173389196387, "phrase": "recommendation_technique"}, {"score": 0.0027856252557826467, "phrase": "incorporation_technique"}, {"score": 0.0025547994452342266, "phrase": "understudied_topic"}, {"score": 0.0024416087858984644, "phrase": "debiasing_techniques"}, {"score": 0.0023721974375323267, "phrase": "new_techniques"}, {"score": 0.0023527296826339225, "phrase": "search_engine_developers"}, {"score": 0.002314271047073693, "phrase": "new_options"}, {"score": 0.0022577559526646904, "phrase": "confirming_and_disconfirming_evidence"}, {"score": 0.0022117133940361025, "phrase": "search_results"}, {"score": 0.002157697367447098, "phrase": "search_engines"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Confirmation bias", " Positive hypothesis testing", " Keyword search", " Debiasing"], "paper_abstract": "Purpose: The goal of this study is to investigate positive hypothesis testing among consumers of health information when they search the Web. After demonstrating the extent of positive hypothesis testing using Experiment 1, we conduct Experiment 2 to test the effectiveness of two debiasing techniques. Methods: A total of 60 undergraduate students searched a tightly controlled online database developed by the authors to test the validity of a hypothesis. The database had four abstracts that confirmed the hypothesis and three abstracts that disconfirmed it. Results: Findings of Experiment 1 showed that majority of participants (85%) exhibited positive hypothesis testing. In Experiment 2, we found that the recommendation technique was not effective in reducing positive hypothesis testing since none of the participants assigned to this server could retrieve disconfirming evidence. Experiment 2 also showed that the incorporation technique successfully reduced positive hypothesis testing since 75% of the participants could retrieve disconfirming evidence. Conclusion: Positive hypothesis testing on the Web is an understudied topic. More studies are needed to validate the effectiveness of the debiasing techniques discussed in this study and develop new techniques. Search engine developers should consider developing new options for users so that both confirming and disconfirming evidence can be presented in search results as users test hypotheses using search engines. (C) 2012 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Seeking health information on the web: Positive hypothesis testing", "paper_id": "WOS:000316737700013"}