{"auto_keywords": [{"score": 0.042720840945861746, "phrase": "earth"}, {"score": 0.00481495049065317, "phrase": "professional_designers"}, {"score": 0.004688321299229397, "phrase": "entertainment_media"}, {"score": 0.004538045400396629, "phrase": "common_educative_enterprise"}, {"score": 0.004444921827311577, "phrase": "predictive_knowledge"}, {"score": 0.0036553070575015344, "phrase": "educative_and_mis-educative_importance"}, {"score": 0.0035696339388072086, "phrase": "higher_level_cybersystemic_approaches"}, {"score": 0.003384114910963706, "phrase": "practical_perspectives"}, {"score": 0.003265805876551917, "phrase": "cultural_propagation"}, {"score": 0.002874726518572154, "phrase": "cybernetic_understanding"}, {"score": 0.002807297104719042, "phrase": "complex_historically_emergent_higher_level_cybersystems"}, {"score": 0.0026220963356862153, "phrase": "actual_practice"}, {"score": 0.0025758208205978825, "phrase": "designers'_functional_levels"}, {"score": 0.002515384834484012, "phrase": "influential_designers"}, {"score": 0.002470987929071079, "phrase": "higher_cybersystemic_levels"}, {"score": 0.0023845255359681143, "phrase": "newly_precarious_situation"}, {"score": 0.00226717904319347, "phrase": "earth-life_system"}], "paper_keywords": ["sustainable design", " cybernetics", " design"], "paper_abstract": "Purpose - The purpose of this paper is to encourage professional designers of many kinds, and especially those of the entertainment media, to understand themselves as actually being partners in a common educative enterprise, which is through artistry, predictive knowledge, non-dominative legitimative discourse and technology, helping people everywhere to learn to desire to, and to be able to, survive reasonably pleasantly on Earth for a very long time to come. Design/methodology/approach - This paper puts forward three theses: collapse of civilisation is immanent unless people can be educated to live symbiotically with one another and Gaia; all designs have educative and mis-educative importance; designers need to learn to use higher level cybersystemic approaches to be beneficial. Then it argues for the plausibility of these theses from philosophical educational to practical perspectives. In particular, it argues for the importance of modifying cultural propagation so that all our main cultures can become \"symviable\" - that is can come to live symbiotically with one an other and with the ecosystems of Earth. And it is argued that, in order to facilitate this enterprise, a cybernetic understanding of the processes and actions of the complex historically emergent higher level cybersystems in which the authors are all embedded, and which are embedded in us, should become the basis for designers, actual practice. Findings - By reviewing designers' functional levels historically the paper finds that many different kinds of influential designers have actually functioned at the higher cybersystemic levels the authors advocate and hence can be guiding exemplars in this newly precarious situation. Originality/value - A deeper cybersystemic understanding of just how people are all parts of one mutually educating and mutually surviving Earth-life system changes the value of everything. Designers who manage to use such understanding should be both more successful and more satisfied with the value of their work.", "paper_title": "Designing cybersystemically for symviability", "paper_id": "WOS:000251883500007"}