{"auto_keywords": [{"score": 0.004588158931776543, "phrase": "new_and_more_effective_procedures"}, {"score": 0.003945754887845885, "phrase": "general_theory"}, {"score": 0.003692271726952282, "phrase": "indirect_th-collocation_methods"}, {"score": 0.003312009953245191, "phrase": "indirect_approach"}, {"score": 0.003213489259323924, "phrase": "second_order_differential_equations"}, {"score": 0.0028477727736832283, "phrase": "internal_boundary"}, {"score": 0.002779769492357829, "phrase": "subdomain_interiors"}, {"score": 0.0026646374739979694, "phrase": "clear_computational_advantages"}, {"score": 0.0023328599525181707, "phrase": "single-point-collocation_methods"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["collocation", " orthogonal collocation", " discontinuous galerkin", " matrix condensation", " elliptic equations"], "paper_abstract": "In recent years, new and more effective procedures for applying collocation have been published. This article is devoted to present a revision of this Subject and complement its developments. From the general theory two broad approaches are derived, which yield the direct and the indirect TH-collocation methods. The former approach had not been published before, and it is a dual of the indirect approach. In particular. second order differential equations of elliptic type are considered and several orthogonal collocation algorithms are developed for them. In TH-collocation, the approximations on the internal boundary and in the subdomain interiors are completely independent. This yields clear computational advantages that are illustrated through the construction of such algorithms. In the implementations presented, three dimensional problems are included. In passing, single-point-collocation methods that have been the subject of several recent publications are revised. (c) 2006 Published by Elsevier Ltd.", "paper_title": "Collocation methods: More efficient procedures for applying collocation", "paper_id": "WOS:000248998000002"}