{"auto_keywords": [{"score": 0.004630150894006861, "phrase": "packet_reordering"}, {"score": 0.0044524122425287005, "phrase": "next-generation_switch_designs"}, {"score": 0.004318881178805575, "phrase": "reordering_delay_contagion"}, {"score": 0.004153041453795458, "phrase": "disproportionate_number"}, {"score": 0.003924629168434799, "phrase": "switch_designers"}, {"score": 0.0038401488612789963, "phrase": "switch_flow_order"}, {"score": 0.0032404677650217407, "phrase": "single_packet"}, {"score": 0.003170667618004276, "phrase": "long_time"}, {"score": 0.002818850283787242, "phrase": "reordering_contagion"}, {"score": 0.002722288966917744, "phrase": "inter-flow_blocking"}, {"score": 0.002686935113435742, "phrase": "reordering_delay"}, {"score": 0.002594880866651459, "phrase": "network_coding"}, {"score": 0.0025500402081330394, "phrase": "rare_events"}, {"score": 0.0025279105573394727, "phrase": "high_queueing_delay"}, {"score": 0.002286781334850213, "phrase": "resequencing_delay"}, {"score": 0.002237477619351199, "phrase": "resequencing_delays"}, {"score": 0.002132711053003407, "phrase": "real-life_traces"}, {"score": 0.0021049977753042253, "phrase": "real_hashing_function"}], "paper_keywords": ["Switching theory", " packet-switching networks"], "paper_abstract": "Packet reordering has now become one of the most significant bottlenecks in next-generation switch designs. A switch practically experiences a reordering delay contagion, such that a few late packets may affect a disproportionate number of other packets. This contagion can have two possible forms. First, since switch designers tend to keep the switch flow order, i.e., the order of packets arriving at the same switch input and departing from the same switch output, a packet may be delayed due to packets of other flows with little or no reason. Further, within a flow, if a single packet is delayed for a long time, then all the other packets of the same flow will have to wait for it and suffer as well. In this paper, we suggest solutions against this reordering contagion. We first suggest several hash-based counter schemes that prevent inter-flow blocking and reduce reordering delay. We further suggest schemes based on network coding to protect against rare events with high queueing delay within a flow. Last, we demonstrate using both analysis and simulations that the use of these solutions can indeed reduce the resequencing delay. For instance, resequencing delays are reduced by up to an order of magnitude using real-life traces and a real hashing function.", "paper_title": "The Switch Reordering Contagion: Preventing a Few Late Packets from Ruining the Whole Party", "paper_id": "WOS:000336672600017"}