{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "walking_parameters"}, {"score": 0.004634799977448855, "phrase": "data_mining_techniques"}, {"score": 0.004419018661564621, "phrase": "useful_information"}, {"score": 0.004173244935967375, "phrase": "human_walking_pattern"}, {"score": 0.003966233032752466, "phrase": "normal_walking"}, {"score": 0.003805591825381666, "phrase": "normal_young_and_elderly_subjects"}, {"score": 0.0036864465771943933, "phrase": "better_understanding"}, {"score": 0.0036282750398991485, "phrase": "walking_patterns"}, {"score": 0.0034812740368914455, "phrase": "tri-axial_acceleration"}, {"score": 0.0033295966773779174, "phrase": "gyrational_pitch"}, {"score": 0.0031242709509664837, "phrase": "right_thigh"}, {"score": 0.0028127163745564777, "phrase": "recorded_signals"}, {"score": 0.002768293851511292, "phrase": "wavelet_packet_decomposition"}, {"score": 0.0026224255640133758, "phrase": "resultant_wavelet_coefficients"}, {"score": 0.0021049977753042253, "phrase": "elderly_subjects"}], "paper_keywords": ["postural parameters", " tri-axial acceleration", " pitch", " yaw", " roll", " entropies", " wavelet packet decomposition"], "paper_abstract": "Data mining techniques are highly useful in the study of various medical signals and images in order to obtain useful information to better predict the diagnosis or prognosis or treatment options for the patient. Study of the human walking pattern helps us understand the variability of motion during activities such as high performance walking and normal walking. A comparison of the parameters quantifying this variability in motion in normal young and elderly subjects and the subjects who need support will aid in better understanding of the relationship among walking patterns, age and disabilities. In this study, we measured the tri-axial acceleration along three directions: anteroposterior, lateral and vertical. We also measured gyrational pitch, roll and yaw. These parameters were obtained using sensors attached to the back, left thigh and right thigh of the three classes of subjects (normal, elderly and adults with support) during the three types of exercises: 10-m normal walk, 10-m high performance walk and stepping. These recorded signals were then subjected to wavelet packet decomposition, and three entropies, namely approximate entropy and two bispectral entropies, were obtained from the resultant wavelet coefficients. On analysing these entropies, we could observe the following: (1) the entropy steadily decreases with the increase in age and with the presence of impairments, and (2) the entropy decreases among all the three types of exercises, namely normal walking and high performance walking. We feel that the results of this work can help in the design of supporting devices for elderly subjects.", "paper_title": "Comparison of walking parameters obtained from the young, elderly and adults with support", "paper_id": "WOS:000326070800009"}