{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "random_lattice_path"}, {"score": 0.004314202267170469, "phrase": "data_sink"}, {"score": 0.0041174152262981505, "phrase": "positive_quadrant"}, {"score": 0.004016879495597319, "phrase": "relay_nodes"}, {"score": 0.0036586566377695326, "phrase": "data_source"}, {"score": 0.003314004121560261, "phrase": "wireless_relay_node"}, {"score": 0.003268767497941097, "phrase": "packet_generation_rate"}, {"score": 0.003076927231793657, "phrase": "sequential_relay_placement"}, {"score": 0.002856761712725157, "phrase": "total_cost_markov_decision_process"}, {"score": 0.002802292894438601, "phrase": "optimal_policy"}, {"score": 0.002764021830539386, "phrase": "optimal_placement_set"}, {"score": 0.0026232857693533535, "phrase": "last_placed_relay"}, {"score": 0.0025521085778978042, "phrase": "next_relay"}, {"score": 0.0025034338848015166, "phrase": "simpler_one-step-look-ahead_characterization"}, {"score": 0.0023890446405639082, "phrase": "optimal_placement"}, {"score": 0.00236289633510808, "phrase": "finite_number"}, {"score": 0.0023114531962324966, "phrase": "value_iteration"}, {"score": 0.002261127498899093, "phrase": "distance_threshold_based_heuristic"}, {"score": 0.0021577859945449704, "phrase": "threshold_distance"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Relay placement", " As-you-go deployment of wireless sensor networks", " Optimal stopping problems", " Placement boundary"], "paper_abstract": "Our work is motivated by impromptu (or \"as-you-go\") deployment of wireless relay nodes along a path, a need that arises in many situations. In this paper, the path is modeled as starting at the origin (where there is the data sink, e.g., the control center), and evolving randomly over a lattice in the positive quadrant. A person walks along the path deploying relay nodes as he goes. At each step, the path can, randomly, either continue in the same direction or take a turn, or come to an end, at which point a data source (e.g., a sensor) has to be placed, that will send packets to the data sink. A decision has to be made at each step whether or not to place a wireless relay node. Assuming that the packet generation rate by the source is very low, and simple link-by-link scheduling, we consider the problem of sequential relay placement so as to minimize the expectation of an end-to-end cost metric (a linear combination of the sum of convex hop costs and the number of relays placed). This impromptu relay placement problem is formulated as a total cost Markov decision process. First, we derive the optimal policy in terms of an optimal placement set and show that this set is characterized by a boundary (with respect to the position of the last placed relay) beyond which it is optimal to place the next relay. Next, based on a simpler one-step-look-ahead characterization of the optimal policy, we propose an algorithm which is proved to converge to the optimal placement set in a finite number of steps and which is faster than value iteration. We show by simulations that the distance threshold based heuristic, usually assumed in the literature, is close to the optimal, provided that the threshold distance is carefully chosen. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Optimal sequential wireless relay placement on a random lattice path", "paper_id": "WOS:000339598700001"}