{"auto_keywords": [{"score": 0.027507999683207576, "phrase": "sdp"}, {"score": 0.00481495049065317, "phrase": "same-decision_probability"}, {"score": 0.0046242451772036145, "phrase": "optimal_choices"}, {"score": 0.004481132747216135, "phrase": "especially_if_not_enough_information"}, {"score": 0.0041703614123283165, "phrase": "information_gathering_process"}, {"score": 0.003611751858608048, "phrase": "recently_introduced_notion"}, {"score": 0.0033459905006404207, "phrase": "selection_criterion"}, {"score": 0.003256922225995089, "phrase": "additional_insight"}, {"score": 0.0026362590493392785, "phrase": "first_exact_algorithm"}, {"score": 0.002453116398642071, "phrase": "new_complexity_results"}, {"score": 0.0023033100935570755, "phrase": "naive_bayes_structure"}, {"score": 0.0022118619998034742, "phrase": "non-myopic_value"}, {"score": 0.0021050005966562354, "phrase": "sdp."}], "paper_keywords": [""], "paper_abstract": "When making decisions under uncertainty, the optimal choices are often difficult to discern, especially if not enough information has been gathered. Two key questions in this regard relate to whether one should stop the information gathering process and commit to a decision (stopping criterion), and if not, what information to gather next (selection criterion). In this paper, we show that the recently introduced notion, Same-Decision Probability (SDP), can be useful as both a stopping and a selection criterion, as it can provide additional insight and allow for robust decision making in a variety of scenarios. This query has been shown to be highly intractable, being PPPP-complete, and is exemplary of a class of queries which correspond to the computation of certain expectations. We propose the first exact algorithm for computing the SDP, and demonstrate its effectiveness on several real and synthetic networks. Finally, we present new complexity results, such as the complexity of computing the SDP on models with a Naive Bayes structure. Additionally, we prove that computing the non-myopic value of information is complete for the same complexity class as computing the SDP.", "paper_title": "Algorithms and Applications for the Same-Decision Probability", "paper_id": "WOS:000335435200001"}