{"auto_keywords": [{"score": 0.026897811453592883, "phrase": "conventional_spatial_implementation"}, {"score": 0.015297261702605463, "phrase": "spherical_flux"}, {"score": 0.012753179571858404, "phrase": "sphere_radius"}, {"score": 0.011484435332229904, "phrase": "fourier_domain"}, {"score": 0.007682840771111782, "phrase": "proposed_implementation"}, {"score": 0.00481495049065317, "phrase": "flux_computation"}, {"score": 0.0047273577269638725, "phrase": "vascular_segmentation"}, {"score": 0.004556901872357751, "phrase": "spherical_region"}, {"score": 0.004332471656145115, "phrase": "tubular_structures"}, {"score": 0.0042928648367867835, "phrase": "magnetic_resonance_angiography"}, {"score": 0.004157058883925715, "phrase": "conventional_approach"}, {"score": 0.004007083686875716, "phrase": "spatial_domain"}, {"score": 0.003555902292752528, "phrase": "spherical_flux_computation"}, {"score": 0.003349670229755675, "phrase": "spherical_flux_calculation"}, {"score": 0.0033037970113095577, "phrase": "divergence_theorem"}, {"score": 0.00286493504971388, "phrase": "frequency_subband"}, {"score": 0.0028127163745564777, "phrase": "computation_accuracy"}, {"score": 0.0026494723416072316, "phrase": "synthetic_and_clinical_phase_contrast_magnetic_resonance_angiographic_volumes"}, {"score": 0.0021049977753042253, "phrase": "time_complexity"}], "paper_keywords": ["Efficient implementation", " flux", " vascular segmentation"], "paper_abstract": "Spherical flux is the flux inside a spherical region, and it is very useful in the analysis of tubular structures in magnetic resonance angiography and computed tomographic angiography. The conventional approach is to estimate the spherical flux in the spatial domain. Its running time depends on the sphere radius quadratically, which leads to very slow spherical flux computation when the sphere size is large. This paper proposes a more efficient implementation for spherical flux computation in the Fourier domain. Our implementation is based on the reformulation of the spherical flux calculation using the divergence theorem, spherical step function, and the convolution operation. With this reformulation, most of the calculations are performed in the Fourier domain. We show how to select the frequency subband so that the computation accuracy can be maintained. It is experimentally demonstrated that, using the synthetic and clinical phase contrast magnetic resonance angiographic volumes, our implementation is more computationally efficient than the conventional spatial Implementation. The accuracies of our implementation and that of the conventional spatial implementation are comparable. Finally, the proposed implementation can definitely benefit the computation of the multiscale spherical flux with a set of radii because, unlike the conventional spatial implementation, the time complexity of the proposed implementation does not depend on the sphere radius.", "paper_title": "Efficient Implementation for Spherical Flux Computation and Its Application to Vascular Segmentation", "paper_id": "WOS:000263604700012"}