{"auto_keywords": [{"score": 0.024196147678903372, "phrase": "cognitive_model"}, {"score": 0.00481495049065317, "phrase": "abductive_logic_programming"}, {"score": 0.004335603324413586, "phrase": "proactive_thinking"}, {"score": 0.004105435059094972, "phrase": "active_thinking"}, {"score": 0.004071121244999291, "phrase": "logical_consequences"}, {"score": 0.00403709306806495, "phrase": "candidate_actions"}, {"score": 0.0038549394272661356, "phrase": "different_ways"}, {"score": 0.003574364535717202, "phrase": "decision_theory"}, {"score": 0.0035001037990786727, "phrase": "different_forms"}, {"score": 0.0032181231788427655, "phrase": "high-level_goals"}, {"score": 0.0031645050772280033, "phrase": "lower-level_condition-action_rule_form"}, {"score": 0.003072807453368781, "phrase": "neural_networks"}, {"score": 0.00284899583294417, "phrase": "dual-process_models"}, {"score": 0.002789763110395331, "phrase": "dual_process_models"}, {"score": 0.0026083473154448326, "phrase": "deliberative_processes"}, {"score": 0.002490518615945975, "phrase": "alp"}, {"score": 0.002358050109031317, "phrase": "artificial_agents"}, {"score": 0.0022514836269627186, "phrase": "human_agents"}, {"score": 0.0021049977753042253, "phrase": "normative_model"}], "paper_keywords": [""], "paper_abstract": "Abductive logic programming (ALP) can be used to model reactive, proactive and pre-active thinking in intelligent agents. Reactive thinking assimilates observations of changes in the environment, whereas proactive thinking reduces goals to sub-goals and ultimately to candidate actions. Pre-active thinking generates logical consequences of candidate actions, to help in deciding between the alternatives. These different ways of thinking are compatible with any way of deciding between alternatives, including the use of both decision theory and heuristics. The different forms of thinking can be performed as they are needed, or they can be performed in advance, transforming high-level goals and beliefs into lower-level condition-action rule form, which can be implemented in neural networks. Moreover, the higher-level and lower-level representations can operate in tandem, as they do in dual-process models of thinking. In dual process models, intuitive processes form judgements rapidly, sub-consciously and in parallel, while deliberative processes form and monitor judgements slowly, consciously and serially. ALP used in this way can not only provide a framework for constructing artificial agents, but can also be used as a cognitive model of human agents. As a cognitive model, it combines both a descriptive model of how humans actually think with a normative model of humans can think more effectively.", "paper_title": "The logical way to be artificially intelligent", "paper_id": "WOS:000237506800001"}