{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "high_rise_buildings"}, {"score": 0.027407238156784856, "phrase": "priority_order"}, {"score": 0.027206790076842593, "phrase": "lower_floors"}, {"score": 0.027007767302745306, "phrase": "upper_floors"}, {"score": 0.004690025569165577, "phrase": "computer_modeling"}, {"score": 0.004568326972997448, "phrase": "evacuation_strategies"}, {"score": 0.004081385289516914, "phrase": "obtained_model"}, {"score": 0.003916098498242888, "phrase": "simulation_results"}, {"score": 0.0038576618286586387, "phrase": "optimal_percentages"}, {"score": 0.003687512797620773, "phrase": "shortest_evacuation_time"}, {"score": 0.0035514484574435574, "phrase": "evacuated_persons"}, {"score": 0.003459191419478298, "phrase": "evacuation_time_decrease"}, {"score": 0.003382017342396959, "phrase": "maximum_speed"}, {"score": 0.003148774338287351, "phrase": "different_age_groups"}, {"score": 0.002688532127821979, "phrase": "utilization_rate"}, {"score": 0.002295406551990453, "phrase": "aged_people"}, {"score": 0.002252602622785975, "phrase": "faster_evacuation_rate"}, {"score": 0.0022105951175680856, "phrase": "evacuation_process"}, {"score": 0.0021775526153883355, "phrase": "total_evacuation_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Evacuation", " High rise building", " Simulation", " Occupant"], "paper_abstract": "Based on computer modeling and simulation, the problem of evacuation strategies that utilize a combination of stairs and elevators for high rise buildings is investigated in this paper. First, by using the Pathfinder software, a 28-storey building model with stairs and elevators is established. Then, based on the obtained model, several evacuation scenarios are designed for researching this issue. The simulation results show that the optimal percentages of the occupants evacuated by the elevators, when achieving the shortest evacuation time, is almost not related to the number of evacuated persons and floors. Furthermore, the evacuation time decrease achieved by increasing the elevator maximum speed is not as much as that obtained by increasing the number of elevators. Moreover, when evacuating different age groups, it is found that selecting the aged (slow-moving) people, who may create congestion in the stairs, to be evacuated by elevators can speed up the evacuation efficiently, and selecting the children to be evacuated by elevators can improve the utilization rate of the elevators. Finally, the evacuation with a priority order from lower floors to upper floors is considered. Results show that the evacuation with a priority order from lower floors to upper floors can effectively decrease the congestion on the stairs caused by the aged people, and achieve a faster evacuation rate during most of the evacuation process, although the total evacuation time increases a little. (C) 2015 Elsevier B.V. All rights reserved.", "paper_title": "Investigation of combined stairs elevators evacuation strategies for high rise buildings based on simulation", "paper_id": "WOS:000351862200004"}