{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "transmitted_infectious_agents"}, {"score": 0.004654210559456924, "phrase": "computerized_algorithm"}, {"score": 0.004373267443572639, "phrase": "likeliest_transmission_paths"}, {"score": 0.004251210982670317, "phrase": "person-to-person_transmitted_illness"}, {"score": 0.004062937864702115, "phrase": "natural_history"}, {"score": 0.003949508242904001, "phrase": "population_structure"}, {"score": 0.0038392331564122387, "phrase": "observed_symptoms"}, {"score": 0.0037320255482878365, "phrase": "algorithm_efficacy"}, {"score": 0.0033893426032054366, "phrase": "random_outbreaks"}, {"score": 0.0032946562900625187, "phrase": "algorithm's_performance"}, {"score": 0.003148612096891635, "phrase": "human_operators"}, {"score": 0.0028919522313933525, "phrase": "reference_methods"}, {"score": 0.0028271058251633815, "phrase": "higher_proportion"}, {"score": 0.0024395426929046415, "phrase": "nursing_homes"}, {"score": 0.002318127769195112, "phrase": "transmission_maps"}, {"score": 0.0022405528759521856, "phrase": "person-to-person_transmitted_agents"}], "paper_keywords": [""], "paper_abstract": "The authors developed a computerized algorithm that estimates 'who transmits to whom'-that is, the likeliest transmission paths during an outbreak of person-to-person transmitted illness. This algorithm uses basic information about natural history of the disease, population structure, and chronology of observed symptoms. To assess the algorithm efficacy, the authors built a simulator with parameters describing the disease and the population to simulate random outbreaks of influenza. The algorithm's performance was compared with three reference methods that simulated how human operators would handle such situations. For any size of outbreak, the algorithm outperformed the reference methods and provided a higher proportion of cases for whom the source subject who transmitted infection was identified. The authors also illustrated applicability of the algorithm for describing outbreaks of influenza in nursing homes. The use of this algorithm to draw transmission maps in investigations of outbreaks with person-to-person transmitted agents could potentially guide public health measures regarding the control of such outbreaks.", "paper_title": "WTW-an algorithm for identifying \"who transmits to whom\" in outbreaks of interhuman transmitted infectious agents", "paper_id": "WOS:000277580700018"}