{"auto_keywords": [{"score": 0.023134704266921102, "phrase": "epileptic_seizures"}, {"score": 0.01897573820346932, "phrase": "time_constants"}, {"score": 0.00964940127540527, "phrase": "epileptic_brain"}, {"score": 0.007191497255567572, "phrase": "eeg_dynamics"}, {"score": 0.007118884442900278, "phrase": "stl"}, {"score": 0.00481495049065317, "phrase": "brain_dynamics"}, {"score": 0.004756521061849989, "phrase": "global_optimization"}, {"score": 0.004737201825299411, "phrase": "spatial_synchronization_techniques"}, {"score": 0.0046797114400479135, "phrase": "intermittent_spatiotemporal_transitions"}, {"score": 0.004651227191243587, "phrase": "human_brain"}, {"score": 0.004557520236983647, "phrase": "namely_maximum_lyapunov_exponents"}, {"score": 0.0044747919503484055, "phrase": "dynamical_analysis"}, {"score": 0.0044025116437190785, "phrase": "critical_sites"}, {"score": 0.0038803710796509227, "phrase": "seizure_points"}, {"score": 0.0037789720824759503, "phrase": "temporal_lobe_epilepsy"}, {"score": 0.0037027728311825156, "phrase": "possible_homeostatic_role"}, {"score": 0.0036503460615862574, "phrase": "normal_brain_activity"}, {"score": 0.003584025547693836, "phrase": "new_criterion"}, {"score": 0.0034620119220744347, "phrase": "criterion's_sensitivity"}, {"score": 0.00330349778864275, "phrase": "resetting_phenomena"}, {"score": 0.0032700071110068323, "phrase": "utilized_measures"}, {"score": 0.0032368548573650856, "phrase": "comparative_study"}, {"score": 0.0029113197873344757, "phrase": "subdural_and_depth_electrodes"}, {"score": 0.002881793492919646, "phrase": "focal_temporal_lobe_epilepsy"}, {"score": 0.0028293966058473476, "phrase": "optimization_theory"}, {"score": 0.0027218799769229596, "phrase": "preictal_entrainment"}, {"score": 0.0025918745925152423, "phrase": "significantly_higher_probability"}, {"score": 0.0025551364547568103, "phrase": "randomly_selected_non-seizure_points"}, {"score": 0.00253440193919629, "phrase": "eeg"}, {"score": 0.0024083881142747954, "phrase": "higher_probability"}, {"score": 0.0023742445871029615, "phrase": "dynamical_resetting"}, {"score": 0.002321563536990284, "phrase": "similar_probability"}, {"score": 0.0021049977753042253, "phrase": "novel_treatments"}], "paper_keywords": ["Quadratic binary programming", " Dynamical Synchronization", " Spatiotemporal transitions", " Epileptic seizure dynamics"], "paper_abstract": "Epileptic seizures are manifestations of intermittent spatiotemporal transitions of the human brain from chaos to order. Measures of chaos, namely maximum Lyapunov exponents (STL (max) ), from dynamical analysis of the electroencephalograms (EEGs) at critical sites of the epileptic brain, progressively converge (diverge) before (after) epileptic seizures, a phenomenon that has been called dynamical synchronization (desynchronization). This dynamical synchronization/desynchronization has already constituted the basis for the design and development of systems for long-term (tens of minutes), on-line, prospective prediction of epileptic seizures. Also, the criterion for the changes in the time constants of the observed synchronization/desynchronization at seizure points has been used to show resetting of the epileptic brain in patients with temporal lobe epilepsy (TLE), a phenomenon that implicates a possible homeostatic role for the seizures themselves to restore normal brain activity. In this paper, we introduce a new criterion to measure this resetting that utilizes changes in the level of observed synchronization/desynchronization. We compare this criterion's sensitivity of resetting with the old one based on the time constants of the observed synchronization/desynchronization. Next, we test the robustness of the resetting phenomena in terms of the utilized measures of EEG dynamics by a comparative study involving STL (max) , a measure of phase (phi (max) ) and a measure of energy (E) using both criteria (i.e. the level and time constants of the observed synchronization/desynchronization). The measures are estimated from intracranial electroencephalographic (iEEG) recordings with subdural and depth electrodes from two patients with focal temporal lobe epilepsy and a total of 43 seizures. Techniques from optimization theory, in particular quadratic bivalent programming, are applied to optimize the performance of the three measures in detecting preictal entrainment. It is shown that using either of the two resetting criteria, and for all three dynamical measures, dynamical resetting at seizures occurs with a significantly higher probability (alpha=0.05) than resetting at randomly selected non-seizure points in days of EEG recordings per patient. It is also shown that dynamical resetting at seizures using time constants of STL (max) synchronization/desynchronization occurs with a higher probability than using the other synchronization measures, whereas dynamical resetting at seizures using the level of synchronization/desynchronization criterion is detected with similar probability using any of the three measures of synchronization. These findings show the robustness of seizure resetting with respect to measures of EEG dynamics and criteria of resetting utilized, and the critical role it might play in further elucidation of ictogenesis, as well as in the development of novel treatments for epilepsy.", "paper_title": "Measuring resetting of brain dynamics at epileptic seizures: application of global optimization and spatial synchronization techniques", "paper_id": "WOS:000261952300006"}