{"auto_keywords": [{"score": 0.04678601157753345, "phrase": "outdoor_virtual_environments"}, {"score": 0.00481495049065317, "phrase": "eeg_data"}, {"score": 0.0038893838564184107, "phrase": "human_intervention"}, {"score": 0.003826007045267751, "phrase": "virtual_environments"}, {"score": 0.003682100144121148, "phrase": "physical_modalities"}, {"score": 0.0031240075437664314, "phrase": "virtual_journey"}, {"score": 0.0030064546577205403, "phrase": "portugal"}, {"score": 0.00294122712771669, "phrase": "slater_et_al"}, {"score": 0.0024679299547216956, "phrase": "typical_virtual_environment"}, {"score": 0.002323446065342625, "phrase": "plausibility_illusions"}, {"score": 0.0021874023741762496, "phrase": "similar_ves"}, {"score": 0.0021399277552314067, "phrase": "different_physical_modalities"}], "paper_keywords": [""], "paper_abstract": "Outdoor virtual environments (OVEs) are becoming increasingly popular, as they allow a sense of presence in places that are inaccessible or protected from human intervention. These virtual environments (VEs) need to address physical modalities other than vision and hearing. We analyze the influence of four different physical modalities (vision, hearing, haptics, and olfaction) on the sense of presence on a virtual journey through the sea and the Laurissilva Forest of Funchal, Portugal. We applied Slater et al.'s (2010) method together with data gathered by the Emotiv EPOC EEG in an OVE setting. In such a setting, the combination of haptics and hearing are more important than the typical virtual environment (vision and hearing) in terms of place and plausibility illusions. Our analysis is particularly important for designers interested in crafting similar VEs because we classify different physical modalities according to their importance in enhancing presence.", "paper_title": "Combining EEG Data with Place and Plausibility Responses as an Approach to Measuring Presence in Outdoor Virtual Environments", "paper_id": "WOS:000351287300003"}