{"auto_keywords": [{"score": 0.04236229614109246, "phrase": "biomedical_literature"}, {"score": 0.03318372717255817, "phrase": "unsupervised_approach"}, {"score": 0.00481495049065317, "phrase": "information_structure"}, {"score": 0.004785022360244881, "phrase": "biomedical_documents"}, {"score": 0.004623696669036629, "phrase": "text_mining_technique"}, {"score": 0.004537994679433309, "phrase": "biomedical_articles"}, {"score": 0.004467785611058897, "phrase": "different_types"}, {"score": 0.004210714223341684, "phrase": "highly_useful_technique"}, {"score": 0.004119762981892093, "phrase": "biomedical_text_mining_tasks"}, {"score": 0.003931402465972151, "phrase": "highly_time-consuming_process"}, {"score": 0.0037282779842373486, "phrase": "promising_results"}, {"score": 0.0037050791019670325, "phrase": "real-world_biomedical_tasks"}, {"score": 0.003647709172212356, "phrase": "existing_approaches"}, {"score": 0.0035356111195810483, "phrase": "hand-annotated_training_sentences"}, {"score": 0.0033950003609696227, "phrase": "considerable_domain_variation"}, {"score": 0.003239669066247637, "phrase": "biomedical_domains"}, {"score": 0.0030245745670310835, "phrase": "large_corpus"}, {"score": 0.0030057412068719646, "phrase": "biomedical_abstracts"}, {"score": 0.002977716368766307, "phrase": "pubmed"}, {"score": 0.002491999073961151, "phrase": "practical_tasks"}, {"score": 0.0023778841785229835, "phrase": "wide_range"}, {"score": 0.0022903576812801432, "phrase": "unsupervised_learning"}, {"score": 0.0022760856906838814, "phrase": "novel_insights"}, {"score": 0.0022268288922192704, "phrase": "information_categories"}, {"score": 0.0021049977753042253, "phrase": "annotated_corpus"}], "paper_keywords": [""], "paper_abstract": "Motivation: Information structure (IS) analysis is a text mining technique, which classifies text in biomedical articles into categories that capture different types of information, such as objectives, methods, results and conclusions of research. It is a highly useful technique that can support a range of Biomedical Text Mining tasks and can help readers of biomedical literature find information of interest faster, accelerating the highly time-consuming process of literature review. Several approaches to IS analysis have been presented in the past, with promising results in real-world biomedical tasks. However, all existing approaches, even weakly supervised ones, require several hundreds of hand-annotated training sentences specific to the domain in question. Because biomedicine is subject to considerable domain variation, such annotations are expensive to obtain. This makes the application of IS analysis across biomedical domains difficult. In this article, we investigate an unsupervised approach to IS analysis and evaluate the performance of several unsupervised methods on a large corpus of biomedical abstracts collected from PubMed. Results: Our best unsupervised algorithm (multilevel-weighted graph clustering algorithm) performs very well on the task, obtaining over 0.70 F scores for most IS categories when applied to well-known IS schemes. This level of performance is close to that of lightly supervised IS methods and has proven sufficient to aid a range of practical tasks. Thus, using an unsupervised approach, IS could be applied to support a wide range of tasks across sub-domains of biomedicine. We also demonstrate that unsupervised learning brings novel insights into IS of biomedical literature and discovers information categories that are not present in any of the existing IS schemes. Availability and Implementation: The annotated corpus and software are available at http://www.cl.cam.ac.uk/similar to dk427/bio14info.html.", "paper_title": "Unsupervised discovery of information structure in biomedical documents", "paper_id": "WOS:000352269500014"}