{"auto_keywords": [{"score": 0.02928670682343867, "phrase": "bioqsar"}, {"score": 0.00481495049065317, "phrase": "protein-protein_binding_affinity"}, {"score": 0.004770211811866158, "phrase": "quantitative_structure-activity_relationship"}, {"score": 0.00453144352814823, "phrase": "statistical_correlation"}, {"score": 0.004489327204473076, "phrase": "structure_feature"}, {"score": 0.004447600571127578, "phrase": "apparent_behavior"}, {"score": 0.004344965512058521, "phrase": "congeneric_molecules"}, {"score": 0.00329813918116714, "phrase": "proof-of-concept_paradigm"}, {"score": 0.0031475032122226, "phrase": "binding_affinity"}, {"score": 0.0028133741785871867, "phrase": "modeling_performance"}, {"score": 0.002787181295054319, "phrase": "predictive_power"}, {"score": 0.00263505298504827, "phrase": "traditional_knowledge-based_strategies"}, {"score": 0.0026105159490849364, "phrase": "mechanism-type_methods"}, {"score": 0.0025862068041567934, "phrase": "empirical_scoring_algorithms"}, {"score": 0.002479579797152119, "phrase": "traditional_methods"}, {"score": 0.002333258365963463, "phrase": "bioqsar_scheme"}, {"score": 0.0022475295254231714, "phrase": "biological_behavior"}, {"score": 0.0021049977753042253, "phrase": "modeled_structures"}], "paper_keywords": ["Biomacromolecular quantitative structure-activity relationship", " Protein-protein interaction", " Regression modeling", " Affinity prediction"], "paper_abstract": "Quantitative structure-activity relationship (QSAR), a regression modeling methodology that establishes statistical correlation between structure feature and apparent behavior for a series of congeneric molecules quantitatively, has been widely used to evaluate the activity, toxicity and property of various small-molecule compounds such as drugs, toxicants and surfactants. However, it is surprising to see that such useful technique has only very limited applications to biomacromolecules, albeit the solved 3D atom-resolution structures of proteins, nucleic acids and their complexes have accumulated rapidly in past decades. Here, we present a proof-of-concept paradigm for the modeling, prediction and interpretation of the binding affinity of 144 sequence-nonredundant, structure-available and affinity-known protein complexes (Kastritis et al. Protein Sci 20:482-491, 2011) using a biomacromolecular QSAR (BioQSAR) scheme. We demonstrate that the modeling performance and predictive power of BioQSAR are comparable to or even better than that of traditional knowledge-based strategies, mechanism-type methods and empirical scoring algorithms, while BioQSAR possesses certain additional features compared to the traditional methods, such as adaptability, interpretability, deep-validation and high-efficiency. The BioQSAR scheme could be readily modified to infer the biological behavior and functions of other biomacromolecules, if their X-ray crystal structures, NMR conformation assemblies or computationally modeled structures are available.", "paper_title": "Biomacromolecular quantitative structure-activity relationship (BioQSAR): a proof-of-concept study on the modeling, prediction and interpretation of protein-protein binding affinity", "paper_id": "WOS:000315045400005"}