{"auto_keywords": [{"score": 0.03780999217534513, "phrase": "ricci_flow"}, {"score": 0.01543806385940299, "phrase": "non-euclidean_dissimilarity_data"}, {"score": 0.004815160280960872, "phrase": "ricci"}, {"score": 0.0046177184315395955, "phrase": "curvature_regularisation"}, {"score": 0.004475436844227947, "phrase": "pattern_recognition"}, {"score": 0.004190573309193078, "phrase": "euclidean"}, {"score": 0.0041445748748895365, "phrase": "statistical_learning_algorithms"}, {"score": 0.004084372444216856, "phrase": "euclidean_dissimilarities"}, {"score": 0.0039665679106594106, "phrase": "consistent_euclidean_geometry"}, {"score": 0.0037684961730030235, "phrase": "available_algorithms"}, {"score": 0.0032314884215434857, "phrase": "locally_uniform_curvature"}, {"score": 0.003081272473508291, "phrase": "raw_dissimilarities"}, {"score": 0.0030476078950483158, "phrase": "geodesic_distances"}, {"score": 0.002992313172550772, "phrase": "rectified_euclidean_dissimilarities"}, {"score": 0.002895291306821514, "phrase": "curved_manifold"}, {"score": 0.002853183476661506, "phrase": "individual_patch_curvatures"}, {"score": 0.0026419338604879404, "phrase": "surface_patches"}, {"score": 0.0024462867877027435, "phrase": "different_surface_patches"}, {"score": 0.0022734117274137468, "phrase": "different_algorithmic_components"}, {"score": 0.0022568093356079414, "phrase": "i.e._ricci_flow"}, {"score": 0.0021676351850669017, "phrase": "essential_step"}, {"score": 0.0021049977753042253, "phrase": "piecewise_arrangement"}], "paper_keywords": ["Non-Euclidean pairwise data", " Similarity", " Metric", " Ricci flow", " Embedding"], "paper_abstract": "Pairwise dissimilarity representations are frequently used as an alternative to feature vectors in pattern recognition. One of the problems encountered in the analysis of such data is that the dissimilarities are rarely Euclidean, while statistical learning algorithms often rely on Euclidean dissimilarities. Such non-Euclidean dissimilarities are often corrected or a consistent Euclidean geometry is imposed on them via embedding. This paper commences by reviewing the available algorithms for analysing non-Euclidean dissimilarity data. The novel contribution is to show how the Ricci flow can be used to embed and rectify non-Euclidean dissimilarity data. According to our representation, the data is distributed over a manifold consisting of patches. Each patch has a locally uniform curvature, and this curvature is iteratively modified by the Ricci flow. The raw dissimilarities are the geodesic distances on the manifold. Rectified Euclidean dissimilarities are obtained using the Ricci flow to flatten the curved manifold by modifying the individual patch curvatures. We use two algorithmic components to implement this idea. Firstly, we apply the Ricci flow independently to a set of surface patches that cover the manifold. Second, we use curvature regularisation to impose consistency on the curvatures of the arrangement of different surface patches. We perform experiments on three real world datasets, and use these to determine the importance of the different algorithmic components, i.e. Ricci flow and curvature regularisation. We conclude that curvature regularisation is an essential step needed to control the stability of the piecewise arrangement of patches under the Ricci flow. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Ricci flow embedding for rectifying non-Euclidean dissimilarity data", "paper_id": "WOS:000340335600017"}