{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "social_network_sites"}, {"score": 0.008664962014630392, "phrase": "offline_settings"}, {"score": 0.004243552607799184, "phrase": "professional_counterparts"}, {"score": 0.004068510313497539, "phrase": "growing_number"}, {"score": 0.004025885154716127, "phrase": "cscw_studies"}, {"score": 0.002740253546178098, "phrase": "online_collaboration"}, {"score": 0.002697245874076643, "phrase": "collaboration_shifts"}, {"score": 0.0024272350606639147, "phrase": "novel_finding"}, {"score": 0.002376559242152662, "phrase": "previous_work"}, {"score": 0.0021049977753042253, "phrase": "design_factors"}], "paper_keywords": ["amateurs", " bodybuilding", " career", " celebrities", " collaboration", " community", " leisure", " passion", " professionals", " social network sites"], "paper_abstract": "Amateurs are found in arts, sports, or entertainment, where they are linked with professional counterparts and inspired by celebrities. Despite the growing number of CSCW studies in amateur and professional domains, little is known about how technologies facilitate collaboration between these groups. Drawing from a 1.5-year field study in the domain of bodybuilding, this paper describes the collaboration between and within amateurs, professionals, and celebrities on social network sites. Social network sites help individuals to improve their performance in competitions, extend their support network, and gain recognition for their achievements. The findings show that amateurs benefit the most from online collaboration, whereas collaboration shifts from social network sites to offline settings as individuals develop further in their professional careers. This shift from online to offline settings constitutes a novel finding, which extends previous work on social network sites that has looked at groups of amateurs and professionals in isolation. As a contribution to practice, we highlight design factors that address this shift to offline settings and foster collaboration between and within groups.", "paper_title": "Collaboration on Social Network Sites: Amateurs, Professionals and Celebrities", "paper_id": "WOS:000284271200002"}