{"auto_keywords": [{"score": 0.04839718571524074, "phrase": "laplacian"}, {"score": 0.00481495049065317, "phrase": "uniform_hypergraph"}, {"score": 0.00446490613141384, "phrase": "k-uniform_hypergraph"}, {"score": 0.00435971969507033, "phrase": "real_parts"}, {"score": 0.00405873677211836, "phrase": "real_part"}, {"score": 0.003573859492987647, "phrase": "spectral_radii"}, {"score": 0.003531474887552889, "phrase": "nonnegative_tensors"}, {"score": 0.003313741359811683, "phrase": "spectral_components"}, {"score": 0.003248483521309273, "phrase": "vice_verse"}, {"score": 0.0032099453192629976, "phrase": "smallest_h-eigenvalue"}, {"score": 0.0029060170624404242, "phrase": "largest_h-eigenvalue"}, {"score": 0.0024488738006005133, "phrase": "flower_hearts"}, {"score": 0.002225691463551672, "phrase": "connected_components"}, {"score": 0.0021049978275466293, "phrase": "lapalacian"}], "paper_keywords": ["Tensor", " Eigenvalue", " Hypergraph", " Laplacian"], "paper_abstract": "In this paper, we investigate the Laplacian, i.e., the normalized Laplacian tensor of a k-uniform hypergraph. We show that the real parts of all the eigenvalues of the Laplacian are in the interval [0, 2], and the real part is zero (respectively two) if and only if the eigenvalue is zero (respectively two). All the H+-eigenvalues of the Laplacian and all the smallest H+-eigenvalues of its sub-tensors are characterized through the spectral radii of some nonnegative tensors. All the H+-eigenvalues of the Laplacian that are less than one are completely characterized by the spectral components of the hypergraph and vice verse. The smallest H-eigenvalue, which is also an H+-eigenvalue, of the Laplacian is zero. When k is even, necessary and sufficient conditions for the largest H-eigenvalue of the Laplacian being two are given. If k is odd, then its largest H-eigenvalue is always strictly less than two. The largest H+-eigenvalue of the Laplacian for a hypergraph having at least one edge is one; and its nonnegative eigenvectors are in one to one correspondence with the flower hearts of the hypergraph. The second smallest H+-eigenvalue of the Laplacian is positive if and only if the hypergraph is connected. The number of connected components of a hypergraph is determined by the H+-geometricmultiplicity of the zero H+-eigenvalue of the Lapalacian.", "paper_title": "The Laplacian of a uniform hypergraph", "paper_id": "WOS:000350685200001"}