{"auto_keywords": [{"score": 0.04965333175972822, "phrase": "health-care_administrators"}, {"score": 0.00481495049065317, "phrase": "hospital_using_health_insurance_claims"}, {"score": 0.004344855841195913, "phrase": "largest_component"}, {"score": 0.004306205029641728, "phrase": "health_expenditure"}, {"score": 0.004229927464182562, "phrase": "earlier_identification"}, {"score": 0.004154995396099332, "phrase": "higher_risk"}, {"score": 0.0039380388343479384, "phrase": "better_plans"}, {"score": 0.0036991458715587163, "phrase": "large-scale_health_insurance_claims_data"}, {"score": 0.0035851703423654432, "phrase": "hospitalization_days"}, {"score": 0.003459191419478298, "phrase": "regression_decision_tree_algorithm"}, {"score": 0.003397866151093552, "phrase": "insurance_claim_data"}, {"score": 0.003107117564014497, "phrase": "hospital_admissions"}, {"score": 0.0030113280682863234, "phrase": "proposed_method"}, {"score": 0.002944715025443487, "phrase": "general_population"}, {"score": 0.0028032928749970026, "phrase": "proposed_model"}, {"score": 0.00269263690712392, "phrase": "constant_number"}, {"score": 0.002418393046947528, "phrase": "reasonable_predictive_accuracy"}, {"score": 0.0023333173799963795, "phrase": "whole_population"}, {"score": 0.0021049977753042253, "phrase": "medical_information"}], "paper_keywords": ["Australia", " big data", " health care", " health insurance claims", " hospitalizations", " predictive modeling"], "paper_abstract": "Health-care administrators worldwide are striving to lower the cost of care while improving the quality of care given. Hospitalization is the largest component of health expenditure. Therefore, earlier identification of those at higher risk of being hospitalized would help health-care administrators and health insurers to develop better plans and strategies. In this paper, a method was developed, using large-scale health insurance claims data, to predict the number of hospitalization days in a population. We utilized a regression decision tree algorithm, along with insurance claim data from 242 075 individuals over three years, to provide predictions of number of days in hospital in the third year, based on hospital admissions and procedure claims data. The proposed method performs well in the general population as well as in subpopulations. Results indicate that the proposed model significantly improves predictions over two established baseline methods (predicting a constant number of days for each customer and using the number of days in hospital of the previous year as the forecast for the following year). A reasonable predictive accuracy (AUC = 0.843) was achieved for the whole population. Analysis of two subpopulations-namely elderly persons aged 63 years or older in 2011 and patients hospitalized for at least one day in the previous year-revealed that the medical information (e.g., diagnosis codes) contributed more to predictions for these two subpopulations, in comparison to the population as a whole.", "paper_title": "Predicting Days in Hospital Using Health Insurance Claims", "paper_id": "WOS:000358620500005"}