{"auto_keywords": [{"score": 0.03782349251688888, "phrase": "sequential_mode"}, {"score": 0.037067940292278834, "phrase": "priority_relation"}, {"score": 0.024991495539818616, "phrase": "derivation_step"}, {"score": 0.010522354867215785, "phrase": "parikh_sets"}, {"score": 0.010306321440193184, "phrase": "context-free_matrix_grammars"}, {"score": 0.009928465580783046, "phrase": "maximally_parallel_mode"}, {"score": 0.009524694865678618, "phrase": "computational_completeness"}, {"score": 0.00481495049065317, "phrase": "unit_rules"}, {"score": 0.004618166136069052, "phrase": "new_variant"}, {"score": 0.004579780586951551, "phrase": "membrane_systems"}, {"score": 0.004266067096140677, "phrase": "energy_value"}, {"score": 0.003940706575253453, "phrase": "successful_computation"}, {"score": 0.0038112201846057445, "phrase": "energy_values"}, {"score": 0.003418958653159371, "phrase": "universal_computational_power"}, {"score": 0.0028209599545587745, "phrase": "corresponding_model"}, {"score": 0.0027974705482714884, "phrase": "tissue_p_systems"}], "paper_keywords": ["computational completeness", " matrix grammars", " membrane computing", " P systems"], "paper_abstract": "We introduce a new variant of membrane systems where the rules are directly assigned to membranes and, moreover, every membrane carries an energy value that can be changed during a computation by objects passing through the membrane. The result of a successful computation is considered to be the distribution of energy values carried by the membranes. We show that for systems working in the sequential mode with a kind of priority relation on the rules we already obtain universal computational power. When omitting the priority relation, we obtain a characterization of the family of Parikh sets of languages generated by context-free matrix grammars. On the other hand, when using the maximally parallel mode, we do not need a priority relation to obtain computational completeness. Finally, we introduce the corresponding model of tissue P systems with energy assigned to the membrane of each cell and objects moving from one cell to another one in the environment as well as being able to change the energy of a cell when entering or leaving the cell. In each derivation step, only one object may pass through the membrane of each cell. When using priorities on the rules in the sequential mode (where in each derivation step only one cell is affected) as well as without priorities in the maximally parallel mode (where in each derivation step all cells possible are affected) we again obtain computational completeness, whereas without priorities on the rules in the sequential mode we only get a characterization of the family of Parikh sets of languages generated by context-free matrix grammars.", "paper_title": "(Tissue) P systems with unit rules and energy assigned to membranes", "paper_id": "WOS:000243831500002"}