{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "chinese_high-tech_manufacturing_companies"}, {"score": 0.009037158358445738, "phrase": "case_companies"}, {"score": 0.0071725557531390986, "phrase": "operational_competitiveness"}, {"score": 0.006520491344686239, "phrase": "preliminary_analytical_models"}, {"score": 0.0052608200279601215, "phrase": "manufacturing_strategies"}, {"score": 0.004376273644295806, "phrase": "development_route"}, {"score": 0.00401560412621627, "phrase": "competitiveness_analysis"}, {"score": 0.003902085339580381, "phrase": "operational_competitiveness_strategies"}, {"score": 0.0035632774896594524, "phrase": "analytic_hierarchy_process_method"}, {"score": 0.0034625012596827334, "phrase": "leading_companies"}, {"score": 0.003455052189217975, "phrase": "chinese_culture"}, {"score": 0.0033645655483989746, "phrase": "defender_groups"}, {"score": 0.00311669276800628, "phrase": "case_studies"}, {"score": 0.0030140547908298404, "phrase": "operational_competitiveness_manufacturing_strategies"}, {"score": 0.002791932344920906, "phrase": "practical_implications"}, {"score": 0.002648768009464535, "phrase": "different_development_phase"}, {"score": 0.002611010097359509, "phrase": "different_weights"}, {"score": 0.0025861368747446324, "phrase": "important_factors"}], "paper_keywords": ["Competitive strategy", " Strategic manufacturing", " Manufacturing systems", " Benchmarking", " Analytical hierarchy process", " China"], "paper_abstract": "Purpose - The purpose of this paper is to study the operational competitiveness and identify the development route of Chinese high-tech manufacturing companies by comparing with other similar international manufacturing companies of global manufacturing strategies database. Design/methodology/approach - The preliminary analytical models for competitiveness analysis are used to analyze the operational competitiveness strategies in three different types of Chinese high-tech manufacturing companies based on the weights of the multi-criteria manufacturing strategies, which are calculated using analytic hierarchy process method. Benchmarking between case companies and leading companies of prospector, analyzer and defender groups is applied to evaluate the manufacturing strategies further. Findings - As a result of the case studies, it is possible to understand operational competitiveness manufacturing strategies for the case companies, to show one development route for Chinese high-tech manufacturing companies to be competitive in their markets. Practical implications - Chinese high-tech manufacturing companies have their own operational strategies in different development phase. The different weights of important factors such as quality, cost, time and flexibility make the case companies to have some advantages in prospector, analyzer and defender. The preliminary analytical models are effective for Chinese high-tech manufacturing companies to calculate their operational competitiveness under the influence of Chinese culture and macro-control. Originality/value - Benchmarking of operational competitiveness is presented to evaluate the manufacturing strategies in this paper. One development route of Chinese high-tech manufacturing companies, which is under the influence of Chinese culture and macro-control, is promoted.", "paper_title": "Competitiveness of Chinese high-tech manufacturing companies in global context", "paper_id": "WOS:000266141200007"}