{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "high-fidelity_virtual_environments"}, {"score": 0.010964160720164338, "phrase": "human_visual_system"}, {"score": 0.004778258911940497, "phrase": "physically-based_computer_graphics"}, {"score": 0.004529093447865156, "phrase": "real_environments"}, {"score": 0.004375789703278455, "phrase": "even_simple_scenes"}, {"score": 0.004211504818267892, "phrase": "single_frame"}, {"score": 0.0041001740903338834, "phrase": "interactive_virtual_environment"}, {"score": 0.003976523732243618, "phrase": "parallel_processing"}, {"score": 0.0037834649508375544, "phrase": "sufficient_processors"}, {"score": 0.003669330508576073, "phrase": "suitably_sized_cluster"}, {"score": 0.0035586268203884673, "phrase": "parallel_rendering"}, {"score": 0.00346449481422526, "phrase": "parallel_solution"}, {"score": 0.003196738066062757, "phrase": "hvs"}, {"score": 0.0029951555610569225, "phrase": "virtual_environment"}, {"score": 0.00283870598459543, "phrase": "real_scene"}, {"score": 0.002579326836642461, "phrase": "highest_quality"}, {"score": 0.0023435920614377306, "phrase": "quality_difference"}, {"score": 0.002290291401956985, "phrase": "rendering_framework"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["parallel rendering", " there-reality", " global illumination", " high-fidelity graphics", " realism in real-time", " selective rendering"], "paper_abstract": "Physically-based computer graphics offers the potential of achieving high-fidelity virtual environments in which the propagation of light in real environments is accurately simulated. However, such global illumination computations for even simple scenes may take many seconds and even longer to render a single frame, currently precluding their use in any interactive virtual environment, which requires many frames per second. Parallel processing is one solution, but it simply may not be feasible to have sufficient processors available. Furthermore, even if a suitably sized cluster is present, the overheads associated with parallel rendering may begin to dominate restricting the parallel solution to a subset of the cluster. The human visual system (HVS) provides us with our visual sensory input, but while the HVS is good, it is not perfect. If we wish to invoke, in a virtual environment, the same perceptual response in viewers as if they were actually there in the real scene, then only those parts of an environment that are actually attended to by a viewer at any point of time need be calculated at the highest quality. The remainder of the image can be calculated at a much lower quality, and with much less computational expense, without the user being aware of this quality difference. This paper presents a rendering framework which exploits parallel processing and knowledge of the human visual system to provide a means of rendering high-fidelity virtual environments. (c) 2007 Elsevier B.V. All rights reserved.", "paper_title": "Parallel selective rendering of high-fidelity virtual environments", "paper_id": "WOS:000247389800002"}