{"auto_keywords": [{"score": 0.026277964184320705, "phrase": "changerate"}, {"score": 0.00481495049065317, "phrase": "schedule_webpage_updates"}, {"score": 0.0046848707075530256, "phrase": "web_search_engine"}, {"score": 0.004335000368745273, "phrase": "web_crawler"}, {"score": 0.0040479661688863884, "phrase": "previously_crawled_webpage"}, {"score": 0.003449718244515019, "phrase": "updated_versions"}, {"score": 0.003356396922662246, "phrase": "genetic_programming_framework"}, {"score": 0.0032064196784562017, "phrase": "score_functions"}, {"score": 0.0031627430133087616, "phrase": "accurate_rankings"}, {"score": 0.0028600623410146796, "phrase": "large_dataset"}, {"score": 0.002782647772219627, "phrase": "brazilian_web"}, {"score": 0.0027322025124213566, "phrase": "multiple_performance_metrics"}, {"score": 0.0026220103561723045, "phrase": "different_sets"}, {"score": 0.0025744696954056404, "phrase": "fitness_functions"}, {"score": 0.0023386327847292805, "phrase": "objective_function"}, {"score": 0.0023173287402646577, "phrase": "evaluation_metric"}, {"score": 0.002203576191888742, "phrase": "ndcg"}, {"score": 0.0021049977753042253, "phrase": "scheduling_strategies"}], "paper_keywords": ["Web crawling", " Scheduling functions", " Genetic Programming"], "paper_abstract": "The quality of a Web search engine is influenced by several factors, including coverage and the freshness of the content gathered by the web crawler. Focusing particularly on freshness, one key challenge is to estimate the likelihood of a previously crawled webpage being modified. Such estimates are used to define the order in which those pages should be visited, and thus, can be exploited to reduce the cost of monitoring crawled webpages for keeping updated versions. We here present a Genetic Programming framework, called -Genetic Programming for Crawling, to generate score functions that produce accurate rankings of pages regarding their probabilities of having been modified. We compare with state-of-the-art methods using a large dataset of webpages crawled from the Brazilian Web. Our evaluation includes multiple performance metrics and several variations of our framework, built from exploring different sets of terminals and fitness functions. In particular, we evaluate using the ChangeRate and Normalized Discounted Cumulative Gain (NDCG) metrics as both objective function and evaluation metric. We show that, in comparison with ChangeRate, NDCG has the ability of better evaluating the effectiveness of scheduling strategies, since it is able to take the ranking produced by the scheduling into account.", "paper_title": "A genetic programming framework to schedule webpage updates", "paper_id": "WOS:000348350600004"}