{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "multiple_physiological_systems"}, {"score": 0.04226255901245674, "phrase": "walking_conditions"}, {"score": 0.03494794829412794, "phrase": "gait-monitoring_device"}, {"score": 0.0045748683993128425, "phrase": "gait_function"}, {"score": 0.004346704947011699, "phrase": "subclinical_physiological_abnormalities"}, {"score": 0.003923815926819606, "phrase": "physiological_systems"}, {"score": 0.00384731849108269, "phrase": "locomotor_system"}, {"score": 0.003500313767208306, "phrase": "android-based_gait-monitoring_device"}, {"score": 0.003378385493203297, "phrase": "patient's_physiological_systems"}, {"score": 0.003260690513595527, "phrase": "self-regulated_overground_walking_sessions"}, {"score": 0.0030494153169181334, "phrase": "patient's_stride_interval"}, {"score": 0.0029781530607129653, "phrase": "skin_conductance"}, {"score": 0.0029547698888028697, "phrase": "respiratory_rate"}, {"score": 0.0028630535573013686, "phrase": "android_phone"}, {"score": 0.002594342451017822, "phrase": "multisystem_physiological_interactions"}, {"score": 0.0025436978068459565, "phrase": "healthy_subjects"}, {"score": 0.002474447780553576, "phrase": "locomotion-respiratory_and_cardiolocomotion_couplings"}, {"score": 0.00241658945942583, "phrase": "strong_interactions"}, {"score": 0.00238816839721704, "phrase": "locomotion_system"}, {"score": 0.0022333012657436307, "phrase": "multisystem_interactions"}, {"score": 0.002155412043665635, "phrase": "older_adults"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Gait monitoring", " Gait accelerometry signals", " Stride intervals", " Electrocardiogram", " Skin conductance", " Respiratory rate"], "paper_abstract": "Gait function is traditionally assessed using well-lit, unobstructed walkways with minimal distractions. In patients with subclinical physiological abnormalities, these conditions may not provide enough stress on their ability to adapt to walking. The introduction of challenging walking conditions in gait can induce responses in physiological systems in addition to the locomotor system. There is a need for a device that is capable of monitoring multiple physiological systems in various walking conditions. To address this need, an Android-based gait-monitoring device was developed that enabled the recording of a patient's physiological systems during walking. The gait-monitoring device was tested during self-regulated overground walking sessions of fifteen healthy subjects that included 6 females and 9 males aged 18-35 years. The gait-monitoring device measures the patient's stride interval, acceleration, electrocardiogram, skin conductance and respiratory rate. The data is stored on an Android phone and is analyzed offline through the extraction of features in the time, frequency and time-frequency domains. The analysis of the data depicted multisystem physiological interactions during overground walking in healthy subjects. These interactions included locomotion-electrodermal, locomotion-respiratory and cardiolocomotion couplings. The current results depicting strong interactions between the locomotion system and the other considered systems (i.e., electrodermal, respiratory and cardiovascular systems) warrant further investigation into multisystem interactions during walking, particularly in challenging walking conditions with older adults. (C) 2015 Elsevier Ireland Ltd. All rights reserved.", "paper_title": "Assessing interactions among multiple physiological systems during walking outside a laboratory: An Android based gait monitor", "paper_id": "WOS:000364991800014"}