{"auto_keywords": [{"score": 0.04274518365190482, "phrase": "density_distribution"}, {"score": 0.015719716506582538, "phrase": "symmetric_neighborhood_relationship"}, {"score": 0.004625255533545965, "phrase": "exceptional_objects"}, {"score": 0.004383852039913171, "phrase": "classical_outlier_analysis_algorithms"}, {"score": 0.004229927464182562, "phrase": "local_outliers"}, {"score": 0.003382704886584695, "phrase": "density_distributions"}, {"score": 0.0031210475158175432, "phrase": "sparse_cluster"}, {"score": 0.0030656984915295275, "phrase": "denser_cluster"}, {"score": 0.002984504445973107, "phrase": "wrong_estimation"}, {"score": 0.002841176824012961, "phrase": "simple_but_effective_measure"}, {"score": 0.002716844480081738, "phrase": "proposed_measure"}, {"score": 0.0026686444508167875, "phrase": "reverse_neighbors"}, {"score": 0.0023437863565921053, "phrase": "top-n_outliers"}, {"score": 0.0022816681646340518, "phrase": "comprehensive_performance_evaluation"}, {"score": 0.0021049977753042253, "phrase": "ranking_outliers"}], "paper_keywords": [""], "paper_abstract": "Mining outliers in database is to find exceptional objects that deviate from the rest of the data set. Besides classical outlier analysis algorithms, recent studies have focused on mining local outliers, i.e., the outliers that have density distribution significantly different from their neighborhood. The estimation of density distribution at the location of an object has so far been based on the density distribution of its k-nearest neighbors [2, 11]. However, when outliers are in the location where the density distributions in the neighborhood are significantly different, for example, in the case of objects from a sparse cluster close to a denser cluster, this may result in wrong estimation. To avoid this problem, here we propose a simple but effective measure on local outliers based on a symmetric neighborhood relationship. The proposed measure considers both neighbors and reverse neighbors of an object when estimating its density distribution. As a result, outliers so discovered are more meaningful. To compute such local outliers efficiently, several mining algorithms are developed that detects top-n outliers based on our definition. A comprehensive performance evaluation and analysis shows that our methods are not only efficient in the computation but also more effective in ranking outliers.", "paper_title": "Ranking outliers using symmetric neighborhood relationship", "paper_id": "WOS:000237249600068"}