{"auto_keywords": [{"score": 0.04072472046898861, "phrase": "human_observer"}, {"score": 0.0372923141609903, "phrase": "existing_comparison_metrics"}, {"score": 0.03621124273828244, "phrase": "perception-oriented_metrics"}, {"score": 0.03423057083405171, "phrase": "subjective_data"}, {"score": 0.03377461058491815, "phrase": "mesh_metrics"}, {"score": 0.03350385361339115, "phrase": "comparison_results"}, {"score": 0.03200871379781005, "phrase": "perception-correlated_metrics"}, {"score": 0.03183711401024131, "phrase": "perception-oriented_mesh_processing_algorithms"}, {"score": 0.004815229355238149, "phrase": "static"}, {"score": 0.004788416208637939, "phrase": "dynamic_triangle_meshes"}, {"score": 0.004722715450671519, "phrase": "processing_procedures"}, {"score": 0.004581315009194603, "phrase": "polygonal_meshes"}, {"score": 0.004493535274957768, "phrase": "mesh_watermarking"}, {"score": 0.0040454315047320204, "phrase": "final_purpose"}, {"score": 0.003945993835171648, "phrase": "final_consumer"}, {"score": 0.0038171874077517274, "phrase": "introduced_appearance_change"}, {"score": 0.0036317896279485346, "phrase": "processing_algorithms"}, {"score": 0.0023976997077055193, "phrase": "distorted_versions"}, {"score": 0.002377859325230963, "phrase": "horse_model"}, {"score": 0.0022004029656808224, "phrase": "wang_et_al"}, {"score": 0.002152743048137834, "phrase": "laplacian"}, {"score": 0.0021065661730245455, "phrase": "gaussian"}], "paper_keywords": ["metric", " distortion", " perception", " mesh", " surface", " evaluation", " watermarking", " compression", " simplification", " human vision", " animation", " comparison"], "paper_abstract": "Almost all mesh processing procedures cause some more or less visible changes in the appearance of objects represented by polygonal meshes. In many cases, such as mesh watermarking, simplification or lossy compression, the objective is to make the change in appearance negligible, or as small as possible, given some other constraints. Measuring the amount of distortion requires taking into account the final purpose of the data. In many applications, the final consumer of the data is a human observer, and therefore the perceptibility of the introduced appearance change by a human observer should be the criterion that is taken into account when designing and configuring the processing algorithms. In this review, we discuss the existing comparison metrics for static and dynamic (animated) triangle meshes. We describe the concepts used in perception-oriented metrics used for 2D image comparison, and we show how these concepts are employed in existing 3D mesh metrics. We describe the character of subjective data used for evaluation of mesh metrics and provide comparison results identifying the advantages and drawbacks of each method. Finally, we also discuss employing the perception-correlated metrics in perception-oriented mesh processing algorithms. Please use and the following text for graphical abstract: In this review, we discuss the existing comparison metrics for static and dynamic (animated) triangle meshes. We describe the concepts used in perception-oriented metrics used for 2D image comparison, and we show how these concepts are employed in existing 3D mesh metrics. We describe the character of subjective data used for evaluation of mesh metrics and provide comparison results identifying the advantages and drawbacks of each method. Finally, we also discuss employing the perception-correlated metrics in perception-oriented mesh processing algorithms. 1 Original and distorted versions of the Horse model, all associated with the same maximum root mean square error (MRMS= 1.05 x 10 3). (a) Original model. Results after (b) watermarking from Wang et al. [], (c) Laplacian smoothing [], (d) Gaussian noise addition.", "paper_title": "Perceptual Metrics for Static and Dynamic Triangle Meshes", "paper_id": "WOS:000315301700009"}