{"auto_keywords": [{"score": 0.04465437822965506, "phrase": "multifractal_features"}, {"score": 0.03979407927752078, "phrase": "price-volume_correlation"}, {"score": 0.03948873725908261, "phrase": "china_metal_futures_market"}, {"score": 0.02246846748295754, "phrase": "multifractal"}, {"score": 0.012597443656963695, "phrase": "empirical_test"}, {"score": 0.012012676196644517, "phrase": "comparative_analysis"}, {"score": 0.00481495049065317, "phrase": "metal_futures_market"}, {"score": 0.004757643419056999, "phrase": "multifractal_detrended_cross-correlation_analysis"}, {"score": 0.003640730820018083, "phrase": "time_and_space_dimensions"}, {"score": 0.0035403060198952244, "phrase": "metals_futures_market_behavior"}, {"score": 0.003361069456060196, "phrase": "detrended_cross-correlation_analysis"}, {"score": 0.003178147973814818, "phrase": "statistical_physics"}, {"score": 0.002922207118572208, "phrase": "long_range_correlation"}, {"score": 0.002898930717812433, "phrase": "non-gaussian_probability_distribution"}, {"score": 0.0024901940672239784, "phrase": "mature_lme_metal_futures_markets"}, {"score": 0.002373472641477602, "phrase": "paper's_conclusions"}, {"score": 0.0023171750718791713, "phrase": "nonlinear_dependency_relationship"}, {"score": 0.0022987068521717765, "phrase": "potential_dynamics_mechanism"}, {"score": 0.002262209824105154, "phrase": "keywords_china"}, {"score": 0.00217430393740921, "phrase": "metal"}], "paper_keywords": ["China", " Futures markets", " Prices", " Stock returns", " Metal futures", " Price-volume correlation", " Multifractal detrended cross-correlation analysis", " Multifractal features", " Cross-correlation exponents", " Multifractal spectra", " Comparative analysis", " Long range correlation"], "paper_abstract": "Purpose - Recently, many scholars have been paying more attention to studying the existence and application of multifractality. However, most researches concentrate on studying multifractal features of returns or volume separately, and ignore the correlation between them. The purpose of this paper, therefore, is to give an empirical test on multifractal features of price-volume correlation in China metal futures market and then to conduct a comparative analysis from time and space dimensions, in order to better understand metals futures market behavior. Design/methodology/approach - This paper gives an empirical test by means of multifractal detrended cross-correlation analysis (MF-DCCA) approach, which is a technique employed in statistical physics to detect multifractal features of two cross-correlated nonstationary time series. Findings - Empirical results show that the price-volume correlation in China metal futures market is multifractal and that long range correlation and non-Gaussian probability distribution are the main reasons for the existence of multifractality. Also, a comparative analysis is conducted and it is found that although China metal futures market is becoming more and more effective, the effectiveness is lower than that in mature LME metal futures markets. The futures market still needs further development. Originality/value - The paper's conclusions would help to understand the nonlinear dependency relationship and potential dynamics mechanism in price-volume correlation. Keywords China, Futures markets, Prices, Stock returns, Metal futures, Price-volume correlation, Multifractal detrended cross-correlation analysis, Multifractal features, Cross-correlation exponents, Multifractal spectra, Comparative analysis, Long range correlation", "paper_title": "Multifractal features of metal futures market based on multifractal detrended cross-correlation analysis", "paper_id": "WOS:000312434100010"}