{"auto_keywords": [{"score": 0.04916281891691642, "phrase": "knowledge_bases"}, {"score": 0.034517811089193814, "phrase": "contrasting_measures"}, {"score": 0.00481495049065317, "phrase": "fuzzy_similarity"}, {"score": 0.004456717971917794, "phrase": "heterogeneous_sources"}, {"score": 0.0038737214010638745, "phrase": "recent_work"}, {"score": 0.0038364365168131586, "phrase": "probabilistic_measures"}, {"score": 0.0037087324991876727, "phrase": "contrasting_properties"}, {"score": 0.003516558537200823, "phrase": "fuzzy_sets"}, {"score": 0.00317681090697906, "phrase": "probabilistic_case"}, {"score": 0.0030709962527878656, "phrase": "fuzzy_and_logical_independence"}, {"score": 0.002869793011316547, "phrase": "relevant_concept"}, {"score": 0.002801166393333128, "phrase": "distinguishing_feature"}, {"score": 0.0026817365934071486, "phrase": "inconsistent_knowledge_bases"}, {"score": 0.002542642270762272, "phrase": "agreeing_information"}], "paper_keywords": ["agreement", " coherence", " fuzzy similarity", " inconsistency", " independence", " probability"], "paper_abstract": "Intuitively it seems that the coherence of information received from heterogeneous sources should be one factor in determining the reliability or truthfulness of the information, yet the concept of coherence is extremely difficult to define. This paper draws on recent work on probabilistic measures of coherence by investigating two measures with contrasting properties and then explores how this work relates to similarity of fuzzy sets and comparison of knowledge bases in cases where inconsistency is present. In each area contrasting measures are proposed analogous to the probabilistic case. In particular, concepts of fuzzy and logical independence are proposed and in each area it is found that sensitivity to the relevant concept of independence is a distinguishing feature between the contrasting measures. In the case of inconsistent knowledge bases, it is argued that it is important to take agreeing information and not just conflicting and total information into account when comparing two knowledge bases. One of the measures proposed achieves this and is shown to have a number of properties which enable it to overcome some problems encountered by other approaches.", "paper_title": "Coherence measures and their relation to fuzzy similarity and inconsistency in knowledge bases", "paper_id": "WOS:000252222600004"}