{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "vital_information"}, {"score": 0.00437021209960886, "phrase": "obstacle_avoidance"}, {"score": 0.004152818376630929, "phrase": "general_text"}, {"score": 0.004048194450210347, "phrase": "challenging_research_problem"}, {"score": 0.003866443402315402, "phrase": "widely_varying_forms"}, {"score": 0.0038271712887391015, "phrase": "natural_text"}, {"score": 0.0037307208089736835, "phrase": "bottom-up_approach"}, {"score": 0.0035269696779744266, "phrase": "image_region"}, {"score": 0.003334309053314909, "phrase": "saliency_detection_methods"}, {"score": 0.003010496595090984, "phrase": "character_detection"}, {"score": 0.002964706925144123, "phrase": "bayesian_method"}, {"score": 0.0027041907335656782, "phrase": "markov_random_field_model"}, {"score": 0.002622528664187849, "phrase": "inherent_dependencies"}, {"score": 0.00240426758768164, "phrase": "bayesian_multicue_integration"}, {"score": 0.002367676766637248, "phrase": "proposed_text_detector"}, {"score": 0.0021049977753042253, "phrase": "state-of-the-art_saliency_detection_models"}], "paper_keywords": ["Characterness", " scene text detection", " saliency detection"], "paper_abstract": "Text in an image provides vital information for interpreting its contents, and text in a scene can aid a variety of tasks from navigation to obstacle avoidance and odometry. Despite its value, however, detecting general text in images remains a challenging research problem. Motivated by the need to consider the widely varying forms of natural text, we propose a bottom-up approach to the problem, which reflects the characterness of an image region. In this sense, our approach mirrors the move from saliency detection methods to measures of objectness. In order to measure the characterness, we develop three novel cues that are tailored for character detection and a Bayesian method for their integration. Because text is made up of sets of characters, we then design a Markov random field model so as to exploit the inherent dependencies between characters. We experimentally demonstrate the effectiveness of our characterness cues as well as the advantage of Bayesian multicue integration. The proposed text detector outperforms state-of-the-art methods on a few benchmark scene text detection data sets. We also show that our measurement of characterness is superior than state-of-the-art saliency detection models when applied to the same task.", "paper_title": "Characterness: An Indicator of Text in the Wild", "paper_id": "WOS:000332732900004"}