{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "hierarchical_routing"}, {"score": 0.004785682967399109, "phrase": "low-power_wireless_embedded_networks"}, {"score": 0.004641980000471692, "phrase": "appealing_point-to-point_routing_technique"}, {"score": 0.004434439786037454, "phrase": "analytical_and_high-level_simulation_results"}, {"score": 0.004275079900660675, "phrase": "actual_sensornet_settings"}, {"score": 0.00405903443476192, "phrase": "proposed_hierarchical_routing_protocols"}, {"score": 0.0039370647208387234, "phrase": "common_characteristics"}, {"score": 0.0039363666374511355, "phrase": "compact_routing"}, {"score": 0.003865642389848873, "phrase": "design_points"}, {"score": 0.003749462025612395, "phrase": "sensornet_implementation"}, {"score": 0.0036926831170414746, "phrase": "tossim"}, {"score": 0.0031796485244939368, "phrase": "compelling_routing_technique"}, {"score": 0.003046578530654012, "phrase": "small_routing_stretch"}, {"score": 0.002848598297362903, "phrase": "maintenance_traffic"}, {"score": 0.00221726957085921, "phrase": "particular_application"}, {"score": 0.0021505234515372504, "phrase": "practical_issues"}, {"score": 0.0021049977753042253, "phrase": "sensornet_developers"}], "paper_keywords": ["Algorithms", " Design", " Performance", " Experimentation", " Point-to-point routing", " hierarchical routing", " compact routing", " small-state routing", " small-stretch routing", " wireless sensor networks", " self-organizing protocols"], "paper_abstract": "Hierarchical routing has often been mentioned as an appealing point-to-point routing technique for wireless sensor networks (sensornets). While there is a volume of analytical and high-level simulation results demonstrating its merits, there has been little work evaluating it in actual sensornet settings. This article bridges the gap between theory and practice. Having analyzed a number of proposed hierarchical routing protocols, we have developed a framework that captures the common characteristics of the protocols and identifies design points at which the protocols differ. We use a sensornet implementation of the framework in TOSSIM and on a 60-node testbed to study various trade-offs that hierarchical routing introduces, as well as to compare the performance of hierarchical routing with the performance of other routing techniques, namely shortest-path routing, compact routing, and beacon vector routing. The results show that hierarchical routing is a compelling routing technique also in practice. In particular, despite only logarithmic routing state, it can offer small routing stretch: an average of similar to 1.25 and a 99th percentile of 2. It can also be robust, minimizing the maintenance traffic or the latency of reacting to changes in the network. Moreover, the trade-offs offered by hierarchical routing are attractive for many sensornet applications when compared to the other routing techniques. For example, in terms of routing state, hierarchical routing can offer scalability at least an order of magnitude better than compact routing, and at the same time, in terms of routing stretch, its performance is within 10-15% of that of compact routing; in addition, this performance can further be tuned to a particular application. Finally, we also identify a number of practical issues and limitations of which we believe sensornet developers adopting hierarchical routing should be aware.", "paper_title": "A Case for Hierarchical Routing in Low-Power Wireless Embedded Networks", "paper_id": "WOS:000307607800007"}