{"auto_keywords": [{"score": 0.04571345706034808, "phrase": "time-delay_feedback_system"}, {"score": 0.04159628933856973, "phrase": "time-delay_feedback_systems"}, {"score": 0.006284721000890259, "phrase": "initial_conditions"}, {"score": 0.00481495049065317, "phrase": "linear_time-invariant_time-delay_feedback_systems"}, {"score": 0.004664352260912174, "phrase": "new_stability_analysis_method"}, {"score": 0.004637478829869904, "phrase": "time-delay_systems"}, {"score": 0.004557779715547673, "phrase": "monodromy_operator_approach"}, {"score": 0.004440794067839299, "phrase": "tds"}, {"score": 0.004326771493322954, "phrase": "finite-dimensional_linear_time-invariant"}, {"score": 0.004240116703465252, "phrase": "pure_delay"}, {"score": 0.004119313626110943, "phrase": "delay-differential_equations"}, {"score": 0.0037880260900233064, "phrase": "discontinuous_initial_functions"}, {"score": 0.0033741997276290356, "phrase": "finite-dimensional_part"}, {"score": 0.0031937337757356526, "phrase": "dde_solution"}, {"score": 0.0030758329792764196, "phrase": "thorough_relationship"}, {"score": 0.0023841543436866875, "phrase": "latter_representation"}, {"score": 0.002316105585203396, "phrase": "initial_condition"}, {"score": 0.0022696277881969896, "phrase": "former_representation"}, {"score": 0.002129527338875116, "phrase": "description_methods"}, {"score": 0.0021172271087293217, "phrase": "lti_tdss"}, {"score": 0.0021049977753042253, "phrase": "commensurate_delays"}], "paper_keywords": ["time-delay systems", " delay-differential equations", " concatenated solutions", " system representation"], "paper_abstract": "A new stability analysis method of time-delay systems (TDSs) called the monodromy operator approach has been studied under the assumption that a TDS is represented as a time-delay feedback system consisting of a finite-dimensional linear time-invariant (LTI) system and a pure delay. For applying this approach to TDSs described by delay-differential equations (DDEs), the problem of converting DDEs into representation as time-delay feedback systems has been studied. With regard to such a problem, it was shown that, under discontinuous initial functions, it is natural to define the solutions of DDEs in two different ways, and the above conversion problem was solved for each of these two definitions. More precisely, the solution of a DDE was represented as either the state of the finite-dimensional part of a time-delay feedback system or a part of the output of another time-delay feedback system, depending on which definition of the DDE solution one is talking about. Motivated by the importance in establishing a thorough relationship between time-delay feedback systems and DDEs, this paper discusses the opposite problem of converting time-delay feedback systems into representation as DDEs, including the discussions about the conversion of the initial conditions. We show that the state of (the finite-dimensional part of) a time-delay feedback system can be represented as the solution of a DDE in the sense of one of the two definitions, while its 'essential' output can be represented as that of another DDE in the sense of the other type of definition. Rigorously speaking, however, it is also shown that the latter representation is possible regardless of the initial conditions, while some initial condition could prevent the conversion into the former representation. This study hence establishes that the representation of TDSs as time-delay feedback systems possesses higher ability than that with DDEs, as description methods for LTI TDSs with commensurate delays.", "paper_title": "Conversion of linear time-invariant time-delay feedback systems into delay-differential equations with commensurate delays", "paper_id": "WOS:000337363600004"}