{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "satisfaction-based_query_replication"}, {"score": 0.004586531354697466, "phrase": "autonomous_participants"}, {"score": 0.004542158659382197, "phrase": "large-scale_internet-based_distributed_systems"}, {"score": 0.004312622975366676, "phrase": "special_interests"}, {"score": 0.003912925129722523, "phrase": "participants_satisfaction"}, {"score": 0.0036671822784770463, "phrase": "providers_failures"}, {"score": 0.003359647377874098, "phrase": "uninteresting_queries"}, {"score": 0.003305584108847751, "phrase": "natural_question"}, {"score": 0.0030086877092638945, "phrase": "query_replication"}, {"score": 0.0029602552900111407, "phrase": "probabilistic_point"}, {"score": 0.002893753089970741, "phrase": "new_algorithm"}, {"score": 0.0026768530320943063, "phrase": "large_number"}, {"score": 0.002420516633871837, "phrase": "low_critical_queries"}, {"score": 0.002366110899738696, "phrase": "high_critical_queries"}, {"score": 0.0023507916951658455, "phrase": "query-intensive_periods"}, {"score": 0.0022830706430588482, "phrase": "baseline_algorithms"}, {"score": 0.0021187186371584674, "phrase": "different_rates"}, {"score": 0.0021049977753042253, "phrase": "participant_failures"}], "paper_keywords": ["Fault-tolerance", " Query replication", " Participants satisfaction", " Autonomous participants", " Self-adaptation", " Query criticality"], "paper_abstract": "In large-scale Internet-based distributed systems, participants (consumers and providers) are typically autonomous, i.e. they may have special interests towards queries and other participants. In this context, a way to avoid a participant to voluntarily leave the system is satisfying its interests when allocating queries. However, participants satisfaction may also be negatively affected by the failures of other participants. Query replication is a solution to deal with providers failures, but, it is challenging because of autonomy: it cannot only quickly overload the system, but also it can dissatisfy participants with uninteresting queries. Thus, a natural question arises: should queries be replicated? If so, which ones? and how many times? In this paper, we answer these questions by revisiting query replication from a satisfaction and probabilistic point of view. We propose a new algorithm, called S(b)QR, that decides on-the-fly whether a query should be replicated and at which rate. As replicating a large number of queries might overload the system, we propose a variant of our algorithm, called S(b)QR+. The idea is to voluntarily fail to allocate as many replicas as required by consumers for low critical queries so as to keep resources for high critical queries during query-intensive periods. Our experimental results demonstrate that our algorithms significantly outperform the baseline algorithms from both the performance and satisfaction points of view. We also show that our algorithms automatically adapt to the criticality of queries and different rates of participant failures.", "paper_title": "Satisfaction-based query replication An automatic and self-adaptable approach for replicating queries in the presence of autonomous participants", "paper_id": "WOS:000302641700001"}