{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sustainable_manufacturing"}, {"score": 0.007023246781316678, "phrase": "contextual_factors"}, {"score": 0.004789105805595663, "phrase": "simulation_style_technology"}, {"score": 0.004776235281195212, "phrase": "enhanced_learning_environments"}, {"score": 0.004562629470601531, "phrase": "sustainability_objectives"}, {"score": 0.004489532034272497, "phrase": "manufacturing_industry"}, {"score": 0.004429508899912265, "phrase": "current_and_future_engineers"}, {"score": 0.003977217946137447, "phrase": "general_and_serious_games"}, {"score": 0.003881967500880318, "phrase": "great_deal"}, {"score": 0.0036982302337748227, "phrase": "simulation_style_competence-based_tel_environments_places"}, {"score": 0.003532664514268134, "phrase": "-individual_factors"}, {"score": 0.003420261789594412, "phrase": "simulation_style_competence-based_tel_environments"}, {"score": 0.0032670996052464, "phrase": "work_situations"}, {"score": 0.0031546052275283317, "phrase": "organization_processes"}, {"score": 0.003078994644402931, "phrase": "available_technologies"}, {"score": 0.003054194767034299, "phrase": "competence_performance"}, {"score": 0.0029729578703205453, "phrase": "life-like_constructions"}, {"score": 0.0028551244098497103, "phrase": "content_area"}, {"score": 0.002640358015455532, "phrase": "relevant_contextual_factors"}, {"score": 0.0023322628488025325, "phrase": "tel_content"}, {"score": 0.0023197131534778417, "phrase": "serious_games"}, {"score": 0.0022157248843582417, "phrase": "main_aim"}, {"score": 0.002174270259589384, "phrase": "new_genre"}, {"score": 0.002162568865296819, "phrase": "tel_environments"}, {"score": 0.0021221066364072766, "phrase": "engineering_education"}, {"score": 0.0021049977753042253, "phrase": "future_engineers'_rapid_competence_development"}], "paper_keywords": ["Sustainable manufacturing", " Engineering education", " Technology enhanced learning", " Serious games", " TARGET", " Contextually enriched competence model", " Systems/holistic thinking"], "paper_abstract": "In order to remain competitive, engineers need to acquire competences necessary to attain the sustainability objectives that are emerging in the manufacturing industry. The training of current and future engineers needs to achieve two criteria: the learners need to be able to apply the learning into complex, life-like situations and the learning outcomes need to be achieved rapidly. Competence-based and technology-enhanced learning (TEL) in general and serious games and simulations in particular have recently attracted a great deal of attention as they have the potential to deliver on both accounts. Designing learning content for simulation style competence-based TEL environments places special demands on competence modelling. Competences are traditionally defined and modelled using internal-to-individual factors such as knowledge, skills and attitudes. However, designing simulation style competence-based TEL environments, such as serious games, cannot be based solely on these factors. In work situations competences are performed neither in solitude nor isolation. Contextual factors such as organization processes, laws and norms, the market and available technologies significantly influence competence performance. As the simulations in question need to be life-like constructions of work situations the role of contextual factors is heightened. In addition, the content area of sustainable manufacturing is novel, which adds to the challenge. The two main innovative contributions that are presented in this paper are: (1) an enhanced competence modelling methodology which aids in identifying and structuring relevant contextual factors that have an impact on the performance of the competences in question, and (2) the output of applying this methodology, i.e. a contextually enriched competence model in the field of sustainable manufacturing that can be used to facilitate the design of the TEL content for serious games and simulations. The work presented in the paper is a part of the European Seventh Framework Programme Integrated Project TARGET, the main aim of which is to develop a new genre of TEL environments that can be effectively used in engineering education to support future engineers' rapid competence development in the field of sustainable manufacturing.", "paper_title": "Contextually enriched competence model in the field of sustainable manufacturing for simulation style technology enhanced learning environments", "paper_id": "WOS:000319363100004"}