{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "mechanical_systems"}, {"score": 0.0044372687709897446, "phrase": "efficient_planning"}, {"score": 0.004395633639958821, "phrase": "disassembly_processes"}, {"score": 0.004368093195599546, "phrase": "strategic_importance"}, {"score": 0.0038519872652579713, "phrase": "present_paper"}, {"score": 0.0036860898876135534, "phrase": "disassembly_sequence"}, {"score": 0.0031995714196263506, "phrase": "genetic_search_procedure"}, {"score": 0.0031200390864992407, "phrase": "genetic_algorithms"}, {"score": 0.0030713353414700295, "phrase": "intrinsic_complexity"}, {"score": 0.0030424776690194714, "phrase": "complete_mathematical_solution"}, {"score": 0.0029761900030306483, "phrase": "disassembly_sequences"}, {"score": 0.0029021941361680637, "phrase": "non-exhaustive_approach"}, {"score": 0.0026741446768534824, "phrase": "disassembly_process_planning"}, {"score": 0.0026076388058390815, "phrase": "product_design_phases"}, {"score": 0.002542782716137888, "phrase": "second_algorithm"}, {"score": 0.002471740959383183, "phrase": "recovery-oriented_disassembly"}, {"score": 0.0024485031231407522, "phrase": "all-encompassing_approach"}, {"score": 0.0024254832239892017, "phrase": "economical_and_environmental_considerations"}, {"score": 0.0023651468875880628, "phrase": "whole_life_cycle"}, {"score": 0.0022846219120101112, "phrase": "autonomous_decisional_capacity"}, {"score": 0.0021998931213841567, "phrase": "optimum_recovery_plan"}, {"score": 0.002138410677608455, "phrase": "disassembled_components"}, {"score": 0.0021049977753042253, "phrase": "significant_properties"}], "paper_keywords": ["disassembly planning", " life cycle engineering", " environmentally conscious design and manufacturing", " serviceability", " recovery", " genetic algorithms"], "paper_abstract": "In a perspective of improving the behavior of a product in its whole life cycle, the efficient planning of the disassembly processes acquires strategic importance, as it can improve both the product's use phase, by facilitating service operations (maintenance and repairs), and the end-of-life phase, by favoring the recycling of materials and the reuse of components. The present paper proposes an approach to disassembly process planning that supports the search for the disassembly sequence best suited for both aspects, service of the product and recovery at the end of its useful life, developing two different algorithms. Notwithstanding their different purposes, the two algorithms share the typology of modeling on which they operate, and the logical structure according to which the genetic search procedure is developed. The choice of implementing genetic algorithms was prompted by the intrinsic complexity of the complete mathematical solution to the problem of generating the disassembly sequences, which suggests the use of a non-exhaustive approach. As is shown in the results of a set of simulations, both algorithms may be used not only for the purposes related to disassembly process planning but also as supporting tools during the product design phases. This is especially so for the second algorithm, that deals with the problem of a recovery-oriented disassembly through an all-encompassing approach, combining economical and environmental considerations, and extending the evaluations to the whole life cycle of the product. This formulation gives this algorithm and autonomous decisional capacity on both the disassembly level to be reached, and the definition of the optimum recovery plan (i.e., the best destination for the disassembled components, based on some significant properties of them).", "paper_title": "Disassembly planning of mechanical systems for service and recovery: a genetic algorithms based approach", "paper_id": "WOS:000248611500002"}