{"auto_keywords": [{"score": 0.04961049691122095, "phrase": "pt-adsorbed_graphene"}, {"score": 0.03789439700787632, "phrase": "binding_energy"}, {"score": 0.027244860483140707, "phrase": "young's_modulus"}, {"score": 0.010384506343655436, "phrase": "pt-graphene_system"}, {"score": 0.009986033430653705, "phrase": "graphene_layer"}, {"score": 0.00481495049065317, "phrase": "enhanced_hydrogen_storage_capacity"}, {"score": 0.004721162131188487, "phrase": "ab_initio_vdw"}, {"score": 0.00462919213721188, "phrase": "dft_level"}, {"score": 0.004073359218158693, "phrase": "single_pt_atom_adsorption"}, {"score": 0.004013662619667083, "phrase": "graphene_surface"}, {"score": 0.003858697684681798, "phrase": "energetically_favorable_pt-graphene_system"}, {"score": 0.0036553070575015344, "phrase": "pristine_graphene"}, {"score": 0.0027469703311742647, "phrase": "pt-graphene_surface"}, {"score": 0.002706659627293686, "phrase": "six_molecules"}, {"score": 0.0025014259919355453, "phrase": "pt_adsorption"}, {"score": 0.0021789194955896102, "phrase": "hydrogen_adsorption"}, {"score": 0.0021049977753042253, "phrase": "substrate_strength"}], "paper_keywords": ["Ab initio calculations", " Adsorption", " Graphene", " Hydrogen", " Mechanical properties", " Platinum"], "paper_abstract": "Ab initio vdW calculations with the DFT level of theory were used to investigate hydrogen (H-2) adsorption on Pt-adsorbed graphene (Pt-graphene). We have explored the most energetically favorable sites for single Pt atom adsorption on the graphene surface. The interaction of H-2 with the energetically favorable Pt-graphene system was then investigated. We found that H-2 physisorbs on pristine graphene with a binding energy of -0.05 eV, while the binding energy is enhanced to -1.98 eV when H-2 binds Pt-adsorbed graphene. We also found that up to four H-2 molecules can be adsorbed on the Pt-graphene system with a -0.74 eV/H-2 binding energy. The effect of graphene layer stretching on the Pt-graphene capacity/ability for hydrogen adsorption was evaluated. Our results show that the number of H-2 molecules adsorbed on the Pt-graphene surface rises to six molecules with a binding energy of approximately -0.29 eV/H-2. Our first-principles results reveal that the Young's modulus was slightly decreased for Pt adsorption on the graphene layer. The first-principles calculated Young's modulus for the H-2-adsorbed Pt-graphene system demonstrates that hydrogen adsorption can dramatically increase the Young's modulus of such systems. As a result, hydrogen adsorption on the Pt-graphene system might enhance the substrate strength.", "paper_title": "First-principles vdW-DF study on the enhanced hydrogen storage capacity of Pt-adsorbed graphene", "paper_id": "WOS:000336306200014"}