{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "universal_generating_function_method"}, {"score": 0.03556417972834716, "phrase": "amafcn_reliability"}, {"score": 0.024957464719913478, "phrase": "proposed_algorithm"}, {"score": 0.004616560363089716, "phrase": "acyclic_multi-state-arc_flow-conservation_networks"}, {"score": 0.004260134699483774, "phrase": "acyclic_multi-state-arc_flow-conservation_network"}, {"score": 0.004163427731140163, "phrase": "special_multi-state-arc_flow-conservation_network"}, {"score": 0.00385658790017119, "phrase": "amafcn"}, {"score": 0.0031967297437935772, "phrase": "sink_node"}, {"score": 0.0031002400518251936, "phrase": "demanded_flow"}, {"score": 0.0030414140732789186, "phrase": "general_method"}, {"score": 0.002949598537993663, "phrase": "system_state_d"}, {"score": 0.0026801145128158487, "phrase": "ugfm"}, {"score": 0.002370704665003412, "phrase": "computational_complexity"}, {"score": 0.0021049977753042253, "phrase": "one-to-many_reliabilities"}], "paper_keywords": ["acyclic multi-state-arc flow-conservation network", " d-MP", " one-to-many", " reliability", " universal generating function method"], "paper_abstract": "Evaluating network reliability is an important step in the planning, design, and control of systems. The acyclic multi-state-arc flow-conservation network (AMAFCN) is a special multi-state-arc flow-conservation network (MAFCN) of which each arc has independent, discrete, limited multi-states (capacities), and satisfied flow conservation. The AMAFCN is arranged in such a way that no flow leaving a node can return this node through any sequence of nodes, e.g. no cycles exist. For such networks, we are interested in evaluating the AMAFCN reliability, i.e. the probability that the flow from the source node to the sink node is equal to or greater than a demanded flow of d units. A general method for the MAFCN/AMAFCN reliability evaluation is using minimal path/cut vectors with system state d (called the d-MP/d-MC). In this study, we focused on developing an extension of the universal generating function method (UGFM) to find the entire one-to-many d-MP before calculating the AMAFCN reliability between the source node, and some node subset (i.e. one-to-many reliability). The computational complexity of the proposed algorithm is also analyzed. Finally, one example is given to illustrate how entire one-to-many d-MP are generated using the proposed algorithm. Then, all one-to-many reliabilities of this example are calculated.", "paper_title": "The extension of universal generating function method to search for all one-to-many d-minimal paths of acyclic multi-state-arc flow-conservation networks", "paper_id": "WOS:000253840700011"}