{"auto_keywords": [{"score": 0.04835227522307673, "phrase": "dense_environment"}, {"score": 0.04703570948560471, "phrase": "numerous_tags"}, {"score": 0.040129121313182976, "phrase": "frame_length"}, {"score": 0.03785838340094737, "phrase": "single_slot"}, {"score": 0.03057034786717778, "phrase": "estimation_accuracy"}, {"score": 0.00481495049065317, "phrase": "prefix_information"}, {"score": 0.004739773204474094, "phrase": "fsa-based_rfid_systems"}, {"score": 0.004690305164360866, "phrase": "radio_frequency_identification"}, {"score": 0.004415675459182871, "phrase": "competing_tags"}, {"score": 0.00438105507792004, "phrase": "collision_probability"}, {"score": 0.004102865227227444, "phrase": "fsa_algorithm"}, {"score": 0.00397565401009627, "phrase": "available_tags"}, {"score": 0.0038624981944755813, "phrase": "estimated_value"}, {"score": 0.003752550907120244, "phrase": "fsa_scheme"}, {"score": 0.00347740824437241, "phrase": "estimated_cardinality"}, {"score": 0.003459191419478298, "phrase": "unreasonable_setting"}, {"score": 0.0033430782507921594, "phrase": "channel_resource"}, {"score": 0.00329080576226637, "phrase": "system_performance"}, {"score": 0.002985988377995789, "phrase": "prefix_assisted_approach"}, {"score": 0.0028630535573013686, "phrase": "traditional_fsa."}, {"score": 0.0025503930258942062, "phrase": "multiple_colliding_replies"}, {"score": 0.00251048377083841, "phrase": "active_bits"}, {"score": 0.00249076336301339, "phrase": "overlapping_prefixes"}, {"score": 0.00235698036946969, "phrase": "extensive_simulation_results"}, {"score": 0.0023139986108451946, "phrase": "traditional_schemes"}, {"score": 0.0022777800735119405, "phrase": "tag_cardinality"}, {"score": 0.002183938718432764, "phrase": "communication_overhead"}, {"score": 0.0021497514826678433, "phrase": "tag_identification_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["RFID", " Tag counting", " Performance evaluation", " Cardinality estimation"], "paper_abstract": "For a radio frequency identification (RFID) system deployed in dense environment, the reader must quickly and reliably extract information from numerous tags. To harmonize the channel access among competing tags and reduce collision probability, conventionally, framed slotted ALOHA (FSA) scheme is employed to resolve the collisions occurring when numerous tags simultaneously respond to the query of the reader. Typically, FSA algorithm consists of two parts: (i) estimating the number of available tags in vicinity, and (ii) base on the estimated value, setting the frame length accordingly. However, in the FSA scheme, when collision happens, it is impossible to estimate how many colliding tags simultaneously reply in a single slot, which, in turn, can lead to inaccuracy of the estimated cardinality and unreasonable setting of the frame length. This will further result in under-utilization of channel resource and the degradation of the system performance. The problem can be aggravated when all slots in the frame are entirely collided under a dense environment, rendering the malfunction of the estimator. To address this problem, in this paper, a prefix assisted approach, namely, PA-FSA, is proposed to enhance the estimation accuracy of the traditional FSA. Specifically, in PA-FSA, each tag appends a prefix in front of RN16 short message. When replying RN16 to the reader, a tag randomly and independently selects one bit in the prefix and sets the bit as active. By synchronizing prefixes of multiple colliding replies and counting the number of active bits in the overlapping prefixes, the reader can more precisely estimate how many tags have collided in a single slot, thus significantly improving the estimation accuracy. Extensive simulation results indicate that, compared with the traditional schemes, PA-FSA can estimate the tag cardinality more accurately and efficiently. Additionally, with PA-FSA adopted, system can reduce the communication overhead for approximately 50% and shorten the tag identification time for about 15%. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "Exploiting the prefix information to enhance the performance of FSA-based RFID systems", "paper_id": "WOS:000350078200010"}