{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "academic_journals"}, {"score": 0.004362564831572539, "phrase": "academic_journal_publication"}, {"score": 0.00428257928723, "phrase": "different_criteria"}, {"score": 0.003880017219275826, "phrase": "present_study"}, {"score": 0.0037854112749311844, "phrase": "single_criterion"}, {"score": 0.0036477941360224435, "phrase": "paper_surveys"}, {"score": 0.003515162360861593, "phrase": "existing_measures"}, {"score": 0.0033664873319204027, "phrase": "academic_publishing"}, {"score": 0.0031068064097811844, "phrase": "quantitative_analysis"}, {"score": 0.002938821840519756, "phrase": "case_study"}, {"score": 0.002728847267539957, "phrase": "descriptive_statistics"}, {"score": 0.002323826502178581, "phrase": "mathematically_fuzzy_entity"}, {"score": 0.0022670785913397637, "phrase": "single_measure"}, {"score": 0.0022531089868518235, "phrase": "internationality_index"}, {"score": 0.0021576973674470997, "phrase": "suitably_weighted_criteria"}], "paper_keywords": [""], "paper_abstract": "Internationality as a concept is being applied ambiguously, particularly in the world of academic journal publication. Although different criteria are used by scientometrists in order to measure internationality and to supplement its minimal literal meaning, the present study suggests that no single criterion alone is sufficient. This paper surveys, critically-assesses and extends the existing measures of internationality in the context of academic publishing and identifies those criteria that are most clearly resolved and amenable to quantitative analysis. When applied, however, to a case study of four thematically-connected journals from the field of Health and Clinical Psychology using descriptive statistics and the Gini Coefficient, the measurement of internationality using these criteria was found to be ambiguous. We conclude that internationality is best viewed as a mathematically fuzzy entity and that a single measure Internationality Index, constructed from a combination of suitably weighted criteria, is the only way to unambiguously quantify the degree of internationality.", "paper_title": "Measuring internationality: Reflections and perspectives on academic journals", "paper_id": "WOS:000235904000004"}