{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "child_labor"}, {"score": 0.012713076330312786, "phrase": "formal_schooling"}, {"score": 0.006891281289672209, "phrase": "seemingly_contradictory_empirical_findings"}, {"score": 0.005685851948846617, "phrase": "laissez_faire_triple"}, {"score": 0.0047851345246117455, "phrase": "purpose_-_the_purpose"}, {"score": 0.0046676969718111765, "phrase": "theoretical_foundation"}, {"score": 0.0045108906244892165, "phrase": "children's_well-being"}, {"score": 0.004441359373498799, "phrase": "systemic_yoyo_model"}, {"score": 0.004435208409511484, "phrase": "capital_markets"}, {"score": 0.004359328949187473, "phrase": "road_map"}, {"score": 0.003958937342925219, "phrase": "children's_disutility"}, {"score": 0.003662892058072211, "phrase": "parents'_utility_function"}, {"score": 0.0032546105164772995, "phrase": "children's_lifetime_earnings_potential"}, {"score": 0.003048782877550259, "phrase": "parents'_savings"}, {"score": 0.002918826667294298, "phrase": "parents'_bequests"}, {"score": 0.002803104254950008, "phrase": "government_regulation"}, {"score": 0.0027512482368183596, "phrase": "marginal_ban"}, {"score": 0.0026094602917828037, "phrase": "pareto_improvement"}, {"score": 0.0025452819305349416, "phrase": "different_sets"}, {"score": 0.0025294848742287864, "phrase": "specific_conditions"}, {"score": 0.0021987994275190314, "phrase": "systems_analysis"}, {"score": 0.0021049977753042253, "phrase": "unified_theory"}], "paper_keywords": ["Cybernetics", " Children", " Parents", " Labour", " Systems analysis"], "paper_abstract": "Purpose - The purpose of this paper is to establish a theoretical foundation for seemingly contradictory empirical findings about child labor and the families and the children's well-being. Design/methodology/approach - The systemic yoyo model is employed as justification and road map for exploring some issues related to child labor and its efficiency. Findings - Among many interesting results obtained in this paper, it is particularly shown that: first, as long as children's disutility or utility of labor or formal schooling are concerned, the laissez faire triple of child labor, formal schooling, and level of maturity, which maximizes the parents' utility function, can never be efficient; second, if the efficiency of parent's chosen (for their children) levels of child labor, formal schooling, and level of maturity, is determined by the impact on the children's lifetime earnings potential, then the laissez faire triple of child labor, formal schooling, and level of maturity, is efficient, either if the parents' savings and bequests are interior when the capital markets are imperfect, or if the parents' bequests are interior and the capital markets are perfect. Third, if a government regulation is introduced to impose a marginal ban on child labor, then such a ban could be either welfare reducing for both the child and the parents or a Pareto improvement for both the child and the parents, under different sets of specific conditions. Research limitations/implications - To take advantage of the methods and results of calculus, the assumption of continuity and differentiability is implied. So, all the findings of this work are limited by these conditions. Originality/value - It is shown that by using systems analysis, seemingly contradictory empirical findings regarding the efficiency of child labor can be explained by using a unified theory.", "paper_title": "Economic yoyos and some mysteries about child labor", "paper_id": "WOS:000264459300015"}