{"auto_keywords": [{"score": 0.04972703031839308, "phrase": "time_windows"}, {"score": 0.0486868426803837, "phrase": "vrptw"}, {"score": 0.025135058925244966, "phrase": "solution_quality"}, {"score": 0.00481495049065317, "phrase": "vehicle_routing_problems"}, {"score": 0.004456044928556639, "phrase": "identical_capacity"}, {"score": 0.004390764654147291, "phrase": "central_depot"}, {"score": 0.004093453936415085, "phrase": "complex_multi-constrained_problem"}, {"score": 0.003844478919573134, "phrase": "multi-objective_variant"}, {"score": 0.0037325918533747953, "phrase": "travelled_distance"}, {"score": 0.003267925215811654, "phrase": "multi-objective_procedure"}, {"score": 0.0032319109979344184, "phrase": "simulated_annealing"}, {"score": 0.0029686314779877525, "phrase": "multi-objective_formulations"}, {"score": 0.002935906352568145, "phrase": "vrptw."}, {"score": 0.0027878797103973313, "phrase": "mt-psa"}, {"score": 0.0026277995163948263, "phrase": "solomon's_benchmark_problems"}, {"score": 0.0025892330566358503, "phrase": "island-based_parallelization"}, {"score": 0.0025701624384280746, "phrase": "pareto-fronts"}, {"score": 0.002551231163230566, "phrase": "higher_quality"}, {"score": 0.002495268931035983, "phrase": "sequential_versions"}, {"score": 0.0024586427394152196, "phrase": "computational_cost"}, {"score": 0.0024136132575631273, "phrase": "significant_reduction"}, {"score": 0.0021522261505574035, "phrase": "execution_time"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Multi-objective meta-heuristics", " Parallel processing", " Simulated Annealing", " Vehicle routing", " Time windows", " Route balancing"], "paper_abstract": "The Capacitated Vehicle Routing Problem with Time Windows (VRPTW) consists in determining the routes of a given number of vehicles with identical capacity stationed at a central depot which are used to supply the demands of a set of customers within certain time windows. This is a complex multi-constrained problem with industrial, economic, and environmental implications that has been widely analyzed in the past. This paper deals with a multi-objective variant of the VRPTW that simultaneously minimizes the travelled distance and the imbalance of the routes. This imbalance is analyzed from two perspectives: the imbalance in the distances travelled by the vehicles, and the imbalance in the loads delivered by them. A multi-objective procedure based on Simulated Annealing, the Multiple Temperature Pareto Simulated Annealing (MT-PSA), is proposed in this paper to cope with these multi-objective formulations of the VRPTW. The procedure MT-PSA and an island-based parallel version of MT-PSA have been evaluated and compared with, respectively, sequential and island-based parallel implementations of SPEA2. Computational results obtained on Solomon's benchmark problems show that the island-based parallelization produces Pareto-fronts of higher quality that those obtained by the sequential versions without increasing the computational cost, while also producing significant reduction in the runtimes while maintaining solution quality. More specifically, for the most part, our procedure MT-PSA outperforms SPEA2 in the benchmarks here considered, with respect to the solution quality and execution time. (C) 2012 Elsevier Ltd. All rights reserved.", "paper_title": "A Simulated Annealing-based parallel multi-objective approach to vehicle routing problems with time windows", "paper_id": "WOS:000314737600028"}