{"auto_keywords": [{"score": 0.04118498548932341, "phrase": "semantic_relatedness"}, {"score": 0.00481495049065317, "phrase": "text_relatedness"}, {"score": 0.004746558955503364, "phrase": "word_thesaurus"}, {"score": 0.0045471315699087385, "phrase": "automated_manner"}, {"score": 0.004450568197899267, "phrase": "wide_range"}, {"score": 0.004248294537944227, "phrase": "pairwise_relations"}, {"score": 0.00406971620207041, "phrase": "text_segments"}, {"score": 0.003829455440282146, "phrase": "well_both_aspects"}, {"score": 0.0036815763368083197, "phrase": "text_retrieval"}, {"score": 0.003526735797659508, "phrase": "new_approach"}, {"score": 0.0032947371184395237, "phrase": "implicit_semantic_links"}, {"score": 0.003167441396998299, "phrase": "omiotis"}, {"score": 0.002686124293881678, "phrase": "semantic_relatedness_measure"}, {"score": 0.00266693888510356, "phrase": "individual_words"}, {"score": 0.0025546627686955656, "phrase": "synonym_identification"}, {"score": 0.0025364139244227458, "phrase": "word_analogy"}, {"score": 0.0024122616475793206, "phrase": "text-to-text_semantic_relatedness"}, {"score": 0.0022777800735119405, "phrase": "experimental_evaluation"}, {"score": 0.0022453451864218477, "phrase": "proposed_method"}, {"score": 0.0022213218042340752, "phrase": "lexicon-based_method"}, {"score": 0.002174041708084857, "phrase": "selected_tasks"}, {"score": 0.0021507795710951384, "phrase": "used_data_sets"}, {"score": 0.0021049977753042253, "phrase": "corpus-based_and_hybrid_approaches"}], "paper_keywords": [""], "paper_abstract": "The computation of relatedness between two fragments of text in an automated manner requires taking into account a wide range of factors pertaining to the meaning the two fragments convey, and the pairwise relations between their words. Without doubt, a measure of relatedness between text segments must take into account both the lexical and the semantic relatedness between words. Such a measure that captures well both aspects of text relatedness may help in many tasks, such as text retrieval, classification and clustering. In this paper we present a new approach for measuring the semantic relatedness between words based on their implicit semantic links. The approach exploits only a word thesaurus in order to devise implicit semantic links between words. Based on this approach, we introduce Omiotis, a new measure of semantic relatedness between texts which capitalizes on the word-to-word semantic relatedness measure (SR) and extends it to measure the relatedness between texts. We gradually validate our method: we first evaluate the performance of the semantic relatedness measure between individual words, covering word-to-word similarity and relatedness, synonym identification and word analogy; then, we proceed with evaluating the performance of our method in measuring text-to-text semantic relatedness in two tasks, namely sentence-to-sentence similarity and paraphrase recognition. Experimental evaluation shows that the proposed method outperforms every lexicon-based method of semantic relatedness in the selected tasks and the used data sets, and competes well against corpus-based and hybrid approaches.", "paper_title": "Text Relatedness Based on a Word Thesaurus", "paper_id": "WOS:000273881300001"}