{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "level_ground"}, {"score": 0.01006739684907954, "phrase": "biped_robot"}, {"score": 0.007237074625983163, "phrase": "stance_leg"}, {"score": 0.003676926952533304, "phrase": "simple_control_strategy"}, {"score": 0.003628460216207393, "phrase": "planar_biped_robot"}, {"score": 0.00353342812142574, "phrase": "control_method"}, {"score": 0.0033955950017361246, "phrase": "pd"}, {"score": 0.0032199307816384577, "phrase": "swing_leg"}, {"score": 0.003135564707433078, "phrase": "pd_controller"}, {"score": 0.0029212075318449616, "phrase": "numerical_simulations"}, {"score": 0.0025692477422626678, "phrase": "wide_range"}, {"score": 0.0025241429061867633, "phrase": "high_energy_efficiency"}, {"score": 0.0024798279465139688, "phrase": "control_parameters"}, {"score": 0.0021049977753042253, "phrase": "torso_only_driven_biped_robot"}], "paper_keywords": ["biped robot", " torso control", " passive dynamic walking", " PD controller"], "paper_abstract": "It is well known that a biped robot needs actuators to walk stably oh level ground. Till now, a biped robot with torso has needed at least two actuators to achieve this. Would it be possible for this kind of robot to walk on level ground with only one actuator? This paper responds in the affirmative and proposes a simple control strategy for a planar biped robot with torso. In this control method, there is only one low gain proportional-derivative (PD) controller between the torso and the stance leg, while the swing leg remains totally free. The PD controller utilizes states of both the torso (angle and angular velocity) and the stance leg. The numerical simulations show that, by adopting this controller, a planar biped robot with torso can walk stably on level ground, and that the robot can walk with a wide range of speeds and high energy efficiency by changing the control parameters. Four period-one gaits, one of which is stable while the other three are unstable, are found by simulations. According to the literature surveyed, we are the first to have a torso only driven biped robot walk stably on level ground.", "paper_title": "Biped walking on level ground with torso using only one actuator", "paper_id": "WOS:000329537800021"}