{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "free_iris"}, {"score": 0.020205050101291634, "phrase": "acquired_images"}, {"score": 0.009709516289494225, "phrase": "multiple_differently_focused_images"}, {"score": 0.008855540974426038, "phrase": "three-dimensional_blur"}, {"score": 0.005919361250251442, "phrase": "generated_images"}, {"score": 0.0054806963225442745, "phrase": "image_generation"}, {"score": 0.004785356349906913, "phrase": "focus_image_generation"}, {"score": 0.004640079189342692, "phrase": "three-dimensional_filtering"}, {"score": 0.004243135792625782, "phrase": "geometrical_blurring_model"}, {"score": 0.0041269626762569095, "phrase": "spatial_information"}, {"score": 0.003940338160665297, "phrase": "spatial_frequency_analysis"}, {"score": 0.0038561471948364723, "phrase": "three-dimensional_filters"}, {"score": 0.0034613276345111573, "phrase": "virtual_irises"}, {"score": 0.003397809453525626, "phrase": "original_one"}, {"score": 0.0032742371135183195, "phrase": "especially_very_many_images"}, {"score": 0.0032141411226372704, "phrase": "focused_regions"}, {"score": 0.0031845067058084583, "phrase": "acquired_image"}, {"score": 0.0031357200369281344, "phrase": "depth_map"}, {"score": 0.0029937855454238507, "phrase": "desired_image"}, {"score": 0.002762774046280398, "phrase": "merged_results"}, {"score": 0.0027372898106427274, "phrase": "visible_artifacts"}, {"score": 0.0025732834751685803, "phrase": "desired_images"}, {"score": 0.0024491648492933615, "phrase": "synthetic_images"}, {"score": 0.002239225269052105, "phrase": "simple_method"}, {"score": 0.0021510385886131557, "phrase": "experimental_results"}, {"score": 0.0021049977753042253, "phrase": "real_images"}], "paper_keywords": ["focus", " image generation", " frequency domain", " filtering", " three-dimensional blur"], "paper_abstract": "This paper describes a method of free iris and focus image generation based on transformation integrating multiple differently focused images. First, we assume that objects are defocused by a geometrical blurring model. And we combine acquired images on certain imaging planes and spatial information of objects by using a convolution of a three-dimensional blur. Then, based on spatial frequency analysis of the blur, we design three-dimensional filters that generate free iris and focus images from the acquired images. The method enables us to generate not only an all-in-focus image corresponding to an ideal pin-hole iris but also various images, which would be acquired with virtual irises whose sizes are different from the original one. In order to generate a certain image by using multiple differently focused images, especially very many images, conventional methods usually analyze focused regions of each acquired image independently and construct a depth map. Then, based on the map, the regions are merged into a desired image with some effects. However, generally, it is so difficult to conduct such depth estimation robustly in all regions that these methods cannot prevent merged results from including visible artifacts, which decrease the quality of generated images awfully. In this paper, we propose a method of generating desired images directly and robustly from very many differently focused images without depth estimation. Simulations of image generation are performed utilizing synthetic images to study how certain parameters of the blur and the filter affect the quality of generated images. We also introduce pre-processing that corrects the size of acquired images and a simple method for estimating the parameter of the three-dimensional blur. Finally, we show experimental results of free iris and focus image generation from real images.", "paper_title": "Free iris and focus image generation by merging multiple differently focused images based on a three-dimensional filtering", "paper_id": "WOS:000243703600024"}