{"auto_keywords": [{"score": 0.03083113936511587, "phrase": "proposed_loss_functions"}, {"score": 0.0147222731506862, "phrase": "training_samples"}, {"score": 0.012517613977289744, "phrase": "estimation_error"}, {"score": 0.011407637915125678, "phrase": "risk-sensitive_loss_functions"}, {"score": 0.00481495049065317, "phrase": "sparse_multi-category_classification_problems"}, {"score": 0.004594951819987416, "phrase": "multi-category_classification_problems"}, {"score": 0.004384960761826366, "phrase": "high_imbalance"}, {"score": 0.0036791522245326514, "phrase": "proposed_risk-sensitive_loss_functions"}, {"score": 0.0035245918797629804, "phrase": "error_analysis"}, {"score": 0.003389704997952315, "phrase": "neural_architecture"}, {"score": 0.0027995677499976406, "phrase": "satellite_image_problem"}, {"score": 0.002619748321217153, "phrase": "superior_performance"}, {"score": 0.0025892330566358503, "phrase": "neural_classifier"}, {"score": 0.002422890839801611, "phrase": "performance_comparisons"}, {"score": 0.0023300677028248776, "phrase": "benchmark_problems"}, {"score": 0.002197443382039439, "phrase": "similar_or_better_performance"}, {"score": 0.0021381565332182773, "phrase": "well-known_loss_functions"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["multi-category classification", " neural network", " risk-sensitive loss function", " cross-entropy", " satellite imaging", " micro-array gene expression"], "paper_abstract": "In this paper, we propose two risk-sensitive loss functions to solve the multi-category classification problems where the number of training samples is small and/or there is a high imbalance in the number of samples per class. Such problems are common in the bio-informatics/medical diagnosis areas. The most commonly used loss functions in the literature do not perform well in these problems as they minimize only the approximation error and neglect the estimation error due to imbalance in the training set. The proposed risk-sensitive loss functions minimize both the approximation and estimation error. We present an error analysis for the risk-sensitive loss functions along with other well known loss functions. Using a neural architecture, classifiers incorporating these risk-sensitive loss functions have been developed and their performance evaluated for two real world multi-class classification problems, viz., a satellite image classification problem and a microarray gene expression based cancer classification problem. To study the effectiveness of the proposed loss functions, we have deliberately imbalanced the training samples in the satellite image problem and compared the performance of our neural classifiers with those developed using other well-known loss functions. The results indicate the superior performance of the neural classifier using the proposed loss functions both in terms of the overall and. per class classification accuracy. Performance comparisons have also been carried out on a number of benchmark problems where the data is normal i.e., not sparse or imbalanced. Results indicate similar or better performance of the proposed loss functions compared to the well-known loss functions. Published by Elsevier Inc.", "paper_title": "Risk-sensitive loss functions for sparse multi-category classification problems", "paper_id": "WOS:000256289100009"}