{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "bounded_degree_trees"}, {"score": 0.01504723907398287, "phrase": "bap"}, {"score": 0.005460981245390167, "phrase": "best_previously_known_ratio"}, {"score": 0.004722038375317162, "phrase": "bandwidth_allocation_problem"}, {"score": 0.004384960761826366, "phrase": "connection_requests"}, {"score": 0.003977672712305348, "phrase": "maximum_weight_subset"}, {"score": 0.0038404642251010797, "phrase": "edge_c"}, {"score": 0.0037957839728524046, "phrase": "total_bandwidth"}, {"score": 0.003552204377093386, "phrase": "storage_allocation_problem"}, {"score": 0.0031229578623834394, "phrase": "deterministic_approximation_algorithm"}, {"score": 0.002810520668490478, "phrase": "novel_application"}, {"score": 0.00277778944472107, "phrase": "local_ratio_technique"}, {"score": 0.0027347383772384102, "phrase": "available_bandwidth"}, {"score": 0.0026923527275481804, "phrase": "narrow_strips"}, {"score": 0.00243237365704391, "phrase": "general_trees"}, {"score": 0.002105001746181291, "phrase": "sap"}], "paper_keywords": [""], "paper_abstract": "We study the bandwidth allocation problem (BAP) in bounded degree trees. In this problem we are given a tree and a set of connection requests. Each request consists of a path in the tree, a bandwidth requirement, and a weight. Our goal is to find a maximum weight subset S of requests such that, for every edge c, the total bandwidth of requests in S whose path contains e is at most 1. We also consider the storage allocation problem (SAP), in which it is also required that every request in the solution is given the same contiguous portion of the resource in every edge in its path. We present a deterministic approximation algorithm for BAP in bounded degree trees with ratio (2 root e - 1)/(root e - 1) + epsilon < 3.542. Our algorithm is based on a novel application of the local ratio technique in which the available bandwidth is divided into narrow strips and requests with very small bandwidths are allocated in these strips. We also present a randomized (2 + epsilon)-approximation algorithm for BAP in bounded degree trees. The best previously known ratio for BAP in general trees is 5. We present a reduction from SAP to BAP that works for instances where the tree is a line and the bandwidths are very small. It follows that there exists a (2 + epsilon)-approximation algorithm for SAP in the line. The best previously known ratio for this problem is 7.", "paper_title": "Resource allocation in bounded degree trees", "paper_id": "WOS:000241478200007"}