{"auto_keywords": [{"score": 0.03599138222416075, "phrase": "disjunctive_consequent_rules"}, {"score": 0.010540888266430766, "phrase": "multiple_items"}, {"score": 0.00662727188981796, "phrase": "disjunctive_rules"}, {"score": 0.00481495049065317, "phrase": "association_rules_for_recommendations"}, {"score": 0.004733791336312872, "phrase": "web-based_environments"}, {"score": 0.004333208536635007, "phrase": "single_items"}, {"score": 0.004117647922204903, "phrase": "limited_use"}, {"score": 0.003743439610143464, "phrase": "multiple_interactions"}, {"score": 0.003345680943026579, "phrase": "novel_mining_algorithm"}, {"score": 0.003157510936118389, "phrase": "search_space"}, {"score": 0.003062201383165999, "phrase": "pruning_techniques"}, {"score": 0.002949598537993663, "phrase": "pruning_effectiveness"}, {"score": 0.002653989719462843, "phrase": "association_rules"}, {"score": 0.002479150189700726, "phrase": "traditional_association_rules"}, {"score": 0.0022766712610014484, "phrase": "relative_performance"}, {"score": 0.0021705796895687864, "phrase": "collaborative_filtering"}, {"score": 0.002126635713519051, "phrase": "matrix_factorization"}, {"score": 0.0021049977753042253, "phrase": "data_set"}], "paper_keywords": ["data mining", " disjunctive rules", " personalization", " bounce rate", " collaborative filtering", " matrix factorization"], "paper_abstract": "In Web-based environments, a site has the ability to recommend multiple items to a customer in each interaction. Traditionally, rules used to make recommendations either have single items in their consequents or have conjunctions of items in their consequents. Such rules may be of limited use when the site wishes to maximize the likelihood of the customer being interested in at least one of the items recommended in each interaction (with a session comprising multiple interactions). Rules with disjunctions of items in their consequents and conjunctions of items in their antecedents are more appropriate for such environments. We refer to such rules as disjunctive consequent rules. We have developed a novel mining algorithm to obtain such rules. We identify several properties of disjunctive consequent rules that can be used to prune the search space when mining such rules. We demonstrate that the pruning techniques drastically reduce the proportion of disjunctive rules explored, with the pruning effectiveness increasing rapidly with an increase in the number of items to be recommended. We conduct experiments to compare the use of disjunctive rules with that of traditional (conjunctive) association rules on several real-world data sets and show that the accuracies of recommendations made using disjunctive consequent rules are significantly higher than those made using traditional association rules. We also compare the disjunctive consequent rules approach with two other state-of-the-art recommendation approaches-collaborative filtering and matrix factorization. Its performance is generally superior to both these techniques on two transactional data sets. The relative performance on a very sparse click-stream data set is mixed. Its performance is inferior to that of collaborative filtering and superior to that of matrix factorization for that data set.", "paper_title": "Association Rules for Recommendations with Multiple Items", "paper_id": "WOS:000339327000002"}