{"auto_keywords": [{"score": 0.041121063920231744, "phrase": "intelligent_systems"}, {"score": 0.00481495049065317, "phrase": "adaptive_algorithmic_hybrids"}, {"score": 0.004712988631183401, "phrase": "cognitive_architecture"}, {"score": 0.004419819325202464, "phrase": "different_computational_formalisms"}, {"score": 0.0041984140090404985, "phrase": "human_cognitive_architecture"}, {"score": 0.0037238193456845124, "phrase": "robust_intelligence"}, {"score": 0.003582928547553209, "phrase": "computational_methods"}, {"score": 0.003537155405923517, "phrase": "main_obstacle"}, {"score": 0.003374250301861101, "phrase": "data_structures"}, {"score": 0.003177687211289478, "phrase": "new_method"}, {"score": 0.0030183163057929687, "phrase": "multiple_modules"}, {"score": 0.002564360070426064, "phrase": "five_common_functions"}, {"score": 0.0024884913795612707, "phrase": "common_functions"}, {"score": 0.0024356742694508662, "phrase": "multiple_data_structures"}, {"score": 0.0023233800372985686, "phrase": "polyscheme_cognitive_architecture"}, {"score": 0.002235356010935877, "phrase": "spatial_reasoning"}, {"score": 0.00218789980093445, "phrase": "information_retrieval"}, {"score": 0.0021049977753042253, "phrase": "qualitative_and_measurable_quantitative_advances"}], "paper_keywords": ["Hybrid architectures", " integrated systems"], "paper_abstract": "We describe a cognitive architecture for creating more robust intelligent systems. Our approach is to enable hybrids of algorithms based on different computational formalisms to be executed. The architecture ismotivated by some features of human cognitive architecture and the following beliefs: 1) Most existing computational methods often exhibit some of the characteristics desired of intelligent systems at the cost of other desired characteristics and 2) a system exhibiting robust intelligence can be designed by implementing hybrids of these computational methods. The main obstacle to this approach is that the various relevant computational methods are based on data structures and algorithms that are difficult to integrate into one system. We describe a new method of executing hybrids of algorithms using the focus of attention of multiple modules. The key to this approach is the following two principles: 1) Algorithms based on very different computational frameworks (e. g., logical reasoning, probabilistic inference, and case-based reasoning) can be implemented using the same set of five common functions and 2) each of these common functions can be executed using multiple data structures and algorithms. This approach has been embodied in the Polyscheme cognitive architecture. Systems based on Polyscheme in planning, spatial reasoning, robotics, and information retrieval illustrate that this approach to hybridizing algorithms enables qualitative and measurable quantitative advances in the abilities of intelligent systems.", "paper_title": "An Architecture for Adaptive Algorithmic Hybrids", "paper_id": "WOS:000277774700031"}