{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "online_participation"}, {"score": 0.004725787037228084, "phrase": "behaviour_change"}, {"score": 0.004690583510896564, "phrase": "online_groups"}, {"score": 0.004451360793577698, "phrase": "behaviour_change_individuals"}, {"score": 0.004177149334239669, "phrase": "cscw_research"}, {"score": 0.003919763262805793, "phrase": "personal_experiences"}, {"score": 0.003569681826459428, "phrase": "smartphone_application"}, {"score": 0.0035298229915690974, "phrase": "different_objects"}, {"score": 0.003412887952564431, "phrase": "social_interaction"}, {"score": 0.003299813878412728, "phrase": "field_study"}, {"score": 0.0032507647824680684, "phrase": "different_forms"}, {"score": 0.0030617295196636173, "phrase": "receptive_and_covert_interactions"}, {"score": 0.0030049342542235466, "phrase": "explicit_interaction"}, {"score": 0.0029381648092259064, "phrase": "mutual_support"}, {"score": 0.002625866440129899, "phrase": "existing_frameworks"}, {"score": 0.0025578967205807843, "phrase": "current_discourse"}, {"score": 0.0025388011374541546, "phrase": "object-centred_sociality"}, {"score": 0.002473079487488344, "phrase": "alternative_approach"}, {"score": 0.002427177130359851, "phrase": "online_support_groups"}, {"score": 0.002373214852820709, "phrase": "enhanced_control"}, {"score": 0.0021049977753042253, "phrase": "simultaneous_desire"}], "paper_keywords": ["Objects", " Object-centred sociality", " Online participation", " Reader-to-leader framework", " Online communities", " Smartphone application", " Behaviour change", " Smoking cessation"], "paper_abstract": "Online groups rely on contributions from their members to flourish, but in the context of behaviour change individuals are typically reluctant to participate actively before they have changed successfully. We took inspiration from CSCW research on objects to address this problem by shifting the focus of online participation from the exchange of personal experiences to more incidental interactions mediated by objects that offer support for change. In this article we describe how we designed, deployed and studied a smartphone application that uses different objects, called distractions and tips, to facilitate social interaction amongst people trying to quit smoking. A field study with 18 smokers revealed different forms of interaction: purely instrumental interactions with the objects, subtle engagement with other users through receptive and covert interactions, as well as explicit interaction with other users through disclosure and mutual support. The distraction objects offered a stepping-stone into interaction, whereas the tips encouraged interaction with the people behind the objects. This understanding of interaction through objects complements existing frameworks of online participation and adds to the current discourse on object-centred sociality. Furthermore, it provides an alternative approach to the design of online support groups, which offers the users enhanced control about the information they share with other users. We conclude by discussing how researchers and practitioners can apply the ideas of interaction around objects to other domains where individuals may have a simultaneous desire and reluctance to interact.", "paper_title": "An Object-Centred Approach to Encourage Online Participation in the Context of Behaviour Change", "paper_id": "WOS:000350036900002"}