{"auto_keywords": [{"score": 0.03635304672973842, "phrase": "eigenfactor_scores"}, {"score": 0.00481495049065317, "phrase": "social_science_research_network_community"}, {"score": 0.004611108249179507, "phrase": "eigenfactor_score"}, {"score": 0.004492950096237056, "phrase": "scholarly_journals"}, {"score": 0.004340081802944066, "phrase": "scholarly_output"}, {"score": 0.00415625929636759, "phrase": "author-level_citation_data"}, {"score": 0.003945879572348638, "phrase": "eigenfactor_rankings"}, {"score": 0.003828091961373454, "phrase": "social_science_research_network"}, {"score": 0.003665874747419775, "phrase": "rapid_dissemination"}, {"score": 0.003634262647873338, "phrase": "scholarly_research"}, {"score": 0.0035873530542209686, "phrase": "social_sciences"}, {"score": 0.0034953361767153285, "phrase": "additive_metric"}, {"score": 0.00319141242685261, "phrase": "collective's_eigenfactor_score"}, {"score": 0.0029647862293448895, "phrase": "collective-level_cross-citation_matrix"}, {"score": 0.0028145455182562807, "phrase": "ssrn_repository"}, {"score": 0.002766171878646582, "phrase": "network-wide_comparison"}, {"score": 0.0027068691342344545, "phrase": "download_tallies"}, {"score": 0.0024928553725344933, "phrase": "download_counts"}, {"score": 0.002449997042686432, "phrase": "author-level_ranking"}, {"score": 0.0023767561522363367, "phrase": "scholarly_literature"}, {"score": 0.0021049977753042253, "phrase": "formal_publication"}], "paper_keywords": ["bibliometrics"], "paper_abstract": "In this article, we show how the Eigenfactor score, originally designed for ranking scholarly journals, can be adapted to rank the scholarly output of authors, institutions, and countries based on author-level citation data. Using the methods described in this article, we provide Eigenfactor rankings for 84,808 disambiguated authors of 240,804 papers in the Social Science Research Network (SSRN)a preprint and postprint archive devoted to the rapid dissemination of scholarly research in the social sciences and humanities. As an additive metric, the Eigenfactor scores are readily computed for collectives such as departments or institutions as well. We show that a collective's Eigenfactor score can be computed either by summing the Eigenfactor scores of its members or by working directly with a collective-level cross-citation matrix. We provide Eigenfactor rankings for institutions and countries in the SSRN repository. With a network-wide comparison of Eigenfactor scores and download tallies, we demonstrate that Eigenfactor scores provide information that is both different from and complementary to that provided by download counts. We see author-level ranking as one filter for navigating the scholarly literature, and note that such rankings generate incentives for more open scholarship, because authors are rewarded for making their work available to the community as early as possible and before formal publication.", "paper_title": "Author-level Eigenfactor metrics: Evaluating the influence of authors, institutions, and countries within the social science research network community", "paper_id": "WOS:000323386300009"}