{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "consumer_experiences"}, {"score": 0.031189527775711025, "phrase": "product_knowledge"}, {"score": 0.02849589691404014, "phrase": "sequential_combination"}, {"score": 0.009754532417798464, "phrase": "virtual_experience"}, {"score": 0.007626396415098472, "phrase": "ducp"}, {"score": 0.0075637593620688694, "phrase": "brand_attitude"}, {"score": 0.007505743757507096, "phrase": "moderating_role"}, {"score": 0.007391034193577008, "phrase": "unique_consumer_products"}, {"score": 0.004442381603223475, "phrase": "significant_differences"}, {"score": 0.003760385494931853, "phrase": "preceding_direct_experience"}, {"score": 0.0036038701178581403, "phrase": "virtual_experience_preceding_direct_experience"}, {"score": 0.0034405207528624983, "phrase": "preceding_indirect_experience"}, {"score": 0.003087505858215832, "phrase": "taiwan"}, {"score": 0.00282470997972535, "phrase": "high_level"}, {"score": 0.0025445415633818472, "phrase": "highest_product_knowledge"}, {"score": 0.0024957862318504753, "phrase": "lowest_product_knowledge"}, {"score": 0.0024574537875026634, "phrase": "low_level"}, {"score": 0.0022222152430170254, "phrase": "daugherty_et_al"}, {"score": 0.0021049977753042253, "phrase": "keng"}], "paper_keywords": ["Product knowledge", " Consumer experiences", " Brand attitude", " Desire for unique consumer products"], "paper_abstract": "Purpose - The purpose of this paper is to explore the impact of the sequential combination of consumer experiences on product knowledge and brand attitude. Additionally, the moderating role of desire for unique consumer products (DUCP) was also discussed. Design/methodology/approach - Four types of sequential combinations of consumer experiences were designed: exposure to escapist virtual experience preceding direct experience (VEescapist -> DE), exposure to education virtual experience preceding direct experience (VEeducation -> DE), exposure to escapist virtual experience preceding indirect experience (VEescapist -> IDE), and exposure to education virtual experience preceding indirect experience (VEeducation -> IDE). A total of 302 undergraduate college students in Taiwan participated in this study. Findings - The results revealed that DUCP moderated the sequential combination of consumer experiences on product knowledge. For the high level of DUCP, there are significant differences among the effects of the sequential combination of consumer experiences on product knowledge. Specifically, it was found that VEescapist -> IDE produces the highest product knowledge while VEeducation -> DE produces the lowest product knowledge. Regarding the low level of DUCP, there are not significant differences among the effects of sequential combination of consumer experiences on product knowledge. Originality/value - This study extended the studies of Daugherty et al. (2008), Pine and Gilmore (1999), and Keng et al. (2012) to further explore the effects of the sequential combination of experiences.", "paper_title": "Sequential combination of consumer experiences and their impact on product knowledge and brand attitude The moderating role of desire for unique consumer products", "paper_id": "WOS:000341886900001"}