{"auto_keywords": [{"score": 0.04962913836247387, "phrase": "real-time_embedded_systems"}, {"score": 0.010612387000973441, "phrase": "component_frameworks"}, {"score": 0.0038746849003761024, "phrase": "general_idea"}, {"score": 0.0038382392088338784, "phrase": "component-based_development"}, {"score": 0.003678414118674967, "phrase": "supported_features"}, {"score": 0.003475582268210954, "phrase": "right_component_framework"}, {"score": 0.0033943947596098583, "phrase": "significant_obstacle"}, {"score": 0.0033150974333333244, "phrase": "component-based_development_approach"}, {"score": 0.00314708280192844, "phrase": "component_framework"}, {"score": 0.0030446120560494155, "phrase": "custom_framework"}, {"score": 0.0028360962841331634, "phrase": "selected_modern_component-based_frameworks"}, {"score": 0.0026293540353514075, "phrase": "real-time_and_embedded_systems"}, {"score": 0.002391938519840648, "phrase": "full_development_life_cycle"}, {"score": 0.0023249757987087055, "phrase": "execution_support"}, {"score": 0.0021049977753042253, "phrase": "code_samples"}], "paper_keywords": ["Component-based development", " Component frameworks", " Real-time and embedded systems"], "paper_abstract": "The use of components significantly helps in development of real-time embedded systems. There have been a number of component frameworks developed for this purpose, and some of them have already became well established in this area. Even though these frameworks share the general idea of component-based development, they significantly differ in the range of supported features and maturity. This makes it relatively difficult to select the right component framework and thus poses a significant obstacle in adoption of the component-based development approach for developing real-time embedded systems. To provide guidance in choosing a component framework, or at least relevant concepts when building a custom framework, we present a survey, which illustrates distinguishing features and provides comparison of selected modern component-based frameworks for real-time embedded systems. Compared to other existing surveys, this survey focuses specifically on criteria connected with real-time and embedded systems. Further, to be practically relevant, we restrict the survey only to the frameworks that support the full development life cycle (i.e. from design till execution support). In this context, the survey illustrates the complexity of development in each framework by giving specification and code samples.", "paper_title": "Comparison of component frameworks for real-time embedded systems", "paper_id": "WOS:000337033900005"}