{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "ontology_evaluation"}, {"score": 0.0042459818200777846, "phrase": "previous_works"}, {"score": 0.004120694410890683, "phrase": "new_pitfalls"}, {"score": 0.004023120753104693, "phrase": "empirical_analysis"}, {"score": 0.002741091312632307, "phrase": "domain_experts"}, {"score": 0.002692200353719145, "phrase": "description_logics"}, {"score": 0.0026600905156986317, "phrase": "ontology_implementation_languages"}, {"score": 0.0025354258731826148, "phrase": "ontology_development_platform"}, {"score": 0.0022758279600841014, "phrase": "users'_satisfaction"}, {"score": 0.0022486729928886903, "phrase": "worldwide_usage_statistics"}, {"score": 0.0021049977753042253, "phrase": "existing_ontology_evaluation_tools"}], "paper_keywords": ["Ontology", " Ontology Evaluation", " Ontology Quality", " Ontology Validation", " Pitfalls"], "paper_abstract": "This paper presents two contributions to the field of Ontology Evaluation. First, a live catalogue of pitfalls that extends previous works on modeling errors with new pitfalls resulting from an empirical analysis of over 693 ontologies. Such a catalogue classifies pitfalls according to the Structural, Functional and Usability-Profiling dimensions. For each pitfall, we incorporate the value of its importance level (critical, important and minor) and the number of ontologies where each pitfall has been detected. Second, OOPS! (OntOlogy Pitfall Scanner!), a tool for detecting pitfalls in ontologies and targeted at newcomers and domain experts unfamiliar with description logics and ontology implementation languages. The tool operates independently of any ontology development platform and is available online. The evaluation of the system is provided both through a survey of users' satisfaction and worldwide usage statistics. In addition, the system is also compared with existing ontology evaluation tools in terms of coverage of pitfalls detected.", "paper_title": "OOPS! (OntOlogy Pitfall Scanner!): An On-line Tool for Ontology Evaluation", "paper_id": "WOS:000345429300002"}