{"auto_keywords": [{"score": 0.05007201426940714, "phrase": "synthetic_biology"}, {"score": 0.043730223860063755, "phrase": "sb"}, {"score": 0.03434030104477667, "phrase": "state_space"}, {"score": 0.0045679168155893304, "phrase": "material_ecologies"}, {"score": 0.0044933373574179624, "phrase": "emerging_engineering_paradigm"}, {"score": 0.004138237651024009, "phrase": "new_way"}, {"score": 0.004030618026002216, "phrase": "material_forms"}, {"score": 0.00390000531646629, "phrase": "material_elements"}, {"score": 0.0038616499489536123, "phrase": "genetic_programming"}, {"score": 0.0037985575652591985, "phrase": "current_trends"}, {"score": 0.0037364921305658395, "phrase": "traditional_engineering_terms"}, {"score": 0.003675437054650504, "phrase": "design_speculations"}, {"score": 0.0036273094722181795, "phrase": "bottom-up_processes"}, {"score": 0.003340420612167456, "phrase": "new_material_systems"}, {"score": 0.0033075503163659055, "phrase": "engineering_living_organisms"}, {"score": 0.0030660263386795526, "phrase": "simple_experiments"}, {"score": 0.003015893651662638, "phrase": "calcium_carbonate"}, {"score": 0.0028234043335210895, "phrase": "cell_structures"}, {"score": 0.0025489778320184255, "phrase": "direct_chemical_interaction"}, {"score": 0.00242590924077914, "phrase": "physical_forces"}, {"score": 0.002324055400492893, "phrase": "broad_terms"}, {"score": 0.00215419297939962, "phrase": "future_development"}, {"score": 0.002140025439512019, "phrase": "sb."}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Synthetic biology", " Material ecologies", " Self assembly", " Emergence", " State space"], "paper_abstract": "This paper discusses the role that material ecologies might have in the emerging engineering paradigm of Synthetic Biology (hereafter SB). In this paper we suggest that, as a result of the paradigm of SB, a new way of considering the relationship between computation and material forms is needed, where computation is embedded into the material elements themselves through genetic programming. The paper discusses current trends to conceptualize SB in traditional engineering terms and contrast this from design speculations in terms of bottom-up processes of emergence and self-organization. The paper suggests that, to reconcile these positions, it is necessary to think about the design of new material systems derived from engineering living organisms in terms of a state space of production. The paper analyses this state space using the example of biomineralization, with illustrations from simple experiments on bacteria-induced calcium carbonate. The paper suggests a framework involving three interconnected state spaces defined as: cellular (the control of structures within the cell structures within a cell, and specifically DNA and its expression through the process of transcription and translation); chemical (considered to occur outside the cell, but in direct chemical interaction with the interior of the cell itself); physical (which constitutes the physical forces and energy within the environment). We also illustrate, in broad terms, how such spaces are interconnected. Finally the paper will conclude by suggesting how a material ecologies approach might feature in the future development of SB. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Material ecologies for synthetic biology: Biomineralization and the state space of design", "paper_id": "WOS:000348485700004"}