{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "graph_orientation"}, {"score": 0.004036141321779216, "phrase": "colliding_vehicles"}, {"score": 0.00399881984083004, "phrase": "similar_problems"}, {"score": 0.0036951530348821116, "phrase": "network_flow"}, {"score": 0.0035273744062641636, "phrase": "oriented_network"}, {"score": 0.0032898346872897383, "phrase": "lane_reversal_problem"}, {"score": 0.0029699874949715367, "phrase": "time_horizon"}, {"score": 0.0025952620596908773, "phrase": "special_case"}, {"score": 0.0025355968118803956, "phrase": "single_source"}, {"score": 0.002331909406363425, "phrase": "similar_flavor"}, {"score": 0.0022889103976458437, "phrase": "nonapproximability_results"}, {"score": 0.0022467024793003812, "phrase": "best_orientation"}, {"score": 0.0021049977753042253, "phrase": "wiley_periodicals"}], "paper_keywords": ["dynamic flow", " flow over time", " graph orientation", " lane reversal"], "paper_abstract": "Flows over time are used to model many real-world logistic and routing problems. The networks underlying such problemsstreets, tracks, etc.are inherently undirected and directions are only imposed on them to reduce the danger of colliding vehicles and similar problems. Thus, the question arises, what influence the orientation of the network has on the network flow over time problem that is being solved on the oriented network. In the literature, this is also referred to as the contraflow or lane reversal problem. We introduce and analyze the price of orientation: How much flow is lost in any orientation of the network if the time horizon remains fixed? We prove that there is always an orientation where we can still send one-third of the flow and this bound is tight. For the special case of networks with a single source or sink, this fraction is half, which is again tight. We present more results of similar flavor and also show nonapproximability results for finding the best orientation for single and multicommodity maximum flows over time. (c) 2015 Wiley Periodicals, Inc. NETWORKS, Vol. 66(3), 196-209 2015", "paper_title": "Graph orientation and flows over time", "paper_id": "WOS:000360842700003"}