{"auto_keywords": [{"score": 0.04149996837966591, "phrase": "nsp"}, {"score": 0.025451130496188783, "phrase": "actionable_positive_and_negative_sequential_patterns"}, {"score": 0.00481495049065317, "phrase": "positive_or_negative_sequential_patterns"}, {"score": 0.004262643556463565, "phrase": "irreplaceable_role"}, {"score": 0.0036942726653704213, "phrase": "actionable_positive_or_negative_sequential_patterns"}, {"score": 0.0034849681064606543, "phrase": "positive_sequential_patterns"}, {"score": 0.003101153870424188, "phrase": "actionable_patterns"}, {"score": 0.0027594936602962075, "phrase": "uninteresting_itemsets"}, {"score": 0.002687235334499192, "phrase": "selecting_actionable_sequential_pattern"}, {"score": 0.0025214217930287003, "phrase": "efficient_method"}, {"score": 0.002219795908735262, "phrase": "asp."}, {"score": 0.0021049977753042253, "phrase": "best_method"}], "paper_keywords": ["Actionable", " negative sequential patterns", " positive sequential patterns"], "paper_abstract": "Negative sequential patterns (NSP) refer to sequences with non-occurring and occurring items, and can play an irreplaceable role in understanding and addressing many business applications. However, some problems occur after mining NSP, the most urgent one of which is how to select the actionable positive or negative sequential patterns. This is due to the following factors: 1) positive sequential patterns (PSP) mined before considering NSP may mislead decisions; and 2) it is much more difficult to select actionable patterns after mining NSP, as the number of NSPs is much greater than PSPs. In this paper, an improved method of pruning uninteresting itemsets to fit for a selecting actionable sequential pattern (ASP) is proposed. Then, a novel and efficient method, called SAP, is proposed to select the actionable positive and negative sequential patterns. Experimental results indicate that SAP is very efficient in the selection of ASP. To the best of our knowledge, SAP is the best method for the selection of actionable positive and negative sequential patterns.", "paper_title": "Select actionable positive or negative sequential patterns", "paper_id": "WOS:000366674200051"}