{"auto_keywords": [{"score": 0.026700629644145, "phrase": "update_logic_programs"}, {"score": 0.015719716506582538, "phrase": "logic_programs"}, {"score": 0.012555757904981884, "phrase": "success_postulate"}, {"score": 0.01123733678146036, "phrase": "answer_sets"}, {"score": 0.004545598514506788, "phrase": "set_semantics"}, {"score": 0.0040648241451154525, "phrase": "fundamental_principle"}, {"score": 0.0037984549828326106, "phrase": "agm_revision"}, {"score": 0.003249966782844541, "phrase": "essential_idea"}, {"score": 0.003057503388220776, "phrase": "positive_and_negative_literals"}, {"score": 0.0029857633082091377, "phrase": "positive_literals"}, {"score": 0.002955533639862811, "phrase": "regular_answer"}, {"score": 0.002905827490766696, "phrase": "negated_literals"}, {"score": 0.002866663406866159, "phrase": "minimal_set"}, {"score": 0.0028472791870440065, "phrase": "naf_literals"}, {"score": 0.0027060037347363987, "phrase": "program_p"}, {"score": 0.002427549902743566, "phrase": "revising_logic_program"}, {"score": 0.0024111277643627154, "phrase": "higher_priority"}, {"score": 0.0021556211190198703, "phrase": "p._we"}, {"score": 0.002126546582044807, "phrase": "core_group"}, {"score": 0.0021049977753042253, "phrase": "agm_postulates"}], "paper_keywords": ["answer set programming", " belief change", " belief revision"], "paper_abstract": "An approach to the revision of logic programs under the answer set semantics is presented. For programs P and Q, the goal is to determine the answer sets that correspond to the revision of P by Q, denoted P * Q. A fundamental principle of classical (AGM) revision, and the one that guides the approach here, is the success postulate. In AGM revision, this stipulates that alpha is an element of K * alpha. By analogy with the success postulate, for programs P and Q, this means that the answer sets of Q will in some sense be contained in those of P * Q. The essential idea is that for P * Q, a three-valued answer set for Q, consisting of positive and negative literals, is first determined. The positive literals constitute a regular answer set, while the negated literals make up a minimal set of naf literals required to produce the answer set from Q. These literals are propagated to the program P, along with those rules of Q that are not decided by these literals. The approach differs from work in update logic programs in two main respects. First, we ensure that the revising logic program has higher priority, and so we satisfy the success postulate; second, for the preference implicit in a revision P * Q, the program Q as a whole takes precedence over P, unlike update logic programs, since answer sets of Q are propagated to P. We show that a core group of the AGM postulates are satisfied, as are the postulates that have been proposed for update logic programs.", "paper_title": "A program-level approach to revising logic programs under the answer set semantics", "paper_id": "WOS:000280508200014"}