{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "detection_bits"}, {"score": 0.008085979955606386, "phrase": "secret_bits"}, {"score": 0.006054791988869482, "phrase": "quantum_cryptographic_protocols"}, {"score": 0.004655285779819366, "phrase": "indispensable_process"}, {"score": 0.004444317282171449, "phrase": "shared_bits"}, {"score": 0.00414369723664943, "phrase": "participants'_key_control_capability"}, {"score": 0.0033926758710459866, "phrase": "predetermined_string"}, {"score": 0.0031577303835881964, "phrase": "two-party_quantum_communication_protocols"}, {"score": 0.0030017207229983385, "phrase": "different_proportions"}, {"score": 0.0028174721236762317, "phrase": "high_probability"}, {"score": 0.002482126086922683, "phrase": "non-random_selection"}, {"score": 0.0023594160789762227, "phrase": "deterministic_quantum_key_distribution_protocol"}, {"score": 0.0021049977753042253, "phrase": "quite_a_few_quantum_key_agreement_protocols"}], "paper_keywords": ["eavesdropping detection", " deterministic quantum key distribution", " quantum key agreement", " quantum information", " quantum cryptography"], "paper_abstract": "Eavesdropping detection is an indispensable process of most quantum cryptographic protocols. By publishing and comparing part of the shared bits, called as detection bits, the participants can check whether there exists an eavesdropper. Generally, the detection bits are chosen randomly. Consequently, the secret bits, i.e., the rest bits, are also random. Then, what if the detection bits are chosen non-randomly? Can the participant who chooses the detection bits make the secret bits to be a predetermined string he expected? This paper focuses on the participants' key control capability when they choose the detection bits selectively in two-party quantum communication protocols. Concretely, we analyze the participants' key control capability in different situations of different proportions of the detection bits. And we prove that the participants can predetermine, with high probability, any part of the secret bits of which the length is smaller than that of the detection bits. The above result has various potential applications in quantum cryptographic protocols. Obviously, utilizing this non-random selection of the detection bits, one can realize the function of a deterministic quantum key distribution protocol through a random one if the number of the detection bits is not smaller than that of the secret bits. What is more, we find that quite a few quantum key agreement protocols cannot guarantee the fairness of the key in the sense that the participant who chooses the detection bits can control the key somewhat.", "paper_title": "Controlling the key by choosing the detection bits in quantum cryptographic protocols", "paper_id": "WOS:000365129500003"}