{"auto_keywords": [{"score": 0.041233207808256504, "phrase": "hydrogen_bonds"}, {"score": 0.010612387000973441, "phrase": "gallic_acid"}, {"score": 0.004339609346924681, "phrase": "plant_polyphenols"}, {"score": 0.0037321585095070483, "phrase": "relative_values"}, {"score": 0.0034162643819889054, "phrase": "charge_transfer"}, {"score": 0.0032769720645483102, "phrase": "intermolecular_bonds"}, {"score": 0.0031270239691197515, "phrase": "hydrogen_atoms"}, {"score": 0.0030946423142739813, "phrase": "dft-sapt_calculations"}, {"score": 0.0029376803941247084, "phrase": "different_types"}, {"score": 0.0026471739851621143, "phrase": "main_stabilizing_factor"}, {"score": 0.0022291501521610737, "phrase": "non-hydrogen_atoms"}, {"score": 0.0021381565332182773, "phrase": "dispersion_terms"}, {"score": 0.0021049977753042253, "phrase": "interaction_energy"}], "paper_keywords": ["Dimers", " Hydrogen bonds", " Stacking"], "paper_abstract": "We have performed DFT and DFT-SAPT calculations on dimers of gallic acid, the model system for plant polyphenols, and the DNA base adenine. These dimers were selected for this study as they exhibit simultaneously hydrogen bonds and stacking interactions and it allows to quantify the relative values of these interactions. We calculate the relationships between the stability of the complexes, the charge transfer between monomers and the properties of the intermolecular bonds including hydrogen bonds and other bonds that do not involve hydrogen atoms. DFT-SAPT calculations were also performed to obtain the participation of the different types of energy and so the resulting physical effects. The results show that the presence of hydrogen bonds is the main stabilizing factor for dimers: the higher number and strength, the lower the dimer energy. The contribution of stacking to the stabilization is related to the strength and number of bonds between non-hydrogen atoms and quantified by the contribution of the dispersion terms to the interaction energy. Dimers I and II are mainly stabilized due to hydrogen bonds whereas dimer III is mainly stabilized by stacking interactions.", "paper_title": "Stacking and hydrogen bond interactions between adenine and gallic acid", "paper_id": "WOS:000328205700016"}