{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "quantum_correlations"}, {"score": 0.004410938507689426, "phrase": "mixed_states"}, {"score": 0.0040916230716372265, "phrase": "bipartite_and_multipartite_quantum_correlations"}, {"score": 0.0039737570920809215, "phrase": "collective_name_quantum_discord"}, {"score": 0.003795335309109018, "phrase": "entanglement_measures"}, {"score": 0.0037168948492715386, "phrase": "general_mechanism"}, {"score": 0.0036097844103129043, "phrase": "quantum_and_classical_correlations"}, {"score": 0.0035648266669315943, "phrase": "proper_measure"}, {"score": 0.003197843245296877, "phrase": "muddy_topic"}, {"score": 0.0031056437850836326, "phrase": "\"good\"_measure"}, {"score": 0.0027857990883821504, "phrase": "generalized_measures"}, {"score": 0.0025409639091476363, "phrase": "reasonable_conditions"}, {"score": 0.0023566987138026285, "phrase": "important_quality"}, {"score": 0.0022041312401435346, "phrase": "quantum_discord"}, {"score": 0.0021049977753042253, "phrase": "measurement_basis"}], "paper_keywords": ["quantum discord", " criteria for correlations", " continuity"], "paper_abstract": "Entanglement does not describe all quantum correlations and several authors have shown the need to go beyond entanglement when dealing with mixed states. Various different measures have sprung up in the literature, for a variety of reasons, to describe bipartite and multipartite quantum correlations; sonic are known under the collective name quantum discord. Yet, in the same sprit as the criteria for entanglement measures, there is no general mechanism that determines whether a measure of quantum and classical correlations is a proper measure of correlations. This is partially due to the fact that the answer is a bit muddy. In this article we attempt tackle this muddy topic by writing down several criteria for a \"good\" measure of correlations. We breakup our list into necessary, reasonable, and debatable conditions. We then proceed to prove several of these conditions for generalized measures of quantum correlations. However, not all conditions are met by all measures; we show this via several examples. The reasonable conditions are related to continuity of correlations, which has not been previously discussed. Continuity is an important quality if one wants to probe quantum correlations in the laboratory. We show that most types of quantum discord are continuous but none are continuous with respect to the measurement basis used for optimization.", "paper_title": "Criteria for measures of quantum correlations", "paper_id": "WOS:000309484200001"}