{"auto_keywords": [{"score": 0.029159823018196036, "phrase": "medium_frequencies"}, {"score": 0.015272438232221536, "phrase": "aircraft_impact"}, {"score": 0.014029784853323395, "phrase": "large_frequency_range"}, {"score": 0.011518812257073683, "phrase": "containment_building"}, {"score": 0.00481495049065317, "phrase": "global_dynamic_response"}, {"score": 0.0047974203263411504, "phrase": "large_shell_structures"}, {"score": 0.004779953678911147, "phrase": "impact_loading"}, {"score": 0.004650955549933648, "phrase": "industrial_structure"}, {"score": 0.0046340196745259694, "phrase": "dynamic_studies"}, {"score": 0.004558564684763264, "phrase": "classical_finite_element_method"}, {"score": 0.004533685795068016, "phrase": "explicit_numerical_schemes"}, {"score": 0.004517175004916092, "phrase": "significant_calculation_time"}, {"score": 0.004476159434567463, "phrase": "transient_stage"}, {"score": 0.004347384782138468, "phrase": "wide_range"}, {"score": 0.004145947246028889, "phrase": "refined_time_discretization"}, {"score": 0.004070970384203194, "phrase": "new_ways"}, {"score": 0.004026634045130949, "phrase": "reinforced_concrete_structures"}, {"score": 0.004004646548902262, "phrase": "commercial_aircraft_impact"}, {"score": 0.003946596102632959, "phrase": "cutoff_frequency"}, {"score": 0.0038120636123551636, "phrase": "medium-frequency_range"}, {"score": 0.0034731169037910494, "phrase": "impact_zone"}, {"score": 0.0034352692400212996, "phrase": "inner_part"}, {"score": 0.0033302516433316625, "phrase": "excited_frequency_range"}, {"score": 0.0032819448594643853, "phrase": "commercial_aircraft"}, {"score": 0.0030064251340251196, "phrase": "inner_equipment"}, {"score": 0.002962801634439514, "phrase": "non-linear_impact_zone"}, {"score": 0.0029198092620068405, "phrase": "classical_finite_element_simulations"}, {"score": 0.0028460640294160383, "phrase": "linear_part"}, {"score": 0.0027996401456881806, "phrase": "non-linear_localized_area"}, {"score": 0.0027289217016279463, "phrase": "significant_displacements"}, {"score": 0.0026309747305762418, "phrase": "frequency_range"}, {"score": 0.0025786066704445304, "phrase": "finite_elements_method"}, {"score": 0.002536534348967784, "phrase": "spatial_discretization"}, {"score": 0.0023749823753904204, "phrase": "concrete_structure"}, {"score": 0.00236199235951202, "phrase": "characteristic_dimension"}, {"score": 0.0022897098939314068, "phrase": "mesh_size"}, {"score": 0.0022688734234143216, "phrase": "ten_elements"}, {"score": 0.0022155797263879082, "phrase": "proper_dimensioning_civil_engineering_structures"}, {"score": 0.0021994343316143125, "phrase": "load_case"}, {"score": 0.002136018258317293, "phrase": "appropriate_method"}, {"score": 0.002116577422058574, "phrase": "conventional_method"}, {"score": 0.0021049977753042253, "phrase": "finite_elements"}], "paper_keywords": ["Vibration", " Reinforced concrete structures", " Aircraft impact", " Dimensioning", " Medium frequency", " Shaking"], "paper_abstract": "Purpose - The determination of the vibration induced by an aircraft impact on an industrial structure requires dynamic studies. The determination of the response by using classical finite element method associated with explicit numerical schemes requires significant calculation time, especially during the transient stage. This kind of calculation requires several load cases to be analyzed in order to consider a wide range of scenarios. Moreover, a large frequency range has to be appropriately considered and therefore the mesh has to be very fine, resulting in a refined time discretization. The purpose of this paper is to develop new ways for calculating the shaking of reinforced concrete structures following a commercial aircraft impact (see Figure 1). The cutoff frequency for this type of loading is typically within the 50-100 Hz range, which would be referred to as the medium-frequency range. Design/methodology/approach - Taking into account this type of problem and assuming that the structure is appropriately sized to withstand an aircraft impact, the vibrations induced by the shock bring about shaking of the structure. Then these vibrations can travel along the containment building, as directly linked with the impact zone, but also in the inner part of the structure due to the connection with the containment building by the raft. So the excited frequency range, due to the impact of a commercial aircraft, contains two frequency ranges: low frequencies (less than ten wavelengths in the structure) and medium frequencies (between ten and 100 wavelengths). The strategy, which is presented in this paper, is inscribed in the context of the verification of inner equipment under this kind of shaking. The non-linear impact zone is assumed to have been delimited with classical finite element simulations. In this paper the authors only focus on the response of the linear part of the structure. This phenomenon induces a non-linear localized area around the impact zone. Findings - So the medium frequencies can therefore induce significant displacements and stresses at the level of equipment and thus cause damage if the structure is not dimensioning to this frequency range. Research limitations/implications - In this context the use of finite elements method for the resolution of the shaking implies a spatial discretization in correlation with the number of wavelengths to represent, and thus a long computation time especially for medium frequencies. That is why in the case of a coarse mesh the medium-frequency range is ignored. For example, a concrete structure with a characteristic dimension of about 30 and 1 m of thickness, may not represent frequencies higher than 16 Hz with a mesh size of 1 m (assuming ten elements per wavelength). Practical implications - The paper includes implications for proper dimensioning civil engineering structures subjected to a load case containing a large frequency range. Originality/value - This paper shows the gain of the strategy using appropriate method to medium frequencies compared to conventional method such as finite elements.", "paper_title": "A new methodology for assessing the global dynamic response of large shell structures under impact loading", "paper_id": "WOS:000368249500007"}