{"auto_keywords": [{"score": 0.03251408958057332, "phrase": "enterprise_security_patterns"}, {"score": 0.015719716506582538, "phrase": "security_pattern"}, {"score": 0.012076722808114377, "phrase": "new_type"}, {"score": 0.00436530211426514, "phrase": "enterprise_security_architectures"}, {"score": 0.004166129325245761, "phrase": "security_patterns"}, {"score": 0.004069963083642548, "phrase": "complex_esas"}, {"score": 0.0036213041338584756, "phrase": "enterprise_security_pattern"}, {"score": 0.003570889780957037, "phrase": "new_metapattern"}, {"score": 0.0035211747962710276, "phrase": "model-driven_environment"}, {"score": 0.0032219438233946312, "phrase": "precise_meta-model"}, {"score": 0.003003726508522467, "phrase": "security_problem"}, {"score": 0.002853124436286834, "phrase": "optimal_and_proven_security_guideline"}, {"score": 0.002722810381423097, "phrase": "esa"}, {"score": 0.002550165781755603, "phrase": "security_policies"}, {"score": 0.0021049977753042253, "phrase": "john_wiley"}], "paper_keywords": ["secure information system", " enterprise security architecture", " security pattern", " enterprise security pattern", " threat modeling"], "paper_abstract": "In recent years, most organizations have suffered attacks against their information systems. For this reason, organizations should seek support from enterprise security architectures (ESAs) in order to secure their information assets. Security patterns can help when building complex ESAs, but they have some limitations that reduce their usability. In this paper, we define the metapattern of a new type of security pattern called Enterprise Security Pattern. This new metapattern provides a model-driven environment and combines all elements that must be considered when designing and building ESAs. We present here a precise meta-model and four diagrams to describe the metapattern of the enterprise security patterns. When avoiding a security problem, organizations could use enterprise security patterns to provide their designers with an optimal and proven security guideline and so standardize the design and building of the ESA for that problem. Enterprise security patterns could also facilitate the selection and tailoring of security policies, patterns, mechanisms, and technologies when a designer is building ESAs. To illustrate our ideas, we present an instance of this new type of pattern, showing how it can be used. Copyright (c) 2014 John Wiley & Sons, Ltd.", "paper_title": "Enterprise security pattern: a new type of security pattern", "paper_id": "WOS:000344322100003"}