{"auto_keywords": [{"score": 0.02387013324823107, "phrase": "french"}, {"score": 0.00481495049065317, "phrase": "sarcastic_message"}, {"score": 0.004583205112737672, "phrase": "twitter.com_sarcasm"}, {"score": 0.004291393968030603, "phrase": "training_corpus"}, {"score": 0.004084744133085742, "phrase": "human_labeling"}, {"score": 0.0036703791815812328, "phrase": "harvested_examples"}, {"score": 0.0035224030823976186, "phrase": "day's_stream"}, {"score": 0.003177958355586418, "phrase": "ranked_list"}, {"score": 0.0030123335878664064, "phrase": "explicit_hashtag"}, {"score": 0.002740109776120878, "phrase": "linguistic_markers"}, {"score": 0.0025865679621853667, "phrase": "explicit_markers"}, {"score": 0.002523420125608051, "phrase": "digital_extralinguistic_equivalent"}, {"score": 0.0025027144548626975, "phrase": "non-verbal_expressions"}, {"score": 0.00245168871716047, "phrase": "live_interaction"}, {"score": 0.002295277579105177, "phrase": "language_family"}, {"score": 0.002157697367447098, "phrase": "similar_polarity_switching_function"}, {"score": 0.0021049977753042253, "phrase": "lesser_extent"}], "paper_keywords": ["Social media", " Automatic sentiment analysis", " Opinion mining", " Sarcasm", " Verbal irony"], "paper_abstract": "To avoid a sarcastic message being understood in its unintended literal meaning, in micro-texts such as messages on Twitter.com sarcasm is often explicitly marked with a hashtag such as '#sarcasm'. We collected a training corpus of about 406 thousand Dutch tweets with hashtag synonyms denoting sarcasm. Assuming that the human labeling is correct (annotation of a sample indicates that about 90% of these tweets are indeed sarcastic), we train a machine learning classifier on the harvested examples, and apply it to a sample of a day's stream of 2.25 million Dutch tweets. Of the 353 explicitly marked tweets on this day, we detect 309(87%) with the hashtag removed. We annotate the top of the ranked list of tweets most likely to be sarcastic that do not have the explicit hashtag. 35% of the top-250 ranked tweets are indeed sarcastic. Analysis indicates that the use of hashtags reduces the further use of linguistic markers for signaling sarcasm, such as exclamations and intensifiers. We hypothesize that explicit markers such as hashtags are the digital extralinguistic equivalent of non-verbal expressions that people employ in live interaction when conveying sarcasm. Checking the consistency of our finding in a language from another language family, we observe that in French the hashtag '#sarcasme' has a similar polarity switching function, be it to a lesser extent. (C) 2014 Elsevier Ltd. All rights reserved.", "paper_title": "Signaling sarcasm: From hyperbole to hashtag", "paper_id": "WOS:000357240200012"}