{"auto_keywords": [{"score": 0.0443587048584781, "phrase": "users'_verbalizations"}, {"score": 0.03947447987613366, "phrase": "user_experience"}, {"score": 0.03663935051842307, "phrase": "redesign_proposals"}, {"score": 0.00481495049065317, "phrase": "-aloud_participants"}, {"score": 0.0046073860169839305, "phrase": "unmoderated_usability_sessions"}, {"score": 0.004408729661992651, "phrase": "usability_tests"}, {"score": 0.003555902292752528, "phrase": "usability_issues"}, {"score": 0.002883439044844259, "phrase": "rich_verbalizations"}, {"score": 0.002851790448644913, "phrase": "test_reactivity"}, {"score": 0.002539689093411356, "phrase": "low_relevance"}, {"score": 0.0024434201175883674, "phrase": "positive_or_negative_verbalizations"}, {"score": 0.002163930783583212, "phrase": "main_difference"}, {"score": 0.002128376306688074, "phrase": "higher_percentage"}, {"score": 0.0021049977753042253, "phrase": "high-relevance_verbalizations"}], "paper_keywords": [""], "paper_abstract": "The value of thinking aloud in usability tests depends on the content of the users' verbalizations. We investigated moderated and unmoderated users' verbalizations during relaxed thinking aloud (i.e., verbalization at Levels 1-3). Verbalizations of user experience were frequent and mostly relevant to the identification of usability issues. Explanations and redesign proposals were also mostly relevant, but infrequent. The relevance of verbalizations of user experience, explanations, and redesign proposals showed the value of relaxed thinking aloud but did not clarify the trade-off between rich verbalizations and test reactivity. Action descriptions and system observationstwo verbalization categories consistent with both relaxed and classic thinking aloudwere frequent but mainly of low relevance. Across all verbalizations, the positive or negative verbalizations were more often relevant than those without valence. Finally, moderated and unmoderated users made largely similar verbalizations, the main difference being a higher percentage of high-relevance verbalizations by unmoderated users.", "paper_title": "What Do Thinking-Aloud Participants Say? A Comparison of Moderated and Unmoderated Usability Sessions", "paper_id": "WOS:000360637100002"}