{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "secret_sharing"}, {"score": 0.007797071294747909, "phrase": "proposed_scheme"}, {"score": 0.004292212137716459, "phrase": "security_requirement"}, {"score": 0.0036419834462626125, "phrase": "basic_secret_sharing_schemes"}, {"score": 0.003602302241898501, "phrase": "verifiable_secret_sharing_schemes"}, {"score": 0.0035630518377071916, "phrase": "publicly_verifiable_secret_sharing_schemes"}, {"score": 0.0033363396054797044, "phrase": "central_objective"}, {"score": 0.0032819448594643853, "phrase": "rational_secret_sharing_scheme"}, {"score": 0.0031069334778456633, "phrase": "fairness_problem"}, {"score": 0.0030730639262332698, "phrase": "secret_reconstruction"}, {"score": 0.0027239390917424898, "phrase": "fair_notion"}, {"score": 0.0023107372754933887, "phrase": "basic_model"}, {"score": 0.0022605981305722344, "phrase": "shamir"}, {"score": 0.0021049977753042253, "phrase": "theoretical_analysis"}], "paper_keywords": [""], "paper_abstract": "In the setting of secret sharing, a group of parties wish to run a protocol for recovering the secret when they input their shares. The security requirement include privacy, correctness and others. One desirable property is fairness, which guarantees that if either party gets the secret, then the other party does too. However, basic secret sharing schemes, verifiable secret sharing schemes and publicly verifiable secret sharing schemes do not satisfy the fairness. Moreover, fairness is a central objective of the rational secret sharing scheme. In this work, the authors study the fairness problem of secret reconstruction in a (t, n) secret sharing scheme. They use a new approach to achieve the fairness of the protocol. They first define the fair notion of secret sharing probabilistically. Using the definition, a fair (t, n) secret sharing scheme is proposed, its security and fairness are shown against three different attack types. The proposed scheme is an extension of basic model of secret sharing (Shamir's scheme) and the approach of fairness of Dov Gordon et al.(STOC2008). Theoretical analysis shows that the proposed scheme is more efficient.", "paper_title": "Fair (t, n) threshold secret sharing scheme", "paper_id": "WOS:000321701300006"}