{"auto_keywords": [{"score": 0.04964317542118529, "phrase": "social_network_diffusion_optimization_problems"}, {"score": 0.00481495049065317, "phrase": "generalized_annotated_programs"}, {"score": 0.004698938469311569, "phrase": "extensive_work"}, {"score": 0.004327555970055785, "phrase": "\"optimal\"_decisions"}, {"score": 0.004262060185430346, "phrase": "observed_model"}, {"score": 0.00404667000994945, "phrase": "k_individuals"}, {"score": 0.004009801352242071, "phrase": "social_network"}, {"score": 0.0038187460155038383, "phrase": "campaign_managers"}, {"score": 0.0037380370652211315, "phrase": "k_customers"}, {"score": 0.0036702119930393903, "phrase": "free_sample"}, {"score": 0.0036256778700153227, "phrase": "maximal_\"buzz"}, {"score": 0.0031261427219715955, "phrase": "gap"}, {"score": 0.0025286424059485745, "phrase": "computational_complexity"}, {"score": 0.002482706594054615, "phrase": "np-completeness_results"}, {"score": 0.0023212839504822536, "phrase": "large_class"}, {"score": 0.002258305302735867, "phrase": "best_possible_approximation_ratio"}, {"score": 0.002237693583489426, "phrase": "polynomial_algorithm"}, {"score": 0.002157106830907686, "phrase": "prototype_experimental_implementation"}, {"score": 0.0021049977753042253, "phrase": "real-world_wikipedia_dataset"}], "paper_keywords": ["Theory", " Social network", " generalized annotated programs", " approximation algorithms"], "paper_abstract": "There has been extensive work in many different fields on how phenomena of interest (e.g., diseases, innovation, product adoption) \"diffuse\" through a social network. As social networks increasingly become a fabric of society, there is a need to make \"optimal\" decisions with respect to an observed model of diffusion. For example, in epidemiology, officials want to find a set of k individuals in a social network which, if treated, would minimize spread of a disease. In marketing, campaign managers try to identify a set of k customers that, if given a free sample, would generate maximal \"buzz\" about the product. In this article, we first show that the well-known Generalized Annotated Program (GAP) paradigm can be used to express many existing diffusion models. We then define a class of problems called Social Network Diffusion Optimization Problems (SNDOPs). SNDOPs have four parts: (i) a diffusion model expressed as a GAP, (ii) an objective function we want to optimize with respect to a given diffusion model, (iii) an integer k > 0 describing resources (e.g., medication) that can be placed at nodes, (iv) a logical condition VC that governs which nodes can have a resource (e.g., only children above the age of 5 can be treated with a given medication). We study the computational complexity of SNDOPs and show both NP-completeness results as well as results on complexity of approximation. We then develop an exact and a heuristic algorithm to solve a large class of SNDOPproblems and show that our GREEDY-SNDOP algorithm achieves the best possible approximation ratio that a polynomial algorithm can achieve (unless P = NP). We conclude with a prototype experimental implementation to solve SNDOPs that looks at a real-world Wikipedia dataset consisting of over 103,000 edges.", "paper_title": "Using Generalized Annotated Programs to Solve Social Network Diffusion Optimization Problems", "paper_id": "WOS:000320619600003"}