{"auto_keywords": [{"score": 0.04298722796533143, "phrase": "ml_black-boxes"}, {"score": 0.004636594774238505, "phrase": "machine_learning"}, {"score": 0.004408976280483648, "phrase": "self-containing_machine"}, {"score": 0.003759057920801288, "phrase": "inherent_problem"}, {"score": 0.0025541050375256992, "phrase": "feature_space"}, {"score": 0.002438699976481979, "phrase": "variable_dimensionality"}, {"score": 0.002338306897057454, "phrase": "binary_classifiers"}, {"score": 0.002299313860419974, "phrase": "multi-class_problem"}, {"score": 0.0022232633360792222, "phrase": "classifier's_machinery"}, {"score": 0.0021049977753042253, "phrase": "machine_learning_solutions"}], "paper_keywords": ["Machine learning black-boxes", " binary to multi-class classifiers", " support vector machines", " optimum-path forest", " visual words", " K-nearest neighbors"], "paper_abstract": "With several good research groups actively working in machine learning (ML) approaches, we have now the concept of self-containing machine learning solutions that oftentimes work out-of-the-box leading to the concept of ML black-boxes. Although it is important to have such black-boxes helping researchers to deal with several problems nowadays, it comes with an inherent problem increasingly more evident: we have observed that researchers and students are progressively relying on ML black-boxes and, usually, achieving results without knowing the machinery of the classifiers. In this regard, this paper discusses the use of machine learning black-boxes and poses the question of how far we can get using these out-of-the-box solutions instead of going deeper into the machinery of the classifiers. The paper focuses on three aspects of classifiers: (1) the way they compare examples in the feature space; (2) the impact of using features with variable dimensionality; and (3) the impact of using binary classifiers to solve a multi-class problem. We show how knowledge about the classifier's machinery can improve the results way beyond out-of-the-box machine learning solutions.", "paper_title": "HOW FAR DO WE GET USING MACHINE LEARNING BLACK-BOXES?", "paper_id": "WOS:000308104300007"}