{"auto_keywords": [{"score": 0.038725271259795684, "phrase": "outsourced_projects"}, {"score": 0.03821066921635996, "phrase": "internal_projects"}, {"score": 0.015294933297733172, "phrase": "control_mechanisms"}, {"score": 0.014347233680840243, "phrase": "internal_and_outsourced_projects"}, {"score": 0.014022988943833536, "phrase": "systems_development_performance"}, {"score": 0.00481495049065317, "phrase": "outsourced_software_projects"}, {"score": 0.004640398886726948, "phrase": "systems_development_projects"}, {"score": 0.004513631630494221, "phrase": "prior_research"}, {"score": 0.003822263046602146, "phrase": "paradoxical_overarching_pattern"}, {"score": 0.003752275718257509, "phrase": "greater_use"}, {"score": 0.0033428820402140683, "phrase": "attempted_control"}, {"score": 0.0031479142819948007, "phrase": "transaction_hazards"}, {"score": 0.003061793572858598, "phrase": "specific_informational_and_social_prerequisites"}, {"score": 0.0029234476524900794, "phrase": "systems_development_control_literature"}, {"score": 0.0028172726995962147, "phrase": "controller-driven_control_mechanisms"}, {"score": 0.002714943351733626, "phrase": "controllee-driven_control_mechanisms"}, {"score": 0.0025565050791036973, "phrase": "hitherto-missing_control-performance_link"}, {"score": 0.002418453525649304, "phrase": "pervasive_assertion"}, {"score": 0.0021049977753042253, "phrase": "control-performance_relationships"}], "paper_keywords": ["attempted control", " control theory", " information systems development", " project controls", " realized control", " survey research"], "paper_abstract": "Although the choice of control mechanisms in systems development projects has been extensively studied in prior research, differences in such choices across internal and outsourced projects and their effects on systems development performance have not received much attention. This study attempts to address this gap using data on 57 outsourced and 79 internal projects in 136 organizations. Our results reveal a paradoxical overarching pattern: controllers attempt greater use of control mechanisms in outsourced projects relative to internal projects, yet controls enhance systems development performance in internal projects but not in outsourced projects. We introduce a distinction between attempted control and realized control to explain this disconnect, and show how anticipated transaction hazards motivate the former but meeting specific informational and social prerequisites facilitate the latter. Our results contribute three new insights to the systems development control literature. First, controllers attempt to use controller-driven control mechanisms to a greater degree in outsourced projects but controllee-driven control mechanisms to a greater degree in internal projects. Second, we establish a hitherto-missing control-performance link. The nuanced differences in internal and outsourced projects simultaneously confirm and refute a pervasive assertion in the information systems controls literature that control enhances performance. Finally, we show how requirements volatility-which can be at odds with control-alters the control-performance relationships. Implications for theory and practice are also discussed.", "paper_title": "Control in Internal and Outsourced Software Projects", "paper_id": "WOS:000274628500002"}