{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "digital_images"}, {"score": 0.004676575291629554, "phrase": "automated_system"}, {"score": 0.004631335513513859, "phrase": "feature_recognition"}, {"score": 0.004542158659382197, "phrase": "morphometric_landmarks"}, {"score": 0.004141365648080381, "phrase": "shape_analysis"}, {"score": 0.004081385289516914, "phrase": "typical_shape_analysis_study"}, {"score": 0.0036493838225192883, "phrase": "important_and_labour-intensive_part"}, {"score": 0.003359647377874098, "phrase": "research_questions"}, {"score": 0.003107935254560724, "phrase": "single_training_image"}, {"score": 0.0028890603352364273, "phrase": "particular_data"}, {"score": 0.002672511078070529, "phrase": "multiple_training_images"}, {"score": 0.0023091721866305426, "phrase": "manual_identification"}, {"score": 0.0022536005664642294, "phrase": "generic_nature"}, {"score": 0.002231747358665628, "phrase": "intrinsic_capability"}, {"score": 0.002199363362666037, "phrase": "feature_recognition_process"}], "paper_keywords": [""], "paper_abstract": "The authors present an automated system for feature recognition in digital images. Morphometric landmarks are points that can be defined in all specimens and located precisely. They are widely used in shape analysis and a typical shape analysis study involves several hundred digital images. Presently, the extraction of landmarks is usually done manually and the process of identifying the landmarks is an important and labour-intensive part of any such analysis. This process is time-consuming, and quite often the research questions are dependent on the duration of obtaining these data. The authors show that a single training image with its landmark co-ordinates is enough to independently estimate the landmarks of any individual within a particular data set. The reliability and accuracy of the method can be further enhanced by using multiple training images. The precision, repeatability and robustness of the algorithm have been evaluated. It is shown in this study that the method is sufficiently accurate to replace the manual identification of landmarks. The generic nature and intrinsic capability of the feature recognition process enables this method to be easily incorporated into other recognition tasks.", "paper_title": "Automatic identification of landmarks in digital images", "paper_id": "WOS:000284306600002"}