{"auto_keywords": [{"score": 0.04933866662045337, "phrase": "augmented_space"}, {"score": 0.04788992596085788, "phrase": "visual_interface"}, {"score": 0.03981238870202312, "phrase": "distributed_system"}, {"score": 0.00481495049065317, "phrase": "common_objects"}, {"score": 0.004523865550323285, "phrase": "human_palm"}, {"score": 0.004098397888277889, "phrase": "actual_workspace"}, {"score": 0.0038907236419588255, "phrase": "multiple_depth_cameras"}, {"score": 0.0037321585095070483, "phrase": "scalable_client"}, {"score": 0.003598705020845104, "phrase": "depth_images"}, {"score": 0.0035614563596982306, "phrase": "different_cameras"}, {"score": 0.0032094634756436595, "phrase": "convenient_feature"}, {"score": 0.0029224275921964724, "phrase": "depth_cameras"}, {"score": 0.002633425544817301, "phrase": "location-based_context"}, {"score": 0.0022760856906838814, "phrase": "daily_life"}, {"score": 0.0021381565332182773, "phrase": "aforementioned_system"}], "paper_keywords": ["Location awareness", " Interface on body", " Augmented reality", " Ubiquitous", " System", " Interaction"], "paper_abstract": "We have created a visual interface using the human palm that is location sensitive and always available. To accomplish this, we constructed an augmented space in an actual workspace by installing several depth cameras. To manage and connect the multiple depth cameras, we constructed a distributed system based on scalable client--server architecture. By merging depth images from different cameras, the distributed system can track the locations of users within their area of coverage. The system also has a convenient feature that allows users to collect the locations of objects while visualizing the objects via images from the depth cameras. Consequently, the locations of both users and objects are available to the system, thus providing a location-based context for determining which user is close to which object. As a result, the visual interface on the palm becomes location sensitive, which could lead to various applications in daily life. In this paper, we describe the implementation of the aforementioned system and demonstrate its potential applicability.", "paper_title": "A location-sensitive visual interface on the palm: interacting with common objects in an augmented space", "paper_id": "WOS:000347292500016"}