{"auto_keywords": [{"score": 0.048266472457546075, "phrase": "hypothesis_space"}, {"score": 0.007329268577466841, "phrase": "uniformly_recursively_enumerable_hypothesis_space"}, {"score": 0.004814951563358001, "phrase": "angluin"}, {"score": 0.004753433756140211, "phrase": "zeugmann"}, {"score": 0.004573537724320323, "phrase": "language_class"}, {"score": 0.004486147558765763, "phrase": "uniformly_recursive_language_classes"}, {"score": 0.0042748769561032325, "phrase": "uniformly_recursively_enumerable_superclass"}, {"score": 0.0038941106036522216, "phrase": "subsequent_investigations"}, {"score": 0.003856702800468033, "phrase": "recursively_enumerable_hypothesis_spaces"}, {"score": 0.003770804164370454, "phrase": "present_work"}, {"score": 0.003468110711566472, "phrase": "recursively_enumerable_language_classes"}, {"score": 0.0033582480189327008, "phrase": "prescribed_learning"}, {"score": 0.0029052522125474446, "phrase": "explanatory_learning"}, {"score": 0.0027239972021363863, "phrase": "conservative_learning"}, {"score": 0.0026122745966589795, "phrase": "behaviourally_correct_learning"}, {"score": 0.0024970641749396784, "phrase": "prescribed_and_uniform_learning"}, {"score": 0.0022163995544178215, "phrase": "prudent_learner"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Inductive inference", " Prescribed learning", " Formal languages", " Recursion theory"], "paper_abstract": "This work extends studies of Angluin, Lange and Zeugmann on the dependence of learning on the hypothesis space chosen for the language class in the case of learning uniformly recursive language classes. The concepts of class-comprising (where the learner can choose a uniformly recursively enumerable superclass as the hypothesis space) and class-preserving (where the learner has to choose a uniformly recursively enumerable hypothesis space of the same class) are formulated in their study. In subsequent investigations, uniformly recursively enumerable hypothesis spaces have been considered. In the present work, we extend the above works by considering the question of whether learners can be effectively synthesized from a given hypothesis space in the context of learning uniformly recursively enumerable language classes. in our study, we introduce the concepts of prescribed learning (where there must be a learner for every uniformly recursively enumerable hypothesis space of the same class) and uniform learning (like prescribed, but the learner has to be synthesized effectively from an index of the hypothesis space). It is shown that while for explanatory learning, these four types of learnability coincide, some or all are different for other learning criteria. For example, for conservative learning, all four types are different. Several results are obtained for vacillatory and behaviourally correct learning; three of the four types can be separated, however the relation between prescribed and uniform learning remains open. It is also shown that every (not necessarily uniformly recursively enumerable) behaviourally correct learnable class has a prudent learner, that is, a learner using a hypothesis space such that the learner learns every set in the hypothesis space. Moreover the prudent learner can be effectively built from any learner for the class. (C) 2009 Elsevier B.V. All rights reserved.", "paper_title": "Prescribed learning of r.e. classes", "paper_id": "WOS:000265470900005"}