{"auto_keywords": [{"score": 0.04541162234501688, "phrase": "cd_process"}, {"score": 0.008713768692145006, "phrase": "continuous_deployment"}, {"score": 0.004581315009194603, "phrase": "emerging_software_development_process"}, {"score": 0.004518490762254563, "phrase": "facebook"}, {"score": 0.004493548126149749, "phrase": "microsoft"}, {"score": 0.004456448372652264, "phrase": "ibm"}, {"score": 0.004216736799385604, "phrase": "new_code"}, {"score": 0.004012011375577782, "phrase": "new_business_opportunities"}, {"score": 0.0039898841992120695, "phrase": "reduced_risk"}, {"score": 0.003891806560322573, "phrase": "wasted_software"}, {"score": 0.003233348735314861, "phrase": "software_practitioners"}, {"score": 0.0028944757265206332, "phrase": "deeper_understanding"}, {"score": 0.002730990733656141, "phrase": "individual_technical_and_social_adoption_challenges"}, {"score": 0.002693443037356295, "phrase": "case_study"}, {"score": 0.002527247425576091, "phrase": "mitigation_strategies"}, {"score": 0.0024994062909051143, "phrase": "case_study_organisation"}, {"score": 0.0024043497996540653, "phrase": "technical_and_social_adoption_challenges"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Continuous deployment", " Agile software development", " Lean software development", " Challenges and mitigation strategies"], "paper_abstract": "Context: Continuous Deployment (CD) is an emerging software development process with organisations such as Facebook, Microsoft, and IBM successfully implementing and using the process. The CD process aims to immediately deploy software to customers as soon as new code is developed, and can result in a number of benefits for organisations, such as: new business opportunities, reduced risk for each release, and prevent development of wasted software. There is little academic literature on the challenges organisations face when adopting the CD process, however there are many anecdotal challenges that organisations have voiced on their online blogs. Objective: The aim of this research is to examine the challenges faced by organisations when adopting CD as well as the strategies to mitigate these challenges. Method: An explorative case study technique that involves in-depth interviews with software practitioners in an organisation that has adopted CD was conducted to identify these challenges. Results: This study found a total of 20 technical and social adoption challenges that organisations may face when adopting the CD process. The results are discussed to gain a deeper understanding of the strategies employed by organisations to mitigate the impacts of these challenges. Conclusion: While a number of individual technical and social adoption challenges were uncovered by the case study in this research, most challenges were not faced in isolation. The severity of these challenges were reduced by a number of mitigation strategies employed by the case study organisation. It is concluded that organisations need to be well prepared to handle technical and social adoption challenges with their existing expertise, processes and tools before adopting the CD process. For practitioners, knowing how to address the challenges an organisation may face when adopting the CD process provides a level of awareness that they previously may not have had. (C) 2014 Elsevier B.V. All rights reserved.", "paper_title": "On the journey to continuous deployment: Technical and social challenges along the way", "paper_id": "WOS:000345947500002"}