{"auto_keywords": [{"score": 0.04503312379363993, "phrase": "project_risk"}, {"score": 0.03511498344372032, "phrase": "cm"}, {"score": 0.011948877653095736, "phrase": "causal_relationships"}, {"score": 0.00481495049065317, "phrase": "analyzing_information_systems_project_risk"}, {"score": 0.004709567162738894, "phrase": "internal_and_external_factors"}, {"score": 0.004555781299332848, "phrase": "causal_way"}, {"score": 0.004108589735101849, "phrase": "related_factors"}, {"score": 0.004033464035028803, "phrase": "important_fact"}, {"score": 0.003974349782102708, "phrase": "complicated_causal_relationships"}, {"score": 0.0038729688332870865, "phrase": "strong_need"}, {"score": 0.0035445401296650535, "phrase": "research_objective"}, {"score": 0.003479692058963528, "phrase": "cognitive_map"}, {"score": 0.0034034331737042363, "phrase": "macom"}, {"score": 0.003378385493203297, "phrase": "multi-agents_cognitive_map"}, {"score": 0.0031845067058084613, "phrase": "basic_intelligence"}, {"score": 0.0030239842475439814, "phrase": "unstructured_problems"}, {"score": 0.0028821607224183135, "phrase": "risk_management"}, {"score": 0.0026472970609754095, "phrase": "multi-agent_metaphor"}, {"score": 0.002404706573379854, "phrase": "new_computational_capability"}, {"score": 0.0023781827711414107, "phrase": "complicated_decision_problems"}, {"score": 0.002343271162668978, "phrase": "macom_framework"}, {"score": 0.0021363670305843403, "phrase": "project_managers"}, {"score": 0.0021049977753042253, "phrase": "robust_decision_support"}], "paper_keywords": [""], "paper_abstract": "Project risks encompass both internal and external factors that are interrelated, influencing others in a causal way. It is very important to identify those factors and their causal relationships to reduce the project risk. In the past, most IT companies evaluate project risk by roughly measuring the related factors, but ignoring the important fact that there are complicated causal relationships among them. There is a strong need to develop more effective mechanisms to systematically judge all factors related to project risk and identify the causal relationships among those factors. To accomplish this research objective, our study adopts a cognitive map (CM)-based mechanism called the MACOM (Multi-Agents COgnitive Map), where CM is represented by a set of multi-agents, each embedded with basic intelligence to determine its causal relationships with other agents. CM has proven especially useful in solving unstructured problems with many variables and causal relationships; however, simply applying CM to project risk management is not enough because most causal relationships are hard to identify and measure exactly. To overcome this problem, we have borrowed a multi-agent metaphor in which CM is represented by a set of multi-agents, and project risk is explained through the interaction of the multi-agents. Such an approach presents a new computational capability for resolving complicated decision problems. Using the MACOM framework, we have proved that the task of resolving the IS project risk management could be systematically and intelligently solved, and in this way, IS project managers can be given robust decision support.", "paper_title": "A Particle Swarm Optimization-Driven Cognitive Map Approach to Analyzing Information Systems Project Risk", "paper_id": "WOS:000266303800011"}