{"auto_keywords": [{"score": 0.04367732323962223, "phrase": "tcp"}, {"score": 0.005859573371925112, "phrase": "tcp-equal_share"}, {"score": 0.00481495049065317, "phrase": "tcp-friendly_congestion-control_schemes"}, {"score": 0.004437613070853689, "phrase": "tcp-equivalence_criterion"}, {"score": 0.004303830426772906, "phrase": "tcp-equivalent_flow"}, {"score": 0.004089725258435817, "phrase": "identical_network_conditions"}, {"score": 0.003788296551609616, "phrase": "packet-loss_conditions"}, {"score": 0.0036740168936985314, "phrase": "eight_typical_tcp-friendly_schemes"}, {"score": 0.0027883885425383534, "phrase": "simulation_results"}, {"score": 0.0027041907335656782, "phrase": "selected_schemes"}, {"score": 0.0023798115577749225, "phrase": "nonperiodic_losses"}, {"score": 0.0022382002476510573, "phrase": "fault_cases"}, {"score": 0.0021595094738887767, "phrase": "appropriate_policies"}, {"score": 0.0021049977753042253, "phrase": "ideal_scheme"}], "paper_keywords": [""], "paper_abstract": "Many TCP-friendly congestion control schemes have been proposed to pursue the TCP-equivalence criterion, which states that a TCP-equivalent flow should have the some throughput with TCP if it experiences identical network conditions as TCP. Additionally, the throughput should converge as fast as TCP when the packet-loss conditions change. This study classifies eight typical TCP-friendly schemes according to their underlying policies on fairness, aggressiveness, and responsiveness. The schemes are evaluated to verify whether they meet TCP-equivalence and TCP-equal share. TCP-equal share is a more realistic but more challenging criterion than TCP-equivalence and states that a flow should have the some throughput with TCP if competing with TCP for the some bottleneck. Simulation results indicate that one of the selected schemes, TCP-friendly rate control (TFRC), meets both criteria under more testing scenarios than the others. Additionally, the results under nonperiodic losses, low-multiplexing, two-state losses, and bursty losses reveal the causes that bring fault cases to the schemes. Finally, appropriate policies are recommended for an ideal scheme.", "paper_title": "Taxonomy and evaluation of TCP-Friendly congestion-control schemes on fairness, aggressiveness, and responsiveness", "paper_id": "WOS:000251032100002"}