{"auto_keywords": [{"score": 0.03888571701763213, "phrase": "computable_analysis"}, {"score": 0.00481495049065317, "phrase": "turing_machines_on_represented_sets"}, {"score": 0.004608121749000898, "phrase": "new_type"}, {"score": 0.004571478018964363, "phrase": "generalized_turing_machines"}, {"score": 0.004287546706167456, "phrase": "analysis"}, {"score": 0.004187049198138107, "phrase": "single_tape_cell"}, {"score": 0.004039221742250308, "phrase": "real_number"}, {"score": 0.003991110291836103, "phrase": "continuous_real_function"}, {"score": 0.003943569631183138, "phrase": "probability_measure"}, {"score": 0.003789147597643409, "phrase": "tte"}, {"score": 0.003640730820018083, "phrase": "main_result"}, {"score": 0.0034426417353349567, "phrase": "gtm_programming"}, {"score": 0.0033745298175222056, "phrase": "well_known_fact"}, {"score": 0.002818909613625567, "phrase": "gtm_model"}, {"score": 0.002730150696072947, "phrase": "well-known_techniques"}, {"score": 0.002708399936381754, "phrase": "turing_machine_theory"}, {"score": 0.002121913011761504, "phrase": "computable_functions"}, {"score": 0.0021049977753042253, "phrase": "finite_and_infinite_sequences"}], "paper_keywords": ["computable analysis", " model of computation", " generalized Turing machine"], "paper_abstract": "We introduce a new type of generalized Turing machines (GTMs), which are intended as a tool for the mathematician who studies computability in Analysis. In a single tape cell a GTM can store a symbol, a real number, a continuous real function or a probability measure, for example. The model is based on TTE, the representation approach for computable analysis. As a main result we prove that the functions that are computable via given representations are closed under GTM programming. This generalizes the well known fact that these functions are closed under composition. The theorem allows to speak about objects themselves instead of names in algorithms and proofs. By using GTMs for specifying algorithms, many proofs become more rigorous and also simpler and more transparent since the GTM model is very simple and allows to apply well-known techniques from Turing machine theory. We also show how finite or infinite sequences as names can be replaced by sets (generalized representations) on which computability is already defined via representations. This allows further simplification of proofs. All of this is done for multi-functions, which are essential in Computable Analysis, and multi-representations, which often allow more elegant formulations. As a byproduct we show that the computable functions on finite and infinite sequences of symbols are closed under programming with GTMs. We conclude with examples of application.", "paper_title": "TURING MACHINES ON REPRESENTED SETS, A MODEL OF COMPUTATION FOR ANALYSIS", "paper_id": "WOS:000301227100019"}