{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "correlation_analysis"}, {"score": 0.012009609439092038, "phrase": "different_feature_sets"}, {"score": 0.011236655688929627, "phrase": "feature_sets"}, {"score": 0.00477924690801092, "phrase": "dna_microarray_classification"}, {"score": 0.004726184966910756, "phrase": "accurate_classification"}, {"score": 0.004691136491297242, "phrase": "dna_microarray"}, {"score": 0.004042056914551798, "phrase": "mutually_error-correlated_ensemble_classifiers"}, {"score": 0.00383668723824441, "phrase": "optimal_ensemble"}, {"score": 0.003808209866576388, "phrase": "dna_analysis"}, {"score": 0.003724034990158436, "phrase": "large_features"}, {"score": 0.003405472159599445, "phrase": "similar_information"}, {"score": 0.0029667545082292376, "phrase": "feature_selection_methods"}, {"score": 0.00269263690712392, "phrase": "ensemble_classifiers"}, {"score": 0.0026626797255348287, "phrase": "ensemble_classifier"}, {"score": 0.002613487968156893, "phrase": "different_features"}, {"score": 0.002389696110283506, "phrase": "proposed_method"}, {"score": 0.002354302193867031, "phrase": "experimental_results"}, {"score": 0.002176887956041267, "phrase": "best_recognition_rates"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["ensemble", " DNA microarray", " correlation analysis"], "paper_abstract": "Since accurate classification of DNA microarray is a very important issue for the treatment of cancer, it is more desirable to make a decision by combining the results of various expert classifiers rather than by depending on the result of only one classifier. In spite of the many advantages of mutually error-correlated ensemble classifiers, they are limited in performance. It is difficult to create an optimal ensemble for DNA analysis that deals with few samples with large features. Usually, different feature sets are provided to learn the components of the ensemble expecting the improvement of classifiers. If the feature sets provide similar information, the combination of the classifiers trained from them cannot improve the performance because they will make the same error and there is no possibility of compensation. In this paper, we adopt correlation analysis of feature selection methods as a guideline of the separation of features to learn the components of ensemble. We propose two different correlation methods for the generation of feature sets to learn ensemble classifiers. Each ensemble classifier combines several other classifiers learned from different features and based on correlation analysis to classify cancer precisely. In this way, it is possible to systematically evaluate the performance of the proposed method with three benchmark datasets. Experimental results show that two ensemble classifiers whose components are learned from different feature sets that are negatively or complementarily correlated with each other produce the best recognition rates on the three benchmark datasets. (c) 2006 Elsevier B.V. All rights reserved.", "paper_title": "Ensemble classifiers based on correlation analysis for DNA microarray classification", "paper_id": "WOS:000242602300020"}