{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "musculoskeletal_models"}, {"score": 0.004592427776766215, "phrase": "musculoskeletal_disorders"}, {"score": 0.004526041191525413, "phrase": "important_aspects"}, {"score": 0.004493207015584002, "phrase": "shoulder_dysfunction"}, {"score": 0.004460609967916904, "phrase": "realistic_simulation"}, {"score": 0.004428248351415723, "phrase": "clavicular_and_scapular_movements"}, {"score": 0.004177631185971939, "phrase": "clavicular_and_scapular_anatomy"}, {"score": 0.003998983496539902, "phrase": "subject_measurements"}, {"score": 0.0038419163428806973, "phrase": "cadaveric_morphology"}, {"score": 0.0036775717816768133, "phrase": "measured_bone_rotations"}, {"score": 0.003213660268958121, "phrase": "experimental_data"}, {"score": 0.00293370839211022, "phrase": "existing_method"}, {"score": 0.002838993542880416, "phrase": "possible_joint_rotations"}, {"score": 0.002757365657304833, "phrase": "motion_constraints"}, {"score": 0.0025633909553815556, "phrase": "important_scapular"}, {"score": 0.002374351263279043, "phrase": "glenohumeral_joint_contact_force"}, {"score": 0.0021049977753042253, "phrase": "scapular_imbalance"}], "paper_keywords": ["Musculoskeletal model", " Shoulder kinematics", " Scapulothoracic", " Subject specific"], "paper_abstract": "Musculoskeletal models are intended to be used to assist in prevention and treatments of musculoskeletal disorders. To capture important aspects of shoulder dysfunction, realistic simulation of clavicular and scapular movements is crucial. The range of motion of these bones is dependent on thoracic, clavicular and scapular anatomy and therefore different for each individual. Typically, patient or subject measurements will therefore not fit on a model that uses a cadaveric morphology. Up till now, this problem was solved by adjusting measured bone rotations such that they fit on the model, but this leads to adjustments of on average 3.98A degrees and, in some cases, even more than 8A degrees. Two novel methods are presented that decrease this discrepancy between experimental data and simulations. For one method, the model is scaled to fit the subject, leading to a 34 % better fit compared to the existing method. In the other method, the set of possible joint rotations is increased by allowing some variation on motion constraints, resulting in a 42 % better fit. This change in kinematics also affected the kinetics: muscle forces of some important scapular stabilizing muscles, as predicted by the Delft Shoulder and Elbow Model, were altered by maximally 17 %. The effect on the glenohumeral joint contact force was however marginal (1.3 %). The methods presented in this paper might lead to more realistic shoulder simulations and can therefore be considered a step towards (clinical) application, especially for applications that involve scapular imbalance.", "paper_title": "Modelling clavicular and scapular kinematics: from measurement to simulation", "paper_id": "WOS:000332615300010"}