{"auto_keywords": [{"score": 0.04765378417869883, "phrase": "search_engines"}, {"score": 0.02581590435353388, "phrase": "computation_time"}, {"score": 0.024763674562134574, "phrase": "proposed_algorithm"}, {"score": 0.004159241394996858, "phrase": "large_extent"}, {"score": 0.004081385289516914, "phrase": "ranking_mechanism"}, {"score": 0.003802135020791801, "phrase": "large_amount"}, {"score": 0.0031769866037536045, "phrase": "search_engine"}, {"score": 0.003102752392819577, "phrase": "user_query"}, {"score": 0.0029594318330247614, "phrase": "main_idea"}, {"score": 0.002890270619403512, "phrase": "disco"}, {"score": 0.00266693888510356, "phrase": "document_summarization"}], "paper_keywords": ["Document summarization", " Search engine", " Topic"], "paper_abstract": "Over the past decade, more and more users of the Internet rely on the search engines to help them find the information they need. However, the information they find depends, to a large extent, on the ranking mechanism of the search engines they use. Not surprisingly, it generally consists of a large amount of information that is completely irrelevant. To help users of the Internet find the information they are looking for quickly, an efficient algorithm for building the summaries of a collection of documents found by a search engine in response to a user query, called DiSco (Distribution Scoring), is proposed. The main idea in the design of DiSco is to balance the rate of coverage and overlap in the selection of topic words for document summarization, especially when the datasets are large. Moreover, several measure methods such as coverage, overlap, and the computation time are employed in evaluating the performance of the proposed algorithm. All our simulation results indicate that the proposed algorithm outperforms all the state-of-the-art algorithms evaluated in terms of not only the quality of the summarizations but also the computation time.", "paper_title": "A NOVEL TOPIC SELECTION ALGORITHM BASED ON WORD DISTRIBUTION", "paper_id": "WOS:000276578000025"}