{"auto_keywords": [{"score": 0.04425005070909831, "phrase": "opfc"}, {"score": 0.015364937444782088, "phrase": "intrusion_detection"}, {"score": 0.01522524316457357, "phrase": "computer_networks"}, {"score": 0.014216658520745116, "phrase": "data_clustering"}, {"score": 0.008624205938959136, "phrase": "best_value"}, {"score": 0.00481495049065317, "phrase": "optimum-path_forest_clustering"}, {"score": 0.004555499634179394, "phrase": "nature-inspired_approach"}, {"score": 0.004472146692254812, "phrase": "probability_density_function"}, {"score": 0.004270347498153512, "phrase": "optimum-path_forest_algorithm"}, {"score": 0.0032215231177304513, "phrase": "k-nn_graph"}, {"score": 0.002843450389745497, "phrase": "remaining_samples"}, {"score": 0.0027913353347879507, "phrase": "clustering_effectiveness"}, {"score": 0.0027275289970185015, "phrase": "pdf_estimation"}, {"score": 0.0026775328564629577, "phrase": "proposed_approach"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Intrusion detection", " Optimum-path forest", " Meta-heuristic", " Clustering"], "paper_abstract": "We propose a nature-inspired approach to estimate the probability density function (pdf) used for data clustering based on the optimum-path forest algorithm (OPFC). OPFC interprets a dataset as a graph, whose nodes are the samples and each sample is connected to its k-nearest neighbors in a given feature space (a k-nn graph). The nodes of the graph are weighted by their pdf values and the pdf is computed based on the distances between the samples and their k-nearest neighbors. Once the k-nn graph is defined, OPFC finds one sample (root) at each maximum of the pdf and propagates one optimum-path tree (cluster) from each root to the remaining samples of its dome. Clustering effectiveness will depend on the pdf estimation, and the proposed approach efficiently computes the best value of k for a given application. We validate our approach in the context of intrusion detection in computer networks. First, we compare OPFC with data clustering based on k-means, and self-organization maps. Second, we evaluate several metaheuristic techniques to find the best value of k. (C) 2014 Elsevier Inc. All rights reserved.", "paper_title": "A nature-inspired approach to speed up optimum-path forest clustering and its application to intrusion detection in computer networks", "paper_id": "WOS:000346542800008"}