{"auto_keywords": [{"score": 0.04896670205094256, "phrase": "knowledge_management"}, {"score": 0.014660062129451435, "phrase": "case_study"}, {"score": 0.00481495049065317, "phrase": "crucial_role"}, {"score": 0.004382737590042589, "phrase": "advanced_semiconductor_engineering"}, {"score": 0.003510754567808717, "phrase": "top_managements'_support"}, {"score": 0.00344062888674746, "phrase": "organization_culture_enablers"}, {"score": 0.003216804708106142, "phrase": "informational_technology"}, {"score": 0.003131393466870228, "phrase": "training_courses"}, {"score": 0.003058515297281172, "phrase": "employee_incentive_program"}, {"score": 0.00300749708357049, "phrase": "executing_key_factor"}, {"score": 0.0029672941061574375, "phrase": "informational_technology_enablers"}, {"score": 0.0028498718992429825, "phrase": "speedy_search"}, {"score": 0.0024993218789131437, "phrase": "business_field"}, {"score": 0.0024084679931209514, "phrase": "dedicated_unit"}, {"score": 0.0023365892290481472, "phrase": "key_enablers"}, {"score": 0.0021192223086507946, "phrase": "different_departments"}], "paper_keywords": ["knowledge management", " knowledge management systems", " corporate strategy", " leadership", " organizational culture", " communication technologies"], "paper_abstract": "Purpose - To analyze the crucial role that enablers play in carrying out knowledge management within the enterprise. Design/methodology/approach - This research uses the method of a case study and has directed the survey on Advanced Semiconductor Engineering, Inc. (ASE) and VIA Technologies, Inc. (VIA). It is anticipated through the case study of these two companies that it will be possible to verify the finding of enablers concluded by other papers, thus showing the inter-relationship between theory and business. Findings - It is found that among the enablers: on the part of strategy and leadership; obtaining top managements' support is most important; among organization culture enablers is the forming of an atmosphere and culture of sharing is most important but needs to be supplemented by informational technology; among people enablers, other than training courses and channels that provide learning, employee incentive program is one of the executing key factor; and among informational technology enablers, other than the digitization of documents, the function of speedy search of information for its re-use is becoming more and more important. Practical implications - The result of this study not just validates theory with reality; it also provides a reference for the academia as well as the business field. Originality/value - This paper has discovered that establishing a dedicated unit for implementing knowledge management is also one of the key enablers. Its role does not just stop at managing knowledge, but instead it plays the role of furthering knowledge management by taking on the duty of assisting and coordinating different departments in their communication.", "paper_title": "Knowledge management enablers: a case study", "paper_id": "WOS:000239331700011"}