{"auto_keywords": [{"score": 0.04980781719029459, "phrase": "multiple_devices"}, {"score": 0.02322730111336099, "phrase": "efficient_switching"}, {"score": 0.006395818454237814, "phrase": "web-centric_approach"}, {"score": 0.005824543704111322, "phrase": "response_time"}, {"score": 0.004575053987970206, "phrase": "managing_interoperability"}, {"score": 0.004523380792307973, "phrase": "health_systems"}, {"score": 0.0042493917291653105, "phrase": "clinical_care"}, {"score": 0.004201381218977942, "phrase": "intensive_care_units"}, {"score": 0.003958049372486465, "phrase": "staff_members"}, {"score": 0.0038471623091755804, "phrase": "faster_and_more_accurate_decisions"}, {"score": 0.0036657112797367376, "phrase": "icu."}, {"score": 0.0036449324377347023, "phrase": "key_functionalities"}, {"score": 0.003492788016691268, "phrase": "medical_staff"}, {"score": 0.0034631271853732405, "phrase": "tailored_and_dynamic_information"}, {"score": 0.003216358543603351, "phrase": "optimal_user_experience"}, {"score": 0.0030908254851076005, "phrase": "appropriate_medical_information"}, {"score": 0.003038532168038562, "phrase": "selected_device"}, {"score": 0.0026963662375234124, "phrase": "user_experience"}, {"score": 0.0026658551560513662, "phrase": "performance_tests"}, {"score": 0.0025040966350544135, "phrase": "performance_loss"}, {"score": 0.002475755804232436, "phrase": "concurrent_use"}, {"score": 0.0023926387830753033, "phrase": "responsive_solution"}, {"score": 0.0021049977753042253, "phrase": "acceptable_range"}], "paper_keywords": ["Computer-assisted decision making", " decision support systems", " clinical/organization and administration", " intensive care units", " information systems", " User-computer interface"], "paper_abstract": "Introduction: This article is part of the Focus Theme of Methods of Information in Medicine on \"Managing Interoperability and Complexity in Health Systems\". Objectives: Handheld computers, such as tablets and smartphones, are becoming more and more accessible in the clinical care setting and in Intensive Care Units (ICUs). By making the most useful and appropriate data available on multiple devices and facilitate the switching between those devices, staff members can efficiently integrate them in their workflow, allowing for faster and more accurate decisions. This paper addresses the design of a platform for the efficient switching between multiple devices in the ICU. The key functionalities of the platform are the integration of the platform into the workflow of the medical staff and providing tailored and dynamic information at the point of care. Methods: The platform is designed based on a 3-tier architecture with a focus on extensibility, scalability and an optimal user experience. After identification to a device using Near Field Communication (NFC), the appropriate medical information will be shown on the selected device. The visualization of the data is adapted to the type of the device. A web-centric approach was used to enable extensibility and portability. Results: A prototype of the platform was thoroughly evaluated. The scalability, performance and user experience were evaluated. Performance tests show that the response time of the system scales linearly with the amount of data. Measurements with up to 20 devices have shown no performance loss due to the concurrent use of multiple devices. Conclusions: The platform provides a scalable and responsive solution to enable the efficient switching between multiple devices., Due to the web-centric approach new devices can easily be integrated. The performance and scalability of the platform have been evaluated and it was shown that the response time and scalability of the platform was within an acceptable range.", "paper_title": "Platform for Efficient Switching between Multiple Devices in the Intensive Care Unit", "paper_id": "WOS:000347868300002"}