{"auto_keywords": [{"score": 0.03759935662216038, "phrase": "monks"}, {"score": 0.00481495049065317, "phrase": "new_possibilities"}, {"score": 0.004776297980616768, "phrase": "case-based_explanation"}, {"score": 0.0047379542803396915, "phrase": "artificial_neural_network_ensembles"}, {"score": 0.004424160689087029, "phrase": "practical_usability"}, {"score": 0.004301046274139699, "phrase": "erroneous_decision"}, {"score": 0.003935892934907777, "phrase": "decision_boundary"}, {"score": 0.0038890179881491257, "phrase": "ann"}, {"score": 0.003675023529026644, "phrase": "new_methods"}, {"score": 0.00363080961099728, "phrase": "explanation_process"}, {"score": 0.003308986613384597, "phrase": "emergency_department"}, {"score": 0.003282383509542342, "phrase": "wild_university_hospital"}, {"score": 0.0031909403420958752, "phrase": "good_explanations"}, {"score": 0.0030278017562213265, "phrase": "best_method"}, {"score": 0.0028498718992429825, "phrase": "significant_overlap"}, {"score": 0.0021479597698614373, "phrase": "explanatory_aid"}, {"score": 0.0021220787047953093, "phrase": "ann_ensembles"}, {"score": 0.0021049977753042253, "phrase": "clinical_decision_support_systems"}], "paper_keywords": ["Neural network ensembles", " Sensitivity analysis", " Case-based explanation", " Acute coronary syndrome"], "paper_abstract": "Artificial neural network (ANN) ensembles have long Suffered from a lack of interpretability. This has severely limited the practical usability of ANNs in settings where an erroneous decision can be disastrous. Several attempts have been made to alleviate this problem. Many of them are based on decomposing the decision boundary of the ANN into a set Of rules. We explore and compare a set of new methods for this explanation process on two artificial data sets (Monks I and 3), and one acute Corollary Syndrome data set consisting of 86 1 electrocardiograms (ECG) collected retrospectively at the emergency department at Wild University Hospital. The algorithms managed to extract good explanations in more than 84% of the cases. More to the point, the best method provided 99% and 91% good explanations in Monks data 1 and 3 respectively. Also there was a significant overlap between the algorithms. Furthermore, when explaining a given ECG, the overlap between this method and one of the physicians was the same as the one between the two physicians in this study. Still the physicians were significantly, p-value <0.001, More similar to each other than to any of the methods. The algorithms have the potential to be Used as an explanatory aid when Using ANN ensembles in clinical decision Support Systems. (C) 2008 Elsevier Ltd. All rights reserved,", "paper_title": "Exploring new possibilities for case-based explanation of artificial neural network ensembles", "paper_id": "WOS:000263405000008"}