{"auto_keywords": [{"score": 0.04289640444279875, "phrase": "dem"}, {"score": 0.00893431880964138, "phrase": "texture_image"}, {"score": 0.00471003041684707, "phrase": "new_method"}, {"score": 0.004556901872357751, "phrase": "special_focus"}, {"score": 0.004523552067565685, "phrase": "data_synchronization"}, {"score": 0.004218602458288531, "phrase": "aerial_photograph"}, {"score": 0.003977741661623133, "phrase": "large_disparate_data"}, {"score": 0.0039341294012600085, "phrase": "compression_strategy"}, {"score": 0.003615217162972726, "phrase": "scalability_requirement"}, {"score": 0.003309877074892399, "phrase": "multiresolution_nature"}, {"score": 0.0030751605843937673, "phrase": "perceptually_transparent_data_hiding_strategy"}, {"score": 0.0030414326261072183, "phrase": "dwt"}, {"score": 0.002996992362027833, "phrase": "proposed_method"}, {"score": 0.0028153046221865386, "phrase": "original_dem"}, {"score": 0.0026252106881752067, "phrase": "pioneering_methods"}, {"score": 0.0025963890234079333, "phrase": "scalable_embedding"}, {"score": 0.0023421547766273036, "phrase": "real-time_environments"}, {"score": 0.002159951198924152, "phrase": "useful_insight"}], "paper_keywords": ["3-D visualization", " data hiding", " data synchronization", " Digital Elevation Model (DEM)", " Discrete Wavelet Transform (DWT)", " Geographic Information System (GIS)", " JPEG2000"], "paper_abstract": "In this paper a new method is presented for 3-D terrain visualization via reversible JPEC2000-based blind data hiding with special focus on data synchronization and scalability. Online real-time 3-D terrain visualization involves considerable amount of data. The process is essentially the mapping of the aerial photograph, called texture, onto its corresponding digital elevation model (DEM) implying at least two distinct data inputs. The presence of large disparate data necessitates a compression strategy on one hand and the integration of the DEM and texture into one unit on the other. Whilst the compression must accommodate the scalability requirement originated by the diversity of clients, the unification of data ought to be synchronous. For scalability this paper relies on the multiresolution nature of the DWT-based JPEG2000 standard whereas the synchronized unification of DEM with the texture is realized by the application of a perceptually transparent data hiding strategy in the DWT domain. The proposed method is blind in the sense that only a secret key, if any, and the size of the original DEM are needed to extract the data from the texture image. We believe that this is one of the pioneering methods to propose scalable embedding of DEM in the texture image. The method is cost effective, in terms of memory and bandwidths, which is an advantage, especially, in real-time environments when quicker transfer of data is required. The results of a 3-D visualization simulation effected with our method were encouraging and gave a useful insight to the effectiveness of our method in various bandwidth scenarios.", "paper_title": "Scalable 3-D Terrain Visualization Through Reversible JPEG2000-Based Blind Data Hiding", "paper_id": "WOS:000261310700004"}