{"auto_keywords": [{"score": 0.0475359022069799, "phrase": "hcm"}, {"score": 0.0454803188274876, "phrase": "los_categories"}, {"score": 0.004815079206685399, "phrase": "los"}, {"score": 0.004636594774238505, "phrase": "important_contributions"}, {"score": 0.003986581218661184, "phrase": "flow_condition"}, {"score": 0.003903789851015775, "phrase": "measured_condition"}, {"score": 0.003559387846675818, "phrase": "los_analysis"}, {"score": 0.003485437176235259, "phrase": "different_approaches"}, {"score": 0.0032181231788427655, "phrase": "flow_condition_x"}, {"score": 0.002971249577042111, "phrase": "varying_combinations"}, {"score": 0.0028609920171902186, "phrase": "six_combinations"}, {"score": 0.002564862727498502, "phrase": "current_hcm_practice"}, {"score": 0.0022800613046444563, "phrase": "appropriate_analytical_framework"}, {"score": 0.0021049977753042253, "phrase": "mathematical_framework"}], "paper_keywords": [""], "paper_abstract": "The introduction of the concept of level of service (LOS) and the process to measure it are important contributions of the Highway Capacity Manual (HCM). Recently, the usefulness and validity of the LOS categories have been reexamined. One underlying issue is how to handle uncertainty embedded in the definition of LOS, measurement of the flow condition, and matching the measured condition with the LOS categories. HCM suggests the \"use of judgment\" to handle uncertainty. The aspects of uncertainty involved in LOS analysis are examined, and different approaches to quantify the uncertainty, depending on its nature, are suggested. The truth of the statement \"flow condition X is LOS = Z\" is determined by a deterministic, probabilistic, or possibilistic framework, depending on the character of X and Z. For varying combinations of X and Z, different frames of analysis must be used. Six combinations of types of X and Z are identified. One extreme is when both X and Z are assumed to be precise; such is the current HCM practice. The other extreme is when the boundaries of Z and X are assumed to be vague. Between these two extremes, four cases are identified, and an appropriate analytical framework is suggested for each. Results indicate that the aspects of uncertainty should be understood and that the mathematical framework selected for analysis should be consistent with the types of uncertainty involved.", "paper_title": "Frameworks to represent uncertainty when level of service is determined", "paper_id": "WOS:000245460800007"}