{"auto_keywords": [{"score": 0.041595628124362086, "phrase": "associated_knowledge"}, {"score": 0.015719716506582538, "phrase": "assembly_process"}, {"score": 0.015573597099571271, "phrase": "learning_objects"}, {"score": 0.014184012882418355, "phrase": "coherent_assembling_process"}, {"score": 0.0046364836476864325, "phrase": "conceptual_framework"}, {"score": 0.003930000775297499, "phrase": "i.e._requirements"}, {"score": 0.003643807817480753, "phrase": "educational_ontologies"}, {"score": 0.0033465923623290034, "phrase": "ontoglue_approach"}, {"score": 0.0032376465741070274, "phrase": "enhanced_description"}, {"score": 0.0027961342030212353, "phrase": "first_lo"}, {"score": 0.0027178867838199734, "phrase": "second_lo"}, {"score": 0.0021656385587456952, "phrase": "advanced_comparison"}, {"score": 0.0021049977753042253, "phrase": "assembly_and_search_processes"}], "paper_keywords": ["eLearning", " Meta-data", " Learning objects", " Standards", " Assembly", " Automatization", " Requirements", " Competencies", " Reuse", " Algorithm", " Ontology", " Taxonomy", " Mapping"], "paper_abstract": "This paper describes the conceptual framework OntoGlue for the assembly of learning objects (LOs). To permit a coherent assembling process from the point of view of requirements and competencies, OntoGlue enhances the definition of LOs by including associated knowledge (i.e. requirements and competencies) in their conceptual data schema. This associated knowledge is defined in terms of classes of educational ontologies (used as taxonomies), possibly related by mappings. There are several advantages associated with the OntoGlue approach. Firstly, it provides an enhanced description of the LOs, which permits their search and reuse by considering requirements and competencies. Secondly, during the assembly process of two LOs, OntoGlue checks that the competencies of the first LO cover the requirements of the second LO, guaranteeing a coherent assembling process from the requirements and competencies' point of view. Thirdly, OntoGlue automatically calculates the meta-data of the resulting assembled LO. Finally, the definition of the associated knowledge in terms of classes of ontologies, possibly related by mappings, permits an advanced comparison of requirements and competencies during assembly and search processes.", "paper_title": "Comparison of knowledge during the assembly process of learning objects", "paper_id": "WOS:000279464000003"}