{"auto_keywords": [{"score": 0.046292060088215244, "phrase": "broad-band_diffuse_fields"}, {"score": 0.014199531007749918, "phrase": "novel_method"}, {"score": 0.008522424382275112, "phrase": "previous_works"}, {"score": 0.00809453225548677, "phrase": "quiet_zones"}, {"score": 0.007518967536238915, "phrase": "larger_zones"}, {"score": 0.007128721543628063, "phrase": "new_method"}, {"score": 0.006407555872070964, "phrase": "acoustic_pressure"}, {"score": 0.00481495049065317, "phrase": "active_systems_using"}, {"score": 0.004034649282040889, "phrase": "conventional_methods"}, {"score": 0.0035956327252723483, "phrase": "conventional_design_methods"}, {"score": 0.0030876784650745973, "phrase": "preliminary_experiment"}, {"score": 0.0029753513692467315, "phrase": "simulation_results"}, {"score": 0.002938821840519756, "phrase": "main_contributions"}, {"score": 0.002618730478351454, "phrase": "conventional_method"}, {"score": 0.0025547994452342266, "phrase": "active_control"}, {"score": 0.0025338369486914364, "phrase": "pure_tone"}, {"score": 0.0021049977753042253, "phrase": "computer_simulations"}], "paper_keywords": ["Quiet zones", " Broad-band diffuse fields", " A novel method", " 2-norm", " infinity-norm"], "paper_abstract": "This study evaluates the performance of quiet zones in broad-band diffuse fields using two and three channel systems. A novel method of designing zones of quiet has been proposed to obtain larger zones of quiet than are obtained with conventional methods. The principle of this new method is to maximize the area of the 10dB quiet zones over space and frequency in broad-band diffuse fields. This is in contrast to the conventional design methods, where the acoustic pressure is set to zero at given cancellation points, or the acoustic pressure is minimized over an area using 2-norm and infinity-norm strategies. It is shown that larger zones of quiet are obtained using this new method. A preliminary experiment has also been carried out to Validate the simulation results. The main contributions of the paper are as follows. (1) A novel method of designing active systems to generate zones of quiet in broad-band diffuse fields is proposed. This novel method differs from the conventional method and previous works related to the active control of pure tone and broad-band diffuse fields. (2) Larger zones of quiet are obtained using the novel method proposed in this work compared to the results obtained in previous works. (3) This study analyzes quiet zones in broad-band diffuse fields through computer simulations and experiments. However, previous works have only performed computer simulations.", "paper_title": "PERFORMANCE EVALUATION OF ACTIVE SYSTEMS USING THE NOVEL METHOD OF DESIGNING LARGER QUIET ZONES IN DIFFUSE FIELDS", "paper_id": "WOS:000312435200021"}