{"auto_keywords": [{"score": 0.0384355763171722, "phrase": "packet_delay"}, {"score": 0.03342284336483737, "phrase": "longest_path"}, {"score": 0.029672211346433313, "phrase": "sis"}, {"score": 0.00481495049065317, "phrase": "dynamic_networks"}, {"score": 0.0035918997861791972, "phrase": "lis"}, {"score": 0.0030148941188459987, "phrase": "topological_order"}, {"score": 0.002898378776839434, "phrase": "similar_way"}, {"score": 0.0026206146061151917, "phrase": "polynomial_upper_bound"}, {"score": 0.002475532161577715, "phrase": "open_problem"}, {"score": 0.0024113009621042677, "phrase": "queueing_network"}, {"score": 0.0023798115577749225, "phrase": "greedy_contention-resolution_protocol"}, {"score": 0.002287783663138828, "phrase": "particular_stability_threshold"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["parallel computing", " networks", " delay bounds", " stability bounds", " adversarial queueing theory"], "paper_abstract": "In this work, we study the impact of dynamically changing link capacities on the delay bounds of LIS (Longest-In-System) and SIS (Shortest-In-System) protocols on specific networks (that can be modelled as Directed Acyclic Graphs (DAGs)) and stability bounds of greedy contention-resolution protocols running on arbitrary networks under the Adversarial Queueing Theory. Especially, we consider the model of dynamic capacities, where each link capacity may take on integer values from [1, C] with C > 1, under a (w, rho)-adversary. We show that the packet delay on DAGs for LIS is upper bounded by O(iw rho C) and lower bounded by Omega(iw rho C) where i is the level of a node in a DAG (the length of the longest path leading to node v when nodes are ordered by the topological order induced by the graph). In a similar way, we show that the performance of SIS on DAGs is lower bounded by Omega(iw rho C), while the existence of a polynomial upper bound for packet delay on DAGs when SIS is used for contention-resolution remains an open problem. We prove that every queueing network running a greedy contention-resolution protocol is stable for a rate not exceeding a particular stability threshold, depending on C and the length of the longest path in the network. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Performance and stability bounds for dynamic networks", "paper_id": "WOS:000245827300004"}