{"auto_keywords": [{"score": 0.03279713920666235, "phrase": "multiple_antennas"}, {"score": 0.0048155331565145915, "phrase": "mimo"}, {"score": 0.00475254914916922, "phrase": "mobile_ad_hoc_networks"}, {"score": 0.00457013354092966, "phrase": "new_communication_scheme"}, {"score": 0.0041170581247889654, "phrase": "adjacent_nodes"}, {"score": 0.003384695931421288, "phrase": "multiple_close_nodes"}, {"score": 0.0031845067058084613, "phrase": "multiple_transmitting_nodes"}, {"score": 0.0030487828775502563, "phrase": "upper_and_lower_bounds"}, {"score": 0.002893505913503472, "phrase": "wireless_channel"}, {"score": 0.002831158147480665, "phrase": "large_and_small-scale_fluctuations"}, {"score": 0.0027461155463816772, "phrase": "monte-carlo_simulation"}, {"score": 0.002722288966917744, "phrase": "point-to-point_and_cooperative_mimo_communications"}, {"score": 0.0025059724686541263, "phrase": "non-cooperative_schemes"}, {"score": 0.002266931093770838, "phrase": "lower_and_upper_bounds"}, {"score": 0.002237477619351199, "phrase": "ergodic_capacity"}, {"score": 0.0021049977753042253, "phrase": "elsevier_inc."}], "paper_keywords": ["Ad hoc network", " Ergodic capacity", " Information theory", " MIMO system"], "paper_abstract": "In this paper, we introduce a new communication scheme based on cooperative multiple-input multiple-output (MIMO) communication for mobile ad hoc networks (MANETs) in which nodes are endowed with M antennas. According to our new approach, adjacent nodes no longer interfere with each other but rather cooperate attempting to communicate concurrently. In our scheme, during transmissions, the nodes send packets from only one of their antennas, while during reception, they use all of their antennas to receive and decode packets from multiple close nodes simultaneously. Therefore, each distributed MIMO system in this scheme consists of multiple transmitting nodes acting as a single-array of multiple antennas. We derive upper and lower bounds on the receiver node ergodic capacity in the network where the wireless channel is modeled with both large and small-scale fluctuations. These bounds are compared with Monte-Carlo simulation of point-to-point and cooperative MIMO communications in MANETs. We demonstrate that the capacity of MANETs with multiple antennas is improved using cooperation compared to non-cooperative schemes, i.e., point-to-point MIMO communication. In addition, under the above communication model, we demonstrate that the lower and upper bounds of the ergodic capacity grows linearly with the number of receiving antennas M. (C) 2013 Elsevier Inc. All rights reserved.", "paper_title": "A new distributed cooperative MIMO scheme for mobile ad hoc networks", "paper_id": "WOS:000316774700006"}