{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_communities"}, {"score": 0.006886519417712533, "phrase": "success_factors"}, {"score": 0.00357395617690842, "phrase": "basic_preferences"}, {"score": 0.0035339597999254064, "phrase": "distinct_priorities"}, {"score": 0.0034944094552943, "phrase": "different_stakeholders"}, {"score": 0.003284637361174143, "phrase": "previous_work"}, {"score": 0.0028857130140890787, "phrase": "online_survey"}, {"score": 0.002743105561254975, "phrase": "german_speaking_internet"}, {"score": 0.0024926348205500715, "phrase": "first_empirically_validated_insights"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["virtual communities", " success factors", " stakeholders of virtual communities", " community building", " community management", " electronic commerce"], "paper_abstract": "Virtual communities have been the focus of research for some time. However, although many studies have provided recommendations on how to build, extend, and manage virtual communities, few have verified the success factors they have considered essential for virtual communities. Conclusions made regarding basic preferences and distinct priorities of different stakeholders in virtual communities have not been empirically substantiated. Building on previous work on success factors of virtual communities, in this article, we present a ranking of success factors discussed in the literature based on an online survey among operators and members of virtual communities in the German speaking Internet. Consequently, we identified and analyzed incongruencies between members and operators. This research gains first empirically validated insights into success factors for establishing and managing virtual communities. We derived recommendations for operators of virtual communities on the basis of the findings, and we present an agenda for future research in the field.", "paper_title": "Exploring success factors of virtual communities: The perspectives of members and operators", "paper_id": "WOS:000242470600007"}