{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "recommender"}, {"score": 0.0047563776685277314, "phrase": "guidance_strategies"}, {"score": 0.004669845451682529, "phrase": "personal_mashup_learning_environments"}, {"score": 0.004339108074589304, "phrase": "personal_learning_environments"}, {"score": 0.0041825926310470616, "phrase": "self-regulated_learning"}, {"score": 0.0037921662574137535, "phrase": "traditional_learning_environments"}, {"score": 0.0036329805216306576, "phrase": "ples_demand_specific_meta-skills"}, {"score": 0.0023507916951658455, "phrase": "cognitive_and_meta-cognitive_learning_activities"}, {"score": 0.0021441057555396013, "phrase": "role_infrastructure"}, {"score": 0.0021049977753042253, "phrase": "quantitative_and_qualitative_evaluation"}], "paper_keywords": ["self-regulated learning", " personal learning environments", " recommender", " widget", " widget store", " mashup", " ontology", " learning activities"], "paper_abstract": "This article presents an approach that supports the creation of personal learning environments (PLE) suitable for self-regulated learning (SRL). PLEs became very popular in recent years offering more personal freedom to learners than traditional learning environments. However, creating and configuring PLEs demand specific meta-skills that not all learners have. This situation leads to the challenge how learners can be supported to create PLEs that are useful to achieve their intended learning outcomes. The theory of SRL describes learners as self-regulated if they are capable of taking over control of the own learning process. Grounding on that theory, a model has been elaborated that offers guidance for the creation of PLEs containing tools for cognitive and meta-cognitive learning activities. The implementation of this approach has been done in the context of the ROLE infrastructure. A quantitative and qualitative evaluation with teachers describes advantages and ideas for improvement.", "paper_title": "Recommender and Guidance Strategies for Creating Personal Mashup Learning Environments", "paper_id": "WOS:000331779200022"}