{"auto_keywords": [{"score": 0.036828180880018095, "phrase": "sert"}, {"score": 0.00481495049065317, "phrase": "pharmacophore_design"}, {"score": 0.004698000536608171, "phrase": "selective_monoamine_neurotransmitter_transporter_ligands"}, {"score": 0.004342430078306461, "phrase": "mental_health_conditions"}, {"score": 0.004013662619667083, "phrase": "alzheimer's_disease"}, {"score": 0.003974349782102708, "phrase": "parkinson's_disease"}, {"score": 0.0032319109979344184, "phrase": "pharmacophore_models"}, {"score": 0.0023346234464901978, "phrase": "new_therapeutic_agents"}, {"score": 0.0023117182131967523, "phrase": "mental_health_applications"}, {"score": 0.002233301265743633, "phrase": "close_analogues"}, {"score": 0.0022113879114507577, "phrase": "known_mat_ligands"}], "paper_keywords": ["noradrenaline transporter", " dopamine transporter", " serotonin transporter", " pharmacophores", " database searching"], "paper_abstract": "Neuronal monoamine transporters (MATs) are involved in the pathophysiology and treatment of mental health conditions such as depression, attention deficit hyperactivity disorder, substance abuse and neurodegenerative disorders including Alzheimer's disease and Parkinson's disease. Various structural classes of compounds have been synthesized and tested in vitro for activity against transporters of three monoamine signaling molecules: noradrenaline (NET); serotonin (SERT) and dopamine (DAT). We have developed and validated a number of pharmacophore models describing the interaction of two classes of compounds with each of these three MATs. These pharmacophores explain the selectivity of binding to the MATs for various compound classes and have been used to search in silico, databases for novel, potentially selective ligands. These ligands, after confirmation of their activities, will provide tools for investigating the function of MATs as well as the potential for new therapeutic agents in mental health applications. The database searches also retrieved close analogues of known MAT ligands, further validating the approach. (c) 2007 Elsevier Inc. All rights reserved.", "paper_title": "Pharmacophore design and database searching for selective monoamine neurotransmitter transporter ligands", "paper_id": "WOS:000254721700009"}