{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "consumer_heterogeneity"}, {"score": 0.048255519436473625, "phrase": "neural_networks"}, {"score": 0.04269961316230681, "phrase": "neural_network_rule_extraction_algorithm"}, {"score": 0.0044800522651664695, "phrase": "business_intelligence_application"}, {"score": 0.004238307626560739, "phrase": "eating-out_behavior"}, {"score": 0.004191578449591973, "phrase": "taiwan"}, {"score": 0.00392153537973826, "phrase": "identifiable_segments"}, {"score": 0.0029544572689681934, "phrase": "demographic_information"}, {"score": 0.0022880528191813083, "phrase": "distinct_consumer_segments"}, {"score": 0.0021763973978248005, "phrase": "good_accuracy"}, {"score": 0.0021049977753042253, "phrase": "elsevier_bv"}], "paper_keywords": ["Business intelligence", " Decision tree", " Neural network", " Eating-out prediction", " Rule extraction"], "paper_abstract": "This paper describes a business intelligence application of neural networks in analyzing consumer heterogeneity in the context of eating-out behavior in Taiwan. We apply a neural network rule extraction algorithm which automatically groups the consumers into identifiable segments according to their sociodemographic information. Within each of these segments, the consumers are distinguished between those who eat-out frequently from those who do not based on their psychological traits and eat-out considerations. The data set for this study has been collected through a survey of 800 Taiwanese consumers. Demographic information such as gender, age and income were recorded. In addition, information about their psychological traits and eating-out considerations that might influence the frequency of eating-out were obtained. The results of our data analysis show that the neural network rule extraction algorithm is able to find distinct consumer segments and predict the consumers within each segment with good accuracy. (C) 2010 Elsevier BV.. All rights reserved.", "paper_title": "Understanding consumer heterogeneity: A business intelligence application of neural networks", "paper_id": "WOS:000282208200013"}