{"auto_keywords": [{"score": 0.04214975952162296, "phrase": "pcst"}, {"score": 0.0039065863652424475, "phrase": "pctsp"}, {"score": 0.003631671435460452, "phrase": "edge_costs"}, {"score": 0.003294875957676514, "phrase": "useful_theoretical_tool"}, {"score": 0.003018468582368033, "phrase": "real-world_telecommunications_networks"}, {"score": 0.0026466064623118105, "phrase": "natural_linear_programming_relaxation"}, {"score": 0.0025829353063908256, "phrase": "integrality_gap"}, {"score": 0.0022756672722130424, "phrase": "unified_technique"}, {"score": 0.002242647404307089, "phrase": "prize-collecting_algorithms"}, {"score": 0.0021674482571326283, "phrase": "integrality_gap_barrier"}, {"score": 0.0021049977753042253, "phrase": "prize-collecting_steiner_tree"}], "paper_keywords": ["approximation algorithms", " Steiner tree", " traveling salesman", " prize-collecting"], "paper_abstract": "We study the PRIZE-COLLECTING STEINER TREE (PCST), PRIZE-COLLECTING TRAVELING SALESMAN (PCTSP), and PRIZE-COLLECTING PATH (PC-PATH) problems. Given a graph (V, E) with a cost on each edge and a penalty (a.k.a. prize) on each node, the goal is to find a tree (for PCST), cycle (for PCTSP), or path (for PC-PATH) that minimizes the sum of the edge costs in the tree/cycle/path and the penalties of the nodes not spanned by it. In addition to being a useful theoretical tool for helping to solve other optimization problems, PCST has been applied fruitfully by AT&T to the optimization of real-world telecommunications networks. The most recent improvements for the first two problems, a 2-approximation algorithm for each, appeared first in 1992; a 2-approximation for PC-PATH appeared in 2003. The natural linear programming relaxation of PCST has an integrality gap of 2, which has been a barrier to further improvements for this problem. We present (2-epsilon)-approximation algorithms for all three problems, connected by a unified technique for improving prize-collecting algorithms that allows us to circumvent the integrality gap barrier. Specifically, our approximation ratio for PRIZE-COLLECTING STEINER TREE is below 1.9672.", "paper_title": "IMPROVED APPROXIMATION ALGORITHMS FOR PRIZE-COLLECTING STEINER TREE AND TSP", "paper_id": "WOS:000289974100004"}