{"auto_keywords": [{"score": 0.04701209021022985, "phrase": "online_banking"}, {"score": 0.004312622975366676, "phrase": "trustworthiness_perceptions"}, {"score": 0.004265354774450696, "phrase": "trustor_dispositions"}, {"score": 0.004058951880810154, "phrase": "downstream_influence"}, {"score": 0.0033837135367113004, "phrase": "oblind_trusto"}, {"score": 0.0033465923623290034, "phrase": "oblind_distrusto_perspectives"}, {"score": 0.00280496585980086, "phrase": "distinct_constructs"}, {"score": 0.0027437235598539904, "phrase": "established_e-retailing_trust_nomological_network"}, {"score": 0.00241658945942583, "phrase": "distrust's_negative_effect"}, {"score": 0.0021049977753042253, "phrase": "online_banking_context"}], "paper_keywords": ["distrust", " electronic business", " electronic commerce", " online banking", " trust"], "paper_abstract": "This study examines the effects of trustworthiness perceptions and trustor dispositions on trust and distrust as well as the downstream influence of trust and distrust on intention to use online banking. More than 500 college students located across two universities completed a survey to provide data for the study. The findings from this study suggest that the oblind trusto and oblind distrusto perspectives used in isolation are incomplete and that a more comprehensive model of trust requires the inclusion of both perspectives. As hypothesized, results also support the assertion that trust and distrust are distinct constructs and that the established e-retailing trust nomological network holds in an online banking context. The study also contributes to the literature by establishing several distrust antecedents, as well as illustrating distrust's negative effect on intention to use online banking. Finally, the study illustrates how the influence of trust can overwhelm the effect of distrust in an online banking context.", "paper_title": "The Productive Tension of Trust and Distrust: The Coexistence and Relative Role of Trust and Distrust in Online Banking", "paper_id": "WOS:000283369700002"}