{"auto_keywords": [{"score": 0.049390246951185, "phrase": "system_software"}, {"score": 0.00481495049065317, "phrase": "smmp_os._designing"}, {"score": 0.004587835274176236, "phrase": "shared-memory_multiprocessors"}, {"score": 0.003949377440799037, "phrase": "lock_contention"}, {"score": 0.003056169480391946, "phrase": "distributed_systems"}, {"score": 0.002855934865505357, "phrase": "smmp_operating_systems"}, {"score": 0.0026430660986106955, "phrase": "natural_mapping"}, {"score": 0.0026175952455594277, "phrase": "independent_requests"}, {"score": 0.002592369213499121, "phrase": "independent_code_paths"}, {"score": 0.0025673856614952854, "phrase": "data_structures"}, {"score": 0.002387507583705495, "phrase": "object_implementations"}, {"score": 0.002285674008055581, "phrase": "concrete_examples"}, {"score": 0.002263639474937039, "phrase": "distributed_objects"}, {"score": 0.0021566056345478373, "phrase": "distributed_implementations"}, {"score": 0.0021049977753042253, "phrase": "operating-system-intensive_parallel_workloads"}], "paper_keywords": ["design", " locality", " concurrency", " distribution", " scalability SMMP"], "paper_abstract": "Designing and implementing system software so that it scales well on shared-memory multiprocessors (SMMPs) has proven to be surprisingly challenging. To improve scalability, most designers to date have focused on concurrency by iteratively eliminating the need for locks and reducing lock contention. However, our experience indicates that locality is just as, if not more, important and that focusing on locality ultimately leads to a more scalable system. In this paper, we describe a methodology and a framework for constructing system software structured for locality, exploiting techniques similar to those used in distributed systems. Specifically, we found two techniques to be effective in improving scalability of SMMP operating systems: (i) an object-oriented structure that minimizes sharing by providing a natural mapping from independent requests to independent code paths and data structures, and (ii) the selective partitioning, distribution, and replication of object implementations in order to improve locality. We describe concrete examples of distributed objects and our experience implementing them. We demonstrate that the distributed implementations improve the scalability of operating-system-intensive parallel workloads.", "paper_title": "Experience distributing objects in an SMMP OS", "paper_id": "WOS:000249327100001"}