{"auto_keywords": [{"score": 0.004793203387266194, "phrase": "plant_micrornas"}, {"score": 0.004739262340543531, "phrase": "short_rna_sequences"}, {"score": 0.004539739665787636, "phrase": "arabidopsis_thaliana"}, {"score": 0.004251210982670317, "phrase": "specific_tissue_types"}, {"score": 0.004203343568960231, "phrase": "high_throughput_approach"}, {"score": 0.004081385289516914, "phrase": "novel_statistical_and_algorithmic_techniques"}, {"score": 0.003847941142006433, "phrase": "additional_predefined_matrix_x"}, {"score": 0.0037532257703888315, "phrase": "new_matrix"}, {"score": 0.0035304746064960912, "phrase": "desired_output"}, {"score": 0.00348279167515198, "phrase": "efficient_target_prediction_engine"}, {"score": 0.003459191419478298, "phrase": "mrna_targets"}, {"score": 0.0034435465205842172, "phrase": "query_micrornas"}, {"score": 0.0034124679487298015, "phrase": "optimal_duplex"}, {"score": 0.003328435742168866, "phrase": "short_query"}, {"score": 0.003159337923955675, "phrase": "putative_binding_sites"}, {"score": 0.003137922568959775, "phrase": "query_rna"}, {"score": 0.0030955250132409964, "phrase": "hybridization_energy"}, {"score": 0.003067577724136682, "phrase": "predefined_threshold"}, {"score": 0.0030467824582741557, "phrase": "second_module"}, {"score": 0.003026127736667187, "phrase": "association_operation"}, {"score": 0.0029515810021277797, "phrase": "efficient_t-test"}, {"score": 0.0028399580599632766, "phrase": "computationally_intensive_part"}, {"score": 0.0027449684441263234, "phrase": "entire_process"}, {"score": 0.002714014662631513, "phrase": "target_prediction_engine"}, {"score": 0.0026834089938596708, "phrase": "efficient_approximate_hybridization_search_algorithm"}, {"score": 0.0026113524778702624, "phrase": "search_space"}, {"score": 0.002552781867125423, "phrase": "time_complexity"}, {"score": 0.0025239898026543964, "phrase": "almost_linear"}, {"score": 0.002489866586003267, "phrase": "sparse_set"}, {"score": 0.0023848164282879885, "phrase": "novel_tool"}, {"score": 0.002263549360744245, "phrase": "plant_arabidopsis_thaliana"}, {"score": 0.0021977491933672572, "phrase": "biologically_interesting_and_statistically_strong_relations"}, {"score": 0.0021049977753042253, "phrase": "phototropic_stimulations"}], "paper_keywords": ["microRNA", " RNA folding", " RNA secondary structure", " minimum free energy", " sparse dynamic programming", " dynamic programming with convex energy functions", " statistical significance", " expression profiling"], "paper_abstract": "Plant microRNAs ( miRNAs) are short RNA sequences that bind to target mRNAs and change their expression levels by redirecting their stabilities and marking them for cleavage. In Arabidopsis thaliana, microRNAs have been shown to regulate development and are believed to impact expression both under various conditions, such as stress and stimuli, as well as in specific tissue types. We present a high throughput approach for associating between microRNAs and conditions in which they act, using novel statistical and algorithmic techniques. Our new tool, miRNAXpress, at first computes a ( binary) matrix T denoting the potential targets of microRNAs. Then, using T and an additional predefined matrix X indicating expression of genes under various conditions, it produces a new matrix that predicts associations between microRNAs and the conditions in which they act. Thus, the program comprises two main modules that work in tandem to compute the desired output. The first is an efficient target prediction engine that predicts mRNA targets of query microRNAs by evaluating the optimal duplex that could be formed between the two: given a short query RNA, a long target RNA, and a predefined energy cut-off threshold, the program finds and reports all putative binding sites of the query RNA in the target RNA with hybridization energy bounded by the predefined threshold. The second module realizes an association operation that is computed by a method which relies on an efficient t-test to compute the associations. The calculation of the matrix of microRNAs and their potential targets is the computationally intensive part of the work done by miRNAXpress, and therefore an efficient algorithm for this portion facilitates the entire process. Thus, the target prediction engine is based on an efficient approximate hybridization search algorithm whose efficiency is the result of utilizing the sparsity of the search space without sacrificing the optimality of the results. The time complexity of this algorithm is almost linear in the size of a sparse set of locations where base-pairs are stacked at a height of three or more. Thus miRNAXpress is a novel tool for associating between microRNAs and the conditions in which they act. We employed it to conduct a study, using the plant Arabidopsis thaliana as our model organism. By applying miRNAXpress to 98 microRNAs and 380 conditions, some biologically interesting and statistically strong relations were discovered. For example, mir159C activity is possibly a factor in the misresponse of nph4 mutants to phototropic stimulations.", "paper_title": "A high-throughput approach for associating MicroRNAs with their activity conditions", "paper_id": "WOS:000236954700009"}