{"auto_keywords": [{"score": 0.048839643896770986, "phrase": "mixed_networks"}, {"score": 0.03868281927175725, "phrase": "people's_decision-making"}, {"score": 0.02707079529952794, "phrase": "extensive_domain_modeling"}, {"score": 0.00481495049065317, "phrase": "open_mixed_networks"}, {"score": 0.004783483480147339, "phrase": "computer_systems"}, {"score": 0.004614038128321949, "phrase": "group_settings"}, {"score": 0.004392565073466714, "phrase": "heterogeneous_human-computer_groups"}, {"score": 0.003916098498242888, "phrase": "decision-making_strategies"}, {"score": 0.003631390978147703, "phrase": "novel_approach"}, {"score": 0.0035141291835319682, "phrase": "social_attributes"}, {"score": 0.003479692058963528, "phrase": "open-network_setting"}, {"score": 0.0033673122420551952, "phrase": "computer-agent_strategies"}, {"score": 0.002982068153662372, "phrase": "configurable_system"}, {"score": 0.002962543869356265, "phrase": "colored_trails"}, {"score": 0.00260630351276416, "phrase": "realistic_analogue"}, {"score": 0.0025892330566358503, "phrase": "multi-agent_task_domains"}, {"score": 0.0024891269874339553, "phrase": "payoff_matrices"}, {"score": 0.0024328318508843386, "phrase": "cl"}, {"score": 0.0024007585788965655, "phrase": "identical_payoff_matrix_decision-making_context"}, {"score": 0.0023462869209637726, "phrase": "ct"}, {"score": 0.002330790244117364, "phrase": "agent_researchers"}, {"score": 0.0022928018832993387, "phrase": "strategy_design"}, {"score": 0.0022041312401435346, "phrase": "social_factors"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Human-Computer decision-making", " Negotiation"], "paper_abstract": "Computer systems increasingly carry out tasks in mixed networks, that is in group settings in which they interact both with other computer systems and with people. Participants in these heterogeneous human-computer groups vary in their capabilities, goals, and strategies; they may cooperate, collaborate, or compete. The presence of people in mixed networks raises challenges for the design and the evaluation of decision-making strategies for computer agents. This paper describes several new decision-making models that represent, learn and adapt to various social attributes that influence people's decision-making and presents a novel approach to evaluating such models. It identifies a range of social attributes in an open-network setting that influence people's decision-making and thus affect the performance of computer-agent strategies, and establishes the importance of learning and adaptation to the success of such strategies. The settings vary in the capabilities, goals, and strategies that people bring into their interactions. The studies deploy a configurable system called Colored Trails (CT) that generates a family of games. CT is an abstract, conceptually simple but highly versatile game in which players negotiate and exchange resources to enable them to achieve their individual or group goals. It provides a realistic analogue to multi-agent task domains, while not requiring extensive domain modeling. It is less abstract than payoff matrices, and people exhibit less strategic and more helpful behavior in Cl than in the identical payoff matrix decision-making context. By not requiring extensive domain modeling, CT enables agent researchers to focus their attention on strategy design, and it provides an environment in which the influence of social factors can be better isolated and studied. (C) 2010 Published by Elsevier B.V.", "paper_title": "Agent decision-making in open mixed networks", "paper_id": "WOS:000284667900002"}