{"auto_keywords": [{"score": 0.04205963193676696, "phrase": "action_rule"}, {"score": 0.011423366391491899, "phrase": "flexible_attributes"}, {"score": 0.00481495049065317, "phrase": "interesting_action_rules"}, {"score": 0.004781357546476652, "phrase": "action_rules"}, {"score": 0.004616859702338596, "phrase": "e-action_rules"}, {"score": 0.003042599375218838, "phrase": "new_decision_class"}, {"score": 0.002896819408461957, "phrase": "data_mining_literature"}, {"score": 0.0028564621282167685, "phrase": "subjective_measures"}, {"score": 0.002473786357109046, "phrase": "objective_measure"}, {"score": 0.0023387234705715154, "phrase": "user-defined_threshold_values"}, {"score": 0.0021049977753042253, "phrase": "cooperative_answering"}], "paper_keywords": [""], "paper_abstract": "Action rules introduced in [12] and extended further to e-action rules [21] have been investigated in [22], [13], [20]. They assume that attributes in a database are divided into two groups: stable and flexible. In general, an action rule can be constructed from two rules extracted earlier from the same database. Furthermore, we assume that these two rules describe two different decision classes and our goal is to re-classify objects from one of these classes into the other one. Flexible attributes are essential in achieving that goal since they provide a tool for making hints to a user what changes within some values of flexible attributes are needed for a given set of objects to re-classify them into a new decision class. There are two aspects of interestingness of rules that have been studied in data mining literature, objective and subjective measures [8], [1], [1,4], [15], [23]. In this paper we focus on a cost of an action rule which was introduced in [22] as an objective measure. An action rule was called interesting if its cost is below and support higher than some user-defined threshold values. We assume that our attributes are hierarchical and we focus on solving the failing problem of interesting action rules discovery. Our process is cooperative and it has some similarities with cooperative answering of queries presented in [3] [5] [6].", "paper_title": "Cooperative discovery of interesting action rules", "paper_id": "WOS:000238575000041"}