{"auto_keywords": [{"score": 0.043730223860063755, "phrase": "skype"}, {"score": 0.006084942828429946, "phrase": "telemedicine_services"}, {"score": 0.00481495049065317, "phrase": "skype-"}, {"score": 0.004801759397770505, "phrase": "clinical_applications"}, {"score": 0.0044933373574179624, "phrase": "low-cost_and_no-cost_software-based_video_tools"}, {"score": 0.004276794599014972, "phrase": "low-resource_settings"}, {"score": 0.0038236703468417215, "phrase": "previous_review"}, {"score": 0.003687568028560351, "phrase": "clinical_use"}, {"score": 0.0034981720122414153, "phrase": "clinical_services"}, {"score": 0.003286438857042431, "phrase": "aim"}, {"score": 0.0029862071871499295, "phrase": "clinical_care"}, {"score": 0.002966578246443101, "phrase": "clinical_education"}, {"score": 0.00289888453546698, "phrase": "single_search_term"}, {"score": 0.0026171408377811687, "phrase": "chronic_diseases"}, {"score": 0.0025913692304671675, "phrase": "cardiovascular_diseases"}, {"score": 0.0025405829212597586, "phrase": "educational_and_speech_and_language_pathology_applications"}, {"score": 0.002482585701725093, "phrase": "developed_countries"}, {"score": 0.002263508433567761, "phrase": "pragmatic_approach"}, {"score": 0.0021972723598946446, "phrase": "formal_studies"}, {"score": 0.002175626278359828, "phrase": "clinical_and_economic_benefits"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ireland_ltd."}], "paper_keywords": ["Telemedicine", " Telehealth", " Developing countries"], "paper_abstract": "Background: Low-cost and no-cost software-based video tools may be a feasible and effective way to provide some telemedicine services, particularly in low-resource settings. One of the most popular tools is Skype; it is freely available, may be installed on many types of devices, and is easy to use by clinicians and patients. While a previous review found no evidence in favor of, or against the clinical use of Skype, anecdotally it is believed to be widely used in healthcare for providing clinical services. However, the range of clinical applications in which Skype has been used has not been described. Aim: We aimed to identify and summarize the clinical applications of Skype. Methods: We reviewed the literature to identify studies that reported the use of Skype in clinical care or clinical education. We searched three electronic databases using the single search term \"Skype\". Results: We found 239 unique articles. Twenty seven of the articles met our criteria for further review. The use of Skype was most prevalent in the management of chronic diseases such as cardiovascular diseases and diabetes, followed by educational and speech and language pathology applications. Most reported uses were in developed countries. In all but one case, Skype was reported by the authors to be feasible and to have benefit. However, while Skype may be a pragmatic approach to providing telemedicine services, in the absence of formal studies, the clinical and economic benefits remain unclear. (C) 2015 Published by Elsevier Ireland Ltd.", "paper_title": "The clinical use of Skype-For which patients, with which problems and in which settings? A snapshot review of the literature", "paper_id": "WOS:000360562100002"}