{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "blackboard-style_lecture_videos"}, {"score": 0.011509796556906616, "phrase": "lecture_videos"}, {"score": 0.00458940888106061, "phrase": "existing_video_player_interfaces"}, {"score": 0.0043511221096418475, "phrase": "lecture_material"}, {"score": 0.003629392214109574, "phrase": "visual_transcripts"}, {"score": 0.003459191419478298, "phrase": "visual_information"}, {"score": 0.003422462630994095, "phrase": "transcript_text"}, {"score": 0.003332332086930163, "phrase": "visual_transcript"}, {"score": 0.0032272929113113203, "phrase": "visual_content"}, {"score": 0.0031422859551159506, "phrase": "discrete_visual_entities"}, {"score": 0.0028543298631502107, "phrase": "temporal_correspondence"}, {"score": 0.0026771333996253783, "phrase": "visual_entities"}, {"score": 0.0025109095718850376, "phrase": "linear_layout"}, {"score": 0.0023675986784123656, "phrase": "standard_video_player"}], "paper_keywords": ["Video summarization", " Video navigation", " Lecture videos", " Blackboard-style lectures"], "paper_abstract": "Blackboard-style lecture videos are popular, but learning using existing video player interfaces can be challenging. Viewers cannot consume the lecture material at their own pace, and the content is also difficult to search or skim. For these reasons, some people prefer lecture notes to videos. To address these limitations, we present Visual Transcripts, a readable representation of lecture videos that combines visual information with transcript text. To generate a Visual Transcript, we first segment the visual content of a lecture into discrete visual entities that correspond to equations, figures, or lines of text. Then, we analyze the temporal correspondence between the transcript and visuals to determine how sentences relate to visual entities. Finally, we arrange the text and visuals in a linear layout based on these relationships. We compare our result with a standard video player, and a state-of-the-art interface designed specifically for blackboard-style lecture videos. User evaluation suggests that users prefer our interface for learning and that our interface is effective in helping them browse or search through lecture videos.", "paper_title": "Visual Transcripts: Lecture Notes from Blackboard-Style Lecture Videos", "paper_id": "WOS:000363671200076"}