{"auto_keywords": [{"score": 0.00481495049065317, "phrase": "multi-channel_feature_generation_mechanism"}, {"score": 0.004744437370338926, "phrase": "scene_categorization"}, {"score": 0.004342430078306461, "phrase": "scene_categories"}, {"score": 0.003974349782102708, "phrase": "image_properties"}, {"score": 0.0036373553416391823, "phrase": "popular_multichannel_descriptors"}, {"score": 0.0032800186243040663, "phrase": "feature_and_channel_levels"}, {"score": 0.0026867260506696455, "phrase": "hyperopponent_color_space"}, {"score": 0.0026084451971464867, "phrase": "embedding_sobel_information"}, {"score": 0.002551231163230566, "phrase": "opponent_color_space"}, {"score": 0.0023869914500743083, "phrase": "established_multichannel_descriptors"}, {"score": 0.0021049977753042253, "phrase": "descriptors'_performance"}], "paper_keywords": ["Scene categorization", " multi-channel descriptor", " CENTRIST", " channel interaction", " hyper opponent color space"], "paper_abstract": "mCENTRIST, a new multichannel feature generation mechanism for recognizing scene categories, is proposed in this paper. mCENTRIST explicitly captures the image properties that are encoded jointly by two image channels, which is different from popular multichannel descriptors. In order to avoid the curse of dimensionality, tradeoffs at both feature and channel levels have been executed to make mCENTRIST computationally practical. As a result, mCENTRIST is both efficient and easy to implement. In addition, a hyperopponent color space is proposed by embedding Sobel information into the opponent color space for further performance improvements. Experiments show that mCENTRIST outperforms established multichannel descriptors on four RGB and RGB-near infrared data sets, including aerial orthoimagery, indoor, and outdoor scene category recognition tasks. Experiments also verify that the hyper opponent color space enhances descriptors' performance effectively.", "paper_title": "mCENTRIST: A Multi-Channel Feature Generation Mechanism for Scene Categorization", "paper_id": "WOS:000329581800026"}