{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "sentence-level_clustering"}, {"score": 0.04872101245158561, "phrase": "theme-based_summarization"}, {"score": 0.004564401713056939, "phrase": "pivotal_role"}, {"score": 0.00445318311339027, "phrase": "topic_themes"}, {"score": 0.004344662696228875, "phrase": "highly_related_sentences"}, {"score": 0.0039362878637371574, "phrase": "bag-of-words_cosine_similarity"}, {"score": 0.0037621210719690594, "phrase": "special_treatment"}, {"score": 0.0037159680715717056, "phrase": "sentence_similarity"}, {"score": 0.0035515148917169173, "phrase": "sentence-level_clustering_problem"}, {"score": 0.0034935290662899488, "phrase": "concept-and_context-enriched_sentence_vector_representations"}, {"score": 0.0033115124244647736, "phrase": "theme-based_summarization-integrated_clustering"}, {"score": 0.00313894917464766, "phrase": "explicit_role"}, {"score": 0.0031132086055691214, "phrase": "sentence_clustering"}, {"score": 0.0030876784650745973, "phrase": "independent_text_objects"}, {"score": 0.002797121441432477, "phrase": "two-level_co"}, {"score": 0.0022117133940361025, "phrase": "clear_advantage"}, {"score": 0.002166607745253829, "phrase": "quality_evaluation"}, {"score": 0.002139986159978777, "phrase": "summarization_evaluation"}, {"score": 0.0021049977753042253, "phrase": "document_understanding_conferences"}], "paper_keywords": [""], "paper_abstract": "Sentence clustering plays a pivotal role in theme-based summarization, which discovers topic themes defined as the clusters of highly related sentences to avoid redundancy and cover more diverse information. As the length of sentences is short and the content it contains is limited, the bag-of-words cosine similarity traditionally used for document clustering is no longer suitable. Special treatment for measuring sentence similarity is necessary. In this article, we study the sentence-level clustering problem. After exploiting concept-and context-enriched sentence vector representations, we develop two co-clustering frameworks to enhance sentence-level clustering for theme-based summarization-integrated clustering and interactive clustering-both allowing word and document to play an explicit role in sentence clustering as independent text objects rather than using word or concept as features of a sentence in a document set. In each framework, we experiment with two-level co-clustering (i.e., sentence-word co-clustering or sentence-document co-clustering) and three-level co-clustering (i.e., document-sentence-word co-clustering). Compared against concept-and context-oriented sentence-representation reformation, co-clustering shows a clear advantage in both intrinsic clustering quality evaluation and extrinsic summarization evaluation conducted on the Document Understanding Conferences (DUC) datasets.", "paper_title": "Enhancing Sentence-Level Clustering With Integrated and Interactive Frameworks for Theme-Based Summarization", "paper_id": "WOS:000295458700017"}