{"auto_keywords": [{"score": 0.04777281030275485, "phrase": "computer_system"}, {"score": 0.00481495049065317, "phrase": "large-scale_study"}, {"score": 0.0044991925146184025, "phrase": "frequent_assumption"}, {"score": 0.0041269626762569095, "phrase": "poisson_process"}, {"score": 0.0037854112749311844, "phrase": "poisson_distribution"}, {"score": 0.003145417398038261, "phrase": "almost_three_years"}, {"score": 0.0029570303644956128, "phrase": "poisson_process_model"}, {"score": 0.002849442549612025, "phrase": "log-normal_distribution"}, {"score": 0.0026458370516131255, "phrase": "detected_intrusions"}, {"score": 0.0025027144548626975, "phrase": "pareto_distribution"}, {"score": 0.00230950802983053, "phrase": "first_intrusion"}, {"score": 0.0021049977753042253, "phrase": "successful_intrusion"}], "paper_keywords": ["Invasive software (viruses, worms, Trojan horses)", " risk management", " network management"], "paper_abstract": "A frequent assumption in the domain of cybersecurity is that cyberintrusions follow the properties of a Poisson process, i.e., that the number of intrusions is well modeled by a Poisson distribution and that the time between intrusions is exponentially distributed. This paper studies this property by analyzing all cyberintrusions that have been detected across more than 260,000 computer systems over a period of almost three years. The results show that the assumption of a Poisson process model might be unoptimal-the log-normal distribution is a significantly better fit in terms of modeling both the number of detected intrusions and the time between intrusions, and the Pareto distribution is a significantly better fit in terms of modeling the time to first intrusion. The paper also analyzes whether time to compromise (TTC) increase for each successful intrusion of a computer system. The results regarding this property suggest that time to compromise decrease along the number of intrusions of a system.", "paper_title": "A Large-Scale Study of the Time Required to Compromise a Computer System", "paper_id": "WOS:000331301100002"}