{"auto_keywords": [{"score": 0.04137315141208966, "phrase": "feature_representation"}, {"score": 0.00481495049065317, "phrase": "unconstrained_face_recognition"}, {"score": 0.004615202066192795, "phrase": "low-level_feature_operators"}, {"score": 0.0045376817307636284, "phrase": "sift"}, {"score": 0.004204320052179726, "phrase": "raw_pixel_values"}, {"score": 0.004081385289516914, "phrase": "subsequent_processing"}, {"score": 0.003639835714755229, "phrase": "critically_important_implications"}, {"score": 0.003503497128638099, "phrase": "large-scale_feature_search_approach"}, {"score": 0.0030457198309616694, "phrase": "brute-force_search"}, {"score": 0.002931569771634119, "phrase": "standard_machine_learning_blending_techniques"}, {"score": 0.0027390784124778312, "phrase": "lfw"}, {"score": 0.0024012441367538434, "phrase": "conceptually_simpler_machine_learning_backend"}, {"score": 0.002215081186105616, "phrase": "richer_base"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Face recognition", " Biologically-inspired"], "paper_abstract": "Many modern computer vision algorithms are built atop of a set of low-level feature operators (such as SIFT [23,24]; HOG [8,3]; or LBP [1,2]) that transform raw pixel values into a representation better suited to subsequent processing and classification. While the choice of feature representation is often not central to the logic of a given algorithm, the quality of the feature representation can have critically important implications for performance. Here, we demonstrate a large-scale feature search approach to generating new, more powerful feature representations in which a multitude of complex, nonlinear, multilayer neuromorphic feature representations are randomly generated and screened to find those best suited for the task at hand. In particular, we show that a brute-force search can generate representations that, in combination with standard machine learning blending techniques, achieve state-of-the-art performance on the Labeled Faces in the Wild (LFW) [19] unconstrained face recognition challenge set. These representations outperform previous state-of-the-art approaches, in spite of requiring less training data and using a conceptually simpler machine learning backend. We argue that such large-scale-search-derived feature sets can play a synergistic role with other computer vision approaches by providing a richer base of features with which to work. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "High-throughput-derived biologically-inspired features for unconstrained face recognition", "paper_id": "WOS:000304181000004"}