{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "web_accessibility"}, {"score": 0.00475382761232911, "phrase": "survey_approach"}, {"score": 0.004653667500876187, "phrase": "access_-_accessibility"}, {"score": 0.004310173770196077, "phrase": "web_accessibility_specialists"}, {"score": 0.0041835168653521, "phrase": "pre-defined_definitions"}, {"score": 0.003891140864902669, "phrase": "communities'_understanding"}, {"score": 0.003841699919521703, "phrase": "relationship_accessibility"}, {"score": 0.0033660587983313536, "phrase": "user_experience"}, {"score": 0.0025947642929906407, "phrase": "user-centred_practices"}, {"score": 0.002561752783323717, "phrase": "accessibility_evaluation"}, {"score": 0.0024969812322112174, "phrase": "source_code"}, {"score": 0.002362192695471035, "phrase": "web_content_accessibility_guidelines"}, {"score": 0.0021968238865548812, "phrase": "ux_professionals"}, {"score": 0.002159623311924437, "phrase": "automated_evaluation_tools"}, {"score": 0.0021049977753042253, "phrase": "website_evaluations"}], "paper_keywords": ["web accessibility", " definition", " usability", " user experience"], "paper_abstract": "The equality of access - accessibility - is difficult to quantify, define, or agree upon. Our previous work analysed the responses of web accessibility specialists in regard to a number of pre-defined definitions of accessibility. While uncovering much, this analysis did not allow us to quantify the communities' understanding of the relationship accessibility has with other domains and assess how the community scopes accessibility. In this case, we asked over 300 people, with an interest in accessibility, to answer 33 questions surrounding the relationship between accessibility, user experience (UX), and usability; inclusion and exclusion; and evaluation, in an attempt to harmonise our understanding of web accessibility. We found that respondents think that accessibility and usability are highly related and also think that accessibility is applicable to everyone and not just people with disabilities. Respondents strongly agree that accessibility must be grounded on user-centred practices and that accessibility evaluation is more than just inspecting source code; however, they are divided as to whether training in 'Web Content Accessibility Guidelines' is necessary or not to assess accessibility. These perceptions are important for usability and UX professionals, developers of automated evaluation tools, and those practitioners running website evaluations.", "paper_title": "Exploring perceptions of web accessibility: a survey approach", "paper_id": "WOS:000347533500003"}