{"auto_keywords": [{"score": 0.009188901495247564, "phrase": "ga"}, {"score": 0.005676385760487479, "phrase": "nsga-ii_approach"}, {"score": 0.00481495049065317, "phrase": "ontology_alignments"}, {"score": 0.004662427600500598, "phrase": "novel_approach"}, {"score": 0.004563427013973105, "phrase": "multi-objective_evolutionary_algorithm"}, {"score": 0.004395185177346749, "phrase": "ontology_alignment_optimization_problem"}, {"score": 0.004210458358142504, "phrase": "genetic_algorithm"}, {"score": 0.003926626018798576, "phrase": "alignment_recall"}, {"score": 0.00366185681714204, "phrase": "experimental_results"}, {"score": 0.0032536902910768957, "phrase": "alignment_quality"}, {"score": 0.0032189132350239013, "phrase": "ga_approach"}, {"score": 0.0023950275815082297, "phrase": "average_improvement"}, {"score": 0.0021049977753042253, "phrase": "art_ontology_matching_systems"}], "paper_keywords": ["Ontology alignment", " MOEA/D", " Genetic Algorithm"], "paper_abstract": "This paper proposes a novel approach which uses a multi-objective evolutionary algorithm based on decomposition to address the ontology alignment optimization problem. Comparing with the approach based on Genetic Algorithm (GA), our method can simultaneously optimize three goals (maximizing the alignment recall, the alignment precision and the f-measure). The experimental results shows that our approach is able to provide various alignments in one execution which are less biased to one of the evaluations of the alignment quality than GA approach, thus the quality of alignments are obviously better than or equal to those given by the approach based on GA which considers precision, recall and f-measure only, and other multi-objective evolutionary approach such as NSGA-II approach. In addition, the performance of our approach outperforms NSGA-II approach with the average improvement equal to 32.79 . Through the comparison of the quality of the alignments obtained by our approach with those by the state of the art ontology matching systems, we draw the conclusion that our approach is more effective and efficient.", "paper_title": "Using MOEA/D for optimizing ontology alignments", "paper_id": "WOS:000339391000010"}