{"auto_keywords": [{"score": 0.015652257840821946, "phrase": "positive_or_negative_externalities"}, {"score": 0.012673965359570407, "phrase": "coalitional_games"}, {"score": 0.009612105607093973, "phrase": "coalition_structures"}, {"score": 0.00481495049065317, "phrase": "multi-agent_systems"}, {"score": 0.004721650963216763, "phrase": "multi-agent_coalition_formation"}, {"score": 0.004680764169296681, "phrase": "characteristic_function_games"}, {"score": 0.004366106816225457, "phrase": "partition_function_games"}, {"score": 0.004135010810625326, "phrase": "inter-coalitional_dependencies"}, {"score": 0.004090274535243564, "phrase": "coalition_formation"}, {"score": 0.004054832825293699, "phrase": "crucial_role"}, {"score": 0.003976203286249396, "phrase": "overlapping_goals"}, {"score": 0.0038906171474520756, "phrase": "first_computational_study"}, {"score": 0.003831801113154043, "phrase": "multi-agent_system_context"}, {"score": 0.0037493114715625784, "phrase": "exhaustive_and_disjoint_division"}, {"score": 0.003652656006084564, "phrase": "entire_system"}, {"score": 0.003275940081266134, "phrase": "first_csg_algorithm"}, {"score": 0.0031568884810273226, "phrase": "upper_and_lower_bounds"}, {"score": 0.0031023662967184216, "phrase": "disjoint_coalitions"}, {"score": 0.0030092017034068666, "phrase": "worst-case_guarantee"}, {"score": 0.002788313550931272, "phrase": "previous_csg_algorithms"}, {"score": 0.002583597507349819, "phrase": "worst-case_guarantees"}, {"score": 0.0023627765781617893, "phrase": "sandholm_et_al"}, {"score": 0.0022867821861135033, "phrase": "dang"}, {"score": 0.002276835817706181, "phrase": "jennings"}, {"score": 0.0021797112385590913, "phrase": "special_properties"}, {"score": 0.0021049977753042253, "phrase": "elsevier_b.v."}], "paper_keywords": ["Mechanism design", " Classification", " Game theory", " Approximation"], "paper_abstract": "Much of the literature on multi-agent coalition formation has focused on Characteristic Function Games, where the effectiveness of a coalition is not affected by how the other agents are arranged in the system. In contrast, very little attention has been given to the more general class of Partition Function Games, where the emphasis is on how the formation of one coalition could influence the performance of other co-existing coalitions in the system. However, these inter-coalitional dependencies, called externalities from coalition formation, play a crucial role in many real-world multi-agent applications where agents have either conflicting or overlapping goals. Against this background, this paper is the first computational study of coalitional games with externalities in the multi-agent system context. We focus on the Coalition Structure Generation (CSG) problem which involves finding an exhaustive and disjoint division of the agents into coalitions such that the performance of the entire system is optimized. While this problem is already very challenging in the absence of externalities, clue to the exponential size of the search space, taking externalities into consideration makes it even more challenging as the size of the input, given n agents, grows from O(2(n)) to O(n(n)). Our main contribution is the development of the first CSG algorithm for coalitional games with either positive or negative externalities. Specifically, we prove that it is possible to compute upper and lower bounds on the values of any set of disjoint coalitions. Building upon this, we prove that in order to establish a worst-case guarantee on solution quality it is necessary to search a certain set of coalition structures (which we define). We also show how to progressively improve this guarantee with further search. Since there are no previous CSG algorithms for games with externalities, we benchmark our algorithm against other state-of-the-art approaches in games where no externalities are present. Surprisingly, we find that, as far as worst-case guarantees are concerned, our algorithm outperforms the others by orders of magnitude. For instance, to reach a bound of 3 given 24 agents, the number of coalition structures that need to be searched by our algorithm is only 0.0007% of that needed by Sandholm et al. (1999) [1], and 0.5% of that needed by Dang and Jennings (2004) [2]. This is despite the fact that the other algorithms take advantage of the special properties of games with no externalities, while ours does not. (C) 2012 Elsevier B.V. All rights reserved.", "paper_title": "Anytime coalition structure generation in multi-agent systems with positive or negative externalities", "paper_id": "WOS:000304737300003"}