{"auto_keywords": [{"score": 0.014761647623557366, "phrase": "tsinghua_university"}, {"score": 0.014577052449016683, "phrase": "peking_university"}, {"score": 0.00481495049065317, "phrase": "independent_research"}, {"score": 0.00475413908468027, "phrase": "china's_top_universities"}, {"score": 0.004576253356889219, "phrase": "institutionally_independent_publications"}, {"score": 0.003663067281537946, "phrase": "aspects_covered_total_publication_outputs"}, {"score": 0.0034154440860550564, "phrase": "science_categories"}, {"score": 0.003026391655379905, "phrase": "peak-year_citations"}, {"score": 0.002664513608074113, "phrase": "top_three_most_productive_web"}, {"score": 0.0024527767211457046, "phrase": "applied_science"}, {"score": 0.0022578275190855124, "phrase": "article_life"}, {"score": 0.0021049977753042253, "phrase": "single_author_articles"}], "paper_keywords": ["Scientometrics", " Peak-year citations per publication", " h-Index", " Science indicators", " Web of science"], "paper_abstract": "The institutionally independent publications of Tsinghua University and Peking University were compared by two main indicators namely peak-year citations per publication and h-index, based on the data extracted from the Science Citation Index Expanded, Web of Science from 1974 to 2011. Analyzed aspects covered total publication outputs, annual production, impact, authorships, Web of Science categories, journals, and most cited articles. Results shows that the two universities were in the same scale based on the peak-year citations per publication, the h-index, and top cited articles with no less than 100 citations. Publication of the top three most productive Web of Science categories differed between these two universities. Tsinghua University published more articles in applied science and engineering fields, while Peking University had more basic science articles. In addition, article life was applied to compare the impact of the most cited articles and single author articles of the two universities.", "paper_title": "Comparison of independent research of China's top universities using bibliometric indicators", "paper_id": "WOS:000320401500016"}