{"auto_keywords": [{"score": 0.041451887954457124, "phrase": "real-time_control"}, {"score": 0.013842777419631818, "phrase": "rp-based_control"}, {"score": 0.01033983013771305, "phrase": "information_system"}, {"score": 0.00543827178830896, "phrase": "taguchi's_method"}, {"score": 0.005108491536774535, "phrase": "decision_maker"}, {"score": 0.004814951205790012, "phrase": "taguchi"}, {"score": 0.004695900553353526, "phrase": "review-period-based_operational_controls"}, {"score": 0.004565468027464384, "phrase": "flexible_manufacturing_systems"}, {"score": 0.004438642216475526, "phrase": "effective_tool"}, {"score": 0.004369705395855237, "phrase": "present_manufacturing_environment"}, {"score": 0.004342430078306461, "phrase": "enormous_research_efforts"}, {"score": 0.004195418010131832, "phrase": "superior_control_strategies"}, {"score": 0.003316942422872132, "phrase": "fms"}, {"score": 0.00307657476125683, "phrase": "rp_control"}, {"score": 0.0026384167183586015, "phrase": "lower_rf_level"}, {"score": 0.0025730425700096365, "phrase": "superior_control_strategy"}, {"score": 0.0025569530630374995, "phrase": "smaller_rp_size"}, {"score": 0.002470237978694949, "phrase": "control_strategy"}, {"score": 0.002447101794397243, "phrase": "maximum_relative_percentage_contributions"}, {"score": 0.002298288831092204, "phrase": "relative_percentage_contribution"}, {"score": 0.002234302525609801, "phrase": "fms."}, {"score": 0.0021182494144182805, "phrase": "fms_performance"}], "paper_keywords": ["control strategy", " flexible manufacturing system (FMS)", " review period (RP)", " routing flexibility (RF) levels", " Taguchi's method"], "paper_abstract": "Flexibility of flexible manufacturing systems (FMSs) has been considered as an effective tool to compete in the present manufacturing environment. Enormous research efforts have been made to harness the benefits of flexibility through superior control strategies. While modeling flexibility,and control strategies, researchers have mostly assumed an information system that can provide real-time control. Literature qualitatively reports that the real-time control can be highly capital intensive and difficult to achieve. This paper. focuses on FMS operating under review-period (RP)-based control and presents a combined. study of routing flexibility (RF), control strategies, and information system under Taguchi's method using simulation. RP-based control for FMS has been compared with real-time control. This paper contributes an approach for the decision maker to study the performance of an FMS operating under RP control and to identify the periodicity (time interval) of RP that will not deteriorate its performance in comparison to real-time control. It also helps the decision maker to reach a tradeoff between RP-based control and real-time control. The results show that RP-based control can be effectively implemented on an FMS having lower RF level. RP-based control can outperform real-time control with a superior control strategy and smaller RP size. The results under Taguchi's method suggest that the RF and control strategy should have maximum relative percentage contributions in FMS performance, whereas contribution of the RP (information system) should be minimum. Increasing the relative percentage contribution of the information system may deteriorate the performance of FMS. The information system is needed as a catalyst to facilitate the the contributions of other factors in improving the FMS performance and not its own contribution.", "paper_title": "Taguchi's method analysis of an FMS under review-period-based operational controls: Identification of control periodicity", "paper_id": "WOS:000244401800008"}