{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "macromedia_flash"}, {"score": 0.042291837632617076, "phrase": "descriptive_geometry"}, {"score": 0.004766683200410046, "phrase": "descriptive_geometry_teaching"}, {"score": 0.004695183699894267, "phrase": "growing_concern"}, {"score": 0.0038379074449947067, "phrase": "main_purpose"}, {"score": 0.00363080961099728, "phrase": "theoretical_knowledge"}, {"score": 0.003366233863411861, "phrase": "seven_forms"}, {"score": 0.002982307044758515, "phrase": "university_education"}, {"score": 0.002764856305713066, "phrase": "students'_learning_process"}, {"score": 0.0026554236621262515, "phrase": "interactive_observation"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["innovative learning", " macromedia flash", " multimedia animation", " descriptive geometry"], "paper_abstract": "The growing concern of teachers to improve their theoretical classes together with the revolution in content and methods brought about by the New Information Technologies combine to offer students a new more attractive, efficient and agreeable form of learning. The case of Descriptive Geometry (DG) is particularly special, since the main purpose of this subject is not only to provide students with theoretical knowledge of Geometry and Drawing, but also to enhance their spatial perception, one of the seven forms of intelligence and the most essential and vital one in the training of any engineer, but one which has not been sufficiently fomented in pre-university or university education during recent years. With these premises, and with the aim of accelerating the students' learning process, animations were developed that permit the interactive observation by the students of the most important topics of Descriptive Geometry. The software used in the development of the animations is Macromedia Flash; a tool that allows very small vectorial graphics files to be created, thus facilitating their electronic transmission to any user connected to the network. (C) 2005 Elsevier Ltd. All rights reserved.", "paper_title": "Interactive multimedia animation with macromedia flash in descriptive geometry teaching", "paper_id": "WOS:000247852800005"}