{"auto_keywords": [{"score": 0.04432938903369474, "phrase": "km_efforts"}, {"score": 0.018637747820310593, "phrase": "case_studies"}, {"score": 0.010612387000973441, "phrase": "km_performance_outcomes"}, {"score": 0.007404417998154783, "phrase": "performance_outcomes"}, {"score": 0.004556901872357751, "phrase": "knowledge_management"}, {"score": 0.004283019592801715, "phrase": "widely_accepted_measurement_criteria"}, {"score": 0.0037188360359702182, "phrase": "em_programme"}, {"score": 0.0035072146967082083, "phrase": "em_implementation"}, {"score": 0.003459191419478298, "phrase": "impressive_theoretical_and_empirical_support"}, {"score": 0.0033767221949228834, "phrase": "comprehensive_set"}, {"score": 0.0032848684681050745, "phrase": "five_key_dimensions"}, {"score": 0.0029416973901327925, "phrase": "new_questions"}, {"score": 0.002793380001054064, "phrase": "practical_implications"}, {"score": 0.002726740692380339, "phrase": "important_implications"}, {"score": 0.0026252106881752067, "phrase": "business_success"}, {"score": 0.0024842242921857705, "phrase": "organisational_performance"}, {"score": 0.0021864549336098778, "phrase": "km"}, {"score": 0.002163930783583212, "phrase": "right_perspective"}, {"score": 0.0021049977753042253, "phrase": "km_initiatives"}], "paper_keywords": ["knowledge management", " knowledge management systems"], "paper_abstract": "Purpose - This research attempts to comprehensively examine the criteria for measuring knowledge management (M performance outcomes in organisations. To date, no studies have provided a set of widely accepted measurement criteria associated with KM efforts. This paper, therefore, aims to fill the gap. Design/methodology/approach - This study was carried out by systematically reviewing the literature on KM performance outcomes. Case studies were carried out in two organisations identified to have a EM programme in place. Findings - A review of the literature indicates that there are 38 outcomes from EM implementation which have garnered impressive theoretical and empirical support. Based on this, a comprehensive set of performance outcomes is proposed and grouped into five key dimensions. The findings from the case studies indicate that this proposition is relevant. Research limitations/implications - The use of case studies limits the genteralisability of the findings, but it opens up new questions to be explored by further researching into the relationships between KM efforts and performance outcomes. Practical implications - Such significant findings will have important implications to organisations on how their KM efforts can be systematically measured for business success. To the academics, this paper provides insights into the relationship between KM efforts and organisational performance. Originality/value - This study is probably one of the first to comprehensively explain the criteria for measuring KM efforts in organisations. It is hoped that the findings of this study will encourage organisations to practise KM from the right perspective in order to reap the outcomes from KM initiatives.", "paper_title": "Criteria for measuring KM performance outcomes in organisations", "paper_id": "WOS:000240903500001"}