{"auto_keywords": [{"score": 0.040130255517357764, "phrase": "theoretical_structure"}, {"score": 0.01522524316457357, "phrase": "information_channels"}, {"score": 0.006914983752271393, "phrase": "text_models"}, {"score": 0.004153647187175639, "phrase": "environmental_systems"}, {"score": 0.0035498822293046884, "phrase": "modelling_process"}, {"score": 0.0034210342328868017, "phrase": "future_studies"}, {"score": 0.00288317238346065, "phrase": "text_systems"}, {"score": 0.0026651772919894534, "phrase": "information_source"}, {"score": 0.0026284507395498897, "phrase": "information_channel"}, {"score": 0.0025683581446365165, "phrase": "theoretical_findings"}, {"score": 0.002174303033371869, "phrase": "different_ways"}], "paper_keywords": ["Modelling", " Cybernetics", " Information systems", " Communication technologies"], "paper_abstract": "Purpose - The purpose of this paper is to study a theory of systems and their models on the basis of studying the information channels between their elements, meaning that it is a continuation of those studies already carried out on the theory of systems and their models applied to environmental systems. Design/methodology/approach - The model information transmission system (MITS). can be defined as the theoretical structure that makes it possible to describe the way information is stored and transmitted in a modelling process, and which will be completed in future studies. The basis for a taxonomy of languages is also presented. Findings - The theoretical structure described will lead to the study of a theory of information from the point of view of the analysis of text systems and models, but analysed within the theoretical structure presented, which includes the study of an information source and an information channel. Originality/value - These theoretical findings will improve the information channels used up to now for the study and modelling of systems and which are largely described using several computer programmes, as the information generated and transmitted will be studied and analysed in different ways. In this way, the text models and families of text models generated can be analysed by studying and transforming models, particularly by focusing attention on everything inherent to the information contained in the same.", "paper_title": "Model information transmission system", "paper_id": "WOS:000267416500036"}