{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "transformed_hidden_markov_models"}, {"score": 0.04966008989090485, "phrase": "elastic_motion_estimation"}, {"score": 0.04924496525218248, "phrase": "elastic_motion"}, {"score": 0.03725945632746808, "phrase": "probabilistic_model"}, {"score": 0.004669085371587273, "phrase": "nonrigid_motion"}, {"score": 0.004371160978838441, "phrase": "explicit_feature"}, {"score": 0.004092168350316413, "phrase": "spatial_smoothness"}, {"score": 0.004056334733843591, "phrase": "temporal_continuity"}, {"score": 0.003682207422331339, "phrase": "cluttered_features"}, {"score": 0.003101503914610488, "phrase": "individual_constraint"}, {"score": 0.0028652153774536967, "phrase": "error_propagation"}, {"score": 0.002682081928174866, "phrase": "unified_state"}, {"score": 0.002381365139274329, "phrase": "unique_explanation"}, {"score": 0.002298902547676131, "phrase": "spatiotemporal_constraints"}, {"score": 0.0022290883852844057, "phrase": "mthmm"}, {"score": 0.0021901485584955487, "phrase": "coherent_global_interpretation"}, {"score": 0.0021518875024104244, "phrase": "local_cluttered_edge_features"}], "paper_keywords": ["Elastic motion", " shape registration", " mixture models", " generative model"], "paper_abstract": "Elastic motion is a nonrigid motion constrained only by some degree of smoothness and continuity. Consequently, elastic motion estimation by explicit feature matching actually contains two correlated subproblems: shape registration and motion tracking, which account for spatial smoothness and temporal continuity, respectively. If we ignore their interrelationship, solving each of them alone will be rather challenging, especially when the cluttered features are involved. To integrate them into a probabilistic model, one straightforward approach is to draw the dependence between their hidden states. With regard to their separated states, there are, however, two different explanations of motion which are still made under the individual constraint of smoothness or continuity. Each one can be error-prone, and their coupling causes error propagation. Therefore, it is highly desirable to design a probabilistic model in which a unified state is shared by the two subproblems. This paper is intended to propose such a model, i.e., a Mixture of Transformed Hidden Markov Models (MTHMM), where a unique explanation of motion is made simultaneously under the spatiotemporal constraints. As a result, the MTHMM could find a coherent global interpretation of elastic motion from local cluttered edge features, and experiments show its robustness under ambiguities, data missing, and outliers.", "paper_title": "A Mixture of Transformed Hidden Markov Models for Elastic Motion Estimation", "paper_id": "WOS:000268996500008"}