{"auto_keywords": [{"score": 0.0500785296201053, "phrase": "organizational_culture"}, {"score": 0.010343436022982447, "phrase": "agile_methods"}, {"score": 0.004596295252559861, "phrase": "systems_development"}, {"score": 0.004456044928556639, "phrase": "specific_organizational_context"}, {"score": 0.004342430078306461, "phrase": "previous_research"}, {"score": 0.004102528738941734, "phrase": "deployment_systems_development_methods"}, {"score": 0.0037965243835456214, "phrase": "post-adoption_deployment"}, {"score": 0.0035866734383189396, "phrase": "theory_development_exercise"}, {"score": 0.002977419551510206, "phrase": "thirteen_new_hypotheses"}, {"score": 0.0028567126120064546, "phrase": "interesting_implications"}, {"score": 0.0027837615811247963, "phrase": "ad_hoc_development"}, {"score": 0.002740885774408238, "phrase": "traditional_systems_development_methods"}, {"score": 0.002643386043540555, "phrase": "conceptual_richness"}, {"score": 0.0023958326775913165, "phrase": "agile_systems_development"}, {"score": 0.002358917661465133, "phrase": "rich_and_interesting_research_topic"}, {"score": 0.002298649369775623, "phrase": "competing_values_model"}, {"score": 0.0021601997088758957, "phrase": "alternative_conceptions"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["Systems development", " Agile methods", " Organizational culture", " Competing Values Model"], "paper_abstract": "Context: Systems development normally takes place in a specific organizational context, including organizational culture. Previous research has identified organizational culture as a factor that potentially affects the deployment systems development methods. Objective: The purpose is to analyze the relationship between organizational culture and the post-adoption deployment of agile methods. Method: This study is a theory development exercise. Based on the Competing Values Model of organizational culture, the paper proposes a number of hypotheses about the relationship between organizational culture and the deployment: of agile methods. Results: Inspired by the agile methods thirteen new hypotheses are introduced and discussed. They have interesting implications, when contrasted with ad hoc development and with traditional systems development methods. Conclusion: Because of the conceptual richness of organizational culture and the ambiguity of the concept of agility the relationship between organizational culture and the deployment of agile systems development forms a rich and interesting research topic. Recognizing that the Competing Values Model represents just one view of organizational culture, the paper introduces a number of alternative conceptions and identifies several interesting paths for future research into the relationship between organizational culture and agile methods deployment. (C) 2010 Elsevier B.V. All rights reserved.", "paper_title": "The relationship between organizational culture and the deployment of agile methods", "paper_id": "WOS:000288919900008"}