{"auto_keywords": [{"score": 0.049517389162701646, "phrase": "multithreaded_architectures"}, {"score": 0.015719716506582538, "phrase": "multiprogrammed_workloads"}, {"score": 0.009224961045997217, "phrase": "fame"}, {"score": 0.003735349093835257, "phrase": "final_evaluation_result"}, {"score": 0.003626626504149897, "phrase": "current_evaluation_methodologies"}, {"score": 0.003541923233726252, "phrase": "representative_measurements"}, {"score": 0.003338690782620756, "phrase": "novel_ideas"}, {"score": 0.00314708280192844, "phrase": "potential_impact"}, {"score": 0.0030735451757603555, "phrase": "current_and_future_processor_designs"}, {"score": 0.002931569771634119, "phrase": "accurate_evaluation_methodology"}, {"score": 0.0026045914281028473, "phrase": "multithreaded_processors"}, {"score": 0.0023139986108451967, "phrase": "final_measurements"}, {"score": 0.0022201273900989416, "phrase": "previously_used_methodologies"}, {"score": 0.0021049977753042253, "phrase": "ideal_evaluation_methodology"}], "paper_keywords": ["Multithreaded processors", " multiprogrammed workloads", " evaluation methodologies"], "paper_abstract": "Multithreaded architectures are becoming more and more popular. In order to evaluate their behavior, several methodologies and metrics have been proposed. A methodology defines when the measurements for a given workload execution are taken. A metric combines those measurements to obtain a final evaluation result. However, since current evaluation methodologies do not provide representative measurements for these metrics, the analysis and evaluation of novel ideas could be either unfair or misleading. Given the potential impact of multithreaded architectures on current and future processor designs, it is crucial to develop an accurate evaluation methodology for them. This paper presents FAME, a new evaluation methodology aimed to fairly measure the performance of multithreaded processors executing multiprogrammed workloads. FAME reexecutes all programs in the workload until all of them are fairly represented in the final measurements taken. We compare FAME with previously used methodologies showing that it provides more accurate measurements, becoming an ideal evaluation methodology to analyze proposals for multithreaded architectures.", "paper_title": "On the Problem of Evaluating the Performance of Multiprogrammed Workloads", "paper_id": "WOS:000283718100013"}