{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "enterprise_credit_risk_assessment"}, {"score": 0.015468212049659142, "phrase": "support_vector_machine"}, {"score": 0.012204389767101505, "phrase": "better_performance"}, {"score": 0.011439057052466074, "phrase": "rsb-svm"}, {"score": 0.0045108906244892165, "phrase": "critical_topic"}, {"score": 0.004180234323211199, "phrase": "consistent_conclusions"}, {"score": 0.003937459891461576, "phrase": "multiple_classifiers"}, {"score": 0.0035507457285983268, "phrase": "new_hybrid_ensemble_approach"}, {"score": 0.003115908199991072, "phrase": "base_learner"}, {"score": 0.0026033756286033285, "phrase": "enterprise_credit_risk_dataset"}, {"score": 0.0023346234464901978, "phrase": "proposed_method"}, {"score": 0.00230932021677234, "phrase": "experimental_results"}, {"score": 0.0021987994275190314, "phrase": "alternative_method"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Enterprise credit risk assessment", " Ensemble learning", " Bagging", " Random subspace", " SVM"], "paper_abstract": "Enterprise credit risk assessment has long been regarded as a critical topic and many statistical and intelligent methods have been explored for this issue. However there are no consistent conclusions on which methods are better. Recent researches suggest combining multiple classifiers, i.e., ensemble learning, may have a better performance. In this paper, we propose a new hybrid ensemble approach, called RSB-SVM, which is based on two popular ensemble strategies, i.e., bagging and random subspace and uses Support Vector Machine (SVM) as base learner. As there are two different factors, i.e., bootstrap selection of instances and random selection of features, encouraging diversity in RSB-SVM, it would be advantageous to get better performance. The enterprise credit risk dataset, which includes 239 companies' financial records and is collected by the Industrial and Commercial Bank of China, is selected to demonstrate the effectiveness and feasibility of proposed method. Experimental results reveal that RSB-SVM can be used as an alternative method for enterprise credit risk assessment. (C) 2011 Elsevier Ltd. All rights reserved.", "paper_title": "A hybrid ensemble approach for enterprise credit risk assessment based on Support Vector Machine", "paper_id": "WOS:000301155300068"}