{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "virtual_surgery_navigation"}, {"score": 0.034827425020027954, "phrase": "magnetometer_triad"}, {"score": 0.030496638522030207, "phrase": "hard_iron_error"}, {"score": 0.004721893473387288, "phrase": "source-less_attitude_measurement_system"}, {"score": 0.00466085208934021, "phrase": "robust_heading_self-calibration_method"}, {"score": 0.004395742407834023, "phrase": "proposed_system"}, {"score": 0.004172722575842674, "phrase": "gravity_field"}, {"score": 0.003859146369720225, "phrase": "heading_calibration_procedure"}, {"score": 0.003194898129853895, "phrase": "random_sampling_consensus"}, {"score": 0.002610419798339639, "phrase": "accelerometer_triad"}, {"score": 0.0024297565926197505, "phrase": "soft_iron_matrix"}, {"score": 0.0023213398100616132, "phrase": "proposed_calibration_method"}, {"score": 0.0022177498761722773, "phrase": "experimental_results"}, {"score": 0.002132637840285576, "phrase": "proposed_method"}], "paper_keywords": [""], "paper_abstract": "A source-less attitude measurement system and robust heading self-calibration method for virtual surgery navigation is presented. The proposed system includes three accelerometers and three magnetometers to measure the gravity field and the geomagnetic filed to calculate the attitude. During the heading calibration procedure, both the magnetic field and gravity field are measured in all three axes with a set of combinations of attitudes. The set of measurements of magnetometer triad are first selected by random sampling consensus (RANSAC), and then are used to fit an ellipsoid to remove the hard iron error, finally the measurements of the magnetometer triad without the hard iron error and the measurements of accelerometer triad are rearranged to a set of equations to solve the soft iron matrix. Compared with other existing calibration method, the proposed calibration method does not require heading reference. Experimental results show the effectiveness of the proposed method and its potential application in virtual surgery navigation.", "paper_title": "Study on attitude measurement system for virtual surgery navigation", "paper_id": "WOS:000238089300152"}