{"auto_keywords": [{"score": 0.048647624313930694, "phrase": "total_tardiness"}, {"score": 0.03827193369444666, "phrase": "due_dates"}, {"score": 0.00481495049065317, "phrase": "neh"}, {"score": 0.004718509350356246, "phrase": "permutation_flowshop_scheduling_problem"}, {"score": 0.004623990904432388, "phrase": "johnson's_seminal_paper"}, {"score": 0.004562027986828209, "phrase": "scheduling_jobs"}, {"score": 0.0045160988337296605, "phrase": "permutation_flowshop"}, {"score": 0.004164858807302222, "phrase": "different_objectives"}, {"score": 0.003919404114585274, "phrase": "completion_time"}, {"score": 0.0037765536386719775, "phrase": "key_objective"}, {"score": 0.003751143724152193, "phrase": "manufacturing_companies"}, {"score": 0.0033898129842622536, "phrase": "approximate_procedures"}, {"score": 0.0033330581836898032, "phrase": "reasonable_computation_times"}, {"score": 0.003115354317501177, "phrase": "initial_solution"}, {"score": 0.0029714533918949798, "phrase": "decision_problem"}, {"score": 0.002805597755796506, "phrase": "different_related_decision_problems"}, {"score": 0.0026759663480185047, "phrase": "huge_number"}, {"score": 0.0025609496151442696, "phrase": "nehedd_heuristic"}, {"score": 0.002442594378453517, "phrase": "final_solution"}, {"score": 0.0024097920845706795, "phrase": "tie-breaking_mechanism"}, {"score": 0.0021921581733031514, "phrase": "original_nehedd"}, {"score": 0.0021049977753042253, "phrase": "elsevier_ltd."}], "paper_keywords": ["Scheduling", " Flowshop", " Heuristics", " NEH", " Tie-breaking mechanism", " Tardiness", " PFSP"], "paper_abstract": "Since Johnson's seminal paper in 1954, scheduling jobs in a permutation flowshop has been receiving the attention of hundreds of practitioners and researchers, being one of the most studied topics in the Operations Research literature. Among the different objectives that can be considered, minimising the total tardiness (i.e. the sum of the surplus of the completion time of each job over its due date) is regarded as a key objective for manufacturing companies, as it entails the fulfilment of the due dates committed to customers. Since this problem is known to be NP-hard, most research has focused on proposing approximate procedures to solve it in reasonable computation times. Particularly, several constructive heuristics have been proposed, with NEHedd being the most efficient one, serving also to provide an initial solution for more elaborate approximate procedures. In this paper, we first analyse in detail the decision problem depending on the generation of the due dates of the jobs, and discuss the similarities with different related decision problems. In addition, for the most characteristic tardiness scenario, the analysis shows that a huge number of ties appear during the construction of the solutions done by the NEHedd heuristic, and that wisely breaking the ties greatly influences the quality of the final solution. Since no tie-breaking mechanism has been designed for this heuristic up to now, we propose several mechanisms that are exhaustively tested. The results show that some of them outperform the original NEHedd by about 25% while keeping the same computational requirements. (C) 2015 Elsevier Ltd. All rights reserved.", "paper_title": "NEH-based heuristics for the permutation flowshop scheduling problem to minimise total tardiness", "paper_id": "WOS:000353730600003"}