{"auto_keywords": [{"score": 0.036254281392118955, "phrase": "shelf_divisors"}, {"score": 0.022363303003831214, "phrase": "dual_approximation_scheme"}, {"score": 0.010018518493910614, "phrase": "shelf_bin_packing_problem"}, {"score": 0.008427338670058546, "phrase": "different_classes"}, {"score": 0.007087067025311987, "phrase": "total_size"}, {"score": 0.00481495049065317, "phrase": "dual_approximation"}, {"score": 0.004759507166427077, "phrase": "class_constrained_bin_packing_problems."}, {"score": 0.0042388570312522, "phrase": "q_different_classes"}, {"score": 0.003702702337768558, "phrase": "different_shelves"}, {"score": 0.0035076666315744525, "phrase": "consecutive_shelves"}, {"score": 0.002993439939273828, "phrase": "shelf_packing"}, {"score": 0.0029361086955646625, "phrase": "n_bins"}, {"score": 0.002554406040896888, "phrase": "optimum_shelf_bin_packing_problem"}, {"score": 0.002345944657572499, "phrase": "maximum_given_weight"}, {"score": 0.0022481685132781626, "phrase": "bin_packing_problem"}], "paper_keywords": ["Bin packing", " approximation algorithms"], "paper_abstract": "In this paper we present a dual approximation scheme for the class constrained shelf bin packing problem. In this problem, we are given bins of capacity 1, and n items of Q different classes, each item e with class c(e) and size s(e). The problem is to pack the items into bins, such that two items of different classes packed in a same bin must be in different shelves. Items in a same shelf are packed consecutively. Moreover, items in consecutive shelves must be separated by shelf divisors of size d. In a shelf bin packing problem, we have to obtain a shelf packing such that the total size of items and shelf divisors in any bin is at most 1. A dual approximation scheme must obtain a shelf packing of all items into N bins, such that, the total size of all items and shelf divisors packed in any bin is at most 1 + epsilon for a given epsilon > 0 and N is the number of bins used in an optimum shelf bin packing problem. Shelf divisors are used to avoid contact between items of different classes and can hold a set of items until a maximum given weight. We also present a dual approximation scheme for the class constrained bin packing problem. In this problem, there is no use of shelf divisors, but each bin uses at most C different classes.", "paper_title": "A NOTE ON DUAL APPROXIMATION ALGORITHMS FOR CLASS CONSTRAINED BIN PACKING PROBLEMS", "paper_id": "WOS:000264879300005"}