{"auto_keywords": [{"score": 0.04652183999672111, "phrase": "wavelength_converters"}, {"score": 0.008733437061745163, "phrase": "np"}, {"score": 0.00481495049065317, "phrase": "line_optimal_wavelength_assignment"}, {"score": 0.004789510955557161, "phrase": "wdm"}, {"score": 0.004751419645257496, "phrase": "shared_wavelength_converter_pool"}, {"score": 0.004651501132938394, "phrase": "on-line_wavelength_assignment"}, {"score": 0.004626850025956576, "phrase": "wavelength-routed_wdm_networks"}, {"score": 0.0045901169723656194, "phrase": "unicast_and_multicast_traffic"}, {"score": 0.004493575209532812, "phrase": "conversion_ability"}, {"score": 0.004160252333194719, "phrase": "input_channels"}, {"score": 0.004018937750545835, "phrase": "minimum_number"}, {"score": 0.003965868037142592, "phrase": "unicast_traffic"}, {"score": 0.003481345268187289, "phrase": "best_known_existing_method"}, {"score": 0.00342622379167706, "phrase": "auxiliary_graph"}, {"score": 0.00338996021227886, "phrase": "dijkstra's_algorithm"}, {"score": 0.0031466043322866347, "phrase": "time_algorithm"}, {"score": 0.0030803293369203273, "phrase": "wdm_networks"}, {"score": 0.003063979184187375, "phrase": "arbitrary_topologies"}, {"score": 0.002747231491970157, "phrase": "multicast_traffic"}, {"score": 0.002696514237799097, "phrase": "optimal_multicast_light-tree"}, {"score": 0.002509486637787865, "phrase": "optimal_link-tree"}, {"score": 0.0023920477114211104, "phrase": "second_problem"}, {"score": 0.002267979909850878, "phrase": "new_multicast_conversion_model_with_which_the_output_of_the_wavelength_converter_is_split-table"}, {"score": 0.0021503332345216273, "phrase": "optimal_light-tree"}, {"score": 0.0021049977753042253, "phrase": "efficient_heuristics"}], "paper_keywords": ["multicast", " on-line algorithms", " optical networks", " routing", " shared wavelength converter pool", " unicast", " wavelength assignment", " wavelength conversion", " wavelength division multiplexing (WDM)"], "paper_abstract": "In this paper, we study on-line wavelength assignment in wavelength-routed WDM networks under both unicast and multicast traffic where nodes in the networks have wavelength conversion ability. Since wavelength converters are still expensive and difficult to implement, we consider the case where nodes in networks have only a limited number of converters that are shared by all input channels. We study the problem of setting up connections in such networks using minimum number of wavelength converters. For unicast traffic, we first study the problem of setting up a lightpath on a given link-path with minimum number of conversions. We give a simple algorithm that solves it in O(tk) time where t is the number of links on the path and k is the number of wavelengths per fiber, as compared to the best known existing method that needs to construct an auxiliary graph and apply the Dijkstra's algorithm. We also consider the problem of setting up a lightpath while using wavelength converters at nodes with fewer available converters only when necessary, and give an O(tk) time algorithm. We then generalize this technique to WDM networks with arbitrary topologies and give an algorithm that sets up an optimal lightpath network-wide in O(Nk + Lk) time, where N and L are the number of nodes and links in the network, respectively. We also consider multicast traffic in this paper. Finding an optimal multicast light-tree is known to be NP-hard and is usually solved by first finding a link-tree then finding a light-tree on the link-tree. Finding an optimal link-tree is also NP-hard and has been extensively studied. Thus, we focus on the second problem which is to set up a light-tree on a given link-tree with minimum number of conversions. We propose a new multicast conversion model with which the output of the wavelength converter is split-table to save the usage of converters. We show that under this model the problem of setting up an optimal light-tree is NP-hard and then give efficient heuristics to solve it approximately.", "paper_title": "On-line optimal wavelength assignment in WDM networks with shared wavelength converter pool", "paper_id": "WOS:000244410300019"}