{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "topic_models"}, {"score": 0.040918691207282594, "phrase": "on-line_users"}, {"score": 0.039248806804460544, "phrase": "authorship_attribution"}, {"score": 0.004561826854638056, "phrase": "anonymous_texts"}, {"score": 0.004298666679374568, "phrase": "formal_texts"}, {"score": 0.0035965032173588753, "phrase": "traditional_authorship_attribution"}, {"score": 0.003352388337911934, "phrase": "candidate_authors"}, {"score": 0.003245359940011418, "phrase": "traditional_settings"}, {"score": 0.003057910095857785, "phrase": "author_representations"}, {"score": 0.0029602552900111407, "phrase": "novel_ways"}, {"score": 0.0023712394008737958, "phrase": "informal_texts"}, {"score": 0.002246292543825748, "phrase": "experimental_results"}, {"score": 0.0021745003291048356, "phrase": "topical_author_representations"}, {"score": 0.0021049977753042253, "phrase": "sentiment_polarity"}], "paper_keywords": [""], "paper_abstract": "Authorship attribution deals with identifying the authors of anonymous texts. Traditionally, research in this field has focused on formal texts, such as essays and novels, but recently more attention has been given to texts generated by on-line users, such as e-mails and blogs. Authorship attribution of such on-line texts is a more challenging task than traditional authorship attribution, because such texts tend to be short, and the number of candidate authors is often larger than in traditional settings. We address this challenge by using topic models to obtain author representations. In addition to exploring novel ways of applying two popular topic models to this task, we test our new model that projects authors and documents to two disjoint topic spaces. Utilizing our model in authorship attribution yields state-of-the-art performance on several data sets, containing either formal texts written by a few authors or informal texts generated by tens to thousands of on-line users. We also present experimental results that demonstrate the applicability of topical author representations to two other problems: inferring the sentiment polarity of texts, and predicting the ratings that users would give to items such as movies.", "paper_title": "Authorship Attribution with Topic Models", "paper_id": "WOS:000338196000003"}