{"auto_keywords": [{"score": 0.03411562592509389, "phrase": "parasocial_interaction"}, {"score": 0.012950256385072452, "phrase": "continuance_intention"}, {"score": 0.011295847480896551, "phrase": "dependency_relations"}, {"score": 0.00481495049065317, "phrase": "user_gratification"}, {"score": 0.004745665541429529, "phrase": "individuals'_social_network_services_usage"}, {"score": 0.004610058444728656, "phrase": "user_loyalty"}, {"score": 0.004576763709613412, "phrase": "continued_use"}, {"score": 0.0043345662747335065, "phrase": "social_network_services"}, {"score": 0.004180234323211199, "phrase": "research_model"}, {"score": 0.004135010810625326, "phrase": "individuals'_use_motivations"}, {"score": 0.003681923235979914, "phrase": "snss-related_behaviors"}, {"score": 0.0036288825833675127, "phrase": "online_users'_motivations"}, {"score": 0.003537918197274043, "phrase": "msd"}, {"score": 0.003048782877550259, "phrase": "snss_usage"}, {"score": 0.0029294420752976947, "phrase": "individuals'_continuance_intention"}, {"score": 0.0027143926774929957, "phrase": "strong_support"}, {"score": 0.002684984491718288, "phrase": "six_hypotheses"}, {"score": 0.002627117999049202, "phrase": "individuals'_motivations"}, {"score": 0.0024342079318127423, "phrase": "positive_effect"}, {"score": 0.0023903999901926224, "phrase": "subsequently_continuance_intention"}, {"score": 0.0022884433286785165, "phrase": "small_but_negative_moderating_effect"}, {"score": 0.0021049977753042253, "phrase": "future_research"}], "paper_keywords": ["social network services", " media system dependency theory", " uses and gratifications theory", " habit", " continuance intention"], "paper_abstract": "User loyalty or continued use is critical to the survival and development of any website. Focusing on the social network services (SNSs) context, this study proposes a research model for investigating individuals' use motivations and the moderating role of habit with regard to gratification and continuance intention. This research integrates two influential media communication theories, media system dependency (MSD) and uses and gratifications, to examine SNSs-related behaviors. To comprehend online users' motivations in depth, three motivations derived from MSD (understanding, orientation and play dependency relations) are operationalized as reflective, second-order constructs. The three motivations are theorized to affect parasocial interaction positively, and parasocial interaction is hypothesized to positively affect the gratification that individuals derive from SNSs usage. Furthermore, this study hypothesizes that gratification positively affects individuals' continuance intention. Finally, we theorize that habit moderates the impact of gratification on continuance intention. Data collected from 657 Facebook users provide strong support for all six hypotheses. The results indicate that individuals' motivations (i.e., the understanding, orientation and play dependency relations) positively affect parasocial interaction, which in turn has a positive effect on gratification, and subsequently continuance intention. In addition, the results show that habit has a small but negative moderating effect on the relationship between gratification and continuance intention. Implications for theory and practice are discussed, and suggestions are made for future research.", "paper_title": "Examining the antecedents of user gratification and its effects on individuals' social network services usage: the moderating role of habit", "paper_id": "WOS:000358273400005"}