{"auto_keywords": [{"score": 0.05007852962010532, "phrase": "open_access"}, {"score": 0.015341490429331818, "phrase": "civil_engineering"}, {"score": 0.008619305928633492, "phrase": "scholarly_publications"}, {"score": 0.007005697937794276, "phrase": "impact_factor"}, {"score": 0.004561375989607799, "phrase": "second_quartile"}, {"score": 0.004447669334871974, "phrase": "peer-reviewed_journals"}, {"score": 0.004426121293851201, "phrase": "third_quartile"}, {"score": 0.004315771670213371, "phrase": "scientific_publications"}, {"score": 0.004292212137716459, "phrase": "international_journals"}, {"score": 0.0034009367367442175, "phrase": "non-open_access_articles"}, {"score": 0.0031154588507211972, "phrase": "oa_and_non_oa_articles"}, {"score": 0.003022953256776468, "phrase": "scopus"}, {"score": 0.0030064589038932476, "phrase": "google"}, {"score": 0.0028695630268370897, "phrase": "oa_articles"}, {"score": 0.0027919765821119006, "phrase": "observed_period"}, {"score": 0.002738914205394527, "phrase": "significance_level"}, {"score": 0.002679501909303057, "phrase": "wos_and_scopus_the_articles"}, {"score": 0.002592784882557155, "phrase": "non_oa_articles"}, {"score": 0.0021994343316143125, "phrase": "sufficient_condition"}, {"score": 0.0021049977753042253, "phrase": "high_impact"}], "paper_keywords": ["Scholarly publications", " Civil engineering", " Open access", " Citation"], "paper_abstract": "The development of science is accompanied by growth of scholarly publications, primarily in the form of articles in peer-reviewed journals. Scientific work is often evaluated through the number of scientific publications in international journals and their citations. This article discusses the impact of open access (OA) on the number of citations for an institution from the field of civil engineering. We analyzed articles, published in 2007 in 14 international journals with impact factor, which are included in the Journal Citation Reports subject category \"Civil Engineering\". The influence of open access on the number of citations was analyzed. The aim of our research was to determine if open access articles from the field of civil engineering receive more citations than non-open access articles. Based on the value of impact factor and ranking in quartiles, we also looked at the influence of the rank of journals on the number of citations, separately for OA and Non OA articles, in databases Web of Science (WOS), Scopus and Google Scholar. For 2,026 studied articles we found out that 22 % of them were published as OA articles. They received 29 % of all citations in the observed period. We can conclude by the significance level 5 % or less that in the databases WOS and Scopus the articles from top ranked journals (first quartile) achieved more citations than Non OA articles. This argument can be confirmed for some other journals from second quartile as well, while for the journals ranked into the third quartile it can't be confirmed. This could be confirmed only partly for journals from the second quartile, and would not be confirmed for journals ranked into the third quartile. This shows that open access is not a sufficient condition for citation, but increases the number of citations for articles published in journals with high impact.", "paper_title": "Impact of open access on citation of scholarly publications in the field of civil engineering", "paper_id": "WOS:000330622600015"}