{"auto_keywords": [{"score": 0.04728622032431744, "phrase": "color_stabilization"}, {"score": 0.00481495049065317, "phrase": "color_stabilization_along_time"}, {"score": 0.00388165472334023, "phrase": "color_correction_chain"}, {"score": 0.0038407203087210775, "phrase": "digital_camera"}, {"score": 0.0036167509502276294, "phrase": "source_image"}, {"score": 0.003578600071301459, "phrase": "reference_image"}, {"score": 0.0030414140732789186, "phrase": "pixel_value"}, {"score": 0.002793874145713024, "phrase": "pixel_correspondences"}, {"score": 0.0026214978443388653, "phrase": "parameter_values"}, {"score": 0.0022674379203603224, "phrase": "wide_range"}, {"score": 0.0021049977753042253, "phrase": "amateur_video"}], "paper_keywords": ["Color stabilisation", " color transfer", " color image analysis", " color matching"], "paper_abstract": "We propose a method for color stabilization of shots of the same scene, taken under the same illumination, where one image is chosen as reference and one or several other images are modified so that their colors match those of the reference. We make use of two crucial but often overlooked observations: first, that the core of the color correction chain in a digital camera is simply a multiplication by a 3x3 matrix; second, that to color-match a source image to a reference image we do not need to compute their two color correction matrices, it is enough to compute the operation that transforms one matrix into the other. This operation is a 3x3 matrix as well, which we call H. Once we have H, we just multiply by it each pixel value of the source and obtain an image which matches in color the reference. To compute H we only require a set of pixel correspondences, we do not need any information about the cameras used, neither models nor specifications or parameter values. We propose an implementation of our framework which is very simple and fast, and show how it can be successfully employed in a number of situations, comparing favorably with the state of the art. There is a wide range of applications of our technique, both for amateur and professional photography and video: color matching for multicamera TV broadcasts, color matching for 3D cinema, color stabilization for amateur video, etc.", "paper_title": "Color Stabilization Along Time and Across Shots of the Same Scene, for One or Several Cameras of Unknown Specifications", "paper_id": "WOS:000209737800002"}